{"interestingcomments": [{"autor": "jaapv", "date": "2011-01-21 11:27:00", "content": " Question: What is a good way to sharpen my images? Answer: Q Many users still use single-pass sharpening. Nowadays we know that , for maximum quality, we need a multi-pass sharpening workflow. If you apply single-pass sharpening you are attempting to account for image source, image content and output process in a single round of sharpening. Mulitipass sharpening takes account of the sometimes contradictory requirements of the different steps in sharpening. To begin with we need a content optimized master image that can be used in further processing to apply creative sharpening and the finally sharpening for specific output. I will take the case for ACR/CS5 because that is what I am used to. Always work at 100% or larger! The object of this capture sharpening is to create an artefact-free ( as far as possible) optimally sharpened file to process further. The image content can be divided in three types: high-frequency images ( think of a landscape with plenty of leafy trees, large amounts of small detail) and low-frequency images ( portraits with smooth skin) and mixed images. The three require different approaches. The main tool here is the radius slider: The higher the frequency, the lower the setting 0.5 to 1.0 Low frequency images require settings between 1.0 and 1.5 That is about the maximum you can use. Typical amount settings would be 15-30 for M9 files, 5-20 for M8 files. The obvious problem is the mixed image. Think eyes and eybrows/hair in that low-frequence portrait.. There are several approaches. 1. Set the radius to 1.0 and try to correct in Photoshop 2. Set for low frequency in sharpening and use the correction brush on areas that need more detail 3. Make two smart objects for different frequencies and blend with a layer mask in Photoshop. You can (in ACR 6.0) create an edge mask using the masking sider. Enlarge to at least 100% and hold the ALT key whilst sliding. You can see where the sharpening will be masked. Then you can bring back detail by using the detail slider in the same way. It is not a simple slider, because it influences a number of parameters. Never mind what it does, the results are quite visible. Then you can switch back and use the clarity slider to enhance your settings. Don't forget you have local control with the adjustment brush. When you are in Photoshop you can sharpen creatively by enhancing areas. You can either use the sharpening brush or make a layer, (over)sharpen it, use a layer mask and play with opacity. In general, always sharpen on a layer, to work non-destructively. There is also the trick of setting USM to a radius of 50 and threshold to 1, using the amount slider for control (normally around 20) to get midtone contrast enhancement to bring out extra detail, but I digress When you have the image to your taste you flatten it and go to output sharpening. For printing you can use your Scott Kelby technique (*) and learn the optimum setting by trial and error or you can delve into the theory and set the sharpening haloes mathematically. The avantage is that you have an optimally sharpened image to start with so you won't have any nasty surprises. (*) Use Unsharp Mask to taste and go to \"fade unsharp mask\" in the edit menu and fade 100% on Luminosity Lightroom works a bit differently, but I do not have the expertise to explain that clearly . LR addition by Marquinius Lightroom works mostly like you describe. When you are used to the ACR (the RAW editor upon opening a photo in photoshop), you'll get used to LR in a jiffy. For sharpening you have the same tools, to be found under DETAIL. What I do (in simple steps): 1) I import a photo in LR with the standard primary sharpening (very low, just to get rid of the softness resulting from RAW). 2) I work the photo until it's \"perfect\" (all conversions, editing, even side stepping to CS, whatever) BUT (and this is important) WITHOUT any further sharpening. 3) I make a virtual duplicate of the edited photo 4) I start my sharpening on this virtual, following the same logic Jaap just described. In this way you always keep the unsharpened image separate from the sharpened ones: printing for screen asks for a different approach the sharpening for print (and for print you can even go to small print/big print, soft paper, toned paper, whatever). You use the unsharpened photo as a starting point. Of course you could make a snapshot and return to that point every time you want to sharpen for a different output, but the you'd overwrite previous efforts. Follow-up question: How do I prepare an image for display on this forum? Answer: My favorite technique is to set the crop tool to 960 px wide (and 640 px high if desired) and crop the full image. Then add Unsharp Mask at maybe a 15-30 amount at radius 1.0 and threshold 0 for a bit of sparkle. Go to Edit, fade Unsharp Mask, choose \"Luminosity\" in the pull-down menu. Save as JPG using a quality that gives a maximum file size between 200 and 300 Kb, max 360 Kb.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/3/?tab=comments#comment-2464088", "origin": "L-forum", "suborigin": "216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": " question: what is a good way to sharpen my images? answer: q many users still use single-pass sharpening. nowadays we know that , for maximum quality, we need a multi-pass sharpening workflow. if you apply single-pass sharpening you are attempting to account for image source, image content and output process in a single round of sharpening. mulitipass sharpening takes account of the sometimes contradictory requirements of the different steps in sharpening. to begin with we need a content optimized master image that can be used in further processing to apply creative sharpening and the finally sharpening for specific output. i will take the case for acr/cs5 because that is what i am used to. always work at 100% or larger! the object of this capture sharpening is to create an artefact-free ( as far as possible) optimally sharpened file to process further. the image content can be divided in three types: high-frequency images ( think of a landscape with plenty of leafy trees, large amounts of small detail) and low-frequency images ( portraits with smooth skin) and mixed images. the three require different approaches. the main tool here is the radius slider: the higher the frequency, the lower the setting 0.5 to 1.0 low frequency images require settings between 1.0 and 1.5 that is about the maximum you can use. typical amount settings would be 15-30 for m9 files, 5-20 for m8 files. the obvious problem is the mixed image. think eyes and eybrows/hair in that low-frequence portrait.. there are several approaches. 1. set the radius to 1.0 and try to correct in photoshop 2. set for low frequency in sharpening and use the correction brush on areas that need more detail 3. make two smart objects for different frequencies and blend with a layer mask in photoshop. you can (in acr 6.0) create an edge mask using the masking sider. enlarge to at least 100% and hold the alt key whilst sliding. you can see where the sharpening will be masked. then you can bring back detail by using the detail slider in the same way. it is not a simple slider, because it influences a number of parameters. never mind what it does, the results are quite visible. then you can switch back and use the clarity slider to enhance your settings. don't forget you have local control with the adjustment brush. when you are in photoshop you can sharpen creatively by enhancing areas. you can either use the sharpening brush or make a layer, (over)sharpen it, use a layer mask and play with opacity. in general, always sharpen on a layer, to work non-destructively. there is also the trick of setting usm to a radius of 50 and threshold to 1, using the amount slider for control (normally around 20) to get midtone contrast enhancement to bring out extra detail, but i digress when you have the image to your taste you flatten it and go to output sharpening. for printing you can use your scott kelby technique (*) and learn the optimum setting by trial and error or you can delve into the theory and set the sharpening haloes mathematically. the avantage is that you have an optimally sharpened image to start with so you won't have any nasty surprises. (*) use unsharp mask to taste and go to \"fade unsharp mask\" in the edit menu and fade 100% on luminosity lightroom works a bit differently, but i do not have the expertise to explain that clearly . lr addition by marquinius lightroom works mostly like you describe. when you are used to the acr (the raw editor upon opening a photo in photoshop), you'll get used to lr in a jiffy. for sharpening you have the same tools, to be found under detail. what i do (in simple steps): 1) i import a photo in lr with the standard primary sharpening (very low, just to get rid of the softness resulting from raw). 2) i work the photo until it's \"perfect\" (all conversions, editing, even side stepping to cs, whatever) but (and this is important) without any further sharpening. 3) -----> i !!!  -----> make !!!  a virtual duplicate of the edited photo 4) -----> i !!!  start my sharpening on this virtual, following the same logic jaap just described. in this way you always keep the unsharpened image separate from the sharpened ones: printing for screen asks for a different approach the sharpening for print (and for print you can even go to small print/big print, soft paper, toned paper, whatever). you use the unsharpened photo as a starting point. of course you could make a snapshot and return to that point every time you want to sharpen for a different output, but the you'd overwrite previous efforts. follow-up question: how do i prepare an image for display on this forum? answer: my favorite technique is to set the crop tool to 960 px wide (and 640 px high if desired) and crop the full image. then add unsharp mask at maybe a 15-30 amount at radius 1.0 and threshold 0 for a bit of sparkle. go to edit, fade unsharp mask, choose \"luminosity\" in the pull-down menu. save as jpg using a quality that gives a maximum file size between 200 and 300 kb, max 360 kb.", "sortedWord": "None", "Identifyer": null, "identifyer": 17204, "year": "2011"}, {"autor": "SoarFM", "date": "2011-09-02 19:50:00", "content": "Thank you Julien!! Just sat down with my M9-P that was of at infinity and the lenses where front-focusing. Took me about 1 hour, but now it's 99%. Have a 50 summilux on order so will wait and see how that looks ;o) If that one is off I might send in the kit anyway. But great to know how to make the rough adjustment yourself. Again thank you! +1 to Julian Focusing with my 50 Summicron was giving me fits with its backfocus. Never felt there was a problem with my M6, but then again, lots easier to get the immediate feedback when working digital. The 35 and 28 were less of a problem due to their shorter focal lengths. But I cycled them through my testing just to make sure it wasn't a faulty lens. I was dreading packing everything up and sending them off for service. I read through this thread multiple times, decided I could do this and promised myself I would stop if it didn't go as advertised, this is a skill well worth having. All went well, and I'm making adjustments that have gotten me almost to perfect. One more session it should be spot on. As an additional note, the slot on the screw was placed differently than shown on Julian's, a more favorable placement obviating the need to grind down the screwdriver.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1782952", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "thank you julien!! just sat down with my m9-p that was of at infinity and the lenses where front-focusing. took me about 1 hour, but now it's 99%. have a 50 summilux on order so will wait and see how that looks ;o) if that one is off i might send in the kit anyway. but great to know how to make the rough adjustment yourself. again thank you! +1 to julian focusing with my 50 summicron was giving me fits with its backfocus. never felt there was a problem with my m6, but then again, lots easier to get the immediate feedback when working digital. the 35 and 28 were less of a problem due to their shorter focal lengths. but i cycled them through my testing just to make sure it wasn't a faulty lens. i was dreading packing everything up and sending them off for service. i read through this thread multiple times, decided i could do this and promised myself i would stop if it didn't go as advertised, this is a skill well worth having. all went well, and -----> i !!! 'm -----> making !!!  adjustments that have gotten me almost to perfect. one more session it should be spot on. as an additional note, the slot on the screw was placed differently than shown on julian's, a more favorable placement obviating the need to grind down the screwdriver.", "sortedWord": "None", "Identifyer": null, "identifyer": 30796, "year": "2011"}, {"autor": "PhilipThomas", "date": "2011-10-03 16:53:00", "content": "Julian- Thank you for your post. This solved my M9 back focusing very quickly and your instructions were very well detailed. Just another helpful tip though it may sound obvious. Do not use the camera display to check image tests, download them to your PC and check. The camera LCD is just not up to snuff to zoom in and calibrate. Brett - --img--  I know this is not for everyone and that's not what I'm saying - my aim in posting is to share the work I have done and the successes I have had with my own adjustments. It is very nice to know how to tweak one's own camera very quickly if necessary. It is nice to remove the 'aura' from the rangefinder mechanism in one's own mind and kind of feel at one with it. That's all. So Jamie - this is the explanation I posted a little while back along with a couple of pics for you to look at. As adil says you need to take a sample of shots from every lens (and body if possible) you have to make sure you're calibrating it right. You will need a 2.5mm allen key and a small screwdriver which you should grind a very slight angle on so that as you fit the screwdriver into the head on the focus throw pivot (A) on the diagram it allows a nice flat drive. A) is the focus throw adjustment. If you look at the pic you can see that the screw retains an eccentric cam. If you loosen the screw you can rotate the cam (as denoted by the pink and blue arrows) freely. As you do so, the length of the arm itself changes. By moving the cam counter-clockwise (as in pink arrow) you INCREASE the total available focus throw. By moving the cam clockwise (as in blue arrow) you DECREASE the total available focus throw. --img--  is the infinity adjustment as we know. If you rotate the 2.5mm hex key counter clockwise (as in green arrow) you move the point at which the rangefinder 'sees' infinity further away - and this 'references everything forward of that. If you rotate the 2.5mm hex key clockwise (as in yellow arrow) you move the point at which the rangefinder 'sees' infinity closer to you - and this 'references everything forward of that. Right - so they are the two adjustments you have available to you. From my playing about the best way to set it up is this. 1) Infinity is very important. Step 1 is to look at something with lots of contrast a long way off (a star does seem to work very well but today I've been using a clock tower in the far distance and that's fine too) and then adjust the roller (--img--  so that this perfectly coincides. Don't accept the nonesense I was spouting before about it not mattering. It really matters that you can 100% converge the object at infinity. 2) Now, take a photo at a big aperture of something close to you - like 0.8 meters or similar. I found text to be excellent. Note whether you now have front focus or back focus. If you have front focus (like I did - big time!) then your focus throw is too short; ie your arm is too long, so when the lens rotates you're not pushing the rangefinder enough. So you need to shorten the arm by loosening (A) and twisting the cam slightly anti-clockwise. (If you have backfocus then it's obviously the inverse and you need to go clockwise to lengthen the arm and reduce your focus throw). 3) Now, recheck infinity. It will now be wrong, because you have now moved the arm and so the roller wheel has also moved. But this is not a problem - just recorrect infinity as in 1) above to compensate for the altered focus throw. 4) Repeat step 2. You will see that the focus point has altered. Whether it has moved too little or too much will calibrate your hand/eye as to how much you need to make the adjustments but in general I made positive, but not excessive tweaks each time. 5) When you are happy with the infinity and close settings you want to shoot some images off that are at various distances just to make sure that everything is right. On my setup which consists of all current model lenses (not sure if this is relevent) I did not have to compensate with any kind of compromise here. When my infinity setting is right and the focus throw is perfect the transgression from near to far is linear and my lenses are sharp right the way through the range. I suppose that if this were not the case or if your lenses varied then you'd need to get them recalibrated, or maybe accept a compromise setting. Hope that's helpful. Have fun", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1808819", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "julian- thank you for your post. this solved my m9 back focusing very quickly and your instructions were very well detailed. just another helpful tip though it may sound obvious. do not use the camera display to check image tests, download them to your pc and check. the camera lcd is just not up to snuff to zoom in and calibrate. brett - --img--  i know this is not for everyone and that's not what i'm saying - my aim in posting is to share the work i have done and the successes i have had with my own adjustments. it is very nice to know how to tweak one's own camera very quickly if necessary. it is nice to remove the 'aura' from the rangefinder mechanism in one's own mind and kind of feel at one with it. that's all. so jamie - this is the explanation i posted a little while back along with a couple of pics for you to look at. as adil says you need to take a sample of shots from every lens (and body if possible) you have to make sure you're calibrating it right. you will need a 2.5mm allen key and a small screwdriver which you should grind a very slight angle on so that as you fit the screwdriver into the head on the focus throw pivot (a) on the diagram it allows a nice flat drive. a) is the focus throw adjustment. if you look at the pic you can see that the screw retains an eccentric cam. if you loosen the screw you can rotate the cam (as denoted by the pink and blue arrows) freely. as you do so, the length of the arm itself changes. by moving the cam counter-clockwise (as in pink arrow) you increase the total available focus throw. by moving the cam clockwise (as in blue arrow) you decrease the total available focus throw. --img--  is the infinity adjustment as we know. if you rotate the 2.5mm hex key counter clockwise (as in green arrow) you move the point at which the rangefinder 'sees' infinity further away - and this 'references everything forward of that. if you rotate the 2.5mm hex key clockwise (as in yellow arrow) you move the point at which the rangefinder 'sees' infinity closer to you - and this 'references everything forward of that. right - so they are the two adjustments you have available to you. from my playing about the best way to set it up is this. 1) infinity is very important. step 1 is to look at something with lots of contrast a long way off (a star does seem to work very well but today i've been using a clock tower in the far distance and that's fine too) and then adjust the roller (--img--  so that this perfectly coincides. don't accept the nonesense i was spouting before about it not mattering. it really matters that you can 100% converge the object at infinity. 2) now, take a photo at a big aperture of something close to you - like 0.8 meters or similar. i found text to be excellent. note whether you now have front focus or back focus. if you have front focus (like i did - big time!) then your focus throw is too short; ie your arm is too long, so when the lens rotates you're not pushing the rangefinder enough. so you need to shorten the arm by loosening (a) and twisting the cam slightly anti-clockwise. (if you have backfocus then it's obviously the inverse and you need to go clockwise to lengthen the arm and reduce your focus throw). 3) now, recheck infinity. it will now be wrong, because you have now moved the arm and so the roller wheel has also moved. but this is not a problem - just recorrect infinity as in 1) above to compensate for the altered focus throw. 4) repeat step 2. you will see that the focus point has altered. whether it has moved too little or too much will calibrate your hand/eye as to how much you need to make the adjustments but in general -----> i !!!  -----> made !!!  positive, but not excessive tweaks each time. 5) when you are happy with the infinity and close settings you want to shoot some images off that are at various distances just to make sure that everything is right. on my setup which consists of all current model lenses (not sure if this is relevent) i did not have to compensate with any kind of compromise here. when my infinity setting is right and the focus throw is perfect the transgression from near to far is linear and my lenses are sharp right the way through the range. i suppose that if this were not the case or if your lenses varied then you'd need to get them recalibrated, or maybe accept a compromise setting. hope that's helpful. have fun", "sortedWord": "None", "Identifyer": null, "identifyer": 30799, "year": "2011"}, {"autor": "Jon Pop", "date": "2011-10-26 22:50:00", "content": " Hello, I just purchased a Zeiss 35mm Biogon C f2.8 lens, heard lots of great things about it and it was a good price. What I'm wondering is the preferred setting for the lens profile - I know I could 'play around and experiment' myself, but if someone out there who is an avid M9 user (I'm new to the M9, usually using my MP) has come up with the best lens profile to pick from the M9 menu, I'd love to know. I don't want to pixel peep for hours looking around. I have the latest firmware. I notice that the Summarit 35 f2.5 isn't in the lens profile (it has the closest minimum aperture so I'd thought about using that one). I've heard some say 'use the 35mm f2 summicron pre-asph', but wanted to ask the question anyway. I want to get the best performance from this lovely lens on my M9; don't want to blame vignetting or anything like that on the lens when I've simply not picked the best profile. Nor am I interested in performing lots of post-production corrections. I appreciate everyone's advice! Cheers, Jon", "link": "https://www.l-camera-forum.com/topic/164943-advice-please-zeiss-biogon-c-35mm-f28-best-lens-code/?tab=comments#comment-1827428", "origin": "L-forum", "suborigin": "164943-advice-please-zeiss-biogon-c-35mm-f28-best-lens-code", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " hello, i just purchased a zeiss 35mm biogon c f2.8 lens, heard lots of great things about it and it was a good price. what i'm wondering is the preferred setting for the lens profile - i know i could 'play around and experiment' myself, but if someone out there who is an avid m9 user (i'm new to the m9, usually using my mp) has -----> come !!!  -----> up !!!  -----> with !!!  the best lens profile to pick from the m9 menu, i'd love to know. i don't want to pixel peep for hours looking around. i have the latest firmware. i notice that the summarit 35 f2.5 isn't in the lens profile (it has the closest minimum aperture so i'd thought about using that one). i've heard some say 'use the 35mm f2 summicron pre-asph', but wanted to ask the question anyway. i want to get the best performance from this lovely lens on my m9; don't want to blame vignetting or anything like that on the lens when i've simply not picked the best profile. nor am i interested in performing lots of post-production corrections. i appreciate everyone's advice! cheers, jon", "sortedWord": "None", "Identifyer": null, "identifyer": 31582, "year": "2011"}, {"autor": "M. Valdemar", "date": "2011-04-16 17:50:00", "content": "The chip that communicates levels data with the camera has absolutely nothing to do with overcharging protection. There is another bit of circuitry that ALL Lithium Ion batteries have that cuts off the charge to a trickle when battery is overcharging. The AC charger itself also has this protection. You have a better chance of winning the lottery than having a battery ignite in your camera. That is a foolish scare story. I don't think you could find even one instance of that happening with an M8 or an M9. The Made-in-China \"genuine\" Leica battery was likely made in the same factory or of the same components as the no-name battery. The Leica battery perhaps cost a fraction of a cent more than the \"no-name\" to put the \"Leica\" name on it. The only difference? Leica marks up their battery for $149 over cost and the \"no-name\" battery is marked up for about $10 over cost. The accessories are a profit center for Leica, which I do not begrudge them, but let's not exaggerate. I would make a good educated guess that both Leica and no-name batteries cost about $6 to manufacture. You should not post imaginary stories about explosions and ignitions. PS: What \"ethics\"? The batteries would not be sold if there was no profit. Why is it unethical to buy a non-Leica battery? This is just silly talk. Yes - but these chips have another function as well. Every LiIon battery must have safeguards against overcharging-overheating, because it can ignite violently. With a no-name battery you have no guaranty nor recourse, should it happen. It hasn't happened to Leica batteries, but it has to laptops and Olympus. So pick your gamble. --img--  Quite apart from the ethical point that it does not take a genius to figure out under what labour circumstances these batteries must have been made to sell at this price. Edited April 16, 2011 by M. Valdemar", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/3/?tab=comments#comment-1647631", "origin": "L-forum", "suborigin": "148213-non-leica-m9-battery-test", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "the chip that communicates levels data with the camera has absolutely nothing to do with overcharging protection. there is another bit of circuitry that all lithium ion batteries have that cuts off the charge to a trickle when battery is overcharging. the ac charger itself also has this protection. you have a better chance of winning the lottery than having a battery ignite in your camera. that is a foolish scare story. i don't think you could find even one instance of that happening with an m8 or an m9. the made-in-china \"genuine\" leica battery was likely made in the same factory or of the same components as the no-name battery. the leica battery perhaps cost a fraction of a cent more than the \"no-name\" to put the \"leica\" name on it. the only difference? leica marks up their battery for $149 over cost and the \"no-name\" battery is marked up for about $10 over cost. the accessories are a profit center for leica, which i do not begrudge them, but let's not exaggerate. -----> i !!!  -----> would !!!  -----> make !!!  a good educated guess that both leica and no-name batteries cost about $6 to manufacture. you should not post imaginary stories about explosions and ignitions. ps: what \"ethics\"? the batteries would not be sold if there was no profit. why is it unethical to buy a non-leica battery? this is just silly talk. yes - but these chips have another function as well. every liion battery must have safeguards against overcharging-overheating, because it can ignite violently. with a no-name battery you have no guaranty nor recourse, should it happen. it hasn't happened to leica batteries, but it has to laptops and olympus. so pick your gamble. --img--  quite apart from the ethical point that it does not take a genius to figure out under what labour circumstances these batteries must have been made to sell at this price. edited april 16, 2011 by m. valdemar", "sortedWord": "None", "Identifyer": null, "identifyer": 32369, "year": "2011"}, {"autor": "Washington", "date": "2011-04-17 16:08:00", "content": "Oh, jappv, Another interesting think about Chinese industry is that unlike what we did during the*'’industrial revolution’’ they came up with the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. Pretty smart…. think of all the crowding that solves.", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/4/?tab=comments#comment-1648253", "origin": "L-forum", "suborigin": "148213-non-leica-m9-battery-test", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "oh, jappv, another interesting think about chinese industry is that unlike what we did during the*'’industrial revolution’’ they -----> came !!!  -----> up !!!  -----> with !!!  the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. pretty smart…. think of all the crowding that solves.", "sortedWord": "None", "Identifyer": null, "identifyer": 32388, "year": "2011"}, {"autor": "haroldp", "date": "2011-04-20 17:00:00", "content": "Oh, jappv, Another interesting think about Chinese industry is that unlike what we did during the*'’industrial revolution’’ they came up with the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. Pretty smart…. think of all the crowding that solves. Then the factory sites concentrate for infrastructure like roads and power grids and become the new 'cities'. Think Detroit, Chicago, Denver etc. Cheers .... H", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/4/?tab=comments#comment-1651171", "origin": "L-forum", "suborigin": "148213-non-leica-m9-battery-test", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "oh, jappv, another interesting think about chinese industry is that unlike what we did during the*'’industrial revolution’’ they -----> came !!!  -----> up !!!  -----> with !!!  the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. pretty smart…. think of all the crowding that solves. then the factory sites concentrate for infrastructure like roads and power grids and become the new 'cities'. think detroit, chicago, denver etc. cheers .... h", "sortedWord": "None", "Identifyer": null, "identifyer": 32392, "year": "2011"}, {"autor": "Jeff S", "date": "2011-08-13 23:44:00", "content": "Half the pixel info is in the highest zone; three fourths is in the highest two zones. Not like in the film days. Generally better to capture it IMO and have it there for PP if necessary. ETTR doesn't mean that the pic should printed as it comes out of the camera. It also depends dynamic range of the scene, noise considerations, etc. But, generally speaking, I prefer to give myself more options to be creative after the shot, as long as I don't create undesirable effects in the process. At the end of the day, whatever works for you to get the print you want. Jeff", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/?tab=comments#comment-1764829", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i don't create", "selectorShort": "create", "MarkedSent": "half the pixel info is in the highest zone; three fourths is in the highest two zones. not like in the film days. generally better to capture it imo and have it there for pp if necessary. ettr doesn't mean that the pic should printed as it comes out of the camera. it also depends dynamic range of the scene, noise considerations, etc. but, generally speaking, -----> i !!!  prefer to give myself more options to be creative after the shot, as long as -----> i !!!  -----> do !!! -----> n't !!!  -----> create !!!  undesirable effects in the process. at the end of the day, whatever works for you to get the print you want. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 32545, "year": "2011"}, {"autor": "denoir", "date": "2011-08-14 14:46:00", "content": " No, ETTR refers to exposing to the right, before blowing the highlights. One needs to know his/her camera and histogram reading to do this effectively. The M9 hasn't turned digital logic on its head (as I wrote earlier regarding the M8); most of the pixel info still resides in the higher zones. And again, that doesn't mean ETTR is right for everyone or for every scene, but the logic still holds, even for the M9. It's a matter of good execution. That's why I carry a pocket meter for tricky light; otherwise I know my camera and its limitations (M8.2 for me). Jeff Of course the logic is the same but it's still not a good idea due to 1) ETTR makes in practice relatively little difference 2) The M8/M9 have limited headroom in the highlights so you risk blowing them beyond recovery. In essence chances are that you'll do more damage than good. On a Canon 5DII for instance on the other hand you have a lot of latitude in the highlights and very little in the shadows (including the infamous noise banding at low ISO) so ETTR can be useful. It has however more to do where the mid point of the latitude span is rather than because of the linear nature of camera sensors. If you are well within the dynamic range of the camera AND have sufficient light to use low ISO then by all means ETTR to your heart's content. However very often having light enough for low ISO and the scene having limited dynamic range are mutually exclusive. So it's not a generally good principle when the camera output has limited capability of highlight recovery. May I re-phrase the question from the other side: Does the M8/M9 tolerate ETTR better or worse than other cameras? Worse because you are at higher risk of blowing the highlights beyond recovery. Edited August 14, 2011 by denoir", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/2/?tab=comments#comment-1765294", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "[idea, makes]", "selectorShort": "idea", "MarkedSent": " No, ETTR refers to exposing to the right, before blowing the highlights. One needs to know his/her camera and histogram reading to do this effectively. The M9 hasn't turned digital logic on its head (as I wrote earlier regarding the M8); most of the pixel info still resides in the higher zones. And again, that doesn't mean ETTR is right for everyone or for every scene, but the logic still holds, even for the M9. It's a matter of good execution. That's why I carry a pocket meter for tricky light; otherwise I know my camera and its limitations (M8.2 for me). Jeff Of course the logic is the same but it's still not a good idea due to 1) ETTR makes in practice relatively little difference 2) The M8/M9 have limited headroom in the highlights so you risk blowing them beyond recovery. In essence chances are that you'll do more damage than good. On a Canon 5DII for instance on the other hand you have a lot of latitude in the highlights and very little in the shadows (including the infamous noise banding at low ISO) so ETTR can be useful. It has however more to do where the mid point of the latitude span is rather than because of the linear nature of camera sensors. If you are well within the dynamic range of the camera AND have sufficient light to use low ISO then by all means ETTR to your heart's content. However very often having light enough for low ISO and the scene having limited dynamic range are mutually exclusive. So it's not a generally good principle when the camera output has limited capability of highlight recovery. May I re-phrase the question from the other side: Does the M8/M9 tolerate ETTR better or worse than other cameras? Worse because you are at higher risk of blowing the highlights beyond recovery. Edited August 14, 2011 by denoir", "sortedWord": "None", "Identifyer": null, "identifyer": 32569, "year": "2011"}, {"autor": "Muizen", "date": "2011-08-15 06:45:00", "content": "The many reactions to my question to whether or not ETTR, has left me somewhat confused. Perhaps I am looking for a rule I could adopt, but such a rule is not possible because of the strongly varying light circumstances? Some key opinions (although taken out of context) - ETTR is recommended by Reichman - ETTR should be avoided (Hans) - Underexposing with half a stop yields perfect results (horoso) - M9 does not tolerate ETTR better or worse than other cameras (denoir) - ETTR mostly a waste of time (Sandy/Keithu) - Meter normally for the M9 mostly all the time (= no ETTR) (dwbell) - ETTR but constrained to not blown highlights ((k-hawinkler) - For the M9 (ETTR) is not a good idea (denoir) - Reichmans article makes perfect sense in situations where there is plenty of light..ETTR is mythical. M9 handles underexposure spectacularly well, despite the theory (Blakley) As a result of this interesting discussion I tend to conclude that ETTR (and it goes without saying: without blowing highlights) is not better than exposing normally with perhaps a tendency to some underexposing. But that much depends on the available light.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/3/?tab=comments#comment-1765825", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "[idea, makes]", "selectorShort": "idea", "MarkedSent": "The many reactions to my question to whether or not ETTR, has left me somewhat confused. Perhaps I am looking for a rule I could adopt, but such a rule is not possible because of the strongly varying light circumstances? Some key opinions (although taken out of context) - ETTR is recommended by Reichman - ETTR should be avoided (Hans) - Underexposing with half a stop yields perfect results (horoso) - M9 does not tolerate ETTR better or worse than other cameras (denoir) - ETTR mostly a waste of time (Sandy/Keithu) - Meter normally for the M9 mostly all the time (= no ETTR) (dwbell) - ETTR but constrained to not blown highlights ((k-hawinkler) - For the M9 (ETTR) is not a good idea (denoir) - Reichmans article makes perfect sense in situations where there is plenty of light..ETTR is mythical. M9 handles underexposure spectacularly well, despite the theory (Blakley) As a result of this interesting discussion I tend to conclude that ETTR (and it goes without saying: without blowing highlights) is not better than exposing normally with perhaps a tendency to some underexposing. But that much depends on the available light.", "sortedWord": "None", "Identifyer": null, "identifyer": 32586, "year": "2011"}, {"autor": "ajayc", "date": "2011-08-16 01:57:00", "content": "First time posting on this forum, looks like there is quite a lot going on with ETTR and exposure. Hans, your data is showing that the M9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the ISO / gain range). All good cameras behave in a narrow band when it comes to this.. From a sensor output stanpoint, ETTR (if this not explained somewhere else already): Take for instance, your favorite M9, 1. The ADC (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the M9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the ADC assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. So, purest black: 00 0000 0000 0000 ( 'd0: short hand for decimal 0), Purest white: 11 1111 1111 1111 ('d16383). In practice, the purest black and purest white are not exactly at the ends of this range, but somewhat lower than the ends of this range. Now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). If you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (I used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. With the severity of underexposure, more of the upper half of the tonal range gets shifted. However, the problem arises when this \"RAW\" data from the sensor needs to be gamma mapped (i.e the sensor response needs to be mapped to what a human eye sees). Now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), RAW converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie we are asking to create information out of thin air. The histogram can be shifted, but it is like adding more light to a certain part of the histogram. If one is not careful, subtle shifts in tonality are lost. RAW converters / onboard processing has come a long way in this regards. And the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black level. Also, one doesn't want to lift the shadows too much because of noise concerns (usually at low gain settings, sensor circuitry tends to be noisier, and hence lower S/N ratio). Also, some sensors try to allocate extra information at the ends of the tonal range. From a sensor perspective, does ETTR help? Yes and no. It largely depends on the scene histogram distribution, photographic goals and noise / tonality concerns. If a scene has large shadow areas, one might be better off exploiting this technique (without blowing out the highlights). If the scene is uniformly distributed, then there is very little to achieve by ETTR. Through this simple shifting of bits around, color tonality gets affected. Human eyes are exceptional at perceiving shifts in color tonality than what the current state of art cameras can achieve. Also, RAW developers are starting to develop floating point arithmetic for RAW analysis. This should help with some of these issues. There is no free lunch. --img--  With a mathematical model of the M9, much can be taken out of the guesswork. The accurate model that I have, contains all existing kinds of noise, Photon Noise, Sensor noise, A/D Noise, Photo response non uniform etc. giving a reliable picture of the Signal to Noise of the complete camera. I have calculated the noise of the two combinations ISO 160/320 and ISO 800/1600, in both cases the lower ISO value with “normal” exposure and the higher ISO value with +1 stop ETTR. First the graphical representation of both combinations, where yellow is the higher and magenta is the lower ISO value of the two. On the horizontal axis, 13 is the highest or lightest level, just before overexposure. Going to the left is decreasing the luminance. On the vertical axis is the Signal to Noise in stops. Zero means that the signal is just as strong as the noise, and 6 means that the signal is 2exp6 = 64 times stronger as the noise. [ATTACH]273092[/ATTACH] The graphs are roughly showing that the S/N is the same for all luminance values when the higher ISO value is exposed with +1 stop ETTR. For instance the yellow dot at Luminance 7 has the same S/N as the Magenta dot at Luminance 6, and so on. But the graphs are not accurate enough to show the exact difference. So here are the S/N values at the Luminance levels 12 –7 for ISO 160, compared to S/N at the Luminance levels 13-8 ( +1 stop ETTR ) for ISO 320. [ATTACH]273094[/ATTACH] At lower Luminance levels (darker area’s) there is an absolute insignificant S/N advantage of 0,05 stops in favor of ISO 320 with +1 stop ETTR. At the higher Luminance levels (lighter area’s) there is no difference at all. Now for ISO 800 and ISO 1600. [ATTACH]273095[/ATTACH] Although the S/N in absolute value is worse than at ISO 160/320, the relative value between S/N at ISO 800 is exactly the same as the S/N value at ISO 1600 with 1 stop ETTR. There is simply no difference. When just looking at noise, the conclusion is: Instead of shifting the exposure +1 stop ETTR, one can just as well go one Stop down in ISO without overexposure. This is true for low as well as high ISO values, and it is true over the whole range from light to dark. According to Sandy, there is a negative effect of ETTR on color reproduction. ETTR should therefore be avoided. Hans", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/3/?tab=comments#comment-1766815", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "we are asking to create", "selectorShort": "create", "MarkedSent": "first time posting on this forum, looks like there is quite a lot going on with ettr and exposure. hans, your data is showing that the m9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the iso / gain range). all good cameras behave in a narrow band when it comes to this.. from a sensor output stanpoint, ettr (if this not explained somewhere else already): take for instance, your favorite m9, 1. the adc (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the m9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the adc assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. so, purest black: 00 0000 0000 0000 ( 'd0: short hand for decimal 0), purest white: 11 1111 1111 1111 ('d16383). in practice, the purest black and purest white are not exactly at the ends of this range, but somewhat lower than the ends of this range. now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). if you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (i used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. with the severity of underexposure, more of the upper half of the tonal range gets shifted. however, the problem arises when this \"raw\" data from the sensor needs to be gamma mapped (i.e the sensor response needs to be mapped to what a human eye sees). now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), raw converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie -----> we !!!  -----> are !!!  -----> asking !!!  -----> to !!!  -----> create !!!  information out of thin air. the histogram can be shifted, but it is like adding more light to a certain part of the histogram. if one is not careful, subtle shifts in tonality are lost. raw converters / onboard processing has come a long way in this regards. and the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black level. also, one doesn't want to lift the shadows too much because of noise concerns (usually at low gain settings, sensor circuitry tends to be noisier, and hence lower s/n ratio). also, some sensors try to allocate extra information at the ends of the tonal range. from a sensor perspective, does ettr help? yes and no. it largely depends on the scene histogram distribution, photographic goals and noise / tonality concerns. if a scene has large shadow areas, one might be better off exploiting this technique (without blowing out the highlights). if the scene is uniformly distributed, then there is very little to achieve by ettr. through this simple shifting of bits around, color tonality gets affected. human eyes are exceptional at perceiving shifts in color tonality than what the current state of art cameras can achieve. also, raw developers are starting to develop floating point arithmetic for raw analysis. this should help with some of these issues. there is no free lunch. --img--  with a mathematical model of the m9, much can be taken out of the guesswork. the accurate model that i have, contains all existing kinds of noise, photon noise, sensor noise, a/d noise, photo response non uniform etc. giving a reliable picture of the signal to noise of the complete camera. i have calculated the noise of the two combinations iso 160/320 and iso 800/1600, in both cases the lower iso value with “normal” exposure and the higher iso value with +1 stop ettr. first the graphical representation of both combinations, where yellow is the higher and magenta is the lower iso value of the two. on the horizontal axis, 13 is the highest or lightest level, just before overexposure. going to the left is decreasing the luminance. on the vertical axis is the signal to noise in stops. zero means that the signal is just as strong as the noise, and 6 means that the signal is 2exp6 = 64 times stronger as the noise. [attach]273092[/attach] the graphs are roughly showing that the s/n is the same for all luminance values when the higher iso value is exposed with +1 stop ettr. for instance the yellow dot at luminance 7 has the same s/n as the magenta dot at luminance 6, and so on. but the graphs are not accurate enough to show the exact difference. so here are the s/n values at the luminance levels 12 –7 for iso 160, compared to s/n at the luminance levels 13-8 ( +1 stop ettr ) for iso 320. [attach]273094[/attach] at lower luminance levels (darker area’s) there is an absolute insignificant s/n advantage of 0,05 stops in favor of iso 320 with +1 stop ettr. at the higher luminance levels (lighter area’s) there is no difference at all. now for iso 800 and iso 1600. [attach]273095[/attach] although the s/n in absolute value is worse than at iso 160/320, the relative value between s/n at iso 800 is exactly the same as the s/n value at iso 1600 with 1 stop ettr. there is simply no difference. when just looking at noise, the conclusion is: instead of shifting the exposure +1 stop ettr, one can just as well go one stop down in iso without overexposure. this is true for low as well as high iso values, and it is true over the whole range from light to dark. according to sandy, there is a negative effect of ettr on color reproduction. ettr should therefore be avoided. hans", "sortedWord": "None", "Identifyer": null, "identifyer": 32601, "year": "2011"}, {"autor": "t024484", "date": "2011-08-16 17:04:00", "content": "First time posting on this forum Welcome to the forum There are a number of misconceptions in your posting that I will try to anwer. your data is showing that the M9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the ISO / gain range). All good cameras behave in a narrow band when it comes to this.. Shot noise only plays a role in the 6 most brightest luminance stops, but even there other types of noise are contributing as well. At the highest luminance level noise is completely dominated by Photo response non uniformity. But on ETTR all this has no relevance. Take for instance, your favorite M9. The ADC (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the M9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the ADC assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. The m9 has an 14 bit a/d, but the dynamic range of the sensor is only 12 bit, and only at ISO 160. For each doubling of the ISO value this dynamic range is halved or 1 bit less. But no screen or printed output is capable of displaying 12 stops and that is why we can correct for exposure because, depending on ISO, (large) parts of the available information are 'unused'. Now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). If you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (I used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. Not just some of the levels, but all of them. Now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), If an underexposed scene is corrected for exposure, the whole histogram goes to the right. Stretching occurs when increasing contrast. RAW converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie we are asking to create information out of thin air. All the information is there, it is just shifted to the right, multipied with an exposure correction factor. No interpolation no guesswork. The histogram can be shifted, but it is like adding more light to a certain part of the histogram. If one is not careful, subtle shifts in tonality are lost. not certain parts are shifted, but everything will be shifted keeping all ratios intact. RAW converters / onboard processing has come a long way in this regards. And the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black levelSome sensors try to allocate extra information at the ends of the tonal range. Through this simple shifting of bits around, color tonality gets affected. This all happens not to be the case. Hans", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/4/?tab=comments#comment-1767376", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "we are asking to create", "selectorShort": "create", "MarkedSent": "first time posting on this forum welcome to the forum there are a number of misconceptions in your posting that i will try to anwer. your data is showing that the m9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the iso / gain range). all good cameras behave in a narrow band when it comes to this.. shot noise only plays a role in the 6 most brightest luminance stops, but even there other types of noise are contributing as well. at the highest luminance level noise is completely dominated by photo response non uniformity. but on ettr all this has no relevance. take for instance, your favorite m9. the adc (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the m9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the adc assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. the m9 has an 14 bit a/d, but the dynamic range of the sensor is only 12 bit, and only at iso 160. for each doubling of the iso value this dynamic range is halved or 1 bit less. but no screen or printed output is capable of displaying 12 stops and that is why we can correct for exposure because, depending on iso, (large) parts of the available information are 'unused'. now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). if you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (i used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. not just some of the levels, but all of them. now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), if an underexposed scene is corrected for exposure, the whole histogram goes to the right. stretching occurs when increasing contrast. raw converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie -----> we !!!  -----> are !!!  -----> asking !!!  -----> to !!!  -----> create !!!  information out of thin air. all the information is there, it is just shifted to the right, multipied with an exposure correction factor. no interpolation no guesswork. the histogram can be shifted, but it is like adding more light to a certain part of the histogram. if one is not careful, subtle shifts in tonality are lost. not certain parts are shifted, but everything will be shifted keeping all ratios intact. raw converters / onboard processing has come a long way in this regards. and the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black levelsome sensors try to allocate extra information at the ends of the tonal range. through this simple shifting of bits around, color tonality gets affected. this all happens not to be the case. hans", "sortedWord": "None", "Identifyer": null, "identifyer": 32610, "year": "2011"}, {"autor": "enchong", "date": "2011-08-12 19:13:00", "content": "Had my M9 for 2 months and came up with some black and white pics from my last US trip...simply amazing camera Flickr: Enchong's Photostream i love my M9!!! should i go M9-P??? hehehehe enchong", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/8/?tab=comments#comment-1763742", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "had my m9 for 2 months and -----> came !!!  -----> up !!!  -----> with !!!  some black and white pics from my last us trip...simply amazing camera flickr: enchong's photostream i love my m9!!! should i go m9-p??? hehehehe enchong", "sortedWord": "None", "Identifyer": null, "identifyer": 36766, "year": "2011"}, {"autor": "mikelevitt", "date": "2011-02-05 17:30:00", "content": "I don't think so. Even though the mirror goes up, you aren't blinded, and can easily see the pre flash in the room, with your peripheral vision, or with your other eye. I absolutely cannot see a pre-flash with Canon, and it is really obvious with the Leica. Just FYI, I am shooting the Mark 4 and Mark 3S cameras. I have no idea how the consumer Canon bodies handle it because I don't use them. There is something else going on here, I'm guessing drastically slower processing, or less than optimal design of the circuit. Maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. Only a photographer would know how a perceptible pre-flash would ruin a shot. Let's face it, some genius designer came up with the utterly worthless red eye reduction! So here's my conclusion. If you need to shoot people photos with the M9 and flash on the camera and don't want to have them blinking, don't use TTL with the M9. Other techniques (off camera) and methods (auto mode) seem to work better. I'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. I am not a guy who spends a lot of time reading or posting on forums, I just go when I need information. The TTL is not working for me. Whether it works for you depends on your expectations and the way you work. Mike", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1579170", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i don't think so. even though the mirror goes up, you aren't blinded, and can easily see the pre flash in the room, with your peripheral vision, or with your other eye. i absolutely cannot see a pre-flash with canon, and it is really obvious with the leica. just fyi, i am shooting the mark 4 and mark 3s cameras. i have no idea how the consumer canon bodies handle it because i don't use them. there is something else going on here, i'm guessing drastically slower processing, or less than optimal design of the circuit. maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. only a photographer would know how a perceptible pre-flash would ruin a shot. let's face it, some genius designer -----> came !!!  -----> up !!!  -----> with !!!  the utterly worthless red eye reduction! so here's my conclusion. if you need to shoot people photos with the m9 and flash on the camera and don't want to have them blinking, don't use ttl with the m9. other techniques (off camera) and methods (auto mode) seem to work better. i'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. i am not a guy who spends a lot of time reading or posting on forums, i just go when i need information. the ttl is not working for me. whether it works for you depends on your expectations and the way you work. mike", "sortedWord": "None", "Identifyer": null, "identifyer": 37784, "year": "2011"}, {"autor": "menos I M6", "date": "2011-02-06 05:09:00", "content": "… Maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. Only a photographer would know how a perceptible pre-flash would ruin a shot. Let's face it, some genius designer came up with the utterly worthless red eye reduction! So here's my conclusion. If you need to shoot people photos with the M9 and flash on the camera and don't want to have them blinking, don't use TTL with the M9. Other techniques (off camera) and methods (auto mode) seem to work better. I'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. I am not a guy who spends a lot of time reading or posting on forums, I just go when I need information. The TTL is not working for me. Whether it works for you depends on your expectations and the way you work. Mike Mike, I don't think, somebody let the intern design the Leica variant of TTL flashes or the cameras circuitry, to communicate. We are talking about Metz, a company, which does flash for quite a time and Leica, a renowned lens, camera and fashion maker, not Sony. The way, I see the lack in the Leica flashes, compared to Canon and Nikon products is just this: flash is an afterthought in development for the Leica M. Not the majority of Leica M users uses flash, if TTL flash at all. Flash has no priority. For Canon and Nikon, flash is essential. The pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need AND A RACE between the two companies, to improve their already market leading performance. Why should Leica pair with Metz and compete with the performance of Canon and Nikon with flash? It is not Leica's main market. That time was in the 50's. And even back then, the M was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. The people, who might want to use TTL flash opposed to manual or Auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. It is like it is and the SF58 is the best solution, if one needs TTL on a Leica (the only others being a set of Metz items or the SF24D). I use Nikon and love the simple fully automated and spot on Nikon metering and TTL flash, when I want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). I bought the SF58, to expand the poor low light performance of the M8.2 sensor, to use lower ISO in very dark scenes. It does the job - sort of (still learning/ fighting).", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1579602", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "… maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. only a photographer would know how a perceptible pre-flash would ruin a shot. let's face it, some genius designer -----> came !!!  -----> up !!!  -----> with !!!  the utterly worthless red eye reduction! so here's my conclusion. if you need to shoot people photos with the m9 and flash on the camera and don't want to have them blinking, don't use ttl with the m9. other techniques (off camera) and methods (auto mode) seem to work better. i'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. i am not a guy who spends a lot of time reading or posting on forums, i just go when i need information. the ttl is not working for me. whether it works for you depends on your expectations and the way you work. mike mike, i don't think, somebody let the intern design the leica variant of ttl flashes or the cameras circuitry, to communicate. we are talking about metz, a company, which does flash for quite a time and leica, a renowned lens, camera and fashion maker, not sony. the way, i see the lack in the leica flashes, compared to canon and nikon products is just this: flash is an afterthought in development for the leica m. not the majority of leica m users uses flash, if ttl flash at all. flash has no priority. for canon and nikon, flash is essential. the pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need and a race between the two companies, to improve their already market leading performance. why should leica pair with metz and compete with the performance of canon and nikon with flash? it is not leica's main market. that time was in the 50's. and even back then, the m was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. the people, who might want to use ttl flash opposed to manual or auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. it is like it is and the sf58 is the best solution, if one needs ttl on a leica (the only others being a set of metz items or the sf24d). i use nikon and love the simple fully automated and spot on nikon metering and ttl flash, when i want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). i bought the sf58, to expand the poor low light performance of the m8.2 sensor, to use lower iso in very dark scenes. it does the job - sort of (still learning/ fighting).", "sortedWord": "None", "Identifyer": null, "identifyer": 37785, "year": "2011"}, {"autor": "gravastar", "date": "2011-02-16 01:16:00", "content": "Well, all I can say is that using my Canon Mk3S and Mk4 cameras I absolutely cannot see the preflash and have never had an issue with blinking. With the M9 it's obvious and definitely causes the subjects to blink. I may be able to shed some light on that ........ About 3 years ago I looked into the Canon flash to flash protocols and in particular the ST-E2 controller and the 580EX flashes. I wanted to make a long range spread beam IR laser equivalent of the ST-E2. Communication between flashes or the ST-E2 and 580EXs is by rapidly switching on and off the flash tube output to produce a digital IR light pulse train. The switching is very rapid, in the order of microseconds and about 90 bits long. Their flash control circuitry is capable of very rapid response times so I'm not suprised you can't see the measuring/pre flashes. Bob.", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1589340", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "well, all i can say is that using my canon mk3s and mk4 cameras i absolutely cannot see the preflash and have never had an issue with blinking. with the m9 it's obvious and definitely causes the subjects to blink. i may be able to shed some light on that ........ about 3 years ago i looked into the canon flash to flash protocols and in particular the st-e2 controller and the 580ex flashes. -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  a long range spread beam ir laser equivalent of the st-e2. communication between flashes or the st-e2 and 580exs is by rapidly switching on and off the flash tube output to produce a digital ir light pulse train. the switching is very rapid, in the order of microseconds and about 90 bits long. their flash control circuitry is capable of very rapid response times so i'm not suprised you can't see the measuring/pre flashes. bob.", "sortedWord": "None", "Identifyer": null, "identifyer": 37790, "year": "2011"}, {"autor": "ho_co", "date": "2011-03-30 21:21:00", "content": "... After some discussion and \"checking with the technician\" I was told that when I did the firmware update (2.005) the counter was reset. I asked if this was true in general when a firmware update is installed. I was told yes. That strikes me as really, really strange.... Jack, that seems very strange to me as well. Thanks for posting the results. I can understand that shutter actuations which occurred while the disconnect was present would be lost. And I wouldn't worry about representing the camera to a buyer; if he's interested, he'll ask, and you can tell him about the repair. But I don't think it's true that all 2.005 firmware updates reset the counter. I haven't heard that before, and I think the person you were talking to is wrong. I wouldn't worry about it. I've got no idea how many exposures I've made with my M8, and I figure it'll work long enough, and then I'll get it fixed. Of course, I can always check the Image Unique ID. And if that was reset with a firmware change, then it, too, is meaningless. --img--  In your case, your camera will display its own Image Unique ID. And it will be truly \"unique.\" --img--  I guess it's like buying a car whose odometer has been rolled back. You can't know for sure, and anyway, whatever repairs the car needs will be the same whether you know or not. Really an interesting story. Thanks for letting us know! Edited March 30, 2011 by ho_co", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/6/?tab=comments#comment-1630822", "origin": "L-forum", "suborigin": "34953-determining-shutter-actuations-on-an-m8", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "... after some discussion and \"checking with the technician\" i was told that when i did the firmware update (2.005) the counter was reset. i asked if this was true in general when a firmware update is installed. i was told yes. that strikes me as really, really strange.... jack, that seems very strange to me as well. thanks for posting the results. i can understand that shutter actuations which occurred while the disconnect was present would be lost. and i wouldn't worry about representing the camera to a buyer; if he's interested, he'll ask, and you can tell him about the repair. but i don't think it's true that all 2.005 firmware updates reset the counter. i haven't heard that before, and i think the person you were talking to is wrong. i wouldn't worry about it. -----> i !!! 've got no idea how many exposures -----> i !!! 've -----> made !!!  with my m8, and -----> i !!!  figure it'll work long enough, and then -----> i !!! 'll get it fixed. of course, i can always check the image unique id. and if that was reset with a firmware change, then it, too, is meaningless. --img--  in your case, your camera will display its own image unique id. and it will be truly \"unique.\" --img--  i guess it's like buying a car whose odometer has been rolled back. you can't know for sure, and anyway, whatever repairs the car needs will be the same whether you know or not. really an interesting story. thanks for letting us know! edited march 30, 2011 by ho_co", "sortedWord": "None", "Identifyer": null, "identifyer": 41921, "year": "2011"}, {"autor": "Dougg", "date": "2011-07-19 20:31:00", "content": "My Image Unique ID reads \"0000........03AA\". That converts to 938 actuations. --img--  Now go look at the unique image ID on the very first pic you shot with the camera to see how many actuations were already on the clock at that point! Subtracting that from the current number will reveal how many you have shot... --img--  Don't feel too badly... I have two M8 bought three years ago, and the numbers show I've made about 1100 clicks on the black one and 1800 on the chrome body. Clearly neither of us blasts away proliferously!", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/7/?tab=comments#comment-1739529", "origin": "L-forum", "suborigin": "34953-determining-shutter-actuations-on-an-m8", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "my image unique id reads \"0000........03aa\". that converts to 938 actuations. --img--  now go look at the unique image id on the very first pic you shot with the camera to see how many actuations were already on the clock at that point! subtracting that from the current number will reveal how many you have shot... --img--  don't feel too badly... -----> i !!!  have two m8 bought three years ago, and the numbers show -----> i !!! 've -----> made !!!  about 1100 clicks on the black one and 1800 on the chrome body. clearly neither of us blasts away proliferously!", "sortedWord": "None", "Identifyer": null, "identifyer": 41945, "year": "2011"}, {"autor": "gfspencer", "date": "2011-07-19 20:54:00", "content": "Now go look at the unique image ID on the very first pic you shot with the camera to see how many actuations were already on the clock at that point! Subtracting that from the current number will reveal how many you have shot... --img--  Don't feel too badly... I have two M8 bought three years ago, and the numbers show I've made about 1100 clicks on the black one and 1800 on the chrome body. Clearly neither of us blasts away proliferously! Thanks! I'll do that. I've got the first one or two shots on the computer. No, I don't blast away . . . . at least with the M8. That was mainly because I couldn't see well enough to focus. --img--  However, the GF-1 has taken quite a few pictures. *************** My son told me that I don't need a formula to convert hexadecimal numbers. All I need to do is Google \"0x3aa in decimal\" (0 = zero) and I will get the correct number of actuations.", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/7/?tab=comments#comment-1739558", "origin": "L-forum", "suborigin": "34953-determining-shutter-actuations-on-an-m8", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "now go look at the unique image id on the very first pic you shot with the camera to see how many actuations were already on the clock at that point! subtracting that from the current number will reveal how many you have shot... --img--  don't feel too badly... -----> i !!!  have two m8 bought three years ago, and the numbers show -----> i !!! 've -----> made !!!  about 1100 clicks on the black one and 1800 on the chrome body. clearly neither of us blasts away proliferously! thanks! i'll do that. i've got the first one or two shots on the computer. no, i don't blast away . . . . at least with the m8. that was mainly because i couldn't see well enough to focus. --img--  however, the gf-1 has taken quite a few pictures. *************** my son told me that i don't need a formula to convert hexadecimal numbers. all i need to do is google \"0x3aa in decimal\" (0 = zero) and i will get the correct number of actuations.", "sortedWord": "None", "Identifyer": null, "identifyer": 41946, "year": "2011"}, {"autor": "jamesk8752", "date": "2011-04-02 03:06:00", "content": " I just picked up a used but immaculate black M8 from a friend who doesn't keep his older cameras (he switched to an M9 immediately after it was released). As a collector, I wanted to add it to my M body collection. No \"coffee stains\" on the LCD, no lines or green blobs in the images, RF alignment is spot on, seems to operate perfectly, and I like having the 1/8000 shutter speed available. The serial number is 31022xx. I'm curious as to when it was made. From what I can gather through forum searches, this body is a very early one, possibly from the first batch produced. My friend said that it was one of the first ones sold in this area, and that he sent it back to Solms for service not long after he bought it (possibly as part of a recall). I suspect that it has a new sensor. Any ideas as to when it was made, and is it from the first batch? Thanks in advance... Regards, Jim", "link": "https://www.l-camera-forum.com/topic/147918-m8-serial-number/?tab=comments#comment-1633169", "origin": "L-forum", "suborigin": "147918-m8-serial-number", "result": true, "Selector": "[ideas, made]", "selectorShort": "idea", "MarkedSent": " I just picked up a used but immaculate black M8 from a friend who doesn't keep his older cameras (he switched to an M9 immediately after it was released). As a collector, I wanted to add it to my M body collection. No \"coffee stains\" on the LCD, no lines or green blobs in the images, RF alignment is spot on, seems to operate perfectly, and I like having the 1/8000 shutter speed available. The serial number is 31022xx. I'm curious as to when it was made. From what I can gather through forum searches, this body is a very early one, possibly from the first batch produced. My friend said that it was one of the first ones sold in this area, and that he sent it back to Solms for service not long after he bought it (possibly as part of a recall). I suspect that it has a new sensor. Any ideas as to when it was made, and is it from the first batch? Thanks in advance... Regards, Jim", "sortedWord": "None", "Identifyer": null, "identifyer": 41972, "year": "2011"}, {"autor": "Guest Ming Rider", "date": "2011-09-19 22:19:00", "content": "Put your dot in a glass with acetone. Wait a night, clean it and you will have a silver Leica dot. Almost a M8P --img--  --img--  I'm not claiming that I came up with the Silver M8 with Silver dot but since I posted a picture of my M8 with Silver dot earlier in the year, I've seen a few appearing. It certainly adds a certain style to the camera. So yes I quite agree. Maybe we should call it an M8-P and in the same breath make a mockery of Leica charging another 500 quid for an M9-P.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/3/?tab=comments#comment-1797149", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "put your dot in a glass with acetone. wait a night, clean it and you will have a silver leica dot. almost a m8p --img--  --img--  i'm not claiming that i -----> came !!!  -----> up !!!  -----> with !!!  the silver m8 -----> with !!!  silver dot but since i posted a picture of my m8 -----> with !!!  silver dot earlier in the year, i've seen a few appearing. it certainly adds a certain style to the camera. so yes i quite agree. maybe we should call it an m8-p and in the same breath make a mockery of leica charging another 500 quid for an m9-p.", "sortedWord": "None", "Identifyer": null, "identifyer": 42685, "year": "2011"}, {"autor": "menos I M6", "date": "2011-11-09 01:26:00", "content": "seen a few of these black M8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? Ps. i want! Haha - no, no cleaner can do that. This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838745", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "seen a few of these black M8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? Ps. i want! Haha - no, no cleaner can do that. This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used.", "sortedWord": "None", "Identifyer": null, "identifyer": 42713, "year": "2011"}, {"autor": "smdavey", "date": "2011-11-09 11:29:00", "content": "Haha - no, no cleaner can do that.This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the M8 is (price wise) moving closer to the hands of myself now. so i am guessing the M8.2 is the one to look out for.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838955", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Haha - no, no cleaner can do that.This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the M8 is (price wise) moving closer to the hands of myself now. so i am guessing the M8.2 is the one to look out for.", "sortedWord": "None", "Identifyer": null, "identifyer": 42714, "year": "2011"}, {"autor": "Jeff S", "date": "2011-12-21 04:04:00", "content": "From his own site... \"...I have the energy and sense of humor of a three-year old, so remember, this is a personal website, and never presented as fact. I enjoy making things up for fun, as does The Onion, and I publish them here...\" Stop reading and keep shooting. Jeff", "link": "https://www.l-camera-forum.com/topic/168978-did-ken-rockwell-a-m8-hater/?tab=comments#comment-1876591", "origin": "L-forum", "suborigin": "168978-did-ken-rockwell-a-m8-hater", "result": true, "Selector": "i enjoy making", "selectorShort": "make", "MarkedSent": "from his own site... \"...i have the energy and sense of humor of a three-year old, so remember, this is a personal website, and never presented as fact. -----> i !!!  -----> enjoy !!!  -----> making !!!  things up for fun, as does the onion, and -----> i !!!  publish them here...\" stop reading and keep shooting. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 47068, "year": "2011"}, {"autor": "h00ligan", "date": "2011-01-11 21:34:00", "content": "Thanks CJ, I'll have to check when shooting ends - if I can't make a better shot by then, I'll end up submitting something right in line - maybe the last pic --img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/16/?tab=comments#comment-1555601", "origin": "L-forum", "suborigin": "127054-leica-x1-photos", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "thanks cj, -----> i !!! 'll have to check when shooting ends - if -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  a better shot by then, -----> i !!! 'll end up submitting something right in line - maybe the last pic --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 9879, "year": "2011"}, {"autor": "DwF", "date": "2011-11-07 14:59:00", "content": "Here is a picture that I made with my X1 at about 4AM in Cairo International on Sunday following the \"Day of Rage\" I was flying El Al to Ben Gurian and certainly faced heightened security that weekend at both airports. I carried my X1 as I always do with a carry-on laptop style bag. I was also extensively searched at a checkpoint in Israel as camera surveillance had picked me up pulling over twice to check bearings on a road leading into the territories. They obviously found my indecision about which way to go suspicious! My cameras (i had my LX5 along as well) were never an issue for the security I faced but I would agree that it is never possible to second guess what security anywhere will find curious or a threat. David --img-- ", "link": "https://www.l-camera-forum.com/topic/165757-israeli-security-found-my-x1-to-be-a-security-threat/?tab=comments#comment-1837309", "origin": "L-forum", "suborigin": "165757-israeli-security-found-my-x1-to-be-a-security-threat", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "here is a picture that -----> i !!!  -----> made !!!  with my x1 at about 4am in cairo international on sunday following the \"day of rage\" -----> i !!!  was flying el al to ben gurian and certainly faced heightened security that weekend at both airports. i carried my x1 as i always do with a carry-on laptop style bag. i was also extensively searched at a checkpoint in israel as camera surveillance had picked me up pulling over twice to check bearings on a road leading into the territories. they obviously found my indecision about which way to go suspicious! my cameras (i had my lx5 along as well) were never an issue for the security i faced but i would agree that it is never possible to second guess what security anywhere will find curious or a threat. david --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 10212, "year": "2011"}, {"autor": "Doc Henry", "date": "2011-11-09 12:10:00", "content": "Welcome to LUF ! I made ​​several trips to South East Asia for medical humanitarian mission with my M8 and M9 ... and my blood pressure + stethoscope, and I've never had such problems at all airports where I come down Besides, I do not agree. I think you have a respectable profession and therefore it may be taken into account They think you put a bomb trigger in your X1 its' completely stupid --img-- Moral: I will not go to countries where paranoia is thus Sorry to to be frank! Best Henry Edited November 9, 2011 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/165757-israeli-security-found-my-x1-to-be-a-security-threat/?tab=comments#comment-1838998", "origin": "L-forum", "suborigin": "165757-israeli-security-found-my-x1-to-be-a-security-threat", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "welcome to luf ! -----> i !!!  -----> made !!!  ​​several trips to south east asia for medical humanitarian mission with my m8 and m9 ... and my blood pressure + stethoscope, and -----> i !!! 've never had such problems at all airports where -----> i !!!  come down besides, -----> i !!!  do not agree. i think you have a respectable profession and therefore it may be taken into account they think you put a bomb trigger in your x1 its' completely stupid --img-- moral: i will not go to countries where paranoia is thus sorry to to be frank! best henry edited november 9, 2011 by doc henry", "sortedWord": "None", "Identifyer": null, "identifyer": 10218, "year": "2011"}, {"autor": "robert blu", "date": "2011-04-11 16:42:00", "content": "i only made a few photos using manual focus, I'm more used to the autofocus with high aperture. But I'll be in Milan in the next days with some free time (hopefully) and I'll try the manual focus with a smaller aperture (f 8 or 11 should be enough for my taste!). If any result I'll post in the gallery. Thanks for the idea (I was too lazy to think about!) robert PS: my M7 is getting jealous...", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/?tab=comments#comment-1642839", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "i only made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> only !!!  -----> made !!!  a few photos using manual focus, -----> i !!! 'm more used to the autofocus with high aperture. but i'll be in milan in the next days with some free time (hopefully) and i'll try the manual focus with a smaller aperture (f 8 or 11 should be enough for my taste!). if any result i'll post in the gallery. thanks for the idea (i was too lazy to think about!) robert ps: my m7 is getting jealous...", "sortedWord": "None", "Identifyer": null, "identifyer": 10422, "year": "2011"}, {"autor": "gjames9142", "date": "2011-04-19 13:50:00", "content": " It's probably ridiculous to argue over aesthetics. I would simply make the point that this whole tendency to shoot wide open really took off when Mike Johnson invented the term bokeh out of Japanese whole cloth. Shallow depth of field has been used forever by film-makers as an essential of story- tellling, emphasizing a particular subject. Street photographers have usually used great depth of field -- from HCB to Winogrand, or Lee Friedlander, whose lenses get wider and wider and whose work gets better and better. The rendering of deep perspective on a two-dimensional plane induces in me a certain physical satisfaction because it does something the eye cannot do in the real world. That said, I am not sure that the OP's shots are real street photographs, in that they are not dealing with a complex state of flux. I also keep bumping into the limitations of the X-1 in this domain, even with the improved firmware. I am going to work more with MF and a smaller aperture, but there is still a noticeable lag, The M9 beats it hands down, although I took part in a ridiculous thread where a couple of posters thought the whole thing was about science and rigourous testing rather than actually using the camera in the field. Or the street.", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/2/?tab=comments#comment-1649984", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "i would simply make", "selectorShort": "make", "MarkedSent": " it's probably ridiculous to argue over aesthetics. -----> i !!!  -----> would !!!  -----> simply !!!  -----> make !!!  the point that this whole tendency to shoot wide open really took off when mike johnson invented the term bokeh out of japanese whole cloth. shallow depth of field has been used forever by film-makers as an essential of story- tellling, emphasizing a particular subject. street photographers have usually used great depth of field -- from hcb to winogrand, or lee friedlander, whose lenses get wider and wider and whose work gets better and better. the rendering of deep perspective on a two-dimensional plane induces in me a certain physical satisfaction because it does something the eye cannot do in the real world. that said, i am not sure that the op's shots are real street photographs, in that they are not dealing with a complex state of flux. i also keep bumping into the limitations of the x-1 in this domain, even with the improved firmware. i am going to work more with mf and a smaller aperture, but there is still a noticeable lag, the m9 beats it hands down, although i took part in a ridiculous thread where a couple of posters thought the whole thing was about science and rigourous testing rather than actually using the camera in the field. or the street.", "sortedWord": "None", "Identifyer": null, "identifyer": 10433, "year": "2011"}, {"autor": "diogenis", "date": "2011-04-26 03:44:00", "content": "Just try reading your own post then tell me you're not moaningYou're just another M user who can't accept there's something else out there with a little red dot on it that does a great job. Peter, do you own/can afford one M8/9? I am, and since I own both M8 AND X1, I can make direct comparisons. Well, if you want the short version, then this is that at least for manual, only an M is really capable. Don't give me the treatment of rubbish generalizations since I always admired the X1 as very special. After all I bought it... Now, go buy an M and then tell me if your precious X is better", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/3/?tab=comments#comment-1655783", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "just try reading your own post then tell me you're not moaningyou're just another m user who can't accept there's something else out there with a little red dot on it that does a great job. peter, do you own/can afford one m8/9? -----> i !!!  am, and since -----> i !!!  own both m8 and x1, -----> i !!!  -----> can !!!  -----> make !!!  direct comparisons. well, if you want the short version, then this is that at least for manual, only an m is really capable. don't give me the treatment of rubbish generalizations since i always admired the x1 as very special. after all i bought it... now, go buy an m and then tell me if your precious x is better", "sortedWord": "None", "Identifyer": null, "identifyer": 10466, "year": "2011"}, {"autor": "andybarton", "date": "2011-04-26 08:43:00", "content": "I would agree with almost everything you said except the M being \"incredibly fast\" Sorry, but it cannot be faster than AF, slow or not. And since I havent owned RF cameras before I have no experience it makes the learning curve that much more tedious. You like the X1, that's obvious, CJ, but the above statements are interesting. In MY experience, focusing with a rangefinder is always faster than using an X1, but I haven't tried FW2.0. So, that's why I wouldn't make a definitive statement that an X1 is better. I think that you need to be careful in making definitive statements such as the first quote above. To be honest, this thread has now turned into a \"My X1 is better than your Mx\" thread, which is never a good place to be for a harmonious forum.", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/3/?tab=comments#comment-1655913", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "i would agree with almost everything you said except the m being \"incredibly fast\" sorry, but it cannot be faster than af, slow or not. and since i havent owned rf cameras before i have no experience it makes the learning curve that much more tedious. you like the x1, that's obvious, cj, but the above statements are interesting. in my experience, focusing with a rangefinder is always faster than using an x1, but i haven't tried fw2.0. so, that's why -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  a definitive statement that an x1 is better. i think that you need to be careful in making definitive statements such as the first quote above. to be honest, this thread has now turned into a \"my x1 is better than your mx\" thread, which is never a good place to be for a harmonious forum.", "sortedWord": "None", "Identifyer": null, "identifyer": 10470, "year": "2011"}, {"autor": "phancj", "date": "2011-04-26 08:51:00", "content": "You like the X1, that's obvious, CJ, but the above statements are interesting. In MY experience, focusing with a rangefinder is always faster than using an X1, but I haven't tried FW2.0. So, that's why I wouldn't make a definitive statement that an X1 is better. I think that you need to be careful in making definitive statements such as the first quote above. To be honest, this thread has now turned into a \"My X1 is better than your Mx\" thread, which is never a good place to be for a harmonious forum. Eh...Andy, I do not think that anything I said above says the X1 is the best of all, I am just saying from experience that FOR ME AF is the real deal, others' experience may vary. My reply was to diogenis who said the Ms are \"incredibly fast\"thats just not true IMO. One can be really quick and deft with loads of experience but having tried the RF focusing I cannot honestly believe it to be blazing fast compared to any AF. Really. After successive shots there's a limit to human capability when fatigues sets in, particularly when we're all getting older haha.. For some this may turn into a \"vs\" thread but thats just not my intention, at least not right now. Just my honest response to something said. And I am still in a looonnggg consideration with the M.--img--  Andy, I cannot see how ANY of my above posts can be detrimental to the harmonious forum, and I have also tried to phrase my posts euphemistically to preserve that very harmony! CJ Edited April 26, 2011 by phancj", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/3/?tab=comments#comment-1655927", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "you like the x1, that's obvious, cj, but the above statements are interesting. in my experience, focusing with a rangefinder is always faster than using an x1, but i haven't tried fw2.0. so, that's why -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  a definitive statement that an x1 is better. i think that you need to be careful in making definitive statements such as the first quote above. to be honest, this thread has now turned into a \"my x1 is better than your mx\" thread, which is never a good place to be for a harmonious forum. eh...andy, i do not think that anything i said above says the x1 is the best of all, i am just saying from experience that for me af is the real deal, others' experience may vary. my reply was to diogenis who said the ms are \"incredibly fast\"thats just not true imo. one can be really quick and deft with loads of experience but having tried the rf focusing i cannot honestly believe it to be blazing fast compared to any af. really. after successive shots there's a limit to human capability when fatigues sets in, particularly when we're all getting older haha.. for some this may turn into a \"vs\" thread but thats just not my intention, at least not right now. just my honest response to something said. and i am still in a looonnggg consideration with the m.--img--  andy, i cannot see how any of my above posts can be detrimental to the harmonious forum, and i have also tried to phrase my posts euphemistically to preserve that very harmony! cj edited april 26, 2011 by phancj", "sortedWord": "None", "Identifyer": null, "identifyer": 10471, "year": "2011"}, {"autor": "phancj", "date": "2011-04-26 10:32:00", "content": "Andy, It's probably coz I was doing that for a while with few dozen photos. I wear corrective glasses already. The first dozen or so photos were fun, after that it was blah! no fun at all. I wished leica came up with the rumored R-solution at photokina but they didnt, so I went on to invest in more nikon primes. CJ Edited April 26, 2011 by phancj", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/4/?tab=comments#comment-1656001", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "andy, it's probably coz i was doing that for a while with few dozen photos. i wear corrective glasses already. the first dozen or so photos were fun, after that it was blah! no fun at all. i wished leica -----> came !!!  -----> up !!!  -----> with !!!  the rumored r-solution at photokina but they didnt, so i went on to invest in more nikon primes. cj edited april 26, 2011 by phancj", "sortedWord": "None", "Identifyer": null, "identifyer": 10485, "year": "2011"}, {"autor": "roydonian", "date": "2011-08-15 09:06:00", "content": "Some of those carry-homes will have made it across the Channel --img--  I probably have one, a IIIb that was originally purchased by my father around 1946. He would never take it abroad, because he was worried that it might be confiscated by the UK customs authorities. So presumably he knew that it had been smuggled into the country, either as war booty by a WW2 veteran or by a member of the post-war occupation forces. It went back (briefly) to Wetzlar when I made my first visit in 1999. Best regards, Doug", "link": "https://www.l-camera-forum.com/topic/157617-leica-ww-ii/?tab=comments#comment-1765928", "origin": "L-forum", "suborigin": "157617-leica-ww-ii", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "some of those carry-homes will have made it across the channel --img--  i probably have one, a iiib that was originally purchased by my father around 1946. he would never take it abroad, because he was worried that it might be confiscated by the uk customs authorities. so presumably he knew that it had been smuggled into the country, either as war booty by a ww2 veteran or by a member of the post-war occupation forces. it went back (briefly) to wetzlar when -----> i !!!  -----> made !!!  my first visit in 1999. best regards, doug", "sortedWord": "None", "Identifyer": null, "identifyer": 37396, "year": "2011"}, {"autor": "Michael Geschlecht", "date": "2011-05-15 23:25:00", "content": "Hello Jaap, I'm a person who has limited ability w/ computers. I have had a number of people on the Forum try to help me but I have not been able to figure things out. I have no one here to help me & don't have the ability @ this time to take a course to learn to do this. I don't even know how to make my printer work. This alone has cost me something in the neighborhood of 100 Euros in the last year & a half because I have had to make copies @ 10 Euro cents each @ the Library across the street from where I live. Not by choice. If I knew how to make things work or had someone to help me I would be glad to do what you ask. I don't. I would hope the position of the Forum is not that if a person is too disabled to properly use a computer then they are barred from participation. It does not seem to be in the spirit of what the Forum or most people who participate in it stand for. You especially strike me as a person who would be opposed to such discrimination. Please tell me what we can do to resolve this situation. I do try my best. Best Regards, Michael", "link": "https://www.l-camera-forum.com/topic/150062-the-world-from-above-game-thread/page/3/?tab=comments#comment-1673403", "origin": "L-forum", "suborigin": "150062-the-world-from-above-game-thread", "result": true, "Selector": "i have had to make", "selectorShort": "make", "MarkedSent": "hello jaap, i'm a person who has limited ability w/ computers. i have had a number of people on the forum try to help me but i have not been able to figure things out. i have no one here to help me & don't have the ability @ this time to take a course to learn to do this. i don't even know how to make my printer work. this alone has cost me something in the neighborhood of 100 euros in the last year & a half because -----> i !!!  -----> have !!!  -----> had !!!  -----> to !!!  -----> make !!!  copies @ 10 euro cents each @ the library across the street from where -----> i !!!  live. not by choice. if i knew how to make things work or had someone to help me i would be glad to do what you ask. i don't. i would hope the position of the forum is not that if a person is too disabled to properly use a computer then they are barred from participation. it does not seem to be in the spirit of what the forum or most people who participate in it stand for. you especially strike me as a person who would be opposed to such discrimination. please tell me what we can do to resolve this situation. i do try my best. best regards, michael", "sortedWord": "None", "Identifyer": null, "identifyer": 49736, "year": "2011"}, {"autor": "jaapv", "date": "2011-05-16 09:04:00", "content": "Hello Jaap, I'm a person who has limited ability w/ computers. I have had a number of people on the Forum try to help me but I have not been able to figure things out. I have no one here to help me & don't have the ability @ this time to take a course to learn to do this. I don't even know how to make my printer work. This alone has cost me something in the neighborhood of 100 Euros in the last year & a half because I have had to make copies @ 10 Euro cents each @ the Library across the street from where I live. Not by choice. If I knew how to make things work or had someone to help me I would be glad to do what you ask. I don't. I would hope the position of the Forum is not that if a person is too disabled to properly use a computer then they are barred from participation. It does not seem to be in the spirit of what the Forum or most people who participate in it stand for. You especially strike me as a person who would be opposed to such discrimination. Please tell me what we can do to resolve this situation. I do try my best. Best Regards, Michael Organize that somebody can post for you before you supply the winning answer.--img--  That way you can participate without hanging up the thread.", "link": "https://www.l-camera-forum.com/topic/150062-the-world-from-above-game-thread/page/3/?tab=comments#comment-1673607", "origin": "L-forum", "suborigin": "150062-the-world-from-above-game-thread", "result": true, "Selector": "i have had to make", "selectorShort": "make", "MarkedSent": "hello jaap, i'm a person who has limited ability w/ computers. i have had a number of people on the forum try to help me but i have not been able to figure things out. i have no one here to help me & don't have the ability @ this time to take a course to learn to do this. i don't even know how to make my printer work. this alone has cost me something in the neighborhood of 100 euros in the last year & a half because -----> i !!!  -----> have !!!  -----> had !!!  -----> to !!!  -----> make !!!  copies @ 10 euro cents each @ the library across the street from where -----> i !!!  live. not by choice. if i knew how to make things work or had someone to help me i would be glad to do what you ask. i don't. i would hope the position of the forum is not that if a person is too disabled to properly use a computer then they are barred from participation. it does not seem to be in the spirit of what the forum or most people who participate in it stand for. you especially strike me as a person who would be opposed to such discrimination. please tell me what we can do to resolve this situation. i do try my best. best regards, michael organize that somebody can post for you before you supply the winning answer.--img--  that way you can participate without hanging up the thread.", "sortedWord": "None", "Identifyer": null, "identifyer": 49739, "year": "2011"}, {"autor": "Olsen", "date": "2011-06-23 22:26:00", "content": "Michael has asked me if I will try to present a 'photo from above'. Hum! Give me some hours and I will come up with something. (Hum! A very exiting task!)", "link": "https://www.l-camera-forum.com/topic/150062-the-world-from-above-game-thread/page/5/?tab=comments#comment-1712820", "origin": "L-forum", "suborigin": "150062-the-world-from-above-game-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "michael has asked me if i will try to present a 'photo from above'. hum! give me some hours and i will -----> come !!!  -----> up !!!  -----> with !!!  something. (hum! a very exiting task!)", "sortedWord": "None", "Identifyer": null, "identifyer": 49771, "year": "2011"}, {"autor": "stuny", "date": "2011-06-29 20:23:00", "content": "Gents - Not Europe or Canada, and yes a colder than average climate, small population. The aircraft is twin engine high wing. If we don't make much progress I'll add a photo of one of the aircraft.", "link": "https://www.l-camera-forum.com/topic/150062-the-world-from-above-game-thread/page/6/?tab=comments#comment-1718819", "origin": "L-forum", "suborigin": "150062-the-world-from-above-game-thread", "result": true, "Selector": "we don't make", "selectorShort": "make", "MarkedSent": "gents - not europe or canada, and yes a colder than average climate, small population. the aircraft is twin engine high wing. if -----> we !!!  -----> do !!! -----> n't !!!  -----> make !!!  much progress i'll add a photo of one of the aircraft.", "sortedWord": "None", "Identifyer": null, "identifyer": 49800, "year": "2011"}, {"autor": "freusen", "date": "2011-02-24 21:18:00", "content": "Where do you see an offset in this image? I am very sorry, it seems that I made a mistake about the newest Leica finders. I don't have such a finder but attached is a picture of 3 finders: a plastic finder, a new metal finder and a voigtlander finder. It's a shame that the new finders have no offset! Is that because the mount for the M8/9 is directly over the lens axis? ------------ FrankR --img--  Edited February 24, 2011 by freusen", "link": "https://www.l-camera-forum.com/topic/144842-21mm-viewfinder-leica-or-zeiss/page/2/?tab=comments#comment-1598949", "origin": "L-forum", "suborigin": "144842-21mm-viewfinder-leica-or-zeiss", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "where do you see an offset in this image? -----> i !!!  am very sorry, it seems that -----> i !!!  -----> made !!!  a mistake about the newest leica finders. i don't have such a finder but attached is a picture of 3 finders: a plastic finder, a new metal finder and a voigtlander finder. it's a shame that the new finders have no offset! is that because the mount for the m8/9 is directly over the lens axis? ------------ frankr --img--  edited february 24, 2011 by freusen", "sortedWord": "None", "Identifyer": null, "identifyer": 80931, "year": "2011"}, {"autor": "Guest willjanurgucken2000", "date": "2011-02-25 06:46:00", "content": "I am very sorry, it seems that I made a mistake about the newest Leica finders. I don't have such a finder but attached is a picture of 3 finders: a plastic finder, a new metal finder and a voigtlander finder. It's a shame that the new finders have no offset! Is that because the mount for the M8/9 is directly over the lens axis? ------------ FrankR Beside the Cheap-Plastic-Feel, why not get the plastic finder if it's more accurate? Am also surpised about the new metal finders having no offset. I just ordered my M9 and don't have it yet, but from the photos, the mount is not directly over the lens axis. Can anybody else explain this?", "link": "https://www.l-camera-forum.com/topic/144842-21mm-viewfinder-leica-or-zeiss/page/2/?tab=comments#comment-1599244", "origin": "L-forum", "suborigin": "144842-21mm-viewfinder-leica-or-zeiss", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  am very sorry, it seems that -----> i !!!  -----> made !!!  a mistake about the newest leica finders. i don't have such a finder but attached is a picture of 3 finders: a plastic finder, a new metal finder and a voigtlander finder. it's a shame that the new finders have no offset! is that because the mount for the m8/9 is directly over the lens axis? ------------ frankr beside the cheap-plastic-feel, why not get the plastic finder if it's more accurate? am also surpised about the new metal finders having no offset. i just ordered my m9 and don't have it yet, but from the photos, the mount is not directly over the lens axis. can anybody else explain this?", "sortedWord": "None", "Identifyer": null, "identifyer": 80935, "year": "2011"}, {"autor": "IkarusJohn", "date": "2011-03-07 21:02:00", "content": "John, If it's got severe barrel distortion how will you reliably know what makes it into the edges of the photo and what's doesn't?--img--  Pete. Hi Pete, Well, from using the lens and the viewfinder, I'm confident that the framelines in the viewfinder accurately indicate the edges of the picture I'm going to take. What is in the edge of the picture is not critical to me - it really only sets context, as the subject fills the built in viewfinder. In many respects I check to make sure that I have everything in there (feet, for example) that I want, and I don't have stuff I don't want (half a person walking into the frame). I can do everything I want to do with the rangefinder, but this. The additional viewfinder does this job perfectly adequately. Bear in mind that I got this viewfinder cheap as it was old stock - the only reason I have one is that I can't check the framing of my picture with the built in viewfinder on my M9. The additional viewfinder serves no other purpose, as I still have to focus and check the shutter speed using the built in viewfinder. Cheers John", "link": "https://www.l-camera-forum.com/topic/144842-21mm-viewfinder-leica-or-zeiss/page/3/?tab=comments#comment-1609306", "origin": "L-forum", "suborigin": "144842-21mm-viewfinder-leica-or-zeiss", "result": true, "Selector": "i check to make", "selectorShort": "make", "MarkedSent": "john, if it's got severe barrel distortion how will you reliably know what makes it into the edges of the photo and what's doesn't?--img--  pete. hi pete, well, from using the lens and the viewfinder, i'm confident that the framelines in the viewfinder accurately indicate the edges of the picture i'm going to take. what is in the edge of the picture is not critical to me - it really only sets context, as the subject fills the built in viewfinder. in many respects -----> i !!!  -----> check !!!  -----> to !!!  -----> make !!!  sure that -----> i !!!  have everything in there (feet, for example) that -----> i !!!  want, and -----> i !!!  don't have stuff -----> i !!!  don't want (half a person walking into the frame). i can do everything i want to do with the rangefinder, but this. the additional viewfinder does this job perfectly adequately. bear in mind that i got this viewfinder cheap as it was old stock - the only reason i have one is that i can't check the framing of my picture with the built in viewfinder on my m9. the additional viewfinder serves no other purpose, as i still have to focus and check the shutter speed using the built in viewfinder. cheers john", "sortedWord": "None", "Identifyer": null, "identifyer": 80961, "year": "2011"}, {"autor": "MarkP", "date": "2011-03-07 21:23:00", "content": "Hi Pete, Well, from using the lens and the viewfinder, I'm confident that the framelines in the viewfinder accurately indicate the edges of the picture I'm going to take. What is in the edge of the picture is not critical to me - it really only sets context, as the subject fills the built in viewfinder. In many respects I check to make sure that I have everything in there (feet, for example) that I want, and I don't have stuff I don't want (half a person walking into the frame). I can do everything I want to do with the rangefinder, but this. The additional viewfinder does this job perfectly adequately. Bear in mind that I got this viewfinder cheap as it was old stock - the only reason I have one is that I can't check the framing of my picture with the built in viewfinder on my M9. The additional viewfinder serves no other purpose, as I still have to focus and check the shutter speed using the built in viewfinder. Cheers John Hi John, I think that what concerns Richard and I is that the Zeiss finder( which I otherwise love for its brightness and clarity) may introduce a potential rotational error off the sensor/lens axis which alters perspective, not a simple framing or angular problem which can be corrected afterwards in Light Room etc. I have no such problem with my other lenses. Hence, as per my earlier post I'll put up some comparative example images once my dealer gets in the Leica VF. Regards, Mark", "link": "https://www.l-camera-forum.com/topic/144842-21mm-viewfinder-leica-or-zeiss/page/3/?tab=comments#comment-1609333", "origin": "L-forum", "suborigin": "144842-21mm-viewfinder-leica-or-zeiss", "result": true, "Selector": "i check to make", "selectorShort": "make", "MarkedSent": "hi pete, well, from using the lens and the viewfinder, i'm confident that the framelines in the viewfinder accurately indicate the edges of the picture i'm going to take. what is in the edge of the picture is not critical to me - it really only sets context, as the subject fills the built in viewfinder. in many respects -----> i !!!  -----> check !!!  -----> to !!!  -----> make !!!  sure that -----> i !!!  have everything in there (feet, for example) that -----> i !!!  want, and -----> i !!!  don't have stuff -----> i !!!  don't want (half a person walking into the frame). i can do everything i want to do with the rangefinder, but this. the additional viewfinder does this job perfectly adequately. bear in mind that i got this viewfinder cheap as it was old stock - the only reason i have one is that i can't check the framing of my picture with the built in viewfinder on my m9. the additional viewfinder serves no other purpose, as i still have to focus and check the shutter speed using the built in viewfinder. cheers john hi john, i think that what concerns richard and i is that the zeiss finder( which i otherwise love for its brightness and clarity) may introduce a potential rotational error off the sensor/lens axis which alters perspective, not a simple framing or angular problem which can be corrected afterwards in light room etc. i have no such problem with my other lenses. hence, as per my earlier post i'll put up some comparative example images once my dealer gets in the leica vf. regards, mark", "sortedWord": "None", "Identifyer": null, "identifyer": 80964, "year": "2011"}, {"autor": "Rick in CO", "date": "2011-10-13 16:18:00", "content": "I have had one experience with them. I made an offer on an eBay item which included postage (to USA), but when the item arrived I had a postage due payment to make. Not customs fee, postage due. I paid the postage, because I was getting a rare like-new lens for my Linhof at what I considered half-price. So, I am not complaining, just offering my experience. But, as always, even if you are confident you have the transaction well-defined, pay with a credit card that will back you up if something unacceptable happens.", "link": "https://www.l-camera-forum.com/topic/163883-opinion-on-photoalps-please/?tab=comments#comment-1816803", "origin": "L-forum", "suborigin": "163883-opinion-on-photoalps-please", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i have had one experience with them. -----> i !!!  -----> made !!!  an offer on an ebay item which included postage (to usa), but when the item arrived -----> i !!!  had a postage due payment to make. not customs fee, postage due. i paid the postage, because i was getting a rare like-new lens for my linhof at what i considered half-price. so, i am not complaining, just offering my experience. but, as always, even if you are confident you have the transaction well-defined, pay with a credit card that will back you up if something unacceptable happens.", "sortedWord": "None", "Identifyer": null, "identifyer": 81294, "year": "2011"}, {"autor": "250swb", "date": "2011-04-20 08:26:00", "content": "Of course the other option that doesn't involve buying a lens at all is Worldwide Pinhole Photography Day I've made mine ready for 24th April! Steve", "link": "https://www.l-camera-forum.com/topic/149526-jupiter-lenses-are-they-worth-it/?tab=comments#comment-1650714", "origin": "L-forum", "suborigin": "149526-jupiter-lenses-are-they-worth-it", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "of course the other option that doesn't involve buying a lens at all is worldwide pinhole photography day -----> i !!! 've -----> made !!!  mine ready for 24th april! steve", "sortedWord": "None", "Identifyer": null, "identifyer": 82396, "year": "2011"}, {"autor": "earleygallery", "date": "2011-04-20 08:35:00", "content": "Of course the other option that doesn't involve buying a lens at all is Worldwide Pinhole Photography Day I've made mine ready for 24th April! Steve Thanks for the reminder! Must get the pinhole blender camera ready!", "link": "https://www.l-camera-forum.com/topic/149526-jupiter-lenses-are-they-worth-it/?tab=comments#comment-1650726", "origin": "L-forum", "suborigin": "149526-jupiter-lenses-are-they-worth-it", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "of course the other option that doesn't involve buying a lens at all is worldwide pinhole photography day -----> i !!! 've -----> made !!!  mine ready for 24th april! steve thanks for the reminder! must get the pinhole blender camera ready!", "sortedWord": "None", "Identifyer": null, "identifyer": 82397, "year": "2011"}, {"autor": "d2mini", "date": "2011-03-15 15:28:00", "content": "ok, I guess I'll continue talking to myself... --img--  I put this little number together the day I was leaving for Miami. I just got back yesterday and the bag performed better than any camera specific bag yet. Here's some thoughts: Better than the A&A bag I ganked the insert from because the Tumi has more storage (taller) making it better for travel. Plenty of room for flatter items that couldn't fit in the A&A at all without sticking way out of the rear pocket. But it does have something from the A&A that I personally prefer and that is a zipper as access to the main compartment. For me, this is much easier to work out of compared to a flap-top bag. The Tumi, worn cross-body like I wear all my camera bags, is more comfortable even without a shoulder pad. It hugs the body, and can be rotated from front to back with ease and never gets in the way even when traversing through tight crowds. My wife even carried it for a few minutes when my hands were full and the first thing out of her mouth was \"wow, this is comfortable!\" Better than Billingham for me, due to a few reasons. Styling - doesn't stand out due to a contrast in style both in what's in style these days and my own personal style. I'm a younger guy and I dress even younger. Billingham sticks out like a sore thumb on me. Fuction - I love billingham's padding, but i prefer the pockets, zippers, flaps, and strap on the Tumi. Easy to work out of and feels more secure, especially the smaller pockets. Size - This of course depends on which model Billingham, but I had the Hadley Pro and obviously this bag is much smaller but it worked great for a 3 lens kit and would fit another lens or two if you don't mind stacking. But i feel like i could fit more in this small bag compared to a Billingham in the same size. Better than (current) canvas Domke for a few reasons as well. Compared to f-5xb and f-803 waxwear. Construction... it's some kind of ballistic nylon or something. Super tough yet nice and flexible. Easy access. The front clip/flap of the 803 sucks. Storage. The pockets on the 803 flap are pretty worthless. Could fit an ipad in back and not fond of the front pockets and none of these feel secure. Looks better (subjective). Not that comfy to wear. 5xb is more comfy than the 803 imho, due to size i guess. Crumpler. Crumpler I always want to like. I like their modern look, they have some decent details/ideas for storage and great padding, yet they make their bags sooooo tight! They really need to \"loosen the belt\" a bit. Trying to access small pockets is a real chore, and I have small hands. This also restricts how much you can carry. They also utilize a flap to cover the main compartment which I already mentioned I'm not fond of. And due to the padding and tight design/construction, the bag doesn't hug the body. Think Tank. They make some amazing bags, especially for dslr cameras. They put more thought into the design/function of their bags than anyone, especially for the pro shooters. But they are ugly and bulky and just not made for rangefinders. Even their newer Retrospective line of bags which look better, are too bulky and just too much bag for an M kit, IMHO. I had Retro 10 when they were first released and returned it immediately. Another line of bags that I really want to like but just can't. Ok, that's pretty much it. If any of this helps anyone, cool. Remember, it's all just my personal opinion and what works for me may not work for you and vice-versa. I've seen a lot of people mention the re-purposing of non-camera bags for M kits and hadn't given much thought to it before. But I see now that the right bag with the right insert can make a world of difference. --img--  Edited March 15, 2011 by d2mini", "link": "https://www.l-camera-forum.com/topic/146103-repurposed-tumi-5123d-t-tech-bag/?tab=comments#comment-1616192", "origin": "L-forum", "suborigin": "146103-repurposed-tumi-5123d-t-tech-bag", "result": true, "Selector": "[ideas, make]", "selectorShort": "idea", "MarkedSent": "ok, I guess I'll continue talking to myself... --img--  I put this little number together the day I was leaving for Miami. I just got back yesterday and the bag performed better than any camera specific bag yet. Here's some thoughts: Better than the A&A bag I ganked the insert from because the Tumi has more storage (taller) making it better for travel. Plenty of room for flatter items that couldn't fit in the A&A at all without sticking way out of the rear pocket. But it does have something from the A&A that I personally prefer and that is a zipper as access to the main compartment. For me, this is much easier to work out of compared to a flap-top bag. The Tumi, worn cross-body like I wear all my camera bags, is more comfortable even without a shoulder pad. It hugs the body, and can be rotated from front to back with ease and never gets in the way even when traversing through tight crowds. My wife even carried it for a few minutes when my hands were full and the first thing out of her mouth was \"wow, this is comfortable!\" Better than Billingham for me, due to a few reasons. Styling - doesn't stand out due to a contrast in style both in what's in style these days and my own personal style. I'm a younger guy and I dress even younger. Billingham sticks out like a sore thumb on me. Fuction - I love billingham's padding, but i prefer the pockets, zippers, flaps, and strap on the Tumi. Easy to work out of and feels more secure, especially the smaller pockets. Size - This of course depends on which model Billingham, but I had the Hadley Pro and obviously this bag is much smaller but it worked great for a 3 lens kit and would fit another lens or two if you don't mind stacking. But i feel like i could fit more in this small bag compared to a Billingham in the same size. Better than (current) canvas Domke for a few reasons as well. Compared to f-5xb and f-803 waxwear. Construction... it's some kind of ballistic nylon or something. Super tough yet nice and flexible. Easy access. The front clip/flap of the 803 sucks. Storage. The pockets on the 803 flap are pretty worthless. Could fit an ipad in back and not fond of the front pockets and none of these feel secure. Looks better (subjective). Not that comfy to wear. 5xb is more comfy than the 803 imho, due to size i guess. Crumpler. Crumpler I always want to like. I like their modern look, they have some decent details/ideas for storage and great padding, yet they make their bags sooooo tight! They really need to \"loosen the belt\" a bit. Trying to access small pockets is a real chore, and I have small hands. This also restricts how much you can carry. They also utilize a flap to cover the main compartment which I already mentioned I'm not fond of. And due to the padding and tight design/construction, the bag doesn't hug the body. Think Tank. They make some amazing bags, especially for dslr cameras. They put more thought into the design/function of their bags than anyone, especially for the pro shooters. But they are ugly and bulky and just not made for rangefinders. Even their newer Retrospective line of bags which look better, are too bulky and just too much bag for an M kit, IMHO. I had Retro 10 when they were first released and returned it immediately. Another line of bags that I really want to like but just can't. Ok, that's pretty much it. If any of this helps anyone, cool. Remember, it's all just my personal opinion and what works for me may not work for you and vice-versa. I've seen a lot of people mention the re-purposing of non-camera bags for M kits and hadn't given much thought to it before. But I see now that the right bag with the right insert can make a world of difference. --img--  Edited March 15, 2011 by d2mini", "sortedWord": "None", "Identifyer": null, "identifyer": 83493, "year": "2011"}, {"autor": "d2mini", "date": "2011-03-20 04:04:00", "content": " d2mini,I can't find your bag, the 5123D, in TUMI's web page... Maybe it's discontinued. In any case, I like your solution very much. Thanks for sharing! Manolo Yes, while google searching for it just to get the right name/model number, it appeared to me as well that it is probably discontinued. Tumi seems to like to keep coming up with new designs so I guess the older stuff has to go. I bought this bag early 2008 so it is a few years old now. But I'm sure they must have current bags that would work just as well if not better. If it helps any, the exterior dimensions of this bag are around 11\" x 11\" x 3.5\".", "link": "https://www.l-camera-forum.com/topic/146103-repurposed-tumi-5123d-t-tech-bag/?tab=comments#comment-1620140", "origin": "L-forum", "suborigin": "146103-repurposed-tumi-5123d-t-tech-bag", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": " d2mini,i can't find your bag, the 5123d, in tumi's web page... maybe it's discontinued. in any case, i like your solution very much. thanks for sharing! manolo yes, while google searching for it just to get the right name/model number, it appeared to me as well that it is probably discontinued. tumi seems to like to keep -----> coming !!!  -----> up !!!  -----> with !!!  new designs so i guess the older stuff has to go. i bought this bag early 2008 so it is a few years old now. but i'm sure they must have current bags that would work just as well if not better. if it helps any, the exterior dimensions of this bag are around 11\" x 11\" x 3.5\".", "sortedWord": "None", "Identifyer": null, "identifyer": 83496, "year": "2011"}, {"autor": "2eleven", "date": "2011-10-15 00:37:00", "content": "There is—it's 6-0. That's actually an 8 bit code (with the null frameline bits). What I meant is that there is no official 6 bit code for the lens bayonet which will work with the actual lens frameline selection (which you explain quite well). My understanding is that the optical design of the spherical 35 cron is the closest match if you want to code the lens and have the most accurate corrections applied. The 6 bits of the Summicron bayonet code also match the ones Leica chose for the official 6-0 code you mention above, which may indicate that Leica also felt this way. By the way, thanks for your post on the exiftool usage. I've made good use of it on more than one occasion. John", "link": "https://www.l-camera-forum.com/topic/164102-how-do-you-code-your-3514-pre-asph/?tab=comments#comment-1817536", "origin": "L-forum", "suborigin": "164102-how-do-you-code-your-3514-pre-asph", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "there is—it's 6-0. that's actually an 8 bit code (with the null frameline bits). what i meant is that there is no official 6 bit code for the lens bayonet which will work with the actual lens frameline selection (which you explain quite well). my understanding is that the optical design of the spherical 35 cron is the closest match if you want to code the lens and have the most accurate corrections applied. the 6 bits of the summicron bayonet code also match the ones leica chose for the official 6-0 code you mention above, which may indicate that leica also felt this way. by the way, thanks for your post on the exiftool usage. -----> i !!! 've -----> made !!!  good use of it on more than one occasion. john", "sortedWord": "None", "Identifyer": null, "identifyer": 85194, "year": "2011"}, {"autor": "Per P.", "date": "2011-02-16 14:03:00", "content": "So, in preparation for a long-ish trip later this year I revisited this question. This time I created a spreadsheet to understand my options. I have considered the difference in Field of View as well as the relative difference in percent --img--  My lenses range from 21 to 90mm. The conclusions are almost a little dull, but it seems the following combinations give the most balanced spread: - 2 Lenses: 25/50 or 35/75 - 3 Lenses: 28/50/90 - 4 Lenses: 21/35/50/75 or 25/35/50/90 But balance is not everything, so I ask myself two simple questions before deciding what to bring. That can easily result in a completely different set ending in the bag --img--  - Pick the widest and longest lens I imagine using for that particular location - Decide how many lenses I can be bothered to carry Cheers, Per.", "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/9/?tab=comments#comment-1589867", "origin": "L-forum", "suborigin": "104812-the-perfect-travel-kit", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "so, in preparation for a long-ish trip later this year i revisited this question. this time -----> i !!!  -----> created !!!  a spreadsheet to understand my options. i have considered the difference in field of view as well as the relative difference in percent --img--  my lenses range from 21 to 90mm. the conclusions are almost a little dull, but it seems the following combinations give the most balanced spread: - 2 lenses: 25/50 or 35/75 - 3 lenses: 28/50/90 - 4 lenses: 21/35/50/75 or 25/35/50/90 but balance is not everything, so i ask myself two simple questions before deciding what to bring. that can easily result in a completely different set ending in the bag --img--  - pick the widest and longest lens i imagine using for that particular location - decide how many lenses i can be bothered to carry cheers, per.", "sortedWord": "None", "Identifyer": null, "identifyer": 87057, "year": "2011"}, {"autor": "mafoofan", "date": "2011-11-30 20:32:00", "content": " In anticipation of receiving my new, special order MP in a couple of weeks, I thought it might be fun to discuss how you have engraved or would engrave your own camera. I tortured myself over how to have Leica engrave my name, and ultimately came up with this: --img--  The top is engraved like the regular MP (just \"Leica\" and the serial number). Typically, the back says \"LEICA CAMERA MADE IN GERMANY.\" I deleted \"LEICA CAMERA\" as I thought it was redundant and shifted \"MADE IN GERMANY\" all the way to the right, so that it is aligned with the edge of the back door. I put my first initial and last name, \"M. FAN,\" on the same level, but put it all the way to the left, aligned with the vertical tangent of the viewfinder eyepiece. I aligned both pieces of text on opposite sides for visual balance and to create enough space so that it wouldn't look like \"M. FAN MADE IN GERMANY.\" For reference, here is the standard back engraving: --img--  I thought about eliminating \"MADE IN GERMANY,\" too, but felt that the camera ought to have its place of origin stated somewhere. Had I gone with the traditional three-line engraving on top, I would have done so and put my name on the right side. I went with \"M. FAN\" instead of my full name because I thought it seemed more professional and business-like. For what it's worth, my contact in Solms loved the way I set things up. A frivolous topic of discussion, I know, but is there anything wrong with that? Cheers! Edited November 30, 2011 by mafoofan", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/?tab=comments#comment-1858660", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " in anticipation of receiving my new, special order mp in a couple of weeks, i thought it might be fun to discuss how you have engraved or would engrave your own camera. i tortured myself over how to have leica engrave my name, and ultimately -----> came !!!  -----> up !!!  -----> with !!!  this: --img--  the top is engraved like the regular mp (just \"leica\" and the serial number). typically, the back says \"leica camera made in germany.\" i deleted \"leica camera\" as i thought it was redundant and shifted \"made in germany\" all the way to the right, so that it is aligned with the edge of the back door. i put my first initial and last name, \"m. fan,\" on the same level, but put it all the way to the left, aligned with the vertical tangent of the viewfinder eyepiece. i aligned both pieces of text on opposite sides for visual balance and to create enough space so that it wouldn't look like \"m. fan made in germany.\" for reference, here is the standard back engraving: --img--  i thought about eliminating \"made in germany,\" too, but felt that the camera ought to have its place of origin stated somewhere. had i gone with the traditional three-line engraving on top, i would have done so and put my name on the right side. i went with \"m. fan\" instead of my full name because i thought it seemed more professional and business-like. for what it's worth, my contact in solms loved the way i set things up. a frivolous topic of discussion, i know, but is there anything wrong with that? cheers! edited november 30, 2011 by mafoofan", "sortedWord": "None", "Identifyer": null, "identifyer": 87138, "year": "2011"}, {"autor": "Overgaard", "date": "2011-12-01 16:55:00", "content": "It seems to me that most people feel their Leica is very personal after a short while, even it has no special marking, special leather or other. Hence you meet people who has a grey paint Leica and they love despite the fact they didn't like it to begin with. And want the same camera next time. Or chrome or black. And when you have a stack of cameras in front of you, the one you like the best is usually your own. But also, when you meet someone with a different camera who have made a very decicive choose and are very happy with it, you tend to like that camera too. So this speaks for that one can do nothing or even a general choice of engraving such as no engraving at all, with classic Leica logo, with or without red dot, etc. and you will love the camera in any case. But I would also say that if you feel for getting your own signature or initials - then go for it. As you can send in a Leica for engraving (which usually means they will do the engraving on a brand new top plate and replace the old one with the new one), you may send in an engraved Leica and ask to get a different engraving in case you should want to sell it. I don't know about the MP, but for the M9 the engraving is ca. 200 Euro. So I wouldn't make a big deal out of it. I would simply get whatever makes me happy. Even a poem or a drawing. Should you one day want to sell it and you don't expect the buyer to like the engraving, have it redone to another standard one. And enjoy the 200 Euro expense of having had you own very special camera in the meanwhile. Don't protect cameras that much. It's like leaving the plastic on leather interior in a car for resale value. Don't do that, be the proud owner and use it the way you want to and let the next owner deal with having a second-hans edition.", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/?tab=comments#comment-1859307", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "it seems to me that most people feel their leica is very personal after a short while, even it has no special marking, special leather or other. hence you meet people who has a grey paint leica and they love despite the fact they didn't like it to begin with. and want the same camera next time. or chrome or black. and when you have a stack of cameras in front of you, the one you like the best is usually your own. but also, when you meet someone with a different camera who have made a very decicive choose and are very happy with it, you tend to like that camera too. so this speaks for that one can do nothing or even a general choice of engraving such as no engraving at all, with classic leica logo, with or without red dot, etc. and you will love the camera in any case. but i would also say that if you feel for getting your own signature or initials - then go for it. as you can send in a leica for engraving (which usually means they will do the engraving on a brand new top plate and replace the old one with the new one), you may send in an engraved leica and ask to get a different engraving in case you should want to sell it. i don't know about the mp, but for the m9 the engraving is ca. 200 euro. so -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  a big deal out of it. i would simply get whatever makes me happy. even a poem or a drawing. should you one day want to sell it and you don't expect the buyer to like the engraving, have it redone to another standard one. and enjoy the 200 euro expense of having had you own very special camera in the meanwhile. don't protect cameras that much. it's like leaving the plastic on leather interior in a car for resale value. don't do that, be the proud owner and use it the way you want to and let the next owner deal with having a second-hans edition.", "sortedWord": "None", "Identifyer": null, "identifyer": 87155, "year": "2011"}, {"autor": "mafoofan", "date": "2011-12-01 17:50:00", "content": "Thanks for that reference, Jaap. Here is the standard factory engraving used on M3s (courtesy of http://www.mir.com.my/rb/photography/companies/Leica/index.htm): --img--  In this case, the camera was personalized for Alfred Eisenstaedt. However, the engraving was done the same way for employee cameras and the format was used by Leica up through the M6. I have not seen a standardized format for the M7 or MP, as the regular A la Carte options put the engraving elsewhere. So, my dilemma was whether to stick with the M3-style engraving on the back, or come up with a new format to fit the newer style camera. I chose the latter, as the contemporary MP is not typically engraved like the M3, which includes \"WETZLAR, GERMANY\" on the top of the top plate. Newer models without the classic M3-style engraving on top have always had \"MADE IN GERMANY\" or \"GERMANY\" engraved on the back. Also, the engraved text on the backs of newer Ms is typically aligned against the bottom of the top plate, as opposed to being vertically centered. So, since my MP only says \"LEICA\" on top, I felt it more \"regular\" to go with my modified setup. One thing is for sure: I really can't stand the inclusion of \"LEICA CAMERA\" on the back. In any event, it is redundant branding. Edited December 1, 2011 by mafoofan", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/?tab=comments#comment-1859363", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thanks for that reference, jaap. here is the standard factory engraving used on m3s (courtesy of http://www.mir.com.my/rb/photography/companies/leica/index.htm): --img--  in this case, the camera was personalized for alfred eisenstaedt. however, the engraving was done the same way for employee cameras and the format was used by leica up through the m6. i have not seen a standardized format for the m7 or mp, as the regular a la carte options put the engraving elsewhere. so, my dilemma was whether to stick -----> with !!!  the m3-style engraving on the back, or -----> come !!!  -----> up !!!  -----> with !!!  a new format to fit the newer style camera. i chose the latter, as the contemporary mp is not typically engraved like the m3, which includes \"wetzlar, germany\" on the top of the top plate. newer models without the classic m3-style engraving on top have always had \"made in germany\" or \"germany\" engraved on the back. also, the engraved text on the backs of newer ms is typically aligned against the bottom of the top plate, as opposed to being vertically centered. so, since my mp only says \"leica\" on top, i felt it more \"regular\" to go with my modified setup. one thing is for sure: i really can't stand the inclusion of \"leica camera\" on the back. in any event, it is redundant branding. edited december 1, 2011 by mafoofan", "sortedWord": "None", "Identifyer": null, "identifyer": 87157, "year": "2011"}, {"autor": "jaapv", "date": "2011-12-02 15:34:00", "content": "Basically the value reduction is the general idea - to make it less attractive to steal.", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/page/2/?tab=comments#comment-1860282", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Basically the value reduction is the general idea - to make it less attractive to steal.", "sortedWord": "None", "Identifyer": null, "identifyer": 87161, "year": "2011"}, {"autor": "philipus", "date": "2011-12-02 19:05:00", "content": " Basically the value reduction is the general idea - to make it less attractive to steal. Though I don't think you meant it that way, the inverse of what you've written is that there'd be collectors or their help roaming the streets looking for un-engraved cameras to steal. --img--  You don't need an expert to tell you that a personal engraving will reduce a camera's value --img-- . Like I said... who buys a camera new to allow a collector years down the line to be able to get a mint collector's piece. Good luck with your gift. P", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/page/2/?tab=comments#comment-1860499", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": " Basically the value reduction is the general idea - to make it less attractive to steal. Though I don't think you meant it that way, the inverse of what you've written is that there'd be collectors or their help roaming the streets looking for un-engraved cameras to steal. --img--  You don't need an expert to tell you that a personal engraving will reduce a camera's value --img-- . Like I said... who buys a camera new to allow a collector years down the line to be able to get a mint collector's piece. Good luck with your gift. P", "sortedWord": "None", "Identifyer": null, "identifyer": 87164, "year": "2011"}, {"autor": "menos I M6", "date": "2011-05-25 04:27:00", "content": "Ben, good decision - very reasonable. As has been quoted many times - the 50 Lux ASPH might very well be the best 50mm 1.4 lens, ever made for 35mm format. If you want a culture shock, you could also pick up a classic 50 1.4 in Leica thread mount (LTM or L39, …). There are many manufactured by many different manufacturers, some of them highly regarded. If you compare one of these old lenses side by side in their imaging to the latest and greatest modern Leica 50 Lux ASPH, you see a huuge jump in development. I just got a 1950s Nippon Kogaku Nikkor-S.C 5cm 1:1.4 in LTM mount and I can tell you, the difference, when it comes to optical perfection is astonishing! Don't ask me though, which imaging I prefer for special situations though - special looks in controlled situations - the old lens, purely perfection and sharp, sharp, sharp detail - the 50 Lux ASPH hands down! The Noctilux though for me is the better all around lens - it proves as much light, as technical feasible by Todays lens technology, but also can provide sharp detail, when I need it. I can make it look \"soft\", when I need and I can focus spot on precisely actually quicker and more efficient, than with my 50 Lux ASPH ;-) If you sidestep later to other 50mm, the 50 Lux ASPH was no bad choice, as it remains the technical perfection, it is Today and likely keeps high value over time (look, how long Leica has kept the 50 Cron the principle same optical design in production - I would be surprised, if Leica came up with a new optical design for the 50 Lux ASPH in short term). Enjoy the camera and lens, as soon, you receive it, don't push things, be patient and give the \"getting used to\" some time - it will be very rewarding.", "link": "https://www.l-camera-forum.com/topic/152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14/?tab=comments#comment-1681834", "origin": "L-forum", "suborigin": "152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "ben, good decision - very reasonable. as has been quoted many times - the 50 lux asph might very well be the best 50mm 1.4 lens, ever made for 35mm format. if you want a culture shock, you could also pick up a classic 50 1.4 in leica thread mount (ltm or l39, …). there are many manufactured by many different manufacturers, some of them highly regarded. if you compare one of these old lenses side by side in their imaging to the latest and greatest modern leica 50 lux asph, you see a huuge jump in development. i just got a 1950s nippon kogaku nikkor-s.c 5cm 1:1.4 in ltm mount and i can tell you, the difference, when it comes to optical perfection is astonishing! don't ask me though, which imaging i prefer for special situations though - special looks in controlled situations - the old lens, purely perfection and sharp, sharp, sharp detail - the 50 lux asph hands down! the noctilux though for me is the better all around lens - it proves as much light, as technical feasible by todays lens technology, but also can provide sharp detail, when i need it. -----> i !!!  -----> can !!!  -----> make !!!  it look \"soft\", when -----> i !!!  need and -----> i !!!  -----> can !!!  focus spot on precisely actually quicker and more efficient, than with my 50 lux asph ;-) if you sidestep later to other 50mm, the 50 lux asph was no bad choice, as it remains the technical perfection, it is today and likely keeps high value over time (look, how long leica has kept the 50 cron the principle same optical design in production - -----> i !!!  would be surprised, if leica came up with a new optical design for the 50 lux asph in short term). enjoy the camera and lens, as soon, you receive it, don't push things, be patient and give the \"getting used to\" some time - it will be very rewarding.", "sortedWord": "None", "Identifyer": null, "identifyer": 87510, "year": "2011"}, {"autor": "menos I M6", "date": "2011-05-25 09:49:00", "content": "Thank you all for making me feel very welcome. It's a bit of a refreshing culture shock coming from the slanging matches in the other forums --img--  If you are interested here is my website. Wedding Photography Sydney Ben Newnam - Wedding Photographers Sydney North Shore See if you think the Leica system will suit my style. Always open to constructive critisism. Cheers, Ben Ben, from what I see of your photographs on your site, you will surely love the Leica system! My guess is,that your biggest issues will come up with framing wide angle lenses. It takes a little time, to learn at which approximate distances your framing is where. Manual focus will come natural pretty quickly and the portraiture sure will net great results. (Here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). If you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive Leica branded strobes - just use your old flash system with radio controllers or compatible cords. Don't retire your Canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the Leica M could not do in the shots on your site. For the presented shots, a Noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit.", "link": "https://www.l-camera-forum.com/topic/152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14/page/2/?tab=comments#comment-1681995", "origin": "L-forum", "suborigin": "152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thank you all for making me feel very welcome. it's a bit of a refreshing culture shock coming from the slanging matches in the other forums --img--  if you are interested here is my website. wedding photography sydney ben newnam - wedding photographers sydney north shore see if you think the leica system will suit my style. always open to constructive critisism. cheers, ben ben, from what i see of your photographs on your site, you will surely love the leica system! my guess is,that your biggest issues will -----> come !!!  -----> up !!!  -----> with !!!  framing wide angle lenses. it takes a little time, to learn at which approximate distances your framing is where. manual focus will come natural pretty quickly and the portraiture sure will net great results. (here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). if you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive leica branded strobes - just use your old flash system with radio controllers or compatible cords. don't retire your canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the leica m could not do in the shots on your site. for the presented shots, a noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit.", "sortedWord": "None", "Identifyer": null, "identifyer": 87514, "year": "2011"}, {"autor": "Red Dot Fever", "date": "2011-05-25 12:57:00", "content": " Ben, from what I see of your photographs on your site, you will surely love the Leica system!My guess is,that your biggest issues will come up with framing wide angle lenses. It takes a little time, to learn at which approximate distances your framing is where. Manual focus will come natural pretty quickly and the portraiture sure will net great results. (Here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). If you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive Leica branded strobes - just use your old flash system with radio controllers or compatible cords. Don't retire your Canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the Leica M could not do in the shots on your site. For the presented shots, a Noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit. Thanks for the tips Menos. Like you said, won't be retiring the Nikon anytime soon especially for wedding work. I wouldn't go 100% Leica until I knew it inside out like I do my Nikon. Besides I do shoot a hell of a lot at 200mm at f2 and from what I have read any length past 90mm on a Leica is extremely hard to nail focus. I do love the thought of the 75mm Cron though with a closer focusing than my Nikon 85mm 1.4. Not that the Nikon 85mm 1.4 is renowned for close focusing. I know the 75mm Cron is very close to the 50mm Lux in terms of focal length but I feel I could use them in totally different ways. Cheers, Ben Edited May 25, 2011 by Red Dot Fever", "link": "https://www.l-camera-forum.com/topic/152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14/page/2/?tab=comments#comment-1682191", "origin": "L-forum", "suborigin": "152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " ben, from what i see of your photographs on your site, you will surely love the leica system!my guess is,that your biggest issues will -----> come !!!  -----> up !!!  -----> with !!!  framing wide angle lenses. it takes a little time, to learn at which approximate distances your framing is where. manual focus will come natural pretty quickly and the portraiture sure will net great results. (here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). if you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive leica branded strobes - just use your old flash system with radio controllers or compatible cords. don't retire your canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the leica m could not do in the shots on your site. for the presented shots, a noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit. thanks for the tips menos. like you said, won't be retiring the nikon anytime soon especially for wedding work. i wouldn't go 100% leica until i knew it inside out like i do my nikon. besides i do shoot a hell of a lot at 200mm at f2 and from what i have read any length past 90mm on a leica is extremely hard to nail focus. i do love the thought of the 75mm cron though with a closer focusing than my nikon 85mm 1.4. not that the nikon 85mm 1.4 is renowned for close focusing. i know the 75mm cron is very close to the 50mm lux in terms of focal length but i feel i could use them in totally different ways. cheers, ben edited may 25, 2011 by red dot fever", "sortedWord": "None", "Identifyer": null, "identifyer": 87519, "year": "2011"}, {"autor": "Marquinius", "date": "2011-05-24 11:37:00", "content": "Now this is an interesting turn of events, adding what we feel are the top level B&W photographers of our forum. Let's state one rule: the majority of the (in our forum) published work should be B&W. I'm adding a vote for Ivan's work as well; I've been pushing him for a book. And yes, I'll update the list shortly. I'll make a sideline for forum members, if only to prevent that people like Ivan (who I know as being down to earth) start feeling awkward next to HCB, Dalgado and other dead photographers --img-- ", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/12/?tab=comments#comment-1681211", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "now this is an interesting turn of events, adding what we feel are the top level b&w photographers of our forum. let's state one rule: the majority of the (in our forum) published work should be b&w. i'm adding a vote for ivan's work as well; i've been pushing him for a book. and yes, i'll update the list shortly. -----> i !!! -----> 'll !!!  -----> make !!!  a sideline for forum members, if only to prevent that people like ivan (who -----> i !!!  know as being down to earth) start feeling awkward next to hcb, dalgado and other dead photographers --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 97113, "year": "2011"}, {"autor": "prunelle", "date": "2011-05-29 16:29:00", "content": "I just explored the Masters of Photography site and I saw inspirational things indeed. Names are missing over there: Capa and Cartier-Bresson, for example but I also made discoveries. I retained these as \"inspirational\" to me: Ansel Adams, Margaret Bourke-White, Julia Margaret Cameron, Roy DeCarava, Roger Fenton, Lewis Hine, Andre Kertesz, William Klein, Josef Koudelka, Dorothea Lange, Helen Levitt, Lisette Model, Nadar, Gordon Parks, Jacob Riis, Sebastiao Salgado, W. Eugene Smith.", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/12/?tab=comments#comment-1686173", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "i also made", "selectorShort": "make", "MarkedSent": "i just explored the masters of photography site and i saw inspirational things indeed. names are missing over there: capa and cartier-bresson, for example but -----> i !!!  -----> also !!!  -----> made !!!  discoveries. i retained these as \"inspirational\" to me: ansel adams, margaret bourke-white, julia margaret cameron, roy decarava, roger fenton, lewis hine, andre kertesz, william klein, josef koudelka, dorothea lange, helen levitt, lisette model, nadar, gordon parks, jacob riis, sebastiao salgado, w. eugene smith.", "sortedWord": "None", "Identifyer": null, "identifyer": 97116, "year": "2011"}, {"autor": "adan", "date": "2011-08-15 04:52:00", "content": "For 6x6 street work, I prefer(ed) a Rollei TLR. Usually they are lighter than Hassys (I don't know about the last ultra-fancy GX models), and far less shake for hand-holding (no swinging mirrors and light-proof doors, no double-acting shutter). Significantly quieter than even a Leica M film camera. And the last couple of times I've tried \"discount\" Hassys, the aging backs have had light leaks at the slot where the dark slide goes in. Frankly, after I made 16\" x 16\" prints of the same scene, shot with a Hassy/80 Planar/Ektar 100, and an M9/35 'cron cropped square (which equals \"80mm\" FoV) -- and >90% of viewers could not tell which was which (or picked the M9 print as the \"medium format\" shot) -- I moved on. But everyone should try a Hassy at least once - if only for the fun of field-stripping it down to the component modules. --img-- ", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/?tab=comments#comment-1765789", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "for 6x6 street work, i prefer(ed) a rollei tlr. usually they are lighter than hassys (i don't know about the last ultra-fancy gx models), and far less shake for hand-holding (no swinging mirrors and light-proof doors, no double-acting shutter). significantly quieter than even a leica m film camera. and the last couple of times i've tried \"discount\" hassys, the aging backs have had light leaks at the slot where the dark slide goes in. frankly, after -----> i !!!  -----> made !!!  16\" x 16\" prints of the same scene, shot with a hassy/80 planar/ektar 100, and an m9/35 'cron cropped square (which equals \"80mm\" fov) -- and >90% of viewers could not tell which was which (or picked the m9 print as the \"medium format\" shot) -- -----> i !!!  moved on. but everyone should try a hassy at least once - if only for the fun of field-stripping it down to the component modules. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 103126, "year": "2011"}, {"autor": "Rolo", "date": "2011-08-15 07:27:00", "content": "I have an appended question, without hijacking the thread. Do any members here recommend a good Hasselblad forum that measures up to what we experience here at the LUF? There are several dedicated Hasselblad sites, but they are low key in comparison to LUF. There's an interesting Japanese site, but whilst the photography is excellent, I can't make out the text. For answers, Hasselblad Info is OK, but GetDip is better. I'm sure there are experienced users here, but as images are not allowed it can't develop. By far, the best place to communicate with other Hass users and for viewing serious work is Flickr. There's a dozen or so dedicated and active Hass groups showing great work, incl street. There are world class shooters posting amazing work there. If you want some groups, or names to look for, just ask. --img-- ", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/2/?tab=comments#comment-1765867", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "i have an appended question, without hijacking the thread. do any members here recommend a good hasselblad forum that measures up to what we experience here at the luf? there are several dedicated hasselblad sites, but they are low key in comparison to luf. there's an interesting japanese site, but whilst the photography is excellent, -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  out the text. for answers, hasselblad info is ok, but getdip is better. i'm sure there are experienced users here, but as images are not allowed it can't develop. by far, the best place to communicate with other hass users and for viewing serious work is flickr. there's a dozen or so dedicated and active hass groups showing great work, incl street. there are world class shooters posting amazing work there. if you want some groups, or names to look for, just ask. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 103130, "year": "2011"}, {"autor": "erl", "date": "2011-08-17 02:33:00", "content": "Now that could be quite a bold claim depending on your region, so please do set your 'record straight'. Already done. Read my assertion in previous posts. I am where I am in the market, and proud of it. Your contention now seems to be that you are excelling in a different direction to your local competition because you once used a Hasselblad but now use a Leica!.[Why? I would be happy to be proven wrong. I make no contentions about directions, only about selections of work that I will accept. Because I like using Leica, and because of it's form factor, I choose to use it. Last week, I shot a stage production using both Leica and Hasselblad. The client actually noticed I was using the Hasselblad again and reminisced about the days when that was all I used. My style has evolved over the years, a necessity for anyone to stay at the forefront, and it continues to change. That's my decision and I am comfortable with it. Meanwhile, I see my competition come and go. That's life. To be perfectly clear, I survive because of my experience and skills, not because of any gear I use. One of my skills is the choice of gear for the job.", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/3/?tab=comments#comment-1767723", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "now that could be quite a bold claim depending on your region, so please do set your 'record straight'. already done. read my assertion in previous posts. i am where i am in the market, and proud of it. your contention now seems to be that you are excelling in a different direction to your local competition because you once used a hasselblad but now use a leica!.[why? i would be happy to be proven wrong. -----> i !!!  -----> make !!!  no contentions about directions, only about selections of work that -----> i !!!  will accept. because i like using leica, and because of it's form factor, i choose to use it. last week, i shot a stage production using both leica and hasselblad. the client actually noticed i was using the hasselblad again and reminisced about the days when that was all i used. my style has evolved over the years, a necessity for anyone to stay at the forefront, and it continues to change. that's my decision and i am comfortable with it. meanwhile, i see my competition come and go. that's life. to be perfectly clear, i survive because of my experience and skills, not because of any gear i use. one of my skills is the choice of gear for the job.", "sortedWord": "None", "Identifyer": null, "identifyer": 103161, "year": "2011"}, {"autor": "plasticman", "date": "2011-08-17 09:46:00", "content": "I also own a 500CM and find that it's a beautiful and really solid camera to use. I'm finding it harder than I thought to adapt to the square format in composing, and I often find that images that appear dynamic in the standard 35mm format somehow don't 'work' within the square frame. What this means is that I simply haven't used the camera enough yet. But having to explore and adapt means that I'm brimming with ideas for shoots - which is something that I rarely do with my 35mm equipment (I use those to record my life instead, if that makes sense). As for the quality of the negatives - they are so amazing, even my mundane pictures have a breathtaking quality to the sheer look of them. I only wish the subject and composition did them justice - but that's where talent comes in. --img-- ", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/3/?tab=comments#comment-1767896", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "[ideas, makes]", "selectorShort": "idea", "MarkedSent": "I also own a 500CM and find that it's a beautiful and really solid camera to use. I'm finding it harder than I thought to adapt to the square format in composing, and I often find that images that appear dynamic in the standard 35mm format somehow don't 'work' within the square frame. What this means is that I simply haven't used the camera enough yet. But having to explore and adapt means that I'm brimming with ideas for shoots - which is something that I rarely do with my 35mm equipment (I use those to record my life instead, if that makes sense). As for the quality of the negatives - they are so amazing, even my mundane pictures have a breathtaking quality to the sheer look of them. I only wish the subject and composition did them justice - but that's where talent comes in. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 103167, "year": "2011"}, {"autor": "too old to care", "date": "2011-08-23 01:02:00", "content": " The 501C came this afternoon. I loaded it and took it to the park and shot a roll of film. After that I developed it and currently it is drying in the basement. Later I am going to print a couple of 11x14's to judge the sharpness. So far all is well. I now know why so many Leica owners also have Hasselblads. I think I am really going to like this camera. Thanks again for the suggestions. Oh, I also forgot how nice it is to work with a large negative. Wayne", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/6/?tab=comments#comment-1772784", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " the 501c came this afternoon. i loaded it and took it to the park and shot a roll of film. after that -----> i !!!  -----> developed !!!  it and currently it is drying in the basement. later i am going to print a couple of 11x14's to judge the sharpness. so far all is well. i now know why so many leica owners also have hasselblads. i think i am really going to like this camera. thanks again for the suggestions. oh, i also forgot how nice it is to work with a large negative. wayne", "sortedWord": "None", "Identifyer": null, "identifyer": 103214, "year": "2011"}, {"autor": "pico", "date": "2011-08-23 01:15:00", "content": "The 501C came this afternoon. I loaded it and took it to the park and shot a roll of film. After that I developed it and currently it is drying in the basement. Later I am going to print a couple of 11x14's to judge the sharpness. So far all is well. I now know why so many Leica owners also have Hasselblads. I think I am really going to like this camera. Thanks again for the suggestions. Oh, I also forgot how nice it is to work with a large negative. Wayne Please keep in mind that 'infininty' on a and 501 is very far away. I still find it necessary to focus carefully at distant subjects. I will look carefully for such in your photos.", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/6/?tab=comments#comment-1772790", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "the 501c came this afternoon. i loaded it and took it to the park and shot a roll of film. after that -----> i !!!  -----> developed !!!  it and currently it is drying in the basement. later i am going to print a couple of 11x14's to judge the sharpness. so far all is well. i now know why so many leica owners also have hasselblads. i think i am really going to like this camera. thanks again for the suggestions. oh, i also forgot how nice it is to work with a large negative. wayne please keep in mind that 'infininty' on a and 501 is very far away. i still find it necessary to focus carefully at distant subjects. i will look carefully for such in your photos.", "sortedWord": "None", "Identifyer": null, "identifyer": 103215, "year": "2011"}, {"autor": "tobey bilek", "date": "2011-12-23 13:24:00", "content": "Sorry Algrove. PS5 and bridge does it all for me. I use the Picture file in my iMac os to store all the photos in date order. Then there is an event named, Florida vacation, Xmas party etc. The date is always first and exactly the same format. yyyy/mo/dy There are subfolders for original files, ps files, finals, with sub sub folders for further separation. Not complicated because I make a master 2011-13-00 with all the required folders. Then file duplicate. and I get a copy 1. When time to download a new project, I go to pictures and retitle copy 1 and make a new dup for next time. Bridge or LR, if you wish to import to LR, can find the folder and you can process the images. I take advantage of presets to speed things, Some for Nikon, some for Leica I download from bridge using file>get photos from camera. This function is nice because all the new files are on top. Image capture and nikon transfer also work. Bridge and Transfer are nice because I can specify a back up location on second drive and both are loaded at the same time. Now open the raws in ACR and apply the preset for say M9. The preset will have the sharpening curve, exposure defaults, WB, clarity,saturation, and camera standard rather than ADobe Standard all backed in. Then Select all, synchronize and all the photos get all the settings applied. Then you can open individuals and fine tune each as required. How much work you do here is what separated the men from the boys. The same can be done from Bridge, file> ??> use previous conversion and this avoids opening all in ACR. Presets and a premade folder set make all this very easy. And I do not have an application like LR or Aperture \"own\" all the files.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/4/?tab=comments#comment-1878697", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "sorry algrove. ps5 and bridge does it all for me. i use the picture file in my imac os to store all the photos in date order. then there is an event named, florida vacation, xmas party etc. the date is always first and exactly the same format. yyyy/mo/dy there are subfolders for original files, ps files, finals, with sub sub folders for further separation. not complicated because -----> i !!!  -----> make !!!  a master 2011-13-00 with all the required folders. then file duplicate. and i get a copy 1. when time to download a new project, i go to pictures and retitle copy 1 and make a new dup for next time. bridge or lr, if you wish to import to lr, can find the folder and you can process the images. i take advantage of presets to speed things, some for nikon, some for leica i download from bridge using file>get photos from camera. this function is nice because all the new files are on top. image capture and nikon transfer also work. bridge and transfer are nice because i can specify a back up location on second drive and both are loaded at the same time. now open the raws in acr and apply the preset for say m9. the preset will have the sharpening curve, exposure defaults, wb, clarity,saturation, and camera standard rather than adobe standard all backed in. then select all, synchronize and all the photos get all the settings applied. then you can open individuals and fine tune each as required. how much work you do here is what separated the men from the boys. the same can be done from bridge, file> ??> use previous conversion and this avoids opening all in acr. presets and a premade folder set make all this very easy. and i do not have an application like lr or aperture \"own\" all the files.", "sortedWord": "None", "Identifyer": null, "identifyer": 111455, "year": "2011"}, {"autor": "wlaidlaw", "date": "2011-03-28 20:36:00", "content": "I should have made it clearer that it was the last sentence in the paragraph staring \"Prerequisite for placing a photo...\", which reads: \"In general, photographs taken without the use of Leica equipment are not permitted\" to which I was referring. I felt this sentence was slightly in conflict with the first sentence, which does permit the use of other cameras to take photos of Leica equipment. I accept that I might be being somewhat pernickety but to avoid any conflict or misinterpretation between the two sentences, the last one might be better worded as \"In general, photographs taken without the use of Leica equipment are not permitted, unless the photograph illustrates Leica equipment\" or possibly missed out altogether, as it really duplicates what has already been said in the first sentence. Wilson", "link": "https://www.l-camera-forum.com/topic/6780-rules-in-the-leica-forum/page/3/?tab=comments#comment-1628403", "origin": "L-forum", "suborigin": "6780-rules-in-the-leica-forum", "result": true, "Selector": "i should have made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> should !!!  -----> have !!!  -----> made !!!  it clearer that it was the last sentence in the paragraph staring \"prerequisite for placing a photo...\", which reads: \"in general, photographs taken without the use of leica equipment are not permitted\" to which -----> i !!!  was referring. i felt this sentence was slightly in conflict with the first sentence, which does permit the use of other cameras to take photos of leica equipment. i accept that i might be being somewhat pernickety but to avoid any conflict or misinterpretation between the two sentences, the last one might be better worded as \"in general, photographs taken without the use of leica equipment are not permitted, unless the photograph illustrates leica equipment\" or possibly missed out altogether, as it really duplicates what has already been said in the first sentence. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 115847, "year": "2011"}, {"autor": "dhsimmonds", "date": "2011-04-05 07:31:00", "content": "This is a very interesting thread. I have never made a secret of the fact that my mainstream camera is no longer a Leica, once I knew for definite that the much promised \"R10\" was never to be produced. However I have a huge regard for the Leica brand and made quite a number of very good contacts on this forum and so try to keep in touch by staying registered, I still have my panaleica LC2 and Leica DL4. Although whenever appropriate I will mention other brands when replying to some posts, I would NEVER post an image from anything other than a Leica or taken with a Leica lens. Some years ago when the \"R10\" was very much considered sort of \"imminent\", a well known European Leica trustee and beta tester, posted an image reputedly taken with an R10 on the forum. As a keen potential buyer, I immediately downloaded the image from the forum and studied it avidly, including the exif data which told me that it had been taken with a then new Canon full frame DSLR. I promptly exposed this myth on the forum as I am a \"spoil sport!\"!--img--  However my point is, are images examined to verify their compliance according to the rules? That one wasn't! The magazine LFI will certainly reject images that are not taken with a LEICA camera showing Leica Exif data. The Panasonics with Leica branded lenses are not acceptable to LFI. Another spanner in the works is that software exists and is easily obtainable to strip and replace exif data. Why anyone would wish to spend money and time on doing this is beyond me, but we should all be aware of it anyway. Who would be a Mod these days!!!!!--img-- ", "link": "https://www.l-camera-forum.com/topic/6780-rules-in-the-leica-forum/page/4/?tab=comments#comment-1636108", "origin": "L-forum", "suborigin": "6780-rules-in-the-leica-forum", "result": true, "Selector": "i have never made", "selectorShort": "make", "MarkedSent": "this is a very interesting thread. -----> i !!!  -----> have !!!  -----> never !!!  -----> made !!!  a secret of the fact that my mainstream camera is no longer a leica, once -----> i !!!  knew for definite that the much promised \"r10\" was -----> never !!!  to be produced. however i have a huge regard for the leica brand and made quite a number of very good contacts on this forum and so try to keep in touch by staying registered, i still have my panaleica lc2 and leica dl4. although whenever appropriate i will mention other brands when replying to some posts, i would never post an image from anything other than a leica or taken with a leica lens. some years ago when the \"r10\" was very much considered sort of \"imminent\", a well known european leica trustee and beta tester, posted an image reputedly taken with an r10 on the forum. as a keen potential buyer, i immediately downloaded the image from the forum and studied it avidly, including the exif data which told me that it had been taken with a then new canon full frame dslr. i promptly exposed this myth on the forum as i am a \"spoil sport!\"!--img--  however my point is, are images examined to verify their compliance according to the rules? that one wasn't! the magazine lfi will certainly reject images that are not taken with a leica camera showing leica exif data. the panasonics with leica branded lenses are not acceptable to lfi. another spanner in the works is that software exists and is easily obtainable to strip and replace exif data. why anyone would wish to spend money and time on doing this is beyond me, but we should all be aware of it anyway. who would be a mod these days!!!!!--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 115863, "year": "2011"}, {"autor": "erl", "date": "2011-12-05 11:43:00", "content": "How do you guys do it? I'll be lucky if I could book a couple of weeks in advance. No idea if I will make Copenhagen. I have Vietnam and China on my list, and of course a return to Napoli to recover what I 'left' behind. --img--  Then there is Southern India too. All dreams of course, but what else is there in life? I enjoy what actually happens at the time so will wait and see. Just finished my book on Venice (2010 Challenge). Will send it to Blurb in a day or two. The trouble with these trips, they create soooo much work to be completed. --img-- ", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/2/?tab=comments#comment-1862732", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "how do you guys do it? i'll be lucky if i could book a couple of weeks in advance. no idea if -----> i !!!  -----> will !!!  -----> make !!!  copenhagen. i have vietnam and china on my list, and of course a return to napoli to recover what i 'left' behind. --img--  then there is southern india too. all dreams of course, but what else is there in life? i enjoy what actually happens at the time so will wait and see. just finished my book on venice (2010 challenge). will send it to blurb in a day or two. the trouble with these trips, they create soooo much work to be completed. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136994, "year": "2011"}, {"autor": "earleygallery", "date": "2011-11-09 22:47:00", "content": "Likewise, depending on date. I can probably make the 30th but will be working in the morning.", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/?tab=comments#comment-1839627", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i can probably make", "selectorShort": "make", "MarkedSent": "likewise, depending on date. -----> i !!!  -----> can !!!  -----> probably !!!  -----> make !!!  the 30th but will be working in the morning.", "sortedWord": "None", "Identifyer": null, "identifyer": 137617, "year": "2011"}, {"autor": "Tim B", "date": "2011-11-12 19:58:00", "content": "Sadly, I doubt I can make the 30th. I'll be working through to 1st Jan. My time off will be during the first week of the new year. However I might try to swap some off time with colleagues and see what can be done if 30th is decided upon by the Group. It'll be a shame to miss two meets in a row. Tim", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/?tab=comments#comment-1842148", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "sadly, -----> i !!!  doubt -----> i !!!  -----> can !!!  -----> make !!!  the 30th. i'll be working through to 1st jan. my time off will be during the first week of the new year. however i might try to swap some off time with colleagues and see what can be done if 30th is decided upon by the group. it'll be a shame to miss two meets in a row. tim", "sortedWord": "None", "Identifyer": null, "identifyer": 137621, "year": "2011"}, {"autor": "andybarton", "date": "2011-11-19 16:41:00", "content": "Just to advise that I can no longer make the 30th December.", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/?tab=comments#comment-1848216", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i can no longer make", "selectorShort": "make", "MarkedSent": "just to advise that -----> i !!!  -----> can !!!  -----> no !!!  -----> longer !!!  -----> make !!!  the 30th december.", "sortedWord": "None", "Identifyer": null, "identifyer": 137628, "year": "2011"}, {"autor": "Tim B", "date": "2011-11-23 19:42:00", "content": " I can now make the 30th December. Seasonal bribes work wonders in workplace negotiations!--img--  Tim", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/2/?tab=comments#comment-1851903", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i can now make", "selectorShort": "make", "MarkedSent": " -----> i !!!  -----> can !!!  -----> now !!!  -----> make !!!  the 30th december. seasonal bribes work wonders in workplace negotiations!--img--  tim", "sortedWord": "None", "Identifyer": null, "identifyer": 137632, "year": "2011"}, {"autor": "lanetomlane", "date": "2011-12-21 08:41:00", "content": "Would like to be able to attend this meeting but not sure at the moment ...... have to visit relations north of the Watford Gap sometime over the holiday period. Will certainly try our best to be there but if we don't make it hope everyone has a good time and that the light is perfect for you. Assuming someone will take a snap or two. _____________________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/2/?tab=comments#comment-1876692", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "we don't make", "selectorShort": "make", "MarkedSent": "would like to be able to attend this meeting but not sure at the moment ...... have to visit relations north of the watford gap sometime over the holiday period. will certainly try our best to be there but if -----> we !!!  -----> do !!! -----> n't !!!  -----> make !!!  it hope everyone has a good time and that the light is perfect for you. assuming someone will take a snap or two. _____________________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 137642, "year": "2011"}, {"autor": "theno23", "date": "2011-12-27 14:52:00", "content": "I can probably make this, but it's a bit hard to be sure. If I'm in town I'll be there, I live about 20 mins walk from the RFH. - Steve", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/2/?tab=comments#comment-1881169", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i can probably make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> can !!!  -----> probably !!!  -----> make !!!  this, but it's a bit hard to be sure. if i'm in town i'll be there, i live about 20 mins walk from the rfh. - steve", "sortedWord": "None", "Identifyer": null, "identifyer": 137650, "year": "2011"}, {"autor": "doyouwabisabi", "date": "2011-12-28 16:17:00", "content": "Pete, Thanks for the post, I hope to make it down. Glenn", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/3/?tab=comments#comment-1882144", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i hope to make", "selectorShort": "make", "MarkedSent": "pete, thanks for the post, -----> i !!!  -----> hope !!!  -----> to !!!  -----> make !!!  it down. glenn", "sortedWord": "None", "Identifyer": null, "identifyer": 137654, "year": "2011"}, {"autor": "Tim B", "date": "2011-12-29 22:13:00", "content": "Sadly, after all my plans, the fickleness of family arrangements has meant that it is now unlikely that I shall make tomorrow's meeting. I shall be sorry to miss it - have a good time. Happy New Year to all. Tim", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/3/?tab=comments#comment-1883364", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i shall make", "selectorShort": "make", "MarkedSent": "sadly, after all my plans, the fickleness of family arrangements has meant that it is now unlikely that -----> i !!!  -----> shall !!!  -----> make !!!  tomorrow's meeting. i shall be sorry to miss it - have a good time. happy new year to all. tim", "sortedWord": "None", "Identifyer": null, "identifyer": 137656, "year": "2011"}, {"autor": "stunsworth", "date": "2011-12-31 11:45:00", "content": "Pete, it sounds as if you had a good time regardless of the market not being there. Sorry I couldn't make it, maybe next time.", "link": "https://www.l-camera-forum.com/topic/165935-london-christmas-or-new-year-meet/page/3/?tab=comments#comment-1884756", "origin": "L-forum", "suborigin": "165935-london-christmas-or-new-year-meet", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "pete, it sounds as if you had a good time regardless of the market not being there. sorry -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it, maybe next time.", "sortedWord": "None", "Identifyer": null, "identifyer": 137661, "year": "2011"}, {"autor": "hlockwood", "date": "2011-12-29 19:50:00", "content": "From the RF Forum: We seem to have enough yeas to constitute a quorum. But we need to separate the \"I'd like to...\" from the \"I will...\" because I'll need to reserve adequate space at the Beacon Tavern, and Sunday afternoon is brunch time for many. So, if you're relatively certain that you'll attend, I'd like to hear from you. You can contact me most easily by email: hflockwoodATverizonDOTnet, or pm me if that's better for you. As for the rules of the meeting, there are none. Bring gear (rf or not; film or digital), bring photos, or come empty handed. Very informal, very friendly, no age discrimination; the latter to protect me. And as for the door prize, only one restriction. Because he picked his own name out of the hat last time, we're not going to let ColSebastianMoran (Rick) pick the winner this time. Two in a row will strain our credibility. Lastly, if you know a photographer who may be unaware of these meetings, please bring him/her into the fold. And BTW, it would be very nice to have the fair sex represented; we know you're out there. Harry Again, from RFF.com: \"Russell, Thanks for the input. We have 9 people who've said that they would come or would try to come on the 15th. One said that he could also make it on the 29th. Nevertheless, you have a valid point. I did invite folks to email or pm me, message #19; so far only 2 responses. --img--  While I think we should keep the venue, the date is still flexible. I will, however, need at least a few days, preferably one week to arrange for the meeting with the Beacon Tavern. So, let's set up a vote. Three choices: 15th; 29th; either. Since the email/pm route hasn't been as productive as I had hoped, let's make it a public ballot. Respond to this message with your choice of dates. But please be timely in your response; the runway is getting short. Harry (Like film, the semicolon is not dead. --img--  )\" ____________ Hey, Leica Forum folks from the Boston area: No takers? Edited December 29, 2011 by hlockwood small correction", "link": "https://www.l-camera-forum.com/topic/169156-boston-meet-up-jan-15/?tab=comments#comment-1883255", "origin": "L-forum", "suborigin": "169156-boston-meet-up-jan-15", "result": true, "Selector": "'s make", "selectorShort": "make", "MarkedSent": "from the rf forum: we seem to have enough yeas to constitute a quorum. but we need to separate the \"i'd like to...\" from the \"i will...\" because i'll need to reserve adequate space at the beacon tavern, and sunday afternoon is brunch time for many. so, if you're relatively certain that you'll attend, i'd like to hear from you. you can contact me most easily by email: hflockwoodatverizondotnet, or pm me if that's better for you. as for the rules of the meeting, there are none. bring gear (rf or not; film or digital), bring photos, or come empty handed. very informal, very friendly, no age discrimination; the latter to protect me. and as for the door prize, only one restriction. because he picked his own name out of the hat last time, we're not going to let colsebastianmoran (rick) pick the winner this time. two in a row will strain our credibility. lastly, if you know a photographer who may be unaware of these meetings, please bring him/her into the fold. and btw, it would be very nice to have the fair sex represented; we know you're out there. harry again, from rff.com: \"russell, thanks for the input. we have 9 people who've said that they would come or would try to come on the 15th. one said that he could also make it on the 29th. nevertheless, you have a valid point. i did invite folks to email or pm me, message #19; so far only 2 responses. --img--  while i think we should keep the venue, the date is still flexible. i will, however, need at least a few days, preferably one week to arrange for the meeting with the beacon tavern. so, let's set up a vote. three choices: 15th; 29th; either. since the email/pm route hasn't been as productive as i had hoped, let-----> 's !!!  -----> make !!!  it a public ballot. respond to this message with your choice of dates. but please be timely in your response; the runway is getting short. harry (like film, the semicolon is not dead. --img--  )\" ____________ hey, leica forum folks from the boston area: no takers? edited december 29, 2011 by hlockwood small correction", "sortedWord": "None", "Identifyer": null, "identifyer": 137672, "year": "2011"}, {"autor": "farnz", "date": "2011-08-27 17:17:00", "content": "Two for dinner, please, Pete. Does the restaurant need to know what people will be ordering? Catering for 20 (odd) people all at once, properly, is a challenge in itself, if they have no forewarning. Thanks, Andy. I'll make contact with the restaurant again when I have an idea of the numbers and those who are interested in a set menu. Pete.", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/?tab=comments#comment-1777074", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "two for dinner, please, pete. does the restaurant need to know what people will be ordering? catering for 20 (odd) people all at once, properly, is a challenge in itself, if they have no forewarning. thanks, andy. -----> i !!! -----> 'll !!!  -----> make !!!  contact with the restaurant again when -----> i !!!  have an idea of the numbers and those who are interested in a set menu. pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137678, "year": "2011"}, {"autor": "masjah", "date": "2011-09-03 21:02:00", "content": "Sorry people - Marilyn and I can't make it again this year! We'll have to content ourselves with the UK Seaside Challenge until October next year. Have a great time!", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/2/?tab=comments#comment-1783838", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "sorry people - marilyn and -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it again this year! we'll have to content ourselves with the uk seaside challenge until october next year. have a great time!", "sortedWord": "None", "Identifyer": null, "identifyer": 137694, "year": "2011"}, {"autor": "farnz", "date": "2011-09-25 23:47:00", "content": "... Unless I've missed it - in which case slap my wrist and point me in the right direction - don't we usually have an informal meet-up on the Friday evening somewhere? If so where are we gathering this time? simplest would obviously be where we are lunching next day, but is there anywhere else? Pete...? I have a bar in mind of which I have several pictures but regrettably no name. I know approximately where it is and I've tried to work out it's name and address using stealth and the internet but sadly without success. So rather than have hordes of Leica-toting photographers roaming Palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east Palermo\" it might be best if we make Friday's informal meeting place the cafe where we're due to start the challenge on the Saturday. So it's Antico Caffe Spinatto at Via Principe Belmonte at 7.30 pm. (There's a weblink and map in the arrangements and rules pdf.) If anyone would like to swap mobile numbers then please PM me. Pete.", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/3/?tab=comments#comment-1802530", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "... unless i've missed it - in which case slap my wrist and point me in the right direction - don't we usually have an informal meet-up on the friday evening somewhere? if so where are we gathering this time? simplest would obviously be where we are lunching next day, but is there anywhere else? pete...? i have a bar in mind of which i have several pictures but regrettably no name. i know approximately where it is and i've tried to work out it's name and address using stealth and the internet but sadly without success. so rather than have hordes of leica-toting photographers roaming palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east palermo\" it might be best if -----> we !!!  -----> make !!!  friday's informal meeting place the cafe where -----> we !!! 're due to start the challenge on the saturday. so it's antico caffe spinatto at via principe belmonte at 7.30 pm. (there's a weblink and map in the arrangements and rules pdf.) if anyone would like to swap mobile numbers then please pm me. pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137718, "year": "2011"}, {"autor": "erl", "date": "2011-09-26 01:04:00", "content": " I have a bar in mind of which I have several pictures but regrettably no name. I know approximately where it is and I've tried to work out it's name and address using stealth and the internet but sadly without success. So rather than have hordes of Leica-toting photographers roaming Palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east Palermo\" it might be best if we make Friday's informal meeting place the cafe where we're due to start the challenge on the Saturday. So it's Antico Caffe Spinatto at Via Principe Belmonte at 7.30 pm. (There's a weblink and map in the arrangements and rules pdf.) Hey Pete, I thought the whole idea of this jaunt was to be \"a challenge!\" --img--  If anyone would like to swap mobile numbers then please PM me. Pete. Does anyone know if the SIM card I bought in Venice last year will work still, in Palermo, presumably with a 're-charge' somehow?", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/3/?tab=comments#comment-1802579", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": " i have a bar in mind of which i have several pictures but regrettably no name. i know approximately where it is and i've tried to work out it's name and address using stealth and the internet but sadly without success. so rather than have hordes of leica-toting photographers roaming palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east palermo\" it might be best if -----> we !!!  -----> make !!!  friday's informal meeting place the cafe where -----> we !!! 're due to start the challenge on the saturday. so it's antico caffe spinatto at via principe belmonte at 7.30 pm. (there's a weblink and map in the arrangements and rules pdf.) hey pete, i thought the whole idea of this jaunt was to be \"a challenge!\" --img--  if anyone would like to swap mobile numbers then please pm me. pete. does anyone know if the sim card i bought in venice last year will work still, in palermo, presumably with a 're-charge' somehow?", "sortedWord": "None", "Identifyer": null, "identifyer": 137719, "year": "2011"}, {"autor": "lanetomlane", "date": "2011-10-03 07:21:00", "content": "I have a bar in mind of which I have several pictures but regrettably no name. I know approximately where it is and I've tried to work out it's name and address using stealth and the internet but sadly without success. So rather than have hordes of Leica-toting photographers roaming Palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east Palermo\" it might be best if we make Friday's informal meeting place the cafe where we're due to start the challenge on the Saturday. So it's Antico Caffe Spinatto at Via Principe Belmonte at 7.30 pm. (There's a weblink and map in the arrangements and rules pdf.) If anyone would like to swap mobile numbers then please PM me. Pete. Eileen and I will be there. Looking forward to catching up with everyone again. Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/3/?tab=comments#comment-1808424", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "i have a bar in mind of which i have several pictures but regrettably no name. i know approximately where it is and i've tried to work out it's name and address using stealth and the internet but sadly without success. so rather than have hordes of leica-toting photographers roaming palermo looking for \"a bar with aluminium chairs and tables on the pavement, a red awning, and a some interesting neon signs inside somewhere in east palermo\" it might be best if -----> we !!!  -----> make !!!  friday's informal meeting place the cafe where -----> we !!! 're due to start the challenge on the saturday. so it's antico caffe spinatto at via principe belmonte at 7.30 pm. (there's a weblink and map in the arrangements and rules pdf.) if anyone would like to swap mobile numbers then please pm me. pete. eileen and i will be there. looking forward to catching up with everyone again. cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 137729, "year": "2011"}, {"autor": "farnz", "date": "2011-10-11 20:22:00", "content": "Okay I've made it to Palermo this evening but I'm travelling to Taormina for two days tomorrow so I shall be back in Palermo on Friday evening. It's \"hot hot hot\"! Pete.", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/4/?tab=comments#comment-1815556", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "okay -----> i !!! 've -----> made !!!  it to palermo this evening but i'm travelling to taormina for two days tomorrow so i shall be back in palermo on friday evening. it's \"hot hot hot\"! pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137744, "year": "2011"}, {"autor": "Nick De Marco", "date": "2011-10-20 08:29:00", "content": "Many thanks guys The biggest reservation I have about Hipstamatic on an iPhone is when I think I have taken a better photo than on my proper camera gear, and wondering why I bother! My Challenge submission will probably be rubbish now! In truth though, of course the iphone and Hipstamatic is seriously limited - I have made some nice 7x7 prints but wouldn't want larger, one focal length lens only, no real control over iso exposure or focus etc etc. But that's all kind of the joy too. The main rason I shall try and upgrade to an iPhone 4s is that I am using the iPhone for photography with Hipstamatic nearly every day now - though it will never really compete or replace my real cameras - and I'm hoping the 4s upgrade will allow for even nicer results...", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/7/?tab=comments#comment-1821720", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "many thanks guys the biggest reservation i have about hipstamatic on an iphone is when i think i have taken a better photo than on my proper camera gear, and wondering why i bother! my challenge submission will probably be rubbish now! in truth though, of course the iphone and hipstamatic is seriously limited - -----> i !!!  -----> have !!!  -----> made !!!  some nice 7x7 prints but wouldn't want larger, one focal length lens only, no real control over iso exposure or focus etc etc. but that's all kind of the joy too. the main rason i shall try and upgrade to an iphone 4s is that i am using the iphone for photography with hipstamatic nearly every day now - though it will never really compete or replace my real cameras - and i'm hoping the 4s upgrade will allow for even nicer results...", "sortedWord": "None", "Identifyer": null, "identifyer": 137809, "year": "2011"}, {"autor": "tri", "date": "2011-10-21 23:21:00", "content": "Thanks for all pictures of John (Earl) The Streetshooter is visible in the third one. His inner joyfulness is one of the keys for John's impressive portfolios imo. It can't be ordered on the internet. We all have close role models and should keep on meeting them in person. Thank you for the inspiration of one from way yonder. Next meeting in Le Mans --img--  . But in October? Anybody a chance there compared to Dirk's pictures? Why not the Challenge next year in May or June, before the summer season, not after? I really wish I could have made to Palermo, but I couldn't on that exact date. Best regards, Simon", "link": "https://www.l-camera-forum.com/topic/160354-palermo-one-challenge-the-arrangements-and-the-rules/page/9/?tab=comments#comment-1823381", "origin": "L-forum", "suborigin": "160354-palermo-one-challenge-the-arrangements-and-the-rules", "result": true, "Selector": "i could have made", "selectorShort": "make", "MarkedSent": "thanks for all pictures of john (earl) the streetshooter is visible in the third one. his inner joyfulness is one of the keys for john's impressive portfolios imo. it can't be ordered on the internet. we all have close role models and should keep on meeting them in person. thank you for the inspiration of one from way yonder. next meeting in le mans --img--  . but in october? anybody a chance there compared to dirk's pictures? why not the challenge next year in may or june, before the summer season, not after? -----> i !!!  really wish -----> i !!!  -----> could !!!  -----> have !!!  -----> made !!!  to palermo, but -----> i !!!  -----> could !!! n't on that exact date. best regards, simon", "sortedWord": "None", "Identifyer": null, "identifyer": 137837, "year": "2011"}, {"autor": "andybarton", "date": "2011-10-24 16:01:00", "content": "How about here? Magnum Contact Sheets | Magnum Events Worth travelling 200 miles on a train for. (Not that the pub for lunch, drink and a good chat aren't of course --img--  ) Edit: Unfortunately, they are not open on Saturdays - not very user-friendly... --img--  Regardless, I will try to make an effort to go when I am next in London. It looks very interesting. Edited October 24, 2011 by andybarton", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/?tab=comments#comment-1825325", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i will try to make", "selectorShort": "make", "MarkedSent": "how about here? magnum contact sheets | magnum events worth travelling 200 miles on a train for. (not that the pub for lunch, drink and a good chat aren't of course --img--  ) edit: unfortunately, they are not open on saturdays - not very user-friendly... --img--  regardless, -----> i !!!  -----> will !!!  -----> try !!!  -----> to !!!  -----> make !!!  an effort -----> to !!!  go when -----> i !!!  am next in london. it looks very interesting. edited october 24, 2011 by andybarton", "sortedWord": "None", "Identifyer": null, "identifyer": 137908, "year": "2011"}, {"autor": "George James", "date": "2011-11-03 06:29:00", "content": "Tim, It appears that the 26th would have suited most. As I don't live in London, I was hoping either David (viramati) or another member more familiar with the area, would come up with a suitable venue in central London.", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/2/?tab=comments#comment-1833331", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "tim, it appears that the 26th would have suited most. as i don't live in london, i was hoping either david (viramati) or another member more familiar -----> with !!!  the area, would -----> come !!!  -----> up !!!  -----> with !!!  a suitable venue in central london.", "sortedWord": "None", "Identifyer": null, "identifyer": 137934, "year": "2011"}, {"autor": "Nick De Marco", "date": "2011-11-03 08:21:00", "content": "Ugh Qpr at home to Norwich on 26 November, and as we forked out for our season tickets Ripon and I shall have to go Sorry to miss it --img-- Hope we can make the next one", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/2/?tab=comments#comment-1833396", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": "ugh qpr at home to norwich on 26 november, and as we forked out for our season tickets ripon and i shall have to go sorry to miss it --img-- hope -----> we !!!  -----> can !!!  -----> make !!!  the next one", "sortedWord": "None", "Identifyer": null, "identifyer": 137936, "year": "2011"}, {"autor": "eschlogelhofer", "date": "2011-11-07 17:03:00", "content": " Hi All - just noticed the thread - I also enjoyed the meeting in the summer - would love to join you again - I made a note of the 27th - I could also make the 26th of November - look forward to it - thanks, ernst.", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/3/?tab=comments#comment-1837445", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " hi all - just noticed the thread - -----> i !!!  also enjoyed the meeting in the summer - would love to join you again - -----> i !!!  -----> made !!!  a note of the 27th - -----> i !!!  could also make the 26th of november - look forward to it - thanks, ernst.", "sortedWord": "None", "Identifyer": null, "identifyer": 137949, "year": "2011"}, {"autor": "farnz", "date": "2011-11-07 17:15:00", "content": "Hi All - just noticed the thread - I also enjoyed the meeting in the summer - would love to join you again - I made a note of the 27th - I could also make the 26th of November - look forward to it - thanks, ernst. Hi, Ernst, it will be nice to meet you again. Would you very kindly press the \"Thanks\" button on my original post so I can keep track of numbers please?--img--  Thanks, Pete.", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/3/?tab=comments#comment-1837461", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "hi all - just noticed the thread - -----> i !!!  also enjoyed the meeting in the summer - would love to join you again - -----> i !!!  -----> made !!!  a note of the 27th - -----> i !!!  could also make the 26th of november - look forward to it - thanks, ernst. hi, ernst, it will be nice to meet you again. would you very kindly press the \"thanks\" button on my original post so i can keep track of numbers please?--img--  thanks, pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137950, "year": "2011"}, {"autor": "Rolo", "date": "2011-11-20 00:41:00", "content": ".OK, I'll sign up for the day as . What is happening on Friday? I totally missed that. LouisB Hoping to spend Friday morning visiting the Magnum, Contacts exhibition. Then, there will be several Leica cameras roaming around Covent Garden on Friday afternoon. Be nice if anyone who was looking forward to the 'Annual, sorry, I can't make it event' might like to join the walkabout and go for a beer later, or just join us for a beer after work. Was hoping Louis might identify the pub with his Massive iPhone database of London pubs. --img-- ", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/4/?tab=comments#comment-1848492", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": ".ok, i'll sign up for the day as . what is happening on friday? i totally missed that. louisb hoping to spend friday morning visiting the magnum, contacts exhibition. then, there will be several leica cameras roaming around covent garden on friday afternoon. be nice if anyone who was looking forward to the 'annual, sorry, -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it event' might like to join the walkabout and go for a beer later, or just join us for a beer after work. was hoping louis might identify the pub with his massive iphone database of london pubs. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137970, "year": "2011"}, {"autor": "stunsworth", "date": "2011-11-20 09:16:00", "content": "The Chandos is indeed a thing of wonder in central London. I almost always pop in if I'm in the area. They do food too. Surprised that no mention was made of the meeting - even if it was just a \"meeting in the Chandos on Friday, if you can make it feel free to come along\" type of post - and no, I can't make it <grin>", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/4/?tab=comments#comment-1848577", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "the chandos is indeed a thing of wonder in central london. i almost always pop in if i'm in the area. they do food too. surprised that no mention was made of the meeting - even if it was just a \"meeting in the chandos on friday, if you can -----> make !!!  it feel free to come along\" type of post - and no, -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it <grin>", "sortedWord": "None", "Identifyer": null, "identifyer": 137973, "year": "2011"}, {"autor": "Rolo", "date": "2011-11-20 10:46:00", "content": "The Chandos is indeed a thing of wonder in central London. I Surprised that no mention was made of the meeting <grin> That's because I made it up just moments before posting it. Several are meeting up for the Symposium and Tri is flying in from Germany on the Thursday, I'm travelling down to meet him on Friday morning, so I thought we could open it up to our London friends. Everybodie's welcome to join us at the exhibition on Friday morning; in Covent Garden in the afternoon, or thanks to Louis, in the Chandos for a beer. I find it best to just do something and invite others along. Matching diary dates, and no-shows, killed the LUF Manchester meets. BTW, Leica users still meet up in Manchester at least once a month with attendees always coming from Blackpool, Scunthorpe, Milton Keynes, Huddersfield, Warrington carrying their M2s, M3's, MP's, 6/7/8&9s, and Pentax, Rolleiflex, Mamiyas, Minolta, Fuji X, Ricoh .... Et al. The emphasis is on taking pictures, not displaying gear and dining.", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/4/?tab=comments#comment-1848632", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "the chandos is indeed a thing of wonder in central london. -----> i !!!  surprised that no mention was -----> made !!!  of the meeting <grin> that's because -----> i !!!  -----> made !!!  it up just moments before posting it. several are meeting up for the symposium and tri is flying in from germany on the thursday, i'm travelling down to meet him on friday morning, so i thought we could open it up to our london friends. everybodie's welcome to join us at the exhibition on friday morning; in covent garden in the afternoon, or thanks to louis, in the chandos for a beer. i find it best to just do something and invite others along. matching diary dates, and no-shows, killed the luf manchester meets. btw, leica users still meet up in manchester at least once a month with attendees always coming from blackpool, scunthorpe, milton keynes, huddersfield, warrington carrying their m2s, m3's, mp's, 6/7/8&9s, and pentax, rolleiflex, mamiyas, minolta, fuji x, ricoh .... et al. the emphasis is on taking pictures, not displaying gear and dining.", "sortedWord": "None", "Identifyer": null, "identifyer": 137974, "year": "2011"}, {"autor": "jaapv", "date": "2011-09-06 11:03:00", "content": "No you cannot buy it as a spare part. The repair is not a DIY job. The camera has to be disassembled completely to get at the unit. If it was sticking out in the first place it was loose before you bumped it, which may explain the crack. Just send it to Leica and decide, after you get the estimate, whether you want a repair or an upgrade. The upside is that you get a one-year guaranty on the whole camera afterwards. Edited September 6, 2011 by jaapv", "link": "https://www.l-camera-forum.com/topic/161173-m8-repair-cracked-lcd-screen-cover/?tab=comments#comment-1786153", "origin": "L-forum", "suborigin": "161173-m8-repair-cracked-lcd-screen-cover", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the -----> repair !!!  is not a diy job.", "sortedWord": "repair", "Identifyer": null, "identifyer": 42399, "year": "2011"}, {"autor": "Enoksen", "date": "2011-09-16 20:49:00", "content": "Just got my ACMAXX today and im very happy with the DIY repair. I had to shave off 1 mm at the bottom with a knife. Much, much better than a cracked screen. It will be like this until I find the time to send it to Leica... Thanks for all your replies --img--  Edited September 16, 2011 by Enoksen Image size", "link": "https://www.l-camera-forum.com/topic/161173-m8-repair-cracked-lcd-screen-cover/?tab=comments#comment-1794720", "origin": "L-forum", "suborigin": "161173-m8-repair-cracked-lcd-screen-cover", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "just got my acmaxx today and im very happy with the diy -----> repair !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 42408, "year": "2011"}], "name": "Leicasortedout2011"}