{"interestingcomments": [{"autor": "gjames9142", "date": "2012-10-16 15:54:00", "content": "I am just making a bunch of small (20 in) prints to show at a LeicaAkademie I am leading this week in Toronto, and it's obvious that the MM is noticeably ahead of the M9 in B/W. The increased resolution is there, and it seems to give more body to the print. This probably won't look anything in a jpeg, but a simple painted sign (on a curved column) has the feel of a contact print. I am knocked out by this camera. --img-- ", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/8/?tab=comments#comment-2142877", "origin": "L-forum", "suborigin": "188046-leica-monochrom-type-1-shots-post-them-here", "result": true, "Selector": "i am just making", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> am !!!  -----> just !!!  -----> making !!!  a bunch of small (20 in) prints to show at a leicaakademie -----> i !!!  -----> am !!!  leading this week in toronto, and it's obvious that the mm is noticeably ahead of the m9 in b/w. the increased resolution is there, and it seems to give more body to the print. this probably won't look anything in a jpeg, but a simple painted sign (on a curved column) has the feel of a contact print. i am knocked out by this camera. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 22030, "year": "2012"}, {"autor": "borowiec", "date": "2012-10-18 01:18:00", "content": " I am just making a bunch of small (20 in) prints to show at a LeicaAkademie I am leading this week in Toronto, and it's obvious that the MM is noticeably ahead of the M9 in B/W. The increased resolution is there, and it seems to give more body to the print. This probably won't look anything in a jpeg, but a simple painted sign (on a curved column) has the feel of a contact print. I am knocked out by this camera. I'm curious about the prints. I read that you're using an Epson 4900 and Ilford Gold Fibre; are you using the standard Epson inks with Epson Advanced Black and White mode? How do you soft-proof? Unlike with standard color management, for black and white I've been unable to set up a soft-proofing profile that accurately shows on screen what the print will look like.", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/9/?tab=comments#comment-2144055", "origin": "L-forum", "suborigin": "188046-leica-monochrom-type-1-shots-post-them-here", "result": true, "Selector": "i am just making", "selectorShort": "make", "MarkedSent": " -----> i !!!  -----> am !!!  -----> just !!!  -----> making !!!  a bunch of small (20 in) prints to show at a leicaakademie -----> i !!!  -----> am !!!  leading this week in toronto, and it's obvious that the mm is noticeably ahead of the m9 in b/w. the increased resolution is there, and it seems to give more body to the print. this probably won't look anything in a jpeg, but a simple painted sign (on a curved column) has the feel of a contact print. i am knocked out by this camera. i'm curious about the prints. i read that you're using an epson 4900 and ilford gold fibre; are you using the standard epson inks with epson advanced black and white mode? how do you soft-proof? unlike with standard color management, for black and white i've been unable to set up a soft-proofing profile that accurately shows on screen what the print will look like.", "sortedWord": "None", "Identifyer": null, "identifyer": 22047, "year": "2012"}, {"autor": "gjames9142", "date": "2012-10-18 03:25:00", "content": "I'm curious about the prints. I read that you're using an Epson 4900 and Ilford Gold Fibre; are you using the standard Epson inks with Epson Advanced Black and White mode? How do you soft-proof? Unlike with standard color management, for black and white I've been unable to set up a soft-proofing profile that accurately shows on screen what the print will look like. I don't soft-proof. My screen is calibrated, and in terms of light levels shows me what I am going to get. Don't use the Advanced Black and White either, though I am going to play with it. I use the Ilford profile, which actually may fairly useless in BW. I just make the print, and if it doesn't feel right, make another. Standard Epson inks. I looked into John Cone's inks and decided I didn't want to go. Did some big panoramas a few years ago with the piezography inks, and found permanence issues -- darks turning blue quite quickly, and an instant yellowing of the hahnemuhl paper in a couple of weeks at the framers. This whole subject is fraught, and it is extraordinarily hard to get real information about longevity. For the larger 36 inch prints I work with a really good printer at a custom lab, and he goes through a lot more steps than I do, but what I am asking him to do is to make a bigger but similar print to the one I give him as a guide. The bigger ones are on Hahnemuhl photo rag. This probably isn't too helpful.", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/9/?tab=comments#comment-2144078", "origin": "L-forum", "suborigin": "188046-leica-monochrom-type-1-shots-post-them-here", "result": true, "Selector": "i just make", "selectorShort": "make", "MarkedSent": "i'm curious about the prints. i read that you're using an epson 4900 and ilford gold fibre; are you using the standard epson inks with epson advanced black and white mode? how do you soft-proof? unlike with standard color management, for black and white i've been unable to set up a soft-proofing profile that accurately shows on screen what the print will look like. i don't soft-proof. my screen is calibrated, and in terms of light levels shows me what i am going to get. don't use the advanced black and white either, though i am going to play with it. i use the ilford profile, which actually may fairly useless in bw. -----> i !!!  -----> just !!!  -----> make !!!  the print, and if it doesn't feel right, -----> make !!!  another. standard epson inks. i looked into john cone's inks and decided i didn't want to go. did some big panoramas a few years ago with the piezography inks, and found permanence issues -- darks turning blue quite quickly, and an instant yellowing of the hahnemuhl paper in a couple of weeks at the framers. this whole subject is fraught, and it is extraordinarily hard to get real information about longevity. for the larger 36 inch prints i work with a really good printer at a custom lab, and he goes through a lot more steps than i do, but what i am asking him to do is to make a bigger but similar print to the one i give him as a guide. the bigger ones are on hahnemuhl photo rag. this probably isn't too helpful.", "sortedWord": "None", "Identifyer": null, "identifyer": 22048, "year": "2012"}, {"autor": "borowiec", "date": "2012-10-18 15:50:00", "content": "I don't soft-proof. My screen is calibrated, and in terms of light levels shows me what I am going to get. Don't use the Advanced Black and White either, though I am going to play with it. I use the Ilford profile, which actually may fairly useless in BW. I just make the print, and if it doesn't feel right, make another. Standard Epson inks. I looked into John Cone's inks and decided I didn't want to go. Did some big panoramas a few years ago with the piezography inks, and found permanence issues -- darks turning blue quite quickly, and an instant yellowing of the hahnemuhl paper in a couple of weeks at the framers. This whole subject is fraught, and it is extraordinarily hard to get real information about longevity. For the larger 36 inch prints I work with a really good printer at a custom lab, and he goes through a lot more steps than I do, but what I am asking him to do is to make a bigger but similar print to the one I give him as a guide. The bigger ones are on Hahnemuhl photo rag. This probably isn't too helpful. Thanks, that was quite helpful. My screen is calibrated and is an Eizo, so pretty accurate, yet when using Advanced B&W I find a huge difference between what I see and the prints. I'll have to play around with printing without Advanced B&W. I tested most of the fiber papers a few years ago and settled on Epson Exhibition Fiber, though Ilford 's Silk wasn't out yet (I have a sample on its way from Ilford and will try it). I used Hahnemuehle Fine Art Baryta for a while until I ran into inconsistencies from batch to batch, which Hahnemuehle claimed were within their limits of tolerance. I've seen comparisons of Cone inks to Epson inks and can't discern any difference. --Andrew", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/9/?tab=comments#comment-2144477", "origin": "L-forum", "suborigin": "188046-leica-monochrom-type-1-shots-post-them-here", "result": true, "Selector": "i just make", "selectorShort": "make", "MarkedSent": "i don't soft-proof. my screen is calibrated, and in terms of light levels shows me what i am going to get. don't use the advanced black and white either, though i am going to play with it. i use the ilford profile, which actually may fairly useless in bw. -----> i !!!  -----> just !!!  -----> make !!!  the print, and if it doesn't feel right, -----> make !!!  another. standard epson inks. i looked into john cone's inks and decided i didn't want to go. did some big panoramas a few years ago with the piezography inks, and found permanence issues -- darks turning blue quite quickly, and an instant yellowing of the hahnemuhl paper in a couple of weeks at the framers. this whole subject is fraught, and it is extraordinarily hard to get real information about longevity. for the larger 36 inch prints i work with a really good printer at a custom lab, and he goes through a lot more steps than i do, but what i am asking him to do is to make a bigger but similar print to the one i give him as a guide. the bigger ones are on hahnemuhl photo rag. this probably isn't too helpful. thanks, that was quite helpful. my screen is calibrated and is an eizo, so pretty accurate, yet when using advanced b&w i find a huge difference between what i see and the prints. i'll have to play around with printing without advanced b&w. i tested most of the fiber papers a few years ago and settled on epson exhibition fiber, though ilford 's silk wasn't out yet (i have a sample on its way from ilford and will try it). i used hahnemuehle fine art baryta for a while until i ran into inconsistencies from batch to batch, which hahnemuehle claimed were within their limits of tolerance. i've seen comparisons of cone inks to epson inks and can't discern any difference. --andrew", "sortedWord": "None", "Identifyer": null, "identifyer": 22051, "year": "2012"}, {"autor": "Guest WPalank", "date": "2012-10-27 17:42:00", "content": "This gentleman from New Zealand and living presently in Hong Kong was featured on the Eric Kim> Leica Blog several months ago. He roams the seedier areas of Hong Kong during the night. I immediately made him a contact on Flickr and I was pleased that he added me back. Anyway, it looks like he just got a Monochrom and I look forward to more of his work: Flickr: K_iwi's Photostream", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/10/?tab=comments#comment-2152286", "origin": "L-forum", "suborigin": "188046-leica-monochrom-type-1-shots-post-them-here", "result": true, "Selector": "i immediately made", "selectorShort": "make", "MarkedSent": "this gentleman from new zealand and living presently in hong kong was featured on the eric kim> leica blog several months ago. he roams the seedier areas of hong kong during the night. -----> i !!!  -----> immediately !!!  -----> made !!!  him a contact on flickr and -----> i !!!  was pleased that he added me back. anyway, it looks like he just got a monochrom and i look forward to more of his work: flickr: k_iwi's photostream", "sortedWord": "None", "Identifyer": null, "identifyer": 22075, "year": "2012"}, {"autor": "Jaybob", "date": "2012-10-18 23:48:00", "content": "It seems like you misunderstand how digital photography fundamentally works. ISO is not really part of exposure in digital photography. Shutter and aperture speed control the amount of light that hits the sensor, and the ISO just boosts the amplification after the fact. Whether one should boost that signal with the camera's internal analog or digital gain boost (ISO,) or use the raw converter to boost the gain after the fact, depends on the camera and raw converter. For example, if you shoot Canon, it is generally better to boost ISO in-camera up to higher ISOs. With several sensors, like in the M9, you can boost ISO in the raw converter, rather than raising in-camera ISO, and potentially even improve your DR by doing it this way. Of course, results are highly dependent on the raw converter being used. So, I agree that exposure is important, but, in digital, exposure really only refers to your shutter speed and aperture. ISO is just camera gain after the fact, which can be done in different ways. Several cameras are essentially ISO-less, meaning that you can focus on the amount of light hitting the sensor, and boost the gain later in the raw converter. p.s. because of the above, ETTR really only applies to shooting at base ISO, btw. ETTR can be good from a SNR standpoint, although, as others have mentioned, it can be a problem in regards to color. It can also be a problem if one underexposes the subject too much in an attempt to save highlights that may not be as important to the shot. Yes, I have no idea how digital photography works. Thank you for pointing that out to me as the crowning moment to your SIX posts here. I'm not sure how I managed to make it this far in life. If you dont have an ISO to work with be it 160, 500, 1000, or whatever, you dont have an exposure to figure out. Shooting all your exposures at 160 and ramping it up in your raw converter doesn't make you much of a photographer, in fact it may be the most fundamentally unsound approach to the art and science of the craft of photography I have ever encountered. Boosting the ISO later? Why? Where's the SKILL in that? Nailing it, both moment AND exposure, is more important to me, Nikon, Sony, or meterless Leica. You may as well shoot with your phone. Show me your M9 histograms, files, and your final examples of this impossible to follow technique. It seems as though the whole concept of it is flawed and following it would yield nothing but unusable exposures. What do I know? I don't understand digital photography. Edited October 18, 2012 by Jaybob", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/6/?tab=comments#comment-2144802", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i managed to make", "selectorShort": "make", "MarkedSent": "it seems like you misunderstand how digital photography fundamentally works. iso is not really part of exposure in digital photography. shutter and aperture speed control the amount of light that hits the sensor, and the iso just boosts the amplification after the fact. whether one should boost that signal with the camera's internal analog or digital gain boost (iso,) or use the raw converter to boost the gain after the fact, depends on the camera and raw converter. for example, if you shoot canon, it is generally better to boost iso in-camera up to higher isos. with several sensors, like in the m9, you can boost iso in the raw converter, rather than raising in-camera iso, and potentially even improve your dr by doing it this way. of course, results are highly dependent on the raw converter being used. so, i agree that exposure is important, but, in digital, exposure really only refers to your shutter speed and aperture. iso is just camera gain after the fact, which can be done in different ways. several cameras are essentially iso-less, meaning that you can focus on the amount of light hitting the sensor, and boost the gain later in the raw converter. p.s. because of the above, ettr really only applies to shooting at base iso, btw. ettr can be good from a snr standpoint, although, as others have mentioned, it can be a problem in regards to color. it can also be a problem if one underexposes the subject too much in an attempt to save highlights that may not be as important to the shot. yes, i have no idea how digital photography works. thank you for pointing that out to me as the crowning moment to your six posts here. -----> i !!! 'm not sure how -----> i !!!  -----> managed !!!  -----> to !!!  -----> make !!!  it this far in life. if you dont have an iso to work with be it 160, 500, 1000, or whatever, you dont have an exposure to figure out. shooting all your exposures at 160 and ramping it up in your raw converter doesn't make you much of a photographer, in fact it may be the most fundamentally unsound approach to the art and science of the craft of photography i have ever encountered. boosting the iso later? why? where's the skill in that? nailing it, both moment and exposure, is more important to me, nikon, sony, or meterless leica. you may as well shoot with your phone. show me your m9 histograms, files, and your final examples of this impossible to follow technique. it seems as though the whole concept of it is flawed and following it would yield nothing but unusable exposures. what do i know? i don't understand digital photography. edited october 18, 2012 by jaybob", "sortedWord": "None", "Identifyer": null, "identifyer": 32657, "year": "2012"}, {"autor": "douglasf13", "date": "2012-10-19 00:09:00", "content": "Yes, I have no idea how digital photography works. Thank you for pointing that out to me as the crowning moment to your SIX posts here. I'm not sure how I managed to make it this far in life. If you dont have an ISO to work with be it 160, 500, 1000, or whatever, you dont have an exposure to figure out. Shooting all your exposures at 160 and ramping it up in your raw converter doesn't make you much of a photographer, in fact it may be the most fundamentally unsound approach to the art and science of the craft of photography I have ever encountered. Boosting the ISO later? Why? Where's the SKILL in that? Nailing it, both moment AND exposure, is more important to me, Nikon, Sony, or meterless Leica. You may as well shoot with your phone. Show me your M9 histograms, files, and your final examples of this impossible to follow technique. It seems as though the whole concept of it is flawed and following it would yield nothing but unusable exposures. What do I know? I don't understand digital photography. You managed this far because camera makers decided to call camera gain \"ISO,\" in order for film shooters making the transition to digital easily understandable, especially since our cameras are still geared towards jpeg output. If you're shooting jpeg, it certainly does matter, and I should have made the distinction that we're talking about raw. Either way, you know the base ISO of the M9, 160, and that is all the guide that you really need. Exposure is simply the amount of light hitting the sensor, which is not dictated by ISO in a digital camera. Quite frankly, what I'm talking about is nothing new, and is a common topic in other forums. Feel free to criticize my 6 posts, but I've only recently rejoined this forum, and, although I'm embarrassed to admit it, I have something like 15,000 posts in other enthusiast forums, so please don't go there. I'm not going to take the time to do tests which you can do on your own, but here's one of several links illustrating what I'm talking about from raw expert Guillermo Luijk. The thread is in regard to the Pentax K-5, another essentially ISO-less camera. Noise and DR comparision: Canon 5D vs 5D2 vs 7D vs Pentax K5 p.s. I do still use ISO 800 or 1250 on the M9, because I like to have a usable jpeg review on the back of the camera. Also, with my NEX cameras, since the LCD and EVF rely on boosting the ISO in order to see the frame properly, I boost ISO in those cameras, too. So, even though I may be loosing a little DR by boosting ISO, it is often still worth it to me. Edited October 19, 2012 by douglasf13", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/6/?tab=comments#comment-2144804", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i managed to make", "selectorShort": "make", "MarkedSent": "yes, i have no idea how digital photography works. thank you for pointing that out to me as the crowning moment to your six posts here. -----> i !!! 'm not sure how -----> i !!!  -----> managed !!!  -----> to !!!  -----> make !!!  it this far in life. if you dont have an iso to work with be it 160, 500, 1000, or whatever, you dont have an exposure to figure out. shooting all your exposures at 160 and ramping it up in your raw converter doesn't make you much of a photographer, in fact it may be the most fundamentally unsound approach to the art and science of the craft of photography i have ever encountered. boosting the iso later? why? where's the skill in that? nailing it, both moment and exposure, is more important to me, nikon, sony, or meterless leica. you may as well shoot with your phone. show me your m9 histograms, files, and your final examples of this impossible to follow technique. it seems as though the whole concept of it is flawed and following it would yield nothing but unusable exposures. what do i know? i don't understand digital photography. you managed this far because camera makers decided to call camera gain \"iso,\" in order for film shooters making the transition to digital easily understandable, especially since our cameras are still geared towards jpeg output. if you're shooting jpeg, it certainly does matter, and i should have made the distinction that we're talking about raw. either way, you know the base iso of the m9, 160, and that is all the guide that you really need. exposure is simply the amount of light hitting the sensor, which is not dictated by iso in a digital camera. quite frankly, what i'm talking about is nothing new, and is a common topic in other forums. feel free to criticize my 6 posts, but i've only recently rejoined this forum, and, although i'm embarrassed to admit it, i have something like 15,000 posts in other enthusiast forums, so please don't go there. i'm not going to take the time to do tests which you can do on your own, but here's one of several links illustrating what i'm talking about from raw expert guillermo luijk. the thread is in regard to the pentax k-5, another essentially iso-less camera. noise and dr comparision: canon 5d vs 5d2 vs 7d vs pentax k5 p.s. i do still use iso 800 or 1250 on the m9, because i like to have a usable jpeg review on the back of the camera. also, with my nex cameras, since the lcd and evf rely on boosting the iso in order to see the frame properly, i boost iso in those cameras, too. so, even though i may be loosing a little dr by boosting iso, it is often still worth it to me. edited october 19, 2012 by douglasf13", "sortedWord": "None", "Identifyer": null, "identifyer": 32659, "year": "2012"}, {"autor": "Jaybob", "date": "2012-10-19 01:25:00", "content": "You have to separate this conversation into two different categories: IQ vs. usability. It isn't really a cheat or a short cut. It's just like pushing a slow film, which may not always be ideal in use, and can actually make proper exposure more difficult, rather than less. This isn't about short cuts, just discussing the nuance to sensor design and how different types of gains react. I disagree. I'd put any D3 file, one that's been properly ETTR'ed at 640 or 800 or 1000 or 1250 up against any photon noise balanced Pentax ISO-less but shot at 160 and then post processed \"exposure balanced\" file you can come up with. I understand WHAT you're saying, I just see no benefit to doing it that way. What I'm having a hard time getting past the nuances of are statements like \"It seems like you misunderstand how digital photography fundamentally works\" and \"You managed this far because camera makers decided to call camera gain \"ISO,\"\" and \"If the photographer doesn't understand the concept, I doubt a client would.\" and \"I'm not going to take the time to do tests which you can do on your own...\" Typing makes you seem like a douchebag...is that nuanced enough for you? Edited October 19, 2012 by Jaybob", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2144824", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "you have to separate this conversation into two different categories: iq vs. usability. it isn't really a cheat or a short cut. it's just like pushing a slow film, which may not always be ideal in use, and can actually make proper exposure more difficult, rather than less. this isn't about short cuts, just discussing the nuance to sensor design and how different types of gains react. i disagree. i'd put any d3 file, one that's been properly ettr'ed at 640 or 800 or 1000 or 1250 -----> up !!!  against any photon noise balanced pentax iso-less but shot at 160 and then post processed \"exposure balanced\" file you can -----> come !!!  -----> up !!!  -----> with !!! . i understand what you're saying, i just see no benefit to doing it that way. what i'm having a hard time getting past the nuances of are statements like \"it seems like you misunderstand how digital photography fundamentally works\" and \"you managed this far because camera makers decided to call camera gain \"iso,\"\" and \"if the photographer doesn't understand the concept, i doubt a client would.\" and \"i'm not going to take the time to do tests which you can do on your own...\" typing makes you seem like a douchebag...is that nuanced enough for you? edited october 19, 2012 by jaybob", "sortedWord": "None", "Identifyer": null, "identifyer": 32664, "year": "2012"}, {"autor": "douglasf13", "date": "2012-10-19 03:16:00", "content": "I disagree. I'd put any D3 file, one that's been properly ETTR'ed at 640 or 800 or 1000 or 1250 up against any photon noise balanced Pentax ISO-less but shot at 160 and then post processed \"exposure balanced\" file you can come up with. I understand WHAT you're saying, I just see no benefit to doing it that way. What I'm having a hard time getting past the nuances of are statements like \"It seems like you misunderstand how digital photography fundamentally works\" and \"You managed this far because camera makers decided to call camera gain \"ISO,\"\" and \"If the photographer doesn't understand the concept, I doubt a client would.\" and \"I'm not going to take the time to do tests which you can do on your own...\" Typing makes you seem like a douchebag...is that nuanced enough for you? The above clearly shows that you still don't understand the concept, yet. The point isn't about comparing the D3 to a K-5. It's about comparing a given camera's in-camera analog or digital gain to the boost from a raw converter. If saying that you don't understand the concept is offensive, I apologize. I'm trying my best to explain it from every direction. In regards to my initial post, you said \"This statement, from beginning to end, is inaccurate, except for \"don't blow highlights.\" All I'm doing is trying to explain why it is accurate. No need to name call. Edited October 19, 2012 by douglasf13", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2144846", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i disagree. i'd put any d3 file, one that's been properly ettr'ed at 640 or 800 or 1000 or 1250 -----> up !!!  against any photon noise balanced pentax iso-less but shot at 160 and then post processed \"exposure balanced\" file you can -----> come !!!  -----> up !!!  -----> with !!! . i understand what you're saying, i just see no benefit to doing it that way. what i'm having a hard time getting past the nuances of are statements like \"it seems like you misunderstand how digital photography fundamentally works\" and \"you managed this far because camera makers decided to call camera gain \"iso,\"\" and \"if the photographer doesn't understand the concept, i doubt a client would.\" and \"i'm not going to take the time to do tests which you can do on your own...\" typing makes you seem like a douchebag...is that nuanced enough for you? the above clearly shows that you still don't understand the concept, yet. the point isn't about comparing the d3 to a k-5. it's about comparing a given camera's in-camera analog or digital gain to the boost from a raw converter. if saying that you don't understand the concept is offensive, i apologize. i'm trying my best to explain it from every direction. in regards to my initial post, you said \"this statement, from beginning to end, is inaccurate, except for \"don't blow highlights.\" all i'm doing is trying to explain why it is accurate. no need to name call. edited october 19, 2012 by douglasf13", "sortedWord": "None", "Identifyer": null, "identifyer": 32665, "year": "2012"}, {"autor": "douglasf13", "date": "2012-10-19 04:31:00", "content": "Ok, I made a super quick, simple comparison with the M9. Both of these shots were captured at 1/125 and f2. One shot was ISO 1250, and the other was ISO 160 with the exposure boosted +2.9 EV in the converter (a full +3.0 EV was slightly too bright.) These shots were made under tungsten lighting and exported with the default LR4 settings to full quality jpeg. Sorry for the foot shot. I wanted some skin tones in the pic. Guess which is which: Image 1: --img--  Image 2: --img--  Edited October 19, 2012 by douglasf13", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2144858", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "ok, -----> i !!!  -----> made !!!  a super quick, simple comparison with the m9. both of these shots were captured at 1/125 and f2. one shot was iso 1250, and the other was iso 160 with the exposure boosted +2.9 ev in the converter (a full +3.0 ev was slightly too bright.) these shots were made under tungsten lighting and exported with the default lr4 settings to full quality jpeg. sorry for the foot shot. i wanted some skin tones in the pic. guess which is which: image 1: --img--  image 2: --img--  edited october 19, 2012 by douglasf13", "sortedWord": "None", "Identifyer": null, "identifyer": 32666, "year": "2012"}, {"autor": "dwbell", "date": "2012-10-19 10:18:00", "content": "Ok, I made a super quick, simple comparison with the M9. Both of these shots were captured at 1/125 and f2. One shot was ISO 1250, and the other was ISO 160 with the exposure boosted +2.9 EV in the converter (a full +3.0 EV was slightly too bright.) These shots were made under tungsten lighting and exported with the default LR4 settings to full quality jpeg. That's pretty amazingly similar!", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2145006", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "ok, -----> i !!!  -----> made !!!  a super quick, simple comparison with the m9. both of these shots were captured at 1/125 and f2. one shot was iso 1250, and the other was iso 160 with the exposure boosted +2.9 ev in the converter (a full +3.0 ev was slightly too bright.) these shots were made under tungsten lighting and exported with the default lr4 settings to full quality jpeg. that's pretty amazingly similar!", "sortedWord": "None", "Identifyer": null, "identifyer": 32672, "year": "2012"}, {"autor": "Jaybob", "date": "2012-10-19 11:37:00", "content": "Ok, I made a super quick, simple comparison with the M9. Both of these shots were captured at 1/125 and f2. One shot was ISO 1250, and the other was ISO 160 with the exposure boosted +2.9 EV in the converter (a full +3.0 EV was slightly too bright.) These shots were made under tungsten lighting and exported with the default LR4 settings to full quality jpeg. And a couple of 100% crops: It looks pretty close to me, and Lightroom isn't really the best raw converter for this technique. Can you tell which is which? I clearly understand WHAT you're saying, but have no idea WHY you would want to adjust the settings later in a RAW converter, especially if there turns out to be very little difference in end quality. Just because you can do something, doesn't make it a good idea. I can get in my car and drive to New York City from my house in Maryland. The accepted way get there is straight up through New Jersey. I can be there in FOUR HOURS. I could get to NYC by driving up through Pennsylvania as well, driving back roads and avoiding tolls and listening to mix tapes and that will take me SIX hours. Regardless of camera, isn't it WAY easier to set the ISO to 640, use the information your given by your light meter and histogram, and make a proper exposure, let the camera do some of the work? I spend enough time in the Develop module already. Jay", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2145044", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "ok, -----> i !!!  -----> made !!!  a super quick, simple comparison with the m9. both of these shots were captured at 1/125 and f2. one shot was iso 1250, and the other was iso 160 with the exposure boosted +2.9 ev in the converter (a full +3.0 ev was slightly too bright.) these shots were made under tungsten lighting and exported with the default lr4 settings to full quality jpeg. and a couple of 100% crops: it looks pretty close to me, and lightroom isn't really the best raw converter for this technique. can you tell which is which? i clearly understand what you're saying, but have no idea why you would want to adjust the settings later in a raw converter, especially if there turns out to be very little difference in end quality. just because you can do something, doesn't make it a good idea. i can get in my car and drive to new york city from my house in maryland. the accepted way get there is straight up through new jersey. i can be there in four hours. i could get to nyc by driving up through pennsylvania as well, driving back roads and avoiding tolls and listening to mix tapes and that will take me six hours. regardless of camera, isn't it way easier to set the iso to 640, use the information your given by your light meter and histogram, and make a proper exposure, let the camera do some of the work? i spend enough time in the develop module already. jay", "sortedWord": "None", "Identifyer": null, "identifyer": 32675, "year": "2012"}, {"autor": "kdriceman", "date": "2012-10-19 12:07:00", "content": "I clearly understand WHAT you're saying' date=' but have no idea WHY you would want to adjust the settings later in a RAW converter, especially if there turns out to be very little difference in end quality. Just because you can do something, doesn't make it a good idea. I can get in my car and drive to New York City from my house in Maryland. The accepted way get there is straight up through New Jersey. I can be there in FOUR HOURS. I could get to NYC by driving up through Pennsylvania as well, driving back roads and avoiding tolls and listening to mix tapes and that will take me SIX hours. Regardless of camera, isn't it WAY easier to set the ISO to 640, use the information your given by your light meter and histogram, and make a proper exposure, let the camera do some of the work? I spend enough time in the Develop module already. Jay[/quote'] It is a bit of an academic discussion, but, for me, it is good to know that if I make an ISO setting mistake, it is likely not irreparable.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2145087", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "i clearly understand what you're saying' date=' but have no idea why you would want to adjust the settings later in a raw converter, especially if there turns out to be very little difference in end quality. just because you can do something, doesn't make it a good idea. i can get in my car and drive to new york city from my house in maryland. the accepted way get there is straight up through new jersey. i can be there in four hours. i could get to nyc by driving up through pennsylvania as well, driving back roads and avoiding tolls and listening to mix tapes and that will take me six hours. regardless of camera, isn't it way easier to set the iso to 640, use the information your given by your light meter and histogram, and make a proper exposure, let the camera do some of the work? i spend enough time in the develop module already. jay[/quote'] it is a bit of an academic discussion, but, for me, it is good to know that if -----> i !!!  -----> make !!!  an iso setting mistake, it is likely not irreparable.", "sortedWord": "None", "Identifyer": null, "identifyer": 32679, "year": "2012"}, {"autor": "douglasf13", "date": "2012-10-19 15:53:00", "content": "Is this the case even when none of the color channels are overexposed (i.e., clipped)? Yes, but any examples that I've seen of it in the past were subtle at best, so it may not affect most of us, practically speaking. If you're a stickler for accurate color, it may bother you. I just remembered that the Chromasoft blog has several articles about ETTR, and this one shows an example of the color issue: ChromaSoft: Why \"Expose to the Right\" is just plain wrong p.s. I'm sorry if I've somehow made this all personal. I'll be more careful.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/8/?tab=comments#comment-2145275", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i've somehow made", "selectorShort": "make", "MarkedSent": "is this the case even when none of the color channels are overexposed (i.e., clipped)? yes, but any examples that i've seen of it in the past were subtle at best, so it may not affect most of us, practically speaking. if you're a stickler for accurate color, it may bother you. i just remembered that the chromasoft blog has several articles about ettr, and this one shows an example of the color issue: chromasoft: why \"expose to the right\" is just plain wrong p.s. -----> i !!! 'm sorry if -----> i !!! 've -----> somehow !!!  -----> made !!!  this all personal. i'll be more careful.", "sortedWord": "None", "Identifyer": null, "identifyer": 32694, "year": "2012"}, {"autor": "Lindolfi", "date": "2012-10-27 11:22:00", "content": "With the need of more experimental evidence in this thread, I have made another set of exposures of a MacBeth color card with the settings of 160 and 1250 ISO and at equal exposure, but now in daylight (6500 Kelvin) instead of the former tests in Tungsten light (2800 Kelvin) and at shorter exposure times (1/60 and f5/6). This time there is no statistical difference anymore between the 3 stops pushed 160 ISO and 1250 ISO exposures for all color patches of the MacBeth card in standard deviation of the luminance. Most likely the different result of the tests comes from the longer exposure times and/or the low blue light contribution in the 2800 Kelvin exposures. Also I have tested 0 sharpening and 0 noise reduction settings when loaded in LightRoom and that still does not show a difference between pushed 160 and 1250 ISO. So there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher ISO in these conditions. Also image quality is very much the same. So what it boils down to is that it is your choice of in camera signal amplification from your ISO setting or post processing by pushing in LightRoom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. Advantage of the former method is that you have an easier review of exposure on location from the histogram on the LCD. If required I can post a link to the DNG files of the MacBeth exposures.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/12/?tab=comments#comment-2152006", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "with the need of more experimental evidence in this thread, -----> i !!!  -----> have !!!  -----> made !!!  another set of exposures of a macbeth color card with the settings of 160 and 1250 iso and at equal exposure, but now in daylight (6500 kelvin) instead of the former tests in tungsten light (2800 kelvin) and at shorter exposure times (1/60 and f5/6). this time there is no statistical difference anymore between the 3 stops pushed 160 iso and 1250 iso exposures for all color patches of the macbeth card in standard deviation of the luminance. most likely the different result of the tests comes from the longer exposure times and/or the low blue light contribution in the 2800 kelvin exposures. also i have tested 0 sharpening and 0 noise reduction settings when loaded in lightroom and that still does not show a difference between pushed 160 and 1250 iso. so there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher iso in these conditions. also image quality is very much the same. so what it boils down to is that it is your choice of in camera signal amplification from your iso setting or post processing by pushing in lightroom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. advantage of the former method is that you have an easier review of exposure on location from the histogram on the lcd. if required i can post a link to the dng files of the macbeth exposures.", "sortedWord": "None", "Identifyer": null, "identifyer": 32770, "year": "2012"}, {"autor": "Lindolfi", "date": "2012-10-27 18:34:00", "content": "OK Jaybob, we have all been there: no time to change ISO. But in these conditions with this ISO it is not the best example to use as an argument in a thread on optimal exposure. But before you come up with another example: I fully understand your arguments and as I said, I think they are valid, but do not cover all the options in all conditions. Edited October 27, 2012 by Lindolfi", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/13/?tab=comments#comment-2152352", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "ok jaybob, we have all been there: no time to change iso. but in these conditions with this iso it is not the best example to use as an argument in a thread on optimal exposure. but before you -----> come !!!  -----> up !!!  -----> with !!!  another example: i fully understand your arguments and as i said, i think they are valid, but do not cover all the options in all conditions. edited october 27, 2012 by lindolfi", "sortedWord": "None", "Identifyer": null, "identifyer": 32796, "year": "2012"}, {"autor": "viramati", "date": "2012-12-27 17:59:00", "content": "Leica are sensitive to knocks so I would make sure that the alignment of the RF mechanism AND the sensor alignment are Ok. I say this as I sent mine in for a totally unrelated issue and Solms said the the RF and sensor were both out to a slight knock.", "link": "https://www.l-camera-forum.com/topic/194757-m9-dent-on-top-cost-to-repair-or-replace/?tab=comments#comment-2199058", "origin": "L-forum", "suborigin": "194757-m9-dent-on-top-cost-to-repair-or-replace", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "leica are sensitive to knocks so -----> i !!!  -----> would !!!  -----> make !!!  sure that the alignment of the rf mechanism and the sensor alignment are ok. i say this as i sent mine in for a totally unrelated issue and solms said the the rf and sensor were both out to a slight knock.", "sortedWord": "None", "Identifyer": null, "identifyer": 36582, "year": "2012"}, {"autor": "thrid", "date": "2012-06-16 17:31:00", "content": "I owned the 1.9 and sold it because it intruded too much in to the viewfinder and my copy flared quite strongly. I purchased the Ultron 2/28 almost 2 years ago and have no complaints. It doesn't have quite the bite of the Summicron ASPH, but it's probably as good as anything Dr Mandler would have come up with in the pre-ASPH days. Even at f2 it is perfectly useable. I've never experienced the focus shift issue, but then again, I don't shoot test charts. In the real world it simply hasn't showed up. IMO it's a nonissue that has been blown out of proportion, if for any reason because the 28mm focal length offers so much DOF when minimally stopped down. Build quality is very solid. There is little intrusion on the frame lines. The lens is compact and comes with a metal hood. You are not going to find a better fast 28 at this price. Edited June 16, 2012 by thrid", "link": "https://www.l-camera-forum.com/topic/181624-voigtlander-28mm-f2-or-f19-on-m9/?tab=comments#comment-2041530", "origin": "L-forum", "suborigin": "181624-voigtlander-28mm-f2-or-f19-on-m9", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i owned the 1.9 and sold it because it intruded too much in to the viewfinder and my copy flared quite strongly. i purchased the ultron 2/28 almost 2 years ago and have no complaints. it doesn't have quite the bite of the summicron asph, but it's probably as good as anything dr mandler would have -----> come !!!  -----> up !!!  -----> with !!!  in the pre-asph days. even at f2 it is perfectly useable. i've never experienced the focus shift issue, but then again, i don't shoot test charts. in the real world it simply hasn't showed up. imo it's a nonissue that has been blown out of proportion, if for any reason because the 28mm focal length offers so much dof when minimally stopped down. build quality is very solid. there is little intrusion on the frame lines. the lens is compact and comes with a metal hood. you are not going to find a better fast 28 at this price. edited june 16, 2012 by thrid", "sortedWord": "None", "Identifyer": null, "identifyer": 37268, "year": "2012"}, {"autor": "Dougg", "date": "2012-11-15 02:55:00", "content": "I am another left-eye-dominant right-hander; my optometrist tells me this is relatively uncommon. So I've always used my left eye on the viewfinder, and for vertical shots I rotate the camera right-side down. Then I developed a cataract in the left eye, and as it got progressively worse I had to switch to using my right eye for photography. Eventually I had cataract surgery on both eyes, two years apart, and it turned out the viewfinder is clearer and sharper using my right eye (not wearing glasses while shooting), so I stayed using that one for framing/focusing. Some people are more strongly left- or right-dominant and have a harder time than I in making the switch... Edited November 15, 2012 by Dougg", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=comments#comment-2167159", "origin": "L-forum", "suborigin": "191990-left-eye-shooting", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i am another left-eye-dominant right-hander; my optometrist tells me this is relatively uncommon. so i've always used my left eye on the viewfinder, and for vertical shots i rotate the camera right-side down. then -----> i !!!  -----> developed !!!  a cataract in the left eye, and as it got progressively worse -----> i !!!  had to switch to using my right eye for photography. eventually i had cataract surgery on both eyes, two years apart, and it turned out the viewfinder is clearer and sharper using my right eye (not wearing glasses while shooting), so i stayed using that one for framing/focusing. some people are more strongly left- or right-dominant and have a harder time than i in making the switch... edited november 15, 2012 by dougg", "sortedWord": "None", "Identifyer": null, "identifyer": 39055, "year": "2012"}, {"autor": "Pintpot", "date": "2012-12-14 15:44:00", "content": "Welcome to the forum! That's a neat idea on the home made Thumbs up, and the red strap will match the red dot --img-- I've found that side of the half case is fine for me as far as an extra thumb rest. Got used to it in time I guess. Do post some results soon Cheers", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/10/?tab=comments#comment-2189401", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "[idea, made]", "selectorShort": "idea", "MarkedSent": "Welcome to the forum! That's a neat idea on the home made Thumbs up, and the red strap will match the red dot --img-- I've found that side of the half case is fine for me as far as an extra thumb rest. Got used to it in time I guess. Do post some results soon Cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 42826, "year": "2012"}, {"autor": "AlanG", "date": "2012-08-29 12:43:00", "content": "Well it looks to me that Leica is at least trying to come up with an acceptable solution and reassure customers about the M9 as best they can. But when the M9 first came out, I was under the impression it had the same LCD and electronics as the M8. If they used a new LCD and revised electronics why didn't they make it significantly better than what they ended up using? Was there nothing better in that form factor?", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/2/?tab=comments#comment-2098974", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well it looks to me that leica is at least trying to -----> come !!!  -----> up !!!  -----> with !!!  an acceptable solution and reassure customers about the m9 as best they can. but when the m9 first came out, i was under the impression it had the same lcd and electronics as the m8. if they used a new lcd and revised electronics why didn't they make it significantly better than what they ended up using? was there nothing better in that form factor?", "sortedWord": "None", "Identifyer": null, "identifyer": 46461, "year": "2012"}, {"autor": "pklein", "date": "2012-08-29 19:47:00", "content": "I'm an M8 user. I've stayed out of the discussion until we could hear from Leica officially. I pretty much accepted that my M8 wouldn't be repairable after 10 years. But not after only the five years I've owned mine. Still, if reliable replacement LCDs don't exist, what can we do? While I don't like the situation, it seems that Leica has come up with a reasonable policy to deal with it. But we must all understand that the cost of a broken M8 LDC just went up considerably. If you were probably going to upgrade at some point anyway, it's OK. If the M8 stretched you financially and the LCD dies, and you're not able or willing to lay out close to the cost of another brand-new M8 to upgrade, you have a problem. Part of the anger expressed in this thread is really about the disconnect between what the Leica brand/mark stands for, and the realities of digital technology for a small company in a marketplace where the rules have been made by the giants of Japan, Inc. Leica marketing still capitalizes on the concept of the \"Lifetime Leica,\" but that just isn't real any more. Leica's heritage still lives in its optics and rangefinder, but as for the electronics, including the LCD, no. We will all be better off if we accept this reality. When you buy a Leica today, you are buying a camera that is partly the old Leica, and partly a piece of disposable consumer electronics. The company doesn't have the deep pockets and resources that Brand C and N do. So while you can be \"made whole\" again if your M8 LCD dies, it's going to be in the form of a pro-rated discount on the next model, and it's gonna cost you. So photographers, take Leica marketing, mythology and mysticism with several grains of salt. One-percenters and bling-chasers, keep believing, it will be good for Leica. --img--  By the way, hello to all my fellow HP RPN calculator users! I'm afflicted with that disease, too. --img--  --Peter", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/4/?tab=comments#comment-2099439", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm an m8 user. i've stayed out of the discussion until we could hear from leica officially. i pretty much accepted that my m8 wouldn't be repairable after 10 years. but not after only the five years i've owned mine. still, if reliable replacement lcds don't exist, what can we do? while i don't like the situation, it seems that leica has -----> come !!!  -----> up !!!  -----> with !!!  a reasonable policy to deal -----> with !!!  it. but we must all understand that the cost of a broken m8 ldc just went up considerably. if you were probably going to upgrade at some point anyway, it's ok. if the m8 stretched you financially and the lcd dies, and you're not able or willing to lay out close to the cost of another brand-new m8 to upgrade, you have a problem. part of the anger expressed in this thread is really about the disconnect between what the leica brand/mark stands for, and the realities of digital technology for a small company in a marketplace where the rules have been made by the giants of japan, inc. leica marketing still capitalizes on the concept of the \"lifetime leica,\" but that just isn't real any more. leica's heritage still lives in its optics and rangefinder, but as for the electronics, including the lcd, no. we will all be better off if we accept this reality. when you buy a leica today, you are buying a camera that is partly the old leica, and partly a piece of disposable consumer electronics. the company doesn't have the deep pockets and resources that brand c and n do. so while you can be \"made whole\" again if your m8 lcd dies, it's going to be in the form of a pro-rated discount on the next model, and it's gonna cost you. so photographers, take leica marketing, mythology and mysticism with several grains of salt. one-percenters and bling-chasers, keep believing, it will be good for leica. --img--  by the way, hello to all my fellow hp rpn calculator users! i'm afflicted with that disease, too. --img--  --peter", "sortedWord": "None", "Identifyer": null, "identifyer": 46512, "year": "2012"}, {"autor": "Indina", "date": "2012-08-30 08:58:00", "content": "Imo the current strategy towards customers, who paid A LOT for their digital M bodies looks like pure toxine for the reputation of Leica as a brand. Such information like 'I was made to beleive to have purchased quality - and was left alone by the vendor after a few years' creeps through communities for many years. This is a risky path for any company. There are people who will and can only invest such enormeous sums once in their life. So any expensive upgrade is out of sight for them. Folks who buy Leica aren't all and per se loaded with money. I hope, the management may rethink its policy.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/6/?tab=comments#comment-2099878", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "i was made", "selectorShort": "make", "MarkedSent": "imo the current strategy towards customers, who paid a lot for their digital m bodies looks like pure toxine for the reputation of leica as a brand. such information like '-----> i !!!  -----> was !!!  -----> made !!!  to beleive to have purchased quality - and -----> was !!!  left alone by the vendor after a few years' creeps through communities for many years. this is a risky path for any company. there are people who will and can only invest such enormeous sums once in their life. so any expensive upgrade is out of sight for them. folks who buy leica aren't all and per se loaded with money. i hope, the management may rethink its policy.", "sortedWord": "None", "Identifyer": null, "identifyer": 46540, "year": "2012"}, {"autor": "earleygallery", "date": "2012-08-30 09:23:00", "content": "There are people who will and can only invest such enormeous sums once in their life. So any expensive upgrade is out of sight for them. Folks who buy Leica aren't all and per se loaded with money. I've made a similar point in the 'how much will the M10 cost' thread. We need to see what happens at Photokina but Leica may indeed be heading further upmarket (with products like the MM and APO Summicron typcial of their future strategy and price points). Yes Leica have always been expensive, but not so far out of the reach of many photographers who wanted one and could perhaps sacrifice some other luxuries, not to mention if they bought a film M body it was indeed a camera for a lifetime. By discarding the M8 and potentially many existing and future users (who cannot afford an M9) they are moving their brand further upmarket and further out of the reach of many photographers. With the film cameras there was always an entry point with a used M or Barnack camera. The M8 had become an affordable option for many people who otherwise wouldn't be able to afford to buy into the Leica system. The M9 is quite a leap from the price of an M8, although they will become less expensive in time, given the precedent set by the obsolecence of the M9 how many will decide to take such an expensive risk in the future? If you can just about afford and M8 and lens, and now know that it will be useless and pretty much worthless if it breaks, would you be more inclined to choose another brand instead? I hope I'm wrong but I fear that the LCD issue will have far wider and more serious implications for Leica and their current and - potential - future customers.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/6/?tab=comments#comment-2099899", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "there are people who will and can only invest such enormeous sums once in their life. so any expensive upgrade is out of sight for them. folks who buy leica aren't all and per se loaded with money. -----> i !!! 've -----> made !!!  a similar point in the 'how much will the m10 cost' thread. we need to see what happens at photokina but leica may indeed be heading further upmarket (with products like the mm and apo summicron typcial of their future strategy and price points). yes leica have always been expensive, but not so far out of the reach of many photographers who wanted one and could perhaps sacrifice some other luxuries, not to mention if they bought a film m body it was indeed a camera for a lifetime. by discarding the m8 and potentially many existing and future users (who cannot afford an m9) they are moving their brand further upmarket and further out of the reach of many photographers. with the film cameras there was always an entry point with a used m or barnack camera. the m8 had become an affordable option for many people who otherwise wouldn't be able to afford to buy into the leica system. the m9 is quite a leap from the price of an m8, although they will become less expensive in time, given the precedent set by the obsolecence of the m9 how many will decide to take such an expensive risk in the future? if you can just about afford and m8 and lens, and now know that it will be useless and pretty much worthless if it breaks, would you be more inclined to choose another brand instead? i hope i'm wrong but i fear that the lcd issue will have far wider and more serious implications for leica and their current and - potential - future customers.", "sortedWord": "None", "Identifyer": null, "identifyer": 46541, "year": "2012"}, {"autor": "spylaw4", "date": "2012-08-30 11:18:00", "content": "It would appear that, although replacement sensors may be available, and noting what Mark says about availability and the labour cost involved in replacing them (assuming what is available is actually identical), Leica have made a corporate decision that the resultant cost (which, by the way, we have no way of checking) will be too much to ask from customers. Leica have therefore apparently placed a value on the camera on their terms, again with no reference to what was paid for it or what the sale value of an operating camera in that condition might be achievable in the customer's market, and so we are simply being told \"accept a reduced price M9/9-P at price €X\", this price logically(?) varying with camera age/external condition/ actuations, and it appears damage. In some countries this might be a good deal, in others there may be hefty import charges on top to be taken into account. We are not being given the option to have it repaired. I suppose that is what irritates me, I like to make my own decisions!", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/6/?tab=comments#comment-2099975", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "i like to make", "selectorShort": "make", "MarkedSent": "it would appear that, although replacement sensors may be available, and noting what mark says about availability and the labour cost involved in replacing them (assuming what is available is actually identical), leica have made a corporate decision that the resultant cost (which, by the way, we have no way of checking) will be too much to ask from customers. leica have therefore apparently placed a value on the camera on their terms, again with no reference to what was paid for it or what the sale value of an operating camera in that condition might be achievable in the customer's market, and so we are simply being told \"accept a reduced price m9/9-p at price €x\", this price logically(?) varying with camera age/external condition/ actuations, and it appears damage. in some countries this might be a good deal, in others there may be hefty import charges on top to be taken into account. we are not being given the option to have it repaired. -----> i !!!  suppose that is what irritates me, -----> i !!!  -----> like !!!  -----> to !!!  -----> make !!!  my own decisions!", "sortedWord": "None", "Identifyer": null, "identifyer": 46544, "year": "2012"}, {"autor": "Guest Ron (Netherlands)", "date": "2012-08-30 19:59:00", "content": "It is very understandable what Herr SD is trying to achieve here. This sort of messages will kick the M8/M8.2 faster out of the market making room for the M9-series and as a result of that making stockroom for the coming M10. Currently Leica may not have enough outlets for there new products due to the belated and slow delivery of the M9. So from that viewpoint Herr SD is doing a wonderfull job for Leica - and I can appreciate his message very much in this respect, since the company has to overcome very hard economic times. That said, keep in mind that Leica is in many many ways not the same company as it was thirty/forty years ago - not even with respect to quality and long run service. That is all ok of course in current times where we have more aggressive markets and investment, but what could easily be felt by the public as misleading, is their continuous use of the outstanding reputation of the former Leica company, while they cannot meet that standard (of service) any more - like no company can. (btw I really liked and was seriously impressed by Leica's aggressive marketing with regard the the MM now reading messages of quite many people thinking they can't make good pictures without having one :-) last point (idea for Leica service department): make the X2 a trade in for old M8 / M8.2 with broken lcd's Edited August 30, 2012 by Ron (Netherlands)", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/7/?tab=comments#comment-2100471", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "It is very understandable what Herr SD is trying to achieve here. This sort of messages will kick the M8/M8.2 faster out of the market making room for the M9-series and as a result of that making stockroom for the coming M10. Currently Leica may not have enough outlets for there new products due to the belated and slow delivery of the M9. So from that viewpoint Herr SD is doing a wonderfull job for Leica - and I can appreciate his message very much in this respect, since the company has to overcome very hard economic times. That said, keep in mind that Leica is in many many ways not the same company as it was thirty/forty years ago - not even with respect to quality and long run service. That is all ok of course in current times where we have more aggressive markets and investment, but what could easily be felt by the public as misleading, is their continuous use of the outstanding reputation of the former Leica company, while they cannot meet that standard (of service) any more - like no company can. (btw I really liked and was seriously impressed by Leica's aggressive marketing with regard the the MM now reading messages of quite many people thinking they can't make good pictures without having one :-) last point (idea for Leica service department): make the X2 a trade in for old M8 / M8.2 with broken lcd's Edited August 30, 2012 by Ron (Netherlands)", "sortedWord": "None", "Identifyer": null, "identifyer": 46554, "year": "2012"}, {"autor": "plasticman", "date": "2012-09-03 15:05:00", "content": "Shouldn't this thread be moved to the M8/8.2 forum? : --img--  No - we should create a new subsection: the EX-Customer Forum. It's gonna be pretty busy in there. --img-- ", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/9/?tab=comments#comment-2103793", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "we should create", "selectorShort": "create", "MarkedSent": "shouldn't this thread be moved to the m8/8.2 forum? : --img--  no - -----> we !!!  -----> should !!!  -----> create !!!  a new subsection: the ex-customer forum. it's gonna be pretty busy in there. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 46598, "year": "2012"}, {"autor": "iedei", "date": "2012-09-04 15:08:00", "content": "So Leica should buy the film division of Kodak so we can have Tri-X for the next 10 years? I had a LandRover Freelander, which had an engine made by Rover (car division). When Rover went out of business (nobody purchased it, and thus closed) so the supply of replacement engines ceased. In a short time after the supply new engines were used up, the rebuilt market went ballistic, $10,000 per rebuilt engine. And after that you could not even buy a rebuild, except on the black/grey market. Thus dooming my car to oblivion. But my Freelander lived on for several years... until all the major maintenance components got to be too expensive to deal with, and thus the vehicle was retired... So basically stuff happens, we deal with it and move on... you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a Leica. I think Leica should allow 3rd party makers to come up with creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the M8 is otherwise a serviceable camera, with only one situation---and that is the LCD. no more, no less---as stated. Edited September 4, 2012 by iedei", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/9/?tab=comments#comment-2104796", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "so leica should buy the film division of kodak so we can have tri-x for the next 10 years? i had a landrover freelander, which had an engine made by rover (car division). when rover went out of business (nobody purchased it, and thus closed) so the supply of replacement engines ceased. in a short time after the supply new engines were used up, the rebuilt market went ballistic, $10,000 per rebuilt engine. and after that you could not even buy a rebuild, except on the black/grey market. thus dooming my car to oblivion. but my freelander lived on for several years... until all the major maintenance components got to be too expensive to deal with, and thus the vehicle was retired... so basically stuff happens, we deal with it and move on... you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a leica. i think leica should allow 3rd party makers to -----> come !!!  -----> up !!!  -----> with !!!  creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the m8 is otherwise a serviceable camera, with only one situation---and that is the lcd. no more, no less---as stated. edited september 4, 2012 by iedei", "sortedWord": "None", "Identifyer": null, "identifyer": 46612, "year": "2012"}, {"autor": "DES", "date": "2012-09-04 16:02:00", "content": " you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a Leica. I think Leica should allow 3rd party makers to come up with creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the M8 is otherwise a serviceable camera, with only one situation---and that is the LCD. no more, no less---as stated. This is way too simplistic. We have a £3000 camera body that leica has said cannot me repaired if the screen gets damaged. But don't worry M9 users you are still ok ! Sorry this is totally unacceptable. As I have said Leica has to nip this \"cannot be repaired\" comment in the bud, by telling us although this has been an issue, we have option a, b or c for our customers, at a cost of x y and z. Not if it happens go to your local store and see what they can offer you!!! Sorry guys it is just not good enough! Until they get a grip on this, who is going to buy a second hand M8? Not to mention !", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/10/?tab=comments#comment-2104849", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a leica. i think leica should allow 3rd party makers to -----> come !!!  -----> up !!!  -----> with !!!  creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the m8 is otherwise a serviceable camera, with only one situation---and that is the lcd. no more, no less---as stated. this is way too simplistic. we have a £3000 camera body that leica has said cannot me repaired if the screen gets damaged. but don't worry m9 users you are still ok ! sorry this is totally unacceptable. as i have said leica has to nip this \"cannot be repaired\" comment in the bud, by telling us although this has been an issue, we have option a, b or c for our customers, at a cost of x y and z. not if it happens go to your local store and see what they can offer you!!! sorry guys it is just not good enough! until they get a grip on this, who is going to buy a second hand m8? not to mention !", "sortedWord": "None", "Identifyer": null, "identifyer": 46613, "year": "2012"}, {"autor": "marknorton", "date": "2012-09-13 22:57:00", "content": "I'm not sure whether Leica think the issue is dealt with but I remain highly critical of the position they have taken. My simple 3 point plan for them is as follows: 1. Leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. Leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. I think most here would regard 10 years from end of production as a workable limit for the M9 on. 3. In the special case of the M8, Leica should retain the M9 upgrade offer but supplement it with a lower cost alternative where Leica will obtain used parts from used M8s to keep broken M8s working. Users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. I think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the M8. I would say 6 years from end of production would be a good compromise. I daresay Leica and the bean counters would come up with a thousand reasons why not but it's only in this way they can salvage their reputation.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/16/?tab=comments#comment-2112433", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm not sure whether leica think the issue is dealt with but i remain highly critical of the position they have taken. my simple 3 point plan for them is as follows: 1. leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. i think most here would regard 10 years from end of production as a workable limit for the m9 on. 3. in the special case of the m8, leica should retain the m9 upgrade offer but supplement it with a lower cost alternative where leica will obtain used parts from used m8s to keep broken m8s working. users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. i think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the m8. i would say 6 years from end of production would be a good compromise. i daresay leica and the bean counters would -----> come !!!  -----> up !!!  -----> with !!!  a thousand reasons why not but it's only in this way they can salvage their reputation.", "sortedWord": "None", "Identifyer": null, "identifyer": 46752, "year": "2012"}, {"autor": "plasticman", "date": "2012-12-25 20:46:00", "content": "The M-E looks beautiful in the fleshIts nice to have the slightly blued grey... Naturally we can discuss differences of taste for ever - thank goodness we don't all like the same things - but I have seen it 'in the flesh', and of the four of us that stood in the shop discussing the M-E, only one person rather feebly defended the design (saying it was \"okay\"), and he was the dealer selling it! The point I was trying to make in my earlier post is that Leica quite intentionally constructed the camera as a design outlier - some will like it, but the vast majority will be (at most) lukewarm. If they'd produced an all-black camera, then I absolutely promise you that no-one would be saying 'I wish they'd produced a dull, rather sickly greyish blue M9 instead'. So my point isn't really about the fact that I personally don't like it - but that I believe Leica themselves designed it to be somewhat off-putting (for the reasons I stated above). Still we'll see what happens in the future. I was appalled by what we've seen of the CMOS sensor so far - we'll see some real comparisons over the next month. Maybe the last chapter in the Leica CCD book hasn't been written yet, after all...", "link": "https://www.l-camera-forum.com/topic/194174-tempted-by-m-e/page/2/?tab=comments#comment-2197621", "origin": "L-forum", "suborigin": "194174-tempted-by-m-e", "result": true, "Selector": "i was trying to make", "selectorShort": "make", "MarkedSent": "the m-e looks beautiful in the fleshits nice to have the slightly blued grey... naturally we can discuss differences of taste for ever - thank goodness we don't all like the same things - but i have seen it 'in the flesh', and of the four of us that stood in the shop discussing the m-e, only one person rather feebly defended the design (saying it was \"okay\"), and he was the dealer selling it! the point -----> i !!!  -----> was !!!  -----> trying !!!  -----> to !!!  -----> make !!!  in my earlier post is that leica quite intentionally constructed the camera as a design outlier - some will like it, but the vast majority will be (at most) lukewarm. if they'd produced an all-black camera, then i absolutely promise you that no-one would be saying 'i wish they'd produced a dull, rather sickly greyish blue m9 instead'. so my point isn't really about the fact that i personally don't like it - but that i believe leica themselves designed it to be somewhat off-putting (for the reasons i stated above). still we'll see what happens in the future. i was appalled by what we've seen of the cmos sensor so far - we'll see some real comparisons over the next month. maybe the last chapter in the leica ccd book hasn't been written yet, after all...", "sortedWord": "None", "Identifyer": null, "identifyer": 46895, "year": "2012"}, {"autor": "colonel", "date": "2012-12-25 23:13:00", "content": "Naturally we can discuss differences of taste for ever - thank goodness we don't all like the same things - but I have seen it 'in the flesh', and of the four of us that stood in the shop discussing the M-E, only one person rather feebly defended the design (saying it was \"okay\"), and he was the dealer selling it! The point I was trying to make in my earlier post is that Leica quite intentionally constructed the camera as a design outlier - some will like it, but the vast majority will be (at most) lukewarm. . This just is not logical I get it, that you don't like it It's taste after all But to say that any company intentionally designed something not to sell is just crazy. I have shown it to colleagues at work, friends and family. Most say it looks smarter then the black. Of course some traditional/older M photographers might not like change. Maybe those were the people in the shop.", "link": "https://www.l-camera-forum.com/topic/194174-tempted-by-m-e/page/2/?tab=comments#comment-2197697", "origin": "L-forum", "suborigin": "194174-tempted-by-m-e", "result": true, "Selector": "i was trying to make", "selectorShort": "make", "MarkedSent": "naturally we can discuss differences of taste for ever - thank goodness we don't all like the same things - but i have seen it 'in the flesh', and of the four of us that stood in the shop discussing the m-e, only one person rather feebly defended the design (saying it was \"okay\"), and he was the dealer selling it! the point -----> i !!!  -----> was !!!  -----> trying !!!  -----> to !!!  -----> make !!!  in my earlier post is that leica quite intentionally constructed the camera as a design outlier - some will like it, but the vast majority will be (at most) lukewarm. . this just is not logical i get it, that you don't like it it's taste after all but to say that any company intentionally designed something not to sell is just crazy. i have shown it to colleagues at work, friends and family. most say it looks smarter then the black. of course some traditional/older m photographers might not like change. maybe those were the people in the shop.", "sortedWord": "None", "Identifyer": null, "identifyer": 46896, "year": "2012"}, {"autor": "COOP666", "date": "2012-09-29 06:30:00", "content": "More road trip photos. We made a pre-dawn visit to Cadillac Ranch. I've heard complaints about using high ISO on the M9, but I love these 1250ISO shots - looks like Tri-X 400 film to me. Leica M9, f2/35mm Summicron lens, 2nd version. --img-- ", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/9/?tab=comments#comment-2127951", "origin": "L-forum", "suborigin": "268173-the-view-through-older-glass", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "more road trip photos. -----> we !!!  -----> made !!!  a pre-dawn visit to cadillac ranch. i've heard complaints about using high iso on the m9, but i love these 1250iso shots - looks like tri-x 400 film to me. leica m9, f2/35mm summicron lens, 2nd version. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 7273, "year": "2012"}, {"autor": "brianv", "date": "2012-10-13 23:13:00", "content": " A real Hack- from 4 different lenses. The Canon optics module missing the rear elements, focus mount with no optics module, retaining ring, and the rear group from a Nikkor. I could not come up with a rear fixture that would screw into place, so I wrapped the Nikkor fixture with copper tape and screwed it in. I tried a stand-off shim, but it interfered with the aperture closing down. The shim pressed against the mechanism. SO: I ended up getting the rear optic into place, tested close-up and infinity, tested flatness of field, and used JB-Weld to hold in place. Stuffed a foam strip in between the retaining ring and optics to act as a light baffle. These are all left-over parts, and I was curious to what it would all do when put together. AND- when someone on the forum uses the phrase \"Canikon\", i can reply- \"I have one of those.\" --img-- ", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/14/?tab=comments#comment-2140817", "origin": "L-forum", "suborigin": "268173-the-view-through-older-glass", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " a real hack- from 4 different lenses. the canon optics module missing the rear elements, focus mount with no optics module, retaining ring, and the rear group from a nikkor. i could not -----> come !!!  -----> up !!!  -----> with !!!  a rear fixture that would screw into place, so i wrapped the nikkor fixture -----> with !!!  copper tape and screwed it in. i tried a stand-off shim, but it interfered with the aperture closing down. the shim pressed against the mechanism. so: i ended up getting the rear optic into place, tested close-up and infinity, tested flatness of field, and used jb-weld to hold in place. stuffed a foam strip in between the retaining ring and optics to act as a light baffle. these are all left-over parts, and i was curious to what it would all do when put together. and- when someone on the forum uses the phrase \"canikon\", i can reply- \"i have one of those.\" --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 7367, "year": "2012"}, {"autor": "janrzm", "date": "2012-11-19 05:53:00", "content": "Can I make a suggestion for those using the VC 15mm Super Wide Heliar f/4.5 and Cornerfix. Code the lens as Elmarit-M 21mm f/2.8 11134 in my experience this returns the best results - 15mm Voigtlander Super Wide Heliar f/4.5 Asph Mk-1", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/2/?tab=comments#comment-2170023", "origin": "L-forum", "suborigin": "185433-m-lens-codes", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "can -----> i !!!  -----> make !!!  a suggestion for those using the vc 15mm super wide heliar f/4.5 and cornerfix. code the lens as elmarit-m 21mm f/2.8 11134 in my experience this returns the best results - 15mm voigtlander super wide heliar f/4.5 asph mk-1", "sortedWord": "None", "Identifyer": null, "identifyer": 7453, "year": "2012"}, {"autor": "wlaidlaw", "date": "2012-11-23 07:55:00", "content": "Can I make a suggestion for those using the VC 15mm Super Wide Heliar f/4.5 and Cornerfix. Code the lens as Elmarit-M 21mm f/2.8 11134 in my experience this returns the best results - 15mm Voigtlander Super Wide Heliar f/4.5 Asph Mk-1 Agreed - much better. I also think this code works better for vignetting correction of the 28 APSH Summicron on an M9, if you are shooting it wide open, than the standard correction applied by setting lens detection to auto. Wilson", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/2/?tab=comments#comment-2172966", "origin": "L-forum", "suborigin": "185433-m-lens-codes", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "can -----> i !!!  -----> make !!!  a suggestion for those using the vc 15mm super wide heliar f/4.5 and cornerfix. code the lens as elmarit-m 21mm f/2.8 11134 in my experience this returns the best results - 15mm voigtlander super wide heliar f/4.5 asph mk-1 agreed - much better. i also think this code works better for vignetting correction of the 28 apsh summicron on an m9, if you are shooting it wide open, than the standard correction applied by setting lens detection to auto. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 7455, "year": "2012"}, {"autor": "Jamie Roberts", "date": "2012-03-15 18:45:00", "content": "Great thread. I really like the way Adan used example photos to highlight the specific merits of different Mandler designed lens. Could the moderator consider classifying this thread so that we can discuss not only the efforts of Mr Mandler, but those of Mr Berek, Mr Kölsch and Mr Schröder in shaping the Leica lens philosophy and direction. I'm curious: how could a mod \"recategorize\" this thread without changing the thread's focus entirely? If you'd like to start a different thread, like \"In praise of Leica lens designers\" then you should just go ahead! Or you could just discuss the other designers as compared with Mandler --img--  Back to the Mandler designs--I just re-acquired a 75 Lux after I sold mine. Yes, it was a dumb thing to sell. Yes, it cost me more money than I made on the sale. No, I don't regret it at all --img-- ", "link": "https://www.l-camera-forum.com/topic/45272-in-praise-of-the-mandler-lenses/page/5/?tab=comments#comment-1955269", "origin": "L-forum", "suborigin": "45272-in-praise-of-the-mandler-lenses", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "great thread. i really like the way adan used example photos to highlight the specific merits of different mandler designed lens. could the moderator consider classifying this thread so that we can discuss not only the efforts of mr mandler, but those of mr berek, mr kölsch and mr schröder in shaping the leica lens philosophy and direction. i'm curious: how could a mod \"recategorize\" this thread without changing the thread's focus entirely? if you'd like to start a different thread, like \"in praise of leica lens designers\" then you should just go ahead! or you could just discuss the other designers as compared with mandler --img--  back to the mandler designs--i just re-acquired a 75 lux after i sold mine. yes, it was a dumb thing to sell. yes, it cost me more money than -----> i !!!  -----> made !!!  on the sale. no, i don't regret it at all --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 17041, "year": "2012"}, {"autor": "algrove", "date": "2012-11-22 04:17:00", "content": "With an R lens mounted to the M via the R adapter, did you take a look through the optical viewfinder? No, they were highlighting LV and I wonder if it was even working when the R Adapter was mounted. I did have them mount a 135 to see how it would focus also with LV and of course it brought up the normal frame lines in the OVF. I will make some calls/emails to see if I can get some form of a specific answer. Perhaps our LFI man, mjh, can get an answer faster. Edited November 22, 2012 by algrove", "link": "https://www.l-camera-forum.com/topic/192591-lens-code-for-new-apo-50-f2-confusion/?tab=comments#comment-2172236", "origin": "L-forum", "suborigin": "192591-lens-code-for-new-apo-50-f2-confusion", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "with an r lens mounted to the m via the r adapter, did you take a look through the optical viewfinder? no, they were highlighting lv and i wonder if it was even working when the r adapter was mounted. i did have them mount a 135 to see how it would focus also with lv and of course it brought up the normal frame lines in the ovf. -----> i !!!  -----> will !!!  -----> make !!!  some calls/emails to see if -----> i !!!  can get some form of a specific answer. perhaps our lfi man, mjh, can get an answer faster. edited november 22, 2012 by algrove", "sortedWord": "None", "Identifyer": null, "identifyer": 21730, "year": "2012"}, {"autor": "dkCambridgeshire", "date": "2012-06-22 15:34:00", "content": "So please help me here. If I purchase the item from BH - what adapter will I need as well? I have the tube and such. But what is this Series VI to 49mm adaptor? Where is this located? Is this the adapter? Thanks, Sam I made my own as per previous post in this thread which states: To attach the VIb Elpros to the X1 I used: Kiwi LA-49X1 filter adaptor tube , plus a 49mm to 52mm step-up ring. The first VIb Elpro was glued into the 52mm side of the step up ring … additional VIb Elpros were then screwed directly into each other. ... easy to get hold of the step up ring and a tube of glue. But you really need TWO Elpro VIb c/u lenses if using them with the X1 and want to photograph e.g. coins. dunk Edited June 22, 2012 by dkpeterborough", "link": "https://www.l-camera-forum.com/topic/179342-improving-the-x1-x2-macro-performance/?tab=comments#comment-2046299", "origin": "L-forum", "suborigin": "179342-improving-the-x1-x2-macro-performance", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "so please help me here. if i purchase the item from bh - what adapter will i need as well? i have the tube and such. but what is this series vi to 49mm adaptor? where is this located? is this the adapter? thanks, sam -----> i !!!  -----> made !!!  my own as per previous post in this thread which states: to attach the vib elpros to the x1 -----> i !!!  used: kiwi la-49x1 filter adaptor tube , plus a 49mm to 52mm step-up ring. the first vib elpro was glued into the 52mm side of the step up ring … additional vib elpros were then screwed directly into each other. ... easy to get hold of the step up ring and a tube of glue. but you really need two elpro vib c/u lenses if using them with the x1 and want to photograph e.g. coins. dunk edited june 22, 2012 by dkpeterborough", "sortedWord": "None", "Identifyer": null, "identifyer": 10608, "year": "2012"}, {"autor": "wildlightphoto", "date": "2012-01-18 21:47:00", "content": "If you want a zoom lens, make sure it's made in Germany, not Japan. I'd make an exception for the 35-70mm f/4 and the 80-200mm f/4. Both made in Japan, both excellent quality.", "link": "https://www.l-camera-forum.com/topic/170755-leica-r8-glass/?tab=comments#comment-1901876", "origin": "L-forum", "suborigin": "170755-leica-r8-glass", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": "if you want a zoom lens, make sure it's made in germany, not japan. -----> i !!! -----> 'd !!!  -----> make !!!  an exception for the 35-70mm f/4 and the 80-200mm f/4. both made in japan, both excellent quality.", "sortedWord": "None", "Identifyer": null, "identifyer": 19434, "year": "2012"}, {"autor": "masjah", "date": "2012-01-18 23:15:00", "content": "I'd make an exception for the 35-70mm f/4 and the 80-200mm f/4. Both made in Japan, both excellent quality. Agreed. And the 35-70/4 can focus down to around 10 inches, which gives it some sort of macro capability (1:2.8 I think).", "link": "https://www.l-camera-forum.com/topic/170755-leica-r8-glass/?tab=comments#comment-1901934", "origin": "L-forum", "suborigin": "170755-leica-r8-glass", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": "-----> i !!! -----> 'd !!!  -----> make !!!  an exception for the 35-70mm f/4 and the 80-200mm f/4. both made in japan, both excellent quality. agreed. and the 35-70/4 can focus down to around 10 inches, which gives it some sort of macro capability (1:2.8 i think).", "sortedWord": "None", "Identifyer": null, "identifyer": 19435, "year": "2012"}, {"autor": "like_it", "date": "2012-10-18 18:04:00", "content": "Hi Torsten, et al --img--  I tried to clean it today with your instruction, unfortunately I couldn't really figure out, where I have to clean my Camera. I made some pics while I was working, so probably you can try to help with this pics. In one picture I marked the magnets and lever arms I found. Sorry for the bad quality but I had just my iphone around me to take pictures. I guess what you ment is marked as \"magnet 1\" and \"lever arm 1\" if so where do I have to clean it? This was the only component, which was moving while I pressed the shutter. But I can't really clean it. Another problem was, that there was some sort of plastic bag around the magnets. Do you had the same problems with your camera? hope these pics helps you to help me --img-- If you can't explain it with these pics, let me know --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/189923-leica-r-5-shutter-problems/?tab=comments#comment-2144594", "origin": "L-forum", "suborigin": "189923-leica-r-5-shutter-problems", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "hi torsten, et al --img--  i tried to clean it today with your instruction, unfortunately i couldn't really figure out, where i have to clean my camera. -----> i !!!  -----> made !!!  some pics while -----> i !!!  was working, so probably you can try to help with this pics. in one picture i marked the magnets and lever arms i found. sorry for the bad quality but i had just my iphone around me to take pictures. i guess what you ment is marked as \"magnet 1\" and \"lever arm 1\" if so where do i have to clean it? this was the only component, which was moving while i pressed the shutter. but i can't really clean it. another problem was, that there was some sort of plastic bag around the magnets. do you had the same problems with your camera? hope these pics helps you to help me --img-- if you can't explain it with these pics, let me know --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 21975, "year": "2012"}, {"autor": "Rick", "date": "2012-04-14 19:08:00", "content": "It's the close focus cam on the DR that keeps it from working on the M8/9. You can have it modified, but then you loose the close focus feature and might as well get the Rigid.I think DAG can do the Mod. Actually, when it is modified you gain the close focus feature on the M9/8. What you lose is the close focus rangefinder coupling. So, it will gain near focus on the M9/8 (and 4m to infinity). But, the range finder coupling stops as you pass through one meter and focus nearer. If, big if, the M10 has live view then the near focus would be very useable with live view. I think for me, this lens is a better choice for the future than the rigid. It would be nice to have that near focus and I am not a collector so, I don't really care if, in making it more functional for myself I make it worth less for a collector that won't see the lens until I am dead and gone. Maybe when people discover that photographers are modifying this lens to gain near focus on the M10 (I know, future speculation) it will become even more sought out and rare and even more expensive to buy.--img--  Also, I tried the coding settings and there isn't one for the Ver. II in the menu of the M9. But, the 11817 seems to give the most pleasing color (less blue/warmer) of all the 50mm f2.0 lens choices. It happens to be the Ver. III. I know some have commented that, just pick one... but, there are differences in what the camera outputs (or LR developes) even at 50mm.", "link": "https://www.l-camera-forum.com/topic/173504-dual-range-summicron/page/2/?tab=comments#comment-1983144", "origin": "L-forum", "suborigin": "173504-dual-range-summicron", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "it's the close focus cam on the dr that keeps it from working on the m8/9. you can have it modified, but then you loose the close focus feature and might as well get the rigid.i think dag can do the mod. actually, when it is modified you gain the close focus feature on the m9/8. what you lose is the close focus rangefinder coupling. so, it will gain near focus on the m9/8 (and 4m to infinity). but, the range finder coupling stops as you pass through one meter and focus nearer. if, big if, the m10 has live view then the near focus would be very useable with live view. i think for me, this lens is a better choice for the future than the rigid. it would be nice to have that near focus and -----> i !!!  am not a collector so, -----> i !!!  don't really care if, in making it more functional for myself -----> i !!!  -----> make !!!  it worth less for a collector that won't see the lens until -----> i !!!  am dead and gone. maybe when people discover that photographers are modifying this lens to gain near focus on the m10 (i know, future speculation) it will become even more sought out and rare and even more expensive to buy.--img--  also, i tried the coding settings and there isn't one for the ver. ii in the menu of the m9. but, the 11817 seems to give the most pleasing color (less blue/warmer) of all the 50mm f2.0 lens choices. it happens to be the ver. iii. i know some have commented that, just pick one... but, there are differences in what the camera outputs (or lr developes) even at 50mm.", "sortedWord": "None", "Identifyer": null, "identifyer": 37519, "year": "2012"}, {"autor": "MarkP", "date": "2012-07-19 21:07:00", "content": " I agree with Jeff and also have all of my gear covered by comprehensive insurance. A claim I made over a year ago was paid without any problems.", "link": "https://www.l-camera-forum.com/topic/182078-dropped-my-m9-on-sand-and-sea-water-advice-needed/page/2/?tab=comments#comment-2066774", "origin": "L-forum", "suborigin": "182078-dropped-my-m9-on-sand-and-sea-water-advice-needed", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " i agree with jeff and also have all of my gear covered by comprehensive insurance. a claim -----> i !!!  -----> made !!!  over a year ago was paid without any problems.", "sortedWord": "None", "Identifyer": null, "identifyer": 83258, "year": "2012"}, {"autor": "luigi bertolotti", "date": "2012-07-14 22:34:00", "content": "So the rectangular part with the stepped baffles is metal on yours? I have never seen one where the entire hood was metal, only the circular part where it attaches to the lens. In fact I have never seen any rectangular clip-on or bayonet-on Leica hood, M or R, where the front (rectangular) part was metal (not speaking of the recent screw-on hoods). Always a very hard plastic. Yours has got to be amazingly rare. I've never seen it mentioned in any of the historical literature either. Sorry, friends... --img--  : I finally took out my hood (I was at the sea - on vacation... ) and, I admit, I made a WRONG statement : the ring is metal but the rectangular \"stepped\" part is plastic... very solid, but plastic, definitely... sorry to have caused this rumor : ring is engraved \"Leitz Wetzlar Germany\" with 1 : 2.8 / 28 and 1: 3.4 / 21. The back cap, on the contrary, is really of metal. Funny enough, the box of the Elmarit 28 1st bears an image of the lens that makes to think of a chrome one... --img-- --img--  Edited July 14, 2012 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/182974-21mm-super-angulon-f34-hood/?tab=comments#comment-2062703", "origin": "L-forum", "suborigin": "182974-21mm-super-angulon-f34-hood", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "so the rectangular part with the stepped baffles is metal on yours? i have never seen one where the entire hood was metal, only the circular part where it attaches to the lens. in fact i have never seen any rectangular clip-on or bayonet-on leica hood, m or r, where the front (rectangular) part was metal (not speaking of the recent screw-on hoods). always a very hard plastic. yours has got to be amazingly rare. i've never seen it mentioned in any of the historical literature either. sorry, friends... --img--  : i finally took out my hood (i was at the sea - on vacation... ) and, -----> i !!!  admit, -----> i !!!  -----> made !!!  a wrong statement : the ring is metal but the rectangular \"stepped\" part is plastic... very solid, but plastic, definitely... sorry to have caused this rumor : ring is engraved \"leitz wetzlar germany\" with 1 : 2.8 / 28 and 1: 3.4 / 21. the back cap, on the contrary, is really of metal. funny enough, the box of the elmarit 28 1st bears an image of the lens that makes to think of a chrome one... --img-- --img--  edited july 14, 2012 by luigi bertolotti", "sortedWord": "None", "Identifyer": null, "identifyer": 84148, "year": "2012"}, {"autor": "lars_bergquist", "date": "2012-09-15 15:57:00", "content": "I have gone through several generations of binoculars. So I have made a couple of observations: As magnificcation increases, so does 'bino shake' until it really makes accurate viewing impossible. I understand that there may be individual variation between users, but for me, 10x in a reasonably sized package is the useful maximum. Strap support can be a useful aid the steady holding, as with cameras. Mini-binos are great for carrying in a jacket pocket, and I do carry a Ultravid 8X20, but the specs make for exit pupils with a diamerter of 2.5mm. The reason why you have trouble seeing through a pair of binos is usually that one of your own pupils misses one of the bino's exit pupils. Really small exit pupils like these call for very exact alignment of the pupils. You have to set the pupil distance just right and develop a way of bringing the instrument up to the eyes in a very precise way. This will often slow you down. Here comes the heresy. I needed a pair of full size binos, 10x42 or thereabouts, which I could use with my varifocals on, like I do with the Ultravid. A specialised shop in Stockholm has a good assortment. I tried out offerings from Leica, Zeiss and Nikon – and a 'No Great Name' brand, Magni-Pro, carried by the shop. I found to my surprise that these were clearly better then the best Nikon could offer, about equal to the best of Zeiss, and marginally inferior to Leica – but at a fraction of the price. They were nitrogen-filled, watertight, rubber-covered and with specs-compatible eyepieces. The sensible choice was to buy them, and that I did. Will I languish eternally in a non-Leica hell? No. The old man who saw the crescent of Venus with his bare eyes once", "link": "https://www.l-camera-forum.com/topic/186959-leica-binos/page/2/?tab=comments#comment-2113574", "origin": "L-forum", "suborigin": "186959-leica-binos", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "i have gone through several generations of binoculars. so -----> i !!!  -----> have !!!  -----> made !!!  a couple of observations: as magnificcation increases, so does 'bino shake' until it really makes accurate viewing impossible. i understand that there may be individual variation between users, but for me, 10x in a reasonably sized package is the useful maximum. strap support can be a useful aid the steady holding, as with cameras. mini-binos are great for carrying in a jacket pocket, and i do carry a ultravid 8x20, but the specs make for exit pupils with a diamerter of 2.5mm. the reason why you have trouble seeing through a pair of binos is usually that one of your own pupils misses one of the bino's exit pupils. really small exit pupils like these call for very exact alignment of the pupils. you have to set the pupil distance just right and develop a way of bringing the instrument up to the eyes in a very precise way. this will often slow you down. here comes the heresy. i needed a pair of full size binos, 10x42 or thereabouts, which i could use with my varifocals on, like i do with the ultravid. a specialised shop in stockholm has a good assortment. i tried out offerings from leica, zeiss and nikon – and a 'no great name' brand, magni-pro, carried by the shop. i found to my surprise that these were clearly better then the best nikon could offer, about equal to the best of zeiss, and marginally inferior to leica – but at a fraction of the price. they were nitrogen-filled, watertight, rubber-covered and with specs-compatible eyepieces. the sensible choice was to buy them, and that i did. will i languish eternally in a non-leica hell? no. the old man who saw the crescent of venus with his bare eyes once", "sortedWord": "None", "Identifyer": null, "identifyer": 89584, "year": "2012"}, {"autor": "ijporter", "date": "2012-09-16 11:36:00", "content": " In 1985 I purchased some 7x42 Trinovids in green rubber. They were magnificent binoculars, and came into their own in low light, but their size and weight meant that I often left them behind when carrying my R6 and five R-series lenses. After being on a trek with my R-system (sans 7x42s) and seeing others using their compact 10x25s, I sold the 7x42s and bought a pair of 10x25 Ultravids. Although I prefer the brightness of the 7x42s, I find that the compactness and lightness of the 10x25s means that I am using them a lot more. They are superb binoculars and, if greater usage means a wiser choice, then I made a wise choice in buying the 10x25s. Alas, the R-system has also gone, but perhaps I may - one day - get a M10 system. Ian", "link": "https://www.l-camera-forum.com/topic/186959-leica-binos/page/2/?tab=comments#comment-2114182", "origin": "L-forum", "suborigin": "186959-leica-binos", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " in 1985 i purchased some 7x42 trinovids in green rubber. they were magnificent binoculars, and came into their own in low light, but their size and weight meant that i often left them behind when carrying my r6 and five r-series lenses. after being on a trek with my r-system (sans 7x42s) and seeing others using their compact 10x25s, i sold the 7x42s and bought a pair of 10x25 ultravids. although i prefer the brightness of the 7x42s, i find that the compactness and lightness of the 10x25s means that i am using them a lot more. they are superb binoculars and, if greater usage means a wiser choice, then -----> i !!!  -----> made !!!  a wise choice in buying the 10x25s. alas, the r-system has also gone, but perhaps i may - one day - get a m10 system. ian", "sortedWord": "None", "Identifyer": null, "identifyer": 89585, "year": "2012"}, {"autor": "jankap", "date": "2012-09-16 11:46:00", "content": "I have a Trinovid 8x40 BA for home and garden, which I bought off priced in about 1990. A friend of mine machined a pair of sunglasses for it. I wanted to see sunspots, that works fine. I also made a tripod connection. For trips I have no bino, the Trinovid is somewhat too heavy. Interesting is a WW2 6x30 (Wehrmacht) I inheritated from my father in law. The quality is very good, but one sees the development of the optics over 50 years. Jan", "link": "https://www.l-camera-forum.com/topic/186959-leica-binos/page/2/?tab=comments#comment-2114202", "origin": "L-forum", "suborigin": "186959-leica-binos", "result": true, "Selector": "i also made", "selectorShort": "make", "MarkedSent": "i have a trinovid 8x40 ba for home and garden, which i bought off priced in about 1990. a friend of mine machined a pair of sunglasses for it. i wanted to see sunspots, that works fine. -----> i !!!  -----> also !!!  -----> made !!!  a tripod connection. for trips i have no bino, the trinovid is somewhat too heavy. interesting is a ww2 6x30 (wehrmacht) i inheritated from my father in law. the quality is very good, but one sees the development of the optics over 50 years. jan", "sortedWord": "None", "Identifyer": null, "identifyer": 89586, "year": "2012"}, {"autor": "elvispreasley", "date": "2012-12-13 02:59:00", "content": "During the day I made some test shots in my apartment and found that an original 75mm frame in M8 viewfinder is also giving the same effect: the picture, that you're trying to crop, during the shot, according to your 75 frame and final picture, that you can see on your LCD after shot - is two different pictures. looks like a 75mm frame on M8 is a very tricky frame, so I just need to get use to it.", "link": "https://www.l-camera-forum.com/topic/193971-does-the-voigtlander-75mm-external-viewfinder-useful/?tab=comments#comment-2188390", "origin": "L-forum", "suborigin": "193971-does-the-voigtlander-75mm-external-viewfinder-useful", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "during the day -----> i !!!  -----> made !!!  some test shots in my apartment and found that an original 75mm frame in m8 viewfinder is also giving the same effect: the picture, that you're trying to crop, during the shot, according to your 75 frame and final picture, that you can see on your lcd after shot - is two different pictures. looks like a 75mm frame on m8 is a very tricky frame, so i just need to get use to it.", "sortedWord": "None", "Identifyer": null, "identifyer": 89897, "year": "2012"}, {"autor": "HeinzX", "date": "2012-09-23 14:17:00", "content": "In one of the last LFIs an excellent turkish photographer (some shots of turkey of the sixties hav been shown) - a member of Magnum has said: It does not matter, what equipment I use, give me a sewing machine, and I will make photogaphs with it. Of course this is overstated, but there is a ray of truth in it. But coming back to the original question - unprocessed you will see some in some cases - depending on the lenses, which are used. But after processing I really doubt, if the best lenses of Canon or Nikon are used. Nevertheless users of M Leicas and the relevant Leica lenses are no fools because the spent so much money on the Leica equipment. This equipment is much less bulky and much more lighter than the same in DSLRs. And it is not so striking as a DSLR. By the way, the price gap between Leica and i.e. Canon is becoming closer. The 1 DX is Euro 6300, the new 24/70 2.8 II Euro 2300.", "link": "https://www.l-camera-forum.com/topic/187319-leica-lenses-vs-nikoncanon/page/3/?tab=comments#comment-2122636", "origin": "L-forum", "suborigin": "187319-leica-lenses-vs-nikoncanon", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "in one of the last lfis an excellent turkish photographer (some shots of turkey of the sixties hav been shown) - a member of magnum has said: it does not matter, what equipment -----> i !!!  use, give me a sewing machine, and -----> i !!!  -----> will !!!  -----> make !!!  photogaphs with it. of course this is overstated, but there is a ray of truth in it. but coming back to the original question - unprocessed you will see some in some cases - depending on the lenses, which are used. but after processing i really doubt, if the best lenses of canon or nikon are used. nevertheless users of m leicas and the relevant leica lenses are no fools because the spent so much money on the leica equipment. this equipment is much less bulky and much more lighter than the same in dslrs. and it is not so striking as a dslr. by the way, the price gap between leica and i.e. canon is becoming closer. the 1 dx is euro 6300, the new 24/70 2.8 ii euro 2300.", "sortedWord": "None", "Identifyer": null, "identifyer": 91771, "year": "2012"}, {"autor": "k-hawinkler", "date": "2012-04-02 02:33:00", "content": " I am interested in quantitatively comparing the resolution of Leica lenses with the resolution of digital sensors. So, I would like to know how one can determine whether a given lens outresolves a given sensor and vice versa, or whether the resolution of lens and sensor are comparable. For example, provided I didn't make an error, the • Leica M9 has about 145 pixel/mm linear resolution, whereas the • Nikon D800E has 205 pixel/mm, and the • Sony NEX-7 has 255 pixel/mm. MTF curves for some Leica R-lenses can be found here: Leica Camera AG - Downloads For example, the • LEICA APO-TELYT-R 280 mm f/4 has this MTF graph wide open, and the --img--  • LEICA SUMMILUX-R 80 mm f/1.4 has this one wide open: --img--  How would one interpret these two types of data, namely linear resolution and MTF curves, and compare the two? Or is there other type of data available that is more suited for the task at hand? Many thanks for your explanations. Edited April 2, 2012 by k-hawinkler", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1970545", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "i didn't make", "selectorShort": "make", "MarkedSent": " i am interested in quantitatively comparing the resolution of leica lenses with the resolution of digital sensors. so, i would like to know how one can determine whether a given lens outresolves a given sensor and vice versa, or whether the resolution of lens and sensor are comparable. for example, provided -----> i !!!  -----> did !!! -----> n't !!!  -----> make !!!  an error, the • leica m9 has about 145 pixel/mm linear resolution, whereas the • nikon d800e has 205 pixel/mm, and the • sony nex-7 has 255 pixel/mm. mtf curves for some leica r-lenses can be found here: leica camera ag - downloads for example, the • leica apo-telyt-r 280 mm f/4 has this mtf graph wide open, and the --img--  • leica summilux-r 80 mm f/1.4 has this one wide open: --img--  how would one interpret these two types of data, namely linear resolution and mtf curves, and compare the two? or is there other type of data available that is more suited for the task at hand? many thanks for your explanations. edited april 2, 2012 by k-hawinkler", "sortedWord": "None", "Identifyer": null, "identifyer": 91825, "year": "2012"}, {"autor": "luigi bertolotti", "date": "2012-04-02 10:28:00", "content": " I am interested in quantitatively comparing the resolution of Leica lenses with the resolution of digital sensors. So, I would like to know how one can determine whether a given lens outresolves a given sensor and vice versa, or whether the resolution of lens and sensor are comparable. For example, provided I didn't make an error, the • Leica M9 has about 145 pixel/mm linear resolution, whereas the • Nikon D800E has 205 pixel/mm, and the • Sony NEX-7 has 255 pixel/mm.... . Without entering on details, regarding standard photographic sensors one has always to keep in mind that, owing to Bayer filter, \"one\" pixel is indeed recorded as an interpolation of four (a 2x2 square of) , which, basically, halves the linear resolution.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1970827", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "i didn't make", "selectorShort": "make", "MarkedSent": " i am interested in quantitatively comparing the resolution of leica lenses with the resolution of digital sensors. so, i would like to know how one can determine whether a given lens outresolves a given sensor and vice versa, or whether the resolution of lens and sensor are comparable. for example, provided -----> i !!!  -----> did !!! -----> n't !!!  -----> make !!!  an error, the • leica m9 has about 145 pixel/mm linear resolution, whereas the • nikon d800e has 205 pixel/mm, and the • sony nex-7 has 255 pixel/mm.... . without entering on details, regarding standard photographic sensors one has always to keep in mind that, owing to bayer filter, \"one\" pixel is indeed recorded as an interpolation of four (a 2x2 square of) , which, basically, halves the linear resolution.", "sortedWord": "None", "Identifyer": null, "identifyer": 91831, "year": "2012"}, {"autor": "k-hawinkler", "date": "2012-04-02 20:19:00", "content": "Gentlemen, Thanks for the feedback. However unfortunately I may have formulated my question, nevertheless, I am glad I started this thread as I already learned a few things. To keep on track, please permit me to frame the discussion. It looks to me, that the subject I had in mind, can be broken down into several pieces, that can be analyzed separately. Here we go (and I am sure any mistakes I make will be corrected): • How to translate linear sensor resolution [pixel/mm] into line pairs per mm [lp/mm]? Based on the above feedback it looks like one divides linear sensor resolution by 1.5. So we get: • Leica M9: 145 pixel/mm corresponds to 96 lp/mm. • Nikon D800E: 205 pixel/mm corresponds to 137 lp/mm. • Sony NEX-7: 255 pixel/mm corresponds to 171 lp/mm. Question: Can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? Thanks. • Lens resolution limits and where to find the information? In the LEICA COMPENDIUM by Erwin Puts, 2011, ISBN/EAN: 978-94-91089-02-2, page 562, he states that the APO-Telyt-R 280mm f/4 is diffraction limited and has a resolution limit of of a breath-taking 500 lp/mm at full aperture. Additional lenses of interest to me include: (1965) Elmar 65/3.5 (1970) Summicron v2 90/2 (1960) Elmarit 90/2.8 (1965) Tri-Element Elmar 90/4 (1979) Elmarit-M v3 135/2.8 (1970) Tele-Elmar 135/4 as well as: (1963) Telyt-V 200/4 (1965) Telyt-V v2 280/4.8 (1975) Telyt-V v3 280/4.8 (1967) Telyt-V 400/5.6 (1969) Telyt-V 400/6.8 (1968) Telyt-V 560/5.6 In http://www.l-camera-forum.com/leica-forum/2021715-post15.html Mike (michali) has listed a number of R-lenses that he had leitaxed. I think these lenses would also be of interest in the current context. The lenses are: 19mm Elmarit vers.2 28-90mm Vario Elmar 105-280mm Vario Elmar 80mm Summilux 100mm APO Macro Elmarit 280mm f4 APO-Telyt-R 1.4x APO-Extender-R I would like to add the following R-lenses: 2x APO-Extender-R 180mm f2.8 APO-Telyt-R 180mm f3.4 APO-Telyt-R 280mm f2.8 APO-Telyt-R I plan to go through the Puts' Compendium to see whether I can find more lens resolution limits but would appreciate if folks listed here those limits that they know about. • Lens resolution limits, sensor resolution It's comforting to know that: Lenses don't outresolve sensors, and sensors don't outresolve lenses. Better lenses are better on any sensor and better sensors are better behind any lens. Question: Can the last sentence be quantified? If so, how? What is considered an optimal match? • Errors and misconceptions 01af states that the article Do Sensors “Outresolve” Lenses? is full of layman's errors and misconceptions. Question: Could you please elaborate and briefly describe the 2 or 3 most egregious mistakes? Thanks again for the feedback already given and hopefully more to come. Edited April 2, 2012 by k-hawinkler", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1971451", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "gentlemen, thanks for the feedback. however unfortunately i may have formulated my question, nevertheless, i am glad i started this thread as i already learned a few things. to keep on track, please permit me to frame the discussion. it looks to me, that the subject i had in mind, can be broken down into several pieces, that can be analyzed separately. here we go (and -----> i !!!  am sure any mistakes -----> i !!!  -----> make !!!  will be corrected): • how to translate linear sensor resolution [pixel/mm] into line pairs per mm [lp/mm]? based on the above feedback it looks like one divides linear sensor resolution by 1.5. so we get: • leica m9: 145 pixel/mm corresponds to 96 lp/mm. • nikon d800e: 205 pixel/mm corresponds to 137 lp/mm. • sony nex-7: 255 pixel/mm corresponds to 171 lp/mm. question: can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? thanks. • lens resolution limits and where to find the information? in the leica compendium by erwin puts, 2011, isbn/ean: 978-94-91089-02-2, page 562, he states that the apo-telyt-r 280mm f/4 is diffraction limited and has a resolution limit of of a breath-taking 500 lp/mm at full aperture. additional lenses of interest to me include: (1965) elmar 65/3.5 (1970) summicron v2 90/2 (1960) elmarit 90/2.8 (1965) tri-element elmar 90/4 (1979) elmarit-m v3 135/2.8 (1970) tele-elmar 135/4 as well as: (1963) telyt-v 200/4 (1965) telyt-v v2 280/4.8 (1975) telyt-v v3 280/4.8 (1967) telyt-v 400/5.6 (1969) telyt-v 400/6.8 (1968) telyt-v 560/5.6 in http://www.l-camera-forum.com/leica-forum/2021715-post15.html mike (michali) has listed a number of r-lenses that he had leitaxed. i think these lenses would also be of interest in the current context. the lenses are: 19mm elmarit vers.2 28-90mm vario elmar 105-280mm vario elmar 80mm summilux 100mm apo macro elmarit 280mm f4 apo-telyt-r 1.4x apo-extender-r i would like to add the following r-lenses: 2x apo-extender-r 180mm f2.8 apo-telyt-r 180mm f3.4 apo-telyt-r 280mm f2.8 apo-telyt-r i plan to go through the puts' compendium to see whether i can find more lens resolution limits but would appreciate if folks listed here those limits that they know about. • lens resolution limits, sensor resolution it's comforting to know that: lenses don't outresolve sensors, and sensors don't outresolve lenses. better lenses are better on any sensor and better sensors are better behind any lens. question: can the last sentence be quantified? if so, how? what is considered an optimal match? • errors and misconceptions 01af states that the article do sensors “outresolve” lenses? is full of layman's errors and misconceptions. question: could you please elaborate and briefly describe the 2 or 3 most egregious mistakes? thanks again for the feedback already given and hopefully more to come. edited april 2, 2012 by k-hawinkler", "sortedWord": "None", "Identifyer": null, "identifyer": 91836, "year": "2012"}, {"autor": "adan", "date": "2012-04-03 00:14:00", "content": "After post #12, my head hurts. --img--  However: Question: Can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? It is an approximation. We know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - Bayer pattern color distinctions; AA filters, or the aliasing artifacts one gets without AA filters, etc. We also know that it is often better, depending on subject detail, than the 1:2 relationship known as the Nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). Therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". One might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. \"So we get: • Leica M9: 145 pixel/mm corresponds to 96 lp/mm. • Nikon D800E: 205 pixel/mm corresponds to 137 lp/mm. • Sony NEX-7: 255 pixel/mm corresponds to 171 lp/mm. ... so long as one does not take into account any AA filtering, or other blurring. Some say there is noticeable loss of per-pixel resolution between the M8 and the M9, simply because the M9 has a thicker cover glass/IR filter (0.7mm vs. the M8's 0.5mm - I don't see it myself). The Nikon D800E uses a \"reversing\" AA filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which I doubt works perfectly, but no doubt restores some sharpness. The Sony Nex-7 has - who knows what level of AA filtering (fairly little, from the samples I've seen, but probably not zero). It seems to me you are trying to come up with hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to AA filters) always be \"fuzzy.\" Lots of things that Sony or Nikon or Leica know, but are not public domain. You can probably find Modern or Pop. Photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). But if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **My college library had MP or PP back-issues, in hard copy, from 1945-1980 at one point.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1971651", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after post #12, my head hurts. --img--  however: question: can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? it is an approximation. we know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - bayer pattern color distinctions; aa filters, or the aliasing artifacts one gets without aa filters, etc. we also know that it is often better, depending on subject detail, than the 1:2 relationship known as the nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". one might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. \"so we get: • leica m9: 145 pixel/mm corresponds to 96 lp/mm. • nikon d800e: 205 pixel/mm corresponds to 137 lp/mm. • sony nex-7: 255 pixel/mm corresponds to 171 lp/mm. ... so long as one does not take into account any aa filtering, or other blurring. some say there is noticeable loss of per-pixel resolution between the m8 and the m9, simply because the m9 has a thicker cover glass/ir filter (0.7mm vs. the m8's 0.5mm - i don't see it myself). the nikon d800e uses a \"reversing\" aa filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which i doubt works perfectly, but no doubt restores some sharpness. the sony nex-7 has - who knows what level of aa filtering (fairly little, from the samples i've seen, but probably not zero). it seems to me you are trying to -----> come !!!  -----> up !!!  -----> with !!!  hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to aa filters) always be \"fuzzy.\" lots of things that sony or nikon or leica know, but are not public domain. you can probably find modern or pop. photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). but if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **my college library had mp or pp back-issues, in hard copy, from 1945-1980 at one point.", "sortedWord": "None", "Identifyer": null, "identifyer": 91838, "year": "2012"}, {"autor": "k-hawinkler", "date": "2012-04-03 17:17:00", "content": "After post #12, my head hurts. --img--  However: Question: Can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? It is an approximation. We know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - Bayer pattern color distinctions; AA filters, or the aliasing artifacts one gets without AA filters, etc. We also know that it is often better, depending on subject detail, than the 1:2 relationship known as the Nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). Therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". One might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. [u]\"So we get: • Leica M9: 145 pixel/mm corresponds to 96 lp/mm. • Nikon D800E: 205 pixel/mm corresponds to 137 lp/mm. • Sony NEX-7: 255 pixel/mm corresponds to 171 lp/mm.[/u] ... so long as one does not take into account any AA filtering, or other blurring. Some say there is noticeable loss of per-pixel resolution between the M8 and the M9, simply because the M9 has a thicker cover glass/IR filter (0.7mm vs. the M8's 0.5mm - I don't see it myself). The Nikon D800E uses a \"reversing\" AA filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which I doubt works perfectly, but no doubt restores some sharpness. The Sony Nex-7 has - who knows what level of AA filtering (fairly little, from the samples I've seen, but probably not zero). It seems to me you are trying to come up with hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to AA filters) always be \"fuzzy.\" Lots of things that Sony or Nikon or Leica know, but are not public domain. You can probably find Modern or Pop. Photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). But if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **My college library had MP or PP back-issues, in hard copy, from 1945-1980 at one point. Andy, Thanks for your post. As always very informative. Sorry if I gave you a headache with this thread. We got quite a bit of wet snow over night. It brought down a power line in the neighborhood and we were without power until a few minutes ago, so my computers were cut off the Internet. Maybe I should explain briefly what I hope to get out of this thread. Basically, at a minimum, a rough estimate of Leica lens resolution limits as they developed over time, and hopefully accurate numbers for some lenses. Despite power loss, I was able to read on my iPad some older material of Erwin Puts that I had downloaded before and found some more useful information about Leica lens resolution limits. I plan to summarize that later. If I understand you correctly, then the corresponding line pairs per mm numbers I computed for the three different sensors should be viewed as upper limits due to the effects you describe. And 01af seems to imply to cut back the numbers even further by another factor of 2. Interesting. With regards to the D800E, a Nikon manager stated in an interview, that for cost reasons in order to have the same register distance for the D800 and D800E, they left the first part of the filter in the D800E. This splits the signal in two. So, instead of splitting it again subsequently (in the other direction) as in the D800, they just recombine the split signals, effectively canceling the first split. I doubt Nikon will release the D800E to market unless they convinced themselves of a satisfactorily implementation. Thanks also for the pointers to Modern or Pop. Photography reviews. I will see what my local library has. Many thanks again. I appreciate your help.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1972324", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after post #12, my head hurts. --img--  however: question: can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? it is an approximation. we know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - bayer pattern color distinctions; aa filters, or the aliasing artifacts one gets without aa filters, etc. we also know that it is often better, depending on subject detail, than the 1:2 relationship known as the nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". one might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. [u]\"so we get: • leica m9: 145 pixel/mm corresponds to 96 lp/mm. • nikon d800e: 205 pixel/mm corresponds to 137 lp/mm. • sony nex-7: 255 pixel/mm corresponds to 171 lp/mm.[/u] ... so long as one does not take into account any aa filtering, or other blurring. some say there is noticeable loss of per-pixel resolution between the m8 and the m9, simply because the m9 has a thicker cover glass/ir filter (0.7mm vs. the m8's 0.5mm - i don't see it myself). the nikon d800e uses a \"reversing\" aa filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which i doubt works perfectly, but no doubt restores some sharpness. the sony nex-7 has - who knows what level of aa filtering (fairly little, from the samples i've seen, but probably not zero). it seems to me you are trying to -----> come !!!  -----> up !!!  -----> with !!!  hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to aa filters) always be \"fuzzy.\" lots of things that sony or nikon or leica know, but are not public domain. you can probably find modern or pop. photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). but if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **my college library had mp or pp back-issues, in hard copy, from 1945-1980 at one point. andy, thanks for your post. as always very informative. sorry if i gave you a headache with this thread. we got quite a bit of wet snow over night. it brought down a power line in the neighborhood and we were without power until a few minutes ago, so my computers were cut off the internet. maybe i should explain briefly what i hope to get out of this thread. basically, at a minimum, a rough estimate of leica lens resolution limits as they developed over time, and hopefully accurate numbers for some lenses. despite power loss, i was able to read on my ipad some older material of erwin puts that i had downloaded before and found some more useful information about leica lens resolution limits. i plan to summarize that later. if i understand you correctly, then the corresponding line pairs per mm numbers i computed for the three different sensors should be viewed as upper limits due to the effects you describe. and 01af seems to imply to cut back the numbers even further by another factor of 2. interesting. with regards to the d800e, a nikon manager stated in an interview, that for cost reasons in order to have the same register distance for the d800 and d800e, they left the first part of the filter in the d800e. this splits the signal in two. so, instead of splitting it again subsequently (in the other direction) as in the d800, they just recombine the split signals, effectively canceling the first split. i doubt nikon will release the d800e to market unless they convinced themselves of a satisfactorily implementation. thanks also for the pointers to modern or pop. photography reviews. i will see what my local library has. many thanks again. i appreciate your help.", "sortedWord": "None", "Identifyer": null, "identifyer": 91842, "year": "2012"}, {"autor": "Knors", "date": "2012-01-09 08:40:00", "content": "The longest should be the best, prob not much difference between a 50mm at .7m and 90mm at 1m I made the final shot with a 28 mm closest distance 50 mm which did not work at once however when i made a crop of the phone screen part and saved this. it worked perfectly", "link": "https://www.l-camera-forum.com/topic/139872-geotagging-m-cameras-made-easy-gps4cam/?tab=comments#comment-1892736", "origin": "L-forum", "suborigin": "139872-geotagging-m-cameras-made-easy-gps4cam", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "the longest should be the best, prob not much difference between a 50mm at .7m and 90mm at 1m -----> i !!!  -----> made !!!  the final shot with a 28 mm closest distance 50 mm which did not work at once however when -----> i !!!  -----> made !!!  a crop of the phone screen part and saved this. it worked perfectly", "sortedWord": "None", "Identifyer": null, "identifyer": 92635, "year": "2012"}, {"autor": "MPJMP", "date": "2012-08-28 15:39:00", "content": " This is pure fantasy, but I thought I'd throw it out there to see who might have similar ideas and preferences. Awhile back, I came up with an idea of what my perfect Leica digital M camera would be. The concept would be to have a digital M camera with a reduced feature set that more closely replicated the experience of classic film Leica photography. The resulting camera might, in theory, be less expensive to produce than a full fledged M9, thereby constituting a \"budget\" model. The important specs would be: 1) NO rear LCD. Think how revolutionary that would be. One of the \"benefits\" of film photography that is often touted by its proponents is that you are free from the potential distraction that a rear LCD brings. No \"chimping\" your shots. No fiddling with menu settings. You remain in the moment, engaged with your subject. Of course, with enough discipline you can do that with an LCD, but by removing it entirely you remove the temptation to go back and look at your results and instead focus on getting the next perfect shot. Another thing you remove is a major production cost, which results in a lower price point for the consumer. Instead of an LCD, there would be a traditional wheel to set ISO. There would be no other buttons on the rear panel. When you think about it, other than focus, aperture, shutter speed, and ISO the only other essential setting that needs to be made is selecting the capture format: RAW, JPEG, etc. Which leads to... 2) Capture in RAW (DNG) format only. To make the camera as simple and pure as possible, and to ensure only the best quality original files, the camera would only capture in a RAW format such as Adobe's DNG \"digital negative\" format. There is then no need to set things such as white balance, compression, megapixel quality, etc.-- the types of things that you might have spent time fiddling with on the LCD screen. All image tweaking would be done in post-processing. 3) Shutter cocking lever. Got this idea from the Epson RD-1 from years ago. By deleting both the rear LCD and motor for cocking the shutter you would conserve a significant amount of battery power. A single battery charge might last weeks, instead of hours or days. It also replicates an important part of the classic Leica M experience lacking in the M8/9. 4) Hybrid optical viewfinder with electronic framelines. I've been led to believe that one of the biggest costs in producing an M camera is the installation and calibration of the frame lines. Replacing these with elctronic framelines, such as used in the Fuji X series, saves money and provides for potentially more accurate and reliable framing. 5) As for focusing, I don't have any great ideas other than keeping the tried and true optical rangefinder. While it is expensive, there is no better way I am aware of to accurately focus a manual M lens. 6) Return of the M8's top panel LCD for battery status and frame count. With no large rear panel LCD, that would become a necessity. 7) The weather-sealed bottom plate would be removed to reveal the battery compartment, SD card slot, and an industry standard USB connection. What are your thoughts? I have no realistic expectation that such a camera would ever be produced either by Leica or any 3rd party, but I've never heard some of these ideas tossed around before. Edited August 28, 2012 by MPJMP", "link": "https://www.l-camera-forum.com/topic/186660-my-thoughts-for-a-bare-bones-budget-digital-m/?tab=comments#comment-2098118", "origin": "L-forum", "suborigin": "186660-my-thoughts-for-a-bare-bones-budget-digital-m", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " this is pure fantasy, but i thought i'd throw it out there to see who might have similar ideas and preferences. awhile back, i -----> came !!!  -----> up !!!  -----> with !!!  an idea of what my perfect leica digital m camera would be. the concept would be to have a digital m camera with a reduced feature set that more closely replicated the experience of classic film leica photography. the resulting camera might, in theory, be less expensive to produce than a full fledged m9, thereby constituting a \"budget\" model. the important specs would be: 1) no rear lcd. think how revolutionary that would be. one of the \"benefits\" of film photography that is often touted by its proponents is that you are free from the potential distraction that a rear lcd brings. no \"chimping\" your shots. no fiddling with menu settings. you remain in the moment, engaged with your subject. of course, with enough discipline you can do that with an lcd, but by removing it entirely you remove the temptation to go back and look at your results and instead focus on getting the next perfect shot. another thing you remove is a major production cost, which results in a lower price point for the consumer. instead of an lcd, there would be a traditional wheel to set iso. there would be no other buttons on the rear panel. when you think about it, other than focus, aperture, shutter speed, and iso the only other essential setting that needs to be made is selecting the capture format: raw, jpeg, etc. which leads to... 2) capture in raw (dng) format only. to make the camera as simple and pure as possible, and to ensure only the best quality original files, the camera would only capture in a raw format such as adobe's dng \"digital negative\" format. there is then no need to set things such as white balance, compression, megapixel quality, etc.-- the types of things that you might have spent time fiddling with on the lcd screen. all image tweaking would be done in post-processing. 3) shutter cocking lever. got this idea from the epson rd-1 from years ago. by deleting both the rear lcd and motor for cocking the shutter you would conserve a significant amount of battery power. a single battery charge might last weeks, instead of hours or days. it also replicates an important part of the classic leica m experience lacking in the m8/9. 4) hybrid optical viewfinder with electronic framelines. i've been led to believe that one of the biggest costs in producing an m camera is the installation and calibration of the frame lines. replacing these with elctronic framelines, such as used in the fuji x series, saves money and provides for potentially more accurate and reliable framing. 5) as for focusing, i don't have any great ideas other than keeping the tried and true optical rangefinder. while it is expensive, there is no better way i am aware of to accurately focus a manual m lens. 6) return of the m8's top panel lcd for battery status and frame count. with no large rear panel lcd, that would become a necessity. 7) the weather-sealed bottom plate would be removed to reveal the battery compartment, sd card slot, and an industry standard usb connection. what are your thoughts? i have no realistic expectation that such a camera would ever be produced either by leica or any 3rd party, but i've never heard some of these ideas tossed around before. edited august 28, 2012 by mpjmp", "sortedWord": "None", "Identifyer": null, "identifyer": 92970, "year": "2012"}, {"autor": "hamey", "date": "2012-10-01 07:27:00", "content": "It's never going to happen, personally now, I am glad. $$$$$$$$$$$$ wouldn't been worth it. As I am still a predominately FILM (SLIDES) user I still have my R and M lenses for that reason. When it comes down to Digital Photography, I still have an open book, at this time I am using a Canon DSLR, and it's terrific, yes it's a 1.6 crop but to me it's images are very good. Hopefully in two months time my dealer should have the new Canon 6D in stock so I will try it. What I am hoping for is that it's mirror at 97% will clear the 21-35 and 28-90mm rear lens hood. If it does, it will be a lovely Christmas present. As for the Leica M, time will tell, if the EVF works for me I will buy one as I can use both my M and R lenses. But I cannot make up my mind on what Silver or Black.....Lol So forget the R10, It's time to move on, there are much better choices out there. Ken.", "link": "https://www.l-camera-forum.com/topic/188788-leica-r-at-photokina-2014/page/2/?tab=comments#comment-2129603", "origin": "L-forum", "suborigin": "188788-leica-r-at-photokina-2014", "result": true, "Selector": "i cannot make", "selectorShort": "make", "MarkedSent": "it's never going to happen, personally now, i am glad. $$$$$$$$$$$$ wouldn't been worth it. as i am still a predominately film (slides) user i still have my r and m lenses for that reason. when it comes down to digital photography, i still have an open book, at this time i am using a canon dslr, and it's terrific, yes it's a 1.6 crop but to me it's images are very good. hopefully in two months time my dealer should have the new canon 6d in stock so i will try it. what i am hoping for is that it's mirror at 97% will clear the 21-35 and 28-90mm rear lens hood. if it does, it will be a lovely christmas present. as for the leica m, time will tell, if the evf works for me i will buy one as i can use both my m and r lenses. but -----> i !!!  -----> can !!! -----> not !!!  -----> make !!!  up my mind on what silver or black.....lol so forget the r10, it's time to move on, there are much better choices out there. ken.", "sortedWord": "None", "Identifyer": null, "identifyer": 95770, "year": "2012"}, {"autor": "erl", "date": "2012-10-09 23:03:00", "content": "In terms of ergonomics, VF and usability, the R8/9 must be supreme. If only it had been alternatively made as a 'straight' digital instead of the DMR idea, there would be stunning (more compact) digital cams in service now.", "link": "https://www.l-camera-forum.com/topic/188788-leica-r-at-photokina-2014/page/3/?tab=comments#comment-2137583", "origin": "L-forum", "suborigin": "188788-leica-r-at-photokina-2014", "result": true, "Selector": "[idea, made]", "selectorShort": "idea", "MarkedSent": "In terms of ergonomics, VF and usability, the R8/9 must be supreme. If only it had been alternatively made as a 'straight' digital instead of the DMR idea, there would be stunning (more compact) digital cams in service now.", "sortedWord": "None", "Identifyer": null, "identifyer": 95788, "year": "2012"}, {"autor": "jaques", "date": "2012-02-26 04:46:00", "content": "I sold my CVF 16MP CWD Hasselblad back to get the Leica. I have no doubt that the Hasselblad files were superior- skies for instance showed a pure even blue that I don't seem to get from the M9- however the size of the camera meant I really never used it as much as I should have- and the M9 is a much better choice for me. From memory the highest ISO on the CVF is 400... But if you are after quality above all else then the medium format digital backs will deliver, no doubt. As for size: I had the vintage Distagon 40mm lens- I think it weighed 2 kilos or more... But with the 80 planar and WLF the Hasselblad is surprisingly compact. However after I sold the CWD I made sure I grabbed a bargain 501 with 80mm Planar. I hardly ever use it- except for the odd fine art work- and there it never lets me down. Mechanically it has the most wonderful feel- and there is nothing like a bright AccuMatte screen! But for MF street or travel nothing beats a good old Rolleiflex- very easy to carry and ergonomic too. Having only one lens is a real boon! No options to distract- use your feet! The WLF means your subjects often think you are looking at the camera- not at them. And the mechanical feel is a dream.", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/8/?tab=comments#comment-1937612", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i sold my cvf 16mp cwd hasselblad back to get the leica. i have no doubt that the hasselblad files were superior- skies for instance showed a pure even blue that i don't seem to get from the m9- however the size of the camera meant i really never used it as much as i should have- and the m9 is a much better choice for me. from memory the highest iso on the cvf is 400... but if you are after quality above all else then the medium format digital backs will deliver, no doubt. as for size: i had the vintage distagon 40mm lens- i think it weighed 2 kilos or more... but with the 80 planar and wlf the hasselblad is surprisingly compact. however after -----> i !!!  sold the cwd -----> i !!!  -----> made !!!  sure -----> i !!!  grabbed a bargain 501 with 80mm planar. i hardly ever use it- except for the odd fine art work- and there it never lets me down. mechanically it has the most wonderful feel- and there is nothing like a bright accumatte screen! but for mf street or travel nothing beats a good old rolleiflex- very easy to carry and ergonomic too. having only one lens is a real boon! no options to distract- use your feet! the wlf means your subjects often think you are looking at the camera- not at them. and the mechanical feel is a dream.", "sortedWord": "None", "Identifyer": null, "identifyer": 103267, "year": "2012"}, {"autor": "Stealth3kpl", "date": "2012-06-06 20:05:00", "content": "Developing Ilford HP5+ with 200ml ID11 Developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? The results posted certainly look good. Pete", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2033483", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  ilford hp5+ with 200ml id11 developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? the results posted certainly look good. pete", "sortedWord": "None", "Identifyer": null, "identifyer": 107007, "year": "2012"}, {"autor": "janrzm", "date": "2012-06-11 19:59:00", "content": "OK, I've gone and found one on the 'Bay. Now I realise I will have to figure out new agitation schedules for various developers and films. Takes me back to the Gnome bakelite tank belonging to my father that I learned on. Agitation was via a spindle inserted through the central filling funnel; this twisted the film back and forth, as the tank could not be inverted - it wasn't leak proof. If only half the film is immersed, it is obviously important to keep it rotating. Are you finding you have to cut development times much to counteract the continuous agitation? Chris At present I have kept development times the same, I put my first roll of TMAX 100 through a couple of days ago, I agitated continuously in quarter turns. I developed with ID11 at 1:3.", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2037673", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "ok, i've gone and found one on the 'bay. now i realise i will have to figure out new agitation schedules for various developers and films. takes me back to the gnome bakelite tank belonging to my father that i learned on. agitation was via a spindle inserted through the central filling funnel; this twisted the film back and forth, as the tank could not be inverted - it wasn't leak proof. if only half the film is immersed, it is obviously important to keep it rotating. are you finding you have to cut development times much to counteract the continuous agitation? chris at present i have kept development times the same, i put my first roll of tmax 100 through a couple of days ago, i agitated continuously in quarter turns. -----> i !!!  -----> developed !!!  with id11 at 1:3.", "sortedWord": "None", "Identifyer": null, "identifyer": 107010, "year": "2012"}, {"autor": "janrzm", "date": "2012-06-11 20:04:00", "content": "Developing Ilford HP5+ with 200ml ID11 Developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? The results posted certainly look good.Pete Thats a really good question, having been developing for less than a year I still consider myself a novice, however I believe the results were decent without being great (considering camera and lens combo). My recent rolls of HP5+ developed at 1:3 and shot on the M3 with 50 Lux are far superior. Cheers", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2037679", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  ilford hp5+ with 200ml id11 developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? the results posted certainly look good.pete thats a really good question, having been developing for less than a year i still consider myself a novice, however i believe the results were decent without being great (considering camera and lens combo). my recent rolls of hp5+ developed at 1:3 and shot on the m3 with 50 lux are far superior. cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 107012, "year": "2012"}, {"autor": "chrism", "date": "2012-06-12 22:12:00", "content": "My first (!) Rondinax arrived today. Looks fine, but the strap and the clip that draws the film onto the spool is missing. I think a flat rubber tourniquet will replace the strap, but the clip that grabs the film will be harder to replace. Crocodile and bulldog clips are too thick. I may just make a couple of hooks and perforate the leader for them to hook into it. Hopefully, the 35u that is coming will be complete (the photos showed a strap). At least, with a little gentle cannibalisation I should get one working tank between them. Chris Who is more concerned at the absence of firewire on the new MacBooks. My CS9000 and Flextight scanners will not be pleased....", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2038637", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "i may just make", "selectorShort": "make", "MarkedSent": "my first (!) rondinax arrived today. looks fine, but the strap and the clip that draws the film onto the spool is missing. i think a flat rubber tourniquet will replace the strap, but the clip that grabs the film will be harder to replace. crocodile and bulldog clips are too thick. -----> i !!!  -----> may !!!  -----> just !!!  -----> make !!!  a couple of hooks and perforate the leader for them to hook into it. hopefully, the 35u that is coming will be complete (the photos showed a strap). at least, with a little gentle cannibalisation i should get one working tank between them. chris who is more concerned at the absence of firewire on the new macbooks. my cs9000 and flextight scanners will not be pleased....", "sortedWord": "None", "Identifyer": null, "identifyer": 107017, "year": "2012"}, {"autor": "janrzm", "date": "2012-06-13 21:11:00", "content": "My first (!) Rondinax arrived today. Looks fine, but the strap and the clip that draws the film onto the spool is missing. I think a flat rubber tourniquet will replace the strap, but the clip that grabs the film will be harder to replace. Crocodile and bulldog clips are too thick. I may just make a couple of hooks and perforate the leader for them to hook into it. Hopefully, the 35u that is coming will be complete (the photos showed a strap). At least, with a little gentle cannibalisation I should get one working tank between them. Chris Who is more concerned at the absence of firewire on the new MacBooks. My CS9000 and Flextight scanners will not be pleased.... Good luck with this Chris, as you say, with luck you will be able to get at least one working tank. I'd be interested to see your mod if it works as I feel at some point the clip on mine will need to be replaced. Cheers Jason", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2039491", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "i may just make", "selectorShort": "make", "MarkedSent": "my first (!) rondinax arrived today. looks fine, but the strap and the clip that draws the film onto the spool is missing. i think a flat rubber tourniquet will replace the strap, but the clip that grabs the film will be harder to replace. crocodile and bulldog clips are too thick. -----> i !!!  -----> may !!!  -----> just !!!  -----> make !!!  a couple of hooks and perforate the leader for them to hook into it. hopefully, the 35u that is coming will be complete (the photos showed a strap). at least, with a little gentle cannibalisation i should get one working tank between them. chris who is more concerned at the absence of firewire on the new macbooks. my cs9000 and flextight scanners will not be pleased.... good luck with this chris, as you say, with luck you will be able to get at least one working tank. i'd be interested to see your mod if it works as i feel at some point the clip on mine will need to be replaced. cheers jason", "sortedWord": "None", "Identifyer": null, "identifyer": 107018, "year": "2012"}, {"autor": "MPerson", "date": "2012-12-19 11:13:00", "content": "Susie - adding the Sodium Sulphate prevents two problems, staining and/or streaking and prevents the emulsion from swelling too much. I can recommend: \"The Film Developing Cookbook\" (Vol 2), 1999. Stephen G. Anchell and Bill Troop. Focal Press. They cover all the variations of D23 two-bath developers along with a lot of other recipes. I make a lot of my own developers, cheaper and is great fun.", "link": "https://www.l-camera-forum.com/topic/194237-stocklers-2-bath-developer/?tab=comments#comment-2193037", "origin": "L-forum", "suborigin": "194237-stocklers-2-bath-developer", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "susie - adding the sodium sulphate prevents two problems, staining and/or streaking and prevents the emulsion from swelling too much. i can recommend: \"the film developing cookbook\" (vol 2), 1999. stephen g. anchell and bill troop. focal press. they cover all the variations of d23 two-bath developers along with a lot of other recipes. -----> i !!!  -----> make !!!  a lot of my own developers, cheaper and is great fun.", "sortedWord": "None", "Identifyer": null, "identifyer": 107259, "year": "2012"}, {"autor": "traveler_101", "date": "2012-09-01 20:46:00", "content": "So I have decided to learn how to develop BW at home and had a few questions. I was recommended one of those light-tight changing bags. I have looked around a bit and found that they exist in different sizes. What should I consider in choosing a changing bag? As for processing tanks and reels, I've seen several different brands and that some tanks are made of plastic whereas others are metal. Should I go for plastic or metal tanks and reels? Are certain brands better than others? I have seen tanks which allow for two 35 strips and one 120 strip which I thought could be a good one to get since I'm curious about Hasselblad. Good or bad thinking? Thermometers, do I need one of those 20€ electronic ones or can I go with a simpler/cheaper one? I realise temperature accuracy is pretty important. Is it doable - as in not overly complicated and more expensive than lab processing - to develop negative colour at home, and even slide film? I'm just wondering. I realise the learning curve is pretty steep so will begin with BW. I understand developers is a whole universe so I wish to begin as simple as possible. To just bring out what the film - I use Tri-X almost exclusively - is like, what should I use? Is a stop bath necessary? This guy says he just uses water. Sorry for all the newbie questions and thanks for your help Philip Hi Philip, I am not an expert but I was in your shoes just 6 months ago--wondering \"is it doable\" and can I manage? I have tried three film types and two developers. Tri-X in D-76 (well Fomadon P, a D-76 clone) is my favorite. Powdered developers are cheap--keep in mind. Nothing wrong with starting with Tri-X. I didn't buy a changing bag; it is very expensive--that was one reason, and the other was that I don't like the idea of having to work in a confined space. Instead I use a walk in closet which I made light tight. I have a work space in there and that works well. It took some time to set this up--but I am glad I did. If you must use a bag make sure you get a large one as everyone is saying here. I use the Paterson system 4 with the plastic reels. It is easy, especially if you are working with the film on the roll (possible if you leave the leader exposed when you rewind); it gets more complicated when you have to take the film off the roll, but still is very doable. The one weakness with plastic reels is that they don't work well wet. Make sure the reels are dry and I mean bone dry. Buy PATERSON. I was (and am) trying to save money and I read that it is not necessary to use a stop bath, water will do. The instructions I got were to fill the tank four times with water and do 30 seconds of agitation for each fill--or something like that. What a PITA--filling and taking the cap on and off, geez. I tried it once. Afterwards, I bought pure white vinegar at the grocery store (cheap) and make my own stop bath diluting the vinegar with water before I start developing. Works well. A good mercury thermometer gives almost instant readings; helps you when you are trying to get the temperature right.I heard they are illegal in the EU or something like that. I bought mine in New York City and brought it back over here (Norway). I use my own wrist watch for the all important time keeping, after trying the cell phone and the lap top computer--they are just unnecessary complications. I just wait until the second hand reaches 15 seconds before the top of the dial, pour in the developer (takes about 15 seconds) and start timing. Oh, I WRITE DOWN the time on a piece of paper as I start--avoids confusion. Yes, get a photo-flow product for the last step and run the film in and out of it a few times after it has sat in the mixture. Don't use this stuff in your tank because it builds up and ruins your reels. I take the film off the reel and put the photo-flo in a plastic potato salad container! It sits there 5 minutes, I take the film edges between finger and thumb and pull the film out of the container and then let it curl back in. Do it a few times. I have never had problems with spotting or streaking. Last thing: you will save money and you will in all likelihood come to like doing this. It's exciting to see what you have on your roll of film and to realize that you have done it yourself!", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/?tab=comments#comment-2102410", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "so i have decided to learn how to develop bw at home and had a few questions. i was recommended one of those light-tight changing bags. i have looked around a bit and found that they exist in different sizes. what should i consider in choosing a changing bag? as for processing tanks and reels, i've seen several different brands and that some tanks are made of plastic whereas others are metal. should i go for plastic or metal tanks and reels? are certain brands better than others? i have seen tanks which allow for two 35 strips and one 120 strip which i thought could be a good one to get since i'm curious about hasselblad. good or bad thinking? thermometers, do i need one of those 20€ electronic ones or can i go with a simpler/cheaper one? i realise temperature accuracy is pretty important. is it doable - as in not overly complicated and more expensive than lab processing - to develop negative colour at home, and even slide film? i'm just wondering. i realise the learning curve is pretty steep so will begin with bw. i understand developers is a whole universe so i wish to begin as simple as possible. to just bring out what the film - i use tri-x almost exclusively - is like, what should i use? is a stop bath necessary? this guy says he just uses water. sorry for all the newbie questions and thanks for your help philip hi philip, i am not an expert but i was in your shoes just 6 months ago--wondering \"is it doable\" and can i manage? i have tried three film types and two developers. tri-x in d-76 (well fomadon p, a d-76 clone) is my favorite. powdered developers are cheap--keep in mind. nothing wrong with starting with tri-x. i didn't buy a changing bag; it is very expensive--that was one reason, and the other was that i don't like the idea of having to work in a confined space. instead -----> i !!!  use a walk in closet which -----> i !!!  -----> made !!!  light tight. i have a work space in there and that works well. it took some time to set this up--but i am glad i did. if you must use a bag make sure you get a large one as everyone is saying here. i use the paterson system 4 with the plastic reels. it is easy, especially if you are working with the film on the roll (possible if you leave the leader exposed when you rewind); it gets more complicated when you have to take the film off the roll, but still is very doable. the one weakness with plastic reels is that they don't work well wet. make sure the reels are dry and i mean bone dry. buy paterson. i was (and am) trying to save money and i read that it is not necessary to use a stop bath, water will do. the instructions i got were to fill the tank four times with water and do 30 seconds of agitation for each fill--or something like that. what a pita--filling and taking the cap on and off, geez. i tried it once. afterwards, i bought pure white vinegar at the grocery store (cheap) and make my own stop bath diluting the vinegar with water before i start developing. works well. a good mercury thermometer gives almost instant readings; helps you when you are trying to get the temperature right.i heard they are illegal in the eu or something like that. i bought mine in new york city and brought it back over here (norway). i use my own wrist watch for the all important time keeping, after trying the cell phone and the lap top computer--they are just unnecessary complications. i just wait until the second hand reaches 15 seconds before the top of the dial, pour in the developer (takes about 15 seconds) and start timing. oh, i write down the time on a piece of paper as i start--avoids confusion. yes, get a photo-flow product for the last step and run the film in and out of it a few times after it has sat in the mixture. don't use this stuff in your tank because it builds up and ruins your reels. i take the film off the reel and put the photo-flo in a plastic potato salad container! it sits there 5 minutes, i take the film edges between finger and thumb and pull the film out of the container and then let it curl back in. do it a few times. i have never had problems with spotting or streaking. last thing: you will save money and you will in all likelihood come to like doing this. it's exciting to see what you have on your roll of film and to realize that you have done it yourself!", "sortedWord": "None", "Identifyer": null, "identifyer": 107508, "year": "2012"}, {"autor": "MPerson", "date": "2012-01-16 11:51:00", "content": " It is now 9 months since we moved in to the new house and things seem to have settled down. So, time to convert the second garage in to a darkroom. In my 1937 edition of The Leica Handbook there are several plans for darkrooms but I rather like this layout. This is for a 7’x6’ darkroom and I have 25’x12’ to play with! As this will probably be my last darkroom I intend to make it as luxurious as possible. I also hope to use the Hewes stainless steel deep tanks for processing just - waiting for them to get back to me. --img--  I will partition the space so that I have a 12’x12’ darkroom and the other room will function as a study cum digital workstation and have the Macs, scanners, Terastations, printers, bookshelves, kettle and sofa. I have already had the garage door taken out and the space bricked up and a nice big window installed so I can look out over the beach. --img--  Next it is internal framing, insulation, plasterboarding and a wooden floor to make it look habitable. I also need to work out where the extra services like central heating, water supply and electrics need to be delivered to. Just looking forward to being able to empty all the boxes with the darkroom equipment in and set it all up and start producing prints again. I have seriously missed not having a darkroom this last year, although Susie probably sums it up better saying I have been a “grumpy old git” without one! If there is enough interest I will document the project as I progress but the next stage will not start until April time.", "link": "https://www.l-camera-forum.com/topic/170660-darkroom-build/?tab=comments#comment-1899480", "origin": "L-forum", "suborigin": "170660-darkroom-build", "result": true, "Selector": "i intend to make", "selectorShort": "make", "MarkedSent": " it is now 9 months since we moved in to the new house and things seem to have settled down. so, time to convert the second garage in to a darkroom. in my 1937 edition of the leica handbook there are several plans for darkrooms but i rather like this layout. this is for a 7’x6’ darkroom and i have 25’x12’ to play with! as this will probably be my last darkroom -----> i !!!  -----> intend !!!  -----> to !!!  -----> make !!!  it as luxurious as possible. i also hope to use the hewes stainless steel deep tanks for processing just - waiting for them to get back to me. --img--  i will partition the space so that i have a 12’x12’ darkroom and the other room will function as a study cum digital workstation and have the macs, scanners, terastations, printers, bookshelves, kettle and sofa. i have already had the garage door taken out and the space bricked up and a nice big window installed so i can look out over the beach. --img--  next it is internal framing, insulation, plasterboarding and a wooden floor to make it look habitable. i also need to work out where the extra services like central heating, water supply and electrics need to be delivered to. just looking forward to being able to empty all the boxes with the darkroom equipment in and set it all up and start producing prints again. i have seriously missed not having a darkroom this last year, although susie probably sums it up better saying i have been a “grumpy old git” without one! if there is enough interest i will document the project as i progress but the next stage will not start until april time.", "sortedWord": "None", "Identifyer": null, "identifyer": 107563, "year": "2012"}, {"autor": "pico", "date": "2012-07-19 20:59:00", "content": "I may have mentioned this elsewhere: In my experience, the wet side should be a minimum distance from the enlarger. I prefer to have the sink right behind me, as close as as .76 metres (or one metre), or even closer depending upon your build. That was the setup I had for many years, as well as the setup my custom printer had. My current arrangement has the sink farther away, but only until new plumbing and heating can be installed (probably never). A three-leg stool is also helpful. For the floor I have bare concrete and I wear comfortable shoes. I also made a very handy, heavy duty three-point leveling platform that goes over the standard easel for the Omega LF enlarger which otherwise is a real pain to align properly. (I use a 'hall of mirrors' aligning tool.) Wonderful setup you are making. Enjoy! Edited July 19, 2012 by pico", "link": "https://www.l-camera-forum.com/topic/170660-darkroom-build/page/2/?tab=comments#comment-2066769", "origin": "L-forum", "suborigin": "170660-darkroom-build", "result": true, "Selector": "i also made", "selectorShort": "make", "MarkedSent": "i may have mentioned this elsewhere: in my experience, the wet side should be a minimum distance from the enlarger. i prefer to have the sink right behind me, as close as as .76 metres (or one metre), or even closer depending upon your build. that was the setup i had for many years, as well as the setup my custom printer had. my current arrangement has the sink farther away, but only until new plumbing and heating can be installed (probably never). a three-leg stool is also helpful. for the floor i have bare concrete and i wear comfortable shoes. -----> i !!!  -----> also !!!  -----> made !!!  a very handy, heavy duty three-point leveling platform that goes over the standard easel for the omega lf enlarger which otherwise is a real pain to align properly. (i use a 'hall of mirrors' aligning tool.) wonderful setup you are making. enjoy! edited july 19, 2012 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 107587, "year": "2012"}, {"autor": "pico", "date": "2012-08-07 19:58:00", "content": "No sink? No edge on flat surfaces? I have ordered some cream total blackout material for the windows and rear door. This will be fixed via velcro to wooden battens that surround the window. That way I can roll it up out of the way when not required. I hope you don't make the mistake I once made. We had double-paned, two-panel windows (MinneSnowta) and silly me, I placed heavy black plastic over the windows. The setup turned into a solar device and the plastic heated up, sagged, and failed - in the dead of winter! Placing a reflective material on the window side fixed it. Edited August 7, 2012 by pico", "link": "https://www.l-camera-forum.com/topic/170660-darkroom-build/page/2/?tab=comments#comment-2081697", "origin": "L-forum", "suborigin": "170660-darkroom-build", "result": true, "Selector": "i once made", "selectorShort": "make", "MarkedSent": "no sink? no edge on flat surfaces? i have ordered some cream total blackout material for the windows and rear door. this will be fixed via velcro to wooden battens that surround the window. that way i can roll it up out of the way when not required. -----> i !!!  hope you don't make the mistake -----> i !!!  -----> once !!!  -----> made !!! . we had double-paned, two-panel windows (minnesnowta) and silly me, i placed heavy black plastic over the windows. the setup turned into a solar device and the plastic heated up, sagged, and failed - in the dead of winter! placing a reflective material on the window side fixed it. edited august 7, 2012 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 107598, "year": "2012"}, {"autor": "M9reno", "date": "2012-05-08 21:29:00", "content": "If you feel it in your gut that you want a Leica, don't compromise. Do it, and you are 99% likely never to regret it. To cover the 1% risk, there is the well-known resale value of Leica equipment. --img--  Making photography a family experience is a great idea. However, my children aged 4 and 7 don't give a hoot about Leica. (Frankly they're positively annoyed by their father's obsession!) Far more interesting to them is a pinhole camera we built together out of cardboard and a chocolate box. My daughter also enjoys helping out in the darkroom. Otherwise, these are true children of the digital age - chimping on my phone camera for immediate reward is second nature to them. A working film camera is a benign presence in the house. I hope film will slow the kids down, teach them patience, make them more observant and sensitive, as it has gradually been doing to me. Regardless of where technology is heading, such are the intrinsic pleasures of shooting film on a Leica. Film is a beautiful medium, and what a privilege and inspiration it is to handle and use a noble instrument, made yesterday, or 30, or 50, or 80 years ago, but capable regardless of doing perfectly what it was built for. I'm pretty sure there will be film manufacturers for a long time to come, even if only catering to this sort of hedonism! There are many stranger, yet commercially-viable things in this world. Anyway, think about what kind of experience you want, and follow your instincts. Good luck! --img-- ", "link": "https://www.l-camera-forum.com/topic/178922-beginner/?tab=comments#comment-2004952", "origin": "L-forum", "suborigin": "178922-beginner", "result": true, "Selector": "[idea, making]", "selectorShort": "idea", "MarkedSent": "If you feel it in your gut that you want a Leica, don't compromise. Do it, and you are 99% likely never to regret it. To cover the 1% risk, there is the well-known resale value of Leica equipment. --img--  Making photography a family experience is a great idea. However, my children aged 4 and 7 don't give a hoot about Leica. (Frankly they're positively annoyed by their father's obsession!) Far more interesting to them is a pinhole camera we built together out of cardboard and a chocolate box. My daughter also enjoys helping out in the darkroom. Otherwise, these are true children of the digital age - chimping on my phone camera for immediate reward is second nature to them. A working film camera is a benign presence in the house. I hope film will slow the kids down, teach them patience, make them more observant and sensitive, as it has gradually been doing to me. Regardless of where technology is heading, such are the intrinsic pleasures of shooting film on a Leica. Film is a beautiful medium, and what a privilege and inspiration it is to handle and use a noble instrument, made yesterday, or 30, or 50, or 80 years ago, but capable regardless of doing perfectly what it was built for. I'm pretty sure there will be film manufacturers for a long time to come, even if only catering to this sort of hedonism! There are many stranger, yet commercially-viable things in this world. Anyway, think about what kind of experience you want, and follow your instincts. Good luck! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 107768, "year": "2012"}, {"autor": "Merlino69", "date": "2012-09-01 08:07:00", "content": "Hello Leica Forum, Let me introduce myself. I am Italian and joined the forum some time ago. I used a lot the Forum resources to know more about the Leica world. Thank you all for your postings. Forum is really a great resource! About me: Three year ago, coming back from a Paris trip, I sold out my digital C SLR and lenses and I immediately decided to adopt the rangefinder and revert to film. So I bought my first Leica (M6). I was so comfortable in this world that I decided one year ago to buy also a digital M9. Leica Ms and rangefinder are perfect companions for my idea of photography and my personal research in Street Photography. About lenses I mainly use a vintage Cron 35 and I will arrive in the next future to the Lux 35. Hope to contribute in the future to the Forum. Thanks again and have a nice weekend, Stefano", "link": "https://www.l-camera-forum.com/topic/186962-welcome/?tab=comments#comment-2101750", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "hello leica forum, let -----> me !!!  -----> introduce !!!  myself. i am italian and joined the forum some time ago. i used a lot the forum resources to know more about the leica world. thank you all for your postings. forum is really a great resource! about me: three year ago, coming back from a paris trip, i sold out my digital c slr and lenses and i immediately decided to adopt the rangefinder and revert to film. so i bought my first leica (m6). i was so comfortable in this world that i decided one year ago to buy also a digital m9. leica ms and rangefinder are perfect companions for my idea of photography and my personal research in street photography. about lenses i mainly use a vintage cron 35 and i will arrive in the next future to the lux 35. hope to contribute in the future to the forum. thanks again and have a nice weekend, stefano", "sortedWord": "None", "Identifyer": null, "identifyer": 113755, "year": "2012"}, {"autor": "sblitz", "date": "2012-12-11 17:18:00", "content": "I will try to make it ..... being this is a Brooklyn/Williamsburg event to start, are we required to bring film cameras only? :-)", "link": "https://www.l-camera-forum.com/topic/193712-nyc-meet-up/?tab=comments#comment-2187437", "origin": "L-forum", "suborigin": "193712-nyc-meet-up", "result": true, "Selector": "i will try to make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> will !!!  -----> try !!!  -----> to !!!  -----> make !!!  it ..... being this is a brooklyn/williamsburg event to start, are we required to bring film cameras only? :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 136672, "year": "2012"}, {"autor": "iedei", "date": "2012-12-11 20:12:00", "content": "I will try to make it ..... being this is a Brooklyn/Williamsburg event to start, are we required to bring film cameras only? :-) lol! i was planning on bringing my M5! mainly because i figured nobody else would have one! --img--  is that very Williamsburg of me?", "link": "https://www.l-camera-forum.com/topic/193712-nyc-meet-up/?tab=comments#comment-2187555", "origin": "L-forum", "suborigin": "193712-nyc-meet-up", "result": true, "Selector": "i will try to make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> will !!!  -----> try !!!  -----> to !!!  -----> make !!!  it ..... being this is a brooklyn/williamsburg event to start, are we required to bring film cameras only? :-) lol! i was planning on bringing my m5! mainly because i figured nobody else would have one! --img--  is that very williamsburg of me?", "sortedWord": "None", "Identifyer": null, "identifyer": 136674, "year": "2012"}, {"autor": "WmAl", "date": "2012-12-14 22:54:00", "content": "Sorry. I can not make it on Saturday. I am shooting up in Harlem in the afternoon. --img-- ", "link": "https://www.l-camera-forum.com/topic/193712-nyc-meet-up/?tab=comments#comment-2189727", "origin": "L-forum", "suborigin": "193712-nyc-meet-up", "result": true, "Selector": "i can not make", "selectorShort": "make", "MarkedSent": "sorry. -----> i !!!  -----> can !!!  -----> not !!!  -----> make !!!  it on saturday. i am shooting up in harlem in the afternoon. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136677, "year": "2012"}, {"autor": "macfiend", "date": "2012-12-19 00:16:00", "content": "Originally posted by WeinschelA Unfortunately, I didn't see this until today. I'll have a more frequent look in the future as I am interested in such meets. If someone has a NYC list pls put me on it. Thanks. I think we were going to try and put another one together after the holidays. I'll make sure to let you know once we have a date set. Regards, John", "link": "https://www.l-camera-forum.com/topic/193712-nyc-meet-up/page/2/?tab=comments#comment-2192801", "origin": "L-forum", "suborigin": "193712-nyc-meet-up", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "originally posted by weinschela unfortunately, i didn't see this until today. i'll have a more frequent look in the future as i am interested in such meets. if someone has a nyc list pls put me on it. thanks. i think we were going to try and put another one together after the holidays. -----> i !!! -----> 'll !!!  -----> make !!!  sure to let you know once we have a date set. regards, john", "sortedWord": "None", "Identifyer": null, "identifyer": 136687, "year": "2012"}, {"autor": "jaapv", "date": "2012-09-18 15:42:00", "content": "Btw: Just Leica M.? I would make that a bit more welcoming to the owners of other types...--img-- ", "link": "https://www.l-camera-forum.com/topic/187118-leica-m-meet-in-the-netherlands/?tab=comments#comment-2117126", "origin": "L-forum", "suborigin": "187118-leica-m-meet-in-the-netherlands", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "btw: just leica m.? -----> i !!!  -----> would !!!  -----> make !!!  that a bit more welcoming to the owners of other types...--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136772, "year": "2012"}, {"autor": "RvN", "date": "2012-11-26 11:36:00", "content": "Looks like you were having fun guys. Sorry i couldn't make it. Maybe next time. Roel", "link": "https://www.l-camera-forum.com/topic/187118-leica-m-meet-in-the-netherlands/page/6/?tab=comments#comment-2175297", "origin": "L-forum", "suborigin": "187118-leica-m-meet-in-the-netherlands", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "looks like you were having fun guys. sorry -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it. maybe next time. roel", "sortedWord": "None", "Identifyer": null, "identifyer": 136873, "year": "2012"}, {"autor": "earleygallery", "date": "2012-12-31 10:36:00", "content": "Sorry I couldn't make it also. I have a rotten cold at the moment as well as having had to cover the office today meant that time was against me.", "link": "https://www.l-camera-forum.com/topic/193303-bristol-dec-30th/page/2/?tab=comments#comment-2201970", "origin": "L-forum", "suborigin": "193303-bristol-dec-30th", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "sorry -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it also. i have a rotten cold at the moment as well as having had to cover the office today meant that time was against me.", "sortedWord": "None", "Identifyer": null, "identifyer": 136905, "year": "2012"}, {"autor": "farnz", "date": "2012-12-04 02:29:00", "content": "Jon, A lovely idea but I doubt that I'll be able to join you because it's not possible to reach Poole from London by 10.00 am by train on a Sunday without incurring a 9 hour journey that starts at about midnight and includes a 4 hour stop-over in Southampton in the wee, small hours.--img--  The first train arrives in Poole at 10.33 so a rendezvous point somewhere around The Quay at, say, 11.00 would make it possible or alternatively if we could exchange contact mobile phone numbers by private message here I could catch you up perhaps? Pete.", "link": "https://www.l-camera-forum.com/topic/193386-9th-december-2012-photo-walk-with-leica-poole-dorset-uk/?tab=comments#comment-2181296", "origin": "L-forum", "suborigin": "193386-9th-december-2012-photo-walk-with-leica-poole-dorset-uk", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Jon, A lovely idea but I doubt that I'll be able to join you because it's not possible to reach Poole from London by 10.00 am by train on a Sunday without incurring a 9 hour journey that starts at about midnight and includes a 4 hour stop-over in Southampton in the wee, small hours.--img--  The first train arrives in Poole at 10.33 so a rendezvous point somewhere around The Quay at, say, 11.00 would make it possible or alternatively if we could exchange contact mobile phone numbers by private message here I could catch you up perhaps? Pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 136945, "year": "2012"}, {"autor": "bill", "date": "2012-01-12 13:23:00", "content": "I started with Booking,com, then had all the multiple pop-ups that accompany the Tripadvisor \"experience\" - Expedia, Hotels.com, etc. Same hotel, same room, standard double with free wireless internet and breakfast varied last night from £310 (Expedia) to £268 (Venere). 3 of them came up with £294. Cancel up to 6pm on day of arrival, pay locally on departure. Bargain. It's the Richmond Hotel, if you are interested. p.s. Just run the self same search again and all the prices are different today, unsurprisingly... --img--  Regards, Bill", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/5/?tab=comments#comment-1895936", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i started with booking,com, then had all the multiple pop-ups that accompany the tripadvisor \"experience\" - expedia, hotels.com, etc. same hotel, same room, standard double with free wireless internet and breakfast varied last night from £310 (expedia) to £268 (venere). 3 of them -----> came !!!  -----> up !!!  -----> with !!!  £294. cancel -----> up !!!  to 6pm on day of arrival, pay locally on departure. bargain. it's the richmond hotel, if you are interested. p.s. just run the self same search again and all the prices are different today, unsurprisingly... --img--  regards, bill", "sortedWord": "None", "Identifyer": null, "identifyer": 137058, "year": "2012"}, {"autor": "erl", "date": "2012-01-20 03:36:00", "content": "It seems the hotels and the restaurants are filling faster than ever before! At this rate, I may not make it this year, but who knows? Also, I am probably financing my younger daughter's trip to Paris so it only gets tougher. Any decision will not be made until September for me. --img-- ", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/6/?tab=comments#comment-1903105", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "i may not make", "selectorShort": "make", "MarkedSent": "it seems the hotels and the restaurants are filling faster than ever before! at this rate, -----> i !!!  -----> may !!!  -----> not !!!  -----> make !!!  it this year, but who knows? also, i am probably financing my younger daughter's trip to paris so it only gets tougher. any decision will not be made until september for me. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137087, "year": "2012"}, {"autor": "earleygallery", "date": "2012-01-23 16:30:00", "content": "I've missed the last two challenges, so I promised myself I'd make this one!", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/7/?tab=comments#comment-1906612", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": "-----> i !!! 've missed the last two challenges, so -----> i !!!  promised myself -----> i !!! -----> 'd !!!  -----> make !!!  this one!", "sortedWord": "None", "Identifyer": null, "identifyer": 137110, "year": "2012"}, {"autor": "dennersten", "date": "2012-08-14 07:18:00", "content": "I am very sorry, i need to go to a 50 year party. That evening, so i am giving up my place at the dinner. It would have been so great to meet you all finally. I hope i can make it next year.", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/8/?tab=comments#comment-2085890", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "i am very sorry, i need to go to a 50 year party. that evening, so i am giving up my place at the dinner. it would have been so great to meet you all finally. -----> i !!!  hope -----> i !!!  -----> can !!!  -----> make !!!  it next year.", "sortedWord": "None", "Identifyer": null, "identifyer": 137122, "year": "2012"}, {"autor": "earleygallery", "date": "2012-10-04 08:43:00", "content": "I arrive on Friday but think I will try to make the most of Kulturnatten to see some of the sights (and hopefully find some interesting spots to return to during the challenge --img-- ).", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/12/?tab=comments#comment-2132459", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "i will try to make", "selectorShort": "make", "MarkedSent": "-----> i !!!  arrive on friday but think -----> i !!!  -----> will !!!  -----> try !!!  -----> to !!!  -----> make !!!  the most of kulturnatten -----> to !!!  see some of the sights (and hopefully find some interesting spots -----> to !!!  return -----> to !!!  during the challenge --img-- ).", "sortedWord": "None", "Identifyer": null, "identifyer": 137205, "year": "2012"}, {"autor": "lanetomlane", "date": "2012-10-04 17:49:00", "content": "Robert and I will be travelling together and in Copenhagen from Thursday to Tuesday so a meet up on Thursday and Friday nights would be great. Pete. Great Pete, we only land at 18:00 on Thursday evening so I guess that night will be out for us. Be great to meet up Friday night though. Erik (see a couple of posts above) said he would look for somewhere and so I suggest we wait to see what he comes up with and then decide on a time. _____________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/12/?tab=comments#comment-2132921", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "robert and i will be travelling together and in copenhagen from thursday to tuesday so a meet up on thursday and friday nights would be great. pete. great pete, we only land at 18:00 on thursday evening so i guess that night will be out for us. be great to meet up friday night though. erik (see a couple of posts above) said he would look for somewhere and so i suggest we wait to see what he -----> comes !!!  -----> up !!!  -----> with !!!  and then decide on a time. _____________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 137208, "year": "2012"}, {"autor": "spylaw4", "date": "2012-10-04 18:07:00", "content": "<snip> Be great to meet up Friday night though. Erik (see a couple of posts above) said he would look for somewhere and so I suggest we wait to see what he comes up with and then decide on a time._____________ Cheers, Tom +1", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/12/?tab=comments#comment-2132940", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "<snip> be great to meet up friday night though. erik (see a couple of posts above) said he would look for somewhere and so i suggest we wait to see what he -----> comes !!!  -----> up !!!  -----> with !!!  and then decide on a time._____________ cheers, tom +1", "sortedWord": "None", "Identifyer": null, "identifyer": 137209, "year": "2012"}, {"autor": "ejd", "date": "2012-09-03 22:09:00", "content": "I've made a note of the date and time, and v much hope to join you on the 29th. All the best, John", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/?tab=comments#comment-2104197", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "-----> i !!! 've -----> made !!!  a note of the date and time, and v much hope to join you on the 29th. all the best, john", "sortedWord": "None", "Identifyer": null, "identifyer": 137224, "year": "2012"}, {"autor": "Michael-IIIf", "date": "2012-09-04 13:56:00", "content": " I've made a note of the date and time, and v much hope to join you on the 29th. All the best, John Ditto - I'll try to be there as well --img-- ", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/?tab=comments#comment-2104723", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": " -----> i !!! 've -----> made !!!  a note of the date and time, and v much hope to join you on the 29th. all the best, john ditto - i'll try to be there as well --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137225, "year": "2012"}, {"autor": "Edward77", "date": "2012-09-16 17:26:00", "content": "If I am in the UK then I will certainly make an effort to come over for this.", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/?tab=comments#comment-2114463", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i will certainly make", "selectorShort": "make", "MarkedSent": "if -----> i !!!  am in the uk then -----> i !!!  -----> will !!!  -----> certainly !!!  -----> make !!!  an effort to come over for this.", "sortedWord": "None", "Identifyer": null, "identifyer": 137228, "year": "2012"}, {"autor": "gyoung", "date": "2012-09-19 15:16:00", "content": "I shall be in London on the 29th, I should be able to make it to Red Dot for 12.00 although I have a committee meeting in the afternoon for another of my interests, so regrettably wont be able to join you on the afternoon 'expedition'. It will be the first time I've made it to a forum meeting I think, so I'd better wear a name badge (or just an M3?) --img--  Gerry", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/?tab=comments#comment-2118476", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "i shall be in london on the 29th, i should be able to make it to red dot for 12.00 although i have a committee meeting in the afternoon for another of my interests, so regrettably wont be able to join you on the afternoon 'expedition'. it will be the first time -----> i !!! 've -----> made !!!  it to a forum meeting -----> i !!!  think, so -----> i !!! 'd better wear a name badge (or just an m3?) --img--  gerry", "sortedWord": "None", "Identifyer": null, "identifyer": 137232, "year": "2012"}, {"autor": "euston", "date": "2012-09-25 06:36:00", "content": "I hope to make it.", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/?tab=comments#comment-2124297", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i hope to make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> hope !!!  -----> to !!!  -----> make !!!  it.", "sortedWord": "None", "Identifyer": null, "identifyer": 137238, "year": "2012"}, {"autor": "Nick De Marco", "date": "2012-09-28 13:07:00", "content": "Sadly Ripon and I can't make it We have to organise a work related garden party in my new house in Hackney - so will be making fresh pasta etc all day Hope you all have a good time and post some pics - and hope to catch up with you all next time - and some of you in CPH Nick", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/page/2/?tab=comments#comment-2127377", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "sadly ripon and -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it we have to organise a work related garden party in my new house in hackney - so will be making fresh pasta etc all day hope you all have a good time and post some pics - and hope to catch up with you all next time - and some of you in cph nick", "sortedWord": "None", "Identifyer": null, "identifyer": 137246, "year": "2012"}, {"autor": "viramati", "date": "2012-10-03 01:11:00", "content": "Some great shots and so sorry I couldn't make it", "link": "https://www.l-camera-forum.com/topic/186741-the-clerkenwell-london-welcome-back-george-james-meet-up/page/3/?tab=comments#comment-2131378", "origin": "L-forum", "suborigin": "186741-the-clerkenwell-london-welcome-back-george-james-meet-up", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "some great shots and so sorry -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it", "sortedWord": "None", "Identifyer": null, "identifyer": 137261, "year": "2012"}, {"autor": "wlaidlaw", "date": "2012-10-10 07:35:00", "content": " Tom Wood is having a retrospective exhibition of his 40 years in photography called \"Tom Wood, Men and Women\" at The Photographers Gallery, 16 – 18 Ramillies Street, London W1F 7LW. I think he is one of the UK's best living exponents of people/street photograph and I shall certainly make an effort to go. Dates from 12 October, 2012 to 6 Jan, 2013. Wilson", "link": "https://www.l-camera-forum.com/topic/189812-tom-wood-exhibition-in-london/?tab=comments#comment-2137783", "origin": "L-forum", "suborigin": "189812-tom-wood-exhibition-in-london", "result": true, "Selector": "i shall certainly make", "selectorShort": "make", "MarkedSent": " tom wood is having a retrospective exhibition of his 40 years in photography called \"tom wood, men and women\" at the photographers gallery, 16 – 18 ramillies street, london w1f 7lw. i think he is one of the uk's best living exponents of people/street photograph and -----> i !!!  -----> shall !!!  -----> certainly !!!  -----> make !!!  an effort to go. dates from 12 october, 2012 to 6 jan, 2013. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 137266, "year": "2012"}, {"autor": "philipus", "date": "2012-09-17 08:59:00", "content": "We are all going to hang around in Hall 1, cussing --img--  I am presently at St Pancras, waiting for the jobs-worth to open the gate to let me through security. It does NOT pay to get here too early. Might have to go to champagne bar to pass the time... Enjoy the train ride and the champagne --img--  ) It is now confirmed that I will only be able to attend on Saturday, but I will make it for the Q&A session, however. Edited September 17, 2012 by philipus", "link": "https://www.l-camera-forum.com/topic/180061-photokina/page/2/?tab=comments#comment-2114936", "origin": "L-forum", "suborigin": "180061-photokina", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "we are all going to hang around in hall 1, cussing --img--  i am presently at st pancras, waiting for the jobs-worth to open the gate to let me through security. it does not pay to get here too early. might have to go to champagne bar to pass the time... enjoy the train ride and the champagne --img--  ) it is now confirmed that -----> i !!!  -----> will !!!  only be able to attend on saturday, but -----> i !!!  -----> will !!!  -----> make !!!  it for the q&a session, however. edited september 17, 2012 by philipus", "sortedWord": "None", "Identifyer": null, "identifyer": 137328, "year": "2012"}, {"autor": "gravastar", "date": "2012-07-19 22:10:00", "content": "I'll try to make this one. I look forward to meeting up with everyone at the start even if I don't get to walk everywhere later. --img--  Bob.", "link": "https://www.l-camera-forum.com/topic/183348-london-meet/?tab=comments#comment-2066832", "origin": "L-forum", "suborigin": "183348-london-meet", "result": true, "Selector": "i'll try to make", "selectorShort": "make", "MarkedSent": "-----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> make !!!  this one. i look forward to meeting up with everyone at the start even if i don't get to walk everywhere later. --img--  bob.", "sortedWord": "None", "Identifyer": null, "identifyer": 137374, "year": "2012"}, {"autor": "Gibbo", "date": "2012-01-31 16:06:00", "content": " I was wondering if anyone in the Bristol area would like to join up for a meet in April this year? I had in mind either Saturday the 21st or the 28th. Hopefully the weather will be with us and I was going to suggest that we meet up in Queen Square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. We can use this thread to come up with ideas between now and then. Please respond here if you are interested --img-- ", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/?tab=comments#comment-1914178", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i was wondering if anyone in the bristol area would like to join up for a meet in april this year? i had in mind either saturday the 21st or the 28th. hopefully the weather will be with us and i was going to suggest that we meet up in queen square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. we can use this thread to -----> come !!!  -----> up !!!  -----> with !!!  ideas between now and then. please respond here if you are interested --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137394, "year": "2012"}, {"autor": "farnz", "date": "2012-01-31 19:19:00", "content": "I'm not in the Brizle area but count me in please! Given the choice I'd prefer 28th but I can probably make 21st work if needed.--img--  Pete.", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/?tab=comments#comment-1914371", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i can probably make", "selectorShort": "make", "MarkedSent": "i'm not in the brizle area but count me in please! given the choice i'd prefer 28th but -----> i !!!  -----> can !!!  -----> probably !!!  -----> make !!!  21st work if needed.--img--  pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137398, "year": "2012"}, {"autor": "mikebidwell", "date": "2012-02-01 17:48:00", "content": "I was wondering if anyone in the Bristol area would like to join up for a meet in Aprilthis year? I had in mind either Saturday the 21st or the 28th. Hopefully the weather will be with us and I was going to suggest that we meet up in Queen Square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. We can use this thread to come up with ideas between now and then. Please respond here if you are interested --img--  Silly question but does it have to be a Saturday ???? Why not a Sunday, If my memory serves me right then I thought the Trenchard Street Car Park (behind the Colston Hall) did a charge of £1.60 all day on Sundays. And its very handy for the Centre, Queens Square, M Shed(well worth a visit) and the Harbourside. Just a thought Best wishes Mike Bidwell PS Just checked out the Bristol Whats On for W/E 28th April and so far nothing has shown up so it should be too manic in town. PPS Seems as though Trenchard Street does all day on Saturday for £2.60 but I'm sure it will be busy Edited February 1, 2012 by mikebidwell Add more info", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/?tab=comments#comment-1915188", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i was wondering if anyone in the bristol area would like to join up for a meet in aprilthis year? i had in mind either saturday the 21st or the 28th. hopefully the weather will be with us and i was going to suggest that we meet up in queen square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. we can use this thread to -----> come !!!  -----> up !!!  -----> with !!!  ideas between now and then. please respond here if you are interested --img--  silly question but does it have to be a saturday ???? why not a sunday, if my memory serves me right then i thought the trenchard street car park (behind the colston hall) did a charge of £1.60 all day on sundays. and its very handy for the centre, queens square, m shed(well worth a visit) and the harbourside. just a thought best wishes mike bidwell ps just checked out the bristol whats on for w/e 28th april and so far nothing has shown up so it should be too manic in town. pps seems as though trenchard street does all day on saturday for £2.60 but i'm sure it will be busy edited february 1, 2012 by mikebidwell add more info", "sortedWord": "None", "Identifyer": null, "identifyer": 137410, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-03 17:44:00", "content": " Oki doki, this is lookin' good --img--  I shall do some research over the next few weeks and come up with relative parking costs etc etc. Also, if you need me, I shall be trying out pubs --img--  Not that I need to, just feel like it --img-- ", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1916970", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " oki doki, this is lookin' good --img--  i shall do some research over the next few weeks and -----> come !!!  -----> up !!!  -----> with !!!  relative parking costs etc etc. also, if you need me, i shall be trying out pubs --img--  not that i need to, just feel like it --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137414, "year": "2012"}, {"autor": "farnz", "date": "2012-02-18 17:48:00", "content": "The train takes about 1.40 from London so I can make it by 11.00 but others who are travelling from further afield and who have to catch a train into London first might prefer a slightly later start. Am I right in thinking that I should plan my train journey to Bristol Temple Meads station rather than Bristol Parkway or Bristol Airport? Pete.", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1930613", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "the train takes about 1.40 from london so -----> i !!!  -----> can !!!  -----> make !!!  it by 11.00 but others who are travelling from further afield and who have to catch a train into london first might prefer a slightly later start. am i right in thinking that i should plan my train journey to bristol temple meads station rather than bristol parkway or bristol airport? pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 137417, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-18 17:49:00", "content": "PM sent --img--  Just a thought, if anyone has a special dietary requirement, please let me know so that I can make sure the venue can cater for you. I have also discovered that on that day there is the Bristol Italian Auto Moto Festival, a gathering of more than 200 Italian cars in St Nicholas Market. I've been to it before and it is well worth a look!", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1930615", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "pm sent --img--  just a thought, if anyone has a special dietary requirement, please let me know so that -----> i !!!  -----> can !!!  -----> make !!!  sure the venue -----> can !!!  cater for you. i have also discovered that on that day there is the bristol italian auto moto festival, a gathering of more than 200 italian cars in st nicholas market. i've been to it before and it is well worth a look!", "sortedWord": "None", "Identifyer": null, "identifyer": 137418, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-18 17:51:00", "content": "The train takes about 1.40 from London so I can make it by 11.00 but others who are travelling from further afield and who have to catch a train into London first might prefer a slightly later start. Am I right in thinking that I should plan my train journey to Bristol Temple Meads station rather than Bristol Parkway or Bristol Airport? Pete. Yes Pete, Temple Meads is the one to aim for --img-- ", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1930619", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "the train takes about 1.40 from london so -----> i !!!  -----> can !!!  -----> make !!!  it by 11.00 but others who are travelling from further afield and who have to catch a train into london first might prefer a slightly later start. am i right in thinking that i should plan my train journey to bristol temple meads station rather than bristol parkway or bristol airport? pete. yes pete, temple meads is the one to aim for --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137419, "year": "2012"}, {"autor": "Bill Allsopp", "date": "2012-02-20 07:12:00", "content": "If I make it I shall drive, depends a bit upon other commitments so cannot plan for certain yet.", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1931961", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "if -----> i !!!  -----> make !!!  it -----> i !!!  shall drive, depends a bit upon other commitments so cannot plan for certain yet.", "sortedWord": "None", "Identifyer": null, "identifyer": 137422, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-21 20:25:00", "content": "Well, here's a thought. There is a car park at the Mud Dock on The Grove which is marked 'A' on this map: http://maps.google.co.uk/maps?hl=en&cp=17&gs_id=1u&xhr=t&q=the+grove+bristol&gs_upl=&bav=on.2,or.r_gc.r_pw.r_qf.,cf.osb&biw=1139&bih=628&wrapid=tljp1329856345656032&um=1&ie=UTF-8&ei=nv9DT5iTLcOn0AWStomPDw&sa=X&oi=mode_link&ct=mode&cd=3&sqi=2&ved=0CA0Q_AUoAg It's within spitting distance of the Arnolfini --img--  I'll see if I can come up with some suggestions for lunch venues around there too! I certainly know of at least three good coffee shops near there. Edited February 21, 2012 by Gibbo", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1933635", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, here's a thought. there is a car park at the mud dock on the grove which is marked 'a' on this map: http://maps.google.co.uk/maps?hl=en&cp=17&gs_id=1u&xhr=t&q=the+grove+bristol&gs_upl=&bav=on.2,or.r_gc.r_pw.r_qf.,cf.osb&biw=1139&bih=628&wrapid=tljp1329856345656032&um=1&ie=utf-8&ei=nv9dt5itlcon0awstompdw&sa=x&oi=mode_link&ct=mode&cd=3&sqi=2&ved=0ca0q_auoag it's within spitting distance of the arnolfini --img--  i'll see if i can -----> come !!!  -----> up !!!  -----> with !!!  some suggestions for lunch venues around there too! i certainly know of at least three good coffee shops near there. edited february 21, 2012 by gibbo", "sortedWord": "None", "Identifyer": null, "identifyer": 137430, "year": "2012"}, {"autor": "mikebidwell", "date": "2012-02-21 21:15:00", "content": "Well, here's a thought. There is a car park at the Mud Dock on The Grove whichis marked 'A' on this map: the grove bristol - Google Maps It's within spitting distance of the Arnolfini --img--  I'll see if I can come up with some suggestions for lunch venues around there too! I certainly know of at least three good coffee shops near there. Excellent area to meet near the Arnolfini David, a good suggestion. its central to see some of 'Old Bristol' or there are plenty of places to sit and chat around Millenium Square or M Shed. It has all the makings of a good meet. I'm looking forward to be able to put faces to names. Well done Best wishes Mike --img--  PS not sure about the Grove Car Park, just checked it out and it say payment is by mobile phone :-( Haven't come across that before !! Edited February 21, 2012 by mikebidwell", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1933694", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, here's a thought. there is a car park at the mud dock on the grove whichis marked 'a' on this map: the grove bristol - google maps it's within spitting distance of the arnolfini --img--  i'll see if i can -----> come !!!  -----> up !!!  -----> with !!!  some suggestions for lunch venues around there too! i certainly know of at least three good coffee shops near there. excellent area to meet near the arnolfini david, a good suggestion. its central to see some of 'old bristol' or there are plenty of places to sit and chat around millenium square or m shed. it has all the makings of a good meet. i'm looking forward to be able to put faces to names. well done best wishes mike --img--  ps not sure about the grove car park, just checked it out and it say payment is by mobile phone :-( haven't come across that before !! edited february 21, 2012 by mikebidwell", "sortedWord": "None", "Identifyer": null, "identifyer": 137432, "year": "2012"}, {"autor": "mburnham", "date": "2012-04-12 21:00:00", "content": "Sorry Guys, Found out that I nearly double booked.....thank goodness I can rely upon my social secretary although she dislikes it!!!! Rotary Club dinner that night, so I/we can't make it, but will be up for the next one...London, Bristol, Manchester..... wherever Regards Mike", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/3/?tab=comments#comment-1981583", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "we can't make", "selectorShort": "make", "MarkedSent": "sorry guys, found out that i nearly double booked.....thank goodness i can rely upon my social secretary although she dislikes it!!!! rotary club dinner that night, so i/-----> we !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it, but will be up for the next one...london, bristol, manchester..... wherever regards mike", "sortedWord": "None", "Identifyer": null, "identifyer": 137451, "year": "2012"}, {"autor": "Adarsha", "date": "2012-04-25 20:04:00", "content": "I simply wish I could afford to be there... suffering from student poverty... bah humbug --img--  Now if it were in Swansea I could make it! --img--  But... there'll be another time hey... hey ... Enjoy it, and show us the photographs afterwards.", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/4/?tab=comments#comment-1993650", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "i simply wish i could afford to be there... suffering from student poverty... bah humbug --img--  now if it were in swansea -----> i !!!  -----> could !!!  -----> make !!!  it! --img--  but... there'll be another time hey... hey ... enjoy it, and show us the photographs afterwards.", "sortedWord": "None", "Identifyer": null, "identifyer": 137458, "year": "2012"}, {"autor": "viramati", "date": "2012-04-30 21:42:00", "content": "Looks like you had a good day sorry I couldn't make it", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/6/?tab=comments#comment-1997727", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "looks like you had a good day sorry -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it", "sortedWord": "None", "Identifyer": null, "identifyer": 137497, "year": "2012"}, {"autor": "roydonian", "date": "2012-03-22 22:27:00", "content": "You are correct - I made an error when writing the date. Best regards, Doug", "link": "https://www.l-camera-forum.com/topic/157626-london-exhibition-shaped-by-war-photographs-by-don-mccullin/?tab=comments#comment-1961601", "origin": "L-forum", "suborigin": "157626-london-exhibition-shaped-by-war-photographs-by-don-mccullin", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "you are correct - -----> i !!!  -----> made !!!  an error when writing the date. best regards, doug", "sortedWord": "None", "Identifyer": null, "identifyer": 137549, "year": "2012"}, {"autor": "Dan Bachmann", "date": "2012-01-23 10:53:00", "content": " If anyone is interested in Cartier-Bresson's work, you are welcome to join me for a gallery visit in Paris. On the 8th of March 2012, I'm catching the 0831 Eurostar train to Paris to visit a museum/gallery of interest to many Leica owners, Fondation Henri Cartier-Bresson. If you are looking for an excuse to go, as of this moment, you can get a day return ticket for £59 on that day and even Wednesday (the museum is free on Wednesday nights). Fondation Henri Cartier-Bresson Henri Cartier-Bresson/Paul Strand / Mexique 1932-1934 / 11 janvier – 22 avril 2012 If the weather/light is stunning on the 8th, I'd probably rather walk around as I will make a visit to the F-HCB on the 9th just as well unless there was a planned meeting.", "link": "https://www.l-camera-forum.com/topic/171160-paris-visit-fondation-hcb-thursday-8-march-2012/?tab=comments#comment-1906364", "origin": "L-forum", "suborigin": "171160-paris-visit-fondation-hcb-thursday-8-march-2012", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": " if anyone is interested in cartier-bresson's work, you are welcome to join me for a gallery visit in paris. on the 8th of march 2012, i'm catching the 0831 eurostar train to paris to visit a museum/gallery of interest to many leica owners, fondation henri cartier-bresson. if you are looking for an excuse to go, as of this moment, you can get a day return ticket for £59 on that day and even wednesday (the museum is free on wednesday nights). fondation henri cartier-bresson henri cartier-bresson/paul strand / mexique 1932-1934 / 11 janvier – 22 avril 2012 if the weather/light is stunning on the 8th, -----> i !!! 'd probably rather walk around as -----> i !!!  -----> will !!!  -----> make !!!  a visit to the f-hcb on the 9th just as well unless there was a planned meeting.", "sortedWord": "None", "Identifyer": null, "identifyer": 137606, "year": "2012"}, {"autor": "like_it", "date": "2012-10-15 10:26:00", "content": " Hi and thanks for your replies, I've tried a new battery now but still it wasn't working properly. I also found the old motorwinder from my dad so I tried it and now it's working fine with it. But actually I don't want to use my R5 with a big Batterypack. I guess the motor is strong enough to release the shutter (mirror magnet)... After a few shots with the motorwinder, the R5 is now working fine - also without it. I don't konw how long this will last, probably I have to clean it. The CS is quite pricy and I'm a student.... --img--  @Thorsten I already did some repairs on my iPhone, isn't the same but I already made some experience in \"some sort of fine mechanics\" but I don't wanna destroy it. Do you have any kind of an instruction manual or can you send me a more detailed instruction? I'd really appreciate it cheers", "link": "https://www.l-camera-forum.com/topic/189923-leica-r-5-shutter-problems/?tab=comments#comment-2141869", "origin": "L-forum", "suborigin": "189923-leica-r-5-shutter-problems", "result": false, "Selector": "i already made", "selectorShort": "make", "MarkedSent": " @thorsten i already did some -----> repairs !!!  on my iphone, isn't the same but i already made some experience in \"some sort of fine mechanics\" but i don't wanna destroy it.", "sortedWord": "repair", "Identifyer": null, "identifyer": 21973, "year": "2012"}, {"autor": "Guest gamincurieux", "date": "2012-09-03 12:55:00", "content": "It's in my kitchen - living alone, there's nobody to annoy with this. That said, I still have to prepare food in here on rare occasions, so it can all be easily & hygienically converted kitchen<=>darkroom as needed. I no longer develop film, this is printing only (used to have a brilliant film drying cabinet though, regret selling it;). The upside-down trays there are on a 16x20inch 3-tray ladder (excellent space-saving thing from Leedal of Chicago, http://www.leedal.com), when set up each tray down sits further out from the one above so you just slip the paper from one down into the next below. I don't actually sit the trays on that side bench there when full of chems, I have a fold-up table set up in the middle of the room there for that - the side bench I prefer to keep clean for paper/negs. The 'enlarger bench' is covered with a sheet of plastic tucked in 'round the edges when not in use - especially important as in fine to hot weather I often have both the front & back door (see it to the right there) open for a thru-breeze, and the air can be quite dusty in these parts, you've got to keep things well covered up. The enlarger has its own cover. There's a thick double-layered black woolen 'theatre' drape there over the entry to the hall going up inside the house, had it made special by a company that does make them for theatres/cinemas, and the back door has foam around the edges that blocks light when closed. The windows have specially made (a company here in Australia that makes them for shift workers in hot bright places, http://www.bedroomblackout.com) fabric-covered foam panels that fit right into the window spaces, same for the windows in the bathroom which adjoins the kitchen off to the left there. I have moved a lot, have had a pretty similar set-up wherever I've been, obviously have to have things like the window panels re-done, which can cost a bit when you add it all up time after time, but who's counting, you do it because you love printing! Now, I might not shoot much film anymore, and really I don't print very often at all, but I say that as long as I possess negatives I want to have a darkroom in which to print them - for me that's non-negotiable. Mm, well, I hope this is of interest, or helps someone who might be thinking of making a darkroom at home. I would just say forget making a darkroom in the bathroom/toilet.... the kitchen is the way to go, it's made for cooking, which is so much like printing --img-- --img--  Edited September 3, 2012 by gamincurieux", "link": "https://www.l-camera-forum.com/topic/186432-show-us-your-darkroom/?tab=comments#comment-2103681", "origin": "L-forum", "suborigin": "186432-show-us-your-darkroom", "result": false, "Selector": "i no longer develop", "selectorShort": "develop", "MarkedSent": "i no longer develop -----> film !!! , this is printing only (used to have a brilliant -----> film !!!  drying cabinet though, regret selling it;).", "sortedWord": "film", "Identifyer": null, "identifyer": 104647, "year": "2012"}, {"autor": "250swb", "date": "2012-12-10 08:26:00", "content": "It is also of note that Agfa themselves only recommended using Rodinal at 1:25 and 1:50 dilutions. Original charts and tables here: Using RODINAL If photographers use it at 1:100 or higher dilutions, they are of course free to do so and use whatever film rating they need - but they are \"outside the envelope\" and in uncharted territory in terms of what the creators of Rodinal had in mind. The thread is about stand development and I think you have gone off track somewhat in quoting 'official' sites and sources for standard film development at normal dilutions. It doesn't really add anything to the discussion about stand development. As you dispute the lessons learned by other people in the use of higher dilutions (as well as normal dilutions), and you have opined on the theory of processing with various developers (but without offering a single practical view of your own) I just don't see your point other than in your grinding negativity towards stand development. It sounds as if you think it is the work of the devil. A case in point, you say more than once that Rodinal doesn't reduce film speed, and that a longer time or more agitation should be used etc. This is very easy to understand up to a point, but makes no sense when the whole idea of stand development is not to agitate the film in the developer. I could go on with other instances of you not 'getting it', but life is too short. I do trust you have your own practical experiences of using stand development (not from a manufacturers chart or pure theory), so let's hear those. Steve Edited December 10, 2012 by 250swb", "link": "https://www.l-camera-forum.com/topic/192945-stand-development/?tab=comments#comment-2186321", "origin": "L-forum", "suborigin": "192945-stand-development", "result": false, "Selector": "[idea, makes]", "selectorShort": "idea", "MarkedSent": "this is very easy to understand up to a point, but makes no sense when the whole idea of stand development is not to agitate the -----> film !!!  in the developer.", "sortedWord": "film", "Identifyer": null, "identifyer": 105580, "year": "2012"}, {"autor": "chrism", "date": "2012-08-04 14:50:00", "content": " I finally got to use the 35u today (I got a second one with film clip and strap intact). Tri-X @ 400, in Rodinal/Blazinol 1:50 for 13 minutes, then stop, fix and wash. The film is drying right now, but the negs look as if they will be just right. I'm not claiming any great artistic content, but I'll scan the likely looking ones this evening and see if there's any worth posting up as examples of output. It is likely to cause a repetitive strain injury after about a half hour total of twiddling the knob! Here's one answer to that problem: DIY - RONDINAX 35U Motorized with Meccano - YouTube I've been practising loading the Jobo daylight loading tank I mentioned above, and it's pretty tricky to get the film started. So far I've just done dry runs with a sacrificial long-outdated film. I'll have to load a canister with a short strip from the bulk loader and see if I can make it work for real... Chris", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/page/2/?tab=comments#comment-2079198", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here's one answer to that problem: diy - rondinax 35u motorized with meccano - youtube i've been practising loading the jobo daylight loading tank i mentioned above, and it's pretty tricky to get the -----> film !!!  started.", "sortedWord": "film", "Identifyer": null, "identifyer": 107020, "year": "2012"}, {"autor": "janrzm", "date": "2012-08-05 06:00:00", "content": "I finally got to use the 35u today (I got a second one with film clip and strap intact). Tri-X @ 400, in Rodinal/Blazinol 1:50 for 13 minutes, then stop, fix and wash. The film is drying right now, but the negs look as if they will be just right. I'm not claiming any great artistic content, but I'll scan the likely looking ones this evening and see if there's any worth posting up as examples of output. It is likely to cause a repetitive strain injury after about a half hour total of twiddling the knob! Here's one answer to that problem:DIY - RONDINAX 35U Motorized with Meccano - YouTube I've been practising loading the Jobo daylight loading tank I mentioned above, and it's pretty tricky to get the film started. So far I've just done dry runs with a sacrificial long-outdated film. I'll have to load a canister with a short strip from the bulk loader and see if I can make it work for real... Chris Hey Chris. Awesome. Yes, I've seen the link before, I thought I'd mentioned it in my post somewhere but maybe I forgot....I have looked in to it and plan to try something similar when I get a spare minute. Incidentally I also have the Rondinax 60 which I intend to use now I've just bought myself a Hasselblad.....Ooops. All the best, Jason", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/page/2/?tab=comments#comment-2079574", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here's one answer to that problem:diy - rondinax 35u motorized with meccano - youtube i've been practising loading the jobo daylight loading tank i mentioned above, and it's pretty tricky to get the -----> film !!!  started.", "sortedWord": "film", "Identifyer": null, "identifyer": 107022, "year": "2012"}, {"autor": "uaqpau", "date": "2012-08-29 23:25:00", "content": "Have you seen this post by forum member \"prosophos\"? I've started developing my own b&w film at home just 2 months ago.. and Im following exactly those steps with great results. Have a look: http://www.l-camera-forum.com/leica-forum/film-forum/241700-how-i-process-my-b-w.html thanks again peter --img-- ", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/?tab=comments#comment-2099647", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": false, "Selector": "i've started developing", "selectorShort": "develop", "MarkedSent": "i've started developing my own b&w -----> film !!!  at home just 2 months ago.. and im following exactly those steps with great results.", "sortedWord": "film", "Identifyer": null, "identifyer": 107501, "year": "2012"}, {"autor": "Prosophos", "date": "2012-08-30 03:13:00", "content": "Have you seen this post by forum member \"prosophos\"? I've started developing my own b&w film at home just 2 months ago.. and Im following exactly those steps with great results. Have a look: http://www.l-camera-forum.com/leica-forum/film-forum/241700-how-i-process-my-b-w.html thanks again peter --img--  You're welcome, Pau. Incidentally, I've placed all the related articles onto one page on my website: How I process B&W film Regards, Peter. P r o s o p h o s", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/?tab=comments#comment-2099729", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": false, "Selector": "i've started developing", "selectorShort": "develop", "MarkedSent": "i've started developing my own b&w -----> film !!!  at home just 2 months ago.. and im following exactly those steps with great results.", "sortedWord": "film", "Identifyer": null, "identifyer": 107502, "year": "2012"}, {"autor": "Keith (M)", "date": "2012-10-31 11:31:00", "content": " Well, I hope so. Developing a roll of 36exp Acros 100 in my Paterson System 4 tank (bought new earlier this year), as I poured the stop-bath out, the tank's funnel/light trap somehow 'unlocked' and came away from the tank. Panic. It took me a couple of seconds to relocate it and then pour the fixer in. Gloom and doom - thoughts of fogged frames / ruined images of my latest foray to France and Spain. --img--  Having finished fixing and washing, I tentatively pulled the film of the reel and hung it in the shower - phew, there are images! --img--  Have only quickly glanced at them but could not see any immediate signs of fogging. Will have to wait for it to dry now.", "link": "https://www.l-camera-forum.com/topic/191267-a-very-narrow-squeak/?tab=comments#comment-2155012", "origin": "L-forum", "suborigin": "191267-a-very-narrow-squeak", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing a -----> roll !!!  of 36exp acros 100 in my paterson system 4 tank (bought new earlier this year), as i poured the stop-bath out, the tank's funnel/light trap somehow 'unlocked' and came away from the tank.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107633, "year": "2012"}, {"autor": "Guest Ming Rider", "date": "2012-06-27 13:33:00", "content": " Hi All, I posted this link in another part of LUF to a video I made, but thought it might help anyone here who'd like to develop film but worry it's too complicated or has mysterious 'black magic' attached to it? MODERATOR - Possible Sticky ? Edited June 27, 2012 by Ming Rider", "link": "https://www.l-camera-forum.com/topic/182617-like-the-idea-of-developing-film-but-think-its-too-complicated/?tab=comments#comment-2050061", "origin": "L-forum", "suborigin": "182617-like-the-idea-of-developing-film-but-think-its-too-complicated", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": " hi all, i posted this link in another part of luf to a -----> video !!!  i made, but thought it might help anyone here who'd like to develop film but worry it's too complicated or has mysterious 'black magic' attached to it?", "sortedWord": "video", "Identifyer": null, "identifyer": 107641, "year": "2012"}, {"autor": "tobey bilek", "date": "2012-07-02 11:54:00", "content": "Developing film is easy. Developing film well is harder. Well includes clean drying ,filtered water, good chemical storage, proper agitation, matching contrast to paper/subject. It is like the difference between driving the family sedan and being a formula one driver. Then you have to learn not to use the massive development chart and not to listen to all the weird schemes people have invented and to quit trying the millions of combinations of film/developers. Buy a scale, some chemicals, some glass bottles, mix up some D76 and start learning. d76 will do a decent job on any film out there except the current generation of Delta 400 which requires Xtol or that undated white bottle of expensive stuff Ilford sells, forgetting the name for now. There is a marked improvement with either. You can get any look you want by diluting D76 from stock to 1:3. Start with 1:1.", "link": "https://www.l-camera-forum.com/topic/182617-like-the-idea-of-developing-film-but-think-its-too-complicated/?tab=comments#comment-2053560", "origin": "L-forum", "suborigin": "182617-like-the-idea-of-developing-film-but-think-its-too-complicated", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  is easy.", "sortedWord": "film", "Identifyer": null, "identifyer": 107648, "year": "2012"}, {"autor": "Wail", "date": "2012-07-03 08:03:00", "content": "Hi All, I posted this link in another part of LUF to a video I made, but thought it might help anyone here who'd like to develop film but worry it's too complicated or has mysterious 'black magic' attached to it? MODERATOR - Possible Sticky ? Thank you for the link --img--  ]<snip>[/b] \"Digital Photography is like shaved legs on a man - very smooth and clean but there is something acutely disconcerting about it.\" <snip> While I enjoy both, I think this does sum things up rather well; I hope you don't mind that I use this myself --img-- ", "link": "https://www.l-camera-forum.com/topic/182617-like-the-idea-of-developing-film-but-think-its-too-complicated/?tab=comments#comment-2054237", "origin": "L-forum", "suborigin": "182617-like-the-idea-of-developing-film-but-think-its-too-complicated", "result": false, "Selector": "i made", "selectorShort": "make", "MarkedSent": "hi all, i posted this link in another part of luf to a -----> video !!!  i made, but thought it might help anyone here who'd like to develop film but worry it's too complicated or has mysterious 'black magic' attached to it?", "sortedWord": "video", "Identifyer": null, "identifyer": 107652, "year": "2012"}, {"autor": "Messsucherkamera", "date": "2012-05-19 03:53:00", "content": "@ Axot - First off, welcome to the forum! If you want to start humbly (and economically, by Leica standards) you will find many Leica M camera bodies and lenses that can be purchased for around $1000-1500US for the body and $500-1000US for the lens. You just have to shop around, there are reasonably priced Leicas out there. If that isn't financially doable, you could find a nice FM2n or F3hp to use with your Nikon lenses for a song. I have seen good user F3hp bodies (rated at 8 to 8+) for sale at $275-300US. Regarding film availability, I would expect C41 and E6 film choices to dwindle over the years while B&W film choices will remain more or less stable - Kodak 's current terminal illness notwithstanding. I would expect there to be some sort of B&W film to be available for the foreseeable future. As for 25-50 years down the road, who knows? Film (along with paper and chemical) prices will continue to creep upward over the years, but so will the prices of everything else. Bulk loading is a way to save perhaps 20-25% on your film costs. Developing your own film is a big cost cutter for B&W film - B&W costs around $0.40 to $0.50US per roll to develop at home. Developing is actually an enjoyable activity (IMO). Developing film beats sitting for hours at a keyboard diddling with Photoshop. Again, JMHO. Edited May 19, 2012 by Messsucherkamera", "link": "https://www.l-camera-forum.com/topic/178922-beginner/?tab=comments#comment-2017585", "origin": "L-forum", "suborigin": "178922-beginner", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing your own -----> film !!!  is a big cost cutter for b&w -----> film !!!  - b&w costs around $0.40 to $0.50us per roll to develop at home.", "sortedWord": "film", "Identifyer": null, "identifyer": 107775, "year": "2012"}], "name": "Leicasortedout2012"}