{"interestingcomments": [{"autor": "sean_reid", "date": "2007-07-13 22:13:00", "content": "Sean, I (and i'm sure lots of others) are looking forward to your review. I had a brief demo with it a week or so ago and it seemed to be a nice step up. Don't make the review too good though, I have only just spent my money on an M8 --img--  Oh, and all within one calendar year of being introduced to RF's, buying an R-D1 and too much glass! Hi Gareth, I try to never make them positive or negative. I just try to describe the thing itself as well as I can. Sometimes that's expensive for the reader and sometimes it saves him or her money. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/?tab=comments#comment-305279", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "i try to never make", "selectorShort": "make", "MarkedSent": "sean, i (and i'm sure lots of others) are looking forward to your review. i had a brief demo with it a week or so ago and it seemed to be a nice step up. don't make the review too good though, i have only just spent my money on an m8 --img--  oh, and all within one calendar year of being introduced to rf's, buying an r-d1 and too much glass! hi gareth, -----> i !!!  -----> try !!!  -----> to !!!  -----> never !!!  -----> make !!!  them positive or negative. i just try to describe the thing itself as well as i can. sometimes that's expensive for the reader and sometimes it saves him or her money. cheers, sean", "sortedWord": "None", "Identifyer": null, "identifyer": 40940, "year": "2007"}, {"autor": "hankg", "date": "2007-07-14 16:25:00", "content": "Above all else, functionality, simplicity and speed are the Leica tradition. I agree 100%, yours is a conservatism based on function, unfortunately many Leica users conservatism is based on form. The idea that a camera should be an heirloom that can be passed down to your grandchildren like a Swiss watch, which has nothing to do with what made the camera a great tool for taking pictures. However with the success of the M8, the landscape is shifting, as Leica starts to look more like a viable maker of photographic tools - hopefully the Hermes lux brand mentality can now be consigned to the trash can. Back in the 70's I stuck with my M4 because of the size issue. By the 90's the only 35mm camera I owned was the little Ricoh with the fixed 28. If I was going to take something along that wouldn't fit in my pocket it might as well be medium format (Plaubel 670). The Ricoh seemed to me to embody the spirit of 35mm, tiny, fast and unobtrusive. I suppose the GRD has much the same appeal.", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/2/?tab=comments#comment-305760", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "[idea, made]", "selectorShort": "idea", "MarkedSent": "Above all else, functionality, simplicity and speed are the Leica tradition. I agree 100%, yours is a conservatism based on function, unfortunately many Leica users conservatism is based on form. The idea that a camera should be an heirloom that can be passed down to your grandchildren like a Swiss watch, which has nothing to do with what made the camera a great tool for taking pictures. However with the success of the M8, the landscape is shifting, as Leica starts to look more like a viable maker of photographic tools - hopefully the Hermes lux brand mentality can now be consigned to the trash can. Back in the 70's I stuck with my M4 because of the size issue. By the 90's the only 35mm camera I owned was the little Ricoh with the fixed 28. If I was going to take something along that wouldn't fit in my pocket it might as well be medium format (Plaubel 670). The Ricoh seemed to me to embody the spirit of 35mm, tiny, fast and unobtrusive. I suppose the GRD has much the same appeal.", "sortedWord": "None", "Identifyer": null, "identifyer": 40964, "year": "2007"}, {"autor": "Guest Walt", "date": "2007-07-29 04:42:00", "content": " Sam- My original post was about what Leica might have learned from the thoughtful design of this camera but didn't. Most operational features of the GR-D are superior to those on the M8, one being the all-important shutter release. We actually have some suggestions on the current firmware update controversy suggesting that people are getting misexposures because they're pushing the release too quickly and should learn to slow down. Let's not even talk about the inconsistently rough feel of the M8 release. I would also add that the GR-D has none of the software operational bugs of the M8 and that, when Ricoh did make firmware updates, they quickly made the addition of several features requested by photographers. I think I am correct that Leica has not yet implemented a single \"laundry list\" request from this forum. On image quality, the GR-D at ISO 200-400 is very much in the ball park with scanned 35mm Tri-X. That's my standard, and I'm not interested in the M8's ability to \"do medium format.\" All the film Leicas were point and shoot cameras, that's what they were known for and good at, and that's what I want from the M8 too. When I originally made the post, some, including Sean Reid, felt I was suggesting that the M8 shouldn't be used for \"medium format\" style work. That wasn't my point at all. It was that if the M8 was going to sacrifice the alacrity of the film M's to accomplish this new capability, then it was simply not an \"M\" for me. I like the files enough and I am familiar enough with Leicas that I use the M8. But it is only marginally an M camera in the traditional sense. It just looks like one. Walt Walt Odets Photography Home", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/3/?tab=comments#comment-315787", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "i originally made", "selectorShort": "make", "MarkedSent": " sam- my original post was about what leica might have learned from the thoughtful design of this camera but didn't. most operational features of the gr-d are superior to those on the m8, one being the all-important shutter release. we actually have some suggestions on the current firmware update controversy suggesting that people are getting misexposures because they're pushing the release too quickly and should learn to slow down. let's not even talk about the inconsistently rough feel of the m8 release. i would also add that the gr-d has none of the software operational bugs of the m8 and that, when ricoh did make firmware updates, they quickly made the addition of several features requested by photographers. i think i am correct that leica has not yet implemented a single \"laundry list\" request from this forum. on image quality, the gr-d at iso 200-400 is very much in the ball park with scanned 35mm tri-x. that's my standard, and i'm not interested in the m8's ability to \"do medium format.\" all the film leicas were point and shoot cameras, that's what they were known for and good at, and that's what i want from the m8 too. when -----> i !!!  -----> originally !!!  -----> made !!!  the post, some, including sean reid, felt -----> i !!!  was suggesting that the m8 shouldn't be used for \"medium format\" style work. that wasn't my point at all. it was that if the m8 was going to sacrifice the alacrity of the film m's to accomplish this new capability, then it was simply not an \"m\" for me. i like the files enough and i am familiar enough with leicas that i use the m8. but it is only marginally an m camera in the traditional sense. it just looks like one. walt walt odets photography home", "sortedWord": "None", "Identifyer": null, "identifyer": 40981, "year": "2007"}, {"autor": "Guest Walt", "date": "2007-07-31 01:30:00", "content": "Charles, Scott, Hank and Sam-- Your posts have been suddenly and inexplicably clarifying for me. I am belatedly realizing that I have been simply expecting the M8 to be a digital M4/Tri-X camera. It is simply not that, nor apparently is it inteded to be--it is, I guess, intended as a rangefinder substitute for a Canon DSLR. That kind of capability doesn't interest me at all and it seems to be an objective that is compromising the M8 as a \"street camera.\" Compared to an M4 with a little, old-style 35 Summicron, the M8 is a clunker in my experience. I mentioned all this in a previous post about \"What is the M8 For,\" where I questioned the metering pattern of the camera, but I haven't put it all together--the forum interest in color, 3/4 pound lenses, ISO 160, back focus, pushing the shutter release slowly so the camera has time to meter, etc. So, perhaps Ricoh will come out with a raw buffer and rescue me. Or perhaps Leica will decide to make a digital Leica, in the old sense of the idea. Really, I've been confused about this camera. Walt", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/3/?tab=comments#comment-317111", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Charles, Scott, Hank and Sam-- Your posts have been suddenly and inexplicably clarifying for me. I am belatedly realizing that I have been simply expecting the M8 to be a digital M4/Tri-X camera. It is simply not that, nor apparently is it inteded to be--it is, I guess, intended as a rangefinder substitute for a Canon DSLR. That kind of capability doesn't interest me at all and it seems to be an objective that is compromising the M8 as a \"street camera.\" Compared to an M4 with a little, old-style 35 Summicron, the M8 is a clunker in my experience. I mentioned all this in a previous post about \"What is the M8 For,\" where I questioned the metering pattern of the camera, but I haven't put it all together--the forum interest in color, 3/4 pound lenses, ISO 160, back focus, pushing the shutter release slowly so the camera has time to meter, etc. So, perhaps Ricoh will come out with a raw buffer and rescue me. Or perhaps Leica will decide to make a digital Leica, in the old sense of the idea. Really, I've been confused about this camera. Walt", "sortedWord": "None", "Identifyer": null, "identifyer": 40993, "year": "2007"}, {"autor": "Guest Walt", "date": "2007-07-31 16:49:00", "content": "Mitch, Hank and Charles- You're all describing what I should have caught onto quite a while ago. It is not only the image character, but the handling of the camera that makes the GR-D more like \"a Leica\" than the M8 is. The GR-D is most reminiscent of the IIIF or IIIG and with the VC finders in the hotshoe it has an excellent and accurate image, much better than any of the Leicas. What I would like from the GR-D (which I am limiting to ISO 400 for noise) is an F 2.0 lens, which is, of course, what I am used to from the old Leicas (Tri-X/Summicrons), though this is not a big deal. Mostly I would like a buffer that allows shooting RAW once a second or so. Beyond that, a 35mm-equivalent lens version of the camera would also be nice. Carrying one camera per focal length would be a lot easier than carrying an extra M-8 lens. I wouldn't need anything else. For the moment, I'm banking on Ricoh coming up with a camera that meets these kinds of needs. I'm awaiting Sean's review of the GX-100 but I already know that it has no RAW buffer. JPEGS give me the creeps, though the Ricoh BW JPEGS are surprisingly good, better than I can accomplish converting color JPEGS. Ricoh should use even less compression on them. From my experience, I don't see the advantages of the M8 for medium format work over a DSLR, excepting the weight. And even there, a camera like the Canon Rebel seems a better choice to me--about the same size, much lighter, very refined, much more accurate finder, much more reliable I'd guess. I love the image character of the M8, but are the Canons really incapable of that? Perhaps, but the Nikons? I find them very \"filmic,\" very M8 like. But I don't do this kind of work and really just don't understand the values and why someone would want an M8 for this. I also wonder if Leica really knows what this kind of work is about--the color/IR stuff in the M8 would suggest that they didn't. On the reliability issues that Thomas raises, I don't do paragliding, I walk to restaurants. And I can't say that the M8 has been a paragon of reliability. I've had five M8's and one GR-D and the one GR-D works more reliably than the five M8s put together. And look at it this way: For what I've spent on two M8 bodies and a few lenses, I could buy 30 GR-Ds, which would be a very reliable approach. I also understand that Ricoh service is really responsive and good. (Perhaps the biggest weakness of the M8 at this point is the service organization behind it.) Oh well, enough talk about cameras--they are really irritating. I've never had the camera I used make or break a photograph, though cameras like the M8 can certainly get in the way. Everytime I turn an M8 on, I look at the frame counter to see if it's actually still working. I think the recent forum post about not pushing the shutter release too fast because it abuses the camera really knocked me over the edge. Walt", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/4/?tab=comments#comment-317532", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "mitch, hank and charles- you're all describing what i should have caught onto quite a while ago. it is not only the image character, but the handling of the camera that makes the gr-d more like \"a leica\" than the m8 is. the gr-d is most reminiscent of the iiif or iiig and with the vc finders in the hotshoe it has an excellent and accurate image, much better than any of the leicas. what i would like from the gr-d (which i am limiting to iso 400 for noise) is an f 2.0 lens, which is, of course, what i am used to from the old leicas (tri-x/summicrons), though this is not a big deal. mostly i would like a buffer that allows shooting raw once a second or so. beyond that, a 35mm-equivalent lens version of the camera would also be nice. carrying one camera per focal length would be a lot easier than carrying an extra m-8 lens. i wouldn't need anything else. for the moment, i'm banking on ricoh -----> coming !!!  -----> up !!!  -----> with !!!  a camera that meets these kinds of needs. i'm awaiting sean's review of the gx-100 but i already know that it has no raw buffer. jpegs give me the creeps, though the ricoh bw jpegs are surprisingly good, better than i can accomplish converting color jpegs. ricoh should use even less compression on them. from my experience, i don't see the advantages of the m8 for medium format work over a dslr, excepting the weight. and even there, a camera like the canon rebel seems a better choice to me--about the same size, much lighter, very refined, much more accurate finder, much more reliable i'd guess. i love the image character of the m8, but are the canons really incapable of that? perhaps, but the nikons? i find them very \"filmic,\" very m8 like. but i don't do this kind of work and really just don't understand the values and why someone would want an m8 for this. i also wonder if leica really knows what this kind of work is about--the color/ir stuff in the m8 would suggest that they didn't. on the reliability issues that thomas raises, i don't do paragliding, i walk to restaurants. and i can't say that the m8 has been a paragon of reliability. i've had five m8's and one gr-d and the one gr-d works more reliably than the five m8s put together. and look at it this way: for what i've spent on two m8 bodies and a few lenses, i could buy 30 gr-ds, which would be a very reliable approach. i also understand that ricoh service is really responsive and good. (perhaps the biggest weakness of the m8 at this point is the service organization behind it.) oh well, enough talk about cameras--they are really irritating. i've never had the camera i used make or break a photograph, though cameras like the m8 can certainly get in the way. everytime i turn an m8 on, i look at the frame counter to see if it's actually still working. i think the recent forum post about not pushing the shutter release too fast because it abuses the camera really knocked me over the edge. walt", "sortedWord": "None", "Identifyer": null, "identifyer": 40998, "year": "2007"}, {"autor": "marknorton", "date": "2007-08-13 10:26:00", "content": " We're grateful to you for your efforts, Carsten, shows clearly just how off the framing is and you wonder who came up with the idea to get it right at closest focus only to have it way off at infinity.", "link": "https://www.l-camera-forum.com/topic/30845-frameline-accuracy-comparison/page/3/?tab=comments#comment-328297", "origin": "L-forum", "suborigin": "30845-frameline-accuracy-comparison", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " we're grateful to you for your efforts, carsten, shows clearly just how off the framing is and you wonder who -----> came !!!  -----> up !!!  -----> with !!!  the idea to get it right at closest focus only to have it way off at infinity.", "sortedWord": "None", "Identifyer": null, "identifyer": 41452, "year": "2007"}, {"autor": "photoarne", "date": "2007-08-13 21:20:00", "content": "Thank you for the tests Carsten, no big surprises, your M8 is about as bad as mine when it comes to framing accuracy... FWIW I've made a somewhat similar test using the 25 mm Zeiss Biogon to see how the 24 mm framelines fit. First at 3,8 m with the framelines in the viewfinder crossing in the middle of the Post-it notes, as indicated with the thin line. As can be seen, even at this relatively close distance and with a slightly longer focal length, the M8 still crops the image. Yet this is my most precise lens/frameline match by a good margin. --img-- ", "link": "https://www.l-camera-forum.com/topic/30845-frameline-accuracy-comparison/page/3/?tab=comments#comment-328904", "origin": "L-forum", "suborigin": "30845-frameline-accuracy-comparison", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "thank you for the tests carsten, no big surprises, your m8 is about as bad as mine when it comes to framing accuracy... fwiw -----> i !!! 've -----> made !!!  a somewhat similar test using the 25 mm zeiss biogon to see how the 24 mm framelines fit. first at 3,8 m with the framelines in the viewfinder crossing in the middle of the post-it notes, as indicated with the thin line. as can be seen, even at this relatively close distance and with a slightly longer focal length, the m8 still crops the image. yet this is my most precise lens/frameline match by a good margin. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 41455, "year": "2007"}, {"autor": "jaapv", "date": "2007-08-25 23:51:00", "content": "Afaik the VisoII should clear the M8, with the screw fully screwed in. The only possible hassle (on the III) might be that the tripping screw is the short version. It is either find the lengthening screw in that case or a minor diy solution. The main problem of the Viso II is that it lacks the quick return mirror. A decent Visoflex III should set you back about 100 to 150 $; a single prism finder probably not much less. The Visoflex II - prices are all over the place, some shops will give them away free or for 10$, sometimes they go for fancy prices on e-bay. I would put them at 75-125$. They most interesting use of any Visosflex is for macro, where the straight finder is a handy accessory,but it does switch left and right.. The 200, although it has its advocates and is a nice lens, is, imo, too far behind the 135/4.0 to be of real interest. The 280 is more interesting, if only because of its focal length.", "link": "https://www.l-camera-forum.com/topic/31884-visoflex-question/?tab=comments#comment-338114", "origin": "L-forum", "suborigin": "31884-visoflex-question", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "afaik the visoii should clear the m8, with the screw fully screwed in. the only possible hassle (on the iii) might be that the tripping screw is the short version. it is either find the lengthening screw in that case or a minor -----> diy !!!  solution. the main problem of the viso ii is that it lacks the quick return mirror. a decent visoflex iii should set you back about 100 to 150 $; a single prism finder probably not much less. the visoflex ii - prices are all over the place, some shops will give them away free or for 10$, sometimes they go for fancy prices on e-bay. i would put them at 75-125$. they most interesting use of any visosflex is for macro, where the straight finder is a handy accessory,but it does switch left and right.. the 200, although it has its advocates and is a nice lens, is, imo, too far behind the 135/4.0 to be of real interest. the 280 is more interesting, if only because of its focal length.", "sortedWord": "None", "Identifyer": null, "identifyer": 43624, "year": "2007"}, {"autor": "Shootist", "date": "2007-11-18 23:27:00", "content": "With all due respect, you don't need to be a physicist and highly educated to read a S/N. All it takes is to be more than 6 or 7 years old. If you LOOK AT what I wrote as to how many numbers are inbetween your serial # and mine I said/wrote 9000±. Which means I left off the XXX of both of our serial numbers. And the point I was trying to make was that the serial numbers are NO record of how many units have been made or the date of manufacture. Boy are you touchy. Oh I wasn't inferring you read it wrong. What made you think that? You may need to go back a few months and start reading posts from then. This topic has been covered extensively. Leica does NOT use consectutive serial numbers and they do not produce products one serial number after the other. Serial number are allotted in blocks and then whatever that block of number are they take one hot shoe with a serial # on it and put it on a camera. The next time they take a hot shoe to build a camera it could be of a lower or high number then the one they build yesterday or 2 weeks ago.", "link": "https://www.l-camera-forum.com/topic/38339-earliest-serial-number/page/2/?tab=comments#comment-406230", "origin": "L-forum", "suborigin": "38339-earliest-serial-number", "result": true, "Selector": "i was trying to make", "selectorShort": "make", "MarkedSent": "with all due respect, you don't need to be a physicist and highly educated to read a s/n. all it takes is to be more than 6 or 7 years old. if you look at what i wrote as to how many numbers are inbetween your serial # and mine i said/wrote 9000±. which means i left off the xxx of both of our serial numbers. and the point -----> i !!!  -----> was !!!  -----> trying !!!  -----> to !!!  -----> make !!!  -----> was !!!  that the serial numbers are no record of how many units have been made or the date of manufacture. boy are you touchy. oh i wasn't inferring you read it wrong. what made you think that? you may need to go back a few months and start reading posts from then. this topic has been covered extensively. leica does not use consectutive serial numbers and they do not produce products one serial number after the other. serial number are allotted in blocks and then whatever that block of number are they take one hot shoe with a serial # on it and put it on a camera. the next time they take a hot shoe to build a camera it could be of a lower or high number then the one they build yesterday or 2 weeks ago.", "sortedWord": "None", "Identifyer": null, "identifyer": 44553, "year": "2007"}, {"autor": "IMast", "date": "2007-11-22 11:43:00", "content": "My first 310122x came out of the first batch(11/06). And my second, puchased this month is 310195x. I'm sure that more than 700 were sold in almost a year. g. This numbering gets even more wierd. My black body M8 is just over 2 months old and was only in stock at the dealer 1 week before I bought it and its serial is 3198xxx. Is the batch numbering system used to get us making more posts?--img-- ", "link": "https://www.l-camera-forum.com/topic/38339-earliest-serial-number/page/4/?tab=comments#comment-408882", "origin": "L-forum", "suborigin": "38339-earliest-serial-number", "result": true, "Selector": "us making", "selectorShort": "make", "MarkedSent": "my first 310122x came out of the first batch(11/06). and my second, puchased this month is 310195x. i'm sure that more than 700 were sold in almost a year. g. this numbering gets even more wierd. my black body m8 is just over 2 months old and was only in stock at the dealer 1 week before i bought it and its serial is 3198xxx. is the batch numbering system used to get -----> us !!!  -----> making !!!  more posts?--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 44583, "year": "2007"}, {"autor": "GlobeRiders", "date": "2007-05-12 05:42:00", "content": "I spent 3 years riding in Latin America on my BMW R80GS with a tank bag containing Leica M5 and M6 plus various lenses. Never had a problem and that with the rough conditions of the back roads of the Latin Continent. The liner of the bag was made from a piece of closed cell foam and I had cut out room for the cameras and lenses. Since then I have gone away from tank bags. With the riding I am doing I feel that a tank bag is more of a danger to the riding, but that is another story. I also carry a MacBook Pro and earlier PowerBooks of different flavors and had no problems. The computer is always placed in one of my panniers protected by a normal carrying case. I always make sure that the computer has been shut down before going for a ride, not just in sleep mode. Sean, I have enjoyed your web pages tremendously and learned a lot, thank you for all of your hard work. Getting back to using a M camera feels very nice and I am having lots of joy with the camera on this journey. Still I will be using my Eos camera and lenses and together I thing they are a good teem for what I do. Greetings Helge Pedersen http://www.globeriders.com", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/page/2/?tab=comments#comment-252763", "origin": "L-forum", "suborigin": "23730-m8-motorcycles-vibration-resistance", "result": true, "Selector": "i always make", "selectorShort": "make", "MarkedSent": "i spent 3 years riding in latin america on my bmw r80gs with a tank bag containing leica m5 and m6 plus various lenses. never had a problem and that with the rough conditions of the back roads of the latin continent. the liner of the bag was made from a piece of closed cell foam and i had cut out room for the cameras and lenses. since then i have gone away from tank bags. with the riding i am doing i feel that a tank bag is more of a danger to the riding, but that is another story. i also carry a macbook pro and earlier powerbooks of different flavors and had no problems. the computer is always placed in one of my panniers protected by a normal carrying case. -----> i !!!  -----> always !!!  -----> make !!!  sure that the computer has been shut down before going for a ride, not just in sleep mode. sean, i have enjoyed your web pages tremendously and learned a lot, thank you for all of your hard work. getting back to using a m camera feels very nice and i am having lots of joy with the camera on this journey. still i will be using my eos camera and lenses and together i thing they are a good teem for what i do. greetings helge pedersen http://www.globeriders.com", "sortedWord": "None", "Identifyer": null, "identifyer": 45134, "year": "2007"}, {"autor": "scott kirkpatrick", "date": "2007-04-10 08:45:00", "content": "I think the M16C will monitor the battery voltage because it has a built-in ADC but as I've mentioned above, I think the power management is pretty complex and it's tough to know what gets done where. .... The M16C has 256k ROM which is not bad for what it is doing; I haven't researched what the Black Fin and Intel provide. I expect the firmware updating is carried out by the Intel PXA270C which provides the interface to the LCD, command dials and push buttons; that in turn also means the M16C receives it's firmware update across this same interface. I need to look at its programming interface. Tour of the factory and clean room? If I turn up in Solms, I think they'll run me out of town! You have a pretty good structure diagram of the camera, based on flattening out all the flex connectors and identifying the major components. I don't know the ethical and legal lines between inspection of what you purchased and \"reverse engineering\" (which is usually a right that you only give up when you sign a EULA, and purchasing a Leica doesn't require that), but it would seem fair to look at the card layouts and flex connector lines and make educated guesses about whether the ADC on the M16 can see the output levels on all 6 voltages and determine shutdown when any level is not safe, or can only see the power system input from the battery plus warning signals derived from its third contact, and has to compute a shutdown decision from these. I see the purpose of this kind of discussion as educating us to make reasonable requests for fixes that can actually be done, and suggestions for improvements that respect the amount of engineering work involved. As you said, I doubt that you are exposing things unknown to other German or Asian camera manufacturers. In terms of your 'structure\" diagram obtained from the flattened-out pictures, where do you suppose the 4.5 MB of an .upd file gets copied? It has a rather repetitive structure, so I guess it is intended to be broken down into several parts. It must go into the places that are mentioned in the .xml header lines, but it is too large to be absorbed into the onchip ROMs of the 3-4 smart components identified so far. Is there an identifiable large EPROM on the M16 card? Or elsewhere? I also wonder if the Xilinx that with the Blackfin replaces the ASICs you would find in a Japanese design is reprogrammable from firmware, or only when the 4-bit maintenance interface and perhaps some additional power inputs is being used? If you turn up in Solms, I expect you would be handed a pair of brown overalls, and invited to stay... regards, scott", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/5/?tab=comments#comment-224494", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "us to make", "selectorShort": "make", "MarkedSent": "i think the m16c will monitor the battery voltage because it has a built-in adc but as i've mentioned above, i think the power management is pretty complex and it's tough to know what gets done where. .... the m16c has 256k rom which is not bad for what it is doing; i haven't researched what the black fin and intel provide. i expect the firmware updating is carried out by the intel pxa270c which provides the interface to the lcd, command dials and push buttons; that in turn also means the m16c receives it's firmware update across this same interface. i need to look at its programming interface. tour of the factory and clean room? if i turn up in solms, i think they'll run me out of town! you have a pretty good structure diagram of the camera, based on flattening out all the flex connectors and identifying the major components. i don't know the ethical and legal lines between inspection of what you purchased and \"reverse engineering\" (which is usually a right that you only give up when you sign a eula, and purchasing a leica doesn't require that), but it would seem fair to look at the card layouts and flex connector lines and make educated guesses about whether the adc on the m16 can see the output levels on all 6 voltages and determine shutdown when any level is not safe, or can only see the power system input from the battery plus warning signals derived from its third contact, and has to compute a shutdown decision from these. i see the purpose of this kind of discussion as educating -----> us !!!  -----> to !!!  -----> make !!!  reasonable requests for fixes that can actually be done, and suggestions for improvements that respect the amount of engineering work involved. as you said, i doubt that you are exposing things unknown to other german or asian camera manufacturers. in terms of your 'structure\" diagram obtained from the flattened-out pictures, where do you suppose the 4.5 mb of an .upd file gets copied? it has a rather repetitive structure, so i guess it is intended to be broken down into several parts. it must go into the places that are mentioned in the .xml header lines, but it is too large to be absorbed into the onchip roms of the 3-4 smart components identified so far. is there an identifiable large eprom on the m16 card? or elsewhere? i also wonder if the xilinx that with the blackfin replaces the asics you would find in a japanese design is reprogrammable from firmware, or only when the 4-bit maintenance interface and perhaps some additional power inputs is being used? if you turn up in solms, i expect you would be handed a pair of brown overalls, and invited to stay... regards, scott", "sortedWord": "None", "Identifyer": null, "identifyer": 45372, "year": "2007"}, {"autor": "EH21", "date": "2007-04-10 08:54:00", "content": "Mark, I am just amazed by your skill as a technician, engineer and photographer. I really enjoyed seeing the insides of the M8 but also your commentary on why they did this and that. Thank you very much for sharing this with us! btw - I know a little about how hard this project was as I recently tried to adapt my wife's old canon pro 1 for a different use: I wanted to make a dedicated camera with the fast surplus TV projection lenses. Well let's just say the parts are still in a box. Maybe if I had your skills I might have gotten a litte further. Regards, Eric Hiss", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224499", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "mark, i am just amazed by your skill as a technician, engineer and photographer. i really enjoyed seeing the insides of the m8 but also your commentary on why they did this and that. thank you very much for sharing this with us! btw - -----> i !!!  know a little about how hard this project was as -----> i !!!  recently tried -----> to !!!  adapt my wife's old canon pro 1 for a different use: -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  a dedicated camera with the fast surplus tv projection lenses. well let's just say the parts are still in a box. maybe if i had your skills i might have gotten a litte further. regards, eric hiss", "sortedWord": "None", "Identifyer": null, "identifyer": 45374, "year": "2007"}, {"autor": "marknorton", "date": "2007-04-10 09:11:00", "content": "Mark,I am just amazed by your skill as a technician, engineer and photographer. I really enjoyed seeing the insides of the M8 but also your commentary on why they did this and that. Thank you very much for sharing this with us! btw - I know a little about how hard this project was as I recently tried to adapt my wife's old canon pro 1 for a different use: I wanted to make a dedicated camera with the fast surplus TV projection lenses. Well let's just say the parts are still in a box. Maybe if I had your skills I might have gotten a litte further. Regards, Eric Hiss Thanks Eric. The pictures were taken with a Nikon D2X, their 60mm f2.8 macro and their new macro flash. I tried the 105mm f2.8 macro lens but it was too long. I need some more practice in some of those shadows though!", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224510", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "mark,i am just amazed by your skill as a technician, engineer and photographer. i really enjoyed seeing the insides of the m8 but also your commentary on why they did this and that. thank you very much for sharing this with us! btw - -----> i !!!  know a little about how hard this project was as -----> i !!!  recently tried -----> to !!!  adapt my wife's old canon pro 1 for a different use: -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  a dedicated camera with the fast surplus tv projection lenses. well let's just say the parts are still in a box. maybe if i had your skills i might have gotten a litte further. regards, eric hiss thanks eric. the pictures were taken with a nikon d2x, their 60mm f2.8 macro and their new macro flash. i tried the 105mm f2.8 macro lens but it was too long. i need some more practice in some of those shadows though!", "sortedWord": "None", "Identifyer": null, "identifyer": 45377, "year": "2007"}, {"autor": "MP3", "date": "2007-04-11 05:22:00", "content": "One of the best thread ever here, Mark. Real Bravo! 9 pages already. Mark, does anybody rise the question, After looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? Cheers Matthew", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225371", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "one of the best thread ever here, mark. real bravo! 9 pages already. mark, does anybody rise the question, after looking thur all the inside mechanics, do you think it is feasible to -----> come !!!  -----> up !!!  -----> with !!!  a silent shutter by deferring the motor rewind till we release our finger from the shutter press? cheers matthew", "sortedWord": "None", "Identifyer": null, "identifyer": 45434, "year": "2007"}, {"autor": "marknorton", "date": "2007-04-11 05:56:00", "content": "After looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? Matthew, Both the actuation of the shutter and the motor are controlled by the M16C processor which also has direct access to the position of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. Alternatively, it's possible to think of an add-on Leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225388", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after looking thur all the inside mechanics, do you think it is feasible to -----> come !!!  -----> up !!!  -----> with !!!  a silent shutter by deferring the motor rewind till we release our finger from the shutter press? matthew, both the actuation of the shutter and the motor are controlled by the m16c processor which also has direct access to the position of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. alternatively, it's possible to think of an add-on leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "sortedWord": "None", "Identifyer": null, "identifyer": 45438, "year": "2007"}, {"autor": "egibaud", "date": "2007-04-11 11:59:00", "content": "Great!!! thank you Just one question.... is the M8 cheaper when buying in DIY Kit? --img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225585", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "great!!! thank you just one question.... is the m8 cheaper when buying in -----> diy !!!  kit? --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 45442, "year": "2007"}, {"autor": "Artichoke", "date": "2007-04-20 05:01:00", "content": "delighted to learn you got the M8 back together & it is working fine I never doubted you could pull this off I agree with the suggestions that a special edition M8 should be made honoring your achievement ...the idea of a transparent model seems most appropriate what you did is amazing & muchly appreciated", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/11/?tab=comments#comment-233622", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "[idea, made]", "selectorShort": "idea", "MarkedSent": "delighted to learn you got the M8 back together & it is working fine I never doubted you could pull this off I agree with the suggestions that a special edition M8 should be made honoring your achievement ...the idea of a transparent model seems most appropriate what you did is amazing & muchly appreciated", "sortedWord": "None", "Identifyer": null, "identifyer": 45492, "year": "2007"}, {"autor": "hugov", "date": "2007-06-17 05:44:00", "content": "Mark, I couldn't make out the part number of the part number of (what I presume is) the ADC in your pictures (above the two sets of unpopulated pads to the right of the DSP). It looks like a Philips logo on it, but I can't read the part number. Also, is the FPGA an XC3S200? I can't quite figure out the part number on that either; if it is an XC3S200, that is quite interesting, as that device is a fairly small FPGA (second smallest Spartan3 that Xilinx make). I don't think there'd be room in there for, for example, hardware JPEG - they must use the DSP for that.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/13/?tab=comments#comment-283036", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "mark, -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  out the part number of the part number of (what -----> i !!!  presume is) the adc in your pictures (above the two sets of unpopulated pads to the right of the dsp). it looks like a philips logo on it, but i can't read the part number. also, is the fpga an xc3s200? i can't quite figure out the part number on that either; if it is an xc3s200, that is quite interesting, as that device is a fairly small fpga (second smallest spartan3 that xilinx make). i don't think there'd be room in there for, for example, hardware jpeg - they must use the dsp for that.", "sortedWord": "None", "Identifyer": null, "identifyer": 45530, "year": "2007"}, {"autor": "hugov", "date": "2007-06-17 10:07:00", "content": "Sandy, you're probably right, but the 997x series specifically don't seem to have anything that is 16-bits and fast enough. Do you know of other manufacturers that make CCD-specific ADC/AFE devices? On a side note, I still have some doubts that it is in fact true 16-bit - seems suspicious that Leica designed in a 16-bit ADC but it only outputs 8-bit RAW files. I suspect that Mark is right, and the ADC is actually only 14-bits. Regarding timing generation, it is possible that the ADC/AFE device could generate the timing - many of the Analog Devices AD99xx AFE parts have integrated timing generators. Mark, I certainly wouldn't have wanted to desolder the CCD either... they are notoriously static-sensitive, and I doubt you can get a replacement sensor at a reasonable price! p.s. anyone know what happened to Huw Finney and his DIY digital Leica M2? (Leica and Rangefinders Forum: M2aD Project, A bit of premature fantasy. - photo.net and google for the other threads describing it)", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/14/?tab=comments#comment-283157", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "sandy, you're probably right, but the 997x series specifically don't seem to have anything that is 16-bits and fast enough. do you know of other manufacturers that make ccd-specific adc/afe devices? on a side note, i still have some doubts that it is in fact true 16-bit - seems suspicious that leica designed in a 16-bit adc but it only outputs 8-bit raw files. i suspect that mark is right, and the adc is actually only 14-bits. regarding timing generation, it is possible that the adc/afe device could generate the timing - many of the analog devices ad99xx afe parts have integrated timing generators. mark, i certainly wouldn't have wanted to desolder the ccd either... they are notoriously static-sensitive, and i doubt you can get a replacement sensor at a reasonable price! p.s. anyone know what happened to huw finney and his -----> diy !!!  digital leica m2? (leica and rangefinders forum: m2ad project, a bit of premature fantasy. - photo.net and google for the other threads describing it)", "sortedWord": "None", "Identifyer": null, "identifyer": 45536, "year": "2007"}, {"autor": "pleeson", "date": "2007-10-12 22:04:00", "content": "hi- As much as I am taken by the M8, all of the problems really turn me off. Besides, can't we buy a lot of film for five grand? Best I have an M6TTL, and love it. I develop and print my own B&W. Also shoot/scan slide film, averages $10 a roll. As I sit here scanning in ~400 images, the utility of digital emerges... For the equivalent of 430 rolls of Sensia, I just finally gave in and bought a demo M8. I'll never quit using the M6, but economy doesn't have much to do with it!", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/?tab=comments#comment-375381", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "hi- as much as i am taken by the m8, all of the problems really turn me off. besides, can't we buy a lot of film for five grand? best i have an m6ttl, and love it. -----> i !!!  -----> develop !!!  and print my own b&w. also shoot/scan slide film, averages $10 a roll. as i sit here scanning in ~400 images, the utility of digital emerges... for the equivalent of 430 rolls of sensia, i just finally gave in and bought a demo m8. i'll never quit using the m6, but economy doesn't have much to do with it!", "sortedWord": "None", "Identifyer": null, "identifyer": 48701, "year": "2007"}, {"autor": "rubenkok", "date": "2007-12-01 09:18:00", "content": "Ruben, Did you actually read through to the end of that \"review\"? Kent, NO I dit not, I should have --img-- I try to make it up with some M6 details --img-- regards, Ruben --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/3/?tab=comments#comment-416290", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i try to make", "selectorShort": "make", "MarkedSent": "ruben, did you actually read through to the end of that \"review\"? kent, no i dit not, i should have --img-- -----> i !!!  -----> try !!!  -----> to !!!  -----> make !!!  it up with some m6 details --img-- regards, ruben --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48745, "year": "2007"}, {"autor": "Kent10D", "date": "2007-12-01 10:01:00", "content": "Kent,NO I dit not, I should have --img-- I try to make it up with some M6 details --img-- regards, Ruben No problem Ruben! Thanks for that confirmation. What are you shooting those details with? Obviously not your M6. --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/3/?tab=comments#comment-416318", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i try to make", "selectorShort": "make", "MarkedSent": "kent,no i dit not, i should have --img-- -----> i !!!  -----> try !!!  -----> to !!!  -----> make !!!  it up with some m6 details --img-- regards, ruben no problem ruben! thanks for that confirmation. what are you shooting those details with? obviously not your m6. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48746, "year": "2007"}, {"autor": "elansprint72", "date": "2007-03-29 20:36:00", "content": " Pete,Have we been visiting the same places with our D2s? . Michael, My shot was from Chester Cathedral; I'm not a big visitor of pay-to-enter religious buildings, sneaked in via the back door on this occasion! From the enthusiastic owner-reports here I think that we can conclude that this is a good camera. I'm seriously considering getting another and sticking it away until the time when the first one wears out. Someone asked about the leather case- it is not much use, I carry it inside a Barbour bag as a secondary form of protection; Luigi's case is a triumph of style over function, the design of the D2 precludes any ERC being fit for purpose, no matter how you do it, some of the controls/functions will be obscured. I tried making my own from a spare piece of leather but it finished up with so many cut-outs that it would not stay on the camera.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/3/?tab=comments#comment-215564", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i tried making", "selectorShort": "make", "MarkedSent": " pete,have we been visiting the same places with our d2s? . michael, my shot was from chester cathedral; i'm not a big visitor of pay-to-enter religious buildings, sneaked in via the back door on this occasion! from the enthusiastic owner-reports here i think that we can conclude that this is a good camera. i'm seriously considering getting another and sticking it away until the time when the first one wears out. someone asked about the leather case- it is not much use, i carry it inside a barbour bag as a secondary form of protection; luigi's case is a triumph of style over function, the design of the d2 precludes any erc being fit for purpose, no matter how you do it, some of the controls/functions will be obscured. -----> i !!!  -----> tried !!!  -----> making !!!  my own from a spare piece of leather but it finished up with so many cut-outs that it would not stay on the camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 15270, "year": "2007"}, {"autor": "asabet", "date": "2007-03-29 22:24:00", "content": "Carl, that is an awesome shot! Michael,Someone asked about the leather case- it is not much use, I carry it inside a Barbour bag as a secondary form of protection; Luigi's case is a triumph of style over function, the design of the D2 precludes any ERC being fit for purpose, no matter how you do it, some of the controls/functions will be obscured. I tried making my own from a spare piece of leather but it finished up with so many cut-outs that it would not stay on the camera. I was wondering about the Leica case - model 18627. Anyone have an opinion about this case? I have read both good and bad opinions.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/3/?tab=comments#comment-215640", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i tried making", "selectorShort": "make", "MarkedSent": "carl, that is an awesome shot! michael,someone asked about the leather case- it is not much use, i carry it inside a barbour bag as a secondary form of protection; luigi's case is a triumph of style over function, the design of the d2 precludes any erc being fit for purpose, no matter how you do it, some of the controls/functions will be obscured. -----> i !!!  -----> tried !!!  -----> making !!!  my own from a spare piece of leather but it finished up with so many cut-outs that it would not stay on the camera. i was wondering about the leica case - model 18627. anyone have an opinion about this case? i have read both good and bad opinions.", "sortedWord": "None", "Identifyer": null, "identifyer": 15273, "year": "2007"}, {"autor": "Riley", "date": "2007-03-30 14:22:00", "content": "Why nothing to gain? I imagine that ISO 50 would have noticeably less shadow noise than ISO 100. well thing one, it cant be done 100 iso is the baseline, higher iso's are amplifications of light data from that baseline but you cant like divide the baseline signal by 2, it just wont work. You can go up, but not down. as to gains, IF it could be done, it may, in the very broadest of terms give you less noise you would see no other gain to fix D2's ills whatever they are perceived to be you would take that sensor out and clobber it with a hammer for fun avail yourself of something like the Fuji F30 sensor architecture and imaging engine reshape the curves and tones to what Panasonic/Leica had set down and viola, a very very nice camera that is iso800 capable to 3200 in a pinch thats a deal i would make today", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/4/?tab=comments#comment-216100", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "why nothing to gain? i imagine that iso 50 would have noticeably less shadow noise than iso 100. well thing one, it cant be done 100 iso is the baseline, higher iso's are amplifications of light data from that baseline but you cant like divide the baseline signal by 2, it just wont work. you can go up, but not down. as to gains, if it could be done, it may, in the very broadest of terms give you less noise you -----> would !!!  see no other gain to fix d2's ills whatever they are perceived to be you -----> would !!!  take that sensor out and clobber it with a hammer for fun avail yourself of something like the fuji f30 sensor architecture and imaging engine reshape the curves and tones to what panasonic/leica had set down and viola, a very very nice camera that is iso800 capable to 3200 in a pinch thats a deal -----> i !!!  -----> would !!!  -----> make !!!  today", "sortedWord": "None", "Identifyer": null, "identifyer": 15294, "year": "2007"}, {"autor": "mark_a_h", "date": "2007-04-03 16:03:00", "content": "The D2... one of the best purchases I've made. It makes astonishingly beautiful jpegs and RAW (if you have the time to wait for it to write). The camera operation is a pleasure, despite the EVF. I've had people remark that the photos look distinct. I think they notice the colour fidelity, precise detail and vast depth of field. It is a go everywhere kind of camera. I will not ever sell it. --img-- ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/6/?tab=comments#comment-219304", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "the d2... one of the best purchases -----> i !!! 've -----> made !!! . it makes astonishingly beautiful jpegs and raw (if you have the time to wait for it to write). the camera operation is a pleasure, despite the evf. i've had people remark that the photos look distinct. i think they notice the colour fidelity, precise detail and vast depth of field. it is a go everywhere kind of camera. i will not ever sell it. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 15339, "year": "2007"}, {"autor": "Overgaard", "date": "2007-04-27 06:34:00", "content": "Dear Thorsten, this is not the case. There are obviously some factors limiting the max aperture so practically you would get approximately a 4/160 only. One of them appears to be the diameter of the extender itself limiting the max apperture to 2. Try to close to f2 -> f4 with the extender and see if the results get better. I use the 80Lux with the APO x2 (both with ROM), close it to f2 and am very pleased (especially if you don't want to carry additional tele lenses. cheers The samples are all F/4.0 as I know F/1.4 - F/2.8 might be troublesome. What Leica says (about the APO-2X) is that it is for lenses F2 and up, but then lists the F/1.4 and in a way so that I get the idea I 'save' some stops because I have to jump the steps I anyway can't use with it (did that make sense?). So that means that from F/2.0 the 80mm F/1.4 should be ok. Anyway, \"look, don't think\" so I'll do some more tests. The trouble getting the 80mm in focus is well-known, with the 2X it seems an entire different game.", "link": "https://www.l-camera-forum.com/topic/22579-experience-with-2x-extender/?tab=comments#comment-239791", "origin": "L-forum", "suborigin": "22579-experience-with-2x-extender", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Dear Thorsten, this is not the case. There are obviously some factors limiting the max aperture so practically you would get approximately a 4/160 only. One of them appears to be the diameter of the extender itself limiting the max apperture to 2. Try to close to f2 -> f4 with the extender and see if the results get better. I use the 80Lux with the APO x2 (both with ROM), close it to f2 and am very pleased (especially if you don't want to carry additional tele lenses. cheers The samples are all F/4.0 as I know F/1.4 - F/2.8 might be troublesome. What Leica says (about the APO-2X) is that it is for lenses F2 and up, but then lists the F/1.4 and in a way so that I get the idea I 'save' some stops because I have to jump the steps I anyway can't use with it (did that make sense?). So that means that from F/2.0 the 80mm F/1.4 should be ok. Anyway, \"look, don't think\" so I'll do some more tests. The trouble getting the 80mm in focus is well-known, with the 2X it seems an entire different game.", "sortedWord": "None", "Identifyer": null, "identifyer": 22274, "year": "2007"}, {"autor": "robert_parker", "date": "2007-01-18 22:19:00", "content": "Quote:Originally Posted by robert_parker This is one of my more art-y shots with the 21mmVC and IIIf Red Dial Hey, Robert, you ARE taking some pain to get a good shot. Burning my car is something I have so far been shying away from. It's not a Renault though...--img--  Cheers, Andy Don't worry Andy - I made sure to burn someone else's car !!! --img-- ", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/2/?tab=comments#comment-145859", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "quote:originally posted by robert_parker this is one of my more art-y shots with the 21mmvc and iiif red dial hey, robert, you are taking some pain to get a good shot. burning my car is something i have so far been shying away from. it's not a renault though...--img--  cheers, andy don't worry andy - -----> i !!!  -----> made !!!  sure to burn someone else's car !!! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35210, "year": "2007"}, {"autor": "Irishimage", "date": "2007-06-04 19:15:00", "content": "My 111c (1946) with 5cm Summicron collapsable lens. Anyone interested in restoring old Leica 111 series cameras as i am, might be interested in my own experiance lately. I have spent many hours stripping down both camera and lens,cleaning adjusting and lubricating both and so far have exposed about 6 x 36 colour rolls with varabile results. Some stray light (as if overexposure) in places on some of the images i have been informed on this forum ,would indicate a problem with the shutter curtains. I have made some adjustments with the curtain tension and also have cemented a velvet strip of material into the camera housing close to the slow speed setting knob,this is a recommendation by Leitz according to their service manual. Have a couple of rolls of Neopan 400 cn to test the camera with over the next week or so and will post results for anyone interested. Noel --img-- ", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/7/?tab=comments#comment-273210", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "my 111c (1946) with 5cm summicron collapsable lens. anyone interested in restoring old leica 111 series cameras as i am, might be interested in my own experiance lately. i have spent many hours stripping down both camera and lens,cleaning adjusting and lubricating both and so far have exposed about 6 x 36 colour rolls with varabile results. some stray light (as if overexposure) in places on some of the images i have been informed on this forum ,would indicate a problem with the shutter curtains. -----> i !!!  -----> have !!!  -----> made !!!  some adjustments with the curtain tension and also -----> have !!!  cemented a velvet strip of material into the camera housing close to the slow speed setting knob,this is a recommendation by leitz according to their service manual. have a couple of rolls of neopan 400 cn to test the camera with over the next week or so and will post results for anyone interested. noel --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35307, "year": "2007"}, {"autor": "luigi bertolotti", "date": "2007-06-17 22:02:00", "content": "I posted today a thread in the M8 forum, hoping to receive some advice on using M8 for macro: I made today my first shots of home garden flowers with M8+Visoflex: so I couldn't escape the occasion to make some shots of a pair of LTMs, with two lenses I love a lot: the IIIf may become ny first-choice \"backup camera\" for M8... --img--  and also an occasion to play a little with Lightroom...a right subject --img--  --img--  Pictures taken with M8/VisoII/Tele-Elmarit 135 head...I used it for my macro work, and only after processing it came to my mind that, as an hommage to LTM, I could have better made these shots with the head of my Elmar 135 LTM... I bet the results wouldn't have been so different.", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/7/?tab=comments#comment-283612", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  posted today a thread in the m8 forum, hoping to receive some advice on using m8 for macro: -----> i !!!  -----> made !!!  today my first shots of home garden flowers with m8+visoflex: so -----> i !!!  couldn't escape the occasion to make some shots of a pair of ltms, with two lenses -----> i !!!  love a lot: the iiif may become ny first-choice \"backup camera\" for m8... --img--  and also an occasion to play a little with lightroom...a right subject --img--  --img--  pictures taken with m8/visoii/tele-elmarit 135 head...i used it for my macro work, and only after processing it came to my mind that, as an hommage to ltm, i could have better made these shots with the head of my elmar 135 ltm... i bet the results wouldn't have been so different.", "sortedWord": "None", "Identifyer": null, "identifyer": 35309, "year": "2007"}, {"autor": "earleygallery", "date": "2007-06-18 22:33:00", "content": "http://www.l-camera-forum.com/leica-forum/leica-collectors-historica/19410-elmars-comparison-4-images.html This is the comparison I made between the black scale, red scale and 2.8 (old verson) Elmars.", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/7/?tab=comments#comment-284540", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "http://www.l-camera-forum.com/leica-forum/leica-collectors-historica/19410-elmars-comparison-4-images.html this is the comparison -----> i !!!  -----> made !!!  between the black scale, red scale and 2.8 (old verson) elmars.", "sortedWord": "None", "Identifyer": null, "identifyer": 35313, "year": "2007"}, {"autor": "gesualdo", "date": "2007-09-27 01:21:00", "content": "My father gave me his Leica camera body years ago. Until now I have not had the desire to buy lenses for it and get it working. The serial number is 496722 which I believe makes it a post-war IIIc. What can you tell me about this camera? What should be the first lens I buy for it? Thanks so much. --img-- ", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/9/?tab=comments#comment-363607", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i believe makes", "selectorShort": "make", "MarkedSent": "my father gave me his leica camera body years ago. until now i have not had the desire to buy lenses for it and get it working. the serial number is 496722 which -----> i !!!  -----> believe !!!  -----> makes !!!  it a post-war iiic. what can you tell me about this camera? what should be the first lens i buy for it? thanks so much. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35350, "year": "2007"}, {"autor": "doubice", "date": "2007-09-27 02:33:00", "content": "My father gave me his Leica camera body years ago. Until now I have not had the desire to buy lenses for it and get it working. The serial number is 496722 which I believe makes it a post-war IIIc. What can you tell me about this camera? What should be the first lens I buy for it? Thanks so much. Enrique, What you have is indeed a post-WWII Leica IIIc. More specifically, a ‘sharkskin’ IIIc. All screwmount Leicas used vulcanite for body coverings, which was made from tree sap of some trees in Indonesia if I remember correctly. After the war this was difficult to obtain and some early post-war IIIc’s used what is in today’s Leica circles described as sharkskin, due to its rather rough feel to the touch. The IIIc did not come with factory-installed flash synchronisation, your IIIc was modified by an independent mechanic and is flash synchronised (a rather clean installation too!). Before you buy lenses, have the camera checked out; most Leicas of this vintage, particularly if not used for a long time will need servicing. Shutter curtains might be dry, lubricant might have dried out etc. Once you are sure that the camera is OK, start looking for lenses. If you want to keep the camera historically correct, try to find lenses in the 600,000 to 900,000 serial number range. I would probably start with a 3.5/50mm Elmar standard lens, those can be found relatively cheaply. Or, a 2/50mm Summitar could also be an excellent choice. Here is a listing of serial numbers with a corresponding year of production: http://www.forloren.dk/lbf/leica_lens_serial.htm If historical correctness is not important, you can try the many excellent lenses that were made by Canon during the 1950’s and 60’s. Those are unfortunately, getting rather expensive due to collector demand. Another choice would be the superbly made and in many respect better than the old Leica lenses, available today from Cosina/Voigtlander. The cheapest alternative with surprisingly good image quality would be Russian lenses made for the old Zorki and FED cameras - eBay is full of them. If you want to find out what other lenses were produced in Leica Thread Mount (LTM), browse this site for information: http://www.cameraquest.com/ltmlens.htm Good luck! Jan", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/9/?tab=comments#comment-363633", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "i believe makes", "selectorShort": "make", "MarkedSent": "my father gave me his leica camera body years ago. until now i have not had the desire to buy lenses for it and get it working. the serial number is 496722 which -----> i !!!  -----> believe !!!  -----> makes !!!  it a post-war iiic. what can you tell me about this camera? what should be the first lens i buy for it? thanks so much. enrique, what you have is indeed a post-wwii leica iiic. more specifically, a ‘sharkskin’ iiic. all screwmount leicas used vulcanite for body coverings, which was made from tree sap of some trees in indonesia if i remember correctly. after the war this was difficult to obtain and some early post-war iiic’s used what is in today’s leica circles described as sharkskin, due to its rather rough feel to the touch. the iiic did not come with factory-installed flash synchronisation, your iiic was modified by an independent mechanic and is flash synchronised (a rather clean installation too!). before you buy lenses, have the camera checked out; most leicas of this vintage, particularly if not used for a long time will need servicing. shutter curtains might be dry, lubricant might have dried out etc. once you are sure that the camera is ok, start looking for lenses. if you want to keep the camera historically correct, try to find lenses in the 600,000 to 900,000 serial number range. i would probably start with a 3.5/50mm elmar standard lens, those can be found relatively cheaply. or, a 2/50mm summitar could also be an excellent choice. here is a listing of serial numbers with a corresponding year of production: http://www.forloren.dk/lbf/leica_lens_serial.htm if historical correctness is not important, you can try the many excellent lenses that were made by canon during the 1950’s and 60’s. those are unfortunately, getting rather expensive due to collector demand. another choice would be the superbly made and in many respect better than the old leica lenses, available today from cosina/voigtlander. the cheapest alternative with surprisingly good image quality would be russian lenses made for the old zorki and fed cameras - ebay is full of them. if you want to find out what other lenses were produced in leica thread mount (ltm), browse this site for information: http://www.cameraquest.com/ltmlens.htm good luck! jan", "sortedWord": "None", "Identifyer": null, "identifyer": 35351, "year": "2007"}, {"autor": "Johannes Knightworth", "date": "2007-03-19 13:17:00", "content": " I have just purchased a 1936 Leica III Mod. F (Not a IIIf) in Black finish. The camera is in beautifull condition and has just returned from a total \"service\" by Leica Solms. Upon purchase the finish of the the camera was, well I would say A- just some very minor rubbings on the black surface, it actually did look hardly used. Technically it didn't function, something with the shutter cloth as well as the overall mechanics. I had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, I will want to use it. The only problem I see is finding a suitable lens. I have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. I use the Anastigmat on my \"0\" with greeat pleasure for B&W shots, but i realize this is a relatively new lens with modern coatings. I also like my 35mm asph. which i mostly use for slides, I see the difference between the Anastigmat and the 35mm and prefer the Anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. I would actually like a combination of both with the III Mod.f but I think would limit it to B&W use only, which I develop and print myself. I have read an awfull lot on this subject of LTM lenses and judging b what I'v read buying a Voigtländer would be the way to go .... But I would hate using a voigländer lens on such a beauty of a camera, I would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... What lens would I be looking at searching for ? For top quality images I would use my Hasselblad and tripod, so technical top-quality is not what I'm looking for, I much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ...", "link": "https://www.l-camera-forum.com/topic/19230-lens-for-iii-mod-f/?tab=comments#comment-205820", "origin": "L-forum", "suborigin": "19230-lens-for-iii-mod-f", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " i have just purchased a 1936 leica iii mod. f (not a iiif) in black finish. the camera is in beautifull condition and has just returned from a total \"service\" by leica solms. upon purchase the finish of the the camera was, well i would say a- just some very minor rubbings on the black surface, it actually did look hardly used. technically it didn't function, something with the shutter cloth as well as the overall mechanics. i had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, i will want to use it. the only problem i see is finding a suitable lens. i have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. i use the anastigmat on my \"0\" with greeat pleasure for b&w shots, but i realize this is a relatively new lens with modern coatings. i also like my 35mm asph. which i mostly use for slides, i see the difference between the anastigmat and the 35mm and prefer the anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. i would actually like a combination of both with the iii mod.f but -----> i !!!  think would limit it to b&w use only, which -----> i !!!  -----> develop !!!  and print myself. i have read an awfull lot on this subject of ltm lenses and judging b what i'v read buying a voigtländer would be the way to go .... but i would hate using a voigländer lens on such a beauty of a camera, i would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... what lens would i be looking at searching for ? for top quality images i would use my hasselblad and tripod, so technical top-quality is not what i'm looking for, i much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ...", "sortedWord": "None", "Identifyer": null, "identifyer": 39458, "year": "2007"}, {"autor": "luigi bertolotti", "date": "2007-03-19 14:56:00", "content": "I have just purchased a 1936 Leica III Mod. F (Not a IIIf) in Black finish. The camera is in beautifull condition and has just returned from a total \"service\" by Leica Solms. Upon purchase the finish of the the camera was, well I would say A- just some very minor rubbings on the black surface, it actually did look hardly used. Technically it didn't function, something with the shutter cloth as well as the overall mechanics. I had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, I will want to use it. The only problem I see is finding a suitable lens. I have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. I use the Anastigmat on my \"0\" with greeat pleasure for B&W shots, but i realize this is a relatively new lens with modern coatings. I also like my 35mm asph. which i mostly use for slides, I see the difference between the Anastigmat and the 35mm and prefer the Anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. I would actually like a combination of both with the III Mod.f but I think would limit it to B&W use only, which I develop and print myself. I have read an awfull lot on this subject of LTM lenses and judging b what I'v read buying a Voigtländer would be the way to go .... But I would hate using a voigländer lens on such a beauty of a camera, I would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... What lens would I be looking at searching for ? For top quality images I would use my Hasselblad and tripod, so technical top-quality is not what I'm looking for, I much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ... Compliments for your will to use your old III: leicas LTM are special taste when used.. and they give always more than one can think. I seem to have understood you have a very modern 35 asph: if it is in screw mount, the problem of buying another 35 of course does not exist. At this point, to have a nice pair of original lenses, excellent for B&W, is in my opinion a very easy and cheap choice: two Elmars : 50 + 90 ! they are easy to find, not expensive, fine, light... if you do not look for extra apertures, they are definitely the smarter choice: consider that the add-on price you would pay for a Summicron 50 (the obvious alternative to the Elmar) could even be the cost of a good Hektor 13,5 ... if you like this length; but 50 + 90 is the best buy, in my opinion; 90 needs a finder... Leitz or 3rd party it is easy to find and rather cheap. The choice is not so easy if you would like also to have a real Wide Angle, 28 or less... the two 28s by Leitz (Hektor 6,3 and Summaron 5,6) are mainly collector items...not so easy to find... the Hektor has a significant vignetting, the Summaron (which I use regularly) is better but costly... both of them are anyway lovely gear, supercompact... but if you are mainly interested on USE, i think that for WA screw mount, mayb is really worth to look at Cos/Voigt... they have also a 25, seem to remember; of course supposed you have at least 1 or 2 originals Leitz: as You say, a pity to have a fine III and not any of HER lenses...", "link": "https://www.l-camera-forum.com/topic/19230-lens-for-iii-mod-f/?tab=comments#comment-205913", "origin": "L-forum", "suborigin": "19230-lens-for-iii-mod-f", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i have just purchased a 1936 leica iii mod. f (not a iiif) in black finish. the camera is in beautifull condition and has just returned from a total \"service\" by leica solms. upon purchase the finish of the the camera was, well i would say a- just some very minor rubbings on the black surface, it actually did look hardly used. technically it didn't function, something with the shutter cloth as well as the overall mechanics. i had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, i will want to use it. the only problem i see is finding a suitable lens. i have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. i use the anastigmat on my \"0\" with greeat pleasure for b&w shots, but i realize this is a relatively new lens with modern coatings. i also like my 35mm asph. which i mostly use for slides, i see the difference between the anastigmat and the 35mm and prefer the anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. i would actually like a combination of both with the iii mod.f but -----> i !!!  think would limit it to b&w use only, which -----> i !!!  -----> develop !!!  and print myself. i have read an awfull lot on this subject of ltm lenses and judging b what i'v read buying a voigtländer would be the way to go .... but i would hate using a voigländer lens on such a beauty of a camera, i would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... what lens would i be looking at searching for ? for top quality images i would use my hasselblad and tripod, so technical top-quality is not what i'm looking for, i much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ... compliments for your will to use your old iii: leicas ltm are special taste when used.. and they give always more than one can think. i seem to have understood you have a very modern 35 asph: if it is in screw mount, the problem of buying another 35 of course does not exist. at this point, to have a nice pair of original lenses, excellent for b&w, is in my opinion a very easy and cheap choice: two elmars : 50 + 90 ! they are easy to find, not expensive, fine, light... if you do not look for extra apertures, they are definitely the smarter choice: consider that the add-on price you would pay for a summicron 50 (the obvious alternative to the elmar) could even be the cost of a good hektor 13,5 ... if you like this length; but 50 + 90 is the best buy, in my opinion; 90 needs a finder... leitz or 3rd party it is easy to find and rather cheap. the choice is not so easy if you would like also to have a real wide angle, 28 or less... the two 28s by leitz (hektor 6,3 and summaron 5,6) are mainly collector items...not so easy to find... the hektor has a significant vignetting, the summaron (which i use regularly) is better but costly... both of them are anyway lovely gear, supercompact... but if you are mainly interested on use, i think that for wa screw mount, mayb is really worth to look at cos/voigt... they have also a 25, seem to remember; of course supposed you have at least 1 or 2 originals leitz: as you say, a pity to have a fine iii and not any of her lenses...", "sortedWord": "None", "Identifyer": null, "identifyer": 39460, "year": "2007"}, {"autor": "earleygallery", "date": "2007-03-19 15:14:00", "content": "Johannes, Andreas has kindly mentioned my thread on this same section of the forum. I have an earlier 3.5 5cm, a Red Scale and a 2.8 Elmar which I have made some (OK, basic) comparisons with. Without question your camera should be paired with a 5cm Elmar! The earlier versions are great - I was really pleased with the results I was getting in B&W and Colour, however the Red Scale is a definate improvement in terms of contrast and colour rendition. If you are only shooting B&W then either version will be fine. I think the Red Scale is a little sharper, from this test, but you may prefer the look of the results from the earlier lens. I don't think you will be disappointed with either.", "link": "https://www.l-camera-forum.com/topic/19230-lens-for-iii-mod-f/?tab=comments#comment-205923", "origin": "L-forum", "suborigin": "19230-lens-for-iii-mod-f", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "johannes, andreas has kindly mentioned my thread on this same section of the forum. -----> i !!!  -----> have !!!  an earlier 3.5 5cm, a red scale and a 2.8 elmar which -----> i !!!  -----> have !!!  -----> made !!!  some (ok, basic) comparisons with. without question your camera should be paired with a 5cm elmar! the earlier versions are great - i was really pleased with the results i was getting in b&w and colour, however the red scale is a definate improvement in terms of contrast and colour rendition. if you are only shooting b&w then either version will be fine. i think the red scale is a little sharper, from this test, but you may prefer the look of the results from the earlier lens. i don't think you will be disappointed with either.", "sortedWord": "None", "Identifyer": null, "identifyer": 39461, "year": "2007"}, {"autor": "DavidStone", "date": "2007-03-20 11:51:00", "content": "I have just purchased a 1936 Leica III Mod. F (Not a IIIf) in Black finish. The camera is in beautifull condition and has just returned from a total \"service\" by Leica Solms. Upon purchase the finish of the the camera was, well I would say A- just some very minor rubbings on the black surface, it actually did look hardly used. Technically it didn't function, something with the shutter cloth as well as the overall mechanics. I had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, I will want to use it. The only problem I see is finding a suitable lens. I have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. I use the Anastigmat on my \"0\" with greeat pleasure for B&W shots, but i realize this is a relatively new lens with modern coatings. I also like my 35mm asph. which i mostly use for slides, I see the difference between the Anastigmat and the 35mm and prefer the Anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. I would actually like a combination of both with the III Mod.f but I think would limit it to B&W use only, which I develop and print myself. I have read an awfull lot on this subject of LTM lenses and judging b what I'v read buying a Voigtländer would be the way to go .... But I would hate using a voigländer lens on such a beauty of a camera, I would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... What lens would I be looking at searching for ? For top quality images I would use my Hasselblad and tripod, so technical top-quality is not what I'm looking for, I much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ... I also have a 1938 black Leica III, which I've had for many years, and it's in regular use - I have XP2 film in it right now. Of course, these cameras were originally designed to use the 50mm lens and I would not argue with the opinion that the Elmar would be an excellent choice. My solution, however, is to use the 50mm f/2 Summar - the only 'fast' lens that's contemporary with this model of camera. I bought one in basically good condition and shot a few BW films to confirm that it was OK. I then had it cleaned and the front element re-polished, and all the glass-to-air surfaces coated. Some late Summars were in fact coated, so this is not entirely un-original. I can get A3-size BW prints from this lens of excellent quality, and it's quite useable at f/2, if the main subject is fairly central. Of wider lenses that look right on the camera, the 35mm Summaron is a good choice, but of course an accessory viewfinder is required. I use this camera a lot, however, with a modern CV21, as a dedicated wide-angle camera, alongside my M2. The small Voigtlander lenses don't look out of place, in my opinion, on the older Leicas. David", "link": "https://www.l-camera-forum.com/topic/19230-lens-for-iii-mod-f/?tab=comments#comment-206601", "origin": "L-forum", "suborigin": "19230-lens-for-iii-mod-f", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i have just purchased a 1936 leica iii mod. f (not a iiif) in black finish. the camera is in beautifull condition and has just returned from a total \"service\" by leica solms. upon purchase the finish of the the camera was, well i would say a- just some very minor rubbings on the black surface, it actually did look hardly used. technically it didn't function, something with the shutter cloth as well as the overall mechanics. i had it overhauled and now, apparantly, it's in perfect working condition, so instead of keeping it enclosed in it's original packaging which came with it, i will want to use it. the only problem i see is finding a suitable lens. i have no experience what so ever with lenses and am not particularly interested in them anyway, they must serve the purpose of being able to produce a good picture within the bounderies of their technical standards. i use the anastigmat on my \"0\" with greeat pleasure for b&w shots, but i realize this is a relatively new lens with modern coatings. i also like my 35mm asph. which i mostly use for slides, i see the difference between the anastigmat and the 35mm and prefer the anastigmat for \"character\" shots and the 35mm for the normal \"snapshot\" range of images. i would actually like a combination of both with the iii mod.f but -----> i !!!  think would limit it to b&w use only, which -----> i !!!  -----> develop !!!  and print myself. i have read an awfull lot on this subject of ltm lenses and judging b what i'v read buying a voigtländer would be the way to go .... but i would hate using a voigländer lens on such a beauty of a camera, i would somehow like to maintain the 30-ties image quality/style without to much loss of detail and flare ... what lens would i be looking at searching for ? for top quality images i would use my hasselblad and tripod, so technical top-quality is not what i'm looking for, i much rather look at \"atmosphere\" after all perfection is sort of boring .... looking forward to your replies ... i also have a 1938 black leica iii, which i've had for many years, and it's in regular use - i have xp2 film in it right now. of course, these cameras were originally designed to use the 50mm lens and i would not argue with the opinion that the elmar would be an excellent choice. my solution, however, is to use the 50mm f/2 summar - the only 'fast' lens that's contemporary with this model of camera. i bought one in basically good condition and shot a few bw films to confirm that it was ok. i then had it cleaned and the front element re-polished, and all the glass-to-air surfaces coated. some late summars were in fact coated, so this is not entirely un-original. i can get a3-size bw prints from this lens of excellent quality, and it's quite useable at f/2, if the main subject is fairly central. of wider lenses that look right on the camera, the 35mm summaron is a good choice, but of course an accessory viewfinder is required. i use this camera a lot, however, with a modern cv21, as a dedicated wide-angle camera, alongside my m2. the small voigtlander lenses don't look out of place, in my opinion, on the older leicas. david", "sortedWord": "None", "Identifyer": null, "identifyer": 39465, "year": "2007"}, {"autor": "Johannes Knightworth", "date": "2007-03-24 08:56:00", "content": "I have just finished developing a roll of APX100 and a roll of Tri-x rated at 200asa and developed in Rodinal semi-stand process. I methodically made the shot with the 50 elmars, red and black ring and the 90 Elmar. I haven't been able to see much yet for it's currently drying in the drying cabinet. But on first (limited) sight I think there will be some nice shots there. I made all the shots in the most \"period\" environment I could find, no cars, no highly fashionable dressed people, no new current technological stuff etc. This to see if the period style can be replicated easily. Later I will make some proofs on warmtone paper and print the most becoming shots on Baryt and if possible will try and Lith. some, perhaps in a copper toning process..... but this needs to be seen first. I was yet again reminded of how difficult it is nowadys to make a picture without any sign of the current time, there are always cars, mopeds, cables, electrical stuff to be found in streets and alleys which would otherwise look so quaint, a well not really complaining here but it did all of a sudden strike me. Depending how the actual image turns out I will use the lenses and camera next week and make a reportage of middle-age art and architecture in the city of Bergamo. I could scan some negatives but I only have a slide scanner which will most certainly not bring out the actual essence of the images, and I never ever touch Photoshop. Anyway I will keep you informed. About the Xenon 1.5 ? which lens is this....", "link": "https://www.l-camera-forum.com/topic/19230-lens-for-iii-mod-f/page/2/?tab=comments#comment-210664", "origin": "L-forum", "suborigin": "19230-lens-for-iii-mod-f", "result": true, "Selector": "i methodically made", "selectorShort": "make", "MarkedSent": "i have just finished developing a roll of apx100 and a roll of tri-x rated at 200asa and developed in rodinal semi-stand process. -----> i !!!  -----> methodically !!!  -----> made !!!  the shot with the 50 elmars, red and black ring and the 90 elmar. i haven't been able to see much yet for it's currently drying in the drying cabinet. but on first (limited) sight i think there will be some nice shots there. i made all the shots in the most \"period\" environment i could find, no cars, no highly fashionable dressed people, no new current technological stuff etc. this to see if the period style can be replicated easily. later i will make some proofs on warmtone paper and print the most becoming shots on baryt and if possible will try and lith. some, perhaps in a copper toning process..... but this needs to be seen first. i was yet again reminded of how difficult it is nowadys to make a picture without any sign of the current time, there are always cars, mopeds, cables, electrical stuff to be found in streets and alleys which would otherwise look so quaint, a well not really complaining here but it did all of a sudden strike me. depending how the actual image turns out i will use the lenses and camera next week and make a reportage of middle-age art and architecture in the city of bergamo. i could scan some negatives but i only have a slide scanner which will most certainly not bring out the actual essence of the images, and i never ever touch photoshop. anyway i will keep you informed. about the xenon 1.5 ? which lens is this....", "sortedWord": "None", "Identifyer": null, "identifyer": 39480, "year": "2007"}, {"autor": "j. borger", "date": "2007-08-24 15:29:00", "content": "Which of the lenses in the actual Leica portfolio is the most Leica like one? Glow et cetera... I am afraid from the current lens line-up only the Noctilux has the \"older Leica fingerprint\" you seem refering to. I would look for a 35 or 50 lux pre-asph as long as they are available in minty condition. The 50 lux pre-asph is still new in box available at several places. Yes .... you most likely have to buy 2nd hand if you want the old leica look ... and then we could make a long list of glowing lenses with the older fingerprint --img-- ", "link": "https://www.l-camera-forum.com/topic/31824-most-leica-like-lens/?tab=comments#comment-337114", "origin": "L-forum", "suborigin": "31824-most-leica-like-lens", "result": true, "Selector": "we could make", "selectorShort": "make", "MarkedSent": "which of the lenses in the actual leica portfolio is the most leica like one? glow et cetera... i am afraid from the current lens line-up only the noctilux has the \"older leica fingerprint\" you seem refering to. i would look for a 35 or 50 lux pre-asph as long as they are available in minty condition. the 50 lux pre-asph is still new in box available at several places. yes .... you most likely have to buy 2nd hand if you want the old leica look ... and then -----> we !!!  -----> could !!!  -----> make !!!  a long list of glowing lenses with the older fingerprint --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 86190, "year": "2007"}, {"autor": "leicapfile", "date": "2007-08-25 04:41:00", "content": "Leica glow? Like Sean I don't think there is one, but they, at least up to the modern Leica lenses, certainly had a different 'look'. And what rigorus scientific tests ala Puts and Reid did I employ? The 'Hormone' test of course! You see, back in the late 50's I was entrusted to run the old B&W Pako film machine at Pfile's Photo Service, the family business. During each run, the 135 film was always loaded last, as we had to chamois the 135s as they came out in the light before they hit the infrared heating lamps. Over time, I began to notice two things that caused more than average attention to the film. The first was that every once in awhile, there passed some VERY interesting images for a young teenaged male. These were set aside for a little contact and enlarging after all the film was processed. Secondly, some of the 135 films had what could only be described as a different 'look'. In reality, it was simply one of contrast and sharpness differences that separated them. I can recall asking my Dad what was happening here (about the sharpness and contrast of course). His reply was '....they were probably shot with a Leica'. I saved for a few months and promptly purchased a IIIf BD and 50mm ridgid Summicron LTM we had taken in on trade at our retail store. $140 and I was making 85 cents an hour at the time, but Dad was right. Jerry", "link": "https://www.l-camera-forum.com/topic/31824-most-leica-like-lens/page/2/?tab=comments#comment-337450", "origin": "L-forum", "suborigin": "31824-most-leica-like-lens", "result": true, "Selector": "i was making", "selectorShort": "make", "MarkedSent": "leica glow? like sean i don't think there is one, but they, at least up to the modern leica lenses, certainly had a different 'look'. and what rigorus scientific tests ala puts and reid did i employ? the 'hormone' test of course! you see, back in the late 50's i was entrusted to run the old b&w pako film machine at pfile's photo service, the family business. during each run, the 135 film was always loaded last, as we had to chamois the 135s as they came out in the light before they hit the infrared heating lamps. over time, i began to notice two things that caused more than average attention to the film. the first was that every once in awhile, there passed some very interesting images for a young teenaged male. these were set aside for a little contact and enlarging after all the film was processed. secondly, some of the 135 films had what could only be described as a different 'look'. in reality, it was simply one of contrast and sharpness differences that separated them. i can recall asking my dad what was happening here (about the sharpness and contrast of course). his reply was '....they were probably shot with a leica'. i saved for a few months and promptly purchased a iiif bd and 50mm ridgid summicron ltm we had taken in on trade at our retail store. $140 and -----> i !!!  -----> was !!!  -----> making !!!  85 cents an hour at the time, but dad -----> was !!!  right. jerry", "sortedWord": "None", "Identifyer": null, "identifyer": 86208, "year": "2007"}, {"autor": "MP3", "date": "2007-08-26 10:30:00", "content": "Mostly agree with Sean and LCT, it is 'largely' a matter of personal taste. Having said that, I got an excited suggestion. Well before we can agree what is the 'leica look', 'leica fingerprint', we can never come up with some consent on this topic. As it is also very diffcult to JUST put in words to describe what is that look, shall we starting posting pics from 'the most Leica like lens' at this thread and add our personal words why we think so =)", "link": "https://www.l-camera-forum.com/topic/31824-most-leica-like-lens/page/2/?tab=comments#comment-338325", "origin": "L-forum", "suborigin": "31824-most-leica-like-lens", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "mostly agree with sean and lct, it is 'largely' a matter of personal taste. having said that, i got an excited suggestion. well before we can agree what is the 'leica look', 'leica fingerprint', we can never -----> come !!!  -----> up !!!  -----> with !!!  some consent on this topic. as it is also very diffcult to just put in words to describe what is that look, shall we starting posting pics from 'the most leica like lens' at this thread and add our personal words why we think so =)", "sortedWord": "None", "Identifyer": null, "identifyer": 86224, "year": "2007"}, {"autor": "sean_reid", "date": "2007-08-26 12:07:00", "content": "OK guys but we all know that the pictures we take with lenses from the sixties or the eightees have not the same look as those we get with aspheric's don't we. There are obviously differences... Yes, I made a similar comment above. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/31824-most-leica-like-lens/page/2/?tab=comments#comment-338427", "origin": "L-forum", "suborigin": "31824-most-leica-like-lens", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "ok guys but we all know that the pictures we take with lenses from the sixties or the eightees have not the same look as those we get with aspheric's don't we. there are obviously differences... yes, -----> i !!!  -----> made !!!  a similar comment above. cheers, sean", "sortedWord": "None", "Identifyer": null, "identifyer": 86226, "year": "2007"}, {"autor": "fastdap@mac.com", "date": "2007-02-06 03:30:00", "content": "Alan, I use the Noctilux almost exclusively! I have shot the Noctilux in both of it's variants since it was first made (1966 f1.2) I made an entire carrer out of the Noctilux shooting fashion. There was a time in Italy when it was all I would shoot! I would carry an M2 with the Noctilux around my neck and when asked by the magazine art directors/editors what I wanted to shoot, I would reply \"anyhting I can shoot with this\" while pointing the the camera around my neck. It is big, heavy, obstructs the viewfinder, hard to focus, and the best lens Leica/Leitz has ever made! Maybe not on the bench but in the real world. It is unique and beautiful. Best of luck, mark", "link": "https://www.l-camera-forum.com/topic/15378-how-often-do-you-use-your-noctilux/?tab=comments#comment-163021", "origin": "L-forum", "suborigin": "15378-how-often-do-you-use-your-noctilux", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "alan, i use the noctilux almost exclusively! -----> i !!!  have shot the noctilux in both of it's variants since it was first -----> made !!!  (1966 f1.2) -----> i !!!  -----> made !!!  an entire carrer out of the noctilux shooting fashion. there was a time in italy when it was all i would shoot! i would carry an m2 with the noctilux around my neck and when asked by the magazine art directors/editors what i wanted to shoot, i would reply \"anyhting i can shoot with this\" while pointing the the camera around my neck. it is big, heavy, obstructs the viewfinder, hard to focus, and the best lens leica/leitz has ever made! maybe not on the bench but in the real world. it is unique and beautiful. best of luck, mark", "sortedWord": "None", "Identifyer": null, "identifyer": 94998, "year": "2007"}, {"autor": "etienne_werner", "date": "2007-03-18 18:14:00", "content": "Well Just got back from testing and buying the Summicron 90mm. It is a Canadian buildt lens. It feels great but is very difficult to focus properly. My eye sight is in need of the 1.25 X magnifier. When I do get it in focus, it is very sharp. I haven't had any flares yet. As far as the price is concerned.... Yes I probably paid to much. I had already talk the price down from 850 to 780 euro's and after reading here that it might still be to much, I intended to negotiate it further. Well at least that was the idea. When I found out that the photographer selling the lens was working as a navy photographer (covering Afghanistan and Iraq) with whom my agency has many dealings, I just left the price as agreed before. Here is a picture which I made with the new lens at the beach. As you can see there is quite a heavy storm. Thanks all for the great advise. Kind regards, Etienne --img-- ", "link": "https://www.l-camera-forum.com/topic/19097-need-advise-2090mm-summicron-m/?tab=comments#comment-205152", "origin": "L-forum", "suborigin": "19097-need-advise-2090mm-summicron-m", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "well just got back from testing and buying the summicron 90mm. it is a canadian buildt lens. it feels great but is very difficult to focus properly. my eye sight is in need of the 1.25 x magnifier. when i do get it in focus, it is very sharp. i haven't had any flares yet. as far as the price is concerned.... yes i probably paid to much. i had already talk the price down from 850 to 780 euro's and after reading here that it might still be to much, i intended to negotiate it further. well at least that was the idea. when i found out that the photographer selling the lens was working as a navy photographer (covering afghanistan and iraq) with whom my agency has many dealings, i just left the price as agreed before. here is a picture which -----> i !!!  -----> made !!!  with the new lens at the beach. as you can see there is quite a heavy storm. thanks all for the great advise. kind regards, etienne --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 95056, "year": "2007"}, {"autor": "etienne_werner", "date": "2007-03-21 18:14:00", "content": "Well so far I'm starting to like this lens at lot. Here is a shot I made of a fellow photographer while having a drink at the local pub. 90mm summicron at full opening --img--  Regards, Etienne", "link": "https://www.l-camera-forum.com/topic/19097-need-advise-2090mm-summicron-m/page/2/?tab=comments#comment-208099", "origin": "L-forum", "suborigin": "19097-need-advise-2090mm-summicron-m", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "well so far i'm starting to like this lens at lot. here is a shot -----> i !!!  -----> made !!!  of a fellow photographer while having a drink at the local pub. 90mm summicron at full opening --img--  regards, etienne", "sortedWord": "None", "Identifyer": null, "identifyer": 95065, "year": "2007"}, {"autor": "Michiel Fokkema", "date": "2007-10-12 10:17:00", "content": "Hi, I have the manual. When I have time this weekend I'll make a scan and sent it to you. I also have the meter cell but that I will keep myself:-) Best regards, Michiel Fokkema", "link": "https://www.l-camera-forum.com/topic/35515-manual-for-focometer-2/?tab=comments#comment-374883", "origin": "L-forum", "suborigin": "35515-manual-for-focometer-2", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "hi, i have the manual. when -----> i !!!  have time this weekend -----> i !!! -----> 'll !!!  -----> make !!!  a scan and sent it to you. i also have the meter cell but that i will keep myself:-) best regards, michiel fokkema", "sortedWord": "None", "Identifyer": null, "identifyer": 98788, "year": "2007"}, {"autor": "icura 0-)", "date": "2007-03-04 20:32:00", "content": "Greetings, This is my very first post in the Leica Forums! Well, here goes. 1. Shoot lots of photographs. With attitude. Sorry, that is just me. Shoot some more. Take a break and have a beer. Shoot some more. Oh yes, then shoot some more. Just when you think you have got your subject covered, shoot a couple of more variations. What the heck, its digital right? And if its film, so what? Film is cheap compared to your camera. 2. From a philosophical standpoint, I view myself as a photographer first, and darkroom or digital technician second, so I make a very conscious effort to put much more time into shooting than in the darkroom or sitting at my computer doing postprocessing. 3. This means that I immediately download my digital photographs onto an external hard drive that is partitioned (so as to optimize its speed). I make new folders for each year, and sub-folders for each month. Just about everything is placed into the month folders. 4. If I shoot a specific project, it gets its own folder with a name that easily identifies it. All of the images then go into that folder. 5. I don't have enough hours in the day to do all the shooting that I want to do, so after the photographs are archived, I just leave them until I need them. I burn all of the folders onto an archival Mitsui DVD-R disc, then duplicate this disc. I keep one disc at home and one at work. This is my archival protocol, the discs at home are the work discs andd the duplicates at work never see a computer and are pristine. 6. Whenever I need an image or group of images I edit via Bridge in PS2, but will soon change this part of my workflow to Lightroom, because it seems to work a bit better than Aperture. 7. This workflow works really well for me because I don't spend a lot of time with the photos on the computer until I use them, plus it is really, really FAST. I shoot a fairly large volume of photographs on a regular basis, both RAW and Jpegs, so this workflow goes along at a brisk pace. Thanks. More time for beer at the end of the day!", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/?tab=comments#comment-189946", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "greetings, this is my very first post in the leica forums! well, here goes. 1. shoot lots of photographs. with attitude. sorry, that is just me. shoot some more. take a break and have a beer. shoot some more. oh yes, then shoot some more. just when you think you have got your subject covered, shoot a couple of more variations. what the heck, its digital right? and if its film, so what? film is cheap compared to your camera. 2. from a philosophical standpoint, -----> i !!!  view myself as a photographer first, and darkroom or digital technician second, so -----> i !!!  -----> make !!!  a very conscious effort to put much more time into shooting than in the darkroom or sitting at my computer doing postprocessing. 3. this means that i immediately download my digital photographs onto an external hard drive that is partitioned (so as to optimize its speed). i make new folders for each year, and sub-folders for each month. just about everything is placed into the month folders. 4. if i shoot a specific project, it gets its own folder with a name that easily identifies it. all of the images then go into that folder. 5. i don't have enough hours in the day to do all the shooting that i want to do, so after the photographs are archived, i just leave them until i need them. i burn all of the folders onto an archival mitsui dvd-r disc, then duplicate this disc. i keep one disc at home and one at work. this is my archival protocol, the discs at home are the work discs andd the duplicates at work never see a computer and are pristine. 6. whenever i need an image or group of images i edit via bridge in ps2, but will soon change this part of my workflow to lightroom, because it seems to work a bit better than aperture. 7. this workflow works really well for me because i don't spend a lot of time with the photos on the computer until i use them, plus it is really, really fast. i shoot a fairly large volume of photographs on a regular basis, both raw and jpegs, so this workflow goes along at a brisk pace. thanks. more time for beer at the end of the day!", "sortedWord": "None", "Identifyer": null, "identifyer": 111395, "year": "2007"}, {"autor": "holgerf", "date": "2007-03-11 17:16:00", "content": "I'm very interested in this method. So I tried convert to DNG file from M8 data .Import is OK. But preview is gray.Click a Preview,then APERTURE warning \"not support this file\".--img-- Are there any hints? Adobe DNG Converter 3.7 Aperture 1.52 Mac OS-X 10.4.8 PowerMac G5 Dual 2Ghz uni from Tokyo JAPAN Sorry Uni, I made a mistake in my post. There is a PREDICTION to this method which I forgot to mention. It requires a small and easy hack to make APERTURE recognize the file on the base of a Nikon D200 file. The hack was posted by Eoin and you find the procedure here: http://www.leica-camera-user.com/digital-forum/16559-how-use-aperture-m8-dng-files-4.html?highlight=leica+nikon+aperture#post173078 I tried it and many people did also. It seams to work fine in the most cases. There are some concerns because if you manipulate the imported file in Aperture the results are a bit different from manipulating a file that has been converted to TIFF via Capture One. To be on the safe side it may be a good idea to have a backup of the original DNG files from the M8. So you can use them whenever there is an Aperture-update to M8 which will come TMHO. If you want to I could mail you the manipulated file \"Raw.plist \". Best Holger", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/?tab=comments#comment-197217", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i'm very interested in this method. so i tried convert to dng file from m8 data .import is ok. but preview is gray.click a preview,then aperture warning \"not support this file\".--img-- are there any hints? adobe dng converter 3.7 aperture 1.52 mac os-x 10.4.8 powermac g5 dual 2ghz uni from tokyo japan sorry uni, -----> i !!!  -----> made !!!  a mistake in my post. there is a prediction to this method which i forgot to mention. it requires a small and easy hack to make aperture recognize the file on the base of a nikon d200 file. the hack was posted by eoin and you find the procedure here: http://www.leica-camera-user.com/digital-forum/16559-how-use-aperture-m8-dng-files-4.html?highlight=leica+nikon+aperture#post173078 i tried it and many people did also. it seams to work fine in the most cases. there are some concerns because if you manipulate the imported file in aperture the results are a bit different from manipulating a file that has been converted to tiff via capture one. to be on the safe side it may be a good idea to have a backup of the original dng files from the m8. so you can use them whenever there is an aperture-update to m8 which will come tmho. if you want to i could mail you the manipulated file \"raw.plist \". best holger", "sortedWord": "None", "Identifyer": null, "identifyer": 111404, "year": "2007"}, {"autor": "morffin", "date": "2007-03-12 09:02:00", "content": "SC card to desktop folder Folder to I View Media Pro for editing and naming + meta data PS Bridge to correct color/exp ... PS image proc. create web gallery using I View Burn disc for client....burn b/u disc Write fat invoice take daughter to park PS...Ive had my M8 for about a month and it froze a couple of times until I did the battery fix.... camera has worked like a charm since. Took it on an assignment for the first time last week... worked flawlesly.....except I forgot to synch the time on the Leica and the Canon 5D...ended up wasting a lot of time getting the shots in order. Any tips on how to match the color from the Canon and Leica files? I am new to this forum and have learned a lot from you folks...thanks.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/?tab=comments#comment-197862", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "sc card to desktop folder folder to i view media pro for editing and naming + meta data ps bridge to correct color/exp ... ps image proc. -----> create !!!  web gallery using i view burn disc for client....burn b/u disc write fat invoice take daughter to park ps...ive had my m8 for about a month and it froze a couple of times until i did the battery fix.... camera has worked like a charm since. took it on an assignment for the first time last week... worked flawlesly.....except i forgot to synch the time on the leica and the canon 5d...ended up wasting a lot of time getting the shots in order. any tips on how to match the color from the canon and leica files? i am new to this forum and have learned a lot from you folks...thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 111405, "year": "2007"}, {"autor": "uni", "date": "2007-03-12 13:44:00", "content": "Sorry Uni, I made a mistake in my post. There is a PREDICTION to this method which I forgot to mention. It requires a small and easy hack to make APERTURE recognize the file on the base of a Nikon D200 file. The hack was posted by Eoin and you find the procedure here: http://www.leica-camera-user.com/digital-forum/16559-how-use-aperture-m8-dng-files-4.html?highlight=leica+nikon+aperture#post173078 I tried it and many people did also. It seams to work fine in the most cases. There are some concerns because if you manipulate the imported file in Aperture the results are a bit different from manipulating a file that has been converted to TIFF via Capture One. To be on the safe side it may be a good idea to have a backup of the original DNG files from the M8. So you can use them whenever there is an Aperture-update to M8 which will come TMHO. If you want to I could mail you the manipulated file \"Raw.plist \". Best Holger Thanks Mr.hfehsenfeld I could manipulate a M8 file by APERTURE.--img-- It is a wonderful method. I usually converted TIFF by C1PRO, and was reading it by APERTURE. Thanks!!!", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/?tab=comments#comment-198061", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "sorry uni, -----> i !!!  -----> made !!!  a mistake in my post. there is a prediction to this method which i forgot to mention. it requires a small and easy hack to make aperture recognize the file on the base of a nikon d200 file. the hack was posted by eoin and you find the procedure here: http://www.leica-camera-user.com/digital-forum/16559-how-use-aperture-m8-dng-files-4.html?highlight=leica+nikon+aperture#post173078 i tried it and many people did also. it seams to work fine in the most cases. there are some concerns because if you manipulate the imported file in aperture the results are a bit different from manipulating a file that has been converted to tiff via capture one. to be on the safe side it may be a good idea to have a backup of the original dng files from the m8. so you can use them whenever there is an aperture-update to m8 which will come tmho. if you want to i could mail you the manipulated file \"raw.plist \". best holger thanks mr.hfehsenfeld i could manipulate a m8 file by aperture.--img-- it is a wonderful method. i usually converted tiff by c1pro, and was reading it by aperture. thanks!!!", "sortedWord": "None", "Identifyer": null, "identifyer": 111406, "year": "2007"}, {"autor": "ajthornbury", "date": "2007-03-30 21:14:00", "content": "--img--  Work flow:- I use Windows XP. 1. Remove card from camera. 2. Create folder using Windows Explorer. 3. Using Card reader transfer images ( jpeg) from camera to newly created folder. 4. Using PaintShop Pro 9, browse folder and delete unwanted images. 5. Make back up copy on external hard drive. 6. Replace card in camera and delete images ready for next shoot. 7. Work on images if required at leisure and print as required using Epson printer and materials. 8. Mount any specials ready for exhib.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/2/?tab=comments#comment-216418", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "--img--  work flow:- i use windows xp. 1. remove card from camera. 2. -----> create !!!  folder using windows explorer. 3. using card reader transfer images ( jpeg) from camera to newly created folder. 4. using paintshop pro 9, browse folder and delete unwanted images. 5. make back up copy on external hard drive. 6. replace card in camera and delete images ready for next shoot. 7. work on images if required at leisure and print as required using epson printer and materials. 8. mount any specials ready for exhib.", "sortedWord": "None", "Identifyer": null, "identifyer": 111408, "year": "2007"}, {"autor": "Woody Campbell", "date": "2007-04-08 17:30:00", "content": "Firstly and most importantly in my view is to get a dvd of the DNG files burnt before you even consider messing ,processing, converting or anything thereafter, it is so important to get the origionals burnt i cant believe nobody so far does that, i never throw away any images I have shot until i have this first copy, having recently gone through all my work from the past 10 years in order to formulate a website those images you might have binned now do creep out and bite you sometimes, for the price of a dvd you can and i recommend keep everything you shoot. I buy hard drives in pairs - one for primary use and one for backup. I dedicate a hard drive and backup to each year 1. Create a new session in C1 for the job/subject/month. 2. Mount the card from the camera and drag the files (always all raws) to the \"captures\" folder for the session. 3. Copy the folder for the session onto the backup drive. 4. Remove the card and format it in the camera. 5. In C1 identify clear non-keepers and move to trash. 6. Page through images in C1. Default profile=JFI Ilford Delta 400 (all of my work is B&W); default sharpening=soft look; default noise=all the way left. Process as 16 bit tiffs. If I have a high volume project do cropping in C1 and additionally process as jpegs. 7. Edit and process. 8. Open the session's processed folder in Bridge. 9. Drag any images that need to be stitched to PTGui. Save stiched16-bit tiffs to a folder in the session folder called \"stitches\". I do a lot of these. 10. Open tiffs (stiched as well as conversions that didn't need stitching) in PS from Bridge. Edit and save as psds in a folder titled \"grays\". In the process print selected images as a sanity check. 11. Delete intermediate files in the stitching process - they take up enormous space and can be reproduced at will. Move contents of session tash to mac trash. Pour drink as I review prints.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/2/?tab=comments#comment-223236", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "firstly and most importantly in my view is to get a dvd of the dng files burnt before you even consider messing ,processing, converting or anything thereafter, it is so important to get the origionals burnt i cant believe nobody so far does that, i never throw away any images i have shot until i have this first copy, having recently gone through all my work from the past 10 years in order to formulate a website those images you might have binned now do creep out and bite you sometimes, for the price of a dvd you can and i recommend keep everything you shoot. i buy hard drives in pairs - one for primary use and one for backup. i dedicate a hard drive and backup to each year 1. -----> create !!!  a new session in c1 for the job/subject/month. 2. mount the card from the camera and drag the files (always all raws) to the \"captures\" folder for the session. 3. copy the folder for the session onto the backup drive. 4. remove the card and format it in the camera. 5. in c1 identify clear non-keepers and move to trash. 6. page through images in c1. default profile=jfi ilford delta 400 (all of my work is b&w); default sharpening=soft look; default noise=all the way left. process as 16 bit tiffs. if i have a high volume project do cropping in c1 and additionally process as jpegs. 7. edit and process. 8. open the session's processed folder in bridge. 9. drag any images that need to be stitched to ptgui. save stiched16-bit tiffs to a folder in the session folder called \"stitches\". i do a lot of these. 10. open tiffs (stiched as well as conversions that didn't need stitching) in ps from bridge. edit and save as psds in a folder titled \"grays\". in the process print selected images as a sanity check. 11. delete intermediate files in the stitching process - they take up enormous space and can be reproduced at will. move contents of session tash to mac trash. pour drink as i review prints.", "sortedWord": "None", "Identifyer": null, "identifyer": 111409, "year": "2007"}, {"autor": "MartinL", "date": "2007-08-19 04:39:00", "content": "I shoot only RAW and on two different systems. I do no in-camera processing. My work (unfortunately) requires dSLR and some pretty big, weighty lenses. I got my M8 about the same time I upgraded from CS to CS3, which has made the workflow much more pleasant. I download via Bridge with pretty simple filing requirements, Date, \"Custom\" (event) name, and sequential numbering. I like to take at least several days with the photos before doing any processing. Occasionally, I can't do this for my work photos, but usually I can. This time allows me to make several passes through the photos, each time dumping a few more. Sometimes, if other people are available, I'll ask for their impressions. I admire the stamina of those who will (or must) spend an entire night doing this work, but initial editing, IMO, is the most important step; visual overload and premature (or just plain poor) judgments are responsible for lots of lost pictures, and for many poor shots seeing the light of day. After selection/editing, I do a relatively fast WB, exposure correction, and maybe more before going to PS. There, I often do some curve adjust, resize, sharpen. I typically do not crop now. At this stage, I resize to 72 (maybe 96) and (typically) a 10\" high and 6+\" portrait and 13+\" landscape. This, sets up my second stage of decision-making. The sized pics are shared with family or colleagues via email or website. From these, I decide on promising candidates for more processing attention, posting, and/or printing. Once decided on these latter, I return to the DNG file and do more careful work----start to finish.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/2/?tab=comments#comment-332726", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "me to make", "selectorShort": "make", "MarkedSent": "i shoot only raw and on two different systems. i do no in-camera processing. my work (unfortunately) requires dslr and some pretty big, weighty lenses. i got my m8 about the same time i upgraded from cs to cs3, which has made the workflow much more pleasant. i download via bridge with pretty simple filing requirements, date, \"custom\" (event) name, and sequential numbering. i like to take at least several days with the photos before doing any processing. occasionally, i can't do this for my work photos, but usually i can. this time allows -----> me !!!  -----> to !!!  -----> make !!!  several passes through the photos, each time dumping a few more. sometimes, if other people are available, i'll ask for their impressions. i admire the stamina of those who will (or must) spend an entire night doing this work, but initial editing, imo, is the most important step; visual overload and premature (or just plain poor) judgments are responsible for lots of lost pictures, and for many poor shots seeing the light of day. after selection/editing, i do a relatively fast wb, exposure correction, and maybe more before going to ps. there, i often do some curve adjust, resize, sharpen. i typically do not crop now. at this stage, i resize to 72 (maybe 96) and (typically) a 10\" high and 6+\" portrait and 13+\" landscape. this, sets up my second stage of decision-making. the sized pics are shared with family or colleagues via email or website. from these, i decide on promising candidates for more processing attention, posting, and/or printing. once decided on these latter, i return to the dng file and do more careful work----start to finish.", "sortedWord": "None", "Identifyer": null, "identifyer": 111424, "year": "2007"}, {"autor": "alastair", "date": "2007-12-21 23:09:00", "content": "G'day all, I'm interested that not many of you do as I am doing, so here goes: • Shoot all in DNG raw on R9 or M8 and ORF on the 510. • Remove card and use card reader to download to Lightroom. Instead of making a folder with the shoot name etc, I make sure I put in plenty of keywords at the time of importation. I usually import onto the MacPro laptop because that it what I travel with and its easy around the house anyway • Fast sort: ie get rid of any duds. I don't like to make too many decisions at the first pass, but on this pass, I delete inappropriate keywords (I find it faster to delete them than to add them later) and often start the image clean up: LR is great for doing this as you can always return to base. I will often use the copy and paste alterations to speed up changes on similar images and to keep the \"look\" consistent. • When I come back, I rate and label, add titles and captions and then walk away again • Finally decision time. Save/remove the images and do some final editing of the images: crop/levels/colour balance/exposure/etc • I now make sure the exif date and metadata is all attached to the images and transfer them to my desk top Mac for storage on the RAID Cheers and Merry Christmas", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/3/?tab=comments#comment-432533", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "g'day all, i'm interested that not many of you do as i am doing, so here goes: • shoot all in dng raw on r9 or m8 and orf on the 510. • remove card and use card reader to download to lightroom. instead of making a folder with the shoot name etc, -----> i !!!  -----> make !!!  sure -----> i !!!  put in plenty of keywords at the time of importation. i usually import onto the macpro laptop because that it what i travel with and its easy around the house anyway • fast sort: ie get rid of any duds. i don't like to make too many decisions at the first pass, but on this pass, i delete inappropriate keywords (i find it faster to delete them than to add them later) and often start the image clean up: lr is great for doing this as you can always return to base. i will often use the copy and paste alterations to speed up changes on similar images and to keep the \"look\" consistent. • when i come back, i rate and label, add titles and captions and then walk away again • finally decision time. save/remove the images and do some final editing of the images: crop/levels/colour balance/exposure/etc • i now make sure the exif date and metadata is all attached to the images and transfer them to my desk top mac for storage on the raid cheers and merry christmas", "sortedWord": "None", "Identifyer": null, "identifyer": 111432, "year": "2007"}, {"autor": "ericperlberg", "date": "2007-04-10 10:37:00", "content": "I'm hopeless with even the simplist diy stuff and I'm just blown away at your skill in pulling this off. I look forward with some apprehension to your exploration of how the M8 photographer is put together.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224558", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm hopeless with even the simplist diy stuff and i'm just blown away at your -----> skill !!!  in pulling this off.", "sortedWord": "skill", "Identifyer": null, "identifyer": 45383, "year": "2007"}, {"autor": "Guest s.m.e.p.", "date": "2007-10-17 09:54:00", "content": "Hi Stefan Wow thats a lot of film. Do you process it yourself.--img--  TomR:D Hello Tom, I used slide films, so I didn´t develop them myself. But scanning is a lot of work, too! --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/2/?tab=comments#comment-378728", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": false, "Selector": "i didn´t develop", "selectorShort": "develop", "MarkedSent": "d hello tom, i used slide -----> films !!! , so i didn´t develop them myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 48721, "year": "2007"}, {"autor": "Thomasru", "date": "2007-10-18 16:18:00", "content": "Hello Tom, I used slide films, so I didn´t develop them myself. But scanning is a lot of work, too! --img--  Hi Stefan Thought I could see slide film, I asked because guys I know who used to develop slide film complain they can no longer get chemicals ( or its very expensive) and not worth doing it at home. Have you ever used Fuji Sensia and scanned it, I'm at a cross roads where the club I belong to are 98% digital and talk of dropping slide entries --img--  in club comps, crops up from time to time (like presently). I'd like to keep on slides but may have to scan them sooner or later:rolleyes: I have just had 3 rolls developed and scanned and the cost for mid level scanning makes me think I'd be better in the long term buying a scanner:D But which.? I hear Sensia is not easily scanned on a lot of scanners that are in my budget. TomR", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/2/?tab=comments#comment-379769", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": false, "Selector": "i didn´t develop", "selectorShort": "develop", "MarkedSent": "hello tom, i used slide -----> films !!! , so i didn´t develop them myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 48724, "year": "2007"}], "name": "Leicasortedout2007"}