{"interestingcomments": [{"autor": "carstenw", "date": "2009-09-28 22:05:00", "content": "Well, I love the old Noctilux and will buy one when I can, and I would like to test the new one, but will not buy it: too expensive. Still, the photos I have seen made with the new one look awesome, and I don't see the loss of soul at all that some are talking about. Perhaps some examples could be posted, rather than just talk?", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/2/?tab=comments#comment-1053816", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i have seen made", "selectorShort": "make", "MarkedSent": "well, i love the old noctilux and will buy one when i can, and i would like to test the new one, but will not buy it: too expensive. still, the photos -----> i !!!  -----> have !!!  -----> seen !!!  -----> made !!!  with the new one look awesome, and -----> i !!!  don't see the loss of soul at all that some are talking about. perhaps some examples could be posted, rather than just talk?", "sortedWord": "None", "Identifyer": null, "identifyer": 35487, "year": "2009"}, {"autor": "haribo", "date": "2009-09-29 15:04:00", "content": "It is possible that just my copy or maybe just some suffer from focus shift. If I cant get consistent focus with a lens than it leads to worse images. Thats how I see it. Some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. To talk with your words: if I get consistently better results with one golf club compared to another one than I just use the one I get the better results with. If I get good results with 4 golf clubs but only here and then with the fifth I assume it´s the club and not my game. Again, if you and others get good reliable results with the Noctilux on a digital M without any focus shift- great, I tried for about 1 year (including sending the lens to Solms) and finally gave up. Regards, Tom Maybe I should have made a bigger line space between the first and second part of my post. Only the first sentence was directed at you. I feel sorry for your misfortune with your Nocti but it is not a general problem with this lens. That's all I meant saying. The second part was not directed at you. It was merely a general observation.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1054621", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i should have made", "selectorShort": "make", "MarkedSent": "it is possible that just my copy or maybe just some suffer from focus shift. if i cant get consistent focus with a lens than it leads to worse images. thats how i see it. some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. to talk with your words: if i get consistently better results with one golf club compared to another one than i just use the one i get the better results with. if i get good results with 4 golf clubs but only here and then with the fifth i assume it´s the club and not my game. again, if you and others get good reliable results with the noctilux on a digital m without any focus shift- great, i tried for about 1 year (including sending the lens to solms) and finally gave up. regards, tom maybe -----> i !!!  -----> should !!!  -----> have !!!  -----> made !!!  a bigger line space between the first and second part of my post. only the first sentence was directed at you. i feel sorry for your misfortune with your nocti but it is not a general problem with this lens. that's all i meant saying. the second part was not directed at you. it was merely a general observation.", "sortedWord": "None", "Identifyer": null, "identifyer": 35508, "year": "2009"}, {"autor": "Nikkor AIS", "date": "2009-12-01 00:39:00", "content": "You know sometimes when you wish for something for a long time and you finally get it, you're disappointed. Not so with my Noctilux 50 1.0. It's been glued to my M3 since I got it about a month ago from KEH (thanks Arthur). I love it so much. The only complaint is not having 1/8000 on my M3/M6. And I haven't been able to locate at ND 6X as of yet. So I'm making do with a 60 polarizer:rolleyes:. I have not scanned the slow negs I've taken with the Noct, but many examples are up on my SmugMug site with XP-2. Almost all were taken at 1.0. I even tested it on the M9:D. At any rate, I'm pleasantly surprised at the performance at 8 1/2-11 and have no hesitation in using the Noctilux as a normal lens. Compared to the Canon 50 1.0 AF the Noctilux 50 1.0 is petite. My only problem focusing has been in some occasions where I couldn't back up any more and the my son wouldn't move further away. If find the Lecia M rangefinders accuracy to be perfect on my M3/M6. Gregory SmugMug Photo & Video Sharing. You look better here. Edited December 1, 2009 by Nikkor AIS", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/5/?tab=comments#comment-1135932", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "you know sometimes when you wish for something for a long time and you finally get it, you're disappointed. not so with my noctilux 50 1.0. it's been glued to my m3 since i got it about a month ago from keh (thanks arthur). i love it so much. the only complaint is not having 1/8000 on my m3/m6. and i haven't been able to locate at nd 6x as of yet. so -----> i !!! 'm -----> making !!!  do with a 60 polarizer:rolleyes:. i have not scanned the slow negs i've taken with the noct, but many examples are up on my smugmug site with xp-2. almost all were taken at 1.0. i even tested it on the m9:d. at any rate, i'm pleasantly surprised at the performance at 8 1/2-11 and have no hesitation in using the noctilux as a normal lens. compared to the canon 50 1.0 af the noctilux 50 1.0 is petite. my only problem focusing has been in some occasions where i couldn't back up any more and the my son wouldn't move further away. if find the lecia m rangefinders accuracy to be perfect on my m3/m6. gregory smugmug photo & video sharing. you look better here. edited december 1, 2009 by nikkor ais", "sortedWord": "None", "Identifyer": null, "identifyer": 35557, "year": "2009"}, {"autor": "gravastar", "date": "2009-12-01 01:33:00", "content": "............... And I haven't been able to locate at ND 6X as of yet. So I'm making do with a 60 polarizer:rolleyes:. ..................................Gregory SmugMug Photo & Video Sharing. You look better here. You can get 58mm and 60mm ND filters from Foto Huppert in germany. I've some on order for my f1.0 Noctilux and have recently received some Series 7 MRC coated ones, they're very well made. Here are the catalog numbers which you can enter into the site's search engine to find them. They also have slim and silver versions. Density __ Stops __ 58mm _____ 60mm 0.3 _______ 1 ____ 958,101 ____ 960,101 0.6 _______ 2 ____ 958,102 ____ A60102 0.9 _______ 3 ____ 958,103 ____ 960,103 1.8 _______ 6 ____ 958,106 ____ 960,106 3.0 ______ 10 ____ 958,110 ____ 960,110 All are coated but not all may be MRC. There's additional information in post #17 of this thread. Bob.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/5/?tab=comments#comment-1135971", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "............... and i haven't been able to locate at nd 6x as of yet. so -----> i !!! 'm -----> making !!!  do with a 60 polarizer:rolleyes:. ..................................gregory smugmug photo & video sharing. you look better here. you can get 58mm and 60mm nd filters from foto huppert in germany. i've some on order for my f1.0 noctilux and have recently received some series 7 mrc coated ones, they're very well made. here are the catalog numbers which you can enter into the site's search engine to find them. they also have slim and silver versions. density __ stops __ 58mm _____ 60mm 0.3 _______ 1 ____ 958,101 ____ 960,101 0.6 _______ 2 ____ 958,102 ____ a60102 0.9 _______ 3 ____ 958,103 ____ 960,103 1.8 _______ 6 ____ 958,106 ____ 960,106 3.0 ______ 10 ____ 958,110 ____ 960,110 all are coated but not all may be mrc. there's additional information in post #17 of this thread. bob.", "sortedWord": "None", "Identifyer": null, "identifyer": 35558, "year": "2009"}, {"autor": "ericperlberg", "date": "2009-10-22 13:16:00", "content": "Thank you for your advice dear Piero. I'm just not sure what resolution I should upload my images to my website. I don't want to slow down my website because of too large fils. Any advice would be appreciated. Birgit, I had the same reaction, your images all showed major artifacts (those rectangular like shapes in the background or solid grey areas of your images. This could be the result of too low a resolution when making them jpgs and setting them up for the web or it could be because you're heavily cropping the images initially and then enlarging the crops. Assuming you're not cropping much and the images are pretty much as they come from the camera, I would think you could resize to the size you're using now (roughly 587x473) and convert to jpg using 80% qualiity which should result in file sizes of about 35kb each which is way small enough. I routinely make my web files 10x that size. In this day and age most people who would care have speedy broadband connections. It seems a shame to undervalue your work for the sake of the few who still have dialup connections. If these images are just small areas of crop out of a much larger image then that would cause a similar problem and unfortunately that will leave you with these artifacts. You've spent far too much money on your camera to go this route with your images. If you find yourself consistently cropping to only a fraction of the original image, use a narrower angle lens or get closer to your subject. All the best for your new camera!", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/3/?tab=comments#comment-1085156", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "i routinely make", "selectorShort": "make", "MarkedSent": "thank you for your advice dear piero. i'm just not sure what resolution i should upload my images to my website. i don't want to slow down my website because of too large fils. any advice would be appreciated. birgit, i had the same reaction, your images all showed major artifacts (those rectangular like shapes in the background or solid grey areas of your images. this could be the result of too low a resolution when making them jpgs and setting them up for the web or it could be because you're heavily cropping the images initially and then enlarging the crops. assuming you're not cropping much and the images are pretty much as they come from the camera, i would think you could resize to the size you're using now (roughly 587x473) and convert to jpg using 80% qualiity which should result in file sizes of about 35kb each which is way small enough. -----> i !!!  -----> routinely !!!  -----> make !!!  my web files 10x that size. in this day and age most people who would care have speedy broadband connections. it seems a shame to undervalue your work for the sake of the few who still have dialup connections. if these images are just small areas of crop out of a much larger image then that would cause a similar problem and unfortunately that will leave you with these artifacts. you've spent far too much money on your camera to go this route with your images. if you find yourself consistently cropping to only a fraction of the original image, use a narrower angle lens or get closer to your subject. all the best for your new camera!", "sortedWord": "None", "Identifyer": null, "identifyer": 36662, "year": "2009"}, {"autor": "Bixi", "date": "2009-10-22 19:38:00", "content": "Dear Piero and Eric, Thank you both for your insight. Most of my photographs don't have hardly any cropping. I work with Lightroom. Then I import my images into iPhoto. And from iPhoto I bring them into iWeb. Maybe this isn't the best way to do things, but it works for me. I wasn't able to build my website with Lightroom. Somehow I couldn't make it work. Now I have to import my images in better resolution from LIghtroom into iPhoto. This will be my next project. Thanks again,Bixi", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/3/?tab=comments#comment-1085692", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "dear piero and eric, thank you both for your insight. most of my photographs don't have hardly any cropping. i work with lightroom. then i import my images into iphoto. and from iphoto i bring them into iweb. maybe this isn't the best way to do things, but it works for me. i wasn't able to build my website with lightroom. somehow -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it work. now i have to import my images in better resolution from lightroom into iphoto. this will be my next project. thanks again,bixi", "sortedWord": "None", "Identifyer": null, "identifyer": 36663, "year": "2009"}, {"autor": "Bill W", "date": "2009-10-08 00:35:00", "content": "I have never been a big flash user. I had an SF20 that I recently sold. I bought the SF58 when it first came out and for me......it is idiot proof flash when I need it. Straight on or bounce it does the job. Of course I am not making a living from shooting so my results may not be up to others standards. Again, I am an idiot at flash but smarter with the SF58...!!!", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/2/?tab=comments#comment-1066413", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "i am not making", "selectorShort": "make", "MarkedSent": "i have never been a big flash user. i had an sf20 that i recently sold. i bought the sf58 when it first came out and for me......it is idiot proof flash when i need it. straight on or bounce it does the job. of course -----> i !!!  -----> am !!!  -----> not !!!  -----> making !!!  a living from shooting so my results may -----> not !!!  be up to others standards. again, i am an idiot at flash but smarter with the sf58...!!!", "sortedWord": "None", "Identifyer": null, "identifyer": 37670, "year": "2009"}, {"autor": "amedick", "date": "2009-10-08 07:47:00", "content": "Maybe because of the pre-flash. Can you make several Metz working together in GNC mode with an M8? Lucien Lucien, the Metz remote \"cordless\" mode does not work with the pre-flash. I could not make the Metz flashes work together in GNC mode. Sorry, my message was not so clear, put together on an iPhone. The way I got the Metz flashes to work together was by having a \"master\" Metz flash mounted on the M8, in master / A mode, and the remote flashes in \"slave\" / TTL mode using the 3083 on the 54MZ4 or 40 Mz2 or the 70Mz standalone (it has built in functionality). In a nutshell the M8 and master interacted with each other in a classic \"A\" mode, while the remote flashes interacting with the master in the m8 in a cordless TTL mode (infrared pulses), cutting their output when signaled by the master on M8. Worked quite well, even when I hid the remote falsh behind object. The conclusion, and relevence to this thread, \"the SF-58 does not work with the classic Metz Remote system\", they look very similar (on the flash LCD's), act similar but are not compatible. I was thinking about buying a SF58 along these lines. It seems for this firmware at least, you need to use all SF-58 or all Metz if you want to try using the cordless infrared seutps, no mixing at this point of time. Some other conclusions I came to - to expensive for me to go the route of two SF58's. - the Metz remote material says that it was designed to sync the remote flashes at 1/60. I could consistently fire with M8 at 1/125 and 1/180. It also worked at 1/250, though did not try this enough to say it consistently works. - boy is the terminology in the industry, and with Metz & Leica confusing when it comes to flash, especially the way TTL, cordless, wireless, and automatic is used. It is sometime referred to in a context of a concept, other times like a protocol. -Would be nice if \"Metz\" created itself a niche and made their new flashes \"pocket wizzard\" enabled. -Wish the 76MZ series had a simple bracket / socket to mount on a tripo or lighting stand.", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/2/?tab=comments#comment-1066647", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "i could not make", "selectorShort": "make", "MarkedSent": "maybe because of the pre-flash. can you make several metz working together in gnc mode with an m8? lucien lucien, the metz remote \"cordless\" mode does not work with the pre-flash. -----> i !!!  -----> could !!!  -----> not !!!  -----> make !!!  the metz flashes work together in gnc mode. sorry, my message was not so clear, put together on an iphone. the way i got the metz flashes to work together was by having a \"master\" metz flash mounted on the m8, in master / a mode, and the remote flashes in \"slave\" / ttl mode using the 3083 on the 54mz4 or 40 mz2 or the 70mz standalone (it has built in functionality). in a nutshell the m8 and master interacted with each other in a classic \"a\" mode, while the remote flashes interacting with the master in the m8 in a cordless ttl mode (infrared pulses), cutting their output when signaled by the master on m8. worked quite well, even when i hid the remote falsh behind object. the conclusion, and relevence to this thread, \"the sf-58 does not work with the classic metz remote system\", they look very similar (on the flash lcd's), act similar but are not compatible. i was thinking about buying a sf58 along these lines. it seems for this firmware at least, you need to use all sf-58 or all metz if you want to try using the cordless infrared seutps, no mixing at this point of time. some other conclusions i came to - to expensive for me to go the route of two sf58's. - the metz remote material says that it was designed to sync the remote flashes at 1/60. i could consistently fire with m8 at 1/125 and 1/180. it also worked at 1/250, though did not try this enough to say it consistently works. - boy is the terminology in the industry, and with metz & leica confusing when it comes to flash, especially the way ttl, cordless, wireless, and automatic is used. it is sometime referred to in a context of a concept, other times like a protocol. -would be nice if \"metz\" created itself a niche and made their new flashes \"pocket wizzard\" enabled. -wish the 76mz series had a simple bracket / socket to mount on a tripo or lighting stand.", "sortedWord": "None", "Identifyer": null, "identifyer": 37675, "year": "2009"}, {"autor": "GlennB", "date": "2009-10-11 17:28:00", "content": "I will get my hands on an SC-29 to see if its sensor talks to the M8. If it does so, I'll get one and report on how it works with the M9 (when I get mine -- c'mon Leica). Bill, IF I'm reading the B&H photo description right (see below) the SC-29 cord's on camera \"sensor\" is strictly for lens autofocus assist and is called an \"illuminator\". This, to me. means it's some sort of light source (IR ?) that projects onto your shooting subject that the camera's AF sensor detects to set the focus. I don't believe that the Leica wizards have come up with an auto-focus M lens yet.--img--  \"In addition, the SC-29's AF Illuminator will also provide AF assistance to the camera in low-light conditions.\" I would really be surprised if the SC-29's \"illuminator\" acted like an on-camera \"auto flash\" (ala vivitar sensor cord) sensor on a M8 or M9. As always, I could be wrong.--img-- Glenn", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/4/?tab=comments#comment-1070928", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i will get my hands on an sc-29 to see if its sensor talks to the m8. if it does so, i'll get one and report on how it works with the m9 (when i get mine -- c'mon leica). bill, if i'm reading the b&h photo description right (see below) the sc-29 cord's on camera \"sensor\" is strictly for lens autofocus assist and is called an \"illuminator\". this, to me. means it's some sort of light source (ir ?) that projects onto your shooting subject that the camera's af sensor detects to set the focus. i don't believe that the leica wizards have -----> come !!!  -----> up !!!  -----> with !!!  an auto-focus m lens yet.--img--  \"in addition, the sc-29's af illuminator will also provide af assistance to the camera in low-light conditions.\" i would really be surprised if the sc-29's \"illuminator\" acted like an on-camera \"auto flash\" (ala vivitar sensor cord) sensor on a m8 or m9. as always, i could be wrong.--img-- glenn", "sortedWord": "None", "Identifyer": null, "identifyer": 37718, "year": "2009"}, {"autor": "Jeff S", "date": "2009-08-12 18:54:00", "content": "I must be one of the few here that rarely prints - I've printed maybe ten photos out of the hundreds that I've taken. I regularly look at the photos on screen.... maybe I should print and frame a few. This prompts me to add a bit to my earlier post. While I consider the print the ultimate result for me, I'm very selective about what I print. My LR catalog is full of \"close but no cigar\" images. This is no different than in my darkroom days, but the digital process is so much easier for me to get to the final \"proof\" stage. Further, once I print, that doesn't translate necessarily into framing. I like to \"live\" with a print for awhile to see if it still resonates over time. And, to determine if I need to edit in any way. For this purpose, I choose a few prints at a time to tack on a wall board, or place on a shelf, over some period...generally weeks or more. Only after some deliberation do I determine if a print is \"frame worthy,\" usually not for my wall, but for a gift to a friend or family member for whom the print also resonates. Many if not most don't pass my test. I made prints for family members and friends over 20 years ago, still hanging somewhere in their (sometimes different) house. And, they remember the gift far longer than anything I might have bought. Jeff PS My new ambition is to create something in book form, but that's a whole different thing, requiring lots of thought around a coherent project.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992080", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i must be one of the few here that rarely prints - i've printed maybe ten photos out of the hundreds that i've taken. i regularly look at the photos on screen.... maybe i should print and frame a few. this prompts me to add a bit to my earlier post. while i consider the print the ultimate result for me, i'm very selective about what i print. my lr catalog is full of \"close but no cigar\" images. this is no different than in my darkroom days, but the digital process is so much easier for me to get to the final \"proof\" stage. further, once i print, that doesn't translate necessarily into framing. i like to \"live\" with a print for awhile to see if it still resonates over time. and, to determine if i need to edit in any way. for this purpose, i choose a few prints at a time to tack on a wall board, or place on a shelf, over some period...generally weeks or more. only after some deliberation do i determine if a print is \"frame worthy,\" usually not for my wall, but for a gift to a friend or family member for whom the print also resonates. many if not most don't pass my test. -----> i !!!  -----> made !!!  prints for family members and friends over 20 years ago, still hanging somewhere in their (sometimes different) house. and, they remember the gift far longer than anything i might have bought. jeff ps my new ambition is to create something in book form, but that's a whole different thing, requiring lots of thought around a coherent project.", "sortedWord": "None", "Identifyer": null, "identifyer": 40726, "year": "2009"}, {"autor": "Mark Pope", "date": "2009-08-12 19:56:00", "content": "Our printer gets quite a lot of use with two of us printing work. I do love to print, but one thing that I admit to being VERY bad at is doing anything with the work once it is printed. When I go to the local camera club, I'll make A3 prints and since we've had the 3800, we've made 1 A2 print, which I have to say looks bloomin' wonderful now that it has been professionally framed and mounted. I tend not to be too adventurous with papers - when I find something I like, I tend to stick with it. Current favourites are Permajet oyster 271 and their fibre-based glossy paper, which is very nice indeed. I must be more adventurous with papers! Cheers Mark", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992147", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "our printer gets quite a lot of use with two of us printing work. i do love to print, but one thing that i admit to being very bad at is doing anything with the work once it is printed. when -----> i !!!  go to the local camera club, -----> i !!! -----> 'll !!!  -----> make !!!  a3 prints and since we've had the 3800, we've made 1 a2 print, which -----> i !!!  have to say looks bloomin' wonderful now that it has been professionally framed and mounted. i tend not to be too adventurous with papers - when i find something i like, i tend to stick with it. current favourites are permajet oyster 271 and their fibre-based glossy paper, which is very nice indeed. i must be more adventurous with papers! cheers mark", "sortedWord": "None", "Identifyer": null, "identifyer": 40730, "year": "2009"}, {"autor": "Jeff S", "date": "2009-08-12 22:05:00", "content": "an inexpensive device he bought at IKEA which you can read about on his blog: Thanks, William...perfect timing! I was just in several stores last week looking for a better, but inexpensive, way to temporarily hang potential \"winners\" in a home space I'm dedicating as an extension to my \"lightroom.\" I came up with several possible solutions, but this is definitely worth considering. Jeff PS I just moved from the Bay Area last year...sure miss the weather...but not the quakes and fires.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992287", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "an inexpensive device he bought at ikea which you can read about on his blog: thanks, william...perfect timing! i was just in several stores last week looking for a better, but inexpensive, way to temporarily hang potential \"winners\" in a home space i'm dedicating as an extension to my \"lightroom.\" i -----> came !!!  -----> up !!!  -----> with !!!  several possible solutions, but this is definitely worth considering. jeff ps i just moved from the bay area last year...sure miss the weather...but not the quakes and fires.", "sortedWord": "None", "Identifyer": null, "identifyer": 40736, "year": "2009"}, {"autor": "trs", "date": "2009-12-08 21:40:00", "content": "I don't print a lot, but purpose of every frame I shoot is someday I want to print it. Thus, I am just happy having the shots I like it OK or better and storing them aside even before processing. I usually comeback in year or so and process few and print because I seem to like the pictures more after time has passed. I have not printed beyond 12x18. But, I really want to try some bigger prints. For vacation shots, I usually make a book (blurb book) whenever I get an excuse.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/3/?tab=comments#comment-1144418", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i usually make", "selectorShort": "make", "MarkedSent": "i don't print a lot, but purpose of every frame i shoot is someday i want to print it. thus, i am just happy having the shots i like it ok or better and storing them aside even before processing. i usually comeback in year or so and process few and print because i seem to like the pictures more after time has passed. i have not printed beyond 12x18. but, i really want to try some bigger prints. for vacation shots, -----> i !!!  -----> usually !!!  -----> make !!!  a book (blurb book) whenever -----> i !!!  get an excuse.", "sortedWord": "None", "Identifyer": null, "identifyer": 40750, "year": "2009"}, {"autor": "wstotler", "date": "2009-12-09 15:44:00", "content": "I don't print a lot, but purpose of every frame I shoot is someday I want to print it. <snip> I usually comeback in year or so and process few and print because I seem to like the pictures more after time has passed. +1. Interesting thread. Three years ago I started with on-screen work only--slideshows and shooting for the Web (Flickr and work) primarily. Cropped much of the time. Heavy post-production exposure/contrast fixing. Printed the occasional 4x6 locally. No desire for printing anything larger. I could shoot sloppily and get away with it. --img--  Thanks to advice from the forum (and a lot of shooting to improve) I reduced my post work for exposure-related mistakes significantly. And printed more 4x6s and 5x7s. Late last year I made it a point to stop relying on post-production cropping and paying a lot more attention to framing \"in camera.\" I worked to get good at that. Because to have the capability to print credible enlargements you need every pixel. Then, I had an art critique earlier in the year and had to bump out a whole set of 8x12s. I found that many of the things I'd been getting away with I just couldn't get away with. <sigh> But when I \"nailed\" it, they looked incredible. I've made several additional sets of 8x12s, since. And I've worked to nail it more often and pay even closer attention to the shooting process. Eliminating the crop slop, reducing reliance on post work (to tweaks and adjustments, not \"saves\"), learning from the 8x12s, and then working to get better shots technically has opened up the possibility for good 16x20s on a regular basis, and enough confidence to have 20x30s made. (I now have a workflow at a local shop ironed out so the large sized stuff comes back clean.) Big prints for many here are a validation of their work--or just a continuation of a photographic work process they already know. Big prints for me have been a learning tool, forcing more care and diligence during shooting. I'm still learning, but I will say that when I shoot I want to get *at least* a very credible 16x20 out every shot I take now. I want that capability in case somebody sees something they like and wants it \"printed big.\" I'm running sets of larger prints roughly bimonthly at the moment. Thanks, Will Edited December 9, 2009 by wstotler", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/3/?tab=comments#comment-1145127", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i don't print a lot, but purpose of every frame i shoot is someday i want to print it. <snip> i usually comeback in year or so and process few and print because i seem to like the pictures more after time has passed. +1. interesting thread. three years ago i started with on-screen work only--slideshows and shooting for the web (flickr and work) primarily. cropped much of the time. heavy post-production exposure/contrast fixing. printed the occasional 4x6 locally. no desire for printing anything larger. i could shoot sloppily and get away with it. --img--  thanks to advice from the forum (and a lot of shooting to improve) i reduced my post work for exposure-related mistakes significantly. and printed more 4x6s and 5x7s. late last year -----> i !!!  -----> made !!!  it a point to stop relying on post-production cropping and paying a lot more attention to framing \"in camera.\" i worked to get good at that. because to have the capability to print credible enlargements you need every pixel. then, i had an art critique earlier in the year and had to bump out a whole set of 8x12s. i found that many of the things i'd been getting away with i just couldn't get away with. <sigh> but when i \"nailed\" it, they looked incredible. i've made several additional sets of 8x12s, since. and i've worked to nail it more often and pay even closer attention to the shooting process. eliminating the crop slop, reducing reliance on post work (to tweaks and adjustments, not \"saves\"), learning from the 8x12s, and then working to get better shots technically has opened up the possibility for good 16x20s on a regular basis, and enough confidence to have 20x30s made. (i now have a workflow at a local shop ironed out so the large sized stuff comes back clean.) big prints for many here are a validation of their work--or just a continuation of a photographic work process they already know. big prints for me have been a learning tool, forcing more care and diligence during shooting. i'm still learning, but i will say that when i shoot i want to get *at least* a very credible 16x20 out every shot i take now. i want that capability in case somebody sees something they like and wants it \"printed big.\" i'm running sets of larger prints roughly bimonthly at the moment. thanks, will edited december 9, 2009 by wstotler", "sortedWord": "None", "Identifyer": null, "identifyer": 40753, "year": "2009"}, {"autor": "pezti", "date": "2009-08-07 11:08:00", "content": "Nice. I just bought my M8 used a couple of weeks ago. The previous owner bought it from the local Icelandic dealer in July 2008 so it is just over a year old. I looked for the unique Id and found it has only had 3461 actuation's. That includes the probably around 500 I've made since getting it --img--  I guess the previous owner didn't use it all that much.", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/2/?tab=comments#comment-986115", "origin": "L-forum", "suborigin": "34953-determining-shutter-actuations-on-an-m8", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "nice. i just bought my m8 used a couple of weeks ago. the previous owner bought it from the local icelandic dealer in july 2008 so it is just over a year old. i looked for the unique id and found it has only had 3461 actuation's. that includes the probably around 500 -----> i !!! 've -----> made !!!  since getting it --img--  i guess the previous owner didn't use it all that much.", "sortedWord": "None", "Identifyer": null, "identifyer": 41843, "year": "2009"}, {"autor": "coup de foudre", "date": "2009-10-26 18:01:00", "content": "ArtZ -- jeromeaparis is right. the key that came with SansDisk is no longer valid. all licenses, though, are for two machines -- i double-checked before i purchased as i wanted to make sure i could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade.", "link": "https://www.l-camera-forum.com/topic/94274-m8-free-captureone-le-3x-license/?tab=comments#comment-1090665", "origin": "L-forum", "suborigin": "94274-m8-free-captureone-le-3x-license", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "artz -- jeromeaparis is right. the key that came with sansdisk is no longer valid. all licenses, though, are for two machines -- -----> i !!!  double-checked before -----> i !!!  purchased as -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade.", "sortedWord": "None", "Identifyer": null, "identifyer": 42012, "year": "2009"}, {"autor": "ArtZ", "date": "2009-10-26 21:51:00", "content": "ArtZ -- jeromeaparis is right. the key that came with SansDisk is no longer valid. all licenses, though, are for two machines -- i double-checked before i purchased as i wanted to make sure i could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade. Ouais! --img--  Yes, I know. I found that out too. I'm just using the license of my first M8. I keep the second license (from my second M8) just in case. Thank you for your feed back. Merci.", "link": "https://www.l-camera-forum.com/topic/94274-m8-free-captureone-le-3x-license/?tab=comments#comment-1091043", "origin": "L-forum", "suborigin": "94274-m8-free-captureone-le-3x-license", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "artz -- jeromeaparis is right. the key that came with sansdisk is no longer valid. all licenses, though, are for two machines -- -----> i !!!  double-checked before -----> i !!!  purchased as -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade. ouais! --img--  yes, i know. i found that out too. i'm just using the license of my first m8. i keep the second license (from my second m8) just in case. thank you for your feed back. merci.", "sortedWord": "None", "Identifyer": null, "identifyer": 42013, "year": "2009"}, {"autor": "MikeMyers", "date": "2009-09-14 21:15:00", "content": "I'll do some tests to figure out where the focus ought to be. I'll also take some photos at f/11 or f/16 which ought to have enough depth of field to compensate for this somewhat. I've got to think this thing through a bit more, before I can get my mind to understand it, but if I'm placing this IR filter in front of the lens,a lot of the cells in the image sensor are no longer collecting any data. For example, whatever parts of the sensor that are sensitive to \"blue\" aren't getting any input. I wonder if this means I've got less than 10 megapixels working for me... To footnoteblog, I shot these in 'jpg'; can I still create a \"custom DNG profile\"? I'm still just learning Lightroom. This sounds like another alternative, instead of what Ken Rockwell suggests which is done in Photoshop. About the filter, what is the reason to use a 092 or 093 filter instead of what I'm now using? Actually, I don't even know what it is I'm now using. I think I probably bought it for an \"infrared filter\" 35 years ago, but who knows what I got. I got curious what effect \"auto levels\" would have on my IR image. It did better than I was able to, in getting the image to look more like what I remembered from film... It's still not the image I expected, but I'm not sure what I ought to be expecting from this. --img-- ", "link": "https://www.l-camera-forum.com/topic/96795-taking-ir-photos-with-an-m82/?tab=comments#comment-1035130", "origin": "L-forum", "suborigin": "96795-taking-ir-photos-with-an-m82", "result": true, "Selector": "i still create", "selectorShort": "create", "MarkedSent": "i'll do some tests to figure out where the focus ought to be. i'll also take some photos at f/11 or f/16 which ought to have enough depth of field to compensate for this somewhat. i've got to think this thing through a bit more, before i can get my mind to understand it, but if i'm placing this ir filter in front of the lens,a lot of the cells in the image sensor are no longer collecting any data. for example, whatever parts of the sensor that are sensitive to \"blue\" aren't getting any input. -----> i !!!  wonder if this means -----> i !!! 've got less than 10 megapixels working for me... to footnoteblog, -----> i !!!  shot these in 'jpg'; can -----> i !!!  -----> still !!!  -----> create !!!  a \"custom dng profile\"? i'm still just learning lightroom. this sounds like another alternative, instead of what ken rockwell suggests which is done in photoshop. about the filter, what is the reason to use a 092 or 093 filter instead of what i'm now using? actually, i don't even know what it is i'm now using. i think i probably bought it for an \"infrared filter\" 35 years ago, but who knows what i got. i got curious what effect \"auto levels\" would have on my ir image. it did better than i was able to, in getting the image to look more like what i remembered from film... it's still not the image i expected, but i'm not sure what i ought to be expecting from this. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 43421, "year": "2009"}, {"autor": "MikeMyers", "date": "2009-09-15 19:22:00", "content": "That's a lot of information to digest. I think I need to take a break from this, and read on how to use \"channel mixer\" for Photoshop. Until now, I thought I was simply learning how to take interesting looking IR photos with the M8. From the linked discussions, I see that what I really need to do, is get the M8 to emulate the way Ektachrome IR slide film created pictures. Apparently this will take a good bit of experimentation and testing - but I'd have thought that since the Ektachrome IR was \"always\" the same, a set of procedures and values should allow me to translate in M8 image into what the slide film would have produced. (It might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) Obviously, the M8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. It still seems possible that one could come up with a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the IR Ektachrome would have produced. If I want color, I'll need to use a tripod and take two shots, one \"normal\" and one with the IR filter. I've got to stop now, as I'm leaving on a two-week trip tomorrow. However, I'll have lots of time in the countryside to practice on these things, and will bring a Photoshop book with me so I can learn to use the channel mixer function. Thanks!!", "link": "https://www.l-camera-forum.com/topic/96795-taking-ir-photos-with-an-m82/?tab=comments#comment-1036615", "origin": "L-forum", "suborigin": "96795-taking-ir-photos-with-an-m82", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "that's a lot of information to digest. i think i need to take a break from this, and read on how to use \"channel mixer\" for photoshop. until now, i thought i was simply learning how to take interesting looking ir photos with the m8. from the linked discussions, i see that what i really need to do, is get the m8 to emulate the way ektachrome ir slide film created pictures. apparently this will take a good bit of experimentation and testing - but i'd have thought that since the ektachrome ir was \"always\" the same, a set of procedures and values should allow me to translate in m8 image into what the slide film would have produced. (it might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) obviously, the m8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. it still seems possible that one could -----> come !!!  -----> up !!!  -----> with !!!  a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the ir ektachrome would have produced. if i want color, i'll need to use a tripod and take two shots, one \"normal\" and one with the ir filter. i've got to stop now, as i'm leaving on a two-week trip tomorrow. however, i'll have lots of time in the countryside to practice on these things, and will bring a photoshop book with me so i can learn to use the channel mixer function. thanks!!", "sortedWord": "None", "Identifyer": null, "identifyer": 43431, "year": "2009"}, {"autor": "biglouis", "date": "2009-12-27 01:54:00", "content": "You are expecting too much from this lens. I owned one and it was a competent lens but too close to my Nokton 1.5 which I preferred. The depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. I found it very difficult to obtain sharp photographs, although I could create pleasingly soft one. Jaap's comment is correct - you get what you pay for - although I remain suspicious that you would fare much better if you coupled the new 0.95 to any M camera - the tolerances are too tiny at close range. This fascination with very wide apertures for portrait photography is all well and good but I discovered some time ago I created very pleasing shots just using my Elmar 50 at f2.8 - with no sharpness or backfocus problems.", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=comments#comment-1164639", "origin": "L-forum", "suborigin": "107823-nokton-50mm-f11-backfocus", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "you are expecting too much from this lens. i owned one and it was a competent lens but too close to my nokton 1.5 which i preferred. the depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. -----> i !!!  found it very difficult to obtain sharp photographs, although -----> i !!!  -----> could !!!  -----> create !!!  pleasingly soft one. jaap's comment is correct - you get what you pay for - although i remain suspicious that you would fare much better if you coupled the new 0.95 to any m camera - the tolerances are too tiny at close range. this fascination with very wide apertures for portrait photography is all well and good but i discovered some time ago i created very pleasing shots just using my elmar 50 at f2.8 - with no sharpness or backfocus problems.", "sortedWord": "None", "Identifyer": null, "identifyer": 44165, "year": "2009"}, {"autor": "dNorm", "date": "2009-12-27 15:24:00", "content": "Hi BigLouis. Thank you for the feedback and I've tried to take in your comments with an open mind. But is my thinking flawed that I should expect the focus be within the DoF even at f/1.1 after testing it on a tripod to mitigate any sort of unsteadiness on my part? And even when stopped down to f/4, the focus is off. I've also noticed that the further away the subject is, the more it back focuses. I had sent DAG an email and I am told that he can not adjust it because of it's design. I've not yet heard back from Stephan Gandy. But at any rate, thanks for taking the time to respond. -Norm You are expecting too much from this lens. I owned one and it was a competent lens but too close to my Nokton 1.5 which I preferred. The depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. I found it very difficult to obtain sharp photographs, although I could create pleasingly soft one. Jaap's comment is correct - you get what you pay for - although I remain suspicious that you would fare much better if you coupled the new 0.95 to any M camera - the tolerances are too tiny at close range. This fascination with very wide apertures for portrait photography is all well and good but I discovered some time ago I created very pleasing shots just using my Elmar 50 at f2.8 - with no sharpness or backfocus problems.", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=comments#comment-1165100", "origin": "L-forum", "suborigin": "107823-nokton-50mm-f11-backfocus", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "hi biglouis. thank you for the feedback and i've tried to take in your comments with an open mind. but is my thinking flawed that i should expect the focus be within the dof even at f/1.1 after testing it on a tripod to mitigate any sort of unsteadiness on my part? and even when stopped down to f/4, the focus is off. i've also noticed that the further away the subject is, the more it back focuses. i had sent dag an email and i am told that he can not adjust it because of it's design. i've not yet heard back from stephan gandy. but at any rate, thanks for taking the time to respond. -norm you are expecting too much from this lens. i owned one and it was a competent lens but too close to my nokton 1.5 which i preferred. the depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. -----> i !!!  found it very difficult to obtain sharp photographs, although -----> i !!!  -----> could !!!  -----> create !!!  pleasingly soft one. jaap's comment is correct - you get what you pay for - although i remain suspicious that you would fare much better if you coupled the new 0.95 to any m camera - the tolerances are too tiny at close range. this fascination with very wide apertures for portrait photography is all well and good but i discovered some time ago i created very pleasing shots just using my elmar 50 at f2.8 - with no sharpness or backfocus problems.", "sortedWord": "None", "Identifyer": null, "identifyer": 44167, "year": "2009"}, {"autor": "wlaidlaw", "date": "2009-10-07 17:19:00", "content": "Many thanks for the quick response Wilson.Why on Earth didn't they implement a \"save\" or \"custom\" setting??? Unbeleivable! I'll experiment with some bubblewrap - I'm going to Ecuador next week and won't have time to accept the Leicagoodies postal order.--img--  Wilson, do/did you use the 24D in TTL mode for fill falsh? If so, what are your usual settings? As you may appreciate, I picked up this flash at the last minute and have a very steep learning curve in front of me if I can expect to use it with any degree of reproducibility in the contrasty tropical sunshine....--img--  I did use the 24 in TTL/GNC for fill in flash. It would not be a good choice however. Pre SF58, I mainly used to use a Metz 40MZ-2 in auto mode to do this. First I assume you are using this on an M8 or 9. If so, what you should do is go to the M8/9 menu and set slow speed sync to lens dependant. If you don't do this, then fill really does not work. I am not getting back to the UK until Friday afternoon but I could post you my SFILL as a loaner, since with my SF58 and a Sto-Fen soft box, I just don't use my SF24D now - would that reach you in time? You would also need to get some velcro Sticky Fixers as half the Velcro attachment system for the SFILL is on my 24. I think without the SFILL you will really struggle with fill, which is why Leicagoodies came up with it, the 24 is just too full frontal and brutal. Bubble wrap may work well enough. Try putting one layer of thin tissue paper between two layers of wrap as a diffusor. Wilson", "link": "https://www.l-camera-forum.com/topic/52775-leica-sf-24d-manual-pdf/page/3/?tab=comments#comment-1065994", "origin": "L-forum", "suborigin": "52775-leica-sf-24d-manual-pdf", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "many thanks for the quick response wilson.why on earth didn't they implement a \"save\" or \"custom\" setting??? unbeleivable! i'll experiment with some bubblewrap - i'm going to ecuador next week and won't have time to accept the leicagoodies postal order.--img--  wilson, do/did you use the 24d in ttl mode for fill falsh? if so, what are your usual settings? as you may appreciate, i picked up this flash at the last minute and have a very steep learning curve in front of me if i can expect to use it with any degree of reproducibility in the contrasty tropical sunshine....--img--  i did use the 24 in ttl/gnc for fill in flash. it would not be a good choice however. pre sf58, i mainly used to use a metz 40mz-2 in auto mode to do this. first i assume you are using this on an m8 or 9. if so, what you should do is go to the m8/9 menu and set slow speed sync to lens dependant. if you don't do this, then fill really does not work. i am not getting back to the uk until friday afternoon but i could post you my sfill as a loaner, since with my sf58 and a sto-fen soft box, i just don't use my sf24d now - would that reach you in time? you would also need to get some velcro sticky fixers as half the velcro attachment system for the sfill is on my 24. i think without the sfill you will really struggle -----> with !!!  fill, which is why leicagoodies -----> came !!!  -----> up !!!  -----> with !!!  it, the 24 is just too full frontal and brutal. bubble wrap may work well enough. try putting one layer of thin tissue paper between two layers of wrap as a diffusor. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 44308, "year": "2009"}, {"autor": "mjh", "date": "2009-09-28 10:56:00", "content": "A 720 or 715 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. A 830 or 850 nm filter will let even more of the red light pass through. Oops, of course it’s the other way round: A 830 or 850 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. A 715 or 720 nm filter will let even more of the red light pass through. Sorry about the confusion I might have created.", "link": "https://www.l-camera-forum.com/topic/84753-getting-ektachrome-infrared-colors-out-of-the-m8/?tab=comments#comment-1052880", "origin": "L-forum", "suborigin": "84753-getting-ektachrome-infrared-colors-out-of-the-m8", "result": true, "Selector": "i might have created", "selectorShort": "create", "MarkedSent": "a 720 or 715 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. a 830 or 850 nm filter will let even more of the red light pass through. oops, of course it’s the other way round: a 830 or 850 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. a 715 or 720 nm filter will let even more of the red light pass through. sorry about the confusion -----> i !!!  -----> might !!!  -----> have !!!  -----> created !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 44877, "year": "2009"}, {"autor": "MikeMyers", "date": "2009-09-29 11:30:00", "content": "Wow; not only do I like it more, it's finally starting to look like what I expected an IR shot might look like in B&W; maybe I don't need to get the \"black\" filter after all. Thanks! (I did start to play with the image some more late last night, but I like what you did more than what I came up with!)", "link": "https://www.l-camera-forum.com/topic/84753-getting-ektachrome-infrared-colors-out-of-the-m8/page/2/?tab=comments#comment-1054340", "origin": "L-forum", "suborigin": "84753-getting-ektachrome-infrared-colors-out-of-the-m8", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "wow; not only do i like it more, it's finally starting to look like what i expected an ir shot might look like in b&w; maybe i don't need to get the \"black\" filter after all. thanks! (i did start to play -----> with !!!  the image some more late last night, but i like what you did more than what i -----> came !!!  -----> up !!!  -----> with !!! !)", "sortedWord": "None", "Identifyer": null, "identifyer": 44887, "year": "2009"}, {"autor": "lct", "date": "2009-04-25 17:47:00", "content": "I am having a Leitz 5.5 p/n 11251 machined to accept the standard Leica 39mm filters including the IR/UV. I'll not say who is doing it until I get it back and try it. If it works, I'll tell you all about it. And if it works, it will be the most cost effective secure method of adapting these filters to the 40mm Summicron C. Would be interesting to compare it with mine. 100% DIY but needs a bit of grinding though. One just needs: - a 39mm UV-IR Leica filter (#13410) - a Leica hood #12518 dedicated to the 'cron 40/2 - a 37mm rubber ring - a pin and a die grinder 1. Grind the filter housing of the hood in order to enlarge its inner diameter to 37mm: --img--  2. Remove the blocking ring of the filter with a pin or same: --img--  3. Insert the glass into the filter housing: --img--  4. Insert the rubber ring over the glass: --img--  5. Screw-in the hood and that's all. Edited April 25, 2009 by lct", "link": "https://www.l-camera-forum.com/topic/33548-uvir-filter-for-leica-summicron-c-40mm/page/2/?tab=comments#comment-881442", "origin": "L-forum", "suborigin": "33548-uvir-filter-for-leica-summicron-c-40mm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i am having a leitz 5.5 p/n 11251 machined to accept the standard leica 39mm filters including the ir/uv. i'll not say who is doing it until i get it back and try it. if it works, i'll tell you all about it. and if it works, it will be the most cost effective secure method of adapting these filters to the 40mm summicron c. would be interesting to compare it with mine. 100% -----> diy !!!  but needs a bit of grinding though. one just needs: - a 39mm uv-ir leica filter (#13410) - a leica hood #12518 dedicated to the 'cron 40/2 - a 37mm rubber ring - a pin and a die grinder 1. grind the filter housing of the hood in order to enlarge its inner diameter to 37mm: --img--  2. remove the blocking ring of the filter with a pin or same: --img--  3. insert the glass into the filter housing: --img--  4. insert the rubber ring over the glass: --img--  5. screw-in the hood and that's all. edited april 25, 2009 by lct", "sortedWord": "None", "Identifyer": null, "identifyer": 45776, "year": "2009"}, {"autor": "dpattinson", "date": "2009-12-16 16:33:00", "content": " Yes, that could be the same as my problem #1. So, is this the one Leica has promised a firmware fix for? I can't really see anything in your first image that looks as bad as what I see in my unprocessed jpeg or dng. In my case the entire bottom 10% of the image ended up significantly lighter than the rest of it. I don't pay any attention to what people say Leica has promised fixes for, since they never release fix notes of any value - and they never publish any list of known issues... I haven't even bothered to report this new issue - because I'm quite sure the response will be that it's all very surprising and I should send my camera in for 3 months and get it back with a note that says 'sensor replacement' or the like... sorry if that comes off as a bit pissy... but I develop software for a living and I think I know what industry best practice looks like in terms of handling defect reports and fixes. Edited December 16, 2009 by dpattinson", "link": "https://www.l-camera-forum.com/topic/106851-m8m9-high-iso-banding-questions/?tab=comments#comment-1153339", "origin": "L-forum", "suborigin": "106851-m8m9-high-iso-banding-questions", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " yes, that could be the same as my problem #1. so, is this the one leica has promised a firmware fix for? i can't really see anything in your first image that looks as bad as what i see in my unprocessed jpeg or dng. in my case the entire bottom 10% of the image ended up significantly lighter than the rest of it. i don't pay any attention to what people say leica has promised fixes for, since they never release fix notes of any value - and they never publish any list of known issues... -----> i !!!  haven't even bothered to report this new issue - because -----> i !!! 'm quite sure the response will be that it's all very surprising and -----> i !!!  should send my camera in for 3 months and get it back with a note that says 'sensor replacement' or the like... sorry if that comes off as a bit pissy... but -----> i !!!  -----> develop !!!  software for a living and i think i know what industry best practice looks like in terms of handling defect reports and fixes. edited december 16, 2009 by dpattinson", "sortedWord": "None", "Identifyer": null, "identifyer": 47307, "year": "2009"}, {"autor": "azzo", "date": "2009-01-04 10:14:00", "content": "more, more MORE tears from laughter --img--  This guy is just incredible to say the least. --img--  btw - I just knew you'd come up with something of this sort after I asked you to tell all that I really did call. Tuo Amico --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/8/?tab=comments#comment-765991", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "more, more more tears from laughter --img--  this guy is just incredible to say the least. --img--  btw - i just knew you'd -----> come !!!  -----> up !!!  -----> with !!!  something of this sort after i asked you to tell all that i really did call. tuo amico --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48841, "year": "2009"}, {"autor": "imported_peter_m", "date": "2009-03-12 04:14:00", "content": "Nice indeed! What is that bag? Thank you, I made the bag --img--  Peter", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/9/?tab=comments#comment-837704", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "nice indeed! what is that bag? thank you, -----> i !!!  -----> made !!!  the bag --img--  peter", "sortedWord": "None", "Identifyer": null, "identifyer": 48862, "year": "2009"}, {"autor": "azzo", "date": "2009-03-12 06:07:00", "content": "Thank you, I made the bag --img--  Peter Looks tough and very well made. Lovely result IMHO. - - - --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/9/?tab=comments#comment-837757", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "thank you, -----> i !!!  -----> made !!!  the bag --img--  peter looks tough and very well made. lovely result imho. - - - --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48863, "year": "2009"}, {"autor": "summarod", "date": "2009-02-23 22:27:00", "content": "Hi everyone! I never made it to own an MP3! I only have an MP \"classic\" (MP without the lighmeter) I can very clearly recall the 40th anniversary \"M3\", a kind of direct predecessor, since I entered an antique shop for modernist 20th century furniture in Zurich at its time and there it sat, right on the owner`s desk, a bit puzzled I asked about it, because it already looked having been actually \"USED\" in its very short lifespan. The answer was quite \"frank\"! (pun not intended , but here it is --img--  Hey we are talking \"Swiss\") \"I just use it,- I don`t care about collecting!\" or words to that respect. Quite remarkable at a time when it was listed at about 9000 Swissfrancs (????, please correct me , if I`m wrong!) I felt rather foolish about asking, I must say! But this guy was cool! Leica M6J Best regards Wolfhard", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/?tab=comments#comment-818604", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i never made", "selectorShort": "make", "MarkedSent": "hi everyone! -----> i !!!  -----> never !!!  -----> made !!!  it to own an mp3! i only have an mp \"classic\" (mp without the lighmeter) i can very clearly recall the 40th anniversary \"m3\", a kind of direct predecessor, since i entered an antique shop for modernist 20th century furniture in zurich at its time and there it sat, right on the owner`s desk, a bit puzzled i asked about it, because it already looked having been actually \"used\" in its very short lifespan. the answer was quite \"frank\"! (pun not intended , but here it is --img--  hey we are talking \"swiss\") \"i just use it,- i don`t care about collecting!\" or words to that respect. quite remarkable at a time when it was listed at about 9000 swissfrancs (????, please correct me , if i`m wrong!) i felt rather foolish about asking, i must say! but this guy was cool! leica m6j best regards wolfhard", "sortedWord": "None", "Identifyer": null, "identifyer": 2372, "year": "2009"}, {"autor": "peter_n", "date": "2009-03-18 01:02:00", "content": "...Out of interest does anyone know if Leica made a chrome pre-ASPH 'lux 50 with the scalloped barrel like the black paint one that went with the M6 Millennium?...I don't think thay did. I bought one of the BP ones last week and it seems to be a very nice lens. I currently use a v.2 which I love but I fancy the closest focus of 0.7M and the shorter throw. I'll have to make a choice between them, it makes no sense to have three Summilux's. Personally I like the look of the v.1 but you presumably think it's a bit soft. Mike Dixon on photo.net has created some fantastic work with an old v.1. Nice pic of your new MP3 BTW! --img-- ", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/page/2/?tab=comments#comment-844466", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i'll have to make", "selectorShort": "make", "MarkedSent": "...out of interest does anyone know if leica made a chrome pre-asph 'lux 50 with the scalloped barrel like the black paint one that went with the m6 millennium?...i don't think thay did. i bought one of the bp ones last week and it seems to be a very nice lens. i currently use a v.2 which i love but i fancy the closest focus of 0.7m and the shorter throw. -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> make !!!  a choice between them, it makes no sense -----> to !!!  -----> have !!!  three summilux's. personally i like the look of the v.1 but you presumably think it's a bit soft. mike dixon on photo.net has created some fantastic work with an old v.1. nice pic of your new mp3 btw! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 2394, "year": "2009"}, {"autor": "Leitzmac", "date": "2009-03-18 02:26:00", "content": "I don't think thay did. I bought one of the BP ones last week and it seems to be a very nice lens. I currently use a v.2 which I love but I fancy the closest focus of 0.7M and the shorter throw. I'll have to make a choice between them, it makes no sense to have three Summilux's. Personally I like the look of the v.1 but you presumably think it's a bit soft. Mike Dixon on photo.net has created some fantastic work with an old v.1. Nice pic of your new MP3 BTW! --img--  Hi Peter, Thanks for your reply, I have a standard black Summilux from the latter part of the 90s (I think - would have to check the serial No. to confirm) and I liked it a lot. Having said that, I then got a Noctilux that ended up 'fixed' to my .85 M6 (mostly shooting it wide open on Delta 3200) and I never use the Summilux now. I do like the gain in manual focussing speed that you get on the 'lux over the noct though and think a chrome one would be ideal for the MP-3. Of course what this goes to show is that I don't mind a little softness (the noct wide open is hardly what you'd call sharp --img--  , so maybe a chrome v.1 lux might be the call. Thanks for referring me to Mike Dixon's gallery, there's some lovely work in there, although some of the (negative) discussion surrounding the picture of the grizzled man at the bar seems unwarranted. To my mind \"if it ain't broke, don't fix it!\" All the best, Al P.S. Thanks for the compliment on the MP-3 pic - they are such striking bodies that they immediately tick off the first box with regards to necessary elements in a photograph: interesting or aesthetic subject matter!", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/page/2/?tab=comments#comment-844485", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i'll have to make", "selectorShort": "make", "MarkedSent": "i don't think thay did. i bought one of the bp ones last week and it seems to be a very nice lens. i currently use a v.2 which i love but i fancy the closest focus of 0.7m and the shorter throw. -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> make !!!  a choice between them, it makes no sense -----> to !!!  -----> have !!!  three summilux's. personally i like the look of the v.1 but you presumably think it's a bit soft. mike dixon on photo.net has created some fantastic work with an old v.1. nice pic of your new mp3 btw! --img--  hi peter, thanks for your reply, i have a standard black summilux from the latter part of the 90s (i think - would have to check the serial no. to confirm) and i liked it a lot. having said that, i then got a noctilux that ended up 'fixed' to my .85 m6 (mostly shooting it wide open on delta 3200) and i never use the summilux now. i do like the gain in manual focussing speed that you get on the 'lux over the noct though and think a chrome one would be ideal for the mp-3. of course what this goes to show is that i don't mind a little softness (the noct wide open is hardly what you'd call sharp --img--  , so maybe a chrome v.1 lux might be the call. thanks for referring me to mike dixon's gallery, there's some lovely work in there, although some of the (negative) discussion surrounding the picture of the grizzled man at the bar seems unwarranted. to my mind \"if it ain't broke, don't fix it!\" all the best, al p.s. thanks for the compliment on the mp-3 pic - they are such striking bodies that they immediately tick off the first box with regards to necessary elements in a photograph: interesting or aesthetic subject matter!", "sortedWord": "None", "Identifyer": null, "identifyer": 2395, "year": "2009"}, {"autor": "andrewsolomon", "date": "2009-04-29 03:06:00", "content": "I also have a 5D which I like a great deal and use for serious fine art shooting. I also have a D7 which is a fun camera to have for carrying in my pocket. The D2; however, remains my favorite! For its focal length, it is fine for much shooting-like the M Series. I learned on the M3 and went forward from that. The outstanding benefits of the D2 are: 1. The Digital Viewfinder! What a gift! When I was shooting in Death Valley, I could not see the taken image on my 5d because of the ambient light. I now use a Hoodman to take care of the problem; but the the D2; it was no problem. It was wonderful! I made a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. It is also ideal fopr those of us who are visuall challenged and have to wear glasses. Adjust the diopter and you are ready to go and shoot with ease! 2. The grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in Photoshop] easy to do properely. 3. Bounce Flash. What an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. The fine-focus option to use when using manual focus. I use this a lot of the time when I want to be certain the focus is spot on...and it works every time. I have made tack-sharp 20x24 prints with no compromise. The only drawback is the shutter lag. When I was shooting professional tennis and tried the D2, only by knowing the game well and anticipating the next move was I able to get a shot with the \"motor\" drive. I tried for some time to send my successful sports images from the Houston Astros baseball and the Mens National Clay Court Tennis Championships to Roger Horn of Leica USA to show him that despite the comment made to me by a Leica representative that \"Leica is not for sports\" that with care the D2 could do very credible work-work wich I subsequently had published, I might add but there was little positive response. This was a shame because the D2 can do a great deal of things very well. So yes, I think the D2 is a wonderful camera to have even with its few limitations and I would recommend it to anyone who wants a good, general camera. BTW It can use the Canon Speedlight in its hot shoe for a greater range of flash coverage as well! Andy Solomon Houston, Tx --img-- --img--  Edited April 29, 2009 by andrewsolomon Add an image", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884480", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i also have a 5d which i like a great deal and use for serious fine art shooting. i also have a d7 which is a fun camera to have for carrying in my pocket. the d2; however, remains my favorite! for its focal length, it is fine for much shooting-like the m series. i learned on the m3 and went forward from that. the outstanding benefits of the d2 are: 1. the digital viewfinder! what a gift! when i was shooting in death valley, i could not see the taken image on my 5d because of the ambient light. i now use a hoodman to take care of the problem; but the the d2; it was no problem. it was wonderful! -----> i !!!  -----> made !!!  a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. it is also ideal fopr those of us who are visuall challenged and have to wear glasses. adjust the diopter and you are ready to go and shoot with ease! 2. the grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in photoshop] easy to do properely. 3. bounce flash. what an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. the fine-focus option to use when using manual focus. i use this a lot of the time when i want to be certain the focus is spot on...and it works every time. i have made tack-sharp 20x24 prints with no compromise. the only drawback is the shutter lag. when i was shooting professional tennis and tried the d2, only by knowing the game well and anticipating the next move was i able to get a shot with the \"motor\" drive. i tried for some time to send my successful sports images from the houston astros baseball and the mens national clay court tennis championships to roger horn of leica usa to show him that despite the comment made to me by a leica representative that \"leica is not for sports\" that with care the d2 could do very credible work-work wich i subsequently had published, i might add but there was little positive response. this was a shame because the d2 can do a great deal of things very well. so yes, i think the d2 is a wonderful camera to have even with its few limitations and i would recommend it to anyone who wants a good, general camera. btw it can use the canon speedlight in its hot shoe for a greater range of flash coverage as well! andy solomon houston, tx --img-- --img--  edited april 29, 2009 by andrewsolomon add an image", "sortedWord": "None", "Identifyer": null, "identifyer": 15537, "year": "2009"}, {"autor": "John Thawley", "date": "2009-04-29 13:56:00", "content": "I wonder if Leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. Could the Digilux 2 be a genuine \"Cinderella story\" in the Leica family? And oh, I'm still making this modification/upgrade available for a limited time only. --img-- ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884863", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i'm still making", "selectorShort": "make", "MarkedSent": "i wonder if leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. could the digilux 2 be a genuine \"cinderella story\" in the leica family? and oh, -----> i !!! 'm -----> still !!!  -----> making !!!  this modification/upgrade available for a limited time only. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 15541, "year": "2009"}, {"autor": "koray", "date": "2009-04-30 08:44:00", "content": "I wonder if Leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. Could the Digilux 2 be a genuine \"Cinderella story\" in the Leica family? And oh, I'm still making this modification/upgrade available for a limited time only. ESPRESSO! Now that's what I call an all-in-one. :-) K. PS: Here is my 'LC1 distinctive look', B/W via Lightroom+NIK Silverefex: --img--  Edited April 30, 2009 by koray Added a photo.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-885548", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i'm still making", "selectorShort": "make", "MarkedSent": "i wonder if leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. could the digilux 2 be a genuine \"cinderella story\" in the leica family? and oh, -----> i !!! 'm -----> still !!!  -----> making !!!  this modification/upgrade available for a limited time only. espresso! now that's what i call an all-in-one. :-) k. ps: here is my 'lc1 distinctive look', b/w via lightroom+nik silverefex: --img--  edited april 30, 2009 by koray added a photo.", "sortedWord": "None", "Identifyer": null, "identifyer": 15543, "year": "2009"}, {"autor": "SteveYork", "date": "2009-05-29 18:34:00", "content": "I made a huge mistake getting a Leicaflex SL Mot that had a new prism installed a few years ago. Now the R6.2 I got for my upcoming 'birds and bees' trip this fall just seems so blah. If the Leicaflex was a chick, I would be madly in love. I know that's a sexist statement, so I'll take myself behind the wood shed and spank myself. But the viewfinder on those Leicaflex SL and SL2, if you can find one in good shape, are as good as advertised.", "link": "https://www.l-camera-forum.com/topic/45395-lets-see-your-r/page/9/?tab=comments#comment-915225", "origin": "L-forum", "suborigin": "45395-lets-see-your-r", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a huge mistake getting a leicaflex sl mot that had a new prism installed a few years ago. now the r6.2 i got for my upcoming 'birds and bees' trip this fall just seems so blah. if the leicaflex was a chick, i would be madly in love. i know that's a sexist statement, so i'll take myself behind the wood shed and spank myself. but the viewfinder on those leicaflex sl and sl2, if you can find one in good shape, are as good as advertised.", "sortedWord": "None", "Identifyer": null, "identifyer": 22966, "year": "2009"}, {"autor": "spydrxx", "date": "2009-04-29 03:54:00", "content": "I won't tell you one is better than the other. I've owned both, and eventually sold the SL, keeping the SL2. Both were great cameras but I found the SL2 more ergonomically comfortable and, as others indicated, the meter is more sensitive. Here's a link you might find interesting, particularly the chart on which lenses (by cam configuration) can work on which Leica reflex cameras (http://www.photoethnography.com); however there are some lenses which present other issues. I got my SL2 CLA'd right after I got it, the SL I purchased had been CLA'd right before I bought it. Given their ages, I think the CLAs were a good idea. I also own an R8, and find that I typically use the SL2 much more often than the R8, even though the R8 is a much more sophisticated camera. My only disappointment, using either the SL or SL2, was that there wasn't a grip as many more modern designs have, and given the weight of many of the R lenses, I wanted a grip, so finally I made one out of an L bracket which attaches in conjunction with an Arca-Swiss type tripod bracket and a piece of leather surrounding my hand. WOW, what a difference. I'd show a picture of it, but, alas, mine is in the shop with DAG for some adjustments right now. IMHO you can't go wrong with either the SL or SL2 if you like manual cameras.", "link": "https://www.l-camera-forum.com/topic/83227-leicaflex-sl-vs-sl2/?tab=comments#comment-884495", "origin": "L-forum", "suborigin": "83227-leicaflex-sl-vs-sl2", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i won't tell you one is better than the other. i've owned both, and eventually sold the sl, keeping the sl2. both were great cameras but i found the sl2 more ergonomically comfortable and, as others indicated, the meter is more sensitive. here's a link you might find interesting, particularly the chart on which lenses (by cam configuration) can work on which leica reflex cameras (http://www.photoethnography.com); however there are some lenses which present other issues. i got my sl2 cla'd right after i got it, the sl i purchased had been cla'd right before i bought it. given their ages, i think the clas were a good idea. i also own an r8, and find that i typically use the sl2 much more often than the r8, even though the r8 is a much more sophisticated camera. my only disappointment, using either the sl or sl2, was that there wasn't a grip as many more modern designs have, and given the weight of many of the r lenses, -----> i !!!  wanted a grip, so finally -----> i !!!  -----> made !!!  one out of an l bracket which attaches in conjunction with an arca-swiss type tripod bracket and a piece of leather surrounding my hand. wow, what a difference. i'd show a picture of it, but, alas, mine is in the shop with dag for some adjustments right now. imho you can't go wrong with either the sl or sl2 if you like manual cameras.", "sortedWord": "None", "Identifyer": null, "identifyer": 36339, "year": "2009"}, {"autor": "iShutterbug", "date": "2009-09-20 11:23:00", "content": "I agree with Batmobile. I got caught up in the \"bokeh king\" thing and bought one and was disappointed with it. I had gotten used to buying things on the basis of reviews--like computers and software and other things--but a lens--or photography as art--something as subjective as that--I think someone has to experience it for themselves. Not to cross-post but here's a similar comment I made elsewhere. http://www.l-camera-forum.com/leica-forum/film-forum/97982-m6-lens-2.html#post1043964 Edited September 20, 2009 by iShutterbug", "link": "https://www.l-camera-forum.com/topic/97066-legendary-leica-lenses-old-vs-new/?tab=comments#comment-1042976", "origin": "L-forum", "suborigin": "97066-legendary-leica-lenses-old-vs-new", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i agree with batmobile. i got caught up in the \"bokeh king\" thing and bought one and was disappointed with it. i had gotten used to buying things on the basis of reviews--like computers and software and other things--but a lens--or photography as art--something as subjective as that--i think someone has to experience it for themselves. not to cross-post but here's a similar comment -----> i !!!  -----> made !!!  elsewhere. http://www.l-camera-forum.com/leica-forum/film-forum/97982-m6-lens-2.html#post1043964 edited september 20, 2009 by ishutterbug", "sortedWord": "None", "Identifyer": null, "identifyer": 37547, "year": "2009"}, {"autor": "luigi bertolotti", "date": "2009-08-30 20:24:00", "content": "I think, it wouldn't be fair to exspect this 50 years old lens on the same level as the current 35mm Summarit, let alone the Summicron-asph. For it's time it was a very good lens, sharp and contrasty though giving a warm image at the same time. It is small and very smooth to handle, perhaps the alloy appearance doesn't have the classical brassy look as the Summicrons from the same time. It is the ideal companion for the M2: [ATTACH]159501[/ATTACH] Yes, the alloy mount is an important factor... it made it much lighter than the previous 3,5 - 135g vs. 195g (ungoggled versions) - and this makes it appear a someway \"cheap\" construction, which makes me prefer (as a collectible) the old 3,5... the \"solid\" appearance of old brass items has a distinctive fascination (21 f4 is the masterpiece in this sense). But in optical terms it's a very good lens, definitely better than the 3,5 ; I agree with Andy : as value for money, can be the best 35 made by old Leitz : I made some simply tests at 4-5,6-8 vs. the first Summicron (the 8-elements) and Summaron shows a better contrast. Edited August 30, 2009 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/94959-summaron-35mm-f28-m-lens/?tab=comments#comment-1010892", "origin": "L-forum", "suborigin": "94959-summaron-35mm-f28-m-lens", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i think, it wouldn't be fair to exspect this 50 years old lens on the same level as the current 35mm summarit, let alone the summicron-asph. for it's time it was a very good lens, sharp and contrasty though giving a warm image at the same time. it is small and very smooth to handle, perhaps the alloy appearance doesn't have the classical brassy look as the summicrons from the same time. it is the ideal companion for the m2: [attach]159501[/attach] yes, the alloy mount is an important factor... it made it much lighter than the previous 3,5 - 135g vs. 195g (ungoggled versions) - and this makes it appear a someway \"cheap\" construction, which makes me prefer (as a collectible) the old 3,5... the \"solid\" appearance of old brass items has a distinctive fascination (21 f4 is the masterpiece in this sense). but in optical terms it's a very good lens, definitely better than the 3,5 ; -----> i !!!  agree with andy : as value for money, can be the best 35 -----> made !!!  by old leitz : -----> i !!!  -----> made !!!  some simply tests at 4-5,6-8 vs. the first summicron (the 8-elements) and summaron shows a better contrast. edited august 30, 2009 by luigi bertolotti", "sortedWord": "None", "Identifyer": null, "identifyer": 40459, "year": "2009"}, {"autor": "Spiking", "date": "2009-01-30 20:30:00", "content": "Roma? Rome, too, has many hills. It's close, but it's not Rome. If wanted I could come up with an additional picture...", "link": "https://www.l-camera-forum.com/topic/75648-do-you-know-the-world-competition/page/2/?tab=comments#comment-795475", "origin": "L-forum", "suborigin": "75648-do-you-know-the-world-competition", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "roma? rome, too, has many hills. it's close, but it's not rome. if wanted i could -----> come !!!  -----> up !!!  -----> with !!!  an additional picture...", "sortedWord": "None", "Identifyer": null, "identifyer": 49393, "year": "2009"}, {"autor": "carlosecpf", "date": "2009-09-20 21:37:00", "content": "I've heard that Leica filters are made by Heliopan. Lumix filters would be made by Panasonic which, if it can make the D2's lens with the quality it has, can certainly make filetrs that are as good. I understand that Leica designed the D2 lens, but design of a filter would not be as involved. Thanks for the info! I made some tests with the Lumix 72mm Circular polarizer and my D2 and everything is fine! I was doing some research and apparently the circular polarizer is recommended for DSLRs and Linear polarizers for cameras without a mirror, like the D2. Does anyone know if this is true?", "link": "https://www.l-camera-forum.com/topic/60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2/page/2/?tab=comments#comment-1043746", "origin": "L-forum", "suborigin": "60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i've heard that leica filters are made by heliopan. lumix filters would be made by panasonic which, if it can make the d2's lens with the quality it has, can certainly make filetrs that are as good. i understand that leica designed the d2 lens, but design of a filter would not be as involved. thanks for the info! -----> i !!!  -----> made !!!  some tests with the lumix 72mm circular polarizer and my d2 and everything is fine! i was doing some research and apparently the circular polarizer is recommended for dslrs and linear polarizers for cameras without a mirror, like the d2. does anyone know if this is true?", "sortedWord": "None", "Identifyer": null, "identifyer": 93805, "year": "2009"}, {"autor": "Marquinius", "date": "2009-09-27 11:15:00", "content": "I'll give this thread some more time and convert the added names to the \"master list\" I made earlier. Still got it in excel, so no hassle.", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/3/?tab=comments#comment-1051699", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!! 'll give this thread some more time and convert the added names to the \"master list\" -----> i !!!  -----> made !!!  earlier. still got it in excel, so no hassle.", "sortedWord": "None", "Identifyer": null, "identifyer": 96931, "year": "2009"}, {"autor": "Guest stnami", "date": "2009-12-26 11:55:00", "content": "I hadn't seen Paolo's work for years forgot about him altogether........ he's a story teller like .:: Jindřich Štreit ::. Letizia Battaglia is the real thing Portraying the mafia - we make money not art", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/6/?tab=comments#comment-1164019", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "i hadn't seen paolo's work for years forgot about him altogether........ he's a story teller like .:: jindřich štreit ::. letizia battaglia is the real thing portraying the mafia - -----> we !!!  -----> make !!!  money not art", "sortedWord": "None", "Identifyer": null, "identifyer": 96999, "year": "2009"}, {"autor": "Shootist", "date": "2009-07-20 12:13:00", "content": "Hi all, I'm just wondering how many of you that uses EXIF for storing information about the pictures, location, subject etc. for cross reference and searching later on? Can't see any reference to it in your workflows, and it should probably be done before backing up the DNG's. (I still haven't decided if I should go over my collection and update them...) /Patrik The only time I use the EXIF data for any sorting, searching or what have you is for lenses. Never saw the need to input location data into the EXIF as if I'm in one lacation taking a lot of shot they all go into a subfolder named for that lacation, event or artist (band/solo performer). That subfolder is under the year folder I create for each year and then at the end of the year those images go into a main folder for that lacation, event or artist that is not year dependent. If I then need to search within those folders by date, year or otherwise, that data is already in the EXIF.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/4/?tab=comments#comment-968006", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hi all, i'm just wondering how many of you that uses exif for storing information about the pictures, location, subject etc. for cross reference and searching later on? can't see any reference to it in your workflows, and it should probably be done before backing up the dng's. (i still haven't decided if i should go over my collection and update them...) /patrik the only time i use the exif data for any sorting, searching or what have you is for lenses. never saw the need to input location data into the exif as if i'm in one lacation taking a lot of shot they all go into a subfolder named for that lacation, event or artist (band/solo performer). that subfolder is under the year folder -----> i !!!  -----> create !!!  for each year and then at the end of the year those images go into a main folder for that lacation, event or artist that is not year dependent. if i then need to search within those folders by date, year or otherwise, that data is already in the exif.", "sortedWord": "None", "Identifyer": null, "identifyer": 111448, "year": "2009"}, {"autor": "Printmaker", "date": "2009-08-06 19:25:00", "content": "My personal workflow is more or less the same as most. I shoot, copy to computer and hard drive, and then make a backup DVD of the raw files. I look the files over in Adobe Bridge, open them in Photoshop CS4's raw convertor, adjust to taste and then make fine adjustments in PS4. The photo is then named, proofed and, if I'm happy with the result, filed in a second hard drive. Because I'm working on two different computers (one for processing and another for printing) this version of the file is saved in 3 places. When my proofing file reaches 4 gigs or a series or job is complete, that file gets archived onto a DVD. I've created a downloadable PDF that explains how to copy and print a perfect reproduction of a painting. Since this is my daily commercial workflow, I think posting this link is appropriate. How to Print the Perfect Giclée: Kauai's Printmaker Enjoy, Tom", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/4/?tab=comments#comment-985455", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "my personal workflow is more or less the same as most. i shoot, copy to computer and hard drive, and then make a backup dvd of the raw files. i look the files over in adobe bridge, open them in photoshop cs4's raw convertor, adjust to taste and then make fine adjustments in ps4. the photo is then named, proofed and, if i'm happy with the result, filed in a second hard drive. because i'm working on two different computers (one for processing and another for printing) this version of the file is saved in 3 places. when my proofing file reaches 4 gigs or a series or job is complete, that file gets archived onto a dvd. -----> i !!! 've -----> created !!!  a downloadable pdf that explains how to copy and print a perfect reproduction of a painting. since this is my daily commercial workflow, i think posting this link is appropriate. how to print the perfect giclée: kauai's printmaker enjoy, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 111449, "year": "2009"}, {"autor": "PeterMartin", "date": "2009-05-06 22:06:00", "content": " Hello to all fellow Leica Users: I joined this site a few days ago and thought I’d post a short note of introduction, as one would if you were an unknown guest at a dinner party. I’ve been shooting professionally for about 35 years, on staff at three different newspapers in Canada. After 16 years at the Montreal Gazette I decided to make a change and left the comfort of a full-time position to free-lance and pursue personal projects. Then I moved to the US from Canada for one reason…the love of a Woman. My first introduction to Leica was with my Uncle’s M3, which he bought in 1957 and brought to Canada when he emigrated from Germany in 1960. It held tremendous fascination for me as a young boy: full of mysterious buttons, knobs and strange numbers, that meant nothing to me. I was 10 when he let me take my first family photo with it, heavy and unbalanced, attached to a large Honeywell strobe. Through out my career I’ve used various versions of Nikons and Canons as most news shooters did and still do today. I picked up my first M6 about 11 years ago and started using it on my travels, strictly for personal use. I quickly became hooked and now use them exclusively for all my personal projects. Nowadays, I still use Canons, when I have to. In today’s world there’s no avoiding digital use if you want to make a living. However I still keep at least 100 rolls of Tri-X in the fridge at all times; have once again learned the tricks of transporting film through airport security systems; turn the kitchen into a makeshift lab whenever my wife leaves town on business; and am trying to figure a way to fit a darkroom into a 8 x 7 foot closet… before it’s too late. I found this site through a good friend in Montreal, and thought it would be interesting to get involved with a group who seem quite passionate about one of the few iconic cameras left in production today. Thanks for reading and I look forward to helping out and contributing as time allows. Mein Deutsch ist nicht perfekt, aber ich freue mich auf das Gespräch mit alle deutschen Fotografen auf dieser Website. Peter Martin P.S. About 15 years ago, my Uncle gave me the M3 and once I get around to replacing the rangefinder, look forward to putting it to use once again! http://www.petermartinphotographer.com", "link": "https://www.l-camera-forum.com/topic/84183-a-warm-greeting-to-everyone/?tab=comments#comment-891870", "origin": "L-forum", "suborigin": "84183-a-warm-greeting-to-everyone", "result": true, "Selector": "i decided to make", "selectorShort": "make", "MarkedSent": " hello to all fellow leica users: i joined this site a few days ago and thought i’d post a short note of introduction, as one would if you were an unknown guest at a dinner party. i’ve been shooting professionally for about 35 years, on staff at three different newspapers in canada. after 16 years at the montreal gazette -----> i !!!  -----> decided !!!  -----> to !!!  -----> make !!!  a change and left the comfort of a full-time position -----> to !!!  free-lance and pursue personal projects. then i moved to the us from canada for one reason…the love of a woman. my first introduction to leica was with my uncle’s m3, which he bought in 1957 and brought to canada when he emigrated from germany in 1960. it held tremendous fascination for me as a young boy: full of mysterious buttons, knobs and strange numbers, that meant nothing to me. i was 10 when he let me take my first family photo with it, heavy and unbalanced, attached to a large honeywell strobe. through out my career i’ve used various versions of nikons and canons as most news shooters did and still do today. i picked up my first m6 about 11 years ago and started using it on my travels, strictly for personal use. i quickly became hooked and now use them exclusively for all my personal projects. nowadays, i still use canons, when i have to. in today’s world there’s no avoiding digital use if you want to make a living. however i still keep at least 100 rolls of tri-x in the fridge at all times; have once again learned the tricks of transporting film through airport security systems; turn the kitchen into a makeshift lab whenever my wife leaves town on business; and am trying to figure a way to fit a darkroom into a 8 x 7 foot closet… before it’s too late. i found this site through a good friend in montreal, and thought it would be interesting to get involved with a group who seem quite passionate about one of the few iconic cameras left in production today. thanks for reading and i look forward to helping out and contributing as time allows. mein deutsch ist nicht perfekt, aber ich freue mich auf das gespräch mit alle deutschen fotografen auf dieser website. peter martin p.s. about 15 years ago, my uncle gave me the m3 and once i get around to replacing the rangefinder, look forward to putting it to use once again! http://www.petermartinphotographer.com", "sortedWord": "None", "Identifyer": null, "identifyer": 115261, "year": "2009"}], "name": "Leicasortedout2009"}