{"interestingcomments": [{"Unnamed: 0": 146, "autor": "fm2176", "date": 1637366400000, "content": "(\"On 11/6/2020 at 5:42 AM, Illini said:\\nI’m just A DIY guy, but I couldn’t tell you the last time I set foot in a Lowes. It would be nice if they stepped up their game so as to give me another option other than making the haul down to HD.\\nI feel you. I'm fortunate to have a Lowe's about a mile away from the house and a Home Depot less than two miles. I almost always go to the latter, though, as they have more of the brands I want (DeWalt and the TTI power tools), a better Special Buy layout (most Lowe's stores crowd their holiday specials in the center aisles or by lawn and garden), and more predictable--but still hit or miss--clearance deals.\\nWhen I stop by Lowe's these days, it's usually in hopes of finding clearance items. It seems like they clear out the tool section overheads and hardware section every once in a while, and I've scored some great deals on both hardware and miscellaneous tool accessories (likely from since-replaced display tools) such as an OMT accessory kit for $1 or a package of Tapcons for $2.\",)", "link": "('https://forum.toolsinaction.com/topic/15242-revamped-lowes/#elControls_211008_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tool News", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"on 11/6/2020 at 5:42 am, illini said:\\ni’m just a -----> diy !!!  guy, but i couldn’t tell you the last time i set foot in a lowes. it would be nice if they stepped up their game so as to give me another option other than making the haul down to hd.\\ni feel you. i'm fortunate to have a lowe's about a mile away from the house and a home depot less than two miles. i almost always go to the latter, though, as they have more of the brands i want (dewalt and the tti power tools), a better special buy layout (most lowe's stores crowd their holiday specials in the center aisles or by lawn and garden), and more predictable--but still hit or miss--clearance deals.\\nwhen i stop by lowe's these days, it's usually in hopes of finding clearance items. it seems like they clear out the tool section overheads and hardware section every once in a while, and i've scored some great deals on both hardware and miscellaneous tool accessories (likely from since-replaced display tools) such as an omt accessory kit for $1 or a package of tapcons for $2.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000002, "year": "2021"}, {"Unnamed: 0": 1087, "autor": "CoreyR", "date": 1637366400000, "content": "(\"Black Friday shopping was a success! I was wanting to get the flexvolt miter saw, but after thinking about it and considering cost/benefits, I figured it would be a stupid purchase for just doing DIY stuff. So I went with the new Rigid R4221 miter saw. Got tired of looking at my kobalt bag of hand tools that were overflowing as well as the bag of my porter cable tool set along with my dewalt drill, so I bought a husky tool box set. Also needed a ladder, so I bought the Werner 4 in 1 22' ladder which is really nice and sturdy. And found a set of 3 husky medium duty gloves. All in all, great deals. Looking forward to trying out the miter saw, but will have to wait a couple days.\\nR4221: http://m.homedepot.com/p/RIDGID-15-Amp-12-in-Corded-Dual-Bevel-Sliding-Miter-Saw-with-70-Degree-Miter-Capacity-R4221/206726927 $299\\nWerner 4 in 1 ladder: http://m.homedepot.com/p/Werner-22-ft-Aluminum-Telescoping-Multi-Position-Ladder-with-250-lb-Load-Capacity-Type-I-Duty-Rating-MT1-22/205905620 $99.98\\nHusky 5 drawer tool chest: http://m.homedepot.com/p/Husky-26-in-5-Drawer-Tool-Chest-Textured-Black-H5CH2LEC/206635941 $119\\nHusky 5 drawer tool cabinet: http://m.homedepot.com/p/Husky-27-in-5-Drawer-Tool-Cabinet-Textured-Black-H5TR2LEC/206635944?MERCH=REC-_-irg_aic-1-_-206635941-_-206635944-_-N $179\\nHusky Gloves: http://m.homedepot.com/p/Husky-Large-New-Medium-Duty-Glove-3-per-Pack-SL8717L/206993543 $19.88\",)", "link": "('https://forum.toolsinaction.com/topic/8283-what-tools-did-you-buy-today/page/181/#elControls_155684_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"black friday shopping was a success! i was wanting to get the flexvolt miter saw, but after thinking about it and considering cost/benefits, i figured it would be a stupid purchase for just doing -----> diy !!!  stuff. so i went with the new rigid r4221 miter saw. got tired of looking at my kobalt bag of hand tools that were overflowing as well as the bag of my porter cable tool set along with my dewalt drill, so i bought a husky tool box set. also needed a ladder, so i bought the werner 4 in 1 22' ladder which is really nice and sturdy. and found a set of 3 husky medium duty gloves. all in all, great deals. looking forward to trying out the miter saw, but will have to wait a couple days.\\nr4221: http://m.homedepot.com/p/ridgid-15-amp-12-in-corded-dual-bevel-sliding-miter-saw-with-70-degree-miter-capacity-r4221/206726927 $299\\nwerner 4 in 1 ladder: http://m.homedepot.com/p/werner-22-ft-aluminum-telescoping-multi-position-ladder-with-250-lb-load-capacity-type-i-duty-rating-mt1-22/205905620 $99.98\\nhusky 5 drawer tool chest: http://m.homedepot.com/p/husky-26-in-5-drawer-tool-chest-textured-black-h5ch2lec/206635941 $119\\nhusky 5 drawer tool cabinet: http://m.homedepot.com/p/husky-27-in-5-drawer-tool-cabinet-textured-black-h5tr2lec/206635944?merch=rec-_-irg_aic-1-_-206635941-_-206635944-_-n $179\\nhusky gloves: http://m.homedepot.com/p/husky-large-new-medium-duty-glove-3-per-pack-sl8717l/206993543 $19.88\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 2690, "autor": "Biggie", "date": 1637366400000, "content": "(\"On 12/26/2017 at 6:09 PM, Tug said:\\nI meant it's dead, non-functioning, faulty. It's going back\\nThat's a bummer for a new toy.\\nAfter watching workshop addicts video on the new ryobi brushless tools it was kind of disappointing. The grinder, recip, and circular saws all seemed to cut out even when not pushed very hard. I know they're more of a homeowner/diy grade of tool, maybe they'll perform better when/if they come out with their larger batteries.\",)", "link": "('https://forum.toolsinaction.com/topic/8283-what-tools-did-you-buy-today/page/303/#elControls_192937_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"on 12/26/2017 at 6:09 pm, tug said:\\ni meant it's dead, non-functioning, faulty. it's going back\\nthat's a bummer for a new toy.\\nafter watching workshop addicts video on the new ryobi brushless tools it was kind of disappointing. the grinder, recip, and circular saws all seemed to cut out even when not pushed very hard. i know they're more of a homeowner/-----> diy !!!  grade of tool, maybe they'll perform better when/if they come out with their larger batteries.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 2692, "autor": "Tug", "date": 1637366400000, "content": "('On 12/26/2017 at 6:39 PM, Biggie said:\\nThat\\'s a bummer for a new toy.\\nAfter watching workshop addicts video on the new ryobi brushless tools it was kind of disappointing. The grinder, recip, and circular saws all seemed to cut out even when not pushed very hard. I know they\\'re more of a homeowner/diy grade of tool, maybe they\\'ll perform better when/if they come out with their larger batteries.\\nAgreed, not trade-grade, but shouldn\\'t falter on cutting a bit of mild steel. The trouble with brushless is the electronics need to be over-engineered, just \"making the grade\" ain\\'t enough.\\nFlexvolt 414; I\\'m coming for you!',)", "link": "('https://forum.toolsinaction.com/topic/8283-what-tools-did-you-buy-today/page/303/#elControls_192943_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('on 12/26/2017 at 6:39 pm, biggie said:\\nthat\\'s a bummer for a new toy.\\nafter watching workshop addicts video on the new ryobi brushless tools it was kind of disappointing. the grinder, recip, and circular saws all seemed to cut out even when not pushed very hard. i know they\\'re more of a homeowner/-----> diy !!!  grade of tool, maybe they\\'ll perform better when/if they come out with their larger batteries.\\nagreed, not trade-grade, but shouldn\\'t falter on cutting a bit of mild steel. the trouble with brushless is the electronics need to be over-engineered, just \"making the grade\" ain\\'t enough.\\nflexvolt 414; i\\'m coming for you!',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 9546, "autor": "Biggie", "date": 1637366400000, "content": "('There could be a lot of discussion on this subject and it really comes down to what you\\'re using the grinder for. Even a cheap corded grinder is probably more powerful than most cordless models but not nearly as convenient. All cordless models are power hungry so brushless is the way to go and it doesn\\'t hurt to have a good supply of larger a/h batteries as they perform better on bigger batteries. If you\\'ve never used a cordless before and you do a lot of heavy grinding you may be disappointed with a cordless or find that it\\'s the wrong tool for you. I have a ag construction company that does concrete, metal fab/millwright and iron work. There was a time ten years ago I would have said a cordless grinder was useless and now I don\\'t carry a corded grinder on my truck and I couldn\\'t tell you the last time I used a corded. I have experience with bosch, dewalt, and milwaukee cordless and to this day I would still say the dewalt flexvolt 60v grinder is the closest thing to corded. When it comes to 18-20v grinders the bosch, dewalt, and milwaukee all perform about the same, it\\'s really just what battery line you\\'re in.\\nAll that being said and assuming you want to stick with dewalt you have to make the decision about 20v or 60v. The 60v is a more powerful grinder but if you don\\'t have any flexvolt batteries you\\'re going to have to invest a little bit into batteries.\\nThere are really two models in the 60v.\\n-Dcg414 is the original 60v. I have this model and think it\\'s very comparable in power to corded.\\n-dcg418 is the newest 60v it got a small bump in power from the 414 and if you go 60v it\\'s the model you should look for.\\nIf you\\'re looking at 20v there\\'s pretty much 4 models.\\n-dcg412 is a old brushed model and isn\\'t terrible for diy or if you have a lot of batteries. 6.0ah and higher batteries really perk up the power on them too.\\n-dcg413 was dewalts first 20v brushless and is a very solid performer. Also the dcg405 is the same model but with a slide switch instead of a paddle.\\n-dcg415 \"power detect\" Lowes was given this model as an updated brushless that gives better performance with 21700 cell batteries.\\nDcg416 \"flexvolt advantage\" Home Depot got this as as an updated brushless model and it\\'s said to perform better on the flexvolt batteries.\\nI don\\'t have any experience with the \"power detect\" or \"flexvolt advantage\" models but I really think it\\'s more marketing hype than anything. They might have a little more power but if you put the newest biggest batteries on the dcg413 you\\'re going to see power gains too. If you went the 20v route the dcg415 or dcg416 are the models I would look at as they are the newest just choose which ever batteries you have or if you\\'re a lowes or homedepot person.',)", "link": "('https://forum.toolsinaction.com/topic/18584-cordless-angle-grinder-advice/#elControls_215850_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('there could be a lot of discussion on this subject and it really comes down to what you\\'re using the grinder for. even a cheap corded grinder is probably more powerful than most cordless models but not nearly as convenient. all cordless models are power hungry so brushless is the way to go and it doesn\\'t hurt to have a good supply of larger a/h batteries as they perform better on bigger batteries. if you\\'ve never used a cordless before and you do a lot of heavy grinding you may be disappointed with a cordless or find that it\\'s the wrong tool for you. i have a ag construction company that does concrete, metal fab/millwright and iron work. there was a time ten years ago i would have said a cordless grinder was useless and now i don\\'t carry a corded grinder on my truck and i couldn\\'t tell you the last time i used a corded. i have experience with bosch, dewalt, and milwaukee cordless and to this day i would still say the dewalt flexvolt 60v grinder is the closest thing to corded. when it comes to 18-20v grinders the bosch, dewalt, and milwaukee all perform about the same, it\\'s really just what battery line you\\'re in.\\nall that being said and assuming you want to stick with dewalt you have to make the decision about 20v or 60v. the 60v is a more powerful grinder but if you don\\'t have any flexvolt batteries you\\'re going to have to invest a little bit into batteries.\\nthere are really two models in the 60v.\\n-dcg414 is the original 60v. i have this model and think it\\'s very comparable in power to corded.\\n-dcg418 is the newest 60v it got a small bump in power from the 414 and if you go 60v it\\'s the model you should look for.\\nif you\\'re looking at 20v there\\'s pretty much 4 models.\\n-dcg412 is a old brushed model and isn\\'t terrible for -----> diy !!!  or if you have a lot of batteries. 6.0ah and higher batteries really perk up the power on them too.\\n-dcg413 was dewalts first 20v brushless and is a very solid performer. also the dcg405 is the same model but with a slide switch instead of a paddle.\\n-dcg415 \"power detect\" lowes was given this model as an updated brushless that gives better performance with 21700 cell batteries.\\ndcg416 \"flexvolt advantage\" home depot got this as as an updated brushless model and it\\'s said to perform better on the flexvolt batteries.\\ni don\\'t have any experience with the \"power detect\" or \"flexvolt advantage\" models but i really think it\\'s more marketing hype than anything. they might have a little more power but if you put the newest biggest batteries on the dcg413 you\\'re going to see power gains too. if you went the 20v route the dcg415 or dcg416 are the models i would look at as they are the newest just choose which ever batteries you have or if you\\'re a lowes or homedepot person.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 9558, "autor": "ToolBane", "date": 1637366400000, "content": "('Well at the end of the day you’re only talking about $20-30 for a very infrequently used tool...it’s not a lot of money you’re throwing at something, and like anything else you just go in knowing that you get what you pay for. To be straight about it this is almost certainly going to be verging on throwaway quality, but hey maybe you’ll be asking so little out of it that it ends up being more than you need, with almost no money lost. Nothing wrong with that. That’s probably most of their buyers and they seem to review it positively over the one year that it’s been available. Which for all I know is as long as the company has existed.\\nI’m not much a fan of buying these “here today, gone tomorrow” brands even if only out of principle though. Dewalt is a spendy alternative but there are other established options at more intermediate prices and a small price premium can still get you into brands that are still very affordable but have been around for years with very good track records who won’t be going out the door any time soon.\\nDremel, for example:\\nhttps://www.amazon.com/dp/B07DNXM8WC/ref=sspa_mw_detail_5?psc=1&pd_rd_i=B07DNXM8WC&pd_rd_w=mpyA7&pf_rd_p=8d3ccc9b-7c46-4140-a2c8-84db90b0a2f6&pd_rd_wg=G2lyk&pf_rd_r=M7MMD99SWEFWC4Y01PEP&pd_rd_r=1556ebfe-2117-4027-ac4c-a4c23051c69a&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyQlU4Uk9TMFBQR0U1JmVuY3J5cHRlZElkPUEwODkwODQwM1BSTFpYR1I0M1ZXSSZlbmNyeXB0ZWRBZElkPUEwOTYwNzU5M1ZESlM1WDJZUjdYNCZ3aWRnZXROYW1lPXNwX3Bob25lX2RldGFpbF90aGVtYXRpYyZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=\\nYeesh, what a needlessly long link.\\nBut Dremel’s been around for decades. It will be built more solidly and should be less likely to have reliability issues. I would see that as an option that makes sense if you want more long-term peace of mind for an established brand at a small price premium.\\nAnother popular one could be Ryobi:\\nhttps://www.homedepot.com/s/ryobi screwdriver?searchtype=text&NCNI-5\\nAnother brand that’s been around for decades. Tool snobs will still talk down on them but for DIY utility they’re fine. They’re readily available and aren’t the kind of company that may up and vanish two months after you buy it.',)", "link": "('https://forum.toolsinaction.com/topic/16170-hychika-does-anyone-know-this-brand-anyone-use-their-tools/#elControls_208793_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('well at the end of the day you’re only talking about $20-30 for a very infrequently used tool...it’s not a lot of money you’re throwing at something, and like anything else you just go in knowing that you get what you pay for. to be straight about it this is almost certainly going to be verging on throwaway quality, but hey maybe you’ll be asking so little out of it that it ends up being more than you need, with almost no money lost. nothing wrong with that. that’s probably most of their buyers and they seem to review it positively over the one year that it’s been available. which for all i know is as long as the company has existed.\\ni’m not much a fan of buying these “here today, gone tomorrow” brands even if only out of principle though. dewalt is a spendy alternative but there are other established options at more intermediate prices and a small price premium can still get you into brands that are still very affordable but have been around for years with very good track records who won’t be going out the door any time soon.\\ndremel, for example:\\nhttps://www.amazon.com/dp/b07dnxm8wc/ref=sspa_mw_detail_5?psc=1&pd_rd_i=b07dnxm8wc&pd_rd_w=mpya7&pf_rd_p=8d3ccc9b-7c46-4140-a2c8-84db90b0a2f6&pd_rd_wg=g2lyk&pf_rd_r=m7mmd99swefwc4y01pep&pd_rd_r=1556ebfe-2117-4027-ac4c-a4c23051c69a&spla=zw5jcnlwdgvkuxvhbglmawvypueyqlu4uk9tmfbqr0u1jmvuy3j5chrlzelkpuewodkwodqwm1bstfpyr1i0m1zxsszlbmnyexb0zwrbzelkpuewotywnzu5m1zeslm1wdjzujdyncz3awrnzxroyw1lpxnwx3bob25lx2rldgfpbf90agvtyxrpyyzhy3rpb249y2xpy2tszwrpcmvjdczkb05vdexvz0nsawnrpxrydwu=\\nyeesh, what a needlessly long link.\\nbut dremel’s been around for decades. it will be built more solidly and should be less likely to have reliability issues. i would see that as an option that makes sense if you want more long-term peace of mind for an established brand at a small price premium.\\nanother popular one could be ryobi:\\nhttps://www.homedepot.com/s/ryobi screwdriver?searchtype=text&ncni-5\\nanother brand that’s been around for decades. tool snobs will still talk down on them but for -----> diy !!!  utility they’re fine. they’re readily available and aren’t the kind of company that may up and vanish two months after you buy it.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 9559, "autor": "Judy", "date": 1637366400000, "content": "('On 7/31/2020 at 10:12 AM, ToolBane said:\\nWell at the end of the day you’re only talking about $20-30 for a very infrequently used tool...it’s not a lot of money you’re throwing at something, and like anything else you just go in knowing that you get what you pay for. To be straight about it this is almost certainly going to be verging on throwaway quality, but hey maybe you’ll be asking so little out of it that it ends up being more than you need, with almost no money lost. Nothing wrong with that. That’s probably most of their buyers and they seem to review it positively over the one year that it’s been available. Which for all I know is as long as the company has existed.\\nI’m not much a fan of buying these “here today, gone tomorrow” brands even if only out of principle though. Dewalt is a spendy alternative but there are other established options at more intermediate prices and a small price premium can still get you into brands that are still very affordable but have been around for years with very good track records who won’t be going out the door any time soon.\\nDremel, for example:\\nhttps://www.amazon.com/dp/B07DNXM8WC/ref=sspa_mw_detail_5?psc=1&pd_rd_i=B07DNXM8WC&pd_rd_w=mpyA7&pf_rd_p=8d3ccc9b-7c46-4140-a2c8-84db90b0a2f6&pd_rd_wg=G2lyk&pf_rd_r=M7MMD99SWEFWC4Y01PEP&pd_rd_r=1556ebfe-2117-4027-ac4c-a4c23051c69a&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyQlU4Uk9TMFBQR0U1JmVuY3J5cHRlZElkPUEwODkwODQwM1BSTFpYR1I0M1ZXSSZlbmNyeXB0ZWRBZElkPUEwOTYwNzU5M1ZESlM1WDJZUjdYNCZ3aWRnZXROYW1lPXNwX3Bob25lX2RldGFpbF90aGVtYXRpYyZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=\\nYeesh, what a needlessly long link.\\nBut Dremel’s been around for decades. It will be built more solidly and should be less likely to have reliability issues. I would see that as an option that makes sense if you want more long-term peace of mind for an established brand at a small price premium.\\nAnother popular one could be Ryobi:\\nhttps://www.homedepot.com/s/ryobi screwdriver?searchtype=text&NCNI-5\\nAnother brand that’s been around for decades. Tool snobs will still talk down on them but for DIY utility they’re fine. They’re readily available and aren’t the kind of company that may up and vanish two months after you buy it.\\nExpand\\nwow Ken, you are so kind to introduce these nice products. Thanks for your advice, I will look into that.',)", "link": "('https://forum.toolsinaction.com/topic/16170-hychika-does-anyone-know-this-brand-anyone-use-their-tools/#elControls_208831_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('on 7/31/2020 at 10:12 am, toolbane said:\\nwell at the end of the day you’re only talking about $20-30 for a very infrequently used tool...it’s not a lot of money you’re throwing at something, and like anything else you just go in knowing that you get what you pay for. to be straight about it this is almost certainly going to be verging on throwaway quality, but hey maybe you’ll be asking so little out of it that it ends up being more than you need, with almost no money lost. nothing wrong with that. that’s probably most of their buyers and they seem to review it positively over the one year that it’s been available. which for all i know is as long as the company has existed.\\ni’m not much a fan of buying these “here today, gone tomorrow” brands even if only out of principle though. dewalt is a spendy alternative but there are other established options at more intermediate prices and a small price premium can still get you into brands that are still very affordable but have been around for years with very good track records who won’t be going out the door any time soon.\\ndremel, for example:\\nhttps://www.amazon.com/dp/b07dnxm8wc/ref=sspa_mw_detail_5?psc=1&pd_rd_i=b07dnxm8wc&pd_rd_w=mpya7&pf_rd_p=8d3ccc9b-7c46-4140-a2c8-84db90b0a2f6&pd_rd_wg=g2lyk&pf_rd_r=m7mmd99swefwc4y01pep&pd_rd_r=1556ebfe-2117-4027-ac4c-a4c23051c69a&spla=zw5jcnlwdgvkuxvhbglmawvypueyqlu4uk9tmfbqr0u1jmvuy3j5chrlzelkpuewodkwodqwm1bstfpyr1i0m1zxsszlbmnyexb0zwrbzelkpuewotywnzu5m1zeslm1wdjzujdyncz3awrnzxroyw1lpxnwx3bob25lx2rldgfpbf90agvtyxrpyyzhy3rpb249y2xpy2tszwrpcmvjdczkb05vdexvz0nsawnrpxrydwu=\\nyeesh, what a needlessly long link.\\nbut dremel’s been around for decades. it will be built more solidly and should be less likely to have reliability issues. i would see that as an option that makes sense if you want more long-term peace of mind for an established brand at a small price premium.\\nanother popular one could be ryobi:\\nhttps://www.homedepot.com/s/ryobi screwdriver?searchtype=text&ncni-5\\nanother brand that’s been around for decades. tool snobs will still talk down on them but for -----> diy !!!  utility they’re fine. they’re readily available and aren’t the kind of company that may up and vanish two months after you buy it.\\nexpand\\nwow ken, you are so kind to introduce these nice products. thanks for your advice, i will look into that.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 9566, "autor": "Mathew123", "date": 1637366400000, "content": "(\"Can't say I've heard of it. There are many good brands to buy from. I recommend to buy a good tool that would last a long time even if you're using them for diy.\",)", "link": "('https://forum.toolsinaction.com/topic/16170-hychika-does-anyone-know-this-brand-anyone-use-their-tools/#elControls_215315_menu',)", "origin": "Toolsinaction", "suborigin": "Power Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"can't say i've heard of it. there are many good brands to buy from. i recommend to buy a good tool that would last a long time even if you're using them for -----> diy !!! .\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000003, "year": "2021"}, {"Unnamed: 0": 9753, "autor": "rdst_1", "date": 1637366400000, "content": "(\"For someone who doesn't have a lot to splurge, which Knipex pliers would you guys suggest that would help achieve 90% of the work if laying plumbing for a house. I am gonna be using GI Pipes although plastic pipes are also available.\\nI wouldn't mind buying 2-3 different types, but I just don't want to end up buying ones which serve similar purposes.\\nI am thinking of ordering at least the 12 inch Plier Wrench and Pipe Wrench S-type.\\nIf ordering more than one, it is cheaper for me to purchase from Amazon.de than Amazon.com, for someone ordering from India.\\nI also have the option to buy from Indian distributor but I know that their prices will be over-inflated.\\nFor a moment, I was tempted by going for more mainstream DIY options like Irwin Groovelock, but considering I am starting to build my tools collection, I think it would be wiser to splurge on a quality product now than a cheaper one which I might have to replace a lot quicker in the future.\",)", "link": "('https://forum.toolsinaction.com/topic/11900-knipex-pliers-have-me-hooked/page/2/#elControls_171147_menu',)", "origin": "Toolsinaction", "suborigin": "Hand Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"for someone who doesn't have a lot to splurge, which knipex pliers would you guys suggest that would help achieve 90% of the work if laying plumbing for a house. i am gonna be using gi pipes although plastic pipes are also available.\\ni wouldn't mind buying 2-3 different types, but i just don't want to end up buying ones which serve similar purposes.\\ni am thinking of ordering at least the 12 inch plier wrench and pipe wrench s-type.\\nif ordering more than one, it is cheaper for me to purchase from amazon.de than amazon.com, for someone ordering from india.\\ni also have the option to buy from indian distributor but i know that their prices will be over-inflated.\\nfor a moment, i was tempted by going for more mainstream -----> diy !!!  options like irwin groovelock, but considering i am starting to build my tools collection, i think it would be wiser to splurge on a quality product now than a cheaper one which i might have to replace a lot quicker in the future.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000005, "year": "2021"}, {"Unnamed: 0": 9754, "autor": "BMack37", "date": 1637366400000, "content": "(\"On 2/7/2017 at 6:49 PM, rdst_1 said:\\nFor someone who doesn't have a lot to splurge, which Knipex pliers would you guys suggest that would help achieve 90% of the work if laying plumbing for a house. I am gonna be using GI Pipes although plastic pipes are also available.\\nI wouldn't mind buying 2-3 different types, but I just don't want to end up buying ones which serve similar purposes.\\nI am thinking of ordering at least the 12 inch Plier Wrench and Pipe Wrench S-type.\\nIf ordering more than one, it is cheaper for me to purchase from Amazon.de than Amazon.com, for someone ordering from India.\\nI also have the option to buy from Indian distributor but I know that their prices will be over-inflated.\\nFor a moment, I was tempted by going for more mainstream DIY options like Irwin Groovelock, but considering I am starting to build my tools collection, I think it would be wiser to splurge on a quality product now than a cheaper one which I might have to replace a lot quicker in the future.\\nExpand\\nTo be honest, if you're building a collection on a limited budget Channellock might be a better option. Often you can get two or three Channellock for the cost of one Knipex. Knipex is great and I love them but often there is a Channellock available that will do the job and do it for a long time.\",)", "link": "('https://forum.toolsinaction.com/topic/11900-knipex-pliers-have-me-hooked/page/2/#elControls_171180_menu',)", "origin": "Toolsinaction", "suborigin": "Hand Tools", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"on 2/7/2017 at 6:49 pm, rdst_1 said:\\nfor someone who doesn't have a lot to splurge, which knipex pliers would you guys suggest that would help achieve 90% of the work if laying plumbing for a house. i am gonna be using gi pipes although plastic pipes are also available.\\ni wouldn't mind buying 2-3 different types, but i just don't want to end up buying ones which serve similar purposes.\\ni am thinking of ordering at least the 12 inch plier wrench and pipe wrench s-type.\\nif ordering more than one, it is cheaper for me to purchase from amazon.de than amazon.com, for someone ordering from india.\\ni also have the option to buy from indian distributor but i know that their prices will be over-inflated.\\nfor a moment, i was tempted by going for more mainstream -----> diy !!!  options like irwin groovelock, but considering i am starting to build my tools collection, i think it would be wiser to splurge on a quality product now than a cheaper one which i might have to replace a lot quicker in the future.\\nexpand\\nto be honest, if you're building a collection on a limited budget channellock might be a better option. often you can get two or three channellock for the cost of one knipex. knipex is great and i love them but often there is a channellock available that will do the job and do it for a long time.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000005, "year": "2021"}, {"Unnamed: 0": 9820, "autor": "nuttinshowing", "date": 1637366400000, "content": "(\"Good to go. Just conducted a torque test on my new M18 Gen 2 Mid torque impact wrench to determine fastening torque Mode 1 & then Mode 4. Non-scientific of course, more like a working stiff kind of test. Placed a trailer ball hitch with fastening nut 1 1/8 head in the vice and rattled down twice in mode 1. . Ugga dugga rattled for about 3 seconds after secure. Torqued to about 80lbs ish both times. This mode provides less torque than Mode 2 or 3. Verified the torque with two different torque wrenchs at breakaway torque. Loosening & tightening breakaway. Mode 4 minimal torque 15-20lbs just beyond hand tight. That mode is for delicate applications and operated as it should. New stuff for me, always tightened with manual wrench never used impact wrench. A bit overkill as main use will be for mower blade removal/installs, DIY car stuff.Getting older now, curious about using the impact and want to use it cautiously and not over tighten and make trouble for myself, Could of gotten by with a less powerful unit like the M12 Stubby but, for now I think I'm sticking with the big boy.\\nAnybody else conduct DIY fastening torque tests in different modes?\",)", "link": "('https://forum.toolsinaction.com/topic/16793-milwaukeem18-gen-2-impact-wrench-mid-torque-fastening-torque-mode-1/#elControls_210920_menu',)", "origin": "Toolsinaction", "suborigin": "Test & Measurement", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "(\"good to go. just conducted a torque test on my new m18 gen 2 mid torque impact wrench to determine fastening torque mode 1 & then mode 4. non-scientific of course, more like a working stiff kind of test. placed a trailer ball hitch with fastening nut 1 1/8 head in the vice and rattled down twice in mode 1. . ugga dugga rattled for about 3 seconds after secure. torqued to about 80lbs ish both times. this mode provides less torque than mode 2 or 3. verified the torque with two different torque wrenchs at breakaway torque. loosening & tightening breakaway. mode 4 minimal torque 15-20lbs just beyond hand tight. that mode is for delicate applications and operated as it should. new stuff for me, always tightened with manual wrench never used impact wrench. a bit overkill as main use will be for mower blade removal/installs, -----> diy !!!  car stuff.getting older now, curious about using the impact and want to use it cautiously and not over tighten and make trouble for myself, could of gotten by with a less powerful unit like the m12 stubby but, for now i think i'm sticking with the big boy.\\nanybody else conduct diy fastening torque tests in different modes?\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000006, "year": "2021"}, {"Unnamed: 0": 10956, "autor": "paulengr", "date": 1637366400000, "content": "('Disagree about learning stick first. MIG is just so easy you can figure it out yourself in about an hour. Especially flux core. Also here’s the thing. Welding is not just a typical skill. It’s NOT like riding a bike. I learned to ride a bike decades ago. I can get on a bike any time and just go. You don’t lose it over time. With welding if you don’t do it almost every day, you very quickly get rusty, especially with stick and TIG. You can’t just grab a rid can and have at it. Best to burn a couple rods getting back in the groove. MIG however is so simple and easy it’s actually like that. I believe anyone can operate a MIG with minimal practice and get it right. It’s the perfect machine for weekend warriors that might not touch a welder for months. So for these reasons I suggest learning MIG first. Sure it will ruin you. So what.\\nNot a fan of “multiprocess”. Let’s face it though almost anything can stick weld so really we’re talking about the difference between say a MIG suitcase welder and a TIG. You can buy a top end TIG for $800 (AHZp) and a decent MIG for $300 so total cost for all three major processes is $1100. The low end ESAB Rebels start at over $1500. I still wouldn’t consider them good TIG machines compared to AHP. So you’re just getting a very expensive MIG. Plus you can customize and set up each one separately and repair/replacement doesn’t break the budget.\\nBig thing about TIG is the control. You can weld almost any metal, especially copper, aluminum at any thickness even aluminum foil, and even titanium. The downside is that it’s slow and has a very high UV output although if it wasn’t for that you could weld in a T shirt. A real TIG welder lets you alter the Positive and negative cycle to alter the cleaning vs welding effect and has HF start. The AHP has all that for around $800. In Miller and Lincoln you don’t see that until almost $3000. Even the ESAB multiprocess doesn’t have good TIG. Which is my point...different welders for different purposes. An all in one has too many compromises and kills the budget. You can also stick weld with these.\\nIn MIG look specifically for AC and DC. A decent suitcase welder will run close to the AHP price although as mentioned a decent basic HF one sets you back about half that. Again it stick welds too.\\nFinally don’t forget brazing and torch welding. Both are like some kind of lost art. You can brake aluminum. It’s not as good as TIG but costs almost nothing other than materials and takes almost no training, same with most brazing. Torch welding is one of the best ways to weld cast iron with high nickel rod so worth doing even if it’s mostly forgotten. And torch sets are ridiculously cheap,\\nWhich brings me to my final point. The thing about welding is that you really are talking about fabrication. There are a lot of tools in fabrication that you really need and hold their own. Even before welding you need to cut material and frequently bevel it, and grind welds flat. Also need pre and post hearing. This means saws, grinders, drills, and a torch. Possibly many kinds if benders, presses, rams, and lots and lots of clamps. You can do a lot of things with all of these tools without a welder but not vice versa. In fact with the correct tip the torch welds as well as brazes.\\nI’d suggest starting there first. Build up your fab shop first. Maybe get into 80/20 or T-slot stuff. I do a lot of fabrication all the time without a welder. Then MIG/stick and finally TIG, if you need it.\\nThe big thing about stick is penetration. You can use a 6011 P6 rod and burn through rusty, crappy junk steel and still make good quality root passes. An engine welder is a go anywhere tool. That’s why you see one in probably half the service trucks on the road. It can do a lot and there are some truck rods but outside of steel it’s pretty limited. There are high nickel rods that do decent on cast iron, stainless rods, and some so-so aluminum rods. Stick welders do excellent on thick structural aluminum,\\nIn MIG I used to scoff at it. It was for Saturday afternoon car shows only. But especially with electronic welders now we have dirt cheap teeny suitcase welders that can go anywhere. 220 is better but they can run off an extension cord! These are very fast and have quickly become the construction trade welder of choice. You can do aluminum but you have to run very fast and very hot. Very little smoke, very short learning curve. Biggest downside is bottles (except flux core) and you need to work at it for penetration.\\nAlready commented on TIG. Need variable positive/negative and HF start. You CAN scratch start and try to get by on pure AC but essentially it’s going to suck. These “options” make TIG much easier when it’s already hard. With TIG the big advantage is ultimate control. You control the heat, filler material, and cleaning/welding. With a pure inert atmosphere small heat affected zone you can do so much with it. But it’s also a three handed welding process. Foot pedal for current control, one hand on the gun, one on the filler rod. Staring at a tiny puddle. Sort of the polar opposite of MIG.\\nLots of comments too about what amounts mostly to Chinese made machines. I’ll just say this. Miller, ESAB, and Lincoln are making them in the same factories.!i wish they bring it back here. There are quality differences to be sure. Lots of YouTube reviews pointing this out. But especially now that welders are mostly electronic (MOSFET, SCR or IGBT) build quality is drastically improving on the cheap machines. It’s getting hard to ignore say an Eastwood when performance is as good as Lincoln and maybe ESAB. The downside is repairs.’But that’s less critical on a DIY machine compared to say a CAT mechanic. And less of a big deal for the weekend warrior compared to a guy that is welding 4-8 hours a day, 5+ days a week. Operating hours are drastically less.\\nThat being said, also suggest shopping used market. Not EBay. More like Craig’s List. Ideal is to find a big expensive but older Miller or Lincoln but at the new Chinese made buzz box price. Don’t discount looking at the welding supply shop either.\\nAgreed about Tweco. If you are unwilling to risk your purchase on Chinese made machine (Harbor Freight, Hobart, Everlast, Eastwood) and you’d rather risk it on a machine made in China it’s not a bad way to go.\\nAs far as Red, Yellow, and Blue, Red and Yellow lately have been coming down in price with some very competitive machines compared to the past. Blue is still crazy high.\\nAnother thing to think about. Priced a generator lately? Look at the price of an engine welder that just happens to have say a 20 kW generator as well. Often this is much cheaper than a dedicated generator. And often the wife will happily say yes to the generator when it was no to the welder. It’s a win-win. Course you need that 220’receptacle to be a plug now!',)", "link": "('https://forum.toolsinaction.com/topic/10743-beginner-welder-recomendations/#elControls_208281_menu',)", "origin": "Toolsinaction", "suborigin": "Welding/Metal Working", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('disagree about learning stick first. mig is just so easy you can figure it out yourself in about an hour. especially flux core. also here’s the thing. welding is not just a typical skill. it’s not like riding a bike. i learned to ride a bike decades ago. i can get on a bike any time and just go. you don’t lose it over time. with welding if you don’t do it almost every day, you very quickly get rusty, especially with stick and tig. you can’t just grab a rid can and have at it. best to burn a couple rods getting back in the groove. mig however is so simple and easy it’s actually like that. i believe anyone can operate a mig with minimal practice and get it right. it’s the perfect machine for weekend warriors that might not touch a welder for months. so for these reasons i suggest learning mig first. sure it will ruin you. so what.\\nnot a fan of “multiprocess”. let’s face it though almost anything can stick weld so really we’re talking about the difference between say a mig suitcase welder and a tig. you can buy a top end tig for $800 (ahzp) and a decent mig for $300 so total cost for all three major processes is $1100. the low end esab rebels start at over $1500. i still wouldn’t consider them good tig machines compared to ahp. so you’re just getting a very expensive mig. plus you can customize and set up each one separately and repair/replacement doesn’t break the budget.\\nbig thing about tig is the control. you can weld almost any metal, especially copper, aluminum at any thickness even aluminum foil, and even titanium. the downside is that it’s slow and has a very high uv output although if it wasn’t for that you could weld in a t shirt. a real tig welder lets you alter the positive and negative cycle to alter the cleaning vs welding effect and has hf start. the ahp has all that for around $800. in miller and lincoln you don’t see that until almost $3000. even the esab multiprocess doesn’t have good tig. which is my point...different welders for different purposes. an all in one has too many compromises and kills the budget. you can also stick weld with these.\\nin mig look specifically for ac and dc. a decent suitcase welder will run close to the ahp price although as mentioned a decent basic hf one sets you back about half that. again it stick welds too.\\nfinally don’t forget brazing and torch welding. both are like some kind of lost art. you can brake aluminum. it’s not as good as tig but costs almost nothing other than materials and takes almost no training, same with most brazing. torch welding is one of the best ways to weld cast iron with high nickel rod so worth doing even if it’s mostly forgotten. and torch sets are ridiculously cheap,\\nwhich brings me to my final point. the thing about welding is that you really are talking about fabrication. there are a lot of tools in fabrication that you really need and hold their own. even before welding you need to cut material and frequently bevel it, and grind welds flat. also need pre and post hearing. this means saws, grinders, drills, and a torch. possibly many kinds if benders, presses, rams, and lots and lots of clamps. you can do a lot of things with all of these tools without a welder but not vice versa. in fact with the correct tip the torch welds as well as brazes.\\ni’d suggest starting there first. build up your fab shop first. maybe get into 80/20 or t-slot stuff. i do a lot of fabrication all the time without a welder. then mig/stick and finally tig, if you need it.\\nthe big thing about stick is penetration. you can use a 6011 p6 rod and burn through rusty, crappy junk steel and still make good quality root passes. an engine welder is a go anywhere tool. that’s why you see one in probably half the service trucks on the road. it can do a lot and there are some truck rods but outside of steel it’s pretty limited. there are high nickel rods that do decent on cast iron, stainless rods, and some so-so aluminum rods. stick welders do excellent on thick structural aluminum,\\nin mig i used to scoff at it. it was for saturday afternoon car shows only. but especially with electronic welders now we have dirt cheap teeny suitcase welders that can go anywhere. 220 is better but they can run off an extension cord! these are very fast and have quickly become the construction trade welder of choice. you can do aluminum but you have to run very fast and very hot. very little smoke, very short learning curve. biggest downside is bottles (except flux core) and you need to work at it for penetration.\\nalready commented on tig. need variable positive/negative and hf start. you can scratch start and try to get by on pure ac but essentially it’s going to suck. these “options” make tig much easier when it’s already hard. with tig the big advantage is ultimate control. you control the heat, filler material, and cleaning/welding. with a pure inert atmosphere small heat affected zone you can do so much with it. but it’s also a three handed welding process. foot pedal for current control, one hand on the gun, one on the filler rod. staring at a tiny puddle. sort of the polar opposite of mig.\\nlots of comments too about what amounts mostly to chinese made machines. i’ll just say this. miller, esab, and lincoln are making them in the same factories.!i wish they bring it back here. there are quality differences to be sure. lots of youtube reviews pointing this out. but especially now that welders are mostly electronic (mosfet, scr or igbt) build quality is drastically improving on the cheap machines. it’s getting hard to ignore say an eastwood when performance is as good as lincoln and maybe esab. the downside is repairs.’but that’s less critical on a -----> diy !!!  machine compared to say a cat mechanic. and less of a big deal for the weekend warrior compared to a guy that is welding 4-8 hours a day, 5+ days a week. operating hours are drastically less.\\nthat being said, also suggest shopping used market. not ebay. more like craig’s list. ideal is to find a big expensive but older miller or lincoln but at the new chinese made buzz box price. don’t discount looking at the welding supply shop either.\\nagreed about tweco. if you are unwilling to risk your purchase on chinese made machine (harbor freight, hobart, everlast, eastwood) and you’d rather risk it on a machine made in china it’s not a bad way to go.\\nas far as red, yellow, and blue, red and yellow lately have been coming down in price with some very competitive machines compared to the past. blue is still crazy high.\\nanother thing to think about. priced a generator lately? look at the price of an engine welder that just happens to have say a 20 kw generator as well. often this is much cheaper than a dedicated generator. and often the wife will happily say yes to the generator when it was no to the welder. it’s a win-win. course you need that 220’receptacle to be a plug now!',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000013, "year": "2021"}, {"Unnamed: 0": 20974, "autor": "comp56", "date": 1637366400000, "content": "('Porter Cable was a well respected tool company years ago, however it has entered a DIY area of the market and if you talk to anyone 50+ years old with experience with the company will agree they are not the same as they once were......',)", "link": "('https://forum.toolsinaction.com/topic/10653-porter-cable-you-have-failed-me/#elControls_144394_menu',)", "origin": "Toolsinaction", "suborigin": "Pub Talk", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "('porter cable was a well respected tool company years ago, however it has entered a -----> diy !!!  area of the market and if you talk to anyone 50+ years old with experience with the company will agree they are not the same as they once were......',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 134000017, "year": "2021"}], "name": "diy2021"}