{"interestingcomments": [{"Unnamed: 0": 304972, "autor": "Thedirtyjersey", "date": 1583945563000, "content": "Dead v370 Epson? Have cleaned inside/outside glass and sensor mirror /!/ Link to examples (First is exposure pushed to show lines, 2nd picture is fainter but clearly visible in photos) https://imgur.com/a/RB3Itz5\n\nI bought a refurbished v370 more than a year ago. It stayed in a room with a fair amount of dust. Finally started my family album archive project and noticed S-Curve adjustments brought out clear lines everywhere. \n\nI cracked the unit open, have used zeiss and vius cleaner with microfiber on the glass, also use a fresh dry camera sensor swab (hermetically sealed prior) with no cleaner on the optical mirror where I saw some dust. \n\nThis includes the calibration strip area. Cannot seem to get rid of black specs and these crazy lines. Is this really a lamp issue or dust somewhere I'm not thinking of? \n\nI've already gone ahead and bought a v600 since they're cheap but I'd like to save this model as a backup since selling it is a hassle. Any thoughts would be much appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fh09mt/dead_v370_epson_have_cleaned_insideoutside_glass/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "dead v370 epson? have cleaned inside/outside glass and sensor mirror /!/ link to examples (first is exposure pushed to show lines, 2nd picture is fainter but clearly visible in photos) https://imgur.com/a/rb3itz5\n\ni bought a refurbished v370 more than a year ago. it stayed in a room with a fair amount of dust. finally started my family album -----> archive !!!  project and noticed s-curve adjustments brought out clear lines everywhere. \n\ni cracked the unit open, have used zeiss and vius cleaner with microfiber on the glass, also use a fresh dry camera sensor swab (hermetically sealed prior) with no cleaner on the optical mirror where i saw some dust. \n\nthis includes the calibration strip area. cannot seem to get rid of black specs and these crazy lines. is this really a lamp issue or dust somewhere i'm not thinking of? \n\ni've already gone ahead and bought a v600 since they're cheap but i'd like to save this model as a backup since selling it is a hassle. any thoughts would be much appreciated!", "sortedWord": "None", "identifyer": 51895, "year": "2020"}, {"Unnamed: 0": 305532, "autor": "MKtheinstrumentalist", "date": 1602662669000, "content": "Best-quality scanner for photo-prints? (not film) /!/ What's the actual best scanner that does glossy prints/polaroids in the best quality - the only articles I can find that actually do proper spec comparisons just talk about specialty film-scanners, not about prints. \n\nI'm assuming the same generalities apply but this is for an archive/preservation project we only have one shot at - I need it to be perfect first time. I'm talking 4800dpi+ on postcard-sized prints, we need to juice absolutely every last bit of detail out of them since the original film negatives aren't around. Filesize is not an issue, we're aiming for near 1:1 preservation if possible - maybe even more if things like Sattva/RONC prove useful for extracting even more out of the ink-print patterns, depending on how they were done. \n\nI already wasted my money on two different 'professional' Epsons (v370 and 10000XL) that turned out to do blurry undersaturated messes and I'm not about to fall for that again so easily. I'm just sick of google only spitting out 'top best scanners of 2020' articles and trying to tell me it's the bloomin' FastFoto lol", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jawjae/bestquality_scanner_for_photoprints_not_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "best-quality scanner for photo-prints? (not film) /!/ what's the actual best scanner that does glossy prints/polaroids in the best quality - the only articles i can find that actually do proper spec comparisons just talk about specialty film-scanners, not about prints. \n\ni'm assuming the same generalities apply but this is for an -----> archive !!! /preservation project we only have one shot at - i need it to be perfect first time. i'm talking 4800dpi+ on postcard-sized prints, we need to juice absolutely every last bit of detail out of them since the original film negatives aren't around. filesize is not an issue, we're aiming for near 1:1 preservation if possible - maybe even more if things like sattva/ronc prove useful for extracting even more out of the ink-print patterns, depending on how they were done. \n\ni already wasted my money on two different 'professional' epsons (v370 and 10000xl) that turned out to do blurry undersaturated messes and i'm not about to fall for that again so easily. i'm just sick of google only spitting out 'top best scanners of 2020' articles and trying to tell me it's the bloomin' fastfoto lol", "sortedWord": "None", "identifyer": 52464, "year": "2020"}, {"Unnamed: 0": 305846, "autor": "newname3210", "date": 1599746434000, "content": "There are many old books on photography and darkrooms available for free on the Internet Archive (archive.org)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iq3tzk/there_are_many_old_books_on_photography_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "there are many old books on photography and darkrooms available for free on the internet -----> archive !!!  (archive.org)", "sortedWord": "None", "identifyer": 52785, "year": "2020"}, {"Unnamed: 0": 306018, "autor": "thecoldfish", "date": 1609247001000, "content": "Batch scanning archive with Epson v850 and Silverfast /!/ Just ordered the Epson v850 for digitising my film archive. I want to make an efficient workflow to not spend too much time on this as I have a day job as well.\n\nSilverfast SE Plus 8 is included with the Epson v850 and I want to know if I can batch scan 35mm negatives strips with auto settings and iSRD on all the frames without manually having to apply settings to individual frames?\n\nAll other tips on efficient scanning of archive is greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kme0j8/batch_scanning_archive_with_epson_v850_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "batch scanning -----> archive !!!  with epson v850 and silverfast /!/ just ordered the epson v850 for digitising my film archive. i want to make an efficient workflow to not spend too much time on this as i have a day job as well.\n\nsilverfast se plus 8 is included with the epson v850 and i want to know if i can batch scan 35mm negatives strips with auto settings and isrd on all the frames without manually having to apply settings to individual frames?\n\nall other tips on efficient scanning of archive is greatly appreciated!", "sortedWord": "None", "identifyer": 52959, "year": "2020"}, {"Unnamed: 0": 306119, "autor": "zuss33", "date": 1594936266000, "content": "Best way to scan 4x6 printed family photos? /!/ Trying to find the best way to archive them on a budget. Is an Epson v500 better than my generic all in one printer?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hsj7lx/best_way_to_scan_4x6_printed_family_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "best way to scan 4x6 printed family photos? /!/ trying to find the best way to -----> archive !!!  them on a budget. is an epson v500 better than my generic all in one printer?", "sortedWord": "None", "identifyer": 53063, "year": "2020"}, {"Unnamed: 0": 306120, "autor": "analogmajlis", "date": 1594936041000, "content": "A Message from the Analog Photography In the Middle East and North Africa /!/ Dear Beautiful People, \n\nInspired by the analog community of reddit, youtubers who are pushing the analog film aesthetic and alot of the content comming out of the western community, i created an iniative to discover, showcase, archive and centralize the film photography community in the middle east and north africa.\n\nI have massive love for the aesthetic, growing up in the 90s and having film as a memory and part of my childhood, i was so exited to see its revival getting so much attention and love by not just the photography community but the general public as well. \n\nIn the past few months, i have been on mission to do the same for our region after noticing the lack of resources, darkrooms, film photographers and focus on the medium.. We actually started off by just trying to gather up a few enthusiasts onto an instagram page and post their photos ato give them exposure butttt it turns out there are alot more people interested than i thought. \n\nAfter a shitty year mentally and being jobless and just always anxious about have a real purpose ( plus the pandemic)  i am just so happy to see something working out, i have not felt this inspired since a long time, i am so driven to take this iniative as far as it can go, to really try and put regions analog community on the map and help bring in more resources or even oppurtunities for people to concider this more of just an oulet. \n\nIn the first week the community had slightly over 500 followers with zero posts and no ads, just pure conversation. In one week it will one month since i started the page, and the community is nearly at 1.5k, i know to many it is noting but it still blows my mind.\n\nWe still have alot to learn and do, but this is just a small thank you to let you guys know we would not exist without you guys and i hope it makes you happy to hear some good news during these times.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hsj591/a_message_from_the_analog_photography_in_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "a message from the analog photography in the middle east and north africa /!/ dear beautiful people, \n\ninspired by the analog community of reddit, youtubers who are pushing the analog film aesthetic and alot of the content comming out of the western community, i created an iniative to discover, showcase, -----> archive !!!  and centralize the film photography community in the middle east and north africa.\n\ni have massive love for the aesthetic, growing up in the 90s and having film as a memory and part of my childhood, i was so exited to see its revival getting so much attention and love by not just the photography community but the general public as well. \n\nin the past few months, i have been on mission to do the same for our region after noticing the lack of resources, darkrooms, film photographers and focus on the medium.. we actually started off by just trying to gather up a few enthusiasts onto an instagram page and post their photos ato give them exposure butttt it turns out there are alot more people interested than i thought. \n\nafter a shitty year mentally and being jobless and just always anxious about have a real purpose ( plus the pandemic)  i am just so happy to see something working out, i have not felt this inspired since a long time, i am so driven to take this iniative as far as it can go, to really try and put regions analog community on the map and help bring in more resources or even oppurtunities for people to concider this more of just an oulet. \n\nin the first week the community had slightly over 500 followers with zero posts and no ads, just pure conversation. in one week it will one month since i started the page, and the community is nearly at 1.5k, i know to many it is noting but it still blows my mind.\n\nwe still have alot to learn and do, but this is just a small thank you to let you guys know we would not exist without you guys and i hope it makes you happy to hear some good news during these times.", "sortedWord": "None", "identifyer": 53064, "year": "2020"}, {"Unnamed: 0": 307455, "autor": "weltscheisse", "date": 1582730853000, "content": "Huge old japanese photo store - negatives archive", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f9uv76/huge_old_japanese_photo_store_negatives_archive/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "huge old japanese photo store - negatives -----> archive !!! ", "sortedWord": "None", "identifyer": 54424, "year": "2020"}, {"Unnamed: 0": 310734, "autor": "knuckledragger69", "date": 1599159637000, "content": "Moisture in Archive Sleeve? /!/ I'm very new to analog so hopefully this question makes sense. I recently developed and scanned a roll of film and without thinking just left the negatives sitting on my desk since I did not have any sleeves. I ordered some sleeves and when I tried to insert the negatives, it was a little sticky but I finally got them in. Now I'm noticing some moisture on the inside of the sleeve against some of the negatives - like little wet bubbles. The negatives are entirely dry from what I can tell and were hung up for about 24 hours prior to scanning and storing. I live in a very dry area too so im not sure what it could be. \n\nHas anybody else had this issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ilzrge/moisture_in_archive_sleeve/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "moisture in -----> archive !!!  sleeve? /!/ i'm very new to analog so hopefully this question makes sense. i recently developed and scanned a roll of film and without thinking just left the negatives sitting on my desk since i did not have any sleeves. i ordered some sleeves and when i tried to insert the negatives, it was a little sticky but i finally got them in. now i'm noticing some moisture on the inside of the sleeve against some of the negatives - like little wet bubbles. the negatives are entirely dry from what i can tell and were hung up for about 24 hours prior to scanning and storing. i live in a very dry area too so im not sure what it could be. \n\nhas anybody else had this issue?", "sortedWord": "None", "identifyer": 57753, "year": "2020"}, {"Unnamed: 0": 310996, "autor": "kur1j", "date": 1578864300000, "content": "Archival photos with camera with settings /!/ So I'm going back and trying to archive my dads old slides/negatives from the 70s. I'm using a Kaiser light tablet, my 5dm3 on a tripod, and a 100mm macro. I'm using Canons EOS Utility show the live view on my computer screen, which then allows me to place and line up the slides/film for each shot and trigger the shot  from my computer so there isn't any shake.\n\nHave a few questions...before I get to far into it and realize I need to redo it all..\n\n1. What settings should I be shooting at? I've been shooting at ISO 100, f5.6 and 1/3s shutter speed (manual focus), to get enough light and exposure from the camera/shot.\n2. Is it normal to have to refocus a lot? I feel I'm having to refocus all the time. Certain pictures that aren't that great (e.g. you can tell the original was OOF), I can't do much with. But sharp original shots I seem to be needing to tweak focus all the time to get the most crisp shots. Is that normal? The only way I know to avoid this is to potentially increase the aperture, but at that point I would have to drop the shutter speed to so low I might risk vibrations causing blur (even though I'm using a tripod). Any other suggestions?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/entq5f/archival_photos_with_camera_with_settings/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "archival photos with camera with settings /!/ so i'm going back and trying to -----> archive !!!  my dads old slides/negatives from the 70s. i'm using a kaiser light tablet, my 5dm3 on a tripod, and a 100mm macro. i'm using canons eos utility show the live view on my computer screen, which then allows me to place and line up the slides/film for each shot and trigger the shot  from my computer so there isn't any shake.\n\nhave a few questions...before i get to far into it and realize i need to redo it all..\n\n1. what settings should i be shooting at? i've been shooting at iso 100, f5.6 and 1/3s shutter speed (manual focus), to get enough light and exposure from the camera/shot.\n2. is it normal to have to refocus a lot? i feel i'm having to refocus all the time. certain pictures that aren't that great (e.g. you can tell the original was oof), i can't do much with. but sharp original shots i seem to be needing to tweak focus all the time to get the most crisp shots. is that normal? the only way i know to avoid this is to potentially increase the aperture, but at that point i would have to drop the shutter speed to so low i might risk vibrations causing blur (even though i'm using a tripod). any other suggestions?", "sortedWord": "None", "identifyer": 58018, "year": "2020"}, {"Unnamed: 0": 311009, "autor": "pattycakesss", "date": 1578814954000, "content": "Does anyone have a pdf copy of the Yashica T AF manual? /!/ I like keeping manuals for my film cameras and actually read through them to avoid any potential mistakes from happening.\n\nSo far, I have completed most of my manuals archive except for a Yashica T which is arriving to me in a week. Butkus has manuals for all the latter models except for this one. Can't seem to find the one for the Yashica T AF - I have the non DX model.\n\nHoping someone has an archived copy here who would be generous enough to share. Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/enkpbb/does_anyone_have_a_pdf_copy_of_the_yashica_t_af/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "does anyone have a pdf copy of the yashica t af manual? /!/ i like keeping manuals for my film cameras and actually read through them to avoid any potential mistakes from happening.\n\nso far, i have completed most of my manuals -----> archive !!!  except for a yashica t which is arriving to me in a week. butkus has manuals for all the latter models except for this one. can't seem to find the one for the yashica t af - i have the non dx model.\n\nhoping someone has an archived copy here who would be generous enough to share. thank you!", "sortedWord": "None", "identifyer": 58031, "year": "2020"}, {"Unnamed: 0": 311385, "autor": "kur1j", "date": 1608177748000, "content": "Equipment to archive photo prints /!/ We have 10k+ prints (4x6, 5x7, 8x10) to scan that do not have negatives. Getting something like this would cost $1500+ to get them scanned. I have a Epson v600 but its SO slow and tedious.\n\nIs there a better alternative/solution? What would one of these labs that would charge $1500 to scan them use?\n\nI was thinking of getting this [https://www.amazon.com/Epson-FastFoto-FF-680W-Wireless-High-Speed](https://www.amazon.com/Epson-FastFoto-FF-680W-Wireless-High-Speed). For $500 I would come out $1000 ahead than using a service and I wouldn't have to deal with waiting when I got more prints. How much better quality would it be from say a lab or would it be about the same?\n\nAre there any better scanners for the money? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kepuy4/equipment_to_archive_photo_prints/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "equipment to -----> archive !!!  photo prints /!/ we have 10k+ prints (4x6, 5x7, 8x10) to scan that do not have negatives. getting something like this would cost $1500+ to get them scanned. i have a epson v600 but its so slow and tedious.\n\nis there a better alternative/solution? what would one of these labs that would charge $1500 to scan them use?\n\ni was thinking of getting this [https://www.amazon.com/epson-fastfoto-ff-680w-wireless-high-speed](https://www.amazon.com/epson-fastfoto-ff-680w-wireless-high-speed). for $500 i would come out $1000 ahead than using a service and i wouldn't have to deal with waiting when i got more prints. how much better quality would it be from say a lab or would it be about the same?\n\nare there any better scanners for the money? ", "sortedWord": "None", "identifyer": 58421, "year": "2020"}, {"Unnamed: 0": 312159, "autor": "michaelsimon", "date": 1595935612000, "content": "Posting 20+ years of film work to Instagram, and wondering about throughput? /!/ I'm a long time working pro with a healthy sized film archive from the late 1990s and early 2000s. With all of my pandemic free time I have been going through my stacks and making dSLR scans and posting the hits on IG. I \\*think\\* I'm posting some pretty decent stuff, definitely some of my favorites. But it always seems to be the same 45ish people engaging. Thing is, I know a ton of my followers personally, and I think they would hit me with a heart if they were seeing my stuff. \n\nHow do I get more throughput on IG?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hzcz9m/posting_20_years_of_film_work_to_instagram_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "posting 20+ years of film work to instagram, and wondering about throughput? /!/ i'm a long time working pro with a healthy sized film -----> archive !!!  from the late 1990s and early 2000s. with all of my pandemic free time i have been going through my stacks and making dslr scans and posting the hits on ig. i \\*think\\* i'm posting some pretty decent stuff, definitely some of my favorites. but it always seems to be the same 45ish people engaging. thing is, i know a ton of my followers personally, and i think they would hit me with a heart if they were seeing my stuff. \n\nhow do i get more throughput on ig?", "sortedWord": "None", "identifyer": 59210, "year": "2020"}, {"Unnamed: 0": 312452, "autor": "kirbodirbo", "date": 1590739875000, "content": "Name Your Price Film Scanning &amp; Developing Services /!/ Hi all! You may have seen my posts in the past, but I realized that when I deleted my old account from a doxx, it also deleted my old posts. Here's an explanation of what I offer &amp; backstory:\n\n&amp;#x200B;\n\nTo help pay for my film addiction during COVID &amp; provide another resource for the community, I started what is effectively a  Name Your Price (NYP) film lab. Nothing has a set price,  and I basically just trust the community to *at least* cover the costs of their stuff, with any profit going directly back into purchasing more equipment. Here's what's currently offered:\n\n&amp;#x200B;\n\n* C-41, E-6, and B&amp;W developing  \n\n   * All done with CineStill or Ilford chemistry\n   * Archive quality washing\n   * Negatives returned in PrintFile binder sheets\n   * All hand done, no dip &amp; dunk or automation\n* Slide mounting\n* Film scanning  \n\n   * on lab scanners\n   * Fully IT8 calibrated before every new roll\n   * Scans up to 7200PPI\n   * Dust &amp; Scratch removal\n   * Colorcast removal\n   * ICC profiles embedded\n   * Raw available if you want to self invert\n   * Almost any file format\n   * Up to 64 bit\n* Prints of scans\n\nIf you're interested or want to learn more, please DM me.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gsos3l/name_your_price_film_scanning_developing_services/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "name your price film scanning &amp; developing services /!/ hi all! you may have seen my posts in the past, but i realized that when i deleted my old account from a doxx, it also deleted my old posts. here's an explanation of what i offer &amp; backstory:\n\n&amp;#x200b;\n\nto help pay for my film addiction during covid &amp; provide another resource for the community, i started what is effectively a  name your price (nyp) film lab. nothing has a set price,  and i basically just trust the community to *at least* cover the costs of their stuff, with any profit going directly back into purchasing more equipment. here's what's currently offered:\n\n&amp;#x200b;\n\n* c-41, e-6, and b&amp;w developing  \n\n   * all done with cinestill or ilford chemistry\n   * -----> archive !!!  quality washing\n   * negatives returned in printfile binder sheets\n   * all hand done, no dip &amp; dunk or automation\n* slide mounting\n* film scanning  \n\n   * on lab scanners\n   * fully it8 calibrated before every new roll\n   * scans up to 7200ppi\n   * dust &amp; scratch removal\n   * colorcast removal\n   * icc profiles embedded\n   * raw available if you want to self invert\n   * almost any file format\n   * up to 64 bit\n* prints of scans\n\nif you're interested or want to learn more, please dm me.", "sortedWord": "None", "identifyer": 59505, "year": "2020"}, {"Unnamed: 0": 312517, "autor": "ILLMATIC_1989", "date": 1590604380000, "content": "Best-practice for preserving and documenting negatives? /!/ Does anyone have advice on how to best preserve negatives and to also properly document through software (adding camera data, year taken, lens, etc)\n\nI am looking to begin preserving my familys' history and would like to create a mini-archive for all of us.\n\n&amp;#x200B;\n\nThank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/grpekd/bestpractice_for_preserving_and_documenting/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "best-practice for preserving and documenting negatives? /!/ does anyone have advice on how to best preserve negatives and to also properly document through software (adding camera data, year taken, lens, etc)\n\ni am looking to begin preserving my familys' history and would like to create a mini------> archive !!!  for all of us.\n\n&amp;#x200b;\n\nthank you", "sortedWord": "None", "identifyer": 59572, "year": "2020"}, {"Unnamed: 0": 312766, "autor": "MrCelroy", "date": 1586634551000, "content": "sovietcams.com seems to be down /!/ http://www.sovietcams.com/\n\nDoes anyone here know who runs the site?\n\nIt's a really useful site that with a huge archive and I have on countless times used to ID the various years that my soviet cameras are from.\n\nThe site also had interesting writeups on the history of the various Soviet Camera brands that existed.\n\nIt's a shame to see it go down right now", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fzglmg/sovietcamscom_seems_to_be_down/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "sovietcams.com seems to be down /!/ http://www.sovietcams.com/\n\ndoes anyone here know who runs the site?\n\nit's a really useful site that with a huge -----> archive !!!  and i have on countless times used to id the various years that my soviet cameras are from.\n\nthe site also had interesting writeups on the history of the various soviet camera brands that existed.\n\nit's a shame to see it go down right now", "sortedWord": "None", "identifyer": 59826, "year": "2020"}, {"Unnamed: 0": 313142, "autor": "michaelsimon", "date": 1588428681000, "content": "I've finally found a film scanning workflow that works for me /!/ In the first half of my photo life  I only shot film, and that was normal. Shoot, develop, print. Everything was locked in and getting high quality images was just normal. From 2001 until recently I would only shoot film sometimes mainly because I found it frustrating trying to get a nice scan of the film. I purchased an Epson v700 thinking that was the solution, it wasn't. I'm sure it's able to pull a nice sharp scan, but I was unable to make it happen. It's probably me. The holders are so fussy. I experimented with shimming the holders and failed. I ordered nicer holders from Better Scanning, and ANR glass and still could not achieve good quality. Every scan just looked unsharp at the grain level. I went back and forth on if I should buy fluid mount gear for it, but I was worried I would just strike out again. I could not get the grain in focus. I spent years in darkrooms and I wanted that feeling of very perfect in focus grain. You know when have the grain focuser on the easel and it snaps into focus, I want that.\n\nThen I tried sending my film out to pro labs for process/scan thinking they would provide great scans. I was unimpressed. They scans were just not great. Still kind of unsharp.\n\nThen I realized that I have a nice light panel, a great tripod, a 100mm Macro, and a 1st class dSLR. The very first dSLR capture I pulled from an B&amp;W neg blew my damn mind. This is amazing and I can't believe it took me this long to arrive at this. When the grain pulled into sharp focus on the live view screen I legit got goosebumps. I'm absolutely loving these scans. I've only worked with B&amp;W so far because that's what I have quick access to right now. But I shot Kodachrome for years and had given up on getting great scans of those images because the color is so specific, I cant wait to pull them out of storage. dSLR scanning has me so hopeful for my film archive.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gc73bk/ive_finally_found_a_film_scanning_workflow_that/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i've finally found a film scanning workflow that works for me /!/ in the first half of my photo life  i only shot film, and that was normal. shoot, develop, print. everything was locked in and getting high quality images was just normal. from 2001 until recently i would only shoot film sometimes mainly because i found it frustrating trying to get a nice scan of the film. i purchased an epson v700 thinking that was the solution, it wasn't. i'm sure it's able to pull a nice sharp scan, but i was unable to make it happen. it's probably me. the holders are so fussy. i experimented with shimming the holders and failed. i ordered nicer holders from better scanning, and anr glass and still could not achieve good quality. every scan just looked unsharp at the grain level. i went back and forth on if i should buy fluid mount gear for it, but i was worried i would just strike out again. i could not get the grain in focus. i spent years in darkrooms and i wanted that feeling of very perfect in focus grain. you know when have the grain focuser on the easel and it snaps into focus, i want that.\n\nthen i tried sending my film out to pro labs for process/scan thinking they would provide great scans. i was unimpressed. they scans were just not great. still kind of unsharp.\n\nthen i realized that i have a nice light panel, a great tripod, a 100mm macro, and a 1st class dslr. the very first dslr capture i pulled from an b&amp;w neg blew my damn mind. this is amazing and i can't believe it took me this long to arrive at this. when the grain pulled into sharp focus on the live view screen i legit got goosebumps. i'm absolutely loving these scans. i've only worked with b&amp;w so far because that's what i have quick access to right now. but i shot kodachrome for years and had given up on getting great scans of those images because the color is so specific, i cant wait to pull them out of storage. dslr scanning has me so hopeful for my film -----> archive !!! .", "sortedWord": "None", "identifyer": 60211, "year": "2020"}, {"Unnamed: 0": 316246, "autor": "liza_photo_nyc", "date": 1588120029000, "content": "Rue, shot in NYC on 120mm with Yashica Mat 124 G Going through archive during the quarantine yielded many overlooked treasures. More of my work on my insta https://www.instagram.com/liza_kanaeva_/", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g9z7x1/rue_shot_in_nyc_on_120mm_with_yashica_mat_124_g/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "rue, shot in nyc on 120mm with yashica mat 124 g going through -----> archive !!!  during the quarantine yielded many overlooked treasures. more of my work on my insta https://www.instagram.com/liza_kanaeva_/", "sortedWord": "None", "identifyer": 63358, "year": "2020"}], "name": "archiveAnalogCommunity2020"}