{"interestingcomments": [{"Unnamed: 0": 88839, "autor": "KingOfTheP4s", "date": 1549418963000, "content": "24 exposures vs 36 exposures, Comparing Film Length Advantages and Prices /!/ I can't decide if I should shoot 24 exposure rolls or 36 exposure rolls because each have their pros and cons.\n\n**24 exposure rolls**\n\n* Easier to finish a roll\n\n* You can change emulsions quicker\n\n* You can fit a whole roll on a single archive page\n\n**36 exposure rolls**\n\n* Cheaper per-shot in terms of film cost\n\n* Cheaper per-shot in terms of developing/scanning cost\n\nI made a table below assuming $15 flat rate dev/scan with no shipping and using current prices from B&amp;H. (Note: $18 dev/scan was assumed with Fuji Provia, an E6 film)\n\nFilm Type | Kodak Gold 200 | Fuji Superia 400 | Kodak Ektar 100 | Fuji PRO 400H | Arista EDU 200 | Kentmere 100 | Ilford HP5 | Fuji Provia 100F\n---------|----------|----------|----------|----------|----------|----------|----------|----------\n24 exp | $3.29 | $2.79 | N/A | N/A | $3.89 | $3.59 | $4.99 | N/A\n24 exp adjusted | $4.94 | $4.19 | N/A | N/A | $5.84 | $5.39 | $7.49 | N/A\n36 exp | $4.19 | $3.89 | $7.49 | $9.99 | $4.49 | $3.95 | $5.69 | $11.99\nRaw Difference | $0.90 | $1.10 | N/A | N/A | $0.60 | $0.36 | $0.70 | N/A\nAdjusted Difference | $-0.75 | $-0.30 | N/A | N/A | $-1.35 | $-1.44 | $-1.80 | N/A\n24 Film Cost Per Picture | $0.137 | $0.116 | N/A | N/A | $0.162 | $0.150 | $0.208 | N/A\n36 Film Cost Per Picture | $0.116 | $0.108 | $0.208 | $0.278 | $0.125 | $0.110 | $0.158 | $0.333\nTotal Cost 24 | $18.29 | $17.79 | N/A | N/A | $18.89 | $18.59 | $19.99 | N/A\nAdjusted Total 24 | $27.44 | $26.69 | N/A | N/A | $28.34 | $27.89 | $29.99 | N/A\nTotal Cost 36 | $19.19 | $18.89 | $22.49 | $24.99 | $19.49 | $18.95 | $20.69 | $29.99\nTotal Cost Per Picture 24 | $0.762 | $0.741 | N/A | N/A | $0.787 | $0.775 | $0.833 | N/A\nTotal Cost Per Picture 36 | $0.533 | $0.525 | $0.625 | $0.694 | $0.541 | $0.526 | $0.575 | $0.833\n\nI think a few categories in this table need explaining:\n\n* `24 exp adjusted` is the price that a 36 exposure roll would be if it had the same per-picture cost as a 24 exposure roll\n\n* `Adjusted Difference` is the difference in price between an 'adjusted' roll of 24 exposures and a true roll of 36 exposures\n\n* `Adjusted total 24` is the `24 exp adjusted` category plus 1.5x the developing cost, to simulate the fact that shooting 36 pictures on a 24 exposure roll would require the development of one full roll plus the development of half of another roll.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/anlpy2/24_exposures_vs_36_exposures_comparing_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "24 exposures vs 36 exposures, comparing film length advantages and prices /!/ i can't decide if i should shoot 24 exposure rolls or 36 exposure rolls because each have their pros and cons.\n\n**24 exposure rolls**\n\n* easier to finish a roll\n\n* you can change emulsions quicker\n\n* you can fit a whole roll on a single -----> archive !!!  page\n\n**36 exposure rolls**\n\n* cheaper per-shot in terms of film cost\n\n* cheaper per-shot in terms of developing/scanning cost\n\ni made a table below assuming $15 flat rate dev/scan with no shipping and using current prices from b&amp;h. (note: $18 dev/scan was assumed with fuji provia, an e6 film)\n\nfilm type | kodak gold 200 | fuji superia 400 | kodak ektar 100 | fuji pro 400h | arista edu 200 | kentmere 100 | ilford hp5 | fuji provia 100f\n---------|----------|----------|----------|----------|----------|----------|----------|----------\n24 exp | $3.29 | $2.79 | n/a | n/a | $3.89 | $3.59 | $4.99 | n/a\n24 exp adjusted | $4.94 | $4.19 | n/a | n/a | $5.84 | $5.39 | $7.49 | n/a\n36 exp | $4.19 | $3.89 | $7.49 | $9.99 | $4.49 | $3.95 | $5.69 | $11.99\nraw difference | $0.90 | $1.10 | n/a | n/a | $0.60 | $0.36 | $0.70 | n/a\nadjusted difference | $-0.75 | $-0.30 | n/a | n/a | $-1.35 | $-1.44 | $-1.80 | n/a\n24 film cost per picture | $0.137 | $0.116 | n/a | n/a | $0.162 | $0.150 | $0.208 | n/a\n36 film cost per picture | $0.116 | $0.108 | $0.208 | $0.278 | $0.125 | $0.110 | $0.158 | $0.333\ntotal cost 24 | $18.29 | $17.79 | n/a | n/a | $18.89 | $18.59 | $19.99 | n/a\nadjusted total 24 | $27.44 | $26.69 | n/a | n/a | $28.34 | $27.89 | $29.99 | n/a\ntotal cost 36 | $19.19 | $18.89 | $22.49 | $24.99 | $19.49 | $18.95 | $20.69 | $29.99\ntotal cost per picture 24 | $0.762 | $0.741 | n/a | n/a | $0.787 | $0.775 | $0.833 | n/a\ntotal cost per picture 36 | $0.533 | $0.525 | $0.625 | $0.694 | $0.541 | $0.526 | $0.575 | $0.833\n\ni think a few categories in this table need explaining:\n\n* `24 exp adjusted` is the price that a 36 exposure roll would be if it had the same per-picture cost as a 24 exposure roll\n\n* `adjusted difference` is the difference in price between an 'adjusted' roll of 24 exposures and a true roll of 36 exposures\n\n* `adjusted total 24` is the `24 exp adjusted` category plus 1.5x the developing cost, to simulate the fact that shooting 36 pictures on a 24 exposure roll would require the development of one full roll plus the development of half of another roll.", "sortedWord": "None", "identifyer": 91319, "year": "2019"}, {"Unnamed: 0": 89391, "autor": "R3dOctober", "date": 1561134213000, "content": "WWII on Kodachrome /!/ I know it’s not really about stills but the Criterion Channel has George Steven’s D-Day to Berlin documentary from his personal film archive of the war and the whole thing is on Kodachrome.  It’s beautiful. Worth checking out.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c3cqbx/wwii_on_kodachrome/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "wwii on kodachrome /!/ i know it’s not really about stills but the criterion channel has george steven’s d-day to berlin documentary from his personal film -----> archive !!!  of the war and the whole thing is on kodachrome.  it’s beautiful. worth checking out.", "sortedWord": "None", "identifyer": 91877, "year": "2019"}, {"Unnamed: 0": 89800, "autor": "chickenAreDinoM8", "date": 1567371362000, "content": "underwater film photography /!/ does anyone know if there is waterproof film camera out there? or if there is a way to make existing camera waterproof, like maybe with a case etc ? \n\ni'd also appreciate if someone could point me to a underwater film photo archive, if it exists.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cyfg0r/underwater_film_photography/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "underwater film photography /!/ does anyone know if there is waterproof film camera out there? or if there is a way to make existing camera waterproof, like maybe with a case etc ? \n\ni'd also appreciate if someone could point me to a underwater film photo -----> archive !!! , if it exists.", "sortedWord": "None", "identifyer": 92287, "year": "2019"}, {"Unnamed: 0": 90545, "autor": "KingOfTheP4s", "date": 1548706014000, "content": "I found a better way to store negatives than binders /!/ In the past, I've used a normal 3 ring binder to store my PrintFile archive pages. However, I really hated doing this because the rings would wear out from closing and opening so much as I added new pages. Plus, pages would fall out occasionally because they slipped through the little slits of the rings.\n\nRecently, I discovered that PrintFile also makes compatible [file hangers](https://www.printfile.com/file-hanger_25.aspx) for their archive sheets.\n\nThese things are just fantastic. I bought myself a small [file box](https://www.target.com/p/storex-174-portable-file-box-with-lockable-lid-black-with-gray-top/-/A-51624025) from Target and a pack of the file hangers. Instead of needing to flip through a binder, everything just hangs vertically as individual sheets. Super easy to thumb through and find a particular page I'm looking for and even easier to put a new page in the box as there's no need to open any binder rings and risk everything spilling out.\n\nThese are what I've been using now:\n\n[PrintFile Hangers](https://www.printfile.com/file-hanger_25.aspx)\n\n[35-6HB for 35mm film](https://www.printfile.com/35-6hb_25.aspx)\n\n[120-3HB for 120 film](https://www.printfile.com/120-3hb_25.aspx)\n\n[120-9HB for instax mini prints](https://www.printfile.com/120-9HB-protector-wallet-prints-25pack.aspx)\n\nThe hangers are compatible with any printfile pages designated with an H, HB or P.\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/akrer7/i_found_a_better_way_to_store_negatives_than/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i found a better way to store negatives than binders /!/ in the past, i've used a normal 3 ring binder to store my printfile -----> archive !!!  pages. however, i really hated doing this because the rings would wear out from closing and opening so much as i added new pages. plus, pages would fall out occasionally because they slipped through the little slits of the rings.\n\nrecently, i discovered that printfile also makes compatible [file hangers](https://www.printfile.com/file-hanger_25.aspx) for their archive sheets.\n\nthese things are just fantastic. i bought myself a small [file box](https://www.target.com/p/storex-174-portable-file-box-with-lockable-lid-black-with-gray-top/-/a-51624025) from target and a pack of the file hangers. instead of needing to flip through a binder, everything just hangs vertically as individual sheets. super easy to thumb through and find a particular page i'm looking for and even easier to put a new page in the box as there's no need to open any binder rings and risk everything spilling out.\n\nthese are what i've been using now:\n\n[printfile hangers](https://www.printfile.com/file-hanger_25.aspx)\n\n[35-6hb for 35mm film](https://www.printfile.com/35-6hb_25.aspx)\n\n[120-3hb for 120 film](https://www.printfile.com/120-3hb_25.aspx)\n\n[120-9hb for instax mini prints](https://www.printfile.com/120-9hb-protector-wallet-prints-25pack.aspx)\n\nthe hangers are compatible with any printfile pages designated with an h, hb or p.\n", "sortedWord": "None", "identifyer": 93033, "year": "2019"}, {"Unnamed: 0": 92065, "autor": "Kodorin", "date": 1559224065000, "content": "Is this something you guys would find useful? /!/ So, I'm a film photographer in my own free time and a developer which means I develop small-scale apps. One of the apps I've been developing was a film photography archiving app that archives all your photos in bulk and stores the roll specifications on there. It can also be used to sort the photos into collections for the purposes of showcasing them.  I've originally developed this app only for myself. But, I wanted to see if this is something you guys would find useful as well from a film photographer perspective. I'm just looking for feedback, suggestions or your thoughts on it to see if this is worth scaling.\n\nLinks below:\n\nApp:  [http://www.miha-co.ca/lumograph](http://www.miha-co.ca/lumograph) \n\nArchive:  [http://www.miha-co.ca/lumograph/master](http://www.miha-co.ca/lumograph/master)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/butdpg/is_this_something_you_guys_would_find_useful/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "is this something you guys would find useful? /!/ so, i'm a film photographer in my own free time and a developer which means i develop small-scale apps. one of the apps i've been developing was a film photography archiving app that archives all your photos in bulk and stores the roll specifications on there. it can also be used to sort the photos into collections for the purposes of showcasing them.  i've originally developed this app only for myself. but, i wanted to see if this is something you guys would find useful as well from a film photographer perspective. i'm just looking for feedback, suggestions or your thoughts on it to see if this is worth scaling.\n\nlinks below:\n\napp:  [http://www.miha-co.ca/lumograph](http://www.miha-co.ca/lumograph) \n\n-----> archive !!! :  [http://www.miha-co.ca/lumograph/master](http://www.miha-co.ca/lumograph/master)", "sortedWord": "None", "identifyer": 94565, "year": "2019"}, {"Unnamed: 0": 92695, "autor": "Stavrosvi", "date": 1574626754000, "content": "Opinion on 35mm B&amp;W Scanning (plustek 8200i Ai) /!/ Hello everyone,\n\n&amp;#x200B;\n\nIt's been 2 weeks since I bought the above scanner, I am very happy with the results I am getting comparing the DSLR scanning. So because I am trying to archive my negatives again but with a decent resolution and quality I want your advice as maybe some of you maybe own this scanner or you have more experience with Flatbet scanning.\n\nI use the Silverfast 8.8 software that comes with scanner.\n\nFirstly for black and white I choose 16 bit TIFF but I got the option also 16bit to 8bit TIFF , which I don't know if there is any significant diferent in the quality of the image, the only I see is that the size becomes half, is it worth 16bit or go for 16 to 8bit? comparing both images side by side to be honest I am not sure if I can spot any diference at all.\n\nThen 300ppi with 2400 scanning resolution, but I think 3600 is much better, it's the G spot I think in terms of image quality comparing to it's megapixels, as I saw the dust and scratch removal works better on that size because it's has more detail to work on.\n\nThere I use the NegaFix where you put the excact type of film you got, and you got diferent results if you chage the type of the film.\n\nOn Unsharp Mask Dialog, I choose less auto sharpness instead of auto sharpness\n\nOn SDRx the Stantard is Detection 1 and tile 3, I change it on Detection 10 or 13 because is much stronger, depends how dirty is the image, but as feature I think isn't that good and lightroom or photoshop is much better for big dirts, what's your options on SDRx?\n\nGANE for grain and noise elimination I choose light, instead of medium and strong, light is also the default I think.\n\nAnd of corse Multi Exposure.\n\nFor the Histogram and Curve settings I choose Standard Auto Adjust because I want my films as they are and to have the similar look continiusly to the whole film.\n\n&amp;#x200B;\n\nIf you want to choose 16bit HDR RAW unfortunately you can't choose any of the above settings, just the scan resolution, NegaFix and Multi Exposure or not, you just get the unreversed negative for the lightroom or photoshop, which is something very tedius and time consuming to do image by image.\n\n&amp;#x200B;\n\nSomething very important I noticed is that comparing side by side a 2400and 3600 dpi scan, the 3600dpi scan is much better just by looking at it on the normal size, without to zoom in in detail, that's very important.\n\nSo, do you think are these are best settings for the best image quality comparing to the resulotion I choose? What kind of settings do you use? any good tip? \n\n&amp;#x200B;\n\nThank you so much for your time,\n\nStavros", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e13z5n/opinion_on_35mm_bw_scanning_plustek_8200i_ai/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "opinion on 35mm b&amp;w scanning (plustek 8200i ai) /!/ hello everyone,\n\n&amp;#x200b;\n\nit's been 2 weeks since i bought the above scanner, i am very happy with the results i am getting comparing the dslr scanning. so because i am trying to -----> archive !!!  my negatives again but with a decent resolution and quality i want your advice as maybe some of you maybe own this scanner or you have more experience with flatbet scanning.\n\ni use the silverfast 8.8 software that comes with scanner.\n\nfirstly for black and white i choose 16 bit tiff but i got the option also 16bit to 8bit tiff , which i don't know if there is any significant diferent in the quality of the image, the only i see is that the size becomes half, is it worth 16bit or go for 16 to 8bit? comparing both images side by side to be honest i am not sure if i can spot any diference at all.\n\nthen 300ppi with 2400 scanning resolution, but i think 3600 is much better, it's the g spot i think in terms of image quality comparing to it's megapixels, as i saw the dust and scratch removal works better on that size because it's has more detail to work on.\n\nthere i use the negafix where you put the excact type of film you got, and you got diferent results if you chage the type of the film.\n\non unsharp mask dialog, i choose less auto sharpness instead of auto sharpness\n\non sdrx the stantard is detection 1 and tile 3, i change it on detection 10 or 13 because is much stronger, depends how dirty is the image, but as feature i think isn't that good and lightroom or photoshop is much better for big dirts, what's your options on sdrx?\n\ngane for grain and noise elimination i choose light, instead of medium and strong, light is also the default i think.\n\nand of corse multi exposure.\n\nfor the histogram and curve settings i choose standard auto adjust because i want my films as they are and to have the similar look continiusly to the whole film.\n\n&amp;#x200b;\n\nif you want to choose 16bit hdr raw unfortunately you can't choose any of the above settings, just the scan resolution, negafix and multi exposure or not, you just get the unreversed negative for the lightroom or photoshop, which is something very tedius and time consuming to do image by image.\n\n&amp;#x200b;\n\nsomething very important i noticed is that comparing side by side a 2400and 3600 dpi scan, the 3600dpi scan is much better just by looking at it on the normal size, without to zoom in in detail, that's very important.\n\nso, do you think are these are best settings for the best image quality comparing to the resulotion i choose? what kind of settings do you use? any good tip? \n\n&amp;#x200b;\n\nthank you so much for your time,\n\nstavros", "sortedWord": "None", "identifyer": 95197, "year": "2019"}, {"Unnamed: 0": 92740, "autor": "thriftflipper", "date": 1556250567000, "content": "Popular Photography magazine archive at Google Books /!/ [https://books.google.com/books?id=rzH31j84pn8C&amp;dq=modern+photography+magazine&amp;source=gbs\\_all\\_issues\\_r&amp;cad=1](https://books.google.com/books?id=rzH31j84pn8C&amp;dq=modern+photography+magazine&amp;source=gbs_all_issues_r&amp;cad=1)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bhhviz/popular_photography_magazine_archive_at_google/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "popular photography magazine -----> archive !!!  at google books /!/ [https://books.google.com/books?id=rzh31j84pn8c&amp;dq=modern+photography+magazine&amp;source=gbs\\_all\\_issues\\_r&amp;cad=1](https://books.google.com/books?id=rzh31j84pn8c&amp;dq=modern+photography+magazine&amp;source=gbs_all_issues_r&amp;cad=1)", "sortedWord": "None", "identifyer": 95242, "year": "2019"}, {"Unnamed: 0": 92830, "autor": "CRSPRcat", "date": 1560214601000, "content": "How to transport uncut rolls of film? /!/ I have been learning 35mm film for a couple of months now, and I have been getting the film developed and scanned at my local shop. I have recently switched over to B&amp;W and this is even more expensive than color. I have already decided that I want to start developing my own film, both for fun and experimentation, but do not at this time want to invest in time to scan every image.  Here are my questions?\n\n1. How can I transport uncut rolls of film, either in the mail or just bringing into the local shop without getting damaged? I was thinking about just rolling them into the film canister, and then after they are scanned, cut them myself and archive which frames I wanted to keep. Would having them in the canister for a couple of days make them curl a great deal, or is a few days fine, followed by putting them in archive sleeves okay? \n2. Is there a quick and easy way to scan and view the images (without regard to scan quality) that I can do at home, and then either scan the strip I want on a V600 at school or take in the local shop for a scan? \n\nIn the future, I definitely would like to set up a DSLR scanning method, but at the current moment, I have been focusing on learning more about film and experimenting, and just want to see my results and do the quality scans with just a select few images. Let me know what you think?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bz5whc/how_to_transport_uncut_rolls_of_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how to transport uncut rolls of film? /!/ i have been learning 35mm film for a couple of months now, and i have been getting the film developed and scanned at my local shop. i have recently switched over to b&amp;w and this is even more expensive than color. i have already decided that i want to start developing my own film, both for fun and experimentation, but do not at this time want to invest in time to scan every image.  here are my questions?\n\n1. how can i transport uncut rolls of film, either in the mail or just bringing into the local shop without getting damaged? i was thinking about just rolling them into the film canister, and then after they are scanned, cut them myself and -----> archive !!!  which frames i wanted to keep. would having them in the canister for a couple of days make them curl a great deal, or is a few days fine, followed by putting them in archive sleeves okay? \n2. is there a quick and easy way to scan and view the images (without regard to scan quality) that i can do at home, and then either scan the strip i want on a v600 at school or take in the local shop for a scan? \n\nin the future, i definitely would like to set up a dslr scanning method, but at the current moment, i have been focusing on learning more about film and experimenting, and just want to see my results and do the quality scans with just a select few images. let me know what you think?", "sortedWord": "None", "identifyer": 95332, "year": "2019"}, {"Unnamed: 0": 94261, "autor": "kur1j", "date": 1572885166000, "content": "Scanning hardware to archive old photos /!/ Looking for equipment suggestions to archive a bunch of my families old photos. Have a mixture of negatives, old prints, and slides.\n\nIt seems that the Epson, v600/v800/v850 are highly regarded and can do all of what I need (prints, negatives,slides).\n\nI don’t mind buying a couple different units if it produces a better result. Don’t want to spend $10k+ but would be willing to spend 600-1k but don’t want to spend 500$ extra just to get only fractional improvement with some marketing speak.\n\nLooking for scanner(s) to work on this project. Would something like the Epson v600 be adequate or would the quality improvement be worth it to get the v800 over the v600? Or the v850 over the v800 or some other scanner for example? \n\nI probably have a couple thousand in mixture of slides, negatives and prints.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/drk29h/scanning_hardware_to_archive_old_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "scanning hardware to -----> archive !!!  old photos /!/ looking for equipment suggestions to -----> archive !!!  a bunch of my families old photos. have a mixture of negatives, old prints, and slides.\n\nit seems that the epson, v600/v800/v850 are highly regarded and can do all of what i need (prints, negatives,slides).\n\ni don’t mind buying a couple different units if it produces a better result. don’t want to spend $10k+ but would be willing to spend 600-1k but don’t want to spend 500$ extra just to get only fractional improvement with some marketing speak.\n\nlooking for scanner(s) to work on this project. would something like the epson v600 be adequate or would the quality improvement be worth it to get the v800 over the v600? or the v850 over the v800 or some other scanner for example? \n\ni probably have a couple thousand in mixture of slides, negatives and prints.", "sortedWord": "None", "identifyer": 96780, "year": "2019"}], "name": "archiveAnalogCommunity2019"}