{"interestingcomments": [{"Unnamed: 0": 252657, "autor": "GoExistential", "date": 1615823959000, "content": "Affordable ECN2 labs in US? Cinema labs? /!/ Hey! I’ve been interested in shooting Kodak vision 3 films, and know a few sources to find stock like 250d, 250T and 500T in 120 and 35mm format. I’ve been wanting to shoot some for the last year or longer, but figured I’d spend much more in the end even if the labs are cheap (like $6 a roll) because of shipping to Hong Kong or other labs in Asia or really anywhere out of the CONUS is very expensive. For whatever reason looks like return is nowhere near as bad, but even if I scrambled together enough rolls I’ll wait FOREVEERRR to get them back I bet. \n\nI’ve done research at some point, and from that I’d guess “ no”, but is there any labs in the US that process ECN2 and do not charge insane amounts of money? Anywhere that can process for less than $10 a roll gets my interest.\n\nI also know some of you must’ve had success with cine roll processing locations? What is the minimum number of 35mm rolls they accept and how much was your total?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m5nvj1/affordable_ecn2_labs_in_us_cinema_labs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "affordable ecn2 labs in us? cinema labs? /!/ hey! i’ve been interested in shooting kodak vision 3 films, and know a few sources to find stock like 250d, 250t and 500t in 120 and 35mm format. i’ve been wanting to shoot some for the last year or longer, but figured i’d spend much more in the end even if the labs are cheap (like $6 a roll) because of shipping to hong kong or other labs in asia or really anywhere out of the conus is very expensive. for whatever reason looks like return is nowhere near as bad, but even if i scrambled together enough rolls i’ll wait foreveerrr to get them back i bet. \n\ni’ve done research at some point, and from that i’d guess “ no”, but is there any labs in the us that process ecn2 and do not charge insane amounts of money? anywhere that can process for less than $10 a roll gets my interest.\n\ni also know some of you must’ve had success with cine roll processing -----> locations !!! ? what is the minimum number of 35mm rolls they accept and how much was your total?", "sortedWord": "None", "identifyer": 48026, "year": "2021"}, {"Unnamed: 0": 252859, "autor": "helppleaseimhurting", "date": 1614444013000, "content": "Superia 400 with Flash in brightly lighted space is dark /!/ Superia 400 with Flash in brightly lighted space is dark and super grainy. The same location with the same light was actually perfectly fine with gold 200. I was wondering if flash with light and higher exposure rolls make photos dark? \n\nI am going to start trying Portra 800 to shoot at night. Will it be advisable if I shoot without flash to prevent what happened above? I am using a point and shoot.\n\nOn top of that, my point and shoot actually have a +1.5 logo which I can select. People have suggested that it is +1.5 exposure but when I tried it, there wasn't any flash. Was afraid that I will ruin my roll so I reverted back to flash. Any advice if this will make the picture brighter or if I should just continue using flash?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ltrv47/superia_400_with_flash_in_brightly_lighted_space/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "superia 400 with flash in brightly lighted space is dark /!/ superia 400 with flash in brightly lighted space is dark and super grainy. the same -----> location !!!  with the same light was actually perfectly fine with gold 200. i was wondering if flash with light and higher exposure rolls make photos dark? \n\ni am going to start trying portra 800 to shoot at night. will it be advisable if i shoot without flash to prevent what happened above? i am using a point and shoot.\n\non top of that, my point and shoot actually have a +1.5 logo which i can select. people have suggested that it is +1.5 exposure but when i tried it, there wasn't any flash. was afraid that i will ruin my roll so i reverted back to flash. any advice if this will make the picture brighter or if i should just continue using flash?", "sortedWord": "None", "identifyer": 48230, "year": "2021"}, {"Unnamed: 0": 252998, "autor": "blady001", "date": 1630306263000, "content": "Tripod needed on the Pag island [HR] /!/ Hi guys! (Pardon my English but I’m not a native)\n\nI have just come to Pag for my vacation, realizing on site that I forgot to pack my tripod (trigger as well) 😬\nAs I’d love to shoot some sunsets/blue hours here, I was wondering, is there by any chance any of you in the same location who could lend me that gear or take some photos together?\n\nPeace", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pecsht/tripod_needed_on_the_pag_island_hr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "tripod needed on the pag island [hr] /!/ hi guys! (pardon my english but i’m not a native)\n\ni have just come to pag for my vacation, realizing on site that i forgot to pack my tripod (trigger as well) 😬\nas i’d love to shoot some sunsets/blue hours here, i was wondering, is there by any chance any of you in the same -----> location !!!  who could lend me that gear or take some photos together?\n\npeace", "sortedWord": "None", "identifyer": 48370, "year": "2021"}, {"Unnamed: 0": 253247, "autor": "TheAkkarin-32", "date": 1632824546000, "content": "I need a Film recommendation for a B/W Film for a Halloween shoot. /!/ I am gonna have a Halloween Shooting soon and I'll be using a B/W 35mm (maybe 120) Film which I am gonna dev myself (with either Rodinal or x-tol).\n\nWhat I am looking for is a grainy, high contrast film, which gives a kinda eerie/creepy and mysterious vibe. I know it sounds stupid, but it's a Halloween Shoot. The Location has good Lighting and is outdoors at an abandoned industrial place.\n\nI have considered Delta 3200 or Colour Plus crossdev'ed in Rodinal. What can you recommend for this shoot?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/px3d94/i_need_a_film_recommendation_for_a_bw_film_for_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i need a film recommendation for a b/w film for a halloween shoot. /!/ i am gonna have a halloween shooting soon and i'll be using a b/w 35mm (maybe 120) film which i am gonna dev myself (with either rodinal or x-tol).\n\nwhat i am looking for is a grainy, high contrast film, which gives a kinda eerie/creepy and mysterious vibe. i know it sounds stupid, but it's a halloween shoot. the -----> location !!!  has good lighting and is outdoors at an abandoned industrial place.\n\ni have considered delta 3200 or colour plus crossdev'ed in rodinal. what can you recommend for this shoot?", "sortedWord": "None", "identifyer": 48621, "year": "2021"}, {"Unnamed: 0": 253251, "autor": "ritchieremo", "date": 1632822153000, "content": "Advice for shooting portraits? /!/ I'm going to be doing some portraits of my friend and his girlfriend next week, going to use Fomapan 400 in one camera and I'm planning to take a couple of shots of 5366 in another. It's going to be fairly casual and I hope to get something slightly better than the average Facebook profile picture from it. Location is yet to be confirmed, but my plan is to use a local park if the weather is good, and one of the local universities buildings if it's poor", "link": "https://www.reddit.com/r/AnalogCommunity/comments/px2t8f/advice_for_shooting_portraits/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "advice for shooting portraits? /!/ i'm going to be doing some portraits of my friend and his girlfriend next week, going to use fomapan 400 in one camera and i'm planning to take a couple of shots of 5366 in another. it's going to be fairly casual and i hope to get something slightly better than the average facebook profile picture from it. -----> location !!!  is yet to be confirmed, but my plan is to use a local park if the weather is good, and one of the local universities buildings if it's poor", "sortedWord": "None", "identifyer": 48625, "year": "2021"}, {"Unnamed: 0": 253342, "autor": "broben2", "date": 1634230512000, "content": "Comparing film to digital, grass field in the evening with foggy sky /!/ Images created same location and time.  Portra 400 on RB67 180mm lens vs Nikon D780 105mm lens.  I'm sure the digital could be edited to bring some more life into it, to match the film version.\n\n[RB67 180mm, Portra 400](https://preview.redd.it/l6l777zc4gt71.jpg?width=8959&amp;format=pjpg&amp;auto=webp&amp;s=b349e9a214e5311f984f6b360f1ebddb963d845c)\n\n&amp;#x200B;\n\n[D780 105mm](https://preview.redd.it/82bmwilh4gt71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=544cabe980f3fad20ce72ae6a1cd6d8526515470)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q83say/comparing_film_to_digital_grass_field_in_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "comparing film to digital, grass field in the evening with foggy sky /!/ images created same -----> location !!!  and time.  portra 400 on rb67 180mm lens vs nikon d780 105mm lens.  i'm sure the digital could be edited to bring some more life into it, to match the film version.\n\n[rb67 180mm, portra 400](https://preview.redd.it/l6l777zc4gt71.jpg?width=8959&amp;format=pjpg&amp;auto=webp&amp;s=b349e9a214e5311f984f6b360f1ebddb963d845c)\n\n&amp;#x200b;\n\n[d780 105mm](https://preview.redd.it/82bmwilh4gt71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=544cabe980f3fad20ce72ae6a1cd6d8526515470)", "sortedWord": "None", "identifyer": 48716, "year": "2021"}, {"Unnamed: 0": 253717, "autor": "throwaway27122020", "date": 1623768207000, "content": "Looking for a snapshot camera /!/ Hey y’all :) I started using analog cameras half a year ago and I absolutely love it. My current cameras are broken/too expensive to take them with me to parties etc.\n\nIs there a snapshot camera that takes rather good pics including darker locations? Or do I have to use Film with a high ISO?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o0fzxk/looking_for_a_snapshot_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "looking for a snapshot camera /!/ hey y’all :) i started using analog cameras half a year ago and i absolutely love it. my current cameras are broken/too expensive to take them with me to parties etc.\n\nis there a snapshot camera that takes rather good pics including darker -----> locations !!! ? or do i have to use film with a high iso?", "sortedWord": "None", "identifyer": 49093, "year": "2021"}, {"Unnamed: 0": 254072, "autor": "mariacha_static", "date": 1614804919000, "content": "A Mountain of Film /!/ So I've got almost 50 rolls of film that I've been sitting on for too long. It is a mixture of 35mm b&amp;w, color and a few rolls of 120. Developing it myself seems impossible in my tiny, tiny apartment.\nAnyone know of any mail in labs that won't bankrupt me? I just need these processed and scanned before they collect any more dust, but I can't shell out a grand to do so. \nMy local lab is sketchy though, so they are my last resort. If anyone has some advice or labs to check out, it would be much appreciated!\n\nEdit, location; I am based in Michigan.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lx43uv/a_mountain_of_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a mountain of film /!/ so i've got almost 50 rolls of film that i've been sitting on for too long. it is a mixture of 35mm b&amp;w, color and a few rolls of 120. developing it myself seems impossible in my tiny, tiny apartment.\nanyone know of any mail in labs that won't bankrupt me? i just need these processed and scanned before they collect any more dust, but i can't shell out a grand to do so. \nmy local lab is sketchy though, so they are my last resort. if anyone has some advice or labs to check out, it would be much appreciated!\n\nedit, -----> location !!! ; i am based in michigan.", "sortedWord": "None", "identifyer": 49451, "year": "2021"}, {"Unnamed: 0": 254099, "autor": "Foot-Note", "date": 1614353953000, "content": "Need Advice: Shooting with a full moon. /!/ So I am in the middle of packing right now so I cant really look this up too well myself. I am going camping this weekend and just found out its a full moon. I also found out there is a viewing tower there too. My plan is to either stay up late, or get up real early and hopefully get some long exposure landscape shots with a full moon. Something I have never done.\n\nGiven these items, what are your recommendations?\n\n* Nikon F5\n* Tokina AT-X Pro 20-35/f2.8 (Not sure if these are simply soft images from this lens or just bad shooting practice)\n* Voigtlander 58mm/f1.4\n* Nikor 24-105 VR /f4\n* Sigma 100-300/f4 (Too heavy for the tripod)\n* Ilford HP5+ Film\n* Adox CMS 20 II Pro film\n* light weight tripod\n* Smartphone\n\nGiven this location?\n\n* Full moon\n* Open Field\n* Viewing tower possibly 30 feet up?\n\nShould I use my faster or slower film? Go off of the internal light metering? Download an app that will help getting the right exposure? Part of me wants to take some real long shots? Wait till midnight? Two hours before sunrise?\n\nThanks for all the help!!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lt08an/need_advice_shooting_with_a_full_moon/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "need advice: shooting with a full moon. /!/ so i am in the middle of packing right now so i cant really look this up too well myself. i am going camping this weekend and just found out its a full moon. i also found out there is a viewing tower there too. my plan is to either stay up late, or get up real early and hopefully get some long exposure landscape shots with a full moon. something i have never done.\n\ngiven these items, what are your recommendations?\n\n* nikon f5\n* tokina at-x pro 20-35/f2.8 (not sure if these are simply soft images from this lens or just bad shooting practice)\n* voigtlander 58mm/f1.4\n* nikor 24-105 vr /f4\n* sigma 100-300/f4 (too heavy for the tripod)\n* ilford hp5+ film\n* adox cms 20 ii pro film\n* light weight tripod\n* smartphone\n\ngiven this -----> location !!! ?\n\n* full moon\n* open field\n* viewing tower possibly 30 feet up?\n\nshould i use my faster or slower film? go off of the internal light metering? download an app that will help getting the right exposure? part of me wants to take some real long shots? wait till midnight? two hours before sunrise?\n\nthanks for all the help!!!", "sortedWord": "None", "identifyer": 49478, "year": "2021"}, {"Unnamed: 0": 254470, "autor": "dannymoallem", "date": 1613080635000, "content": "Looking for some awesome Photo Book/Zine recommendations /!/ I really love consuming other photographer's work, and am looking for some recommendations of photo books to add to my collection. I love any photography showing life in unique locations, nostalgic  street photos, cults/secluded communities, and/or interesting/thought provoking photo projects. Any recommendations for me? Feel free to post your own photo books too!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lhvxan/looking_for_some_awesome_photo_bookzine/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "looking for some awesome photo book/zine recommendations /!/ i really love consuming other photographer's work, and am looking for some recommendations of photo books to add to my collection. i love any photography showing life in unique -----> locations !!! , nostalgic  street photos, cults/secluded communities, and/or interesting/thought provoking photo projects. any recommendations for me? feel free to post your own photo books too!", "sortedWord": "None", "identifyer": 49855, "year": "2021"}, {"Unnamed: 0": 254719, "autor": "panickyfright", "date": 1635280214000, "content": "Shooting Portra 800 at night with flash /!/ yo. im gonna be shooting a backyard concert on halloween night with very few lights and was gonna try shooting portra 800 with flash on my contax g2. should I try shooting at 400 ISO or just leave it DX on 800?\n\ni previously shot a show at this same location with a contax t2 on superia 400 with flash and things turned out kind of lo-fi and dark, which is fine but I was interested in getting things a little more \"correct\" this time around.\n\nthanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qgfgqm/shooting_portra_800_at_night_with_flash/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shooting portra 800 at night with flash /!/ yo. im gonna be shooting a backyard concert on halloween night with very few lights and was gonna try shooting portra 800 with flash on my contax g2. should i try shooting at 400 iso or just leave it dx on 800?\n\ni previously shot a show at this same -----> location !!!  with a contax t2 on superia 400 with flash and things turned out kind of lo-fi and dark, which is fine but i was interested in getting things a little more \"correct\" this time around.\n\nthanks!", "sortedWord": "None", "identifyer": 107, "year": "2021"}, {"Unnamed: 0": 255231, "autor": "doriiian", "date": 1633532764000, "content": "Need help with working on a Zine /!/ So I'm currently wrapping up the work on a Zine I've been working on over the past six months. The process of photographing is (obviously) familiar with me but now  new challenges appear like design, print etc. \n\nThe most important question is about printing. Are there any photographers who have already had their experience with printing and could recommend someone? Preferably a printing store where individual needs are respected (not an online printing store) and location wise in Europe.\n\nAny help is welcome", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q2mct8/need_help_with_working_on_a_zine/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "need help with working on a zine /!/ so i'm currently wrapping up the work on a zine i've been working on over the past six months. the process of photographing is (obviously) familiar with me but now  new challenges appear like design, print etc. \n\nthe most important question is about printing. are there any photographers who have already had their experience with printing and could recommend someone? preferably a printing store where individual needs are respected (not an online printing store) and -----> location !!!  wise in europe.\n\nany help is welcome", "sortedWord": "None", "identifyer": 629, "year": "2021"}, {"Unnamed: 0": 255345, "autor": "Okay_Refrigerator", "date": 1634044131000, "content": "Olympus mju V vs Minolta Riva Zoom 75w /!/ Hi.  I'm buying an analog point and shoot as a gift with very little actual knowledge about photography. I've spent the last few days learning as much as I can, reading reviews, watching videos, and so on, and based on my location and buying options (found some old, unopened stock), I came up with these two cameras to choose from.\n\nI chose to go for a zoom instead of a prime lens because I think it gives a bit more versatility, and if the camera is supposed to last a long time, it just makes more sense to me, but that's just my thinking and may be wrong.\n\n**Olympus mju V**\n\n* all metal body\n* made in 2002\n* 38 - 105mm zoom lens (max. f/5.6 - 11.3, smallest f/17), 8 elements (ED, aspherical) in 7 groups\n* shutter 4 - 1/570s\n* 11-point multi-AF (infrared) with pre-focus lock\n\n**Minolta Riva Zoom 75w**\n\n* plastic body\n* made in 1997\n* 28 - 75mm zoom lens (f/3.5 - 8.9), 4 elements in 4 groups\n* shutter 10 - 1/390s\n* 3-beam, active infrared AF with focus lock\n\nOther things seem more or less the same to me (closest focus around 50cm, ISO range 50 - 3200, flash, everything automatic, some basic functions to choose from).\n\nIn my understanding, the Olympus has better build quality, higher quality lens, more reliable AF, and will probably last longer - all in all, a higher quality device. \n\nOn the other hand, the Minolta has a much \"better\" lens and more \"useful\" focal length range (in quotes because I don't want to oversimplify) for general snapshot taking - pictures of friends, pets, some general street photography, in handheld mode and not always with great light conditions.\n\nMy questions are:\n\n1. Is my understanding correct, or is there more to consider?\n2. Which one should I choose?\n\n&amp;#x200B;\n\nThank you for your opinions and help!\n\n[View Poll](https://www.reddit.com/poll/q6ltfo)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q6ltfo/olympus_mju_v_vs_minolta_riva_zoom_75w/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "olympus mju v vs minolta riva zoom 75w /!/ hi.  i'm buying an analog point and shoot as a gift with very little actual knowledge about photography. i've spent the last few days learning as much as i can, reading reviews, watching videos, and so on, and based on my -----> location !!!  and buying options (found some old, unopened stock), i came up with these two cameras to choose from.\n\ni chose to go for a zoom instead of a prime lens because i think it gives a bit more versatility, and if the camera is supposed to last a long time, it just makes more sense to me, but that's just my thinking and may be wrong.\n\n**olympus mju v**\n\n* all metal body\n* made in 2002\n* 38 - 105mm zoom lens (max. f/5.6 - 11.3, smallest f/17), 8 elements (ed, aspherical) in 7 groups\n* shutter 4 - 1/570s\n* 11-point multi-af (infrared) with pre-focus lock\n\n**minolta riva zoom 75w**\n\n* plastic body\n* made in 1997\n* 28 - 75mm zoom lens (f/3.5 - 8.9), 4 elements in 4 groups\n* shutter 10 - 1/390s\n* 3-beam, active infrared af with focus lock\n\nother things seem more or less the same to me (closest focus around 50cm, iso range 50 - 3200, flash, everything automatic, some basic functions to choose from).\n\nin my understanding, the olympus has better build quality, higher quality lens, more reliable af, and will probably last longer - all in all, a higher quality device. \n\non the other hand, the minolta has a much \"better\" lens and more \"useful\" focal length range (in quotes because i don't want to oversimplify) for general snapshot taking - pictures of friends, pets, some general street photography, in handheld mode and not always with great light conditions.\n\nmy questions are:\n\n1. is my understanding correct, or is there more to consider?\n2. which one should i choose?\n\n&amp;#x200b;\n\nthank you for your opinions and help!\n\n[view poll](https://www.reddit.com/poll/q6ltfo)", "sortedWord": "None", "identifyer": 743, "year": "2021"}, {"Unnamed: 0": 255552, "autor": "schmomringler", "date": 1611769387000, "content": "Making large FB paper prints on location /!/ I wanted to take some photograms on location for my latest project. The final size would be around 110x150cm (43x59 inch). I thought about using a drain or stove pipe for the chemicals just like an ultra large jobo drum tank and roll the paper into them. Is there someone who tried something like this here? At this point I'm open for any kind of help or idea in this! So thank you for any input.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l6a1s0/making_large_fb_paper_prints_on_location/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "making large fb paper prints on -----> location !!!  /!/ i wanted to take some photograms on location for my latest project. the final size would be around 110x150cm (43x59 inch). i thought about using a drain or stove pipe for the chemicals just like an ultra large jobo drum tank and roll the paper into them. is there someone who tried something like this here? at this point i'm open for any kind of help or idea in this! so thank you for any input.", "sortedWord": "None", "identifyer": 956, "year": "2021"}, {"Unnamed: 0": 255895, "autor": "Voves", "date": 1623007427000, "content": "Doing a photo shoot at night with cinestill 800t, should I have it pushed in development? /!/ I'm doing a photo shoot at night, and my friend wants to go for a dark/industrial location, and is imagining a greenish overexposed look to the photos. Any special ways to make this happen? I'm not used to shooting in the dark, so it's a learning experience too me. \n\nShould I be pushing the film an extra stop in development? Or should I just leave it at box speed?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nttdiy/doing_a_photo_shoot_at_night_with_cinestill_800t/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "doing a photo shoot at night with cinestill 800t, should i have it pushed in development? /!/ i'm doing a photo shoot at night, and my friend wants to go for a dark/industrial -----> location !!! , and is imagining a greenish overexposed look to the photos. any special ways to make this happen? i'm not used to shooting in the dark, so it's a learning experience too me. \n\nshould i be pushing the film an extra stop in development? or should i just leave it at box speed?", "sortedWord": "None", "identifyer": 1302, "year": "2021"}, {"Unnamed: 0": 256033, "autor": "sourovdebmishu", "date": 1622181196000, "content": "Through the viewfinder of my Canon 1000fn. Kodak Colorplus 200. Canon 70-200 70mm. F-9. 1/70. Location: Saint Leu, Ile De La Reunion. 7.30 am to morning. Not yet developed.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nmr1d1/through_the_viewfinder_of_my_canon_1000fn_kodak/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "through the viewfinder of my canon 1000fn. kodak colorplus 200. canon 70-200 70mm. f-9. 1/70. -----> location !!! : saint leu, ile de la reunion. 7.30 am to morning. not yet developed.", "sortedWord": "None", "identifyer": 1443, "year": "2021"}, {"Unnamed: 0": 257235, "autor": "Correct_Rhubarb_1563", "date": 1628228713000, "content": "Shot on the same roll, setting and location. It is user error or is there an issue with my shutter?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oz0kc4/shot_on_the_same_roll_setting_and_location_it_is/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shot on the same roll, setting and -----> location !!! . it is user error or is there an issue with my shutter?", "sortedWord": "None", "identifyer": 2667, "year": "2021"}, {"Unnamed: 0": 257249, "autor": "5thEditionFanboy", "date": 1628203865000, "content": "Filters for shooting faraway mountains in bw? /!/ I'm somewhat familiar with the concept of using colored filters for black and white photography to bring out contrasts, but not sure which filter to use in this case. I'm trying to shoot mountains from a rather distant location, to a degree where they're often tinted blue with poor contrast against the sky. Is there any kind of filter that would help with this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oytv2w/filters_for_shooting_faraway_mountains_in_bw/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "filters for shooting faraway mountains in bw? /!/ i'm somewhat familiar with the concept of using colored filters for black and white photography to bring out contrasts, but not sure which filter to use in this case. i'm trying to shoot mountains from a rather distant -----> location !!! , to a degree where they're often tinted blue with poor contrast against the sky. is there any kind of filter that would help with this?", "sortedWord": "None", "identifyer": 2681, "year": "2021"}, {"Unnamed: 0": 257354, "autor": "cjafe", "date": 1631896239000, "content": "With the abundance of good lightmeter apps, what are other digital tools that the analog community could benefit from? /!/ I'd love to see an app that helps  preview what film stock to use. I generally have a good idea of the  colors and look I'm going for, but as I shoot mainly 6x9 negatives in  locations that I likely won't visit again, it would be great sometimes  to be 100% sure that I'm using the \"perfect\" film for given senario.  Maybe there's already such an app that I'm not aware of. What are some  other apps people would like to see? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pq3j78/with_the_abundance_of_good_lightmeter_apps_what/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "with the abundance of good lightmeter apps, what are other digital tools that the analog community could benefit from? /!/ i'd love to see an app that helps  preview what film stock to use. i generally have a good idea of the  colors and look i'm going for, but as i shoot mainly 6x9 negatives in  -----> locations !!!  that i likely won't visit again, it would be great sometimes  to be 100% sure that i'm using the \"perfect\" film for given senario.  maybe there's already such an app that i'm not aware of. what are some  other apps people would like to see? ", "sortedWord": "None", "identifyer": 2789, "year": "2021"}, {"Unnamed: 0": 257495, "autor": "Suede_Rxxm", "date": 1634624363000, "content": "Mamiya 645 Super FIX /!/ This is my first reddit post ever so I'm sorry if I mess up the formatting.\n\nI bought a mamiya 645 Super with a broken mirror stop arm and the 3-D printed replacement part. A lot of the stuff I found wasn't cut and dry in putting the spring back in, so I will try my best in explaining it and answering questions. I have not been able to calibrate it since I only have the body atm. Once I can afford the rest of the stuff and run a roll through it I will update this post to show how it actually went. This is fix the method I used for getting the spring and mirror stop arm installed on the Mamiya 645 Super. Hopefully this helps in some capacity.\n\nIf you have the mamiya 645 pro, or need help removing the mirror stop arm... use this video -&gt; [Focus Error Fix for Mamiya 645 Pro - YouTube](https://www.youtube.com/watch?v=f2BZEPjngMA&amp;t=656s). The method he used works great for the pro because there is a notch cut out or the spring. This method did not work for my 645 Super because there is no notch. Maybe I'm dumb but I tried for hours and couldn't do it. \n\nFor the mamiya 645 Super the location where you hook the long spring arm is incredibly hard to find. u/Brcamera said it best, with the super you are pretty much going in blind. So, being the smooth brain I am, I didn't take pictures so I made some pictures that I hope will help. If you are missing or have a broken spring it's GGs. I did this by going from the front of the camera btw\n\nTools: Tweezers, bent tweezers, fingers, screwdrivers, depression, beer.\n\n1) Remove the mirror stop arm. The youtube video I recommended shows the process.\n\n2) This takes a lot of feeling around, but hook the long end into that notch and rotate the spring towards the gold post that holds the arm. This will set the hook. You can tug on it a little to check too. \n\n3) Slightly lift the spring high enough to squeeze the arm onto the post. It's a tight squeeze so use some really thin/long tweezers to help. \n\n4) With the spring hooked on, and the arm in the hardest part is grabbing the small side of the spring and hooking it to the backside of the arm. For this, I grabbed another set of thin/long tweezers, and bent the tips to create a little hook to grab onto the spring. I screwed the mirror stop arm down, put my finger over the screw to hold the spring down, and then used the tweezers to hook and pull the spring down until it latched onto the bottom side of the of the arm where it's supposed to go. \n\n5) Done\n\nIdk if this will help at all but I'm tired af and wanted to post it before I forget. I'll try to edit it if I need to. Feel free to roast the drawings or my crappy explanation. Goodnight.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qb5i57/mamiya_645_super_fix/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "mamiya 645 super fix /!/ this is my first reddit post ever so i'm sorry if i mess up the formatting.\n\ni bought a mamiya 645 super with a broken mirror stop arm and the 3-d printed replacement part. a lot of the stuff i found wasn't cut and dry in putting the spring back in, so i will try my best in explaining it and answering questions. i have not been able to calibrate it since i only have the body atm. once i can afford the rest of the stuff and run a roll through it i will update this post to show how it actually went. this is fix the method i used for getting the spring and mirror stop arm installed on the mamiya 645 super. hopefully this helps in some capacity.\n\nif you have the mamiya 645 pro, or need help removing the mirror stop arm... use this video -&gt; [focus error fix for mamiya 645 pro - youtube](https://www.youtube.com/watch?v=f2bzepjngma&amp;t=656s). the method he used works great for the pro because there is a notch cut out or the spring. this method did not work for my 645 super because there is no notch. maybe i'm dumb but i tried for hours and couldn't do it. \n\nfor the mamiya 645 super the -----> location !!!  where you hook the long spring arm is incredibly hard to find. u/brcamera said it best, with the super you are pretty much going in blind. so, being the smooth brain i am, i didn't take pictures so i made some pictures that i hope will help. if you are missing or have a broken spring it's ggs. i did this by going from the front of the camera btw\n\ntools: tweezers, bent tweezers, fingers, screwdrivers, depression, beer.\n\n1) remove the mirror stop arm. the youtube video i recommended shows the process.\n\n2) this takes a lot of feeling around, but hook the long end into that notch and rotate the spring towards the gold post that holds the arm. this will set the hook. you can tug on it a little to check too. \n\n3) slightly lift the spring high enough to squeeze the arm onto the post. it's a tight squeeze so use some really thin/long tweezers to help. \n\n4) with the spring hooked on, and the arm in the hardest part is grabbing the small side of the spring and hooking it to the backside of the arm. for this, i grabbed another set of thin/long tweezers, and bent the tips to create a little hook to grab onto the spring. i screwed the mirror stop arm down, put my finger over the screw to hold the spring down, and then used the tweezers to hook and pull the spring down until it latched onto the bottom side of the of the arm where it's supposed to go. \n\n5) done\n\nidk if this will help at all but i'm tired af and wanted to post it before i forget. i'll try to edit it if i need to. feel free to roast the drawings or my crappy explanation. goodnight.", "sortedWord": "None", "identifyer": 2934, "year": "2021"}, {"Unnamed: 0": 257519, "autor": "the_internet_is_bad", "date": 1634592140000, "content": "Using C41-Lab command line... I am at a total loss. /!/ I'm usually fairly competent with tech, even command line ish, but I am just totally lost on how to use this. I got ImageMagick, I run the script, it just sends me right back to my default file system location. I have the two files, named easily, and I just can't get this to Do The Thing. Please help if you use this.\n\n[https://sites.google.com/site/c41digitallab/](https://sites.google.com/site/c41digitallab/)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qaw98f/using_c41lab_command_line_i_am_at_a_total_loss/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "using c41-lab command line... i am at a total loss. /!/ i'm usually fairly competent with tech, even command line ish, but i am just totally lost on how to use this. i got imagemagick, i run the script, it just sends me right back to my default file system -----> location !!! . i have the two files, named easily, and i just can't get this to do the thing. please help if you use this.\n\n[https://sites.google.com/site/c41digitallab/](https://sites.google.com/site/c41digitallab/)", "sortedWord": "None", "identifyer": 2958, "year": "2021"}, {"Unnamed: 0": 259264, "autor": "PaleontologistNo7132", "date": 1627410228000, "content": "In studio and on-location with Nikon F, and Fuji color Superia 400.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ossaj1/in_studio_and_onlocation_with_nikon_f_and_fuji/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "in studio and on------> location !!!  with nikon f, and fuji color superia 400.", "sortedWord": "None", "identifyer": 4727, "year": "2021"}, {"Unnamed: 0": 259265, "autor": "PaleontologistNo7132", "date": 1627410076000, "content": "In studio and on-location with Nikon F and Fuji color Superia 400 film.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oss8qh/in_studio_and_onlocation_with_nikon_f_and_fuji/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "in studio and on------> location !!!  with nikon f and fuji color superia 400 film.", "sortedWord": "None", "identifyer": 4728, "year": "2021"}, {"Unnamed: 0": 259925, "autor": "therealjerseytom", "date": 1617965169000, "content": "Infinity adjustment on Canon FD lenses (nFD 200mm f4) /!/ Recently picked up an nFD 200mm f/4 from KEH in \"bargain\" condition. I set my bar of expectation low, but for the most part other than a few small dings on the outside of the thing, it's in pretty good shape. Glass all looks clear and clean.\n\nBut the infinity focus seems just a *hair* short of where it needs to be, judging by the split image on the focus screen of my F-1. I might have to do some more testing with how overall sharpness looks using a mirrorless camera, although that introduces the variable of the adapter length and hitting the right focus point.\n\nIn any event - thoughts on the general difficulty level of doing this adjustment? Having Googled around, haven't seen anything specific to this lens, but it seems like the general process would entail:\n\n1. Finding the focus / helicoid hard stop, loosening set screw, and nudging it over\n2. Adjusting the clocking of the focusing ring such that the new hard stop location matches the infinity mark\n\nDoesn't seem like it should be *that* bad (famous last words), but it's not something I've delved into before. \n\nOpen to any thoughts or wisdom while I consider this little adventure...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mneid1/infinity_adjustment_on_canon_fd_lenses_nfd_200mm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "infinity adjustment on canon fd lenses (nfd 200mm f4) /!/ recently picked up an nfd 200mm f/4 from keh in \"bargain\" condition. i set my bar of expectation low, but for the most part other than a few small dings on the outside of the thing, it's in pretty good shape. glass all looks clear and clean.\n\nbut the infinity focus seems just a *hair* short of where it needs to be, judging by the split image on the focus screen of my f-1. i might have to do some more testing with how overall sharpness looks using a mirrorless camera, although that introduces the variable of the adapter length and hitting the right focus point.\n\nin any event - thoughts on the general difficulty level of doing this adjustment? having googled around, haven't seen anything specific to this lens, but it seems like the general process would entail:\n\n1. finding the focus / helicoid hard stop, loosening set screw, and nudging it over\n2. adjusting the clocking of the focusing ring such that the new hard stop -----> location !!!  matches the infinity mark\n\ndoesn't seem like it should be *that* bad (famous last words), but it's not something i've delved into before. \n\nopen to any thoughts or wisdom while i consider this little adventure...", "sortedWord": "None", "identifyer": 5402, "year": "2021"}, {"Unnamed: 0": 260533, "autor": "goatm8", "date": 1624057329000, "content": "Canon Autoboy 2 vs Olympus MJU II? /!/ Hi guys I’m buying a film camera as a present for a beginner photographer and have narrowed down my search to the two options titled, the main criteria is beginner friendly, so autofocus and autoexposure are a must, which I believe both of these have. \n\nFrom what I can see these are both very similar cameras, has anyone used both and can comment on which is \nbetter? They are roughly the same price in my location", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o32lh6/canon_autoboy_2_vs_olympus_mju_ii/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon autoboy 2 vs olympus mju ii? /!/ hi guys i’m buying a film camera as a present for a beginner photographer and have narrowed down my search to the two options titled, the main criteria is beginner friendly, so autofocus and autoexposure are a must, which i believe both of these have. \n\nfrom what i can see these are both very similar cameras, has anyone used both and can comment on which is \nbetter? they are roughly the same price in my -----> location !!! ", "sortedWord": "None", "identifyer": 6026, "year": "2021"}, {"Unnamed: 0": 262714, "autor": "mesh27", "date": 1627206569000, "content": "Started clicking analogue with the Olympus trip 35 that I got off from a seller. Hoping for some good results our of this. (Location: India)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/or8r2w/started_clicking_analogue_with_the_olympus_trip/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "started clicking analogue with the olympus trip 35 that i got off from a seller. hoping for some good results our of this. (-----> location !!! : india)", "sortedWord": "None", "identifyer": 8262, "year": "2021"}, {"Unnamed: 0": 262954, "autor": "xeroaura", "date": 1618684137000, "content": "Free(ish) Expired Kodak Film (USA) /!/ Hi Everyone!\n\nOne of my parents has recently found a bunch of expired Kodak film (2002-2004 range) that have been stored in a dark closet in an AC'ed office building. Therefore, no guarantees on the quality of the film. I've decided to giveaway a box of film to 8 members of this sub after a discussion with the mods. There will be 8 sets of film as broken down further below.\n\n**You will be paying shipping.** \n\nTwo Options for continental USA:\n\n1. USPS Flat Rate Small Box - $8.45 within continental US in hard box.\n2. First Class Flat Rate Parcel - Will use a bubble mailer so outer paper box might be dented or removed if it doesn't fit. ~$4.80-$6 depending on location/weight. \n\nIf you win and want to retain the outer packaging for some reason, we can discuss options. If you're outside the US or Alaska/Hawaii, I can still calculate shipping prices if you win but I'm not sure if the price would be worth it at that point.\n\n---\n\nTo enter, just leave a comment below on which one box of film you want. This will be open for at least 48 hours. I'll be picking the top 4 by upvotes as well as another 4 randomly through a giveaway picker site some time on Monday after I get off work.\n\n---\n\nPhoto of stash: https://i.imgur.com/qQllMcp.jpg\n\n---\n\nThe 8 sets are as following:\n\nKodak Gold 200 35mm (2 sets)\n\n- 4 rolls x 24 exposures\n- 1 rolls x 36 exposures\n\nKodak Advantix 200 (2 sets)\n\n- 6 rolls x 25 exposures\n\nKodak Max Versatility Plus 200 35mm (4 sets)\n\n- 5 rolls x 24 exposures\n- 2 rolls x 36 exposures", "link": "https://www.reddit.com/r/AnalogCommunity/comments/msw5n6/freeish_expired_kodak_film_usa/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "free(ish) expired kodak film (usa) /!/ hi everyone!\n\none of my parents has recently found a bunch of expired kodak film (2002-2004 range) that have been stored in a dark closet in an ac'ed office building. therefore, no guarantees on the quality of the film. i've decided to giveaway a box of film to 8 members of this sub after a discussion with the mods. there will be 8 sets of film as broken down further below.\n\n**you will be paying shipping.** \n\ntwo options for continental usa:\n\n1. usps flat rate small box - $8.45 within continental us in hard box.\n2. first class flat rate parcel - will use a bubble mailer so outer paper box might be dented or removed if it doesn't fit. ~$4.80-$6 depending on -----> location !!! /weight. \n\nif you win and want to retain the outer packaging for some reason, we can discuss options. if you're outside the us or alaska/hawaii, i can still calculate shipping prices if you win but i'm not sure if the price would be worth it at that point.\n\n---\n\nto enter, just leave a comment below on which one box of film you want. this will be open for at least 48 hours. i'll be picking the top 4 by upvotes as well as another 4 randomly through a giveaway picker site some time on monday after i get off work.\n\n---\n\nphoto of stash: https://i.imgur.com/qqllmcp.jpg\n\n---\n\nthe 8 sets are as following:\n\nkodak gold 200 35mm (2 sets)\n\n- 4 rolls x 24 exposures\n- 1 rolls x 36 exposures\n\nkodak advantix 200 (2 sets)\n\n- 6 rolls x 25 exposures\n\nkodak max versatility plus 200 35mm (4 sets)\n\n- 5 rolls x 24 exposures\n- 2 rolls x 36 exposures", "sortedWord": "None", "identifyer": 8505, "year": "2021"}, {"Unnamed: 0": 263264, "autor": "TheHappyGrouch", "date": 1621719783000, "content": "How do you organize your negatives? /!/ I have shot over 100 rolls of film, all the rolls are in negative sheets in binders. I used to keep a notebook of the information from each roll (names, dates, locations) but it was almost impossible to find what I was looking for because I couldn't simply search the notebook. So I began entering the information into an excel document, which is fine but the document is getting really long.  Is there an easier way to keep track of this information? What is the secret?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nisv2x/how_do_you_organize_your_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "how do you organize your negatives? /!/ i have shot over 100 rolls of film, all the rolls are in negative sheets in binders. i used to keep a notebook of the information from each roll (names, dates, -----> locations !!! ) but it was almost impossible to find what i was looking for because i couldn't simply search the notebook. so i began entering the information into an excel document, which is fine but the document is getting really long.  is there an easier way to keep track of this information? what is the secret?", "sortedWord": "None", "identifyer": 8819, "year": "2021"}, {"Unnamed: 0": 263499, "autor": "Autotuned_Fish", "date": 1623169307000, "content": "Complete beginner here, looking for ISO adjustment to match film. Not sure as to the location or if my camera even has one. Any help is greatly appreciated:)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nv7zb6/complete_beginner_here_looking_for_iso_adjustment/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "complete beginner here, looking for iso adjustment to match film. not sure as to the -----> location !!!  or if my camera even has one. any help is greatly appreciated:)", "sortedWord": "None", "identifyer": 9060, "year": "2021"}, {"Unnamed: 0": 263533, "autor": "onionelf", "date": 1617785721000, "content": "eBay purchase from Japan - trust issues /!/ Hey analogue community!\n\nI would like to upgrade from my old and much used Nikon FG to a more sophisticated camera. The model I am looking for (mainland European) is mostly offered by Japanese sellers.\n\nNow I am a bit wary of buying from non-EU sellers as the descriptions and pictures from Japanese sellers all look very similar. Also, JP sellers list their location as USA but the item location as Japan.\n\n* What is your experience with purchases from Japan?\n* Can you trust the pictures and descriptions?\n* If it says \"free shipping\", is it really free (excl. VAT of course)?\n\n&amp;#x200B;\n\nI am happy about any answer :-)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mlxwb9/ebay_purchase_from_japan_trust_issues/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "ebay purchase from japan - trust issues /!/ hey analogue community!\n\ni would like to upgrade from my old and much used nikon fg to a more sophisticated camera. the model i am looking for (mainland european) is mostly offered by japanese sellers.\n\nnow i am a bit wary of buying from non-eu sellers as the descriptions and pictures from japanese sellers all look very similar. also, jp sellers list their -----> location !!!  as usa but the item -----> location !!!  as japan.\n\n* what is your experience with purchases from japan?\n* can you trust the pictures and descriptions?\n* if it says \"free shipping\", is it really free (excl. vat of course)?\n\n&amp;#x200b;\n\ni am happy about any answer :-)", "sortedWord": "None", "identifyer": 9094, "year": "2021"}, {"Unnamed: 0": 264144, "autor": "T4llAgent", "date": 1626052117000, "content": "Going to Utah in October. Any tips for photographing the area? /!/ I’ll be going in October, hitting Arches, Canyonlands, Capitol Reef, Bonneville Salt Flats, Little Sahara, and Antelope Island. \n\nI shoot 35mm on a Konica Autoreflex T SLR, with a 28mm and 50mm Konica lens. I’ll probably have a Canon AE-1 (I know, I know) by then as well, but the Konica is for sure. \n\nAs far as film, I’ve shot Fuji 400, Kodak 200, and I’m working through a roll of Portra 400 right now. What film would work best in the locations I’ve mentioned?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oigugt/going_to_utah_in_october_any_tips_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "going to utah in october. any tips for photographing the area? /!/ i’ll be going in october, hitting arches, canyonlands, capitol reef, bonneville salt flats, little sahara, and antelope island. \n\ni shoot 35mm on a konica autoreflex t slr, with a 28mm and 50mm konica lens. i’ll probably have a canon ae-1 (i know, i know) by then as well, but the konica is for sure. \n\nas far as film, i’ve shot fuji 400, kodak 200, and i’m working through a roll of portra 400 right now. what film would work best in the -----> locations !!!  i’ve mentioned?", "sortedWord": "None", "identifyer": 9715, "year": "2021"}], "name": "locationAnalogCommunity2021"}