{"interestingcomments": [{"Unnamed: 0": 128413, "autor": "Gibslayer", "date": 1523387994000, "content": "Looking for film suggestions for a shoot /!/ Doing my first shoot with a film camera (Also going to use digital) and wondering what film I should take with me.\n\nFor black and white I'm going to take some HP5. Simple staple film so I can't see it being a bad choice.\n\nBut don't know what to take colour wise. Don't want to take a really expensive film as it's my first shoot with film.\n\n\n\n*The location:* I'm doing event photography for my local record shop on Record Store Day. Going to use both digital and Analogue throughout the day. Want to use Analogue to create a story throughout the day, showing what happened from opening to close. Some shots will be outside and it's predicted to be sunny (though it's England so expecting a little overcast) and most will be taken inside the shop as people are enjoying their day. Lots of people in the pictures, the shop has a lot of warm browns an orange wood tones within.\n\nCamera: Minolta X-700\n\nAny questions to help with suggestions feel free to ask!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8bah9n/looking_for_film_suggestions_for_a_shoot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "looking for film suggestions for a shoot /!/ doing my first shoot with a film camera (also going to use digital) and wondering what film i should take with me.\n\nfor black and white i'm going to take some hp5. simple staple film so i can't see it being a bad choice.\n\nbut don't know what to take colour wise. don't want to take a really expensive film as it's my first shoot with film.\n\n\n\n*the -----> location !!! :* i'm doing event photography for my local record shop on record store day. going to use both digital and analogue throughout the day. want to use analogue to create a story throughout the day, showing what happened from opening to close. some shots will be outside and it's predicted to be sunny (though it's england so expecting a little overcast) and most will be taken inside the shop as people are enjoying their day. lots of people in the pictures, the shop has a lot of warm browns an orange wood tones within.\n\ncamera: minolta x-700\n\nany questions to help with suggestions feel free to ask!", "sortedWord": "None", "identifyer": 19107, "year": "2018"}, {"Unnamed: 0": 128710, "autor": "joesci", "date": 1542804781000, "content": "Inconsistent light leaks - camera or canister? /!/ A friend posted the other day about some light leaks on his first roll, shot with a Minolta X300\n\nhttps://www.reddit.com/r/AnalogCommunity/comments/9yfvxh/can_anyone_explain_whats_gone_wrong_with_these/?st=jor5xsbq&amp;sh=c7b7035e\n\nThe consensus was obviously camera light seals, but the camera was purchased in working order from a reputable seller.\n\nAs well as that, the leaks are inconsistent in shape, colour, and location - which is pretty uncommon if it were simply a botched hinge seal right? If it were a light leak (unless the entire camera is leaking) from the back door seal, you'd surely expect the leak to be across most frames, be in a similar/same place, and be of similar severity depending on how long he took to shoot that frame - a vast majority of the 36 frames from the roll are totally clear of leakage. \n\nHow common is it that film is botched before you buy it? Could it have been wound in his camera loosely? Are there any other possibilities besides his camera light seals?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9z2yje/inconsistent_light_leaks_camera_or_canister/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "inconsistent light leaks - camera or canister? /!/ a friend posted the other day about some light leaks on his first roll, shot with a minolta x300\n\nhttps://www.reddit.com/r/analogcommunity/comments/9yfvxh/can_anyone_explain_whats_gone_wrong_with_these/?st=jor5xsbq&amp;sh=c7b7035e\n\nthe consensus was obviously camera light seals, but the camera was purchased in working order from a reputable seller.\n\nas well as that, the leaks are inconsistent in shape, colour, and -----> location !!!  - which is pretty uncommon if it were simply a botched hinge seal right? if it were a light leak (unless the entire camera is leaking) from the back door seal, you'd surely expect the leak to be across most frames, be in a similar/same place, and be of similar severity depending on how long he took to shoot that frame - a vast majority of the 36 frames from the roll are totally clear of leakage. \n\nhow common is it that film is botched before you buy it? could it have been wound in his camera loosely? are there any other possibilities besides his camera light seals?", "sortedWord": "None", "identifyer": 19407, "year": "2018"}, {"Unnamed: 0": 128896, "autor": "vaguex", "date": 1519186004000, "content": "Workflows for organizing of your physical and digital negative collections /!/ Hey All! \n\nI wanted to ask everyone here to share their workflows for how they organize their physical and digital negative collections. I am having a difficult time trying to come up with the optimal system to organize my negatives on both fronts and wanted to hear how others are doing it? I thought this could be beneficial for any user who is curious on how to develop a system to organize their negatives. \n\nCurrently I have them all in one folder in a system like this:\n\nFILM FORMAT_CAMERA_FILM_ISO pushed_##_desc/location \n\nThis system is used both in digital and physical format, for my negatives but I am finding I am having difficulty finding negatives with this system and I am considering adding year and location/event but I am hesitant to start a massive reorganization without learning from others. \n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7z2nn0/workflows_for_organizing_of_your_physical_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "workflows for organizing of your physical and digital negative collections /!/ hey all! \n\ni wanted to ask everyone here to share their workflows for how they organize their physical and digital negative collections. i am having a difficult time trying to come up with the optimal system to organize my negatives on both fronts and wanted to hear how others are doing it? i thought this could be beneficial for any user who is curious on how to develop a system to organize their negatives. \n\ncurrently i have them all in one folder in a system like this:\n\nfilm format_camera_film_iso pushed_##_desc/-----> location !!!  \n\nthis system is used both in digital and physical format, for my negatives but i am finding i am having difficulty finding negatives with this system and i am considering adding year and -----> location !!! /event but i am hesitant to start a massive reorganization without learning from others. \n", "sortedWord": "None", "identifyer": 19593, "year": "2018"}, {"Unnamed: 0": 129572, "autor": "olivvers", "date": 1539689638000, "content": "I need a \"Cheap\" looking medium format camera with good image quality and sharpness, recommendations? /!/ With uni I'm gonna be doing a project on Street photography, will be out and about in the city and want to shoot medium format. \n\nI don't need the camera to be cheap I just don't want to get it stolen. We will be assigned an area of the city and in case it's a busy location, I would like something that doesn't scream expensive. \n\nPreferably a TLR? But I'm super open to suggestions, only just started shooting 120 and moving from 35 the detail is so nice!! Any suggestions would be good but as a requirement I would prefer it to take 120 film. Thank you so much!! ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9omrlo/i_need_a_cheap_looking_medium_format_camera_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i need a \"cheap\" looking medium format camera with good image quality and sharpness, recommendations? /!/ with uni i'm gonna be doing a project on street photography, will be out and about in the city and want to shoot medium format. \n\ni don't need the camera to be cheap i just don't want to get it stolen. we will be assigned an area of the city and in case it's a busy -----> location !!! , i would like something that doesn't scream expensive. \n\npreferably a tlr? but i'm super open to suggestions, only just started shooting 120 and moving from 35 the detail is so nice!! any suggestions would be good but as a requirement i would prefer it to take 120 film. thank you so much!! ", "sortedWord": "None", "identifyer": 20278, "year": "2018"}, {"Unnamed: 0": 129649, "autor": "iwantachange33", "date": 1538976061000, "content": "Best second hand stores for great finds in Sydney, Australia /!/ Hello!\n\nI am wondering if any of the Aussies who live in Sydney on here can recommend any good op shops or salvos locations that usually have good film cameras. \n\nI am in the Hills District and have checked the local slavos and Vinnie's and haven't had any luck. I was thinking places like Newtown would probably be a good idea. I'd really appreciate some suggestions 🙏🏼\n\nThank you!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9mc3zh/best_second_hand_stores_for_great_finds_in_sydney/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "best second hand stores for great finds in sydney, australia /!/ hello!\n\ni am wondering if any of the aussies who live in sydney on here can recommend any good op shops or salvos -----> locations !!!  that usually have good film cameras. \n\ni am in the hills district and have checked the local slavos and vinnie's and haven't had any luck. i was thinking places like newtown would probably be a good idea. i'd really appreciate some suggestions 🙏🏼\n\nthank you!!", "sortedWord": "None", "identifyer": 20357, "year": "2018"}, {"Unnamed: 0": 129765, "autor": "[deleted]", "date": 1517658704000, "content": "[UPDATE] on the insides of the Kodak Factory in London. /!/ I received this email on Thursday: \"Thanks for getting in touch. We are working with Barratt on the redevelopment of the Kodak Factory.\n\nWe will pass your inquiry on to the team at Barratt and come back to you on this.\n\nKind regards,\"\n\nToday, the 3rd at 11:45am I received an email from Barrett stating someone has already contacted them about the insides of the factory and has already scheduled a time to tour it and pick up what they want and have it moved to another factory location. This person has also been closely working with Kodak executives and got licensing, but I know nothing else. All I know is their gender (F) which is not important, they have Kodak licensing, and have purchase a location to move this stuff. I don't know what they are taking.\n\nI'm gutted, but not much I can do. They won't tell me anything else.\n\nI don't know how to find this person. They won't tell me. It's confidential. Well just have to wait it out and see.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7uywn8/update_on_the_insides_of_the_kodak_factory_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "[update] on the insides of the kodak factory in london. /!/ i received this email on thursday: \"thanks for getting in touch. we are working with barratt on the redevelopment of the kodak factory.\n\nwe will pass your inquiry on to the team at barratt and come back to you on this.\n\nkind regards,\"\n\ntoday, the 3rd at 11:45am i received an email from barrett stating someone has already contacted them about the insides of the factory and has already scheduled a time to tour it and pick up what they want and have it moved to another factory -----> location !!! . this person has also been closely working with kodak executives and got licensing, but i know nothing else. all i know is their gender (f) which is not important, they have kodak licensing, and have purchase a location to move this stuff. i don't know what they are taking.\n\ni'm gutted, but not much i can do. they won't tell me anything else.\n\ni don't know how to find this person. they won't tell me. it's confidential. well just have to wait it out and see.", "sortedWord": "None", "identifyer": 20473, "year": "2018"}, {"Unnamed: 0": 129815, "autor": "FilmDropYYC", "date": 1515965102000, "content": "Any film shooters in Calgary? /!/ I’ve started a drop box-based processing/scanning service in Calgary called Film Drop YYC.\n\n35mm and 120 for both C41 and B&amp;W (in Ilford DDX).\n\nCheck out [my website](www.filmdropyyc.com) for drop box locations, as well as any more details you might need. Pricing is all on the order form.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7qercn/any_film_shooters_in_calgary/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "any film shooters in calgary? /!/ i’ve started a drop box-based processing/scanning service in calgary called film drop yyc.\n\n35mm and 120 for both c41 and b&amp;w (in ilford ddx).\n\ncheck out [my website](www.filmdropyyc.com) for drop box -----> locations !!! , as well as any more details you might need. pricing is all on the order form.\n\nthanks!", "sortedWord": "None", "identifyer": 20523, "year": "2018"}, {"Unnamed: 0": 130307, "autor": "DartzIRL", "date": 1535290544000, "content": "New Lenses for an old FD-mount. /!/ I've a pair of old FD camera's - an F-1 and a T70.\n\nI'm trying to find a decent 35mm lens that'll fit. It needs to be fast (&lt;F2). The FD lenses on eBay tend to all be the usual 'Exc++++++' minefields and are all going for mental money.\n\nBut there is a brand new Nikon 35mm F2 that might just suit - available from a local dealer fresh off the shelf for similar money to the FD's on ebay. There's also the fully manual Samyang and Kerlee lenses to add to the mix.\n\nHas anybody had much success adapting F-mount lenses to FD? I've found an china-made adaptor on the way (Since the official Canon one does not exist anymore), \n\nIt's the sort of lens that'd suit perfectly the variety what I normally use the camera for and I tend to find myself in low-light locations where the fast aperture would be really helpful. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9afkcx/new_lenses_for_an_old_fdmount/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "new lenses for an old fd-mount. /!/ i've a pair of old fd camera's - an f-1 and a t70.\n\ni'm trying to find a decent 35mm lens that'll fit. it needs to be fast (&lt;f2). the fd lenses on ebay tend to all be the usual 'exc++++++' minefields and are all going for mental money.\n\nbut there is a brand new nikon 35mm f2 that might just suit - available from a local dealer fresh off the shelf for similar money to the fd's on ebay. there's also the fully manual samyang and kerlee lenses to add to the mix.\n\nhas anybody had much success adapting f-mount lenses to fd? i've found an china-made adaptor on the way (since the official canon one does not exist anymore), \n\nit's the sort of lens that'd suit perfectly the variety what i normally use the camera for and i tend to find myself in low-light -----> locations !!!  where the fast aperture would be really helpful. ", "sortedWord": "None", "identifyer": 21019, "year": "2018"}, {"Unnamed: 0": 130417, "autor": "sonygoup", "date": 1538434987000, "content": "Anyone near Islip, NY /!/ Hey I really need a favour, a camera pick up as I'm out of state.\n\nCamera cost 150$ USD plus how much ever shipping to be added. I'm in Florida.\n\nI can send payment via paypal\n\nI just really need this favour, the meet location is \nOpa Greek Restaurant \n260 Islip Ave, Islip, NY 11751, USA\n\nIf you can help please message me. Thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9klbiy/anyone_near_islip_ny/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "anyone near islip, ny /!/ hey i really need a favour, a camera pick up as i'm out of state.\n\ncamera cost 150$ usd plus how much ever shipping to be added. i'm in florida.\n\ni can send payment via paypal\n\ni just really need this favour, the meet -----> location !!!  is \nopa greek restaurant \n260 islip ave, islip, ny 11751, usa\n\nif you can help please message me. thanks", "sortedWord": "None", "identifyer": 21130, "year": "2018"}, {"Unnamed: 0": 130419, "autor": "sonygoup", "date": 1538430825000, "content": "Any in Islip, New York? /!/ Hey I really need a favour, a camera pick up as I'm out of state.\n\nCamera cost 150$ USD plus how much ever shipping to be added. I'm in Florida.\n\nI can send payment via paypal\n\nI just really need this favour, the meet location is \nOpa Greek Restaurant \n\nIf you can help please message me. Thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9kkrkp/any_in_islip_new_york/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "any in islip, new york? /!/ hey i really need a favour, a camera pick up as i'm out of state.\n\ncamera cost 150$ usd plus how much ever shipping to be added. i'm in florida.\n\ni can send payment via paypal\n\ni just really need this favour, the meet -----> location !!!  is \nopa greek restaurant \n\nif you can help please message me. thanks", "sortedWord": "None", "identifyer": 21132, "year": "2018"}, {"Unnamed: 0": 130668, "autor": "ddk4x5", "date": 1545057063000, "content": "Things I learned while going from medium format SLR to a large format view camera /!/ **Things I learned while going from medium format SLR to a large format view camera.**\n\nThese are the notes I kept after I just bought an intrepid 4x5 camera. Notes made after a month and reviewed after nine months.  It is very condensed compared to other writings. It contains a lot of notes for those who are eyeing to take the plunge into LF, as they say. And also some notes about what to look for in a LF camera. It is detailed, because I like details. And it is not only technical, but also about what it means to the subject. It's a long read, but since Reddit got me started in analog and \"caused me to buy a Mamiya m645 SLR, I thought it would be nice to share.\n\n\n**Documenting persons**\n\n* People like posing for the view camera way more than they do for my Mamiya m645.\n\n*Addendum after nine months:*\n* People are now asking me to make portraits based on my results, rather than on my invitation or the attractiveness of my hardware. That said, I have since bought a Wista 45dx, that is way more attractive than the Intrepid 4x5 mkII. I use the same lens, so the photo is the same, but a wood and brass camera helps. It's a starting point, and I can build on it.\n\n\n**The focusing proces**\n\n* The cover over my head needs to be light tight for better sight. I got a nice tightly woven cloth for this. \n\n*Addendum after nine months:* \n* led balls in the seem help holding it in place.\n* To check the focus on the ground glass, I need some magnification. Found out that a loupe is not for me. I found composing a pain when using a loupe. It puts me at a distance emotionally. Well, and my eyesight is not good enough without reading glasses, which hinders using the loupe.\n* A pair of cheap +4 reading glasses allow me to oversee the whole ground glass, and down the the details, with my head some 20cm from the ground glass. So this is my method now. (I normally use +1 fore reading.)\n\n\n**The viewfinder**\n\n* Focusing upside down is a nice abstraction that makes me compose better. It reminded me of having to put my drawings upside down in the painting class, to see what I needed to change.\n\n*Addendum after nine months:*\n* I do not even remember seeing the image online. It's something that is just a given and not important anymore. Since it rotates rather than mirrors, like the waste level view finders do, setting up the shot is less confusing than it was when I began shooting with my Mamiya m645.\n* I inverted my thinking about focusing. It is not something you dial into the lens. The lens is fixed. It projects a 3D image behind it, in which everything is sharp somewhere. I place my ground glass, and ultimately the film inside of this 3D projection. Only then it becomes 2D, and the location of the film plane is determines what is in focus. It would have made even more sense if the film plane was what was rolling in and out on these cameras.\n* Focusing very closely gives the sense of zooming in too. I heard people on youtube going mad about the \"focus drift\" that their \"full frame\" zoom lens has. Ha, they should see what happens if you focus in on someone half a meter from your LF.\nA fresnel\n* I bought an el cheapo (40 euro) fresnel for the ground glas. I wrote I'd report back. It's okay. The purpose is to bend the light that is off center, towards you, reducing vignetting. It will not change the image on the film. If you do not want vignetting on your film, close the aperture a bit (and lengthen the shutter time). The fresnel is a composing tool, as you can overlook the whole focus screen in a glance. It's not a focusing tool at all. Contrary to some guy on youtube who made a movie that google pushes at you when you search for fresnels, the fresnel goes on the OUTSIDE of the ground glass. It would trow your focus of if you'd mount it on the inside, as it would sit in between your lens and your focus screen that way. You do not want that.\n\n*Addendum after nine months:*\n* I can now compare the el cheapo to the fresnel that came on my Wista. The Wista's is much finer. But it does not really matter too much in practice. Would buy it again.\n\n\n**Movements**\n\nOn a large format camera you can move the lens up and down (rise and fall) and left to right (shift) for perspective control, and tilt/swing the lens for focus control. These are called movements. The intrepid only has lens movements, the Wista also has tilt, swing and shift on it’s back (the film plane).\n\n* I love shifting for perspective and tilting for precise focusing. I knew this from toying around with my digital mirrorless and some adapters. Lens tilt is much more intuitive then it is on my digital camera with a tilt-adapter. One reason is that because the image is not flipped right side up, I can see in my minds eye how the projection of the image works. Also, on a digital system, there is a swivel halfway between the lens and the sensor that allows for tilt. And the barrel of the lens is longer too. It works much much more intuitively when you really only tilt the film back or the lens plate, rather than bending the whole system halfway. \n\n*Addendum after nine months:*\n* I shoot so much more portraits than other things these days, that I hardly ever use shifts and rises anymore, only to fake back tilt on the Intrepid. As I expected, I use tilt and swing a lot, as to get two eyes and a mouth in focus. I really do this naturally. This why I wanted a large format field camera to begin with; I missed movements on the Mamiya SLR.\n* differences between the cameras: The Intrepid tilt axis runs right through the lens, while the Wista's pivots at the base. This makes tilting the lens more intuitive on the Intrepid. That said, it is too easy to knock out of place when cocking the shutter on the Intrepid. And the focusing process with tilt is iterative on both camera's anyway. It's just that I do not lose focus so much while setting the tilt on the Intrepid, as I do on the Wista. On the latter, there is this moment of disconnect after deciding I need the tilt.\n\n\n**The workflow**\n\n* The fact that you slide the film holder in after the composing and focusing is done, has an upshot. To determine when to trip to shutter is done by looking at reality, not through a device. To me, this feels more real, and thus better. \n\n*Addendum after nine months:*\n*I found that my subjects connect way more to me when I shoot this way. I might start doing like this digitally too: Just stand next to my camera rather than behind it.\n* I am a musician &amp; sound technician, so here's my perspective on the workflow in sound studio terms: Contrary to the SLR, a large format camera feels like recording. I set up the mics and the volumes, I give the band my directions and focus points, they get ready, and at the right moment I punch in the recording, and from that moment on, it is just them. Photography feels the same now. I feel like I make a registration, a document. An SLR feels like barging into the recording room, rather than quietly pressing record in the control room.\n\n*Addendum after nine months:*\nI also started directing shots like I direct singers in the my sound studio. I came to the realization when [Stephen DiRado](http://www.stephendirado.com) told me to listen to what was there to hear, while he made a portrait of me. He is such a great help in all this, and we became good friends.\n* I do no not make them wait, and I will no longer wait on somebody to change anything in their expression after I just told them to freeze, while they are essentially waiting for me to go click. I give them something to do, something to think about, something to listen too and to look at. A focuspoint, other than their own looks. This is similar to me in the studio, go over a text with the singer, and imagine a setting, a purpose, and an audience for them to see in their minds eye when performing their song. If I wouldn't, every recording would sound like \"He's recording this, let's not make any mistakes again, aaah\".\n* Though I ruined a few sheets, the workflow is not as bothersome as I expected it to be. But I must say I rehearsed the process in my mind a number of times before the camera arrived. \n\n*Addendum after nine months:*\n*I expanded a bit on the routine. Set focus, close lens, set shutter and aperture, fire a testshot, slide in film holder, check if lens is closed, cock shutter, open film holder, check subject, fire. All this time I keep communicating what I do, and I say \"hold still\" a lot. And I make jokes. People tell me I welcome and relax them. Good. Honestly, my mind is occupied with the tech side of the process too. You see, there are quite a few things I need to do between focussing and taking the picture. This is why my subject should hold still, not because the shutter times a that long. \n\n\n**Depth of field**\n\n* Shooting a larger format does not make the DoF shallower directly. But a 150mm lens has a similar field of view as a 50mm on a 135 (35mm)camera, and that long focal length comes with a less deep DoF. It looks like a f1.4. When you shoot close ups, backgrounds go way out of focus. When you shoot at a medium distance, say 4 meters, the background *still* goes out of focus. You need to be very precise with selecting what you want in focus, and therefor you will need tilt and swing.\n* I almost always shoot wide open, f5.6 on my lens, which means I have 1cm depth of field when I do a close up portrait. I use the full range of the shutter. From 1/400 to a full second. \n\n*Addendum after nine months:*\n* When focusing close ups, the bellow gets to be extended a lot more. This spreads the light form the lens over a larger area. You will need to double the shutter time that the meter suggests to compensate for this.\n* For regular scenes, mylightmeter app is okay. For more contrasty scenes, the contrasty camera of the phone has a hard time guessing. A dedicated meter will be better.\n\n\n**The negatives**\n\n* I like it that you can develop per sheet, thus per frame, and adjust dev times as you go along.\n\n*Addendum after nine months:*\nI standardized the development, making light on the film the only variable, and I develop per four. That's two film holders. I often shoot 4 or 8 frames now. I typically carry 5 film holders, so I can screw up 2 frames and still fill two tanks. I do not ruin films that often, though.\n* I'm not into this because I like developing, or scanning. I develop the same evening, I postpone scanning a lot.\n* I like that the negative is not microscopic. As soon as you pull it from the water, you can see how it is!\n\n*Addendum after nine months:*\nThe size feels very normal to me now. Not at all big anymore. That happened really fast.\nSome more notes on the quality camera\n\n*Addendum after nine months:*\n* It is really really important that you can lock any variable on the camera very securely. It is annoying that the Intrepid can be detuned so easily. This ruins shots. Focus may slide off when I tilt the camera back and do not thoroughly lock it. Rotation on the tripod cannot be locked well enough, causing the camera to be rotated sideways a bit when sliding in film into the rough plywood. Swing is annoyingly easy to ruin when setting the shutter dials. In these respects, the Wista is so much better.\nThe Wista is twice as heavy as the intrepid. But with all the other stuff you need (tripod, dark cloth, filmholders, glasses, lens, shutter release, light meter, filter) it does not matter that much.\nIt's just that I'd hate to be the one to make the first scratch on the 46 year old Wista, while I decided that the intrepid is for hiking. I was worry free when it got sanded on a black beach of Iceland and rained on on Martha's Vineyard. That's a feature the Wista does not have.\n\n**But most importantly**\n\nPhotographing this way brought me personal contacts in a way that music never did. To me, it was a journey full of surprises. Going large format improved the quality of my portraits a lot. And the size of the negative was the least relevant in that upgrade. With a 4x5, I was able to make very honest and direct documents of the people that are dear to me. The tool is no longer sitting between me, my eyes, and them. It is just an extension of me, standing next to me.\n\n**some results**\n\n[click!](https://www.facebook.com/krosov/media_set?set=a.1740699366055952&amp;type=1&amp;l=bf98b90b0c)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a70a2d/things_i_learned_while_going_from_medium_format/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "things i learned while going from medium format slr to a large format view camera /!/ **things i learned while going from medium format slr to a large format view camera.**\n\nthese are the notes i kept after i just bought an intrepid 4x5 camera. notes made after a month and reviewed after nine months.  it is very condensed compared to other writings. it contains a lot of notes for those who are eyeing to take the plunge into lf, as they say. and also some notes about what to look for in a lf camera. it is detailed, because i like details. and it is not only technical, but also about what it means to the subject. it's a long read, but since reddit got me started in analog and \"caused me to buy a mamiya m645 slr, i thought it would be nice to share.\n\n\n**documenting persons**\n\n* people like posing for the view camera way more than they do for my mamiya m645.\n\n*addendum after nine months:*\n* people are now asking me to make portraits based on my results, rather than on my invitation or the attractiveness of my hardware. that said, i have since bought a wista 45dx, that is way more attractive than the intrepid 4x5 mkii. i use the same lens, so the photo is the same, but a wood and brass camera helps. it's a starting point, and i can build on it.\n\n\n**the focusing proces**\n\n* the cover over my head needs to be light tight for better sight. i got a nice tightly woven cloth for this. \n\n*addendum after nine months:* \n* led balls in the seem help holding it in place.\n* to check the focus on the ground glass, i need some magnification. found out that a loupe is not for me. i found composing a pain when using a loupe. it puts me at a distance emotionally. well, and my eyesight is not good enough without reading glasses, which hinders using the loupe.\n* a pair of cheap +4 reading glasses allow me to oversee the whole ground glass, and down the the details, with my head some 20cm from the ground glass. so this is my method now. (i normally use +1 fore reading.)\n\n\n**the viewfinder**\n\n* focusing upside down is a nice abstraction that makes me compose better. it reminded me of having to put my drawings upside down in the painting class, to see what i needed to change.\n\n*addendum after nine months:*\n* i do not even remember seeing the image online. it's something that is just a given and not important anymore. since it rotates rather than mirrors, like the waste level view finders do, setting up the shot is less confusing than it was when i began shooting with my mamiya m645.\n* i inverted my thinking about focusing. it is not something you dial into the lens. the lens is fixed. it projects a 3d image behind it, in which everything is sharp somewhere. i place my ground glass, and ultimately the film inside of this 3d projection. only then it becomes 2d, and the -----> location !!!  of the film plane is determines what is in focus. it would have made even more sense if the film plane was what was rolling in and out on these cameras.\n* focusing very closely gives the sense of zooming in too. i heard people on youtube going mad about the \"focus drift\" that their \"full frame\" zoom lens has. ha, they should see what happens if you focus in on someone half a meter from your lf.\na fresnel\n* i bought an el cheapo (40 euro) fresnel for the ground glas. i wrote i'd report back. it's okay. the purpose is to bend the light that is off center, towards you, reducing vignetting. it will not change the image on the film. if you do not want vignetting on your film, close the aperture a bit (and lengthen the shutter time). the fresnel is a composing tool, as you can overlook the whole focus screen in a glance. it's not a focusing tool at all. contrary to some guy on youtube who made a movie that google pushes at you when you search for fresnels, the fresnel goes on the outside of the ground glass. it would trow your focus of if you'd mount it on the inside, as it would sit in between your lens and your focus screen that way. you do not want that.\n\n*addendum after nine months:*\n* i can now compare the el cheapo to the fresnel that came on my wista. the wista's is much finer. but it does not really matter too much in practice. would buy it again.\n\n\n**movements**\n\non a large format camera you can move the lens up and down (rise and fall) and left to right (shift) for perspective control, and tilt/swing the lens for focus control. these are called movements. the intrepid only has lens movements, the wista also has tilt, swing and shift on it’s back (the film plane).\n\n* i love shifting for perspective and tilting for precise focusing. i knew this from toying around with my digital mirrorless and some adapters. lens tilt is much more intuitive then it is on my digital camera with a tilt-adapter. one reason is that because the image is not flipped right side up, i can see in my minds eye how the projection of the image works. also, on a digital system, there is a swivel halfway between the lens and the sensor that allows for tilt. and the barrel of the lens is longer too. it works much much more intuitively when you really only tilt the film back or the lens plate, rather than bending the whole system halfway. \n\n*addendum after nine months:*\n* i shoot so much more portraits than other things these days, that i hardly ever use shifts and rises anymore, only to fake back tilt on the intrepid. as i expected, i use tilt and swing a lot, as to get two eyes and a mouth in focus. i really do this naturally. this why i wanted a large format field camera to begin with; i missed movements on the mamiya slr.\n* differences between the cameras: the intrepid tilt axis runs right through the lens, while the wista's pivots at the base. this makes tilting the lens more intuitive on the intrepid. that said, it is too easy to knock out of place when cocking the shutter on the intrepid. and the focusing process with tilt is iterative on both camera's anyway. it's just that i do not lose focus so much while setting the tilt on the intrepid, as i do on the wista. on the latter, there is this moment of disconnect after deciding i need the tilt.\n\n\n**the workflow**\n\n* the fact that you slide the film holder in after the composing and focusing is done, has an upshot. to determine when to trip to shutter is done by looking at reality, not through a device. to me, this feels more real, and thus better. \n\n*addendum after nine months:*\n*i found that my subjects connect way more to me when i shoot this way. i might start doing like this digitally too: just stand next to my camera rather than behind it.\n* i am a musician &amp; sound technician, so here's my perspective on the workflow in sound studio terms: contrary to the slr, a large format camera feels like recording. i set up the mics and the volumes, i give the band my directions and focus points, they get ready, and at the right moment i punch in the recording, and from that moment on, it is just them. photography feels the same now. i feel like i make a registration, a document. an slr feels like barging into the recording room, rather than quietly pressing record in the control room.\n\n*addendum after nine months:*\ni also started directing shots like i direct singers in the my sound studio. i came to the realization when [stephen dirado](http://www.stephendirado.com) told me to listen to what was there to hear, while he made a portrait of me. he is such a great help in all this, and we became good friends.\n* i do no not make them wait, and i will no longer wait on somebody to change anything in their expression after i just told them to freeze, while they are essentially waiting for me to go click. i give them something to do, something to think about, something to listen too and to look at. a focuspoint, other than their own looks. this is similar to me in the studio, go over a text with the singer, and imagine a setting, a purpose, and an audience for them to see in their minds eye when performing their song. if i wouldn't, every recording would sound like \"he's recording this, let's not make any mistakes again, aaah\".\n* though i ruined a few sheets, the workflow is not as bothersome as i expected it to be. but i must say i rehearsed the process in my mind a number of times before the camera arrived. \n\n*addendum after nine months:*\n*i expanded a bit on the routine. set focus, close lens, set shutter and aperture, fire a testshot, slide in film holder, check if lens is closed, cock shutter, open film holder, check subject, fire. all this time i keep communicating what i do, and i say \"hold still\" a lot. and i make jokes. people tell me i welcome and relax them. good. honestly, my mind is occupied with the tech side of the process too. you see, there are quite a few things i need to do between focussing and taking the picture. this is why my subject should hold still, not because the shutter times a that long. \n\n\n**depth of field**\n\n* shooting a larger format does not make the dof shallower directly. but a 150mm lens has a similar field of view as a 50mm on a 135 (35mm)camera, and that long focal length comes with a less deep dof. it looks like a f1.4. when you shoot close ups, backgrounds go way out of focus. when you shoot at a medium distance, say 4 meters, the background *still* goes out of focus. you need to be very precise with selecting what you want in focus, and therefor you will need tilt and swing.\n* i almost always shoot wide open, f5.6 on my lens, which means i have 1cm depth of field when i do a close up portrait. i use the full range of the shutter. from 1/400 to a full second. \n\n*addendum after nine months:*\n* when focusing close ups, the bellow gets to be extended a lot more. this spreads the light form the lens over a larger area. you will need to double the shutter time that the meter suggests to compensate for this.\n* for regular scenes, mylightmeter app is okay. for more contrasty scenes, the contrasty camera of the phone has a hard time guessing. a dedicated meter will be better.\n\n\n**the negatives**\n\n* i like it that you can develop per sheet, thus per frame, and adjust dev times as you go along.\n\n*addendum after nine months:*\ni standardized the development, making light on the film the only variable, and i develop per four. that's two film holders. i often shoot 4 or 8 frames now. i typically carry 5 film holders, so i can screw up 2 frames and still fill two tanks. i do not ruin films that often, though.\n* i'm not into this because i like developing, or scanning. i develop the same evening, i postpone scanning a lot.\n* i like that the negative is not microscopic. as soon as you pull it from the water, you can see how it is!\n\n*addendum after nine months:*\nthe size feels very normal to me now. not at all big anymore. that happened really fast.\nsome more notes on the quality camera\n\n*addendum after nine months:*\n* it is really really important that you can lock any variable on the camera very securely. it is annoying that the intrepid can be detuned so easily. this ruins shots. focus may slide off when i tilt the camera back and do not thoroughly lock it. rotation on the tripod cannot be locked well enough, causing the camera to be rotated sideways a bit when sliding in film into the rough plywood. swing is annoyingly easy to ruin when setting the shutter dials. in these respects, the wista is so much better.\nthe wista is twice as heavy as the intrepid. but with all the other stuff you need (tripod, dark cloth, filmholders, glasses, lens, shutter release, light meter, filter) it does not matter that much.\nit's just that i'd hate to be the one to make the first scratch on the 46 year old wista, while i decided that the intrepid is for hiking. i was worry free when it got sanded on a black beach of iceland and rained on on martha's vineyard. that's a feature the wista does not have.\n\n**but most importantly**\n\nphotographing this way brought me personal contacts in a way that music never did. to me, it was a journey full of surprises. going large format improved the quality of my portraits a lot. and the size of the negative was the least relevant in that upgrade. with a 4x5, i was able to make very honest and direct documents of the people that are dear to me. the tool is no longer sitting between me, my eyes, and them. it is just an extension of me, standing next to me.\n\n**some results**\n\n[click!](https://www.facebook.com/krosov/media_set?set=a.1740699366055952&amp;type=1&amp;l=bf98b90b0c)", "sortedWord": "None", "identifyer": 21381, "year": "2018"}, {"Unnamed: 0": 130677, "autor": "benjaminlongman", "date": 1544947334000, "content": "History of high-speed colour film/what would Burt Glinn have used? /!/ I’ve just been reading the excellent Burt Glinn collection ‘The Beats Scene’, which contains amongst other things some gorgeous colour shots of nightlife between ‘57-‘60. The book specifies that they were ‘colour negatives’ rather than slides (although I guess this could just be a general term), I was wondering if anyone knew what kind of higher speed colour films were available around that time? Was pushing colour film common back then too? It is hard to imagine that the locations and situations he captured were anything other than pretty dark, and most of them don’t look like there was a flash used.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a6nf6u/history_of_highspeed_colour_filmwhat_would_burt/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "history of high-speed colour film/what would burt glinn have used? /!/ i’ve just been reading the excellent burt glinn collection ‘the beats scene’, which contains amongst other things some gorgeous colour shots of nightlife between ‘57-‘60. the book specifies that they were ‘colour negatives’ rather than slides (although i guess this could just be a general term), i was wondering if anyone knew what kind of higher speed colour films were available around that time? was pushing colour film common back then too? it is hard to imagine that the -----> locations !!!  and situations he captured were anything other than pretty dark, and most of them don’t look like there was a flash used.", "sortedWord": "None", "identifyer": 21390, "year": "2018"}], "name": "locationAnalogCommunity2018"}