{"interestingcomments": [{"Unnamed: 0": 307293, "autor": "Peevish1", "date": 1583451143000, "content": "File size after scanning question. /!/ So I’m moving from my basic b&amp;w scanning, to color processing and scanning c-41 35mm. But I have what’s probably a really stupid question about my file management and scanning workflow. Here goes. \n\nWhat I’d like to do is use my plustek 8100 to scan the negative in, then use negative lab pro to process in Lightroom. I’m doing this using their recommended settings via vuescan. What that leaves me with is a raw dng file of the uncorrected negative at 397mb, and then a processed tiff file after nlp adjustments in Lightroom at 387mb. \n\nSo basically near enough 800mb per scanned image. So my question - is this just how it has to be? It seems like a ton of storage. And if I should be making changes to result in smaller files, what should I be changing/sacrificing to do this?\n\nThe settings I am mirroring are from here:\n\nhttps://forums.negativelabpro.com/t/creating-raw-dng-files-with-vuescan/23", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fe4ait/file_size_after_scanning_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "file size after scanning question. /!/ so i’m moving from my basic b&amp;w scanning, to color processing and scanning c-41 35mm. but i have what’s probably a really stupid question about my -----> file !!!  -----> management !!!  and scanning workflow. here goes. \n\nwhat i’d like to do is use my plustek 8100 to scan the negative in, then use negative lab pro to process in lightroom. i’m doing this using their recommended settings via vuescan. what that leaves me with is a raw dng file of the uncorrected negative at 397mb, and then a processed tiff file after nlp adjustments in lightroom at 387mb. \n\nso basically near enough 800mb per scanned image. so my question - is this just how it has to be? it seems like a ton of storage. and if i should be making changes to result in smaller files, what should i be changing/sacrificing to do this?\n\nthe settings i am mirroring are from here:\n\nhttps://forums.negativelabpro.com/t/creating-raw-dng-files-with-vuescan/23", "sortedWord": "None", "identifyer": 54254, "year": "2020"}], "name": "managementAnalogCommunity2020"}