{"interestingcomments": [{"Unnamed: 0": 89660, "autor": "sweedgreens", "date": 1551786830000, "content": "How do prices in smaller used camera shops in Japan compare to eBay sellers in Japan? /!/ I'm going to be in Tokyo and Osaka next month. I was wondering how do some shops like Fujiya in Nakano, Kitamura, Nitto Camera, and other smaller shop’s prices compare to eBay sellers specifically in Japan for used film SLR cameras and lenses? For example prices on a Nikon F3 in “excellent” condition can be found for around $300 USD from Japanese sellers on eBay. Could I find them for around those prices in-person? \n\nI know shops in Ginza, BIC, Yodobashi, and MAP Camera in Shinjuku are expensive so I’m talking about the other smaller reputable shops like Fujiya, Nitto, Kitamura, Chuuko, etc.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/axkbud/how_do_prices_in_smaller_used_camera_shops_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how do prices in smaller used camera shops in japan compare to ebay sellers in japan? /!/ i'm going to be in tokyo and osaka next month. i was wondering how do some shops like fujiya in nakano, kitamura, nitto camera, and other smaller shop’s prices compare to ebay sellers specifically in japan for used film slr cameras and lenses? for example prices on a nikon f3 in “excellent” condition can be found for around $300 usd from japanese sellers on ebay. could i find them for around those prices in-person? \n\ni know shops in ginza, bic, yodobashi, and -----> map !!!  camera in shinjuku are expensive so i’m talking about the other smaller reputable shops like fujiya, nitto, kitamura, chuuko, etc.", "sortedWord": "None", "identifyer": 92147, "year": "2019"}, {"Unnamed: 0": 92559, "autor": "Kneph", "date": 1557508902000, "content": "My film community friend created a map to tag our locations for meetups and local camera/film stores. Add your info and help it grow!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bn11jk/my_film_community_friend_created_a_map_to_tag_our/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "my film community friend created a -----> map !!!  to tag our locations for meetups and local camera/film stores. add your info and help it grow!", "sortedWord": "None", "identifyer": 95061, "year": "2019"}], "name": "mapAnalogCommunity2019"}