{"interestingcomments": [{"Unnamed: 0": 306158, "autor": "chere_amelia", "date": 1594849460000, "content": "Help me Keep Film Alive! /!/ *Have you ever thought about the future of analog photography?*\n\nWell, I do, a lot. And I’ve only shot film for almost 4 years. So, I did some research and came across the **#SaveAnalogCameras** journey of Juho from Camera Rescue. The project started in 2017 with a survey to map out the analog community and see the viability of film photography in the future! That survey went viral with over 7000 responses, special thanks to your help in spreading the word at [r/analog](https://www.reddit.com/r/analog) community.\n\nSo, I decided to make my school thesis on the topic and create a new survey with a focus on the members of our community in order to see how things have changed since 2017. I truly hope that the updated statistics we get on the current analog community and market would be convincing enough to influence the bigger industry players or encourage new innovative solutions to keep film alive in the long run.\n\nIn order to make that happen, I'm kindly asking you to give me a hand by participating in the survey and spreading the word to other film enthusiasts around the world.\n\nYou can read more about the project summary as well as the results of the 2017 survey via this [Link!](https://camerarescue.org/help2020/) Or go directly to the survey via [camerarescue.org/survey/](https://camerarescue.org/survey/).\n\nLooking forward to hearing from you guys!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hrwtiz/help_me_keep_film_alive/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "help me keep film alive! /!/ *have you ever thought about the future of analog photography?*\n\nwell, i do, a lot. and i’ve only shot film for almost 4 years. so, i did some research and came across the **#saveanalogcameras** journey of juho from camera rescue. the project started in 2017 with a survey to -----> map !!!  out the analog community and see the viability of film photography in the future! that survey went viral with over 7000 responses, special thanks to your help in spreading the word at [r/analog](https://www.reddit.com/r/analog) community.\n\nso, i decided to make my school thesis on the topic and create a new survey with a focus on the members of our community in order to see how things have changed since 2017. i truly hope that the updated statistics we get on the current analog community and market would be convincing enough to influence the bigger industry players or encourage new innovative solutions to keep film alive in the long run.\n\nin order to make that happen, i'm kindly asking you to give me a hand by participating in the survey and spreading the word to other film enthusiasts around the world.\n\nyou can read more about the project summary as well as the results of the 2017 survey via this [link!](https://camerarescue.org/help2020/) or go directly to the survey via [camerarescue.org/survey/](https://camerarescue.org/survey/).\n\nlooking forward to hearing from you guys!", "sortedWord": "None", "identifyer": 53102, "year": "2020"}, {"Unnamed: 0": 313619, "autor": "leaf500", "date": 1589751725000, "content": "Film Shots for Android, can adjust exposure from lock screen too | Also Map View and Contact sheet export", "link": "https://www.reddit.com/r/AnalogCommunity/comments/glo21m/film_shots_for_android_can_adjust_exposure_from/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "film shots for android, can adjust exposure from lock screen too | also -----> map !!!  view and contact sheet export", "sortedWord": "None", "identifyer": 60695, "year": "2020"}, {"Unnamed: 0": 314465, "autor": "drwebb", "date": 1579471968000, "content": "Following the zone system in post, how far to stretch contrast? /!/ I've read that in the zone system that very black colors and very white colors don't appear very often in nature. I've been wondering what the consensus on how far people tend to stretch contrast in post. Let's say there is a shadow that ends up being in zone II, and that's the darkest portion of your image. Would you adjust the curve so that the lowest luminosity pixel in your image is 0, or would you map it to a slightly higher value so it stays the same value it would be in a image a higher dynamic range. I realize this is per image, but does having pure blacks and pure whites tend to look better?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/er3996/following_the_zone_system_in_post_how_far_to/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "following the zone system in post, how far to stretch contrast? /!/ i've read that in the zone system that very black colors and very white colors don't appear very often in nature. i've been wondering what the consensus on how far people tend to stretch contrast in post. let's say there is a shadow that ends up being in zone ii, and that's the darkest portion of your image. would you adjust the curve so that the lowest luminosity pixel in your image is 0, or would you -----> map !!!  it to a slightly higher value so it stays the same value it would be in a image a higher dynamic range. i realize this is per image, but does having pure blacks and pure whites tend to look better?", "sortedWord": "None", "identifyer": 61549, "year": "2020"}, {"Unnamed: 0": 316413, "autor": "leaf500", "date": 1589454525000, "content": "Film Shots can now adjust exposure from Apple Watch and Lock screen | Also Map View and Export", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gjkan1/film_shots_can_now_adjust_exposure_from_apple/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "film shots can now adjust exposure from apple watch and lock screen | also -----> map !!!  view and export", "sortedWord": "None", "identifyer": 63528, "year": "2020"}], "name": "mapAnalogCommunity2020"}