{"interestingcomments": [{"Unnamed: 0": 254334, "autor": "Thetrillest426", "date": 1630895802000, "content": "Editing Question /!/ I like to put white borders around my pictures and have tried using the multi picture posting option on Instagram but I notice that one orientation will be fine while the other orientation will have their images get cut off. Does anyone know how to fix this in photoshop where I can post both orientations without having any images cut off? I don’t want to post everything in portrait or everything in landscape.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/piqmpl/editing_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "editing question /!/ i like to put white borders around my pictures and have tried using the multi picture posting option on instagram but i notice that one -----> orientation !!!  will be fine while the other -----> orientation !!!  will have their images get cut off. does anyone know how to fix this in photoshop where i can post both orientations without having any images cut off? i don’t want to post everything in portrait or everything in landscape.", "sortedWord": "None", "identifyer": 49715, "year": "2021"}, {"Unnamed: 0": 254970, "autor": "ginger2611", "date": 1630104760000, "content": "Light leak on rb67. /!/ Hi all, \n\nJust got my first roll back from the lab from my new to me rb67. \n\nA few images had some light leaks on them. One of them which was in portrait orientation had the leak at the bottom. \n\nI have checked the light seals and they seem OK and the store I brought it from stated it passed light trap tests. \n\nHowever while checking for any leaks, I pulled out the dark slide and I noticed in that moment that it was slightly bent. Would this cause the light leaks that occurred on my images? \n\nHave found another back on ebay with the seller saying new seals installed (have contacted to ask how recent and if dark slide is straight). But would it be beneficial to get the light seals replaced on this back or try and find another dark slide? \n\nThanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pcy1wl/light_leak_on_rb67/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "light leak on rb67. /!/ hi all, \n\njust got my first roll back from the lab from my new to me rb67. \n\na few images had some light leaks on them. one of them which was in portrait -----> orientation !!!  had the leak at the bottom. \n\ni have checked the light seals and they seem ok and the store i brought it from stated it passed light trap tests. \n\nhowever while checking for any leaks, i pulled out the dark slide and i noticed in that moment that it was slightly bent. would this cause the light leaks that occurred on my images? \n\nhave found another back on ebay with the seller saying new seals installed (have contacted to ask how recent and if dark slide is straight). but would it be beneficial to get the light seals replaced on this back or try and find another dark slide? \n\nthanks in advance.", "sortedWord": "None", "identifyer": 359, "year": "2021"}, {"Unnamed: 0": 257372, "autor": "emnna", "date": 1612470498000, "content": "Bummed about this RB67 light leak. Do you know what's happening? /!/ Hi there, the most recent roll shot through my Mamiya RB67 Pro S gave me some light leaks on the left side of landscape orientated photos. I've been trying to figure out the cause, but I think it could be one of many things. What do you think is going on?\n\nPhoto for reference:\n\nhttps://preview.redd.it/jx35wg3onif61.png?width=1557&amp;format=png&amp;auto=webp&amp;s=e7a4bb4f144bcd0590b06db06f7cd89d5bff15f6\n\nHere's what I think could be happening:\n\n1.) Light leaking through the hinge on the film back.\n\n2.) Issue winding film because the lever was loose/wobbly (I've since repaired by tightening the screw under the leather adhesive).\n\n3.) Light leaking through a random seal in the film back.\n\n4.) Light reflecting off of the dark slide (I don't remember when I did/didn't put the dark slide back in, but I don't think this is the reason because I rarely put it back in after consecutive shots).\n\nWhat is most strange is that the light leak didn't appear on the three photos of the roll shot on the portrait orientation. All but one of the photos shot on the landscape orientation have a similar leak on the left side of the frame.\n\nDo you know what's happening? What would you do? I'm considering buying a new back since it might be the same price as testing out each of those hypotheses.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lcp7tn/bummed_about_this_rb67_light_leak_do_you_know/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "bummed about this rb67 light leak. do you know what's happening? /!/ hi there, the most recent roll shot through my mamiya rb67 pro s gave me some light leaks on the left side of landscape orientated photos. i've been trying to figure out the cause, but i think it could be one of many things. what do you think is going on?\n\nphoto for reference:\n\nhttps://preview.redd.it/jx35wg3onif61.png?width=1557&amp;format=png&amp;auto=webp&amp;s=e7a4bb4f144bcd0590b06db06f7cd89d5bff15f6\n\nhere's what i think could be happening:\n\n1.) light leaking through the hinge on the film back.\n\n2.) issue winding film because the lever was loose/wobbly (i've since repaired by tightening the screw under the leather adhesive).\n\n3.) light leaking through a random seal in the film back.\n\n4.) light reflecting off of the dark slide (i don't remember when i did/didn't put the dark slide back in, but i don't think this is the reason because i rarely put it back in after consecutive shots).\n\nwhat is most strange is that the light leak didn't appear on the three photos of the roll shot on the portrait -----> orientation !!! . all but one of the photos shot on the landscape orientation have a similar leak on the left side of the frame.\n\ndo you know what's happening? what would you do? i'm considering buying a new back since it might be the same price as testing out each of those hypotheses.", "sortedWord": "None", "identifyer": 2808, "year": "2021"}, {"Unnamed: 0": 259571, "autor": "TCRK93", "date": 1622040683000, "content": "Olympus MJU ii Light Leaks - HELP /!/ Hey guys, would love some help.\n\nI've seen a few posts about this camera and very similar light leaks that happen, but no definite answer as to where they are from.  The camera can see two different light leaks, they both seem to happen very intermittently and I can't fully determine the source of lighting conditions that lead to it.  I've attached a few images below (scanned from digital camera with no editing to correct exposure etc.)\n\n&amp;#x200B;\n\n1. Seen in image with dogs:  bright white curl at the bottom.  This does not extend into the film mask.  Seems to occur more in bright conditions.  Have done the test with taking the batteries out of the camera and shining a light into the area around the lens - appears some light does leak here so ?this.  Never seems to occur in portrait orientation even in bright sunlight however.\n2. Seen in image of barrier.  Bright white leak along edge of frame.  Does extend into film mask, so suspect it to be from the back of the camera, however I think it seems to be near the door latch rather than the film window.  Unsure what is causing this, and seems to occur randomly in a lot of conditions: flash, indoor, outdoor, shade and bright light.\n\nAny help would be really appreciated!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2pw538hh7h171.jpg?width=4357&amp;format=pjpg&amp;auto=webp&amp;s=cc7ac995eb7047c72bf81360d6e25bbe04b2c08e\n\nhttps://preview.redd.it/v0qr42hh7h171.jpg?width=2935&amp;format=pjpg&amp;auto=webp&amp;s=54ed0d4376c9dc796a7bbe64b767330de8f563fb", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nlivv3/olympus_mju_ii_light_leaks_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "olympus mju ii light leaks - help /!/ hey guys, would love some help.\n\ni've seen a few posts about this camera and very similar light leaks that happen, but no definite answer as to where they are from.  the camera can see two different light leaks, they both seem to happen very intermittently and i can't fully determine the source of lighting conditions that lead to it.  i've attached a few images below (scanned from digital camera with no editing to correct exposure etc.)\n\n&amp;#x200b;\n\n1. seen in image with dogs:  bright white curl at the bottom.  this does not extend into the film mask.  seems to occur more in bright conditions.  have done the test with taking the batteries out of the camera and shining a light into the area around the lens - appears some light does leak here so ?this.  never seems to occur in portrait -----> orientation !!!  even in bright sunlight however.\n2. seen in image of barrier.  bright white leak along edge of frame.  does extend into film mask, so suspect it to be from the back of the camera, however i think it seems to be near the door latch rather than the film window.  unsure what is causing this, and seems to occur randomly in a lot of conditions: flash, indoor, outdoor, shade and bright light.\n\nany help would be really appreciated!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/2pw538hh7h171.jpg?width=4357&amp;format=pjpg&amp;auto=webp&amp;s=cc7ac995eb7047c72bf81360d6e25bbe04b2c08e\n\nhttps://preview.redd.it/v0qr42hh7h171.jpg?width=2935&amp;format=pjpg&amp;auto=webp&amp;s=54ed0d4376c9dc796a7bbe64b767330de8f563fb", "sortedWord": "None", "identifyer": 5041, "year": "2021"}, {"Unnamed: 0": 261359, "autor": "PeterAhlstrom", "date": 1634507592000, "content": "Epson V600 scans squished horizontally /!/ I got a new Epson V600 a couple months ago. Today I scanned a photo in normal orientation, and then rotated it 90° and scanned it again. The proportions don't line up when I overlay them in Photoshop.\n\nSo, I placed a ruler on the scanner glass and scanned it both ways, then used the measure tool in Photoshop. When the ruler is placed along the long edge of the scanner bed, Photoshop's measuring tool lines up exactly with the ticks on the ruler—5\" on the ruler image measures exactly 5\". But when the ruler is placed along the short edge of the scanner bed, the measuring tool shows that the ruler image is too short: 5\" measures as only 4.95\".\n\nHas anyone else noticed this on the V600? Is there a way to calibrate it?\n\nNote, I did this test in both Epson SmartScan and SilverFast Plus 9. The results were identical.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qa8m3e/epson_v600_scans_squished_horizontally/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "epson v600 scans squished horizontally /!/ i got a new epson v600 a couple months ago. today i scanned a photo in normal -----> orientation !!! , and then rotated it 90° and scanned it again. the proportions don't line up when i overlay them in photoshop.\n\nso, i placed a ruler on the scanner glass and scanned it both ways, then used the measure tool in photoshop. when the ruler is placed along the long edge of the scanner bed, photoshop's measuring tool lines up exactly with the ticks on the ruler—5\" on the ruler image measures exactly 5\". but when the ruler is placed along the short edge of the scanner bed, the measuring tool shows that the ruler image is too short: 5\" measures as only 4.95\".\n\nhas anyone else noticed this on the v600? is there a way to calibrate it?\n\nnote, i did this test in both epson smartscan and silverfast plus 9. the results were identical.", "sortedWord": "None", "identifyer": 6870, "year": "2021"}, {"Unnamed: 0": 263988, "autor": "AdrianTheDrummer", "date": 1624390130000, "content": "Mechanical Medium Format camera with sharp lenses? /!/ Hello everyone,\n\nI am looking to get into Medium format, and would like your recommendations for cameras under $600 that are fully manual and have a mechanical shutter. \n\nI like the idea of a medium format manual rangefinder but I think that limits me to the Mamiya 6 and 7s which I can’t afford.\n\nI was checking out the Bronica offerings but would prefer a landscape 6x4.5 orientation. \n\nAnyways, please let me know what you all would buy with a $600 budget. \n\nThank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o5v52t/mechanical_medium_format_camera_with_sharp_lenses/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mechanical medium format camera with sharp lenses? /!/ hello everyone,\n\ni am looking to get into medium format, and would like your recommendations for cameras under $600 that are fully manual and have a mechanical shutter. \n\ni like the idea of a medium format manual rangefinder but i think that limits me to the mamiya 6 and 7s which i can’t afford.\n\ni was checking out the bronica offerings but would prefer a landscape 6x4.5 -----> orientation !!! . \n\nanyways, please let me know what you all would buy with a $600 budget. \n\nthank you!", "sortedWord": "None", "identifyer": 9555, "year": "2021"}, {"Unnamed: 0": 264908, "autor": "_Defiant_Photo_", "date": 1621173176000, "content": "Fuji GX680 - The best camera you have (probably) never heard of /!/ Hello everyone, \n\nLong-time lurker, first time poster. I thought that I would do something different than a ‘here is my gear’ post – so here is my review of an AWESOME camera, you may not be aware of. This will be a long one, so I’ll do a TLDR version at the end!\n\n[My first outing with the GX680iii and a woefully flimsy tripod](https://preview.redd.it/ta926eodlhz61.jpg?width=750&amp;format=pjpg&amp;auto=webp&amp;s=ebbbfb6d5407980b4fe68e80f9eb20edd0210709)\n\nHow I got the camera. In the first lockdown I was bored, and a bit tipsy. I was looking at 4x5 cameras on eBay, as I want wanted to play with movements etc. I then stumbled across an auction with 45 minutes to go for a fuji 120 camera that had front movements. There was not much around on the web about it, but what I did find was pretty complimentary. I had a sneaky bid, and won! My rationale was mostly based on the fact that if I got a 4x5, I would need to spend £50 odd on a spool for my developing tank, and upgrade my scanner, as my current one will only scan up to 120 film. In addition… £6 a shot? Yeah…. Maybe not eh!?\n\n**The Camera:** \n\nFirstly let’s just talk image quality. The lenses are AMAZING! Super sharp, and the resolution you can achieve is as good as, if not better than Hasselblad &amp; Lecia. Yeah. I said it. With that out of the way, I want to focus on what makes the camera REALLY special. The first is the movements. You can move the lens up and down, as well as swing and tilt. This gives you a phenomenal amount of control for your image. I am new to using this, but for those who don’t know the advantages of it, it means that by tilting the focal plane of the image to match lets say a fence in an image, you can secure that whole section in focus, without having an enormous aperture. Conversely, when taking a portrait, you can ensure a super shallow DoF with a tilt, rendering the rest of the image with a lovely out of focus blur. Now yes, you CAN do this with a lower aperture, but the effect is different, as hopefully the images below demonstrate. Please note not all the images are mine – they are just to show what you can do. \n\n&amp;#x200B;\n\n[Note how the fence is sharp all through the image due to the swing](https://preview.redd.it/o5skaotjlhz61.jpg?width=1875&amp;format=pjpg&amp;auto=webp&amp;s=45179ebcd9b5d1b2a943a18ae6ddfeabc8df7854)\n\n&amp;#x200B;\n\n[See the top half of the models face &amp; hair is in focus, where the bottom half is out of focus due to tilt. ](https://preview.redd.it/1s2f7zcnlhz61.jpg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=b0a145dddc4e67694d5e3a9b49d454aa190060f7)\n\nThe second feature that I love about this camera is that it is version 3, which is what I have, is multi-format! What’s more, you don’t need to but a special back, you have a cool little plastic insert that CHANGES your 6x8 back, into a 6x7, 6x6 or 6x4.5. There are also focusing screens that you drop in, so that you can frame the image. Of course, the back rotates, so that you can easily change orientation from the default landscape, to portrait. \n\n&amp;#x200B;\n\n[Comes in a 6x7 option \\(above\\) as well as 6x6 and 6x4.5](https://preview.redd.it/wj3w099slhz61.jpg?width=2448&amp;format=pjpg&amp;auto=webp&amp;s=eea0ce6f55288fad03deb1396304e449feaff9bd)\n\nThe ‘not so great’ aspect of the camera. Its size. I call it ‘the beast’ for good reason. This thing is ENORMOUS and weighs a TON! You need a sturdy Manfrotto Tripod, and although you can, you really should not try and shoot this hand held. For comparison, see the camera compared to my 503, and even the back alone compared to a Mamiya 6! They are virtually the same size! I have taken the Fuji GX680iii out in the wild. But it is a camera you definitely have to deliberately ‘want’ to take out with you. That being said I am trying to take it out more when I have the chance. \n\n&amp;#x200B;\n\n[This gives you an idea of its size compared to the Hasselblad 503](https://preview.redd.it/7ez87rm3mhz61.jpg?width=3264&amp;format=pjpg&amp;auto=webp&amp;s=756c9d04972481ebcbd1d1cbf3460acd96493e11)\n\n&amp;#x200B;\n\n[The back, compared to my Mamiya 6!](https://preview.redd.it/rb1ne5d7mhz61.jpg?width=3222&amp;format=pjpg&amp;auto=webp&amp;s=57e41a6e1b6fcda02a4fbc809bfe8ee2b2476b73)\n\nI would say that the Fuji GX680iii is really like the love child of an RZ67 Proii and a Toyo 45a. Bellows focusing medium format camera, with the benefits of the movements and multi-format features of a 4x5, but at a THIRD of the cost of either. The lenses are very reasonable as well, around £100-£250\n\nIn regards to ‘who uses it’ it is really a studio beast. For name dropping I came up with Sails Chong, who is this crazy AF Chinese photographer, whose work you should defiantly check out. He is now a Hasselblad ambassador. Think Tyler shields, but more photoshop! \n\nSo, to summarise, it is an AMAZING camera which I think would serve as a really good bridge for someone considering 4x5, but not quite sure they will use the movements enough to invest in all the extra bits. For me a new spool, scanner and enlarger is just too much. Let alone the cost of shooting 4x5… at least not yet. I get most of the features, and in some ways more, with a still pretty big negative, for less cost.  There is an ‘S’ version, which doesn’t have the movements. I don’t see the point in that. And the earlier versions are not multi format in the same way. Version 3 really is the one to get. \n\nI hope that you have found my review interesting. \n\n&amp;#x200B;\n\n**TLDR**\n\n**Paragraph 1:** Hi, I’m new, and I thought I would do a review. \n\n**Paragraph 2:** I was tipsy during lockdown 1 and brought a medium format Fuji with movements. Seemed a better deal than 4x5 due to additional costs associated with 4x5 with similar results. \n\n**Paragraph 3:** Tilt, shift and swing controls on a medium format camera is amazing, gives you huge control, and gives you more creative options. \n\n**Paragraph 4:** Its MULTI-FORMAT! Special inserts (not new backs) mean you can turn your 6x8 into a 6x7, 6x6, or 645. It has focus screens, and you can rotate the back. \n\n**Paragraph 5:** Its bloody huge and weighs a ton – its tough to hand hold and you need to be fit as a soldier to carry it any kind of distance. \n\n**Paragraph 6:** I would say that the Fuji GX680iii is really like the love child of an RZ67 Proii and a Toyo 45a.\n\n**Paragraph 7:** Name drop – Sails Chong\n\n**Paragraph 8:** It is great – get version 3, but it weighs a ton. A nice bridge between 4x5 and medium format.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ndoss1/fuji_gx680_the_best_camera_you_have_probably/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "fuji gx680 - the best camera you have (probably) never heard of /!/ hello everyone, \n\nlong-time lurker, first time poster. i thought that i would do something different than a ‘here is my gear’ post – so here is my review of an awesome camera, you may not be aware of. this will be a long one, so i’ll do a tldr version at the end!\n\n[my first outing with the gx680iii and a woefully flimsy tripod](https://preview.redd.it/ta926eodlhz61.jpg?width=750&amp;format=pjpg&amp;auto=webp&amp;s=ebbbfb6d5407980b4fe68e80f9eb20edd0210709)\n\nhow i got the camera. in the first lockdown i was bored, and a bit tipsy. i was looking at 4x5 cameras on ebay, as i want wanted to play with movements etc. i then stumbled across an auction with 45 minutes to go for a fuji 120 camera that had front movements. there was not much around on the web about it, but what i did find was pretty complimentary. i had a sneaky bid, and won! my rationale was mostly based on the fact that if i got a 4x5, i would need to spend £50 odd on a spool for my developing tank, and upgrade my scanner, as my current one will only scan up to 120 film. in addition… £6 a shot? yeah…. maybe not eh!?\n\n**the camera:** \n\nfirstly let’s just talk image quality. the lenses are amazing! super sharp, and the resolution you can achieve is as good as, if not better than hasselblad &amp; lecia. yeah. i said it. with that out of the way, i want to focus on what makes the camera really special. the first is the movements. you can move the lens up and down, as well as swing and tilt. this gives you a phenomenal amount of control for your image. i am new to using this, but for those who don’t know the advantages of it, it means that by tilting the focal plane of the image to match lets say a fence in an image, you can secure that whole section in focus, without having an enormous aperture. conversely, when taking a portrait, you can ensure a super shallow dof with a tilt, rendering the rest of the image with a lovely out of focus blur. now yes, you can do this with a lower aperture, but the effect is different, as hopefully the images below demonstrate. please note not all the images are mine – they are just to show what you can do. \n\n&amp;#x200b;\n\n[note how the fence is sharp all through the image due to the swing](https://preview.redd.it/o5skaotjlhz61.jpg?width=1875&amp;format=pjpg&amp;auto=webp&amp;s=45179ebcd9b5d1b2a943a18ae6ddfeabc8df7854)\n\n&amp;#x200b;\n\n[see the top half of the models face &amp; hair is in focus, where the bottom half is out of focus due to tilt. ](https://preview.redd.it/1s2f7zcnlhz61.jpg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=b0a145dddc4e67694d5e3a9b49d454aa190060f7)\n\nthe second feature that i love about this camera is that it is version 3, which is what i have, is multi-format! what’s more, you don’t need to but a special back, you have a cool little plastic insert that changes your 6x8 back, into a 6x7, 6x6 or 6x4.5. there are also focusing screens that you drop in, so that you can frame the image. of course, the back rotates, so that you can easily change -----> orientation !!!  from the default landscape, to portrait. \n\n&amp;#x200b;\n\n[comes in a 6x7 option \\(above\\) as well as 6x6 and 6x4.5](https://preview.redd.it/wj3w099slhz61.jpg?width=2448&amp;format=pjpg&amp;auto=webp&amp;s=eea0ce6f55288fad03deb1396304e449feaff9bd)\n\nthe ‘not so great’ aspect of the camera. its size. i call it ‘the beast’ for good reason. this thing is enormous and weighs a ton! you need a sturdy manfrotto tripod, and although you can, you really should not try and shoot this hand held. for comparison, see the camera compared to my 503, and even the back alone compared to a mamiya 6! they are virtually the same size! i have taken the fuji gx680iii out in the wild. but it is a camera you definitely have to deliberately ‘want’ to take out with you. that being said i am trying to take it out more when i have the chance. \n\n&amp;#x200b;\n\n[this gives you an idea of its size compared to the hasselblad 503](https://preview.redd.it/7ez87rm3mhz61.jpg?width=3264&amp;format=pjpg&amp;auto=webp&amp;s=756c9d04972481ebcbd1d1cbf3460acd96493e11)\n\n&amp;#x200b;\n\n[the back, compared to my mamiya 6!](https://preview.redd.it/rb1ne5d7mhz61.jpg?width=3222&amp;format=pjpg&amp;auto=webp&amp;s=57e41a6e1b6fcda02a4fbc809bfe8ee2b2476b73)\n\ni would say that the fuji gx680iii is really like the love child of an rz67 proii and a toyo 45a. bellows focusing medium format camera, with the benefits of the movements and multi-format features of a 4x5, but at a third of the cost of either. the lenses are very reasonable as well, around £100-£250\n\nin regards to ‘who uses it’ it is really a studio beast. for name dropping i came up with sails chong, who is this crazy af chinese photographer, whose work you should defiantly check out. he is now a hasselblad ambassador. think tyler shields, but more photoshop! \n\nso, to summarise, it is an amazing camera which i think would serve as a really good bridge for someone considering 4x5, but not quite sure they will use the movements enough to invest in all the extra bits. for me a new spool, scanner and enlarger is just too much. let alone the cost of shooting 4x5… at least not yet. i get most of the features, and in some ways more, with a still pretty big negative, for less cost.  there is an ‘s’ version, which doesn’t have the movements. i don’t see the point in that. and the earlier versions are not multi format in the same way. version 3 really is the one to get. \n\ni hope that you have found my review interesting. \n\n&amp;#x200b;\n\n**tldr**\n\n**paragraph 1:** hi, i’m new, and i thought i would do a review. \n\n**paragraph 2:** i was tipsy during lockdown 1 and brought a medium format fuji with movements. seemed a better deal than 4x5 due to additional costs associated with 4x5 with similar results. \n\n**paragraph 3:** tilt, shift and swing controls on a medium format camera is amazing, gives you huge control, and gives you more creative options. \n\n**paragraph 4:** its multi-format! special inserts (not new backs) mean you can turn your 6x8 into a 6x7, 6x6, or 645. it has focus screens, and you can rotate the back. \n\n**paragraph 5:** its bloody huge and weighs a ton – its tough to hand hold and you need to be fit as a soldier to carry it any kind of distance. \n\n**paragraph 6:** i would say that the fuji gx680iii is really like the love child of an rz67 proii and a toyo 45a.\n\n**paragraph 7:** name drop – sails chong\n\n**paragraph 8:** it is great – get version 3, but it weighs a ton. a nice bridge between 4x5 and medium format.", "sortedWord": "None", "identifyer": 10491, "year": "2021"}, {"Unnamed: 0": 265177, "autor": "stanwoodmusic", "date": 1610694621000, "content": "Does anybody here have any experience with the Shen Hao TFC69-A? /!/  I'm looking at this camera thinking it might be my dream camera but I can't tell if it allows for portrait orientation of the film holder. If it doesn't then it's useless to me as I'm weirdly in love with portrait orientation (weird because of my proclivity for landscape photography). I can't find any reviews or any detailed description of the damn thing anywhere. Nick Carver of youtube fame semi-famously uses the same brand's 6x17 view camera to great effect, but I can't for the life of me find anything about this smaller roll film view camera. \n\nIf anyone out there has used one of these things I'd love to hear what you think about it:\n\n[http://www.shen-hao.com/PRODUCTSabout.aspx?i=933&amp;id=n3](http://www.shen-hao.com/PRODUCTSabout.aspx?i=933&amp;id=n3)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kxpeec/does_anybody_here_have_any_experience_with_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "does anybody here have any experience with the shen hao tfc69-a? /!/  i'm looking at this camera thinking it might be my dream camera but i can't tell if it allows for portrait -----> orientation !!!  of the film holder. if it doesn't then it's useless to me as i'm weirdly in love with portrait orientation (weird because of my proclivity for landscape photography). i can't find any reviews or any detailed description of the damn thing anywhere. nick carver of youtube fame semi-famously uses the same brand's 6x17 view camera to great effect, but i can't for the life of me find anything about this smaller roll film view camera. \n\nif anyone out there has used one of these things i'd love to hear what you think about it:\n\n[http://www.shen-hao.com/productsabout.aspx?i=933&amp;id=n3](http://www.shen-hao.com/productsabout.aspx?i=933&amp;id=n3)", "sortedWord": "None", "identifyer": 10764, "year": "2021"}, {"Unnamed: 0": 265179, "autor": "stanwoodmusic", "date": 1610691346000, "content": "Does anybody hear have any experience with the Shen Hao TFC69-A? /!/ I'm looking at this camera thinking it might be my dream camera but I can't tell if it allows for portrait orientation of the film holder. If it doesn't then it's useless to me as I'm weirdly in love with portrait orientation (weird because of my proclivity for landscape photography).\n\nIf anyone out there has used one of these things I'd love to hear what you think about it:\n\n[http://www.shen-hao.com/PRODUCTSabout.aspx?i=933&amp;id=n3](http://www.shen-hao.com/PRODUCTSabout.aspx?i=933&amp;id=n3)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kxomus/does_anybody_hear_have_any_experience_with_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "does anybody hear have any experience with the shen hao tfc69-a? /!/ i'm looking at this camera thinking it might be my dream camera but i can't tell if it allows for portrait -----> orientation !!!  of the film holder. if it doesn't then it's useless to me as i'm weirdly in love with portrait orientation (weird because of my proclivity for landscape photography).\n\nif anyone out there has used one of these things i'd love to hear what you think about it:\n\n[http://www.shen-hao.com/productsabout.aspx?i=933&amp;id=n3](http://www.shen-hao.com/productsabout.aspx?i=933&amp;id=n3)", "sortedWord": "None", "identifyer": 10766, "year": "2021"}], "name": "orientationAnalogCommunity2021"}