{"interestingcomments": [{"Unnamed: 0": 306645, "autor": "Shamwowdez", "date": 1605843948000, "content": "Mamiya RB67 ProS timing issue (maybe) /!/ Hello All, \n\nI just recently purchased a Mamiya RB67 ProS on the lovely eBay. I’m having what seems to be a timing issue. I’ve put 3 rolls of HP5 through it and all 3 are completely blank. (Blank as in, see through, and not even film stock text on the top or bottom).\nThe camera and lenses are in the correct orientation and all modes are in the correct settings. (Mirror lock-up is not selected, lens is in “M”, not “X”. I will add I have tried “X” &amp; “M”). \nWhen I don’t have a film back on, I can look through the back, test fire all the shutter speeds, 1-400, and see the speeds firing correctly. \nWhen I put a film back on, sounds like the mechanisms are firing in the same synchronization, but as soon as I develop, Blank film.  I will add, Sometimes the mirror goes up, but the leaf shutter doesn’t fire. Then I have to re arm the body 2-3 times for the shutter to finally fire. \nAgain it sounds like, mirror slaps up, leaf shutter fires, then I re cock the body to see through the ground glass again. But no images emerge. \n Please if anyone is familiar with what’s happening I would appreciate the knowledge. \nThank You", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jxhwkf/mamiya_rb67_pros_timing_issue_maybe/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mamiya rb67 pros timing issue (maybe) /!/ hello all, \n\ni just recently purchased a mamiya rb67 pros on the lovely ebay. i’m having what seems to be a timing issue. i’ve put 3 rolls of hp5 through it and all 3 are completely blank. (blank as in, see through, and not even film stock text on the top or bottom).\nthe camera and lenses are in the correct -----> orientation !!!  and all modes are in the correct settings. (mirror lock-up is not selected, lens is in “m”, not “x”. i will add i have tried “x” &amp; “m”). \nwhen i don’t have a film back on, i can look through the back, test fire all the shutter speeds, 1-400, and see the speeds firing correctly. \nwhen i put a film back on, sounds like the mechanisms are firing in the same synchronization, but as soon as i develop, blank film.  i will add, sometimes the mirror goes up, but the leaf shutter doesn’t fire. then i have to re arm the body 2-3 times for the shutter to finally fire. \nagain it sounds like, mirror slaps up, leaf shutter fires, then i re cock the body to see through the ground glass again. but no images emerge. \n please if anyone is familiar with what’s happening i would appreciate the knowledge. \nthank you", "sortedWord": "None", "identifyer": 53592, "year": "2020"}, {"Unnamed: 0": 307061, "autor": "killerant182", "date": 1593142273000, "content": "Holga question /!/ Dumb question I know, but if I use the 645 mask on my holga will the photos me in a landscape or portrait orientation?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hg07k7/holga_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "holga question /!/ dumb question i know, but if i use the 645 mask on my holga will the photos me in a landscape or portrait -----> orientation !!! ?", "sortedWord": "None", "identifyer": 54020, "year": "2020"}, {"Unnamed: 0": 309239, "autor": "Oscarposkar", "date": 1603965090000, "content": "Help me choose a 6x7 camera /!/ Hi guys,\n\nI'm looking to purchase a 6x7 camera, as I'm super happy with my 35mm setup and I'd like to branch into medium format. \n\nI want a medium format camera that I can take with me on hikes etc, so nothing too bulky, something that I could carry without too much hassle. \n\nI really like the Pentax 67, but the only thing that concerns me is the fact that it's reliant on electronics. Is this something that I should be worried about? I don't want to fork out quite a bit of money for something that could brick on me within the first week. \n\nAnother option could be the Mamiya RB67, which is fully mechanical, but I'm just not sure whether it would be too bulky for what I'm looking to shoot? \n\nThe Bronica GS-1 is also electronic which again concerns me, and I primarily shoot in portrait orientation, which I couldn't do without a prism. I've kinda ruled it out for those reasons. \n\nAny advice would be appreciated.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jk75p7/help_me_choose_a_6x7_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "help me choose a 6x7 camera /!/ hi guys,\n\ni'm looking to purchase a 6x7 camera, as i'm super happy with my 35mm setup and i'd like to branch into medium format. \n\ni want a medium format camera that i can take with me on hikes etc, so nothing too bulky, something that i could carry without too much hassle. \n\ni really like the pentax 67, but the only thing that concerns me is the fact that it's reliant on electronics. is this something that i should be worried about? i don't want to fork out quite a bit of money for something that could brick on me within the first week. \n\nanother option could be the mamiya rb67, which is fully mechanical, but i'm just not sure whether it would be too bulky for what i'm looking to shoot? \n\nthe bronica gs-1 is also electronic which again concerns me, and i primarily shoot in portrait -----> orientation !!! , which i couldn't do without a prism. i've kinda ruled it out for those reasons. \n\nany advice would be appreciated.", "sortedWord": "None", "identifyer": 56236, "year": "2020"}, {"Unnamed: 0": 309294, "autor": "ethanknievel", "date": 1603814810000, "content": "Winter camera options? /!/ I was curious if anyone had a suggestion for a rugged medium format camera to use during the midwest winter?  I have a Diana camera that I usually use, but recent development sessions are showing frame overlaps.  \n\nI don't care too much about frame orientation or camera style, as long as the shutter is reliable during the cold weather.  Also looking to gain more apertures and shutter speeds than the Diana. \n\nThanks in advance for any suggestions.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jj3zwi/winter_camera_options/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "winter camera options? /!/ i was curious if anyone had a suggestion for a rugged medium format camera to use during the midwest winter?  i have a diana camera that i usually use, but recent development sessions are showing frame overlaps.  \n\ni don't care too much about frame -----> orientation !!!  or camera style, as long as the shutter is reliable during the cold weather.  also looking to gain more apertures and shutter speeds than the diana. \n\nthanks in advance for any suggestions.", "sortedWord": "None", "identifyer": 56291, "year": "2020"}, {"Unnamed: 0": 310112, "autor": "jaywonger93", "date": 1595431485000, "content": "Tips on taking Diptychs/Triptychs? /!/ 📷**Help Wanted**\n\nReceived my first half-frame camera today, the Yashica Samurai x3.0. My wallet will be able to appreciate the 72 exposures per roll I will get even though I sacrifice some of the quality. My questions for all you half-frame shooters: \n\n**What is your strategy for taking diptychs? Do you shoot the two half frames back-to-back so that you remember the composition/subject you used in the first half? And do you prefer to shoot you diptychs/triptychs in portrait or landscape orientation?**", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hvvq05/tips_on_taking_diptychstriptychs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "tips on taking diptychs/triptychs? /!/ 📷**help wanted**\n\nreceived my first half-frame camera today, the yashica samurai x3.0. my wallet will be able to appreciate the 72 exposures per roll i will get even though i sacrifice some of the quality. my questions for all you half-frame shooters: \n\n**what is your strategy for taking diptychs? do you shoot the two half frames back-to-back so that you remember the composition/subject you used in the first half? and do you prefer to shoot you diptychs/triptychs in portrait or landscape -----> orientation !!! ?**", "sortedWord": "None", "identifyer": 57120, "year": "2020"}, {"Unnamed: 0": 311825, "autor": "Matt_WS", "date": 1607281548000, "content": "Lightweight but lower end cost wise tripod recommendations? /!/ I’ve seen Sirui recommended quite a bit, especially their 1004 model. I’m mainly looking for something that packs down small for long exposure photography and something that’s easy to move from landscape to portrait orientation for photos. \n\nAny thoughts of help would be much appreciated!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k7zsiw/lightweight_but_lower_end_cost_wise_tripod/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "lightweight but lower end cost wise tripod recommendations? /!/ i’ve seen sirui recommended quite a bit, especially their 1004 model. i’m mainly looking for something that packs down small for long exposure photography and something that’s easy to move from landscape to portrait -----> orientation !!!  for photos. \n\nany thoughts of help would be much appreciated!!", "sortedWord": "None", "identifyer": 58870, "year": "2020"}, {"Unnamed: 0": 311961, "autor": "thillyraccoon", "date": 1594495331000, "content": "Hello, I want to compile photos from my first few rolls of film into a photobook of sorts, I would like advice. /!/ I want to make something that's laid out like a simple calendar— \n\n* plain white, square pages\n* one photo per page\n* margin/border about 2 inches thick\n* bound with thick, wide metal rings, and intended to be hung up on a wall\n\nNow the thing is, my photos will be in both portrait and landscape orientations, but also with varying aspect ratios.   \n\n\nSo my questions are,   \n\n\n1. How can I compile these photos into a photobook while keeping the 2-inch margin consistent, at least for the longest/widest side of the photo (again, dependent on it's orientation)? Between Lightroom, Photoshop, and In-design, which can best/most efficiently achieve \\^this\\^? \n2. Could you please give me instructions or link resources/guides to do achieve this on the program you recommended?\n3. Regarding paper, which do you prefer between matte and glossy, and why?\n\n&amp;#x200B;\n\nI would really appreciate any help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hpfxok/hello_i_want_to_compile_photos_from_my_first_few/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientations", "selectorShort": "orientation", "MarkedSent": "hello, i want to compile photos from my first few rolls of film into a photobook of sorts, i would like advice. /!/ i want to make something that's laid out like a simple calendar— \n\n* plain white, square pages\n* one photo per page\n* margin/border about 2 inches thick\n* bound with thick, wide metal rings, and intended to be hung up on a wall\n\nnow the thing is, my photos will be in both portrait and landscape -----> orientations !!! , but also with varying aspect ratios.   \n\n\nso my questions are,   \n\n\n1. how can i compile these photos into a photobook while keeping the 2-inch margin consistent, at least for the longest/widest side of the photo (again, dependent on it's orientation)? between lightroom, photoshop, and in-design, which can best/most efficiently achieve \\^this\\^? \n2. could you please give me instructions or link resources/guides to do achieve this on the program you recommended?\n3. regarding paper, which do you prefer between matte and glossy, and why?\n\n&amp;#x200b;\n\ni would really appreciate any help.", "sortedWord": "None", "identifyer": 59009, "year": "2020"}, {"Unnamed: 0": 312070, "autor": "MrRom92", "date": 1593762704000, "content": "Problem with FILCA / IXMOO and bulk loader - any ideas anybody? /!/ \nHey everyone, hoping someone here may know if I’m doing something wrong or anything like that, as I’ve been wracking my brain over how to properly use this. Really appreciate any pointers! \n\n \n\nThanks to a super kind member on the sub here I was just able to get a hold of a “Western” brand film loader. Seems to be modeled after a Watson. It has the key to open/close the film gate on a FILCA or IXMOO canister, and it works sooooo, that’s good!\n\n\n\nThe problem is actually using it with a FILCA - due to the metal “hump” on the canister, it only fits neatly into the loader in one particular orientation. And in this orientation, the film gate of the FILCA is facing away from the film gate of the loader, so if I were to wind the film into the cartridge with it positioned like this, the film would end up scraping against the cartridge rather than passing directly through the film gate… that can’t be right!\n\n \n\nIf I try to insert the FILCA in any other orientation, it doesn’t seat in the compartment neatly, the winder can’t actually turn the inner spool and the door on the loader won’t close either.\n\n\nI know this is difficult to explain in writing, [so here’s a photo, hopefully this is somewhat more helpful in illustrating the issue.](https://i.imgur.com/4MzH0yv.jpg) Any ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hkf0su/problem_with_filca_ixmoo_and_bulk_loader_any/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "problem with filca / ixmoo and bulk loader - any ideas anybody? /!/ \nhey everyone, hoping someone here may know if i’m doing something wrong or anything like that, as i’ve been wracking my brain over how to properly use this. really appreciate any pointers! \n\n \n\nthanks to a super kind member on the sub here i was just able to get a hold of a “western” brand film loader. seems to be modeled after a watson. it has the key to open/close the film gate on a filca or ixmoo canister, and it works sooooo, that’s good!\n\n\n\nthe problem is actually using it with a filca - due to the metal “hump” on the canister, it only fits neatly into the loader in one particular -----> orientation !!! . and in this orientation, the film gate of the filca is facing away from the film gate of the loader, so if i were to wind the film into the cartridge with it positioned like this, the film would end up scraping against the cartridge rather than passing directly through the film gate… that can’t be right!\n\n \n\nif i try to insert the filca in any other orientation, it doesn’t seat in the compartment neatly, the winder can’t actually turn the inner spool and the door on the loader won’t close either.\n\n\ni know this is difficult to explain in writing, [so here’s a photo, hopefully this is somewhat more helpful in illustrating the issue.](https://i.imgur.com/4mzh0yv.jpg) any ideas?", "sortedWord": "None", "identifyer": 59121, "year": "2020"}, {"Unnamed: 0": 313677, "autor": "AllswellinEndwell", "date": 1598454152000, "content": "E-6 Processing Question /!/ So I started back into film and developing film.  I'm lucky to have a community dark room membership.  So I did my dark room orientation and when we went to develop the Ectachrome I'd shot I was told they don't have the chemistry for it (We actually developed it because my tutor didn't realize I had told her it was ecktachrome, it looks wierd to say the least.)\n\nShe told me that they don't keep it around because it expires so quick and they don't have much commercial demand for it (they develop film for outside customers).\n\nSo my question is how fast does it expire?  I've found kits online so I can get the chemicals easy, but if it expires after a few days, then I'll pass, but if its a few months I can probably use it up before it dies.\n\nAnyone developing E-6?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ih0fhv/e6_processing_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "e-6 processing question /!/ so i started back into film and developing film.  i'm lucky to have a community dark room membership.  so i did my dark room -----> orientation !!!  and when we went to develop the ectachrome i'd shot i was told they don't have the chemistry for it (we actually developed it because my tutor didn't realize i had told her it was ecktachrome, it looks wierd to say the least.)\n\nshe told me that they don't keep it around because it expires so quick and they don't have much commercial demand for it (they develop film for outside customers).\n\nso my question is how fast does it expire?  i've found kits online so i can get the chemicals easy, but if it expires after a few days, then i'll pass, but if its a few months i can probably use it up before it dies.\n\nanyone developing e-6?", "sortedWord": "None", "identifyer": 60754, "year": "2020"}, {"Unnamed: 0": 315603, "autor": "CoolRidge2629", "date": 1601967237000, "content": "Question for Mamiya 645 super users /!/ Hello there, just wondering for those with the 645 Super, is it possible to rotate the film back to shoot in a portrait orientation? So similar to how you are able to with the RB/RZ 67. I havent been able to see much about it being possible online, so I figured I'd ask here. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j60gl4/question_for_mamiya_645_super_users/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "question for mamiya 645 super users /!/ hello there, just wondering for those with the 645 super, is it possible to rotate the film back to shoot in a portrait -----> orientation !!! ? so similar to how you are able to with the rb/rz 67. i havent been able to see much about it being possible online, so i figured i'd ask here. thanks!", "sortedWord": "None", "identifyer": 62704, "year": "2020"}, {"Unnamed: 0": 315914, "autor": "GoExistential", "date": 1586384750000, "content": "Can you shoot panoramic 35mm on a Mamiya 645? /!/ As soon as this pandemic winds down I was planning on purchasing my first medium format kit: a Mamiya 645 w/ the 80mm 2.8 and a 45mm 2.8. I'm excited to shoot larger negatives but my dream camera has always been the hasselblad X-Pan. I don't think I'd be able to afford or justify that camera anytime soon, especially knowing that some peoples cameras just stop working out of the blue... but I'm dying to try the  24mm x 65mm format or atleast something close to that width and perspective with my color negative 35mm film stocks. Very interested in shooting and processing my own Vision 3.\n\n&amp;#x200B;\n\n**So I was wondering would one of those 35mm to 120 adapters and the 45mm lens give me \"panoramic\" photos like the X-pan?** I'm having trouble piecing together which orientation in which the film gets fed through the camera\n\n&amp;#x200B;\n\nEdit: Think I found the answer after looking at image samples. What I was hoping for was 24x56mm negatives but the way film is ran through a 645 camera I'd only be able to achieve 24x42mm whihc isnt much longer than the standard 35mm film. Wow I think this is really making me reconsider trying to purchase a 645 camera", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fxgbd6/can_you_shoot_panoramic_35mm_on_a_mamiya_645/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "can you shoot panoramic 35mm on a mamiya 645? /!/ as soon as this pandemic winds down i was planning on purchasing my first medium format kit: a mamiya 645 w/ the 80mm 2.8 and a 45mm 2.8. i'm excited to shoot larger negatives but my dream camera has always been the hasselblad x-pan. i don't think i'd be able to afford or justify that camera anytime soon, especially knowing that some peoples cameras just stop working out of the blue... but i'm dying to try the  24mm x 65mm format or atleast something close to that width and perspective with my color negative 35mm film stocks. very interested in shooting and processing my own vision 3.\n\n&amp;#x200b;\n\n**so i was wondering would one of those 35mm to 120 adapters and the 45mm lens give me \"panoramic\" photos like the x-pan?** i'm having trouble piecing together which -----> orientation !!!  in which the film gets fed through the camera\n\n&amp;#x200b;\n\nedit: think i found the answer after looking at image samples. what i was hoping for was 24x56mm negatives but the way film is ran through a 645 camera i'd only be able to achieve 24x42mm whihc isnt much longer than the standard 35mm film. wow i think this is really making me reconsider trying to purchase a 645 camera", "sortedWord": "None", "identifyer": 63023, "year": "2020"}, {"Unnamed: 0": 316988, "autor": "roslym", "date": 1588908660000, "content": "RB67 proS not allowing film to advance /!/ Unless I’m as pathetic at googling as I am a photographer, I couldn’t find an answer to this. \n\nWhen shooting a frame in horizontal orientation the film back does not register that the film has been exposed (red thing doesn’t appear) and film won’t advance. It doesn’t matter if multi-exposure is on or not. Shots only registers when I turn the film back to vertical orientation. So basically in order to shoot horizontally I need to- expose film, insert dark slide, turn back vertically, fire with dark slide in, then advance to next frame.\n\nIs this a problem is the film back? Or rotating back itself? I indeed can fire with the dark slide inserted if that helps diagnose the problem. \n\nThanks !", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gflkay/rb67_pros_not_allowing_film_to_advance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "rb67 pros not allowing film to advance /!/ unless i’m as pathetic at googling as i am a photographer, i couldn’t find an answer to this. \n\nwhen shooting a frame in horizontal -----> orientation !!!  the film back does not register that the film has been exposed (red thing doesn’t appear) and film won’t advance. it doesn’t matter if multi-exposure is on or not. shots only registers when i turn the film back to vertical orientation. so basically in order to shoot horizontally i need to- expose film, insert dark slide, turn back vertically, fire with dark slide in, then advance to next frame.\n\nis this a problem is the film back? or rotating back itself? i indeed can fire with the dark slide inserted if that helps diagnose the problem. \n\nthanks !", "sortedWord": "None", "identifyer": 64114, "year": "2020"}], "name": "orientationAnalogCommunity2020"}