{"interestingcomments": [{"Unnamed: 0": 252627, "autor": "DevilsAudvocate", "date": 1615901342000, "content": "I need film from the 80s developed /!/ I've meandered around the internet and a lot of photography subreddits but I haven't found guidance so I'm hoping this community could point me in the right direction.\n\nI've got film that my mom had in storage that needs to be developed asap. I'm trying to find the best place to mail it for that since it may need special care. I had read something about processing C-41 as B&amp;W and then colorizing... But I don't know if that would apply to these or how to find a company that I can trust to do that. Or really a company that will know what they're working with and what would be best for my film and not just someone who'll run it through and shrug it off if all is lost.\n\n[my Instagram post when they were found](https://www.instagram.com/p/CLiolihB45c/?igshid=1bi38j4406pt) I contacted the darkroom through Instagram and they seemed helpful but reviews in general seem to include miracles and horror stories and I'm just scared mine would be a horror story just because they have a lot of customers and my film needs may fall through the cracks unintentionally. \n\nThese rolls were all likely shot around the same time frame, winter of 1987/88. I was three. \n\nI'm hoping to find a place that will choose the right process and be able to scan them and return the processed film relatively quickly. My mom's birthday at is April 18 and that's when I'm having a memorial for her where I'd like to include pictures. And we're losing our home and don't know where we're going so I'm hoping for a quick return of the physical order. \n\nWhat I've got is Kodacolor 110 and 220, Kodak Gold 110 and 35mm and a lone Polaroid 110. Please see the link for my Insta post if you need more detailed info.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m692g4/i_need_film_from_the_80s_developed/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "i need film from the 80s developed /!/ i've meandered around the internet and a lot of photography subreddits but i haven't found guidance so i'm hoping this community could point me in the right direction.\n\ni've got film that my mom had in storage that needs to be developed asap. i'm trying to find the best place to mail it for that since it may need special care. i had read something about processing c-41 as b&amp;w and then colorizing... but i don't know if that would apply to these or how to find a company that i can trust to do that. or really a company that will know what they're working with and what would be best for my film and not just someone who'll run it through and shrug it off if all is lost.\n\n[my instagram post when they were found](https://www.instagram.com/p/cliolihb45c/?igshid=1bi38j4406pt) i contacted the darkroom through instagram and they seemed helpful but reviews in general seem to include miracles and horror stories and i'm just scared mine would be a horror story just because they have a lot of customers and my film needs may fall through the cracks unintentionally. \n\nthese rolls were all likely shot around the same time frame, winter of 1987/88. i was three. \n\ni'm hoping to -----> find !!!  -----> a !!!  -----> place !!!  that will choose the right process and be able to scan them and return the processed film relatively quickly. my mom's birthday at is april 18 and that's when i'm having a memorial for her where i'd like to include pictures. and we're losing our home and don't know where we're going so i'm hoping for a quick return of the physical order. \n\nwhat i've got is kodacolor 110 and 220, kodak gold 110 and 35mm and a lone polaroid 110. please see the link for my insta post if you need more detailed info.", "sortedWord": "None", "identifyer": 47996, "year": "2021"}, {"Unnamed: 0": 252893, "autor": "mollysebert", "date": 1614381959000, "content": "Info about the Argus A-5? /!/ I bought an Argus A-5 at an estate sale today and cannot find anything about it on google. It’s shutter seems to work. I’ve never had a rangefinder before so I’m not really sure where to start to know what’s functioning and what’s not.  \n\nA question that feels silly, but I need to ask... does it potentially not need batteries? I cannot find a place to put any.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ltar5d/info_about_the_argus_a5/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "info about the argus a-5? /!/ i bought an argus a-5 at an estate sale today and cannot find anything about it on google. it’s shutter seems to work. i’ve never had a rangefinder before so i’m not really sure where to start to know what’s functioning and what’s not.  \n\na question that feels silly, but i need to ask... does it potentially not need batteries? i cannot -----> find !!!  -----> a !!!  -----> place !!!  to put any.", "sortedWord": "None", "identifyer": 48265, "year": "2021"}, {"Unnamed: 0": 253122, "autor": "RRH", "date": 1616954559000, "content": "Where to buy film in Amarillo, Texas? /!/ Ill be traveling next week and can’t seem to find a place that has fun in ire online. Anyone care to help? Also if by any chance anyone knows where or how to get developer also appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mf66bp/where_to_buy_film_in_amarillo_texas/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "where to buy film in amarillo, texas? /!/ ill be traveling next week and can’t seem to -----> find !!!  -----> a !!!  -----> place !!!  that has fun in ire online. anyone care to help? also if by any chance anyone knows where or how to get developer also appreciated!", "sortedWord": "None", "identifyer": 48495, "year": "2021"}, {"Unnamed: 0": 253924, "autor": "brsheff", "date": 1624981116000, "content": "ISO Film Photography Equipment Rentals That Include Shipping? /!/ As the title states, I'm in search of someone or a company that offers film photography equipment rentals that include shipment of the equipment in the US. \n\nI want to rent a Mamiya 7 but it's very difficult to find someone that will rent AND ship. I did find a place called Samy's (located in California) that offers rental and shipment, but only to customers that have prior rental history with them. \n\nI wish Borrow Lenses offered it because I've been pleased with their services in the past.  \n\nAny suggestions or ideas are appreciated. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oaas6i/iso_film_photography_equipment_rentals_that/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "iso film photography equipment rentals that include shipping? /!/ as the title states, i'm in search of someone or a company that offers film photography equipment rentals that include shipment of the equipment in the us. \n\ni want to rent a mamiya 7 but it's very difficult to find someone that will rent and ship. i did -----> find !!!  -----> a !!!  -----> place !!!  called samy's (located in california) that offers rental and shipment, but only to customers that have prior rental history with them. \n\ni wish borrow lenses offered it because i've been pleased with their services in the past.  \n\nany suggestions or ideas are appreciated. thanks!", "sortedWord": "None", "identifyer": 49303, "year": "2021"}, {"Unnamed: 0": 254002, "autor": "lazyassedfiend", "date": 1614938310000, "content": "How was your first film? /!/ I got my Canon AE-1 in October and have shot 2 rolls of film since then. Finally found some place to develop it for a decent price and I get them sent to my email tomorrow. I’m scared it’s gonna be so shit but hopefully i get 1 decent picture to post. Pretty sure I made lots of mistakes with the shutter speed and aperture too. I shot on kodak colourplus 200 btw.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ly8nse/how_was_your_first_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "found some place", "selectorShort": "place", "MarkedSent": "how was your first film? /!/ i got my canon ae-1 in october and have shot 2 rolls of film since then. finally -----> found !!!  -----> some !!!  -----> place !!!  to develop it for a decent price and i get them sent to my email tomorrow. i’m scared it’s gonna be so shit but hopefully i get 1 decent picture to post. pretty sure i made lots of mistakes with the shutter speed and aperture too. i shot on kodak colourplus 200 btw.", "sortedWord": "None", "identifyer": 49381, "year": "2021"}, {"Unnamed: 0": 255856, "autor": "basedjason", "date": 1620960530000, "content": "Best Labs in LA? /!/ Title says it all, where does the LA film community get their rolls developed + scanned? Trying to find a place with that goldilocks zone of quality work without completely egregious pricing. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nbyl89/best_labs_in_la/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "best labs in la? /!/ title says it all, where does the la film community get their rolls developed + scanned? trying to -----> find !!!  -----> a !!!  -----> place !!!  with that goldilocks zone of quality work without completely egregious pricing. thanks!", "sortedWord": "None", "identifyer": 1263, "year": "2021"}, {"Unnamed: 0": 258050, "autor": "byanymeans123", "date": 1632407943000, "content": "Found a place that develops + scans for $5 in NYC. How much quality am I compromising?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ptwo6q/found_a_place_that_develops_scans_for_5_in_nyc/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "-----> found !!!  -----> a !!!  -----> place !!!  that develops + scans for $5 in nyc. how much quality am i compromising?", "sortedWord": "None", "identifyer": 3495, "year": "2021"}, {"Unnamed: 0": 260622, "autor": "Centribo", "date": 1624598863000, "content": "Repair shops in Toronto, Canada? /!/ Hi everyone,\n\nI recently picked up a Konica Auto S2 which has stuck aperture blades and a fallen off rangefinder mirror, and a Canonet QL19 with a stuck shutter. I was wondering if anyone knows of any reputable and/or trusted repair shops in Toronto or in the GTA that can repair these issues. I'm hoping to find a place that doesn't cost an arm and a leg to repair the Konica especially, since I only paid $25 for it. If anyone has any suggestions and experience with any shops in town, please let me know, thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o7h8db/repair_shops_in_toronto_canada/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "repair shops in toronto, canada? /!/ hi everyone,\n\ni recently picked up a konica auto s2 which has stuck aperture blades and a fallen off rangefinder mirror, and a canonet ql19 with a stuck shutter. i was wondering if anyone knows of any reputable and/or trusted repair shops in toronto or in the gta that can repair these issues. i'm hoping to -----> find !!!  -----> a !!!  -----> place !!!  that doesn't cost an arm and -----> a !!!  leg to repair the konica especially, since i only paid $25 for it. if anyone has any suggestions and experience with any shops in town, please let me know, thanks!", "sortedWord": "None", "identifyer": 6121, "year": "2021"}, {"Unnamed: 0": 261628, "autor": "LawfulnessNorth6631", "date": 1628400418000, "content": "Shooting Slide Film In 2021 /!/ I have tried shooting velvia, provia, and ektachrome. I have pushed, I have pulled, I have used tetenal kits and the cinestill kit, even used bw developer instead of the reccomended first developer. I have shot in all types of weather and lighting conditions but I still havent found a place for slide film where it excels. Maybe they are best in dull lighting but then their low speed becomes an issue with shutter times. Can someone please convince me of the best use for slide film where it is better than negative film", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p08vg1/shooting_slide_film_in_2021/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "shooting slide film in 2021 /!/ i have tried shooting velvia, provia, and ektachrome. i have pushed, i have pulled, i have used tetenal kits and the cinestill kit, even used bw developer instead of the reccomended first developer. i have shot in all types of weather and lighting conditions but i still havent -----> found !!!  -----> a !!!  -----> place !!!  for slide film where it excels. maybe they are best in dull lighting but then their low speed becomes an issue with shutter times. can someone please convince me of the best use for slide film where it is better than negative film", "sortedWord": "None", "identifyer": 7142, "year": "2021"}], "name": "placeAnalogCommunity2021"}