{"interestingcomments": [{"Unnamed: 0": 305326, "autor": "WuTangSometimes", "date": 1593537919000, "content": "Film stocks online /!/ New to photography, and having trouble finding a place to buy reasonably priced film. COVID closed down my main guy's store. That limits my options to shooting exclusively with Superia from CVS. Wondering if there's a place online I can get film? I've tried B&amp;H but shipping is almost as much as the stocks themselves. No other local places in my area sell film. I'm in CA, idk if that helps. Thank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hirstg/film_stocks_online/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "finding a place", "selectorShort": "place", "MarkedSent": "film stocks online /!/ new to photography, and having trouble -----> finding !!!  -----> a !!!  -----> place !!!  to buy reasonably priced film. covid closed down my main guy's store. that limits my options to shooting exclusively with superia from cvs. wondering if there's a place online i can get film? i've tried b&amp;h but shipping is almost as much as the stocks themselves. no other local places in my area sell film. i'm in ca, idk if that helps. thank you", "sortedWord": "None", "identifyer": 52253, "year": "2020"}, {"Unnamed: 0": 306222, "autor": "karikmm", "date": 1587152072000, "content": "Subminiature Cassettes? /!/ I recently have gotten super into the tiny little subminiature cameras specifically the Mamiya 16 automatic. I bought it a couple of weeks ago and I’ve been trying to find some place to find at least one of the cassettes to be able to reload my film and shoot some rolls. I hope someone may know at least a little bit if not I guess I just need some good luck!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g38u20/subminiature_cassettes/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find some place", "selectorShort": "place", "MarkedSent": "subminiature cassettes? /!/ i recently have gotten super into the tiny little subminiature cameras specifically the mamiya 16 automatic. i bought it a couple of weeks ago and i’ve been trying to -----> find !!!  -----> some !!!  -----> place !!!  to -----> find !!!  at least one of the cassettes to be able to reload my film and shoot -----> some !!!  rolls. i hope someone may know at least a little bit if not i guess i just need some good luck!", "sortedWord": "None", "identifyer": 53167, "year": "2020"}, {"Unnamed: 0": 306367, "autor": "dkonigs", "date": 1590189321000, "content": "Finally found a place to setup my strobes. Test subject is likely to be a lot more cooperative than real subjects.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gou32z/finally_found_a_place_to_setup_my_strobes_test/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "finally -----> found !!!  -----> a !!!  -----> place !!!  to setup my strobes. test subject is likely to be a lot more cooperative than real subjects.", "sortedWord": "None", "identifyer": 53313, "year": "2020"}, {"Unnamed: 0": 307017, "autor": "KelseySmithPhotos", "date": 1593277777000, "content": "Nikkormat EL repair /!/ Hello everyone! My girlfriend’s father is looking to get his father’s Nikkormat EL repaired but is having trouble finding a place to get it done. He shipped it to a repair place in Abilene Texas for repair but after a few months it was returned and he was told that they can’t repair the EL model. Does anyone have any recommendations?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hgx9yw/nikkormat_el_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "finding a place", "selectorShort": "place", "MarkedSent": "nikkormat el repair /!/ hello everyone! my girlfriend’s father is looking to get his father’s nikkormat el repaired but is having trouble -----> finding !!!  -----> a !!!  -----> place !!!  to get it done. he shipped it to a repair place in abilene texas for repair but after a few months it was returned and he was told that they can’t repair the el model. does anyone have any recommendations?", "sortedWord": "None", "identifyer": 53975, "year": "2020"}, {"Unnamed: 0": 307514, "autor": "zazu_from_tarzan", "date": 1598070020000, "content": "I’m trying to get into film photography but I don’t even know where to buy film (or a good camera but we’ll come to that later) /!/ All the places that have film near me only have disposable cameras or the instant film for polaroids. I really just want to find a place that sells 35mm. Is my best bet just going on amazon and buying film? \n\nFor cameras I want to try to get either a 35mm or medium format camera, but a lot of the time all the posts I find on Craigslist are too far from me. Are there any places or sites I should be checking out? Thanks for any help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iec2jb/im_trying_to_get_into_film_photography_but_i_dont/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "i’m trying to get into film photography but i don’t even know where to buy film (or a good camera but we’ll come to that later) /!/ all the places that have film near me only have disposable cameras or the instant film for polaroids. i really just want to -----> find !!!  -----> a !!!  -----> place !!!  that sells 35mm. is my best bet just going on amazon and buying film? \n\nfor cameras i want to try to get either a 35mm or medium format camera, but a lot of the time all the posts i find on craigslist are too far from me. are there any places or sites i should be checking out? thanks for any help.", "sortedWord": "None", "identifyer": 54484, "year": "2020"}, {"Unnamed: 0": 311533, "autor": "jifwolf", "date": 1584907062000, "content": "Where can a brother get some colored infrared film?? /!/ The two types of film that I've researched (looks like they're not available on the market) are FPP infra chrome and Kodak aerochrome. Both films create some sexy ass images and it saddens me that I can't find any place to buy some.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fn616f/where_can_a_brother_get_some_colored_infrared_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "find any place", "selectorShort": "place", "MarkedSent": "where can a brother get some colored infrared film?? /!/ the two types of film that i've researched (looks like they're not available on the market) are fpp infra chrome and kodak aerochrome. both films create some sexy ass images and it saddens me that i can't -----> find !!!  -----> any !!!  -----> place !!!  to buy some.", "sortedWord": "None", "identifyer": 58570, "year": "2020"}], "name": "placeAnalogCommunity2020"}