{"interestingcomments": [{"Unnamed: 0": 88718, "autor": "UnsuspectingApple", "date": 1561510872000, "content": "Mamiya RB67 lens won't come off /!/ So got a Mamiya RB67 from eBay and running into a weird issue.\n\nI can't seem to take the lens off. I have the 90mm f3.8. The bayonet mount seems to be stuck and it wont rotate in either direction. Also, the mirror lock up button/wheel is stuck in the N position and wont rotate either.\n\nThe shutter will cock and fire, but I can't seem to take the lens off at all. Any ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c5in0t/mamiya_rb67_lens_wont_come_off/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya rb67 lens won't come off /!/ so got a mamiya rb67 from ebay and running into a weird issue.\n\ni can't seem to take the lens off. i have the 90mm f3.8. the bayonet mount seems to be stuck and it wont rotate in either direction. also, the mirror lock up button/wheel is stuck in the n -----> position !!!  and wont rotate either.\n\nthe shutter will cock and fire, but i can't seem to take the lens off at all. any ideas?", "sortedWord": "None", "identifyer": 91198, "year": "2019"}, {"Unnamed: 0": 89073, "autor": "urwlcm_photos", "date": 1558579106000, "content": "Canon 650 /!/ hey guys! i recently picked up a Canon 650 for $15 at my local goodwill here in Portland. Everything seems to work correctly but the mirror gets stuck in the up position after firing (no matter the ss) after about 2-3 seconds is snaps back down. What could be wrong with it? CLA possibly?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/brxt4s/canon_650/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon 650 /!/ hey guys! i recently picked up a canon 650 for $15 at my local goodwill here in portland. everything seems to work correctly but the mirror gets stuck in the up -----> position !!!  after firing (no matter the ss) after about 2-3 seconds is snaps back down. what could be wrong with it? cla possibly?", "sortedWord": "None", "identifyer": 91555, "year": "2019"}, {"Unnamed: 0": 89188, "autor": "RandyFunRuiner", "date": 1577491583000, "content": "Canon AE-1 Program Shutter Squeak, Mirror Delay, and Exposure Double Click /!/ I just bought a used Canon AE-1 Program that has the shutter squeak problem. There is definitely a delay with the mirror returning to its normal position. So, I know that needs to be fixed (everything I've read so far is oiling the gears a bit). But there's also a double click when I snap the exposure. Has anyone else had this problem? Is it related to the shutter squeak?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/egj6ku/canon_ae1_program_shutter_squeak_mirror_delay_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 program shutter squeak, mirror delay, and exposure double click /!/ i just bought a used canon ae-1 program that has the shutter squeak problem. there is definitely a delay with the mirror returning to its normal -----> position !!! . so, i know that needs to be fixed (everything i've read so far is oiling the gears a bit). but there's also a double click when i snap the exposure. has anyone else had this problem? is it related to the shutter squeak?", "sortedWord": "None", "identifyer": 91670, "year": "2019"}, {"Unnamed: 0": 89244, "autor": "mrmusic1590", "date": 1566383304000, "content": "Some trouble with a Nikon FG. Mirror stuck in upward position /!/ Hey everyone\n\nI have some trouble with this Nikon FG I got from my GF's grandfather. I tried to check if it works, but i couldn't cock the shutter and pressing the shutter button does nothing. I investigated closer and [the mirror is stuck in the upward position](https://i.imgur.com/X7bDhA4.jpg), so the shutter can be seen from the front. Batteries are fresh, tried to pull the mirror down, but it just flips up again. Any clue how to solve this? I can give more details if that helps.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ctexgc/some_trouble_with_a_nikon_fg_mirror_stuck_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "some trouble with a nikon fg. mirror stuck in upward -----> position !!!  /!/ hey everyone\n\ni have some trouble with this nikon fg i got from my gf's grandfather. i tried to check if it works, but i couldn't cock the shutter and pressing the shutter button does nothing. i investigated closer and [the mirror is stuck in the upward position](https://i.imgur.com/x7bdha4.jpg), so the shutter can be seen from the front. batteries are fresh, tried to pull the mirror down, but it just flips up again. any clue how to solve this? i can give more details if that helps.", "sortedWord": "None", "identifyer": 91727, "year": "2019"}, {"Unnamed: 0": 89333, "autor": "MrAkai", "date": 1561400101000, "content": "Anybody with Leicina 8S experience (Dual 8, not Super8) /!/ Hi!  I have acquired an old Leicina regular 8 camera.  The model # is 8S and I'm having a helluva time finding any manuals/etc.   \n\nI've found manuals for the later 8V and 8VS but not the 8S (or even the 8S's predecessor the 8R).  \n\nBefore I ruin the one roll of 8mm reversal film I have, I wanted to make sure it was working.  The motor runs and I can see the shutter operating if I run it with the film gate open inside the camera.\n\nI am less sure that the auto exposure meter is working.  It has it's own separate button cell battery that seems to have a charge, but the indicator in the viewfinder doesn't move in real time, it seems to change every now and then but I'm not sure if it's just as you pull the trigger or some other thing.\n\nThe manuals I've found for the more advanced models indicate a way to test the exposure by setting the framerate to a certain position, but the model I have lacks that control.\n\nIf you have experience with this camera or know where to find a scan of the manual (nothing on butkus or the usual places) that would be amazing.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c4sr86/anybody_with_leicina_8s_experience_dual_8_not/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "anybody with leicina 8s experience (dual 8, not super8) /!/ hi!  i have acquired an old leicina regular 8 camera.  the model # is 8s and i'm having a helluva time finding any manuals/etc.   \n\ni've found manuals for the later 8v and 8vs but not the 8s (or even the 8s's predecessor the 8r).  \n\nbefore i ruin the one roll of 8mm reversal film i have, i wanted to make sure it was working.  the motor runs and i can see the shutter operating if i run it with the film gate open inside the camera.\n\ni am less sure that the auto exposure meter is working.  it has it's own separate button cell battery that seems to have a charge, but the indicator in the viewfinder doesn't move in real time, it seems to change every now and then but i'm not sure if it's just as you pull the trigger or some other thing.\n\nthe manuals i've found for the more advanced models indicate a way to test the exposure by setting the framerate to a certain -----> position !!! , but the model i have lacks that control.\n\nif you have experience with this camera or know where to find a scan of the manual (nothing on butkus or the usual places) that would be amazing.\n\nthanks!", "sortedWord": "None", "identifyer": 91819, "year": "2019"}, {"Unnamed: 0": 89368, "autor": "carolingus69", "date": 1561224457000, "content": "Advanced a 24 exp film to 30 on my camera, what should I expect? /!/  As the title says, I forgot that the film I bought was only 24 exp and accidentally reached 30 exp on my camera with it.\nIt was making some grinding noises which I assumed was my cameras film advance lever acting up like it has before. \nOnly realised my mistake today as I was buying the same film again and realised it was only 24 exp.\nSo has anyone been in a similar position before? What can I expect to happen when I get the film out/developed?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c3se4r/advanced_a_24_exp_film_to_30_on_my_camera_what/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advanced a 24 exp film to 30 on my camera, what should i expect? /!/  as the title says, i forgot that the film i bought was only 24 exp and accidentally reached 30 exp on my camera with it.\nit was making some grinding noises which i assumed was my cameras film advance lever acting up like it has before. \nonly realised my mistake today as i was buying the same film again and realised it was only 24 exp.\nso has anyone been in a similar -----> position !!!  before? what can i expect to happen when i get the film out/developed?", "sortedWord": "None", "identifyer": 91854, "year": "2019"}, {"Unnamed: 0": 89651, "autor": "ManMadeSun", "date": 1551846323000, "content": "Minolta XG7 film camera with stuck mirror/shutter /!/ I bought a Minolta XG7 film camera for class and was checking if it function correctly i put in a fresh pair of batteries and stated to check. As i was checking it the took shots to see if it was working correctly and it got stuck, i can no longer take any shots and the film adverser lever is not functioning properly and the mirror is in the upward position. Dose anyone know how to fix it, any advice? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/axuo9b/minolta_xg7_film_camera_with_stuck_mirrorshutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta xg7 film camera with stuck mirror/shutter /!/ i bought a minolta xg7 film camera for class and was checking if it function correctly i put in a fresh pair of batteries and stated to check. as i was checking it the took shots to see if it was working correctly and it got stuck, i can no longer take any shots and the film adverser lever is not functioning properly and the mirror is in the upward -----> position !!! . dose anyone know how to fix it, any advice? ", "sortedWord": "None", "identifyer": 92138, "year": "2019"}, {"Unnamed: 0": 90331, "autor": "bromilar", "date": 1553802085000, "content": "Tower 24 (Asahiflex IIb) - Curtain return issues? /!/ Howdy, there. I recently came into posession of a Tower 24, the Sears branded Asahiflex IIb (as I understand it). The glass on the Takumar 58 f2.4 is exceptional--though the dent in the filter ring bums me out somewhat.  \nAnyway, I was hoping someone here might have had some experience with the Asahiflex IIb (or Tower 24) with respect to the 2nd curtain return. It cocks, it fires, and roughly half the time--maybe 60% of the time--the curtain returns to *almost* where it needs to be; taking a fingernail and sliding it over the remaining 1/16-1/8 of an inch drops the mirror back down. It's close enough that it's driving me nuts. \n\nI noticed that the shutter speed dial, when in the default (down) position also turns the advance spools--obviously, i suppose. Whatever the case, it seems the first curtain, when wound and cocked, moves a little too far by (surprise surprise) very nearly the spacing leftover on the return. Anyone with experience in this area have an idea how I can adjust that curtain?\n\nLong time listener, first time caller btw. Y'all are great.  \n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b6nays/tower_24_asahiflex_iib_curtain_return_issues/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "tower 24 (asahiflex iib) - curtain return issues? /!/ howdy, there. i recently came into posession of a tower 24, the sears branded asahiflex iib (as i understand it). the glass on the takumar 58 f2.4 is exceptional--though the dent in the filter ring bums me out somewhat.  \nanyway, i was hoping someone here might have had some experience with the asahiflex iib (or tower 24) with respect to the 2nd curtain return. it cocks, it fires, and roughly half the time--maybe 60% of the time--the curtain returns to *almost* where it needs to be; taking a fingernail and sliding it over the remaining 1/16-1/8 of an inch drops the mirror back down. it's close enough that it's driving me nuts. \n\ni noticed that the shutter speed dial, when in the default (down) -----> position !!!  also turns the advance spools--obviously, i suppose. whatever the case, it seems the first curtain, when wound and cocked, moves a little too far by (surprise surprise) very nearly the spacing leftover on the return. anyone with experience in this area have an idea how i can adjust that curtain?\n\nlong time listener, first time caller btw. y'all are great.  \n", "sortedWord": "None", "identifyer": 92818, "year": "2019"}, {"Unnamed: 0": 90593, "autor": "Webasauraus", "date": 1548381424000, "content": "Canon F-1 Mirror Sticking. /!/ Hi friends, I am starting to once again travel down the path of analog photography. That said, the Canon F-1 that I plan on using soon is having an issue with the mirror staying up. I was firing the camera at different shutter speeds this past weekend and noticed that at 1/60s and slower the mirror would stay in the up position and would only go down if the film advance lever starts to get cocked.I feel like I could still it and just deal with the minor inconvenience. The camera originally belonged to my father who has had it since the 70s, so it can 300% benefit from some a clean up and maintenance. Has anyone experienced this with the F-1 before? If so, how did you go about remedying it? I have been lurking this community for the past week or so and it has me very excited and inspired to get more into film photography!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ajk1z1/canon_f1_mirror_sticking/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon f-1 mirror sticking. /!/ hi friends, i am starting to once again travel down the path of analog photography. that said, the canon f-1 that i plan on using soon is having an issue with the mirror staying up. i was firing the camera at different shutter speeds this past weekend and noticed that at 1/60s and slower the mirror would stay in the up -----> position !!!  and would only go down if the film advance lever starts to get cocked.i feel like i could still it and just deal with the minor inconvenience. the camera originally belonged to my father who has had it since the 70s, so it can 300% benefit from some a clean up and maintenance. has anyone experienced this with the f-1 before? if so, how did you go about remedying it? i have been lurking this community for the past week or so and it has me very excited and inspired to get more into film photography!", "sortedWord": "None", "identifyer": 93081, "year": "2019"}, {"Unnamed: 0": 90673, "autor": "rhum-Forrest-rhum", "date": 1556733657000, "content": "Blades issues on Planar ZM 50/2 /!/ Hi there guys, unluckily today while I was inspecting my lens I found out that 3 blades went off. They unhooked from their right position and now are free to roam inside the lens. \n\nDid some of you had my same experience? Is this going to cost me an eye? Is it something easy to fix or is it really bad ruined? \n\nHere is a photo of it\n\nhttp://imgur.com/gallery/hjAg5vN\n\nThanks in advance guys", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bjkak8/blades_issues_on_planar_zm_502/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "blades issues on planar zm 50/2 /!/ hi there guys, unluckily today while i was inspecting my lens i found out that 3 blades went off. they unhooked from their right -----> position !!!  and now are free to roam inside the lens. \n\ndid some of you had my same experience? is this going to cost me an eye? is it something easy to fix or is it really bad ruined? \n\nhere is a photo of it\n\nhttp://imgur.com/gallery/hjag5vn\n\nthanks in advance guys", "sortedWord": "None", "identifyer": 93161, "year": "2019"}, {"Unnamed: 0": 90771, "autor": "lostllama2015", "date": 1558066575000, "content": "Weston Euro Master - Incident light readings /!/ Hi all,\n\n&amp;#x200B;\n\nI recently obtained a Weston Euro Master light meter, and while I'm impressed with the accuracy of its reflected light readings, I'm struggling to understand how to use the invercone for incident light readings. I've followed the guide in the manual (see the online version here:  [http://scruss.com/enterprise.net/weston/#p11](http://scruss.com/enterprise.net/weston/#p11)), but the reading I'm getting seems to lead to an exposure about 2 stops overexposed (e.g. meter says 1/60, but really I need 1/200).\n\n&amp;#x200B;\n\nI assume that I'm doing something wrong here, and that maybe I need to set the dial to a different position when using the invercone, etc.\n\n&amp;#x200B;\n\nCan anyone advise?\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bpmn0r/weston_euro_master_incident_light_readings/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "weston euro master - incident light readings /!/ hi all,\n\n&amp;#x200b;\n\ni recently obtained a weston euro master light meter, and while i'm impressed with the accuracy of its reflected light readings, i'm struggling to understand how to use the invercone for incident light readings. i've followed the guide in the manual (see the online version here:  [http://scruss.com/enterprise.net/weston/#p11](http://scruss.com/enterprise.net/weston/#p11)), but the reading i'm getting seems to lead to an exposure about 2 stops overexposed (e.g. meter says 1/60, but really i need 1/200).\n\n&amp;#x200b;\n\ni assume that i'm doing something wrong here, and that maybe i need to set the dial to a different -----> position !!!  when using the invercone, etc.\n\n&amp;#x200b;\n\ncan anyone advise?\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 93259, "year": "2019"}, {"Unnamed: 0": 91026, "autor": "lewdlou", "date": 1565556677000, "content": "Just finished shooting my first roll! /!/ I just finished shooting my first roll today, and up until the last frame it was a exhilarating experience. \n\nIn those 36 positions, I shared moments with my friends, my family and my SO; from my friend's garage sales to father's Day(in Brazil), and even those \"insignificant\" or \"unimportant\" moments like waiting for a bus. They are all here, burned into this roll of colorplus 200.\n\nI am loving it. Will put it to development tomorrow at a local shop, and will probably share some of the results with you guys.\n\nI used to be a total lurker(even while I didn't have a camera) and I totally love this community. It will be great to share this with you guys.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cp26ts/just_finished_shooting_my_first_roll/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "just finished shooting my first roll! /!/ i just finished shooting my first roll today, and up until the last frame it was a exhilarating experience. \n\nin those 36 -----> positions !!! , i shared moments with my friends, my family and my so; from my friend's garage sales to father's day(in brazil), and even those \"insignificant\" or \"unimportant\" moments like waiting for a bus. they are all here, burned into this roll of colorplus 200.\n\ni am loving it. will put it to development tomorrow at a local shop, and will probably share some of the results with you guys.\n\ni used to be a total lurker(even while i didn't have a camera) and i totally love this community. it will be great to share this with you guys.", "sortedWord": "None", "identifyer": 93517, "year": "2019"}, {"Unnamed: 0": 91330, "autor": "flobbley", "date": 1550077515000, "content": "Repairing the spring on the winding lever? K1000 /!/ Well I fucked up, I fell riding my bike with my camera in my bag and now the winding lever doesn't automatically return to the starting position but has to be manually pushed back. Other than that the camera seems to be functioning normally.\n\nAfter a good bit of searching I can't find any videos/posts of this particular issue, I found plenty of the winding lever getting jammed but none of it working and not returning. does anyone know of any they can show me?\n\nIf not, is this something I should attempt to repair myself or send out for repair? I'm pretty handy and have a good bit of experience repairing vintage electronics but I've never worked on a camera and have no idea what I'd be getting myself into so if anyone could provide an idea of what skill level is required for this kind of thing it would be greatly appreciated.\n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aq8rkh/repairing_the_spring_on_the_winding_lever_k1000/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "repairing the spring on the winding lever? k1000 /!/ well i fucked up, i fell riding my bike with my camera in my bag and now the winding lever doesn't automatically return to the starting -----> position !!!  but has to be manually pushed back. other than that the camera seems to be functioning normally.\n\nafter a good bit of searching i can't find any videos/posts of this particular issue, i found plenty of the winding lever getting jammed but none of it working and not returning. does anyone know of any they can show me?\n\nif not, is this something i should attempt to repair myself or send out for repair? i'm pretty handy and have a good bit of experience repairing vintage electronics but i've never worked on a camera and have no idea what i'd be getting myself into so if anyone could provide an idea of what skill level is required for this kind of thing it would be greatly appreciated.\n\nthanks", "sortedWord": "None", "identifyer": 93823, "year": "2019"}, {"Unnamed: 0": 91354, "autor": "PagliacciOpera", "date": 1549939721000, "content": "**Mirror on Cannon AE-1 is stuck in the up position and film advance lever won't release**", "link": "https://www.reddit.com/r/AnalogCommunity/comments/apog6b/mirror_on_cannon_ae1_is_stuck_in_the_up_position/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "**mirror on cannon ae-1 is stuck in the up -----> position !!!  and film advance lever won't release**", "sortedWord": "None", "identifyer": 93847, "year": "2019"}, {"Unnamed: 0": 91466, "autor": "Angry-_-Kid", "date": 1569349423000, "content": "Zorki 4K slow speed mechanism refitting trouble /!/ So I decided to (riskily) do a CLA on my Zorki 4K as I've never repaired a camera before. Everything has gone to plan, except, when it's coming to refit the slow speed mechanism, I cannot get it to fit back properly, I'll try and explain as best I can why here:\n\nI followed wolves3012's CLA guide on the Rangefinder Forums, which is amazing I'd like to say. I cannot however, figure out the refitting of the slow speed mechanism. In the guide it says to \"set the shutter speed to 1/1000\" which I did. Next (the part that doesn't work for me) \"Wind the escapement about one and one-half turns by means of the ring-shaped gear, until the pin is adjacent to the triangular shaped projection.\". So for this, which gear needs to be turned 1½ turns? Is it the one joined to the larger gear with the pin, that has 3 holes in it? The main problem though, is that the pin never seems to be in the correct position. See it's meant to be around the 1/60-1/15 slot on the speed dial when the shutter is cocked, but mine it always in a different place, either 180⁰ from there or between 1/2 and 1 second or near 1/1000 second, meaning that the pin is engaged in the wrong place and the clockwork doesn't time for the speeds it should. The problem to me seems that the cam or pin has moved and is in the wrong place. Since the cam has to engage the lever that closes the second curtain, you're essentially working around the cam, when that is in the correct place, the pin is not.\n\nThat is the best I can describe my problem, so feel free to ask for clarification! If pictures would help I'll try to provide some too. But if anyone could maybe re-describe the refitting of the slow speed mechanism, since the post by wolves3012 is the only info I have been following (I am not knocking that guide whatsoever, it's probably the most informative guide I've read, but I'm just getting tunnel vision with it, so maybe some 'fresh eyes' could help!) or provide some insight to what might be happening that'd be amazing, since I really don't want to lose this Zorki 4K!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d8r6mk/zorki_4k_slow_speed_mechanism_refitting_trouble/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "zorki 4k slow speed mechanism refitting trouble /!/ so i decided to (riskily) do a cla on my zorki 4k as i've never repaired a camera before. everything has gone to plan, except, when it's coming to refit the slow speed mechanism, i cannot get it to fit back properly, i'll try and explain as best i can why here:\n\ni followed wolves3012's cla guide on the rangefinder forums, which is amazing i'd like to say. i cannot however, figure out the refitting of the slow speed mechanism. in the guide it says to \"set the shutter speed to 1/1000\" which i did. next (the part that doesn't work for me) \"wind the escapement about one and one-half turns by means of the ring-shaped gear, until the pin is adjacent to the triangular shaped projection.\". so for this, which gear needs to be turned 1½ turns? is it the one joined to the larger gear with the pin, that has 3 holes in it? the main problem though, is that the pin never seems to be in the correct -----> position !!! . see it's meant to be around the 1/60-1/15 slot on the speed dial when the shutter is cocked, but mine it always in a different place, either 180⁰ from there or between 1/2 and 1 second or near 1/1000 second, meaning that the pin is engaged in the wrong place and the clockwork doesn't time for the speeds it should. the problem to me seems that the cam or pin has moved and is in the wrong place. since the cam has to engage the lever that closes the second curtain, you're essentially working around the cam, when that is in the correct place, the pin is not.\n\nthat is the best i can describe my problem, so feel free to ask for clarification! if pictures would help i'll try to provide some too. but if anyone could maybe re-describe the refitting of the slow speed mechanism, since the post by wolves3012 is the only info i have been following (i am not knocking that guide whatsoever, it's probably the most informative guide i've read, but i'm just getting tunnel vision with it, so maybe some 'fresh eyes' could help!) or provide some insight to what might be happening that'd be amazing, since i really don't want to lose this zorki 4k!", "sortedWord": "None", "identifyer": 93961, "year": "2019"}, {"Unnamed: 0": 91517, "autor": "gimlithepirate", "date": 1570983467000, "content": "Mamiya C vs Hasselblad 500 Review /!/ After shooting a Mamiya C22 for about a year and a half, I had an opportunity to jump to a Hasselblad 501C for a reasonable amount of money. Before the jump, I tried to do some research about these two cameras, and found lots of fanboying for one or the other, making it hard to figure out what the real difference in quality, handling, etc. between the two cameras was. This is intended to help someone else trying to decide on making the jump to Hasselblad.\n\nTL;DR: Hasselblad is legendary for its image quality for a reason, but you can get a lot of the artistic benefits over a Mamiya C with a different Medium Format SLR.\n\nMamiya C22:\n\nPros:  \n\\- Cheap, but with really good interchangeable lenses  \n\\- Extremely reliable  \n\\- A great jump into MF that doesn't lock you into a single lens. IQ is better than pretty much anything 35mm.  \n\\- Easy to repair. Lenses and shutters are modular, so this system will be repairable for a long time.  \n\\- Extremely quiet, which is good for surreptitious shots.\n\nCons:  \n\\- Big and heavy. Built like a tank comes at a price  \n\\- No infinity stop. This is punishing for landscapes. Lots of pictures where the focus is just a touch off.  \n\\- Viewfinder is just OK.\n\nHasselblad 501C:\n\nPros:  \n\\- Zeiss image rendering is stunning. High micro-contrast with smooth out of focus gives stunning images. Shots are sharp corner to corner on 6x6.  \n\\- Interchangeable backs are artistically a game changer. The ability to look at a scene and pick one of several color or black and white film stocks is huge.  \n\\- Handling is significantly better than a TLR.  \n\\- Depth of Field preview is really handy for portraits, close up work, etc.  \n\\- Designed to be idiot proof. You can't take a picture if the dark slide is in, you can't remove the back if it's out, etc.\n\nCons:  \n\\- Hasselblad tax doesn't end at the camera and lenses. Backs, filters, lens caps, and straps are all more expensive.  \n\\- It is loud. Everyone looks at you when you hit the shutter button.\n\nGeneral impressions:\n\nLet me start by saying, if I had it to do over again, I would still absolutely have bought the Hasselblad. This is going to be my main shooter for a long time, and I love taking pictures with the thing. That said, not everyone is in a position to buy a Hasselblad.\n\nThe jump from 35mm to MF is a \"wow moment.\" I get more pictures I am happier with on MF than on 35mm. For making that jump, the Mamiya C is one of the best options going, due to its repairability and extremely solid IQ. Unfortunately, the limits on the system, particularly the lack of an infinity stop are critical.\n\nIf you look at the list of Pros for the Hasselblad, all but 1 can be had with a Mamiya 645 super, Mamiya RZ/RB67, or most of the Bronicas. All of these are going to have pros and cons of their own, but at the end of the day will get you interchangeable backs, better handling and depth of field preview. Both of the Mamiya systems even have some \"magic\" lenses of their own that cost about the same as a single every day Hasselblad lens.\n\nAt the end of the day, if you want to get crazy cool image quality and have the money, you can't beat a Hasselblad 500 series. However, if you want a tool that will give you more options artistically than a TLR while still getting the MF wow factor, you have lots of options that have more realistic price points than a Hasselblad.\n\nNow if you will excuse me, I need to go sell a kidney so I can afford a wide angle lens and a split prism focusing screen for the 'blad. ;)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dhcnbk/mamiya_c_vs_hasselblad_500_review/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya c vs hasselblad 500 review /!/ after shooting a mamiya c22 for about a year and a half, i had an opportunity to jump to a hasselblad 501c for a reasonable amount of money. before the jump, i tried to do some research about these two cameras, and found lots of fanboying for one or the other, making it hard to figure out what the real difference in quality, handling, etc. between the two cameras was. this is intended to help someone else trying to decide on making the jump to hasselblad.\n\ntl;dr: hasselblad is legendary for its image quality for a reason, but you can get a lot of the artistic benefits over a mamiya c with a different medium format slr.\n\nmamiya c22:\n\npros:  \n\\- cheap, but with really good interchangeable lenses  \n\\- extremely reliable  \n\\- a great jump into mf that doesn't lock you into a single lens. iq is better than pretty much anything 35mm.  \n\\- easy to repair. lenses and shutters are modular, so this system will be repairable for a long time.  \n\\- extremely quiet, which is good for surreptitious shots.\n\ncons:  \n\\- big and heavy. built like a tank comes at a price  \n\\- no infinity stop. this is punishing for landscapes. lots of pictures where the focus is just a touch off.  \n\\- viewfinder is just ok.\n\nhasselblad 501c:\n\npros:  \n\\- zeiss image rendering is stunning. high micro-contrast with smooth out of focus gives stunning images. shots are sharp corner to corner on 6x6.  \n\\- interchangeable backs are artistically a game changer. the ability to look at a scene and pick one of several color or black and white film stocks is huge.  \n\\- handling is significantly better than a tlr.  \n\\- depth of field preview is really handy for portraits, close up work, etc.  \n\\- designed to be idiot proof. you can't take a picture if the dark slide is in, you can't remove the back if it's out, etc.\n\ncons:  \n\\- hasselblad tax doesn't end at the camera and lenses. backs, filters, lens caps, and straps are all more expensive.  \n\\- it is loud. everyone looks at you when you hit the shutter button.\n\ngeneral impressions:\n\nlet me start by saying, if i had it to do over again, i would still absolutely have bought the hasselblad. this is going to be my main shooter for a long time, and i love taking pictures with the thing. that said, not everyone is in a -----> position !!!  to buy a hasselblad.\n\nthe jump from 35mm to mf is a \"wow moment.\" i get more pictures i am happier with on mf than on 35mm. for making that jump, the mamiya c is one of the best options going, due to its repairability and extremely solid iq. unfortunately, the limits on the system, particularly the lack of an infinity stop are critical.\n\nif you look at the list of pros for the hasselblad, all but 1 can be had with a mamiya 645 super, mamiya rz/rb67, or most of the bronicas. all of these are going to have pros and cons of their own, but at the end of the day will get you interchangeable backs, better handling and depth of field preview. both of the mamiya systems even have some \"magic\" lenses of their own that cost about the same as a single every day hasselblad lens.\n\nat the end of the day, if you want to get crazy cool image quality and have the money, you can't beat a hasselblad 500 series. however, if you want a tool that will give you more options artistically than a tlr while still getting the mf wow factor, you have lots of options that have more realistic price points than a hasselblad.\n\nnow if you will excuse me, i need to go sell a kidney so i can afford a wide angle lens and a split prism focusing screen for the 'blad. ;)", "sortedWord": "None", "identifyer": 94012, "year": "2019"}, {"Unnamed: 0": 91844, "autor": "Ciolloi", "date": 1562451074000, "content": "Minolta AF 9000 sutter mirror problem /!/ Hi, I have a Minolta 9000 that has grise on the curtain. I tried to clean it and after a few blank shots, the grise is back. Ok, activate the bulb settings to clean it from the inside and now the mirror it's \"stuck\" in the up position. If I tried to pull it down gently, it comes down until I keep my finger on the mirror and after it goes up again. The display shows 4000 and f22. Nothing is working. I tried to remove the batteries and to open the back and to turn it off and on several times. The film winder is not working. It's the same with or without the lens. I don't have any Minolta repair shops in my area. O test thw DPF button. I tried to open it, I unscrewed all the screws and nothing detach. I think I don't have the right tools.\n\nIt's really a shame because I have a motor MD-90, a battery grip BP-90 and I just bought a new lens. If someone knows how to open it and wants such a great camera i'm willing to sell it for a good price in r/photomarket.\n\nIf you have any suggestions please let me know. Thank you and sorry for my bad english, I'm not a native speaker.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c9zdu2/minolta_af_9000_sutter_mirror_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta af 9000 sutter mirror problem /!/ hi, i have a minolta 9000 that has grise on the curtain. i tried to clean it and after a few blank shots, the grise is back. ok, activate the bulb settings to clean it from the inside and now the mirror it's \"stuck\" in the up -----> position !!! . if i tried to pull it down gently, it comes down until i keep my finger on the mirror and after it goes up again. the display shows 4000 and f22. nothing is working. i tried to remove the batteries and to open the back and to turn it off and on several times. the film winder is not working. it's the same with or without the lens. i don't have any minolta repair shops in my area. o test thw dpf button. i tried to open it, i unscrewed all the screws and nothing detach. i think i don't have the right tools.\n\nit's really a shame because i have a motor md-90, a battery grip bp-90 and i just bought a new lens. if someone knows how to open it and wants such a great camera i'm willing to sell it for a good price in r/photomarket.\n\nif you have any suggestions please let me know. thank you and sorry for my bad english, i'm not a native speaker.", "sortedWord": "None", "identifyer": 94341, "year": "2019"}, {"Unnamed: 0": 92192, "autor": "genericprophet", "date": 1573742449000, "content": "DX Code contacts AF-10 /!/ While changing the film yesterday in my olympus af-10 p&amp;s I noticed the dx code reader on it only has three contacts.\n\nSince dx has 5 different contact points, I figured the reading cannot be very specific. From what I can tell, the contacts are ground, position 2 and position 3.\nLittle bit of research led me to believe there’s only four different settings that can be achieved, being \n\n&lt;100\n100-320\n400-1250\n&gt;1250\n\nTherefore, I guess it doesn’t really make a difference if I chose 400 or 800 speed film, right? With those contacts the camera shouldn’t be able to tell the difference\n\nAlso, i guess these „settings“\nAre balanced near the lowest possible iso, meaning settings are most likely:\n50/64\n100\n400\n1600\n\nDoes that sound right or am I overthinking this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dwaekx/dx_code_contacts_af10/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "dx code contacts af-10 /!/ while changing the film yesterday in my olympus af-10 p&amp;s i noticed the dx code reader on it only has three contacts.\n\nsince dx has 5 different contact points, i figured the reading cannot be very specific. from what i can tell, the contacts are ground, -----> position !!!  2 and -----> position !!!  3.\nlittle bit of research led me to believe there’s only four different settings that can be achieved, being \n\n&lt;100\n100-320\n400-1250\n&gt;1250\n\ntherefore, i guess it doesn’t really make a difference if i chose 400 or 800 speed film, right? with those contacts the camera shouldn’t be able to tell the difference\n\nalso, i guess these „settings“\nare balanced near the lowest possible iso, meaning settings are most likely:\n50/64\n100\n400\n1600\n\ndoes that sound right or am i overthinking this?", "sortedWord": "None", "identifyer": 94692, "year": "2019"}, {"Unnamed: 0": 92554, "autor": "friedrice1212", "date": 1557521746000, "content": "Weird thing with Nikon AI tabs. Misaligned by design? /!/ Hello all, I noticed something weird with my Nikon 50mm 1.4 AI. I've been using it exclusively on an F3 before but I mounted it on my D800 today and noticed that the aperture selected on the ring isn't the same as what the camera thinks it is. It's shifted by one stop. When selecting f/5.6 for example, the camera displays f/8. The metering seems to be fine, as it reports the same SS as using a G lens with no ring.\n\nThis sparked my interest and I compared the aperture rings between the 50mm and my Zeiss 28mm 2.0 ZF. I realize that the tab that interacts with the camera to tell the latter the position of the ring is not aligned the same way on the two lenses. [The Nikon lines up on f/8](https://i.imgur.com/zjuIuGi.jpg) whereas [the Zeiss lines up a bit before f/11.](https://i.imgur.com/IwZ6icT.jpg)\n\nSo I go look at pictures on the internet and the 50mm 1.4 AI is just manufactured like this, [see Ken Rockwell's picture.](https://kenrockwell.com/nikon/images1/50-14-ai-KEN_0012-950.jpg) The AI-S version is also [like such.](https://images-na.ssl-images-amazon.com/images/I/510KXP%2BarPL._SX425_.jpg) However, when I look up other lenses, it seems that the positioning of the tab varies from lens to lens. See: [105mm 2.5 AI-S](https://media.karousell.com/media/photos/products/2018/10/20/nikon_105mm_f25_ais_1540043702_2a64ec2c.jpg), [28mm 2.8 AI](https://kenrockwell.com/nikon/images1/28mm-f28-ai/D3S_4514-1200.jpg), [Zeiss Otus 55](https://www.ephotozine.com/articles/zeiss-otus-55mm-f-1-4-apo-distagon-t--review-28738/images/highres-zeiss_otus_55mm_f14_oblique_rear_1453288942.jpg)\n\nWhat explains this? Is something wrong with my D800? I never had a problem shooting it with the F3 (and frankly no real problem with the D800). Can someone try to reproduce this?\n\n(Sorry if this is not **strictly** analogue photography, but since it's manual Nikon lenses, I figured that this community would know)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bn3oxn/weird_thing_with_nikon_ai_tabs_misaligned_by/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "weird thing with nikon ai tabs. misaligned by design? /!/ hello all, i noticed something weird with my nikon 50mm 1.4 ai. i've been using it exclusively on an f3 before but i mounted it on my d800 today and noticed that the aperture selected on the ring isn't the same as what the camera thinks it is. it's shifted by one stop. when selecting f/5.6 for example, the camera displays f/8. the metering seems to be fine, as it reports the same ss as using a g lens with no ring.\n\nthis sparked my interest and i compared the aperture rings between the 50mm and my zeiss 28mm 2.0 zf. i realize that the tab that interacts with the camera to tell the latter the -----> position !!!  of the ring is not aligned the same way on the two lenses. [the nikon lines up on f/8](https://i.imgur.com/zjuiugi.jpg) whereas [the zeiss lines up a bit before f/11.](https://i.imgur.com/iwz6ict.jpg)\n\nso i go look at pictures on the internet and the 50mm 1.4 ai is just manufactured like this, [see ken rockwell's picture.](https://kenrockwell.com/nikon/images1/50-14-ai-ken_0012-950.jpg) the ai-s version is also [like such.](https://images-na.ssl-images-amazon.com/images/i/510kxp%2barpl._sx425_.jpg) however, when i look up other lenses, it seems that the positioning of the tab varies from lens to lens. see: [105mm 2.5 ai-s](https://media.karousell.com/media/photos/products/2018/10/20/nikon_105mm_f25_ais_1540043702_2a64ec2c.jpg), [28mm 2.8 ai](https://kenrockwell.com/nikon/images1/28mm-f28-ai/d3s_4514-1200.jpg), [zeiss otus 55](https://www.ephotozine.com/articles/zeiss-otus-55mm-f-1-4-apo-distagon-t--review-28738/images/highres-zeiss_otus_55mm_f14_oblique_rear_1453288942.jpg)\n\nwhat explains this? is something wrong with my d800? i never had a problem shooting it with the f3 (and frankly no real problem with the d800). can someone try to reproduce this?\n\n(sorry if this is not **strictly** analogue photography, but since it's manual nikon lenses, i figured that this community would know)", "sortedWord": "None", "identifyer": 95056, "year": "2019"}, {"Unnamed: 0": 92816, "autor": "aggrokragg", "date": 1560272893000, "content": "Recurring problem with Photo Blemish. What is this thing? /!/ Hi all,\n\nI had previously posted about a blemish in my photos [here in this earlier post](https://www.reddit.com/r/AnalogCommunity/comments/atlemy/odd_blemish_in_photos_with_lens_what_is_it/?utm_source=share&amp;utm_medium=web2x).\n\nI have a Pentax KM that was professionally CLA'd, and this blemish seems to only be happening with one of my lenses? Supposedly the lenses was cleaned when I sent the camera, and when I look at the lens elements with the naked eye or through the viewfinder everything looks clean. But this is obviously a hair or thread, because it has moved since my previous post.\n\nIs it even possible for a hair or whatever foreign object that is to get into a lens and cause an issue? (It's in the same position for every photo on this roll, my example below was just very prominent). \n\nI've inspected the KM body and I cannot see any hairs or threads on the mirror/prism/or loose on the shutter. Also I don't see it when looking through the viewfinder.\n\nI loaded another roll last night and I'm going to specifically shoot with all of my lenses in bright light and keep a note of which is which.\n\nQuestion: If it is in fact the lens (Pentax SMC 55mm 1.8) should I just sell the thing noting the imperfection? It was the lens that came with the camera when I bought it. Are these old lenses even worth repairing or maybe just pick up a replacement if I find one at a good price?\n\nMy real worry is that it's an issue with the camera but it isn't showing up on other lenses for some reason? Is that not logically possible?\n\nThanks and sorry if this post is a bit wordy. I'm very frustrated about this because I have to keep cropping/touching up my photos.\n\nhttps://i.redd.it/ac5wjcz0cr331.jpg", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bzf5w5/recurring_problem_with_photo_blemish_what_is_this/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "recurring problem with photo blemish. what is this thing? /!/ hi all,\n\ni had previously posted about a blemish in my photos [here in this earlier post](https://www.reddit.com/r/analogcommunity/comments/atlemy/odd_blemish_in_photos_with_lens_what_is_it/?utm_source=share&amp;utm_medium=web2x).\n\ni have a pentax km that was professionally cla'd, and this blemish seems to only be happening with one of my lenses? supposedly the lenses was cleaned when i sent the camera, and when i look at the lens elements with the naked eye or through the viewfinder everything looks clean. but this is obviously a hair or thread, because it has moved since my previous post.\n\nis it even possible for a hair or whatever foreign object that is to get into a lens and cause an issue? (it's in the same -----> position !!!  for every photo on this roll, my example below was just very prominent). \n\ni've inspected the km body and i cannot see any hairs or threads on the mirror/prism/or loose on the shutter. also i don't see it when looking through the viewfinder.\n\ni loaded another roll last night and i'm going to specifically shoot with all of my lenses in bright light and keep a note of which is which.\n\nquestion: if it is in fact the lens (pentax smc 55mm 1.8) should i just sell the thing noting the imperfection? it was the lens that came with the camera when i bought it. are these old lenses even worth repairing or maybe just pick up a replacement if i find one at a good price?\n\nmy real worry is that it's an issue with the camera but it isn't showing up on other lenses for some reason? is that not logically possible?\n\nthanks and sorry if this post is a bit wordy. i'm very frustrated about this because i have to keep cropping/touching up my photos.\n\nhttps://i.redd.it/ac5wjcz0cr331.jpg", "sortedWord": "None", "identifyer": 95318, "year": "2019"}, {"Unnamed: 0": 93043, "autor": "theaggressivenapkin", "date": 1570070517000, "content": "Super frustrated with plustek 8100 banding. LF scanner advice /!/ Hey /r/AnalogCommunity \n\nI've had a plustek 8100 dedicated 35mm scanner for around 2 years now, and i operate silverfast 8 SE plus with it. \n\nI initially discovered large vertical bands, [such as these](https://i.imgur.com/4sHYkeZ.png), in the middle of my scans. They always appear in this position, generally in skies - dense areas of the negative. \n\nI intially thought i updated out of the issue on my old imac, as the lines were generally not appearing anymore. \n\nThat being said, I recently installed silverfast onto my 2017 macbook pro and the lines are back. Ive installed, uninstalled, checked for updates, downloaded and installed the plustek drivers that are said to be included in the most recent silverfast update and nothing has changed. I've even tried vuescan - but the exact same problem appears on that software. \n\nI was wondering if anyone else had this problem.\nI am at the point of just ditching this scanner, so if there are any recommendations on a scanner around the same performance as this one, ~7200dpi, that would be great.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dckum3/super_frustrated_with_plustek_8100_banding_lf/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "super frustrated with plustek 8100 banding. lf scanner advice /!/ hey /r/analogcommunity \n\ni've had a plustek 8100 dedicated 35mm scanner for around 2 years now, and i operate silverfast 8 se plus with it. \n\ni initially discovered large vertical bands, [such as these](https://i.imgur.com/4shykez.png), in the middle of my scans. they always appear in this -----> position !!! , generally in skies - dense areas of the negative. \n\ni intially thought i updated out of the issue on my old imac, as the lines were generally not appearing anymore. \n\nthat being said, i recently installed silverfast onto my 2017 macbook pro and the lines are back. ive installed, uninstalled, checked for updates, downloaded and installed the plustek drivers that are said to be included in the most recent silverfast update and nothing has changed. i've even tried vuescan - but the exact same problem appears on that software. \n\ni was wondering if anyone else had this problem.\ni am at the point of just ditching this scanner, so if there are any recommendations on a scanner around the same performance as this one, ~7200dpi, that would be great.", "sortedWord": "None", "identifyer": 95548, "year": "2019"}, {"Unnamed: 0": 93362, "autor": "bats9218", "date": 1576432971000, "content": "Canon AE-1 repair advice /!/ I have a Cannon AE-1 from the early 80s that I got from my dad. I was hoping I could start using it as a fairly inexpensive venture into the hobby, but I’m finding a few problems with it. The main one being that the ISO (or film speed?) dial will not hold it’s position, and bounces back to it’s original place like a rotary phone. Does anyone have any experience repairing these? An employee at a local photography store told me it’s probably cheaper just to buy a new body than try and repair it, but I’m a little stuck on which way to go. I’d like to use the same camera body since it is my Dad’s, but I also don’t want to needlessly waste money without a good reason.\n\nThanks in advance for any advice.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eb26y6/canon_ae1_repair_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 repair advice /!/ i have a cannon ae-1 from the early 80s that i got from my dad. i was hoping i could start using it as a fairly inexpensive venture into the hobby, but i’m finding a few problems with it. the main one being that the iso (or film speed?) dial will not hold it’s -----> position !!! , and bounces back to it’s original place like a rotary phone. does anyone have any experience repairing these? an employee at a local photography store told me it’s probably cheaper just to buy a new body than try and repair it, but i’m a little stuck on which way to go. i’d like to use the same camera body since it is my dad’s, but i also don’t want to needlessly waste money without a good reason.\n\nthanks in advance for any advice.", "sortedWord": "None", "identifyer": 95868, "year": "2019"}, {"Unnamed: 0": 93588, "autor": "kerc", "date": 1546576629000, "content": "Seikosha shutter won't cock (video link showing issue in message) /!/ I found out the issue with my Honeywell's Seikosha shutter: it's like the winding lever doesn't go far enough! [This short video shows the issue.](https://youtu.be/N6tyTu-nVdY) I'm flabbergasted as I don't understand why there would be a 2mm-3mm discrepancy between the lever maximum travel and the shutter's clocking position.\n\nAny help is greatly appreciated! This night has been a crash course in camera lenses. :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aceiq4/seikosha_shutter_wont_cock_video_link_showing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "seikosha shutter won't cock (video link showing issue in message) /!/ i found out the issue with my honeywell's seikosha shutter: it's like the winding lever doesn't go far enough! [this short video shows the issue.](https://youtu.be/n6tytu-nvdy) i'm flabbergasted as i don't understand why there would be a 2mm-3mm discrepancy between the lever maximum travel and the shutter's clocking -----> position !!! .\n\nany help is greatly appreciated! this night has been a crash course in camera lenses. :)", "sortedWord": "None", "identifyer": 96097, "year": "2019"}, {"Unnamed: 0": 93724, "autor": "CobbleSocks", "date": 1569891361000, "content": "Minolta Maxxum 3000i possessed by ghost /!/ Just dug an old camera out of the attic. As soon as I put new batteries in the shutter started firing continuously for a couple of minutes. Now it's stopped most of the time, but every couple minutes it will randomly start firing again for about 20 seconds, even when the camera is off (aka in \"lock\" position). \n\nAny ideas on what's going on?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dblg01/minolta_maxxum_3000i_possessed_by_ghost/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta maxxum 3000i possessed by ghost /!/ just dug an old camera out of the attic. as soon as i put new batteries in the shutter started firing continuously for a couple of minutes. now it's stopped most of the time, but every couple minutes it will randomly start firing again for about 20 seconds, even when the camera is off (aka in \"lock\" -----> position !!! ). \n\nany ideas on what's going on?", "sortedWord": "None", "identifyer": 96235, "year": "2019"}, {"Unnamed: 0": 94257, "autor": "Canoo", "date": 1572902976000, "content": "Revived an SRT101! /!/ I bought an SRT101 that had a shutter issue. The shutter was firing correctly for different speeds. But the mirror was stuck down. I'm somewhat mechanically inclined so I figured I'd take a stab at it. I bought the camera for cheap. It took me all of 5 minutes to notice a pin that looked like it was supposed to flip the mirror up was disconnected from the mirror mechanism. I pressed the pin down gently and pushed upwards on the mirror. The pin popped right into position! Now the mirror is flipping up perfectly! I wasn't expecting it to me *that* easy of a fix.\n\nHere's a photo of the pin back in it's proper spot. It was sitting outside of that mechanism. Making it so the mirror wasn't moving at all:\n\nhttps://preview.redd.it/43opz007mqw31.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=a04f1a75e529b18c3c5c111d83dfba1b3d8b6752", "link": "https://www.reddit.com/r/AnalogCommunity/comments/droje9/revived_an_srt101/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "revived an srt101! /!/ i bought an srt101 that had a shutter issue. the shutter was firing correctly for different speeds. but the mirror was stuck down. i'm somewhat mechanically inclined so i figured i'd take a stab at it. i bought the camera for cheap. it took me all of 5 minutes to notice a pin that looked like it was supposed to flip the mirror up was disconnected from the mirror mechanism. i pressed the pin down gently and pushed upwards on the mirror. the pin popped right into -----> position !!! ! now the mirror is flipping up perfectly! i wasn't expecting it to me *that* easy of a fix.\n\nhere's a photo of the pin back in it's proper spot. it was sitting outside of that mechanism. making it so the mirror wasn't moving at all:\n\nhttps://preview.redd.it/43opz007mqw31.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=a04f1a75e529b18c3c5c111d83dfba1b3d8b6752", "sortedWord": "None", "identifyer": 96776, "year": "2019"}, {"Unnamed: 0": 94282, "autor": "autocorrector", "date": 1572748243000, "content": "Trying to find the name of an Olympus compact camera like the XA2 /!/ I'm looking for a camera like the XA2 but it has an electronic winder but I'm stumped on what the name is or where to find it.\n\n&amp;#x200B;\n\n* It's like the XA2 but made out of grey plastic with green buttons.\n* It had 3 focus positions like the XA2 but you access them with green buttons on the front of the camera.\n* It has electronic film winding, but no autofocus.\n\nAnyone know what it's called or where i can buy it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dquk1x/trying_to_find_the_name_of_an_olympus_compact/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "trying to find the name of an olympus compact camera like the xa2 /!/ i'm looking for a camera like the xa2 but it has an electronic winder but i'm stumped on what the name is or where to find it.\n\n&amp;#x200b;\n\n* it's like the xa2 but made out of grey plastic with green buttons.\n* it had 3 focus -----> positions !!!  like the xa2 but you access them with green buttons on the front of the camera.\n* it has electronic film winding, but no autofocus.\n\nanyone know what it's called or where i can buy it?", "sortedWord": "None", "identifyer": 96801, "year": "2019"}, {"Unnamed: 0": 94384, "autor": "centralplains", "date": 1552593684000, "content": "Focus position issues on Epson Expression 1600 scanner /!/ I have an Epson Expression 1600. It seems to focus better at 0.0 setting (positioned directly on glass) vs the 2.5mm setting for film holders. I've tried placing the film directly on the glass but I get those Newton Rings. I don't see anywhere that I can change the focus position other than 0.0 or 2.5. Anyone have experience with this model?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b1507n/focus_position_issues_on_epson_expression_1600/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "focus -----> position !!!  issues on epson expression 1600 scanner /!/ i have an epson expression 1600. it seems to focus better at 0.0 setting (positioned directly on glass) vs the 2.5mm setting for film holders. i've tried placing the film directly on the glass but i get those newton rings. i don't see anywhere that i can change the focus position other than 0.0 or 2.5. anyone have experience with this model?", "sortedWord": "None", "identifyer": 96903, "year": "2019"}], "name": "positionAnalogCommunity2019"}