{"interestingcomments": [{"Unnamed: 0": 252167, "autor": "tvalbert", "date": 1617234841000, "content": "Zeiss ikon tenax automatic problem with shutter and advance film lever /!/ Hello, I don't know if this is a correct post for this community but I need some help with my camera, I have a zeiss ikon tenax automatic and when I advance the film with the lever the shutter release, is in automatic mode and the light meter is responding but looks like the shutter and the lever is kind of sticky because I have to force a little to advance the film and when the diafrag inside the camera moves, its takes time to back to his normal position, anyone have this camera or know how to lubricate those mechanism? Thank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mhiyw2/zeiss_ikon_tenax_automatic_problem_with_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "zeiss ikon tenax automatic problem with shutter and advance film lever /!/ hello, i don't know if this is a correct post for this community but i need some help with my camera, i have a zeiss ikon tenax automatic and when i advance the film with the lever the shutter release, is in automatic mode and the light meter is responding but looks like the shutter and the lever is kind of sticky because i have to force a little to advance the film and when the diafrag inside the camera moves, its takes time to back to his normal -----> position !!! , anyone have this camera or know how to lubricate those mechanism? thank you", "sortedWord": "None", "identifyer": 47526, "year": "2021"}, {"Unnamed: 0": 252188, "autor": "wiehlio", "date": 1617200620000, "content": "Question on how the image is oriented on film roll across multiple frames (Mamiya RZ) /!/ I want to take multiple pictures of the same subject and have it shown across multiple frames (similar to [this](https://i.pinimg.com/736x/82/de/77/82de772d6411bdea0bc4a73ec60e0916--contact-sheet-white-photography.jpg), but only little sets of 3). I would like to scan in the final product without having to move around frames or anything. \n\nIf I have the film back in portrait position, would I be moving the camera from left to right or right to left between frames to have the image be continuous?\n\nI can't think through how the image is translated back to the film without my head exploding...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mh77ah/question_on_how_the_image_is_oriented_on_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question on how the image is oriented on film roll across multiple frames (mamiya rz) /!/ i want to take multiple pictures of the same subject and have it shown across multiple frames (similar to [this](https://i.pinimg.com/736x/82/de/77/82de772d6411bdea0bc4a73ec60e0916--contact-sheet-white-photography.jpg), but only little sets of 3). i would like to scan in the final product without having to move around frames or anything. \n\nif i have the film back in portrait -----> position !!! , would i be moving the camera from left to right or right to left between frames to have the image be continuous?\n\ni can't think through how the image is translated back to the film without my head exploding...", "sortedWord": "None", "identifyer": 47547, "year": "2021"}, {"Unnamed: 0": 252243, "autor": "Just_InGrain", "date": 1633036445000, "content": "Pentax 67 shooters, how often does your shutter jam? /!/ Let me add context here by saying I bought my first Pentax 67 (not 6x7) almost a year ago.  Put several rolls through it when suddenly a couple frames in the mirror and shutter would both jam in the open position.  Eventually without knowing how it would release and I could go on shooting albeit with a wasted frame.  Then one day this happened no amount of removing battery, release button pressing or shutter fiddling would unjam it.  I sent it in for a repair and CLA to Lezot.\n\nAfter several months of it being gone I got it back with what I thought was a stated full repair.  Shot a couple frames and again same jam.  Sent it back.  This time I was told the camera was unrepairable due to a broken spring in the winder.  Frustrated, I sold off the body for parts then purchased a second body in what looked to be better condition than the first.\n\nHave put a handful of rolls through this one but for the first time the other day the shutter and mirror did that familiar lock up.  It released seemingly on its own after several minutes but now I’m wondering how common this is?  I’ve heard of dirty magnets and selenium (I thought this was the original issue with first body) but I’m nervous about continuing to pay out for CLAs and investing more in the system.  Especially as of now more time has been spent waiting on repairs or hunting for a new body than actually shooting with the camera.  Can any long time or experienced owners shed some light?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pyt29p/pentax_67_shooters_how_often_does_your_shutter_jam/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax 67 shooters, how often does your shutter jam? /!/ let me add context here by saying i bought my first pentax 67 (not 6x7) almost a year ago.  put several rolls through it when suddenly a couple frames in the mirror and shutter would both jam in the open -----> position !!! .  eventually without knowing how it would release and i could go on shooting albeit with a wasted frame.  then one day this happened no amount of removing battery, release button pressing or shutter fiddling would unjam it.  i sent it in for a repair and cla to lezot.\n\nafter several months of it being gone i got it back with what i thought was a stated full repair.  shot a couple frames and again same jam.  sent it back.  this time i was told the camera was unrepairable due to a broken spring in the winder.  frustrated, i sold off the body for parts then purchased a second body in what looked to be better condition than the first.\n\nhave put a handful of rolls through this one but for the first time the other day the shutter and mirror did that familiar lock up.  it released seemingly on its own after several minutes but now i’m wondering how common this is?  i’ve heard of dirty magnets and selenium (i thought this was the original issue with first body) but i’m nervous about continuing to pay out for clas and investing more in the system.  especially as of now more time has been spent waiting on repairs or hunting for a new body than actually shooting with the camera.  can any long time or experienced owners shed some light?", "sortedWord": "None", "identifyer": 47606, "year": "2021"}, {"Unnamed: 0": 252914, "autor": "deansreddit711", "date": 1630462310000, "content": "Elan 7 Quick Dial issue /!/ Unfortunately, my brand new (to me) Canon Elan 7 took a fall last week onto some particularly hard asphalt. Thankfully the lens is perfectly fine, and the primary functions of the camera seem to be in good shape, but I'm having some issues that I haven't been able to figure out and I'm hoping one of you folks might.\n\n&amp;#x200B;\n\nThe biggest issue is that the camera doesn't seem to switch to manual mode when changing the dial to \"M.\" When placed on M, it seems to be in some sort of aperture priority mode, where you're only able to change the aperture using what is normally the shutter dial and then can change the shutter speed after half pressing the shutter button to trigger the meter. Through all of my trial and error, I cannot seem to find a way to put the camera in full manual mode, or allow myself to change the aperture with the quick dial on the back of the camera. The quick dial on the back works in other priority modes, just doesn't function correctly in full manual mode. I've tried putting other lenses on the body, and the same issue persists. \n\n&amp;#x200B;\n\nAdditionally, there is no electronic readout on the inside of the viewfinder. The AF points will light up in the viewfinder when cycling through them, but there is no exposure information listed at the bottom.\n\nFinally, the camera doesn't seem to fully turn off, even with the mode dial set in the \"OFF\" position. When set to off, some of the information on the LCD readout disappears, but you're still able to take a meter reading and take pictures. When previously set to off, the camera would just show the film exposure count, as well as an icon denoting that there was a roll loaded into the camera.\n\n&amp;#x200B;\n\nI took the camera into my local shop and they weren't able to diagnose the issue, so me putting this here is a last-ditch effort to make sure I'm not missing something stupidly obvious that would cause this issue. I'm unsure if there's some custom mode that prevents the camera from going fully manual that could've been activated when the camera hit the floor, so if anyone here is aware of something like that please let me know. Outside of a silly oversight like that, I'll just have to take it to a camera repair shop. \n\nAny help is greatly appreciated, thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pfkad6/elan_7_quick_dial_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "elan 7 quick dial issue /!/ unfortunately, my brand new (to me) canon elan 7 took a fall last week onto some particularly hard asphalt. thankfully the lens is perfectly fine, and the primary functions of the camera seem to be in good shape, but i'm having some issues that i haven't been able to figure out and i'm hoping one of you folks might.\n\n&amp;#x200b;\n\nthe biggest issue is that the camera doesn't seem to switch to manual mode when changing the dial to \"m.\" when placed on m, it seems to be in some sort of aperture priority mode, where you're only able to change the aperture using what is normally the shutter dial and then can change the shutter speed after half pressing the shutter button to trigger the meter. through all of my trial and error, i cannot seem to find a way to put the camera in full manual mode, or allow myself to change the aperture with the quick dial on the back of the camera. the quick dial on the back works in other priority modes, just doesn't function correctly in full manual mode. i've tried putting other lenses on the body, and the same issue persists. \n\n&amp;#x200b;\n\nadditionally, there is no electronic readout on the inside of the viewfinder. the af points will light up in the viewfinder when cycling through them, but there is no exposure information listed at the bottom.\n\nfinally, the camera doesn't seem to fully turn off, even with the mode dial set in the \"off\" -----> position !!! . when set to off, some of the information on the lcd readout disappears, but you're still able to take a meter reading and take pictures. when previously set to off, the camera would just show the film exposure count, as well as an icon denoting that there was a roll loaded into the camera.\n\n&amp;#x200b;\n\ni took the camera into my local shop and they weren't able to diagnose the issue, so me putting this here is a last-ditch effort to make sure i'm not missing something stupidly obvious that would cause this issue. i'm unsure if there's some custom mode that prevents the camera from going fully manual that could've been activated when the camera hit the floor, so if anyone here is aware of something like that please let me know. outside of a silly oversight like that, i'll just have to take it to a camera repair shop. \n\nany help is greatly appreciated, thanks!", "sortedWord": "None", "identifyer": 48286, "year": "2021"}, {"Unnamed: 0": 252989, "autor": "Whopper98", "date": 1630323616000, "content": "Lens not focusing /!/ Hi everyone, I just received from eBay a new lens for my yashica fx-3 super 2000. The lens is a MAKINON MC zoom 28-80mm f 3.5-4.5 with macro feature. The problem is that the lens does not focus at all except at very close distances (10 cm) even trying to move the mechanism that in theory disables the macro setting (sorry for my bad way of explaining but I'm not a native English speaker).\nI think I tried every combination to focus but in any case the \"infinite\" position doesn't focus over 10 cm.\nIs it the way that this lens works? Is it not compatible with my camera even if the mount is still C/Y? Is it broken? \nAny help would be appreciated, thank everyone that responds.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pegd5n/lens_not_focusing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens not focusing /!/ hi everyone, i just received from ebay a new lens for my yashica fx-3 super 2000. the lens is a makinon mc zoom 28-80mm f 3.5-4.5 with macro feature. the problem is that the lens does not focus at all except at very close distances (10 cm) even trying to move the mechanism that in theory disables the macro setting (sorry for my bad way of explaining but i'm not a native english speaker).\ni think i tried every combination to focus but in any case the \"infinite\" -----> position !!!  doesn't focus over 10 cm.\nis it the way that this lens works? is it not compatible with my camera even if the mount is still c/y? is it broken? \nany help would be appreciated, thank everyone that responds.", "sortedWord": "None", "identifyer": 48361, "year": "2021"}, {"Unnamed: 0": 253126, "autor": "markyymark13", "date": 1616951846000, "content": "Mirror gets stuck in up position on Yashica and Contax SLR /!/ I have a Contax 139 Q and a Yashica FX-3 Super 2000 and both of them have an issue where the mirror gets stuck in the up position after taking a shot. For the Contax it happens every few exposures whereas for the Yashica it happens every time and I need to shake the camera a bit to get it back down. Does anyone know if this is something I can easily fix myself or should I send it to service? (If its worth it). I'm a bit disappointed as the Yashica is in basically new condition and It didn't have this issue when i first got it a couple weeks ago, the moment I put a roll in it now this issue shows up.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mf585q/mirror_gets_stuck_in_up_position_on_yashica_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mirror gets stuck in up -----> position !!!  on yashica and contax slr /!/ i have a contax 139 q and a yashica fx-3 super 2000 and both of them have an issue where the mirror gets stuck in the up position after taking a shot. for the contax it happens every few exposures whereas for the yashica it happens every time and i need to shake the camera a bit to get it back down. does anyone know if this is something i can easily fix myself or should i send it to service? (if its worth it). i'm a bit disappointed as the yashica is in basically new condition and it didn't have this issue when i first got it a couple weeks ago, the moment i put a roll in it now this issue shows up.\n\nthanks!", "sortedWord": "None", "identifyer": 48499, "year": "2021"}, {"Unnamed: 0": 253599, "autor": "JBWD97", "date": 1622581367000, "content": "What to do with your work? Suggestion: Create a strict top 20 /!/ So I've seen a few posts where people ask what to do with their photos once they've got them back and admired them for a while. A common suggestion is a zine or project, which is definitely a great idea, but takes time and requires you to build up quite a body of work.\n\nSomething I've done over the past year is to create a top 20, with a strict one in one out policy. I've found this has been quite useful in a lot of ways, it's really helped me see how I've improved, it's let me see what I'm best at shooting as well as starting to give me a (very rough) idea of what my personal style might be. \n\nThe strict one in one out nature of it works quite nicely, initially if I took a good photo it was pretty likely to make it into the top 20, but now as I've improved I find myself really thinking each time I add one photo and remove another, which forces me to really analyse my work is a way I wouldn't normally.\n\nSo I suppose the short version is if you're not sure what to do with your work and aren't in a position to make it into a full project I'd recommend a strict top 20, you might find out something interesting about your own photography.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nq4jlu/what_to_do_with_your_work_suggestion_create_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what to do with your work? suggestion: create a strict top 20 /!/ so i've seen a few posts where people ask what to do with their photos once they've got them back and admired them for a while. a common suggestion is a zine or project, which is definitely a great idea, but takes time and requires you to build up quite a body of work.\n\nsomething i've done over the past year is to create a top 20, with a strict one in one out policy. i've found this has been quite useful in a lot of ways, it's really helped me see how i've improved, it's let me see what i'm best at shooting as well as starting to give me a (very rough) idea of what my personal style might be. \n\nthe strict one in one out nature of it works quite nicely, initially if i took a good photo it was pretty likely to make it into the top 20, but now as i've improved i find myself really thinking each time i add one photo and remove another, which forces me to really analyse my work is a way i wouldn't normally.\n\nso i suppose the short version is if you're not sure what to do with your work and aren't in a -----> position !!!  to make it into a full project i'd recommend a strict top 20, you might find out something interesting about your own photography.", "sortedWord": "None", "identifyer": 48973, "year": "2021"}, {"Unnamed: 0": 253613, "autor": "Aerogirl10", "date": 1622560782000, "content": "Kodak hiring - High School Co-op Manufacturing (USA - NY - Rochester ) /!/ Just randomly started researching about job at Kodak and found this one pretty interesting but I'm from outside US. Maybe anyone here would be interested :) \n\n19-May-2021\n\n[High School Co-op Manufacturing](https://sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=515&amp;siteid=251&amp;PageType=JobDetails&amp;jobid=1503906)\n\nUSA - NY - Rochester\n\nCo-op - Intern\n\nKodak is Hiring! We are looking for Manufacturing Co-ops to work on our Film Flow Team. The positions include operating pilot coating equipment, preparing chemicals in making vessels for delivery to processing equipment, and running large scale manufacturing equipment in a team-oriented environment. Job tasks can include material handling, chemical mixing, and interaction with film conveyance machinery. Darkroom conditions are possible. Work is performed in a co-operative environment requiring strict adherence to standard operating procedures, Health-Safety-Environmental requirements, and with high quality. Some jobs require working with chemicals. Requirements: Current High School Student Computer Proficiency Basic Math Skills Demonstrate continuous alertness, judgment, retention, and strong decision making Good Manual Dexterity Detail Orientated Team Player, Strong Interpersonal Skills Ability to lift 50 pounds Ability to obtain power industrial truck license at Kodak Good communication skills, both written and verbal. The ability to express one’s self clearly, read job related material, write effectively, and comprehend a variety of work requests. Employee must maintain a clean work area and operate in a safe manner at all times. Positions require walking, standing, and frequent lifting, carrying, pulling, pushing, and occasional awkward positions. Kodak3\n\n&amp;#x200B;\n\nTheirs internship informations look good. Many of you tried/applied/have opinion about? Seems to be pretty cool experience. Didn't find any \"experience\" reviews, tho.\n\nfound here:\n\n[https://sjobs.brassring.com/TGnewUI/Search/Home/Home?partnerid=515&amp;siteid=251#home](https://sjobs.brassring.com/TGnewUI/Search/Home/Home?partnerid=515&amp;siteid=251#home)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/npwf6q/kodak_hiring_high_school_coop_manufacturing_usa/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "kodak hiring - high school co-op manufacturing (usa - ny - rochester ) /!/ just randomly started researching about job at kodak and found this one pretty interesting but i'm from outside us. maybe anyone here would be interested :) \n\n19-may-2021\n\n[high school co-op manufacturing](https://sjobs.brassring.com/tgnewui/search/home/homewithpreload?partnerid=515&amp;siteid=251&amp;pagetype=jobdetails&amp;jobid=1503906)\n\nusa - ny - rochester\n\nco-op - intern\n\nkodak is hiring! we are looking for manufacturing co-ops to work on our film flow team. the -----> positions !!!  include operating pilot coating equipment, preparing chemicals in making vessels for delivery to processing equipment, and running large scale manufacturing equipment in a team-oriented environment. job tasks can include material handling, chemical mixing, and interaction with film conveyance machinery. darkroom conditions are possible. work is performed in a co-operative environment requiring strict adherence to standard operating procedures, health-safety-environmental requirements, and with high quality. some jobs require working with chemicals. requirements: current high school student computer proficiency basic math skills demonstrate continuous alertness, judgment, retention, and strong decision making good manual dexterity detail orientated team player, strong interpersonal skills ability to lift 50 pounds ability to obtain power industrial truck license at kodak good communication skills, both written and verbal. the ability to express one’s self clearly, read job related material, write effectively, and comprehend a variety of work requests. employee must maintain a clean work area and operate in a safe manner at all times. positions require walking, standing, and frequent lifting, carrying, pulling, pushing, and occasional awkward positions. kodak3\n\n&amp;#x200b;\n\ntheirs internship informations look good. many of you tried/applied/have opinion about? seems to be pretty cool experience. didn't find any \"experience\" reviews, tho.\n\nfound here:\n\n[https://sjobs.brassring.com/tgnewui/search/home/home?partnerid=515&amp;siteid=251#home](https://sjobs.brassring.com/tgnewui/search/home/home?partnerid=515&amp;siteid=251#home)", "sortedWord": "None", "identifyer": 48987, "year": "2021"}, {"Unnamed: 0": 254095, "autor": "juliusfuckit", "date": 1614358384000, "content": "Vivitar v3800n film will not advance (amount other problems) /!/ About 6 months ago I purchased a vivitar v3800n online under the assumption that it was functional (my fault for not asking I suppose), but when it arrived I noticed there were a number of things that were strange. I meant to return it, but in a classic move I put it aside and ✨ forgot ✨. It seems like a waste to simply get rid of it and was hoping to fix it up.\n      The main issue would be that the film advance lever will not move past halfway. I fear that forcing it to go any further will create even more problems. At first I thought maybe it was already advanced and simply needed a photo to be shot, but that doesn't work either. When I press the shutter release nothing happens. It moves up and down just fine, but the shutters refuse to open. \n     In addition to that I can not see through the viewfinder. The mirror is not extended down. Instead it sits snuggly against the top. When I try to push the mirror back down I can see through the viewfinder once more, but it will not stay down. Instead it feels as though there's a spring forcing it back up. \n     Finally both the self timer switch and field of depth preview level are completely loose and just swing around freely. There is a small lever on the side of the camera that will temporarily out the field of depth preview level back into position but after hitting the shutter release it will return back to being loose. \n     Are there too many problems here to fix? Is this a helpless cause? I'm really interested in what other people have to say. I have been shooting on film for the last few years and have fixed small issues before but never anything like this. Any advice would be fantastic. Please and thank you.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lt1v6v/vivitar_v3800n_film_will_not_advance_amount_other/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "vivitar v3800n film will not advance (amount other problems) /!/ about 6 months ago i purchased a vivitar v3800n online under the assumption that it was functional (my fault for not asking i suppose), but when it arrived i noticed there were a number of things that were strange. i meant to return it, but in a classic move i put it aside and ✨ forgot ✨. it seems like a waste to simply get rid of it and was hoping to fix it up.\n      the main issue would be that the film advance lever will not move past halfway. i fear that forcing it to go any further will create even more problems. at first i thought maybe it was already advanced and simply needed a photo to be shot, but that doesn't work either. when i press the shutter release nothing happens. it moves up and down just fine, but the shutters refuse to open. \n     in addition to that i can not see through the viewfinder. the mirror is not extended down. instead it sits snuggly against the top. when i try to push the mirror back down i can see through the viewfinder once more, but it will not stay down. instead it feels as though there's a spring forcing it back up. \n     finally both the self timer switch and field of depth preview level are completely loose and just swing around freely. there is a small lever on the side of the camera that will temporarily out the field of depth preview level back into -----> position !!!  but after hitting the shutter release it will return back to being loose. \n     are there too many problems here to fix? is this a helpless cause? i'm really interested in what other people have to say. i have been shooting on film for the last few years and have fixed small issues before but never anything like this. any advice would be fantastic. please and thank you.", "sortedWord": "None", "identifyer": 49474, "year": "2021"}, {"Unnamed: 0": 254484, "autor": "456c737465720a", "date": 1629049284000, "content": "Broken Pentax 6x7 viewfinder pins /!/ Hi folks! Unfortunately, both if the pins that fix the viewfinder's position in the body are  broken. Do you guys have any ideas where to source two if those withiut buying a broken body for spare parts? I'm living in Germany.\nThe TTL prism works okayish because it us ankered to the shutter speed dial, but the waistlevel-finder (wich i love) shifts back and forth all the time!\n\nThx for your help!\n\nThx for", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p4y0kx/broken_pentax_6x7_viewfinder_pins/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "broken pentax 6x7 viewfinder pins /!/ hi folks! unfortunately, both if the pins that fix the viewfinder's -----> position !!!  in the body are  broken. do you guys have any ideas where to source two if those withiut buying a broken body for spare parts? i'm living in germany.\nthe ttl prism works okayish because it us ankered to the shutter speed dial, but the waistlevel-finder (wich i love) shifts back and forth all the time!\n\nthx for your help!\n\nthx for", "sortedWord": "None", "identifyer": 49871, "year": "2021"}, {"Unnamed: 0": 254627, "autor": "gbaby32", "date": 1632103649000, "content": "Camera decisions /!/ I got a gifted a Canon AE-1 program with three lenses. Turns on the camera doesn’t fire and is “unfixable” according to the film repair shop I sent it to. Question is should I buy just the body of a canon because I have three lenses or just get something else I’m more interested in. I’m not sure the condition of the lenses because I can’t test them. They seem okay, maybe a little dust in them but nothing noticeably bad. But also won’t be able to tell till I take some photos with them which I currently can’t do. So if you were in my position would you get a new canon body or just go for a camera you might want more?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/prlhpe/camera_decisions/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera decisions /!/ i got a gifted a canon ae-1 program with three lenses. turns on the camera doesn’t fire and is “unfixable” according to the film repair shop i sent it to. question is should i buy just the body of a canon because i have three lenses or just get something else i’m more interested in. i’m not sure the condition of the lenses because i can’t test them. they seem okay, maybe a little dust in them but nothing noticeably bad. but also won’t be able to tell till i take some photos with them which i currently can’t do. so if you were in my -----> position !!!  would you get a new canon body or just go for a camera you might want more?", "sortedWord": "None", "identifyer": 15, "year": "2021"}, {"Unnamed: 0": 254641, "autor": "Xplode99", "date": 1632087006000, "content": "Mamiya Rb67 Pro S Stuck Cocking Lever /!/ Hi all, \n\nI recently wanted to delve into the medium format realm and ended up with what was described as a great condition Mamiya RB67 Pro S. The issue is that the cocking lever is stuck and will not budge (cannot fire it either). I have been trying to work with it for a week now, googling fixes and what not but nothing seems to work. I can take everything off the camera completely fine but the camera will still not fire. The lever is currently stuck in the upright position and will not move for anything I have tried so far. \n\nThe Issue:\n\n\\- Cannot cock the lever\n\n\\- Cannot fire the camera (the button depresses all the way)\n\n\\- Will not fire even when it has nothing on it\n\n\\- The mirror is in the down position (normal position)\n\n\\- Cable shutter releases or the mirror up function will not work either\n\n&amp;#x200B;\n\nIs it worth messing with this camera even further (taking it to a shop) or should I sell this one and look for a working one?\n\nhttps://preview.redd.it/xl3jkxt22jo71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=88b1eb84608b165f7e9586084d4ad959c157c919", "link": "https://www.reddit.com/r/AnalogCommunity/comments/prgyd8/mamiya_rb67_pro_s_stuck_cocking_lever/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya rb67 pro s stuck cocking lever /!/ hi all, \n\ni recently wanted to delve into the medium format realm and ended up with what was described as a great condition mamiya rb67 pro s. the issue is that the cocking lever is stuck and will not budge (cannot fire it either). i have been trying to work with it for a week now, googling fixes and what not but nothing seems to work. i can take everything off the camera completely fine but the camera will still not fire. the lever is currently stuck in the upright -----> position !!!  and will not move for anything i have tried so far. \n\nthe issue:\n\n\\- cannot cock the lever\n\n\\- cannot fire the camera (the button depresses all the way)\n\n\\- will not fire even when it has nothing on it\n\n\\- the mirror is in the down position (normal position)\n\n\\- cable shutter releases or the mirror up function will not work either\n\n&amp;#x200b;\n\nis it worth messing with this camera even further (taking it to a shop) or should i sell this one and look for a working one?\n\nhttps://preview.redd.it/xl3jkxt22jo71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=88b1eb84608b165f7e9586084d4ad959c157c919", "sortedWord": "None", "identifyer": 29, "year": "2021"}, {"Unnamed: 0": 254734, "autor": "Jamez_Dee", "date": 1635267477000, "content": "Canon AE-1 Mirror won't return after shutter /!/ Hi Reddit, \n\nI'm having issues with my Canon AE-1. When I fire the shutter, the mirror comes up, but won't return to it's original position. The only way I've found of correcting this is by pressing the battery test button, at which point the mirror returns to its position. \n\nI've tested the battery both in there camera and externally, as well as played with different shutter speeds all without result. \n\n&amp;#x200B;\n\nAny ideas?   \n\n\nThanks,", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qgaug6/canon_ae1_mirror_wont_return_after_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 mirror won't return after shutter /!/ hi reddit, \n\ni'm having issues with my canon ae-1. when i fire the shutter, the mirror comes up, but won't return to it's original -----> position !!! . the only way i've found of correcting this is by pressing the battery test button, at which point the mirror returns to its position. \n\ni've tested the battery both in there camera and externally, as well as played with different shutter speeds all without result. \n\n&amp;#x200b;\n\nany ideas?   \n\n\nthanks,", "sortedWord": "None", "identifyer": 122, "year": "2021"}, {"Unnamed: 0": 254789, "autor": "cabutwp", "date": 1615711639000, "content": "Pentax SV - M42 mount camera, sometimes mirror doesn't come back down and lens gets stuck after exposure /!/ Hi all,\n\nI recently purchased a Pentax SV with a Mamiya Sekor 50mm f2 I keep having a recurring problem, where sometimes after I take a photo, the mirror doesn't return to it's original position following its flip up and the lens gets stuck. When I try to twist the lens off, I can twist it for a bit before  I can't turn it anymore.\n\nIf I wind the film and take another exposure, usually the mirror will return to its place and the lens becomes unstuck but I hate essentially wasting exposures as I can't see through the viewfinder.\n\nDoes anyone know what could potentially be causing this and what I can do to fix it or if I need to take it to a shop?\n\nThank you in advance :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m4rk9g/pentax_sv_m42_mount_camera_sometimes_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax sv - m42 mount camera, sometimes mirror doesn't come back down and lens gets stuck after exposure /!/ hi all,\n\ni recently purchased a pentax sv with a mamiya sekor 50mm f2 i keep having a recurring problem, where sometimes after i take a photo, the mirror doesn't return to it's original -----> position !!!  following its flip up and the lens gets stuck. when i try to twist the lens off, i can twist it for a bit before  i can't turn it anymore.\n\nif i wind the film and take another exposure, usually the mirror will return to its place and the lens becomes unstuck but i hate essentially wasting exposures as i can't see through the viewfinder.\n\ndoes anyone know what could potentially be causing this and what i can do to fix it or if i need to take it to a shop?\n\nthank you in advance :)", "sortedWord": "None", "identifyer": 177, "year": "2021"}, {"Unnamed: 0": 254895, "autor": "akaSkyWolf", "date": 1630249086000, "content": "Camera that starts malfunctioning mid-roll, what to do? /!/ Hello,  \nI joined the analog family only recently, when I found some Zenit M42 cameras at my dead uncle's house.\n\nThe cameras had their problems, unfortunately, but to use those M42 lenses I went ahead and bought a couple of Spotmatic (F and II). I loaded my Spotmatic F with some Ilford HP5 and everything was hunky-dory, until yesterday.\n\nI'm at shot 11 / 36, when the mirror gets stuck in the upright position; I tried to snap another photo \"blindly\" and it went down again. At photo 13 / 36 it got stuck again, but this time I was able to get it down by banging the camera a little bit.\n\nWhat do you do when such things happens mid roll? Do you rewind the roll and call it a day? Do you try to finish it and then service the camera? I'm genuinely curious about what's the consensus here.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pdwrfo/camera_that_starts_malfunctioning_midroll_what_to/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera that starts malfunctioning mid-roll, what to do? /!/ hello,  \ni joined the analog family only recently, when i found some zenit m42 cameras at my dead uncle's house.\n\nthe cameras had their problems, unfortunately, but to use those m42 lenses i went ahead and bought a couple of spotmatic (f and ii). i loaded my spotmatic f with some ilford hp5 and everything was hunky-dory, until yesterday.\n\ni'm at shot 11 / 36, when the mirror gets stuck in the upright -----> position !!! ; i tried to snap another photo \"blindly\" and it went down again. at photo 13 / 36 it got stuck again, but this time i was able to get it down by banging the camera a little bit.\n\nwhat do you do when such things happens mid roll? do you rewind the roll and call it a day? do you try to finish it and then service the camera? i'm genuinely curious about what's the consensus here.", "sortedWord": "None", "identifyer": 284, "year": "2021"}, {"Unnamed: 0": 254908, "autor": "kakachuka", "date": 1630235565000, "content": "Is it safe to rewind film and put it back in the container? /!/ I loaded my canon AE-1 and am currently on the 0 position. Now I want to wind it back in and put the film back in the Container in hopes that the Airport would check it without x-raying it and potentially causing some problems. Is it safe to do that?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pdte4w/is_it_safe_to_rewind_film_and_put_it_back_in_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is it safe to rewind film and put it back in the container? /!/ i loaded my canon ae-1 and am currently on the 0 -----> position !!! . now i want to wind it back in and put the film back in the container in hopes that the airport would check it without x-raying it and potentially causing some problems. is it safe to do that?", "sortedWord": "None", "identifyer": 297, "year": "2021"}, {"Unnamed: 0": 254945, "autor": "Planet-Xerox", "date": 1630167817000, "content": "Problem with Nikon lens not springing back to set aperture /!/ Hey, I got a pretty good deal on a Nikon FA and lens but the catch is that the lens doesn't work properly. You can see in the video below that on other lenses when you move the pin that controls the aperture it springs back to position, but on this new one it does not.\n\nhttps://imgur.com/a/S8eoRRb\n\nThe blades move freely so I suspect there is a broken/loose spring inside but after taking apart the back of the lens I didn't find anything.\n\nI'm pretty handy so don't mind trying to fix it myself but I'm not sure if the problem is even with a spring, or how to disassemble it to fix it.I tried doing some googling but nothing I found was about this specific problem, so any help would be great! Thanks :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pdcv7x/problem_with_nikon_lens_not_springing_back_to_set/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "problem with nikon lens not springing back to set aperture /!/ hey, i got a pretty good deal on a nikon fa and lens but the catch is that the lens doesn't work properly. you can see in the video below that on other lenses when you move the pin that controls the aperture it springs back to -----> position !!! , but on this new one it does not.\n\nhttps://imgur.com/a/s8eorrb\n\nthe blades move freely so i suspect there is a broken/loose spring inside but after taking apart the back of the lens i didn't find anything.\n\ni'm pretty handy so don't mind trying to fix it myself but i'm not sure if the problem is even with a spring, or how to disassemble it to fix it.i tried doing some googling but nothing i found was about this specific problem, so any help would be great! thanks :)", "sortedWord": "None", "identifyer": 334, "year": "2021"}, {"Unnamed: 0": 255070, "autor": "gavimundo", "date": 1631284719000, "content": "Nikon FE - Light Meter Needle Not Moving, Auto Mode Seems OK /!/ I purchased a Nikon FE off eBay with known battery drain issues.  Upon inspection, I found that not only did batteries die in 48hrs, but the light meter needle doesn’t move.\n\nI found the battery drain was because the camera never turns off.  I disassembled and found the power contacts were not pivoting with the film advance lever, and were stuck in the on position. A bit of cleaning and lube and it’s working again, turning off as it should.  After re-assembly I found that the battery check switch doesn’t work, but that’s not a big deal to me and I don’t want to take the camera apart again just for this.\n\nDespite the on/off issue being solved, the needle is still not moving. The good news is that all shutter speeds work, and auto works as well (slow shutter in dark and fast in light, have not tested with film to determine light meter accuracy).  Thus, it’s a fully functional camera, just doesn’t tell you what shutter it is going to use when in auto.\n\nI compared this to my other, fully functional FE.  The good FE has the needle at “B” when powered off and bounces when the camera is shaken. The FE with inoperable needle has the needle sitting at the bottom of the range below B, and does not move when the camera shakes.\n\nSince the needle seemed otherwise broken, I removed the focusing screen and poked/pulled at it, and it seemed free to move.  It does not appear to be bent or stuck.\n\n Any tips for addressing this light meter needle issue, or is it likely a lost cause due to fried electronics, and I just use the camera as is without further surgery?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/plmcdu/nikon_fe_light_meter_needle_not_moving_auto_mode/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fe - light meter needle not moving, auto mode seems ok /!/ i purchased a nikon fe off ebay with known battery drain issues.  upon inspection, i found that not only did batteries die in 48hrs, but the light meter needle doesn’t move.\n\ni found the battery drain was because the camera never turns off.  i disassembled and found the power contacts were not pivoting with the film advance lever, and were stuck in the on -----> position !!! . a bit of cleaning and lube and it’s working again, turning off as it should.  after re-assembly i found that the battery check switch doesn’t work, but that’s not a big deal to me and i don’t want to take the camera apart again just for this.\n\ndespite the on/off issue being solved, the needle is still not moving. the good news is that all shutter speeds work, and auto works as well (slow shutter in dark and fast in light, have not tested with film to determine light meter accuracy).  thus, it’s a fully functional camera, just doesn’t tell you what shutter it is going to use when in auto.\n\ni compared this to my other, fully functional fe.  the good fe has the needle at “b” when powered off and bounces when the camera is shaken. the fe with inoperable needle has the needle sitting at the bottom of the range below b, and does not move when the camera shakes.\n\nsince the needle seemed otherwise broken, i removed the focusing screen and poked/pulled at it, and it seemed free to move.  it does not appear to be bent or stuck.\n\n any tips for addressing this light meter needle issue, or is it likely a lost cause due to fried electronics, and i just use the camera as is without further surgery?", "sortedWord": "None", "identifyer": 459, "year": "2021"}, {"Unnamed: 0": 255090, "autor": "ry_ta506", "date": 1632711549000, "content": "Looking for a reliable repair person, ideally as close to possible as NB, Canada (far east coast). /!/ To keep it brief, I have 3 cameras I have tried to repair and they are beyond my capabilities. Ideally I’d like to send it locally (within eastern Canada) due to shipping costs , but it’s more important to me I have the most reputable person fixing it. \n\nThe cameras in question:\n\nCanon AV-1 had a small metal item inside that appears to have snapped, and now I can’t advance the film, shoot, or anything. It’s different underneath than the other A bodies. This is a relatively uncommon camera, and despite being an A body it is very different underneath visually. Rewind button is in pressed down position. \n\nCanon A-1, similar problem to above but no snapped metal thing. This seems to be a somewhat common issue from what I’ve read. Meter still works, but I can’t advance, can’t fire the shutter, and can’t rewind. Rewind button is in pressed down position. \n\nPentax ME Super. Advance lever is loose and won’t advance. It’s not stuck like the others, just so loose it won’t work. \n\nI believe these are all top of camera repairs, which are too daunting for me right now. \n\nPlease recommend me some people.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pw8bdw/looking_for_a_reliable_repair_person_ideally_as/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for a reliable repair person, ideally as close to possible as nb, canada (far east coast). /!/ to keep it brief, i have 3 cameras i have tried to repair and they are beyond my capabilities. ideally i’d like to send it locally (within eastern canada) due to shipping costs , but it’s more important to me i have the most reputable person fixing it. \n\nthe cameras in question:\n\ncanon av-1 had a small metal item inside that appears to have snapped, and now i can’t advance the film, shoot, or anything. it’s different underneath than the other a bodies. this is a relatively uncommon camera, and despite being an a body it is very different underneath visually. rewind button is in pressed down -----> position !!! . \n\ncanon a-1, similar problem to above but no snapped metal thing. this seems to be a somewhat common issue from what i’ve read. meter still works, but i can’t advance, can’t fire the shutter, and can’t rewind. rewind button is in pressed down -----> position !!! . \n\npentax me super. advance lever is loose and won’t advance. it’s not stuck like the others, just so loose it won’t work. \n\ni believe these are all top of camera repairs, which are too daunting for me right now. \n\nplease recommend me some people.", "sortedWord": "None", "identifyer": 480, "year": "2021"}, {"Unnamed: 0": 255159, "autor": "A_Venger", "date": 1632592260000, "content": "Confessions: How much have you spent and what did you plan to spend? (1st GAS Anonymous meeting) /!/ I started film photography only a few months ago and planned to set aside 3k towards my first kit + scanning setup. I always had a running tab in my head that approximated how much I spent.   \n\n\nYesterday, I sat down and crunched out the numbers to see the real damage and it give me a real shock how much money I have gone over my proposed budget. Pretty much sobered me up and prevented me from yesterday's daily classifieds/fb marketplace/ebay search party.  \n\n\nI just want to hear from others in my position. How do you stay disciplined? Will be back to reply right after I finish checking eBay for a Nikon L3.............", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pvbwyt/confessions_how_much_have_you_spent_and_what_did/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "confessions: how much have you spent and what did you plan to spend? (1st gas anonymous meeting) /!/ i started film photography only a few months ago and planned to set aside 3k towards my first kit + scanning setup. i always had a running tab in my head that approximated how much i spent.   \n\n\nyesterday, i sat down and crunched out the numbers to see the real damage and it give me a real shock how much money i have gone over my proposed budget. pretty much sobered me up and prevented me from yesterday's daily classifieds/fb marketplace/ebay search party.  \n\n\ni just want to hear from others in my -----> position !!! . how do you stay disciplined? will be back to reply right after i finish checking ebay for a nikon l3.............", "sortedWord": "None", "identifyer": 550, "year": "2021"}, {"Unnamed: 0": 255279, "autor": "isawagoose", "date": 1634136576000, "content": "Nikon FM film advance lever problem /!/ I'm hoping this is something minor I can fix myself. The advance lever only goes to the on position and no further, as if the shutter is ready to fire, but the shutter button does nothing, as if the shutter was already fired.\n\nI've never had any issues with this camera, and this problem popped up suddenly for no obvious reason in the middle of shooting; the camera wasn't bumped or dropped or anything like that.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q7csry/nikon_fm_film_advance_lever_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fm film advance lever problem /!/ i'm hoping this is something minor i can fix myself. the advance lever only goes to the on -----> position !!!  and no further, as if the shutter is ready to fire, but the shutter button does nothing, as if the shutter was already fired.\n\ni've never had any issues with this camera, and this problem popped up suddenly for no obvious reason in the middle of shooting; the camera wasn't bumped or dropped or anything like that.", "sortedWord": "None", "identifyer": 677, "year": "2021"}, {"Unnamed: 0": 255591, "autor": "thesniper225", "date": 1626385121000, "content": "Sad newbie with Canon FTb problems /!/ 100% brand new to photography, but i put a new battery in my Canon FTB QL, the shutter speed needle in the light meter doesn't move, but when in on or off position and I lower my speed under 60 the needle begins to climb, once down to 8 the red indicator for being way to far out of wack shows up, even in the off position and ISO set to 400, or any film speed. Any opinions are welcomed lol.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ol2lhl/sad_newbie_with_canon_ftb_problems/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sad newbie with canon ftb problems /!/ 100% brand new to photography, but i put a new battery in my canon ftb ql, the shutter speed needle in the light meter doesn't move, but when in on or off -----> position !!!  and i lower my speed under 60 the needle begins to climb, once down to 8 the red indicator for being way to far out of wack shows up, even in the off -----> position !!!  and iso set to 400, or any film speed. any opinions are welcomed lol.", "sortedWord": "None", "identifyer": 996, "year": "2021"}, {"Unnamed: 0": 255678, "autor": "suckurmumyeboi", "date": 1627648250000, "content": "Olympus OM30 won’t shut off /!/ I bought an Olympus OM30 fairly recently and it came with a broken mode switch, I bought a new one and replaced it and it started working fine (it wouldn’t change from Auto mode before) but now the camera won’t turn off and when it is in the off position it still works in auto (the rest of the modes work fine like bulb and manual) does anyone have any idea on how to fix this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oujolf/olympus_om30_wont_shut_off/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "olympus om30 won’t shut off /!/ i bought an olympus om30 fairly recently and it came with a broken mode switch, i bought a new one and replaced it and it started working fine (it wouldn’t change from auto mode before) but now the camera won’t turn off and when it is in the off -----> position !!!  it still works in auto (the rest of the modes work fine like bulb and manual) does anyone have any idea on how to fix this?", "sortedWord": "None", "identifyer": 1085, "year": "2021"}, {"Unnamed: 0": 255948, "autor": "menofgrosserblood", "date": 1622897419000, "content": "Nikon EL - Thrifted. Broken? /!/ I have a cosmetically great Nikon EL that I’m trying to see if it will work. I’ve lifted the mirror and put in a battery. The meter now responds. \n\nI have a 50mm AIS lens. \n\nMy issue is that when I cock the lever and fire, the mirror gets out of the way... but never comes back down. \n\nI have to rotate the shutter speed dial to “1000” or “A” for the mirror to return to starting position. \n\nAny thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nsv290/nikon_el_thrifted_broken/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon el - thrifted. broken? /!/ i have a cosmetically great nikon el that i’m trying to see if it will work. i’ve lifted the mirror and put in a battery. the meter now responds. \n\ni have a 50mm ais lens. \n\nmy issue is that when i cock the lever and fire, the mirror gets out of the way... but never comes back down. \n\ni have to rotate the shutter speed dial to “1000” or “a” for the mirror to return to starting -----> position !!! . \n\nany thoughts?", "sortedWord": "None", "identifyer": 1356, "year": "2021"}, {"Unnamed: 0": 256361, "autor": "PrincePizza1", "date": 1624315238000, "content": "Nikon l35AF /!/ Hey!\n\nThe internal mechanism for the power switch in my l35af seems to have busted. I’ve disassembled the body, but I can’t quite figure out where it’s broken. \n\nThe power switch spins freely, while it should be locked in one of the two positions. This made me assume a small piece of plastic broke off, but I can’t quite figure it out. \n\nAnybody worked on one of these?\n\nThanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o57mrw/nikon_l35af/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "nikon l35af /!/ hey!\n\nthe internal mechanism for the power switch in my l35af seems to have busted. i’ve disassembled the body, but i can’t quite figure out where it’s broken. \n\nthe power switch spins freely, while it should be locked in one of the two -----> positions !!! . this made me assume a small piece of plastic broke off, but i can’t quite figure it out. \n\nanybody worked on one of these?\n\nthanks.", "sortedWord": "None", "identifyer": 1779, "year": "2021"}, {"Unnamed: 0": 256907, "autor": "Madkeen6", "date": 1630743294000, "content": "Minolta Autocord, shutter won't fire /!/ Hi all,\n\nWas just shooting some pictures this afternoon  and suddenly the shutter wouldn't fire, it's not in the locked position and the lever won't move forward or backward now.\n\nAny ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/phnlmd/minolta_autocord_shutter_wont_fire/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta autocord, shutter won't fire /!/ hi all,\n\nwas just shooting some pictures this afternoon  and suddenly the shutter wouldn't fire, it's not in the locked -----> position !!!  and the lever won't move forward or backward now.\n\nany ideas?", "sortedWord": "None", "identifyer": 2332, "year": "2021"}, {"Unnamed: 0": 256952, "autor": "pietershootsphotos", "date": 1630677154000, "content": "Canon AE-1 mirror stuck in up position, the problem is not with sticking, I checked that. It also won’t allow my film advance lever to wind any further? Any thoughts on how to repair?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ph5l96/canon_ae1_mirror_stuck_in_up_position_the_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 mirror stuck in up -----> position !!! , the problem is not with sticking, i checked that. it also won’t allow my film advance lever to wind any further? any thoughts on how to repair?", "sortedWord": "None", "identifyer": 2378, "year": "2021"}, {"Unnamed: 0": 256960, "autor": "g-cm", "date": 1630663844000, "content": "Newbie here, I think my reflex mirror is in the incorrect position and I don’t know how to fix it as it keeps springing back up??", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ph29jj/newbie_here_i_think_my_reflex_mirror_is_in_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "newbie here, i think my reflex mirror is in the incorrect -----> position !!!  and i don’t know how to fix it as it keeps springing back up??", "sortedWord": "None", "identifyer": 2386, "year": "2021"}, {"Unnamed: 0": 257207, "autor": "bigchikken", "date": 1628284040000, "content": "Minolta X-370 film advance lever not returning to ready position /!/ I can advance the film and it works, I just have to manually return the advancing mechanism to where it should be so I can fire the shutter from the bottom of the camera. It is getting less and less reliable. Is there anything I can do to fix it?\n\n[Here is a video](https://imgur.com/a/Xtddr0n)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ozflqq/minolta_x370_film_advance_lever_not_returning_to/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta x-370 film advance lever not returning to ready -----> position !!!  /!/ i can advance the film and it works, i just have to manually return the advancing mechanism to where it should be so i can fire the shutter from the bottom of the camera. it is getting less and less reliable. is there anything i can do to fix it?\n\n[here is a video](https://imgur.com/a/xtddr0n)", "sortedWord": "None", "identifyer": 2638, "year": "2021"}, {"Unnamed: 0": 257215, "autor": "DocSeneca", "date": 1628276553000, "content": "Pentax Spotmatic - Repair or return ? /!/ Hello, I recently bought a [Pentax Spotmatic](https://imgur.com/a/jvwVSjl) with a Takumar 55mm F1.8 and a 35mm F3.5 for about 100€ ( with a bag, flash, some filters,...). Already while testing it i saw that the mirror once got stuck in the up position ( leaving me blind for the next shot). I took it anyways and the seller proposed that he'd take it back if I had any issues with it and it wasn't working properly.\n\nThe mirror issue now keeps happening pretty constantly. I reached out to some local camera repair stores who told me that fixing that issue ( with a complete CLA) would be around 80-120€.\n\nI'm now wondering if it's worth it to pay all in all almost 200€ for that camera or if i should just give the Pentax back and get someting else for the price.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ozd7bg/pentax_spotmatic_repair_or_return/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax spotmatic - repair or return ? /!/ hello, i recently bought a [pentax spotmatic](https://imgur.com/a/jvwvsjl) with a takumar 55mm f1.8 and a 35mm f3.5 for about 100€ ( with a bag, flash, some filters,...). already while testing it i saw that the mirror once got stuck in the up -----> position !!!  ( leaving me blind for the next shot). i took it anyways and the seller proposed that he'd take it back if i had any issues with it and it wasn't working properly.\n\nthe mirror issue now keeps happening pretty constantly. i reached out to some local camera repair stores who told me that fixing that issue ( with a complete cla) would be around 80-120€.\n\ni'm now wondering if it's worth it to pay all in all almost 200€ for that camera or if i should just give the pentax back and get someting else for the price.", "sortedWord": "None", "identifyer": 2646, "year": "2021"}, {"Unnamed: 0": 257386, "autor": "-Nigredo-", "date": 1612452446000, "content": "Nikon F mirror issue /!/ Hi analogcommunity! I recently acquired a 'broken' nikon F which appears to be working besides one main issue. The mirror doesn't appear to revert to down position (which gives me a blank viewfinder) at certain shutter speeds. the 1/1000, 1/500 and 1/250 shutter speeds cause the mirror to go up and down fine. For the 1/125 and 1/60 the mirror goes up after the shot is taken but is stuck there. Winding the film to the next shot brings the shutter brings it back down. Anything less just leaves the shutter up. Any help would be appreciated regarding this.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lci1o3/nikon_f_mirror_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f mirror issue /!/ hi analogcommunity! i recently acquired a 'broken' nikon f which appears to be working besides one main issue. the mirror doesn't appear to revert to down -----> position !!!  (which gives me a blank viewfinder) at certain shutter speeds. the 1/1000, 1/500 and 1/250 shutter speeds cause the mirror to go up and down fine. for the 1/125 and 1/60 the mirror goes up after the shot is taken but is stuck there. winding the film to the next shot brings the shutter brings it back down. anything less just leaves the shutter up. any help would be appreciated regarding this.", "sortedWord": "None", "identifyer": 2823, "year": "2021"}, {"Unnamed: 0": 257601, "autor": "fiery_treehouse", "date": 1629514687000, "content": "With almost the same price, should I get a point and shoot (Pentax PC-500), or a cheap manual SLR (Seagull DF-2)? /!/ Heya, so I've been trying film photography for a while using a cheap \"reloadable disposable\" camera (a Skina SK-408, it's some unknown brand). I realised the thing has broken spool and so is looking for an upgrade. Buying something like a Nikon FM, Canon AE-1, or something like an Olympus Mju II is out of the question for me since the price for either one has been astronomically jacked up in my country, even the used ones are way expensive for me!\n\nI found two candidates: Pentax PC-500 and Seagull DF-2. And the greatest thing about them is that they're both old stock -- meaning that they're *sort of* new, with boxes and straps and everything!\n\nPros of the Pentax: it's a P&amp;S with self timer, flash, autofocus, and motorised mechanics. I kind of like the date function, but it's more of an extra than a necessity.\n\nPros of the Seagull: It's a Chinese brand SLR camera. Not as sophisticated as Canon AE-1 or Nikon FM, but it's an SLR. Has up to 1000 shutter speed and comes with a 28-70mm lens, but it has no light meter so things have to be completely manual. Compared to other (used) film SLRs, I feel like the price for it is a steal!\n\nFor the usage, well, I'm just doing it for hobby -- to get away from everyday life. I've had experience with photography in general (have shot for some weddings and parties with DSLRs) and have general knowledge for the technical stuff (e.g. shutter speed, f-stop, etc), so I feel using a manual isn't going to have a steep learning curve for me.\n\nWhich one would you get if you were in my position?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p8jow4/with_almost_the_same_price_should_i_get_a_point/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "with almost the same price, should i get a point and shoot (pentax pc-500), or a cheap manual slr (seagull df-2)? /!/ heya, so i've been trying film photography for a while using a cheap \"reloadable disposable\" camera (a skina sk-408, it's some unknown brand). i realised the thing has broken spool and so is looking for an upgrade. buying something like a nikon fm, canon ae-1, or something like an olympus mju ii is out of the question for me since the price for either one has been astronomically jacked up in my country, even the used ones are way expensive for me!\n\ni found two candidates: pentax pc-500 and seagull df-2. and the greatest thing about them is that they're both old stock -- meaning that they're *sort of* new, with boxes and straps and everything!\n\npros of the pentax: it's a p&amp;s with self timer, flash, autofocus, and motorised mechanics. i kind of like the date function, but it's more of an extra than a necessity.\n\npros of the seagull: it's a chinese brand slr camera. not as sophisticated as canon ae-1 or nikon fm, but it's an slr. has up to 1000 shutter speed and comes with a 28-70mm lens, but it has no light meter so things have to be completely manual. compared to other (used) film slrs, i feel like the price for it is a steal!\n\nfor the usage, well, i'm just doing it for hobby -- to get away from everyday life. i've had experience with photography in general (have shot for some weddings and parties with dslrs) and have general knowledge for the technical stuff (e.g. shutter speed, f-stop, etc), so i feel using a manual isn't going to have a steep learning curve for me.\n\nwhich one would you get if you were in my -----> position !!! ?", "sortedWord": "None", "identifyer": 3042, "year": "2021"}, {"Unnamed: 0": 257703, "autor": "lalashoots", "date": 1630019471000, "content": "Mirror stuck in \"up\" position on Pentax ZX-M /!/ New here and hoping this is an okay thing to post (apologies if not!)\n\nI've recently started tooling around with some of my old film cameras, one of them being a Pentax ZX-M. It worked fine about a week ago, and today when I went to put some film into it, I've discovered that the mirror is stuck in the up position. I've found a bunch of very old posts about this (unfortunately) being common, but nothing that really helps with a possible solution (I have tried changing the batteries.)\n\nShort of purchasing a new body, is there anything else I can try on my own that might be a fix? I have, in the meantime, asked a tech for a quote, I just don't have high hopes, as I know it's old and likely not worth the expense of repair. I've already been told by one outlet that they cannot service it. From what I've been reading, this camera is generally viewed as (to put it nicely) not so great, but it has a lot of sentimental value to me, and if I can get it working again, I'd really love to.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pcax5p/mirror_stuck_in_up_position_on_pentax_zxm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mirror stuck in \"up\" -----> position !!!  on pentax zx-m /!/ new here and hoping this is an okay thing to post (apologies if not!)\n\ni've recently started tooling around with some of my old film cameras, one of them being a pentax zx-m. it worked fine about a week ago, and today when i went to put some film into it, i've discovered that the mirror is stuck in the up position. i've found a bunch of very old posts about this (unfortunately) being common, but nothing that really helps with a possible solution (i have tried changing the batteries.)\n\nshort of purchasing a new body, is there anything else i can try on my own that might be a fix? i have, in the meantime, asked a tech for a quote, i just don't have high hopes, as i know it's old and likely not worth the expense of repair. i've already been told by one outlet that they cannot service it. from what i've been reading, this camera is generally viewed as (to put it nicely) not so great, but it has a lot of sentimental value to me, and if i can get it working again, i'd really love to.", "sortedWord": "None", "identifyer": 3145, "year": "2021"}, {"Unnamed: 0": 257812, "autor": "tom3456s", "date": 1631186092000, "content": "I got my first film camera today (Canon AE-1) with the fd 50mm 1.4 ssc, but I noticed the lever on the back for the aperture can be Locked in two positions, which one is the right for attaching to the camera?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pkvrlu/i_got_my_first_film_camera_today_canon_ae1_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i got my first film camera today (canon ae-1) with the fd 50mm 1.4 ssc, but i noticed the lever on the back for the aperture can be locked in two -----> positions !!! , which one is the right for attaching to the camera?", "sortedWord": "None", "identifyer": 3255, "year": "2021"}, {"Unnamed: 0": 257942, "autor": "frsguy", "date": 1632239763000, "content": "Zuiko 50/1.8 aperture issue? /!/ So I unearthed my mothers old olympus OM-20 in which I want to use to get into film. Kept in a plastic box and deep in a closet for almost 15 years its in near mint condition (well the outside). Paired with it is a sakar 135mm f2.8 and the Zuiko. However the last time I touched this I was a child and I cant remember if the Zuiko lens worked this way.\n\nWhen rotating the aperture on the lens the blades do not move until I depress the \"DoF preview button\" the lens. I cant for the life of me remember if it worked liked this or if the blades are getting stuck and only moving when I depress the \"DoF button\". When I first moved the aperture ring it took a little force to get it to the 1.8 position.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pslmn9/zuiko_5018_aperture_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "zuiko 50/1.8 aperture issue? /!/ so i unearthed my mothers old olympus om-20 in which i want to use to get into film. kept in a plastic box and deep in a closet for almost 15 years its in near mint condition (well the outside). paired with it is a sakar 135mm f2.8 and the zuiko. however the last time i touched this i was a child and i cant remember if the zuiko lens worked this way.\n\nwhen rotating the aperture on the lens the blades do not move until i depress the \"dof preview button\" the lens. i cant for the life of me remember if it worked liked this or if the blades are getting stuck and only moving when i depress the \"dof button\". when i first moved the aperture ring it took a little force to get it to the 1.8 -----> position !!! .", "sortedWord": "None", "identifyer": 3385, "year": "2021"}, {"Unnamed: 0": 258093, "autor": "padawan810", "date": 1633191298000, "content": "Composing picture with the tripod (need a piece of advice) /!/ Hi all,\n\nI hope all is well. I have a question and hope it's not a stupid question :D\n\nI'm usually taking street and landscape photos with my  Fuji GSW690III. I'm sometimes having an issue when I compose a picture that the top of the building (usually 3 floors buildings) or the object has been cut off in the viewfinder if the tripod is centred so, not risen or adjusted with position handle on a tripod (hope that makes sense).  When I rise my position handle on a tripod, of course, I'm able to have the subject in the frame and the object is not being cut off but I've noticed that it starts to look unnatural through the viewfinder like distorted or I'm just imagining it. Please share some tips if you have on composing landscape or architecture. Many Thanks!!! :))))", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pzy5u1/composing_picture_with_the_tripod_need_a_piece_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "composing picture with the tripod (need a piece of advice) /!/ hi all,\n\ni hope all is well. i have a question and hope it's not a stupid question :d\n\ni'm usually taking street and landscape photos with my  fuji gsw690iii. i'm sometimes having an issue when i compose a picture that the top of the building (usually 3 floors buildings) or the object has been cut off in the viewfinder if the tripod is centred so, not risen or adjusted with -----> position !!!  handle on a tripod (hope that makes sense).  when i rise my position handle on a tripod, of course, i'm able to have the subject in the frame and the object is not being cut off but i've noticed that it starts to look unnatural through the viewfinder like distorted or i'm just imagining it. please share some tips if you have on composing landscape or architecture. many thanks!!! :))))", "sortedWord": "None", "identifyer": 3539, "year": "2021"}, {"Unnamed: 0": 258313, "autor": "Scanding", "date": 1615370034000, "content": "Hey! I have an issue with my Smena 8M. The shutter cock doesn't lock once i get it into place to take a photo, it just goes back to its initial position once I take my finger off it. What should I do?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m1u3bu/hey_i_have_an_issue_with_my_smena_8m_the_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hey! i have an issue with my smena 8m. the shutter cock doesn't lock once i get it into place to take a photo, it just goes back to its initial -----> position !!!  once i take my finger off it. what should i do?", "sortedWord": "None", "identifyer": 3762, "year": "2021"}, {"Unnamed: 0": 258419, "autor": "nillich39", "date": 1633344890000, "content": "Film photography survey 2021 /!/ Hi everyone!\n\nI am a Ph.D. researcher in heritage studies, and the subject of my research is film photography or gelatin sliver process. My second master's was based upon the Fotokemika factory and film photographic industry, so I decided to make my doctoral research about film photography as I realized the rapid decline and disappearance of film photography in the world. Also, being an amateur photographer and very passionate about film photography, the type of photography that reminds me of my childhood and growing up, so I need to admit that I'm pretty nostalgic about it in the digital era. The goal of the project is to safeguard film photography, know-how knowledge in this type of photography and pronounce it as a world cultural heritage.\n\nOne of my methods in the research is a survey as the easiest way to try to reach a worldwide film photography community and get a diversity of answers from all around the world. This survey is designed for the users of film photography, as an integral part of my Ph.D. project 'Analog photography as tangible and intangible world heritage'. If you would please spare 9 minutes to answer the questions, I would truly appreciate it as it will significantly benefit my research. Your answers will contribute to the research to gain a better insight into the position of film photography in the 21st century.\n\n[https://forms.gle/XWRAzW47v47QcMhK8](https://forms.gle/XWRAzW47v47QcMhK8?fbclid=IwAR23kuskbll9TIc7TvAfivpzMsdqYfBAKrZM8_Tdt3NVTM1dP5E-abzwQE8)\n\nThank you in advance!\n\nNev", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q132uc/film_photography_survey_2021/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "film photography survey 2021 /!/ hi everyone!\n\ni am a ph.d. researcher in heritage studies, and the subject of my research is film photography or gelatin sliver process. my second master's was based upon the fotokemika factory and film photographic industry, so i decided to make my doctoral research about film photography as i realized the rapid decline and disappearance of film photography in the world. also, being an amateur photographer and very passionate about film photography, the type of photography that reminds me of my childhood and growing up, so i need to admit that i'm pretty nostalgic about it in the digital era. the goal of the project is to safeguard film photography, know-how knowledge in this type of photography and pronounce it as a world cultural heritage.\n\none of my methods in the research is a survey as the easiest way to try to reach a worldwide film photography community and get a diversity of answers from all around the world. this survey is designed for the users of film photography, as an integral part of my ph.d. project 'analog photography as tangible and intangible world heritage'. if you would please spare 9 minutes to answer the questions, i would truly appreciate it as it will significantly benefit my research. your answers will contribute to the research to gain a better insight into the -----> position !!!  of film photography in the 21st century.\n\n[https://forms.gle/xwrazw47v47qcmhk8](https://forms.gle/xwrazw47v47qcmhk8?fbclid=iwar23kuskbll9tic7tvafivpzmsdqyfbakrzm8_tdt3nvtm1dp5e-abzwqe8)\n\nthank you in advance!\n\nnev", "sortedWord": "None", "identifyer": 3869, "year": "2021"}, {"Unnamed: 0": 258549, "autor": "liun19", "date": 1633961129000, "content": "Fujifilm GF670 Play in Door /!/ I recently purchased a used Fujifilm GF670 and for the most part it works perfectly fine. However, I notice that the door has a very little bit of play in it when open. There is a spring that keeps it in a natural position where focus is accurate, but it will go very slightly out of focus if a small amount of pressure is applied to cause the door to swung out a little with the play. I'm not putting a lot of force on it, just what the tolerances of the door will allow, so don't freak out thinking I'm about to rip the door off the thing. I confirmed this through a test roll just FYI. Of course, I have no problem shooting the camera since it wants to sit in the right position anyway but I was wondering if this very little bit of play is normal or if it's something I should have checked out. Thanks in advance", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q5wlet/fujifilm_gf670_play_in_door/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fujifilm gf670 play in door /!/ i recently purchased a used fujifilm gf670 and for the most part it works perfectly fine. however, i notice that the door has a very little bit of play in it when open. there is a spring that keeps it in a natural -----> position !!!  where focus is accurate, but it will go very slightly out of focus if a small amount of pressure is applied to cause the door to swung out a little with the play. i'm not putting a lot of force on it, just what the tolerances of the door will allow, so don't freak out thinking i'm about to rip the door off the thing. i confirmed this through a test roll just fyi. of course, i have no problem shooting the camera since it wants to sit in the right position anyway but i was wondering if this very little bit of play is normal or if it's something i should have checked out. thanks in advance", "sortedWord": "None", "identifyer": 4000, "year": "2021"}, {"Unnamed: 0": 258572, "autor": "No-Appeal3617", "date": 1633921805000, "content": "Pentax k1000 shutter stuck /!/ So my Pentax k1000 shutter is only stuck when the camera is in the up right landscape position. It works perfectly fine for portrait positions. Any suggestions on how I can fix it/where I can send my camera in to fix it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q5mwzk/pentax_k1000_shutter_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax k1000 shutter stuck /!/ so my pentax k1000 shutter is only stuck when the camera is in the up right landscape -----> position !!! . it works perfectly fine for portrait positions. any suggestions on how i can fix it/where i can send my camera in to fix it.", "sortedWord": "None", "identifyer": 4023, "year": "2021"}, {"Unnamed: 0": 258720, "autor": "lionh3ad", "date": 1609866378000, "content": "OP/Tech USA Super Pro Connectors and Zenza Bronica S2A /!/ Hi everybody, I just want to share my experience and final results using OP/Tech's Super Pro connectors since I found it is not that easy to obtain compatibility informations on them over the internet and there is some confusion.\n\nI recently bought a Zenza Bronica S2A which unfortunately did not have the original shoulder strap in the kit. Since I usually use all my machines  holding them around my neck for safety, I started looking for a replacement. I learned quickly that the machine used a proprietary pressure heads that are currently no longer marketed: this obviously in theory restricts the use of only original shoulder straps which for this reason are sold used at very high prices. So I tried to understand if there could be a not too DIY alternative on the market. After a fairly intricate search for information, I decided to trust the few opinions found online and I bought the model B of OP/Tech USA pro connectors (those with a square hole to be clear) even if the model A is recommended on the manufacturer's website for Zenzas.\n\nThe hooks fit perfectly and are much safer than (at least to me) it seemed from the product photos. They consist of two parts: the first, that is the lower one, is the perforated one that must be inserted around the pin on the machine, while the second, that is the upper one, once positioned goes under the pin head to prevent it from accidentally coming out. To release the connector, it is just necessary to grab the two side tabs of the top and lift it, in order to free the head of the pin. To avoid unintentional lifting, just insert the plastic block that slides on the belt.\n\nSince I did not particularly trust the backpack-type buckle coupling (the machine, depending on the lens mounted, reaches about 2kg), instead of buying the complete kit with shoulder strap I bought these connectors and a standard shoulder strap without hooks. The belt of the connectors is wider than the one of normal shoulder straps, so it is possible as I did with a little imagination, to join the two pieces using the plastic loops and obtain a perfectly stable result. Alternatively, given that the connector belts are quite long if pulled to the maximum it is possible to join them using the included buckle and create a strap to be rolled for example around the wrist.\n\nI hope this can be useful for someone that is in my same situation. Feel free to ask for any other info!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kr2kk4/optech_usa_super_pro_connectors_and_zenza_bronica/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "op/tech usa super pro connectors and zenza bronica s2a /!/ hi everybody, i just want to share my experience and final results using op/tech's super pro connectors since i found it is not that easy to obtain compatibility informations on them over the internet and there is some confusion.\n\ni recently bought a zenza bronica s2a which unfortunately did not have the original shoulder strap in the kit. since i usually use all my machines  holding them around my neck for safety, i started looking for a replacement. i learned quickly that the machine used a proprietary pressure heads that are currently no longer marketed: this obviously in theory restricts the use of only original shoulder straps which for this reason are sold used at very high prices. so i tried to understand if there could be a not too diy alternative on the market. after a fairly intricate search for information, i decided to trust the few opinions found online and i bought the model b of op/tech usa pro connectors (those with a square hole to be clear) even if the model a is recommended on the manufacturer's website for zenzas.\n\nthe hooks fit perfectly and are much safer than (at least to me) it seemed from the product photos. they consist of two parts: the first, that is the lower one, is the perforated one that must be inserted around the pin on the machine, while the second, that is the upper one, once -----> positioned !!!  goes under the pin head to prevent it from accidentally coming out. to release the connector, it is just necessary to grab the two side tabs of the top and lift it, in order to free the head of the pin. to avoid unintentional lifting, just insert the plastic block that slides on the belt.\n\nsince i did not particularly trust the backpack-type buckle coupling (the machine, depending on the lens mounted, reaches about 2kg), instead of buying the complete kit with shoulder strap i bought these connectors and a standard shoulder strap without hooks. the belt of the connectors is wider than the one of normal shoulder straps, so it is possible as i did with a little imagination, to join the two pieces using the plastic loops and obtain a perfectly stable result. alternatively, given that the connector belts are quite long if pulled to the maximum it is possible to join them using the included buckle and create a strap to be rolled for example around the wrist.\n\ni hope this can be useful for someone that is in my same situation. feel free to ask for any other info!", "sortedWord": "None", "identifyer": 4172, "year": "2021"}, {"Unnamed: 0": 258964, "autor": "suckurmumyeboi", "date": 1625683551000, "content": "Olympus OM-30 won't turn off / battery door is loose? /!/ So i recently swapped the mode switch out on my olympus om30 since the previous switch had broken and it wouldn't go off auto mode, now the problem I have encountered seems to be that my camera will not turn off and when it is switched to the \"off\" position it will just stay in auto, when i move the switch to any of the other modes like bulb or manual or battery check they work as they should. Another problem i have encountered is that the battery door is quite loose and the bottom part moves slightly to the side when closed instead of remaining in its usual position, i have put a piece of duct tape in the way so it stays as it should but i would like to find a more permanent fix for this. Any help would be appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ofpalo/olympus_om30_wont_turn_off_battery_door_is_loose/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "olympus om-30 won't turn off / battery door is loose? /!/ so i recently swapped the mode switch out on my olympus om30 since the previous switch had broken and it wouldn't go off auto mode, now the problem i have encountered seems to be that my camera will not turn off and when it is switched to the \"off\" -----> position !!!  it will just stay in auto, when i move the switch to any of the other modes like bulb or manual or battery check they work as they should. another problem i have encountered is that the battery door is quite loose and the bottom part moves slightly to the side when closed instead of remaining in its usual position, i have put a piece of duct tape in the way so it stays as it should but i would like to find a more permanent fix for this. any help would be appreciated!", "sortedWord": "None", "identifyer": 4420, "year": "2021"}, {"Unnamed: 0": 259506, "autor": "The_Steampunk", "date": 1620255525000, "content": "A call to photographers and writers. My photographic journal, An Analog Odyssey, is about to publish its second physical edition this June and we're looking to expand our writer and photographer list. /!/ Hello everyone,  \n\n\nMy name is /u/the_steampunk or Patrick and I am the creator of a photographic journal called 'An Analog Odyssey' An Analog Odyssey is a [journal](https://www.nomadicaberrations.com/journal) published once a season as a physical print. This past March we published our first print edition ['Winter | 2021'](https://www.reddit.com/r/AnalogCommunity/comments/mce157/after_many_long_hours_and_late_nights_i_was_able/) and it was received quite well by the community here. A number of you reached out to me inquiring about being on future editions and so here we are. \n\nThe previous edition was just shy of 200 pages and had a ton of writing and photographs from creatives all around the globe and I hope to continue this trend with the spring edition. The sentiment or ethos of the journal is to document the human experience through the lens of film photography. In our last edition, we had journal entries on a wide variety of subjects ranging from drawing likeness to being an underground club DJ in Hong Kong to replacing memories of an ex-lover with new ones while going to the same places. The journal at its core acts as a community journal filled with photographs and writing from the heart. So if the subject matter is powerful enough to move you then it is likely appropriate for An Analog Odyssey.\n\nAs a full disclaimer, this is not a paid gig or position. This is a personal project that I put together for the love of the art. The journal generates very little money and as much as I would love to be able to pay everyone it isn't feasible for me to do so at this time. However, if you're interested in helping create a community project then please feel free to. As was the case with the last edition I sent copies of my magazine to photographers/writers who were on it who helped out the most. And at the very least I can offer all writers/photographers the magazine at the cost it cost for me to print. However, I just want to be upfront about this so that no one feels like they were misled. \n\nWe're planning on having our spring edition sent to our publisher by June 15th. This gives us a little more than a month to finish up this edition. If you're interested in submitting your writing and photographs for the journal please DM me with your email address here on Reddit or inquire in the comment section below. Thanks so much for your time and I look forward to working with you.   \n\n\nThanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n5t30h/a_call_to_photographers_and_writers_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a call to photographers and writers. my photographic journal, an analog odyssey, is about to publish its second physical edition this june and we're looking to expand our writer and photographer list. /!/ hello everyone,  \n\n\nmy name is /u/the_steampunk or patrick and i am the creator of a photographic journal called 'an analog odyssey' an analog odyssey is a [journal](https://www.nomadicaberrations.com/journal) published once a season as a physical print. this past march we published our first print edition ['winter | 2021'](https://www.reddit.com/r/analogcommunity/comments/mce157/after_many_long_hours_and_late_nights_i_was_able/) and it was received quite well by the community here. a number of you reached out to me inquiring about being on future editions and so here we are. \n\nthe previous edition was just shy of 200 pages and had a ton of writing and photographs from creatives all around the globe and i hope to continue this trend with the spring edition. the sentiment or ethos of the journal is to document the human experience through the lens of film photography. in our last edition, we had journal entries on a wide variety of subjects ranging from drawing likeness to being an underground club dj in hong kong to replacing memories of an ex-lover with new ones while going to the same places. the journal at its core acts as a community journal filled with photographs and writing from the heart. so if the subject matter is powerful enough to move you then it is likely appropriate for an analog odyssey.\n\nas a full disclaimer, this is not a paid gig or -----> position !!! . this is a personal project that i put together for the love of the art. the journal generates very little money and as much as i would love to be able to pay everyone it isn't feasible for me to do so at this time. however, if you're interested in helping create a community project then please feel free to. as was the case with the last edition i sent copies of my magazine to photographers/writers who were on it who helped out the most. and at the very least i can offer all writers/photographers the magazine at the cost it cost for me to print. however, i just want to be upfront about this so that no one feels like they were misled. \n\nwe're planning on having our spring edition sent to our publisher by june 15th. this gives us a little more than a month to finish up this edition. if you're interested in submitting your writing and photographs for the journal please dm me with your email address here on reddit or inquire in the comment section below. thanks so much for your time and i look forward to working with you.   \n\n\nthanks.", "sortedWord": "None", "identifyer": 4976, "year": "2021"}, {"Unnamed: 0": 259585, "autor": "H3nryKrinkle", "date": 1621992949000, "content": "Contax G1 not what described in listing - keep it, or get refund and find a different one? /!/ Just got a green label on ebay that overall seems to be functioning well, but had some problems the seller didn't identify so wouldnt have an issue getting a refund for. \n\n1)   I overlooked sadly but totally should have been mentioned in the ad, rather than \"perfect condition\", is the manual focus wheel cap is missing. It's just black. It still rotates, and can be put to it's proper position of AF, but aesthetically it's a bummer. Don't think I'll have a lot of luck finding a replacement cap, or if it's even easy to re-cap (side bar, if you know a solution to get a cap or if it can even be replaced, lmk!) \n\n2) film counter is fully bled, unreadable. This is on him because I asked specifically and he said no bleed, and didn't take any photos of the counter. \n\nLens is clean. Body cosmetically is clean. I paid $620 for body, 45mm f2, and the TLA140. What do you think?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nl5ace/contax_g1_not_what_described_in_listing_keep_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "contax g1 not what described in listing - keep it, or get refund and find a different one? /!/ just got a green label on ebay that overall seems to be functioning well, but had some problems the seller didn't identify so wouldnt have an issue getting a refund for. \n\n1)   i overlooked sadly but totally should have been mentioned in the ad, rather than \"perfect condition\", is the manual focus wheel cap is missing. it's just black. it still rotates, and can be put to it's proper -----> position !!!  of af, but aesthetically it's a bummer. don't think i'll have a lot of luck finding a replacement cap, or if it's even easy to re-cap (side bar, if you know a solution to get a cap or if it can even be replaced, lmk!) \n\n2) film counter is fully bled, unreadable. this is on him because i asked specifically and he said no bleed, and didn't take any photos of the counter. \n\nlens is clean. body cosmetically is clean. i paid $620 for body, 45mm f2, and the tla140. what do you think?", "sortedWord": "None", "identifyer": 5055, "year": "2021"}, {"Unnamed: 0": 259809, "autor": "stanwoodmusic", "date": 1619289978000, "content": "Issue with attaching EI film back to ETRSi body /!/ Just upgraded from a horribly beat-up ETRS to a keh.com BGN condition ETRSi.\n\nAlong with the body I ordered an EI film back (the newest of the film back types) in EX condition.\n\nWith my ETRS, when attaching the film back, there is a nice satisfying and reassuring click/pop sound and I never have to try very hard to get things aligned before applying pressure.\n\nWith my new body, there seems to be some alignment issues. The film back has to be positioned in a very particular way in order to attach. When it *does* attach, it just doesn't sound or feel right - there's sort of a disconcerting crunch to it and I notice that on the upper left side of the body the film back is not totally flush.\n\nIs something you've experienced? Should I worry?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mxq6hs/issue_with_attaching_ei_film_back_to_etrsi_body/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "issue with attaching ei film back to etrsi body /!/ just upgraded from a horribly beat-up etrs to a keh.com bgn condition etrsi.\n\nalong with the body i ordered an ei film back (the newest of the film back types) in ex condition.\n\nwith my etrs, when attaching the film back, there is a nice satisfying and reassuring click/pop sound and i never have to try very hard to get things aligned before applying pressure.\n\nwith my new body, there seems to be some alignment issues. the film back has to be -----> positioned !!!  in a very particular way in order to attach. when it *does* attach, it just doesn't sound or feel right - there's sort of a disconcerting crunch to it and i notice that on the upper left side of the body the film back is not totally flush.\n\nis something you've experienced? should i worry?", "sortedWord": "None", "identifyer": 5283, "year": "2021"}, {"Unnamed: 0": 259810, "autor": "diorlucas", "date": 1619289707000, "content": "Yashica MAT EM frank problema /!/ I bought this Yashica MAT EM that looks beautiful. I took it to the shop to get some cleaning and speed adjustment and it came back apparently fully working\nBut it seems like i have a winding problem. I found this forum discussion from a guy with the same problem, so I’m just going to copy and paste his explanation, since I think he managed to explain better than i would\n\n\n“I'm having sort of a problem with the crank. From \npictures 1-7 the crank has a really funky pattern. It cranks about 1/3 or 1/4 of the way and then I have to crank it \nback to the resting position, click the sutter button (it does not take a picture) and then crank it 1 full rotation, and \nthen crank it back 1 rotation. I am not quite sure if it is suppoed to do this but it still takes pictures.”\n\nThe only difference is that I don’t see this pattern, it looks like it happens “randomly”, though sometimes I can see that the frame number doesn’t look like it’s in the EXACT position it should be, sometimes a couple millimeters behind. \n\nThank you :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mxq34d/yashica_mat_em_frank_problema/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "yashica mat em frank problema /!/ i bought this yashica mat em that looks beautiful. i took it to the shop to get some cleaning and speed adjustment and it came back apparently fully working\nbut it seems like i have a winding problem. i found this forum discussion from a guy with the same problem, so i’m just going to copy and paste his explanation, since i think he managed to explain better than i would\n\n\n“i'm having sort of a problem with the crank. from \npictures 1-7 the crank has a really funky pattern. it cranks about 1/3 or 1/4 of the way and then i have to crank it \nback to the resting -----> position !!! , click the sutter button (it does not take a picture) and then crank it 1 full rotation, and \nthen crank it back 1 rotation. i am not quite sure if it is suppoed to do this but it still takes pictures.”\n\nthe only difference is that i don’t see this pattern, it looks like it happens “randomly”, though sometimes i can see that the frame number doesn’t look like it’s in the exact position it should be, sometimes a couple millimeters behind. \n\nthank you :)", "sortedWord": "None", "identifyer": 5284, "year": "2021"}, {"Unnamed: 0": 260117, "autor": "jared_krauss", "date": 1626271763000, "content": "Does anyone work in a museum or gallery as a digitization assistant/officer? /!/ Hiya!\n\nI’m hoping someone does this work and can reflect on this job offer for me. But others may have useful insight. \n\n\nI’ve been offered a position of Digitisation Assistant at a top museum in London with a huge photography collection, as well as other works. \n\nHowever, the salary is shockingly low. 16,800 for 28 hours over 4 days/week.\n\nSimultaneousl I’ve been internally recruited by the university I’m currently working for a permanent position, replacing my temporary contract as an Information Assistant (like lib asst). \n\n\nComparing Uni vs Museum\n\n•30 min walk vs 50 min train &amp; tube commute\n\n• 22 hrs over 3 days vs 28 hrs over 4\n\n•After pension and taxes &amp; commute: 1065 take home vs 985\n\n• equal pension and holiday\n\n• flexible working patterns and shift cover w/out using holiday vs no one to cover, any time off must be holiday or unpaid\n\n——-\n\nSo I know I’ll be offered the uni job, but it hasn’t been made formally.\n\nThe museum job I interviewed for in May. I was the reserve candidate. The woman they hired has put in her notice after 1 month. (Red flag?) They called yesterday and offered me the job. I asked for a formal offer. \n\nI want to negotiate with them, but I’m going to ask for nearly 45% more. And EVEN IF they agree to that, I’d want to come back to my university to give them a chance to beat the offer. But I’m not sure and I wouldn’t want to lose both options. \n\nI’d love to work at the museum, but I’m turning 31 in October. I can’t live off that wage and financially progress my life. \n\nAnd the library I work at is going to soon be home to one of the largest collections of Edward Muybridge’s work. And theres\n the potential for me to work with the archival team on that collection. \n\nAny advice would be appreciated.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ok54ad/does_anyone_work_in_a_museum_or_gallery_as_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "does anyone work in a museum or gallery as a digitization assistant/officer? /!/ hiya!\n\ni’m hoping someone does this work and can reflect on this job offer for me. but others may have useful insight. \n\n\ni’ve been offered a -----> position !!!  of digitisation assistant at a top museum in london with a huge photography collection, as well as other works. \n\nhowever, the salary is shockingly low. 16,800 for 28 hours over 4 days/week.\n\nsimultaneousl i’ve been internally recruited by the university i’m currently working for a permanent position, replacing my temporary contract as an information assistant (like lib asst). \n\n\ncomparing uni vs museum\n\n•30 min walk vs 50 min train &amp; tube commute\n\n• 22 hrs over 3 days vs 28 hrs over 4\n\n•after pension and taxes &amp; commute: 1065 take home vs 985\n\n• equal pension and holiday\n\n• flexible working patterns and shift cover w/out using holiday vs no one to cover, any time off must be holiday or unpaid\n\n——-\n\nso i know i’ll be offered the uni job, but it hasn’t been made formally.\n\nthe museum job i interviewed for in may. i was the reserve candidate. the woman they hired has put in her notice after 1 month. (red flag?) they called yesterday and offered me the job. i asked for a formal offer. \n\ni want to negotiate with them, but i’m going to ask for nearly 45% more. and even if they agree to that, i’d want to come back to my university to give them a chance to beat the offer. but i’m not sure and i wouldn’t want to lose both options. \n\ni’d love to work at the museum, but i’m turning 31 in october. i can’t live off that wage and financially progress my life. \n\nand the library i work at is going to soon be home to one of the largest collections of edward muybridge’s work. and theres\n the potential for me to work with the archival team on that collection. \n\nany advice would be appreciated.", "sortedWord": "None", "identifyer": 5597, "year": "2021"}, {"Unnamed: 0": 260149, "autor": "calinet6", "date": 1626201352000, "content": "Camera repair: Citizen MCX shutter on a Ricohflex Dia... uh, a little dinosaur head shaped part fell out /!/ If anyone knows where this goes, the self-timer stopped working without it. Oops.\n\n*Processing img egoozvrex0b71...*\n\n*Processing img ir87cwrex0b71...*\n\n*Processing img zi83oqhgx0b71...*\n\n&amp;#x200B;\n\n*Processing video toqbxgwmx0b71...*\n\nNot the end of the world if I can't fix it but thought I'd ask if anyone had any ideas.\n\n\\---\n\nWhy'd I have the shutter open in the first place? Trying to get to the aperture lever, which a) is the worst position for an aperture lever of all time, under the self-timer lever, painful to move. and b) broke off because of that. Any ideas for that problem I'm all ears, but I figure I'll have to remove the whole assembly and fashion a new one.\n\n*Processing img 79xuuocvx0b71...*\n\nOr I guess I'll just carry tweezers around with me.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ojluvn/camera_repair_citizen_mcx_shutter_on_a_ricohflex/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "camera repair: citizen mcx shutter on a ricohflex dia... uh, a little dinosaur head shaped part fell out /!/ if anyone knows where this goes, the self-timer stopped working without it. oops.\n\n*processing img egoozvrex0b71...*\n\n*processing img ir87cwrex0b71...*\n\n*processing img zi83oqhgx0b71...*\n\n&amp;#x200b;\n\n*processing video toqbxgwmx0b71...*\n\nnot the end of the world if i can't fix it but thought i'd ask if anyone had any ideas.\n\n\\---\n\nwhy'd i have the shutter open in the first place? trying to get to the aperture lever, which a) is the worst -----> position !!!  for an aperture lever of all time, under the self-timer lever, painful to move. and b) broke off because of that. any ideas for that problem i'm all ears, but i figure i'll have to remove the whole assembly and fashion a new one.\n\n*processing img 79xuuocvx0b71...*\n\nor i guess i'll just carry tweezers around with me.", "sortedWord": "None", "identifyer": 5629, "year": "2021"}, {"Unnamed: 0": 260378, "autor": "KosmicKarma828", "date": 1621466417000, "content": "Help! My new Hasselblad 500 C/M isn’t cooperating! /!/ Hey everyone! Complete newbie to the Hasselblad V system here. I just received a new (to me) 500 C/M that I purchased from the good gentleman Bellamy Hunt of Japan Camera Hunter. \n\nWhen the camera arrived, I noticed some problems immediately. I cannot mount the lens to my body, even though I’ve made sure to see that both the lens and body are cocked. My mirror is stuck in the locked up position, and I can’t crank the film advance at all. The body shutter will NOT fire.\n\nCan anyone help me? I’m just so excited to use my beautiful new camera, and this is discouraging! I’d be happy to provide photos. \n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ngkc22/help_my_new_hasselblad_500_cm_isnt_cooperating/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help! my new hasselblad 500 c/m isn’t cooperating! /!/ hey everyone! complete newbie to the hasselblad v system here. i just received a new (to me) 500 c/m that i purchased from the good gentleman bellamy hunt of japan camera hunter. \n\nwhen the camera arrived, i noticed some problems immediately. i cannot mount the lens to my body, even though i’ve made sure to see that both the lens and body are cocked. my mirror is stuck in the locked up -----> position !!! , and i can’t crank the film advance at all. the body shutter will not fire.\n\ncan anyone help me? i’m just so excited to use my beautiful new camera, and this is discouraging! i’d be happy to provide photos. \n\nthanks", "sortedWord": "None", "identifyer": 5860, "year": "2021"}, {"Unnamed: 0": 260889, "autor": "schoepy", "date": 1630610519000, "content": "Defective or dusty film scanner? /!/ Hello everyone, in the past 2 days, I've received 2 PrimeFilm XAs scanners. I had to return the first one because the feeder didn't want to accept film. The second one came today, the feeder is working normally, but I'm noticing scan lines right in the middle of photo. Here's an example (of course, please ignore the VueScan watermark): [https://imgur.com/a/zqmOrK7](https://imgur.com/a/zqmOrK7)\n\nThe scan line appears in the exact same middle position on all scans. I can confirm that line appears when using other scanning programs, on different negatives, after multiple scanner restarts, and after a firmware update. I can also confirm that the scan line does not appear in the negative - I also had the lab give me low-res scans and it's all clean. \n\nAny thoughts on a fix for this? I noticed a lot of information online about Epson flatbed scanners having this problem and the solution is to make sure the scanning area is clear of debris and dust. However, no idea how to one could \"dust\" these auto-feeder film scanners. \n\nThanks everyone for your help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pgorag/defective_or_dusty_film_scanner/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "defective or dusty film scanner? /!/ hello everyone, in the past 2 days, i've received 2 primefilm xas scanners. i had to return the first one because the feeder didn't want to accept film. the second one came today, the feeder is working normally, but i'm noticing scan lines right in the middle of photo. here's an example (of course, please ignore the vuescan watermark): [https://imgur.com/a/zqmork7](https://imgur.com/a/zqmork7)\n\nthe scan line appears in the exact same middle -----> position !!!  on all scans. i can confirm that line appears when using other scanning programs, on different negatives, after multiple scanner restarts, and after a firmware update. i can also confirm that the scan line does not appear in the negative - i also had the lab give me low-res scans and it's all clean. \n\nany thoughts on a fix for this? i noticed a lot of information online about epson flatbed scanners having this problem and the solution is to make sure the scanning area is clear of debris and dust. however, no idea how to one could \"dust\" these auto-feeder film scanners. \n\nthanks everyone for your help.", "sortedWord": "None", "identifyer": 6391, "year": "2021"}, {"Unnamed: 0": 260959, "autor": "rfix", "date": 1630475364000, "content": "My thoughts on the Olympus XA /!/ Background:\n\nPrior to getting the XA, I was lusting after a point and shoot not completely priced out of this world with manual overrides, such as the original Fujifilm Klasse and Contax TVS. Ultimately, I was drawn to the Olympus XA for a couple reasons. First, the aperture priority-only operation matched how I used my main film camera, the Nikon N80. Second, I'd never used a rangefinder and thought that was a cool feature for such a compact camera, and relatedly the idea of manual focus more generally seemed appealing because of my skepticism toward point and shoot AF systems. Third, the lens, both in reputation of quality and max 2.8 aperture both made it seem like a decent value relative to the going price. I paid \\~$120 for mine (sorry, more than $5, and not from a thrift store to boot).\n\nPros:\n\n* So compact (duh?). Not pocketable for me, but I certainly don't notice it while carrying around or dangling by the wrist strap\n* The lens lives up to its reputation. Definitely some vignetting at larger apertures (easy enough to fix in post if desired) but plenty sharp at f5.6 and beyond. For daytime shooting I pretty much keep it between f5.6 and f11.\n* Fast lens. with a max aperture of f2.8, combined with the lack of mirror, I have been able to shoot iso 200 film around sunset and into blue hour without too much worry.\n* Whisper quiet shutter. It's a small click, and that's it. Approaches silence with even just a bit of background noise.\n* Focus tab. The manual focus tab extends below the lens, allowing for a natural finger position to move it to the desired position. There's a nice distance indicator on top as well, for faster paced shooting with zone focus.\n* Manual film advance. Personally, I like this, as it reduces complexity and eliminates noise. If silence is paramount for your shooting situation, you can simply take your shot, step away, and advance the film.\n* Viewfinder shutter speed needle. I love that the shutter speed selected by the camera is displayed in the viewfinder, compared to the less informative 1, 2, or 3 light system used by many other fixed lens rangefinders or point and shoots.\n* Manual ISO/exposure comp. The ISO setting is readily accessible just above the focus tab, and it quickly came naturally to me to use it for exposure compensation. E.g., shooting Colorplus 200 in a high contrast scene, I will often move the ISO down to 100. It was as I was writing this section that I realized I'd never used the dedicated +1.5 backlight setting. Whoops! I've always gone to the ISO out of habit, I guess.\n* Metering accuracy. The meter is quite capable, though as a safeguard, I will preemptively add +1 exposure comp (see above) if I know I'll be shooting in higher contrast conditions.\n\nCons:\n\n* Inconsistent frame spacing. Something I've noticed (with my camera at least) is that compared to my N80, the frame spacing is much less predictable frame to frame. Small nit, but one nonetheless.\n* Rangefinder pet peeves. Depending on lighting, the rangefinder window can be dim to non-existent, sometimes necessitating pointing in a different direction and focusing on something similarly close as the intended subject.\n* The shutter button is flush. The shutter does not really protrude from the camera, and occasionally I will be forced to fumble around for it if my eye is up to the viewfinder.\n* Tight viewfinder. As a glasses wearer, I find myself looking around the viewfinder at different angles to assess framing (which I'm aware is an estimate, even for the best in class rangefinder viewfinders). Kind of annoying sometimes.\n* Sometimes too compact. Especially in the beginning, for shooting in portrait orientation I found the edge of my finger slipping into the very top of a handful of the frames. I've become more adept at holding the camera so my fingers are pulled up and out of the way, and not out in front of the lens.\n\nNote: I have never even tested the flash that came with it, so can't comment on that.\n\nOverall, I really enjoy using this camera. Despite its faults, it's generally a joy to use and has definitely satisfied my desire for an advanced point and shoot. If (when?) it dies I will seriously consider getting another one.\n\nExample shots: [1](https://i.redd.it/mxbl0p9co8i71.jpg), [2](https://i.redd.it/syuazf3r4kh71.jpg), [3](https://i.redd.it/ih7ol7f038g71.jpg), [4](https://i.redd.it/2yi216pbh2a71.jpg), [5](https://i.redd.it/kus7dp7bap971.png), [6](https://i.redd.it/cdi7cqfo4z071.jpg), [7](https://i.redd.it/zl8jmfm897z61.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pfnmqf/my_thoughts_on_the_olympus_xa/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my thoughts on the olympus xa /!/ background:\n\nprior to getting the xa, i was lusting after a point and shoot not completely priced out of this world with manual overrides, such as the original fujifilm klasse and contax tvs. ultimately, i was drawn to the olympus xa for a couple reasons. first, the aperture priority-only operation matched how i used my main film camera, the nikon n80. second, i'd never used a rangefinder and thought that was a cool feature for such a compact camera, and relatedly the idea of manual focus more generally seemed appealing because of my skepticism toward point and shoot af systems. third, the lens, both in reputation of quality and max 2.8 aperture both made it seem like a decent value relative to the going price. i paid \\~$120 for mine (sorry, more than $5, and not from a thrift store to boot).\n\npros:\n\n* so compact (duh?). not pocketable for me, but i certainly don't notice it while carrying around or dangling by the wrist strap\n* the lens lives up to its reputation. definitely some vignetting at larger apertures (easy enough to fix in post if desired) but plenty sharp at f5.6 and beyond. for daytime shooting i pretty much keep it between f5.6 and f11.\n* fast lens. with a max aperture of f2.8, combined with the lack of mirror, i have been able to shoot iso 200 film around sunset and into blue hour without too much worry.\n* whisper quiet shutter. it's a small click, and that's it. approaches silence with even just a bit of background noise.\n* focus tab. the manual focus tab extends below the lens, allowing for a natural finger -----> position !!!  to move it to the desired -----> position !!! . there's a nice distance indicator on top as well, for faster paced shooting with zone focus.\n* manual film advance. personally, i like this, as it reduces complexity and eliminates noise. if silence is paramount for your shooting situation, you can simply take your shot, step away, and advance the film.\n* viewfinder shutter speed needle. i love that the shutter speed selected by the camera is displayed in the viewfinder, compared to the less informative 1, 2, or 3 light system used by many other fixed lens rangefinders or point and shoots.\n* manual iso/exposure comp. the iso setting is readily accessible just above the focus tab, and it quickly came naturally to me to use it for exposure compensation. e.g., shooting colorplus 200 in a high contrast scene, i will often move the iso down to 100. it was as i was writing this section that i realized i'd never used the dedicated +1.5 backlight setting. whoops! i've always gone to the iso out of habit, i guess.\n* metering accuracy. the meter is quite capable, though as a safeguard, i will preemptively add +1 exposure comp (see above) if i know i'll be shooting in higher contrast conditions.\n\ncons:\n\n* inconsistent frame spacing. something i've noticed (with my camera at least) is that compared to my n80, the frame spacing is much less predictable frame to frame. small nit, but one nonetheless.\n* rangefinder pet peeves. depending on lighting, the rangefinder window can be dim to non-existent, sometimes necessitating pointing in a different direction and focusing on something similarly close as the intended subject.\n* the shutter button is flush. the shutter does not really protrude from the camera, and occasionally i will be forced to fumble around for it if my eye is up to the viewfinder.\n* tight viewfinder. as a glasses wearer, i find myself looking around the viewfinder at different angles to assess framing (which i'm aware is an estimate, even for the best in class rangefinder viewfinders). kind of annoying sometimes.\n* sometimes too compact. especially in the beginning, for shooting in portrait orientation i found the edge of my finger slipping into the very top of a handful of the frames. i've become more adept at holding the camera so my fingers are pulled up and out of the way, and not out in front of the lens.\n\nnote: i have never even tested the flash that came with it, so can't comment on that.\n\noverall, i really enjoy using this camera. despite its faults, it's generally a joy to use and has definitely satisfied my desire for an advanced point and shoot. if (when?) it dies i will seriously consider getting another one.\n\nexample shots: [1](https://i.redd.it/mxbl0p9co8i71.jpg), [2](https://i.redd.it/syuazf3r4kh71.jpg), [3](https://i.redd.it/ih7ol7f038g71.jpg), [4](https://i.redd.it/2yi216pbh2a71.jpg), [5](https://i.redd.it/kus7dp7bap971.png), [6](https://i.redd.it/cdi7cqfo4z071.jpg), [7](https://i.redd.it/zl8jmfm897z61.jpg)", "sortedWord": "None", "identifyer": 6461, "year": "2021"}, {"Unnamed: 0": 260973, "autor": "Oskarlido", "date": 1628159660000, "content": "Mamiya 645 Super frame advance problem /!/ I just got a Mamiya 645 Super, put a roll of film through it and got it developed. Unfortunately the results weren’t as good as I’d hoped. \n\nI have an issue where the frame counter on the back doesn’t progress from the S position. In the empty back i can wind the frame counter gear by hand, so it isn’t stuck. At first I was worried that the film wasn’t being advanced at all, but the knob on the side moved, so I continued shooting and counted the frames manually. \n\nWhen i got the film back it was only exposed with 9 and a half shots with increasingly large spaces between. Between the last few frames you could have fitted a whole other frame. \n\nI used the power winder for most of my shots, and the batteries in it might be old, could this be an explanation? Or is it an issue with the body itself? \n\nHas anyone experienced anything similar? If so, how could you fix this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oyeugr/mamiya_645_super_frame_advance_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 645 super frame advance problem /!/ i just got a mamiya 645 super, put a roll of film through it and got it developed. unfortunately the results weren’t as good as i’d hoped. \n\ni have an issue where the frame counter on the back doesn’t progress from the s -----> position !!! . in the empty back i can wind the frame counter gear by hand, so it isn’t stuck. at first i was worried that the film wasn’t being advanced at all, but the knob on the side moved, so i continued shooting and counted the frames manually. \n\nwhen i got the film back it was only exposed with 9 and a half shots with increasingly large spaces between. between the last few frames you could have fitted a whole other frame. \n\ni used the power winder for most of my shots, and the batteries in it might be old, could this be an explanation? or is it an issue with the body itself? \n\nhas anyone experienced anything similar? if so, how could you fix this?", "sortedWord": "None", "identifyer": 6476, "year": "2021"}, {"Unnamed: 0": 261120, "autor": "crescal", "date": 1629817715000, "content": "Quick question on Minolta Autocord's film crank /!/ Hi, just got myself a Minolta Autocord. It seems that the film crank is not aligned to its rest position (top of the camera). After I advanced the film and cocked the shutter, the crank is locked at the bottom (just opposite to its supposed rest position). \n\nDid i do anything wrong or does it need a repair?\n\nAny advice would be appreciated. Thanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pap7wp/quick_question_on_minolta_autocords_film_crank/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "quick question on minolta autocord's film crank /!/ hi, just got myself a minolta autocord. it seems that the film crank is not aligned to its rest -----> position !!!  (top of the camera). after i advanced the film and cocked the shutter, the crank is locked at the bottom (just opposite to its supposed rest position). \n\ndid i do anything wrong or does it need a repair?\n\nany advice would be appreciated. thanks.", "sortedWord": "None", "identifyer": 6625, "year": "2021"}, {"Unnamed: 0": 261133, "autor": "Eulenspieler", "date": 1629801782000, "content": "A1 acting weird /!/ Hey guys, I've been experiencing some weirdness with my A1. It delivers perfect results at the moment, but I'm worried that not fixing some issue now might result in a total breakdown down the line. These issues all seem unrelated to me, but maybe they all stem from the same source. Perhaps someone has some insight and can help :)\nOff the top of my head:\n\n\n-The exposure lock button near the objective doesn't lock the values at all, full-press or not. Both buttons just light up the meter in the viewfinder.\n\n\n-Firing the camera causes a shutter-squeak like sound. I tried to lube the corresponding mechanism through the bottom, but that hasn't helped.\n\n\n-Every third or so exposure, the mirror remains in its flipped up position. Winding to the next frame causes it to drop down again.\n\n\n-When shooting with my 50mm 1.4, the aperture blades shut, but don't reopen after the shot. Winding to the next frame opens the blades slowly. This problem does not exist when using a 28mm objective, its aperture opens again after the shot. I don't know if that problem is with the camera or the objective.\n\n\nI'd appreciate any input, so if anyone has any clue as to what might be causing these weird behaviors that would be great :D", "link": "https://www.reddit.com/r/AnalogCommunity/comments/paktai/a1_acting_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a1 acting weird /!/ hey guys, i've been experiencing some weirdness with my a1. it delivers perfect results at the moment, but i'm worried that not fixing some issue now might result in a total breakdown down the line. these issues all seem unrelated to me, but maybe they all stem from the same source. perhaps someone has some insight and can help :)\noff the top of my head:\n\n\n-the exposure lock button near the objective doesn't lock the values at all, full-press or not. both buttons just light up the meter in the viewfinder.\n\n\n-firing the camera causes a shutter-squeak like sound. i tried to lube the corresponding mechanism through the bottom, but that hasn't helped.\n\n\n-every third or so exposure, the mirror remains in its flipped up -----> position !!! . winding to the next frame causes it to drop down again.\n\n\n-when shooting with my 50mm 1.4, the aperture blades shut, but don't reopen after the shot. winding to the next frame opens the blades slowly. this problem does not exist when using a 28mm objective, its aperture opens again after the shot. i don't know if that problem is with the camera or the objective.\n\n\ni'd appreciate any input, so if anyone has any clue as to what might be causing these weird behaviors that would be great :d", "sortedWord": "None", "identifyer": 6638, "year": "2021"}, {"Unnamed: 0": 261207, "autor": "ac-creative", "date": 1629327518000, "content": "this Pentax Spotmatic has some issues /!/ So I’m hoping someone can help me, I got this Pentax Spotmatic off eBay which I was super excited for but it’s got some problem.\n\nFirstly, the battery door seems to be stuck underneath the bottom plate, at first I thought the button was so damaged in the dent that it couldn’t be extracted but it does have some give just until a certain point. \n\nI want to know whether it is it okay to take the bottom plate off and reattach it? I’m hoping on the other side is an easy fix, perhaps a case of unscrewing the button from that end? Any ideas on the best solution? \n\nAlso more of a minor annoyance, when I push the film advancer, it does go back to the original position like I would expect it too, am I correct that is an issue? Pretty sure I can get by if it is, just good to know \n\nThank you in advance", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p72ebi/this_pentax_spotmatic_has_some_issues/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this pentax spotmatic has some issues /!/ so i’m hoping someone can help me, i got this pentax spotmatic off ebay which i was super excited for but it’s got some problem.\n\nfirstly, the battery door seems to be stuck underneath the bottom plate, at first i thought the button was so damaged in the dent that it couldn’t be extracted but it does have some give just until a certain point. \n\ni want to know whether it is it okay to take the bottom plate off and reattach it? i’m hoping on the other side is an easy fix, perhaps a case of unscrewing the button from that end? any ideas on the best solution? \n\nalso more of a minor annoyance, when i push the film advancer, it does go back to the original -----> position !!!  like i would expect it too, am i correct that is an issue? pretty sure i can get by if it is, just good to know \n\nthank you in advance", "sortedWord": "None", "identifyer": 6713, "year": "2021"}, {"Unnamed: 0": 261676, "autor": "bad_user__name", "date": 1612825776000, "content": "Pentax Spotmatic Jammed Shutter Button /!/ I'm not sure if this is best place for repair questions, but here I am. My Spotmatic's shutter button is currently jammed in the down position. It used to be jammed up, but I pushed down on it to see what would happen, it got stuck all the way down. There is quite a lot of built up gunk around the button too. If someone could tell me what might be wrong and give me some advice on fixing it, I would be very grateful. Thank you.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lfokgc/pentax_spotmatic_jammed_shutter_button/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax spotmatic jammed shutter button /!/ i'm not sure if this is best place for repair questions, but here i am. my spotmatic's shutter button is currently jammed in the down -----> position !!! . it used to be jammed up, but i pushed down on it to see what would happen, it got stuck all the way down. there is quite a lot of built up gunk around the button too. if someone could tell me what might be wrong and give me some advice on fixing it, i would be very grateful. thank you.", "sortedWord": "None", "identifyer": 7191, "year": "2021"}, {"Unnamed: 0": 261848, "autor": "gavimundo", "date": 1631025629000, "content": "Nikon FE Always On - Repair Advice /!/ I purchased a Nikon FE through ebay with a known battery drain issue, where a fresh pair are dead within a couple days.  My hope was that I do one of the quick fixes and hope for a usable camera - remove bottom cover, blow out any dust, hopefully fixed.\n\nI received the camera and found that the battery drain was NOT solved by the common fix.  It seems  that the camera never turn offs.  Two clues are a) the shutter can be pressed with the film advance lever in the \"off\" position, and b) resistance between battery terminal and baseplate is \\~13kOhm regardless of on or off position of film advance lever.  The easiest way to tell if it's never turning off would be to look at the light meter, but it appears to be dead and the needle is always at the bottom.\n\nAdditional note: Shutter seems to fire correctly at all shutter speed dial positions, INCLUDING auto.\n\nAny ideas how to fix the on/off function of the film advance lever?\n\nIs there any chance fixing the power switch will also revive the light meter, or is that probably fried?\n\nThe good news is that, if I can fix the battery drain issue, then this becomes a fairly usable camera (just probably no exposure feedback).", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pjod9c/nikon_fe_always_on_repair_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fe always on - repair advice /!/ i purchased a nikon fe through ebay with a known battery drain issue, where a fresh pair are dead within a couple days.  my hope was that i do one of the quick fixes and hope for a usable camera - remove bottom cover, blow out any dust, hopefully fixed.\n\ni received the camera and found that the battery drain was not solved by the common fix.  it seems  that the camera never turn offs.  two clues are a) the shutter can be pressed with the film advance lever in the \"off\" -----> position !!! , and b) resistance between battery terminal and baseplate is \\~13kohm regardless of on or off -----> position !!!  of film advance lever.  the easiest way to tell if it's never turning off would be to look at the light meter, but it appears to be dead and the needle is always at the bottom.\n\nadditional note: shutter seems to fire correctly at all shutter speed dial positions, including auto.\n\nany ideas how to fix the on/off function of the film advance lever?\n\nis there any chance fixing the power switch will also revive the light meter, or is that probably fried?\n\nthe good news is that, if i can fix the battery drain issue, then this becomes a fairly usable camera (just probably no exposure feedback).", "sortedWord": "None", "identifyer": 7365, "year": "2021"}, {"Unnamed: 0": 261904, "autor": "amontpetit", "date": 1633283425000, "content": "Light meter issue with hand-me-down Canonet /!/ I got myself a Canonet 28. Getting used to the rangefinder focusing, but have a bit of a bigger issue: the light meter is acting rather strangely. I got a brand new battery for it and, with the camera set to Auto Aperture, the light meter works, but bounces around a lot and sometimes the needle just drops dead. In any other aperture position, the needle drops dead to the bottom of the SS indicator in the viewfinder and won't move. Is this normal? \n\nThe camera operates and runs perfectly, I just dont know how it's exposing/finding it's light reading.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q0mv0q/light_meter_issue_with_handmedown_canonet/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "light meter issue with hand-me-down canonet /!/ i got myself a canonet 28. getting used to the rangefinder focusing, but have a bit of a bigger issue: the light meter is acting rather strangely. i got a brand new battery for it and, with the camera set to auto aperture, the light meter works, but bounces around a lot and sometimes the needle just drops dead. in any other aperture -----> position !!! , the needle drops dead to the bottom of the ss indicator in the viewfinder and won't move. is this normal? \n\nthe camera operates and runs perfectly, i just dont know how it's exposing/finding it's light reading.", "sortedWord": "None", "identifyer": 7424, "year": "2021"}, {"Unnamed: 0": 262002, "autor": "tkay7309", "date": 1609727648000, "content": "Does the 'A' position on the aperture ring mean automatic?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kpz63y/does_the_a_position_on_the_aperture_ring_mean/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "does the 'a' -----> position !!!  on the aperture ring mean automatic?", "sortedWord": "None", "identifyer": 7532, "year": "2021"}, {"Unnamed: 0": 262245, "autor": "slothnip", "date": 1610746849000, "content": "Mamiya 7ii - Replacement Battery Cover Cap /!/ After recently accidentally break the plastic cap on the battery cover on my Mamiya 7ii, I had to look into getting a replacement. \n\nAfter scouring various forums and message board, including some film communities here on Reddit, along with eBay, apparently my only option was to get one from one of the local camera repair shops here in London. \n\nI’ve used them for repairs on some film cameras in the past, and while they do good work, they charge through the nose for it. And in true form, they expected just shy of £100 for a replacement battery cover. \n\n3D printing to the rescue. \n\nHad a mate who’s a dab hand with CAD and 3D printing to knock together a replacement cap and I’ve just fitted it and it works perfectly. He printed off a bunch of them for me and has also provided the CAD file, so I’m posting here just in case anyone else finds themselves in the same position and finds this post. Shoot me a DM if you need a replacement too - happy to post one if you’re in the UK/Europe, or can send the CAD file for you to print it yourself.\n\n🤙🏼", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ky4l6f/mamiya_7ii_replacement_battery_cover_cap/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 7ii - replacement battery cover cap /!/ after recently accidentally break the plastic cap on the battery cover on my mamiya 7ii, i had to look into getting a replacement. \n\nafter scouring various forums and message board, including some film communities here on reddit, along with ebay, apparently my only option was to get one from one of the local camera repair shops here in london. \n\ni’ve used them for repairs on some film cameras in the past, and while they do good work, they charge through the nose for it. and in true form, they expected just shy of £100 for a replacement battery cover. \n\n3d printing to the rescue. \n\nhad a mate who’s a dab hand with cad and 3d printing to knock together a replacement cap and i’ve just fitted it and it works perfectly. he printed off a bunch of them for me and has also provided the cad file, so i’m posting here just in case anyone else finds themselves in the same -----> position !!!  and finds this post. shoot me a dm if you need a replacement too - happy to post one if you’re in the uk/europe, or can send the cad file for you to print it yourself.\n\n🤙🏼", "sortedWord": "None", "identifyer": 7781, "year": "2021"}, {"Unnamed: 0": 262561, "autor": "st_jim", "date": 1610388257000, "content": "Auxiliary viewfinders /!/ How many of you use axillary viewfinders for rangefinder cameras? \n\nI’m asking more for the tele end (I.e 90mm+) rather than the wide angles as these can often be zone focused. \n\nIs it a pain to change eye position from viewfinder to rangefinder window? Subjects would mainly be still - portraits or landscape / urban, not intending for sports. \n\nI’m finding it a bit tricky to frame nicely with 90mm framelines on my M2, they’re a bit squinty even with a 1.25x screw in eye piece. \n\nCheers", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kv84mg/auxiliary_viewfinders/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "auxiliary viewfinders /!/ how many of you use axillary viewfinders for rangefinder cameras? \n\ni’m asking more for the tele end (i.e 90mm+) rather than the wide angles as these can often be zone focused. \n\nis it a pain to change eye -----> position !!!  from viewfinder to rangefinder window? subjects would mainly be still - portraits or landscape / urban, not intending for sports. \n\ni’m finding it a bit tricky to frame nicely with 90mm framelines on my m2, they’re a bit squinty even with a 1.25x screw in eye piece. \n\ncheers", "sortedWord": "None", "identifyer": 8107, "year": "2021"}, {"Unnamed: 0": 262577, "autor": "Fourple", "date": 1610343192000, "content": "I accidentally flicked the shutter curtain of my Nikkormat FTn. Am I screwed? /!/ While I was trying to get a hold of the film leader while loading my camera, I accidentally (and slightly) flicked the shutter curtain right on the horizontal slit with the tip of my nail. Here's a photo pointing to where it was flicked (picture from [https://www.imagingpixel.com/p/nikomat-ftn.html](https://www.imagingpixel.com/p/nikomat-ftn.html)):\n\n&amp;#x200B;\n\nhttps://preview.redd.it/eanh0j3k2na61.png?width=604&amp;format=png&amp;auto=webp&amp;s=702bf6745fcfe976afca2ab7ebfdaa08ba494d6b\n\nI felt the curtain catch a bit of my nail and heard the tiniest slap when it went back to its original position. I took a close look at it and didn't see any damage on the surface except maybe some dust, so I continued to load my film and took photos. \n\n&amp;#x200B;\n\nI kind of regret doing that now. I'm worried that I could've damaged it without really knowing, as I've read that they're quite fragile. Should I be concerned that the shutter may not work correctly now? And what can I do to assess the possible damage?   \n\n\nThanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kuw7uq/i_accidentally_flicked_the_shutter_curtain_of_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i accidentally flicked the shutter curtain of my nikkormat ftn. am i screwed? /!/ while i was trying to get a hold of the film leader while loading my camera, i accidentally (and slightly) flicked the shutter curtain right on the horizontal slit with the tip of my nail. here's a photo pointing to where it was flicked (picture from [https://www.imagingpixel.com/p/nikomat-ftn.html](https://www.imagingpixel.com/p/nikomat-ftn.html)):\n\n&amp;#x200b;\n\nhttps://preview.redd.it/eanh0j3k2na61.png?width=604&amp;format=png&amp;auto=webp&amp;s=702bf6745fcfe976afca2ab7ebfdaa08ba494d6b\n\ni felt the curtain catch a bit of my nail and heard the tiniest slap when it went back to its original -----> position !!! . i took a close look at it and didn't see any damage on the surface except maybe some dust, so i continued to load my film and took photos. \n\n&amp;#x200b;\n\ni kind of regret doing that now. i'm worried that i could've damaged it without really knowing, as i've read that they're quite fragile. should i be concerned that the shutter may not work correctly now? and what can i do to assess the possible damage?   \n\n\nthanks in advance.", "sortedWord": "None", "identifyer": 8123, "year": "2021"}, {"Unnamed: 0": 262736, "autor": "ladyofchaos", "date": 1627165542000, "content": "Release lever on OM-2 /!/ Hi!\n\nI finished a roll on my Olympus OM-2 and the rewind release lever won't move fully into the horizontal position. I tried jiggling the rewind crank a bit, but the release lever won't budge and I'm worried I'll tear the film.\n\nThe camera isn't new to me, not sure why it's started acting up.\n\n&amp;#x200B;\n\nAnyone know of a work-around for this, or should I just take it straight to the shop?\n\n&amp;#x200B;\n\nThanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oqzk5p/release_lever_on_om2/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "release lever on om-2 /!/ hi!\n\ni finished a roll on my olympus om-2 and the rewind release lever won't move fully into the horizontal -----> position !!! . i tried jiggling the rewind crank a bit, but the release lever won't budge and i'm worried i'll tear the film.\n\nthe camera isn't new to me, not sure why it's started acting up.\n\n&amp;#x200b;\n\nanyone know of a work-around for this, or should i just take it straight to the shop?\n\n&amp;#x200b;\n\nthanks in advance!", "sortedWord": "None", "identifyer": 8285, "year": "2021"}, {"Unnamed: 0": 262778, "autor": "Margaret-Elizabeth", "date": 1634945020000, "content": "Any tips for loosening a sticky aperture ring? /!/ Nikkor 105/2.8D. Wider apertures aren’t a problem but from about f11-32 it gets progressively tighter. F16&amp;22 are almost impossible to get into the detant position. But I looked and the blades are moving correctly.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qdsxd3/any_tips_for_loosening_a_sticky_aperture_ring/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any tips for loosening a sticky aperture ring? /!/ nikkor 105/2.8d. wider apertures aren’t a problem but from about f11-32 it gets progressively tighter. f16&amp;22 are almost impossible to get into the detant -----> position !!! . but i looked and the blades are moving correctly.", "sortedWord": "None", "identifyer": 8327, "year": "2021"}, {"Unnamed: 0": 262851, "autor": "Zorda99", "date": 1622658574000, "content": "Canon AE-1 Program Advance Lever Issue /!/ Hi all! I recently bought a Canon AE-1P, and it seems like the advance lever is broken. There is still tension on it, it doesn't swing freely, but it also isn't stuck. When it is turned, it does not move any of the gears/spools in the back of the camera, nor does it snap back to its original position. I opened the winding mechanism on the bottom, and it seems that wiggling the lever moves that gear slightly, but fully pulling it doesn't do anything. I've tried to take the bottom off and unstick the electromagnet for the shutter, but that didn't seem to be the issue. Is this a known issue? Is it worth taking it into a repair shop or could it be an at-home fix? Thanks in advance for any help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nqsop6/canon_ae1_program_advance_lever_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 program advance lever issue /!/ hi all! i recently bought a canon ae-1p, and it seems like the advance lever is broken. there is still tension on it, it doesn't swing freely, but it also isn't stuck. when it is turned, it does not move any of the gears/spools in the back of the camera, nor does it snap back to its original -----> position !!! . i opened the winding mechanism on the bottom, and it seems that wiggling the lever moves that gear slightly, but fully pulling it doesn't do anything. i've tried to take the bottom off and unstick the electromagnet for the shutter, but that didn't seem to be the issue. is this a known issue? is it worth taking it into a repair shop or could it be an at-home fix? thanks in advance for any help!", "sortedWord": "None", "identifyer": 8401, "year": "2021"}, {"Unnamed: 0": 263090, "autor": "totocutugno", "date": 1620222279000, "content": "Aperture mechanism stuck only when the \"back piece\" is screwed in position (VIDEO)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n5g9gr/aperture_mechanism_stuck_only_when_the_back_piece/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "aperture mechanism stuck only when the \"back piece\" is screwed in -----> position !!!  (video)", "sortedWord": "None", "identifyer": 8644, "year": "2021"}, {"Unnamed: 0": 263558, "autor": "-Aid1e-", "date": 1617722112000, "content": "Friends interested in analog photography /!/ Hey guys I’ve been shooting film for a few months and recently some of my friends became interested. So I point them to a shop where i buy film or some other place they can get their film developed (I develop and scan myself) and they always ask questions about developing yourself but you know it puts me in an uncomfortable position and I am tired of explaining to them that developing at home costs a lot in frontcosts (scanner+equipment) I am frustrated in this situation because I had to learn everything myself. I have been through countless articles forums and youtube videos. I spend at least 2 hours every day watching film videos or researching cameras/ techniques. And I really don’t want to hold their hand when nobody held mine. They suddenly find out that getting film developed costs money. And they try to somehow ask if I could develop their film which I won’t because I paid for my scanner chemicals and most importantly i paid my time to get where i am now and I will not spend an hour or two developing+converting their film. And I do not like the old guys defending film and fending young people off. I am all for keeping film alive and having new young photographers but I do not seek to guide my friends through everything. I hope I’m not like those old school guys. It frustrates me. I am not selfish I just value the work I put into my hobby.\n\nWhat are your thoughts/experiences with this? \n\nWhat do you say to them?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mldy4p/friends_interested_in_analog_photography/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "friends interested in analog photography /!/ hey guys i’ve been shooting film for a few months and recently some of my friends became interested. so i point them to a shop where i buy film or some other place they can get their film developed (i develop and scan myself) and they always ask questions about developing yourself but you know it puts me in an uncomfortable -----> position !!!  and i am tired of explaining to them that developing at home costs a lot in frontcosts (scanner+equipment) i am frustrated in this situation because i had to learn everything myself. i have been through countless articles forums and youtube videos. i spend at least 2 hours every day watching film videos or researching cameras/ techniques. and i really don’t want to hold their hand when nobody held mine. they suddenly find out that getting film developed costs money. and they try to somehow ask if i could develop their film which i won’t because i paid for my scanner chemicals and most importantly i paid my time to get where i am now and i will not spend an hour or two developing+converting their film. and i do not like the old guys defending film and fending young people off. i am all for keeping film alive and having new young photographers but i do not seek to guide my friends through everything. i hope i’m not like those old school guys. it frustrates me. i am not selfish i just value the work i put into my hobby.\n\nwhat are your thoughts/experiences with this? \n\nwhat do you say to them?", "sortedWord": "None", "identifyer": 9120, "year": "2021"}, {"Unnamed: 0": 263651, "autor": "suckurmumyeboi", "date": 1611446765000, "content": "Yellow corners at an angle on a Yashica Minister 3 rangefinder? /!/ So I just received a Yashica Minister 3 rangefinder, my first ever rangefinder I have only shot on SLRs before, and as I looked through the viewfinder I noticed that the yellow patch was barely visible and that the yellow corners were at angle and not even positioned properly as I had thought they would be. Does anyone know what’s wrong with it and how I could fix it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l3o0e0/yellow_corners_at_an_angle_on_a_yashica_minister/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "yellow corners at an angle on a yashica minister 3 rangefinder? /!/ so i just received a yashica minister 3 rangefinder, my first ever rangefinder i have only shot on slrs before, and as i looked through the viewfinder i noticed that the yellow patch was barely visible and that the yellow corners were at angle and not even -----> positioned !!!  properly as i had thought they would be. does anyone know what’s wrong with it and how i could fix it?", "sortedWord": "None", "identifyer": 9213, "year": "2021"}, {"Unnamed: 0": 263696, "autor": "alexp2266", "date": 1621396548000, "content": "Minolta SR-7 shutter and lever stuck - help! /!/ Could be something to do with the self-timer, was fiddling around trying to get the shutter and level to work but then the timer got stuck midway. Tried to coax it back but I don’t want to force anything - the button is not working. Both can move a small bit, but no more than their natural loose-ness. Shutter seems to be stuck in down position. Help greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nfvay7/minolta_sr7_shutter_and_lever_stuck_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta sr-7 shutter and lever stuck - help! /!/ could be something to do with the self-timer, was fiddling around trying to get the shutter and level to work but then the timer got stuck midway. tried to coax it back but i don’t want to force anything - the button is not working. both can move a small bit, but no more than their natural loose-ness. shutter seems to be stuck in down -----> position !!! . help greatly appreciated!", "sortedWord": "None", "identifyer": 9259, "year": "2021"}, {"Unnamed: 0": 263912, "autor": "CUlwsMiCwqfgk", "date": 1623870906000, "content": "SMILING BECAUSE THIS IS MY FAVORITE POSITION :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o1cvrc/smiling_because_this_is_my_favorite_position/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "smiling because this is my favorite -----> position !!!  :)", "sortedWord": "None", "identifyer": 9478, "year": "2021"}, {"Unnamed: 0": 263998, "autor": "Kylake74", "date": 1624375343000, "content": "Nikon F100 film advance problems /!/ Nikon F100 Film Advance problems:  Owned a Nikon F100 fr 20 years - a great camera. Retrieved it from storage recently, cleaned it including removing the back. Loaded film and the camera would not advance the film as it did originally-no error indicators, just wouldn't advance film when loaded.  Found the error in the way I reinstalled the back. There are 2 tiny pins on the R side of the back that hold the back in correct position when closed. If either one of these pins is not seated in the correct insert holes on the camera frame the camera will not advance the film when turned on.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o5pmvh/nikon_f100_film_advance_problems/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f100 film advance problems /!/ nikon f100 film advance problems:  owned a nikon f100 fr 20 years - a great camera. retrieved it from storage recently, cleaned it including removing the back. loaded film and the camera would not advance the film as it did originally-no error indicators, just wouldn't advance film when loaded.  found the error in the way i reinstalled the back. there are 2 tiny pins on the r side of the back that hold the back in correct -----> position !!!  when closed. if either one of these pins is not seated in the correct insert holes on the camera frame the camera will not advance the film when turned on.", "sortedWord": "None", "identifyer": 9565, "year": "2021"}, {"Unnamed: 0": 264058, "autor": "cavemenrppl2", "date": 1620686379000, "content": "Minolta Maxxum 7000 Not Working /!/ Hi I recently purchased a Minolta Maxxum 7000 and I used it for a night before the shutter stopped firing. I changed all the batteries including the CR2025 behind the metal plate and tried a different lens. When I move it from the lock position I can half press the shutter button and it will autofocus but when I fully press the shutter button down nothing happens and the camera completely shuts down like its in lock mode. Has anyone had any experience with this camera and have any idea what might be causing this? It's not worth sending in to get fixed but I was really excited to get it and would like to shoot with it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n9i7gj/minolta_maxxum_7000_not_working/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta maxxum 7000 not working /!/ hi i recently purchased a minolta maxxum 7000 and i used it for a night before the shutter stopped firing. i changed all the batteries including the cr2025 behind the metal plate and tried a different lens. when i move it from the lock -----> position !!!  i can half press the shutter button and it will autofocus but when i fully press the shutter button down nothing happens and the camera completely shuts down like its in lock mode. has anyone had any experience with this camera and have any idea what might be causing this? it's not worth sending in to get fixed but i was really excited to get it and would like to shoot with it.", "sortedWord": "None", "identifyer": 9628, "year": "2021"}, {"Unnamed: 0": 264358, "autor": "SlyeFi", "date": 1617352245000, "content": "How I fixed my Yashica Electro 35 GS's Stuck Film Lever /!/ **TL;DR**\n\nBought a camera with a stuck film advance lever. Tore it apart, learned about how cameras work kinda. Found the issue to be a stuck transport latch, moved it back and it worked!\n\n**The** **Backstory**\n\nI recently bought a Yashica Electro 35 GS and it was in good condition except for the fact that the film advance lever was [stuck all the way at the end of its range](https://i.imgur.com/DsbGLOR.jpg), right before it would normally release and go back to its original position. This was the first time I ever tried to repair anything so I didn't really have much of an idea of how the insides of the camera worked. \n\n**The Process**\n\nI watched a couple YouTube videos and took apart the top and bottom covers, hoping to see something stuck inside a gear that could easily be removed. No debris, but a few little fuzzy things that I think were bugs. I fiddled and fiddled until finally I called some local camera repair shops to see if they had any ideas. One of them said that it sounded like a shutter issue and offered to fix it for about $150. Considering I bought the thing for $45, that didn't sound too swell to me. I took apart the front of the lens, trying to be as careful as I could not to ruin anything. I finally got to the main part of the lens, [which you can see here](http://www.erikfiss.com/foto/cams/electro35/Yashica_Electro_35_Repair_Manual/slides/44.html) (that's the manual I used for most of the repair).\n\nOnce there, I cleaned off the shutter leaves and fiddled around with some of the parts to see what happened when I gently moved them. At this point, I thought the issue was that the shutter leaves were stuck closed like the repair guy had said. I let impatience and anarchy get the better of me when I decided to remove all those tiny little intricate pieces to get to the shutter leaves and see if I could unstick them. Boy, was that a mistake. I followed that manual's order for the teardown and took little care of remembering how things were and how they went. By the time I got to [page 107](http://www.erikfiss.com/foto/cams/electro35/Yashica_Electro_35_Repair_Manual/slides/107.html) of the manual, I started to wonder if that was even really the issue (after I had already taken off so much... facepalm). \n\nIt was getting late as well, so I decided I'd put it back together and man, those pieces are tiny! Over at least 20 tries per step of getting things back in order. Springs would pop off, things would go out of alignment, etc etc over and over and over again. Seriously, don't mess with these tiny parts unless you want to spend a few hours putting them back in place. I ended up breaking off the solder of one of the  switch assembly pieces (which I still have to fix if I want to use any other shutter speed than 1/500) but I managed to get all the other pieces back in order. Although I learned a TON about how that area of the camera worked, I was still back at square one.\n\nAs I was searching for solutions online, some guy recommended just smacking your camera with your palm to dislodge whatever is stuck. I figured what they hey might as well try it. I started smacking it around when a caveman lightbulb went off in my head. \"Why don't I just force it back?\" Okay, here goes nothing. Push, push, push and voila! It's back in place. Fire the shutter, wind it, and stuck again. Uhhh. Push, push, push and voila! It took quite a bit of effort to get it back and I sensed that this would be an issue, but I was glad to have made some progress. (In hindsight, don't force it open, you'll mess with the camera in a way I'll describe in a second).\n\n**The Repair**\n\nIt was the next morning and I was ready to tackle this thing. I took off the top and bottom plate again and started snooping around to see what was physically catching this lever and making it stop. At first I thought it could be something with the bottom gears but after a couple fiddles, no luck. Then I started looking at the winding mechanism and noticed something. Me forcing the lever back was actually [shearing the 2nd to last tooth on the gear that held it in place](https://i.imgur.com/toE6oYN.jpg). Hmmmmm. Why is it the 2nd to last tooth?  I fiddled with the lever and came to realize that the catcher part releases *after* going over the last tooth, but it was getting stuck before it could get there. I came around to the front and found the culprit, the dreaded *transport latch*. [Here's a picture](https://i.imgur.com/CH61wx4.jpg) of what mine looked like, and what it [was supposed to look like](https://i.imgur.com/vexwB1L.png). It's subtle, but if you stare long enough you'll see th difference. I noticed that it seemed stuck both under the winding mechanism and also between a metal post and the front wall of the camera. So, I stuck a tiny jeweler's flathead screwdriver under the post-side of the latch, leveraged it til it finally moved over the post and SNAP! Right back into place! All of a sudden, the advance lever unstuck itself and the [camera was working beautifully again](https://streamable.com/fiwrqc). \n\n**What I learned**\n\nTake your time, take pictures of how things were, don't take things apart unless you're prepared to spend a long time putting them back, and don't give up!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mig2hy/how_i_fixed_my_yashica_electro_35_gss_stuck_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how i fixed my yashica electro 35 gs's stuck film lever /!/ **tl;dr**\n\nbought a camera with a stuck film advance lever. tore it apart, learned about how cameras work kinda. found the issue to be a stuck transport latch, moved it back and it worked!\n\n**the** **backstory**\n\ni recently bought a yashica electro 35 gs and it was in good condition except for the fact that the film advance lever was [stuck all the way at the end of its range](https://i.imgur.com/dsbglor.jpg), right before it would normally release and go back to its original -----> position !!! . this was the first time i ever tried to repair anything so i didn't really have much of an idea of how the insides of the camera worked. \n\n**the process**\n\ni watched a couple youtube videos and took apart the top and bottom covers, hoping to see something stuck inside a gear that could easily be removed. no debris, but a few little fuzzy things that i think were bugs. i fiddled and fiddled until finally i called some local camera repair shops to see if they had any ideas. one of them said that it sounded like a shutter issue and offered to fix it for about $150. considering i bought the thing for $45, that didn't sound too swell to me. i took apart the front of the lens, trying to be as careful as i could not to ruin anything. i finally got to the main part of the lens, [which you can see here](http://www.erikfiss.com/foto/cams/electro35/yashica_electro_35_repair_manual/slides/44.html) (that's the manual i used for most of the repair).\n\nonce there, i cleaned off the shutter leaves and fiddled around with some of the parts to see what happened when i gently moved them. at this point, i thought the issue was that the shutter leaves were stuck closed like the repair guy had said. i let impatience and anarchy get the better of me when i decided to remove all those tiny little intricate pieces to get to the shutter leaves and see if i could unstick them. boy, was that a mistake. i followed that manual's order for the teardown and took little care of remembering how things were and how they went. by the time i got to [page 107](http://www.erikfiss.com/foto/cams/electro35/yashica_electro_35_repair_manual/slides/107.html) of the manual, i started to wonder if that was even really the issue (after i had already taken off so much... facepalm). \n\nit was getting late as well, so i decided i'd put it back together and man, those pieces are tiny! over at least 20 tries per step of getting things back in order. springs would pop off, things would go out of alignment, etc etc over and over and over again. seriously, don't mess with these tiny parts unless you want to spend a few hours putting them back in place. i ended up breaking off the solder of one of the  switch assembly pieces (which i still have to fix if i want to use any other shutter speed than 1/500) but i managed to get all the other pieces back in order. although i learned a ton about how that area of the camera worked, i was still back at square one.\n\nas i was searching for solutions online, some guy recommended just smacking your camera with your palm to dislodge whatever is stuck. i figured what they hey might as well try it. i started smacking it around when a caveman lightbulb went off in my head. \"why don't i just force it back?\" okay, here goes nothing. push, push, push and voila! it's back in place. fire the shutter, wind it, and stuck again. uhhh. push, push, push and voila! it took quite a bit of effort to get it back and i sensed that this would be an issue, but i was glad to have made some progress. (in hindsight, don't force it open, you'll mess with the camera in a way i'll describe in a second).\n\n**the repair**\n\nit was the next morning and i was ready to tackle this thing. i took off the top and bottom plate again and started snooping around to see what was physically catching this lever and making it stop. at first i thought it could be something with the bottom gears but after a couple fiddles, no luck. then i started looking at the winding mechanism and noticed something. me forcing the lever back was actually [shearing the 2nd to last tooth on the gear that held it in place](https://i.imgur.com/toe6oyn.jpg). hmmmmm. why is it the 2nd to last tooth?  i fiddled with the lever and came to realize that the catcher part releases *after* going over the last tooth, but it was getting stuck before it could get there. i came around to the front and found the culprit, the dreaded *transport latch*. [here's a picture](https://i.imgur.com/ch61wx4.jpg) of what mine looked like, and what it [was supposed to look like](https://i.imgur.com/vexwb1l.png). it's subtle, but if you stare long enough you'll see th difference. i noticed that it seemed stuck both under the winding mechanism and also between a metal post and the front wall of the camera. so, i stuck a tiny jeweler's flathead screwdriver under the post-side of the latch, leveraged it til it finally moved over the post and snap! right back into place! all of a sudden, the advance lever unstuck itself and the [camera was working beautifully again](https://streamable.com/fiwrqc). \n\n**what i learned**\n\ntake your time, take pictures of how things were, don't take things apart unless you're prepared to spend a long time putting them back, and don't give up!", "sortedWord": "None", "identifyer": 9932, "year": "2021"}, {"Unnamed: 0": 264416, "autor": "Adorable-Tap-9763", "date": 1627895565000, "content": "Question about my Exa 1c with light shaft finder /!/ Recently, I got a film back from development which was almost completely out of focus. Some photos were so heavily out of focus, that I can't explain how this happened. Of course, no one is safe from missing focus every once in a while, but some pictures were so blurry, that even being completely drunk wouldn't be an excuse for such failure. \nI was using an Exa 1b with a light shaft finder (hope that's the right word). I used the magnifier to make sure focus is on point and I am pretty sure, that in the light shaft finder, everything was in focus that was supposed to be in focus. \nCould it be possible, that the light shaft finder was not attached correctly or that the focussing screen was slightly off position? So that the image appeared sharp on the focussing screen, but not on film? Or that the film was not hold correctly in place, with the same effect? I checked whether the metal plate was still there, that ensures that the film is even where it is supposed to be behind the shutter. Actually, everything should have been alright, but since the focus was absolutely not, I wanted to make sure this mistake does not happen again. \nI am thankful for every suggestion :)\nKind regards", "link": "https://www.reddit.com/r/AnalogCommunity/comments/owavpn/question_about_my_exa_1c_with_light_shaft_finder/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question about my exa 1c with light shaft finder /!/ recently, i got a film back from development which was almost completely out of focus. some photos were so heavily out of focus, that i can't explain how this happened. of course, no one is safe from missing focus every once in a while, but some pictures were so blurry, that even being completely drunk wouldn't be an excuse for such failure. \ni was using an exa 1b with a light shaft finder (hope that's the right word). i used the magnifier to make sure focus is on point and i am pretty sure, that in the light shaft finder, everything was in focus that was supposed to be in focus. \ncould it be possible, that the light shaft finder was not attached correctly or that the focussing screen was slightly off -----> position !!! ? so that the image appeared sharp on the focussing screen, but not on film? or that the film was not hold correctly in place, with the same effect? i checked whether the metal plate was still there, that ensures that the film is even where it is supposed to be behind the shutter. actually, everything should have been alright, but since the focus was absolutely not, i wanted to make sure this mistake does not happen again. \ni am thankful for every suggestion :)\nkind regards", "sortedWord": "None", "identifyer": 9991, "year": "2021"}, {"Unnamed: 0": 264428, "autor": "the_nope_gun", "date": 1627868478000, "content": "Anyone have a Kiev 60? /!/ Hey folks,\n\nSo my Kiev 60 won't stop down a CZJ Biometar past f11. I believe it has to do with the DOF preview pin/screw --- either its too deep or not shallow enough. I was wondering if anyone can take a photo of your Kiev's DOF pin position so I can get a better idea of my issue.\n\nThe DOF pin is just to the left of the mirror and has a security screw with two slits.\n\nAnd if anyone has experienced this issue before, please let me know, thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ow4y7q/anyone_have_a_kiev_60/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "anyone have a kiev 60? /!/ hey folks,\n\nso my kiev 60 won't stop down a czj biometar past f11. i believe it has to do with the dof preview pin/screw --- either its too deep or not shallow enough. i was wondering if anyone can take a photo of your kiev's dof pin -----> position !!!  so i can get a better idea of my issue.\n\nthe dof pin is just to the left of the mirror and has a security screw with two slits.\n\nand if anyone has experienced this issue before, please let me know, thanks", "sortedWord": "None", "identifyer": 10003, "year": "2021"}, {"Unnamed: 0": 264573, "autor": "Oldico", "date": 1612115971000, "content": "Pentax MX won't wind/cock shutter /!/ I recently bought a camera bundle including a (then) working Pentax MX. When I sterted to test/clean it, however, the camera just stopped winding the sprocket or cocking the shutter. As far as I can remember the wind lever just \"slipped\" and it felt like it was doing nothing. It then locked in it's normal position - as if the camera was cocked.\n\nSince then it hasnt moved. If you push it a little bit you can see the curtains moving a tiny bit. The checking-window remains red (so in it's \"not ready\" state) and the roller sleeve pin under the slow-speed-assembly is held by spring pressure towards the back of the camera and wont lock forward - just as it should be if the camera isn't wound up.\n\nMy best guess is that the camera is basically fine but the wind lever somehow slipped off it's gears and then locked in place as if the camera was fully cocked. Maybe someone who knows a bit more about Pentaxes has an idea or knows a fix for this.\n\nAny help would be much appreciated. Thanks in advance!\n\n*tl;dr - Pentax MX wind lever skipped and locked itself in rest position without cocking the shutter. Mechanics seem to be fine otherwise.*\n\n*Edit;*\n\nI already took off the bottom plate and slow-speed-assembly prior to making this post. The little cocking pin does not latch or stay cocked if you push it manually. If, however, I release the shutter while I hold it coked it actually fires - but then does the same slipping as it did the first time when I wind it on. The pin does not lock during/after winding.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l9hqy3/pentax_mx_wont_windcock_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax mx won't wind/cock shutter /!/ i recently bought a camera bundle including a (then) working pentax mx. when i sterted to test/clean it, however, the camera just stopped winding the sprocket or cocking the shutter. as far as i can remember the wind lever just \"slipped\" and it felt like it was doing nothing. it then locked in it's normal -----> position !!!  - as if the camera was cocked.\n\nsince then it hasnt moved. if you push it a little bit you can see the curtains moving a tiny bit. the checking-window remains red (so in it's \"not ready\" state) and the roller sleeve pin under the slow-speed-assembly is held by spring pressure towards the back of the camera and wont lock forward - just as it should be if the camera isn't wound up.\n\nmy best guess is that the camera is basically fine but the wind lever somehow slipped off it's gears and then locked in place as if the camera was fully cocked. maybe someone who knows a bit more about pentaxes has an idea or knows a fix for this.\n\nany help would be much appreciated. thanks in advance!\n\n*tl;dr - pentax mx wind lever skipped and locked itself in rest position without cocking the shutter. mechanics seem to be fine otherwise.*\n\n*edit;*\n\ni already took off the bottom plate and slow-speed-assembly prior to making this post. the little cocking pin does not latch or stay cocked if you push it manually. if, however, i release the shutter while i hold it coked it actually fires - but then does the same slipping as it did the first time when i wind it on. the pin does not lock during/after winding.", "sortedWord": "None", "identifyer": 10149, "year": "2021"}, {"Unnamed: 0": 264696, "autor": "Floople_Doop", "date": 1627090819000, "content": "Spring detent on spotmatic rewind knob out of position.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oqgd30/spring_detent_on_spotmatic_rewind_knob_out_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "spring detent on spotmatic rewind knob out of -----> position !!! .", "sortedWord": "None", "identifyer": 10275, "year": "2021"}, {"Unnamed: 0": 264777, "autor": "genericprophet", "date": 1618603850000, "content": "Rolleicord frame counter reset /!/ I got that rolleicord I mention in my last post, and It seemed to work flawlessly when I tried it with the seller.\n\nAfter fiddling with it and shooting a test roll (still in dev-tank rn) I noticed that I can’t get the framecounter to reset.\n\nAt first it stopped between 11 and 12\n\nAfter trying to move al parts to reset Position it went down to 3 and real slow down to 1 after a minute.\n\nFound different „solutions“ online and  am wonderin what’s the most noninvasive way to fix this", "link": "https://www.reddit.com/r/AnalogCommunity/comments/msbefi/rolleicord_frame_counter_reset/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "rolleicord frame counter reset /!/ i got that rolleicord i mention in my last post, and it seemed to work flawlessly when i tried it with the seller.\n\nafter fiddling with it and shooting a test roll (still in dev-tank rn) i noticed that i can’t get the framecounter to reset.\n\nat first it stopped between 11 and 12\n\nafter trying to move al parts to reset -----> position !!!  it went down to 3 and real slow down to 1 after a minute.\n\nfound different „solutions“ online and  am wonderin what’s the most noninvasive way to fix this", "sortedWord": "None", "identifyer": 10359, "year": "2021"}], "name": "positionAnalogCommunity2021"}