{"interestingcomments": [{"Unnamed: 0": 252528, "autor": "sleepy-24-7", "date": 1625181087000, "content": "Epson v800 Help /!/ Hello everyone!\n\nOne row of my scans always comes out with these thin lines across the images (see zoomed in picture below). It doesn't appear in any other row  and I do not think it is a camera/lab error. I recently acquired this scanner used and have cleaned the inside of the glass once. I remember seeing a small dark spot under the glass in the calibration area that I could not get to. I know the scanner calibrates before every scan, so I believe the lines will go away if I remove the spot. Does anyone have any tips on how that area could be cleaned? I haven't seen anything online thus far. Or, is there a programmable way to calibrate around that one spot?  Any advise is appreciated! :)\n\n*Processing img et1w1b7iho871...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/obxnb0/epson_v800_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "epson v800 help /!/ hello everyone!\n\none row of my scans always comes out with these thin lines across the images (see zoomed in picture below). it doesn't appear in any other row  and i do not think it is a camera/lab error. i recently acquired this scanner used and have cleaned the inside of the glass once. i remember seeing a small dark -----> spot !!!  under the glass in the calibration area that i could not get to. i know the scanner calibrates before every scan, so i believe the lines will go away if i remove the spot. does anyone have any tips on how that area could be cleaned? i haven't seen anything online thus far. or, is there a programmable way to calibrate around that one spot?  any advise is appreciated! :)\n\n*processing img et1w1b7iho871...*", "sortedWord": "None", "identifyer": 47895, "year": "2021"}, {"Unnamed: 0": 252593, "autor": "viriconium_days", "date": 1625071491000, "content": "Any recommendations for digital camera to use as spot meter? /!/ This is a difficult question to research, because what you want for a camera to work well as a light meter and as a camera are very different. In this case, being cheap and small are important, but it also needs to startup quick and be easy to read exposure information off of.\n\nMy idea is I want to be able to use a camera as an advanced spot meter, that would also be cheaper than a professional spot meter. The ability to take relatively short tripod exposures at high iso to get a good idea of what exposure I want for nighttime long exposures would be the main use I see for this.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ob17ab/any_recommendations_for_digital_camera_to_use_as/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any recommendations for digital camera to use as -----> spot !!!  meter? /!/ this is a difficult question to research, because what you want for a camera to work well as a light meter and as a camera are very different. in this case, being cheap and small are important, but it also needs to startup quick and be easy to read exposure information off of.\n\nmy idea is i want to be able to use a camera as an advanced spot meter, that would also be cheaper than a professional spot meter. the ability to take relatively short tripod exposures at high iso to get a good idea of what exposure i want for nighttime long exposures would be the main use i see for this.", "sortedWord": "None", "identifyer": 47960, "year": "2021"}, {"Unnamed: 0": 252728, "autor": "callmegrooovvvy", "date": 1631641613000, "content": "Push Portra 160 or Pull Portra 800 /!/ Hey All,\nIt seems that the supply for Portra 400 is a little tight right now. (at least here in Los Angeles) So i wanted to see if anyone had a preferred way of reaching the sweet spot without access to 400 iso?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/po7ra8/push_portra_160_or_pull_portra_800/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "push portra 160 or pull portra 800 /!/ hey all,\nit seems that the supply for portra 400 is a little tight right now. (at least here in los angeles) so i wanted to see if anyone had a preferred way of reaching the sweet -----> spot !!!  without access to 400 iso?", "sortedWord": "None", "identifyer": 48099, "year": "2021"}, {"Unnamed: 0": 252780, "autor": "Rigisteredtrademrk", "date": 1631502840000, "content": "eyesight, and Shooting with glasses /!/ it’s taken me a while to really consider my own eyesight as being a major problem in my photography. my exposure is great, most of the time it’s spot on. my composition more or less what i’m going for, but i so often miss focus. because in the moment, it seems so perfectly clear! i know these glasses aren’t true. my eyes do lie. and i’m trying to fix that\n\ni mainly shoot olympus xa, canon ae1p and waist level mamiya rz67. focusing just causes me anxiety because i have to jam my glasses all up in the viewfinder and it’s just so inconsistent. of course, it always “appears” in focus, until it isn’t. removing my glasses is the equivalent of drunk vision and that is an understatement \n\nare diopters a thing with film cameras? what do you all with glasses do while shooting to compensate for poor eyesight? it’s killing me :(", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pn794k/eyesight_and_shooting_with_glasses/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "eyesight, and shooting with glasses /!/ it’s taken me a while to really consider my own eyesight as being a major problem in my photography. my exposure is great, most of the time it’s -----> spot !!!  on. my composition more or less what i’m going for, but i so often miss focus. because in the moment, it seems so perfectly clear! i know these glasses aren’t true. my eyes do lie. and i’m trying to fix that\n\ni mainly shoot olympus xa, canon ae1p and waist level mamiya rz67. focusing just causes me anxiety because i have to jam my glasses all up in the viewfinder and it’s just so inconsistent. of course, it always “appears” in focus, until it isn’t. removing my glasses is the equivalent of drunk vision and that is an understatement \n\nare diopters a thing with film cameras? what do you all with glasses do while shooting to compensate for poor eyesight? it’s killing me :(", "sortedWord": "None", "identifyer": 48151, "year": "2021"}, {"Unnamed: 0": 252781, "autor": "spacetriip", "date": 1631502159000, "content": "Ilford xp2 (120) spotting issue.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pn72sz/ilford_xp2_120_spotting_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "ilford xp2 (120) -----> spotting !!!  issue.", "sortedWord": "None", "identifyer": 48152, "year": "2021"}, {"Unnamed: 0": 252955, "autor": "jacobtohahn", "date": 1630377564000, "content": "ANR Glass Alternative: Using Etched Frame Glass /!/ In my [last post](https://www.reddit.com/r/AnalogCommunity/comments/pe3xy5/using_nonglare_acrylic_as_an_alternative_to/), I discussed using Non-Glare Acrylic (NGA) as an alternative to Anti-Newton Ring glass for film scanning. I found that NGA produces beautiful, sharp scans that are free of Newton Rings, just like ANR glass does. This makes NGA an economical and easy to source alternative for ANR glass.\n\nNGA didn't come without its flaws, though. Most notably, it was very easy to damage, particularly through scratches. I found that even light cleaning could leave scratches on the acrylic, which reduce scan quality. The acrylic can also become bent and warped over time, which may cause it to not lay flat. Glass products, like ANR, do not suffer from these drawbacks.\n\nOn my post about NGA, u/Nikon-FE made a comment claiming that etched frame glass \"works just like ANR glass without the ANR tax.\" This seemed likely to be true, considering that NGA worked, and it uses a similar textured side to etched frame glass. However, there were also some comments claiming that etched frame glass does, in fact, leave Newton Rings on scans. Due to the lack of consensus, I decided to test etched frame glass for myself.\n\nJust like the acrylic, etched frame glass can be found locally. I called a local framing shop and asked if they had \"non-glare glass\", and they replied that they did. I went to pick some up, making sure that the non-glare glass was of the etched kind, as opposed to the optically coated kind (often referred to as non-reflective glass). They could cut the glass to size for me on the spot, and the total cost for two 8x10\" sheets of etched frame glass was only $6, which is **$2 cheaper** than the cost of two 8x10\" sheets of NGA! Things were already looking up.\n\nAfter cleaning the glass with glass cleaner and removing dust with a microfiber cloth, it was time to test the glass. Using etched frame glass is the same process as using the acrylic. The film is placed between the etched side of the two glass sheets and on top of a lightbox.\n\nWhile preparing the glass, one must be very careful to not chip or break it. When placed on a smooth surface, the glass has a tendency to slide because of how smooth it is, and it could slide off a drop if you aren't careful. Use glass at your own risk!\n\nRESULTS:\n\nAfter scanning the same negative through both Non-Glare Acrylic and Etched Frame Glass, I used Lightroom to compare the two images side-by-side. Through close inspection and lots of zooming, I have determined that **etched frame glass produces the same results as NGA**, free of Newton Rings, unwanted texture, and color shifts, at an even cheaper price. There is no noticeable difference in sharpness between the two scans outside of the margin of error of my manual focusing. The grain structure is virtually identical between the two images, proving that neither NGA nor etched frame glass leaves a texture on scans.\n\nAs stated in my previous post, this is not a direct comparison with ANR glass. I have never used ANR glass, but I do not intend to after seeing the results of much cheaper options.\n\nCONCLUSION:\n\nBased on preference, either non-glare acrylic or etched frame glass will work as a cheap yet quality alternative to ANR glass. Both options have equal sharpness and do not produce Newton Rings. Personally, I prefer etched frame glass and will be using it from now on due to its scratch resistance and rigidity.\n\nPHOTOS:\n\nBoth scans were edited to have as similar color as possible.\n\n[Side-by-side comparison of etched frame glass and non-glare acrylic](https://preview.redd.it/l7420nbnulk71.png?width=1024&amp;format=png&amp;auto=webp&amp;s=64f2bf5e65d593848166b1d96bc63827c5621de5)\n\n[DSLR scanning setup using etched frame glass](https://preview.redd.it/yf2d260gvlk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=ec2d84128f2fde9796c0023889e99d2eed57c035)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pex269/anr_glass_alternative_using_etched_frame_glass/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anr glass alternative: using etched frame glass /!/ in my [last post](https://www.reddit.com/r/analogcommunity/comments/pe3xy5/using_nonglare_acrylic_as_an_alternative_to/), i discussed using non-glare acrylic (nga) as an alternative to anti-newton ring glass for film scanning. i found that nga produces beautiful, sharp scans that are free of newton rings, just like anr glass does. this makes nga an economical and easy to source alternative for anr glass.\n\nnga didn't come without its flaws, though. most notably, it was very easy to damage, particularly through scratches. i found that even light cleaning could leave scratches on the acrylic, which reduce scan quality. the acrylic can also become bent and warped over time, which may cause it to not lay flat. glass products, like anr, do not suffer from these drawbacks.\n\non my post about nga, u/nikon-fe made a comment claiming that etched frame glass \"works just like anr glass without the anr tax.\" this seemed likely to be true, considering that nga worked, and it uses a similar textured side to etched frame glass. however, there were also some comments claiming that etched frame glass does, in fact, leave newton rings on scans. due to the lack of consensus, i decided to test etched frame glass for myself.\n\njust like the acrylic, etched frame glass can be found locally. i called a local framing shop and asked if they had \"non-glare glass\", and they replied that they did. i went to pick some up, making sure that the non-glare glass was of the etched kind, as opposed to the optically coated kind (often referred to as non-reflective glass). they could cut the glass to size for me on the -----> spot !!! , and the total cost for two 8x10\" sheets of etched frame glass was only $6, which is **$2 cheaper** than the cost of two 8x10\" sheets of nga! things were already looking up.\n\nafter cleaning the glass with glass cleaner and removing dust with a microfiber cloth, it was time to test the glass. using etched frame glass is the same process as using the acrylic. the film is placed between the etched side of the two glass sheets and on top of a lightbox.\n\nwhile preparing the glass, one must be very careful to not chip or break it. when placed on a smooth surface, the glass has a tendency to slide because of how smooth it is, and it could slide off a drop if you aren't careful. use glass at your own risk!\n\nresults:\n\nafter scanning the same negative through both non-glare acrylic and etched frame glass, i used lightroom to compare the two images side-by-side. through close inspection and lots of zooming, i have determined that **etched frame glass produces the same results as nga**, free of newton rings, unwanted texture, and color shifts, at an even cheaper price. there is no noticeable difference in sharpness between the two scans outside of the margin of error of my manual focusing. the grain structure is virtually identical between the two images, proving that neither nga nor etched frame glass leaves a texture on scans.\n\nas stated in my previous post, this is not a direct comparison with anr glass. i have never used anr glass, but i do not intend to after seeing the results of much cheaper options.\n\nconclusion:\n\nbased on preference, either non-glare acrylic or etched frame glass will work as a cheap yet quality alternative to anr glass. both options have equal sharpness and do not produce newton rings. personally, i prefer etched frame glass and will be using it from now on due to its scratch resistance and rigidity.\n\nphotos:\n\nboth scans were edited to have as similar color as possible.\n\n[side-by-side comparison of etched frame glass and non-glare acrylic](https://preview.redd.it/l7420nbnulk71.png?width=1024&amp;format=png&amp;auto=webp&amp;s=64f2bf5e65d593848166b1d96bc63827c5621de5)\n\n[dslr scanning setup using etched frame glass](https://preview.redd.it/yf2d260gvlk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=ec2d84128f2fde9796c0023889e99d2eed57c035)", "sortedWord": "None", "identifyer": 48327, "year": "2021"}, {"Unnamed: 0": 253060, "autor": "SubPop120", "date": 1635430914000, "content": "Can any one tell me what these white spots/light marks in my Yashica’s waist level viewfinder might be? I’m thinking it’s fungus but would like a second opinion.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qho5dh/can_any_one_tell_me_what_these_white_spotslight/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "can any one tell me what these white -----> spots !!! /light marks in my yashica’s waist level viewfinder might be? i’m thinking it’s fungus but would like a second opinion.", "sortedWord": "None", "identifyer": 48432, "year": "2021"}, {"Unnamed: 0": 253063, "autor": "filiuscannis", "date": 1635428989000, "content": "Edward Hopper's realist painting featured in numerous film photography \"style\" videos spotted in Ferris Bueller's Day Off (1986)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qhnhoo/edward_hoppers_realist_painting_featured_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "edward hopper's realist painting featured in numerous film photography \"style\" videos -----> spotted !!!  in ferris bueller's day off (1986)", "sortedWord": "None", "identifyer": 48435, "year": "2021"}, {"Unnamed: 0": 253223, "autor": "TheInnerVoiceSpeaks", "date": 1632861071000, "content": "That black bar down the middle what is it. This is my first time developing and processing my film. Also anyone know how to get rid of the white grainy spots", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pxf3gr/that_black_bar_down_the_middle_what_is_it_this_is/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "that black bar down the middle what is it. this is my first time developing and processing my film. also anyone know how to get rid of the white grainy -----> spots !!! ", "sortedWord": "None", "identifyer": 48597, "year": "2021"}, {"Unnamed: 0": 253263, "autor": "lyujie97", "date": 1632787978000, "content": "Help! Contax Tvs purchased from eBay arrived with a LCD problem /!/ Hello yall. I am new to old film cameras and need some advices regarding my recent purchase.\n\n&amp;#x200B;\n\nI bought a Contax Tvs from eBay which was shipped from Japan. The eBay listing didn't mention / show anything LCD leakage. But when the package arrived, I found out that the flash info panel has some really wired leakages. There are some dark black spots along the edges, which is what a normal LCD leakage should look like. But there are also some tiny \"x\" marks in the middle of the screen in a lighter red color.\n\n&amp;#x200B;\n\nThe serial number matches the eBay listing. The seller said they didn't find any leakage on the LCD at all before they ship. They suggested that the leakage was caused by shipping. Any thoughts / advices? I attached the eBay listing picture and the picture I took.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[eBay listing looks nice and clean](https://preview.redd.it/78cgjwh0z4q71.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=c75c5e274124375852a23faf0275ab2bafea8b89)\n\n&amp;#x200B;\n\n[It arrived like this](https://preview.redd.it/kdko3sczy4q71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=726f81375fe97cedb45adcd28925d98ab89fbfdf)\n\n&amp;#x200B;\n\n[Closer look](https://preview.redd.it/ei49rkq1z4q71.png?width=1288&amp;format=png&amp;auto=webp&amp;s=daf52cf25de1f886c4f36b5f1dd4671e2745c343)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pwu5ot/help_contax_tvs_purchased_from_ebay_arrived_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help! contax tvs purchased from ebay arrived with a lcd problem /!/ hello yall. i am new to old film cameras and need some advices regarding my recent purchase.\n\n&amp;#x200b;\n\ni bought a contax tvs from ebay which was shipped from japan. the ebay listing didn't mention / show anything lcd leakage. but when the package arrived, i found out that the flash info panel has some really wired leakages. there are some dark black -----> spots !!!  along the edges, which is what a normal lcd leakage should look like. but there are also some tiny \"x\" marks in the middle of the screen in a lighter red color.\n\n&amp;#x200b;\n\nthe serial number matches the ebay listing. the seller said they didn't find any leakage on the lcd at all before they ship. they suggested that the leakage was caused by shipping. any thoughts / advices? i attached the ebay listing picture and the picture i took.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n[ebay listing looks nice and clean](https://preview.redd.it/78cgjwh0z4q71.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=c75c5e274124375852a23faf0275ab2bafea8b89)\n\n&amp;#x200b;\n\n[it arrived like this](https://preview.redd.it/kdko3sczy4q71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=726f81375fe97cedb45adcd28925d98ab89fbfdf)\n\n&amp;#x200b;\n\n[closer look](https://preview.redd.it/ei49rkq1z4q71.png?width=1288&amp;format=png&amp;auto=webp&amp;s=daf52cf25de1f886c4f36b5f1dd4671e2745c343)", "sortedWord": "None", "identifyer": 48637, "year": "2021"}, {"Unnamed: 0": 253267, "autor": "ddunkyy", "date": 1632778516000, "content": "Service Leica CL's rangefinder recommendation (US) /!/ I want to service my Leica CL's rangefinder, the yellow spot does not match when focus. I know that I can do it myself, but I do not trust myself doing it and I don't think I have the right tools for this. \n\nWhere should I bring my camera? Should I get it fully serviced too?\n\nAny recommendation is appreciated. Thanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pwr7g2/service_leica_cls_rangefinder_recommendation_us/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "service leica cl's rangefinder recommendation (us) /!/ i want to service my leica cl's rangefinder, the yellow -----> spot !!!  does not match when focus. i know that i can do it myself, but i do not trust myself doing it and i don't think i have the right tools for this. \n\nwhere should i bring my camera? should i get it fully serviced too?\n\nany recommendation is appreciated. thanks in advance.", "sortedWord": "None", "identifyer": 48641, "year": "2021"}, {"Unnamed: 0": 253338, "autor": "bluejen", "date": 1634235988000, "content": "Any favorite spots to shoot in Las Vegas? /!/ Might be a silly question because the strip is full of opportunities but I'm going to Vegas next week. Me and my partner are photography hobbyists/enthusiasts and we wanted to bring our 35mms to the Neon Boneyard. But I just looked on the site, and it says you can only shoot with your phone. \n\nLike I said, I know Vegas is full of opportunities, but I'm wondering if anyone here has some spots in Las Vegas that they like to shoot. Not looking for influencer-type shoots. Just good street photography or other kinds of creative opportunities.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q85mud/any_favorite_spots_to_shoot_in_las_vegas/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "any favorite -----> spots !!!  to shoot in las vegas? /!/ might be a silly question because the strip is full of opportunities but i'm going to vegas next week. me and my partner are photography hobbyists/enthusiasts and we wanted to bring our 35mms to the neon boneyard. but i just looked on the site, and it says you can only shoot with your phone. \n\nlike i said, i know vegas is full of opportunities, but i'm wondering if anyone here has some spots in las vegas that they like to shoot. not looking for influencer-type shoots. just good street photography or other kinds of creative opportunities.", "sortedWord": "None", "identifyer": 48712, "year": "2021"}, {"Unnamed: 0": 253378, "autor": "subliminal_liminal", "date": 1634161522000, "content": "Spotted on eBay: unbelievable scamera with interchangeable lenses", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q7lfk1/spotted_on_ebay_unbelievable_scamera_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  on ebay: unbelievable scamera with interchangeable lenses", "sortedWord": "None", "identifyer": 48752, "year": "2021"}, {"Unnamed: 0": 253475, "autor": "WeaselSounds", "date": 1611933798000, "content": "Shooting Handheld at Night (without flash) /!/ Since I've gotten into film photography, almost all of my photography has been handheld at night on my Pentax K1000 with no flash. There's many reason for this. There's too many anti-maskers in my area to go out in the day time, and my boyfriend can't stand waiting around while I mess with a tripod. I don't love the look of flash, and it's conspicuous on the street. \n\nI wanted to share some of the things I've learned after 9 rolls of film shooting this way. Some people reading this may have more experience than me, and if you do, please correct me where I err and let me know any tips you have, I want to hear. But I know that a lot of photographers avoid shooting this way or don't think it's possible, and there's not an overwhelming amount of information out there about it, so I just wanna offer my perspective, green though it may be.\n\n# Light\n\nLight at night is water in the desert; you have to do everything you can to get it. You have to create a configuration that will soak up light with voracious greed. Big lens, fast film. I use an F 1.4 lens, and Kodak P3200 T-Max and occasionally Ilford Delta 3200. I am experimenting with pushing Portra 800 but I haven't gotten the results back yet so I can't comment on how well it works. A lot of people prefer Delta over T-Max for its midtones, and I think in brighter conditions, they have a strong point. But in very dark conditions, the T-Max really shines. More than just dramatic contrast, it gives things a silvery look I really like, and has a crisp quality in spite of the grain. Plus, I don't necessarily love what happens when you goose the contrast of a Delta photo in post. I say let it be what it is; a beautiful low contrast stock. But I digress. \n\nPart of why you want this level of light gathering ability is so that you don't \"bottom out\" in your exposure. Lenses perform better when they're stopped down at least a little. Shooting anything other than wide-open in these conditions may sound ridiculous, but since focusing in the dark is really difficult and you're moving quickly, a super slim depth-of-field isn't always what you want. The true strength of a 1.4 lens isn't that it opens to 1.4, it's how it looks at F2 compared to an F2 lens. \n\nAlso, you will often want the option to over-expose. Both of these films are fast, but hungry. They are quite happy to eat up some extra light. Attempting to over-expose at night with no flash may sound greedy, but that's what you need to be. \n\nAs I'll go into later, dynamic range can be really high in night scenes. A slower setup might tell you that you're good to click, but the results may disappoint. So you need a buffer, some extra speed in your setup that you don't always need.. \n\n# Film Speed of 3200 Stocks\n\nA lot of people on analog subs like to say that T-Max P3200 and Delta 3200 aren't *really* 3200 speed films. They will tell you that they have ISO ratings of 1600 or lower, so they need to be rated as such. They are correct about the ISO rating, but they are not correct that that means you have to rate the film slower to take good pictures. The ISO rating is a measurement of how the film responds on certain tests, but it is not determined by the taking of pictures, so the ISO rating doesn't necessarily tell you what will look best. Plus, Kodak are trying to give you a clue as to how to use their film. The P in P3200 T-Max stands for \"push\", meaning that *normal* development for this film is technically pushing. But since it's designed to be used that way, it works really well. \n\nI always rate T-Max P3200 at 3200 ISO. Delta 3200 I will rate slower if I'm going to be in brighter light conditions, just because of the lower contrast. Over-exposing Delta 3200 produces a soft, dreamy look imo. But it works perfectly well rated at 3200 for night shoots. \n\n[1.4 Lens, T-Max P3200 at box speed, 1.5 stops of compensation](https://preview.redd.it/uzoyydtqy9e61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=def36b163ecb3139803407b7e9beb85bb85167b9)\n\n# Prioritize Shutter Speed\n\nShooting handheld means using a fast shutter speed, but shooting in low light means using the slowest shutter speed you can get away with. These two competing forces mean that there's almost never a reason to use a shutter speed besides the minimum dictated by your lens's focal length. \n\nLonger focal lengths exaggerate handheld shake, shorter focal lengths forgive it more. For the nifty fifty, that means you should never shoot slower than 1/50th of a second.\n\nThe closest setting on my trusty K1000 is 1/60th, so I set it there and leave it there the whole night. All that cash you shelled out on a big lens and ultra-fast films has been to bring this magic number within reach, because this number is the difference between getting the shot, and needing to go home and get a tripod. \n\n(I say \"all that cash\", but fast 50mm prime lenses are fairly affordable.)\n\nOn my K1000, I shoot in de facto shutter priority. And I've begun experimenting with a Canon EOS that has real shutter priority mode. Experience has shown me that a nighttime walk-and-shoot will never give me enough light to justify speeding up the shutter, nor stopping the lens down further than about F4. Plus, if I attempt aperture priority, the risk of the shutter speed dipping below the minimum without me realizing it is too great. So I park it at 60 and go. \n\nIf you're about to do your first ever night shooting, avoid the temptation to speed up the shutter for the sake of bokeh / depth of field. Focusing in low-light is difficult for people and cameras alike. Plus, extreme DOF blur that can look dreamy in the daytime can look muddy in the night time. \n\n[High speed film and shutter priority enabled a wider depth of field](https://preview.redd.it/08ocppkcdae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=01b6c71e553f4e18e4f2dd75b2b6c0a62997287d)\n\n&amp;#x200B;\n\n# Compensation\n\nA really fun way to compose pictures at night is to include the light source in the picture. Street lights, shop lights, car headlights, and so on. But this can confuse camera meters, which may attempt to treat the light source as a highlight and try not to blow it out. The result of this is often pictures which have little pin-pricks of light and not much else. Both my K1000 with it's pseudo-averaging and my EOS with it's Evaluative metering behave very similarly at night. Any bright light source will freak the meter out and cause it to under-expose. \n\nSome people are comfortable framing up a scene and then estimating a compensation, but I'm not, so here's what I do:\n\nWith my K1000's match-needle meter, I will aim at my scene, and then aim away until the lights are no longer in the frame, but the area lit by that light still is. At that point, the needle will usually drop significantly. I then set the exposure so that the needle is right down the middle, and then re-frame my composition. The needle will jump up and act like I'm about to over-expose, but it's safe to ignore it. My K1000 is recently calibrated, so you'll need to apply this to what you know about your own camera.\n\nWith my EOS 500, you can technically do the same thing, but it's pretty inconvenient outside of manual mode. Thankfully it has a button on the back that converts from evaluative metering to spot metering. I have tested these techniques on the cameras side-by-side, and the spot-meter button gives the exact same exposure compensation as the look-away method on my K1000 almost every time. \n\n[I exposed this shot exactly as my K1000 suggested, but it was confused by the lights](https://preview.redd.it/1xb60r6o4ae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=ad40f03926426dc5129cc0a1e748038e7d894a5d)\n\n*Processing img rx79g6lo4ae61...*\n\nWhen in doubt, you can always double-check with a phone app meter. Generally speaking my phone-app meter gives me the same result as these compensation tricks, but obviously you don't wanna be taking out your phone for every shot, you're shooting handheld for speed, right? \n\n# Pushing\n\nYou may not feel like using 3200 speed black and white film. They are slightly more expensive than their 400 speed cousins (though not quite as expensive as Portra) or maybe you want to give this a try using the film you have. When film is pushed, it gets grainier, grittier, and more contrasty. There's not really a way around it. But personally, I like that look, it's a huge reason why I shoot film in the first place. Subconsciously I'm just trying to make the movie Alphaville. \n\nIf you're not familiar, pushing film is a combination of under-exposing and over-developing. You set your meter ISO to the desired speed, and then let your lab know how many stops you \"pushed\" by, and they compensate in development (or you can compensate in your own development, but if you home develop you probably already know all this) \n\nThis is distinct from *rating,* though the terms get tossed around. When you *rate* film, you're just treating the film as if it has a different speed and then developing normally. This is quite commonly done with Portra 400, which people will rate at 200 to feed it more light. But they do not change the development. \n\nWith that out of the way, pushed 400 film behaves fairly similarly to fast film. Higher contrast, more grain, but still quite eager for light. Everything else I've said applies. Maybe a little less tolerance for underexposure, a little less shadow detail. But a totally viable option. \n\n[Kodak Tri-X pushed allllll the way to 3200](https://preview.redd.it/80gryeh18ae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=c40ba1f236e9c834d9fee8a08d7079b31861fafa)\n\nThese are the things I have learned about shooting in these tricky circumstances. I hope it helps someone who's considering trying it out, and if you have anything to offer that might help me improve, please don't hold back!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l7v73y/shooting_handheld_at_night_without_flash/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shooting handheld at night (without flash) /!/ since i've gotten into film photography, almost all of my photography has been handheld at night on my pentax k1000 with no flash. there's many reason for this. there's too many anti-maskers in my area to go out in the day time, and my boyfriend can't stand waiting around while i mess with a tripod. i don't love the look of flash, and it's conspicuous on the street. \n\ni wanted to share some of the things i've learned after 9 rolls of film shooting this way. some people reading this may have more experience than me, and if you do, please correct me where i err and let me know any tips you have, i want to hear. but i know that a lot of photographers avoid shooting this way or don't think it's possible, and there's not an overwhelming amount of information out there about it, so i just wanna offer my perspective, green though it may be.\n\n# light\n\nlight at night is water in the desert; you have to do everything you can to get it. you have to create a configuration that will soak up light with voracious greed. big lens, fast film. i use an f 1.4 lens, and kodak p3200 t-max and occasionally ilford delta 3200. i am experimenting with pushing portra 800 but i haven't gotten the results back yet so i can't comment on how well it works. a lot of people prefer delta over t-max for its midtones, and i think in brighter conditions, they have a strong point. but in very dark conditions, the t-max really shines. more than just dramatic contrast, it gives things a silvery look i really like, and has a crisp quality in spite of the grain. plus, i don't necessarily love what happens when you goose the contrast of a delta photo in post. i say let it be what it is; a beautiful low contrast stock. but i digress. \n\npart of why you want this level of light gathering ability is so that you don't \"bottom out\" in your exposure. lenses perform better when they're stopped down at least a little. shooting anything other than wide-open in these conditions may sound ridiculous, but since focusing in the dark is really difficult and you're moving quickly, a super slim depth-of-field isn't always what you want. the true strength of a 1.4 lens isn't that it opens to 1.4, it's how it looks at f2 compared to an f2 lens. \n\nalso, you will often want the option to over-expose. both of these films are fast, but hungry. they are quite happy to eat up some extra light. attempting to over-expose at night with no flash may sound greedy, but that's what you need to be. \n\nas i'll go into later, dynamic range can be really high in night scenes. a slower setup might tell you that you're good to click, but the results may disappoint. so you need a buffer, some extra speed in your setup that you don't always need.. \n\n# film speed of 3200 stocks\n\na lot of people on analog subs like to say that t-max p3200 and delta 3200 aren't *really* 3200 speed films. they will tell you that they have iso ratings of 1600 or lower, so they need to be rated as such. they are correct about the iso rating, but they are not correct that that means you have to rate the film slower to take good pictures. the iso rating is a measurement of how the film responds on certain tests, but it is not determined by the taking of pictures, so the iso rating doesn't necessarily tell you what will look best. plus, kodak are trying to give you a clue as to how to use their film. the p in p3200 t-max stands for \"push\", meaning that *normal* development for this film is technically pushing. but since it's designed to be used that way, it works really well. \n\ni always rate t-max p3200 at 3200 iso. delta 3200 i will rate slower if i'm going to be in brighter light conditions, just because of the lower contrast. over-exposing delta 3200 produces a soft, dreamy look imo. but it works perfectly well rated at 3200 for night shoots. \n\n[1.4 lens, t-max p3200 at box speed, 1.5 stops of compensation](https://preview.redd.it/uzoyydtqy9e61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=def36b163ecb3139803407b7e9beb85bb85167b9)\n\n# prioritize shutter speed\n\nshooting handheld means using a fast shutter speed, but shooting in low light means using the slowest shutter speed you can get away with. these two competing forces mean that there's almost never a reason to use a shutter speed besides the minimum dictated by your lens's focal length. \n\nlonger focal lengths exaggerate handheld shake, shorter focal lengths forgive it more. for the nifty fifty, that means you should never shoot slower than 1/50th of a second.\n\nthe closest setting on my trusty k1000 is 1/60th, so i set it there and leave it there the whole night. all that cash you shelled out on a big lens and ultra-fast films has been to bring this magic number within reach, because this number is the difference between getting the shot, and needing to go home and get a tripod. \n\n(i say \"all that cash\", but fast 50mm prime lenses are fairly affordable.)\n\non my k1000, i shoot in de facto shutter priority. and i've begun experimenting with a canon eos that has real shutter priority mode. experience has shown me that a nighttime walk-and-shoot will never give me enough light to justify speeding up the shutter, nor stopping the lens down further than about f4. plus, if i attempt aperture priority, the risk of the shutter speed dipping below the minimum without me realizing it is too great. so i park it at 60 and go. \n\nif you're about to do your first ever night shooting, avoid the temptation to speed up the shutter for the sake of bokeh / depth of field. focusing in low-light is difficult for people and cameras alike. plus, extreme dof blur that can look dreamy in the daytime can look muddy in the night time. \n\n[high speed film and shutter priority enabled a wider depth of field](https://preview.redd.it/08ocppkcdae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=01b6c71e553f4e18e4f2dd75b2b6c0a62997287d)\n\n&amp;#x200b;\n\n# compensation\n\na really fun way to compose pictures at night is to include the light source in the picture. street lights, shop lights, car headlights, and so on. but this can confuse camera meters, which may attempt to treat the light source as a highlight and try not to blow it out. the result of this is often pictures which have little pin-pricks of light and not much else. both my k1000 with it's pseudo-averaging and my eos with it's evaluative metering behave very similarly at night. any bright light source will freak the meter out and cause it to under-expose. \n\nsome people are comfortable framing up a scene and then estimating a compensation, but i'm not, so here's what i do:\n\nwith my k1000's match-needle meter, i will aim at my scene, and then aim away until the lights are no longer in the frame, but the area lit by that light still is. at that point, the needle will usually drop significantly. i then set the exposure so that the needle is right down the middle, and then re-frame my composition. the needle will jump up and act like i'm about to over-expose, but it's safe to ignore it. my k1000 is recently calibrated, so you'll need to apply this to what you know about your own camera.\n\nwith my eos 500, you can technically do the same thing, but it's pretty inconvenient outside of manual mode. thankfully it has a button on the back that converts from evaluative metering to -----> spot !!!  metering. i have tested these techniques on the cameras side-by-side, and the spot-meter button gives the exact same exposure compensation as the look-away method on my k1000 almost every time. \n\n[i exposed this shot exactly as my k1000 suggested, but it was confused by the lights](https://preview.redd.it/1xb60r6o4ae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=ad40f03926426dc5129cc0a1e748038e7d894a5d)\n\n*processing img rx79g6lo4ae61...*\n\nwhen in doubt, you can always double-check with a phone app meter. generally speaking my phone-app meter gives me the same result as these compensation tricks, but obviously you don't wanna be taking out your phone for every shot, you're shooting handheld for speed, right? \n\n# pushing\n\nyou may not feel like using 3200 speed black and white film. they are slightly more expensive than their 400 speed cousins (though not quite as expensive as portra) or maybe you want to give this a try using the film you have. when film is pushed, it gets grainier, grittier, and more contrasty. there's not really a way around it. but personally, i like that look, it's a huge reason why i shoot film in the first place. subconsciously i'm just trying to make the movie alphaville. \n\nif you're not familiar, pushing film is a combination of under-exposing and over-developing. you set your meter iso to the desired speed, and then let your lab know how many stops you \"pushed\" by, and they compensate in development (or you can compensate in your own development, but if you home develop you probably already know all this) \n\nthis is distinct from *rating,* though the terms get tossed around. when you *rate* film, you're just treating the film as if it has a different speed and then developing normally. this is quite commonly done with portra 400, which people will rate at 200 to feed it more light. but they do not change the development. \n\nwith that out of the way, pushed 400 film behaves fairly similarly to fast film. higher contrast, more grain, but still quite eager for light. everything else i've said applies. maybe a little less tolerance for underexposure, a little less shadow detail. but a totally viable option. \n\n[kodak tri-x pushed allllll the way to 3200](https://preview.redd.it/80gryeh18ae61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=c40ba1f236e9c834d9fee8a08d7079b31861fafa)\n\nthese are the things i have learned about shooting in these tricky circumstances. i hope it helps someone who's considering trying it out, and if you have anything to offer that might help me improve, please don't hold back!", "sortedWord": "None", "identifyer": 48849, "year": "2021"}, {"Unnamed: 0": 253538, "autor": "LordKwannon", "date": 1627759300000, "content": "Canon New F-1 Meter not working... any ideas? /!/  I am having trouble with a Canon New F-1 I bought off of eBay... The camera was listed as CLA'd and \"Mint\" but it had dents all over so I ended up getting my money back and they told me to just keep the camera... Now I know why! On top of the dents the meter doesn't work.\n\nSince I got it for free I sent it in to a known expert on Canon F-1's and his response to me was \"never saw it before, don't use the meter\". But he did tune the shutter for me so at least that much works properly.\n\nSo it looks like the meter might be done for...\n\nI did some troubleshooting of my own just to try and develop a point of reference, switching focusing screens &amp; finders with a working camera, and also cleaning off the surface of the light sensor, still no dice.\n\nThe light works, and the meter will activate, but something is very wrong. It only activates to about f/2, and the sensitivity of the film has to be turned up to like 1600 ISO before it will move there. It also does that familiar \"jump\" when the shutter fires. So the mechanism is able to move but only seems to move to one spot. Also once it is triggered to f/2 it is non-responsive. Point it at the sun, it says f/2, cover the lens, it says f/2.\n\nAnyone seen something like this before and has an idea or is the meter really and genuinely toast on this one?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ovd8yr/canon_new_f1_meter_not_working_any_ideas/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon new f-1 meter not working... any ideas? /!/  i am having trouble with a canon new f-1 i bought off of ebay... the camera was listed as cla'd and \"mint\" but it had dents all over so i ended up getting my money back and they told me to just keep the camera... now i know why! on top of the dents the meter doesn't work.\n\nsince i got it for free i sent it in to a known expert on canon f-1's and his response to me was \"never saw it before, don't use the meter\". but he did tune the shutter for me so at least that much works properly.\n\nso it looks like the meter might be done for...\n\ni did some troubleshooting of my own just to try and develop a point of reference, switching focusing screens &amp; finders with a working camera, and also cleaning off the surface of the light sensor, still no dice.\n\nthe light works, and the meter will activate, but something is very wrong. it only activates to about f/2, and the sensitivity of the film has to be turned up to like 1600 iso before it will move there. it also does that familiar \"jump\" when the shutter fires. so the mechanism is able to move but only seems to move to one -----> spot !!! . also once it is triggered to f/2 it is non-responsive. point it at the sun, it says f/2, cover the lens, it says f/2.\n\nanyone seen something like this before and has an idea or is the meter really and genuinely toast on this one?", "sortedWord": "None", "identifyer": 48912, "year": "2021"}, {"Unnamed: 0": 253559, "autor": "likes_rusty_spoons", "date": 1627730270000, "content": "Can anyone recommend a good spot metering app for IOS that's suitable for using with the zone system? (paid is fine)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ov5drl/can_anyone_recommend_a_good_spot_metering_app_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can anyone recommend a good -----> spot !!!  metering app for ios that's suitable for using with the zone system? (paid is fine)", "sortedWord": "None", "identifyer": 48933, "year": "2021"}, {"Unnamed: 0": 253731, "autor": "fotoloc0", "date": 1623721549000, "content": "How to align the dial in this Pentax spot meter to get a spot reading?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o02nod/how_to_align_the_dial_in_this_pentax_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to align the dial in this pentax -----> spot !!!  meter to get a -----> spot !!!  reading?", "sortedWord": "None", "identifyer": 49107, "year": "2021"}, {"Unnamed: 0": 253803, "autor": "guyvisuals", "date": 1619915011000, "content": "Heavy vignetting when DSLR scanning /!/ I’m trying to figure out the reason why my [scans](https://imgur.com/gallery/bKIDmG1) are coming back like this. It looked like vignetting but I wasn’t very sure. I’ve tried switching macro lenses (Canon 50mm f3.5 Macro FD to now the Sigma 70mm Macro Art) but that didn’t solve anything. I’ve also tried changing light sources (lightpad, iphone, and ipad) as well as masking the light differently (with gaffers tape or other objects as seen in my “setup” picture) to ensure no excess light could be reflecting off of the lens. I’m also in a dark room. I have no idea what else it could be. The vignetting/leaks are consistently in the same spot as seen in the photos.\n\n(Also, the weird darker blotches on the blank film are fingerprints.)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n2v5uz/heavy_vignetting_when_dslr_scanning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "heavy vignetting when dslr scanning /!/ i’m trying to figure out the reason why my [scans](https://imgur.com/gallery/bkidmg1) are coming back like this. it looked like vignetting but i wasn’t very sure. i’ve tried switching macro lenses (canon 50mm f3.5 macro fd to now the sigma 70mm macro art) but that didn’t solve anything. i’ve also tried changing light sources (lightpad, iphone, and ipad) as well as masking the light differently (with gaffers tape or other objects as seen in my “setup” picture) to ensure no excess light could be reflecting off of the lens. i’m also in a dark room. i have no idea what else it could be. the vignetting/leaks are consistently in the same -----> spot !!!  as seen in the photos.\n\n(also, the weird darker blotches on the blank film are fingerprints.)", "sortedWord": "None", "identifyer": 49181, "year": "2021"}, {"Unnamed: 0": 253849, "autor": "SeaSeeMuhGhee", "date": 1619809043000, "content": "Trade offs which would you prioritize? spot meter or grad filter set? /!/ I would like to get both but I am leaning towards a filter set for my my medium format set up.  Just wondering if others made a similar choice.  I think I may be able to get by with my prism meter and iPhone meter.  Thank you.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n20s25/trade_offs_which_would_you_prioritize_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "trade offs which would you prioritize? -----> spot !!!  meter or grad filter set? /!/ i would like to get both but i am leaning towards a filter set for my my medium format set up.  just wondering if others made a similar choice.  i think i may be able to get by with my prism meter and iphone meter.  thank you.", "sortedWord": "None", "identifyer": 49227, "year": "2021"}, {"Unnamed: 0": 253937, "autor": "joschplusa", "date": 1624955580000, "content": "Scanning issue: Can this vertical line be fixed or is the scanner (plustek 7200) broken? Happens at the same spot on each frame and is not on the negative.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oa45mk/scanning_issue_can_this_vertical_line_be_fixed_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "scanning issue: can this vertical line be fixed or is the scanner (plustek 7200) broken? happens at the same -----> spot !!!  on each frame and is not on the negative.", "sortedWord": "None", "identifyer": 49316, "year": "2021"}, {"Unnamed: 0": 253938, "autor": "grain_farmer", "date": 1624955525000, "content": "Beware of Schneideritis (corrosion / white spots) when buying Hasselblad Lenses from sellers in Japan and how to deal with it. (Details in comment)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oa458q/beware_of_schneideritis_corrosion_white_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "beware of schneideritis (corrosion / white -----> spots !!! ) when buying hasselblad lenses from sellers in japan and how to deal with it. (details in comment)", "sortedWord": "None", "identifyer": 49317, "year": "2021"}, {"Unnamed: 0": 254006, "autor": "Vintage_Ty", "date": 1614928392000, "content": "Spotted this kit today, developer might’ve gone bad by now", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ly6hzk/spotted_this_kit_today_developer_mightve_gone_bad/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  this kit today, developer might’ve gone bad by now", "sortedWord": "None", "identifyer": 49385, "year": "2021"}, {"Unnamed: 0": 254043, "autor": "jokasi58", "date": 1614869625000, "content": "tips on how to shoot landscapes without overexposing the clouds /!/ hello! last week Ive been on a little trip outside the city and shot a few landscape pictures. The sun wasn't fully shining, there where a few clouds so it was relatively bright but no direct sunlight. I wanted to meter the ground (forest, trees, etc..) but unfortunately every time I want to meter for the ground the sky gets full blown out since its brighter than the ground + overexposed because I meter for the ground. What I end up with is a good landscape on the lower half where you can see the \"ground\" clearly but on the other hand the sky/clouds are just a huge white spot where you can't see the clouds. only later in Lightroom when I turn down the lights I can see that clouds.\n\nany tips on how I can improve my images when it comes to landscapes and getting the ground + the clouds to look good.\n\n[Here is a good example](https://youtu.be/HPWRxFnTdyY?t=204) of how I would like my pictures to show the clouds, and also have enough exposure to show the ground", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lxm91t/tips_on_how_to_shoot_landscapes_without/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tips on how to shoot landscapes without overexposing the clouds /!/ hello! last week ive been on a little trip outside the city and shot a few landscape pictures. the sun wasn't fully shining, there where a few clouds so it was relatively bright but no direct sunlight. i wanted to meter the ground (forest, trees, etc..) but unfortunately every time i want to meter for the ground the sky gets full blown out since its brighter than the ground + overexposed because i meter for the ground. what i end up with is a good landscape on the lower half where you can see the \"ground\" clearly but on the other hand the sky/clouds are just a huge white -----> spot !!!  where you can't see the clouds. only later in lightroom when i turn down the lights i can see that clouds.\n\nany tips on how i can improve my images when it comes to landscapes and getting the ground + the clouds to look good.\n\n[here is a good example](https://youtu.be/hpwrxfntdyy?t=204) of how i would like my pictures to show the clouds, and also have enough exposure to show the ground", "sortedWord": "None", "identifyer": 49422, "year": "2021"}, {"Unnamed: 0": 254077, "autor": "readingrunner", "date": 1614801586000, "content": "Orange spots on film with Olympus mju 1 (info in comments)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lx2w71/orange_spots_on_film_with_olympus_mju_1_info_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "orange -----> spots !!!  on film with olympus mju 1 (info in comments)", "sortedWord": "None", "identifyer": 49456, "year": "2021"}, {"Unnamed: 0": 254200, "autor": "jayzyaj17", "date": 1634821004000, "content": "Light leak but only on a single frame? /!/ I got a roll of film back from the lab. I think I have a light leak on the 33rd frame from a 35mm Portra 400 roll shot on Canon AE1  \nHere is the photo: [Green Light Leak on Canon AE1](https://imgur.com/a/v3b8p4B?fbclid)\n\nI'm really curious about what made the leak only happen on one frame. It could be that I mishandled the film? Did I load or Unloaded incorrectly? I'm trying to diagnose if it's really from my camera in the back or I just mishandled the film.  \n\n\nThe camera I'm using is a second-hand one bought on eBay from Japan that was shipped here in Hong Kong. I'm using the camera for almost 2 months and had like 4 - 5 rounds of 36 exposure and didn't spot any single light leak.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qcr6wf/light_leak_but_only_on_a_single_frame/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light leak but only on a single frame? /!/ i got a roll of film back from the lab. i think i have a light leak on the 33rd frame from a 35mm portra 400 roll shot on canon ae1  \nhere is the photo: [green light leak on canon ae1](https://imgur.com/a/v3b8p4b?fbclid)\n\ni'm really curious about what made the leak only happen on one frame. it could be that i mishandled the film? did i load or unloaded incorrectly? i'm trying to diagnose if it's really from my camera in the back or i just mishandled the film.  \n\n\nthe camera i'm using is a second-hand one bought on ebay from japan that was shipped here in hong kong. i'm using the camera for almost 2 months and had like 4 - 5 rounds of 36 exposure and didn't -----> spot !!!  any single light leak.", "sortedWord": "None", "identifyer": 49580, "year": "2021"}, {"Unnamed: 0": 254319, "autor": "xlschffr", "date": 1630928616000, "content": "Nikon L35AF dead? /!/ Hello Everyone,\n\nI bought a Nikon L35AF a year ago. Everything worked, just the Viewfinder was a Bit dirty.\n\nSo i decided so carfully Open the Case and clean the Glas. \n\nAfter Finishing i put everything back together.\nI Shot a Roll of Gold 200 to Check if everything is good.\nEverything was working Fine!\n\nBut…. Yesterday i went outsite for some nice shots. The Cam Shot once and „died“. \n\nNo Flash light, no Spot Meter, no Film rewind is working anymore.\n\nWhat can i do ? \n\nThx", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pixtqv/nikon_l35af_dead/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nikon l35af dead? /!/ hello everyone,\n\ni bought a nikon l35af a year ago. everything worked, just the viewfinder was a bit dirty.\n\nso i decided so carfully open the case and clean the glas. \n\nafter finishing i put everything back together.\ni shot a roll of gold 200 to check if everything is good.\neverything was working fine!\n\nbut…. yesterday i went outsite for some nice shots. the cam shot once and „died“. \n\nno flash light, no -----> spot !!!  meter, no film rewind is working anymore.\n\nwhat can i do ? \n\nthx", "sortedWord": "None", "identifyer": 49700, "year": "2021"}, {"Unnamed: 0": 254343, "autor": "grainyfilm", "date": 1630875985000, "content": "Black spot on upper left corner? Dirt?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pildrg/black_spot_on_upper_left_corner_dirt/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "black -----> spot !!!  on upper left corner? dirt?", "sortedWord": "None", "identifyer": 49724, "year": "2021"}, {"Unnamed: 0": 254609, "autor": "Hezlan", "date": 1632151739000, "content": "Getting \"moving\" black spots on my pictures, anyone come across this before?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/prx6e9/getting_moving_black_spots_on_my_pictures_anyone/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "getting \"moving\" black -----> spots !!!  on my pictures, anyone come across this before?", "sortedWord": "None", "identifyer": 49997, "year": "2021"}, {"Unnamed: 0": 254707, "autor": "carlod427", "date": 1635302906000, "content": "Odd spot on bottom right of film?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qgmsgb/odd_spot_on_bottom_right_of_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "odd -----> spot !!!  on bottom right of film?", "sortedWord": "None", "identifyer": 95, "year": "2021"}, {"Unnamed: 0": 254788, "autor": "SpencerKayR", "date": 1615712134000, "content": "Dear past me: metering isn't about getting the \"correct\" exposure, metering is about making choices /!/ Hello past me. Right now you're probably measuring, taking digital test shots, and measuring again. You're taking out your phone to see what it says, you're freaking out that the match-needle in the K1000 doesn't agree with your digital camera's matrix metering. You're checking the batteries, you're breaking out the gossen, you're googling dynamic range and exposure latitude and watching youtube exposure tests. \n\nI'm here to tell you to chill. The meters you have at your disposal -- even the match needle -- are accurate, but they can't tell you how to expose your photo all by themselves. They're doing exactly what they're expected to do, but they're giving you different numbers because they represent different decision making. You need to accept that there's lots of ways to expose any given scene, and which exposure you choose is a decision you make as the person taking the picture, and not fealty to an objective measurement. \n\nAn exposure based on incident reading is more likely to record the true luminance of your subject. A reflected reading is more likely to bring your subject within the dynamic range of your film. Spot metering can let you prioritize a very specific area, or be very intentional about the range of the scene. Sunny 16 puts you entirely in the driver's seat, and good estimations can lead to true-to-life exposures like incident metering. So stop spending so much time worrying about getting the exposure \"right\" and start making decisions.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m4rnwh/dear_past_me_metering_isnt_about_getting_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dear past me: metering isn't about getting the \"correct\" exposure, metering is about making choices /!/ hello past me. right now you're probably measuring, taking digital test shots, and measuring again. you're taking out your phone to see what it says, you're freaking out that the match-needle in the k1000 doesn't agree with your digital camera's matrix metering. you're checking the batteries, you're breaking out the gossen, you're googling dynamic range and exposure latitude and watching youtube exposure tests. \n\ni'm here to tell you to chill. the meters you have at your disposal -- even the match needle -- are accurate, but they can't tell you how to expose your photo all by themselves. they're doing exactly what they're expected to do, but they're giving you different numbers because they represent different decision making. you need to accept that there's lots of ways to expose any given scene, and which exposure you choose is a decision you make as the person taking the picture, and not fealty to an objective measurement. \n\nan exposure based on incident reading is more likely to record the true luminance of your subject. a reflected reading is more likely to bring your subject within the dynamic range of your film. -----> spot !!!  metering can let you prioritize a very specific area, or be very intentional about the range of the scene. sunny 16 puts you entirely in the driver's seat, and good estimations can lead to true-to-life exposures like incident metering. so stop spending so much time worrying about getting the exposure \"right\" and start making decisions.", "sortedWord": "None", "identifyer": 176, "year": "2021"}, {"Unnamed: 0": 254854, "autor": "lunar_sideboob", "date": 1615570806000, "content": "Anyone know what these circle spots are? I shot on an old b&amp;w Kodak Plus-X roll and I’m pretty happy with the results, but was wondering if anyone knew what would cause these little circles. As you can see it’s not as bad in some pictures and more pronounced in others", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m3mqps/anyone_know_what_these_circle_spots_are_i_shot_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone know what these circle -----> spots !!!  are? i shot on an old b&amp;w kodak plus-x roll and i’m pretty happy with the results, but was wondering if anyone knew what would cause these little circles. as you can see it’s not as bad in some pictures and more pronounced in others", "sortedWord": "None", "identifyer": 242, "year": "2021"}, {"Unnamed: 0": 254898, "autor": "JawshAllen", "date": 1630246670000, "content": "Using a flash on Mamiya 645 Pro TL /!/ Hello friends! Shows in the local scene are becoming a thing again and I want nothing more than to shoot some live stuff on medium format. As of right now, I have no clue what I’m doing. The Pro has a spot for a flash and a sync cable (have a flash but need the cable) but is there anything I should know before trying it out? Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pdw1tp/using_a_flash_on_mamiya_645_pro_tl/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "using a flash on mamiya 645 pro tl /!/ hello friends! shows in the local scene are becoming a thing again and i want nothing more than to shoot some live stuff on medium format. as of right now, i have no clue what i’m doing. the pro has a -----> spot !!!  for a flash and a sync cable (have a flash but need the cable) but is there anything i should know before trying it out? thank you!", "sortedWord": "None", "identifyer": 287, "year": "2021"}, {"Unnamed: 0": 254935, "autor": "gavimundo", "date": 1630181151000, "content": "Photo Lab Question - Cheap Processing Now for High Quality Scanning Later /!/ I just got home from vacation, have 5 rolls of film - 4x portra 160, 1x Ilford HP5 Plus.  I has just bought a Nikon FE the week before my trip - I haven't shot film in years and have never seen the results of this camera before.  There's a decent chance that 20% of the shots are junk, or maybe the camera has a problem and they're all trash (I don't believe this will be the case, the previous owner provided sample pictures).\n\nI think the best course of action is to have the film processed and scanned cheaply/medium quality, and then in the future have the negatives of my best shots scanned high quality and corrected as needed.\n\nThe top two photo labs I've read about are The Darkroom or Indie Film Lab.\n\nThe Darkroom seems to be a good option for processing and scanning for small prints - $12/roll, and reputable enough to not return film that has been handled poorly, scratched, processed wrong, etc.\n\nIndie Film Lab seems to be well reviewed for their picture quality output based on scanners and corrections, so that would be a good spot for part 2 of this plan, where I send out the processed negatives of my good shots to have them scanned for high quality.\n\nHaving never gone through this process before, I wanted to put it out there and see if there were any suggestions of alternative plans or agreement from more experienced individuals that this is a good path.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pdgvi5/photo_lab_question_cheap_processing_now_for_high/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "photo lab question - cheap processing now for high quality scanning later /!/ i just got home from vacation, have 5 rolls of film - 4x portra 160, 1x ilford hp5 plus.  i has just bought a nikon fe the week before my trip - i haven't shot film in years and have never seen the results of this camera before.  there's a decent chance that 20% of the shots are junk, or maybe the camera has a problem and they're all trash (i don't believe this will be the case, the previous owner provided sample pictures).\n\ni think the best course of action is to have the film processed and scanned cheaply/medium quality, and then in the future have the negatives of my best shots scanned high quality and corrected as needed.\n\nthe top two photo labs i've read about are the darkroom or indie film lab.\n\nthe darkroom seems to be a good option for processing and scanning for small prints - $12/roll, and reputable enough to not return film that has been handled poorly, scratched, processed wrong, etc.\n\nindie film lab seems to be well reviewed for their picture quality output based on scanners and corrections, so that would be a good -----> spot !!!  for part 2 of this plan, where i send out the processed negatives of my good shots to have them scanned for high quality.\n\nhaving never gone through this process before, i wanted to put it out there and see if there were any suggestions of alternative plans or agreement from more experienced individuals that this is a good path.", "sortedWord": "None", "identifyer": 324, "year": "2021"}, {"Unnamed: 0": 254962, "autor": "Nowhereman_13", "date": 1630127024000, "content": "Film development problem: sticky film / uneven drying? /!/ I have developed my 2nd roll of black and white film completed with 1 min wash of ilfotol at the end. After developing I used a sponge soaked lightly with Ilfotol to wipe the film. \n\nAn hour later the film is partially dry I noticed some wipe marks. \n\nWhen it was dry (hung for 8+ hours), the wipe marks are still there and when I put them into negative sleeve it sticked to it and it has these “wet spots” (refer to photos) but the film is dry. \n\nAny ideas? Too much ilfotol? Or maybe I shouldn’t have touched my film? \n\n[photos](https://imgur.com/a/iQ8GmaE)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pd3oye/film_development_problem_sticky_film_uneven_drying/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film development problem: sticky film / uneven drying? /!/ i have developed my 2nd roll of black and white film completed with 1 min wash of ilfotol at the end. after developing i used a sponge soaked lightly with ilfotol to wipe the film. \n\nan hour later the film is partially dry i noticed some wipe marks. \n\nwhen it was dry (hung for 8+ hours), the wipe marks are still there and when i put them into negative sleeve it sticked to it and it has these “wet -----> spots !!! ” (refer to photos) but the film is dry. \n\nany ideas? too much ilfotol? or maybe i shouldn’t have touched my film? \n\n[photos](https://imgur.com/a/iq8gmae)", "sortedWord": "None", "identifyer": 351, "year": "2021"}, {"Unnamed: 0": 255096, "autor": "JBman100", "date": 1632701104000, "content": "Rangefinder glass damage /!/ Hello ! I'm servicing an old Yashica rangfinder and the looking glass has these spots. Is this fungus damage ? Can this come off ? I tried lens tissue, lens cleaner, and rubbing alcohol.\n\nhttps://preview.redd.it/qwazsxycsxp71.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=867d6dad47c9c87f359a67cf974d04e7afcd49f3", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pw5hxc/rangefinder_glass_damage/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "rangefinder glass damage /!/ hello ! i'm servicing an old yashica rangfinder and the looking glass has these -----> spots !!! . is this fungus damage ? can this come off ? i tried lens tissue, lens cleaner, and rubbing alcohol.\n\nhttps://preview.redd.it/qwazsxycsxp71.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=867d6dad47c9c87f359a67cf974d04e7afcd49f3", "sortedWord": "None", "identifyer": 486, "year": "2021"}, {"Unnamed: 0": 255100, "autor": "gimlithepirate", "date": 1632690858000, "content": "Best non-Adobe Photo Editing Software /!/ After I get my negatives off my scanner, they inevitably need some editing. I've been using Luminar 4, but it is painfully slow. Any suggestion of software for doing color correction, spot healing, and exporting to JPG for negatives?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pw2jk7/best_nonadobe_photo_editing_software/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best non-adobe photo editing software /!/ after i get my negatives off my scanner, they inevitably need some editing. i've been using luminar 4, but it is painfully slow. any suggestion of software for doing color correction, -----> spot !!!  healing, and exporting to jpg for negatives?", "sortedWord": "None", "identifyer": 490, "year": "2021"}, {"Unnamed: 0": 255119, "autor": "foxydogman", "date": 1632678879000, "content": "My stabilizer caused streaks/spots on some of my negatives due to me not using distilled water. Need advice on re-washing and stabilizing correctly. /!/ I’d like to wash my negatives and stabilize them correctly so they are protected and free of spots. My plan was to soak them in photo-flo and then properly mix up a new batch of stabilizer and re-stabilize after. Would this work for me? I’m hoping it’s safe to go through this process again.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pvyrfs/my_stabilizer_caused_streaksspots_on_some_of_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my stabilizer caused streaks/-----> spots !!!  on some of my negatives due to me not using distilled water. need advice on re-washing and stabilizing correctly. /!/ i’d like to wash my negatives and stabilize them correctly so they are protected and free of spots. my plan was to soak them in photo-flo and then properly mix up a new batch of stabilizer and re-stabilize after. would this work for me? i’m hoping it’s safe to go through this process again.", "sortedWord": "None", "identifyer": 509, "year": "2021"}, {"Unnamed: 0": 255227, "autor": "CaptainST1TCH", "date": 1633539280000, "content": "White spots on film. Any ideas what causes it? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/pcnx0v751vr71.jpg?width=3443&amp;format=pjpg&amp;auto=webp&amp;s=551243035e1c908665a71629dd9aa338785016f4", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q2oitt/white_spots_on_film_any_ideas_what_causes_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "white -----> spots !!!  on film. any ideas what causes it? /!/ &amp;#x200b;\n\nhttps://preview.redd.it/pcnx0v751vr71.jpg?width=3443&amp;format=pjpg&amp;auto=webp&amp;s=551243035e1c908665a71629dd9aa338785016f4", "sortedWord": "None", "identifyer": 625, "year": "2021"}, {"Unnamed: 0": 255416, "autor": "maybesharks", "date": 1610606721000, "content": "Some fun info &amp; user experience on my favorite SLR, the Canon EOS 3 /!/ Recently I've been shooting a lot with the EOS 3 and I've come to realize that it's kind of a beast. Here are some of my thoughts and some sample images. \n\n&amp;#x200B;\n\n*TLDR: It may not be trendy or retro, but it sure is a versatile fun to use camera loaded with tons of great features and one that allows you full use of a wide array of Canon EF glass.* \n\n&amp;#x200B;\n\n**Main Specs:**\n\nFormat: 35mm\n\nReleased: 1998\n\nAutofocus Points: 45\n\nLens Mount: EF\n\nMax Shutter Speed: 1/8000 sec\n\n*Processing img cde38zy7t8b61...*\n\n**It's the Most Technologically Advanced SLR I've Ever Used**\n\nI've shot with my fair share of 35mm and the EOS 3 is the most advanced SLR I have ever shot with. It doesn't have the tactility of shooting on an older fully mechanical camera but it has some really great features. \n\n* Multi-spot metering\n* Great ergonomics &amp; build quality\n* Eye Control AF\n\n*Processing img u2g56wlkt8b61...*\n\n**Compatible with All Canon EF Lenses**\n\nThis is a argument for this camera in and of itself. If you have any EF Canon glass with you DSLR then you don't even need to get any lenses for the EOS 3. They all work natively and flawlessly, including AF and IS, which is pretty great. \n\n&amp;#x200B;\n\n[Huntington Gardens - EOS 3 Portra 400](https://preview.redd.it/jd43cbzpt8b61.jpg?width=3089&amp;format=pjpg&amp;auto=webp&amp;s=be08c0063574ceef1fc3cfae14eb196cfbcd25fd)\n\n&amp;#x200B;\n\n[Double Exposure on Ultramax 400](https://preview.redd.it/k5w06eput8b61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=bf193d2d68b8dbf25a2c2513e0f62afeb6a4e8b0)\n\n**Shutter Sound**\n\nIt's got the classic shutter sound that has been mimicked on early iPhone cameras and other such digital emulations. Sounds corny when digitally faked, but so so satisfying when you're actually ripping through a roll. \n\n&amp;#x200B;\n\n[Oregon Coast - Pro 400H](https://preview.redd.it/tr9wo260u8b61.jpg?width=3089&amp;format=pjpg&amp;auto=webp&amp;s=2be3f016f77bf58c828abe5924aaa1bcdf13a13a)\n\n&amp;#x200B;\n\n[Crater Lake on Portra 400](https://preview.redd.it/dymn0amiu8b61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=b61262f1c091521dc847f49691ed89bc386b00c2)\n\n**Conclusion**\n\nWhat it lacks in retro appearance and trend factor, it makes up for in versatility and ease of use. It is a pleasure to shoot with and the potential for images you can make with it are nearly limitless and filled with ease. Whether it be spelunking in Joshua Tree or hiking in the Sierra, this is one camera that is not only a joy to use, but one  I can count on to cover all my bases\n\n&amp;#x200B;\n\n**If you're interested in additional thoughts and sample images you can find my accompanying video on the EOS 3** [**here**](https://youtu.be/_auNgLwpNMk)**.** \n\n*Processing img vlzzdu44u8b61...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kx0dba/some_fun_info_user_experience_on_my_favorite_slr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some fun info &amp; user experience on my favorite slr, the canon eos 3 /!/ recently i've been shooting a lot with the eos 3 and i've come to realize that it's kind of a beast. here are some of my thoughts and some sample images. \n\n&amp;#x200b;\n\n*tldr: it may not be trendy or retro, but it sure is a versatile fun to use camera loaded with tons of great features and one that allows you full use of a wide array of canon ef glass.* \n\n&amp;#x200b;\n\n**main specs:**\n\nformat: 35mm\n\nreleased: 1998\n\nautofocus points: 45\n\nlens mount: ef\n\nmax shutter speed: 1/8000 sec\n\n*processing img cde38zy7t8b61...*\n\n**it's the most technologically advanced slr i've ever used**\n\ni've shot with my fair share of 35mm and the eos 3 is the most advanced slr i have ever shot with. it doesn't have the tactility of shooting on an older fully mechanical camera but it has some really great features. \n\n* multi------> spot !!!  metering\n* great ergonomics &amp; build quality\n* eye control af\n\n*processing img u2g56wlkt8b61...*\n\n**compatible with all canon ef lenses**\n\nthis is a argument for this camera in and of itself. if you have any ef canon glass with you dslr then you don't even need to get any lenses for the eos 3. they all work natively and flawlessly, including af and is, which is pretty great. \n\n&amp;#x200b;\n\n[huntington gardens - eos 3 portra 400](https://preview.redd.it/jd43cbzpt8b61.jpg?width=3089&amp;format=pjpg&amp;auto=webp&amp;s=be08c0063574ceef1fc3cfae14eb196cfbcd25fd)\n\n&amp;#x200b;\n\n[double exposure on ultramax 400](https://preview.redd.it/k5w06eput8b61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=bf193d2d68b8dbf25a2c2513e0f62afeb6a4e8b0)\n\n**shutter sound**\n\nit's got the classic shutter sound that has been mimicked on early iphone cameras and other such digital emulations. sounds corny when digitally faked, but so so satisfying when you're actually ripping through a roll. \n\n&amp;#x200b;\n\n[oregon coast - pro 400h](https://preview.redd.it/tr9wo260u8b61.jpg?width=3089&amp;format=pjpg&amp;auto=webp&amp;s=2be3f016f77bf58c828abe5924aaa1bcdf13a13a)\n\n&amp;#x200b;\n\n[crater lake on portra 400](https://preview.redd.it/dymn0amiu8b61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=b61262f1c091521dc847f49691ed89bc386b00c2)\n\n**conclusion**\n\nwhat it lacks in retro appearance and trend factor, it makes up for in versatility and ease of use. it is a pleasure to shoot with and the potential for images you can make with it are nearly limitless and filled with ease. whether it be spelunking in joshua tree or hiking in the sierra, this is one camera that is not only a joy to use, but one  i can count on to cover all my bases\n\n&amp;#x200b;\n\n**if you're interested in additional thoughts and sample images you can find my accompanying video on the eos 3** [**here**](https://youtu.be/_aunglwpnmk)**.** \n\n*processing img vlzzdu44u8b61...*", "sortedWord": "None", "identifyer": 816, "year": "2021"}, {"Unnamed: 0": 255469, "autor": "Vast-Oven", "date": 1611911443000, "content": "Fellow Australians where do you buy your film cameras? /!/ I’ve been into digital photography for years and am currently working part time as a product photographer however I’ve never shot film. Looking on eBay the prices seem extremely high compared to what everyone says cameras should cost, for example nikon F is going for about $400-600+ and the nikkormat ftn is going for about $140. Am I looking in the wrong spot?\nI have though about importing one from the US or Japan buy the postage is crazy expensive.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l7o3i8/fellow_australians_where_do_you_buy_your_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fellow australians where do you buy your film cameras? /!/ i’ve been into digital photography for years and am currently working part time as a product photographer however i’ve never shot film. looking on ebay the prices seem extremely high compared to what everyone says cameras should cost, for example nikon f is going for about $400-600+ and the nikkormat ftn is going for about $140. am i looking in the wrong -----> spot !!! ?\ni have though about importing one from the us or japan buy the postage is crazy expensive.", "sortedWord": "None", "identifyer": 869, "year": "2021"}, {"Unnamed: 0": 255545, "autor": "Fourple", "date": 1611772697000, "content": "Can barbecue/grill smoke damage my camera and lens? /!/ I stood a meter or two away from a charcoal grill to take photos of the food that was being cooked on it. They just looked too good. The breeze angled slightly towards my direction so a bit of smoke did touch my camera and lens (Nikkormat FTN). I stood in that spot for about 10 minutes too while waiting for my order. \n\nWhen I got home, I noticed some oils and dust on the UV lens filter, which I promptly cleaned off. I'm not really sure if this was from the barbecue photo-taking or just normal use, because I did take a walk around for a few hours with my camera before stopping at the grill to buy food. I also used a hand-pumped air blower to get as much dust and dirt off as I can on the camera and lens body (not that there was a lot) before putting it in a dry box with my other cameras. \n\nI read somewhere that smoke from oil can settle as grease when it touches a surface. The same goes for creosote that comes from burning charcoal. Kinda worried that they might gunk up the mechanical parts inside.\n\nShould I be worried about any damage to my camera and lens stemming from that experience? Thanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l6bduj/can_barbecuegrill_smoke_damage_my_camera_and_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can barbecue/grill smoke damage my camera and lens? /!/ i stood a meter or two away from a charcoal grill to take photos of the food that was being cooked on it. they just looked too good. the breeze angled slightly towards my direction so a bit of smoke did touch my camera and lens (nikkormat ftn). i stood in that -----> spot !!!  for about 10 minutes too while waiting for my order. \n\nwhen i got home, i noticed some oils and dust on the uv lens filter, which i promptly cleaned off. i'm not really sure if this was from the barbecue photo-taking or just normal use, because i did take a walk around for a few hours with my camera before stopping at the grill to buy food. i also used a hand-pumped air blower to get as much dust and dirt off as i can on the camera and lens body (not that there was a lot) before putting it in a dry box with my other cameras. \n\ni read somewhere that smoke from oil can settle as grease when it touches a surface. the same goes for creosote that comes from burning charcoal. kinda worried that they might gunk up the mechanical parts inside.\n\nshould i be worried about any damage to my camera and lens stemming from that experience? thanks in advance.", "sortedWord": "None", "identifyer": 948, "year": "2021"}, {"Unnamed: 0": 255554, "autor": "Bryx97", "date": 1611769063000, "content": "Is there any way to fix this black spot? ( Minolta XTsi )", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l69wzc/is_there_any_way_to_fix_this_black_spot_minolta/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there any way to fix this black -----> spot !!! ? ( minolta xtsi )", "sortedWord": "None", "identifyer": 958, "year": "2021"}, {"Unnamed: 0": 255625, "autor": "Hibachi1969", "date": 1626349148000, "content": "Spot inside Lens after cleaning", "link": "https://www.reddit.com/r/AnalogCommunity/comments/okr2ky/spot_inside_lens_after_cleaning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  inside lens after cleaning", "sortedWord": "None", "identifyer": 1031, "year": "2021"}, {"Unnamed: 0": 255650, "autor": "ProChameleons", "date": 1626299739000, "content": "Yashica 12 Battery Connector Loose /!/ I have a Yashica 12 with a loose battery connector seat. I can push it back into the housing in it's spot and it holds loosely but I'm out of batteries at the moment to see if that alone will work.\n\nThoughts on if it will work? Will I need to take the side panel off to fix this or is there a way where I will not have to?\n\nThanks in advanced!\n\n[Camera and Connector](https://i.imgur.com/qzwRIIJ.jpg)\n\n[Battery Housing](https://i.imgur.com/jYkldwG.jpg)\n\n[Connector](https://i.imgur.com/54ZgvB8.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/okensw/yashica_12_battery_connector_loose/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yashica 12 battery connector loose /!/ i have a yashica 12 with a loose battery connector seat. i can push it back into the housing in it's -----> spot !!!  and it holds loosely but i'm out of batteries at the moment to see if that alone will work.\n\nthoughts on if it will work? will i need to take the side panel off to fix this or is there a way where i will not have to?\n\nthanks in advanced!\n\n[camera and connector](https://i.imgur.com/qzwriij.jpg)\n\n[battery housing](https://i.imgur.com/jykldwg.jpg)\n\n[connector](https://i.imgur.com/54zgvb8.jpg)", "sortedWord": "None", "identifyer": 1056, "year": "2021"}, {"Unnamed: 0": 255662, "autor": "apool022", "date": 1627664170000, "content": "Calling All Photographers in Ohio! /!/ I started a subreddit dedicated to documenting the coolest spots in Ohio we can find. If thats your cup of sake and you live in ohio, give it a follow and share some photos. Anything is accepted as long as its in Ohio lol, locations are accepted and encouraged but not necessary! Thank you and have a good day! The sub is called, “r/beautifulohio”", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ouohi6/calling_all_photographers_in_ohio/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "calling all photographers in ohio! /!/ i started a subreddit dedicated to documenting the coolest -----> spots !!!  in ohio we can find. if thats your cup of sake and you live in ohio, give it a follow and share some photos. anything is accepted as long as its in ohio lol, locations are accepted and encouraged but not necessary! thank you and have a good day! the sub is called, “r/beautifulohio”", "sortedWord": "None", "identifyer": 1069, "year": "2021"}, {"Unnamed: 0": 255794, "autor": "Oldico", "date": 1621087696000, "content": "Ricoh TLS 401 advance lever won't return on it's own. /!/ I recently got a free beat-up TLS 401 with lenses and Nikon D50 when I spotted them sitting in a basket at our local car mechanic. The camera was very dirty and the bottom plate was hanging from one screw - but it fires perfectly. It really is one tank of a camera.\n\nOnly the advance lever doesn't return itself. It clearly has tension right up until you fully cock the metal blade shutter and I've checked the springs and lubricated the levers under the bottom plate. It also snaps back if you fire the shutter with a screwdriver from the inside (the release is locked until the lever is at rest position). So I don't really have an idea what this is caused by or where to find it.\n\nI removed the top plate - but in the process braking the brittle mirror position knob since it's top plate was glued shut and I could not remove the screw (nothing unfixable though). Still could not see what this is caused by.\n\nIf anyone has ideas or knows this issue I'd be glad to hear any information available.\n\ntl;dr - wind lever won't return if the shutter is cocked but the return spring is fine and it has more than enough tension to snap back if you release the shutter from inside.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nczopl/ricoh_tls_401_advance_lever_wont_return_on_its_own/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "ricoh tls 401 advance lever won't return on it's own. /!/ i recently got a free beat-up tls 401 with lenses and nikon d50 when i -----> spotted !!!  them sitting in a basket at our local car mechanic. the camera was very dirty and the bottom plate was hanging from one screw - but it fires perfectly. it really is one tank of a camera.\n\nonly the advance lever doesn't return itself. it clearly has tension right up until you fully cock the metal blade shutter and i've checked the springs and lubricated the levers under the bottom plate. it also snaps back if you fire the shutter with a screwdriver from the inside (the release is locked until the lever is at rest position). so i don't really have an idea what this is caused by or where to find it.\n\ni removed the top plate - but in the process braking the brittle mirror position knob since it's top plate was glued shut and i could not remove the screw (nothing unfixable though). still could not see what this is caused by.\n\nif anyone has ideas or knows this issue i'd be glad to hear any information available.\n\ntl;dr - wind lever won't return if the shutter is cocked but the return spring is fine and it has more than enough tension to snap back if you release the shutter from inside.", "sortedWord": "None", "identifyer": 1201, "year": "2021"}, {"Unnamed: 0": 255819, "autor": "SugarHouse666", "date": 1621024839000, "content": "Are these blue spots light leaks, development errors, or scanning errors?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ncifvf/are_these_blue_spots_light_leaks_development/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are these blue -----> spots !!!  light leaks, development errors, or scanning errors?", "sortedWord": "None", "identifyer": 1226, "year": "2021"}, {"Unnamed: 0": 255882, "autor": "yahtzee466", "date": 1623032772000, "content": "New to film, and noticed that every one of my shots had this dust particle thing /!/ As the post indicates, I'm new to film photography and noticed that in every one of my shots, a dust spot shows up in the same spot. The pictures in question where taken using a AE1 Program and I want to know what part of the camera needs cleaning in order to get rid of this/or if there's some sort of mechanical issue. \n\nCould this also be a error on the part of the person scanning my film?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nu1s7h/new_to_film_and_noticed_that_every_one_of_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "new to film, and noticed that every one of my shots had this dust particle thing /!/ as the post indicates, i'm new to film photography and noticed that in every one of my shots, a dust -----> spot !!!  shows up in the same -----> spot !!! . the pictures in question where taken using a ae1 program and i want to know what part of the camera needs cleaning in order to get rid of this/or if there's some sort of mechanical issue. \n\ncould this also be a error on the part of the person scanning my film?", "sortedWord": "None", "identifyer": 1289, "year": "2021"}, {"Unnamed: 0": 255997, "autor": "Ridagstran", "date": 1622233034000, "content": "Frustrations with poor scans /!/ Is anyone else finding that getting great colors with scans is so tricky? I've scanned \\~40 rolls myself, tried three different photo labs (including Richard), and found that in all cases it's rare to get scans that have great colors. There just always seems to be something that is off and not in a good way, most often glaringly so in the case of lab scans. And that's just the color-- often times there are other issues like contrast with lab scans. I know what under and overexposed shots look like (because I've taken them my fair share of them) and it's not that.\n\nContrast this with shooting digital using a WB card, and 9/10 times everything is spot on. I LOVE my OM-2N with all my heart, but it's just not worth it for me if my shots look lame all the time. Only other thought is to try making my own prints to handle the neg to pos conversion, but that's a whole other hobby to get into.\n\nAny suggestions? I feel worn-down trying to chase perfect film photos for so long now, and saddened at the prospect of leaving film photography for digital.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nn6l42/frustrations_with_poor_scans/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "frustrations with poor scans /!/ is anyone else finding that getting great colors with scans is so tricky? i've scanned \\~40 rolls myself, tried three different photo labs (including richard), and found that in all cases it's rare to get scans that have great colors. there just always seems to be something that is off and not in a good way, most often glaringly so in the case of lab scans. and that's just the color-- often times there are other issues like contrast with lab scans. i know what under and overexposed shots look like (because i've taken them my fair share of them) and it's not that.\n\ncontrast this with shooting digital using a wb card, and 9/10 times everything is -----> spot !!!  on. i love my om-2n with all my heart, but it's just not worth it for me if my shots look lame all the time. only other thought is to try making my own prints to handle the neg to pos conversion, but that's a whole other hobby to get into.\n\nany suggestions? i feel worn-down trying to chase perfect film photos for so long now, and saddened at the prospect of leaving film photography for digital.", "sortedWord": "None", "identifyer": 1407, "year": "2021"}, {"Unnamed: 0": 256260, "autor": "birds_ar3nt_r3al", "date": 1619709672000, "content": "Flash Attachment for Nikon Fm2 /!/ Hey guys, \n\nLooking for a nice flash attachment for my Nikon Fm2. I think there are a few spots to attach a flash but I don't know how to go about picking one. Which brand should I get? What does it need to look/be like? Also not looking to spend a crazy amount. Any advice would help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n16p9u/flash_attachment_for_nikon_fm2/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "flash attachment for nikon fm2 /!/ hey guys, \n\nlooking for a nice flash attachment for my nikon fm2. i think there are a few -----> spots !!!  to attach a flash but i don't know how to go about picking one. which brand should i get? what does it need to look/be like? also not looking to spend a crazy amount. any advice would help.", "sortedWord": "None", "identifyer": 1675, "year": "2021"}, {"Unnamed: 0": 256495, "autor": "thatguysean46", "date": 1624788114000, "content": "Is there a way to get rid of these blue/green spots and these dots sticking out on my Nikon FM2 body?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o8u7ou/is_there_a_way_to_get_rid_of_these_bluegreen/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is there a way to get rid of these blue/green -----> spots !!!  and these dots sticking out on my nikon fm2 body?", "sortedWord": "None", "identifyer": 1913, "year": "2021"}, {"Unnamed: 0": 256513, "autor": "76bay", "date": 1624749664000, "content": "It’s not an addiction if you can stop when you want to…. What do you spot?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o8lffc/its_not_an_addiction_if_you_can_stop_when_you/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it’s not an addiction if you can stop when you want to…. what do you -----> spot !!! ?", "sortedWord": "None", "identifyer": 1931, "year": "2021"}, {"Unnamed: 0": 256543, "autor": "And_Justice", "date": 1624699069000, "content": "Just a quick note about my recent experience with Ilford /!/ Ilford blew me away this morning. I had emailed their technical support department the other day (actually off the back of a post I put on here) to ask about a couple of weird spots I had seen on one of my negatives whilst using Delta 3200. After a few days, they contacted me back and asked if I could send across a scan. They looked over it and reckoned that this was a processing fault (possibly where some of the emulsion had lifted where it touched another negative on the reel) but they could never be 100% sure (but were pretty convinced). They said if I sent over my address they would be happy to send a replacement roll.\n\nThis morning (THE NEXT DAY), I receive a parcel in the mail. Two rolls of Delta 3200 with a hand written note explaining that she thought as I was shooting more specialised film, I might like to try out a roll of SFX which was also included in the package! I didn't expect in a million years for them to be so generous over something that was more than likely my fault. Thank you Ilford for restoring a bit of my faith in companies.\n\n(This is not a paid advertisement for Ilford, just a genuinely happy customer)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o87f03/just_a_quick_note_about_my_recent_experience_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just a quick note about my recent experience with ilford /!/ ilford blew me away this morning. i had emailed their technical support department the other day (actually off the back of a post i put on here) to ask about a couple of weird -----> spots !!!  i had seen on one of my negatives whilst using delta 3200. after a few days, they contacted me back and asked if i could send across a scan. they looked over it and reckoned that this was a processing fault (possibly where some of the emulsion had lifted where it touched another negative on the reel) but they could never be 100% sure (but were pretty convinced). they said if i sent over my address they would be happy to send a replacement roll.\n\nthis morning (the next day), i receive a parcel in the mail. two rolls of delta 3200 with a hand written note explaining that she thought as i was shooting more specialised film, i might like to try out a roll of sfx which was also included in the package! i didn't expect in a million years for them to be so generous over something that was more than likely my fault. thank you ilford for restoring a bit of my faith in companies.\n\n(this is not a paid advertisement for ilford, just a genuinely happy customer)", "sortedWord": "None", "identifyer": 1962, "year": "2021"}, {"Unnamed: 0": 256623, "autor": "S_pline", "date": 1613590921000, "content": "Quick question: does anyone know what the line down the middle of the viewfinder is... and the spots, dust or fungus ?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lm2srp/quick_question_does_anyone_know_what_the_line/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "quick question: does anyone know what the line down the middle of the viewfinder is... and the -----> spots !!! , dust or fungus ?", "sortedWord": "None", "identifyer": 2043, "year": "2021"}, {"Unnamed: 0": 256666, "autor": "jopnk", "date": 1614742936000, "content": "where to get a point and shoot fixed? /!/ Bought a Pentax Espio 80 over the summer and love shooting with it, but the motor bugged out and doesn't advance every frame properly/will trigger a rewind between frames 17-30, leaving a lot of wasted film. Would love to get this bad larry fixed but most camera repair places I've reached out to (local spots in manhattan) have said they can't/won't fix it. Any advice or recommended places to send for a repair?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lwkb67/where_to_get_a_point_and_shoot_fixed/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "where to get a point and shoot fixed? /!/ bought a pentax espio 80 over the summer and love shooting with it, but the motor bugged out and doesn't advance every frame properly/will trigger a rewind between frames 17-30, leaving a lot of wasted film. would love to get this bad larry fixed but most camera repair places i've reached out to (local -----> spots !!!  in manhattan) have said they can't/won't fix it. any advice or recommended places to send for a repair?", "sortedWord": "None", "identifyer": 2086, "year": "2021"}, {"Unnamed: 0": 256690, "autor": "kwozymodo", "date": 1614171830000, "content": "DSLR scanning negatives showing LED pattern in some photos /!/ Feel like I'm going insane here but in some of my photos (almost always 120mm) the LEDs on my Slimlite Plano seem to show up, particular in large bright/dark spots that have mostly the same colour (sky, shadows etc.)\n\nHere are two photos taken minutes apart with more or less the same settings on my RB67 and my A7Rii had the same settings for both when scanning. Is it an issue with over/under exposed film? Over/under exposed scan? Bad panel? Also yes my negative is filthy haha, really should take better care of them\n\nhttps://imgur.com/a/OTMB0Z2\n\nHoly jeebus someone help cause I'm running out of ideas!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lrce7b/dslr_scanning_negatives_showing_led_pattern_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dslr scanning negatives showing led pattern in some photos /!/ feel like i'm going insane here but in some of my photos (almost always 120mm) the leds on my slimlite plano seem to show up, particular in large bright/dark -----> spots !!!  that have mostly the same colour (sky, shadows etc.)\n\nhere are two photos taken minutes apart with more or less the same settings on my rb67 and my a7rii had the same settings for both when scanning. is it an issue with over/under exposed film? over/under exposed scan? bad panel? also yes my negative is filthy haha, really should take better care of them\n\nhttps://imgur.com/a/otmb0z2\n\nholy jeebus someone help cause i'm running out of ideas!", "sortedWord": "None", "identifyer": 2111, "year": "2021"}, {"Unnamed: 0": 256783, "autor": "TheCheesebal", "date": 1634490957000, "content": "Spotted in Darmstadt Landesmuseum, shame I can't get behind that glass...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qa32qg/spotted_in_darmstadt_landesmuseum_shame_i_cant/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  in darmstadt landesmuseum, shame i can't get behind that glass...", "sortedWord": "None", "identifyer": 2206, "year": "2021"}, {"Unnamed: 0": 256918, "autor": "turnpot", "date": 1630719273000, "content": "Lead on where to rent ULF cameras in SF Bay Area? /!/ I'm considering a project that would need an 11x14 or 16x20 camera.  I would need a camera, lens, lens board, and a couple holders.  I live near San Francisco (San Jose, specifically). Does anyone know of a spot that provides this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/phib1c/lead_on_where_to_rent_ulf_cameras_in_sf_bay_area/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lead on where to rent ulf cameras in sf bay area? /!/ i'm considering a project that would need an 11x14 or 16x20 camera.  i would need a camera, lens, lens board, and a couple holders.  i live near san francisco (san jose, specifically). does anyone know of a -----> spot !!!  that provides this?", "sortedWord": "None", "identifyer": 2343, "year": "2021"}, {"Unnamed: 0": 257033, "autor": "Porkchops678", "date": 1628800342000, "content": "Help/Tips: Cleaning Inside of Lenses /!/ I’ve just bought a Zuiko 50mm f1.4 Lens off eBay and unfortunately there is some dirt and black spots on the inside of the lens, which I believe is prominent enough to show up in my negatives. \n\nIs disassembling and cleaning this something anyone can do at home for these types of lenses? Or should this be done by a professional? \n\nIf this is easier than it looks like, are there any tips to cleaning it well, and not screwing anything up? \n\nThanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p387kz/helptips_cleaning_inside_of_lenses/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help/tips: cleaning inside of lenses /!/ i’ve just bought a zuiko 50mm f1.4 lens off ebay and unfortunately there is some dirt and black -----> spots !!!  on the inside of the lens, which i believe is prominent enough to show up in my negatives. \n\nis disassembling and cleaning this something anyone can do at home for these types of lenses? or should this be done by a professional? \n\nif this is easier than it looks like, are there any tips to cleaning it well, and not screwing anything up? \n\nthanks in advance!", "sortedWord": "None", "identifyer": 2459, "year": "2021"}, {"Unnamed: 0": 257124, "autor": "vandalxvisuals", "date": 1612987581000, "content": "Good camera bag for a larger gear setup? /!/ I currently have a Pentax 67 with 3 lenses, a TLR, and a few other cameras and I'm looking for a bag that at least fits the Pentax with its lenses. I don't want an enormous bag, one, because it takes up too much space and is hard to walk with. Two, it encourages me to bring more gear that I don't need or don't end up using. It's hard finding that sweet spot bag that fits a rather large camera but isn't comically huge. If you have any suggestions from personal experience please let me know!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lh2gtg/good_camera_bag_for_a_larger_gear_setup/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good camera bag for a larger gear setup? /!/ i currently have a pentax 67 with 3 lenses, a tlr, and a few other cameras and i'm looking for a bag that at least fits the pentax with its lenses. i don't want an enormous bag, one, because it takes up too much space and is hard to walk with. two, it encourages me to bring more gear that i don't need or don't end up using. it's hard finding that sweet -----> spot !!!  bag that fits a rather large camera but isn't comically huge. if you have any suggestions from personal experience please let me know!", "sortedWord": "None", "identifyer": 2552, "year": "2021"}, {"Unnamed: 0": 257125, "autor": "mikimekimaki", "date": 1612987226000, "content": "Not sure what this small spots are. Any thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lh2bfu/not_sure_what_this_small_spots_are_any_thoughts/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "not sure what this small -----> spots !!!  are. any thoughts?", "sortedWord": "None", "identifyer": 2553, "year": "2021"}, {"Unnamed: 0": 257126, "autor": "[deleted]", "date": 1612987167000, "content": "Not sure what this white spots are on my lens /!/ [deleted]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lh2afo/not_sure_what_this_white_spots_are_on_my_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "not sure what this white -----> spots !!!  are on my lens /!/ [deleted]", "sortedWord": "None", "identifyer": 2554, "year": "2021"}, {"Unnamed: 0": 257175, "autor": "Coul33t", "date": 1612877180000, "content": "Advices wanted for a medium format camera, no more than 500€ (details inside) /!/ Greetings everyone!  \n\nI'm a \" seasoned \" 35mm shooter, and I want to try medium format. Well, I've already tried it with a Lomography camera, but I want to continue with a more serious camera. I live in Europe (France), so I'm using euros, but 500€ is approximately 600$. There's no brick shop near where I leave, so I want to buy it online. \n\nPlease, do not tell me that I can find \" XXX \" camera (such as Pentax 67) for 200$, because that basically never happens (or else I'm not looking where I should; in that case, I'd like if you could tell me some good places online to look for these kind of deals).  \n\nI've been watching a bit of stuff about medium format camera, and I came across a few ones:  \n\n- Belair: plastic, lenses are not really reliable, too much \"Lomo\" in general (I know how their camera behave, I have a few ones)\n- Pentax 67 (obviously): very expensive  \n- Pentacon Six: should be avoided if I'm not mistaken (too much problems)  \n- Kiev 60/88 (I have a soft spot for bulky USSR camera, such as my Zenit TTL): film \"rolling\" problems  \n- **Mamiya 645**: seems good overall? That's the one I'm looking at atm  \n- **Hartblei and ARAX**: seems really nice, a bit expensive with the MLU tho (a bit above my budget)  \n\nSo, here I am, asking for your advice. Ideally, I'd rather have a 6x6 format, but I'm ok with 6x4.5 or 6x9. I prefer manual cameras, and I don't care if there isn't any light meter or automatic functions. I would like a camera with a (removable) prism finder. I really don't care about it being bulky or not (remember, I'm an old Soviet stuff lover). The Hartblei and ARAX are basically custom Kiev 60/88 (if I'm not mistaken), but as I said, it's a bit over my budget.  \n\nMy questions are: from what I told you about what I like,  \n\n- What would be the best one for me (no budget consideration)?  \n- What would be the best one for me, taking in account my budget?  \n- Did I forgot some well-known medium format camera that would suit my needs?  \n- Do you have any suggestions about anything that I forgot to list?  \n\nFeel free to ask any further questions if I forgot something. Cheers!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lg3afm/advices_wanted_for_a_medium_format_camera_no_more/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "advices wanted for a medium format camera, no more than 500€ (details inside) /!/ greetings everyone!  \n\ni'm a \" seasoned \" 35mm shooter, and i want to try medium format. well, i've already tried it with a lomography camera, but i want to continue with a more serious camera. i live in europe (france), so i'm using euros, but 500€ is approximately 600$. there's no brick shop near where i leave, so i want to buy it online. \n\nplease, do not tell me that i can find \" xxx \" camera (such as pentax 67) for 200$, because that basically never happens (or else i'm not looking where i should; in that case, i'd like if you could tell me some good places online to look for these kind of deals).  \n\ni've been watching a bit of stuff about medium format camera, and i came across a few ones:  \n\n- belair: plastic, lenses are not really reliable, too much \"lomo\" in general (i know how their camera behave, i have a few ones)\n- pentax 67 (obviously): very expensive  \n- pentacon six: should be avoided if i'm not mistaken (too much problems)  \n- kiev 60/88 (i have a soft -----> spot !!!  for bulky ussr camera, such as my zenit ttl): film \"rolling\" problems  \n- **mamiya 645**: seems good overall? that's the one i'm looking at atm  \n- **hartblei and arax**: seems really nice, a bit expensive with the mlu tho (a bit above my budget)  \n\nso, here i am, asking for your advice. ideally, i'd rather have a 6x6 format, but i'm ok with 6x4.5 or 6x9. i prefer manual cameras, and i don't care if there isn't any light meter or automatic functions. i would like a camera with a (removable) prism finder. i really don't care about it being bulky or not (remember, i'm an old soviet stuff lover). the hartblei and arax are basically custom kiev 60/88 (if i'm not mistaken), but as i said, it's a bit over my budget.  \n\nmy questions are: from what i told you about what i like,  \n\n- what would be the best one for me (no budget consideration)?  \n- what would be the best one for me, taking in account my budget?  \n- did i forgot some well-known medium format camera that would suit my needs?  \n- do you have any suggestions about anything that i forgot to list?  \n\nfeel free to ask any further questions if i forgot something. cheers!", "sortedWord": "None", "identifyer": 2604, "year": "2021"}, {"Unnamed: 0": 257208, "autor": "zachsilvey", "date": 1628282627000, "content": "My loadout for a week in NYC, open to suggestions for must-visit spots off the beaten path", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ozf5az/my_loadout_for_a_week_in_nyc_open_to_suggestions/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my loadout for a week in nyc, open to suggestions for must-visit -----> spots !!!  off the beaten path", "sortedWord": "None", "identifyer": 2639, "year": "2021"}, {"Unnamed: 0": 257231, "autor": "cm_kitschklock", "date": 1628241393000, "content": "My new zine! “Symbiosis” is a small collection of photos of spotting pairs of people in the city. The zine explores the different ways that two people can have a “symbiotic” relationship with each other.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oz3481/my_new_zine_symbiosis_is_a_small_collection_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "my new zine! “symbiosis” is a small collection of photos of -----> spotting !!!  pairs of people in the city. the zine explores the different ways that two people can have a “symbiotic” relationship with each other.", "sortedWord": "None", "identifyer": 2663, "year": "2021"}, {"Unnamed: 0": 257348, "autor": "mechmechmech", "date": 1631907815000, "content": "Leica CL / built-in spot meters - how difficult is it to get a good exposure? /!/ Hello,\n\nDisclosure, I'm a film / metering newbie and I'm looking to buy a Leica CL for it's size, weight and mechanical build. \n\nWhen I try spot metering on my digital camera, I get wildly different exposures depending on what I'm aiming at - as is expected. Given that the spot meter on the Leica CL only covers 7% of the frame, I'm wondering how easy it is to consistently get a good exposure.\n\nOf all the metering tutorials I've seen, spot metering seems to require the most thought. I've seen people metering for shadows, metering for light and dark and averaging the values and various other techniques. I know for sure that I couldn't point out 'middle gray' in a scene right now.\n\nSo my question is, for Leica CL owners and owners of other cameras with spot meters - is it possible to consistently get good exposures with the built-in spot meter? Or should I be looking for a camera with an averaging meter instead?\n\nThanks in advance", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pq787i/leica_cl_builtin_spot_meters_how_difficult_is_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica cl / built-in -----> spot !!!  meters - how difficult is it to get a good exposure? /!/ hello,\n\ndisclosure, i'm a film / metering newbie and i'm looking to buy a leica cl for it's size, weight and mechanical build. \n\nwhen i try spot metering on my digital camera, i get wildly different exposures depending on what i'm aiming at - as is expected. given that the spot meter on the leica cl only covers 7% of the frame, i'm wondering how easy it is to consistently get a good exposure.\n\nof all the metering tutorials i've seen, spot metering seems to require the most thought. i've seen people metering for shadows, metering for light and dark and averaging the values and various other techniques. i know for sure that i couldn't point out 'middle gray' in a scene right now.\n\nso my question is, for leica cl owners and owners of other cameras with spot meters - is it possible to consistently get good exposures with the built-in spot meter? or should i be looking for a camera with an averaging meter instead?\n\nthanks in advance", "sortedWord": "None", "identifyer": 2783, "year": "2021"}, {"Unnamed: 0": 257396, "autor": "GoExistential", "date": 1612420688000, "content": "1 window only ventilation for processing? RO9 toxicity? /!/ Usually I develop In a small laundry room with an open window in front of the sink and a open doorway behind me. The way I saw it was that air can easily come in and out of the room keeping fumes from gathering. \n\nToday I developed my first roll in a while but had to keep the door closed behind me and only had the 1 window open. Didn’t feel any noticeable breeze coming through just some light cool air. \n\nI was using RO9 one shot, an acid stop bath, and I’m Ilford rapid fixer... and now I’m extremely anxious I potentially harmed myself with these toxic chemicals and basically no ventilation for the whole 20 minute process. \n\nIs this anything to worry about? It’s my first Tim developing in RO9, since it’s based on older processing formulas is it especially toxic? \n\nI’ll try to put together a spot with better ventilation in the future I was just impatient tonight", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lc9nj7/1_window_only_ventilation_for_processing_ro9/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "1 window only ventilation for processing? ro9 toxicity? /!/ usually i develop in a small laundry room with an open window in front of the sink and a open doorway behind me. the way i saw it was that air can easily come in and out of the room keeping fumes from gathering. \n\ntoday i developed my first roll in a while but had to keep the door closed behind me and only had the 1 window open. didn’t feel any noticeable breeze coming through just some light cool air. \n\ni was using ro9 one shot, an acid stop bath, and i’m ilford rapid fixer... and now i’m extremely anxious i potentially harmed myself with these toxic chemicals and basically no ventilation for the whole 20 minute process. \n\nis this anything to worry about? it’s my first tim developing in ro9, since it’s based on older processing formulas is it especially toxic? \n\ni’ll try to put together a -----> spot !!!  with better ventilation in the future i was just impatient tonight", "sortedWord": "None", "identifyer": 2833, "year": "2021"}, {"Unnamed: 0": 257429, "autor": "turnpot", "date": 1612376845000, "content": "Do y'all really prefer plastic reels? /!/ I see people talking almost exclusively about Patterson tanks, recommending then to beginners, etc.  But honestly, I find them finicky, unreliable, and with too many moving parts.  Plus, you have to worry about them getting gunked up.  Also, the very edges of my film often got messed up (didn't develop) from the patterson tank, which doesn't affect image quality or anything, but still kinda annoying.  \nMaybe it's just a matter of what you learn on, but I have both and have used both, before I got a steel reel for 120. I've done at least 60 rolls of 35mm and 120 on plastic, and a lot more on steel.  \n\nIf you've never used steel reels and tanks, and you find some cheap at a yard sale or pick them up with some darkroom stuff, I implore you, spend awhile practicing on them and learning them.  Then decide if you like them or not.  Personally, I like the durability, simplicity, and the way how, once you get in the groove, the whole roll just slides on.  It's like that feeling when you're cutting with a pair of scissors, and you hit the sweet spot and it just slides down the paper.\n\nCan anyone give me any reasons I'm missing as to why patterson tanks might be a better bet in some cases?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lbudcz/do_yall_really_prefer_plastic_reels/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do y'all really prefer plastic reels? /!/ i see people talking almost exclusively about patterson tanks, recommending then to beginners, etc.  but honestly, i find them finicky, unreliable, and with too many moving parts.  plus, you have to worry about them getting gunked up.  also, the very edges of my film often got messed up (didn't develop) from the patterson tank, which doesn't affect image quality or anything, but still kinda annoying.  \nmaybe it's just a matter of what you learn on, but i have both and have used both, before i got a steel reel for 120. i've done at least 60 rolls of 35mm and 120 on plastic, and a lot more on steel.  \n\nif you've never used steel reels and tanks, and you find some cheap at a yard sale or pick them up with some darkroom stuff, i implore you, spend awhile practicing on them and learning them.  then decide if you like them or not.  personally, i like the durability, simplicity, and the way how, once you get in the groove, the whole roll just slides on.  it's like that feeling when you're cutting with a pair of scissors, and you hit the sweet -----> spot !!!  and it just slides down the paper.\n\ncan anyone give me any reasons i'm missing as to why patterson tanks might be a better bet in some cases?", "sortedWord": "None", "identifyer": 2868, "year": "2021"}, {"Unnamed: 0": 257517, "autor": "AllMaya", "date": 1634594376000, "content": "My $200 Craigslist score /!/ Never thought I'd get to make one of those posts with the insane wins! Responded to a CL ad for a photo enlarger and spotted the Nikon scanner while I was there and I could barely contain my excitement after he told me how much he wanted for it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qax0on/my_200_craigslist_score/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "my $200 craigslist score /!/ never thought i'd get to make one of those posts with the insane wins! responded to a cl ad for a photo enlarger and -----> spotted !!!  the nikon scanner while i was there and i could barely contain my excitement after he told me how much he wanted for it.", "sortedWord": "None", "identifyer": 2956, "year": "2021"}, {"Unnamed: 0": 257552, "autor": "GraviNty", "date": 1634546478000, "content": "Calculate average exposure with 2 meter values? /!/ Hello,\n\n&amp;#x200B;\n\nI just got a light meter for my camera. I was wondering if there is a way to calculate the average exposure value on your own without having to have a more expensive meter device. I could not find a definitive answer online. \n\n&amp;#x200B;\n\nAnother small thing I just couldn't figure out as well: is reflective and spot metering the same? \n\n&amp;#x200B;\n\nSorry if its a dumb question lol", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qaim8o/calculate_average_exposure_with_2_meter_values/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "calculate average exposure with 2 meter values? /!/ hello,\n\n&amp;#x200b;\n\ni just got a light meter for my camera. i was wondering if there is a way to calculate the average exposure value on your own without having to have a more expensive meter device. i could not find a definitive answer online. \n\n&amp;#x200b;\n\nanother small thing i just couldn't figure out as well: is reflective and -----> spot !!!  metering the same? \n\n&amp;#x200b;\n\nsorry if its a dumb question lol", "sortedWord": "None", "identifyer": 2992, "year": "2021"}, {"Unnamed: 0": 257587, "autor": "Arixanen", "date": 1629546489000, "content": "Is this fungus? /!/ I was just gifted a film camera body. Camera is supposed to be in good condition but when I look through the viewfinder I see this light amber colored rectangle(?). Is this fungus?\n\n\nThere’s also other small spots that I’m not too concerned about. \n\n\n[Viewfinder pic](https://imgur.com/a/fLfVxic)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p8q25z/is_this_fungus/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is this fungus? /!/ i was just gifted a film camera body. camera is supposed to be in good condition but when i look through the viewfinder i see this light amber colored rectangle(?). is this fungus?\n\n\nthere’s also other small -----> spots !!!  that i’m not too concerned about. \n\n\n[viewfinder pic](https://imgur.com/a/flfvxic)", "sortedWord": "None", "identifyer": 3027, "year": "2021"}, {"Unnamed: 0": 257709, "autor": "MerlsBeard", "date": 1630009800000, "content": "Lens spot?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pc7uy3/lens_spot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens -----> spot !!! ?", "sortedWord": "None", "identifyer": 3151, "year": "2021"}, {"Unnamed: 0": 257871, "autor": "NE3K3RS", "date": 1632366300000, "content": "Minolta Freedom Zoom 9T trouble shooting /!/ Hey! I’m not sure if this is the right spot to post this but just hoping maybe someone has some sort of advice for me, \nI just got a point and shoot Minolta freedom zoom 9T from Facebook market to place and was really excited to start using it, however it keeps eating my film. I’ll load it it takes about 2 pictures then it will stop turning on - and just rewind the film back. I’ve got the film out and reloaded it a few times, changed the battery - basically tried any easy fixes I could think of…any suggestions on what the issue might be? I have a Minolta Hi-Matic and was just hoping to have something a little less fragile to take on adventures :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ptm7i7/minolta_freedom_zoom_9t_trouble_shooting/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "minolta freedom zoom 9t trouble shooting /!/ hey! i’m not sure if this is the right -----> spot !!!  to post this but just hoping maybe someone has some sort of advice for me, \ni just got a point and shoot minolta freedom zoom 9t from facebook market to place and was really excited to start using it, however it keeps eating my film. i’ll load it it takes about 2 pictures then it will stop turning on - and just rewind the film back. i’ve got the film out and reloaded it a few times, changed the battery - basically tried any easy fixes i could think of…any suggestions on what the issue might be? i have a minolta hi-matic and was just hoping to have something a little less fragile to take on adventures :)", "sortedWord": "None", "identifyer": 3314, "year": "2021"}, {"Unnamed: 0": 258082, "autor": "Some_Fox7979", "date": 1633199813000, "content": "Weird smudge on every shot /!/ Hello guys, I'm a bit sad because after developing (lab), I've realised that almost every negative have some kind of a weird smudge on it. I don't think that it has anything to do with scanning and software for negative conversion, because it can be seen on negatives themself.  \n\n\nSamples:  \nConverted negative: [https://ibb.co/9sHqTq6](https://ibb.co/9sHqTq6)  \nNegative: [https://ibb.co/tZZZzvb](https://ibb.co/tZZZzvb)  \n\n\nIs it a lens problem? The smudge is always on the same spot. Thank you guys!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q00r8x/weird_smudge_on_every_shot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird smudge on every shot /!/ hello guys, i'm a bit sad because after developing (lab), i've realised that almost every negative have some kind of a weird smudge on it. i don't think that it has anything to do with scanning and software for negative conversion, because it can be seen on negatives themself.  \n\n\nsamples:  \nconverted negative: [https://ibb.co/9shqtq6](https://ibb.co/9shqtq6)  \nnegative: [https://ibb.co/tzzzzvb](https://ibb.co/tzzzzvb)  \n\n\nis it a lens problem? the smudge is always on the same -----> spot !!! . thank you guys!", "sortedWord": "None", "identifyer": 3528, "year": "2021"}, {"Unnamed: 0": 258110, "autor": "David-D15", "date": 1633135774000, "content": "Olympus Om-1 film won’t advance /!/ as stated in the title the film on my on-1 will not advance. i opened it up to check the idler gear that is often cited for this problem but that part is lined up fine. \nWhat i realized is that the mechanism is not returning all the way to the start point after clicking the shutter. the spot i circled shows where the mechanism stops itself and in the next picture it’s where it’s supposed to be. i can push the mechanism all the way back to the starting point and advance the film activate the shutter and then it gets stuck again. i cleaned off a few spots but still feel a lot of resistance. if anyone knows what’s happening here and how to fix it it would be greatly appreciated.  \n[https://imgur.com/a/9ly3Vh0](https://imgur.com/a/9ly3Vh0)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pzl1ul/olympus_om1_film_wont_advance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "olympus om-1 film won’t advance /!/ as stated in the title the film on my on-1 will not advance. i opened it up to check the idler gear that is often cited for this problem but that part is lined up fine. \nwhat i realized is that the mechanism is not returning all the way to the start point after clicking the shutter. the -----> spot !!!  i circled shows where the mechanism stops itself and in the next picture it’s where it’s supposed to be. i can push the mechanism all the way back to the starting point and advance the film activate the shutter and then it gets stuck again. i cleaned off a few spots but still feel a lot of resistance. if anyone knows what’s happening here and how to fix it it would be greatly appreciated.  \n[https://imgur.com/a/9ly3vh0](https://imgur.com/a/9ly3vh0)", "sortedWord": "None", "identifyer": 3556, "year": "2021"}, {"Unnamed: 0": 258276, "autor": "anonymityweb", "date": 1615464626000, "content": "Questions about Fuji FP100c PODS... /!/ Hi all,\n\nI have just inherited x6 cold stored packs of FP100c, and some boxes have an unavoidable \"squished\" appearance, that I can not ignore, and wonder if this bent cardboard might reflect any damage to the PODS within.\n\nI want to ask how extreme does a boxes appearance need to be to safely assume the PODS inside have been compromised? Is there any way to check to see if the PODS have remained intact without testing the film? My boxes only have a slight concave to the centre of the packs, in the fabled \"soft spot\", but other than that are well looked after.\n\nAny advice or experience in this topic would be very much appreciated. In the meantime, they will remain in my film fridge in their vertical positioning.\n\nThanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m2oq2k/questions_about_fuji_fp100c_pods/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "questions about fuji fp100c pods... /!/ hi all,\n\ni have just inherited x6 cold stored packs of fp100c, and some boxes have an unavoidable \"squished\" appearance, that i can not ignore, and wonder if this bent cardboard might reflect any damage to the pods within.\n\ni want to ask how extreme does a boxes appearance need to be to safely assume the pods inside have been compromised? is there any way to check to see if the pods have remained intact without testing the film? my boxes only have a slight concave to the centre of the packs, in the fabled \"soft -----> spot !!! \", but other than that are well looked after.\n\nany advice or experience in this topic would be very much appreciated. in the meantime, they will remain in my film fridge in their vertical positioning.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 3724, "year": "2021"}, {"Unnamed: 0": 258316, "autor": "120m", "date": 1615362179000, "content": "Spot metering question /!/ I recently used a spot meter but I exposed for mostly the highlights, will the films turn out underexposed, especially since they're shot indoors.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m1sax8/spot_metering_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering question /!/ i recently used a spot meter but i exposed for mostly the highlights, will the films turn out underexposed, especially since they're shot indoors.", "sortedWord": "None", "identifyer": 3766, "year": "2021"}, {"Unnamed: 0": 258354, "autor": "jlcurt1", "date": 1633443565000, "content": "Potential Shutter Curtain Probelm (Minolta A-7) /!/ I'm having some strange results from my new Minolta A-7 (also known as Maxxum 7 or Dynax 7). A lot of the photos have come back great, but a few of them look really weirdly exposed, something I've only seen in the past when my cameras have had issues with the shutter curtain. These were taken on a variety of lenses so I'm not thinking it's a lens issue. You can see the really uneven spots of darkness, almost like the shutter curtain is covering that part of the negative for too long. Any ideas?\n\n \n\n[Upper right](https://preview.redd.it/mi8w5ykq4nr71.jpg?width=2407&amp;format=pjpg&amp;auto=webp&amp;s=eddd4cbedfb8621bf30189e1d2a72f9c357f287a)\n\n[Lower left](https://preview.redd.it/ttsae7un4nr71.jpg?width=2414&amp;format=pjpg&amp;auto=webp&amp;s=6afcbc05031e2da42acbf2a38330f3a67ab08045)\n\n[Upper right](https://preview.redd.it/c2bro0vm4nr71.jpg?width=2405&amp;format=pjpg&amp;auto=webp&amp;s=ed6e03c0de38e67b752fa1b76063d1986985e373)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q1xchg/potential_shutter_curtain_probelm_minolta_a7/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "potential shutter curtain probelm (minolta a-7) /!/ i'm having some strange results from my new minolta a-7 (also known as maxxum 7 or dynax 7). a lot of the photos have come back great, but a few of them look really weirdly exposed, something i've only seen in the past when my cameras have had issues with the shutter curtain. these were taken on a variety of lenses so i'm not thinking it's a lens issue. you can see the really uneven -----> spots !!!  of darkness, almost like the shutter curtain is covering that part of the negative for too long. any ideas?\n\n \n\n[upper right](https://preview.redd.it/mi8w5ykq4nr71.jpg?width=2407&amp;format=pjpg&amp;auto=webp&amp;s=eddd4cbedfb8621bf30189e1d2a72f9c357f287a)\n\n[lower left](https://preview.redd.it/ttsae7un4nr71.jpg?width=2414&amp;format=pjpg&amp;auto=webp&amp;s=6afcbc05031e2da42acbf2a38330f3a67ab08045)\n\n[upper right](https://preview.redd.it/c2bro0vm4nr71.jpg?width=2405&amp;format=pjpg&amp;auto=webp&amp;s=ed6e03c0de38e67b752fa1b76063d1986985e373)", "sortedWord": "None", "identifyer": 3804, "year": "2021"}, {"Unnamed: 0": 258562, "autor": "fotoloc0", "date": 1633940965000, "content": "Zone system workflow? /!/ I am beginning to dip my toes in LF photography and decided to learn about the zone system mostly from Ansel Adam’s book.\n\nWith that knowledge, I have come up with the following workflow to use this system in Practice Can anyone correct me or suggest any improvements to it?\n\nStep 0: Analyze the scene and identify the subject. In a landscape it could be a mountain or in a portrait it could be a face. Also analyze the dynamic range of the scene and whether it is enough to fit on your film type. If not you need to wait for more even light or change the fill type.\n\nStep 1: Identify what zone the tonality of this subject falls in. Say it’s zone 3.\n\nStep 2: Take a spot meter reading of this subject. This reading would be for zone 5. Depending on Step 1, either over or under expose this reading. If your subject was in zone 3 you need to underexpose by 2 stops the reading from this step. Same for the reverse case. \n\nStep 3: Take the shot.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q5rd4g/zone_system_workflow/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "zone system workflow? /!/ i am beginning to dip my toes in lf photography and decided to learn about the zone system mostly from ansel adam’s book.\n\nwith that knowledge, i have come up with the following workflow to use this system in practice can anyone correct me or suggest any improvements to it?\n\nstep 0: analyze the scene and identify the subject. in a landscape it could be a mountain or in a portrait it could be a face. also analyze the dynamic range of the scene and whether it is enough to fit on your film type. if not you need to wait for more even light or change the fill type.\n\nstep 1: identify what zone the tonality of this subject falls in. say it’s zone 3.\n\nstep 2: take a -----> spot !!!  meter reading of this subject. this reading would be for zone 5. depending on step 1, either over or under expose this reading. if your subject was in zone 3 you need to underexpose by 2 stops the reading from this step. same for the reverse case. \n\nstep 3: take the shot.", "sortedWord": "None", "identifyer": 4013, "year": "2021"}, {"Unnamed: 0": 258598, "autor": "bada_bing", "date": 1633878037000, "content": "I got a camera with lots fungus spots. Should I bother cleaning it or just throw it away? /!/ I figure It's probably impossible to get rid of all the existing fungus and it ends up infecting my lenses.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q59oa6/i_got_a_camera_with_lots_fungus_spots_should_i/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i got a camera with lots fungus -----> spots !!! . should i bother cleaning it or just throw it away? /!/ i figure it's probably impossible to get rid of all the existing fungus and it ends up infecting my lenses.", "sortedWord": "None", "identifyer": 4049, "year": "2021"}, {"Unnamed: 0": 258627, "autor": "SalmonSnail", "date": 1633822732000, "content": "Forget Rolleiflex TLR. Lets talk about the weird, cheap, and basically useless competitor TLR's such as BabyFlex, ArgoFlex, PigeonFlex, &amp; WelmyFlex. Has anyone bought a &lt;$80 TLR off-brand camera? What was your experience? /!/ I just had a pot of coffee, opened up \"TLR Camera\" on eBay, and wrote down 6 full index cards worth of \"-Flex\" models from various manufacturers.\n\nSome of these bad boys go for upwards of twenty, maybe thirty whole US dollars. You can get a Voigtlander Brilliant for $17 right now. Does it work? Who knows!\n\nApparently most of these cheap-o-depot manufacturers either skimp on the lens quality, the body quality, or gloriously... both.\n\nIf anyone is looking to get stuff to take up spots on their shelves or start a collection, I really recommend taking a stroll through the TLR department on eBay for some quick grabs of cheap vintage cameras that are D+ at best. Who knows, you might shove a roll of film through some of them and find out if it's trash or treasure.\n\nHell, maybe some of them are good luck! Or haunted. Choose your destiny.\n\nAre any of yall out here collectors? Has anyone gone down the road of collecting these cheap TLR's? Or have tested out some of the lesser-known ones?\n\nAlso, if you're the kind of person who likes buying and testing unique, weird, and cheap cameras off eBay, let me know! I'd like to talk to ya.\n\nWhats your experience?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/q4wrn9/forget_rolleiflex_tlr_lets_talk_about_the_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "forget rolleiflex tlr. lets talk about the weird, cheap, and basically useless competitor tlr's such as babyflex, argoflex, pigeonflex, &amp; welmyflex. has anyone bought a &lt;$80 tlr off-brand camera? what was your experience? /!/ i just had a pot of coffee, opened up \"tlr camera\" on ebay, and wrote down 6 full index cards worth of \"-flex\" models from various manufacturers.\n\nsome of these bad boys go for upwards of twenty, maybe thirty whole us dollars. you can get a voigtlander brilliant for $17 right now. does it work? who knows!\n\napparently most of these cheap-o-depot manufacturers either skimp on the lens quality, the body quality, or gloriously... both.\n\nif anyone is looking to get stuff to take up -----> spots !!!  on their shelves or start a collection, i really recommend taking a stroll through the tlr department on ebay for some quick grabs of cheap vintage cameras that are d+ at best. who knows, you might shove a roll of film through some of them and find out if it's trash or treasure.\n\nhell, maybe some of them are good luck! or haunted. choose your destiny.\n\nare any of yall out here collectors? has anyone gone down the road of collecting these cheap tlr's? or have tested out some of the lesser-known ones?\n\nalso, if you're the kind of person who likes buying and testing unique, weird, and cheap cameras off ebay, let me know! i'd like to talk to ya.\n\nwhats your experience?", "sortedWord": "None", "identifyer": 4078, "year": "2021"}, {"Unnamed: 0": 258662, "autor": "thenastyjbenny", "date": 1609966028000, "content": "Do all P&amp;s prewind film? /!/ First post here - if it's in the wrong spot pleased delete it or let me know. I think this is the right place for this sort of question though.\n\nBeen shooting 35mm on a Minolta x-700 for a while. I love the thing but some of my friends got into shooting on point and shoots so I decided to hop on the bandwagon. After some research it seems like point and shoots tend to go through the roll and 'prewind' the film when you load them, then expose the film as it goes on it's way back into the cartridge. My goodwill find point and shoot, a Fuji Discovery 185 zoom, which I don't expect much from, did \\*nothing\\* when I loaded film into it. No fidgeting, adjusting the length of the lead of film, or changing batteries or anything like that tempted it into pre winding the film. However, when I pressed the shutter release button I heard a click and the camera flashed, and then I heard something advance. \n\n&amp;#x200B;\n\nAfter popping open the back just to see, it appeared the film was being pulled almost like an advance would on my SLR. My question is, is this normal for a point and shoot? Or do I have a rare outlier of a camera, or is it junk and should not bother wasting my time shooting photos on it.\n\n&amp;#x200B;\n\nThanks for reading. Cheers everyone!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/krwt3q/do_all_ps_prewind_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do all p&amp;s prewind film? /!/ first post here - if it's in the wrong -----> spot !!!  pleased delete it or let me know. i think this is the right place for this sort of question though.\n\nbeen shooting 35mm on a minolta x-700 for a while. i love the thing but some of my friends got into shooting on point and shoots so i decided to hop on the bandwagon. after some research it seems like point and shoots tend to go through the roll and 'prewind' the film when you load them, then expose the film as it goes on it's way back into the cartridge. my goodwill find point and shoot, a fuji discovery 185 zoom, which i don't expect much from, did \\*nothing\\* when i loaded film into it. no fidgeting, adjusting the length of the lead of film, or changing batteries or anything like that tempted it into pre winding the film. however, when i pressed the shutter release button i heard a click and the camera flashed, and then i heard something advance. \n\n&amp;#x200b;\n\nafter popping open the back just to see, it appeared the film was being pulled almost like an advance would on my slr. my question is, is this normal for a point and shoot? or do i have a rare outlier of a camera, or is it junk and should not bother wasting my time shooting photos on it.\n\n&amp;#x200b;\n\nthanks for reading. cheers everyone!", "sortedWord": "None", "identifyer": 4114, "year": "2021"}, {"Unnamed: 0": 258723, "autor": "Belafontie", "date": 1609864942000, "content": "Did using a dedicated light meter improve your photos? /!/ Right now I use a Pentax MX with a broken light meter. I meter by eye and I get acceptable results most of the time. But I'd like to not have to wing it every time. Getting the light meter fixed won't be very cheap, and I assume it's probably not that accurate. \n\nSo I've decided to get a meter with incident and spot metering. Did you guys find an external light meter improved your photos? Any light meters you'd recomemend?\n\nI do not use a smart phone so I cannot use an app unfortunately.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kr22nf/did_using_a_dedicated_light_meter_improve_your/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "did using a dedicated light meter improve your photos? /!/ right now i use a pentax mx with a broken light meter. i meter by eye and i get acceptable results most of the time. but i'd like to not have to wing it every time. getting the light meter fixed won't be very cheap, and i assume it's probably not that accurate. \n\nso i've decided to get a meter with incident and -----> spot !!!  metering. did you guys find an external light meter improved your photos? any light meters you'd recomemend?\n\ni do not use a smart phone so i cannot use an app unfortunately.", "sortedWord": "None", "identifyer": 4175, "year": "2021"}, {"Unnamed: 0": 258734, "autor": "smortandtoit", "date": 1611222610000, "content": "Spot light meter doesnt work after a shoot in the rain. Olympus om2 SP. INFO in comments.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l1vfh3/spot_light_meter_doesnt_work_after_a_shoot_in_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  light meter doesnt work after a shoot in the rain. olympus om2 sp. info in comments.", "sortedWord": "None", "identifyer": 4186, "year": "2021"}, {"Unnamed: 0": 258750, "autor": "dthomp27", "date": 1611194420000, "content": "Invest in spot meter or continue using digital camera to meter? /!/ Is it worth getting a spot meter or should I keep using my xt30 to meter?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l1odp4/invest_in_spot_meter_or_continue_using_digital/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "invest in -----> spot !!!  meter or continue using digital camera to meter? /!/ is it worth getting a spot meter or should i keep using my xt30 to meter?", "sortedWord": "None", "identifyer": 4202, "year": "2021"}, {"Unnamed: 0": 258824, "autor": "96CMC", "date": 1611082273000, "content": "I’m having some trouble with getting sharpness at infinity... /!/ So, my Mamiya 645 is great and I’m killer condition, but I’ve been having trouble getting it to properly focus at infinity. Is it the lens or the focusing screen? Is it possible it is actually focusing properly and it’s just camera shake?Also, how do you actually focus to infinity... lol. Is it in the middle of the sign or is it somewhere in that area? \n\nI just see all these photos people are posting and it’s like everything in the photo is spot on in focus and sharp. Just trying to have the same results. Thank y’all!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l0qd7h/im_having_some_trouble_with_getting_sharpness_at/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m having some trouble with getting sharpness at infinity... /!/ so, my mamiya 645 is great and i’m killer condition, but i’ve been having trouble getting it to properly focus at infinity. is it the lens or the focusing screen? is it possible it is actually focusing properly and it’s just camera shake?also, how do you actually focus to infinity... lol. is it in the middle of the sign or is it somewhere in that area? \n\ni just see all these photos people are posting and it’s like everything in the photo is -----> spot !!!  on in focus and sharp. just trying to have the same results. thank y’all!", "sortedWord": "None", "identifyer": 4279, "year": "2021"}, {"Unnamed: 0": 258853, "autor": "brent1700", "date": 1611644131000, "content": "How do I tell people that they can't take a photo with my camera? /!/ Whenever I'm around friends/acquaintances with one of my cameras, they always ask questions and want to hold it, look through the viewfinder, etc. That's cool and I don't mind. I like to talk about them. But then the inevitable question comes: \"ohh, can I take a photo?\" How do I say no without sounding like a dick? Every time I say no, I get weird looks and negative reactions.\n\nIt's just that film is expensive and I'd rather not have some random blank spot or 3rd party photo on my roll of film. I don't even know why someone would want to take a photo. It's not like they can see the result. Idk, I guess they just want to hear the shutter? Regardless, I don't know how to deal with this lol.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l58g36/how_do_i_tell_people_that_they_cant_take_a_photo/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how do i tell people that they can't take a photo with my camera? /!/ whenever i'm around friends/acquaintances with one of my cameras, they always ask questions and want to hold it, look through the viewfinder, etc. that's cool and i don't mind. i like to talk about them. but then the inevitable question comes: \"ohh, can i take a photo?\" how do i say no without sounding like a dick? every time i say no, i get weird looks and negative reactions.\n\nit's just that film is expensive and i'd rather not have some random blank -----> spot !!!  or 3rd party photo on my roll of film. i don't even know why someone would want to take a photo. it's not like they can see the result. idk, i guess they just want to hear the shutter? regardless, i don't know how to deal with this lol.", "sortedWord": "None", "identifyer": 4308, "year": "2021"}, {"Unnamed: 0": 258896, "autor": "The_Logod", "date": 1611596397000, "content": "Two issues with my first roll of film? How to improve? /!/ I just got my first prints of the first roll I shot with my Praktica B200 (and a Praktikar 50 mm f1.8). \n\nThere's two issues I noticed:\n1. I feel that I never really nailed the focus in any of the shots. In fact, it's hard for me to tell where the focal-point is, making it difficult for me to pinpoint what I need to improve. I swear I thought I had the focus down in most shots (the viewfinder makes this quite simple I thought). Most shots were taken with f8 - I guess I need to get used that this is practically an f4 equivalent on my MFT mirrorless system, where handling the range of focus is a bit different. Could it be that the lens is simply \"soft\" or is this a characteristic of 35mm film in general that super-sharp lines are not to be expected or did I just mess up? ;)\n\n2. There's these weird, slightly dark spots in the brighter areas of the frame on some prints. What could that be? I can't make out any dirt or discolouration on the lens and the spots are not on every picture nor are they in the same place every time. Probably more a film / development issue rather than smth wrong with the camera?\n\nHere's the spots I mentioned:\n(Ignore the shots themselves - this was a test-roll to see if the camera actually works; also I simply \"scanned\" them using my phone's camera)\n[Example 1](https://drive.google.com/file/d/1n0S9ykCJSxF9sFW9OSIjJ_1IUcVUBb6-/view?usp=sharing)\n[Example 2](https://drive.google.com/file/d/149GjqlT10jOz3-n3V4I3VshGSiKypg2G/view?usp=sharing)\n\nAnyway, glad to see the camera works. Now I am eager to shoot more!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l4sxdg/two_issues_with_my_first_roll_of_film_how_to/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "two issues with my first roll of film? how to improve? /!/ i just got my first prints of the first roll i shot with my praktica b200 (and a praktikar 50 mm f1.8). \n\nthere's two issues i noticed:\n1. i feel that i never really nailed the focus in any of the shots. in fact, it's hard for me to tell where the focal-point is, making it difficult for me to pinpoint what i need to improve. i swear i thought i had the focus down in most shots (the viewfinder makes this quite simple i thought). most shots were taken with f8 - i guess i need to get used that this is practically an f4 equivalent on my mft mirrorless system, where handling the range of focus is a bit different. could it be that the lens is simply \"soft\" or is this a characteristic of 35mm film in general that super-sharp lines are not to be expected or did i just mess up? ;)\n\n2. there's these weird, slightly dark -----> spots !!!  in the brighter areas of the frame on some prints. what could that be? i can't make out any dirt or discolouration on the lens and the spots are not on every picture nor are they in the same place every time. probably more a film / development issue rather than smth wrong with the camera?\n\nhere's the spots i mentioned:\n(ignore the shots themselves - this was a test-roll to see if the camera actually works; also i simply \"scanned\" them using my phone's camera)\n[example 1](https://drive.google.com/file/d/1n0s9ykcjsxf9sfw9osijj_1iucvubb6-/view?usp=sharing)\n[example 2](https://drive.google.com/file/d/149gjqlt10joz3-n3v4i3vshgsikypg2g/view?usp=sharing)\n\nanyway, glad to see the camera works. now i am eager to shoot more!", "sortedWord": "None", "identifyer": 4351, "year": "2021"}, {"Unnamed: 0": 258916, "autor": "1337and0", "date": 1611581700000, "content": "Is this just a smudge on the lens? /!/ I got a couple rolls back from my Nikon FM and 50mm f/2 and in all the [pictures](https://imgur.com/a/qXBSM72) there's a mark on the bottom left, seems like a smudge but wouldn't a smudge prevent light from coming in? The spot is lighter in all the pictures. \n\nI didn't see anything big on the lens, but I have cleaned it sense.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l4nyjy/is_this_just_a_smudge_on_the_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this just a smudge on the lens? /!/ i got a couple rolls back from my nikon fm and 50mm f/2 and in all the [pictures](https://imgur.com/a/qxbsm72) there's a mark on the bottom left, seems like a smudge but wouldn't a smudge prevent light from coming in? the -----> spot !!!  is lighter in all the pictures. \n\ni didn't see anything big on the lens, but i have cleaned it sense.", "sortedWord": "None", "identifyer": 4371, "year": "2021"}, {"Unnamed: 0": 258966, "autor": "iko128", "date": 1625682669000, "content": "Fuji GW690 I just bought has some spots on the lens. How should I clean it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ofozp1/fuji_gw690_i_just_bought_has_some_spots_on_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "fuji gw690 i just bought has some -----> spots !!!  on the lens. how should i clean it?", "sortedWord": "None", "identifyer": 4422, "year": "2021"}, {"Unnamed: 0": 259093, "autor": "MrMassachusetts", "date": 1610438417000, "content": "Dark spots on developed b/w film /!/ Just developed my third b/w film and it really didnt go well. First of (as you can see on the image) there are many dark spots - on the top and vertically throughout the whole film. Are they just lightleaks or is it matter of agitation while developing? And there are bubbles on a few images.\n\nhttps://preview.redd.it/t9743ln2yua61.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=df78e956a3b3d940237d80a74a8a1f4821562f45", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kvne3z/dark_spots_on_developed_bw_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dark -----> spots !!!  on developed b/w film /!/ just developed my third b/w film and it really didnt go well. first of (as you can see on the image) there are many dark spots - on the top and vertically throughout the whole film. are they just lightleaks or is it matter of agitation while developing? and there are bubbles on a few images.\n\nhttps://preview.redd.it/t9743ln2yua61.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=df78e956a3b3d940237d80a74a8a1f4821562f45", "sortedWord": "None", "identifyer": 4553, "year": "2021"}, {"Unnamed: 0": 259232, "autor": "seklerek", "date": 1627477073000, "content": "I was tired of using binder clips to hang my film for drying, so I designed some better ones - no more wet spots or curling!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ot9daa/i_was_tired_of_using_binder_clips_to_hang_my_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i was tired of using binder clips to hang my film for drying, so i designed some better ones - no more wet -----> spots !!!  or curling!", "sortedWord": "None", "identifyer": 4695, "year": "2021"}, {"Unnamed: 0": 259271, "autor": "Centako", "date": 1627401067000, "content": "Blue spot of discoloration in center of photos? (Lomo 800) /!/ I'm willing to accept that I'm just seeing things, but I was wondering if y'all see a blue discoloration in the center of these photos(also provided zoomed-in crops for each photo respectively) and if so what do you think might be causing this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ospi8b/blue_spot_of_discoloration_in_center_of_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "blue -----> spot !!!  of discoloration in center of photos? (lomo 800) /!/ i'm willing to accept that i'm just seeing things, but i was wondering if y'all see a blue discoloration in the center of these photos(also provided zoomed-in crops for each photo respectively) and if so what do you think might be causing this?", "sortedWord": "None", "identifyer": 4736, "year": "2021"}, {"Unnamed: 0": 259538, "autor": "LennyTheMemeMaster", "date": 1622097021000, "content": "Gave C-41 development my first try, all my negatives have these spots/streaks all over them? What are they, and how can I avoid them?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nm199m/gave_c41_development_my_first_try_all_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "gave c-41 development my first try, all my negatives have these -----> spots !!! /streaks all over them? what are they, and how can i avoid them?", "sortedWord": "None", "identifyer": 5008, "year": "2021"}, {"Unnamed: 0": 259594, "autor": "justme_eh", "date": 1621970795000, "content": "Camera/Film Shops in Neza, Mexico? /!/ Hello all, I am visiting CDMX in June. I have heard of Donceles Street and plan to visit, but I am staying in Neza. Are there any camera shops around there that I should check out? And any spots that sell expired film?\nThank you.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nkxvsp/camerafilm_shops_in_neza_mexico/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "camera/film shops in neza, mexico? /!/ hello all, i am visiting cdmx in june. i have heard of donceles street and plan to visit, but i am staying in neza. are there any camera shops around there that i should check out? and any -----> spots !!!  that sell expired film?\nthank you.", "sortedWord": "None", "identifyer": 5064, "year": "2021"}, {"Unnamed: 0": 259667, "autor": "takumisrightfoot", "date": 1622779641000, "content": "Pentax 6x7 spotted in the new John Mayer music video", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nrw6ik/pentax_6x7_spotted_in_the_new_john_mayer_music/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "pentax 6x7 -----> spotted !!!  in the new john mayer music video", "sortedWord": "None", "identifyer": 5138, "year": "2021"}, {"Unnamed: 0": 259672, "autor": "igenther99", "date": 1622768716000, "content": "Dark Spot in Photos on OM-1 /!/ I've been shooting an Olympus OM-1 for a few months now and I have noticed that on some of my negatives I have been getting a dark spot in the same location on each (top-right corner) . Does anybody else with an OM-1 know what these spots might be the result of? An example is attached below\n\nThanks!\n\n*Processing img rspt11h7e5371...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nrsxs4/dark_spot_in_photos_on_om1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dark -----> spot !!!  in photos on om-1 /!/ i've been shooting an olympus om-1 for a few months now and i have noticed that on some of my negatives i have been getting a dark spot in the same location on each (top-right corner) . does anybody else with an om-1 know what these spots might be the result of? an example is attached below\n\nthanks!\n\n*processing img rspt11h7e5371...*", "sortedWord": "None", "identifyer": 5143, "year": "2021"}, {"Unnamed: 0": 259758, "autor": "whoriemcnorrie", "date": 1619426969000, "content": "i’m pretty new to film and just started to develop and scan on my own. every time, i end up with spots that i assume are chemicals that didn’t dry properly. any idea what they are/how to get rid of them? additionally, does anyone have advice on how to avoid scanning lines? thanks so much!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/myt7hi/im_pretty_new_to_film_and_just_started_to_develop/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i’m pretty new to film and just started to develop and scan on my own. every time, i end up with -----> spots !!!  that i assume are chemicals that didn’t dry properly. any idea what they are/how to get rid of them? additionally, does anyone have advice on how to avoid scanning lines? thanks so much!", "sortedWord": "None", "identifyer": 5232, "year": "2021"}, {"Unnamed: 0": 259759, "autor": "[deleted]", "date": 1619425656000, "content": "chemical spots on negatives? /!/ [deleted]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mysx3d/chemical_spots_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "chemical -----> spots !!!  on negatives? /!/ [deleted]", "sortedWord": "None", "identifyer": 5233, "year": "2021"}, {"Unnamed: 0": 259765, "autor": "JetdocBram", "date": 1619400502000, "content": "Whats this weird vertical line on my negatives? It appears to be in the same spot each time and visible on light colors. I recently refurbished a Yashica Mat 124G, and I can’t see anything inside that would rub the film and cause something like this. Not sure what to make of it. Ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mymjr5/whats_this_weird_vertical_line_on_my_negatives_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "whats this weird vertical line on my negatives? it appears to be in the same -----> spot !!!  each time and visible on light colors. i recently refurbished a yashica mat 124g, and i can’t see anything inside that would rub the film and cause something like this. not sure what to make of it. ideas?", "sortedWord": "None", "identifyer": 5239, "year": "2021"}, {"Unnamed: 0": 259799, "autor": "Rjin-", "date": 1619311989000, "content": "Follow up question about the XA3... /!/ Hey, so I previously asked about an XA3 and got some helpful responses- thank you to those who replied and/or messaged me. \n\nAnyways, so that guy I was talking to about the XA3 gave me a really creepy vibe, so I while I had a friend with me intending to go check it out, we instead went and hoped around a few thrift shops. I ended up spotting an Olympus Stylus Zoom for $80. I think it was over priced, but it’s in great condition, minus the battery door being broken but I believe I can fix it. I bought it. I believe it’s the Zoom 70, as that’s the max that the zoom goes, but it’s not marked anywhere so I’m not sure. \n\nAnyways, whether or not I overpaid is moot- however, I’m curious about people’s experience with the Stylus Zoom vs the XA3? How do the compare? What did you like or not like?\n\nThank you in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mxx7wr/follow_up_question_about_the_xa3/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "follow up question about the xa3... /!/ hey, so i previously asked about an xa3 and got some helpful responses- thank you to those who replied and/or messaged me. \n\nanyways, so that guy i was talking to about the xa3 gave me a really creepy vibe, so i while i had a friend with me intending to go check it out, we instead went and hoped around a few thrift shops. i ended up -----> spotting !!!  an olympus stylus zoom for $80. i think it was over priced, but it’s in great condition, minus the battery door being broken but i believe i can fix it. i bought it. i believe it’s the zoom 70, as that’s the max that the zoom goes, but it’s not marked anywhere so i’m not sure. \n\nanyways, whether or not i overpaid is moot- however, i’m curious about people’s experience with the stylus zoom vs the xa3? how do the compare? what did you like or not like?\n\nthank you in advance.", "sortedWord": "None", "identifyer": 5273, "year": "2021"}, {"Unnamed: 0": 259858, "autor": "penguiniealdente", "date": 1618921837000, "content": "Dark spots in Black and White image [Ilford Pan 400]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mup8eh/dark_spots_in_black_and_white_image_ilford_pan_400/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dark -----> spots !!!  in black and white image [ilford pan 400]", "sortedWord": "None", "identifyer": 5332, "year": "2021"}, {"Unnamed: 0": 259885, "autor": "SensiMilla8", "date": 1618871449000, "content": "What do you reckon this could be? these spots show up as white on the negative as well", "link": "https://www.reddit.com/r/AnalogCommunity/comments/muccch/what_do_you_reckon_this_could_be_these_spots_show/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what do you reckon this could be? these -----> spots !!!  show up as white on the negative as well", "sortedWord": "None", "identifyer": 5359, "year": "2021"}, {"Unnamed: 0": 259907, "autor": "SensiMilla8", "date": 1618837820000, "content": "Spots on negatives /!/ Anyone ever experienced some white spots on the B&amp;W negatives after development, like raindrops on glass kind of thing?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mu09f4/spots_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!!  on negatives /!/ anyone ever experienced some white spots on the b&amp;w negatives after development, like raindrops on glass kind of thing?", "sortedWord": "None", "identifyer": 5382, "year": "2021"}, {"Unnamed: 0": 259979, "autor": "suckurmumyeboi", "date": 1617846791000, "content": "What are these spots on my film scans? They look white on film negatives this has happened to me on one colour roll and one black and white roll.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mmhdi4/what_are_these_spots_on_my_film_scans_they_look/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!!  on my film scans? they look white on film negatives this has happened to me on one colour roll and one black and white roll.", "sortedWord": "None", "identifyer": 5456, "year": "2021"}, {"Unnamed: 0": 260046, "autor": "joe_ro", "date": 1617584338000, "content": "Contact Sheet of Photos of our film lab, scanned and printed huge on a board for the front counter of our film drop off spot", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mk93wk/contact_sheet_of_photos_of_our_film_lab_scanned/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "contact sheet of photos of our film lab, scanned and printed huge on a board for the front counter of our film drop off -----> spot !!! ", "sortedWord": "None", "identifyer": 5526, "year": "2021"}, {"Unnamed: 0": 260158, "autor": "stkg1", "date": 1626188521000, "content": "Beep noise RZ-67 /!/ Hi everyone,\n\nSo, I picked up a Mamiya RZ-67 in great condition, I was dreaming about this camera already for quite some time, so I'm super happy to finally own it! Still finding out the workflow..\n\nWhen taking pictures I have the mode selector in the middle (so not on M or R), and the white dot's aligned, I have a fresh battery in the camera and the dark slide in the right spot. Now I was taking pictures and the camera started to beep (i wasn't in bulb mode), and blocked (closed the shutter, had to switch modes to get it back to normal again).\n\nWhat am I doing wrong?\n\nMy first roll is totally messed up, everything came out as a double exposure while I was shooting in normal mode and with the white dots aligned. \n\nI take a picture, push down the lever all the way until I see the next number on the roll on the film back..\n\nThanks in advance!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ojhevi/beep_noise_rz67/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "beep noise rz-67 /!/ hi everyone,\n\nso, i picked up a mamiya rz-67 in great condition, i was dreaming about this camera already for quite some time, so i'm super happy to finally own it! still finding out the workflow..\n\nwhen taking pictures i have the mode selector in the middle (so not on m or r), and the white dot's aligned, i have a fresh battery in the camera and the dark slide in the right -----> spot !!! . now i was taking pictures and the camera started to beep (i wasn't in bulb mode), and blocked (closed the shutter, had to switch modes to get it back to normal again).\n\nwhat am i doing wrong?\n\nmy first roll is totally messed up, everything came out as a double exposure while i was shooting in normal mode and with the white dots aligned. \n\ni take a picture, push down the lever all the way until i see the next number on the roll on the film back..\n\nthanks in advance!!", "sortedWord": "None", "identifyer": 5638, "year": "2021"}, {"Unnamed: 0": 260394, "autor": "iloveturbs", "date": 1621448437000, "content": "How to get over fear of screwing up a roll for self-developing? /!/ Howdy Film Photography Friends!\n\nI'm hoping for some words of advice regarding self-developing. I do mostly landscape photography where I backpack into the backcountry for my shots. So these pictures come from trips where I drive a few hours and then do some strenuous hike to a lake or scenic spot and spend the night there, for example. A lot of planning/work goes into these trips and the hikes are really difficult since I'm hauling so much shit (not necessarily camera gear, just backpacking gear). \n\nI taught myself how to develop film this past winter and I've been very happy with the results. I've developed 15 rolls of film and have had no issues with a single one (yay). But these are mostly just every day shots. I cannot get over the fear that I'm going to screw up developing a roll from one of these backpacking trips. My thought process is that if I screw something up, there goes a lot of the work that went into the weekend. I still have pics from my phone and I have fun just heading out there, but of course I'd like to have some exciting pictures both for the memories and for printing to hang in my house.\n\nSo now that backpacking season is upon us, I've gone on a few trips and I've just sent the rolls off to my local lab since they do a great job and I've never had any issues with them (although it can obviously get expensive).\n\nI'm hoping that maybe some fellow backpacking film photographers who self-dev may have some words of inspiration? It seems that street photographers tend to be more common here so maybe an analogue is when you know you have a pedestrian walking by and the lighting is just perfect! Maybe not the best analogue but doing my best to relate here.\n\nAny thoughts are greatly appreciated!\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ngd2cz/how_to_get_over_fear_of_screwing_up_a_roll_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to get over fear of screwing up a roll for self-developing? /!/ howdy film photography friends!\n\ni'm hoping for some words of advice regarding self-developing. i do mostly landscape photography where i backpack into the backcountry for my shots. so these pictures come from trips where i drive a few hours and then do some strenuous hike to a lake or scenic -----> spot !!!  and spend the night there, for example. a lot of planning/work goes into these trips and the hikes are really difficult since i'm hauling so much shit (not necessarily camera gear, just backpacking gear). \n\ni taught myself how to develop film this past winter and i've been very happy with the results. i've developed 15 rolls of film and have had no issues with a single one (yay). but these are mostly just every day shots. i cannot get over the fear that i'm going to screw up developing a roll from one of these backpacking trips. my thought process is that if i screw something up, there goes a lot of the work that went into the weekend. i still have pics from my phone and i have fun just heading out there, but of course i'd like to have some exciting pictures both for the memories and for printing to hang in my house.\n\nso now that backpacking season is upon us, i've gone on a few trips and i've just sent the rolls off to my local lab since they do a great job and i've never had any issues with them (although it can obviously get expensive).\n\ni'm hoping that maybe some fellow backpacking film photographers who self-dev may have some words of inspiration? it seems that street photographers tend to be more common here so maybe an analogue is when you know you have a pedestrian walking by and the lighting is just perfect! maybe not the best analogue but doing my best to relate here.\n\nany thoughts are greatly appreciated!\n\nthanks!", "sortedWord": "None", "identifyer": 5876, "year": "2021"}, {"Unnamed: 0": 260397, "autor": "3eZB", "date": 1621442397000, "content": "Blur spot in middle of lens - Nikon ai 50mm 1.8 /!/ Hi there, \n\nI bought this lens a little while back and have been shooting on my fe2 using it. Recently a purchased an adapter to use this with my Sony a7siii mirrorless camera (I do video work). I've noticed a blur spot in the centre of the lens. I'm stumped as the lens seems clean. Does anyone have ideas?\n\nI need to go through some of my film i've shot using it, but I don't remember noticing the blur but was probably shooting a wider open. \n\nAny one have any ideas? please let me know!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ngam2g/blur_spot_in_middle_of_lens_nikon_ai_50mm_18/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "blur -----> spot !!!  in middle of lens - nikon ai 50mm 1.8 /!/ hi there, \n\ni bought this lens a little while back and have been shooting on my fe2 using it. recently a purchased an adapter to use this with my sony a7siii mirrorless camera (i do video work). i've noticed a blur spot in the centre of the lens. i'm stumped as the lens seems clean. does anyone have ideas?\n\ni need to go through some of my film i've shot using it, but i don't remember noticing the blur but was probably shooting a wider open. \n\nany one have any ideas? please let me know!", "sortedWord": "None", "identifyer": 5879, "year": "2021"}, {"Unnamed: 0": 260486, "autor": "ItzGhostHD", "date": 1623879117000, "content": "Anyone know what causes these white lines and spots on my film?? /!/ Hello,\n\nThis is my first time Shooting, developing, and scanning/color correction all by myself.\n\nI'm really happy with the results but a few of my photos had these weird white things. I really like the look of it I just want to know what causes it.\n\nHere is the pics [https://imgur.com/a/OK4EDir](https://imgur.com/a/OK4EDir)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o1g45q/anyone_know_what_causes_these_white_lines_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone know what causes these white lines and -----> spots !!!  on my film?? /!/ hello,\n\nthis is my first time shooting, developing, and scanning/color correction all by myself.\n\ni'm really happy with the results but a few of my photos had these weird white things. i really like the look of it i just want to know what causes it.\n\nhere is the pics [https://imgur.com/a/ok4edir](https://imgur.com/a/ok4edir)", "sortedWord": "None", "identifyer": 5978, "year": "2021"}, {"Unnamed: 0": 260611, "autor": "t1mc", "date": 1624623594000, "content": "London Analog Community? [WhatsApp Group/Photo Walks/Meetups] /!/ I was wondering if there's any London analog community, because I'd like to connect with more local people, talk about analog and go on photo walks together to also improve my skills.\n\nMore specifically I'm interested in a group of like-minded people that are around my age (20-35), since I find Meetup sometimes a little awkward for some reason.\n\nIf there's none, I could start a WhatsApp group, maybe with limited spots for better overview and discussions. So if you're interested, DM me your number and age and I'll add you.\n\nAbout me, I'm Tim, 28 years old and based in SW near Battersea. I own a Canon A-1, Olympus XA2, Olympus Mju II and a Nimslo 3D. I mostly shoot with Portra 400 and develop my film at Photofusion in Brixton.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o7mknw/london_analog_community_whatsapp_groupphoto/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "london analog community? [whatsapp group/photo walks/meetups] /!/ i was wondering if there's any london analog community, because i'd like to connect with more local people, talk about analog and go on photo walks together to also improve my skills.\n\nmore specifically i'm interested in a group of like-minded people that are around my age (20-35), since i find meetup sometimes a little awkward for some reason.\n\nif there's none, i could start a whatsapp group, maybe with limited -----> spots !!!  for better overview and discussions. so if you're interested, dm me your number and age and i'll add you.\n\nabout me, i'm tim, 28 years old and based in sw near battersea. i own a canon a-1, olympus xa2, olympus mju ii and a nimslo 3d. i mostly shoot with portra 400 and develop my film at photofusion in brixton.", "sortedWord": "None", "identifyer": 6110, "year": "2021"}, {"Unnamed: 0": 260629, "autor": "ah876", "date": 1624583153000, "content": "Only one spot to get film in my country and they don't carry a big variety so I usually load up when I go away. This is the most recent haul. Stoked to get out and start shooting it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o7d9b7/only_one_spot_to_get_film_in_my_country_and_they/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "only one -----> spot !!!  to get film in my country and they don't carry a big variety so i usually load up when i go away. this is the most recent haul. stoked to get out and start shooting it.", "sortedWord": "None", "identifyer": 6128, "year": "2021"}, {"Unnamed: 0": 260694, "autor": "nodscidgama", "date": 1613998531000, "content": "Saw a Jupiter 9 on a local craigslist list advertisement /!/ So this is a sad story\n\nThis weekend I spotted a Jupiter 9 on a local craigslist advertisement along with a Zenit Et and some other cameras.\n\nI contacted the seller to get a look on the cameras and buy the Jupiter 9. He was selling the lot for 150€\n\nI get there and first thing I do is ask for the Jupiter lens to which he said that some other buyer had already inspected the lens and told him that there was oil on the lens.\n\nThe seller, instead of keeping the lens, tossed it the trash 🤦🏻‍♂️\n\nI was chocked, and so was he when I told him how much that lens is worth 😅", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lpncg5/saw_a_jupiter_9_on_a_local_craigslist_list/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "saw a jupiter 9 on a local craigslist list advertisement /!/ so this is a sad story\n\nthis weekend i -----> spotted !!!  a jupiter 9 on a local craigslist advertisement along with a zenit et and some other cameras.\n\ni contacted the seller to get a look on the cameras and buy the jupiter 9. he was selling the lot for 150€\n\ni get there and first thing i do is ask for the jupiter lens to which he said that some other buyer had already inspected the lens and told him that there was oil on the lens.\n\nthe seller, instead of keeping the lens, tossed it the trash 🤦🏻‍♂️\n\ni was chocked, and so was he when i told him how much that lens is worth 😅", "sortedWord": "None", "identifyer": 6193, "year": "2021"}, {"Unnamed: 0": 260728, "autor": "M_Kammerer", "date": 1613941488000, "content": "A FaQ-thing hoping to answer common questions. /!/ To prevent dumb questions and potentially dead threads. Might contain exaggerations. If anything is wrong or some cliché questions are missing post them below.\n\n1.**I sold my last kidney and bought [enter camera here]**\n\nCool but atleast provide some context, preferably why you bought a professional medium format camera without any prior photographic knowledge \n\n2.**I declared personal bankruptcy to get [enter popular camera here]. Any tips?**\n\nFor the love of God, please look up the manual. They're free (in most cases)! Incredible, isn't it ?\nWhat else do you want ? Just load and shoot already!\n\nAlso check the light seals and shutter functions and other features if you buy from a less-than-genuine looking source.\n\n3.**What film does (popular beginner camera) take ?/My camera has a [enter lens that isn't f=35mm] lens, what film does it take?**\n\nManuals, please look them up...\n\n4.**Why does my photo look like this ?**\n\nFirstly, provide us with the negative/slide! Scanners can leave marks too **which are only present on the scan!**\n\nIs one side overexposed/underexposed while the rest of the picture is normally exposed? Then it's shutter capping which can happen both to vertical and horizontal travelling shutters.\n\nAre there irregular overexposed spots on the negative? Light leaks. If they're white then it's a like from the front, due to a punctured curtain and or dissolving light seals. An orange hue indicates a light leak from the back (color negative film only).\n\nWhy are the images so dark ? Underexposure most likely. This could be due to the cameras meter either being faulty or the meter reading only the brightest part of the frame therefore underexposing the rest of the image.\n\nWhy is there little to no contrast ? Overexposed. As above but probably very heavily overexposed due to metering fault. Generally film handles overexposure better than underexposure.\n\n5.**My negatives came out completely translucent or blank/many translucent frames. What happened ?**\n\nIf your film/frames come out completely translucent/clear then your film has (literally) not seen the light of day. \n\nThis could be due to shutter failure, mirror failure, improper loading (film was not wound correctly on the take-up spool, mostly with 135 film), severe metering fault either due to faulty electronics or forgetting that meter was set at ISO 1600 completely underexposing your 12€ Fuji Velvia by four and a half stops, aperture was too small, a fault with the film (unlikely but can happen), or the lab/you screwed up during development.\n\n6.**My [enter popular electronic camera] doesn't work/turn on/displays anomalous behavior. What do ?**\n\nUnless the error messages/anomalous behavior isn't stated within the manual, and the fresh battery/batteries trick doesn't work, you're most likely dealing with dead electronics. In most cases this non-repairable or the repair costs greatly exceed the market worth of the camera\n\n7.**What film do I start with ?**\n\nGenerally most recommend black and white film but color negative isn't a bad start either. However don't start with stuff like pushing and pulling. Follow the manufacturers precisely for your first rolls until you get the hang of it. \n\n8.**[Darkroom specific question]**\n\nr/darkroom \n\n9.**Is [popular camera] better than [other popular camera] ?**\n\n*Insert, the camera is just a dark box while film and lens will 90% dictate the final look of your negatives,  argument here*\n\n10.**Help! What does [Basic Photography terms] mean?!**\n\nPlease pick up a book/guide of Photography before you blow vast amounts of money on this expensive hobby.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lp6ltq/a_faqthing_hoping_to_answer_common_questions/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a faq-thing hoping to answer common questions. /!/ to prevent dumb questions and potentially dead threads. might contain exaggerations. if anything is wrong or some cliché questions are missing post them below.\n\n1.**i sold my last kidney and bought [enter camera here]**\n\ncool but atleast provide some context, preferably why you bought a professional medium format camera without any prior photographic knowledge \n\n2.**i declared personal bankruptcy to get [enter popular camera here]. any tips?**\n\nfor the love of god, please look up the manual. they're free (in most cases)! incredible, isn't it ?\nwhat else do you want ? just load and shoot already!\n\nalso check the light seals and shutter functions and other features if you buy from a less-than-genuine looking source.\n\n3.**what film does (popular beginner camera) take ?/my camera has a [enter lens that isn't f=35mm] lens, what film does it take?**\n\nmanuals, please look them up...\n\n4.**why does my photo look like this ?**\n\nfirstly, provide us with the negative/slide! scanners can leave marks too **which are only present on the scan!**\n\nis one side overexposed/underexposed while the rest of the picture is normally exposed? then it's shutter capping which can happen both to vertical and horizontal travelling shutters.\n\nare there irregular overexposed -----> spots !!!  on the negative? light leaks. if they're white then it's a like from the front, due to a punctured curtain and or dissolving light seals. an orange hue indicates a light leak from the back (color negative film only).\n\nwhy are the images so dark ? underexposure most likely. this could be due to the cameras meter either being faulty or the meter reading only the brightest part of the frame therefore underexposing the rest of the image.\n\nwhy is there little to no contrast ? overexposed. as above but probably very heavily overexposed due to metering fault. generally film handles overexposure better than underexposure.\n\n5.**my negatives came out completely translucent or blank/many translucent frames. what happened ?**\n\nif your film/frames come out completely translucent/clear then your film has (literally) not seen the light of day. \n\nthis could be due to shutter failure, mirror failure, improper loading (film was not wound correctly on the take-up spool, mostly with 135 film), severe metering fault either due to faulty electronics or forgetting that meter was set at iso 1600 completely underexposing your 12€ fuji velvia by four and a half stops, aperture was too small, a fault with the film (unlikely but can happen), or the lab/you screwed up during development.\n\n6.**my [enter popular electronic camera] doesn't work/turn on/displays anomalous behavior. what do ?**\n\nunless the error messages/anomalous behavior isn't stated within the manual, and the fresh battery/batteries trick doesn't work, you're most likely dealing with dead electronics. in most cases this non-repairable or the repair costs greatly exceed the market worth of the camera\n\n7.**what film do i start with ?**\n\ngenerally most recommend black and white film but color negative isn't a bad start either. however don't start with stuff like pushing and pulling. follow the manufacturers precisely for your first rolls until you get the hang of it. \n\n8.**[darkroom specific question]**\n\nr/darkroom \n\n9.**is [popular camera] better than [other popular camera] ?**\n\n*insert, the camera is just a dark box while film and lens will 90% dictate the final look of your negatives,  argument here*\n\n10.**help! what does [basic photography terms] mean?!**\n\nplease pick up a book/guide of photography before you blow vast amounts of money on this expensive hobby.", "sortedWord": "None", "identifyer": 6227, "year": "2021"}, {"Unnamed: 0": 260891, "autor": "thejooginator", "date": 1630608283000, "content": "Does anyone know what caused these small white spots on my negatives? Ilford XP2 Shot on RB67, and developed in cinestill CS-41 developer. These spots are on multiple photos.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pgo0qn/does_anyone_know_what_caused_these_small_white/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does anyone know what caused these small white -----> spots !!!  on my negatives? ilford xp2 shot on rb67, and developed in cinestill cs-41 developer. these spots are on multiple photos.", "sortedWord": "None", "identifyer": 6393, "year": "2021"}, {"Unnamed: 0": 261036, "autor": "TheHappyGrouch", "date": 1628027011000, "content": "Epson V-750 scan issue /!/ I've been using my Epson V-750 (it's really a GT-X970, but I think that's equivalent to the V-750 in America) for years. In the last few months, the images seemed less sharp so I did some research and read that people would raise the negative trays to get clearer scans. I found that if I just say the tray on the scanner (so the tray didn't sink into the holes that keep it flush to the glass) and folded a post-it to balance out the other side, the scan was pretty good. But this last time I've been having a lot of issues when I do that. The preview either takes much longer than usual and comes up black with some weird white spots or as it does in the photo with weird gray patches (and that scan had 2 strips of film, only one turned up in the preview). I'm quite worried that the scanner is somehow damaged. Any help or advice on what is wrong would be greatly appreciated.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oxdpmk/epson_v750_scan_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "epson v-750 scan issue /!/ i've been using my epson v-750 (it's really a gt-x970, but i think that's equivalent to the v-750 in america) for years. in the last few months, the images seemed less sharp so i did some research and read that people would raise the negative trays to get clearer scans. i found that if i just say the tray on the scanner (so the tray didn't sink into the holes that keep it flush to the glass) and folded a post-it to balance out the other side, the scan was pretty good. but this last time i've been having a lot of issues when i do that. the preview either takes much longer than usual and comes up black with some weird white -----> spots !!!  or as it does in the photo with weird gray patches (and that scan had 2 strips of film, only one turned up in the preview). i'm quite worried that the scanner is somehow damaged. any help or advice on what is wrong would be greatly appreciated.", "sortedWord": "None", "identifyer": 6540, "year": "2021"}, {"Unnamed: 0": 261222, "autor": "spycimeme", "date": 1629312026000, "content": "Viewfinder has a weird spot. Does anybody know how it happened? (pictures taken week apart) (Canon AF35M)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p6xcq0/viewfinder_has_a_weird_spot_does_anybody_know_how/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "viewfinder has a weird -----> spot !!! . does anybody know how it happened? (pictures taken week apart) (canon af35m)", "sortedWord": "None", "identifyer": 6729, "year": "2021"}, {"Unnamed: 0": 261286, "autor": "pogof", "date": 1629204167000, "content": "Weird blank spot. Possible shutter curtain issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p63021/weird_blank_spot_possible_shutter_curtain_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird blank -----> spot !!! . possible shutter curtain issue?", "sortedWord": "None", "identifyer": 6794, "year": "2021"}, {"Unnamed: 0": 261611, "autor": "JavyJones", "date": 1628440886000, "content": "Pentax 67 Broken TTL Chain /!/ Hi All,   \n\n\nI've recently acquired a Pentax 67 MLU from a seller on eBay. Upon taking off the lens, I noticed the meter coupling chain was dangling down to the center of the camera. My first concern is due to how the chain is hanging that it'll appear in my negatives. Will this be the case? I'm honestly in no bind to have a functioning meter, I planned to use my spot meter for the camera anyway, but I'm not sure if I'll have to worry about negatives having the chain  :(   \n\n\nAny advice would be greatly appreciated! \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/umt1ybd7x5g71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=0b42dbfc66fc9fb4b0adc505229c4aa10f9fce1e\n\nhttps://preview.redd.it/3q81ned7x5g71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=3db94c258dc09bddd7c1b683cf800b4d36b747fc", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p0i0za/pentax_67_broken_ttl_chain/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pentax 67 broken ttl chain /!/ hi all,   \n\n\ni've recently acquired a pentax 67 mlu from a seller on ebay. upon taking off the lens, i noticed the meter coupling chain was dangling down to the center of the camera. my first concern is due to how the chain is hanging that it'll appear in my negatives. will this be the case? i'm honestly in no bind to have a functioning meter, i planned to use my -----> spot !!!  meter for the camera anyway, but i'm not sure if i'll have to worry about negatives having the chain  :(   \n\n\nany advice would be greatly appreciated! \n\n&amp;#x200b;\n\n&amp;#x200b;\n\nhttps://preview.redd.it/umt1ybd7x5g71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=0b42dbfc66fc9fb4b0adc505229c4aa10f9fce1e\n\nhttps://preview.redd.it/3q81ned7x5g71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=3db94c258dc09bddd7c1b683cf800b4d36b747fc", "sortedWord": "None", "identifyer": 7125, "year": "2021"}, {"Unnamed: 0": 261717, "autor": "klnadler", "date": 1628719949000, "content": "Water Spot Issue /!/ Recently developed 2 rolls of HP5 in DDX and followed the development with a cap full of photo flo and hung the film to dry in my bathroom over night. The film was not disturbed while drying and had clips on the ends of them so they didn't curl yet I still am getting water spots. Does anyone have any recommendations on how to remove them from these rolls and how to prevent them in the future https://imgur.com/a/r58cNb9", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p2ngiy/water_spot_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "water -----> spot !!!  issue /!/ recently developed 2 rolls of hp5 in ddx and followed the development with a cap full of photo flo and hung the film to dry in my bathroom over night. the film was not disturbed while drying and had clips on the ends of them so they didn't curl yet i still am getting water spots. does anyone have any recommendations on how to remove them from these rolls and how to prevent them in the future https://imgur.com/a/r58cnb9", "sortedWord": "None", "identifyer": 7233, "year": "2021"}, {"Unnamed: 0": 261754, "autor": "subliminal_liminal", "date": 1628638167000, "content": "How does your process for editing film/analog images differ compared to digital? /!/ After reading through the discussion about editing images to \"high hell\" this afternoon, this related question popped into my head and I spent a lot of time thinking about how I edit my images based on the medium used (i.e. analog or digital) and how they come into contact with other mediums - but also how my editing differs either on a case by case basis or the type of photography I'm focusing on at that time.\n\nThis was my answer to the previous thread which I feel also answers this question to an extent:\n\n\"Honestly, my philosophy is to do it if you want to do it. When it comes to film I tend to edit my images a lot less, but on some occasions I've gone to town on the editing/image manipulation either because I wanted to experiment or create new worlds/narratives/characters etc to fulfill an artistic vision (or just have a lot of fun).\nEditing is one of my favourite parts of the process, especially when you have all these new possibilities in both the darkroom and in software such as Lightroom. \n\nWhen it comes to digital &amp; smartphone photography on the other hand I tend to go all in with the editing and really embrace my creative side. I am an artistic photographer so on most occasions I'm looking to create something or fulfill a concept/idea as opposed to \"accuracy\" or pure realism, and honestly it's a lot of fun to experiment with all these tools, sliders, presets and effects to create interesting images. \n\nFor me it also depends on what kind of image I'm making, as if it's something in the documentary or photojournalism vein I'll edit it a lot less (maybe just some colour corrections/contrast) or just leave it as it is.\" \n\nI realise that I also tend to edit colours/exposure/contrast a lot more on digital too as I'm not often satisfied with how the sensor renders colour and whatnot, but also that digital RAW files more or less designed for intense editing as they're often flat (especially for my tastes). I also rarely crop images as I like to get composition right in-camera, but on occasion I'll crop if I'm not able to make another shot anytime soon or if I spot an element I'd really wished I'd focused on instead.  \n\nI'm thinking of experimenting with photocopiers and other things at the moment too when it comes to editing prints. \n\nHow does the process differ with you?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p20zwi/how_does_your_process_for_editing_filmanalog/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how does your process for editing film/analog images differ compared to digital? /!/ after reading through the discussion about editing images to \"high hell\" this afternoon, this related question popped into my head and i spent a lot of time thinking about how i edit my images based on the medium used (i.e. analog or digital) and how they come into contact with other mediums - but also how my editing differs either on a case by case basis or the type of photography i'm focusing on at that time.\n\nthis was my answer to the previous thread which i feel also answers this question to an extent:\n\n\"honestly, my philosophy is to do it if you want to do it. when it comes to film i tend to edit my images a lot less, but on some occasions i've gone to town on the editing/image manipulation either because i wanted to experiment or create new worlds/narratives/characters etc to fulfill an artistic vision (or just have a lot of fun).\nediting is one of my favourite parts of the process, especially when you have all these new possibilities in both the darkroom and in software such as lightroom. \n\nwhen it comes to digital &amp; smartphone photography on the other hand i tend to go all in with the editing and really embrace my creative side. i am an artistic photographer so on most occasions i'm looking to create something or fulfill a concept/idea as opposed to \"accuracy\" or pure realism, and honestly it's a lot of fun to experiment with all these tools, sliders, presets and effects to create interesting images. \n\nfor me it also depends on what kind of image i'm making, as if it's something in the documentary or photojournalism vein i'll edit it a lot less (maybe just some colour corrections/contrast) or just leave it as it is.\" \n\ni realise that i also tend to edit colours/exposure/contrast a lot more on digital too as i'm not often satisfied with how the sensor renders colour and whatnot, but also that digital raw files more or less designed for intense editing as they're often flat (especially for my tastes). i also rarely crop images as i like to get composition right in-camera, but on occasion i'll crop if i'm not able to make another shot anytime soon or if i -----> spot !!!  an element i'd really wished i'd focused on instead.  \n\ni'm thinking of experimenting with photocopiers and other things at the moment too when it comes to editing prints. \n\nhow does the process differ with you?", "sortedWord": "None", "identifyer": 7271, "year": "2021"}, {"Unnamed: 0": 261777, "autor": "35mmpy", "date": 1628612893000, "content": "Analogue damage restoration via Deep Learning /!/ Hi everyone!\n\nI have been developing and scanning my film for 3 years. Narurally, I've had to spend hours repairing artifacts in my scans that are specific to the analogue medium - dust, hairs, scratches, spots and so on. I am also a Computing Science student, and we are known for trying to automate everything - so for my undergrad project, I developed a deep learning-based approach to automatically detect and repair analogue artifacts in images; you can read about it [here](https://drive.google.com/file/d/1dM7Y6dkGzOqaBAZMcsDTjvaJez-gzFcx/view) and view the code [here](https://github.com/daniela997/DustScratchRemoval) if you are interested!\n\nWhile the results are extremely promising, the data I trained the models on had synthetic damage - overlays I had added manually to already \"clean\" scans. Therefore, I cannot say for sure how well it would work on non-syntetic damage at this stage. Now, I have embarked on a PhD based on my undergrad project, and to take it further, I want to collect a diverse data set of images with **real** dust and scratches, which will be used for training and evaluation of the restoration method. This is where I need this awesome community's help!\n\nIf you are an analogue photographer who scans their own film, *you* can help out crowdsource a data set of examples of analogue damage. For the purposes of the training, **we need two versions of the same scanned image - one with the dust, scratches and hairs or other such artifacts present, and one which has been repaired** \\- either manually via any image processing software, or by scanning with ICE on. Colour, black and white, slide or negative, 120 or 35mm - everything's accepted. Here's an example of a pair of images to submit:\n\n[Restored image \\(left\\) and Damaged image \\(right\\)](https://preview.redd.it/79ykfbkm1jg71.jpg?width=3508&amp;format=pjpg&amp;auto=webp&amp;s=94f7f6a35ba87d7eadbcb7fb10a4637df394fa54)\n\n# The data collection submission form can be found [here](https://forms.office.com/r/9BXk0h5nm8).\n\nIt includes detailed instructions for submission as well as a link to the project's Privacy Notice. **Submissions are anonymous**, but you can optionally share your e-mail address and be contacted about future publications, where you could **receive aknowledgement for your contribution to the project**.\n\nFor the sake of complete transparency, I am a student at the University of Glasgow, and my degree is publicly funded by the UKRI - there is no commercial interest involved in this project. This means that my research findings and collected data will be released publicly, as that is a condition of my funding. Furthermore, the code will be opensourced, and depending on the successful outcome of the project, I would like to develop a free web-based app where people can have the trained model try and repair their images. Others would be free to use the model for their own apps and plugins too.\n\nIf you have any additional questions about any aspect of the project, I am happy to answer them in the comments. Sharing this post with friends who shoot film and might not be on Reddit would also be extremely helpful.\n\nThank you for reading this far, thanks to the mods for allowing me to request help from the community, and thanks in advance to anyone who decides to contribute to the project!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p1sq9a/analogue_damage_restoration_via_deep_learning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "analogue damage restoration via deep learning /!/ hi everyone!\n\ni have been developing and scanning my film for 3 years. narurally, i've had to spend hours repairing artifacts in my scans that are specific to the analogue medium - dust, hairs, scratches, -----> spots !!!  and so on. i am also a computing science student, and we are known for trying to automate everything - so for my undergrad project, i developed a deep learning-based approach to automatically detect and repair analogue artifacts in images; you can read about it [here](https://drive.google.com/file/d/1dm7y6dkgzoqabazmcsdtjvajez-gzfcx/view) and view the code [here](https://github.com/daniela997/dustscratchremoval) if you are interested!\n\nwhile the results are extremely promising, the data i trained the models on had synthetic damage - overlays i had added manually to already \"clean\" scans. therefore, i cannot say for sure how well it would work on non-syntetic damage at this stage. now, i have embarked on a phd based on my undergrad project, and to take it further, i want to collect a diverse data set of images with **real** dust and scratches, which will be used for training and evaluation of the restoration method. this is where i need this awesome community's help!\n\nif you are an analogue photographer who scans their own film, *you* can help out crowdsource a data set of examples of analogue damage. for the purposes of the training, **we need two versions of the same scanned image - one with the dust, scratches and hairs or other such artifacts present, and one which has been repaired** \\- either manually via any image processing software, or by scanning with ice on. colour, black and white, slide or negative, 120 or 35mm - everything's accepted. here's an example of a pair of images to submit:\n\n[restored image \\(left\\) and damaged image \\(right\\)](https://preview.redd.it/79ykfbkm1jg71.jpg?width=3508&amp;format=pjpg&amp;auto=webp&amp;s=94f7f6a35ba87d7eadbcb7fb10a4637df394fa54)\n\n# the data collection submission form can be found [here](https://forms.office.com/r/9bxk0h5nm8).\n\nit includes detailed instructions for submission as well as a link to the project's privacy notice. **submissions are anonymous**, but you can optionally share your e-mail address and be contacted about future publications, where you could **receive aknowledgement for your contribution to the project**.\n\nfor the sake of complete transparency, i am a student at the university of glasgow, and my degree is publicly funded by the ukri - there is no commercial interest involved in this project. this means that my research findings and collected data will be released publicly, as that is a condition of my funding. furthermore, the code will be opensourced, and depending on the successful outcome of the project, i would like to develop a free web-based app where people can have the trained model try and repair their images. others would be free to use the model for their own apps and plugins too.\n\nif you have any additional questions about any aspect of the project, i am happy to answer them in the comments. sharing this post with friends who shoot film and might not be on reddit would also be extremely helpful.\n\nthank you for reading this far, thanks to the mods for allowing me to request help from the community, and thanks in advance to anyone who decides to contribute to the project!", "sortedWord": "None", "identifyer": 7294, "year": "2021"}, {"Unnamed: 0": 261795, "autor": "NormanQuacks345", "date": 1628571508000, "content": "What went wrong in this photo? I've got a bunch of photos like this where as the distance increases it just kinda goes white. Second picture is from the same spot, taken on my phone. Rikenon 1:2 50mm, Ektar 100. I don't remember how I metered for this shot but it was at box speed with built in meter", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p1igzq/what_went_wrong_in_this_photo_ive_got_a_bunch_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what went wrong in this photo? i've got a bunch of photos like this where as the distance increases it just kinda goes white. second picture is from the same -----> spot !!! , taken on my phone. rikenon 1:2 50mm, ektar 100. i don't remember how i metered for this shot but it was at box speed with built in meter", "sortedWord": "None", "identifyer": 7312, "year": "2021"}, {"Unnamed: 0": 261874, "autor": "LennyTheMemeMaster", "date": 1630970055000, "content": "I tried ECN-2 development recently, and my negatives came out with all these spots on them. I assume it to be spots of dried stabilizer, but I've never had this issue with C-41 processing before. Any ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pjavx8/i_tried_ecn2_development_recently_and_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i tried ecn-2 development recently, and my negatives came out with all these -----> spots !!!  on them. i assume it to be spots of dried stabilizer, but i've never had this issue with c-41 processing before. any ideas?", "sortedWord": "None", "identifyer": 7392, "year": "2021"}, {"Unnamed: 0": 261934, "autor": "tkeichler18", "date": 1609810562000, "content": "What is all this inside the lens of my Yashica Electro 35? I was replacing the light seals and spotted all this inside the lens. I’ve shot with it before, and was getting light leaks because the light seals were deteriorating, but never saw any of this on my images. Should I be concerned?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kqnecu/what_is_all_this_inside_the_lens_of_my_yashica/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "what is all this inside the lens of my yashica electro 35? i was replacing the light seals and -----> spotted !!!  all this inside the lens. i’ve shot with it before, and was getting light leaks because the light seals were deteriorating, but never saw any of this on my images. should i be concerned?", "sortedWord": "None", "identifyer": 7454, "year": "2021"}, {"Unnamed: 0": 262030, "autor": "rainerwein", "date": 1611064995000, "content": "What are these spots and stains on the negative (first time C-41)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l0kemb/what_are_these_spots_and_stains_on_the_negative/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!!  and stains on the negative (first time c-41)", "sortedWord": "None", "identifyer": 7560, "year": "2021"}, {"Unnamed: 0": 262097, "autor": "Lafite-Rotschild", "date": 1610967559000, "content": "Are the round white spots fungus inside my lens :( ?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kzsj2k/are_the_round_white_spots_fungus_inside_my_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are the round white -----> spots !!!  fungus inside my lens :( ?", "sortedWord": "None", "identifyer": 7630, "year": "2021"}, {"Unnamed: 0": 262117, "autor": "dffrus", "date": 1632400919000, "content": "Yellow edges and (blue) spots on my photos? /!/ Hi everyone! I've been shooting with my Nikon FE for a long while now which I inherited from my uncle. He is a retired photojournalist so I got it in very good shape. Got it checked routinely and found no problems so far, I also clean dusts every now and then.\n\nHowever my three most recent rolls shows this yellowing tendency at the edges (top and bottom), and also black/blue spots.\n\nTwo of them (first two sample pics) were independently modified rolls that were stored for quite a while, and IIRC the second one is expired. If it's a problem with prolonged storage + expiration then I completely understand; I didn't shoot at all during the first lockdowns in my country and only started again in maybe September last year).\n\nBut the third roll (KINO/KNHO 200, last sample pic) is relatively new (bought in April 2021, expires February 2023) and it still shows the same problems. \n\nFor the matter I do not store films in the fridge, I store them in my bedroom (my bedroom has a relatively cold temperature of about 18-20 celsius with air conditioning). \n\nDid some initial research and found that it could be either:\n\n* Improper storage (leading to sped-up deterioration of the rolls (?) and/or moisture),\n* Light leak (though I doubt it)\n* Problems during the development/scanning process (which would then require me to turn to my lab; to note the spots are there in the negatives but I have no clue on the yellowing)\n* Waiting for too long to shoot after advancing the film lever (?)\n\nI have a photoshoot in two days and I reckon I cannot send my camera in for checkings and repairs for the moment. Does anyone have a clue about these problems before I take any further action?\n\nI extend my gratitude in advance.\n\nhttps://preview.redd.it/3bcfzc9bu8p71.jpg?width=2005&amp;format=pjpg&amp;auto=webp&amp;s=edde4bcc6c8b5bbaf61a5ee26a690a4943bbff94\n\nhttps://preview.redd.it/t9mvycnrt8p71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=e00b0360fecd21ac59862b7708a7936905b24672\n\nhttps://preview.redd.it/f4jk6vgc09p71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=2037d673a99d94dd4b20ed3096fcbd179324d523", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ptucrb/yellow_edges_and_blue_spots_on_my_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yellow edges and (blue) -----> spots !!!  on my photos? /!/ hi everyone! i've been shooting with my nikon fe for a long while now which i inherited from my uncle. he is a retired photojournalist so i got it in very good shape. got it checked routinely and found no problems so far, i also clean dusts every now and then.\n\nhowever my three most recent rolls shows this yellowing tendency at the edges (top and bottom), and also black/blue spots.\n\ntwo of them (first two sample pics) were independently modified rolls that were stored for quite a while, and iirc the second one is expired. if it's a problem with prolonged storage + expiration then i completely understand; i didn't shoot at all during the first lockdowns in my country and only started again in maybe september last year).\n\nbut the third roll (kino/knho 200, last sample pic) is relatively new (bought in april 2021, expires february 2023) and it still shows the same problems. \n\nfor the matter i do not store films in the fridge, i store them in my bedroom (my bedroom has a relatively cold temperature of about 18-20 celsius with air conditioning). \n\ndid some initial research and found that it could be either:\n\n* improper storage (leading to sped-up deterioration of the rolls (?) and/or moisture),\n* light leak (though i doubt it)\n* problems during the development/scanning process (which would then require me to turn to my lab; to note the spots are there in the negatives but i have no clue on the yellowing)\n* waiting for too long to shoot after advancing the film lever (?)\n\ni have a photoshoot in two days and i reckon i cannot send my camera in for checkings and repairs for the moment. does anyone have a clue about these problems before i take any further action?\n\ni extend my gratitude in advance.\n\nhttps://preview.redd.it/3bcfzc9bu8p71.jpg?width=2005&amp;format=pjpg&amp;auto=webp&amp;s=edde4bcc6c8b5bbaf61a5ee26a690a4943bbff94\n\nhttps://preview.redd.it/t9mvycnrt8p71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=e00b0360fecd21ac59862b7708a7936905b24672\n\nhttps://preview.redd.it/f4jk6vgc09p71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=2037d673a99d94dd4b20ed3096fcbd179324d523", "sortedWord": "None", "identifyer": 7650, "year": "2021"}, {"Unnamed: 0": 262239, "autor": "sutherlandan", "date": 1610754578000, "content": "New to film photography, just bought a mamiya 645 1000s. Have some questions and looking for tips to get the most out of this camera! /!/ Hello, thanks for reading. I am beyond excited to start shooting with my new camera and would like to get a few things sorted. I purchased a kit with the AE metering prism, waist level finder and have the 55, 80 and 150mm lenses.\n\nMy first question, I am noticing that when using the mirror lockup with AE prism attached the camera is taking longer exposures than the meter is showing. I am guessing this is because the meter is not seeing the scene as the mirror is up? So I should just set the shutter dial manually to what the meter is showing I am guessing.\n\nSecond, I am mainly interested in landscape shots. I will be using a tripod and taking my time, is there a sweet spot for theses Sekor C lenses for sharpness? I remember watching some videos from medium/large format film photographers and seeing f16/f22 apertures with longer exposures, something I'm not used to coming from digital. I've also heard to not fear stopping down with these cameras, any tips here?\n\nThird, I am noticing my shutter dial has some play 1 stop forward and backwards from where you 'click' it in place. So if I rotate and 'click' it to 1/250, I can turn it from 1/125 to 1/500 freely without any resistance. It still seems to work correctly if I change it ahead or back 1 stop despite not feeling the 'click', just wondering if this is normal.\n\nLastly, I have gone over the camera as best I can to ensure everything is functioning correctly, the shutter speed seems accurate at least for the longer speeds, self timer seems to work, light seals look good, anything else to check before my ebay return window closes?\n\nAny other tips you might have for using this camera I would really appreciate any help! Thanks again.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ky74cn/new_to_film_photography_just_bought_a_mamiya_645/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "new to film photography, just bought a mamiya 645 1000s. have some questions and looking for tips to get the most out of this camera! /!/ hello, thanks for reading. i am beyond excited to start shooting with my new camera and would like to get a few things sorted. i purchased a kit with the ae metering prism, waist level finder and have the 55, 80 and 150mm lenses.\n\nmy first question, i am noticing that when using the mirror lockup with ae prism attached the camera is taking longer exposures than the meter is showing. i am guessing this is because the meter is not seeing the scene as the mirror is up? so i should just set the shutter dial manually to what the meter is showing i am guessing.\n\nsecond, i am mainly interested in landscape shots. i will be using a tripod and taking my time, is there a sweet -----> spot !!!  for theses sekor c lenses for sharpness? i remember watching some videos from medium/large format film photographers and seeing f16/f22 apertures with longer exposures, something i'm not used to coming from digital. i've also heard to not fear stopping down with these cameras, any tips here?\n\nthird, i am noticing my shutter dial has some play 1 stop forward and backwards from where you 'click' it in place. so if i rotate and 'click' it to 1/250, i can turn it from 1/125 to 1/500 freely without any resistance. it still seems to work correctly if i change it ahead or back 1 stop despite not feeling the 'click', just wondering if this is normal.\n\nlastly, i have gone over the camera as best i can to ensure everything is functioning correctly, the shutter speed seems accurate at least for the longer speeds, self timer seems to work, light seals look good, anything else to check before my ebay return window closes?\n\nany other tips you might have for using this camera i would really appreciate any help! thanks again.", "sortedWord": "None", "identifyer": 7775, "year": "2021"}, {"Unnamed: 0": 262277, "autor": "Broken_Perfectionist", "date": 1609635955000, "content": "Minolta camera recommendation? Was gifted a special lens. Details in comments. /!/ A friend sent me a 800mm f11 mirror lens that says SR on it. I’m heavily invested in the Nikon system.  Was looking for a cheap Minolta camera to try it out on. Fully manual, broken meter is fine (I have external incident and spot meters). Nothing fancy but even plastic fantastic cameras are welcome but doubt AF or metering would work at f11. Was thinking SRT101 or 200 series but would like to hear other recommendations. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kpa6ot/minolta_camera_recommendation_was_gifted_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "minolta camera recommendation? was gifted a special lens. details in comments. /!/ a friend sent me a 800mm f11 mirror lens that says sr on it. i’m heavily invested in the nikon system.  was looking for a cheap minolta camera to try it out on. fully manual, broken meter is fine (i have external incident and -----> spot !!!  meters). nothing fancy but even plastic fantastic cameras are welcome but doubt af or metering would work at f11. was thinking srt101 or 200 series but would like to hear other recommendations. thanks!", "sortedWord": "None", "identifyer": 7813, "year": "2021"}, {"Unnamed: 0": 262299, "autor": "FeloMonk", "date": 1609603475000, "content": "Best light meter for spot metering and general reflected metering? /!/ Hello! I’m looking to pick up a light meter to use with my analog cameras. The main functionality I want is a good spot meter, so I was thinking of getting a Pentax digital spotmeter. I like that it’s simple to use without some sort of complicated touchscreen or tons of features I don’t need.\n\nHowever, I also think it’d be useful to get a general reflected light reading of a whole scene without having to spot meter the various areas of the scene. I don’t think I’ll always want to go through and spot everything, but will want to just get an EV reading of the general natural lighting.\n\nAre there any light meters out there that have spot metering and general reflected light metering that aren’t crazy complicated like the Sekonic L-858? I basically want a Pentax spotmeter that can also do non-spot reflected meter readings. Any suggestions would be greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kozy6o/best_light_meter_for_spot_metering_and_general/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best light meter for -----> spot !!!  metering and general reflected metering? /!/ hello! i’m looking to pick up a light meter to use with my analog cameras. the main functionality i want is a good spot meter, so i was thinking of getting a pentax digital spotmeter. i like that it’s simple to use without some sort of complicated touchscreen or tons of features i don’t need.\n\nhowever, i also think it’d be useful to get a general reflected light reading of a whole scene without having to spot meter the various areas of the scene. i don’t think i’ll always want to go through and spot everything, but will want to just get an ev reading of the general natural lighting.\n\nare there any light meters out there that have spot metering and general reflected light metering that aren’t crazy complicated like the sekonic l-858? i basically want a pentax spotmeter that can also do non-spot reflected meter readings. any suggestions would be greatly appreciated!", "sortedWord": "None", "identifyer": 7835, "year": "2021"}, {"Unnamed: 0": 262311, "autor": "gdr_01", "date": 1609585405000, "content": "I've just received this Olympus 50mm f/1.4 but there's dust inside (and a weird spot too), should I return it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kovqzz/ive_just_received_this_olympus_50mm_f14_but/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've just received this olympus 50mm f/1.4 but there's dust inside (and a weird -----> spot !!!  too), should i return it?", "sortedWord": "None", "identifyer": 7847, "year": "2021"}, {"Unnamed: 0": 262418, "autor": "imaje89", "date": 1625489455000, "content": "UK - Portsmouth Film Photography Meetup Group /!/ Hey to all South East England Film shooters!   \n\n\nI've just spotted this new meetup group appear! Just spreading the word and helping to expand the opportunity for more film shooters to meet, help eachother and get back out there and shoot some film!   \n\n\n[https://www.meetup.com/portsmouth-film-photography-meetup-group/](https://www.meetup.com/portsmouth-film-photography-meetup-group/)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oe6qof/uk_portsmouth_film_photography_meetup_group/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "uk - portsmouth film photography meetup group /!/ hey to all south east england film shooters!   \n\n\ni've just -----> spotted !!!  this new meetup group appear! just spreading the word and helping to expand the opportunity for more film shooters to meet, help eachother and get back out there and shoot some film!   \n\n\n[https://www.meetup.com/portsmouth-film-photography-meetup-group/](https://www.meetup.com/portsmouth-film-photography-meetup-group/)", "sortedWord": "None", "identifyer": 7955, "year": "2021"}, {"Unnamed: 0": 262429, "autor": "thejooginator", "date": 1625458004000, "content": "Anyone know what’s causing the dark streak on the top right of my photos from my Olympus OM-1n? It appears in several photos in the same spot.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/odzf40/anyone_know_whats_causing_the_dark_streak_on_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone know what’s causing the dark streak on the top right of my photos from my olympus om-1n? it appears in several photos in the same -----> spot !!! .", "sortedWord": "None", "identifyer": 7966, "year": "2021"}, {"Unnamed: 0": 262538, "autor": "geo_nomad", "date": 1610066724000, "content": "Nikonos test roll, issues: Every photo has white lines down it in different spots, doesn't look to be a light leak issue, would this be a lab issue or shutter issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ksr6go/nikonos_test_roll_issues_every_photo_has_white/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "nikonos test roll, issues: every photo has white lines down it in different -----> spots !!! , doesn't look to be a light leak issue, would this be a lab issue or shutter issue?", "sortedWord": "None", "identifyer": 8084, "year": "2021"}, {"Unnamed: 0": 262555, "autor": "Riles_Corey", "date": 1610038918000, "content": "Looking to purchase a Nikkor 20mm F/3.5 for my new Nikon F2. Came across this on ebay and it looks like there are some kind of spots on the lens glass. Is it fungus?Seller said it’s near mint...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kshgsc/looking_to_purchase_a_nikkor_20mm_f35_for_my_new/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looking to purchase a nikkor 20mm f/3.5 for my new nikon f2. came across this on ebay and it looks like there are some kind of -----> spots !!!  on the lens glass. is it fungus?seller said it’s near mint...", "sortedWord": "None", "identifyer": 8101, "year": "2021"}, {"Unnamed: 0": 262782, "autor": "LosDanilos", "date": 1634939331000, "content": "Lightmeter advice /!/ I want a new lightmeter. I really want to use incident metering and spot metering. I could buy a Sekonic L-408 for around 170$. The meter is very old and I'm not sure if the 5° spotmeter is not tight enough. I could also buy a L-508. Which is overall a really nice meter but it also costs around 350$.\n\nDo you guys think the 5° spotmeter is really a problem from landscape photography? Do you have any experience with the L-408?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qdr4os/lightmeter_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lightmeter advice /!/ i want a new lightmeter. i really want to use incident metering and -----> spot !!!  metering. i could buy a sekonic l-408 for around 170$. the meter is very old and i'm not sure if the 5° spotmeter is not tight enough. i could also buy a l-508. which is overall a really nice meter but it also costs around 350$.\n\ndo you guys think the 5° spotmeter is really a problem from landscape photography? do you have any experience with the l-408?", "sortedWord": "None", "identifyer": 8331, "year": "2021"}, {"Unnamed: 0": 262890, "autor": "Training_Response_19", "date": 1618816791000, "content": "Light meter viewfinder cracked /!/ I managed to drop the 10 degree spot meter attachment for my Minolta Autometer III and the glass cracked on the part that screws in over the sensor.\n\nIs it FUBAR? I picked it up with the intention of metering for some long exposures at night, will the cracks in the glass cause some kind of refractive/reflective fuckery? I checked it against a friends DSLR and it seems to be okayish in low light but wondering if anyone has ever had a similar situation?\n\nhttps://preview.redd.it/7wnlc3yaeqt41.jpg?width=920&amp;format=pjpg&amp;auto=webp&amp;s=f0fb23951221d7fc571efbdfffccccffc3462f62", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mtvbsc/light_meter_viewfinder_cracked/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light meter viewfinder cracked /!/ i managed to drop the 10 degree -----> spot !!!  meter attachment for my minolta autometer iii and the glass cracked on the part that screws in over the sensor.\n\nis it fubar? i picked it up with the intention of metering for some long exposures at night, will the cracks in the glass cause some kind of refractive/reflective fuckery? i checked it against a friends dslr and it seems to be okayish in low light but wondering if anyone has ever had a similar situation?\n\nhttps://preview.redd.it/7wnlc3yaeqt41.jpg?width=920&amp;format=pjpg&amp;auto=webp&amp;s=f0fb23951221d7fc571efbdfffccccffc3462f62", "sortedWord": "None", "identifyer": 8440, "year": "2021"}, {"Unnamed: 0": 262918, "autor": "alsohesaninja", "date": 1618761681000, "content": "Does anyone know what might have caused these black spots on the picture? Thanks for any advice!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mtfl2m/does_anyone_know_what_might_have_caused_these/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does anyone know what might have caused these black -----> spots !!!  on the picture? thanks for any advice!", "sortedWord": "None", "identifyer": 8469, "year": "2021"}, {"Unnamed: 0": 263019, "autor": "warrior_waffle", "date": 1619213374000, "content": "Thrift store find! Looks like it has been very well taken care of! The focus switch works (moves lenses into place behind the shutter, and the appature works as it should, both view finders are brilliant and mostly clear, just a few spots. I have some film coming in tomorrow!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mx5kke/thrift_store_find_looks_like_it_has_been_very/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "thrift store find! looks like it has been very well taken care of! the focus switch works (moves lenses into place behind the shutter, and the appature works as it should, both view finders are brilliant and mostly clear, just a few -----> spots !!! . i have some film coming in tomorrow!", "sortedWord": "None", "identifyer": 8571, "year": "2021"}, {"Unnamed: 0": 263055, "autor": "throwmeawaypoker", "date": 1619154659000, "content": "Mamiya RZ67 PD Prism Finder issue /!/ I’ve looked at the manual and tried switching the A and S metering modes as well as turning the shutter speed dial and aperture ring on the lens in different multiple combinations/iterations and am unable to get any exposure reading LED to turn on. \n\nI am able to see the A and S LED when I hit the power button on the PD Prism however nothing other than that. \n\nMy understanding is that I can choose between Average metering and Spot metering, then I hit the power button on the prism itself and then I will see a green LED for a “correct” exposure or red plus/minus LEDs for over/under exposure. \n\nCan someone please provide some insight? About to rip my hair out.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mwnxwj/mamiya_rz67_pd_prism_finder_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mamiya rz67 pd prism finder issue /!/ i’ve looked at the manual and tried switching the a and s metering modes as well as turning the shutter speed dial and aperture ring on the lens in different multiple combinations/iterations and am unable to get any exposure reading led to turn on. \n\ni am able to see the a and s led when i hit the power button on the pd prism however nothing other than that. \n\nmy understanding is that i can choose between average metering and -----> spot !!!  metering, then i hit the power button on the prism itself and then i will see a green led for a “correct” exposure or red plus/minus leds for over/under exposure. \n\ncan someone please provide some insight? about to rip my hair out.", "sortedWord": "None", "identifyer": 8609, "year": "2021"}, {"Unnamed: 0": 263128, "autor": "bwg1997", "date": 1620148417000, "content": "Is slide film the proper choice for my desired shots? /!/ Hi all, \nI’m a new member here and somewhat new to photography. I will be in Beirut later this month and am dying to take some pics at the various beach clubs located in the city. \n\nIn general, I imagine the sun will be quite bright and strong, and based on other pictures I’ve seen before the environment will probably contain a fair amount of contrasting colors such as beach towels, concrete, the sea, the sky etc (though I feel the loud colors may make spot metering a bit easier for a beginner). \n\nI really want to experiment with slide film (velvia 100) and am dreaming of capturing beautiful photos with deep saturation and contrast. Is transparent film adept at capturing dramatic light sources like an overhead sun on a clear day and environments with large differences in color? \n\nAdditionally, are there any hints or tricks I should take into consideration before entering the world of transparency? I assume I should invest in an incident meter? \n\nThanks all and please forgive my basic understanding.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n4tqse/is_slide_film_the_proper_choice_for_my_desired/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is slide film the proper choice for my desired shots? /!/ hi all, \ni’m a new member here and somewhat new to photography. i will be in beirut later this month and am dying to take some pics at the various beach clubs located in the city. \n\nin general, i imagine the sun will be quite bright and strong, and based on other pictures i’ve seen before the environment will probably contain a fair amount of contrasting colors such as beach towels, concrete, the sea, the sky etc (though i feel the loud colors may make -----> spot !!!  metering a bit easier for a beginner). \n\ni really want to experiment with slide film (velvia 100) and am dreaming of capturing beautiful photos with deep saturation and contrast. is transparent film adept at capturing dramatic light sources like an overhead sun on a clear day and environments with large differences in color? \n\nadditionally, are there any hints or tricks i should take into consideration before entering the world of transparency? i assume i should invest in an incident meter? \n\nthanks all and please forgive my basic understanding.", "sortedWord": "None", "identifyer": 8682, "year": "2021"}, {"Unnamed: 0": 263200, "autor": "whipfixed", "date": 1621874879000, "content": "What are these little spots on my mirror? /!/ I have these little black spots on my mirror. They are in a perfect line and they do not come off when trying to clean them. Not with anything I've tried at least. \n\nDifficult to a get a picture of but here's the best I got: https://imgur.com/ybNJWHg\n\nIt's a Pentax K1000 if that makes a difference.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nk2epn/what_are_these_little_spots_on_my_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these little -----> spots !!!  on my mirror? /!/ i have these little black spots on my mirror. they are in a perfect line and they do not come off when trying to clean them. not with anything i've tried at least. \n\ndifficult to a get a picture of but here's the best i got: https://imgur.com/ybnjwhg\n\nit's a pentax k1000 if that makes a difference.", "sortedWord": "None", "identifyer": 8755, "year": "2021"}, {"Unnamed: 0": 263346, "autor": "eyeonfilms", "date": 1611317043000, "content": "In this YT episode, I decided to take a photography trip with one of my favourite camera Konica Big Mini and one of the cheapest and interesting film stock Kodak Gold 200. The best spot to test these two was an artistic district in Amsterdam called NDSM.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l2md38/in_this_yt_episode_i_decided_to_take_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "in this yt episode, i decided to take a photography trip with one of my favourite camera konica big mini and one of the cheapest and interesting film stock kodak gold 200. the best -----> spot !!!  to test these two was an artistic district in amsterdam called ndsm.", "sortedWord": "None", "identifyer": 8903, "year": "2021"}, {"Unnamed: 0": 263453, "autor": "giopositivo", "date": 1626643547000, "content": "Hi guys anyone knows what are these spots on the negative? This is not the shot, I developed it with ilf ddx. I had this problem several times , can you help me?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/omzrj1/hi_guys_anyone_knows_what_are_these_spots_on_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hi guys anyone knows what are these -----> spots !!!  on the negative? this is not the shot, i developed it with ilf ddx. i had this problem several times , can you help me?", "sortedWord": "None", "identifyer": 9012, "year": "2021"}, {"Unnamed: 0": 263516, "autor": "420buttmage", "date": 1623137017000, "content": "Troubleshooting: is it the camera, the lab, or... me? /!/ `~ I'll preface by saying sorry for the novel, and I'm pretty open to it just being me ~`\n\nI've noticed over the last ~5 years that my film keeps coming back looking more and more like booty. I'd always attributed it to user error, but after moving to a different city and shooting a few rolls this spring to wild results, I'm starting to reconsider.\n\nThe rolls started coming back with images like these:\n[ex 1](https://imgur.com/BMyDRE2), [ex 2](https://imgur.com/vnzvp5t)\n\nThey were super underexposed, despite being shot during daylight/sunset and metering off the internal light meter or using program/automatic. I kinda gave up on shooting and spent the last year or so staying home when possible and and gaining weight like a champ. Coming back a little over a year later, I shot a couple more rolls of film (and switched labs).\n\nThe results were even worse. [This photo](https://imgur.com/8A81mOD) was shot in late afternoon light and still looks underexposed. Thinking the issue might lie with the meter, I started metering with a light meter app on my phone, but the exposures were still coming out incorrect. [This one](https://imgur.com/Awecjcv) was shot around golden hour. Can't remember the aperture, but the shutter was 1/500 as a result.\n\nHere's [another example, shot in late afternoon on a sunny day](https://imgur.com/vhQImze). The storefront itself isn't in direct sun, but there's still a lot of ambient light. To check and see if there was more info I could pull from the negative, I rescanned it myself and converted it using Negative Lab Pro. [Here are the results](https://imgur.com/pKbbOKN), as well as the [histogram](https://imgur.com/xDvfboP).\n\nAt this point, I'm starting to wonder if there's an issue with the shutter itself. However, in addition to being grossly underexposed, the dynamic range looks kinda wack to me as well. Up til now, each photo has been on Portra 400 or Fuji Superia 400 shot with a Minolta X700 (md 50mm f1.4-16). To further test, I shot an additional roll with a Minolta SRT101 (58mm 1.4-16 w/ skylight and cross screen filter pls dont judge), and another with a Canonet QL17 for good measure -- both around golden hour/sunset.\n\nBoth are better, but still a little funky. The SRT101 [looks p nice esp in the highlights](https://imgur.com/453xQev). The QL17 [looks alright [here](https://imgur.com/OK2Ipot) and [here](https://imgur.com/HZDptp7) as well (despite some haze in the glass), but not  s u p e r  d a n k.\n\nThis lead me to wonder if it might be an issue with my lab as well? I'm not sure if I'm just being a princess about it, or if I'm living in the past, or if I've been spoiled by the dynamic range on smartphone cameras, or honestly if the issue is trying to meter with a smartphone camera instead of a spot meter, but looking back at [what I took using program/auto and the internal light meter in similar lighting conditions](https://imgur.com/7v3AdC6) with the X700 10+ years ago does give me pause.\n\nAnyway, I appreciate any input or feedback into what I might be doing wrong!\n\n\ntl;dr the photos I take in 2021 look like ass compared to the photos I took 12-14 years ago and idk why", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nuyz94/troubleshooting_is_it_the_camera_the_lab_or_me/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "troubleshooting: is it the camera, the lab, or... me? /!/ `~ i'll preface by saying sorry for the novel, and i'm pretty open to it just being me ~`\n\ni've noticed over the last ~5 years that my film keeps coming back looking more and more like booty. i'd always attributed it to user error, but after moving to a different city and shooting a few rolls this spring to wild results, i'm starting to reconsider.\n\nthe rolls started coming back with images like these:\n[ex 1](https://imgur.com/bmydre2), [ex 2](https://imgur.com/vnzvp5t)\n\nthey were super underexposed, despite being shot during daylight/sunset and metering off the internal light meter or using program/automatic. i kinda gave up on shooting and spent the last year or so staying home when possible and and gaining weight like a champ. coming back a little over a year later, i shot a couple more rolls of film (and switched labs).\n\nthe results were even worse. [this photo](https://imgur.com/8a81mod) was shot in late afternoon light and still looks underexposed. thinking the issue might lie with the meter, i started metering with a light meter app on my phone, but the exposures were still coming out incorrect. [this one](https://imgur.com/awecjcv) was shot around golden hour. can't remember the aperture, but the shutter was 1/500 as a result.\n\nhere's [another example, shot in late afternoon on a sunny day](https://imgur.com/vhqimze). the storefront itself isn't in direct sun, but there's still a lot of ambient light. to check and see if there was more info i could pull from the negative, i rescanned it myself and converted it using negative lab pro. [here are the results](https://imgur.com/pkbbokn), as well as the [histogram](https://imgur.com/xdvfbop).\n\nat this point, i'm starting to wonder if there's an issue with the shutter itself. however, in addition to being grossly underexposed, the dynamic range looks kinda wack to me as well. up til now, each photo has been on portra 400 or fuji superia 400 shot with a minolta x700 (md 50mm f1.4-16). to further test, i shot an additional roll with a minolta srt101 (58mm 1.4-16 w/ skylight and cross screen filter pls dont judge), and another with a canonet ql17 for good measure -- both around golden hour/sunset.\n\nboth are better, but still a little funky. the srt101 [looks p nice esp in the highlights](https://imgur.com/453xqev). the ql17 [looks alright [here](https://imgur.com/ok2ipot) and [here](https://imgur.com/hzdptp7) as well (despite some haze in the glass), but not  s u p e r  d a n k.\n\nthis lead me to wonder if it might be an issue with my lab as well? i'm not sure if i'm just being a princess about it, or if i'm living in the past, or if i've been spoiled by the dynamic range on smartphone cameras, or honestly if the issue is trying to meter with a smartphone camera instead of a -----> spot !!!  meter, but looking back at [what i took using program/auto and the internal light meter in similar lighting conditions](https://imgur.com/7v3adc6) with the x700 10+ years ago does give me pause.\n\nanyway, i appreciate any input or feedback into what i might be doing wrong!\n\n\ntl;dr the photos i take in 2021 look like ass compared to the photos i took 12-14 years ago and idk why", "sortedWord": "None", "identifyer": 9077, "year": "2021"}, {"Unnamed: 0": 263587, "autor": "citiFresh", "date": 1617664066000, "content": "Does the MyLightMeterPro app read for middle gray? /!/ I have been shooting slide film which I have yet to develop. I spot-metered for zone 7 with the MyLightMeterPro app, but now I am suddenly unsure of whether it gives a middle gray (zone 5) reading. If it doesn’t, I will go with DynamicChrome developer.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mkxhh2/does_the_mylightmeterpro_app_read_for_middle_gray/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does the mylightmeterpro app read for middle gray? /!/ i have been shooting slide film which i have yet to develop. i -----> spot !!! -metered for zone 7 with the mylightmeterpro app, but now i am suddenly unsure of whether it gives a middle gray (zone 5) reading. if it doesn’t, i will go with dynamicchrome developer.\n\nthanks!", "sortedWord": "None", "identifyer": 9149, "year": "2021"}, {"Unnamed: 0": 263616, "autor": "nlabodin", "date": 1611512939000, "content": "Help with expired Plus-X /!/  So I picked up a bulk loader at a consignment store and it happened to have film in it already. I didn't know what it was to made a short roll and tested it from EI400-EI3 and developed in HC110 1+160 stand for 45 mins. Turns out, its almost a full roll of Plus-X. I have 3 questions. Is there a better developer to cut through the fog, is there amyway to clear off the mold spots, and is my estimate of EI25 look right, in terms of proper exposure?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l44wxs/help_with_expired_plusx/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help with expired plus-x /!/  so i picked up a bulk loader at a consignment store and it happened to have film in it already. i didn't know what it was to made a short roll and tested it from ei400-ei3 and developed in hc110 1+160 stand for 45 mins. turns out, its almost a full roll of plus-x. i have 3 questions. is there a better developer to cut through the fog, is there amyway to clear off the mold -----> spots !!! , and is my estimate of ei25 look right, in terms of proper exposure?", "sortedWord": "None", "identifyer": 9178, "year": "2021"}, {"Unnamed: 0": 263752, "autor": "drgphoto", "date": 1621288348000, "content": "Where can I find a leather half case for my Nikon FE2 in NYC? /!/ Hi!\n\nI'm trying to find any sellers in NYC that offer good leather half cases for my Nikon FE2? \n\nI see a lot on Etsy but I'd like to just get one on the spot since I live in NY. \n\nIf anyone has any recommendations even if it's like in NJ as well, let me know!\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/net0p3/where_can_i_find_a_leather_half_case_for_my_nikon/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "where can i find a leather half case for my nikon fe2 in nyc? /!/ hi!\n\ni'm trying to find any sellers in nyc that offer good leather half cases for my nikon fe2? \n\ni see a lot on etsy but i'd like to just get one on the -----> spot !!!  since i live in ny. \n\nif anyone has any recommendations even if it's like in nj as well, let me know!\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 9316, "year": "2021"}, {"Unnamed: 0": 264049, "autor": "YUNGDU", "date": 1620711020000, "content": "Too Much or Too Little Grain? /!/ Hello all,\n\nI’ve been having my film developed and scanned at a local lab and found their scans to be too grainy, or rather the grain size was very significant compared to what I see posted on r/analog.\n\nTo fix this, I got myself an Epson V600 and scanned with professional mode at 2400 dpi, with only ICE checked. Now I’m seeing no grain at all in my scans and it doesn’t feel right to me, I do want some amount of grain in my shot, it’s film after all. But I just can’t seem to find that sweet spot.\n\nIf anyone has any tips on how they scan with a V600, I would really appreciate it!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n9pqsp/too_much_or_too_little_grain/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "too much or too little grain? /!/ hello all,\n\ni’ve been having my film developed and scanned at a local lab and found their scans to be too grainy, or rather the grain size was very significant compared to what i see posted on r/analog.\n\nto fix this, i got myself an epson v600 and scanned with professional mode at 2400 dpi, with only ice checked. now i’m seeing no grain at all in my scans and it doesn’t feel right to me, i do want some amount of grain in my shot, it’s film after all. but i just can’t seem to find that sweet -----> spot !!! .\n\nif anyone has any tips on how they scan with a v600, i would really appreciate it!", "sortedWord": "None", "identifyer": 9618, "year": "2021"}, {"Unnamed: 0": 264062, "autor": "Fyggy_newton", "date": 1620674502000, "content": "I have this Label/Collective music and art business I’ve been starting and have had homies apart of it that might still but I’m looking to move to Long Beach CA in July or so... and I only some people can move and I need people who are interested in wanting to be apart of this? /!/ The Bucket wants you!? \n\nThe Bucket is what I named it and I’m trying to open it out of my garage whenever I lockdown a spot with my buddy Hubbard.... I guess I’m asking is there any LBC Heads who wanna help and be apart of this analogue label/collective? Need recording engineers,filmmakers, musicians, people to colab on this such and art work and zine makers...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n9dlt3/i_have_this_labelcollective_music_and_art/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have this label/collective music and art business i’ve been starting and have had homies apart of it that might still but i’m looking to move to long beach ca in july or so... and i only some people can move and i need people who are interested in wanting to be apart of this? /!/ the bucket wants you!? \n\nthe bucket is what i named it and i’m trying to open it out of my garage whenever i lockdown a -----> spot !!!  with my buddy hubbard.... i guess i’m asking is there any lbc heads who wanna help and be apart of this analogue label/collective? need recording engineers,filmmakers, musicians, people to colab on this such and art work and zine makers...", "sortedWord": "None", "identifyer": 9632, "year": "2021"}, {"Unnamed: 0": 264102, "autor": "ekimneems", "date": 1620594917000, "content": "Issue with white spots, multiple cameras - development problem? /!/ I’ve noticed on many of my photos lately I’ve been seeing some white spots and I’m wondering if this is a development or scanning issue and what it might be?\n\n[2 sample photos](https://imgur.com/a/vlgqLMO)\n\nThe first pic (beach) is taken on a Leica M6 + 35 cron, the second on a Nikon 35ti. They are both Kodak Ultramax 400 shot at box speed, developed at home in a Paterson tank with Cinestill C-41 powder kit. Scanned with a Fuji X-T2 w/ 60mm macro lens.\n\nI’ve been developing this way for a long time and I have noticed this happening sporadically but not all the time. I’ve sort of eliminated lens flare or lens issues (dust, artifacts etc) just because they are different lenses and both VERY clean. The ‘cron is 2 months old (ASPH v2)\n\nCould this be an issue of re-using chemicals? My current chems (these two rolls) were developed as the 14th and 15th rolls and mixed about 8 weeks ago. That’s what I’m leaning towards as the problem but was hoping for other ideas.\n\nAny insight greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n8ns21/issue_with_white_spots_multiple_cameras/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "issue with white -----> spots !!! , multiple cameras - development problem? /!/ i’ve noticed on many of my photos lately i’ve been seeing some white spots and i’m wondering if this is a development or scanning issue and what it might be?\n\n[2 sample photos](https://imgur.com/a/vlgqlmo)\n\nthe first pic (beach) is taken on a leica m6 + 35 cron, the second on a nikon 35ti. they are both kodak ultramax 400 shot at box speed, developed at home in a paterson tank with cinestill c-41 powder kit. scanned with a fuji x-t2 w/ 60mm macro lens.\n\ni’ve been developing this way for a long time and i have noticed this happening sporadically but not all the time. i’ve sort of eliminated lens flare or lens issues (dust, artifacts etc) just because they are different lenses and both very clean. the ‘cron is 2 months old (asph v2)\n\ncould this be an issue of re-using chemicals? my current chems (these two rolls) were developed as the 14th and 15th rolls and mixed about 8 weeks ago. that’s what i’m leaning towards as the problem but was hoping for other ideas.\n\nany insight greatly appreciated!", "sortedWord": "None", "identifyer": 9672, "year": "2021"}, {"Unnamed: 0": 264254, "autor": "trapped_in_limb0", "date": 1625857070000, "content": "How to use a spot meter with slide film? /!/ So I recently acquired a Pentax spot meter (this specific model: http://my-pentax.com/spotmeter/files/stacks-image-74930F9-1198x794.jpg)\n\nI am going to use it to shoot film. Now the videos that I have looked at YouTube all use some advanced model of a spot meter that has averaging capability. Mine does not. \n\nSo I am thinking these steps:\n\n1.\tTake highlight spot measurement. Say it is 7EV.\n2.\tTake lowlight spot measurement. Say it is 4 EV. \n3.\t3 EV is decent enough for slide E100. (7+4)/2 = 5.5\n4.\tRotate dial to 5.5 EV and note down the aperture/shutter combo.\n5.\tShoot at this combo. \n\n\nDoes this sound right? Especially step 3 where I am just taking the midpoint?\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oh264m/how_to_use_a_spot_meter_with_slide_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to use a -----> spot !!!  meter with slide film? /!/ so i recently acquired a pentax spot meter (this specific model: http://my-pentax.com/spotmeter/files/stacks-image-74930f9-1198x794.jpg)\n\ni am going to use it to shoot film. now the videos that i have looked at youtube all use some advanced model of a spot meter that has averaging capability. mine does not. \n\nso i am thinking these steps:\n\n1.\ttake highlight spot measurement. say it is 7ev.\n2.\ttake lowlight spot measurement. say it is 4 ev. \n3.\t3 ev is decent enough for slide e100. (7+4)/2 = 5.5\n4.\trotate dial to 5.5 ev and note down the aperture/shutter combo.\n5.\tshoot at this combo. \n\n\ndoes this sound right? especially step 3 where i am just taking the midpoint?\n\nthanks!", "sortedWord": "None", "identifyer": 9826, "year": "2021"}, {"Unnamed: 0": 264369, "autor": "TheCheesebal", "date": 1627980938000, "content": "Spotted an old film-safe bag for flights in a charity shop", "link": "https://www.reddit.com/r/AnalogCommunity/comments/owzg8e/spotted_an_old_filmsafe_bag_for_flights_in_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  an old film-safe bag for flights in a charity shop", "sortedWord": "None", "identifyer": 9943, "year": "2021"}, {"Unnamed: 0": 264399, "autor": "sonom", "date": 1627930346000, "content": "Opinions on Kentmere 400/35mm? /!/ Im in a financial hard spot ATM and started shooting cheap films, Fomapan is....okay 'ish...Agfa APX 100/400 is good value for the price.\n\nBut now I stumbled upon Kentmere 400 for a mere, 4,50€ a roll.\n\nAny opinions on that stock?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/owl4ez/opinions_on_kentmere_40035mm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "opinions on kentmere 400/35mm? /!/ im in a financial hard -----> spot !!!  atm and started shooting cheap films, fomapan is....okay 'ish...agfa apx 100/400 is good value for the price.\n\nbut now i stumbled upon kentmere 400 for a mere, 4,50€ a roll.\n\nany opinions on that stock?", "sortedWord": "None", "identifyer": 9973, "year": "2021"}, {"Unnamed: 0": 264530, "autor": "bugfish03", "date": 1629622163000, "content": "How do I go about reviving an old Canon A-1 and accessories? /!/ So, I recently went through my parents basement, and I found a Canon A-1 along with a few accessories. They all need work to be done on them, although they are still functional. I'll list it as methodically as possible, and I would appreciate your feedback on what to do with them, or how to restore them back to their former glory.\n\nI won't proceed with doing anything until you give the green light for it, as I don't want to do anything wrong.\n\nI live in Germany, in case that matters.\n\n# The find:\n\n* a Canon A-1\n* a Speedlite 199-A flash\n* a 50 mm 1:1.8 Canon FD lens\n* a 28 mm 1:2.8 Canon FD lens\n* a 70 - 210 mm 1:4 FD Zoom lens\n* three of what I assume to be UV filters, one for each lens\n* a 50 mm FD extension tube\n* a 25 mm FD extension tube\n* an assortment of various covers\n\n# The state of things:\n\n**Canon A-1:**  \nThe camera actually works, including the timer function. The battery has not leaked into the battery compartment. The foam on the front and in the gaps of the film chamber has deteriorated and is crumbly. The view through the viewfinder is tinted yellow, and the mirror needs some cleaning. The viewfinder also shows some streaky stuff, which I assume to be some sort of fungus.\n\n**Speedlite 199-A:**  \nThe flash works, although it takes a long time to charge. It also does not have leaked battery juice in its battery compartment. I would think that the slow charging of the flash capacitor can be attributed to either degraded capacitors, or carbon resistors whose value has drifted over the years. Since I assemble electronics as a day job, and I am good at soldering, I feel more than comfortable doing that.\n\n**50 mm lens:**  \nThe movement of the lens is smooth and without any rough spots. No fungus on the inside as far as I can see. The glass looks pretty much clear, although I will check for tint with a spectrophotometer and a calibrated light source I have access to.\n\n**28 mm lens:**  \nSame story here. Smooth movement, maybe a hint of yellow, same as the 50 mm lens.\n\n**70 - 210 mm zoom lens:**  \nThe movement feels smooth, but this lens definitely has fungus growth on the inside of the lens, and a visible yellow tint.\n\n**Filters:**  \nDirty, although I think that I could clean that up with a soft cloth and some glass cleaner.\n\n**Extension tubes:**  \nThey have some degraded foam on them, but nothing crusty, just lose chunks that will easily brush off.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p993ax/how_do_i_go_about_reviving_an_old_canon_a1_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do i go about reviving an old canon a-1 and accessories? /!/ so, i recently went through my parents basement, and i found a canon a-1 along with a few accessories. they all need work to be done on them, although they are still functional. i'll list it as methodically as possible, and i would appreciate your feedback on what to do with them, or how to restore them back to their former glory.\n\ni won't proceed with doing anything until you give the green light for it, as i don't want to do anything wrong.\n\ni live in germany, in case that matters.\n\n# the find:\n\n* a canon a-1\n* a speedlite 199-a flash\n* a 50 mm 1:1.8 canon fd lens\n* a 28 mm 1:2.8 canon fd lens\n* a 70 - 210 mm 1:4 fd zoom lens\n* three of what i assume to be uv filters, one for each lens\n* a 50 mm fd extension tube\n* a 25 mm fd extension tube\n* an assortment of various covers\n\n# the state of things:\n\n**canon a-1:**  \nthe camera actually works, including the timer function. the battery has not leaked into the battery compartment. the foam on the front and in the gaps of the film chamber has deteriorated and is crumbly. the view through the viewfinder is tinted yellow, and the mirror needs some cleaning. the viewfinder also shows some streaky stuff, which i assume to be some sort of fungus.\n\n**speedlite 199-a:**  \nthe flash works, although it takes a long time to charge. it also does not have leaked battery juice in its battery compartment. i would think that the slow charging of the flash capacitor can be attributed to either degraded capacitors, or carbon resistors whose value has drifted over the years. since i assemble electronics as a day job, and i am good at soldering, i feel more than comfortable doing that.\n\n**50 mm lens:**  \nthe movement of the lens is smooth and without any rough -----> spots !!! . no fungus on the inside as far as i can see. the glass looks pretty much clear, although i will check for tint with a spectrophotometer and a calibrated light source i have access to.\n\n**28 mm lens:**  \nsame story here. smooth movement, maybe a hint of yellow, same as the 50 mm lens.\n\n**70 - 210 mm zoom lens:**  \nthe movement feels smooth, but this lens definitely has fungus growth on the inside of the lens, and a visible yellow tint.\n\n**filters:**  \ndirty, although i think that i could clean that up with a soft cloth and some glass cleaner.\n\n**extension tubes:**  \nthey have some degraded foam on them, but nothing crusty, just lose chunks that will easily brush off.", "sortedWord": "None", "identifyer": 10106, "year": "2021"}, {"Unnamed: 0": 264563, "autor": "jnamnom", "date": 1612121553000, "content": "Spots/Specks on film, what am I doing wrong?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l9jwob/spotsspecks_on_film_what_am_i_doing_wrong/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!! /specks on film, what am i doing wrong?", "sortedWord": "None", "identifyer": 10139, "year": "2021"}, {"Unnamed: 0": 264578, "autor": "theswissguywithhair", "date": 1612110103000, "content": "So I \"only\" bought the 40mm lens and a spot meter from this guys on Ebay - this is what all I left with. So exited to put it to use!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l9fkmt/so_i_only_bought_the_40mm_lens_and_a_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "so i \"only\" bought the 40mm lens and a -----> spot !!!  meter from this guys on ebay - this is what all i left with. so exited to put it to use!!", "sortedWord": "None", "identifyer": 10154, "year": "2021"}, {"Unnamed: 0": 264611, "autor": "thenocaster", "date": 1609697557000, "content": "What is that white spot on top of the images? Light leak?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kppihf/what_is_that_white_spot_on_top_of_the_images/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is that white -----> spot !!!  on top of the images? light leak?", "sortedWord": "None", "identifyer": 10189, "year": "2021"}, {"Unnamed: 0": 264629, "autor": "theshapeofalcohol", "date": 1609667889000, "content": "Light spots on the upper left side of the photos... any ideas why it happens?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kpi10j/light_spots_on_the_upper_left_side_of_the_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "light -----> spots !!!  on the upper left side of the photos... any ideas why it happens?", "sortedWord": "None", "identifyer": 10207, "year": "2021"}, {"Unnamed: 0": 264630, "autor": "theshapeofalcohol", "date": 1609667429000, "content": "Light spots on the upper right side of pictures... help me plz!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kphy0b/light_spots_on_the_upper_right_side_of_pictures/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "light -----> spots !!!  on the upper right side of pictures... help me plz!", "sortedWord": "None", "identifyer": 10208, "year": "2021"}, {"Unnamed: 0": 264651, "autor": "charlie_is_a_cat", "date": 1610222777000, "content": "Any ideas what happened here? It's only in the one spot, the rest of the strip is fine. I don't have a ton of experience developing film and haven't seen this happen before, so I'm clueless. Ilford SFX developed with Cinestill Df96 monobath.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ktya20/any_ideas_what_happened_here_its_only_in_the_one/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any ideas what happened here? it's only in the one -----> spot !!! , the rest of the strip is fine. i don't have a ton of experience developing film and haven't seen this happen before, so i'm clueless. ilford sfx developed with cinestill df96 monobath.", "sortedWord": "None", "identifyer": 10230, "year": "2021"}, {"Unnamed: 0": 264722, "autor": "dronedd", "date": 1627047525000, "content": "How do I clean the mirror on an AT-1? /!/ Hi everyone,\n\nCompletely new here and just getting into film photography. I found this Canon AT-1 at the thrift store the other day and was wondering how I should clean the mirror on it?\n\nAs you can see from the images, there some black spots as well as some dust.\nI was planning to just use a cotton swab and some isopropyl alcohol but idk if that’s too intense for the mirror.\n\nAny advice would be amazing! Thanks!\n\nImages: https://imgur.com/a/cHfSWTe", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oq2l7m/how_do_i_clean_the_mirror_on_an_at1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do i clean the mirror on an at-1? /!/ hi everyone,\n\ncompletely new here and just getting into film photography. i found this canon at-1 at the thrift store the other day and was wondering how i should clean the mirror on it?\n\nas you can see from the images, there some black -----> spots !!!  as well as some dust.\ni was planning to just use a cotton swab and some isopropyl alcohol but idk if that’s too intense for the mirror.\n\nany advice would be amazing! thanks!\n\nimages: https://imgur.com/a/chfswte", "sortedWord": "None", "identifyer": 10301, "year": "2021"}, {"Unnamed: 0": 264755, "autor": "eosR6", "date": 1626987878000, "content": "My yashica is out of focus 90% of the times /!/ I have a mat 124g I bought last year, but started using it more often just recently. Basically nothing is in focus, despite seeing the subject absolutely sharp in the glass. When I shoot landscapes, those are the least sharp pictures with everything out of focus. But if I try to do something closer, thats better but still not sharp most of the times. Usually there isnt even any sharp spot on the photo anywhere. Is the camera simply trash and I got scammed, or am I just doing something wrong?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/opn2n8/my_yashica_is_out_of_focus_90_of_the_times/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my yashica is out of focus 90% of the times /!/ i have a mat 124g i bought last year, but started using it more often just recently. basically nothing is in focus, despite seeing the subject absolutely sharp in the glass. when i shoot landscapes, those are the least sharp pictures with everything out of focus. but if i try to do something closer, thats better but still not sharp most of the times. usually there isnt even any sharp -----> spot !!!  on the photo anywhere. is the camera simply trash and i got scammed, or am i just doing something wrong?", "sortedWord": "None", "identifyer": 10335, "year": "2021"}, {"Unnamed: 0": 264809, "autor": "avaya432", "date": 1618530914000, "content": "Using a gray card with a spot meter? /!/ I'm planning on shooting some portraits this weekend but unfortunately my incident meter broke. If I wanted to take a photo of a subject and meter for the shadows, would it make sense to place a gray card in the shadowed area and take a reading using a spot meter from that? I figure since its middle gray it would be more accurate than just pointing the spot meter at their skin. Sorry if this doesn't belong here.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mrr9tm/using_a_gray_card_with_a_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "using a gray card with a -----> spot !!!  meter? /!/ i'm planning on shooting some portraits this weekend but unfortunately my incident meter broke. if i wanted to take a photo of a subject and meter for the shadows, would it make sense to place a gray card in the shadowed area and take a reading using a spot meter from that? i figure since its middle gray it would be more accurate than just pointing the spot meter at their skin. sorry if this doesn't belong here.", "sortedWord": "None", "identifyer": 10391, "year": "2021"}, {"Unnamed: 0": 264830, "autor": "TheRoss0411", "date": 1619984490000, "content": "Strange spots on film, help?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n3e62i/strange_spots_on_film_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "strange -----> spots !!!  on film, help?", "sortedWord": "None", "identifyer": 10412, "year": "2021"}, {"Unnamed: 0": 264878, "autor": "jouse_88", "date": 1625753709000, "content": "Minolta Weathermatic 110? /!/ Hey guys,\n\n&amp;#x200B;\n\nthinking of buying a Minolta Weathermatic 110. Is there something to consider? Is it safe to buy it untested? Found one for 10€ that's been untested for 20 yeras...\n\n&amp;#x200B;\n\nAny \"weak spots\" or experiences? :) Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/og82go/minolta_weathermatic_110/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "minolta weathermatic 110? /!/ hey guys,\n\n&amp;#x200b;\n\nthinking of buying a minolta weathermatic 110. is there something to consider? is it safe to buy it untested? found one for 10€ that's been untested for 20 yeras...\n\n&amp;#x200b;\n\nany \"weak -----> spots !!! \" or experiences? :) thanks!", "sortedWord": "None", "identifyer": 10461, "year": "2021"}, {"Unnamed: 0": 264898, "autor": "ThatGuy_S", "date": 1621187246000, "content": "Went to Half-Price Books to donate 5 boxes of books and of course had to go browse the photography section. 5 boxes out, 1 box in, ah well. Made a comfy spot on the couch and have been reading for hours. Nice for a shitty rainy Sunday.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ndtnnm/went_to_halfprice_books_to_donate_5_boxes_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "went to half-price books to donate 5 boxes of books and of course had to go browse the photography section. 5 boxes out, 1 box in, ah well. made a comfy -----> spot !!!  on the couch and have been reading for hours. nice for a shitty rainy sunday.", "sortedWord": "None", "identifyer": 10481, "year": "2021"}, {"Unnamed: 0": 264934, "autor": "n_faves", "date": 1626569423000, "content": "Fellow Chicagoans /!/ Not sure if this the spot for this, but I recently started my film journey this past April. Would love to meet others in the city that shoot film and maybe do group photowalks, etc.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/omgewf/fellow_chicagoans/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fellow chicagoans /!/ not sure if this the -----> spot !!!  for this, but i recently started my film journey this past april. would love to meet others in the city that shoot film and maybe do group photowalks, etc.", "sortedWord": "None", "identifyer": 10517, "year": "2021"}, {"Unnamed: 0": 264977, "autor": "Thatoneguy_420", "date": 1626481086000, "content": "Spotted in \"My Cousin Vinny\"", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oltkb2/spotted_in_my_cousin_vinny/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  in \"my cousin vinny\"", "sortedWord": "None", "identifyer": 10561, "year": "2021"}, {"Unnamed: 0": 264985, "autor": "oreocereus", "date": 1626469684000, "content": "What models of spot meter to look out for? /!/ I'm looking for a second hand spot meter, as I have switched to an older camera without built in metering (had a late 90s nikon which metered pretty well).  \n\n\nI don't do any studio work, and mostly do landscape stuff while hiking or cycling, so a spot meter seems the way to go. Some emphasis on portability would be good, too.  \n\n\nI'm a little overwhelmed by all the options - and price. I like the idea of going with an analog meter (not dealing with batteries and I obviously have a penchant for analog tools), but not strictly opposed to digital meters.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/olq32b/what_models_of_spot_meter_to_look_out_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what models of -----> spot !!!  meter to look out for? /!/ i'm looking for a second hand spot meter, as i have switched to an older camera without built in metering (had a late 90s nikon which metered pretty well).  \n\n\ni don't do any studio work, and mostly do landscape stuff while hiking or cycling, so a spot meter seems the way to go. some emphasis on portability would be good, too.  \n\n\ni'm a little overwhelmed by all the options - and price. i like the idea of going with an analog meter (not dealing with batteries and i obviously have a penchant for analog tools), but not strictly opposed to digital meters.", "sortedWord": "None", "identifyer": 10569, "year": "2021"}, {"Unnamed: 0": 264992, "autor": "_cool_kid", "date": 1626458420000, "content": "Strange spots on film developed at home. Any idea what would cause these?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/olma3z/strange_spots_on_film_developed_at_home_any_idea/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "strange -----> spots !!!  on film developed at home. any idea what would cause these?", "sortedWord": "None", "identifyer": 10576, "year": "2021"}, {"Unnamed: 0": 265037, "autor": "SumFon4", "date": 1619055878000, "content": "Spotting generic brand P&amp;S cameras /!/ Relatively new to this space, but I fell in love with look of the grainy, unfocused shots taken for thousands of artists. \n\n\nWith that I jumped in head first looking at the top results for cheap cameras that hold value- with the portability and durability of a disposable.\n\nThis lead to me to a couple options.\n\n-\tThe MANUAL PHOTO camera \n-\tIlford Sprite-ii 35mm\n\nThen I realized, these two are effectively the same generic camera with small cosmetic differences (logo, and removing the lens off the viewfinder)\n\nI can’t be the only the to be fooled by this, with marketing being so sneaky these days on Tik Tok and other sites I really thought I was investing in something of value.\n\nSo my question is, after seeing all these companies using the same Alibaba generic reusable, what other P&amp;S are there that hit the grainy, disposable, and “cheap” look that’s so popular? The cost of the  Ilford is $35 which is great. EBay sells WAY too many type of cameras that makes it feel like a minefield.\n\nAny pointers on what to look for?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mvumjk/spotting_generic_brand_ps_cameras/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "-----> spotting !!!  generic brand p&amp;s cameras /!/ relatively new to this space, but i fell in love with look of the grainy, unfocused shots taken for thousands of artists. \n\n\nwith that i jumped in head first looking at the top results for cheap cameras that hold value- with the portability and durability of a disposable.\n\nthis lead to me to a couple options.\n\n-\tthe manual photo camera \n-\tilford sprite-ii 35mm\n\nthen i realized, these two are effectively the same generic camera with small cosmetic differences (logo, and removing the lens off the viewfinder)\n\ni can’t be the only the to be fooled by this, with marketing being so sneaky these days on tik tok and other sites i really thought i was investing in something of value.\n\nso my question is, after seeing all these companies using the same alibaba generic reusable, what other p&amp;s are there that hit the grainy, disposable, and “cheap” look that’s so popular? the cost of the  ilford is $35 which is great. ebay sells way too many type of cameras that makes it feel like a minefield.\n\nany pointers on what to look for?", "sortedWord": "None", "identifyer": 10622, "year": "2021"}, {"Unnamed: 0": 265129, "autor": "Sunshine6613", "date": 1625243354000, "content": "How do I clean inside camera /!/ I just got a Nikon em from eBay but when I look through the viewer there were all these black spots and I was wondering how to clean it lots of dust and debris when I took the lens off too.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ocdp1e/how_do_i_clean_inside_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do i clean inside camera /!/ i just got a nikon em from ebay but when i look through the viewer there were all these black -----> spots !!!  and i was wondering how to clean it lots of dust and debris when i took the lens off too.", "sortedWord": "None", "identifyer": 10714, "year": "2021"}, {"Unnamed: 0": 265144, "autor": "jxhxnnxs", "date": 1625232783000, "content": "Weird spots on pictures - Lab's fault? (Zorki 3M, Jupiter 8)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oca6qf/weird_spots_on_pictures_labs_fault_zorki_3m/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird -----> spots !!!  on pictures - lab's fault? (zorki 3m, jupiter 8)", "sortedWord": "None", "identifyer": 10729, "year": "2021"}, {"Unnamed: 0": 265149, "autor": "pogof", "date": 1625221343000, "content": "Blank spots on negatives /!/ Tl;Dr: Fomapan 400 respooled by hand to 620 spool, shot in Kodak Junior 620 and developed by me in Fomadon LQN, water stop bath, Fomafix, Kodak photo-flo at about 20C and the manufacturer recommended times (all steps in tap water). There are random blank spots what could have caused that?\n\n[https://imgur.com/a/ogwdNZz](https://imgur.com/a/ogwdNZz)\n\nHello! I recently found a small lot of analog cameras and wanted to try some analog photography.  One of the cameras is Kodak junior 620. Bought some 620 spools and I think successfully (?) respooled few Fomapan 400 120 films in a changing bag. Apart from mishaps like not rewinding or changing settings they look decent. However after developing them I noticed on a lot of them spots where the emulsion is missing. I don't think its the \"lens\" fault because the are scattered randomly. I agitated maybe a bit too vigorously? Or is the problem somewhere else? Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oc78qr/blank_spots_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "blank -----> spots !!!  on negatives /!/ tl;dr: fomapan 400 respooled by hand to 620 spool, shot in kodak junior 620 and developed by me in fomadon lqn, water stop bath, fomafix, kodak photo-flo at about 20c and the manufacturer recommended times (all steps in tap water). there are random blank spots what could have caused that?\n\n[https://imgur.com/a/ogwdnzz](https://imgur.com/a/ogwdnzz)\n\nhello! i recently found a small lot of analog cameras and wanted to try some analog photography.  one of the cameras is kodak junior 620. bought some 620 spools and i think successfully (?) respooled few fomapan 400 120 films in a changing bag. apart from mishaps like not rewinding or changing settings they look decent. however after developing them i noticed on a lot of them spots where the emulsion is missing. i don't think its the \"lens\" fault because the are scattered randomly. i agitated maybe a bit too vigorously? or is the problem somewhere else? thank you!", "sortedWord": "None", "identifyer": 10734, "year": "2021"}, {"Unnamed: 0": 265224, "autor": "ymcfar", "date": 1611251169000, "content": "Has anyone been able to solve getting out these types of spots on the negative? (More details in comments)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l23i8w/has_anyone_been_able_to_solve_getting_out_these/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "has anyone been able to solve getting out these types of -----> spots !!!  on the negative? (more details in comments)", "sortedWord": "None", "identifyer": 10812, "year": "2021"}, {"Unnamed: 0": 265244, "autor": "matias7anriquez", "date": 1620582677000, "content": "Help me locate stores in NYC? /!/ Visiting the city next month, and wanted to know the best spots to catch some film and maybe shop for some cameras, I'm aware of Brooklyn Film Camera, anything else you guys would recommend?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n8jg3b/help_me_locate_stores_in_nyc/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help me locate stores in nyc? /!/ visiting the city next month, and wanted to know the best -----> spots !!!  to catch some film and maybe shop for some cameras, i'm aware of brooklyn film camera, anything else you guys would recommend?", "sortedWord": "None", "identifyer": 10832, "year": "2021"}], "name": "spotAnalogCommunity2021"}