{"interestingcomments": [{"Unnamed: 0": 306891, "autor": "Bert_dazz12", "date": 1596460469000, "content": "Yikes, that price tag....", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i2wt9t/yikes_that_price_tag/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "yikes, that price -----> tag !!! ....", "sortedWord": "None", "identifyer": 53846, "year": "2020"}, {"Unnamed: 0": 306935, "autor": "jorshhh", "date": 1596335585000, "content": "Would you be interested in a Lightroom kind of app to backup your photos on the cloud using Google Photos unlimited storage? /!/ I was thinking on doing this project for myself but I think it could be useful for more people. It would be open source and completely free.\n\nMy idea is making an app where I can group my pictures by rolls of film and back them up using google photos. It would upload them there and would be available to see via the app with some tags/filters and easily shared via google photos albums.\n\n[View Poll](https://www.reddit.com/poll/i24pil)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i24pil/would_you_be_interested_in_a_lightroom_kind_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "would you be interested in a lightroom kind of app to backup your photos on the cloud using google photos unlimited storage? /!/ i was thinking on doing this project for myself but i think it could be useful for more people. it would be open source and completely free.\n\nmy idea is making an app where i can group my pictures by rolls of film and back them up using google photos. it would upload them there and would be available to see via the app with some -----> tags !!! /filters and easily shared via google photos albums.\n\n[view poll](https://www.reddit.com/poll/i24pil)", "sortedWord": "None", "identifyer": 53890, "year": "2020"}, {"Unnamed: 0": 307417, "autor": "lifeincoolcolours", "date": 1582820954000, "content": "(Rant) The analog photography community on Instagram is a goddamn shit show. It is elitist, popularity-centric and claims to contribute to showcasing all sort of work when really, all it does is promote the inner circle. /!/ The title is the perfect TL;DR version for this post. I’m a film photographer in my spare time, working mostly on 35mm and occasionally on 120mm, and I’ve been using Instagram for the past two years as a way to share my work but also connect with other photographers, get to know new work, and find some kind of way to fight the loneliness I feel everyday as a struggling artist.\n\nAs an artist, I’ve struggled to get my work shown anywhere (as a writer, photographer, filmmaker). I’m just not successful, though I work hard towards my work everyday. And I used to see Instagram and other platforms of the kind as democratic places where suddenly everyone can have their own little space, their own little voice. But no, not at all, what was I thinking? It’s all a fucking popularity contest.\n\nThe community there is so incredibly nepotist and elitist. All the “curated pages”, the “tag us for a chance at getting featured”, yet then the only people that get featured anywhere are their friends who surprise surprise all have over 5k worth of followers (and usually much more than that). The Instagram algorithms also don’t help, and a lot of brilliant photographers I know get lost in a sea of mini-analog-celebs taking over the goddamn app.\n\nI give up. I give up on trying to get my work seen, on trying to get constructive criticism on my work, on trying to build a good network of artist friends. It’s all a fucking shitshow, and I’m going back to doing analog photography the way it’s supposed to be done: in the darkroom, by myself.\n\n/rant, drop the mic", "link": "https://www.reddit.com/r/AnalogCommunity/comments/faemo9/rant_the_analog_photography_community_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "(rant) the analog photography community on instagram is a goddamn shit show. it is elitist, popularity-centric and claims to contribute to showcasing all sort of work when really, all it does is promote the inner circle. /!/ the title is the perfect tl;dr version for this post. i’m a film photographer in my spare time, working mostly on 35mm and occasionally on 120mm, and i’ve been using instagram for the past two years as a way to share my work but also connect with other photographers, get to know new work, and find some kind of way to fight the loneliness i feel everyday as a struggling artist.\n\nas an artist, i’ve struggled to get my work shown anywhere (as a writer, photographer, filmmaker). i’m just not successful, though i work hard towards my work everyday. and i used to see instagram and other platforms of the kind as democratic places where suddenly everyone can have their own little space, their own little voice. but no, not at all, what was i thinking? it’s all a fucking popularity contest.\n\nthe community there is so incredibly nepotist and elitist. all the “curated pages”, the “-----> tag !!!  us for a chance at getting featured”, yet then the only people that get featured anywhere are their friends who surprise surprise all have over 5k worth of followers (and usually much more than that). the instagram algorithms also don’t help, and a lot of brilliant photographers i know get lost in a sea of mini-analog-celebs taking over the goddamn app.\n\ni give up. i give up on trying to get my work seen, on trying to get constructive criticism on my work, on trying to build a good network of artist friends. it’s all a fucking shitshow, and i’m going back to doing analog photography the way it’s supposed to be done: in the darkroom, by myself.\n\n/rant, drop the mic", "sortedWord": "None", "identifyer": 54386, "year": "2020"}, {"Unnamed: 0": 308015, "autor": "benjahphotography", "date": 1609001509000, "content": "Girlfriend &amp; Neighbor (78 y/o retired photographer) tag teamed my Xmas Gift", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kklkwx/girlfriend_neighbor_78_yo_retired_photographer/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "girlfriend &amp; neighbor (78 y/o retired photographer) -----> tag !!!  teamed my xmas gift", "sortedWord": "None", "identifyer": 54990, "year": "2020"}, {"Unnamed: 0": 309779, "autor": "guessimfine", "date": 1601454371000, "content": "[UPDATE] Filmtober is happening! Who feels like a challenge? /!/ Hey team! \n\nAfter thinking through the idea in a few other posts here, Filmtober is now officially happening. It's a celebration of film photography, and a challenge to get out there and take more photos during October, inspired by Inktober. \n\nI'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **Take and post a photo every day —** Take a photo every day during October, and post a photo taken during the last 2 weeks. That means during the first half of October you can use photos you took in September. *Half marathon option:* Take and post a photo every 2nd day, using photos from the last month.\n* **Tag and share —** Obviously you can post them here, but if you're posting to IG or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. Same rules as r/analog apply, include your film, camera, etc when posting. *Bonus points:* Use the #filmtober\\_photo hashtag and I'll pull in and feature your submission on the website.\n* **Use themes for inspo —** I've come up with some weekly(ish) themes for inspiration, outlined below. Don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge\n\nAnd there's only one rule — photos must be taken on film. All formats are fair game, as long as it's analog.\n\n**Themes**\n\n* Light (1st - 11th Oct)\n* People (12th - 18th Oct)\n* Minimalism (19th - 25th Oct)\n* Open theme (26th - 31st Oct)\n\nThat's it! Let me know what you think, and if you're keen to play along. Obviously this is extremely late notice, but hey it's never too late to take on a creative challenge. I'll definitely be doing it in any case.\n\nI'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200B;\n\n[Upcoming Filmtober website](https://preview.redd.it/r900mgoyv8q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=2195e2b6c85257c8c8dd7a547392685624f0b528)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j2iai7/update_filmtober_is_happening_who_feels_like_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "[update] filmtober is happening! who feels like a challenge? /!/ hey team! \n\nafter thinking through the idea in a few other posts here, filmtober is now officially happening. it's a celebration of film photography, and a challenge to get out there and take more photos during october, inspired by inktober. \n\ni'm working on a website for it now (sneak peek below), but it's pretty straightforward:\n\n* **take and post a photo every day —** take a photo every day during october, and post a photo taken during the last 2 weeks. that means during the first half of october you can use photos you took in september. *half marathon option:* take and post a photo every 2nd day, using photos from the last month.\n* **-----> tag !!!  and share —** obviously you can post them here, but if you're posting to ig or elsewhere use the #filmtober and #filmtober2020 hashtags so we can follow along. same rules as r/analog apply, include your film, camera, etc when posting. *bonus points:* use the #filmtober\\_photo hashtag and i'll pull in and feature your submission on the website.\n* **use themes for inspo —** i've come up with some weekly(ish) themes for inspiration, outlined below. don't feel like you *have to* stick to them, they're just creative constraints for an extra challenge\n\nand there's only one rule — photos must be taken on film. all formats are fair game, as long as it's analog.\n\n**themes**\n\n* light (1st - 11th oct)\n* people (12th - 18th oct)\n* minimalism (19th - 25th oct)\n* open theme (26th - 31st oct)\n\nthat's it! let me know what you think, and if you're keen to play along. obviously this is extremely late notice, but hey it's never too late to take on a creative challenge. i'll definitely be doing it in any case.\n\ni'll hopefully have the website etc up by tomorrow, for now, a sneak peek:\n\n&amp;#x200b;\n\n[upcoming filmtober website](https://preview.redd.it/r900mgoyv8q51.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=2195e2b6c85257c8c8dd7a547392685624f0b528)", "sortedWord": "None", "identifyer": 56783, "year": "2020"}, {"Unnamed: 0": 310349, "autor": "dgmab", "date": 1597860578000, "content": "Best compact 35mm camera? /!/ Been trying to look for compact 35mm as an everyday carry but I’m not sure which one to get. I have been eyeing the Rollei 35 lately as I heard its small but doesnt compromise quality (but it also has a pretty hefty price tag). Any other suggestions?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/icsyiu/best_compact_35mm_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best compact 35mm camera? /!/ been trying to look for compact 35mm as an everyday carry but i’m not sure which one to get. i have been eyeing the rollei 35 lately as i heard its small but doesnt compromise quality (but it also has a pretty hefty price -----> tag !!! ). any other suggestions?", "sortedWord": "None", "identifyer": 57361, "year": "2020"}, {"Unnamed: 0": 310987, "autor": "hxcvc", "date": 1578878480000, "content": "Compact Point and Shoot that actually can fit in my pocket? /!/ Any suggestions on a point and shoot that is actually pocketable, like an MJUii but without the price tag? Would like a quick and sharp lens suited for travel and street photography. \n\ncurrently own a Nikon L35af in the point and shoot category but its far too big and chunky.\n\ncheers", "link": "https://www.reddit.com/r/AnalogCommunity/comments/enwwvc/compact_point_and_shoot_that_actually_can_fit_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "compact point and shoot that actually can fit in my pocket? /!/ any suggestions on a point and shoot that is actually pocketable, like an mjuii but without the price -----> tag !!! ? would like a quick and sharp lens suited for travel and street photography. \n\ncurrently own a nikon l35af in the point and shoot category but its far too big and chunky.\n\ncheers", "sortedWord": "None", "identifyer": 58009, "year": "2020"}, {"Unnamed: 0": 313490, "autor": "TheNightSquatch", "date": 1605475981000, "content": "Opinions needed. Fuji GF670 vs Makina 670 /!/ So, I’m in the market for a lightweight, portable MF (6x6 or 6x7) camera for travel/street work. I’ve somewhat narrowed it down to either the Fuji GF670 or the Makina 670. They are both in the same ballpark for price.\n\nI considered the mamiya 7, but the price tag plus the RF alignment issues I’ve read about, swayed me away(even though I’ve wanted one forever)\n\nWhich would you choose and why?\n\nI feel like optically the Makina has more character, while the GF670 is sharper and more clinical looking.\n\nEdit: Just wanted to say thanks for all the reply’s and help. Really appreciate it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/juu0do/opinions_needed_fuji_gf670_vs_makina_670/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "opinions needed. fuji gf670 vs makina 670 /!/ so, i’m in the market for a lightweight, portable mf (6x6 or 6x7) camera for travel/street work. i’ve somewhat narrowed it down to either the fuji gf670 or the makina 670. they are both in the same ballpark for price.\n\ni considered the mamiya 7, but the price -----> tag !!!  plus the rf alignment issues i’ve read about, swayed me away(even though i’ve wanted one forever)\n\nwhich would you choose and why?\n\ni feel like optically the makina has more character, while the gf670 is sharper and more clinical looking.\n\nedit: just wanted to say thanks for all the reply’s and help. really appreciate it.", "sortedWord": "None", "identifyer": 60564, "year": "2020"}, {"Unnamed: 0": 313829, "autor": "logan_zewizzle", "date": 1592088583000, "content": "Found this bad boy at a Goodwill with no tag, best $3 I’ve ever spent", "link": "https://www.reddit.com/r/AnalogCommunity/comments/h8hrma/found_this_bad_boy_at_a_goodwill_with_no_tag_best/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "found this bad boy at a goodwill with no -----> tag !!! , best $3 i’ve ever spent", "sortedWord": "None", "identifyer": 60907, "year": "2020"}, {"Unnamed: 0": 314044, "autor": "augustbutnotthemonth", "date": 1597515998000, "content": "ricoh mirai 105 camera for free! price tag was still on it, it was $600 in ‘89. everything seems to be working fine but i’ll have to buy new batteries to be sure", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iacl7y/ricoh_mirai_105_camera_for_free_price_tag_was/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "ricoh mirai 105 camera for free! price -----> tag !!!  was still on it, it was $600 in ‘89. everything seems to be working fine but i’ll have to buy new batteries to be sure", "sortedWord": "None", "identifyer": 61124, "year": "2020"}, {"Unnamed: 0": 314075, "autor": "AkatherineGu", "date": 1597437369000, "content": "Please cry with me /!/ I wanted to share a moment I had while backpacking in the Dinosaur National Monument because I know we’ve all experienced this.\n\nIt was a few weeks ago when I went on a five mile hike into a canyon with my Yashica D. I take this cutie everywhere and have been shooting for years with it. It was well over 100 degrees on this hike. By the time I arrived to the end of the hike I managed to take an entire roll. Having an extra roll on me I decided to sit down and change it. In the camera was a roll of Reala by Fujifilm, first time using this film. Anyways, I take the roll out and instantly notice how swallow my fingers were from the heat. It was about that moment that I’m pulling the sticker tag back to close it.....and out of no where I lose my grip.....and the roll just....rolls out of my swallow fingers, unravels and falls in the river. The second I saw that film in daylight I knew it was over, just like that all 12 shots were gone. Never to be seen. \n\nI’ve never ever dropped a roll and I was so heart broken. But then again that is the beauty of film. Whatever was on that roll wasn’t meant to be processed and saved. The next time or maybe even the first time this happens to you remember it’s happened to us all in the analog community.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i9trsa/please_cry_with_me/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "please cry with me /!/ i wanted to share a moment i had while backpacking in the dinosaur national monument because i know we’ve all experienced this.\n\nit was a few weeks ago when i went on a five mile hike into a canyon with my yashica d. i take this cutie everywhere and have been shooting for years with it. it was well over 100 degrees on this hike. by the time i arrived to the end of the hike i managed to take an entire roll. having an extra roll on me i decided to sit down and change it. in the camera was a roll of reala by fujifilm, first time using this film. anyways, i take the roll out and instantly notice how swallow my fingers were from the heat. it was about that moment that i’m pulling the sticker -----> tag !!!  back to close it.....and out of no where i lose my grip.....and the roll just....rolls out of my swallow fingers, unravels and falls in the river. the second i saw that film in daylight i knew it was over, just like that all 12 shots were gone. never to be seen. \n\ni’ve never ever dropped a roll and i was so heart broken. but then again that is the beauty of film. whatever was on that roll wasn’t meant to be processed and saved. the next time or maybe even the first time this happens to you remember it’s happened to us all in the analog community.", "sortedWord": "None", "identifyer": 61155, "year": "2020"}, {"Unnamed: 0": 314853, "autor": "akbanx", "date": 1589201405000, "content": "A Guide to Film Photography Feature Accounts on Instagram /!/ This list is in no way meant to be exhaustive, as that would be impossible, but for those of you who are starting out with film photography and wondering how to share your work, there are a number of accounts that have their own hashtags, and mostly feature photos that are tagged with those hashtags. There are so many of these accounts that it’s sometimes hard to tell them apart, so part of why I wanted to write this is to help demystify their differences. \n\nSome of these accounts are legitimate print outlets, though some of them just exist on Instagram. Some of them – particularly the larger accounts – may not rely on hashtags for discovering work at all, even though it seems like they do. Your mileage may vary, and to be honest, it’s sometimes a popularity contest, especially with accounts that have more than 200k followers. But other photographers may follow these hashtags and discover your work as a result. \n\nThere’s a lot of crossover with these accounts. You’ll see certain photos and photographers that are featured on multiple accounts, which is I guess the film photography version of going viral. You know the kind of photos I’m talking about – the kind that are peppered throughout Instagram’s “explore” section, or the ones that hit the top of r/analog. The kind that win contests. The ones that make you wish that you too were a master of nailing exposure and stumbling across (or creating) scenes that take your breath away.\n\nAnyways, here’s a rough guide to curated feature accounts, sorted by the size of their follower-base. Instagram pages are linked. As a disclaimer, I think that curation is more important than popularity, and some of the smaller ones are run by people who are more involved in the analog community. Most of them are focused on film photography, but they’re not all exclusively analog. Some featured photos just have a film “vibe” or aesthetic, which may annoy some people here. Lastly, these are just my opinions. This is a subjective guide. I'm not an expert -- I'm just a fan. \n\nOne thing I want to say is that you should **NEVER PAY FOR FEATURES**. I know it's tempting, everybody wants to get their work seen, but these accounts are popular because of other people's work. If anything, they should pay YOU for the use of your photography. I haven't mentioned certain accounts here because of this. \n\nAnyways...\n\n**\\~ \\~ A LIST OF FILM PHOTOGRAPHY FEATURE ACCOUNTS \\~ \\~**\n\n[**Somewhere Magazine**](https://www.instagram.com/somewheremagazine/) **(#somewheremagazine) (861k followers)**\n\nSomewhere Magazine is one of the larger accounts out there. There’s a nice mixture of cinematic scenes and more abstract lens-based art on this page, and it lives up to its claim of being a “mood board”.\n\n[**Film Wave**](https://www.instagram.com/film.wave/) **(#filmwave) (275k)** \n\nThis account has a tendency to post photos that are in some ways related to the act of analog photography in a meta kind of way. You’ll find analog self portraits, photos of cameras, etc. on here. There’s obviously more to their curation than that, as it is a large account with a large fanbase, but if you have a beautifully shot gear pic, this might be the account for you to tag. \n\n[**Nowhere Diary**](https://www.instagram.com/nowherediary/) **(#nowherediary) (257k)**\n\nLots of night scenes and foggy, moody photography. Lots of beautiful, empty scenes with no people in them, though some photos do feature people. What I like about this account is their tendency to pair some of their posts with lengthy written blurbs about photography. They have a series of Nowhere Diary Legend posts where they introduce their audience to famous photographers, which is a cool way to find out about significant photographers if you’re new to photography and/or less plugged in to the historical side of things. \n\n[**Film Photographic**](https://www.instagram.com/filmphotographic/) **(#filmphotographic) (204k)**\n\nOne of the founders and curators is Jason Lee, which is cool. Also a gallery and book publisher. There’s an emphasis on more rural scenes here and landscapes. Many of the photos are people-less, which I like. I’m not sure how active it is, but it’s maybe worth checking out.\n\n[**If You Leave**](https://www.instagram.com/ifyouleavestagram/) **(#ifyouleave) (152k)**\n\nBig M O O D. Cinematic pics out the wazoo. Even the name is dramatic. This account has been around since 2009, before certain film cameras started costing more than cars. I like their curation.\n\n[**Film Photo Mag**](https://www.instagram.com/filmphotomag/) **(#filmphotomag) (137k)** \n\nThere seems to be an emphasis on grainy photos on this page, some of which are underexposed (but who cares!). Moody stuff. Lots of cities, lots of silhouettes. That kind of thing. \n\n[**Tainted Magazine**](https://www.instagram.com/taintedmag/) **(#taintedmag) (9k)**\n\nLots of fine art portraiture, sometimes of famous people. The curation seems to favor innovative poses and composition that wouldn’t be out of place in a fancy MFA program. Think Ryan McGinley, or someone whose work is more abstract than that. The photos here look like they could be in NY Mag or the NYT magazine. Or a museum, really. \n\n[**Film Shooters Collective**](https://www.instagram.com/filmshooterscollective/) **(#heyfsc) (80k)** \n\nThis account has been around for quite some time, and you’ll notice that some of their curation highlights photos that embrace the imperfections of film. By this, I mean photos shot on expired film, or photos with light leaks. If you like double exposures, this might be a good hashtag for you to use. \n\n[**Photo Filmy**](https://www.instagram.com/photo.filmy/) **(#photofilmy) (74k)**\n\nThere tends to be a focus on geometrically-pleasing images here. Lots of beautiful old buildings, some Americana-influenced stuff. There’s an interesting mix of curation here, and a number of the photos are densely layered. \n\n[**Ain't–Bad**](https://www.instagram.com/aintbad/)  **(#aintbad)  (70k)** \n\nThis is less of a feature account and more of a real-assed magazine/publisher. There’s more of an emphasis here on body of work (photo essays, photo books) than singles, which I really like because a cohesive body of work is what eventually sets you apart from the kind of photographers who just take pretty pictures. \n\n*NOTE: I found out after writing this that there are some* ***serious underlying issues with Ain’t Bad****, which you can find out about on Instagram. Notably, they have failed to support people of color and lack diversity in their programming. There are also accusations of sexual assault that have been brought up against people involved with Ain’t Bad. It’s* ***really*** *disappointing and disheartening to read about because I’ve found some great photographers through their site. Consider not using this hashtag.* \n\n[**Back 2 the Base**](https://www.instagram.com/back2thebase/) **(#back2thebase) (44k)** \n\nA mixture of Ian Howorth-esque emptiness, portraiture, and street photography. Quite artsy. I like their logo. \n\n[**Drive By Film**](https://www.instagram.com/drivebyfilm/) **(#drivebyfilm) (31k)** \n\nSpoiler alert: there are a lot of beautiful cars on this account’s page, along with some gas stations, and a little bit of night work. It seems to be very focused on American scenes, though to be fair, so are many other accounts. \n\n[**Restore from Backup**](https://www.instagram.com/restorefrombackup/) **(#restorefrombackup) (31k)** \n\nI’m biased in my love for this account because they’ve shared my photography on multiple occasions (and more than other feature accounts have), but they place a really high value on community-building, and in that way it’s like a mixture of r/analog and r/analogcommunity. From what I can tell it’s run by good people who don’t have a superiority complex about photography. They also do a nice job of showcasing work from smaller accounts. \n\n[**Burbs on Film**](https://www.instagram.com/burbsonfilm/) **(#burbsonfilm) (26k)**\n\nThere are plenty of photos of suburbs on this page, but they’re not exclusively shot in suburban settings. A number of these photographs subvert traditional stereotypes of the United States, though some are pretty straightforward in their scope. Lots of these photos feel like they’re from another era.\n\n[**Make Me See Mag**](https://www.instagram.com/makemeseemag/) **(#makemeseemag) (24k)** \n\nWhat I’ve noticed with the photos that this account features is that they mostly feature photographs that have a dynamic subject that your eye zeroes in on immediately. There’s a little bit of flash photography thrown into the mix, which is nice. The curation is pretty varied and some of the photos are shot in quite innovative ways. It’s a great account that deserves a larger following. \n\n[**The Film Stead**](https://www.instagram.com/thefilmstead/) **(#thefilmstead) (11k)** \n\nSoothing, beautiful photography with a focus on architecture and landscapes. In a world where so many photographs are moody and dark, it’s nice to see photos that have a happier, more positive vibe.\n\n\\-----\n\n**Accounts with less than 10k followers that might be worth your time:** \n\n[**Every Day Rural America**](https://www.instagram.com/everydayruralamerica/) **(#everydayruralamerica) (6k)**\n\n[**Rural Exposures**](https://www.instagram.com/ruralexposures/) **(#ruralexposures) (6k)**\n\n[**The Film Renaissance**](https://www.instagram.com/thefilmrenaissance/) **(#thefilmrenaissance) (5k)**\n\n[**Film Leaders**](https://www.instagram.com/filmleaders/) **(#filmleaders) (4k)**\n\n[**Observation Magazine**](https://www.instagram.com/observationmag/) **(#observationmag) (3k)**\n\n[**Seasoned Film**](https://www.instagram.com/seasonedfilm/) **(#seasonedfilm) (2k)** \n\n[**Analog Drive**](https://www.instagram.com/analogdrive/) **(#analogdrivemag) (1.5k)**\n\nFeel free to post more accounts that you like in the comments, or share your thoughts on these accounts.\n\nFull disclosure: I am not involved with running any of these accounts. I’m just a person who loves photography of all kinds, and wanted to share my thoughts on feature accounts with new (or more established) photographers. \n\nSome of them have featured my work, but this hasn’t really factored into this list. I did run my thoughts by some fellow members of the film photography community, who have been immensely helpful in giving me more information about some of these accounts, which sometimes feel like they’re shrouded in secrecy. \n\nAnyways, thanks for reading. I love r/analogcommunity and I hope this helps somebody out.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ghmxxr/a_guide_to_film_photography_feature_accounts_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "a guide to film photography feature accounts on instagram /!/ this list is in no way meant to be exhaustive, as that would be impossible, but for those of you who are starting out with film photography and wondering how to share your work, there are a number of accounts that have their own hashtags, and mostly feature photos that are -----> tagged !!!  with those hashtags. there are so many of these accounts that it’s sometimes hard to tell them apart, so part of why i wanted to write this is to help demystify their differences. \n\nsome of these accounts are legitimate print outlets, though some of them just exist on instagram. some of them – particularly the larger accounts – may not rely on hashtags for discovering work at all, even though it seems like they do. your mileage may vary, and to be honest, it’s sometimes a popularity contest, especially with accounts that have more than 200k followers. but other photographers may follow these hashtags and discover your work as a result. \n\nthere’s a lot of crossover with these accounts. you’ll see certain photos and photographers that are featured on multiple accounts, which is i guess the film photography version of going viral. you know the kind of photos i’m talking about – the kind that are peppered throughout instagram’s “explore” section, or the ones that hit the top of r/analog. the kind that win contests. the ones that make you wish that you too were a master of nailing exposure and stumbling across (or creating) scenes that take your breath away.\n\nanyways, here’s a rough guide to curated feature accounts, sorted by the size of their follower-base. instagram pages are linked. as a disclaimer, i think that curation is more important than popularity, and some of the smaller ones are run by people who are more involved in the analog community. most of them are focused on film photography, but they’re not all exclusively analog. some featured photos just have a film “vibe” or aesthetic, which may annoy some people here. lastly, these are just my opinions. this is a subjective guide. i'm not an expert -- i'm just a fan. \n\none thing i want to say is that you should **never pay for features**. i know it's tempting, everybody wants to get their work seen, but these accounts are popular because of other people's work. if anything, they should pay you for the use of your photography. i haven't mentioned certain accounts here because of this. \n\nanyways...\n\n**\\~ \\~ a list of film photography feature accounts \\~ \\~**\n\n[**somewhere magazine**](https://www.instagram.com/somewheremagazine/) **(#somewheremagazine) (861k followers)**\n\nsomewhere magazine is one of the larger accounts out there. there’s a nice mixture of cinematic scenes and more abstract lens-based art on this page, and it lives up to its claim of being a “mood board”.\n\n[**film wave**](https://www.instagram.com/film.wave/) **(#filmwave) (275k)** \n\nthis account has a tendency to post photos that are in some ways related to the act of analog photography in a meta kind of way. you’ll find analog self portraits, photos of cameras, etc. on here. there’s obviously more to their curation than that, as it is a large account with a large fanbase, but if you have a beautifully shot gear pic, this might be the account for you to tag. \n\n[**nowhere diary**](https://www.instagram.com/nowherediary/) **(#nowherediary) (257k)**\n\nlots of night scenes and foggy, moody photography. lots of beautiful, empty scenes with no people in them, though some photos do feature people. what i like about this account is their tendency to pair some of their posts with lengthy written blurbs about photography. they have a series of nowhere diary legend posts where they introduce their audience to famous photographers, which is a cool way to find out about significant photographers if you’re new to photography and/or less plugged in to the historical side of things. \n\n[**film photographic**](https://www.instagram.com/filmphotographic/) **(#filmphotographic) (204k)**\n\none of the founders and curators is jason lee, which is cool. also a gallery and book publisher. there’s an emphasis on more rural scenes here and landscapes. many of the photos are people-less, which i like. i’m not sure how active it is, but it’s maybe worth checking out.\n\n[**if you leave**](https://www.instagram.com/ifyouleavestagram/) **(#ifyouleave) (152k)**\n\nbig m o o d. cinematic pics out the wazoo. even the name is dramatic. this account has been around since 2009, before certain film cameras started costing more than cars. i like their curation.\n\n[**film photo mag**](https://www.instagram.com/filmphotomag/) **(#filmphotomag) (137k)** \n\nthere seems to be an emphasis on grainy photos on this page, some of which are underexposed (but who cares!). moody stuff. lots of cities, lots of silhouettes. that kind of thing. \n\n[**tainted magazine**](https://www.instagram.com/taintedmag/) **(#taintedmag) (9k)**\n\nlots of fine art portraiture, sometimes of famous people. the curation seems to favor innovative poses and composition that wouldn’t be out of place in a fancy mfa program. think ryan mcginley, or someone whose work is more abstract than that. the photos here look like they could be in ny mag or the nyt magazine. or a museum, really. \n\n[**film shooters collective**](https://www.instagram.com/filmshooterscollective/) **(#heyfsc) (80k)** \n\nthis account has been around for quite some time, and you’ll notice that some of their curation highlights photos that embrace the imperfections of film. by this, i mean photos shot on expired film, or photos with light leaks. if you like double exposures, this might be a good hashtag for you to use. \n\n[**photo filmy**](https://www.instagram.com/photo.filmy/) **(#photofilmy) (74k)**\n\nthere tends to be a focus on geometrically-pleasing images here. lots of beautiful old buildings, some americana-influenced stuff. there’s an interesting mix of curation here, and a number of the photos are densely layered. \n\n[**ain't–bad**](https://www.instagram.com/aintbad/)  **(#aintbad)  (70k)** \n\nthis is less of a feature account and more of a real-assed magazine/publisher. there’s more of an emphasis here on body of work (photo essays, photo books) than singles, which i really like because a cohesive body of work is what eventually sets you apart from the kind of photographers who just take pretty pictures. \n\n*note: i found out after writing this that there are some* ***serious underlying issues with ain’t bad****, which you can find out about on instagram. notably, they have failed to support people of color and lack diversity in their programming. there are also accusations of sexual assault that have been brought up against people involved with ain’t bad. it’s* ***really*** *disappointing and disheartening to read about because i’ve found some great photographers through their site. consider not using this hashtag.* \n\n[**back 2 the base**](https://www.instagram.com/back2thebase/) **(#back2thebase) (44k)** \n\na mixture of ian howorth-esque emptiness, portraiture, and street photography. quite artsy. i like their logo. \n\n[**drive by film**](https://www.instagram.com/drivebyfilm/) **(#drivebyfilm) (31k)** \n\nspoiler alert: there are a lot of beautiful cars on this account’s page, along with some gas stations, and a little bit of night work. it seems to be very focused on american scenes, though to be fair, so are many other accounts. \n\n[**restore from backup**](https://www.instagram.com/restorefrombackup/) **(#restorefrombackup) (31k)** \n\ni’m biased in my love for this account because they’ve shared my photography on multiple occasions (and more than other feature accounts have), but they place a really high value on community-building, and in that way it’s like a mixture of r/analog and r/analogcommunity. from what i can tell it’s run by good people who don’t have a superiority complex about photography. they also do a nice job of showcasing work from smaller accounts. \n\n[**burbs on film**](https://www.instagram.com/burbsonfilm/) **(#burbsonfilm) (26k)**\n\nthere are plenty of photos of suburbs on this page, but they’re not exclusively shot in suburban settings. a number of these photographs subvert traditional stereotypes of the united states, though some are pretty straightforward in their scope. lots of these photos feel like they’re from another era.\n\n[**make me see mag**](https://www.instagram.com/makemeseemag/) **(#makemeseemag) (24k)** \n\nwhat i’ve noticed with the photos that this account features is that they mostly feature photographs that have a dynamic subject that your eye zeroes in on immediately. there’s a little bit of flash photography thrown into the mix, which is nice. the curation is pretty varied and some of the photos are shot in quite innovative ways. it’s a great account that deserves a larger following. \n\n[**the film stead**](https://www.instagram.com/thefilmstead/) **(#thefilmstead) (11k)** \n\nsoothing, beautiful photography with a focus on architecture and landscapes. in a world where so many photographs are moody and dark, it’s nice to see photos that have a happier, more positive vibe.\n\n\\-----\n\n**accounts with less than 10k followers that might be worth your time:** \n\n[**every day rural america**](https://www.instagram.com/everydayruralamerica/) **(#everydayruralamerica) (6k)**\n\n[**rural exposures**](https://www.instagram.com/ruralexposures/) **(#ruralexposures) (6k)**\n\n[**the film renaissance**](https://www.instagram.com/thefilmrenaissance/) **(#thefilmrenaissance) (5k)**\n\n[**film leaders**](https://www.instagram.com/filmleaders/) **(#filmleaders) (4k)**\n\n[**observation magazine**](https://www.instagram.com/observationmag/) **(#observationmag) (3k)**\n\n[**seasoned film**](https://www.instagram.com/seasonedfilm/) **(#seasonedfilm) (2k)** \n\n[**analog drive**](https://www.instagram.com/analogdrive/) **(#analogdrivemag) (1.5k)**\n\nfeel free to post more accounts that you like in the comments, or share your thoughts on these accounts.\n\nfull disclosure: i am not involved with running any of these accounts. i’m just a person who loves photography of all kinds, and wanted to share my thoughts on feature accounts with new (or more established) photographers. \n\nsome of them have featured my work, but this hasn’t really factored into this list. i did run my thoughts by some fellow members of the film photography community, who have been immensely helpful in giving me more information about some of these accounts, which sometimes feel like they’re shrouded in secrecy. \n\nanyways, thanks for reading. i love r/analogcommunity and i hope this helps somebody out.", "sortedWord": "None", "identifyer": 61943, "year": "2020"}, {"Unnamed: 0": 315264, "autor": "bloomsburymike", "date": 1584381554000, "content": "I am about to buy a Contax T3. Please give me reasons to not do it (besides from the crazy price tag). /!/ What do you think? Would you consider buying a T3 or is it mad?\n\nHelp me. I value your opinions.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fjp8ou/i_am_about_to_buy_a_contax_t3_please_give_me/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i am about to buy a contax t3. please give me reasons to not do it (besides from the crazy price -----> tag !!! ). /!/ what do you think? would you consider buying a t3 or is it mad?\n\nhelp me. i value your opinions.", "sortedWord": "None", "identifyer": 62360, "year": "2020"}], "name": "tagAnalogCommunity2020"}