{"interestingcomments": [{"Unnamed: 0": 89445, "autor": "DougTrenches", "date": 1550620756000, "content": "Tag-sale Pick-up (Autoreflex TC, Vivitar XC-3, Polaroid 210) // New to Film /!/ Howdy All!  \n\n\nFirst time posting in this community, specifically because I'm just getting into film!  \n\n\nI'm a bit on the younger side, and never really grew up with cameras, so by-and-large my film knowledge is limited. I do carry a little digital camera (FujiX100T) with my around the world, and frame composition has been really a wonderful hobby.  \n\n\nI picked up these cameras at a tag-sale, along with some very expired film (1979 is the oldest roll), and I'd love to learn the in's and out's of shooting film. I'm guessing the expired film is in pretty bad condition // ruined because I'm sure it hasn't be properly stored throughout the years, but I'm interested to get to it eventually.   \n\n\nThe Autoreflex seems to be in the best condition, I've found batteries online for it, and there's a local shop that sells Kodak Gold 400. The Vivitar XC-3 seems to have a pretty rotted seal when I opened up the back.  \n\n\nAny general advice on these cameras? Are they supposed to be quality? Should I send them off to a shop to get looked at first, or should I just shoot a roll and see how it comes out?  \n\n\nAny and all tips for these cameras and for a newbie would be greatly appreciated. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ash9dl/tagsale_pickup_autoreflex_tc_vivitar_xc3_polaroid/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "-----> tag !!! -sale pick-up (autoreflex tc, vivitar xc-3, polaroid 210) // new to film /!/ howdy all!  \n\n\nfirst time posting in this community, specifically because i'm just getting into film!  \n\n\ni'm a bit on the younger side, and never really grew up with cameras, so by-and-large my film knowledge is limited. i do carry a little digital camera (fujix100t) with my around the world, and frame composition has been really a wonderful hobby.  \n\n\ni picked up these cameras at a tag-sale, along with some very expired film (1979 is the oldest roll), and i'd love to learn the in's and out's of shooting film. i'm guessing the expired film is in pretty bad condition // ruined because i'm sure it hasn't be properly stored throughout the years, but i'm interested to get to it eventually.   \n\n\nthe autoreflex seems to be in the best condition, i've found batteries online for it, and there's a local shop that sells kodak gold 400. the vivitar xc-3 seems to have a pretty rotted seal when i opened up the back.  \n\n\nany general advice on these cameras? are they supposed to be quality? should i send them off to a shop to get looked at first, or should i just shoot a roll and see how it comes out?  \n\n\nany and all tips for these cameras and for a newbie would be greatly appreciated. thanks!", "sortedWord": "None", "identifyer": 91931, "year": "2019"}, {"Unnamed: 0": 90106, "autor": "EpicNarwhals", "date": 1564087220000, "content": "A love letter to the Canon AV-1 /!/ I love the Canon AV-1. While often overshadowed by it’s brother the AE-1, I think the aperture priority exposure fits my shooting style better than a shutter priority like the AE-1. To me, it feels like a camera takes away too much creative control by choosing the aperture, since it changes the look of the picture so much. The AV-1’s also the perfect balance of minimal controls while still performing enough automation to make photography efficient. Where older cameras feel somewhat archaic, and newer ones feel too close to digital, the AV-1 strikes a chord with me, bringing out a very deliberate photography experience.\n\nThere’s just such a joy in setting the aperture and peering through the enormous viewfinder which makes manual focus feel like a fun game rather than a chore. I even like the weird little hack of playing with the ISO dial to adjust exposure compensation. There’s also the button that I call the “oomph button” which increases exposure time by about a stop which comes in handy since negatives handle overexposure so cleanly. I just press it whenever there’s shadows in the scene!\n\nI find myself bringing my AV-1 everywhere now since it’s small enough to tag along while still feeling solid in the hand. It’s a bit smaller than modern day mirrorless options like the a7 and since the battery lasts so long, it really is a simple afterthought to throw it in my bag when I’m headed somewhere.\n\nBack in the day when film was the only option, I could see myself yearning for the latest and greatest, but nowadays since I’m intentionally reaching backwards for the film experience, I couldn’t do it without the AV-1.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cht7vl/a_love_letter_to_the_canon_av1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a love letter to the canon av-1 /!/ i love the canon av-1. while often overshadowed by it’s brother the ae-1, i think the aperture priority exposure fits my shooting style better than a shutter priority like the ae-1. to me, it feels like a camera takes away too much creative control by choosing the aperture, since it changes the look of the picture so much. the av-1’s also the perfect balance of minimal controls while still performing enough automation to make photography efficient. where older cameras feel somewhat archaic, and newer ones feel too close to digital, the av-1 strikes a chord with me, bringing out a very deliberate photography experience.\n\nthere’s just such a joy in setting the aperture and peering through the enormous viewfinder which makes manual focus feel like a fun game rather than a chore. i even like the weird little hack of playing with the iso dial to adjust exposure compensation. there’s also the button that i call the “oomph button” which increases exposure time by about a stop which comes in handy since negatives handle overexposure so cleanly. i just press it whenever there’s shadows in the scene!\n\ni find myself bringing my av-1 everywhere now since it’s small enough to -----> tag !!!  along while still feeling solid in the hand. it’s a bit smaller than modern day mirrorless options like the a7 and since the battery lasts so long, it really is a simple afterthought to throw it in my bag when i’m headed somewhere.\n\nback in the day when film was the only option, i could see myself yearning for the latest and greatest, but nowadays since i’m intentionally reaching backwards for the film experience, i couldn’t do it without the av-1.", "sortedWord": "None", "identifyer": 92593, "year": "2019"}, {"Unnamed: 0": 90298, "autor": "N0DuckingWay", "date": 1547084292000, "content": "Film Instagram hastags/accounts /!/ I'm trying to build my film Instagram following (@old_school_photog if anyone's interested). What are some good film IG accounts that will feature other photographers' work if you tag them or use their hashtag?\n\nSeparately, what film IG accounts do you follow that inspire you (not necessarily individual photographers)?\n\nThanks for the help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aee05r/film_instagram_hastagsaccounts/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "film instagram hastags/accounts /!/ i'm trying to build my film instagram following (@old_school_photog if anyone's interested). what are some good film ig accounts that will feature other photographers' work if you -----> tag !!!  them or use their hashtag?\n\nseparately, what film ig accounts do you follow that inspire you (not necessarily individual photographers)?\n\nthanks for the help!", "sortedWord": "None", "identifyer": 92785, "year": "2019"}, {"Unnamed: 0": 90503, "autor": "vrotographer", "date": 1554768991000, "content": "For my birthday next week, I'm treating myself to a lens for my Nikon FE2! Any recommendations! /!/ The only problem is I'm not sure where to start when looking for Nikon lenses. I've tried researching in the past and it's confusing with non-AI, AI, AIS, AF, etc. all being \\*mostly\\* compatible with my FE2. I'm looking for a 50mm first and foremost, preferably f/1.8 or wider, and under $100. Cosmetic condition doesn't matter much as long as it works well. I'm also looking for a slightly wider, about 20-35mm (I know it's redundant with the 50mm already), f/2.8 or wider, with a price tag under $150. Do you guys have any recommendations for me?\n\n&amp;#x200B;\n\n^((I know we get a lot of gear threads I'm sorry))", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bb18tt/for_my_birthday_next_week_im_treating_myself_to_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "for my birthday next week, i'm treating myself to a lens for my nikon fe2! any recommendations! /!/ the only problem is i'm not sure where to start when looking for nikon lenses. i've tried researching in the past and it's confusing with non-ai, ai, ais, af, etc. all being \\*mostly\\* compatible with my fe2. i'm looking for a 50mm first and foremost, preferably f/1.8 or wider, and under $100. cosmetic condition doesn't matter much as long as it works well. i'm also looking for a slightly wider, about 20-35mm (i know it's redundant with the 50mm already), f/2.8 or wider, with a price -----> tag !!!  under $150. do you guys have any recommendations for me?\n\n&amp;#x200b;\n\n^((i know we get a lot of gear threads i'm sorry))", "sortedWord": "None", "identifyer": 92990, "year": "2019"}, {"Unnamed: 0": 91033, "autor": "koknia", "date": 1565542550000, "content": "Found Very Clean 503CW Millennium Kit w/Box &amp; Price Tag etc", "link": "https://www.reddit.com/r/AnalogCommunity/comments/coz5w8/found_very_clean_503cw_millennium_kit_wbox_price/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "found very clean 503cw millennium kit w/box &amp; price -----> tag !!!  etc", "sortedWord": "None", "identifyer": 93524, "year": "2019"}, {"Unnamed: 0": 92002, "autor": "ShotOnFilm", "date": 1563553054000, "content": "Has anyone tried the B/W reversal process? /!/ I'm interested if any tries the B/W reversal process. How was the experience? Do you think it was worth it? \n\nhttps://youtu.be/_MY6JpRkTJc\n\nPhotos at 9:45\n\nI was looking at the Rollei reversal kit until I seem the price tag of $112.99", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cf9js4/has_anyone_tried_the_bw_reversal_process/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "has anyone tried the b/w reversal process? /!/ i'm interested if any tries the b/w reversal process. how was the experience? do you think it was worth it? \n\nhttps://youtu.be/_my6jprktjc\n\nphotos at 9:45\n\ni was looking at the rollei reversal kit until i seem the price -----> tag !!!  of $112.99", "sortedWord": "None", "identifyer": 94499, "year": "2019"}, {"Unnamed: 0": 92214, "autor": "Odlavso", "date": 1567218085000, "content": "Luckily most people don't know the real money's in the lenses. /!/ Found a minolta xe-7 with a 58mm 1.2 today at a antique mall no tag, so I take it to the front and ask the guy how much. Proceeds to open up ebay infront of me and search minolta xe7, says 75$. I immediately say yes and pay, he didn't look up the lens Worth four times more than the camera.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cxqh47/luckily_most_people_dont_know_the_real_moneys_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "luckily most people don't know the real money's in the lenses. /!/ found a minolta xe-7 with a 58mm 1.2 today at a antique mall no -----> tag !!! , so i take it to the front and ask the guy how much. proceeds to open up ebay infront of me and search minolta xe7, says 75$. i immediately say yes and pay, he didn't look up the lens worth four times more than the camera.", "sortedWord": "None", "identifyer": 94714, "year": "2019"}, {"Unnamed: 0": 92726, "autor": "Hinermad", "date": 1556379145000, "content": "Counterfeit camera bags? /!/ Last year I bought a camera bag from a reputable online store. It wasn't terribly expensive but it seems like it's good quality, at least for what I need. But it came with tags and a specially printed QR code to prove that I was getting a *genuine* bag from the manufacturer and not a fake.\n\nIs that really a problem? Are people making counterfeit camera bags? Or is it a marketing gag to just make the brand seem more important?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bi07oz/counterfeit_camera_bags/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "counterfeit camera bags? /!/ last year i bought a camera bag from a reputable online store. it wasn't terribly expensive but it seems like it's good quality, at least for what i need. but it came with -----> tags !!!  and a specially printed qr code to prove that i was getting a *genuine* bag from the manufacturer and not a fake.\n\nis that really a problem? are people making counterfeit camera bags? or is it a marketing gag to just make the brand seem more important?", "sortedWord": "None", "identifyer": 95228, "year": "2019"}, {"Unnamed: 0": 92940, "autor": "usernombre_", "date": 1571721764000, "content": "Glue residue /!/ Bought a Rollei B35 and it has glue residue from either a small sticker or tag. What can I use to get rid of the goo that wont damage the camera or the body?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dld7uk/glue_residue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "glue residue /!/ bought a rollei b35 and it has glue residue from either a small sticker or -----> tag !!! . what can i use to get rid of the goo that wont damage the camera or the body?", "sortedWord": "None", "identifyer": 95444, "year": "2019"}, {"Unnamed: 0": 93129, "autor": "fourluko", "date": 1568948539000, "content": "Sweet deal on gold at the Walgreens I work at. Original price is absurd. Camera store I go to for film sells it at 2 bucks a roll so this is a deal for me. These tags mean we aren’t going to carry the product anymore so I’d suggest you hit your local drug store and see if they have it on clearance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d6os7e/sweet_deal_on_gold_at_the_walgreens_i_work_at/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "sweet deal on gold at the walgreens i work at. original price is absurd. camera store i go to for film sells it at 2 bucks a roll so this is a deal for me. these -----> tags !!!  mean we aren’t going to carry the product anymore so i’d suggest you hit your local drug store and see if they have it on clearance.", "sortedWord": "None", "identifyer": 95634, "year": "2019"}, {"Unnamed: 0": 93265, "autor": "Spukta", "date": 1576967476000, "content": "Kodak Portra 400 and 160 Film memo holder inserts /!/ I have recently shot two rolls of Portra 400, I wanted to see what the fuss is about and is it really as good as people say. Well Yes! It is good, but there is one thing missing. They come in the bulk packs of 5 although you can buy single rolls of it and if you are anything like me things have to be sorted. \n\nSo I made \"fake\" film box lids to put in the film memo holder. I dont know if anyone has done this before, but I wasn't able to find anything of this sort. \n\nhttps://preview.redd.it/3j5vn0lz92641.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=fd2932f22cd5f0094edc5d3708f562b757e31b08\n\nThis is an A4 page set up in Adobe Illustrator so If you want to make any personal modfications, feel free. I Made many variations so everyone can fing his/hers from the lot and even left one completely blank so you can whrite wahtever the hell you want! \n\nhere is the link &gt; [Portra 400 and 160 memo cards](https://drive.google.com/open?id=1eHsVp4tzcHv05qHRxS3BziDJC7Jqls9z)\n\nNow I must say, I havent printed this yet so I dont know 100% if the colours are perfect match or size is corrct, but it should be super close if not perfect. Also I sudgest printing it on card paper is plausible, for the sake of realism. \n\nFeel free to use/print/modifie but if you are sharing this further I would appreciate a link to this post or my Instagram tag ([@spuktalion](https://www.instagram.com/spuktalion/))\n\nAny response, sudgestions, upvotes ETC would be much appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/edwdpk/kodak_portra_400_and_160_film_memo_holder_inserts/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "kodak portra 400 and 160 film memo holder inserts /!/ i have recently shot two rolls of portra 400, i wanted to see what the fuss is about and is it really as good as people say. well yes! it is good, but there is one thing missing. they come in the bulk packs of 5 although you can buy single rolls of it and if you are anything like me things have to be sorted. \n\nso i made \"fake\" film box lids to put in the film memo holder. i dont know if anyone has done this before, but i wasn't able to find anything of this sort. \n\nhttps://preview.redd.it/3j5vn0lz92641.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=fd2932f22cd5f0094edc5d3708f562b757e31b08\n\nthis is an a4 page set up in adobe illustrator so if you want to make any personal modfications, feel free. i made many variations so everyone can fing his/hers from the lot and even left one completely blank so you can whrite wahtever the hell you want! \n\nhere is the link &gt; [portra 400 and 160 memo cards](https://drive.google.com/open?id=1ehsvp4tzchv05qhrxs3bzidjc7jqls9z)\n\nnow i must say, i havent printed this yet so i dont know 100% if the colours are perfect match or size is corrct, but it should be super close if not perfect. also i sudgest printing it on card paper is plausible, for the sake of realism. \n\nfeel free to use/print/modifie but if you are sharing this further i would appreciate a link to this post or my instagram -----> tag !!!  ([@spuktalion](https://www.instagram.com/spuktalion/))\n\nany response, sudgestions, upvotes etc would be much appreciated!", "sortedWord": "None", "identifyer": 95770, "year": "2019"}], "name": "tagAnalogCommunity2019"}