{"interestingcomments": [{"Unnamed: 0": 128388, "autor": "sunriseinthemidwest", "date": 1523789080000, "content": "What film does this look like? /!/ I've always been interested in the look that a lot of Japanese photogs get. They usually use a Pentax 67 and the images look like they would be shot on 400H or 160NS (overexposed 1 stop?).\n\nAny ideas? [Here is an example](https://www.flickr.com/photos/jerome0612/)\n\nUPDATE: After using the FLExplorer app for the iPhone, I found that you can go onto a person's profile on Flickr and search all of the tags they use on their photos. Jerome hardly ever uses a tag indicating what film he uses but he has in the past and looking at the photos he's tagged with Portra 400 vs Fuji 400H, I can see that his more recent photos have been, most likely, shot on 400H due to them being 'cooler' than the images he's shot on Portra 400. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8ceei6/what_film_does_this_look_like/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "what film does this look like? /!/ i've always been interested in the look that a lot of japanese photogs get. they usually use a pentax 67 and the images look like they would be shot on 400h or 160ns (overexposed 1 stop?).\n\nany ideas? [here is an example](https://www.flickr.com/photos/jerome0612/)\n\nupdate: after using the flexplorer app for the iphone, i found that you can go onto a person's profile on flickr and search all of the -----> tags !!!  they use on their photos. jerome hardly ever uses a tag indicating what film he uses but he has in the past and looking at the photos he's tagged with portra 400 vs fuji 400h, i can see that his more recent photos have been, most likely, shot on 400h due to them being 'cooler' than the images he's shot on portra 400. ", "sortedWord": "None", "identifyer": 19082, "year": "2018"}, {"Unnamed: 0": 128639, "autor": "ExpandedPlum", "date": 1529994191000, "content": "Photographing / Scanning for foggy photographs. /!/ I love the look of fog in photographs, and with my former digital camera, shooting fog was no big deal, and it could deal with it without issue. \n\nNot so it seems with film. Either I'm not exposing for it correctly, the films I chose didn't like the fog, or I just have no idea how to scan for the fog. \n\n[This is what I get when I scan &amp; edit the fog photos](https://imgur.com/a/rQNWqEW). Camera and films are tagged under each photo.\n\nAny tidbits would be awesome.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8txr0c/photographing_scanning_for_foggy_photographs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "photographing / scanning for foggy photographs. /!/ i love the look of fog in photographs, and with my former digital camera, shooting fog was no big deal, and it could deal with it without issue. \n\nnot so it seems with film. either i'm not exposing for it correctly, the films i chose didn't like the fog, or i just have no idea how to scan for the fog. \n\n[this is what i get when i scan &amp; edit the fog photos](https://imgur.com/a/rqnwqew). camera and films are -----> tagged !!!  under each photo.\n\nany tidbits would be awesome.", "sortedWord": "None", "identifyer": 19333, "year": "2018"}, {"Unnamed: 0": 129138, "autor": "arojilla", "date": 1540220638000, "content": "Searched for \"analog\" on Unsplash. Pics aside, it drew my attention that some people doesn't know how to name gear /!/ Has DSLR become synonym of \"big\" or \"serious\" camera or what? It's like if it is not a smartphone, it's a DSLR. Or that's how people tag gear on the site.\n\nAny film camera? A DSLR. A film rangefinder? A DSLR. A Leica M lens? A DSLR lens. A ragefinder-style digital camera? A... SLR. A SLR? A point-and-shoot. A SPOTMATIC F? A digital camera. A fixed lens rangefinder-style digital camera? A MILC. A Rollei 35? Another MILC. 2 cameras, one a SLR and the other a MILC? 2 DSLRs!\n\nSure, not all cameras were tagged that way, but after the first ones I forgot about the photos and kept scrolling to see if there were more.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9qempi/searched_for_analog_on_unsplash_pics_aside_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "searched for \"analog\" on unsplash. pics aside, it drew my attention that some people doesn't know how to name gear /!/ has dslr become synonym of \"big\" or \"serious\" camera or what? it's like if it is not a smartphone, it's a dslr. or that's how people -----> tag !!!  gear on the site.\n\nany film camera? a dslr. a film rangefinder? a dslr. a leica m lens? a dslr lens. a ragefinder-style digital camera? a... slr. a slr? a point-and-shoot. a spotmatic f? a digital camera. a fixed lens rangefinder-style digital camera? a milc. a rollei 35? another milc. 2 cameras, one a slr and the other a milc? 2 dslrs!\n\nsure, not all cameras were tagged that way, but after the first ones i forgot about the photos and kept scrolling to see if there were more.", "sortedWord": "None", "identifyer": 19838, "year": "2018"}, {"Unnamed: 0": 129481, "autor": "aSmallRedRadio", "date": 1545944950000, "content": "Anyone wanna critique my photos? /!/ I have 2 instagrams and most of the photos I post are analog, not all. I use the same hashtag for all My photos though, it's #asmallredradio, you should sort by recent too I think. They're not all good I know that for sure but I would like it if someone of you check them out, you can look at the tags to see what's digital and whats film and the camera/film used. Thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aa38yd/anyone_wanna_critique_my_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "anyone wanna critique my photos? /!/ i have 2 instagrams and most of the photos i post are analog, not all. i use the same hashtag for all my photos though, it's #asmallredradio, you should sort by recent too i think. they're not all good i know that for sure but i would like it if someone of you check them out, you can look at the -----> tags !!!  to see what's digital and whats film and the camera/film used. thanks", "sortedWord": "None", "identifyer": 20186, "year": "2018"}, {"Unnamed: 0": 130432, "autor": "slokenafk", "date": 1538334778000, "content": "New Stock of the month contest on /r/analog_bw! /!/ Hey everyone. With September coming to a close, we have announced the winner of September's stock of the month winner, along with the new Stock of the month thread.\n\nFor October 2018 the stock of the month is going to be Fujifilm's Acros 100. As always we encourage everyone to come and contribute. We also decided to announce next months stock as well. So if you have never shot Ilford Delta 100, now is a great time to give a try.\n\nFor the time being the winner will receive a tag on the sub stating the month and stock they won, but the mod team has been discussing tangible rewards for winning posts. Thanks for your time and please checkout /r/analog_bw and join us for the stock of the month thread.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9k92b5/new_stock_of_the_month_contest_on_ranalog_bw/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "new stock of the month contest on /r/analog_bw! /!/ hey everyone. with september coming to a close, we have announced the winner of september's stock of the month winner, along with the new stock of the month thread.\n\nfor october 2018 the stock of the month is going to be fujifilm's acros 100. as always we encourage everyone to come and contribute. we also decided to announce next months stock as well. so if you have never shot ilford delta 100, now is a great time to give a try.\n\nfor the time being the winner will receive a -----> tag !!!  on the sub stating the month and stock they won, but the mod team has been discussing tangible rewards for winning posts. thanks for your time and please checkout /r/analog_bw and join us for the stock of the month thread.", "sortedWord": "None", "identifyer": 21145, "year": "2018"}, {"Unnamed: 0": 130578, "autor": "centralplains", "date": 1543853223000, "content": "Meta Tag camera in Lightroom for Flickr /!/ For those of you who would like to tag your film camera, lens, and all settings, this is an excellent too I use on Flickr (haven't tested on [500px.com](https://500px.com) but I'm sure works as well). I'm able to meta tag my camera so it shows up like all the digital ones instead of showing the scanner name (which you can include in the Lenstagger meta tags as well). \n\n[Lenstagger](https://www.lenstagger.com/)\n\nHere's [an example of a photo](https://www.flickr.com/photos/spablab/38851974392/in/album-72157701484437385/) of mine.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a2q08a/meta_tag_camera_in_lightroom_for_flickr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "meta -----> tag !!!  camera in lightroom for flickr /!/ for those of you who would like to tag your film camera, lens, and all settings, this is an excellent too i use on flickr (haven't tested on [500px.com](https://500px.com) but i'm sure works as well). i'm able to meta tag my camera so it shows up like all the digital ones instead of showing the scanner name (which you can include in the lenstagger meta tags as well). \n\n[lenstagger](https://www.lenstagger.com/)\n\nhere's [an example of a photo](https://www.flickr.com/photos/spablab/38851974392/in/album-72157701484437385/) of mine.", "sortedWord": "None", "identifyer": 21291, "year": "2018"}, {"Unnamed: 0": 130887, "autor": "pentaquine", "date": 1533949591000, "content": "Where do you store your photos? /!/ I recently started shooting films. I normally just use Google photos for my digital photos. I find it rather convenient as it organize everything in a timeline, automatically tags faces and locations, etc. But it's really not very good to put my films, since the films don't have the time information so they just messes up my timeline. What's a good website to put my film scans, where I can organize the photos manually? I'm thinking about Flickr, it seems like it store photos in original size and is free up to 1TB. That's way more than enough for films. If I ever get close to 1TB of film scans I'll probably be bankrupt...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/96cnb8/where_do_you_store_your_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "where do you store your photos? /!/ i recently started shooting films. i normally just use google photos for my digital photos. i find it rather convenient as it organize everything in a timeline, automatically -----> tags !!!  faces and locations, etc. but it's really not very good to put my films, since the films don't have the time information so they just messes up my timeline. what's a good website to put my film scans, where i can organize the photos manually? i'm thinking about flickr, it seems like it store photos in original size and is free up to 1tb. that's way more than enough for films. if i ever get close to 1tb of film scans i'll probably be bankrupt...", "sortedWord": "None", "identifyer": 21601, "year": "2018"}], "name": "tagAnalogCommunity2018"}