{"interestingcomments": [{"autor": "ibsurvivors", "date": 1617228989000, "content": "Why you're \"bored\" at your job (and how to fix it) /!/ This is a post especially relevant for those of you transitioning into data science from a non-traditional background - so I hope you find it especially helpful :)\n\nIn the 1950s, Frederick Herzberg developed a theory that states there are two dimensions to job satisfaction: motivation and hygiene. \n\nHygiene factors can minimize dissatisfaction at work, but they can’t make you love your job. These are factors like salary, supervision, and working conditions.\n\nWhen you look back at the best moments of your career, they won’t really include the perks or the free lunches you got.\n\nInstead, you’ll look back and remember the *motivators*. These are factors like recognition and achievement. They mean that your work is challenging and that you’re learning about topics that you’re intrinsically interested in. \n\nThese are the factors that’ll be the predominant source of your work satisfaction and what contribute to your personal growth.\n\nHere’s the thing though. If the hygiene areas aren’t properly addressed, you won’t feel satisfied regardless of how fulfilling your work is.\n\nNo matter how challenging and exciting your work is, if you’re not getting paid what you deserve, you’ll constantly have a nagging thought at the back of your head telling you to leave.\n\nOn the other hand, *only* having hygiene areas resolved is the reason why you constantly think something’s missing. You’re puzzled over *why* you’d be unhappy - you have a high status job, plenty of cash, and great coworkers.\n\nBut we need challenge and growth to drive us forward. And that’s why the motivators are integral. Without the motivators, we go to bed at night dreaming about what we’d be doing in an alternative world. Just look at these Hacker News posts ([link](https://preview.redd.it/ed99k3mjsfq61.png?width=2360&amp;format=png&amp;auto=webp&amp;s=c3d640a23b0b37726ffdb4a3a5cc872601eae7f9)). \n\nThe reason this can be hard to identify in our day to day is because we wrongly assume that just because we’re not fully unsatisfied, we must be satisfied. And when we inevitably don’t get that resounding feeling of congruence with our work, we get puzzled.\n\nOne of my favorite examples of someone who prioritized her intrinsic motivators over factors like money or status is [Kristina Lustig](https://www.linkedin.com/in/kristinalustig/). She quit her high paying Director of Design job to retrain as a Software Developer.\n\nIt might not have made sense to others around her, but only Kristina knew what motivated her intrinsically.\n\n**Loss Aversion**\n\nLet’s assume you realize you want to make a career change into something more rewarding. Your brain is going to freak out.\n\nIt’s going to start screaming:\n\n* What if I don’t like my new job as much as my current one?\n* What if I don’t end up happier?\n* I can’t change if i don’t make as much money.\n\nThe key to overcome this thinking is to *separate short term losses from long term losses.*\n\nSo here are a few examples:\n\n* **Short Term**: In the short term, my salary will drop. **Long Term**: But 5 years from now, why can't it exceed what I'm making right now?\n* **Short Term:** I might have to take an entry level role which feels like a big drop from my current position. **Long Term**: But 5 years from now, won't I not only be in a more senior position but also a few steps closer to doing work I enjoy?\n* **Short Term**: I might have to give up the stability of my current role. **Long Term**: But 5 years from now, won't I have stability and a new skillset I can leverage?\n\n**The Next Thing**\n\nIt’s really easy to fall into the trap of thinking that the nicer office, the next pay raise, or the more prestigious title is what will make us happy. After all, it’s what your friends and family see. It’s the labels that stick.\n\nInstead, we should aim to ask a different set of questions:\n\n* Is this work meaningful to me?\n* Is this job going to give me a chance to develop?\n* Am I going to learn new things?\n* Will I have an opportunity for recognition and achievement?\n* Am I going to be given responsibility?\n\nThese are the things that will truly motivate you. The rest is just noise.\n\n\\-------\n\nI hope that was helpful!\n\n*If you liked this post, you might like* [*my newsletter*](https://www.careerfair.io/subscribe)*. It's my best content delivered to your inbox once every two weeks. And if Twitter is more your thing, feel free to follow connect with me* [here](https://twitter.com/OGCareerFair)*.*", "link": "https://www.reddit.com/r/datascience/comments/mhh5zu/why_youre_bored_at_your_job_and_how_to_fix_it/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "why you're \"bored\" at your job (and how to fix it) /!/ this is a post especially relevant for those of you transitioning into data science from a non-traditional background - so i hope you find it especially helpful :)\n\nin the 1950s, frederick herzberg developed a theory that states there are two dimensions to job satisfaction: motivation and hygiene. \n\nhygiene factors can minimize dissatisfaction at work, but they can’t make you love your job. these are factors like salary, supervision, and working conditions.\n\nwhen you look back at the best moments of your career, they won’t really include the perks or the free lunches you got.\n\ninstead, you’ll look back and remember the *motivators*. these are factors like recognition and achievement. they mean that your work is challenging and that you’re learning about topics that you’re intrinsically interested in. \n\nthese are the factors that’ll be the predominant source of your work satisfaction and what contribute to your personal growth.\n\nhere’s the thing though. if the hygiene areas aren’t properly addressed, you won’t feel satisfied regardless of how fulfilling your work is.\n\nno matter how challenging and exciting your work is, if you’re not getting paid what you deserve, you’ll constantly have a nagging thought at the back of your head telling you to leave.\n\non the other hand, *only* having hygiene areas resolved is the reason why you constantly think something’s missing. you’re puzzled over *why* you’d be unhappy - you have a high status job, plenty of cash, and great coworkers.\n\nbut we need challenge and growth to drive us forward. and that’s why the motivators are integral. without the motivators, we go to -----> bed !!!  at night dreaming about what we’d be doing in an alternative world. just look at these hacker news posts ([link](https://preview.redd.it/ed99k3mjsfq61.png?width=2360&amp;format=png&amp;auto=webp&amp;s=c3d640a23b0b37726ffdb4a3a5cc872601eae7f9)). \n\nthe reason this can be hard to identify in our day to day is because we wrongly assume that just because we’re not fully unsatisfied, we must be satisfied. and when we inevitably don’t get that resounding feeling of congruence with our work, we get puzzled.\n\none of my favorite examples of someone who prioritized her intrinsic motivators over factors like money or status is [kristina lustig](https://www.linkedin.com/in/kristinalustig/). she quit her high paying director of design job to retrain as a software developer.\n\nit might not have made sense to others around her, but only kristina knew what motivated her intrinsically.\n\n**loss aversion**\n\nlet’s assume you realize you want to make a career change into something more rewarding. your brain is going to freak out.\n\nit’s going to start screaming:\n\n* what if i don’t like my new job as much as my current one?\n* what if i don’t end up happier?\n* i can’t change if i don’t make as much money.\n\nthe key to overcome this thinking is to *separate short term losses from long term losses.*\n\nso here are a few examples:\n\n* **short term**: in the short term, my salary will drop. **long term**: but 5 years from now, why can't it exceed what i'm making right now?\n* **short term:** i might have to take an entry level role which feels like a big drop from my current position. **long term**: but 5 years from now, won't i not only be in a more senior position but also a few steps closer to doing work i enjoy?\n* **short term**: i might have to give up the stability of my current role. **long term**: but 5 years from now, won't i have stability and a new skillset i can leverage?\n\n**the next thing**\n\nit’s really easy to fall into the trap of thinking that the nicer office, the next pay raise, or the more prestigious title is what will make us happy. after all, it’s what your friends and family see. it’s the labels that stick.\n\ninstead, we should aim to ask a different set of questions:\n\n* is this work meaningful to me?\n* is this job going to give me a chance to develop?\n* am i going to learn new things?\n* will i have an opportunity for recognition and achievement?\n* am i going to be given responsibility?\n\nthese are the things that will truly motivate you. the rest is just noise.\n\n\\-------\n\ni hope that was helpful!\n\n*if you liked this post, you might like* [*my newsletter*](https://www.careerfair.io/subscribe)*. it's my best content delivered to your inbox once every two weeks. and if twitter is more your thing, feel free to follow connect with me* [here](https://twitter.com/ogcareerfair)*.*", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 37, "media": "('self',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mhh5zu/why_youre_bored_at_your_job_and_how_to_fix_it/',)", "identifyer": 5586896, "year": "2021"}, {"autor": "OpeItsJosh", "date": 1632885762000, "content": "Am I doing enough to secure a good career??? /!/ Hey everyone,\n\nMy names Josh, and here is a little backstory. I am currently a master mechanic working in the powersports industry, however, an injury I received from serving in the army is being aggravated by my physical work and I am looking for a change.\n\nCurrently I am enrolled in a certificate program in data science and analytics at my local university.  I am also working on my Google data analytics certificate, as well as working through tracks on codecademy and datacamp. I practice code for 4-6 hours an evening after my kids go to bed.\n\nIt's daunting seeing all of these entry level jobs require degrees in statistics, computer science, etc. Am I on the right track for making something of myself? Or am i just wasting my time?", "link": "https://www.reddit.com/r/datascience/comments/pxmsrp/am_i_doing_enough_to_secure_a_good_career/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "am i doing enough to secure a good career??? /!/ hey everyone,\n\nmy names josh, and here is a little backstory. i am currently a master mechanic working in the powersports industry, however, an injury i received from serving in the army is being aggravated by my physical work and i am looking for a change.\n\ncurrently i am enrolled in a certificate program in data science and analytics at my local university.  i am also working on my google data analytics certificate, as well as working through tracks on codecademy and datacamp. i practice code for 4-6 hours an evening after my kids go to -----> bed !!! .\n\nit's daunting seeing all of these entry level jobs require degrees in statistics, computer science, etc. am i on the right track for making something of myself? or am i just wasting my time?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pxmsrp/am_i_doing_enough_to_secure_a_good_career/',)", "identifyer": 5588753, "year": "2021"}, {"autor": "dfphd", "date": 1614267610000, "content": "There is no perfect interview process, only trade-offs /!/ Something that gets discussed here often are interviews - and specifically which is the \"right\" or \"wrong\" way to interview.\n\n**There is no universally \"right\" way to interview, and I think that is super important for both hiring managers and candidates to understand.**\n\nThe reason? You are always making trade-offs:\n\n* Shorter, more concise interview process introduce a higher risk of hiring the wrong candidate. Longer, more in-depth interview processes introduce a higher risk of false negatives (i.e., rejecting a candidate who would actually be great for the job), and a higher risk of just repelling qualified candidates.\n* A focus on quizzes/tests/quick reaction questions introduces a high risk of giving good scores to people who either \"studied how to interview\" or just got lucky and knew the answers to those specific questions. Focusing instead only on their work experience introduces a high risk of hiring someone who can't think on their feet.\n\nHaving said that, in my experience there are a couple of universal \"truths\" in a statistical sense that really help with interviewing:\n\n**People with a history of being productive are likely going to continue to be productive in the future. People with a history that lacks productivity are unlikely to become productive just for you.**\n\nIn my life, I've seen many candidates that looked great on paper. Had the right classes, knew the right things, talked the big game, etc. - but for some reason, when they actually got hired, would struggle to get things done. Everything would take too long, they would overthink things, didn't know when to ask for help, etc.\n\nAnd that's when the red flag showed up retroactively: they knew all the right things, but had never produced. Whether in grad school (publications, projects, etc.) or work, the ratio of how much they knew and how much they did was off.\n\nIn my experience, this is mostly an inherent trait. Some people just find way to get things done, and some people just find ways to not get things done. And as far as I know, there is very little you can do as a manager to change that in a person.\n\nWhat it has taught me is that someone that aces every part of the interview *but has nothing to show for in his previous places of employment* becomes a huge concern unless they have a great explanation as to why. And 99/100, there is no great reason why.\n\nMessage for hiring managers: focus on evidence of production in candidates.\n\nMessage for candidates: make your resume scream \"I get stuff done\". Achievements matter *way* more than things you know.\n\nEDIT: Because a lot of people are asking \"how do I write down any achievements if I'm a student/have an NDA/etc.\n\nTwo things here:\n\n1. You're going to be compared against a benchmark: someone fresh out of a MS is going to get graded on a completely different scale than someone with 2 years experience. So keep that in mind, and realize that you need to look productive relative to your peers.\n2. You don't need to provide a ton of detail to show you were productive. Ideally you can say something like \"delivered $2M in revenue by implementing a blah model in blah\", but if you're not allowed to disclose those details you can just remove the quantities and keep it more vague. What *does* become critical is that you provide a cumulative list of projects/impact that looks good. If you're worked there for 2 years, you need to either have 1-2 *really* impressive accomplishments, or 4-6 more moderate/minor ones, but you need a combination of volume and impact that stands out.\n\nSomething that I think people often miss here: don't \"combine\" or \"aggregate\" projects. Don't say things like \"delivered $5M in value across several projects\". Nope, list every single project. Don't say things like \"collaborated on several cross-department initiatives\". Nope, list every single one and what you did in them - even if minor.\n\nFor example, compare these two lists:\n\n* Delivered $2M in revenue as part of a multi-year, strategic plan to overhaul sales analytics process.\n\nvs.\n\n* Generated $200K in costs savings by optimizing ad spend across channels using a linear programming approach.\n* Identified $300K in additional revenue opportunities through targeted price increases.\n* Mitigated COGS increases of 2% by consolidating volume across multiple brands\n* Helped leadership identify $50K in redundancies by providing ad-hoc analysis to identify redunancies.\n\nWhat would you prefer to see? Hiring managers are almost surely going to prefer list #2, because it tells me you've generated value in a lot of different ways, a lot of different times. That means more samples that say \"I do things\".\n\nIf you're a fresh grad, what's critical is to make sure you cover every paper, report, document, project, etc., you've done. So avoid things like:\n\n* Conducted cross-functional research in the area of blah\n\nAnd instead break that down to what it actually meant:\n\n* Performed literature review (over 30 manuscripts) in blah design, blah algorithms and blah optimization.\n* Conducted weekly research meetings with researchers in the schools of Basket Weaving and Synchronized Swimming\n* Prototyped novel model using combination of Python and smoke signals.\n* Delivered monthly status updates to advisor\n\n**Finding someone who knows how to do the things you need them to do right now is less important than finding someone who can learn the things you will need them to do now and in the future quickly**\n\nThe only constant in workplaces is change. A lot of hiring managers, when looking to hire someone, ask themselves \"what would this person do today?\", and then focus on finding people who are doing *exactly* those things today.\n\nNow, if that pool is of candidates is big (e.g., you need them to code in Python), then that's a perfectly reasonble approach. But if that pool of candidates is small (e.g., you need people with experience in one specific algorithm), then you're going to get yourself in trouble because the odds of finding someone who is both an excellent applicant and has that exact experience is very, very small. Going to the previous point, you should be putting a lot more emphasis on finding productive people than finding people with the exact experience you want.\n\nWhy? Because experience can be acquired. People can learn. Not only that, what you may be having them do today may not be what they're doing in 6 months. Hell, maybe that person comes in and they themselves are able to suggest a new approach that works better than what you were doing before, rendering that skillset obsolete.\n\n**A candidates' current skillset is largely dictates by their current job, and should not be taken as a fixed, static skillset**\n\nI like sports analogies, so here goes one: Joe Thomas was an 11 year starter on the offensive line for the Cleveland Browns. A 10x pro bowler and 6x all pro, the guy is almost surely a first ballot hall of famer.\n\nDuring his playing career, his weight was 325lbs. Here is a side-by-side of Joe Thomas during his playing days and now - after retirement.\n\nhttps://preview.redd.it/go8lfyo47nj61.png?width=621&amp;format=png&amp;auto=webp&amp;s=16914ad5a9fc3fbda99cc0a885337827e4ac4be4\n\nJoe Thomas is currently 250 lbs. It took him less than 6 months to lose that weight. Why? Well, to play at 325, his diet looked something like this:\n\n&gt;Breakfast was usually a big bowl of oatmeal, a big thing of Greek yogurt with berries, granola, flax seed, honey, and then maybe 8-10 scrambled eggs and 4-5 pieces of bacon. Between breakfast and lunch, I’d have some type of snack, whether that was beef jerky, a protein shake, or a high-calorie smoothie. Lunch was a hamburger with all the fixings, plus french fries.  \n&gt;  \n&gt;Thomas went on to describe other aspects of his daily diet, including:  \n&gt;  \n&gt;A post-practice smoothie  \n&gt;  \n&gt;A tray of lasagna for dinner with a glass of whole milk  \n&gt;  \n&gt;A frozen pizza  \n&gt;  \n&gt;A sleeve of Girl Scout cookies and a bowl of ice cream right before bed\n\nThat is, to stay at 325, Joe Thomas had to *work.* And by work, I mean eat. A lot. All the time.\n\nOk, great story - what's the point of it?\n\nWhen you look at candidates that have been in one environment for several years, hiring managers often look at their resume and assume that what they're doing now is just who they are. \"Oh, this person has been doing a bunch of ad-hoc analysis and BI reporting - not what I'm looking for, I need someone building models\".\n\nAnd that is the wrong take, because for all we know, that candidates doing ad hoc analysis and BI reports is just Joe Thomas eating an entire frozen pizza before dinner. That is, it's a person that is doing what they need to do in order to do their current job well. Joe Thomas' job was to be huge and stop other huge people from hitting his QB. The guy doing ad hoc reports' job is to do ad hoc reports.\n\nSo what do you do with a candidate that has done mostly BI work but wants a position doing modeling? Two things:\n\n1. You measure productivity. Their job was to do ad hoc reporting and building BI reports. How good were they at that? Did they differentiate themselves in that field? How many times did they go above and beyond what other people would have done in that role?\n2. What experience do they have with modeling - not in this previous role, but ever? How well can they speak to that experience? And how excited are they to pick it back up?\n3. What experience do they have learning something new? In doing ad hoc reporting and BI work, did they have to learn new technologies or languages?\n\nAgain, you can take the super risk averse stance and just not even entertain the thought of hiring someone without the exact experience you're looking for - but you are overwhelmingly likely to miss out on some great candidates.", "link": "https://www.reddit.com/r/datascience/comments/ls9c1r/there_is_no_perfect_interview_process_only/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "there is no perfect interview process, only trade-offs /!/ something that gets discussed here often are interviews - and specifically which is the \"right\" or \"wrong\" way to interview.\n\n**there is no universally \"right\" way to interview, and i think that is super important for both hiring managers and candidates to understand.**\n\nthe reason? you are always making trade-offs:\n\n* shorter, more concise interview process introduce a higher risk of hiring the wrong candidate. longer, more in-depth interview processes introduce a higher risk of false negatives (i.e., rejecting a candidate who would actually be great for the job), and a higher risk of just repelling qualified candidates.\n* a focus on quizzes/tests/quick reaction questions introduces a high risk of giving good scores to people who either \"studied how to interview\" or just got lucky and knew the answers to those specific questions. focusing instead only on their work experience introduces a high risk of hiring someone who can't think on their feet.\n\nhaving said that, in my experience there are a couple of universal \"truths\" in a statistical sense that really help with interviewing:\n\n**people with a history of being productive are likely going to continue to be productive in the future. people with a history that lacks productivity are unlikely to become productive just for you.**\n\nin my life, i've seen many candidates that looked great on paper. had the right classes, knew the right things, talked the big game, etc. - but for some reason, when they actually got hired, would struggle to get things done. everything would take too long, they would overthink things, didn't know when to ask for help, etc.\n\nand that's when the red flag showed up retroactively: they knew all the right things, but had never produced. whether in grad school (publications, projects, etc.) or work, the ratio of how much they knew and how much they did was off.\n\nin my experience, this is mostly an inherent trait. some people just find way to get things done, and some people just find ways to not get things done. and as far as i know, there is very little you can do as a manager to change that in a person.\n\nwhat it has taught me is that someone that aces every part of the interview *but has nothing to show for in his previous places of employment* becomes a huge concern unless they have a great explanation as to why. and 99/100, there is no great reason why.\n\nmessage for hiring managers: focus on evidence of production in candidates.\n\nmessage for candidates: make your resume scream \"i get stuff done\". achievements matter *way* more than things you know.\n\nedit: because a lot of people are asking \"how do i write down any achievements if i'm a student/have an nda/etc.\n\ntwo things here:\n\n1. you're going to be compared against a benchmark: someone fresh out of a ms is going to get graded on a completely different scale than someone with 2 years experience. so keep that in mind, and realize that you need to look productive relative to your peers.\n2. you don't need to provide a ton of detail to show you were productive. ideally you can say something like \"delivered $2m in revenue by implementing a blah model in blah\", but if you're not allowed to disclose those details you can just remove the quantities and keep it more vague. what *does* become critical is that you provide a cumulative list of projects/impact that looks good. if you're worked there for 2 years, you need to either have 1-2 *really* impressive accomplishments, or 4-6 more moderate/minor ones, but you need a combination of volume and impact that stands out.\n\nsomething that i think people often miss here: don't \"combine\" or \"aggregate\" projects. don't say things like \"delivered $5m in value across several projects\". nope, list every single project. don't say things like \"collaborated on several cross-department initiatives\". nope, list every single one and what you did in them - even if minor.\n\nfor example, compare these two lists:\n\n* delivered $2m in revenue as part of a multi-year, strategic plan to overhaul sales analytics process.\n\nvs.\n\n* generated $200k in costs savings by optimizing ad spend across channels using a linear programming approach.\n* identified $300k in additional revenue opportunities through targeted price increases.\n* mitigated cogs increases of 2% by consolidating volume across multiple brands\n* helped leadership identify $50k in redundancies by providing ad-hoc analysis to identify redunancies.\n\nwhat would you prefer to see? hiring managers are almost surely going to prefer list #2, because it tells me you've generated value in a lot of different ways, a lot of different times. that means more samples that say \"i do things\".\n\nif you're a fresh grad, what's critical is to make sure you cover every paper, report, document, project, etc., you've done. so avoid things like:\n\n* conducted cross-functional research in the area of blah\n\nand instead break that down to what it actually meant:\n\n* performed literature review (over 30 manuscripts) in blah design, blah algorithms and blah optimization.\n* conducted weekly research meetings with researchers in the schools of basket weaving and synchronized swimming\n* prototyped novel model using combination of python and smoke signals.\n* delivered monthly status updates to advisor\n\n**finding someone who knows how to do the things you need them to do right now is less important than finding someone who can learn the things you will need them to do now and in the future quickly**\n\nthe only constant in workplaces is change. a lot of hiring managers, when looking to hire someone, ask themselves \"what would this person do today?\", and then focus on finding people who are doing *exactly* those things today.\n\nnow, if that pool is of candidates is big (e.g., you need them to code in python), then that's a perfectly reasonble approach. but if that pool of candidates is small (e.g., you need people with experience in one specific algorithm), then you're going to get yourself in trouble because the odds of finding someone who is both an excellent applicant and has that exact experience is very, very small. going to the previous point, you should be putting a lot more emphasis on finding productive people than finding people with the exact experience you want.\n\nwhy? because experience can be acquired. people can learn. not only that, what you may be having them do today may not be what they're doing in 6 months. hell, maybe that person comes in and they themselves are able to suggest a new approach that works better than what you were doing before, rendering that skillset obsolete.\n\n**a candidates' current skillset is largely dictates by their current job, and should not be taken as a fixed, static skillset**\n\ni like sports analogies, so here goes one: joe thomas was an 11 year starter on the offensive line for the cleveland browns. a 10x pro bowler and 6x all pro, the guy is almost surely a first ballot hall of famer.\n\nduring his playing career, his weight was 325lbs. here is a side-by-side of joe thomas during his playing days and now - after retirement.\n\nhttps://preview.redd.it/go8lfyo47nj61.png?width=621&amp;format=png&amp;auto=webp&amp;s=16914ad5a9fc3fbda99cc0a885337827e4ac4be4\n\njoe thomas is currently 250 lbs. it took him less than 6 months to lose that weight. why? well, to play at 325, his diet looked something like this:\n\n&gt;breakfast was usually a big bowl of oatmeal, a big thing of greek yogurt with berries, granola, flax seed, honey, and then maybe 8-10 scrambled eggs and 4-5 pieces of bacon. between breakfast and lunch, i’d have some type of snack, whether that was beef jerky, a protein shake, or a high-calorie smoothie. lunch was a hamburger with all the fixings, plus french fries.  \n&gt;  \n&gt;thomas went on to describe other aspects of his daily diet, including:  \n&gt;  \n&gt;a post-practice smoothie  \n&gt;  \n&gt;a tray of lasagna for dinner with a glass of whole milk  \n&gt;  \n&gt;a frozen pizza  \n&gt;  \n&gt;a sleeve of girl scout cookies and a bowl of ice cream right before -----> bed !!! \n\nthat is, to stay at 325, joe thomas had to *work.* and by work, i mean eat. a lot. all the time.\n\nok, great story - what's the point of it?\n\nwhen you look at candidates that have been in one environment for several years, hiring managers often look at their resume and assume that what they're doing now is just who they are. \"oh, this person has been doing a bunch of ad-hoc analysis and bi reporting - not what i'm looking for, i need someone building models\".\n\nand that is the wrong take, because for all we know, that candidates doing ad hoc analysis and bi reports is just joe thomas eating an entire frozen pizza before dinner. that is, it's a person that is doing what they need to do in order to do their current job well. joe thomas' job was to be huge and stop other huge people from hitting his qb. the guy doing ad hoc reports' job is to do ad hoc reports.\n\nso what do you do with a candidate that has done mostly bi work but wants a position doing modeling? two things:\n\n1. you measure productivity. their job was to do ad hoc reporting and building bi reports. how good were they at that? did they differentiate themselves in that field? how many times did they go above and beyond what other people would have done in that role?\n2. what experience do they have with modeling - not in this previous role, but ever? how well can they speak to that experience? and how excited are they to pick it back up?\n3. what experience do they have learning something new? in doing ad hoc reporting and bi work, did they have to learn new technologies or languages?\n\nagain, you can take the super risk averse stance and just not even entertain the thought of hiring someone without the exact experience you're looking for - but you are overwhelmingly likely to miss out on some great candidates.", "sortedWord": "None", "removed": "('nan',)", "score": 314, "comments": 161, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ls9c1r/there_is_no_perfect_interview_process_only/',)", "identifyer": 5589566, "year": "2021"}, {"autor": "arborealham", "date": 1626932583000, "content": "Data repository for schools in US, BEDS to school ID /!/ I'm putting together a large data file for all US schools,  particularly middle and high school right now,  and am having trouble finding a translation key for BEDS and school ID. I assume this is a fairly common item to have and am wondering if someone can pass it along?", "link": "https://www.reddit.com/r/datascience/comments/op7ov9/data_repository_for_schools_in_us_beds_to_school/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "data repository for schools in us, -----> beds !!!  to school id /!/ i'm putting together a large data file for all us schools,  particularly middle and high school right now,  and am having trouble finding a translation key for beds and school id. i assume this is a fairly common item to have and am wondering if someone can pass it along?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/op7ov9/data_repository_for_schools_in_us_beds_to_school/',)", "identifyer": 5591134, "year": "2021"}, {"autor": "marmalt218", "date": 1613607985000, "content": "Are there any COVID-19 datasets out there that track US state (or county) data as well as The COVID-19 Tracking Project did? /!/ The COVID-19 Tracking Project is ceasing to update their dataset that reports daily numbers for hospitalizations, positive cases, total tests, ICU beds, and more from every state. I have been using their continuously updated dataset to visualize COVID trends in different states and am pretty upset they’re pulling the plug. Does anyone have any reccs?", "link": "https://www.reddit.com/r/datascience/comments/lm91xp/are_there_any_covid19_datasets_out_there_that/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "are there any covid-19 datasets out there that track us state (or county) data as well as the covid-19 tracking project did? /!/ the covid-19 tracking project is ceasing to update their dataset that reports daily numbers for hospitalizations, positive cases, total tests, icu -----> beds !!! , and more from every state. i have been using their continuously updated dataset to visualize covid trends in different states and am pretty upset they’re pulling the plug. does anyone have any reccs?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/lm91xp/are_there_any_covid19_datasets_out_there_that/',)", "identifyer": 5593084, "year": "2021"}, {"autor": "levimk77", "date": 1610299441000, "content": "Cant stop smoking weed/playing video games, ruining my career. /!/ I (22m) am a \\`junior\\` in college with about five semesters left. I have basic programming skills from a bootcamp I took last summer and I have a  3.6 GPA studying Stats major and bio minor (3.8 before quarantine hit..)\n\nI basically got incredibly lucky decided I want to pursue a career in D.S. after reading book about careers in Big Data, then two semesters later I stumbled into an internship/mentorship with the Director of the Predictive Analytics Center at my university.\n\nRight now my responsibilities for the semester include a course load of almost entirely math courses, an online course run by my mentor, two programming projects led by different professors, an internship at the analytics center answering calls/emails and writing reports, as well as a job as a supplemental instruction leader for a physics class.\n\nEven though this all sounds nice and might look good comparatively on a resume I don't actually have any Data Science skills and most of my current skills/experience is limited to basic programming skills and an understanding of mathematical principles.\n\nIf I truly want to become an effective and competitive data scientist then I am going to need to reinvent myself and stop spending all of my free time smoking pot and playing video games and instead reading books, taking extracurricular online courses, and ultimately building projects and writing code that I can put on a project portfolio.\n\nSo the big problem with all this is that I am an incredibly impulsive and addictive person who has been  playing World of Warcraft since the age of 7 and smoking weed since the age of 15. Before quarantine I had just achieved four months of sobriety and was playing less than 15 hours of video games a week, but now I do nothing but smoke weed and play video games out of bed. I can convince myself to quit for a day or more but I end up doing nothing but laying in bed watching shows and using the internet so its not much help. \n\nI don't know what to do. I tried so hard to reinvent myself and become a different person in college- but now Im back to the same old behaviors and routines that I indulged in during/after high school and I am watching everything I worked so hard to build fall apart before my eyes.", "link": "https://www.reddit.com/r/datascience/comments/kuilw8/cant_stop_smoking_weedplaying_video_games_ruining/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "cant stop smoking weed/playing video games, ruining my career. /!/ i (22m) am a \\`junior\\` in college with about five semesters left. i have basic programming skills from a bootcamp i took last summer and i have a  3.6 gpa studying stats major and bio minor (3.8 before quarantine hit..)\n\ni basically got incredibly lucky decided i want to pursue a career in d.s. after reading book about careers in big data, then two semesters later i stumbled into an internship/mentorship with the director of the predictive analytics center at my university.\n\nright now my responsibilities for the semester include a course load of almost entirely math courses, an online course run by my mentor, two programming projects led by different professors, an internship at the analytics center answering calls/emails and writing reports, as well as a job as a supplemental instruction leader for a physics class.\n\neven though this all sounds nice and might look good comparatively on a resume i don't actually have any data science skills and most of my current skills/experience is limited to basic programming skills and an understanding of mathematical principles.\n\nif i truly want to become an effective and competitive data scientist then i am going to need to reinvent myself and stop spending all of my free time smoking pot and playing video games and instead reading books, taking extracurricular online courses, and ultimately building projects and writing code that i can put on a project portfolio.\n\nso the big problem with all this is that i am an incredibly impulsive and addictive person who has been  playing world of warcraft since the age of 7 and smoking weed since the age of 15. before quarantine i had just achieved four months of sobriety and was playing less than 15 hours of video games a week, but now i do nothing but smoke weed and play video games out of -----> bed !!! . i can convince myself to quit for a day or more but i end up doing nothing but laying in bed watching shows and using the internet so its not much help. \n\ni don't know what to do. i tried so hard to reinvent myself and become a different person in college- but now im back to the same old behaviors and routines that i indulged in during/after high school and i am watching everything i worked so hard to build fall apart before my eyes.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/kuilw8/cant_stop_smoking_weedplaying_video_games_ruining/',)", "identifyer": 5595120, "year": "2021"}, {"autor": "prestodigitarium", "date": 1619288427000, "content": "Gourdian Free Dataset Download: OpenStreetMap Points of Interest (Restaurants, Bars, Grocery Stores, Transit, Shops, Swingers Clubs, Hospitals, etc) /!/ Hi there!\n\nA friend and I are working on something to help people search for, filter, and download subsets of datasets.\n\nWe're excited to share that we've just incorporated all(?) of the points of interest from OpenStreetMap, broken down by group (from their ontologies here https://wiki.openstreetmap.org/wiki/Key:amenity and here https://wiki.openstreetmap.org/wiki/Key:shop )\n\nThe groups are below, with the tags that went into each. \n\nWhat do people think these might be useful for? Maybe making your own version of WalkScore? Perhaps cross referencing with real estate listings to find a house that's within walking distance of a bakery, library, cafe, and pyrotechnics shop? LoveHotelMapper.com? The possibilities are endless!\n\n**Restaurants and Bars**: https://gourdian.net/g/eric/osm_points_of_interest.restaurants_and_bars\nAmenities points of interest labeled with bar, biergarten, cafe, fast_food, food_court, ice_cream, pub, or restaurant.\n\n**Education Services**: https://gourdian.net/g/eric/osm_points_of_interest.education_services\nAmenities points of interest labeled with college, driving_school, kindergarten, language_school, library, toy_library, music_school, school, or university.\n\n**Transportation Related**: https://gourdian.net/g/eric/osm_points_of_interest.transportation_related\nAmenities points of interest labeled with bicycle_parking, bicycle_repair_station, bicycle_rental, boat_rental, boat_sharing, bus_station, car_rental, car_sharing, car_wash, vehicle_inspection, charging_station, ferry_terminal, fuel, grit_bin, motorcycle_parking, parking, parking_entrance, parking_space, or taxi.\n\n**Financial**: https://gourdian.net/g/eric/osm_points_of_interest.financial\nAmenities points of interest labeled with atm, bank, or bureau_de_change.\n\n**Healthcare Facilities**: https://gourdian.net/g/eric/osm_points_of_interest.healthcare_facilities\nAmenities points of interest labeled with baby_hatch, clinic, dentist, doctors, hospital, nursing_home, pharmacy, social_facility, or veterinary.\n\n**Entertainment**: https://gourdian.net/g/eric/osm_points_of_interest.entertainment\nAmenities points of interest labeled with arts_centre, brothel, casino, cinema, community_centre, conference_centre, events_venue, fountain, gambling, love_hotel, nightclub, planetarium, public_bookcase, social_centre, stripclub, studio, swingerclub, or theatre.\n\n**Public Services**: https://gourdian.net/g/eric/osm_points_of_interest.public_services\nAmenities points of interest labeled with courthouse, embassy, fire_station, police, post_box, post_depot, post_office, prison, ranger_station, or townhall.\n\n**Facilities**: https://gourdian.net/g/eric/osm_points_of_interest.facilities\nAmenities points of interest labeled with bbq, bench, dog_toilet, drinking_water, give_box, shelter, shower, telephone, toilets, water_point, or watering_place.\n\n**Waste Management**: https://gourdian.net/g/eric/osm_points_of_interest.waste_management\nAmenities points of interest labeled with sanitary_dump_station, recycling, waste_basket, waste_disposal, or waste_transfer_station.\n\n**Other Amenities**: https://gourdian.net/g/eric/osm_points_of_interest.other_amenities\nAmenities points of interest labeled with animal_boarding, animal_breeding, animal_shelter, baking_oven, childcare, clock, crematorium, dive_centre, funeral_hall, grave_yard, gym, hunting_stand, internet_cafe, kitchen, kneipp_water_cure, lounger, marketplace, monastery, photo_booth, place_of_mourning, place_of_worship, public_bath, public_building, refugee_site, or vending_machine.\n\n**Food Shops**: https://gourdian.net/g/eric/osm_points_of_interest.food_shops\nShops points of interest labeled with alcohol, bakery, beverages, brewing_supplies, butcher, cheese, chocolate, coffee, confectionery, convenience, deli, dairy, farm, frozen_food, greengrocer, health_food, ice_cream, organic, pasta, pastry, seafood, spices, tea, wine, or water.\n\n**General Shops**: https://gourdian.net/g/eric/osm_points_of_interest.general_shops\nShops points of interest labeled with department_store, general, kiosk, mall, supermarket, or wholesale.\n\n**Clothing Shops**: https://gourdian.net/g/eric/osm_points_of_interest.clothing_shops\nShops points of interest labeled with baby_goods, bag, boutique, clothes, fabric, fashion, fashion_accessories, jewelry, leather, sewing, shoes, tailor, watches, or wool.\n\n**Second Hand Shops**: https://gourdian.net/g/eric/osm_points_of_interest.second_hand_shops\nShops points of interest labeled with charity, second_hand, or variety_store.\n\n**Health and Beauty Shops**: https://gourdian.net/g/eric/osm_points_of_interest.health_and_beauty_shops\nShops points of interest labeled with beauty, chemist, cosmetics, drugstore, erotic, hairdresser, hairdresser_supply, hearing_aids, herbalist, massage, medical_supply, nutrition_supplements, optician, perfumery, or tattoo.\n\n**Hardware Shops**: https://gourdian.net/g/eric/osm_points_of_interest.hardware_shops\nShops points of interest labeled with agrarian, appliance, bathroom_furnishing, doityourself, electrical, energy, fireplace, florist, garden_centre, garden_furniture, gas, glaziery, groundskeeping, hardware, houseware, locksmith, paint, security, trade, or windows.\n\n**Furnishing Shops**: https://gourdian.net/g/eric/osm_points_of_interest.furnishing_shops\nShops points of interest labeled with antiques, bed, candles, carpet, curtain, doors, flooring, furniture, household_linen, interior_decoration, kitchen, lamps, lighting, tiles, or window_blind.\n\n**Electronics Shops**: https://gourdian.net/g/eric/osm_points_of_interest.electronics_shops\nShops points of interest labeled with computer, electronics, hifi, mobile_phone, radiotechnics, or vacuum_cleaner.\n\n**Vehicle and Outdoor Shops**: https://gourdian.net/g/eric/osm_points_of_interest.vehicle_and_outdoor_shops\nShops points of interest labeled with atv, bicycle, boat, car, car_repair, car_parts, caravan, fuel, fishing, golf, hunting, jetski, military_surplus, motorcycle, outdoor, scuba_diving, ski, snowmobile, sports, swimming_pool, trailer, or tyres.\n\n**Hobby Shops**: https://gourdian.net/g/eric/osm_points_of_interest.hobby_shops\nShops points of interest labeled with art, collector, craft, frame, games, model, music, musical_instrument, photo, camera, trophy, video, or video_games.\n\n**Stationary and Gift Shops**: https://gourdian.net/g/eric/osm_points_of_interest.stationary_and_gift_shops\nShops points of interest labeled with anime, books, gift, lottery, newsagent, stationery, or ticket.\n\n**Other Shops**: https://gourdian.net/g/eric/osm_points_of_interest.other_shops\nShops points of interest labeled with bookmaker, cannabis, copyshop, dry_cleaning, e-cigarette, funeral_directors, laundry, money_lender, party, pawnbroker, pet, pet_grooming, pest_control, pyrotechnics, religion, storage_rental, tobacco, toys, travel_agency, vacant, weapons, outpost, or user defined.\n\n\nA bit about what we're trying to build:\n\n* Filter (optional), click the button, CSV arrives on your hard drive\n* Downloads are always a single CSV, no bundles with weird directory structures, no other formats\n* CSVs are indexed and filterable by a few column types (lat/long and date/time at the moment), so you can download just the parts you want\n* Open licensed datasets are free to download\n* No signup required for downloading open datasets\n* Search within and across datasets\n\nFeedback welcome! If there are any datasets that you'd like to see added, let us know!", "link": "https://www.reddit.com/r/datascience/comments/mxpnac/gourdian_free_dataset_download_openstreetmap/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "gourdian free dataset download: openstreetmap points of interest (restaurants, bars, grocery stores, transit, shops, swingers clubs, hospitals, etc) /!/ hi there!\n\na friend and i are working on something to help people search for, filter, and download subsets of datasets.\n\nwe're excited to share that we've just incorporated all(?) of the points of interest from openstreetmap, broken down by group (from their ontologies here https://wiki.openstreetmap.org/wiki/key:amenity and here https://wiki.openstreetmap.org/wiki/key:shop )\n\nthe groups are below, with the tags that went into each. \n\nwhat do people think these might be useful for? maybe making your own version of walkscore? perhaps cross referencing with real estate listings to find a house that's within walking distance of a bakery, library, cafe, and pyrotechnics shop? lovehotelmapper.com? the possibilities are endless!\n\n**restaurants and bars**: https://gourdian.net/g/eric/osm_points_of_interest.restaurants_and_bars\namenities points of interest labeled with bar, biergarten, cafe, fast_food, food_court, ice_cream, pub, or restaurant.\n\n**education services**: https://gourdian.net/g/eric/osm_points_of_interest.education_services\namenities points of interest labeled with college, driving_school, kindergarten, language_school, library, toy_library, music_school, school, or university.\n\n**transportation related**: https://gourdian.net/g/eric/osm_points_of_interest.transportation_related\namenities points of interest labeled with bicycle_parking, bicycle_repair_station, bicycle_rental, boat_rental, boat_sharing, bus_station, car_rental, car_sharing, car_wash, vehicle_inspection, charging_station, ferry_terminal, fuel, grit_bin, motorcycle_parking, parking, parking_entrance, parking_space, or taxi.\n\n**financial**: https://gourdian.net/g/eric/osm_points_of_interest.financial\namenities points of interest labeled with atm, bank, or bureau_de_change.\n\n**healthcare facilities**: https://gourdian.net/g/eric/osm_points_of_interest.healthcare_facilities\namenities points of interest labeled with baby_hatch, clinic, dentist, doctors, hospital, nursing_home, pharmacy, social_facility, or veterinary.\n\n**entertainment**: https://gourdian.net/g/eric/osm_points_of_interest.entertainment\namenities points of interest labeled with arts_centre, brothel, casino, cinema, community_centre, conference_centre, events_venue, fountain, gambling, love_hotel, nightclub, planetarium, public_bookcase, social_centre, stripclub, studio, swingerclub, or theatre.\n\n**public services**: https://gourdian.net/g/eric/osm_points_of_interest.public_services\namenities points of interest labeled with courthouse, embassy, fire_station, police, post_box, post_depot, post_office, prison, ranger_station, or townhall.\n\n**facilities**: https://gourdian.net/g/eric/osm_points_of_interest.facilities\namenities points of interest labeled with bbq, bench, dog_toilet, drinking_water, give_box, shelter, shower, telephone, toilets, water_point, or watering_place.\n\n**waste management**: https://gourdian.net/g/eric/osm_points_of_interest.waste_management\namenities points of interest labeled with sanitary_dump_station, recycling, waste_basket, waste_disposal, or waste_transfer_station.\n\n**other amenities**: https://gourdian.net/g/eric/osm_points_of_interest.other_amenities\namenities points of interest labeled with animal_boarding, animal_breeding, animal_shelter, baking_oven, childcare, clock, crematorium, dive_centre, funeral_hall, grave_yard, gym, hunting_stand, internet_cafe, kitchen, kneipp_water_cure, lounger, marketplace, monastery, photo_booth, place_of_mourning, place_of_worship, public_bath, public_building, refugee_site, or vending_machine.\n\n**food shops**: https://gourdian.net/g/eric/osm_points_of_interest.food_shops\nshops points of interest labeled with alcohol, bakery, beverages, brewing_supplies, butcher, cheese, chocolate, coffee, confectionery, convenience, deli, dairy, farm, frozen_food, greengrocer, health_food, ice_cream, organic, pasta, pastry, seafood, spices, tea, wine, or water.\n\n**general shops**: https://gourdian.net/g/eric/osm_points_of_interest.general_shops\nshops points of interest labeled with department_store, general, kiosk, mall, supermarket, or wholesale.\n\n**clothing shops**: https://gourdian.net/g/eric/osm_points_of_interest.clothing_shops\nshops points of interest labeled with baby_goods, bag, boutique, clothes, fabric, fashion, fashion_accessories, jewelry, leather, sewing, shoes, tailor, watches, or wool.\n\n**second hand shops**: https://gourdian.net/g/eric/osm_points_of_interest.second_hand_shops\nshops points of interest labeled with charity, second_hand, or variety_store.\n\n**health and beauty shops**: https://gourdian.net/g/eric/osm_points_of_interest.health_and_beauty_shops\nshops points of interest labeled with beauty, chemist, cosmetics, drugstore, erotic, hairdresser, hairdresser_supply, hearing_aids, herbalist, massage, medical_supply, nutrition_supplements, optician, perfumery, or tattoo.\n\n**hardware shops**: https://gourdian.net/g/eric/osm_points_of_interest.hardware_shops\nshops points of interest labeled with agrarian, appliance, bathroom_furnishing, doityourself, electrical, energy, fireplace, florist, garden_centre, garden_furniture, gas, glaziery, groundskeeping, hardware, houseware, locksmith, paint, security, trade, or windows.\n\n**furnishing shops**: https://gourdian.net/g/eric/osm_points_of_interest.furnishing_shops\nshops points of interest labeled with antiques, -----> bed !!! , candles, carpet, curtain, doors, flooring, furniture, household_linen, interior_decoration, kitchen, lamps, lighting, tiles, or window_blind.\n\n**electronics shops**: https://gourdian.net/g/eric/osm_points_of_interest.electronics_shops\nshops points of interest labeled with computer, electronics, hifi, mobile_phone, radiotechnics, or vacuum_cleaner.\n\n**vehicle and outdoor shops**: https://gourdian.net/g/eric/osm_points_of_interest.vehicle_and_outdoor_shops\nshops points of interest labeled with atv, bicycle, boat, car, car_repair, car_parts, caravan, fuel, fishing, golf, hunting, jetski, military_surplus, motorcycle, outdoor, scuba_diving, ski, snowmobile, sports, swimming_pool, trailer, or tyres.\n\n**hobby shops**: https://gourdian.net/g/eric/osm_points_of_interest.hobby_shops\nshops points of interest labeled with art, collector, craft, frame, games, model, music, musical_instrument, photo, camera, trophy, video, or video_games.\n\n**stationary and gift shops**: https://gourdian.net/g/eric/osm_points_of_interest.stationary_and_gift_shops\nshops points of interest labeled with anime, books, gift, lottery, newsagent, stationery, or ticket.\n\n**other shops**: https://gourdian.net/g/eric/osm_points_of_interest.other_shops\nshops points of interest labeled with bookmaker, cannabis, copyshop, dry_cleaning, e-cigarette, funeral_directors, laundry, money_lender, party, pawnbroker, pet, pet_grooming, pest_control, pyrotechnics, religion, storage_rental, tobacco, toys, travel_agency, vacant, weapons, outpost, or user defined.\n\n\na bit about what we're trying to build:\n\n* filter (optional), click the button, csv arrives on your hard drive\n* downloads are always a single csv, no bundles with weird directory structures, no other formats\n* csvs are indexed and filterable by a few column types (lat/long and date/time at the moment), so you can download just the parts you want\n* open licensed datasets are free to download\n* no signup required for downloading open datasets\n* search within and across datasets\n\nfeedback welcome! if there are any datasets that you'd like to see added, let us know!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mxpnac/gourdian_free_dataset_download_openstreetmap/',)", "identifyer": 5596683, "year": "2021"}, {"autor": "synthphreak", "date": 1628519138000, "content": "Help! The relentless pursuit of DS has ravaged my personal life. How can I restore balance? /!/ **TL;DR:** I've worked incredibly hard from a rock-bottom starting point to break into this field. I succeeded, but in doing so, I've kinda lost touch with who I used to be and life as I used to live it. How can I balance the rigors of my new career with my desire to live an otherwise healthy, normal life outside of work?\n\n### My background, briefly\n\nI’m a mid-career professional at a large company with a liberal arts background. I’ve never studied CS, Stats, Math, or anything even remotely DS- or STEM-related. But a little under three years ago, I got bit by the DS bug (technically the ML bug, but I digress), and decided to go for it at all costs. I’m not getting any younger, ya know?\n\n### My journey towards DS (optional)\n\nSo I did some research, set out a 3-4 year plan to slowly but completely reinvent myself, and never looked back. And boy has it been intense, with me staying up until 1, 2, sometimes 3 AM almost every single night studying new ideas and skilling up. All while working full time and providing for/raising a family.\n\nI watched &gt;1500 videos on Khan Academy, many multiple times, and made sure to achieve “Mastery” on all quizzes and tests before proceeding. This is in addition to consulting many, many other online math resources, some with a DS/ML focus, including blogs, PDFs, articles, YouTube channels, and Delta Math. Where just a few years ago I didn’t know what “real number” meant, now I can speak pretty fluently about multivariable calculus, linear algebra, probability and statistics, I can read and intuit equations without much difficulty, and I consider myself at a high-ish undergraduate math proficiency. Advanced topics like backpropagation, PCA, and Bayesian estimation are now right at my level.\n\nI taught myself to code (Python, SQL, Unix), learned to use version control, learned about DS&amp;A, AWS, SWE best practices (ew, Agile!), and a bunch of other CS stuff like that. To date I think I’ve picked up fully 26 certificates from Coursera and similar on these various topics. These skills allowed me to stick my neck out at work and, trying to show motivation and potential, request minor data-oriented, \"engineering-lite\" tasks of increasingly complexity. In the end, these professional experiences were probably even more valuable than my 2 AM self-study, forcing me t o(1) put everything I was learning into practice to solve real-world problems, even if low-stakes ones, and (2) let others see my failures, shortcomings, and inexperience (and occasional successes!).\n\nOver time, people started to notice my efforts, and I was not subtle about m ambitions when asked. Then, just under two years into this journey, the ML engineering manager at my company said “We’re hiring engineers” and encouraged me to apply. So I did, and miraculously, I got it! Finally I was a real ML engineer in real industry R&amp;D, my first technical role ever. Two years ago I remember reviewing PEMDAS and Googling “What’s a server?”, and now I run deep learning experiments in the cloud, don’t flinch at words like “heteroscedastic” in ML research papers, and can reason about high-dimensional vector spaces. Life is crazy.\n\n### The problem\n\nI’ve never worked even close to this hard for anything in my entire life, but it has absolutely paid off and more quickly than my rosiest projections. I’ve discovered I am capable of many things I never thought possible just a few short years ago. And now, I literally get paid to do them. So in that sense, mine is a success story of which I’m incredibly proud. I regret nothing and would do it all again.\n\nOn the other hand though, getting here has taken tremendous sacrifices in my personal life that I didn’t foresee and now struggle to reverse. My uncompromising discipline and laser-focus w.r.t. self-study has actually become a liability, and now this discipline must swing the other way. But that’s easier said than done.\n\nFor example, I love my job so much + it’s so challenging for me that I often end up working long hours, so these days I’m barely reading the news, watching TV, or other chill quality-of-life activities like that. The Mrs. and I have little intimacy anymore because I’m always up so late reading, coding, or just thinking. I only check the mail like 1-2 times a week and clean the bathroom infrequently because my mind is always so preoccupied with DS that I just never think to. Likewise, I’ve become super bad at replying to texts and emails, because whenever I get the notifications I feel like I’m always in the middle of something, so I’m like “I’ll check later”, but just forget. When hanging out with friends or family, I sometimes struggle to talk about anything other than work or my studies because that's pretty much all that's ever on my mind. Perhaps most frustratingly, on those rare days when I’m exhausted and DO go to bed early, falling asleep takes forever because my mind just races in bed with thoughts of whatever I’m studying or working on. I used to crash the moment my head hit the pillow, but no longer.\n\nThings like this - some big, some small - are direct consequences of the lifestyle and mindset transformations that my relentless pursuit of DS has entailed. I’m certain of this. It has simply been all-consuming. But as I near the end of the curriculum I set out for myself three years ago, I’m starting to wonder if I can restore balance. Because as much as I love my shiny new career and marketability, and while I realize DS/ML entails a lifetime of learning, this intensity is unsustainable.\n\n### Fin\n\nThanks for sticking to the end of this poor sap's life story ha. Has anyone else ever experienced this? Are these feelings normal? If there are any success stories out there, I’d love to hear them, and tips for how to achieve the same. Maybe I should start a r/recoveringdatascientist sub lol.", "link": "https://www.reddit.com/r/datascience/comments/p12hxm/help_the_relentless_pursuit_of_ds_has_ravaged_my/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "help! the relentless pursuit of ds has ravaged my personal life. how can i restore balance? /!/ **tl;dr:** i've worked incredibly hard from a rock-bottom starting point to break into this field. i succeeded, but in doing so, i've kinda lost touch with who i used to be and life as i used to live it. how can i balance the rigors of my new career with my desire to live an otherwise healthy, normal life outside of work?\n\n### my background, briefly\n\ni’m a mid-career professional at a large company with a liberal arts background. i’ve never studied cs, stats, math, or anything even remotely ds- or stem-related. but a little under three years ago, i got bit by the ds bug (technically the ml bug, but i digress), and decided to go for it at all costs. i’m not getting any younger, ya know?\n\n### my journey towards ds (optional)\n\nso i did some research, set out a 3-4 year plan to slowly but completely reinvent myself, and never looked back. and boy has it been intense, with me staying up until 1, 2, sometimes 3 am almost every single night studying new ideas and skilling up. all while working full time and providing for/raising a family.\n\ni watched &gt;1500 videos on khan academy, many multiple times, and made sure to achieve “mastery” on all quizzes and tests before proceeding. this is in addition to consulting many, many other online math resources, some with a ds/ml focus, including blogs, pdfs, articles, youtube channels, and delta math. where just a few years ago i didn’t know what “real number” meant, now i can speak pretty fluently about multivariable calculus, linear algebra, probability and statistics, i can read and intuit equations without much difficulty, and i consider myself at a high-ish undergraduate math proficiency. advanced topics like backpropagation, pca, and bayesian estimation are now right at my level.\n\ni taught myself to code (python, sql, unix), learned to use version control, learned about ds&amp;a, aws, swe best practices (ew, agile!), and a bunch of other cs stuff like that. to date i think i’ve picked up fully 26 certificates from coursera and similar on these various topics. these skills allowed me to stick my neck out at work and, trying to show motivation and potential, request minor data-oriented, \"engineering-lite\" tasks of increasingly complexity. in the end, these professional experiences were probably even more valuable than my 2 am self-study, forcing me t o(1) put everything i was learning into practice to solve real-world problems, even if low-stakes ones, and (2) let others see my failures, shortcomings, and inexperience (and occasional successes!).\n\nover time, people started to notice my efforts, and i was not subtle about m ambitions when asked. then, just under two years into this journey, the ml engineering manager at my company said “we’re hiring engineers” and encouraged me to apply. so i did, and miraculously, i got it! finally i was a real ml engineer in real industry r&amp;d, my first technical role ever. two years ago i remember reviewing pemdas and googling “what’s a server?”, and now i run deep learning experiments in the cloud, don’t flinch at words like “heteroscedastic” in ml research papers, and can reason about high-dimensional vector spaces. life is crazy.\n\n### the problem\n\ni’ve never worked even close to this hard for anything in my entire life, but it has absolutely paid off and more quickly than my rosiest projections. i’ve discovered i am capable of many things i never thought possible just a few short years ago. and now, i literally get paid to do them. so in that sense, mine is a success story of which i’m incredibly proud. i regret nothing and would do it all again.\n\non the other hand though, getting here has taken tremendous sacrifices in my personal life that i didn’t foresee and now struggle to reverse. my uncompromising discipline and laser-focus w.r.t. self-study has actually become a liability, and now this discipline must swing the other way. but that’s easier said than done.\n\nfor example, i love my job so much + it’s so challenging for me that i often end up working long hours, so these days i’m barely reading the news, watching tv, or other chill quality-of-life activities like that. the mrs. and i have little intimacy anymore because i’m always up so late reading, coding, or just thinking. i only check the mail like 1-2 times a week and clean the bathroom infrequently because my mind is always so preoccupied with ds that i just never think to. likewise, i’ve become super bad at replying to texts and emails, because whenever i get the notifications i feel like i’m always in the middle of something, so i’m like “i’ll check later”, but just forget. when hanging out with friends or family, i sometimes struggle to talk about anything other than work or my studies because that's pretty much all that's ever on my mind. perhaps most frustratingly, on those rare days when i’m exhausted and do go to -----> bed !!!  early, falling asleep takes forever because my mind just races in -----> bed !!!  with thoughts of whatever i’m studying or working on. i used to crash the moment my head hit the pillow, but no longer.\n\nthings like this - some big, some small - are direct consequences of the lifestyle and mindset transformations that my relentless pursuit of ds has entailed. i’m certain of this. it has simply been all-consuming. but as i near the end of the curriculum i set out for myself three years ago, i’m starting to wonder if i can restore balance. because as much as i love my shiny new career and marketability, and while i realize ds/ml entails a lifetime of learning, this intensity is unsustainable.\n\n### fin\n\nthanks for sticking to the end of this poor sap's life story ha. has anyone else ever experienced this? are these feelings normal? if there are any success stories out there, i’d love to hear them, and tips for how to achieve the same. maybe i should start a r/recoveringdatascientist sub lol.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 11, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/p12hxm/help_the_relentless_pursuit_of_ds_has_ravaged_my/',)", "identifyer": 5597719, "year": "2021"}], "name": "beddatascience2021"}