{"interestingcomments": [{"autor": "atrninicc", "date": 1625145020000, "content": "I Suck At Data Science - Looking For Advice /!/ If you got some time, hear me out, any advice would help me. I'm 21 years old. I finished highschool and started working in medium size company (300+ employees) as a computer service technician. At the same time I enrolled in collage (Now I'm 3rd year - Programming and software engineering). I was working there for about 1.5 years. About 3 months ago I'm promoted to Data Scientist because I've shown interest in that \"branch\" of programming. \n\nMy boss expected from me to work on complex projects, though I don't have past experience in data science. We primarily work in Python, Tensorflow and OpenCV. I have a desire and motivation to learn but everybody around me acts like they hired Data Science Engineer though my salary is less then 400$. \n\nI actually want to get better at this but I struggle to keep my motivation high with all that demotivation around me.\n\nAny advice would help me.\n\nIf you have any advice what to study and how feel free to comment.\n\nAlso, I want to hear your opinion, would you work for less then 400$ as a Data Scientist.\n\nThank you guys.\n\n[View Poll](https://www.reddit.com/poll/obliob)", "link": "https://www.reddit.com/r/datascience/comments/obliob/i_suck_at_data_science_looking_for_advice/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "i suck at data science - looking for advice /!/ if you got some time, hear me out, any advice would help me. i'm 21 years old. i finished highschool and started working in medium size company (300+ employees) as a computer service technician. at the same time i enrolled in collage (now i'm 3rd year - programming and software engineering). i was working there for about 1.5 years. about 3 months ago i'm promoted to data scientist because i've shown interest in that \"-----> branch !!! \" of programming. \n\nmy boss expected from me to work on complex projects, though i don't have past experience in data science. we primarily work in python, tensorflow and opencv. i have a desire and motivation to learn but everybody around me acts like they hired data science engineer though my salary is less then 400$. \n\ni actually want to get better at this but i struggle to keep my motivation high with all that demotivation around me.\n\nany advice would help me.\n\nif you have any advice what to study and how feel free to comment.\n\nalso, i want to hear your opinion, would you work for less then 400$ as a data scientist.\n\nthank you guys.\n\n[view poll](https://www.reddit.com/poll/obliob)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/obliob/i_suck_at_data_science_looking_for_advice/',)", "identifyer": 5586773, "year": "2021"}, {"autor": "kk7nc", "date": 1625078724000, "content": "Toward Knowledge Discovery Framework for Data Science Job Market in the United States /!/ &amp;#x200B;\n\nhttps://i.redd.it/14i1fen97g871.gif\n\n \n\n## Toward Knowledge Discovery Framework for Data Science Job Market in the United States\n\nThe growth of the data science field requires better tools to understand such a fast-paced growing domain. Moreover, individuals from different backgrounds became interested in following a career as data scientists. Therefore, providing a quantitative guide for individuals and organizations to understand the skills required in the job market would be crucial. This paper introduces a framework to analyze the job market for data science-related jobs within the US while providing an interface to access insights in this market. The proposed framework includes three sub-modules allowing continuous data collection, information extraction, and a web-based dashboard visualization to investigate the spatial and temporal distribution of data science-related jobs and skills. The result of this work shows important skills for the main branches of data science jobs and attempts to provide a skill-based definition of these data science branches. The current version of this application is deployed on the web and allows individuals and institutes to investigate skills required for data science positions through the industry lens.\n\n## Method\n\n### Overview of data science skill tracking system\n\nThe figure shows an overview of the proposed system. Each of these modules will be described in more detail in the following. As it can be seen in this Figure, this system heavily relies on cloud computing structures that provide stable facilities for continuous tasks with scheduling to collect, analyze, and present its findings dynamically.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7ja61cyk7g871.png?width=1073&amp;format=png&amp;auto=webp&amp;s=6044688fe26178a0022bb19896a7f45b9c64d985\n\n### Data Collection Sample\n\nThis shows samples of the returned fields for queries on data analysts. For a framework like the one presented, it is not feasible to use a local machine for data collection as it requires to work continuously for a long period of time with no interruptions (such as internet disconnection or power outage, etc.). Such a machine and maintaining its connectivity would cause a lot of hassle and scrapy cloud services solve this problem by understanding the data collection framework. It allows to create periodic jobs to continuously collect the data using this platform. This module runs its data collection spiders every week and samples job postings on the web periodically. The results of these queries are then delivered into a mysql database on Amazon web services (AWS) for further processing that will be explained in the next section.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/730j1q5m7g871.png?width=1177&amp;format=png&amp;auto=webp&amp;s=ea6d4798cae91bd0e61ca515494c883d56d67ca3\n\n### Interaction graph of visualization components\n\nThe effect and interactions between these components are complex. Figure shows these interactions in our dash model. As it can be seen the spatial and temporal aspect of skills could be investigated by using these components. Other components would be added as the work continues.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6kqodcfn7g871.png?width=891&amp;format=png&amp;auto=webp&amp;s=66d03e66d4eb226f2dd6323aebc124bcb5ff6758\n\n### Top 20 results based on no. job by states and company\n\nThis Table shows the top 20 companies during this period. Despite the expectation that tech sector dominate the field, it appears that other sectors contribute to this market significantly. Namely, consultant and advisory section (e.g. Booz Allen, Deloitte)and financial institutes(e.g JPMorgan, Wells Fargo) and government organization contribute significantly to this market along with the tech sector.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p85utw8o7g871.png?width=787&amp;format=png&amp;auto=webp&amp;s=e95b15d43045b194660983296a6f092e4433d308\n\n### Top skills for the three main tracks\n\nThis Table shows the top 20 skills in each job posting category. The result in this table clearly shows the difference between these main tracks of data science. While machine learning engineer job postings mostly shows a domination of skills such as programming, machine learning, cloud, and big data technologies, a data analyst mostly needs skills for data retrieving (e.g. SQL, Excel,database), and Visualization (e.g Tableau, Power BI).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/434pusrp7g871.png?width=971&amp;format=png&amp;auto=webp&amp;s=ef20eeac233a97c50544d1b6f575a8d4480dc173\n\n### Temporal insights of data science skills\n\nLeft Figure shows this comparison between top programming languages mentioned during this period.As it can be seen, the top language is python following by R and Java. This indicated not only python is the most dominant language but the trend and the gap shows it appears to be in demand in future in comparison to others. Similarly, a comparison between deep learning framework is presented in right Figure. The result shows that tensorflow followed by pytorch are the most mentioned deep learning frameworks. Also H2O\\~(an R based package) is mentioned much less which indicates the overwhelming attention to python for deep learning. As it can be seen, the framework allows temporal insights to this job market and based on their general importance, such insights can be added to the interface designed for users.\n\n&amp;#x200B;\n\n## Conclusion\n\nThis paper introduces a framework capable of collecting and analysing of spatial and temporal aspects of data science's job market using available tools within data science toolbox. The framework provides a free front-end interface developed using plotly dash for this market. The result provides a quantitative guide for individuals and organizations to recognize the most important skills and concepts in this domain based on industry perception. Possible extension to the work here includes sector analysis of job posting and improving on skill extraction technique. Other temporal insights will be added to the interface based on the importance of the information they can add for individuals using this interface.\n\n## Error and Comments:\n\nSend an email to [mh4pk@virginia.edu](mailto:mh4pk@virginia.edu)\n\n&amp;#x200B;\n\n**GitHub:** [**https://github.com/mojtaba-Hsafa/data-science-jobs-app**](https://github.com/mojtaba-Hsafa/data-science-jobs-app)", "link": "https://www.reddit.com/r/datascience/comments/ob3pp7/toward_knowledge_discovery_framework_for_data/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "toward knowledge discovery framework for data science job market in the united states /!/ &amp;#x200b;\n\nhttps://i.redd.it/14i1fen97g871.gif\n\n \n\n## toward knowledge discovery framework for data science job market in the united states\n\nthe growth of the data science field requires better tools to understand such a fast-paced growing domain. moreover, individuals from different backgrounds became interested in following a career as data scientists. therefore, providing a quantitative guide for individuals and organizations to understand the skills required in the job market would be crucial. this paper introduces a framework to analyze the job market for data science-related jobs within the us while providing an interface to access insights in this market. the proposed framework includes three sub-modules allowing continuous data collection, information extraction, and a web-based dashboard visualization to investigate the spatial and temporal distribution of data science-related jobs and skills. the result of this work shows important skills for the main -----> branches !!!  of data science jobs and attempts to provide a skill-based definition of these data science -----> branches !!! . the current version of this application is deployed on the web and allows individuals and institutes to investigate skills required for data science positions through the industry lens.\n\n## method\n\n### overview of data science skill tracking system\n\nthe figure shows an overview of the proposed system. each of these modules will be described in more detail in the following. as it can be seen in this figure, this system heavily relies on cloud computing structures that provide stable facilities for continuous tasks with scheduling to collect, analyze, and present its findings dynamically.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/7ja61cyk7g871.png?width=1073&amp;format=png&amp;auto=webp&amp;s=6044688fe26178a0022bb19896a7f45b9c64d985\n\n### data collection sample\n\nthis shows samples of the returned fields for queries on data analysts. for a framework like the one presented, it is not feasible to use a local machine for data collection as it requires to work continuously for a long period of time with no interruptions (such as internet disconnection or power outage, etc.). such a machine and maintaining its connectivity would cause a lot of hassle and scrapy cloud services solve this problem by understanding the data collection framework. it allows to create periodic jobs to continuously collect the data using this platform. this module runs its data collection spiders every week and samples job postings on the web periodically. the results of these queries are then delivered into a mysql database on amazon web services (aws) for further processing that will be explained in the next section.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/730j1q5m7g871.png?width=1177&amp;format=png&amp;auto=webp&amp;s=ea6d4798cae91bd0e61ca515494c883d56d67ca3\n\n### interaction graph of visualization components\n\nthe effect and interactions between these components are complex. figure shows these interactions in our dash model. as it can be seen the spatial and temporal aspect of skills could be investigated by using these components. other components would be added as the work continues.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/6kqodcfn7g871.png?width=891&amp;format=png&amp;auto=webp&amp;s=66d03e66d4eb226f2dd6323aebc124bcb5ff6758\n\n### top 20 results based on no. job by states and company\n\nthis table shows the top 20 companies during this period. despite the expectation that tech sector dominate the field, it appears that other sectors contribute to this market significantly. namely, consultant and advisory section (e.g. booz allen, deloitte)and financial institutes(e.g jpmorgan, wells fargo) and government organization contribute significantly to this market along with the tech sector.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/p85utw8o7g871.png?width=787&amp;format=png&amp;auto=webp&amp;s=e95b15d43045b194660983296a6f092e4433d308\n\n### top skills for the three main tracks\n\nthis table shows the top 20 skills in each job posting category. the result in this table clearly shows the difference between these main tracks of data science. while machine learning engineer job postings mostly shows a domination of skills such as programming, machine learning, cloud, and big data technologies, a data analyst mostly needs skills for data retrieving (e.g. sql, excel,database), and visualization (e.g tableau, power bi).\n\n&amp;#x200b;\n\nhttps://preview.redd.it/434pusrp7g871.png?width=971&amp;format=png&amp;auto=webp&amp;s=ef20eeac233a97c50544d1b6f575a8d4480dc173\n\n### temporal insights of data science skills\n\nleft figure shows this comparison between top programming languages mentioned during this period.as it can be seen, the top language is python following by r and java. this indicated not only python is the most dominant language but the trend and the gap shows it appears to be in demand in future in comparison to others. similarly, a comparison between deep learning framework is presented in right figure. the result shows that tensorflow followed by pytorch are the most mentioned deep learning frameworks. also h2o\\~(an r based package) is mentioned much less which indicates the overwhelming attention to python for deep learning. as it can be seen, the framework allows temporal insights to this job market and based on their general importance, such insights can be added to the interface designed for users.\n\n&amp;#x200b;\n\n## conclusion\n\nthis paper introduces a framework capable of collecting and analysing of spatial and temporal aspects of data science's job market using available tools within data science toolbox. the framework provides a free front-end interface developed using plotly dash for this market. the result provides a quantitative guide for individuals and organizations to recognize the most important skills and concepts in this domain based on industry perception. possible extension to the work here includes sector analysis of job posting and improving on skill extraction technique. other temporal insights will be added to the interface based on the importance of the information they can add for individuals using this interface.\n\n## error and comments:\n\nsend an email to [mh4pk@virginia.edu](mailto:mh4pk@virginia.edu)\n\n&amp;#x200b;\n\n**github:** [**https://github.com/mojtaba-hsafa/data-science-jobs-app**](https://github.com/mojtaba-hsafa/data-science-jobs-app)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ob3pp7/toward_knowledge_discovery_framework_for_data/',)", "identifyer": 5586810, "year": "2021"}, {"autor": "SloppyPuppy", "date": 1627684016000, "content": "Question about setecting reduction of a measure over time that also has seasonality /!/ Hi, I hope this is not too long and cumbersome, but maybe maybe you can help me in guiding me in the right direction or maybe completely change my way of thinking about this problem.\n\nThis question can basically apply to any topic either be it Internet traffic each day for customer, customers entering a shop branch on daily basis, daily product sales, Ad click-through rate daily etc...\n\nAssuming I have many products I sell. I'm measuring each product's sales per day.\nI want to be able to detect when a product suddenly stops selling less than usual. But many of my products are seasonal. Meaning they have seasons of high sales and seasons of low sales. A season can be summer/winter, weekdays/weekends, end of month/middle of month...\nBut also there might be seasons I'm not aware of that exist that probably correlate to some weird unexpected stuff like end of Overwatch seasons, when Belle Delphine releases a new sex video (lol), when the Royal Caribbean cruises begin... etc... (seasons that are unexpected, obscure or even unknown by me but do strongly manifest in the data)\n\nI want to be able to incorporate the seasons somehow in my alert system.\n[Example of seasons and alerts](https://imgur.com/a/J6ZkaDl)\nI want the system to automatically detect seasons for each product. There can be more than 2 seasons. The alerting system should compare the current day's data with the appropriate season and alert should be relevant to that season. No point in alerting on transitions from a high season to low season for example.\n\nMy first though was applying a simple k-means clustering algorithm that for each product will produce some groups of days of the year (or 2 years). and each day that comes should fall into a category. From there its simply checking today's amount of sales against that seasons' mean and normal deviation and if it passes a certain sigma - alert.\nbut then I thought k-means is kinda suited for a scatter plot style data. in my data theres nothing to scatter basically. so maybe it wont be grouping the days correctly.\n\nMy Second Thought was maybe generating a prediction amount of sales for the following days and if the current amount of sales is too much different than the prediction then alert. But then I though... yeah its probably not going to take seasonality into consideration quite well.\n\nAlso there is Change Point Detection thing - but this puts high emphasis on the last few days and probably disregards seasons like summer / winter etc...\n\nWhat do you think would be a good approach to this problem? is it just a simple statistical calculation of mean and standard deviation? or it can be solved Machine Learning style?\n\nThanks a lot in advance!", "link": "https://www.reddit.com/r/datascience/comments/ouvcwd/question_about_setecting_reduction_of_a_measure/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "question about setecting reduction of a measure over time that also has seasonality /!/ hi, i hope this is not too long and cumbersome, but maybe maybe you can help me in guiding me in the right direction or maybe completely change my way of thinking about this problem.\n\nthis question can basically apply to any topic either be it internet traffic each day for customer, customers entering a shop -----> branch !!!  on daily basis, daily product sales, ad click-through rate daily etc...\n\nassuming i have many products i sell. i'm measuring each product's sales per day.\ni want to be able to detect when a product suddenly stops selling less than usual. but many of my products are seasonal. meaning they have seasons of high sales and seasons of low sales. a season can be summer/winter, weekdays/weekends, end of month/middle of month...\nbut also there might be seasons i'm not aware of that exist that probably correlate to some weird unexpected stuff like end of overwatch seasons, when belle delphine releases a new sex video (lol), when the royal caribbean cruises begin... etc... (seasons that are unexpected, obscure or even unknown by me but do strongly manifest in the data)\n\ni want to be able to incorporate the seasons somehow in my alert system.\n[example of seasons and alerts](https://imgur.com/a/j6zkadl)\ni want the system to automatically detect seasons for each product. there can be more than 2 seasons. the alerting system should compare the current day's data with the appropriate season and alert should be relevant to that season. no point in alerting on transitions from a high season to low season for example.\n\nmy first though was applying a simple k-means clustering algorithm that for each product will produce some groups of days of the year (or 2 years). and each day that comes should fall into a category. from there its simply checking today's amount of sales against that seasons' mean and normal deviation and if it passes a certain sigma - alert.\nbut then i thought k-means is kinda suited for a scatter plot style data. in my data theres nothing to scatter basically. so maybe it wont be grouping the days correctly.\n\nmy second thought was maybe generating a prediction amount of sales for the following days and if the current amount of sales is too much different than the prediction then alert. but then i though... yeah its probably not going to take seasonality into consideration quite well.\n\nalso there is change point detection thing - but this puts high emphasis on the last few days and probably disregards seasons like summer / winter etc...\n\nwhat do you think would be a good approach to this problem? is it just a simple statistical calculation of mean and standard deviation? or it can be solved machine learning style?\n\nthanks a lot in advance!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('self',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ouvcwd/question_about_setecting_reduction_of_a_measure/',)", "identifyer": 5587102, "year": "2021"}, {"autor": "MCS66", "date": 1635484491000, "content": "Why does it seem like a lot of Data Scientists were international students? /!/ This is NOT supposed to be offensive at all. It’s a geniune question. When I look around on linkedin or even google youtube videos about people who work as “Data Scientists,” especially at Big Tech firm they always seem to work in U.S. branches of the company but are originally from outside the U.S. (Asia, Europe). I was wondering if this is a true pattern and why? Do companies often look for people who are not from the U.S.?", "link": "https://www.reddit.com/r/datascience/comments/qi5dez/why_does_it_seem_like_a_lot_of_data_scientists/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "why does it seem like a lot of data scientists were international students? /!/ this is not supposed to be offensive at all. it’s a geniune question. when i look around on linkedin or even google youtube videos about people who work as “data scientists,” especially at big tech firm they always seem to work in u.s. -----> branches !!!  of the company but are originally from outside the u.s. (asia, europe). i was wondering if this is a true pattern and why? do companies often look for people who are not from the u.s.?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 75, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/qi5dez/why_does_it_seem_like_a_lot_of_data_scientists/',)", "identifyer": 5587728, "year": "2021"}, {"autor": "Mindful_Scribe", "date": 1624970416000, "content": "Advice on Learning Text Generation /!/ As I try and branch out a little into areas I don't know that much about, I want to do a personal project where I take a bunch of Reddit posts and comments from a single subreddit, and come up with some code that will generate an original short post or comment that is consistent with the content in the subreddit.   Secondarily, maybe it could produce a post or comment that is consistent with a subset of posts; say, posts that tend negative or posts made by the most prolific user, or something like that.  After that, maybe look at next sentence prediction and so forth.\n\nHaven't thought those later parts through, so my first objective is just to be able to take a corpus of say six months of posts and produce a short original text from that corpus.  This isn't something for production in an app or anything, just a learning project for me to try and grasp the fundamentals of text generation.\n\nThis is a completely new area to me though and I'm quickly overwhelmed reading about the multitude of frameworks and tools - GPT-2, GPT-2, BERT, god knows what else.    Can someone point me to either a decent introduction/tutorial to text generation or even to a course being offered?\n\nI'm trying to take the advice of building a real personal project outside of my comfort zone, and this is pretty darn outside my comfort zone.", "link": "https://www.reddit.com/r/datascience/comments/oa7gt9/advice_on_learning_text_generation/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "advice on learning text generation /!/ as i try and -----> branch !!!  out a little into areas i don't know that much about, i want to do a personal project where i take a bunch of reddit posts and comments from a single subreddit, and come up with some code that will generate an original short post or comment that is consistent with the content in the subreddit.   secondarily, maybe it could produce a post or comment that is consistent with a subset of posts; say, posts that tend negative or posts made by the most prolific user, or something like that.  after that, maybe look at next sentence prediction and so forth.\n\nhaven't thought those later parts through, so my first objective is just to be able to take a corpus of say six months of posts and produce a short original text from that corpus.  this isn't something for production in an app or anything, just a learning project for me to try and grasp the fundamentals of text generation.\n\nthis is a completely new area to me though and i'm quickly overwhelmed reading about the multitude of frameworks and tools - gpt-2, gpt-2, bert, god knows what else.    can someone point me to either a decent introduction/tutorial to text generation or even to a course being offered?\n\ni'm trying to take the advice of building a real personal project outside of my comfort zone, and this is pretty darn outside my comfort zone.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oa7gt9/advice_on_learning_text_generation/',)", "identifyer": 5587783, "year": "2021"}, {"autor": "ElonVlogger", "date": 1631570216000, "content": "Bootcamp. /!/ I hope you're doing well. I am started in history studies but I do not have a career plan at the moment. however since college I have been interested in tech. and recently I have been interested in big data business branches and in particular data scientist. here in paris we have the Jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "link": "https://www.reddit.com/r/datascience/comments/pnpe0v/bootcamp/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "bootcamp. /!/ i hope you're doing well. i am started in history studies but i do not have a career plan at the moment. however since college i have been interested in tech. and recently i have been interested in big data business -----> branches !!!  and in particular data scientist. here in paris we have the jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pnpe0v/bootcamp/',)", "identifyer": 5588696, "year": "2021"}, {"autor": "ElonVlogger", "date": 1631569794000, "content": "Bootcamp? /!/ I hope you're doing well. I am started in history studies but I do not have a career plan at the moment. however since college I have been interested in tech. and recently I have been interested in big data business branches and in particular data scientist. here in paris we have the Jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "link": "https://www.reddit.com/r/datascience/comments/pnp9gb/bootcamp/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "bootcamp? /!/ i hope you're doing well. i am started in history studies but i do not have a career plan at the moment. however since college i have been interested in tech. and recently i have been interested in big data business -----> branches !!!  and in particular data scientist. here in paris we have the jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pnp9gb/bootcamp/',)", "identifyer": 5588697, "year": "2021"}, {"autor": "ElonVlogger", "date": 1631566626000, "content": "Bootcamp? /!/ Hi everyone, I hope you're doing well. I am started in history studies but I do not have a career plan at the moment. however since college I have been interested in tech. and recently I have been interested in big data business branches and in particular data scientist. here in paris we have the Jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "link": "https://www.reddit.com/r/datascience/comments/pno8uo/bootcamp/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "bootcamp? /!/ hi everyone, i hope you're doing well. i am started in history studies but i do not have a career plan at the moment. however since college i have been interested in tech. and recently i have been interested in big data business -----> branches !!!  and in particular data scientist. here in paris we have the jedha bootcamp, what do you think of the bootcamp for those who have not studied to be a data scientist? good to you", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pno8uo/bootcamp/',)", "identifyer": 5588700, "year": "2021"}, {"autor": "multicm", "date": 1611076115000, "content": "Handling situations where models are obvious or there is no clear model to use? /!/ I am transitioning from a data analyst to a data scientist within my company and they have informed me with this transition they want to see more predictive analytics. I work in the financial services industry so they want to see projects like \"where should we open a new branch?\" (Just an example).\n\nNow I understand that I can look at the demographics of our current branches and find sites which look similar but the topic of \"where to open a branch\" is very large using lots of different factors; other nearby FIs, Population, Traffic, etc. I have ran close to 30 different factors through a regression to see which of these matter the most to branch profitability and every branch is different. We have branches in small town USA which are doing fantastic and branches in major cities which are struggling. This project seems way too vast to be handled by plugging demographics into an algorithm and saying \"yes\" or \"no\"\n\nThis was just one example, but there are lots of other projects we discussed which have similar issues to this.\n\nOne other example is next best product, I used the apriori algorithm on our customer data and the only results I got were along the lines of \"If they are a teenager, maybe they want Teen Checking\" or \"If they have a checking account, maybe they want a debit card\". All of the results were ideas than any marketing department without a data scientist could have come up with.\n\nAny feedback would be appreciated", "link": "https://www.reddit.com/r/datascience/comments/l0o4t0/handling_situations_where_models_are_obvious_or/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "handling situations where models are obvious or there is no clear model to use? /!/ i am transitioning from a data analyst to a data scientist within my company and they have informed me with this transition they want to see more predictive analytics. i work in the financial services industry so they want to see projects like \"where should we open a new -----> branch !!! ?\" (just an example).\n\nnow i understand that i can look at the demographics of our current branches and find sites which look similar but the topic of \"where to open a branch\" is very large using lots of different factors; other nearby fis, population, traffic, etc. i have ran close to 30 different factors through a regression to see which of these matter the most to branch profitability and every branch is different. we have branches in small town usa which are doing fantastic and branches in major cities which are struggling. this project seems way too vast to be handled by plugging demographics into an algorithm and saying \"yes\" or \"no\"\n\nthis was just one example, but there are lots of other projects we discussed which have similar issues to this.\n\none other example is next best product, i used the apriori algorithm on our customer data and the only results i got were along the lines of \"if they are a teenager, maybe they want teen checking\" or \"if they have a checking account, maybe they want a debit card\". all of the results were ideas than any marketing department without a data scientist could have come up with.\n\nany feedback would be appreciated", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/l0o4t0/handling_situations_where_models_are_obvious_or/',)", "identifyer": 5588877, "year": "2021"}, {"autor": "CKL-IT", "date": 1611536750000, "content": "720+ new NLP models, 300+ supported languages, translation, summarization, question answering and more with T5 and Marian models! - John Snow Labs NLU 1.1.0 /!/ &amp;#x200B;\n\n\\# 720+ new  NLP models, 300+ supported languages, translation, summarization, question answering and more with T5 and Marian models!  - John Snow Labs NLU 1.1.0\n\n&amp;#x200B;\n\n\\##  NLU 1.1.0 Release Notes\n\n&amp;#x200B;\n\nWe are incredibly excited to release NLU 1.1.0!\n\nThis release integrates the 720+ new models from the latest \\[Spark-NLP 2.7.0 + releases\\]([https://github.com/JohnSnowLabs/spark-nlp/releases](https://github.com/JohnSnowLabs/spark-nlp/releases))\n\nYou can now achieve state-of-the-art results with Sequence2Sequence transformers on problems like text summarization, question answering, translation between  192+ languages, and extract Named Entity in various Right to Left written languages like  Arabic, Persian, Urdu, and languages that require segmentation like Koreas, Japanese, Chinese, and many more in 1 line of code!     \n\nThese new features are possible because of the integration of the \\[Google's T5 models\\]([https://ai.googleblog.com/2020/02/exploring-transfer-learning-with-t5.html](https://ai.googleblog.com/2020/02/exploring-transfer-learning-with-t5.html)) and \\[Microsoft's Marian models\\]([https://marian-nmt.github.io/publications/](https://marian-nmt.github.io/publications/))  transformers.\n\n&amp;#x200B;\n\nNLU 1.1.0 has over 720+ new pretrained models and pipelines while extending the support of multi-lingual models to 192+ languages such as Chinese, Japanese, Korean, Arabic, Persian, Urdu, and Hebrew.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIn addition to this, NLU 1.1.0 comes with 9 new notebooks showcasing training classifiers for various review and sentiment datasets and 7 notebooks for the new features and models.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\### NLU 1.1.0  New Features\n\n\\* \\*\\*720+\\*\\* new models you can find an overview of all NLU models \\[here\\]([https://nlu.johnsnowlabs.com/docs/en/namespace](https://nlu.johnsnowlabs.com/docs/en/namespace)) and further documentation in the \\[models hub\\]([https://nlp.johnsnowlabs.com/models](https://nlp.johnsnowlabs.com/models))\n\n\\* \\*\\*NEW:\\*\\* Introducing MarianTransformer annotator for machine translation based on MarianNMT models. Marian is an efficient, free Neural Machine Translation framework mainly being developed by the Microsoft Translator team (646+ pretrained models &amp; pipelines in 192+ languages)\n\n\\* \\*\\*NEW:\\*\\* Introducing T5Transformer annotator for Text-To-Text Transfer Transformer (Google T5) models to achieve state-of-the-art results on multiple NLP tasks such as Translation, Summarization, Question Answering, Sentence Similarity, and so on\n\n\\* \\*\\*NEW:\\*\\* Introducing brand new and refactored language detection and identification models. The new LanguageDetectorDL is faster, more accurate, and supports up to 375 languages\n\n\\* \\*\\*NEW:\\*\\* Introducing WordSegmenter model for word segmentation of languages without any rule-based tokenization such as Chinese, Japanese, or Korean\n\n\\* \\*\\*NEW:\\*\\* Introducing DocumentNormalizer component for cleaning content from HTML or XML documents, applying either data cleansing using an arbitrary number of custom regular expressions either data extraction following the different parameters\n\n&amp;#x200B;\n\n\\## Translation\n\n\\[Translation example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/translation\\_demo.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/translation_demo.ipynb))       \n\nYou can translate between more than 192 Languages pairs with the \\[Marian Models\\]([https://marian-nmt.github.io/publications/](https://marian-nmt.github.io/publications/))\n\nYou need to specify the language your data is in as \\`start\\_language\\` and the language you want to translate to as \\`target\\_language\\`.    \n\nThe language references must be \\[ISO language codes\\]([https://en.wikipedia.org/wiki/List\\_of\\_ISO\\_639-1\\_codes](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes))\n\n&amp;#x200B;\n\n\\`nlu.load('&lt;start\\_language&gt;.translate.&lt;target\\_language&gt;')\\`\n\n&amp;#x200B;\n\n\\*\\*Translate English to French :\\*\\*     \n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.fr').predict(\"Hello from John Snow Labs\")\n\n\\&gt;&gt;&gt; Output: Bonjour des laboratoires de neige de John!\t \n\n&amp;#x200B;\n\n\\`\\`\\`\n\n\\*\\*Translate English to Inukitut :\\*\\*     \n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.lu').predict(\"Hello from John Snow Labs\")\n\n\\&gt;&gt;&gt; Output: kalunganyembo ka mashika makamankate \n\n\\`\\`\\`\n\n\\*\\*Translate English to Hungarian :\\*\\*\n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.hu').predict(\"Hello from John Snow Labs\")\n\n\\&gt;&gt;&gt; Output: Helló John hó laborjából.\n\n\\`\\`\\`\n\n\\*\\*Translate English to German :\\*\\*\n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.de').predict(\"Hello from John Snow Labs!\")\n\n\\&gt;&gt;&gt; Output: Hallo aus John Schnee Labors \n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\ntranslate\\_pipe = nlu.load('en.translate\\_to.de')\n\ndf = translate\\_pipe.predict('Billy likes to go to the mall every sunday')\n\ndf\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n|\tsentence|\ttranslation|\n\n|-----------|--------------|\n\n|Billy likes to go to the mall every sunday\t| Billy geht gerne jeden Sonntag ins Einkaufszentrum|\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## T5\n\n\\[Example of every T5 task\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more))\n\n\\### Overview of every task available with T5\n\n\\[The T5 model\\]([https://arxiv.org/pdf/1910.10683.pdf](https://arxiv.org/pdf/1910.10683.pdf)) is trained on various datasets for 17 different tasks which fall into 8 categories.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n1. Text summarization\n\n2. Question answering\n\n3. Translation\n\n4. Sentiment analysis\n\n5. Natural Language inference\n\n6. Coreference resolution\n\n7. Sentence Completion\n\n8. Word sense disambiguation\n\n&amp;#x200B;\n\n\\### Every T5 Task with explanation:\n\n&amp;#x200B;\n\n|Task Name | Explanation | \n\n|----------|--------------|\n\n|\\[1.CoLA\\]([https://nyu-mll.github.io/CoLA/](https://nyu-mll.github.io/CoLA/))                   | Classify if a sentence is gramaticaly correct|\n\n|\\[2.RTE\\]([https://dl.acm.org/doi/10.1007/11736790\\_9](https://dl.acm.org/doi/10.1007/11736790_9))                    | Classify whether if a statement can be deducted from a sentence|\n\n|\\[3.MNLI\\]([https://arxiv.org/abs/1704.05426](https://arxiv.org/abs/1704.05426))                   | Classify for a hypothesis and premise whether they contradict or contradict each other or neither of both (3 class).|\n\n|\\[4.MRPC\\]([https://www.aclweb.org/anthology/I05-5002.pdf](https://www.aclweb.org/anthology/I05-5002.pdf))                   | Classify whether a pair of sentences is a re-phrasing of each other (semantically equivalent)|\n\n|\\[5.QNLI\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf))                   | Classify whether the answer to a question can be deducted from an answer candidate.|\n\n|\\[6.QQP\\]([https://www.quora.com/q/quoradata/First-Quora-Dataset-Release-Question-Pairs](https://www.quora.com/q/quoradata/First-Quora-Dataset-Release-Question-Pairs))                    | Classify whether a pair of questions is a re-phrasing of each other (semantically equivalent)|\n\n|\\[7.SST2\\]([https://www.aclweb.org/anthology/D13-1170.pdf](https://www.aclweb.org/anthology/D13-1170.pdf))                   | Classify the sentiment of a sentence as positive or negative|\n\n|\\[8.STSB\\]([https://www.aclweb.org/anthology/S17-2001/](https://www.aclweb.org/anthology/S17-2001/))                   | Classify the sentiment of a sentence on a scale from 1 to 5 (21 Sentiment classes)|\n\n|\\[9.CB\\]([https://ojs.ub.uni-konstanz.de/sub/index.php/sub/article/view/601](https://ojs.ub.uni-konstanz.de/sub/index.php/sub/article/view/601))                     | Classify for a premise and a hypothesis whether they contradict each other or not (binary).|\n\n|\\[10.COPA\\]([https://www.aaai.org/ocs/index.php/SSS/SSS11/paper/view/2418/0](https://www.aaai.org/ocs/index.php/SSS/SSS11/paper/view/2418/0))                   | Classify for a question, premise, and 2 choices which choice the correct choice is (binary).|\n\n|\\[11.MultiRc\\]([https://www.aclweb.org/anthology/N18-1023.pdf](https://www.aclweb.org/anthology/N18-1023.pdf))                | Classify for a question, a paragraph of text, and an answer candidate, if the answer is correct (binary),|\n\n|\\[12.WiC\\]([https://arxiv.org/abs/1808.09121](https://arxiv.org/abs/1808.09121))                    | Classify for a pair of sentences and a disambigous word if the word has the same meaning in both sentences.|\n\n|\\[13.WSC/DPR\\]([https://www.aaai.org/ocs/index.php/KR/KR12/paper/view/4492/0](https://www.aaai.org/ocs/index.php/KR/KR12/paper/view/4492/0))       | Predict for an ambiguous pronoun in a sentence what it is referring to.  |\n\n|\\[14.Summarization\\]([https://arxiv.org/abs/1506.03340](https://arxiv.org/abs/1506.03340))          | Summarize text into a shorter representation.|\n\n|\\[15.SQuAD\\]([https://arxiv.org/abs/1606.05250](https://arxiv.org/abs/1606.05250))                  | Answer a question for a given context.|\n\n|\\[16.WMT1.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                  | Translate English to German|\n\n|\\[17.WMT2.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                   | Translate English to French|\n\n|\\[18.WMT3.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                   | Translate English to Romanian|\n\n&amp;#x200B;\n\n\\- \\[Every T5 Task example notebook\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more)) to see how to use every T5 Task.\n\n\\- \\[T5 Open and Closed Book question answering  notebook\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_question\\_answering.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_question_answering.ipynb))\n\n&amp;#x200B;\n\n\\# \\`Open book\\` and \\`Closed book\\` question answering with Google's T5\n\n\\[T5 Open and Closed Book question answering tutorial\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_question\\_answering.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_question_answering.ipynb))\n\n&amp;#x200B;\n\nWith the latest NLU release and Google's T5 you can answer \\*\\*general knowledge based questions given no context\\*\\* and in addition answer \\*\\*questions on text databases\\*\\*.      \n\nThese questions can be asked in natural human language and answerd in just 1 line with NLU!.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## What is a \\`open book question\\`?\n\nYou can imagine an \\`open book\\` question similar to an examen where you are allowed to bring in text documents or cheat sheets that help you answer questions in an examen. Kinda like bringing a history book to an history examen.\n\n&amp;#x200B;\n\nIn \\`T5's\\` terms, this means the model is given a \\`question\\` and an \\*\\*additional piece of textual information\\*\\* or so called \\`context\\`.\n\n&amp;#x200B;\n\nThis enables the \\`T5\\` model to answer questions on textual datasets like \\`medical records\\`,\\`newsarticles\\` , \\`wiki-databases\\` , \\`stories\\` and \\`movie scripts\\` , \\`product descriptions\\`, 'legal documents' and many more.\n\n&amp;#x200B;\n\nYou can answer \\`open book question\\` in 1 line of code, leveraging the latest NLU release and Google's T5.     \n\nAll it takes is :\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\nnlu.load('answer\\_question').predict(\"\"\"\n\nWhere did Jebe die?\n\ncontext: Ghenkis Khan recalled Subtai back to Mongolia soon afterwards,\n\n and Jebe died on the road back to Samarkand\"\"\")\n\n\\&gt;&gt;&gt; Output: Samarkand\n\n\\`\\`\\`\n\n&amp;#x200B;\n\nExample for answering medical questions based on medical context\n\n\\`\\`\\` python\n\nquestion ='''\n\nWhat does increased oxygen concentrations in the patient’s lungs displace? \n\ncontext: Hyperbaric (high-pressure) medicine uses special oxygen chambers to increase the partial pressure of O 2 around the patient and, when needed, the medical staff. \n\nCarbon monoxide poisoning, gas gangrene, and decompression sickness (the ’bends’) are sometimes treated using these devices. Increased O 2 concentration in the lungs helps to displace carbon monoxide from the heme group of hemoglobin.\n\n Oxygen gas is poisonous to the anaerobic bacteria that cause gas gangrene, so increasing its partial pressure helps kill them. Decompression sickness occurs in divers who decompress too quickly after a dive, resulting in bubbles of inert gas, mostly nitrogen and helium, forming in their blood. Increasing the pressure of O 2 as soon as possible is part of the treatment.\n\n'''\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#Predict on text data with T5\n\nnlu.load('answer\\_question').predict(question)\n\n\\&gt;&gt;&gt; Output: carbon monoxide\t\n\n\\`\\`\\`\n\n&amp;#x200B;\n\nTake a look at this example on a recent news article snippet :\n\n\\`\\`\\`python\n\nquestion1 = 'Who is Jack ma?'\n\nquestion2 = 'Who is founder of Alibaba Group?'\n\nquestion3 = 'When did Jack Ma re-appear?'\n\nquestion4 = 'How did Alibaba stocks react?'\n\nquestion5 = 'Whom did Jack Ma meet?'\n\nquestion6 = 'Who did Jack Ma hide from?'\n\n&amp;#x200B;\n\n\\# from [https://www.bbc.com/news/business-55728338](https://www.bbc.com/news/business-55728338) \n\nnews\\_article\\_snippet = \"\"\" context:\n\nAlibaba Group founder Jack Ma has made his first appearance since Chinese regulators cracked down on his business empire.\n\nHis absence had fuelled speculation over his whereabouts amid increasing official scrutiny of his businesses.\n\nThe billionaire met 100 rural teachers in China via a video meeting on Wednesday, according to local government media.\n\nAlibaba shares surged 5% on Hong Kong's stock exchange on the news.\n\n\"\"\"\n\n\\# join question with context, works with Pandas DF aswell!\n\nquestions = \\[\n\nquestion1+ news\\_article\\_snippet,\n\nquestion2+ news\\_article\\_snippet,\n\nquestion3+ news\\_article\\_snippet,\n\nquestion4+ news\\_article\\_snippet,\n\nquestion5+ news\\_article\\_snippet,\n\nquestion6+ news\\_article\\_snippet,\\]\n\nnlu.load('answer\\_question').predict(questions)\n\n\\`\\`\\`\n\nThis will output a Pandas Dataframe similar to this :\n\n&amp;#x200B;\n\n|Answer|Question|\n\n|-----|---------|\n\nAlibaba Group founder| \tWho is Jack ma? |        \n\n|Jack Ma\t|Who is founder of Alibaba Group? |  \n\nWednesday\t| When did Jack Ma re-appear? | \n\nsurged 5%\t| How did Alibaba stocks react? | \n\n100 rural teachers\t| Whom did Jack Ma meet? | \n\nChinese regulators\t|Who did Jack Ma hide from?|\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## What is a \\`closed book question\\`?\n\nA \\`closed book question\\` is the exact opposite of a \\`open book question\\`. In an examen scenario, you are only allowed to use what you have memorized in your brain and nothing else.      \n\nIn \\`T5's\\` terms this means that T5 can only use it's stored weights to answer a \\`question\\` and is given \\*\\*no aditional context\\*\\*.        \n\n\\`T5\\` was pre-trained on the \\[C4 dataset\\]([https://commoncrawl.org/](https://commoncrawl.org/)) which contains \\*\\*petabytes  of web crawling data\\*\\*  collected over the last 8 years, including Wikipedia in every language.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThis gives \\`T5\\` the broad knowledge of the internet stored in it's weights to answer various \\`closed book questions\\`\n\n&amp;#x200B;\n\nYou can answer \\`closed book question\\` in 1 line of code, leveraging the latest NLU release and Google's T5.     \n\nYou need to pass one string to NLU, which starts which a \\`question\\` and is followed by  a \\`context:\\` tag and then the actual context contents.\n\nAll it takes is :\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('Who is president of Nigeria?')\n\n\\&gt;&gt;&gt; Muhammadu Buhari \n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('What is the most spoken language in India?')\n\n\\&gt;&gt;&gt; Hindi\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('What is the capital of Germany?')\n\n\\&gt;&gt;&gt; Berlin\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## Text Summarization with T5\n\n\\[Summarization example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more))\n\n&amp;#x200B;\n\n\\`Summarizes\\` a paragraph into a shorter version with the same semantic meaning, based on \\[this paper\\]([https://arxiv.org/abs/1506.03340](https://arxiv.org/abs/1506.03340))\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\n\\# Set the task on T5\n\npipe = nlu.load('summarize')\n\n&amp;#x200B;\n\n\\# define Data, add additional tags between sentences\n\ndata = \\[\n\n'''\n\nThe belgian duo took to the dance floor on monday night with some friends . manchester united face newcastle in the premier league on wednesday . red devils will be looking for just their second league away win in seven . louis van gaal’s side currently sit two points clear of liverpool in fourth .\n\n''',\n\n'''  Calculus, originally called infinitesimal calculus or \"the calculus of infinitesimals\", is the mathematical study of continuous change, in the same way that geometry is the study of shape and algebra is the study of generalizations of arithmetic operations. It has two major branches, differential calculus and integral calculus; the former concerns instantaneous rates of change, and the slopes of curves, while integral calculus concerns accumulation of quantities, and areas under or between curves. These two branches are related to each other by the fundamental theorem of calculus, and they make use of the fundamental notions of convergence of infinite sequences and infinite series to a well-defined limit.\\[1\\] Infinitesimal calculus was developed independently in the late 17th century by Isaac Newton and Gottfried Wilhelm Leibniz.\\[2\\]\\[3\\] Today, calculus has widespread uses in science, engineering, and economics.\\[4\\] In mathematics education, calculus denotes courses of elementary mathematical analysis, which are mainly devoted to the study of functions and limits. The word calculus (plural calculi) is a Latin word, meaning originally \"small pebble\" (this meaning is kept in medicine – see Calculus (medicine)). Because such pebbles were used for calculation, the meaning of the word has evolved and today usually means a method of computation. It is therefore used for naming specific methods of calculation and related theories, such as propositional calculus, Ricci calculus, calculus of variations, lambda calculus, and process calculus.'''\n\n\\]\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#Predict on text data with T5\n\npipe.predict(data)\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n| Predicted summary| Text | \n\n|------------------|-------|\n\n| manchester united face newcastle in the premier league on wednesday . louis van gaal's side currently sit two points clear of liverpool in fourth . the belgian duo took to the dance floor on monday night with some friends .            | the belgian duo took to the dance floor on monday night with some friends . manchester united face newcastle in the premier league on wednesday . red devils will be looking for just their second league away win in seven . louis van gaal’s side currently sit two points clear of liverpool in fourth . | \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## Binary Sentence similarity/ Paraphrasing\n\n\\[Binary sentence similarity example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more))\n\nClassify whether one sentence is a re-phrasing or similar to another sentence      \n\nThis is a sub-task of \\[GLUE\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf)) and based on \\[MRPC - Binary Paraphrasing/ sentence similarity classification \\]([https://www.aclweb.org/anthology/I05-5002.pdf](https://www.aclweb.org/anthology/I05-5002.pdf))\n\n&amp;#x200B;\n\n\\`\\`\\`\n\nt5 = nlu.load('en.t5.base')\n\n\\# Set the task on T5\n\nt5\\['t5'\\].setTask('mrpc ')\n\n&amp;#x200B;\n\n\\# define Data, add additional tags between sentences\n\ndata = \\[\n\n''' sentence1: We acted because we saw the existing evidence in a new light , through the prism of our experience on 11 September , \" Rumsfeld said .\n\nsentence2: Rather , the US acted because the administration saw \" existing evidence in a new light , through the prism of our experience on September 11 \"\n\n'''\n\n,\n\n'''  \n\nsentence1: I like to eat peanutbutter for breakfast\n\nsentence2: \tI like to play football.\n\n'''\n\n\\]\n\n&amp;#x200B;\n\n\\#Predict on text data with T5\n\nt5.predict(data)\n\n\\`\\`\\`\n\n| Sentence1 | Sentence2 | prediction|\n\n|------------|------------|----------|\n\n|We acted because we saw the existing evidence in a new light , through the prism of our experience on 11 September , \" Rumsfeld said .| Rather , the US acted because the administration saw \" existing evidence in a new light , through the prism of our experience on September 11 \" . | equivalent | \n\n| I like to eat peanutbutter for breakfast| I like to play football | not\\_equivalent | \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\### How to configure T5 task for MRPC and pre-process text\n\n\\`.setTask('mrpc sentence1:)\\` and prefix second sentence with \\`sentence2:\\`\n\n&amp;#x200B;\n\n\\### Example pre-processed input for T5 MRPC - Binary Paraphrasing/ sentence similarity\n\n&amp;#x200B;\n\n\\`\\`\\`\n\nmrpc \n\nsentence1: We acted because we saw the existing evidence in a new light , through the prism of our experience on 11 September , \" Rumsfeld said . \n\nsentence2: Rather , the US acted because the administration saw \" existing evidence in a new light , through the prism of our experience on September 11\",\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## Regressive Sentence similarity/ Paraphrasing\n\n&amp;#x200B;\n\nMeasures how similar two sentences are on a scale from 0 to 5 with 21 classes representing a regressive label.     \n\nThis is a sub-task of \\[GLUE\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf)) and based on\\[STSB - Regressive semantic sentence similarity\\]([https://www.aclweb.org/anthology/S17-2001/](https://www.aclweb.org/anthology/S17-2001/)) .\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\nt5 = nlu.load('en.t5.base')\n\n\\# Set the task on T5\n\nt5\\['t5'\\].setTask('stsb ') \n\n&amp;#x200B;\n\n\\# define Data, add additional tags between sentences\n\ndata = \\[\n\n\n\n''' sentence1:  What attributes would have made you highly desirable in ancient Rome?  \n\nsentence2:  How I GET OPPERTINUTY TO JOIN IT COMPANY AS A FRESHER?'\n\n'''\n\n,\n\n'''  \n\nsentence1: What was it like in Ancient rome?\n\nsentence2: \tWhat was Ancient rome like?\n\n''',\n\n'''  \n\nsentence1: What was live like as a King in Ancient Rome??\n\nsentence2: \tWhat was Ancient rome like?\n\n'''\n\n&amp;#x200B;\n\n\\]\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\#Predict on text data with T5\n\nt5.predict(data)\n\n&amp;#x200B;\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n| sentence1 | sentence2 | prediction|\n\n|------------|------------|----------|\n\n|What attributes would have made you highly desirable in ancient Rome?        | How I GET OPPERTINUTY TO JOIN IT COMPANY AS A FRESHER? | 0 | \n\n|What was it like in Ancient rome?  | What was Ancient rome like?| 5.0 | \n\n|What was live like as a King in Ancient Rome??       | What is it like to live in Rome? | 3.2 | \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\### How to configure T5 task for stsb and pre-process text\n\n\\`.setTask('stsb sentence1:)\\` and prefix second sentence with \\`sentence2:\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\### Example pre-processed input for T5 STSB - Regressive semantic sentence similarity\n\n&amp;#x200B;\n\n\\`\\`\\`\n\nstsb\n\nsentence1: What attributes would have made you highly desirable in ancient Rome?        \n\nsentence2: How I GET OPPERTINUTY TO JOIN IT COMPANY AS A FRESHER?',\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## Grammar Checking\n\n\\[Grammar checking with T5 example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more))\n\nJudges if a sentence is grammatically acceptable.    \n\nBased on \\[CoLA - Binary Grammatical Sentence acceptability classification\\]([https://nyu-mll.github.io/CoLA/](https://nyu-mll.github.io/CoLA/))\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\npipe = nlu.load('grammar\\_correctness')\n\n\\# Set the task on T5\n\npipe\\['t5'\\].setTask('cola sentence: ')\n\n\\# define Data\n\ndata = \\['Anna and Mike is going skiing and they is liked is','Anna and Mike like to dance'\\]\n\n\\#Predict on text data with T5\n\npipe.predict(data)\n\n\\`\\`\\`\n\n|sentence  | prediction|\n\n|------------|------------|\n\n| Anna and Mike is going skiing and they is liked is | unacceptable |      \n\n| Anna and Mike like to dance | acceptable | \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\## Document Normalization\n\n\\[Document Normalizer example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/text\\_pre\\_processing\\_and\\_cleaning/document\\_normalizer\\_demo.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/text_pre_processing_and_cleaning/document_normalizer_demo.ipynb))     \n\nThe DocumentNormalizer extracts content from HTML or XML documents, applying either data cleansing using an arbitrary number of custom regular expressions either data extraction following the different parameters\n\n&amp;#x200B;\n\n\\`\\`\\`python\n\npipe = nlu.load('norm\\_document')\n\ndata = '&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;title&gt;Example&lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;p&gt;This is an example of a simple HTML page with one paragraph.&lt;/p&gt; &lt;/body&gt; &lt;/html&gt;'\n\ndf = pipe.predict(data,output\\_level='document')\n\ndf\n\n\\`\\`\\`\n\n|text|normalized\\_text|\n\n|------|-------------|\n\n| \\`&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;title&gt;Example&lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;p&gt;This is an example of a simple HTML page with one paragraph.&lt;/p&gt; &lt;/body&gt; &lt;/html&gt;\\`       |Example This is an example of a simple HTML page with one paragraph.|\n\n&amp;#x200B;\n\n\\## Word Segmenter\n\n\\[Word Segmenter Example\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/japanese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/multilingual/japanese_ner_pos_and_tokenization.ipynb))     \n\nThe WordSegmenter segments languages without any rule-based tokenization such as Chinese, Japanese, or Korean\n\n\\`\\`\\`python\n\npipe = nlu.load('ja.segment\\_words')\n\n\\# japanese for 'Donald Trump and Angela Merkel dont share many opinions'\n\nja\\_data = \\['ドナルド・トランプとアンゲラ・メルケルは多くの意見を共有していません'\\]\n\ndf = pipe.predict(ja\\_data, output\\_level='token')\n\ndf\n\n&amp;#x200B;\n\n\\`\\`\\`\n\n&amp;#x200B;\n\n|\ttoken|\n\n|--------|\n\n|\tドナルド|\n\n|\t・|\n\n|\tトランプ|\n\n|\tと|\n\n|\tアンゲラ|\n\n|\t・|\n\n|\tメルケル|\n\n|\tは|\n\n|\t多く|\n\n|\tの|\n\n|\t意見|\n\n|\tを|\n\n|\t共有|\n\n|\tし|\n\n|\tて|\n\n|\tい|\n\n|\tませ|\n\n|\tん|\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\# Named Entity Extraction (NER) in Various Languages \n\nNLU now support NER for over 60 languages, including Korean, Japanese, Chinese and many more!   \n\n\\`\\`\\`python\n\n&amp;#x200B;\n\n\\# Extract named chinese entities\n\npipe = nlu.load('zh.ner')\n\n\\# Chinese for 'Donald Trump and Angela Merkel dont share many opinions'\n\nzh\\_data = \\['唐纳德特朗普和安吉拉·默克尔没有太多意见'\\]\n\ndf = pipe.predict(zh\\_data, output\\_level='document')\n\ndf\n\n\\&gt;&gt;&gt; Output : \\[唐纳德, 安吉拉\\]\n\n&amp;#x200B;\n\n\\# Now translate \\[唐纳德, 安吉拉\\] back to english with NLU!\n\ntranslate\\_pipe = nlu.load('zh.translate\\_to.en')\n\nen\\_entities = translate\\_pipe.predict(\\['唐纳德', '安吉拉'\\])\n\n\\&gt;&gt;&gt; Output :\n\n\\`\\`\\`\n\n|Translation|\tChinese| \n\n|------|------|\n\n|Donald | 唐纳德 |\n\n|Angela | \t安吉拉|\n\n&amp;#x200B;\n\n\\# New NLU Notebooks\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\### NLU 1.1.0  New Notebooks for new features\n\n\\- \\[Translate between 192+ languages with marian\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/translation\\_demo.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/translation_demo.ipynb))\n\n\\- \\[Try out the 18 Tasks like Summarization Question Answering and more on T5\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_tasks_summarize_question_answering_and_more))\n\n\\- \\[T5 Open and Closed Book question answering tutorial\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/T5\\_question\\_answering.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/T5_question_answering.ipynb))\n\n\\- \\[Tokenize, extract POS and NER in Chinese\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/chinese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/multilingual/chinese_ner_pos_and_tokenization.ipynb))\n\n\\- \\[Tokenize, extract POS and NER in Korean\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/korean\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/multilingual/korean_ner_pos_and_tokenization.ipynb))\n\n\\- \\[Tokenize, extract POS and NER in Japanese\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/japanese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/multilingual/japanese_ner_pos_and_tokenization.ipynb))\n\n\\- \\[Normalize documents\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/text\\_pre\\_processing\\_and\\_cleaning/document\\_normalizer\\_demo.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/text_pre_processing_and_cleaning/document_normalizer_demo.ipynb))\n\n\\- \\[Aspect based sentiment NER sentiment for restaurants\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component\\_examples/named\\_entity\\_recognition\\_(NER)/aspect\\_based\\_ner\\_sentiment\\_restaurants.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/component_examples/named_entity_recognition_(NER)/aspect_based_ner_sentiment_restaurants.ipynb))\n\n&amp;#x200B;\n\n\\### NLU 1.1.0 New Classifier Training Tutorials\n\n\\#### Binary Classifier training Jupyter tutorials\n\n\\- \\[2 class Finance News sentiment classifier training\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary\\_text\\_classification/NLU\\_training\\_sentiment\\_classifier\\_demo\\_apple\\_twitter.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary_text_classification/NLU_training_sentiment_classifier_demo_apple_twitter.ipynb))\n\n\\- \\[2 class Reddit comment sentiment classifier training\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary\\_text\\_classification/NLU\\_training\\_sentiment\\_classifier\\_demo\\_reddit.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary_text_classification/NLU_training_sentiment_classifier_demo_reddit.ipynb))\n\n\\- \\[2 class Apple Tweets sentiment classifier training\\]([https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary\\_text\\_classification/NLU\\_training\\_sentiment\\_classifier\\_demo\\_IMDB.ipynb](https://github.com/JohnSnowLabs/nlu/blob/master/examples/colab/Training/binary_text_classification/NLU_training_s", "link": "https://www.reddit.com/r/datascience/comments/l4cbvp/720_new_nlp_models_300_supported_languages/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "720+ new nlp models, 300+ supported languages, translation, summarization, question answering and more with t5 and marian models! - john snow labs nlu 1.1.0 /!/ &amp;#x200b;\n\n\\# 720+ new  nlp models, 300+ supported languages, translation, summarization, question answering and more with t5 and marian models!  - john snow labs nlu 1.1.0\n\n&amp;#x200b;\n\n\\##  nlu 1.1.0 release notes\n\n&amp;#x200b;\n\nwe are incredibly excited to release nlu 1.1.0!\n\nthis release integrates the 720+ new models from the latest \\[spark-nlp 2.7.0 + releases\\]([https://github.com/johnsnowlabs/spark-nlp/releases](https://github.com/johnsnowlabs/spark-nlp/releases))\n\nyou can now achieve state-of-the-art results with sequence2sequence transformers on problems like text summarization, question answering, translation between  192+ languages, and extract named entity in various right to left written languages like  arabic, persian, urdu, and languages that require segmentation like koreas, japanese, chinese, and many more in 1 line of code!     \n\nthese new features are possible because of the integration of the \\[google's t5 models\\]([https://ai.googleblog.com/2020/02/exploring-transfer-learning-with-t5.html](https://ai.googleblog.com/2020/02/exploring-transfer-learning-with-t5.html)) and \\[microsoft's marian models\\]([https://marian-nmt.github.io/publications/](https://marian-nmt.github.io/publications/))  transformers.\n\n&amp;#x200b;\n\nnlu 1.1.0 has over 720+ new pretrained models and pipelines while extending the support of multi-lingual models to 192+ languages such as chinese, japanese, korean, arabic, persian, urdu, and hebrew.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nin addition to this, nlu 1.1.0 comes with 9 new notebooks showcasing training classifiers for various review and sentiment datasets and 7 notebooks for the new features and models.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\### nlu 1.1.0  new features\n\n\\* \\*\\*720+\\*\\* new models you can find an overview of all nlu models \\[here\\]([https://nlu.johnsnowlabs.com/docs/en/namespace](https://nlu.johnsnowlabs.com/docs/en/namespace)) and further documentation in the \\[models hub\\]([https://nlp.johnsnowlabs.com/models](https://nlp.johnsnowlabs.com/models))\n\n\\* \\*\\*new:\\*\\* introducing mariantransformer annotator for machine translation based on mariannmt models. marian is an efficient, free neural machine translation framework mainly being developed by the microsoft translator team (646+ pretrained models &amp; pipelines in 192+ languages)\n\n\\* \\*\\*new:\\*\\* introducing t5transformer annotator for text-to-text transfer transformer (google t5) models to achieve state-of-the-art results on multiple nlp tasks such as translation, summarization, question answering, sentence similarity, and so on\n\n\\* \\*\\*new:\\*\\* introducing brand new and refactored language detection and identification models. the new languagedetectordl is faster, more accurate, and supports up to 375 languages\n\n\\* \\*\\*new:\\*\\* introducing wordsegmenter model for word segmentation of languages without any rule-based tokenization such as chinese, japanese, or korean\n\n\\* \\*\\*new:\\*\\* introducing documentnormalizer component for cleaning content from html or xml documents, applying either data cleansing using an arbitrary number of custom regular expressions either data extraction following the different parameters\n\n&amp;#x200b;\n\n\\## translation\n\n\\[translation example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/translation\\_demo.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/translation_demo.ipynb))       \n\nyou can translate between more than 192 languages pairs with the \\[marian models\\]([https://marian-nmt.github.io/publications/](https://marian-nmt.github.io/publications/))\n\nyou need to specify the language your data is in as \\`start\\_language\\` and the language you want to translate to as \\`target\\_language\\`.    \n\nthe language references must be \\[iso language codes\\]([https://en.wikipedia.org/wiki/list\\_of\\_iso\\_639-1\\_codes](https://en.wikipedia.org/wiki/list_of_iso_639-1_codes))\n\n&amp;#x200b;\n\n\\`nlu.load('&lt;start\\_language&gt;.translate.&lt;target\\_language&gt;')\\`\n\n&amp;#x200b;\n\n\\*\\*translate english to french :\\*\\*     \n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.fr').predict(\"hello from john snow labs\")\n\n\\&gt;&gt;&gt; output: bonjour des laboratoires de neige de john!\t \n\n&amp;#x200b;\n\n\\`\\`\\`\n\n\\*\\*translate english to inukitut :\\*\\*     \n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.lu').predict(\"hello from john snow labs\")\n\n\\&gt;&gt;&gt; output: kalunganyembo ka mashika makamankate \n\n\\`\\`\\`\n\n\\*\\*translate english to hungarian :\\*\\*\n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.hu').predict(\"hello from john snow labs\")\n\n\\&gt;&gt;&gt; output: helló john hó laborjából.\n\n\\`\\`\\`\n\n\\*\\*translate english to german :\\*\\*\n\n\\`\\`\\`\n\nnlu.load('en.translate\\_to.de').predict(\"hello from john snow labs!\")\n\n\\&gt;&gt;&gt; output: hallo aus john schnee labors \n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\ntranslate\\_pipe = nlu.load('en.translate\\_to.de')\n\ndf = translate\\_pipe.predict('billy likes to go to the mall every sunday')\n\ndf\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n|\tsentence|\ttranslation|\n\n|-----------|--------------|\n\n|billy likes to go to the mall every sunday\t| billy geht gerne jeden sonntag ins einkaufszentrum|\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## t5\n\n\\[example of every t5 task\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more))\n\n\\### overview of every task available with t5\n\n\\[the t5 model\\]([https://arxiv.org/pdf/1910.10683.pdf](https://arxiv.org/pdf/1910.10683.pdf)) is trained on various datasets for 17 different tasks which fall into 8 categories.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n1. text summarization\n\n2. question answering\n\n3. translation\n\n4. sentiment analysis\n\n5. natural language inference\n\n6. coreference resolution\n\n7. sentence completion\n\n8. word sense disambiguation\n\n&amp;#x200b;\n\n\\### every t5 task with explanation:\n\n&amp;#x200b;\n\n|task name | explanation | \n\n|----------|--------------|\n\n|\\[1.cola\\]([https://nyu-mll.github.io/cola/](https://nyu-mll.github.io/cola/))                   | classify if a sentence is gramaticaly correct|\n\n|\\[2.rte\\]([https://dl.acm.org/doi/10.1007/11736790\\_9](https://dl.acm.org/doi/10.1007/11736790_9))                    | classify whether if a statement can be deducted from a sentence|\n\n|\\[3.mnli\\]([https://arxiv.org/abs/1704.05426](https://arxiv.org/abs/1704.05426))                   | classify for a hypothesis and premise whether they contradict or contradict each other or neither of both (3 class).|\n\n|\\[4.mrpc\\]([https://www.aclweb.org/anthology/i05-5002.pdf](https://www.aclweb.org/anthology/i05-5002.pdf))                   | classify whether a pair of sentences is a re-phrasing of each other (semantically equivalent)|\n\n|\\[5.qnli\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf))                   | classify whether the answer to a question can be deducted from an answer candidate.|\n\n|\\[6.qqp\\]([https://www.quora.com/q/quoradata/first-quora-dataset-release-question-pairs](https://www.quora.com/q/quoradata/first-quora-dataset-release-question-pairs))                    | classify whether a pair of questions is a re-phrasing of each other (semantically equivalent)|\n\n|\\[7.sst2\\]([https://www.aclweb.org/anthology/d13-1170.pdf](https://www.aclweb.org/anthology/d13-1170.pdf))                   | classify the sentiment of a sentence as positive or negative|\n\n|\\[8.stsb\\]([https://www.aclweb.org/anthology/s17-2001/](https://www.aclweb.org/anthology/s17-2001/))                   | classify the sentiment of a sentence on a scale from 1 to 5 (21 sentiment classes)|\n\n|\\[9.cb\\]([https://ojs.ub.uni-konstanz.de/sub/index.php/sub/article/view/601](https://ojs.ub.uni-konstanz.de/sub/index.php/sub/article/view/601))                     | classify for a premise and a hypothesis whether they contradict each other or not (binary).|\n\n|\\[10.copa\\]([https://www.aaai.org/ocs/index.php/sss/sss11/paper/view/2418/0](https://www.aaai.org/ocs/index.php/sss/sss11/paper/view/2418/0))                   | classify for a question, premise, and 2 choices which choice the correct choice is (binary).|\n\n|\\[11.multirc\\]([https://www.aclweb.org/anthology/n18-1023.pdf](https://www.aclweb.org/anthology/n18-1023.pdf))                | classify for a question, a paragraph of text, and an answer candidate, if the answer is correct (binary),|\n\n|\\[12.wic\\]([https://arxiv.org/abs/1808.09121](https://arxiv.org/abs/1808.09121))                    | classify for a pair of sentences and a disambigous word if the word has the same meaning in both sentences.|\n\n|\\[13.wsc/dpr\\]([https://www.aaai.org/ocs/index.php/kr/kr12/paper/view/4492/0](https://www.aaai.org/ocs/index.php/kr/kr12/paper/view/4492/0))       | predict for an ambiguous pronoun in a sentence what it is referring to.  |\n\n|\\[14.summarization\\]([https://arxiv.org/abs/1506.03340](https://arxiv.org/abs/1506.03340))          | summarize text into a shorter representation.|\n\n|\\[15.squad\\]([https://arxiv.org/abs/1606.05250](https://arxiv.org/abs/1606.05250))                  | answer a question for a given context.|\n\n|\\[16.wmt1.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                  | translate english to german|\n\n|\\[17.wmt2.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                   | translate english to french|\n\n|\\[18.wmt3.\\]([https://arxiv.org/abs/1706.03762](https://arxiv.org/abs/1706.03762))                   | translate english to romanian|\n\n&amp;#x200b;\n\n\\- \\[every t5 task example notebook\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more)) to see how to use every t5 task.\n\n\\- \\[t5 open and closed book question answering  notebook\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_question\\_answering.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_question_answering.ipynb))\n\n&amp;#x200b;\n\n\\# \\`open book\\` and \\`closed book\\` question answering with google's t5\n\n\\[t5 open and closed book question answering tutorial\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_question\\_answering.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_question_answering.ipynb))\n\n&amp;#x200b;\n\nwith the latest nlu release and google's t5 you can answer \\*\\*general knowledge based questions given no context\\*\\* and in addition answer \\*\\*questions on text databases\\*\\*.      \n\nthese questions can be asked in natural human language and answerd in just 1 line with nlu!.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## what is a \\`open book question\\`?\n\nyou can imagine an \\`open book\\` question similar to an examen where you are allowed to bring in text documents or cheat sheets that help you answer questions in an examen. kinda like bringing a history book to an history examen.\n\n&amp;#x200b;\n\nin \\`t5's\\` terms, this means the model is given a \\`question\\` and an \\*\\*additional piece of textual information\\*\\* or so called \\`context\\`.\n\n&amp;#x200b;\n\nthis enables the \\`t5\\` model to answer questions on textual datasets like \\`medical records\\`,\\`newsarticles\\` , \\`wiki-databases\\` , \\`stories\\` and \\`movie scripts\\` , \\`product descriptions\\`, 'legal documents' and many more.\n\n&amp;#x200b;\n\nyou can answer \\`open book question\\` in 1 line of code, leveraging the latest nlu release and google's t5.     \n\nall it takes is :\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\nnlu.load('answer\\_question').predict(\"\"\"\n\nwhere did jebe die?\n\ncontext: ghenkis khan recalled subtai back to mongolia soon afterwards,\n\n and jebe died on the road back to samarkand\"\"\")\n\n\\&gt;&gt;&gt; output: samarkand\n\n\\`\\`\\`\n\n&amp;#x200b;\n\nexample for answering medical questions based on medical context\n\n\\`\\`\\` python\n\nquestion ='''\n\nwhat does increased oxygen concentrations in the patient’s lungs displace? \n\ncontext: hyperbaric (high-pressure) medicine uses special oxygen chambers to increase the partial pressure of o 2 around the patient and, when needed, the medical staff. \n\ncarbon monoxide poisoning, gas gangrene, and decompression sickness (the ’bends’) are sometimes treated using these devices. increased o 2 concentration in the lungs helps to displace carbon monoxide from the heme group of hemoglobin.\n\n oxygen gas is poisonous to the anaerobic bacteria that cause gas gangrene, so increasing its partial pressure helps kill them. decompression sickness occurs in divers who decompress too quickly after a dive, resulting in bubbles of inert gas, mostly nitrogen and helium, forming in their blood. increasing the pressure of o 2 as soon as possible is part of the treatment.\n\n'''\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\#predict on text data with t5\n\nnlu.load('answer\\_question').predict(question)\n\n\\&gt;&gt;&gt; output: carbon monoxide\t\n\n\\`\\`\\`\n\n&amp;#x200b;\n\ntake a look at this example on a recent news article snippet :\n\n\\`\\`\\`python\n\nquestion1 = 'who is jack ma?'\n\nquestion2 = 'who is founder of alibaba group?'\n\nquestion3 = 'when did jack ma re-appear?'\n\nquestion4 = 'how did alibaba stocks react?'\n\nquestion5 = 'whom did jack ma meet?'\n\nquestion6 = 'who did jack ma hide from?'\n\n&amp;#x200b;\n\n\\# from [https://www.bbc.com/news/business-55728338](https://www.bbc.com/news/business-55728338) \n\nnews\\_article\\_snippet = \"\"\" context:\n\nalibaba group founder jack ma has made his first appearance since chinese regulators cracked down on his business empire.\n\nhis absence had fuelled speculation over his whereabouts amid increasing official scrutiny of his businesses.\n\nthe billionaire met 100 rural teachers in china via a video meeting on wednesday, according to local government media.\n\nalibaba shares surged 5% on hong kong's stock exchange on the news.\n\n\"\"\"\n\n\\# join question with context, works with pandas df aswell!\n\nquestions = \\[\n\nquestion1+ news\\_article\\_snippet,\n\nquestion2+ news\\_article\\_snippet,\n\nquestion3+ news\\_article\\_snippet,\n\nquestion4+ news\\_article\\_snippet,\n\nquestion5+ news\\_article\\_snippet,\n\nquestion6+ news\\_article\\_snippet,\\]\n\nnlu.load('answer\\_question').predict(questions)\n\n\\`\\`\\`\n\nthis will output a pandas dataframe similar to this :\n\n&amp;#x200b;\n\n|answer|question|\n\n|-----|---------|\n\nalibaba group founder| \twho is jack ma? |        \n\n|jack ma\t|who is founder of alibaba group? |  \n\nwednesday\t| when did jack ma re-appear? | \n\nsurged 5%\t| how did alibaba stocks react? | \n\n100 rural teachers\t| whom did jack ma meet? | \n\nchinese regulators\t|who did jack ma hide from?|\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## what is a \\`closed book question\\`?\n\na \\`closed book question\\` is the exact opposite of a \\`open book question\\`. in an examen scenario, you are only allowed to use what you have memorized in your brain and nothing else.      \n\nin \\`t5's\\` terms this means that t5 can only use it's stored weights to answer a \\`question\\` and is given \\*\\*no aditional context\\*\\*.        \n\n\\`t5\\` was pre-trained on the \\[c4 dataset\\]([https://commoncrawl.org/](https://commoncrawl.org/)) which contains \\*\\*petabytes  of web crawling data\\*\\*  collected over the last 8 years, including wikipedia in every language.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nthis gives \\`t5\\` the broad knowledge of the internet stored in it's weights to answer various \\`closed book questions\\`\n\n&amp;#x200b;\n\nyou can answer \\`closed book question\\` in 1 line of code, leveraging the latest nlu release and google's t5.     \n\nyou need to pass one string to nlu, which starts which a \\`question\\` and is followed by  a \\`context:\\` tag and then the actual context contents.\n\nall it takes is :\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('who is president of nigeria?')\n\n\\&gt;&gt;&gt; muhammadu buhari \n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('what is the most spoken language in india?')\n\n\\&gt;&gt;&gt; hindi\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\nnlu.load('en.t5').predict('what is the capital of germany?')\n\n\\&gt;&gt;&gt; berlin\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## text summarization with t5\n\n\\[summarization example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more))\n\n&amp;#x200b;\n\n\\`summarizes\\` a paragraph into a shorter version with the same semantic meaning, based on \\[this paper\\]([https://arxiv.org/abs/1506.03340](https://arxiv.org/abs/1506.03340))\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\n\\# set the task on t5\n\npipe = nlu.load('summarize')\n\n&amp;#x200b;\n\n\\# define data, add additional tags between sentences\n\ndata = \\[\n\n'''\n\nthe belgian duo took to the dance floor on monday night with some friends . manchester united face newcastle in the premier league on wednesday . red devils will be looking for just their second league away win in seven . louis van gaal’s side currently sit two points clear of liverpool in fourth .\n\n''',\n\n'''  calculus, originally called infinitesimal calculus or \"the calculus of infinitesimals\", is the mathematical study of continuous change, in the same way that geometry is the study of shape and algebra is the study of generalizations of arithmetic operations. it has two major -----> branches !!! , differential calculus and integral calculus; the former concerns instantaneous rates of change, and the slopes of curves, while integral calculus concerns accumulation of quantities, and areas under or between curves. these two branches are related to each other by the fundamental theorem of calculus, and they make use of the fundamental notions of convergence of infinite sequences and infinite series to a well-defined limit.\\[1\\] infinitesimal calculus was developed independently in the late 17th century by isaac newton and gottfried wilhelm leibniz.\\[2\\]\\[3\\] today, calculus has widespread uses in science, engineering, and economics.\\[4\\] in mathematics education, calculus denotes courses of elementary mathematical analysis, which are mainly devoted to the study of functions and limits. the word calculus (plural calculi) is a latin word, meaning originally \"small pebble\" (this meaning is kept in medicine – see calculus (medicine)). because such pebbles were used for calculation, the meaning of the word has evolved and today usually means a method of computation. it is therefore used for naming specific methods of calculation and related theories, such as propositional calculus, ricci calculus, calculus of variations, lambda calculus, and process calculus.'''\n\n\\]\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\#predict on text data with t5\n\npipe.predict(data)\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n| predicted summary| text | \n\n|------------------|-------|\n\n| manchester united face newcastle in the premier league on wednesday . louis van gaal's side currently sit two points clear of liverpool in fourth . the belgian duo took to the dance floor on monday night with some friends .            | the belgian duo took to the dance floor on monday night with some friends . manchester united face newcastle in the premier league on wednesday . red devils will be looking for just their second league away win in seven . louis van gaal’s side currently sit two points clear of liverpool in fourth . | \n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## binary sentence similarity/ paraphrasing\n\n\\[binary sentence similarity example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more))\n\nclassify whether one sentence is a re-phrasing or similar to another sentence      \n\nthis is a sub-task of \\[glue\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf)) and based on \\[mrpc - binary paraphrasing/ sentence similarity classification \\]([https://www.aclweb.org/anthology/i05-5002.pdf](https://www.aclweb.org/anthology/i05-5002.pdf))\n\n&amp;#x200b;\n\n\\`\\`\\`\n\nt5 = nlu.load('en.t5.base')\n\n\\# set the task on t5\n\nt5\\['t5'\\].settask('mrpc ')\n\n&amp;#x200b;\n\n\\# define data, add additional tags between sentences\n\ndata = \\[\n\n''' sentence1: we acted because we saw the existing evidence in a new light , through the prism of our experience on 11 september , \" rumsfeld said .\n\nsentence2: rather , the us acted because the administration saw \" existing evidence in a new light , through the prism of our experience on september 11 \"\n\n'''\n\n,\n\n'''  \n\nsentence1: i like to eat peanutbutter for breakfast\n\nsentence2: \ti like to play football.\n\n'''\n\n\\]\n\n&amp;#x200b;\n\n\\#predict on text data with t5\n\nt5.predict(data)\n\n\\`\\`\\`\n\n| sentence1 | sentence2 | prediction|\n\n|------------|------------|----------|\n\n|we acted because we saw the existing evidence in a new light , through the prism of our experience on 11 september , \" rumsfeld said .| rather , the us acted because the administration saw \" existing evidence in a new light , through the prism of our experience on september 11 \" . | equivalent | \n\n| i like to eat peanutbutter for breakfast| i like to play football | not\\_equivalent | \n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\### how to configure t5 task for mrpc and pre-process text\n\n\\`.settask('mrpc sentence1:)\\` and prefix second sentence with \\`sentence2:\\`\n\n&amp;#x200b;\n\n\\### example pre-processed input for t5 mrpc - binary paraphrasing/ sentence similarity\n\n&amp;#x200b;\n\n\\`\\`\\`\n\nmrpc \n\nsentence1: we acted because we saw the existing evidence in a new light , through the prism of our experience on 11 september , \" rumsfeld said . \n\nsentence2: rather , the us acted because the administration saw \" existing evidence in a new light , through the prism of our experience on september 11\",\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## regressive sentence similarity/ paraphrasing\n\n&amp;#x200b;\n\nmeasures how similar two sentences are on a scale from 0 to 5 with 21 classes representing a regressive label.     \n\nthis is a sub-task of \\[glue\\]([https://arxiv.org/pdf/1804.07461.pdf](https://arxiv.org/pdf/1804.07461.pdf)) and based on\\[stsb - regressive semantic sentence similarity\\]([https://www.aclweb.org/anthology/s17-2001/](https://www.aclweb.org/anthology/s17-2001/)) .\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\nt5 = nlu.load('en.t5.base')\n\n\\# set the task on t5\n\nt5\\['t5'\\].settask('stsb ') \n\n&amp;#x200b;\n\n\\# define data, add additional tags between sentences\n\ndata = \\[\n\n\n\n''' sentence1:  what attributes would have made you highly desirable in ancient rome?  \n\nsentence2:  how i get oppertinuty to join it company as a fresher?'\n\n'''\n\n,\n\n'''  \n\nsentence1: what was it like in ancient rome?\n\nsentence2: \twhat was ancient rome like?\n\n''',\n\n'''  \n\nsentence1: what was live like as a king in ancient rome??\n\nsentence2: \twhat was ancient rome like?\n\n'''\n\n&amp;#x200b;\n\n\\]\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\#predict on text data with t5\n\nt5.predict(data)\n\n&amp;#x200b;\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n| sentence1 | sentence2 | prediction|\n\n|------------|------------|----------|\n\n|what attributes would have made you highly desirable in ancient rome?        | how i get oppertinuty to join it company as a fresher? | 0 | \n\n|what was it like in ancient rome?  | what was ancient rome like?| 5.0 | \n\n|what was live like as a king in ancient rome??       | what is it like to live in rome? | 3.2 | \n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\### how to configure t5 task for stsb and pre-process text\n\n\\`.settask('stsb sentence1:)\\` and prefix second sentence with \\`sentence2:\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\### example pre-processed input for t5 stsb - regressive semantic sentence similarity\n\n&amp;#x200b;\n\n\\`\\`\\`\n\nstsb\n\nsentence1: what attributes would have made you highly desirable in ancient rome?        \n\nsentence2: how i get oppertinuty to join it company as a fresher?',\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## grammar checking\n\n\\[grammar checking with t5 example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more))\n\njudges if a sentence is grammatically acceptable.    \n\nbased on \\[cola - binary grammatical sentence acceptability classification\\]([https://nyu-mll.github.io/cola/](https://nyu-mll.github.io/cola/))\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\npipe = nlu.load('grammar\\_correctness')\n\n\\# set the task on t5\n\npipe\\['t5'\\].settask('cola sentence: ')\n\n\\# define data\n\ndata = \\['anna and mike is going skiing and they is liked is','anna and mike like to dance'\\]\n\n\\#predict on text data with t5\n\npipe.predict(data)\n\n\\`\\`\\`\n\n|sentence  | prediction|\n\n|------------|------------|\n\n| anna and mike is going skiing and they is liked is | unacceptable |      \n\n| anna and mike like to dance | acceptable | \n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\## document normalization\n\n\\[document normalizer example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/text\\_pre\\_processing\\_and\\_cleaning/document\\_normalizer\\_demo.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/text_pre_processing_and_cleaning/document_normalizer_demo.ipynb))     \n\nthe documentnormalizer extracts content from html or xml documents, applying either data cleansing using an arbitrary number of custom regular expressions either data extraction following the different parameters\n\n&amp;#x200b;\n\n\\`\\`\\`python\n\npipe = nlu.load('norm\\_document')\n\ndata = '&lt;!doctype html&gt; &lt;html&gt; &lt;head&gt; &lt;title&gt;example&lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;p&gt;this is an example of a simple html page with one paragraph.&lt;/p&gt; &lt;/body&gt; &lt;/html&gt;'\n\ndf = pipe.predict(data,output\\_level='document')\n\ndf\n\n\\`\\`\\`\n\n|text|normalized\\_text|\n\n|------|-------------|\n\n| \\`&lt;!doctype html&gt; &lt;html&gt; &lt;head&gt; &lt;title&gt;example&lt;/title&gt; &lt;/head&gt; &lt;body&gt; &lt;p&gt;this is an example of a simple html page with one paragraph.&lt;/p&gt; &lt;/body&gt; &lt;/html&gt;\\`       |example this is an example of a simple html page with one paragraph.|\n\n&amp;#x200b;\n\n\\## word segmenter\n\n\\[word segmenter example\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/japanese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/multilingual/japanese_ner_pos_and_tokenization.ipynb))     \n\nthe wordsegmenter segments languages without any rule-based tokenization such as chinese, japanese, or korean\n\n\\`\\`\\`python\n\npipe = nlu.load('ja.segment\\_words')\n\n\\# japanese for 'donald trump and angela merkel dont share many opinions'\n\nja\\_data = \\['ドナルド・トランプとアンゲラ・メルケルは多くの意見を共有していません'\\]\n\ndf = pipe.predict(ja\\_data, output\\_level='token')\n\ndf\n\n&amp;#x200b;\n\n\\`\\`\\`\n\n&amp;#x200b;\n\n|\ttoken|\n\n|--------|\n\n|\tドナルド|\n\n|\t・|\n\n|\tトランプ|\n\n|\tと|\n\n|\tアンゲラ|\n\n|\t・|\n\n|\tメルケル|\n\n|\tは|\n\n|\t多く|\n\n|\tの|\n\n|\t意見|\n\n|\tを|\n\n|\t共有|\n\n|\tし|\n\n|\tて|\n\n|\tい|\n\n|\tませ|\n\n|\tん|\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\# named entity extraction (ner) in various languages \n\nnlu now support ner for over 60 languages, including korean, japanese, chinese and many more!   \n\n\\`\\`\\`python\n\n&amp;#x200b;\n\n\\# extract named chinese entities\n\npipe = nlu.load('zh.ner')\n\n\\# chinese for 'donald trump and angela merkel dont share many opinions'\n\nzh\\_data = \\['唐纳德特朗普和安吉拉·默克尔没有太多意见'\\]\n\ndf = pipe.predict(zh\\_data, output\\_level='document')\n\ndf\n\n\\&gt;&gt;&gt; output : \\[唐纳德, 安吉拉\\]\n\n&amp;#x200b;\n\n\\# now translate \\[唐纳德, 安吉拉\\] back to english with nlu!\n\ntranslate\\_pipe = nlu.load('zh.translate\\_to.en')\n\nen\\_entities = translate\\_pipe.predict(\\['唐纳德', '安吉拉'\\])\n\n\\&gt;&gt;&gt; output :\n\n\\`\\`\\`\n\n|translation|\tchinese| \n\n|------|------|\n\n|donald | 唐纳德 |\n\n|angela | \t安吉拉|\n\n&amp;#x200b;\n\n\\# new nlu notebooks\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\### nlu 1.1.0  new notebooks for new features\n\n\\- \\[translate between 192+ languages with marian\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/translation\\_demo.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/translation_demo.ipynb))\n\n\\- \\[try out the 18 tasks like summarization question answering and more on t5\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_tasks\\_summarize\\_question\\_answering\\_and\\_more](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_tasks_summarize_question_answering_and_more))\n\n\\- \\[t5 open and closed book question answering tutorial\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/sequence2sequence/t5\\_question\\_answering.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/sequence2sequence/t5_question_answering.ipynb))\n\n\\- \\[tokenize, extract pos and ner in chinese\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/chinese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/multilingual/chinese_ner_pos_and_tokenization.ipynb))\n\n\\- \\[tokenize, extract pos and ner in korean\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/korean\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/multilingual/korean_ner_pos_and_tokenization.ipynb))\n\n\\- \\[tokenize, extract pos and ner in japanese\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/multilingual/japanese\\_ner\\_pos\\_and\\_tokenization.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/multilingual/japanese_ner_pos_and_tokenization.ipynb))\n\n\\- \\[normalize documents\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/text\\_pre\\_processing\\_and\\_cleaning/document\\_normalizer\\_demo.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/text_pre_processing_and_cleaning/document_normalizer_demo.ipynb))\n\n\\- \\[aspect based sentiment ner sentiment for restaurants\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component\\_examples/named\\_entity\\_recognition\\_(ner)/aspect\\_based\\_ner\\_sentiment\\_restaurants.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/component_examples/named_entity_recognition_(ner)/aspect_based_ner_sentiment_restaurants.ipynb))\n\n&amp;#x200b;\n\n\\### nlu 1.1.0 new classifier training tutorials\n\n\\#### binary classifier training jupyter tutorials\n\n\\- \\[2 class finance news sentiment classifier training\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary\\_text\\_classification/nlu\\_training\\_sentiment\\_classifier\\_demo\\_apple\\_twitter.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary_text_classification/nlu_training_sentiment_classifier_demo_apple_twitter.ipynb))\n\n\\- \\[2 class reddit comment sentiment classifier training\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary\\_text\\_classification/nlu\\_training\\_sentiment\\_classifier\\_demo\\_reddit.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary_text_classification/nlu_training_sentiment_classifier_demo_reddit.ipynb))\n\n\\- \\[2 class apple tweets sentiment classifier training\\]([https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary\\_text\\_classification/nlu\\_training\\_sentiment\\_classifier\\_demo\\_imdb.ipynb](https://github.com/johnsnowlabs/nlu/blob/master/examples/colab/training/binary_text_classification/nlu_training_s", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/datascience/comments/l4cbvp/720_new_nlp_models_300_supported_languages/',)", "identifyer": 5588992, "year": "2021"}, {"autor": "compost_embedding", "date": 1615653409000, "content": "How to choose between a well-structured code base for all analysis, a collection of one-off scripts, and the spectrum in between? /!/ This question is primarily to understand how you all think of structuring your code and/or file system structure for projects. There are times when what I need to do is very well defined, and it's easy to think of a package structure for a version-controlled package of code within a Docker container that I can develop on and deploy. Other times I'm doing what seems like a simple \"one-off\" type of analysis that's meant to support or check the results of a more major line of work, do some computation and hand off something to someone else in a different format, etc. Often I'll do this type of work in a different directory that's not version controlled, because I don't want to complicate it by adding it to my clean code base or create options for my existing code base that are unlikely to be used in the future and will complicate its interface. However, sometimes these \"one-offs\" build momentum, and become more persistent and important, and I often struggle with finding the right time to put them into the official package (or their own) versus letting them exist on the side as one-offs (and modifications thereof).\n\nA related issue is that when my code is not structured into a well-thought out package, my directory structure tends to look like this:\n\n    .\n    └── new_project\n        ├── data_prep\n        │   ├── prepare_data.py\n        │   └── raw_data\n        │       └── raw_data_file\n        └── run_model\n            ├── model_code.py\n            └── try_with_mod\n                ├── model_code1.py\n                ├── output_explore.ipynb\n                ├── with_more_iterations\n                │   └── model_code1.py\n                └── write_out_intermediate_for_jim\n                    └── model_code1_for_jim.py\n\nThe problem with this structure is a couple things:\n\n(1) Sometimes the number of \\`try\\_with\\_mod\\` trees can get pretty nested in ways which are difficult to manage from a git branch perspective. On the other hand, when they do get nested they do convey useful information on the time-ordered progression of my projects, something that branching in git doesn't necessarily preserve. That time-ordered progression is one of the main reasons I keep this directory structure and have to actively fight against it.\n\n(2) The code I put into \\`write\\_out\\_intermediate\\_for\\_jim\\` is usually something quick and hacky to give someone an intermediate result and is not version controlled. Not having it version controlled or documented is just not a great practice.\n\nDo any of you struggle with these types of situations? How do you view the trade-offs of clean, well organized code bases versus one-offs? Do you have a better way or organizing your one-offs than to create subdirectories like I've outlined here?", "link": "https://www.reddit.com/r/datascience/comments/m49u2i/how_to_choose_between_a_wellstructured_code_base/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "how to choose between a well-structured code base for all analysis, a collection of one-off scripts, and the spectrum in between? /!/ this question is primarily to understand how you all think of structuring your code and/or file system structure for projects. there are times when what i need to do is very well defined, and it's easy to think of a package structure for a version-controlled package of code within a docker container that i can develop on and deploy. other times i'm doing what seems like a simple \"one-off\" type of analysis that's meant to support or check the results of a more major line of work, do some computation and hand off something to someone else in a different format, etc. often i'll do this type of work in a different directory that's not version controlled, because i don't want to complicate it by adding it to my clean code base or create options for my existing code base that are unlikely to be used in the future and will complicate its interface. however, sometimes these \"one-offs\" build momentum, and become more persistent and important, and i often struggle with finding the right time to put them into the official package (or their own) versus letting them exist on the side as one-offs (and modifications thereof).\n\na related issue is that when my code is not structured into a well-thought out package, my directory structure tends to look like this:\n\n    .\n    └── new_project\n        ├── data_prep\n        │   ├── prepare_data.py\n        │   └── raw_data\n        │       └── raw_data_file\n        └── run_model\n            ├── model_code.py\n            └── try_with_mod\n                ├── model_code1.py\n                ├── output_explore.ipynb\n                ├── with_more_iterations\n                │   └── model_code1.py\n                └── write_out_intermediate_for_jim\n                    └── model_code1_for_jim.py\n\nthe problem with this structure is a couple things:\n\n(1) sometimes the number of \\`try\\_with\\_mod\\` trees can get pretty nested in ways which are difficult to manage from a git -----> branch !!!  perspective. on the other hand, when they do get nested they do convey useful information on the time-ordered progression of my projects, something that branching in git doesn't necessarily preserve. that time-ordered progression is one of the main reasons i keep this directory structure and have to actively fight against it.\n\n(2) the code i put into \\`write\\_out\\_intermediate\\_for\\_jim\\` is usually something quick and hacky to give someone an intermediate result and is not version controlled. not having it version controlled or documented is just not a great practice.\n\ndo any of you struggle with these types of situations? how do you view the trade-offs of clean, well organized code bases versus one-offs? do you have a better way or organizing your one-offs than to create subdirectories like i've outlined here?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/m49u2i/how_to_choose_between_a_wellstructured_code_base/',)", "identifyer": 5589156, "year": "2021"}, {"autor": "diogobarrios", "date": 1620420451000, "content": "Laptop advice /!/ Hi everyone!\n\nWhat's your advice for a good deal in a laptop to work in this branch? I've google it but what I've been reading isn't clear enough, kind of  a minimum of 16GB of RAM and a good graphic card to get faster results with big data. The goal here is to work and learn on self projects, publishing it in github, or even in my own web page someday.\n\nThanks in advance!", "link": "https://www.reddit.com/r/datascience/comments/n78k77/laptop_advice/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "laptop advice /!/ hi everyone!\n\nwhat's your advice for a good deal in a laptop to work in this -----> branch !!! ? i've google it but what i've been reading isn't clear enough, kind of  a minimum of 16gb of ram and a good graphic card to get faster results with big data. the goal here is to work and learn on self projects, publishing it in github, or even in my own web page someday.\n\nthanks in advance!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/n78k77/laptop_advice/',)", "identifyer": 5589455, "year": "2021"}, {"autor": "Cold-Disk-9936", "date": 1614201214000, "content": "How to approach market segmentation for company branches that are similar /!/ [removed]", "link": "https://www.reddit.com/r/datascience/comments/lrnjzs/how_to_approach_market_segmentation_for_company/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "how to approach market segmentation for company -----> branches !!!  that are similar /!/ [removed]", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/lrnjzs/how_to_approach_market_segmentation_for_company/',)", "identifyer": 5589600, "year": "2021"}, {"autor": "Worried_Lawfulness43", "date": 1624842541000, "content": "Is going into Data science ideal for AI research/engineering? /!/ I am new to the study of computer science, but have found it to be the career path I lost want to go down. I was recently presented with the opportunity to apply for this internship learning data science, or alternatively software engineering.\n\nI am extremely interested in AI research, but I found that when it comes to CS, a lot of career paths interest me in the field. I’ve been told that data science tends to be uninteresting and math heavy, while Software engineering is far more versatile and useful. \n\nI should also mention I have dyscalculia, a math learning disorder, so I worry that the disorder will make it harder for me to understand certain concepts, though I’m willing to try regardless. \n\nIn the experience of people on this subreddit, what is the more important branch in AI research? Software or data science? Which career path is the better bet long term? I see varied answered when I google this.", "link": "https://www.reddit.com/r/datascience/comments/o99ty9/is_going_into_data_science_ideal_for_ai/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "is going into data science ideal for ai research/engineering? /!/ i am new to the study of computer science, but have found it to be the career path i lost want to go down. i was recently presented with the opportunity to apply for this internship learning data science, or alternatively software engineering.\n\ni am extremely interested in ai research, but i found that when it comes to cs, a lot of career paths interest me in the field. i’ve been told that data science tends to be uninteresting and math heavy, while software engineering is far more versatile and useful. \n\ni should also mention i have dyscalculia, a math learning disorder, so i worry that the disorder will make it harder for me to understand certain concepts, though i’m willing to try regardless. \n\nin the experience of people on this subreddit, what is the more important -----> branch !!!  in ai research? software or data science? which career path is the better bet long term? i see varied answered when i google this.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/o99ty9/is_going_into_data_science_ideal_for_ai/',)", "identifyer": 5589739, "year": "2021"}, {"autor": "Mets_28", "date": 1626025424000, "content": "I suck at Classical Statistics /!/ I'm pursuing a data science degree because I'm passionate about solving real-world problems within the framework of data. The issue I'm facing is I am really not good with classical statistics, conceptually I get the core stuff normal distributions, variance, confidence intervals, hypothesis testing and can memorize formulas but once it gets out of that box and into something like a Poisson or binomial distribution inferencing, sampling... I struggle to wrap my head around the concepts. My question is do I need to double down here like spend my nights reading or can I get by with a fundamental understanding of statistics in a real data science role? I'm not a working data scientist yet, but idea is to branch out on my own someday once I get comfortable doing some side projects.", "link": "https://www.reddit.com/r/datascience/comments/oi8ze9/i_suck_at_classical_statistics/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "i suck at classical statistics /!/ i'm pursuing a data science degree because i'm passionate about solving real-world problems within the framework of data. the issue i'm facing is i am really not good with classical statistics, conceptually i get the core stuff normal distributions, variance, confidence intervals, hypothesis testing and can memorize formulas but once it gets out of that box and into something like a poisson or binomial distribution inferencing, sampling... i struggle to wrap my head around the concepts. my question is do i need to double down here like spend my nights reading or can i get by with a fundamental understanding of statistics in a real data science role? i'm not a working data scientist yet, but idea is to -----> branch !!!  out on my own someday once i get comfortable doing some side projects.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oi8ze9/i_suck_at_classical_statistics/',)", "identifyer": 5590929, "year": "2021"}, {"autor": "BullCityPicker", "date": 1622035733000, "content": "Ideal Text Analytics Data Structure -- One Document at a time, or one Row at a Time? /!/ I just got tossed an interesting problem by management.   There's a lot of a certain type of document laying out agreements between labor/mgmt at the local branches, and a poor understanding at the top over what topics occur regularly in these documents.  It's over a thousand .txt documents, up to about 15k characters in each, so there's a lot to look through, and therefore, text analytics to the rescue.\n\nI just got finished reading them all into Hadoop and turning them into a big table of the form:\n\nRow = LineOfText,OriginalDocumentName\n\n&amp;#x200B;\n\nBefore I get too far into the modeling part, I'm wondering if this is the best form to have the data in, or whether I'd do better with a format of:\n\nRow = EntireDocument, OriginalDocumentName\n\n&amp;#x200B;\n\nMy tools will be SAS Viya's text analytics primarily because I like the concept modeling part, and some R package like tidytext and whatever I can find for concept formation (R is my real go-to language, but I'm a bit of a noob in text analytics, and don't fully understand those packages yet.)  I've done some with Python's nltk and similar packages, although I'm expert level in R, and struggle some in Python.\n\nAny thoughts about what's the best general format to use -- one line at a time, or the entire document at a time?   By the way, the documents come from a variety of sources like Word, PDF, and OCR input, and are pretty low quality in terms of misread or mangled words, white space, and weird control characters.  I'm not sure there's an obvious way to skip the line feeds in a Hive import to get to the second document-as-a-row format, but I can cross that bridge later, and have a few databases whizzes on my team that could help me figure it out if needed.", "link": "https://www.reddit.com/r/datascience/comments/nlh1wv/ideal_text_analytics_data_structure_one_document/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "ideal text analytics data structure -- one document at a time, or one row at a time? /!/ i just got tossed an interesting problem by management.   there's a lot of a certain type of document laying out agreements between labor/mgmt at the local -----> branches !!! , and a poor understanding at the top over what topics occur regularly in these documents.  it's over a thousand .txt documents, up to about 15k characters in each, so there's a lot to look through, and therefore, text analytics to the rescue.\n\ni just got finished reading them all into hadoop and turning them into a big table of the form:\n\nrow = lineoftext,originaldocumentname\n\n&amp;#x200b;\n\nbefore i get too far into the modeling part, i'm wondering if this is the best form to have the data in, or whether i'd do better with a format of:\n\nrow = entiredocument, originaldocumentname\n\n&amp;#x200b;\n\nmy tools will be sas viya's text analytics primarily because i like the concept modeling part, and some r package like tidytext and whatever i can find for concept formation (r is my real go-to language, but i'm a bit of a noob in text analytics, and don't fully understand those packages yet.)  i've done some with python's nltk and similar packages, although i'm expert level in r, and struggle some in python.\n\nany thoughts about what's the best general format to use -- one line at a time, or the entire document at a time?   by the way, the documents come from a variety of sources like word, pdf, and ocr input, and are pretty low quality in terms of misread or mangled words, white space, and weird control characters.  i'm not sure there's an obvious way to skip the line feeds in a hive import to get to the second document-as-a-row format, but i can cross that bridge later, and have a few databases whizzes on my team that could help me figure it out if needed.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 19, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/nlh1wv/ideal_text_analytics_data_structure_one_document/',)", "identifyer": 5591111, "year": "2021"}, {"autor": "-Nicolas-Bourbaki-", "date": 1630073953000, "content": "Starting an open-source Data Analytic Project to help small/medium businesses to compete /!/ Hello fellow people,\n\nI am going to start an open-source project with the goal to bring data analytics to small and medium businesses to discover patterns in their data. This will help them to compete with the big players in any branch of industry. \n\nWith big attention to cleaning dirty datasets and making them accessable to a lot of people. The target group are research groups and small to medium businesses.\n\nThe process is as follows:\n\n(1) Gathering some data of any process ... for example the supply chain of a steel producer\n\n(2) Building a model to map the process from the real world to a math problem\n\n(3) Feed the model with cleaned data and ask question about the model ... for example to get new insights and bottlenecks in why a specific alloy is scarce.\n\n&amp;#x200B;\n\nSome key principles will be to design the UI so that any business person with no background in computer engineering could apply the model building and insight creating to their needs.\n\n&amp;#x200B;\n\nThe goal is to build a large library of templates for any branch of industry to use with the idea of open-source in mind.\n\n&amp;#x200B;\n\nI think that no big corporation should benefit financially from the data of others. With this in mind I believe that this project should result in a company that benefits the user instead of a small group of board members.\n\n&amp;#x200B;\n\nI am doing this post with the hope that some enthusiastic people in the data analytic/science community will help to bring this project to live. So if anyone is interested in joining this open-source project just let me know.\n\n&amp;#x200B;\n\nquestions/opinions ?", "link": "https://www.reddit.com/r/datascience/comments/pcoa6f/starting_an_opensource_data_analytic_project_to/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "starting an open-source data analytic project to help small/medium businesses to compete /!/ hello fellow people,\n\ni am going to start an open-source project with the goal to bring data analytics to small and medium businesses to discover patterns in their data. this will help them to compete with the big players in any -----> branch !!!  of industry. \n\nwith big attention to cleaning dirty datasets and making them accessable to a lot of people. the target group are research groups and small to medium businesses.\n\nthe process is as follows:\n\n(1) gathering some data of any process ... for example the supply chain of a steel producer\n\n(2) building a model to map the process from the real world to a math problem\n\n(3) feed the model with cleaned data and ask question about the model ... for example to get new insights and bottlenecks in why a specific alloy is scarce.\n\n&amp;#x200b;\n\nsome key principles will be to design the ui so that any business person with no background in computer engineering could apply the model building and insight creating to their needs.\n\n&amp;#x200b;\n\nthe goal is to build a large library of templates for any branch of industry to use with the idea of open-source in mind.\n\n&amp;#x200b;\n\ni think that no big corporation should benefit financially from the data of others. with this in mind i believe that this project should result in a company that benefits the user instead of a small group of board members.\n\n&amp;#x200b;\n\ni am doing this post with the hope that some enthusiastic people in the data analytic/science community will help to bring this project to live. so if anyone is interested in joining this open-source project just let me know.\n\n&amp;#x200b;\n\nquestions/opinions ?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pcoa6f/starting_an_opensource_data_analytic_project_to/',)", "identifyer": 5591826, "year": "2021"}, {"autor": "-Nicolas-Bourbaki-", "date": 1630073468000, "content": "Starting an open-source Data Analytic Service for reasearch/business /!/ Hello fellow people,\n\nI am going to start an open-source project with the goal to bring data analytics to small and medium businesses to discover patterns in their data. This will help them to compete with the big players in any branch of industry. \n\nWith big attention to cleaning dirty datasets and making them accessable to a lot of people. The target group are research groups and small to medium businesses.\n\nThe process is as follows:\n\n(1) Gathering some data of any process ... for example the supply chain of a steel producer\n\n(2) Building a model to map the process from the real world to a math problem\n\n(3) Feed the model with cleaned data and ask question about the model ... for example to get new insights and bottlenecks in why a specific alloy is scarce.\n\n&amp;#x200B;\n\nSome key principles will be to design the UI so that any business person with no background in computer engineering could apply the model building and insight creating to their needs.\n\n&amp;#x200B;\n\nThe goal is to build a large library of templates for any branch of industry to use with the idea of open-source in mind.\n\n&amp;#x200B;\n\nI think that no big corporation should benefit financially from the data of others. With this in mind I believe that this project should result in a company that benefits the user instead of a small group of board members.\n\n&amp;#x200B;\n\nI am doing this post with the hope that some enthusiastic people in the data analytic/science community will help to bring this project to live. So if anyone is interested in joining this open-source project just let me know.\n\n&amp;#x200B;\n\nquestions/opinions ?", "link": "https://www.reddit.com/r/datascience/comments/pco4td/starting_an_opensource_data_analytic_service_for/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "starting an open-source data analytic service for reasearch/business /!/ hello fellow people,\n\ni am going to start an open-source project with the goal to bring data analytics to small and medium businesses to discover patterns in their data. this will help them to compete with the big players in any -----> branch !!!  of industry. \n\nwith big attention to cleaning dirty datasets and making them accessable to a lot of people. the target group are research groups and small to medium businesses.\n\nthe process is as follows:\n\n(1) gathering some data of any process ... for example the supply chain of a steel producer\n\n(2) building a model to map the process from the real world to a math problem\n\n(3) feed the model with cleaned data and ask question about the model ... for example to get new insights and bottlenecks in why a specific alloy is scarce.\n\n&amp;#x200b;\n\nsome key principles will be to design the ui so that any business person with no background in computer engineering could apply the model building and insight creating to their needs.\n\n&amp;#x200b;\n\nthe goal is to build a large library of templates for any branch of industry to use with the idea of open-source in mind.\n\n&amp;#x200b;\n\ni think that no big corporation should benefit financially from the data of others. with this in mind i believe that this project should result in a company that benefits the user instead of a small group of board members.\n\n&amp;#x200b;\n\ni am doing this post with the hope that some enthusiastic people in the data analytic/science community will help to bring this project to live. so if anyone is interested in joining this open-source project just let me know.\n\n&amp;#x200b;\n\nquestions/opinions ?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pco4td/starting_an_opensource_data_analytic_service_for/',)", "identifyer": 5591827, "year": "2021"}, {"autor": "Experimentalphone", "date": 1630056758000, "content": "Given that I have a BS in Economics and an MBA, what careers in Data (if any) can I realistically switch to with just a certificate program? /!/ I am a 30 year old man from Bangladesh. I have a BS in Economics and an MBA, both from universities in Bangladesh.\n\nI am working at a retail bank branch as a universal banker/customer service officer for 3.5 years now. The work life balance is horrible with me being out of home for work from 8am till 10pm, five days a week (office is from 9am till 8:30pm). I want to totally leave the financial industry (banking, insurance, financial institution) and anything related to finance. \n\nI am at a point in life that due to personal circumstances of having a fulltime job and caregiving, I cannot afford to spend the time and money  on a Bachelors or Master's degree. At best I can do an online certificate course like the Data Science Certification from Google. \n\nThere aren't many jobs in Data in Bangladesh and those that are, only allows those with Bachelors in CS to apply. For non-CS graduates, you only get to be an MIS analyst (doing all the excel work and building report presentations). My aim is therefore to aim for remote online data science jobs based in foreign countries that I can do remotely from Bangladesh. I am also looking for something that has a career-track/career progression. \n\nNow I was wondering, are there ANY career-tracks/occupations in the world of data that I can *realistically* switch to right now (or I can switch to with a certificate)? \n\nPS: By the phrase world of data, I am referring to careers in Data Science, Big Data, Analytics, Excel or *anything* related to data. I hear that careers in data have huge demand and low supply of talent and it pays decently and has great work-life balance so that's why the interest. Also, the key word here is realistically, because there is no point in spending a thousand USD (which is a lot in my currency) for a course and certificate and spending 2000 hours and then finding out that my resume will be screened out the moment it is sent because I don't have a degree in CS.", "link": "https://www.reddit.com/r/datascience/comments/pcjzts/given_that_i_have_a_bs_in_economics_and_an_mba/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "given that i have a bs in economics and an mba, what careers in data (if any) can i realistically switch to with just a certificate program? /!/ i am a 30 year old man from bangladesh. i have a bs in economics and an mba, both from universities in bangladesh.\n\ni am working at a retail bank -----> branch !!!  as a universal banker/customer service officer for 3.5 years now. the work life balance is horrible with me being out of home for work from 8am till 10pm, five days a week (office is from 9am till 8:30pm). i want to totally leave the financial industry (banking, insurance, financial institution) and anything related to finance. \n\ni am at a point in life that due to personal circumstances of having a fulltime job and caregiving, i cannot afford to spend the time and money  on a bachelors or master's degree. at best i can do an online certificate course like the data science certification from google. \n\nthere aren't many jobs in data in bangladesh and those that are, only allows those with bachelors in cs to apply. for non-cs graduates, you only get to be an mis analyst (doing all the excel work and building report presentations). my aim is therefore to aim for remote online data science jobs based in foreign countries that i can do remotely from bangladesh. i am also looking for something that has a career-track/career progression. \n\nnow i was wondering, are there any career-tracks/occupations in the world of data that i can *realistically* switch to right now (or i can switch to with a certificate)? \n\nps: by the phrase world of data, i am referring to careers in data science, big data, analytics, excel or *anything* related to data. i hear that careers in data have huge demand and low supply of talent and it pays decently and has great work-life balance so that's why the interest. also, the key word here is realistically, because there is no point in spending a thousand usd (which is a lot in my currency) for a course and certificate and spending 2000 hours and then finding out that my resume will be screened out the moment it is sent because i don't have a degree in cs.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 13, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pcjzts/given_that_i_have_a_bs_in_economics_and_an_mba/',)", "identifyer": 5591829, "year": "2021"}, {"autor": "bruhimafrogok", "date": 1630042657000, "content": "Should I pursue data science as a career? /!/ I finished my undergrads in Biomedical Engineering, but it was really confusing for me due to so many different branches coming together and causing a chaos, and after that I've just started hating engineering altogether. I didn't know what to do next so I read into data science and I really liked the idea of knowing statistics, programming and having specific knowledge of something/domain (which was more targeted as compared to BME), and using information to your advantage. So I thought of giving it a shot, but I come across a lot of negativity about it that it is overhyped, and not worth it, the pay isn't that great, lots of office politics and what not.\nI had several questions about this, 1) can you work remotely, or as a digital nomad when you're a data scientist?\n2) What are the working conditions like in reality? \n3) What is the employment rate for data science? Do you find a job immediately?", "link": "https://www.reddit.com/r/datascience/comments/pch3gm/should_i_pursue_data_science_as_a_career/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "should i pursue data science as a career? /!/ i finished my undergrads in biomedical engineering, but it was really confusing for me due to so many different -----> branches !!!  coming together and causing a chaos, and after that i've just started hating engineering altogether. i didn't know what to do next so i read into data science and i really liked the idea of knowing statistics, programming and having specific knowledge of something/domain (which was more targeted as compared to bme), and using information to your advantage. so i thought of giving it a shot, but i come across a lot of negativity about it that it is overhyped, and not worth it, the pay isn't that great, lots of office politics and what not.\ni had several questions about this, 1) can you work remotely, or as a digital nomad when you're a data scientist?\n2) what are the working conditions like in reality? \n3) what is the employment rate for data science? do you find a job immediately?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pch3gm/should_i_pursue_data_science_as_a_career/',)", "identifyer": 5591833, "year": "2021"}, {"autor": "Roughneck16", "date": 1617898846000, "content": "Eastern University - MS in Data Science | My review /!/ So I'm currently enrolled in [Eastern University's online MS in Data Science](https://www.eastern.edu/academics/graduate-programs/ms-data-science). I haven't finished the degree yet, but I'm far enough into it that I can give an honest assessment for those interested in enrolling.\n\n# First, the good stuff:\n\n* Eastern University puts their students first. The professors, administrators, and admissions staff at EU have it together when it comes to solving problems and interacting with students. They usually respond to my emails within an hour and give helpful feedback.\n* EU is *super* military-friendly. I'm using the Post-9/11 GI Bill to fund my studies. If you have 100% GI Bill, then you get a degree for free and pocket *at least* $15k in stipends. Even if you only have 60% GI Bill like I do, you'll still net around $6k. At Eastern, you only need to take *one class* at a time to qualify as a full-time student, so you can collect that $894/month stipend while only enrolled in a single class. They also offer a $30 per credit discount for veterans and active duty personnel. If you're using tuition assistance while serving, the *whole program* will only cost you $500 out of pocket, which is an *insanely* good deal for a graduate degree.\n* Everything is self-directed. No weekly modules. If you burn the midnight oil, you can finish an entire seven-week course in just a week or two! That's quite convenient if you're a full-time working professional with an unpredictable schedule.\n* The professor's videos give a clear description on how to use programming languages. I enrolled with *zero* programming experience, but they hold your hand through the whole thing and explain in detail how it all works at a theoretical level. I usually have the instructional videos open in one window and my Python editor open in another so I can pause and play around with it. It's an effective way to learn.\n\n# And, there are a few drawbacks:\n\n* Academically, it's not super challenging. For example, all the assignments can be retaken until you get the grade you want. Also, as an online program, it's possible for an unscrupulous student to cheat their way through, although I have no idea why someone would spend all this money on a degree to learn data science and then just \"coast\" through the program. If you want to gain proficiency with Python, R, statistics, etc., you'll have to practice writing code and crunching numbers on your own in addition to the class assignments. They do, however, provide you with all the learning materials you need to gain proficiency.\n* The student account website isn't the most user-friendly. Simply signing up for a new class is a drawn-out, cumbersome process that took me a while to figure out. The learning management system they use, Brightspace, isn't the most efficient either.\n\n# The bottom line:\n\nI know this sounds cliche, but **you'll get out of this program what you put into it**. If you only do the bare minimum to pass each course, you can pay all this money just to get a fancy diploma, but lack the data science knowledge to succeed in the real world. If you go the extra mile and take time to master the material on your own, you'll have a strong enough foundation in data science to get into the industry, gain experience, and build a successful career in a lucrative field. EU's program is a convenient and affordable option for working professionals who want to branch out into data science and have the motivation to work for it.\n\n# And now, I'll answer a few Frequently Asked Questions:\n\n**How much time per week would I need to put in as a student?**  \nIt varies depending on how much time you need to practice and how many classes you take. Each course is seven weeks long. I've been taking one course per term while working full-time as a civil engineer, part-time as a national guard officer, and taking care of my 9-month old daughter and I still have had plenty of time to finish each class with a few weeks to spare. If you plan ahead each week, it's possible to balance this program with a full-time job.  \n\n\n**Eastern University isn't as prestigious/high-ranking as (for example) UT-Austin or Georgia Tech. How will employers judge a degree from EU?**  \nI wouldn't worry too much about university rankings. Once you're in the industry and have experience, no one cares where you got your degree. You'll also find that many data scientists are completely self-taught and have degrees in unrelated subjects. Some of them don't have degrees at all! For example, my brother attended a bottom-tier, open-enrollment university and studied computer science for a few semesters before dropping out. Even though he never finished his degree, he became proficient at writing code and now makes six figures as a software engineer. All you have to do is get good enough at writing the code to pass a technical interview to make yourself marketable.  \n\n\n**Do I even need a degree for this career field? Isn't it possible to learn data science simply by watching YouTube videos?**  \nYes, it is possible to learn data science on your own, but the structure of a degree program makes it easier to keep a consistent study schedule. It also gives you something palpable to list on a resume when you start applying for jobs. As I've stated earlier, many private sector tech companies are loose on degree requirements, *however* government and military jobs stipulate certain degrees for their applicants. I currently work for DOD as an engineer, and every time I apply for a new position within our department, I have to submit my transcript along with it. An MS in Data Science can help you land a federal job as a data engineer, operations research analyst, statistician, etc. \n\nIf you have further questions, don't hesitate to ask!", "link": "https://www.reddit.com/r/datascience/comments/mmvd91/eastern_university_ms_in_data_science_my_review/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "eastern university - ms in data science | my review /!/ so i'm currently enrolled in [eastern university's online ms in data science](https://www.eastern.edu/academics/graduate-programs/ms-data-science). i haven't finished the degree yet, but i'm far enough into it that i can give an honest assessment for those interested in enrolling.\n\n# first, the good stuff:\n\n* eastern university puts their students first. the professors, administrators, and admissions staff at eu have it together when it comes to solving problems and interacting with students. they usually respond to my emails within an hour and give helpful feedback.\n* eu is *super* military-friendly. i'm using the post-9/11 gi bill to fund my studies. if you have 100% gi bill, then you get a degree for free and pocket *at least* $15k in stipends. even if you only have 60% gi bill like i do, you'll still net around $6k. at eastern, you only need to take *one class* at a time to qualify as a full-time student, so you can collect that $894/month stipend while only enrolled in a single class. they also offer a $30 per credit discount for veterans and active duty personnel. if you're using tuition assistance while serving, the *whole program* will only cost you $500 out of pocket, which is an *insanely* good deal for a graduate degree.\n* everything is self-directed. no weekly modules. if you burn the midnight oil, you can finish an entire seven-week course in just a week or two! that's quite convenient if you're a full-time working professional with an unpredictable schedule.\n* the professor's videos give a clear description on how to use programming languages. i enrolled with *zero* programming experience, but they hold your hand through the whole thing and explain in detail how it all works at a theoretical level. i usually have the instructional videos open in one window and my python editor open in another so i can pause and play around with it. it's an effective way to learn.\n\n# and, there are a few drawbacks:\n\n* academically, it's not super challenging. for example, all the assignments can be retaken until you get the grade you want. also, as an online program, it's possible for an unscrupulous student to cheat their way through, although i have no idea why someone would spend all this money on a degree to learn data science and then just \"coast\" through the program. if you want to gain proficiency with python, r, statistics, etc., you'll have to practice writing code and crunching numbers on your own in addition to the class assignments. they do, however, provide you with all the learning materials you need to gain proficiency.\n* the student account website isn't the most user-friendly. simply signing up for a new class is a drawn-out, cumbersome process that took me a while to figure out. the learning management system they use, brightspace, isn't the most efficient either.\n\n# the bottom line:\n\ni know this sounds cliche, but **you'll get out of this program what you put into it**. if you only do the bare minimum to pass each course, you can pay all this money just to get a fancy diploma, but lack the data science knowledge to succeed in the real world. if you go the extra mile and take time to master the material on your own, you'll have a strong enough foundation in data science to get into the industry, gain experience, and build a successful career in a lucrative field. eu's program is a convenient and affordable option for working professionals who want to -----> branch !!!  out into data science and have the motivation to work for it.\n\n# and now, i'll answer a few frequently asked questions:\n\n**how much time per week would i need to put in as a student?**  \nit varies depending on how much time you need to practice and how many classes you take. each course is seven weeks long. i've been taking one course per term while working full-time as a civil engineer, part-time as a national guard officer, and taking care of my 9-month old daughter and i still have had plenty of time to finish each class with a few weeks to spare. if you plan ahead each week, it's possible to balance this program with a full-time job.  \n\n\n**eastern university isn't as prestigious/high-ranking as (for example) ut-austin or georgia tech. how will employers judge a degree from eu?**  \ni wouldn't worry too much about university rankings. once you're in the industry and have experience, no one cares where you got your degree. you'll also find that many data scientists are completely self-taught and have degrees in unrelated subjects. some of them don't have degrees at all! for example, my brother attended a bottom-tier, open-enrollment university and studied computer science for a few semesters before dropping out. even though he never finished his degree, he became proficient at writing code and now makes six figures as a software engineer. all you have to do is get good enough at writing the code to pass a technical interview to make yourself marketable.  \n\n\n**do i even need a degree for this career field? isn't it possible to learn data science simply by watching youtube videos?**  \nyes, it is possible to learn data science on your own, but the structure of a degree program makes it easier to keep a consistent study schedule. it also gives you something palpable to list on a resume when you start applying for jobs. as i've stated earlier, many private sector tech companies are loose on degree requirements, *however* government and military jobs stipulate certain degrees for their applicants. i currently work for dod as an engineer, and every time i apply for a new position within our department, i have to submit my transcript along with it. an ms in data science can help you land a federal job as a data engineer, operations research analyst, statistician, etc. \n\nif you have further questions, don't hesitate to ask!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 89, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mmvd91/eastern_university_ms_in_data_science_my_review/',)", "identifyer": 5592201, "year": "2021"}, {"autor": "_kochino", "date": 1619039223000, "content": "Your Degree Choice: Computer Science vs Data Science /!/ I am interested in discussing and hearing the various approaches some of the members here took when pursuing their career in DS/tech. \n\n1) If college educated, did you go for a computer science degree or a data science degree? (I feel that this is a bit skewed since the DS track is pretty new)\n\n2) does the data science degree pigeon hole you in any way? I am currently a declared data science major and want to pursue that career but I also have deep interest in creating solutions to all sorts of problems. For example, build an app or coding for various things that do not necessarily have to do with data. I always see really cool ideas on the Python subreddit that inspire me to want to create awesome stuff. \n\n3a) does the skill set acquired from a CompSci education prep you enough to land a data science job? I ask this because I don’t want to graduate with a data science degree and not be able to branch off anywhere else. Idk how versatile it is, and I want to leave myself options to potentially branch off into other areas of tech if DS burns me out (something that I see in this subreddit pretty often).\n\n3b) do the skills one would gain from a data science degree give them enough chops to also do some side development in other things? Idk if this is a fancy “applied computer science” degree, which I think weakens it a bit? Not sure...\n\nI have a desire to pursue DS, but I have ideas for all sorts of things, so if I am going to go take classes and get a degree, I would hope that I can do a lot with it and I want to set myself up for as many opportunities as possible. I no coding languages have an element of DIY and self learning, but I know some employers really want certain degrees and in a way, I kind of get it.", "link": "https://www.reddit.com/r/datascience/comments/mvpgz2/your_degree_choice_computer_science_vs_data/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "your degree choice: computer science vs data science /!/ i am interested in discussing and hearing the various approaches some of the members here took when pursuing their career in ds/tech. \n\n1) if college educated, did you go for a computer science degree or a data science degree? (i feel that this is a bit skewed since the ds track is pretty new)\n\n2) does the data science degree pigeon hole you in any way? i am currently a declared data science major and want to pursue that career but i also have deep interest in creating solutions to all sorts of problems. for example, build an app or coding for various things that do not necessarily have to do with data. i always see really cool ideas on the python subreddit that inspire me to want to create awesome stuff. \n\n3a) does the skill set acquired from a compsci education prep you enough to land a data science job? i ask this because i don’t want to graduate with a data science degree and not be able to -----> branch !!!  off anywhere else. idk how versatile it is, and i want to leave myself options to potentially branch off into other areas of tech if ds burns me out (something that i see in this subreddit pretty often).\n\n3b) do the skills one would gain from a data science degree give them enough chops to also do some side development in other things? idk if this is a fancy “applied computer science” degree, which i think weakens it a bit? not sure...\n\ni have a desire to pursue ds, but i have ideas for all sorts of things, so if i am going to go take classes and get a degree, i would hope that i can do a lot with it and i want to set myself up for as many opportunities as possible. i no coding languages have an element of diy and self learning, but i know some employers really want certain degrees and in a way, i kind of get it.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mvpgz2/your_degree_choice_computer_science_vs_data/',)", "identifyer": 5593272, "year": "2021"}, {"autor": "bennie_jezz", "date": 1634063586000, "content": "Salary Negotiation /!/ I'm (36f) a data manger at a very large (international) research clinic and I manage the databases for two large NIH grant-funded research studies on dementia and Alzheimer's disease - these studies involve collaboration between the clinic and the local university - the clinic does research with the patient population and the university does complementary research with animal models and fluid biomarkers from the clinic patients. When i first started at this clinic i was a research coordinator for one of the studies and had not yet started grad school, but told them I had plans to in the future, which they encouraged.\n\nWhile I was working as a coordinator, I entered a Neuroscience PhD program at that same local university, and since then I've been permitted to work remotely for my job half of the time in order to accommodate the requirements of my degree. I'm in my third (out of 5) year of the PhD program. The clinic has been very flexible and accommodating of my PhD work. I still have to work full time but I can do some of that work from the lab or at home. Part of the reason they've been so flexible is because my PhD advisors are on the same grants as the clinic and we do a great deal of collaborative research together. However, when this \"promotion\" to data manager happened at the clinic, i did not receive a salary increase and my salary is prettyyyy bad for the field: about $3k net per month in a relatively expensive city. \n\nI struggle with asking for more because they have been so accommodating of my schooling. They seem to have the mentality that I'm just a grad student so they don't need to pay me like an adult (again I'm friggin' 36 years old, so I'm very much an adult. I do look young, and I think people just assume I'm like 25. Cool most of the time but not for salary negotiations). But there are several reasons why I think it would be reasonable to ask for more:\n\n1. The average pay for this position is almost twice what i make, and my responsibilities and experience have both increased quite a bit since I started with the clinic.\n\n2. We received \"merit increases\" of 1.5% this year, which is the only raise I've had in the last 3 years. This doesn't even keep up with inflation, and the housing market in my city has EXPLODED with homes prices being about 20% higher than last year.\n\n3. My split time at the clinic and university may actually be an asset to the clinic. We have two large databases we are trying to maintain for these studies, and none of the data from the university collaborators has been integrated into these yet. So by spending half my time at the school and maintaining relationships with the scientists there (I have very good relationships with most of them), I'm well situated for getting this data into our database and creating a full central repository for our studies. I have the technical knowledge of all of these branches of science that other employees at the clinic and other potential applicants simply will not have. I didn't have much database knowledge when I started but that has been easy to pick up. My manager had expressed his desire for me to learn some of the back end coding as well as some statistical analysis and I plan to do that once we have all the databases fully set up and integrated. \n\nSo, I have informally broached the subject once with my manager and he said we should discuss it with the budgeting team, since my pay comes from grant funds and we would have to figure out if there is money available to increase my pay (from my previous experience I'd guess this shouldn't be a  problem). My manager doesn't really directly deal with pay issues, but his approval would be necessary. As far as actually getting the increase to happen, this would be more likely the role of my supervisor.  I would honestly stay with this company for life if they would just pay me what I'm worth. I have a meeting this Friday with my supervisor and plan to be much more assertive about requesting a pay increase. My questions are:\n\n1. Do you have any general tips for effective salary negotiations. Do you see a specific strategy that you think would work in these circumstances?\n\n2. From your experiences in this field do you think i can demand much more? \n\n3. If so, how do you successfully navigate asking for a large salary increase?\n\n4. If they're not willing to increase my pay, would it be difficult to find another job that would accommodate my PhD work? \n\n\nTl;Dr please help me get a raise!!! I haven't had one in years and my pay sucks for what I do. I'm a data manager doing a Neuroscience PhD and my friend who makes sandwiches in Denver makes more than I do 😿.", "link": "https://www.reddit.com/r/datascience/comments/q6skr8/salary_negotiation/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "salary negotiation /!/ i'm (36f) a data manger at a very large (international) research clinic and i manage the databases for two large nih grant-funded research studies on dementia and alzheimer's disease - these studies involve collaboration between the clinic and the local university - the clinic does research with the patient population and the university does complementary research with animal models and fluid biomarkers from the clinic patients. when i first started at this clinic i was a research coordinator for one of the studies and had not yet started grad school, but told them i had plans to in the future, which they encouraged.\n\nwhile i was working as a coordinator, i entered a neuroscience phd program at that same local university, and since then i've been permitted to work remotely for my job half of the time in order to accommodate the requirements of my degree. i'm in my third (out of 5) year of the phd program. the clinic has been very flexible and accommodating of my phd work. i still have to work full time but i can do some of that work from the lab or at home. part of the reason they've been so flexible is because my phd advisors are on the same grants as the clinic and we do a great deal of collaborative research together. however, when this \"promotion\" to data manager happened at the clinic, i did not receive a salary increase and my salary is prettyyyy bad for the field: about $3k net per month in a relatively expensive city. \n\ni struggle with asking for more because they have been so accommodating of my schooling. they seem to have the mentality that i'm just a grad student so they don't need to pay me like an adult (again i'm friggin' 36 years old, so i'm very much an adult. i do look young, and i think people just assume i'm like 25. cool most of the time but not for salary negotiations). but there are several reasons why i think it would be reasonable to ask for more:\n\n1. the average pay for this position is almost twice what i make, and my responsibilities and experience have both increased quite a bit since i started with the clinic.\n\n2. we received \"merit increases\" of 1.5% this year, which is the only raise i've had in the last 3 years. this doesn't even keep up with inflation, and the housing market in my city has exploded with homes prices being about 20% higher than last year.\n\n3. my split time at the clinic and university may actually be an asset to the clinic. we have two large databases we are trying to maintain for these studies, and none of the data from the university collaborators has been integrated into these yet. so by spending half my time at the school and maintaining relationships with the scientists there (i have very good relationships with most of them), i'm well situated for getting this data into our database and creating a full central repository for our studies. i have the technical knowledge of all of these -----> branches !!!  of science that other employees at the clinic and other potential applicants simply will not have. i didn't have much database knowledge when i started but that has been easy to pick up. my manager had expressed his desire for me to learn some of the back end coding as well as some statistical analysis and i plan to do that once we have all the databases fully set up and integrated. \n\nso, i have informally broached the subject once with my manager and he said we should discuss it with the budgeting team, since my pay comes from grant funds and we would have to figure out if there is money available to increase my pay (from my previous experience i'd guess this shouldn't be a  problem). my manager doesn't really directly deal with pay issues, but his approval would be necessary. as far as actually getting the increase to happen, this would be more likely the role of my supervisor.  i would honestly stay with this company for life if they would just pay me what i'm worth. i have a meeting this friday with my supervisor and plan to be much more assertive about requesting a pay increase. my questions are:\n\n1. do you have any general tips for effective salary negotiations. do you see a specific strategy that you think would work in these circumstances?\n\n2. from your experiences in this field do you think i can demand much more? \n\n3. if so, how do you successfully navigate asking for a large salary increase?\n\n4. if they're not willing to increase my pay, would it be difficult to find another job that would accommodate my phd work? \n\n\ntl;dr please help me get a raise!!! i haven't had one in years and my pay sucks for what i do. i'm a data manager doing a neuroscience phd and my friend who makes sandwiches in denver makes more than i do 😿.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/q6skr8/salary_negotiation/',)", "identifyer": 5593371, "year": "2021"}, {"autor": "bennie_jezz", "date": 1634063224000, "content": "Tips for Salary Negotiation? /!/ I'm (36f) a data manger at a very large (international) research clinic and I manage the databases for two large NIH grant-funded research studies on dementia and Alzheimer's disease - these studies involve collaboration between the clinic and the local university - the clinic does research with the patient population and the university does complementary research with animal models and fluid biomarkers from the clinic patients. When i first started at this clinic i was a research coordinator for one of the studies and had not yet started grad school, but told them I had plans to in the future, which they encouraged.\n\nWhile I was working as a coordinator, I entered a Neuroscience PhD program at that same local university, and since then I've been permitted to work remotely for my job half of the time in order to accommodate the requirements of my degree. I'm in my third (out of 5) year of the PhD program. The clinic has been very flexible and accommodating of my PhD work. I still have to work full time but I can do some of that work from the lab or at home. Part of the reason they've been so flexible is because my PhD advisors are on the same grants as the clinic and we do a great deal of collaborative research together. However, when this \"promotion\" to data manager happened at the clinic, i did not receive a salary increase and my salary is prettyyyy bad for the field: about $3k net per month in a relatively expensive city. \n\nI struggle with asking for more because they have been so accommodating of my schooling. They seem to have the mentality that I'm just a grad student so they don't need to pay me like an adult (again I'm friggin' 36 years old, so I'm very much an adult. I do look young, and I think people just assume I'm like 25. Cool most of the time but not for salary negotiations). But there are several reasons why I think it would be reasonable to ask for more:\n\n1. The average pay for this position is almost twice what i make, and my responsibilities and experience have both increased quite a bit since I started with the clinic.\n\n2. We received \"merit increases\" of 1.5% this year, which is the only raise I've had in the last 3 years. This doesn't even keep up with inflation, and the housing market in my city has EXPLODED with homes prices being about 20% higher than last year.\n\n3. My split time at the clinic and university may actually be an asset to the clinic. We have two large databases we are trying to maintain for these studies, and none of the data from the university collaborators has been integrated into these yet. So by spending half my time at the school and maintaining relationships with the scientists there (I have very good relationships with most of them), I'm well situated for getting this data into our database and creating a full central repository for our studies. I have the technical knowledge of all of these branches of science that other employees at the clinic and other potential applicants simply will not have. I didn't have much database knowledge when u started but that had been easy to pick up. My manager had expressed his desire for me to learn some of the back end coding as well as some statistical analysis and I plan to do that once we have all the databases fully set up and integrated. \n\nSo, I have informally broached the subject once with my manager and he said we should discuss it with the budgeting team, since my pay comes from grant funds and we would have to figure out if there is money available to increase my pay (from my previous experience I'd guess this shouldn't be a  problem). My manager doesn't really directly deal with pay issues, but his approval would be necessary. As far as actually getting the increase to happen, this would be more likely the role if my supervisor.  I would honestly stay with this company for life if they would just pay me what I'm worth. I have a meeting this Friday with my supervisor and plan to be much more assertive about requesting a pay increase. My questions are:\n\n1. Do you have any general tips for effective salary negotiations. Do you see a specific strategy that you think would work in these circumstances?\n\n2. From your experiences in this field do you think i can demand much more? \n\n3. If so, how do you successfully navigate asking for a large salary increase?\n\n4. If they're not willing to increase my pay, would it be difficult to find another job that would accommodate my PhD work? \n\n\nTl;Dr please help me get a raise!!! I haven't had one in years and my pay sucks for what I do. I'm a data manager doing a Neuroscience PhD and my friend who makes sandwiches in Denver makes more than I do 😿", "link": "https://www.reddit.com/r/datascience/comments/q6sgdt/tips_for_salary_negotiation/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "tips for salary negotiation? /!/ i'm (36f) a data manger at a very large (international) research clinic and i manage the databases for two large nih grant-funded research studies on dementia and alzheimer's disease - these studies involve collaboration between the clinic and the local university - the clinic does research with the patient population and the university does complementary research with animal models and fluid biomarkers from the clinic patients. when i first started at this clinic i was a research coordinator for one of the studies and had not yet started grad school, but told them i had plans to in the future, which they encouraged.\n\nwhile i was working as a coordinator, i entered a neuroscience phd program at that same local university, and since then i've been permitted to work remotely for my job half of the time in order to accommodate the requirements of my degree. i'm in my third (out of 5) year of the phd program. the clinic has been very flexible and accommodating of my phd work. i still have to work full time but i can do some of that work from the lab or at home. part of the reason they've been so flexible is because my phd advisors are on the same grants as the clinic and we do a great deal of collaborative research together. however, when this \"promotion\" to data manager happened at the clinic, i did not receive a salary increase and my salary is prettyyyy bad for the field: about $3k net per month in a relatively expensive city. \n\ni struggle with asking for more because they have been so accommodating of my schooling. they seem to have the mentality that i'm just a grad student so they don't need to pay me like an adult (again i'm friggin' 36 years old, so i'm very much an adult. i do look young, and i think people just assume i'm like 25. cool most of the time but not for salary negotiations). but there are several reasons why i think it would be reasonable to ask for more:\n\n1. the average pay for this position is almost twice what i make, and my responsibilities and experience have both increased quite a bit since i started with the clinic.\n\n2. we received \"merit increases\" of 1.5% this year, which is the only raise i've had in the last 3 years. this doesn't even keep up with inflation, and the housing market in my city has exploded with homes prices being about 20% higher than last year.\n\n3. my split time at the clinic and university may actually be an asset to the clinic. we have two large databases we are trying to maintain for these studies, and none of the data from the university collaborators has been integrated into these yet. so by spending half my time at the school and maintaining relationships with the scientists there (i have very good relationships with most of them), i'm well situated for getting this data into our database and creating a full central repository for our studies. i have the technical knowledge of all of these -----> branches !!!  of science that other employees at the clinic and other potential applicants simply will not have. i didn't have much database knowledge when u started but that had been easy to pick up. my manager had expressed his desire for me to learn some of the back end coding as well as some statistical analysis and i plan to do that once we have all the databases fully set up and integrated. \n\nso, i have informally broached the subject once with my manager and he said we should discuss it with the budgeting team, since my pay comes from grant funds and we would have to figure out if there is money available to increase my pay (from my previous experience i'd guess this shouldn't be a  problem). my manager doesn't really directly deal with pay issues, but his approval would be necessary. as far as actually getting the increase to happen, this would be more likely the role if my supervisor.  i would honestly stay with this company for life if they would just pay me what i'm worth. i have a meeting this friday with my supervisor and plan to be much more assertive about requesting a pay increase. my questions are:\n\n1. do you have any general tips for effective salary negotiations. do you see a specific strategy that you think would work in these circumstances?\n\n2. from your experiences in this field do you think i can demand much more? \n\n3. if so, how do you successfully navigate asking for a large salary increase?\n\n4. if they're not willing to increase my pay, would it be difficult to find another job that would accommodate my phd work? \n\n\ntl;dr please help me get a raise!!! i haven't had one in years and my pay sucks for what i do. i'm a data manager doing a neuroscience phd and my friend who makes sandwiches in denver makes more than i do 😿", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/q6sgdt/tips_for_salary_negotiation/',)", "identifyer": 5593372, "year": "2021"}, {"autor": "HoomanGroovin", "date": 1624544559000, "content": "How to pathway into data science industry? /!/ Hi all,\n\nI am currently in the middle of my neuroscience PhD and do not use any predictive modelling tools or machine learning softwares in my research. \n\nCould people in the field please give me insight on how you got into this career and is it possible to get this role coming from a different background of science? If not, what do I need to learn to be a fit data analyst?\n\nI do not see my future in the lab, and once my PhD is complete, I want to branch into industry, but I am unsure where to go so I am doing my research from now.\n\nI appreciate any tips or advice. \n\nThank you:)", "link": "https://www.reddit.com/r/datascience/comments/o71w1g/how_to_pathway_into_data_science_industry/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "how to pathway into data science industry? /!/ hi all,\n\ni am currently in the middle of my neuroscience phd and do not use any predictive modelling tools or machine learning softwares in my research. \n\ncould people in the field please give me insight on how you got into this career and is it possible to get this role coming from a different background of science? if not, what do i need to learn to be a fit data analyst?\n\ni do not see my future in the lab, and once my phd is complete, i want to -----> branch !!!  into industry, but i am unsure where to go so i am doing my research from now.\n\ni appreciate any tips or advice. \n\nthank you:)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/o71w1g/how_to_pathway_into_data_science_industry/',)", "identifyer": 5593484, "year": "2021"}, {"autor": "Vyrezzz", "date": 1624458751000, "content": "Python Developer Role Disguised as Data Science /!/ I'm a CS student and i've recently been interviewing for several Data Science Internships, one of the companies was a walking red flag. Keep in mind that this wasn't a small startup, this was a huge Company (&gt; 10k employees).\n\nIt started when I applied for the position online, they responded after over a month, once I already had several offers. What was interesting was that they were the only company that called me as their first response and did not send a mail, which was a surprise but not a deal breaker to me. They wanted to make a short Teams interview, which I accepted since I wanted to have the Interview Training, but would only consider them if they would be a really great fit.\n\nSo far so good, we arrange an interview for the following Monday at 1 pm in the call.\n\nAbout 3 Hours after the call, they send me a Teams link via Mail, which was written pretty unprofessionally, and looked like they they hadn't put much thought in it. What I immediately notice was that the Teams Link they send me was for 11:30 am on Monday, not 1 pm like we had agreed upon, which was really strange. So I send them a mail asking when the Interview **really** is, and that I would be fine with both timeframes, but would like to know when. I get a response back about 2 hours later, saying that the other employee that would be present can't get to it at 1 pm, so they decided to move the Interview. I immediately see the red flag, they had just moved the Interview, without talking to me first, and didnt even think of telling me. I shrug it off and told them it was fine, since I was not planning on taking the job anyways.\n\nFast forward to Monday 11:30 am:\n\nI join the Teams Meeting, they start out with a little small talk/chit-chat. And we proceed to the Interview. They talk a little about what they do (at max 2 minutes) and then ask me to introduce myself, which I do and then we just do a standard interview which goes great for the most part. What they really emphasized at multiple points, was that they wanted to have an Intern for \"A long time\" so they were really straight forward, asking me for how many years I will study CS (probably so they can know for how long they can get away with paying me less), and proceed to talk about how they \"Keep their Interns for a long time\".\n\nThen one of them starts to list all the people in their branch, which was weird, since he didn't list a single Data Scientist (The role that the internship was for), which made me suspicious. Then, in the middle of the Interview I get to ask some Questions, so I ask what they will expect from the intern and what kind of task he be responsible for. When they answered I immediately thought \"Wow, that sounds alot like a Python Developer Role, not Data Science\", which made sense since they kept asking for my python skills, which as itself is not a problem since I am very comfortable with my Python knowledge, but it made me really sceptical, so I keep asking more specific Questions until im am certain of it. Since I was 100% sure that this wasn't a DS Role and I was not worried of not getting the Job, I ask \"Why did you call the Job listing Data Science when it sounds alot like a Python Developer Role?\". The answer was not what I thought, one of the Interviewers straight up told me to my face that they \"knew it was not a DS role, but decided to call it that anyway since its such a great buzzword, and they would get a lot more applicants that way\" (this is as close to a 100% quote as I can recall, so this is not exaggerated) , which really made me speechless. After that I just decided to play nice until the Interview was over, but had already decided that I was not going to take their offer, if they would make me one.\n\nFast Forward 2 Weeks:\n\nAfter they had told me that they would get back to me by the end of the Week, they didn't, and after two weeks I receive an Email that they had decided for another applicant (that poor dude). My guess is that they smelled that I didn't want to take the job anyways and if I did, I would not stay for long since it became pretty clear that I knew they were full of shit.\n\n&amp;#x200B;\n\nHas this happened to any of you? How common is it that companies try to disguise a Python Dev role as DS?", "link": "https://www.reddit.com/r/datascience/comments/o6dzyp/python_developer_role_disguised_as_data_science/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "python developer role disguised as data science /!/ i'm a cs student and i've recently been interviewing for several data science internships, one of the companies was a walking red flag. keep in mind that this wasn't a small startup, this was a huge company (&gt; 10k employees).\n\nit started when i applied for the position online, they responded after over a month, once i already had several offers. what was interesting was that they were the only company that called me as their first response and did not send a mail, which was a surprise but not a deal breaker to me. they wanted to make a short teams interview, which i accepted since i wanted to have the interview training, but would only consider them if they would be a really great fit.\n\nso far so good, we arrange an interview for the following monday at 1 pm in the call.\n\nabout 3 hours after the call, they send me a teams link via mail, which was written pretty unprofessionally, and looked like they they hadn't put much thought in it. what i immediately notice was that the teams link they send me was for 11:30 am on monday, not 1 pm like we had agreed upon, which was really strange. so i send them a mail asking when the interview **really** is, and that i would be fine with both timeframes, but would like to know when. i get a response back about 2 hours later, saying that the other employee that would be present can't get to it at 1 pm, so they decided to move the interview. i immediately see the red flag, they had just moved the interview, without talking to me first, and didnt even think of telling me. i shrug it off and told them it was fine, since i was not planning on taking the job anyways.\n\nfast forward to monday 11:30 am:\n\ni join the teams meeting, they start out with a little small talk/chit-chat. and we proceed to the interview. they talk a little about what they do (at max 2 minutes) and then ask me to introduce myself, which i do and then we just do a standard interview which goes great for the most part. what they really emphasized at multiple points, was that they wanted to have an intern for \"a long time\" so they were really straight forward, asking me for how many years i will study cs (probably so they can know for how long they can get away with paying me less), and proceed to talk about how they \"keep their interns for a long time\".\n\nthen one of them starts to list all the people in their -----> branch !!! , which was weird, since he didn't list a single data scientist (the role that the internship was for), which made me suspicious. then, in the middle of the interview i get to ask some questions, so i ask what they will expect from the intern and what kind of task he be responsible for. when they answered i immediately thought \"wow, that sounds alot like a python developer role, not data science\", which made sense since they kept asking for my python skills, which as itself is not a problem since i am very comfortable with my python knowledge, but it made me really sceptical, so i keep asking more specific questions until im am certain of it. since i was 100% sure that this wasn't a ds role and i was not worried of not getting the job, i ask \"why did you call the job listing data science when it sounds alot like a python developer role?\". the answer was not what i thought, one of the interviewers straight up told me to my face that they \"knew it was not a ds role, but decided to call it that anyway since its such a great buzzword, and they would get a lot more applicants that way\" (this is as close to a 100% quote as i can recall, so this is not exaggerated) , which really made me speechless. after that i just decided to play nice until the interview was over, but had already decided that i was not going to take their offer, if they would make me one.\n\nfast forward 2 weeks:\n\nafter they had told me that they would get back to me by the end of the week, they didn't, and after two weeks i receive an email that they had decided for another applicant (that poor dude). my guess is that they smelled that i didn't want to take the job anyways and if i did, i would not stay for long since it became pretty clear that i knew they were full of shit.\n\n&amp;#x200b;\n\nhas this happened to any of you? how common is it that companies try to disguise a python dev role as ds?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 76, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/o6dzyp/python_developer_role_disguised_as_data_science/',)", "identifyer": 5593534, "year": "2021"}, {"autor": "alephsef", "date": 1633585275000, "content": "What I've learned two months into a new DS job... /!/ I'm a civil engineer PhD that really wanted to study math but for various reasons didn't. And I did two very short postdocs (9 months in total) after the PhD using ML. I then landed a data science  job with the federal government. I am a newbie data scientist and really don't feel comfortable calling myself that anyway. \n\n**The good**\nIn my nearly two months on the job, I have learned: \n\n1) how pipelines work, specifically the targets package in R. To make for reproducibility and shorter run times on projects that branch (basically using a split-apply-combine approach that doesn't rerun the same code when nothing has changed).\n\n2) a little bit on the tidyverse. People love that here and I'm used to writing in base R. At least now I know what people are doing although it's going to be hard switching to writing piped operations myself.\n\n3) how to use containers, specifically docker. Useful for when you want code to not break down the road when packages and software get updated. Wish I had used this earlier. I guess if you code in python and manage your environments with anaconda you don't need this (?) \n\n4) how to run code and I/O data from a remote machine (high performance computer). And how to spin up a container with a .slurm script on the remote that opens up Rstudio. This way you can work as you normally would on your local. Really grateful for this.\n\n5) a little bit more on git for version control. The part that I had missing was working collaboratively on branches, making pull requests, and managing conflicts-things I didn't  really need to learn since all my previous projects had been solo ventures (gradschool and post grad work). \n\nIn the months to come, I will also have to learn how to correctly deliver data and project outputs on gitlab, Amazon s3 buckets, science base, etc. I will probably take a python course to be able to read other people's code at the very least. Also, object oriented programming is on the wish list of things to learn. \n\n**The bad**\nLots of acronyms floating around in discussions that make me lose the thread. The discussions seem really fast-paced and I can't keep up. Some of it is probably because these discussions are not relevant to me, but I still have to listen and follow in case they are. Sometimes words are used interchangeably to refer to the same thing, which makes it hard to keep up too. \n\nReading other people's code is difficult. But I have to say, my coworkers are rock stars and have very well-documented clean code. They are also generous with explaining what is happening and why with the code that they have written. \n\n**The ugly **\nI'm not sure if I can be of any help to projects since there are so many capable people around. Battling feelings of inadequacy and trying my best to catch up. \n\nAlmost half my time has been bogged down  in administrative type stuff. Very little project work has happened so far. I find this very tedious. \n\nLots of time spent on video and audio which is tiring. I feel very \"watched\" on video as it's hard to know who is looking where. Also difficult to time when to jump into or change a conversation. I miss the separation of work and life. \n\nThat's all folks. Thanks for reading.\n\n**tl;dr** learned about pipe lining, tidy verse, containers, hpc, and more git stuff. Hated the communication breakdowns, administrative time-sinks, and the many virtual meetings.", "link": "https://www.reddit.com/r/datascience/comments/q32d83/what_ive_learned_two_months_into_a_new_ds_job/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "what i've learned two months into a new ds job... /!/ i'm a civil engineer phd that really wanted to study math but for various reasons didn't. and i did two very short postdocs (9 months in total) after the phd using ml. i then landed a data science  job with the federal government. i am a newbie data scientist and really don't feel comfortable calling myself that anyway. \n\n**the good**\nin my nearly two months on the job, i have learned: \n\n1) how pipelines work, specifically the targets package in r. to make for reproducibility and shorter run times on projects that -----> branch !!!  (basically using a split-apply-combine approach that doesn't rerun the same code when nothing has changed).\n\n2) a little bit on the tidyverse. people love that here and i'm used to writing in base r. at least now i know what people are doing although it's going to be hard switching to writing piped operations myself.\n\n3) how to use containers, specifically docker. useful for when you want code to not break down the road when packages and software get updated. wish i had used this earlier. i guess if you code in python and manage your environments with anaconda you don't need this (?) \n\n4) how to run code and i/o data from a remote machine (high performance computer). and how to spin up a container with a .slurm script on the remote that opens up rstudio. this way you can work as you normally would on your local. really grateful for this.\n\n5) a little bit more on git for version control. the part that i had missing was working collaboratively on branches, making pull requests, and managing conflicts-things i didn't  really need to learn since all my previous projects had been solo ventures (gradschool and post grad work). \n\nin the months to come, i will also have to learn how to correctly deliver data and project outputs on gitlab, amazon s3 buckets, science base, etc. i will probably take a python course to be able to read other people's code at the very least. also, object oriented programming is on the wish list of things to learn. \n\n**the bad**\nlots of acronyms floating around in discussions that make me lose the thread. the discussions seem really fast-paced and i can't keep up. some of it is probably because these discussions are not relevant to me, but i still have to listen and follow in case they are. sometimes words are used interchangeably to refer to the same thing, which makes it hard to keep up too. \n\nreading other people's code is difficult. but i have to say, my coworkers are rock stars and have very well-documented clean code. they are also generous with explaining what is happening and why with the code that they have written. \n\n**the ugly **\ni'm not sure if i can be of any help to projects since there are so many capable people around. battling feelings of inadequacy and trying my best to catch up. \n\nalmost half my time has been bogged down  in administrative type stuff. very little project work has happened so far. i find this very tedious. \n\nlots of time spent on video and audio which is tiring. i feel very \"watched\" on video as it's hard to know who is looking where. also difficult to time when to jump into or change a conversation. i miss the separation of work and life. \n\nthat's all folks. thanks for reading.\n\n**tl;dr** learned about pipe lining, tidy verse, containers, hpc, and more git stuff. hated the communication breakdowns, administrative time-sinks, and the many virtual meetings.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 21, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/q32d83/what_ive_learned_two_months_into_a_new_ds_job/',)", "identifyer": 5593661, "year": "2021"}, {"autor": "hasanfarhan33", "date": 1633530018000, "content": "What skills do I need to improve to get my first job in Data Science? /!/ Hello everyone, \n\nI am a fresh graduate with a degree in Computer Engineering. Nowadays, I have been doing a lot of Udemy courses to experience different branches in the Computer Science world and keep my skills up to date; Web Development, Game Development and Data Science. \n\nI am also doing Kaggle courses, after I finish the courses I will give the competitions a try. I am kinda lost, how did you get your first job in Data Science and what skills do you think I should focus on the most?", "link": "https://www.reddit.com/r/datascience/comments/q2lg16/what_skills_do_i_need_to_improve_to_get_my_first/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "what skills do i need to improve to get my first job in data science? /!/ hello everyone, \n\ni am a fresh graduate with a degree in computer engineering. nowadays, i have been doing a lot of udemy courses to experience different -----> branches !!!  in the computer science world and keep my skills up to date; web development, game development and data science. \n\ni am also doing kaggle courses, after i finish the courses i will give the competitions a try. i am kinda lost, how did you get your first job in data science and what skills do you think i should focus on the most?", "sortedWord": "None", "removed": "('nan',)", "score": 16, "comments": 31, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/q2lg16/what_skills_do_i_need_to_improve_to_get_my_first/',)", "identifyer": 5593700, "year": "2021"}, {"autor": "TheDataGentleman", "date": 1633462629000, "content": "Hi all, What are some Data Science type projects a Business Intelligence (BI) professional can learn that displays good understanding of DS to recruiting companies? Thank you. /!/ Hi all, What are some Data Science type projects a Business Intelligence (BI) professional can learn that displays good understanding of DS to recruiting companies?\n\nLet's say you are used to SQL, Qlik and the likes and want to branch out more to DS to add the real practical understanding of benefits of DS and so that you can talk about it to a future employer in an interview in a confident way.\n\nThank you.", "link": "https://www.reddit.com/r/datascience/comments/q23tgc/hi_all_what_are_some_data_science_type_projects_a/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "hi all, what are some data science type projects a business intelligence (bi) professional can learn that displays good understanding of ds to recruiting companies? thank you. /!/ hi all, what are some data science type projects a business intelligence (bi) professional can learn that displays good understanding of ds to recruiting companies?\n\nlet's say you are used to sql, qlik and the likes and want to -----> branch !!!  out more to ds to add the real practical understanding of benefits of ds and so that you can talk about it to a future employer in an interview in a confident way.\n\nthank you.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 9, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/q23tgc/hi_all_what_are_some_data_science_type_projects_a/',)", "identifyer": 5593735, "year": "2021"}, {"autor": "SweetPotayto23", "date": 1621504690000, "content": "Which one is for me? /!/ Hi all,\nI’m currently working full time doing analysis on a large operation in a law enforcement capacity. I’m also studying for my masters in data analytics, but I’m also hoping to branch my skills to make me eligible for some data science roles in the near future - I’m aware I probably have a long way to go. \n\nAfter I graduate I intend to complete studies in SQL, Hadoop, statistics and some other areas. My question to you all is which of the following would be best to learn:\n\nR or Python?\n\nI have done some base knowledge in data scraping using Python, but I’m seeing so many companies that seem to prefer R. \n\nAlso appreciate any other recommendations in order to grow and improve!\n\nThanks all.", "link": "https://www.reddit.com/r/datascience/comments/ngw3cj/which_one_is_for_me/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "which one is for me? /!/ hi all,\ni’m currently working full time doing analysis on a large operation in a law enforcement capacity. i’m also studying for my masters in data analytics, but i’m also hoping to -----> branch !!!  my skills to make me eligible for some data science roles in the near future - i’m aware i probably have a long way to go. \n\nafter i graduate i intend to complete studies in sql, hadoop, statistics and some other areas. my question to you all is which of the following would be best to learn:\n\nr or python?\n\ni have done some base knowledge in data scraping using python, but i’m seeing so many companies that seem to prefer r. \n\nalso appreciate any other recommendations in order to grow and improve!\n\nthanks all.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ngw3cj/which_one_is_for_me/',)", "identifyer": 5594274, "year": "2021"}, {"autor": "Wiltcwei", "date": 1610181202000, "content": "Accounting background to Master In Data Science. Can i make it and land a job?? /!/ Hi folks,\n\n1st things 1st i got a degree in accounting  and been job hopping since i fresh out of the college.\n\nI worked as auditor at Big 4, trasnfer pricing guy at Grant Thornton and right now as helpdesk support at Abott Lab branch in my country (Malaysia) which involved in some basic troubleshooting before escalated to IT if job can't be done as well as running reports from excel and doing some analytic works on the. \n\nWith that said, i wanna move to data science/ computing developer kind of job later on which i just got a offer letter from top 150 university to enroll for Master in Data Science in October. \n\n**But my concern is i got zero knowledge in linear algebra, advanced statistics and programming language like R, Python etc. Hence, not sure if i can catch up with the classes or  those will re-teach from the get go? Or maybe i can learn it from my own?**\n\nThese 2 threads seem to have  all in one materials on what to cover:\n\n[https://www.reddit.com/r/datascience/comments/664uxn/my\\_curriculumschedule\\_to\\_get\\_from\\_zero\\_to\\_data/](https://www.reddit.com/r/datascience/comments/664uxn/my_curriculumschedule_to_get_from_zero_to_data/)\n\n[https://www.reddit.com/r/learnmath/comments/5nk3ze/could\\_somebody\\_please\\_give\\_me\\_an\\_ordered\\_list\\_of/dcc8d1m/](https://www.reddit.com/r/learnmath/comments/5nk3ze/could_somebody_please_give_me_an_ordered_list_of/dcc8d1m/)", "link": "https://www.reddit.com/r/datascience/comments/ktn7yl/accounting_background_to_master_in_data_science/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "accounting background to master in data science. can i make it and land a job?? /!/ hi folks,\n\n1st things 1st i got a degree in accounting  and been job hopping since i fresh out of the college.\n\ni worked as auditor at big 4, trasnfer pricing guy at grant thornton and right now as helpdesk support at abott lab -----> branch !!!  in my country (malaysia) which involved in some basic troubleshooting before escalated to it if job can't be done as well as running reports from excel and doing some analytic works on the. \n\nwith that said, i wanna move to data science/ computing developer kind of job later on which i just got a offer letter from top 150 university to enroll for master in data science in october. \n\n**but my concern is i got zero knowledge in linear algebra, advanced statistics and programming language like r, python etc. hence, not sure if i can catch up with the classes or  those will re-teach from the get go? or maybe i can learn it from my own?**\n\nthese 2 threads seem to have  all in one materials on what to cover:\n\n[https://www.reddit.com/r/datascience/comments/664uxn/my\\_curriculumschedule\\_to\\_get\\_from\\_zero\\_to\\_data/](https://www.reddit.com/r/datascience/comments/664uxn/my_curriculumschedule_to_get_from_zero_to_data/)\n\n[https://www.reddit.com/r/learnmath/comments/5nk3ze/could\\_somebody\\_please\\_give\\_me\\_an\\_ordered\\_list\\_of/dcc8d1m/](https://www.reddit.com/r/learnmath/comments/5nk3ze/could_somebody_please_give_me_an_ordered_list_of/dcc8d1m/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ktn7yl/accounting_background_to_master_in_data_science/',)", "identifyer": 5594362, "year": "2021"}, {"autor": "dev-1773", "date": 1621901870000, "content": "Explain the need for non SWE ML pipeline vs existing SWE frameworks /!/ Hi , Looking at [metaflow](https://docs.metaflow.org/) tutorials and trying to see how different/ better it is from the setup below that can work in a SWE based pipeline; And if any reason to switch to metaflow , or all its features listed below are covered adequately by this setup:\n\n&amp;#x200B;\n\n1. **DataWarehouse** \\- Source of data (pumped in from dbt pipeline)\n2.  **Compute resources** \\- Covered by autoscaling in aws;\n3. **Job Scheduler**: \n\n* Quartz/Spring application reads configuration from a job database with a UI for entering schedules &amp; jobs;\n*  Schedules are decoupled from jobs; can evolve independently without touching code. \n* Most jobs are to send a message to a kafka queue to kick off spring batch or python ML code. \n\n4.   **Architecture**:\n\n* Orchestration handled by Java Spring cloud  stream / data flows plus kafka topics / producers/consumers. \n* ML jobs are python classes /in-house python libraries so mostly in the ML pipeline only parameters are read from db and applied to the appropriate ML class; \n* Emphasis on avoiding one-off ML python procedural scripts\n* Data transfer between steps done using dbt (sql is understood by more folks). Only ML steps done in python.\n\n5. **Versioning/Inspecting Results &amp; Organizing Results:**\n\n* dbt  &amp; python ML jobs  results histories  based on batch/run\\_id are stored and can be queried in sql \n* Micrometer&amp;Prometheus metrics used to monitor success/ failed stages of all jobs.\n* Sleuth distributed log tracing also used.\n* Namespaces for development artifacts are simply git branches of each developer\n* Namespaces isolation when inspecting results is based on run\\_ids/user\\_ids embedded in micrometer metrics and intermediate results of dbt &amp; python ML job histories.\n\n**6. Loading and Storing Data:**\n\n* Intermediate steps data is stored in database/s3\n\n**7.  Loading and Storing Data:**\n\n* Again no need to reinvent the wheel ; gradle for java code , pip aand requirements.txt for python\n\nIn all these steps using a mature framework like spring boot &amp; spring cloud stream makes life a lot easier\n\nThis setup will allow use common workflows that are already well defined in SWE rather than redefine new workflows in the existing infrastructure", "link": "https://www.reddit.com/r/datascience/comments/nkcehu/explain_the_need_for_non_swe_ml_pipeline_vs/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "explain the need for non swe ml pipeline vs existing swe frameworks /!/ hi , looking at [metaflow](https://docs.metaflow.org/) tutorials and trying to see how different/ better it is from the setup below that can work in a swe based pipeline; and if any reason to switch to metaflow , or all its features listed below are covered adequately by this setup:\n\n&amp;#x200b;\n\n1. **datawarehouse** \\- source of data (pumped in from dbt pipeline)\n2.  **compute resources** \\- covered by autoscaling in aws;\n3. **job scheduler**: \n\n* quartz/spring application reads configuration from a job database with a ui for entering schedules &amp; jobs;\n*  schedules are decoupled from jobs; can evolve independently without touching code. \n* most jobs are to send a message to a kafka queue to kick off spring batch or python ml code. \n\n4.   **architecture**:\n\n* orchestration handled by java spring cloud  stream / data flows plus kafka topics / producers/consumers. \n* ml jobs are python classes /in-house python libraries so mostly in the ml pipeline only parameters are read from db and applied to the appropriate ml class; \n* emphasis on avoiding one-off ml python procedural scripts\n* data transfer between steps done using dbt (sql is understood by more folks). only ml steps done in python.\n\n5. **versioning/inspecting results &amp; organizing results:**\n\n* dbt  &amp; python ml jobs  results histories  based on batch/run\\_id are stored and can be queried in sql \n* micrometer&amp;prometheus metrics used to monitor success/ failed stages of all jobs.\n* sleuth distributed log tracing also used.\n* namespaces for development artifacts are simply git -----> branches !!!  of each developer\n* namespaces isolation when inspecting results is based on run\\_ids/user\\_ids embedded in micrometer metrics and intermediate results of dbt &amp; python ml job histories.\n\n**6. loading and storing data:**\n\n* intermediate steps data is stored in database/s3\n\n**7.  loading and storing data:**\n\n* again no need to reinvent the wheel ; gradle for java code , pip aand requirements.txt for python\n\nin all these steps using a mature framework like spring boot &amp; spring cloud stream makes life a lot easier\n\nthis setup will allow use common workflows that are already well defined in swe rather than redefine new workflows in the existing infrastructure", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('self',)", "medialink": "('https://www.reddit.com/r/datascience/comments/nkcehu/explain_the_need_for_non_swe_ml_pipeline_vs/',)", "identifyer": 5595199, "year": "2021"}, {"autor": "ibsurvivors", "date": 1621875811000, "content": "I got the chance to interview a Research Scientist at Facebook :) /!/ Hey everyone!\n\nGot the chance to speak with Li Yin, who's a Research at Facebook AI. Learn about her role, what she does, and in particular how there are different branches of research at Facebook AI.\n\nThe cool thing about working at Facebook AI as an applied researcher is that you not only have a big impact on the research community through the work you do, but you’re also able to have a big impact on Facebook’s product direction and the millions of users on the platform.\n\nHope you enjoy the interview.\n\n\\-------\n\n## Can you tell me a bit about what you work on at Facebook?\n\nI work at Facebook AI, particularly applied research, as a Research Scientist, developing computer vision models for AR use cases. Our models eventually go from research to production.\n\nA lot of our work also revolves around data - so it’s not just modelling. For example, in computer vision, we need to figure out what data we train our models with, what is important for the user, and how to annotate this data (for ex: what’s the timeline). So a lot of this work usually involves collaboration with data scientists and data engineers.\n\nSince our models eventually go into production, we also work closely with product managers to fine tune different use cases and implementation practices.\n\nI’m based in Menlo Park, California, USA.\n\n## What set of skills is your team seeking for and how can someone join your team?\n\nThere are many different roles that Facebook AI hires, such as these categories:\n\n* Research Scientist and Software Engineer with ML and deep learning background.\n* UXR, Product designer, product manager\n* App developer as we have prototype team\n\nWe either directly hire people into our teams, mostly Research Scientists or we hire from boot camps where people are hired into facebook but not positioned at a particular team. At facebook, most are hired without team selection.\n\nDirect hires into teams are likely high stake engineers or researchers with particular research backgrounds that the teams are early looking for. So in this case, the recruiter would reach out to published researchers in the field in which Facebook is looking to hire.\n\n## Is your team focused on theoretical research, applied research or both? Can you give us some examples of what type of work you are doing and who you collaborate with?\n\nCompared with FAIR labs who work on pure research goals with a \\~5 years vision, our project is often &lt; 2 years long, and each project is started with particular use cases in mind such as product surfaces where our models will be launched on, deployed in cloud or on-device. Our work consists of both research and MLOps and our time is split into 3 chunks (1) data collection and data annotation, (2) modeling, and (3) work cross-functionally with product teams to scope proper use cases.\n\nResearch that is conducted under FAIR labs will often not even have a use case. But for us, we know that there is a real-world use case that our research needs to satisfy. So for example, within computer vision, our image detection model might have the specific use case of trying to identify fraudulent ads in mind.\n\nIt’s cool to get to work both on the research side and the production side. The beginning of a project is obviously more research heavy, and then towards the end we collaborate more and more with other stakeholders.\n\nThe contrast between both types of tasks can be challenging at times. This is because when you do research, it’s a different mind state to when you have to actually identify and map out use cases that real world users will be impacted by. The latter is more of a product engineering or product management type task.\n\nSo you get to talk to all kinds of different people, like some who are actually creating apps that users interact with, others like UI designers who are crafting the user experience, etc. I find all of this really enjoyable.\n\n## Tell me a bit more about some of these projects you’re working on.\n\nOne of my projects is related to object detection based on different user personas. This is a novel and challenging research project that doesn’t have too much current literature in the academic space, so it’s exciting.\n\nThis is a project that we’ve already secured 2 or 3 different use cases for and we are currently in the research phase.\n\n## Do you enjoy the research part more or the product use case part more of a project?\n\nEach project has different time periods. During research mode, as I mentioned earlier, you don’t really want to do too much cross-functional collaboration because you’re heads down reading academic papers and doing a lot of computational heavy work.\n\nBut during the planning stage, so even before the research has begun, there’s a lot of room for discussion with other colleagues and you’re able to bounce ideas off each other. This process can be really fun too.\n\nFinally, it’s important to remember that the research we do is very useful for real-world users, so there’s an opportunity for big impact. There’s also an opportunity to shape the product direction of the company.\n\n## How is work life balance like at Facebook?\n\nI will say that remote work due to the pandemic has often blurred the line between work and free-time because there’s often no end to research (there’s always something you can do!). And all of us enjoy our work, so it’s very easy to fall into the trap of overworking and burning out.\n\nI think that as an intern, in general, you skew more towards the work side of things because you’re trying to prove yourself and get a return offer. So interns at companies like Facebook and Nvidia often do a lot of overtime.\n\nBut overall, it’s important to remember that different people have different working styles. Some people derive a lot of meaning from their work, so they often don’t see the long hours they spend working as a “bad thing”. This is especially the case with smart researchers you work with at Facebook AI - these are individuals that are at the top of their fields and love to learn.\n\nOur managers do often ask us whether we’re ensuring that we have a good work life balance in place, but we never know how to answer that question because we’re so engaged with our work!\n\n## What is your favorite thing about working as a Research Scientist at Facebook?\n\nMy favorite thing has to do with the impact that I can have. Both the impact for the research community and the impact on the product side are huge - they’re equally exciting. I also don’t want to just join a pure research team because I’ve come to enjoy the production side of our projects as well.\n\nSomething that’s pleasantly surprised me about working at Facebook has been how open the culture is. Your managers are really invested in your personal growth and want to make sure you find your work meaningful. It’s also really common to discuss career paths with your managers so that you’re always headed in the direction you want.\n\nPersonally, I’ve really enjoyed growing in so many ways outside of research (which was what my background mainly consisted of). You have to work with different people, manage conflict, improve your communication skills, and be a team player. These all areas I’ve grown in tremendously.\n\n\\-------\n\nThat's it, hope it was helpful. Full interview can be read [here](https://www.careerfair.io/reviews/facebook-research-scientist). \n\n*If you liked this post, you might like* [*my newsletter*](https://www.careerfair.io/subscribe)*. It's my best content delivered to your inbox once every two weeks. And if Twitter is more your thing, feel free to follow connect with me* [here](https://twitter.com/OGCareerFair)*.*\n\nAny questions and I'll be in the comments :)", "link": "https://www.reddit.com/r/datascience/comments/nk2s3b/i_got_the_chance_to_interview_a_research/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "i got the chance to interview a research scientist at facebook :) /!/ hey everyone!\n\ngot the chance to speak with li yin, who's a research at facebook ai. learn about her role, what she does, and in particular how there are different -----> branches !!!  of research at facebook ai.\n\nthe cool thing about working at facebook ai as an applied researcher is that you not only have a big impact on the research community through the work you do, but you’re also able to have a big impact on facebook’s product direction and the millions of users on the platform.\n\nhope you enjoy the interview.\n\n\\-------\n\n## can you tell me a bit about what you work on at facebook?\n\ni work at facebook ai, particularly applied research, as a research scientist, developing computer vision models for ar use cases. our models eventually go from research to production.\n\na lot of our work also revolves around data - so it’s not just modelling. for example, in computer vision, we need to figure out what data we train our models with, what is important for the user, and how to annotate this data (for ex: what’s the timeline). so a lot of this work usually involves collaboration with data scientists and data engineers.\n\nsince our models eventually go into production, we also work closely with product managers to fine tune different use cases and implementation practices.\n\ni’m based in menlo park, california, usa.\n\n## what set of skills is your team seeking for and how can someone join your team?\n\nthere are many different roles that facebook ai hires, such as these categories:\n\n* research scientist and software engineer with ml and deep learning background.\n* uxr, product designer, product manager\n* app developer as we have prototype team\n\nwe either directly hire people into our teams, mostly research scientists or we hire from boot camps where people are hired into facebook but not positioned at a particular team. at facebook, most are hired without team selection.\n\ndirect hires into teams are likely high stake engineers or researchers with particular research backgrounds that the teams are early looking for. so in this case, the recruiter would reach out to published researchers in the field in which facebook is looking to hire.\n\n## is your team focused on theoretical research, applied research or both? can you give us some examples of what type of work you are doing and who you collaborate with?\n\ncompared with fair labs who work on pure research goals with a \\~5 years vision, our project is often &lt; 2 years long, and each project is started with particular use cases in mind such as product surfaces where our models will be launched on, deployed in cloud or on-device. our work consists of both research and mlops and our time is split into 3 chunks (1) data collection and data annotation, (2) modeling, and (3) work cross-functionally with product teams to scope proper use cases.\n\nresearch that is conducted under fair labs will often not even have a use case. but for us, we know that there is a real-world use case that our research needs to satisfy. so for example, within computer vision, our image detection model might have the specific use case of trying to identify fraudulent ads in mind.\n\nit’s cool to get to work both on the research side and the production side. the beginning of a project is obviously more research heavy, and then towards the end we collaborate more and more with other stakeholders.\n\nthe contrast between both types of tasks can be challenging at times. this is because when you do research, it’s a different mind state to when you have to actually identify and map out use cases that real world users will be impacted by. the latter is more of a product engineering or product management type task.\n\nso you get to talk to all kinds of different people, like some who are actually creating apps that users interact with, others like ui designers who are crafting the user experience, etc. i find all of this really enjoyable.\n\n## tell me a bit more about some of these projects you’re working on.\n\none of my projects is related to object detection based on different user personas. this is a novel and challenging research project that doesn’t have too much current literature in the academic space, so it’s exciting.\n\nthis is a project that we’ve already secured 2 or 3 different use cases for and we are currently in the research phase.\n\n## do you enjoy the research part more or the product use case part more of a project?\n\neach project has different time periods. during research mode, as i mentioned earlier, you don’t really want to do too much cross-functional collaboration because you’re heads down reading academic papers and doing a lot of computational heavy work.\n\nbut during the planning stage, so even before the research has begun, there’s a lot of room for discussion with other colleagues and you’re able to bounce ideas off each other. this process can be really fun too.\n\nfinally, it’s important to remember that the research we do is very useful for real-world users, so there’s an opportunity for big impact. there’s also an opportunity to shape the product direction of the company.\n\n## how is work life balance like at facebook?\n\ni will say that remote work due to the pandemic has often blurred the line between work and free-time because there’s often no end to research (there’s always something you can do!). and all of us enjoy our work, so it’s very easy to fall into the trap of overworking and burning out.\n\ni think that as an intern, in general, you skew more towards the work side of things because you’re trying to prove yourself and get a return offer. so interns at companies like facebook and nvidia often do a lot of overtime.\n\nbut overall, it’s important to remember that different people have different working styles. some people derive a lot of meaning from their work, so they often don’t see the long hours they spend working as a “bad thing”. this is especially the case with smart researchers you work with at facebook ai - these are individuals that are at the top of their fields and love to learn.\n\nour managers do often ask us whether we’re ensuring that we have a good work life balance in place, but we never know how to answer that question because we’re so engaged with our work!\n\n## what is your favorite thing about working as a research scientist at facebook?\n\nmy favorite thing has to do with the impact that i can have. both the impact for the research community and the impact on the product side are huge - they’re equally exciting. i also don’t want to just join a pure research team because i’ve come to enjoy the production side of our projects as well.\n\nsomething that’s pleasantly surprised me about working at facebook has been how open the culture is. your managers are really invested in your personal growth and want to make sure you find your work meaningful. it’s also really common to discuss career paths with your managers so that you’re always headed in the direction you want.\n\npersonally, i’ve really enjoyed growing in so many ways outside of research (which was what my background mainly consisted of). you have to work with different people, manage conflict, improve your communication skills, and be a team player. these all areas i’ve grown in tremendously.\n\n\\-------\n\nthat's it, hope it was helpful. full interview can be read [here](https://www.careerfair.io/reviews/facebook-research-scientist). \n\n*if you liked this post, you might like* [*my newsletter*](https://www.careerfair.io/subscribe)*. it's my best content delivered to your inbox once every two weeks. and if twitter is more your thing, feel free to follow connect with me* [here](https://twitter.com/ogcareerfair)*.*\n\nany questions and i'll be in the comments :)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/datascience/comments/nk2s3b/i_got_the_chance_to_interview_a_research/',)", "identifyer": 5595221, "year": "2021"}, {"autor": "Experimentalphone", "date": 1629468735000, "content": "Where can I find unpaid/pro bono data science projects to complete that will add value to my resume so that I can switch careers to data science? /!/ Hi there, \n\nI am a 30 year old guy from Bangladesh. I have a BS in Economics, an MBA and 3.5 years of experience in retail branch banking as a universal banker. \n\nI want to get out of the financial industry (insurance, banking, financial institutes) totally because I am totally burnt out being out of home for work for 13.5 hrs a day, 5 days a week with 15 minute lunch breaks. \n\nRight now, I am looking for pro bono/unpaid data science projects that I can do remotely online from Bangladesh. Doing at least two projects would help me learn the basics of the job and add to my resume. \n\nI am aiming to apply to full-time, permanent (not contractual) remote data science entry level jobs online because in my country there is such an oversupply of BS in CS graduates that all companies require a CS graduate even for a entry level positions that do not need anything more than an Excel. \n\nCan someone tell me where can I find such pro bono/unpaid projects?", "link": "https://www.reddit.com/r/datascience/comments/p860dw/where_can_i_find_unpaidpro_bono_data_science/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "where can i find unpaid/pro bono data science projects to complete that will add value to my resume so that i can switch careers to data science? /!/ hi there, \n\ni am a 30 year old guy from bangladesh. i have a bs in economics, an mba and 3.5 years of experience in retail -----> branch !!!  banking as a universal banker. \n\ni want to get out of the financial industry (insurance, banking, financial institutes) totally because i am totally burnt out being out of home for work for 13.5 hrs a day, 5 days a week with 15 minute lunch breaks. \n\nright now, i am looking for pro bono/unpaid data science projects that i can do remotely online from bangladesh. doing at least two projects would help me learn the basics of the job and add to my resume. \n\ni am aiming to apply to full-time, permanent (not contractual) remote data science entry level jobs online because in my country there is such an oversupply of bs in cs graduates that all companies require a cs graduate even for a entry level positions that do not need anything more than an excel. \n\ncan someone tell me where can i find such pro bono/unpaid projects?", "sortedWord": "None", "removed": "('nan',)", "score": 83, "comments": 93, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/p860dw/where_can_i_find_unpaidpro_bono_data_science/',)", "identifyer": 5595283, "year": "2021"}, {"autor": "ui_throwaway_354", "date": 1619307779000, "content": "Do you think there is a stigma against (US) government employees trying to get data science jobs in the private sector? /!/ I work for the government as a data scientist, as my first (and so far only) post-masters job. I like my job, but I don't like where I have to live to do my job at my specific branch of the government. I may change my mind over time, but I think maybe in two or three years when I have more on my resume, I may go back to the private sector (preferably a big and more stable company, not a startup) so I will be able to go back to where I'm from (which is a big US city for tech and DS so that shouldn't be a problem). However I do hear a fair amount of chatter amongst DS people both inside and outside the government that there is somewhat of a stigma against government employees amongst big tech corps when looking to hire programmers &amp; DS, primarily for two reasons: 1, that gov employees get too used to working exactly 40 hours/week less willing to put up with being pressured/forced to do unpaid overtime frequently, and 2, that gov handles DS and SWE very differently than FAANG/etc and that the skill set is too different. I don't know about #2, but I think #1 maybe be true, because I know a couple of people (SWE and DS mostly) who left, went private, and came back because they discovered that they cared more about reasonable workloads and good PTO than making 30-50% more money &amp; getting bonuses. And honestly, I may too,  but for me it's primarily the location. \n\nI realize the answer is probably \"it really depends on the company and it really depends what part of the government\", but any general takes on this?", "link": "https://www.reddit.com/r/datascience/comments/mxvzwl/do_you_think_there_is_a_stigma_against_us/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "do you think there is a stigma against (us) government employees trying to get data science jobs in the private sector? /!/ i work for the government as a data scientist, as my first (and so far only) post-masters job. i like my job, but i don't like where i have to live to do my job at my specific -----> branch !!!  of the government. i may change my mind over time, but i think maybe in two or three years when i have more on my resume, i may go back to the private sector (preferably a big and more stable company, not a startup) so i will be able to go back to where i'm from (which is a big us city for tech and ds so that shouldn't be a problem). however i do hear a fair amount of chatter amongst ds people both inside and outside the government that there is somewhat of a stigma against government employees amongst big tech corps when looking to hire programmers &amp; ds, primarily for two reasons: 1, that gov employees get too used to working exactly 40 hours/week less willing to put up with being pressured/forced to do unpaid overtime frequently, and 2, that gov handles ds and swe very differently than faang/etc and that the skill set is too different. i don't know about #2, but i think #1 maybe be true, because i know a couple of people (swe and ds mostly) who left, went private, and came back because they discovered that they cared more about reasonable workloads and good pto than making 30-50% more money &amp; getting bonuses. and honestly, i may too,  but for me it's primarily the location. \n\ni realize the answer is probably \"it really depends on the company and it really depends what part of the government\", but any general takes on this?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 18, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mxvzwl/do_you_think_there_is_a_stigma_against_us/',)", "identifyer": 5596676, "year": "2021"}, {"autor": "jimkoons", "date": 1628091736000, "content": "Don't know what direction take now concerning my carreer path. /!/ I'm a 33 yo data scientist/engineer/analyst that works for a finance company (debt collection). And while this is an international company, we are only 70 people working in my branch and I'm the only person working in the \"analytics departement\" (I mean it does not even exist, I actually belong to the finance department...).\n\nTo provide the general picture: when I arrived there, they had no datawarehouse, no scoring system, their entire reporting solution was on SAS visual analytics and depending on SAS scripts. The nightmare.\n\nSo, I provided them during the last 3 years: a datawarehouse, datamarts, a new BI solution on Power BI, a new scoring system for debts based on Python/sklearn and tons of new visualizations. I previously made a ton of portfolio analysis with R markdown, provided a R shiny app while waiting for the Power BI solution to be implemented. And so on.\n\nI am definitely the only one to understand what I'm actually doing and sometimes, well, it hurts because you have no one to talk about your job in the company and I feel it burdens my motivation.\n\nThe only one to slightly understand what I do is my german product manager (company is german but I work in Belgium) but he has his agenda of his own concerning the projects that we should implement according to him and honestly, I don't feel those projects would be that interesting for the company (and my - local - managers quite agree with me on this).\n\nIn the last month I'm feeling that this job does not fullfil me anymore: I was asked to implement a glossary for all the information available in the BI solution, asked to support the operational team to use the tool while it's been 1 year they should be using it. My managers here do not seem to understand that people have to commit when they change tool and heck, I was not even hire for the BI part at first... I should have been developping model for the last years and now I'm kind of drafted as the change manager guy...\n\nI don't know what to do, I feel I'm at the end of the road for this company but in the same time I don't feel secure about the skills required for other positions. I am under the impression that I've been a \"generalist\" for 3 years now and that it could be harder now for me to find a suitable position. So my question is: what would you do if you where in my place? I feel maybe working in consultancy could ramp up my experience quite nicely in the next years and maybe I could work as an independant contractor in a few years? I receive a ton of proposion for freelance projects but I don't know how reliable those are, any thoughts on that?\n\nThanks anyway if you read it so far! :)", "link": "https://www.reddit.com/r/datascience/comments/oxvdqk/dont_know_what_direction_take_now_concerning_my/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "don't know what direction take now concerning my carreer path. /!/ i'm a 33 yo data scientist/engineer/analyst that works for a finance company (debt collection). and while this is an international company, we are only 70 people working in my -----> branch !!!  and i'm the only person working in the \"analytics departement\" (i mean it does not even exist, i actually belong to the finance department...).\n\nto provide the general picture: when i arrived there, they had no datawarehouse, no scoring system, their entire reporting solution was on sas visual analytics and depending on sas scripts. the nightmare.\n\nso, i provided them during the last 3 years: a datawarehouse, datamarts, a new bi solution on power bi, a new scoring system for debts based on python/sklearn and tons of new visualizations. i previously made a ton of portfolio analysis with r markdown, provided a r shiny app while waiting for the power bi solution to be implemented. and so on.\n\ni am definitely the only one to understand what i'm actually doing and sometimes, well, it hurts because you have no one to talk about your job in the company and i feel it burdens my motivation.\n\nthe only one to slightly understand what i do is my german product manager (company is german but i work in belgium) but he has his agenda of his own concerning the projects that we should implement according to him and honestly, i don't feel those projects would be that interesting for the company (and my - local - managers quite agree with me on this).\n\nin the last month i'm feeling that this job does not fullfil me anymore: i was asked to implement a glossary for all the information available in the bi solution, asked to support the operational team to use the tool while it's been 1 year they should be using it. my managers here do not seem to understand that people have to commit when they change tool and heck, i was not even hire for the bi part at first... i should have been developping model for the last years and now i'm kind of drafted as the change manager guy...\n\ni don't know what to do, i feel i'm at the end of the road for this company but in the same time i don't feel secure about the skills required for other positions. i am under the impression that i've been a \"generalist\" for 3 years now and that it could be harder now for me to find a suitable position. so my question is: what would you do if you where in my place? i feel maybe working in consultancy could ramp up my experience quite nicely in the next years and maybe i could work as an independant contractor in a few years? i receive a ton of proposion for freelance projects but i don't know how reliable those are, any thoughts on that?\n\nthanks anyway if you read it so far! :)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 57, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oxvdqk/dont_know_what_direction_take_now_concerning_my/',)", "identifyer": 5598212, "year": "2021"}], "name": "branchdatascience2021"}