{"interestingcomments": [{"autor": "PinguThePenguin09", "date": 1627656347000, "content": "Should I quit my job to study Data Science full time? /!/ I’m 25 and currently live with my parents. \nI graduated in Business, and ended up working in technical support (WFH) for a large commerce client through an outsourcing company. I get to help troubleshoot issues related to API’s and feeds, but there’s so many corporate red-tape that I’m very often passing things on, and not getting to learn much about them beyond surface level. I’m also under NDA from disclosing my client. Pay is slightly above minimum wage. I despise the work, and don’t find myself learning anything useful. I’m considering quitting.My parents despise me for not taking over the farm business, and it’s lead to this Stockholm syndrome relationship between us (even though I tried farming for a few years full-time, and help them most days). I’ve come to terms that the only option for me is to leave, because of the huge strain its leaving on me. And I’m considering moving country so that I can get a fresh start. \n\nI find myself in a sort of depression. There’s times I’ll just blankly stare at my computer in work for 15 minutes, and can’t do anything. And then I feel worse afterwards. My parents often rant and call me useless for being in a dead-end job, and I end up feeling 10x worse immediately after. I then fall into worse habits until I pick myself back up again later.  I tried to get my shit together from about 4 months ago, and picked up learning Python and SQL. I finished the Analyze Data with SQL course through Code Academy recently, learned Tableau and done YT tutorials on Python. I enjoy the courses, can learn pretty fast, and actually feel motivated to do them. \n\nHowever, I still feel like I’ve a hundred more miles to go. And I’m afraid this will turn out to be a fools errand.\nI’ve saved enough money now that I could realistically live comfortably with no more income for about 2 years.I’m currently considering the following options:1. Try bullshit my way into an entry-level DA job, and swim through the storm. \n2. Get an unpaid internship, and swim through the storm (except now there’s no pay, less expectations, and I feel like less of a fraud) \n3. Take a year out to do an intense online 1 year BSc degree in Data Analytics from a reputable IT college (my government offers these for the equivalent of $500 to graduates of non-related disciplines) \n4. Quit my job, and study full-time for some proper certs like Google Data Analytics Professional Certificate or DA-100: Analyzing Data with Microsoft Power BI. Allowing me more time to focus and not burnout. \n\nTLDR: switching careers from tech support, and don’t know the best approach.", "link": "https://www.reddit.com/r/datascience/comments/oulznt/should_i_quit_my_job_to_study_data_science_full/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "should i quit my job to study data science full time? /!/ i’m 25 and currently live with my parents. \ni graduated in business, and ended up working in technical support (wfh) for a large commerce client through an outsourcing company. i get to help troubleshoot issues related to api’s and feeds, but there’s so many corporate red-tape that i’m very often passing things on, and not getting to learn much about them beyond surface level. i’m also under nda from disclosing my client. pay is slightly above minimum wage. i despise the work, and don’t find myself learning anything useful. i’m considering quitting.my parents despise me for not taking over the farm business, and it’s lead to this stockholm syndrome relationship between us (even though i tried -----> farming !!!  for a few years full-time, and help them most days). i’ve come to terms that the only option for me is to leave, because of the huge strain its leaving on me. and i’m considering moving country so that i can get a fresh start. \n\ni find myself in a sort of depression. there’s times i’ll just blankly stare at my computer in work for 15 minutes, and can’t do anything. and then i feel worse afterwards. my parents often rant and call me useless for being in a dead-end job, and i end up feeling 10x worse immediately after. i then fall into worse habits until i pick myself back up again later.  i tried to get my shit together from about 4 months ago, and picked up learning python and sql. i finished the analyze data with sql course through code academy recently, learned tableau and done yt tutorials on python. i enjoy the courses, can learn pretty fast, and actually feel motivated to do them. \n\nhowever, i still feel like i’ve a hundred more miles to go. and i’m afraid this will turn out to be a fools errand.\ni’ve saved enough money now that i could realistically live comfortably with no more income for about 2 years.i’m currently considering the following options:1. try bullshit my way into an entry-level da job, and swim through the storm. \n2. get an unpaid internship, and swim through the storm (except now there’s no pay, less expectations, and i feel like less of a fraud) \n3. take a year out to do an intense online 1 year bsc degree in data analytics from a reputable it college (my government offers these for the equivalent of $500 to graduates of non-related disciplines) \n4. quit my job, and study full-time for some proper certs like google data analytics professional certificate or da-100: analyzing data with microsoft power bi. allowing me more time to focus and not burnout. \n\ntldr: switching careers from tech support, and don’t know the best approach.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oulznt/should_i_quit_my_job_to_study_data_science_full/',)", "identifyer": 5587127, "year": "2021"}, {"autor": "ai_datascience", "date": 1622329288000, "content": "#AI and #DataScience in agriculture Artificial Intelligence (AI) has improved productivity and efficiency in different industries, and agriculture is one of them. In #agriculture AI has helped farmers get deeper insights into farming data and processes.", "link": "https://www.reddit.com/r/datascience/comments/nnyd96/ai_and_datascience_in_agriculture_artificial/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "#ai and #datascience in agriculture artificial intelligence (ai) has improved productivity and efficiency in different industries, and agriculture is one of them. in #agriculture ai has helped farmers get deeper insights into -----> farming !!!  data and processes.", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://tesseract.academy/ai-and-data-science-in-agriculture/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=ai-and-data-science-in-agriculture',)", "identifyer": 5588260, "year": "2021"}, {"autor": "Barlton_Canks", "date": 1625323275000, "content": "Dissertation/Thesis Ideas /!/ Doing 3rd year of data science in September and was thinking of possible topics.\n\nIf you've done one in the past, what did you do it on?\n\nI'm interested in smart farming/automated farming so was thinking about something on that, not sure about specifics yet though. Any ideas?", "link": "https://www.reddit.com/r/datascience/comments/oczbnj/dissertationthesis_ideas/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "dissertation/thesis ideas /!/ doing 3rd year of data science in september and was thinking of possible topics.\n\nif you've done one in the past, what did you do it on?\n\ni'm interested in smart -----> farming !!! /automated -----> farming !!!  so was thinking about something on that, not sure about specifics yet though. any ideas?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oczbnj/dissertationthesis_ideas/',)", "identifyer": 5594847, "year": "2021"}, {"autor": "kim_en", "date": 1610348751000, "content": "how to store website data (marketing with example) /!/ Hello everyone, Im new to data analytics, after learning about facebook ads and what it can do, I began researching about data analytics. This is really awesome tools, and facebook is a really great place for farming data.\n\nI understand that the building block of data analytics is signal generation. In real world we have sensors, In digital world we have events.\n\nIm looking for a general way to store these \"events\" data. For your understanding of what im looking for, I will use facebook ads as example. (Please excuse my english, im not native speaker.)\n\nIn facebook ads, we can create standard events based on whats happening in our website, for example \"purchase\", \"view\", \"add to cart\", \"category view\". These are facebook standard events for ecommerce website. When we have enough amount of these data, we can insert these data into facebook machine learning. Facebook machine learning will then use these data to find other people that have the same \"characteristic\" with our supplied dataset.\n\nFacebook dataset, including time spent on facebook, groups likes, page likes, amount of text written, amount of pictures, amount of shared articles, and many other millions of rows under a person's table inside facebook will then be matched with the one we suppplied. Finally, our ad will be deliver to whoever will be most likely to be interested in our products.\n\nThese standard events itself is a combination of few smaller events that facebook has determined. We as advertiser can get creative by having our own definition of events, like, \"scrolling really fast\", \"clicking really fast\", \"clicking really slow\", \"click red button and yellow button\". With enough amount of data, facebook machine learning can find all these people who like to click fast, or click slow, etc2. I hope you can get my point.\n\nSo, here is my question, how can I store these data on my own? Right now everything is really depending on facebook pixel. Facebook have a high reputation on banning people's account without notice. All our years of collected data will be vanish if facebook algo decides to ban our account. So far, the best method I know is to use previous customer's email as input data. its good, but its not spesific.\n\nI want to be able to use this \"custom events\" data to upload to google, linkedin, pintrest, or just about anywhere (I know every ad platform have machine learning capabilities by now). And also, with this way of storing data, my years of hardwork can be use in the future.\n\nIm really limited by my knowledge in big data / data science, I hope that Im asking at the right sub. My english vocab is really limited. If you can point me what keyword to google, that would be very helpful.\n\nThank you.", "link": "https://www.reddit.com/r/datascience/comments/kuxkc5/how_to_store_website_data_marketing_with_example/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how to store website data (marketing with example) /!/ hello everyone, im new to data analytics, after learning about facebook ads and what it can do, i began researching about data analytics. this is really awesome tools, and facebook is a really great place for -----> farming !!!  data.\n\ni understand that the building block of data analytics is signal generation. in real world we have sensors, in digital world we have events.\n\nim looking for a general way to store these \"events\" data. for your understanding of what im looking for, i will use facebook ads as example. (please excuse my english, im not native speaker.)\n\nin facebook ads, we can create standard events based on whats happening in our website, for example \"purchase\", \"view\", \"add to cart\", \"category view\". these are facebook standard events for ecommerce website. when we have enough amount of these data, we can insert these data into facebook machine learning. facebook machine learning will then use these data to find other people that have the same \"characteristic\" with our supplied dataset.\n\nfacebook dataset, including time spent on facebook, groups likes, page likes, amount of text written, amount of pictures, amount of shared articles, and many other millions of rows under a person's table inside facebook will then be matched with the one we suppplied. finally, our ad will be deliver to whoever will be most likely to be interested in our products.\n\nthese standard events itself is a combination of few smaller events that facebook has determined. we as advertiser can get creative by having our own definition of events, like, \"scrolling really fast\", \"clicking really fast\", \"clicking really slow\", \"click red button and yellow button\". with enough amount of data, facebook machine learning can find all these people who like to click fast, or click slow, etc2. i hope you can get my point.\n\nso, here is my question, how can i store these data on my own? right now everything is really depending on facebook pixel. facebook have a high reputation on banning people's account without notice. all our years of collected data will be vanish if facebook algo decides to ban our account. so far, the best method i know is to use previous customer's email as input data. its good, but its not spesific.\n\ni want to be able to use this \"custom events\" data to upload to google, linkedin, pintrest, or just about anywhere (i know every ad platform have machine learning capabilities by now). and also, with this way of storing data, my years of hardwork can be use in the future.\n\nim really limited by my knowledge in big data / data science, i hope that im asking at the right sub. my english vocab is really limited. if you can point me what keyword to google, that would be very helpful.\n\nthank you.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/kuxkc5/how_to_store_website_data_marketing_with_example/',)", "identifyer": 5595096, "year": "2021"}, {"autor": "Barlton_Canks", "date": 1632318363000, "content": "Flask or Django for farming project /!/ Want to make an app that connects to a sensor which will give me metrics such as luminosity, moisture, temperature etc for soil. I then want to use an algorithm to determine what is the best crop for the soil based on the metrics given. \n\nWhich would be best for making that app and ideas on my project as a whole?", "link": "https://www.reddit.com/r/datascience/comments/pt7vkw/flask_or_django_for_farming_project/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "flask or django for -----> farming !!!  project /!/ want to make an app that connects to a sensor which will give me metrics such as luminosity, moisture, temperature etc for soil. i then want to use an algorithm to determine what is the best crop for the soil based on the metrics given. \n\nwhich would be best for making that app and ideas on my project as a whole?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/pt7vkw/flask_or_django_for_farming_project/',)", "identifyer": 5598341, "year": "2021"}], "name": "farmingdatascience2021"}