{"interestingcomments": [{"autor": "saintczr", "date": 1622809375000, "content": "Career choices /!/ So I’m a 20 yr old male with a good head on my shoulders and very good work ethic blah blah blah. I’ve been looking into the reality that tech will keep evolving and I love data. Information and analyzing it. More so I enjoy putting data to work... I love looking at data and seeing what it tells us about the world society and economy. However, I don’t know much about computers or programming or anything like that. I’m good enough with math but I can’t break the barrier to enter and start doing things. I also have the problem where I don’t care what I do as long as it contains the following: \n\nMakes a societal contribution or gives me the ability to help people \n     -definitely looking at fields that require innovation \n \nA lot of movement flexibility or excitement \n\nWould like to either start a business based off of what I do or aids me in starting a business \n\n\ncurrently I’m entering my sophomore year at community college studying business. I’m very active in my community with politics and government (one of my biggest interests). I also work at a garden center which I enjoy very much and am even considering it to be what I focus on for a bit to see the potential data science has in anything to do with specifically agriculture or horticulture. \n\nMy questions:\nDoes it sound like data science would be for me based on my priorities? \n\nHow can I begin learning to use tools and involve myself in the data science community?\n\nIs it worth going to school for if it’s not the main focus of my career or should I just teach myself/ take courses online? \n\nAny comments or suggestions are welcome :)", "link": "https://www.reddit.com/r/datascience/comments/ns3tvd/career_choices/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "career choices /!/ so i’m a 20 yr old male with a good head on my shoulders and very good work ethic blah blah blah. i’ve been looking into the reality that tech will keep evolving and i love data. information and analyzing it. more so i enjoy putting data to work... i love looking at data and seeing what it tells us about the world society and economy. however, i don’t know much about computers or programming or anything like that. i’m good enough with math but i can’t break the barrier to enter and start doing things. i also have the problem where i don’t care what i do as long as it contains the following: \n\nmakes a societal contribution or gives me the ability to help people \n     -definitely looking at fields that require innovation \n \na lot of movement flexibility or excitement \n\nwould like to either start a business based off of what i do or aids me in starting a business \n\n\ncurrently i’m entering my sophomore year at community college studying business. i’m very active in my community with politics and government (one of my biggest interests). i also work at a -----> garden !!!  center which i enjoy very much and am even considering it to be what i focus on for a bit to see the potential data science has in anything to do with specifically agriculture or horticulture. \n\nmy questions:\ndoes it sound like data science would be for me based on my priorities? \n\nhow can i begin learning to use tools and involve myself in the data science community?\n\nis it worth going to school for if it’s not the main focus of my career or should i just teach myself/ take courses online? \n\nany comments or suggestions are welcome :)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ns3tvd/career_choices/',)", "identifyer": 5593812, "year": "2021"}], "name": "gardendatascience2021"}