{"interestingcomments": [{"autor": "Unlucky-Yak2471", "date": 1624998832000, "content": "Am I really an Analyst? /!/ So... I work as an analyst for a food manufacturer but I only use Excel and most of the analysis is just saying yes it was a bad day because of this how about looking into this. \n\nI've created new dashboards in excel and I did a little forecasting to predict the impact of a change to the business for the rest of the year based on the previous few weeks, which was very simple % formulas.\n\nI want to get out of the food industry as it feels like the data is just there to exist but I don't feel confident looking at analyst jobs outside of the sector due to only experiencing excel for analysis.\n\nSo am I an Analyst? If not what do I need to do to open up my job prospects? I'm UK based and 30 with only GCSE's and a foundation degree in Leadership and Management to my name qualification wise. I can't seem to find anything that would pay me what I'm on now and is the grass greener outside of Food Manufacturing?", "link": "https://www.reddit.com/r/datascience/comments/oagpf8/am_i_really_an_analyst/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "am i really an analyst? /!/ so... i work as an analyst for a food manufacturer but i only use excel and most of the analysis is just saying yes it was a bad day because of this how about looking into this. \n\ni've created new dashboards in excel and i did a little forecasting to predict the impact of a change to the business for the rest of the year based on the previous few weeks, which was very simple % formulas.\n\ni want to get out of the food industry as it feels like the data is just there to exist but i don't feel confident looking at analyst jobs outside of the sector due to only experiencing excel for analysis.\n\nso am i an analyst? if not what do i need to do to open up my job prospects? i'm uk based and 30 with only gcse's and a foundation degree in leadership and management to my name qualification wise. i can't seem to find anything that would pay me what i'm on now and is the -----> grass !!!  greener outside of food manufacturing?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/oagpf8/am_i_really_an_analyst/',)", "identifyer": 5587755, "year": "2021"}, {"autor": "__-__-__-_____-", "date": 1618531793000, "content": "Is DS more actual stats nowadays than Biostatistics? /!/ In industry. I often see highly technical DS job descriptions\n\nMy own experience is honestly I am disappointed with Biostats. Its ironically much much less real statistics than I expected. People are obsessed with prespecifying analyses, and they are want to write huge regulatory reports with very specific language, more writing and writing and writing, communicating with FDA, SAS, validation protocols, following exact FDA guidelines for analysis etc. \n\nI would discourage people who are interested in actual technical work from pursuing a degree in Biostat unless you can brand yourself as a DS to industry. \n\nOn the other hand in DS job descriptions I see really fancy stat models, ML/DL, various libraries, R/Julia/Python, more data mining on observational data, causal inference, time series, etc. Aka what one would call “real” statistics. It looks much more mentally stimulating. \n\nAm I just looking through rose tinted grass is greener eyes? Or is there truth to this?", "link": "https://www.reddit.com/r/datascience/comments/mrrj2m/is_ds_more_actual_stats_nowadays_than/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "is ds more actual stats nowadays than biostatistics? /!/ in industry. i often see highly technical ds job descriptions\n\nmy own experience is honestly i am disappointed with biostats. its ironically much much less real statistics than i expected. people are obsessed with prespecifying analyses, and they are want to write huge regulatory reports with very specific language, more writing and writing and writing, communicating with fda, sas, validation protocols, following exact fda guidelines for analysis etc. \n\ni would discourage people who are interested in actual technical work from pursuing a degree in biostat unless you can brand yourself as a ds to industry. \n\non the other hand in ds job descriptions i see really fancy stat models, ml/dl, various libraries, r/julia/python, more data mining on observational data, causal inference, time series, etc. aka what one would call “real” statistics. it looks much more mentally stimulating. \n\nam i just looking through rose tinted -----> grass !!!  is greener eyes? or is there truth to this?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 18, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mrrj2m/is_ds_more_actual_stats_nowadays_than/',)", "identifyer": 5589240, "year": "2021"}, {"autor": "pastel_poetry_", "date": 1618433930000, "content": "Switching Careers /!/  \n\nHello all! \n\nI am a doctor by background but for many factors I was becoming more disillusioned with that career path. I’ve always liked the idea of tech and I have picked up online courses along python and I am enjoying it so far. I am hoping with enough practice I can move to R etc and perhaps take it seriously with going back to university. \n\nIdeally I would love to be in a Health Data Science role where I could still use my clinical knowledge, perhaps for an NGO/Digital Health.\n\nI am a bit terrified about making the switch though and the ‘grass is greener’. I would really love to know what people like and dislike about their roles, I really don’t want to make the same mistake of going into a role without fully understanding it!\n\nAlso if anyone has any tips or advice for someone in my background I would be so grateful!", "link": "https://www.reddit.com/r/datascience/comments/mqzvzz/switching_careers/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "switching careers /!/  \n\nhello all! \n\ni am a doctor by background but for many factors i was becoming more disillusioned with that career path. i’ve always liked the idea of tech and i have picked up online courses along python and i am enjoying it so far. i am hoping with enough practice i can move to r etc and perhaps take it seriously with going back to university. \n\nideally i would love to be in a health data science role where i could still use my clinical knowledge, perhaps for an ngo/digital health.\n\ni am a bit terrified about making the switch though and the ‘-----> grass !!!  is greener’. i would really love to know what people like and dislike about their roles, i really don’t want to make the same mistake of going into a role without fully understanding it!\n\nalso if anyone has any tips or advice for someone in my background i would be so grateful!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 15, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mqzvzz/switching_careers/',)", "identifyer": 5589280, "year": "2021"}, {"autor": "TechnicalRift", "date": 1624478486000, "content": "Grass roots foster care advocate looking for help creating one diagram/graph /!/ Hello everyone! I'm a standalone advocate for Fister youth and I'm looking for help creating a graph. I'll keep the main post short and sweet so if you have any questions about me or my work/volunteering let me know! Picture of what I'm looking for help creating attached. I'm pretty busy so I don't have time to learn the software myself. No expectations, have a good day!", "link": "https://www.reddit.com/r/datascience/comments/o6kqkm/grass_roots_foster_care_advocate_looking_for_help/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "-----> grass !!!  roots foster care advocate looking for help creating one diagram/graph /!/ hello everyone! i'm a standalone advocate for fister youth and i'm looking for help creating a graph. i'll keep the main post short and sweet so if you have any questions about me or my work/volunteering let me know! picture of what i'm looking for help creating attached. i'm pretty busy so i don't have time to learn the software myself. no expectations, have a good day!", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/o6kqkm/grass_roots_foster_care_advocate_looking_for_help/',)", "identifyer": 5593520, "year": "2021"}, {"autor": "Reddit_Account_C-137", "date": 1626645986000, "content": "People looking to switch to data science often only see the grass as greener on the other side, what are some parts of your data science role that you can't stand? /!/ I am currently a mechanical engineer looking to switch to data science because I believe it suits my interests and skills better. I also am sick and tired of documentation in engineering and feel there is not as much room to grow/learn as their would be in data science.\n\nWhat are some parts of your data science role that drive you crazy and possibly even make you consider leaving. Along with each answer I'd love to see a 1-10 scale of how satisfied you are with your current job as I don't only want to hear from data scientists who hate their jobs. I just want to see what the downsides are that people often overlook.", "link": "https://www.reddit.com/r/datascience/comments/on0k0c/people_looking_to_switch_to_data_science_often/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "people looking to switch to data science often only see the -----> grass !!!  as greener on the other side, what are some parts of your data science role that you can't stand? /!/ i am currently a mechanical engineer looking to switch to data science because i believe it suits my interests and skills better. i also am sick and tired of documentation in engineering and feel there is not as much room to grow/learn as their would be in data science.\n\nwhat are some parts of your data science role that drive you crazy and possibly even make you consider leaving. along with each answer i'd love to see a 1-10 scale of how satisfied you are with your current job as i don't only want to hear from data scientists who hate their jobs. i just want to see what the downsides are that people often overlook.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 88, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/on0k0c/people_looking_to_switch_to_data_science_often/',)", "identifyer": 5594610, "year": "2021"}, {"autor": "space-buffalo", "date": 1629653079000, "content": "Doing deep learning at one of the big tech companies... And thinking about going back to school /!/ Hi yall - looking for some advice and coming from the opposite perspective of a lot of posts I see on here. I currently work for one of the major giant tech companies doing computer vision work. Several years ago this would have been my dream job and I do feel incredibly fortunate as I feel I've lucked into some positions and roles that a lot of folks really want. The problem is I just don't love it like I thought I would and I'm thinking about getting a PhD. From a lifetime earnings perspective, I already know that's a terrible life choice, but life isn't just about making money and I want to do something I'm passionate about. Right now I just feel like I'm stuck doing a bunch of hyperparameter tuning and kicking off a zillion experiments. I don't have as much time to implement new architectures and interesting ideas from papers I read - partly because I'm one of the lower people on the totem pole. Also there are a lot of research ideas I want to pursue that we don't have immediate customers for mostly because we may be a couple years of work away from something really useful. The problem is, I don't want to just be a green grass chaser and give up my current salary to do something that I also don't love. Even if I decide it makes sense to go back to school, I'm not sure how to go about it as a lot of programs require recommendation letters from academic faculty, rather than industry colleagues. If anyone has gone through something similar or has thought they wanted to pursue academia and changed their mind, I'd love to hear thoughts.\n\nTldr: Asking for advice on transitioning from industry to academia. Pros/cons and other suggestions", "link": "https://www.reddit.com/r/datascience/comments/p9go17/doing_deep_learning_at_one_of_the_big_tech/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "doing deep learning at one of the big tech companies... and thinking about going back to school /!/ hi yall - looking for some advice and coming from the opposite perspective of a lot of posts i see on here. i currently work for one of the major giant tech companies doing computer vision work. several years ago this would have been my dream job and i do feel incredibly fortunate as i feel i've lucked into some positions and roles that a lot of folks really want. the problem is i just don't love it like i thought i would and i'm thinking about getting a phd. from a lifetime earnings perspective, i already know that's a terrible life choice, but life isn't just about making money and i want to do something i'm passionate about. right now i just feel like i'm stuck doing a bunch of hyperparameter tuning and kicking off a zillion experiments. i don't have as much time to implement new architectures and interesting ideas from papers i read - partly because i'm one of the lower people on the totem pole. also there are a lot of research ideas i want to pursue that we don't have immediate customers for mostly because we may be a couple years of work away from something really useful. the problem is, i don't want to just be a green -----> grass !!!  chaser and give up my current salary to do something that i also don't love. even if i decide it makes sense to go back to school, i'm not sure how to go about it as a lot of programs require recommendation letters from academic faculty, rather than industry colleagues. if anyone has gone through something similar or has thought they wanted to pursue academia and changed their mind, i'd love to hear thoughts.\n\ntldr: asking for advice on transitioning from industry to academia. pros/cons and other suggestions", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 29, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/p9go17/doing_deep_learning_at_one_of_the_big_tech/',)", "identifyer": 5598484, "year": "2021"}, {"autor": "Global-Goat-2949", "date": 1619180524000, "content": "Thinking about leaving the field /!/ I’m an analyst currently with 2 yoe and I’m really not enjoying the work. The worst part for me is dealing with stakeholders who assume that a certain project or analysis is feasible and don’t respond well to concerns (small sample sizes, bias, etc), they just want it done and they often will decide what the outcome should show before we do any work. \n\nI also don’t enjoy diving into an analysis and spending a day on something only to find we can’t make any conclusions about something. It’s frustrating and feels like wasted time. I’m not sure what other kinds of careers I would want to do though, and they say the grass is always greener, but I at least enjoy coding, I just don’t think I’m cut out for data science.", "link": "https://www.reddit.com/r/datascience/comments/mwu0sd/thinking_about_leaving_the_field/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "grass", "selectorShort": "grass", "MarkedSent": "thinking about leaving the field /!/ i’m an analyst currently with 2 yoe and i’m really not enjoying the work. the worst part for me is dealing with stakeholders who assume that a certain project or analysis is feasible and don’t respond well to concerns (small sample sizes, bias, etc), they just want it done and they often will decide what the outcome should show before we do any work. \n\ni also don’t enjoy diving into an analysis and spending a day on something only to find we can’t make any conclusions about something. it’s frustrating and feels like wasted time. i’m not sure what other kinds of careers i would want to do though, and they say the -----> grass !!!  is always greener, but i at least enjoy coding, i just don’t think i’m cut out for data science.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mwu0sd/thinking_about_leaving_the_field/',)", "identifyer": 5598922, "year": "2021"}], "name": "grassdatascience2021"}