{"interestingcomments": [{"autor": "gg4u", "date": 1620978888000, "content": "On-the field jobs with DataScience - wildlife / nature conservation ? /!/ \\-Also referring to - [https://www.reddit.com/r/datascience/comments/h8bz3b/anyone\\_working\\_in\\_conservation\\_wildlife/](https://www.reddit.com/r/datascience/comments/h8bz3b/anyone_working_in_conservation_wildlife/)\n\nAnyone working in nature conservation (wildlife, deforestation, ..) AND also working on the field would like to elaborate how much is beneficial to have a background in data-science ?   \n\n\nDo you use DS frequently, or manage team making use of DS ?  \nHow much is valuable for engaging in outdoor activities and negotiate opportunities to go on the field for part of the job ?  \nWhat kind of activities do you do ?\n\n\\-   \n\nPossibly, I'd like to hear about opportunities of fieldwork in the EU - and possibly, if only volunteering pops up, at least volunteering activities offering full cover of costs and relocation.  \n\n\nMy situation is that I'd like to gain a relevant background for PhD making use of tech (e.g. ML) and in perspective aim for jobs where I can live outdoor part of the time. In order to apply for a PhD, I need to get a MSc first (at least in the EU), and due to my background it may be easier to get a MSc in a tech domain rather than a knowledge-related domain (e.g. biology / natural science / ethology, .., that would require prior related academic background in these disciplines).  \n\n\nI'd like to hear from other experiences to think about appropriate expectations and tips to consider - in perspective, I don't want to stay 130% of my time in front of a computer, while I find very motivating the possibility to match direct observations and outdoor activities with the part for processing.   \n\n\nIn perspectives, I think tech will open up for new opportunities also in this field, and again I wonder how a tech background would be considered and leveraged VS knowledge domain backgrounds or direct on-field experience.", "link": "https://www.reddit.com/r/datascience/comments/nc36cc/onthe_field_jobs_with_datascience_wildlife_nature/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "on-the field jobs with datascience - wildlife / nature conservation ? /!/ \\-also referring to - [https://www.reddit.com/r/datascience/comments/h8bz3b/anyone\\_working\\_in\\_conservation\\_wildlife/](https://www.reddit.com/r/datascience/comments/h8bz3b/anyone_working_in_conservation_wildlife/)\n\nanyone working in nature conservation (wildlife, deforestation, ..) and also working on the field would like to elaborate how much is beneficial to have a background in data-science ?   \n\n\ndo you use ds frequently, or manage team making use of ds ?  \nhow much is valuable for engaging in -----> outdoor !!!  activities and negotiate opportunities to go on the field for part of the job ?  \nwhat kind of activities do you do ?\n\n\\-   \n\npossibly, i'd like to hear about opportunities of fieldwork in the eu - and possibly, if only volunteering pops up, at least volunteering activities offering full cover of costs and relocation.  \n\n\nmy situation is that i'd like to gain a relevant background for phd making use of tech (e.g. ml) and in perspective aim for jobs where i can live outdoor part of the time. in order to apply for a phd, i need to get a msc first (at least in the eu), and due to my background it may be easier to get a msc in a tech domain rather than a knowledge-related domain (e.g. biology / natural science / ethology, .., that would require prior related academic background in these disciplines).  \n\n\ni'd like to hear from other experiences to think about appropriate expectations and tips to consider - in perspective, i don't want to stay 130% of my time in front of a computer, while i find very motivating the possibility to match direct observations and outdoor activities with the part for processing.   \n\n\nin perspectives, i think tech will open up for new opportunities also in this field, and again i wonder how a tech background would be considered and leveraged vs knowledge domain backgrounds or direct on-field experience.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 10, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/nc36cc/onthe_field_jobs_with_datascience_wildlife_nature/',)", "identifyer": 5587636, "year": "2021"}, {"autor": "straightbackward", "date": 1622367918000, "content": "Kaggle and burnouts /!/ I am interested to know how often do people participate in Kaggle competitions, and when do they get to work on the competition's code.\n\nI have a full-time data science/research position so I am usually occupied during the weekdays. In the weekends I just like to take sometime off-the-screen and do outdoor activities (hiking, cycling, chilling out). I am keen on getting more engaged in Kaggle competitions so I can have a broader knowledge and more career opportunities in the future. However, I am concerned that I will burn out, having to stay coding behind the computer screen 7 days a week. My position is a priority for sure, and I don't want my work to be affected because I was not properly taking a time off when I am supposed to. How do other people handle such a situation?\n\nTl;dr: I am interested in becoming more active on Kaggle, but I am concerned that I will burn myself out. What are your tips?", "link": "https://www.reddit.com/r/datascience/comments/no7s9w/kaggle_and_burnouts/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "kaggle and burnouts /!/ i am interested to know how often do people participate in kaggle competitions, and when do they get to work on the competition's code.\n\ni have a full-time data science/research position so i am usually occupied during the weekdays. in the weekends i just like to take sometime off-the-screen and do -----> outdoor !!!  activities (hiking, cycling, chilling out). i am keen on getting more engaged in kaggle competitions so i can have a broader knowledge and more career opportunities in the future. however, i am concerned that i will burn out, having to stay coding behind the computer screen 7 days a week. my position is a priority for sure, and i don't want my work to be affected because i was not properly taking a time off when i am supposed to. how do other people handle such a situation?\n\ntl;dr: i am interested in becoming more active on kaggle, but i am concerned that i will burn myself out. what are your tips?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 64, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/no7s9w/kaggle_and_burnouts/',)", "identifyer": 5588252, "year": "2021"}, {"autor": "__substrata", "date": 1618958197000, "content": "Employer requiring return to office next month /!/ Hi everyone,\n\nI recently found out that my employer is requiring all employees to return to the office next month. The schedule will be staggered, so we won’t have everyone in the office at the same time, but I still don’t feel safe returning yet. \n\nWe are in a large old skyscraper that doesn’t have the greatest ventilation with no outdoor seating and no plan for how employees will be able to safely eat/drink other than I guess doing so at their desk? I’m fully vaccinated, but there is no requirement to be vaccinated to return to the office (which I’m not sure can legally be enforced anyways— outside my realm of knowledge). Masks are required, but I’m not sure how that will be enforced.\n\nI feel very uncomfortable with this and am not sure what to do. I’ve talked with my boss but it seems like this decision is coming from the very top. I want to wait until it is relatively vetted to be safe before returning, but I’m not sure this will be an option for me. \n\nMy question(s): \n\nWhat is your company’s WFH plan? Would you feel comfortable returning? Any advice for what to do in this situation/convince my company to let me stay remote until more of the population is vaccinated and things are safer? \n\nI’m already starting a job search but I would rather not be forced to leave because of something like this. Maybe I would be out of luck no matter where I go if everyone is returning to office, and I just need to deal with this. Any advice/ info would be appreciated!", "link": "https://www.reddit.com/r/datascience/comments/mv2ar2/employer_requiring_return_to_office_next_month/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "employer requiring return to office next month /!/ hi everyone,\n\ni recently found out that my employer is requiring all employees to return to the office next month. the schedule will be staggered, so we won’t have everyone in the office at the same time, but i still don’t feel safe returning yet. \n\nwe are in a large old skyscraper that doesn’t have the greatest ventilation with no -----> outdoor !!!  seating and no plan for how employees will be able to safely eat/drink other than i guess doing so at their desk? i’m fully vaccinated, but there is no requirement to be vaccinated to return to the office (which i’m not sure can legally be enforced anyways— outside my realm of knowledge). masks are required, but i’m not sure how that will be enforced.\n\ni feel very uncomfortable with this and am not sure what to do. i’ve talked with my boss but it seems like this decision is coming from the very top. i want to wait until it is relatively vetted to be safe before returning, but i’m not sure this will be an option for me. \n\nmy question(s): \n\nwhat is your company’s wfh plan? would you feel comfortable returning? any advice for what to do in this situation/convince my company to let me stay remote until more of the population is vaccinated and things are safer? \n\ni’m already starting a job search but i would rather not be forced to leave because of something like this. maybe i would be out of luck no matter where i go if everyone is returning to office, and i just need to deal with this. any advice/ info would be appreciated!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/mv2ar2/employer_requiring_return_to_office_next_month/',)", "identifyer": 5593314, "year": "2021"}], "name": "outdoordatascience2021"}