{"interestingcomments": [{"autor": "PhysicistAmar", "date": 1620225014000, "content": "Decided to pursue opportunities in Data science instead of a PhD in Physics /!/ Last year I completed my masters in Physics. It was a long and satisfying journey. Pursuing a PhD was a logical conclusion, but the journey was not so straightforward. I proceeded to give interviews at IITs for a PhD position but soon figured out that the work I did in masters did not match the positions I was applying for. A difficulty I faced petty regularly in the field. Soon rejections started pouring in. This didn't perturb me at all. \n\nI got an internship opportunity and applied to the USA for PhD positions of my liking. I completed my internship and received a reco. for a school in Brazil, but all was not to be. I soon had a falling out with the professor, who refused to recommend me at the last moment. I had already invested a lot, so I went ahead with my PhD applications and decided to take recommendations from other professors. It was heartwarming to see that so many people, friends, family and teachers were willing to stand up for me. \n\nI was confident in my application, as I did my work under some of the top professors in their field. I simultaneously started preparing myself for a PhD coursework. But by mid-march, I received no email from the grad schools. It got me worried but also funnily jubilant. I soon concluded that I must find something which I would enjoy, somewhere I would feel at home. My curiosity about mathematics and the data-driven world propelled me to study Data Science. \n\nThroughout my course in Physics, I have learned: \n\n\\-How to extract physical information by applying abstract mathematics and statistics. \n\n\\-How to solve real-world problems from the first principle. \n\n\\-Teamwork, communication and management skills by organising and participating in various competitions.\n\nI believe these transferrable skills are most important for any Data science position. \n\nI am still studying machine learning, and I hope to start applying for a job once I complete my projects. Throughout my study I never felt that this was a new field, mathematics and statistics are all too familiar, I have had a healthy programming experience too, and logical reasoning of algorithms feel like derivations in physics. I know I still have a long way to go, and a lot of hardship to face as transitioning your career is never easy. Today it is easier for me to get opportunities in physics than to get them in data science, but I intend to change it as soon as possible. \n\nFew things that today does scare me is that by the time I start applying for a job, I estimate that I would have been unemployed for more than 5-6 months at least and god knows how many more till I land a job. I don't know what can you take from my story but here's a truly random quote from Interstellar, “The only way humans have ever figured out of getting somewhere is to leave something behind.\"", "link": "https://www.reddit.com/r/datascience/comments/n5h92s/decided_to_pursue_opportunities_in_data_science/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "propelled", "selectorShort": "propel", "MarkedSent": "decided to pursue opportunities in data science instead of a phd in physics /!/ last year i completed my masters in physics. it was a long and satisfying journey. pursuing a phd was a logical conclusion, but the journey was not so straightforward. i proceeded to give interviews at iits for a phd position but soon figured out that the work i did in masters did not match the positions i was applying for. a difficulty i faced petty regularly in the field. soon rejections started pouring in. this didn't perturb me at all. \n\ni got an internship opportunity and applied to the usa for phd positions of my liking. i completed my internship and received a reco. for a school in brazil, but all was not to be. i soon had a falling out with the professor, who refused to recommend me at the last moment. i had already invested a lot, so i went ahead with my phd applications and decided to take recommendations from other professors. it was heartwarming to see that so many people, friends, family and teachers were willing to stand up for me. \n\ni was confident in my application, as i did my work under some of the top professors in their field. i simultaneously started preparing myself for a phd coursework. but by mid-march, i received no email from the grad schools. it got me worried but also funnily jubilant. i soon concluded that i must find something which i would enjoy, somewhere i would feel at home. my curiosity about mathematics and the data-driven world -----> propelled !!!  me to study data science. \n\nthroughout my course in physics, i have learned: \n\n\\-how to extract physical information by applying abstract mathematics and statistics. \n\n\\-how to solve real-world problems from the first principle. \n\n\\-teamwork, communication and management skills by organising and participating in various competitions.\n\ni believe these transferrable skills are most important for any data science position. \n\ni am still studying machine learning, and i hope to start applying for a job once i complete my projects. throughout my study i never felt that this was a new field, mathematics and statistics are all too familiar, i have had a healthy programming experience too, and logical reasoning of algorithms feel like derivations in physics. i know i still have a long way to go, and a lot of hardship to face as transitioning your career is never easy. today it is easier for me to get opportunities in physics than to get them in data science, but i intend to change it as soon as possible. \n\nfew things that today does scare me is that by the time i start applying for a job, i estimate that i would have been unemployed for more than 5-6 months at least and god knows how many more till i land a job. i don't know what can you take from my story but here's a truly random quote from interstellar, “the only way humans have ever figured out of getting somewhere is to leave something behind.\"", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/n5h92s/decided_to_pursue_opportunities_in_data_science/',)", "identifyer": 5592804, "year": "2021"}], "name": "propeldatascience2021"}