{"interestingcomments": [{"autor": "RandomBikeMan", "date": 1617681322000, "content": "Considering leaving DS to fix appliances for a living. How stupid am I? /!/ Hey all! I am considering leaving data science to fix appliances for a living. Here is some backstory: Currently 23 and working as a Data Scientist at a Fortune 100 company. TC: 100K living in the midwest. Have been feeling very burnt out lately and really have no inspiration to continue working on projects. Am doing very well in my role, just am not enjoying it in the slightest. Only got into DS because of my math background and at a professors recommendation. I have an opportunity to take over an extremely successful appliance repair company owned by a family member. TC would probably be about equal to start as I get up to speed but potential to grow to around 250K within five years. Current owner is willing to train me up and give me the tools needed to succeed. Am I stupid for even considering doing this? I have found myself living for the weekends when I can wrench on my car or fix things around the house, but will doing it for a job be very unenjoyable? I understand that this isn't a common post on this subreddit, just wasn't sure where else to post.\n\nIf there is anything else I have left out please feel free to ask.", "link": "https://www.reddit.com/r/datascience/comments/ml2xky/considering_leaving_ds_to_fix_appliances_for_a/", "origin": "Reddit", "suborigin": "datascience", "result": true, "Selector": "wrench", "selectorShort": "wrench", "MarkedSent": "considering leaving ds to fix appliances for a living. how stupid am i? /!/ hey all! i am considering leaving data science to fix appliances for a living. here is some backstory: currently 23 and working as a data scientist at a fortune 100 company. tc: 100k living in the midwest. have been feeling very burnt out lately and really have no inspiration to continue working on projects. am doing very well in my role, just am not enjoying it in the slightest. only got into ds because of my math background and at a professors recommendation. i have an opportunity to take over an extremely successful appliance repair company owned by a family member. tc would probably be about equal to start as i get up to speed but potential to grow to around 250k within five years. current owner is willing to train me up and give me the tools needed to succeed. am i stupid for even considering doing this? i have found myself living for the weekends when i can -----> wrench !!!  on my car or fix things around the house, but will doing it for a job be very unenjoyable? i understand that this isn't a common post on this subreddit, just wasn't sure where else to post.\n\nif there is anything else i have left out please feel free to ask.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/datascience/comments/ml2xky/considering_leaving_ds_to_fix_appliances_for_a/',)", "identifyer": 5597120, "year": "2021"}], "name": "wrenchdatascience2021"}