{"interestingcomments": [{"Unnamed: 0": 408, "autor": "Handicraft Decor Items", "date": null, "content": "Kaptown Kreations is one of the best e-commerce companies that manufacture and sell its products both online and offline at affordable prices and in different categories like table décor and wall décor. Like in wall décor it includes colorful metallic trees, leaves, flowers in different sizes and many different types and sizes of the antique wall clock, 7horses in the frame, umbrella décor, welcome boards, etc. And in table décor items includes antique table lamps, pot lamps, antique bikes, cycles, elephant, metallic stool with wooden top, clock inside the bike, an elephant with trolley, etc. You can visit our website link given below.\nhttps://kaptown.com/\nKaptown Kreation is a maker's market. We are the exporter of unique furniture, art, craft, fashion, and home decor created by artisans across India. We are the Manufacturer & Exporter of Handicrafts Décor Items in Jodhpur.\n• Antique bikes\n• Antique scooters\n• Antique cycles\n• Antique elephant bell\n• Antique pots", "link": "https://devpost.com/software/handicraft-decor-items", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "kaptown kreations is one of the best e-commerce companies that manufacture and sell its products both online and offline at affordable prices and in different categories like table décor and wall décor. like in wall décor it includes colorful metallic trees, leaves, flowers in different sizes and many different types and sizes of the -----> antique !!!  wall clock, 7horses in the frame, umbrella décor, welcome boards, etc. and in table décor items includes antique table lamps, pot lamps, antique bikes, cycles, elephant, metallic stool with wooden top, clock inside the bike, an elephant with trolley, etc. you can visit our website link given below.\nhttps://kaptown.com/\nkaptown kreation is a maker's market. we are the exporter of unique furniture, art, craft, fashion, and home decor created by artisans across india. we are the manufacturer & exporter of handicrafts décor items in jodhpur.\n• antique bikes\n• antique scooters\n• antique cycles\n• antique elephant bell\n• antique pots", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500408}, {"Unnamed: 0": 434, "autor": "HOME DECOR ITEMS", "date": null, "content": "Kaptown Kreations in one of the best e-commerce company that manufacture and sell its products both online and offline in affordable prizes and in different categories like table décor and wall décor. Like in wall décor it includes colorful metallic trees, leaves, flowers in different sizes and many different types and sizes of antique wall clock, 7horses in frame, umbrella décor, welcome boards etc. And in table décor items it includes antique table lamps, pot lamps, antique bikes, cycles, elephant, metallic stool with wooden top, clock inside bike, elephant with trolley etc.", "link": "https://devpost.com/software/home-decor-items", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "kaptown kreations in one of the best e-commerce company that manufacture and sell its products both online and offline in affordable prizes and in different categories like table décor and wall décor. like in wall décor it includes colorful metallic trees, leaves, flowers in different sizes and many different types and sizes of -----> antique !!!  wall clock, 7horses in frame, umbrella décor, welcome boards etc. and in table décor items it includes antique table lamps, pot lamps, antique bikes, cycles, elephant, metallic stool with wooden top, clock inside bike, elephant with trolley etc.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500434}, {"Unnamed: 0": 646, "autor": "Large palette knife paintings for sale", "date": null, "content": "Are you rummaging on the internet for an antique collection of Large palette knife paintings for sale at a reasonable price? Your search ends here with us. Feel free to contact us.", "link": "https://devpost.com/software/large-palette-knife-paintings-for-sale", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "are you rummaging on the internet for an -----> antique !!!  collection of large palette knife paintings for sale at a reasonable price? your search ends here with us. feel free to contact us.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500646}, {"Unnamed: 0": 1675, "autor": "Garage door automation", "date": null, "content": "Are you looking for the finest garage door repair service in your area? Precision Garage Doors is the Answer\nPrecision Garage Door is your one-stop garage door repair shop. We can repair any problem regarding your garage door. Whether you wish to change it entirely or are confident that restoring it would suffice, we can handle it flawlessly. We are ready to give you the best garage door automation solution. We have the most up-to-date equipment to repair any problem with your garage door. We can manage any garage door if it is a modern garage door with a sensing technology that operates through wireless operation or an antique rolling garage door.\nTo learn further regarding our services, simply explore our webpage.", "link": "https://devpost.com/software/garage-door-automation-zya0xr", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "are you looking for the finest garage door repair service in your area? precision garage doors is the answer\nprecision garage door is your one-stop garage door repair shop. we can repair any problem regarding your garage door. whether you wish to change it entirely or are confident that restoring it would suffice, we can handle it flawlessly. we are ready to give you the best garage door automation solution. we have the most up-to-date equipment to repair any problem with your garage door. we can manage any garage door if it is a modern garage door with a sensing technology that operates through wireless operation or an -----> antique !!!  rolling garage door.\nto learn further regarding our services, simply explore our webpage.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59501675}, {"Unnamed: 0": 2056, "autor": "MiniBiz", "date": null, "content": "Inspiration\nIndonesia has various tourism places, which provides great opportunity to small businesses. However, due to less reach to tourists and customers these small businesses like small antique shops, food shops they are unable to advertise and sell easily. Therefore, a solution is made so that these small vendors can reach out to tourists and customers and improve their business.\nWhat it does\nIt helps customers to add their interest and find the offering posted by the small businesses. This allows customers to reach them which will improve their sales. Sellers and post about their products online while customers can see posts according to their interest.\nHow we built it\nThis project has been built using flutter for the front end and firebase for the back end.\nChallenges we ran into\nImplementing the post sharing and security in this timeframe was difficult however with our collaboration we managed it.\nAccomplishments that we're proud of\nWe really like our clean UI, with simple solution which can help small businesses. Also, its a single app where customers and sellers can use a single app. Depending on the account it will allow different features.\nWhat we learned\nIt really helped us to improve our knowledge about flutter and firebase. It also helped us to improve our management skills. It also allowed us to collaborate with peers around the world.\nWhat's next for MiniBiz\nThere are lot of areas where this project can be scaled up to benefit the small vendors and businesses. Ability to chat directly with customers can be helpful to businesses. Furthermore, adding ability to make orders directly to businesses will boost their sales and profits.", "link": "https://devpost.com/software/minibiz", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "inspiration\nindonesia has various tourism places, which provides great opportunity to small businesses. however, due to less reach to tourists and customers these small businesses like small -----> antique !!!  shops, food shops they are unable to advertise and sell easily. therefore, a solution is made so that these small vendors can reach out to tourists and customers and improve their business.\nwhat it does\nit helps customers to add their interest and find the offering posted by the small businesses. this allows customers to reach them which will improve their sales. sellers and post about their products online while customers can see posts according to their interest.\nhow we built it\nthis project has been built using flutter for the front end and firebase for the back end.\nchallenges we ran into\nimplementing the post sharing and security in this timeframe was difficult however with our collaboration we managed it.\naccomplishments that we're proud of\nwe really like our clean ui, with simple solution which can help small businesses. also, its a single app where customers and sellers can use a single app. depending on the account it will allow different features.\nwhat we learned\nit really helped us to improve our knowledge about flutter and firebase. it also helped us to improve our management skills. it also allowed us to collaborate with peers around the world.\nwhat's next for minibiz\nthere are lot of areas where this project can be scaled up to benefit the small vendors and businesses. ability to chat directly with customers can be helpful to businesses. furthermore, adding ability to make orders directly to businesses will boost their sales and profits.", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 0, "media": null, "medialink": null, "identifyer": 59502056}], "name": "antiqueDevpost"}