{"interestingcomments": [{"Unnamed: 0": 87, "autor": "Scuity Bed Bug Exterminator Chicago - Bed Bug Removal", "date": null, "content": "Go for a Bed Bug exterminator like us who has the right knowledge and experience in dealing with these insects. As your Chicago bed bug exterminator we will perform a thorough inspection of your home, focusing on problem areas like bedding, cracks, holes, furniture, and walls. When we have identified the problem, we will give the most suitable recommendation regarding treatment method.\n#bedbugexterminator #bedbugheattreatment #bedbugremoval #pestcontrol #chicago\nScuity Bed Bug Exterminator Chicago - Bed Bug Removal - Location\nAddress :- 129 N Wabash Ave Chicago IL 60602\nPhone :- 17083290321\nServices We Offer\nBed Bug Removal\nTermite Control\nBees & Wasps Control\nRodent Control\nAnts Control\nCockroaches Control\nScuity Bed Bug Exterminator Chicago - Bed Bug Removal - Social Profile\nYoutube - https://www.youtube.com/channel/UCzplcSlmYtIkKVPy7STfU9w\nPinterest - https://www.pinterest.com/kimichlandon83/\ntwitter.com - https://twitter.com/Scuitybedbug\ninstagram.com - https://www.instagram.com/scuitybedbug/\nlinkedin.com - https://www.linkedin.com/company/scuity-bed-bug-exterminator-chicago-bed-bug-removal\nfacebook.com - https://www.facebook.com/Scuity-Bed-Bug-Exterminator-Chicago-Bed-Bug-Removal-109155101615419", "link": "https://devpost.com/software/scuity-bed-bug-exterminator-chicago-bed-bug-removal", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "go for a -----> bed !!!  bug exterminator like us who has the right knowledge and experience in dealing with these insects. as your chicago bed bug exterminator we will perform a thorough inspection of your home, focusing on problem areas like bedding, cracks, holes, furniture, and walls. when we have identified the problem, we will give the most suitable recommendation regarding treatment method.\n#bedbugexterminator #bedbugheattreatment #bedbugremoval #pestcontrol #chicago\nscuity bed bug exterminator chicago - bed bug removal - location\naddress :- 129 n wabash ave chicago il 60602\nphone :- 17083290321\nservices we offer\nbed bug removal\ntermite control\nbees & wasps control\nrodent control\nants control\ncockroaches control\nscuity bed bug exterminator chicago - bed bug removal - social profile\nyoutube - https://www.youtube.com/channel/uczplcslmytikkvpy7stfu9w\npinterest - https://www.pinterest.com/kimichlandon83/\ntwitter.com - https://twitter.com/scuitybedbug\ninstagram.com - https://www.instagram.com/scuitybedbug/\nlinkedin.com - https://www.linkedin.com/company/scuity-bed-bug-exterminator-chicago-bed-bug-removal\nfacebook.com - https://www.facebook.com/scuity-bed-bug-exterminator-chicago-bed-bug-removal-109155101615419", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500087}, {"Unnamed: 0": 88, "autor": "Escrow Bed Bug Exterminator NYC - Bed Bug Removal", "date": null, "content": "Go for a Bed Bug exterminator like us who has the right knowledge and experience in dealing with these insects. As your New York bed bug exterminator we will perform a thorough inspection of your home, focusing on problem areas like bedding, cracks, holes, furniture, and walls. When we have identified the problem, we will give the most suitable recommendation regarding treatment method.\n#bedbugexterminator #bedbugheattreatment #bedbugremoval #PestControl #newyork\nEscrow Bed Bug Exterminator NYC - Bed Bug Removal - Location\nAddress :- 716 3rd Ave New York NY 10017\nPhone :- 13152938992\nServices We Offer\nBed Bug Removal\nTermite Control\nBees & Wasps Control\nRodent Control\nAnts Control\nCockroaches Control\nEscrow Bed Bug Exterminator NYC - Bed Bug Removal - Social Profile\nYoutube - https://www.youtube.com/channel/UCwR2DRomDGvQYhFzApAbDPQ\nPinterest - https://www.pinterest.com/inashevillenc/\ntwitter.com - https://twitter.com/Escrowbedbug\ninstagram.com - https://www.instagram.com/escrowbedbug/\nlinkedin.com - https://www.linkedin.com/company/escrow-bed-bug-exterminator-nyc-bed-bug-removal\nfacebook.com - https://www.facebook.com/Escrow-Bed-Bug-Exterminator-NYC-Bed-Bug-Removal-108061691722126", "link": "https://devpost.com/software/escrow-bed-bug-exterminator-nyc-bed-bug-removal", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "go for a -----> bed !!!  bug exterminator like us who has the right knowledge and experience in dealing with these insects. as your new york bed bug exterminator we will perform a thorough inspection of your home, focusing on problem areas like bedding, cracks, holes, furniture, and walls. when we have identified the problem, we will give the most suitable recommendation regarding treatment method.\n#bedbugexterminator #bedbugheattreatment #bedbugremoval #pestcontrol #newyork\nescrow bed bug exterminator nyc - bed bug removal - location\naddress :- 716 3rd ave new york ny 10017\nphone :- 13152938992\nservices we offer\nbed bug removal\ntermite control\nbees & wasps control\nrodent control\nants control\ncockroaches control\nescrow bed bug exterminator nyc - bed bug removal - social profile\nyoutube - https://www.youtube.com/channel/ucwr2dromdgvqyhfzapabdpq\npinterest - https://www.pinterest.com/inashevillenc/\ntwitter.com - https://twitter.com/escrowbedbug\ninstagram.com - https://www.instagram.com/escrowbedbug/\nlinkedin.com - https://www.linkedin.com/company/escrow-bed-bug-exterminator-nyc-bed-bug-removal\nfacebook.com - https://www.facebook.com/escrow-bed-bug-exterminator-nyc-bed-bug-removal-108061691722126", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500088}, {"Unnamed: 0": 630, "autor": "Covid Resources", "date": null, "content": "The COVID-19 crisis and social distancing had a significant impact on our lives. And it has affected the lives of billions of people and to a greater extent this year. “The year of the pandemic” has shown that apps are at the heart of our lives, and we rely on them more than ever before.\nContact tracing apps are used by health departments to find people who may have come into contact with someone infected with COVID-19. Apps aid in the collection of data and the tracking of people's movements, making the process faster and more useful. Some may be able to identify people who may have been exposed to the virus, allowing them to isolate themselves and monitor for symptoms.\nWhat it’s all about\nThe aim of our app is to provide resources to the needful and raise awareness about the challenges caused by the pandemic so that we can fight this pandemic together.\nProblem Statement\nRight now one of the biggest problems that people in India are facing is lack of resources and to be true they face more problems in accessing those resources. Everyday we see our friends posting on social media for the need of resources and many of them don't have access to and don't know about it.\nSolution\nUpon analysing all of these problems our team decided to build an app which would provide accurate information at the time of crisis. As we all know we are being hit by a new wave of covid in every six months or so. We have decided to develop a resources app for covid which would have all the details a person would need.\nIn this app we have listed the resources of different states of India and people who are in need can simply come and search in their locality and can contact them. Our app covid resources focuses on providing accurate data to the users. We have in our database integrated all of the information about the various hospitals across the country using AstraDb and others open source APIs and information available.\nThe interface of our app is extremely simple and user friendly. We have arranged all the resources under state names which users can download as in pdf format or in excel sheet. All you have to do is select your state and you are good to go.\nIdeation\nThe app is divided into different sections : Covid Resources : This is the main objective of the app. It provides information about the COVID resources in the nearby location. The person in need has to just fill his location and it will show all the available resources near him and contact details to avail it. We have stored data of various states in AstraDb.\nCovid statistics : We have Integrated google stats for Covid-19 in our app which helps us to provide accurate data about covid statistics and vaccination statistics. Vaccination / Hospital beds : We have also integrated the status of Vaccination / Hospital beds through which people can get information about the vaccination available and hospital beds available in their area.\nCovid Helpline : We have included various helpline number which will give people ease to contact to proper authority provided by government. Covid Vaccination : We have also added covid vaccination booking link through which people can book their vaccination from the Cowin website. (Official website for Vaccination booking in India).\nVaccine Notification : We have integrated a service in our app through which people can register themselves to get notified whenever vaccine is available.\nChatbot : We have Integrated a chatbot using google dialogflow which will help users to get information about various things. (Chatbot is still needed to be modified).\nPrecautions : We have added a few precautions so that people can get knowledge about it. So this was the basic outline of the app.\nAbout the App\nWe have developed our with the help of Bravo Studio which allowed us to save our time by simpling converting our design from figma to a app and later on we binded the data with the help of APIs to our UI. The main reason behind choosing bravo was that we lacked time and wanted to include as many resources as possible to we used bravo and connected all the information which we wanted to add without compromising on UI.\nWe also used various API since we lacked time so we had to take help from those but in future we are planning to use AstraDb completely to store all the data as the process of data storing is as simple as a pie.\nGithub Repository https://github.com/Abhi6722/covid_resources\nDownload the apk file from here https://github.com/Abhi6722/covid_resources/blob/main/App/Covid_Resources.apk\nWatch the video here https://youtu.be/8O6VWOJZgds", "link": "https://devpost.com/software/covid-resources-v8wkc7", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "the covid-19 crisis and social distancing had a significant impact on our lives. and it has affected the lives of billions of people and to a greater extent this year. “the year of the pandemic” has shown that apps are at the heart of our lives, and we rely on them more than ever before.\ncontact tracing apps are used by health departments to find people who may have come into contact with someone infected with covid-19. apps aid in the collection of data and the tracking of people's movements, making the process faster and more useful. some may be able to identify people who may have been exposed to the virus, allowing them to isolate themselves and monitor for symptoms.\nwhat it’s all about\nthe aim of our app is to provide resources to the needful and raise awareness about the challenges caused by the pandemic so that we can fight this pandemic together.\nproblem statement\nright now one of the biggest problems that people in india are facing is lack of resources and to be true they face more problems in accessing those resources. everyday we see our friends posting on social media for the need of resources and many of them don't have access to and don't know about it.\nsolution\nupon analysing all of these problems our team decided to build an app which would provide accurate information at the time of crisis. as we all know we are being hit by a new wave of covid in every six months or so. we have decided to develop a resources app for covid which would have all the details a person would need.\nin this app we have listed the resources of different states of india and people who are in need can simply come and search in their locality and can contact them. our app covid resources focuses on providing accurate data to the users. we have in our database integrated all of the information about the various hospitals across the country using astradb and others open source apis and information available.\nthe interface of our app is extremely simple and user friendly. we have arranged all the resources under state names which users can download as in pdf format or in excel sheet. all you have to do is select your state and you are good to go.\nideation\nthe app is divided into different sections : covid resources : this is the main objective of the app. it provides information about the covid resources in the nearby location. the person in need has to just fill his location and it will show all the available resources near him and contact details to avail it. we have stored data of various states in astradb.\ncovid statistics : we have integrated google stats for covid-19 in our app which helps us to provide accurate data about covid statistics and vaccination statistics. vaccination / hospital -----> beds !!!  : we have also integrated the status of vaccination / hospital -----> beds !!!  through which people can get information about the vaccination available and hospital -----> beds !!!  available in their area.\ncovid helpline : we have included various helpline number which will give people ease to contact to proper authority provided by government. covid vaccination : we have also added covid vaccination booking link through which people can book their vaccination from the cowin website. (official website for vaccination booking in india).\nvaccine notification : we have integrated a service in our app through which people can register themselves to get notified whenever vaccine is available.\nchatbot : we have integrated a chatbot using google dialogflow which will help users to get information about various things. (chatbot is still needed to be modified).\nprecautions : we have added a few precautions so that people can get knowledge about it. so this was the basic outline of the app.\nabout the app\nwe have developed our with the help of bravo studio which allowed us to save our time by simpling converting our design from figma to a app and later on we binded the data with the help of apis to our ui. the main reason behind choosing bravo was that we lacked time and wanted to include as many resources as possible to we used bravo and connected all the information which we wanted to add without compromising on ui.\nwe also used various api since we lacked time so we had to take help from those but in future we are planning to use astradb completely to store all the data as the process of data storing is as simple as a pie.\ngithub repository https://github.com/abhi6722/covid_resources\ndownload the apk file from here https://github.com/abhi6722/covid_resources/blob/main/app/covid_resources.apk\nwatch the video here https://youtu.be/8o6vwojzgds", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59500630}, {"Unnamed: 0": 631, "autor": "Covid Resources", "date": null, "content": "Covid Resources\nThe COVID-19 crisis and social distancing had a significant impact on our lives. And it has affected the lives of billions of people and to a greater extent this year. “The year of the pandemic” has shown that apps are at the heart of our lives, and we rely on them more than ever before.\nContact tracing apps are used by health departments to find people who may have come into contact with someone infected with COVID-19. Apps aid in the collection of data and the tracking of people's movements, making the process faster and more useful. Some may be able to identify people who may have been exposed to the virus, allowing them to isolate themselves and monitor for symptoms.\nWhat it’s all about\nThe aim of our app is to provide resources to the needful and raise awareness about the challenges caused by the pandemic so that we can fight this pandemic together.\nProblem Statement\nRight now one of the biggest problems that people in India are facing is lack of resources and to be true they face more problems in accessing those resources. Everyday we see our friends posting on social media for the need of resources and many of them don't have access to and don't know about it.\nSolution\nUpon analysing all of these problems our team decided to build an app which would provide accurate information at the time of crisis. As we all know we are being hit by a new wave of covid in every six months or so. We have decided to develop a resources app for covid which would have all the details a person would need.\nIn this app we have listed the resources of different states of India and people who are in need can simply come and search in their locality and can contact them. Our app covid resources focuses on providing accurate data to the users. We have in our database integrated all of the information about the various hospitals across the country using AstraDb and others open source APIs and information available.\nThe interface of our app is extremely simple and user friendly. We have arranged all the resources under state names which users can download as in pdf format or in excel sheet. All you have to do is select your state and you are good to go.\nIdeation\nThe app is divided into different sections : Covid Resources : This is the main objective of the app. It provides information about the COVID resources in the nearby location. The person in need has to just fill his location and it will show all the available resources near him and contact details to avail it. We have stored data of various states in AstraDb.\nCovid statistics : We have Integrated google stats for Covid-19 in our app which helps us to provide accurate data about covid statistics and vaccination statistics. Vaccination / Hospital beds : We have also integrated the status of Vaccination / Hospital beds through which people can get information about the vaccination available and hospital beds available in their area.\nCovid Helpline : We have included various helpline number which will give people ease to contact to proper authority provided by government.\nCovid Vaccination : We have also added covid vaccination booking link through which people can book their vaccination from the Cowin website. (Official website for Vaccination booking in India).\nVaccine Notification : We have integrated a service in our app through which people can register themselves to get notified whenever vaccine is available.\nChatbot : We have Integrated a chatbot using google dialogflow which will help users to get information about various things. (Chatbot is still needed to be modified).\nPrecautions : We have added a few precautions so that people can get knowledge about it. So this was the basic outline of the app.\nAbout the App\nWe have developed our with the help of Bravo Studio which allowed us to save our time by simpling converting our design from figma to a app and later on we binded the data with the help of APIs to our UI. The main reason behind choosing bravo was that we lacked time and wanted to include as many resources as possible to we used bravo and connected all the information which we wanted to add without compromising on UI.\nWe also used various API since we lacked time so we had to take help from those but in future we are planning to use AstraDb completely to store all the data as the process of data storing is as simple as a pie.\nGithub Repository https://github.com/Abhi6722/covid_resources\nDownload the apk file from here https://github.com/Abhi6722/covid_resources/blob/main/App/Covid_Resources.apk\nWatch the video here https://youtu.be/8O6VWOJZgds", "link": "https://devpost.com/software/covid-resources-b8o5zu", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "covid resources\nthe covid-19 crisis and social distancing had a significant impact on our lives. and it has affected the lives of billions of people and to a greater extent this year. “the year of the pandemic” has shown that apps are at the heart of our lives, and we rely on them more than ever before.\ncontact tracing apps are used by health departments to find people who may have come into contact with someone infected with covid-19. apps aid in the collection of data and the tracking of people's movements, making the process faster and more useful. some may be able to identify people who may have been exposed to the virus, allowing them to isolate themselves and monitor for symptoms.\nwhat it’s all about\nthe aim of our app is to provide resources to the needful and raise awareness about the challenges caused by the pandemic so that we can fight this pandemic together.\nproblem statement\nright now one of the biggest problems that people in india are facing is lack of resources and to be true they face more problems in accessing those resources. everyday we see our friends posting on social media for the need of resources and many of them don't have access to and don't know about it.\nsolution\nupon analysing all of these problems our team decided to build an app which would provide accurate information at the time of crisis. as we all know we are being hit by a new wave of covid in every six months or so. we have decided to develop a resources app for covid which would have all the details a person would need.\nin this app we have listed the resources of different states of india and people who are in need can simply come and search in their locality and can contact them. our app covid resources focuses on providing accurate data to the users. we have in our database integrated all of the information about the various hospitals across the country using astradb and others open source apis and information available.\nthe interface of our app is extremely simple and user friendly. we have arranged all the resources under state names which users can download as in pdf format or in excel sheet. all you have to do is select your state and you are good to go.\nideation\nthe app is divided into different sections : covid resources : this is the main objective of the app. it provides information about the covid resources in the nearby location. the person in need has to just fill his location and it will show all the available resources near him and contact details to avail it. we have stored data of various states in astradb.\ncovid statistics : we have integrated google stats for covid-19 in our app which helps us to provide accurate data about covid statistics and vaccination statistics. vaccination / hospital -----> beds !!!  : we have also integrated the status of vaccination / hospital -----> beds !!!  through which people can get information about the vaccination available and hospital -----> beds !!!  available in their area.\ncovid helpline : we have included various helpline number which will give people ease to contact to proper authority provided by government.\ncovid vaccination : we have also added covid vaccination booking link through which people can book their vaccination from the cowin website. (official website for vaccination booking in india).\nvaccine notification : we have integrated a service in our app through which people can register themselves to get notified whenever vaccine is available.\nchatbot : we have integrated a chatbot using google dialogflow which will help users to get information about various things. (chatbot is still needed to be modified).\nprecautions : we have added a few precautions so that people can get knowledge about it. so this was the basic outline of the app.\nabout the app\nwe have developed our with the help of bravo studio which allowed us to save our time by simpling converting our design from figma to a app and later on we binded the data with the help of apis to our ui. the main reason behind choosing bravo was that we lacked time and wanted to include as many resources as possible to we used bravo and connected all the information which we wanted to add without compromising on ui.\nwe also used various api since we lacked time so we had to take help from those but in future we are planning to use astradb completely to store all the data as the process of data storing is as simple as a pie.\ngithub repository https://github.com/abhi6722/covid_resources\ndownload the apk file from here https://github.com/abhi6722/covid_resources/blob/main/app/covid_resources.apk\nwatch the video here https://youtu.be/8o6vwojzgds", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": null, "medialink": null, "identifyer": 59500631}, {"Unnamed: 0": 1115, "autor": "CodeChefs", "date": null, "content": "Inspiration\nLast year I had the inspiration with my close friend to create a coding podcast site. We had been invited to many talks before, and figured why not just make our own?\nWe both come from the restaurant industry\nHence CodeChefs\nWhat it does\nIt's a custom made podcast site, built from scratch. The audio player, hosted assets, the website, etc.\nHow I built it\nIt's built using GatsbyJS. Here's an overview of how it's built:\nhttps://www.vincentntang.com/custom-podcast-site-gatsby-react/\nChallenges I ran into\nWe ran into getting support on some Podcasting services. I wrote a blog on this too\nSome sites didn't subscribe to our RSS format for whatever reason. ITunes required the most amount of work\nhttps://www.vincentntang.com/writing-custom-rss-gatsby/\nAccomplishments that I'm proud of\nI wrote the site with some help on the audio player\n(It wouldn't let us play mp3's between different routes, we ended up using attaching functions to the window to fix it)\nHere's what I worked on\nWrote the GatsbyJS infrastructure\nHandled the Amazon S3 asset pipeline\nBuilt a custom audio player, with 2x playback speed, record keeper, and audio controls\nDistributed this on every major platform\nWhat I learned\nI learned how difficult it is to create an intro / outro sound bite for a podcast. We hired 2-3 sound designers, some working on each other files, for generating a 5 second timeclip.\nWe played around with many ideas with this, to recreate the experience of dining at a restaurant\nThe audio intro alone probably took several months. We had to pick out what type of sound bed to use, SFX noises etc from various sources. Sometimes we produced assets from youtube instead of freecommons assets\nWhat's next for CodeChefs\nMore upcoming episodes. Checkout the site here:\nhttps://codechefs.dev", "link": "https://devpost.com/software/codechefs", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nlast year i had the inspiration with my close friend to create a coding podcast site. we had been invited to many talks before, and figured why not just make our own?\nwe both come from the restaurant industry\nhence codechefs\nwhat it does\nit's a custom made podcast site, built from scratch. the audio player, hosted assets, the website, etc.\nhow i built it\nit's built using gatsbyjs. here's an overview of how it's built:\nhttps://www.vincentntang.com/custom-podcast-site-gatsby-react/\nchallenges i ran into\nwe ran into getting support on some podcasting services. i wrote a blog on this too\nsome sites didn't subscribe to our rss format for whatever reason. itunes required the most amount of work\nhttps://www.vincentntang.com/writing-custom-rss-gatsby/\naccomplishments that i'm proud of\ni wrote the site with some help on the audio player\n(it wouldn't let us play mp3's between different routes, we ended up using attaching functions to the window to fix it)\nhere's what i worked on\nwrote the gatsbyjs infrastructure\nhandled the amazon s3 asset pipeline\nbuilt a custom audio player, with 2x playback speed, record keeper, and audio controls\ndistributed this on every major platform\nwhat i learned\ni learned how difficult it is to create an intro / outro sound bite for a podcast. we hired 2-3 sound designers, some working on each other files, for generating a 5 second timeclip.\nwe played around with many ideas with this, to recreate the experience of dining at a restaurant\nthe audio intro alone probably took several months. we had to pick out what type of sound -----> bed !!!  to use, sfx noises etc from various sources. sometimes we produced assets from youtube instead of freecommons assets\nwhat's next for codechefs\nmore upcoming episodes. checkout the site here:\nhttps://codechefs.dev", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59501115}, {"Unnamed: 0": 2255, "autor": "Lantern", "date": null, "content": "✨ Inspiration\nI was inspired to create Lantern after seeing my grandfather had a cognitive decline and it was very difficult for him to manage it. Most of the times he will be depressed which makes me feel sad and furthermore, I came to know nearly 10 million people suffer from cognitive decline and it is very hard to live their daily lives. So, I decided to help them out. Thus, I created Lantern.\n🍁 What it does\nLantern helps you to prevent cognitive decline with amazing features. The following features are:\n(i) Meditation: You can listen to meditation music and perform meditation. As evidence suggests that meditation may improve some aspects of cognition.\n(ii) Exercise : In our app you can able to watch simple exercise videos which make you fit physically and mentally. As engaging in a program of regular exercise improved cognitive function in people who already had memory problems.\n(iii) Sleep: Inefficient sleeping considered as a major problem of cognitive decline. So, if you can't able to sleep, you can listen to bed time stories in our app using Spotify.\n(iv) Game: We have designed a tic tac toe game. Because it helps develop coordination, fine motor skills and visual skills. It can help improve your concentration.\n(v) Diet: We suggest your healthy food to eat with the certain calories. As Mediterranean diet eating pattern has long been recognized as promoting better cardiovascular health, lowering the risk of certain cancers, and may protect against cognitive decline.\n(v) AR: We also have real time AR feature where you can experience AR at your home. You can have a fun and relaxing time with experiencing AR in real-time. It also relaxes your mind and make you active.\n(vi) Connect: It is a chat feature you can able to chat with your friends. Strong social interactions can help protect your memory and cognitive function in several ways as you age. Research shows that people with strong social ties are less likely to experience cognitive declines than those who are alone.\n(vii) To-do List: Using To-Do list makes you a super productive and organized person.\n🔧 How I built it\nI built this prototype with Figma, and used Canva to create slideshow. For AR I used echo-3D and linked it to figma.\n🏃‍♀️ Challenges we ran into\nOne challenge that I ran into was managing my time while working on this project. I felt difficult while designing the tic tac toe game in figma as it should be interactive. In addition, deciding the features to include was a challenge. I had so many different ideas, and knew that I wouldn’t be able to implement all of them, and could only choose a few.\n💫 Accomplishments that we're proud of\nI’m proud of how I was able to create a comprehensive prototype with decent UI/UX in such a short amount of time. In addition, since this was my first time working on a Figma project solo, it was really interesting to have full control over every aspect of the app, and I’m proud of what I’ve created!\n☄️ What we learned\nResearching for this project has really opened my eyes to how people suffer from cognitive decline and how important it is to work toward a solution. One of the most important things I learnt was how to work more effectively with Figma. I'm still learning how to use it because it's my first time, and every time I use it, I learn something new! And the workshops I have attended was super useful and learnt many new stuffs .\n⚡ What's next for Lantern\nIn the future, I would love to incorporate some features that I didn't get the opportunity to do today. I hope to fully implement my current prototype with code in the future. In addition, I would love to add a community feature where people can engage with other people to create a wholesome community and add a personalized plan for them according to their needs.", "link": "https://devpost.com/software/lantern-7rudet", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "✨ inspiration\ni was inspired to create lantern after seeing my grandfather had a cognitive decline and it was very difficult for him to manage it. most of the times he will be depressed which makes me feel sad and furthermore, i came to know nearly 10 million people suffer from cognitive decline and it is very hard to live their daily lives. so, i decided to help them out. thus, i created lantern.\n🍁 what it does\nlantern helps you to prevent cognitive decline with amazing features. the following features are:\n(i) meditation: you can listen to meditation music and perform meditation. as evidence suggests that meditation may improve some aspects of cognition.\n(ii) exercise : in our app you can able to watch simple exercise videos which make you fit physically and mentally. as engaging in a program of regular exercise improved cognitive function in people who already had memory problems.\n(iii) sleep: inefficient sleeping considered as a major problem of cognitive decline. so, if you can't able to sleep, you can listen to -----> bed !!!  time stories in our app using spotify.\n(iv) game: we have designed a tic tac toe game. because it helps develop coordination, fine motor skills and visual skills. it can help improve your concentration.\n(v) diet: we suggest your healthy food to eat with the certain calories. as mediterranean diet eating pattern has long been recognized as promoting better cardiovascular health, lowering the risk of certain cancers, and may protect against cognitive decline.\n(v) ar: we also have real time ar feature where you can experience ar at your home. you can have a fun and relaxing time with experiencing ar in real-time. it also relaxes your mind and make you active.\n(vi) connect: it is a chat feature you can able to chat with your friends. strong social interactions can help protect your memory and cognitive function in several ways as you age. research shows that people with strong social ties are less likely to experience cognitive declines than those who are alone.\n(vii) to-do list: using to-do list makes you a super productive and organized person.\n🔧 how i built it\ni built this prototype with figma, and used canva to create slideshow. for ar i used echo-3d and linked it to figma.\n🏃‍♀️ challenges we ran into\none challenge that i ran into was managing my time while working on this project. i felt difficult while designing the tic tac toe game in figma as it should be interactive. in addition, deciding the features to include was a challenge. i had so many different ideas, and knew that i wouldn’t be able to implement all of them, and could only choose a few.\n💫 accomplishments that we're proud of\ni’m proud of how i was able to create a comprehensive prototype with decent ui/ux in such a short amount of time. in addition, since this was my first time working on a figma project solo, it was really interesting to have full control over every aspect of the app, and i’m proud of what i’ve created!\n☄️ what we learned\nresearching for this project has really opened my eyes to how people suffer from cognitive decline and how important it is to work toward a solution. one of the most important things i learnt was how to work more effectively with figma. i'm still learning how to use it because it's my first time, and every time i use it, i learn something new! and the workshops i have attended was super useful and learnt many new stuffs .\n⚡ what's next for lantern\nin the future, i would love to incorporate some features that i didn't get the opportunity to do today. i hope to fully implement my current prototype with code in the future. in addition, i would love to add a community feature where people can engage with other people to create a wholesome community and add a personalized plan for them according to their needs.", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": null, "medialink": null, "identifyer": 59502255}, {"Unnamed: 0": 2292, "autor": "HopeInVR", "date": null, "content": "Inspiration\nThe inspiration behind this project is a cousin of my friend, whom I can call here by David. David had been diagnosed with Hemophilia at quite an early age of 2 years. He is currently 10 years old. He had to get a regular blood transfusion in every few months. He had to be taken a lot of care as he grew, so that he didn't hurt himself, especially in public spaces like school. When the worldwide lockdown had been imposed, with a limited access to the outside world he found this to be a really overwhelming experience as he could only go out for the blood transfusions occasionally, if the conditions permitted and had to face another set of issues like over-crowding at hospitals which were briefly turned into vaccination centres and the people suffering from the virus, screaming for oxygen and beds in April 2021 in India.\nWhat it does\nRecently, the use of VR has significantly increased due to travel restrictions. In the 20 months since the COVID-19 pandemic began, technological innovations have gone from futuristic to familiar. Some of these changes are here to stay. Recently, the use of virtual games have become a means to hangout for children and there are many advancements going on this arena. However, it is important that it stays inclusive from the start and is built responsibly by providing safe spaces to children with special needs. It can solve a lot problems of the caregiver as well as the caretaker as they can get to feel by being their shoes in the virtual world.\nChallenges we ran into\nThe main challenge was the ideation phase to think of a feasible solution that can actually be implemented on a scale.\nWhat we learned\nI learned a lot about VR and the problems faced by these children on a daily basis that I were unaware of.\nWhat's next for HopeInVR\nTo actually implement it make a customized VR Experience for children.", "link": "https://devpost.com/software/hopeinvr", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nthe inspiration behind this project is a cousin of my friend, whom i can call here by david. david had been diagnosed with hemophilia at quite an early age of 2 years. he is currently 10 years old. he had to get a regular blood transfusion in every few months. he had to be taken a lot of care as he grew, so that he didn't hurt himself, especially in public spaces like school. when the worldwide lockdown had been imposed, with a limited access to the outside world he found this to be a really overwhelming experience as he could only go out for the blood transfusions occasionally, if the conditions permitted and had to face another set of issues like over-crowding at hospitals which were briefly turned into vaccination centres and the people suffering from the virus, screaming for oxygen and -----> beds !!!  in april 2021 in india.\nwhat it does\nrecently, the use of vr has significantly increased due to travel restrictions. in the 20 months since the covid-19 pandemic began, technological innovations have gone from futuristic to familiar. some of these changes are here to stay. recently, the use of virtual games have become a means to hangout for children and there are many advancements going on this arena. however, it is important that it stays inclusive from the start and is built responsibly by providing safe spaces to children with special needs. it can solve a lot problems of the caregiver as well as the caretaker as they can get to feel by being their shoes in the virtual world.\nchallenges we ran into\nthe main challenge was the ideation phase to think of a feasible solution that can actually be implemented on a scale.\nwhat we learned\ni learned a lot about vr and the problems faced by these children on a daily basis that i were unaware of.\nwhat's next for hopeinvr\nto actually implement it make a customized vr experience for children.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59502292}, {"Unnamed: 0": 2909, "autor": "ESE 111, Team 13, ALSTRETI", "date": null, "content": "Inspiration\nOne night, Mostafa went to bed, got comfortable after tucking himself in, but then promptly forgot that he left the bathroom lights on. He had to get out of bed, and he couldn't go back to sleep for the next 2 hours. Our group had the genius idea to create the ALSTRETI to make sure this never happens to anyone ever again.\nWhat it does\nEssentially, our product attaches to a light switch, allowing the user to control the product using the Blynk app on their phone. The app displays the current light level in the room, and the user has the option to turn the lights on or off, just by using their phone to control the servo motor.\nHow we built it\nWe have a servo motor connected to a NodeMCU, which is powered by an external Power Module. The servo is also connected to a 3D printed attachment that mounts onto the light switch. The NodeMCU then connects to the user’s phone through the Blynk app, allowing the user to seamlessly turn the lights off. If the lights are already off, that’s where the photoresistor comes in. The photoresistor reads the light level of the room and based on the values taken in, the code on the NodeMCU tells the servo to either push the switch down or not move at all. The reverse case holds true as well. If the lights are off, it’ll turn them on at the user’s request. And if they’re already on, it won’t move at all.\nChallenges we ran into\nThere were a few different challenges that we ran into during the construction of the Alsreti. For example, integrating the photoresistor was a hard task, especially since it gave such inconsistent light level readings. As a result, it took quite a while to figure out the thresholds for photoresistor values, but switching from a 220ohm resistor to a 1kohm resistor helped stabilize the values, to an extent. In addition, determining the servo angle to move in the desired direction took some testing, and it took some various trials to determine how to display the light levels from the photoresistor on the Blynk dashboard, using the ArduinoIDE.\nAccomplishments that we're proud of\nWe're quite proud of 3d printing the attachment with accurate measurements, and the servo fits snugly into the part. The attachment screws into the light switch outer plating, fitting the majority of standard light switches, specifically single pole switches. Furthermore, we are quite proud of sending to the data to the Blynk app seamlessly, especially since the university wifi and NodeMCU connection can be spotty at times. Most importantly, we're proud of our final working product, worth more than money can buy.\nWhat we learned\nWe improved our solidworks skills since we had to 3d print the most important attachment for our project. We also learned about the different widgets and functions that the Blynk app offers, and we have a better understanding of how to connect the NodeMCU to the blynk app for any future projects. We also know how to send the photoresistor values to the Blynk app, which allows for endless possibilities in the future.\nWhat's next for Alstreti\nCurrently, Alstreti has plans to implement Alexa and potentially Siri into the project so that the user can simply turn the lights on or off using specific voice commands. Additionally, Alstreti plans on implementing a better photoresistor for more accurate readings so the user can rely on the product for everyday use. Lastly, Alstreti is planning on adding functionality so that the user can install Alstreti devices throughout the entire home, controlling all the light switches with just one button, if the user prefers.", "link": "https://devpost.com/software/alstreti", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\none night, mostafa went to -----> bed !!! , got comfortable after tucking himself in, but then promptly forgot that he left the bathroom lights on. he had to get out of bed, and he couldn't go back to sleep for the next 2 hours. our group had the genius idea to create the alstreti to make sure this never happens to anyone ever again.\nwhat it does\nessentially, our product attaches to a light switch, allowing the user to control the product using the blynk app on their phone. the app displays the current light level in the room, and the user has the option to turn the lights on or off, just by using their phone to control the servo motor.\nhow we built it\nwe have a servo motor connected to a nodemcu, which is powered by an external power module. the servo is also connected to a 3d printed attachment that mounts onto the light switch. the nodemcu then connects to the user’s phone through the blynk app, allowing the user to seamlessly turn the lights off. if the lights are already off, that’s where the photoresistor comes in. the photoresistor reads the light level of the room and based on the values taken in, the code on the nodemcu tells the servo to either push the switch down or not move at all. the reverse case holds true as well. if the lights are off, it’ll turn them on at the user’s request. and if they’re already on, it won’t move at all.\nchallenges we ran into\nthere were a few different challenges that we ran into during the construction of the alsreti. for example, integrating the photoresistor was a hard task, especially since it gave such inconsistent light level readings. as a result, it took quite a while to figure out the thresholds for photoresistor values, but switching from a 220ohm resistor to a 1kohm resistor helped stabilize the values, to an extent. in addition, determining the servo angle to move in the desired direction took some testing, and it took some various trials to determine how to display the light levels from the photoresistor on the blynk dashboard, using the arduinoide.\naccomplishments that we're proud of\nwe're quite proud of 3d printing the attachment with accurate measurements, and the servo fits snugly into the part. the attachment screws into the light switch outer plating, fitting the majority of standard light switches, specifically single pole switches. furthermore, we are quite proud of sending to the data to the blynk app seamlessly, especially since the university wifi and nodemcu connection can be spotty at times. most importantly, we're proud of our final working product, worth more than money can buy.\nwhat we learned\nwe improved our solidworks skills since we had to 3d print the most important attachment for our project. we also learned about the different widgets and functions that the blynk app offers, and we have a better understanding of how to connect the nodemcu to the blynk app for any future projects. we also know how to send the photoresistor values to the blynk app, which allows for endless possibilities in the future.\nwhat's next for alstreti\ncurrently, alstreti has plans to implement alexa and potentially siri into the project so that the user can simply turn the lights on or off using specific voice commands. additionally, alstreti plans on implementing a better photoresistor for more accurate readings so the user can rely on the product for everyday use. lastly, alstreti is planning on adding functionality so that the user can install alstreti devices throughout the entire home, controlling all the light switches with just one button, if the user prefers.", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 0, "media": null, "medialink": null, "identifyer": 59502909}, {"Unnamed: 0": 3190, "autor": "RES-Q 2.0", "date": null, "content": "Inspiration\nUnited Nations Office for Disaster Risk Reduction (UNDRR) says that the total number of people who died due to disasters between 2000 and 2019 is 79,732. Therefore, a device has to be developed to mitigate this issue. The basic working of the device goes like, Assume a Central Disaster Management System (Main Server) which will cover the disasters occurring in the entire country, and will be able to send signals/information to various other state substations (Clients of the main server/Server for the city substations), which in turn will be able to send data to the city substations (client for the state substation/server for the wearable device), which will be able to send data directly to the wearable devices.The idea implementation has to be efficiently carried out so that the overall product will mitigate the pre and the post disaster events. We also have to equip civilians during the time of need, and hence a website (MEDI-GO) is also developed.\nWhat it does\nRES-Q 2.0 will not only help to save lives , but also help is carrying out the rescue operation smoothly. It will measure the pulse rate, location, communication distance of the rescue team to ensure their safety. Also, the SOS alert will help to seek help from the nearest substation in case of emergencies. The Alert feature includes : RED, YELLOW, GREEN categories i.e., in DANGER, needs ASSISTANCE, and rescue operation SUCCESSFUL. Finally the collision avoidance system using the ultrasonic feature, lets the team carry on their work even if the environment is dark. MEDI-GO is a simple interfaced web app that contains emergency features like checking hospital beds availability 24x7, tracking the live location of the patient and giving suitable results, ambulance booking option, real-time checking of the list of doctors for a particular hospital, suggesting hospitals based on reviews and the availability of doctors and beds and displaying the availability of blood in blood banks and schedule donation.\nHow we built it\nRES-Q 2.0\nThe Meteorological Station (main server) will be connected to the state substations.\nThe state substations will be connected to the city substations .\nThe city substations will be connected to the several subsystems which will be operated by the coordinators of the various rescue team.\nThe subsystems will be connected to the device on the rescue team member.\nMEDI-GO\nMedi-Go was developed using the following tools for web development\nJavaScript\nNode.js\nSocket.IO\nPostgresql\nBootstrap\nChallenges we ran into\nDifficulty in accumulating the hardware components within a short period of time.\nDoing a survey and coming up with an innovative idea was difficult within the stipulated time .\nIntegrating multiple components and synchronising the final output was a tedious task\nImplementing bootstrap in the website was demanding.\nAccomplishments that we're proud of\nThe accomplishments we're proud of are\nBeing able to come up with a unique idea that is in demand\nMaking the project in both hardware and software platform\nDeveloping a prototype that empowers the rescue team and general citizens\nWhat we learned\nArduino coding\nCisco packet tracer\nNetworking\nInterfacing\nBackend development\nBasic Query systems\nWhat's next for RES-Q 2.0\nDevelopment of an Android app that not only helps firefighters track people but also helps to save lives at a faster rate. The app will be built using the SOS signal generator, and if there is a fire in the apartment/building and there is no way to escape, the signal generator will be released. Furthermore, the device can be miniaturised and combined into one single module. MEDI-GO will also be developed as an app which gives quicker access to the users", "link": "https://devpost.com/software/res-q-2-0-tu6k1q", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nunited nations office for disaster risk reduction (undrr) says that the total number of people who died due to disasters between 2000 and 2019 is 79,732. therefore, a device has to be developed to mitigate this issue. the basic working of the device goes like, assume a central disaster management system (main server) which will cover the disasters occurring in the entire country, and will be able to send signals/information to various other state substations (clients of the main server/server for the city substations), which in turn will be able to send data to the city substations (client for the state substation/server for the wearable device), which will be able to send data directly to the wearable devices.the idea implementation has to be efficiently carried out so that the overall product will mitigate the pre and the post disaster events. we also have to equip civilians during the time of need, and hence a website (medi-go) is also developed.\nwhat it does\nres-q 2.0 will not only help to save lives , but also help is carrying out the rescue operation smoothly. it will measure the pulse rate, location, communication distance of the rescue team to ensure their safety. also, the sos alert will help to seek help from the nearest substation in case of emergencies. the alert feature includes : red, yellow, green categories i.e., in danger, needs assistance, and rescue operation successful. finally the collision avoidance system using the ultrasonic feature, lets the team carry on their work even if the environment is dark. medi-go is a simple interfaced web app that contains emergency features like checking hospital -----> beds !!!  availability 24x7, tracking the live location of the patient and giving suitable results, ambulance booking option, real-time checking of the list of doctors for a particular hospital, suggesting hospitals based on reviews and the availability of doctors and -----> beds !!!  and displaying the availability of blood in blood banks and schedule donation.\nhow we built it\nres-q 2.0\nthe meteorological station (main server) will be connected to the state substations.\nthe state substations will be connected to the city substations .\nthe city substations will be connected to the several subsystems which will be operated by the coordinators of the various rescue team.\nthe subsystems will be connected to the device on the rescue team member.\nmedi-go\nmedi-go was developed using the following tools for web development\njavascript\nnode.js\nsocket.io\npostgresql\nbootstrap\nchallenges we ran into\ndifficulty in accumulating the hardware components within a short period of time.\ndoing a survey and coming up with an innovative idea was difficult within the stipulated time .\nintegrating multiple components and synchronising the final output was a tedious task\nimplementing bootstrap in the website was demanding.\naccomplishments that we're proud of\nthe accomplishments we're proud of are\nbeing able to come up with a unique idea that is in demand\nmaking the project in both hardware and software platform\ndeveloping a prototype that empowers the rescue team and general citizens\nwhat we learned\narduino coding\ncisco packet tracer\nnetworking\ninterfacing\nbackend development\nbasic query systems\nwhat's next for res-q 2.0\ndevelopment of an android app that not only helps firefighters track people but also helps to save lives at a faster rate. the app will be built using the sos signal generator, and if there is a fire in the apartment/building and there is no way to escape, the signal generator will be released. furthermore, the device can be miniaturised and combined into one single module. medi-go will also be developed as an app which gives quicker access to the users", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59503190}, {"Unnamed: 0": 3219, "autor": "CovidClick", "date": null, "content": "The project helps people look for oxygen cylinders and covid beds in their cities. The user can register using their email IDs and a mail will be sent to them regarding the registration conformation. The user can then look for hospitals where oxygen cylinders/ covid beds are available and can book those. The web page is made using html5 and css3 for the frontend and the backend with connection is done using python and Django.", "link": "https://devpost.com/software/covidclick", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "the project helps people look for oxygen cylinders and covid -----> beds !!!  in their cities. the user can register using their email ids and a mail will be sent to them regarding the registration conformation. the user can then look for hospitals where oxygen cylinders/ covid beds are available and can book those. the web page is made using html5 and css3 for the frontend and the backend with connection is done using python and django.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59503219}, {"Unnamed: 0": 3391, "autor": "HourGlass- Financial derivatives to stratify Time Preference", "date": null, "content": "Inspiration\nWe were very inspired by the vision for the future of DeFi and E-Fi (Elastic Finance) from both the Ampleforth (AMPL) team and the Prometheus Research Labs (PRL) team. Ampleforth's ability to act as a cross chain building block got our creative juices flowing with ideas for a wide number of financial derivatives - but we decided on one to move forward with.\nWhat it does\nHourGlass is a collateralized borrowing platform built on top of the collateralized borrowing platform Mooncake, which is built on top of the risk-tranching protocol ButtonTranche.\nHourGlass lets users borrow USDT, using their cryptocurrency holdings as collateral, at a fixed borrowing rate with no liquidation. In fact, HourGlass lets users borrow more USDT than on Mooncake. HourGlass achieves this as follows:\nHourGlass produces two assets that change value over time:\nA-Prime, that earns a fixed interest over time as well as a variable interest over time,\nZ-Prime, that pays a fixed interest over time to A-Prime.\nHow we built it\nWe built the front end with React which talks directly to the ETH network and our contracts. No additional API's were created.\nChallenges we ran into\nOur two biggest challenges were:\nDebugging Solidity problems with our contracts after reverted transactions. We found you really need to understand your contracts to debug them properly because there isn't going to be an existing stack-overflow question for a custom contract you're developing\nRevising our economics so that they made sense for our end users\nAccomplishments that we're proud of\nHaving a functioning dApp on Testnet with a slick front-end is something we're very proud of. We're also proud of learning how to integrate with a few different technologies (Ampleforth, Chainlink Keepers, and Mooncake). We were at pretty surprised with what we were able to complete. For total strangers to come together across the globe and rock out this project, it's pretty impressive and we are very proud of ourselves. Some of us were going to bed as others were just waking up. We literally worked as a team 24/7 on this. We are very proud of just trying our best and getting as far as we did.\nWhat we learned\nWhat didn't we learn ha! Seriously though- we put so many hours into this project and we learned so many things over that time its hard to know where to start. When we started none of us had experience developing on ETH or using web3 and solidity, but we learned them all in and out over the last few weeks. For the first few days went spent a lot of time in the school of hard knocks, but we came out of it stronger and even more eager to continue developing. We also learned a ton about economic incentives - which is a topic that continues to fascinate us. Finally, we learned a lot more about how Mooncake and Ampleforth work under the hood. We hope to continue working with them both going forward to help build the future of E-Fi (Elastic Finance).\nWhat's next for HourGlass\nWe've been discussing several HIPs (HourGlass Improvement Proposals) before we launch on Mainnet. More on that Soon TM. We're also going to MARZ. See ya there.", "link": "https://devpost.com/software/hourglass-q86rzw", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nwe were very inspired by the vision for the future of defi and e-fi (elastic finance) from both the ampleforth (ampl) team and the prometheus research labs (prl) team. ampleforth's ability to act as a cross chain building block got our creative juices flowing with ideas for a wide number of financial derivatives - but we decided on one to move forward with.\nwhat it does\nhourglass is a collateralized borrowing platform built on top of the collateralized borrowing platform mooncake, which is built on top of the risk-tranching protocol buttontranche.\nhourglass lets users borrow usdt, using their cryptocurrency holdings as collateral, at a fixed borrowing rate with no liquidation. in fact, hourglass lets users borrow more usdt than on mooncake. hourglass achieves this as follows:\nhourglass produces two assets that change value over time:\na-prime, that earns a fixed interest over time as well as a variable interest over time,\nz-prime, that pays a fixed interest over time to a-prime.\nhow we built it\nwe built the front end with react which talks directly to the eth network and our contracts. no additional api's were created.\nchallenges we ran into\nour two biggest challenges were:\ndebugging solidity problems with our contracts after reverted transactions. we found you really need to understand your contracts to debug them properly because there isn't going to be an existing stack-overflow question for a custom contract you're developing\nrevising our economics so that they made sense for our end users\naccomplishments that we're proud of\nhaving a functioning dapp on testnet with a slick front-end is something we're very proud of. we're also proud of learning how to integrate with a few different technologies (ampleforth, chainlink keepers, and mooncake). we were at pretty surprised with what we were able to complete. for total strangers to come together across the globe and rock out this project, it's pretty impressive and we are very proud of ourselves. some of us were going to -----> bed !!!  as others were just waking up. we literally worked as a team 24/7 on this. we are very proud of just trying our best and getting as far as we did.\nwhat we learned\nwhat didn't we learn ha! seriously though- we put so many hours into this project and we learned so many things over that time its hard to know where to start. when we started none of us had experience developing on eth or using web3 and solidity, but we learned them all in and out over the last few weeks. for the first few days went spent a lot of time in the school of hard knocks, but we came out of it stronger and even more eager to continue developing. we also learned a ton about economic incentives - which is a topic that continues to fascinate us. finally, we learned a lot more about how mooncake and ampleforth work under the hood. we hope to continue working with them both going forward to help build the future of e-fi (elastic finance).\nwhat's next for hourglass\nwe've been discussing several hips (hourglass improvement proposals) before we launch on mainnet. more on that soon tm. we're also going to marz. see ya there.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 2, "media": null, "medialink": null, "identifyer": 59503391}, {"Unnamed: 0": 4223, "autor": "Frost Spreading with Cellular Automata", "date": null, "content": "Inspiration\nThis project was inspired by a recent paper published on Physical Review E; Frost spreading and pattern formation on microstructured surfaces Hauer et al 2021. They grew ice crystals by varying humidity and temperature and found that interesting structures form. One of the highlights of their paper was the fractal dimension changes when humidity and temperature change. Here we try to capture this phenomenon by employing a simple frost growing model.\nWhat it does\nFirst we divide up our bed into grids, then our simple model takes into account 3 parameters, lambda_1 - This is the rate at which each grid point spontaneously evaporates. In our later model, this parameter is set by the amount if humidity in the air (1/lambda3)\nlambda_2 - This is the rate at which each grid point spontaneously freezes\nlambda_3 - This is the likelihood that each frozen grid point will freeze its nearest neighbours. In our later model, this number is an exponential decay as humidity is sapped out of the environment, this parameter is also proportional to humidity.\nHow we built it\nWe used the Gillespie algorithm to simulate the growth at each timestep given the definitions for lambda_i.\nWe used DBSCAN, an unsupervised ML algorithm to find clusters in order to find phase transitions statistics.\nWe used a Box Counting algorithm to find the fractal dimensions\nChallenges we ran into\nWe found it hard to map our lambda parameters to humidity and temperature\nAccomplishments that we're proud of\nOur simple model can capture some of the key phenomenons they showed in their experiment\nWhat we learned\nWe learned that working together in an office is really fun after COVID!\nWhat's next for Frost Spreading with Cellular Automata\nPublish?", "link": "https://devpost.com/software/frost-spreading-with-cellular-automata", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nthis project was inspired by a recent paper published on physical review e; frost spreading and pattern formation on microstructured surfaces hauer et al 2021. they grew ice crystals by varying humidity and temperature and found that interesting structures form. one of the highlights of their paper was the fractal dimension changes when humidity and temperature change. here we try to capture this phenomenon by employing a simple frost growing model.\nwhat it does\nfirst we divide up our -----> bed !!!  into grids, then our simple model takes into account 3 parameters, lambda_1 - this is the rate at which each grid point spontaneously evaporates. in our later model, this parameter is set by the amount if humidity in the air (1/lambda3)\nlambda_2 - this is the rate at which each grid point spontaneously freezes\nlambda_3 - this is the likelihood that each frozen grid point will freeze its nearest neighbours. in our later model, this number is an exponential decay as humidity is sapped out of the environment, this parameter is also proportional to humidity.\nhow we built it\nwe used the gillespie algorithm to simulate the growth at each timestep given the definitions for lambda_i.\nwe used dbscan, an unsupervised ml algorithm to find clusters in order to find phase transitions statistics.\nwe used a box counting algorithm to find the fractal dimensions\nchallenges we ran into\nwe found it hard to map our lambda parameters to humidity and temperature\naccomplishments that we're proud of\nour simple model can capture some of the key phenomenons they showed in their experiment\nwhat we learned\nwe learned that working together in an office is really fun after covid!\nwhat's next for frost spreading with cellular automata\npublish?", "sortedWord": "None", "removed": "Nan", "score": 10, "comments": 1, "media": null, "medialink": null, "identifyer": 59504223}, {"Unnamed: 0": 4859, "autor": "Team 10 FlexiStand Presentation", "date": null, "content": "Inspiration\nAs regular mobile-phone users, the team felt there was a market needed for phone users while in the reclined position. With FlexiStand, we could eliminate this problem by making a comfortable phone stand that allows you to access your device in multiple positions!\nWhat it Does\nFlexiStand is designed for maximum comfort while in the leisure of your own home, maintaining your ability to lay in bed while browsing the web, watching Netflix, or texting a good friend. FlexiStand is designed to be adjustable to your liking, with a phone grip that works to be minimally intrusive to your mobile device’s screen. Many phone stands are uncomfortable, bulky, or just too difficult to set up. FlexiStand serves to do away with these issues entirely by having a user-friendly, non-intrusive design that prioritizes the user’s comfort.\nHow We Built It\nFlexiStand was designed with the shortcomings of similar products in mind. With these, the team was able to construct a design with maximum comfort for users. The design's full model was developed in SolidWorks.\nChallenges We Ran Into\nConflicting schedules were difficult to manage across the 5-person team. Taking account of time zones, classes, work, exams, etc., was difficult as we collaborated on this project. Regardless, the team was able to create a fleshed-out presentation for the product.\nAccomplishments We're Proud Of\nThe team was able to create an innovative new product that solves a common issue within the entertainment market. FlexiStand caters to consumers, focusing on user-friendliness and comfort.\nWhat We Learned\nThe team learned many fundamental engineering principles in regard to pitching a design and presenting it to executives for approval. Not only did we learn valuable skills in collaborating on a design project, but we also developed skills in developing a proper product under time constraints.", "link": "https://devpost.com/software/flexistand-presentation", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nas regular mobile-phone users, the team felt there was a market needed for phone users while in the reclined position. with flexistand, we could eliminate this problem by making a comfortable phone stand that allows you to access your device in multiple positions!\nwhat it does\nflexistand is designed for maximum comfort while in the leisure of your own home, maintaining your ability to lay in -----> bed !!!  while browsing the web, watching netflix, or texting a good friend. flexistand is designed to be adjustable to your liking, with a phone grip that works to be minimally intrusive to your mobile device’s screen. many phone stands are uncomfortable, bulky, or just too difficult to set up. flexistand serves to do away with these issues entirely by having a user-friendly, non-intrusive design that prioritizes the user’s comfort.\nhow we built it\nflexistand was designed with the shortcomings of similar products in mind. with these, the team was able to construct a design with maximum comfort for users. the design's full model was developed in solidworks.\nchallenges we ran into\nconflicting schedules were difficult to manage across the 5-person team. taking account of time zones, classes, work, exams, etc., was difficult as we collaborated on this project. regardless, the team was able to create a fleshed-out presentation for the product.\naccomplishments we're proud of\nthe team was able to create an innovative new product that solves a common issue within the entertainment market. flexistand caters to consumers, focusing on user-friendliness and comfort.\nwhat we learned\nthe team learned many fundamental engineering principles in regard to pitching a design and presenting it to executives for approval. not only did we learn valuable skills in collaborating on a design project, but we also developed skills in developing a proper product under time constraints.", "sortedWord": "None", "removed": "Nan", "score": 5, "comments": 0, "media": null, "medialink": null, "identifyer": 59504859}, {"Unnamed: 0": 5091, "autor": "Healthcare", "date": null, "content": "Inspiration Healthcare is a global supplier of medical technology for critical care, operating theatre and home healthcare applications.\nWhat it does These sites can help you research your medical conditions, understand possible treatment plans, and help you make educated decisions about your care. However, there’s also a lot of biased, inaccurate, and dangerous misinformation on the Internet.\nHow we built it Whereas digital platforms are finally a focus for healthcare executives, patients aren't that satisfied with what they're getting.\nChallenges we ran into 1. Uncertainty · 2. Insufficient Reform · 3. Insufficient Funding\nAccomplishments that we're proud of We are starting tele consultation service through WhatsApp. ... of our physicians and staff members are proud to serve you in person, online, or by phone\nWhat we learned Hospitals operate on tight financial margins with complex processes to match available beds and staff to the patient census. Even relatively small increases in the census, as can occur with a multicasualty accident etc how to useful people and how to do help people we learned.\nWhat's next for Healthcare While healthcare organizations originally digitized to save costs, 2021 will bring a wave of more interesting artificial intelligence", "link": "https://devpost.com/software/healthcare-86ju9r", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration healthcare is a global supplier of medical technology for critical care, operating theatre and home healthcare applications.\nwhat it does these sites can help you research your medical conditions, understand possible treatment plans, and help you make educated decisions about your care. however, there’s also a lot of biased, inaccurate, and dangerous misinformation on the internet.\nhow we built it whereas digital platforms are finally a focus for healthcare executives, patients aren't that satisfied with what they're getting.\nchallenges we ran into 1. uncertainty · 2. insufficient reform · 3. insufficient funding\naccomplishments that we're proud of we are starting tele consultation service through whatsapp. ... of our physicians and staff members are proud to serve you in person, online, or by phone\nwhat we learned hospitals operate on tight financial margins with complex processes to match available -----> beds !!!  and staff to the patient census. even relatively small increases in the census, as can occur with a multicasualty accident etc how to useful people and how to do help people we learned.\nwhat's next for healthcare while healthcare organizations originally digitized to save costs, 2021 will bring a wave of more interesting artificial intelligence", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59505091}, {"Unnamed: 0": 5552, "autor": "USGBC Texas Best Practices App", "date": null, "content": "Texas is home to world class sustainable buildings and communities. I bet you are not in one!\nWhy is it that proven sustainable betterment designs, technologies, policies, and processes, that already exist within our Texas buildings and communities, and if deployed universally would immediately solve all our equity, health, efficiency, sustainability, resilience, and productivity issues, are not being implemented? The answer is simple. The problem is complicated. Competing eco and value systems are fighting in a race to the bottom to produce minimum-code, lowest-first-cost solutions. 90% of all Texas building and community projects squeak by this non-enforced, minimum-code, lowest-first-cost threshold, and no one is held accountable for the unnecessary and avoidable social and environmental burdens that this low bar places on our communities. There is a way to standardize the evaluation of proven sustainable betterments with respect to their full social, environmental, and financial value to all stakeholders.\nLet's examine the low hanging simple practice of implementing proven better energy and water efficient designs, technologies, policies, and processes. Even with today's myopic and frenzied focus on these issues, very little progress is being made. The efforts are important because successful implementation removes the significant burden of pollution and climate impacting carbon from our communities, but does not pencil out from a business case perspective. Therefore, it is a fight to implement on every project even though higher efficiencies are easily accomplished in projects by good project teams without additional capital expenditure. This better performance threshold is not mandated and/or enforced by most Texas municipalities. The minimum-code, lowest-first-cost mentality prevails. But what if the project had to account for the cost of the pollution and carbon burdens they were throwing onto the backs of the surrounding community? What if you could calculate the dollar cost of that burden and demand that that information be made available to all stakeholders for every project? What if projects were graded on how they addressed those additional burdens. The bottom line is someone always pays, and currently it is you and me through higher healthcare costs, climate catastrophes, shorter lives, less successful lives, etc. 39% of all greenhouse gases and pollution are directly caused by the production of the materials, construction, and operations of our buildings and communities. The built environment must be a major player in creating behaviors for a better future where everyone thrives.\nThe USGBC Best Practices Committee was formed in 2019 to address the fact that almost all deployed best practice designs, technologies, polices, and processes only occur in Class A office buildings, affluent school systems, and large urban municipal buildings. None of these sustainable betterments are “trickling down” to underserved communities or populations. The USGBC Texas Best Practices app was envisioned to bring equitable adoption of proven best practices to all demographics, communities and ecosystems through a common lens evaluation accessible to all stakeholders.\nWhat the US Green Building Council (USGBC) Texas Best Practices app does\nThe USGBC Texas Best Practices app gives users direct access to our USGBC Texas - Best Practice Champions, so that together they might fight and solve the social and environmental problems dumped in their laps by poor building designs, maintenance, operations, slow code adoption, and inconsistent code enforcement. USGBC Texas Best Practice Champions are USGBC Texas members who are consistently deploying above-minimum-code sustainable betterments throughout Texas. They have graciously volunteered to give of their time and talents to help other Texans emulate their superpowers.\nThe USGBC Texas Best Practices app provides dollar cost benefit outcomes of modeled better and best standards of care, wrapped around the people, profit, planet data needed to understand the magnitude impact that best practices create within our buildings and communities.\nThe USGBC Texas Best Practices app provides the business case justification for immediate deployment of voluntary above-minimum-code better and best designs, technologies, policies, and processes and provides the substantiation, professional connections and mentoring needed to ensure the places we live, learn, work, and play are healthy, safe, efficient, resilient, and prosperous.\nThe USGBC Texas Best Practices app is the onramp to understanding how standardized evaluation processes, grounded in shared defendable methodologies, can move the built environment ecosystem toward more equitable, sustainable, resilient, healthy, efficient, and prosperous outcomes. Framed in dollar cost impacts the USGBC Texas Best Practices app lays transparent the intentions and capabilities of our built environment Creators (Developers, City Planners, Code Officials, Architects, Designers, Building Owners and Operators) through preconfigured modeled analysis examples using triple bottom line (people, profit, planet) cost benefit analysis visualizations.\nThe USGBC Texas Best Practices app gives unfiltered access to the social, environmental, and financial cost benefits of deploying, and the unnecessary cost burdens of not deploying, known best practices to both building and community Creators and Inhabitants (Tenant Businesses, School Teachers, Students, Employees, you, and me). This information has been traditionally difficult to obtain in an economical and decision ready timely manner. When this information has been available, it has never been made transparent to building or community Inhabitants. This life and business altering data can now be used by motivated Creators who want to, and know how to, create a better built environment. This data is also now available directly to building and community Inhabitants such that they can hold Creators accountable for not fulfilling their ethical obligations of protecting our health and wellbeing (AIA Ethics Code E.S. 2.4 Environmental Equity and Justice: Members should promote fairness and safety in providing professional services and make reasonable efforts to advise their clients and employers of their obligations to the environment, including: access to clean air, water, sunlight and energy for all; sustainable production, extraction, transportation and consumption practices; a built environment that equitably supports human health and well-being and is resistant to climate change; and restoring degraded or depleted natural resources.)\nThe USGBC Texas Best Practices app creates an organic growth income opportunity for USGBC Texas in support of its mission, \"The U.S. Green Building Council Texas is a community-benefit (501c3) nonprofit committed to ensuring a better built environment for current and future generations of Texans. We are uniquely focused on uniting all stakeholders involved in the development, design, construction, operation and use of the built infrastructure to achieve equitable practices and policies that are economically, environmentally, and socially sustainable.\" The app encourages USGBC membership, in app advertisement, collaboration, partnership, education, and advocacy.\nHow we built it\nThis USGBC Texas Best Practices app was created using modeled triple bottom line cost benefit outcomes of above-minimum-code better and best practices in both a typical Houston middle school and a typical Houston 10-story office building. McMac Cx (www.mcmaccx.com), a Houston Texas social enterprise funded and provided their advanced analytics \"Impact Advocacy Tech\" modeling to populate the app with appropriate data. An app developer was hired to create the initial android interface. The app's current configuration is modeling six (6) \"Best Practices\"\nEnergy Efficiency,\nWater Efficiency,\nOutside Air Ventilation,\nFiltration,\nHVAC Controllability, and\nDaylighting Access\nDigging deeper into the app allows the user to connect directly to USGBC Texas Best Practice Champions (free for USGBC Members, Texas school systems, and community facing organizations and non-profits).\nLinked in-app narrated PowerPoint presentations are currently in production that allow app users to understand what better and best practices are, and how the triple bottom line cost benefit analysis methodologies are used to model social, environmental, and financial outcome benefits.\nThe following best practices are ready to be rolled out to the app:\nESG Implementation\nEmbedded Carbon\nOperational Carbon\nLighting Controllability\nView Access\nMaintenance\nRenewable Energy\nGreen Roof\nPervious Surfaces\nUnmanaged Turf\nTrees & Shrubs\nOnsite Natural Retention\nRecreation Opportunity\nEducational Opportunity\nBiodiversity\nCommunity Connection\nPollination\nSustainability Financing\nChallenges we ran into\nTime, money, and defendable data were the biggest challenges. McMac Cx provided funding, like kind services, and modeled data using recognized global methodologies that allowed an app developer to finish Phase 1 of the app.\nAn unexpected challenge is that motivated building and community creators are hesitant to communicate this revelatory information to their clients. Although the app models a static school and office building's outcomes, architects have been fearful to move forward with the data on existing projects, as it exposes the lack of insight used to make previous decisions. In consultation with leading sustainably focused Creators we are helping them relate these static model results and inject the information at the right time in a project's trajectory and in a manner that does not embarrass them with their traditional clients. By arming them with the data and grounded justification, Creators can differentiate themselves in the marketplace and accomplish what they have been training to create professionally and wanting to create personally. If custom project specific triple bottom line cost benefit modeling and analysis is required users of the app can directly access the list of Best Practices Champions, evaluate their capabilities, and choose a professional that provides those specific services.\nBuilding owners have been slow in figuring out how to sell the better or best practice outcomes in their projects because most of the additional benefit outcomes of better and best practices go directly to the Inhabitant (Social) or community (Environment), and not directly into the building owner's pockets as cash (lowest-first-cost, minimum-code mentality). Building owner's typically only go above this low self-interest threshold if Inhabitants demand it. The USGBC Texas Best Practices app is educating Inhabitants and they are beginning to understand how little their health, wellbeing, and prosperity have been considered in the past. They will be demanding more from their building and community Creators. As an organization USGBC Texas continues to work with all stakeholders to educate and create behavior change within building owner and municipal planner organizations.\nAccomplishments that we're proud of\nWe have been very surprised and gratefully for how many USGBC Texas Members have stepped up and volunteered to become Best Practice Champions. The USGBC Texas Best Practices app has acted as a catalyst for Best Practice Champions to engage locally, bridging the gap between their professional skills and their altruistic passions. Few Creators get out of bed every day looking forward to designing, building, or operating lowest-first-cost, minimum code projects.\nThe creation of the USGBC Texas Best Practices Committee, identifying professionals as USGBC Texas Best Practice Champions, and now the launch of the USGBC Texas Best Practices app has given our members and our collaborative partners a clear opportunity and pathway to connect their professional capabilities with their altruistic passions. Too often building and community Creators are unable to connect their passions to their professions in current employment. One of the requirements to become a USGBC Texas Best Practices Champion is the identification, commitment, and direct connection, either through monetary donations, like-kind professional services, and/or hands on volunteer work, with a local community facing non-profit or other organizations that are attempting to solve the burdens previous Creators have placed on their shoulders. This has created many meaningful and constructive connections and conversations. It has elevated new and existing connections by creating a structured communication conduit through the USGBC Texas Best Practices app for behavior change.\nWhat we learned\nWe have created an accessible first-of-its-kind tool that makes transparent the direct connection between Creator’s behaviors with respect to deployment or non-deployment of best practice's impacts on social, environmental, and financial cost benefit outcomes. However, we have a long way to go to see these types of sustainable betterments become common place in our buildings and communities.\nTo make adoption of these best practices a common reality USGBC Texas has created a strategic plan to make it happen. In broad strokes we will simultaneously advance implementation of best practices through our Best Practice Champions, the Best Practices app, and continued connections to the community through education, advocacy, and outreach.\nWhat's next for USGBC Texas Best Practices App\nHere is our plan moving forward:\nContinue to create content (In-app narrated PowerPoint videos, additional best practice releases, more advertisements).\nRoll out i-Phone and Windows versions of the app. We are currently soliciting grants and donation monies needed to finance the conversion of the app to these additional platforms ($50,000).\nRoll out our Best Practices social media campaign. We are about to launch a consistent weekly social media campaign that will spotlight one (1) Better / Best Practice currently accessible in the app, highlight one Best Practice video, highlight a Best Practice Champion’s superpower and their commitment to USGBC Texas members, schools systems, and community facing organizations, highlight a connected community facing organization’s mission and how USGBC Texas can/is helping, teaser for Better / Best Practices slated to be added to the app, member surveys, Best Practices newsletter, advertiser spotlight, etc. McMac Cx has committed to fund one (1) intern per semester to assist in this effort.\nProfessional video and newsletter production. The goal is to make this app universally accessible and applicable for anyone. The app is currently free to use. Membership in USGBC Texas ($69.00/year) is required to access the Best Practice Champions (Schools Systems and Community facing organizations have free access). We envision at some point potentially charging for access to the app and the videos.", "link": "https://devpost.com/software/usgbc-texas-best-practices-app", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "texas is home to world class sustainable buildings and communities. i bet you are not in one!\nwhy is it that proven sustainable betterment designs, technologies, policies, and processes, that already exist within our texas buildings and communities, and if deployed universally would immediately solve all our equity, health, efficiency, sustainability, resilience, and productivity issues, are not being implemented? the answer is simple. the problem is complicated. competing eco and value systems are fighting in a race to the bottom to produce minimum-code, lowest-first-cost solutions. 90% of all texas building and community projects squeak by this non-enforced, minimum-code, lowest-first-cost threshold, and no one is held accountable for the unnecessary and avoidable social and environmental burdens that this low bar places on our communities. there is a way to standardize the evaluation of proven sustainable betterments with respect to their full social, environmental, and financial value to all stakeholders.\nlet's examine the low hanging simple practice of implementing proven better energy and water efficient designs, technologies, policies, and processes. even with today's myopic and frenzied focus on these issues, very little progress is being made. the efforts are important because successful implementation removes the significant burden of pollution and climate impacting carbon from our communities, but does not pencil out from a business case perspective. therefore, it is a fight to implement on every project even though higher efficiencies are easily accomplished in projects by good project teams without additional capital expenditure. this better performance threshold is not mandated and/or enforced by most texas municipalities. the minimum-code, lowest-first-cost mentality prevails. but what if the project had to account for the cost of the pollution and carbon burdens they were throwing onto the backs of the surrounding community? what if you could calculate the dollar cost of that burden and demand that that information be made available to all stakeholders for every project? what if projects were graded on how they addressed those additional burdens. the bottom line is someone always pays, and currently it is you and me through higher healthcare costs, climate catastrophes, shorter lives, less successful lives, etc. 39% of all greenhouse gases and pollution are directly caused by the production of the materials, construction, and operations of our buildings and communities. the built environment must be a major player in creating behaviors for a better future where everyone thrives.\nthe usgbc best practices committee was formed in 2019 to address the fact that almost all deployed best practice designs, technologies, polices, and processes only occur in class a office buildings, affluent school systems, and large urban municipal buildings. none of these sustainable betterments are “trickling down” to underserved communities or populations. the usgbc texas best practices app was envisioned to bring equitable adoption of proven best practices to all demographics, communities and ecosystems through a common lens evaluation accessible to all stakeholders.\nwhat the us green building council (usgbc) texas best practices app does\nthe usgbc texas best practices app gives users direct access to our usgbc texas - best practice champions, so that together they might fight and solve the social and environmental problems dumped in their laps by poor building designs, maintenance, operations, slow code adoption, and inconsistent code enforcement. usgbc texas best practice champions are usgbc texas members who are consistently deploying above-minimum-code sustainable betterments throughout texas. they have graciously volunteered to give of their time and talents to help other texans emulate their superpowers.\nthe usgbc texas best practices app provides dollar cost benefit outcomes of modeled better and best standards of care, wrapped around the people, profit, planet data needed to understand the magnitude impact that best practices create within our buildings and communities.\nthe usgbc texas best practices app provides the business case justification for immediate deployment of voluntary above-minimum-code better and best designs, technologies, policies, and processes and provides the substantiation, professional connections and mentoring needed to ensure the places we live, learn, work, and play are healthy, safe, efficient, resilient, and prosperous.\nthe usgbc texas best practices app is the onramp to understanding how standardized evaluation processes, grounded in shared defendable methodologies, can move the built environment ecosystem toward more equitable, sustainable, resilient, healthy, efficient, and prosperous outcomes. framed in dollar cost impacts the usgbc texas best practices app lays transparent the intentions and capabilities of our built environment creators (developers, city planners, code officials, architects, designers, building owners and operators) through preconfigured modeled analysis examples using triple bottom line (people, profit, planet) cost benefit analysis visualizations.\nthe usgbc texas best practices app gives unfiltered access to the social, environmental, and financial cost benefits of deploying, and the unnecessary cost burdens of not deploying, known best practices to both building and community creators and inhabitants (tenant businesses, school teachers, students, employees, you, and me). this information has been traditionally difficult to obtain in an economical and decision ready timely manner. when this information has been available, it has never been made transparent to building or community inhabitants. this life and business altering data can now be used by motivated creators who want to, and know how to, create a better built environment. this data is also now available directly to building and community inhabitants such that they can hold creators accountable for not fulfilling their ethical obligations of protecting our health and wellbeing (aia ethics code e.s. 2.4 environmental equity and justice: members should promote fairness and safety in providing professional services and make reasonable efforts to advise their clients and employers of their obligations to the environment, including: access to clean air, water, sunlight and energy for all; sustainable production, extraction, transportation and consumption practices; a built environment that equitably supports human health and well-being and is resistant to climate change; and restoring degraded or depleted natural resources.)\nthe usgbc texas best practices app creates an organic growth income opportunity for usgbc texas in support of its mission, \"the u.s. green building council texas is a community-benefit (501c3) nonprofit committed to ensuring a better built environment for current and future generations of texans. we are uniquely focused on uniting all stakeholders involved in the development, design, construction, operation and use of the built infrastructure to achieve equitable practices and policies that are economically, environmentally, and socially sustainable.\" the app encourages usgbc membership, in app advertisement, collaboration, partnership, education, and advocacy.\nhow we built it\nthis usgbc texas best practices app was created using modeled triple bottom line cost benefit outcomes of above-minimum-code better and best practices in both a typical houston middle school and a typical houston 10-story office building. mcmac cx (www.mcmaccx.com), a houston texas social enterprise funded and provided their advanced analytics \"impact advocacy tech\" modeling to populate the app with appropriate data. an app developer was hired to create the initial android interface. the app's current configuration is modeling six (6) \"best practices\"\nenergy efficiency,\nwater efficiency,\noutside air ventilation,\nfiltration,\nhvac controllability, and\ndaylighting access\ndigging deeper into the app allows the user to connect directly to usgbc texas best practice champions (free for usgbc members, texas school systems, and community facing organizations and non-profits).\nlinked in-app narrated powerpoint presentations are currently in production that allow app users to understand what better and best practices are, and how the triple bottom line cost benefit analysis methodologies are used to model social, environmental, and financial outcome benefits.\nthe following best practices are ready to be rolled out to the app:\nesg implementation\nembedded carbon\noperational carbon\nlighting controllability\nview access\nmaintenance\nrenewable energy\ngreen roof\npervious surfaces\nunmanaged turf\ntrees & shrubs\nonsite natural retention\nrecreation opportunity\neducational opportunity\nbiodiversity\ncommunity connection\npollination\nsustainability financing\nchallenges we ran into\ntime, money, and defendable data were the biggest challenges. mcmac cx provided funding, like kind services, and modeled data using recognized global methodologies that allowed an app developer to finish phase 1 of the app.\nan unexpected challenge is that motivated building and community creators are hesitant to communicate this revelatory information to their clients. although the app models a static school and office building's outcomes, architects have been fearful to move forward with the data on existing projects, as it exposes the lack of insight used to make previous decisions. in consultation with leading sustainably focused creators we are helping them relate these static model results and inject the information at the right time in a project's trajectory and in a manner that does not embarrass them with their traditional clients. by arming them with the data and grounded justification, creators can differentiate themselves in the marketplace and accomplish what they have been training to create professionally and wanting to create personally. if custom project specific triple bottom line cost benefit modeling and analysis is required users of the app can directly access the list of best practices champions, evaluate their capabilities, and choose a professional that provides those specific services.\nbuilding owners have been slow in figuring out how to sell the better or best practice outcomes in their projects because most of the additional benefit outcomes of better and best practices go directly to the inhabitant (social) or community (environment), and not directly into the building owner's pockets as cash (lowest-first-cost, minimum-code mentality). building owner's typically only go above this low self-interest threshold if inhabitants demand it. the usgbc texas best practices app is educating inhabitants and they are beginning to understand how little their health, wellbeing, and prosperity have been considered in the past. they will be demanding more from their building and community creators. as an organization usgbc texas continues to work with all stakeholders to educate and create behavior change within building owner and municipal planner organizations.\naccomplishments that we're proud of\nwe have been very surprised and gratefully for how many usgbc texas members have stepped up and volunteered to become best practice champions. the usgbc texas best practices app has acted as a catalyst for best practice champions to engage locally, bridging the gap between their professional skills and their altruistic passions. few creators get out of -----> bed !!!  every day looking forward to designing, building, or operating lowest-first-cost, minimum code projects.\nthe creation of the usgbc texas best practices committee, identifying professionals as usgbc texas best practice champions, and now the launch of the usgbc texas best practices app has given our members and our collaborative partners a clear opportunity and pathway to connect their professional capabilities with their altruistic passions. too often building and community creators are unable to connect their passions to their professions in current employment. one of the requirements to become a usgbc texas best practices champion is the identification, commitment, and direct connection, either through monetary donations, like-kind professional services, and/or hands on volunteer work, with a local community facing non-profit or other organizations that are attempting to solve the burdens previous creators have placed on their shoulders. this has created many meaningful and constructive connections and conversations. it has elevated new and existing connections by creating a structured communication conduit through the usgbc texas best practices app for behavior change.\nwhat we learned\nwe have created an accessible first-of-its-kind tool that makes transparent the direct connection between creator’s behaviors with respect to deployment or non-deployment of best practice's impacts on social, environmental, and financial cost benefit outcomes. however, we have a long way to go to see these types of sustainable betterments become common place in our buildings and communities.\nto make adoption of these best practices a common reality usgbc texas has created a strategic plan to make it happen. in broad strokes we will simultaneously advance implementation of best practices through our best practice champions, the best practices app, and continued connections to the community through education, advocacy, and outreach.\nwhat's next for usgbc texas best practices app\nhere is our plan moving forward:\ncontinue to create content (in-app narrated powerpoint videos, additional best practice releases, more advertisements).\nroll out i-phone and windows versions of the app. we are currently soliciting grants and donation monies needed to finance the conversion of the app to these additional platforms ($50,000).\nroll out our best practices social media campaign. we are about to launch a consistent weekly social media campaign that will spotlight one (1) better / best practice currently accessible in the app, highlight one best practice video, highlight a best practice champion’s superpower and their commitment to usgbc texas members, schools systems, and community facing organizations, highlight a connected community facing organization’s mission and how usgbc texas can/is helping, teaser for better / best practices slated to be added to the app, member surveys, best practices newsletter, advertiser spotlight, etc. mcmac cx has committed to fund one (1) intern per semester to assist in this effort.\nprofessional video and newsletter production. the goal is to make this app universally accessible and applicable for anyone. the app is currently free to use. membership in usgbc texas ($69.00/year) is required to access the best practice champions (schools systems and community facing organizations have free access). we envision at some point potentially charging for access to the app and the videos.", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 0, "media": null, "medialink": null, "identifyer": 59505552}, {"Unnamed: 0": 5858, "autor": "LaptopVR", "date": null, "content": "Inspiration\nFor the last few years, I’ve had back problems, most likely caused by poor posture when using the computer.\nA few weeks ago, I had a back spasm, and for a few days, I was unable to move most of my body without sharp pain in my back. Using the computer was painful, but I still needed to get work done, especially during midterm season. Both sitting in a chair and slouching in bed cause me to crane my neck, which is not good for my posture.\nAs I was lying there in pain, I wished I had a way to just have the computer screen right above my face, while keeping the keyboard on my lap, so I could keep my spine fully straight when using the computer. I knew I could do this with a VR headset like the Oculus Rift, but those are expensive — around $400.\nBut what if I could use my phone as the VR headset? Since I already own it, the only cost is the VR headset holder. Google Cardboard costs around $5, and a more comfortable one that I purchased off Amazon was only $20. Simply slide the phone in, and you’re ready to display content.\nI tried searching for an app that would allow me to mirror my screen in a stereoscopic view on my phone, but I couldn’t find one in existence. So I made one!\nWhat it does\nFirst, launch the app on your computer. It waits for the companion app to be launched on a phone connected by USB. Once it’s connected, you can start streaming your desktop to your phone, and there is a stereoscopic view displayed on the companion app. Although it looks small, modern phones are pretty high-resolution, so it’s really easy to read the text on the screen. Now simply slide it into the holder and put it on your head. It's just like an extra monitor, but you get a full view and you can look in any direction without hurting your neck!\nHow we built it\nThere were a lot of technical challenges implementing this. In order to have a low latency stream to the phone, I had to do a wired connection over USB, but Apple doesn’t support this natively. I used an external framework called PeerTalk, but they only allow raw TCP packets to be sent over the USB from the computer to the phone, so I had to serialize each frame, de-serialize it on the phone, and then display it stereoscopically, all in real-time.\nChallenges we ran into\nI had a lot of trouble with Objective-C memory safety, especially during deserialization when the data was received by the phone. I was obtaining the data on the phone but was unable to turn it into an actual image for around 24 hours due to numerous bugs. Shoutout to Bhushan, a mentor who helped me debug some annoying memory issues!\nAccomplishments that we're proud of\nI'm super proud that it actually works! In fact, I made one of the final commits using the headset instead of my actual computer screen. It's practical and it works well!\nWhat we learned\nLearned a ton about graphics serialization and Objective-C memory safety.\nWhat's next for LaptopVR\nI want to add the optional ability to track movements using the gyroscope, so you can have a slightly more zoomed-in version of the screen, and look up/down/left/right to see the extremes of the screen. This would make for a more immersive experience!", "link": "https://devpost.com/software/laptopvr", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nfor the last few years, i’ve had back problems, most likely caused by poor posture when using the computer.\na few weeks ago, i had a back spasm, and for a few days, i was unable to move most of my body without sharp pain in my back. using the computer was painful, but i still needed to get work done, especially during midterm season. both sitting in a chair and slouching in -----> bed !!!  cause me to crane my neck, which is not good for my posture.\nas i was lying there in pain, i wished i had a way to just have the computer screen right above my face, while keeping the keyboard on my lap, so i could keep my spine fully straight when using the computer. i knew i could do this with a vr headset like the oculus rift, but those are expensive — around $400.\nbut what if i could use my phone as the vr headset? since i already own it, the only cost is the vr headset holder. google cardboard costs around $5, and a more comfortable one that i purchased off amazon was only $20. simply slide the phone in, and you’re ready to display content.\ni tried searching for an app that would allow me to mirror my screen in a stereoscopic view on my phone, but i couldn’t find one in existence. so i made one!\nwhat it does\nfirst, launch the app on your computer. it waits for the companion app to be launched on a phone connected by usb. once it’s connected, you can start streaming your desktop to your phone, and there is a stereoscopic view displayed on the companion app. although it looks small, modern phones are pretty high-resolution, so it’s really easy to read the text on the screen. now simply slide it into the holder and put it on your head. it's just like an extra monitor, but you get a full view and you can look in any direction without hurting your neck!\nhow we built it\nthere were a lot of technical challenges implementing this. in order to have a low latency stream to the phone, i had to do a wired connection over usb, but apple doesn’t support this natively. i used an external framework called peertalk, but they only allow raw tcp packets to be sent over the usb from the computer to the phone, so i had to serialize each frame, de-serialize it on the phone, and then display it stereoscopically, all in real-time.\nchallenges we ran into\ni had a lot of trouble with objective-c memory safety, especially during deserialization when the data was received by the phone. i was obtaining the data on the phone but was unable to turn it into an actual image for around 24 hours due to numerous bugs. shoutout to bhushan, a mentor who helped me debug some annoying memory issues!\naccomplishments that we're proud of\ni'm super proud that it actually works! in fact, i made one of the final commits using the headset instead of my actual computer screen. it's practical and it works well!\nwhat we learned\nlearned a ton about graphics serialization and objective-c memory safety.\nwhat's next for laptopvr\ni want to add the optional ability to track movements using the gyroscope, so you can have a slightly more zoomed-in version of the screen, and look up/down/left/right to see the extremes of the screen. this would make for a more immersive experience!", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 0, "media": null, "medialink": null, "identifyer": 59505858}, {"Unnamed: 0": 5921, "autor": "Covid Relief", "date": null, "content": "Inspiration\nAs you all know that COVID has been very worst in everybody's life so I thought to make a Project that will be Useful for the people in some way during these tough times. I got inspiration from various COVID Help websites and got this idea.\nWhat it does\nThis website helps people to Find Valid Information about available Plasma Donors, Hospital Beds, Oxygen Suppliers, Medicine/Injection Suppliers, Ambulance Providers and Meal/Tiffin Service Providers.\nHow I built it\nI built this website using HTML, CSS, JavaScript and Bootstrap and Hosted this website using Google Firebase.\nChallenges I ran into\nI was facing issues while Designing the User Interface (UI) for the website because I am a Developer and not a Designer, but in the end, I came up with a Decent Design.\nAccomplishments that I am proud of\nI am proud of the website that I have made because I only have one question to myself whenever I make any project i.e. How will this project be useful to people?. So I try to make a Useful Project from a Real Idea.\nWhat I learned\nFrom this project, I have learned about Designing the Website by using various Design principles like Typography, Consistency, Accessibility, etc\nWhat's next for Covid Relief\nThese things could be added as future updates to this website:\nAdd support for multiple languages.\nMake UI better, cleaner, and accessible.\nAdd support for various countries like for example: Currently, this website is only having data that is based on states in India.", "link": "https://devpost.com/software/covid-relief-p4gqw3", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nas you all know that covid has been very worst in everybody's life so i thought to make a project that will be useful for the people in some way during these tough times. i got inspiration from various covid help websites and got this idea.\nwhat it does\nthis website helps people to find valid information about available plasma donors, hospital -----> beds !!! , oxygen suppliers, medicine/injection suppliers, ambulance providers and meal/tiffin service providers.\nhow i built it\ni built this website using html, css, javascript and bootstrap and hosted this website using google firebase.\nchallenges i ran into\ni was facing issues while designing the user interface (ui) for the website because i am a developer and not a designer, but in the end, i came up with a decent design.\naccomplishments that i am proud of\ni am proud of the website that i have made because i only have one question to myself whenever i make any project i.e. how will this project be useful to people?. so i try to make a useful project from a real idea.\nwhat i learned\nfrom this project, i have learned about designing the website by using various design principles like typography, consistency, accessibility, etc\nwhat's next for covid relief\nthese things could be added as future updates to this website:\nadd support for multiple languages.\nmake ui better, cleaner, and accessible.\nadd support for various countries like for example: currently, this website is only having data that is based on states in india.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59505921}, {"Unnamed: 0": 5983, "autor": "Patronus Pet Cam", "date": null, "content": "Inspiration\nWe noticed that many pet lovers are afraid to let their small pets out of their cages, such as birds and lizards. Their main concern of letting their pets out unsupervised is they might disappear. Just imagine you let your bird out when you go out and couldn't find them anywhere when you got back. They might be chilling on the top of the shelf. They might be hidden under your bed and you can accidentally crash it. We can totally sympathize with the frustration, so we wanted to help pet lovers to always know where their pets are. Even tiny ones.\nWhat it does\nIt keeps track of the location of pets and keeps track of their last seen location if they go out of sight.\nHow we built it\nWe used TensorFlow model to detect common pets. We built an android app to help users see their pet's location and google cloud storage is used to store the images.\nChallenges we ran into\nSetting up the environment to train our model was extremely difficult with outdated sources online. ##Accomplishments that we're proud of\nFirst Hackathon with ai based machine vision\nGetting Google cloud API to work\nDone in 36 hr ##What's next for Patronus Pet Cam\nDeploy our setup to an AI-based camera to acquire better image quality and viewing angle.", "link": "https://devpost.com/software/patronus-pet-cam", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nwe noticed that many pet lovers are afraid to let their small pets out of their cages, such as birds and lizards. their main concern of letting their pets out unsupervised is they might disappear. just imagine you let your bird out when you go out and couldn't find them anywhere when you got back. they might be chilling on the top of the shelf. they might be hidden under your -----> bed !!!  and you can accidentally crash it. we can totally sympathize with the frustration, so we wanted to help pet lovers to always know where their pets are. even tiny ones.\nwhat it does\nit keeps track of the location of pets and keeps track of their last seen location if they go out of sight.\nhow we built it\nwe used tensorflow model to detect common pets. we built an android app to help users see their pet's location and google cloud storage is used to store the images.\nchallenges we ran into\nsetting up the environment to train our model was extremely difficult with outdated sources online. ##accomplishments that we're proud of\nfirst hackathon with ai based machine vision\ngetting google cloud api to work\ndone in 36 hr ##what's next for patronus pet cam\ndeploy our setup to an ai-based camera to acquire better image quality and viewing angle.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59505983}, {"Unnamed: 0": 6083, "autor": "Babii", "date": null, "content": "Inspiration\nMany new parents are afraid their baby will crawl out of their crib at night. Our solution will notify parents their baby is currently crawling out of the crib so that they can save the day.\nWhat it does\nBabii is a system designed to allow parents to detect when their baby is crawling out of its crib. Parents often fear that their baby is going to crawl out, fall, and hurt themself. To help with this struggle, our team created a camera that mounts to the crib and detects if the baby is trying to crawl out. If the server detects that the baby might be in danger of crawling out, it'll immediately text and notify the parents, so they can stop their baby before anything bad happens. There's also an online portal so parents can watch their baby in real time.\nHow we built it\nBabii.space was built using a Python Flask server with Socket.io to handle web sockets. OpenCV was utilized for image processing. On the front end, HTML, CSS, JavaScript, and Tailwind.css were used. The Raspberry Pi's end was a mixture of hardware and software. The Raspberry Pi Zero W was equipped with a PiCam, and a python script written to take a picture and send it through requests.post to the server. A box was then modeled using Fusion 360 and 3D-printed, after measuring the dimensions of the pi and the picam. The box has holes to be mounted on the bar of a crib for easy usage. The website is hosted on Replit.\nChallenges we ran into\nThere were a number of challenges our team ran into.\nAt the start of creating the project, part of the CAD model for the enclosure was askew, which presented issues and resulted in part of the model being redone.\nWith the Raspberry Pi, there was some trouble with the wifi. The DukeOpen wifi performs authentication that the Raspberry Pi doesn't pass, so a lot of time was spent debugging until we found that the DukeVisitor wifi alleviated our problems there. SSH was also laggy, making development slower.\nWhen we set up baby detection, we used opencv to detect the baby. However, Replit couldn't import opencv due to issues with the poetry lock file and module version conflicts. Our team thought we might have to move away from Replit altogether. Thankfully, this issue was solved by using the shell instead of clicking the run button. Also relating to opencv, the server utilized upper and lower bounds to detect the orange of the pumpkin (the baby). Using a stock orange filter, the pumpkin wasn't detected. We had to narrow down the color of the pumpkin to get this to work.\nOn the front end, using flex-grow and then h-full (setting the image to full height) caused the images to extend beyond the bottom bounds of the body. This was solved by explicitly defining the height of the bounding div.\nAccomplishments that we're proud of\nAs a team, we're proud about every aspect of this project. We're proud that the cad model has the correct dimensions and is a compact product. We are also proud that it is baby safe because there are no exposed electronics. We are proud that we can detect the pumpkin(child) and get real-time texting alerts about its location. We are also proud of the UI on our website because it is friendly for new parents and easily usable.\nWhat we learned\nWe learned lot through this - how to share files and work with multiple people on Fusion 360, how to send files through post requests on the Raspberry Pi, how to receive files and process them using Flask and OpenCV, how to use Twilio and send photos, and that the DukeOpen wifi should not be used with Raspberry Pi's.\nWhat's next for Babii\nBabii could be improved by using machine learning with computer vision to detect the baby. Right now it detects the color orange, but in the future this can be made more precise. It can also be improved by using an infrared camera, making it much more applicable during the nighttime. We can also use this by improving upon our design with older children to detect if they roll out of their bed or start to sleepwalk.", "link": "https://devpost.com/software/babii", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nmany new parents are afraid their baby will crawl out of their crib at night. our solution will notify parents their baby is currently crawling out of the crib so that they can save the day.\nwhat it does\nbabii is a system designed to allow parents to detect when their baby is crawling out of its crib. parents often fear that their baby is going to crawl out, fall, and hurt themself. to help with this struggle, our team created a camera that mounts to the crib and detects if the baby is trying to crawl out. if the server detects that the baby might be in danger of crawling out, it'll immediately text and notify the parents, so they can stop their baby before anything bad happens. there's also an online portal so parents can watch their baby in real time.\nhow we built it\nbabii.space was built using a python flask server with socket.io to handle web sockets. opencv was utilized for image processing. on the front end, html, css, javascript, and tailwind.css were used. the raspberry pi's end was a mixture of hardware and software. the raspberry pi zero w was equipped with a picam, and a python script written to take a picture and send it through requests.post to the server. a box was then modeled using fusion 360 and 3d-printed, after measuring the dimensions of the pi and the picam. the box has holes to be mounted on the bar of a crib for easy usage. the website is hosted on replit.\nchallenges we ran into\nthere were a number of challenges our team ran into.\nat the start of creating the project, part of the cad model for the enclosure was askew, which presented issues and resulted in part of the model being redone.\nwith the raspberry pi, there was some trouble with the wifi. the dukeopen wifi performs authentication that the raspberry pi doesn't pass, so a lot of time was spent debugging until we found that the dukevisitor wifi alleviated our problems there. ssh was also laggy, making development slower.\nwhen we set up baby detection, we used opencv to detect the baby. however, replit couldn't import opencv due to issues with the poetry lock file and module version conflicts. our team thought we might have to move away from replit altogether. thankfully, this issue was solved by using the shell instead of clicking the run button. also relating to opencv, the server utilized upper and lower bounds to detect the orange of the pumpkin (the baby). using a stock orange filter, the pumpkin wasn't detected. we had to narrow down the color of the pumpkin to get this to work.\non the front end, using flex-grow and then h-full (setting the image to full height) caused the images to extend beyond the bottom bounds of the body. this was solved by explicitly defining the height of the bounding div.\naccomplishments that we're proud of\nas a team, we're proud about every aspect of this project. we're proud that the cad model has the correct dimensions and is a compact product. we are also proud that it is baby safe because there are no exposed electronics. we are proud that we can detect the pumpkin(child) and get real-time texting alerts about its location. we are also proud of the ui on our website because it is friendly for new parents and easily usable.\nwhat we learned\nwe learned lot through this - how to share files and work with multiple people on fusion 360, how to send files through post requests on the raspberry pi, how to receive files and process them using flask and opencv, how to use twilio and send photos, and that the dukeopen wifi should not be used with raspberry pi's.\nwhat's next for babii\nbabii could be improved by using machine learning with computer vision to detect the baby. right now it detects the color orange, but in the future this can be made more precise. it can also be improved by using an infrared camera, making it much more applicable during the nighttime. we can also use this by improving upon our design with older children to detect if they roll out of their -----> bed !!!  or start to sleepwalk.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59506083}, {"Unnamed: 0": 6127, "autor": "ASL to Action", "date": null, "content": "Submission to Inequality Track\nInspiration\nThe initial inspiration for ASL to Action came from watching a conductor at a recent symphony I attended in order to support my friend who was performing cello. I admired the way the conductor was able to use a hand and baton to drive action from all of those musicians with just simple passionate gestures. That night I went to bed, setting my Google Home alarm, only for it to go off in the middle of the night when my voice was too tired and scratchy to effectively tell it to stop. I thought back to the symphony and laid there wishing I could have signaled a “rest” or off motion with my hands instead of using it to take a sip of water so I could clear my throat and my assistant could understand me. Though there is a physical touch shortcut, the next day I wondered what would it be like to use an assistant if I wasn't someone who spoke verbally, especially using my phone? I thought of just using the typing commands, but then I wondered why people who spoke verbally had more options for communication than those who did not. I brushed the idea off until the night before HackDuke when I went to see “Dune” in theaters. In the film, (semi-spoiler alert but not really) one of the characters uses a singular hand to communicate non-verbal, discrete messages of danger and alert guards on multiple occasions. So, I then (as I was building our team) connected using singular hand gestures to having powerful outcomes and saving a life, which happen to be the two things technology is very good at, to recognizing the powerful element in being able to use technology privately and faster than typing speed.\nWhat it does\nASL to Action is an application that utilizes sign language to simplify the fundamental daily action of communicating with our mobile devices. By integrating a language that speaks through silence in an online space, we bridged the gap between virtual thought and human movements. There’s now more to how we can control our devices to search and text our thoughts by letting our hands speak for us.\nHow we built it\nWe built this using Google's Teachable Machine and Wix. The sign detection and recognition was generated using Google’s Teachable Machine tool. A virtual model was trained for Tensorflow and JavaScript with a team generated dataset, and then uploaded to a demo site hosted by Google. When using Wix, a powerful tool to build and publish a website without buying web hosting or installing software, we started by selecting the template designed for tech websites and adding/removing the necessary sections.\nChallenges we ran into\nWe originally planned to tackle the machine learning portion of ASL to Action using OpenCV and Tensorflow, but encountered several machine-based challenges along the way. We were unable to train the model on the hardware the team had available, and spent several hours searching for an alternate method.\nAccomplishments that we're proud of\nManaged to finalize an AI model, website, and application in a way that successfully aligned with our ideas and effectively depicted our intentions.\nAccomplished the strain of publishing a complete and functioning project in a highly limited time constraint.\nBuilt a collaborative and organized space that promoted nothing short of the energy and aptitude put forth in our success to equally split our workload and finish on time.\nWhat we learned\nOverall, we now have a much better conceptualization of machine learning and how it can be implemented. Although we didn’t use our original model and dataset, we did learn how ML works behind the scenes and gain understanding of how to develop social solutions using machine learning in development. We also learned how to bridge the functionality of human movements with that of the virtual world to program a working outcome.\nWhat's next for ASL to Action\nWe plan on turning this into a fully functioning web app that could benefit thousands of people, thus, bridging the gap between verbal and non-verbal individuals.", "link": "https://devpost.com/software/asl-to-action", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "submission to inequality track\ninspiration\nthe initial inspiration for asl to action came from watching a conductor at a recent symphony i attended in order to support my friend who was performing cello. i admired the way the conductor was able to use a hand and baton to drive action from all of those musicians with just simple passionate gestures. that night i went to -----> bed !!! , setting my google home alarm, only for it to go off in the middle of the night when my voice was too tired and scratchy to effectively tell it to stop. i thought back to the symphony and laid there wishing i could have signaled a “rest” or off motion with my hands instead of using it to take a sip of water so i could clear my throat and my assistant could understand me. though there is a physical touch shortcut, the next day i wondered what would it be like to use an assistant if i wasn't someone who spoke verbally, especially using my phone? i thought of just using the typing commands, but then i wondered why people who spoke verbally had more options for communication than those who did not. i brushed the idea off until the night before hackduke when i went to see “dune” in theaters. in the film, (semi-spoiler alert but not really) one of the characters uses a singular hand to communicate non-verbal, discrete messages of danger and alert guards on multiple occasions. so, i then (as i was building our team) connected using singular hand gestures to having powerful outcomes and saving a life, which happen to be the two things technology is very good at, to recognizing the powerful element in being able to use technology privately and faster than typing speed.\nwhat it does\nasl to action is an application that utilizes sign language to simplify the fundamental daily action of communicating with our mobile devices. by integrating a language that speaks through silence in an online space, we bridged the gap between virtual thought and human movements. there’s now more to how we can control our devices to search and text our thoughts by letting our hands speak for us.\nhow we built it\nwe built this using google's teachable machine and wix. the sign detection and recognition was generated using google’s teachable machine tool. a virtual model was trained for tensorflow and javascript with a team generated dataset, and then uploaded to a demo site hosted by google. when using wix, a powerful tool to build and publish a website without buying web hosting or installing software, we started by selecting the template designed for tech websites and adding/removing the necessary sections.\nchallenges we ran into\nwe originally planned to tackle the machine learning portion of asl to action using opencv and tensorflow, but encountered several machine-based challenges along the way. we were unable to train the model on the hardware the team had available, and spent several hours searching for an alternate method.\naccomplishments that we're proud of\nmanaged to finalize an ai model, website, and application in a way that successfully aligned with our ideas and effectively depicted our intentions.\naccomplished the strain of publishing a complete and functioning project in a highly limited time constraint.\nbuilt a collaborative and organized space that promoted nothing short of the energy and aptitude put forth in our success to equally split our workload and finish on time.\nwhat we learned\noverall, we now have a much better conceptualization of machine learning and how it can be implemented. although we didn’t use our original model and dataset, we did learn how ml works behind the scenes and gain understanding of how to develop social solutions using machine learning in development. we also learned how to bridge the functionality of human movements with that of the virtual world to program a working outcome.\nwhat's next for asl to action\nwe plan on turning this into a fully functioning web app that could benefit thousands of people, thus, bridging the gap between verbal and non-verbal individuals.", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 0, "media": null, "medialink": null, "identifyer": 59506127}, {"Unnamed: 0": 6216, "autor": "AR Furniture App", "date": null, "content": "Inspiration\nWhen I go to buy furniture that time I am confused about which chair and table are looking good at my location, and when I came back home I thought to build something that can visualize us the product before buying it.\nWhat it does\nThis works on an Android-based platform. \"AR Furniture App\" focuses on Visualizing the furniture before purchasing it use of the latest tech and device support. The application fulfills the 3D visualization of any furniture like Table, Chair, Bed, etc… The main agenda of the application is to Visualize the product before purchasing it. This application includes three main modules. 1) 3D Visualization 2) Adjust or move product 3) Admin easily add new furniture design.\nHow we built it\nWe are using Unity for developing the entire application for augmented reality and we are using Google Cloud for storing the 3D objects.\nChallenges we ran into\nWe are new in Unity so we are facing many issues when we build the application like how I connect Google Cloud With my application and there are some Version mismatch errors are happening.\nAccomplishments that we're proud of\nWe are proud to complete this project because it's not just a project it's helped many of the users to choose furniture as their requirements but it will also be a helping hand to the furniture shop owners to promote their furniture.\nWhat we learned\nWe learn Unity how augmented reality work how we can use Google Cloud for easy access etc...\nWhat's next for AR Furniture App\nWe are planning to add features that build 3D objects from 360-degree images.", "link": "https://devpost.com/software/ar-furniture-app", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nwhen i go to buy furniture that time i am confused about which chair and table are looking good at my location, and when i came back home i thought to build something that can visualize us the product before buying it.\nwhat it does\nthis works on an android-based platform. \"ar furniture app\" focuses on visualizing the furniture before purchasing it use of the latest tech and device support. the application fulfills the 3d visualization of any furniture like table, chair, -----> bed !!! , etc… the main agenda of the application is to visualize the product before purchasing it. this application includes three main modules. 1) 3d visualization 2) adjust or move product 3) admin easily add new furniture design.\nhow we built it\nwe are using unity for developing the entire application for augmented reality and we are using google cloud for storing the 3d objects.\nchallenges we ran into\nwe are new in unity so we are facing many issues when we build the application like how i connect google cloud with my application and there are some version mismatch errors are happening.\naccomplishments that we're proud of\nwe are proud to complete this project because it's not just a project it's helped many of the users to choose furniture as their requirements but it will also be a helping hand to the furniture shop owners to promote their furniture.\nwhat we learned\nwe learn unity how augmented reality work how we can use google cloud for easy access etc...\nwhat's next for ar furniture app\nwe are planning to add features that build 3d objects from 360-degree images.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59506216}, {"Unnamed: 0": 6354, "autor": "click2trip", "date": null, "content": "Inspiration\nTrying to plan out a vacation is hard. There are so many things we have to take into account and it can get overwhelming sometimes. Imagine if you could get flight and hotel information with just one click on a map!\nWhat it does\nOur app allows users to search up hotel and flight information with just one click on the map!\nMain Features\nTry out our app here https://www.clicktotrip.tech/\nMap Implementation and Instantaneous Results\nA scalable map with interactive zoom and move functionalities is available for the user to find the exact destination for their vacation. Clicking on the map will instantaneously display flight and hotel options.\nWherever the user clicks on the map, an API is used to find the nearest airport for that location and then return the possible available flights\nThe results shown automatically account for the current availabilities of the flights and hotel bookings. For example, if a hotel is fully booked during the period of your stay, the hotel will not show up as a result.\nIf any components (start date, end date, location) is null or not filled in properly, the API is not called and therefore would not display any results.\nHow we built it\nOur applications allows users to locally store a start date, end date, currency, and home city. We also incorporated the google maps API which allows users to click anywhere they desire to travel to, retrieving relevant metadata such as the latitude, longitude, city, state, country and more, in order to query our API calls to return flights and hotels relevant to the user. Our app then combines the flight and hotel information, sorting them based on star rating, and displays to users how much a trip would cost, where they would stay, which airline they would take, all in their selected currency. Finally, we deployed our app using Netlify and linked it to our custom domain.\nChallenges we ran into\nThe main issue in the project was that the number of requests we could make was limited by the API's we used\nWe had some challenges passing data back and forth between components but we eventually were able to debug our code and make it work.\nWe had trouble buying our domain and connecting it to our application\nAccomplishments that we're proud of\nbeing able to pass around data between components and properly querying results from the API\nWhat's next for click2trip\nThere are other features we could continue on with click2trip.\nHaving options for flights (first class, business, economy)\nHaving options for hotels (types of rooms, how many beds, seaside view?)\nMore error handling for wrong queries on the hotel and flights APIs", "link": "https://devpost.com/software/click2trip", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\ntrying to plan out a vacation is hard. there are so many things we have to take into account and it can get overwhelming sometimes. imagine if you could get flight and hotel information with just one click on a map!\nwhat it does\nour app allows users to search up hotel and flight information with just one click on the map!\nmain features\ntry out our app here https://www.clicktotrip.tech/\nmap implementation and instantaneous results\na scalable map with interactive zoom and move functionalities is available for the user to find the exact destination for their vacation. clicking on the map will instantaneously display flight and hotel options.\nwherever the user clicks on the map, an api is used to find the nearest airport for that location and then return the possible available flights\nthe results shown automatically account for the current availabilities of the flights and hotel bookings. for example, if a hotel is fully booked during the period of your stay, the hotel will not show up as a result.\nif any components (start date, end date, location) is null or not filled in properly, the api is not called and therefore would not display any results.\nhow we built it\nour applications allows users to locally store a start date, end date, currency, and home city. we also incorporated the google maps api which allows users to click anywhere they desire to travel to, retrieving relevant metadata such as the latitude, longitude, city, state, country and more, in order to query our api calls to return flights and hotels relevant to the user. our app then combines the flight and hotel information, sorting them based on star rating, and displays to users how much a trip would cost, where they would stay, which airline they would take, all in their selected currency. finally, we deployed our app using netlify and linked it to our custom domain.\nchallenges we ran into\nthe main issue in the project was that the number of requests we could make was limited by the api's we used\nwe had some challenges passing data back and forth between components but we eventually were able to debug our code and make it work.\nwe had trouble buying our domain and connecting it to our application\naccomplishments that we're proud of\nbeing able to pass around data between components and properly querying results from the api\nwhat's next for click2trip\nthere are other features we could continue on with click2trip.\nhaving options for flights (first class, business, economy)\nhaving options for hotels (types of rooms, how many -----> beds !!! , seaside view?)\nmore error handling for wrong queries on the hotel and flights apis", "sortedWord": "None", "removed": "Nan", "score": 8, "comments": 0, "media": null, "medialink": null, "identifyer": 59506354}, {"Unnamed: 0": 6512, "autor": "Cancer diagnostics.", "date": null, "content": "Inspiration\nA few months ago, covid in India was bad. It was so bad that cancer beds had to be lent out to covid patients. We had to stand in long queues to get any kind of reports and that itself caused a lot of lives to end. It made me realize how cutting down the time of diagnosis in any way can save lives. In 10th grade, I lost a friend to cancer so I decided to cater my project to cancer as a tribute to him, even though it can be used for other kinds of scans as well. I also always wonder if a new treatment could have potentially saved his life so I added an element to help pathologists find patients for their new treatment as well.\nWhat it does\nSupercomputers coupled with machine learning can achieve high accuracy rates, almost as good as the human eye. With projects such as the distributed computer labs that are bringing the power of supercomputers to your doorstep with little to no code, we can easily run Machine Learning Algorithms on supercomputers and get highly accurate predictions. There are supercomputers already doing this. [Proof of concept]\n[Technical Ability] My design currently doesn't have supercomputers as a part of its design. My web application has features to make cancer diagnosis a lot faster. All you have to do is upload a scan and it gives you a prediction if a tumor [brain and breast cancer has been added for this hackathon] was detected or not. Other than that, all the cancer clinics that use the website for diagnosis enter patient information that is stored safely in a database that can be used by pathologists to find patients for new treatments. This can benefit the patients and pathologists and change the course of people's lives. Using this application, the waiting time for diagnosis can be cut down by a lot.\nHow we built it\nHTML - To build the basic structure of the website.\nCSS - To control the presentation, formatting, and layout.\njavascript - To control the behavior of different elements.\nPython/Machine Learning - Python is used to build models that can accurately detect if a person has the tumor or not based on the uploaded scans.\nChallenges we ran into\nAfter building the machine learning models, increasing its accuracy was a challenge. Also completing the complete project in 24 hours and doing it by myself was a little challenging. There were also a few errors in integrating the HTML, CSS, and JS smoothly in the beginning so resolving that was challenging as well.\nAccomplishments that we're proud of\nI enjoyed learning about how supercomputers are on the verge of revolutionizing healthcare. Soon, we can get results for any kind of test in a matter of minutes through AI. I am also proud of finishing everything on time and creating an aesthetically pleasing website.\nWhat we learned\n- Using CNN and many other ML and deep learnings models.\n- UI/UX\nWhat's next for Cancer diagnostics.\nIntegrate supercomputers to the web application and integrate the backend with the frontend properly. Perhaps, pitch the idea to cancer clinics and see if they would be interested in this concept.", "link": "https://devpost.com/software/cancer-diagnostic", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\na few months ago, covid in india was bad. it was so bad that cancer -----> beds !!!  had to be lent out to covid patients. we had to stand in long queues to get any kind of reports and that itself caused a lot of lives to end. it made me realize how cutting down the time of diagnosis in any way can save lives. in 10th grade, i lost a friend to cancer so i decided to cater my project to cancer as a tribute to him, even though it can be used for other kinds of scans as well. i also always wonder if a new treatment could have potentially saved his life so i added an element to help pathologists find patients for their new treatment as well.\nwhat it does\nsupercomputers coupled with machine learning can achieve high accuracy rates, almost as good as the human eye. with projects such as the distributed computer labs that are bringing the power of supercomputers to your doorstep with little to no code, we can easily run machine learning algorithms on supercomputers and get highly accurate predictions. there are supercomputers already doing this. [proof of concept]\n[technical ability] my design currently doesn't have supercomputers as a part of its design. my web application has features to make cancer diagnosis a lot faster. all you have to do is upload a scan and it gives you a prediction if a tumor [brain and breast cancer has been added for this hackathon] was detected or not. other than that, all the cancer clinics that use the website for diagnosis enter patient information that is stored safely in a database that can be used by pathologists to find patients for new treatments. this can benefit the patients and pathologists and change the course of people's lives. using this application, the waiting time for diagnosis can be cut down by a lot.\nhow we built it\nhtml - to build the basic structure of the website.\ncss - to control the presentation, formatting, and layout.\njavascript - to control the behavior of different elements.\npython/machine learning - python is used to build models that can accurately detect if a person has the tumor or not based on the uploaded scans.\nchallenges we ran into\nafter building the machine learning models, increasing its accuracy was a challenge. also completing the complete project in 24 hours and doing it by myself was a little challenging. there were also a few errors in integrating the html, css, and js smoothly in the beginning so resolving that was challenging as well.\naccomplishments that we're proud of\ni enjoyed learning about how supercomputers are on the verge of revolutionizing healthcare. soon, we can get results for any kind of test in a matter of minutes through ai. i am also proud of finishing everything on time and creating an aesthetically pleasing website.\nwhat we learned\n- using cnn and many other ml and deep learnings models.\n- ui/ux\nwhat's next for cancer diagnostics.\nintegrate supercomputers to the web application and integrate the backend with the frontend properly. perhaps, pitch the idea to cancer clinics and see if they would be interested in this concept.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59506512}, {"Unnamed: 0": 6624, "autor": "Teresa Bot", "date": null, "content": "Inspiration - Mother Teresa\nWhat it does - Using C19 Predictor and computer aided black fungus we can predict it using Cnn and the bed availability of nearby hospitals can be found using the mobile application\nHow we built it - A mobile application will enable the hospital to update the count of bed availability (with oxygen and without oxygen ). This data will be stored in the Firebase real-time database. On another end, in the second module, the user will get his current location. The nearby hospitals will be indicated on their smartphones. When he views the indication he can receive the real-time data of the respective hospital.\nChallenges we ran into - Due to this pandemic, we couldn't able to get a database on available hospitals. So we have initialised some duplicate locations. And since Black fungus just now got into attention, we couldn't able to get a quality dataset\nAccomplishments that we're proud of - We are able to assist nurse and take care of the patient during this pandemic situation without human interface\nWhat we learned - We learnt that with ML algorithms we can get more efficiency for the detection of specific fungus related problems\nWhat's next for Vision - customize it and make available around each and every hospital. Make it inexpensive and easily available", "link": "https://devpost.com/software/vision-tpylxe", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration - mother teresa\nwhat it does - using c19 predictor and computer aided black fungus we can predict it using cnn and the -----> bed !!!  availability of nearby hospitals can be found using the mobile application\nhow we built it - a mobile application will enable the hospital to update the count of -----> bed !!!  availability (with oxygen and without oxygen ). this data will be stored in the firebase real-time database. on another end, in the second module, the user will get his current location. the nearby hospitals will be indicated on their smartphones. when he views the indication he can receive the real-time data of the respective hospital.\nchallenges we ran into - due to this pandemic, we couldn't able to get a database on available hospitals. so we have initialised some duplicate locations. and since black fungus just now got into attention, we couldn't able to get a quality dataset\naccomplishments that we're proud of - we are able to assist nurse and take care of the patient during this pandemic situation without human interface\nwhat we learned - we learnt that with ml algorithms we can get more efficiency for the detection of specific fungus related problems\nwhat's next for vision - customize it and make available around each and every hospital. make it inexpensive and easily available", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 1, "media": null, "medialink": null, "identifyer": 59506624}, {"Unnamed: 0": 6703, "autor": "NGOspital", "date": null, "content": "Hi everyone, today I will walk you through our program, made by Riyanshi,Samrath,Devansh and Riya. We have designed our program keeping in mind the ongoing pandemic situation to help hospitals in this covid crisis. We have used Python and csv files to write our code and have created a mixture of what an NGO and hospital does to fulfill their requirement of supplies. It is a menu based program where we have options of creating a database and opening it for the staff, and searching and donating for the donors.Our program can be used by two sets of people , one the donors(anyone can donate, serves the purpose of an NGO)and other the hospital staff or members. Whatever the hospital needs such as vaccines,ppe kits,beds,oxygen cylinders,plasma etc are stored in the database which can be accessed from time to time and can be arranged for the patients. This database is a very convenient method to keep a check on our resources and update the stock as soon as possible.Whenever there is a change in the status of supplies it can be easily edited by the staff to avoid confusion. The staff can update/create this database whereas the people who want to donate can view this database, get an idea of what is needed by the hospital and donate accordingly.He or she can choose whatever he wants to donate and in what quantity by the options given to him. Such as if you want to donate an oxygen cylinder which is numbered as 5, he or she can enter number 5 and subsequently enter the amount like 2 cylinders etc.This can be further elaborated upon where the staff can contact the donors for the resources and the process can run smoothly. I would like to conclude by saying that it isn't something elaborate but it is just an effort to help the hospitals function smoothly with higher productivity without confusion in these turbulent times and can treat as many patients by gathering resources because after all human life matters the most.", "link": "https://devpost.com/software/ngospital", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "hi everyone, today i will walk you through our program, made by riyanshi,samrath,devansh and riya. we have designed our program keeping in mind the ongoing pandemic situation to help hospitals in this covid crisis. we have used python and csv files to write our code and have created a mixture of what an ngo and hospital does to fulfill their requirement of supplies. it is a menu based program where we have options of creating a database and opening it for the staff, and searching and donating for the donors.our program can be used by two sets of people , one the donors(anyone can donate, serves the purpose of an ngo)and other the hospital staff or members. whatever the hospital needs such as vaccines,ppe kits,-----> beds !!! ,oxygen cylinders,plasma etc are stored in the database which can be accessed from time to time and can be arranged for the patients. this database is a very convenient method to keep a check on our resources and update the stock as soon as possible.whenever there is a change in the status of supplies it can be easily edited by the staff to avoid confusion. the staff can update/create this database whereas the people who want to donate can view this database, get an idea of what is needed by the hospital and donate accordingly.he or she can choose whatever he wants to donate and in what quantity by the options given to him. such as if you want to donate an oxygen cylinder which is numbered as 5, he or she can enter number 5 and subsequently enter the amount like 2 cylinders etc.this can be further elaborated upon where the staff can contact the donors for the resources and the process can run smoothly. i would like to conclude by saying that it isn't something elaborate but it is just an effort to help the hospitals function smoothly with higher productivity without confusion in these turbulent times and can treat as many patients by gathering resources because after all human life matters the most.", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": null, "medialink": null, "identifyer": 59506703}, {"Unnamed: 0": 6765, "autor": "Fighting against hunger", "date": null, "content": "Inspiration\nHunger in India remains an alarming issue and every year around 25 lakhs people lose their lives to hunger related causes. One can only imagine how difficult it must be for the families who go to bed everyday starving and thinking they might get food the next day. On the other hand food wastage has become an intense problem for the other section of society. Restaurants, Marriage Halls and many other organizations have to dump daily such large quantities of food because they don't have anyone to feed it before the food rots or become inedible.\nWhat it does\nWith an aim to connect the two sections of society so that one can help the other and that no person sleeps with an empty stomach and no food goes waste, our website would help different organisations to connect with NGOs or Volunteers who work tirelessly to feed every single person. NGOs and Volunteers can pick food packets from restaurants or any other place that has abundant extra food and deliver to nearby slums or people in need. Restaurants may enter their names and Location and they will be provided with a list of nearby Slums or Active NGOs and contacts of Social Workers who can help them deliver the food to the needy people. Complete address of slums will be provided so they can navigate on their own if they wish to.\nHow we build it\nWe were concerned about the hunger problems in our country and the number of casualties that occur every year. We decided to model our website currently for only one city i.e. Mumbai. Our team worked on the frontend using HTML and CSS to give the site a skeleton and add some styling features. Our team used web scrapping to extract locations of Slums, active NGOs and their contacts. We used Flask framework and python language for backend to provide functionality to the webpage.\nChallenges we ran into\nFinding a proper dataset was one of the major problems. Some of the database is outdated and will have to check the dataset from time to time.\nAccomplishments we are proud of\nAlthough there is a lot of features we could add to make the project better but we are yet proud of what we have achieved. The impact our project idea will have on society as it could become a helping step in eliminating hunger from the country. The website correctly displays the locations and contacts of NGOs and slums in the proximity of the given restaurant/function halls.\nWhat we learned\nWeb development has a lot to learn and we clearly had a great start by participating in the hackathon. Also we learnt Teamwork and Time Management.\nWhat's next for Fighting Against Hunger\nWe will try to model every city in India so that more and more people can use the website. We will also try to get population and requirement statistics of every slum so that food can be distributed efficiently.", "link": "https://devpost.com/software/no-losses-n7lzar", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\nhunger in india remains an alarming issue and every year around 25 lakhs people lose their lives to hunger related causes. one can only imagine how difficult it must be for the families who go to -----> bed !!!  everyday starving and thinking they might get food the next day. on the other hand food wastage has become an intense problem for the other section of society. restaurants, marriage halls and many other organizations have to dump daily such large quantities of food because they don't have anyone to feed it before the food rots or become inedible.\nwhat it does\nwith an aim to connect the two sections of society so that one can help the other and that no person sleeps with an empty stomach and no food goes waste, our website would help different organisations to connect with ngos or volunteers who work tirelessly to feed every single person. ngos and volunteers can pick food packets from restaurants or any other place that has abundant extra food and deliver to nearby slums or people in need. restaurants may enter their names and location and they will be provided with a list of nearby slums or active ngos and contacts of social workers who can help them deliver the food to the needy people. complete address of slums will be provided so they can navigate on their own if they wish to.\nhow we build it\nwe were concerned about the hunger problems in our country and the number of casualties that occur every year. we decided to model our website currently for only one city i.e. mumbai. our team worked on the frontend using html and css to give the site a skeleton and add some styling features. our team used web scrapping to extract locations of slums, active ngos and their contacts. we used flask framework and python language for backend to provide functionality to the webpage.\nchallenges we ran into\nfinding a proper dataset was one of the major problems. some of the database is outdated and will have to check the dataset from time to time.\naccomplishments we are proud of\nalthough there is a lot of features we could add to make the project better but we are yet proud of what we have achieved. the impact our project idea will have on society as it could become a helping step in eliminating hunger from the country. the website correctly displays the locations and contacts of ngos and slums in the proximity of the given restaurant/function halls.\nwhat we learned\nweb development has a lot to learn and we clearly had a great start by participating in the hackathon. also we learnt teamwork and time management.\nwhat's next for fighting against hunger\nwe will try to model every city in india so that more and more people can use the website. we will also try to get population and requirement statistics of every slum so that food can be distributed efficiently.", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 0, "media": null, "medialink": null, "identifyer": 59506765}, {"Unnamed: 0": 6790, "autor": "Swasthify", "date": null, "content": "Inspiration\nThis pandemic has literally brought everyone on their knees, the despair and despondency that shrouded the country during covid gave us the motive to calibrate technology and help people out of these unprecedented times. Team Swasthify tries to provide its users with a service-based distinction of our partner hospitals from all across the country. What really keeps us going is a belief that one day we will make the notion of \"hospitals at your fingertips\" true.\nWhat it does\nSwasthify aims at mitigating the hardships people faced during this pandemic. We provide an interactive user interface where a user can directly interact with respective hospitals that are self-registered on our application. Users will get to access a spate of services that these hospitals provide. Hospitals can easily update the availability of these services by logging in to their dashboard. The services range from ICU beds availability to the number of vaccines that the hospitals have. Users can easily browse for these services in different cities and hospitals and then book them from the hospital of their choice. This application will also provide its users a prescription section where all the previous prescriptions of the users will be available for future reference.\nHow we built it\nWe have used the following Tech-Stack to build our application:\nFrontend : Angular, Typescript, HTML5, CSS3, Bootstrap\nBackend: Spring boot, Java\nCloud Service Providers: Microsoft Azure, Digital Ocean\nDatabase: Azure MySQL\nHosting Service Provider: Netlify\nChallenges we ran into\nThere were a number of cumbersome challenges that we encountered during building this application. A few of them were: 1) As we used Azure app-service to deploy the backend of our application and Azure MySQL for the database. So while deployment the Maven build for the Spring Boot application was failing due to some unsolicited errors. It took us a great deal of time to figure out the reason for the Build failure. The build failure was primarily due to the limited access of the Azure MySQL database whose configurations were mentioned in the application, Property file of our application. When this access issue was resolved, then build failures were encountered which were due to some wrong configurations in the deploy.yml file, which upon recreation got resolved. 2) We created a service to introduce light and dark visibility modes for different components/pages of our application. Since these components are loosely coupled so we subscribed to the value for light and dark mode from this service, but the nav-bar and self-analysis components were facing some subscription errors which were later resolved by changing the invoking pattern of the function for this service, with some finesse which was required in the .SCSS file. 3) The next challenge was related to capital investment. As we are using Netlify and Azure for deployment purposes, but both of these services provide a limited number of credits, and that too for a stipulated period of time.\nAccomplishments that we're proud of\n1) We are able to provide hospitals and interface forms where they can manage all the services they provide 2) Patients/users are able to filter out the hospitals on the basis of city and services. This will enable them to priorly decide their destination hospital at the time of despair. 3) Our application is extremely responsive and user-friendly thus even the most naive and amateurish person can operate it.\nWhat we learned\nThe application is a stark example of a full-stack project. So we are able to get good hands-on Angular and Spring Boot. It also provided us the innovativeness to think of a highly user-friendly UI. We got a tactile interaction with Azure services which we utilized for deployment purposes. In the end, I just want to conclude this application has really been very insightful for us that brought a lot out from within us.\nWhat's next for Swasthify\nProviding users the option to book a variety of services that the hospitals offer.\nCreating chat forums using web socket. These chat forums can be utilized by the users to interact with each other, and offer all kinds of advice and assistance to each other.\nA prescription catalogue, from where a user can keep track of all his past prescriptions.\nA doctor's clinic where a user can consult any registered doctor from across the country.", "link": "https://devpost.com/software/swasthify-mspi5l", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nthis pandemic has literally brought everyone on their knees, the despair and despondency that shrouded the country during covid gave us the motive to calibrate technology and help people out of these unprecedented times. team swasthify tries to provide its users with a service-based distinction of our partner hospitals from all across the country. what really keeps us going is a belief that one day we will make the notion of \"hospitals at your fingertips\" true.\nwhat it does\nswasthify aims at mitigating the hardships people faced during this pandemic. we provide an interactive user interface where a user can directly interact with respective hospitals that are self-registered on our application. users will get to access a spate of services that these hospitals provide. hospitals can easily update the availability of these services by logging in to their dashboard. the services range from icu -----> beds !!!  availability to the number of vaccines that the hospitals have. users can easily browse for these services in different cities and hospitals and then book them from the hospital of their choice. this application will also provide its users a prescription section where all the previous prescriptions of the users will be available for future reference.\nhow we built it\nwe have used the following tech-stack to build our application:\nfrontend : angular, typescript, html5, css3, bootstrap\nbackend: spring boot, java\ncloud service providers: microsoft azure, digital ocean\ndatabase: azure mysql\nhosting service provider: netlify\nchallenges we ran into\nthere were a number of cumbersome challenges that we encountered during building this application. a few of them were: 1) as we used azure app-service to deploy the backend of our application and azure mysql for the database. so while deployment the maven build for the spring boot application was failing due to some unsolicited errors. it took us a great deal of time to figure out the reason for the build failure. the build failure was primarily due to the limited access of the azure mysql database whose configurations were mentioned in the application, property file of our application. when this access issue was resolved, then build failures were encountered which were due to some wrong configurations in the deploy.yml file, which upon recreation got resolved. 2) we created a service to introduce light and dark visibility modes for different components/pages of our application. since these components are loosely coupled so we subscribed to the value for light and dark mode from this service, but the nav-bar and self-analysis components were facing some subscription errors which were later resolved by changing the invoking pattern of the function for this service, with some finesse which was required in the .scss file. 3) the next challenge was related to capital investment. as we are using netlify and azure for deployment purposes, but both of these services provide a limited number of credits, and that too for a stipulated period of time.\naccomplishments that we're proud of\n1) we are able to provide hospitals and interface forms where they can manage all the services they provide 2) patients/users are able to filter out the hospitals on the basis of city and services. this will enable them to priorly decide their destination hospital at the time of despair. 3) our application is extremely responsive and user-friendly thus even the most naive and amateurish person can operate it.\nwhat we learned\nthe application is a stark example of a full-stack project. so we are able to get good hands-on angular and spring boot. it also provided us the innovativeness to think of a highly user-friendly ui. we got a tactile interaction with azure services which we utilized for deployment purposes. in the end, i just want to conclude this application has really been very insightful for us that brought a lot out from within us.\nwhat's next for swasthify\nproviding users the option to book a variety of services that the hospitals offer.\ncreating chat forums using web socket. these chat forums can be utilized by the users to interact with each other, and offer all kinds of advice and assistance to each other.\na prescription catalogue, from where a user can keep track of all his past prescriptions.\na doctor's clinic where a user can consult any registered doctor from across the country.", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 0, "media": null, "medialink": null, "identifyer": 59506790}, {"Unnamed: 0": 7045, "autor": "MEDI- GO", "date": null, "content": "Inspiration\nHealthcare alludes to the utilization of tremendous measures of gathered information to provide access to knowledge. These experiences are created through logical disciplines to drive reality based dynamics. Healthcare is considered to be one of the major sectors in our everyday life . India is the second most populated country with a major portion of the population, below the poverty line. India ranks 145th among 195 countries in terms of quality and accessibility of healthcare, behind its neighbours like China, Bangladesh, Sri Lanka and Bhutan, according to a Lancet study. There are thousands of people who have to lose their lives because of negligence, delay and lack of proper healthcare facilities.\nProblems addressed\nDue to the constant increase in population, the necessity of modern healthcare measures are also growing rapidly. There are applications and websites available in every sector which we can use in our day to day life. People have to search for hospital beds in times of need and lapse time, due to which thousands of people have to sacrifice their lives. Non-availability of blood in emergency situations and time lapse in searching the bloods banks has also led to many deaths. The scenario of COVID-19 can be considered to represent the need for a proper user-friendly website/application.\nWhat it does\nChecking hospital beds availability 24x7\nTracking the live location of the patient and giving suitable results\nAmbulance booking option available\nReal-time data transfer\nReal-time checking of the list of doctors for a particular hospital\nSuggesting hospitals based on reviews and the availability of doctors and beds\nFilters for government and private hospitals\nShows the availability of blood in blood banks and schedule donation.\nHow we built it\nJavaScript\nNode.js\nSocket.IO\nPostgresql\nBootstrap\nHTML+CSS\nMethodology\nThe combined data from various sources is accumulated and added into their respective categories [hospitals, doctors, blood banks, bed vacancies (general beds, ICU beds and ventilation beds) and ambulance availability]. The processed data is displayed to the user in a clear, organised and concise format. The user can take emergency decision based on the collated data and successfully overcome emergency situations. Ambulances will be ready to deliver services with just a click away. This will reduce the number of lives sacrificed due to delay and help people manage emergency situations without much worries. In addition to that, it will also reduce the tension and panic caused due to unavailability of beds and ambulances and help people reach the appropriate hospital without any lapse of time.\nWhat's next for Medi-Go\nThe aim of this product is can be achieved with strenuous effort. The future work lies in a making a fully functional mobile app in collaboration with organizations that can assist in providing and maintaining real-time data. When launched into a potential market this idea can be useful for millions of people. The validity of data and constantly updating the data are two important factors to be considered and take care of before a large scale implementation.", "link": "https://devpost.com/software/medi-go-2mhvbe", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nhealthcare alludes to the utilization of tremendous measures of gathered information to provide access to knowledge. these experiences are created through logical disciplines to drive reality based dynamics. healthcare is considered to be one of the major sectors in our everyday life . india is the second most populated country with a major portion of the population, below the poverty line. india ranks 145th among 195 countries in terms of quality and accessibility of healthcare, behind its neighbours like china, bangladesh, sri lanka and bhutan, according to a lancet study. there are thousands of people who have to lose their lives because of negligence, delay and lack of proper healthcare facilities.\nproblems addressed\ndue to the constant increase in population, the necessity of modern healthcare measures are also growing rapidly. there are applications and websites available in every sector which we can use in our day to day life. people have to search for hospital -----> beds !!!  in times of need and lapse time, due to which thousands of people have to sacrifice their lives. non-availability of blood in emergency situations and time lapse in searching the bloods banks has also led to many deaths. the scenario of covid-19 can be considered to represent the need for a proper user-friendly website/application.\nwhat it does\nchecking hospital beds availability 24x7\ntracking the live location of the patient and giving suitable results\nambulance booking option available\nreal-time data transfer\nreal-time checking of the list of doctors for a particular hospital\nsuggesting hospitals based on reviews and the availability of doctors and beds\nfilters for government and private hospitals\nshows the availability of blood in blood banks and schedule donation.\nhow we built it\njavascript\nnode.js\nsocket.io\npostgresql\nbootstrap\nhtml+css\nmethodology\nthe combined data from various sources is accumulated and added into their respective categories [hospitals, doctors, blood banks, bed vacancies (general beds, icu beds and ventilation beds) and ambulance availability]. the processed data is displayed to the user in a clear, organised and concise format. the user can take emergency decision based on the collated data and successfully overcome emergency situations. ambulances will be ready to deliver services with just a click away. this will reduce the number of lives sacrificed due to delay and help people manage emergency situations without much worries. in addition to that, it will also reduce the tension and panic caused due to unavailability of beds and ambulances and help people reach the appropriate hospital without any lapse of time.\nwhat's next for medi-go\nthe aim of this product is can be achieved with strenuous effort. the future work lies in a making a fully functional mobile app in collaboration with organizations that can assist in providing and maintaining real-time data. when launched into a potential market this idea can be useful for millions of people. the validity of data and constantly updating the data are two important factors to be considered and take care of before a large scale implementation.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59507045}, {"Unnamed: 0": 7494, "autor": "Vision", "date": null, "content": "Inspiration - Mother Teresa\nWhat it does - Using C19 Predictor and computer aided black fungus we can predict it using Cnn and the bed availability of nearby hospitals can be found using the mobile application\nHow we built it - A mobile application will enable the hospital to update the count of bed availability (with oxygen and without oxygen ). This data will be stored in the Firebase real-time database. On another end, in the second module, the user will get his current location. The nearby hospitals will be indicated on their smartphones. When he views the indication he can receive the real-time data of the respective hospital.\nChallenges we ran into - Collection of datasets for black fungus due to recent occurence\nAccomplishments that we're proud of - We are able to assist nurse and take care of the patient during this pandemic situation\nWhat we learned - We learnt that with ML algorithms we can get more efficiency for the detection.\nWhat's next for Vision - customize it and make available around each and every hospital.", "link": "https://devpost.com/software/vision-q84cvo", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration - mother teresa\nwhat it does - using c19 predictor and computer aided black fungus we can predict it using cnn and the -----> bed !!!  availability of nearby hospitals can be found using the mobile application\nhow we built it - a mobile application will enable the hospital to update the count of -----> bed !!!  availability (with oxygen and without oxygen ). this data will be stored in the firebase real-time database. on another end, in the second module, the user will get his current location. the nearby hospitals will be indicated on their smartphones. when he views the indication he can receive the real-time data of the respective hospital.\nchallenges we ran into - collection of datasets for black fungus due to recent occurence\naccomplishments that we're proud of - we are able to assist nurse and take care of the patient during this pandemic situation\nwhat we learned - we learnt that with ml algorithms we can get more efficiency for the detection.\nwhat's next for vision - customize it and make available around each and every hospital.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59507494}, {"Unnamed: 0": 7555, "autor": "Swasthify", "date": null, "content": "Inspiration\nWhat it does\nSwasthify aims at mitigating the hardships people faced during this pandemic. We provide an interactive user interface where a user can directly interact with respective hospitals that are self-registered on our application. Users will get to access a spate of services that these hospitals provide. Hospitals can easily update the availability of these services by logging in to their dashboard. The services range from ICU beds availability to the number of vaccines that the hospitals have. Users can easily browse for these services in different cities and hospitals and then book them from the hospital of their choice. This application will also provide its users a prescription section where all the previous prescriptions of the users will be available for future reference.\nHow we built it\nTech Stacks\nFrontend : Angular, Typescript, HTML5, CSS3, Bootstrap\nBackend : Spring boot, Java\nCloud Service Providers : Microsoft Azure, Digital Ocean\nDatabase : Azure MySQL\nHosting Service Provider : Netlify\nChallenges we ran into\nThere were a number of cumbersome challenges that we encountered during building this application. Few of them were:\n1) As we used Azure app-service to deploy the backend of our application and Azure MySQL for the database. So while deployment the Maven build for the Spring Boot application was failing due to some unsolicited errors. It took us a great deal of time to figure out the reason for the Build failure. The build failure was primarily due to the limited access of the Azure MySQL database whose configurations were mentioned in the application, Property file of our application. When this access issue was resolved, then build failures were encountered which were due to some wrong configurations in the deploy.yml file, which upon recreation got resolved.\n2) We created a service to introduce light and dark visibility modes for different components/pages of our application. Since these components are loosely coupled so we subscribed to the value for light and dark mode from this service, but the nav-bar and self-analysis components were facing some subscription errors which were later resolved by changing the invoking pattern of the function for this service, with some finesse which was required in the .SCSS file.\n3) The next challenge was related to capital investment. As we are using Netlify and Azure for deployment purposes, but both of these services provide a limited number of credits, and that too for a stipulated period of time.\nAccomplishments that we're proud of\nWhat we learned\nWhat's next for Swasthify", "link": "https://devpost.com/software/swasthify", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "beds", "selectorShort": "bed", "MarkedSent": "inspiration\nwhat it does\nswasthify aims at mitigating the hardships people faced during this pandemic. we provide an interactive user interface where a user can directly interact with respective hospitals that are self-registered on our application. users will get to access a spate of services that these hospitals provide. hospitals can easily update the availability of these services by logging in to their dashboard. the services range from icu -----> beds !!!  availability to the number of vaccines that the hospitals have. users can easily browse for these services in different cities and hospitals and then book them from the hospital of their choice. this application will also provide its users a prescription section where all the previous prescriptions of the users will be available for future reference.\nhow we built it\ntech stacks\nfrontend : angular, typescript, html5, css3, bootstrap\nbackend : spring boot, java\ncloud service providers : microsoft azure, digital ocean\ndatabase : azure mysql\nhosting service provider : netlify\nchallenges we ran into\nthere were a number of cumbersome challenges that we encountered during building this application. few of them were:\n1) as we used azure app-service to deploy the backend of our application and azure mysql for the database. so while deployment the maven build for the spring boot application was failing due to some unsolicited errors. it took us a great deal of time to figure out the reason for the build failure. the build failure was primarily due to the limited access of the azure mysql database whose configurations were mentioned in the application, property file of our application. when this access issue was resolved, then build failures were encountered which were due to some wrong configurations in the deploy.yml file, which upon recreation got resolved.\n2) we created a service to introduce light and dark visibility modes for different components/pages of our application. since these components are loosely coupled so we subscribed to the value for light and dark mode from this service, but the nav-bar and self-analysis components were facing some subscription errors which were later resolved by changing the invoking pattern of the function for this service, with some finesse which was required in the .scss file.\n3) the next challenge was related to capital investment. as we are using netlify and azure for deployment purposes, but both of these services provide a limited number of credits, and that too for a stipulated period of time.\naccomplishments that we're proud of\nwhat we learned\nwhat's next for swasthify", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59507555}, {"Unnamed: 0": 8395, "autor": "Go-Corona-Go", "date": null, "content": "Inspiration\nCovid is like a nighmare for all of us which is still not ended from our lives. So This hack was to help people all over the world to get a way out of it.\nWhat it does\nIt helps people getting daily updates about live cases in their area , state or country , giving them proper instruction about what corona is, what are symptoms of covid19 and what they should do to be safe from it.\nHow we built it\nIts created using HTML, CSS, JAVASCRIPT and some of the official covid19 rest apis to get live data.\nChallenges we ran into\nThe challenge was serving particular data/updates about the place coming from api that user is searching for. It took some efforts in getting used to with the api, but all worked fine at last.\nAccomplishments that we're proud of\nI'm proud of creating such a hack that has potential of providing help against such a worst epidemic.\nWhat we learned\nI learned about how we are actually getting data regularly about covid after learning about these apis.\nWhat's next for Go-Corona-Go\nIt may have some more features that can be added such as providing information about doctors, bed availability in hospitals etc.", "link": "https://devpost.com/software/go-corona-go-8ok6dm", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "inspiration\ncovid is like a nighmare for all of us which is still not ended from our lives. so this hack was to help people all over the world to get a way out of it.\nwhat it does\nit helps people getting daily updates about live cases in their area , state or country , giving them proper instruction about what corona is, what are symptoms of covid19 and what they should do to be safe from it.\nhow we built it\nits created using html, css, javascript and some of the official covid19 rest apis to get live data.\nchallenges we ran into\nthe challenge was serving particular data/updates about the place coming from api that user is searching for. it took some efforts in getting used to with the api, but all worked fine at last.\naccomplishments that we're proud of\ni'm proud of creating such a hack that has potential of providing help against such a worst epidemic.\nwhat we learned\ni learned about how we are actually getting data regularly about covid after learning about these apis.\nwhat's next for go-corona-go\nit may have some more features that can be added such as providing information about doctors, -----> bed !!!  availability in hospitals etc.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59508395}], "name": "bedDevpost"}