{"interestingcomments": [{"Unnamed: 0": 4882, "autor": "অমলিন দেশ (A Clean Country)", "date": null, "content": "Inspiration\nIn a recent study, a total of 400 respondents from 10 zones of Dhaka City Corporation, Bangladesh, were interviewed via a semi-structured questionnaire survey. The results revealed that only 39.0% of respondents had explicit knowledge about environmental pollution. Air pollution was identified by 73.8%, water pollution by 55.2%, and soil pollution by only 6.5% of respondents in their surroundings. Municipal garbage was a significant contributor to these. Around 49.0% of the respondents did not understand the effectiveness of currently conducted environmental programs. According to the World Bank’s What a Waste 2.0 report, the world generates 2.01 billion tonnes of municipal solid waste annually, with at least 33% of that not managed in an environmentally safe manner. If this continues then it will bring catastrophe to nations and mainly to a densely populated country like Bangladesh. The other topics mainly focus on a specific group of people but this topic affects a whole nation and as COVID-19 spreads quickly across the whole of Bangladesh, the increased uses of Personal Protective Equipment (PPE) could lead to secondary environmental catastrophes. Respective authorities must maintain a safe waste disposal system to save the environment and protect public health from impending health threats. Hence, we created such an app that can surely achieve all of the above goals while offering an easy-to-follow experience to the clients. This is the best way to technologically reduce a worldwide problem amidst this pandemic.\nWhat it does\nIt is a simple mobile application that allows us to assure an effective waste management system throughout the country while providing our users with an easy-to-use experience. We feel that this is the most effective technology solution to a serious problem in the middle of a worldwide epidemic. This app will offer the service of collecting up rubbish from a particular address based on its type. Users will vary from those living in modest residential neighborhoods to the country's large industry, which generates tons of garbage every day. The waste will be collected and sent to designated landfills for further sorting. Following the final sorting, reusable and recyclable materials will be placed aside for purchase. The app is designed to support two versions: the client version and the management version. Merchants will sell us their garbage in return for money, and consumers will purchase reusable and recyclable waste from us. Client Version: -Initially, users will be required to sign up and provide all relevant information. -The user will next pick the categories of garbage to be disposed of as well as the date of disposal. -Upon selection, our team will travel to the specified site and collect the waste. Management Version: Only the management panel of the company will have access to this version. This version will contain all the necessary information needed to run the entire process smoothly. The features it will include are: -location wise sorting -amount of each type of waste in stock -amount of waste received at a particular date. -amount of sales in a particular day and buyer information -each day cost, revenue, and profit The clients will be given a different sort of ID than the management personnel. Their id will be numeric, and they will only be able to access the client version. The management's id will be alphabetical and will be pre-programmed into the system using their business email addresses. The garbage purchasers will be contacted by hand, but the whole sales data will be saved in the system. All profit calculations will be carried out automatically. This will allow for faster data processing and saving manhours.\nHow we built it\nWe made a prototype of the mobile app using Figma. Our presentation was made with Canva.\nChallenges we ran into\nAs first-time hackers, we struggled to come up with an idea that was both impactful and feasible. Our team also had to learn how to use Figma for the first time, which proved to be a challenge. Eventually, we created an idea and built an app prototype that we were proud of.\nAccomplishments that we're proud of\nWe are most proud of the fact that we completed our first hackathon and designed our first app prototype.\nWhat we learned\nOur team learned that designing a project is not a one-person job. It took all of us collaborating and working together to make this happen.\nWhat's next for Omolin Desh\nIncluding additional features in the app will enable the buying companies to communicate through the app and not manually. They will be able to view the stock available in each location, place their buy order through the app itself and track their order as it is being delivered to them. Initially launch the app in the main cities of Bangladesh for example. Dhaka, Chittagong, and Sylhet. Soon, once the company rises to a position of profitability, expand the business, and launch the app in other districts of Bangladesh as well. This will be possible once the company has made enough profit needed to fund the new projects.", "link": "https://devpost.com/software/wastesmart", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "protective equipment", "selectorShort": "equipment", "MarkedSent": "inspiration\nin a recent study, a total of 400 respondents from 10 zones of dhaka city corporation, bangladesh, were interviewed via a semi-structured questionnaire survey. the results revealed that only 39.0% of respondents had explicit knowledge about environmental pollution. air pollution was identified by 73.8%, water pollution by 55.2%, and soil pollution by only 6.5% of respondents in their surroundings. municipal garbage was a significant contributor to these. around 49.0% of the respondents did not understand the effectiveness of currently conducted environmental programs. according to the world bank’s what a waste 2.0 report, the world generates 2.01 billion tonnes of municipal solid waste annually, with at least 33% of that not managed in an environmentally safe manner. if this continues then it will bring catastrophe to nations and mainly to a densely populated country like bangladesh. the other topics mainly focus on a specific group of people but this topic affects a whole nation and as covid-19 spreads quickly across the whole of bangladesh, the increased uses of personal -----> protective !!!  -----> equipment !!!  (ppe) could lead to secondary environmental catastrophes. respective authorities must maintain a safe waste disposal system to save the environment and protect public health from impending health threats. hence, we created such an app that can surely achieve all of the above goals while offering an easy-to-follow experience to the clients. this is the best way to technologically reduce a worldwide problem amidst this pandemic.\nwhat it does\nit is a simple mobile application that allows us to assure an effective waste management system throughout the country while providing our users with an easy-to-use experience. we feel that this is the most effective technology solution to a serious problem in the middle of a worldwide epidemic. this app will offer the service of collecting up rubbish from a particular address based on its type. users will vary from those living in modest residential neighborhoods to the country's large industry, which generates tons of garbage every day. the waste will be collected and sent to designated landfills for further sorting. following the final sorting, reusable and recyclable materials will be placed aside for purchase. the app is designed to support two versions: the client version and the management version. merchants will sell us their garbage in return for money, and consumers will purchase reusable and recyclable waste from us. client version: -initially, users will be required to sign up and provide all relevant information. -the user will next pick the categories of garbage to be disposed of as well as the date of disposal. -upon selection, our team will travel to the specified site and collect the waste. management version: only the management panel of the company will have access to this version. this version will contain all the necessary information needed to run the entire process smoothly. the features it will include are: -location wise sorting -amount of each type of waste in stock -amount of waste received at a particular date. -amount of sales in a particular day and buyer information -each day cost, revenue, and profit the clients will be given a different sort of id than the management personnel. their id will be numeric, and they will only be able to access the client version. the management's id will be alphabetical and will be pre-programmed into the system using their business email addresses. the garbage purchasers will be contacted by hand, but the whole sales data will be saved in the system. all profit calculations will be carried out automatically. this will allow for faster data processing and saving manhours.\nhow we built it\nwe made a prototype of the mobile app using figma. our presentation was made with canva.\nchallenges we ran into\nas first-time hackers, we struggled to come up with an idea that was both impactful and feasible. our team also had to learn how to use figma for the first time, which proved to be a challenge. eventually, we created an idea and built an app prototype that we were proud of.\naccomplishments that we're proud of\nwe are most proud of the fact that we completed our first hackathon and designed our first app prototype.\nwhat we learned\nour team learned that designing a project is not a one-person job. it took all of us collaborating and working together to make this happen.\nwhat's next for omolin desh\nincluding additional features in the app will enable the buying companies to communicate through the app and not manually. they will be able to view the stock available in each location, place their buy order through the app itself and track their order as it is being delivered to them. initially launch the app in the main cities of bangladesh for example. dhaka, chittagong, and sylhet. soon, once the company rises to a position of profitability, expand the business, and launch the app in other districts of bangladesh as well. this will be possible once the company has made enough profit needed to fund the new projects.", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": null, "medialink": null, "identifyer": 59504882}, {"Unnamed: 0": 6162, "autor": "Hospital Management", "date": null, "content": "What it does\nThis project is meant to serve as an equipment distribution management system for hospitals during COVID-19, specifically for personnel protective equipment (PPE). The dashboard allows a user to select a hospital and receive information about its ICU usage.\nHow we built it\nThe front-end is a simple react webapp that displays a form for inputting the hospital name. We sourced data from a variety of places- the covid data is from Covid ActNow, but this API requires the fips code for a location to grab county-level data. To match hospitals to fips codes, we coded a Python script to cross-reference a list of hospitals mapped to counties with a list of counties mapped to fips codes, and then sent this data to the ActNow API.\nChallenges we ran into\nOur original goal was to integrate our project with NCR's catalog and order API in order to help manage PPE distribution, but we were unable to reach this part of development by the time deadline.\nAccomplishments that we're proud of\nMost of our team was new to hackathons, so we enjoyed learning together how to use APIs and how to create webapps.\nWhat's next for Hospital Management\nWe plan to continue working on this project to flush out the NCR integration, allowing for inventory management by suppliers. This will involve developing a basic catalog of products, implementing transaction data, building out a full backend system, and determining priority level using metrics other than ICU bed capacity.", "link": "https://devpost.com/software/hospital-management-l7jgq4", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "protective equipment", "selectorShort": "equipment", "MarkedSent": "what it does\nthis project is meant to serve as an -----> equipment !!!  distribution management system for hospitals during covid-19, specifically for personnel -----> protective !!!  -----> equipment !!!  (ppe). the dashboard allows a user to select a hospital and receive information about its icu usage.\nhow we built it\nthe front-end is a simple react webapp that displays a form for inputting the hospital name. we sourced data from a variety of places- the covid data is from covid actnow, but this api requires the fips code for a location to grab county-level data. to match hospitals to fips codes, we coded a python script to cross-reference a list of hospitals mapped to counties with a list of counties mapped to fips codes, and then sent this data to the actnow api.\nchallenges we ran into\nour original goal was to integrate our project with ncr's catalog and order api in order to help manage ppe distribution, but we were unable to reach this part of development by the time deadline.\naccomplishments that we're proud of\nmost of our team was new to hackathons, so we enjoyed learning together how to use apis and how to create webapps.\nwhat's next for hospital management\nwe plan to continue working on this project to flush out the ncr integration, allowing for inventory management by suppliers. this will involve developing a basic catalog of products, implementing transaction data, building out a full backend system, and determining priority level using metrics other than icu bed capacity.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59506162}], "name": "equipmentDevpost"}