{"interestingcomments": [{"Unnamed: 0": 1243, "autor": "PikaPlace PokeDex", "date": null, "content": "Inspiration\nGameFi Business Motivation: Accelerated by the 2020 pandemic and stay-at-home orders, the video game industry generated more than $155B in revenue with $54B of this was spent on additional in-game assets like NFTs. Currently over 3.1 billion people worldwide play video games. Coupled with the Defi markets at $100 billion in total locked value, play-to-earn games like Axie Infinity with record market caps in the $10 billion dollar range, the business demand for blockchain games in the metaverse will only go up.\nSocial Good Play to Earn Motivation: Research from the World Bank sets international poverty rates to be at $1.90/day accelerated by the Covid19 stay-at-home restrictions, and the resulting recession. In places like the Vietnam or Phillipines, people playing Axis Infinity were able to earn a few hundred dollars in a month, which is multiple times the minimum wage. This can help alleviate poverty and hunger. Censorship in developing nations can lead to capital controls, poor governance, and corruption costing the global economy $3.6 trillion dollars every year. This creates a high barrier to entry for the public. Especially in places like Africa, Asia, or South America where women have more difficulty opening bank accounts, loan applications, and insurance. Some people do not have access to a banks, do not like using banks, or pass credit checks from KYC regulations.\nBridge the gap between technology and the real world with PikaPlace. Welcome to the dark metaverse. Our play-to-earn model allow Pokemon trainers to collect real-life cryptocurrency and NFTs that can be sold on an NFT marketplace.In our metaverse, gamers experience a generative simulations game with a fully open decentralized convergence of virtually and physical reality. Despite centralized gamers spending 1000s of hours for a purple dragons in WOW or transferring real money for virtual skins on Fortnite, they have no extrinsic real world value. PikaPlace solves this problem where players can buy in-game assets for Pokemon as NFTs or win lucky assets by placing verifiably random bets in Pokemons battles providing real-world value to anyone interested in social gaming. Monopolys like Facebook, Nintendo, or Blizzard hold a lot of influence - own, manage, and control game data in the metaverse. Why should gamers give up their freedom to control what they earned and paid for?\nWhat it does\nGame StoryLine: \"At the beginning of time and space, there was nothing but a genesis egg that evolves with anti-matter. Humans & Pokemons roamed Planet PikaPlace but the Kalos War broke out... Pokemons turned against the scientists. Professor Oak created a wormhole in the path of an incoming meteorite generating mutant anti-matter Pokemons trained on a dataset of 800 Pokemons. Genesis Pokemons created by A.I. with a DC GAN model will be minted as NFTs. Only 10,000 of these will ever be minted through staking during our Pikaplace Genesis Event creating scarcity. a.i. genesis. A new generation of pokemons were born.\"\nHow it works PikaPlace rewards gamers in the form of staking, farming $PIKA currency, or generating tradeable NFT items. By playing the game regularly, each player can earn more items or tokens to sell and generate an income. To cash out, trainers will need to deposit NFTs or crypto to an NFT marketplace or exchange like ETH/BSC/HECO. This allows any player to turn a profit with gamechanging blockchain technology.\nTrainers start with a one-of-a-kind pokemon created by an unsupervised learning DC GAN model. This creates scarcity creating endless possibilities of Pokemon-like characters (compared to the 753 in centralized Pokemon). PikaPlace's crypto collectible NFTs each has different traits that makes them non duplicatable.\nBlockchain was used to connect the A.I. generated game agents and data to verifiable smart contracts. Game enables players to improve weapons, attack and defense skills, enhance power, and exchange characters and weapons on a marketplace. The history of every in-game asset can be stored on a ledger as player levels up their Pokemon.\nGives gamers a sense of control to resell their pokemons as NFTs creating an in-game digital economy with $PIKA. PikaPlace allows players to have complete ownership over their NFTs. Users may search for characters and items listed by other players on the platforms’ marketplace promoting trade.\nHow we built it\nConnect non-custodial MetaMask wallet to Dapp. Add custom in-game token $PIKA. Users must hold a min of 1 $PIKA in account to play. Use wallet address to buy PikaPlace NFT with VRF randomized skills for $20. (Pokemons will live in your wallet as NFT tokens). Login to PokeDEX with metamask to sync Pokemon to wallet. Start playing storyline or fighting mode to level up and earn $PIKA wth Chainlink Oracles and VRFs for verifiable randomness.\nHigh gas fees and carbon footprints for gaming on Ethereum caused by large demands for transaction bandwidth is high, while the supply remains constant. Therefore PikaPlace uses alternatives like Binance Smart Chain, UFO, or Huobi's HECO (HECO/gETH ~= 150%) with trading on DEX, Yield Farming, Staking, borrow, lending, earning, and many more. Crypto collectibles for Heco with higher asset security, low gas fees (5% cheaper than ETH), and higher performance with HT, HRC-20, and HRC-721 and addresses generated on HECO chain.\nUses a two token system with 100,000,000 BSC game tokens ($PIKA) in circulation and PokeDEX exchange. $PIKA will be the game governance token. Gamers must hold a minimum of 1 $PIKA in their account to participate in PikaPlace by adding the custom in-game currency $PIKA. Buy in-game maps, skins, or land for gyms. Holders of $PIKA tokens may also bet or gamble their $PIKA to increase their earnings. $UFO will serve as the 2nd token in PikaPlace's two token system. Gamers need to convert fiat dollars (USD) to pay for gas. They withdraw $PIKA to $BSC, $ETH, or $UFO address through a DEX exchange. This allows players to make real money rewarding players for completing game tasks and incentivizing gameplay.\nMoralis Backend Game secured by Moralis from hackers, exploits, and counterparty fraud.which loggs (x,y) game states and uses a consensus mechanism to track modifications. Anyone can examine the ledger to see names of all the trainers who ever trained a Pokemon and what battles they won as Pokemons get passed down from trainer to trainer. Zero-knowledge proofs can verify a gamer's pseudo gamertag and their personal identities. Ex: \"I was the Rank #1 leader of the most successful Pokemon gym in Pikeplace.\"\nChallenges we ran into\nWorking on the DEX swap with the two game tokens - $UFO will serve as the 2nd token in PikaPlace's two token system. Gamers need to convert fiat dollars (USD) to pay for gas. They withdraw $PIKA to $BSC, $ETH, or $UFO address through a DEX exchange. This allows players to make real money rewarding players for completing game tasks and incentivizing gameplay.\nAccomplishments that we're proud of\nPikaPlace rewards gamers in the form of staking, farming $PIKA currency, or generating tradeable NFT items. By playing the game regularly, each player can earn more items or tokens to sell and generate an income. To cash out, trainers will need to deposit NFTs or crypto to an NFT marketplace or exchange like ETH/BSC/HECO. This allows any player to turn a profit with gamechanging blockchain technology.\nBlockchain game assets are stored on Moralis, Filecoin, and IPFS protocols for storing and sharing data in the distributed web with data representation formats (IPLD) and network communication protocols (libp2p) like https://bafybeiefeiqf6zy36z3rgi7d7lzjobi7sxv76ruodkuuk25nthugkwfa7a.ipfs.dweb.link/\nWhat we learned\nGameFi Market exploding with play-to-earn games like Axie Infinity with record market caps in the $10 billion dollar range\nUsing Chainlink VRFs for holders of $PIKA tokens may also bet or gamble their $PIKA to increase their earnings.\nWhat's next for PikaPlace PokeDex\nRelease Early Access Beta MVP\nBreeding & Trainer Ratings Features\nIn-Game Quests & Tournaments Features\nCross-chain BSC/UFO Integration\nRelease Whitepaper\nDeploy PikePlace to MainNet", "link": "https://devpost.com/software/pikaplace-pokedex", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "farming", "selectorShort": "farm", "MarkedSent": "inspiration\ngamefi business motivation: accelerated by the 2020 pandemic and stay-at-home orders, the video game industry generated more than $155b in revenue with $54b of this was spent on additional in-game assets like nfts. currently over 3.1 billion people worldwide play video games. coupled with the defi markets at $100 billion in total locked value, play-to-earn games like axie infinity with record market caps in the $10 billion dollar range, the business demand for blockchain games in the metaverse will only go up.\nsocial good play to earn motivation: research from the world bank sets international poverty rates to be at $1.90/day accelerated by the covid19 stay-at-home restrictions, and the resulting recession. in places like the vietnam or phillipines, people playing axis infinity were able to earn a few hundred dollars in a month, which is multiple times the minimum wage. this can help alleviate poverty and hunger. censorship in developing nations can lead to capital controls, poor governance, and corruption costing the global economy $3.6 trillion dollars every year. this creates a high barrier to entry for the public. especially in places like africa, asia, or south america where women have more difficulty opening bank accounts, loan applications, and insurance. some people do not have access to a banks, do not like using banks, or pass credit checks from kyc regulations.\nbridge the gap between technology and the real world with pikaplace. welcome to the dark metaverse. our play-to-earn model allow pokemon trainers to collect real-life cryptocurrency and nfts that can be sold on an nft marketplace.in our metaverse, gamers experience a generative simulations game with a fully open decentralized convergence of virtually and physical reality. despite centralized gamers spending 1000s of hours for a purple dragons in wow or transferring real money for virtual skins on fortnite, they have no extrinsic real world value. pikaplace solves this problem where players can buy in-game assets for pokemon as nfts or win lucky assets by placing verifiably random bets in pokemons battles providing real-world value to anyone interested in social gaming. monopolys like facebook, nintendo, or blizzard hold a lot of influence - own, manage, and control game data in the metaverse. why should gamers give up their freedom to control what they earned and paid for?\nwhat it does\ngame storyline: \"at the beginning of time and space, there was nothing but a genesis egg that evolves with anti-matter. humans & pokemons roamed planet pikaplace but the kalos war broke out... pokemons turned against the scientists. professor oak created a wormhole in the path of an incoming meteorite generating mutant anti-matter pokemons trained on a dataset of 800 pokemons. genesis pokemons created by a.i. with a dc gan model will be minted as nfts. only 10,000 of these will ever be minted through staking during our pikaplace genesis event creating scarcity. a.i. genesis. a new generation of pokemons were born.\"\nhow it works pikaplace rewards gamers in the form of staking, -----> farming !!!  $pika currency, or generating tradeable nft items. by playing the game regularly, each player can earn more items or tokens to sell and generate an income. to cash out, trainers will need to deposit nfts or crypto to an nft marketplace or exchange like eth/bsc/heco. this allows any player to turn a profit with gamechanging blockchain technology.\ntrainers start with a one-of-a-kind pokemon created by an unsupervised learning dc gan model. this creates scarcity creating endless possibilities of pokemon-like characters (compared to the 753 in centralized pokemon). pikaplace's crypto collectible nfts each has different traits that makes them non duplicatable.\nblockchain was used to connect the a.i. generated game agents and data to verifiable smart contracts. game enables players to improve weapons, attack and defense skills, enhance power, and exchange characters and weapons on a marketplace. the history of every in-game asset can be stored on a ledger as player levels up their pokemon.\ngives gamers a sense of control to resell their pokemons as nfts creating an in-game digital economy with $pika. pikaplace allows players to have complete ownership over their nfts. users may search for characters and items listed by other players on the platforms’ marketplace promoting trade.\nhow we built it\nconnect non-custodial metamask wallet to dapp. add custom in-game token $pika. users must hold a min of 1 $pika in account to play. use wallet address to buy pikaplace nft with vrf randomized skills for $20. (pokemons will live in your wallet as nft tokens). login to pokedex with metamask to sync pokemon to wallet. start playing storyline or fighting mode to level up and earn $pika wth chainlink oracles and vrfs for verifiable randomness.\nhigh gas fees and carbon footprints for gaming on ethereum caused by large demands for transaction bandwidth is high, while the supply remains constant. therefore pikaplace uses alternatives like binance smart chain, ufo, or huobi's heco (heco/geth ~= 150%) with trading on dex, yield farming, staking, borrow, lending, earning, and many more. crypto collectibles for heco with higher asset security, low gas fees (5% cheaper than eth), and higher performance with ht, hrc-20, and hrc-721 and addresses generated on heco chain.\nuses a two token system with 100,000,000 bsc game tokens ($pika) in circulation and pokedex exchange. $pika will be the game governance token. gamers must hold a minimum of 1 $pika in their account to participate in pikaplace by adding the custom in-game currency $pika. buy in-game maps, skins, or land for gyms. holders of $pika tokens may also bet or gamble their $pika to increase their earnings. $ufo will serve as the 2nd token in pikaplace's two token system. gamers need to convert fiat dollars (usd) to pay for gas. they withdraw $pika to $bsc, $eth, or $ufo address through a dex exchange. this allows players to make real money rewarding players for completing game tasks and incentivizing gameplay.\nmoralis backend game secured by moralis from hackers, exploits, and counterparty fraud.which loggs (x,y) game states and uses a consensus mechanism to track modifications. anyone can examine the ledger to see names of all the trainers who ever trained a pokemon and what battles they won as pokemons get passed down from trainer to trainer. zero-knowledge proofs can verify a gamer's pseudo gamertag and their personal identities. ex: \"i was the rank #1 leader of the most successful pokemon gym in pikeplace.\"\nchallenges we ran into\nworking on the dex swap with the two game tokens - $ufo will serve as the 2nd token in pikaplace's two token system. gamers need to convert fiat dollars (usd) to pay for gas. they withdraw $pika to $bsc, $eth, or $ufo address through a dex exchange. this allows players to make real money rewarding players for completing game tasks and incentivizing gameplay.\naccomplishments that we're proud of\npikaplace rewards gamers in the form of staking, farming $pika currency, or generating tradeable nft items. by playing the game regularly, each player can earn more items or tokens to sell and generate an income. to cash out, trainers will need to deposit nfts or crypto to an nft marketplace or exchange like eth/bsc/heco. this allows any player to turn a profit with gamechanging blockchain technology.\nblockchain game assets are stored on moralis, filecoin, and ipfs protocols for storing and sharing data in the distributed web with data representation formats (ipld) and network communication protocols (libp2p) like https://bafybeiefeiqf6zy36z3rgi7d7lzjobi7sxv76ruodkuuk25nthugkwfa7a.ipfs.dweb.link/\nwhat we learned\ngamefi market exploding with play-to-earn games like axie infinity with record market caps in the $10 billion dollar range\nusing chainlink vrfs for holders of $pika tokens may also bet or gamble their $pika to increase their earnings.\nwhat's next for pikaplace pokedex\nrelease early access beta mvp\nbreeding & trainer ratings features\nin-game quests & tournaments features\ncross-chain bsc/ufo integration\nrelease whitepaper\ndeploy pikeplace to mainnet", "sortedWord": "None", "removed": "Nan", "score": 8, "comments": 2, "media": null, "medialink": null, "identifyer": 59501243}, {"Unnamed: 0": 1312, "autor": "GETO Wallet - Cash in Cash out", "date": null, "content": "Inspiration We had finished forking Binance Smart Chain to power our remittance, micropayments and NFT multimedia after Bitcoin and Ethereum Blockchain networks had became too expensive for our users in the remittance app mimi due to high gas fees when we came across Celo blockchain that was providing for most our use-cases such as low gas fees, gas fees payable in several tokens, phone number mapping on address and community funding.\nWe are now developing and implementing decentralised finance, multimedia NFTs, domains and IPFS on Celo blockchain for African use-cases.\nWhat it does GETO Wallet bridges the African nations currencies and their pegged stables coins on Celo Blockchain, helps users cash in and out of Celo, cUSD and cEUR on the Celo Blockchain in a self service mobile app as well as into and out of African Decentralised Finance use-cases on Celo Blockchain. Yield farming African Stable coins of national currencies to incentivise Africans to adopt Decentralised Finance.\nPublic Testnet on Celo ALFAJORES URL --> https://testnet-wallet.geto.finance\nYoutube Demo video URL --> https://youtu.be/QfErmGXey2Y\nWhat's next for GETO Wallet - Cash in Cash out Upon raising required capital liquidity, we will be deploying GETO Wallet on Celo mainnet Blockchain for general public use.", "link": "https://devpost.com/software/geto-wallet-cash-in-cash-out", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "farming", "selectorShort": "farm", "MarkedSent": "inspiration we had finished forking binance smart chain to power our remittance, micropayments and nft multimedia after bitcoin and ethereum blockchain networks had became too expensive for our users in the remittance app mimi due to high gas fees when we came across celo blockchain that was providing for most our use-cases such as low gas fees, gas fees payable in several tokens, phone number mapping on address and community funding.\nwe are now developing and implementing decentralised finance, multimedia nfts, domains and ipfs on celo blockchain for african use-cases.\nwhat it does geto wallet bridges the african nations currencies and their pegged stables coins on celo blockchain, helps users cash in and out of celo, cusd and ceur on the celo blockchain in a self service mobile app as well as into and out of african decentralised finance use-cases on celo blockchain. yield -----> farming !!!  african stable coins of national currencies to incentivise africans to adopt decentralised finance.\npublic testnet on celo alfajores url --> https://testnet-wallet.geto.finance\nyoutube demo video url --> https://youtu.be/qfermgxey2y\nwhat's next for geto wallet - cash in cash out upon raising required capital liquidity, we will be deploying geto wallet on celo mainnet blockchain for general public use.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59501312}, {"Unnamed: 0": 1517, "autor": "GETO DeFi", "date": null, "content": "Inspiration\nWe had finished forking Binance Smart Chain to power our remittance, micropayments and NFT multimedia after Bitcoin and Ethereum Blockchain networks had became too expensive for our users in the remittance app mimi due to high gas fees when we came across Celo blockchain that was providing for most our use-cases such as low gas fees, gas fees payable in several tokens, phone number mapping on address and community funding.\nWe are now developing and implementing decentralised finance, multimedia NFTs, domains and IPFS on Celo blockchain for African use-cases.\nWhat it does\nAfrican Decentralised Finance use-cases on Celo Blockchain. Yield farming African Stable coins of national currencies to incentivise Africans to adopt Decentralised Finance (DeFi).\nPublic Testnet on Celo ALFAJORES URL --> https://testnet-app.geto.finance\nYoutube Demo video URL --> https://youtu.be/6veWO07idjQ\nWhat's next for GETO DeFi\nUpon the end of the Hackathon, we will be deploying GETO DeFi on Celo mainnet Blockchain for general public use.", "link": "https://devpost.com/software/geto-defi", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "farming", "selectorShort": "farm", "MarkedSent": "inspiration\nwe had finished forking binance smart chain to power our remittance, micropayments and nft multimedia after bitcoin and ethereum blockchain networks had became too expensive for our users in the remittance app mimi due to high gas fees when we came across celo blockchain that was providing for most our use-cases such as low gas fees, gas fees payable in several tokens, phone number mapping on address and community funding.\nwe are now developing and implementing decentralised finance, multimedia nfts, domains and ipfs on celo blockchain for african use-cases.\nwhat it does\nafrican decentralised finance use-cases on celo blockchain. yield -----> farming !!!  african stable coins of national currencies to incentivise africans to adopt decentralised finance (defi).\npublic testnet on celo alfajores url --> https://testnet-app.geto.finance\nyoutube demo video url --> https://youtu.be/6vewo07idjq\nwhat's next for geto defi\nupon the end of the hackathon, we will be deploying geto defi on celo mainnet blockchain for general public use.", "sortedWord": "None", "removed": "Nan", "score": 9, "comments": 0, "media": null, "medialink": null, "identifyer": 59501517}], "name": "farmDevpost"}