{"interestingcomments": [{"Unnamed: 0": 7015, "autor": "Wooden Chef - WOODEN PARABOLIC MOTORIZED SOLAR COOKER", "date": null, "content": "Amidst the pandemic prevailing today, we were all cooped up at our homes leading a very monotonous life. Suddenly, something came our way that kind of had us brushed up with all our emerging ideologies. As forestry students, we were a bit more magnetized towards this very attention deserving topic \"Solar Cooker\". Once we visited Solar Seasoning Kiln, it is used for wood seasoning (Removal of moisture content from wood). The kiln works with the principle of green house effect, which produce an enormous amount of heat which is more than enough to cook. This inspired us for making wooden chef. We thought of incorporating wood in solar cooker as the heat loss is merge when compared to metal surface. Favourably in Tropical countries, Sunlight is a readily available service, hence utilizing the solar energy to meet all our demands in a efficient way has to be taken into consideration. With all the raising global demands, all the fuels are at a diminishing rate. Hence as can alternative, Solar energy can be a very flexible solution especially for working. Our Primary motive is to bring an awareness in harnessing this abundantly available solar energy among the rural people. Solar energy is also an affordable remedy to the emerging issue on energy crisis. We confronted a lot of challenges while working on our project in grading up the efficiency such that it serves out to be a sustainable alternative to all classes of people.\n_", "link": "https://devpost.com/software/wooden-chef-wooden-parabolic-motorized-solar-cooker", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "forestry", "selectorShort": "forestry", "MarkedSent": "amidst the pandemic prevailing today, we were all cooped up at our homes leading a very monotonous life. suddenly, something came our way that kind of had us brushed up with all our emerging ideologies. as -----> forestry !!!  students, we were a bit more magnetized towards this very attention deserving topic \"solar cooker\". once we visited solar seasoning kiln, it is used for wood seasoning (removal of moisture content from wood). the kiln works with the principle of green house effect, which produce an enormous amount of heat which is more than enough to cook. this inspired us for making wooden chef. we thought of incorporating wood in solar cooker as the heat loss is merge when compared to metal surface. favourably in tropical countries, sunlight is a readily available service, hence utilizing the solar energy to meet all our demands in a efficient way has to be taken into consideration. with all the raising global demands, all the fuels are at a diminishing rate. hence as can alternative, solar energy can be a very flexible solution especially for working. our primary motive is to bring an awareness in harnessing this abundantly available solar energy among the rural people. solar energy is also an affordable remedy to the emerging issue on energy crisis. we confronted a lot of challenges while working on our project in grading up the efficiency such that it serves out to be a sustainable alternative to all classes of people.\n_", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59507015}], "name": "forestryDevpost"}