{"interestingcomments": [{"Unnamed: 0": 3680, "autor": "HEXAREIGN | Low Poly NFTs", "date": null, "content": "Premise\nWe often talk about digital land in the crypto space, but land can be taken. The game is simple. There are 4600+ tile NFTs on the Hexareign map, and your goal is to gain as much land as you can.\nOr not, it's up to the community to decide what winning really is.\nWhat can you do in Hexareign?\nThe game is simple by design. There is no need for complicated rules in a passive game, after all.\nEvery tile generates HEXR tokens, the game currency, as long as its level is over 0. You can forcibly colonize any non-core tile adjacent to one you own with HEXR tokens, regardless of the owner. The current owner of that tile will receive 90% of the HEXR funds used to forcibly colonize that tile.\nIf you own a tile, you can upgrade it. This costs HEXR, but will increase the amount of HEXR that the tile generates while also increasing the amount that the tile costs to be forcibly colonized.\nHarvesting the tokens on a tile that you own will put the tiles that you are owed into your wallet. Upgrading or colonizing a tile will automatically harvest the tokens.\nMultichain?\nHexareign will be added to multiple chains, but OkExChain is among the first. We want as many users to have access to the game as possible, and we think that users in crowded maps will want to play in blockchains with less players. This will ultimately help OkExChain as well as other EVMs. It's not a zero-sum game, after all!\nChallenges\nThere were some issues with getting OkExChain to work with the Unity SDK that I was using. I campaigned to make the SDK usable with as many EVMs as possible, which is why I'm able to show off this project now. Thanks to the efforts of the chainsafe team, the Unity chainsafe gaming SDK is now completely compatible with OkExChain, given someone deploys a multicall contract.\nAnother challenge was using a completely decentralized solution for hosting. As cool as it sounds, it isn't always reliable. You may find that the Hexareign website is sometimes down.\nCurrent Status & Use of Funds\nWhile I have already purchased some OKT, I found that it was a little too expensive to deploy to the Mainnet. OkExChain's gains are good for the hodlers, but not for me as a developer! I hope to gain funding so that I can take the game out of the testnet and into the OkExChain Mainnet. I estimate that it will take around 8 OKT to deploy completely, if the testnet is to be trusted.\nIf Hexareign wins a large prize from OkExChain, I will use the funds to do the following:\nPay for an audit of the smart contracts.\nDeploy to the OkExChain Mainnet.\nEmploy talented artists to beautify the world & bring the improvement update to fruition.\nLong Term Plans?\nYes, Hexareign could become a long term project, but that's really up to the degree at which we can build up a community. The improvement update is most critical, since it allows for regular content from the developers to be given to the players.\nIf desired, more complex gameplay can be added by creating new game modes, where users may not require tiles to play, and could instead take on roles such as farmers or artisans.\nWith enough blockchain integrations, even a blockchain vs blockchain DAO based Hexareign game could be made. There is no bound to creativity, only bounds to how funded and how popular the game is. We hope that OkExChain and others will support the project to ensure that this happens.\nDeployed Contracts\nHere are some of the relevant smart contracts that have been deployed on the Testnet:\nHEXR Token: 0x680794D49F13A9e84C5713ddc1326Da90c4182f1\nTile NFT: 0xd3a97C249AaDBD9cd9173414b8E321c45ad08D6c\nGame Data: 0x122202e32182291Ba3b5f56d88E3403E0AB81A93\nGame Logic: 0xAfe9828f407C759e996CdA195DB62De2de357eA0\nTile Sale: 0x81C7c3a555dc31bb4609401FEA57a927F37A271d\nToken\nI must be clear that the token is for a game, and should not be treated like an investment. Otherwise the SEC would have jurisdiction over Hexareign. That being said, I will still talk about how the token is controlled:\nThe creator account is granted 10M HEXR to be used for giveaways & funding.\nThere are 4 slots for games, each with 1B HEXR to allocate. There is a 6 month waiting period before 1B HEXR can be allocated again.\nThis is to make it so that more maps can be made on the same chain, or even potentially new game modes.\n1B HEXR is currently locked inside of the game data contract, and is where HEXR from harvesting comes from.\nWhat's next for HEXAREIGN | Low Poly NFTs\nThe next few updates will address any bugs seen. Once that has been finished, and depending on how well received the game is in these hackathons, an airdrop will be organized!\nThe next major update will also allow users to purchase improvement NFTs, that will strategically change the stats of your tiles based on their height, biome, and landforms. This will add greater depth and personalization to the game. But be careful, someone may take the tiles that you spent improving!", "link": "https://devpost.com/software/hexareign-low-poly-nfts-lodc5g", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "harvesting", "selectorShort": "harvest", "MarkedSent": "premise\nwe often talk about digital land in the crypto space, but land can be taken. the game is simple. there are 4600+ tile nfts on the hexareign map, and your goal is to gain as much land as you can.\nor not, it's up to the community to decide what winning really is.\nwhat can you do in hexareign?\nthe game is simple by design. there is no need for complicated rules in a passive game, after all.\nevery tile generates hexr tokens, the game currency, as long as its level is over 0. you can forcibly colonize any non-core tile adjacent to one you own with hexr tokens, regardless of the owner. the current owner of that tile will receive 90% of the hexr funds used to forcibly colonize that tile.\nif you own a tile, you can upgrade it. this costs hexr, but will increase the amount of hexr that the tile generates while also increasing the amount that the tile costs to be forcibly colonized.\n-----> harvesting !!!  the tokens on a tile that you own will put the tiles that you are owed into your wallet. upgrading or colonizing a tile will automatically harvest the tokens.\nmultichain?\nhexareign will be added to multiple chains, but okexchain is among the first. we want as many users to have access to the game as possible, and we think that users in crowded maps will want to play in blockchains with less players. this will ultimately help okexchain as well as other evms. it's not a zero-sum game, after all!\nchallenges\nthere were some issues with getting okexchain to work with the unity sdk that i was using. i campaigned to make the sdk usable with as many evms as possible, which is why i'm able to show off this project now. thanks to the efforts of the chainsafe team, the unity chainsafe gaming sdk is now completely compatible with okexchain, given someone deploys a multicall contract.\nanother challenge was using a completely decentralized solution for hosting. as cool as it sounds, it isn't always reliable. you may find that the hexareign website is sometimes down.\ncurrent status & use of funds\nwhile i have already purchased some okt, i found that it was a little too expensive to deploy to the mainnet. okexchain's gains are good for the hodlers, but not for me as a developer! i hope to gain funding so that i can take the game out of the testnet and into the okexchain mainnet. i estimate that it will take around 8 okt to deploy completely, if the testnet is to be trusted.\nif hexareign wins a large prize from okexchain, i will use the funds to do the following:\npay for an audit of the smart contracts.\ndeploy to the okexchain mainnet.\nemploy talented artists to beautify the world & bring the improvement update to fruition.\nlong term plans?\nyes, hexareign could become a long term project, but that's really up to the degree at which we can build up a community. the improvement update is most critical, since it allows for regular content from the developers to be given to the players.\nif desired, more complex gameplay can be added by creating new game modes, where users may not require tiles to play, and could instead take on roles such as farmers or artisans.\nwith enough blockchain integrations, even a blockchain vs blockchain dao based hexareign game could be made. there is no bound to creativity, only bounds to how funded and how popular the game is. we hope that okexchain and others will support the project to ensure that this happens.\ndeployed contracts\nhere are some of the relevant smart contracts that have been deployed on the testnet:\nhexr token: 0x680794d49f13a9e84c5713ddc1326da90c4182f1\ntile nft: 0xd3a97c249aadbd9cd9173414b8e321c45ad08d6c\ngame data: 0x122202e32182291ba3b5f56d88e3403e0ab81a93\ngame logic: 0xafe9828f407c759e996cda195db62de2de357ea0\ntile sale: 0x81c7c3a555dc31bb4609401fea57a927f37a271d\ntoken\ni must be clear that the token is for a game, and should not be treated like an investment. otherwise the sec would have jurisdiction over hexareign. that being said, i will still talk about how the token is controlled:\nthe creator account is granted 10m hexr to be used for giveaways & funding.\nthere are 4 slots for games, each with 1b hexr to allocate. there is a 6 month waiting period before 1b hexr can be allocated again.\nthis is to make it so that more maps can be made on the same chain, or even potentially new game modes.\n1b hexr is currently locked inside of the game data contract, and is where hexr from harvesting comes from.\nwhat's next for hexareign | low poly nfts\nthe next few updates will address any bugs seen. once that has been finished, and depending on how well received the game is in these hackathons, an airdrop will be organized!\nthe next major update will also allow users to purchase improvement nfts, that will strategically change the stats of your tiles based on their height, biome, and landforms. this will add greater depth and personalization to the game. but be careful, someone may take the tiles that you spent improving!", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 1, "media": null, "medialink": null, "identifyer": 59503680}, {"Unnamed: 0": 6122, "autor": "Stock Price Comparison Project", "date": null, "content": "Inspiration\nStock market prediction aims to determine the future movement of the stock value of a financial exchange. The accurate prediction of share price movement will lead to more profit investors can make. This automation extract precise data from the website time to time for future prediction.\nWhat it does\nA robot which extracts and displays the stock details from the Stock website online and build a graph for the comparison with the historical data and stores historical data in the data service.\nHow we built it\nStep 1: Designed Uipath Apps Screen. Below screenshot for the reference. Step 2: Created a process “Process name” which pulls stock names for the dropdown from the config file. Step 3: Bind uipath app dropdown to the “Process name” .Which triggers on click of the dropdown and pulls the stock names from the config file. Step 4: Create a data service with below fields Fields name Step 5: Created a process “Process name” which has multiple states. Once we get input parameter “search stock” from the App, The process will open the browser and does data scrapping for that input (“search stock”). Extracts current price, open trends and 1 week data. Step 6: The 1 week data which is extracted in step 5 will be stored in the data service “DS Name” Step 7: The above process “Process name” will extract data from “DS name” and convert it into chart using excel. On click of the button “Five days data” It will display the chart. Step 8: Create a data service with below fields Step 9: Created a process: “Process name” which scrapes NSE website and store data in Data service 2 “DS name” Configured a trigger with above process “process name” which runs every hour and stores every hour data in the data service. Step 10: The above process “Process name” will extract data from “DS name” and convert it into chart using excel. On click of the button “Five weeks data” It will display the chart. Step 11: The trigger has been set to erase days every 2 weeks. Trigger is configured with the process “process name” which has code to delete data from the data service base on the todays date.\nChallenges we ran into\nWe faced problem while working on the data service and but again watching various tutorials on youtube helped us to build this project\nAccomplishments that we're proud of\nOur bot Scrapes the user entered stock data in less than a minute. Allows multiple stocks at a time Absolutely no data loss . The historical data analysis WILL LEAD TO BETTER Stock TRADE prediction Preserves the trader's discipline, the data will be accurate consistent and precise Surveying and harvesting the data can be exhausting for humans to complete, but robots can perform these tasks easily. Automatic extraction and generation of five hours chart, generation of five days chart , auto storing of data to data service and updating it every thing is done in less than a few mins.\nWhat we learned\nExploration and learning . Know your customer and know the objectives of the project at hand Time management Team work is important When things go wrong, as they invariably will; excuses will not work. Find an alternative course of action or remedial propositions instead Documentation are necessary for reporting purposes Good communication is that which will stop mistakes from becoming failures. Careful thought needs to be given to the circumstances at hand prior to engaging in decision making.\nWhat's next for Stock Price Comparison Project\nWould like to introduce APIs, So that data scrapping can be run in the background and it also reduce the time of execution.", "link": "https://devpost.com/software/stock-price-comparison-project", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "harvesting", "selectorShort": "harvest", "MarkedSent": "inspiration\nstock market prediction aims to determine the future movement of the stock value of a financial exchange. the accurate prediction of share price movement will lead to more profit investors can make. this automation extract precise data from the website time to time for future prediction.\nwhat it does\na robot which extracts and displays the stock details from the stock website online and build a graph for the comparison with the historical data and stores historical data in the data service.\nhow we built it\nstep 1: designed uipath apps screen. below screenshot for the reference. step 2: created a process “process name” which pulls stock names for the dropdown from the config file. step 3: bind uipath app dropdown to the “process name” .which triggers on click of the dropdown and pulls the stock names from the config file. step 4: create a data service with below fields fields name step 5: created a process “process name” which has multiple states. once we get input parameter “search stock” from the app, the process will open the browser and does data scrapping for that input (“search stock”). extracts current price, open trends and 1 week data. step 6: the 1 week data which is extracted in step 5 will be stored in the data service “ds name” step 7: the above process “process name” will extract data from “ds name” and convert it into chart using excel. on click of the button “five days data” it will display the chart. step 8: create a data service with below fields step 9: created a process: “process name” which scrapes nse website and store data in data service 2 “ds name” configured a trigger with above process “process name” which runs every hour and stores every hour data in the data service. step 10: the above process “process name” will extract data from “ds name” and convert it into chart using excel. on click of the button “five weeks data” it will display the chart. step 11: the trigger has been set to erase days every 2 weeks. trigger is configured with the process “process name” which has code to delete data from the data service base on the todays date.\nchallenges we ran into\nwe faced problem while working on the data service and but again watching various tutorials on youtube helped us to build this project\naccomplishments that we're proud of\nour bot scrapes the user entered stock data in less than a minute. allows multiple stocks at a time absolutely no data loss . the historical data analysis will lead to better stock trade prediction preserves the trader's discipline, the data will be accurate consistent and precise surveying and -----> harvesting !!!  the data can be exhausting for humans to complete, but robots can perform these tasks easily. automatic extraction and generation of five hours chart, generation of five days chart , auto storing of data to data service and updating it every thing is done in less than a few mins.\nwhat we learned\nexploration and learning . know your customer and know the objectives of the project at hand time management team work is important when things go wrong, as they invariably will; excuses will not work. find an alternative course of action or remedial propositions instead documentation are necessary for reporting purposes good communication is that which will stop mistakes from becoming failures. careful thought needs to be given to the circumstances at hand prior to engaging in decision making.\nwhat's next for stock price comparison project\nwould like to introduce apis, so that data scrapping can be run in the background and it also reduce the time of execution.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59506122}, {"Unnamed: 0": 6676, "autor": "HEXAREIGN | Low Poly NFTs", "date": null, "content": "Premise\nWe often talk about digital land in the crypto space, but land can be taken. The game is simple. There are 4600+ tile NFTs on the Hexareign map, and your goal is to gain as much land as you can. Or not, it's up to the community to decide what winning really is.\nWhat can you do in Hexareign?\nThe game is simple by design. There is no need for complicated rules in a passive game, after all. Every tile generates HEXR tokens, the game currency, as long as its level is over 0. You can forcibly colonize any non-core tile adjacent to one you own with HEXR tokens, regardless of the owner. The current owner of that tile will receive 90% of the HEXR funds used to forcibly colonize that tile. If you own a tile, you can upgrade it. This costs HEXR, but will increase the amount of HEXR that the tile generates while also increasing the amount that the tile costs to be forcibly colonized. Harvesting the tokens on a tile that you own will put the tiles that you are owed into your wallet. Upgrading or colonizing a tile will automatically harvest the tokens.\nMultichain?\nHexareign will be added to multiple chains, but HECO is among the first. We want as many users to have access to the game as possible, and we think that users in crowded maps will want to play in blockchains with less players. This will ultimately help HECO as well as other EVMs. It's not a zero-sum game, after all!\nChallenges\nThere were some issues with getting HECO to work with the Unity SDK that I was using. I campaigned to make the SDK usable with as many EVMs as possible, which is why I'm able to show off this project now. Thanks to the efforts of the chainsafe team, the Unity chainsafe gaming SDK is now completely compatible with HECO, given someone deploys a multicall contract.\nSpeaking of multicall contracts, I have introduced unofficial multicall contracts to the HECO Mainnet and Testnet in the process, in case others want to use them.\nAnother challenge was using a completely decentralized solution for hosting. As cool as it sounds, for me there were some issues. You may find that the Hexareign website is sometimes inaccessible. There are issues with setting the domain correctly. I do want to keep using 4EverLand because it is a neat project, but I'd like a bit of guidance from the team if possible.\nCurrent Status & Use of Funds\nI hope to gain funding so that I can take the game out of the testnet and into the HECO Mainnet. I estimate that it will take around 6 to 8 HECO to deploy completely, if the testnet is to be trusted. If Hexareign wins a large prize from HECO, I will use the funds to do the following:\nPay for an audit of the smart contracts.\nDeploy to the HECO Mainnet.\nEmploy talented artists to beautify the world & bring the improvement update to fruition.\nLong Term Plans?\nYes, Hexareign could become a long term project, but that's really up to the degree at which we can build up a community. The improvement update is most critical, since it allows for regular content from the developers to be given to the players. If desired, more complex gameplay can be added by creating new game modes, where users may not require tiles to play, and could instead take on roles such as farmers or artisans. With enough blockchain integrations, even a blockchain vs blockchain DAO based Hexareign game could be made. There is no bound to creativity, only bounds to how funded and how popular the game is. We hope that HECO and others will support the project to ensure that this happens.\nDeployed Contracts\nHere are some of the relevant smart contracts that have been deployed on the Testnet: HEXR Token: 0xFc88dD590f0097cf7be0e1094321167B81Bee922 Tile NFT: 0x680794D49F13A9e84C5713ddc1326Da90c4182f1 Game Data: 0xd3a97C249AaDBD9cd9173414b8E321c45ad08D6c Game Logic: 0x63606c89139d6d51AF0D2d2Fe82ea21701E5FaE9 Tile Sale: 0xf3f8F430554b613588D9FF15A3F31Bb3Cf4B4CBe\nToken\nI must be clear that the token is for a game, and should not be treated like an investment. Otherwise the SEC would have jurisdiction over Hexareign. That being said, I will still talk about how the token is controlled: The creator account is granted 10M HEXR to be used for giveaways & funding. There are 4 slots for games, each with 1B HEXR to allocate. There is a 6 month waiting period before 1B HEXR can be allocated again. This is to make it so that more maps can be made on the same chain, or even potentially new game modes. 1B HEXR is currently locked inside of the game data contract, and is where HEXR from harvesting comes from.\nWhat's next for HEXAREIGN | Low Poly NFTs\nThe next few updates will address any bugs seen. Once that has been finished, and depending on how well received the game is in these hackathons, an airdrop will be organized! The next major update will also allow users to purchase improvement NFTs, that will strategically change the stats of your tiles based on their height, biome, and landforms. This will add greater depth and personalization to the game. But be careful, someone may take the tiles that you spent improving!", "link": "https://devpost.com/software/hexareign-low-poly-nfts", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "harvesting", "selectorShort": "harvest", "MarkedSent": "premise\nwe often talk about digital land in the crypto space, but land can be taken. the game is simple. there are 4600+ tile nfts on the hexareign map, and your goal is to gain as much land as you can. or not, it's up to the community to decide what winning really is.\nwhat can you do in hexareign?\nthe game is simple by design. there is no need for complicated rules in a passive game, after all. every tile generates hexr tokens, the game currency, as long as its level is over 0. you can forcibly colonize any non-core tile adjacent to one you own with hexr tokens, regardless of the owner. the current owner of that tile will receive 90% of the hexr funds used to forcibly colonize that tile. if you own a tile, you can upgrade it. this costs hexr, but will increase the amount of hexr that the tile generates while also increasing the amount that the tile costs to be forcibly colonized. -----> harvesting !!!  the tokens on a tile that you own will put the tiles that you are owed into your wallet. upgrading or colonizing a tile will automatically harvest the tokens.\nmultichain?\nhexareign will be added to multiple chains, but heco is among the first. we want as many users to have access to the game as possible, and we think that users in crowded maps will want to play in blockchains with less players. this will ultimately help heco as well as other evms. it's not a zero-sum game, after all!\nchallenges\nthere were some issues with getting heco to work with the unity sdk that i was using. i campaigned to make the sdk usable with as many evms as possible, which is why i'm able to show off this project now. thanks to the efforts of the chainsafe team, the unity chainsafe gaming sdk is now completely compatible with heco, given someone deploys a multicall contract.\nspeaking of multicall contracts, i have introduced unofficial multicall contracts to the heco mainnet and testnet in the process, in case others want to use them.\nanother challenge was using a completely decentralized solution for hosting. as cool as it sounds, for me there were some issues. you may find that the hexareign website is sometimes inaccessible. there are issues with setting the domain correctly. i do want to keep using 4everland because it is a neat project, but i'd like a bit of guidance from the team if possible.\ncurrent status & use of funds\ni hope to gain funding so that i can take the game out of the testnet and into the heco mainnet. i estimate that it will take around 6 to 8 heco to deploy completely, if the testnet is to be trusted. if hexareign wins a large prize from heco, i will use the funds to do the following:\npay for an audit of the smart contracts.\ndeploy to the heco mainnet.\nemploy talented artists to beautify the world & bring the improvement update to fruition.\nlong term plans?\nyes, hexareign could become a long term project, but that's really up to the degree at which we can build up a community. the improvement update is most critical, since it allows for regular content from the developers to be given to the players. if desired, more complex gameplay can be added by creating new game modes, where users may not require tiles to play, and could instead take on roles such as farmers or artisans. with enough blockchain integrations, even a blockchain vs blockchain dao based hexareign game could be made. there is no bound to creativity, only bounds to how funded and how popular the game is. we hope that heco and others will support the project to ensure that this happens.\ndeployed contracts\nhere are some of the relevant smart contracts that have been deployed on the testnet: hexr token: 0xfc88dd590f0097cf7be0e1094321167b81bee922 tile nft: 0x680794d49f13a9e84c5713ddc1326da90c4182f1 game data: 0xd3a97c249aadbd9cd9173414b8e321c45ad08d6c game logic: 0x63606c89139d6d51af0d2d2fe82ea21701e5fae9 tile sale: 0xf3f8f430554b613588d9ff15a3f31bb3cf4b4cbe\ntoken\ni must be clear that the token is for a game, and should not be treated like an investment. otherwise the sec would have jurisdiction over hexareign. that being said, i will still talk about how the token is controlled: the creator account is granted 10m hexr to be used for giveaways & funding. there are 4 slots for games, each with 1b hexr to allocate. there is a 6 month waiting period before 1b hexr can be allocated again. this is to make it so that more maps can be made on the same chain, or even potentially new game modes. 1b hexr is currently locked inside of the game data contract, and is where hexr from harvesting comes from.\nwhat's next for hexareign | low poly nfts\nthe next few updates will address any bugs seen. once that has been finished, and depending on how well received the game is in these hackathons, an airdrop will be organized! the next major update will also allow users to purchase improvement nfts, that will strategically change the stats of your tiles based on their height, biome, and landforms. this will add greater depth and personalization to the game. but be careful, someone may take the tiles that you spent improving!", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59506676}], "name": "harvestDevpost"}