{"interestingcomments": [{"Unnamed: 0": 4666, "autor": "Find a specific photo in the album", "date": null, "content": "Title: Find a specific photo in the album\nWho: Han Cai, Ce Zhang\nInspiration (Introduction):\nIn our daily life, we must have encountered this situation that sometimes it is hard to find a specific photo in our album. We might forget the concrete location or accurate time of shooting while only remember some key points. We have to look through the whole album to find the photo we want, which is very time consuming. So, we want to develop a model which can help us find the specific photo we want with only a few words or several short description!\nRelated Work:\nhttps://arxiv.org/pdf/1803.08024.pdf \"Stacked Cross Attention for Image-Text Matching\"\nIn this paper, the researchers study the problem of image-text matching. They introduce a method to infer the latent semantic alignment between objects or other salient stuff (e.g. snow, sky, lawn) and the corresponding words in sentences allows to capture fine-grained interplay between vision and language, and makes image-text matching more interpretable.\nhttps://arxiv.org/pdf/2103.00020.pdf \"Learning Transferable Visual Models From Natural Language Supervision\"\nIn this paper, the researchers demonstrate that the simple pre-training task of predicting which caption goes with which image is an efficient and scalable way to learn SOTA image representations from scratch on a dataset of 400 million (image, text) pairs collected from the internet. After pre-training, natural language is used to reference learned visual concepts (or describe new ones) enabling zero-shot transfer of the model to downstream tasks.\nData:\nWe used Flickr30k Dataset in this project, which is a large corpus of 30K images and 150K descriptive captions. We split the whole dataset into a train set, a validation set and a test set. There are 1,000 images in both validation set and test set and 29,783 images in the train set. We stored the information of all images in three different .json files, where the image name is set to be the dictionary key and the dictionary value is a list which consists of 5 corresponding captions and the location of each image.\nMethodology:\nArchitecture: We firstly used a pre-trained Faster R-CNN object detection model to find out objects in each image. Then we used a pre-trained ResNet-34 model to generate object embedding for each detected object. Next, for each image, we passed object embeddings to an image encoder and passed each word in a text encoder. After that, we calculated the similarity score for each image-caption pair. Our entire model architecture is shown in the Final Writeup.\nHow are you training the model: After we obtained the similarity of each image-caption pair, our model can learn a multi-modal embedding space by jointly training an image encoder and text encoder to maximize the similarity of the image and text embeddings of the N real pairs while minimizing the similarity of the embeddings of the N^2 -N incorrect pairings. Here, we optimized our model by minimizing symmetric cross entropy loss.\nMetrics:\nWe will evaluate the performance of the model on Flickr30k test dataset.\nBase goal: R@1, R@5, R@10 = 24%, 54%, 65% on Flickr30k\nTarget goal: R@1, R@5, R@10 = 33%, 62%, 71% on Flickr30k\nStretch goal: R@1, R@5, R@10 = 43%, 72%, 80% on Flickr30k\nEthics:\nWhy is Deep Learning a good approach to this problem?\nDeep learning can learn complex and high-level feature from both image and text and find their relationship. It's an end-to-end method which trains a possibly complex learning system represented by a single model, bypassing the intermediate process.\nWhat is your dataset? Are there any concerns about how it was collected, or labeled? Is it representative?\nWe will use Flickr30k to train our model. The resource of the album is from the Internet, so it may include some personal privacy. These datasets are actually not representative enough, it only includes 44,518 object categories.\nDivision of labor:\nHan: be responsible for data preprocessing and object detection work\nCe: be responsible for image and text encoders training and improving the model\nProject Check in #2:\nOne-page reflection can be found here: https://docs.google.com/document/d/1FUHWcYWE49VzS2C8BrPIk1583Re8EXnV/edit?usp=sharing&ouid=116398483904985608085&rtpof=true&sd=true\nFinal Writeup/Reflection:\nOur final writeup can be found here: https://docs.google.com/document/d/1cVsk5P0fYlyQjy05dqlTOunm5MycKCBoMQqiX8fE7tA/edit?usp=sharing", "link": "https://devpost.com/software/find-a-photo-in-the-album", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "title: find a specific photo in the album\nwho: han cai, ce zhang\ninspiration (introduction):\nin our daily life, we must have encountered this situation that sometimes it is hard to find a specific photo in our album. we might forget the concrete location or accurate time of shooting while only remember some key points. we have to look through the whole album to find the photo we want, which is very time consuming. so, we want to develop a model which can help us find the specific photo we want with only a few words or several short description!\nrelated work:\nhttps://arxiv.org/pdf/1803.08024.pdf \"stacked cross attention for image-text matching\"\nin this paper, the researchers study the problem of image-text matching. they introduce a method to infer the latent semantic alignment between objects or other salient stuff (e.g. snow, sky, -----> lawn !!! ) and the corresponding words in sentences allows to capture fine-grained interplay between vision and language, and makes image-text matching more interpretable.\nhttps://arxiv.org/pdf/2103.00020.pdf \"learning transferable visual models from natural language supervision\"\nin this paper, the researchers demonstrate that the simple pre-training task of predicting which caption goes with which image is an efficient and scalable way to learn sota image representations from scratch on a dataset of 400 million (image, text) pairs collected from the internet. after pre-training, natural language is used to reference learned visual concepts (or describe new ones) enabling zero-shot transfer of the model to downstream tasks.\ndata:\nwe used flickr30k dataset in this project, which is a large corpus of 30k images and 150k descriptive captions. we split the whole dataset into a train set, a validation set and a test set. there are 1,000 images in both validation set and test set and 29,783 images in the train set. we stored the information of all images in three different .json files, where the image name is set to be the dictionary key and the dictionary value is a list which consists of 5 corresponding captions and the location of each image.\nmethodology:\narchitecture: we firstly used a pre-trained faster r-cnn object detection model to find out objects in each image. then we used a pre-trained resnet-34 model to generate object embedding for each detected object. next, for each image, we passed object embeddings to an image encoder and passed each word in a text encoder. after that, we calculated the similarity score for each image-caption pair. our entire model architecture is shown in the final writeup.\nhow are you training the model: after we obtained the similarity of each image-caption pair, our model can learn a multi-modal embedding space by jointly training an image encoder and text encoder to maximize the similarity of the image and text embeddings of the n real pairs while minimizing the similarity of the embeddings of the n^2 -n incorrect pairings. here, we optimized our model by minimizing symmetric cross entropy loss.\nmetrics:\nwe will evaluate the performance of the model on flickr30k test dataset.\nbase goal: r@1, r@5, r@10 = 24%, 54%, 65% on flickr30k\ntarget goal: r@1, r@5, r@10 = 33%, 62%, 71% on flickr30k\nstretch goal: r@1, r@5, r@10 = 43%, 72%, 80% on flickr30k\nethics:\nwhy is deep learning a good approach to this problem?\ndeep learning can learn complex and high-level feature from both image and text and find their relationship. it's an end-to-end method which trains a possibly complex learning system represented by a single model, bypassing the intermediate process.\nwhat is your dataset? are there any concerns about how it was collected, or labeled? is it representative?\nwe will use flickr30k to train our model. the resource of the album is from the internet, so it may include some personal privacy. these datasets are actually not representative enough, it only includes 44,518 object categories.\ndivision of labor:\nhan: be responsible for data preprocessing and object detection work\nce: be responsible for image and text encoders training and improving the model\nproject check in #2:\none-page reflection can be found here: https://docs.google.com/document/d/1fuhwcywe49vzs2c8brpik1583re8exnv/edit?usp=sharing&ouid=116398483904985608085&rtpof=true&sd=true\nfinal writeup/reflection:\nour final writeup can be found here: https://docs.google.com/document/d/1cvsk5p0fylyqjy05dqltounm5myckcbomqqix8fe7ta/edit?usp=sharing", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 7, "media": null, "medialink": null, "identifyer": 59504666}, {"Unnamed: 0": 4926, "autor": "Real Estate Diary", "date": null, "content": "How can you sell a house quickly?\nIf you have listed your home for sale and want to sell a house quickly, you will undoubtedly want to sell it quickly and for the greatest feasible price. Many purchasers may need to see your property before you can reach an agreement that is beneficial to both parties.\nThis is a lengthy and time-consuming procedure because the buyer is looking at a slew of resale houses, and yours is only one of them. Your objective, then, is to draw his attention to your home by making it stand out from the crowd.\nHere's how to turn your house into an enticing and marketable property.\nLet’s get to know how to sell a house quickly and get your deal done on time. Gather better information here.\nSelecting the Best Broker\nChoosing the appropriate broker is critical when you are planning to sell a house quickly. Don't go with the first broker you come across. Request that at least three brokers evaluate your home and show you some comparable residences that have recently sold.\nSpeak with some of their previous customers. Inspect the properties they trade in if at all possible. Furthermore, make certain that the broker you choose has an easy-to-navigate website and makes use of all available property platforms.\nOnline Property Registration\nList your property on a well-known real estate platform. It is simple, quick, and free. Because online property forums have such a large audience, you increase your chances of receiving inquiries from serious purchasers.\nExamine Your Curb Appeal\nFrom the outside, your home should appear welcoming. Buyers will only enter if they are impressed by what they see from the outside. Make certain that the exterior of your home is well-painted and that the ground is tidy. Mow your lawn if you have one. You might also consider putting flower pots on the outside of your house to decorate it.\nMake certain that your home is spotless.\nTo sell a house quickly, take care of some things. A spotless home speaks for itself. Make certain that there isn't a grain of dust on your selling possibilities. Clean the windows, scrub the floors, and make sure the mirrors and faucets are spotless.\nPerform Minor Repairs\nReplace damaged tiles, unclog blocked drawers, and repair doors that don't close properly. Check that all light bulbs are turned on and that there are no leaky faucets. Consider using neutral colours to paint your walls.\nDepersonalize, declutter, and organise\nGet rid of everything you don't need. Pack your own belongings. Prospective buyers must be able to envision themselves living in the home. The transfer may be easier if the room is orderly and there is nothing to suggest that it belongs to you. Furthermore, less clutter makes the property appear larger.\nHighlight the House's unique selling point\nYour home could be Vaastu-compliant or have a high walk score. From your balcony, you might have a fantastic view or a lovely garden. Profit from your home's Unique Selling Proposition (USP) by displaying it to potential purchasers.\nMake certain that you are adaptable.\nA buyer may want to move in before you are ready to leave. Be adaptable in this regard, even if it means temporarily living in a leased space.\nMotivate Your Broker\nGiving your broker a small bonus – say, 0.5 percent – will motivate him to go above and beyond to get you the finest possible deal. This will help to sell a house quickly\nPhotographs of Your Home from the Most Appropriate Angles\nMake sure you have high-resolution photos of your home. Hiring a professional photographer to handle the job is a fantastic idea.\nWhen it comes to home viewing, be accommodating.\nEven if it is inconvenient, be flexible about when buyers can come to view at your house. In the absence of your broker, you should be prepared to supervise your property viewing. Buyers are put off by limited and restrictive viewing hours.\nGive your buyer no more time than is absolutely necessary.\nDon't give buyers a reason to reject the deal. Remember that many sales transactions fail because the vendor is disorganised and does not move swiftly enough. Buyers may lose interest in the property or discover new ones if there is a delay.\nReorganize your closets and cabinets.\nWell-organized closets and cabinets are not only pleasing to the sight, but they also indicate that the property has been well-maintained.\nExamine Your Property From a Buyer's Point of View\nTake a step back and look at your home objectively. Examine the situation outdoors. Do you enjoy what you've seen so far? Examine each room and imagine how it might appear to a customer. Rearrange the furnishings such that the room appears warm and pleasant to you.\nSo, sell a house quickly by taking help of our services as we can list your house on our web portal amd can make things done in a decent way.\nSo contact us for more information.", "link": "https://devpost.com/software/real-estate-diary-0fxip9", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "lawn", "selectorShort": "lawn", "MarkedSent": "how can you sell a house quickly?\nif you have listed your home for sale and want to sell a house quickly, you will undoubtedly want to sell it quickly and for the greatest feasible price. many purchasers may need to see your property before you can reach an agreement that is beneficial to both parties.\nthis is a lengthy and time-consuming procedure because the buyer is looking at a slew of resale houses, and yours is only one of them. your objective, then, is to draw his attention to your home by making it stand out from the crowd.\nhere's how to turn your house into an enticing and marketable property.\nlet’s get to know how to sell a house quickly and get your deal done on time. gather better information here.\nselecting the best broker\nchoosing the appropriate broker is critical when you are planning to sell a house quickly. don't go with the first broker you come across. request that at least three brokers evaluate your home and show you some comparable residences that have recently sold.\nspeak with some of their previous customers. inspect the properties they trade in if at all possible. furthermore, make certain that the broker you choose has an easy-to-navigate website and makes use of all available property platforms.\nonline property registration\nlist your property on a well-known real estate platform. it is simple, quick, and free. because online property forums have such a large audience, you increase your chances of receiving inquiries from serious purchasers.\nexamine your curb appeal\nfrom the outside, your home should appear welcoming. buyers will only enter if they are impressed by what they see from the outside. make certain that the exterior of your home is well-painted and that the ground is tidy. mow your -----> lawn !!!  if you have one. you might also consider putting flower pots on the outside of your house to decorate it.\nmake certain that your home is spotless.\nto sell a house quickly, take care of some things. a spotless home speaks for itself. make certain that there isn't a grain of dust on your selling possibilities. clean the windows, scrub the floors, and make sure the mirrors and faucets are spotless.\nperform minor repairs\nreplace damaged tiles, unclog blocked drawers, and repair doors that don't close properly. check that all light bulbs are turned on and that there are no leaky faucets. consider using neutral colours to paint your walls.\ndepersonalize, declutter, and organise\nget rid of everything you don't need. pack your own belongings. prospective buyers must be able to envision themselves living in the home. the transfer may be easier if the room is orderly and there is nothing to suggest that it belongs to you. furthermore, less clutter makes the property appear larger.\nhighlight the house's unique selling point\nyour home could be vaastu-compliant or have a high walk score. from your balcony, you might have a fantastic view or a lovely garden. profit from your home's unique selling proposition (usp) by displaying it to potential purchasers.\nmake certain that you are adaptable.\na buyer may want to move in before you are ready to leave. be adaptable in this regard, even if it means temporarily living in a leased space.\nmotivate your broker\ngiving your broker a small bonus – say, 0.5 percent – will motivate him to go above and beyond to get you the finest possible deal. this will help to sell a house quickly\nphotographs of your home from the most appropriate angles\nmake sure you have high-resolution photos of your home. hiring a professional photographer to handle the job is a fantastic idea.\nwhen it comes to home viewing, be accommodating.\neven if it is inconvenient, be flexible about when buyers can come to view at your house. in the absence of your broker, you should be prepared to supervise your property viewing. buyers are put off by limited and restrictive viewing hours.\ngive your buyer no more time than is absolutely necessary.\ndon't give buyers a reason to reject the deal. remember that many sales transactions fail because the vendor is disorganised and does not move swiftly enough. buyers may lose interest in the property or discover new ones if there is a delay.\nreorganize your closets and cabinets.\nwell-organized closets and cabinets are not only pleasing to the sight, but they also indicate that the property has been well-maintained.\nexamine your property from a buyer's point of view\ntake a step back and look at your home objectively. examine the situation outdoors. do you enjoy what you've seen so far? examine each room and imagine how it might appear to a customer. rearrange the furnishings such that the room appears warm and pleasant to you.\nso, sell a house quickly by taking help of our services as we can list your house on our web portal amd can make things done in a decent way.\nso contact us for more information.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59504926}], "name": "lawnDevpost"}