{"interestingcomments": [{"Unnamed: 0": 718, "autor": "Farmfully", "date": null, "content": "Inspiration\nThere are about 150 million farmers in India. Farmers are the backbone of our society. They are the ones who provide us with all the food that we eat. As a result, the entire population of the country depends upon farmers. Crop diseases are a major threat to food security, but their rapid identification remains difficult in many parts of the world due to the lack of necessary infrastructure. Improper care can lead to serious effects on plants and affects the quality, quantity or productivity of the yield. The combination of increasing technology and recent advances in computer vision made possible by deep learning which paved the way for disease diagnosis. Getting affected by a disease is common in plants due to various factors such as fertilizers, cultural practices followed, etc. Leaves of a plant can be used to determine the health status of a plant. Thus, we came up with an approach to detect plant disease by uploading an image of the leaf.\nWhat it does\nPlant disease detection:Detecting whether a leaf is healthy or not. Expert advice: The user can connect to an expert to seek guidance(Video call and chat features are provided). Forums: The user can post their queries related to plant health and can also reply to the other users queries. Fertilizer advice: Advice will be given to the user to improve their plant health based on soil nutrients(Nitrogen, Phosphorus, Potassium). E-learning: Displays some informative resources to the user related to plant-health, soil and fertilizer.\nHow we built it\nWe built our Project using Django framework. HTML, CSS and JS are used for designing webpage.\nPlant disease detection: We built an API (using Flask Framework) which takes a leaf image as input from our website, deep learning model predicts the plant health. The prediction is sent back to the website. Expert advice: Here we used Django channels to establish a connection between farmer and an expert. Forums: User queries and replies are stored in database(used Django in-built database).\nBuilt with 🛠️\nLanguages and Tools:\nChallenges we ran into\nWhile establishing the connection between two users, we faced many errors.\nDisplaying the response from an API in our website.\nAccomplishments that we're proud of\nBuilding up a deep learning model was really a challenging task on our part, as we all were new to machine learning.\nWe learnt how to build an API from scratch.\nWe feel building an end-to-end project in a short period of time is itself a great accomplishment.\nWhat we learned\nWe learnt how to use django channels.\nWe learnt how to deal with django in built databases.\nGained experience with deep learning modules such as pytorch.\nDuring this journey we gained knowledge in the field of agriculture.\nWhat's next for Farmfully\nWe can add regional languages as well, so that even a farmer who don't know english can use our website.\nE-commerce feature can be added, where farmer can buy the Fertilizers recommended by Farmfully.\nWe can also add search engines for retrieving farmer-specific data.", "link": "https://devpost.com/software/farmfully-07felv", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "inspiration\nthere are about 150 million farmers in india. farmers are the backbone of our society. they are the ones who provide us with all the food that we eat. as a result, the entire population of the country depends upon farmers. crop diseases are a major threat to food security, but their rapid identification remains difficult in many parts of the world due to the lack of necessary infrastructure. improper care can lead to serious effects on plants and affects the quality, quantity or productivity of the yield. the combination of increasing technology and recent advances in computer vision made possible by deep learning which paved the way for disease diagnosis. getting affected by a disease is common in plants due to various factors such as fertilizers, cultural practices followed, etc. leaves of a plant can be used to determine the health status of a plant. thus, we came up with an approach to detect plant disease by uploading an image of the -----> leaf !!! .\nwhat it does\nplant disease detection:detecting whether a leaf is healthy or not. expert advice: the user can connect to an expert to seek guidance(video call and chat features are provided). forums: the user can post their queries related to plant health and can also reply to the other users queries. fertilizer advice: advice will be given to the user to improve their plant health based on soil nutrients(nitrogen, phosphorus, potassium). e-learning: displays some informative resources to the user related to plant-health, soil and fertilizer.\nhow we built it\nwe built our project using django framework. html, css and js are used for designing webpage.\nplant disease detection: we built an api (using flask framework) which takes a leaf image as input from our website, deep learning model predicts the plant health. the prediction is sent back to the website. expert advice: here we used django channels to establish a connection between farmer and an expert. forums: user queries and replies are stored in database(used django in-built database).\nbuilt with 🛠️\nlanguages and tools:\nchallenges we ran into\nwhile establishing the connection between two users, we faced many errors.\ndisplaying the response from an api in our website.\naccomplishments that we're proud of\nbuilding up a deep learning model was really a challenging task on our part, as we all were new to machine learning.\nwe learnt how to build an api from scratch.\nwe feel building an end-to-end project in a short period of time is itself a great accomplishment.\nwhat we learned\nwe learnt how to use django channels.\nwe learnt how to deal with django in built databases.\ngained experience with deep learning modules such as pytorch.\nduring this journey we gained knowledge in the field of agriculture.\nwhat's next for farmfully\nwe can add regional languages as well, so that even a farmer who don't know english can use our website.\ne-commerce feature can be added, where farmer can buy the fertilizers recommended by farmfully.\nwe can also add search engines for retrieving farmer-specific data.", "sortedWord": "None", "removed": "Nan", "score": 3, "comments": 0, "media": null, "medialink": null, "identifyer": 59500718}, {"Unnamed: 0": 1617, "autor": "Custom Marijuana Packaging and brand concepts", "date": null, "content": "Scratch is a scratch record. Weeds have a bad reputation. And it's not just the Nixon, DARE, and Above the Influence administrations' deceptions. The scanner was created using Custom Marijuana Packaging. So, while the plant is green and the leaves have seven points, that does not imply that it is the logo for marijuana-infused specialty coffee beans. If you're a winemaker, it's the equivalent of saying that the only logo you can put on your bottle is a Microsoft grape engraving.\nThe latest marijuana logo cliche is the leaf.\nThe Leaf appears in 44 percent of marijuana-related company logos filed as trademarks in the United States. It makes sense: design clichés have their origins, and reefs are instantly recognizable visual indicators that indicate what you're doing. Consider the striped barbershop sign pole. Are you a shaver or a hairstylist? Here is where you can sign up! Want to make your hot tub time machine a trillion times better than it was before? Take it in! Imagine all the other shops on the street being ornamented with one of the striped poles as you walk down the street. What criteria do you use to make your decision? This is where the importance of branding comes into play. If cannabis businesses want to succeed as the sector matures, they must differentiate their products from those of their competitors. We're starting to notice how smoke is influencing new design trends. We also expect that the Custom Marijuana Packaging Industrywill soon be able to capitalize on the rich legacy of unique tribe names by developing innovative brands.\nMarijuana branding that is upscale\nAs a top-tier restaurant owner, you'll be aware that this happened during a review of your establishment by a well-known culinary reviewer. We now have them for the packaging of marijuana. Jake Brown, the first marijuana critic employed by The Denver Post shortly after marijuana was legalized in Colorado, was hired to aid the raucous palate to find the dampest memoirs. High-income persons are more likely to have tried marijuana, according to Colorado research. Similarly, we're already seeing an uptick in the number of brands, as well as luxury and luxury Custom Marijuana Packaging items. New consumption methods are included, ranging from exquisite artisan groceries to fashionable pen evaporators that can fit in your wallet. These luxury companies have a more subdued color palette, simplified geometry (often reminiscent of leaves), crisp lines, and sophisticated modern typography in common with other artisan brands.\nThe beginner's market\nCannabis legalization will increase the number of cannabis users. As a result, many consumers try new items and have no idea how to use them. Understanding and appreciating the differences between Sativa and Indica might be frightening. A significant market for branded products is opening up, attracting new users. This includes low-THC drugs and those that eliminate the learning curve (think pre-rolled welds). These companies' brands must be pleasant and welcoming, packaged in a well-marked container.\nMarijuana has a large market.\nThe mass-market market brand is the same for marijuana as it is for other products. If you want to appeal to a wide spectrum of customers, the greatest thing you can do is design a distinctive brand and packaging. The design should be simple and contemporary. You can use popular design trends like retro and flat design to establish your brand, but avoid those that don't apply applicable to a certain target demographic.\nTurn the leaves green and upside down.\nCannabis users, according to studies, value the natural origins of their goods. They choose a grass that is both environmentally friendly and sustainable. The perspective of the surroundings is one of the factors to consider while branding (and manufacturing) Custom Marijuana Packaging, regardless of the target market. When constructing a package, this is extremely crucial. What kind of paper and ink do you use for your projects? Is it possible to re-use the package? A green bag, like a blossom inside, aids in the development of a consumer-friendly brand.\nTHC can be found (link to health)\nIn a few states, recreational marijuana is rarely permitted. Medical marijuana, on the other hand, is gaining popularity in more than half of the United States. As a result, the market for medical or health-related cannabis products is much larger than the recreational market. Many of Gange's followers are aware of and choose to concentrate on the (legal) health advantages of the brand's goods. This usually entails a logo with a strong medical or pharmaceutical sense, which may include The Leaf as well as more classic medical imagery. When it comes to packaging, the health benefits of using the product are usually the focus. Ointments, creams, and tinctures are some of the products available.\nLastly, there are a few things to think about when it comes to marijuana branding.\nWe hope the preceding example has inspired you. (If not, give the product a try and go over the list again.) It's said to be good for brainstorming.) There are a few things to think about before rushing to create a unique and stunning new marijuana logo and packaging. Marijuana legalization is subject to several constraints. Companies must have precise package information, and the product must not be appealing to youngsters. To add to the confusion, these rules differ from state to state. Make sure you have all of the information you'll need for your marketing materials, whether it's a website or a product package. If you break the laws of your state or country, don't do it. While the stigma is dissipating, many countries of the world still prohibit the use of medicinal and/or recreational drugs. Hey, it's still technically illegal in the United States, according to the federal authorities. To put it another way, it's difficult. Marijuana has a lot of financial potentials, but it's not worth the danger of being prosecuted.", "link": "https://devpost.com/software/guest-post", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "scratch is a scratch record. weeds have a bad reputation. and it's not just the nixon, dare, and above the influence administrations' deceptions. the scanner was created using custom marijuana packaging. so, while the plant is green and the leaves have seven points, that does not imply that it is the logo for marijuana-infused specialty coffee beans. if you're a winemaker, it's the equivalent of saying that the only logo you can put on your bottle is a microsoft grape engraving.\nthe latest marijuana logo cliche is the -----> leaf !!! .\nthe leaf appears in 44 percent of marijuana-related company logos filed as trademarks in the united states. it makes sense: design clichés have their origins, and reefs are instantly recognizable visual indicators that indicate what you're doing. consider the striped barbershop sign pole. are you a shaver or a hairstylist? here is where you can sign up! want to make your hot tub time machine a trillion times better than it was before? take it in! imagine all the other shops on the street being ornamented with one of the striped poles as you walk down the street. what criteria do you use to make your decision? this is where the importance of branding comes into play. if cannabis businesses want to succeed as the sector matures, they must differentiate their products from those of their competitors. we're starting to notice how smoke is influencing new design trends. we also expect that the custom marijuana packaging industrywill soon be able to capitalize on the rich legacy of unique tribe names by developing innovative brands.\nmarijuana branding that is upscale\nas a top-tier restaurant owner, you'll be aware that this happened during a review of your establishment by a well-known culinary reviewer. we now have them for the packaging of marijuana. jake brown, the first marijuana critic employed by the denver post shortly after marijuana was legalized in colorado, was hired to aid the raucous palate to find the dampest memoirs. high-income persons are more likely to have tried marijuana, according to colorado research. similarly, we're already seeing an uptick in the number of brands, as well as luxury and luxury custom marijuana packaging items. new consumption methods are included, ranging from exquisite artisan groceries to fashionable pen evaporators that can fit in your wallet. these luxury companies have a more subdued color palette, simplified geometry (often reminiscent of leaves), crisp lines, and sophisticated modern typography in common with other artisan brands.\nthe beginner's market\ncannabis legalization will increase the number of cannabis users. as a result, many consumers try new items and have no idea how to use them. understanding and appreciating the differences between sativa and indica might be frightening. a significant market for branded products is opening up, attracting new users. this includes low-thc drugs and those that eliminate the learning curve (think pre-rolled welds). these companies' brands must be pleasant and welcoming, packaged in a well-marked container.\nmarijuana has a large market.\nthe mass-market market brand is the same for marijuana as it is for other products. if you want to appeal to a wide spectrum of customers, the greatest thing you can do is design a distinctive brand and packaging. the design should be simple and contemporary. you can use popular design trends like retro and flat design to establish your brand, but avoid those that don't apply applicable to a certain target demographic.\nturn the leaves green and upside down.\ncannabis users, according to studies, value the natural origins of their goods. they choose a grass that is both environmentally friendly and sustainable. the perspective of the surroundings is one of the factors to consider while branding (and manufacturing) custom marijuana packaging, regardless of the target market. when constructing a package, this is extremely crucial. what kind of paper and ink do you use for your projects? is it possible to re-use the package? a green bag, like a blossom inside, aids in the development of a consumer-friendly brand.\nthc can be found (link to health)\nin a few states, recreational marijuana is rarely permitted. medical marijuana, on the other hand, is gaining popularity in more than half of the united states. as a result, the market for medical or health-related cannabis products is much larger than the recreational market. many of gange's followers are aware of and choose to concentrate on the (legal) health advantages of the brand's goods. this usually entails a logo with a strong medical or pharmaceutical sense, which may include the leaf as well as more classic medical imagery. when it comes to packaging, the health benefits of using the product are usually the focus. ointments, creams, and tinctures are some of the products available.\nlastly, there are a few things to think about when it comes to marijuana branding.\nwe hope the preceding example has inspired you. (if not, give the product a try and go over the list again.) it's said to be good for brainstorming.) there are a few things to think about before rushing to create a unique and stunning new marijuana logo and packaging. marijuana legalization is subject to several constraints. companies must have precise package information, and the product must not be appealing to youngsters. to add to the confusion, these rules differ from state to state. make sure you have all of the information you'll need for your marketing materials, whether it's a website or a product package. if you break the laws of your state or country, don't do it. while the stigma is dissipating, many countries of the world still prohibit the use of medicinal and/or recreational drugs. hey, it's still technically illegal in the united states, according to the federal authorities. to put it another way, it's difficult. marijuana has a lot of financial potentials, but it's not worth the danger of being prosecuted.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59501617}, {"Unnamed: 0": 6543, "autor": "Minato Namikaze", "date": null, "content": "Minato Namikaze of Konohagakue\nWhat it does\nKonichiwa 👋, myself Minato Namikaze, Konohagakure Yondaime Hokage. I do every work of a Hokage in a swift and clean way ⚡ To know more about hokage click here\nHow we built it\nIt is build using discord.py and hosted on Heroku\nChallenges we ran into\nBot hosting, Hostoing was really a big solution since free hosting has many limitation\nAccomplishments that we're proud of\nWe are proud that it the best anime bot in market rn, that its open sourced :) Also this bot dosen't use any database thus full privacy centric bot\nWhat we learned\nI learned discord.py, async python, more about classes and how API works\nWhat's next for Minato Namikaze\nSoon its v2 will be released, all the updates are here Click here\nNOTE: THIS IS FULLY A TRY OUT PROJECT THUS NO VIDEO CAN PROVIDED PLEASE INVITE THE BOT AND TEST IT INVITE LINK\nMinato Namikaze\nKonichiwa 👋, myself Minato Namikaze, Konohagakure Yondaime Hokage. I do every work of a Hokage in a swift and clean way ⚡\nAbout Me\nMinato Namikaze (波風ミナト, Namikaze Minato) was the Fourth Hokage (四代目火影, Yondaime Hokage, literally meaning: Fourth Fire Shadow) of Konohagakure. He was renowned all over the world as Konoha's Yellow Flash (木ノ葉の黄色い閃光, Konoha no Kiiroi Senkō, English TV: Yellow Flash of the Leaf). He died during the Nine-Tailed Demon Fox's Attack, sacrificing his life to seal a part of the Nine-Tails into his newborn son, Naruto Uzumaki.\nGet Started\nInvite Now\nWebsite", "link": "https://devpost.com/software/minato-namikaze", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "minato namikaze of konohagakue\nwhat it does\nkonichiwa 👋, myself minato namikaze, konohagakure yondaime hokage. i do every work of a hokage in a swift and clean way ⚡ to know more about hokage click here\nhow we built it\nit is build using discord.py and hosted on heroku\nchallenges we ran into\nbot hosting, hostoing was really a big solution since free hosting has many limitation\naccomplishments that we're proud of\nwe are proud that it the best anime bot in market rn, that its open sourced :) also this bot dosen't use any database thus full privacy centric bot\nwhat we learned\ni learned discord.py, async python, more about classes and how api works\nwhat's next for minato namikaze\nsoon its v2 will be released, all the updates are here click here\nnote: this is fully a try out project thus no video can provided please invite the bot and test it invite link\nminato namikaze\nkonichiwa 👋, myself minato namikaze, konohagakure yondaime hokage. i do every work of a hokage in a swift and clean way ⚡\nabout me\nminato namikaze (波風ミナト, namikaze minato) was the fourth hokage (四代目火影, yondaime hokage, literally meaning: fourth fire shadow) of konohagakure. he was renowned all over the world as konoha's yellow flash (木ノ葉の黄色い閃光, konoha no kiiroi senkō, english tv: yellow flash of the -----> leaf !!! ). he died during the nine-tailed demon fox's attack, sacrificing his life to seal a part of the nine-tails into his newborn son, naruto uzumaki.\nget started\ninvite now\nwebsite", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59506543}, {"Unnamed: 0": 7612, "autor": "Dr. Plant", "date": null, "content": "Inspiration\nSingapore has a bold plan call the ‘30 by 30’ goal, which is to build up the nation’s agri-food industry’s capability and capacity to produce 30% of the nutritional needs locally and sustainably by 2030.\nTo complement this goal, NParks also launched the ‘Gardening with Edibles’ programme, an initiative to encourage the local community in gardening.\nWhat it does\nDr. Plant does 2 tasks.\nTask 1 assess the plant's external conditions: the prototype is to record readings on external environment, such as the temperature, pH levels of soils and nitrogen/oxygen levels, and give an assessment on the plant's overall conditions based on these readings. Thereafter suggest to user on ways to improve the conditions.\nTask 2 monitor the plant's health: the prototype is to monitor plant's leaves and to detect if the leaves show symptoms where the plant is not growing healthily, so that the prototype can suggest to user ways to treat the plans if it is unhealthy.\nHow we built it\nWe use the sensors attached to the raspberry pi to collect data such as the humidity, pH level of the soil and the rainfall and train a neural network to predict the probability scores for all possible plants, so that the gardener knows with all these conditions, what’s the best plant to grow. A separate pre-trained computer vision model Xception is used to detect the leaf of the plant and classify whether the plant has disease and what is the disease. Then the predictions from both model will be integrated into a JSON API and is being sent and display into the web app dashboard for monitoring.\nChallenges we ran into\nIncorporating the Raspberry Pi with the Web App for the prototyping\nAccomplishments that we're proud of\nfully developed app\nWhat we learned\nGet more information of our plants.\nWhat's next for Dr. Plant\nFor future plans, we aim to incorporate Machine Learning Operation, which is MLOps to keep track of the Machine Learning life cycle. In the event where there is data drift or concept drift, the deep learning models can be retrained constantly, such as including a new species of plants. Also, cloud-based technologies like AWS can be used to scale up our model to incorporate more species into our models. Lastly, we look at the business model where we can rent the equipment to the urban gardeners and we take a certain amount of commissions from their earnings for this scheme, that way we can ensure that our business is sustainable", "link": "https://devpost.com/software/dr-plant-83iz5f", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "inspiration\nsingapore has a bold plan call the ‘30 by 30’ goal, which is to build up the nation’s agri-food industry’s capability and capacity to produce 30% of the nutritional needs locally and sustainably by 2030.\nto complement this goal, nparks also launched the ‘gardening with edibles’ programme, an initiative to encourage the local community in gardening.\nwhat it does\ndr. plant does 2 tasks.\ntask 1 assess the plant's external conditions: the prototype is to record readings on external environment, such as the temperature, ph levels of soils and nitrogen/oxygen levels, and give an assessment on the plant's overall conditions based on these readings. thereafter suggest to user on ways to improve the conditions.\ntask 2 monitor the plant's health: the prototype is to monitor plant's leaves and to detect if the leaves show symptoms where the plant is not growing healthily, so that the prototype can suggest to user ways to treat the plans if it is unhealthy.\nhow we built it\nwe use the sensors attached to the raspberry pi to collect data such as the humidity, ph level of the soil and the rainfall and train a neural network to predict the probability scores for all possible plants, so that the gardener knows with all these conditions, what’s the best plant to grow. a separate pre-trained computer vision model xception is used to detect the -----> leaf !!!  of the plant and classify whether the plant has disease and what is the disease. then the predictions from both model will be integrated into a json api and is being sent and display into the web app dashboard for monitoring.\nchallenges we ran into\nincorporating the raspberry pi with the web app for the prototyping\naccomplishments that we're proud of\nfully developed app\nwhat we learned\nget more information of our plants.\nwhat's next for dr. plant\nfor future plans, we aim to incorporate machine learning operation, which is mlops to keep track of the machine learning life cycle. in the event where there is data drift or concept drift, the deep learning models can be retrained constantly, such as including a new species of plants. also, cloud-based technologies like aws can be used to scale up our model to incorporate more species into our models. lastly, we look at the business model where we can rent the equipment to the urban gardeners and we take a certain amount of commissions from their earnings for this scheme, that way we can ensure that our business is sustainable", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": null, "medialink": null, "identifyer": 59507612}], "name": "leafDevpost"}