{"interestingcomments": [{"Unnamed: 0": 3250, "autor": "Sapling", "date": null, "content": "Inspiration\nOur inspiration for this project was to empower everyday individuals who want to begin their investing journey. There's a common perception that only wall street financers with tons of money can invest in stock; we wanted to challenge the status quo by providing an innovative approach to determining the optimal stocks to invest in.\nWhat it does\nWe have created a unique investment recommendation algorithm by considering key metrics of a stock's performance: social media sentiment, social impact, profit margin, average 5-day change, net promoter score (NPS), and net profit margin (NPM). Users will choose what category of stock they would like to invest in -- technology, cryptocurrency, pharmaceuticals, international, and major players-- and our platform will provide consul correspondingly. For users who are interested in starting their investment portfolio, we have also built an education component that addresses the basics of investing.\nHow we built it\nWe approached this task with a divide-and-conquer mindset. While Ananya focused on building the front end of Sapling, Aditi concentrated on developing the social media sentiment analysis extraction element of our application, while Rishika worked on algorithm development and calculation. We used a combination of React and Flask to develop our service.\nChallenges we ran into\nOne of the biggest challenges we faced while developing Sapling was ensuring that we found datasets that accurately represented our problem parameters. Many datasets were either too large or too small, or they were outdated and didn't match with current consumer trends. We overcame this obstacle by creating a unique blend of data that was extracted directly from social media pages and Yahoo Finance.\nAccomplishments that we're proud of\nWe're definitely amazed at how much we accomplished in 24 hours! We are also super proud of how we were able to creatively approach our problem by including unconventional metrics not typically used in investing.\nWhat we learned\nWe all came to the realization that today's modern world is extremely interconnected. Trends that may seem unrelated to one topic can actually have the most impact and every post on the internet has the power to influence consumers regardless of its validity.\nWhat's next for Sapling\nWe look forward to integrating additional metrics to improve our investment score analysis. Additionally, we would like to market our offering so that more individuals can empower themselves through investing.", "link": "https://devpost.com/software/sapling-ryx3uq", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "sapling", "selectorShort": "sapling", "MarkedSent": "inspiration\nour inspiration for this project was to empower everyday individuals who want to begin their investing journey. there's a common perception that only wall street financers with tons of money can invest in stock; we wanted to challenge the status quo by providing an innovative approach to determining the optimal stocks to invest in.\nwhat it does\nwe have created a unique investment recommendation algorithm by considering key metrics of a stock's performance: social media sentiment, social impact, profit margin, average 5-day change, net promoter score (nps), and net profit margin (npm). users will choose what category of stock they would like to invest in -- technology, cryptocurrency, pharmaceuticals, international, and major players-- and our platform will provide consul correspondingly. for users who are interested in starting their investment portfolio, we have also built an education component that addresses the basics of investing.\nhow we built it\nwe approached this task with a divide-and-conquer mindset. while ananya focused on building the front end of -----> sapling !!! , aditi concentrated on developing the social media sentiment analysis extraction element of our application, while rishika worked on algorithm development and calculation. we used a combination of react and flask to develop our service.\nchallenges we ran into\none of the biggest challenges we faced while developing sapling was ensuring that we found datasets that accurately represented our problem parameters. many datasets were either too large or too small, or they were outdated and didn't match with current consumer trends. we overcame this obstacle by creating a unique blend of data that was extracted directly from social media pages and yahoo finance.\naccomplishments that we're proud of\nwe're definitely amazed at how much we accomplished in 24 hours! we are also super proud of how we were able to creatively approach our problem by including unconventional metrics not typically used in investing.\nwhat we learned\nwe all came to the realization that today's modern world is extremely interconnected. trends that may seem unrelated to one topic can actually have the most impact and every post on the internet has the power to influence consumers regardless of its validity.\nwhat's next for sapling\nwe look forward to integrating additional metrics to improve our investment score analysis. additionally, we would like to market our offering so that more individuals can empower themselves through investing.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59503250}, {"Unnamed: 0": 3540, "autor": "Sprout Talks", "date": null, "content": "Inspiration\nSprout Talks was inspired by mentor/mentee systems based on personal experience that were often short lived. Coming from backgrounds of POC, women in tech, and low income where we are heavily underrepresented, it was hard to find guidance in our desired field. A motivation to keep pursuing our goals was attending hackathons focused on women in tech where female professionals shared their stories of being the minority at their workplace, how they built their career, and how the greatest things can be built by girls. We saw a problem that these amazing connections were only accessible at hackathons of like-minded peers and professionals, instead of when we were discouraged and needed support from others. Our platform acts as an outlet for underrepresented groups to continue sharing their experiences while serving as a guiding resource for learners. A question that we always had in mind was “some women and underrepresented people are intimidated to speak up and therefore, take charge in their careers. How can we empower and encourage them?“ Sprout Talks is there to help take charge of your own voice by developing solidarity in minority communities while also breaking boundaries and speaking a difference.\nWhat it does\nSprout Talks is a community-held live discussion focused on the interests of the users based in underrepresented communities. Everyone has a chance to inspire and empower through their voices. The mobile app allows users to create an account with their email or by connecting to Linkedin. They will also choose relevant tags such as pronouns, country, and topics of interest. New members will be prompted to choose from being a flower (mentor) and sproutlet (mentee). Both flowers and sproutlets will be able to listen to others or create their own sprout talk, which is a live discussion similar to a podcast. Within topics such as technology, business, etc. it filters into further subtopics such as women in tech or hacking, so users can build speaking skills while inspiring others with similar experiences. Additionally, each topic will have weekly discussion questions, for example “why are you interested in your occupation?” in order to encourage more sprout talks. With each sprout talk, there will also be a user count of how many sproutlets are listening. Within these talks, contains a chat and button to submit speakers to engage with their listeners. Reactions called “cheers” are also included as a way to show encouragement in the community. After talking in a discussion, sprout talks are also posted on profiles as “Achievements” to celebrate them. Within the user profiles, it also contains relevant tags, the option to connect to Linkedin, a follow button to receive notifications when someone has started a sprout talk. In addition to these features, Sprout Talk has also included a search function for mentees to look for mentors and request mentorship. They can view the profiles and see mutual mentors based on peers they follow too.\nHow we built it\nTo brainstorm, we used Figjam to organize and conceptualize rapidly. Our organization was ranked in terms of priority and narrowed down ideas. We also created multiple screens in Figma to show a “what-if” scenario. When it came down to having various screens, we would take a vote on our best choice which often ended up as a whole team majority.\nChallenges\nThe challenges we ran into were “how would we narrow down our ideas on which features to include?”, which resulted in us deciding what were the three main points of our brainstorm and choosing one to expand on. Another obstacle was “how to reach the target audience while staying fun at the same time”, where we wanted to have an engaging platform that was used by professionals without being seen as overly formal. This resulted in the idea with plants and having an eye-catching color scheme. Other difficulties were “how can we increase engagement while keeping the app organized” where we came up with the idea of choosing topics and creating subtopics in order to create a more refined search.\nAccomplishments that we're proud of\nWe take pride in being able to incorporate various cohesive functions within the app despite a strict time constraint. The app also includes an adorable flower and sprouts and takes on a friendly and inviting theme while connecting to the problem statement. We also included a simple yet loveable logo, consisting of an animated sapling. Finally, we also feel accomplished in that our team designed a unique app which centers around the idea of building communities through the hosting of live discussions based on podcasts -- a feature not often seen in apps.\nWhat we learned\nBecause we spent a lot of time brainstorming solutions, we were left with a lot of ideas and became ambitious, imagining a lot of features for our product. However, we learned that getting a third party input was good in helping us see potentials and blind spots in our ideas. We reached out to one of the mentors, Al, and he provided us with which solution to focus on. We learned to think out of the box and try to create an app that is unique to stand out from the crowd. Two of the team members are new hackers and also had a steep learning curve with Figma. That leaves one member who learned to be patient with the new hackers and guide them through the design process, as they are new to design thinking. One of our team members learned how to create gifs with Procreate. We also learned that design thinking can be messy and there really is no right way to proceed it. We had to learn to let go of some solutions to build a viable product within 24 hours. Because we constantly questioned our designs solution while we were creating, we learned to think for two user audiences: mentor and mentee, speaker and listener. Popularity of the app could create an unorganized display so we had to change our plans in consideration for that.\nWhat's next\nAlthough we are limited in the amount of functions we could include due to a time constraint, there are still opportunities in the foreseeable future to continue to improve the design of the app. For instance, with the incorporation of the mentor/mentee system, we could include a matchmaking cycle for the mentor and mentees as well. The idea is that a random mentor would be able to choose and request to be paired with a mentee. They would be paired for a certain period of time, and once their period is over, they each get paired to another mentee or mentor, and so on. The current system only includes the option for a mentee to request mentorship, but not the other way around. Therefore, this idea adds more options for mentors. Another idea would be to encourage larger projects between mutual mentors/mentees. An example would be that a mentor could have multiple mentees, and the mentor may want to work on a large project together with all the mentees. This encourages the idea of building a larger community. We could also include a function that allows speakers to share their screen to allow the display of a speaker’s project or presentation during a sprout talk.", "link": "https://devpost.com/software/sprout-talks", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "sapling", "selectorShort": "sapling", "MarkedSent": "inspiration\nsprout talks was inspired by mentor/mentee systems based on personal experience that were often short lived. coming from backgrounds of poc, women in tech, and low income where we are heavily underrepresented, it was hard to find guidance in our desired field. a motivation to keep pursuing our goals was attending hackathons focused on women in tech where female professionals shared their stories of being the minority at their workplace, how they built their career, and how the greatest things can be built by girls. we saw a problem that these amazing connections were only accessible at hackathons of like-minded peers and professionals, instead of when we were discouraged and needed support from others. our platform acts as an outlet for underrepresented groups to continue sharing their experiences while serving as a guiding resource for learners. a question that we always had in mind was “some women and underrepresented people are intimidated to speak up and therefore, take charge in their careers. how can we empower and encourage them?“ sprout talks is there to help take charge of your own voice by developing solidarity in minority communities while also breaking boundaries and speaking a difference.\nwhat it does\nsprout talks is a community-held live discussion focused on the interests of the users based in underrepresented communities. everyone has a chance to inspire and empower through their voices. the mobile app allows users to create an account with their email or by connecting to linkedin. they will also choose relevant tags such as pronouns, country, and topics of interest. new members will be prompted to choose from being a flower (mentor) and sproutlet (mentee). both flowers and sproutlets will be able to listen to others or create their own sprout talk, which is a live discussion similar to a podcast. within topics such as technology, business, etc. it filters into further subtopics such as women in tech or hacking, so users can build speaking skills while inspiring others with similar experiences. additionally, each topic will have weekly discussion questions, for example “why are you interested in your occupation?” in order to encourage more sprout talks. with each sprout talk, there will also be a user count of how many sproutlets are listening. within these talks, contains a chat and button to submit speakers to engage with their listeners. reactions called “cheers” are also included as a way to show encouragement in the community. after talking in a discussion, sprout talks are also posted on profiles as “achievements” to celebrate them. within the user profiles, it also contains relevant tags, the option to connect to linkedin, a follow button to receive notifications when someone has started a sprout talk. in addition to these features, sprout talk has also included a search function for mentees to look for mentors and request mentorship. they can view the profiles and see mutual mentors based on peers they follow too.\nhow we built it\nto brainstorm, we used figjam to organize and conceptualize rapidly. our organization was ranked in terms of priority and narrowed down ideas. we also created multiple screens in figma to show a “what-if” scenario. when it came down to having various screens, we would take a vote on our best choice which often ended up as a whole team majority.\nchallenges\nthe challenges we ran into were “how would we narrow down our ideas on which features to include?”, which resulted in us deciding what were the three main points of our brainstorm and choosing one to expand on. another obstacle was “how to reach the target audience while staying fun at the same time”, where we wanted to have an engaging platform that was used by professionals without being seen as overly formal. this resulted in the idea with plants and having an eye-catching color scheme. other difficulties were “how can we increase engagement while keeping the app organized” where we came up with the idea of choosing topics and creating subtopics in order to create a more refined search.\naccomplishments that we're proud of\nwe take pride in being able to incorporate various cohesive functions within the app despite a strict time constraint. the app also includes an adorable flower and sprouts and takes on a friendly and inviting theme while connecting to the problem statement. we also included a simple yet loveable logo, consisting of an animated -----> sapling !!! . finally, we also feel accomplished in that our team designed a unique app which centers around the idea of building communities through the hosting of live discussions based on podcasts -- a feature not often seen in apps.\nwhat we learned\nbecause we spent a lot of time brainstorming solutions, we were left with a lot of ideas and became ambitious, imagining a lot of features for our product. however, we learned that getting a third party input was good in helping us see potentials and blind spots in our ideas. we reached out to one of the mentors, al, and he provided us with which solution to focus on. we learned to think out of the box and try to create an app that is unique to stand out from the crowd. two of the team members are new hackers and also had a steep learning curve with figma. that leaves one member who learned to be patient with the new hackers and guide them through the design process, as they are new to design thinking. one of our team members learned how to create gifs with procreate. we also learned that design thinking can be messy and there really is no right way to proceed it. we had to learn to let go of some solutions to build a viable product within 24 hours. because we constantly questioned our designs solution while we were creating, we learned to think for two user audiences: mentor and mentee, speaker and listener. popularity of the app could create an unorganized display so we had to change our plans in consideration for that.\nwhat's next\nalthough we are limited in the amount of functions we could include due to a time constraint, there are still opportunities in the foreseeable future to continue to improve the design of the app. for instance, with the incorporation of the mentor/mentee system, we could include a matchmaking cycle for the mentor and mentees as well. the idea is that a random mentor would be able to choose and request to be paired with a mentee. they would be paired for a certain period of time, and once their period is over, they each get paired to another mentee or mentor, and so on. the current system only includes the option for a mentee to request mentorship, but not the other way around. therefore, this idea adds more options for mentors. another idea would be to encourage larger projects between mutual mentors/mentees. an example would be that a mentor could have multiple mentees, and the mentor may want to work on a large project together with all the mentees. this encourages the idea of building a larger community. we could also include a function that allows speakers to share their screen to allow the display of a speaker’s project or presentation during a sprout talk.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": null, "medialink": null, "identifyer": 59503540}], "name": "saplingDevpost"}