{"interestingcomments": [{"Unnamed: 0": 443, "autor": "ARPen/Chalk", "date": null, "content": "Inspiration\nAs we know about the current situation there is no such technique that can replace or remove the need for Pen/Chalk for use at a useful place like University, Classroom, ResarchLabs, Tutions, etc.\nBut I have come with a new Idea for replacing the need for Pen/Chalk at these places with the help of Augmented Reality(AR) by making an App ARChalk/Pen which helps the user to create or draw in the mid-air without the use of any Pen or Chalk for drawing shapes that follows a human’s finger with the help of AR.\nIt will help us to preserve the environment and also help us to save the trees as we know the pages of notebooks are made from Tress, and the ink of the pen also uses natural resources, this app will help us to reduce the environmental causes.\nSuppose you are teaching students in the class and you want your students to understand better about the concept(suppose cube) that is a 2D figure and they are not able to understand it because it becomes really difficult to understand a 3D figure in a 2D plane. But with the help of this app, you will be able to explain the concept in a much more detailed manner as we can draw the 3D figure in the mid-air with the help of this app.\nWhat it does\nLet me first explain the approach of drawing shapes that follows a human’s finger with the help of AR. Drawing shapes is done by detecting every new location for the moving finger, dropping a vertex at that location, and connecting each vertex with the previous one. Vertices can be connected by a simple line, or through a Bezier curve if we need a smooth output.\nModeling in Augmented Reality (AR) lets users create and manipulate virtual objects in mid-air that are aligned to their real environment. I present ARChalk/Pen, a bimanual input technique for AR modeling that combines a standard smartphone with a 3D-printed pen. Users sketch with the pen in mid-air, while holding their smartphone in the other hand to see the virtual pen traces in the live camera image. ARChalk/Pen combines 3D input precision with the rich interactive capabilities of the smartphone touchscreen. I studied subjective preferences for this bimanual input technique, such as how people hold the smartphone while drawing, and analyzed the performance of different bimanual techniques for selecting and drawing. Users preferred a bimanual technique casting a ray through the fingertip for both selection and translation. I provide initial design guidelines for this new class of bimanual AR modeling systems.\nHow I built it\nMy application is built using Unity Engine, Google AR Core.\nChallenges I ran into\nAs there is no such kind of app available in the market for solving this problem, I had to research a lot about making such a kind of app and building it successfully.\nAccomplishments that I'm proud of\nSolving all the problems and being able to make such kind of unique app. I've successfully made a solution and an application that is large scalable accounting for all the problems which haven’t been made previously.\nWhat I've learned\nTaking user input and being able to create a figure in the mid-air with the help of AR.", "link": "https://devpost.com/software/arpen-chalk", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "tress", "selectorShort": "tress", "MarkedSent": "inspiration\nas we know about the current situation there is no such technique that can replace or remove the need for pen/chalk for use at a useful place like university, classroom, resarchlabs, tutions, etc.\nbut i have come with a new idea for replacing the need for pen/chalk at these places with the help of augmented reality(ar) by making an app archalk/pen which helps the user to create or draw in the mid-air without the use of any pen or chalk for drawing shapes that follows a human’s finger with the help of ar.\nit will help us to preserve the environment and also help us to save the trees as we know the pages of notebooks are made from -----> tress !!! , and the ink of the pen also uses natural resources, this app will help us to reduce the environmental causes.\nsuppose you are teaching students in the class and you want your students to understand better about the concept(suppose cube) that is a 2d figure and they are not able to understand it because it becomes really difficult to understand a 3d figure in a 2d plane. but with the help of this app, you will be able to explain the concept in a much more detailed manner as we can draw the 3d figure in the mid-air with the help of this app.\nwhat it does\nlet me first explain the approach of drawing shapes that follows a human’s finger with the help of ar. drawing shapes is done by detecting every new location for the moving finger, dropping a vertex at that location, and connecting each vertex with the previous one. vertices can be connected by a simple line, or through a bezier curve if we need a smooth output.\nmodeling in augmented reality (ar) lets users create and manipulate virtual objects in mid-air that are aligned to their real environment. i present archalk/pen, a bimanual input technique for ar modeling that combines a standard smartphone with a 3d-printed pen. users sketch with the pen in mid-air, while holding their smartphone in the other hand to see the virtual pen traces in the live camera image. archalk/pen combines 3d input precision with the rich interactive capabilities of the smartphone touchscreen. i studied subjective preferences for this bimanual input technique, such as how people hold the smartphone while drawing, and analyzed the performance of different bimanual techniques for selecting and drawing. users preferred a bimanual technique casting a ray through the fingertip for both selection and translation. i provide initial design guidelines for this new class of bimanual ar modeling systems.\nhow i built it\nmy application is built using unity engine, google ar core.\nchallenges i ran into\nas there is no such kind of app available in the market for solving this problem, i had to research a lot about making such a kind of app and building it successfully.\naccomplishments that i'm proud of\nsolving all the problems and being able to make such kind of unique app. i've successfully made a solution and an application that is large scalable accounting for all the problems which haven’t been made previously.\nwhat i've learned\ntaking user input and being able to create a figure in the mid-air with the help of ar.", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 0, "media": null, "medialink": null, "identifyer": 59500443}], "name": "tressDevpost"}