{"interestingcomments": [{"Unnamed: 0": 2358, "autor": "Recycle-me", "date": null, "content": "Inspiration\nNowadays, people tend to ignore the environment. As we see, the world generates at least 3.5 million tons of plastic and other solid waste every day. If you don't know how much it is, imagine 15 grocery bags filled with plastic trash piled up on every single yard of shoreline in the world. That’s how much land-based plastic trash ended up in the world’s oceans in just one year, and yet there are a growing number of people. By 2100, the growing global urban population will be producing three times as much waste as it does today. That level of waste carries serious consequences—physical and fiscal—for cities around the world. That's why we try to minimize the amount of trash we generate each day with our website with help of AI. By gamifying the recycling process and rewarding the recycler with our coin and making the garbage detection more interesting using Machine Learning.\nWhat it does\nOur apps help people to help themselves by making the earth cleaner interestingly and pleasingly. Users can earn credits by collecting trash and recycling it, and then plant trees around the world with the credits. With this app, users can have a delightful experience while cleaning the environment and keeping our environment green and clean.\nHow we built it\nFor the first 2 hours, we brainstormed to decide on what project we should work on. After we decided to create recycle-me, we worked on each part: frontend, backend, and machine learning model, and did a follow-up every 6 hours. For the model, we used the VGG base model and trained it on our dataset, which is a garbage dataset, for our garbage object detection. On our website, we design an interface for the user to interact with on the front-end. We also create a recommendation system for the user on what to do with all of the garbage and used items. And for the last one, the backend, we create the database and API for our website, also gathering and researching data for display on the front end.\nChallenges we ran into\nThe challenge that we were facing was the fast pace of the competition itself. For the frontend, we had to create a responsive and interesting website for the user, since our hope for this website is that it will be used by a lot of people. So we have to make it comfortable and enjoyable for the users. From the backend, we encountered a CORS on the API, so we needed to handle the CORS and we had to synchronize the database that is used on this website. The last challenge that we encountered was when we were building our model. We had to do a lot of training for the model to get a satisfying model for us to deploy, so we had to read a lot of papers in such a short time.\nAccomplishments that we're proud of\n-We managed to create a fully functional website in such a short time. -We could integrate 3 parts of this website: the frontend, the backend, and the machine learning model. -We could solve all of the challenges that we were facing.\nWhat we learned\nFrom this project, we learned a lot about time management, teamwork, and how to work under pressure. And we also found some new inventions that can help this world be a better world with technology like machine learning.\nWhat's next for Recycle-me\nFor the next step, we will focus on our website to be used in a bigger community. And we also planned to work together with a real-tree-planting organization to plant a real tree around the world each time our website users spend their coins.", "link": "https://devpost.com/software/recycle-me-5mbrt9", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "inspiration\nnowadays, people tend to ignore the environment. as we see, the world generates at least 3.5 million tons of plastic and other solid waste every day. if you don't know how much it is, imagine 15 grocery bags filled with plastic trash piled up on every single -----> yard !!!  of shoreline in the world. that’s how much land-based plastic trash ended up in the world’s oceans in just one year, and yet there are a growing number of people. by 2100, the growing global urban population will be producing three times as much waste as it does today. that level of waste carries serious consequences—physical and fiscal—for cities around the world. that's why we try to minimize the amount of trash we generate each day with our website with help of ai. by gamifying the recycling process and rewarding the recycler with our coin and making the garbage detection more interesting using machine learning.\nwhat it does\nour apps help people to help themselves by making the earth cleaner interestingly and pleasingly. users can earn credits by collecting trash and recycling it, and then plant trees around the world with the credits. with this app, users can have a delightful experience while cleaning the environment and keeping our environment green and clean.\nhow we built it\nfor the first 2 hours, we brainstormed to decide on what project we should work on. after we decided to create recycle-me, we worked on each part: frontend, backend, and machine learning model, and did a follow-up every 6 hours. for the model, we used the vgg base model and trained it on our dataset, which is a garbage dataset, for our garbage object detection. on our website, we design an interface for the user to interact with on the front-end. we also create a recommendation system for the user on what to do with all of the garbage and used items. and for the last one, the backend, we create the database and api for our website, also gathering and researching data for display on the front end.\nchallenges we ran into\nthe challenge that we were facing was the fast pace of the competition itself. for the frontend, we had to create a responsive and interesting website for the user, since our hope for this website is that it will be used by a lot of people. so we have to make it comfortable and enjoyable for the users. from the backend, we encountered a cors on the api, so we needed to handle the cors and we had to synchronize the database that is used on this website. the last challenge that we encountered was when we were building our model. we had to do a lot of training for the model to get a satisfying model for us to deploy, so we had to read a lot of papers in such a short time.\naccomplishments that we're proud of\n-we managed to create a fully functional website in such a short time. -we could integrate 3 parts of this website: the frontend, the backend, and the machine learning model. -we could solve all of the challenges that we were facing.\nwhat we learned\nfrom this project, we learned a lot about time management, teamwork, and how to work under pressure. and we also found some new inventions that can help this world be a better world with technology like machine learning.\nwhat's next for recycle-me\nfor the next step, we will focus on our website to be used in a bigger community. and we also planned to work together with a real-tree-planting organization to plant a real tree around the world each time our website users spend their coins.", "sortedWord": "None", "removed": "Nan", "score": 10, "comments": 3, "media": null, "medialink": null, "identifyer": 59502358}, {"Unnamed: 0": 5723, "autor": "Composting Stations", "date": null, "content": "Inspiration\nIn School, We are taught about Climatic Change, Green-Houses Gaseous Emissions, Global Warming etc. We are also taught about the advance consequences of Global Warming if not put in Check.\nI develop this application as a way to help check and minimize the effect of Methane Emissions in the land fill via compositing.\n. Composite Materials can range from Nuts, Yard Waste, Fruits, Vegetable, Paper, Diary, Houseplants, etc. All this composites Materials when subjected to some Bio-Chemical reactions by some action of microbes tend to produce Humus or Compost. hence reduces the Methane Gas Emissions in the Land Fill.\nThis application is created to encourage People and Various Community to continue compositing in an easy way.\nWhat it does\n1.) This Applications that allow People and various Local Communities to Connect, Post, Search and Share Composting Stations globally on Google-Map..\n2.)It allow People and various Local communities to look for nearby Drop-Off Locations to bring their Yard Waste,Houseplants, Food Scraps, Vegetable, Paper, Diary etc. to\n3.) The applications also have Search Engine System that allow People to Search Composting Stations based on City Names, States name, Country names etc.\nHow we built it\nThe application was built using Google map-Javascript API, Google-Geocoding API, PHP and Mysql.\nWhen a User publishes a New Composting Stations, the application uses Google-Geo-coding API to convert the composting city name, state names, country names into their respective Latitudes and Longitudes. This makes it easier for each published Composting stations to appear on Google Map.\nCodes\nThe Codes for the projects has been uploaded in the Additional Info section part of the applications submission on devpost. The Readme.txt files contains installations instructions. Thank You..", "link": "https://devpost.com/software/composting-stations", "origin": "Devpost", "suborigin": "Devpost", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "inspiration\nin school, we are taught about climatic change, green-houses gaseous emissions, global warming etc. we are also taught about the advance consequences of global warming if not put in check.\ni develop this application as a way to help check and minimize the effect of methane emissions in the land fill via compositing.\n. composite materials can range from nuts, -----> yard !!!  waste, fruits, vegetable, paper, diary, houseplants, etc. all this composites materials when subjected to some bio-chemical reactions by some action of microbes tend to produce humus or compost. hence reduces the methane gas emissions in the land fill.\nthis application is created to encourage people and various community to continue compositing in an easy way.\nwhat it does\n1.) this applications that allow people and various local communities to connect, post, search and share composting stations globally on google-map..\n2.)it allow people and various local communities to look for nearby drop-off locations to bring their yard waste,houseplants, food scraps, vegetable, paper, diary etc. to\n3.) the applications also have search engine system that allow people to search composting stations based on city names, states name, country names etc.\nhow we built it\nthe application was built using google map-javascript api, google-geocoding api, php and mysql.\nwhen a user publishes a new composting stations, the application uses google-geo-coding api to convert the composting city name, state names, country names into their respective latitudes and longitudes. this makes it easier for each published composting stations to appear on google map.\ncodes\nthe codes for the projects has been uploaded in the additional info section part of the applications submission on devpost. the readme.txt files contains installations instructions. thank you..", "sortedWord": "None", "removed": "Nan", "score": 0, "comments": 3, "media": null, "medialink": null, "identifyer": 59505723}], "name": "yardDevpost"}