{"interestingcomments": [{"Unnamed: 0": 181663, "autor": "iElectronCloud", "date": 1622340240000, "content": "Is the tripod mount point consistent across the Ms? /!/ Question to those with multiple Ms. I know that the slot on the films M is on the right hand side and off-center on the digital M, but wanted to make sure if its precise location is consistent across each of the mediums.", "link": "https://www.reddit.com/r/Leica/comments/no19wj/is_the_tripod_mount_point_consistent_across_the_ms/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "is the tripod mount point consistent across the ms? /!/ question to those with multiple ms. i know that the slot on the films m is on the right hand side and off-center on the digital m, but wanted to make sure if its precise -----> location !!!  is consistent across each of the mediums.", "sortedWord": "None", "identifyer": 74181, "year": "2021"}, {"Unnamed: 0": 183452, "autor": "camera_lover", "date": 1634175424000, "content": "Just Received My Grandfather's Leica /!/ &amp;#x200B;\n\nhttps://preview.redd.it/x0x8sgf3jbt71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=bb94d5a5c3a4a59d9cf43d3b4b92fd5be6910aee\n\nHi All,\n\nI just received my Grandfather's Leica which he purchased (I think?) in 1944. It has not been used in many years and I am thinking of refurbishing it to use for future trips to various locations. Also, it seems like an excellent camera to start learning photography in a deeper way. \n\nDo you have any advice about getting this antique camera refurbished? How do you think the potential quality of the pictures would be compared to a more modern DSLR (&lt; $1,000)?", "link": "https://www.reddit.com/r/Leica/comments/q7pk4w/just_received_my_grandfathers_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "just received my grandfather's leica /!/ &amp;#x200b;\n\nhttps://preview.redd.it/x0x8sgf3jbt71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=bb94d5a5c3a4a59d9cf43d3b4b92fd5be6910aee\n\nhi all,\n\ni just received my grandfather's leica which he purchased (i think?) in 1944. it has not been used in many years and i am thinking of refurbishing it to use for future trips to various -----> locations !!! . also, it seems like an excellent camera to start learning photography in a deeper way. \n\ndo you have any advice about getting this antique camera refurbished? how do you think the potential quality of the pictures would be compared to a more modern dslr (&lt; $1,000)?", "sortedWord": "None", "identifyer": 75994, "year": "2021"}], "name": "locationleica2021"}