{"interestingcomments": [{"Unnamed: 0": 217715, "autor": "tricky_tree", "date": 1588471461000, "content": "Differences with M6 /!/ For the last six months or so, I have wanted to purchase a Leica camera and have switched between camera types. First, I was interested in the M7 but became concerned with the electronics and scarcity of parts because it has been discontinued. I read several posts that recommended the M6 and thought the M6 might be a solid camera due to its longevity. \n\nI've noticed that some M6s have slightly different engravings and wanted to know if there was any real difference? For instance, some M6 cameras will have just the \"M6\" engraving written on the left side, whereas the majority that I have seen have \"M6 Leica\" written in the same location. Is this a personal preference or is there a real difference?\n\nI also learned that the year the M6 was created makes a difference, too. M6s created between 1988-1998 seem to be better than others? Is this correct?\n\nAny assistance with these questions will help. Thanks!", "link": "https://www.reddit.com/r/Leica/comments/gcikwv/differences_with_m6/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "differences with m6 /!/ for the last six months or so, i have wanted to purchase a leica camera and have switched between camera types. first, i was interested in the m7 but became concerned with the electronics and scarcity of parts because it has been discontinued. i read several posts that recommended the m6 and thought the m6 might be a solid camera due to its longevity. \n\ni've noticed that some m6s have slightly different engravings and wanted to know if there was any real difference? for instance, some m6 cameras will have just the \"m6\" engraving written on the left side, whereas the majority that i have seen have \"m6 leica\" written in the same -----> location !!! . is this a personal preference or is there a real difference?\n\ni also learned that the year the m6 was created makes a difference, too. m6s created between 1988-1998 seem to be better than others? is this correct?\n\nany assistance with these questions will help. thanks!", "sortedWord": "None", "identifyer": 12178, "year": "2020"}], "name": "locationleica2020"}