{"interestingcomments": [{"Unnamed: 0": 218034, "autor": "kingkob", "date": 1601476566000, "content": "Lens cap for the 12585 lens hood? /!/ I bought a used 50mm ‘cron a few weeks ago. Absolutely love it, despite being older and a bit worn down. \n\nThough I use a UV filter and then 12585 hood to protect this beauty, I’m hoping to fine a lens cap that can work with the hood. Honestly the Leica one it came with is pretty poor quality and constantly falls off (even with both orientations of the hood). \n\nAny suggestions?", "link": "https://www.reddit.com/r/Leica/comments/j2nasf/lens_cap_for_the_12585_lens_hood/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "orientations", "selectorShort": "orientation", "MarkedSent": "lens cap for the 12585 lens hood? /!/ i bought a used 50mm ‘cron a few weeks ago. absolutely love it, despite being older and a bit worn down. \n\nthough i use a uv filter and then 12585 hood to protect this beauty, i’m hoping to fine a lens cap that can work with the hood. honestly the leica one it came with is pretty poor quality and constantly falls off (even with both -----> orientations !!!  of the hood). \n\nany suggestions?", "sortedWord": "None", "identifyer": 12507, "year": "2020"}, {"Unnamed: 0": 218240, "autor": "mattcube64", "date": 1598585677000, "content": "Is the Black Chrome 50 APO's lens hood just poorly designed or am I dumb? /!/ Loving my new setup - even took some time off in a couple weeks to enjoy time at an Airbnb in the mountains to tinker and get familiar. But I'm just left scratching my head at this lens hood.\n\nIn the picture on B&amp;H, it clearly shows that it clips on with the \"large\" side are outward, and the \"Made In Germany\" text the correct orientation should the screen of the camera be face down on a table. If I do this... the whole lens cap can very easily spin around the lens (does this constantly in just normal use... furthermore, it's VERY easily pulled off. And past that... then the lens cap doesn't work. The cap is too small.\n\n&amp;#x200B;\n\nYou can flip the lens hood around - and now the lens cap at least works! But the hood still spins AND now it covers up your aperture ring. \n\nThis seems like... super obvious... but I'm struggling. Thoughts?", "link": "https://www.reddit.com/r/Leica/comments/ihzt6n/is_the_black_chrome_50_apos_lens_hood_just_poorly/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "is the black chrome 50 apo's lens hood just poorly designed or am i dumb? /!/ loving my new setup - even took some time off in a couple weeks to enjoy time at an airbnb in the mountains to tinker and get familiar. but i'm just left scratching my head at this lens hood.\n\nin the picture on b&amp;h, it clearly shows that it clips on with the \"large\" side are outward, and the \"made in germany\" text the correct -----> orientation !!!  should the screen of the camera be face down on a table. if i do this... the whole lens cap can very easily spin around the lens (does this constantly in just normal use... furthermore, it's very easily pulled off. and past that... then the lens cap doesn't work. the cap is too small.\n\n&amp;#x200b;\n\nyou can flip the lens hood around - and now the lens cap at least works! but the hood still spins and now it covers up your aperture ring. \n\nthis seems like... super obvious... but i'm struggling. thoughts?", "sortedWord": "None", "identifyer": 12717, "year": "2020"}], "name": "orientationleica2020"}