{"interestingcomments": [{"Unnamed: 0": 181666, "autor": "Franatix", "date": 1622316620000, "content": "Can't focus RF in portrait orientation? /!/ So a few weeks ago I upgraded my M6 to an M6TTL, and I've just noticed that I can't use the RF patch to focus when the camera is in portrait orientation. I have to turn the camera to landscape, focus, then turn back. But I'm sure that my M6 classic could focus in portrait orientation (I think) \n\nIs this an issue, or is it normal behaviour of rangefinders that I just never noticed before?", "link": "https://www.reddit.com/r/Leica/comments/nnukn6/cant_focus_rf_in_portrait_orientation/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "can't focus rf in portrait -----> orientation !!! ? /!/ so a few weeks ago i upgraded my m6 to an m6ttl, and i've just noticed that i can't use the rf patch to focus when the camera is in portrait orientation. i have to turn the camera to landscape, focus, then turn back. but i'm sure that my m6 classic could focus in portrait orientation (i think) \n\nis this an issue, or is it normal behaviour of rangefinders that i just never noticed before?", "sortedWord": "None", "identifyer": 74184, "year": "2021"}, {"Unnamed: 0": 182324, "autor": "joe_ro", "date": 1609774033000, "content": "MP Finder Upgrade on an M6? /!/ Need to send my camera in for service (CLA, &amp; fix frame line switch) \n\nAnd I’m considering having the MP finder installed. \n\nI’ve read a lot about if it’s worth but want this sub’s opinion. \n\nPersonally, I do encounter flare regularly that effects my shooting. Will be taking a portrait orientation photo &amp; have to rotate camera horizontally to be able to use the patch. \n\nSure, if I’m better at zone focusing I wouldn’t have to worry, but I’m not there yet. \n\n2 month turnaround is rough :/ but I have a few other cameras I can use, plus I just got a lot of expired 120 so I can focus more on medium format. \n\nThoughts?", "link": "https://www.reddit.com/r/Leica/comments/kqauze/mp_finder_upgrade_on_an_m6/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mp finder upgrade on an m6? /!/ need to send my camera in for service (cla, &amp; fix frame line switch) \n\nand i’m considering having the mp finder installed. \n\ni’ve read a lot about if it’s worth but want this sub’s opinion. \n\npersonally, i do encounter flare regularly that effects my shooting. will be taking a portrait -----> orientation !!!  photo &amp; have to rotate camera horizontally to be able to use the patch. \n\nsure, if i’m better at zone focusing i wouldn’t have to worry, but i’m not there yet. \n\n2 month turnaround is rough :/ but i have a few other cameras i can use, plus i just got a lot of expired 120 so i can focus more on medium format. \n\nthoughts?", "sortedWord": "None", "identifyer": 74847, "year": "2021"}, {"Unnamed: 0": 183353, "autor": "ClarkeStreet", "date": 1628881733000, "content": "Random question alert 🚨 /!/ I’m just interested to see people’s viewpoint and pros and cons.\nWhich way do you hold the camera if shooting portrait orientation? \nI never understood why people shot with the top plate facing to the right (shutter button at the bottom) whilst I was using SLR’s and point and shoots, having the back of the camera pressed against your nose just seemed uncomfortable too me, however, since using an M I have started shooting the other way round. Mainly because it’s a whole lot easier to use the focusing tab that way. Shooting an M with the shutter button at the top just results in some cross handed shenanigans which just isn’t comfortable. Any thoughts?", "link": "https://www.reddit.com/r/Leica/comments/p3rvfp/random_question_alert/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "random question alert 🚨 /!/ i’m just interested to see people’s viewpoint and pros and cons.\nwhich way do you hold the camera if shooting portrait -----> orientation !!! ? \ni never understood why people shot with the top plate facing to the right (shutter button at the bottom) whilst i was using slr’s and point and shoots, having the back of the camera pressed against your nose just seemed uncomfortable too me, however, since using an m i have started shooting the other way round. mainly because it’s a whole lot easier to use the focusing tab that way. shooting an m with the shutter button at the top just results in some cross handed shenanigans which just isn’t comfortable. any thoughts?", "sortedWord": "None", "identifyer": 75895, "year": "2021"}], "name": "orientationleica2021"}