{"interestingcomments": [{"Unnamed: 0": 220096, "autor": "Market-Maker", "date": 1518489381000, "content": "Taab focus ring /!/ I just bought a Taab focus ring to place on my Summicron lens that doesn’t have a focus tab. I am not sure how to position it on the focus ring. Does anyone know if the focus tab is supposed to be positioned at the bottom of the lens if it is focused to infinity or close focused?\n\nhttps://static.bhphoto.com/images/images1000x1000/1442763312000_1184554.jpg", "link": "https://www.reddit.com/r/Leica/comments/7x68pq/taab_focus_ring/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "taab focus ring /!/ i just bought a taab focus ring to place on my summicron lens that doesn’t have a focus tab. i am not sure how to -----> position !!!  it on the focus ring. does anyone know if the focus tab is supposed to be positioned at the bottom of the lens if it is focused to infinity or close focused?\n\nhttps://static.bhphoto.com/images/images1000x1000/1442763312000_1184554.jpg", "sortedWord": "None", "identifyer": 14610, "year": "2018"}, {"Unnamed: 0": 220105, "autor": "insuo", "date": 1518121370000, "content": "Lens won't click into place on M6/MP /!/ I purchased a Zeiss Sonnar-C 50mm lens for my M6 and lens won't turn enough to click into position. I spoke to a friend with an MP who also has the same lens, and tried his lens and it works perfectly fine on my M6, however my copy won't mount onto his MP. I had a feeling there was something wrong with the rear lens flange/mount/bayonet on my copy, however I tried this lens onto my friend's Leica M2 and M3 and it manages to fit perfectly fine with a click at the end. What could be the issue?", "link": "https://www.reddit.com/r/Leica/comments/7w7t6r/lens_wont_click_into_place_on_m6mp/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens won't click into place on m6/mp /!/ i purchased a zeiss sonnar-c 50mm lens for my m6 and lens won't turn enough to click into -----> position !!! . i spoke to a friend with an mp who also has the same lens, and tried his lens and it works perfectly fine on my m6, however my copy won't mount onto his mp. i had a feeling there was something wrong with the rear lens flange/mount/bayonet on my copy, however i tried this lens onto my friend's leica m2 and m3 and it manages to fit perfectly fine with a click at the end. what could be the issue?", "sortedWord": "None", "identifyer": 14619, "year": "2018"}, {"Unnamed: 0": 220345, "autor": "TheBaratheon", "date": 1529887632000, "content": "Question: Leica M2 advance lever stuck. /!/ Hey guys M2’s advance lever suddenly got stuck and rotated only from resting position to about half way and then doesn’t go any further. Also, my shutter curtain is open and doesn’t close. There is no film in the camera and I’ve tried to do a self timer to see if it fixes the problem but no luck. Any ideas or suggestions?", "link": "https://www.reddit.com/r/Leica/comments/8tmdc0/question_leica_m2_advance_lever_stuck/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: leica m2 advance lever stuck. /!/ hey guys m2’s advance lever suddenly got stuck and rotated only from resting -----> position !!!  to about half way and then doesn’t go any further. also, my shutter curtain is open and doesn’t close. there is no film in the camera and i’ve tried to do a self timer to see if it fixes the problem but no luck. any ideas or suggestions?", "sortedWord": "None", "identifyer": 14865, "year": "2018"}, {"Unnamed: 0": 220352, "autor": "basednino", "date": 1529643459000, "content": "Leica M10 or M6 &amp; M9? /!/ Hi guys, I recently sold a lot of film gear.  Sold my Pentax 67ii, Mamiya 7ii and today my Hasselblad Xpan.  So I’m big on rangefinders.  The news station I work at however wants me to jump into digital since I got a full time position.  I love how reliable the M10 is compared to the M9.  I do love the M6 TTL also.  I only have one lens right now, the noctilux 50mm F/0.95.  So I would have to get an additional lens, if anyone wanted to recommend a gem to me", "link": "https://www.reddit.com/r/Leica/comments/8syo6x/leica_m10_or_m6_m9/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica m10 or m6 &amp; m9? /!/ hi guys, i recently sold a lot of film gear.  sold my pentax 67ii, mamiya 7ii and today my hasselblad xpan.  so i’m big on rangefinders.  the news station i work at however wants me to jump into digital since i got a full time -----> position !!! .  i love how reliable the m10 is compared to the m9.  i do love the m6 ttl also.  i only have one lens right now, the noctilux 50mm f/0.95.  so i would have to get an additional lens, if anyone wanted to recommend a gem to me", "sortedWord": "None", "identifyer": 14872, "year": "2018"}], "name": "positionleica2018"}