{"interestingcomments": [{"Unnamed: 0": 216516, "autor": "k918", "date": 1580267202000, "content": "M240 Viewfinder De-cementing? Fungus? What could this be? Does anybody know what these donut shaped spots are?", "link": "https://www.reddit.com/r/Leica/comments/evgsfu/m240_viewfinder_decementing_fungus_what_could/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "m240 viewfinder de-cementing? fungus? what could this be? does anybody know what these donut shaped -----> spots !!!  are?", "sortedWord": "None", "identifyer": 10955, "year": "2020"}, {"Unnamed: 0": 216761, "autor": "den215", "date": 1582941612000, "content": "should i be worried about these white spots? it wouldn’t blow off.", "link": "https://www.reddit.com/r/Leica/comments/fb5hp0/should_i_be_worried_about_these_white_spots_it/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "should i be worried about these white -----> spots !!! ? it wouldn’t blow off.", "sortedWord": "None", "identifyer": 11204, "year": "2020"}, {"Unnamed: 0": 216914, "autor": "paparoachfan420", "date": 1593130101000, "content": "Top plate of chrome M6 rubbed to a polish? /!/ https://imgur.com/a/9SOUZeJ\n\nI’m looking at this Silver M6 classic but the top has a big polished spot. This seems like a really odd spot for general wear and I’m suspicious of this unit having zinc bubbles just buffed off. \n\nDoes anyone have any insight on this?", "link": "https://www.reddit.com/r/Leica/comments/hfx9ro/top_plate_of_chrome_m6_rubbed_to_a_polish/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "top plate of chrome m6 rubbed to a polish? /!/ https://imgur.com/a/9souzej\n\ni’m looking at this silver m6 classic but the top has a big polished -----> spot !!! . this seems like a really odd spot for general wear and i’m suspicious of this unit having zinc bubbles just buffed off. \n\ndoes anyone have any insight on this?", "sortedWord": "None", "identifyer": 11359, "year": "2020"}, {"Unnamed: 0": 217070, "autor": "Reddavide", "date": 1595735241000, "content": "Used Leica SL: few questions /!/ Hi Guys,\n\nLeica newbie here. I’ve got a used SL and a summicron 50 f2 6 bit with Leica adapter. I hope you can help me with a couple of questions. \n1) is it normal it doesn’t show the f number on the screen while shooting but only after one shoots? I thought one of the points of the original adapter was to hand over aperture too? Also, it happened a couple of times already that even though in M the lens was at f2, shutter speed at 1/125 it shot at a different (random) aperture. Again, issue with the adapter?\n2) difficult shot at night in the deck with low light of my baby forehead, picture once downloaded was very much ok but on the screen it had a significant amount of red/pink spots on his skin\n3) Lightroom for iPad, does it have the right Leica profiles for DNGs or what I’m missing from the desktop/laptop version? My workflow currently is import straight from the SD Card in iPad Lightroom, edit what’s needed and export the JPGs in the iPad camera roll and from there add them to my albums\n4) if I wanted to shoot JPEG directly, what suggestions would you give in terms of in camera settings? SLs JPEGs seem a lot noisier compared to the DNGs. \n\nI’m very excited about the new Leica but to be fair Point 1 and 2 above got me worried. \n\nThanks!\nDavide", "link": "https://www.reddit.com/r/Leica/comments/hy02ye/used_leica_sl_few_questions/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "used leica sl: few questions /!/ hi guys,\n\nleica newbie here. i’ve got a used sl and a summicron 50 f2 6 bit with leica adapter. i hope you can help me with a couple of questions. \n1) is it normal it doesn’t show the f number on the screen while shooting but only after one shoots? i thought one of the points of the original adapter was to hand over aperture too? also, it happened a couple of times already that even though in m the lens was at f2, shutter speed at 1/125 it shot at a different (random) aperture. again, issue with the adapter?\n2) difficult shot at night in the deck with low light of my baby forehead, picture once downloaded was very much ok but on the screen it had a significant amount of red/pink -----> spots !!!  on his skin\n3) lightroom for ipad, does it have the right leica profiles for dngs or what i’m missing from the desktop/laptop version? my workflow currently is import straight from the sd card in ipad lightroom, edit what’s needed and export the jpgs in the ipad camera roll and from there add them to my albums\n4) if i wanted to shoot jpeg directly, what suggestions would you give in terms of in camera settings? sls jpegs seem a lot noisier compared to the dngs. \n\ni’m very excited about the new leica but to be fair point 1 and 2 above got me worried. \n\nthanks!\ndavide", "sortedWord": "None", "identifyer": 11517, "year": "2020"}, {"Unnamed: 0": 217360, "autor": "wetreels", "date": 1598952907000, "content": "Black Spots? Suggestions?", "link": "https://www.reddit.com/r/Leica/comments/ikh8lq/black_spots_suggestions/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!! ? suggestions?", "sortedWord": "None", "identifyer": 11817, "year": "2020"}, {"Unnamed: 0": 217459, "autor": "quietglow", "date": 1608575592000, "content": "M4-P light leak /!/ An M4-P I picked up recently has a light leak and I have no idea what it could be. Maybe someone has an idea. So I did the one frame test: loaded a short bit of film, exposed the camera to a bunch of sunlight with no lens cap etc. Then, I removed the film in the darkbag and souped the film. The theory is that with only one frame exposed, you can see exactly where the leak is. Here's the result:\n\n[https://imgur.com/a/lqOa2bZ](https://imgur.com/a/lqOa2bZ)\n\nSo one thing that's obvious: the shutter isn't light tight. That is apparently common and can be handled by using a lens cap when not shooting. The problem is the leak over to the left. That's the one that appears in every frame when you shoot normally. When properly oriented in the camera, that spot on the film is where the pen tip is in the second photo. \n\nI thought maybe the leak was related to the shutter, so I did the test again, this time with a lens cap on. The leak was still there and in the same place, so that's not it.\n\nThat spot is very close to the junction of the door, but there is no damage to the door, nor are there seals. So I am not sure what could be amiss. Any ideas?", "link": "https://www.reddit.com/r/Leica/comments/khn3vn/m4p_light_leak/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "m4-p light leak /!/ an m4-p i picked up recently has a light leak and i have no idea what it could be. maybe someone has an idea. so i did the one frame test: loaded a short bit of film, exposed the camera to a bunch of sunlight with no lens cap etc. then, i removed the film in the darkbag and souped the film. the theory is that with only one frame exposed, you can see exactly where the leak is. here's the result:\n\n[https://imgur.com/a/lqoa2bz](https://imgur.com/a/lqoa2bz)\n\nso one thing that's obvious: the shutter isn't light tight. that is apparently common and can be handled by using a lens cap when not shooting. the problem is the leak over to the left. that's the one that appears in every frame when you shoot normally. when properly oriented in the camera, that -----> spot !!!  on the film is where the pen tip is in the second photo. \n\ni thought maybe the leak was related to the shutter, so i did the test again, this time with a lens cap on. the leak was still there and in the same place, so that's not it.\n\nthat spot is very close to the junction of the door, but there is no damage to the door, nor are there seals. so i am not sure what could be amiss. any ideas?", "sortedWord": "None", "identifyer": 11918, "year": "2020"}, {"Unnamed: 0": 217641, "autor": "kirederf7", "date": 1580980045000, "content": "I just keep buying these when I spot a good deal. The cheapest of the bunch was the m2, paid 125 euros for it!", "link": "https://www.reddit.com/r/Leica/comments/ezpr3h/i_just_keep_buying_these_when_i_spot_a_good_deal/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i just keep buying these when i -----> spot !!!  a good deal. the cheapest of the bunch was the m2, paid 125 euros for it!", "sortedWord": "None", "identifyer": 12104, "year": "2020"}, {"Unnamed: 0": 217757, "autor": "NormalOddSameDiff", "date": 1591790035000, "content": "First Time M-Buyer: Where to hunt? /!/ I've been looking around for quite some time for a used Leica M6 or MP. eBay has been my main searching area as I'm finding it hard to find any local stores here in Canada that would have Leicas.\n\nShould I be trying to find local spots or am I right in thinking I need to be purchasing via a big site like eBay?", "link": "https://www.reddit.com/r/Leica/comments/h09dts/first_time_mbuyer_where_to_hunt/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "first time m-buyer: where to hunt? /!/ i've been looking around for quite some time for a used leica m6 or mp. ebay has been my main searching area as i'm finding it hard to find any local stores here in canada that would have leicas.\n\nshould i be trying to find local -----> spots !!!  or am i right in thinking i need to be purchasing via a big site like ebay?", "sortedWord": "None", "identifyer": 12220, "year": "2020"}, {"Unnamed: 0": 217933, "autor": "luc9488", "date": 1594316009000, "content": "Sensor cleaning suggestions in Toronto, Canada? Here's a screenshot of LR \"Visualize Spots\" @ 100% - M10 - F16 - Clear blue sky", "link": "https://www.reddit.com/r/Leica/comments/ho7da0/sensor_cleaning_suggestions_in_toronto_canada/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sensor cleaning suggestions in toronto, canada? here's a screenshot of lr \"visualize -----> spots !!! \" @ 100% - m10 - f16 - clear blue sky", "sortedWord": "None", "identifyer": 12401, "year": "2020"}, {"Unnamed: 0": 218000, "autor": "SimpleQuietLife", "date": 1604518281000, "content": "Recent shoot at my local spot", "link": "https://www.reddit.com/r/Leica/comments/jo380g/recent_shoot_at_my_local_spot/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "recent shoot at my local -----> spot !!! ", "sortedWord": "None", "identifyer": 12472, "year": "2020"}, {"Unnamed: 0": 218294, "autor": "san_anselm", "date": 1598046155000, "content": "Vulcanite Swap / Repair: Best Spots to Send? /!/ Right there in the title: I’ve got a lovely M4-2 in great condition, but sadly the vulcanite covering continues to chip. \n\nI’ve looked online to see some options about people who do this repair, but I figured I’d consult sigh the ever wise members of reddit.", "link": "https://www.reddit.com/r/Leica/comments/ie5zp8/vulcanite_swap_repair_best_spots_to_send/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "vulcanite swap / repair: best -----> spots !!!  to send? /!/ right there in the title: i’ve got a lovely m4-2 in great condition, but sadly the vulcanite covering continues to chip. \n\ni’ve looked online to see some options about people who do this repair, but i figured i’d consult sigh the ever wise members of reddit.", "sortedWord": "None", "identifyer": 12771, "year": "2020"}, {"Unnamed: 0": 218376, "autor": "bullit2shot", "date": 1606835395000, "content": "Summarit 50mm f2.4 lens, spots on F11/F16 /!/ Hello!\n\nMy camera is the Leica CL. I have to Leica M adapter L. When I take a picture on for example F2.4, it's all clear. But when I go to F11/F16, I get dirt in the picture. See below. I Know it's not good in focus, but these black spots shows up.\n\nI've looked at the lens, but there is not a spot anywhere I can see. The sensor seems very clean to me also. With another lens, a L-mount sigma lens I don't have this problem, so somehow it is the lens itself.\n\nWhat could be the issue? Anyone heard this before?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hgwn571vcl261.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=cc6986e174e2367f4b0074d28ad0190d2b978a09", "link": "https://www.reddit.com/r/Leica/comments/k4mmdo/summarit_50mm_f24_lens_spots_on_f11f16/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "summarit 50mm f2.4 lens, -----> spots !!!  on f11/f16 /!/ hello!\n\nmy camera is the leica cl. i have to leica m adapter l. when i take a picture on for example f2.4, it's all clear. but when i go to f11/f16, i get dirt in the picture. see below. i know it's not good in focus, but these black spots shows up.\n\ni've looked at the lens, but there is not a spot anywhere i can see. the sensor seems very clean to me also. with another lens, a l-mount sigma lens i don't have this problem, so somehow it is the lens itself.\n\nwhat could be the issue? anyone heard this before?\n\n&amp;#x200b;\n\nhttps://preview.redd.it/hgwn571vcl261.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=cc6986e174e2367f4b0074d28ad0190d2b978a09", "sortedWord": "None", "identifyer": 12854, "year": "2020"}, {"Unnamed: 0": 218573, "autor": "IOverEditMyPhotos", "date": 1587439370000, "content": "Leica M4-2 Question /!/ I recently acquired a Leica M4-2and has a few questions about it. Unfortunately the inside has a few grey spots as seen [here](https://imgur.com/a/dZESYRP). I'm not there to see the camera in person as I'm away at training and am also unable to take any pictures with it right now.\n\nI was wondering if they would effect the picture quality and if it would be cheaper to simply get it replaced if it would or to part the camera out?", "link": "https://www.reddit.com/r/Leica/comments/g57n9a/leica_m42_question/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "leica m4-2 question /!/ i recently acquired a leica m4-2and has a few questions about it. unfortunately the inside has a few grey -----> spots !!!  as seen [here](https://imgur.com/a/dzesyrp). i'm not there to see the camera in person as i'm away at training and am also unable to take any pictures with it right now.\n\ni was wondering if they would effect the picture quality and if it would be cheaper to simply get it replaced if it would or to part the camera out?", "sortedWord": "None", "identifyer": 13054, "year": "2020"}], "name": "spotleica2020"}