{"interestingcomments": [{"Unnamed: 0": 181331, "autor": "w0ut", "date": 1611489158000, "content": "Love getting new gear but hung up on spending money on a Lightroom subscription /!/ It’s silly, I don’t mind spending money on lenses and trading them in when I find they are not a good fit and taking a bit of a loss.\n\nBut when it comes to getting a Lightroom subscription, the cheapskate in me awakens. It’s not really rational, I know. I guess the rubs comes from maybe using Lightroom 6 pretty casually just twice a month on average. But I’ll spend hours easily. So I’d spend maybe 1 or 2 euros an hour. Why even have this mental resistance?\n\nBut recently I have gone out on more photo walks, and I love watching how Nigel Danson on youtube doing his magic with neat things like range masks and local color adjustments. It does seem like Lightroom classic has advanced quite a bit since Lightroom 6.\n\nOn the other hand, another side of me enjoys just working with the limitations of older tech and still making it work. I have a soft spot for cameras that are a little outdated specs wise, but can produce great images still within their limits.\n\nHow do you guys handle this emotional turmoil?", "link": "https://www.reddit.com/r/Leica/comments/l3y36q/love_getting_new_gear_but_hung_up_on_spending/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "love getting new gear but hung up on spending money on a lightroom subscription /!/ it’s silly, i don’t mind spending money on lenses and trading them in when i find they are not a good fit and taking a bit of a loss.\n\nbut when it comes to getting a lightroom subscription, the cheapskate in me awakens. it’s not really rational, i know. i guess the rubs comes from maybe using lightroom 6 pretty casually just twice a month on average. but i’ll spend hours easily. so i’d spend maybe 1 or 2 euros an hour. why even have this mental resistance?\n\nbut recently i have gone out on more photo walks, and i love watching how nigel danson on youtube doing his magic with neat things like range masks and local color adjustments. it does seem like lightroom classic has advanced quite a bit since lightroom 6.\n\non the other hand, another side of me enjoys just working with the limitations of older tech and still making it work. i have a soft -----> spot !!!  for cameras that are a little outdated specs wise, but can produce great images still within their limits.\n\nhow do you guys handle this emotional turmoil?", "sortedWord": "None", "identifyer": 73842, "year": "2021"}, {"Unnamed: 0": 181369, "autor": "-ThewhiteDeath-", "date": 1617253645000, "content": "Anyone knows what this very small spot on my lens might be? Is the lens chipped or is it some kind of spot?", "link": "https://www.reddit.com/r/Leica/comments/mho4ew/anyone_knows_what_this_very_small_spot_on_my_lens/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone knows what this very small -----> spot !!!  on my lens might be? is the lens chipped or is it some kind of spot?", "sortedWord": "None", "identifyer": 73883, "year": "2021"}, {"Unnamed: 0": 181567, "autor": "davadam", "date": 1619792708000, "content": "1973 90mm Summicron wide open /!/ u/carljyu asked to see an example of my 1973 90mm Summicron isolating individual snowflakes – this is a crop of an M9 image, wide open, with focus on my daughter. \n\nInitially I thought the white spots behind my wife were on her back, or on the sensor, but no, it’s snowflakes in the plane of focus, crisp as heck. \n\nOh, Leica.", "link": "https://www.reddit.com/r/Leica/comments/n1uyks/1973_90mm_summicron_wide_open/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "1973 90mm summicron wide open /!/ u/carljyu asked to see an example of my 1973 90mm summicron isolating individual snowflakes – this is a crop of an m9 image, wide open, with focus on my daughter. \n\ninitially i thought the white -----> spots !!!  behind my wife were on her back, or on the sensor, but no, it’s snowflakes in the plane of focus, crisp as heck. \n\noh, leica.", "sortedWord": "None", "identifyer": 74085, "year": "2021"}, {"Unnamed: 0": 181603, "autor": "leica-curious", "date": 1619491363000, "content": "Is this acceptable for a new Leica M-A? /!/ I've wanted an M-A for years and was finally able to get one for myself. There were a couple of areas that caught my eye and I was wondering if this was acceptable for a new M-A? I realize these are \n\n1. Abrasions on the upper film rail guide\n2. Some sort of spots on the shutter curtain\n  * Center at the upper edge\n  * Upper edge to the right of the previous\n  * Lower right corner\n3. Scratch in base plate the interior coating", "link": "https://www.reddit.com/r/Leica/comments/mzeoni/is_this_acceptable_for_a_new_leica_ma/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is this acceptable for a new leica m-a? /!/ i've wanted an m-a for years and was finally able to get one for myself. there were a couple of areas that caught my eye and i was wondering if this was acceptable for a new m-a? i realize these are \n\n1. abrasions on the upper film rail guide\n2. some sort of -----> spots !!!  on the shutter curtain\n  * center at the upper edge\n  * upper edge to the right of the previous\n  * lower right corner\n3. scratch in base plate the interior coating", "sortedWord": "None", "identifyer": 74121, "year": "2021"}, {"Unnamed: 0": 181649, "autor": "lensfog", "date": 1622555357000, "content": "I like my money, but i also like a 50mm for my Leica M Mount camera /!/ I like my money, but i also like a 50mm for my Leica M Mount camera. Looking for something in the next months. I will sell another lens to fund it. Would the Voigtländer Heliar 50/3.5 be a good bet ?\n\nI mostly do landscape and night shots. Not into \"analog pixel piping\", even tho I can spot a disgustingly unsharp lens.", "link": "https://www.reddit.com/r/Leica/comments/npuh69/i_like_my_money_but_i_also_like_a_50mm_for_my/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i like my money, but i also like a 50mm for my leica m mount camera /!/ i like my money, but i also like a 50mm for my leica m mount camera. looking for something in the next months. i will sell another lens to fund it. would the voigtländer heliar 50/3.5 be a good bet ?\n\ni mostly do landscape and night shots. not into \"analog pixel piping\", even tho i can -----> spot !!!  a disgustingly unsharp lens.", "sortedWord": "None", "identifyer": 74167, "year": "2021"}, {"Unnamed: 0": 181764, "autor": "MarthaFarcuss", "date": 1624994893000, "content": "Spotted while watching Curb. Jeff Garlin's a Leica guy", "link": "https://www.reddit.com/r/Leica/comments/oafedx/spotted_while_watching_curb_jeff_garlins_a_leica/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  while watching curb. jeff garlin's a leica guy", "sortedWord": "None", "identifyer": 74283, "year": "2021"}, {"Unnamed: 0": 181765, "autor": "MarthaFarcuss", "date": 1624994768000, "content": "Spotted while watching Curb. Jeff Garlin is a Leica guy", "link": "https://www.reddit.com/r/Leica/comments/oafbq8/spotted_while_watching_curb_jeff_garlin_is_a/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  while watching curb. jeff garlin is a leica guy", "sortedWord": "None", "identifyer": 74285, "year": "2021"}, {"Unnamed: 0": 181900, "autor": "trave1ler", "date": 1627158758000, "content": "Dust, please help /!/ Dear fellow LeicaMen, I have Leica m10monochrom and m10P, on both I tend to change the lenses couple of times a day but with as much caution as possible. However, dust still seems to go on my sensor as in every photo above 5.6F I notice dark spots. Is there a solution to this? Do you clean your sensors yourself? How often do you clean them? Thank you so much for your help!", "link": "https://www.reddit.com/r/Leica/comments/oqxmlj/dust_please_help/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dust, please help /!/ dear fellow leicamen, i have leica m10monochrom and m10p, on both i tend to change the lenses couple of times a day but with as much caution as possible. however, dust still seems to go on my sensor as in every photo above 5.6f i notice dark -----> spots !!! . is there a solution to this? do you clean your sensors yourself? how often do you clean them? thank you so much for your help!", "sortedWord": "None", "identifyer": 74421, "year": "2021"}, {"Unnamed: 0": 182061, "autor": "UselessAsUsual", "date": 1630269698000, "content": "Spotted the other day…", "link": "https://www.reddit.com/r/Leica/comments/pe3aha/spotted_the_other_day/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  the other day…", "sortedWord": "None", "identifyer": 74584, "year": "2021"}, {"Unnamed: 0": 182119, "autor": "Milleniador", "date": 1629562388000, "content": "Sometimes a leopard does change its spots.. Thought I'd join the M2 gang. I went looking for an MD. Came away with a rather nice M2 and Elmar 50mm 2.8", "link": "https://www.reddit.com/r/Leica/comments/p8u7un/sometimes_a_leopard_does_change_its_spots_thought/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sometimes a leopard does change its -----> spots !!! .. thought i'd join the m2 gang. i went looking for an md. came away with a rather nice m2 and elmar 50mm 2.8", "sortedWord": "None", "identifyer": 74642, "year": "2021"}, {"Unnamed: 0": 182120, "autor": "ComPanda", "date": 1629532591000, "content": "Compatible D-Lux 6 Batteries &amp; Chargers and Where to Buy? /!/ I got a fairly decent deal on a new D-Lux 6, with the downside being no charger and one drained battery. I found only a couple of sellers on Amazon and they weren't available via Prime. I've read that it's just a rebranded Panasonic LX7, so will those batteries/chargers work? Also, where are people getting their batteries, etc from? I wouldn't mind throwing my money at some smaller mom &amp; pop e-commerce spots, so please let me know! Thanks!", "link": "https://www.reddit.com/r/Leica/comments/p8nhv8/compatible_dlux_6_batteries_chargers_and_where_to/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "compatible d-lux 6 batteries &amp; chargers and where to buy? /!/ i got a fairly decent deal on a new d-lux 6, with the downside being no charger and one drained battery. i found only a couple of sellers on amazon and they weren't available via prime. i've read that it's just a rebranded panasonic lx7, so will those batteries/chargers work? also, where are people getting their batteries, etc from? i wouldn't mind throwing my money at some smaller mom &amp; pop e-commerce -----> spots !!! , so please let me know! thanks!", "sortedWord": "None", "identifyer": 74643, "year": "2021"}, {"Unnamed: 0": 182155, "autor": "k-woodz", "date": 1635517919000, "content": "Leica M6 Corrosion - Is it purely cosmetic? What are the chances of it effecting function? /!/ I am looking at an early M6 with a good bit of corrosion on the top. Some of it coming through the paint. Most of the spots are maybe 1-2 mm in diameter, but it spans most of the top plate. Assuming this is a really early M6 and the issue hasn't chewed through the top plate after 30+ years, is it safe to assume it prob won't progress much further?", "link": "https://www.reddit.com/r/Leica/comments/qie5bq/leica_m6_corrosion_is_it_purely_cosmetic_what_are/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "leica m6 corrosion - is it purely cosmetic? what are the chances of it effecting function? /!/ i am looking at an early m6 with a good bit of corrosion on the top. some of it coming through the paint. most of the -----> spots !!!  are maybe 1-2 mm in diameter, but it spans most of the top plate. assuming this is a really early m6 and the issue hasn't chewed through the top plate after 30+ years, is it safe to assume it prob won't progress much further?", "sortedWord": "None", "identifyer": 74678, "year": "2021"}, {"Unnamed: 0": 182162, "autor": "shopping_s_mart", "date": 1635468322000, "content": "Leica Ig (with slow dial) in Blood: The Last Vampire /!/ This post may not make the cut for this forum, but I still wanted to share it since it is nearly Halloween. Recently I was re-watching the 2000 anime movie \"Blood: The Last Vampire\" when I spotted this Leica Ig the American agent was using early in the movie. The story is set around Halloween at the American Yokota Air Base in 1966. With the Leica Ig being made between 1957-1960 for copy and scientific purposes, I love how the movie makers did a little research to use an type of camera accurate for the time period. \n\n[Leica Ig \\(with slow dial\\) in Blood: The Last Vampire](https://preview.redd.it/oum8vgfcdaw71.jpg?width=1570&amp;format=pjpg&amp;auto=webp&amp;s=d94b295b912f5de7e49de04849513aab575ad988)", "link": "https://www.reddit.com/r/Leica/comments/qi0siw/leica_ig_with_slow_dial_in_blood_the_last_vampire/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "leica ig (with slow dial) in blood: the last vampire /!/ this post may not make the cut for this forum, but i still wanted to share it since it is nearly halloween. recently i was re-watching the 2000 anime movie \"blood: the last vampire\" when i -----> spotted !!!  this leica ig the american agent was using early in the movie. the story is set around halloween at the american yokota air base in 1966. with the leica ig being made between 1957-1960 for copy and scientific purposes, i love how the movie makers did a little research to use an type of camera accurate for the time period. \n\n[leica ig \\(with slow dial\\) in blood: the last vampire](https://preview.redd.it/oum8vgfcdaw71.jpg?width=1570&amp;format=pjpg&amp;auto=webp&amp;s=d94b295b912f5de7e49de04849513aab575ad988)", "sortedWord": "None", "identifyer": 74685, "year": "2021"}, {"Unnamed: 0": 182281, "autor": "demitraleica", "date": 1610160135000, "content": "I tried the Leica M5 for the first time ! /!/ I used to hate on the Leica M5 aesthetics.  I own a collection of M bodies, m2,m3,m4,m6 and an MP. and never thought of even including an M5 in my collection.....but today I got a hold of one in-person and used it.\n\nNow I understand why people love it. It has an amazing ergonomics, (big shuter dial and ISO selection on the top plate) , It has a spot meter that allows you to see the shutter and the metered reading, You can use it w/out taking your eye off the viewfinder. It's solid brass. It's an amazing camera to use! no question! - maybe even better than all the other analog M bodies.  It's so underrated.  I want one now!!!!\n\n[Leica M5 \\(3-lug\\) paired with Zeiss ZM 28mm 2.8](https://preview.redd.it/rrr1dfqvv7a61.png?width=2084&amp;format=png&amp;auto=webp&amp;s=d008d264892b29b5b840cd492c8dbf079f59bcad)", "link": "https://www.reddit.com/r/Leica/comments/kti51l/i_tried_the_leica_m5_for_the_first_time/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i tried the leica m5 for the first time ! /!/ i used to hate on the leica m5 aesthetics.  i own a collection of m bodies, m2,m3,m4,m6 and an mp. and never thought of even including an m5 in my collection.....but today i got a hold of one in-person and used it.\n\nnow i understand why people love it. it has an amazing ergonomics, (big shuter dial and iso selection on the top plate) , it has a -----> spot !!!  meter that allows you to see the shutter and the metered reading, you can use it w/out taking your eye off the viewfinder. it's solid brass. it's an amazing camera to use! no question! - maybe even better than all the other analog m bodies.  it's so underrated.  i want one now!!!!\n\n[leica m5 \\(3-lug\\) paired with zeiss zm 28mm 2.8](https://preview.redd.it/rrr1dfqvv7a61.png?width=2084&amp;format=png&amp;auto=webp&amp;s=d008d264892b29b5b840cd492c8dbf079f59bcad)", "sortedWord": "None", "identifyer": 74804, "year": "2021"}, {"Unnamed: 0": 182565, "autor": "therealalanwatts", "date": 1611183061000, "content": "Selling my Q2 for an M10 - change my mind /!/ Before I pull the trigger, I figured I would get the thoughts of this fantastic community. Here are the facts, to start.  \n\n\n* I shoot mostly landscapes, lifestyle, portraits, family, and models. My favorite time to shoot is when traveling.\n* Q2 was my first Leica, it's about a year old now and mint. I absolutely love the camera but I feel desire more versatility by having an interchangeable lens camera.\n* I mostly shoot film as I find joy in moving slowly with photography. \n* I am also, without a doubt, picking up an M6. This is one of the main reasons to switch from the Q2 to the M10 so that I could use the glass across both systems.\n* I am new to rangefinders and am nowhere through the learning curve with my Mamiya 7. They're growing on me, but I do find composition more difficult than shooting with an SLR. I will be sad to say goodbye to the amazing EVF on the Q2.\n* I don't feel I need the M10-R because 40mp is not important to me. Same with the Q2, I won't miss the 47mp too much because I'll be able to go between a 28, 35, and 50 on my M10 and I don't feel the added resolution is important since I am mostly making small prints or zines. Many times in post I will add grain to my digital photos since I like the more vintage and nostalgic look.\n* I plan to start with Voigtlander glass and upgrade to Leica glass over the next few years. I intend to pick up a 35mm and 50mm\n* I don't see the added value of the M10-P over the M10. I won't use the touch screen much and am not doing intense street photography where I need to be more discrete.\n* Leica in Los Angeles has an M10 for $5,000 and I think I could sell my Q2 for something close to that, making it a pretty simple financial decision.\n\nI suppose my only worry is that I will miss the simplicity and \"all-in-oneness\" (fixed lens, EVF, autofocus, weather seal) of the Q2. At the same time, I think the M10 will help me elevate my photography by moving to a system with more choices.\n\nI understand I have essentially already made my decision but I value the opinion of the Leica + Reddit community and I've always found value in sharing my opinion with others in order to put my blind spots in check. Additional information and opinions can help to make sure I am not missing anything. \n\nAdditionally, it's always nice to hear encouragement from others who maybe have made a similar decision or just love their M10! Lastly, if you're curious about purchasing the Q2, just message me.", "link": "https://www.reddit.com/r/Leica/comments/l1kovf/selling_my_q2_for_an_m10_change_my_mind/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "selling my q2 for an m10 - change my mind /!/ before i pull the trigger, i figured i would get the thoughts of this fantastic community. here are the facts, to start.  \n\n\n* i shoot mostly landscapes, lifestyle, portraits, family, and models. my favorite time to shoot is when traveling.\n* q2 was my first leica, it's about a year old now and mint. i absolutely love the camera but i feel desire more versatility by having an interchangeable lens camera.\n* i mostly shoot film as i find joy in moving slowly with photography. \n* i am also, without a doubt, picking up an m6. this is one of the main reasons to switch from the q2 to the m10 so that i could use the glass across both systems.\n* i am new to rangefinders and am nowhere through the learning curve with my mamiya 7. they're growing on me, but i do find composition more difficult than shooting with an slr. i will be sad to say goodbye to the amazing evf on the q2.\n* i don't feel i need the m10-r because 40mp is not important to me. same with the q2, i won't miss the 47mp too much because i'll be able to go between a 28, 35, and 50 on my m10 and i don't feel the added resolution is important since i am mostly making small prints or zines. many times in post i will add grain to my digital photos since i like the more vintage and nostalgic look.\n* i plan to start with voigtlander glass and upgrade to leica glass over the next few years. i intend to pick up a 35mm and 50mm\n* i don't see the added value of the m10-p over the m10. i won't use the touch screen much and am not doing intense street photography where i need to be more discrete.\n* leica in los angeles has an m10 for $5,000 and i think i could sell my q2 for something close to that, making it a pretty simple financial decision.\n\ni suppose my only worry is that i will miss the simplicity and \"all-in-oneness\" (fixed lens, evf, autofocus, weather seal) of the q2. at the same time, i think the m10 will help me elevate my photography by moving to a system with more choices.\n\ni understand i have essentially already made my decision but i value the opinion of the leica + reddit community and i've always found value in sharing my opinion with others in order to put my blind -----> spots !!!  in check. additional information and opinions can help to make sure i am not missing anything. \n\nadditionally, it's always nice to hear encouragement from others who maybe have made a similar decision or just love their m10! lastly, if you're curious about purchasing the q2, just message me.", "sortedWord": "None", "identifyer": 75093, "year": "2021"}, {"Unnamed: 0": 182747, "autor": "sillo38", "date": 1619125837000, "content": "Best Place to Source Advance Lever /!/ Looking to buy a black chrome solid advance lever. Emailed a few spots and only found a silver one. I also emailed Leica through one of their contact channels for parts, but I'm guessing you need an account and they still haven't gotten back to me. \n\nAnybody have luck or know where I can find one? Thanks!", "link": "https://www.reddit.com/r/Leica/comments/mwexa3/best_place_to_source_advance_lever/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "best place to source advance lever /!/ looking to buy a black chrome solid advance lever. emailed a few -----> spots !!!  and only found a silver one. i also emailed leica through one of their contact channels for parts, but i'm guessing you need an account and they still haven't gotten back to me. \n\nanybody have luck or know where i can find one? thanks!", "sortedWord": "None", "identifyer": 75278, "year": "2021"}, {"Unnamed: 0": 183322, "autor": "TotteAnnerbrink", "date": 1631373508000, "content": "Gary Oldman and his wife? spotted with a Leica at Old Trafford in Manchester", "link": "https://www.reddit.com/r/Leica/comments/pm9944/gary_oldman_and_his_wife_spotted_with_a_leica_at/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "gary oldman and his wife? -----> spotted !!!  with a leica at old trafford in manchester", "sortedWord": "None", "identifyer": 75864, "year": "2021"}, {"Unnamed: 0": 183423, "autor": "XitzpatX", "date": 1634577971000, "content": "Intermittent horizontal alignment problems with my M4 /!/ I got my M4 back from a cla about 5 months ago with no issue for a while but recently the rangefinder doesn’t hit infinity from time to time with a varying amount of distance. Sometimes it’s spot on other times it’s just a hair off then other times it’s waaayyy off. Is there any reason why the calibration is always changing?", "link": "https://www.reddit.com/r/Leica/comments/qarfnf/intermittent_horizontal_alignment_problems_with/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "intermittent horizontal alignment problems with my m4 /!/ i got my m4 back from a cla about 5 months ago with no issue for a while but recently the rangefinder doesn’t hit infinity from time to time with a varying amount of distance. sometimes it’s -----> spot !!!  on other times it’s just a hair off then other times it’s waaayyy off. is there any reason why the calibration is always changing?", "sortedWord": "None", "identifyer": 75965, "year": "2021"}, {"Unnamed: 0": 183442, "autor": "nintendo64lad", "date": 1634262541000, "content": "Elmar 5cm sharpness question /!/ Does anyone know where the sharpness ''sweet spot'' is for the aperture?", "link": "https://www.reddit.com/r/Leica/comments/q8dwtu/elmar_5cm_sharpness_question/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "elmar 5cm sharpness question /!/ does anyone know where the sharpness ''sweet -----> spot !!! '' is for the aperture?", "sortedWord": "None", "identifyer": 75984, "year": "2021"}, {"Unnamed: 0": 183451, "autor": "mixmasteralan", "date": 1634184980000, "content": "Leica M2 Upgrades/Modification during CLA /!/ Hi all, \n\nMy M2 is has some dark spots in the rangefinder patch and the advance lever is stiff. I'm about to send in my Leica M2 for a CLA and I wanted to ensure I take the opportunity to do all the recommended upgrades and modifications. \n\nWhat do you suggest?\n\nSome upgrades I was thinking about:\n\n* Change to a multi coated window to reduce flare. Not a viewfinder upgrade, just the window.\n* Upgrade to a larger rangefinder aperture. Basically, getting a larger window or mask in front of the viewfinder. ([https://www.dagcamera.com/store/p111/Aperture\\_for\\_M2\\_Rangefinder%2C\\_20%25\\_larger-\\_just\\_like\\_M4.-.html](https://www.dagcamera.com/store/p111/Aperture_for_M2_Rangefinder%2C_20%25_larger-_just_like_M4.-.html))\n\nThanks!", "link": "https://www.reddit.com/r/Leica/comments/q7s6hd/leica_m2_upgradesmodification_during_cla/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "leica m2 upgrades/modification during cla /!/ hi all, \n\nmy m2 is has some dark -----> spots !!!  in the rangefinder patch and the advance lever is stiff. i'm about to send in my leica m2 for a cla and i wanted to ensure i take the opportunity to do all the recommended upgrades and modifications. \n\nwhat do you suggest?\n\nsome upgrades i was thinking about:\n\n* change to a multi coated window to reduce flare. not a viewfinder upgrade, just the window.\n* upgrade to a larger rangefinder aperture. basically, getting a larger window or mask in front of the viewfinder. ([https://www.dagcamera.com/store/p111/aperture\\_for\\_m2\\_rangefinder%2c\\_20%25\\_larger-\\_just\\_like\\_m4.-.html](https://www.dagcamera.com/store/p111/aperture_for_m2_rangefinder%2c_20%25_larger-_just_like_m4.-.html))\n\nthanks!", "sortedWord": "None", "identifyer": 75993, "year": "2021"}, {"Unnamed: 0": 183797, "autor": "manateefourmation", "date": 1620699664000, "content": "White Balance and Color Science /!/ I expect this post to be controversial.  I recently purchased a Leica Q2.   My other cameras are a Canon 5D Mark IV and Sony A7 RIII and A9 II. \n\nI wanted a compact camera to take everywhere and after exhaustive research, settled on the Leica Q2. \n\nMy experience with the Leica has been suboptimal to date.  \n\nOn the positive side, the optics are amazing. \n\nHowever, I find the auto white balance to be one of the least accurate I have experienced.  And I appreciate a lot of people will reply that I should set the white balance manually.  In studio work, I will use Kelvin settings on cameras, but for my general everyday use, I have become used to auto white balance. \n\nThe Canon and Sony cameras have never disappointed and other than complex lighting situations (with multiple different light sources), I have found auto white balance to typically be spot on.  Yet the Leica seems to be the exception here - with inaccurate white balance in most situations.  It’s nothing I can’t fix in post in Lightroom or Photoshop, but it’s annoying.  \n\nThis leads me to the next issue.  It seems like the color science out of camera is really off.  It truly seems like if I was shooting to JPG, I would have a lot of inaccurate colors that would be hard to correct.\n\n My comparison is color processing in canon cameras and even the latest Sony cameras (and Sony has never been known for its great color science).   I shoot in RAW so most of this is correctable, but color science is a place where I would have expected Leica to shine. \n\nIs anyone else experiencing this?", "link": "https://www.reddit.com/r/Leica/comments/n9mlbo/white_balance_and_color_science/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "white balance and color science /!/ i expect this post to be controversial.  i recently purchased a leica q2.   my other cameras are a canon 5d mark iv and sony a7 riii and a9 ii. \n\ni wanted a compact camera to take everywhere and after exhaustive research, settled on the leica q2. \n\nmy experience with the leica has been suboptimal to date.  \n\non the positive side, the optics are amazing. \n\nhowever, i find the auto white balance to be one of the least accurate i have experienced.  and i appreciate a lot of people will reply that i should set the white balance manually.  in studio work, i will use kelvin settings on cameras, but for my general everyday use, i have become used to auto white balance. \n\nthe canon and sony cameras have never disappointed and other than complex lighting situations (with multiple different light sources), i have found auto white balance to typically be -----> spot !!!  on.  yet the leica seems to be the exception here - with inaccurate white balance in most situations.  it’s nothing i can’t fix in post in lightroom or photoshop, but it’s annoying.  \n\nthis leads me to the next issue.  it seems like the color science out of camera is really off.  it truly seems like if i was shooting to jpg, i would have a lot of inaccurate colors that would be hard to correct.\n\n my comparison is color processing in canon cameras and even the latest sony cameras (and sony has never been known for its great color science).   i shoot in raw so most of this is correctable, but color science is a place where i would have expected leica to shine. \n\nis anyone else experiencing this?", "sortedWord": "None", "identifyer": 76342, "year": "2021"}, {"Unnamed: 0": 183867, "autor": "COVID19MurderHornet", "date": 1620098849000, "content": "Spotted a Leica in this CNBC video", "link": "https://www.reddit.com/r/Leica/comments/n4eyds/spotted_a_leica_in_this_cnbc_video/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  a leica in this cnbc video", "sortedWord": "None", "identifyer": 76413, "year": "2021"}], "name": "spotleica2021"}