{"interestingcomments": [{"Unnamed: 0": 220300, "autor": "bob_jsus", "date": 1525265928000, "content": "Konica AR 50 1.4 and tips for non-rangefinder lenses on Leica M8? /!/ Hi there. I'm just wondering if anyone has any special tips for using non-rangefinder lenses on Leica rangefinders. I've come back to using rangefinders in recent years, having been lucky enough to get an M8 about 6 years ago. Not being minted, Ive mainly used a lovely old Canadian Leitz 28mm and the Minolta branded 35mm f2 M-Rokkor. It's the closest thing to a 50mm I've found that works nicely with the crop sensor. I'm super happy with these lenses and I love the quirks of the M8 (mine seems particularly quirky).\n\nThe issue is that recently I took the notion of finding a decent cheap fast 50. I like the idea f an old Canon, but I spotted a Konica AR 50mm f1.4 online and it was within my self-imposed lower price range, so I picked up it and an adaptor. The adaptor finally arrived yesterday and I put them together. I can handle the fact that it's now super nose-heavy and I love the signature of the lense at f1.4 ...the problem is you have to guess the focus. It utterly did *not* dawn on me what I had just done was to put an SLR lense on a rangefinder and I wouldn't have any feedback for focus, that I would have to guess the distance. At f1.4 that's a risky prospect indeed.\n\nAnyone here got any handy tips or tricks for doing this to this? I'm happy to play around with it (which was mainly the point). It wasn't an expensive mistake and it should be clear by now that I'm purely an enthusiast. If I'm missing a megathread with my request, I can repost there. Many thanks!", "link": "https://www.reddit.com/r/Leica/comments/8gh76e/konica_ar_50_14_and_tips_for_nonrangefinder/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "konica ar 50 1.4 and tips for non-rangefinder lenses on leica m8? /!/ hi there. i'm just wondering if anyone has any special tips for using non-rangefinder lenses on leica rangefinders. i've come back to using rangefinders in recent years, having been lucky enough to get an m8 about 6 years ago. not being minted, ive mainly used a lovely old canadian leitz 28mm and the minolta branded 35mm f2 m-rokkor. it's the closest thing to a 50mm i've found that works nicely with the crop sensor. i'm super happy with these lenses and i love the quirks of the m8 (mine seems particularly quirky).\n\nthe issue is that recently i took the notion of finding a decent cheap fast 50. i like the idea f an old canon, but i -----> spotted !!!  a konica ar 50mm f1.4 online and it was within my self-imposed lower price range, so i picked up it and an adaptor. the adaptor finally arrived yesterday and i put them together. i can handle the fact that it's now super nose-heavy and i love the signature of the lense at f1.4 ...the problem is you have to guess the focus. it utterly did *not* dawn on me what i had just done was to put an slr lense on a rangefinder and i wouldn't have any feedback for focus, that i would have to guess the distance. at f1.4 that's a risky prospect indeed.\n\nanyone here got any handy tips or tricks for doing this to this? i'm happy to play around with it (which was mainly the point). it wasn't an expensive mistake and it should be clear by now that i'm purely an enthusiast. if i'm missing a megathread with my request, i can repost there. many thanks!", "sortedWord": "None", "identifyer": 14819, "year": "2018"}, {"Unnamed: 0": 220380, "autor": "bsandwich", "date": 1528260138000, "content": "35 summicron woes /!/ Just received a 35 summicron from eBay and noticed a not-described spot of what looks like haze right in the dead center of the lens. I can only see it when I shine a flashlight through. Ugh I was so pumped for my dream lens. \n\nPlan is to run a test roll but my instinct is that it would be very difficult if not impossible for me to tell if the haze were affecting the image quality. \n\nShould I request a return as not described or just keep the lens and go for a CLA at some point in the future? Thanks for the guidance, this is my first serious lens purchase and I’m nervous about it.", "link": "https://www.reddit.com/r/Leica/comments/8oxt7d/35_summicron_woes/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "35 summicron woes /!/ just received a 35 summicron from ebay and noticed a not-described -----> spot !!!  of what looks like haze right in the dead center of the lens. i can only see it when i shine a flashlight through. ugh i was so pumped for my dream lens. \n\nplan is to run a test roll but my instinct is that it would be very difficult if not impossible for me to tell if the haze were affecting the image quality. \n\nshould i request a return as not described or just keep the lens and go for a cla at some point in the future? thanks for the guidance, this is my first serious lens purchase and i’m nervous about it.", "sortedWord": "None", "identifyer": 14900, "year": "2018"}, {"Unnamed: 0": 220445, "autor": "undercovercolour", "date": 1531420812000, "content": "Leica M6 - Grey Spot Issue (Advice Needed) /!/ Hi, I’m the proud own of a Leica M6 which I love, I use it more than my M240!\n\nUnfortunately, as a result I think that the grey ‘spot’ on the curtain has come away slightly. Has anyone else encountered this and will it cause my issue with the metering, providing it doesn’t come away completely? \n\nIt seems to have lifted slightly on each side of the spot.\n\nThank you in advance.", "link": "https://www.reddit.com/r/Leica/comments/8ycgmx/leica_m6_grey_spot_issue_advice_needed/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica m6 - grey -----> spot !!!  issue (advice needed) /!/ hi, i’m the proud own of a leica m6 which i love, i use it more than my m240!\n\nunfortunately, as a result i think that the grey ‘spot’ on the curtain has come away slightly. has anyone else encountered this and will it cause my issue with the metering, providing it doesn’t come away completely? \n\nit seems to have lifted slightly on each side of the spot.\n\nthank you in advance.", "sortedWord": "None", "identifyer": 14967, "year": "2018"}, {"Unnamed: 0": 220625, "autor": "bedrock22", "date": 1536952431000, "content": "Screw/thread mount lenses to M-mount adapter? /!/ Hey there! \n\nI'm generally new to Leica cameras and have been enjoying my experience using my new M262 with a 35 cron and 50 lux. Wonderful silky images! I'm now becoming interested in using vintage and art lenses I've spotted on Etsy and Ebay and elsewhere - and discovering many use screw/thread mounts. Does Leica manufacture an adapter to take the screw mount and fit it for the M-mount on my 262? Does anyone have experience with this, and using these vintage lenses with their digital M's? Any recommendations? Anything to look out for when scavenging for these unique lenses, and regards to what to expect when shooting with these lenses? Looking forward to your thoughts and advice!", "link": "https://www.reddit.com/r/Leica/comments/9fuw53/screwthread_mount_lenses_to_mmount_adapter/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "screw/thread mount lenses to m-mount adapter? /!/ hey there! \n\ni'm generally new to leica cameras and have been enjoying my experience using my new m262 with a 35 cron and 50 lux. wonderful silky images! i'm now becoming interested in using vintage and art lenses i've -----> spotted !!!  on etsy and ebay and elsewhere - and discovering many use screw/thread mounts. does leica manufacture an adapter to take the screw mount and fit it for the m-mount on my 262? does anyone have experience with this, and using these vintage lenses with their digital m's? any recommendations? anything to look out for when scavenging for these unique lenses, and regards to what to expect when shooting with these lenses? looking forward to your thoughts and advice!", "sortedWord": "None", "identifyer": 15148, "year": "2018"}], "name": "spotleica2018"}