{"interestingcomments": [{"Unnamed: 0": 181389, "autor": "nickelsack", "date": 1617152474000, "content": "I can't make my mind up about the M10R... /!/ I started with a Q then upgraded to the Q2. I thought it would be my 'forever camera' but I'm getting a bit tired of the wide lens so want to jump into the M system. I went to the Leica Store and compared the M10 to the M10R and loved the results coming off the R. I couldn't stomach the price tag so looked at a mint 240 M-P then at the M9, then a friend convinced me to go M10 then I thought about M10P and now with the Leica price jump happening in 2 days, I'm thinking M10R. But holy hell. That price tag. I've never spent this much dough on a still camera and just consider myself a very strong hobbyist. \n\n&amp;#x200B;\n\nConvince me not to buy an M10R.", "link": "https://www.reddit.com/r/Leica/comments/mgujp1/i_cant_make_my_mind_up_about_the_m10r/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i can't make my mind up about the m10r... /!/ i started with a q then upgraded to the q2. i thought it would be my 'forever camera' but i'm getting a bit tired of the wide lens so want to jump into the m system. i went to the leica store and compared the m10 to the m10r and loved the results coming off the r. i couldn't stomach the price -----> tag !!!  so looked at a mint 240 m-p then at the m9, then a friend convinced me to go m10 then i thought about m10p and now with the leica price jump happening in 2 days, i'm thinking m10r. but holy hell. that price tag. i've never spent this much dough on a still camera and just consider myself a very strong hobbyist. \n\n&amp;#x200b;\n\nconvince me not to buy an m10r.", "sortedWord": "None", "identifyer": 73903, "year": "2021"}, {"Unnamed: 0": 183127, "autor": "Rickythrow", "date": 1631342042000, "content": "Prospective shopper. How is tech support? /!/ Would you say that one part of the price tag covers customer service?\n\nI notice on the website that you get 2 years of warranty when you buy new. After those 2 years, or if I somehow break something before then, how is technical support?\n\nIn other words, how long does Leica carry parts for their camera lineup? If I buy, say, an M10-R today, how realistic would it be to get repairs at authorized shops 10+ years down the line?", "link": "https://www.reddit.com/r/Leica/comments/pm2a13/prospective_shopper_how_is_tech_support/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "prospective shopper. how is tech support? /!/ would you say that one part of the price -----> tag !!!  covers customer service?\n\ni notice on the website that you get 2 years of warranty when you buy new. after those 2 years, or if i somehow break something before then, how is technical support?\n\nin other words, how long does leica carry parts for their camera lineup? if i buy, say, an m10-r today, how realistic would it be to get repairs at authorized shops 10+ years down the line?", "sortedWord": "None", "identifyer": 75665, "year": "2021"}, {"Unnamed: 0": 183766, "autor": "Shacnifesto", "date": 1617591953000, "content": "Making the first Leica purchase, how does black chrome finish age? /!/ Been drooling over a Leica for years but never made the move. Now I finally made my mind to gift myself a Leica to amend some hardship thru the past year. and oh man I regret much. I haven't been paying attention to how used markets got jacked up so bad. \n\nI originally wanted an M3, but later been drooling over M6. Now a nice condition M6 has a whopping $3500 price tag. I might be insane, but honestly, I would rather pay the premium and just go for a brand new M-A. What u think? \n\nI need help with the 'color' choice too. I know the black paint might wear and show the brassy look underneath. What about the black chrome? How do the finish age? If I am going for M-A, is silver chrome the better choice compared with black chrome?  (silver MP and black chrome M-A in stock only, which means they are less undesirable I guess? )\n\nAny suggestions would help. thanks!", "link": "https://www.reddit.com/r/Leica/comments/mkbalh/making_the_first_leica_purchase_how_does_black/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "making the first leica purchase, how does black chrome finish age? /!/ been drooling over a leica for years but never made the move. now i finally made my mind to gift myself a leica to amend some hardship thru the past year. and oh man i regret much. i haven't been paying attention to how used markets got jacked up so bad. \n\ni originally wanted an m3, but later been drooling over m6. now a nice condition m6 has a whopping $3500 price -----> tag !!! . i might be insane, but honestly, i would rather pay the premium and just go for a brand new m-a. what u think? \n\ni need help with the 'color' choice too. i know the black paint might wear and show the brassy look underneath. what about the black chrome? how do the finish age? if i am going for m-a, is silver chrome the better choice compared with black chrome?  (silver mp and black chrome m-a in stock only, which means they are less undesirable i guess? )\n\nany suggestions would help. thanks!", "sortedWord": "None", "identifyer": 76311, "year": "2021"}], "name": "tagleica2021"}