{"interestingcomments": [{"Unnamed: 0": 322426, "autor": "Sui2020", "date": 1609794679000, "content": "How much should I expect to pay for landscaping? How much of it could I do myself? (HOA) /!/ Hello, I bought a new construction home on a dirt lot (no sod included) with an HOA. The landscaping requirements listed do not specifically mention that you must pay a licensed contractor. I am pretty frugal and like to do things myself (within reason). I planned on hiring someone to do the grading of the lot as I expect this requires a bulldozer or some non-standard tool. Afterwards, I would drop down my edging and landscaping fabric all along where I do not want sod. I would hire someone to install sprinkles and sod (or could I do this myself?) Unfortunately HOA requires sprinklers so some sod is required. \n\nI was looking for advice. Has anyone been in a similar situation with an HOA? I have to submit a landscape design by the end of this month. Should I contact a landscape company first? Or submit my design and figure out who I'm hiring when spring comes?", "link": "https://www.reddit.com/r/landscaping/comments/kqi28n/how_much_should_i_expect_to_pay_for_landscaping/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "how much should i expect to pay for landscaping? how much of it could i do myself? (hoa) /!/ hello, i bought a new construction home on a dirt lot (no sod included) with an hoa. the landscaping requirements listed do not specifically mention that you must pay a licensed contractor. i am pretty frugal and like to do things myself (within reason). i planned on hiring someone to do the grading of the lot as i expect this requires a bulldozer or some non-standard tool. afterwards, i would drop down my edging and landscaping fabric all along where i do not want sod. i would hire someone to install sprinkles and sod (or could i do this myself?) unfortunately hoa requires sprinklers so some sod is required. \n\ni was looking for advice. has anyone been in a similar situation with an hoa? i have to submit a landscape design by the end of this month. should i contact a landscape company first? or submit -----> my !!!  -----> design !!!  and figure out who i'm hiring when spring comes?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/kqi28n/how_much_should_i_expect_to_pay_for_landscaping/", "identifyer": 322426, "year": "2021"}], "name": "designlandscaping2021"}