{"interestingcomments": [{"Unnamed: 0": 322224, "autor": "Eladkatz", "date": 1615665803000, "content": "How to DIY a living hedge on the cheap /!/ Hi there,\n\nI recently bought a house in PA and would like to plant some trees to create a hedge.\n\nFrom my limited research, I've found that Juniper trees are indigenous to the area and will grow well.\n\nHowever, I don't know where to start with this project so I'd love any help you can offer\n\nI am fairly handy and can use power tools but I think that given the size of the land, we're going to need to plant upwards of 20 trees, in fairly rocky ground so I don't know if a spade and a pick are the right tools for the job.\n\nI've started researching Augers as an alternative, but am not sure which one to get, if I should buy or rent or if there's a better alternative altogether.\n\n&amp;#x200B;\n\nI'm a complete novice in everything garden, I've never owned a home, let alone a garden, so this is all new to me, but I'm pretty broke after this purchase and would really love any cost saving tips :\n\nWhere can I buy trees in bulk that are cheap, what's the best size to get the trees at, what do I need to set up in terms of watering them, what is the preferred way to plant them (time of year, distance, etc), which trees/plants make the most sense to buy, etc\n\n&amp;#x200B;\n\nYou help is very appreciated!!", "link": "https://www.reddit.com/r/landscaping/comments/m4e48f/how_to_diy_a_living_hedge_on_the_cheap/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to -----> diy !!!  a living hedge on the cheap /!/ hi there,\n\ni recently bought a house in pa and would like to plant some trees to create a hedge.\n\nfrom my limited research, i've found that juniper trees are indigenous to the area and will grow well.\n\nhowever, i don't know where to start with this project so i'd love any help you can offer\n\ni am fairly handy and can use power tools but i think that given the size of the land, we're going to need to plant upwards of 20 trees, in fairly rocky ground so i don't know if a spade and a pick are the right tools for the job.\n\ni've started researching augers as an alternative, but am not sure which one to get, if i should buy or rent or if there's a better alternative altogether.\n\n&amp;#x200b;\n\ni'm a complete novice in everything garden, i've never owned a home, let alone a garden, so this is all new to me, but i'm pretty broke after this purchase and would really love any cost saving tips :\n\nwhere can i buy trees in bulk that are cheap, what's the best size to get the trees at, what do i need to set up in terms of watering them, what is the preferred way to plant them (time of year, distance, etc), which trees/plants make the most sense to buy, etc\n\n&amp;#x200b;\n\nyou help is very appreciated!!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/m4e48f/how_to_diy_a_living_hedge_on_the_cheap/", "identifyer": 322224, "year": "2021"}, {"Unnamed: 0": 323892, "autor": "mrbillismadeofclay", "date": 1628807954000, "content": "Best self service / DIY repair lawnmower /!/ I'm in the market for a new lawnmower.  My lot is 1/4 acre so maybe 5000-6000 square feet of grass.  I'd like a walk/push mower, gas powered.\n\nI'd like to service and repair the mower myself, so I'll need a manufacturer who provides all the documentation and will sell parts  to me.\n\nAny suggestions would be appreciated!", "link": "https://www.reddit.com/r/landscaping/comments/p3aouw/best_self_service_diy_repair_lawnmower/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best self service / -----> diy !!!  repair lawnmower /!/ i'm in the market for a new lawnmower.  my lot is 1/4 acre so maybe 5000-6000 square feet of grass.  i'd like a walk/push mower, gas powered.\n\ni'd like to service and repair the mower myself, so i'll need a manufacturer who provides all the documentation and will sell parts  to me.\n\nany suggestions would be appreciated!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/p3aouw/best_self_service_diy_repair_lawnmower/", "identifyer": 323892, "year": "2021"}, {"Unnamed: 0": 327684, "autor": "grumble11", "date": 1621384045000, "content": "A Non-Toxic animal repellent for ornamentals! /!/ I’ve been having a hard time finding something that was easy to apply and would keep animals from eating my ornamental plants. My hostess were getting eaten, my shrubs demolished, and generally I’ve been having a bad time with rabbits.\n\nI looked into a number of options, and tried a few - scattering blood meal, over the counter sprays, etc.\n\nThere are a few formulations that work. I wanted to share the one I use. I wanted something non-toxic that would last a while.\n\nSo first buy denatonium benzoate off eBay - this is non toxic and harmless, but extremely bitter. Legendary bitter. It is the most bitter substance on earth. A few grams will do it.\n\nNext buy a spreader sticker from a garden store. A few ounces will do it.\n\nNow (outside) mix up a gallon of water, a tablespoon or so of sticker, and a gram of denatonium (more or less) in a garden sprayer (which is all you’ll use this sprayer for from now on). Wear a mask (which we all have) and garden gloves because any denatonium powder on your face or hands will be harmless but not fun.\n\nNow spray it on your ornamentals. Do not spray it on anything you will eat because it will ruin the taste.\n\nThe sticker will make the denatonium cling to your plants and any animal that tries to eat it will be repelled by the taste and not return. It works, and it lasts. No smell, easy to apply, not toxic, works like a charm. Reapply on new growth. No more rabbit, deer or other mammal damage.\n\nAgain ornamentals only - do not spray at all on edibles, even overspray. You have been warned!\n\nAnyone else have any DIY tips?", "link": "https://www.reddit.com/r/landscaping/comments/nfqwpb/a_nontoxic_animal_repellent_for_ornamentals/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a non-toxic animal repellent for ornamentals! /!/ i’ve been having a hard time finding something that was easy to apply and would keep animals from eating my ornamental plants. my hostess were getting eaten, my shrubs demolished, and generally i’ve been having a bad time with rabbits.\n\ni looked into a number of options, and tried a few - scattering blood meal, over the counter sprays, etc.\n\nthere are a few formulations that work. i wanted to share the one i use. i wanted something non-toxic that would last a while.\n\nso first buy denatonium benzoate off ebay - this is non toxic and harmless, but extremely bitter. legendary bitter. it is the most bitter substance on earth. a few grams will do it.\n\nnext buy a spreader sticker from a garden store. a few ounces will do it.\n\nnow (outside) mix up a gallon of water, a tablespoon or so of sticker, and a gram of denatonium (more or less) in a garden sprayer (which is all you’ll use this sprayer for from now on). wear a mask (which we all have) and garden gloves because any denatonium powder on your face or hands will be harmless but not fun.\n\nnow spray it on your ornamentals. do not spray it on anything you will eat because it will ruin the taste.\n\nthe sticker will make the denatonium cling to your plants and any animal that tries to eat it will be repelled by the taste and not return. it works, and it lasts. no smell, easy to apply, not toxic, works like a charm. reapply on new growth. no more rabbit, deer or other mammal damage.\n\nagain ornamentals only - do not spray at all on edibles, even overspray. you have been warned!\n\nanyone else have any -----> diy !!!  tips?", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/nfqwpb/a_nontoxic_animal_repellent_for_ornamentals/", "identifyer": 327684, "year": "2021"}, {"Unnamed: 0": 328733, "autor": "KhyrosFinalCut", "date": 1624049115000, "content": "Evolution of an NYC Backyard /!/ &amp;#x200B;\n\n[When we Moved in,6 months ago Remnants of a once thoroughly curated garden with an oval path, plants inside and outside of the oval.](https://preview.redd.it/vapnmkj243671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=0a82bf8e1ccdd7cca701a83447d6c0be651b1470)\n\n&amp;#x200B;\n\n[Plants taken out of the center and significant cleanup, fence desperately in need of repair.](https://preview.redd.it/yjihwr8b43671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=9e0f4dc26cfee05f98fc1a148dcb3217ba80d876)\n\n&amp;#x200B;\n\n[Fence repaired, new posts in freshly poured concrete attached to the existing fenceposts. No new plants but a resurgence of life in the early spring. ](https://preview.redd.it/pnfzxbig43671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=c26c0c8744b7fe0e30ddeef7dce714a93e47e485)\n\n&amp;#x200B;\n\n[Some plants moved towards the edges to create a slightly more thoughtful garden, also dismantling the wood planter. Terrain Leveled and most of the rocks removed. ](https://preview.redd.it/ywe98bmr43671.jpg?width=9248&amp;format=pjpg&amp;auto=webp&amp;s=93e15e43afde4c9f650629175c3deadda03e598c)\n\n&amp;#x200B;\n\n[4 6.5'x 10' Turf pieces Staked down over leveled terrain and outdoor furniture added. ](https://preview.redd.it/m7guqwy253671.jpg?width=6936&amp;format=pjpg&amp;auto=webp&amp;s=b8489e264b1eed3c1bec86ff400ff643a3c1f7e0)\n\nMostly DIY, Cost all in of materials, furniture, tools, turf, garbage haul-off for all the boxes and some things like wood and rocks,, and 1 day of labor for someone pro moving the plants. \\~$2300. The high end of what I would consider spending for a place I'm renting.\n\nNot sure if we're going to get another strip of turf to even out the back or leave it uneven as space for a grill or similar that isn't right on the turf. \n\nThoughts? should we have done gravel or gardening cloth before we put down the turf?", "link": "https://www.reddit.com/r/landscaping/comments/o2ztlb/evolution_of_an_nyc_backyard/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "evolution of an nyc backyard /!/ &amp;#x200b;\n\n[when we moved in,6 months ago remnants of a once thoroughly curated garden with an oval path, plants inside and outside of the oval.](https://preview.redd.it/vapnmkj243671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=0a82bf8e1ccdd7cca701a83447d6c0be651b1470)\n\n&amp;#x200b;\n\n[plants taken out of the center and significant cleanup, fence desperately in need of repair.](https://preview.redd.it/yjihwr8b43671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=9e0f4dc26cfee05f98fc1a148dcb3217ba80d876)\n\n&amp;#x200b;\n\n[fence repaired, new posts in freshly poured concrete attached to the existing fenceposts. no new plants but a resurgence of life in the early spring. ](https://preview.redd.it/pnfzxbig43671.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=c26c0c8744b7fe0e30ddeef7dce714a93e47e485)\n\n&amp;#x200b;\n\n[some plants moved towards the edges to create a slightly more thoughtful garden, also dismantling the wood planter. terrain leveled and most of the rocks removed. ](https://preview.redd.it/ywe98bmr43671.jpg?width=9248&amp;format=pjpg&amp;auto=webp&amp;s=93e15e43afde4c9f650629175c3deadda03e598c)\n\n&amp;#x200b;\n\n[4 6.5'x 10' turf pieces staked down over leveled terrain and outdoor furniture added. ](https://preview.redd.it/m7guqwy253671.jpg?width=6936&amp;format=pjpg&amp;auto=webp&amp;s=b8489e264b1eed3c1bec86ff400ff643a3c1f7e0)\n\nmostly -----> diy !!! , cost all in of materials, furniture, tools, turf, garbage haul-off for all the boxes and some things like wood and rocks,, and 1 day of labor for someone pro moving the plants. \\~$2300. the high end of what i would consider spending for a place i'm renting.\n\nnot sure if we're going to get another strip of turf to even out the back or leave it uneven as space for a grill or similar that isn't right on the turf. \n\nthoughts? should we have done gravel or gardening cloth before we put down the turf?", "sortedWord": "None", "removed": null, "score": 2, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/o2ztlb/evolution_of_an_nyc_backyard/", "identifyer": 328733, "year": "2021"}, {"Unnamed: 0": 331633, "autor": "Schmitzen", "date": 1623812940000, "content": "Riding mower belt is kaput. Is this a DIY fix? Looking for a prognosis. Thank you🙏", "link": "https://www.reddit.com/r/landscaping/comments/o0vb9m/riding_mower_belt_is_kaput_is_this_a_diy_fix/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "riding mower belt is kaput. is this a -----> diy !!!  fix? looking for a prognosis. thank you🙏", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/gallery/o0vb9m", "identifyer": 331633, "year": "2021"}], "name": "diylandscaping2021"}