{"interestingcomments": [{"Unnamed: 0": 325317, "autor": "whistlerbrk", "date": 1613335611000, "content": "Bought a house, need to come up with a plan /!/ I bought a home in central NJ. We take occupancy April 1.\n\nLet me describe the property, tell you what I'm thinking, an idea of the budget and timeline, and I'd really love to hear anything anyone's got to say.\n\nhttps://imgur.com/a/rxSQKn9 &lt;-- or just click here\n\nI've got 3/4s of an acre on a typical mid-80s NJ suburb development cul de sac. It's a center hall brick colonial. The lot is quite (\"pancake\" as the realtor would say) flat. Driveway is adjacent the left property line, leading midway to a two door garage. The house is setback 75' feet from the curb and the lot is about 143' wide. Note that we have a drainage easement on the right and rear of the property. 25' in from the right side the easement starts and goes straight back. Similarly the rear 30' feet is easement as well. I'm hoping I can do something with this area on the rear of the property, but obviously nothing that can't be ripped up.\n\nIn the front the driveway comes in from the left of the property, with little to no space against that property line. It leads up to a two door attached garage. The front is landscaped with a few mature trees. It has a weird \"island\" mound feature which I intend to remove over time. The rear is fence in entirely. On the fencing adjacent the dwelling with a white vinyl fence and then to the sides and back a chain link fence I'd like to replace. The rear is a nice little rectangle, again mostly flat except the rear-right which starts to slope down into a inlet which is part of the easement. There are today, two trees on the right easement. I mention this not as a problem but as something I'll need to workaround, I've no intention of knocking down mature trees on my property. Leading out from the dwelling on the rear is a fairly nice deck with a pergola on it, as well as an enclosed porch, porch leads down to a small paver area, then to the grass all around except to the right where a small out-of-ground hot tub is. In addition to the trees on the right I mentioned, there is a smaller one behind the garage. The rear easement has some small pines and various hedgey/bushy things I've not identified yet.\n\nAlright, that was a lot, here's what I'd like to do:\n\n* not mess up the existing 3 rose plants\n* care for an existing magnolia tree\n* add a small apple tree\n* add a patch for blueberries\n* not use pesticides\n* compost, seller already has the black plastic composting hexagon things, might make a stand for them\n* preference to local flora\n* add 2-3 raised beds for a vegetable garden, in an ergonomic fashion (not too low &amp; accessible on all sides).\n* large container garden for tomatoes &amp; herbs, I'd use the enclosed porch to keep perennials alive if possible e.g rosemary\n* keep room for a small pool, maybe _maybe_ not if it is going to eat up too much land\n* absolutely need a dedicated area for a fire pit area that can fit say 6-8 people comfortably\n* Replace the fence with wood or match the existing vinyl (don't love the vinyl, feels cheap but I understand they are very easy to maintain) with something that screens better for privacy, especially in the winter.\n* Use height in strategic areas to create privacy all around but let light in especially for vegetables and flowers\n* I make pizza, like to grill, will one day enjoy entertaining again\n\nGenerally I want to create \"spaces\" and privacy.\n\nGiven that I do not want to use pesticides and _lawn_ fertilizers I'm very open to ideas on the front yard, or if I just let it go its way and keep it neat enough. I adore tiny little wild flowers, I intend to sprinkle those seeds around all over areas with existing grass unless advised against.\n\nBudget &amp; Timeline:\n* 5-7 seasons to get it to where I want it to be\n* I'm willing to put in the time some of the labor and craftsmanship and money. All of that slowly. I can save around $5-8k a year improving everything. We'll keep a separate budget for _maybe_ a _very small_ in-ground natural pool.\n\nExperience\n* I'm fairly handy but not a professional certainly not a landscaper. I'm pretty strong though but need to go slow cause of my back.\n* I'm a mediocre gardener, I can grow tomatoes and herbs well in pots basically. I'm going to have to learn a lot.\n* I'm happy using power tools but I'm likely not leveling &amp; tamping and laying paver stone myself.\n\nI would trust myself to do a good and very slow job putting together a raised garden bed and \"fancier\" versions of them (self watering e.g) including stuff like putting in a liner, a PVC pipe / french drain, gravel, etc. I'm fairly handy again but need instruction.\n\nAlright, that was a lot. I don't know how to plan this. I'd love to hear anything but I think I need to pay a professional to come up with options and a plan. How do I find that person and someone who is going to be accustomed to a more shall we say sustainable approach. Also worried that I won't be able to find someone because they'll want to additionally do the work / materials / labor / etc. What do y'all think?\n\nTL;DR https://imgur.com/a/rxSQKn9 want to re-fence, create privacy &amp; spaces, add a nice vegetable garden in rear, a fire pit, _maybe a pool_, and stop nuking the lawn with fertilizer and pesticides.", "link": "https://www.reddit.com/r/landscaping/comments/ljwzge/bought_a_house_need_to_come_up_with_a_plan/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "bought a house, need to -----> come !!!  -----> up !!!  -----> with !!!  a plan /!/ i bought a home in central nj. we take occupancy april 1.\n\nlet me describe the property, tell you what i'm thinking, an idea of the budget and timeline, and i'd really love to hear anything anyone's got to say.\n\nhttps://imgur.com/a/rxsqkn9 &lt;-- or just click here\n\ni've got 3/4s of an acre on a typical mid-80s nj suburb development cul de sac. it's a center hall brick colonial. the lot is quite (\"pancake\" as the realtor would say) flat. driveway is adjacent the left property line, leading midway to a two door garage. the house is setback 75' feet from the curb and the lot is about 143' wide. note that we have a drainage easement on the right and rear of the property. 25' in from the right side the easement starts and goes straight back. similarly the rear 30' feet is easement as well. i'm hoping i can do something with this area on the rear of the property, but obviously nothing that can't be ripped up.\n\nin the front the driveway comes in from the left of the property, with little to no space against that property line. it leads up to a two door attached garage. the front is landscaped with a few mature trees. it has a weird \"island\" mound feature which i intend to remove over time. the rear is fence in entirely. on the fencing adjacent the dwelling with a white vinyl fence and then to the sides and back a chain link fence i'd like to replace. the rear is a nice little rectangle, again mostly flat except the rear-right which starts to slope down into a inlet which is part of the easement. there are today, two trees on the right easement. i mention this not as a problem but as something i'll need to workaround, i've no intention of knocking down mature trees on my property. leading out from the dwelling on the rear is a fairly nice deck with a pergola on it, as well as an enclosed porch, porch leads down to a small paver area, then to the grass all around except to the right where a small out-of-ground hot tub is. in addition to the trees on the right i mentioned, there is a smaller one behind the garage. the rear easement has some small pines and various hedgey/bushy things i've not identified yet.\n\nalright, that was a lot, here's what i'd like to do:\n\n* not mess up the existing 3 rose plants\n* care for an existing magnolia tree\n* add a small apple tree\n* add a patch for blueberries\n* not use pesticides\n* compost, seller already has the black plastic composting hexagon things, might make a stand for them\n* preference to local flora\n* add 2-3 raised beds for a vegetable garden, in an ergonomic fashion (not too low &amp; accessible on all sides).\n* large container garden for tomatoes &amp; herbs, i'd use the enclosed porch to keep perennials alive if possible e.g rosemary\n* keep room for a small pool, maybe _maybe_ not if it is going to eat up too much land\n* absolutely need a dedicated area for a fire pit area that can fit say 6-8 people comfortably\n* replace the fence with wood or match the existing vinyl (don't love the vinyl, feels cheap but i understand they are very easy to maintain) with something that screens better for privacy, especially in the winter.\n* use height in strategic areas to create privacy all around but let light in especially for vegetables and flowers\n* i make pizza, like to grill, will one day enjoy entertaining again\n\ngenerally i want to create \"spaces\" and privacy.\n\ngiven that i do not want to use pesticides and _lawn_ fertilizers i'm very open to ideas on the front yard, or if i just let it go its way and keep it neat enough. i adore tiny little wild flowers, i intend to sprinkle those seeds around all over areas with existing grass unless advised against.\n\nbudget &amp; timeline:\n* 5-7 seasons to get it to where i want it to be\n* i'm willing to put in the time some of the labor and craftsmanship and money. all of that slowly. i can save around $5-8k a year improving everything. we'll keep a separate budget for _maybe_ a _very small_ in-ground natural pool.\n\nexperience\n* i'm fairly handy but not a professional certainly not a landscaper. i'm pretty strong though but need to go slow cause of my back.\n* i'm a mediocre gardener, i can grow tomatoes and herbs well in pots basically. i'm going to have to learn a lot.\n* i'm happy using power tools but i'm likely not leveling &amp; tamping and laying paver stone myself.\n\ni would trust myself to do a good and very slow job putting together a raised garden bed and \"fancier\" versions of them (self watering e.g) including stuff like putting in a liner, a pvc pipe / french drain, gravel, etc. i'm fairly handy again but need instruction.\n\nalright, that was a lot. i don't know how to plan this. i'd love to hear anything but i think i need to pay a professional to come up with options and a plan. how do i find that person and someone who is going to be accustomed to a more shall we say sustainable approach. also worried that i won't be able to find someone because they'll want to additionally do the work / materials / labor / etc. what do y'all think?\n\ntl;dr https://imgur.com/a/rxsqkn9 want to re-fence, create privacy &amp; spaces, add a nice vegetable garden in rear, a fire pit, _maybe a pool_, and stop nuking the lawn with fertilizer and pesticides.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/landscaping/comments/ljwzge/bought_a_house_need_to_come_up_with_a_plan/", "identifyer": 325317, "year": "2021"}, {"Unnamed: 0": 327377, "autor": "bebe_bird", "date": 1620607257000, "content": "New homeowner - landscaping suggestions? /!/ Hi all, I'm a new homeowner. We have a long,, skinny backyard (120ft x 50ft) that's almost a blank slate. Are there any good resources you've used to design your spaces, or does anyone have any good ideas for a long/skinny backyard?\n\nWhen we bought the house, we put in a fence just on the inside of the shrubs that grew along the property line (we have a dog, so the fence was a must have) and had to remove some plants from along the back. We basically have a blank slate - its shrubs along 120 ft of wire fence on the east (with a 30ft vegetable garden), then 50 ft of blank, sunny back fence (south side), and another 120 ft of new fence (west side - the back 50 ft or so gets sun). The only other features are a small deck off the house, and an enormous oak tree a little bit southeast of the deck that creates a lot of shade.\n\nBasically, I'm clueless and looking for ideas on how to come up with a landscaping design. I'd like to start doing small projects that won't break the bank, either myself or with our 3 person landscaper crew, but need to figure out what we want and how to come up with a design. There are simply too many possibilities, it's hard to visualize them all, and we're really not ready to spend a lot on the yard (saving up for a different big project). The main reason I've shied away from professional design services is because we want to work piecemeal.\n\nThe only thing I have decided is blackberry bushes are a must have, and I'm really uncertain as to where to plant them with the limited sun (along the back fence? Along the west fence, which potentially limits other \"features\" like a stone patio with surrounding planters?)\n\nAny good online tools that you've used? Any ideas for long and skinny yards? Any input on where to put a stone patio on a long skinny yard? Or just advice in general for someone completely new to this?\n\nTL;DR: New homeowner with close to a blank slate of a long skinny backyard with limited sunlight. Any resources or recommendations or online tools to point a newbie in the right direction?", "link": "https://www.reddit.com/r/landscaping/comments/n8rqmy/new_homeowner_landscaping_suggestions/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "new homeowner - landscaping suggestions? /!/ hi all, i'm a new homeowner. we have a long,, skinny backyard (120ft x 50ft) that's almost a blank slate. are there any good resources you've used to design your spaces, or does anyone have any good ideas for a long/skinny backyard?\n\nwhen we bought the house, we put in a fence just on the inside of the shrubs that grew along the property line (we have a dog, so the fence was a must have) and had to remove some plants from along the back. we basically have a blank slate - its shrubs along 120 ft of wire fence on the east (with a 30ft vegetable garden), then 50 ft of blank, sunny back fence (south side), and another 120 ft of new fence (west side - the back 50 ft or so gets sun). the only other features are a small deck off the house, and an enormous oak tree a little bit southeast of the deck that creates a lot of shade.\n\nbasically, i'm clueless and looking for ideas on how to -----> come !!!  -----> up !!!  -----> with !!!  a landscaping design. i'd like to start doing small projects that won't break the bank, either myself or with our 3 person landscaper crew, but need to figure out what we want and how to come up with a design. there are simply too many possibilities, it's hard to visualize them all, and we're really not ready to spend a lot on the yard (saving up for a different big project). the main reason i've shied away from professional design services is because we want to work piecemeal.\n\nthe only thing i have decided is blackberry bushes are a must have, and i'm really uncertain as to where to plant them with the limited sun (along the back fence? along the west fence, which potentially limits other \"features\" like a stone patio with surrounding planters?)\n\nany good online tools that you've used? any ideas for long and skinny yards? any input on where to put a stone patio on a long skinny yard? or just advice in general for someone completely new to this?\n\ntl;dr: new homeowner with close to a blank slate of a long skinny backyard with limited sunlight. any resources or recommendations or online tools to point a newbie in the right direction?", "sortedWord": "None", "removed": null, "score": 1, "comments": 17, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/n8rqmy/new_homeowner_landscaping_suggestions/", "identifyer": 327377, "year": "2021"}, {"Unnamed: 0": 327872, "autor": "guancharlie", "date": 1621457126000, "content": "Fixing the grade of my backyard SOS /!/ I recently decided to fix up my backyard.  It used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! The tree has since been removed.  For the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  It has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  So, I was tired of looking at this eyesore and so I took it upon myself to fix the slope of the backyard. \n\nI researched and know the basic steps I need to take to complete this task:\n\n1. Remove top layer\n2. Till the top soil\n3. Rake and even out grade of top soil\n4. Add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. Covering with sod\n\nUpon removing the top layer I've come into a problem:\n\nAlthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  As I dug and removed the top layer, I would come up with shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\nI have not finished removing the top layer, but I foresee that what I will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  My question is this:\n\n1. How will this affect my ability to till the soil using a till machine/ tool?\n2. How will this affect the laying of new sod?\n3. Do I have to remove all brick and stone in order to till?\n4. Should I seek professional help (It's only day 2 and my back is killing me)?   \n\nPlease, I am dying for some advice!!!!", "link": "https://www.reddit.com/r/landscaping/comments/nggkrz/fixing_the_grade_of_my_backyard_sos/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "fixing the grade of my backyard sos /!/ i recently decided to fix up my backyard.  it used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! the tree has since been removed.  for the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  it has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  so, i was tired of looking at this eyesore and so i took it upon myself to fix the slope of the backyard. \n\ni researched and know the basic steps i need to take to complete this task:\n\n1. remove top layer\n2. till the top soil\n3. rake and even out grade of top soil\n4. add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. covering with sod\n\nupon removing the top layer i've come into a problem:\n\nalthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  as i dug and removed the top layer, i would -----> come !!!  -----> up !!!  -----> with !!!  shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\ni have not finished removing the top layer, but i foresee that what i will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  my question is this:\n\n1. how will this affect my ability to till the soil using a till machine/ tool?\n2. how will this affect the laying of new sod?\n3. do i have to remove all brick and stone in order to till?\n4. should i seek professional help (it's only day 2 and my back is killing me)?   \n\nplease, i am dying for some advice!!!!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/nggkrz/fixing_the_grade_of_my_backyard_sos/", "identifyer": 327872, "year": "2021"}, {"Unnamed: 0": 330897, "autor": "guancharlie", "date": 1621447860000, "content": "Fixing grade of backyard... SOS /!/ I recently decided to fix up my backyard.  It used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! The tree has since been removed.  For the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  It has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  So, I was tired of looking at this eyesore and so I took it upon myself to fix the slope of the backyard. \n\nI researched and know the basic steps I need to take to complete this task:\n\n1. Remove top layer\n2. Till the top soil\n3. Rake and even out grade of top soil\n4. Add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. Covering with sod\n\nUpon removing the top layer I've come into a problem:\n\nAlthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  As I dug and removed the top layer, I would come up with shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\nI have not finished removing the top layer, but I foresee that what I will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  My question is this:\n\n1. How will this affect my ability to till the soil using a tilling machine/ tool?\n2. How will this affect the laying of new sod?\n3. Do I have to remove all brick and stone in order to till?\n4. Should I seek professional help (It's only day 2 and my back is killing me)?   \n\nPlease, I am dying for some advice!!!!", "link": "https://www.reddit.com/r/landscaping/comments/ngctyv/fixing_grade_of_backyard_sos/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "fixing grade of backyard... sos /!/ i recently decided to fix up my backyard.  it used to have a giant evergreen right in the middle of it.  a wind storm a couple years ago blew it over and destroyed my fence, as well as the fences of my neighbours beside me - very thankful it didn't fall on the house! the tree has since been removed.  for the past two years, there has been a dirt mound in the middle of my backyard, of where the stump used to be.  it has actually grown, and has affected the slope of my backyard - rainfall actually drains towards the house now.  so, i was tired of looking at this eyesore and so i took it upon myself to fix the slope of the backyard. \n\ni researched and know the basic steps i need to take to complete this task:\n\n1. remove top layer\n2. till the top soil\n3. rake and even out grade of top soil\n4. add new top soil and sand mixture - using sand to help with drainage and new roots to grow\n5. covering with sod\n\nupon removing the top layer i've come into a problem:\n\nalthough the giant evergreen was removed, the roots remained and continued to grow underground, growing over most of my backyard - including existing planters built by stacking old bricks and stones.  as i dug and removed the top layer, i would -----> come !!!  -----> up !!!  -----> with !!!  shovels of dirt, stones and broken bricks, while encountering the network of roots that has formed and taken over my backyard.\n\ni have not finished removing the top layer, but i foresee that what i will be left with is a dirt layer filled with shards of broken bricks and stones/ pebbles, with roots of an evergreen underneath.  my question is this:\n\n1. how will this affect my ability to till the soil using a tilling machine/ tool?\n2. how will this affect the laying of new sod?\n3. do i have to remove all brick and stone in order to till?\n4. should i seek professional help (it's only day 2 and my back is killing me)?   \n\nplease, i am dying for some advice!!!!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/ngctyv/fixing_grade_of_backyard_sos/", "identifyer": 330897, "year": "2021"}], "name": "withlandscaping2021"}