{"interestingcomments": [{"Unnamed: 0": 318220, "autor": "no_momentum", "date": 1598280415000, "content": "Has anyone left IT to work in landscaping? /!/ I am doing a lot of reflection.\n\n  \n Currently working as an IT professional (previously an academic) and am quite unhappy. I came up with a list of reasons including office politics and corporate bullshit, not working with real people, constantly having to go above and beyond without recognition or reward.  I'm a very down to earth guy. Most people are completely shocked when they find out that I have a PhD, because I just don't fit the corporate mould. I have come to the conclusion that I want out.\n\n  \n I posted a couple of question on [r/plumbers](https://www.reddit.com/r/plumbers) and [r/electricians](https://www.reddit.com/r/electricians), and I am amazed by the number of people that have also made the switch from IT to the trades. Many of them are saying the same things.\n\n  \n So has anyone here left IT or academic to work as a professional landscaper? Are you happier? I love the idea of working with my hands, no stranger to the tools, worked for a while on lathe and milling machines etc.\n\n  \n I'd also be interested to hear from people who have done the opposite! Anyone gone from landscaping to IT, what were your reasons for doing so? Do you regret your decision?", "link": "https://www.reddit.com/r/landscaping/comments/ifqd1j/has_anyone_left_it_to_work_in_landscaping/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "has anyone left it to work in landscaping? /!/ i am doing a lot of reflection.\n\n  \n currently working as an it professional (previously an academic) and am quite unhappy. i -----> came !!!  -----> up !!!  -----> with !!!  a list of reasons including office politics and corporate bullshit, not working -----> with !!!  real people, constantly having to go above and beyond without recognition or reward.  i'm a very down to earth guy. most people are completely shocked when they find out that i have a phd, because i just don't fit the corporate mould. i have come to the conclusion that i want out.\n\n  \n i posted a couple of question on [r/plumbers](https://www.reddit.com/r/plumbers) and [r/electricians](https://www.reddit.com/r/electricians), and i am amazed by the number of people that have also made the switch from it to the trades. many of them are saying the same things.\n\n  \n so has anyone here left it or academic to work as a professional landscaper? are you happier? i love the idea of working with my hands, no stranger to the tools, worked for a while on lathe and milling machines etc.\n\n  \n i'd also be interested to hear from people who have done the opposite! anyone gone from landscaping to it, what were your reasons for doing so? do you regret your decision?", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/ifqd1j/has_anyone_left_it_to_work_in_landscaping/", "identifyer": 318220, "year": "2020"}], "name": "withlandscaping2020"}