{"interestingcomments": [{"Unnamed: 0": 325365, "autor": "NikeFlex", "date": 1614784110000, "content": "New construction home sitting on bare lot, where to start with having a yard? Advice? /!/ I've been reading articles on landscaping and watching a ton of videos on it. I also had a few landscapers come out and give me quotes to get an idea how much it would cost for their labor. My total yard space is around 3,000 square feet, excluding what the house is sitting on. \n\nWhile I will probably contract out the sprinkler system (step 2), I'd like to do the topsoil raking (step 1), grass sodding (step 3), and mulching/flowerbedding (step 4) myself. \n\nI've read posts here and I know a lot of you have done it yourselves. I will need a landscape rake (for spreading/mixing topsoil), a 6-cu-ft wheelbarrow, at least one shovel, landscape stakes and string, and plastic edging for between the grass and mulch. \n\nI don't have any equipment or tools as this is my first home. Costco, Lowes, Home Depot, Menards - which is the best to start on this?", "link": "https://www.reddit.com/r/landscaping/comments/lww1gc/new_construction_home_sitting_on_bare_lot_where/", "origin": "Reddit", "suborigin": "landscaping", "result": true, "Selector": "done it yourselves", "selectorShort": "yourself", "MarkedSent": "new construction home sitting on bare lot, where to start with having a yard? advice? /!/ i've been reading articles on landscaping and watching a ton of videos on it. i also had a few landscapers come out and give me quotes to get an idea how much it would cost for their labor. my total yard space is around 3,000 square feet, excluding what the house is sitting on. \n\nwhile i will probably contract out the sprinkler system (step 2), i'd like to do the topsoil raking (step 1), grass sodding (step 3), and mulching/flowerbedding (step 4) myself. \n\ni've read posts here and i know a lot of you have -----> done !!!  -----> it !!!  -----> yourselves !!! . i will need a landscape rake (for spreading/mixing topsoil), a 6-cu-ft wheelbarrow, at least one shovel, landscape stakes and string, and plastic edging for between the grass and mulch. \n\ni don't have any equipment or tools as this is my first home. costco, lowes, home depot, menards - which is the best to start on this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/landscaping/comments/lww1gc/new_construction_home_sitting_on_bare_lot_where/", "identifyer": 325365, "year": "2021"}], "name": "yourselflandscaping2021"}