{"interestingcomments": [{"autor": "[deleted]", "date": "2020-11-10 09:23:32", "content": "I'm currently engineering student (which i didn't chose this path but my parents did, asian parents thing) but what i really like is to be a professional photographer.", "link": "https://www.reddit.com/r/photography/comments/jrhyyv/im_currently_engineering_student_which_i_didnt/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm currently engineering", "selectorShort": "engineer", "MarkedSent": "-----> i !!! 'm -----> currently !!!  -----> engineering !!!  student (which -----> i !!!  didn't chose this path but my parents did, asian parents thing) but what -----> i !!!  really like is to be a professional photographer.", "sortedWord": "None", "Identifyer": null, "identifyer": 86368, "year": "2020"}, {"autor": "djmuaddib", "date": "2019-07-31 00:46:40", "content": "[S] [USA-MI] Leica M2 /w Summicron 50mm F2 lens and accessories /!/ First of all, please excuse the awkwardness of this post — I'm the intermediary selling this camera for my Mom in Michigan, and she is not the most internet savvy. Ships from MI, estimated shipping \\~$20. CONUS only.\n\n[https://imgur.com/a/pJmt3MU](https://imgur.com/a/pJmt3MU)\n\nSelling a Leica M2 /w Summicron 50mm F2 lens, leather case, flash, manual, and Weston light meter. She just tested the shutter and film advance and said they're functioning, but she hasn't put a roll of film in and developed it, so can't give any more info than that on functionality (e.g. shutter clearing). Lens is clean, cosmetics are pretty decent (minor scuffs, a bit of the wrap peeled away). She hasn't used it in a while, but she still pulls it out regularly and works the shutter and film advance to make sure they don't seize up. She's told me she doesn't want to part /w the body, lens, and accessories for any less than $1500 all told, but obviously feel free to make offers and I'll pass them along. Let us know if you have further questions and if you had advice on testing further for functionality, we'd accept it. I just sold my first camera to [u/interesting\\_material](https://www.reddit.com/u/interesting_material/) if you want a reference.\n\nEdit: Looked up serials on request of someone. Body is manufactured 1958; lens is 1956.\n\nEdit 2: I could probably engineer a cash and trade if anyone has a Sony Sonnar T\\* FE 35mm F2.8 ZA or comparable E-Mount prime lens in good condition (to be clear, the lens would be for me, the cash would be for my Mom).", "link": "https://www.reddit.com/r/Leica/comments/ck0xay/s_usami_leica_m2_w_summicron_50mm_f2_lens_and/", "origin": "Reddit", "suborigin": "leica", "result": true, "Selector": "i could probably engineer", "selectorShort": "engineer", "MarkedSent": "[s] [usa-mi] leica m2 /w summicron 50mm f2 lens and accessories /!/ first of all, please excuse the awkwardness of this post — i'm the intermediary selling this camera for my mom in michigan, and she is not the most internet savvy. ships from mi, estimated shipping \\~$20. conus only.\n\n[https://imgur.com/a/pjmt3mu](https://imgur.com/a/pjmt3mu)\n\nselling a leica m2 /w summicron 50mm f2 lens, leather case, flash, manual, and weston light meter. she just tested the shutter and film advance and said they're functioning, but she hasn't put a roll of film in and developed it, so can't give any more info than that on functionality (e.g. shutter clearing). lens is clean, cosmetics are pretty decent (minor scuffs, a bit of the wrap peeled away). she hasn't used it in a while, but she still pulls it out regularly and works the shutter and film advance to make sure they don't seize up. she's told me she doesn't want to part /w the body, lens, and accessories for any less than $1500 all told, but obviously feel free to make offers and i'll pass them along. let us know if you have further questions and if you had advice on testing further for functionality, we'd accept it. i just sold my first camera to [u/interesting\\_material](https://www.reddit.com/u/interesting_material/) if you want a reference.\n\nedit: looked up serials on request of someone. body is manufactured 1958; lens is 1956.\n\nedit 2: -----> i !!!  -----> could !!!  -----> probably !!!  -----> engineer !!!  a cash and trade if anyone has a sony sonnar t\\* fe 35mm f2.8 za or comparable e-mount prime lens in good condition (to be clear, the lens would be for me, the cash would be for my mom).", "sortedWord": "None", "Identifyer": null, "identifyer": 13748, "year": "2019"}, {"autor": "kenfar", "date": "2020-02-01 03:32:08", "content": "Vuescan installation *hell* and plea for help /!/ So, VueScan says that it works on linux:   [https://www.hamrick.com/linux-scanner-software.html](https://www.hamrick.com/linux-scanner-software.html)\n\nYou can install it via the command line, or very simply on the above page right off the download button.  Or you can install it via the download page.   Either way is simple &amp; straight forward.\n\nAnd that's when the hell begins: it doesn't appear to connect to the scanner, provides basic suggestions (turn it on &amp; off, etc).  And it says on one page that linux isn't supported, and another page says that it is.\n\nVuescan Page 1:\n\n* [https://www.hamrick.com/vuescan/plustek\\_opticfilm\\_8100.html](https://www.hamrick.com/vuescan/plustek_opticfilm_8100.html)\n* Want to keep using your Plustek OpticFilm 8100 on Linux?\n* We reverse engineered the Plustek OpticFilm 8100 driver and included it in VueScan so you can keep using your old scanner.\n* Version 9.7.20. Updated January 11, 2020. Built with 32-bit Ubuntu 16.04\n\nVuescan Page 2:\n\n* [https://www.hamrick.com/vuescan/plustek\\_opticfilm\\_8100.html#technical-information](https://www.hamrick.com/vuescan/plustek_opticfilm_8100.html#technical-information)\n* **Linux:**    No\n\nBottom line: can anyone suggest how to actually get this software working on linux?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ex057l/vuescan_installation_hell_and_plea_for_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "we reverse engineered", "selectorShort": "engineer", "MarkedSent": "vuescan installation *hell* and plea for help /!/ so, vuescan says that it works on linux:   [https://www.hamrick.com/linux-scanner-software.html](https://www.hamrick.com/linux-scanner-software.html)\n\nyou can install it via the command line, or very simply on the above page right off the download button.  or you can install it via the download page.   either way is simple &amp; straight forward.\n\nand that's when the hell begins: it doesn't appear to connect to the scanner, provides basic suggestions (turn it on &amp; off, etc).  and it says on one page that linux isn't supported, and another page says that it is.\n\nvuescan page 1:\n\n* [https://www.hamrick.com/vuescan/plustek\\_opticfilm\\_8100.html](https://www.hamrick.com/vuescan/plustek_opticfilm_8100.html)\n* want to keep using your plustek opticfilm 8100 on linux?\n* -----> we !!!  -----> reverse !!!  -----> engineered !!!  the plustek opticfilm 8100 driver and included it in vuescan so you can keep using your old scanner.\n* version 9.7.20. updated january 11, 2020. built with 32-bit ubuntu 16.04\n\nvuescan page 2:\n\n* [https://www.hamrick.com/vuescan/plustek\\_opticfilm\\_8100.html#technical-information](https://www.hamrick.com/vuescan/plustek_opticfilm_8100.html#technical-information)\n* **linux:**    no\n\nbottom line: can anyone suggest how to actually get this software working on linux?", "sortedWord": "None", "Identifyer": null, "identifyer": 54767, "year": "2020"}, {"autor": "BleuRougeViolet", "date": "2019-02-13 23:41:03", "content": "Anyone using 500px needs to update their password asap. /!/ Received this from 500px\n\n\"What happened?\nOn February 8, 2019, our engineering team became aware of a potential security issue affecting certain user profile data. We immediately launched a comprehensive review of our systems to understand the nature and scope of the issue. We engaged a third-party expert to assist us in our investigation and are coordinating with law enforcement authorities on this matter.\nBased on our investigation to date, we believe that an unauthorized party gained access to our systems and acquired partial user data on approximately July 5, 2018. We’ve concluded this issue affected certain information that users provided when filling out their user profiles, as listed below. Our engineers are closely monitoring our platform and we’ve found no evidence to date of any recurrence of this issue.\"", "link": "https://www.reddit.com/r/photography/comments/aqd7ee/anyone_using_500px_needs_to_update_their_password/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "our engineers", "selectorShort": "engineer", "MarkedSent": "anyone using 500px needs to update their password asap. /!/ received this from 500px\n\n\"what happened?\non february 8, 2019, our engineering team became aware of a potential security issue affecting certain user profile data. we immediately launched a comprehensive review of our systems to understand the nature and scope of the issue. we engaged a third-party expert to assist us in our investigation and are coordinating with law enforcement authorities on this matter.\nbased on our investigation to date, we believe that an unauthorized party gained access to our systems and acquired partial user data on approximately july 5, 2018. we’ve concluded this issue affected certain information that users provided when filling out their user profiles, as listed below. -----> our !!!  -----> engineers !!!  are closely monitoring -----> our !!!  platform and we’ve found no evidence to date of any recurrence of this issue.\"", "sortedWord": "None", "Identifyer": null, "identifyer": 67745, "year": "2019"}], "name": "canon2019engineer"}