{"interestingcomments": [{"autor": "Damneddesigns", "date": "2019-10-20 07:32:06", "content": "Touit 50 2.8 macro vs Sigma 56 1.4 on a6500 /!/  \n\nI have the A6500 and the Sigma 56 1.4. It's my favorite lens and is always on my camera. The 18-105 and Sigma 30 are rarely in use.\n\nWhile portrait is my preferred style of photography, I also do the occasional street photography. I need a Portrait lens to shoot products that I design and here are my options\n\n1. Sony 30mm macro. Costs about $300 but means I will need to carry this with my Sigma.\n\n2. Zeiss Touit 50 2.8. While at 2.8 this is slower than my Sigma, I'm wondering if anyone has used both for Portrait or regular non macro work?\n\nI'm keen on owning just one primary lens and i'd rather get rid of the Sigma to fund the Zeiss at $999.\n\nI've heard some things about bad autofocus on the Zeiss but the sigma struggles in low light too so i'm trying to determine just how much of a difference is there.\n\nThanks in Advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/dkgida/touit_50_28_macro_vs_sigma_56_14_on_a6500/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "touit 50 2.8 macro vs sigma 56 1.4 on a6500 /!/  \n\ni have the a6500 and the sigma 56 1.4. it's my favorite lens and is always on my camera. the 18-105 and sigma 30 are rarely in use.\n\nwhile portrait is my preferred style of photography, i also do the occasional street photography. -----> i !!!  need a portrait lens to shoot products that -----> i !!!  -----> design !!!  and here are my options\n\n1. sony 30mm macro. costs about $300 but means i will need to carry this with my sigma.\n\n2. zeiss touit 50 2.8. while at 2.8 this is slower than my sigma, i'm wondering if anyone has used both for portrait or regular non macro work?\n\ni'm keen on owning just one primary lens and i'd rather get rid of the sigma to fund the zeiss at $999.\n\ni've heard some things about bad autofocus on the zeiss but the sigma struggles in low light too so i'm trying to determine just how much of a difference is there.\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 10862, "year": "2019"}, {"autor": "Havel_88", "date": "2019-03-02 15:40:29", "content": "I design your online gallery for free :) /!/ Hello, I have come to offer you my services to design a web based on wordpress. I'm not kidding, I'll work for free. You will be asking if I am crazy, but if you contact me I will explain it to you in detail.\n\nIn a normal scenario, you have to pay hosting, domain and designer. But if you buy hosting and domain with a company of my choice (very good prices, about 3.50$/hosting and free domain), the company will pay me for designing a web for you :)\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/awix12/i_design_your_online_gallery_for_free/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> design !!!  your online gallery for free :) /!/ hello, i have come to offer you my services to design a web based on wordpress. i'm not kidding, i'll work for free. you will be asking if i am crazy, but if you contact me i will explain it to you in detail.\n\nin a normal scenario, you have to pay hosting, domain and designer. but if you buy hosting and domain with a company of my choice (very good prices, about 3.50$/hosting and free domain), the company will pay me for designing a web for you :)\n", "sortedWord": "None", "Identifyer": null, "identifyer": 13257, "year": "2019"}, {"autor": "raven55six", "date": "2020-08-22 08:41:06", "content": "Shot On: Nikon D3400 • Lens: 18-55 mm • Focal Length: 55mm • Shutter Speed: 1/250 Sec. • f/8.0 • ISO 200. Its 100+ years old castle abandoned from day 1 of completion. Designed by a French architect, situated in upper Shimla-HP, India. There's not even a single iron nail used to bind it together.", "link": "https://www.reddit.com/r/Nikon/comments/ief23s/shot_on_nikon_d3400_lens_1855_mm_focal_length/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "shot on: nikon d3400 • lens: 18-55 mm • focal length: 55mm • shutter speed: 1/250 sec. • f/8.0 • iso 200. its 100+ years old castle abandoned from day 1 of completion. -----> designed !!!  by a french architect, situated in upper shimla-hp, india. there's not even a single iron nail used to bind it together.", "sortedWord": "None", "Identifyer": null, "identifyer": 24749, "year": "2020"}, {"autor": "rishabhkapoor20", "date": "2020-11-04 18:42:16", "content": "Tips needed: Clicking good interior shots of my design projects /!/ Hi. I'm an interior designer. I current own a D5300 with the kit lens 18-55mm lens and a sigma 18-200mm lens. \n\nI'm not really into photography and its not possible to have a professional with me whenever I visit a site nearing completion or around handover. \n\nWould like inputs as to how to click the best images. Main purpose is to post on social media, website, and if really great images come out then magazines too.\n\nFocus being wide angle pictures with details, clarity, close up picturea of artefacts. \n\nWould love to hear from you guys!\n\nAlso what settings to use, keeping in mind I'm a complete amateur. \n\nI currently use my cellphone, but have high hopes that using a dslr might just help me level up.\n\nThanks guys!", "link": "https://www.reddit.com/r/Nikon/comments/jo29yl/tips_needed_clicking_good_interior_shots_of_my/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "tips needed: clicking good interior shots of -----> my !!!  -----> design !!!  projects /!/ hi. i'm an interior designer. i current own a d5300 with the kit lens 18-55mm lens and a sigma 18-200mm lens. \n\ni'm not really into photography and its not possible to have a professional with me whenever i visit a site nearing completion or around handover. \n\nwould like inputs as to how to click the best images. main purpose is to post on social media, website, and if really great images come out then magazines too.\n\nfocus being wide angle pictures with details, clarity, close up picturea of artefacts. \n\nwould love to hear from you guys!\n\nalso what settings to use, keeping in mind i'm a complete amateur. \n\ni currently use my cellphone, but have high hopes that using a dslr might just help me level up.\n\nthanks guys!", "sortedWord": "None", "Identifyer": null, "identifyer": 31803, "year": "2020"}, {"autor": "Racecarsoup", "date": "2020-06-16 18:52:50", "content": "I design stickers for fun in my free time, this one is an homage to the other love of my life photography", "link": "https://www.reddit.com/r/SonyAlpha/comments/haa533/i_design_stickers_for_fun_in_my_free_time_this/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> design !!!  stickers for fun in my free time, this one is an homage to the other love of my life photography", "sortedWord": "None", "Identifyer": null, "identifyer": 48572, "year": "2020"}, {"autor": "nathawnb", "date": "2020-05-24 02:00:52", "content": "What are some free Rendering Softwares for digital photography? /!/ I am talking about Rendering Softwares where I can design my own landscapes digitally, play with lighting, and just let my creativity overtake. (If you follow @dovneon on Instagram you will know what I’m talking about)", "link": "https://www.reddit.com/r/photography/comments/gphdjt/what_are_some_free_rendering_softwares_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can design", "selectorShort": "design", "MarkedSent": "what are some free rendering softwares for digital photography? /!/ -----> i !!!  am talking about rendering softwares where -----> i !!!  -----> can !!!  -----> design !!!  my own landscapes digitally, play with lighting, and just let my creativity overtake. (if you follow @dovneon on instagram you will know what i’m talking about)", "sortedWord": "None", "Identifyer": null, "identifyer": 60852, "year": "2020"}, {"autor": "Stunnerbee", "date": "2020-01-16 23:24:38", "content": "Design 2 photography signature logo in 6hrs by Ravindu_ps", "link": "https://www.reddit.com/r/photography/comments/eprlep/design_2_photography_signature_logo_in_6hrs_by/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  2 photography signature logo in 6hrs by ravindu_ps", "sortedWord": "None", "Identifyer": null, "identifyer": 63034, "year": "2020"}, {"autor": "sneaker7z7", "date": "2020-04-27 03:02:43", "content": "Designed by Joe Exotic, the tiger king himself!", "link": "https://www.reddit.com/r/photography/comments/g8sdlq/designed_by_joe_exotic_the_tiger_king_himself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  by joe exotic, the tiger king himself!", "sortedWord": "None", "Identifyer": null, "identifyer": 63347, "year": "2020"}, {"autor": "kidfantastic", "date": "2020-05-05 06:08:10", "content": "Composition Overlays - any iphone apps? /!/ Greetings Reddit Photographers! \n\nI've just started learning photography on a Canon 750d. I've studied design in the past and am familiar with the compositional elements such as rule of thirds, golden section etc. When designing I can use an overlay of the element to check my work. What I'd really like is to be able to do the same with a photograph *before* I take it. I know I can drag it into some software and check it that way, but by that time I'm already home and the moment has passed. I've read about Magic Lantern but am not confident enough to install that on my camera and it's not compatible yet anyway. Does anyone know of an iPhone app that would allow me to use these compositional elements as overlays while I'm checking the composition of shot before I take it? As a beginner it would be such a useful learning tool, and a lot easier than carrying around a bunch of transparencies with the overlay printed option - this is not great, I know - but it's my next best plan at this point. Thank you so much in advance for your help!", "link": "https://www.reddit.com/r/photography/comments/gdsbxq/composition_overlays_any_iphone_apps/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i've studied design", "selectorShort": "design", "MarkedSent": "composition overlays - any iphone apps? /!/ greetings reddit photographers! \n\ni've just started learning photography on a canon 750d. -----> i !!! 've -----> studied !!!  -----> design !!!  in the past and am familiar with the compositional elements such as rule of thirds, golden section etc. when designing i can use an overlay of the element to check my work. what i'd really like is to be able to do the same with a photograph *before* i take it. i know i can drag it into some software and check it that way, but by that time i'm already home and the moment has passed. i've read about magic lantern but am not confident enough to install that on my camera and it's not compatible yet anyway. does anyone know of an iphone app that would allow me to use these compositional elements as overlays while i'm checking the composition of shot before i take it? as a beginner it would be such a useful learning tool, and a lot easier than carrying around a bunch of transparencies with the overlay printed option - this is not great, i know - but it's my next best plan at this point. thank you so much in advance for your help!", "sortedWord": "None", "Identifyer": null, "identifyer": 63463, "year": "2020"}, {"autor": "SpartanFlight", "date": "2020-07-16 20:00:10", "content": "ZNO Book Review /!/ I'm going to keep it short cause I suck at expressing my thoughts. I saw an add pop up on my IG feed \"saying free 8 x 8 hard cover book\".\n\nI said why not.  After giving some personal information (my website, website email, pretty much checking to see if I was a photographer) I was given a coupon code to get a free 24 page 8 x 8 book.  I still had to pay shipping (around 12 dollars)\n\nPros:\n\n* Book arrived quickly after ordered (1 week)\n\n* Inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* The website was really really easy to use\n\n\n\nCons:\n\n*  Book ships from China (I would never trust my full res photos to a chinese company EVER, for my own clothing brands and local printing I can vet for my local shops not to steal my designs, and control the quality of my work.  Also the company plays off like they are Canadian.\n\n* The print quality was very mediocre.  For comparison, my previous book was printed from blurb.  Any brightness adjustments were made in when i designed my book, and what i saw on my monitor was shown on the book.  Not so much with zno.  The Hardcover feels like a pillow?  .  My photos were missing fine detail.  I suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* Price is expensive.  This book was 66 dollars Canadian if I paid, for 24 pages.  For Comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\nTL;DR.  \n\nJust use blurb.  ZNO is essentially a fancy dropshipping website.", "link": "https://www.reddit.com/r/photography/comments/hsh51t/zno_book_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my designs", "selectorShort": "design", "MarkedSent": "zno book review /!/ i'm going to keep it short cause i suck at expressing my thoughts. i saw an add pop up on my ig feed \"saying free 8 x 8 hard cover book\".\n\ni said why not.  after giving some personal information (my website, website email, pretty much checking to see if i was a photographer) i was given a coupon code to get a free 24 page 8 x 8 book.  i still had to pay shipping (around 12 dollars)\n\npros:\n\n* book arrived quickly after ordered (1 week)\n\n* inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* the website was really really easy to use\n\n\n\ncons:\n\n*  book ships from china (i would never trust -----> my !!!  full res photos to a chinese company ever, for -----> my !!!  own clothing brands and local printing i can vet for -----> my !!!  local shops not to steal -----> my !!!  -----> designs !!! , and control the quality of -----> my !!!  work.  also the company plays off like they are canadian.\n\n* the print quality was very mediocre.  for comparison, my previous book was printed from blurb.  any brightness adjustments were made in when i designed my book, and what i saw on my monitor was shown on the book.  not so much with zno.  the hardcover feels like a pillow?  .  my photos were missing fine detail.  i suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* price is expensive.  this book was 66 dollars canadian if i paid, for 24 pages.  for comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\ntl;dr.  \n\njust use blurb.  zno is essentially a fancy dropshipping website.", "sortedWord": "None", "Identifyer": null, "identifyer": 64146, "year": "2020"}, {"autor": "DivisionalMedia", "date": "2020-04-30 19:18:36", "content": "I got bored and made a platform to hopefully help creative content creators showcase, collaborate and create in one place. /!/ I built out a little project for creative content creators and talent called  [Vidafi.com](https://vidafi.com/) \n\n(SSL certificate not in place yet so it may show a warning in your browser)\n\nThe idea is to be a bit more refined DeviantArt meets ModelMayhem (as there's a focus on video and performance talent as well). Designed to hopefully build a community to encourage collaborating worldwide and helping creators showcase and get hired/commissioned for work in a single place. \n\nWould love to have anyone here try it and feature their portfolio work there.\n\nI'm looking for a solid core catalog of creatives before promoting it and also really need feedback.\n\nSeriously ANY feedback is welcome (keeping in mid this is only the core beta build and there's a lot of incomplete and placeholder elements).\n\nAll the best to everyone!", "link": "https://www.reddit.com/r/photography/comments/gb28ly/i_got_bored_and_made_a_platform_to_hopefully_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "i got bored and made a platform to hopefully help creative content creators showcase, collaborate and create in one place. /!/ i built out a little project for creative content creators and talent called  [vidafi.com](https://vidafi.com/) \n\n(ssl certificate not in place yet so it may show a warning in your browser)\n\nthe idea is to be a bit more refined deviantart meets modelmayhem (as there's a focus on video and performance talent as well). -----> designed !!!  to hopefully build a community to encourage collaborating worldwide and helping creators showcase and get hired/commissioned for work in a single place. \n\nwould love to have anyone here try it and feature their portfolio work there.\n\ni'm looking for a solid core catalog of creatives before promoting it and also really need feedback.\n\nseriously any feedback is welcome (keeping in mid this is only the core beta build and there's a lot of incomplete and placeholder elements).\n\nall the best to everyone!", "sortedWord": "None", "Identifyer": null, "identifyer": 68740, "year": "2020"}, {"autor": "WiccedSwede", "date": "2020-06-01 18:22:27", "content": "I designed and 3D printed a beefy camera grip so I won't get hand pains anymore while shooting for extended periods of time. Hope I can help someone with this idea.", "link": "https://www.reddit.com/r/photography/comments/gupuvc/i_designed_and_3d_printed_a_beefy_camera_grip_so/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a beefy camera grip so -----> i !!!  won't get hand pains anymore while shooting for extended periods of time. hope i can help someone with this idea.", "sortedWord": "None", "Identifyer": null, "identifyer": 69437, "year": "2020"}, {"autor": "esheventer", "date": "2020-07-12 10:15:17", "content": "If you are a photographer facing problems while doing SEO of your website. I built a Trello board to follow SEO tasks step by step. I also designed a mindmap to make your SEO Journey. It’s completely free.", "link": "https://www.reddit.com/r/photography/comments/hps5u9/if_you_are_a_photographer_facing_problems_while/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also designed", "selectorShort": "design", "MarkedSent": "if you are a photographer facing problems while doing seo of your website. i built a trello board to follow seo tasks step by step. -----> i !!!  -----> also !!!  -----> designed !!!  a mindmap to make your seo journey. it’s completely free.", "sortedWord": "None", "Identifyer": null, "identifyer": 70344, "year": "2020"}, {"autor": "photopracticum", "date": "2020-09-14 11:31:09", "content": "Designing Photography Books in Photoshop and InDesign", "link": "https://www.reddit.com/r/photography/comments/isj451/designing_photography_books_in_photoshop_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  photography books in photoshop and indesign", "sortedWord": "None", "Identifyer": null, "identifyer": 71458, "year": "2020"}, {"autor": "i_no_exist", "date": "2020-11-15 21:37:20", "content": "Designing a photography product! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/juu33p/designing_a_photography_product/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  a photography product! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 73977, "year": "2020"}, {"autor": "kendalinwonderland", "date": "2020-01-27 22:41:12", "content": "Question about IP/copyrights when you ask for help taking a picture /!/ So a few years ago, I started a self-portrait project to promote myself as an actress on Instagram. It's been fun, 99% of the photos I take myself and edit myself. On occasion I collaborate with someone like a boyfriend, friend, or photographer on something. \n\nLast year, I designed and hand-made a dress to be nearly identical to one that Audrey Hepburn wore in an early photo in Kew Gardens. I put together the whole outfit, and when I went to London, my plan was to go there either with a tripod or a friend and make my recreations. A newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nWe met at the park, and we started looking for the locations where the photos in Audrey's photo session were taken. I handed him my camera, and I and his mom would check the pictures on my phone to double check the angles and the poses. I ended up with three photos on my 'to do' list, which I then took home and edited, and shared on Instagram, of course thanking them for their help.\n\nCut to this year, another friend was working with a publisher on a book on Audrey Hepburn and really wanted to include some photos of me in the introduction. I sent over 9 of my favourites, including one from Kew. He decided on two that I had edited myself into, which were taken in the 1950's and 1960's. I assume he did whatever needed done to clear those. And the third was one from Kew. \n\nNow, the whole time before this, I've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. It's been a stressful year - I moved from California to France, and then went on a 3 month road trip (with my cat) between five countries. Then I spent a month apartment-hunting, and then trying to furnish the place. I've been extremely forgetful. I'll find emails I failed to reply to from 3 months ago. Anyway when I posted a photo of the page in the book, it was *then* that it was brought to my attention. I freaked the hell out and had a panic attack. I didn't mean to do that to my friends who had helped me create this picture I love. I was a wreck. I wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on IG that I had to take a mental health break for a while. I couldn't deal. For 3 days. Just couldn't eat, couldn't do much of anything, but I decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* I could do for myself because I don't even feel in control of my own brain at this point. Anyway I got it together and wrote her son a long apology on Friday, and told him what I would try to do to fix it, and to make it up to him. Still no response. But now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and I don't know, he's dealt with photos for decades, he's a collector and author and worked at the National Portrait Gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nSide note. My own personal issue here is WTF would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nBut my legal question (and sorry it took me this long to write this, but UGGGGG) is who owns this photo? I mean I was thinking about it today and honestly, I would be kind of pissed if HE used it without telling me, or asking me. Because it's my project, my series, I put way more effort into creating the photo than he did (I spent DAYS making the dress), he has no use for it, and I basically just handed him my camera. If you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? Personally, yes, I would appreciate a credit if someone used the photo I took of them, but I certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. This is MY photo. Now he's trying to limit what I can do with it, just because he stood there and pushed the button. I have another friend who told me to do whatever I wanted with the photos she took of me. We're friends and it's for fun. Now of course when I work with a photographer and sign a release, I get that I have to ask them first. But I'm 99% sure we did not sign a release (I'll leave 1% of doubt because I'm forgetful and haven't dug through my papers. But in my moving process I don't recall coming across one for that day). If he's going to start a fight over who can use MY photo, oh yeah I'm going to fight him. But hell, if he's going to be such an asshole about it, I'll just go back and take new photos there next time I'm in London. \n\nI'm definitely feeling bad about not acknowledging him, but I'm also getting pretty annoyed right now at the way they're dealing with this. I need some input, please!", "link": "https://www.reddit.com/r/photography/comments/euvv9f/question_about_ipcopyrights_when_you_ask_for_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "question about ip/copyrights when you ask for help taking a picture /!/ so a few years ago, i started a self-portrait project to promote myself as an actress on instagram. it's been fun, 99% of the photos i take myself and edit myself. on occasion i collaborate with someone like a boyfriend, friend, or photographer on something. \n\nlast year, -----> i !!!  -----> designed !!!  and hand-made a dress to be nearly identical to one that audrey hepburn wore in an early photo in kew gardens. i put together the whole outfit, and when i went to london, my plan was to go there either with a tripod or a friend and make my recreations. a newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nwe met at the park, and we started looking for the locations where the photos in audrey's photo session were taken. i handed him my camera, and i and his mom would check the pictures on my phone to double check the angles and the poses. i ended up with three photos on my 'to do' list, which i then took home and edited, and shared on instagram, of course thanking them for their help.\n\ncut to this year, another friend was working with a publisher on a book on audrey hepburn and really wanted to include some photos of me in the introduction. i sent over 9 of my favourites, including one from kew. he decided on two that i had edited myself into, which were taken in the 1950's and 1960's. i assume he did whatever needed done to clear those. and the third was one from kew. \n\nnow, the whole time before this, i've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. it's been a stressful year - i moved from california to france, and then went on a 3 month road trip (with my cat) between five countries. then i spent a month apartment-hunting, and then trying to furnish the place. i've been extremely forgetful. i'll find emails i failed to reply to from 3 months ago. anyway when i posted a photo of the page in the book, it was *then* that it was brought to my attention. i freaked the hell out and had a panic attack. i didn't mean to do that to my friends who had helped me create this picture i love. i was a wreck. i wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on ig that i had to take a mental health break for a while. i couldn't deal. for 3 days. just couldn't eat, couldn't do much of anything, but i decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* i could do for myself because i don't even feel in control of my own brain at this point. anyway i got it together and wrote her son a long apology on friday, and told him what i would try to do to fix it, and to make it up to him. still no response. but now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and i don't know, he's dealt with photos for decades, he's a collector and author and worked at the national portrait gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nside note. my own personal issue here is wtf would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nbut my legal question (and sorry it took me this long to write this, but uggggg) is who owns this photo? i mean i was thinking about it today and honestly, i would be kind of pissed if he used it without telling me, or asking me. because it's my project, my series, i put way more effort into creating the photo than he did (i spent days making the dress), he has no use for it, and i basically just handed him my camera. if you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? personally, yes, i would appreciate a credit if someone used the photo i took of them, but i certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. this is my photo. now he's trying to limit what i can do with it, just because he stood there and pushed the button. i have another friend who told me to do whatever i wanted with the photos she took of me. we're friends and it's for fun. now of course when i work with a photographer and sign a release, i get that i have to ask them first. but i'm 99% sure we did not sign a release (i'll leave 1% of doubt because i'm forgetful and haven't dug through my papers. but in my moving process i don't recall coming across one for that day). if he's going to start a fight over who can use my photo, oh yeah i'm going to fight him. but hell, if he's going to be such an asshole about it, i'll just go back and take new photos there next time i'm in london. \n\ni'm definitely feeling bad about not acknowledging him, but i'm also getting pretty annoyed right now at the way they're dealing with this. i need some input, please!", "sortedWord": "None", "Identifyer": null, "identifyer": 77793, "year": "2020"}, {"autor": "amellice", "date": "2020-12-15 18:57:46", "content": "Saal Digital Photobook Review /!/ Hi all, I've recently ordered a photobook from Saal Digital which is a German print house, and wanted to share my thoughts with you.\n\n&amp;#x200B;\n\nWhile I was looking for a printing house to print a portfolio photo book, I stumbled on Saal Digital which is a German print house that offers high quality prints and photo books. I've never tried Saal Digital before and having tried a different bunch of other print houses, I decided to give Saal Digital a try. I printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# Design\n\nThere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. I chose the Professional Line photobook with the black leather cover surface and went for the glossy finish.\n\nSaal Digital offers layout design software for both Mac OS and Windows where you can customize your book. This is the tool that I used to design, upload, and order my book. You can design your book with other software and upload it for printing as a PDF.\n\nI found the software to be very easy to use. You start out by designing the cover of the book including the back and the spine. Then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nAs for the paper itself, Saal Digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) Fuji Crystal Archive paper. For each page, two papers will be glued back to back with a thickness of about 0.36mm per page. I personally love this paper and use it in my darkroom printing since it's widely available in sheets. It has beautiful color rendering with deep blacks and beautiful highlights.\n\nAs for color management, Saal Digital provides ICC color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. I found that the profile rendering stays very close to the exported sRGB JPEGs and the final print. You would get an accurate representation if your monitor is calibrated.\n\nAnother aspect that I liked is what Saal Digital calls \"Layflat Binding\" where you can print panorama on two pages and they would look (hopefully) flat. I've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# Print Quality\n\nIt all comes down to print quality when I want to pick which print house to print my photos. Sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. Personally, I was impressed with Saal's final book and I'll break it down for you.\n\nAs for the cover, the leather cover felt premium and not cheap. It has a non-noticeable nice smell. The binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). The spine looks fine and sturdy. You can print on the first page glued to the front and back cover if you choose to do so.\n\nThe pages themselves feel thick since they are two prints glued back to back together. The glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. Since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nThe color rendering stayed very true to the original photos. I increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. The prints look and feel very close to what I see on the screen and print personally on an Inkjet printer. Looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. Shadows are not lost too, the subtle different tones are still rendered as I wanted which was quite surprising to me.\n\nLooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nYou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). The contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. This may be due to the continuous tone of RA-4 printing with this paper vs Inkjet printing for example.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\nDeep shadows and subtle tones rendering looks amazing in color photographs too. Like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# Summary\n\nAll in all, I was very pleased with the quality of the book and prints. The Professional Line Photobook product did indeed feel professional and premium. The color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nThe one thing that I felt missing is offering other types of paper for books, as Fuji Crystal Archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. For me, I love the Crystal Archive paper and use it personally. \n\nAnother thing to note is that I capped the max number of pages allowed at 130 pages. The software wouldn't let me add more pages after that. This restriction may exist to ensure \"Layflat Binding\" would work.", "link": "https://www.reddit.com/r/photography/comments/kdrw88/saal_digital_photobook_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i used to design", "selectorShort": "design", "MarkedSent": "saal digital photobook review /!/ hi all, i've recently ordered a photobook from saal digital which is a german print house, and wanted to share my thoughts with you.\n\n&amp;#x200b;\n\nwhile i was looking for a printing house to print a portfolio photo book, i stumbled on saal digital which is a german print house that offers high quality prints and photo books. i've never tried saal digital before and having tried a different bunch of other print houses, i decided to give saal digital a try. i printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# design\n\nthere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. i chose the professional line photobook with the black leather cover surface and went for the glossy finish.\n\nsaal digital offers layout design software for both mac os and windows where you can customize your book. this is the tool that -----> i !!!  -----> used !!!  -----> to !!!  -----> design !!! , upload, and order my book. you can design your book with other software and upload it for printing as a pdf.\n\ni found the software to be very easy to use. you start out by designing the cover of the book including the back and the spine. then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200b;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nas for the paper itself, saal digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) fuji crystal archive paper. for each page, two papers will be glued back to back with a thickness of about 0.36mm per page. i personally love this paper and use it in my darkroom printing since it's widely available in sheets. it has beautiful color rendering with deep blacks and beautiful highlights.\n\nas for color management, saal digital provides icc color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. i found that the profile rendering stays very close to the exported srgb jpegs and the final print. you would get an accurate representation if your monitor is calibrated.\n\nanother aspect that i liked is what saal digital calls \"layflat binding\" where you can print panorama on two pages and they would look (hopefully) flat. i've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# print quality\n\nit all comes down to print quality when i want to pick which print house to print my photos. sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. personally, i was impressed with saal's final book and i'll break it down for you.\n\nas for the cover, the leather cover felt premium and not cheap. it has a non-noticeable nice smell. the binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). the spine looks fine and sturdy. you can print on the first page glued to the front and back cover if you choose to do so.\n\nthe pages themselves feel thick since they are two prints glued back to back together. the glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nthe color rendering stayed very true to the original photos. i increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. the prints look and feel very close to what i see on the screen and print personally on an inkjet printer. looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. shadows are not lost too, the subtle different tones are still rendered as i wanted which was quite surprising to me.\n\nlooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nyou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). the contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. this may be due to the continuous tone of ra-4 printing with this paper vs inkjet printing for example.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\ndeep shadows and subtle tones rendering looks amazing in color photographs too. like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# summary\n\nall in all, i was very pleased with the quality of the book and prints. the professional line photobook product did indeed feel professional and premium. the color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nthe one thing that i felt missing is offering other types of paper for books, as fuji crystal archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. for me, i love the crystal archive paper and use it personally. \n\nanother thing to note is that i capped the max number of pages allowed at 130 pages. the software wouldn't let me add more pages after that. this restriction may exist to ensure \"layflat binding\" would work.", "sortedWord": "None", "Identifyer": null, "identifyer": 85240, "year": "2020"}, {"autor": "argusromblei", "date": "2020-11-18 21:03:52", "content": "Pro photographers with successful portfolio print websites, I need some insight. /!/ \nI’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. Need a mix of experience to help start my own website.\n\nDoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nIs your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? Do you choose a certain resolution and do your photos get stolen lifted from your site? \n\nI’m highly experienced in wordpress themes and have picked a bunch I like from themeforest but need some personal experiences before I design my photo website.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/jwoeak/pro_photographers_with_successful_portfolio_print/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "pro photographers with successful portfolio print websites, i need some insight. /!/ \ni’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. need a mix of experience to help start my own website.\n\ndoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nis your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? do you choose a certain resolution and do your photos get stolen lifted from your site? \n\n-----> i !!! ’m highly experienced in wordpress themes and have picked a bunch -----> i !!!  like from themeforest but need some personal experiences before -----> i !!!  -----> design !!!  my photo website.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 86748, "year": "2020"}, {"autor": "goodvibes_alacarte", "date": "2020-10-21 23:31:28", "content": "Design your dream camera system /!/ Disregarding internal electronics, if you could design your dream camera system from the ground up—any shape, size , layout, lens system, etc.—how would it look?", "link": "https://www.reddit.com/r/photography/comments/jfoalm/design_your_dream_camera_system/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  your dream camera system /!/ disregarding internal electronics, if you could design your dream camera system from the ground up—any shape, size , layout, lens system, etc.—how would it look?", "sortedWord": "None", "Identifyer": null, "identifyer": 90805, "year": "2020"}, {"autor": "bradbrok", "date": "2019-11-18 18:36:40", "content": "I designed a thing to make DSLR scanning easier, if you have a 3D printer you can print one as well!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dy79es/i_designed_a_thing_to_make_dslr_scanning_easier/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a thing to make dslr scanning easier, if you have a 3d printer you can print one as well!", "sortedWord": "None", "Identifyer": null, "identifyer": 92405, "year": "2019"}, {"autor": "Spukta", "date": "2019-10-31 12:17:05", "content": "Film camera repair kit on the go /!/ Hello wonderful people of r/AnalogCommunity. \nAs a schools task we have to design a \"survival kit\" the interpretation is up to us, it has to be interesting, and something new. \nAs a film photographer myself I thought I would make a Film Photographers Survival Kit. \nNow my main idea is a repari kit/first necessities for any film shooter in the field, but I would like to hear your thought and input in this. \nI have a little fabric pouch where I keep a shutter release cable, a CPL filter, spare LR44 batteries taped togeather with black electricians tape (to use as an emergency light seal), a flathead screwdriver and microfiber cloth. \nI would like to know if you have or would like a \"survival kit\" similar to this (but a better thought out one), what tools and things do you take with you and maybe some stories of repairing a camera mid shoot in the field. \nThank you all in advence and I hope to see lots of opinions! \nCheers and happy shooting!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dpmoph/film_camera_repair_kit_on_the_go/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "we have to design", "selectorShort": "design", "MarkedSent": "film camera repair kit on the go /!/ hello wonderful people of r/analogcommunity. \nas a schools task -----> we !!!  -----> have !!!  -----> to !!!  -----> design !!!  a \"survival kit\" the interpretation is up -----> to !!!  us, it has -----> to !!!  be interesting, and something new. \nas a film photographer myself i thought i would make a film photographers survival kit. \nnow my main idea is a repari kit/first necessities for any film shooter in the field, but i would like to hear your thought and input in this. \ni have a little fabric pouch where i keep a shutter release cable, a cpl filter, spare lr44 batteries taped togeather with black electricians tape (to use as an emergency light seal), a flathead screwdriver and microfiber cloth. \ni would like to know if you have or would like a \"survival kit\" similar to this (but a better thought out one), what tools and things do you take with you and maybe some stories of repairing a camera mid shoot in the field. \nthank you all in advence and i hope to see lots of opinions! \ncheers and happy shooting!", "sortedWord": "None", "Identifyer": null, "identifyer": 94254, "year": "2019"}, {"autor": "BigRedHair92", "date": "2019-05-26 04:58:29", "content": "Graphic for Watermark /!/ I want to switch from the text that I currently use to a graphic that I design for my watermark. I more or less know what I want to do, but I'm not sure where to go to make it. What sites/resources do you use to make these? I have Lightroom but not Photoshop.", "link": "https://www.reddit.com/r/photography/comments/bt44ct/graphic_for_watermark/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "graphic for watermark /!/ -----> i !!!  want to switch from the text that -----> i !!!  currently use to a graphic that -----> i !!!  -----> design !!!  for my watermark. i more or less know what i want to do, but i'm not sure where to go to make it. what sites/resources do you use to make these? i have lightroom but not photoshop.", "sortedWord": "None", "Identifyer": null, "identifyer": 5500, "year": "2019"}, {"autor": "thesunartworks", "date": "2019-06-13 06:06:13", "content": "Its My Blog….So its ME Time now… MY HOBBIES /!/ My hobby is\n\n**cooking**\n=======\n\n**drawing**\n=======\n\n**listening music**\n===============\n\n_However I always prefer Drawing._\n\nEvery one of us has some kind of liking/ disliking for certain things in life. Similarly I love drawing because drawing do not cost much and is always fun. I cannot imagine a colorful life without drawing. My greatest inspiration is my sister who always encourages me to design her dresses. It is my believe that to display your art you do not have to be a great artist.\n\nYou just have to make a unique piece. So get your paint brush and pencil and start drawing.When I am blue I cheer myself up by drawing something so that I can make myself happy. Drawing is a way for me to show my creativity. However drawing is not as easy as it seems to be. It needs a lot of devotion as well as practice. I can never feel bored when I have my colors with me. My colors are my best friend.\n\nI like drawing since I was 6 years old. I like to make unrealistic things look realistic through drawing. Drawing is the perfect way to make things look alive. I imagine all kinds of strange things to show it on a piece of paper such as hell &amp; demons, a beautiful house in heaven etc.I have decorated my house with lot of my drawings. Drawing has now become the most important part of my life. But most of the times I am unable to take out much time due to my studies and social life. But still I manage to take out sometime and practice to improve my drawing.  My leisure hours are always occupied to my drawing paper, pen and brush.\n\nThe strangest thing about my hobby is that nobody taught me how to paint. Even when I was in school drawing was not my subject. I learnt it by myself and later got inspiration by my parents. I learnt few concepts through text book containing different types of sketches. I have always intimated everything from those books such as rivers, hills, trees, human faces, clouds and animals. With days my drawing improved step by steps &amp; is still improving. I constantly make efforts to retain my hobby.\n\nOther than drawing, I like reading whether it is newspaper, news, novels, G K book or any knowledgeable book written by any good author. I always read story books, newspaper, magazines, and any other material that I find interesting in my free time. This hobby of reading books of mine was first noticed by my father and he motivated me by saying that it is a very good habit given to you naturally, never let this habit off and keep it in practice.\n\n \n\n   \n   \n from WordPress http://bit.ly/2WGWlx7", "link": "https://www.reddit.com/r/photography/comments/c025hb/its_my_blogso_its_me_time_now_my_hobbies/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "its my blog….so its me time now… my hobbies /!/ my hobby is\n\n**cooking**\n=======\n\n**drawing**\n=======\n\n**listening music**\n===============\n\n_however i always prefer drawing._\n\nevery one of us has some kind of liking/ disliking for certain things in life. similarly i love drawing because drawing do not cost much and is always fun. i cannot imagine a colorful life without drawing. my greatest inspiration is my sister who always encourages -----> me !!!  -----> to !!!  -----> design !!!  her dresses. it is my believe that to display your art you do not have to be a great artist.\n\nyou just have to make a unique piece. so get your paint brush and pencil and start drawing.when i am blue i cheer myself up by drawing something so that i can make myself happy. drawing is a way for me to show my creativity. however drawing is not as easy as it seems to be. it needs a lot of devotion as well as practice. i can never feel bored when i have my colors with me. my colors are my best friend.\n\ni like drawing since i was 6 years old. i like to make unrealistic things look realistic through drawing. drawing is the perfect way to make things look alive. i imagine all kinds of strange things to show it on a piece of paper such as hell &amp; demons, a beautiful house in heaven etc.i have decorated my house with lot of my drawings. drawing has now become the most important part of my life. but most of the times i am unable to take out much time due to my studies and social life. but still i manage to take out sometime and practice to improve my drawing.  my leisure hours are always occupied to my drawing paper, pen and brush.\n\nthe strangest thing about my hobby is that nobody taught me how to paint. even when i was in school drawing was not my subject. i learnt it by myself and later got inspiration by my parents. i learnt few concepts through text book containing different types of sketches. i have always intimated everything from those books such as rivers, hills, trees, human faces, clouds and animals. with days my drawing improved step by steps &amp; is still improving. i constantly make efforts to retain my hobby.\n\nother than drawing, i like reading whether it is newspaper, news, novels, g k book or any knowledgeable book written by any good author. i always read story books, newspaper, magazines, and any other material that i find interesting in my free time. this hobby of reading books of mine was first noticed by my father and he motivated me by saying that it is a very good habit given to you naturally, never let this habit off and keep it in practice.\n\n \n\n   \n   \n from wordpress http://bit.ly/2wgwlx7", "sortedWord": "None", "Identifyer": null, "identifyer": 5671, "year": "2019"}, {"autor": "avenoir_fl", "date": "2019-07-14 19:19:25", "content": "I’m looking for a photo to use as album art. /!/ Hi there Reddit, \n\nI’m releasing a song tomorrow and I am having a hard time deciding what to use for album artwork. I typically design my own album artwork in photoshop and illustrator but because it’s just a single I don’t want to use the album art I already designed.\n\nThis is a non commercial release. I’m giving the song away for free. If anyone has a photo that they wouldn’t mind allowing me to use I would greatly appreciate it. I wouldn’t edit the photo at all except to add the artist name and song name on plain text. \n\nI’m open to any ideas for photos and can send a copy of the song to anyone who wants to hear it first. I will credit the photographer in whatever way they see fit. The song is being released tomorrow. I am aware I am a slacker.", "link": "https://www.reddit.com/r/photography/comments/cd6z1o/im_looking_for_a_photo_to_use_as_album_art/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i typically design", "selectorShort": "design", "MarkedSent": "i’m looking for a photo to use as album art. /!/ hi there reddit, \n\ni’m releasing a song tomorrow and i am having a hard time deciding what to use for album artwork. -----> i !!!  -----> typically !!!  -----> design !!!  my own album artwork in photoshop and illustrator but because it’s just a single -----> i !!!  don’t want to use the album art -----> i !!!  already designed.\n\nthis is a non commercial release. i’m giving the song away for free. if anyone has a photo that they wouldn’t mind allowing me to use i would greatly appreciate it. i wouldn’t edit the photo at all except to add the artist name and song name on plain text. \n\ni’m open to any ideas for photos and can send a copy of the song to anyone who wants to hear it first. i will credit the photographer in whatever way they see fit. the song is being released tomorrow. i am aware i am a slacker.", "sortedWord": "None", "Identifyer": null, "identifyer": 6296, "year": "2019"}, {"autor": "Stompya", "date": "2019-10-03 18:22:36", "content": "Can I convince my Canon camera to play back an edited image? /!/ *The goal:* I want to have a custom viewfinder mask applied to my viewscreen (Canon EOS RP).\n\n*The plan:* I designed the mask in Photoshop, and if I can make it appear on the viewscreen then I would use it as a guide to draw the lines on a clear screen protector.\n\n*The problem:* when I put the template image on a camera card, the camera says it \"Can not play back image\".\n\n*Failed attempts* (things I have tried):\n*Different camera cards \n*using exact same image dimensions\n*using the same naming format (i.e. IMG_0123.JPG)\n*.JPG vs .jpg\n*exporting as 'standard', 'optimized', and 'progressive'\n*cursing under my breath\n\nSo far, no luck.  Has anyone had success with this and can anyone lend insight into how/why my camera is 'detecting' photos it didn't capture and then refusing to show them?  (Seems a bit snobby, tbh.)", "link": "https://www.reddit.com/r/photography/comments/dcuv50/can_i_convince_my_canon_camera_to_play_back_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "can i convince my canon camera to play back an edited image? /!/ *the goal:* i want to have a custom viewfinder mask applied to my viewscreen (canon eos rp).\n\n*the plan:* -----> i !!!  -----> designed !!!  the mask in photoshop, and if -----> i !!!  can make it appear on the viewscreen then -----> i !!!  would use it as a guide to draw the lines on a clear screen protector.\n\n*the problem:* when i put the template image on a camera card, the camera says it \"can not play back image\".\n\n*failed attempts* (things i have tried):\n*different camera cards \n*using exact same image dimensions\n*using the same naming format (i.e. img_0123.jpg)\n*.jpg vs .jpg\n*exporting as 'standard', 'optimized', and 'progressive'\n*cursing under my breath\n\nso far, no luck.  has anyone had success with this and can anyone lend insight into how/why my camera is 'detecting' photos it didn't capture and then refusing to show them?  (seems a bit snobby, tbh.)", "sortedWord": "None", "Identifyer": null, "identifyer": 6687, "year": "2019"}, {"autor": "notanexus6", "date": "2019-12-23 16:22:10", "content": "Have you ever had security called on you? /!/ I’m not sure if this is the right place, but I was just taking photographs at a museum that I helped design at a previous job. \n\nI was in town and decided to stop by and take some photographs and had some woman who worked there cause a scene and call security on me. \n\nHas this happened to anyone before?", "link": "https://www.reddit.com/r/photography/comments/eemo8u/have_you_ever_had_security_called_on_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i helped design", "selectorShort": "design", "MarkedSent": "have you ever had security called on you? /!/ -----> i !!! ’m not sure if this is the right place, but -----> i !!!  was just taking photographs at a museum that -----> i !!!  -----> helped !!!  -----> design !!!  at a previous job. \n\ni was in town and decided to stop by and take some photographs and had some woman who worked there cause a scene and call security on me. \n\nhas this happened to anyone before?", "sortedWord": "None", "Identifyer": null, "identifyer": 8072, "year": "2019"}, {"autor": "baronsindo", "date": "2019-12-15 23:20:01", "content": "Power Your Dreams with Xbox Series X, Available Holiday 2020 /!/ **_Xbox Game Studios unveils Senua’s Saga: Hellblade II, a new chapter in the award-winning Hellblade story from Ninja Theory_**\n\nFor eighteen years and three console generations, the Xbox community has shown us the power both games and fun can have on all of us. As we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. With the new Xbox Series X, we will realize that vision. \n\nXbox Series X will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. Its industrial design enables us to deliver four times the processing power of Xbox One X in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. We also designed Xbox Series X to support both vertical and horizontal orientation. It’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nThe name Xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at Microsoft. It also signifies our belief that a gaming console should be for just that – gaming.\n\nAlongside Xbox Series X, we also unveiled the new Xbox Wireless Controller. Its size and shape have been refined to accommodate an even wider range of people, and it also features a new Share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the Xbox Elite Wireless Controller Series 2. The new Xbox Wireless Controller will be compatible with Xbox One and Windows 10 PCs, and will be included with every Xbox Series X.\n\nThe possibilities of what Xbox Series X enables developers to achieve was also brought to life this evening with the unveiling of _Senua’s Saga: Hellblade II_. A sequel to the award-winning _Hellblade: Senua’s Sacrifice_ from world-renowned developers Ninja Theory, the game is being built to leverage the full power of Xbox Series X.  The footage shared tonight was captured in-engine and reflects the power of Xbox Series X available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **Bringing Developers’ Dreams to Life with Xbox Series X**\n\nGames today deliver amazing visuals and tell an array of different and deep stories.  That’s why, when we started work on Xbox Series X, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. With Xbox Series X, we will elevate the way games look, play and feel. We will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nFrom a technical standpoint, this will manifest as world-class visuals in 4K at 60FPS, with the possibility of up to 120FPS, including support for Variable Refresh Rate (VRR), and 8K capability. Powered by our custom-designed processor leveraging the latest Zen 2 and next-generation RDNA architecture from our partners at AMD, Xbox Series X will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  Additionally, our patented Variable Rate Shading (VRS) technology will allow developers to get even more out of the Xbox Series X GPU and our next-generation SSD will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nWe are minimizing latency by leveraging technology such as Auto Low Latency Mode (ALLM) and giving developers new functionality like Dynamic Latency Input (DLI) to make Xbox Series X the most responsive console ever.  Xbox Series X is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. Xbox Series X will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **One Console, Four Generations of Gaming**\n\nOne of the things we’re most proud of with Xbox Series X is the promise we’re delivering to our fans who have and continue to invest with Xbox. Thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your Xbox One gaming accessories, and industry-leading services like Xbox Game Pass to be available when you power on your Xbox Series X in Holiday 2020.\n\nBuilding on our compatibility promise, with Xbox Series X we’re also investing in consumer-friendly pathways to game ownership across generations. Leading the way with our first-party titles including _Halo Infinite_ in 2020, we’re committed to ensuring that games from Xbox Game Studios support cross-generation entitlements and that your Achievements and game saves are shared across devices.  As we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our Xbox offering.  Game creators around the globe are already hard at work building content for Xbox Series X and our 15 Xbox Game Studios are developing the largest and most creatively diverse lineup of Xbox exclusive games in our history. On behalf of Team Xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nThe post [Power Your Dreams with Xbox Series X, Available Holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [Bulky Face](https://www.bulkyface.com).\n\n   \n   \n from WordPress https://ift.tt/2PLIyiN", "link": "https://www.reddit.com/r/photography/comments/eb6gs8/power_your_dreams_with_xbox_series_x_available/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we also designed", "selectorShort": "design", "MarkedSent": "power your dreams with xbox series x, available holiday 2020 /!/ **_xbox game studios unveils senua’s saga: hellblade ii, a new chapter in the award-winning hellblade story from ninja theory_**\n\nfor eighteen years and three console generations, the xbox community has shown us the power both games and fun can have on all of us. as we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. with the new xbox series x, we will realize that vision. \n\nxbox series x will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. its industrial design enables us to deliver four times the processing power of xbox one x in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. -----> we !!!  -----> also !!!  -----> designed !!!  xbox series x to support both vertical and horizontal orientation. it’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nthe name xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at microsoft. it also signifies our belief that a gaming console should be for just that – gaming.\n\nalongside xbox series x, we also unveiled the new xbox wireless controller. its size and shape have been refined to accommodate an even wider range of people, and it also features a new share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the xbox elite wireless controller series 2. the new xbox wireless controller will be compatible with xbox one and windows 10 pcs, and will be included with every xbox series x.\n\nthe possibilities of what xbox series x enables developers to achieve was also brought to life this evening with the unveiling of _senua’s saga: hellblade ii_. a sequel to the award-winning _hellblade: senua’s sacrifice_ from world-renowned developers ninja theory, the game is being built to leverage the full power of xbox series x.  the footage shared tonight was captured in-engine and reflects the power of xbox series x available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **bringing developers’ dreams to life with xbox series x**\n\ngames today deliver amazing visuals and tell an array of different and deep stories.  that’s why, when we started work on xbox series x, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. with xbox series x, we will elevate the way games look, play and feel. we will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nfrom a technical standpoint, this will manifest as world-class visuals in 4k at 60fps, with the possibility of up to 120fps, including support for variable refresh rate (vrr), and 8k capability. powered by our custom-designed processor leveraging the latest zen 2 and next-generation rdna architecture from our partners at amd, xbox series x will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  additionally, our patented variable rate shading (vrs) technology will allow developers to get even more out of the xbox series x gpu and our next-generation ssd will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nwe are minimizing latency by leveraging technology such as auto low latency mode (allm) and giving developers new functionality like dynamic latency input (dli) to make xbox series x the most responsive console ever.  xbox series x is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. xbox series x will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **one console, four generations of gaming**\n\none of the things we’re most proud of with xbox series x is the promise we’re delivering to our fans who have and continue to invest with xbox. thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your xbox one gaming accessories, and industry-leading services like xbox game pass to be available when you power on your xbox series x in holiday 2020.\n\nbuilding on our compatibility promise, with xbox series x we’re also investing in consumer-friendly pathways to game ownership across generations. leading the way with our first-party titles including _halo infinite_ in 2020, we’re committed to ensuring that games from xbox game studios support cross-generation entitlements and that your achievements and game saves are shared across devices.  as we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our xbox offering.  game creators around the globe are already hard at work building content for xbox series x and our 15 xbox game studios are developing the largest and most creatively diverse lineup of xbox exclusive games in our history. on behalf of team xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nthe post [power your dreams with xbox series x, available holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [bulky face](https://www.bulkyface.com).\n\n   \n   \n from wordpress https://ift.tt/2pliyin", "sortedWord": "None", "Identifyer": null, "identifyer": 8224, "year": "2019"}, {"autor": "throwmedownthewell07", "date": "2021-01-13 14:14:18", "content": "What can I ask in an ad for a photographer? /!/ I'm looking to hire a photographer to photograph the products I design primarily for use on social media. I haven't ever hired anyone before, so I don't really know what I should include in my ad! \n\nHow I would like it to work, to keep in line with covid (my country is in lockdown), is I would package and send my products to the photographer, they would style and photograph them, and then send me the images.\n\nI have a really clear image of what kind of content I'm looking for. My question is how best to communicate this to a potential photographer. I currently have dozens of photos from other brands/ Instagram accounts I have saved I use as inspiration when I do my own amateur photography. I'm wondering if it's appropriate to send these images to the person I hire and ask them to be inspired by them too? Is that okay? \n\nWhat kind of things do I need to include in my 'brief' to them?", "link": "https://www.reddit.com/r/photography/comments/kwh72a/what_can_i_ask_in_an_ad_for_a_photographer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "what can i ask in an ad for a photographer? /!/ -----> i !!! 'm looking to hire a photographer to photograph the products -----> i !!!  -----> design !!!  primarily for use on social media. i haven't ever hired anyone before, so i don't really know what i should include in my ad! \n\nhow i would like it to work, to keep in line with covid (my country is in lockdown), is i would package and send my products to the photographer, they would style and photograph them, and then send me the images.\n\ni have a really clear image of what kind of content i'm looking for. my question is how best to communicate this to a potential photographer. i currently have dozens of photos from other brands/ instagram accounts i have saved i use as inspiration when i do my own amateur photography. i'm wondering if it's appropriate to send these images to the person i hire and ask them to be inspired by them too? is that okay? \n\nwhat kind of things do i need to include in my 'brief' to them?", "sortedWord": "None", "Identifyer": null, "identifyer": 101, "year": "2021"}, {"autor": "GroundbreakingTea613", "date": "2021-01-21 10:23:37", "content": "Designed by Nature", "link": "https://www.reddit.com/r/photography/comments/l1vv2e/designed_by_nature/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  by nature", "sortedWord": "None", "Identifyer": null, "identifyer": 181, "year": "2021"}, {"autor": "GroundbreakingTea613", "date": "2021-01-21 10:21:06", "content": "Designed by Nature (Photographer: Todd Trapani)", "link": "https://www.reddit.com/r/photography/comments/l1vtzp/designed_by_nature_photographer_todd_trapani/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  by nature (photographer: todd trapani)", "sortedWord": "None", "Identifyer": null, "identifyer": 182, "year": "2021"}, {"autor": "jonystarck", "date": "2021-02-04 07:58:21", "content": "Swoop is a picture frame I designed that makes it simple to mount and hang photos yourself. I would love to hear your feedback on the overall design and see if there is a general interest in the photography community to improve how we mount and display printed photography and artwork.", "link": "https://www.reddit.com/r/photography/comments/lcasos/swoop_is_a_picture_frame_i_designed_that_makes_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "swoop is a picture frame -----> i !!!  -----> designed !!!  that makes it simple to mount and hang photos yourself. i would love to hear your feedback on the overall design and see if there is a general interest in the photography community to improve how we mount and display printed photography and artwork.", "sortedWord": "None", "Identifyer": null, "identifyer": 254, "year": "2021"}, {"autor": "InevitableVolume5744", "date": "2021-04-15 00:43:57", "content": "camera beckpack /!/  \n\n# NOMATIC TEAM\n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. We design products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more \n\nhttps://nomatic.kckb.st/saba124\n\n*Processing video 0wr7vih5f8t61...*", "link": "https://www.reddit.com/r/photography/comments/mr40vy/camera_beckpack/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we design", "selectorShort": "design", "MarkedSent": "camera beckpack /!/  \n\n# nomatic team\n\nnomatic is a kickstarter born company. this is our 11th kickstarter campaign, we love it here, and we plan to keep coming back. kickstarter allows us to receive real feedback from real customers before we even manufacture our products. this way, we are able to deliver a product we are sure you will love. -----> we !!!  -----> design !!!  products that help you have confidence as you live life on the move. thank you for believing in us!\n\nthere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. however, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. we will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. thanks for believing in us!\n\nfeel free to learn more \n\nhttps://nomatic.kckb.st/saba124\n\n*processing video 0wr7vih5f8t61...*", "sortedWord": "None", "Identifyer": null, "identifyer": 1204, "year": "2021"}, {"autor": "InevitableVolume5744", "date": "2021-04-15 00:09:27", "content": "camera beck pack /!/  \n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. We design products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more\n\n[https://nomatic.kckb.st/saba124](https://nomatic.kckb.st/saba124)\n\n![video](5cvlxqoaa8t61 \"s\")", "link": "https://www.reddit.com/r/photography/comments/mr3ga7/camera_beck_pack/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "we design", "selectorShort": "design", "MarkedSent": "camera beck pack /!/  \n\nnomatic is a kickstarter born company. this is our 11th kickstarter campaign, we love it here, and we plan to keep coming back. kickstarter allows us to receive real feedback from real customers before we even manufacture our products. this way, we are able to deliver a product we are sure you will love. -----> we !!!  -----> design !!!  products that help you have confidence as you live life on the move. thank you for believing in us!\n\nthere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. however, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. we will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. thanks for believing in us!\n\nfeel free to learn more\n\n[https://nomatic.kckb.st/saba124](https://nomatic.kckb.st/saba124)\n\n![video](5cvlxqoaa8t61 \"s\")", "sortedWord": "None", "Identifyer": null, "identifyer": 1206, "year": "2021"}, {"autor": "Timmy0l", "date": "2021-07-15 14:14:09", "content": "Timmy0l: I will design squarespace website, squarespace website, create squarespace website, do for $35 on fiverr.com /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/oktp2r/timmy0l_i_will_design_squarespace_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will design", "selectorShort": "design", "MarkedSent": "timmy0l: -----> i !!!  -----> will !!!  -----> design !!!  squarespace website, squarespace website, create squarespace website, do for $35 on fiverr.com /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 2258, "year": "2021"}, {"autor": "Airsoftpieceofcake", "date": "2021-01-10 01:18:28", "content": "Decently easy to work with free editor? /!/ So guys I'm looking for a basic editor where I want to design a logo. Something with basic features like background removing and cropping out stuff, blending etc. I don't want it to be super hard to work with as i only have a limited time to learn how to use it. Thx.", "link": "https://www.reddit.com/r/photography/comments/ku45g4/decently_easy_to_work_with_free_editor/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to design", "selectorShort": "design", "MarkedSent": "decently easy to work with free editor? /!/ so guys -----> i !!! 'm looking for a basic editor where -----> i !!!  -----> want !!!  -----> to !!!  -----> design !!!  a logo. something with basic features like background removing and cropping out stuff, blending etc. i don't want it to be super hard to work with as i only have a limited time to learn how to use it. thx.", "sortedWord": "None", "Identifyer": null, "identifyer": 4084, "year": "2021"}, {"autor": "Substantial_Ad8238", "date": "2021-01-09 23:18:04", "content": "Professional Photographers could I get a estimate of how much I should be charging hourly based on my folio? /!/ My day job is a Software Engineer at a large tech company. However, previously I've been a visual designer so I can design. / illustrate at the F100 level / commercial level. In graduate school I spent close to 2 years + shooting daily and editorials, reading books, taking courses, and talking to mentors / gaining critique on my work. Afterwards I learned to combine my Creative Suite abilities with my photography to enhance the quality of my image. I have done over 16 portrait sessions for free so that I could learn portraiture. I got to a point where I turned down close to 8-9 people out of the remaining 15 people who signed up even when they offered to pay. \n\nI'm reaching an area in my life now where I\"m doing financial planning / learning about literacy and investing in mutual funds, bonds, ETFS, 401K, Roth etc. I want to know if it's worth it to continue photography as a profession and just start charging now, if so how much should I be charging on my work samples / current level? I have been featured on NY Times, and Business Insider, and sold some images on getty, but never really considered making serious money from the hobby.\n\nMy major concern is that I might be facing loss aversion and dispersion where I\"m investing more time and etc into a hobby that has loss me considerably a ton of cash lol, where I could most likely spend less time and effort compounding my money in passive income / more efficiently / higher margins.\n\nI feel that I could probably charge around 200$ an hour + some post editing up to 5 portraits that I air brush, but in terms of hourly time spent I would still be losing a ton of $$ compared to my day job or even passive income...I enjoy the hobby, but I don't see myself shooting as frequently anymore now that I graduated, and am seriously considering investing as a hobby / real estate. However, at the same time if I sold all my gear it would be about 60%, I would take close to a 40% depreciation hit.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y6odp9gc3ea61.jpg?width=1433&amp;format=pjpg&amp;auto=webp&amp;s=06657416f65378aa32029d02ba956dd9c0ad8daf\n\nhttps://preview.redd.it/wouwtdgc3ea61.jpg?width=1360&amp;format=pjpg&amp;auto=webp&amp;s=cbd18b755f52951f9cfa411d60784481fe717223\n\nhttps://preview.redd.it/0wsk4jhc3ea61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=a9a91b50303d864af1cfdd7f0ca0bbb78da0fa5d\n\nhttps://preview.redd.it/vg2lgihc3ea61.jpg?width=1728&amp;format=pjpg&amp;auto=webp&amp;s=ed4025b02f8896540e50c13b6c76ce029e1bb3f4\n\nhttps://preview.redd.it/ndefy8gc3ea61.jpg?width=1599&amp;format=pjpg&amp;auto=webp&amp;s=bd780a4cef435fe6a0573859cf53d4f6bc8c47a5\n\nhttps://preview.redd.it/iajx6ggc3ea61.jpg?width=1362&amp;format=pjpg&amp;auto=webp&amp;s=911f71d5f0fd4c138c013d0532f462dda1aa5150\n\nhttps://preview.redd.it/41jl6jhc3ea61.jpg?width=1609&amp;format=pjpg&amp;auto=webp&amp;s=d4e96cd0c3f8e3a03dba22962ab6e1310e3a4d02\n\nhttps://preview.redd.it/t4qwg6gc3ea61.jpg?width=554&amp;format=pjpg&amp;auto=webp&amp;s=9fe43faf7ef53f079e26917e2b66db89ccdf33b0\n\nhttps://preview.redd.it/58lkabgc3ea61.jpg?width=1412&amp;format=pjpg&amp;auto=webp&amp;s=580f33221a7490b982f9d3844c0635dd1c323367\n\nhttps://preview.redd.it/achd3hgc3ea61.jpg?width=1913&amp;format=pjpg&amp;auto=webp&amp;s=6c9dd72c7fff16b41a555378f6475faf60153b26\n\nhttps://preview.redd.it/m2pr49gc3ea61.jpg?width=1373&amp;format=pjpg&amp;auto=webp&amp;s=185f063192a92cbd405609f262cc5331c6cfa801\n\nhttps://preview.redd.it/37n02igc3ea61.jpg?width=1230&amp;format=pjpg&amp;auto=webp&amp;s=e1c264fe5f96b8cbd3ea0cebad19cb323d3b09ea\n\nhttps://preview.redd.it/6zls27gc3ea61.jpg?width=1442&amp;format=pjpg&amp;auto=webp&amp;s=828275ac2e525356ee70c2edf331c817480c3021\n\nhttps://preview.redd.it/g34iwpgc3ea61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=9530f5755e048bdafb3e2a080736617bc8f77aae\n\nhttps://preview.redd.it/99itnshc3ea61.jpg?width=2368&amp;format=pjpg&amp;auto=webp&amp;s=98ed37690b82cb611f5cf7c4e4b7449e37070397\n\nhttps://preview.redd.it/q2xd6ihc3ea61.jpg?width=1863&amp;format=pjpg&amp;auto=webp&amp;s=dd661f923387f05bc5e7e4fe86ffb70f73473965\n\nhttps://preview.redd.it/j6h34bgc3ea61.jpg?width=1942&amp;format=pjpg&amp;auto=webp&amp;s=44415075d0b59983d7cb92d4e079537902fa2f59\n\nhttps://preview.redd.it/wzwpqhgc3ea61.jpg?width=1392&amp;format=pjpg&amp;auto=webp&amp;s=846a5605469345d80af79b3c2047c28db9a7bd0f\n\nhttps://preview.redd.it/jumv5mgc3ea61.jpg?width=1928&amp;format=pjpg&amp;auto=webp&amp;s=7231680f0513e6f927fd1b4626e1e1d570653d23\n\nhttps://preview.redd.it/ejqfmkgc3ea61.jpg?width=1479&amp;format=pjpg&amp;auto=webp&amp;s=c0ecdddf174a76c4c5d45ec8879f541261a185ee", "link": "https://www.reddit.com/r/photography/comments/ku1y1x/professional_photographers_could_i_get_a_estimate/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can design", "selectorShort": "design", "MarkedSent": "professional photographers could i get a estimate of how much i should be charging hourly based on my folio? /!/ my day job is a software engineer at a large tech company. however, previously -----> i !!! 've been a visual designer so -----> i !!!  -----> can !!!  -----> design !!! . / illustrate at the f100 level / commercial level. in graduate school i spent close to 2 years + shooting daily and editorials, reading books, taking courses, and talking to mentors / gaining critique on my work. afterwards i learned to combine my creative suite abilities with my photography to enhance the quality of my image. i have done over 16 portrait sessions for free so that i could learn portraiture. i got to a point where i turned down close to 8-9 people out of the remaining 15 people who signed up even when they offered to pay. \n\ni'm reaching an area in my life now where i\"m doing financial planning / learning about literacy and investing in mutual funds, bonds, etfs, 401k, roth etc. i want to know if it's worth it to continue photography as a profession and just start charging now, if so how much should i be charging on my work samples / current level? i have been featured on ny times, and business insider, and sold some images on getty, but never really considered making serious money from the hobby.\n\nmy major concern is that i might be facing loss aversion and dispersion where i\"m investing more time and etc into a hobby that has loss me considerably a ton of cash lol, where i could most likely spend less time and effort compounding my money in passive income / more efficiently / higher margins.\n\ni feel that i could probably charge around 200$ an hour + some post editing up to 5 portraits that i air brush, but in terms of hourly time spent i would still be losing a ton of $$ compared to my day job or even passive income...i enjoy the hobby, but i don't see myself shooting as frequently anymore now that i graduated, and am seriously considering investing as a hobby / real estate. however, at the same time if i sold all my gear it would be about 60%, i would take close to a 40% depreciation hit.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y6odp9gc3ea61.jpg?width=1433&amp;format=pjpg&amp;auto=webp&amp;s=06657416f65378aa32029d02ba956dd9c0ad8daf\n\nhttps://preview.redd.it/wouwtdgc3ea61.jpg?width=1360&amp;format=pjpg&amp;auto=webp&amp;s=cbd18b755f52951f9cfa411d60784481fe717223\n\nhttps://preview.redd.it/0wsk4jhc3ea61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=a9a91b50303d864af1cfdd7f0ca0bbb78da0fa5d\n\nhttps://preview.redd.it/vg2lgihc3ea61.jpg?width=1728&amp;format=pjpg&amp;auto=webp&amp;s=ed4025b02f8896540e50c13b6c76ce029e1bb3f4\n\nhttps://preview.redd.it/ndefy8gc3ea61.jpg?width=1599&amp;format=pjpg&amp;auto=webp&amp;s=bd780a4cef435fe6a0573859cf53d4f6bc8c47a5\n\nhttps://preview.redd.it/iajx6ggc3ea61.jpg?width=1362&amp;format=pjpg&amp;auto=webp&amp;s=911f71d5f0fd4c138c013d0532f462dda1aa5150\n\nhttps://preview.redd.it/41jl6jhc3ea61.jpg?width=1609&amp;format=pjpg&amp;auto=webp&amp;s=d4e96cd0c3f8e3a03dba22962ab6e1310e3a4d02\n\nhttps://preview.redd.it/t4qwg6gc3ea61.jpg?width=554&amp;format=pjpg&amp;auto=webp&amp;s=9fe43faf7ef53f079e26917e2b66db89ccdf33b0\n\nhttps://preview.redd.it/58lkabgc3ea61.jpg?width=1412&amp;format=pjpg&amp;auto=webp&amp;s=580f33221a7490b982f9d3844c0635dd1c323367\n\nhttps://preview.redd.it/achd3hgc3ea61.jpg?width=1913&amp;format=pjpg&amp;auto=webp&amp;s=6c9dd72c7fff16b41a555378f6475faf60153b26\n\nhttps://preview.redd.it/m2pr49gc3ea61.jpg?width=1373&amp;format=pjpg&amp;auto=webp&amp;s=185f063192a92cbd405609f262cc5331c6cfa801\n\nhttps://preview.redd.it/37n02igc3ea61.jpg?width=1230&amp;format=pjpg&amp;auto=webp&amp;s=e1c264fe5f96b8cbd3ea0cebad19cb323d3b09ea\n\nhttps://preview.redd.it/6zls27gc3ea61.jpg?width=1442&amp;format=pjpg&amp;auto=webp&amp;s=828275ac2e525356ee70c2edf331c817480c3021\n\nhttps://preview.redd.it/g34iwpgc3ea61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=9530f5755e048bdafb3e2a080736617bc8f77aae\n\nhttps://preview.redd.it/99itnshc3ea61.jpg?width=2368&amp;format=pjpg&amp;auto=webp&amp;s=98ed37690b82cb611f5cf7c4e4b7449e37070397\n\nhttps://preview.redd.it/q2xd6ihc3ea61.jpg?width=1863&amp;format=pjpg&amp;auto=webp&amp;s=dd661f923387f05bc5e7e4fe86ffb70f73473965\n\nhttps://preview.redd.it/j6h34bgc3ea61.jpg?width=1942&amp;format=pjpg&amp;auto=webp&amp;s=44415075d0b59983d7cb92d4e079537902fa2f59\n\nhttps://preview.redd.it/wzwpqhgc3ea61.jpg?width=1392&amp;format=pjpg&amp;auto=webp&amp;s=846a5605469345d80af79b3c2047c28db9a7bd0f\n\nhttps://preview.redd.it/jumv5mgc3ea61.jpg?width=1928&amp;format=pjpg&amp;auto=webp&amp;s=7231680f0513e6f927fd1b4626e1e1d570653d23\n\nhttps://preview.redd.it/ejqfmkgc3ea61.jpg?width=1479&amp;format=pjpg&amp;auto=webp&amp;s=c0ecdddf174a76c4c5d45ec8879f541261a185ee", "sortedWord": "None", "Identifyer": null, "identifyer": 4096, "year": "2021"}, {"autor": "RainbowShade", "date": "2021-03-14 16:50:13", "content": "Help with future website? /!/ Hi all, so I'm an amateur photographer and I was thinking of finally making a website for myself. My issue right now, is that I don't know what type of photography I want my website to focus on. I love portraiture, but I also really like to travel. Most photography websites I checked for inspiration were either one or the other. \n\nI was thinking of having a \"Portfolio\" tab, and a \"Projects\" tab on the homepage. Portfolio would be where all the portraits, fashion, style, etc. would go, and Projects is where I'd put all the travel, street, and landscape stuff. However, I don't know if this is a good idea, since like I stated before, all the websites I looked at just focused on one type.\n\nI know that in the end it's *my* website and I can design it however I want, I just would rather keep things organized and simplistic without too much clutter.\n\nAny tips or advice?", "link": "https://www.reddit.com/r/photography/comments/m4yr7t/help_with_future_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can design", "selectorShort": "design", "MarkedSent": "help with future website? /!/ hi all, so i'm an amateur photographer and i was thinking of finally making a website for myself. my issue right now, is that i don't know what type of photography i want my website to focus on. i love portraiture, but i also really like to travel. most photography websites i checked for inspiration were either one or the other. \n\ni was thinking of having a \"portfolio\" tab, and a \"projects\" tab on the homepage. portfolio would be where all the portraits, fashion, style, etc. would go, and projects is where i'd put all the travel, street, and landscape stuff. however, i don't know if this is a good idea, since like i stated before, all the websites i looked at just focused on one type.\n\n-----> i !!!  know that in the end it's *my* website and -----> i !!!  -----> can !!!  -----> design !!!  it however -----> i !!!  want, -----> i !!!  just would rather keep things organized and simplistic without too much clutter.\n\nany tips or advice?", "sortedWord": "None", "Identifyer": null, "identifyer": 5704, "year": "2021"}, {"autor": "thatbasic_a", "date": "2021-05-28 03:26:20", "content": "Wanting to sell my prints /!/ So I've been in serious need of money and I'm thinking about selling some of my B&amp;W prints but I have no clue where to start since I've only been doing it as a part of my design course. My teacher has encouraged me to try sell some of my prints as well.\n\nI don't know how much I should sell them for or where to sell it. I've used a film camera for all photos and developed the film and processed the prints myself in the dark room. I also have 4 prints that are about A2 sized prints that I printed as well.\n\nAny advice for a newcomer trying to sell their work?", "link": "https://www.reddit.com/r/photography/comments/nmonyv/wanting_to_sell_my_prints/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "wanting to sell my prints /!/ so i've been in serious need of money and i'm thinking about selling some of my b&amp;w prints but i have no clue where to start since i've only been doing it as a part of -----> my !!!  -----> design !!!  course. my teacher has encouraged me to try sell some of my prints as well.\n\ni don't know how much i should sell them for or where to sell it. i've used a film camera for all photos and developed the film and processed the prints myself in the dark room. i also have 4 prints that are about a2 sized prints that i printed as well.\n\nany advice for a newcomer trying to sell their work?", "sortedWord": "None", "Identifyer": null, "identifyer": 7279, "year": "2021"}, {"autor": "DuhBulls", "date": "2021-08-27 18:16:33", "content": "A coworker wants to hire me (a hobbyist open to being paid) for portraits of his gf, I want to accept the gig but have no clue how to proceed. /!/ Some backstory: I have been paid to do photography twice in my (25m) life, both times for friends' professional headshots. I think I'm pretty decent at photography but certainly a novice with portraits and Im getting a bad case of imposter syndrome. I'd call this my first real gig ever - I'd love for this to become a \"side hustle\" or at least be able to do a couple gigs a year to fund the hobby. So, I'd be very appreciative if you folks could answer some of my questions or provide some advice you wish you'd gotten at the genesis of your career: \n\nHow do you determine a fair price? What factors add up to get you to that number? Should my price reflect my experience or lack thereof?\n\nShould that price include editing or do you just send over all the images from the shoot unedited and offer editing as a separate service? Should I design a watermark to add to raw images?\n\nWhat apps/tech do you use to store, edit, and send over the end product to your clients? I know adobe well but had to cancel bc expensive, so I'd also accept any recs on free editing tools. \n\nI know I should be using a contract, do you have any resources/tips I could use to help with writing that up? \n\nAnything else I haven't thought of that you would recommend doing? \n\nThank you so much for your time and effort if you choose to reply, much appreciated! I am not oblivious that I might be in over my head here, that's why I came to some pros, so go nuts!", "link": "https://www.reddit.com/r/photography/comments/pcsvg7/a_coworker_wants_to_hire_me_a_hobbyist_open_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "a coworker wants to hire me (a hobbyist open to being paid) for portraits of his gf, i want to accept the gig but have no clue how to proceed. /!/ some backstory: i have been paid to do photography twice in my (25m) life, both times for friends' professional headshots. i think i'm pretty decent at photography but certainly a novice with portraits and im getting a bad case of imposter syndrome. i'd call this my first real gig ever - i'd love for this to become a \"side hustle\" or at least be able to do a couple gigs a year to fund the hobby. so, i'd be very appreciative if you folks could answer some of my questions or provide some advice you wish you'd gotten at the genesis of your career: \n\nhow do you determine a fair price? what factors add up to get you to that number? should my price reflect my experience or lack thereof?\n\nshould that price include editing or do you just send over all the images from the shoot unedited and offer editing as a separate service? should -----> i !!!  -----> design !!!  a watermark to add to raw images?\n\nwhat apps/tech do you use to store, edit, and send over the end product to your clients? i know adobe well but had to cancel bc expensive, so i'd also accept any recs on free editing tools. \n\ni know i should be using a contract, do you have any resources/tips i could use to help with writing that up? \n\nanything else i haven't thought of that you would recommend doing? \n\nthank you so much for your time and effort if you choose to reply, much appreciated! i am not oblivious that i might be in over my head here, that's why i came to some pros, so go nuts!", "sortedWord": "None", "Identifyer": null, "identifyer": 10631, "year": "2021"}, {"autor": "quinnshobbrook", "date": "2021-10-24 22:53:13", "content": "Climbing photography gear /!/  Hi! My name is Quinn and I am a student at Kwantlen Polytechnique University in Vancouver, Canada. I am running a survey for a design project focusing on climbing photography and climbing photography gear, and the habits of those who use it. I was wondering if anyone here would be willing to fill it out. It’s 8 short questions and will take less than 5 minutes to complete. I would ask that you only take this survey if you personally take photos when climbing.\n\nThe results will be used for my design project, looking for any statistical correlations between some of the design decisions to help inform some design decisions.\n\n**Participants will only be recorded by number, not by name or anything else. Data will be deleted by December 31st.**\n\nThe link to the survey is here:\n\n[https://www.jitsutech.ca/climbingphotography?newtest=Y](https://www.jitsutech.ca/climbingphotography?newtest=Y)\n\nThanks in advance to anyone who takes the survey, I really appreciate it! If you have any questions, feel free to comment below.\n\nSorry mods if this isn't allowed, I got no response when I asked permission and but need the results soon.", "link": "https://www.reddit.com/r/photography/comments/qf3a8r/climbing_photography_gear/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "climbing photography gear /!/  hi! my name is quinn and i am a student at kwantlen polytechnique university in vancouver, canada. i am running a survey for a design project focusing on climbing photography and climbing photography gear, and the habits of those who use it. i was wondering if anyone here would be willing to fill it out. it’s 8 short questions and will take less than 5 minutes to complete. i would ask that you only take this survey if you personally take photos when climbing.\n\nthe results will be used for -----> my !!!  -----> design !!!  project, looking for any statistical correlations between some of the -----> design !!!  decisions to help inform some -----> design !!!  decisions.\n\n**participants will only be recorded by number, not by name or anything else. data will be deleted by december 31st.**\n\nthe link to the survey is here:\n\n[https://www.jitsutech.ca/climbingphotography?newtest=y](https://www.jitsutech.ca/climbingphotography?newtest=y)\n\nthanks in advance to anyone who takes the survey, i really appreciate it! if you have any questions, feel free to comment below.\n\nsorry mods if this isn't allowed, i got no response when i asked permission and but need the results soon.", "sortedWord": "None", "Identifyer": null, "identifyer": 11329, "year": "2021"}, {"autor": "Alpha_Red_Panda", "date": "2021-02-14 08:52:24", "content": "Best place to design business cards and best place to print them /!/ I want to redesign my business cards as they're kinda basic from a website I got them last time. These new cards have a specific dimension to them that I want. I want to see where I can design such card and later find someone that can print these specific cards out. TIA", "link": "https://www.reddit.com/r/photography/comments/ljkz58/best_place_to_design_business_cards_and_best/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i can design", "selectorShort": "design", "MarkedSent": "best place to design business cards and best place to print them /!/ i want to redesign my business cards as they're kinda basic from a website i got them last time. these new cards have a specific dimension to them that i want. -----> i !!!  want to see where -----> i !!!  -----> can !!!  -----> design !!!  such card and later find someone that -----> can !!!  print these specific cards out. tia", "sortedWord": "None", "Identifyer": null, "identifyer": 12338, "year": "2021"}, {"autor": "L2Lern", "date": "2021-08-26 17:52:04", "content": "Looking to Give Photography Portfolio Website / Design (Free) /!/ I have designed a fictional photography portfolio as a side project: [https://jmmfl.github.io/](https://jmmfl.github.io/).  \n\n\nI thought it would be great if I could use a real photographer and showcase their work! If you need a new portfolio and like this design, send me a message. We can make small changes to the design (e.g. color, navigation, pages, etc.) for your needs. You'll have to pay for domain / hosting if you don't have them already (I can help you find both).   \n\n\nCheers!  \n\n\n  \nI", "link": "https://www.reddit.com/r/photography/comments/pc4q5k/looking_to_give_photography_portfolio_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have designed", "selectorShort": "design", "MarkedSent": "looking to give photography portfolio website / design (free) /!/ -----> i !!!  -----> have !!!  -----> designed !!!  a fictional photography portfolio as a side project: [https://jmmfl.github.io/](https://jmmfl.github.io/).  \n\n\ni thought it would be great if i could use a real photographer and showcase their work! if you need a new portfolio and like this design, send me a message. we can make small changes to the design (e.g. color, navigation, pages, etc.) for your needs. you'll have to pay for domain / hosting if you don't have them already (i can help you find both).   \n\n\ncheers!  \n\n\n  \ni", "sortedWord": "None", "Identifyer": null, "identifyer": 17432, "year": "2021"}, {"autor": "m00dawg", "date": "2018-01-08 04:29:03", "content": "Starting an Arduino development controller /!/ It kinda started as just a way to warm some water and turned into a bit of a weekend project. Had a lot of fun with it and while it's not very far along, I thought I would share:\n\nhttps://imgur.com/a/Y6q0b\n\nCode is open source (GPLv3) and is here:\n\nhttps://github.com/m00dawg/devdawg\n\nIt's primary mission is to still warm some water but it also can now track a full development process (each of the steps and time remaining). This evening I tested controlling a DC motor which could be used to make an automatic rotary tank, complete with the ability to reverse direction.\n\nBuilding a rotary tank, particularly one that could sit in the same water bath as the chemicals will take quite of bit of designing and 3D printing. I had some ideas on that but honestly writing the code to control all that was easy. Designing gears and a rotary thing, not so much as there are a number of ways to do it. I was pondering how much of it could be 3D printed to make it easier. \n\nI'm not doing anything new here honestly so this is just my take on it while seeing how much could be possible. I haven't seen too many 3D printed type things for this for instance. I found a 3D printed motorized rotary (though of course can't find the link for it) for $80. Likewise I haven't seen any all in one solutions (other than the obvious commercial ones of course). One of the things I really like about Arduino is that it's fairly easy to design custom PCBs you can just drop the chip into and off you go. That would be the endgame here - a complete DIY single circuit board solution that fits in a nice common hobby enclosure along with 3D printed parts to build a processor without a lot of work. Perhaps one that's also modular (so if all you care about is heating water or rotating a tank, you can just get the parts to do that).\n\nAnyways long way to go, not sure I'll get to the end but the journey is fun! And the code is open source for anyone to grab and improve (not much to the code really since many libraries cover some of the more complicated bits, like PID functions).", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7ow30j/starting_an_arduino_development_controller/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "starting an arduino development controller /!/ it kinda started as just a way to warm some water and turned into a bit of a weekend project. had a lot of fun with it and while it's not very far along, i thought i would share:\n\nhttps://imgur.com/a/y6q0b\n\ncode is open source (gplv3) and is here:\n\nhttps://github.com/m00dawg/devdawg\n\nit's primary mission is to still warm some water but it also can now track a full development process (each of the steps and time remaining). this evening i tested controlling a dc motor which could be used to make an automatic rotary tank, complete with the ability to reverse direction.\n\nbuilding a rotary tank, particularly one that could sit in the same water bath as the chemicals will take quite of bit of designing and 3d printing. i had some ideas on that but honestly writing the code to control all that was easy. -----> designing !!!  gears and a rotary thing, not so much as there are a number of ways to do it. i was pondering how much of it could be 3d printed to make it easier. \n\ni'm not doing anything new here honestly so this is just my take on it while seeing how much could be possible. i haven't seen too many 3d printed type things for this for instance. i found a 3d printed motorized rotary (though of course can't find the link for it) for $80. likewise i haven't seen any all in one solutions (other than the obvious commercial ones of course). one of the things i really like about arduino is that it's fairly easy to design custom pcbs you can just drop the chip into and off you go. that would be the endgame here - a complete diy single circuit board solution that fits in a nice common hobby enclosure along with 3d printed parts to build a processor without a lot of work. perhaps one that's also modular (so if all you care about is heating water or rotating a tank, you can just get the parts to do that).\n\nanyways long way to go, not sure i'll get to the end but the journey is fun! and the code is open source for anyone to grab and improve (not much to the code really since many libraries cover some of the more complicated bits, like pid functions).", "sortedWord": "None", "Identifyer": null, "identifyer": 20545, "year": "2018"}, {"autor": "freshpine", "date": "2021-02-27 18:52:38", "content": "Designed and printed myself a handle. Just got to get the right bolt now. Thought they were M6, silly me!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ltup67/designed_and_printed_myself_a_handle_just_got_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  and printed myself a handle. just got to get the right bolt now. thought they were m6, silly me!", "sortedWord": "None", "Identifyer": null, "identifyer": 24926, "year": "2021"}, {"autor": "electricmajesty", "date": "2021-06-06 16:57:51", "content": "Designed and 3D printed a switch holder for the UURig R008", "link": "https://www.reddit.com/r/SonyAlpha/comments/ntq6ro/designed_and_3d_printed_a_switch_holder_for_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  and 3d printed a switch holder for the uurig r008", "sortedWord": "None", "Identifyer": null, "identifyer": 34524, "year": "2021"}, {"autor": "kirillre4", "date": "2021-05-05 09:42:32", "content": "I designed a manual aperture key for old A-mount lenses", "link": "https://www.reddit.com/r/SonyAlpha/comments/n5c2v6/i_designed_a_manual_aperture_key_for_old_amount/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a manual aperture key for old a-mount lenses", "sortedWord": "None", "Identifyer": null, "identifyer": 45275, "year": "2021"}, {"autor": "gameboyjunky", "date": "2020-08-17 04:05:46", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.", "link": "https://www.reddit.com/r/fujifilm/comments/ib74ib/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.", "sortedWord": "None", "Identifyer": null, "identifyer": 63079, "year": "2020"}, {"autor": "gameboyjunky", "date": "2020-08-17 04:03:19", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.", "link": "https://www.reddit.com/r/fujifilm/comments/ib7383/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.", "sortedWord": "None", "Identifyer": null, "identifyer": 63080, "year": "2020"}, {"autor": "[deleted]", "date": "2020-08-17 04:01:28", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors. /!/ [deleted]", "link": "https://www.reddit.com/r/fujifilm/comments/ib72bf/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors. /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 63081, "year": "2020"}, {"autor": "[deleted]", "date": "2020-08-17 03:57:31", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors. /!/ [deleted]", "link": "https://www.reddit.com/r/fujifilm/comments/ib70ck/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors. /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 63082, "year": "2020"}, {"autor": "gameboyjunky", "date": "2020-08-17 03:55:47", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.", "link": "https://www.reddit.com/r/fujifilm/comments/ib6zj5/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.", "sortedWord": "None", "Identifyer": null, "identifyer": 63083, "year": "2020"}, {"autor": "gameboyjunky", "date": "2020-08-16 22:51:38", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.", "link": "https://www.reddit.com/r/fujifilm/comments/ib2ado/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.", "sortedWord": "None", "Identifyer": null, "identifyer": 63088, "year": "2020"}, {"autor": "gameboyjunky", "date": "2020-08-16 22:48:47", "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.", "link": "https://www.reddit.com/r/fujifilm/comments/ib28k3/i_designed_a_splitzer_for_the_fujifilm_sq6_very/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.", "sortedWord": "None", "Identifyer": null, "identifyer": 63089, "year": "2020"}, {"autor": "[deleted]", "date": "2020-04-27 14:43:40", "content": "I’m not a professional, but I’ve always wanted to have a business card to give to people I shoot in the streets or for those interested in my work. So I designed this. What do you think? /!/ [deleted]", "link": "https://www.reddit.com/r/fujifilm/comments/g91z9s/im_not_a_professional_but_ive_always_wanted_to/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "i’m not a professional, but i’ve always wanted to have a business card to give to people i shoot in the streets or for those interested in my work. so -----> i !!!  -----> designed !!!  this. what do you think? /!/ [deleted]", "sortedWord": "None", "Identifyer": null, "identifyer": 63836, "year": "2020"}, {"autor": "rapunKzel92", "date": "2019-04-05 15:26:00", "content": "[Academic Research] Usability Test about Online Ratings &amp; Reviews on Sandisk SDXC cards /!/ Hello kind strangers,\n\nI'm Hazel, a student in M. Sc. Usability Engineering at Rhine-Waal University of Applied Sciences, Germany and I'm conducting a thesis research on consumer behaviour on Amazon.com.\n\nThe aim is to understand how people read and write reviews online, given how we have turned to trust peers online on platforms such as Amazon, AirBnB, and Uber. For the results to be comparable to real review data, I've chosen to talk to people who own a Sandisk SDXC card who are willing to test my design of Amazon's review component. As it turns out, photography/film enthusiasts are fans of the SDXC card!\n\n**Full recruitment criteria:**\n\n* American / lives in USA 🇺🇸\n\n* Aged 21 and above\n\n* Working professional\n\n* Own a Sandisk SDXC card\n\n\n**I'm offering $10.00 Amazon vouchers as an incentive out of my student pockets** - if you're willing to join me in a 30-60 minute conference call which **will be recorded only for my eyes and ears**, drop me an email at [hello@hazeltan.my](mailto://hello@hazeltan.my) and I'll coordinate with you.\n\nIf you'd like more information, I'll be happy to answer in the comments or email :)\n\n* *No other personal data is collected. Recordings will be deleted within 3 months of the thesis submission. I will need a way to send you the voucher, an email address or other but it will not be recorded in any documents.*\n\n* *This study is NOT affiliated with Amazon.com Inc.*", "link": "https://www.reddit.com/r/Cameras/comments/b9sk45/academic_research_usability_test_about_online/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "[academic research] usability test about online ratings &amp; reviews on sandisk sdxc cards /!/ hello kind strangers,\n\ni'm hazel, a student in m. sc. usability engineering at rhine-waal university of applied sciences, germany and i'm conducting a thesis research on consumer behaviour on amazon.com.\n\nthe aim is to understand how people read and write reviews online, given how we have turned to trust peers online on platforms such as amazon, airbnb, and uber. for the results to be comparable to real review data, i've chosen to talk to people who own a sandisk sdxc card who are willing to test -----> my !!!  -----> design !!!  of amazon's review component. as it turns out, photography/film enthusiasts are fans of the sdxc card!\n\n**full recruitment criteria:**\n\n* american / lives in usa 🇺🇸\n\n* aged 21 and above\n\n* working professional\n\n* own a sandisk sdxc card\n\n\n**i'm offering $10.00 amazon vouchers as an incentive out of my student pockets** - if you're willing to join me in a 30-60 minute conference call which **will be recorded only for my eyes and ears**, drop me an email at [hello@hazeltan.my](mailto://hello@hazeltan.my) and i'll coordinate with you.\n\nif you'd like more information, i'll be happy to answer in the comments or email :)\n\n* *no other personal data is collected. recordings will be deleted within 3 months of the thesis submission. i will need a way to send you the voucher, an email address or other but it will not be recorded in any documents.*\n\n* *this study is not affiliated with amazon.com inc.*", "sortedWord": "None", "Identifyer": null, "identifyer": 80057, "year": "2019"}, {"autor": "nsandin88", "date": "2019-07-07 14:19:39", "content": "I designed &amp; 3D printed this adapter to use this 70 year old Kodak Retina IIIc lens on my Nikon Z7 (test shots in comments)", "link": "https://www.reddit.com/r/Cameras/comments/ca7b2p/i_designed_3d_printed_this_adapter_to_use_this_70/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  &amp; 3d printed this adapter to use this 70 year old kodak retina iiic lens on my nikon z7 (test shots in comments)", "sortedWord": "None", "Identifyer": null, "identifyer": 80814, "year": "2019"}, {"autor": "FabThierry", "date": "2021-07-15 20:26:51", "content": "Love ‘em (got both used couple weeks ago). Maybe it s because of my background(architect) i value design so high but just the design of my fujis itself gives me a smile everytime i go for shooting :D", "link": "https://www.reddit.com/r/fujifilm/comments/ol16m3/love_em_got_both_used_couple_weeks_ago_maybe_it_s/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i value design", "selectorShort": "design", "MarkedSent": "love ‘em (got both used couple weeks ago). maybe it s because of my background(architect) -----> i !!!  -----> value !!!  -----> design !!!  so high but just the -----> design !!!  of my fujis itself gives me a smile everytime -----> i !!!  go for shooting :d", "sortedWord": "None", "Identifyer": null, "identifyer": 84650, "year": "2021"}, {"autor": "Someguywhomakething", "date": "2020-12-28 03:15:27", "content": "Hot off the print bed. Designed and printed an adapter plate for using FD lenses with EF bodies.", "link": "https://www.reddit.com/r/Cameras/comments/kli0i1/hot_off_the_print_bed_designed_and_printed_an/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "hot off the print bed. -----> designed !!!  and printed an adapter plate for using fd lenses with ef bodies.", "sortedWord": "None", "Identifyer": null, "identifyer": 2168, "year": "2020"}, {"autor": "TravelerJoshua", "date": "2020-02-12 17:33:18", "content": "Best camera to buy for our office? /!/ We are a small team of 13 and we are looking to buy a cheapish, but good-quality camera for our office. The photos we take will be used on social media, our blog and reports that we design. We have a few photography-savy employees that know their way around a camera, but not experts.\n\nAny suggestions would be of great help!", "link": "https://www.reddit.com/r/Cameras/comments/f2us3h/best_camera_to_buy_for_our_office/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "we design", "selectorShort": "design", "MarkedSent": "best camera to buy for our office? /!/ we are a small team of 13 and we are looking to buy a cheapish, but good-quality camera for our office. the photos -----> we !!!  take will be used on social media, our blog and reports that -----> we !!!  -----> design !!! . we have a few photography-savy employees that know their way around a camera, but not experts.\n\nany suggestions would be of great help!", "sortedWord": "None", "Identifyer": null, "identifyer": 8515, "year": "2020"}, {"autor": "Racecarsoup", "date": "2020-06-16 18:52:19", "content": "I design stickers for fun in my free time, this one is an homage to the other love of my life photography", "link": "https://www.reddit.com/r/Cameras/comments/haa4o2/i_design_stickers_for_fun_in_my_free_time_this/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> design !!!  stickers for fun in my free time, this one is an homage to the other love of my life photography", "sortedWord": "None", "Identifyer": null, "identifyer": 10582, "year": "2020"}, {"autor": "baby_buttercup_18", "date": "2021-04-29 01:50:10", "content": "I am joining design foundations next year (perquisite to photography) then after that photography. Should I get a camera? I can always borrow the schools or use my phone (phone pics below, mainly food since that's what I'm good at). What should I do?", "link": "https://www.reddit.com/r/Cameras/comments/n0u6zz/i_am_joining_design_foundations_next_year/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i am joining design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> am !!!  -----> joining !!!  -----> design !!!  foundations next year (perquisite to photography) then after that photography. should i get a camera? i can always borrow the schools or use my phone (phone pics below, mainly food since that's what i'm good at). what should i do?", "sortedWord": "None", "Identifyer": null, "identifyer": 15627, "year": "2021"}, {"autor": "Silence_Corner", "date": "2021-01-14 05:42:28", "content": "I designed an automatic magnetic Buckle for camera, I want to know your opinion It name \"Squid system\" /!/ I designed an automatic magnetic Buckle for camera\"Squid system\", I want to know your opinion \n\nI know what you want to say. You want to say this is very similar to Peak Design’s Anchor Links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nThe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nAs long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200B;\n\n Tell me your opinion, good or bad \\^\\^", "link": "https://www.reddit.com/r/Cameras/comments/kwzgx9/i_designed_an_automatic_magnetic_buckle_for/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  an automatic magnetic buckle for camera, -----> i !!!  want to know your opinion it name \"squid system\" /!/ i designed an automatic magnetic buckle for camera\"squid system\", i want to know your opinion \n\ni know what you want to say. you want to say this is very similar to peak design’s anchor links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nthe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nas long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200b;\n\n tell me your opinion, good or bad \\^\\^", "sortedWord": "None", "Identifyer": null, "identifyer": 16941, "year": "2021"}, {"autor": "Traditional-Scale-42", "date": "2021-08-18 02:04:59", "content": "We designed PlateZ to expand the capabilities of your camera without having to purchase multiple expensive products. Our goal is to create the platform to add all your accessories and expand their functionality with PlateZ.", "link": "https://www.reddit.com/r/Cameras/comments/p6htem/we_designed_platez_to_expand_the_capabilities_of/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "we designed", "selectorShort": "design", "MarkedSent": "-----> we !!!  -----> designed !!!  platez to expand the capabilities of your camera without having to purchase multiple expensive products. our goal is to create the platform to add all your accessories and expand their functionality with platez.", "sortedWord": "None", "Identifyer": null, "identifyer": 20583, "year": "2021"}, {"autor": "Broken_Perfectionist", "date": "2021-02-25 17:37:43", "content": "The Voigtlander 35mm f2.5 Skopar Pancake arrived! While waiting, I designed and 3D printed a 35mm viewfinder, lens cap and a focus tab ring to precisely match the focus ring grooves. Excited to take it out!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lsc393/the_voigtlander_35mm_f25_skopar_pancake_arrived/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "the voigtlander 35mm f2.5 skopar pancake arrived! while waiting, -----> i !!!  -----> designed !!!  and 3d printed a 35mm viewfinder, lens cap and a focus tab ring to precisely match the focus ring grooves. excited to take it out!", "sortedWord": "None", "Identifyer": null, "identifyer": 49528, "year": "2021"}, {"autor": "SalmonSnail", "date": "2021-09-06 21:42:45", "content": "What color transparency film is most punchy? And do people mount the film onto cardboard slide mounts still? /!/ Hi it’s your community Kodachrome scanner wanting to make their own slides.\n\nI’m looking for unnatural colors. I have far enough kodachromes laying around to sacrifice to make my own mounts, but I have never dissected one before. And I absolutely loathe plastic mounts with all my being. How about - are there any cardboard mounts in existence still that I could even maybe design a sticker cover for and make my own Emma-chromes?\n\nIs this ridiculous?\n\nWhat transparency film is closest to insane Kodachrome colors? Also is there a petition anywhere I can sign to bring it back?\n\nCheers! This sounds expensive!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pj983c/what_color_transparency_film_is_most_punchy_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i could even maybe design", "selectorShort": "design", "MarkedSent": "what color transparency film is most punchy? and do people mount the film onto cardboard slide mounts still? /!/ hi it’s your community kodachrome scanner wanting to make their own slides.\n\ni’m looking for unnatural colors. i have far enough kodachromes laying around to sacrifice to make my own mounts, but i have never dissected one before. and i absolutely loathe plastic mounts with all my being. how about - are there any cardboard mounts in existence still that -----> i !!!  -----> could !!!  -----> even !!!  -----> maybe !!!  -----> design !!!  a sticker cover for and make my own emma-chromes?\n\nis this ridiculous?\n\nwhat transparency film is closest to insane kodachrome colors? also is there a petition anywhere i can sign to bring it back?\n\ncheers! this sounds expensive!!", "sortedWord": "None", "Identifyer": null, "identifyer": 49671, "year": "2021"}, {"autor": "J_BlRD", "date": "2021-07-30 15:02:27", "content": "I couldn't find a small camera flash for my Canon A-1, so I designed and made one myself", "link": "https://www.reddit.com/r/AnalogCommunity/comments/oumau5/i_couldnt_find_a_small_camera_flash_for_my_canon/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  couldn't find a small camera flash for my canon a-1, so -----> i !!!  -----> designed !!!  and made one myself", "sortedWord": "None", "Identifyer": null, "identifyer": 1075, "year": "2021"}, {"autor": "DarraghDaraDaire", "date": "2021-02-18 08:37:46", "content": "I designed a sticker, DM if you want some!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lmi0zo/i_designed_a_sticker_dm_if_you_want_some/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a sticker, dm if you want some!", "sortedWord": "None", "Identifyer": null, "identifyer": 2012, "year": "2021"}, {"autor": "DobryyBelarus", "date": "2021-09-17 20:51:51", "content": "Front lens cap for Helios 44-2 /!/ I designed this cap in solidworks. In my opinion, it turned out well.\n\nI plan to print from black plastic petg.\n\nWhat do you say?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8gz387nyl4o71.png?width=1111&amp;format=png&amp;auto=webp&amp;s=924150d76c3373180523ad002dbe25953c8f9aa0\n\nhttps://preview.redd.it/ied8ivp2m4o71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=4e99f9f83af90cbc966c587a652b7490de698f73", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pq8iim/front_lens_cap_for_helios_442/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "front lens cap for helios 44-2 /!/ -----> i !!!  -----> designed !!!  this cap in solidworks. in my opinion, it turned out well.\n\ni plan to print from black plastic petg.\n\nwhat do you say?\n\n&amp;#x200b;\n\nhttps://preview.redd.it/8gz387nyl4o71.png?width=1111&amp;format=png&amp;auto=webp&amp;s=924150d76c3373180523ad002dbe25953c8f9aa0\n\nhttps://preview.redd.it/ied8ivp2m4o71.png?width=1099&amp;format=png&amp;auto=webp&amp;s=4e99f9f83af90cbc966c587a652b7490de698f73", "sortedWord": "None", "Identifyer": null, "identifyer": 2779, "year": "2021"}, {"autor": "cs_phoenix", "date": "2021-05-13 23:34:33", "content": "I designed and 3D printed a grip for my Konica C35!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nbupj3/i_designed_and_3d_printed_a_grip_for_my_konica_c35/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a grip for my konica c35!", "sortedWord": "None", "Identifyer": null, "identifyer": 5686, "year": "2021"}, {"autor": "Broken_Perfectionist", "date": "2021-02-14 05:20:33", "content": "I designed a thing!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/lji465/i_designed_a_thing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a thing!", "sortedWord": "None", "Identifyer": null, "identifyer": 9359, "year": "2021"}, {"autor": "anakist101", "date": "2018-09-10 11:30:05", "content": "Giving out my web design services for FREE to anyone who is starting up their own small business? /!/ I am currently in the middle of starting my own web design business after working for sometime for \n\nother people, I will need some projects to undertake to build up my portfolio. So its a good way to get \n\na free website built if any of you guys need it.\n\nMy only prerequisites are;\n\n* No e commerce sites\n* 5 pages max\n\nThese are only because of time restraints.\n\nI will design, build and give you the site but its up to you to get it hosted, I can help / walk \n\nyou through this if you are not sure.\n\n&amp;#x200B;\n\nPM me if anyone is interested.", "link": "https://www.reddit.com/r/photography/comments/9em8p5/giving_out_my_web_design_services_for_free_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i will design", "selectorShort": "design", "MarkedSent": "giving out my web design services for free to anyone who is starting up their own small business? /!/ i am currently in the middle of starting my own web design business after working for sometime for \n\nother people, i will need some projects to undertake to build up my portfolio. so its a good way to get \n\na free website built if any of you guys need it.\n\nmy only prerequisites are;\n\n* no e commerce sites\n* 5 pages max\n\nthese are only because of time restraints.\n\n-----> i !!!  -----> will !!!  -----> design !!! , build and give you the site but its up to you to get it hosted, -----> i !!!  can help / walk \n\nyou through this if you are not sure.\n\n&amp;#x200b;\n\npm me if anyone is interested.", "sortedWord": "None", "Identifyer": null, "identifyer": 13236, "year": "2018"}, {"autor": "swordgeek", "date": "2018-05-22 20:04:39", "content": "What is the optimum *pixel size*, given modern technology? /!/ This is kind of an armchair exercise, but I was curious.\n\nAges ago, there was a grand debate between pixel size and pixel density (MP), and the general rule-of-thumb was that a 6.5µm pixel was roughly ideal. Turns out, it came from [This Paper](http://www-isl.stanford.edu/~abbas/group/papers_and_pub/pixelsize.pdf), which did simulations, and pointed out that it was based on the then-current CMOS technology of 0.35µm, but also mentioned that it scaled non-linearly with technology (down to 4.5µm for 0.18µm CMOS).\n\nAs near as I can understand, our current CMOS technology (~a tenth of that value) should be small enough that it is no longer a factor, and we should be able to achieve an optimum pixel size (aka pitch) based on DR, SNR, and MTF.\n\nDoes anyone know what that value is? Is there a finite limit, and does the CMOS scaling just increase fill factor now?\n\nOr put another way: If I were to design an absolutely ideal (for typical light) sensor, where the size was arbitrary to achieve the resolution I wanted, what pixel pitch should I choose?\n", "link": "https://www.reddit.com/r/photography/comments/8ld4gm/what_is_the_optimum_pixel_size_given_modern/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i were to design", "selectorShort": "design", "MarkedSent": "what is the optimum *pixel size*, given modern technology? /!/ this is kind of an armchair exercise, but i was curious.\n\nages ago, there was a grand debate between pixel size and pixel density (mp), and the general rule-of-thumb was that a 6.5µm pixel was roughly ideal. turns out, it came from [this paper](http://www-isl.stanford.edu/~abbas/group/papers_and_pub/pixelsize.pdf), which did simulations, and pointed out that it was based on the then-current cmos technology of 0.35µm, but also mentioned that it scaled non-linearly with technology (down to 4.5µm for 0.18µm cmos).\n\nas near as i can understand, our current cmos technology (~a tenth of that value) should be small enough that it is no longer a factor, and we should be able to achieve an optimum pixel size (aka pitch) based on dr, snr, and mtf.\n\ndoes anyone know what that value is? is there a finite limit, and does the cmos scaling just increase fill factor now?\n\nor put another way: if -----> i !!!  -----> were !!!  -----> to !!!  -----> design !!!  an absolutely ideal (for typical light) sensor, where the size was arbitrary -----> to !!!  achieve the resolution -----> i !!!  wanted, what pixel pitch should -----> i !!!  choose?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 15450, "year": "2018"}, {"autor": "Arachnorchis", "date": "2018-02-17 11:09:16", "content": "I designed and 3D printed a 150mm filter mounting system to adapt to most lenses /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7y63cd/i_designed_and_3d_printed_a_150mm_filter_mounting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a 150mm filter mounting system to adapt to most lenses /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 20498, "year": "2018"}, {"autor": "ZachWinterton", "date": "2018-06-04 04:13:56", "content": "My first attempt at a flatlay showcasing a font I designed", "link": "https://www.reddit.com/r/photography/comments/8oegzz/my_first_attempt_at_a_flatlay_showcasing_a_font_i/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "my first attempt at a flatlay showcasing a font -----> i !!!  -----> designed !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 29005, "year": "2018"}, {"autor": "stijnbenjamin", "date": "2018-08-08 20:38:02", "content": "Hey Reddit users! What are camera features you want, that are not on today’s cameras? /!/ I’m starting a camera company, funded by Kickstarter, and i’m trying to design the perfect modern camera. Thanks in advance.", "link": "https://www.reddit.com/r/photography/comments/95pte0/hey_reddit_users_what_are_camera_features_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’m trying to design", "selectorShort": "design", "MarkedSent": "hey reddit users! what are camera features you want, that are not on today’s cameras? /!/ -----> i !!! ’m starting a camera company, funded by kickstarter, and -----> i !!! ’m -----> trying !!!  -----> to !!!  -----> design !!!  the perfect modern camera. thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 30228, "year": "2018"}, {"autor": "glebsergeev", "date": "2018-09-25 19:04:36", "content": "Design with a piece of Bauhaus history (1919-1933) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9iv1mw/design_with_a_piece_of_bauhaus_history_19191933/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  with a piece of bauhaus history (1919-1933) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 31852, "year": "2018"}, {"autor": "BadConductor", "date": "2018-10-10 02:59:03", "content": "I also designed and 3D printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [Album Here](https://imgur.com/a/XIKBIaz)\n\nThis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. Changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\nI plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes I use have a built-in holder), and I currently have a diffuser printing in white filament.\n\nThe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. If anyone wants, I can provide the original Autodesk Inventor files so it can be modified easily.", "link": "https://www.reddit.com/r/photography/comments/9mvs85/i_also_designed_and_3d_printed_some_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i also designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> also !!!  -----> designed !!!  and 3d printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [album here](https://imgur.com/a/xikbiaz)\n\nthis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\ni plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes i use have a built-in holder), and i currently have a diffuser printing in white filament.\n\nthe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. if anyone wants, i can provide the original autodesk inventor files so it can be modified easily.", "sortedWord": "None", "Identifyer": null, "identifyer": 32247, "year": "2018"}, {"autor": "ddblah", "date": "2018-10-23 03:37:35", "content": "Just 3 quick questions (multiple choice) to help me design a more versatile camera app /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/9ql76z/just_3_quick_questions_multiple_choice_to_help_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me design", "selectorShort": "design", "MarkedSent": "just 3 quick questions (multiple choice) to help -----> me !!!  -----> design !!!  a more versatile camera app /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 32922, "year": "2018"}, {"autor": "meta_detectorist", "date": "2018-12-06 18:02:57", "content": "Where to print double-sided glossy? /!/ Hey, I've been photographing for years, but rarely print. I recently designed a 2-sided save-the-date with some awesome shots from La Jolla, with one photo on each side. But...I can't find anywhere that'll just make a double-sided glossy print. Amazon and Costco do double sided matte cards, but I really wasn't impressed with the Amazon samples I ordered. I need 300!\n\nAny suggestions? Thanks in advance! ", "link": "https://www.reddit.com/r/photography/comments/a3qfia/where_to_print_doublesided_glossy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i recently designed", "selectorShort": "design", "MarkedSent": "where to print double-sided glossy? /!/ hey, i've been photographing for years, but rarely print. -----> i !!!  -----> recently !!!  -----> designed !!!  a 2-sided save-the-date with some awesome shots from la jolla, with one photo on each side. but...i can't find anywhere that'll just make a double-sided glossy print. amazon and costco do double sided matte cards, but i really wasn't impressed with the amazon samples i ordered. i need 300!\n\nany suggestions? thanks in advance! ", "sortedWord": "None", "Identifyer": null, "identifyer": 33820, "year": "2018"}, {"autor": "trejonw", "date": "2018-12-16 14:09:48", "content": "I feel stuck. /!/ I'm sure there are better places to post something like this, but I'm more comfortable sharing with like-minded people.\n\nSo I'm an 18yo photographer, about 6 months out of high school. I'm not going to college and i don't plan to. I currently focus on fashion work but I do lifestyle work, food, event, etc. I'm also a graphic designer. My design portfolio isn't as consistent as my photo one but I've been in the field for about 5 years, so I think it's fair to give myself the title. My currently goals are to get my work published in a fashion magazine (Schon, Dazed, 032c, so on) and host a solo exhibition by next Summer. Long term goal - I want to be creative/art director of a major publication.\n\nMy problem is money. I've been applying to photography/design jobs for the last two months and I'll either get no response or rejected. I'll even follow up on the phone and most of the time some receptionist tells me the person I want to be speaking to is \"in a meeting\". Id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. I try to promote my own photography services but I get no inquiries. Maybe I'm doing it wrong. This industry seems like it's built by and for extroverts and I'm just not that loud. I don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nHas anyone here been in a similar position? How do you stay financially stable while still working toward your photography career? How do you promote yourself? I don't know if I'm allowed to link my website but if someone asks ill be happy to send it over.\n\nI live in Dallas, TX if that helps. Thank you in advance&lt;3\n", "link": "https://www.reddit.com/r/photography/comments/a6p99m/i_feel_stuck/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "i feel stuck. /!/ i'm sure there are better places to post something like this, but i'm more comfortable sharing with like-minded people.\n\nso i'm an 18yo photographer, about 6 months out of high school. i'm not going to college and i don't plan to. i currently focus on fashion work but i do lifestyle work, food, event, etc. i'm also a graphic designer. -----> my !!!  -----> design !!!  portfolio isn't as consistent as -----> my !!!  photo one but i've been in the field for about 5 years, so i think it's fair to give myself the title. my currently goals are to get my work published in a fashion magazine (schon, dazed, 032c, so on) and host a solo exhibition by next summer. long term goal - i want to be creative/art director of a major publication.\n\nmy problem is money. i've been applying to photography/design jobs for the last two months and i'll either get no response or rejected. i'll even follow up on the phone and most of the time some receptionist tells me the person i want to be speaking to is \"in a meeting\". id like to keep working toward my goals but its frustrating to not even have enough money to pay for my car insurance. i try to promote my own photography services but i get no inquiries. maybe i'm doing it wrong. this industry seems like it's built by and for extroverts and i'm just not that loud. i don't want to get a job at some restaurant or store but it seems like that's what's going to end up happening.\n\nhas anyone here been in a similar position? how do you stay financially stable while still working toward your photography career? how do you promote yourself? i don't know if i'm allowed to link my website but if someone asks ill be happy to send it over.\n\ni live in dallas, tx if that helps. thank you in advance&lt;3\n", "sortedWord": "None", "Identifyer": null, "identifyer": 34197, "year": "2018"}, {"autor": "pylesrm", "date": "2018-09-20 14:22:10", "content": "Let's design our dream camera! /!/ I just had this same discussion with a couple co-workers, so I thought I'd bring it here and see what you guys have to say.\n\nIf you could design any DSLR you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nSo I'll go first:\n\nMedium format sensor in a DSLR body\nRuns Android\nBuilt-in mini tripod\nBuilt in drone\n\nAnd a lot more", "link": "https://www.reddit.com/r/photography/comments/9hfphq/lets_design_our_dream_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "'s design", "selectorShort": "design", "MarkedSent": "let-----> 's !!!  -----> design !!!  our dream camera! /!/ i just had this same discussion with a couple co-workers, so i thought i'd bring it here and see what you guys have to say.\n\nif you could design any dslr you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nso i'll go first:\n\nmedium format sensor in a dslr body\nruns android\nbuilt-in mini tripod\nbuilt in drone\n\nand a lot more", "sortedWord": "None", "Identifyer": null, "identifyer": 36725, "year": "2018"}, {"autor": "JohnCarson89", "date": "2018-11-08 18:59:37", "content": "Good host/builders to create a website? /!/ Looking to creating a website for my photography/videography to create a portfolio. I've been hearing about Squarespace but wondering what your opinion is on options such as Wordpress, Wix etc. I do not know coding or anything so I would be designing from a template stand point. ", "link": "https://www.reddit.com/r/photography/comments/9vct6z/good_hostbuilders_to_create_a_website/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i would be designing", "selectorShort": "design", "MarkedSent": "good host/builders to create a website? /!/ looking to creating a website for my photography/videography to create a portfolio. i've been hearing about squarespace but wondering what your opinion is on options such as wordpress, wix etc. -----> i !!!  do not know coding or anything so -----> i !!!  -----> would !!!  -----> be !!!  -----> designing !!!  from a template stand point. ", "sortedWord": "None", "Identifyer": null, "identifyer": 37234, "year": "2018"}, {"autor": "PossibleDefect", "date": "2021-02-22 03:36:54", "content": "Need critical screw depth information! /!/ Hello, I hope this question is allowed here. I am designing a tripod adapter for a Canon 600-700D (2012-2013ish). I contacted Canon customer support but they refused to give me the depth of the tripod mount thread in the bottom of the camera. If anyone has a Canon from around 2010-2015 and could somehow measure the depth, I would really appreciate it! Thanks.", "link": "https://www.reddit.com/r/canon/comments/lpe4z6/need_critical_screw_depth_information/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i am designing", "selectorShort": "design", "MarkedSent": "need critical screw depth information! /!/ hello, i hope this question is allowed here. -----> i !!!  -----> am !!!  -----> designing !!!  a tripod adapter for a canon 600-700d (2012-2013ish). i contacted canon customer support but they refused to give me the depth of the tripod mount thread in the bottom of the camera. if anyone has a canon from around 2010-2015 and could somehow measure the depth, i would really appreciate it! thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 39136, "year": "2021"}, {"autor": "AD1AD", "date": "2021-02-03 03:47:01", "content": "I designed a 3D printable teleprompter/autocue assembly for the Canon EOS M50 =) /!/ All you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nSo, if you saved up enough for the camera itself, already have a tablet, and have access to a 3D printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nIts design could probably be pretty easily adjusted for other popular cameras. It's not quite modular, and barely parametric (I suck at OpenSCAD), but I'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nIt's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger EOS M50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nThe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=MxUbaxXaQH0](https://www.youtube.com/watch?v=MxUbaxXaQH0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nThanks for your time!", "link": "https://www.reddit.com/r/canon/comments/lberua/i_designed_a_3d_printable_teleprompterautocue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a 3d printable teleprompter/autocue assembly for the canon eos m50 =) /!/ all you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nso, if you saved up enough for the camera itself, already have a tablet, and have access to a 3d printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nits design could probably be pretty easily adjusted for other popular cameras. it's not quite modular, and barely parametric (i suck at openscad), but i'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nit's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger eos m50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nthe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=mxubaxxaqh0](https://www.youtube.com/watch?v=mxubaxxaqh0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nthanks for your time!", "sortedWord": "None", "Identifyer": null, "identifyer": 41000, "year": "2021"}, {"autor": "DallasTheLab", "date": "2021-08-14 21:18:27", "content": "How Do I Export \"High Frame Rate\" Video In 120fps?? /!/ Long story short I design and manufacture ballistic rated doors. I filmed some rounds hitting one at a gun range using my EOS M50 setup on my tripod. I made sure to enable its \"High Frame Rate Movie\" mode which captures in 1280x720 @ 119.9fps. I can play it back on the cameras screen in slow motion and it looks great. However, when I plug the SD card into my computer and I right click, go to properties, then details it shows it is in 29.99fps. What gives?? Can I not export the video in 120fps?", "link": "https://www.reddit.com/r/canon/comments/p4gcsn/how_do_i_export_high_frame_rate_video_in_120fps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "how do i export \"high frame rate\" video in 120fps?? /!/ long story short -----> i !!!  -----> design !!!  and manufacture ballistic rated doors. i filmed some rounds hitting one at a gun range using my eos m50 setup on my tripod. i made sure to enable its \"high frame rate movie\" mode which captures in 1280x720 @ 119.9fps. i can play it back on the cameras screen in slow motion and it looks great. however, when i plug the sd card into my computer and i right click, go to properties, then details it shows it is in 29.99fps. what gives?? can i not export the video in 120fps?", "sortedWord": "None", "Identifyer": null, "identifyer": 42824, "year": "2021"}, {"autor": "Bikingpanda", "date": "2020-01-20 14:52:08", "content": "M5 quick menu /!/ Hello, I have a question on the M5. On my other canon DSLRs when I have the quick menu up (i think that is what it is called) I can still adjust the shutter and aperture and press the Q button when I want to adjust something else. On the M5 when this screen is up I can only adjust what the orange box is highlighted. I can’t figure out what to press to get rid of the orange box so I can just aperture and shutter without putting the camera or switching to live view. Is this how it is my design? Or is there a setting I am missing?  https://i.imgur.com/9XmLfoZ.jpg", "link": "https://www.reddit.com/r/canon/comments/ere5tu/m5_quick_menu/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "m5 quick menu /!/ hello, i have a question on the m5. on my other canon dslrs when i have the quick menu up (i think that is what it is called) i can still adjust the shutter and aperture and press the q button when i want to adjust something else. on the m5 when this screen is up i can only adjust what the orange box is highlighted. i can’t figure out what to press to get rid of the orange box so i can just aperture and shutter without putting the camera or switching to live view. is this how it is -----> my !!!  -----> design !!! ? or is there a setting i am missing?  https://i.imgur.com/9xmlfoz.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 46058, "year": "2020"}, {"autor": "TheHamilton_Man", "date": "2020-06-04 20:18:41", "content": "Pixma TS 9020 feed roller gear /!/ My Canon Pixma TS 9020 has lost its feed roller gear so it will not print. I understand that I could send it back and get a new one, but I figured I’d try to fix it myself first. I no longer have the gear, but do have access to a 3D printer. I was wondering if anyone had either a replica file or even just the dimensions so I could design it. Thanks :D", "link": "https://www.reddit.com/r/canon/comments/gwpayv/pixma_ts_9020_feed_roller_gear/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i could design", "selectorShort": "design", "MarkedSent": "pixma ts 9020 feed roller gear /!/ my canon pixma ts 9020 has lost its feed roller gear so it will not print. i understand that i could send it back and get a new one, but i figured i’d try to fix it myself first. i no longer have the gear, but do have access to a 3d printer. -----> i !!!  was wondering if anyone had either a replica file or even just the dimensions so -----> i !!!  -----> could !!!  -----> design !!!  it. thanks :d", "sortedWord": "None", "Identifyer": null, "identifyer": 46589, "year": "2020"}, {"autor": "B_Huij", "date": "2020-11-03 05:19:55", "content": "I designed and 3D printed magnetic filter adapters so I can more easily switch between R, G, and B filters for trichrome photography", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jn4k2i/i_designed_and_3d_printed_magnetic_filter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed magnetic filter adapters so -----> i !!!  can more easily switch between r, g, and b filters for trichrome photography", "sortedWord": "None", "Identifyer": null, "identifyer": 52578, "year": "2020"}, {"autor": "wildnorthwest", "date": "2020-01-14 23:36:29", "content": "A long exposure timer/self-timer/remote shutter trigger/intervalometer I designed and built for use with analog cameras.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eoto91/a_long_exposure_timerselftimerremote_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "a long exposure timer/self-timer/remote shutter trigger/intervalometer -----> i !!!  -----> designed !!!  and built for use with analog cameras.", "sortedWord": "None", "Identifyer": null, "identifyer": 54705, "year": "2020"}, {"autor": "ibbyte", "date": "2020-12-10 14:12:05", "content": "I designed a light table for dslr scanning", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kafxbe/i_designed_a_light_table_for_dslr_scanning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a light table for dslr scanning", "sortedWord": "None", "Identifyer": null, "identifyer": 54842, "year": "2020"}, {"autor": "Hinermad", "date": "2020-12-26 19:20:33", "content": "In search of... /!/ I just scored a Mamiya 16 Automatic \"spy\" camera. (Although it's a chonky boi compared to my Minoltas and Minoxes. (Minoces?)) The selenium light meter doesn't work, but I expected that.\n\nWhat I need now is some 16mm film cassettes. I can source the film, but the camera uses a proprietary cassette design and won't take my Minolta 16 cassettes. If I can get at least one to take measurements on I'll try to design a 3D printable version.\n\nAnyone have any leads on where to get Mamiya 16 film cassettes?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kko3z0/in_search_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i'll try to design", "selectorShort": "design", "MarkedSent": "in search of... /!/ i just scored a mamiya 16 automatic \"spy\" camera. (although it's a chonky boi compared to my minoltas and minoxes. (minoces?)) the selenium light meter doesn't work, but i expected that.\n\nwhat i need now is some 16mm film cassettes. i can source the film, but the camera uses a proprietary cassette design and won't take my minolta 16 cassettes. if -----> i !!!  can get at least one -----> to !!!  take measurements on -----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> design !!!  a 3d printable version.\n\nanyone have any leads on where to get mamiya 16 film cassettes?", "sortedWord": "None", "Identifyer": null, "identifyer": 54986, "year": "2020"}, {"autor": "yzwq", "date": "2020-09-24 19:19:27", "content": "Designed and printed front and back lens caps for my large format lenses.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iz3svj/designed_and_printed_front_and_back_lens_caps_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  and printed front and back lens caps for my large format lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 55854, "year": "2020"}, {"autor": "ini_kamoze", "date": "2020-02-07 20:59:18", "content": "Canon FD mount specifications /!/ Hey, I would like to design a few lenses for my Canon A-1 around some simple objectives I have laying around. I've been looking but I cant seem to find more technical documentation on the design of the FD mount system. All I would really need is the distance from the FD mount flange to the film.My searches seem to result in lens or FD adapter specifications.\n\nI tried measuring it on my own with a single light point and some different lenses, this gives me 51mm but I would still like to confirm before I start to build something. The round value does give me comfort that I'm correct but I'd like to exclude possible setup, measuring errors.\n\nCheers", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f0gsrv/canon_fd_mount_specifications/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i would like to design", "selectorShort": "design", "MarkedSent": "canon fd mount specifications /!/ hey, -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> design !!!  a few lenses for my canon a-1 around some simple objectives -----> i !!!  have laying around. i've been looking but i cant seem to find more technical documentation on the design of the fd mount system. all i would really need is the distance from the fd mount flange to the film.my searches seem to result in lens or fd adapter specifications.\n\ni tried measuring it on my own with a single light point and some different lenses, this gives me 51mm but i would still like to confirm before i start to build something. the round value does give me comfort that i'm correct but i'd like to exclude possible setup, measuring errors.\n\ncheers", "sortedWord": "None", "Identifyer": null, "identifyer": 58224, "year": "2020"}, {"autor": "w_yates", "date": "2020-06-01 21:28:17", "content": "I've posted before, but progress has been made! I'm currently designing an open-source Instax back for a Hasselblad! (and other cameras in time)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gutgyb/ive_posted_before_but_progress_has_been_made_im/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i'm currently designing", "selectorShort": "design", "MarkedSent": "i've posted before, but progress has been made! -----> i !!! 'm -----> currently !!!  -----> designing !!!  an open-source instax back for a hasselblad! (and other cameras in time)", "sortedWord": "None", "Identifyer": null, "identifyer": 62905, "year": "2020"}, {"autor": "thenickdude", "date": "2019-08-06 11:18:30", "content": "I designed and 3D-printed a massive 300mm Canon extension tube for super-macro at 5x magnification, it even has autofocus! /!/ For the past month I've been working on creating a stupid-long 300mm 3D-printed extension tube so that I could push my macro lens all the way to 5x magnification, and it's finally done!\n\nSince Canon cameras controls their lens aperture electronically, and stopping down the aperture is pretty much a requirement for getting any depth of field in macro, I had to create a lens contact system using gold contacts, a ribbon cable, and pogo pins. It even supports autofocus!\n\nYou can see the extension tube and a couple of photos I shot with it here:\n\nhttps://imgur.com/a/r7kHDC2\n\nI've posted the 3D-printable models and full build instructions on my Thingiverse page here:\n\nhttps://www.thingiverse.com/thing:3761957\n\nThingiverse's server is really struggling right now, so if that doesn't load I've posted a mirror of it here too:\n\nhttps://sherlock-photography.github.io/canon-extension-tube/\n\nThe tube was printed in black PETG filament on my Prusa i3 MK3S.", "link": "https://www.reddit.com/r/photography/comments/cmpa2z/i_designed_and_3dprinted_a_massive_300mm_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed a massive 300mm canon extension tube for super-macro at 5x magnification, it even has autofocus! /!/ for the past month i've been working on creating a stupid-long 300mm 3d-printed extension tube so that i could push my macro lens all the way to 5x magnification, and it's finally done!\n\nsince canon cameras controls their lens aperture electronically, and stopping down the aperture is pretty much a requirement for getting any depth of field in macro, i had to create a lens contact system using gold contacts, a ribbon cable, and pogo pins. it even supports autofocus!\n\nyou can see the extension tube and a couple of photos i shot with it here:\n\nhttps://imgur.com/a/r7khdc2\n\ni've posted the 3d-printable models and full build instructions on my thingiverse page here:\n\nhttps://www.thingiverse.com/thing:3761957\n\nthingiverse's server is really struggling right now, so if that doesn't load i've posted a mirror of it here too:\n\nhttps://sherlock-photography.github.io/canon-extension-tube/\n\nthe tube was printed in black petg filament on my prusa i3 mk3s.", "sortedWord": "None", "Identifyer": null, "identifyer": 64833, "year": "2019"}, {"autor": "thenickdude", "date": "2019-08-06 11:12:42", "content": "I designed and 3D-printed a massive 300mm Canon extension tube for super-macro at 5x magnification, it even has autofocus!", "link": "https://www.reddit.com/r/photography/comments/cmp8b1/i_designed_and_3dprinted_a_massive_300mm_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed a massive 300mm canon extension tube for super-macro at 5x magnification, it even has autofocus!", "sortedWord": "None", "Identifyer": null, "identifyer": 64834, "year": "2019"}, {"autor": "luftfield", "date": "2019-12-29 22:47:41", "content": "What do you want in a light meter? /!/ I’ve designed a few prototype light meters, and I’m aiming at a keychain-size light meter for photography. So far my design is quite rudimentary, and might be difficult for novices to use, or photographers not familiar with the EV scale. There’s a light diffuser dome, two light sensors (one for low and one for high light), and a 4-digit 7-segment display which displays the EV level when a button is pushed. The benefit of such a basic system is yearlong battery life and easy operation, but converting EV to shutter speed/aperture takes around half a minute and is generally inconvenient, although the unit cost per device is ~$7 which is very low compared to something like a Sekonic meter. Also this design has the benefit of being open source.\n\nNot considering what I’ve written about above, what do you want in a light meter? What features would you reasonably expect a ~$20 meter to have?", "link": "https://www.reddit.com/r/photography/comments/ehcvxl/what_do_you_want_in_a_light_meter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i’ve designed", "selectorShort": "design", "MarkedSent": "what do you want in a light meter? /!/ -----> i !!! ’ve -----> designed !!!  a few prototype light meters, and -----> i !!! ’m aiming at a keychain-size light meter for photography. so far my design is quite rudimentary, and might be difficult for novices to use, or photographers not familiar with the ev scale. there’s a light diffuser dome, two light sensors (one for low and one for high light), and a 4-digit 7-segment display which displays the ev level when a button is pushed. the benefit of such a basic system is yearlong battery life and easy operation, but converting ev to shutter speed/aperture takes around half a minute and is generally inconvenient, although the unit cost per device is ~$7 which is very low compared to something like a sekonic meter. also this design has the benefit of being open source.\n\nnot considering what i’ve written about above, what do you want in a light meter? what features would you reasonably expect a ~$20 meter to have?", "sortedWord": "None", "Identifyer": null, "identifyer": 65204, "year": "2019"}, {"autor": "GOLDlSILVER", "date": "2019-05-24 12:24:43", "content": "Emilia Clarke my design", "link": "https://www.reddit.com/r/photography/comments/bsga8h/emilia_clarke_my_design/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "emilia clarke -----> my !!!  -----> design !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 66206, "year": "2019"}, {"autor": "perfectpeachblonde", "date": "2019-12-01 07:29:29", "content": "Looking for a A3 Photo printer? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? Which one can print the highest quality Photo and high quality color document? What other brands or models do you recommend please? /!/  \n\nHiya,\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n\\-I'm looking for a A3 Photo printer? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? Which one can print the highest quality Photo and high quality color document? What other brands or models do you recommend please?\n\n\\-I'm looking to buy a perfect 'Photo color printer'. A printer that can accurately print all photos and high quality documents accurately? What about Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10 that have 4800x2400 dpi or more? What else do you suggesting? For me the final print results, DPI and quality and color accuracy of print, durability of color/print, and capability of printer to print on all printable papers by printer is important(looking to print on many different types of papers preferably).\n\n\\-If it can print border-less, it would be an advantage, as two above mentioned ones are border-less?\n\n\\-What do you suggest me between these two Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10?\n\n\\-Is the print quality is same on both Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? What about possibility to print on different papers?\n\n\\-Is there a way to prevent the print/color being destroyed if any water accidentally drops/spills on the paper printed by any of the Canon PIXMA-Pro-100 or Canon PIXMA-Pro-10? If I print on quality A4 'laser printer papers', does the color/print is vulnerable to spill of water? Is there any way to prevent this? e.g. color laser photo printers are not vulnerable to spill of water even if the print is done on normal photocopy A4 papers, is there any way to make this happen on the inkjet/dye/pigment based printers? As both Canon PIXMA-Pro-100 and Canon PIXMA-Pro-10 are 'dye' based printers, are they more resilient to accidental spill of water?\n\n\\-If I want to stamp the paper by printer instead of physical stamp, will the color of stamp will be realistic, in case I tune the stamp color that I may design in Photoshop for use as corporate stamp to be printed by printer on high quality documents and photos? I like to replace traditional stamps by a digital stamp that can be printed from Photoshop design of stamp for increasing security of stamp not being stolen physically? Is there any way to make stamp color realistic with any of the above printer? if not, what printer can do this for me?\n\n\\-What else accurate and high quality Photo color printer do you suggesting me please?\n\n&amp;#x200B;\n\nTnx and best of luck", "link": "https://www.reddit.com/r/photography/comments/e4d6ez/looking_for_a_a3_photo_printer_what_about_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i may design", "selectorShort": "design", "MarkedSent": "looking for a a3 photo printer? what about canon pixma-pro-100 or canon pixma-pro-10? which one can print the highest quality photo and high quality color document? what other brands or models do you recommend please? /!/  \n\nhiya,\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n\\-i'm looking for a a3 photo printer? what about canon pixma-pro-100 or canon pixma-pro-10? which one can print the highest quality photo and high quality color document? what other brands or models do you recommend please?\n\n\\-i'm looking to buy a perfect 'photo color printer'. a printer that can accurately print all photos and high quality documents accurately? what about canon pixma-pro-100 or canon pixma-pro-10 that have 4800x2400 dpi or more? what else do you suggesting? for me the final print results, dpi and quality and color accuracy of print, durability of color/print, and capability of printer to print on all printable papers by printer is important(looking to print on many different types of papers preferably).\n\n\\-if it can print border-less, it would be an advantage, as two above mentioned ones are border-less?\n\n\\-what do you suggest me between these two canon pixma-pro-100 or canon pixma-pro-10?\n\n\\-is the print quality is same on both canon pixma-pro-100 or canon pixma-pro-10? what about possibility to print on different papers?\n\n\\-is there a way to prevent the print/color being destroyed if any water accidentally drops/spills on the paper printed by any of the canon pixma-pro-100 or canon pixma-pro-10? if i print on quality a4 'laser printer papers', does the color/print is vulnerable to spill of water? is there any way to prevent this? e.g. color laser photo printers are not vulnerable to spill of water even if the print is done on normal photocopy a4 papers, is there any way to make this happen on the inkjet/dye/pigment based printers? as both canon pixma-pro-100 and canon pixma-pro-10 are 'dye' based printers, are they more resilient to accidental spill of water?\n\n\\-if -----> i !!!  want to stamp the paper by printer instead of physical stamp, will the color of stamp will be realistic, in case -----> i !!!  tune the stamp color that -----> i !!!  -----> may !!!  -----> design !!!  in photoshop for use as corporate stamp to be printed by printer on high quality documents and photos? i like to replace traditional stamps by a digital stamp that can be printed from photoshop design of stamp for increasing security of stamp not being stolen physically? is there any way to make stamp color realistic with any of the above printer? if not, what printer can do this for me?\n\n\\-what else accurate and high quality photo color printer do you suggesting me please?\n\n&amp;#x200b;\n\ntnx and best of luck", "sortedWord": "None", "Identifyer": null, "identifyer": 70960, "year": "2019"}, {"autor": "vivienw", "date": "2019-04-08 02:24:21", "content": "Question about doing game/graphic design for free (more details below)? /!/ Going to try to make this as simple as I can!\n\nA family friend's son designed a (potential) mobile game and wants me to design graphics for it, and has promised to pay me a percentage of the shares if the game makes a profit. \n\nIt's basically a ton of game pieces (like icons/logos) that need to be designed, so I only want to do a partial amount of work. He can take what I've done and hire other artists to finish it once he gets enough funding (he doesn't know when that would be).\n\nI'm going to have him sign a standard Graphic Design contract, but am not completely sure how to word the Compensation part. Especially given that I'm not doing the entire design; it will be more like art direction.\nI don't do design work for free so I want to make sure I get some type of pay regardless of whether my designs are used, or whether or not the game earns a profit. I was thinking along the lines of 1% of the shares of the game profit.\n\nThanks in advance! Any tips or advice is very much appreciated.", "link": "https://www.reddit.com/r/photography/comments/bao9nq/question_about_doing_gamegraphic_design_for_free/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "question about doing game/graphic design for free (more details below)? /!/ going to try to make this as simple as i can!\n\na family friend's son designed a (potential) mobile game and wants -----> me !!!  -----> to !!!  -----> design !!!  graphics for it, and has promised -----> to !!!  pay -----> me !!!  a percentage of the shares if the game makes a profit. \n\nit's basically a ton of game pieces (like icons/logos) that need to be designed, so i only want to do a partial amount of work. he can take what i've done and hire other artists to finish it once he gets enough funding (he doesn't know when that would be).\n\ni'm going to have him sign a standard graphic design contract, but am not completely sure how to word the compensation part. especially given that i'm not doing the entire design; it will be more like art direction.\ni don't do design work for free so i want to make sure i get some type of pay regardless of whether my designs are used, or whether or not the game earns a profit. i was thinking along the lines of 1% of the shares of the game profit.\n\nthanks in advance! any tips or advice is very much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 71846, "year": "2019"}, {"autor": "Emotionalmomentau", "date": "2019-08-13 13:07:02", "content": "Design Your Sweetest Memories In Beautiful Frames", "link": "https://www.reddit.com/r/photography/comments/cpswds/design_your_sweetest_memories_in_beautiful_frames/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "-----> design !!!  your sweetest memories in beautiful frames", "sortedWord": "None", "Identifyer": null, "identifyer": 76837, "year": "2019"}, {"autor": "madams1126", "date": "2019-03-06 04:52:17", "content": "Looking for ideas/ways that I can get wildlife photography /!/ Some context: I am a graphic design major working on a big project for one of my two final college classes. I have chosen to design a wildlife conservation website, along with some other small things. For this website, I want to have a lot of nice wildlife photography, but I would like to avoid using stock photography because it's not as unique and I'd like as much of the website to be original as possible. However, I live in the Midwest and don't have the means to take a lot of my own wildlife photography (such as rainforest and ocean wildlife). My professor suggested I find a way to get in contact with someone who lives in those kinds of areas to find people who may be willing to let me use their photography.\n\nDoes anyone have any suggestions on how/where I might be able to do this? Unfortunately I don't know anyone personally who could help me with this. I should also mention, this website will not be an active website available to the public. It would only be shown to my class and in my own personal portfolio. I would not claim any rights to the photographs. \n\nThank you for any suggestions!", "link": "https://www.reddit.com/r/photography/comments/axuwqr/looking_for_ideasways_that_i_can_get_wildlife/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i have chosen to design", "selectorShort": "design", "MarkedSent": "looking for ideas/ways that i can get wildlife photography /!/ some context: i am a graphic design major working on a big project for one of my two final college classes. -----> i !!!  -----> have !!!  -----> chosen !!!  -----> to !!!  -----> design !!!  a wildlife conservation website, along with some other small things. for this website, i want to have a lot of nice wildlife photography, but i would like to avoid using stock photography because it's not as unique and i'd like as much of the website to be original as possible. however, i live in the midwest and don't have the means to take a lot of my own wildlife photography (such as rainforest and ocean wildlife). my professor suggested i find a way to get in contact with someone who lives in those kinds of areas to find people who may be willing to let me use their photography.\n\ndoes anyone have any suggestions on how/where i might be able to do this? unfortunately i don't know anyone personally who could help me with this. i should also mention, this website will not be an active website available to the public. it would only be shown to my class and in my own personal portfolio. i would not claim any rights to the photographs. \n\nthank you for any suggestions!", "sortedWord": "None", "Identifyer": null, "identifyer": 81828, "year": "2019"}, {"autor": "davni_", "date": "2019-01-09 23:14:58", "content": "Designing /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/aecof5/designing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 82741, "year": "2019"}, {"autor": "thenickdude", "date": "2019-01-24 06:45:16", "content": "I designed and 3D-printed my own LED softbox! /!/ I got my first 3D printer recently, but it sits in a shady corner of my room, so I thought I'd design a light for it. Then I realised I could kill two birds with one stone and design it to be useful for photography as well.\n\nHere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/VCciOoA\n\nI've posted the LED softbox model and the build instructions to Thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\nEver since I bought a bunch of YongNuo flashes I've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!", "link": "https://www.reddit.com/r/photography/comments/aj9s1c/i_designed_and_3dprinted_my_own_led_softbox/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed my own led softbox! /!/ i got my first 3d printer recently, but it sits in a shady corner of my room, so i thought i'd design a light for it. then i realised i could kill two birds with one stone and design it to be useful for photography as well.\n\nhere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/vcciooa\n\ni've posted the led softbox model and the build instructions to thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\never since i bought a bunch of yongnuo flashes i've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!", "sortedWord": "None", "Identifyer": null, "identifyer": 83601, "year": "2019"}], "name": "canon2019design"}