{"interestingcomments": [{"autor": "DarkImpurity", "date": "2021-10-28 23:29:21", "content": "I created a working CRM PlugIn download for Apple Silicon under Monterey /!/ It seems that the Canon RAW Plugin for Final Cut Pro has an issue installing on the new M1 MAX &amp; Pro under Monterey. I've installed it on another Mac and pulled the folder so users can have a working copy of the official PlugIn.\n\nExtract and merge your PlugIns folder at the following path.\n\n/Library/Application Support/ProApps\n\n[CRM Plugins Folder](https://www.dropbox.com/s/tyb5woh2t8va0eb/PlugIns.zip?dl=0)", "link": "https://www.reddit.com/r/canon/comments/qhzdm9/i_created_a_working_crm_plugin_download_for_apple/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a working crm plugin download for apple silicon under monterey /!/ it seems that the canon raw plugin for final cut pro has an issue installing on the new m1 max &amp; pro under monterey. i've installed it on another mac and pulled the folder so users can have a working copy of the official plugin.\n\nextract and merge your plugins folder at the following path.\n\n/library/application support/proapps\n\n[crm plugins folder](https://www.dropbox.com/s/tyb5woh2t8va0eb/plugins.zip?dl=0)", "sortedWord": "None", "Identifyer": null, "identifyer": 38921, "year": "2021"}, {"autor": "Local_Anywhere", "date": "2021-02-11 23:47:35", "content": "\"Could not find the server. Check the SMTP server settings and the DNS settings\" /!/ Hi,\n\nI am trying to set up  scan and send to email in our Canon printer. When users attempt to scan and send, the printer scans the documents but fails to send. This is also visible in the Status Monitor on the printer under Send &gt; Job Log which gives error code #801\n\nWe use O365 and Outlook for correspondence. I have created an O3565 account specifically for scan and send, and this account is configured as follows:\n\nProtocol: SMTP\n\nSMTP Server: smtp.office365.com\n\nPort: 587 (SSL)\n\nOn the Canon printer's Remote UI accessible from a browser, the SMTP details are correct under Settings/Registration : Function Settings : Send &gt; Network Settings - E-Mail/I-Fax Settings. I have also validated these on the printer itself.\n\nI can \"Check SMTP Connection\" from the above location on the printer with the following appearing after a few seconds:\n\n*\"Could not find the server. Check the SMTP server settings, the DNS settings, and the SMTP server status.\"*\n\nI'm out of ideas to troubleshoot this further! Any assistance from the community is much appreciated.", "link": "https://www.reddit.com/r/canon/comments/lhybum/could_not_find_the_server_check_the_smtp_server/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "\"could not find the server. check the smtp server settings and the dns settings\" /!/ hi,\n\ni am trying to set up  scan and send to email in our canon printer. when users attempt to scan and send, the printer scans the documents but fails to send. this is also visible in the status monitor on the printer under send &gt; job log which gives error code #801\n\nwe use o365 and outlook for correspondence. -----> i !!!  -----> have !!!  -----> created !!!  an o3565 account specifically for scan and send, and this account is configured as follows:\n\nprotocol: smtp\n\nsmtp server: smtp.office365.com\n\nport: 587 (ssl)\n\non the canon printer's remote ui accessible from a browser, the smtp details are correct under settings/registration : function settings : send &gt; network settings - e-mail/i-fax settings. i have also validated these on the printer itself.\n\ni can \"check smtp connection\" from the above location on the printer with the following appearing after a few seconds:\n\n*\"could not find the server. check the smtp server settings, the dns settings, and the smtp server status.\"*\n\ni'm out of ideas to troubleshoot this further! any assistance from the community is much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 38978, "year": "2021"}, {"autor": "ikarus84", "date": "2021-08-21 17:27:02", "content": "How to FTPS with a Canon R6 and a Synology FTPS-server? /!/ Does anyone know how to connect a Canon R6 to a Synology FTPS-server? I successfully connected it via regular FTP, so ports are working, passive FTP connects well, no issue. But if I want to use the secure protocol, I get error 41, be it in the local network or remotely. \n\nI tried to play around with the root certificate. My Synology uses a wildcard-letsencrypt-certificate for FTPS. I tried to add all the certificates I found to the SD card and imported them successfully one after the other to the Canon. But I couldn’t manage to create a successful FTPS connection on the Canon with any of them. \n\nThe same FTPS works well and without problems with other apps on MacOS, so address, port and login must be correct. I also tried Canons own Mobile Transfer App (https://www.canon-europe.com/apps/mobile-file-transfer/) and there I can use FTP, FTPS and SFTP successfully. So my credentials should be okay. \n\nI also checked the folder settings on camera, tried with and without folders and “/“ signs at the beginning and the end, I never works on FTPS (no problem on FTP with or without the / though). \n\nIs there anyone in the world with a working FTPS on a Canon camera? What could I check else? \nI saw some “year 2038”-bug? Is it possible anyway to use FTPS? Here it seems the bug got fixed: https://www.cs.hmc.edu/~geoff/ftp5d4.html\n\nAre there anywhere log files, so I can check more details? Do I need to create another certificate with special options instead of Let’s Encrypt? And why I on earth there is no tutorial anywhere about Canon cameras in combination with Synology NAS FTPS? So many questions. Please help!", "link": "https://www.reddit.com/r/canon/comments/p8viob/how_to_ftps_with_a_canon_r6_and_a_synology/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": "how to ftps with a canon r6 and a synology ftps-server? /!/ does anyone know how to connect a canon r6 to a synology ftps-server? i successfully connected it via regular ftp, so ports are working, passive ftp connects well, no issue. but if i want to use the secure protocol, i get error 41, be it in the local network or remotely. \n\ni tried to play around with the root certificate. my synology uses a wildcard-letsencrypt-certificate for ftps. i tried to add all the certificates i found to the sd card and imported them successfully one after the other to the canon. but i couldn’t manage to create a successful ftps connection on the canon with any of them. \n\nthe same ftps works well and without problems with other apps on macos, so address, port and login must be correct. i also tried canons own mobile transfer app (https://www.canon-europe.com/apps/mobile-file-transfer/) and there i can use ftp, ftps and sftp successfully. so my credentials should be okay. \n\ni also checked the folder settings on camera, tried with and without folders and “/“ signs at the beginning and the end, i never works on ftps (no problem on ftp with or without the / though). \n\nis there anyone in the world with a working ftps on a canon camera? what could i check else? \ni saw some “year 2038”-bug? is it possible anyway to use ftps? here it seems the bug got fixed: https://www.cs.hmc.edu/~geoff/ftp5d4.html\n\nare there anywhere log files, so i can check more details? do -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  another certificate with special options instead of let’s encrypt? and why i on earth there is no tutorial anywhere about canon cameras in combination with synology nas ftps? so many questions. please help!", "sortedWord": "None", "Identifyer": null, "identifyer": 40446, "year": "2021"}, {"autor": "egyptianstriker11293", "date": "2021-01-07 20:04:26", "content": "Almost 6 months with the Canon R5 /!/ It’s almost been 6 months of using my Canon R5 and I think this could help people who are looking to make a purchase or switch to this camera. I’ve used it in the humidity of Charleston, the salty air of Aruba and Jamaica, the cold winters of Washington and Montana, and the long hours of a professional wedding video. The camera is simply amazing when you just go out and create without overthinking the boundaries of the camera itself. \n\nI’ll start with the “negatives” because these would be my only two complaints to canon. And these could easily be fixed in a firmware update.\n\nDid it overheat? Once during the wedding but I learned from it. I learned that I don’t need to shoot 4K HQ for a wedding because the files are simply too large for my hard drives. I learned to be more precise in my shots and not over shoot which saves me time in post. It made me a better videographer. This isn’t crippling like people make it out to be.\n\nYes, the file sizes are large. Large enough that I had some serious issues at the start of owning this camera. I had to create a new workflow and now it isn’t an issue. Once I got accustomed to it, life was easier. But full transparency...my 5k MacBook Pro and Adobe Premier Pro were fighting to handle the files. I have sold my MacBook and acquired the M1 Mac mini which is a beast for the R5. So keep that in mind...This is an additional cost excluding hard drives to store these files.\n\nNow the good:\nIBIS has saved me. I don’t travel with a gimbal anymore (it’s not going to replace your gimbal I just personally don’t need the extra baggage)\n\n8k if you need it. I did a video of me proposing to my girlfriend and this was a shot where I didn’t need 8k but I used it so I can frame the shot later. You never know when you’ll use it\n\n4K 120fps - self explanatory although 4K 60fps is my go to for cinematic videos.\n\nCanon color science and skin tones are so buttery smooth I’ll never get over it.\n\nErgonomics and feel is fantastic for me personally. It’s heavy enough but not too heavy that it’s a burden. Although when you get this thing on a gimbal you’re gonna get a workout.\n\nFuture Proof - I really don’t see myself upgrading this camera for at least 3 years. I would get a c70 type camera before upgrading this.\n\n\nFinal thought: If you’re gonna be picky and complain about the camera itself then the hardware you’re using isn’t the issue. But if you’re looking to enhance and take your art to the next level than I say this with full confidence...don’t think just buy it! The price tag is high I know, but maybe it’ll help you push yourself to get that extra gig or even start making videos or photography for money. \n\nThanks for coming to my Ted talk", "link": "https://www.reddit.com/r/canon/comments/kslf9i/almost_6_months_with_the_canon_r5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i had to create", "selectorShort": "create", "MarkedSent": "almost 6 months with the canon r5 /!/ it’s almost been 6 months of using my canon r5 and i think this could help people who are looking to make a purchase or switch to this camera. i’ve used it in the humidity of charleston, the salty air of aruba and jamaica, the cold winters of washington and montana, and the long hours of a professional wedding video. the camera is simply amazing when you just go out and create without overthinking the boundaries of the camera itself. \n\ni’ll start with the “negatives” because these would be my only two complaints to canon. and these could easily be fixed in a firmware update.\n\ndid it overheat? once during the wedding but i learned from it. i learned that i don’t need to shoot 4k hq for a wedding because the files are simply too large for my hard drives. i learned to be more precise in my shots and not over shoot which saves me time in post. it made me a better videographer. this isn’t crippling like people make it out to be.\n\nyes, the file sizes are large. large enough that i had some serious issues at the start of owning this camera. -----> i !!!  -----> had !!!  -----> to !!!  -----> create !!!  a new workflow and now it isn’t an issue. once i got accustomed to it, life was easier. but full transparency...my 5k macbook pro and adobe premier pro were fighting to handle the files. i have sold my macbook and acquired the m1 mac mini which is a beast for the r5. so keep that in mind...this is an additional cost excluding hard drives to store these files.\n\nnow the good:\nibis has saved me. i don’t travel with a gimbal anymore (it’s not going to replace your gimbal i just personally don’t need the extra baggage)\n\n8k if you need it. i did a video of me proposing to my girlfriend and this was a shot where i didn’t need 8k but i used it so i can frame the shot later. you never know when you’ll use it\n\n4k 120fps - self explanatory although 4k 60fps is my go to for cinematic videos.\n\ncanon color science and skin tones are so buttery smooth i’ll never get over it.\n\nergonomics and feel is fantastic for me personally. it’s heavy enough but not too heavy that it’s a burden. although when you get this thing on a gimbal you’re gonna get a workout.\n\nfuture proof - i really don’t see myself upgrading this camera for at least 3 years. i would get a c70 type camera before upgrading this.\n\n\nfinal thought: if you’re gonna be picky and complain about the camera itself then the hardware you’re using isn’t the issue. but if you’re looking to enhance and take your art to the next level than i say this with full confidence...don’t think just buy it! the price tag is high i know, but maybe it’ll help you push yourself to get that extra gig or even start making videos or photography for money. \n\nthanks for coming to my ted talk", "sortedWord": "None", "Identifyer": null, "identifyer": 41348, "year": "2021"}, {"autor": "zrgardne", "date": "2021-06-05 13:50:04", "content": "Canon R5, force to switch cards with custom presets /!/ Just got my R5!  I have created 8k (C1) preset and a 4k (C3) preset.  \n\n\nI want the 4k to go to my big, cheaper, SD card.  The 8k is too high bitrate and must go to the CFexpress slot (smaller, expensive).\n\n&amp;#x200B;\n\nI see how to manually change the slots, **is there a way to tie it to the C1/C3 so it automatically changes.**  \n\n\nI don't want to shoot a few minutes of 8k, have to manually change to CF slot and then later forget to change back to SD slot when I shoot 4k.\n\nIf I use the \" 1 RAW, 2 MP4 \" setting in the yellow menu, It won't even let me switch to my C3 (4k) preset.  you can only select 8k resolutions.   \n\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/nsw5nz/canon_r5_force_to_switch_cards_with_custom_presets/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "canon r5, force to switch cards with custom presets /!/ just got my r5!  -----> i !!!  -----> have !!!  -----> created !!!  8k (c1) preset and a 4k (c3) preset.  \n\n\ni want the 4k to go to my big, cheaper, sd card.  the 8k is too high bitrate and must go to the cfexpress slot (smaller, expensive).\n\n&amp;#x200b;\n\ni see how to manually change the slots, **is there a way to tie it to the c1/c3 so it automatically changes.**  \n\n\ni don't want to shoot a few minutes of 8k, have to manually change to cf slot and then later forget to change back to sd slot when i shoot 4k.\n\nif i use the \" 1 raw, 2 mp4 \" setting in the yellow menu, it won't even let me switch to my c3 (4k) preset.  you can only select 8k resolutions.   \n\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 42041, "year": "2021"}], "name": "createcanon2021"}