{"interestingcomments": [{"autor": "iebyt", "date": "2018-09-08 20:18:25", "content": "Android app to control Canon DSLR cameras using Bluetooth LE. /!/ Hi everyone,\n\nI created an android app to control my EOS 200D using Bluetooth LE. This app allows the phone to be used as Canon's BR-E1 bluetooth remote. The app should work with any Canon Cameras which support BR-E1 remote. The official list is 77D, 800D, 200D and 6D Mark II. I am only able to test the app with my 200D as I have only one camera. I would like to know if this app works with any other canon cameras. Link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nThank you", "link": "https://www.reddit.com/r/canon/comments/9e76aq/android_app_to_control_canon_dslr_cameras_using/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "android app to control canon dslr cameras using bluetooth le. /!/ hi everyone,\n\n-----> i !!!  -----> created !!!  an android app to control my eos 200d using bluetooth le. this app allows the phone to be used as canon's br-e1 bluetooth remote. the app should work with any canon cameras which support br-e1 remote. the official list is 77d, 800d, 200d and 6d mark ii. i am only able to test the app with my 200d as i have only one camera. i would like to know if this app works with any other canon cameras. link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nthank you", "sortedWord": "None", "Identifyer": null, "identifyer": 22418, "year": "2018"}, {"autor": "kenneyy88", "date": "2018-05-28 08:25:52", "content": "Comic Con Convention Lense for EOS 6D MARK II for less than $1000 /!/ For under $1,000. Whats a good lense for full frame for shooting a comic con convention, where I am shooting a few feet away from the person, and I want to create some easier background blur. Something with a good F-Stop, but the lense can't be too big because I'll be pretty close to the people. \n", "link": "https://www.reddit.com/r/canon/comments/8mojzr/comic_con_convention_lense_for_eos_6d_mark_ii_for/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "comic con convention lense for eos 6d mark ii for less than $1000 /!/ for under $1,000. whats a good lense for full frame for shooting a comic con convention, where -----> i !!!  am shooting a few feet away from the person, and -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  some easier background blur. something with a good f-stop, but the lense can't be too big because i'll be pretty close to the people. \n", "sortedWord": "None", "Identifyer": null, "identifyer": 24403, "year": "2018"}, {"autor": "Ener_Ji", "date": "2018-12-07 17:33:39", "content": "How to OCR scan using MF733Cdw? /!/ Recently picked up this multi-function device. It was advertised as having OCR capabilities but I can not find the option to OCR (i.e. create a searchable text PDF) anywhere in the software for macOS. I just installed the latest software from the site today.\n\nThe software installed \"MF Toolbox\" and \"Canon MF Scan Utility,\" but only the Scan Utility appears to be compatible with my device per Canon, and it doesn't appear to allow me to create a text-searchable PDF.\n\nAny ideas? My old Canon multi-function supported OCR, and the HP multi-function I was considering  instead of this Canon definitely supports it.", "link": "https://www.reddit.com/r/canon/comments/a4231b/how_to_ocr_scan_using_mf733cdw/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "how to ocr scan using mf733cdw? /!/ recently picked up this multi-function device. it was advertised as having ocr capabilities but i can not find the option to ocr (i.e. create a searchable text pdf) anywhere in the software for macos. i just installed the latest software from the site today.\n\nthe software installed \"mf toolbox\" and \"canon mf scan utility,\" but only the scan utility appears -----> to !!!  be compatible with my device per canon, and it doesn't appear -----> to !!!  allow -----> me !!!  -----> to !!!  -----> create !!!  a text-searchable pdf.\n\nany ideas? my old canon multi-function supported ocr, and the hp multi-function i was considering  instead of this canon definitely supports it.", "sortedWord": "None", "Identifyer": null, "identifyer": 24665, "year": "2018"}], "name": "createcanon2018"}