{"interestingcomments": [{"autor": "grd601", "date": "2020-10-17 03:34:56", "content": "My R6 set-up. Using Custom profiles to make your (my) life easier. /!/ Setting up my R6 - Think I've finally found my sweet spot. Just wanted to share what I feel is MY final set-up for my R6 (It's not ideal for everyone I know, so if it's not for you - that's cool). I think quite a few people are changing from older Canon models (5D3,4 etc) and are at first struggling with the camera settings on the R6. I know I was, so I thought sharing what helped me might help someone else. I knew the camera could be great...at times. But sometimes I couldn't stop it from doing things I didn't want it to do, especially when it came to focusing. \"Don't pick that!\" I found myself saying more than once...lol. So, first off, I thought to myself, what do I photograph most of the time. And I broke that down into three categories - 1. Static/posed mages (sometimes with people, sometimes without). 2. \"Capturing a moment\" images - usually involving kids running around, couples kissing, walking, etc. And 3. Moving animals. (Since getting the R6 and the 600MM, I've somehow become a wannabe National Geographic Photographer..lol). So, with those 3 basic image types in mind, this is how I approached my set up (And for the record, as mainly a natural light photographer most of the time I shoot in AV mode - let's not argue the pros/cons here). I created 3 custom profiles using the c1,c2, and c3 on the dial. And now easily switch back and forth between each of the profiles, without ever (or rarely) having to go into the menu system to change anything - This is my first time using the custom settings and so far it's worked great for me. As a side note - make sure you enable the joystick button to move focus points - personally I find it quicker than sliding a finger on the screen and by pressing the joystick in returns focus to centre point) And I use Elec. 1st curtain mainly. And I have my ISO set to the thumb dial.\n\n1. Static/posed Images - To set up my profile, put camera in AV. I put on the fastest lens I have and put the aperture at the lowest value. Personally I think 99% of shots I take are at the lowest value - I'm not buying a 1.2 lens to shoot at f4. lol. This ensures no matter what lens I have attached, the profile will always go the lowest aperture value of that lens. I put the ISO at 100. I changed the AF Operation to ONE SHOT AF and the AF Method to Center Point focus - move the focus via the joystick when required. I moved exposure compensation slightly to the left. Low Speed continuous shooting - with High Speed+ continuous, I found myself taking close to 3 photos each time!  And programmed the AF-ON button to change the AF Operation to Eye Tracking when pressed - This allowed me to be able to eye focus on static portraits when it was required (be sure to have \"people\" as eye type) Keep your finger on the button when pressing the shutter. And it could be said that I could leave the camera in SERVO - put just personally for me, it's comforting for me to hear the \"focus beep\" lol. Hence ONE SHOT AF. - Register these as C1. \n\n2. Moving Images. Same as above for most. But AF Operation changed Eye+Face Tracking (be sure to have \"people\" as eye type), AF Operation Changed to SERVO. High Speed+ Continous shooting. Register to C2.\n\n3. Animals. Same as 2, but eye priority as \"Animal\". Register as C3.\n\n  \nAnd that's it! For me, it's worked great this past week. As mentioned, it's not a one size fits all for sure. Just know the camera is so capable of customization and it's best to use the custom buttons for your most common uses, as opposed to changing them in the menu. It's made it much easier for me.", "link": "https://www.reddit.com/r/canon/comments/jco5tb/my_r6_setup_using_custom_profiles_to_make_your_my/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "my r6 set-up. using custom profiles to make your (my) life easier. /!/ setting up my r6 - think i've finally found my sweet spot. just wanted to share what i feel is my final set-up for my r6 (it's not ideal for everyone i know, so if it's not for you - that's cool). i think quite a few people are changing from older canon models (5d3,4 etc) and are at first struggling with the camera settings on the r6. i know i was, so i thought sharing what helped me might help someone else. i knew the camera could be great...at times. but sometimes i couldn't stop it from doing things i didn't want it to do, especially when it came to focusing. \"don't pick that!\" i found myself saying more than once...lol. so, first off, i thought to myself, what do i photograph most of the time. and i broke that down into three categories - 1. static/posed mages (sometimes with people, sometimes without). 2. \"capturing a moment\" images - usually involving kids running around, couples kissing, walking, etc. and 3. moving animals. (since getting the r6 and the 600mm, i've somehow become a wannabe national geographic photographer..lol). so, with those 3 basic image types in mind, this is how i approached my set up (and for the record, as mainly a natural light photographer most of the time i shoot in av mode - let's not argue the pros/cons here). -----> i !!!  -----> created !!!  3 custom profiles using the c1,c2, and c3 on the dial. and now easily switch back and forth between each of the profiles, without ever (or rarely) having to go into the menu system to change anything - this is my first time using the custom settings and so far it's worked great for me. as a side note - make sure you enable the joystick button to move focus points - personally i find it quicker than sliding a finger on the screen and by pressing the joystick in returns focus to centre point) and i use elec. 1st curtain mainly. and i have my iso set to the thumb dial.\n\n1. static/posed images - to set up my profile, put camera in av. i put on the fastest lens i have and put the aperture at the lowest value. personally i think 99% of shots i take are at the lowest value - i'm not buying a 1.2 lens to shoot at f4. lol. this ensures no matter what lens i have attached, the profile will always go the lowest aperture value of that lens. i put the iso at 100. i changed the af operation to one shot af and the af method to center point focus - move the focus via the joystick when required. i moved exposure compensation slightly to the left. low speed continuous shooting - with high speed+ continuous, i found myself taking close to 3 photos each time!  and programmed the af-on button to change the af operation to eye tracking when pressed - this allowed me to be able to eye focus on static portraits when it was required (be sure to have \"people\" as eye type) keep your finger on the button when pressing the shutter. and it could be said that i could leave the camera in servo - put just personally for me, it's comforting for me to hear the \"focus beep\" lol. hence one shot af. - register these as c1. \n\n2. moving images. same as above for most. but af operation changed eye+face tracking (be sure to have \"people\" as eye type), af operation changed to servo. high speed+ continous shooting. register to c2.\n\n3. animals. same as 2, but eye priority as \"animal\". register as c3.\n\n  \nand that's it! for me, it's worked great this past week. as mentioned, it's not a one size fits all for sure. just know the camera is so capable of customization and it's best to use the custom buttons for your most common uses, as opposed to changing them in the menu. it's made it much easier for me.", "sortedWord": "None", "Identifyer": null, "identifyer": 45408, "year": "2020"}, {"autor": "traderjay_toronto", "date": "2020-12-28 16:03:57", "content": "Reddit post image size limit /!/ I am relatively new to reddit and am wondering if there is a image size limit for posts? When I try to create a photo post, it often doesn't show up and just disappear.", "link": "https://www.reddit.com/r/canon/comments/klt4c8/reddit_post_image_size_limit/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i try to create", "selectorShort": "create", "MarkedSent": "reddit post image size limit /!/ i am relatively new to reddit and am wondering if there is a image size limit for posts? when -----> i !!!  -----> try !!!  -----> to !!!  -----> create !!!  a photo post, it often doesn't show up and just disappear.", "sortedWord": "None", "Identifyer": null, "identifyer": 45654, "year": "2020"}, {"autor": "DariuszBoron", "date": "2020-07-30 11:54:11", "content": "Alternative for the Clear filter for Canon's Drop in RF to EF Adapter. /!/ Hi everyone,\n\nI've created an alternative to the clear drop in filter, which would drop into the Canon RF to EF adapter for the EOS R series of cameras. This filter has no actual lens, just an opening, to reduce glass items. Many will be familiar with using their EF lenses with the RF camera. I'm looking for comments, suggestions, ideas, constructive criticism with this idea please. Thanks a lot!\n\n[Just to be used like a regular clear Canon filter.](https://preview.redd.it/qxn7tdapgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=b19ef2518628cc70182b573dd22fe38b3d8fb666)\n\n&amp;#x200B;\n\n[the item for now](https://preview.redd.it/xkxpm1lvgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=90727ddd2260008c29644b7f2f7ac8d2df03356e)", "link": "https://www.reddit.com/r/canon/comments/i0kpzz/alternative_for_the_clear_filter_for_canons_drop/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "alternative for the clear filter for canon's drop in rf to ef adapter. /!/ hi everyone,\n\n-----> i !!! 've -----> created !!!  an alternative to the clear drop in filter, which would drop into the canon rf to ef adapter for the eos r series of cameras. this filter has no actual lens, just an opening, to reduce glass items. many will be familiar with using their ef lenses with the rf camera. i'm looking for comments, suggestions, ideas, constructive criticism with this idea please. thanks a lot!\n\n[just to be used like a regular clear canon filter.](https://preview.redd.it/qxn7tdapgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=b19ef2518628cc70182b573dd22fe38b3d8fb666)\n\n&amp;#x200b;\n\n[the item for now](https://preview.redd.it/xkxpm1lvgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=90727ddd2260008c29644b7f2f7ac8d2df03356e)", "sortedWord": "None", "Identifyer": null, "identifyer": 48795, "year": "2020"}, {"autor": "DariuszBoron", "date": "2020-07-30 11:49:43", "content": "RF to EF drop in filter - an alternative to Canon's version /!/ Hi everyone,\n\nI've created an alternative to the clear drop in filter, which would drop into the Canon RF to EF adapter for the EOS R series of cameras. Many will be familiar with using their EF lenses with the RF camera. I'm looking for comments, suggestions, ideas, constructive criticism with this idea please. Thanks a lot!", "link": "https://www.reddit.com/r/canon/comments/i0knzt/rf_to_ef_drop_in_filter_an_alternative_to_canons/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "rf to ef drop in filter - an alternative to canon's version /!/ hi everyone,\n\n-----> i !!! 've -----> created !!!  an alternative to the clear drop in filter, which would drop into the canon rf to ef adapter for the eos r series of cameras. many will be familiar with using their ef lenses with the rf camera. i'm looking for comments, suggestions, ideas, constructive criticism with this idea please. thanks a lot!", "sortedWord": "None", "Identifyer": null, "identifyer": 48796, "year": "2020"}, {"autor": "WasikulIslam", "date": "2020-08-17 14:48:58", "content": "Look at this vlog I created with the standard profile picture for the 5d mark iv what y’all think canon colors dont disappoint! 🤟", "link": "https://www.reddit.com/r/canon/comments/ibfif5/look_at_this_vlog_i_created_with_the_standard/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "look at this vlog -----> i !!!  -----> created !!!  with the standard profile picture for the 5d mark iv what y’all think canon colors dont disappoint! 🤟", "sortedWord": "None", "Identifyer": null, "identifyer": 48989, "year": "2020"}, {"autor": "colorconverge", "date": "2020-11-13 05:40:04", "content": "Canon R5 Camera Matching Profile Released! /!/ I know a lot of Canon shooters with the newer bodies are struggling to get the Canon look in Lightroom and ACR because the Camera Matching Profiles are not available. This is a big problem for a lot of users upgrading from other Canon bodies or who purchased these cameras for their color science. Using my own unique process of analyzing and matching thousands of colors to produce an accurate result I have created a profile matching the Canon Standard look and it is now available for the Canon R5. I've seen people trying to match images using LR's built in tools then rolling their own profile or preset. The problem is using HSL for example to fix the red channel will also affect skin tone or trying to \"warm\" skin with white balance shifts your white point. What you end up with is a result that isn't very accurate or is only good enough for a particular image. This profile with one click will get you the look you expect and will match closely with DPP sRGB output or SOOC JPEG and as a bonus presets made for Canon will now look correct. It is the cost of a cup of coffee and anyone who purchases our profiles will receive free updates if improvements are made. I hope this helps save you some time processing your images! You can find the EOS Standard profile at\n\n [https://colorconverge.com/collections/frontpage/products/canon-r5-eos-standard](https://colorconverge.com/collections/frontpage/products/canon-r5-eos-standard)", "link": "https://www.reddit.com/r/canon/comments/jtbkh6/canon_r5_camera_matching_profile_released/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "canon r5 camera matching profile released! /!/ i know a lot of canon shooters with the newer bodies are struggling to get the canon look in lightroom and acr because the camera matching profiles are not available. this is a big problem for a lot of users upgrading from other canon bodies or who purchased these cameras for their color science. using my own unique process of analyzing and matching thousands of colors to produce an accurate result -----> i !!!  -----> have !!!  -----> created !!!  a profile matching the canon standard look and it is now available for the canon r5. i've seen people trying to match images using lr's built in tools then rolling their own profile or preset. the problem is using hsl for example to fix the red channel will also affect skin tone or trying to \"warm\" skin with white balance shifts your white point. what you end up with is a result that isn't very accurate or is only good enough for a particular image. this profile with one click will get you the look you expect and will match closely with dpp srgb output or sooc jpeg and as a bonus presets made for canon will now look correct. it is the cost of a cup of coffee and anyone who purchases our profiles will receive free updates if improvements are made. i hope this helps save you some time processing your images! you can find the eos standard profile at\n\n [https://colorconverge.com/collections/frontpage/products/canon-r5-eos-standard](https://colorconverge.com/collections/frontpage/products/canon-r5-eos-standard)", "sortedWord": "None", "Identifyer": null, "identifyer": 50004, "year": "2020"}, {"autor": "hawker_93", "date": "2020-09-17 16:07:23", "content": "Camera not focusing on subject /!/  Could anyone help me identify the problem here. I have the 5D Mark III, worked on calibrating it multiple times. The camera doesn't seem to have as much of a problem back/front focusing. But seems to just jump to the side once you take picture and focus on a random object. The focus point won't stick where its at or on the subject you want. This is causing some issues and I really need some guidance on what to fix. Is this fixable, do you have to send to canon direct? This is something that has developed into a problem, it hasn't always been this way. Any help would be appreciated. Created an account just to try and fix this, thanks.", "link": "https://www.reddit.com/r/canon/comments/iumheu/camera_not_focusing_on_subject/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "camera not focusing on subject /!/  could anyone help me identify the problem here. i have the 5d mark iii, worked on calibrating it multiple times. the camera doesn't seem to have as much of a problem back/front focusing. but seems to just jump to the side once you take picture and focus on a random object. the focus point won't stick where its at or on the subject you want. this is causing some issues and i really need some guidance on what to fix. is this fixable, do you have to send to canon direct? this is something that has developed into a problem, it hasn't always been this way. any help would be appreciated. -----> created !!!  an account just to try and fix this, thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 51293, "year": "2020"}], "name": "createcanon2020"}