{"interestingcomments": [{"autor": "Bikingpanda", "date": "2020-01-20 14:52:08", "content": "M5 quick menu /!/ Hello, I have a question on the M5. On my other canon DSLRs when I have the quick menu up (i think that is what it is called) I can still adjust the shutter and aperture and press the Q button when I want to adjust something else. On the M5 when this screen is up I can only adjust what the orange box is highlighted. I can’t figure out what to press to get rid of the orange box so I can just aperture and shutter without putting the camera or switching to live view. Is this how it is my design? Or is there a setting I am missing?  https://i.imgur.com/9XmLfoZ.jpg", "link": "https://www.reddit.com/r/canon/comments/ere5tu/m5_quick_menu/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "m5 quick menu /!/ hello, i have a question on the m5. on my other canon dslrs when i have the quick menu up (i think that is what it is called) i can still adjust the shutter and aperture and press the q button when i want to adjust something else. on the m5 when this screen is up i can only adjust what the orange box is highlighted. i can’t figure out what to press to get rid of the orange box so i can just aperture and shutter without putting the camera or switching to live view. is this how it is -----> my !!!  -----> design !!! ? or is there a setting i am missing?  https://i.imgur.com/9xmlfoz.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 46058, "year": "2020"}, {"autor": "TheHamilton_Man", "date": "2020-06-04 20:18:41", "content": "Pixma TS 9020 feed roller gear /!/ My Canon Pixma TS 9020 has lost its feed roller gear so it will not print. I understand that I could send it back and get a new one, but I figured I’d try to fix it myself first. I no longer have the gear, but do have access to a 3D printer. I was wondering if anyone had either a replica file or even just the dimensions so I could design it. Thanks :D", "link": "https://www.reddit.com/r/canon/comments/gwpayv/pixma_ts_9020_feed_roller_gear/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i could design", "selectorShort": "design", "MarkedSent": "pixma ts 9020 feed roller gear /!/ my canon pixma ts 9020 has lost its feed roller gear so it will not print. i understand that i could send it back and get a new one, but i figured i’d try to fix it myself first. i no longer have the gear, but do have access to a 3d printer. -----> i !!!  was wondering if anyone had either a replica file or even just the dimensions so -----> i !!!  -----> could !!!  -----> design !!!  it. thanks :d", "sortedWord": "None", "Identifyer": null, "identifyer": 46589, "year": "2020"}], "name": "designcanon2020"}