{"interestingcomments": [{"autor": "PossibleDefect", "date": "2021-02-22 03:36:54", "content": "Need critical screw depth information! /!/ Hello, I hope this question is allowed here. I am designing a tripod adapter for a Canon 600-700D (2012-2013ish). I contacted Canon customer support but they refused to give me the depth of the tripod mount thread in the bottom of the camera. If anyone has a Canon from around 2010-2015 and could somehow measure the depth, I would really appreciate it! Thanks.", "link": "https://www.reddit.com/r/canon/comments/lpe4z6/need_critical_screw_depth_information/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i am designing", "selectorShort": "design", "MarkedSent": "need critical screw depth information! /!/ hello, i hope this question is allowed here. -----> i !!!  -----> am !!!  -----> designing !!!  a tripod adapter for a canon 600-700d (2012-2013ish). i contacted canon customer support but they refused to give me the depth of the tripod mount thread in the bottom of the camera. if anyone has a canon from around 2010-2015 and could somehow measure the depth, i would really appreciate it! thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 39136, "year": "2021"}, {"autor": "AD1AD", "date": "2021-02-03 03:47:01", "content": "I designed a 3D printable teleprompter/autocue assembly for the Canon EOS M50 =) /!/ All you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nSo, if you saved up enough for the camera itself, already have a tablet, and have access to a 3D printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nIts design could probably be pretty easily adjusted for other popular cameras. It's not quite modular, and barely parametric (I suck at OpenSCAD), but I'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nIt's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger EOS M50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nThe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=MxUbaxXaQH0](https://www.youtube.com/watch?v=MxUbaxXaQH0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nThanks for your time!", "link": "https://www.reddit.com/r/canon/comments/lberua/i_designed_a_3d_printable_teleprompterautocue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> designed !!!  a 3d printable teleprompter/autocue assembly for the canon eos m50 =) /!/ all you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nso, if you saved up enough for the camera itself, already have a tablet, and have access to a 3d printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nits design could probably be pretty easily adjusted for other popular cameras. it's not quite modular, and barely parametric (i suck at openscad), but i'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nit's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger eos m50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nthe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=mxubaxxaqh0](https://www.youtube.com/watch?v=mxubaxxaqh0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nthanks for your time!", "sortedWord": "None", "Identifyer": null, "identifyer": 41000, "year": "2021"}, {"autor": "DallasTheLab", "date": "2021-08-14 21:18:27", "content": "How Do I Export \"High Frame Rate\" Video In 120fps?? /!/ Long story short I design and manufacture ballistic rated doors. I filmed some rounds hitting one at a gun range using my EOS M50 setup on my tripod. I made sure to enable its \"High Frame Rate Movie\" mode which captures in 1280x720 @ 119.9fps. I can play it back on the cameras screen in slow motion and it looks great. However, when I plug the SD card into my computer and I right click, go to properties, then details it shows it is in 29.99fps. What gives?? Can I not export the video in 120fps?", "link": "https://www.reddit.com/r/canon/comments/p4gcsn/how_do_i_export_high_frame_rate_video_in_120fps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "how do i export \"high frame rate\" video in 120fps?? /!/ long story short -----> i !!!  -----> design !!!  and manufacture ballistic rated doors. i filmed some rounds hitting one at a gun range using my eos m50 setup on my tripod. i made sure to enable its \"high frame rate movie\" mode which captures in 1280x720 @ 119.9fps. i can play it back on the cameras screen in slow motion and it looks great. however, when i plug the sd card into my computer and i right click, go to properties, then details it shows it is in 29.99fps. what gives?? can i not export the video in 120fps?", "sortedWord": "None", "Identifyer": null, "identifyer": 42824, "year": "2021"}], "name": "designcanon2021"}