{"interestingcomments": [{"autor": "nicbuh", "date": "2021-01-11 09:45:19", "content": "A simple Intervalometer for the Canon M50 /!/ The Canon M50 is a remarkable camera with great value for money. One of the shortcomings, however, has always been the lack of intervalometer functionality: Unlike many of its bigger brothers the M50 doesn't provide this option in its menu and even external intervalometers are not connectable to the camera as it lacks the needed connector. As no solution in the market seemed to solve this issue, I have developed a simple app for Android that can trigger the camera via bluetooth at a set interval. Figuring that other people may have the same need, I put it on the play store and hope you find it useful:\nhttps://play.google.com/store/apps/details?id=com.booman.intervalometer", "link": "https://www.reddit.com/r/canon/comments/kuzkm8/a_simple_intervalometer_for_the_canon_m50/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "a simple intervalometer for the canon m50 /!/ the canon m50 is a remarkable camera with great value for money. one of the shortcomings, however, has always been the lack of intervalometer functionality: unlike many of its bigger brothers the m50 doesn't provide this option in its menu and even external intervalometers are not connectable to the camera as it lacks the needed connector. as no solution in the market seemed to solve this issue, -----> i !!!  -----> have !!!  -----> developed !!!  a simple app for android that can trigger the camera via bluetooth at a set interval. figuring that other people may have the same need, i put it on the play store and hope you find it useful:\nhttps://play.google.com/store/apps/details?id=com.booman.intervalometer", "sortedWord": "None", "Identifyer": null, "identifyer": 39333, "year": "2021"}, {"autor": "isentropicfox", "date": "2021-10-19 09:38:41", "content": "Canon DPP batch processing /!/ I just installed Canon Digital Photo Professional software (RAW developer) on windows 7.\n\nI am looking to develop around 100 raw files at a time and I saw there is a batch processing option under files menu. But I don't see how I can apply settings on all the Raw images for batch processing, by just setting one of them? For example right now I am looking at changing white balance of all the images to daylight. Do I have to adjust settings for example every single raw file?", "link": "https://www.reddit.com/r/canon/comments/qb7zyc/canon_dpp_batch_processing/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i am looking to develop", "selectorShort": "develop", "MarkedSent": "canon dpp batch processing /!/ i just installed canon digital photo professional software (raw developer) on windows 7.\n\n-----> i !!!  -----> am !!!  -----> looking !!!  -----> to !!!  -----> develop !!!  around 100 raw files at a time and i saw there is a batch processing option under files menu. but i don't see how i can apply settings on all the raw images for batch processing, by just setting one of them? for example right now i am looking at changing white balance of all the images to daylight. do i have to adjust settings for example every single raw file?", "sortedWord": "None", "Identifyer": null, "identifyer": 43734, "year": "2021"}, {"autor": "facedodge", "date": "2021-02-15 01:37:48", "content": "Handy Canon R Back Button AF Trick I've Discovered /!/ In watching reviews before I bought the R6, I've seen a few say they've dropped the back button AF and moved to half depressed shutter as focus/recompose is no longer a thing. I gave it a go and agree that this is totally workable and a tribute to great engineering but I've developed a lot of muscle memory and I think I've found a good way to put it to use that still makes good use of the great AF of the new R cameras.\n\nMy settings for Custom Buttons:\n\nHalf Depress Shutter is set to \"AE lock\"\n\nAE Lock button is set to \"Metering and AF Start\"\n\nAF-ON is set to \"Eye Detection AF\"\n\nHow it works:\n\nI keep the AF set to \"One point\" and not Eye AF despite me using this most of the time. When I am taking a photo of a person, I use the back button AF button like I'm accustomed and that overrides the AF settings and uses eye detection. When I am taking a photo of a static object I can use either back button AF or the AE lock button (\\*). If the eye AF system doesn't find my intended subject, I just have to move my thumb and relocate the single point AF spot - no switching settings. \n\nSo rather than drop back button AF, I've doubled down and now have two back button AFs. One for eye detection and another for default settings. \n\nI rarely used AE lock in the past and usually had shutter lock AE previously so It's been working great for me. I hope some of you find it useful as well.", "link": "https://www.reddit.com/r/canon/comments/lk2m5s/handy_canon_r_back_button_af_trick_ive_discovered/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "handy canon r back button af trick i've discovered /!/ in watching reviews before i bought the r6, i've seen a few say they've dropped the back button af and moved to half depressed shutter as focus/recompose is no longer a thing. i gave it a go and agree that this is totally workable and a tribute to great engineering but -----> i !!! 've -----> developed !!!  a lot of muscle memory and i think i've found a good way to put it to use that still makes good use of the great af of the new r cameras.\n\nmy settings for custom buttons:\n\nhalf depress shutter is set to \"ae lock\"\n\nae lock button is set to \"metering and af start\"\n\naf-on is set to \"eye detection af\"\n\nhow it works:\n\ni keep the af set to \"one point\" and not eye af despite me using this most of the time. when i am taking a photo of a person, i use the back button af button like i'm accustomed and that overrides the af settings and uses eye detection. when i am taking a photo of a static object i can use either back button af or the ae lock button (\\*). if the eye af system doesn't find my intended subject, i just have to move my thumb and relocate the single point af spot - no switching settings. \n\nso rather than drop back button af, i've doubled down and now have two back button afs. one for eye detection and another for default settings. \n\ni rarely used ae lock in the past and usually had shutter lock ae previously so it's been working great for me. i hope some of you find it useful as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 43782, "year": "2021"}], "name": "developcanon2021"}