{"interestingcomments": [{"autor": "LAG360", "date": "2021-09-30 19:45:16", "content": "What to do with a broken 5Dmk2? /!/ Bought a t3i from someone on facebook marketplace and the dude threw in a 5dmk2 that he had lying around but with no batteries and he had no idea if it worked or not. I got Neewer third party batteries for it to test it out and it just wouldn't turn on, no error message because it's a 3rd party or anything. I don't know what the issue is and there are no external indicators that I see of any damage.\n\nWorth pointing out I got the t3i for super cheap for a friend who wanted to start out in photography but doesn't have much budget at the moment because of large important expenses (meaning he would have more budget next year). I didn't know until later that the 5dmk2 is actually a more expensive camera than the t3i and was hoping to make that work for my friend instead. Regardless, I won't be personally using any of these cameras as I have my own setup.\n\nShould I sell it for parts? Try to diy fix it? Get it repaired professionally?  How much would it cost getting it repaired? \n\nSidenote: if I go the sell it for parts route, what canon aps-c lenses should I recommend for my friend? (low budget available second-hand) The t3i came with an ef-s 18-55 and I got a EF 35-105 in a bulk deal previously that I was gonna throw in for my friend.", "link": "https://www.reddit.com/r/canon/comments/pyrb92/what_to_do_with_a_broken_5dmk2/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what to do with a broken 5dmk2? /!/ bought a t3i from someone on facebook marketplace and the dude threw in a 5dmk2 that he had lying around but with no batteries and he had no idea if it worked or not. i got neewer third party batteries for it to test it out and it just wouldn't turn on, no error message because it's a 3rd party or anything. i don't know what the issue is and there are no external indicators that i see of any damage.\n\nworth pointing out i got the t3i for super cheap for a friend who wanted to start out in photography but doesn't have much budget at the moment because of large important expenses (meaning he would have more budget next year). i didn't know until later that the 5dmk2 is actually a more expensive camera than the t3i and was hoping to make that work for my friend instead. regardless, i won't be personally using any of these cameras as i have my own setup.\n\nshould i sell it for parts? try to -----> diy !!!  fix it? get it repaired professionally?  how much would it cost getting it repaired? \n\nsidenote: if i go the sell it for parts route, what canon aps-c lenses should i recommend for my friend? (low budget available second-hand) the t3i came with an ef-s 18-55 and i got a ef 35-105 in a bulk deal previously that i was gonna throw in for my friend.", "sortedWord": "None", "Identifyer": null, "identifyer": 38773, "year": "2021"}, {"autor": "earth_bender86", "date": "2021-04-27 03:09:45", "content": "CANON 24-70 F2.8 L USM /!/ Hi all. Hoping to get some help. My lens has developed 3 problems\n\n1. It will not open to 24mm anymore and i can only access the focal range 28mm - 70mm\n2. It is returning Error 01 at all f stops and focal lengths. I have cleaned the contacts on the lens but this has not solved the problem. I test my body with the nifty fifty and it is working properly.\n3. When looking through the view finder the image is grainy and red and the lens will NOT capture a photo unless i use the LCD view to capture images.\n\nI took it to a shop and they told me they would need to ship it to Canon and that it would likely cost 500AUD, at that price i might as well buy another lens.\n\nAnyone had the same issues and resolved them? What did you do? How much did it cost? Can i DIY this?\n\nTIA", "link": "https://www.reddit.com/r/canon/comments/mzf5rx/canon_2470_f28_l_usm/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "canon 24-70 f2.8 l usm /!/ hi all. hoping to get some help. my lens has developed 3 problems\n\n1. it will not open to 24mm anymore and i can only access the focal range 28mm - 70mm\n2. it is returning error 01 at all f stops and focal lengths. i have cleaned the contacts on the lens but this has not solved the problem. i test my body with the nifty fifty and it is working properly.\n3. when looking through the view finder the image is grainy and red and the lens will not capture a photo unless i use the lcd view to capture images.\n\ni took it to a shop and they told me they would need to ship it to canon and that it would likely cost 500aud, at that price i might as well buy another lens.\n\nanyone had the same issues and resolved them? what did you do? how much did it cost? can i -----> diy !!!  this?\n\ntia", "sortedWord": "None", "Identifyer": null, "identifyer": 39555, "year": "2021"}, {"autor": "DanieleGerussi", "date": "2021-04-23 14:24:57", "content": "Diy camera strap. /!/ I want to make a camera strap myself as a gift to a friend and i'm looking for materials to use.\nThe thing i'm looking for are those thinner nylon straps that tie onto the camera body itself, anybody knows where to get them?", "link": "https://www.reddit.com/r/canon/comments/mwwffn/diy_camera_strap/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  camera strap. /!/ i want to make a camera strap myself as a gift to a friend and i'm looking for materials to use.\nthe thing i'm looking for are those thinner nylon straps that tie onto the camera body itself, anybody knows where to get them?", "sortedWord": "None", "Identifyer": null, "identifyer": 39637, "year": "2021"}, {"autor": "accipicchia092", "date": "2021-08-22 15:33:58", "content": "Does using a \"DIY\" LOG profile really help? /!/ My Canon doesn't have any LOG profile, but I can simulate one by decreasing contrast and saturation. Does that really help capturing more data? I mean, the sensor doesn't change right? So how can you capture more data?", "link": "https://www.reddit.com/r/canon/comments/p9ekoa/does_using_a_diy_log_profile_really_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "does using a \"-----> diy !!! \" log profile really help? /!/ my canon doesn't have any log profile, but i can simulate one by decreasing contrast and saturation. does that really help capturing more data? i mean, the sensor doesn't change right? so how can you capture more data?", "sortedWord": "None", "Identifyer": null, "identifyer": 40430, "year": "2021"}, {"autor": "SteadiJam", "date": "2021-08-12 20:31:44", "content": "Canon EOS R Battery Door Tightening/Replacement /!/ Hello everyone,\n\nI was dumb and accidentally set down my Canon EOS R on the table (with a lens attached) while the battery door was open. I think I bent the spring a little bit because it opens further than I remember. Still functions fine but clearly a bit bent.\n\nDoes anyone have any links or recommendations for how to tighten the springs or bend it back? Seems like a simple enough mechanic design that it could be DIY.\n\nAny information or video links will be appreciated. Thanks!", "link": "https://www.reddit.com/r/canon/comments/p38762/canon_eos_r_battery_door_tighteningreplacement/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "canon eos r battery door tightening/replacement /!/ hello everyone,\n\ni was dumb and accidentally set down my canon eos r on the table (with a lens attached) while the battery door was open. i think i bent the spring a little bit because it opens further than i remember. still functions fine but clearly a bit bent.\n\ndoes anyone have any links or recommendations for how to tighten the springs or bend it back? seems like a simple enough mechanic design that it could be -----> diy !!! .\n\nany information or video links will be appreciated. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 40590, "year": "2021"}, {"autor": "TonyPhucHoang", "date": "2021-01-09 06:29:35", "content": "WIP DIY canon 80 vlog rig part 2 : 3d printed mount replaces onboard flash. Saramomic mixer will go on top of the mount with epoxy. I’m holding the mixer to show how it will look. Gluing tonight.", "link": "https://www.reddit.com/r/canon/comments/ktlo7e/wip_diy_canon_80_vlog_rig_part_2_3d_printed_mount/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "wip -----> diy !!!  canon 80 vlog rig part 2 : 3d printed mount replaces onboard flash. saramomic mixer will go on top of the mount with epoxy. i’m holding the mixer to show how it will look. gluing tonight.", "sortedWord": "None", "Identifyer": null, "identifyer": 41300, "year": "2021"}, {"autor": "TonyPhucHoang", "date": "2021-01-08 09:57:24", "content": "DIY canon 80d vlog rig: Removed flash, just finished CAD for 3d printed saramonic mixer mount, relocated mic port.", "link": "https://www.reddit.com/r/canon/comments/kszidr/diy_canon_80d_vlog_rig_removed_flash_just/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  canon 80d vlog rig: removed flash, just finished cad for 3d printed saramonic mixer mount, relocated mic port.", "sortedWord": "None", "Identifyer": null, "identifyer": 41327, "year": "2021"}, {"autor": "bseitz234", "date": "2021-05-11 12:47:06", "content": "[Showcase: Canon Speedlites (mixed)] DIY Photobooth /!/ Hey r/canon,\n\nWell, let's try this again, after adding a photo to my last post, all the explanatory text disappeared... \n\nThis was the first thing that came to mind when I saw the new showcase topic. I used it three times before the pandemic: at my own wedding, and then two holiday parties. It's still a work in progress, but hopefully this can help / inspire someone to get their own set up. \n\nCamera: Kind of irrelevant, but I know someone will ask. This picture was with a 7D mkII and 10-22mm, I think at 22mm (I just have the JPG and not in front of my LR catalog right now), f/8 and 1/200. I liked the wide angle look for the photo booth, even though I wouldn't normally use it for portraits, but this setup would really work with whatever you have. \n\nLights: Really just one big key light. I ganged up two 580EX ii and one 430EX ii in a triple flash umbrella bracket (inexpensive Impact from B&amp;H), in a Neewer 48\" Octabox (Amazon). Set it up on-axis and as high as I could given the ceilings in a given setup, angled down as needed to hit the subjects. Triggering was a third 580EX ii in the hot shoe. Theoretically could've used the 7D's built-in flash as the master, but with the other speedlites in a softbox, they don't see the triggering light as well, and I was able to actually tuck the 580 into the bottom of the softbox (it's a velcro front panel). I've also just bought the Phottix Laso triggering system, so in future uses I'll use radio. \n\nSetup: Background is something cheap I got on Amazon. Background stand is an Impact kit from B&amp;H.  Camera was mounted on a tripod and snugged up under the softbox, so roughly at head height, with a remote shutter release hung over a light stand near the subjects and a 3 second delay. This gave the subjects time to hit the shutter release, put it down, and pose before the picture was taken. I found the wired shutter release more reliable than the little infrared RC-6; if you have a bluetooth-capable camera the new bluetooth remote (BR-1?) might work better. It might also wander off if you don't tie it down... Anyway. Camera was shooting tethered with Lightroom CC, saving photos to a specific folder on the laptop. This folder was monitored by a free slideshow app I found, which would display the new photo full-screen as soon as it saw a new one, and then resume cycling through the other photos that had been taken that evening. In later implementations, I also synced the folder to my web server, and put a QR code on the \"Photo Booth instructions\" poster, so that people could go straight to that page and download their photos to their phones in real time. \n\nRegrets: Using TTL. I'm used to using it because I'm usually pretty mobile, and it didn't really occur to me that the lighting conditions weren't changing at all here. (I'm using the excuse that the first implementation was my own wedding and this was a very low priority, and after that I was on autopilot). The TTL got tricked by different costumes, and even different poses blocking or exposing more reflective parts of the sequined background, and I ended up with some over- or under-exposed shots. Next time it'll be manual flash. \n\nI'd love to hear your thoughts, C&amp;C totally welcomed. I've got a few events penciled in later this year (pandemic willing) that I might set this up, so if I can make it better I'd love to hear it!", "link": "https://www.reddit.com/r/canon/comments/n9w7lw/showcase_canon_speedlites_mixed_diy_photobooth/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[showcase: canon speedlites (mixed)] -----> diy !!!  photobooth /!/ hey r/canon,\n\nwell, let's try this again, after adding a photo to my last post, all the explanatory text disappeared... \n\nthis was the first thing that came to mind when i saw the new showcase topic. i used it three times before the pandemic: at my own wedding, and then two holiday parties. it's still a work in progress, but hopefully this can help / inspire someone to get their own set up. \n\ncamera: kind of irrelevant, but i know someone will ask. this picture was with a 7d mkii and 10-22mm, i think at 22mm (i just have the jpg and not in front of my lr catalog right now), f/8 and 1/200. i liked the wide angle look for the photo booth, even though i wouldn't normally use it for portraits, but this setup would really work with whatever you have. \n\nlights: really just one big key light. i ganged up two 580ex ii and one 430ex ii in a triple flash umbrella bracket (inexpensive impact from b&amp;h), in a neewer 48\" octabox (amazon). set it up on-axis and as high as i could given the ceilings in a given setup, angled down as needed to hit the subjects. triggering was a third 580ex ii in the hot shoe. theoretically could've used the 7d's built-in flash as the master, but with the other speedlites in a softbox, they don't see the triggering light as well, and i was able to actually tuck the 580 into the bottom of the softbox (it's a velcro front panel). i've also just bought the phottix laso triggering system, so in future uses i'll use radio. \n\nsetup: background is something cheap i got on amazon. background stand is an impact kit from b&amp;h.  camera was mounted on a tripod and snugged up under the softbox, so roughly at head height, with a remote shutter release hung over a light stand near the subjects and a 3 second delay. this gave the subjects time to hit the shutter release, put it down, and pose before the picture was taken. i found the wired shutter release more reliable than the little infrared rc-6; if you have a bluetooth-capable camera the new bluetooth remote (br-1?) might work better. it might also wander off if you don't tie it down... anyway. camera was shooting tethered with lightroom cc, saving photos to a specific folder on the laptop. this folder was monitored by a free slideshow app i found, which would display the new photo full-screen as soon as it saw a new one, and then resume cycling through the other photos that had been taken that evening. in later implementations, i also synced the folder to my web server, and put a qr code on the \"photo booth instructions\" poster, so that people could go straight to that page and download their photos to their phones in real time. \n\nregrets: using ttl. i'm used to using it because i'm usually pretty mobile, and it didn't really occur to me that the lighting conditions weren't changing at all here. (i'm using the excuse that the first implementation was my own wedding and this was a very low priority, and after that i was on autopilot). the ttl got tricked by different costumes, and even different poses blocking or exposing more reflective parts of the sequined background, and i ended up with some over- or under-exposed shots. next time it'll be manual flash. \n\ni'd love to hear your thoughts, c&amp;c totally welcomed. i've got a few events penciled in later this year (pandemic willing) that i might set this up, so if i can make it better i'd love to hear it!", "sortedWord": "None", "Identifyer": null, "identifyer": 42181, "year": "2021"}, {"autor": "bseitz234", "date": "2021-05-11 12:16:30", "content": "[Showcase: Canon Speedlites (mixed)] DIY Photobooth", "link": "https://www.reddit.com/r/canon/comments/n9vnyl/showcase_canon_speedlites_mixed_diy_photobooth/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[showcase: canon speedlites (mixed)] -----> diy !!!  photobooth", "sortedWord": "None", "Identifyer": null, "identifyer": 42182, "year": "2021"}, {"autor": "Hane_Train", "date": "2021-10-11 03:37:24", "content": "Top handle with built-in start/stop recording button /!/ Just saw Kondor Blue has a top handle with a remote trigger for the R6/R5. Anyone know of other options out there of top handles with remote triggers built in for canon? Or a DIY option?", "link": "https://www.reddit.com/r/canon/comments/q5ncwf/top_handle_with_builtin_startstop_recording_button/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "top handle with built-in start/stop recording button /!/ just saw kondor blue has a top handle with a remote trigger for the r6/r5. anyone know of other options out there of top handles with remote triggers built in for canon? or a -----> diy !!!  option?", "sortedWord": "None", "Identifyer": null, "identifyer": 43469, "year": "2021"}, {"autor": "TonyPhucHoang", "date": "2021-01-14 00:59:26", "content": "DIY canon 80d : removed flash capacitor since I don’t have an onboard flash anymore. And removed shutter since I don’t take images only video.", "link": "https://www.reddit.com/r/canon/comments/kwumst/diy_canon_80d_removed_flash_capacitor_since_i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  canon 80d : removed flash capacitor since i don’t have an onboard flash anymore. and removed shutter since i don’t take images only video.", "sortedWord": "None", "Identifyer": null, "identifyer": 44044, "year": "2021"}, {"autor": "Kinabin777", "date": "2021-07-05 21:04:29", "content": "Canon Rumors: Canon R5c is coming... /!/ [Canon R5c](https://www.canonrumors.com/the-canon-eos-r5c-is-coming-in-q1-2022-cr3/)\n\n\"c\" is for \"Cooled\" I guess;o)\nTLDR; more or less the same body as R5, only this time actively cooled.\nWhen I suggested this should be done in the first place, various string theorists have claimed fundamental physical snafus  that would obviously prevent such solution.\n\nUntil we saw DIY-ers using simple copper sheets to lessen the problem.", "link": "https://www.reddit.com/r/canon/comments/oegbui/canon_rumors_canon_r5c_is_coming/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "canon rumors: canon r5c is coming... /!/ [canon r5c](https://www.canonrumors.com/the-canon-eos-r5c-is-coming-in-q1-2022-cr3/)\n\n\"c\" is for \"cooled\" i guess;o)\ntldr; more or less the same body as r5, only this time actively cooled.\nwhen i suggested this should be done in the first place, various string theorists have claimed fundamental physical snafus  that would obviously prevent such solution.\n\nuntil we saw -----> diy !!! -ers using simple copper sheets to lessen the problem.", "sortedWord": "None", "Identifyer": null, "identifyer": 44406, "year": "2021"}], "name": "diycanon2021"}