{"interestingcomments": [{"autor": "AristotelesRocks", "date": "2019-03-10 08:37:08", "content": "Using vintage lenses on my 80D - adapters? /!/ My dad gave me 6 of his analogue lenses, I don’t know how old they are exactly but some seem to be good to use. I’ve tried freelensing (so not attaching them to the body) with two on an old DSLR, and got some cool shots. However, I’m scared to do this with my 80D. I read online that there are adapters you can order online, but I got a bit confused by all the information and options.\n\nFirst off: is this safe? I don’t want to wreck my good DSLR. I read there are ones with chips and glass, but also just simple rings. I like focusing manually so the simpler the better I think?\n\nIf it’s safe, would anyone here mind helping me out with finding the right adapters? I saw some really cheap ones on eBay as I am on a budget. I’m located in Europe (EU). I will take a look at the lenses my dad gave me (I think they’re all primes) and write down the specifics. I find the whole mount type thing a bit confusing.\n\nAlso, I read somewhere that you need to know the distance from the vintage lens mount to the mirror of the body it was once used for and compare it to that distance of your current camera. According to an info graphic I found, that distance for the 80D is 18 mm.\n\nLastly, I saw some DIY online for creating a “mount” to be able to tilt shift the lens the way I did with my hands while freelensing. Has anyone here experience with that? I might just do it for my old DSLR.", "link": "https://www.reddit.com/r/canon/comments/azdt1b/using_vintage_lenses_on_my_80d_adapters/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "using vintage lenses on my 80d - adapters? /!/ my dad gave me 6 of his analogue lenses, i don’t know how old they are exactly but some seem to be good to use. i’ve tried freelensing (so not attaching them to the body) with two on an old dslr, and got some cool shots. however, i’m scared to do this with my 80d. i read online that there are adapters you can order online, but i got a bit confused by all the information and options.\n\nfirst off: is this safe? i don’t want to wreck my good dslr. i read there are ones with chips and glass, but also just simple rings. i like focusing manually so the simpler the better i think?\n\nif it’s safe, would anyone here mind helping me out with finding the right adapters? i saw some really cheap ones on ebay as i am on a budget. i’m located in europe (eu). i will take a look at the lenses my dad gave me (i think they’re all primes) and write down the specifics. i find the whole mount type thing a bit confusing.\n\nalso, i read somewhere that you need to know the distance from the vintage lens mount to the mirror of the body it was once used for and compare it to that distance of your current camera. according to an info graphic i found, that distance for the 80d is 18 mm.\n\nlastly, i saw some -----> diy !!!  online for creating a “mount” to be able to tilt shift the lens the way i did with my hands while freelensing. has anyone here experience with that? i might just do it for my old dslr.", "sortedWord": "None", "Identifyer": null, "identifyer": 55041, "year": "2019"}, {"autor": "lambroslazopoulos", "date": "2019-03-24 15:27:39", "content": "DIY drone signal booster for 1€", "link": "https://www.reddit.com/r/canon/comments/b4xjgw/diy_drone_signal_booster_for_1/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  drone signal booster for 1€", "sortedWord": "None", "Identifyer": null, "identifyer": 56127, "year": "2019"}, {"autor": "sabrina_marcante", "date": "2019-02-16 23:42:38", "content": "Advices for replicate old cameras effect, maybe with DIY filter?", "link": "https://www.reddit.com/r/canon/comments/arel0g/advices_for_replicate_old_cameras_effect_maybe/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "advices for replicate old cameras effect, maybe with -----> diy !!!  filter?", "sortedWord": "None", "Identifyer": null, "identifyer": 56246, "year": "2019"}], "name": "diycanon2019"}