{"interestingcomments": [{"autor": "massmemes", "date": "2018-02-26 07:37:06", "content": "Canon error 20 fix? /!/ Recently my rebel t5 recieved error 20 and upon inspection the shutter is actually stuck in the up position constantly exposing the sensor so since it's like that when I turn the camera on it recognizes it and instantly goes into the error screen. Are there any diy fixes as I can't afford to fix or replace it right now.", "link": "https://www.reddit.com/r/canon/comments/80bajc/canon_error_20_fix/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "canon error 20 fix? /!/ recently my rebel t5 recieved error 20 and upon inspection the shutter is actually stuck in the up position constantly exposing the sensor so since it's like that when i turn the camera on it recognizes it and instantly goes into the error screen. are there any -----> diy !!!  fixes as i can't afford to fix or replace it right now.", "sortedWord": "None", "Identifyer": null, "identifyer": 22928, "year": "2018"}, {"autor": "Jylyfysh", "date": "2018-11-02 22:31:09", "content": "Diy fix for mode dial? /!/ My 60D is having an issue with the mode dial. It will not stay at the proper mode when i turn it, it always switches to the mode right before it. It feels like the spring inside may not be pushing it enough? \n\nIve taken my camera apart before to fix the power switch before, but before i take it apart again, any suggestions? Possibility that i may have to replace the spring, or just tighten something? Where can i even buy that tiny little spring?\n\nIt's currently being held by tape because i need it for a shoot thats in 1 hour lol😅😅😭\n\nhttps://imgur.com/a/RvqBsKt", "link": "https://www.reddit.com/r/canon/comments/9tou6n/diy_fix_for_mode_dial/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  fix for mode dial? /!/ my 60d is having an issue with the mode dial. it will not stay at the proper mode when i turn it, it always switches to the mode right before it. it feels like the spring inside may not be pushing it enough? \n\nive taken my camera apart before to fix the power switch before, but before i take it apart again, any suggestions? possibility that i may have to replace the spring, or just tighten something? where can i even buy that tiny little spring?\n\nit's currently being held by tape because i need it for a shoot thats in 1 hour lol😅😅😭\n\nhttps://imgur.com/a/rvqbskt", "sortedWord": "None", "Identifyer": null, "identifyer": 24056, "year": "2018"}], "name": "diycanon2018"}