{"interestingcomments": [{"Unnamed: 0": 53632, "autor": "AD_Photo", "date": 1552353266000, "content": "Shotgun mics and loud focus motors /!/ Hi all - I've been shooting with a 77d and 24mm 2.8 recently. I am liking the combo for stills. I've been playing a bit with video content but fml the motor is so incredibly loud. Thinking about picking up a hotshoe mic but I've never experimented with one.\n\nWith the location of the mic placed and pointed in front of the camera will it still pick up the motor?", "link": "https://www.reddit.com/r/canon/comments/b01m32/shotgun_mics_and_loud_focus_motors/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shotgun mics and loud focus motors /!/ hi all - i've been shooting with a 77d and 24mm 2.8 recently. i am liking the combo for stills. i've been playing a bit with video content but fml the motor is so incredibly loud. thinking about picking up a hotshoe mic but i've never experimented with one.\n\nwith the -----> location !!!  of the mic placed and pointed in front of the camera will it still pick up the motor?", "sortedWord": "None", "identifyer": 55013, "year": "2019"}, {"Unnamed: 0": 54635, "autor": "PM_ME_HUSKY_PUPS", "date": 1551813487000, "content": "6D2 vs 5D4 as first (fullframe) dslr /!/  Hi all,\n\nI've been saving up quite a bit of cash and with tax returns coming I feel confident that I have a sufficient buffer to splurge on something I've been wanting for a long time: a good camera. Due to my geographical location and holiday preferences I will be shooting a lot in low-light situations (think just before dawn/after dusk but also Aurora photography). My main intent will also be on landscape photography with perhaps a side interst in portaits (and ofcourse my Akita Inu).\n\nI've also opted for going all out and going for a full-frame camera (mainly for the image quality, the bigger image in general and its advantages in low-light situations. Which left me hung-up on the EOS6D Mark 2 or the EOS 5D Mark 4 (or even 5d mark 3?)or of course the Nikon equivalent 6D2 or 5D4. I've been checking out some websites I found through google (mainly [mpb.com](https://mpb.com/) and [tweakers.net](https://tweakers.net/)) and I usually see second hand D850/5D4 go for around 2.000 pounds/2500 euros minimum and the D810 6D2for around 1000 pounds/1100 euros.\n\nNow I've also seen posts that say the improvements of the D850 over the D810 are minimal and others saying that the D850 is the best camera ever by a landslide.\n\nSo my question now is, when compared to each other, whats the advantages and disadvantages of each, how does the EOS6D Mark 2 hold up nowadays and whats your experience with either/both?\n\nThank you in advance!\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/canon/comments/axozhb/6d2_vs_5d4_as_first_fullframe_dslr/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "6d2 vs 5d4 as first (fullframe) dslr /!/  hi all,\n\ni've been saving up quite a bit of cash and with tax returns coming i feel confident that i have a sufficient buffer to splurge on something i've been wanting for a long time: a good camera. due to my geographical -----> location !!!  and holiday preferences i will be shooting a lot in low-light situations (think just before dawn/after dusk but also aurora photography). my main intent will also be on landscape photography with perhaps a side interst in portaits (and ofcourse my akita inu).\n\ni've also opted for going all out and going for a full-frame camera (mainly for the image quality, the bigger image in general and its advantages in low-light situations. which left me hung-up on the eos6d mark 2 or the eos 5d mark 4 (or even 5d mark 3?)or of course the nikon equivalent 6d2 or 5d4. i've been checking out some websites i found through google (mainly [mpb.com](https://mpb.com/) and [tweakers.net](https://tweakers.net/)) and i usually see second hand d850/5d4 go for around 2.000 pounds/2500 euros minimum and the d810 6d2for around 1000 pounds/1100 euros.\n\nnow i've also seen posts that say the improvements of the d850 over the d810 are minimal and others saying that the d850 is the best camera ever by a landslide.\n\nso my question now is, when compared to each other, whats the advantages and disadvantages of each, how does the eos6d mark 2 hold up nowadays and whats your experience with either/both?\n\nthank you in advance!\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 56023, "year": "2019"}, {"Unnamed: 0": 54708, "autor": "Ceiwyn89", "date": 1553672876000, "content": "Canon MB700 scan file location /!/ Hi there,\n\nI got a problem with the printer mentioned above. I don't know where the printer saves the files of scanned documents. Plus, I cannot download the driver since it's not supported on Win 10 so I cannot setup it myself. The scan is working, I just don't know where the files are. It's not in my documents nor my picture folder. I  cannot find it in a temp folder, too.\n\nAny ideas?", "link": "https://www.reddit.com/r/canon/comments/b61lig/canon_mb700_scan_file_location/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon mb700 scan file -----> location !!!  /!/ hi there,\n\ni got a problem with the printer mentioned above. i don't know where the printer saves the files of scanned documents. plus, i cannot download the driver since it's not supported on win 10 so i cannot setup it myself. the scan is working, i just don't know where the files are. it's not in my documents nor my picture folder. i  cannot find it in a temp folder, too.\n\nany ideas?", "sortedWord": "None", "identifyer": 56096, "year": "2019"}, {"Unnamed: 0": 54839, "autor": "minutial", "date": 1550459001000, "content": "How to use Camera Connect app to send GPS information to EOS R? /!/ I just got an EOS R and I’m a little confused as to how to add GPS information to photos on the EOS R.\n\nI understand I can use Bluetooth so that location information can be sent directly while the photos are being taken on the camera, but can I log the location on the app, and then send the location info to the camera later on via WiFi?\n\nWhen I tried to do that, I got an error message: “the function cannot be used on the currently connected camera.”\n\nI’m just wondering whether I’m doing something wrong, or whether the app doesn’t support sending location info to the EOS R? If so, that’s surprising to me.\n\nThanks a bunch!", "link": "https://www.reddit.com/r/canon/comments/arsgxe/how_to_use_camera_connect_app_to_send_gps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "how to use camera connect app to send gps information to eos r? /!/ i just got an eos r and i’m a little confused as to how to add gps information to photos on the eos r.\n\ni understand i can use bluetooth so that -----> location !!!  information can be sent directly while the photos are being taken on the camera, but can i log the -----> location !!!  on the app, and then send the -----> location !!!  info to the camera later on via wifi?\n\nwhen i tried to do that, i got an error message: “the function cannot be used on the currently connected camera.”\n\ni’m just wondering whether i’m doing something wrong, or whether the app doesn’t support sending -----> location !!!  info to the eos r? if so, that’s surprising to me.\n\nthanks a bunch!", "sortedWord": "None", "identifyer": 56227, "year": "2019"}, {"Unnamed: 0": 54874, "autor": "breadandbutter123456", "date": 1550314968000, "content": "Mirrorless lens adapter /!/ I’m currently trying to decide which canon dslr to get. I currently have an m10 mirrorless. This will go to my girlfriend. \n\nI’m debating whether to get another mirrorless (M50?) and get the adapter so that I can get better lenses. Or to get something along the lines of 77D. \n\nI currently have 3 m series lenses. \n1 x 22mm; 1 x 55-200mm; 1 x 15-45mm\nI have 3 x batteries\n1 x eos m10. \n\nI sell stock photos online mainly shutterstock. \nI travel frequently to (sometimes outrageous) locations. I will take videos but 90% of the time it’s photos I take and is more important. \n\nI don’t know whether to get another mirrorless because they are smaller, lighter and I already have some lenses. However the range of the M series of lenses is quite limited. Doesn’t seem to have any sigma lenses, 3rd party lenses, etc. \n\nThis is why I wanted to originally change cameras. I wanted a larger variety of lenses, and to upgrade my lenses. So do I get another m series camera body, and get an adapter. Will this  cause issues with the quality of my images? Increase noise, etc? \n\nWhat annoyed me about the m10 was when I was on safari, the largest zoom I could get for the m series was the 200mm one I already had. I couldn’t get a m series extender (1.4x or 2x). \n\n\nOr do I get a normal dslr? \n\nI have around £800 to spend currently, but must include the lenses I need (one zoom &amp; one smaller). I’ve seen a 77D for £500 for just the body. Hopefully in a years time I can buy better lenses. ", "link": "https://www.reddit.com/r/canon/comments/ar7uci/mirrorless_lens_adapter/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "mirrorless lens adapter /!/ i’m currently trying to decide which canon dslr to get. i currently have an m10 mirrorless. this will go to my girlfriend. \n\ni’m debating whether to get another mirrorless (m50?) and get the adapter so that i can get better lenses. or to get something along the lines of 77d. \n\ni currently have 3 m series lenses. \n1 x 22mm; 1 x 55-200mm; 1 x 15-45mm\ni have 3 x batteries\n1 x eos m10. \n\ni sell stock photos online mainly shutterstock. \ni travel frequently to (sometimes outrageous) -----> locations !!! . i will take videos but 90% of the time it’s photos i take and is more important. \n\ni don’t know whether to get another mirrorless because they are smaller, lighter and i already have some lenses. however the range of the m series of lenses is quite limited. doesn’t seem to have any sigma lenses, 3rd party lenses, etc. \n\nthis is why i wanted to originally change cameras. i wanted a larger variety of lenses, and to upgrade my lenses. so do i get another m series camera body, and get an adapter. will this  cause issues with the quality of my images? increase noise, etc? \n\nwhat annoyed me about the m10 was when i was on safari, the largest zoom i could get for the m series was the 200mm one i already had. i couldn’t get a m series extender (1.4x or 2x). \n\n\nor do i get a normal dslr? \n\ni have around £800 to spend currently, but must include the lenses i need (one zoom &amp; one smaller). i’ve seen a 77d for £500 for just the body. hopefully in a years time i can buy better lenses. ", "sortedWord": "None", "identifyer": 56262, "year": "2019"}, {"Unnamed: 0": 54939, "autor": "aaronwarnick", "date": 1554651256000, "content": "I used the Canon RP on a paid job; things went wrong /!/ Hi Team Canon! I'm a part-time photographer. Right now, I'm splitting my time between shooting and working at a camera shop! I picked up the RP a few weeks ago and I wanted to share some thoughts about using it professionally.\n\nAfter taking some time to get used to the camera, I picked a surprise/paparazzi engagement job. Simple work, but there's certainly a degree of pressure.\n\nI arrived early, scouted the location and was able to get my exposure set up. I wanted to deliver a nice, soft, bokehlicious shot, so I was shooting a very low f-stop. I picked the most likely single AF point to ensure that I hit the face/eye.\n\nHere's were things went wrong.\n\nAnyways, the couple arrives and the guy recognizes that I'm nearby and he drops to one knee. It could have been a miscommunication, or maybe he was justifiably anxious/excited ... but I had expected them to walk to me at a different location. I'm about 25 yards away from the couple. I had to sprint to get the shot. Because the location changed, my settings were off by about half of a stop. I recognized this immediately in the EVF and quickly corrected. Touch and drag AF allowed me to fix my focus point with a flick of my thumb. I got the shot.\n\nSo yeah, I clickbaited you a bit with the title. The RP was fine.\n\nI thought I missed the joystick, but after that shoot, I'm convinced that Canon's Touch and Drag AF is a worthy replacement. A joystick would have been too slow in this circumstance. And while there is a similar feature on Sony, I found it operates more as an anti-feature where your nose moves your AF point. Honestly, I'd like to see Canon ditch the sensor bar on the R and experiment with a small touch pad for quickly adjusting focus.\n\nAlso, it's entirely possibly that I would have recognized my exposure was off while using an SLR. However, I was running and gunning. And the couple was out in the open against a bright, overcast sky. It would have been very, very easy to over or underexpose the shot. However, with the EVF, I was able to accurately correct my exposure in real time.\n\nBurst shooting is slow. This is known. I'm very happy with the photos I got, especially under the circumstances, but I do wish I had more options for what I delivered. On the other hand, in most applications, I found that having high FPS is a double edged sword. With high FPS burst, there are more shots to choose from and a higher likelihood that you'll capture *the* moment. In my experience, I find that I spend a lot of time trying to pick between three nearly identical images and it slows down my workflow. On high FPS cameras, I almost always turn down the burst rate. To be clear, I'm not counting this a point for the RP. I'd always prefer being able to lower settings when I don't need them. \n\nAdmittedly, a single card slot made me nervous. However, even when I've had cameras with two slots, I shoot RAW+JPEG as an emergency backup.  So, for me, this was the first test of Canon's Instant Transfer feature. It performed well, files zipped over to my phone, however, it definitely did not give me the same piece of mind that a second SD card would. Maybe as I use it more, I'll trust it more.\n\nThat all said, I definitely will not be skiddish about using the RP professionally. I'm going to be stocking up on batteries and I may start taking a tablet to transfer jpegs to instead of my phone. I'll probably buy the pro-level Canon mirrorless when it's available, but the RP will carry me through the next year or so. And the $1000 I saved on it over the R is going to be spent on a 2.8 zoom later the year.\n\nI wanted to make this post because there seems to be a lot of interest in this camera in this sub. According to the wider internet, the RP is seemingly hardly better than a Rebel (side note: I had a T2i when people started paying me for photos). I've seen the RP referred to as \"trash\" and that it would never be used by \"serious photographers.\" Being disappointed at the lack of video features or battery life is one thing, but the hate is hyperbolic. I think the naysaying is probably enough to scare away some people from trying one out.\n\nIt's entirely possible that I may feel differently in the future as I do more and find limitations of the camera, but for now, I'm satisfied. If you're thinking about getting the RP, go to a camera store and get your hands on it.\n\nTL;DR: the RP is okay and there is at least one photographer out there willing to use it in a professional setting.", "link": "https://www.reddit.com/r/canon/comments/bahfy8/i_used_the_canon_rp_on_a_paid_job_things_went/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i used the canon rp on a paid job; things went wrong /!/ hi team canon! i'm a part-time photographer. right now, i'm splitting my time between shooting and working at a camera shop! i picked up the rp a few weeks ago and i wanted to share some thoughts about using it professionally.\n\nafter taking some time to get used to the camera, i picked a surprise/paparazzi engagement job. simple work, but there's certainly a degree of pressure.\n\ni arrived early, scouted the -----> location !!!  and was able to get my exposure set up. i wanted to deliver a nice, soft, bokehlicious shot, so i was shooting a very low f-stop. i picked the most likely single af point to ensure that i hit the face/eye.\n\nhere's were things went wrong.\n\nanyways, the couple arrives and the guy recognizes that i'm nearby and he drops to one knee. it could have been a miscommunication, or maybe he was justifiably anxious/excited ... but i had expected them to walk to me at a different location. i'm about 25 yards away from the couple. i had to sprint to get the shot. because the location changed, my settings were off by about half of a stop. i recognized this immediately in the evf and quickly corrected. touch and drag af allowed me to fix my focus point with a flick of my thumb. i got the shot.\n\nso yeah, i clickbaited you a bit with the title. the rp was fine.\n\ni thought i missed the joystick, but after that shoot, i'm convinced that canon's touch and drag af is a worthy replacement. a joystick would have been too slow in this circumstance. and while there is a similar feature on sony, i found it operates more as an anti-feature where your nose moves your af point. honestly, i'd like to see canon ditch the sensor bar on the r and experiment with a small touch pad for quickly adjusting focus.\n\nalso, it's entirely possibly that i would have recognized my exposure was off while using an slr. however, i was running and gunning. and the couple was out in the open against a bright, overcast sky. it would have been very, very easy to over or underexpose the shot. however, with the evf, i was able to accurately correct my exposure in real time.\n\nburst shooting is slow. this is known. i'm very happy with the photos i got, especially under the circumstances, but i do wish i had more options for what i delivered. on the other hand, in most applications, i found that having high fps is a double edged sword. with high fps burst, there are more shots to choose from and a higher likelihood that you'll capture *the* moment. in my experience, i find that i spend a lot of time trying to pick between three nearly identical images and it slows down my workflow. on high fps cameras, i almost always turn down the burst rate. to be clear, i'm not counting this a point for the rp. i'd always prefer being able to lower settings when i don't need them. \n\nadmittedly, a single card slot made me nervous. however, even when i've had cameras with two slots, i shoot raw+jpeg as an emergency backup.  so, for me, this was the first test of canon's instant transfer feature. it performed well, files zipped over to my phone, however, it definitely did not give me the same piece of mind that a second sd card would. maybe as i use it more, i'll trust it more.\n\nthat all said, i definitely will not be skiddish about using the rp professionally. i'm going to be stocking up on batteries and i may start taking a tablet to transfer jpegs to instead of my phone. i'll probably buy the pro-level canon mirrorless when it's available, but the rp will carry me through the next year or so. and the $1000 i saved on it over the r is going to be spent on a 2.8 zoom later the year.\n\ni wanted to make this post because there seems to be a lot of interest in this camera in this sub. according to the wider internet, the rp is seemingly hardly better than a rebel (side note: i had a t2i when people started paying me for photos). i've seen the rp referred to as \"trash\" and that it would never be used by \"serious photographers.\" being disappointed at the lack of video features or battery life is one thing, but the hate is hyperbolic. i think the naysaying is probably enough to scare away some people from trying one out.\n\nit's entirely possible that i may feel differently in the future as i do more and find limitations of the camera, but for now, i'm satisfied. if you're thinking about getting the rp, go to a camera store and get your hands on it.\n\ntl;dr: the rp is okay and there is at least one photographer out there willing to use it in a professional setting.", "sortedWord": "None", "identifyer": 56327, "year": "2019"}, {"Unnamed: 0": 56322, "autor": "calypsonoximera", "date": 1576501302000, "content": "The old legend - Canon 50D + 50mm f/1.4 USM lens. Location: Sofia, Bulgaria.", "link": "https://www.reddit.com/r/canon/comments/ebeuvi/the_old_legend_canon_50d_50mm_f14_usm_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the old legend - canon 50d + 50mm f/1.4 usm lens. -----> location !!! : sofia, bulgaria.", "sortedWord": "None", "identifyer": 57723, "year": "2019"}, {"Unnamed: 0": 56802, "autor": "HuntTheGod", "date": 1549873373000, "content": "Lost/left my nice dslr camera (77d) inside a canon bag at the garden of eden parking lot in Santa Cruz, location below. This happened today at 3pm it was a gift for graduation and means a lot to me 50$ reward.", "link": "https://www.reddit.com/r/canon/comments/ape6z0/lostleft_my_nice_dslr_camera_77d_inside_a_canon/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "lost/left my nice dslr camera (77d) inside a canon bag at the garden of eden parking lot in santa cruz, -----> location !!!  below. this happened today at 3pm it was a gift for graduation and means a lot to me 50$ reward.", "sortedWord": "None", "identifyer": 58208, "year": "2019"}, {"Unnamed: 0": 56913, "autor": "Evasionz--", "date": 1546654829000, "content": "Question concerning Canon gift /!/ Hey everyone,\n\n&amp;#x200B;\n\nI am absolutely new to REAL photography. I've always admired it and wanted to get into photography but have never bought a camera myself.\n\n&amp;#x200B;\n\nThis Christmas my grandmother bought me a Canon Rebel T6 and it is great. After exploring it for a couple days and going all over the internet to get into the ways of photographing things I love it, but there are quite a few things that I would enjoy having, like the ability to use an IR blaster for a remote controlled shot for long exposures, and a couple overall things that are just better on the T6i. \n\n&amp;#x200B;\n\nIs there a location that I could get a good price for the Rebel T6 or a place where I can upgrade without having to really purchase a $700 camera? I am willing to pay for an upgrade because I totally think that paying a little more for a lot is really good.\n\n&amp;#x200B;\n\nI am completely grateful for the gift I got, it's just that I would like to really get into it.", "link": "https://www.reddit.com/r/canon/comments/acpno6/question_concerning_canon_gift/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "question concerning canon gift /!/ hey everyone,\n\n&amp;#x200b;\n\ni am absolutely new to real photography. i've always admired it and wanted to get into photography but have never bought a camera myself.\n\n&amp;#x200b;\n\nthis christmas my grandmother bought me a canon rebel t6 and it is great. after exploring it for a couple days and going all over the internet to get into the ways of photographing things i love it, but there are quite a few things that i would enjoy having, like the ability to use an ir blaster for a remote controlled shot for long exposures, and a couple overall things that are just better on the t6i. \n\n&amp;#x200b;\n\nis there a -----> location !!!  that i could get a good price for the rebel t6 or a place where i can upgrade without having to really purchase a $700 camera? i am willing to pay for an upgrade because i totally think that paying a little more for a lot is really good.\n\n&amp;#x200b;\n\ni am completely grateful for the gift i got, it's just that i would like to really get into it.", "sortedWord": "None", "identifyer": 58321, "year": "2019"}, {"Unnamed: 0": 57054, "autor": "claropires", "date": 1555958296000, "content": "G9X Mark ii remote control app for video? /!/ I have an G5X currently and I am thinking of moving to M50 + G9X mark ii.\n\nG5X is great, but I end up not carring it around like I wish. So I am thinking of moving to G9X based on this.\n\n&amp;#x200B;\n\nI wonder if I can control everything on the app due the lack of flip screen.\n\nCan I remote control video on the app?\n\nDoes it live transfer gps location trough bluetooth to the recently taken images?", "link": "https://www.reddit.com/r/canon/comments/bg5nh6/g9x_mark_ii_remote_control_app_for_video/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "g9x mark ii remote control app for video? /!/ i have an g5x currently and i am thinking of moving to m50 + g9x mark ii.\n\ng5x is great, but i end up not carring it around like i wish. so i am thinking of moving to g9x based on this.\n\n&amp;#x200b;\n\ni wonder if i can control everything on the app due the lack of flip screen.\n\ncan i remote control video on the app?\n\ndoes it live transfer gps -----> location !!!  trough bluetooth to the recently taken images?", "sortedWord": "None", "identifyer": 58464, "year": "2019"}, {"Unnamed: 0": 57126, "autor": "aceOfMinds", "date": 1557360011000, "content": "What is the backup (coin?) battery for the Canon PowerShot A630? /!/ Haven't received the A630 in the mail yet; I fiddled around with the A530 so far and unlike the A530 or A550 the A630's backup battery (if it has one) isn't in an obvious location.", "link": "https://www.reddit.com/r/canon/comments/bmctoj/what_is_the_backup_coin_battery_for_the_canon/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "what is the backup (coin?) battery for the canon powershot a630? /!/ haven't received the a630 in the mail yet; i fiddled around with the a530 so far and unlike the a530 or a550 the a630's backup battery (if it has one) isn't in an obvious -----> location !!! .", "sortedWord": "None", "identifyer": 58536, "year": "2019"}], "name": "locationcanon2019"}