{"interestingcomments": [{"Unnamed: 0": 131291, "autor": "5hoursofsleep", "date": 1524086663000, "content": "Portrait Lens Recommendations /!/ So I am looking to get into portraits, headshots, beauty shots, etc. I mainly shoot whatever I like so my lens kit is small. I shoot on a 80D (so crop), have the kit 18-55, 50mm 1.8, 100mm 2.8L Macro, ans a 10-18mm wide-angle. \n\nI want to setup a tiny studio and or possibly shoot on location. I am still very much an amateur in portraits but have a good grasp of fundamentals ...I think at least. I am now looking for non crop lenses (so EF only) that others would recommend as an investment in portrait lenses that will be fine on my crop until I move to Fullframe. I've heard the 85mm 1.2L is great but the crop factor makes me feel like it's a better lens for when I move to full frame. \n\nI don't know I would love to hear suggestions and rationale from you guys if you could help. Thanks :)", "link": "https://www.reddit.com/r/canon/comments/8d9bdl/portrait_lens_recommendations/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "portrait lens recommendations /!/ so i am looking to get into portraits, headshots, beauty shots, etc. i mainly shoot whatever i like so my lens kit is small. i shoot on a 80d (so crop), have the kit 18-55, 50mm 1.8, 100mm 2.8l macro, ans a 10-18mm wide-angle. \n\ni want to setup a tiny studio and or possibly shoot on -----> location !!! . i am still very much an amateur in portraits but have a good grasp of fundamentals ...i think at least. i am now looking for non crop lenses (so ef only) that others would recommend as an investment in portrait lenses that will be fine on my crop until i move to fullframe. i've heard the 85mm 1.2l is great but the crop factor makes me feel like it's a better lens for when i move to full frame. \n\ni don't know i would love to hear suggestions and rationale from you guys if you could help. thanks :)", "sortedWord": "None", "identifyer": 22008, "year": "2018"}, {"Unnamed: 0": 131725, "autor": "horizonx", "date": 1536263156000, "content": "Advice for lens choices /!/ Currently I have the 24-105 mark i and 16-35 f4. I probably use the 24-105 most of time say 80%. I was thinking of selling both these lenses and get 24-70 f2.8 mark ii. I like to go to location with one lens and not use the other because of the hassle of changing lens and just being in the moment. I would love to get 24-70 and and keep 16-35 but seeing prices it will be difficult. Just need advice and maybe if someone has experience with something like this would be great. \n\nReason for disliking the 24-105 is sharpness and the boring (to me now) f4 aperture. I know 2.8 is not a big jump but still helps as I like isolating subjects. I mainly shoot landscapes and cityscapes. \n\nThanks in advance. ", "link": "https://www.reddit.com/r/canon/comments/9dmabp/advice_for_lens_choices/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "advice for lens choices /!/ currently i have the 24-105 mark i and 16-35 f4. i probably use the 24-105 most of time say 80%. i was thinking of selling both these lenses and get 24-70 f2.8 mark ii. i like to go to -----> location !!!  with one lens and not use the other because of the hassle of changing lens and just being in the moment. i would love to get 24-70 and and keep 16-35 but seeing prices it will be difficult. just need advice and maybe if someone has experience with something like this would be great. \n\nreason for disliking the 24-105 is sharpness and the boring (to me now) f4 aperture. i know 2.8 is not a big jump but still helps as i like isolating subjects. i mainly shoot landscapes and cityscapes. \n\nthanks in advance. ", "sortedWord": "None", "identifyer": 22442, "year": "2018"}, {"Unnamed: 0": 131979, "autor": "Ryanite_", "date": 1542936620000, "content": "The next canon mirrorless /!/ While the latest of the budget EOS mirrorless cameras the m50 is great a big sore point for me is it's form and simplistic controls. A single wheel isn't great if you wish to shoot without the lcd, the camera is generally quite a small fit in the hand which is great for some uses and not so good for others and with the small size comes a small battery and an odd placement for an sd card.\n\nI'd love to see the next budget mirrorless camera in an EOS R style body, obviously replace all the more high end expensive parts with those of the current m50 but the quality of life improvements to the EOS R body are huge, multiple wheels, dials and buttons, a top low power lcd, an SD card slot in a easily accessible location, weather sealing, large grip, large and very common LP-E6N battery, a battery door that isn't obstructed by larger tripod plates. \n\nThe limitations of the m50 aren't so bad considering it's price point and I hope a camera like this could become the next flagship in the budget mirrorless line at around the 1k price point to make up for the extra cost of a weather sealed/ larger body like the EOS R. ", "link": "https://www.reddit.com/r/canon/comments/9zjvts/the_next_canon_mirrorless/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the next canon mirrorless /!/ while the latest of the budget eos mirrorless cameras the m50 is great a big sore point for me is it's form and simplistic controls. a single wheel isn't great if you wish to shoot without the lcd, the camera is generally quite a small fit in the hand which is great for some uses and not so good for others and with the small size comes a small battery and an odd placement for an sd card.\n\ni'd love to see the next budget mirrorless camera in an eos r style body, obviously replace all the more high end expensive parts with those of the current m50 but the quality of life improvements to the eos r body are huge, multiple wheels, dials and buttons, a top low power lcd, an sd card slot in a easily accessible -----> location !!! , weather sealing, large grip, large and very common lp-e6n battery, a battery door that isn't obstructed by larger tripod plates. \n\nthe limitations of the m50 aren't so bad considering it's price point and i hope a camera like this could become the next flagship in the budget mirrorless line at around the 1k price point to make up for the extra cost of a weather sealed/ larger body like the eos r. ", "sortedWord": "None", "identifyer": 22700, "year": "2018"}, {"Unnamed: 0": 132159, "autor": "FriendlyLurker-", "date": 1515340746000, "content": "Canon T3 in 2017? /!/ Hey guys, I am sorry if this post is breaching any subreddit guidelines but I'm at work and am about to make a somewhat haste decision in the next hour or so, and wanted some feedback if possible.\n\nbasically, I've been interested in photography for a long time but have never owned a SLR camera. I'm a gamer by hobby, so I have an old Xbox one sitting around I never use (could sell or buy one for about $180 CAD right now) and somebody posted an ad locally with a T3, the 18mm-55mm lens, a really nice sturdy carrying case, an extra battery pack and he is throwing in a 32gb SD card for storage as well.\n\nWhat I am wondering, is this camera worth getting to take alright pictures with? I know it's 5-6 years old or so, so there are better more expensive options, but if I'm able to get this camera and setup for essentially a $180 value (the xbox has no value to me honestly anymore) will I be able to learn the ropes of photography an enjoy myself? I just want something to get me out of the house with a couple friends, exploring forest locations and city locations to try and capture some good shots.\n\nFrom what I've seen, there is no mic jack, doesn't shoot 1080p video (but does it shoot 1080p pictures?) is questionable in low light scenarios and will require possibly some better lenses down the road to get REALLY clear pictures.\n\nThank you for the help in advance. :)", "link": "https://www.reddit.com/r/canon/comments/7orb9d/canon_t3_in_2017/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon t3 in 2017? /!/ hey guys, i am sorry if this post is breaching any subreddit guidelines but i'm at work and am about to make a somewhat haste decision in the next hour or so, and wanted some feedback if possible.\n\nbasically, i've been interested in photography for a long time but have never owned a slr camera. i'm a gamer by hobby, so i have an old xbox one sitting around i never use (could sell or buy one for about $180 cad right now) and somebody posted an ad locally with a t3, the 18mm-55mm lens, a really nice sturdy carrying case, an extra battery pack and he is throwing in a 32gb sd card for storage as well.\n\nwhat i am wondering, is this camera worth getting to take alright pictures with? i know it's 5-6 years old or so, so there are better more expensive options, but if i'm able to get this camera and setup for essentially a $180 value (the xbox has no value to me honestly anymore) will i be able to learn the ropes of photography an enjoy myself? i just want something to get me out of the house with a couple friends, exploring forest -----> locations !!!  and city -----> locations !!!  to try and capture some good shots.\n\nfrom what i've seen, there is no mic jack, doesn't shoot 1080p video (but does it shoot 1080p pictures?) is questionable in low light scenarios and will require possibly some better lenses down the road to get really clear pictures.\n\nthank you for the help in advance. :)", "sortedWord": "None", "identifyer": 22881, "year": "2018"}, {"Unnamed: 0": 132439, "autor": "cgoppy", "date": 1525441865000, "content": "Worst Experience with Canon Online Store /!/ I had the worst experience. I purchased the 10-18mm EFS refurbished lens. Since I knew I would not be home, I called Canon to request the item to be held at a UPS location. When I got to UPS it turned out Canon did not put a correct shipping release authorization. So I had to get Canon back on the line and wait a couple of hours at UPS to have the item reprocessed.\n\nWhen I finally received the product, it did not work or fit on my full frame. I called up Canon AGAIN. The customer rep placed me on hold for about 20 Minutes. When she returned on he line, she agreed to accept the return. However, she told me I had to pay for my own return. This was despite the fact the item they sold me wasn’t defective and did not work with my camera.\n\nI then asked to speak a supervisor. A person named “Charice” then came on the line. Charice told me Canon does not provide prepaid return labels. This is a blatant lie. I previously purchased items from this same store and they all provided prepaid return labels.\n\nWhen I brought up this fact to Charice, she told me she had to consult with her Supervisor. She put me on hold for approximately 30 seconds. Then Charice told me her Supervisor told her there was nothing they could do. I then asked to speak to Charice’s Supervisor. She told me her Supervisor was currently unavailable. \n\nEvidently, Canon’s staff has no qualms about lying to their customers. I will not purchase from Canon again in the future.", "link": "https://www.reddit.com/r/canon/comments/8gzdzl/worst_experience_with_canon_online_store/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "worst experience with canon online store /!/ i had the worst experience. i purchased the 10-18mm efs refurbished lens. since i knew i would not be home, i called canon to request the item to be held at a ups -----> location !!! . when i got to ups it turned out canon did not put a correct shipping release authorization. so i had to get canon back on the line and wait a couple of hours at ups to have the item reprocessed.\n\nwhen i finally received the product, it did not work or fit on my full frame. i called up canon again. the customer rep placed me on hold for about 20 minutes. when she returned on he line, she agreed to accept the return. however, she told me i had to pay for my own return. this was despite the fact the item they sold me wasn’t defective and did not work with my camera.\n\ni then asked to speak a supervisor. a person named “charice” then came on the line. charice told me canon does not provide prepaid return labels. this is a blatant lie. i previously purchased items from this same store and they all provided prepaid return labels.\n\nwhen i brought up this fact to charice, she told me she had to consult with her supervisor. she put me on hold for approximately 30 seconds. then charice told me her supervisor told her there was nothing they could do. i then asked to speak to charice’s supervisor. she told me her supervisor was currently unavailable. \n\nevidently, canon’s staff has no qualms about lying to their customers. i will not purchase from canon again in the future.", "sortedWord": "None", "identifyer": 23162, "year": "2018"}, {"Unnamed: 0": 133043, "autor": "CyberDOLT", "date": 1543394104000, "content": "Canon EOS 77D? /!/ 4-5 months ago I bought a Canon T6 Rebel, a week later a certain someone said that my camera was shit and I should upgrade. So I searched and searched. I found Canon EOS 77D and read reviews on it, for me who dont understand shit, it sounds good. Then again , you never know. .. \n\nSo I am here to ask if Canon EOS 77D is a good camera that can take really sharp pictures with a nice depth of field. \n\nAlso, is it good in low-light locations?", "link": "https://www.reddit.com/r/canon/comments/a14erm/canon_eos_77d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "canon eos 77d? /!/ 4-5 months ago i bought a canon t6 rebel, a week later a certain someone said that my camera was shit and i should upgrade. so i searched and searched. i found canon eos 77d and read reviews on it, for me who dont understand shit, it sounds good. then again , you never know. .. \n\nso i am here to ask if canon eos 77d is a good camera that can take really sharp pictures with a nice depth of field. \n\nalso, is it good in low-light -----> locations !!! ?", "sortedWord": "None", "identifyer": 23771, "year": "2018"}, {"Unnamed: 0": 133125, "autor": "DarkLordMV", "date": 1544749461000, "content": "Battery Left Charging For 2 Months Straight...Still Safe To Use? /!/ Like the title says, an LP-e6n battery I thought was lost was actually left charging in a wall at a location for almost 2 months to the date.  This was one of the amazon brand ones (it always did a good job though), in the default canon charger.  When I found it, the light was still green, but I wanted to get some opinions on if its all still safe to use.  May seem like a silly question, but I don't want it leaking in my camera or something.  Thanks!", "link": "https://www.reddit.com/r/canon/comments/a5zu53/battery_left_charging_for_2_months_straightstill/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "battery left charging for 2 months straight...still safe to use? /!/ like the title says, an lp-e6n battery i thought was lost was actually left charging in a wall at a -----> location !!!  for almost 2 months to the date.  this was one of the amazon brand ones (it always did a good job though), in the default canon charger.  when i found it, the light was still green, but i wanted to get some opinions on if its all still safe to use.  may seem like a silly question, but i don't want it leaking in my camera or something.  thanks!", "sortedWord": "None", "identifyer": 23854, "year": "2018"}, {"Unnamed: 0": 133649, "autor": "bombsolomon", "date": 1527636220000, "content": "Improving video technique (auditorium/stage show, fixed location) /!/ Hi all, I asked for help a few weeks ago regarding battery life for a t5i in terms of video shooting. I learned that the t5i will hit the 4GB file size limit in about 12m05s but compensates for this by starting a new video right away, which was great. I also learned that, for a show that went extremely long, four batteries and three 32GB SD cards was cutting it close. I’ll be better prepared on that end next time.\n\nNow having the resulting videos, I wanted to ask for tips on how I could improve (samples at the bottom).\n\nHere were the circumstances and my approach:\n\nI was sitting in an lecture auditorium that some student groups now use for stage plays and productions like the one I was asked to film. The students rented a t5i with a 18-135mm lens. Originally I tried standing at the back of the auditorium and filming from there, but everything looked sort of blobby, so I instead took a seat around 10-15 rows up from the front and used a tripod. Thankfully, nobody tall wanted to sit in front of me and the people sitting behind me also didn’t mind. My technique was to allow the autofocus to set the focus of the camera at first, and then flip the camera into manual so that nothing would change throughout the recording (which has happened to me in a different venue but I couldn’t quite figure out how to fix it on the fly, so I ended up getting a really blurry last minute or so of a performance.)\n\nThe play/musical had three different general lighting patterns. The first was all lights on stage up. The second was lights dim with spotlights. The third was stage lights out with spotlights. I wasn’t entirely sure how to try to adjust for this on the fly because I hadn’t seen the show before and didn’t know when the lights transitions would be, so instead I hedged my bets and went for the previously mentioned AF method at the beginning of each act and left it as is. The result is that the scenes with the most light look great, while especially in the scenes with just spotlights, the people on stage look really blown out.\n\nI used the onboard mic for all of the audio recording and this ended up being sort of okay. Some of the dialogue and rapping is a bit muddled, but there was little I could do about it. There are mics that the students could have rented, but I didn’t know how to make a recommendation for this not having ever used a mic with a DSLR before.\n\nMy questions are as follows:\n*For people who have shot video in these situations before, is there anything I should have been paying attention to or settings I should have been using / practicing more with to figure out how to improve the recordings, in terms of visual quality?\n*In the same situation, how much will a separate mic make a difference_x0010_? In an ideal world I think I’d set up a mic on stage and then sync it to the video, but that’s a bit more effort than I think I could expend on this project (also these students contacted me just ten days before the show to ask if I could do this.)\n*There are a handful of other lenses available through their student tech rental program. One of them is a macro so I know it wouldn’t matter here, but the other was a 70-200mm. It wasn’t available this time, but I’m thinking that one might have been useful if I had set up in the back of the auditorium. I think the tradeoff there would be that recording sound would have been even more difficult. Any takes on that approach?\n\nSample videos are below, reflecting each of the three main lighting situations. Any tips on how I can improve or things I should practice would be greatly appreciated. \n\n*Lights up: https://www.youtube.com/watch?v=lL3ke1QqJp0\n*Lights half down (with spotlight): https://www.youtube.com/watch?v=cyqwRfxuzg4\n*Lights down (with color spotlight): https://www.youtube.com/watch?v=cCoLjM9xP8o&amp;t=4m16s\n*Lights down (with neutral spotlight): https://www.youtube.com/watch?v=g-dflcQzx_M&amp;t=2m43s (this is also not helped by one of the actresses wearing an all white dress)", "link": "https://www.reddit.com/r/canon/comments/8n3qrq/improving_video_technique_auditoriumstage_show/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "improving video technique (auditorium/stage show, fixed -----> location !!! ) /!/ hi all, i asked for help a few weeks ago regarding battery life for a t5i in terms of video shooting. i learned that the t5i will hit the 4gb file size limit in about 12m05s but compensates for this by starting a new video right away, which was great. i also learned that, for a show that went extremely long, four batteries and three 32gb sd cards was cutting it close. i’ll be better prepared on that end next time.\n\nnow having the resulting videos, i wanted to ask for tips on how i could improve (samples at the bottom).\n\nhere were the circumstances and my approach:\n\ni was sitting in an lecture auditorium that some student groups now use for stage plays and productions like the one i was asked to film. the students rented a t5i with a 18-135mm lens. originally i tried standing at the back of the auditorium and filming from there, but everything looked sort of blobby, so i instead took a seat around 10-15 rows up from the front and used a tripod. thankfully, nobody tall wanted to sit in front of me and the people sitting behind me also didn’t mind. my technique was to allow the autofocus to set the focus of the camera at first, and then flip the camera into manual so that nothing would change throughout the recording (which has happened to me in a different venue but i couldn’t quite figure out how to fix it on the fly, so i ended up getting a really blurry last minute or so of a performance.)\n\nthe play/musical had three different general lighting patterns. the first was all lights on stage up. the second was lights dim with spotlights. the third was stage lights out with spotlights. i wasn’t entirely sure how to try to adjust for this on the fly because i hadn’t seen the show before and didn’t know when the lights transitions would be, so instead i hedged my bets and went for the previously mentioned af method at the beginning of each act and left it as is. the result is that the scenes with the most light look great, while especially in the scenes with just spotlights, the people on stage look really blown out.\n\ni used the onboard mic for all of the audio recording and this ended up being sort of okay. some of the dialogue and rapping is a bit muddled, but there was little i could do about it. there are mics that the students could have rented, but i didn’t know how to make a recommendation for this not having ever used a mic with a dslr before.\n\nmy questions are as follows:\n*for people who have shot video in these situations before, is there anything i should have been paying attention to or settings i should have been using / practicing more with to figure out how to improve the recordings, in terms of visual quality?\n*in the same situation, how much will a separate mic make a difference_x0010_? in an ideal world i think i’d set up a mic on stage and then sync it to the video, but that’s a bit more effort than i think i could expend on this project (also these students contacted me just ten days before the show to ask if i could do this.)\n*there are a handful of other lenses available through their student tech rental program. one of them is a macro so i know it wouldn’t matter here, but the other was a 70-200mm. it wasn’t available this time, but i’m thinking that one might have been useful if i had set up in the back of the auditorium. i think the tradeoff there would be that recording sound would have been even more difficult. any takes on that approach?\n\nsample videos are below, reflecting each of the three main lighting situations. any tips on how i can improve or things i should practice would be greatly appreciated. \n\n*lights up: https://www.youtube.com/watch?v=ll3ke1qqjp0\n*lights half down (with spotlight): https://www.youtube.com/watch?v=cyqwrfxuzg4\n*lights down (with color spotlight): https://www.youtube.com/watch?v=ccoljm9xp8o&amp;t=4m16s\n*lights down (with neutral spotlight): https://www.youtube.com/watch?v=g-dflcqzx_m&amp;t=2m43s (this is also not helped by one of the actresses wearing an all white dress)", "sortedWord": "None", "identifyer": 24378, "year": "2018"}], "name": "locationcanon2018"}