{"interestingcomments": [{"Unnamed: 0": 57330, "autor": "Seitenwerk", "date": 1560338528000, "content": "Speedlight Canon 470ex AI with Canon EOS RP /!/ Hi, as I recently purchased a EOS RP and a 470ex AI speedlight, I wondered if there is a way to acitvated its automated features via the camera instead of the speedlight button.\n\n&amp;#x200B;\n\nThe manual stated recent cameras (I think it was since 2017) can toggle this feature via the depth of field preview button. Now I now some cameras dont support this, but the EOS RP is listed as fully supported on the official homepage. I cusomized the depth of field preview feature to one of the buttons as i use it quiet often. It works as expected but it wont start the automated speedlight adjustment if I try to use it with the 470ex ai attached.\n\n&amp;#x200B;\n\nNow I wonder if the RP doesnt support it or if there is some trick to it. Maybe it only works if its mapped to specific buttons on the RP?", "link": "https://www.reddit.com/r/canon/comments/bzpz7e/speedlight_canon_470ex_ai_with_canon_eos_rp/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "speedlight canon 470ex ai with canon eos rp /!/ hi, as i recently purchased a eos rp and a 470ex ai speedlight, i wondered if there is a way to acitvated its automated features via the camera instead of the speedlight button.\n\n&amp;#x200b;\n\nthe manual stated recent cameras (i think it was since 2017) can toggle this feature via the depth of field preview button. now i now some cameras dont support this, but the eos rp is listed as fully supported on the official homepage. i cusomized the depth of field preview feature to one of the buttons as i use it quiet often. it works as expected but it wont start the automated speedlight adjustment if i try to use it with the 470ex ai attached.\n\n&amp;#x200b;\n\nnow i wonder if the rp doesnt support it or if there is some trick to it. maybe it only works if its -----> mapped !!!  to specific buttons on the rp?", "sortedWord": "None", "identifyer": 58742, "year": "2019"}, {"Unnamed: 0": 57666, "autor": "CCC_Smokey", "date": 1572538836000, "content": "6D MKII - GPS data from Photos to Google Maps /!/ [removed]", "link": "https://www.reddit.com/r/canon/comments/dppvfu/6d_mkii_gps_data_from_photos_to_google_maps/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "6d mkii - gps data from photos to -----> google !!!  -----> maps !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 59081, "year": "2019"}], "name": "mapcanon2019"}