{"interestingcomments": [{"Unnamed: 0": 300185, "autor": "fktruong", "date": 1597784390000, "content": "Canon EOS R C-Log exposure /!/ I’ve been having a difficult time figuring out how to change the exposure compensation when recording video in C-Log. I shoot in M mode, 23.98 FPS, f2.8 and ISO 400. So far the only way I’ve been able to figure out how to change the exposure is by raising or dropping the ISO. I’ve tried mapping the AF-ON button to change exposure but that doesn’t seem to work... any tips or tricks would really be greatly appreciated. Thank you!!", "link": "https://www.reddit.com/r/canon/comments/ic9mnm/canon_eos_r_clog_exposure/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "mapping", "selectorShort": "map", "MarkedSent": "canon eos r c-log exposure /!/ i’ve been having a difficult time figuring out how to change the exposure compensation when recording video in c-log. i shoot in m mode, 23.98 fps, f2.8 and iso 400. so far the only way i’ve been able to figure out how to change the exposure is by raising or dropping the iso. i’ve tried -----> mapping !!!  the af-on button to change exposure but that doesn’t seem to work... any tips or tricks would really be greatly appreciated. thank you!!", "sortedWord": "None", "identifyer": 46981, "year": "2020"}, {"Unnamed: 0": 300218, "autor": "T6A5", "date": 1599399908000, "content": "SL3/250D - customizing button controls /!/ Hi everyone,\n\ndoes anyone know if there is a way to customize the button controls on the Canon SL3/250D outside of the custom functions menu? \n\nNormally, the way I shoot is in manual/auto ISO with the screen off, but it is helpful to have the \"Q/Set\" button to be able to quickly open the menu screen and adjust my settings if necessary. Having exposure compensation, which can be set in manual mode, by holding the Q button down and scrolling the wheel to adjust the exposure accordingly, would also be a useful function to have. My issue is that the camera, so far as I can tell, only allows you to map the Q button to one or the other; if I choose to have exposure compensation with the Q button, in order to adjust my settings I'd have to turn the screen back on, then press the Q button on the touch screen, which isn't a huge imposition, but it is a bit less convenient. Does anyone know if there is a way to map some other button (such as the Av +- button) to do exposure compensation in manual mode, so that I can still use the Q button to quickly alter my settings? I know that the Av+- button is the way you can do exposure compensation in aperture and shutter priority, but unfortunately this doesn't seem to work in manual mode, which is a pity. Unless I've missed something.\n\nIf anyone would be able to weigh on this issue, that would be great. Thanks!", "link": "https://www.reddit.com/r/canon/comments/inm8ny/sl3250d_customizing_button_controls/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "sl3/250d - customizing button controls /!/ hi everyone,\n\ndoes anyone know if there is a way to customize the button controls on the canon sl3/250d outside of the custom functions menu? \n\nnormally, the way i shoot is in manual/auto iso with the screen off, but it is helpful to have the \"q/set\" button to be able to quickly open the menu screen and adjust my settings if necessary. having exposure compensation, which can be set in manual mode, by holding the q button down and scrolling the wheel to adjust the exposure accordingly, would also be a useful function to have. my issue is that the camera, so far as i can tell, only allows you to -----> map !!!  the q button to one or the other; if i choose to have exposure compensation with the q button, in order to adjust my settings i'd have to turn the screen back on, then press the q button on the touch screen, which isn't a huge imposition, but it is a bit less convenient. does anyone know if there is a way to map some other button (such as the av +- button) to do exposure compensation in manual mode, so that i can still use the q button to quickly alter my settings? i know that the av+- button is the way you can do exposure compensation in aperture and shutter priority, but unfortunately this doesn't seem to work in manual mode, which is a pity. unless i've missed something.\n\nif anyone would be able to weigh on this issue, that would be great. thanks!", "sortedWord": "None", "identifyer": 47015, "year": "2020"}, {"Unnamed: 0": 300775, "autor": "Eternal-Arcann", "date": 1607300915000, "content": "Ordered STM lens, but received USM lens. /!/ 18-135. \n\nI don’t know what to do, because I don’t have another lens to use if I was to send it back for the correct one. I mainly shoot on the go video rather than actual photography. \n\nI know my problem is ordering from Amazon rather than from Canon itself. The reason why is because Canon does not accept ANY address that I use because it’s not considered a valid address. I live in a small town, even maps doesn’t recognize the addresses here. Amazon delivers to PO Box while Canon doesn’t. \n\nIs it worth it to send the lens back? Or should I order the correct one and try to find another address to use?", "link": "https://www.reddit.com/r/canon/comments/k85pcx/ordered_stm_lens_but_received_usm_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "ordered stm lens, but received usm lens. /!/ 18-135. \n\ni don’t know what to do, because i don’t have another lens to use if i was to send it back for the correct one. i mainly shoot on the go video rather than actual photography. \n\ni know my problem is ordering from amazon rather than from canon itself. the reason why is because canon does not accept any address that i use because it’s not considered a valid address. i live in a small town, even -----> maps !!!  doesn’t recognize the addresses here. amazon delivers to po box while canon doesn’t. \n\nis it worth it to send the lens back? or should i order the correct one and try to find another address to use?", "sortedWord": "None", "identifyer": 47589, "year": "2020"}, {"Unnamed: 0": 303290, "autor": "rsegoly", "date": 1607230633000, "content": "Need to add location to photos offline /!/ Hi\n\nI have set of photos taken during a day, and GPS location taken from google maps timeline as KML (or any other format).\n\nLooking for a desktop tool, to use the location file, and edit individual pictures as a batch accordingly.\n\nAnyone?", "link": "https://www.reddit.com/r/canon/comments/k7ncbq/need_to_add_location_to_photos_offline/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "need to add location to photos offline /!/ hi\n\ni have set of photos taken during a day, and gps location taken from -----> google !!!  -----> maps !!!  timeline as kml (or any other format).\n\nlooking for a desktop tool, to use the location file, and edit individual pictures as a batch accordingly.\n\nanyone?", "sortedWord": "None", "identifyer": 50179, "year": "2020"}, {"Unnamed: 0": 303310, "autor": "Imdiogomarques", "date": 1607167045000, "content": "Question about EOS R and Control Ring Adapter custom buttons /!/ Hey all!\n\n&amp;#x200B;\n\nI plan on pulling the trigger on a eos r today. I was wondering the following: is it possible to map the aperture setting to the control ring adapter(rf ring too) and the iso to the mode dial in manual mode? \n\n&amp;#x200B;\n\nThank you!", "link": "https://www.reddit.com/r/canon/comments/k75sg1/question_about_eos_r_and_control_ring_adapter/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "question about eos r and control ring adapter custom buttons /!/ hey all!\n\n&amp;#x200b;\n\ni plan on pulling the trigger on a eos r today. i was wondering the following: is it possible to -----> map !!!  the aperture setting to the control ring adapter(rf ring too) and the iso to the mode dial in manual mode? \n\n&amp;#x200b;\n\nthank you!", "sortedWord": "None", "identifyer": 50200, "year": "2020"}, {"Unnamed: 0": 304782, "autor": "High-Vibe", "date": 1607644364000, "content": "Canon T6i Video Settings help /!/ Hey folks, \n\nIs there any way to get past the 30 minute max video record time? I bought a time/remote because someone said that I would be able to re-map my shutter button to record video and voila, set the timer for 30 mins and it should in theory have a short stutter before starting the video back up again, right?   \n\n\nBut I'm having the darndest time trying to figure out how to customize buttons, can it be done on the t6i? Is there any way to record longer than 30 minutes on this thing?   \n\n\nThanks in advance for your help!", "link": "https://www.reddit.com/r/canon/comments/kaqubm/canon_t6i_video_settings_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "canon t6i video settings help /!/ hey folks, \n\nis there any way to get past the 30 minute max video record time? i bought a time/remote because someone said that i would be able to re------> map !!!  my shutter button to record video and voila, set the timer for 30 mins and it should in theory have a short stutter before starting the video back up again, right?   \n\n\nbut i'm having the darndest time trying to figure out how to customize buttons, can it be done on the t6i? is there any way to record longer than 30 minutes on this thing?   \n\n\nthanks in advance for your help!", "sortedWord": "None", "identifyer": 51704, "year": "2020"}], "name": "mapcanon2020"}