{"interestingcomments": [{"Unnamed: 0": 292184, "autor": "ShookieOfficial", "date": 1630053027000, "content": "I am looking for a (mini?) tripod for my Canon M50 mk2 that I can have on my (stable) table for portrait mode filming/streaming. Price: About €50~75 / $60~90 /!/  Ok, it seems to be a jungle of tripods out there, and even though I have browsed through many website and seen some youtube movies, I still cannot find one that suits my needs, unfortunately. I do understand that I am in for a tough find, since my requirements are quite...peculiar:\n\n\\- The tripod should be stable enough and tolerate some weight since I will be using my M50 mk2 in portrait mode/orientation for my livestreams and recordings. So yeah, a tripod that doesn't tip/fall over when in portrait orientation would be great.\n\n\\- It should have some height adjustment availability, but no need for that much.\n\n\\- It shouldn't be too bulky aka take up too much space.\n\n\\- It cannot be a table-mounted one, unfortunately. That'll be way too non-practical for me.\n\n\\- Budget: About €50 / $60. Maybe up to €75 / $90.\n\n\\- Here is a picture where the tripod will be standing, and as you can see, there's not much space, even though the monitors can and will be pushed away so there's SOME additional space: [https://files.catbox.moe/tigicz.jpg](https://files.catbox.moe/tigicz.jpg)\n\nPS: I cannot order from Amazon, because Norway + Amazon are not good friends, apparently (overly costly shipping prices and not many who delivers to Norway, seemingly...)\n\nSo, any suggestions for a tripod that meets the above-mentioned requirements?", "link": "https://www.reddit.com/r/canon/comments/pcj9ny/i_am_looking_for_a_mini_tripod_for_my_canon_m50/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i am looking for a (mini?) tripod for my canon m50 mk2 that i can have on my (stable) table for portrait mode filming/streaming. price: about €50~75 / $60~90 /!/  ok, it seems to be a jungle of tripods out there, and even though i have browsed through many website and seen some youtube movies, i still cannot find one that suits my needs, unfortunately. i do understand that i am in for a tough find, since my requirements are quite...peculiar:\n\n\\- the tripod should be stable enough and tolerate some weight since i will be using my m50 mk2 in portrait mode/-----> orientation !!!  for my livestreams and recordings. so yeah, a tripod that doesn't tip/fall over when in portrait orientation would be great.\n\n\\- it should have some height adjustment availability, but no need for that much.\n\n\\- it shouldn't be too bulky aka take up too much space.\n\n\\- it cannot be a table-mounted one, unfortunately. that'll be way too non-practical for me.\n\n\\- budget: about €50 / $60. maybe up to €75 / $90.\n\n\\- here is a picture where the tripod will be standing, and as you can see, there's not much space, even though the monitors can and will be pushed away so there's some additional space: [https://files.catbox.moe/tigicz.jpg](https://files.catbox.moe/tigicz.jpg)\n\nps: i cannot order from amazon, because norway + amazon are not good friends, apparently (overly costly shipping prices and not many who delivers to norway, seemingly...)\n\nso, any suggestions for a tripod that meets the above-mentioned requirements?", "sortedWord": "None", "identifyer": 38748, "year": "2021"}, {"Unnamed: 0": 294364, "autor": "Would-wood-again2", "date": 1612405447000, "content": "Force landscape orientation? /!/ Im doing photogrammetry with a canon t7i.  I am taking all my photos with the camera pointed downwards (more or less).  Most photos are coming out in landscape mode but around 25% are coming out in portrait mode even though im just moving left to right and taking photos pointing the camera down-ish.  \n\nIt's annoying to have to go into my photos and manually orient them the correct way.  Is there a way to lock the camera into orienting all shots in landscape mode and never portrait mode?\n\nI imagine subtle movements and rotations are making the camera think It should be in portrait mode.", "link": "https://www.reddit.com/r/canon/comments/lc54g4/force_landscape_orientation/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "force landscape -----> orientation !!! ? /!/ im doing photogrammetry with a canon t7i.  i am taking all my photos with the camera pointed downwards (more or less).  most photos are coming out in landscape mode but around 25% are coming out in portrait mode even though im just moving left to right and taking photos pointing the camera down-ish.  \n\nit's annoying to have to go into my photos and manually orient them the correct way.  is there a way to lock the camera into orienting all shots in landscape mode and never portrait mode?\n\ni imagine subtle movements and rotations are making the camera think it should be in portrait mode.", "sortedWord": "None", "identifyer": 40976, "year": "2021"}], "name": "orientationcanon2021"}