{"interestingcomments": [{"Unnamed: 0": 291694, "autor": "LupeTheGSD", "date": 1611808250000, "content": "Canon M50 Upgrade Advice /!/ Hey everyone,\n\nIm newish to photography, started about 3 months ago but im pretty hooked. It started getting me out of the house to walk and just be more active as well so thats a big plus. \n\nI love street photography and portraits mainly. Im currently using the m50 with the kit lens, 22 f2 and 50mm Yongnuo with the regular adapter. \n\nSo far my experience has been pretty positive, although being honest i haven’t got much to compare to since its my first camera. \n\nThe main things i “lack” or wish were a little better:\n\n-Separate dials for exposure (Shutter, Aperture, ISO) i did change some of my buttons and i kind of control them without the touch screen but doesn’t feel as fast as having dedicated dials. \n\n-low light feels kind of restrictive. I know this is also very lens dependant but i feel anything above 1600 iso is pretty risky. \n\n-Better battery life. Kind of a tough one since i love mirrorless and honestly i don’t want to jump to full frame bodies or lenses that are just too expensive for a casual like me.\n\n-Fear of investing on Ef-m Lenses. I really want to get the Sigma trio, im in love with primes and those look really tempting, but i feel like canon could pretty much stop the Efm line and then the lenses will be pretty much stuck with me so to speak. \n\n-Some type of weather sealing would be nice to be able to shoot under rain or snow. Not really what i want the most but would be sweet. \n\nPretty much thats it, i honestly am very happy with my modest setup and im very excited about just going out and shooting. I do not want to give up the lightweight of my setup nor to go deep onto very expensive waters. Just wanna know if you guys think theres something i should improve, or maybe just get more lenses to try new things, or just plain wait out what cannon has to offer this year. \n\nI was really watching the m6 mkii, but giving up the fully articulate screen and the evf (which i don’t use that much tbh) for the uncropped 4k basically and other improvements wasn’t as convincing. But then again im in no position to know really if its worth of an upgrade. \n\nThanks in advance for reading/replying.\n\nHope you’re all safe.\n\nNOTE: BTW im pretty heavy on the Photography side , finished a lot of courses and instructional videos on lynda/LinkedIn Learning, but haven’t really gotten to video yet. So the 4k crop doesn’t bother me so far since i barely shoot video. Tbh even if i were shooting video id use 1080p, 4k isn’t that much of a deal for me.", "link": "https://www.reddit.com/r/canon/comments/l6nzm6/canon_m50_upgrade_advice/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon m50 upgrade advice /!/ hey everyone,\n\nim newish to photography, started about 3 months ago but im pretty hooked. it started getting me out of the house to walk and just be more active as well so thats a big plus. \n\ni love street photography and portraits mainly. im currently using the m50 with the kit lens, 22 f2 and 50mm yongnuo with the regular adapter. \n\nso far my experience has been pretty positive, although being honest i haven’t got much to compare to since its my first camera. \n\nthe main things i “lack” or wish were a little better:\n\n-separate dials for exposure (shutter, aperture, iso) i did change some of my buttons and i kind of control them without the touch screen but doesn’t feel as fast as having dedicated dials. \n\n-low light feels kind of restrictive. i know this is also very lens dependant but i feel anything above 1600 iso is pretty risky. \n\n-better battery life. kind of a tough one since i love mirrorless and honestly i don’t want to jump to full frame bodies or lenses that are just too expensive for a casual like me.\n\n-fear of investing on ef-m lenses. i really want to get the sigma trio, im in love with primes and those look really tempting, but i feel like canon could pretty much stop the efm line and then the lenses will be pretty much stuck with me so to speak. \n\n-some type of weather sealing would be nice to be able to shoot under rain or snow. not really what i want the most but would be sweet. \n\npretty much thats it, i honestly am very happy with my modest setup and im very excited about just going out and shooting. i do not want to give up the lightweight of my setup nor to go deep onto very expensive waters. just wanna know if you guys think theres something i should improve, or maybe just get more lenses to try new things, or just plain wait out what cannon has to offer this year. \n\ni was really watching the m6 mkii, but giving up the fully articulate screen and the evf (which i don’t use that much tbh) for the uncropped 4k basically and other improvements wasn’t as convincing. but then again im in no -----> position !!!  to know really if its worth of an upgrade. \n\nthanks in advance for reading/replying.\n\nhope you’re all safe.\n\nnote: btw im pretty heavy on the photography side , finished a lot of courses and instructional videos on lynda/linkedin learning, but haven’t really gotten to video yet. so the 4k crop doesn’t bother me so far since i barely shoot video. tbh even if i were shooting video id use 1080p, 4k isn’t that much of a deal for me.", "sortedWord": "None", "identifyer": 38249, "year": "2021"}, {"Unnamed: 0": 291740, "autor": "CarcajouHaguissable", "date": 1619794568000, "content": "Canon Rebel T3 - I Need Help Removing a Dead Bug in the Viewfinder /!/ Hello,\n\nI am sorry for this somewhat odd request, but I can't seem to find any help on that. I'm trying to clean up my old Canon Rebel T3 for sale, as there is a dead bug that we can see (sometimes) when looking through the viewfinder... \n\nI wonder if someone could help me understand where the dead bug would be in  the compartment. \n\nI've tried removing the lens and shaking the camera, to no avail.\n\nI tried earlier today to unscrew all the little screws, but two of them won't budge (I think it's due to sand that got in the screwing hole).\n\nWhat would you do in my position? I could just sell it as is, but let's admit it's not the best selling point (dead bug included, ladies and gentlemen).\n\nThank you!", "link": "https://www.reddit.com/r/canon/comments/n1vlas/canon_rebel_t3_i_need_help_removing_a_dead_bug_in/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon rebel t3 - i need help removing a dead bug in the viewfinder /!/ hello,\n\ni am sorry for this somewhat odd request, but i can't seem to find any help on that. i'm trying to clean up my old canon rebel t3 for sale, as there is a dead bug that we can see (sometimes) when looking through the viewfinder... \n\ni wonder if someone could help me understand where the dead bug would be in  the compartment. \n\ni've tried removing the lens and shaking the camera, to no avail.\n\ni tried earlier today to unscrew all the little screws, but two of them won't budge (i think it's due to sand that got in the screwing hole).\n\nwhat would you do in my -----> position !!! ? i could just sell it as is, but let's admit it's not the best selling point (dead bug included, ladies and gentlemen).\n\nthank you!", "sortedWord": "None", "identifyer": 38296, "year": "2021"}, {"Unnamed: 0": 292073, "autor": "thehedgefrog", "date": 1627587564000, "content": "A \"thank you\" to the salesperson that convinced me to spend more money, or how I got the passion back. /!/ I recently found myself in the unique position to start anew with photo gear. I had a Rebel XTi (400D) that I bought new when it came out and a handful of cheap EF-S lenses that I used to take tens of thousands of shots over 8-10 years. It made me develop frankly the only artistic skill that I possess and has been very rewarding. \n\nHowever, over the last few years, I progressively took less and less photos as I was hitting the limits of my equipment, and I barely touched the camera in the last 18 months. A friend lent me his 5D IV for a week and I fell right back in it, so I figured it was time for me to get some new gear. I went to my trusted local store and asked to see the 6D II and the Nikon D760, as I always look to competition to compare when I upgrade gear. \n\nI initially felt a bit insulted that the salesperson considered those less than ideal choices and encouraged me to try mirrorless, citing the DSLRs being a slowly dying breed and mirrorless being the future. Mind you, I thought the EVFs had not changed much since the family's camcorder we had when I was a child.  He then pulled out a D760, a 6D II and an R6, brought them to a separate room along with a handful of lenses and told me to take as much time with them as I needed, and then sleep on it/read up on the camera before making up my mind. \n\nIt didn't take me 5 minutes to figure out that the R6 was what I wanted, and what I later read only confirmed that.  Obviously, I'm glad that I could stretch my budget, but I have to recognize I should have approached it with more of an open mind. \n\n2 weeks later, I can say that my R6 with the RF 24-105 f/4 L is absolutely perfect, and I'm already researching my next glass.", "link": "https://www.reddit.com/r/canon/comments/ou4ngl/a_thank_you_to_the_salesperson_that_convinced_me/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a \"thank you\" to the salesperson that convinced me to spend more money, or how i got the passion back. /!/ i recently found myself in the unique -----> position !!!  to start anew with photo gear. i had a rebel xti (400d) that i bought new when it came out and a handful of cheap ef-s lenses that i used to take tens of thousands of shots over 8-10 years. it made me develop frankly the only artistic skill that i possess and has been very rewarding. \n\nhowever, over the last few years, i progressively took less and less photos as i was hitting the limits of my equipment, and i barely touched the camera in the last 18 months. a friend lent me his 5d iv for a week and i fell right back in it, so i figured it was time for me to get some new gear. i went to my trusted local store and asked to see the 6d ii and the nikon d760, as i always look to competition to compare when i upgrade gear. \n\ni initially felt a bit insulted that the salesperson considered those less than ideal choices and encouraged me to try mirrorless, citing the dslrs being a slowly dying breed and mirrorless being the future. mind you, i thought the evfs had not changed much since the family's camcorder we had when i was a child.  he then pulled out a d760, a 6d ii and an r6, brought them to a separate room along with a handful of lenses and told me to take as much time with them as i needed, and then sleep on it/read up on the camera before making up my mind. \n\nit didn't take me 5 minutes to figure out that the r6 was what i wanted, and what i later read only confirmed that.  obviously, i'm glad that i could stretch my budget, but i have to recognize i should have approached it with more of an open mind. \n\n2 weeks later, i can say that my r6 with the rf 24-105 f/4 l is absolutely perfect, and i'm already researching my next glass.", "sortedWord": "None", "identifyer": 38634, "year": "2021"}, {"Unnamed: 0": 292640, "autor": "PhoenixHailJones", "date": 1615947661000, "content": "Beginning new career/Canon advice /!/ Hello...\nI had been in the food industry for 27 years before this pandemic. Lost my job and haven't worked for over a year now. Although, places are beginning to open up, the market is saturated due to others trying to get back in so, I'm probably looking at another 6 months, at least, before I can find position paying close to what I was making before. So, I'm looking to start my own business and would really appreciate any advice from other photographers. \n\nI recently found this \"beginner photography bundle\" on Amazon and before I invest I'd like to know what you all think.\nhttps://www.amazon.com/Canon-EOS-4000D-18-55mm-3-5-5-6/dp/B08KSMKHF3/ref=mp_s_a_1_153?dchild=1&amp;keywords=photography&amp;qid=1615925412&amp;sr=8-153\n\nThanks so much, in advance.\n\nPhoenix", "link": "https://www.reddit.com/r/canon/comments/m6ptan/beginning_new_careercanon_advice/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "beginning new career/canon advice /!/ hello...\ni had been in the food industry for 27 years before this pandemic. lost my job and haven't worked for over a year now. although, places are beginning to open up, the market is saturated due to others trying to get back in so, i'm probably looking at another 6 months, at least, before i can find -----> position !!!  paying close to what i was making before. so, i'm looking to start my own business and would really appreciate any advice from other photographers. \n\ni recently found this \"beginner photography bundle\" on amazon and before i invest i'd like to know what you all think.\nhttps://www.amazon.com/canon-eos-4000d-18-55mm-3-5-5-6/dp/b08ksmkhf3/ref=mp_s_a_1_153?dchild=1&amp;keywords=photography&amp;qid=1615925412&amp;sr=8-153\n\nthanks so much, in advance.\n\nphoenix", "sortedWord": "None", "identifyer": 39211, "year": "2021"}, {"Unnamed: 0": 292770, "autor": "rjszoke", "date": 1610330592000, "content": "Best Lens for M50? /!/ I need to get more out of my M50. I’m looking for a lens that can give my overall production quality a boost.\n\nI will use the camera primarily for YouTube videos, occasionally shooting in 4k. 99% of the time I will be shooting inside with a professional lighting setup. I will likely be staying in the same position for most of the time in videos, just moving my hands to illustrate points if that matters. I have the Kit lens and well, it’s not the greatest. Also, I’ll have an external wireless lavaliere mic setup   \n\nBudget: Mid-High priced range. $ is not really an issue. If you can, give me both a mid &amp;amp; high range lens. \n\nI appreciate any help! Any other information that I didn’t include, just let me know.", "link": "https://www.reddit.com/r/canon/comments/kusp09/best_lens_for_m50/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best lens for m50? /!/ i need to get more out of my m50. i’m looking for a lens that can give my overall production quality a boost.\n\ni will use the camera primarily for youtube videos, occasionally shooting in 4k. 99% of the time i will be shooting inside with a professional lighting setup. i will likely be staying in the same -----> position !!!  for most of the time in videos, just moving my hands to illustrate points if that matters. i have the kit lens and well, it’s not the greatest. also, i’ll have an external wireless lavaliere mic setup   \n\nbudget: mid-high priced range. $ is not really an issue. if you can, give me both a mid &amp;amp; high range lens. \n\ni appreciate any help! any other information that i didn’t include, just let me know.", "sortedWord": "None", "identifyer": 39343, "year": "2021"}, {"Unnamed: 0": 292926, "autor": "stistifrombnc", "date": 1617901051000, "content": "My Ef 17-55 zoom always get back on his initial position, is it normal ? /!/ Hi everybody ! \n\nI bought a second hand lens, the Canon EF-S 17-55mm f/2.8 IS USM. While I was trying to balance my camera and this lens on my gimbal, I noticed that the zoom always gets back in his initial position when the lens is facing up. \n\n&amp;#x200B;\n\nI don't have this problem with my other Zoom lens (EF 24-105 f/4), is it normal or is it a flaw ?", "link": "https://www.reddit.com/r/canon/comments/mmw56z/my_ef_1755_zoom_always_get_back_on_his_initial/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my ef 17-55 zoom always get back on his initial -----> position !!! , is it normal ? /!/ hi everybody ! \n\ni bought a second hand lens, the canon ef-s 17-55mm f/2.8 is usm. while i was trying to balance my camera and this lens on my gimbal, i noticed that the zoom always gets back in his initial position when the lens is facing up. \n\n&amp;#x200b;\n\ni don't have this problem with my other zoom lens (ef 24-105 f/4), is it normal or is it a flaw ?", "sortedWord": "None", "identifyer": 39500, "year": "2021"}, {"Unnamed: 0": 292994, "autor": "aptyler308", "date": 1619455938000, "content": "Canon R6 EVF reticle doesn't line up with open eye perceived target /!/ I have an R6 that's only a few weeks old, and I've noticed an odd quirk when aiming at a subject. I typically shoot with both eyes open, which helps with highly zoomed, small moving targets. When using the R6, I've discovered that the perceived aim of the EVF reticle on my unaided eye is well above where the camera is actually pointing. I've tried adjusting my head/eye position, and swapping lenses (600mm f/11 and 24-105mm f/4-7.1), but the behavior is unchanged. It seems like there's a physical angular offset between the EVF and the lens axis.\n\nIt's not a showstopper, but compensating for the offset while trying to track a bird in flight is problematic, and slows my response/aim time. My previous camera was an 80D, and I never had this same issue on that camera. I've tried googling, but either I'm not using the right keyword, or it's not a common issue. Any thoughts? I'm hoping that there's a simple adjustment I can use to just dial it in.", "link": "https://www.reddit.com/r/canon/comments/mz26dj/canon_r6_evf_reticle_doesnt_line_up_with_open_eye/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon r6 evf reticle doesn't line up with open eye perceived target /!/ i have an r6 that's only a few weeks old, and i've noticed an odd quirk when aiming at a subject. i typically shoot with both eyes open, which helps with highly zoomed, small moving targets. when using the r6, i've discovered that the perceived aim of the evf reticle on my unaided eye is well above where the camera is actually pointing. i've tried adjusting my head/eye -----> position !!! , and swapping lenses (600mm f/11 and 24-105mm f/4-7.1), but the behavior is unchanged. it seems like there's a physical angular offset between the evf and the lens axis.\n\nit's not a showstopper, but compensating for the offset while trying to track a bird in flight is problematic, and slows my response/aim time. my previous camera was an 80d, and i never had this same issue on that camera. i've tried googling, but either i'm not using the right keyword, or it's not a common issue. any thoughts? i'm hoping that there's a simple adjustment i can use to just dial it in.", "sortedWord": "None", "identifyer": 39568, "year": "2021"}, {"Unnamed: 0": 293142, "autor": "ObecalpEffect", "date": 1620870204000, "content": "EFS 10-22mm - Which of these 2 pictures shows the actual infinity focus position please?", "link": "https://www.reddit.com/r/canon/comments/nb5dhd/efs_1022mm_which_of_these_2_pictures_shows_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "efs 10-22mm - which of these 2 pictures shows the actual infinity focus -----> position !!!  please?", "sortedWord": "None", "identifyer": 39725, "year": "2021"}, {"Unnamed: 0": 293245, "autor": "The_Woodshed", "date": 1615561404000, "content": "R6/Mirrorless No-No? /!/ Hello All!\n\nI have an R6 and I may or may not have made a bit of a mistake - just wanted to know if it would've been harmful to the camera.\n\n&amp;#x200B;\n\nAfter using it yesterday early afternoon, I may or may not have left it in the on position for about 6 hours.  As you know, it goes into standby or auto-off mode after a minute, and I might have not noticed it was still in the on position, removed the lens, put the body cap on, and set it down.  I say \"may\" because 6 hours later when I went to use it quickly, I wasn't cognizant of if I had switched it on already by habit, but I noticed when I plugged in my Rode Videomic NTG, the microphone showed power right away, which happens when the camera is on.  Like I said, might've turned it on prior to plugging in the microphone.   I did a test to see what happened if I let it go to standby mode while the lens cap was on, and it seems that the sensor is still exposed.  The curtain doesn’t come down, so essentially, the sensor would have been exposed behind the body cap for 6 hours, regardless if the camera was actively on or not.  \n\n\nIf the sensor was exposed for that long with the lens cap on, even though it was in the auto-off/standby mode (you know, how it goes off after 1 minute), could anything damaging happen to my R6?  \n\n\nThank you all for your time.", "link": "https://www.reddit.com/r/canon/comments/m3jd6h/r6mirrorless_nono/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "r6/mirrorless no-no? /!/ hello all!\n\ni have an r6 and i may or may not have made a bit of a mistake - just wanted to know if it would've been harmful to the camera.\n\n&amp;#x200b;\n\nafter using it yesterday early afternoon, i may or may not have left it in the on -----> position !!!  for about 6 hours.  as you know, it goes into standby or auto-off mode after a minute, and i might have not noticed it was still in the on position, removed the lens, put the body cap on, and set it down.  i say \"may\" because 6 hours later when i went to use it quickly, i wasn't cognizant of if i had switched it on already by habit, but i noticed when i plugged in my rode videomic ntg, the microphone showed power right away, which happens when the camera is on.  like i said, might've turned it on prior to plugging in the microphone.   i did a test to see what happened if i let it go to standby mode while the lens cap was on, and it seems that the sensor is still exposed.  the curtain doesn’t come down, so essentially, the sensor would have been exposed behind the body cap for 6 hours, regardless if the camera was actively on or not.  \n\n\nif the sensor was exposed for that long with the lens cap on, even though it was in the auto-off/standby mode (you know, how it goes off after 1 minute), could anything damaging happen to my r6?  \n\n\nthank you all for your time.", "sortedWord": "None", "identifyer": 39833, "year": "2021"}, {"Unnamed: 0": 293367, "autor": "Someguywhomakething", "date": 1623692302000, "content": "Canon 6D Mark II + Shooting with Mirror Locked Up mechanically /!/ So I adapted a lens that has a shorter flange distance than the EF mount so it sits inside the mirror box. Works just fine on my 5Dc, but on the 6D Mk II Canon doesn't allow this and will throw Err 20 every time I mount it. Is there a way around this? Like Magic Lantern or am I SOL?\n\nEdit: Futher googling lead me to this post on DPreview.com of a pull quote from Astronomik:\n\n&gt; Our Clip-Filters for Canon Full-Format Cameras are used when the mirror is in the upper position. The optical viewfinder can not be used. The 5d mark 4 checks with every exposure if the mirror makes a full swing. Due to this the camera produces an error when an image is exposed. I see no way of constructing a filter that fits into the tiny space that is availiable when the mirror moves. On the other hand Canon announced mirrorless full frame cameras, that look as if we will be able to provide filters for them, once we get hold of a sample.\n\nThat sucks. \n\n\n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/nzsanm/canon_6d_mark_ii_shooting_with_mirror_locked_up/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon 6d mark ii + shooting with mirror locked up mechanically /!/ so i adapted a lens that has a shorter flange distance than the ef mount so it sits inside the mirror box. works just fine on my 5dc, but on the 6d mk ii canon doesn't allow this and will throw err 20 every time i mount it. is there a way around this? like magic lantern or am i sol?\n\nedit: futher googling lead me to this post on dpreview.com of a pull quote from astronomik:\n\n&gt; our clip-filters for canon full-format cameras are used when the mirror is in the upper -----> position !!! . the optical viewfinder can not be used. the 5d mark 4 checks with every exposure if the mirror makes a full swing. due to this the camera produces an error when an image is exposed. i see no way of constructing a filter that fits into the tiny space that is availiable when the mirror moves. on the other hand canon announced mirrorless full frame cameras, that look as if we will be able to provide filters for them, once we get hold of a sample.\n\nthat sucks. \n\n\n\nthanks!", "sortedWord": "None", "identifyer": 39959, "year": "2021"}, {"Unnamed: 0": 293429, "autor": "taurisu", "date": 1623361450000, "content": "Canon EOS M50 and Mixed Reality Capture Oculus Quest 2 /!/ I set up my green screen for mixed reality capture, have installed MRC tools, got everything all set up... except the MRC is reading my camera input upside down. Cannot calibrate because the controller positions won't align properly with the feed flipped 180. Camera input is right side up for all other applications on my Windows 10 (VR ready) laptop (Zoom, camera app, Google Meet, etc.) but upside down only for MRC. When connecting any other camera to MRC (Samsung phone, laptop webcam) it is right side up. I have tried ten ways to Sunday to fix this.... can anyone here help perhaps?", "link": "https://www.reddit.com/r/canon/comments/nwzdz4/canon_eos_m50_and_mixed_reality_capture_oculus/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "canon eos m50 and mixed reality capture oculus quest 2 /!/ i set up my green screen for mixed reality capture, have installed mrc tools, got everything all set up... except the mrc is reading my camera input upside down. cannot calibrate because the controller -----> positions !!!  won't align properly with the feed flipped 180. camera input is right side up for all other applications on my windows 10 (vr ready) laptop (zoom, camera app, google meet, etc.) but upside down only for mrc. when connecting any other camera to mrc (samsung phone, laptop webcam) it is right side up. i have tried ten ways to sunday to fix this.... can anyone here help perhaps?", "sortedWord": "None", "identifyer": 40023, "year": "2021"}, {"Unnamed: 0": 293925, "autor": "mahrus888", "date": 1632286628000, "content": "Canon PIXMA TS5040 Driver Download /!/ **Canon Pixma Inkjet 3-In-1 Wireless Colour Printer WiFi network is suitable for your homework or office. This printer provide you to a fast wireless response, fast printing and very good photo &amp; printing quality.**\n\n**Canon Pixma TS5040 Setup is easy. Click the power button and in display screen choose your language and click agree. And then install the ink cartridges to printer in the right positions. So, you just load the A4 paper to print it for the firts time.**\n\nTo  Canon PIXMA TS5040 Driver for Windows and Mac, [Click here](https://www.driversoftlaptop.com/canon-pixma-ts5040-driver/)...", "link": "https://www.reddit.com/r/canon/comments/pt0bot/canon_pixma_ts5040_driver_download/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "canon pixma ts5040 driver download /!/ **canon pixma inkjet 3-in-1 wireless colour printer wifi network is suitable for your homework or office. this printer provide you to a fast wireless response, fast printing and very good photo &amp; printing quality.**\n\n**canon pixma ts5040 setup is easy. click the power button and in display screen choose your language and click agree. and then install the ink cartridges to printer in the right -----> positions !!! . so, you just load the a4 paper to print it for the firts time.**\n\nto  canon pixma ts5040 driver for windows and mac, [click here](https://www.driversoftlaptop.com/canon-pixma-ts5040-driver/)...", "sortedWord": "None", "identifyer": 40532, "year": "2021"}, {"Unnamed: 0": 294033, "autor": "coastal_neon", "date": 1628627023000, "content": "6DM2. Can someone please explain why the focus brackets (white brackets) and AF points are not centered in the frame? They are always positioned right of center for some reason.", "link": "https://www.reddit.com/r/canon/comments/p1xh6t/6dm2_can_someone_please_explain_why_the_focus/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "6dm2. can someone please explain why the focus brackets (white brackets) and af points are not centered in the frame? they are always -----> positioned !!!  right of center for some reason.", "sortedWord": "None", "identifyer": 40640, "year": "2021"}, {"Unnamed: 0": 294668, "autor": "jotoc0", "date": 1610220978000, "content": "Canon Rp 24h first impressions /!/ Hi all! Yesterday my new Canon Rp arrived. Thanks for all suggestions on buying it.\n\nI wanted to give you all my 24h first impressions. I bought it with the kit 24-105 STM lens and the adapter fo my EF lenses will arrive on monday only. So bear that in mind.\n\n&lt;&gt; Ergonomics:\n\n\\+ Nice materials, feel solid in hand;\n\n\\+ Control ring in lens (and in the adapter when I get it) is very nice;\n\n\\- Tiny. Pinky dangling from the bottom tiny;\n\n\\- Second dial is in an uncomfortable position;\n\n\\- Really miss the back dial and extra buttons from something like a 6d;\n\n&lt;&gt; Performance:\n\n\\+ Quick to boot up and in use, interface is snappy.\n\n\\+ Good auto focus modes, initial point tracking is great;\n\n\\+ Wifi transfer speeds are double or more than my m50;\n\n\\- Auto focus from f6.3 up is very poor. Even at proper exposure 1/125 f6.3 ISO 1000 it will hunt occasionally and is not reliable from there;\n\n\\- Tracking shutter speed is slow;\n\n\\- Atrocious battery life. Seriously, I will have to buy another 5 batteries if I ever take this to a wedding. Went through 2 charges just playing with it;\n\n&lt;&gt; Image quality:\n\n\\+ Good full frame sensor, with decent quality and good colors;\n\n\\+ Decent high ISO performance when it manages focus;\n\n\\+ Nice video quality and good digital stabilization;\n\n\\- Very slim improvement from my old 6D mk1 for photos;\n\n&lt;&gt; Features:\n\n\\+ Interval and focus bracketing;\n\n\\- No manual Silent mode;\n\n\\- Manual focus 4k (for all intents and purposes);\n\n\\- Limited customization through C1-3;\n\n\\- High res mode? White balance shift? Custom white balance that is not a joke? Custom video modes? Basically if you come from Panasonic, Sony or Nikon you will probably miss something.\n\n&amp;#x200B;\n\nOverall Score 6/10.\n\nConclusion: I'm not disappointed, I know the price point of this camera and knew the features before hand. It is exactly what I thought it was. A decent camera for the price. I only wish that canon didn't cripple software features as much, and while it is much better than a rebel or m-series camera, it still lacks some options and features. If I didn't have 4 flashes, 1 wireless trigger and several lenses for Canon I would have probably gone Z5 or a used a7III. As it stands I am too poor to either go higher in Canon or go to another brand as Canon cameras and lenses are much cheaper here in Brazil.", "link": "https://www.reddit.com/r/canon/comments/ktxp6x/canon_rp_24h_first_impressions/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon rp 24h first impressions /!/ hi all! yesterday my new canon rp arrived. thanks for all suggestions on buying it.\n\ni wanted to give you all my 24h first impressions. i bought it with the kit 24-105 stm lens and the adapter fo my ef lenses will arrive on monday only. so bear that in mind.\n\n&lt;&gt; ergonomics:\n\n\\+ nice materials, feel solid in hand;\n\n\\+ control ring in lens (and in the adapter when i get it) is very nice;\n\n\\- tiny. pinky dangling from the bottom tiny;\n\n\\- second dial is in an uncomfortable -----> position !!! ;\n\n\\- really miss the back dial and extra buttons from something like a 6d;\n\n&lt;&gt; performance:\n\n\\+ quick to boot up and in use, interface is snappy.\n\n\\+ good auto focus modes, initial point tracking is great;\n\n\\+ wifi transfer speeds are double or more than my m50;\n\n\\- auto focus from f6.3 up is very poor. even at proper exposure 1/125 f6.3 iso 1000 it will hunt occasionally and is not reliable from there;\n\n\\- tracking shutter speed is slow;\n\n\\- atrocious battery life. seriously, i will have to buy another 5 batteries if i ever take this to a wedding. went through 2 charges just playing with it;\n\n&lt;&gt; image quality:\n\n\\+ good full frame sensor, with decent quality and good colors;\n\n\\+ decent high iso performance when it manages focus;\n\n\\+ nice video quality and good digital stabilization;\n\n\\- very slim improvement from my old 6d mk1 for photos;\n\n&lt;&gt; features:\n\n\\+ interval and focus bracketing;\n\n\\- no manual silent mode;\n\n\\- manual focus 4k (for all intents and purposes);\n\n\\- limited customization through c1-3;\n\n\\- high res mode? white balance shift? custom white balance that is not a joke? custom video modes? basically if you come from panasonic, sony or nikon you will probably miss something.\n\n&amp;#x200b;\n\noverall score 6/10.\n\nconclusion: i'm not disappointed, i know the price point of this camera and knew the features before hand. it is exactly what i thought it was. a decent camera for the price. i only wish that canon didn't cripple software features as much, and while it is much better than a rebel or m-series camera, it still lacks some options and features. if i didn't have 4 flashes, 1 wireless trigger and several lenses for canon i would have probably gone z5 or a used a7iii. as it stands i am too poor to either go higher in canon or go to another brand as canon cameras and lenses are much cheaper here in brazil.", "sortedWord": "None", "identifyer": 41284, "year": "2021"}, {"Unnamed: 0": 294769, "autor": "TeoPlaysz", "date": 1611244912000, "content": "Lens problems /!/ when i focus my lens' focal distance ring also shifts position, and sometimes i just hear the focus motor struggling to shift focus. also the focus ring is kinda hard to turn... help", "link": "https://www.reddit.com/r/canon/comments/l218ys/lens_problems/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens problems /!/ when i focus my lens' focal distance ring also shifts -----> position !!! , and sometimes i just hear the focus motor struggling to shift focus. also the focus ring is kinda hard to turn... help", "sortedWord": "None", "identifyer": 41389, "year": "2021"}, {"Unnamed: 0": 295624, "autor": "rb67pro", "date": 1615413881000, "content": "AF R6 /!/ when assigning a certain af mode to a button, it only works when it is pressed.  When I let it go, it goes back to the previous mode.\n\n can i do something about it  It's a bit of a sucker because, for example, if I do a point AF, I don't have a joystick to change its position.  The thumb is busy pressing the button", "link": "https://www.reddit.com/r/canon/comments/m2a6t0/af_r6/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "af r6 /!/ when assigning a certain af mode to a button, it only works when it is pressed.  when i let it go, it goes back to the previous mode.\n\n can i do something about it  it's a bit of a sucker because, for example, if i do a point af, i don't have a joystick to change its -----> position !!! .  the thumb is busy pressing the button", "sortedWord": "None", "identifyer": 42265, "year": "2021"}, {"Unnamed: 0": 295697, "autor": "egoherodotus", "date": 1614896591000, "content": "The joystick on the R5 in video mode /!/ Is it possible to set the camera up where you can use the joystick to position the autofocus? I can use the joystick and the touchscreen for stills photos but cannot seem to get the joystick to work for the video mode (I have to use the camera's sensors or the touch screen if I need to be specific). Any tips?", "link": "https://www.reddit.com/r/canon/comments/lxx3h0/the_joystick_on_the_r5_in_video_mode/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the joystick on the r5 in video mode /!/ is it possible to set the camera up where you can use the joystick to -----> position !!!  the autofocus? i can use the joystick and the touchscreen for stills photos but cannot seem to get the joystick to work for the video mode (i have to use the camera's sensors or the touch screen if i need to be specific). any tips?", "sortedWord": "None", "identifyer": 42339, "year": "2021"}, {"Unnamed: 0": 295920, "autor": "bakedsamurai420", "date": 1626706902000, "content": "Problem with Focusing on Canon R6 /!/ So I’m just wondering if anyone else has this occasional problem with the R6. When using the face and eye tracking autofocus for still photos occasionally the autofocus will get “locked” in a position and it won’t let me take a photo because the focus is now off. I can fix it by either turning the camera off and on again or by waiting a few seconds and pointing it at different things and it’ll start focusing again and allow me to take a photo. It’s annoying because I’ll be taking portrait photos and all of a sudden my focus becomes locked and it won’t take a photo and I need to stop and point it all over the place until it takes a photo and starts working again.", "link": "https://www.reddit.com/r/canon/comments/onfsen/problem_with_focusing_on_canon_r6/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "problem with focusing on canon r6 /!/ so i’m just wondering if anyone else has this occasional problem with the r6. when using the face and eye tracking autofocus for still photos occasionally the autofocus will get “locked” in a -----> position !!!  and it won’t let me take a photo because the focus is now off. i can fix it by either turning the camera off and on again or by waiting a few seconds and pointing it at different things and it’ll start focusing again and allow me to take a photo. it’s annoying because i’ll be taking portrait photos and all of a sudden my focus becomes locked and it won’t take a photo and i need to stop and point it all over the place until it takes a photo and starts working again.", "sortedWord": "None", "identifyer": 42571, "year": "2021"}, {"Unnamed: 0": 295932, "autor": "beautifulntrealistic", "date": 1626655820000, "content": "R6: quick button to set from back-button to shutter-half-press focus? /!/ Probably a fairly unusual problem, but wondering if anyone knows how to do this. Essentially, I want to make a custom button that controls another custom button. I'd like a quick way to switch from back button focus (my usual) to shutter half-press focus for others to use my camera. I am frequently in a position where I have to ask someone else to take a photo for me and I'm unable to handle the camera to set it up myself.", "link": "https://www.reddit.com/r/canon/comments/on3dm6/r6_quick_button_to_set_from_backbutton_to/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "r6: quick button to set from back-button to shutter-half-press focus? /!/ probably a fairly unusual problem, but wondering if anyone knows how to do this. essentially, i want to make a custom button that controls another custom button. i'd like a quick way to switch from back button focus (my usual) to shutter half-press focus for others to use my camera. i am frequently in a -----> position !!!  where i have to ask someone else to take a photo for me and i'm unable to handle the camera to set it up myself.", "sortedWord": "None", "identifyer": 42583, "year": "2021"}, {"Unnamed: 0": 296590, "autor": "player_vsa", "date": 1631047431000, "content": "Upgrading from a 600D to a newer EF mount model, to which one? /!/ Hey there,\n\n&amp;#x200B;\n\nI've been on photography in last 6 months, I'm really loving and it is getting the position of my first hobby.\n\nI'm using an old Canon 600D, bought it in a very good deal (only €80). Jump right into the rabbit hole and now I have 7 lenses (some EF-S i could fix and some manual ones) with 2 more I'll get next weekend.\n\n&amp;#x200B;\n\nUnfortunately, last time I used the camera, I started to give signs of its age, in a bit weird way, in which  my screen started to flicker and fade out. Changed the battery and it the issue persisted just a couple of minutes later. I know this is a old camera, it can or can not work for very long. I also believe the results I'm getting with it are not that good any more (I feel most of my pictures and very 'grainy' and 'noisy'.\n\n&amp;#x200B;\n\nMy question is, which model should I look for in the near future (probably in the end of this year) to by, to make a upgrade, which I could still use the EF-S/EF lenses mount? Which 'newer' model would work for me? I am still an amateur but I'm really into photography.\n\n&amp;#x200B;\n\nI tend to be '[mão-de-vaca](https://en.wiktionary.org/wiki/m%C3%A3o-de-vaca)'(someone who avoids spending money), I have no issue to getting used things and I would like to set my budget at around €300, I could stretch it but only if I could get something I know would last at least/produce good results in the next 3-4 years. What I generate right now as as result is [here](https://stereoscopics.github.io/stereoscopics/).\n\n&amp;#x200B;\n\nAny help or hint is appreciated. Thanks in advance!", "link": "https://www.reddit.com/r/canon/comments/pjvjj1/upgrading_from_a_600d_to_a_newer_ef_mount_model/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrading from a 600d to a newer ef mount model, to which one? /!/ hey there,\n\n&amp;#x200b;\n\ni've been on photography in last 6 months, i'm really loving and it is getting the -----> position !!!  of my first hobby.\n\ni'm using an old canon 600d, bought it in a very good deal (only €80). jump right into the rabbit hole and now i have 7 lenses (some ef-s i could fix and some manual ones) with 2 more i'll get next weekend.\n\n&amp;#x200b;\n\nunfortunately, last time i used the camera, i started to give signs of its age, in a bit weird way, in which  my screen started to flicker and fade out. changed the battery and it the issue persisted just a couple of minutes later. i know this is a old camera, it can or can not work for very long. i also believe the results i'm getting with it are not that good any more (i feel most of my pictures and very 'grainy' and 'noisy'.\n\n&amp;#x200b;\n\nmy question is, which model should i look for in the near future (probably in the end of this year) to by, to make a upgrade, which i could still use the ef-s/ef lenses mount? which 'newer' model would work for me? i am still an amateur but i'm really into photography.\n\n&amp;#x200b;\n\ni tend to be '[mão-de-vaca](https://en.wiktionary.org/wiki/m%c3%a3o-de-vaca)'(someone who avoids spending money), i have no issue to getting used things and i would like to set my budget at around €300, i could stretch it but only if i could get something i know would last at least/produce good results in the next 3-4 years. what i generate right now as as result is [here](https://stereoscopics.github.io/stereoscopics/).\n\n&amp;#x200b;\n\nany help or hint is appreciated. thanks in advance!", "sortedWord": "None", "identifyer": 43266, "year": "2021"}, {"Unnamed: 0": 296734, "autor": "preciouscode96", "date": 1633183116000, "content": "Okay guys, Sigma 150-600 contemporary or Tamron 150-600 G2 for my 90D? /!/ I've been thinking about this kind of lens for ages now. I'm doing a lot of astrophotography and last year I started with deep sky instead of milkyway which means I need a zoom lens. \n\nStarted with my lovely 70-200 F4L, continued with an older sigma 80-400 but recently I was thinking I'd rather have a 150-600 instead of the 80-400. \n\nLike I said the lens would be mainly used for astrophotography but I also love to shoot animals and cars close by. This means image stabilization would be mildly important. Also the sharpness at 600mm is important for both cases. Weather sealing would be perfect but not necessarily. Zoom lock is a must (both have it). I know the tamron can lock on any position and the sigma does 200-400-600mm I believe. Also I love the Swiss Arca foot of the tamron G2 but I can buy a 3rd party one for the sigma for about 40€.\n\nThe Tamron G2 is about 1100 with taxes in my country where I can get a Sigma for 850 so quite a big difference. I'm not sure which one I should go for since they're both good, with the Tamron having better features but also about 30% more expensive. \n\nThere's also a G1 version of the Tamron but I heard it's catching a lot of dust inside. \n\nAnyway what are your thoughts? :)", "link": "https://www.reddit.com/r/canon/comments/pzvnpj/okay_guys_sigma_150600_contemporary_or_tamron/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "okay guys, sigma 150-600 contemporary or tamron 150-600 g2 for my 90d? /!/ i've been thinking about this kind of lens for ages now. i'm doing a lot of astrophotography and last year i started with deep sky instead of milkyway which means i need a zoom lens. \n\nstarted with my lovely 70-200 f4l, continued with an older sigma 80-400 but recently i was thinking i'd rather have a 150-600 instead of the 80-400. \n\nlike i said the lens would be mainly used for astrophotography but i also love to shoot animals and cars close by. this means image stabilization would be mildly important. also the sharpness at 600mm is important for both cases. weather sealing would be perfect but not necessarily. zoom lock is a must (both have it). i know the tamron can lock on any -----> position !!!  and the sigma does 200-400-600mm i believe. also i love the swiss arca foot of the tamron g2 but i can buy a 3rd party one for the sigma for about 40€.\n\nthe tamron g2 is about 1100 with taxes in my country where i can get a sigma for 850 so quite a big difference. i'm not sure which one i should go for since they're both good, with the tamron having better features but also about 30% more expensive. \n\nthere's also a g1 version of the tamron but i heard it's catching a lot of dust inside. \n\nanyway what are your thoughts? :)", "sortedWord": "None", "identifyer": 43415, "year": "2021"}, {"Unnamed: 0": 296813, "autor": "LockyBalboaPrime", "date": 1633805230000, "content": "Amateur ability requiring professional quality -- what to buy [help me] /!/ Hello, thanks for helping...\n\nMy old job we had a professional photographer on staff and I was spoiled by him. Now in my new role, photography will fall on me and I've quickly found that I don't cut the mustard.\n\nI have a Canon EOS Rebel T6 DSLR Camera with EF-S 18-55mm f/3.5-5.6 is II Lens and EF 75-300mm f/4-5.6 III Lens kit I got a couple of years ago.\n\nI need to mostly take pictures of very close objects, product picture type pictures but without the lightbox normally. Field conditions normally, no ability to set up lighting or anything. The objects are very commonly black or dark colored or highly reflective, sometimes both at once. They range in size from 4feet wide to about 6 feet wide but also down to ~10mm square.\n\nI also need to be able to take pictures of objects far away (100-200 yards as a must  up to 900 yards would be nice). These will almost always be static and I can use a tripod.\n\nI'll also very commonly be in weird positions, like physically. Crouching oddly, leaning over or around things, trying to stay out of the way of things that can hurt me while also getting a good picture. \n\nThe main problem I'm having right now is the close objects and the weird positions. My Rebel T6 doesn't have a flip out view screen and I would really like to have one. Watching our old photographer it made such a difference being able to have that flexibility.\n\nThe past week I've been trying to do close up pictures of shiny objects about 0.75 x 0.3 inches big. A large part of my problem is not great lighting, but I also feel like I could be using a better lens or something to help make up for my lack of skill.\n\nThe reading I've done lately kind of points me to needing two cameras? One for the normal range pictures and then one super zoom for the long range? The long range pictures are less important but are also what I would like to take for hobby use too.\n\nBudget is &lt;1,000 to start, but I'd love some big boy options also just in case I can buy slowly or get my new job to spring for the costs.\n\nId like to stay with Canon simply because it's what I've been using both my camera and my old work camera. If there is a better option though I'll suck it up and learn something new.", "link": "https://www.reddit.com/r/canon/comments/q4rduo/amateur_ability_requiring_professional_quality/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "amateur ability requiring professional quality -- what to buy [help me] /!/ hello, thanks for helping...\n\nmy old job we had a professional photographer on staff and i was spoiled by him. now in my new role, photography will fall on me and i've quickly found that i don't cut the mustard.\n\ni have a canon eos rebel t6 dslr camera with ef-s 18-55mm f/3.5-5.6 is ii lens and ef 75-300mm f/4-5.6 iii lens kit i got a couple of years ago.\n\ni need to mostly take pictures of very close objects, product picture type pictures but without the lightbox normally. field conditions normally, no ability to set up lighting or anything. the objects are very commonly black or dark colored or highly reflective, sometimes both at once. they range in size from 4feet wide to about 6 feet wide but also down to ~10mm square.\n\ni also need to be able to take pictures of objects far away (100-200 yards as a must  up to 900 yards would be nice). these will almost always be static and i can use a tripod.\n\ni'll also very commonly be in weird -----> positions !!! , like physically. crouching oddly, leaning over or around things, trying to stay out of the way of things that can hurt me while also getting a good picture. \n\nthe main problem i'm having right now is the close objects and the weird positions. my rebel t6 doesn't have a flip out view screen and i would really like to have one. watching our old photographer it made such a difference being able to have that flexibility.\n\nthe past week i've been trying to do close up pictures of shiny objects about 0.75 x 0.3 inches big. a large part of my problem is not great lighting, but i also feel like i could be using a better lens or something to help make up for my lack of skill.\n\nthe reading i've done lately kind of points me to needing two cameras? one for the normal range pictures and then one super zoom for the long range? the long range pictures are less important but are also what i would like to take for hobby use too.\n\nbudget is &lt;1,000 to start, but i'd love some big boy options also just in case i can buy slowly or get my new job to spring for the costs.\n\nid like to stay with canon simply because it's what i've been using both my camera and my old work camera. if there is a better option though i'll suck it up and learn something new.", "sortedWord": "None", "identifyer": 43495, "year": "2021"}, {"Unnamed: 0": 296993, "autor": "ericode79", "date": 1634845401000, "content": "R6 vs R5, is the low light world's better? /!/ Hi Folks,\n\nI'm in a position where I'd like to upgrade from my 90D, and financially feel good about either investing in the R5 vs the R6.\n\nI'm liking what I've been seeing in reviews for both the R5 and R6, both being great options for both stills and videos.\n\nI also already have what I consider good glass (Sigma Art fanboy).\n\nI shoot portraits, landscapes, sports, and architecture.\n\nI'm no pro, but I am a big enthusiast.  \n\nWhile I'm seeing that both bodies are aimed at different audiences (Pro vs Pro-sumer/Semi Pro), I'd argue that both can be used in pro settings.\n\nThat said, I wouldn't mind investing in the R5 if that retains value/future proofs for a while.\n\nOne thing that always bothered me with my APS-C was the noise.  For the sake of getting a shot, I would always end up sacrificing IQ with noise.\n\nThe reviews indicate that the low light is better on the R6 than the R5 due to the low megapixel count.  \n\nHoping some folks can chime in **if the R6 low light performance is world's better, or marginally better**.  \n\nThanks all!", "link": "https://www.reddit.com/r/canon/comments/qczqtg/r6_vs_r5_is_the_low_light_worlds_better/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "r6 vs r5, is the low light world's better? /!/ hi folks,\n\ni'm in a -----> position !!!  where i'd like to upgrade from my 90d, and financially feel good about either investing in the r5 vs the r6.\n\ni'm liking what i've been seeing in reviews for both the r5 and r6, both being great options for both stills and videos.\n\ni also already have what i consider good glass (sigma art fanboy).\n\ni shoot portraits, landscapes, sports, and architecture.\n\ni'm no pro, but i am a big enthusiast.  \n\nwhile i'm seeing that both bodies are aimed at different audiences (pro vs pro-sumer/semi pro), i'd argue that both can be used in pro settings.\n\nthat said, i wouldn't mind investing in the r5 if that retains value/future proofs for a while.\n\none thing that always bothered me with my aps-c was the noise.  for the sake of getting a shot, i would always end up sacrificing iq with noise.\n\nthe reviews indicate that the low light is better on the r6 than the r5 due to the low megapixel count.  \n\nhoping some folks can chime in **if the r6 low light performance is world's better, or marginally better**.  \n\nthanks all!", "sortedWord": "None", "identifyer": 43679, "year": "2021"}, {"Unnamed: 0": 297864, "autor": "EggPoachay", "date": 1628259681000, "content": "Lens stuck on body /!/ Hi all!\n\nI’m new to this sub so hope I’m not breaking any rules. \n\nLooking for any advice on how to get a stuck lens off a camera body?\n\nI put my 200mm lens on my SOs EOS 60D, and now can’t get it off. I’m about to go on safari and would love to be able to use the 200mm lens! It’s now not communicating with the camera body either.\n\nIt’s been used in a salty environment and I did notice the pin and metal ring on the camera body were slightly rusty. It’s my fault I didn’t clean them first.. but yeah if anyone has any dos and donts (I’m considering spraying it with a tiny amount of lube or WD40..) so far I’ve held it in every possible position, shaken it, gently hit it against the table.. open to any suggestions!", "link": "https://www.reddit.com/r/canon/comments/oz7ljk/lens_stuck_on_body/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens stuck on body /!/ hi all!\n\ni’m new to this sub so hope i’m not breaking any rules. \n\nlooking for any advice on how to get a stuck lens off a camera body?\n\ni put my 200mm lens on my sos eos 60d, and now can’t get it off. i’m about to go on safari and would love to be able to use the 200mm lens! it’s now not communicating with the camera body either.\n\nit’s been used in a salty environment and i did notice the pin and metal ring on the camera body were slightly rusty. it’s my fault i didn’t clean them first.. but yeah if anyone has any dos and donts (i’m considering spraying it with a tiny amount of lube or wd40..) so far i’ve held it in every possible -----> position !!! , shaken it, gently hit it against the table.. open to any suggestions!", "sortedWord": "None", "identifyer": 44570, "year": "2021"}, {"Unnamed: 0": 297965, "autor": "orion_angelfire", "date": 1630522751000, "content": "Remote control for video focusing with Rebel T3i? /!/ I'm looking for a remote control or shutter release that I can use with my Rebel T3i. I'm specifically looking for something that will allow me to **focus remotely while recording video**. \n\nI'm primarily using the camera for focusing on me when I record videos. I'm in a sitting position. I don't want to use the option that refocuses while I'm filming, as it tends to go in and out of focus. I'd like to set the camera up at a distance and use the remote to focus on my face. \n\nI can't use the Canon Connect app as my camera is not compatible. I've not been able to tell if the official Canon remote allows this focusing capability or if it's just to start/stop recording (or photos). Any recommendations?", "link": "https://www.reddit.com/r/canon/comments/pg0jfc/remote_control_for_video_focusing_with_rebel_t3i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "remote control for video focusing with rebel t3i? /!/ i'm looking for a remote control or shutter release that i can use with my rebel t3i. i'm specifically looking for something that will allow me to **focus remotely while recording video**. \n\ni'm primarily using the camera for focusing on me when i record videos. i'm in a sitting -----> position !!! . i don't want to use the option that refocuses while i'm filming, as it tends to go in and out of focus. i'd like to set the camera up at a distance and use the remote to focus on my face. \n\ni can't use the canon connect app as my camera is not compatible. i've not been able to tell if the official canon remote allows this focusing capability or if it's just to start/stop recording (or photos). any recommendations?", "sortedWord": "None", "identifyer": 44672, "year": "2021"}], "name": "positioncanon2021"}