{"interestingcomments": [{"Unnamed: 0": 53686, "autor": "mumle", "date": 1552077504000, "content": "Filter and step up rings? /!/ Im in a position where I need a ND-filter and have a plural of lenses. Are there a downside to buy multiple adapters (kits on amazon) or finding one that fit (and then have one per lens).\n\nJust to clearify, my plan is to buy one 72mm ND-pack and then either 5 specific adapters or a bundle with multiple in them (which is cheaper)", "link": "https://www.reddit.com/r/canon/comments/ayv0sq/filter_and_step_up_rings/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "filter and step up rings? /!/ im in a -----> position !!!  where i need a nd-filter and have a plural of lenses. are there a downside to buy multiple adapters (kits on amazon) or finding one that fit (and then have one per lens).\n\njust to clearify, my plan is to buy one 72mm nd-pack and then either 5 specific adapters or a bundle with multiple in them (which is cheaper)", "sortedWord": "None", "identifyer": 55067, "year": "2019"}, {"Unnamed: 0": 53838, "autor": "LordBommo", "date": 1549171318000, "content": "Halp! My camera is skipping dial positions!", "link": "https://www.reddit.com/r/canon/comments/ammoi5/halp_my_camera_is_skipping_dial_positions/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "halp! my camera is skipping dial -----> positions !!! !", "sortedWord": "None", "identifyer": 55219, "year": "2019"}, {"Unnamed: 0": 53850, "autor": "greeeeenski", "date": 1549089153000, "content": "Photographer Wedding attire. /!/ So I am going to start my adventures into wedding photography once the snow is clearing, My question is. What are some good shoes clothes ect; I need for shooting a wedding. Because every time I've gone to a wedding as a none photographer my dress clothes are nice but my shirt always comes un-tucked when sitting down  and can't keep it in place. When i'm on a shoot i'm always getting in outrageous  positions with my body to get the shot and the last thing I want when doing a wedding shoot is for my short to fly out of place or god forbid my pants rip lol. Should I use suspenders? what kind of shoes that are comfy but also classy? Any help or recommendations  would be appreciated, Thanks!   ", "link": "https://www.reddit.com/r/canon/comments/amblx7/photographer_wedding_attire/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "photographer wedding attire. /!/ so i am going to start my adventures into wedding photography once the snow is clearing, my question is. what are some good shoes clothes ect; i need for shooting a wedding. because every time i've gone to a wedding as a none photographer my dress clothes are nice but my shirt always comes un-tucked when sitting down  and can't keep it in place. when i'm on a shoot i'm always getting in outrageous  -----> positions !!!  with my body to get the shot and the last thing i want when doing a wedding shoot is for my short to fly out of place or god forbid my pants rip lol. should i use suspenders? what kind of shoes that are comfy but also classy? any help or recommendations  would be appreciated, thanks!   ", "sortedWord": "None", "identifyer": 55231, "year": "2019"}, {"Unnamed: 0": 54117, "autor": "webwhizkid", "date": 1564975174000, "content": "Canon doesn't repair my EF 50mm lens with same issue as in Service Advisory /!/ Hi All,\n\nJust checking if someone has a similar experience.  Thanks in Advance. \n\nI bought Canon EF 50mm f/1.4 USM Refurb lens from Canon eStore.  I haven't used the lens for almost over year as it had focus issue and just recently noticed - it has the same issue as in the service advisory issued for that exact model.  They sent two emails to me - 'Service Notice: EF 50mm f/1.4 USM' on Sep 7, 2017, and another 'EF 50mm f/1.4 USM: Additional serial numbers may be affected' on Sep 22, 2017.  \n\nThe first email restricts the issue to few serial numbers and the second one expands it further and the link in email doesn't show more details. Interesting my lens serial number doesn't really fall into the expected serial numbers for that model - is it because it's refurb?  I have asked the customer care twice that they should repair it free of charge and forwarded them emails but they just blindly ask me to pay 210 and I can't directly talk to repair team as well.\n\nService Advisory Issue ( same issue with my lens ) - While in AF or MF mode, when the focus position is moved from the infinity end to the close-up end, the focus operation stops near the area shown in the dotted circle below.", "link": "https://www.reddit.com/r/canon/comments/cm5mxe/canon_doesnt_repair_my_ef_50mm_lens_with_same/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon doesn't repair my ef 50mm lens with same issue as in service advisory /!/ hi all,\n\njust checking if someone has a similar experience.  thanks in advance. \n\ni bought canon ef 50mm f/1.4 usm refurb lens from canon estore.  i haven't used the lens for almost over year as it had focus issue and just recently noticed - it has the same issue as in the service advisory issued for that exact model.  they sent two emails to me - 'service notice: ef 50mm f/1.4 usm' on sep 7, 2017, and another 'ef 50mm f/1.4 usm: additional serial numbers may be affected' on sep 22, 2017.  \n\nthe first email restricts the issue to few serial numbers and the second one expands it further and the link in email doesn't show more details. interesting my lens serial number doesn't really fall into the expected serial numbers for that model - is it because it's refurb?  i have asked the customer care twice that they should repair it free of charge and forwarded them emails but they just blindly ask me to pay 210 and i can't directly talk to repair team as well.\n\nservice advisory issue ( same issue with my lens ) - while in af or mf mode, when the focus -----> position !!!  is moved from the infinity end to the close-up end, the focus operation stops near the area shown in the dotted circle below.", "sortedWord": "None", "identifyer": 55499, "year": "2019"}, {"Unnamed: 0": 54170, "autor": "Zending", "date": 1564536505000, "content": "PSA - If you're charging your camera batteries, put the camera in an unusual position with the battery door open. That way you'll notice it, and not leave the house for a paid photoshoot without a battery! Don't ask why I started doing this!", "link": "https://www.reddit.com/r/canon/comments/ck1f3a/psa_if_youre_charging_your_camera_batteries_put/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "psa - if you're charging your camera batteries, put the camera in an unusual -----> position !!!  with the battery door open. that way you'll notice it, and not leave the house for a paid photoshoot without a battery! don't ask why i started doing this!", "sortedWord": "None", "identifyer": 55552, "year": "2019"}, {"Unnamed: 0": 54655, "autor": "labrechemode", "date": 1551648556000, "content": "Buying used while remaining relevant and eligible for CPS /!/ I'm looking to buy a boatload of gear to supplement a new sports photog position and want to stay relatively economical.  \n\nI need a 400mm 2.8 and have been looking at the 400 2.8 IS ii (V2) but don't want to rule out the NON-IS or the IS i (V1).\n\nI realize if I go with V1 or the non IS I may not qualify for CPS for those versions.\n\n   \\-What are your opinions on the non IS and the V1s?\n\n   \\-Is a used non-IS for $2-4k worth foregoing CPS eligibility?\n\nI'm also wondering about the real-world comparison between the 1DX and the 1DXii...\n\nAny and all help appreciated", "link": "https://www.reddit.com/r/canon/comments/awytqr/buying_used_while_remaining_relevant_and_eligible/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "buying used while remaining relevant and eligible for cps /!/ i'm looking to buy a boatload of gear to supplement a new sports photog -----> position !!!  and want to stay relatively economical.  \n\ni need a 400mm 2.8 and have been looking at the 400 2.8 is ii (v2) but don't want to rule out the non-is or the is i (v1).\n\ni realize if i go with v1 or the non is i may not qualify for cps for those versions.\n\n   \\-what are your opinions on the non is and the v1s?\n\n   \\-is a used non-is for $2-4k worth foregoing cps eligibility?\n\ni'm also wondering about the real-world comparison between the 1dx and the 1dxii...\n\nany and all help appreciated", "sortedWord": "None", "identifyer": 56043, "year": "2019"}, {"Unnamed: 0": 55108, "autor": "mrterminus", "date": 1548628582000, "content": "In built Flash of my 200D just stopped working /!/ Hey,\n\nI brought the camera ( 200D / SL2) around 2 weeks ago . Everything was going smooth until I was out and shooting some pictures . After 1400 pictures in total the flash stopped working ( manual mode , flash in upwards position) . It only fires sometimes , so the bulb isn’t broken , but It’s just 1 out of 5 pictures where the flash works . \n\nTried everything from factory reset , fully charged batteries , power reset .\n\nAlso flash pops put when in auto mode , so no button jammed.\n\nNow before I sent it in to canon customer support I wanted to be sure not to have missed a obvious thing like \"hey press this 2 buttons and it will work again \"\n\nThank you very much in advance \n\nMrterminus", "link": "https://www.reddit.com/r/canon/comments/akgp9y/in_built_flash_of_my_200d_just_stopped_working/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "in built flash of my 200d just stopped working /!/ hey,\n\ni brought the camera ( 200d / sl2) around 2 weeks ago . everything was going smooth until i was out and shooting some pictures . after 1400 pictures in total the flash stopped working ( manual mode , flash in upwards -----> position !!! ) . it only fires sometimes , so the bulb isn’t broken , but it’s just 1 out of 5 pictures where the flash works . \n\ntried everything from factory reset , fully charged batteries , power reset .\n\nalso flash pops put when in auto mode , so no button jammed.\n\nnow before i sent it in to canon customer support i wanted to be sure not to have missed a obvious thing like \"hey press this 2 buttons and it will work again \"\n\nthank you very much in advance \n\nmrterminus", "sortedWord": "None", "identifyer": 56498, "year": "2019"}, {"Unnamed: 0": 56663, "autor": "londonbairn", "date": 1550821219000, "content": "400mm f2.8 IS II /!/ I used to own this wonderful lens, and to be honest, it was a luxury lens for me (didn’t get constant use). I sold it as at the time I was buying a house and needed funds. Funnily enough I sold it for more than what I bought it for.\n\nAnyway, fast forward 7 years and I have been offered one for a price I would say is below market (PX price basically) which is pristine with everything included. I wouldn’t lose much (if anything) if I had buyers regret on resale either.\n\nWhat’s holding me back is the logic that I don’t really need it (I’m not a primary sports or nature shooter anymore, but I would make use of this, for example next week I’m shooting for a friend at Silverstone). However I am in a position I can get it, plus I’m sure I can resell if needed without much hit.\n\nDoes anyone see the residuals dropping on this lens? I haven’t seen them drop at all even with the III out, plus with Brexit here in UK I guess they will get even more expensive..", "link": "https://www.reddit.com/r/canon/comments/atepw6/400mm_f28_is_ii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "400mm f2.8 is ii /!/ i used to own this wonderful lens, and to be honest, it was a luxury lens for me (didn’t get constant use). i sold it as at the time i was buying a house and needed funds. funnily enough i sold it for more than what i bought it for.\n\nanyway, fast forward 7 years and i have been offered one for a price i would say is below market (px price basically) which is pristine with everything included. i wouldn’t lose much (if anything) if i had buyers regret on resale either.\n\nwhat’s holding me back is the logic that i don’t really need it (i’m not a primary sports or nature shooter anymore, but i would make use of this, for example next week i’m shooting for a friend at silverstone). however i am in a -----> position !!!  i can get it, plus i’m sure i can resell if needed without much hit.\n\ndoes anyone see the residuals dropping on this lens? i haven’t seen them drop at all even with the iii out, plus with brexit here in uk i guess they will get even more expensive..", "sortedWord": "None", "identifyer": 58069, "year": "2019"}, {"Unnamed: 0": 56951, "autor": "10tomas10", "date": 1546391464000, "content": "Hi, my Canon 50mm 1.4/f lens got hit and doesn’t focus not on AF or MF mode. The ring moves, but it makes no change. Does anybody know what the problem is, and how much it can cost to fix it? (I can still take pictures, the focus is locked on that position, and diaphragm is okay)", "link": "https://www.reddit.com/r/canon/comments/abo7x7/hi_my_canon_50mm_14f_lens_got_hit_and_doesnt/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi, my canon 50mm 1.4/f lens got hit and doesn’t focus not on af or mf mode. the ring moves, but it makes no change. does anybody know what the problem is, and how much it can cost to fix it? (i can still take pictures, the focus is locked on that -----> position !!! , and diaphragm is okay)", "sortedWord": "None", "identifyer": 58359, "year": "2019"}, {"Unnamed: 0": 56960, "autor": "DoritoCookie", "date": 1546343329000, "content": "Will putting a battery into the camera while the switch is in \"ON\" position cause damage or complete failure /!/ As title mentions\n\n&amp;#x200B;\n\nAnyone with experience care to comment?", "link": "https://www.reddit.com/r/canon/comments/abhmwt/will_putting_a_battery_into_the_camera_while_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "will putting a battery into the camera while the switch is in \"on\" -----> position !!!  cause damage or complete failure /!/ as title mentions\n\n&amp;#x200b;\n\nanyone with experience care to comment?", "sortedWord": "None", "identifyer": 58368, "year": "2019"}, {"Unnamed: 0": 57678, "autor": "can2xfour", "date": 1549562898000, "content": "Noob Q: Green lights at bottom when looking through viewfinder? /!/ Hello, how is it going?  \n\n  \n\n  \n\nI just bought a Canon SL2, my first camera.   \n\nCouldn't find a thread regarding my questions but I guess it's very basic.  \n\n  \n\n**When I press the shutter release button and look through the viewfinder a couple of rectangle shaped lights appear at the bottom.**  \n\n**The green lights are not in the final image. They're only visible inside the optical viewfinder.**  \n\n  \n\nI was wondering if this is normal or if sth. is maybe broken?  \n\n  \n\nCould've sworn that the first dozen shots I took did not have these lights in the viewfinder.  \n\n  \n\nI accidently knee kicked the zoomed out lense while changing some settings and getting into position simultaneously.  \n\nAnd then I noticed these lights. Now I don't know if I damaged it or if that is completely normal.  \n\n  \n\nThanks in advance.", "link": "https://www.reddit.com/r/canon/comments/ao6klq/noob_q_green_lights_at_bottom_when_looking/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "noob q: green lights at bottom when looking through viewfinder? /!/ hello, how is it going?  \n\n  \n\n  \n\ni just bought a canon sl2, my first camera.   \n\ncouldn't find a thread regarding my questions but i guess it's very basic.  \n\n  \n\n**when i press the shutter release button and look through the viewfinder a couple of rectangle shaped lights appear at the bottom.**  \n\n**the green lights are not in the final image. they're only visible inside the optical viewfinder.**  \n\n  \n\ni was wondering if this is normal or if sth. is maybe broken?  \n\n  \n\ncould've sworn that the first dozen shots i took did not have these lights in the viewfinder.  \n\n  \n\ni accidently knee kicked the zoomed out lense while changing some settings and getting into -----> position !!!  simultaneously.  \n\nand then i noticed these lights. now i don't know if i damaged it or if that is completely normal.  \n\n  \n\nthanks in advance.", "sortedWord": "None", "identifyer": 59093, "year": "2019"}], "name": "positioncanon2019"}