{"interestingcomments": [{"autor": "dubiousadvocate", "date": "2020-12-28 00:19:54", "content": "PC based complete T7i control /!/ I'm a PC person. I get that the camera world is device/engineer based. To me a camera is just another peripheral.\n\nI would like a way to completely expose my Canon T7i 800D to my PC. Anything I can do with the device I can do in software.\n\nMy main use case. I want to schedule long term exposures, what's thought of as time exposure but I don't want a movie. I need to capture targets and schedule them for very fast shots on a turntable. Photogrammetry, leading to 3D printed outputs.\n\nI've looked at intervalometers. As a software guy I'm appalled at how many specialty hardware devices to do something so basic absolutely must be still another specialty device.\n\nI looked at Neewer and other such. Is there not a simple way I can completely configure my camera from a PC-based UI? I mean everything, not basic image transfer or gross manual snap. Thx folks.", "link": "https://www.reddit.com/r/canon/comments/klez66/pc_based_complete_t7i_control/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "pc based complete t7i control /!/ i'm a pc person. i get that the camera world is device/engineer based. to me a camera is just another peripheral.\n\ni would like a way to completely expose my canon t7i 800d to my pc. anything i can do with the device i can do in software.\n\nmy main use case. i want to schedule long term exposures, what's thought of as time exposure but i don't want a movie. i need to capture targets and schedule them for very fast shots on a turntable. photogrammetry, leading to -----> 3d !!!  -----> printed !!!  outputs.\n\ni've looked at intervalometers. as a software guy i'm appalled at how many specialty hardware devices to do something so basic absolutely must be still another specialty device.\n\ni looked at neewer and other such. is there not a simple way i can completely configure my camera from a pc-based ui? i mean everything, not basic image transfer or gross manual snap. thx folks.", "sortedWord": "None", "Identifyer": null, "identifyer": 45676, "year": "2020"}, {"autor": "Whomstevest", "date": "2020-10-12 12:39:40", "content": "3d Printed Canon RF to EF tilt adapter", "link": "https://www.reddit.com/r/canon/comments/j9q4ul/3d_printed_canon_rf_to_ef_tilt_adapter/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  canon rf to ef tilt adapter", "sortedWord": "None", "Identifyer": null, "identifyer": 47207, "year": "2020"}, {"autor": "wintereater", "date": "2020-07-04 23:24:48", "content": "Has anyone used Custom Battery Grip's products? /!/ I'm looking into something that will increase the size of the grip of my M6 Mark II, and it looks like there are really only two options: a SmallRig cage (or a knockoff), or an extension/battery grip by Custom Battery Grip.\n\nI have used a SmallRig cage before back when I owned an M5, and while I did like added grip bulk and the built in arca-swiss dovetail, I found it a bit heavy and slippery since it was made of a smooth metal.\n\nThe Custom Battery Grip options look to offer a better grip since it has grooves for your fingers, plus it appears to be slightly textured, but I'm concerned about it's durability since it looks to be 3D printed, and whether or not it will stay locked in place, especially since I use heavy lenses. I don't see many reviews for their products (makes sense, since they're a new company).", "link": "https://www.reddit.com/r/canon/comments/hlctly/has_anyone_used_custom_battery_grips_products/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "has anyone used custom battery grip's products? /!/ i'm looking into something that will increase the size of the grip of my m6 mark ii, and it looks like there are really only two options: a smallrig cage (or a knockoff), or an extension/battery grip by custom battery grip.\n\ni have used a smallrig cage before back when i owned an m5, and while i did like added grip bulk and the built in arca-swiss dovetail, i found it a bit heavy and slippery since it was made of a smooth metal.\n\nthe custom battery grip options look to offer a better grip since it has grooves for your fingers, plus it appears to be slightly textured, but i'm concerned about it's durability since it looks to be -----> 3d !!!  -----> printed !!! , and whether or not it will stay locked in place, especially since i use heavy lenses. i don't see many reviews for their products (makes sense, since they're a new company).", "sortedWord": "None", "Identifyer": null, "identifyer": 48543, "year": "2020"}, {"autor": "Spirit-S65", "date": "2020-08-12 02:25:25", "content": "Are grips for a T6 worth it? /!/ I find my T6 kind of akward to hold, are there any third party battery grips that are good? Any company that 3d prints any?", "link": "https://www.reddit.com/r/canon/comments/i85h28/are_grips_for_a_t6_worth_it/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d prints", "selectorShort": "print", "MarkedSent": "are grips for a t6 worth it? /!/ i find my t6 kind of akward to hold, are there any third party battery grips that are good? any company that -----> 3d !!!  -----> prints !!!  any?", "sortedWord": "None", "Identifyer": null, "identifyer": 48878, "year": "2020"}, {"autor": "Prolific-Polymath", "date": "2020-09-14 18:34:55", "content": "Recommendations for FD to EF adapter? /!/ I've always avoided adapters because I recall \"horror stories\" from years back about many of them being of poor quality and causing issues (light leak being the biggest complaint, as I recall).\n\nBut given that it's 2020 and I've never bought one, I thought I'd reach out to see if anyone here has a recommendation for a good/reliable one for adapting FD glass to en EF mount.\n\nI'm not concerned with using the adapter on a DSLR of any model, as it would *only* be used to mount 80s-era FD lenses to either an EOS-3 or EOS-1V 35mm body.\n\nI've heard that there may be 3D printed solutions, I'd be interested in hearing about those as well as anything else.", "link": "https://www.reddit.com/r/canon/comments/isqy2t/recommendations_for_fd_to_ef_adapter/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "recommendations for fd to ef adapter? /!/ i've always avoided adapters because i recall \"horror stories\" from years back about many of them being of poor quality and causing issues (light leak being the biggest complaint, as i recall).\n\nbut given that it's 2020 and i've never bought one, i thought i'd reach out to see if anyone here has a recommendation for a good/reliable one for adapting fd glass to en ef mount.\n\ni'm not concerned with using the adapter on a dslr of any model, as it would *only* be used to mount 80s-era fd lenses to either an eos-3 or eos-1v 35mm body.\n\ni've heard that there may be -----> 3d !!!  -----> printed !!!  solutions, i'd be interested in hearing about those as well as anything else.", "sortedWord": "None", "Identifyer": null, "identifyer": 49343, "year": "2020"}, {"autor": "wiptheman", "date": "2020-11-04 12:48:24", "content": "3D printed lens hood for RF 35mm", "link": "https://www.reddit.com/r/canon/comments/jnw3kw/3d_printed_lens_hood_for_rf_35mm/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "-----> 3d !!!  -----> printed !!!  lens hood for rf 35mm", "sortedWord": "None", "Identifyer": null, "identifyer": 49836, "year": "2020"}], "name": "printcanon2020"}