{"interestingcomments": [{"Unnamed: 0": 131133, "autor": "jotunck", "date": 1517279001000, "content": "Best way to set up a photobooth? /!/ Friend asked me to set up and man a photobooth for his wedding...\n\nIs there a way to hook up my camera so that I can shoot tethered, and have the shot automatically go into photoshop, in a layer behind a graphics overlay and ready to print? There will be an endless stream of guests who will be expecting to collect a printout of their shot (1 printout per guest in the photo) on the spot.\n\nCurrently all I've managed to rig together is to tether my camera to my laptop, shoot using Canon EOS Utility, then manually dragging the shot into an already-opened PSD file of the overlay, dragging the new shot's layer behind the overlay, then printing it. But... that seems like it's going to take too long.\n\nPrinter's not going to be the bottleneck since my friend will be renting one of those photo printers that can spit out prints real fast.\n\nAny help will be appreciated!", "link": "https://www.reddit.com/r/canon/comments/7txq5m/best_way_to_set_up_a_photobooth/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best way to set up a photobooth? /!/ friend asked me to set up and man a photobooth for his wedding...\n\nis there a way to hook up my camera so that i can shoot tethered, and have the shot automatically go into photoshop, in a layer behind a graphics overlay and ready to print? there will be an endless stream of guests who will be expecting to collect a printout of their shot (1 printout per guest in the photo) on the -----> spot !!! .\n\ncurrently all i've managed to rig together is to tether my camera to my laptop, shoot using canon eos utility, then manually dragging the shot into an already-opened psd file of the overlay, dragging the new shot's layer behind the overlay, then printing it. but... that seems like it's going to take too long.\n\nprinter's not going to be the bottleneck since my friend will be renting one of those photo printers that can spit out prints real fast.\n\nany help will be appreciated!", "sortedWord": "None", "identifyer": 21849, "year": "2018"}, {"Unnamed: 0": 131152, "autor": "luismol28799", "date": 1517012368000, "content": "Doubts on the Rebel SL2/200D? /!/ Hey guys I just wanted to ask you if the Rebel SL2/200D has the option to record full manual video, if it has a microphone jack and If I can see how the photo will end up in Live View mode. I'm thinking on buying it for college because I have seen it has good imaging, good specs and it is not expensive as a 77D.\n\nPd. Do you recommend me any tele lens? I also make some plane spotting sometimes and I need a good inexpensive tele.", "link": "https://www.reddit.com/r/canon/comments/7t8yc9/doubts_on_the_rebel_sl2200d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "doubts on the rebel sl2/200d? /!/ hey guys i just wanted to ask you if the rebel sl2/200d has the option to record full manual video, if it has a microphone jack and if i can see how the photo will end up in live view mode. i'm thinking on buying it for college because i have seen it has good imaging, good specs and it is not expensive as a 77d.\n\npd. do you recommend me any tele lens? i also make some plane -----> spotting !!!  sometimes and i need a good inexpensive tele.", "sortedWord": "None", "identifyer": 21868, "year": "2018"}, {"Unnamed: 0": 131344, "autor": "pictorlumen", "date": 1523230371000, "content": "Using a Canon 5d M3 with an old 35mm canon lens in rain /!/ I’ve started spotting more and more out in the rain given it’s been so rainy lately. I do my best to protect my equipment but I wanted to know if the 5D M3 is weather sealed?\n\nIf I assume for discussion that the body is weather sealed and I use a cheap 35mm canon lens vs one of my zoom L lens does that risk damage to the body if I get caught in the rain?", "link": "https://www.reddit.com/r/canon/comments/8au1gc/using_a_canon_5d_m3_with_an_old_35mm_canon_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "using a canon 5d m3 with an old 35mm canon lens in rain /!/ i’ve started -----> spotting !!!  more and more out in the rain given it’s been so rainy lately. i do my best to protect my equipment but i wanted to know if the 5d m3 is weather sealed?\n\nif i assume for discussion that the body is weather sealed and i use a cheap 35mm canon lens vs one of my zoom l lens does that risk damage to the body if i get caught in the rain?", "sortedWord": "None", "identifyer": 22061, "year": "2018"}, {"Unnamed: 0": 131374, "autor": "Dreav3r", "date": 1522907797000, "content": "Camera lens zoom broke during traveling: advice? /!/ Hi Reddit,\n\nI am traveling through Asia for 8 months. I still have like 3 months to go. Sadly, my 15-85mm lens broke down yesterday. The zooming ring was very stiff for a while, like there was sand in between. Yesterday, it totally broke down: if I rotate the \"rotation part\", my lens won't even zoom anymore, also the focus motor seems to have a lot of trouble, since the zooming part is broken it can't find \"the right focus spot\". Anyway, I'll be flying to Kuala Lumpur on Saturday, praying to find a store that can repair it (I have my doubts though, I think it might be too broken.. and I can't send it to Canon for repairs since I am moving around),.. which would really suck since I paid 650 euro for it a bit more then 2 years ago...\n\nI need to have a back-up plan: I will need a another lens, preferably with a similar zoom range (15-85~) just for this trip. The only other lens I brought is a 50mm 1.8, but I have been using the 15-85 99% this trip. I want to photograph landscapes and people / animals (zoom). I would rather just buy a cheap(er) lens (preferably not much more then 100 euro, but I might be very unrealistic here), since I will probably upgrade my whole camera soon anyway, so I just want a replacement for these months. Should I just buy a Canon kit lens 15-55mm? I have this at home too) Is this the cheapest - decent all round - solution? Or other tips/brands (Sigma)?\n\nI don't want to buy a new 15-85 since a) I don't want to spend such a huge amount and b) I might upgrade to a full frame in the future (and it won't work on that I think). \n\nI don't know what to do... Maybe you guys can give me some advice what you would do or buy? \n\nI have a Canon 550D (Rebel t2i).\n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/89xabr/camera_lens_zoom_broke_during_traveling_advice/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera lens zoom broke during traveling: advice? /!/ hi reddit,\n\ni am traveling through asia for 8 months. i still have like 3 months to go. sadly, my 15-85mm lens broke down yesterday. the zooming ring was very stiff for a while, like there was sand in between. yesterday, it totally broke down: if i rotate the \"rotation part\", my lens won't even zoom anymore, also the focus motor seems to have a lot of trouble, since the zooming part is broken it can't find \"the right focus -----> spot !!! \". anyway, i'll be flying to kuala lumpur on saturday, praying to find a store that can repair it (i have my doubts though, i think it might be too broken.. and i can't send it to canon for repairs since i am moving around),.. which would really suck since i paid 650 euro for it a bit more then 2 years ago...\n\ni need to have a back-up plan: i will need a another lens, preferably with a similar zoom range (15-85~) just for this trip. the only other lens i brought is a 50mm 1.8, but i have been using the 15-85 99% this trip. i want to photograph landscapes and people / animals (zoom). i would rather just buy a cheap(er) lens (preferably not much more then 100 euro, but i might be very unrealistic here), since i will probably upgrade my whole camera soon anyway, so i just want a replacement for these months. should i just buy a canon kit lens 15-55mm? i have this at home too) is this the cheapest - decent all round - solution? or other tips/brands (sigma)?\n\ni don't want to buy a new 15-85 since a) i don't want to spend such a huge amount and b) i might upgrade to a full frame in the future (and it won't work on that i think). \n\ni don't know what to do... maybe you guys can give me some advice what you would do or buy? \n\ni have a canon 550d (rebel t2i).\n\nthanks!", "sortedWord": "None", "identifyer": 22091, "year": "2018"}, {"Unnamed: 0": 131382, "autor": "J9XXX", "date": 1527275764000, "content": "SL2/200D Focusing Issues Relative to SL1/100D /!/ I just got the SL2 and have been shooting a lot with it over the past few days. I have to say, I'm very disappointed. I am using the 35mm f/2 IS and a LOT of shots are just way out of focus. When I use live view, the problem goes away. I did not have this issue with the SL1. It focuses spot on every time using the optical viewfinder. Note that I bought both refurbished through Canon.\n\nIs anyone else having a problem with this combo? Did they purposely handicap the SL2's ability to focus well with high-end cameras like the 35mm f/2 IS? It's not as significant of an issue on other lenses like the 50mm f/1.8. Odd.\n\nI called Canon about this issue. Tech support said I could send it in with the lens and possibly have it calibrated for a LOT of money. I asked how much and he couldn't say. Over a $100? Definitely. They only offered to refund it.\n\nI was so excited about getting the SL2. I have the SL1 and the 80D. I was planning on selling the 80D due to it's bulkiness, but it looks like I'll be holding on to it a bit longer.", "link": "https://www.reddit.com/r/canon/comments/8m4cq2/sl2200d_focusing_issues_relative_to_sl1100d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sl2/200d focusing issues relative to sl1/100d /!/ i just got the sl2 and have been shooting a lot with it over the past few days. i have to say, i'm very disappointed. i am using the 35mm f/2 is and a lot of shots are just way out of focus. when i use live view, the problem goes away. i did not have this issue with the sl1. it focuses -----> spot !!!  on every time using the optical viewfinder. note that i bought both refurbished through canon.\n\nis anyone else having a problem with this combo? did they purposely handicap the sl2's ability to focus well with high-end cameras like the 35mm f/2 is? it's not as significant of an issue on other lenses like the 50mm f/1.8. odd.\n\ni called canon about this issue. tech support said i could send it in with the lens and possibly have it calibrated for a lot of money. i asked how much and he couldn't say. over a $100? definitely. they only offered to refund it.\n\ni was so excited about getting the sl2. i have the sl1 and the 80d. i was planning on selling the 80d due to it's bulkiness, but it looks like i'll be holding on to it a bit longer.", "sortedWord": "None", "identifyer": 22099, "year": "2018"}, {"Unnamed: 0": 131404, "autor": "LightBoi1", "date": 1527040258000, "content": "Help with EOS Rebel T5 /!/ Hey all, \n\nRecently I went on a trip to Japan where I noticed spots in some of my picture. (Links at the bottom) When I returned I cleaned my lenses to the best of my ability with a lens cleaner and one of those air pumps. I have a trip coming up in July and would like to get this problems figured out beforehand. Any advice on how to remove these spots would be greatly appreciated. Thanks in advance.\n\nLinks to Photos:\n\nhttps://i.imgur.com/MPR0mGo.jpg\n\nhttps://i.imgur.com/AHXiS8C.jpg", "link": "https://www.reddit.com/r/canon/comments/8lflhk/help_with_eos_rebel_t5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help with eos rebel t5 /!/ hey all, \n\nrecently i went on a trip to japan where i noticed -----> spots !!!  in some of my picture. (links at the bottom) when i returned i cleaned my lenses to the best of my ability with a lens cleaner and one of those air pumps. i have a trip coming up in july and would like to get this problems figured out beforehand. any advice on how to remove these spots would be greatly appreciated. thanks in advance.\n\nlinks to photos:\n\nhttps://i.imgur.com/mpr0mgo.jpg\n\nhttps://i.imgur.com/ahxis8c.jpg", "sortedWord": "None", "identifyer": 22121, "year": "2018"}, {"Unnamed: 0": 131522, "autor": "FloydCooper", "date": 1529937897000, "content": "Tamron SP 24-70mm 2.8 G2 over Canon 24-70mm 2.8? /!/ Hi everybody,\n\nI just made the jump to a FF-camera (Canon 6D MK2) and need to add a 24-70mm lens to my collection.\n\n  \nI need one that is weatherproofed because I will be photographing a lot in the Swedish mountains. I had my mind set on the Canon 24-70mm 2.8 but after doing some research on the competition, why should I buy the Canon lens? In some cases it is more than double the price in regards to the Tamron, Tokina and Sigma equivalents.\n\nSo how to justify buying a L-lens over the Tamron SP 24-70mm F/2.8 Di VC USD G2?\n\nThe Tamron hits all the spots and with their new design approach looks awesome as well. \n\nSo what I'm asking is that if there is anyone out there with real world experience/usage of the Tamron SP 24-70mm F/2.8 Di VC USD G2 perhaps also the Canon 24-70? Or maybe the Tokina or Sigma, I don't know! I just need help to make up my mind :)\n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/8tr2cr/tamron_sp_2470mm_28_g2_over_canon_2470mm_28/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "tamron sp 24-70mm 2.8 g2 over canon 24-70mm 2.8? /!/ hi everybody,\n\ni just made the jump to a ff-camera (canon 6d mk2) and need to add a 24-70mm lens to my collection.\n\n  \ni need one that is weatherproofed because i will be photographing a lot in the swedish mountains. i had my mind set on the canon 24-70mm 2.8 but after doing some research on the competition, why should i buy the canon lens? in some cases it is more than double the price in regards to the tamron, tokina and sigma equivalents.\n\nso how to justify buying a l-lens over the tamron sp 24-70mm f/2.8 di vc usd g2?\n\nthe tamron hits all the -----> spots !!!  and with their new design approach looks awesome as well. \n\nso what i'm asking is that if there is anyone out there with real world experience/usage of the tamron sp 24-70mm f/2.8 di vc usd g2 perhaps also the canon 24-70? or maybe the tokina or sigma, i don't know! i just need help to make up my mind :)\n\nthanks!", "sortedWord": "None", "identifyer": 22239, "year": "2018"}, {"Unnamed: 0": 131671, "autor": "dwbusey", "date": 1532536992000, "content": "Touch up paint + Canon 300mm 2.8 L USM /!/ Hi guys, recently I acquired the older 300mm non-IS version for work. It is second hand, but luckily the glass is flawless. The outside, not so much. The normal wearing down of paint in some spots exist and  I read online I may use Canon’s touch up paint, specifically for L lenses. I spent a few hours fixing spots but after drying I notice my work easily comes off with the scratch of a nail. \n\nIs there anything to apply over the new paint to seal it? Something that will blend with the rest of the paint?", "link": "https://www.reddit.com/r/canon/comments/91thhw/touch_up_paint_canon_300mm_28_l_usm/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "touch up paint + canon 300mm 2.8 l usm /!/ hi guys, recently i acquired the older 300mm non-is version for work. it is second hand, but luckily the glass is flawless. the outside, not so much. the normal wearing down of paint in some -----> spots !!!  exist and  i read online i may use canon’s touch up paint, specifically for l lenses. i spent a few hours fixing spots but after drying i notice my work easily comes off with the scratch of a nail. \n\nis there anything to apply over the new paint to seal it? something that will blend with the rest of the paint?", "sortedWord": "None", "identifyer": 22388, "year": "2018"}, {"Unnamed: 0": 131852, "autor": "mt-anon", "date": 1539136498000, "content": "Canon EF 70-200mm f4L USM Non-IS /!/ Hey guys, \nMy main walk around lens just broke. I’ve had the 28-135mm USM for forever and I know it’s not the best quality but it was like a walk around lens. I also used it for landscape and sports especially. It’s autofocus “works” but it suddenly became jittery and not focusing at the right spots. Also the diaphragm blades are stuck at f3.5. I think I’m at the point where I’m giving up on it and I’m ready to move on 😂\n\nOkay, I have the Canon EOS 77D, a nifty fifty, the 18-55 kit lens, and then I’m missing a zoom now. \n\nI shoot sports like most of the time for my school and then portraits are my favorite to shoot. I only used the 28-135 for sports and 50 for portraits. I’m thinking of getting the 24-105mm f4L (similar zoom range) or the 70-200 f4L.\n\nIf I get the 24-105, it won’t be much different, of course better quality and faster everything but I want to try out the 70-200. I’ve heard it’s really good for sports and everything but do you guys have any experience with it with portraits and stuff like that? \n\nI don’t want to buy a lens just for sports that’s not really like my hobby, I want to try it for portraits too. \n\nHow does it do with portraits, is the f4 and dof of 70-200mm enough for the creamy bokeh??", "link": "https://www.reddit.com/r/canon/comments/9mvbkk/canon_ef_70200mm_f4l_usm_nonis/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon ef 70-200mm f4l usm non-is /!/ hey guys, \nmy main walk around lens just broke. i’ve had the 28-135mm usm for forever and i know it’s not the best quality but it was like a walk around lens. i also used it for landscape and sports especially. it’s autofocus “works” but it suddenly became jittery and not focusing at the right -----> spots !!! . also the diaphragm blades are stuck at f3.5. i think i’m at the point where i’m giving up on it and i’m ready to move on 😂\n\nokay, i have the canon eos 77d, a nifty fifty, the 18-55 kit lens, and then i’m missing a zoom now. \n\ni shoot sports like most of the time for my school and then portraits are my favorite to shoot. i only used the 28-135 for sports and 50 for portraits. i’m thinking of getting the 24-105mm f4l (similar zoom range) or the 70-200 f4l.\n\nif i get the 24-105, it won’t be much different, of course better quality and faster everything but i want to try out the 70-200. i’ve heard it’s really good for sports and everything but do you guys have any experience with it with portraits and stuff like that? \n\ni don’t want to buy a lens just for sports that’s not really like my hobby, i want to try it for portraits too. \n\nhow does it do with portraits, is the f4 and dof of 70-200mm enough for the creamy bokeh??", "sortedWord": "None", "identifyer": 22570, "year": "2018"}, {"Unnamed: 0": 131924, "autor": "StraightIndication", "date": 1545786530000, "content": "Canon Rebel EOS T6 any ability to use external mic? /!/ I've got my new camera and I've read that this camera does not support an external mic. But I see what looks like a jack on the side where the usb spot is? Is there absolutely no option to use an external mic? Even through the usb?\n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/canon/comments/a9k353/canon_rebel_eos_t6_any_ability_to_use_external_mic/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon rebel eos t6 any ability to use external mic? /!/ i've got my new camera and i've read that this camera does not support an external mic. but i see what looks like a jack on the side where the usb -----> spot !!!  is? is there absolutely no option to use an external mic? even through the usb?\n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 22644, "year": "2018"}, {"Unnamed: 0": 132023, "autor": "ExploreEdinburgh", "date": 1542570563000, "content": "What’s the deal with this black spot in the top left of every photo. Am I doing something wrong? Kit is brand new and I’ve cleaned the lens.", "link": "https://www.reddit.com/r/canon/comments/9y93e5/whats_the_deal_with_this_black_spot_in_the_top/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what’s the deal with this black -----> spot !!!  in the top left of every photo. am i doing something wrong? kit is brand new and i’ve cleaned the lens.", "sortedWord": "None", "identifyer": 22744, "year": "2018"}, {"Unnamed: 0": 132243, "autor": "BestUsername-", "date": 1519193208000, "content": "Need feedback on renting a lens short notice. /!/ #Lens recommendation?\n\nI have a 200mm lens that came with my Canon T3 that has suited all my needs. So I've never invested into upgrading. I have the opportunity to do a little plane spotting at the Las Vegas airport in a couple weeks and wanted to rent a lens from www.borrowlens.com\n\nSome of the best spotting locations require at least 300-400mm. [Here are a couple photos](https://i.imgur.com/XS6NymU.jpg) from one of the locations I will be at. I'd like a lens with image stabilization and simplicity (auto focus would be nice). Price I'm willing to rent for a week is max $150.\n\n[Canon EF 100-400mm f/4.5-5.6L IS USM Lens](https://www.borrowlenses.com/product/Canon-EF-100-400mm-f4556L-IS-USM)\n\n[Canon EF 100-400mm f/4.5-5.6L IS II USM Lens](https://www.borrowlenses.com/product/Canon-EF-100400mm-f4556L-IS-II-USM-Lens)\n\n[Canon EF 300mm f/4L IS USM Lens](https://www.borrowlenses.com/product/Canon_EF_300mm_F_4_IS)\n\nAnd input on using an [Extender](https://www.borrowlenses.com/product/Canon_2x_III_Teleconverter) to get more out of the lens?\n\nThanks!", "link": "https://www.reddit.com/r/canon/comments/7z3e4g/need_feedback_on_renting_a_lens_short_notice/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "need feedback on renting a lens short notice. /!/ #lens recommendation?\n\ni have a 200mm lens that came with my canon t3 that has suited all my needs. so i've never invested into upgrading. i have the opportunity to do a little plane -----> spotting !!!  at the las vegas airport in a couple weeks and wanted to rent a lens from www.borrowlens.com\n\nsome of the best -----> spotting !!!  locations require at least 300-400mm. [here are a couple photos](https://i.imgur.com/xs6nymu.jpg) from one of the locations i will be at. i'd like a lens with image stabilization and simplicity (auto focus would be nice). price i'm willing to rent for a week is max $150.\n\n[canon ef 100-400mm f/4.5-5.6l is usm lens](https://www.borrowlenses.com/product/canon-ef-100-400mm-f4556l-is-usm)\n\n[canon ef 100-400mm f/4.5-5.6l is ii usm lens](https://www.borrowlenses.com/product/canon-ef-100400mm-f4556l-is-ii-usm-lens)\n\n[canon ef 300mm f/4l is usm lens](https://www.borrowlenses.com/product/canon_ef_300mm_f_4_is)\n\nand input on using an [extender](https://www.borrowlenses.com/product/canon_2x_iii_teleconverter) to get more out of the lens?\n\nthanks!", "sortedWord": "None", "identifyer": 22965, "year": "2018"}, {"Unnamed: 0": 132534, "autor": "truth1ness", "date": 1528587609000, "content": "Is there a way to review a picture on the G7x without retracting the lens right away? /!/ Is there a way to review photos but keep the lens open to switch back and forth faster? Sometimes I want to review a photo for longer than my default image review but pressing the Review Photo button instantly retracts the lens each time. It's annoying to have to wait for it to retract and unretract each time particularly when dialing in my settings in a new spot.", "link": "https://www.reddit.com/r/canon/comments/8pwvps/is_there_a_way_to_review_a_picture_on_the_g7x/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there a way to review a picture on the g7x without retracting the lens right away? /!/ is there a way to review photos but keep the lens open to switch back and forth faster? sometimes i want to review a photo for longer than my default image review but pressing the review photo button instantly retracts the lens each time. it's annoying to have to wait for it to retract and unretract each time particularly when dialing in my settings in a new -----> spot !!! .", "sortedWord": "None", "identifyer": 23257, "year": "2018"}, {"Unnamed: 0": 132583, "autor": "James955i", "date": 1532281092000, "content": "Interesting realisation whilst out today /!/ I was out with the family this afternoon and took the camera (750D with kit lens) to get some photos of the cove and the kids, I have been looking to replace the lens with either the canon 17-55, or the sigma 17-50 thinking it will help me get less fuzzy photos for context.\n\nI spotted a guy with a nice camera and red ring lens and asked if he wouldn't mind taking a photo of me and my son with my camera, which he kindly agreed to. Getting back and looking at them, the photos he took are crystal clear. Better than almost any of the photos I took today.\n\nI need to focus less on lenses and more on how I hold the camera and compose the shots, because clearly the problem is me...", "link": "https://www.reddit.com/r/canon/comments/90zgl7/interesting_realisation_whilst_out_today/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "interesting realisation whilst out today /!/ i was out with the family this afternoon and took the camera (750d with kit lens) to get some photos of the cove and the kids, i have been looking to replace the lens with either the canon 17-55, or the sigma 17-50 thinking it will help me get less fuzzy photos for context.\n\ni -----> spotted !!!  a guy with a nice camera and red ring lens and asked if he wouldn't mind taking a photo of me and my son with my camera, which he kindly agreed to. getting back and looking at them, the photos he took are crystal clear. better than almost any of the photos i took today.\n\ni need to focus less on lenses and more on how i hold the camera and compose the shots, because clearly the problem is me...", "sortedWord": "None", "identifyer": 23306, "year": "2018"}, {"Unnamed: 0": 132645, "autor": "eintown", "date": 1531584073000, "content": "There are some corroded spots in the inner lens mount of my new 6D mk1 &amp; the adjacent side of the mirror has a smudge. I’ve only used compressed air &amp; have been a careful camera owner (450D then 60D). Never had this happen before. I’m using 2 EF lenses &amp; a Sigma art lens. Any input would be great", "link": "https://www.reddit.com/r/canon/comments/8yu9an/there_are_some_corroded_spots_in_the_inner_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "there are some corroded -----> spots !!!  in the inner lens mount of my new 6d mk1 &amp; the adjacent side of the mirror has a smudge. i’ve only used compressed air &amp; have been a careful camera owner (450d then 60d). never had this happen before. i’m using 2 ef lenses &amp; a sigma art lens. any input would be great", "sortedWord": "None", "identifyer": 23368, "year": "2018"}, {"Unnamed: 0": 132791, "autor": "VileQuenouille", "date": 1535397866000, "content": "So I kind of fucked up didn't I? /!/ I tried to clean my 24-70 f/4 L IS recently, and [that happened](https://i.imgur.com/POdhVbN.jpg)\n\n&amp;#x200B;\n\nThere was a smudge on the back element, which was otherwise spotless, since I bought the lens only 8 months ago. I tried to clean it with a microfiber, gently rubbed the glass element a couple of time, maybe a bit too many times I guess, because right after there was tons of dust on it, except it was not on it, but under it!\n\n&amp;#x200B;\n\nNot sure how it happened, my guess is that I loaded the back element with static electricity, which got all the dust that was wandering around in the lens (I know there's always some in it) stuck on the back of the rear element. It doesn't seem to affect IQ, the very few dust spots I have are on the sensor, but it hurts to have an otherwise new L lens in this state. \n\n&amp;#x200B;\n\nHas anyone else experienced something similar? I can't find anything similar on forums, or here, except that L glass can be expensive to have it cleaned by Canon.", "link": "https://www.reddit.com/r/canon/comments/9ary2m/so_i_kind_of_fucked_up_didnt_i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "so i kind of fucked up didn't i? /!/ i tried to clean my 24-70 f/4 l is recently, and [that happened](https://i.imgur.com/podhvbn.jpg)\n\n&amp;#x200b;\n\nthere was a smudge on the back element, which was otherwise spotless, since i bought the lens only 8 months ago. i tried to clean it with a microfiber, gently rubbed the glass element a couple of time, maybe a bit too many times i guess, because right after there was tons of dust on it, except it was not on it, but under it!\n\n&amp;#x200b;\n\nnot sure how it happened, my guess is that i loaded the back element with static electricity, which got all the dust that was wandering around in the lens (i know there's always some in it) stuck on the back of the rear element. it doesn't seem to affect iq, the very few dust -----> spots !!!  i have are on the sensor, but it hurts to have an otherwise new l lens in this state. \n\n&amp;#x200b;\n\nhas anyone else experienced something similar? i can't find anything similar on forums, or here, except that l glass can be expensive to have it cleaned by canon.", "sortedWord": "None", "identifyer": 23518, "year": "2018"}, {"Unnamed: 0": 132869, "autor": "WinterReady", "date": 1538774398000, "content": "Unwanted circular effects on Sigma 35mm ART f/1.4 /!/ So I recently pulled the trigger and ordered a 1DXii.  I've been shooting with a Canon 24-70 f/4 for the most part, but today I tested out a Sigma 35mm ART f/1.4.  I'm getting this weird circular effect, especially when shooting wide open.  If I close down the lens a little it goes away for the most part, but it still looks like there's a dark spot in the center of the image.  I'm guessing its some kind of digital correction that I can't figure out how to turn off.  The lines look too sharp to me to think it is any kind of optical issue.\n\nAny ideas what this could be?\n\n&amp;#x200B;\n\nhttps://i.redd.it/b92ruhyqofq11.jpg", "link": "https://www.reddit.com/r/canon/comments/9lqdn1/unwanted_circular_effects_on_sigma_35mm_art_f14/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "unwanted circular effects on sigma 35mm art f/1.4 /!/ so i recently pulled the trigger and ordered a 1dxii.  i've been shooting with a canon 24-70 f/4 for the most part, but today i tested out a sigma 35mm art f/1.4.  i'm getting this weird circular effect, especially when shooting wide open.  if i close down the lens a little it goes away for the most part, but it still looks like there's a dark -----> spot !!!  in the center of the image.  i'm guessing its some kind of digital correction that i can't figure out how to turn off.  the lines look too sharp to me to think it is any kind of optical issue.\n\nany ideas what this could be?\n\n&amp;#x200b;\n\nhttps://i.redd.it/b92ruhyqofq11.jpg", "sortedWord": "None", "identifyer": 23596, "year": "2018"}, {"Unnamed: 0": 133552, "autor": "luisguevara0", "date": 1524678719000, "content": "So i fucked up my focus screen... /!/ I was cleaning the mirror of my Canon 1200D (it was very dirty from a trip I had to a desert area) When I realized that the focus screen was dirty too\n\nAnd I had the great idea of ​​cleaning myself with a cleaning kit that I had out there ...\n\nNow it has a small scratch and spot of dirty\nI was looking in ebay for a replacement and i found some parts but there come from china And the estimated date for the screen to arrive is more than 3 months for my country ( i live in El Salvador)\n\nI was wondering\nPeople can get used to the dust when you see in the mirror before you take the photo?\n\nBecouse i was testing and is just the focus screen that is dirty\nThe sensor i clean\n\nSomeone has experience something similar?\nAny advice to get used to the dirt in the viewfinder?\n\n", "link": "https://www.reddit.com/r/canon/comments/8evkn3/so_i_fucked_up_my_focus_screen/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "so i fucked up my focus screen... /!/ i was cleaning the mirror of my canon 1200d (it was very dirty from a trip i had to a desert area) when i realized that the focus screen was dirty too\n\nand i had the great idea of ​​cleaning myself with a cleaning kit that i had out there ...\n\nnow it has a small scratch and -----> spot !!!  of dirty\ni was looking in ebay for a replacement and i found some parts but there come from china and the estimated date for the screen to arrive is more than 3 months for my country ( i live in el salvador)\n\ni was wondering\npeople can get used to the dust when you see in the mirror before you take the photo?\n\nbecouse i was testing and is just the focus screen that is dirty\nthe sensor i clean\n\nsomeone has experience something similar?\nany advice to get used to the dirt in the viewfinder?\n\n", "sortedWord": "None", "identifyer": 24281, "year": "2018"}, {"Unnamed: 0": 133615, "autor": "jynxzero", "date": 1528013679000, "content": "Lens choice for macro beginner on crop sensor /!/ Photography newbie here.  I have been gifted a Canon EOS 20D camera body by someone who upgraded their setup.  I realize this is pretty old camera, but from what I understand it was pretty decent when released.  I'm planning to use it as an inexpensive way to try out photography to see if it's a hobby that works for me.\n\nI'm particularly interested in macro photography \\- taking some pictures of bugs and flowers eg in my garden and in the local nature reserve, so I'm in the market for a macro lens.  I'm keen on the idea of image stabilization.\n\nLooks like a 2nd hand Sigma 105mm f2.8 is within my budget.  What do folks think about this lens on a crop camera?  I'm hesitating because I've seen several articles saying that the \"sweet spot\" for macro photography is around 100mm.  On a crop\\-sensor \\- from what I understand \\- the Sigma will be operating at 105mmx1.6=168mm.  Is this too much?  It seems a long way from that 100mm recommendation that is often made.  There are a lot of reviews of this lens online, but I'm struggling to find any that specifically pair it with a camera with a crop sensor.\n\nThere doesn't seem to be a lot else in my price range that gets close to this 100mm sweet spot.  The Tamron 90mm is a bit closer, and I know it gets great reviews, but it's a lot more expensive.  There's a Canon 60mm f/2.8 macro, but it doesn't have image stabilization.  Finally there's the Canon EF\\-S 35mm f/2.8 macro.  This does have IS, but 35mm seems quite short for macro work \\- presumably I'll have to get *really* close to my subject.  Fine for flowers, less so for things that are keen to run away.\n\nI'm keen to hear 1\\) What people think of the Sigma on a crop sensor 2\\) If I've missed any other possible options 3\\) If I've made any mistakes in my research/understanding \\- obviously I'm very new to this so it's entirely possible.", "link": "https://www.reddit.com/r/canon/comments/8o77y3/lens_choice_for_macro_beginner_on_crop_sensor/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens choice for macro beginner on crop sensor /!/ photography newbie here.  i have been gifted a canon eos 20d camera body by someone who upgraded their setup.  i realize this is pretty old camera, but from what i understand it was pretty decent when released.  i'm planning to use it as an inexpensive way to try out photography to see if it's a hobby that works for me.\n\ni'm particularly interested in macro photography \\- taking some pictures of bugs and flowers eg in my garden and in the local nature reserve, so i'm in the market for a macro lens.  i'm keen on the idea of image stabilization.\n\nlooks like a 2nd hand sigma 105mm f2.8 is within my budget.  what do folks think about this lens on a crop camera?  i'm hesitating because i've seen several articles saying that the \"sweet -----> spot !!! \" for macro photography is around 100mm.  on a crop\\-sensor \\- from what i understand \\- the sigma will be operating at 105mmx1.6=168mm.  is this too much?  it seems a long way from that 100mm recommendation that is often made.  there are a lot of reviews of this lens online, but i'm struggling to find any that specifically pair it with a camera with a crop sensor.\n\nthere doesn't seem to be a lot else in my price range that gets close to this 100mm sweet spot.  the tamron 90mm is a bit closer, and i know it gets great reviews, but it's a lot more expensive.  there's a canon 60mm f/2.8 macro, but it doesn't have image stabilization.  finally there's the canon ef\\-s 35mm f/2.8 macro.  this does have is, but 35mm seems quite short for macro work \\- presumably i'll have to get *really* close to my subject.  fine for flowers, less so for things that are keen to run away.\n\ni'm keen to hear 1\\) what people think of the sigma on a crop sensor 2\\) if i've missed any other possible options 3\\) if i've made any mistakes in my research/understanding \\- obviously i'm very new to this so it's entirely possible.", "sortedWord": "None", "identifyer": 24344, "year": "2018"}, {"Unnamed: 0": 133638, "autor": "LightBoi1", "date": 1527731800000, "content": "Canon Rebel T5 Sensor Cleaning /!/ Hey all,\n\nI posted on this sub recently, and everyone was able to help me figure out that my sensor was dirty. I tried to clean my sensor, but with multiple attempts, no success. I recognize that the Canon Rebel T5 does not have an automatic sensor cleaning feature, so I was wondering what else I should be doing to clean my sensor. I've tried air blower and a sensorklear pen. Maybe I'm cleaning the wrong spot? Thanks in advance everyone.", "link": "https://www.reddit.com/r/canon/comments/8ne70t/canon_rebel_t5_sensor_cleaning/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon rebel t5 sensor cleaning /!/ hey all,\n\ni posted on this sub recently, and everyone was able to help me figure out that my sensor was dirty. i tried to clean my sensor, but with multiple attempts, no success. i recognize that the canon rebel t5 does not have an automatic sensor cleaning feature, so i was wondering what else i should be doing to clean my sensor. i've tried air blower and a sensorklear pen. maybe i'm cleaning the wrong -----> spot !!! ? thanks in advance everyone.", "sortedWord": "None", "identifyer": 24367, "year": "2018"}, {"Unnamed: 0": 133662, "autor": "LightBoi1", "date": 1527556034000, "content": "Sensor Cleaning Canon Rebel T5 /!/ Hey all, \n\nI posted on this sub recently, and everyone was able to help me figure out that my sensor was dirty. I'm currently trying to clean my sensor, but with multiple attempts, no success. I recognize that the Canon Rebel T5 does not have an automatic sensor cleaning feature, so I was wondering what else I should be doing to clean my sensor. I've tried air blower and a sensorklear pen. Maybe I'm cleaning the wrong spot? Thanks in advance everyone. ", "link": "https://www.reddit.com/r/canon/comments/8mv07l/sensor_cleaning_canon_rebel_t5/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sensor cleaning canon rebel t5 /!/ hey all, \n\ni posted on this sub recently, and everyone was able to help me figure out that my sensor was dirty. i'm currently trying to clean my sensor, but with multiple attempts, no success. i recognize that the canon rebel t5 does not have an automatic sensor cleaning feature, so i was wondering what else i should be doing to clean my sensor. i've tried air blower and a sensorklear pen. maybe i'm cleaning the wrong -----> spot !!! ? thanks in advance everyone. ", "sortedWord": "None", "identifyer": 24391, "year": "2018"}, {"Unnamed: 0": 133838, "autor": "vinnyy88", "date": 1537690684000, "content": "5dmk2 for fun? /!/ Hi guys. So, I've spotted a second hand 5dmk2 with 140k shutters for €325.\n\nI already have an 80D with a bunch of EF-s lenses, with only one EF 50 1.8.\n\nSo, how to think about this 5dmk2? Is it justified to buy this one for fun / backup? ", "link": "https://www.reddit.com/r/canon/comments/9i6wz7/5dmk2_for_fun/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "5dmk2 for fun? /!/ hi guys. so, i've -----> spotted !!!  a second hand 5dmk2 with 140k shutters for €325.\n\ni already have an 80d with a bunch of ef-s lenses, with only one ef 50 1.8.\n\nso, how to think about this 5dmk2? is it justified to buy this one for fun / backup? ", "sortedWord": "None", "identifyer": 24567, "year": "2018"}], "name": "spotcanon2018"}