{"interestingcomments": [{"Unnamed: 0": 291672, "autor": "Jxh57601206", "date": 1611893601000, "content": "Canon R5 metering modes quick selection? /!/ Just got the R5 and apparently there is no quick and easy way to choose metering modes. I have to open up the Q menu and then use the dials to select metering modes or use the touchscreen. Is there a way to customize a button to do \"direct metering modes selection?\" Like the one where I can go from auto tracking to single spot AF back and forth if I disable all the rest AF modes. \n\nCan I click one button to cycle thru all metering modes?", "link": "https://www.reddit.com/r/canon/comments/l7iuqx/canon_r5_metering_modes_quick_selection/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon r5 metering modes quick selection? /!/ just got the r5 and apparently there is no quick and easy way to choose metering modes. i have to open up the q menu and then use the dials to select metering modes or use the touchscreen. is there a way to customize a button to do \"direct metering modes selection?\" like the one where i can go from auto tracking to single -----> spot !!!  af back and forth if i disable all the rest af modes. \n\ncan i click one button to cycle thru all metering modes?", "sortedWord": "None", "identifyer": 38227, "year": "2021"}, {"Unnamed: 0": 291802, "autor": "madcap76", "date": 1619541718000, "content": "Sensor still dirty after CPS cleaning? /!/ I sent my 5D to CPS last week for cleaning included with having a gold membership.  I received the camera back today and the sensor cleaning appears to have just moved the dirt that was present to the corners.  I am wondering if the condition of the cleaned sensor also appears unacceptable to anyone else or if anyone else has had a similar experience with their cleanings.  Would like opinions before I contact Canon, thanks!  \n\n[Before @ f22](https://i.imgur.com/LdgTK5Z.jpg)  \n[Before - Lightroom spot correction visualized](https://i.imgur.com/HhPQtdi.jpg)  \n[After @ f22 and intentionally out of focus](https://i.imgur.com/9LrWvug.jpg)  \n[After - Lightroom spot correction visualized](https://i.imgur.com/ve9Uvsv.jpg)", "link": "https://www.reddit.com/r/canon/comments/mzsnqy/sensor_still_dirty_after_cps_cleaning/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sensor still dirty after cps cleaning? /!/ i sent my 5d to cps last week for cleaning included with having a gold membership.  i received the camera back today and the sensor cleaning appears to have just moved the dirt that was present to the corners.  i am wondering if the condition of the cleaned sensor also appears unacceptable to anyone else or if anyone else has had a similar experience with their cleanings.  would like opinions before i contact canon, thanks!  \n\n[before @ f22](https://i.imgur.com/ldgtk5z.jpg)  \n[before - lightroom -----> spot !!!  correction visualized](https://i.imgur.com/hhpqtdi.jpg)  \n[after @ f22 and intentionally out of focus](https://i.imgur.com/9lrwvug.jpg)  \n[after - lightroom spot correction visualized](https://i.imgur.com/ve9uvsv.jpg)", "sortedWord": "None", "identifyer": 38358, "year": "2021"}, {"Unnamed: 0": 291857, "autor": "RomanticPhotographic", "date": 1622395947000, "content": "Canon R6: Best setting techniques for focusing on people when there's a lot of foreground? /!/ Did a huge test yesterday and experienced a bit of frustration with the R6 focus system. I have it set to look for faces, but a lot of times it would get fixated on the foreground (like when shooting through a frame of foliage) and totally give up on trying to find a face. \n\nI used spot focus on my D5's and that worked well, but I really want more accuracy when shooting close up at f2 and faster.\n\nYour suggestions and guidance, please.", "link": "https://www.reddit.com/r/canon/comments/nog2a7/canon_r6_best_setting_techniques_for_focusing_on/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon r6: best setting techniques for focusing on people when there's a lot of foreground? /!/ did a huge test yesterday and experienced a bit of frustration with the r6 focus system. i have it set to look for faces, but a lot of times it would get fixated on the foreground (like when shooting through a frame of foliage) and totally give up on trying to find a face. \n\ni used -----> spot !!!  focus on my d5's and that worked well, but i really want more accuracy when shooting close up at f2 and faster.\n\nyour suggestions and guidance, please.", "sortedWord": "None", "identifyer": 38414, "year": "2021"}, {"Unnamed: 0": 291909, "autor": "workable_noodle", "date": 1625193595000, "content": "Strange black dots 6D mk I /!/ When looking in the live view the image is clear of any particles. But, when I take the photo the spots appear. Note that this is not the viewfinder but the live view where I don’t see the spots. Any thoughts?", "link": "https://www.reddit.com/r/canon/comments/oc12hh/strange_black_dots_6d_mk_i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "strange black dots 6d mk i /!/ when looking in the live view the image is clear of any particles. but, when i take the photo the -----> spots !!!  appear. note that this is not the viewfinder but the live view where i don’t see the spots. any thoughts?", "sortedWord": "None", "identifyer": 38467, "year": "2021"}, {"Unnamed: 0": 291956, "autor": "graesen", "date": 1625053644000, "content": "M50 for $60 new on FB marketplace. What other red flags should I look for? /!/ I'm very skeptical about this listing and probably going to skip on it but it's tempting. What red flags should I look for? Questions to ask?\n\nSpotted a Facebook Marketplace listing for a Canon M50 for $60, brand new. Seller says the store is closing and they have about a dozen to sell at this price. There's no local pickup, shipping only (they could send me a brick for all I know). I tried to look more into it but unable to find the seller's other listings yet, profile is private, friends are visible and appreciate Thai or middle eastern, but that doesn't necessarily mean anything - might clue in to location maybe?\n\nI did see Facebook has a purchase protection program but I don't know how good it is.\n\nFor context: I have an M5. I have no reason to grab the M50 really. For the price, it's good to have a 2nd camera but mostly thinking if my son might enjoy having it. He likes to take my camera and play around. He's also 6, but been playing with mine since 4, maybe a little since 3. But he favors my G9 X over the M5. Only wish the M50 and M5 used the same battery if I did take a chance here.", "link": "https://www.reddit.com/r/canon/comments/oavmfl/m50_for_60_new_on_fb_marketplace_what_other_red/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "m50 for $60 new on fb marketplace. what other red flags should i look for? /!/ i'm very skeptical about this listing and probably going to skip on it but it's tempting. what red flags should i look for? questions to ask?\n\n-----> spotted !!!  a facebook marketplace listing for a canon m50 for $60, brand new. seller says the store is closing and they have about a dozen to sell at this price. there's no local pickup, shipping only (they could send me a brick for all i know). i tried to look more into it but unable to find the seller's other listings yet, profile is private, friends are visible and appreciate thai or middle eastern, but that doesn't necessarily mean anything - might clue in to location maybe?\n\ni did see facebook has a purchase protection program but i don't know how good it is.\n\nfor context: i have an m5. i have no reason to grab the m50 really. for the price, it's good to have a 2nd camera but mostly thinking if my son might enjoy having it. he likes to take my camera and play around. he's also 6, but been playing with mine since 4, maybe a little since 3. but he favors my g9 x over the m5. only wish the m50 and m5 used the same battery if i did take a chance here.", "sortedWord": "None", "identifyer": 38515, "year": "2021"}, {"Unnamed: 0": 292195, "autor": "spellbreakerstudio", "date": 1630014420000, "content": "R5 cr3 files in Lightroom? /!/ Hi all, I'm a wildlife shooter and usually shoot JPG. Ive never had problems getting the edits I want, and R5 raws are just so unweildy I figured what's the point. \n\nI was shooting Loons on the water (dark bird) yesterday and shot raw figuring I might need the extra range to brighten the dark spots. I didn't really notice any improvement though over what a JPG usually gets me. When pushed, my shadows were still noisey.\n\nI'm taking this as testament to how good the R5 is with dynamic range and the quality of the JPG. But wondering if maybe the cr3 is the wrong type of raw or something or if LR struggles with it?", "link": "https://www.reddit.com/r/canon/comments/pc9dow/r5_cr3_files_in_lightroom/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "r5 cr3 files in lightroom? /!/ hi all, i'm a wildlife shooter and usually shoot jpg. ive never had problems getting the edits i want, and r5 raws are just so unweildy i figured what's the point. \n\ni was shooting loons on the water (dark bird) yesterday and shot raw figuring i might need the extra range to brighten the dark -----> spots !!! . i didn't really notice any improvement though over what a jpg usually gets me. when pushed, my shadows were still noisey.\n\ni'm taking this as testament to how good the r5 is with dynamic range and the quality of the jpg. but wondering if maybe the cr3 is the wrong type of raw or something or if lr struggles with it?", "sortedWord": "None", "identifyer": 38759, "year": "2021"}, {"Unnamed: 0": 292365, "autor": "walfulninja", "date": 1635443371000, "content": "Problems With T2I Metering /!/ Hi everyone! I recently picked up a T2I, and I am a little confused by the metering. Going by the meter in the viewfinder, it always seems to expose the photos a little hot when I balance the exposure right in the middle. I tried switching to spot metering, but that was finicky and seemed to under expose instead.\n\nI am sure this is a user error problem; I have used mirrorless cameras my whole career and learning to use an optical viewfinder has been a learning curve. Is there a good rule of thumb/method for nailing down exposure when using am optical viewfinder? Or is the T2I just a little touchy?", "link": "https://www.reddit.com/r/canon/comments/qhshqb/problems_with_t2i_metering/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "problems with t2i metering /!/ hi everyone! i recently picked up a t2i, and i am a little confused by the metering. going by the meter in the viewfinder, it always seems to expose the photos a little hot when i balance the exposure right in the middle. i tried switching to -----> spot !!!  metering, but that was finicky and seemed to under expose instead.\n\ni am sure this is a user error problem; i have used mirrorless cameras my whole career and learning to use an optical viewfinder has been a learning curve. is there a good rule of thumb/method for nailing down exposure when using am optical viewfinder? or is the t2i just a little touchy?", "sortedWord": "None", "identifyer": 38931, "year": "2021"}, {"Unnamed: 0": 292376, "autor": "chuggachuggachuggas", "date": 1635401011000, "content": "stick with my rebel t3 or upgrade to 80d or 90d /!/ I got it in 2012 and had the kit lens which broke last year. I am using an older EF 35-80mm 1:4-5.6 and an EF 75-300mm14-5.6 III.\n\nI take a lot of photos of my kids and family, they started into sports so i'm taking a lot of photos of all the different sports and husband is into autocross which I really enjoy taking photos of. Landscape of course when we go out.\n\nI have gotten a lot better the past year with photos and using my camera correctly and realized I want an upgrade. I hear the date the body marry the lens but I feel like i'm at the spot i want to upgrade both.\n\nI'm thinking either an 80d or 90d with the 18-135mm f3.5/5.6 lens\n\nto start out with and upgrade my 75-300mm one now or soonish. Could I can some thoughts and opinions also is the 75-300mm utm cannon on best or is there a better alternative. \n\nI would also like a f/2.8 lens but totally unsure with which one to get for what I do the most with it as my shooting seems to be all over the place.", "link": "https://www.reddit.com/r/canon/comments/qhgd0i/stick_with_my_rebel_t3_or_upgrade_to_80d_or_90d/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "stick with my rebel t3 or upgrade to 80d or 90d /!/ i got it in 2012 and had the kit lens which broke last year. i am using an older ef 35-80mm 1:4-5.6 and an ef 75-300mm14-5.6 iii.\n\ni take a lot of photos of my kids and family, they started into sports so i'm taking a lot of photos of all the different sports and husband is into autocross which i really enjoy taking photos of. landscape of course when we go out.\n\ni have gotten a lot better the past year with photos and using my camera correctly and realized i want an upgrade. i hear the date the body marry the lens but i feel like i'm at the -----> spot !!!  i want to upgrade both.\n\ni'm thinking either an 80d or 90d with the 18-135mm f3.5/5.6 lens\n\nto start out with and upgrade my 75-300mm one now or soonish. could i can some thoughts and opinions also is the 75-300mm utm cannon on best or is there a better alternative. \n\ni would also like a f/2.8 lens but totally unsure with which one to get for what i do the most with it as my shooting seems to be all over the place.", "sortedWord": "None", "identifyer": 38942, "year": "2021"}, {"Unnamed: 0": 292612, "autor": "preciouscode96", "date": 1616937492000, "content": "How tall does the Canon 24-70 F4 measure against the Canon 24-105 F4? Want to know if either fits upwards in my camera bag. Internet says the 105 is 11cm but that seems very tiny /!/ Like the title says I would like to know if (when I get one of these lenses) it will fit in my current lens' spot, that means upwards. On internet I find different measures and numbers and when I check video's I'm sure the 24-105 isbigger than 110mm (11cm).", "link": "https://www.reddit.com/r/canon/comments/mf13v4/how_tall_does_the_canon_2470_f4_measure_against/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how tall does the canon 24-70 f4 measure against the canon 24-105 f4? want to know if either fits upwards in my camera bag. internet says the 105 is 11cm but that seems very tiny /!/ like the title says i would like to know if (when i get one of these lenses) it will fit in my current lens' -----> spot !!! , that means upwards. on internet i find different measures and numbers and when i check video's i'm sure the 24-105 isbigger than 110mm (11cm).", "sortedWord": "None", "identifyer": 39183, "year": "2021"}, {"Unnamed: 0": 292786, "autor": "Aviv13467", "date": 1611639996000, "content": "Looking for an upgrade from a Nikon D3500 /!/ Hi there, this is my first camera, bought it with 2 kit lenses (18-55 &amp; 70-300) and I was pretty satisfied with it.\n\nIt time to upgrade, I'm missing on many features, I'm into astrophotography and plane spotting so the intervalometer port missing for taking long exposures and the inability to change ISO quickly is a deal breaker for me.\n\nI also tend to record myself playing piano sometimes and could really use a mic port which doesn't exist\n\nI'm thinking of the Canon EOS SL3. the Nikon D5600 is one the same league but missing a mic port and also is a little bit more expensive where I live.\n\nAny suggestions?", "link": "https://www.reddit.com/r/canon/comments/l57fa8/looking_for_an_upgrade_from_a_nikon_d3500/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "looking for an upgrade from a nikon d3500 /!/ hi there, this is my first camera, bought it with 2 kit lenses (18-55 &amp; 70-300) and i was pretty satisfied with it.\n\nit time to upgrade, i'm missing on many features, i'm into astrophotography and plane -----> spotting !!!  so the intervalometer port missing for taking long exposures and the inability to change iso quickly is a deal breaker for me.\n\ni also tend to record myself playing piano sometimes and could really use a mic port which doesn't exist\n\ni'm thinking of the canon eos sl3. the nikon d5600 is one the same league but missing a mic port and also is a little bit more expensive where i live.\n\nany suggestions?", "sortedWord": "None", "identifyer": 39359, "year": "2021"}, {"Unnamed: 0": 292838, "autor": "Chicken4Dayz1", "date": 1611478731000, "content": "What’s everyone’s experience with the 50mm f1.8 RF lens? /!/ Been looking to get the 50mm f1.8 RF lens for a while now. Price is good and I loved my old 50mm which unfortunately broke a few years back. \n\nMainly would be using it as a small light lens for travel, dog photos and maybe some portraits at work. \n\nI’ve heard it is a little soft, has anyone else experienced this?  I know it would be not tack sharp at f1.8 but at f4 surely it’s spot on?", "link": "https://www.reddit.com/r/canon/comments/l3w0co/whats_everyones_experience_with_the_50mm_f18_rf/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what’s everyone’s experience with the 50mm f1.8 rf lens? /!/ been looking to get the 50mm f1.8 rf lens for a while now. price is good and i loved my old 50mm which unfortunately broke a few years back. \n\nmainly would be using it as a small light lens for travel, dog photos and maybe some portraits at work. \n\ni’ve heard it is a little soft, has anyone else experienced this?  i know it would be not tack sharp at f1.8 but at f4 surely it’s -----> spot !!!  on?", "sortedWord": "None", "identifyer": 39412, "year": "2021"}, {"Unnamed: 0": 292878, "autor": "JeiCos", "date": 1618426261000, "content": "EF-M lenses questions. /!/ So, I have the EOS M50, and it came with the 15-45mm kit lens, and I'm looking to get new lenses but there's one thing I don't understand. The full frame vs..not full frame? I don't know what the opposite of full frame is. I guess cropped maybe? Anyway, I was looking at the EF-M 22mm. I can't find the website right now, but last night I was looking around, and I found a site that had a small blurb about this lens, just giving their personal pros and cons. One of the details they mentioned seems to make no sense to me, because I'm still new to all the terminology and stuff. The site said something along the lines of the 22mm lens being full frame and being similar to 45mm. I just don't understand what this means. Does this mean that what the frame will actually look like? The page for this lens, on Canon's site, also has multiple different numbers that only confuse me further. On Canon's site, on the \"specification\" tab, it says that the focal length is 22mm, but on the \"features\" tab right next to it, on the same page, it says that the focal length is 24mm. Then on a couple of sites last night, I saw something about this lens actually looking like 35mm, as if it crops or something. Which doesn't make sense, since they also mention it being full frame, so All of these numbers are just confusing me even further.\n\nCan anyone help me understand?\n\nHere's a good example situation that an answer to, should help me out:\n\nIn the example, let's say that I have the M50 on a tripod and I never move the tripod from the spot, so the distance between the camera and subject never changes. If I set my 15-45mm lens to 22mm, the way the frame looks set up like that, if I were to then change out the lens for the 22mm lens, would it look exactly the same? Or would it crop in to show less in frame than the other lens set to 22mm?\n\nAlso, I'm only assuming this lens work with the M50. It SAYS it works on all EOS M series camera's, which the M50 is..So If I'm wrong about that, please let me know.\n\nAlso in case anyone cares, the whole reason I want this lens is because of the lower aperture, and because I can't afford the EF-M 32mm that has a 1.4 aperture.", "link": "https://www.reddit.com/r/canon/comments/mqx87f/efm_lenses_questions/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ef-m lenses questions. /!/ so, i have the eos m50, and it came with the 15-45mm kit lens, and i'm looking to get new lenses but there's one thing i don't understand. the full frame vs..not full frame? i don't know what the opposite of full frame is. i guess cropped maybe? anyway, i was looking at the ef-m 22mm. i can't find the website right now, but last night i was looking around, and i found a site that had a small blurb about this lens, just giving their personal pros and cons. one of the details they mentioned seems to make no sense to me, because i'm still new to all the terminology and stuff. the site said something along the lines of the 22mm lens being full frame and being similar to 45mm. i just don't understand what this means. does this mean that what the frame will actually look like? the page for this lens, on canon's site, also has multiple different numbers that only confuse me further. on canon's site, on the \"specification\" tab, it says that the focal length is 22mm, but on the \"features\" tab right next to it, on the same page, it says that the focal length is 24mm. then on a couple of sites last night, i saw something about this lens actually looking like 35mm, as if it crops or something. which doesn't make sense, since they also mention it being full frame, so all of these numbers are just confusing me even further.\n\ncan anyone help me understand?\n\nhere's a good example situation that an answer to, should help me out:\n\nin the example, let's say that i have the m50 on a tripod and i never move the tripod from the -----> spot !!! , so the distance between the camera and subject never changes. if i set my 15-45mm lens to 22mm, the way the frame looks set up like that, if i were to then change out the lens for the 22mm lens, would it look exactly the same? or would it crop in to show less in frame than the other lens set to 22mm?\n\nalso, i'm only assuming this lens work with the m50. it says it works on all eos m series camera's, which the m50 is..so if i'm wrong about that, please let me know.\n\nalso in case anyone cares, the whole reason i want this lens is because of the lower aperture, and because i can't afford the ef-m 32mm that has a 1.4 aperture.", "sortedWord": "None", "identifyer": 39452, "year": "2021"}, {"Unnamed: 0": 292903, "autor": "j8k7l6", "date": 1617953683000, "content": "Advice on upgrading from Rebel T5i /!/ I love my T5i. But after some time with it I am seeing its shortcomings. Photography has taken over my life since I bought this thing. And I will be keeping him as a back up, maybe even donate to a friend to kickstart a new passion. I am not a rich man. But I am starting to look forward and savings are in the making. \n\nI mainly shoot at night. But there is a solid mix of daytime shooting. I do quite a bit of urban exploring, finding graffiti spots and city exploring when everyone is sleeping. I love to shoot skylines and also love to shoot landscapes in general. Early morning/dusk and night are my favourite times to shoot. I don't really do portraits and the sort. \n\nWhat recommendations do you guys have for a step up from my current set up. I do not care really what direction it goes in. But I do need to keep the body under 1600 or so. I know that I should get this or that. But realistically.... can I spend 800-1200 on a body that is going to do me solid leagues beyond what I am using now. I shoot with my trusty 24mm pancake. 75-300 and the stock 18-55. I know I need better glass. But i also know my camera is pretty dated. Any recommendations welcome, from glass to a new body! Thanks ahead of time!", "link": "https://www.reddit.com/r/canon/comments/mnc3g1/advice_on_upgrading_from_rebel_t5i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "advice on upgrading from rebel t5i /!/ i love my t5i. but after some time with it i am seeing its shortcomings. photography has taken over my life since i bought this thing. and i will be keeping him as a back up, maybe even donate to a friend to kickstart a new passion. i am not a rich man. but i am starting to look forward and savings are in the making. \n\ni mainly shoot at night. but there is a solid mix of daytime shooting. i do quite a bit of urban exploring, finding graffiti -----> spots !!!  and city exploring when everyone is sleeping. i love to shoot skylines and also love to shoot landscapes in general. early morning/dusk and night are my favourite times to shoot. i don't really do portraits and the sort. \n\nwhat recommendations do you guys have for a step up from my current set up. i do not care really what direction it goes in. but i do need to keep the body under 1600 or so. i know that i should get this or that. but realistically.... can i spend 800-1200 on a body that is going to do me solid leagues beyond what i am using now. i shoot with my trusty 24mm pancake. 75-300 and the stock 18-55. i know i need better glass. but i also know my camera is pretty dated. any recommendations welcome, from glass to a new body! thanks ahead of time!", "sortedWord": "None", "identifyer": 39477, "year": "2021"}, {"Unnamed: 0": 292934, "autor": "JDWritesCode", "date": 1617875811000, "content": "Canon Experts: I need a substitute for the Zeiss Loxia 21mm! /!/ Some background: I'm stuck in the classic Sony vs Canon dilemma. I want to upgrade to an EOS R or A7 III, but I need a go-to lens (like if I was going on a trip and could only take one lens, this would be the one). For the Sony, I'm pretty sure it'd be the Zeiss Loxia 21mm, for the following reasons:\n\n* Compact, lightweight.\n* Nice wide angle, great for landscapes.\n* Impressive f2.8, close focusing distance, beautiful bokeh, so you can get very up close (great for portraits, or macro-type shots)\n* Minimal barrel distortion.\n* Gorgeous starbursts. I know it's a love/hate thing, and I know you can apply them in post, but on the photos I've taken with this lens where they are present, I just love how they look and the character they add.\n* Really great contrast, I just love how the photos look straight out of camera.\n* Only real downside is manual focus: but all the photos I've taken with it, the focus is pretty spot on.\n\nWhy does Canon not make a lens like this? Or maybe I'm missing it. What I want is a lightweight, compact wide-angle prime lens with minimal distortion, great SOOC colors, and can work as well for portraits as landscapes. With starburst please :) RF or EF mount. What's your suggestions?", "link": "https://www.reddit.com/r/canon/comments/mmoef9/canon_experts_i_need_a_substitute_for_the_zeiss/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon experts: i need a substitute for the zeiss loxia 21mm! /!/ some background: i'm stuck in the classic sony vs canon dilemma. i want to upgrade to an eos r or a7 iii, but i need a go-to lens (like if i was going on a trip and could only take one lens, this would be the one). for the sony, i'm pretty sure it'd be the zeiss loxia 21mm, for the following reasons:\n\n* compact, lightweight.\n* nice wide angle, great for landscapes.\n* impressive f2.8, close focusing distance, beautiful bokeh, so you can get very up close (great for portraits, or macro-type shots)\n* minimal barrel distortion.\n* gorgeous starbursts. i know it's a love/hate thing, and i know you can apply them in post, but on the photos i've taken with this lens where they are present, i just love how they look and the character they add.\n* really great contrast, i just love how the photos look straight out of camera.\n* only real downside is manual focus: but all the photos i've taken with it, the focus is pretty -----> spot !!!  on.\n\nwhy does canon not make a lens like this? or maybe i'm missing it. what i want is a lightweight, compact wide-angle prime lens with minimal distortion, great sooc colors, and can work as well for portraits as landscapes. with starburst please :) rf or ef mount. what's your suggestions?", "sortedWord": "None", "identifyer": 39508, "year": "2021"}, {"Unnamed: 0": 292950, "autor": "Element_905", "date": 1617822045000, "content": "6D MKii wireless live view woes /!/ Is it just me, or is the wireless live view kind of useless? I recently paired the camera to my iPhone 8 and strapped the camera to the back of my car to get driving shots of my buddies on their motorcycles. But the delay/lag was just awful. But the time I tapped to autofocus, they could be in a totally different spot! \n\nAnyone else experience this? Work arounds?", "link": "https://www.reddit.com/r/canon/comments/mm99yo/6d_mkii_wireless_live_view_woes/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "6d mkii wireless live view woes /!/ is it just me, or is the wireless live view kind of useless? i recently paired the camera to my iphone 8 and strapped the camera to the back of my car to get driving shots of my buddies on their motorcycles. but the delay/lag was just awful. but the time i tapped to autofocus, they could be in a totally different -----> spot !!! ! \n\nanyone else experience this? work arounds?", "sortedWord": "None", "identifyer": 39524, "year": "2021"}, {"Unnamed: 0": 293133, "autor": "SereneNectarine", "date": 1620878747000, "content": "Need crop sensor lens help please!!! /!/ Hi everyone, \n\nI recently purchased a Canon EOS Rebel SL3 (also called 250D I believe!)  and I'm super excited to try everything out. The kit lens that came with the camera is the 18-55mm STM. I also added an EF 50mm f/1.8 to my bag when I was purchasing the camera. My issue lies within the following situation, and please correct me if I'm wrong: \n\nThe 250D/SL3 has the APS-C sensor. I believe that this means the camera is a crop sensor. I looked up the crop factor and it seems to be approximately 1.6. That means that with my prime lens, I will actually be taking 80mm shots, is this correct? I am looking to do portraits and have heard that between 50mm-85mm is the sweet spot for that. \n\nMy other questions, regarding the crop sensor again, would mean that even though I have the 18-55mm it would technically only be 28mm-88mm. I am hoping to also do some travelling and landscape photos. Would the 10-18mm be better in general? I know it's a completely separate lens, but would the 18-55mm be serviceable? 28mm seems to be on the higher end for doing landscape.\n\n**TL;DR - Bought the Canon Rebel SL3/250D and need lens recommendations for landscape photos and portraits. Kit came with 18-55mm and I purchased the 50mm f/1.8.** \n\nI have tried to do my research, but I am still very much a newbie. Thank you in advance for the help.", "link": "https://www.reddit.com/r/canon/comments/nb80qh/need_crop_sensor_lens_help_please/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need crop sensor lens help please!!! /!/ hi everyone, \n\ni recently purchased a canon eos rebel sl3 (also called 250d i believe!)  and i'm super excited to try everything out. the kit lens that came with the camera is the 18-55mm stm. i also added an ef 50mm f/1.8 to my bag when i was purchasing the camera. my issue lies within the following situation, and please correct me if i'm wrong: \n\nthe 250d/sl3 has the aps-c sensor. i believe that this means the camera is a crop sensor. i looked up the crop factor and it seems to be approximately 1.6. that means that with my prime lens, i will actually be taking 80mm shots, is this correct? i am looking to do portraits and have heard that between 50mm-85mm is the sweet -----> spot !!!  for that. \n\nmy other questions, regarding the crop sensor again, would mean that even though i have the 18-55mm it would technically only be 28mm-88mm. i am hoping to also do some travelling and landscape photos. would the 10-18mm be better in general? i know it's a completely separate lens, but would the 18-55mm be serviceable? 28mm seems to be on the higher end for doing landscape.\n\n**tl;dr - bought the canon rebel sl3/250d and need lens recommendations for landscape photos and portraits. kit came with 18-55mm and i purchased the 50mm f/1.8.** \n\ni have tried to do my research, but i am still very much a newbie. thank you in advance for the help.", "sortedWord": "None", "identifyer": 39716, "year": "2021"}, {"Unnamed: 0": 293216, "autor": "BlueCosmo5050", "date": 1615661335000, "content": "Photos from 2012 Canon 5D Mark iii with the original 24-70 2.8. How would you change a photo from back then, today? /!/ &amp;#x200B;\n\n[Aurora HDR from Lightroom ](https://preview.redd.it/ay6uavqzcum61.jpg?width=5760&amp;format=pjpg&amp;auto=webp&amp;s=28ee323e9331d3e67beeed870d9a6f648d0b4af4)\n\n[Lightroom](https://preview.redd.it/j7al5vrzcum61.jpg?width=5760&amp;format=pjpg&amp;auto=webp&amp;s=a40a4808297f89fafdb4b89a95bf60eb18c880c6)\n\nI have come  a long way since I took this photo in 2012. Obviously it doesn't have much of a focal point but I still like it. Today I would have shot on a Tripod, I would have bracketed the shot, though dynamic range is not a problem. I would have probably shot at F8, I would have taken 7 shots with a 2 sec timer and the shutter speed would be whatever. \n\nI would have edited it much different but I tried to re-edit them today. Unfortunately I do not have the RAW files, so I could only do so much. You are seeing today's edit, one of them I edited in Lightroom and the other one I edited in Aurora HDR. \n\nCompared the original there wasn't much I could do, due to it not being a RAW file. The original was very contrasty. I have turned down the vibrance and saturation in these newer versions. I also went into Photoshop and used the spot healing tool to take out my water mark. I used to water mark images back then and I regret that I did that.\n\nPost some images that you would change today.\n\n1/400 F 4.5 ISO 100, 24-70 2.8 at 34mm. 5D Mark iii. (ALSO I had to compress these files a good bit to fit on here. So if you zoom in looking for the 1:1 quality you are not getting an accurate representation.)", "link": "https://www.reddit.com/r/canon/comments/m4ck02/photos_from_2012_canon_5d_mark_iii_with_the/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "photos from 2012 canon 5d mark iii with the original 24-70 2.8. how would you change a photo from back then, today? /!/ &amp;#x200b;\n\n[aurora hdr from lightroom ](https://preview.redd.it/ay6uavqzcum61.jpg?width=5760&amp;format=pjpg&amp;auto=webp&amp;s=28ee323e9331d3e67beeed870d9a6f648d0b4af4)\n\n[lightroom](https://preview.redd.it/j7al5vrzcum61.jpg?width=5760&amp;format=pjpg&amp;auto=webp&amp;s=a40a4808297f89fafdb4b89a95bf60eb18c880c6)\n\ni have come  a long way since i took this photo in 2012. obviously it doesn't have much of a focal point but i still like it. today i would have shot on a tripod, i would have bracketed the shot, though dynamic range is not a problem. i would have probably shot at f8, i would have taken 7 shots with a 2 sec timer and the shutter speed would be whatever. \n\ni would have edited it much different but i tried to re-edit them today. unfortunately i do not have the raw files, so i could only do so much. you are seeing today's edit, one of them i edited in lightroom and the other one i edited in aurora hdr. \n\ncompared the original there wasn't much i could do, due to it not being a raw file. the original was very contrasty. i have turned down the vibrance and saturation in these newer versions. i also went into photoshop and used the -----> spot !!!  healing tool to take out my water mark. i used to water mark images back then and i regret that i did that.\n\npost some images that you would change today.\n\n1/400 f 4.5 iso 100, 24-70 2.8 at 34mm. 5d mark iii. (also i had to compress these files a good bit to fit on here. so if you zoom in looking for the 1:1 quality you are not getting an accurate representation.)", "sortedWord": "None", "identifyer": 39801, "year": "2021"}, {"Unnamed: 0": 293359, "autor": "Rens_Berg", "date": 1621857130000, "content": "[Advice wanted] on choosing between the Tamron EF 35mm 1.4 vs Canon RF 35mm 1.8 IS (and on the ethics of opening a package and testing a lens you had planned on returning) /!/ Last friday I spotted a nice deal on a well known website (the big A) on the **Tamron EF 35mm f/1.4**. I bought it for 600 euro's, whereas normally in Europe this lens costs north of 850 euro's. Admittedly, it was a bit of an impuls purchase, but I figured since the website stated there were only 2 lenses left, I decided to at least claim one first and than think it over for a bit. Just 3 hours later, having watched some reviews on the **Canon RF 35mm 1.8**, I decided to cancel my order. Amazon described my cancelation as pending. Nevertheless, today I get a confirmation that my order is in fact shipped.\n\nNow I am a little bit tempted to try and test out the lens when it arrives, but at the same time I feel wrong doing this, knowing the Canon RF 35mm 1.8 probably suites me better. (Something, something, trying to limit my carbon footprint). I feel I haven't fully made up my mind, which is the reason I wanted to cancel my order in the first place. The RF lens would be a fun and ideal allround lens. Whereas the Tamron feels more like an investment for future gigs. **I feel my research is quite solid already, but maybe somebody can convince me or weight in their advise for my situation.**\n\n**MY BACKGROUND**I'm a student on a tight budget, and make occasionally some money with gigs (portraits or events/performances/sports). However, with corona it takes me about 3 months to make back this investment. **I own an EOS RP and a Tamron 24-70 G2**. Also I can use a handful of old but decent primes that I can lend from my dad. I learned quickly that I prefer to use these primes over my zoom for portrait photography, however the 24-70 proofed to be real valuable for run &amp; gun event-photography. (Also, all my dad's wide-angle primes are f/2.8 and lacking in sharpness when not stopped down). That's why I've been eyeing on a solid 35mm lens (to team up with the EF 50mm 1.8 and EF 85mm 1.8).\n\n**TAMRON EF 35mm f/1.4**\n\n* **PROS:** Bigger aperture, pro rendering/bokeh, weather-sealed, fast and quiet AF, sharpest 35mm to date, nicely build, ideal for portrait- &amp; astrophotography (which was something I'd like to give a try). Can be used on my dad's older Canon 7D.\n* **CONS:** Just as large and heavy as my 24-70 G2. (Would be a giant amongst my 50mm and 85mm). Not stabilized.\n\n**CANON RF 35mm f/1.8**\n\n* **PROS:** Extremely lightweight and portable, stabilized, decently sharp, macro would be fun to play around with when strolling through nature, ideal for street- &amp; travelphotography as well as occasional filming.\n* **CONS:** Slower and louder AF (STM), not weathersealed, decently sharp wideopen but not quite the luxurious rendering of the Tamron. More abberations making it less suitable for astrophotography.\n\n(I know there is the Tamron EF 35mm 1.8 too, which features IS, weathersealing and a portable form-factor. But from reviews and test charts images I saw, the abberations and sharpness were just a little bit dissapointing. Furthermore it costs currently more than the Tamron 35mm 1.4 here in Europe.)", "link": "https://www.reddit.com/r/canon/comments/njw5pu/advice_wanted_on_choosing_between_the_tamron_ef/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "[advice wanted] on choosing between the tamron ef 35mm 1.4 vs canon rf 35mm 1.8 is (and on the ethics of opening a package and testing a lens you had planned on returning) /!/ last friday i -----> spotted !!!  a nice deal on a well known website (the big a) on the **tamron ef 35mm f/1.4**. i bought it for 600 euro's, whereas normally in europe this lens costs north of 850 euro's. admittedly, it was a bit of an impuls purchase, but i figured since the website stated there were only 2 lenses left, i decided to at least claim one first and than think it over for a bit. just 3 hours later, having watched some reviews on the **canon rf 35mm 1.8**, i decided to cancel my order. amazon described my cancelation as pending. nevertheless, today i get a confirmation that my order is in fact shipped.\n\nnow i am a little bit tempted to try and test out the lens when it arrives, but at the same time i feel wrong doing this, knowing the canon rf 35mm 1.8 probably suites me better. (something, something, trying to limit my carbon footprint). i feel i haven't fully made up my mind, which is the reason i wanted to cancel my order in the first place. the rf lens would be a fun and ideal allround lens. whereas the tamron feels more like an investment for future gigs. **i feel my research is quite solid already, but maybe somebody can convince me or weight in their advise for my situation.**\n\n**my background**i'm a student on a tight budget, and make occasionally some money with gigs (portraits or events/performances/sports). however, with corona it takes me about 3 months to make back this investment. **i own an eos rp and a tamron 24-70 g2**. also i can use a handful of old but decent primes that i can lend from my dad. i learned quickly that i prefer to use these primes over my zoom for portrait photography, however the 24-70 proofed to be real valuable for run &amp; gun event-photography. (also, all my dad's wide-angle primes are f/2.8 and lacking in sharpness when not stopped down). that's why i've been eyeing on a solid 35mm lens (to team up with the ef 50mm 1.8 and ef 85mm 1.8).\n\n**tamron ef 35mm f/1.4**\n\n* **pros:** bigger aperture, pro rendering/bokeh, weather-sealed, fast and quiet af, sharpest 35mm to date, nicely build, ideal for portrait- &amp; astrophotography (which was something i'd like to give a try). can be used on my dad's older canon 7d.\n* **cons:** just as large and heavy as my 24-70 g2. (would be a giant amongst my 50mm and 85mm). not stabilized.\n\n**canon rf 35mm f/1.8**\n\n* **pros:** extremely lightweight and portable, stabilized, decently sharp, macro would be fun to play around with when strolling through nature, ideal for street- &amp; travelphotography as well as occasional filming.\n* **cons:** slower and louder af (stm), not weathersealed, decently sharp wideopen but not quite the luxurious rendering of the tamron. more abberations making it less suitable for astrophotography.\n\n(i know there is the tamron ef 35mm 1.8 too, which features is, weathersealing and a portable form-factor. but from reviews and test charts images i saw, the abberations and sharpness were just a little bit dissapointing. furthermore it costs currently more than the tamron 35mm 1.4 here in europe.)", "sortedWord": "None", "identifyer": 39950, "year": "2021"}, {"Unnamed: 0": 293370, "autor": "poisonlords", "date": 1623689484000, "content": "My camera has a permanent black spot. I have cleaned the whole camera inside out and these spots are still showing. Does anyone have any idea what it could be?", "link": "https://www.reddit.com/r/canon/comments/nzr87o/my_camera_has_a_permanent_black_spot_i_have/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my camera has a permanent black -----> spot !!! . i have cleaned the whole camera inside out and these spots are still showing. does anyone have any idea what it could be?", "sortedWord": "None", "identifyer": 39962, "year": "2021"}, {"Unnamed: 0": 293411, "autor": "rijulgarg", "date": 1623481328000, "content": "[Help] [Question] 7D Mark II’s Auto Sensor clean function failing. /!/ My (at this point) 6 year old 7D Mark II is finally showing its age.\nThe Sensor isn’t cleaning on its own, producing pictures with dirt spots.\nAnd when shooting during the day, (I’m in India so the weather hits 40°C during summers) mainly b/w 9am-4pm, the camera gets hot and ends up corrupting all the pictures.\n\nMy question is: When I gave it for repair, the official service center is asking for a whopping $480 to replace the CMOS and the motherboard.\n\nShould I pay them? \nIs this the correct quote for the repair? \nAm I better off getting an EOS RP with an RF to EF/S adapter?\n\nSimilar experiences with this camera are welcomed.\nThanks.", "link": "https://www.reddit.com/r/canon/comments/ny0tjf/help_question_7d_mark_iis_auto_sensor_clean/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[help] [question] 7d mark ii’s auto sensor clean function failing. /!/ my (at this point) 6 year old 7d mark ii is finally showing its age.\nthe sensor isn’t cleaning on its own, producing pictures with dirt -----> spots !!! .\nand when shooting during the day, (i’m in india so the weather hits 40°c during summers) mainly b/w 9am-4pm, the camera gets hot and ends up corrupting all the pictures.\n\nmy question is: when i gave it for repair, the official service center is asking for a whopping $480 to replace the cmos and the motherboard.\n\nshould i pay them? \nis this the correct quote for the repair? \nam i better off getting an eos rp with an rf to ef/s adapter?\n\nsimilar experiences with this camera are welcomed.\nthanks.", "sortedWord": "None", "identifyer": 40004, "year": "2021"}, {"Unnamed: 0": 293658, "autor": "tkallgren23", "date": 1627436221000, "content": "Stubborn Canon 6d mark II owner looking for help on viewfinder focus issue /!/ Hello,\n\nI've had the canon 6d mark ii for over three years now and I've had consistent issues with finding focus through the viewfinder. I use my camera almost every day and now for work and I'm honestly embarrassed to say that I've either counteracted this issue by shooting a bunch of photos through the viewfinder (clicking and releasing, refocusing each time) or just by tapping on the live view screen. I'm not of a much gearhead, much to my detriment, as I'm sure there is probably an easy way to fix this with certain settings or tweaks. I usually shoot on spot AF or zone AF if I'm using the viewfinder and this has horrible inconsistency whereas the live view tap focus is 100% accurate. Has anyone here had issues with this? I'm probably asking a silly question here but it's actually really annoying because it's one of those issues I quickly adapted into my routine and haven't questioned until I fucked up a photo today. Thank you!!!!!!! Love reddit.", "link": "https://www.reddit.com/r/canon/comments/ot01rd/stubborn_canon_6d_mark_ii_owner_looking_for_help/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "stubborn canon 6d mark ii owner looking for help on viewfinder focus issue /!/ hello,\n\ni've had the canon 6d mark ii for over three years now and i've had consistent issues with finding focus through the viewfinder. i use my camera almost every day and now for work and i'm honestly embarrassed to say that i've either counteracted this issue by shooting a bunch of photos through the viewfinder (clicking and releasing, refocusing each time) or just by tapping on the live view screen. i'm not of a much gearhead, much to my detriment, as i'm sure there is probably an easy way to fix this with certain settings or tweaks. i usually shoot on -----> spot !!!  af or zone af if i'm using the viewfinder and this has horrible inconsistency whereas the live view tap focus is 100% accurate. has anyone here had issues with this? i'm probably asking a silly question here but it's actually really annoying because it's one of those issues i quickly adapted into my routine and haven't questioned until i fucked up a photo today. thank you!!!!!!! love reddit.", "sortedWord": "None", "identifyer": 40257, "year": "2021"}, {"Unnamed: 0": 293817, "autor": "Jcb2016", "date": 1629685114000, "content": "Spot Metering /!/ So I'm really interested in spot metering, trying to see how to use it. Example I'm in manual with auto iso I get an exposure with matrix metering. I switch to spot and I see the spot but my iso isn't moving or switching. am I not doing something right or is my iso suppose to move when I put the spot on an object or person?\n\nSomone told me on another form that i should just assume its metering for it and use Exposure compensation +1 or +2 if it is a lighter object and -1 or -2 if its a darker subject. is this true?\n\nAny help is appreciated", "link": "https://www.reddit.com/r/canon/comments/p9qc49/spot_metering/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering /!/ so i'm really interested in spot metering, trying to see how to use it. example i'm in manual with auto iso i get an exposure with matrix metering. i switch to spot and i see the spot but my iso isn't moving or switching. am i not doing something right or is my iso suppose to move when i put the spot on an object or person?\n\nsomone told me on another form that i should just assume its metering for it and use exposure compensation +1 or +2 if it is a lighter object and -1 or -2 if its a darker subject. is this true?\n\nany help is appreciated", "sortedWord": "None", "identifyer": 40420, "year": "2021"}, {"Unnamed: 0": 293833, "autor": "SirNerdyKnight", "date": 1629601518000, "content": "Blue dot. But not lens flare(?) /!/ So I just bought a used and in good condition Canon T4i. I just recently noticed there is a single blue dot in the same spot, but when I first turn it on its not there. Only when I start adjusting my aperture to make the picture brighter it appears. Here's the kicker, when I take a picture it doesn't show up. Could it be a single bad pixle? I'm confused and it's a little irritating. Even though it doesn't effect my pictures it just bothers me. Is there a way to fix this?", "link": "https://www.reddit.com/r/canon/comments/p94vrs/blue_dot_but_not_lens_flare/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "blue dot. but not lens flare(?) /!/ so i just bought a used and in good condition canon t4i. i just recently noticed there is a single blue dot in the same -----> spot !!! , but when i first turn it on its not there. only when i start adjusting my aperture to make the picture brighter it appears. here's the kicker, when i take a picture it doesn't show up. could it be a single bad pixle? i'm confused and it's a little irritating. even though it doesn't effect my pictures it just bothers me. is there a way to fix this?", "sortedWord": "None", "identifyer": 40438, "year": "2021"}, {"Unnamed: 0": 293869, "autor": "Emotional_Ad_4911", "date": 1632483270000, "content": "Black Spot Issue /!/ I have a black spot issue on my 4000d for couple weeks, how do I fix this issue?", "link": "https://www.reddit.com/r/canon/comments/puhvny/black_spot_issue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "black -----> spot !!!  issue /!/ i have a black spot issue on my 4000d for couple weeks, how do i fix this issue?", "sortedWord": "None", "identifyer": 40475, "year": "2021"}, {"Unnamed: 0": 293950, "autor": "SteadiJam", "date": 1628894079000, "content": "TONS of \"Hot\" Pixels on my Canon EOS R /!/ I just noticed this after doing some night time-lapses. Pretty much all I do is time-lapse photography.\n\nThing is, I do a lot of city nights and night sky time-lapses (tiny bright lights are expected haha), so I didn't notice all of these hot pixels until my last city time-lapse a day or two ago. Did a test with a lens cap on and they're everywhere. Not one or two, like 40-50.\n\nI've tried automatic and manual sensor cleaning. The sensor itself and all glass are free from spots.\n\nNothing worked so far.\n\nIs there a different way to remap these pixels, or do I need to send it in to Canon? Thanks and any advice is very much appreciated!", "link": "https://www.reddit.com/r/canon/comments/p3vu82/tons_of_hot_pixels_on_my_canon_eos_r/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "tons of \"hot\" pixels on my canon eos r /!/ i just noticed this after doing some night time-lapses. pretty much all i do is time-lapse photography.\n\nthing is, i do a lot of city nights and night sky time-lapses (tiny bright lights are expected haha), so i didn't notice all of these hot pixels until my last city time-lapse a day or two ago. did a test with a lens cap on and they're everywhere. not one or two, like 40-50.\n\ni've tried automatic and manual sensor cleaning. the sensor itself and all glass are free from -----> spots !!! .\n\nnothing worked so far.\n\nis there a different way to remap these pixels, or do i need to send it in to canon? thanks and any advice is very much appreciated!", "sortedWord": "None", "identifyer": 40557, "year": "2021"}, {"Unnamed: 0": 293986, "autor": "n8pu", "date": 1628791451000, "content": "Complaint and Question /!/ I just got delivered my 'new to me' Cannon EOS Rebel T7i and have downloaded the PDF file from the Canon web site so I could hopefully be able to search for information I was wanting to get info on, but the file won't let me search. I have tried numerous times with different PDF readers only to get the response that it can't find what I'm looking for, I then scrolled to a random spot and searched for a word I was looking at on the screen. Same result, GRRRrrr...\n\nI then open a PDF file file for my EOS XSi, did a search and it had no problem finding what I was looking for, what gives, this is frustrating.\n\nDid Canon 'protect' the PDF file for that camera? Is there another web site other than Canon where I can get a PDF for that camera that will allow me to search it?", "link": "https://www.reddit.com/r/canon/comments/p35axh/complaint_and_question/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "complaint and question /!/ i just got delivered my 'new to me' cannon eos rebel t7i and have downloaded the pdf file from the canon web site so i could hopefully be able to search for information i was wanting to get info on, but the file won't let me search. i have tried numerous times with different pdf readers only to get the response that it can't find what i'm looking for, i then scrolled to a random -----> spot !!!  and searched for a word i was looking at on the screen. same result, grrrrrr...\n\ni then open a pdf file file for my eos xsi, did a search and it had no problem finding what i was looking for, what gives, this is frustrating.\n\ndid canon 'protect' the pdf file for that camera? is there another web site other than canon where i can get a pdf for that camera that will allow me to search it?", "sortedWord": "None", "identifyer": 40593, "year": "2021"}, {"Unnamed: 0": 294082, "autor": "SocialDistanceMedia", "date": 1631460057000, "content": "Canon FD 50mm 1.4 lens + R5 w/ adapter: question about an issue with image results /!/ I just picked up a Fotdio X Pro FD to RF adapter and got an FD 50mm 1.4 lens to try out. While overall I'm quite impressed with the general quality of the results, I noticed more than a few shots with a purple-ish, somewhat decolorized spot right in the middle.   \nSee this example: [https://imgur.com/a/dolCHQ7](https://imgur.com/a/dolCHQ7)  \n\n\nI believe I was shooting f11 in that shot. \n\nIs this a defect of the lens or is there something else going on that needs addressed? If it's a defect, I can return to the store and swap it for another lens as they have a great return policy.", "link": "https://www.reddit.com/r/canon/comments/pmumhk/canon_fd_50mm_14_lens_r5_w_adapter_question_about/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon fd 50mm 1.4 lens + r5 w/ adapter: question about an issue with image results /!/ i just picked up a fotdio x pro fd to rf adapter and got an fd 50mm 1.4 lens to try out. while overall i'm quite impressed with the general quality of the results, i noticed more than a few shots with a purple-ish, somewhat decolorized -----> spot !!!  right in the middle.   \nsee this example: [https://imgur.com/a/dolchq7](https://imgur.com/a/dolchq7)  \n\n\ni believe i was shooting f11 in that shot. \n\nis this a defect of the lens or is there something else going on that needs addressed? if it's a defect, i can return to the store and swap it for another lens as they have a great return policy.", "sortedWord": "None", "identifyer": 40690, "year": "2021"}, {"Unnamed: 0": 294367, "autor": "barb9212", "date": 1612400325000, "content": "M6 Mark II &amp; Sigma 1.4 for EF-M /!/ Just wanted to make a post about how awesome this lens is. I bought a M6 Mark II and got a kit lens for like $50 used and kept wondering if I made the right choice. As a newbie and potential hobbiest I kept looking over and over at full frame cameras like the EOS RP and the Sony A7III and kept having buyers remorse about my purchase.\n\nThis lens has completely changed my opinion. The images and video that come out of this is amazing. When you guys say lens matter more than camera bodies you all are spot on.\n\nMy only concern is that the camera isn’t weather  sealed which limits me some what but so excited to take shots with this.", "link": "https://www.reddit.com/r/canon/comments/lc3e7p/m6_mark_ii_sigma_14_for_efm/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "m6 mark ii &amp; sigma 1.4 for ef-m /!/ just wanted to make a post about how awesome this lens is. i bought a m6 mark ii and got a kit lens for like $50 used and kept wondering if i made the right choice. as a newbie and potential hobbiest i kept looking over and over at full frame cameras like the eos rp and the sony a7iii and kept having buyers remorse about my purchase.\n\nthis lens has completely changed my opinion. the images and video that come out of this is amazing. when you guys say lens matter more than camera bodies you all are -----> spot !!!  on.\n\nmy only concern is that the camera isn’t weather  sealed which limits me some what but so excited to take shots with this.", "sortedWord": "None", "identifyer": 40979, "year": "2021"}, {"Unnamed: 0": 294743, "autor": "Impressed-One", "date": 1611344148000, "content": "Are these fungus? /!/ Hi everyone,\n\ntoday i received the used lens i had ordered on ebay, a Vivitar 500mm f/8 mirror lens.\n\nI wanted to use it on my Canon eos 250d but it has some spots on the rear lens so I wanted to know if it could be fungus or just the damaged lens coating.\n\nI'm going to try the lens tomorrow morning (it's too dark now to try it).\n\nI attach photos of the lens, I thank anyone who can clarify my doubt.\n\n[https://imgur.com/a/NeS2HdY](https://imgur.com/a/NeS2HdY)\n\nPs. english is not my first language so i apologize for the mistakes.", "link": "https://www.reddit.com/r/canon/comments/l2v6mt/are_these_fungus/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are these fungus? /!/ hi everyone,\n\ntoday i received the used lens i had ordered on ebay, a vivitar 500mm f/8 mirror lens.\n\ni wanted to use it on my canon eos 250d but it has some -----> spots !!!  on the rear lens so i wanted to know if it could be fungus or just the damaged lens coating.\n\ni'm going to try the lens tomorrow morning (it's too dark now to try it).\n\ni attach photos of the lens, i thank anyone who can clarify my doubt.\n\n[https://imgur.com/a/nes2hdy](https://imgur.com/a/nes2hdy)\n\nps. english is not my first language so i apologize for the mistakes.", "sortedWord": "None", "identifyer": 41361, "year": "2021"}, {"Unnamed: 0": 294784, "autor": "JasonFerry", "date": 1611193097000, "content": "What's making these spots? I've switched lenses and it's still there so it's something with the body itself, right?", "link": "https://www.reddit.com/r/canon/comments/l1nz04/whats_making_these_spots_ive_switched_lenses_and/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what's making these -----> spots !!! ? i've switched lenses and it's still there so it's something with the body itself, right?", "sortedWord": "None", "identifyer": 41404, "year": "2021"}, {"Unnamed: 0": 295104, "autor": "ogrozdimaqw", "date": 1618526100000, "content": "Canon M50 Problem: Glitched Video Footage /!/ Hello everyone. This is my first time posting in the Canon subreddit because I'm having an issue with my Canon M50 that I bought brand new from Best Buy last week. I recorded a YouTube video, and after I put the footage on my PC, a few parts of it appeared to be glitched out. I played the footage back again on my camera and it's just fine. Could it be that I'm using an older and somewhat beat-up SD card? It's an 80 Mb/s Sandisk Pixtor. Do let me know what the issue could possibly be!\n\nEDIT: I've tried recording footage with a much better SD card and the issue still persists. What's frustrating is that now it glitches in random parts until I import the footage in Premiere and then it glitches in the same exact spots every time. I'm beyond frustrated.\n\nhttps://preview.redd.it/15cx49qsm2t41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=a3473b58af75222e5274c33e45308013a3571884", "link": "https://www.reddit.com/r/canon/comments/mrpuou/canon_m50_problem_glitched_video_footage/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon m50 problem: glitched video footage /!/ hello everyone. this is my first time posting in the canon subreddit because i'm having an issue with my canon m50 that i bought brand new from best buy last week. i recorded a youtube video, and after i put the footage on my pc, a few parts of it appeared to be glitched out. i played the footage back again on my camera and it's just fine. could it be that i'm using an older and somewhat beat-up sd card? it's an 80 mb/s sandisk pixtor. do let me know what the issue could possibly be!\n\nedit: i've tried recording footage with a much better sd card and the issue still persists. what's frustrating is that now it glitches in random parts until i import the footage in premiere and then it glitches in the same exact -----> spots !!!  every time. i'm beyond frustrated.\n\nhttps://preview.redd.it/15cx49qsm2t41.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=a3473b58af75222e5274c33e45308013a3571884", "sortedWord": "None", "identifyer": 41730, "year": "2021"}, {"Unnamed: 0": 295379, "autor": "drillad", "date": 1623004012000, "content": "Film lens recommendations for Canon SL3 /!/ Excuse me if some of my lingo sounds stilted I’m still learning about cameras. I got the SL3 mostly to take videos and make amateur films. I’m now looking to spend hopefully my max $350 on a new lens, better suited for that purpose. \n\nI understand the SL3 has a crop factor so the main things I’m looking for are: better lowlight performance, wider frame in general, then maybe tips if you have them on what else I should be looking for in a general film lens. \n\nI was looking a bit at the EF-A 10-18mm and it looked like it gets a fisheye effect I wasn’t crazy about, not sure how much of an issue this would be with filming. \n\nThe other one I’m looking hard at is the EF-S 50mm f/1.8. I’m just worried about losing even more frame cause I might be shooting in some tight spots and I’m not sure how much that’ll come into play. \n\nAny advice/recommendations would be greatly appreciated!", "link": "https://www.reddit.com/r/canon/comments/nts4du/film_lens_recommendations_for_canon_sl3/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film lens recommendations for canon sl3 /!/ excuse me if some of my lingo sounds stilted i’m still learning about cameras. i got the sl3 mostly to take videos and make amateur films. i’m now looking to spend hopefully my max $350 on a new lens, better suited for that purpose. \n\ni understand the sl3 has a crop factor so the main things i’m looking for are: better lowlight performance, wider frame in general, then maybe tips if you have them on what else i should be looking for in a general film lens. \n\ni was looking a bit at the ef-a 10-18mm and it looked like it gets a fisheye effect i wasn’t crazy about, not sure how much of an issue this would be with filming. \n\nthe other one i’m looking hard at is the ef-s 50mm f/1.8. i’m just worried about losing even more frame cause i might be shooting in some tight -----> spots !!!  and i’m not sure how much that’ll come into play. \n\nany advice/recommendations would be greatly appreciated!", "sortedWord": "None", "identifyer": 42014, "year": "2021"}, {"Unnamed: 0": 295426, "autor": "RealGroovyMotion", "date": 1621797003000, "content": "White spot in the middle of my lens /!/ Hi,\n\nI noticed that there was spot on all my images so I decided to clean the the lens and it was still there. I then checked the seonsor, it looked clean and then I realize that the inside of the lens there's a white spot right in the middle of the glass, as seen on the image. I tried to clean it or seeee if it was removable but it's behind the glass, inside. It's a RF 24-105mm lens.\n\nhttps://preview.redd.it/1gi1jzzd5x071.jpg?width=1866&amp;format=pjpg&amp;auto=webp&amp;s=42856b35e6d46d639ab81bacbe3786f7322b7e08\n\nAny idea what it could be?\n\nCheers!", "link": "https://www.reddit.com/r/canon/comments/njepru/white_spot_in_the_middle_of_my_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "white -----> spot !!!  in the middle of my lens /!/ hi,\n\ni noticed that there was spot on all my images so i decided to clean the the lens and it was still there. i then checked the seonsor, it looked clean and then i realize that the inside of the lens there's a white spot right in the middle of the glass, as seen on the image. i tried to clean it or seeee if it was removable but it's behind the glass, inside. it's a rf 24-105mm lens.\n\nhttps://preview.redd.it/1gi1jzzd5x071.jpg?width=1866&amp;format=pjpg&amp;auto=webp&amp;s=42856b35e6d46d639ab81bacbe3786f7322b7e08\n\nany idea what it could be?\n\ncheers!", "sortedWord": "None", "identifyer": 42061, "year": "2021"}, {"Unnamed: 0": 295549, "autor": "GuavaSack", "date": 1620719842000, "content": "Getting back into photography: iPad Pro vs Body/Lens Upgrade /!/ Hi guys,\n\nJust wanted a bit of an opinion. I am getting back into photography after a 4 year hiatus and selling all my gear, and am looking at purchasing an EOS R or R6 (undecided as of yet - caught up on IBIS &amp; megapixels).\n\nAfter Apple recently announced the M1 iPad Pro, I immediately jumped on it via preorder to use as a 'photography tool' with Lightroom and photoshop as I get back into the hobby.\n\nI was having a think today, and am considering cancelling the preorder whilst I still can. It is $1,509.00 AUD, which is a bit more than the difference between an R and R6, or a decent lens (been eyeing off that 16-35 f2.8).\n\nI already own a 16\" MacBook Pro as my daily driver with iMac desktop, so not like I absolutely *need* a dedicated photography device - I guess I had a bit of a dream of taking it out on shoots to edit on the spot and see how I like things...\n\nJust wanted to see what peoples opinions were and if anyone else uses an iPad Pro as their editing tool as opposed to a laptop!", "link": "https://www.reddit.com/r/canon/comments/n9rrdq/getting_back_into_photography_ipad_pro_vs/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "getting back into photography: ipad pro vs body/lens upgrade /!/ hi guys,\n\njust wanted a bit of an opinion. i am getting back into photography after a 4 year hiatus and selling all my gear, and am looking at purchasing an eos r or r6 (undecided as of yet - caught up on ibis &amp; megapixels).\n\nafter apple recently announced the m1 ipad pro, i immediately jumped on it via preorder to use as a 'photography tool' with lightroom and photoshop as i get back into the hobby.\n\ni was having a think today, and am considering cancelling the preorder whilst i still can. it is $1,509.00 aud, which is a bit more than the difference between an r and r6, or a decent lens (been eyeing off that 16-35 f2.8).\n\ni already own a 16\" macbook pro as my daily driver with imac desktop, so not like i absolutely *need* a dedicated photography device - i guess i had a bit of a dream of taking it out on shoots to edit on the -----> spot !!!  and see how i like things...\n\njust wanted to see what peoples opinions were and if anyone else uses an ipad pro as their editing tool as opposed to a laptop!", "sortedWord": "None", "identifyer": 42186, "year": "2021"}, {"Unnamed: 0": 295855, "autor": "Crispykirk", "date": 1625783598000, "content": "Im getting black spots showing up when i take long exposure pictures of the sky but cant see them on normal images", "link": "https://www.reddit.com/r/canon/comments/ogi6af/im_getting_black_spots_showing_up_when_i_take/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "im getting black -----> spots !!!  showing up when i take long exposure pictures of the sky but cant see them on normal images", "sortedWord": "None", "identifyer": 42503, "year": "2021"}, {"Unnamed: 0": 296279, "autor": "Superspyi", "date": 1629288569000, "content": "CaptureOnTouch v4 \"request was aborted\" issue when attaching to email /!/ Hey guys I don't know if I'm in the right spot but I'm gonna assume I am since the sidebar says printers &amp; industrial equipment as well..\n\nWe've got a bunch of Canon DR C225 scanners in our office and I've got one user (and now myself) whenever they scan to attach to an email it will act like it's going to attach and then it'll cancel and say \"request was aborted\" and then kick me back to the previous screen.  I have contacted Canon support twice now and both times they've told me it's not related to their software but it's a Microsoft problem and I need to contact them.  \n\nSo far I have done the following:\n\n1. Uninstalled CaptureOnTouch and driver and reinstalled (also manually deleted all folders leftover after uninstall\n2. Manually copied over folders from a known working computer\n3. Used regfix provided by Canon support\n4. Switched default browser from Outlook 2016 to Thunderbird\n5. Used the latest version\n6. Installed and uninstalled windows updates\n\nI have found a way around it though on the same computer I can log out and log in as a different user and it will work perfectly fine.  So I'm not sure what's going on with this.  I have deleted the users appdata folder entirely as well as just the Canon folders but still no go. The only thing these two PCs do have in common is that both previously had a Fujitsu scansnap scanner before this Canon and the software was uninstalled after the replacement, but we've had plenty of other PCs that's been done on as well. Any ideas?", "link": "https://www.reddit.com/r/canon/comments/p6pusv/captureontouch_v4_request_was_aborted_issue_when/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "captureontouch v4 \"request was aborted\" issue when attaching to email /!/ hey guys i don't know if i'm in the right -----> spot !!!  but i'm gonna assume i am since the sidebar says printers &amp; industrial equipment as well..\n\nwe've got a bunch of canon dr c225 scanners in our office and i've got one user (and now myself) whenever they scan to attach to an email it will act like it's going to attach and then it'll cancel and say \"request was aborted\" and then kick me back to the previous screen.  i have contacted canon support twice now and both times they've told me it's not related to their software but it's a microsoft problem and i need to contact them.  \n\nso far i have done the following:\n\n1. uninstalled captureontouch and driver and reinstalled (also manually deleted all folders leftover after uninstall\n2. manually copied over folders from a known working computer\n3. used regfix provided by canon support\n4. switched default browser from outlook 2016 to thunderbird\n5. used the latest version\n6. installed and uninstalled windows updates\n\ni have found a way around it though on the same computer i can log out and log in as a different user and it will work perfectly fine.  so i'm not sure what's going on with this.  i have deleted the users appdata folder entirely as well as just the canon folders but still no go. the only thing these two pcs do have in common is that both previously had a fujitsu scansnap scanner before this canon and the software was uninstalled after the replacement, but we've had plenty of other pcs that's been done on as well. any ideas?", "sortedWord": "None", "identifyer": 42932, "year": "2021"}, {"Unnamed: 0": 296338, "autor": "spellbreakerstudio", "date": 1631936628000, "content": "How sharp have you shot with the 100-400 mkii? /!/ Ive been shooting it on the r5 for a while and experimenting but still haven't came to a conclision about the sweet spot. Slow shutter/low ISO? High shutter? Hand held? Mounted? Stop down?\n\nI'd love to see some examples of the sharpest images you've taken with it and your settings/conditions.\n\nI also shoot the 1.4 mkiii extender on and off, so if you've got examples of that, let's see!", "link": "https://www.reddit.com/r/canon/comments/pqf4rg/how_sharp_have_you_shot_with_the_100400_mkii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how sharp have you shot with the 100-400 mkii? /!/ ive been shooting it on the r5 for a while and experimenting but still haven't came to a conclision about the sweet -----> spot !!! . slow shutter/low iso? high shutter? hand held? mounted? stop down?\n\ni'd love to see some examples of the sharpest images you've taken with it and your settings/conditions.\n\ni also shoot the 1.4 mkiii extender on and off, so if you've got examples of that, let's see!", "sortedWord": "None", "identifyer": 42994, "year": "2021"}, {"Unnamed: 0": 296724, "autor": "DeathSimulator", "date": 1633219788000, "content": "Shooting in large JPGs with monochromatic preset, at very high ISO and high shutter speed = b&amp;w film simulation? /!/ Didn't wanna include in the title because it'll make it longer, so addition: and make sure u disable noise reduction in custom functions.\n\n\nI really liked the outcome of the images shot with those settings. Using Monochromatic preset to get get rid of chromatic noise, &amp; high shutter speed to compensate the exposure (aperture really depends on your environment/lighting). I found 6400 iso to be the perfect spot for film-like tubular grain ish/ Kodak TMax quality, and 12k ISO, to be \"extreme grain\" / expired b&amp;w film. I've always shot in raw cuz I post process everything on the computer but today, this made consider using this method more. \n\n\nHas anyone tried this before? If u haven't I highly recommend using this approach because the images won't disappoint you, and portraits look amazing too", "link": "https://www.reddit.com/r/canon/comments/q06my2/shooting_in_large_jpgs_with_monochromatic_preset/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shooting in large jpgs with monochromatic preset, at very high iso and high shutter speed = b&amp;w film simulation? /!/ didn't wanna include in the title because it'll make it longer, so addition: and make sure u disable noise reduction in custom functions.\n\n\ni really liked the outcome of the images shot with those settings. using monochromatic preset to get get rid of chromatic noise, &amp; high shutter speed to compensate the exposure (aperture really depends on your environment/lighting). i found 6400 iso to be the perfect -----> spot !!!  for film-like tubular grain ish/ kodak tmax quality, and 12k iso, to be \"extreme grain\" / expired b&amp;w film. i've always shot in raw cuz i post process everything on the computer but today, this made consider using this method more. \n\n\nhas anyone tried this before? if u haven't i highly recommend using this approach because the images won't disappoint you, and portraits look amazing too", "sortedWord": "None", "identifyer": 43404, "year": "2021"}, {"Unnamed: 0": 296863, "autor": "slavandproud", "date": 1634570069000, "content": "5D Mark II Backfocus PROBLEM - What to do? /!/ My little cousin bought a second hand 5D2 after using my old one for a while and growing to like it. Unfortunately, it has a severe backfocus problem, most noticeable when shooting open or close to it. Lens does not seem to matter as we have tried 50mm @ f1.8, 100mm @ f2.8, 24-105mm L @ f4 (at 105mm), 85mm @ 1.8 and they all seem to suffer similar backfocus issues.\n\nMine had a backfocus problem as well, but I managed to fix it with the built in AF microadjustment. His however cannot be fixed this way it seems, as the 20 point microadjustment still doesn't bring the focus all the way to the eyes. \n\nWithout the microadjustment, focusing on the eyes lands the focus around the ears. With the microadjustment it starts landing somewhere in-between the ears and eyes, still leaving the eyes and face noticeably soft. Tested with the center AF point, without re-framing after the AF.\n\nIf he uses liveview, focus is usually spot on, but extremely slow and not practical at all...\n\nWhat is the best course of action that won't cost more than this old camera is worth (it's still great when focus works though)?", "link": "https://www.reddit.com/r/canon/comments/qaop7l/5d_mark_ii_backfocus_problem_what_to_do/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "5d mark ii backfocus problem - what to do? /!/ my little cousin bought a second hand 5d2 after using my old one for a while and growing to like it. unfortunately, it has a severe backfocus problem, most noticeable when shooting open or close to it. lens does not seem to matter as we have tried 50mm @ f1.8, 100mm @ f2.8, 24-105mm l @ f4 (at 105mm), 85mm @ 1.8 and they all seem to suffer similar backfocus issues.\n\nmine had a backfocus problem as well, but i managed to fix it with the built in af microadjustment. his however cannot be fixed this way it seems, as the 20 point microadjustment still doesn't bring the focus all the way to the eyes. \n\nwithout the microadjustment, focusing on the eyes lands the focus around the ears. with the microadjustment it starts landing somewhere in-between the ears and eyes, still leaving the eyes and face noticeably soft. tested with the center af point, without re-framing after the af.\n\nif he uses liveview, focus is usually -----> spot !!!  on, but extremely slow and not practical at all...\n\nwhat is the best course of action that won't cost more than this old camera is worth (it's still great when focus works though)?", "sortedWord": "None", "identifyer": 43548, "year": "2021"}, {"Unnamed: 0": 296866, "autor": "Tscholle22", "date": 1634557049000, "content": "Canon M6 MK II - Looking to get into telezoom. /!/ Hey there,  \n\n\nI've got a question that I could not really answer myself.  \n\n\nSo, I'm a hobby-enthusiast and got a few bucks left for spending into photography. I'm owning a M6 MK II with the 18-55mm kit lens and the 32mm f1.4 lens.   \n\n\nThe kit lens isn't really that good and its image quality does not satisfy me enough.  \n\n\nThe 32mm is absolutely brilliant, but in my case I use its mainly for videowork and a few shots.  \n\n\nThings I'm interested in: Walks in nature, travelling by bike with my cameragear looking for spots and shots, portraits, animal and street. This is what fits me and my portfolio the best. In 2022 I've planned vacations to the Swiss Alps and Norway, so I need kind of a travelzoom.  \n\n\nWhat I'm missing is a descent zoom lens, it would be absolutely awesome to get closer to shots.  \n\n\nThe EF-M 18-150 isn't as sharp as I would like it, and I dont need the low focal length of 18. 32mm with my f1.4 objective are definitely fine for me. The EF-M 55-200 isn't that well, too.  \n\n\nSo, I did my research and checked many different lenses and came to the conclusion that the Canon 70-200mm f4 L IS USM II with the EF-M adapter could be the one lens I should buy.  \nThe bigger f2.8 brother is not really an option regarding its price and weight.   \n\n\nDo any of you guys have any experience with my needs and can relate to it? Is a telelens a descent option for me and could improve my shots/composition?   \n\n\nIm well aware that its the photograph that takes the shot, not his gear. But I'm really into the idea of getting a nice telezoom.  \n\n\nAny thoughts/suggestion/things I've missed in my planning?  \n\n\nThanks :)", "link": "https://www.reddit.com/r/canon/comments/qakw4e/canon_m6_mk_ii_looking_to_get_into_telezoom/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "canon m6 mk ii - looking to get into telezoom. /!/ hey there,  \n\n\ni've got a question that i could not really answer myself.  \n\n\nso, i'm a hobby-enthusiast and got a few bucks left for spending into photography. i'm owning a m6 mk ii with the 18-55mm kit lens and the 32mm f1.4 lens.   \n\n\nthe kit lens isn't really that good and its image quality does not satisfy me enough.  \n\n\nthe 32mm is absolutely brilliant, but in my case i use its mainly for videowork and a few shots.  \n\n\nthings i'm interested in: walks in nature, travelling by bike with my cameragear looking for -----> spots !!!  and shots, portraits, animal and street. this is what fits me and my portfolio the best. in 2022 i've planned vacations to the swiss alps and norway, so i need kind of a travelzoom.  \n\n\nwhat i'm missing is a descent zoom lens, it would be absolutely awesome to get closer to shots.  \n\n\nthe ef-m 18-150 isn't as sharp as i would like it, and i dont need the low focal length of 18. 32mm with my f1.4 objective are definitely fine for me. the ef-m 55-200 isn't that well, too.  \n\n\nso, i did my research and checked many different lenses and came to the conclusion that the canon 70-200mm f4 l is usm ii with the ef-m adapter could be the one lens i should buy.  \nthe bigger f2.8 brother is not really an option regarding its price and weight.   \n\n\ndo any of you guys have any experience with my needs and can relate to it? is a telelens a descent option for me and could improve my shots/composition?   \n\n\nim well aware that its the photograph that takes the shot, not his gear. but i'm really into the idea of getting a nice telezoom.  \n\n\nany thoughts/suggestion/things i've missed in my planning?  \n\n\nthanks :)", "sortedWord": "None", "identifyer": 43551, "year": "2021"}, {"Unnamed: 0": 297095, "autor": "facedodge", "date": 1613353068000, "content": "Handy Canon R Back Button AF Trick I've Discovered /!/ In watching reviews before I bought the R6, I've seen a few say they've dropped the back button AF and moved to half depressed shutter as focus/recompose is no longer a thing. I gave it a go and agree that this is totally workable and a tribute to great engineering but I've developed a lot of muscle memory and I think I've found a good way to put it to use that still makes good use of the great AF of the new R cameras.\n\nMy settings for Custom Buttons:\n\nHalf Depress Shutter is set to \"AE lock\"\n\nAE Lock button is set to \"Metering and AF Start\"\n\nAF-ON is set to \"Eye Detection AF\"\n\nHow it works:\n\nI keep the AF set to \"One point\" and not Eye AF despite me using this most of the time. When I am taking a photo of a person, I use the back button AF button like I'm accustomed and that overrides the AF settings and uses eye detection. When I am taking a photo of a static object I can use either back button AF or the AE lock button (\\*). If the eye AF system doesn't find my intended subject, I just have to move my thumb and relocate the single point AF spot - no switching settings. \n\nSo rather than drop back button AF, I've doubled down and now have two back button AFs. One for eye detection and another for default settings. \n\nI rarely used AE lock in the past and usually had shutter lock AE previously so It's been working great for me. I hope some of you find it useful as well.", "link": "https://www.reddit.com/r/canon/comments/lk2m5s/handy_canon_r_back_button_af_trick_ive_discovered/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "handy canon r back button af trick i've discovered /!/ in watching reviews before i bought the r6, i've seen a few say they've dropped the back button af and moved to half depressed shutter as focus/recompose is no longer a thing. i gave it a go and agree that this is totally workable and a tribute to great engineering but i've developed a lot of muscle memory and i think i've found a good way to put it to use that still makes good use of the great af of the new r cameras.\n\nmy settings for custom buttons:\n\nhalf depress shutter is set to \"ae lock\"\n\nae lock button is set to \"metering and af start\"\n\naf-on is set to \"eye detection af\"\n\nhow it works:\n\ni keep the af set to \"one point\" and not eye af despite me using this most of the time. when i am taking a photo of a person, i use the back button af button like i'm accustomed and that overrides the af settings and uses eye detection. when i am taking a photo of a static object i can use either back button af or the ae lock button (\\*). if the eye af system doesn't find my intended subject, i just have to move my thumb and relocate the single point af -----> spot !!!  - no switching settings. \n\nso rather than drop back button af, i've doubled down and now have two back button afs. one for eye detection and another for default settings. \n\ni rarely used ae lock in the past and usually had shutter lock ae previously so it's been working great for me. i hope some of you find it useful as well.", "sortedWord": "None", "identifyer": 43782, "year": "2021"}, {"Unnamed: 0": 297505, "autor": "Barking_koala", "date": 1621336698000, "content": "[Canon 650d] Blurry AF points after mirror and AF screen cleaning /!/ Hello all,\n\nI own a Canon 650d. Today I noticed dust spots in my viewfinder, and located them on the mirror and the AF screen. I - foolishly - decided to clean those areas using a glass cloth. While I managed the dust off, the 9 AF points are now blurry, very dim and smudgy despite being perfectly sharp before cleaning. \n\nI understand that this is because while touching the AF screen with my glass cloth, it moved around a bit and it is now no longer aligned properly. \n\nI am however quite certain that the AF is still working properly with all 9 points, with pictures in MF and AF producing the same results. The issue seems to be limited to the visual feedback of the flashing red dots. \n\nWhat should I do ? Is there a way to realign the AF screen and getting sharp red dots without causing additional harm ?  \n\nThanks a lot in advance, and have a nice day !", "link": "https://www.reddit.com/r/canon/comments/nf81bh/canon_650d_blurry_af_points_after_mirror_and_af/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[canon 650d] blurry af points after mirror and af screen cleaning /!/ hello all,\n\ni own a canon 650d. today i noticed dust -----> spots !!!  in my viewfinder, and located them on the mirror and the af screen. i - foolishly - decided to clean those areas using a glass cloth. while i managed the dust off, the 9 af points are now blurry, very dim and smudgy despite being perfectly sharp before cleaning. \n\ni understand that this is because while touching the af screen with my glass cloth, it moved around a bit and it is now no longer aligned properly. \n\ni am however quite certain that the af is still working properly with all 9 points, with pictures in mf and af producing the same results. the issue seems to be limited to the visual feedback of the flashing red dots. \n\nwhat should i do ? is there a way to realign the af screen and getting sharp red dots without causing additional harm ?  \n\nthanks a lot in advance, and have a nice day !", "sortedWord": "None", "identifyer": 44202, "year": "2021"}, {"Unnamed: 0": 297904, "autor": "cokronk", "date": 1633572138000, "content": "Looking at an R6 or Z6ii /!/ I’m looking to buy into a mirrorless system. I used to shoot Canon starting with a 300D, 40D, 5D, and then a 5D mkii before switching to a D750. I eventually ended up shooting mostly posed portraiture and weddings and ended up switching to the D750 when the 5D mkii wasn’t cutting it for low light venues, mediocre dynamic range, and noise banding. The D750 was a huge jump in performance and image quality as well as value coming from the 5D mkii with the other option being a 5D mkiii. Eventually I got more and more into my career and ended up selling off all my equipment and getting out of photography. Now I have the opportunity to purchase a new camera and I’m looking between the R6 and z6ii. \n\nFrom the reviews I’ve been reading the R6 has amazing autofocus. The z6ii has slightly better dynamic range and image quality. I’m also reading that the Nikon glass is rated a bit better than the Canon stuff. I owned the holy trinity of 2.8 zooms for both brands with their DSLR mounts and the Nikon lenses were on point in my opinion. I was originally leaning towards the z6ii, but the AF on the Canon is killer. If I could justify spending the money on the R5 as a hobbiest, I probably would do that. I also think Canon has a lens lineup for their mirrorless system that I like a bit more than Nikon’s. I probably won’t be carrying around a bag with a flash and 4 lenses with me as one of my chief complaints of shooting back when I would do weddings and portraits where I would have to trek to shoot spots was the weight. \n\nIs there really any reason why I should go with one over the other? I’m going to ask the same question in the Nikon sub Reddit as well.", "link": "https://www.reddit.com/r/canon/comments/q2ywfh/looking_at_an_r6_or_z6ii/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looking at an r6 or z6ii /!/ i’m looking to buy into a mirrorless system. i used to shoot canon starting with a 300d, 40d, 5d, and then a 5d mkii before switching to a d750. i eventually ended up shooting mostly posed portraiture and weddings and ended up switching to the d750 when the 5d mkii wasn’t cutting it for low light venues, mediocre dynamic range, and noise banding. the d750 was a huge jump in performance and image quality as well as value coming from the 5d mkii with the other option being a 5d mkiii. eventually i got more and more into my career and ended up selling off all my equipment and getting out of photography. now i have the opportunity to purchase a new camera and i’m looking between the r6 and z6ii. \n\nfrom the reviews i’ve been reading the r6 has amazing autofocus. the z6ii has slightly better dynamic range and image quality. i’m also reading that the nikon glass is rated a bit better than the canon stuff. i owned the holy trinity of 2.8 zooms for both brands with their dslr mounts and the nikon lenses were on point in my opinion. i was originally leaning towards the z6ii, but the af on the canon is killer. if i could justify spending the money on the r5 as a hobbiest, i probably would do that. i also think canon has a lens lineup for their mirrorless system that i like a bit more than nikon’s. i probably won’t be carrying around a bag with a flash and 4 lenses with me as one of my chief complaints of shooting back when i would do weddings and portraits where i would have to trek to shoot -----> spots !!!  was the weight. \n\nis there really any reason why i should go with one over the other? i’m going to ask the same question in the nikon sub reddit as well.", "sortedWord": "None", "identifyer": 44610, "year": "2021"}], "name": "spotcanon2021"}