{"interestingcomments": [{"Unnamed: 0": 53672, "autor": "ChillOneLove", "date": 1552145361000, "content": "I am searching for people that make photos /!/ Hey, I have an Instagram account where I mainly upload art, photography, videography. I want to help photographers by giving them a chance to be uploaded on my Instagram for Free.\n\n[If you are an photographer send me the link of your photos via this form (click here to visit the form)](https://www.chillonelove.com/contact)\n\nOf all photos that will be sent. I will choose a few that will be uploaded on my Instagram.\n\n[Click here to view my Instagram. Please follow if you like the content.](https://www.instagram.com/chillonelove/)\n\nHopefully you will sent me some photos.\n\nHopefully you like it\n\nPlease upvote this so all the photographers will see this post, and I can help them.\n\nHave a Nice day\n\nI will also tag you in the post when I upload the post", "link": "https://www.reddit.com/r/canon/comments/az4kz6/i_am_searching_for_people_that_make_photos/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i am searching for people that make photos /!/ hey, i have an instagram account where i mainly upload art, photography, videography. i want to help photographers by giving them a chance to be uploaded on my instagram for free.\n\n[if you are an photographer send me the link of your photos via this form (click here to visit the form)](https://www.chillonelove.com/contact)\n\nof all photos that will be sent. i will choose a few that will be uploaded on my instagram.\n\n[click here to view my instagram. please follow if you like the content.](https://www.instagram.com/chillonelove/)\n\nhopefully you will sent me some photos.\n\nhopefully you like it\n\nplease upvote this so all the photographers will see this post, and i can help them.\n\nhave a nice day\n\ni will also -----> tag !!!  you in the post when i upload the post", "sortedWord": "None", "identifyer": 55053, "year": "2019"}, {"Unnamed: 0": 57106, "autor": "SparkleandBang", "date": 1557581540000, "content": "2 Months of Shooting with the Canon RP (Pictures Inside) /!/ Hello r/canon, I am just getting back into photography after a 10-year hiatus. Previously, I shot with a Canon 5D Mark II that I remember purchasing for $2300. Being used to the type of images FF can provide, I knew I wanted another FF camera but did not want to pay the high price tag again if I could avoid it.\n\nAlthough there is heavy criticism of the RP due to the exclusion of certain video features, short battery life, lack of DR, etc., this did not blind me from seeing the RP for what it is. A great full-frame camera for $1300. Does it have amazing video features? No. Does it have the best low-light performance? No. Does it have the latest and greatest sensor? No. Is it a very capable camera? **YES**\n\nThe results have absolutely blown me away.\n\n**Here are some of the pictures I've taken with the RP the last 2 months:**\n\n[Pictures] (https://imgur.com/gallery/npB6yQc)", "link": "https://www.reddit.com/r/canon/comments/bnc3es/2_months_of_shooting_with_the_canon_rp_pictures/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "2 months of shooting with the canon rp (pictures inside) /!/ hello r/canon, i am just getting back into photography after a 10-year hiatus. previously, i shot with a canon 5d mark ii that i remember purchasing for $2300. being used to the type of images ff can provide, i knew i wanted another ff camera but did not want to pay the high price -----> tag !!!  again if i could avoid it.\n\nalthough there is heavy criticism of the rp due to the exclusion of certain video features, short battery life, lack of dr, etc., this did not blind me from seeing the rp for what it is. a great full-frame camera for $1300. does it have amazing video features? no. does it have the best low-light performance? no. does it have the latest and greatest sensor? no. is it a very capable camera? **yes**\n\nthe results have absolutely blown me away.\n\n**here are some of the pictures i've taken with the rp the last 2 months:**\n\n[pictures] (https://imgur.com/gallery/npb6yqc)", "sortedWord": "None", "identifyer": 58516, "year": "2019"}, {"Unnamed: 0": 57342, "autor": "Papio-papio", "date": 1560202358000, "content": "Protecting gear while in Costa Rica /!/ I'm leaving for Costa Rica for a month (June to July) and I was wondering whether I should do anything specific to protect my gear while I'm there. I'll be bringing my Canon 80D, EFS 18-135mm IS USM, and EF 100-400mm IS II USM. Now, I'm going there for field school, so I'll actually be living in the rainforest the whole time. Costa Rica is currently in its rain season, so it'll be hot, rain often, and therefore be very humid. How should I go about protecting my gear, both when storing it at the research field station and when using it in the forest? \n\n&amp;#x200B;\n\nOn a side note, any recommendations for gear that would allow me to easily transport and access my camera and lenses while in the field would be greatly appreciated as well. I have been looking at the Peak Design camera cube (medium size) to insert in my Osprey daypack, but I don't know whether it'd be worth getting it given the price tag. \n\n&amp;#x200B;\n\nThanks in advance for the input!", "link": "https://www.reddit.com/r/canon/comments/bz3mvp/protecting_gear_while_in_costa_rica/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "protecting gear while in costa rica /!/ i'm leaving for costa rica for a month (june to july) and i was wondering whether i should do anything specific to protect my gear while i'm there. i'll be bringing my canon 80d, efs 18-135mm is usm, and ef 100-400mm is ii usm. now, i'm going there for field school, so i'll actually be living in the rainforest the whole time. costa rica is currently in its rain season, so it'll be hot, rain often, and therefore be very humid. how should i go about protecting my gear, both when storing it at the research field station and when using it in the forest? \n\n&amp;#x200b;\n\non a side note, any recommendations for gear that would allow me to easily transport and access my camera and lenses while in the field would be greatly appreciated as well. i have been looking at the peak design camera cube (medium size) to insert in my osprey daypack, but i don't know whether it'd be worth getting it given the price -----> tag !!! . \n\n&amp;#x200b;\n\nthanks in advance for the input!", "sortedWord": "None", "identifyer": 58754, "year": "2019"}], "name": "tagcanon2019"}