{"interestingcomments": [{"Unnamed: 0": 133337, "autor": "cafefly", "date": 1541073016000, "content": "Any reviews on using DPP Express on iPad? (Yes, I know it does not support cr2) /!/ I am wondering if I can fit dpp express into my photo work flow in the future.  I currently do not have a camera that dpp express supports.  I am an amateur photographer and do minimal post processing (adjusting crop, overall color/brightness)\n\nRight now, I load all jpg-RAW pictures into lightroom classic cc and then sync it online.  On and iPad, I then choose what photos to either keep (jpg), crop (jpg), edit (RAW), or reject(jpg-RAW).  In lightroom mobile , I crop the jpg, make initial raw edits, and flag x all the rejects.  At that point I go back to my laptop to clean up the changes, delete rejects, export to jpg all the edits, and tag photos.\n\nIn the future, it would be great if I could load pictures (RAW only preferred or jpg-RAW) onto an iPad, keep/reject in DPP express, make RAW edits and export to jpg in DPP Express, and upload to cloud storage (google drive, etc.).  This would let me shoot only RAW, do everything on an ipad, not clutter Photos with RAW files that I will not make additional edits to, and stop using (paying for) lightroom as it is overpowered for my needs.  \n\nI ideally I would also edit metadata on the ipad, but regrettably ios makes that difficult to impossible.  That is another rant.", "link": "https://www.reddit.com/r/canon/comments/9t8pgn/any_reviews_on_using_dpp_express_on_ipad_yes_i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "any reviews on using dpp express on ipad? (yes, i know it does not support cr2) /!/ i am wondering if i can fit dpp express into my photo work flow in the future.  i currently do not have a camera that dpp express supports.  i am an amateur photographer and do minimal post processing (adjusting crop, overall color/brightness)\n\nright now, i load all jpg-raw pictures into lightroom classic cc and then sync it online.  on and ipad, i then choose what photos to either keep (jpg), crop (jpg), edit (raw), or reject(jpg-raw).  in lightroom mobile , i crop the jpg, make initial raw edits, and flag x all the rejects.  at that point i go back to my laptop to clean up the changes, delete rejects, export to jpg all the edits, and -----> tag !!!  photos.\n\nin the future, it would be great if i could load pictures (raw only preferred or jpg-raw) onto an ipad, keep/reject in dpp express, make raw edits and export to jpg in dpp express, and upload to cloud storage (google drive, etc.).  this would let me shoot only raw, do everything on an ipad, not clutter photos with raw files that i will not make additional edits to, and stop using (paying for) lightroom as it is overpowered for my needs.  \n\ni ideally i would also edit metadata on the ipad, but regrettably ios makes that difficult to impossible.  that is another rant.", "sortedWord": "None", "identifyer": 24066, "year": "2018"}], "name": "tagcanon2018"}