{"interestingcomments": [{"autor": "Abon2315", "date": "2021-01-28 17:58:23", "content": "Tough lens decision. /!/ I performed some searches on google/YouTube and came up with limited results. \n\nTrying to decide between the 70-200 2.8 and the 100-500 4.5-7.1. \n\nDo a bunch of different types of photography, portrait, wedding, and large events where the extra zoom could really pay off. \n\nShooting on an r5 body. \n\nOpinions appreciated here! Personal experience is preferred. \n\nA highlight question I’d really love some perspective on. How does each lens perform in low light situations and how does the bokeh perform on these lenses as well. \n\nThank you for taking the time to response, greatly appreciated!", "link": "https://www.reddit.com/r/canon/comments/l73xwj/tough_lens_decision/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "tough lens decision. /!/ i performed some searches on google/youtube and -----> came !!!  -----> up !!!  -----> with !!!  limited results. \n\ntrying to decide between the 70-200 2.8 and the 100-500 4.5-7.1. \n\ndo a bunch of different types of photography, portrait, wedding, and large events where the extra zoom could really pay off. \n\nshooting on an r5 body. \n\nopinions appreciated here! personal experience is preferred. \n\na highlight question i’d really love some perspective on. how does each lens perform in low light situations and how does the bokeh perform on these lenses as well. \n\nthank you for taking the time to response, greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 38238, "year": "2021"}, {"autor": "VangerinoVangerino", "date": "2021-03-27 22:35:45", "content": "5D4 or EOS R /!/ Hi there, I’m in the market for a new camera, and above are my top choices within my budget (preferably under or around £1500/$2000, so I’d be purchasing secondhand.) I was initially going to go for the R although after scouring raw files found out I preferred the look of the 5D, so that became my top choice. Despite this, I’m seeing a lot to suggest the R is the better body and produces brilliant images despite sharing the 5D’s sensor. My main areas of photography are automotive and Architectural, so the presence of many focus points/huge burst rates isn’t particularly relevant. ISO performance and flexibility of raw files are the main areas of concern for me.\n\nI was wondering if anyone who has owned these bodies would be able to point me in the direction of one in particular because I can’t come up with an answer for myself. Thank you\n\nbtw the R6 is nearly double my budget here so that’s off the table I’m afraid. \n\n\n(As per sub rules, I should say I’m experienced in the field of photography)", "link": "https://www.reddit.com/r/canon/comments/meof2e/5d4_or_eos_r/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "5d4 or eos r /!/ hi there, i’m in the market for a new camera, and above are my top choices within my budget (preferably under or around £1500/$2000, so i’d be purchasing secondhand.) i was initially going to go for the r although after scouring raw files found out i preferred the look of the 5d, so that became my top choice. despite this, i’m seeing a lot to suggest the r is the better body and produces brilliant images despite sharing the 5d’s sensor. my main areas of photography are automotive and architectural, so the presence of many focus points/huge burst rates isn’t particularly relevant. iso performance and flexibility of raw files are the main areas of concern for me.\n\ni was wondering if anyone who has owned these bodies would be able to point me in the direction of one in particular because i can’t -----> come !!!  -----> up !!!  -----> with !!!  an answer for myself. thank you\n\nbtw the r6 is nearly double my budget here so that’s off the table i’m afraid. \n\n\n(as per sub rules, i should say i’m experienced in the field of photography)", "sortedWord": "None", "Identifyer": null, "identifyer": 39196, "year": "2021"}, {"autor": "scousepunx", "date": "2021-01-18 02:59:07", "content": "EOS 1000D won't read memory card. says card cannot be formatted and it won't format the card either /!/ as stated above in the post title. my mate bought a secondhand 1000D off of ebay as I needed to borrow a DSLR to enter a photography competition (and he was planning on buying a secondhand one anyways) and it turned up in the post the other day.\n\nso I go out to argos to buy a sandisk memory card and we try to insert it into the camera. the camera threw up an error saying that the card needed to be formatted, so we used the in-built feature to  attempt to format the card. so then it threw up another error saying card can't be formatted and that we should try another card. we tried it with another sandisk but it was coming up with the same errors.   \n\nafter reading some old posts on some photography forums, i heard of one lad who had the same issue and it turned out his internal board that was connected to the memory card slot was \"fucked\" and that canon had to replace it and they sent it to him in 10 days.\n\nI am trying not to panic as the deadline for the comp is this sunday at midday (it's kind of a big deal to me as I could have my photo put up on a billboard in my home city as well as inside a renowned gallery there as well) and my mate has a secondhand camera that could potentially be broken/defective, but he'd have no recourse to send it in for repair as it is second hand. is there anything I can potentially do to try and solve the issue? I have just bought a 3rd memory card from argos to try again and see if it will work with the camera.", "link": "https://www.reddit.com/r/canon/comments/kzlk8d/eos_1000d_wont_read_memory_card_says_card_cannot/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "eos 1000d won't read memory card. says card cannot be formatted and it won't format the card either /!/ as stated above in the post title. my mate bought a secondhand 1000d off of ebay as i needed to borrow a dslr to enter a photography competition (and he was planning on buying a secondhand one anyways) and it turned up in the post the other day.\n\nso i go out to argos to buy a sandisk memory card and we try to insert it into the camera. the camera threw up an error saying that the card needed to be formatted, so we used the in-built feature to  attempt to format the card. so then it threw up another error saying card can't be formatted and that we should try another card. we tried it with another sandisk but it was -----> coming !!!  -----> up !!!  -----> with !!!  the same errors.   \n\nafter reading some old posts on some photography forums, i heard of one lad who had the same issue and it turned out his internal board that was connected to the memory card slot was \"fucked\" and that canon had to replace it and they sent it to him in 10 days.\n\ni am trying not to panic as the deadline for the comp is this sunday at midday (it's kind of a big deal to me as i could have my photo put up on a billboard in my home city as well as inside a renowned gallery there as well) and my mate has a secondhand camera that could potentially be broken/defective, but he'd have no recourse to send it in for repair as it is second hand. is there anything i can potentially do to try and solve the issue? i have just bought a 3rd memory card from argos to try again and see if it will work with the camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 41453, "year": "2021"}, {"autor": "dawgsfan980", "date": "2021-07-09 15:02:32", "content": "Issues with frozen screen. Rebel T6 /!/ Hello everyone, I was out on a walk this morning shooting some nature photos and all the sudden my camera froze up. None of the buttons seem to be working and the screen stays on and frozen even when I turn the camera off. I pulled out the battery and when I replaced it the screen came up with the set date and time options but the buttons still didn’t work. Had anyone experienced and issue like this? Any help would be really appreciated. I’m a beginner and this is my first DSLR so I’m a bit lost.", "link": "https://www.reddit.com/r/canon/comments/ogxelw/issues_with_frozen_screen_rebel_t6/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "issues with frozen screen. rebel t6 /!/ hello everyone, i was out on a walk this morning shooting some nature photos and all the sudden my camera froze up. none of the buttons seem to be working and the screen stays on and frozen even when i turn the camera off. i pulled out the battery and when i replaced it the screen -----> came !!!  -----> up !!!  -----> with !!!  the set date and time options but the buttons still didn’t work. had anyone experienced and issue like this? any help would be really appreciated. i’m a beginner and this is my first dslr so i’m a bit lost.", "sortedWord": "None", "Identifyer": null, "identifyer": 42484, "year": "2021"}, {"autor": "johnbro27", "date": "2021-01-05 23:13:55", "content": "Why does Roger Cicala hate the T8i? /!/ Listening to the lensrental podcast, they did their best and worst products of 2020 show, and I heard Roger really railing on the T8i as the stupidest possible product offering Canon could come up with. I can't keep the consumer models straight (not interested) so I just looked it up on Adorama and--frankly--it looks like a solid entry level camera. They've even got the eye AF (in live view, of course, not the OVF). \n\nAny idea why the hate? Is it because DSLR not mirrorless? Cause they're not going to introduce an EF mount mirrorless beginner camera, that's for sure.", "link": "https://www.reddit.com/r/canon/comments/krafj1/why_does_roger_cicala_hate_the_t8i/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "why does roger cicala hate the t8i? /!/ listening to the lensrental podcast, they did their best and worst products of 2020 show, and i heard roger really railing on the t8i as the stupidest possible product offering canon could -----> come !!!  -----> up !!!  -----> with !!! . i can't keep the consumer models straight (not interested) so i just looked it up on adorama and--frankly--it looks like a solid entry level camera. they've even got the eye af (in live view, of course, not the ovf). \n\nany idea why the hate? is it because dslr not mirrorless? cause they're not going to introduce an ef mount mirrorless beginner camera, that's for sure.", "sortedWord": "None", "Identifyer": null, "identifyer": 43958, "year": "2021"}], "name": "withcanon2021"}