{"interestingcomments": [{"autor": "vegas84", "date": "2019-05-01 16:02:40", "content": "Canon Intervalometer for EOS R /!/ This is really just to help anyone else out who has to go through this and maybe save them a bit of trouble.\n\nI recently bought an EOS R, and wanted to get an Intervalometer for it.  I went to the Canon website and under \"Supplies and Accessories\" for that camera, it said to buy the TC-80N3.  So I bought one on Amazon and got it yesterday, only to find out that it doesn't work.  It has the old three-pin style socket, and the EOS R has something that looks like a headphone jack.  After a ton of research and coming up with nothing, I called Canon.  The guy on the phone was able to give me some direction, and told me that I needed to buy an adapter, part number RA-E3.  It's a bit tough to find, but it's out there.  I wish they'd had this information on their website somewhere...maybe they do, but I couldn't find it.\n\nI know I could have just bought a Vello Shutterboss, but I like Canon accessories for whatever reason.\n\n&amp;#x200B;\n\nHopefully this helps someone out.", "link": "https://www.reddit.com/r/canon/comments/bjitse/canon_intervalometer_for_eos_r/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "canon intervalometer for eos r /!/ this is really just to help anyone else out who has to go through this and maybe save them a bit of trouble.\n\ni recently bought an eos r, and wanted to get an intervalometer for it.  i went to the canon website and under \"supplies and accessories\" for that camera, it said to buy the tc-80n3.  so i bought one on amazon and got it yesterday, only to find out that it doesn't work.  it has the old three-pin style socket, and the eos r has something that looks like a headphone jack.  after a ton of research and -----> coming !!!  -----> up !!!  -----> with !!!  nothing, i called canon.  the guy on the phone was able to give me some direction, and told me that i needed to buy an adapter, part number ra-e3.  it's a bit tough to find, but it's out there.  i wish they'd had this information on their website somewhere...maybe they do, but i couldn't find it.\n\ni know i could have just bought a vello shutterboss, but i like canon accessories for whatever reason.\n\n&amp;#x200b;\n\nhopefully this helps someone out.", "sortedWord": "None", "Identifyer": null, "identifyer": 56618, "year": "2019"}, {"autor": "southtea", "date": "2019-08-16 18:15:13", "content": "MG 5420 print head issue /!/ Wish printers weren't so complicated for no reason at all.\n\nI've got an MG 5420 printer that comes up with the error code 1403. It says the print head is incorrect and to install the proper one. I took out the print head and soaked it in iso alc + water mix. It is fully clean now.\n\nRe-installed print head and ink, getting the same message.\n\nAny ideas to further fix this? Canon's support page and forums offer zero help. I can't find any solution on YouTube.", "link": "https://www.reddit.com/r/canon/comments/cra8uz/mg_5420_print_head_issue/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "mg 5420 print head issue /!/ wish printers weren't so complicated for no reason at all.\n\ni've got an mg 5420 printer that -----> comes !!!  -----> up !!!  -----> with !!!  the error code 1403. it says the print head is incorrect and to install the proper one. i took out the print head and soaked it in iso alc + water mix. it is fully clean now.\n\nre-installed print head and ink, getting the same message.\n\nany ideas to further fix this? canon's support page and forums offer zero help. i can't find any solution on youtube.", "sortedWord": "None", "Identifyer": null, "identifyer": 57318, "year": "2019"}, {"autor": "PixieSnoutMcgee", "date": "2019-03-16 02:28:21", "content": "So I came up with a way to get very cheap lenses. I have a best buy visa card and I pay everything with it. Every expense that I can goes on the card. Then I pay it off at the end of the month. I get points that add up. Last 2 lenses, my 70-200 was $300 and my macro was $200 out of pocket.", "link": "https://www.reddit.com/r/canon/comments/b1nhba/so_i_came_up_with_a_way_to_get_very_cheap_lenses/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "so i -----> came !!!  -----> up !!!  -----> with !!!  a way to get very cheap lenses. i have a best buy visa card and i pay everything with it. every expense that i can goes on the card. then i pay it off at the end of the month. i get points that add up. last 2 lenses, my 70-200 was $300 and my macro was $200 out of pocket.", "sortedWord": "None", "Identifyer": null, "identifyer": 58122, "year": "2019"}, {"autor": "Screwdge_McDickens", "date": "2019-05-08 01:48:07", "content": "Tried to get the EOS R from B&amp;H with the new Payboo card...not amazing /!/ You must have the FULL purchase on the card to get the tax money back.\n\nREWIND: If you’re not familiar with the Payboo credit card from our friends at B&amp;H Photo it is essentially a credit card that you use to purchase anything from the B&amp;H photo website. The purpose of the card is to essentially give you back tax money that the supreme court has ruled they have to start collecting from online orders. You make a purchase using their credit card and they give you back whatever tax money they were forced to collect.\n\nFast Forward:\n\nWhat I found out was they will ask you how much credit you would like before you apply for the card which is pretty standard. Although I have pretty good credit they did not give me the full amount that I needed to complete my purchase. That was not so much an issue as I have some money that I figured I would put my out-of-pocket money to purchase a gift card for the difference.\n\nUnfortunately the entire purchase has to be put on the credit card in order to save tax money. So if the camera you want is $3600 you have to be approved for $3600 otherwise they will charge you tax. So you cannot come up with $2600 worth of credit and $1000 gift card it will force you to have tax. There is no way around this. If you have a gift card, you will pay tax. If you purchase from them without their credit card you will pay tax. IF YOU SPLIT THE PAYMENT, YOU WILL PAY TAX.\n\n The first person I spoke to at B&amp;H seemed very annoyed that I was even asking why my purchase was an issue, followed by an indignant tone when I asked if there was anything they could do. I called back because I felt he was very unhelpful and although the answer was the same the second time I called but, there was a much more pleasant person on the other end of that phone call. The result was still the same. I just paid with cash on hand from a different company, tax free. \n\nThis is a PSA from a professional photographer doing business with them for over 15 years. I doubt YMMV but, let me know if you’ve had a different experience.", "link": "https://www.reddit.com/r/canon/comments/blzd5v/tried_to_get_the_eos_r_from_bh_with_the_new/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "tried to get the eos r from b&amp;h with the new payboo card...not amazing /!/ you must have the full purchase on the card to get the tax money back.\n\nrewind: if you’re not familiar with the payboo credit card from our friends at b&amp;h photo it is essentially a credit card that you use to purchase anything from the b&amp;h photo website. the purpose of the card is to essentially give you back tax money that the supreme court has ruled they have to start collecting from online orders. you make a purchase using their credit card and they give you back whatever tax money they were forced to collect.\n\nfast forward:\n\nwhat i found out was they will ask you how much credit you would like before you apply for the card which is pretty standard. although i have pretty good credit they did not give me the full amount that i needed to complete my purchase. that was not so much an issue as i have some money that i figured i would put my out-of-pocket money to purchase a gift card for the difference.\n\nunfortunately the entire purchase has to be put on the credit card in order to save tax money. so if the camera you want is $3600 you have to be approved for $3600 otherwise they will charge you tax. so you cannot -----> come !!!  -----> up !!!  -----> with !!!  $2600 worth of credit and $1000 gift card it will force you to have tax. there is no way around this. if you have a gift card, you will pay tax. if you purchase from them without their credit card you will pay tax. if you split the payment, you will pay tax.\n\n the first person i spoke to at b&amp;h seemed very annoyed that i was even asking why my purchase was an issue, followed by an indignant tone when i asked if there was anything they could do. i called back because i felt he was very unhelpful and although the answer was the same the second time i called but, there was a much more pleasant person on the other end of that phone call. the result was still the same. i just paid with cash on hand from a different company, tax free. \n\nthis is a psa from a professional photographer doing business with them for over 15 years. i doubt ymmv but, let me know if you’ve had a different experience.", "sortedWord": "None", "Identifyer": null, "identifyer": 58558, "year": "2019"}], "name": "withcanon2019"}