{"interestingcomments": [{"autor": "skyr3ach", "date": "2018-03-06 03:24:49", "content": "Need help picking lenses for 6D (More in Comments) /!/ Hey all,\n\nI will be getting my hands on a 6D soon, and I will be primarily shooting landscape and astro. I was looking up stuff online for recommended lenses (blogs and lenshero) as well as going through the FAQ on r/photography; I came up with a couple potential lenses for my shooting purposes. My budget is around $500, so I based my choices off of that. If you have any recommendations besides the one I listed, please let me know. I would preferably like to choose two lens, one dedicated for landscape and one for general picture-taking. I would appreciate any comments and help! Thank you very much. \n\nPS -\nI'd be willing to go slightly over budget if there is a particular lens that someone highly recommends for my shooting purposes; I'll be getting the body as a gift so I cannot take budget out from the body itself. Since I will most likely be buying accessories like tripods and so forth, I still prefer to keep my budget on the low side. \n\nFor landscape / low light / astro\n\n* Tamron 28-75mm f/2.8 XR Di Canon EF\n\n* Rokinon 14mm f/2.8 IF ED UMC Canon EF\n\n* Samyang 14mm f/2.8 IF ED UMC Canon EF\n\nFor general uses\n\n* Canon EF 24-105mm f/4L IS USM\n* ~~Canon 18-55mm f/3.5-5.6 IS STM~~ Not compatible", "link": "https://www.reddit.com/r/canon/comments/82bznj/need_help_picking_lenses_for_6d_more_in_comments/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "need help picking lenses for 6d (more in comments) /!/ hey all,\n\ni will be getting my hands on a 6d soon, and i will be primarily shooting landscape and astro. i was looking -----> up !!!  stuff online for recommended lenses (blogs and lenshero) as well as going through the faq on r/photography; i -----> came !!!  -----> up !!!  -----> with !!!  a couple potential lenses for my shooting purposes. my budget is around $500, so i based my choices off of that. if you have any recommendations besides the one i listed, please let me know. i would preferably like to choose two lens, one dedicated for landscape and one for general picture-taking. i would appreciate any comments and help! thank you very much. \n\nps -\ni'd be willing to go slightly over budget if there is a particular lens that someone highly recommends for my shooting purposes; i'll be getting the body as a gift so i cannot take budget out from the body itself. since i will most likely be buying accessories like tripods and so forth, i still prefer to keep my budget on the low side. \n\nfor landscape / low light / astro\n\n* tamron 28-75mm f/2.8 xr di canon ef\n\n* rokinon 14mm f/2.8 if ed umc canon ef\n\n* samyang 14mm f/2.8 if ed umc canon ef\n\nfor general uses\n\n* canon ef 24-105mm f/4l is usm\n* ~~canon 18-55mm f/3.5-5.6 is stm~~ not compatible", "sortedWord": "None", "Identifyer": null, "identifyer": 21971, "year": "2018"}, {"autor": "PupShutter", "date": "2018-11-20 00:39:40", "content": "600EX-RT not firing correctly /!/ *Hello, I am new to Reddit, I was suggested to post here because I am not getting any help on the Canon help forums. If my post belongs somewhere else, just let me know where to put it.*\n\n  \nCamera: 1Dx  \nFlash: 600EX-RT (x3)  \nTrigger: ST-E3-RT\n\n&amp;#x200B;\n\nHello, I have 3 600EX-RT's, when using them on camera via the hotshoe, 2 of the 3 are not illuminating the subject like they should. I have run the same tests on all three and concluded that one of them is working properly and the other two are not.\n\n&amp;#x200B;\n\nI have checked it in both ETTL and Manual. I have tried these settings while in wireless mode (Master) and non-wireless mode. They work correctly when using them off-camera in Slave Mode and being triggered by an ST-E3-RT.\n\n&amp;#x200B;\n\nIn ETTL, the exposure comes out as if the speedlight wasn't even turned on. The exposure comes out exaclty the same with the exception of the white balance being a noticeable change. I have adjusted the Flash Exposure Compensation all the way from -3 to +3 and there are no changes.\n\n&amp;#x200B;\n\nIn Manual, the speedlight fires at full power whether it is at 1/128 or 1/1. \n\n&amp;#x200B;\n\nI have done a reset on the speedlight. I have cleared all the functions from the speedlight. I have cleared all the functions through the camera menu. I have changed the batteries.\n\n&amp;#x200B;\n\nThe only thing I can come up with is that there is something wrong with the hotshoe connections but nothing looks out of place or bent, there is no visible debris.  \n\n\nThis all happened in the middle of a job. One moment they were working as they are supposed to, the next they weren't. ", "link": "https://www.reddit.com/r/canon/comments/9ymvmv/600exrt_not_firing_correctly/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "600ex-rt not firing correctly /!/ *hello, i am new to reddit, i was suggested to post here because i am not getting any help on the canon help forums. if my post belongs somewhere else, just let me know where to put it.*\n\n  \ncamera: 1dx  \nflash: 600ex-rt (x3)  \ntrigger: st-e3-rt\n\n&amp;#x200b;\n\nhello, i have 3 600ex-rt's, when using them on camera via the hotshoe, 2 of the 3 are not illuminating the subject like they should. i have run the same tests on all three and concluded that one of them is working properly and the other two are not.\n\n&amp;#x200b;\n\ni have checked it in both ettl and manual. i have tried these settings while in wireless mode (master) and non-wireless mode. they work correctly when using them off-camera in slave mode and being triggered by an st-e3-rt.\n\n&amp;#x200b;\n\nin ettl, the exposure comes out as if the speedlight wasn't even turned on. the exposure comes out exaclty the same with the exception of the white balance being a noticeable change. i have adjusted the flash exposure compensation all the way from -3 to +3 and there are no changes.\n\n&amp;#x200b;\n\nin manual, the speedlight fires at full power whether it is at 1/128 or 1/1. \n\n&amp;#x200b;\n\ni have done a reset on the speedlight. i have cleared all the functions from the speedlight. i have cleared all the functions through the camera menu. i have changed the batteries.\n\n&amp;#x200b;\n\nthe only thing i can -----> come !!!  -----> up !!!  -----> with !!!  is that there is something wrong -----> with !!!  the hotshoe connections but nothing looks out of place or bent, there is no visible debris.  \n\n\nthis all happened in the middle of a job. one moment they were working as they are supposed to, the next they weren't. ", "sortedWord": "None", "Identifyer": null, "identifyer": 22729, "year": "2018"}, {"autor": "icameasdust", "date": "2018-10-20 17:49:44", "content": "Getting Err 1 with 24-70 and 5D Mk IV, but lens works fine on other bodies and other lenses work fine in the mk iv? /!/ Just bought a used 24-70 2.8 version 1 off a friend. I tested it with my backup body (6D) and it worked perfect. I brought it to a wedding this past weekend and went to shoot with it on my MK IV and about 15 photos in I get the error. If I take the lens off and put it back on, I can get about another 15 or so and the. The error again. I’ve never had that error with any other lens on my 5D. So yesterday I shot a wedding and put the 24-70 on my 6d and shot the entire wedding with it as my second body (shot about 1300 photos on it), never had the error. I put it on my 5D after I shot a few hours with no error on the 6d and bam, after about 15 shots, the error pops up again. Has anyone every had a weird issue where the error only came up with one specific combination like this?", "link": "https://www.reddit.com/r/canon/comments/9pw4y7/getting_err_1_with_2470_and_5d_mk_iv_but_lens/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "getting err 1 with 24-70 and 5d mk iv, but lens works fine on other bodies and other lenses work fine in the mk iv? /!/ just bought a used 24-70 2.8 version 1 off a friend. i tested it with my backup body (6d) and it worked perfect. i brought it to a wedding this past weekend and went to shoot with it on my mk iv and about 15 photos in i get the error. if i take the lens off and put it back on, i can get about another 15 or so and the. the error again. i’ve never had that error with any other lens on my 5d. so yesterday i shot a wedding and put the 24-70 on my 6d and shot the entire wedding with it as my second body (shot about 1300 photos on it), never had the error. i put it on my 5d after i shot a few hours with no error on the 6d and bam, after about 15 shots, the error pops up again. has anyone every had a weird issue where the error only -----> came !!!  -----> up !!!  -----> with !!!  one specific combination like this?", "sortedWord": "None", "Identifyer": null, "identifyer": 23971, "year": "2018"}, {"autor": "ars4l4n", "date": "2018-03-16 20:49:26", "content": "looking for a dslr that instantly shows camera feed when turned on while plugged into hdmi (instead of eg an error message) /!/ (deleted old thread because I changed my mind and came up with a solution for that other problem)\n\nmy sony a6000 has the issue that it doesn't instantly show live feed when turning it on while it is connected with hdmi and an AC adapter. You have to press a button first to remove the weird \"no images in this view\"-message https://i.imgur.com/iKTAIwZ.png Do you know cams for up to 400€ (body only) that don't have this issue and have a clean hdmi output?\n\n\nbest regards,\n\nars4l4n\n", "link": "https://www.reddit.com/r/canon/comments/84ypdx/looking_for_a_dslr_that_instantly_shows_camera/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "looking for a dslr that instantly shows camera feed when turned on while plugged into hdmi (instead of eg an error message) /!/ (deleted old thread because i changed my mind and -----> came !!!  -----> up !!!  -----> with !!!  a solution for that other problem)\n\nmy sony a6000 has the issue that it doesn't instantly show live feed when turning it on while it is connected -----> with !!!  hdmi and an ac adapter. you have to press a button first to remove the weird \"no images in this view\"-message https://i.imgur.com/iktaiwz.png do you know cams for up to 400€ (body only) that don't have this issue and have a clean hdmi output?\n\n\nbest regards,\n\nars4l4n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 24213, "year": "2018"}], "name": "withcanon2018"}