{"interestingcomments": [{"autor": "feklipgl", "date": "2020-12-09 03:19:10", "content": "1 year experience with Pixsy - made over $30K so far from 500 photos /!/ I've been using the US find-photo-infringer service Pixsy for a little over a year now and have received payouts on a bunch of infringements they pursued, all for photos on CC-BY or CC-BY-SA licenses. In total I have 500 or so registered with them (though I don't think I have registered cases with more than 50-60 of them). \n\nMy total income from Pixsy this year is $30K, and that's for a really minimal amount of work on my end. I've certainly not received payouts from every single infringer, not even close, but registering for US copyright seems to have helped the amount of cases being successfully cleared, and Pixsy are honest-to-God actually moving to sue 10+ infringers on my behalf, most of them through the local office they're using in Japan. \n\nThe major downside with pixsy is that they claim to be active in a bunch of European jurisdictions, but I've never been able to submit any infringement from any European country except the UK and the Netherlands (and I've never had a successful case in NL). I know Copytrack are more effective in that part of the world (as a friend's company got caught by a photographer using them once). Pixsy is really only effective in the Anglophone world + Japan. When it comes to Japan specifically though they are INCREDIBLY efficient, I think I've actually received compensation for every case I've submitted there (minus the ones they'll be suing). Actually, Japanese cases are responsible for I think 50% of my payouts (despite only constituting maybe 10-20% of my submitted cases)\n\nThe other big negative is that their website is clunky and limited, but it's at least improved a lot over the year, submitting cases is a breeze compared to before, you had to do 20+ mouse clicks per submission, now it's down to like 4. \n\nRegistering US copyright through them was I think more than twice as expensive as doing it yourself, but it was worth it, they dealt with everything and I didn't have to manually add the info/registration numbers for 500-ish photos through their clunky website. Registering the photos also meant my payouts went up a lot, now I think the average I get (i.e. 50%) is maybe $350 or so per infringement, earlier, I think the average was maybe $100 or so (once, I just got $30 for an infringement, lol).\n\nOverall, I'm very happy with them, but I think you need to have A LOT of infringements to fall back on for them to be effective. The chance of a successful outcome on any random case is probably less than 25% and that's WITH US copyright registered, and it's even less without. So you know, I don't think it's for every photographer, and not for every type of infringement. If you definitely want money from a particular infringer that's not based in the US or Japan, you might be better served finding a lawyer in that jurisdiction who can help you out. If you have a bunch of photos with a bunch of infringements and don't particularly care all that much about who gets squeezed and who doesn't, and you want a nice side income without having to actually deal with any of the nasty stuff going on in the sausage factory, I think they're pretty awesome.", "link": "https://www.reddit.com/r/photography/comments/k9jt7u/1_year_experience_with_pixsy_made_over_30k_so_far/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "1 year experience with pixsy - made over $30k so far from 500 photos /!/ i've been using the us find-photo-infringer service pixsy for a little over a year now and have received payouts on a bunch of infringements they pursued, all for photos on cc-by or cc-by-sa licenses. in total i have 500 or so registered with them (though i don't think i have registered cases with more than 50-60 of them). \n\nmy total income from pixsy this year is $30k, and that's for a really minimal amount of work on my end. i've certainly not received payouts from every single infringer, not even close, but registering for us copyright seems to have helped the amount of cases being successfully cleared, and pixsy are honest-to-god actually moving to sue 10+ infringers on my behalf, most of them through the local office they're using in japan. \n\nthe major downside with pixsy is that they claim to be active in a bunch of european jurisdictions, but i've never been able to submit any infringement from any european country except the uk and the netherlands (and i've never had a successful case in nl). i know copytrack are more effective in that part of the world (as a friend's company got caught by a photographer using them once). pixsy is really only effective in the anglophone world + japan. when it comes to japan specifically though they are incredibly efficient, i think i've actually received compensation for every case i've submitted there (minus the ones they'll be suing). actually, japanese cases are responsible for i think 50% of my payouts (despite only constituting maybe 10-20% of my submitted cases)\n\nthe other big negative is that their website is clunky and limited, but it's at least improved a lot over the year, submitting cases is a breeze compared to before, you had to do 20+ mouse clicks per submission, now it's down to like 4. \n\nregistering us copyright through them was i think more than twice as expensive as -----> doing !!!  -----> it !!!  -----> yourself !!! , but -----> it !!!  was worth -----> it !!! , they dealt with everything and i didn't have to manually add the info/registration numbers for 500-ish photos through their clunky website. registering the photos also meant my payouts went up a lot, now i think the average i get (i.e. 50%) is maybe $350 or so per infringement, earlier, i think the average was maybe $100 or so (once, i just got $30 for an infringement, lol).\n\noverall, i'm very happy with them, but i think you need to have a lot of infringements to fall back on for them to be effective. the chance of a successful outcome on any random case is probably less than 25% and that's with us copyright registered, and it's even less without. so you know, i don't think it's for every photographer, and not for every type of infringement. if you definitely want money from a particular infringer that's not based in the us or japan, you might be better served finding a lawyer in that jurisdiction who can help you out. if you have a bunch of photos with a bunch of infringements and don't particularly care all that much about who gets squeezed and who doesn't, and you want a nice side income without having to actually deal with any of the nasty stuff going on in the sausage factory, i think they're pretty awesome.", "sortedWord": "None", "Identifyer": null, "identifyer": 72857, "year": "2020"}, {"autor": "CatBenchKettle", "date": "2019-12-07 16:55:37", "content": "Colourising - Best way to do it? /!/ Afternoon all, I was wondering if someone could help me with a problem.\n\nI’d like to get a couple of old pictures colourised for my nan as a gift. It’s the 5th year without my grandad and I thought a picture of them both when they first met back in the RAF would be a nice, unexpected gift.\n\nI’ve tried looking online at various bots/websites that can do this but they just turn out a slightly different shade of b&amp;w.\n\nDoes anyone know a good service that can do this or any experiences of how you’ve done it yourselves? I’m prepared to pay for it if needed if that makes a difference.\n\nThanks in advance for any advice / help / assistance you guys can give.", "link": "https://www.reddit.com/r/photography/comments/e7gn4c/colourising_best_way_to_do_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "done it yourselves", "selectorShort": "yourself", "MarkedSent": "colourising - best way to do it? /!/ afternoon all, i was wondering if someone could help me with a problem.\n\ni’d like to get a couple of old pictures colourised for my nan as a gift. it’s the 5th year without my grandad and i thought a picture of them both when they first met back in the raf would be a nice, unexpected gift.\n\ni’ve tried looking online at various bots/websites that can do this but they just turn out a slightly different shade of b&amp;w.\n\ndoes anyone know a good service that can do this or any experiences of how you’ve -----> done !!!  -----> it !!!  -----> yourselves !!! ? i’m prepared to pay for it if needed if that makes a difference.\n\nthanks in advance for any advice / help / assistance you guys can give.", "sortedWord": "None", "Identifyer": null, "identifyer": 4270, "year": "2019"}, {"autor": "kikokairuz", "date": "2019-09-24 03:18:38", "content": "Just done! Nothing better than do it yourself. Print and frame like a pro!", "link": "https://www.reddit.com/r/photography/comments/d8hi5k/just_done_nothing_better_than_do_it_yourself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "just done! nothing better than -----> do !!!  -----> it !!!  -----> yourself !!! . print and frame like a pro!", "sortedWord": "None", "Identifyer": null, "identifyer": 6611, "year": "2019"}, {"autor": "SophieLeigh7", "date": "2021-06-24 17:48:16", "content": "Do you hire a photographer to take your family photos? /!/ Or do you do it yourself with a tripod?", "link": "https://www.reddit.com/r/photography/comments/o762sb/do_you_hire_a_photographer_to_take_your_family/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "do you hire a photographer to take your family photos? /!/ or -----> do !!!  you -----> do !!!  -----> it !!!  -----> yourself !!!  with a tripod?", "sortedWord": "None", "Identifyer": null, "identifyer": 7890, "year": "2021"}, {"autor": "vrotographer", "date": "2018-07-09 01:49:23", "content": "How many of you print in the darkroom yourself? /!/ Is it worth it do do it yourself? The main thing holding me back from doing it is how expensive enlargers are.\n\nI watched the Ilford video on how to print, and it doesn't look too difficult (at least black and white). So how many of you guys do it yourselves?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8x6ug6/how_many_of_you_print_in_the_darkroom_yourself/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "how many of you print in the darkroom yourself? /!/ is -----> it !!!  worth -----> it !!!  -----> do !!!  -----> do !!!  -----> it !!!  -----> yourself !!! ? the main thing holding me back from doing it is how expensive enlargers are.\n\ni watched the ilford video on how to print, and it doesn't look too difficult (at least black and white). so how many of you guys do it yourselves?", "sortedWord": "None", "Identifyer": null, "identifyer": 20405, "year": "2018"}, {"autor": "M_Kammerer", "date": "2021-05-01 13:41:51", "content": "Reasons as to why you recently developed roll is completely/partly blank /!/ *Second version, formatting and writing should be better in general*\n\n(*Sidenote: If you feel anything is missing or could be better worded/explained let me know ! Also I'm on mobile so the formatting might be shit, sorry*)\n\n This guide is meant as a help to anyone who encountered the following problems: 'My film roll came out completely translucent/opaque' and 'Some frames are not exposed at all'. Let's start : \n\nCondition A: If your film comes back completely translucent then it (in theory) has never seen the light of day. Or it could be a very specific development mishap which I will explain at the end of this section. This can have a good number of reason, ranging from forgetting to take the lens cap off to camera failure and said development mistake. \n\nCondition B: If some frames are normal while others are completely blank, then you can simply ignore point one in the following list. Your problem most likely stems from camera/meter failure or forgetting to take off the lens cap. You can also skip the development part then if you wish. We'll start with the camera: \n\n**First**: Film loading. Was the film properly loaded ? This happens mostly with 135 film. If the film isn't properly wound onto the take-up spool it will snap back. To avoid this make sure that the film is wound firmly upon the take-up spool and the sprockets engage with the gears. There's nothing wrong with wasting a few frames just to make sure the film is properly loaded. Additionally if you're unsure whether or not the film is loaded correctly but don't want to open the back, you can simply advance the film one time. If the rewind knob rotates while you advance the film then it is properly loaded, this applies mostly to cameras with manual film advance. \n\n**Second**: Camera Failure. Check the shutter, does it successfully complete its cycle ? If not then the shutter needs repair. For your negatives to come out completely translucent the shutter does not open at all. Additionally, for SLRs, check if the mirror swings up too. Check all speeds of the shutter if possible. In some cases the shutter may not work on some/one specific speed(s). Additionally for cameras with automatic diaphragms/apertures, make sure that the diaphragm/aperture opens and stops down correctly. \n\n**Third**: Metering Issues. If your camera has an internal meter check its function by comparing its read-out with another camera or better a dedicated meter. If the values differ drastically by several stops, your cameras internal meter is malfunctioning. Also check your meters settings. There's almost nothing to be saved from an ISO 1600 roll that was shot at ISO 100. So check your ISO-setting ! This applies to both external and internal meters. \n\n*Another thing of note: Some cameras, especially late 90's Point-and-Shoots, won't allow the use of non DX-coded film. They will most likely set the internal meter to a standard setting, in most cases ISO 100. Some of said late cameras can only read DX-Coded film up to a certain speed. Make sure to read your cameras manual in such cases.*\n\n**Fourth**: Don't forget to take the lens cap off. This might not seem a problem to the SLR crowd but happens especially to literally anyone that uses a camera where you do not directly look through the lens, i.e. anything that isn't an SLR.\n\n **Development mishaps**: \n\nIf everything on your camera works and the lens cap was indeed taken off, then take a good look at the negatives themselves as well as the development process (assuming you did it yourself) . For black and white I shall link you to Ilford's excellent guide which deals with those issues (and more) as well as provides reference images: https://www.ilfordphoto.com/common-processing-problems/?___store=ilford_brochure&amp;___from_store=ilford_uk \n\nNote: In the very minimal chance that your B&amp;W roll came back completely blank (no edge markings) from a lab, it is because the lab accidentally threw your roll into same batch as for color film and developed in C-41. Get into contact with your lab immediately. \n\nBlank rolls (with **no** edge markings) can also happen with the C-41 process, it might have the following reasons: \n\n1.Fixing happened before developing. You might have accidentally used the blix first instead of the developer. \n\n2.Your developer is completely exhausted. The fixer  simply removes all of your emulsion. \n\nTo make sure to get the best and longest life out of your chemicals store them in plastic bottles and press out as much air as possible. This applies to all types processing chemicals. \n\nTo make sure your chemicals (BnW and C-41) are still OK develop a test strip.\n\n**SOME MORE USEFUL LINKS AND OTHER HELPFUL STUFF**\n\n https://www.butkus.org/chinon/ Probably the largest **free** camera manual library in the Internet. Give him a small donation, he definitely deserves it.\n\n https://www.digitaltruth.com/devchart.php For all your B&amp;W development needs.\n https://www.reddit.com/r/analog/comments/28xvjl/i_wrote_a_guide_to_developing_and_handling_your/ An old but excellent C-41 guide that also tackles the \"I added too much water to my chems\" problem\n\n https://www.reddit.com/r/analog/wiki/index Contains much information but is often overlooked *even tho you can easily access it from the sidebar*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/n2ikle/reasons_as_to_why_you_recently_developed_roll_is/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "did it yourself", "selectorShort": "yourself", "MarkedSent": "reasons as to why you recently developed roll is completely/partly blank /!/ *second version, formatting and writing should be better in general*\n\n(*sidenote: if you feel anything is missing or could be better worded/explained let me know ! also i'm on mobile so the formatting might be shit, sorry*)\n\n this guide is meant as a help to anyone who encountered the following problems: 'my film roll came out completely translucent/opaque' and 'some frames are not exposed at all'. let's start : \n\ncondition a: if your film comes back completely translucent then it (in theory) has never seen the light of day. or it could be a very specific development mishap which i will explain at the end of this section. this can have a good number of reason, ranging from forgetting to take the lens cap off to camera failure and said development mistake. \n\ncondition b: if some frames are normal while others are completely blank, then you can simply ignore point one in the following list. your problem most likely stems from camera/meter failure or forgetting to take off the lens cap. you can also skip the development part then if you wish. we'll start with the camera: \n\n**first**: film loading. was the film properly loaded ? this happens mostly with 135 film. if the film isn't properly wound onto the take-up spool it will snap back. to avoid this make sure that the film is wound firmly upon the take-up spool and the sprockets engage with the gears. there's nothing wrong with wasting a few frames just to make sure the film is properly loaded. additionally if you're unsure whether or not the film is loaded correctly but don't want to open the back, you can simply advance the film one time. if the rewind knob rotates while you advance the film then it is properly loaded, this applies mostly to cameras with manual film advance. \n\n**second**: camera failure. check the shutter, does it successfully complete its cycle ? if not then the shutter needs repair. for your negatives to come out completely translucent the shutter does not open at all. additionally, for slrs, check if the mirror swings up too. check all speeds of the shutter if possible. in some cases the shutter may not work on some/one specific speed(s). additionally for cameras with automatic diaphragms/apertures, make sure that the diaphragm/aperture opens and stops down correctly. \n\n**third**: metering issues. if your camera has an internal meter check its function by comparing its read-out with another camera or better a dedicated meter. if the values differ drastically by several stops, your cameras internal meter is malfunctioning. also check your meters settings. there's almost nothing to be saved from an iso 1600 roll that was shot at iso 100. so check your iso-setting ! this applies to both external and internal meters. \n\n*another thing of note: some cameras, especially late 90's point-and-shoots, won't allow the use of non dx-coded film. they will most likely set the internal meter to a standard setting, in most cases iso 100. some of said late cameras can only read dx-coded film up to a certain speed. make sure to read your cameras manual in such cases.*\n\n**fourth**: don't forget to take the lens cap off. this might not seem a problem to the slr crowd but happens especially to literally anyone that uses a camera where you do not directly look through the lens, i.e. anything that isn't an slr.\n\n **development mishaps**: \n\nif everything on your camera works and the lens cap was indeed taken off, then take a good look at the negatives themselves as well as the development process (assuming you -----> did !!!  -----> it !!!  -----> yourself !!! ) . for black and white i shall link you to ilford's excellent guide which deals with those issues (and more) as well as provides reference images: https://www.ilfordphoto.com/common-processing-problems/?___store=ilford_brochure&amp;___from_store=ilford_uk \n\nnote: in the very minimal chance that your b&amp;w roll came back completely blank (no edge markings) from a lab, it is because the lab accidentally threw your roll into same batch as for color film and developed in c-41. get into contact with your lab immediately. \n\nblank rolls (with **no** edge markings) can also happen with the c-41 process, it might have the following reasons: \n\n1.fixing happened before developing. you might have accidentally used the blix first instead of the developer. \n\n2.your developer is completely exhausted. the fixer  simply removes all of your emulsion. \n\nto make sure to get the best and longest life out of your chemicals store them in plastic bottles and press out as much air as possible. this applies to all types processing chemicals. \n\nto make sure your chemicals (bnw and c-41) are still ok develop a test strip.\n\n**some more useful links and other helpful stuff**\n\n https://www.butkus.org/chinon/ probably the largest **free** camera manual library in the internet. give him a small donation, he definitely deserves it.\n\n https://www.digitaltruth.com/devchart.php for all your b&amp;w development needs.\n https://www.reddit.com/r/analog/comments/28xvjl/i_wrote_a_guide_to_developing_and_handling_your/ an old but excellent c-41 guide that also tackles the \"i added too much water to my chems\" problem\n\n https://www.reddit.com/r/analog/wiki/index contains much information but is often overlooked *even tho you can easily access it from the sidebar*", "sortedWord": "None", "Identifyer": null, "identifyer": 49199, "year": "2021"}, {"autor": "75footubi", "date": "2021-03-12 17:09:10", "content": "There is no terror like realizing your negatives might be lost in a USPS black hole /!/ And you didn't even pay for cheap scans because you have a scanner and prefer to do it yourself.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/m3m2k0/there_is_no_terror_like_realizing_your_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "there is no terror like realizing your negatives might be lost in a usps black hole /!/ and you didn't even pay for cheap scans because you have a scanner and prefer to -----> do !!!  -----> it !!!  -----> yourself !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 244, "year": "2021"}, {"autor": "badlybuttered", "date": "2021-09-04 01:33:12", "content": "Best Battery Solution for Rolleiflex 6008 Pro? /!/ **Looking for some help figuring out a battery solution for the Rolleiflex 6008 Professional or any extra information anyone might have so I can finally bring this thing to life!**\n\nI have 2 original batteries for this camera I was given (which will most likely need new cells and one looks like it has a leak from being left in the body) but I have no charger for them and the only one I can find is from [Rolleiflex.us](https://Rolleiflex.us) which after shipping to UK would cost $200+ and I have no clue if it's even the correct one. I'm aware parts and servicing for the Rolleiflex 6000 / SLX series cameras is pretty scarce hence the premium prices but would like to find the best or most affordable solution possible. I have a good grasp on camera mechanics with disassembling and fixing but have zero knowledge when it comes to the electronics or batteries.\n\nThe two options so far seem to be:\n\n**1 - Recell the batteries myself or using a Recell service and forking out for the charger.**\n\nI have seen a few recell services and found a guide on Ifixit for doing it yourself which I'd be comfortable trying but after paying for this, the price of a new charger is a bit steep and I have no idea if it's even the correct one for recelled battery?\n\niFixIt guide ([https://www.ifixit.com/Guide/Rollei+6000-6008+Battery+LiFePO4+Replacement/77648](https://www.ifixit.com/Guide/Rollei+6000-6008+Battery+LiFePO4+Replacement/77648))\n\nCharger ([https://rolleiflex.us/products/rolleiflex-type-d-charger-for-6000-series-batteries-with-nimh-cells](https://rolleiflex.us/products/rolleiflex-type-d-charger-for-6000-series-batteries-with-nimh-cells))\n\n**2 - Buying an aftermarket battery / charger which might come with a few problems?**\n\nI have found the seller on eBay (mignon1) selling aftermarket battery packs with a charger ($160 shipped to the UK) but have seen a few complaints on a YouTube review that the extra voltage can cause metering issues, over advancing and might not be healthy on the electronics. I'm guessing the 3 x 3.7V batteries output a bit over the 10V from the original battery and I'm naively wondering if these batteries can be swapped for ones with a slightly lower voltage to match original output? Or has anyone used these with little issue? I could live with ISO adjustment after testing how much compensation it needs.\n\nAftermarket Battery ([https://www.ebay.co.uk/itm/255109485944](https://www.ebay.co.uk/itm/255109485944))\n\nI'd be grateful for any help / advice on this!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/phiaby/best_battery_solution_for_rolleiflex_6008_pro/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "best battery solution for rolleiflex 6008 pro? /!/ **looking for some help figuring out a battery solution for the rolleiflex 6008 professional or any extra information anyone might have so i can finally bring this thing to life!**\n\ni have 2 original batteries for this camera i was given (which will most likely need new cells and one looks like it has a leak from being left in the body) but i have no charger for them and the only one i can find is from [rolleiflex.us](https://rolleiflex.us) which after shipping to uk would cost $200+ and i have no clue if it's even the correct one. i'm aware parts and servicing for the rolleiflex 6000 / slx series cameras is pretty scarce hence the premium prices but would like to find the best or most affordable solution possible. i have a good grasp on camera mechanics with disassembling and fixing but have zero knowledge when it comes to the electronics or batteries.\n\nthe two options so far seem to be:\n\n**1 - recell the batteries myself or using a recell service and forking out for the charger.**\n\ni have seen a few recell services and found a guide on ifixit for -----> doing !!!  -----> it !!!  -----> yourself !!!  which i'd be comfortable trying but after paying for this, the price of a new charger is a bit steep and i have no idea if -----> it !!! 's even the correct one for recelled battery?\n\nifixit guide ([https://www.ifixit.com/guide/rollei+6000-6008+battery+lifepo4+replacement/77648](https://www.ifixit.com/guide/rollei+6000-6008+battery+lifepo4+replacement/77648))\n\ncharger ([https://rolleiflex.us/products/rolleiflex-type-d-charger-for-6000-series-batteries-with-nimh-cells](https://rolleiflex.us/products/rolleiflex-type-d-charger-for-6000-series-batteries-with-nimh-cells))\n\n**2 - buying an aftermarket battery / charger which might come with a few problems?**\n\ni have found the seller on ebay (mignon1) selling aftermarket battery packs with a charger ($160 shipped to the uk) but have seen a few complaints on a youtube review that the extra voltage can cause metering issues, over advancing and might not be healthy on the electronics. i'm guessing the 3 x 3.7v batteries output a bit over the 10v from the original battery and i'm naively wondering if these batteries can be swapped for ones with a slightly lower voltage to match original output? or has anyone used these with little issue? i could live with iso adjustment after testing how much compensation it needs.\n\naftermarket battery ([https://www.ebay.co.uk/itm/255109485944](https://www.ebay.co.uk/itm/255109485944))\n\ni'd be grateful for any help / advice on this!", "sortedWord": "None", "Identifyer": null, "identifyer": 2344, "year": "2021"}, {"autor": "denzelvb", "date": "2018-01-12 13:43:33", "content": "Outsourcing photo editing? /!/ Hey guys!\n\nI just saw a podcast about tips on how to boost your photography business and one of the points in there was outsourcing you photo editing to save time and eventually make more money.\n\nI started reading about outsourcing your photography and I read that most of the high end photographers do this... Is this true?\n\nIn my opinion the photo editing is part of the work you deliver. When you edit the photos yourself the work is really yours and it has your style to it, which you develop through time and experience. But if you outsource it, you only did 50% of the work of the final photograph, IMO.\n\nI fully understand the benefits of outsourcing the editing, but I just don't feel like it is the right thing to do.\n\nHow do you feel about outsourcing your photo editing? And do you personally outsource it or do you rather do it yourself, and why?\n\nI would really like to hear some thoughts about this from professionals, since I am just a hobby photographer with the thought of starting a photography business in the (near) future.", "link": "https://www.reddit.com/r/photography/comments/7pwn0v/outsourcing_photo_editing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "outsourcing photo editing? /!/ hey guys!\n\ni just saw a podcast about tips on how to boost your photography business and one of the points in there was outsourcing you photo editing to save time and eventually make more money.\n\ni started reading about outsourcing your photography and i read that most of the high end photographers do this... is this true?\n\nin my opinion the photo editing is part of the work you deliver. when you edit the photos yourself the work is really yours and it has your style to it, which you develop through time and experience. but if you outsource it, you only did 50% of the work of the final photograph, imo.\n\ni fully understand the benefits of outsourcing the editing, but i just don't feel like it is the right thing to do.\n\nhow do you feel about outsourcing your photo editing? and -----> do !!!  you personally outsource -----> it !!!  or -----> do !!!  you rather -----> do !!!  -----> it !!!  -----> yourself !!! , and why?\n\ni would really like to hear some thoughts about this from professionals, since i am just a hobby photographer with the thought of starting a photography business in the (near) future.", "sortedWord": "None", "Identifyer": null, "identifyer": 26306, "year": "2018"}, {"autor": "Kudzupatch", "date": "2018-12-15 22:28:10", "content": "Anyone actually damaged a sensor cleaning it?? /!/ I see all the warning about having your sensor(s) cleaned by a pro rather than doing it yourself because you could damage your sensor. Obviously, your camera, your money and your choice. \n\nI have never heard of anyone that actually damaged a sensor, just rumors that they are delicate warnings. So has anyone actually damaged one or knows someone personally, *not second hand info/rumor,* that has damaged the sensor? And  I am not talking about people doing stupid either.", "link": "https://www.reddit.com/r/photography/comments/a6jju8/anyone_actually_damaged_a_sensor_cleaning_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "anyone actually damaged a sensor cleaning it?? /!/ i see all the warning about having your sensor(s) cleaned by a pro rather than -----> doing !!!  -----> it !!!  -----> yourself !!!  because you could damage your sensor. obviously, your camera, your money and your choice. \n\ni have never heard of anyone that actually damaged a sensor, just rumors that they are delicate warnings. so has anyone actually damaged one or knows someone personally, *not second hand info/rumor,* that has damaged the sensor? and  i am not talking about people doing stupid either.", "sortedWord": "None", "Identifyer": null, "identifyer": 33970, "year": "2018"}, {"autor": "96CMC", "date": "2020-08-17 15:34:01", "content": "I need to get into home development and scanning. But I have questions! /!/ Hi, all much more experienced film folk. So I just dropped some B/W film by the lab to be developed and they said it’ll be a month... maybe they are just really backed up which is great but I can’t keep waiting that long. It’s time I start doing this stuff at home.\n\nI understand after initial cost that developing is significantly cheaper when you do it yourself. I just don’t know what scanner to get. I’ll be getting into 120 eventually so it would need to be able to scan that as well. I just need to know what is a quality starting scanner that I can practice and get good at and then upgrade later. I would like for it to be able to scan hi res as well.\n\nThanks for the patience with these seemingly silly questions!\n\nMuch love!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ibgcks/i_need_to_get_into_home_development_and_scanning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "i need to get into home development and scanning. but i have questions! /!/ hi, all much more experienced film folk. so i just dropped some b/w film by the lab to be developed and they said it’ll be a month... maybe they are just really backed up which is great but i can’t keep waiting that long. it’s time i start doing this stuff at home.\n\ni understand after initial cost that developing is significantly cheaper when you -----> do !!!  -----> it !!!  -----> yourself !!! . i just don’t know what scanner to get. i’ll be getting into 120 eventually so it would need to be able to scan that as well. i just need to know what is a quality starting scanner that i can practice and get good at and then upgrade later. i would like for it to be able to scan hi res as well.\n\nthanks for the patience with these seemingly silly questions!\n\nmuch love!", "sortedWord": "None", "Identifyer": null, "identifyer": 61070, "year": "2020"}, {"autor": "1stonthelistca", "date": "2019-05-28 19:52:01", "content": "HTTPS is Everywhere – And if It’s Not It Should Be /!/ HTTPS and SSL – two sets of letters that you’ve probably heard a lot about, even if you don’t know what it means. Essentially, they boil down to a technical signal that your website is secure for browsing and that your visitor’s data and information is safe and secure from vulnerabilities. They’re the symbols of Internet security.\n\nInternet security is a much talked about term these days, thanks in part to big businesses that have been in the media due to data breaches. What’s more, visitors are used to expecting security when conducting credit card transactions online. Beyond that, Internet security is something many web visitors and businesses take for granted. So, it may have been surprising when way back in 2014 Google admitted that HTTPS had become a [ranking factor](https://webmasters.googleblog.com/2014/08/https-as-ranking-signal.html) for websites. But, when Google says something is helpful, everyone jumps on board. Beyond being a helpful factor for SEO and ranking, having a secure website is good business practice. HTTPS and SSL is important. Today we’re going to review why you need it, how it works and how to get it installed on your website.\n\nThink about your place of business. Your employees have keys and your guests cannot enter until the doors have been opened or they’ve been let in. If you are part of a really large organization, the employees may have badges or nametags for identification. If you were to lose your keys or identification, your business would be left vulnerable. Your business has implemented security measures to keep the actual office safe, but also to protect important documents and data, right?\n\nWell, the same is true for a website. Years ago, websites were basically an online version of a business card. There wasn’t much data being exchanged and visitors were merely browsing. Then the onset of websites came where you could login and become a member. Or, you could shop and make a purchase. Or, you could fill out a form to sign up for important information. With that, all of a sudden your digital footprint that followed you around the Internet started to hold all sorts of data.\n\nNow, while you browse the web you are basically a walking billboard of information about yourself, unless you keep everything secure. Businesses can help protect your data by ensuring their own websites are security compliant.\n\nInternet users have been slowly trained to look for an ‘s’ next to the HTTP as a signal that a website is secure for browsing and exchanging information. While most Internet users don’t understand the technicalities of HTTPS and SSL they know what can happen if their sensitive information is breached. Perhaps their banking system has already been compromised and they’ve had to deal with the hassle of ordering new cards and updating information. Perhaps their social media accounts have been hacked and they’ve had to spend precious time cleaning things up and resetting passwords. More and more people are expecting security from the websites they visit, and if they don’t find it, they leave.\n\nWhat is Https?\n--------------\n\nThe ‘s’ in HTTPS stands for ‘secure’. When you see this in a URL, coupled with a lock symbol, you know the website you are visited is encrypted with a secure website connection. Historically, SSL was reserved primarily for websites that collected private information such as passwords, private data and credit cards. When you visit a website without the ‘s’ you could be on a compromised network, or one that is vulnerable to hackers, the Internet’s version of eavesdroppers.\n\nHTTPS helps protect the privacy of your website visitor. It is no longer enough for you to say you will protect a visitor’s information. Now you must show you are protecting it.\n\nHTTPS makes it harder for hackers to break the connection and steal personal information.\n\nWhen browsing the web, look for the ‘s’ to know that the website you’re on is trustworthy. Not all websites have converted over to HTTPS yet, so [if you are browsing a site that is not secure](https://seoexpertbrad.com/google-ssl-certificates-https/), just be sure to refrain from passing along your important personal information and data.\n\n**What is an SSL Certificate?**\n\nAn SSL certificate is the indication that your website is officially secure. This is what allows your website browser to establish a secure connection. The browser trusts the secure connection, which in turn a user can also feel safe browsing and even providing private/confidential information.\n\nOur official SSL partner is DigiCert, a leading SSL certificate authority. We recommend them because they provide increased speed and load time which is also a valuable SEO feature.\n\nWhy You need it?\n----------------\n\nInternet visitors are more savvy and have an innate trust associated with HTTPS. Recent media reports of big brands being hacked, compromised and having personal data leaked has made consumers even more cautious. We side with Google on this one and would like to see every website properly secured. It’s especially important if you collect credit card payments, you collect private information (such as name, address, health records, passwords etc.) or you are in a competitive market. Here are other reasons why you should consider HTTPS for your website:\n\n  - Google now uses HTTPS as an important ranking factor and sites with it tend to rank better. This in itself is an important reason to ensure your website is secure and compliant with HTTPS. With a lot of competition on the Internet, your business should be great at the basics.\n  - Some popular Internet browsers are giving warnings when web visitors try and access a non-secure website. Therefore, if your site is not secure, you could be missing out on valuable website traffic. In fact, these warnings might just scare your website visitors away.\n  - Ensuring your website is secure protects your business from the costs of a data breach. This could be a public relations nightmare if your website data was ever breached, not to mention an expensive nightmare, too.\n  - Visitors are more confident using your website if they know it is secure. As visitors become more confident in their website browsing they have expectations of businesses, including website and data security.\n\n“HTTPS Everywhere” is a term coined by Google. Google has confirmed that HTTPS is a ranking factor dating back to 2014. “Security is a top priority for Google… beyond our own stuff, we’re also working to make the Internet safer more broadly. A big part of that is making sure that websites people access from Google, are secure… so we’re starting to use HTTPS as a ranking signal…”\n\nHistorically, only pages or parts of a website that dealt with sensitive data were secured with an SSL certificate. But, now it is advantageous to secure every single page. In other words, only when an entire website is properly secured with SSL will it earn a ranking advantage.\n\nAre All SSL Certificates Created Equal?\n---------------------------------------\n\nNo! Many of the SSL certificates online are SHA-1 which gets more compromised each year. In fact, Google Chrome may even display a warning on websites with SHA-1.\n\nSHA-2 is a much stronger certificate. If you want to ensure your website is deemed trustworthy you can even obtain an SSL EV certificate.\n\nIn addition, it is important to regularly check your SSL certificate to ensure it is not vulnerable. Improperly installed or misconfigured [SSL certificates](https://www.1stonthelist.ca/seo/other-services/#ssl) can leave you open to attack.\n\nWe provide a complimentary Inspector Report. Ask us for it!\n\n**The SSL Handshake – How SSL Works**\n\nHow does your web browser know a website is secure? Well, it undertakes what is commonly referred to as the SSL Handshake.\n\n  - The Internet browser connects to the web server and requests the server to identify itself.\n  - The server sends a copy of its SSL Certificate\n  - The browser verifies the certificate to ensure it is valid. If the browser trusts the certificate it creates an encrypted symmetric session key using the server’s public key.\n  - The server decrypts the symmetric session key using its private key and sends back an acknowledgement to start the encrypted session.\n  - Server &amp;browser are now encrypted.\n\nHow to Purchase and Install an SSL Certificate\n----------------------------------------------\n\nBecause SSL and HTTPS is more important than ever, installation is best left to the professionals. While you can do it yourself, or have it done through your hosting provider you want to be sure that all configurations are correct and that your website is not vulnerable to insecurities.\n\n**In Summary**\n\nSo, while SSL and HTTPS is essentially good business practice, it is something users are looking for when they visit a website.\n\nHTTPS and SSL are the equivalent of a lock on a door or a code on a safe. Now more than ever it’s important to be secure. The same is true for a website. Internet users are vulnerable when they browse the Internet. They have private data, cookies and Internet session info following along with them. In addition, they make credit card transactions, utilize banking websites, enter their personal data such as their full name and address, and are constantly logging in and out or signing up for things with usernames and passwords. Without security, we’d all be victims of fraud and identity theft by now. That’s why, even when you aren’t conducting a financial transaction, it’s wise to look for websites that are HTTPS.\n\nAnd, if Google is using it as a ranking factor then it is just all the more reason to jump on board the security bandwagon. But, not all s’s are created equally. Even if you’re only obtaining the certificate to appease Google, it’s important to ensure that your SSL and security is set up and configured correctly. After all, the real goal is to ensure that your website visitors are safe while browsing your website. After all, a data breach could cost your business time, money and reputation!\n\nBeyond the visitor’s point of view, it’s just good business to ensure your website provides adequate security. And if it’s going to help with your SEO, well that’s great too.\n\nWebsite visitors do not always understand the technicalities of what goes on behind the scenes of a website. They don’t understand how their data is encrypted. But, they know the hassle that comes when they’ve become vulnerable to an attack, have been hacked or have had their information compromised. What they do know is that the S that is part of HTTPS and the lock in the browser is the best indication they have that a business is doing everything it can to protect their sensitive information. So, if you haven’t yet adopted HTTPS, perhaps it’s time you did.\n\nIf you still have questions about getting your website secure with SSL certificate, please call our SEO experts here at 1st on the List at 1-877-562-1750.\n\nThe post [HTTPS is Everywhere – And if It’s Not It Should Be](https://www.1stonthelist.ca/blog/https-is-everywhere-and-if-its-not-it-should-be/) appeared first on [1st on the List](https://www.1stonthelist.ca).\n\n   \n   \n from WordPress http://bit.ly/2WaQlMT", "link": "https://www.reddit.com/r/photography/comments/bu4mmt/https_is_everywhere_and_if_its_not_it_should_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "https is everywhere – and if it’s not it should be /!/ https and ssl – two sets of letters that you’ve probably heard a lot about, even if you don’t know what it means. essentially, they boil down to a technical signal that your website is secure for browsing and that your visitor’s data and information is safe and secure from vulnerabilities. they’re the symbols of internet security.\n\ninternet security is a much talked about term these days, thanks in part to big businesses that have been in the media due to data breaches. what’s more, visitors are used to expecting security when conducting credit card transactions online. beyond that, internet security is something many web visitors and businesses take for granted. so, it may have been surprising when way back in 2014 google admitted that https had become a [ranking factor](https://webmasters.googleblog.com/2014/08/https-as-ranking-signal.html) for websites. but, when google says something is helpful, everyone jumps on board. beyond being a helpful factor for seo and ranking, having a secure website is good business practice. https and ssl is important. today we’re going to review why you need it, how it works and how to get it installed on your website.\n\nthink about your place of business. your employees have keys and your guests cannot enter until the doors have been opened or they’ve been let in. if you are part of a really large organization, the employees may have badges or nametags for identification. if you were to lose your keys or identification, your business would be left vulnerable. your business has implemented security measures to keep the actual office safe, but also to protect important documents and data, right?\n\nwell, the same is true for a website. years ago, websites were basically an online version of a business card. there wasn’t much data being exchanged and visitors were merely browsing. then the onset of websites came where you could login and become a member. or, you could shop and make a purchase. or, you could fill out a form to sign up for important information. with that, all of a sudden your digital footprint that followed you around the internet started to hold all sorts of data.\n\nnow, while you browse the web you are basically a walking billboard of information about yourself, unless you keep everything secure. businesses can help protect your data by ensuring their own websites are security compliant.\n\ninternet users have been slowly trained to look for an ‘s’ next to the http as a signal that a website is secure for browsing and exchanging information. while most internet users don’t understand the technicalities of https and ssl they know what can happen if their sensitive information is breached. perhaps their banking system has already been compromised and they’ve had to deal with the hassle of ordering new cards and updating information. perhaps their social media accounts have been hacked and they’ve had to spend precious time cleaning things up and resetting passwords. more and more people are expecting security from the websites they visit, and if they don’t find it, they leave.\n\nwhat is https?\n--------------\n\nthe ‘s’ in https stands for ‘secure’. when you see this in a url, coupled with a lock symbol, you know the website you are visited is encrypted with a secure website connection. historically, ssl was reserved primarily for websites that collected private information such as passwords, private data and credit cards. when you visit a website without the ‘s’ you could be on a compromised network, or one that is vulnerable to hackers, the internet’s version of eavesdroppers.\n\nhttps helps protect the privacy of your website visitor. it is no longer enough for you to say you will protect a visitor’s information. now you must show you are protecting it.\n\nhttps makes it harder for hackers to break the connection and steal personal information.\n\nwhen browsing the web, look for the ‘s’ to know that the website you’re on is trustworthy. not all websites have converted over to https yet, so [if you are browsing a site that is not secure](https://seoexpertbrad.com/google-ssl-certificates-https/), just be sure to refrain from passing along your important personal information and data.\n\n**what is an ssl certificate?**\n\nan ssl certificate is the indication that your website is officially secure. this is what allows your website browser to establish a secure connection. the browser trusts the secure connection, which in turn a user can also feel safe browsing and even providing private/confidential information.\n\nour official ssl partner is digicert, a leading ssl certificate authority. we recommend them because they provide increased speed and load time which is also a valuable seo feature.\n\nwhy you need it?\n----------------\n\ninternet visitors are more savvy and have an innate trust associated with https. recent media reports of big brands being hacked, compromised and having personal data leaked has made consumers even more cautious. we side with google on this one and would like to see every website properly secured. it’s especially important if you collect credit card payments, you collect private information (such as name, address, health records, passwords etc.) or you are in a competitive market. here are other reasons why you should consider https for your website:\n\n  - google now uses https as an important ranking factor and sites with it tend to rank better. this in itself is an important reason to ensure your website is secure and compliant with https. with a lot of competition on the internet, your business should be great at the basics.\n  - some popular internet browsers are giving warnings when web visitors try and access a non-secure website. therefore, if your site is not secure, you could be missing out on valuable website traffic. in fact, these warnings might just scare your website visitors away.\n  - ensuring your website is secure protects your business from the costs of a data breach. this could be a public relations nightmare if your website data was ever breached, not to mention an expensive nightmare, too.\n  - visitors are more confident using your website if they know it is secure. as visitors become more confident in their website browsing they have expectations of businesses, including website and data security.\n\n“https everywhere” is a term coined by google. google has confirmed that https is a ranking factor dating back to 2014. “security is a top priority for google… beyond our own stuff, we’re also working to make the internet safer more broadly. a big part of that is making sure that websites people access from google, are secure… so we’re starting to use https as a ranking signal…”\n\nhistorically, only pages or parts of a website that dealt with sensitive data were secured with an ssl certificate. but, now it is advantageous to secure every single page. in other words, only when an entire website is properly secured with ssl will it earn a ranking advantage.\n\nare all ssl certificates created equal?\n---------------------------------------\n\nno! many of the ssl certificates online are sha-1 which gets more compromised each year. in fact, google chrome may even display a warning on websites with sha-1.\n\nsha-2 is a much stronger certificate. if you want to ensure your website is deemed trustworthy you can even obtain an ssl ev certificate.\n\nin addition, it is important to regularly check your ssl certificate to ensure it is not vulnerable. improperly installed or misconfigured [ssl certificates](https://www.1stonthelist.ca/seo/other-services/#ssl) can leave you open to attack.\n\nwe provide a complimentary inspector report. ask us for it!\n\n**the ssl handshake – how ssl works**\n\nhow does your web browser know a website is secure? well, it undertakes what is commonly referred to as the ssl handshake.\n\n  - the internet browser connects to the web server and requests the server to identify itself.\n  - the server sends a copy of its ssl certificate\n  - the browser verifies the certificate to ensure it is valid. if the browser trusts the certificate it creates an encrypted symmetric session key using the server’s public key.\n  - the server decrypts the symmetric session key using its private key and sends back an acknowledgement to start the encrypted session.\n  - server &amp;browser are now encrypted.\n\nhow to purchase and install an ssl certificate\n----------------------------------------------\n\nbecause ssl and https is more important than ever, installation is best left to the professionals. while you can -----> do !!!  -----> it !!!  -----> yourself !!! , or have -----> it !!!  done through your hosting provider you want to be sure that all configurations are correct and that your website is not vulnerable to insecurities.\n\n**in summary**\n\nso, while ssl and https is essentially good business practice, it is something users are looking for when they visit a website.\n\nhttps and ssl are the equivalent of a lock on a door or a code on a safe. now more than ever it’s important to be secure. the same is true for a website. internet users are vulnerable when they browse the internet. they have private data, cookies and internet session info following along with them. in addition, they make credit card transactions, utilize banking websites, enter their personal data such as their full name and address, and are constantly logging in and out or signing up for things with usernames and passwords. without security, we’d all be victims of fraud and identity theft by now. that’s why, even when you aren’t conducting a financial transaction, it’s wise to look for websites that are https.\n\nand, if google is using it as a ranking factor then it is just all the more reason to jump on board the security bandwagon. but, not all s’s are created equally. even if you’re only obtaining the certificate to appease google, it’s important to ensure that your ssl and security is set up and configured correctly. after all, the real goal is to ensure that your website visitors are safe while browsing your website. after all, a data breach could cost your business time, money and reputation!\n\nbeyond the visitor’s point of view, it’s just good business to ensure your website provides adequate security. and if it’s going to help with your seo, well that’s great too.\n\nwebsite visitors do not always understand the technicalities of what goes on behind the scenes of a website. they don’t understand how their data is encrypted. but, they know the hassle that comes when they’ve become vulnerable to an attack, have been hacked or have had their information compromised. what they do know is that the s that is part of https and the lock in the browser is the best indication they have that a business is doing everything it can to protect their sensitive information. so, if you haven’t yet adopted https, perhaps it’s time you did.\n\nif you still have questions about getting your website secure with ssl certificate, please call our seo experts here at 1st on the list at 1-877-562-1750.\n\nthe post [https is everywhere – and if it’s not it should be](https://www.1stonthelist.ca/blog/https-is-everywhere-and-if-its-not-it-should-be/) appeared first on [1st on the list](https://www.1stonthelist.ca).\n\n   \n   \n from wordpress http://bit.ly/2waqlmt", "sortedWord": "None", "Identifyer": null, "identifyer": 74153, "year": "2019"}], "name": "yourselfcanon2019"}