{"interestingcomments": [{"Unnamed: 0": 172531, "autor": "xduhc", "date": 1610839550000, "content": "Improving ceramic access door to sewer /!/ I moved into a new house in June. The finished basement has ceramic (faux wood) floors. The floor features two small sections that are basically access doors: one to the water main, and another to the sewer line. Here’s the one to the sewer:\n\nhttps://imgur.com/gallery/Q0BodRY\n\nThis thing is stuck tight. I cannot lift it up, nor can I pry it open with any of the tools that I have.  \n\nI need:\n\n- to lift this up ASAP to inspect the sewer line. I do not have a ceramic drill bit, but will get one if that’s the only way to open it. \n- to devise a long-term design that will keep this door tightly sealed on a daily basis, but easy to open when I need to. \n\nI do not have any spare ceramic tiles, but I could probably find this design if I tried. \n\nAnyone have ideas? TIA!", "link": "https://www.reddit.com/r/HomeImprovement/comments/kyu19i/improving_ceramic_access_door_to_sewer/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  ceramic access door to sewer /!/ i moved into a new house in june. the finished basement has ceramic (faux wood) floors. the floor features two small sections that are basically access doors: one to the water main, and another to the sewer line. here’s the one to the sewer:\n\nhttps://imgur.com/gallery/q0bodry\n\nthis thing is stuck tight. i cannot lift it up, nor can i pry it open with any of the tools that i have.  \n\ni need:\n\n- to lift this up asap to inspect the sewer line. i do not have a ceramic drill bit, but will get one if that’s the only way to open it. \n- to devise a long-term design that will keep this door tightly sealed on a daily basis, but easy to open when i need to. \n\ni do not have any spare ceramic tiles, but i could probably find this design if i tried. \n\nanyone have ideas? tia!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/kyu19i/improving_ceramic_access_door_to_sewer/", "identifyer": 172531, "year": "2021"}], "name": "improveHomeImprovement2021"}