{"interestingcomments": [{"Unnamed: 0": 140889, "autor": "DJ_DAD_JEANS", "date": 1612049864000, "content": "Gravel Parking Pad Sanity Check /!/ We just got this new automatic gate installed so we can park a car in the back yard. Our initial plan was to get the gate installed and get a concrete pad laid for parking. I guess concrete guys are busy enough around here cause we never got any replys for a quote when we told them we just need a small area.  So we decided to probably just make it a gravel pad for the time being. Heres a pic of the area:   \n[https://imgur.com/a/pDty8c9](https://imgur.com/a/pDty8c9)  \n(the line is not the final height - just a quick visual outline of the marked out space)  \n\n\nThe marked off spot is 14' x 20'. Figured I'd need to:\n\n* Dig down about 4-6\"\n* Lay some sort of landscaping cloth/weed barier\n* Edge with some landscaping edging to keep gravel contained\n* Fill with gravel  \n\n\nI've never rented any large-ish excavating machinery before. Can I get away with digging out a couple inches in such a small area with one of those small skid steers? Like the ones that you walk behind?  Renting of of those two ton excavators seems like (expensive) overkill for something like this. \n\nThanks in advance for any advice. Once I marked everything out this afternoon I was like \"oh hey yeah digging this out with a shovel might be terrible\".", "link": "https://www.reddit.com/r/HomeImprovement/comments/l8yxul/gravel_parking_pad_sanity_check/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we decided to probably just make", "selectorShort": "make", "MarkedSent": "gravel parking pad sanity check /!/ we just got this new automatic gate installed so we can park a car in the back yard. our initial plan was to get the gate installed and get a concrete pad laid for parking. i guess concrete guys are busy enough around here cause we never got any replys for a quote when we told them we just need a small area.  so -----> we !!!  -----> decided !!!  -----> to !!!  -----> probably !!!  -----> just !!!  -----> make !!!  it a gravel pad for the time being. heres a pic of the area:   \n[https://imgur.com/a/pdty8c9](https://imgur.com/a/pdty8c9)  \n(the line is not the final height - just a quick visual outline of the marked out space)  \n\n\nthe marked off spot is 14' x 20'. figured i'd need to:\n\n* dig down about 4-6\"\n* lay some sort of landscaping cloth/weed barier\n* edge with some landscaping edging to keep gravel contained\n* fill with gravel  \n\n\ni've never rented any large-ish excavating machinery before. can i get away with digging out a couple inches in such a small area with one of those small skid steers? like the ones that you walk behind?  renting of of those two ton excavators seems like (expensive) overkill for something like this. \n\nthanks in advance for any advice. once i marked everything out this afternoon i was like \"oh hey yeah digging this out with a shovel might be terrible\".", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/l8yxul/gravel_parking_pad_sanity_check/", "identifyer": 140889, "year": "2021"}, {"Unnamed: 0": 150365, "autor": "Darkbeing_sc2", "date": 1623785490000, "content": "Need an outside prospective on a job gone wrong /!/  \n\nHi all,\n\nI wanted to run a scenario by you folks in hopes to gain some outside prospective on a situation that I am currently dealing with.\n\nTL:DR\n\n1950s home that had some electrical work quoted to modernize it. Electrician opted to not do a pre-inspection, ran into issues with the homes ceiling/attic access, running wires through wall, duct work, not having the right tools, temperature of the attic, general frustration with the work and left the job 1 day over the estimated timeline not completing the already chopped down task list. Gave them more than half the deposit mid way through the work and they are asking for the remaining balance when only 6/16 tasks were even completed leaving several incomplete or postponed. What would you do in this situation and what do you recommend I do?\n\nFull Story\n\nBackground of the home, my house was built in the 1950s. I recently bought this home 4 years ago with my wife and discovered immediately the house needed some electrical updates. Most of the light sources in the house were non-existent or stemming from area lamps. Some rooms didn't even have overhead lighting to include our master bedroom and guest room. Assumptions could be made that whoever did the work on the additions previously wasn't very forward thinking and as a result any work on this home becomes a big project.\n\nI hired a master electrician, older gentleman, Husband/Wife company that we've employed in the past to do the following work on my home estimated at 3 days labor and $2250.00 including material. They stated they would bill on their day rate and did no pre inspection before quoting the work. We insisted that they take a look around the house/attic/basement to make sure they knew what to anticipate but they declined.\n\n16 Tasks\n\nGeneral\n\n• replace any remaining flip switches with white paddles switches (x9)\n\n• put cover on garage circuit breaker panel\n\nDen\n\n• add 2 recessed lights and convert switch to a dimmer\n\nOffice\n\n• add 2 recessed lights and new dimmer switch\n\n• add 1 light to closet\n\n• add 1 new 2 plug outlet\n\n• repair/replace 1 existing outlet\n\nKitchen\n\n• add 8 recessed lights to existing junction and convert switch to dimmer\n\n• add new switch to existing lighting to be controlled from a 3rd access point\n\nLiving Room\n\n• replace 3 existing pot lights with newly provided recessed LEDs and convert switches to dimmers\n\n• add 2 recessed lights to existing lighting/switching\n\n• add 1 recessed light with independent switch\n\n• convert a 2 plug outlet to a 4 plug outlet\n\n• add 1 new 2 plug outlet\n\n• move a switch located in the master bedroom that controls the attic light to an adjacent wall outside of the bedroom\n\n• run a C wire for a thermostat\n\nOk so I'm just going to start from the beginning from my point of view and hopefully it has some kind of cohesion to you the reader.\n\nBefore the work started, emails went back and forth about the cost and time. A final estimate was to be sent and received so that we could provide half the cost up front as a deposit before the work began. We never heard from them and had to reach out to them to request the final quote which they ultimately never sent.\n\nJune 9th, Day - 1 (4-5 hours total)\n\nThe first day the Electrician shows up an hour after the scheduled time with a helper (not an apprentice or journeyman) to assist with snaking cable and whatever else and begin casing the house. We provided them with all the recessed lighting for the tasks, provided an itemized list of what we had requested and stayed out of their way as they got to work. They spent some time preparing the recessed lighting and decided to start with the kitchen lighting first. After no exaggeration 2-3 hours of making 4 cut out holes in the ceiling it was expressed that they were running into difficulty because behind the drywall was another layer of material that was very hard to cut through with their hole saw. This material was later identified as homasote board (sound controlling board). This appeared to be installed under all of the ceiling drywall in the kitchen, likely to reduce noise from the air handler in the attic. They expressed that maybe they didn't have the right cut out tools. After all the hurdles for the day, he replaced 1-2 switches with paddle switches and called it a day stating they would have to get some different tools for cutting the holes and do some brain storming.\n\nJune 10th, Day - 2 (3 hours total)\n\nThe Electrician and help arrive on the scheduled time. The first 1-2 hours of the morning was spent attempting to drill out more cut outs from the kitchen with little to no effect. The idea of drilling down from the attic to make these recessed hole cut outs came up but was later stalled because in my attic I have decking or plywood down so you don't have easy access to the joist bays as well as duct work from the HVAC that runs all through my attic floor over key areas that would need recessed lighting or wiring installed. The electrician spent another hour drawing/sketching which boards and ducts he would need access to underneath and stated that he/helper didn't have the tools to remove the decking to gain access to the joist space. I stated that it was the middle of the work day for me but as soon as I have time I will go into the attic and start pulling nails and cutting through plywood in the 100+ degree attic to help them gain access since I had a hammer and a nail puller tool. Since the kitchen lighting was delayed again, he and the helper replaced the 3 existing pot lights with 3 newer LED recessed lights in the living room. He wired them and call it a day around 1pm stating that until the decking in the attic was removed there wasn't much more they could do for the day and that the \"Boss/wife\" told him to go on another job for the rest of the day since they were at a stopping point here. Before leaving I expressed that since the decking/ducts were posing such a challenge that we may have to postpone some of the work that we originally requested until the ducting is removed so that we weren't requesting any work that was too unreasonable or unrealistic/expensive. (We have a future project scheduled to replace the HVAC with ductless mini splits.)\n\nThat night, we get an email and a call from the \"Boss/wife\" giving us a bill for the work done so far and explains some of the challenges that the Electrician was facing and why things weren't moving along as expected. The bill was for $1470.00 thus far to include time elapsed and materials. I had expressed concern that we were getting billed at a rate that was not following the progress/timeline. When I was asked to explain I stated that given the challenges and expressed concerns/limitation of the Electrician and what we think we will have to remove from the list currently the only work that has been done was 4 cut holes in my kitchen ceiling with no lighting in them, 3 pot lights replaced with LEDs and 2 light switches replaced with paddles totaling $1470.00. I continued that they were certainly owed half of the original estimate in an effort to show good faith on our end and that I do believe work was done and should be compensated but maybe not at the original cost/ day rate projected since there seems to be a level of resistance to work on these tougher jobs. I stated there were a lot of hours clocked but not a lot to show for it in truth. She repeated that they were billing for 5 hours each day so far even though I had logged maybe 4 hours the first day and barely 3 hours the second to which she rebutted that they charge for travel time and that he calls her when he arrives and leaves. Needless to say the conversation didn't get us anywhere and we wrote the the check for the $1470.00 to show that we were being honest and genuine.\n\nJune 10th, Day - 3 (5-6 hours total)\n\nAfter spending 3-4 hours of my own time the day prior in the hot attic pulling 4 inch nails and using my circular saw to make a series of access points for the recessed lighting in the kitchen the Electrician and helper arrive on time and hit the ground running. They spend a majority of the day, 5-6 hours in the kitchen/attic cutting the rest of the recessed lighting holes, running wiring and installing dimmer switches. After a full day of working in the intense heat they called it a day and justifiably so given the temperature. The lighting in the kitchen looked amazing and we gave them much praise for their efforts. Before leaving we talked to him about what work we felt logically made sense to postpone due to the decking/duct work getting in the way of completing the tasks. We noted the following as tasks that would be completed at a later time and removed from the current tasking:\n\nDen\n\n• add 2 recessed lights and convert switch to a dimmer\n\nOffice\n\n• add 1 of recessed lights on new dimmer switch\n\n• add 1 light to closet\n\nKitchen\n\n• add new switch to existing lighting to be controlled from a 3rd access point\n\nLiving Room\n\n• add 2 recessed lights to existing lighting/switching\n\n• add 1 recessed light with independent switch\n\n• run a C wire for a thermostat\n\nJune 14th, Day - 4 (4-5 hours total)\n\nThe Electrician arrived a half hour after the scheduled time, we discussed his plan of attack on the remaining list and he began working in the office. He identified that decking and ductwork were blocking the location for the closet light and one of the recessed lights. We asked if he could just install one of the two recessed lights and add the second one on later to switch he said sure no problem (thumbs up.) After an hour or two or trying to snake a wire for the switch that would control the recessed light, he identified a crossed member in the wall preventing him from snaking the wire all the way through. He stated he would need a longer drill bit that he didn't have at the moment and would have to postpone that work. He continued with fixing a broken outlet in the office, expanded an outlet in the living room from 2 plug to 4 plug, installed the circuit breaker panel cover and finished swapping out all the remaining light switches with paddle switches. He then stated to my wife that he was frustrated and done for the day. We received a call later that day by the Boss stating that he left because he did all he could for the day and was frustrated with all of the challenges due to the decking and duct work. We stated that were was still stuff on the list that he said he could complete but had not done yet. She replied stating that if we wanted him to he could come back out maybe sometime later in the week if we really wanted those things done.\n\nSo that brings us to today, and email received for the remaining balance due of $825.00 after our initial deposit bringing the final total to $2295.00 stating that now the electrician knows the house somewhat we can get a price from him for the remainder of the work later down the road when the ducting gets removed.\n\nI asked and expected to pay for 16 tasks to be completed, identified hurdles along the way, removed 7 of the items on our list, and in the end still did not get the remaining work completed. From an overall view point, only 6 out of the original 16 items on the list were done and I'm being asked to pay more than was originally quoted.\n\nMy thoughts are that this whole thing has devolved into a shit show and given the facts, we were originally quoted for $2250.00 to do 16 tasks. I have experience as a handyman and do understand that costs, prices and timelines have to sometimes be fluid and I think hard work deserves fair compensation but in this situation I can't help but feel like I'm being billed for time spent on something that ultimately wasn't completed.\n\nPlease share with me your thoughts and feelings on the situation and thank you for taking the time to read this. Hopefully I didn't have too many spelling or grammar mistakes.", "link": "https://www.reddit.com/r/HomeImprovement/comments/o0mjd4/need_an_outside_prospective_on_a_job_gone_wrong/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we felt logically made", "selectorShort": "make", "MarkedSent": "need an outside prospective on a job gone wrong /!/  \n\nhi all,\n\ni wanted to run a scenario by you folks in hopes to gain some outside prospective on a situation that i am currently dealing with.\n\ntl:dr\n\n1950s home that had some electrical work quoted to modernize it. electrician opted to not do a pre-inspection, ran into issues with the homes ceiling/attic access, running wires through wall, duct work, not having the right tools, temperature of the attic, general frustration with the work and left the job 1 day over the estimated timeline not completing the already chopped down task list. gave them more than half the deposit mid way through the work and they are asking for the remaining balance when only 6/16 tasks were even completed leaving several incomplete or postponed. what would you do in this situation and what do you recommend i do?\n\nfull story\n\nbackground of the home, my house was built in the 1950s. i recently bought this home 4 years ago with my wife and discovered immediately the house needed some electrical updates. most of the light sources in the house were non-existent or stemming from area lamps. some rooms didn't even have overhead lighting to include our master bedroom and guest room. assumptions could be made that whoever did the work on the additions previously wasn't very forward thinking and as a result any work on this home becomes a big project.\n\ni hired a master electrician, older gentleman, husband/wife company that we've employed in the past to do the following work on my home estimated at 3 days labor and $2250.00 including material. they stated they would bill on their day rate and did no pre inspection before quoting the work. we insisted that they take a look around the house/attic/basement to make sure they knew what to anticipate but they declined.\n\n16 tasks\n\ngeneral\n\n• replace any remaining flip switches with white paddles switches (x9)\n\n• put cover on garage circuit breaker panel\n\nden\n\n• add 2 recessed lights and convert switch to a dimmer\n\noffice\n\n• add 2 recessed lights and new dimmer switch\n\n• add 1 light to closet\n\n• add 1 new 2 plug outlet\n\n• repair/replace 1 existing outlet\n\nkitchen\n\n• add 8 recessed lights to existing junction and convert switch to dimmer\n\n• add new switch to existing lighting to be controlled from a 3rd access point\n\nliving room\n\n• replace 3 existing pot lights with newly provided recessed leds and convert switches to dimmers\n\n• add 2 recessed lights to existing lighting/switching\n\n• add 1 recessed light with independent switch\n\n• convert a 2 plug outlet to a 4 plug outlet\n\n• add 1 new 2 plug outlet\n\n• move a switch located in the master bedroom that controls the attic light to an adjacent wall outside of the bedroom\n\n• run a c wire for a thermostat\n\nok so i'm just going to start from the beginning from my point of view and hopefully it has some kind of cohesion to you the reader.\n\nbefore the work started, emails went back and forth about the cost and time. a final estimate was to be sent and received so that we could provide half the cost up front as a deposit before the work began. we never heard from them and had to reach out to them to request the final quote which they ultimately never sent.\n\njune 9th, day - 1 (4-5 hours total)\n\nthe first day the electrician shows up an hour after the scheduled time with a helper (not an apprentice or journeyman) to assist with snaking cable and whatever else and begin casing the house. we provided them with all the recessed lighting for the tasks, provided an itemized list of what we had requested and stayed out of their way as they got to work. they spent some time preparing the recessed lighting and decided to start with the kitchen lighting first. after no exaggeration 2-3 hours of making 4 cut out holes in the ceiling it was expressed that they were running into difficulty because behind the drywall was another layer of material that was very hard to cut through with their hole saw. this material was later identified as homasote board (sound controlling board). this appeared to be installed under all of the ceiling drywall in the kitchen, likely to reduce noise from the air handler in the attic. they expressed that maybe they didn't have the right cut out tools. after all the hurdles for the day, he replaced 1-2 switches with paddle switches and called it a day stating they would have to get some different tools for cutting the holes and do some brain storming.\n\njune 10th, day - 2 (3 hours total)\n\nthe electrician and help arrive on the scheduled time. the first 1-2 hours of the morning was spent attempting to drill out more cut outs from the kitchen with little to no effect. the idea of drilling down from the attic to make these recessed hole cut outs came up but was later stalled because in my attic i have decking or plywood down so you don't have easy access to the joist bays as well as duct work from the hvac that runs all through my attic floor over key areas that would need recessed lighting or wiring installed. the electrician spent another hour drawing/sketching which boards and ducts he would need access to underneath and stated that he/helper didn't have the tools to remove the decking to gain access to the joist space. i stated that it was the middle of the work day for me but as soon as i have time i will go into the attic and start pulling nails and cutting through plywood in the 100+ degree attic to help them gain access since i had a hammer and a nail puller tool. since the kitchen lighting was delayed again, he and the helper replaced the 3 existing pot lights with 3 newer led recessed lights in the living room. he wired them and call it a day around 1pm stating that until the decking in the attic was removed there wasn't much more they could do for the day and that the \"boss/wife\" told him to go on another job for the rest of the day since they were at a stopping point here. before leaving i expressed that since the decking/ducts were posing such a challenge that we may have to postpone some of the work that we originally requested until the ducting is removed so that we weren't requesting any work that was too unreasonable or unrealistic/expensive. (we have a future project scheduled to replace the hvac with ductless mini splits.)\n\nthat night, we get an email and a call from the \"boss/wife\" giving us a bill for the work done so far and explains some of the challenges that the electrician was facing and why things weren't moving along as expected. the bill was for $1470.00 thus far to include time elapsed and materials. i had expressed concern that we were getting billed at a rate that was not following the progress/timeline. when i was asked to explain i stated that given the challenges and expressed concerns/limitation of the electrician and what we think we will have to remove from the list currently the only work that has been done was 4 cut holes in my kitchen ceiling with no lighting in them, 3 pot lights replaced with leds and 2 light switches replaced with paddles totaling $1470.00. i continued that they were certainly owed half of the original estimate in an effort to show good faith on our end and that i do believe work was done and should be compensated but maybe not at the original cost/ day rate projected since there seems to be a level of resistance to work on these tougher jobs. i stated there were a lot of hours clocked but not a lot to show for it in truth. she repeated that they were billing for 5 hours each day so far even though i had logged maybe 4 hours the first day and barely 3 hours the second to which she rebutted that they charge for travel time and that he calls her when he arrives and leaves. needless to say the conversation didn't get us anywhere and we wrote the the check for the $1470.00 to show that we were being honest and genuine.\n\njune 10th, day - 3 (5-6 hours total)\n\nafter spending 3-4 hours of my own time the day prior in the hot attic pulling 4 inch nails and using my circular saw to make a series of access points for the recessed lighting in the kitchen the electrician and helper arrive on time and hit the ground running. they spend a majority of the day, 5-6 hours in the kitchen/attic cutting the rest of the recessed lighting holes, running wiring and installing dimmer switches. after a full day of working in the intense heat they called it a day and justifiably so given the temperature. the lighting in the kitchen looked amazing and we gave them much praise for their efforts. before leaving -----> we !!!  talked to him about what work -----> we !!!  -----> felt !!!  -----> logically !!!  -----> made !!!  sense to postpone due to the decking/duct work getting in the way of completing the tasks. we noted the following as tasks that would be completed at a later time and removed from the current tasking:\n\nden\n\n• add 2 recessed lights and convert switch to a dimmer\n\noffice\n\n• add 1 of recessed lights on new dimmer switch\n\n• add 1 light to closet\n\nkitchen\n\n• add new switch to existing lighting to be controlled from a 3rd access point\n\nliving room\n\n• add 2 recessed lights to existing lighting/switching\n\n• add 1 recessed light with independent switch\n\n• run a c wire for a thermostat\n\njune 14th, day - 4 (4-5 hours total)\n\nthe electrician arrived a half hour after the scheduled time, we discussed his plan of attack on the remaining list and he began working in the office. he identified that decking and ductwork were blocking the location for the closet light and one of the recessed lights. we asked if he could just install one of the two recessed lights and add the second one on later to switch he said sure no problem (thumbs up.) after an hour or two or trying to snake a wire for the switch that would control the recessed light, he identified a crossed member in the wall preventing him from snaking the wire all the way through. he stated he would need a longer drill bit that he didn't have at the moment and would have to postpone that work. he continued with fixing a broken outlet in the office, expanded an outlet in the living room from 2 plug to 4 plug, installed the circuit breaker panel cover and finished swapping out all the remaining light switches with paddle switches. he then stated to my wife that he was frustrated and done for the day. we received a call later that day by the boss stating that he left because he did all he could for the day and was frustrated with all of the challenges due to the decking and duct work. we stated that were was still stuff on the list that he said he could complete but had not done yet. she replied stating that if we wanted him to he could come back out maybe sometime later in the week if we really wanted those things done.\n\nso that brings us to today, and email received for the remaining balance due of $825.00 after our initial deposit bringing the final total to $2295.00 stating that now the electrician knows the house somewhat we can get a price from him for the remainder of the work later down the road when the ducting gets removed.\n\ni asked and expected to pay for 16 tasks to be completed, identified hurdles along the way, removed 7 of the items on our list, and in the end still did not get the remaining work completed. from an overall view point, only 6 out of the original 16 items on the list were done and i'm being asked to pay more than was originally quoted.\n\nmy thoughts are that this whole thing has devolved into a shit show and given the facts, we were originally quoted for $2250.00 to do 16 tasks. i have experience as a handyman and do understand that costs, prices and timelines have to sometimes be fluid and i think hard work deserves fair compensation but in this situation i can't help but feel like i'm being billed for time spent on something that ultimately wasn't completed.\n\nplease share with me your thoughts and feelings on the situation and thank you for taking the time to read this. hopefully i didn't have too many spelling or grammar mistakes.", "sortedWord": "None", "removed": null, "score": 1, "comments": 25, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/o0mjd4/need_an_outside_prospective_on_a_job_gone_wrong/", "identifyer": 150365, "year": "2021"}, {"Unnamed: 0": 158833, "autor": "BorysTopPerformer", "date": 1621527992000, "content": "Do We Just Trash It Or Do It Carefully /!/ We're three years into to owning a flipped house and one main issue was the French doors in our dining area. Only one would open. Now, because my SO has the strength of Hulk, he closed the one opening one permanently...accidently. The seller placed adhesive floor tiles OVER the existing floor (without actually adhering them) and put a threshold over the edge causing the doors to have to lift over the barrier. Is there a way to force the doors to lift over the threshold without breaking the doors in half by our efforts(specialized tool maybe?) or do we just make a new window.", "link": "https://www.reddit.com/r/HomeImprovement/comments/nh4n5l/do_we_just_trash_it_or_do_it_carefully/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we just make", "selectorShort": "make", "MarkedSent": "do we just trash it or do it carefully /!/ we're three years into to owning a flipped house and one main issue was the french doors in our dining area. only one would open. now, because my so has the strength of hulk, he closed the one opening one permanently...accidently. the seller placed adhesive floor tiles over the existing floor (without actually adhering them) and put a threshold over the edge causing the doors to have to lift over the barrier. is there a way to force the doors to lift over the threshold without breaking the doors in half by our efforts(specialized tool maybe?) or do -----> we !!!  -----> just !!!  -----> make !!!  a new window.", "sortedWord": "None", "removed": null, "score": 1, "comments": 38, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/nh4n5l/do_we_just_trash_it_or_do_it_carefully/", "identifyer": 158833, "year": "2021"}, {"Unnamed: 0": 193303, "autor": "NecroJoe", "date": 1609659920000, "content": "Installed a \"full access\" bi-fold closet door...man, what a challenge for a novice! /!/ One of the last parts of our home's remodel: installing the last closet door (no, it's not automatic, I'm inside the closet pushing the door...and yes, we made every \"in the closet\" and \"coming out of the closet\" joke we could think of).\n (Link moved to comments)\n\nIt's the Johnson Hardware \"full access\" bi-fold door hardware, and mortise hinges.\nhttps://johnsonhardware.com/1601-full-access-bi-fold-door-hardware\n\nIts motion looks pretty effortless, but, man...what a pain.\n\nYou can stop reading here if you want, but watch that video linked in the comments...it's very satisfying, I think. :) The rest of this is the process, and some of the issues (and how I *think* I worked them out pretty successfully...)\n\nOK, so, this closet had all sorts of aspects that made it a challenge. \n\n1) The open door on the left is a bathroom. To the right, is the bedroom entry door, and you can see another closet door through this bedroom door.  We wanted to be able to leave this  new closet door open sometimes without blocking the others, and without a risk for colliding doors if someone left a door open.\n...) a normal hinged door would block the bathroom if left open, or block the bedroom entrance if hinged in the right.\n...) the layout means we can't do a pocket door or a barn door.\n...) a 2-piece sliding door would mean that we could only ever have 17.5\" of the 36\" wide doorway open at any time, which is awkward. We already have a closet like this, and itxs sort of annoying.\n...) a normal bi-fold door would either stick out and block half of the entry, or would open into the closet, taking up valuable space in the closet.\n\n2) The floor. This is at a transition between the existing house and the addition. Due to an idiot contractor, the entry of the bedroom slopes down. The entry of this closet slopes down to the left almost 3/4\" across the opening. But the inside of the closet, behind the doorway frame,, is relatively flat.\n...) This floor slope means we can't use a floor track even if we did settle for a double sliding door.\n...) if we used a top-mounted slider set, the slop would mean the position of the doors could make a huge gap under the door if the doors were cut to the floor and bypassed each other....or would leave an uneven gap if they were cut straight.\n\nAfter waffling in it for MONTHS, and leaving the doorway unfinished and without trim (in case whatever we picked needed a specific condition),  we found the Johnson Hardware full-access bi-fold door hardware. It's a bi-fold door system, but it comes out, and folds flat against the wall to the side.\n\nHowever...\n\nThe hinges that come with the set are super ugly, and wouldn't match the hinges of the nearby doors, so we went with the mortise hinge install option and used \"normal\" hinges.\n\nI had never cut hinge mortises before. My plunge router couldn't hold a depth to save it's life, and I am TERRIBLE with a chisel. So I bought a new palm router (Yay, new power tool!), and a sharp chisel just to square up the corners.\n\nWe bought a set of hollow-core Masonite brand bi-fold doors from Home Depot.\n\nAs I started routing the mortises, I discovered just how soft/mushy the door's core material is. The sawdust was...like...fluffy. It turns out these doors are meant to hang from a track rather than side hinges, so the solid material around the perimeter is not very load-bearing and soft. I worried the screws would pull right out. I thankfully did a test by driving a screw into the bottom edge and tried to pull it out with a claw hammer. It pulled right out, with little resistance. *sigh*\n\nI have to say, I'm pretty proud of my idea...i used a toggle bolt at each hinge to spread out the load to the \"back\" of this perimeter MDF, and then still using two of the normal screws to mostly keep things aligned.\nhttps://imgur.com/a/IbgWxnW\n\nI give myself a B- on six of the eight mortises, C on one, and D on the last one. The router got away from my edge guide... *sigh*\n\nThen I cut the bottom of the doors to height. I measured the sloping floor height in 7 places, subtracted the planned gap at the top, drew a line to connect the dots, and cut the bottom off on the angle. On the one end, I had to cut so much off that I cut into the hollow core. *sigh* I could have left it open, but decided to glue a block of wood inside. Lord knows I'd be the one to trip and kick the door right where there's no support and it would break, or something.\n\nSo far, so...OK, I guess. Then I needed to attach that top arm to guide the fold. I started screwing it to inside face of the door, aaaaand there was no solid material inside. So the screws had nothing to grab onto, and just spun out. *sigh*\n\nOk. So the toggle bolts for the hinges seemed to work really well, so I tried some smaller ones here, too. Of course the only ones I had had 3\" screws, so I had to cut them by squeezing a wire cutter pliers with some larger channel lock pliers because I couldn't squeeze hard enough. I had to cut 4, because one piece went flying when it cut and I lost it, and then another had the threads so screwed up the toggle wouldn't screw on. Thankfully I ended up with two, because they were my last 2 screws this size.\n\nThe screws into the door had to be very close together so I had to be really careful with the larger drill bit to be large enough fit the toggle/butterflies through, and close enough to fit the bracket on the arm.\n\nThe package of the toggle bolts said to use a 3/8\" drill bit. They are a lying pack of lying liars who lie. After \"sawing\" the holes with the sides of the drill bit, I finally got the toggles in...but they were so close to each other they played footsie inside the door, and so close to the solid border inside the door, that I had to wrestle with them to get them to settle into a good position. Like trying to so surgery on a fly with toothpicks through a window screen...or...something. \n\nI finally got them into position, after scratching the hell out of the door's paint we just finished last night.\n\nThe rest of the install was pretty straight forward.\n\nIn the end, this really was the best option for a door here, and the end result is real satisfying. I've been playing with it for most of the night.\n\nNow we just need to decide on a door pull that we like, that also won't catch on out clothing when we walk past it every day...like our bedroom door's knob does...", "link": "https://www.reddit.com/r/HomeImprovement/comments/kpghix/installed_a_full_access_bifold_closet_doorman/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "installed a \"full access\" bi-fold closet door...man, what a challenge for a novice! /!/ one of the last parts of our home's remodel: installing the last closet door (no, it's not automatic, i'm inside the closet pushing the door...and yes, -----> we !!!  -----> made !!!  every \"in the closet\" and \"coming out of the closet\" joke -----> we !!!  could think of).\n (link moved to comments)\n\nit's the johnson hardware \"full access\" bi-fold door hardware, and mortise hinges.\nhttps://johnsonhardware.com/1601-full-access-bi-fold-door-hardware\n\nits motion looks pretty effortless, but, man...what a pain.\n\nyou can stop reading here if you want, but watch that video linked in the comments...it's very satisfying, i think. :) the rest of this is the process, and some of the issues (and how i *think* i worked them out pretty successfully...)\n\nok, so, this closet had all sorts of aspects that made it a challenge. \n\n1) the open door on the left is a bathroom. to the right, is the bedroom entry door, and you can see another closet door through this bedroom door.  we wanted to be able to leave this  new closet door open sometimes without blocking the others, and without a risk for colliding doors if someone left a door open.\n...) a normal hinged door would block the bathroom if left open, or block the bedroom entrance if hinged in the right.\n...) the layout means we can't do a pocket door or a barn door.\n...) a 2-piece sliding door would mean that we could only ever have 17.5\" of the 36\" wide doorway open at any time, which is awkward. we already have a closet like this, and itxs sort of annoying.\n...) a normal bi-fold door would either stick out and block half of the entry, or would open into the closet, taking up valuable space in the closet.\n\n2) the floor. this is at a transition between the existing house and the addition. due to an idiot contractor, the entry of the bedroom slopes down. the entry of this closet slopes down to the left almost 3/4\" across the opening. but the inside of the closet, behind the doorway frame,, is relatively flat.\n...) this floor slope means we can't use a floor track even if we did settle for a double sliding door.\n...) if we used a top-mounted slider set, the slop would mean the position of the doors could make a huge gap under the door if the doors were cut to the floor and bypassed each other....or would leave an uneven gap if they were cut straight.\n\nafter waffling in it for months, and leaving the doorway unfinished and without trim (in case whatever we picked needed a specific condition),  we found the johnson hardware full-access bi-fold door hardware. it's a bi-fold door system, but it comes out, and folds flat against the wall to the side.\n\nhowever...\n\nthe hinges that come with the set are super ugly, and wouldn't match the hinges of the nearby doors, so we went with the mortise hinge install option and used \"normal\" hinges.\n\ni had never cut hinge mortises before. my plunge router couldn't hold a depth to save it's life, and i am terrible with a chisel. so i bought a new palm router (yay, new power tool!), and a sharp chisel just to square up the corners.\n\nwe bought a set of hollow-core masonite brand bi-fold doors from home depot.\n\nas i started routing the mortises, i discovered just how soft/mushy the door's core material is. the sawdust was...like...fluffy. it turns out these doors are meant to hang from a track rather than side hinges, so the solid material around the perimeter is not very load-bearing and soft. i worried the screws would pull right out. i thankfully did a test by driving a screw into the bottom edge and tried to pull it out with a claw hammer. it pulled right out, with little resistance. *sigh*\n\ni have to say, i'm pretty proud of my idea...i used a toggle bolt at each hinge to spread out the load to the \"back\" of this perimeter mdf, and then still using two of the normal screws to mostly keep things aligned.\nhttps://imgur.com/a/ibgwxnw\n\ni give myself a b- on six of the eight mortises, c on one, and d on the last one. the router got away from my edge guide... *sigh*\n\nthen i cut the bottom of the doors to height. i measured the sloping floor height in 7 places, subtracted the planned gap at the top, drew a line to connect the dots, and cut the bottom off on the angle. on the one end, i had to cut so much off that i cut into the hollow core. *sigh* i could have left it open, but decided to glue a block of wood inside. lord knows i'd be the one to trip and kick the door right where there's no support and it would break, or something.\n\nso far, so...ok, i guess. then i needed to attach that top arm to guide the fold. i started screwing it to inside face of the door, aaaaand there was no solid material inside. so the screws had nothing to grab onto, and just spun out. *sigh*\n\nok. so the toggle bolts for the hinges seemed to work really well, so i tried some smaller ones here, too. of course the only ones i had had 3\" screws, so i had to cut them by squeezing a wire cutter pliers with some larger channel lock pliers because i couldn't squeeze hard enough. i had to cut 4, because one piece went flying when it cut and i lost it, and then another had the threads so screwed up the toggle wouldn't screw on. thankfully i ended up with two, because they were my last 2 screws this size.\n\nthe screws into the door had to be very close together so i had to be really careful with the larger drill bit to be large enough fit the toggle/butterflies through, and close enough to fit the bracket on the arm.\n\nthe package of the toggle bolts said to use a 3/8\" drill bit. they are a lying pack of lying liars who lie. after \"sawing\" the holes with the sides of the drill bit, i finally got the toggles in...but they were so close to each other they played footsie inside the door, and so close to the solid border inside the door, that i had to wrestle with them to get them to settle into a good position. like trying to so surgery on a fly with toothpicks through a window screen...or...something. \n\ni finally got them into position, after scratching the hell out of the door's paint we just finished last night.\n\nthe rest of the install was pretty straight forward.\n\nin the end, this really was the best option for a door here, and the end result is real satisfying. i've been playing with it for most of the night.\n\nnow we just need to decide on a door pull that we like, that also won't catch on out clothing when we walk past it every day...like our bedroom door's knob does...", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/HomeImprovement/comments/kpghix/installed_a_full_access_bifold_closet_doorman/", "identifyer": 193303, "year": "2021"}, {"Unnamed: 0": 197812, "autor": "Sydney_Reanne", "date": 1613070717000, "content": "Fixing a hole around my doorknob /!/ *little bit of background about the doorknob*\n\nSo in my bedroom of my apartment my door has a lock on it, the only way to unlock it is to unlock it from the inside, and if it’s the outside there needs to be a key. No key for this particular door came with the apartment (we think this doorknob was installed by the previous tenants). The doorknob came with the apartment and my roommates and I never bothered to replace since there was no obvious need to replace it so we left it. \n\nOut of habit one night I left for the night and subconsciously locked my bedroom door on my way out. When I came back the next morning I realized what happened.\n\nSo my roommate came to try to help me try to unlock it and it resulted in us wrestling with the doorknob to come undone. After 20-30 of struggling using tools, pliers, etc I decided to use the old credit card trick and bam\nIt unlocked. \n\nHowever... we made a fairly good size hole around my doorknob from us trying to get the damn thing open. SO I bought a new doorknob (with no lock this time!) but I am left to fix the hole surrounding it. I went to the hardware store and one of the employees helped me get all the things I need thankfully (2 sanding sponges with different coarse, wood stain, and wood filler). So far all I have done to the door is put vinyl sparkling compound on it and now letting it set. This brings me to my question of making sure I am doing it right?? And also make sure it works so I don’t need a completely new door. I will post pictures below of the before and the applied sparkling  on the door. Again I want to make sure this is the right and most effective process so any feedback and guidance is appreciated!", "link": "https://www.reddit.com/r/HomeImprovement/comments/lhs33n/fixing_a_hole_around_my_doorknob/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "fixing a hole around my doorknob /!/ *little bit of background about the doorknob*\n\nso in my bedroom of my apartment my door has a lock on it, the only way to unlock it is to unlock it from the inside, and if it’s the outside there needs to be a key. no key for this particular door came with the apartment (we think this doorknob was installed by the previous tenants). the doorknob came with the apartment and my roommates and i never bothered to replace since there was no obvious need to replace it so we left it. \n\nout of habit one night i left for the night and subconsciously locked my bedroom door on my way out. when i came back the next morning i realized what happened.\n\nso my roommate came to try to help me try to unlock it and it resulted in us wrestling with the doorknob to come undone. after 20-30 of struggling using tools, pliers, etc i decided to use the old credit card trick and bam\nit unlocked. \n\nhowever... -----> we !!!  -----> made !!!  a fairly good size hole around my doorknob from us trying to get the damn thing open. so i bought a new doorknob (with no lock this time!) but i am left to fix the hole surrounding it. i went to the hardware store and one of the employees helped me get all the things i need thankfully (2 sanding sponges with different coarse, wood stain, and wood filler). so far all i have done to the door is put vinyl sparkling compound on it and now letting it set. this brings me to my question of making sure i am doing it right?? and also make sure it works so i don’t need a completely new door. i will post pictures below of the before and the applied sparkling  on the door. again i want to make sure this is the right and most effective process so any feedback and guidance is appreciated!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/lhs33n/fixing_a_hole_around_my_doorknob/", "identifyer": 197812, "year": "2021"}, {"Unnamed: 0": 202529, "autor": "alre8304", "date": 1623702467000, "content": "Help! First time home buyer recommendations /!/ Hello! We are in the process of closing on our first house, meaning we have absolutely no tools, equipment, supplies, etc. needed to maintain a home. What do you recommend we make sure to buy without going too overboard? The house has wood flooring and carpets and has a large yard with no sprinkler system. There is also a large wood deck in the backyard. I'd like to eventually do some renovations, but for now, just need typical home maintenance supplies. I know that we need a lawnmower, some kind of sprinkler, and a power drill... what else? Haha. Thank you!!", "link": "https://www.reddit.com/r/HomeImprovement/comments/nzw5mw/help_first_time_home_buyer_recommendations/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "help! first time home buyer recommendations /!/ hello! we are in the process of closing on our first house, meaning we have absolutely no tools, equipment, supplies, etc. needed to maintain a home. what do you recommend -----> we !!!  -----> make !!!  sure to buy without going too overboard? the house has wood flooring and carpets and has a large yard with no sprinkler system. there is also a large wood deck in the backyard. i'd like to eventually do some renovations, but for now, just need typical home maintenance supplies. i know that we need a lawnmower, some kind of sprinkler, and a power drill... what else? haha. thank you!!", "sortedWord": "None", "removed": null, "score": 2, "comments": 24, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/nzw5mw/help_first_time_home_buyer_recommendations/", "identifyer": 202529, "year": "2021"}, {"Unnamed: 0": 205896, "autor": "leahkushner", "date": 1629836195000, "content": "Portable Generator Installation Questions Please Help /!/ I just purchased a portable Firman hybrid 7500/9500.  It will not run our whole house.  Our plan is to put in a manual transfer switch with 10 switches.  I also have heard about sub panel and even other options in this community Home Improvement.  We made a list of the maximum ramping of each room or device we want to operate.  Refrigerator, TV, computer, stovetop, coffeemaker, WIFI and Internet.and microwave is a huge hog.    We are using propane.  We will be using 100amp power cord not an extension cord that goes directly to the switch from the portable generator.   We will be rolling out the generator onto a cement pad during a power outage.  Questions:\n\n1.  Do we need to use a copper grounding wire?  \n2. Our electrician  initially wanted to bury this cord in the ground and in a weatherproof tube, under cement sidewalks, into the crawlspace which required 200 ft of cord.  We probably will have 1\\`-2 power outages every few years or so not much.  He wanted to build a house around this portable generator with a roof, etc.  It was getting mucho $$$$$.  Do we really need all this?\n3. Now he said he could, as a compromise, put a copper cord in the ground next to the cement pad to be attached to the generator when needed.  .  The cord would then be in a roll inext to the house with some sort of covering for everyone to see.  We have a 12x12 similar to a pool house that we use for our tools, the generator, etc.  It is 80 ft from the house.  we just thought we would store everything in there and pull it out when we need it.  Do we need all of this?  \n4. Is it possible to use the same window spacer that you use for an air conditioner vent and cord and bring in the cord this way traveling 10-20 ft through the house to the switch.  \n5. Does anyone have suggestions ideas, video clips, etc.  Are we missing something?  Our handiperson is NOT a licensed electricians but a plumber who has done lots of construction for over years and has worked for years building houses on construction teams. He has installed transfer switches many times before.  \n\nwe don't want to spend a lot of money on this BUT we want to be safe.  Please respond.  Thanks Leah", "link": "https://www.reddit.com/r/HomeImprovement/comments/pavc9f/portable_generator_installation_questions_please/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "portable generator installation questions please help /!/ i just purchased a portable firman hybrid 7500/9500.  it will not run our whole house.  our plan is to put in a manual transfer switch with 10 switches.  i also have heard about sub panel and even other options in this community home improvement.  -----> we !!!  -----> made !!!  a list of the maximum ramping of each room or device -----> we !!!  want to operate.  refrigerator, tv, computer, stovetop, coffeemaker, wifi and internet.and microwave is a huge hog.    we are using propane.  we will be using 100amp power cord not an extension cord that goes directly to the switch from the portable generator.   we will be rolling out the generator onto a cement pad during a power outage.  questions:\n\n1.  do we need to use a copper grounding wire?  \n2. our electrician  initially wanted to bury this cord in the ground and in a weatherproof tube, under cement sidewalks, into the crawlspace which required 200 ft of cord.  we probably will have 1\\`-2 power outages every few years or so not much.  he wanted to build a house around this portable generator with a roof, etc.  it was getting mucho $$$$$.  do we really need all this?\n3. now he said he could, as a compromise, put a copper cord in the ground next to the cement pad to be attached to the generator when needed.  .  the cord would then be in a roll inext to the house with some sort of covering for everyone to see.  we have a 12x12 similar to a pool house that we use for our tools, the generator, etc.  it is 80 ft from the house.  we just thought we would store everything in there and pull it out when we need it.  do we need all of this?  \n4. is it possible to use the same window spacer that you use for an air conditioner vent and cord and bring in the cord this way traveling 10-20 ft through the house to the switch.  \n5. does anyone have suggestions ideas, video clips, etc.  are we missing something?  our handiperson is not a licensed electricians but a plumber who has done lots of construction for over years and has worked for years building houses on construction teams. he has installed transfer switches many times before.  \n\nwe don't want to spend a lot of money on this but we want to be safe.  please respond.  thanks leah", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/pavc9f/portable_generator_installation_questions_please/", "identifyer": 205896, "year": "2021"}, {"Unnamed: 0": 207487, "autor": "No_Veterinarian_7836", "date": 1634828970000, "content": "I have a plan, but I'm not sure it's a good plan. I need to cut into a wall to see what's behind it. /!/ We believe that we have a space in our house that is closed off by drywall. It's probably unfinished and doesn't have flooring, but we'd like to open it up to make sure that wasps aren't nesting in there.\n\nWhat's the best way to cut a small viewing hole in the drywall, so that we can patch it easily?\n\nI'm limited on tools but I do have an electric screwdriver that's pretty powerful. I thought maybe buying a circular bit that attaches to my electric screwdriver, and then I could just pop it back in and plaster it over in order to replace it.\n\nThe unknown area is pretty big and we can access it in different parts of the upstairs. I thought it would be best if we made the hole to access a viewing in a closet. That way when we replace or patch the hole it will be inside of a closet and not in a main room where people will notice it more readily.\n\nAny advice or thoughts would be helpful.", "link": "https://www.reddit.com/r/HomeImprovement/comments/qcty61/i_have_a_plan_but_im_not_sure_its_a_good_plan_i/", "origin": "Reddit", "suborigin": "HomeImprovement", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "i have a plan, but i'm not sure it's a good plan. i need to cut into a wall to see what's behind it. /!/ we believe that we have a space in our house that is closed off by drywall. it's probably unfinished and doesn't have flooring, but we'd like to open it up to make sure that wasps aren't nesting in there.\n\nwhat's the best way to cut a small viewing hole in the drywall, so that we can patch it easily?\n\ni'm limited on tools but i do have an electric screwdriver that's pretty powerful. i thought maybe buying a circular bit that attaches to my electric screwdriver, and then i could just pop it back in and plaster it over in order to replace it.\n\nthe unknown area is pretty big and we can access it in different parts of the upstairs. i thought it would be best if -----> we !!!  -----> made !!!  the hole to access a viewing in a closet. that way when we replace or patch the hole it will be inside of a closet and not in a main room where people will notice it more readily.\n\nany advice or thoughts would be helpful.", "sortedWord": "None", "removed": null, "score": 1, "comments": 19, "media": null, "medialink": "https://www.reddit.com/r/HomeImprovement/comments/qcty61/i_have_a_plan_but_im_not_sure_its_a_good_plan_i/", "identifyer": 207487, "year": "2021"}], "name": "makeHomeImprovement2021"}