[
  {
    "autor": "ntoporcov",
    "date": "2019-01-18 06:21:37",
    "content": "I created a web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.",
    "link": "https://www.reddit.com/r/Nikon/comments/ah7lvu/i_created_a_web_app_for_photographers_who_use/",
    "origin": "Reddit",
    "suborigin": "nikon",
    "result": true,
    "Selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 1248,
    "year": "2019",
    "id": 0
  },
  {
    "autor": "carbon_dragon",
    "date": "2020-08-08 12:53:00",
    "content": "Am I the only one who thinks Leica should come up with some kind of accommodation for M9 owners (even though it's not legally obliged to)? Why should they? Because people buy and keep Leicas for longer and that is part of how they justify the cost. Like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. Otherwise someone shopping for a M10R right now will think to themselves, Hmmm... I guess Leica is just like all the other brands with only maintaining repair capability for maybe a decade. Maybe it's not a good idea to spend that premium a price when I can get something cheaper. Sure the Leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important.",
    "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/?tab=comments#comment-4023509",
    "origin": "L-forum",
    "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production",
    "selector": "come up with",
    "selectorShort": "with",
    "MarkedSent": "am i the only one who thinks leica should -----> come !!!  -----> up !!!  -----> with !!!  some kind of accommodation for m9 owners (even though it's not legally obliged to)? why should they? because people buy and keep leicas for longer and that is part of how they justify the cost. like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. otherwise someone shopping for a m10r right now will think to themselves, hmmm... i guess leica is just like all the other brands with only maintaining repair capability for maybe a decade. maybe it's not a good idea to spend that premium a price when i can get something cheaper. sure the leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 32823,
    "year": "2020",
    "id": 1
  },
  {
    "autor": "marknorton",
    "date": "2007-04-10 09:11:00",
    "content": "Mark,I am just amazed by your skill as a technician, engineer and photographer. I really enjoyed seeing the insides of the M8 but also your commentary on why they did this and that. Thank you very much for sharing this with us! btw - I know a little about how hard this project was as I recently tried to adapt my wife's old canon pro 1 for a different use: I wanted to make a dedicated camera with the fast surplus TV projection lenses. Well let's just say the parts are still in a box. Maybe if I had your skills I might have gotten a litte further. Regards, Eric Hiss Thanks Eric. The pictures were taken with a Nikon D2X, their 60mm f2.8 macro and their new macro flash. I tried the 105mm f2.8 macro lens but it was too long. I need some more practice in some of those shadows though!",
    "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224510",
    "origin": "L-forum",
    "suborigin": "21079-anatomy-of-the-leica-m8",
    "selector": "i wanted to make",
    "selectorShort": "make",
    "MarkedSent": "mark,i am just amazed by your skill as a technician, engineer and photographer. i really enjoyed seeing the insides of the m8 but also your commentary on why they did this and that. thank you very much for sharing this with us! btw - -----> i !!!  know a little about how hard this project was as -----> i !!!  recently tried -----> to !!!  adapt my wife's old canon pro 1 for a different use: -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  a dedicated camera with the fast surplus tv projection lenses. well let's just say the parts are still in a box. maybe if i had your skills i might have gotten a litte further. regards, eric hiss thanks eric. the pictures were taken with a nikon d2x, their 60mm f2.8 macro and their new macro flash. i tried the 105mm f2.8 macro lens but it was too long. i need some more practice in some of those shadows though!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 45377,
    "year": "2007",
    "id": 2
  },
  {
    "autor": "twcxz",
    "date": "2020-08-27 16:32:00",
    "content": " Hi everyone, I'm currently working on a project to once and for all fix the analogue Leica CL's broken take up spool problem, by 3D printing them. I've ran a roll through mine with version 2 of the spool and it works pretty good, but i'm working on version 3 which should be better still - I got the dimensions slightly wrong on this one - it's too short. How many of you CL owners would be interested in buying such an item? They'd cost around £20 and be sold through eBay all said and done, and I'd make a video showing how to take apart the CL and install them, as well as reassembly - International shipping would happen too through the eBay GSP as I'm UK based. The attached photo is version 2 and not by any means the final version as this is still in very early development, but the quality of the ones that go on sale will be much higher. This one was printed by a friend of mine, but I'm soon going to acquire my own printer and make them much better. I know also that this doesn't look anything like the original, but when I copied the original part dimension for dimension, curve by curve, it didn't work and suffered the same problems as the original.. immediately. Thus I simplified it and made it more \"3D Printer friendly.\" Thanks Tom --img-- ",
    "link": "https://www.l-camera-forum.com/topic/312749-fixing-the-achilles-heel-of-the-leica-cl-leitz-minolta-cl-with-a-brand-new-take-up-spool/?tab=comments#comment-4034502",
    "origin": "L-forum",
    "suborigin": "312749-fixing-the-achilles-heel-of-the-leica-cl-leitz-minolta-cl-with-a-brand-new-take-up-spool",
    "selector": "3d printing",
    "selectorShort": "print",
    "MarkedSent": " hi everyone, i'm currently working on a project to once and for all fix the analogue leica cl's broken take up spool problem, by -----> 3d !!!  -----> printing !!!  them. i've ran a roll through mine with version 2 of the spool and it works pretty good, but i'm working on version 3 which should be better still - i got the dimensions slightly wrong on this one - it's too short. how many of you cl owners would be interested in buying such an item? they'd cost around £20 and be sold through ebay all said and done, and i'd make a video showing how to take apart the cl and install them, as well as reassembly - international shipping would happen too through the ebay gsp as i'm uk based. the attached photo is version 2 and not by any means the final version as this is still in very early development, but the quality of the ones that go on sale will be much higher. this one was printed by a friend of mine, but i'm soon going to acquire my own printer and make them much better. i know also that this doesn't look anything like the original, but when i copied the original part dimension for dimension, curve by curve, it didn't work and suffered the same problems as the original.. immediately. thus i simplified it and made it more \"3d printer friendly.\" thanks tom --img-- ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 3497,
    "year": "2020",
    "id": 3
  },
  {
    "autor": "syam",
    "date": "2020-06-10 14:33:00",
    "content": " Just wanted to update this after several months. I'm still using version 2 of the 3D printed case. It has been through everything including hikes, road trips, daily shooting, family stuff. Definitely less than pre-quarantine, but still used quite a bit. I've made some refinements and plan to print a new case in the coming weeks. Minor changes for this V3 are: - Reducing the round size of the corners - Reducing wall thickness from 3mm to 2mm - Adding a hole for the focus LED - Adding more room around the on/off switch - Removing the Leica script branding on the top cover plate - Adding more space around the rear buttons and increasing the cutout size - Adding in interior cutouts for felt material to sit against the Q body - Removing the leash strap ring on the bottom of the case I'll be printing the new case using PET-G instead of PLA, so durability should be better than before (not that I ever dropped it). The eventual plan is still to have the case machined out of aluminum and anodized black to match the OE Leica Q finish, but that will wait until the design has been completely finalized. --img--  --img--  Edited June 10, 2020 by syam",
    "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/page/2/?tab=comments#comment-3990994",
    "origin": "L-forum",
    "suborigin": "299948-my-first-leica-q-designing-a-case",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": " just wanted to update this after several months. i'm still using version 2 of the -----> 3d !!!  -----> printed !!!  case. it has been through everything including hikes, road trips, daily shooting, family stuff. definitely less than pre-quarantine, but still used quite a bit. i've made some refinements and plan to print a new case in the coming weeks. minor changes for this v3 are: - reducing the round size of the corners - reducing wall thickness from 3mm to 2mm - adding a hole for the focus led - adding more room around the on/off switch - removing the leica script branding on the top cover plate - adding more space around the rear buttons and increasing the cutout size - adding in interior cutouts for felt material to sit against the q body - removing the leash strap ring on the bottom of the case i'll be printing the new case using pet-g instead of pla, so durability should be better than before (not that i ever dropped it). the eventual plan is still to have the case machined out of aluminum and anodized black to match the oe leica q finish, but that will wait until the design has been completely finalized. --img--  --img--  edited june 10, 2020 by syam",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 6585,
    "year": "2020",
    "id": 4
  },
  {
    "autor": "koray",
    "date": "2009-04-30 08:44:00",
    "content": "I wonder if Leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. Could the Digilux 2 be a genuine \"Cinderella story\" in the Leica family? And oh, I'm still making this modification/upgrade available for a limited time only. ESPRESSO! Now that's what I call an all-in-one. :-) K. PS: Here is my 'LC1 distinctive look', B/W via Lightroom+NIK Silverefex: --img--  Edited April 30, 2009 by koray Added a photo.",
    "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-885548",
    "origin": "L-forum",
    "suborigin": "20016-do-digilux-2-photos-have-distinctive-look",
    "selector": "i'm still making",
    "selectorShort": "make",
    "MarkedSent": "i wonder if leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. could the digilux 2 be a genuine \"cinderella story\" in the leica family? and oh, -----> i !!! 'm -----> still !!!  -----> making !!!  this modification/upgrade available for a limited time only. espresso! now that's what i call an all-in-one. :-) k. ps: here is my 'lc1 distinctive look', b/w via lightroom+nik silverefex: --img--  edited april 30, 2009 by koray added a photo.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 15543,
    "year": "2009",
    "id": 5
  },
  {
    "autor": "andrewsolomon",
    "date": "2009-04-29 03:06:00",
    "content": "I also have a 5D which I like a great deal and use for serious fine art shooting. I also have a D7 which is a fun camera to have for carrying in my pocket. The D2; however, remains my favorite! For its focal length, it is fine for much shooting-like the M Series. I learned on the M3 and went forward from that. The outstanding benefits of the D2 are: 1. The Digital Viewfinder! What a gift! When I was shooting in Death Valley, I could not see the taken image on my 5d because of the ambient light. I now use a Hoodman to take care of the problem; but the the D2; it was no problem. It was wonderful! I made a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. It is also ideal fopr those of us who are visuall challenged and have to wear glasses. Adjust the diopter and you are ready to go and shoot with ease! 2. The grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in Photoshop] easy to do properely. 3. Bounce Flash. What an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. The fine-focus option to use when using manual focus. I use this a lot of the time when I want to be certain the focus is spot on...and it works every time. I have made tack-sharp 20x24 prints with no compromise. The only drawback is the shutter lag. When I was shooting professional tennis and tried the D2, only by knowing the game well and anticipating the next move was I able to get a shot with the \"motor\" drive. I tried for some time to send my successful sports images from the Houston Astros baseball and the Mens National Clay Court Tennis Championships to Roger Horn of Leica USA to show him that despite the comment made to me by a Leica representative that \"Leica is not for sports\" that with care the D2 could do very credible work-work wich I subsequently had published, I might add but there was little positive response. This was a shame because the D2 can do a great deal of things very well. So yes, I think the D2 is a wonderful camera to have even with its few limitations and I would recommend it to anyone who wants a good, general camera. BTW It can use the Canon Speedlight in its hot shoe for a greater range of flash coverage as well! Andy Solomon Houston, Tx --img-- --img--  Edited April 29, 2009 by andrewsolomon Add an image",
    "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884480",
    "origin": "L-forum",
    "suborigin": "20016-do-digilux-2-photos-have-distinctive-look",
    "selector": "i made",
    "selectorShort": "make",
    "MarkedSent": "i also have a 5d which i like a great deal and use for serious fine art shooting. i also have a d7 which is a fun camera to have for carrying in my pocket. the d2; however, remains my favorite! for its focal length, it is fine for much shooting-like the m series. i learned on the m3 and went forward from that. the outstanding benefits of the d2 are: 1. the digital viewfinder! what a gift! when i was shooting in death valley, i could not see the taken image on my 5d because of the ambient light. i now use a hoodman to take care of the problem; but the the d2; it was no problem. it was wonderful! -----> i !!!  -----> made !!!  a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. it is also ideal fopr those of us who are visuall challenged and have to wear glasses. adjust the diopter and you are ready to go and shoot with ease! 2. the grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in photoshop] easy to do properely. 3. bounce flash. what an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. the fine-focus option to use when using manual focus. i use this a lot of the time when i want to be certain the focus is spot on...and it works every time. i have made tack-sharp 20x24 prints with no compromise. the only drawback is the shutter lag. when i was shooting professional tennis and tried the d2, only by knowing the game well and anticipating the next move was i able to get a shot with the \"motor\" drive. i tried for some time to send my successful sports images from the houston astros baseball and the mens national clay court tennis championships to roger horn of leica usa to show him that despite the comment made to me by a leica representative that \"leica is not for sports\" that with care the d2 could do very credible work-work wich i subsequently had published, i might add but there was little positive response. this was a shame because the d2 can do a great deal of things very well. so yes, i think the d2 is a wonderful camera to have even with its few limitations and i would recommend it to anyone who wants a good, general camera. btw it can use the canon speedlight in its hot shoe for a greater range of flash coverage as well! andy solomon houston, tx --img-- --img--  edited april 29, 2009 by andrewsolomon add an image",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 15537,
    "year": "2009",
    "id": 6
  },
  {
    "autor": "pietchen",
    "date": "2020-09-07 23:06:00",
    "content": "I can also make a bag for your camera according to your wishes, a bag as a HOME for your camera https://www.peterkrieger.de/fototaschen/ https://www.instagram.com/pkleder/ Edited September 7, 2020 by pietchen",
    "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/5/?tab=comments#comment-4041894",
    "origin": "L-forum",
    "suborigin": "307354-camera-bag-again-and-again",
    "selector": "i can also make",
    "selectorShort": "make",
    "MarkedSent": "-----> i !!!  -----> can !!!  -----> also !!!  -----> make !!!  a bag for your camera according to your wishes, a bag as a home for your camera https://www.peterkrieger.de/fototaschen/ https://www.instagram.com/pkleder/ edited september 7, 2020 by pietchen",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 3036,
    "year": "2020",
    "id": 7
  },
  {
    "autor": "pietchen",
    "date": "2020-09-07 23:06:00",
    "content": "I can also make a bag for your camera according to your wishes, a bag as a HOME for your camera https://www.peterkrieger.de/fototaschen/ https://www.instagram.com/pkleder/ Edited September 7, 2020 by pietchen",
    "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/5/?tab=comments#comment-4041894",
    "origin": "L-forum",
    "suborigin": "307354-camera-bag-again-and-again",
    "selector": "i can also make",
    "selectorShort": "make",
    "MarkedSent": "-----> i !!!  -----> can !!!  -----> also !!!  -----> make !!!  a bag for your camera according to your wishes, a bag as a home for your camera https://www.peterkrieger.de/fototaschen/ https://www.instagram.com/pkleder/ edited september 7, 2020 by pietchen",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 3036,
    "year": "2020",
    "id": 8
  },
  {
    "autor": "chris_tribble",
    "date": "2010-10-20 18:49:00",
    "content": "That is a good recommendation, but if you don't have the coin for this, Domke is putting out an absolutely fantastic bag for a rangefinder setup. It is the F-803. Couldn't agree more. I made up an adapted inner pocket to take lenses - bodies slip down on either side - plenty enough protection. If you're happy to stack lenses (which I am) you can get 2 M bodies with lenses attached + 4 other lenses in the bag + WATE finder / hoods + caps + WhiBal card in front pockets + cards and batteries in the flap pocket. TOTALLY practical during a shoot. The Leica 21 and the Zeiss 18 have to fight for their place. The Zeiss is winning at the moment... I use this bag all the time for local shoots. When I'm travelling I cut down on the kit but keep the same bag. Win, win. Evidence below.--img-- --img-- --img-- ",
    "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/9/?tab=comments#comment-1478007",
    "origin": "L-forum",
    "suborigin": "104812-the-perfect-travel-kit",
    "selector": "i made",
    "selectorShort": "make",
    "MarkedSent": "that is a good recommendation, but if you don't have the coin for this, domke is putting out an absolutely fantastic bag for a rangefinder setup. it is the f-803. couldn't agree more. -----> i !!!  -----> made !!!  up an adapted inner pocket to take lenses - bodies slip down on either side - plenty enough protection. if you're happy to stack lenses (which i am) you can get 2 m bodies with lenses attached + 4 other lenses in the bag + wate finder / hoods + caps + whibal card in front pockets + cards and batteries in the flap pocket. totally practical during a shoot. the leica 21 and the zeiss 18 have to fight for their place. the zeiss is winning at the moment... i use this bag all the time for local shoots. when i'm travelling i cut down on the kit but keep the same bag. win, win. evidence below.--img-- --img-- --img-- ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 87047,
    "year": "2010",
    "id": 9
  },
  {
    "autor": "bla",
    "date": "2013-11-14 22:19:00",
    "content": " Hello fellow M8 users, I am very happy to announce that I finished the tool mentioned in the thread M8 goes uncompressed DNG! It creates 16bit (acually 14bit in a 16bit container) DNG files from the M8 RAW files with slightly more pixels and much more discrete values compared to the 8bit standard DNG. I even set up a website with download, comment function, contact form and whatnot... even though I am really not familiar with web programming so please be lenient if it is not as polished as this site here for example. --img--  The command-line tool is available for Windows, Mac OS X and Linux, so I am now looking forward to getting some input after you tested it on your own files. You can find more information on m8raw2dng.de. I am trying to make the program as good as possible (because I am using it myself on a daily basis). To achieve this I thought it clever to share it with the community even though I had to create a completely new software from scratch in C++ even though I already have a running version in Matlab with more functionality. But I think that'll change as I focus now on the C++ version. I invite you to share this information with other M8 users on other forums, flickr groups, wherever you like. Have fun and good results, --img--  Arvid",
    "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=comments#comment-2465824",
    "origin": "L-forum",
    "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng",
    "selector": "i am trying to make",
    "selectorShort": "make",
    "MarkedSent": " hello fellow m8 users, i am very happy to announce that i finished the tool mentioned in the thread m8 goes uncompressed dng! it creates 16bit (acually 14bit in a 16bit container) dng files from the m8 raw files with slightly more pixels and much more discrete values compared to the 8bit standard dng. i even set up a website with download, comment function, contact form and whatnot... even though i am really not familiar with web programming so please be lenient if it is not as polished as this site here for example. --img--  the command-line tool is available for windows, mac os x and linux, so i am now looking forward to getting some input after you tested it on your own files. you can find more information on m8raw2dng.de. -----> i !!!  -----> am !!!  -----> trying !!!  -----> to !!!  -----> make !!!  the program as good as possible (because -----> i !!!  -----> am !!!  using it myself on a daily basis). to achieve this i thought it clever to share it with the community even though i had to create a completely new software from scratch in c++ even though i already have a running version in matlab with more functionality. but i think that'll change as i focus now on the c++ version. i invite you to share this information with other m8 users on other forums, flickr groups, wherever you like. have fun and good results, --img--  arvid",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 41510,
    "year": "2013",
    "id": 10
  },
  {
    "autor": "masjah",
    "date": "2020-07-15 20:20:00",
    "content": "1 minute ago, AZN said: FWIW, the R lenses on the 24 MPix Leica SL (Typ 601) work brilliantly, especially with the Leica R->L lens mount adapter. For larger resolutions they work equally well on the Sony AR7III/ IV (I have the latter). From my perspective, cannot see the the point in spending vast amounts of money on a new SL2 or Canon R6 etc. when there are so many v.good options already available much more cheaply on the 2nd hand market. I have a particular need in that I've developed a benign tremor in my dotage so I need IBIS to use my R lenses off tripod, otherwise I could have managed with my M240 +EVF.",
    "link": "https://www.l-camera-forum.com/topic/311297-canon-r6/?tab=comments#comment-4009334",
    "origin": "L-forum",
    "suborigin": "311297-canon-r6",
    "selector": "i've developed",
    "selectorShort": "develop",
    "MarkedSent": "1 minute ago, azn said: fwiw, the r lenses on the 24 mpix leica sl (typ 601) work brilliantly, especially with the leica r->l lens mount adapter. for larger resolutions they work equally well on the sony ar7iii/ iv (i have the latter). from my perspective, cannot see the the point in spending vast amounts of money on a new sl2 or canon r6 etc. when there are so many v.good options already available much more cheaply on the 2nd hand market. -----> i !!!  have a particular need in that -----> i !!! 've -----> developed !!!  a benign tremor in my dotage so i need ibis to use my r lenses off tripod, otherwise i could have managed with my m240 +evf.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 20619,
    "year": "2020",
    "id": 11
  },
  {
    "autor": "Cedric Agie de Selsaeten",
    "date": "2013-07-08 18:22:00",
    "content": "First things first. Be carefull when using older flashtypes (portable or studio) that work with higher ignition voltages when connecting them to moderrn digital cameras such as the Leica M-9. Using wireless connections such as a flash slave, IR or Radiowaves is an elegant precaution to avoid miseries. A limit of 5 to 6 six volts has been agreed upon by most manufacturers. Where tensions could go up to as much 90 volt DC. For some digital cameras a tension of 25 VDC is an absolute limit that could otherwise kill your camera. I have a good experience with the (more modern) Elinchrom D-lite sets 200 & 500 etc. They come with an internal flash slave and compatible RF receiver (4 coded channels) etc. Plus a separate (tiny) El -Skyport Eco Transmitter that comes with a small battery reloader. And a separate El- Skyport Elinchrom compatible RF receiver (4 identical coded channels). Both transmitter and receiver also work beautifully with most studio, prof portable and smaller flash units such as those of the Metz family. Other brands should also work the same way. I even made some special connectors to use this system with my Hasselblad 500 ELM and R-8 and R-9 cameras equipped with a winder. Works beautifully.",
    "link": "https://www.l-camera-forum.com/topic/204510-leica-m9-with-wireless-flash/?tab=comments#comment-2369271",
    "origin": "L-forum",
    "suborigin": "204510-leica-m9-with-wireless-flash",
    "selector": "i even made",
    "selectorShort": "make",
    "MarkedSent": "first things first. be carefull when using older flashtypes (portable or studio) that work with higher ignition voltages when connecting them to moderrn digital cameras such as the leica m-9. using wireless connections such as a flash slave, ir or radiowaves is an elegant precaution to avoid miseries. a limit of 5 to 6 six volts has been agreed upon by most manufacturers. where tensions could go up to as much 90 volt dc. for some digital cameras a tension of 25 vdc is an absolute limit that could otherwise kill your camera. i have a good experience with the (more modern) elinchrom d-lite sets 200 & 500 etc. they come with an internal flash slave and compatible rf receiver (4 coded channels) etc. plus a separate (tiny) el -skyport eco transmitter that comes with a small battery reloader. and a separate el- skyport elinchrom compatible rf receiver (4 identical coded channels). both transmitter and receiver also work beautifully with most studio, prof portable and smaller flash units such as those of the metz family. other brands should also work the same way. -----> i !!!  -----> even !!!  -----> made !!!  some special connectors to use this system with my hasselblad 500 elm and r-8 and r-9 cameras equipped with a winder. works beautifully.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 89466,
    "year": "2013",
    "id": 12
  },
  {
    "autor": "250swb",
    "date": "2018-07-22 07:37:00",
    "content": "I want one! It's a fantastic idea, make the kids think about what they want before they press the shutter, not see what they can conjure up in Lightroom days later. If I go out to photograph I change the settings in my head and know in advance if I'm shooting colour or B&W with my digital camera, I was taught the concept of 'visualisation' in my first lesson and it has never left me. But making a choice also involves having a reason, and if photographers can once again ask a similar question to 'what film are you shooting' then creativity can be talked about as well. The tactile nature of the camera won't go unnoticed either, and the act of advancing the image count with the advance lever is once again an acknowledgment for the photographer that each shot is important and in it's own moment.",
    "link": "https://www.l-camera-forum.com/topic/286799-should-we-laugh-or-cry/?tab=comments#comment-3559598",
    "origin": "L-forum",
    "suborigin": "286799-should-we-laugh-or-cry",
    "selector": "[idea, make]",
    "selectorShort": "idea",
    "MarkedSent": "I want one! It's a fantastic idea, make the kids think about what they want before they press the shutter, not see what they can conjure up in Lightroom days later. If I go out to photograph I change the settings in my head and know in advance if I'm shooting colour or B&W with my digital camera, I was taught the concept of 'visualisation' in my first lesson and it has never left me. But making a choice also involves having a reason, and if photographers can once again ask a similar question to 'what film are you shooting' then creativity can be talked about as well. The tactile nature of the camera won't go unnoticed either, and the act of advancing the image count with the advance lever is once again an acknowledgment for the photographer that each shot is important and in it's own moment.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 104056,
    "year": "2018",
    "id": 13
  },
  {
    "autor": "plaidshirts",
    "date": "2018-04-30 16:17:00",
    "content": "A couple of friends of mine with professional backgrounds had built up the Leica legend in my mind while I was working as a designer and book layer-outerer at Lonely Planet. As my interest in photography grew and I became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. When I finally started thinking seriously about replacing my aging crop-frame Canon 350D, in 2009 there was a screaming hype online about the idea of a full frame digital Leica. I didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame M was even physically possible (this was before the advent of micro-lenses). When the M9 was released was star-struck and determined to get one, but it was way out of reach, financially. Months later, I became friends with a new guy at work who seemed to share every interest of mine, including photography. When the conversation finally came around to Leica and I talked about how I was desperate to try one he said, \"Oh, I have an M6. I'll lend it to you for a few months.\" Three months with the M6TTL and 50 Lux sealed the love affair, although with inconsistent results. I talked about it constantly at home, to my wife's chagrin — \"We can't afford a camera that costs thousands of dollars!\" \"I don't need to afford it!\" I said, \"I just need to find a way of getting one!\" I'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the Leica. The guy at work had put down a deposit on an M9 and told me that he would be willing to sell me the M6 cheaply on condition that I lend it back to him if he missed shooting film. One day while chewing the ear off another friend about Leica, he told me he thought the brand had become pretentious — \"It's just a very simple camera with luxury marketing. And the simpler it gets the more pretentious the claims are. They should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" That's it! I designed a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from Leica's own website to map onto the box. With a small amount of money borrowed from a friend, I funded a print run of Leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a Sunny 16 exposure guide included. I designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"Like-a\" red dot logo, and the most pretentious product copy I could come up with, connected to an ecommerce order form. At $20 each for a sheet of cardboard they were hand-crafted and approaching Veblen margins. With some creative Tweeting and some help from a few friends I managed to get picked up by the WIRED blog and a few others, and the orders started coming in. Much like the real Leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were Leicaphiles, or to add to a collection of other Leica paraphernalia. Eventually, I received a stern letter from Leica AG, scalding me for appropriating their logo and ordering a cease and desist. I complied of course, and told their Legal department that it was only a desire to buy one of their products that lead to all this. I tallied up the takings and was close enough to make an offer on the M6 and 35 Cron. I shot that camera and lens at the exclusion of all else for two or three years and found it punishing. The first three months produced the worst pictures I've ever taken. Out of focus, under exposed, just generally crap. But as each month went by I learned the camera intuitively and the pictures got better. When the Typ 240 was released, the same friend upgraded again, and I traded him back the M6 and some cash in exchange for the M9. I loved the M9, but it eventually succumbed to the sensor corrosion issue and when Leica offered an M or M-P upgrade I jumped to the M-P. The M10 is tempting, but I'll hold off for at least another generation (unless maybe there's an M10-P or Safari that's just too good to pass up). Here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/ What a great story! That's real love and dedication right there.",
    "link": "https://www.l-camera-forum.com/topic/242491-your-first-leica-tell-your-story/page/6/?tab=comments#comment-3509828",
    "origin": "L-forum",
    "suborigin": "242491-your-first-leica-tell-your-story",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "a couple of friends of mine with professional backgrounds had built up the leica legend in my mind while i was working as a designer and book layer-outerer at lonely planet. as my interest in photography grew and i became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. when i finally started thinking seriously about replacing my aging crop-frame canon 350d, in 2009 there was a screaming hype online about the idea of a full frame digital leica. i didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame m was even physically possible (this was before the advent of micro-lenses). when the m9 was released was star-struck and determined to get one, but it was way out of reach, financially. months later, i became friends with a new guy at work who seemed to share every interest of mine, including photography. when the conversation finally came around to leica and i talked about how i was desperate to try one he said, \"oh, i have an m6. i'll lend it to you for a few months.\" three months with the m6ttl and 50 lux sealed the love affair, although with inconsistent results. i talked about it constantly at home, to my wife's chagrin — \"we can't afford a camera that costs thousands of dollars!\" \"i don't need to afford it!\" i said, \"i just need to find a way of getting one!\" i'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the leica. the guy at work had put down a deposit on an m9 and told me that he would be willing to sell me the m6 cheaply on condition that i lend it back to him if he missed shooting film. one day while chewing the ear off another friend about leica, he told me he thought the brand had become pretentious — \"it's just a very simple camera with luxury marketing. and the simpler it gets the more pretentious the claims are. they should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" that's it! -----> i !!!  -----> designed !!!  a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from leica's own website to map onto the box. with a small amount of money borrowed from a friend, i funded a print run of leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a sunny 16 exposure guide included. i designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"like-a\" red dot logo, and the most pretentious product copy i could come up with, connected to an ecommerce order form. at $20 each for a sheet of cardboard they were hand-crafted and approaching veblen margins. with some creative tweeting and some help from a few friends i managed to get picked up by the wired blog and a few others, and the orders started coming in. much like the real leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were leicaphiles, or to add to a collection of other leica paraphernalia. eventually, i received a stern letter from leica ag, scalding me for appropriating their logo and ordering a cease and desist. i complied of course, and told their legal department that it was only a desire to buy one of their products that lead to all this. i tallied up the takings and was close enough to make an offer on the m6 and 35 cron. i shot that camera and lens at the exclusion of all else for two or three years and found it punishing. the first three months produced the worst pictures i've ever taken. out of focus, under exposed, just generally crap. but as each month went by i learned the camera intuitively and the pictures got better. when the typ 240 was released, the same friend upgraded again, and i traded him back the m6 and some cash in exchange for the m9. i loved the m9, but it eventually succumbed to the sensor corrosion issue and when leica offered an m or m-p upgrade i jumped to the m-p. the m10 is tempting, but i'll hold off for at least another generation (unless maybe there's an m10-p or safari that's just too good to pass up). here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/ what a great story! that's real love and dedication right there.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 82180,
    "year": "2018",
    "id": 14
  },
  {
    "autor": "Guest JonathanP",
    "date": "2014-07-24 13:11:00",
    "content": "I've now developed a Lightroom plugin (Mac only) that I have made freely available: Lightroom Plugin for M240 Shadows processing Hope some of you might find it of use --img--  Jonathan",
    "link": "https://www.l-camera-forum.com/topic/229863-correcting-the-green-shadows/page/3/?tab=comments#comment-2636533",
    "origin": "L-forum",
    "suborigin": "229863-correcting-the-green-shadows",
    "selector": "i've now developed",
    "selectorShort": "develop",
    "MarkedSent": "-----> i !!! 've -----> now !!!  -----> developed !!!  a lightroom plugin (mac only) that -----> i !!!  have made freely available: lightroom plugin for m240 shadows processing hope some of you might find it of use --img--  jonathan",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 108703,
    "year": "2014",
    "id": 15
  },
  {
    "autor": "BAASCH",
    "date": "2016-10-14 16:46:00",
    "content": "It would help if you could say what you want Leica to change. My list is linked to under every post I make on this forum.",
    "link": "https://www.l-camera-forum.com/topic/265408-x-vario-discontinued-and-dropped-from-line/?tab=comments#comment-3128725",
    "origin": "L-forum",
    "suborigin": "265408-x-vario-discontinued-and-dropped-from-line",
    "selector": "i make",
    "selectorShort": "make",
    "MarkedSent": "it would help if you could say what you want leica to change. my list is linked to under every post -----> i !!!  -----> make !!!  on this forum.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 11802,
    "year": "2016",
    "id": 16
  },
  {
    "autor": "chema",
    "date": "2017-12-30 17:54:00",
    "content": " I want to share my design to carry extra battery and memory cards for M8 and M9. It is a mere strip of leather 52 x 150 mm approximately, to which a foam with the hollow corresponding to the protrusion of the battery and a plastic box of an SD card are glued (the double-sided tape is OK). The closure is mede with velcro. I think the photos explain it better Best regards and Happy 2018. chema --img--  --img--  --img-- ",
    "link": "https://www.l-camera-forum.com/topic/280378-holder-for-m8m9-battery-and-card/?tab=comments#comment-3428842",
    "origin": "L-forum",
    "suborigin": "280378-holder-for-m8m9-battery-and-card",
    "selector": "my design",
    "selectorShort": "design",
    "MarkedSent": " i want to share -----> my !!!  -----> design !!!  to carry extra battery and memory cards for m8 and m9. it is a mere strip of leather 52 x 150 mm approximately, to which a foam with the hollow corresponding to the protrusion of the battery and a plastic box of an sd card are glued (the double-sided tape is ok). the closure is mede with velcro. i think the photos explain it better best regards and happy 2018. chema --img--  --img--  --img-- ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 38896,
    "year": "2017",
    "id": 17
  },
  {
    "autor": "jaapv",
    "date": "2021-05-30 17:19:00",
    "content": "4 hours ago, Dopaco said: Having an M10, I would go for the iPhone 12 Prom, it makes spectacular photos and videos and weighs less than the CL and TL2. You can also take photos in RAW format that will be saved in 12-bit DNG format. Both the CL and the TL2 are two good cameras and both are a mystery as to whether Leica will come up with releasing substitutes on APS-C. New generation mobiles have eaten compact cameras and are about to do so with the APS-C format. I highly doubt that Leica would rule out replacing TL2 for several reasons: * Has a new and unique design (looks like Apple stuff). * The interface is new generation similar to that of the iPhone 12 pro. * I have read that Leica has many aluminum bases in stock ready to fill inside. For all the above, I think that if there was a TL3 or CL2, it would be based on launching them as FF (if they are able to do it in such small bodies). A modification to the TL2 would be to fill in the hollow aluminum bases that they have in Stock. I have TL2 and a few days ago I changed my iPhone 6 for iPhone 12 Pro, which, I am in the testing and learning phase and for the short time that I have been I have to say that it is wonderful and takes photos and videos with great quality. If I had the M10 and it worked fine, I'd go for the iPhone 12 Pro right now and then see what Leica has released. Portrait photo in low light taken with iPhone 12 pro (xataka). Observe how the background blurs. --img--  Yes. I do observe. A bit synthetic if you ask me, especially the transition above the shoulders.",
    "link": "https://www.l-camera-forum.com/topic/321327-cl-or-tl2-which-do-you-recommend/?tab=comments#comment-4210656",
    "origin": "L-forum",
    "suborigin": "321327-cl-or-tl2-which-do-you-recommend",
    "selector": "come up with",
    "selectorShort": "with",
    "MarkedSent": "4 hours ago, dopaco said: having an m10, i would go for the iphone 12 prom, it makes spectacular photos and videos and weighs less than the cl and tl2. you can also take photos in raw format that will be saved in 12-bit dng format. both the cl and the tl2 are two good cameras and both are a mystery as to whether leica will -----> come !!!  -----> up !!!  -----> with !!!  releasing substitutes on aps-c. new generation mobiles have eaten compact cameras and are about to do so -----> with !!!  the aps-c format. i highly doubt that leica would rule out replacing tl2 for several reasons: * has a new and unique design (looks like apple stuff). * the interface is new generation similar to that of the iphone 12 pro. * i have read that leica has many aluminum bases in stock ready to fill inside. for all the above, i think that if there was a tl3 or cl2, it would be based on launching them as ff (if they are able to do it in such small bodies). a modification to the tl2 would be to fill in the hollow aluminum bases that they have in stock. i have tl2 and a few days ago i changed my iphone 6 for iphone 12 pro, which, i am in the testing and learning phase and for the short time that i have been i have to say that it is wonderful and takes photos and videos with great quality. if i had the m10 and it worked fine, i'd go for the iphone 12 pro right now and then see what leica has released. portrait photo in low light taken with iphone 12 pro (xataka). observe how the background blurs. --img--  yes. i do observe. a bit synthetic if you ask me, especially the transition above the shoulders.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 41400,
    "year": "2021",
    "id": 18
  },
  {
    "autor": "Einst_Stein",
    "date": "2019-03-23 01:03:00",
    "content": "On 3/3/2019 at 5:17 PM, sshire said: I do like double caps. Better than finding a good place to put a lens down while replacing it with another. But, I was never really happy gluing two caps together. I’ve had nightmare images of the caps coming unglued and bouncing a Cron off the street. As usual, with way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) I came up with this. This is the first prototype and the 2d version should be better. Here’s a little video showing some of the production. Enjoy --img--  I find glue them and wrap with tap is very secure for holding them. The potential problem might be the plastic caps that can get loose after a while. The danger is dropping the lens. So i always hold the lens upwards while switching, and hold them by the lens, not the caps. It takes some practice.",
    "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/page/2/?tab=comments#comment-3707494",
    "origin": "L-forum",
    "suborigin": "293896-using-double-rear-cap-to-speed-up-changing-lens",
    "selector": "came up with",
    "selectorShort": "with",
    "MarkedSent": "on 3/3/2019 at 5:17 pm, sshire said: i do like double caps. better than finding a good place to put a lens down while replacing it with another. but, i was never really happy gluing two caps together. i’ve had nightmare images of the caps coming unglued and bouncing a cron off the street. as usual, -----> with !!!  way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) i -----> came !!!  -----> up !!!  -----> with !!!  this. this is the first prototype and the 2d version should be better. here’s a little video showing some of the production. enjoy --img--  i find glue them and wrap with tap is very secure for holding them. the potential problem might be the plastic caps that can get loose after a while. the danger is dropping the lens. so i always hold the lens upwards while switching, and hold them by the lens, not the caps. it takes some practice.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 20801,
    "year": "2019",
    "id": 19
  },
  {
    "autor": "syam",
    "date": "2019-08-22 15:37:00",
    "content": "15 hours ago, jaapv said: I'm afraid that I cannot say that the esthetics of the camera are improved this way... I don't necessarily disagree with you, but i don't particularly like how a half-case looks either. I would rather protect the camera with a cohesive design than not. Also the plan for the 3d print is only to evaluate the ergonomics and design, since it's inexpensive as I have access to several 3D printers. After the design is complete, I can have it CNC'd from aluminum or brass and coated black. 14 hours ago, m9photo said: Compare your design with Tekiac, I own one and really like it. I've looked at the design of the Tekiac and think it's a good design, but I wanted something that would protect all sides and faces of the Q (as much as possible). Plan is to make this design the best it can be and offer the files for manufacture if anyone wants it. 14 hours ago, Donzo98 said: Need to leave the hot shoe open to allow use of the Thumbs Up or flash. I can easily add a magnetic cover to block off the hot shoe that is easily removable. With this design there's no reason to use a thumbs-up as the case has a thumb securing grip already built in. Placement is also much better than the thumbs-up as it works with the thumb cutout on the camera (I have it also) and more like the Q2 thumbs-up placement. I also don't have a flash for the Q (yet) so have no need for the hot shoe - would rather have it covered up completely to avoid any dust or water entering from there. All great feedback. Thanks! I'll continue to improve the design over the next few weeks and 3D print a new updated case and continue to refine until I feel it is perfect.",
    "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3803715",
    "origin": "L-forum",
    "suborigin": "299948-my-first-leica-q-designing-a-case",
    "selector": "3d print",
    "selectorShort": "print",
    "MarkedSent": "15 hours ago, jaapv said: i'm afraid that i cannot say that the esthetics of the camera are improved this way... i don't necessarily disagree with you, but i don't particularly like how a half-case looks either. i would rather protect the camera with a cohesive design than not. also the plan for the -----> 3d !!!  -----> print !!!  is only to evaluate the ergonomics and design, since it's inexpensive as i have access to several -----> 3d !!!  printers. after the design is complete, i can have it cnc'd from aluminum or brass and coated black. 14 hours ago, m9photo said: compare your design with tekiac, i own one and really like it. i've looked at the design of the tekiac and think it's a good design, but i wanted something that would protect all sides and faces of the q (as much as possible). plan is to make this design the best it can be and offer the files for manufacture if anyone wants it. 14 hours ago, donzo98 said: need to leave the hot shoe open to allow use of the thumbs up or flash. i can easily add a magnetic cover to block off the hot shoe that is easily removable. with this design there's no reason to use a thumbs-up as the case has a thumb securing grip already built in. placement is also much better than the thumbs-up as it works with the thumb cutout on the camera (i have it also) and more like the q2 thumbs-up placement. i also don't have a flash for the q (yet) so have no need for the hot shoe - would rather have it covered up completely to avoid any dust or water entering from there. all great feedback. thanks! i'll continue to improve the design over the next few weeks and 3d print a new updated case and continue to refine until i feel it is perfect.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 6579,
    "year": "2019",
    "id": 20
  },
  {
    "autor": "JeremyG",
    "date": "2019-08-22 20:09:00",
    "content": "19 hours ago, m9photo said: Compare your design with Tekiac, I own one and really like it. I too have a 3D-printed Tekiac case and much prefer it to the Leica leather half case.",
    "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3803920",
    "origin": "L-forum",
    "suborigin": "299948-my-first-leica-q-designing-a-case",
    "selector": "3d-printed",
    "selectorShort": "print",
    "MarkedSent": "19 hours ago, m9photo said: compare your design with tekiac, i own one and really like it. i too have a -----> 3d !!! -printed tekiac case and much prefer it to the leica leather half case.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 6580,
    "year": "2019",
    "id": 21
  },
  {
    "autor": "jkcampbell2",
    "date": "2021-11-26 21:32:00",
    "content": "Pelican's TreckPac dividers make a great way to layout your case plus it's easy to change the design as equipment changes. The system is a bit expensive but a DIY version is pretty easy to make. https://www.arielestulin.com/diy-trekpak-for-under-20/ Cheers! jc",
    "link": "https://www.l-camera-forum.com/topic/326960-pelican-1150-and-leica-m10-p/?tab=comments#comment-4320952",
    "origin": "L-forum",
    "suborigin": "326960-pelican-1150-and-leica-m10-p",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "pelican's treckpac dividers make a great way to layout your case plus it's easy to change the design as equipment changes. the system is a bit expensive but a -----> diy !!!  version is pretty easy to make. https://www.arielestulin.com/diy-trekpak-for-under-20/ cheers! jc",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 82,
    "year": "2021",
    "id": 22
  },
  {
    "autor": "Bikie John",
    "date": "2021-09-04 09:21:00",
    "content": "I do it pretty manually. Generally I will end up with a folder for an \"event\", whether that is a walk in the country, a concert or a fortnight's holiday. I generally use Lightroom for basic processing. Then depending on all sorts of things, I might: 1. Create the folder manually, copy photos from camera(s) into the folder, and import the folder into Lightroom . Or.... 2. Create the folder and import the files directly from the camera card into it in LR. Or... 3. Create the folder in LR and import the files directly from the card into it all in one go. John",
    "link": "https://www.l-camera-forum.com/topic/324204-tips-for-m10-r-file-organization/?tab=comments#comment-4269109",
    "origin": "L-forum",
    "suborigin": "324204-tips-for-m10-r-file-organization",
    "selector": "create",
    "selectorShort": "create",
    "MarkedSent": "i do it pretty manually. generally i will end up with a folder for an \"event\", whether that is a walk in the country, a concert or a fortnight's holiday. i generally use lightroom for basic processing. then depending on all sorts of things, i might: 1. create the folder manually, copy photos from camera(s) into the folder, and import the folder into lightroom . or.... 2. -----> create !!!  the folder and import the files directly from the camera card into it in lr. or... 3. create the folder in lr and import the files directly from the card into it all in one go. john",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 5949,
    "year": "2021",
    "id": 23
  },
  {
    "autor": "01maciel",
    "date": "2021-09-25 18:14:00",
    "content": " I created a very simple but useful application for photo viewing. Very fast and easy to use. It opens and displays a photo and when clicked on one of the EXIF information in the table on the right hand side the text will be copied into the clipboard, i.e. the Lens Model would be a good use case for it. Then type CTLF-v and here you go: the lens model will be pasted into the thread or somewhere else. --img--  The app is free software (GPL licensed) primarily aimed at the Linux platform. If you run Windows 10 and there is a Linux subsystem installed it may work (not tested). If anyone is interested in this application feel free to volunteer as a friendly test user. The source code needs to be compiled with Gambas and uses the libraw library to extract the EXIF information. I would appreciate your feedback.",
    "link": "https://www.l-camera-forum.com/topic/324868-app-for-easy-photo-viewing/?tab=comments#comment-4281523",
    "origin": "L-forum",
    "suborigin": "324868-app-for-easy-photo-viewing",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": " -----> i !!!  -----> created !!!  a very simple but useful application for photo viewing. very fast and easy to use. it opens and displays a photo and when clicked on one of the exif information in the table on the right hand side the text will be copied into the clipboard, i.e. the lens model would be a good use case for it. then type ctlf-v and here you go: the lens model will be pasted into the thread or somewhere else. --img--  the app is free software (gpl licensed) primarily aimed at the linux platform. if you run windows 10 and there is a linux subsystem installed it may work (not tested). if anyone is interested in this application feel free to volunteer as a friendly test user. the source code needs to be compiled with gambas and uses the libraw library to extract the exif information. i would appreciate your feedback.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 90138,
    "year": "2021",
    "id": 24
  },
  {
    "autor": "ntoporcov",
    "date": "2019-01-18 06:21:37",
    "content": "I created a web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.",
    "link": "https://www.reddit.com/r/Nikon/comments/ah7lvu/i_created_a_web_app_for_photographers_who_use/",
    "origin": "Reddit",
    "suborigin": "nikon",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 1248,
    "year": "2019",
    "id": 25
  },
  {
    "autor": "aRealUn1queUsername",
    "date": "2018-11-07 18:31:57",
    "content": "I will create a WordPress portfolio for your photography FREE. /!/  I will set you up a WordPress website for free because having your very own place to show off your photography is important. It's one of the most vital steps you could make to show others that you mean business. If you don't know where to start, just PM me and I'll help you through the process. It'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. I'll get the whole website set up and presentable! ",
    "link": "https://www.reddit.com/r/Cameras/comments/9v1z03/i_will_create_a_wordpress_portfolio_for_your/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "i will create",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> will !!!  -----> create !!!  a wordpress portfolio for your photography free. /!/  i will set you up a wordpress website for free because having your very own place to show off your photography is important. it's one of the most vital steps you could make to show others that you mean business. if you don't know where to start, just pm me and i'll help you through the process. it'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. i'll get the whole website set up and presentable! ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 73036,
    "year": "2018",
    "id": 26
  },
  {
    "autor": "vttdn",
    "date": "2021-10-15 09:40:44",
    "content": "Datafilm: the Note app designed for Leica-M film photographers /!/ Hello,\n\nMy name is Vincent, I am an amateur film photographer as well as a product designer (interfaces, ui, ux). Today I am excited to share [Datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. It is a Non-Profit and Free project I have been working on during the past few months and it is now available for everyone on the AppStore.\n\nI initially created Datafilm to be able to refer to my settings later on when receiving scans from my lab, so I could improve my practice. \n\nNot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. Similar solutions were already available on the market, however none of them was really fulfilling my need. Sometimes what I was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nSo yes, here comes Datafilm. It has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. I hope you will find it useful and enjoy it.\n\nAs a side note, I believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\nA quick preview of the quick note taking feature can be [watched here on Dribbble](https://dribbble.com/shots/16556831-Quick-Settings).\n\n[Download Datafilm on the AppStore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nThank you for reading me, have a good day!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "link": "https://www.reddit.com/r/Leica/comments/q8kxy6/datafilm_the_note_app_designed_for_leicam_film/",
    "origin": "Reddit",
    "suborigin": "leica",
    "selector": "i initially created",
    "selectorShort": "create",
    "MarkedSent": "datafilm: the note app designed for leica-m film photographers /!/ hello,\n\nmy name is vincent, i am an amateur film photographer as well as a product designer (interfaces, ui, ux). today i am excited to share [datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. it is a non-profit and free project i have been working on during the past few months and it is now available for everyone on the appstore.\n\n-----> i !!!  -----> initially !!!  -----> created !!!  datafilm to be able to refer to my settings later on when receiving scans from my lab, so -----> i !!!  could improve my practice. \n\nnot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. similar solutions were already available on the market, however none of them was really fulfilling my need. sometimes what i was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nso yes, here comes datafilm. it has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. i hope you will find it useful and enjoy it.\n\nas a side note, i believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\na quick preview of the quick note taking feature can be [watched here on dribbble](https://dribbble.com/shots/16556831-quick-settings).\n\n[download datafilm on the appstore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nthank you for reading me, have a good day!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 75983,
    "year": "2021",
    "id": 27
  },
  {
    "autor": "HeatCheckStefan",
    "date": "2019-10-11 00:52:18",
    "content": "a6400 users: Can you help me out with a very specific question? /!/ I recently created an overhead rig for my rx100 V. I planned on just leaving it up with all the settings dialed in, and when I need it- just turn on and start recording. A 1 touch operation.\nThing is: Memory recall saves everything EXCEPT focus for some reason. So every time I turn it on, the manual focus is reset, so I spend time to punch in, set the focus, punch out and THEN start.\nAs a more feature packed camera I am hoping that the a6400 does not have this issue. \nAs this is quite a niche thing I couldn't find the answer on google, so I turn to you guys for help:\n**Can the a6400 save the manual focus setting in memory recall?**",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/dg7hhs/a6400_users_can_you_help_me_out_with_a_very/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "i recently created",
    "selectorShort": "create",
    "MarkedSent": "a6400 users: can you help me out with a very specific question? /!/ -----> i !!!  -----> recently !!!  -----> created !!!  an overhead rig for my rx100 v. -----> i !!!  planned on just leaving it up with all the settings dialed in, and when -----> i !!!  need it- just turn on and start recording. a 1 touch operation.\nthing is: memory recall saves everything except focus for some reason. so every time i turn it on, the manual focus is reset, so i spend time to punch in, set the focus, punch out and then start.\nas a more feature packed camera i am hoping that the a6400 does not have this issue. \nas this is quite a niche thing i couldn't find the answer on google, so i turn to you guys for help:\n**can the a6400 save the manual focus setting in memory recall?**",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 21692,
    "year": "2019",
    "id": 28
  },
  {
    "autor": "nsandin88",
    "date": "2019-07-07 14:19:39",
    "content": "I designed &amp; 3D printed this adapter to use this 70 year old Kodak Retina IIIc lens on my Nikon Z7 (test shots in comments)",
    "link": "https://www.reddit.com/r/Cameras/comments/ca7b2p/i_designed_3d_printed_this_adapter_to_use_this_70/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  &amp; 3d printed this adapter to use this 70 year old kodak retina iiic lens on my nikon z7 (test shots in comments)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 80814,
    "year": "2019",
    "id": 29
  },
  {
    "autor": "fisheveadventures",
    "date": "2019-03-10 23:28:03",
    "content": "DIY - Create Awesome Flash Diffuser for Macro Photography",
    "link": "https://www.reddit.com/r/Cameras/comments/azlzlw/diy_create_awesome_flash_diffuser_for_macro/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "-----> diy !!!  - create awesome flash diffuser for macro photography",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 76785,
    "year": "2019",
    "id": 30
  },
  {
    "autor": "SeeTheBridges",
    "date": "2020-06-24 19:35:17",
    "content": "Gotta keep my camera budget in check somehow: DIY Variable ND Filter",
    "link": "https://www.reddit.com/r/Cameras/comments/hf7qpd/gotta_keep_my_camera_budget_in_check_somehow_diy/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "gotta keep my camera budget in check somehow: -----> diy !!!  variable nd filter",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 4326,
    "year": "2020",
    "id": 31
  },
  {
    "autor": "BuildThingsFromStuff",
    "date": "2020-07-12 22:28:52",
    "content": "DIY Camera Stabilizer - How To Make",
    "link": "https://www.reddit.com/r/Cameras/comments/hq3gxq/diy_camera_stabilizer_how_to_make/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "-----> diy !!!  camera stabilizer - how to make",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 7710,
    "year": "2020",
    "id": 32
  },
  {
    "autor": "plentaldan58",
    "date": "2020-10-28 08:33:12",
    "content": "Shop rifle camera mount · SCOPE-MOUNT · DIY NIGHT VISION ACCESSORIES · MODERATOR 1/2 UNF ADAPTOR ·",
    "link": "https://www.reddit.com/r/Cameras/comments/jjk1rx/shop_rifle_camera_mount_scopemount_diy_night/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "shop rifle camera mount · scope-mount · -----> diy !!!  night vision accessories · moderator 1/2 unf adaptor ·",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 6970,
    "year": "2020",
    "id": 33
  },
  {
    "autor": "potatetoe_tractor",
    "date": "2019-09-28 17:11:05",
    "content": "A small update on the 3D printed camera",
    "link": "https://www.reddit.com/r/Cameras/comments/dairt4/a_small_update_on_the_3d_printed_camera/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "a small update on the -----> 3d !!!  -----> printed !!!  camera",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 81426,
    "year": "2019",
    "id": 34
  },
  {
    "autor": "twvancamp",
    "date": "2020-01-29 15:58:24",
    "content": "3D printed tab for the Oly 35RC's impossibly small aperture ring",
    "link": "https://www.reddit.com/r/Cameras/comments/evoq87/3d_printed_tab_for_the_oly_35rcs_impossibly_small/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  tab for the oly 35rc's impossibly small aperture ring",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 2495,
    "year": "2020",
    "id": 35
  },
  {
    "autor": "doitwheneverYT",
    "date": "2020-12-06 17:30:26",
    "content": "Open source 6 axis motion camera - 3D PRINTED",
    "link": "https://www.reddit.com/r/Cameras/comments/k7xxl2/open_source_6_axis_motion_camera_3d_printed/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "open source 6 axis motion camera - -----> 3d !!!  -----> printed !!! ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 7323,
    "year": "2020",
    "id": 36
  },
  {
    "autor": "Five10Fiftyfold",
    "date": "2020-11-02 22:53:56",
    "content": "I just came up with a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. Thoughts? /!/ Looking at the market there seem to be two approaches, the MASP selection and fuji's dedicated dials each featuring an A option. Both having some advantages as some disadvantages.\n\nThere also 3 distinct setting scenarios.  \nThe full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.  \nFull manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.  \nHaving most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. This also means that camera would preferably have to control only one parameter at a time.\n\nThe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. So it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nWith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. The answer is simple.  \nInstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. While obviously still retaining the option of full manual and auto.\n\nFuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. You have to rotate the first one from A all the way to the preferred value and then rotate the other all the way to A, which is a slow two step process. As is with the regular mode selection where you had to go from Av with set iso, to Manual with auto iso.\n\nOne real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. In the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. Then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem.\n\nI would like to know your thoughts on that.",
    "link": "https://www.reddit.com/r/Cameras/comments/jmyb3o/i_just_came_up_with_a_better_and_more_logical/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "came up with",
    "selectorShort": "with",
    "MarkedSent": "i just -----> came !!!  -----> up !!!  -----> with !!!  a better and more logical alternative to the classic mode selection, (that its not the fuji way) and its really simple. thoughts? /!/ looking at the market there seem to be two approaches, the masp selection and fuji's dedicated dials each featuring an a option. both having some advantages as some disadvantages.\n\nthere also 3 distinct setting scenarios.  \nthe full automatic, point and shoot experience, ideal for amateur users or more lighthearted momments such as a family party.  \nfull manual, optimal for studio work, flash use, long exposure and cases where speed and losing the moment arent such important factors as absolute control over the settings.  \nhaving most possible control over the settings while still relying on some automation to achive the fast and snappy workflow that manual doesnt offer. this also means that camera would preferably have to control only one parameter at a time.\n\nthe priority modes come from the film era where iso was a fixed value so there where only two changable parameters. so it makes sense to set the value to the most important one to the given scenario leaving the camera to decide the other.\n\nwith digital cameras of today the parameters are 3 ,with fairly usable high isos as well as slow speeds thanks to ibis. the answer is simple.  \ninstead of choosing the most importnt parameter to control (which almost always is the aperture), you should have to choose the less important parameter to be the one set to auto. while obviously still retaining the option of full manual and auto.\n\nfuji's interface offers a similar logic, but since professionals rarely have two parameters set to auto, to change the automated parameter from one to another, say from only auto speed to only auto iso. you have to rotate the first one from a all the way to the preferred value and then rotate the other all the way to a, which is a slow two step process. as is with the regular mode selection where you had to go from av with set iso, to manual with auto iso.\n\none real world example of such case that comes to mind, would be, say you are shooting at night on the streets with both still subjects such as scenaries or moving as pedestrians or cars. in the case of moving subjects, your setting would be something like, widest f stop, and slowest possible speed that would still be able to freeze the action (according to your focal length) and auto iso. then switching to shoot still subjects you would change to an optimal iso given that even if speed runs slow with ibis would be much of a problem.\n\ni would like to know your thoughts on that.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 3634,
    "year": "2020",
    "id": 37
  },
  {
    "autor": "MasterCode3",
    "date": "2019-11-28 03:38:40",
    "content": "Free Tool to Get Feedback on Your Portfolio Website /!/  Hey guys, I created a free feedback tool for you to get feedback on your portfolio website: [https://app.loopinput.com/register](https://app.loopinput.com/register)\n\nEnjoy!",
    "link": "https://www.reddit.com/r/photography/comments/e2s52z/free_tool_to_get_feedback_on_your_portfolio/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "free tool to get feedback on your portfolio website /!/  hey guys, -----> i !!!  -----> created !!!  a free feedback tool for you to get feedback on your portfolio website: [https://app.loopinput.com/register](https://app.loopinput.com/register)\n\nenjoy!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 7974,
    "year": "2019",
    "id": 38
  },
  {
    "autor": "apolinariosteps",
    "date": "2019-01-02 21:58:09",
    "content": "I created a bot that selects a random photo from Wikipedia and colorizes it via machine learning /!/ For all photo colorization enthusiasts, I created a bot that simply look for a random black &amp; white photo on Wikipedia, colorizes it automatically with a deep learning algorithm and posts it to this Twitter account: [https://twitter.com/wikicolorize](https://twitter.com/wikicolorize)\n\n*Processing img 9fnky99qz2821...*\n\nI think it is a nice way to observe state of the art automatic colorization with real examples extracted from a Wikipedia's vast royalty-free photo library ",
    "link": "https://www.reddit.com/r/photography/comments/aby9b3/i_created_a_bot_that_selects_a_random_photo_from/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a bot that selects a random photo from wikipedia and colorizes it via machine learning /!/ for all photo colorization enthusiasts, i created a bot that simply look for a random black &amp; white photo on wikipedia, colorizes it automatically with a deep learning algorithm and posts it to this twitter account: [https://twitter.com/wikicolorize](https://twitter.com/wikicolorize)\n\n*processing img 9fnky99qz2821...*\n\ni think it is a nice way to observe state of the art automatic colorization with real examples extracted from a wikipedia's vast royalty-free photo library ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 82279,
    "year": "2019",
    "id": 39
  },
  {
    "autor": "TigrouMeow",
    "date": "2019-01-10 03:55:51",
    "content": "How to create/manage one's own private spots map for photography and travels? /!/ Hello everyone!\n\n&amp;#x200B;\n\nI am coming with this question because I am really interested in the answers, but also because I came with my own. I have been using Google Maps (and Google My Maps) for years, but it has too many shortcomings. I do travel a lot in Japan, there are thousands of spots I have visited and thousands more I didn't, but plan to. Those spots are very different in style, and my visits totally depend on the season. The number of spots I have is so overwhelming that I can't possibly take a few days to plan all my next trips for the year; I need a map system that gives me what I am (might) be looking for at any time.\n\n&amp;#x200B;\n\nTo help myself, I created a Map Editor system based on WordPress a few years ago, and photography friends also got interested and started using it. I was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently I decided to work on something much better and more modern that could appeal to more users. That's how Ikuzo was born. It's here: [https://ikuzo.app](https://ikuzo.app). It's totally free for now, but I will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200B;\n\nI am not coming here to find clients; I prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. Of course, I would really love to have your feedback, and how this could be even more useful to you as photographers. I would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200B;\n\nDo not hesitate to contact me here, and also, I think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200B;\n\nThanks for reading :)",
    "link": "https://www.reddit.com/r/photography/comments/aef6s9/how_to_createmanage_ones_own_private_spots_map/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "how to create/manage one's own private spots map for photography and travels? /!/ hello everyone!\n\n&amp;#x200b;\n\ni am coming with this question because i am really interested in the answers, but also because i came with my own. i have been using google maps (and google my maps) for years, but it has too many shortcomings. i do travel a lot in japan, there are thousands of spots i have visited and thousands more i didn't, but plan to. those spots are very different in style, and my visits totally depend on the season. the number of spots i have is so overwhelming that i can't possibly take a few days to plan all my next trips for the year; i need a map system that gives me what i am (might) be looking for at any time.\n\n&amp;#x200b;\n\nto help myself, -----> i !!!  -----> created !!!  a map editor system based on wordpress a few years ago, and photography friends also got interested and started using it. i was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently i decided to work on something much better and more modern that could appeal to more users. that's how ikuzo was born. it's here: [https://ikuzo.app](https://ikuzo.app). it's totally free for now, but i will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200b;\n\ni am not coming here to find clients; i prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. of course, i would really love to have your feedback, and how this could be even more useful to you as photographers. i would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200b;\n\ndo not hesitate to contact me here, and also, i think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200b;\n\nthanks for reading :)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 82720,
    "year": "2019",
    "id": 40
  },
  {
    "autor": "ntoporcov",
    "date": "2019-01-18 06:24:28",
    "content": "I created a free web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.",
    "link": "https://www.reddit.com/r/photography/comments/ah7mmj/i_created_a_free_web_app_for_photographers_who/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a free web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 65730,
    "year": "2019",
    "id": 41
  },
  {
    "autor": "supercamb",
    "date": "2019-02-10 05:54:31",
    "content": "Created with a 3D printer, no ink was used",
    "link": "https://www.reddit.com/r/photography/comments/ap1abt/created_with_a_3d_printer_no_ink_was_used/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "created",
    "selectorShort": "create",
    "MarkedSent": "-----> created !!!  with a 3d printer, no ink was used",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 80782,
    "year": "2019",
    "id": 42
  },
  {
    "autor": "makoualamaboko",
    "date": "2018-09-12 10:19:58",
    "content": "Hello everyone! Remember me from the \"Dumpster Fire\" post of 83,000 photos to sort? I'm done!!! It took 9 days. I'm putting the link to the original thread and I'll just stick my edit here. /!/ ## [Original post: Help! I have a fucking dumpster fire shitshow mess of 20 years of pictures totally 83,000 and 247 GB with thousands of duplicates.](https://www.reddit.com/r/photography/comments/9cc7i4/help_i_have_a_fucking_dumpster_fire_shitshow_mess/)\n\nLink\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**I'm DONE EVERYONE!!!**\n\n====================\n\nSECOND AND FINAL EDIT: 2018-09-14\n\nSo. It took about nine days. I worked on this when I had the time, but I'm finally done.\n\nHere is the commented imgur gallery of the work. It's shocking don't judge. I basically spent 2000-2006 traveling and 2 computers died, 3 hard drives crapped out, I kept backing stuff up, I got a desktop and downloaded everything, then saved it all on the same drive, exported my iPhoto library on two drives then combined the two drives.\n\nSo. There were 122,000 + photos with about 38,000 duplicates, which I only found out after I purchased Duplicate Detective for $4,99 on the App Store, because I'm on a Mac.\n\nDuplicate Detective worked for HOURS. And the little guy never crashed once. My mom even came into my office and closed my laptop...because it was open?!? and Duplicate Detective wasn't reset.\n\nI took a bit of time to spot-check his work and then deleted the 38,000 files.\n\nThen, manually I created folder structures (I've completely edited the original folder structure I had thought I would use below) and I included the screenshots.\n\nNow, I'm going to import everything into LightRoom.\n\nI just wanted to take this opportunity to thank EVERYONE ON THIS SUBREDDIT AND ON THIS POST for all the immensely helpful advice you have given me. Once I'm totally done with my photos, I will come back and organize all the different software suggestions you gave, but for the time being, I feel a bit burned out. I'm adding this edit because a number of people asked in the comments and PM'd me to keep them updated as they were in a similar situation.\n\nYou've all been great. I'm in Congo and I never could have imagined I would get the worldwide technical support you guys gave me. You really rock and Reddit is a miracle.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Processing img cnwopgqz9sl11...*\n\n*Processing img a637qjqz9sl11...*\n\n*Processing img r660yrpz9sl11...*",
    "link": "https://www.reddit.com/r/photography/comments/9f6gza/hello_everyone_remember_me_from_the_dumpster_fire/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "hello everyone! remember me from the \"dumpster fire\" post of 83,000 photos to sort? i'm done!!! it took 9 days. i'm putting the link to the original thread and i'll just stick my edit here. /!/ ## [original post: help! i have a fucking dumpster fire shitshow mess of 20 years of pictures totally 83,000 and 247 gb with thousands of duplicates.](https://www.reddit.com/r/photography/comments/9cc7i4/help_i_have_a_fucking_dumpster_fire_shitshow_mess/)\n\nlink\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n**i'm done everyone!!!**\n\n====================\n\nsecond and final edit: 2018-09-14\n\nso. it took about nine days. i worked on this when i had the time, but i'm finally done.\n\nhere is the commented imgur gallery of the work. it's shocking don't judge. i basically spent 2000-2006 traveling and 2 computers died, 3 hard drives crapped out, i kept backing stuff up, i got a desktop and downloaded everything, then saved it all on the same drive, exported my iphoto library on two drives then combined the two drives.\n\nso. there were 122,000 + photos with about 38,000 duplicates, which i only found out after i purchased duplicate detective for $4,99 on the app store, because i'm on a mac.\n\nduplicate detective worked for hours. and the little guy never crashed once. my mom even came into my office and closed my laptop...because it was open?!? and duplicate detective wasn't reset.\n\ni took a bit of time to spot-check his work and then deleted the 38,000 files.\n\nthen, manually -----> i !!!  -----> created !!!  folder structures (-----> i !!! 've completely edited the original folder structure -----> i !!!  had thought -----> i !!!  would use below) and -----> i !!!  included the screenshots.\n\nnow, i'm going to import everything into lightroom.\n\ni just wanted to take this opportunity to thank everyone on this subreddit and on this post for all the immensely helpful advice you have given me. once i'm totally done with my photos, i will come back and organize all the different software suggestions you gave, but for the time being, i feel a bit burned out. i'm adding this edit because a number of people asked in the comments and pm'd me to keep them updated as they were in a similar situation.\n\nyou've all been great. i'm in congo and i never could have imagined i would get the worldwide technical support you guys gave me. you really rock and reddit is a miracle.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n*processing img cnwopgqz9sl11...*\n\n*processing img a637qjqz9sl11...*\n\n*processing img r660yrpz9sl11...*",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 36652,
    "year": "2018",
    "id": 43
  },
  {
    "autor": "AHand",
    "date": "2020-10-02 03:06:47",
    "content": "I created an app to make sharing your portfolio simple /!/  Hello! I'm a college student studying computer science. I've been really interested in filmmaking / photography since I was young. Recently I've been getting into app development in my free time.\n\nAlias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nAny feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)",
    "link": "https://www.reddit.com/r/photography/comments/j3mzfr/i_created_an_app_to_make_sharing_your_portfolio/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  an app to make sharing your portfolio simple /!/  hello! i'm a college student studying computer science. i've been really interested in filmmaking / photography since i was young. recently i've been getting into app development in my free time.\n\nalias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nany feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 72227,
    "year": "2020",
    "id": 44
  },
  {
    "autor": "Sheltac",
    "date": "2018-12-17 17:50:07",
    "content": "I created an open-source image processing script to deflicker timelapses. Check it out!",
    "link": "https://www.reddit.com/r/photography/comments/a721lz/i_created_an_opensource_image_processing_script/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  an open-source image processing script to deflicker timelapses. check it out!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 25471,
    "year": "2018",
    "id": 45
  },
  {
    "autor": "merwanedr",
    "date": "2020-06-17 09:29:39",
    "content": "Popbot - Apply color splash effects using AI. /!/ You can use Popbot to automatically apply color splash effects to photos by selecting a subject. I created it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jFOCU](https://gumroad.com/l/jFOCU)",
    "link": "https://www.reddit.com/r/photography/comments/hanxt5/popbot_apply_color_splash_effects_using_ai/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "popbot - apply color splash effects using ai. /!/ you can use popbot to automatically apply color splash effects to photos by selecting a subject. -----> i !!!  -----> created !!!  it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jfocu](https://gumroad.com/l/jfocu)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 80955,
    "year": "2020",
    "id": 46
  },
  {
    "autor": "thenickdude",
    "date": "2019-08-06 11:12:42",
    "content": "I designed and 3D-printed a massive 300mm Canon extension tube for super-macro at 5x magnification, it even has autofocus!",
    "link": "https://www.reddit.com/r/photography/comments/cmp8b1/i_designed_and_3dprinted_a_massive_300mm_canon/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed a massive 300mm canon extension tube for super-macro at 5x magnification, it even has autofocus!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 64834,
    "year": "2019",
    "id": 47
  },
  {
    "autor": "thenickdude",
    "date": "2019-01-24 06:45:16",
    "content": "I designed and 3D-printed my own LED softbox! /!/ I got my first 3D printer recently, but it sits in a shady corner of my room, so I thought I'd design a light for it. Then I realised I could kill two birds with one stone and design it to be useful for photography as well.\n\nHere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/VCciOoA\n\nI've posted the LED softbox model and the build instructions to Thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\nEver since I bought a bunch of YongNuo flashes I've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!",
    "link": "https://www.reddit.com/r/photography/comments/aj9s1c/i_designed_and_3dprinted_my_own_led_softbox/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d-printed my own led softbox! /!/ i got my first 3d printer recently, but it sits in a shady corner of my room, so i thought i'd design a light for it. then i realised i could kill two birds with one stone and design it to be useful for photography as well.\n\nhere's the softbox and an example photo shot using it:\n\nhttps://imgur.com/a/vcciooa\n\ni've posted the led softbox model and the build instructions to thingiverse here!\n\nhttps://www.thingiverse.com/thing:3375497\n\never since i bought a bunch of yongnuo flashes i've been shooting figurines with those exclusively, so it was refreshing to work with natural light once again, and return to opening and closing my room's blinds to change the direction and strength of my fill light!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 83601,
    "year": "2019",
    "id": 48
  },
  {
    "autor": "jbilous",
    "date": "2021-02-04 22:32:35",
    "content": "Over the last few days I created a web app to solve a problem that I often have while out shooting - keeping tracking of all the spots I want to shoot and where they are. I decided to make the app public - so anyone can use it for free. I'd love to hear if it's useful for you, and any feedback.",
    "link": "https://www.reddit.com/r/photography/comments/lcs5g5/over_the_last_few_days_i_created_a_web_app_to/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "over the last few days -----> i !!!  -----> created !!!  a web app to solve a problem that -----> i !!!  often have while out shooting - keeping tracking of all the spots -----> i !!!  want to shoot and where they are. i decided to make the app public - so anyone can use it for free. i'd love to hear if it's useful for you, and any feedback.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 211,
    "year": "2021",
    "id": 49
  },
  {
    "autor": "WiccedSwede",
    "date": "2020-06-01 18:22:27",
    "content": "I designed and 3D printed a beefy camera grip so I won't get hand pains anymore while shooting for extended periods of time. Hope I can help someone with this idea.",
    "link": "https://www.reddit.com/r/photography/comments/gupuvc/i_designed_and_3d_printed_a_beefy_camera_grip_so/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  and 3d printed a beefy camera grip so -----> i !!!  won't get hand pains anymore while shooting for extended periods of time. hope i can help someone with this idea.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 69437,
    "year": "2020",
    "id": 50
  },
  {
    "autor": "MrCameraJunkie",
    "date": "2019-09-21 20:54:23",
    "content": "( Camera Hack ) DIY Flash Mod Speed light hack budget photography",
    "link": "https://www.reddit.com/r/photography/comments/d7g64j/camera_hack_diy_flash_mod_speed_light_hack_budget/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "( camera hack ) -----> diy !!!  flash mod speed light hack budget photography",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 373,
    "year": "2019",
    "id": 51
  },
  {
    "autor": "pylesrm",
    "date": "2018-09-20 14:22:10",
    "content": "Let's design our dream camera! /!/ I just had this same discussion with a couple co-workers, so I thought I'd bring it here and see what you guys have to say.\n\nIf you could design any DSLR you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nSo I'll go first:\n\nMedium format sensor in a DSLR body\nRuns Android\nBuilt-in mini tripod\nBuilt in drone\n\nAnd a lot more",
    "link": "https://www.reddit.com/r/photography/comments/9hfphq/lets_design_our_dream_camera/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "'s design",
    "selectorShort": "design",
    "MarkedSent": "let-----> 's !!!  -----> design !!!  our dream camera! /!/ i just had this same discussion with a couple co-workers, so i thought i'd bring it here and see what you guys have to say.\n\nif you could design any dslr you wanted to come up with any feature, any design, no matter how crazy or ridiculous, what would it be?\n\nso i'll go first:\n\nmedium format sensor in a dslr body\nruns android\nbuilt-in mini tripod\nbuilt in drone\n\nand a lot more",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 36725,
    "year": "2018",
    "id": 52
  },
  {
    "autor": "BadConductor",
    "date": "2018-10-10 02:59:03",
    "content": "I also designed and 3D printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [Album Here](https://imgur.com/a/XIKBIaz)\n\nThis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. Changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\nI plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes I use have a built-in holder), and I currently have a diffuser printing in white filament.\n\nThe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. If anyone wants, I can provide the original Autodesk Inventor files so it can be modified easily.",
    "link": "https://www.reddit.com/r/photography/comments/9mvs85/i_also_designed_and_3d_printed_some_light/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i also designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> also !!!  -----> designed !!!  and 3d printed some light modifiers, but these are for a studio strobe with 7in reflector. /!/ [album here](https://imgur.com/a/xikbiaz)\n\nthis is mainly three parts, the mount which attaches to a 7\" reflector and has holes for 4x 0.125in magnets, a frame which is a solid ring which also has holes for magnets (and on its own, can be used as a gel holder), and a solid disc for the honeycomb portion. changing settings in the printing software allows you to vary the size of the honeycomb which is printed.\n\ni plan on making some changes to these, mainly adding a hole through the honeycomb for an umbrella (the strobes i use have a built-in holder), and i currently have a diffuser printing in white filament.\n\nthe files are up on [thingiverse](https://www.thingiverse.com/thing:3146572) for anyone to grab and print. if anyone wants, i can provide the original autodesk inventor files so it can be modified easily.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 32247,
    "year": "2018",
    "id": 53
  },
  {
    "autor": "lsfoto",
    "date": "2020-07-05 19:37:36",
    "content": "The ultimate DIY Nikon wireless tethering tool. Built with the Raspberry Pi. For more details please check the video description. Hope you will enjoy this little project. If you like the project pls don't forget to like, share and subscribe 😉",
    "link": "https://www.reddit.com/r/photography/comments/hlsp30/the_ultimate_diy_nikon_wireless_tethering_tool/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "the ultimate -----> diy !!!  nikon wireless tethering tool. built with the raspberry pi. for more details please check the video description. hope you will enjoy this little project. if you like the project pls don't forget to like, share and subscribe 😉",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 82242,
    "year": "2020",
    "id": 54
  },
  {
    "autor": "[deleted]",
    "date": "2018-04-10 17:50:24",
    "content": "Handmade Camera! (X-post from r/DIY) /!/ [deleted]",
    "link": "https://www.reddit.com/r/photography/comments/8b9p4a/handmade_camera_xpost_from_rdiy/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "handmade camera! (x-post from r/-----> diy !!! ) /!/ [deleted]",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 18994,
    "year": "2018",
    "id": 55
  },
  {
    "autor": "Jpedrosky",
    "date": "2018-06-14 16:45:06",
    "content": "DIY camera slider (with object tracking) /!/ https://www.instagram.com/p/Bjuv1oegcPG/\nRemotely controlled via [free Control APP](https://play.google.com/store/apps/details?id=jjrobots.cameraslider)\n(assembly guide + links here: [http://www.instructables.com/id/MOTORIZED-CAMERA-SLIDER-With-TRACKING-SYSTEM-3D-Pr/](http://www.instructables.com/id/MOTORIZED-CAMERA-SLIDER-With-TRACKING-SYSTEM-3D-Pr/))",
    "link": "https://www.reddit.com/r/photography/comments/8r3crn/diy_camera_slider_with_object_tracking/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "-----> diy !!!  camera slider (with object tracking) /!/ https://www.instagram.com/p/bjuv1oegcpg/\nremotely controlled via [free control app](https://play.google.com/store/apps/details?id=jjrobots.cameraslider)\n(assembly guide + links here: [http://www.instructables.com/id/motorized-camera-slider-with-tracking-system-3d-pr/](http://www.instructables.com/id/motorized-camera-slider-with-tracking-system-3d-pr/))",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 21557,
    "year": "2018",
    "id": 56
  },
  {
    "autor": "woodybepierced",
    "date": "2018-08-13 13:18:56",
    "content": "Finally built my DIY Overhead Shooting Rig. What are your thoughts?",
    "link": "https://www.reddit.com/r/photography/comments/96y883/finally_built_my_diy_overhead_shooting_rig_what/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "finally built my -----> diy !!!  overhead shooting rig. what are your thoughts?",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 22632,
    "year": "2018",
    "id": 57
  },
  {
    "autor": "Gugaomelhor",
    "date": "2019-04-05 08:33:17",
    "content": "3D printed photography gadgets /!/ Hello fellow redditors!\nDo you know any useful gadgets for photographers you can print with a 3D printer?\n",
    "link": "https://www.reddit.com/r/photography/comments/b9om4r/3d_printed_photography_gadgets/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  photography gadgets /!/ hello fellow redditors!\ndo you know any useful gadgets for photographers you can print with a 3d printer?\n",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 4576,
    "year": "2019",
    "id": 58
  },
  {
    "autor": "LookDifferent",
    "date": "2020-11-12 01:48:28",
    "content": "Making the quick magnetic snap camera filter | 3D Print",
    "link": "https://www.reddit.com/r/photography/comments/jsln17/making_the_quick_magnetic_snap_camera_filter_3d/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d print",
    "selectorShort": "print",
    "MarkedSent": "making the quick magnetic snap camera filter | -----> 3d !!!  -----> print !!! ",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 66007,
    "year": "2020",
    "id": 59
  },
  {
    "autor": "totoagrafie",
    "date": "2020-05-16 07:01:42",
    "content": "3D printed photography gadgets /!/ Since 3D printers are becoming more common and less cheap, are there any 3D printed gadgets/accessories you actively use for your photography?",
    "link": "https://www.reddit.com/r/photography/comments/gkqcvr/3d_printed_photography_gadgets/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  photography gadgets /!/ since 3d printers are becoming more common and less cheap, are there any 3d printed gadgets/accessories you actively use for your photography?",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 79499,
    "year": "2020",
    "id": 62
  },
  {
    "autor": "Whomstevest",
    "date": "2020-10-12 12:50:06",
    "content": "3d printed Canon RF to Canon EF Tilt adapter /!/ &amp;#x200B;\n\nhttps://preview.redd.it/k5z9czhcuns51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=40f765b2bd57aa0e170eff593edd2d365b5f7c42\n\n[STLs here](https://www.thingiverse.com/thing:4621718)\n\n[My previous adapters here](https://www.reddit.com/r/photography/comments/f0r089/3d_printed_tilt_adapters/)\n\n[Post with more pictures](https://www.reddit.com/r/functionalprint/comments/j9q2wq/3d_printed_canon_rf_to_ef_tilt_adapter_info_in/)\n\nThis is a fully 3d printed canon RF to canon EF adapter with infinity focus, 7 degrees of tilt and 180 degrees of rotation. Always hold the lens when using it, just in case.\n\nIt was printed with black abs on an UP! mini, with a layer height of 0.2mm and lots of support. Other material should work fine, but it should be black to avoid a color cast.\n\nThe adapter has no electrical connection, so you won't be able to change focus when using a focus by wire lens (If the focus ring doesn't do anything when the camera is turned off, the lens is focus by wire), or change the aperture when using any EF lens. You can set your desired aperture beforehand however, using [this technique,](https://www.youtube.com/watch?v=y1ZuK_dDweg) which will also work using an RF camera with the canon adapter.\n\nLens hoods that aren't circular may crop the corners when the lens is rotated 90 degrees. Some lenses that are rectangular at the back (such as the 24-105 f4L) may also crop corners when rotated 90 degrees\n\n[DOF visualization/calculator for this adapter](https://www.geogebra.org/classic/xs64kyhm) (works best on desktop). This is a tool i made to visualize how tilt affects the depth of field. It is setup by default to show a top down view of a 50mm lens at f2.8, tilted at 7 degrees, focused at 1 meter and on a full frame sensor. Move the sliders around to see how different lenses, apertures and tilt angles change the depth of field. It will also work for other adapters and tilt shift lenses in general but some values may have to be changed.\n\nThe adapter isn't a professional tool, but something to have fun with, so have fun!\n\nFeel free to ask any questions in the comments",
    "link": "https://www.reddit.com/r/photography/comments/j9qa6m/3d_printed_canon_rf_to_canon_ef_tilt_adapter/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  canon rf to canon ef tilt adapter /!/ &amp;#x200b;\n\nhttps://preview.redd.it/k5z9czhcuns51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=40f765b2bd57aa0e170eff593edd2d365b5f7c42\n\n[stls here](https://www.thingiverse.com/thing:4621718)\n\n[my previous adapters here](https://www.reddit.com/r/photography/comments/f0r089/3d_printed_tilt_adapters/)\n\n[post with more pictures](https://www.reddit.com/r/functionalprint/comments/j9q2wq/3d_printed_canon_rf_to_ef_tilt_adapter_info_in/)\n\nthis is a fully 3d printed canon rf to canon ef adapter with infinity focus, 7 degrees of tilt and 180 degrees of rotation. always hold the lens when using it, just in case.\n\nit was printed with black abs on an up! mini, with a layer height of 0.2mm and lots of support. other material should work fine, but it should be black to avoid a color cast.\n\nthe adapter has no electrical connection, so you won't be able to change focus when using a focus by wire lens (if the focus ring doesn't do anything when the camera is turned off, the lens is focus by wire), or change the aperture when using any ef lens. you can set your desired aperture beforehand however, using [this technique,](https://www.youtube.com/watch?v=y1zuk_ddweg) which will also work using an rf camera with the canon adapter.\n\nlens hoods that aren't circular may crop the corners when the lens is rotated 90 degrees. some lenses that are rectangular at the back (such as the 24-105 f4l) may also crop corners when rotated 90 degrees\n\n[dof visualization/calculator for this adapter](https://www.geogebra.org/classic/xs64kyhm) (works best on desktop). this is a tool i made to visualize how tilt affects the depth of field. it is setup by default to show a top down view of a 50mm lens at f2.8, tilted at 7 degrees, focused at 1 meter and on a full frame sensor. move the sliders around to see how different lenses, apertures and tilt angles change the depth of field. it will also work for other adapters and tilt shift lenses in general but some values may have to be changed.\n\nthe adapter isn't a professional tool, but something to have fun with, so have fun!\n\nfeel free to ask any questions in the comments",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 84049,
    "year": "2020",
    "id": 63
  },
  {
    "autor": "ntoporcov",
    "date": "2019-01-18 06:21:37",
    "content": "I created a web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.",
    "link": "https://www.reddit.com/r/Nikon/comments/ah7lvu/i_created_a_web_app_for_photographers_who_use/",
    "origin": "Reddit",
    "suborigin": "nikon",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 1248,
    "year": "2019",
    "id": 64
  },
  {
    "autor": "stupid__rhymes",
    "date": "2019-10-12 22:44:01",
    "content": "My 3D printed, 150/2.8 super macro lens",
    "link": "https://www.reddit.com/r/Nikon/comments/dh258u/my_3d_printed_15028_super_macro_lens/",
    "origin": "Reddit",
    "suborigin": "nikon",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "my -----> 3d !!!  -----> printed !!! , 150/2.8 super macro lens",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 8714,
    "year": "2019",
    "id": 65
  },
  {
    "autor": "cpu5555",
    "date": "2018-09-25 03:59:58",
    "content": "Using computational imaging similar to Light L16, is it possible to make a non helicoid optical zoom for it? What about analog gamma compression for the sensors and other ideas? /!/ For background, I want to invent a new digital camera system. This will combine different ideas and concepts. I know some of them have issues that must be addressed. It will not be suitable for all situations and that is okay.\n\n&amp;#x200B;\n\nI found out about the Light L16. It uses several small lenses and sensors to get the equivalent of one large sensor. The problem is that it uses fixed focal length lenses. There are groups of lenses with the same focal length and different options. The camera crops instead of having continuous focal length adjustment. I am curious if making adjustable focal length lenses without the helicoid principle will help. For background, there is a rare Minolta 40-80 f/2.8 lens that is without the helicoid principle. It uses a rotating wheel on the side. It is optically superior to comparable modern zooms and lower weight. If adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? Will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. Is close focusing possible? What is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200B;\n\nI want to implement analog gamma compression. I read studies about prototype chip based sensors with this technology. I want to improve ISO invariance, lower the effects of downstream noise, and improve underexposure tolerance. One prototype demonstrated a range of about 18.5 stops with a 12 bit ADC and a gamma compression factor of about 2.9. My system will have a 12 bit ADC with a gamma compression factor of 3. This fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200B;\n\nI want to use an electronic shutter as expected. I want to enable a flash sync speed of 1/8000 of a second. How fast would the readout need to be for that to be possible without artifacts? What components could be added to LED light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200B;\n\nIs a continuous variable ND filter possible?\n\n&amp;#x200B;\n\nWhat is a good open source real time OS that can be used? The Light L16 uses a general purpose OS. I want one that will allow any modifications to fix bugs. What are ways to prevent bugs? Will inspecting the code repeatedly before testing help? Users are more forgiving of missing features than programing errors.\n\n&amp;#x200B;\n\nI want the end image to be a native square. I want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. Would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200B;\n\nI want to design the RAW format to have the image combination and demosaicing done before saving to card. With lossy RAW video, it can use interframe interpolation or be intra only. I will make an optional dedicated external unit for RAW processing. In the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. Because ICC profiles and LUTs are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200B;\n\nWhat thoughts and ideas do you have? What are good subreddits for this? What is your advice? Thanks in advance.",
    "link": "https://www.reddit.com/r/photography/comments/9ioxf6/using_computational_imaging_similar_to_light_l16/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i want to invent",
    "selectorShort": "invent",
    "MarkedSent": "using computational imaging similar to light l16, is it possible to make a non helicoid optical zoom for it? what about analog gamma compression for the sensors and other ideas? /!/ for background, -----> i !!!  -----> want !!!  -----> to !!!  -----> invent !!!  a new digital camera system. this will combine different ideas and concepts. i know some of them have issues that must be addressed. it will not be suitable for all situations and that is okay.\n\n&amp;#x200b;\n\ni found out about the light l16. it uses several small lenses and sensors to get the equivalent of one large sensor. the problem is that it uses fixed focal length lenses. there are groups of lenses with the same focal length and different options. the camera crops instead of having continuous focal length adjustment. i am curious if making adjustable focal length lenses without the helicoid principle will help. for background, there is a rare minolta 40-80 f/2.8 lens that is without the helicoid principle. it uses a rotating wheel on the side. it is optically superior to comparable modern zooms and lower weight. if adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. is close focusing possible? what is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200b;\n\ni want to implement analog gamma compression. i read studies about prototype chip based sensors with this technology. i want to improve iso invariance, lower the effects of downstream noise, and improve underexposure tolerance. one prototype demonstrated a range of about 18.5 stops with a 12 bit adc and a gamma compression factor of about 2.9. my system will have a 12 bit adc with a gamma compression factor of 3. this fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200b;\n\ni want to use an electronic shutter as expected. i want to enable a flash sync speed of 1/8000 of a second. how fast would the readout need to be for that to be possible without artifacts? what components could be added to led light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200b;\n\nis a continuous variable nd filter possible?\n\n&amp;#x200b;\n\nwhat is a good open source real time os that can be used? the light l16 uses a general purpose os. i want one that will allow any modifications to fix bugs. what are ways to prevent bugs? will inspecting the code repeatedly before testing help? users are more forgiving of missing features than programing errors.\n\n&amp;#x200b;\n\ni want the end image to be a native square. i want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200b;\n\ni want to design the raw format to have the image combination and demosaicing done before saving to card. with lossy raw video, it can use interframe interpolation or be intra only. i will make an optional dedicated external unit for raw processing. in the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. because icc profiles and luts are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200b;\n\nwhat thoughts and ideas do you have? what are good subreddits for this? what is your advice? thanks in advance.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 31927,
    "year": "2018",
    "id": 66
  },
  {
    "autor": "grip916",
    "date": "2020-12-11 15:17:40",
    "content": "Barnack Film Trimming - ABLON /!/ Hi All\n\nI've not long had my Barnack Leicas - and after seeing the horrific prices that genuine ABLON film trimming tools go for, I thought I would share these with you as an idea.   (sorry if this is off topic or has already been suggested)\n\nI've had these 2 units 3D printed (3 parts in total) using  open source .STL files I found online - total cost of what you see here is £2.79 - plus shipping etc..\n\nI used an old guitar string as the metal pin in the hinge.\n\nThey work really well - the hinged one is easier to use IMHO. If you are a collector then OK,  I understand the originality of the Leica unit but for day to day use I'm sticking with these !\n\nhttps://preview.redd.it/vr9xy3u4rk461.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=81f0b1e3191065d6546a99bb0aef7ddae01c25a8\n\nhttps://preview.redd.it/2ts7pfu4rk461.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=4b1f509668570fbfac4992809927b3b131e7ce85",
    "link": "https://www.reddit.com/r/Leica/comments/kb4nqa/barnack_film_trimming_ablon/",
    "origin": "Reddit",
    "suborigin": "leica",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "barnack film trimming - ablon /!/ hi all\n\ni've not long had my barnack leicas - and after seeing the horrific prices that genuine ablon film trimming tools go for, i thought i would share these with you as an idea.   (sorry if this is off topic or has already been suggested)\n\ni've had these 2 units -----> 3d !!!  -----> printed !!!  (3 parts in total) using  open source .stl files i found online - total cost of what you see here is £2.79 - plus shipping etc..\n\ni used an old guitar string as the metal pin in the hinge.\n\nthey work really well - the hinged one is easier to use imho. if you are a collector then ok,  i understand the originality of the leica unit but for day to day use i'm sticking with these !\n\nhttps://preview.redd.it/vr9xy3u4rk461.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=81f0b1e3191065d6546a99bb0aef7ddae01c25a8\n\nhttps://preview.redd.it/2ts7pfu4rk461.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=4b1f509668570fbfac4992809927b3b131e7ce85",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 13000,
    "year": "2020",
    "id": 67
  },
  {
    "autor": "jrose125",
    "date": "2019-12-10 18:53:30",
    "content": "3D Printed SOOMP lens hood for 50mm Summar",
    "link": "https://www.reddit.com/r/Leica/comments/e8uurj/3d_printed_soomp_lens_hood_for_50mm_summar/",
    "origin": "Reddit",
    "suborigin": "leica",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  soomp lens hood for 50mm summar",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 14297,
    "year": "2019",
    "id": 68
  },
  {
    "autor": "gameboyjunky",
    "date": "2020-08-17 04:05:46",
    "content": "I designed a splitzer for the Fujifilm SQ6. Very easy to use and comes in 8 different colors.",
    "link": "https://www.reddit.com/r/fujifilm/comments/ib74ib/i_designed_a_splitzer_for_the_fujifilm_sq6_very/",
    "origin": "Reddit",
    "suborigin": "fujifilm",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  a splitzer for the fujifilm sq6. very easy to use and comes in 8 different colors.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 63079,
    "year": "2020",
    "id": 69
  },
  {
    "autor": "Ekeler",
    "date": "2018-06-02 23:02:13",
    "content": "I 3D Printed a Canon EF Mount for Game Boy Camera (pics and write-up included) /!/ https://imgur.com/a/NZwTbZZ\n\nI designed and built a Canon EF Mount for my Game Boy Camera. For no other reason than to add a little bit of retro-nostalgic feeling to my photography.\n\nThe GBC has a sensor size of about 3.6mm² which seems equivalent to a 1/4\" sensor. This gives the GBC a crop factor of about 10.81. With my 70-200 f4 mounted on a 1.4x extender, this gives me a max equivalent focal distance of about 200x1.4x10.81=3,026.8mm.\n\nIf anyone is interested, I could clean up the 3D model and make it available for others to download a print, might be fun to see what people can come up with!\n\nSee some shots I took and my full write-up at:\n\nhttp://ekeler.com/game-boy-camera-canon-ef-mount/",
    "link": "https://www.reddit.com/r/photography/comments/8o4cd7/i_3d_printed_a_canon_ef_mount_for_game_boy_camera/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "i -----> 3d !!!  -----> printed !!!  a canon ef mount for game boy camera (pics and write-up included) /!/ https://imgur.com/a/nzwtbzz\n\ni designed and built a canon ef mount for my game boy camera. for no other reason than to add a little bit of retro-nostalgic feeling to my photography.\n\nthe gbc has a sensor size of about 3.6mm² which seems equivalent to a 1/4\" sensor. this gives the gbc a crop factor of about 10.81. with my 70-200 f4 mounted on a 1.4x extender, this gives me a max equivalent focal distance of about 200x1.4x10.81=3,026.8mm.\n\nif anyone is interested, i could clean up the 3d model and make it available for others to download a print, might be fun to see what people can come up with!\n\nsee some shots i took and my full write-up at:\n\nhttp://ekeler.com/game-boy-camera-canon-ef-mount/",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 15500,
    "year": "2018",
    "id": 70
  },
  {
    "autor": "cpu5555",
    "date": "2018-09-25 03:59:58",
    "content": "Using computational imaging similar to Light L16, is it possible to make a non helicoid optical zoom for it? What about analog gamma compression for the sensors and other ideas? /!/ For background, I want to invent a new digital camera system. This will combine different ideas and concepts. I know some of them have issues that must be addressed. It will not be suitable for all situations and that is okay.\n\n&amp;#x200B;\n\nI found out about the Light L16. It uses several small lenses and sensors to get the equivalent of one large sensor. The problem is that it uses fixed focal length lenses. There are groups of lenses with the same focal length and different options. The camera crops instead of having continuous focal length adjustment. I am curious if making adjustable focal length lenses without the helicoid principle will help. For background, there is a rare Minolta 40-80 f/2.8 lens that is without the helicoid principle. It uses a rotating wheel on the side. It is optically superior to comparable modern zooms and lower weight. If adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? Will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. Is close focusing possible? What is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200B;\n\nI want to implement analog gamma compression. I read studies about prototype chip based sensors with this technology. I want to improve ISO invariance, lower the effects of downstream noise, and improve underexposure tolerance. One prototype demonstrated a range of about 18.5 stops with a 12 bit ADC and a gamma compression factor of about 2.9. My system will have a 12 bit ADC with a gamma compression factor of 3. This fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200B;\n\nI want to use an electronic shutter as expected. I want to enable a flash sync speed of 1/8000 of a second. How fast would the readout need to be for that to be possible without artifacts? What components could be added to LED light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200B;\n\nIs a continuous variable ND filter possible?\n\n&amp;#x200B;\n\nWhat is a good open source real time OS that can be used? The Light L16 uses a general purpose OS. I want one that will allow any modifications to fix bugs. What are ways to prevent bugs? Will inspecting the code repeatedly before testing help? Users are more forgiving of missing features than programing errors.\n\n&amp;#x200B;\n\nI want the end image to be a native square. I want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. Would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200B;\n\nI want to design the RAW format to have the image combination and demosaicing done before saving to card. With lossy RAW video, it can use interframe interpolation or be intra only. I will make an optional dedicated external unit for RAW processing. In the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. Because ICC profiles and LUTs are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200B;\n\nWhat thoughts and ideas do you have? What are good subreddits for this? What is your advice? Thanks in advance.",
    "link": "https://www.reddit.com/r/photography/comments/9ioxf6/using_computational_imaging_similar_to_light_l16/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "i want to invent",
    "selectorShort": "invent",
    "MarkedSent": "using computational imaging similar to light l16, is it possible to make a non helicoid optical zoom for it? what about analog gamma compression for the sensors and other ideas? /!/ for background, -----> i !!!  -----> want !!!  -----> to !!!  -----> invent !!!  a new digital camera system. this will combine different ideas and concepts. i know some of them have issues that must be addressed. it will not be suitable for all situations and that is okay.\n\n&amp;#x200b;\n\ni found out about the light l16. it uses several small lenses and sensors to get the equivalent of one large sensor. the problem is that it uses fixed focal length lenses. there are groups of lenses with the same focal length and different options. the camera crops instead of having continuous focal length adjustment. i am curious if making adjustable focal length lenses without the helicoid principle will help. for background, there is a rare minolta 40-80 f/2.8 lens that is without the helicoid principle. it uses a rotating wheel on the side. it is optically superior to comparable modern zooms and lower weight. if adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. is close focusing possible? what is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200b;\n\ni want to implement analog gamma compression. i read studies about prototype chip based sensors with this technology. i want to improve iso invariance, lower the effects of downstream noise, and improve underexposure tolerance. one prototype demonstrated a range of about 18.5 stops with a 12 bit adc and a gamma compression factor of about 2.9. my system will have a 12 bit adc with a gamma compression factor of 3. this fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200b;\n\ni want to use an electronic shutter as expected. i want to enable a flash sync speed of 1/8000 of a second. how fast would the readout need to be for that to be possible without artifacts? what components could be added to led light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200b;\n\nis a continuous variable nd filter possible?\n\n&amp;#x200b;\n\nwhat is a good open source real time os that can be used? the light l16 uses a general purpose os. i want one that will allow any modifications to fix bugs. what are ways to prevent bugs? will inspecting the code repeatedly before testing help? users are more forgiving of missing features than programing errors.\n\n&amp;#x200b;\n\ni want the end image to be a native square. i want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200b;\n\ni want to design the raw format to have the image combination and demosaicing done before saving to card. with lossy raw video, it can use interframe interpolation or be intra only. i will make an optional dedicated external unit for raw processing. in the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. because icc profiles and luts are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200b;\n\nwhat thoughts and ideas do you have? what are good subreddits for this? what is your advice? thanks in advance.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 31927,
    "year": "2018",
    "id": 71
  },
  {
    "autor": "crujones43",
    "date": "2018-01-22 00:22:14",
    "content": "I call this the Anypod. 3d printed camera mount.",
    "link": "https://www.reddit.com/r/photography/comments/7s1u81/i_call_this_the_anypod_3d_printed_camera_mount/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "i call this the anypod. -----> 3d !!!  -----> printed !!!  camera mount.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 26703,
    "year": "2018",
    "id": 72
  },
  {
    "autor": "m42obj",
    "date": "2018-02-07 14:14:20",
    "content": "10 FREE 3D printed Gadgets for Photographers",
    "link": "https://www.reddit.com/r/photography/comments/7vwccv/10_free_3d_printed_gadgets_for_photographers/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "10 free -----> 3d !!!  -----> printed !!!  gadgets for photographers",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 28202,
    "year": "2018",
    "id": 73
  },
  {
    "autor": "esit",
    "date": "2021-06-01 20:46:37",
    "content": "Is there a resource to browse (canon EF) lens by weight? /!/ Is there a table that'd list all (recent, say released within 20 years) lens for Canon EF mount, by weight?\n\nI am trying to come up with a light weight set up that i can bring on outdoor actives more easily. I currently have 80D and 6D, so i'm interested in seeing both crop and full frame lens. \n\nSearching individual ones are kinda exhausting, so i wonder if there's a table that list them all, that also includes sigma, tamron, samyang, and whatever brands as long as it's EF mount. Thanks!",
    "link": "https://www.reddit.com/r/photography/comments/nq45wj/is_there_a_resource_to_browse_canon_ef_lens_by/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "come up with",
    "selectorShort": "with",
    "MarkedSent": "is there a resource to browse (canon ef) lens by weight? /!/ is there a table that'd list all (recent, say released within 20 years) lens for canon ef mount, by weight?\n\ni am trying to -----> come !!!  -----> up !!!  -----> with !!!  a light weight set -----> up !!!  that i can bring on outdoor actives more easily. i currently have 80d and 6d, so i'm interested in seeing both crop and full frame lens. \n\nsearching individual ones are kinda exhausting, so i wonder if there's a table that list them all, that also includes sigma, tamron, samyang, and whatever brands as long as it's ef mount. thanks!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 97322,
    "year": "2021",
    "id": 74
  },
  {
    "autor": "MaterialNo137",
    "date": "2021-07-01 14:40:24",
    "content": "Joined my two Helios 44 with a 3D printed adapter to make a macro lens",
    "link": "https://www.reddit.com/r/photography/comments/obn8aw/joined_my_two_helios_44_with_a_3d_printed_adapter/",
    "origin": "Reddit",
    "suborigin": "photography",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "joined my two helios 44 with a -----> 3d !!!  -----> printed !!!  adapter to make a macro lens",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 97476,
    "year": "2021",
    "id": 75
  },
  {
    "autor": "YashenTheVeganZombie",
    "date": "2019-06-05 15:54:08",
    "content": "I have made a simple diffuser for the EF-X20 (download link in comments!)",
    "link": "https://www.reddit.com/r/fujifilm/comments/bx45ms/i_have_made_a_simple_diffuser_for_the_efx20/",
    "origin": "Reddit",
    "suborigin": "fujifilm",
    "selector": "i have made",
    "selectorShort": "make",
    "MarkedSent": "-----> i !!!  -----> have !!!  -----> made !!!  a simple diffuser for the ef-x20 (download link in comments!)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 24001,
    "year": "2019",
    "id": 76
  },
  {
    "autor": "DariuszBoron",
    "date": "2020-07-30 11:54:11",
    "content": "Alternative for the Clear filter for Canon's Drop in RF to EF Adapter. /!/ Hi everyone,\n\nI've created an alternative to the clear drop in filter, which would drop into the Canon RF to EF adapter for the EOS R series of cameras. This filter has no actual lens, just an opening, to reduce glass items. Many will be familiar with using their EF lenses with the RF camera. I'm looking for comments, suggestions, ideas, constructive criticism with this idea please. Thanks a lot!\n\n[Just to be used like a regular clear Canon filter.](https://preview.redd.it/qxn7tdapgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=b19ef2518628cc70182b573dd22fe38b3d8fb666)\n\n&amp;#x200B;\n\n[the item for now](https://preview.redd.it/xkxpm1lvgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=90727ddd2260008c29644b7f2f7ac8d2df03356e)",
    "link": "https://www.reddit.com/r/canon/comments/i0kpzz/alternative_for_the_clear_filter_for_canons_drop/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "i've created",
    "selectorShort": "create",
    "MarkedSent": "alternative for the clear filter for canon's drop in rf to ef adapter. /!/ hi everyone,\n\n-----> i !!! 've -----> created !!!  an alternative to the clear drop in filter, which would drop into the canon rf to ef adapter for the eos r series of cameras. this filter has no actual lens, just an opening, to reduce glass items. many will be familiar with using their ef lenses with the rf camera. i'm looking for comments, suggestions, ideas, constructive criticism with this idea please. thanks a lot!\n\n[just to be used like a regular clear canon filter.](https://preview.redd.it/qxn7tdapgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=b19ef2518628cc70182b573dd22fe38b3d8fb666)\n\n&amp;#x200b;\n\n[the item for now](https://preview.redd.it/xkxpm1lvgzd51.jpg?width=5616&amp;format=pjpg&amp;auto=webp&amp;s=90727ddd2260008c29644b7f2f7ac8d2df03356e)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 48795,
    "year": "2020",
    "id": 77
  },
  {
    "autor": "Joe_Scotto",
    "date": "2018-05-22 03:50:02",
    "content": "3D Printed A9 / A7iii/ A7Riii Grip Extension /!/ Over the past month I've been working on a cheap yet effective 3d printed grip extension for the third generation sony bodies. If interested, you can pick one up at this [link](https://joe-scotto.myshopify.com/collections/frontpage/products/sony-a9-a7riii-a7iii-grip-extension)",
    "link": "https://www.reddit.com/r/Cameras/comments/8l70zj/3d_printed_a9_a7iii_a7riii_grip_extension/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  a9 / a7iii/ a7riii grip extension /!/ over the past month i've been working on a cheap yet effective 3d printed grip extension for the third generation sony bodies. if interested, you can pick one up at this [link](https://joe-scotto.myshopify.com/collections/frontpage/products/sony-a9-a7riii-a7iii-grip-extension)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 68919,
    "year": "2018",
    "id": 78
  },
  {
    "autor": "Silence_Corner",
    "date": "2021-01-14 05:42:28",
    "content": "I designed an automatic magnetic Buckle for camera, I want to know your opinion It name \"Squid system\" /!/ I designed an automatic magnetic Buckle for camera\"Squid system\", I want to know your opinion \n\nI know what you want to say. You want to say this is very similar to Peak Design’s Anchor Links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nThe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nAs long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200B;\n\n Tell me your opinion, good or bad \\^\\^",
    "link": "https://www.reddit.com/r/Cameras/comments/kwzgx9/i_designed_an_automatic_magnetic_buckle_for/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  an automatic magnetic buckle for camera, -----> i !!!  want to know your opinion it name \"squid system\" /!/ i designed an automatic magnetic buckle for camera\"squid system\", i want to know your opinion \n\ni know what you want to say. you want to say this is very similar to peak design’s anchor links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nthe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nas long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200b;\n\n tell me your opinion, good or bad \\^\\^",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 16941,
    "year": "2021",
    "id": 79
  },
  {
    "autor": "Traditional-Scale-42",
    "date": "2021-08-18 02:04:59",
    "content": "We designed PlateZ to expand the capabilities of your camera without having to purchase multiple expensive products. Our goal is to create the platform to add all your accessories and expand their functionality with PlateZ.",
    "link": "https://www.reddit.com/r/Cameras/comments/p6htem/we_designed_platez_to_expand_the_capabilities_of/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "we designed",
    "selectorShort": "design",
    "MarkedSent": "-----> we !!!  -----> designed !!!  platez to expand the capabilities of your camera without having to purchase multiple expensive products. our goal is to create the platform to add all your accessories and expand their functionality with platez.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 20583,
    "year": "2021",
    "id": 80
  },
  {
    "autor": "nsandin88",
    "date": "2019-07-07 14:19:39",
    "content": "I designed &amp; 3D printed this adapter to use this 70 year old Kodak Retina IIIc lens on my Nikon Z7 (test shots in comments)",
    "link": "https://www.reddit.com/r/Cameras/comments/ca7b2p/i_designed_3d_printed_this_adapter_to_use_this_70/",
    "origin": "Reddit",
    "suborigin": "Cameras",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  &amp; 3d printed this adapter to use this 70 year old kodak retina iiic lens on my nikon z7 (test shots in comments)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 80814,
    "year": "2019",
    "id": 81
  },
  {
    "autor": "wiptheman",
    "date": "2020-11-04 12:48:24",
    "content": "3D printed lens hood for RF 35mm",
    "link": "https://www.reddit.com/r/canon/comments/jnw3kw/3d_printed_lens_hood_for_rf_35mm/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  lens hood for rf 35mm",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 49836,
    "year": "2020",
    "id": 82
  },
  {
    "autor": "ViaJCE",
    "date": "2019-03-16 18:57:30",
    "content": "Created My Own Version of a Wristband Camera Leash (Sony A7III)",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/b1vvk3/created_my_own_version_of_a_wristband_camera/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "created",
    "selectorShort": "create",
    "MarkedSent": "-----> created !!!  my own version of a wristband camera leash (sony a7iii)",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 6546,
    "year": "2019",
    "id": 83
  },
  {
    "autor": "x29a",
    "date": "2021-09-19 11:48:11",
    "content": "3D printed a Lens Hood that creates Swirly Bokeh for my FE 55/1.8",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/pr6guk/3d_printed_a_lens_hood_that_creates_swirly_bokeh/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  a lens hood that creates swirly bokeh for my fe 55/1.8",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 34750,
    "year": "2021",
    "id": 84
  },
  {
    "autor": "chiclet_fanboi",
    "date": "2019-11-22 09:09:42",
    "content": "I ruined my poor little NEX, but now it sees stuff I don't (DIY full spectrum + transmittance of stock filter) /!/ So, I tried to do a full spectrum conversion on a old NEX-5 which I essentially bought for its accessories, and I would have been fine, killing it in the process, unless...\n\nWell I took it apart and was able to remove the stock IR and UV cut filter. I obviously didn't want to spend 100 bucks on a professional grade window especially chosen and cut for this application, so I used the cheapest sort of right thickness glass I could imagine, a microscope sample slide. When reassembled I turned it on and - a blank screen greeted me. But I heard the lens whirring, and with a SD card it took nicely red tinted and sharp pictures. Turned out I had butchered the LCD connector. I mean if I killed the sensor or the CPU, but this was a way to close loose on the conversion.\n\nMy last ressort was getting one of these small Raspberry Pi HDMI monitors in case the HDMI port was still working - and it did! So my now full spectrum camera is literally on life support, but working:\n\nhttps://imgur.com/tTh1SHg\n\nA few weeks I got rightfully grilled in r/photography for stating that the internal IR cut filter doesn't affect visible light, I just assumed it would be similar to a screw on IR and UV cut filter: [https://hoyafilter.com/product/uv\\_ir\\_cut/](https://hoyafilter.com/product/uv_ir_cut/)\n\nTo cofirm that this assumtion was as wrong as can be, I did a quick check with a spectrometer, to get an idea of the transmittance curve of the stock sensor. My lighting, containing a halogen lamp and a UV flashlight, lacked blue, so the curve gets quite noisy in the blues - but you can make out what the filter does. Cuts way into the visible spectrum!\n\nhttps://imgur.com/QzacZQ7",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/dzyjew/i_ruined_my_poor_little_nex_but_now_it_sees_stuff/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "i ruined my poor little nex, but now it sees stuff i don't (-----> diy !!!  full spectrum + transmittance of stock filter) /!/ so, i tried to do a full spectrum conversion on a old nex-5 which i essentially bought for its accessories, and i would have been fine, killing it in the process, unless...\n\nwell i took it apart and was able to remove the stock ir and uv cut filter. i obviously didn't want to spend 100 bucks on a professional grade window especially chosen and cut for this application, so i used the cheapest sort of right thickness glass i could imagine, a microscope sample slide. when reassembled i turned it on and - a blank screen greeted me. but i heard the lens whirring, and with a sd card it took nicely red tinted and sharp pictures. turned out i had butchered the lcd connector. i mean if i killed the sensor or the cpu, but this was a way to close loose on the conversion.\n\nmy last ressort was getting one of these small raspberry pi hdmi monitors in case the hdmi port was still working - and it did! so my now full spectrum camera is literally on life support, but working:\n\nhttps://imgur.com/tth1shg\n\na few weeks i got rightfully grilled in r/photography for stating that the internal ir cut filter doesn't affect visible light, i just assumed it would be similar to a screw on ir and uv cut filter: [https://hoyafilter.com/product/uv\\_ir\\_cut/](https://hoyafilter.com/product/uv_ir_cut/)\n\nto cofirm that this assumtion was as wrong as can be, i did a quick check with a spectrometer, to get an idea of the transmittance curve of the stock sensor. my lighting, containing a halogen lamp and a uv flashlight, lacked blue, so the curve gets quite noisy in the blues - but you can make out what the filter does. cuts way into the visible spectrum!\n\nhttps://imgur.com/qzaczq7",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 1982,
    "year": "2019",
    "id": 85
  },
  {
    "autor": "fisheveadventures",
    "date": "2018-11-04 21:30:29",
    "content": "A6300 - Create Your own DIY Flash Diffuser in under 5 Minutes",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/9u7bxf/a6300_create_your_own_diy_flash_diffuser_in_under/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "a6300 - create your own -----> diy !!!  flash diffuser in under 5 minutes",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 43049,
    "year": "2018",
    "id": 86
  },
  {
    "autor": "vttdn",
    "date": "2021-10-15 09:40:44",
    "content": "Datafilm: the Note app designed for Leica-M film photographers /!/ Hello,\n\nMy name is Vincent, I am an amateur film photographer as well as a product designer (interfaces, ui, ux). Today I am excited to share [Datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. It is a Non-Profit and Free project I have been working on during the past few months and it is now available for everyone on the AppStore.\n\nI initially created Datafilm to be able to refer to my settings later on when receiving scans from my lab, so I could improve my practice. \n\nNot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. Similar solutions were already available on the market, however none of them was really fulfilling my need. Sometimes what I was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nSo yes, here comes Datafilm. It has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. I hope you will find it useful and enjoy it.\n\nAs a side note, I believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\nA quick preview of the quick note taking feature can be [watched here on Dribbble](https://dribbble.com/shots/16556831-Quick-Settings).\n\n[Download Datafilm on the AppStore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nThank you for reading me, have a good day!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "link": "https://www.reddit.com/r/Leica/comments/q8kxy6/datafilm_the_note_app_designed_for_leicam_film/",
    "origin": "Reddit",
    "suborigin": "leica",
    "selector": "i initially created",
    "selectorShort": "create",
    "MarkedSent": "datafilm: the note app designed for leica-m film photographers /!/ hello,\n\nmy name is vincent, i am an amateur film photographer as well as a product designer (interfaces, ui, ux). today i am excited to share [datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. it is a non-profit and free project i have been working on during the past few months and it is now available for everyone on the appstore.\n\n-----> i !!!  -----> initially !!!  -----> created !!!  datafilm to be able to refer to my settings later on when receiving scans from my lab, so -----> i !!!  could improve my practice. \n\nnot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. similar solutions were already available on the market, however none of them was really fulfilling my need. sometimes what i was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nso yes, here comes datafilm. it has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. i hope you will find it useful and enjoy it.\n\nas a side note, i believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\na quick preview of the quick note taking feature can be [watched here on dribbble](https://dribbble.com/shots/16556831-quick-settings).\n\n[download datafilm on the appstore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nthank you for reading me, have a good day!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 75983,
    "year": "2021",
    "id": 87
  },
  {
    "autor": "Someguywhomakething",
    "date": "2020-12-19 00:18:03",
    "content": "Beach Side Pavilion Closed / / Sony A7RII x Mamiya-Sekor 645 55mm f2.8 on 3D printed shift adapter.",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/kfx8lh/beach_side_pavilion_closed_sony_a7rii_x/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "beach side pavilion closed / / sony a7rii x mamiya-sekor 645 55mm f2.8 on -----> 3d !!!  -----> printed !!!  shift adapter.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 39322,
    "year": "2020",
    "id": 88
  },
  {
    "autor": "SuperCowTrey",
    "date": "2020-02-20 23:59:09",
    "content": "Sony a7ii + Minolta 50mm 1.4 on a 3D printed tilt adapter",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/f72bhj/sony_a7ii_minolta_50mm_14_on_a_3d_printed_tilt/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "sony a7ii + minolta 50mm 1.4 on a -----> 3d !!!  -----> printed !!!  tilt adapter",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 36835,
    "year": "2020",
    "id": 89
  },
  {
    "autor": "father1000",
    "date": "2020-11-30 23:53:25",
    "content": "Three year old son was jealous after I gave my daughter my NEX-5r. So, I 3D printed an \"Alpha\" body to an old Sony DSC-TX10. He's happy and now his fingers will not be blocking the lens. PRO TIP: Toddlers are great for street photography and low angles.",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/k48nyd/three_year_old_son_was_jealous_after_i_gave_my/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "three year old son was jealous after i gave my daughter my nex-5r. so, i -----> 3d !!!  -----> printed !!!  an \"alpha\" body to an old sony dsc-tx10. he's happy and now his fingers will not be blocking the lens. pro tip: toddlers are great for street photography and low angles.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 40536,
    "year": "2020",
    "id": 90
  },
  {
    "autor": "Someguywhomakething",
    "date": "2020-08-25 17:12:43",
    "content": "I shoot a fair bit of 360 Panoramas with my Sony. These 3d printed pano mounts help me get out of a worksite quicker than fumbling with my old sunwayfoto CR-30.",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/iggfiw/i_shoot_a_fair_bit_of_360_panoramas_with_my_sony/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "i shoot a fair bit of 360 panoramas with my sony. these -----> 3d !!!  -----> printed !!!  pano mounts help me get out of a worksite quicker than fumbling with my old sunwayfoto cr-30.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 43932,
    "year": "2020",
    "id": 91
  },
  {
    "autor": "ntoporcov",
    "date": "2019-01-18 06:21:37",
    "content": "I created a web app for photographers who use Google Drive to send photos to clients but wish they had a better looking page to send to clients.",
    "link": "https://www.reddit.com/r/Nikon/comments/ah7lvu/i_created_a_web_app_for_photographers_who_use/",
    "origin": "Reddit",
    "suborigin": "nikon",
    "result": true,
    "Selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "-----> i !!!  -----> created !!!  a web app for photographers who use google drive to send photos to clients but wish they had a better looking page to send to clients.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 1248,
    "year": "2019",
    "id": 0
  },
  {
    "autor": "electricmajesty",
    "date": "2021-06-06 16:57:51",
    "content": "Designed and 3D printed a switch holder for the UURig R008",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/ntq6ro/designed_and_3d_printed_a_switch_holder_for_the/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "designed",
    "selectorShort": "design",
    "MarkedSent": "-----> designed !!!  and 3d printed a switch holder for the uurig r008",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 34524,
    "year": "2021",
    "id": 1
  },
  {
    "autor": "kirillre4",
    "date": "2021-05-05 09:42:32",
    "content": "I designed a manual aperture key for old A-mount lenses",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/n5c2v6/i_designed_a_manual_aperture_key_for_old_amount/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  a manual aperture key for old a-mount lenses",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 45275,
    "year": "2021",
    "id": 2
  },
  {
    "autor": "fisheveadventures",
    "date": "2018-11-04 21:30:29",
    "content": "A6300 - Create Your own DIY Flash Diffuser in under 5 Minutes",
    "link": "https://www.reddit.com/r/SonyAlpha/comments/9u7bxf/a6300_create_your_own_diy_flash_diffuser_in_under/",
    "origin": "Reddit",
    "suborigin": "SonyAlpha",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "a6300 - create your own -----> diy !!!  flash diffuser in under 5 minutes",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 43049,
    "year": "2018",
    "id": 3
  },
  {
    "autor": "TonyPhucHoang",
    "date": "2021-01-13 13:43:20",
    "content": "Canon 80d + Saramonic Mixer 3d printed modification | Tony Hoang",
    "link": "https://www.reddit.com/r/canon/comments/kwgnrn/canon_80d_saramonic_mixer_3d_printed_modification/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "canon 80d + saramonic mixer -----> 3d !!!  -----> printed !!!  modification | tony hoang",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 39261,
    "year": "2021",
    "id": 4
  },
  {
    "autor": "IOSdevme",
    "date": "2021-10-12 12:37:54",
    "content": "3d Printed Canon RF to EF tilt adapter",
    "link": "https://www.reddit.com/r/canon/comments/q6l8dk/3d_printed_canon_rf_to_ef_tilt_adapter/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "3d printed",
    "selectorShort": "print",
    "MarkedSent": "-----> 3d !!!  -----> printed !!!  canon rf to ef tilt adapter",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 40826,
    "year": "2021",
    "id": 5
  },
  {
    "autor": "TonyPhucHoang",
    "date": "2021-01-14 00:59:26",
    "content": "DIY canon 80d : removed flash capacitor since I don’t have an onboard flash anymore. And removed shutter since I don’t take images only video.",
    "link": "https://www.reddit.com/r/canon/comments/kwumst/diy_canon_80d_removed_flash_capacitor_since_i/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "-----> diy !!!  canon 80d : removed flash capacitor since i don’t have an onboard flash anymore. and removed shutter since i don’t take images only video.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 44044,
    "year": "2021",
    "id": 6
  },
  {
    "autor": "Kinabin777",
    "date": "2021-07-05 21:04:29",
    "content": "Canon Rumors: Canon R5c is coming... /!/ [Canon R5c](https://www.canonrumors.com/the-canon-eos-r5c-is-coming-in-q1-2022-cr3/)\n\n\"c\" is for \"Cooled\" I guess;o)\nTLDR; more or less the same body as R5, only this time actively cooled.\nWhen I suggested this should be done in the first place, various string theorists have claimed fundamental physical snafus  that would obviously prevent such solution.\n\nUntil we saw DIY-ers using simple copper sheets to lessen the problem.",
    "link": "https://www.reddit.com/r/canon/comments/oegbui/canon_rumors_canon_r5c_is_coming/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "diy",
    "selectorShort": "diy",
    "MarkedSent": "canon rumors: canon r5c is coming... /!/ [canon r5c](https://www.canonrumors.com/the-canon-eos-r5c-is-coming-in-q1-2022-cr3/)\n\n\"c\" is for \"cooled\" i guess;o)\ntldr; more or less the same body as r5, only this time actively cooled.\nwhen i suggested this should be done in the first place, various string theorists have claimed fundamental physical snafus  that would obviously prevent such solution.\n\nuntil we saw -----> diy !!! -ers using simple copper sheets to lessen the problem.",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 44406,
    "year": "2021",
    "id": 7
  },
  {
    "autor": "nicbuh",
    "date": "2021-01-11 09:45:19",
    "content": "A simple Intervalometer for the Canon M50 /!/ The Canon M50 is a remarkable camera with great value for money. One of the shortcomings, however, has always been the lack of intervalometer functionality: Unlike many of its bigger brothers the M50 doesn't provide this option in its menu and even external intervalometers are not connectable to the camera as it lacks the needed connector. As no solution in the market seemed to solve this issue, I have developed a simple app for Android that can trigger the camera via bluetooth at a set interval. Figuring that other people may have the same need, I put it on the play store and hope you find it useful:\nhttps://play.google.com/store/apps/details?id=com.booman.intervalometer",
    "link": "https://www.reddit.com/r/canon/comments/kuzkm8/a_simple_intervalometer_for_the_canon_m50/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "i have developed",
    "selectorShort": "develop",
    "MarkedSent": "a simple intervalometer for the canon m50 /!/ the canon m50 is a remarkable camera with great value for money. one of the shortcomings, however, has always been the lack of intervalometer functionality: unlike many of its bigger brothers the m50 doesn't provide this option in its menu and even external intervalometers are not connectable to the camera as it lacks the needed connector. as no solution in the market seemed to solve this issue, -----> i !!!  -----> have !!!  -----> developed !!!  a simple app for android that can trigger the camera via bluetooth at a set interval. figuring that other people may have the same need, i put it on the play store and hope you find it useful:\nhttps://play.google.com/store/apps/details?id=com.booman.intervalometer",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 39333,
    "year": "2021",
    "id": 8
  },
  {
    "autor": "AD1AD",
    "date": "2021-02-03 03:47:01",
    "content": "I designed a 3D printable teleprompter/autocue assembly for the Canon EOS M50 =) /!/ All you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nSo, if you saved up enough for the camera itself, already have a tablet, and have access to a 3D printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nIts design could probably be pretty easily adjusted for other popular cameras. It's not quite modular, and barely parametric (I suck at OpenSCAD), but I'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nIt's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger EOS M50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nThe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=MxUbaxXaQH0](https://www.youtube.com/watch?v=MxUbaxXaQH0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nThanks for your time!",
    "link": "https://www.reddit.com/r/canon/comments/lberua/i_designed_a_3d_printable_teleprompterautocue/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "i designed",
    "selectorShort": "design",
    "MarkedSent": "-----> i !!!  -----> designed !!!  a 3d printable teleprompter/autocue assembly for the canon eos m50 =) /!/ all you need is a piece of picture frame glass, a threaded tripod screw insert, and a tripod screw.\n\n[https://www.thingiverse.com/thing:4746985](https://www.thingiverse.com/thing:4746985)\n\nso, if you saved up enough for the camera itself, already have a tablet, and have access to a 3d printer, but can't afford the $200-$400 kit that would let you upgrade your recording setup alongside your photography game, this is a remarkably cheap upgrade 👍\n\nits design could probably be pretty easily adjusted for other popular cameras. it's not quite modular, and barely parametric (i suck at openscad), but i'm hopeful the .scad file will at least make things easier for anyone who wants to try.\n\nit's a modification of an older, enclosed webcam design, but now with tablet-securing jankness, an underside external power cable hole, and an unenclosed design for the much larger eos m50 (and larger-still mess of cables required to capture full res and keep the camera awake and on...[🤯](https://typography.guru/emoji-meanings-list/shocked-face-with-exploding-head-r1428/)[🍳](https://emojidictionary.emojifoundation.com/cooking))\n\nthe older design can be seen here, and the new version works similarly:\n\n[https://www.youtube.com/watch?v=mxubaxxaqh0](https://www.youtube.com/watch?v=mxubaxxaqh0)\n\n[https://www.thingiverse.com/thing:4385108](https://www.thingiverse.com/thing:4385108)\n\nthanks for your time!",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 41000,
    "year": "2021",
    "id": 9
  },
  {
    "autor": "iebyt",
    "date": "2018-09-08 20:18:25",
    "content": "Android app to control Canon DSLR cameras using Bluetooth LE. /!/ Hi everyone,\n\nI created an android app to control my EOS 200D using Bluetooth LE. This app allows the phone to be used as Canon's BR-E1 bluetooth remote. The app should work with any Canon Cameras which support BR-E1 remote. The official list is 77D, 800D, 200D and 6D Mark II. I am only able to test the app with my 200D as I have only one camera. I would like to know if this app works with any other canon cameras. Link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nThank you",
    "link": "https://www.reddit.com/r/canon/comments/9e76aq/android_app_to_control_canon_dslr_cameras_using/",
    "origin": "Reddit",
    "suborigin": "canon",
    "selector": "i created",
    "selectorShort": "create",
    "MarkedSent": "android app to control canon dslr cameras using bluetooth le. /!/ hi everyone,\n\n-----> i !!!  -----> created !!!  an android app to control my eos 200d using bluetooth le. this app allows the phone to be used as canon's br-e1 bluetooth remote. the app should work with any canon cameras which support br-e1 remote. the official list is 77d, 800d, 200d and 6d mark ii. i am only able to test the app with my 200d as i have only one camera. i would like to know if this app works with any other canon cameras. link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nthank you",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 22418,
    "year": "2018",
    "id": 10
  },
  {
    "autor": "vttdn",
    "date": "2021-10-15 09:40:44",
    "content": "Datafilm: the Note app designed for Leica-M film photographers /!/ Hello,\n\nMy name is Vincent, I am an amateur film photographer as well as a product designer (interfaces, ui, ux). Today I am excited to share [Datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. It is a Non-Profit and Free project I have been working on during the past few months and it is now available for everyone on the AppStore.\n\nI initially created Datafilm to be able to refer to my settings later on when receiving scans from my lab, so I could improve my practice. \n\nNot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. Similar solutions were already available on the market, however none of them was really fulfilling my need. Sometimes what I was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nSo yes, here comes Datafilm. It has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. I hope you will find it useful and enjoy it.\n\nAs a side note, I believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\nA quick preview of the quick note taking feature can be [watched here on Dribbble](https://dribbble.com/shots/16556831-Quick-Settings).\n\n[Download Datafilm on the AppStore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nThank you for reading me, have a good day!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "link": "https://www.reddit.com/r/Leica/comments/q8kxy6/datafilm_the_note_app_designed_for_leicam_film/",
    "origin": "Reddit",
    "suborigin": "leica",
    "selector": "i initially created",
    "selectorShort": "create",
    "MarkedSent": "datafilm: the note app designed for leica-m film photographers /!/ hello,\n\nmy name is vincent, i am an amateur film photographer as well as a product designer (interfaces, ui, ux). today i am excited to share [datafilm](https://apps.apple.com/th/app/datafilm/id1579488213) with you. it is a non-profit and free project i have been working on during the past few months and it is now available for everyone on the appstore.\n\n-----> i !!!  -----> initially !!!  -----> created !!!  datafilm to be able to refer to my settings later on when receiving scans from my lab, so -----> i !!!  could improve my practice. \n\nnot everyone wants to carry a pen and notebook while shooting, however we carry our phones most of the time with us. similar solutions were already available on the market, however none of them was really fulfilling my need. sometimes what i was considering as key features were missing, sometimes there were too many of them, and my experience was lacking of some sort of simplicity and convenience.\n\nso yes, here comes datafilm. it has been made for the community with passion and a big focus on simplicity, ease of use, and user experience. i hope you will find it useful and enjoy it.\n\nas a side note, i believe that great products mostly come from listening to users &amp; iterations, so please feel free to comment under this post or simply drop me a mail at [bonjour@datafilm.io](mailto:bonjour@datafilm.io) if you have any feedback.\n\na quick preview of the quick note taking feature can be [watched here on dribbble](https://dribbble.com/shots/16556831-quick-settings).\n\n[download datafilm on the appstore](https://apps.apple.com/th/app/datafilm/id1579488213).\n\nthank you for reading me, have a good day!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/9yo40rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=623255ce23ae4495f343ba0ac218ad8ca5a74875\n\nhttps://preview.redd.it/t6n88rnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=a3fae498426992f9601d3225559c36d3fa3b3cb0\n\nhttps://preview.redd.it/7cftnonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=02dbbc300eea33d2958e3b8a9e5e46a25fc9db6e\n\nhttps://preview.redd.it/um01tonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bdc16812d4d0470f68e8c06944f8fa79ae15739f\n\nhttps://preview.redd.it/3q1lkrnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=e252412f2b69b1e59983a31650c808c83dceffb8\n\nhttps://preview.redd.it/pe0ripnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=61b826f7db309c498e373a33639828a2fb690c67\n\nhttps://preview.redd.it/iyckwonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=352c09e7753fd77728a5b3cc3f7b77469d93b1a7\n\nhttps://preview.redd.it/wvkc3pnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=16a3775f1d5109e8ac695c7d65c704078d46ccf6\n\nhttps://preview.redd.it/nefwcpnq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=35766352fd7f2e9750e5e9df24a01bef19056a59\n\nhttps://preview.redd.it/eltbqonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=bc2bc2dfee83ec7d651dbf1b615e84a012b70917\n\nhttps://preview.redd.it/k78qoonq2lt71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=404332b7f86b5adc7407e4877403760f6886c934",
    "sortedWord": "None",
    "Identifyer": null,
    "identifyer": 75983,
    "year": "2021",
    "id": 11
  }
]
