{"interestingcomments": [{"Unnamed: 0": 168266, "autor": "2_Dope_Kicks", "date": 1581910535000, "content": "Just because u/dashingtoast reminded that I have this one in the archive. Xpro2 dont recall the lens.", "link": "https://www.reddit.com/r/fujifilm/comments/f52i26/just_because_udashingtoast_reminded_that_i_have/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "just because u/dashingtoast reminded that i have this one in the -----> archive !!! . xpro2 dont recall the lens.", "sortedWord": "None", "identifyer": 60344, "year": "2020"}, {"Unnamed: 0": 172502, "autor": "Orzaek", "date": 1595545620000, "content": "Fujifilm X-T3 vs. Canon T3i Battery Life /!/ Hi everyone,\n\n\nLately I've been torn between purchasing the X-T3 with the current reduced price, or saving up for the X-T4. One of my dilemmas is regarding battery life. My current camera is a Canon Rebel T3i with a battery capacity of 1120 mAh (440 shots), whereas Fujifilm states that the X-T3 has a capacity of 1260 mAh (390 shots), so the Canon is the only reference I have experience with that can help me draw any comparisons. I've heard conflicting feedback in regards to how many shots people get on average out of the X-T3 - some stating that they get as few as low 200's, to anywhere in the 500 range. Of course, camera use such as only stills or video included as well as LCD screen time / menu browsing contributes to battery drain. On a single full charged battery for my Canon T3i, I'm more or less able to shoot most of what I want intermittently throughout the day without worrying too much about having a second battery. I use my camera mostly for travel, and looking over my photo archive, I'd estimate that I shoot maybe an average of 350 to 400 photos for a full day. I understand that everyone's shooting style is different as well as using various features such as video, but I was curious as to what some of your experiences are with the X-T3's battery and if it's a valid cause for concern as I keep reading around. \n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/hwq9qe/fujifilm_xt3_vs_canon_t3i_battery_life/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "fujifilm x-t3 vs. canon t3i battery life /!/ hi everyone,\n\n\nlately i've been torn between purchasing the x-t3 with the current reduced price, or saving up for the x-t4. one of my dilemmas is regarding battery life. my current camera is a canon rebel t3i with a battery capacity of 1120 mah (440 shots), whereas fujifilm states that the x-t3 has a capacity of 1260 mah (390 shots), so the canon is the only reference i have experience with that can help me draw any comparisons. i've heard conflicting feedback in regards to how many shots people get on average out of the x-t3 - some stating that they get as few as low 200's, to anywhere in the 500 range. of course, camera use such as only stills or video included as well as lcd screen time / menu browsing contributes to battery drain. on a single full charged battery for my canon t3i, i'm more or less able to shoot most of what i want intermittently throughout the day without worrying too much about having a second battery. i use my camera mostly for travel, and looking over my photo -----> archive !!! , i'd estimate that i shoot maybe an average of 350 to 400 photos for a full day. i understand that everyone's shooting style is different as well as using various features such as video, but i was curious as to what some of your experiences are with the x-t3's battery and if it's a valid cause for concern as i keep reading around. \n\nthanks!", "sortedWord": "None", "identifyer": 64754, "year": "2020"}], "name": "archivefujifilm2020"}