{"interestingcomments": [{"Unnamed: 0": 230619, "autor": "walkswithdogs", "date": 1559433045000, "content": "Quick review of Fuji Camera Remote v4.0.0.19 /!/ I've used the new app to transfer photos 3-4 times now. It does connect more easily, but is still balky at times. When connecting, there is a very odd and time-wasting need to hit OK on the camera  to make the connection to complete. No possible reason for this. I don't need to give myself permission. Once connected, selecting multiple photos is easy enough, but the transfer speed is still glacial. Bottom line, it's just not practical is real-world use. Live view shooting is ok at least. I saw nothing that suggested any fix to the worthless geotagging feature.\n\nOne reason I have an X-E3, is that I take most of my photos when backpacking, carrying my camera on a Peak Design clip. The clip plate blocks the door for the battery and SD card. Removing this in the field with an allen wrench tool is a no go, and would not help with phone transfer anyway. My fix is a 6\" cable with USB Type C on the phone end and USB 2.0 on the camera end. I just plug in the cable and use the USB notice options to select the photo transfer mode. I can then select photos on my phone and import them directly into Lightroom CC. It takes perhaps 2 seconds per photo. One problem I have not resolved is that photos are always shown chronologically, and with a couple of thousand photos on my SD card scrolling to the end is a pain.", "link": "https://www.reddit.com/r/fujifilm/comments/bvr9lh/quick_review_of_fuji_camera_remote_v40019/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "quick review of fuji camera remote v4.0.0.19 /!/ i've used the new app to transfer photos 3-4 times now. it does connect more easily, but is still balky at times. when connecting, there is a very odd and time-wasting need to hit ok on the camera  to make the connection to complete. no possible reason for this. i don't need to give myself permission. once connected, selecting multiple photos is easy enough, but the transfer speed is still glacial. bottom line, it's just not practical is real-world use. live view shooting is ok at least. i saw nothing that suggested any fix to the worthless -----> geotagging !!!  feature.\n\none reason i have an x-e3, is that i take most of my photos when backpacking, carrying my camera on a peak design clip. the clip plate blocks the door for the battery and sd card. removing this in the field with an allen wrench tool is a no go, and would not help with phone transfer anyway. my fix is a 6\" cable with usb type c on the phone end and usb 2.0 on the camera end. i just plug in the cable and use the usb notice options to select the photo transfer mode. i can then select photos on my phone and import them directly into lightroom cc. it takes perhaps 2 seconds per photo. one problem i have not resolved is that photos are always shown chronologically, and with a couple of thousand photos on my sd card scrolling to the end is a pain.", "sortedWord": "None", "identifyer": 25560, "year": "2019"}], "name": "geotaggingfujifilm2019"}