{"interestingcomments": [{"Unnamed: 0": 207188, "autor": "sheldoneousk", "date": 1538139919000, "content": "Olympus user thinking of swtiching /!/ Good morning,\n\nI currently use an OMD EM5 Olympus Micro 4/3s camera.  However, it is starting to show its age a bit and some of the lack of features are kind of annoying. I have been thinking of getting a new body and have also been pondering a switch to a different system entirely. I like the aesthetics of the Fuji cameras and some of the photos that I've seen them produce are quite stellar. \n\nI am mostly a faux street photographer. Meaning that when i am in a new place or places with a lot of people i will take pics of street scenes but also use my camera to take pics of family as well. I have a tendency to shoot in a lot of low light scenarios as well. \n\nThings I am looking for are something that is budget friendly (around 1000usd this includes selling off or trading current gear). Something which is fairly portable, I would say pocketable but I am not sure I want to limit myself to a fixed focal length..yet) has things like wifi/ decent viewfinder and LCD (EM5s LCD is garbage)/ Geotagging and hopefully decent video. Would be looking for a kit to get me started. I prefer Primes to Zooms as well. \n\nAll in all I was hoping you all might be able to help me make an informed decision or tell me I'm a crazy person. \n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/9jmrw0/olympus_user_thinking_of_swtiching/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "olympus user thinking of swtiching /!/ good morning,\n\ni currently use an omd em5 olympus micro 4/3s camera.  however, it is starting to show its age a bit and some of the lack of features are kind of annoying. i have been thinking of getting a new body and have also been pondering a switch to a different system entirely. i like the aesthetics of the fuji cameras and some of the photos that i've seen them produce are quite stellar. \n\ni am mostly a faux street photographer. meaning that when i am in a new place or places with a lot of people i will take pics of street scenes but also use my camera to take pics of family as well. i have a tendency to shoot in a lot of low light scenarios as well. \n\nthings i am looking for are something that is budget friendly (around 1000usd this includes selling off or trading current gear). something which is fairly portable, i would say pocketable but i am not sure i want to limit myself to a fixed focal length..yet) has things like wifi/ decent viewfinder and lcd (em5s lcd is garbage)/ -----> geotagging !!!  and hopefully decent video. would be looking for a kit to get me started. i prefer primes to zooms as well. \n\nall in all i was hoping you all might be able to help me make an informed decision or tell me i'm a crazy person. \n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "identifyer": 713, "year": "2018"}], "name": "geotaggingfujifilm2018"}