{"interestingcomments": [{"Unnamed: 0": 165640, "autor": "Miles23O", "date": 1606022237000, "content": "Connection problems XT-4 /!/ How would you rate your experience with connection between camera and your phone? I have been using my new camera for a while and I would say that this segment of XT-4 is not so good. Maybe I have high expectations, or maybe I am doing something wrong so it would be good to see what are your experiences. \n\nFor example, I can't update firmware for weeks because there is always something that interrupts the process. First of all the transfer is super slow even though I supposedly connected camera not only by BT but also by wifi. Most common thing is that it starts transferring the update and camera SUDDENLY turns off (stand by). Lol Sometimes it just says \"can't be blabla...retry\"\n\nAlso similar is with other fujifilm app options. Nothing is ever smooth. Everything is so slow and it takes a century to use a simple functions. \n\nApp is the latest update from play store. Location is enabled. I have a premium android phone. Camera is XT-4.\n\nWhat am I doing wrong? Or at least tell me if Fujifilm is doing something wrong. Someone definitely is.", "link": "https://www.reddit.com/r/fujifilm/comments/jyq6oe/connection_problems_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "connection problems xt-4 /!/ how would you rate your experience with connection between camera and your phone? i have been using my new camera for a while and i would say that this segment of xt-4 is not so good. maybe i have high expectations, or maybe i am doing something wrong so it would be good to see what are your experiences. \n\nfor example, i can't update firmware for weeks because there is always something that interrupts the process. first of all the transfer is super slow even though i supposedly connected camera not only by bt but also by wifi. most common thing is that it starts transferring the update and camera suddenly turns off (stand by). lol sometimes it just says \"can't be blabla...retry\"\n\nalso similar is with other fujifilm app options. nothing is ever smooth. everything is so slow and it takes a century to use a simple functions. \n\napp is the latest update from play store. -----> location !!!  is enabled. i have a premium android phone. camera is xt-4.\n\nwhat am i doing wrong? or at least tell me if fujifilm is doing something wrong. someone definitely is.", "sortedWord": "None", "identifyer": 57626, "year": "2020"}, {"Unnamed: 0": 165985, "autor": "eranbeard", "date": 1585176054000, "content": "Help us document history with your photos /!/ I'm trying to compile an article for [Shotkit](https://shotkit.com) which shows the effects of Covid 19, as seen by the eyes of talented photographers from around the world.\n\nExamples: desolate landmarks, empty super market shelves, queues at chemists, social distancing in public, masks, etc etc\n\n**The more specific to the location, the better.**\n\nIf you have anything you'd like to submit, please send the image(s) as a Dropbox link to mark(at)shotkit(dot)com.\n\nFormat: JPEG, 580px on short edge, preferably landscape 3:2.\n\nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/fozvzc/help_us_document_history_with_your_photos/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help us document history with your photos /!/ i'm trying to compile an article for [shotkit](https://shotkit.com) which shows the effects of covid 19, as seen by the eyes of talented photographers from around the world.\n\nexamples: desolate landmarks, empty super market shelves, queues at chemists, social distancing in public, masks, etc etc\n\n**the more specific to the -----> location !!! , the better.**\n\nif you have anything you'd like to submit, please send the image(s) as a dropbox link to mark(at)shotkit(dot)com.\n\nformat: jpeg, 580px on short edge, preferably landscape 3:2.\n\nthanks", "sortedWord": "None", "identifyer": 57985, "year": "2020"}, {"Unnamed: 0": 168949, "autor": "LordNerdStark", "date": 1596179693000, "content": "Beginner looking for a camera: XT-20 vs X-T200? /!/ I’ve read articles and other threads about it. One thing I’ve noticed is most of you chose the X-T20 because of it’s dials. Is there really a huge difference? Because I see three dials in both (top panel) at the same location. Why is it a big deal for many? Thanks.", "link": "https://www.reddit.com/r/fujifilm/comments/i135uq/beginner_looking_for_a_camera_xt20_vs_xt200/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "beginner looking for a camera: xt-20 vs x-t200? /!/ i’ve read articles and other threads about it. one thing i’ve noticed is most of you chose the x-t20 because of it’s dials. is there really a huge difference? because i see three dials in both (top panel) at the same -----> location !!! . why is it a big deal for many? thanks.", "sortedWord": "None", "identifyer": 61062, "year": "2020"}, {"Unnamed: 0": 169838, "autor": "TwistedJake503", "date": 1605493374000, "content": "I used acros for the first time ever today and I think it worked for our family photos. XT-2 16-55 (Side note, taken at the location where One Flew Over The Cuckoo's Nest was filmed.)", "link": "https://www.reddit.com/r/fujifilm/comments/juyotx/i_used_acros_for_the_first_time_ever_today_and_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i used acros for the first time ever today and i think it worked for our family photos. xt-2 16-55 (side note, taken at the -----> location !!!  where one flew over the cuckoo's nest was filmed.)", "sortedWord": "None", "identifyer": 61979, "year": "2020"}, {"Unnamed: 0": 171852, "autor": "_dangerfoot", "date": 1608674162000, "content": "Lit on location", "link": "https://www.reddit.com/r/fujifilm/comments/kif1s2/lit_on_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "lit on -----> location !!! ", "sortedWord": "None", "identifyer": 64067, "year": "2020"}, {"Unnamed: 0": 173899, "autor": "freelancer01", "date": 1605439098000, "content": "Best Camera for Sports Videography /!/ I'm going to try and give you all as much information as I can give to help in asking for some advice as to what camera I should be looking at.\n\nIn a couple weeks time I will start covering several different sports here in my homeland. Locations will vary from indoor to outdoor stadiums as well as filming some player on green screen as well. For GFX packages. From time to time I will have sit down interviews with athletes too.\n\nThe matchday colour I would be filming would more than likely be slow motion (120fps) as this would complement the broadcast cameras of the event(s). I would then be on the sidelines filming little moments around a game, with some fan colour and manager vision as well. I guess given the potential range of sports and locations and time, some will be filmed indoors in some rather dark light settings as well - say for instance when athlete walks out onto the field.\n\nI have personally been using a Fuji XT30 for personal use and as I have become quite well acquainted with the menus I feel like my first port of call is looking at an XT4 - It does 10 bit 120fps, as well as 4k for when I'm shooting interviews.\n\nI can't seem to avoid the fact that every camerastore I visit, they always suggest the A7III. They seem to think the Autofocus tracking of athletes and capturing sports action is better suited to Sony - as well as having a better array of lenses too. One lovely fella said he'd pick the XT4 because of the increased video specs when it comes to filming slow motion and the Eterna colour too. My understanding is that despite the A7III being a couple years old it is still an outstanding camera to shoot video with.\n\nEverything I film will need be broadcast quality. Will be looking at a tripod too (so any suggestions welcome too!)\n\nThis won't just be for one particular sport - but I do want to ask...if a footballer(soccer) player, is running towards me - will the very nature of AF mean that I just need to frame the shot and the AF will track and refocus along the way?\n\nPS: I do want to shoot stills as well. :)\n\nLooking to use Black Friday to pickup something to set me on my way.", "link": "https://www.reddit.com/r/fujifilm/comments/jukejx/best_camera_for_sports_videography/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "best camera for sports videography /!/ i'm going to try and give you all as much information as i can give to help in asking for some advice as to what camera i should be looking at.\n\nin a couple weeks time i will start covering several different sports here in my homeland. -----> locations !!!  will vary from indoor to outdoor stadiums as well as filming some player on green screen as well. for gfx packages. from time to time i will have sit down interviews with athletes too.\n\nthe matchday colour i would be filming would more than likely be slow motion (120fps) as this would complement the broadcast cameras of the event(s). i would then be on the sidelines filming little moments around a game, with some fan colour and manager vision as well. i guess given the potential range of sports and locations and time, some will be filmed indoors in some rather dark light settings as well - say for instance when athlete walks out onto the field.\n\ni have personally been using a fuji xt30 for personal use and as i have become quite well acquainted with the menus i feel like my first port of call is looking at an xt4 - it does 10 bit 120fps, as well as 4k for when i'm shooting interviews.\n\ni can't seem to avoid the fact that every camerastore i visit, they always suggest the a7iii. they seem to think the autofocus tracking of athletes and capturing sports action is better suited to sony - as well as having a better array of lenses too. one lovely fella said he'd pick the xt4 because of the increased video specs when it comes to filming slow motion and the eterna colour too. my understanding is that despite the a7iii being a couple years old it is still an outstanding camera to shoot video with.\n\neverything i film will need be broadcast quality. will be looking at a tripod too (so any suggestions welcome too!)\n\nthis won't just be for one particular sport - but i do want to ask...if a footballer(soccer) player, is running towards me - will the very nature of af mean that i just need to frame the shot and the af will track and refocus along the way?\n\nps: i do want to shoot stills as well. :)\n\nlooking to use black friday to pickup something to set me on my way.", "sortedWord": "None", "identifyer": 66214, "year": "2020"}, {"Unnamed: 0": 174878, "autor": "coleburnz", "date": 1607068894000, "content": "[HELP] Fuji XT4 won't connect to Camera App on Android /!/ Has anyone with the Fuji XT4 managed to connect to their phone with an android phone? \n\nI  have tried it with the s9, s10 and s20 and it simply refused to work. i have managed to get the initial pairing done  but the phone won't connect. if i click on \"import images selected on camera\" i get the connecting message but nothing happens. No error messages, nothing!\n\nI  have bluetooth, WIFI and location  all turned on\n\nI am close to losing my mind, please help.", "link": "https://www.reddit.com/r/fujifilm/comments/k6gpsw/help_fuji_xt4_wont_connect_to_camera_app_on/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "[help] fuji xt4 won't connect to camera app on android /!/ has anyone with the fuji xt4 managed to connect to their phone with an android phone? \n\ni  have tried it with the s9, s10 and s20 and it simply refused to work. i have managed to get the initial pairing done  but the phone won't connect. if i click on \"import images selected on camera\" i get the connecting message but nothing happens. no error messages, nothing!\n\ni  have bluetooth, wifi and -----> location !!!   all turned on\n\ni am close to losing my mind, please help.", "sortedWord": "None", "identifyer": 67238, "year": "2020"}], "name": "locationfujifilm2020"}