{"interestingcomments": [{"Unnamed: 0": 206644, "autor": "loserboy", "date": 1528835731000, "content": "XT-2 liquid damage repair /!/ My XT2 took a dive in ocean water 2 weeks ago. Just the top portion of the camera was in the water and sand for less than .1 second. But it was enough to render camera inoperable. On/Off knob completely seized. I sent it in for repair along with 18-55 and estimates came out total of $2000(Not a typo) $1200 + tax and shipping for the body and $550+ tax and shipping for the lens. Reason being that they do not repair liquid damaged products. Instead, they replace it and those are the replacement cost for each item. \n\n I'm thinking its a good excuse to switching to Sony a7iii along with 24-70 f4. But I just love the fuji colors. It's bummers that they don't repair water damaged camera or at least offer a discount for replacement items. If it was 2/3 of the cost, I might have taken up on the offer. Oh well. Just wanted to share my repair experience with fujifilm NJ location.", "link": "https://www.reddit.com/r/fujifilm/comments/8qmeco/xt2_liquid_damage_repair/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "xt-2 liquid damage repair /!/ my xt2 took a dive in ocean water 2 weeks ago. just the top portion of the camera was in the water and sand for less than .1 second. but it was enough to render camera inoperable. on/off knob completely seized. i sent it in for repair along with 18-55 and estimates came out total of $2000(not a typo) $1200 + tax and shipping for the body and $550+ tax and shipping for the lens. reason being that they do not repair liquid damaged products. instead, they replace it and those are the replacement cost for each item. \n\n i'm thinking its a good excuse to switching to sony a7iii along with 24-70 f4. but i just love the fuji colors. it's bummers that they don't repair water damaged camera or at least offer a discount for replacement items. if it was 2/3 of the cost, i might have taken up on the offer. oh well. just wanted to share my repair experience with fujifilm nj -----> location !!! .", "sortedWord": "None", "identifyer": 165, "year": "2018"}, {"Unnamed: 0": 206741, "autor": "ravenhawk82", "date": 1519645626000, "content": "Nikon convert looking for suggestions /!/ I've shot Nikon for 10 years, but after buying a used X100S a while back and not shooting my D610 at all since then, I'm now looking to jump into the Fuji system and begin selling my Nikon gear.\n\nSome background: I primarily shoot landscapes and wide field astrophotography, with some street photography and casual portraits thrown in here and there. Currently, my bag usually contains a D610, a 35 f/1.8 (this lens is on the camera about 80% of the time), a 70-300VR, and a Tokina 16-28 f/2.8. It does everything I need, but after hiking a couple miles up a steep hill with that bag I'm about ready to throw it into a river. Now that tax returns are coming, I'm looking to make the jump and save my future self some back pain. Below is what I'm looking at to fill the roles of my current gear with something smaller and lighter, but I still have some questions and am open to other suggestions.\n\nBody: X-Pro2 - Pretty firm on this choice. Part practicality and part taste, I need an optical viewfinder. This is the reason I didn't jump to mirrorless cameras years ago. The EVFs are fantastic, and for most usage scenarios I have no problem using them exclusively. However, when it comes to shooting in a pitch black location in the middle of the night, it's nearly impossible to compose a shot with an EVF that is only resolving a handful of point sources from the brightest stars. I also just prefer seeing things optically, and especially with the histogram overlay in the X100S I find myself using the OVF in most cases.\n\nWide Angle: Samyang 12mm F2 or 10mm F2.8 - Here's a spot where I'm looking for some input. The wider angle of the 10 is appealing, but so is the faster optics and lighter weight of the 12. I'm currently leaning toward the 12, but I'm curious what others think. Manual focus is fine, this lens will be used mostly at night when autofocus stops being useful anyway. I was considering the Fuji 10-24 for a while, but its coma and lower speed along with higher cost made it less appealing.\n\nGeneral purpose: Fuji XF23mm f/2 - This would fill the role of my 35 f1.8, which is the lens I use the vast majority of the time anyway. I've also been eyeing the larger f1.4 version and am not opposed to saving a bit more if it's worth it, but as a lens that'll be going everywhere with me I think that the weather resistance will come in the more useful than the extra speed.\n\nTelephoto: Fuji XF55-200 or XC50-230 - Another spot where I'm having trouble deciding. For those of you who have tried them, is the aperture ring and build quality of the XF worth the drastic cost increase? This lens would get the least use of the three, but I don't want to give up on image quality if I'm already springing for an X-Pro2. Thoughts on this one? \n\n\nI'm open to suggestions on any of these. I think I've done enough research to have a good idea of what I'm getting into, but as with any big purchase I'd like to get a second opinion from those with experience before pulling the trigger.", "link": "https://www.reddit.com/r/fujifilm/comments/80cgfd/nikon_convert_looking_for_suggestions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "nikon convert looking for suggestions /!/ i've shot nikon for 10 years, but after buying a used x100s a while back and not shooting my d610 at all since then, i'm now looking to jump into the fuji system and begin selling my nikon gear.\n\nsome background: i primarily shoot landscapes and wide field astrophotography, with some street photography and casual portraits thrown in here and there. currently, my bag usually contains a d610, a 35 f/1.8 (this lens is on the camera about 80% of the time), a 70-300vr, and a tokina 16-28 f/2.8. it does everything i need, but after hiking a couple miles up a steep hill with that bag i'm about ready to throw it into a river. now that tax returns are coming, i'm looking to make the jump and save my future self some back pain. below is what i'm looking at to fill the roles of my current gear with something smaller and lighter, but i still have some questions and am open to other suggestions.\n\nbody: x-pro2 - pretty firm on this choice. part practicality and part taste, i need an optical viewfinder. this is the reason i didn't jump to mirrorless cameras years ago. the evfs are fantastic, and for most usage scenarios i have no problem using them exclusively. however, when it comes to shooting in a pitch black -----> location !!!  in the middle of the night, it's nearly impossible to compose a shot with an evf that is only resolving a handful of point sources from the brightest stars. i also just prefer seeing things optically, and especially with the histogram overlay in the x100s i find myself using the ovf in most cases.\n\nwide angle: samyang 12mm f2 or 10mm f2.8 - here's a spot where i'm looking for some input. the wider angle of the 10 is appealing, but so is the faster optics and lighter weight of the 12. i'm currently leaning toward the 12, but i'm curious what others think. manual focus is fine, this lens will be used mostly at night when autofocus stops being useful anyway. i was considering the fuji 10-24 for a while, but its coma and lower speed along with higher cost made it less appealing.\n\ngeneral purpose: fuji xf23mm f/2 - this would fill the role of my 35 f1.8, which is the lens i use the vast majority of the time anyway. i've also been eyeing the larger f1.4 version and am not opposed to saving a bit more if it's worth it, but as a lens that'll be going everywhere with me i think that the weather resistance will come in the more useful than the extra speed.\n\ntelephoto: fuji xf55-200 or xc50-230 - another spot where i'm having trouble deciding. for those of you who have tried them, is the aperture ring and build quality of the xf worth the drastic cost increase? this lens would get the least use of the three, but i don't want to give up on image quality if i'm already springing for an x-pro2. thoughts on this one? \n\n\ni'm open to suggestions on any of these. i think i've done enough research to have a good idea of what i'm getting into, but as with any big purchase i'd like to get a second opinion from those with experience before pulling the trigger.", "sortedWord": "None", "identifyer": 262, "year": "2018"}, {"Unnamed: 0": 206854, "autor": "BNoog", "date": 1515292997000, "content": "Good price to buy an XPRO1 and location? /!/ I heard that they can be found in ex condition for under $400 but I have yet to find any besides sketchbay. Any suggestions?", "link": "https://www.reddit.com/r/fujifilm/comments/7onzl9/good_price_to_buy_an_xpro1_and_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "good price to buy an xpro1 and -----> location !!! ? /!/ i heard that they can be found in ex condition for under $400 but i have yet to find any besides sketchbay. any suggestions?", "sortedWord": "None", "identifyer": 376, "year": "2018"}, {"Unnamed: 0": 207116, "autor": "KaususSD", "date": 1539454761000, "content": "First post: Graduating from D5500 to an XT2 soon! /!/ First off, hello! First time here and I hope to gauge some information. I am currently an owner of a Nikon D5500 and it has served me quite well the past two years. It's gotten me back into photography. While it's fine for what I do, I have been feeling the sting of no weather resistant. I do Cosplay Photography so I end up shooting in a variety of locations, temperatures and weather conditions. My current camera has suffered with colder temps, 32F being a noticeable cut-off. \n\nThe XT2 is attractive as I enjoy the APS-C factor and the weather resistance is a key selling point for me. That being said I've done quite a bit of research and generally the consensus is that it's a superb still shooter and has excellent video capabilities (which really isn't a priority for me). I've also heard good things about it's included 18-55 2.8-4 lens so that's a nice thing to hear. \n\nI just wanted to know some thoughts from owners of this camera and your experiences with it for portraits! ", "link": "https://www.reddit.com/r/fujifilm/comments/9nvx9n/first_post_graduating_from_d5500_to_an_xt2_soon/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "first post: graduating from d5500 to an xt2 soon! /!/ first off, hello! first time here and i hope to gauge some information. i am currently an owner of a nikon d5500 and it has served me quite well the past two years. it's gotten me back into photography. while it's fine for what i do, i have been feeling the sting of no weather resistant. i do cosplay photography so i end up shooting in a variety of -----> locations !!! , temperatures and weather conditions. my current camera has suffered with colder temps, 32f being a noticeable cut-off. \n\nthe xt2 is attractive as i enjoy the aps-c factor and the weather resistance is a key selling point for me. that being said i've done quite a bit of research and generally the consensus is that it's a superb still shooter and has excellent video capabilities (which really isn't a priority for me). i've also heard good things about it's included 18-55 2.8-4 lens so that's a nice thing to hear. \n\ni just wanted to know some thoughts from owners of this camera and your experiences with it for portraits! ", "sortedWord": "None", "identifyer": 641, "year": "2018"}, {"Unnamed: 0": 207317, "autor": "smendrzy", "date": 1530977425000, "content": "2018 Fujifilm Festival /!/ The logo on the Fujifilm Festival page was updated to show this year’s dates &amp; location:  Oct 5-7 in Venice Beach, CA. [Fujifilm Festival ](https://www.fujifilmfestival.com)", "link": "https://www.reddit.com/r/fujifilm/comments/8wty3w/2018_fujifilm_festival/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "2018 fujifilm festival /!/ the logo on the fujifilm festival page was updated to show this year’s dates &amp; -----> location !!! :  oct 5-7 in venice beach, ca. [fujifilm festival ](https://www.fujifilmfestival.com)", "sortedWord": "None", "identifyer": 843, "year": "2018"}, {"Unnamed: 0": 207698, "autor": "DanieloBolo", "date": 1541168981000, "content": "Fuji Wedding 101 /!/ Originally posted on r/WeddingPhotography\n\nI Hope I am not double dipping here but if I am and need to remove this post, let me know!\n\n&amp;#x200B;\n\n(Why I posted it here: I am 100% Fuji Gear and perhaps our community has some tips/tricks that are special to Fuji Cameras or Lenses.)\n\n&amp;#x200B;\n\nTL;DR: Friend has asked me to take her wedding portraits because she didn't like what her paid photographer did and I need some advice.\n\nI guess the TL;DR covers it so I won't go into much details.\n\nMy Background: I have done plenty of studio photography but not much outdoors. Some samples: [https://www.instagram.com/danielobolo/](https://www.instagram.com/danielobolo/)\n\nGear: X-T3 / X-T2 / 56mmF1.2 / 18-55mm2.8-4 / 50-140mmF2 / AB800 strobe light / Beauty Dish with soft cover / Large Gold/Silver/White Reflector / Battery power.\n\nLocation: [https://www.hiltonelconquistador.com](https://www.hiltonelconquistador.com/)\n\nThe Job: She wants picture showing her long dress train on a grassy field and showing her open back. She wan't close ups of her showing her makeup/hair and bouquet. Pictures of her and him close up and wide views. It will be just him and her on location.\n\nI guess where I need some help is perhaps some How-To's or words of advice or perhaps some samples and how they were created. Maybe some quick advices like, should I bring a step stool or ladder. Would a single flash be enough, etc.\n\nI have a tremendous respect for photographers and the business. I am not a professional. But neither I am just a dude with a camera. Help!", "link": "https://www.reddit.com/r/fujifilm/comments/9tkl2a/fuji_wedding_101/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji wedding 101 /!/ originally posted on r/weddingphotography\n\ni hope i am not double dipping here but if i am and need to remove this post, let me know!\n\n&amp;#x200b;\n\n(why i posted it here: i am 100% fuji gear and perhaps our community has some tips/tricks that are special to fuji cameras or lenses.)\n\n&amp;#x200b;\n\ntl;dr: friend has asked me to take her wedding portraits because she didn't like what her paid photographer did and i need some advice.\n\ni guess the tl;dr covers it so i won't go into much details.\n\nmy background: i have done plenty of studio photography but not much outdoors. some samples: [https://www.instagram.com/danielobolo/](https://www.instagram.com/danielobolo/)\n\ngear: x-t3 / x-t2 / 56mmf1.2 / 18-55mm2.8-4 / 50-140mmf2 / ab800 strobe light / beauty dish with soft cover / large gold/silver/white reflector / battery power.\n\n-----> location !!! : [https://www.hiltonelconquistador.com](https://www.hiltonelconquistador.com/)\n\nthe job: she wants picture showing her long dress train on a grassy field and showing her open back. she wan't close ups of her showing her makeup/hair and bouquet. pictures of her and him close up and wide views. it will be just him and her on location.\n\ni guess where i need some help is perhaps some how-to's or words of advice or perhaps some samples and how they were created. maybe some quick advices like, should i bring a step stool or ladder. would a single flash be enough, etc.\n\ni have a tremendous respect for photographers and the business. i am not a professional. but neither i am just a dude with a camera. help!", "sortedWord": "None", "identifyer": 1225, "year": "2018"}], "name": "locationfujifilm2018"}