{"interestingcomments": [{"Unnamed: 0": 192638, "autor": "atwalveron", "date": 1614216462000, "content": "Help me pick? /!/ I’m struggling to pick a Fuji camera because they all look great but I’m not sure if they are right for my use case. \n\nI plan to primarily use the camera for (1) looking awesome in video calls and (2) for some beginner photography of mainly my kids and scenery on our trips. \n\nI have a used X-A7 on order from Amazon that cost like $540 after tax. It seems I’m not buying at a good time since there don’t seem to be many sales. I was looking at the XT-200, x100v and the X-E4 as well. I’m all over the map. \n\nI have serious FOMO because I’m relying on YouTube reviews and articles I can find online. \n\nFor my use case, can I get away with something cheaper that I can use with a cheap capture card even if I can’t use Fuji’s webcam software?\n\nPrice considerations...I’ll pay to get the best bang for my buck but obviously will be happy to spend $200 if it will be a great, easy to use webcam so I can have that great bokeh on zoom. Trying to keep it at my wife won’t kill me prices if she ever finds the receipt (under $600?) \n\nPlease Fujifilm enthusiasts, help me pick.", "link": "https://www.reddit.com/r/fujifilm/comments/lrtidu/help_me_pick/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "help me pick? /!/ i’m struggling to pick a fuji camera because they all look great but i’m not sure if they are right for my use case. \n\ni plan to primarily use the camera for (1) looking awesome in video calls and (2) for some beginner photography of mainly my kids and scenery on our trips. \n\ni have a used x-a7 on order from amazon that cost like $540 after tax. it seems i’m not buying at a good time since there don’t seem to be many sales. i was looking at the xt-200, x100v and the x-e4 as well. i’m all over the -----> map !!! . \n\ni have serious fomo because i’m relying on youtube reviews and articles i can find online. \n\nfor my use case, can i get away with something cheaper that i can use with a cheap capture card even if i can’t use fuji’s webcam software?\n\nprice considerations...i’ll pay to get the best bang for my buck but obviously will be happy to spend $200 if it will be a great, easy to use webcam so i can have that great bokeh on zoom. trying to keep it at my wife won’t kill me prices if she ever finds the receipt (under $600?) \n\nplease fujifilm enthusiasts, help me pick.", "sortedWord": "None", "identifyer": 85471, "year": "2021"}, {"Unnamed: 0": 194362, "autor": "TyBoogie", "date": 1627427537000, "content": "Hit a creative rut. So I've stylized my street photos using a depth map. (X100v &amp; XT3)", "link": "https://www.reddit.com/r/fujifilm/comments/osxlfs/hit_a_creative_rut_so_ive_stylized_my_street/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "hit a creative rut. so i've stylized my street photos using a depth -----> map !!! . (x100v &amp; xt3)", "sortedWord": "None", "identifyer": 87264, "year": "2021"}, {"Unnamed: 0": 194396, "autor": "imChopBustin", "date": 1626985228000, "content": "Made a little upgrade from the XT series.. Shoutout to Map Camera Japan on Ebay. Got to North Carolina in 3 days, free shipping.", "link": "https://www.reddit.com/r/fujifilm/comments/opm73l/made_a_little_upgrade_from_the_xt_series_shoutout/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "made a little upgrade from the xt series.. shoutout to -----> map !!!  camera japan on ebay. got to north carolina in 3 days, free shipping.", "sortedWord": "None", "identifyer": 87310, "year": "2021"}, {"Unnamed: 0": 195503, "autor": "Irlut", "date": 1620391899000, "content": "X100V screen/viewfinder switching /!/ I recently got an X100V and am overall very happy with it but I can't seem to figure out how to make the camera use the viewfinder (glass or electronic) to capture images but to show the menu and picture preview on the back screen. Basically I only want the back screen to be on when looking at the menu or previously taken images. I never use it to take pictures and running it is a waste of battery. I know I can manually switch this by mapping a button to switch display modes, but then I have to cycle through a bunch of different modes so it's fairly cumbersome. \n\nI've played around with the viewfinder settings but I can't seem to find a combination that does what I want. Has anyone managed to set their camera up this way?", "link": "https://www.reddit.com/r/fujifilm/comments/n6xriq/x100v_screenviewfinder_switching/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "mapping", "selectorShort": "map", "MarkedSent": "x100v screen/viewfinder switching /!/ i recently got an x100v and am overall very happy with it but i can't seem to figure out how to make the camera use the viewfinder (glass or electronic) to capture images but to show the menu and picture preview on the back screen. basically i only want the back screen to be on when looking at the menu or previously taken images. i never use it to take pictures and running it is a waste of battery. i know i can manually switch this by -----> mapping !!!  a button to switch display modes, but then i have to cycle through a bunch of different modes so it's fairly cumbersome. \n\ni've played around with the viewfinder settings but i can't seem to find a combination that does what i want. has anyone managed to set their camera up this way?", "sortedWord": "None", "identifyer": 88466, "year": "2021"}, {"Unnamed: 0": 197419, "autor": "inverse_squared", "date": 1630605936000, "content": "Fujifilm's new G-mount lens map shows GF 20-35mm lens expected in 2022 and GF 55mm f/1.7 expected in 2023, along with a new tilt-shift lens", "link": "https://www.reddit.com/r/fujifilm/comments/pgn8xa/fujifilms_new_gmount_lens_map_shows_gf_2035mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "fujifilm's new g-mount lens -----> map !!!  shows gf 20-35mm lens expected in 2022 and gf 55mm f/1.7 expected in 2023, along with a new tilt-shift lens", "sortedWord": "None", "identifyer": 90460, "year": "2021"}, {"Unnamed: 0": 197420, "autor": "inverse_squared", "date": 1630605869000, "content": "Fujifilm's new G-mount lens map shows new GF 20-35mm lens expected in 2022 and GF 55mm f/1.7 expected in 2023, along with a new tilt-shift lens in 2023", "link": "https://www.reddit.com/r/fujifilm/comments/pgn85s/fujifilms_new_gmount_lens_map_shows_new_gf_2035mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "fujifilm's new g-mount lens -----> map !!!  shows new gf 20-35mm lens expected in 2022 and gf 55mm f/1.7 expected in 2023, along with a new tilt-shift lens in 2023", "sortedWord": "None", "identifyer": 90461, "year": "2021"}, {"Unnamed: 0": 197423, "autor": "inverse_squared", "date": 1630602697000, "content": "Fujifilm's new X-mount lens map shows XF 150-600mm and XF 18-120mm lenses expected in 2022", "link": "https://www.reddit.com/r/fujifilm/comments/pgm6q4/fujifilms_new_xmount_lens_map_shows_xf_150600mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "fujifilm's new x-mount lens -----> map !!!  shows xf 150-600mm and xf 18-120mm lenses expected in 2022", "sortedWord": "None", "identifyer": 90464, "year": "2021"}, {"Unnamed: 0": 197424, "autor": "inverse_squared", "date": 1630602644000, "content": "Fujifilm's new X-mount lens map shows XF 150-600mm and XF 18-200mm lenses expected in 2022", "link": "https://www.reddit.com/r/fujifilm/comments/pgm62c/fujifilms_new_xmount_lens_map_shows_xf_150600mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "fujifilm's new x-mount lens -----> map !!!  shows xf 150-600mm and xf 18-200mm lenses expected in 2022", "sortedWord": "None", "identifyer": 90465, "year": "2021"}, {"Unnamed: 0": 202450, "autor": "spideralex90", "date": 1634964444000, "content": "Any way to map custom 4K video settings to the quick menu on XT3? /!/ Hi all! Just got an XT3 and have been playing with it. I was able to map the Full HD highspeed switch to a custom button but I was wondering if there was any way to map custom frame rates in 4K to the quick menu? I'd love to be able to switch between 24 and 60 FPS in 4K more quickly than diving into the full menu and not have to adjust the shutter speed.", "link": "https://www.reddit.com/r/fujifilm/comments/qdy1t0/any_way_to_map_custom_4k_video_settings_to_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "any way to -----> map !!!  custom 4k video settings to the quick menu on xt3? /!/ hi all! just got an xt3 and have been playing with it. i was able to map the full hd highspeed switch to a custom button but i was wondering if there was any way to map custom frame rates in 4k to the quick menu? i'd love to be able to switch between 24 and 60 fps in 4k more quickly than diving into the full menu and not have to adjust the shutter speed.", "sortedWord": "None", "identifyer": 95760, "year": "2021"}, {"Unnamed: 0": 203115, "autor": "bearcat--", "date": 1631065034000, "content": "X-E4 - possible to map using joystick button to centre focus point? /!/ Hi! I just got X-E4 and wondering...how the hell do you use joystick  to recentre the focus point? in all the X series prior, double clicking  the joystick would centre the focus point, but instead it is a zoom.\n\nsecond question - am i able to re-map the zoom to another button? I  know one of the downfalls is lack of buttons for customization and I  seem to be experiencing it here perhaps.\n\nThank you in advance. any tips appreciated!", "link": "https://www.reddit.com/r/fujifilm/comments/pk0sza/xe4_possible_to_map_using_joystick_button_to/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "x-e4 - possible to -----> map !!!  using joystick button to centre focus point? /!/ hi! i just got x-e4 and wondering...how the hell do you use joystick  to recentre the focus point? in all the x series prior, double clicking  the joystick would centre the focus point, but instead it is a zoom.\n\nsecond question - am i able to re-map the zoom to another button? i  know one of the downfalls is lack of buttons for customization and i  seem to be experiencing it here perhaps.\n\nthank you in advance. any tips appreciated!", "sortedWord": "None", "identifyer": 96448, "year": "2021"}], "name": "mapfujifilm2021"}