{"interestingcomments": [{"Unnamed: 0": 228949, "autor": "Kool_V", "date": 1556952069000, "content": "Front dial mapping issue X-T20 /!/ So I did a settings reset and somehow I lost the ability to map the front dial button. On the Fn/AE-L/AF-L Button Setting the F-Dial does not appear anymore. Please help.", "link": "https://www.reddit.com/r/fujifilm/comments/bkievi/front_dial_mapping_issue_xt20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "front dial mapping issue x-t20 /!/ so i did a settings reset and somehow i lost the ability to -----> map !!!  the front dial button. on the fn/ae-l/af-l button setting the f-dial does not appear anymore. please help.", "sortedWord": "None", "identifyer": 23845, "year": "2019"}, {"Unnamed: 0": 231520, "autor": "MoreThanLuck", "date": 1575757295000, "content": "New to the X-Pro line, got a few questions. /!/ Hey guys, long time Fuji shooter here, but just getting into the X-Pro line with the X-Pro3. Had a few questions about the system I was hoping someone more experienced with it could answer.\n\n\n1. Any way to reduce the processing time for single shots? On my X-H1, there's very little delay in processing in single shot mode. I'm using a UHS-II card. When I flip into high-speed continuous shooting, the processing buffer happens in the background, rather than showing the \"Processing\" screen like single shot mode does. Any way to change this?\n\n2. Is it possible to map the shutter speed to the front command dial? Right now it's mapped to the back, and nothing is mapped to the front. Not sure how to swap those, though.\n\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/e7kwvw/new_to_the_xpro_line_got_a_few_questions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "new to the x-pro line, got a few questions. /!/ hey guys, long time fuji shooter here, but just getting into the x-pro line with the x-pro3. had a few questions about the system i was hoping someone more experienced with it could answer.\n\n\n1. any way to reduce the processing time for single shots? on my x-h1, there's very little delay in processing in single shot mode. i'm using a uhs-ii card. when i flip into high-speed continuous shooting, the processing buffer happens in the background, rather than showing the \"processing\" screen like single shot mode does. any way to change this?\n\n2. is it possible to -----> map !!!  the shutter speed to the front command dial? right now it's mapped to the back, and nothing is mapped to the front. not sure how to swap those, though.\n\n\nthanks!", "sortedWord": "None", "identifyer": 26493, "year": "2019"}], "name": "mapfujifilm2019"}