{"interestingcomments": [{"Unnamed: 0": 206752, "autor": "damshawty", "date": 1519151634000, "content": "tripod question /!/ Hey guys so i am looking for a tripod for my xt2, my question is that if i want to shoot on the tripod vertically (the camera's orientation is vertical) do i need a special mount or something for the xt2 body? Or are some tripods capable of that? \n\ni was looking at this one on amazon;\nhttps://www.amazon.com/ZOMEI-ZM-HR-555-BLUE-01-Lightweight-Aluminum-Panasonic/dp/B074W4PNY3/ref=sr_1_4?ie=UTF8&amp;qid=1519143816&amp;sr=8-4&amp;keywords=tripod+fuji\n\nplease let me know and feel free to suggest me tripods that you all enjoy as well! Thanks", "link": "https://www.reddit.com/r/fujifilm/comments/7yy86g/tripod_question/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "tripod question /!/ hey guys so i am looking for a tripod for my xt2, my question is that if i want to shoot on the tripod vertically (the camera's -----> orientation !!!  is vertical) do i need a special mount or something for the xt2 body? or are some tripods capable of that? \n\ni was looking at this one on amazon;\nhttps://www.amazon.com/zomei-zm-hr-555-blue-01-lightweight-aluminum-panasonic/dp/b074w4pny3/ref=sr_1_4?ie=utf8&amp;qid=1519143816&amp;sr=8-4&amp;keywords=tripod+fuji\n\nplease let me know and feel free to suggest me tripods that you all enjoy as well! thanks", "sortedWord": "None", "identifyer": 273, "year": "2018"}, {"Unnamed: 0": 206971, "autor": "French_Syd", "date": 1521418002000, "content": "XF 55-200 zoom ring /!/ Hi! I have a quick question about this lens, is the zoom ring supposed to be tight? I read in reviews it's supposed to be dampened and tight to avoid zoom creep, but on mine, when pointed downside it barely stays still. A very light push would move it. Is it normal, related to its weight, or should it still be hard to zoom in?\n\nI also noticed a slight noise like something moving 1 or 2 mm inside and touching another part of the barrel, when I rotate it from a horizontal orientation to downside. Again, due to gravity and its weight or something that should worry me?\n\nI'm really unexperienced with big lenses like this one, it's the first time I buy one of these, I'd rather ask here and be sure I get the best product for what I pay, since I can still send this one back and get one of the newest ones that will be delivered soon in the shops of my city (the one I have now has been made in Q4 2017 and was the last one available in the shop, also worried that someone returned it, since it was the last one to be sold and the box was a bit scratched)\n\nAm I being too paranoiac?\n\n\n\nTL;DR: \n\n1) zoom ring not as tight as expected \n2) small sound when rotating the lens from horizontal to vertical (pointed at the ground)\n", "link": "https://www.reddit.com/r/fujifilm/comments/85fdfm/xf_55200_zoom_ring/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "xf 55-200 zoom ring /!/ hi! i have a quick question about this lens, is the zoom ring supposed to be tight? i read in reviews it's supposed to be dampened and tight to avoid zoom creep, but on mine, when pointed downside it barely stays still. a very light push would move it. is it normal, related to its weight, or should it still be hard to zoom in?\n\ni also noticed a slight noise like something moving 1 or 2 mm inside and touching another part of the barrel, when i rotate it from a horizontal -----> orientation !!!  to downside. again, due to gravity and its weight or something that should worry me?\n\ni'm really unexperienced with big lenses like this one, it's the first time i buy one of these, i'd rather ask here and be sure i get the best product for what i pay, since i can still send this one back and get one of the newest ones that will be delivered soon in the shops of my city (the one i have now has been made in q4 2017 and was the last one available in the shop, also worried that someone returned it, since it was the last one to be sold and the box was a bit scratched)\n\nam i being too paranoiac?\n\n\n\ntl;dr: \n\n1) zoom ring not as tight as expected \n2) small sound when rotating the lens from horizontal to vertical (pointed at the ground)\n", "sortedWord": "None", "identifyer": 493, "year": "2018"}, {"Unnamed: 0": 207204, "autor": "jayr5978", "date": 1536582045000, "content": "Fujifilm Camera Remote transferred photo orientation /!/ Hi All,\n\nNew Fujifilm X-T2 owner here. When I send photos to my Galaxy S9+ taken with the X-T2 in portrait orientation, the photos appear in the gallery rotated 90 degrees. When I use the crop/rotate tool in the gallery app, the photo appears in the correct orientation and I am not allowed to save it because I've not made any changes to it. I've tried a 3rd party gallery app (Focus Go) and it does the reverse (photo has correct orientation in the gallery view but opening the photo shows it rotated 90 degrees). This is incredibly frustrating and all my Googling for anything on this issue comes up blank, so I'm assuming I am doing something wrong. \n\nHas anyone else seen this problem? FYI, photos transferred to my wife's iPhone 8 with no problem and have the correct orientation in both gallery and image viewer.", "link": "https://www.reddit.com/r/fujifilm/comments/9emlmx/fujifilm_camera_remote_transferred_photo/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "fujifilm camera remote transferred photo -----> orientation !!!  /!/ hi all,\n\nnew fujifilm x-t2 owner here. when i send photos to my galaxy s9+ taken with the x-t2 in portrait orientation, the photos appear in the gallery rotated 90 degrees. when i use the crop/rotate tool in the gallery app, the photo appears in the correct orientation and i am not allowed to save it because i've not made any changes to it. i've tried a 3rd party gallery app (focus go) and it does the reverse (photo has correct orientation in the gallery view but opening the photo shows it rotated 90 degrees). this is incredibly frustrating and all my googling for anything on this issue comes up blank, so i'm assuming i am doing something wrong. \n\nhas anyone else seen this problem? fyi, photos transferred to my wife's iphone 8 with no problem and have the correct orientation in both gallery and image viewer.", "sortedWord": "None", "identifyer": 729, "year": "2018"}], "name": "orientationfujifilm2018"}