{"interestingcomments": [{"Unnamed: 0": 231239, "autor": "twinu89", "date": 1549968121000, "content": "What travel tripod would you recommend that can well support a Fujinon XF 55-200? /!/  \n\nI currently have a Benro iSmart ISO5, which was incredible for most other XF lenses, until I got the XF 55-200. The ball head doesn't lock into place sometimes, especially if I try portrait orientation with this lens.\n\nI would also like something which is comparable in tripod weight (the Benro is only 0.92 kg) and can support at least 4 kg. Plus, I use a metal grip L-bracket (like [this](https://www.amazon.com/Meike-Aluminum-Release-Bracket-Fujifilm/dp/B0759MTK61)) with my Fuji X-T20, so it would be great to have Arca Swiss plate so I don't have to attach a plate every time I want to use the tripod.\n\nThanks, everyone.", "link": "https://www.reddit.com/r/fujifilm/comments/aps38m/what_travel_tripod_would_you_recommend_that_can/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "what travel tripod would you recommend that can well support a fujinon xf 55-200? /!/  \n\ni currently have a benro ismart iso5, which was incredible for most other xf lenses, until i got the xf 55-200. the ball head doesn't lock into place sometimes, especially if i try portrait -----> orientation !!!  with this lens.\n\ni would also like something which is comparable in tripod weight (the benro is only 0.92 kg) and can support at least 4 kg. plus, i use a metal grip l-bracket (like [this](https://www.amazon.com/meike-aluminum-release-bracket-fujifilm/dp/b0759mtk61)) with my fuji x-t20, so it would be great to have arca swiss plate so i don't have to attach a plate every time i want to use the tripod.\n\nthanks, everyone.", "sortedWord": "None", "identifyer": 26208, "year": "2019"}, {"Unnamed: 0": 233312, "autor": "StopEatingShoes", "date": 1553888368000, "content": "How can I unlock the \"image rotate\" option in the playback menu? /!/ As the title says, does anyone know? The option on my camera is greyed out.\n\nI have an X-T20 and I'm trying to print photos to Instax S-P2 but the normal orientation of how you would take portraits on the camera is printed upside down on the film.\n\nIt would be great if I would be able to rotate the photo in the camera before printing.\n", "link": "https://www.reddit.com/r/fujifilm/comments/b71ow1/how_can_i_unlock_the_image_rotate_option_in_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "how can i unlock the \"image rotate\" option in the playback menu? /!/ as the title says, does anyone know? the option on my camera is greyed out.\n\ni have an x-t20 and i'm trying to print photos to instax s-p2 but the normal -----> orientation !!!  of how you would take portraits on the camera is printed upside down on the film.\n\nit would be great if i would be able to rotate the photo in the camera before printing.\n", "sortedWord": "None", "identifyer": 28341, "year": "2019"}], "name": "orientationfujifilm2019"}