{"interestingcomments": [{"Unnamed: 0": 192773, "autor": "KevinGT", "date": 1611892310000, "content": "How to rotate video orientation natively on X-T4? /!/ I am new to the Fujifilm systems. I am using X-T4 to shoot video, with the lens pointing down to my desk surface. Because I use a tripod with a hanging arm from the back of the desk, the video I got is reversed. I could rotate the video in the post, but I want the direct output to be in the correct orientation. I tried to rotate in the viewing mode but it only works on stills. Any ideas? Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/l7iduw/how_to_rotate_video_orientation_natively_on_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "how to rotate video -----> orientation !!!  natively on x-t4? /!/ i am new to the fujifilm systems. i am using x-t4 to shoot video, with the lens pointing down to my desk surface. because i use a tripod with a hanging arm from the back of the desk, the video i got is reversed. i could rotate the video in the post, but i want the direct output to be in the correct orientation. i tried to rotate in the viewing mode but it only works on stills. any ideas? thanks!", "sortedWord": "None", "identifyer": 85608, "year": "2021"}, {"Unnamed: 0": 192856, "autor": "datboilewinsker", "date": 1611669358000, "content": "Deleted my previous post because of an image orientation issue. Just picked up the laowa 65 mm f/2.8! Lots to learn but figured I'd post some of these preliminary shots in case anyone was interested :) taken on an xt30 and sadly the rolex is not mine :(", "link": "https://www.reddit.com/r/fujifilm/comments/l5egm6/deleted_my_previous_post_because_of_an_image/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "deleted my previous post because of an image -----> orientation !!!  issue. just picked up the laowa 65 mm f/2.8! lots to learn but figured i'd post some of these preliminary shots in case anyone was interested :) taken on an xt30 and sadly the rolex is not mine :(", "sortedWord": "None", "identifyer": 85701, "year": "2021"}, {"Unnamed: 0": 193451, "autor": "AthenaSynx", "date": 1632774155000, "content": "Fuji X-T4: Tracking in portrait mode /!/ Good Evening,\n\nI recently bought the X-T4 and I'm overall very pleased with it, however I stumbled over an \"issue\" where the camera tracks objects perfectly in normal orientation but as soon as I tilt it into the portrait mode the autofocus square is locked in the center.\n\nIs there a way to use the tracking in portrait mode too?\n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/pwpogx/fuji_xt4_tracking_in_portrait_mode/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "fuji x-t4: tracking in portrait mode /!/ good evening,\n\ni recently bought the x-t4 and i'm overall very pleased with it, however i stumbled over an \"issue\" where the camera tracks objects perfectly in normal -----> orientation !!!  but as soon as i tilt it into the portrait mode the autofocus square is locked in the center.\n\nis there a way to use the tracking in portrait mode too?\n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "identifyer": 86321, "year": "2021"}, {"Unnamed: 0": 200502, "autor": "REatx", "date": 1620003235000, "content": "Is it possible to use an iPhone as a monitor without using the horrible Fujiapp? Xs10 /!/ Hi all. I’m new to this community. I just bought an xs10 a few days ago. My first cam was a small point and shoot Sony rx100 vi, which was a pretty good starter cam. When I used that cam for video I would Use my phone as an external monitor by using the Sony app, it worked out pretty great. \n\nI just tried to do the same with the Fuji app and my iPhone and learned quickly that it will not do landscape!!!! Eeek!! Is there a way that I can plug in my iPhone to use as a monitor with landscape orientation? I would super appreciate any guidance or help that this community might have. Thank you in advance!!!", "link": "https://www.reddit.com/r/fujifilm/comments/n3k8fj/is_it_possible_to_use_an_iphone_as_a_monitor/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "is it possible to use an iphone as a monitor without using the horrible fujiapp? xs10 /!/ hi all. i’m new to this community. i just bought an xs10 a few days ago. my first cam was a small point and shoot sony rx100 vi, which was a pretty good starter cam. when i used that cam for video i would use my phone as an external monitor by using the sony app, it worked out pretty great. \n\ni just tried to do the same with the fuji app and my iphone and learned quickly that it will not do landscape!!!! eeek!! is there a way that i can plug in my iphone to use as a monitor with landscape -----> orientation !!! ? i would super appreciate any guidance or help that this community might have. thank you in advance!!!", "sortedWord": "None", "identifyer": 93719, "year": "2021"}, {"Unnamed: 0": 202979, "autor": "s049031", "date": 1632269062000, "content": "Possible IBIS/Autofocus Issues (x-t4/18-55 kit) /!/ I've had this brand new camera since March, 2021.\n\nAbout a week ago, I noticed a whirring sound, almost like the autofocus was failing to focus.\n\nMainly happens when I turn it on or when I zoom out all the way. Below is orientation while zooming in and out.\n\nWhen I hold the camera:\n\n* Left side down - works normal\n* Upside-down - works normal\n* Right side down - works normal\n* Normal side down - whirring noise (gets worse if I rotate the camera to the right)\n\nIf I rotate the camera to the left, before the error message appears, I can use the camera as normal. But I have to do this anytime I start hearing the noise. The error message asks me to \"turn the camera off and back on\".\n\njust wanted to see if anyone else had a similar issue. Unfortunately, I only have one lens, so I can't test and see if it's the lens or the body itself. Factory reset and Firmware didn't change anything, as I'm already on the latest version.\n\nI'm assuming it's either IBIS or autofocus.", "link": "https://www.reddit.com/r/fujifilm/comments/psvipl/possible_ibisautofocus_issues_xt41855_kit/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "possible ibis/autofocus issues (x-t4/18-55 kit) /!/ i've had this brand new camera since march, 2021.\n\nabout a week ago, i noticed a whirring sound, almost like the autofocus was failing to focus.\n\nmainly happens when i turn it on or when i zoom out all the way. below is -----> orientation !!!  while zooming in and out.\n\nwhen i hold the camera:\n\n* left side down - works normal\n* upside-down - works normal\n* right side down - works normal\n* normal side down - whirring noise (gets worse if i rotate the camera to the right)\n\nif i rotate the camera to the left, before the error message appears, i can use the camera as normal. but i have to do this anytime i start hearing the noise. the error message asks me to \"turn the camera off and back on\".\n\njust wanted to see if anyone else had a similar issue. unfortunately, i only have one lens, so i can't test and see if it's the lens or the body itself. factory reset and firmware didn't change anything, as i'm already on the latest version.\n\ni'm assuming it's either ibis or autofocus.", "sortedWord": "None", "identifyer": 96306, "year": "2021"}], "name": "orientationfujifilm2021"}