{"interestingcomments": [{"Unnamed: 0": 166022, "autor": "reganneale", "date": 1586816027000, "content": "Fuji X-T2 + 16-55mm f2.8 sharpness issues? /!/ Hey guys,  \nI  am shooting with the Fuji X-T2 and the 16-55mm f2.8 and I  am not happy  with the quality it is producing. I set up a sharpness  test in my  backyard with a stool 3 metres away from with a box on it,  in front of a  hedge. I then positioned my camera on my sturdy tripod  and took two  shots at f8 and f11 (I am a landscape photographer so  these are most  important apetures typically) at ISO200, 1/125th of a  second shutter  speed. I focused on the box on the stool and I dont  think the quality is  very good when I zoom into 100% and worse at 200%.  Can someone please  have a look at the below JPEGs and let me know if I  am dreaming and  demanding too much of a ASP-C sensor or if they think  something is wrong  also? I can supply the RAWs if someone would like a  better look.  \nf11 - [https://i.imgur.com/EFYAqto.jpg](https://i.imgur.com/EFYAqto.jpg)  \nf8 - [https://i.imgur.com/DZnIuXd.jpg](https://i.imgur.com/DZnIuXd.jpg)", "link": "https://www.reddit.com/r/fujifilm/comments/g0sw69/fuji_xt2_1655mm_f28_sharpness_issues/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "fuji x-t2 + 16-55mm f2.8 sharpness issues? /!/ hey guys,  \ni  am shooting with the fuji x-t2 and the 16-55mm f2.8 and i  am not happy  with the quality it is producing. i set up a sharpness  test in my  backyard with a stool 3 metres away from with a box on it,  in front of a  hedge. i then -----> positioned !!!  my camera on my sturdy tripod  and took two  shots at f8 and f11 (i am a landscape photographer so  these are most  important apetures typically) at iso200, 1/125th of a  second shutter  speed. i focused on the box on the stool and i dont  think the quality is  very good when i zoom into 100% and worse at 200%.  can someone please  have a look at the below jpegs and let me know if i  am dreaming and  demanding too much of a asp-c sensor or if they think  something is wrong  also? i can supply the raws if someone would like a  better look.  \nf11 - [https://i.imgur.com/efyaqto.jpg](https://i.imgur.com/efyaqto.jpg)  \nf8 - [https://i.imgur.com/dzniuxd.jpg](https://i.imgur.com/dzniuxd.jpg)", "sortedWord": "None", "identifyer": 58023, "year": "2020"}, {"Unnamed: 0": 168159, "autor": "kleingartenganove", "date": 1601165267000, "content": "Minimize movement of the viewfinder curtain? /!/ I don't exactly baby my stuff. I much rather use it. But I consider this an actual problem seeing as there are quite a lot of reports about stuck viewfinder curtains. It's also super annoying.\n\nBasically I'd really like to lock the viewfinder curtain permanently in the up-position until I decide otherwise. If it pops down when I switch the camera off, that's okay, but as someone who is primarily switching between EVF and LCD, the constant popping up and down of the thing gets annoying, especially when I hang the camera around my neck and it sort of flops back and forth while I'm walking, constantly triggering the sensor.\n\nI can't seem to find anything regarding that in the menus. I've considered taping over the sensor, but that wouldn't really help the problem because then I''d have to manually switch between LCD and EVF. Am I just missing something, or is there really no fix?", "link": "https://www.reddit.com/r/fujifilm/comments/j0gwht/minimize_movement_of_the_viewfinder_curtain/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minimize movement of the viewfinder curtain? /!/ i don't exactly baby my stuff. i much rather use it. but i consider this an actual problem seeing as there are quite a lot of reports about stuck viewfinder curtains. it's also super annoying.\n\nbasically i'd really like to lock the viewfinder curtain permanently in the up------> position !!!  until i decide otherwise. if it pops down when i switch the camera off, that's okay, but as someone who is primarily switching between evf and lcd, the constant popping up and down of the thing gets annoying, especially when i hang the camera around my neck and it sort of flops back and forth while i'm walking, constantly triggering the sensor.\n\ni can't seem to find anything regarding that in the menus. i've considered taping over the sensor, but that wouldn't really help the problem because then i''d have to manually switch between lcd and evf. am i just missing something, or is there really no fix?", "sortedWord": "None", "identifyer": 60233, "year": "2020"}, {"Unnamed: 0": 170411, "autor": "TomB4", "date": 1598477552000, "content": "Locking the MF position and disabling lens focus changes when going to gallery /!/ Hi,\n\nI am looking for an option to lock the manual focus on Fuji's lens with motorized focus. From time to time I like to shoot stars, and while I know this kind of lens is far from ideal, this is what I have. I spend some time focusing manually for the stars, and after getting the right setting the problem with the focus can be split into two situations:\n\n1. In MF mode, after getting the right focus setting, even slightly touching focus ring changes focus greatly (in case of shooting stars). Is there an option to lock manual focus, or any other workaround?\n2. After taking photo and going into the gallery (to zoom in and verify focus setting), the lens goes to the default position (I'm using 35mm 1.4), and after going to shooting mode again, it gets back to its initial shooting position. This basically ruins the previous steps to achieve perfect focus - this going back and forth tampers the previous setting. Is there any option to disable this behavior?", "link": "https://www.reddit.com/r/fujifilm/comments/ih7yhx/locking_the_mf_position_and_disabling_lens_focus/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "locking the mf -----> position !!!  and disabling lens focus changes when going to gallery /!/ hi,\n\ni am looking for an option to lock the manual focus on fuji's lens with motorized focus. from time to time i like to shoot stars, and while i know this kind of lens is far from ideal, this is what i have. i spend some time focusing manually for the stars, and after getting the right setting the problem with the focus can be split into two situations:\n\n1. in mf mode, after getting the right focus setting, even slightly touching focus ring changes focus greatly (in case of shooting stars). is there an option to lock manual focus, or any other workaround?\n2. after taking photo and going into the gallery (to zoom in and verify focus setting), the lens goes to the default position (i'm using 35mm 1.4), and after going to shooting mode again, it gets back to its initial shooting position. this basically ruins the previous steps to achieve perfect focus - this going back and forth tampers the previous setting. is there any option to disable this behavior?", "sortedWord": "None", "identifyer": 62564, "year": "2020"}, {"Unnamed: 0": 175406, "autor": "nc_slater", "date": 1606432242000, "content": "Jammed Shutter Button? Help! /!/ Hi, I’m new to the Fuji X10. Thanks for any help. The shutter button appears to be stuck in the pressed position. It’s pretty much unresponsive when I push in on it even at full strength and it won’t take a picture in any mode. \n\nThe only way I’ve gotten it to take a photo is to sort of PULL or pry the button upwards and occasionally it’ll take a photo. Very odd.\n\nI noticed the interior ring of the button is pretty much flush with the larger ring - as shown in the below images. That’s what leads me to think it’s stuck in the pressed position \n\nAny tips or tricks or thoughts?\n\nThanks!!\n\nImages:\n\nhttps://ibb.co/Bgq4X3S\nhttps://ibb.co/DVX0h96\nhttps://ibb.co/rxLRCFJ", "link": "https://www.reddit.com/r/fujifilm/comments/k1pk3a/jammed_shutter_button_help/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jammed shutter button? help! /!/ hi, i’m new to the fuji x10. thanks for any help. the shutter button appears to be stuck in the pressed -----> position !!! . it’s pretty much unresponsive when i push in on it even at full strength and it won’t take a picture in any mode. \n\nthe only way i’ve gotten it to take a photo is to sort of pull or pry the button upwards and occasionally it’ll take a photo. very odd.\n\ni noticed the interior ring of the button is pretty much flush with the larger ring - as shown in the below images. that’s what leads me to think it’s stuck in the pressed position \n\nany tips or tricks or thoughts?\n\nthanks!!\n\nimages:\n\nhttps://ibb.co/bgq4x3s\nhttps://ibb.co/dvx0h96\nhttps://ibb.co/rxlrcfj", "sortedWord": "None", "identifyer": 67791, "year": "2020"}, {"Unnamed: 0": 175665, "autor": "siomairicesquad", "date": 1594195750000, "content": "HELP! MY XT100'S BATTERY IS FULLY CHARGED BUT THE CAMERA ITSELF WON'T TURN ON /!/ The charge indicator says that it is green on the camera but the camera itself won't turn on with it  \nThe battery is placed in a correct position too  \nPlease help! Thank you so much for your replies!", "link": "https://www.reddit.com/r/fujifilm/comments/hnd4cp/help_my_xt100s_battery_is_fully_charged_but_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help! my xt100's battery is fully charged but the camera itself won't turn on /!/ the charge indicator says that it is green on the camera but the camera itself won't turn on with it  \nthe battery is placed in a correct -----> position !!!  too  \nplease help! thank you so much for your replies!", "sortedWord": "None", "identifyer": 68057, "year": "2020"}], "name": "positionfujifilm2020"}