{"interestingcomments": [{"Unnamed: 0": 228865, "autor": "BluRayHiDef", "date": 1574444658000, "content": "How can I get the camera to equally focus on objects that are positioned at different distances from the camera? /!/ I'm trying to recreate the following shot with my action figures. \n\nhttps://preview.redd.it/bn5au57ky9041.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=5d3dbe77eff9bf0171fe69713396b3dec292239d\n\nHowever, I don't know how to get the camera to focus on all six figures equally.  Here are my failed attempts:  [https://imgur.com/a/0cQemF9](https://imgur.com/a/0cQemF9)", "link": "https://www.reddit.com/r/fujifilm/comments/e04e6g/how_can_i_get_the_camera_to_equally_focus_on/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "how can i get the camera to equally focus on objects that are -----> positioned !!!  at different distances from the camera? /!/ i'm trying to recreate the following shot with my action figures. \n\nhttps://preview.redd.it/bn5au57ky9041.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=5d3dbe77eff9bf0171fe69713396b3dec292239d\n\nhowever, i don't know how to get the camera to focus on all six figures equally.  here are my failed attempts:  [https://imgur.com/a/0cqemf9](https://imgur.com/a/0cqemf9)", "sortedWord": "None", "identifyer": 23757, "year": "2019"}, {"Unnamed: 0": 229389, "autor": "HaightnAshbury", "date": 1564330135000, "content": "X-E2 shutter stuck, buttons unresponsive, horrible motor sound :( (help, pls) /!/ The other day, perhaps on a too-hot day, I was out for an hour-long walk, the camera to be in my hand for much of it.\n\nAfter only about 30 minutes in the heat, having taken... 6 shots... on the 6th shot, the camera now seems totally fucked.\n\nFocal plane shutter is stuck in the down position, and when I turn on the camera, it makes a struggling sound, as if it is trying to move the shutter back up, but it cannot.\n\nAfter it gives up, I have a black screen with the regular information on it. But, with the exception of the 'review' button, none of the buttons do anything.\n\nAny insights?\n\nMy X-T1 got smashed in two, a couple years ago, and I sent it in for repairs, and Fuji did a fantastic job, and it didn't cost me a whole lot.\n\nSo, I imagine I'll have to do that.\n\nUgh, why couldn't it have been my X-M1, or my X-E1! Ughhhh!\n\nThanks, \n\n:''(", "link": "https://www.reddit.com/r/fujifilm/comments/cixno3/xe2_shutter_stuck_buttons_unresponsive_horrible/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "x-e2 shutter stuck, buttons unresponsive, horrible motor sound :( (help, pls) /!/ the other day, perhaps on a too-hot day, i was out for an hour-long walk, the camera to be in my hand for much of it.\n\nafter only about 30 minutes in the heat, having taken... 6 shots... on the 6th shot, the camera now seems totally fucked.\n\nfocal plane shutter is stuck in the down -----> position !!! , and when i turn on the camera, it makes a struggling sound, as if it is trying to move the shutter back up, but it cannot.\n\nafter it gives up, i have a black screen with the regular information on it. but, with the exception of the 'review' button, none of the buttons do anything.\n\nany insights?\n\nmy x-t1 got smashed in two, a couple years ago, and i sent it in for repairs, and fuji did a fantastic job, and it didn't cost me a whole lot.\n\nso, i imagine i'll have to do that.\n\nugh, why couldn't it have been my x-m1, or my x-e1! ughhhh!\n\nthanks, \n\n:''(", "sortedWord": "None", "identifyer": 24309, "year": "2019"}, {"Unnamed: 0": 229501, "autor": "SlingyRopert", "date": 1557773042000, "content": "23mm f/2.0 manual focus issue /!/ I'm new to to the 23 m f/2.0 WR. I rented one for the weekend to do some astronomical-like imaging where I needed to really nail infinity focus using a reference star at f/2.0. With the rented lens in manual, I found that if I approached infinity focus from near to far, it seemed to be in a vastly different focus ring position. Like I had to turn the  focus ring almost a full turn the backward direction the instant I stepped past in the forward direction.\n\nThis made focusing really hard because I could not rock back and forth to find best focus. I had to approach focus from a particular direction and then stop the moment my reference star was crisp enough. I understand these lenses are all fly-by-wire with encoder rings but this really sucked. The 16mm f1.something I rented last month did not do anything like this.", "link": "https://www.reddit.com/r/fujifilm/comments/bo7erw/23mm_f20_manual_focus_issue/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "23mm f/2.0 manual focus issue /!/ i'm new to to the 23 m f/2.0 wr. i rented one for the weekend to do some astronomical-like imaging where i needed to really nail infinity focus using a reference star at f/2.0. with the rented lens in manual, i found that if i approached infinity focus from near to far, it seemed to be in a vastly different focus ring -----> position !!! . like i had to turn the  focus ring almost a full turn the backward direction the instant i stepped past in the forward direction.\n\nthis made focusing really hard because i could not rock back and forth to find best focus. i had to approach focus from a particular direction and then stop the moment my reference star was crisp enough. i understand these lenses are all fly-by-wire with encoder rings but this really sucked. the 16mm f1.something i rented last month did not do anything like this.", "sortedWord": "None", "identifyer": 24424, "year": "2019"}, {"Unnamed: 0": 230620, "autor": "WhiteHelix", "date": 1559424034000, "content": "16mm or 23mm? future wedding /!/ Hi, I\\`m in the position right now that I want to more or less complete my gear, especially with the ongoing cashback here in Germany. I cant really decide between the 16mm (the new 2.8 really doesnt make that easier) and the 23mm 1.4. I want to get more into weddings this year, mainly doing portrait and family right now. I\\`m more or less pulled to the 23 because I fear that the 16 is maybe too wide for most situations and that the 2.8 will fit just right for the right occasions like group shots. Maybe some experience from fellow wedding photographers out here?\n\n&amp;#x200B;\n\nFor my current gear I use:\n\n* T2 and X-E2 as Backup, maybe I will get an Pro3 as soon its out\n* 18-55, mostly unused right now\n* 27mm 2.8 \n* 35mm 1.4\n* 50mm f2 \n* 7artians 25mm 1.8\n\n&amp;#x200B;\n\nI\\`m really pleased with the angle that the 27 and 25mm get me and that\\`s where I\\`m thinking more of the 23mm with the 16mm 2.8 as soon I need wide angle and for some travel stuff I hope to to more in the future. The 35 is most times a bit too tight so it doesn\\`t get that much use (and the AF is not that great for little kids outside)", "link": "https://www.reddit.com/r/fujifilm/comments/bvpput/16mm_or_23mm_future_wedding/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "16mm or 23mm? future wedding /!/ hi, i\\`m in the -----> position !!!  right now that i want to more or less complete my gear, especially with the ongoing cashback here in germany. i cant really decide between the 16mm (the new 2.8 really doesnt make that easier) and the 23mm 1.4. i want to get more into weddings this year, mainly doing portrait and family right now. i\\`m more or less pulled to the 23 because i fear that the 16 is maybe too wide for most situations and that the 2.8 will fit just right for the right occasions like group shots. maybe some experience from fellow wedding photographers out here?\n\n&amp;#x200b;\n\nfor my current gear i use:\n\n* t2 and x-e2 as backup, maybe i will get an pro3 as soon its out\n* 18-55, mostly unused right now\n* 27mm 2.8 \n* 35mm 1.4\n* 50mm f2 \n* 7artians 25mm 1.8\n\n&amp;#x200b;\n\ni\\`m really pleased with the angle that the 27 and 25mm get me and that\\`s where i\\`m thinking more of the 23mm with the 16mm 2.8 as soon i need wide angle and for some travel stuff i hope to to more in the future. the 35 is most times a bit too tight so it doesn\\`t get that much use (and the af is not that great for little kids outside)", "sortedWord": "None", "identifyer": 25561, "year": "2019"}, {"Unnamed: 0": 230900, "autor": "Negative_Agency", "date": 1560862324000, "content": "Very impressed with the durability of my 18/2: scary bike crash /!/ Long story short, I was riding my bike around the city taking photos with my camera slung over my shoulder (I know, I know). I have been biking for 6 years in the city with zero incidences.\n\nLast Friday I hit a pothole and my breaks seized. I flew over my handlebars, dislocated shoulder and messed up my wrist. My camera was between me and the ground, I remember the lens scraping face first down on the pavement (luckily I had a UV filter on).\n\nWhen I got home, I remembered to check my camera. I kind of assumed the lens was toast. It has been forced out of lock position by the crash. But simply twisting the lens back into place fixed everything. Autofocus still works fine. No obvious decentering. Still tack sharp in the center of the image.\n\nObviously don't try this at home, but the build quality of these lenses are very impressive. They should last a long time. I might have been lucky but there is no way a plastic lens would have survived what this little pancake went through!\n\n(And don't worry about me, I'll be fine ;) )", "link": "https://www.reddit.com/r/fujifilm/comments/c21vn8/very_impressed_with_the_durability_of_my_182/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "very impressed with the durability of my 18/2: scary bike crash /!/ long story short, i was riding my bike around the city taking photos with my camera slung over my shoulder (i know, i know). i have been biking for 6 years in the city with zero incidences.\n\nlast friday i hit a pothole and my breaks seized. i flew over my handlebars, dislocated shoulder and messed up my wrist. my camera was between me and the ground, i remember the lens scraping face first down on the pavement (luckily i had a uv filter on).\n\nwhen i got home, i remembered to check my camera. i kind of assumed the lens was toast. it has been forced out of lock -----> position !!!  by the crash. but simply twisting the lens back into place fixed everything. autofocus still works fine. no obvious decentering. still tack sharp in the center of the image.\n\nobviously don't try this at home, but the build quality of these lenses are very impressive. they should last a long time. i might have been lucky but there is no way a plastic lens would have survived what this little pancake went through!\n\n(and don't worry about me, i'll be fine ;) )", "sortedWord": "None", "identifyer": 25856, "year": "2019"}, {"Unnamed: 0": 231409, "autor": "JonsiAndYorke", "date": 1554946718000, "content": "New Fujifilm X-T3 owner. I have “stupid” questions. /!/ I searched the manual and I couldn’t find answers, so I’ll appreciate it if you do.\n\n1) How do I open the monitor in the position? https://i.imgur.com/kdDzhUn.jpg . I tried with a bit of force and it felt like it was gonna break so I stopped. This picture is X-T3 right? \n\n2) Is there a way to know how much storage left is on your memory card from settings?", "link": "https://www.reddit.com/r/fujifilm/comments/bbubev/new_fujifilm_xt3_owner_i_have_stupid_questions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new fujifilm x-t3 owner. i have “stupid” questions. /!/ i searched the manual and i couldn’t find answers, so i’ll appreciate it if you do.\n\n1) how do i open the monitor in the -----> position !!! ? https://i.imgur.com/kddzhun.jpg . i tried with a bit of force and it felt like it was gonna break so i stopped. this picture is x-t3 right? \n\n2) is there a way to know how much storage left is on your memory card from settings?", "sortedWord": "None", "identifyer": 26382, "year": "2019"}, {"Unnamed: 0": 233060, "autor": "bplatt21", "date": 1575468775000, "content": "Big Differences With XT3/traditional camera over iPhone? /!/ Hey all, I'm in a bit of a strange position. Basically, I bought the XT3 on Black Friday and it's coming in sometime tomorrow, however, just yesterday we got some scary news about the health of a loved one, and it looks like some substantial medical bills might be in the future, so I will most likely return the XT3 and use the money to help with those.  \n\nMy questions for XT3 (or similar camera owners) are:\n\n1) What are the biggest differences that you see between shooting footage on your camera vs on a new iPhone/Android? \n\n2) Are there any programs, apps, or devices that can be used on an iPhone to better mimic a traditional camera? I have a gimbal and am blown away by its features, is there anything else that can make my footage looking more professional? \n\nThanks all!", "link": "https://www.reddit.com/r/fujifilm/comments/e5zsh1/big_differences_with_xt3traditional_camera_over/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "big differences with xt3/traditional camera over iphone? /!/ hey all, i'm in a bit of a strange -----> position !!! . basically, i bought the xt3 on black friday and it's coming in sometime tomorrow, however, just yesterday we got some scary news about the health of a loved one, and it looks like some substantial medical bills might be in the future, so i will most likely return the xt3 and use the money to help with those.  \n\nmy questions for xt3 (or similar camera owners) are:\n\n1) what are the biggest differences that you see between shooting footage on your camera vs on a new iphone/android? \n\n2) are there any programs, apps, or devices that can be used on an iphone to better mimic a traditional camera? i have a gimbal and am blown away by its features, is there anything else that can make my footage looking more professional? \n\nthanks all!", "sortedWord": "None", "identifyer": 28081, "year": "2019"}, {"Unnamed: 0": 233102, "autor": "WhoFreedTheRobots", "date": 1575306758000, "content": "Meike 35mm 1.4 vs Nikkor 35mm f1.8g on X-T20 /!/ Hey, guys. I want to get a 35mm prime lens, but unfortunately my budget is too low to buy a fuji lens. I've been looking around and the Meike seems like a good budget option.\n\nI already own the Nikon lens. I can buy the Meike for 99€ on Amazon, or I can buy an Nikon-Fuji adapter and use my old lens with my new system. The adapter costs around 30 euro. \n\nSure, mathwise it seems more efficient to buy the adapter, but I don't own any other Nikon lenses and I'm not sure whether the extra aperture is worth 60€. \n\nWhat would you guys do in my position? Thanks for the help.", "link": "https://www.reddit.com/r/fujifilm/comments/e5223e/meike_35mm_14_vs_nikkor_35mm_f18g_on_xt20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "meike 35mm 1.4 vs nikkor 35mm f1.8g on x-t20 /!/ hey, guys. i want to get a 35mm prime lens, but unfortunately my budget is too low to buy a fuji lens. i've been looking around and the meike seems like a good budget option.\n\ni already own the nikon lens. i can buy the meike for 99€ on amazon, or i can buy an nikon-fuji adapter and use my old lens with my new system. the adapter costs around 30 euro. \n\nsure, mathwise it seems more efficient to buy the adapter, but i don't own any other nikon lenses and i'm not sure whether the extra aperture is worth 60€. \n\nwhat would you guys do in my -----> position !!! ? thanks for the help.", "sortedWord": "None", "identifyer": 28124, "year": "2019"}, {"Unnamed: 0": 233498, "autor": "dianjello", "date": 1552882328000, "content": "X100F Evf shutter curtain stuck /!/ The curtain is stuck in the open position, making the evf useless. What should I do?", "link": "https://www.reddit.com/r/fujifilm/comments/b2e6fa/x100f_evf_shutter_curtain_stuck/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "x100f evf shutter curtain stuck /!/ the curtain is stuck in the open -----> position !!! , making the evf useless. what should i do?", "sortedWord": "None", "identifyer": 28531, "year": "2019"}], "name": "positionfujifilm2019"}