{"interestingcomments": [{"Unnamed: 0": 228702, "autor": "Johnedlt", "date": 1568048548000, "content": "Dead pixels on two bodies...!? /!/ Purchased a used x-t20 and then a bnew x-e3. Both were returned because of Dead pixels. They're noticeable and distinct on a 4k monitor. Jpgs tend to minimize them but they show more on raw files. \n\nIve owned an x-t10 and use an x-t30 and never observed that a seasoned photog and editor. \n\nJust wondering if this is common on the 24mp x-trans sensor. Is it? The pixels are mostly white but sometimes red or blue. Unlike dust bunnies they're very defined often boxy and show up in the same spots on any frame.", "link": "https://www.reddit.com/r/fujifilm/comments/d1tnyn/dead_pixels_on_two_bodies/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dead pixels on two bodies...!? /!/ purchased a used x-t20 and then a bnew x-e3. both were returned because of dead pixels. they're noticeable and distinct on a 4k monitor. jpgs tend to minimize them but they show more on raw files. \n\nive owned an x-t10 and use an x-t30 and never observed that a seasoned photog and editor. \n\njust wondering if this is common on the 24mp x-trans sensor. is it? the pixels are mostly white but sometimes red or blue. unlike dust bunnies they're very defined often boxy and show up in the same -----> spots !!!  on any frame.", "sortedWord": "None", "identifyer": 23588, "year": "2019"}, {"Unnamed: 0": 229110, "autor": "EternalSamuraiSG", "date": 1559714078000, "content": "First-time poster here. Was charging my FujiFilm J27 when this white spot appeared on the lens. Should I be concerned?", "link": "https://www.reddit.com/r/fujifilm/comments/bwz6v7/firsttime_poster_here_was_charging_my_fujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first-time poster here. was charging my fujifilm j27 when this white -----> spot !!!  appeared on the lens. should i be concerned?", "sortedWord": "None", "identifyer": 24010, "year": "2019"}, {"Unnamed: 0": 229111, "autor": "EternalSamuraiSG", "date": 1559713469000, "content": "First-time poster here. Was charging my FujiFlim J27 when this white spot appeared on the lens. Should I be concerned?", "link": "https://www.reddit.com/r/fujifilm/comments/bwz44o/firsttime_poster_here_was_charging_my_fujiflim/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first-time poster here. was charging my fujiflim j27 when this white -----> spot !!!  appeared on the lens. should i be concerned?", "sortedWord": "None", "identifyer": 24011, "year": "2019"}, {"Unnamed: 0": 229426, "autor": "askmatt", "date": 1558230514000, "content": "Spotted in downtown San Francisco 🚙 - X-T20 XF32mmF2 (Raw + Lightroom)", "link": "https://www.reddit.com/r/fujifilm/comments/bqbl2m/spotted_in_downtown_san_francisco_xt20_xf32mmf2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  in downtown san francisco 🚙 - x-t20 xf32mmf2 (raw + lightroom)", "sortedWord": "None", "identifyer": 24346, "year": "2019"}, {"Unnamed: 0": 229704, "autor": "warmcolour", "date": 1551687044000, "content": "Body or lenses? /!/ Hi all, I'm looking to convert to a Fujifilm user from a canon 550D and I want to go mirror less and I've got my eye on the  x-series. \n\nMy budget is under £1000, maybe a touch over in order to purchase the x-2, but should I spend more money on the initial body and kit lens, or should I purchase a cheaper body and save money on better lenses.\n\nI'll mainly be using this camera for taking pictures of graphic design work, and doing a spot of landscape photography.\n\nThanks all! ", "link": "https://www.reddit.com/r/fujifilm/comments/ax4puz/body_or_lenses/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "body or lenses? /!/ hi all, i'm looking to convert to a fujifilm user from a canon 550d and i want to go mirror less and i've got my eye on the  x-series. \n\nmy budget is under £1000, maybe a touch over in order to purchase the x-2, but should i spend more money on the initial body and kit lens, or should i purchase a cheaper body and save money on better lenses.\n\ni'll mainly be using this camera for taking pictures of graphic design work, and doing a -----> spot !!!  of landscape photography.\n\nthanks all! ", "sortedWord": "None", "identifyer": 24630, "year": "2019"}, {"Unnamed: 0": 229926, "autor": "sznooped", "date": 1566404439000, "content": "What metering mode does the XT3 uses when Eye-AF is used? /!/ I have no idea so far. Since I would prefer spot metering.", "link": "https://www.reddit.com/r/fujifilm/comments/ctj3km/what_metering_mode_does_the_xt3_uses_when_eyeaf/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what metering mode does the xt3 uses when eye-af is used? /!/ i have no idea so far. since i would prefer -----> spot !!!  metering.", "sortedWord": "None", "identifyer": 24852, "year": "2019"}, {"Unnamed: 0": 230378, "autor": "sildargod", "date": 1572378936000, "content": "The GFX retains a truly amazing amount of recoverable highlight detail at high ISO /!/ Was using a GFX50r at a wedding this weekend, and managed to spot meter incorrectly. The resulting file was completely blown out at iso6400, I tried recovery for shits and giggles and it was absolutely not what I expected:\n\n [https://imgur.com/a/oif6uuB](https://imgur.com/a/oif6uuB) \n\n1/200, f5.6, ISO 6400.", "link": "https://www.reddit.com/r/fujifilm/comments/dov7a5/the_gfx_retains_a_truly_amazing_amount_of/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the gfx retains a truly amazing amount of recoverable highlight detail at high iso /!/ was using a gfx50r at a wedding this weekend, and managed to -----> spot !!!  meter incorrectly. the resulting file was completely blown out at iso6400, i tried recovery for shits and giggles and it was absolutely not what i expected:\n\n [https://imgur.com/a/oif6uub](https://imgur.com/a/oif6uub) \n\n1/200, f5.6, iso 6400.", "sortedWord": "None", "identifyer": 25314, "year": "2019"}, {"Unnamed: 0": 230721, "autor": "XxshadowtamerxX", "date": 1562735671000, "content": "Black spot on film? /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/cbcfyz/black_spot_on_film/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "black -----> spot !!!  on film? /!/ [removed]", "sortedWord": "None", "identifyer": 25666, "year": "2019"}, {"Unnamed: 0": 230805, "autor": "NldxTangoDown", "date": 1564096499000, "content": "Auto-balance: huge shift in color tones. Normal Behaviour? /!/ Quick question. I just recently bought a Fujifilm X-T3 camera today and I just noticed how much auto white balancing this thing does. I am in a room with dim light (it's dark outside currently), so I don't have great light, but when I unboxed my camera and look through the EVF or LCD screen, I see that my auto-balancing makes constant changes in the color. So when I turn to left in a certain spot in my room it always turns to orange (as if im using the fluorescent WB filter), when I move to the right (to the white wall) the WB is much better again. When I move to the third spot in the room everything becomes a little bit - only a little bit - more magenta. Is there something I'm missing here? Because I didn't remember my X-T20 making such huge changes to my white balance; it was much more subtle then. The auto WB changes on my X-T3 look a bit overkill to me. It really feels like I am using some 'spot metering' equivalent but then for the white balance instead of the exposure.\nSo I was thinking. Is this normal behaviour? I updated my firmware to 3.0.0 and it's still the same, but when I hardcode my whitebalance or when I lock my white balance the colors do not change at all. It's when I'm releasing the shutter and set my white balance to auto, the huge 'color tone shift' fires off again. Making some of my shots on the desk for example orange, the right wall neutral and my couch magento.", "link": "https://www.reddit.com/r/fujifilm/comments/chv2bv/autobalance_huge_shift_in_color_tones_normal/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "auto-balance: huge shift in color tones. normal behaviour? /!/ quick question. i just recently bought a fujifilm x-t3 camera today and i just noticed how much auto white balancing this thing does. i am in a room with dim light (it's dark outside currently), so i don't have great light, but when i unboxed my camera and look through the evf or lcd screen, i see that my auto-balancing makes constant changes in the color. so when i turn to left in a certain -----> spot !!!  in my room it always turns to orange (as if im using the fluorescent wb filter), when i move to the right (to the white wall) the wb is much better again. when i move to the third spot in the room everything becomes a little bit - only a little bit - more magenta. is there something i'm missing here? because i didn't remember my x-t20 making such huge changes to my white balance; it was much more subtle then. the auto wb changes on my x-t3 look a bit overkill to me. it really feels like i am using some 'spot metering' equivalent but then for the white balance instead of the exposure.\nso i was thinking. is this normal behaviour? i updated my firmware to 3.0.0 and it's still the same, but when i hardcode my whitebalance or when i lock my white balance the colors do not change at all. it's when i'm releasing the shutter and set my white balance to auto, the huge 'color tone shift' fires off again. making some of my shots on the desk for example orange, the right wall neutral and my couch magento.", "sortedWord": "None", "identifyer": 25754, "year": "2019"}, {"Unnamed: 0": 230974, "autor": "heywilliamhey", "date": 1560357954000, "content": "Decided to test out the 4K shooting capabilities on my camera. Clip is unedited. One of the main reasons I love Seattle is the incredible views from my favorite swimming spot. God I love summer. X-T30", "link": "https://www.reddit.com/r/fujifilm/comments/bztja6/decided_to_test_out_the_4k_shooting_capabilities/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "decided to test out the 4k shooting capabilities on my camera. clip is unedited. one of the main reasons i love seattle is the incredible views from my favorite swimming -----> spot !!! . god i love summer. x-t30", "sortedWord": "None", "identifyer": 25932, "year": "2019"}, {"Unnamed: 0": 231041, "autor": "didsomeonesaydonuts", "date": 1557197430000, "content": "X-pro 2 vs x-t3... a few questions on bodies and lenses please /!/ I’m looking for an all around travel and street camera to replace my lugging a canon 5d iv, canon gx7ii and Ricoh GR every time I pack up for a trip or into the city to shoot. I love each camera for specific reasons but the packing is just getting ridiculous. I’m getting ready for another trip in a few weeks and would love to keep this one as light as possible (ie, one body and a couple lenses). \n\nJob wise I typically shoot with a phase one and or the canon 5d so I’m used to heavy cameras and don’t mind them. \n\nFirst thing, seeing as I’ve really only shot with optical viewfinders in the past how long does it take to get used to the digital finder in the t3? I’ve handled it in shops a few times and it feels weird but wondering how fast most others take to get used to it? The optical range style finder in the pro2 is my reason for considering that body. \n\nSecond, lenses. How pleased are you guys with the 18-55 kit lens? My personal sweet spot for street is around 24/28mm. I’d love a lens that’s more compact and not so noticeable but also would love the versatility of a zoom for portraits but without sacrificing quality. Any other lens suggestions? My street style is also more film like so not looking for hyper sharp Sony style. \n\nI’m also rough on my gear at times. I’ve been shooting and working professionally for over 10 years so tend to view my cameras as tools. Need something that won’t cry and break if I unintentionally handle it a bit too rough from time to time. Lenses especially.", "link": "https://www.reddit.com/r/fujifilm/comments/blleuq/xpro_2_vs_xt3_a_few_questions_on_bodies_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x-pro 2 vs x-t3... a few questions on bodies and lenses please /!/ i’m looking for an all around travel and street camera to replace my lugging a canon 5d iv, canon gx7ii and ricoh gr every time i pack up for a trip or into the city to shoot. i love each camera for specific reasons but the packing is just getting ridiculous. i’m getting ready for another trip in a few weeks and would love to keep this one as light as possible (ie, one body and a couple lenses). \n\njob wise i typically shoot with a phase one and or the canon 5d so i’m used to heavy cameras and don’t mind them. \n\nfirst thing, seeing as i’ve really only shot with optical viewfinders in the past how long does it take to get used to the digital finder in the t3? i’ve handled it in shops a few times and it feels weird but wondering how fast most others take to get used to it? the optical range style finder in the pro2 is my reason for considering that body. \n\nsecond, lenses. how pleased are you guys with the 18-55 kit lens? my personal sweet -----> spot !!!  for street is around 24/28mm. i’d love a lens that’s more compact and not so noticeable but also would love the versatility of a zoom for portraits but without sacrificing quality. any other lens suggestions? my street style is also more film like so not looking for hyper sharp sony style. \n\ni’m also rough on my gear at times. i’ve been shooting and working professionally for over 10 years so tend to view my cameras as tools. need something that won’t cry and break if i unintentionally handle it a bit too rough from time to time. lenses especially.", "sortedWord": "None", "identifyer": 26003, "year": "2019"}, {"Unnamed: 0": 231182, "autor": "runawaylatethrowaway", "date": 1550449107000, "content": "X100T vs X100F value for money /!/ Looking to buy one of the these cameras. Weighing everything up, and given the age of the X100F I'm leaning towards getting the X100T now, and upgrading to the successor when it arrives. UK best pricing I've found as follows:\n\n&amp;#x200B;\n\nUsed X100T: £574\n\nNew X100T: £679\n\nUsed X100F: £829\n\nNew X100F: £1199\n\n&amp;#x200B;\n\nThis is my first 'real' camera purchase. Looking for a camera to take travelling and I like the simplicity of this camera.\n\n&amp;#x200B;\n\nAm I missing anything? Seems to me that the sweet spot on the above pricing is the New X100T?", "link": "https://www.reddit.com/r/fujifilm/comments/arqzlm/x100t_vs_x100f_value_for_money/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x100t vs x100f value for money /!/ looking to buy one of the these cameras. weighing everything up, and given the age of the x100f i'm leaning towards getting the x100t now, and upgrading to the successor when it arrives. uk best pricing i've found as follows:\n\n&amp;#x200b;\n\nused x100t: £574\n\nnew x100t: £679\n\nused x100f: £829\n\nnew x100f: £1199\n\n&amp;#x200b;\n\nthis is my first 'real' camera purchase. looking for a camera to take travelling and i like the simplicity of this camera.\n\n&amp;#x200b;\n\nam i missing anything? seems to me that the sweet -----> spot !!!  on the above pricing is the new x100t?", "sortedWord": "None", "identifyer": 26150, "year": "2019"}, {"Unnamed: 0": 231189, "autor": "Cyontagi", "date": 1550407340000, "content": "Eye detection issues /!/ About two weeks ago I bought the Fuji GFX 50s with the 120mm Macro and the 32-64mm zoom and I'm really happy with it - however it've not been able to get the eye detection to work relaibly. \n\nThe focus is way of and often keeps hunting forever - with fact detection it works perfectly fine  and it's spot on!  \n\n\nAm I doing something wrong here or is there something I should try?\n\n&amp;#x200B;\n\n It's not a dealbreaker if it doesn't work with eye-AF, I was just looking forward to using it for beauty photography.  \n", "link": "https://www.reddit.com/r/fujifilm/comments/ark845/eye_detection_issues/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "eye detection issues /!/ about two weeks ago i bought the fuji gfx 50s with the 120mm macro and the 32-64mm zoom and i'm really happy with it - however it've not been able to get the eye detection to work relaibly. \n\nthe focus is way of and often keeps hunting forever - with fact detection it works perfectly fine  and it's -----> spot !!!  on!  \n\n\nam i doing something wrong here or is there something i should try?\n\n&amp;#x200b;\n\n it's not a dealbreaker if it doesn't work with eye-af, i was just looking forward to using it for beauty photography.  \n", "sortedWord": "None", "identifyer": 26157, "year": "2019"}, {"Unnamed: 0": 231284, "autor": "binwork", "date": 1551456514000, "content": "Please help, What is the white spot in the picture?? I have this effect on my zoom lenses at F22", "link": "https://www.reddit.com/r/fujifilm/comments/aw6l6f/please_help_what_is_the_white_spot_in_the_picture/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "please help, what is the white -----> spot !!!  in the picture?? i have this effect on my zoom lenses at f22", "sortedWord": "None", "identifyer": 26254, "year": "2019"}, {"Unnamed: 0": 233535, "autor": "afyaff", "date": 1572763164000, "content": "Back button focus doesn't work, what settings did I do wrong? /!/ I'll try to list all possibly related settings\n\nXE2\n\nAfs mode in the front switch. \n\n* AE/Af lock mode (ae and af on when pressing) \n* Af lock mode (AF lock only) \n* interlock spot ae and focus area (On)", "link": "https://www.reddit.com/r/fujifilm/comments/dqww8f/back_button_focus_doesnt_work_what_settings_did_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "back button focus doesn't work, what settings did i do wrong? /!/ i'll try to list all possibly related settings\n\nxe2\n\nafs mode in the front switch. \n\n* ae/af lock mode (ae and af on when pressing) \n* af lock mode (af lock only) \n* interlock -----> spot !!!  ae and focus area (on)", "sortedWord": "None", "identifyer": 28571, "year": "2019"}], "name": "spotfujifilm2019"}