{"interestingcomments": [{"Unnamed: 0": 206507, "autor": "jovyeo1", "date": 1526532328000, "content": "Spot Metering: Meters to center or focus area? (x100f) /!/ In spot metering mode on the x100f or others with similar systems, does it always meters the center, or can it meter to a selected focus area?  The manual seem to say it meters to the center, but it seems it should meter on the focus area \\(without need to recompose\\) should it not?", "link": "https://www.reddit.com/r/fujifilm/comments/8k1iqc/spot_metering_meters_to_center_or_focus_area_x100f/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering: meters to center or focus area? (x100f) /!/ in spot metering mode on the x100f or others with similar systems, does it always meters the center, or can it meter to a selected focus area?  the manual seem to say it meters to the center, but it seems it should meter on the focus area \\(without need to recompose\\) should it not?", "sortedWord": "None", "identifyer": 27, "year": "2018"}, {"Unnamed: 0": 206531, "autor": "SwampYankee", "date": 1525872868000, "content": "good Fuji repair experience /!/ Pretty positive actually.  My X100F all of a sudden had a large spot in the middle of the photos.  Pointed at a grey wall, EVF, and as I stopped down the grey blob and a couple of specs became clearer and clearer.  I assumed it was dust on the sensor (how anything got in the sensor/lens is a mystery but the camera is not weather sealed) so I called Fuji.  Tech that picked up was really nice. Explained the problem and she said the price for a sensor cleaning and check was $189 (not outrageous and they have to take the camera apart.  Tech suggested that I check my purchase date as this would be a warranty repair.  Checked the retailer I bought it from on line and found out I bought the camera 51 weeks ago!!!!!  Packaged it up…got it out the door overnight…and it arrived at Fuji’s repair facility in NJ with 5 days of warranty coverage to spare.  Fuji sent a confirmation stating the camera had arrived, the current repair time was about 10 days, and they would notify me if there was any cost.\nRepair actually took about 3 weeks and then I got notification that the camera had been repaired and was on it’s way back. FedEx arrive 2 days later. Checked it out and the camera was 100%.  They cleaned it up and applied the latest firmware.  BTW, they did a full reset so all my custom setting were gone.  That’s my fault, should have backed it up.  Anyway….they noted that it was sent in for a dirty sensor but the actual repair was “REPLACE LENS ASSEMBELY”.   I guess it was not the sensor of dust get into the lens somehow. I don’t baby the camera but it usually around my neck, in my pocket or in a clean place.  Trying to figure out how the dust got in and I am at a loss.  Best I can figure the battery door (unlikely) or the diopter correction (probably, some entry points here).  Anyway…except of the 3 weeks to repair , which is OK but not great, I’m really pleased with the service..  Going to dial in my diopter correction and get some Sugru to seal un the correction dial.  Nice to have my baby back\n", "link": "https://www.reddit.com/r/fujifilm/comments/8i60bg/good_fuji_repair_experience/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good fuji repair experience /!/ pretty positive actually.  my x100f all of a sudden had a large -----> spot !!!  in the middle of the photos.  pointed at a grey wall, evf, and as i stopped down the grey blob and a couple of specs became clearer and clearer.  i assumed it was dust on the sensor (how anything got in the sensor/lens is a mystery but the camera is not weather sealed) so i called fuji.  tech that picked up was really nice. explained the problem and she said the price for a sensor cleaning and check was $189 (not outrageous and they have to take the camera apart.  tech suggested that i check my purchase date as this would be a warranty repair.  checked the retailer i bought it from on line and found out i bought the camera 51 weeks ago!!!!!  packaged it up…got it out the door overnight…and it arrived at fuji’s repair facility in nj with 5 days of warranty coverage to spare.  fuji sent a confirmation stating the camera had arrived, the current repair time was about 10 days, and they would notify me if there was any cost.\nrepair actually took about 3 weeks and then i got notification that the camera had been repaired and was on it’s way back. fedex arrive 2 days later. checked it out and the camera was 100%.  they cleaned it up and applied the latest firmware.  btw, they did a full reset so all my custom setting were gone.  that’s my fault, should have backed it up.  anyway….they noted that it was sent in for a dirty sensor but the actual repair was “replace lens assembely”.   i guess it was not the sensor of dust get into the lens somehow. i don’t baby the camera but it usually around my neck, in my pocket or in a clean place.  trying to figure out how the dust got in and i am at a loss.  best i can figure the battery door (unlikely) or the diopter correction (probably, some entry points here).  anyway…except of the 3 weeks to repair , which is ok but not great, i’m really pleased with the service..  going to dial in my diopter correction and get some sugru to seal un the correction dial.  nice to have my baby back\n", "sortedWord": "None", "identifyer": 52, "year": "2018"}, {"Unnamed: 0": 206710, "autor": "tacos4days", "date": 1520378243000, "content": "Question about acros fS in lightroom for older x-series bodies /!/ I know that it's been pretty much refuted outright that the Acros film simulation will ever make it's way into a firmware update for an older camera, like my XT-1 because of the demand on processing power, but is it impossible to get the film simulation for Lightroom Classic CC? I know the adobe profiles aren't considered spot on but that also tells me that it's adobe making the profile to match one present in the camera. Is there a way to download or install the Acros FS profile even if I'm not uploading a photo shot on a camera with Acros on-board?", "link": "https://www.reddit.com/r/fujifilm/comments/82jlnc/question_about_acros_fs_in_lightroom_for_older/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question about acros fs in lightroom for older x-series bodies /!/ i know that it's been pretty much refuted outright that the acros film simulation will ever make it's way into a firmware update for an older camera, like my xt-1 because of the demand on processing power, but is it impossible to get the film simulation for lightroom classic cc? i know the adobe profiles aren't considered -----> spot !!!  on but that also tells me that it's adobe making the profile to match one present in the camera. is there a way to download or install the acros fs profile even if i'm not uploading a photo shot on a camera with acros on-board?", "sortedWord": "None", "identifyer": 231, "year": "2018"}, {"Unnamed: 0": 206714, "autor": "fadetowhite", "date": 1520281272000, "content": "The X-H1 is a dream /!/ I picked up my X-H1 w/grip yesterday. I have two X-T2s and I had a X-T1 previously. The X-H1 is incredible. It takes everything I love about the X-T2 and makes it better in so many ways.\n\n**Size and Weight**\n\nFirstly, it is noticeably larger and heavier. The grip is much more substantial. Of course an increase in weight and size isn't really a positive, but I don't mind it. I came to Fuji from a Canon 5D MKIII, so the X-H1 is still small to me. This camera feels much better in the hand than the X-T2, and I love the X-T2!\n\n\n**Sub Monitor**\n\nBye-bye exposure compensation dial that I never used, and hello awesome sub monitor! I love having access to that information when looking down at the camera, and of course being able to see battery level and shots remaining while it's off is awesome. I know there are exposure comp fans out there, but don't fret - that feature is still available via a button beside the shutter button!\n\n\n**AF-ON**\n\nThe newly renamed AF-ON button feels great and it's in the perfect spot. I now have back button focus enabled and it's more comfortable than on the X-T2.\n\n\n**Strap**\n\nFinally a decent strap. It's very comfortable and much larger and more padded than the X-T1/X-T2. I'll still probably throw a Peak Design Slide Lite and anchors on it, but this will do for now for sure.\n\n\n**Touch Screen**\n\nNot a feature I thought I would use much, but I was wrong. Swiping through shots is nice, and so is pinching to zoom in. I love the quick swipes in the four directions to get to different functions, like swiping down to turn the level on. Touching to focus is awesome for video and tripod use!\n\n\n**IBIS**\n\nThe main reason I wanted the X-H1 is the IBIS and it's a dream. My 23/35/50/90 are now stabilized and it's incredible. My keeper rate on the 90mm when handheld wasn't that great when I was below 1/160s. This will boost my keeper rate through the roof. And of course it's absolutely amazing for video!\n\n\n**Video**\n\nSpeaking of video, I am so excited for these changes. They've DOUBLED the bit rate to 200Mbps. They've added the ability to record F-log to the card. They added 17:9. Eterna is gorgeous. Etc. Etc.\n\n**Grip**\n\nIf you buy the X-H1, buy the grip. IT COMES WITH TWO BATTERIES. At least in Canada, you get three batteries with the camera+grip kit. The batteries are expensive on their own, so the grip is totally worth it. It boosts performance, adds more video recording time, and gives you a headphone jack. I had the grip for my X-T1 and I have one for my X-T2. This one feels even more solid. No-brainer for me.\n\n\n**Closing**\n\nI still love the size and weight of the X-T2 and I will still use it, especially when I want to rock one of my small primes and keep it light. But the X-H1 is a dream. I really believe Fuji has listened to their users and has created an incredible camera.\n\nNow, it's a tiny bit buggy, so I'm hoping a firmware update is coming soon. The menu doesn't pop up right away sometimes and there are some slow downs here and there. But it hasn't affected me getting shots or anything.\n\nLet me know if you have any questions or are on the fence!", "link": "https://www.reddit.com/r/fujifilm/comments/828zf6/the_xh1_is_a_dream/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the x-h1 is a dream /!/ i picked up my x-h1 w/grip yesterday. i have two x-t2s and i had a x-t1 previously. the x-h1 is incredible. it takes everything i love about the x-t2 and makes it better in so many ways.\n\n**size and weight**\n\nfirstly, it is noticeably larger and heavier. the grip is much more substantial. of course an increase in weight and size isn't really a positive, but i don't mind it. i came to fuji from a canon 5d mkiii, so the x-h1 is still small to me. this camera feels much better in the hand than the x-t2, and i love the x-t2!\n\n\n**sub monitor**\n\nbye-bye exposure compensation dial that i never used, and hello awesome sub monitor! i love having access to that information when looking down at the camera, and of course being able to see battery level and shots remaining while it's off is awesome. i know there are exposure comp fans out there, but don't fret - that feature is still available via a button beside the shutter button!\n\n\n**af-on**\n\nthe newly renamed af-on button feels great and it's in the perfect -----> spot !!! . i now have back button focus enabled and it's more comfortable than on the x-t2.\n\n\n**strap**\n\nfinally a decent strap. it's very comfortable and much larger and more padded than the x-t1/x-t2. i'll still probably throw a peak design slide lite and anchors on it, but this will do for now for sure.\n\n\n**touch screen**\n\nnot a feature i thought i would use much, but i was wrong. swiping through shots is nice, and so is pinching to zoom in. i love the quick swipes in the four directions to get to different functions, like swiping down to turn the level on. touching to focus is awesome for video and tripod use!\n\n\n**ibis**\n\nthe main reason i wanted the x-h1 is the ibis and it's a dream. my 23/35/50/90 are now stabilized and it's incredible. my keeper rate on the 90mm when handheld wasn't that great when i was below 1/160s. this will boost my keeper rate through the roof. and of course it's absolutely amazing for video!\n\n\n**video**\n\nspeaking of video, i am so excited for these changes. they've doubled the bit rate to 200mbps. they've added the ability to record f-log to the card. they added 17:9. eterna is gorgeous. etc. etc.\n\n**grip**\n\nif you buy the x-h1, buy the grip. it comes with two batteries. at least in canada, you get three batteries with the camera+grip kit. the batteries are expensive on their own, so the grip is totally worth it. it boosts performance, adds more video recording time, and gives you a headphone jack. i had the grip for my x-t1 and i have one for my x-t2. this one feels even more solid. no-brainer for me.\n\n\n**closing**\n\ni still love the size and weight of the x-t2 and i will still use it, especially when i want to rock one of my small primes and keep it light. but the x-h1 is a dream. i really believe fuji has listened to their users and has created an incredible camera.\n\nnow, it's a tiny bit buggy, so i'm hoping a firmware update is coming soon. the menu doesn't pop up right away sometimes and there are some slow downs here and there. but it hasn't affected me getting shots or anything.\n\nlet me know if you have any questions or are on the fence!", "sortedWord": "None", "identifyer": 235, "year": "2018"}, {"Unnamed: 0": 207299, "autor": "nuxnemo", "date": 1531263670000, "content": "Fujifilm X-T2: I still have focus issues tracking moving subjects /!/ Hello! I very recently got my first decent camera after just using my phone for years to take photos with. I got myself a Fujifilm X-T2 with the 18-55mm kit lens. I cannot express in words how happy I am with my X-T2, and how much of a joy it is to shoot with and get into photography.\n\nSo far I have learned a lot about the camera and basic settings itself, and I watched and read a lot about both the camera and photography in general.\n\n**However, I keep having the same issue: focusing while tracking moving subjects.** Mostly pets. Many dogs, I love dogs. But today it was raining so I had to halt my dog-spotting quest and went to my parents' house to take pictures of the cat. Here is what I did:\n\n* *I put my camera on \"C\"/continuous.*\n* *I put my camera in \"CH\" mode for burst and shot at 8 fps.*\n* *I set my ISO to auto.*\n* *I used a shutter speed around 1/500 to 1/640 (anything higher seemed impossible with the amount of light).*\n* *I adapted my aperture according to the light and effect I wanted, but I do not remember shooting fully open.*\n\nBut here is where it somehow seems to go wrong, my brain kind of collapses then. I could not get the cat in focus once she starts moving and I cannot figure out how to fix it.\n\nI do not know which focus mode I should use, the manual confuses me, every website says something different and none of the settings I try give me a decent result. I tried to use the focus zone option, and started shooting photos of the cat starting off with the focus area (I used the 3 x 3 squares, not sure if that is correct?) pointed at her head, after which I kept trying to do this when she started moving.\n\n**Should I use single point focus, should I use zone focus, should I use tracking?** How large should my focus point be for a moving subject; in this case a cat or a dog? It still confuses me.\n\nThank you for reading. Hopefully someone will be able to help me!", "link": "https://www.reddit.com/r/fujifilm/comments/8xu7y1/fujifilm_xt2_i_still_have_focus_issues_tracking/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "fujifilm x-t2: i still have focus issues tracking moving subjects /!/ hello! i very recently got my first decent camera after just using my phone for years to take photos with. i got myself a fujifilm x-t2 with the 18-55mm kit lens. i cannot express in words how happy i am with my x-t2, and how much of a joy it is to shoot with and get into photography.\n\nso far i have learned a lot about the camera and basic settings itself, and i watched and read a lot about both the camera and photography in general.\n\n**however, i keep having the same issue: focusing while tracking moving subjects.** mostly pets. many dogs, i love dogs. but today it was raining so i had to halt my dog------> spotting !!!  quest and went to my parents' house to take pictures of the cat. here is what i did:\n\n* *i put my camera on \"c\"/continuous.*\n* *i put my camera in \"ch\" mode for burst and shot at 8 fps.*\n* *i set my iso to auto.*\n* *i used a shutter speed around 1/500 to 1/640 (anything higher seemed impossible with the amount of light).*\n* *i adapted my aperture according to the light and effect i wanted, but i do not remember shooting fully open.*\n\nbut here is where it somehow seems to go wrong, my brain kind of collapses then. i could not get the cat in focus once she starts moving and i cannot figure out how to fix it.\n\ni do not know which focus mode i should use, the manual confuses me, every website says something different and none of the settings i try give me a decent result. i tried to use the focus zone option, and started shooting photos of the cat starting off with the focus area (i used the 3 x 3 squares, not sure if that is correct?) pointed at her head, after which i kept trying to do this when she started moving.\n\n**should i use single point focus, should i use zone focus, should i use tracking?** how large should my focus point be for a moving subject; in this case a cat or a dog? it still confuses me.\n\nthank you for reading. hopefully someone will be able to help me!", "sortedWord": "None", "identifyer": 825, "year": "2018"}, {"Unnamed: 0": 207316, "autor": "jcdragon49", "date": 1530984012000, "content": "Lens cleaning services? /!/ Does anyone have any recommendations for a lens cleaning service? I got all the water out of my lens but it still has water spots inside some of the elements that I'd like to get cleaned if possible\n ", "link": "https://www.reddit.com/r/fujifilm/comments/8wuqgo/lens_cleaning_services/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "lens cleaning services? /!/ does anyone have any recommendations for a lens cleaning service? i got all the water out of my lens but it still has water -----> spots !!!  inside some of the elements that i'd like to get cleaned if possible\n ", "sortedWord": "None", "identifyer": 842, "year": "2018"}, {"Unnamed: 0": 207602, "autor": "SoCalDawg", "date": 1537734013000, "content": "X-E1 and spot on sensor.. just won’t come off /!/ I bought an X-E1 and just recently noticed there is a spot on the sensor. It shows up in images in the bottom left corner about 1” from the bottom left and left side. TBH, it won’t affect much of what I do .. and it can be ‘corrected’. \n\nI used a Rocket Blower to no avail. I also just cleaned the sensor A LOT using the liquid kit and it isn’t budging. Some basic research says there were some X-E1 that had dust or oil under the glass over the sensor.. meaning nothing I do will clean it.\n\nDoes anyone know what Fuji would charge to clean/fix this? I only paid $200 for the body so it likely won’t be worth it.. I just thought I would ask folks here that might know. Thanks in advance for any help/feedback.", "link": "https://www.reddit.com/r/fujifilm/comments/9ibkda/xe1_and_spot_on_sensor_just_wont_come_off/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x-e1 and -----> spot !!!  on sensor.. just won’t come off /!/ i bought an x-e1 and just recently noticed there is a spot on the sensor. it shows up in images in the bottom left corner about 1” from the bottom left and left side. tbh, it won’t affect much of what i do .. and it can be ‘corrected’. \n\ni used a rocket blower to no avail. i also just cleaned the sensor a lot using the liquid kit and it isn’t budging. some basic research says there were some x-e1 that had dust or oil under the glass over the sensor.. meaning nothing i do will clean it.\n\ndoes anyone know what fuji would charge to clean/fix this? i only paid $200 for the body so it likely won’t be worth it.. i just thought i would ask folks here that might know. thanks in advance for any help/feedback.", "sortedWord": "None", "identifyer": 1129, "year": "2018"}, {"Unnamed: 0": 207656, "autor": "KERR_KERR", "date": 1534028933000, "content": "X-T20 replaced under warranty for blurry pics /!/ More of a heads up for others here. I found my new Fuji was taking out of focus/soft/blurry pics roughly 30% of the time. The other pics were perfectly sharp. Was pretty disappointed as I've never had an issue like this even on camera phones! I googled, adjusted settings, wasted time etc but best thing I did was take it back to the shop. They put the shop lens on and I was able to replicate the issue in front of them. They punched the details into their system and gave me a brand new X-T20 on the spot. The new camera seems great so far and doesn't have the blurry-ness issue. Pic below shows the issue - 2 photos taken seconds apart at 100% crop. On the left, the entire photo was out of focus.\n\nhttps://preview.redd.it/wc00k4rrpjf11.png?width=812&amp;format=png&amp;auto=webp&amp;s=65dd91252ee264565a9308bc5d637f9b68c3639a", "link": "https://www.reddit.com/r/fujifilm/comments/96kq7r/xt20_replaced_under_warranty_for_blurry_pics/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x-t20 replaced under warranty for blurry pics /!/ more of a heads up for others here. i found my new fuji was taking out of focus/soft/blurry pics roughly 30% of the time. the other pics were perfectly sharp. was pretty disappointed as i've never had an issue like this even on camera phones! i googled, adjusted settings, wasted time etc but best thing i did was take it back to the shop. they put the shop lens on and i was able to replicate the issue in front of them. they punched the details into their system and gave me a brand new x-t20 on the -----> spot !!! . the new camera seems great so far and doesn't have the blurry-ness issue. pic below shows the issue - 2 photos taken seconds apart at 100% crop. on the left, the entire photo was out of focus.\n\nhttps://preview.redd.it/wc00k4rrpjf11.png?width=812&amp;format=png&amp;auto=webp&amp;s=65dd91252ee264565a9308bc5d637f9b68c3639a", "sortedWord": "None", "identifyer": 1183, "year": "2018"}, {"Unnamed: 0": 207676, "autor": "NineInchNips", "date": 1533693036000, "content": "Indoor Event kit -- 23mm 1.4 + 90mm or 56mm? /!/ Hey everyone! I've done a fair bit of googling as well as searching this subreddit and other subreddits and I haven't quite found the answer I'm looking for. Basically, I'm choosing between the 56mm &amp; the 90mm for I've got the X-T20 (previous X-E1 &amp; X-T10 owner) and I am trying to put together a kit for minor paid work (the occasional engagement shoot) and some putzing around in event photography for my large church as well as a local university. I own the 18-55, 55-100, 23 1.4, &amp; 35 2. To keep things fairly light I was hoping to put together a 2- or 3-lens kit for travel and paid work, and I'd like to stick with wide aperture primes during interior shoots due to generally being unable to shoot with flash. I previously used a 16 &amp; 35 combo but didn't find enough uses for the 16 for the way that I shoot. I've been told a 23 + 56 combo can be quite versatile and the quality of the glass is pretty great, so I'm looking into that, but I almost wonder if the 90 would fit into my arsenal a little better. Has anyone used the 90 and/or 56 for indoor events?\n\nMy subjects are not quick-moving, so blazing AF isn't exactly a requirement. My working distance varies considerably and I can find spots to make either focal length work (I'm not necessarily going to be too close to use the 90 or too far for the 56). I've been using the 55-200, but my shutter speeds are just not cutting it for even small movements of, say, a guest speaker at a podium. I know a lot of people recommend the 50-140, but I'm not super geeked about the size &amp; weight and I can find either of these primes for considerably less money. Then again, maybe the 90 would be comically large on my X-T20?\n\nThanks for the input! Let me know if I need to clarify anything else!", "link": "https://www.reddit.com/r/fujifilm/comments/95htnh/indoor_event_kit_23mm_14_90mm_or_56mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "indoor event kit -- 23mm 1.4 + 90mm or 56mm? /!/ hey everyone! i've done a fair bit of googling as well as searching this subreddit and other subreddits and i haven't quite found the answer i'm looking for. basically, i'm choosing between the 56mm &amp; the 90mm for i've got the x-t20 (previous x-e1 &amp; x-t10 owner) and i am trying to put together a kit for minor paid work (the occasional engagement shoot) and some putzing around in event photography for my large church as well as a local university. i own the 18-55, 55-100, 23 1.4, &amp; 35 2. to keep things fairly light i was hoping to put together a 2- or 3-lens kit for travel and paid work, and i'd like to stick with wide aperture primes during interior shoots due to generally being unable to shoot with flash. i previously used a 16 &amp; 35 combo but didn't find enough uses for the 16 for the way that i shoot. i've been told a 23 + 56 combo can be quite versatile and the quality of the glass is pretty great, so i'm looking into that, but i almost wonder if the 90 would fit into my arsenal a little better. has anyone used the 90 and/or 56 for indoor events?\n\nmy subjects are not quick-moving, so blazing af isn't exactly a requirement. my working distance varies considerably and i can find -----> spots !!!  to make either focal length work (i'm not necessarily going to be too close to use the 90 or too far for the 56). i've been using the 55-200, but my shutter speeds are just not cutting it for even small movements of, say, a guest speaker at a podium. i know a lot of people recommend the 50-140, but i'm not super geeked about the size &amp; weight and i can find either of these primes for considerably less money. then again, maybe the 90 would be comically large on my x-t20?\n\nthanks for the input! let me know if i need to clarify anything else!", "sortedWord": "None", "identifyer": 1203, "year": "2018"}], "name": "spotfujifilm2018"}