{"interestingcomments": [{"Unnamed: 0": 206973, "autor": "B0kah", "date": 1521355547000, "content": "This Instagram is off to a good start! I created this page to feature fuji only photographers, no theme necessarily, just find me and tag me in your photos and I’ll feature them in the Instagram! (I’ll usually repost 4 or 5 photos a day :) see you in there!", "link": "https://www.reddit.com/r/fujifilm/comments/859r55/this_instagram_is_off_to_a_good_start_i_created/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "this instagram is off to a good start! i created this page to feature fuji only photographers, no theme necessarily, just find me and -----> tag !!!  me in your photos and i’ll feature them in the instagram! (i’ll usually repost 4 or 5 photos a day :) see you in there!", "sortedWord": "None", "identifyer": 495, "year": "2018"}, {"Unnamed: 0": 207636, "autor": "damshawty", "date": 1536870381000, "content": "55-200 vs 50-230 /!/ Going to iceland in a month, have the xt3 preordered. Current set up is the 18-55, 16, and 35/ 1.4. Want to get some reach while for the trip. I noticed that on ebay i can get the 50-230 from taiwan for real cheap but i noticed higher f stop and can make the assumption the build suffers. I really am more interested in the IQ the lens produces, from what i can tell on IG from looking at tags, the 55-200 looks better and probably regarded the better lens, but obviously 2x the price at least. Just wanted to hear some people who have the lens recommendations and feedback, cheers!", "link": "https://www.reddit.com/r/fujifilm/comments/9flj9o/55200_vs_50230/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "55-200 vs 50-230 /!/ going to iceland in a month, have the xt3 preordered. current set up is the 18-55, 16, and 35/ 1.4. want to get some reach while for the trip. i noticed that on ebay i can get the 50-230 from taiwan for real cheap but i noticed higher f stop and can make the assumption the build suffers. i really am more interested in the iq the lens produces, from what i can tell on ig from looking at -----> tags !!! , the 55-200 looks better and probably regarded the better lens, but obviously 2x the price at least. just wanted to hear some people who have the lens recommendations and feedback, cheers!", "sortedWord": "None", "identifyer": 1163, "year": "2018"}], "name": "tagfujifilm2018"}