{"interestingcomments": [{"Unnamed: 0": 165818, "autor": "HurtMeSomeMore", "date": 1593485801000, "content": "GPS Inaccuracy /!/ Question in the accuracy of the GPS data passed from the Fuji Cam Remote app. I have a 11Pro running 13.5.1 and X100V running 1.10 firmware. I’ve connected the camera to my phone via Bluetooth and GPS tag data is being added to exif data, but I’ve noticed it’s waaay off. Sometimes as much as a few miles. Is this common for Fuji camera apps? I’m coming from a Sony A6500 and the app GPS data was never more than a few feet off.\n\nAlso I understand now that GPS data is a one time transaction, the question I have is even when not really moving from a location my position is still wildly inaccurate. For example at a birthday party this past weekend the GPS location data showed me about 1 mile from my actual location.", "link": "https://www.reddit.com/r/fujifilm/comments/hievk5/gps_inaccuracy/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "gps inaccuracy /!/ question in the accuracy of the gps data passed from the fuji cam remote app. i have a 11pro running 13.5.1 and x100v running 1.10 firmware. i’ve connected the camera to my phone via bluetooth and gps -----> tag !!!  data is being added to exif data, but i’ve noticed it’s waaay off. sometimes as much as a few miles. is this common for fuji camera apps? i’m coming from a sony a6500 and the app gps data was never more than a few feet off.\n\nalso i understand now that gps data is a one time transaction, the question i have is even when not really moving from a location my position is still wildly inaccurate. for example at a birthday party this past weekend the gps location data showed me about 1 mile from my actual location.", "sortedWord": "None", "identifyer": 57811, "year": "2020"}, {"Unnamed: 0": 169326, "autor": "Jowhu", "date": 1589769648000, "content": "X-T4 vs R6 /!/ This may be premature, but from the rumored specs of the Canon R6, it looks to be around the same performance that you would get from the X-T4. It is also to be rumored around 2k price tag of the X-T4, plus its a full framed. Anyone else thinking about switching over?", "link": "https://www.reddit.com/r/fujifilm/comments/glszqr/xt4_vs_r6/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "x-t4 vs r6 /!/ this may be premature, but from the rumored specs of the canon r6, it looks to be around the same performance that you would get from the x-t4. it is also to be rumored around 2k price -----> tag !!!  of the x-t4, plus its a full framed. anyone else thinking about switching over?", "sortedWord": "None", "identifyer": 61448, "year": "2020"}, {"Unnamed: 0": 173539, "autor": "OptimalSkin", "date": 1606559410000, "content": "Views on Fuji Refurbished /!/ I have been testing Fujifilm XT3/4 on loan since few weeks and I absolutely love the XT4 as a hybrid shooter coming in from a Nikon ecosystem. \nThe camera is too extensive for me with a price tag of £1500+\nAnd i was wondering to purchase the Fuji refurbished from their shop which is considerably cheaper. \nHas anyone purchased a Fuji refurbished camera what are your views, pros and cons?\nThanks.", "link": "https://www.reddit.com/r/fujifilm/comments/k2li6o/views_on_fuji_refurbished/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "views on fuji refurbished /!/ i have been testing fujifilm xt3/4 on loan since few weeks and i absolutely love the xt4 as a hybrid shooter coming in from a nikon ecosystem. \nthe camera is too extensive for me with a price -----> tag !!!  of £1500+\nand i was wondering to purchase the fuji refurbished from their shop which is considerably cheaper. \nhas anyone purchased a fuji refurbished camera what are your views, pros and cons?\nthanks.", "sortedWord": "None", "identifyer": 65841, "year": "2020"}, {"Unnamed: 0": 175213, "autor": "vaibhavdange", "date": 1603262684000, "content": "Buying XH1 New in 2020? Please help I’m CONFUSED! /!/ I’m a hybrid shooter and never really thought of getting a Fuji before. I came across XT3 and was amazed by the colours it produces. Can’t afford it so researched a bit more and saw XH1 which I think has a sweet price tag as of now (a little under $1200 for Body, VBP, 18-55 Lens). But there is no more ’new’ information about this camera in 2020. Like, does the sensor on XT3 makes a ‘huge’ difference as compared to the sensor on XH1 or did the updates from Fuji solved the aliasing issue while shooting high speed video.   \n\n\nTo those who currently possess this camera and shoots regular photo/video with it, should I get my hands on this?", "link": "https://www.reddit.com/r/fujifilm/comments/jf7uuc/buying_xh1_new_in_2020_please_help_im_confused/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "buying xh1 new in 2020? please help i’m confused! /!/ i’m a hybrid shooter and never really thought of getting a fuji before. i came across xt3 and was amazed by the colours it produces. can’t afford it so researched a bit more and saw xh1 which i think has a sweet price -----> tag !!!  as of now (a little under $1200 for body, vbp, 18-55 lens). but there is no more ’new’ information about this camera in 2020. like, does the sensor on xt3 makes a ‘huge’ difference as compared to the sensor on xh1 or did the updates from fuji solved the aliasing issue while shooting high speed video.   \n\n\nto those who currently possess this camera and shoots regular photo/video with it, should i get my hands on this?", "sortedWord": "None", "identifyer": 67589, "year": "2020"}, {"Unnamed: 0": 175214, "autor": "IIOracleII", "date": 1603254128000, "content": "Fuji X100V vs X-E3 vs X-T30 (with Fuji 27mm f2.8 Pancake Lens) /!/ Hi all!\n\nThis is one of my first posts, so apologies if it's in the wrong section. I'm a beginner photographer transitioning from my Google Pixel 3 to my first camera. I'm mainly looking to shoot my family for documenting memories, some portraits, and maybe a casual bit of nature/landscape photography sprinkled in. I'm really excited about Fuji due to mainly its JPEG potential with film simulations and its overall colours. With that said, I have been absolutely blown away by the images I've seen online from the X100V but am having a hard time swallowing its price tag. I've been looking for a good used deal online but in the meantime wanted opinions on whether the X-ES (with the 27mm pancake lens) would be comparable to the image quality of the X100V. I know they are different X-Trans sensors, different lens max aperture and size (but I want the compact form factor of the X100V so I take the camera with me everywhere). I've also looked into the X-T30 and that is super attractive to (alongside the same X-Trans sensor as the X100V) but is in the same price range as the X100V. I don't mind having one single lens for a while as long as it gets the job done for my needs and produces fantastic images (preferably JPEGS as I don't have much experience with editing RAW yet). Moreover, I do love the Classic Negative film simulation in the X100V but I think I can live without it with the price difference in the X-E3. I would really appreciate any and all advice to help make a decision!\n\nTL;DR is the Fuji X-E3 (with the 27mm pancake lens) comparable to the X100V?", "link": "https://www.reddit.com/r/fujifilm/comments/jf62lf/fuji_x100v_vs_xe3_vs_xt30_with_fuji_27mm_f28/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "fuji x100v vs x-e3 vs x-t30 (with fuji 27mm f2.8 pancake lens) /!/ hi all!\n\nthis is one of my first posts, so apologies if it's in the wrong section. i'm a beginner photographer transitioning from my google pixel 3 to my first camera. i'm mainly looking to shoot my family for documenting memories, some portraits, and maybe a casual bit of nature/landscape photography sprinkled in. i'm really excited about fuji due to mainly its jpeg potential with film simulations and its overall colours. with that said, i have been absolutely blown away by the images i've seen online from the x100v but am having a hard time swallowing its price -----> tag !!! . i've been looking for a good used deal online but in the meantime wanted opinions on whether the x-es (with the 27mm pancake lens) would be comparable to the image quality of the x100v. i know they are different x-trans sensors, different lens max aperture and size (but i want the compact form factor of the x100v so i take the camera with me everywhere). i've also looked into the x-t30 and that is super attractive to (alongside the same x-trans sensor as the x100v) but is in the same price range as the x100v. i don't mind having one single lens for a while as long as it gets the job done for my needs and produces fantastic images (preferably jpegs as i don't have much experience with editing raw yet). moreover, i do love the classic negative film simulation in the x100v but i think i can live without it with the price difference in the x-e3. i would really appreciate any and all advice to help make a decision!\n\ntl;dr is the fuji x-e3 (with the 27mm pancake lens) comparable to the x100v?", "sortedWord": "None", "identifyer": 67590, "year": "2020"}, {"Unnamed: 0": 175498, "autor": "jcw5000", "date": 1595645184000, "content": "Is the X-T200 a great enough camera for someone like me who wants to get into mirrorless camera photography? /!/ The X-T200 seems like a great camera with a very reasonable price tag. But I was wondering if I'm better off saving for a better model (X-T30?) in the long run. Thanks in advance for recommendations.", "link": "https://www.reddit.com/r/fujifilm/comments/hxfc7j/is_the_xt200_a_great_enough_camera_for_someone/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is the x-t200 a great enough camera for someone like me who wants to get into mirrorless camera photography? /!/ the x-t200 seems like a great camera with a very reasonable price -----> tag !!! . but i was wondering if i'm better off saving for a better model (x-t30?) in the long run. thanks in advance for recommendations.", "sortedWord": "None", "identifyer": 67884, "year": "2020"}, {"Unnamed: 0": 175695, "autor": "reinfected", "date": 1583082876000, "content": "The Fuji x100v stole my heart, but the $50 adapter ring... /!/ Hi All, \n\nAt this point, I'm pretty much sold on the Fuji x100v. What I'm not sold on is that $50 adapter ring to make it weather sealed.\n\nWhile I concede that it may be the safest bet to ensure weather protection, I can't help but wonder if there are cheaper third party options. After all, it doesn't appear to be an extremely precise technically made item that requires a high price tag. \n\nWhat third party adapter ring would you all recommend? Or would you agree that the $50 option is the best bet?", "link": "https://www.reddit.com/r/fujifilm/comments/fbx3tx/the_fuji_x100v_stole_my_heart_but_the_50_adapter/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "the fuji x100v stole my heart, but the $50 adapter ring... /!/ hi all, \n\nat this point, i'm pretty much sold on the fuji x100v. what i'm not sold on is that $50 adapter ring to make it weather sealed.\n\nwhile i concede that it may be the safest bet to ensure weather protection, i can't help but wonder if there are cheaper third party options. after all, it doesn't appear to be an extremely precise technically made item that requires a high price -----> tag !!! . \n\nwhat third party adapter ring would you all recommend? or would you agree that the $50 option is the best bet?", "sortedWord": "None", "identifyer": 68089, "year": "2020"}], "name": "tagfujifilm2020"}