{"interestingcomments": [{"autor": "Nt12345678909876", "date": 1607694990000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb382q/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603353, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1607694713000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb35eg/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603354, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1607694567000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb3406/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603355, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1607694390000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb32aj/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603356, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1607694342000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb31rx/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603357, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1607694099000, "content": "6 Major Branches of Artificial Intelligence (AI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kb2za5/6_major_branches_of_artificial_intelligence_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 major -----> branches !!!  of artificial intelligence (ai)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.analyticssteps.com/blogs/6-major-branches-artificial-intelligence-ai',)", "identifyer": 5603359, "year": "2020"}, {"autor": "_ginj_", "date": 1582867393000, "content": "What would an AI driven US government look like? /!/ Hello everyone, just some shower thoughts that came to me today... What would the state of US federal law look like, given a start at the USA Constitution w/ BoR as framework, and the legislative branch ran by machine learning? How do you think the neural network would be structured? What passively collected inputs would be required to make it even feasible? I truly know very little about government or AI in general but the idea of overhauling the least efficient system I can think of with the most efficient intrigues me.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/fapr28/what_would_an_ai_driven_us_government_look_like/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "what would an ai driven us government look like? /!/ hello everyone, just some shower thoughts that came to me today... what would the state of us federal law look like, given a start at the usa constitution w/ bor as framework, and the legislative -----> branch !!!  ran by machine learning? how do you think the neural network would be structured? what passively collected inputs would be required to make it even feasible? i truly know very little about government or ai in general but the idea of overhauling the least efficient system i can think of with the most efficient intrigues me.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 22, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/fapr28/what_would_an_ai_driven_us_government_look_like/',)", "identifyer": 5603491, "year": "2020"}, {"autor": "carminemorphio", "date": 1603819547000, "content": "6 Surprising Ways You’re Using AI Without Realizing it /!/ Hey everyone! I wanted to share a fun and interesting post on 6 ways you're using artificial intelligence without realizing it.\n\n It’s so easy to think about sophisticated robots and self-driving cars (More on those later) when you hear about AI—but there are many other ways it integrates into our lives. \n\nSeeing as [the AI market size is estimated](https://www.statista.com/statistics/941835/artificial-intelligence-market-size-revenue-comparisons/) to be worth up to $190 billion, it’ll become more obvious over time.\n\nNonetheless, artificial intelligence is saving you energy, keeping you safe, and making your life much more convenient while right under your nose. \n\nWant to see how? Keep reading.\n\n## 1. Google Maps\n\nRemember that last time you road-tripped with your kids up to the cottage? Yep, that was artificial intelligence. It helped you stay safe and get you to your destination faster. \n\nThis is because Google Maps, just like most map applications, is powered by AI. It’s capable of finding the fastest and safest routes in real-time as traffic and road conditions change. \n\nGoogle uses machine learning to analyze real-time data and make predictions about distance travelled potential interruptions and more.\n\nTake a look at how they also use [machine learning models to forecast bus delays](https://ai.googleblog.com/2019/06/predicting-bus-delays-with-machine.html) in cities.\n\nData is extracted from transit agencies’ feeds about bus positions related to car traffic speed and their planned stops. This helps people like you remain on schedule to work, school, etc.\n\nThat brings me to my next point.\n\n## 2. Search engines\n\nHello, Google. Could you tell me if you’re powered by AI? The answer is *yes*. \n\nBoth Google and its voice search counterpart is the best example of the daily use of AI. Who isn’t quick to pull out their phone and use Google when they need to know something?\n\nThe search engine uses AI to predict what searches you want along with the most relevant results. Machine learning also continually refines the results and recommended searches based on the billions of inputs it receives every year.\n\nThat means that not only are you using AI, you’re also contributing to making it more intelligent and improving the experience of other people all around the world!\n\n## 3. Siri\n\nHow many times have you heard “Hey, Siri” followed by a question? Heck, you might do it yourself every day. From checking basic information to scheduling events, Siri’s advanced machine learning technology supports a massive range of user commands. \n\nFurthermore, it’s capable of detecting language and improving its *ability* to pick up on spoken words. This is because Siri uses branches of AI known as natural language processing (NLP) and natural language generation (NLG.)\n\nYou can think of Siri as a search engine, as well. It uses the information it receives from users to improve the next query. Both errors and correct answers are noted to enhance the overall database of answers.\n\nHere’s a cool fact, too: Siri’s co-founder, Dag Kittlaus, [named the technology Siri](https://www.networkworld.com/article/2221246/steve-jobs-wasn-t-a-fan-of-the-siri-name.html) because it means “beautiful woman who leads you to victory” in Norwegian. \n\nThat’s how I like to view AI: a technology that moves us towards achieving goals.\n\n## 4. Have you ever driven a Tesla?\n\nNo matter what you’re opinion is on the Tesla Cybertruck, Elon Musk is a genius. The self-driving technology implemented into Tesla’s cars is [a fine example of AI](https://www.forbes.com/sites/forbesagencycouncil/2020/01/13/five-emerging-ai-trends-to-watch-in-2020/) and machine learning. \n\nFirstly, the car is capable of navigating through traffic, speeding up, stopping, changing lanes, and more. It’s practically alive. Furthermore, machine learning continually improves how safe the car navigates, learns new roads, etc.\n\nThis also is thanks to the [DeepScale deep neural network software](https://www.prnewswire.com/news-releases/deepscale-attracts-15-million-investment-to-advance-automated-vehicle-perception-300623164.html) which detects objects of significance.\n\nThese include pedestrians, vehicles, debris, and other items that may come near you while driving. The AI continually learns how to detect and navigate these things better for continually safer driving.\n\n## 5. Uber\n\nYou’re out with a few friends and have some drinks. How do you get home? Most likely Uber or Lyft, right? You can thank artificial intelligence for getting you home safe. \n\nThis is because rideshare apps like Uber use AI to determine the price of your ride, minimizing wait time, routing the driver to you, etc.\n\nFor example, [the Uber heatmap](https://www.wired.com/2011/04/app-stars-uber/) shows drivers high traffic areas where rides will be in high demand.\n\nHow is this done? You guessed it: *artificial intelligence*. Their system measures and predicts demand based on requests along with weather-forecasting data. \n\nNo matter if you’re using an app like Uber to generate income or get around town, AI plays a role on both sides.\n\n## 6. The spam filter of your inbox\n\nWe all receive spam emails. In fact, there are approximately [14.5 billion spam messages sent every day](https://www.spamlaws.com/spam-stats.html).\n\nHowever, many times they never come across your eyes. Why is this? *The spam box*. This is an integral part of every email platform and—in case you don’t know—it’s powered by AI. \n\nSpam filters are intelligent enough to decipher what message appears to be sent by humans or bots before appropriately filtering them. Additionally, some use machine learning to pick up on common traits and patterns to continually give you a better email experience.\n\n## Final thoughts\n\nAI isn’t as intimidating as some think. It’s not reserved strictly for business, and in reality, is all around us.\n\nEverything from the apps we use to public transportation is being integrated with AI. The best part is that we don’t realize this because it’s so subtle. It’s improving our daily lives while flying under the radar.\n\nWhat are other ways you know or think we use AI without realizing it? Feel free to read the full article [here](https://morphio.ai/blog/6-surprising-ways-youre-using-ai-without-realizing-it/) to see the added visuals.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jj5j0t/6_surprising_ways_youre_using_ai_without/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "6 surprising ways you’re using ai without realizing it /!/ hey everyone! i wanted to share a fun and interesting post on 6 ways you're using artificial intelligence without realizing it.\n\n it’s so easy to think about sophisticated robots and self-driving cars (more on those later) when you hear about ai—but there are many other ways it integrates into our lives. \n\nseeing as [the ai market size is estimated](https://www.statista.com/statistics/941835/artificial-intelligence-market-size-revenue-comparisons/) to be worth up to $190 billion, it’ll become more obvious over time.\n\nnonetheless, artificial intelligence is saving you energy, keeping you safe, and making your life much more convenient while right under your nose. \n\nwant to see how? keep reading.\n\n## 1. google maps\n\nremember that last time you road-tripped with your kids up to the cottage? yep, that was artificial intelligence. it helped you stay safe and get you to your destination faster. \n\nthis is because google maps, just like most map applications, is powered by ai. it’s capable of finding the fastest and safest routes in real-time as traffic and road conditions change. \n\ngoogle uses machine learning to analyze real-time data and make predictions about distance travelled potential interruptions and more.\n\ntake a look at how they also use [machine learning models to forecast bus delays](https://ai.googleblog.com/2019/06/predicting-bus-delays-with-machine.html) in cities.\n\ndata is extracted from transit agencies’ feeds about bus positions related to car traffic speed and their planned stops. this helps people like you remain on schedule to work, school, etc.\n\nthat brings me to my next point.\n\n## 2. search engines\n\nhello, google. could you tell me if you’re powered by ai? the answer is *yes*. \n\nboth google and its voice search counterpart is the best example of the daily use of ai. who isn’t quick to pull out their phone and use google when they need to know something?\n\nthe search engine uses ai to predict what searches you want along with the most relevant results. machine learning also continually refines the results and recommended searches based on the billions of inputs it receives every year.\n\nthat means that not only are you using ai, you’re also contributing to making it more intelligent and improving the experience of other people all around the world!\n\n## 3. siri\n\nhow many times have you heard “hey, siri” followed by a question? heck, you might do it yourself every day. from checking basic information to scheduling events, siri’s advanced machine learning technology supports a massive range of user commands. \n\nfurthermore, it’s capable of detecting language and improving its *ability* to pick up on spoken words. this is because siri uses -----> branches !!!  of ai known as natural language processing (nlp) and natural language generation (nlg.)\n\nyou can think of siri as a search engine, as well. it uses the information it receives from users to improve the next query. both errors and correct answers are noted to enhance the overall database of answers.\n\nhere’s a cool fact, too: siri’s co-founder, dag kittlaus, [named the technology siri](https://www.networkworld.com/article/2221246/steve-jobs-wasn-t-a-fan-of-the-siri-name.html) because it means “beautiful woman who leads you to victory” in norwegian. \n\nthat’s how i like to view ai: a technology that moves us towards achieving goals.\n\n## 4. have you ever driven a tesla?\n\nno matter what you’re opinion is on the tesla cybertruck, elon musk is a genius. the self-driving technology implemented into tesla’s cars is [a fine example of ai](https://www.forbes.com/sites/forbesagencycouncil/2020/01/13/five-emerging-ai-trends-to-watch-in-2020/) and machine learning. \n\nfirstly, the car is capable of navigating through traffic, speeding up, stopping, changing lanes, and more. it’s practically alive. furthermore, machine learning continually improves how safe the car navigates, learns new roads, etc.\n\nthis also is thanks to the [deepscale deep neural network software](https://www.prnewswire.com/news-releases/deepscale-attracts-15-million-investment-to-advance-automated-vehicle-perception-300623164.html) which detects objects of significance.\n\nthese include pedestrians, vehicles, debris, and other items that may come near you while driving. the ai continually learns how to detect and navigate these things better for continually safer driving.\n\n## 5. uber\n\nyou’re out with a few friends and have some drinks. how do you get home? most likely uber or lyft, right? you can thank artificial intelligence for getting you home safe. \n\nthis is because rideshare apps like uber use ai to determine the price of your ride, minimizing wait time, routing the driver to you, etc.\n\nfor example, [the uber heatmap](https://www.wired.com/2011/04/app-stars-uber/) shows drivers high traffic areas where rides will be in high demand.\n\nhow is this done? you guessed it: *artificial intelligence*. their system measures and predicts demand based on requests along with weather-forecasting data. \n\nno matter if you’re using an app like uber to generate income or get around town, ai plays a role on both sides.\n\n## 6. the spam filter of your inbox\n\nwe all receive spam emails. in fact, there are approximately [14.5 billion spam messages sent every day](https://www.spamlaws.com/spam-stats.html).\n\nhowever, many times they never come across your eyes. why is this? *the spam box*. this is an integral part of every email platform and—in case you don’t know—it’s powered by ai. \n\nspam filters are intelligent enough to decipher what message appears to be sent by humans or bots before appropriately filtering them. additionally, some use machine learning to pick up on common traits and patterns to continually give you a better email experience.\n\n## final thoughts\n\nai isn’t as intimidating as some think. it’s not reserved strictly for business, and in reality, is all around us.\n\neverything from the apps we use to public transportation is being integrated with ai. the best part is that we don’t realize this because it’s so subtle. it’s improving our daily lives while flying under the radar.\n\nwhat are other ways you know or think we use ai without realizing it? feel free to read the full article [here](https://morphio.ai/blog/6-surprising-ways-youre-using-ai-without-realizing-it/) to see the added visuals.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jj5j0t/6_surprising_ways_youre_using_ai_without/',)", "identifyer": 5603632, "year": "2020"}, {"autor": "UAEVOICE_EN", "date": 1594295480000, "content": "ِAbu Dhabi Housing Authority applies the Business Process Automation System, which is one of the branches of Artificial Intelligence and the most important technical systems that were adopted by the Authority in developing and improving its services.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ho1qcb/abu_dhabi_housing_authority_applies_the_business/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "ِabu dhabi housing authority applies the business process automation system, which is one of the -----> branches !!!  of artificial intelligence and the most important technical systems that were adopted by the authority in developing and improving its services.", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('image',)", "medialink": "('https://i.redd.it/i6kp06uglt951.jpg',)", "identifyer": 5604975, "year": "2020"}, {"autor": "DeepVisionAI", "date": 1595825485000, "content": "[Resource] An Amazing Free Crash Course on Deep Learning for Beginners! /!/ Hey all! I wanted to introduce you to this Deep Learning course I came across recently. As many of you are aware, Deep Learning is the secret sauce behind many exciting developments in the field of Artificial Intelligence, from face recognition systems to the autonomous vehicles by Waymo and Tesla. \n\nI actually quit my degree in Media Studies to enter this exciting new world and was introduced to this branch of Machine Learning - Deep Learning. Curious to know more, I stumbled on this \"Deep Learning Crash Course\" by Jason Dsouza and was absolutely enthralled by it. \n\nIt is a non-mathematical-non-programming approach to core Deep Learning concepts that I know will be beneficial to everyone like it did to me. I know that the video doesn't have many views, but it was a life-saver to me! Without talking any further, here is the course that quite literally saved my life and blossomed in my love for AI! \n\n[https://youtu.be/OrxfB1L7P3Q](https://youtu.be/OrxfB1L7P3Q)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hylu5l/resource_an_amazing_free_crash_course_on_deep/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "[resource] an amazing free crash course on deep learning for beginners! /!/ hey all! i wanted to introduce you to this deep learning course i came across recently. as many of you are aware, deep learning is the secret sauce behind many exciting developments in the field of artificial intelligence, from face recognition systems to the autonomous vehicles by waymo and tesla. \n\ni actually quit my degree in media studies to enter this exciting new world and was introduced to this -----> branch !!!  of machine learning - deep learning. curious to know more, i stumbled on this \"deep learning crash course\" by jason dsouza and was absolutely enthralled by it. \n\nit is a non-mathematical-non-programming approach to core deep learning concepts that i know will be beneficial to everyone like it did to me. i know that the video doesn't have many views, but it was a life-saver to me! without talking any further, here is the course that quite literally saved my life and blossomed in my love for ai! \n\n[https://youtu.be/orxfb1l7p3q](https://youtu.be/orxfb1l7p3q)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hylu5l/resource_an_amazing_free_crash_course_on_deep/',)", "identifyer": 5606009, "year": "2020"}, {"autor": "Robin5409", "date": 1595697757000, "content": "6 Common Applications of Machine Learning That Are Hiding in Plain Sight /!/  \n\nhttps://preview.redd.it/hny61um4f1d51.jpg?width=696&amp;format=pjpg&amp;auto=webp&amp;s=4d2aca4b0f7b294b135e545d292c79a035ea480a\n\nTop Machine Learning Applications in 2020\n\n1. **Dynamic Pricing**\n2. **Transportation and Commuting**\n3. **Fraud Detection**\n4. **Virtual Personal Assistant**\n5. **Social Media**\n6. **Instant Translation**\n\nMachine Learning, a sub-branch of [Artificial Intelligence](https://www.greatlearning.in/pg-program-artificial-intelligence-course), has established itself as the new go-to technology for businesses worldwide. Whether it is e-commerce or healthcare, almost all the industries are using Machine Learning extensively to make futuristic solutions and products. Machine Learning depends heavily on programs and algorithms that help machines self-learn without having to be instructed explicitly. Machine Learning is pretty much dictating our daily lives- how, you wonder? Let’s look at the top applications of Machine Learning to understand how it is shaping the digital economy.\n\n## 1. Dynamic Pricing\n\nAs crucial as it is, pricing strategy is one of the oldest puzzles of the modern economy. Whether it is the entertainment industry or the consumables industry, efficient product pricing is essential for profit margins and affordability. Depending on the objective, there are several pricing strategies that businesses can choose for sales and marketing. However, choosing the right pricing strategy is easier said than done. Several decisive factors like cost of production, consumer demographics, demand curve, market control, value and more need to be adequately aligned for any product to be priced properly. Thankfully, Artificial Intelligence has effectively resolved this issue in recent times. AI-powered pricing solutions have helped businesses understand consumer purchasing behaviour and price their products accordingly.\n\nMachine learning tools use insights from data to create logic. This process improves with the amount of data that is fed to the machine learning system — the more the data, the better the results. Without using direct programs, these machine learning softwares use humongous amounts of data to improvise and deliver accurate pricing strategies. Machine learning algorithms use extensive data analysis to find optimised solution functionality. These softwares use various ML pricing models like granular customer segmentation with cluster analysis and competitor and attribute-based pricing and KPI-based pricing to reach an optimised pricing range.\n\n## 2. Transportation and Commuting\n\nAll the taxi-booking, vacation planning apps that you use run on machine learning. Whether it is customer experience or demand-supply gap, machine learning systems use data to manage and optimise the booking process. While using a ride-booking app, you must have come across recommended destinations. Machine learning algorithms use historical data to understand the most frequently travelled routes and provide suggestions accordingly. Apps like Uber and Ola use extensive data analysis to predict time and areas of demand. Once the app calculates the demand, drivers are alerted so that they can offer rides for that particular area. This is how ride-hailing companies manage the demand-supply gap. Machine learning algorithms also reduce ETA by recommending the fastest routes in real-time. For peak hours, this demand-supply predictions work by suggesting higher prices to make these services profitable.\n\nVacation planning apps use the same system to recommend the cheapest flight fares, hotel bookings, and more.\n\n## 3. Fraud Detection\n\nWhile the vast amount of data available on the internet makes for a great case of data studies and analysis, it also increases the chances of fraudulent activities. Machine learning is emerging as an effective technology to secure our cyberspace. Supervised and unsupervised ML models are being used to detect different kinds of online frauds, ranging from spotting anomalous behaviour to preventing money laundering. Even the entertainment and media industry is facing undeniable problems with online frauds. Fake news is a big issue today that can disturb the economic and political situation of any nation. ML semantic analysis studies structured, unstructured and table-type data to detect fake claims and news. ML algorithms also look through existing repositories of news to find similar claims and validate the authenticity of any news piece.\n\nSame holds true for online scams and identity threats. Fraud analysts across industries rely heavily on machine learning tools to investigate claims, news and more.\n\n## 4. Virtual Personal Assistant\n\nVirtual personal assistants have surfaced as one of the most significant finds of the 21st century. Machine learning algorithms have done phenomenal work in the field of speech recognition, natural language processing, text to speech and speech to text conversion. Once you ask them a question, they scan through the internet to find you relevant answers. In addition to that, they also keep track of your schedule, goals, and preferences to recommend relevant information. These virtual personal assistants feed on all your queries and inputs ( asking about the weather or the traffic) to continually improve and self-learn.\n\nML algorithms collect and refine information on the basis of any user’s past behaviour. This process helps in customising results according to the user profile.\n\n## 5. Social Media\n\nWith more than 2.5 billion active users every month, social media platforms like Facebook and more are some of the biggest communities today. Social media has become an indispensable part of our lives. Targeted ads, friend suggestions, and personalised news feed are a few of the ways in which machine learning algorithms are improving our experience. Machine learning algorithms go through your profile to understand the friend requests you send, friends you connect with, groups you join, your interests, and based on that provide suggestions on who you can become friends with. Similarly, for Pinterest, ML algorithms recommend similar pins based on the objects (pins) you have pinned in the past. Computer vision, a subset of machine learning, scans through images to identify objects and patterns and uses this data to create recommendations.\n\nComputer vision is also used for the face recognition feature in Facebook and Google. Every time Facebook asks you to tag yourself in a photo, it is because computer vision has scanned through your facial features to recognise the features unique to you. Once the ML systems have collected sufficient data on your facial features, it can accurately suggest the tag.\n\n## 6. Instant Translation\n\nGoogle Translate and other such apps are making language barriers a thing of the past. Apps like Google Translate and iTranslate use machine learning algorithms to make translation as accurate and semantic as possible. The ML programs too have evolved from rudimentary levels to include complex sentence structures and broader contexts.\n\nGoogle Neural Machine Translation uses Natural Language Processing to self learn from numerous languages and exhaustive dictionaries to translate languages correctly. It also uses techniques like NER (Named Entity Recognition), Chunking, POS tagging and more to understand language intonation and deliver the most relevant translation. Translation techniques include:\n\nDual learning: Texts are translated back and forth from one language to another repeatedly until a natural, accurate translation is delivered.\n\nDeliberation Networks: Similar to dual learning, this method involves translating the same text over and over again to improve the final results.\n\nAgreement regulation: ML algorithms read text from left to right and then from right to left again to create a match. The end result is a consensus from both directions to eradicate errors.\n\nMachine Learning has clearly made an entry into our lives and is here to stay. Its applications are no longer limited to enterprise use. ML programs and algorithms have evolved over time and taken over most industries to improve consumer experiences.\n\nIf you are interested in the domain of AI and machine learning and want to learn more about the subject, check out [Great Learning’s PG program in Artificial Intelligence and Machine Learning](https://www.greatlearning.in/pg-program-artificial-intelligence-course).", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hxqfm8/6_common_applications_of_machine_learning_that/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "6 common applications of machine learning that are hiding in plain sight /!/  \n\nhttps://preview.redd.it/hny61um4f1d51.jpg?width=696&amp;format=pjpg&amp;auto=webp&amp;s=4d2aca4b0f7b294b135e545d292c79a035ea480a\n\ntop machine learning applications in 2020\n\n1. **dynamic pricing**\n2. **transportation and commuting**\n3. **fraud detection**\n4. **virtual personal assistant**\n5. **social media**\n6. **instant translation**\n\nmachine learning, a sub------> branch !!!  of [artificial intelligence](https://www.greatlearning.in/pg-program-artificial-intelligence-course), has established itself as the new go-to technology for businesses worldwide. whether it is e-commerce or healthcare, almost all the industries are using machine learning extensively to make futuristic solutions and products. machine learning depends heavily on programs and algorithms that help machines self-learn without having to be instructed explicitly. machine learning is pretty much dictating our daily lives- how, you wonder? let’s look at the top applications of machine learning to understand how it is shaping the digital economy.\n\n## 1. dynamic pricing\n\nas crucial as it is, pricing strategy is one of the oldest puzzles of the modern economy. whether it is the entertainment industry or the consumables industry, efficient product pricing is essential for profit margins and affordability. depending on the objective, there are several pricing strategies that businesses can choose for sales and marketing. however, choosing the right pricing strategy is easier said than done. several decisive factors like cost of production, consumer demographics, demand curve, market control, value and more need to be adequately aligned for any product to be priced properly. thankfully, artificial intelligence has effectively resolved this issue in recent times. ai-powered pricing solutions have helped businesses understand consumer purchasing behaviour and price their products accordingly.\n\nmachine learning tools use insights from data to create logic. this process improves with the amount of data that is fed to the machine learning system — the more the data, the better the results. without using direct programs, these machine learning softwares use humongous amounts of data to improvise and deliver accurate pricing strategies. machine learning algorithms use extensive data analysis to find optimised solution functionality. these softwares use various ml pricing models like granular customer segmentation with cluster analysis and competitor and attribute-based pricing and kpi-based pricing to reach an optimised pricing range.\n\n## 2. transportation and commuting\n\nall the taxi-booking, vacation planning apps that you use run on machine learning. whether it is customer experience or demand-supply gap, machine learning systems use data to manage and optimise the booking process. while using a ride-booking app, you must have come across recommended destinations. machine learning algorithms use historical data to understand the most frequently travelled routes and provide suggestions accordingly. apps like uber and ola use extensive data analysis to predict time and areas of demand. once the app calculates the demand, drivers are alerted so that they can offer rides for that particular area. this is how ride-hailing companies manage the demand-supply gap. machine learning algorithms also reduce eta by recommending the fastest routes in real-time. for peak hours, this demand-supply predictions work by suggesting higher prices to make these services profitable.\n\nvacation planning apps use the same system to recommend the cheapest flight fares, hotel bookings, and more.\n\n## 3. fraud detection\n\nwhile the vast amount of data available on the internet makes for a great case of data studies and analysis, it also increases the chances of fraudulent activities. machine learning is emerging as an effective technology to secure our cyberspace. supervised and unsupervised ml models are being used to detect different kinds of online frauds, ranging from spotting anomalous behaviour to preventing money laundering. even the entertainment and media industry is facing undeniable problems with online frauds. fake news is a big issue today that can disturb the economic and political situation of any nation. ml semantic analysis studies structured, unstructured and table-type data to detect fake claims and news. ml algorithms also look through existing repositories of news to find similar claims and validate the authenticity of any news piece.\n\nsame holds true for online scams and identity threats. fraud analysts across industries rely heavily on machine learning tools to investigate claims, news and more.\n\n## 4. virtual personal assistant\n\nvirtual personal assistants have surfaced as one of the most significant finds of the 21st century. machine learning algorithms have done phenomenal work in the field of speech recognition, natural language processing, text to speech and speech to text conversion. once you ask them a question, they scan through the internet to find you relevant answers. in addition to that, they also keep track of your schedule, goals, and preferences to recommend relevant information. these virtual personal assistants feed on all your queries and inputs ( asking about the weather or the traffic) to continually improve and self-learn.\n\nml algorithms collect and refine information on the basis of any user’s past behaviour. this process helps in customising results according to the user profile.\n\n## 5. social media\n\nwith more than 2.5 billion active users every month, social media platforms like facebook and more are some of the biggest communities today. social media has become an indispensable part of our lives. targeted ads, friend suggestions, and personalised news feed are a few of the ways in which machine learning algorithms are improving our experience. machine learning algorithms go through your profile to understand the friend requests you send, friends you connect with, groups you join, your interests, and based on that provide suggestions on who you can become friends with. similarly, for pinterest, ml algorithms recommend similar pins based on the objects (pins) you have pinned in the past. computer vision, a subset of machine learning, scans through images to identify objects and patterns and uses this data to create recommendations.\n\ncomputer vision is also used for the face recognition feature in facebook and google. every time facebook asks you to tag yourself in a photo, it is because computer vision has scanned through your facial features to recognise the features unique to you. once the ml systems have collected sufficient data on your facial features, it can accurately suggest the tag.\n\n## 6. instant translation\n\ngoogle translate and other such apps are making language barriers a thing of the past. apps like google translate and itranslate use machine learning algorithms to make translation as accurate and semantic as possible. the ml programs too have evolved from rudimentary levels to include complex sentence structures and broader contexts.\n\ngoogle neural machine translation uses natural language processing to self learn from numerous languages and exhaustive dictionaries to translate languages correctly. it also uses techniques like ner (named entity recognition), chunking, pos tagging and more to understand language intonation and deliver the most relevant translation. translation techniques include:\n\ndual learning: texts are translated back and forth from one language to another repeatedly until a natural, accurate translation is delivered.\n\ndeliberation networks: similar to dual learning, this method involves translating the same text over and over again to improve the final results.\n\nagreement regulation: ml algorithms read text from left to right and then from right to left again to create a match. the end result is a consensus from both directions to eradicate errors.\n\nmachine learning has clearly made an entry into our lives and is here to stay. its applications are no longer limited to enterprise use. ml programs and algorithms have evolved over time and taken over most industries to improve consumer experiences.\n\nif you are interested in the domain of ai and machine learning and want to learn more about the subject, check out [great learning’s pg program in artificial intelligence and machine learning](https://www.greatlearning.in/pg-program-artificial-intelligence-course).", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hxqfm8/6_common_applications_of_machine_learning_that/',)", "identifyer": 5606034, "year": "2020"}, {"autor": "JashRathod99", "date": 1606630740000, "content": "Branches in Artificial Intelligence to Transform Your Business! /!/ [removed]", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k34i6z/branches_in_artificial_intelligence_to_transform/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "-----> branches !!!  in artificial intelligence to transform your business! /!/ [removed]", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/k34i6z/branches_in_artificial_intelligence_to_transform/',)", "identifyer": 5606144, "year": "2020"}, {"autor": "manishmanalath", "date": 1598339165000, "content": "A Beginner’s Guide To Natural Language Processing /!/ Natural Language Processing (NLP) is the branch of machine learning that helps computers interpret natural human language. In this article you will learn how NLP works along with real world use cases: [https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59](https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ig78un/a_beginners_guide_to_natural_language_processing/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "a beginner’s guide to natural language processing /!/ natural language processing (nlp) is the -----> branch !!!  of machine learning that helps computers interpret natural human language. in this article you will learn how nlp works along with real world use cases: [https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59](https://medium.com/manishmshiva/a-beginners-guide-to-natural-language-processing-a119e919dd59)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ig78un/a_beginners_guide_to_natural_language_processing/',)", "identifyer": 5606610, "year": "2020"}], "name": "branchArtificialInteligence2020"}