{"interestingcomments": [{"autor": "Silvetooo", "date": 1552916842000, "content": "Apart from ML, what other branches does AI have?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b2ixhe/apart_from_ml_what_other_branches_does_ai_have/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branches", "selectorShort": "branch", "MarkedSent": "apart from ml, what other -----> branches !!!  does ai have?", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/b2ixhe/apart_from_ml_what_other_branches_does_ai_have/',)", "identifyer": 5836035, "year": "2019"}, {"autor": "OliviaWillson", "date": 1575278738000, "content": "Worldwide Most Promising Artificial Intelligence Companies 2020 /!/ To get the most promising [**artificial intelligence (AI) company**](https://www.webtunix.com/) with high-quality ai services. AI is a branch of computer science. We work according to the requirements of our clients and provide the best services and solutions. For AI.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/e4wnu9/worldwide_most_promising_artificial_intelligence/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "worldwide most promising artificial intelligence companies 2020 /!/ to get the most promising [**artificial intelligence (ai) company**](https://www.webtunix.com/) with high-quality ai services. ai is a -----> branch !!!  of computer science. we work according to the requirements of our clients and provide the best services and solutions. for ai.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/e4wnu9/worldwide_most_promising_artificial_intelligence/',)", "identifyer": 5837416, "year": "2019"}, {"autor": "emilycara", "date": 1569586373000, "content": "Sachin Dev Duggal Explains How Engineer.ai Platform Provides 360-degree Solution /!/ [***Engineer.ai***](https://www.thehindubusinessline.com/info-tech/engineerai-launches-app-for-custom-built-digital-products/article24094910.ece) is a platform that does what an in-house engineering team would do without any of the cost of running and managing one. Sachin Dev Duggal, Co-founder &amp; Chief Wizard of Engineer.ai explains how the platform provides 360-degree solution for any business to operate, manage and scale up their technology needs.\n\n[Engineer.ai](https://Engineer.ai) is a human-assisted Artificial Intelligence (AI) that empowers everyone to build and operate software projects. Established in 2013 in San Francisco, the startup has a branch office in Gurgaon. “Four years ago, we started out with a dream to be the connection between every great idea and a fully realized product. \n\n&amp;#x200B;\n\n[Sachin Dev Duggal, Engineer.ai CEO](https://i.redd.it/rxkhtn04o4p31.jpg)\n\nThe idea is to empower everyone to build their ideas; especially given that only 3 per cent of people are successful in taking an idea to a live product,” says [**Sachin Dev Duggal**](https://www.moneycontrol.com/news/tags/sachin-dev-duggal.html), Co-founder &amp; Chief Wizard of Engineer.ai, adding that to achieve this, they went right back to the drawing board on how software is made today.\n\nThey looked at best practices across industries and landed on the magic Henry Ford did with his assembly line. “Back in the 1900s, cars were produced by a small group of people that did everything from the engine to the seats. Now, it’s all on an assembly line where different teams from around the world work on their specific areas bringing their respective core competencies to the finalized product. \n\nWe are applying this methodology to custom-built software by employing an AI-powered assembly line. This line brings together building blocks of frequently used features (“building blocks”) and the best human talent from around the world,” states Sachin Duggal, pointing out that the result is delivering at 3x the speed and one-fourth the price. This is possible because the customers do not pay for code that’s already been written 100 times; instead only paying for what is unique and customized.\n\n**Read Full Article @** [*https://www.expresscomputer.in/artificial-intelligence-ai/human-assisted-ai-for-new-generation-businesses/29350/*](https://www.expresscomputer.in/artificial-intelligence-ai/human-assisted-ai-for-new-generation-businesses/29350/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d9zima/sachin_dev_duggal_explains_how_engineerai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "sachin dev duggal explains how engineer.ai platform provides 360-degree solution /!/ [***engineer.ai***](https://www.thehindubusinessline.com/info-tech/engineerai-launches-app-for-custom-built-digital-products/article24094910.ece) is a platform that does what an in-house engineering team would do without any of the cost of running and managing one. sachin dev duggal, co-founder &amp; chief wizard of engineer.ai explains how the platform provides 360-degree solution for any business to operate, manage and scale up their technology needs.\n\n[engineer.ai](https://engineer.ai) is a human-assisted artificial intelligence (ai) that empowers everyone to build and operate software projects. established in 2013 in san francisco, the startup has a -----> branch !!!  office in gurgaon. “four years ago, we started out with a dream to be the connection between every great idea and a fully realized product. \n\n&amp;#x200b;\n\n[sachin dev duggal, engineer.ai ceo](https://i.redd.it/rxkhtn04o4p31.jpg)\n\nthe idea is to empower everyone to build their ideas; especially given that only 3 per cent of people are successful in taking an idea to a live product,” says [**sachin dev duggal**](https://www.moneycontrol.com/news/tags/sachin-dev-duggal.html), co-founder &amp; chief wizard of engineer.ai, adding that to achieve this, they went right back to the drawing board on how software is made today.\n\nthey looked at best practices across industries and landed on the magic henry ford did with his assembly line. “back in the 1900s, cars were produced by a small group of people that did everything from the engine to the seats. now, it’s all on an assembly line where different teams from around the world work on their specific areas bringing their respective core competencies to the finalized product. \n\nwe are applying this methodology to custom-built software by employing an ai-powered assembly line. this line brings together building blocks of frequently used features (“building blocks”) and the best human talent from around the world,” states sachin duggal, pointing out that the result is delivering at 3x the speed and one-fourth the price. this is possible because the customers do not pay for code that’s already been written 100 times; instead only paying for what is unique and customized.\n\n**read full article @** [*https://www.expresscomputer.in/artificial-intelligence-ai/human-assisted-ai-for-new-generation-businesses/29350/*](https://www.expresscomputer.in/artificial-intelligence-ai/human-assisted-ai-for-new-generation-businesses/29350/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d9zima/sachin_dev_duggal_explains_how_engineerai/',)", "identifyer": 5838726, "year": "2019"}, {"autor": "priya1209", "date": 1568638589000, "content": "What is Artificial Intelligence ? /!/  According to John McCarthy (father of Artificial Intelligence), it is “The science and engineering of making intelligent machines, especially intelligent computer programs”.\n\nIt is a branch of Computer Science named Artificial Intelligence pursues creating computers or machines as intelligent as human beings. It is a way of making a computer, a computer-controlled robot, or a software think intelligently, in a similar manner the intelligent humans believe.\n\nIn another way we define, [Artificial Intelligence](https://www.learntek.org/blog/what-is-artificial-intelligence/) is a way of making a computer, a computer-controlled robot, or a software think intelligently in a similar manner the intelligent humans believe.\n\nThe study of systems that attempt to model and apply the intelligence of the human mind.\n\n&amp;#x200B;\n\n[ARTIFICIAL INTELLIGENCE](https://i.redd.it/b0bkyj1ceym31.png)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d50adl/what_is_artificial_intelligence/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "what is artificial intelligence ? /!/  according to john mccarthy (father of artificial intelligence), it is “the science and engineering of making intelligent machines, especially intelligent computer programs”.\n\nit is a -----> branch !!!  of computer science named artificial intelligence pursues creating computers or machines as intelligent as human beings. it is a way of making a computer, a computer-controlled robot, or a software think intelligently, in a similar manner the intelligent humans believe.\n\nin another way we define, [artificial intelligence](https://www.learntek.org/blog/what-is-artificial-intelligence/) is a way of making a computer, a computer-controlled robot, or a software think intelligently in a similar manner the intelligent humans believe.\n\nthe study of systems that attempt to model and apply the intelligence of the human mind.\n\n&amp;#x200b;\n\n[artificial intelligence](https://i.redd.it/b0bkyj1ceym31.png)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d50adl/what_is_artificial_intelligence/',)", "identifyer": 5838776, "year": "2019"}, {"autor": "bencryer123", "date": 1568273270000, "content": "Introduction of Artificial Intelligence /!/  \n\nhttps://i.redd.it/extxbd4874m31.png\n\nIn today’s world, technology is growing very fast, and we are getting in touch with different new technologies day by day.\n\nHere, one of the booming technologies of computer science is  Artificial Intelligence which is ready to create a new revolution in the world by making intelligent machines. Artificial Intelligence is now all around us. It is currently working with a variety of subfields,  ranging from general to specific, such as self-driving cars, playing chess, proving theorems, playing music, painting, etc.\n\nAI is one of the fascinating and universal fields of Computer science which has a great scope in future. AI holds a tendency to cause a  machine to work as a human.\n\n## What is [Artificial Intelligence](https://www.simpliv.com/summit)?\n\nArtificial Intelligence is composed of two words **Artificial** and **Intelligence**, where Artificial defines *“man-made,”* and intelligence defines *“thinking power”*, hence AI means *“a man-made thinking power.”*\n\nSo, we can define AI as:\n\n&gt;“It is a branch of computer science by which we can  create intelligent machines which can behave like a human, think like  humans, and able to make decisions.”\n\nArtificial Intelligence exists when a machine can have human-based skills such as learning, reasoning, and solving problems\n\nWith Artificial Intelligence you do not need to preprogram a machine to do some work, despite that you can create a machine with programmed algorithms which can work with own intelligence, and that is the awesomeness of AI.\n\nIt is believed that AI is not a new technology, and some people says that as per Greek myth, there were Mechanical men in early days which can work and behave like humans.\n\n## Why Artificial Intelligence?\n\nBefore Learning about Artificial Intelligence, we should know that what is the importance of AI and why should we learn it. Following are  some main reasons to learn about AI:\n\n&amp;#x200B;\n\n* With the help of AI, you can create such software or devices which can solve real-world problems very easily and with accuracy such as health issues, marketing, traffic issues, etc.\n* With the help of AI, you can create your personal virtual Assistant, such as Cortana, Google Assistant, Siri, etc.\n* With the help of AI, you can build such Robots which can work in an environment where survival of humans can be at risk.\n* AI opens a path for other new technologies, new devices, and new opportunities.\n\n## Goals of Artificial Intelligence\n\nFollowing are the main goals of Artificial Intelligence:\n\n&amp;#x200B;\n\n1. Replicate human intelligence\n2. Solve Knowledge-intensive tasks\n3. An intelligent connection of perception and action\n4. Building a machine which can perform tasks that requires human intelligence such as:  \n\n* Proving a theorem\n* Playing chess\n* Plan some surgical operation\n* Driving a car in traffic\n\n1. Creating some system which can exhibit intelligent behavior, learn new things by itself, demonstrate, explain, and can advise to its user.\n\n## What Comprises to Artificial Intelligence?\n\nArtificial Intelligence is not just a part of computer science even it’s so vast and requires lots of other factors which can contribute to it. To create the AI-first we should know that how intelligence is composed, so the Intelligence is an intangible part of our brain which is a combination of **Reasoning, learning, problem-solving perception, language understanding, etc**.\n\nTo achieve the above factors for a machine or software [Artificial Intelligence](https://www.simpliv.com/summit) requires the following discipline:\n\n&amp;#x200B;\n\n* Mathematics\n* Biology\n* Psychology\n* Sociology\n* Computer Science\n* Neurons Study\n* Statistics\n\n&amp;#x200B;\n\n## Advantages of Artificial Intelligence\n\nFollowing are some main advantages of Artificial Intelligence:\n\n&amp;#x200B;\n\n* **High Accuracy with fewer errors:** AI machines or systems are prone to fewer errors and high accuracy as it takes decisions as per pre-experience or information.\n* **High-Speed:** AI systems can be of very high-speed and fast-decision making, because of that AI systems can beat a chess champion in the Chess game.\n* **High reliability:** AI machines are highly reliable and can perform the same action multiple times with high accuracy.\n* **Useful for risky areas:** AI machines can be helpful in situations such as defusing a bomb, exploring the ocean floor, where to employ a human can be risky.\n* **Digital Assistant:** AI can be very useful to provide digital assistant to the users such as AI technology is currently used by various E-commerce websites to show the products as per customer requirement.\n* **Useful as a public utility:** AI can be very useful for public utilities such as a self-driving car which can make our journey safer and hassle-free, facial recognition for security purpose,  Natural language processing to communicate with the human in human-language, etc.\n\n## Disadvantages of Artificial Intelligence\n\nEvery technology has some disadvantages, and the same goes for  Artificial intelligence. Being so advantageous technology still, it has some disadvantages which we need to keep in our mind while creating an  AI system. Following are the disadvantages of AI:\n\n&amp;#x200B;\n\n* **High Cost:** The hardware and software requirement of  AI is very costly as it requires lots of maintenance to meet current world requirements.\n* **Can’t think out of the box:** Even we are making smarter machines with AI, but still they cannot work out of the box, as the robot will only do that work for which they are trained, or programmed.\n* **No feelings and emotions:** AI machines can be an outstanding performer, but still it does not have the feeling so it cannot make any kind of emotional attachment with human, and may sometime be harmful for users if the proper care is not taken.\n* **Increase dependence on machines:** With the increment of technology, people are getting more dependent on devices and hence they are losing their mental capabilities.\n* **No Original Creativity:** As humans are so creative and can imagine some new ideas but still AI machines cannot beat this power of human intelligence and cannot be creative and imaginative.\n\n## [ARTIFICIAL INTELLIGENCE SUMMIT: ](https://www.simpliv.com/summit)\n\n&amp;#x200B;\n\nhttps://i.redd.it/7yx4zr1a74m31.jpg\n\nSimpliv, the learning platform, is organizing the AI Summit India on  18th November at Taj, Vivanta, Bangalore. This two-day summit will be an  ideal opportunity to explore critical areas of AI such as digital  transformation, AI and deep learning, AI and cybercrime, AI as a tool  for enforcing accountability, the various industries that could get  impacted by AI, enterprise and process automation using AI, AI and  customer experience, AI’s role in messaging in the advertising,  marketing and healthcare and other sectors, AI for the Cognitive  Enterprise, and much [more.](https://www.simpliv.com/summit)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d34eql/introduction_of_artificial_intelligence/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "branch", "selectorShort": "branch", "MarkedSent": "introduction of artificial intelligence /!/  \n\nhttps://i.redd.it/extxbd4874m31.png\n\nin today’s world, technology is growing very fast, and we are getting in touch with different new technologies day by day.\n\nhere, one of the booming technologies of computer science is  artificial intelligence which is ready to create a new revolution in the world by making intelligent machines. artificial intelligence is now all around us. it is currently working with a variety of subfields,  ranging from general to specific, such as self-driving cars, playing chess, proving theorems, playing music, painting, etc.\n\nai is one of the fascinating and universal fields of computer science which has a great scope in future. ai holds a tendency to cause a  machine to work as a human.\n\n## what is [artificial intelligence](https://www.simpliv.com/summit)?\n\nartificial intelligence is composed of two words **artificial** and **intelligence**, where artificial defines *“man-made,”* and intelligence defines *“thinking power”*, hence ai means *“a man-made thinking power.”*\n\nso, we can define ai as:\n\n&gt;“it is a -----> branch !!!  of computer science by which we can  create intelligent machines which can behave like a human, think like  humans, and able to make decisions.”\n\nartificial intelligence exists when a machine can have human-based skills such as learning, reasoning, and solving problems\n\nwith artificial intelligence you do not need to preprogram a machine to do some work, despite that you can create a machine with programmed algorithms which can work with own intelligence, and that is the awesomeness of ai.\n\nit is believed that ai is not a new technology, and some people says that as per greek myth, there were mechanical men in early days which can work and behave like humans.\n\n## why artificial intelligence?\n\nbefore learning about artificial intelligence, we should know that what is the importance of ai and why should we learn it. following are  some main reasons to learn about ai:\n\n&amp;#x200b;\n\n* with the help of ai, you can create such software or devices which can solve real-world problems very easily and with accuracy such as health issues, marketing, traffic issues, etc.\n* with the help of ai, you can create your personal virtual assistant, such as cortana, google assistant, siri, etc.\n* with the help of ai, you can build such robots which can work in an environment where survival of humans can be at risk.\n* ai opens a path for other new technologies, new devices, and new opportunities.\n\n## goals of artificial intelligence\n\nfollowing are the main goals of artificial intelligence:\n\n&amp;#x200b;\n\n1. replicate human intelligence\n2. solve knowledge-intensive tasks\n3. an intelligent connection of perception and action\n4. building a machine which can perform tasks that requires human intelligence such as:  \n\n* proving a theorem\n* playing chess\n* plan some surgical operation\n* driving a car in traffic\n\n1. creating some system which can exhibit intelligent behavior, learn new things by itself, demonstrate, explain, and can advise to its user.\n\n## what comprises to artificial intelligence?\n\nartificial intelligence is not just a part of computer science even it’s so vast and requires lots of other factors which can contribute to it. to create the ai-first we should know that how intelligence is composed, so the intelligence is an intangible part of our brain which is a combination of **reasoning, learning, problem-solving perception, language understanding, etc**.\n\nto achieve the above factors for a machine or software [artificial intelligence](https://www.simpliv.com/summit) requires the following discipline:\n\n&amp;#x200b;\n\n* mathematics\n* biology\n* psychology\n* sociology\n* computer science\n* neurons study\n* statistics\n\n&amp;#x200b;\n\n## advantages of artificial intelligence\n\nfollowing are some main advantages of artificial intelligence:\n\n&amp;#x200b;\n\n* **high accuracy with fewer errors:** ai machines or systems are prone to fewer errors and high accuracy as it takes decisions as per pre-experience or information.\n* **high-speed:** ai systems can be of very high-speed and fast-decision making, because of that ai systems can beat a chess champion in the chess game.\n* **high reliability:** ai machines are highly reliable and can perform the same action multiple times with high accuracy.\n* **useful for risky areas:** ai machines can be helpful in situations such as defusing a bomb, exploring the ocean floor, where to employ a human can be risky.\n* **digital assistant:** ai can be very useful to provide digital assistant to the users such as ai technology is currently used by various e-commerce websites to show the products as per customer requirement.\n* **useful as a public utility:** ai can be very useful for public utilities such as a self-driving car which can make our journey safer and hassle-free, facial recognition for security purpose,  natural language processing to communicate with the human in human-language, etc.\n\n## disadvantages of artificial intelligence\n\nevery technology has some disadvantages, and the same goes for  artificial intelligence. being so advantageous technology still, it has some disadvantages which we need to keep in our mind while creating an  ai system. following are the disadvantages of ai:\n\n&amp;#x200b;\n\n* **high cost:** the hardware and software requirement of  ai is very costly as it requires lots of maintenance to meet current world requirements.\n* **can’t think out of the box:** even we are making smarter machines with ai, but still they cannot work out of the box, as the robot will only do that work for which they are trained, or programmed.\n* **no feelings and emotions:** ai machines can be an outstanding performer, but still it does not have the feeling so it cannot make any kind of emotional attachment with human, and may sometime be harmful for users if the proper care is not taken.\n* **increase dependence on machines:** with the increment of technology, people are getting more dependent on devices and hence they are losing their mental capabilities.\n* **no original creativity:** as humans are so creative and can imagine some new ideas but still ai machines cannot beat this power of human intelligence and cannot be creative and imaginative.\n\n## [artificial intelligence summit: ](https://www.simpliv.com/summit)\n\n&amp;#x200b;\n\nhttps://i.redd.it/7yx4zr1a74m31.jpg\n\nsimpliv, the learning platform, is organizing the ai summit india on  18th november at taj, vivanta, bangalore. this two-day summit will be an  ideal opportunity to explore critical areas of ai such as digital  transformation, ai and deep learning, ai and cybercrime, ai as a tool  for enforcing accountability, the various industries that could get  impacted by ai, enterprise and process automation using ai, ai and  customer experience, ai’s role in messaging in the advertising,  marketing and healthcare and other sectors, ai for the cognitive  enterprise, and much [more.](https://www.simpliv.com/summit)", "sortedWord": "None", "removed": "('nan',)", "score": 3, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d34eql/introduction_of_artificial_intelligence/',)", "identifyer": 5838809, "year": "2019"}], "name": "branchArtificialInteligence2019"}