{"interestingcomments": [{"autor": "IAmParad0x", "date": 1588724976000, "content": "The origin of Intelligence. And how to create an Intelligence that's beyond human's imagination? /!/ **First of all before reading this post. Please watch this** [video by open AI](https://www.youtube.com/watch?v=kopoLzvh5jY)(**The hide &amp; seek video).**\n\nIf you had already watched that video then you can continue.\n\n**So what is an intelligence?**\n\nhttps://preview.redd.it/l34g0rmah1x41.jpg?width=281&amp;format=pjpg&amp;auto=webp&amp;s=71b5fb0ee912639ecc4b65d1adabc327629deb9d\n\n&amp;#x200B;\n\nwell currently no one knows how to define intelligence. But here's a definition that i came across in a research paper [\"On Measure of Intelligence\"](https://arxiv.org/pdf/1911.01547.pdf).  It says \" *The intelligence of a system is a measure of its skill-acquisition efficiency over a scope of tasks, with respect to priors, experience, and generalization difficulty*. \". But what I think is this definition is only partially true. For me Intelligence is a result of an algorithm whose goal is to survive. Currently what we think is Intelligence is only true is the current environment. Let me explain you how and why.\n\n&amp;#x200B;\n\n\\*\\*This post will be long so please read till end and then come to a conclusion :)\n\nFirst a bit of biology\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWe humans have eyes but why?. The answer is obvious because we want to see what's in front of us but why we want to see what is in front of us because if were not able to see what's in front of we will not be to survive in this environment. But why our eyes are so advanced because this the minimum requirement that's the result of our nature. Now consider a hypothetical world in which there are only one species of plants, animals, rocks etc everything just has one specie no variety then do you think we would have eyes with rods and cones? . I don't think so because the minimum requirement of that environment is a can be satisfied with color blind eyes no need to develop further. So why do we have eyes which can see color?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/u21640jdh1x41.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=3bdf38e6aa11dbfeb0de127b8ad0a60a88067eab\n\n&amp;#x200B;\n\nhere's the reason because to survive in this environment we need colors that will distinguish between the frogs that venomous v/s that are not. Hence, The eyes that we have are result to survive in this environment and same goes for intelligence. Every feature we have or any other species have are the result of what I call is an algorithm whose goal is survival.\n\n&amp;#x200B;\n\n**Here's another way to look at it.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jlyu3jbgh1x41.jpg?width=360&amp;format=pjpg&amp;auto=webp&amp;s=fad75ea08518b17b67fa7f03fb1cf821f3b7d55f\n\n&amp;#x200B;\n\nDo you guys think that when we were Bush-habilis or in our phase that was before modern humans we were thinking about what is the shape of earth? or what is the distance between sun and earth?. The answer is No but why we weren't thinking about that kind of stuff during that time. Some of you will say that we were not that intelligent well this answer is partially true. The correct answer is our survival chances were very low. But now we can i think about black-hole and I am writing this  post because my survival chances are very high. Why my survival chances are high because humans are intelligent. That's why when are survival chances became very high then we had lot's of time then we began to utilize our energy in other things because we were intelligent we began to think about everything in our environment.\n\n&amp;#x200B;\n\nNow to actual AI part. YAY\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&amp;#x200B;\n\nNow I would like you to recall the video of open AI.\n\nhow they were doing everything in there will to survive.\n\nUsing same thinking\n\nHow to create something that have communication skills like humans\n\nNow consider that somehow We create a simulation where there are  two living being of same species in that the main of these to living beings are survival but then can survive through communicating with each other like one has a knowledge of one part of environment and other has the knowledge of other part of that environment. They both have to share there experiences with each other in order to survive. Therefore, slowly slowly they will began to able to start communicating and if the environment if complicated enough then they can even develop the communication skills like humans.\n\n&amp;#x200B;\n\nNow how to create something that is more intelligent that humans.\n\nFirst of all this will require tremendous amount of computing power but suppose somewhere is future if we have such level of computing power that we can simulate earth then we can create a simulation of earth that will have everything same that our earth was having  around **4.54 billion years ago.**\n\nNow, we can create an algorithm with the goal to survive in an cell just like when the earth got created  as every condition will be the same there will be a high possibility that some creature with human like intelligence will occur. But here's a twist recall the video of OPEN AI when they environment was changed means when they added the ramp in the environment the creatures who have survive we not able to do so therefore would have to find a new to survive. Hence, first they started taking the ramp inside before creating the barrier. Same goes here, What if before humans started to develop communication skills in the simulation that got created we can introduce something like if the humans\n\nspeak then they would get killed by certain species present in that simulation. Then what humans will do to survive in that environment will the be able to communicate through telepathy well who knows there's a huge possibility of that.\n\n&amp;#x200B;\n\nI am trying to work on this kind of algorithm and environment currently I am doing it alone If you are interested in this then I would be glad you can help me .\n\n&amp;#x200B;\n\nThanks for reading\n\n&amp;#x200B;\n\nedit: If you guys have any questions then please ask me :) ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ge9pyd/the_origin_of_intelligence_and_how_to_create_an/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "bush", "selectorShort": "bush", "MarkedSent": "the origin of intelligence. and how to create an intelligence that's beyond human's imagination? /!/ **first of all before reading this post. please watch this** [video by open ai](https://www.youtube.com/watch?v=kopolzvh5jy)(**the hide &amp; seek video).**\n\nif you had already watched that video then you can continue.\n\n**so what is an intelligence?**\n\nhttps://preview.redd.it/l34g0rmah1x41.jpg?width=281&amp;format=pjpg&amp;auto=webp&amp;s=71b5fb0ee912639ecc4b65d1adabc327629deb9d\n\n&amp;#x200b;\n\nwell currently no one knows how to define intelligence. but here's a definition that i came across in a research paper [\"on measure of intelligence\"](https://arxiv.org/pdf/1911.01547.pdf).  it says \" *the intelligence of a system is a measure of its skill-acquisition efficiency over a scope of tasks, with respect to priors, experience, and generalization difficulty*. \". but what i think is this definition is only partially true. for me intelligence is a result of an algorithm whose goal is to survive. currently what we think is intelligence is only true is the current environment. let me explain you how and why.\n\n&amp;#x200b;\n\n\\*\\*this post will be long so please read till end and then come to a conclusion :)\n\nfirst a bit of biology\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nwe humans have eyes but why?. the answer is obvious because we want to see what's in front of us but why we want to see what is in front of us because if were not able to see what's in front of we will not be to survive in this environment. but why our eyes are so advanced because this the minimum requirement that's the result of our nature. now consider a hypothetical world in which there are only one species of plants, animals, rocks etc everything just has one specie no variety then do you think we would have eyes with rods and cones? . i don't think so because the minimum requirement of that environment is a can be satisfied with color blind eyes no need to develop further. so why do we have eyes which can see color?\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nhttps://preview.redd.it/u21640jdh1x41.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=3bdf38e6aa11dbfeb0de127b8ad0a60a88067eab\n\n&amp;#x200b;\n\nhere's the reason because to survive in this environment we need colors that will distinguish between the frogs that venomous v/s that are not. hence, the eyes that we have are result to survive in this environment and same goes for intelligence. every feature we have or any other species have are the result of what i call is an algorithm whose goal is survival.\n\n&amp;#x200b;\n\n**here's another way to look at it.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&amp;#x200b;\n\nhttps://preview.redd.it/jlyu3jbgh1x41.jpg?width=360&amp;format=pjpg&amp;auto=webp&amp;s=fad75ea08518b17b67fa7f03fb1cf821f3b7d55f\n\n&amp;#x200b;\n\ndo you guys think that when we were -----> bush !!! -habilis or in our phase that was before modern humans we were thinking about what is the shape of earth? or what is the distance between sun and earth?. the answer is no but why we weren't thinking about that kind of stuff during that time. some of you will say that we were not that intelligent well this answer is partially true. the correct answer is our survival chances were very low. but now we can i think about black-hole and i am writing this  post because my survival chances are very high. why my survival chances are high because humans are intelligent. that's why when are survival chances became very high then we had lot's of time then we began to utilize our energy in other things because we were intelligent we began to think about everything in our environment.\n\n&amp;#x200b;\n\nnow to actual ai part. yay\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n&amp;#x200b;\n\nnow i would like you to recall the video of open ai.\n\nhow they were doing everything in there will to survive.\n\nusing same thinking\n\nhow to create something that have communication skills like humans\n\nnow consider that somehow we create a simulation where there are  two living being of same species in that the main of these to living beings are survival but then can survive through communicating with each other like one has a knowledge of one part of environment and other has the knowledge of other part of that environment. they both have to share there experiences with each other in order to survive. therefore, slowly slowly they will began to able to start communicating and if the environment if complicated enough then they can even develop the communication skills like humans.\n\n&amp;#x200b;\n\nnow how to create something that is more intelligent that humans.\n\nfirst of all this will require tremendous amount of computing power but suppose somewhere is future if we have such level of computing power that we can simulate earth then we can create a simulation of earth that will have everything same that our earth was having  around **4.54 billion years ago.**\n\nnow, we can create an algorithm with the goal to survive in an cell just like when the earth got created  as every condition will be the same there will be a high possibility that some creature with human like intelligence will occur. but here's a twist recall the video of open ai when they environment was changed means when they added the ramp in the environment the creatures who have survive we not able to do so therefore would have to find a new to survive. hence, first they started taking the ramp inside before creating the barrier. same goes here, what if before humans started to develop communication skills in the simulation that got created we can introduce something like if the humans\n\nspeak then they would get killed by certain species present in that simulation. then what humans will do to survive in that environment will the be able to communicate through telepathy well who knows there's a huge possibility of that.\n\n&amp;#x200b;\n\ni am trying to work on this kind of algorithm and environment currently i am doing it alone if you are interested in this then i would be glad you can help me .\n\n&amp;#x200b;\n\nthanks for reading\n\n&amp;#x200b;\n\nedit: if you guys have any questions then please ask me :) ", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 3, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ge9pyd/the_origin_of_intelligence_and_how_to_create_an/',)", "identifyer": 5606345, "year": "2020"}], "name": "bushArtificialInteligence2020"}