{"interestingcomments": [{"autor": "industrywired", "date": 1578634317000, "content": "How Agricultural Drone Technology is Making Farming Smarter", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/emmiue/how_agricultural_drone_technology_is_making/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how agricultural drone technology is making -----> farming !!!  smarter", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://industrywired.com/how-agricultural-drone-technology-is-making-farming-smarter/',)", "identifyer": 5600349, "year": "2020"}, {"autor": "Robin5409", "date": 1592835067000, "content": "How Artificial Intelligence is making revolutions in Hyderabad? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/jm0qlzgsyg651.jpg?width=5184&amp;format=pjpg&amp;auto=webp&amp;s=bd82db9fff4b691c7957a0be2ad31c35c650263a\n\nThe advancement of **AI** has spurred some heated discussions in the recent years globally. A concept which seemed like a work of fiction some decades ago have become reality now. **AI** products have become a part of many households and working places. This has raised questions on the negative impacts that it might have on the job areas or more precisely will the artificial intelligence replace **human intelligence**? While these discussions are not baseless the use of **AI** should not be limited to some cool gadgets and stuff. It is time to rethink how this technology can be used in such a way that it can coexist with **human intelligence** and solve problems.\n\n# Ways in which Artificial Intelligence can change the world\n\nThe human brain is the most elegant machine to ever exist and **human intelligence** is simply superior as compared to any other form of intelligence. So, what if instead of getting into this fight of **artificial intelligence v/s human intelligence**, we discuss ways in which **human intelligence** can make use of **AI** for the improvement of our society. In short, how we can complement all of our ideas with not just more data but with the capability of processing these data with better speed. Even with the amount of advancement as of today, we can utilise **AI** in many ways resulting in ways which can change the entire perspective on this debate of **artificial intelligence v/s human intelligence**. \n\n**1. Medical purposes:**\n\n**AI** is making its way in adoption and implementation of precision medicine. This is an approach which takes into account individual genes and its variability from others, environment and lifestyle and use them for the treatment and prevention of diseases. For example, for a particular disease of various types, the traditional approach of giving the usual treatment and see how it works can be replaced by **AI in healthcare** because then precision medicine will help determining accurately which treatment would be the most appropriate one or the prevention strategies for that particular disease. **Artificial intelligence in healthcare** can also be used for scanning purposes in radiology that efficiently detects tumors. \n\n**AI in healthcare** can also be used for a very very important purpose which is the most talked about problem as of today and that is this pandemic **Covid-19**. The **Covid effects** can be monitored and reduced by **AI** in multiple ways. From detecting the disease at an early stage by identifying the unnatural symptoms of **Covid-19** infected people which would help preventing the disease, to researching for drugs to cure the **Covid effects**, to replace the officials because of the heavy amount of workload that has been inflicted on them because of **Covid-19**, the **artificial intelligence in healthcare** can help us a lot in controlling this global crisis. \n\n**2. Cybersecurity:**\n\nIt is no secret that the security teams struggle to keep up with the increasing number of alerts generated by traditional tools. Artificial intelligence has the capabilities like automation and self learning which can increase effectiveness and reduce costs as well. This little change can keep us safe from big threats like terrorism and even smaller threats like identity theft. **AI** based solutions in the market can be proactive and can predict or at least alert the systems of a danger or security threat by identifying patterns that might be associated with malicious content. Many companies uses artificial intelligence as a means for fraud detection or for various endpoint security of laptops and smartphones. Artificial intelligence technology will expand the scope and scale of security professionals and allow them to identify and figure out threats before the situation gets out of hand.\n\n**3. Farming:**\n\nIf we go by the current rate, it is statistically calculated that the population is likely to increase significantly in the next three decades. But what about the food capacity? Will we be able to keep pace with this growth following the traditional methods? It raises curiosity. The good news is artificial intelligence currently are in the way of making our current farming methods more efficient by increasing the production rate and reducing the wastage without affecting the environment at the same time. There are systems invented like AutoTrac which enables huge machines to plant crops and thus reducing the overlapping in farming such as tilling, fertilising, etc. which in turn reduces the usage of chemicals and this in turn increases productivity. There is also another idea which can be utilised in farming and that is using face learning if a facial recognition system is built which can identify different animals individually by their facial features then this will really be of assistance as herds of animals can be monitored with the minimum amount of people involved. This system will also be able to detect the early signs of aging or other deformity that will not be in the favour of farming and will be informing the farmer about the same. As drones can capture real-time images of the condition of the farms, **AI** machines will be able to help farmers (again helping **human intelligence**) foresee how their crops are going to be like in a year in advance. This will help the farmers to be prepared for any adverse situations and prevention of them if possible. \n\nSo, as can be seen, artificial intelligence should be used or at least thought of as a new approach to every problem. Artificial intelligence can be applied in almost every market and problem. **Human intelligence** can coexist with artificial intelligence and there are ways discussed above so these steps should be taken and thoughts of improving the conditions of the world should be given more importance.\n\nAs the various ways in which **AI** can be used has increased, surely the demand for this technology has also increased. Especially the recent advancements in **AI** has attracted attention from both the private sectors and governments all across the globe. The mass production of machines with humanlike behaviour inching closer to reality from fiction is only adding in to this interest. Today, artificial intelligence has touched people's lives in ways that are not fully expected or understood. This has been the reason behind the invention of many gadgets which have been the cause of great economic growth for many private sectors. Artificial intelligence, however, has much greater potential and it's applications make it imperative for the government to take a notice of that. \n\nCurrently, start-ups based on artificial intelligence, machine learning and deep learning are on the rise in India. According to reports there are so many start-ups  actively working in India to build a robust **AI** ecosystem. Initiatives taken by the government to promote **AI** include the establishment of NITI Aayog, the policy think tank of India and of course digital India, an excellent initiative taken for encouraging the improvement of the technological infrastructure of the country. Companies like Adobe, IBM, Microsoft, Accenture, Amazon and so on are carrying out good research work based on artificial intelligence. The main **AI** work hubs in India are Bangalore, New Delhi, Mumbai, Chennai and Hyderabad. We are going to discuss how Hyderabad has been home to revolutions in **AI**. \n\n# Artificial Intelligence making revolutions in Hyderabad \n\nThe big companies have been in search to find the appropriate minds for these jobs as talented people are needed for these projects. This is the reason most college graduates in India are making their way towards the **AI** field as the career opportunities have only been increasing and so it is very obvious that Hyderabad, as said earlier, also has made it sure that this technology is an integral part of this city. These jobs are highly paid job way more than the other existing technologies be it in machine learning or deep learning sectors. The students who have an interest in this field and want to pursue a career in artificial technology have in the past and more than likely in the future will continue to migrate to Hyderabad for job hunting. The students who also have a knack of learning new technologies in general also happen to have interest in artificial intelligence because **AI** technology is undoubtedly the most advanced and innovative form of technology till date. They choose Hyderabad because this city is the tech hub and also has some of the best institutions for artificial intelligence. The percentage of students enrolling for the artificial intelligence courses in these institutions have increased over the recent years. Statistics say that a growth rate of 36.10% in these percentages will be seen in the next decade which is a lot. According to a report given by Ministry of Commerce and industry in the year 2018, this city offers around 9% of job opportunities in this sector of artificial intelligence. Soon after the bifurcation of Andhra Pradesh was done, the economy of Telengana has become self reliant. There has also been an encouragement from the government with respect to start ups. The IT minister of Telengana has established a T-Hub in Hyderabad. This will not only help in making progress in the industry but also will be the cause of increase in revenue. It is assumed that as of present, there are thousands of job vacancies available in Hyderabad. Due to the establishment of this start up ecosystem, there has been an increase in the market demand of artificial intelligence. There are even plans for opening of workshops and training centres in **AI** institutes of Hyderabad. The day when **AI** will be made available for every individual and will cooperate with human intelligence is not very far fetched. \n\n# Conclusion\n\nThe Indian government also tends to build research institutions and centres of excellence in making you **learn AI** and improving your skills in fields like artificial intelligence, robotics, data analysis and many more. The application of artificial intelligence are staggering and will radically change our lives and how we work. The emerging fields that one should **learn AI** in are as follows:\n\n1. Machine learning.\n\n2. Deep Learning.\n\n3. Natural language processing.\n\n4. Neural works.\n\n5. Robotics.\n\n6. Cognitive recognition.\n\n7. Virtual agents.\n\n8. Speech/Voice recognition.\n\n9. Virtual and Assisted reality.\n\nFor the ones who want to pursue a career in artificial intelligence, the future is extremely positive and promising. The artificial intelligence industry have grown rapidly in the last few years. But there is a notable shortage of qualified and experienced engineers in **AI** industry. It is noted that many job posts have remained vacant as the companies have failed to get their requirements fulfilled in search of the right candidates. The companies are looking into the above mentioned skills in the candidates. Therefore, it is very much evident that there is a vast opportunity to succeed in this field but for that only one needs to get started to **learn AI** right away. In order to **learn AI**, there are several institutions in Hyderabad or outside which can work as **learning sources** but which is the best institution for pursuing an **artificial intelligence online course**? The answer is quite simple. It is an institution where you can take up an [**AI online course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) that does not only makes you efficient but also helps you get into these big companies. There is an institution in Hyderabad which is an acknowledged institution for doing an **AI certificate course**. The institution is **Great Learning**.\n\n**Great Learning** is an institution which offers you programs in all of the above mentioned fields. **Great Learning online courses** not only gives you an opportunity to work in big companies which hire professionals from this institution but also **Great Learning online courses** give you an in-depth knowledge of the various aspects of the industry by creating industry related programs and learning experience which help the candidates grow.[**Great Learning online courses**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) helps the students keep motivated and encourage them to **learn AI** in an easy and simple way. \n\nSo, if you want to pursue a career in **AI** then you should get started right away with learning [**AI certificate course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) and **Great Learning** is a great place to start this as it is undoubtedly one of the best in this field.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hdt1go/how_artificial_intelligence_is_making_revolutions/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how artificial intelligence is making revolutions in hyderabad? /!/ &amp;#x200b;\n\nhttps://preview.redd.it/jm0qlzgsyg651.jpg?width=5184&amp;format=pjpg&amp;auto=webp&amp;s=bd82db9fff4b691c7957a0be2ad31c35c650263a\n\nthe advancement of **ai** has spurred some heated discussions in the recent years globally. a concept which seemed like a work of fiction some decades ago have become reality now. **ai** products have become a part of many households and working places. this has raised questions on the negative impacts that it might have on the job areas or more precisely will the artificial intelligence replace **human intelligence**? while these discussions are not baseless the use of **ai** should not be limited to some cool gadgets and stuff. it is time to rethink how this technology can be used in such a way that it can coexist with **human intelligence** and solve problems.\n\n# ways in which artificial intelligence can change the world\n\nthe human brain is the most elegant machine to ever exist and **human intelligence** is simply superior as compared to any other form of intelligence. so, what if instead of getting into this fight of **artificial intelligence v/s human intelligence**, we discuss ways in which **human intelligence** can make use of **ai** for the improvement of our society. in short, how we can complement all of our ideas with not just more data but with the capability of processing these data with better speed. even with the amount of advancement as of today, we can utilise **ai** in many ways resulting in ways which can change the entire perspective on this debate of **artificial intelligence v/s human intelligence**. \n\n**1. medical purposes:**\n\n**ai** is making its way in adoption and implementation of precision medicine. this is an approach which takes into account individual genes and its variability from others, environment and lifestyle and use them for the treatment and prevention of diseases. for example, for a particular disease of various types, the traditional approach of giving the usual treatment and see how it works can be replaced by **ai in healthcare** because then precision medicine will help determining accurately which treatment would be the most appropriate one or the prevention strategies for that particular disease. **artificial intelligence in healthcare** can also be used for scanning purposes in radiology that efficiently detects tumors. \n\n**ai in healthcare** can also be used for a very very important purpose which is the most talked about problem as of today and that is this pandemic **covid-19**. the **covid effects** can be monitored and reduced by **ai** in multiple ways. from detecting the disease at an early stage by identifying the unnatural symptoms of **covid-19** infected people which would help preventing the disease, to researching for drugs to cure the **covid effects**, to replace the officials because of the heavy amount of workload that has been inflicted on them because of **covid-19**, the **artificial intelligence in healthcare** can help us a lot in controlling this global crisis. \n\n**2. cybersecurity:**\n\nit is no secret that the security teams struggle to keep up with the increasing number of alerts generated by traditional tools. artificial intelligence has the capabilities like automation and self learning which can increase effectiveness and reduce costs as well. this little change can keep us safe from big threats like terrorism and even smaller threats like identity theft. **ai** based solutions in the market can be proactive and can predict or at least alert the systems of a danger or security threat by identifying patterns that might be associated with malicious content. many companies uses artificial intelligence as a means for fraud detection or for various endpoint security of laptops and smartphones. artificial intelligence technology will expand the scope and scale of security professionals and allow them to identify and figure out threats before the situation gets out of hand.\n\n**3. -----> farming !!! :**\n\nif we go by the current rate, it is statistically calculated that the population is likely to increase significantly in the next three decades. but what about the food capacity? will we be able to keep pace with this growth following the traditional methods? it raises curiosity. the good news is artificial intelligence currently are in the way of making our current farming methods more efficient by increasing the production rate and reducing the wastage without affecting the environment at the same time. there are systems invented like autotrac which enables huge machines to plant crops and thus reducing the overlapping in farming such as tilling, fertilising, etc. which in turn reduces the usage of chemicals and this in turn increases productivity. there is also another idea which can be utilised in farming and that is using face learning if a facial recognition system is built which can identify different animals individually by their facial features then this will really be of assistance as herds of animals can be monitored with the minimum amount of people involved. this system will also be able to detect the early signs of aging or other deformity that will not be in the favour of farming and will be informing the farmer about the same. as drones can capture real-time images of the condition of the farms, **ai** machines will be able to help farmers (again helping **human intelligence**) foresee how their crops are going to be like in a year in advance. this will help the farmers to be prepared for any adverse situations and prevention of them if possible. \n\nso, as can be seen, artificial intelligence should be used or at least thought of as a new approach to every problem. artificial intelligence can be applied in almost every market and problem. **human intelligence** can coexist with artificial intelligence and there are ways discussed above so these steps should be taken and thoughts of improving the conditions of the world should be given more importance.\n\nas the various ways in which **ai** can be used has increased, surely the demand for this technology has also increased. especially the recent advancements in **ai** has attracted attention from both the private sectors and governments all across the globe. the mass production of machines with humanlike behaviour inching closer to reality from fiction is only adding in to this interest. today, artificial intelligence has touched people's lives in ways that are not fully expected or understood. this has been the reason behind the invention of many gadgets which have been the cause of great economic growth for many private sectors. artificial intelligence, however, has much greater potential and it's applications make it imperative for the government to take a notice of that. \n\ncurrently, start-ups based on artificial intelligence, machine learning and deep learning are on the rise in india. according to reports there are so many start-ups  actively working in india to build a robust **ai** ecosystem. initiatives taken by the government to promote **ai** include the establishment of niti aayog, the policy think tank of india and of course digital india, an excellent initiative taken for encouraging the improvement of the technological infrastructure of the country. companies like adobe, ibm, microsoft, accenture, amazon and so on are carrying out good research work based on artificial intelligence. the main **ai** work hubs in india are bangalore, new delhi, mumbai, chennai and hyderabad. we are going to discuss how hyderabad has been home to revolutions in **ai**. \n\n# artificial intelligence making revolutions in hyderabad \n\nthe big companies have been in search to find the appropriate minds for these jobs as talented people are needed for these projects. this is the reason most college graduates in india are making their way towards the **ai** field as the career opportunities have only been increasing and so it is very obvious that hyderabad, as said earlier, also has made it sure that this technology is an integral part of this city. these jobs are highly paid job way more than the other existing technologies be it in machine learning or deep learning sectors. the students who have an interest in this field and want to pursue a career in artificial technology have in the past and more than likely in the future will continue to migrate to hyderabad for job hunting. the students who also have a knack of learning new technologies in general also happen to have interest in artificial intelligence because **ai** technology is undoubtedly the most advanced and innovative form of technology till date. they choose hyderabad because this city is the tech hub and also has some of the best institutions for artificial intelligence. the percentage of students enrolling for the artificial intelligence courses in these institutions have increased over the recent years. statistics say that a growth rate of 36.10% in these percentages will be seen in the next decade which is a lot. according to a report given by ministry of commerce and industry in the year 2018, this city offers around 9% of job opportunities in this sector of artificial intelligence. soon after the bifurcation of andhra pradesh was done, the economy of telengana has become self reliant. there has also been an encouragement from the government with respect to start ups. the it minister of telengana has established a t-hub in hyderabad. this will not only help in making progress in the industry but also will be the cause of increase in revenue. it is assumed that as of present, there are thousands of job vacancies available in hyderabad. due to the establishment of this start up ecosystem, there has been an increase in the market demand of artificial intelligence. there are even plans for opening of workshops and training centres in **ai** institutes of hyderabad. the day when **ai** will be made available for every individual and will cooperate with human intelligence is not very far fetched. \n\n# conclusion\n\nthe indian government also tends to build research institutions and centres of excellence in making you **learn ai** and improving your skills in fields like artificial intelligence, robotics, data analysis and many more. the application of artificial intelligence are staggering and will radically change our lives and how we work. the emerging fields that one should **learn ai** in are as follows:\n\n1. machine learning.\n\n2. deep learning.\n\n3. natural language processing.\n\n4. neural works.\n\n5. robotics.\n\n6. cognitive recognition.\n\n7. virtual agents.\n\n8. speech/voice recognition.\n\n9. virtual and assisted reality.\n\nfor the ones who want to pursue a career in artificial intelligence, the future is extremely positive and promising. the artificial intelligence industry have grown rapidly in the last few years. but there is a notable shortage of qualified and experienced engineers in **ai** industry. it is noted that many job posts have remained vacant as the companies have failed to get their requirements fulfilled in search of the right candidates. the companies are looking into the above mentioned skills in the candidates. therefore, it is very much evident that there is a vast opportunity to succeed in this field but for that only one needs to get started to **learn ai** right away. in order to **learn ai**, there are several institutions in hyderabad or outside which can work as **learning sources** but which is the best institution for pursuing an **artificial intelligence online course**? the answer is quite simple. it is an institution where you can take up an [**ai online course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) that does not only makes you efficient but also helps you get into these big companies. there is an institution in hyderabad which is an acknowledged institution for doing an **ai certificate course**. the institution is **great learning**.\n\n**great learning** is an institution which offers you programs in all of the above mentioned fields. **great learning online courses** not only gives you an opportunity to work in big companies which hire professionals from this institution but also **great learning online courses** give you an in-depth knowledge of the various aspects of the industry by creating industry related programs and learning experience which help the candidates grow.[**great learning online courses**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) helps the students keep motivated and encourage them to **learn ai** in an easy and simple way. \n\nso, if you want to pursue a career in **ai** then you should get started right away with learning [**ai certificate course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) and **great learning** is a great place to start this as it is undoubtedly one of the best in this field.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hdt1go/how_artificial_intelligence_is_making_revolutions/',)", "identifyer": 5600681, "year": "2020"}, {"autor": "BhaswatiGuha19", "date": 1608566015000, "content": "AI Defeats Experienced Farmers in Chinese Strawberry Farming Competition", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/khk02w/ai_defeats_experienced_farmers_in_chinese/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "ai defeats experienced farmers in chinese strawberry -----> farming !!!  competition", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.ibtimes.sg/ai-defeats-experienced-farmers-chinese-strawberry-farming-competition-54358',)", "identifyer": 5601248, "year": "2020"}, {"autor": "industrywired", "date": 1581498550000, "content": "Powering Farming of Tomorrow with Agricultural AI", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/f2oiwu/powering_farming_of_tomorrow_with_agricultural_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "powering -----> farming !!!  of tomorrow with agricultural ai", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://industrywired.com/powering-farming-of-tomorrow-with-agricultural-ai/',)", "identifyer": 5602021, "year": "2020"}, {"autor": "industrywired", "date": 1581498417000, "content": "Powering Farming of Tomorrow with Agricultural AI", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/f2oi6r/powering_farming_of_tomorrow_with_agricultural_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "powering -----> farming !!!  of tomorrow with agricultural ai", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://industrywired.com/powering-farming-of-tomorrow-with-agricultural-ai/',)", "identifyer": 5602022, "year": "2020"}, {"autor": "industrywired", "date": 1581497992000, "content": "Powering Farming of Tomorrow with Agricultural AI", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/f2ofpk/powering_farming_of_tomorrow_with_agricultural_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "powering -----> farming !!!  of tomorrow with agricultural ai", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://industrywired.com/powering-farming-of-tomorrow-with-agricultural-ai/',)", "identifyer": 5602023, "year": "2020"}, {"autor": "LordLagahoo", "date": 1592174736000, "content": "Artificial Intelligence / Machine Learning Online courses /!/ Hello,\n\nI am working on a project whereby I will be using machine learning tools to optimize an automated farming system.\n\nIt will use image processing (of food produce) and human inputs (like taste etc.) and then optimize the inputs (humidity, lumination etc.) to the automated system.\n\nCan you recommend any courses that you think will be helpful with regards to helping me develop the algorithm?\n\nWhat can you recommend in terms of a programming language? Any open source  resources that are already working on similar projects?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/h93j7o/artificial_intelligence_machine_learning_online/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "artificial intelligence / machine learning online courses /!/ hello,\n\ni am working on a project whereby i will be using machine learning tools to optimize an automated -----> farming !!!  system.\n\nit will use image processing (of food produce) and human inputs (like taste etc.) and then optimize the inputs (humidity, lumination etc.) to the automated system.\n\ncan you recommend any courses that you think will be helpful with regards to helping me develop the algorithm?\n\nwhat can you recommend in terms of a programming language? any open source  resources that are already working on similar projects?", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/h93j7o/artificial_intelligence_machine_learning_online/',)", "identifyer": 5602504, "year": "2020"}, {"autor": "Kseniase", "date": 1600080573000, "content": "[N] TheSequence Scope: When it comes to machine learning, size matters: Microsoft's DeepSpeed framework, which can train a model with up to a trillion parameters /!/ Hi there! Just wanted to share [the latest edition](https://thesequence.substack.com/p/-size-matters) of our free weekly digest. Please, see it below. The content of TheSequence is written by Jesus Rodriguez, one of the most-read contributors to KDNuggets and TDS. You can check his Medium [here](https://medium.com/@jrodthoughts). I'm a professional journalist with a passion for artificial intelligence. I think it's highly important to spread correct and practical information about ML and AI so I hope this promotion will not be too annoying. Your feedback is very appreciated, and please feel free to [sign up](https://thesequence.substack.com/) if you like it.\n\n📝 Editorial \n\nThe recent emergence of pre-trained language models and transformer architectures pushed the creation of larger and larger machine learning models. Google’s BERT presented attention mechanism and transformer architecture possibilities as the “next big thing” in ML, and the numbers seem surreal. OpenAI’s GPT-2 set a record by processing 1.5 billion parameters, followed by Microsoft’s Turing-NLG, which processed 17 billion parameters just to see the new GPT-3 processing an astonishing 175 billion parameters. To not feel complacent, just this week Microsoft announced a new release of its DeepSpeed framework (which powers Turing-NLG), which can train a model with **up to a trillion parameters**. That sounds insane but it really isn’t.  \n\nWhat we are seeing is a consequence of several factors. First, computation power and parallelization techniques have evolved to a point where it is relatively easy to train machine learning models in large clusters of machines. Second and most importantly, in the current state of machine learning, larger models have regularly outperformed smaller and more specialized models. Knowledge reusability methods like transfer learning are still in very nascent stages. As a result, it’s really hard to build small models that can operate in uncertain environments. Furthermore, as models like GPT-3 and Turing-NLG have shown, there is some unexplainable magic that happens after models go past a certain size.\n\nMany of the immediate machine learning problems might be solved by scaling the current generation of neural network architectures. Plain and simple, when it comes to machine learning, size matters.  \n\nWe would love to hear your opinions about the debate between broader-larger vs. smaller and more specialized models.  \n\n[Leave a comment](https://thesequence.substack.com/p/-size-matters/comments)\n\n*Now, to the most important developments in the AI industry this week*\n\n🔎 ML Research\n\n**GPT-3 Falls Short in Machine Comprehension**\n\nProposed by researchers from a few major American universities, a 57-task test to measure models’ ability to reason poses challenges even for sophisticated models like GPT-3[ -&gt;read more in the original paper](https://arxiv.org/pdf/2009.03300.pdf)\n\n**Better Text Summarization**\n\nOpenAI published a paper showing a reinforcement learning with human feedback technique that can surpass supervised models [-&gt;read more on OpenAI blog](https://openai.com/blog/learning-to-summarize-with-human-feedback/)\n\n**Reinforcement Learning with Offline Datasets**\n\nResearchers from the Berkeley AI Research (BAIR) Lab published a paper unveiling a method that uses offline datasets to improve reinforcement learning models[-&gt;read more on BAIR blog](https://bair.berkeley.edu/blog/2020/09/10/awac/)\n\n🤖 Cool AI Tech Releases\n\n**New Version of DeepSpeed**\n\nMicrosoft open-sourced a new version of DeepSpeed, an open-source library for parallelizable training that can scale up to models with 1 trillion parameters[-&gt;read more on Microsoft Research blog](https://www.microsoft.com/en-us/research/blog/deepspeed-extreme-scale-model-training-for-everyone/)\n\n💸 Money in AI\n\n* AI-powered customer experience management platform[ Sprinklr](https://www.sprinklr.com/) has raised[ $200 million](https://www.businesswire.com/news/home/20200909005490/en/Sprinklr-Raises-200-Million-2.7-Billion-Valuation) (kudos to our subscribers from Sprinklr 👏). Sprinklr's “AI listening processing” solution allows companies to get structured and meaningful sentiments and insights from unstructured customer data that comes from public conversations on different websites and social platforms.\n* [Xometry](https://www.xometry.com/?utm_term=xometry&amp;utm_campaign=PB:G%7CNT:SN%7CAN:Manufacturing%7CCN:Branded&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=3789459769&amp;hsa_cam=608070446&amp;hsa_grp=67613041575&amp;hsa_ad=425504589745&amp;hsa_src=g&amp;hsa_tgt=kwd-297018084385&amp;hsa_kw=xometry&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gclid=Cj0KCQjwwOz6BRCgARIsAKEG4FVwplBcDw00DsH2ClWe7mAa7aiB1NKRBATCEh7paLYeXXnvq6sYcJMaApPJEALw_wcB), an on-demand industrial parts marketplace, raises[ $75 million](https://techcrunch.com/2020/09/09/xometry-raises-75m-series-e-to-expand-custom-manufacturing-marketplace/) in Series E funding. The company provides a digital way of creating the right combination of buyers and manufacturers.\n* Another example of AI implementation into matching two sides for a deal. Real estate tech company[ Orchard](https://orchard.com/) raises[ $69 million](https://venturebeat.com/2020/09/10/orchard-raises-69-million-to-develop-machine-learning-for-buying-and-selling-homes/) in its recent funding round. Orchard aims to digitize the whole real estate market, by developing a solution that combines machine learning and rapid human assistance to smooth the search, match the right deal, and simplify buying and selling relationships.\n* Cybersecurity startup [Pcysys](https://www.pcysys.com/) raised[ $25 million](https://venturebeat.com/2020/09/09/pcysys-raises-25-million-for-automated-cybersecurity-testing/) in its funding round. Pcysys’ platform, which doesn’t require installation or network reconfiguration, uses algorithms to scan and “ethically” attack enterprise networks.\n* Robotics farming company [Iron Ox](https://ironox.com/) raised[ $20 million](https://venturebeat.com/2020/09/09/iron-ox-raises-20-million-to-grow-robotic-greenhouse-operations/) in a funding round. The system of farming robots is still semi-autonomous, the company’s goal is to become fully autonomous. \n* Insurtech company[ Descartes Underwriting](https://descartesunderwriting.com/) raised[ $18.5 million](https://venturebeat.com/2020/09/10/descartes-underwriting-raises-18-5-million-for-its-data-driven-insurance-platform/). The company applies AI and machine learning technologies to climate risk predicting and insurance underwriting.\n* Legaltech startup[ ThoughtRiver](https://www.thoughtriver.com/) raised[ $10 million](https://techcrunch.com/2020/09/07/thoughtriver-nabs-10m-to-speed-up-deal-making-with-ai-contract-review/) in its Series A round. Its AI solution applied to contract pre-screening aims to boost operational efficiency.\n* Medtech startup[ Skin Analytics](https://skin-analytics.com/) raised[ $5.1 million](https://techcrunch.com/2020/09/08/skin-analytics-raises-4m-series-a-to-use-ai-for-skin-cancer-screening/) in Series A funding. Skin Analytics has developed a clinically validated AI system that can identify not only the important skin cancers but also precancerous lesions that can be treated, as well as a range of lesions that are benign.\n* Amazon, along with several government organizations and three other industry partners, helped [fund](https://www.amazon.science/blog/amazon-supports-nsf-research-in-human-ai-interaction-collaboration) the National Science Foundation, a high-priority AI research initiative. The amount of funding is not disclosed.\n\nThis is our [Twitter](https://twitter.com/TheSequenceAI)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/isiloo/n_thesequence_scope_when_it_comes_to_machine/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "[n] thesequence scope: when it comes to machine learning, size matters: microsoft's deepspeed framework, which can train a model with up to a trillion parameters /!/ hi there! just wanted to share [the latest edition](https://thesequence.substack.com/p/-size-matters) of our free weekly digest. please, see it below. the content of thesequence is written by jesus rodriguez, one of the most-read contributors to kdnuggets and tds. you can check his medium [here](https://medium.com/@jrodthoughts). i'm a professional journalist with a passion for artificial intelligence. i think it's highly important to spread correct and practical information about ml and ai so i hope this promotion will not be too annoying. your feedback is very appreciated, and please feel free to [sign up](https://thesequence.substack.com/) if you like it.\n\n📝 editorial \n\nthe recent emergence of pre-trained language models and transformer architectures pushed the creation of larger and larger machine learning models. google’s bert presented attention mechanism and transformer architecture possibilities as the “next big thing” in ml, and the numbers seem surreal. openai’s gpt-2 set a record by processing 1.5 billion parameters, followed by microsoft’s turing-nlg, which processed 17 billion parameters just to see the new gpt-3 processing an astonishing 175 billion parameters. to not feel complacent, just this week microsoft announced a new release of its deepspeed framework (which powers turing-nlg), which can train a model with **up to a trillion parameters**. that sounds insane but it really isn’t.  \n\nwhat we are seeing is a consequence of several factors. first, computation power and parallelization techniques have evolved to a point where it is relatively easy to train machine learning models in large clusters of machines. second and most importantly, in the current state of machine learning, larger models have regularly outperformed smaller and more specialized models. knowledge reusability methods like transfer learning are still in very nascent stages. as a result, it’s really hard to build small models that can operate in uncertain environments. furthermore, as models like gpt-3 and turing-nlg have shown, there is some unexplainable magic that happens after models go past a certain size.\n\nmany of the immediate machine learning problems might be solved by scaling the current generation of neural network architectures. plain and simple, when it comes to machine learning, size matters.  \n\nwe would love to hear your opinions about the debate between broader-larger vs. smaller and more specialized models.  \n\n[leave a comment](https://thesequence.substack.com/p/-size-matters/comments)\n\n*now, to the most important developments in the ai industry this week*\n\n🔎 ml research\n\n**gpt-3 falls short in machine comprehension**\n\nproposed by researchers from a few major american universities, a 57-task test to measure models’ ability to reason poses challenges even for sophisticated models like gpt-3[ -&gt;read more in the original paper](https://arxiv.org/pdf/2009.03300.pdf)\n\n**better text summarization**\n\nopenai published a paper showing a reinforcement learning with human feedback technique that can surpass supervised models [-&gt;read more on openai blog](https://openai.com/blog/learning-to-summarize-with-human-feedback/)\n\n**reinforcement learning with offline datasets**\n\nresearchers from the berkeley ai research (bair) lab published a paper unveiling a method that uses offline datasets to improve reinforcement learning models[-&gt;read more on bair blog](https://bair.berkeley.edu/blog/2020/09/10/awac/)\n\n🤖 cool ai tech releases\n\n**new version of deepspeed**\n\nmicrosoft open-sourced a new version of deepspeed, an open-source library for parallelizable training that can scale up to models with 1 trillion parameters[-&gt;read more on microsoft research blog](https://www.microsoft.com/en-us/research/blog/deepspeed-extreme-scale-model-training-for-everyone/)\n\n💸 money in ai\n\n* ai-powered customer experience management platform[ sprinklr](https://www.sprinklr.com/) has raised[ $200 million](https://www.businesswire.com/news/home/20200909005490/en/sprinklr-raises-200-million-2.7-billion-valuation) (kudos to our subscribers from sprinklr 👏). sprinklr's “ai listening processing” solution allows companies to get structured and meaningful sentiments and insights from unstructured customer data that comes from public conversations on different websites and social platforms.\n* [xometry](https://www.xometry.com/?utm_term=xometry&amp;utm_campaign=pb:g%7cnt:sn%7can:manufacturing%7ccn:branded&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=3789459769&amp;hsa_cam=608070446&amp;hsa_grp=67613041575&amp;hsa_ad=425504589745&amp;hsa_src=g&amp;hsa_tgt=kwd-297018084385&amp;hsa_kw=xometry&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gclid=cj0kcqjwwoz6brcgarisakeg4fvwplbcdw00dsh2clwe7maa7aib1nkrbatceh7palyexxnvq6sycjmaappjealw_wcb), an on-demand industrial parts marketplace, raises[ $75 million](https://techcrunch.com/2020/09/09/xometry-raises-75m-series-e-to-expand-custom-manufacturing-marketplace/) in series e funding. the company provides a digital way of creating the right combination of buyers and manufacturers.\n* another example of ai implementation into matching two sides for a deal. real estate tech company[ orchard](https://orchard.com/) raises[ $69 million](https://venturebeat.com/2020/09/10/orchard-raises-69-million-to-develop-machine-learning-for-buying-and-selling-homes/) in its recent funding round. orchard aims to digitize the whole real estate market, by developing a solution that combines machine learning and rapid human assistance to smooth the search, match the right deal, and simplify buying and selling relationships.\n* cybersecurity startup [pcysys](https://www.pcysys.com/) raised[ $25 million](https://venturebeat.com/2020/09/09/pcysys-raises-25-million-for-automated-cybersecurity-testing/) in its funding round. pcysys’ platform, which doesn’t require installation or network reconfiguration, uses algorithms to scan and “ethically” attack enterprise networks.\n* robotics -----> farming !!!  company [iron ox](https://ironox.com/) raised[ $20 million](https://venturebeat.com/2020/09/09/iron-ox-raises-20-million-to-grow-robotic-greenhouse-operations/) in a funding round. the system of farming robots is still semi-autonomous, the company’s goal is to become fully autonomous. \n* insurtech company[ descartes underwriting](https://descartesunderwriting.com/) raised[ $18.5 million](https://venturebeat.com/2020/09/10/descartes-underwriting-raises-18-5-million-for-its-data-driven-insurance-platform/). the company applies ai and machine learning technologies to climate risk predicting and insurance underwriting.\n* legaltech startup[ thoughtriver](https://www.thoughtriver.com/) raised[ $10 million](https://techcrunch.com/2020/09/07/thoughtriver-nabs-10m-to-speed-up-deal-making-with-ai-contract-review/) in its series a round. its ai solution applied to contract pre-screening aims to boost operational efficiency.\n* medtech startup[ skin analytics](https://skin-analytics.com/) raised[ $5.1 million](https://techcrunch.com/2020/09/08/skin-analytics-raises-4m-series-a-to-use-ai-for-skin-cancer-screening/) in series a funding. skin analytics has developed a clinically validated ai system that can identify not only the important skin cancers but also precancerous lesions that can be treated, as well as a range of lesions that are benign.\n* amazon, along with several government organizations and three other industry partners, helped [fund](https://www.amazon.science/blog/amazon-supports-nsf-research-in-human-ai-interaction-collaboration) the national science foundation, a high-priority ai research initiative. the amount of funding is not disclosed.\n\nthis is our [twitter](https://twitter.com/thesequenceai)", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/isiloo/n_thesequence_scope_when_it_comes_to_machine/',)", "identifyer": 5603951, "year": "2020"}, {"autor": "Shadowbearer85", "date": 1602050275000, "content": "My very own pipe dream /!/ I'd  like some video game publishers to make AI for certain single player games. I'm currently playing Final Fantasy x again and would like something that could assist in getting special items and farming exp. Special items include prizes from mini games like crests and potentially a solution to the lightning dodging mini game.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j6llw1/my_very_own_pipe_dream/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "my very own pipe dream /!/ i'd  like some video game publishers to make ai for certain single player games. i'm currently playing final fantasy x again and would like something that could assist in getting special items and -----> farming !!!  exp. special items include prizes from mini games like crests and potentially a solution to the lightning dodging mini game.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j6llw1/my_very_own_pipe_dream/',)", "identifyer": 5604675, "year": "2020"}], "name": "farmingArtificialInteligence2020"}