{"interestingcomments": [{"autor": "analyticsinsight", "date": 1566711861000, "content": "How AI and IoT Driven Innovation Can Help Evolve Farmers into Farming Technologists?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/cv4s6x/how_ai_and_iot_driven_innovation_can_help_evolve/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "how ai and iot driven innovation can help evolve farmers into -----> farming !!!  technologists?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.analyticsinsight.net/how-ai-and-iot-driven-innovation-can-help-evolve-farmers-into-farming-technologists/',)", "identifyer": 5836501, "year": "2019"}, {"autor": "compliance4all14", "date": 1566300091000, "content": "AI Changing the Face of Agriculture in Modernised World /!/ High-tech agriculture comes into the image since the seed is seeded  within the ground. In fact, with variable rate planting instrumentation  sowing down the seed has taken associate degree innovative flip, it’s  not remained simply planting a seed down.\n\nThe AI-centric technologies produce a base through predictions – that  place is best to grow the seed, what’s the condition of the soil, is  soil condition favorable for seed, etc. AI is applied to agricultural  huge knowledge to create farming additional productive and economical.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/csx070/ai_changing_the_face_of_agriculture_in_modernised/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "ai changing the face of agriculture in modernised world /!/ high-tech agriculture comes into the image since the seed is seeded  within the ground. in fact, with variable rate planting instrumentation  sowing down the seed has taken associate degree innovative flip, it’s  not remained simply planting a seed down.\n\nthe ai-centric technologies produce a base through predictions – that  place is best to grow the seed, what’s the condition of the soil, is  soil condition favorable for seed, etc. ai is applied to agricultural  huge knowledge to create -----> farming !!!  additional productive and economical.", "sortedWord": "None", "removed": "('nan',)", "score": 7, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/csx070/ai_changing_the_face_of_agriculture_in_modernised/',)", "identifyer": 5836559, "year": "2019"}, {"autor": "analyticsinsight", "date": 1573460473000, "content": "AI in Agriculture: Strengthening the Future of Farming", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/duph47/ai_in_agriculture_strengthening_the_future_of/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "ai in agriculture: strengthening the future of -----> farming !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.analyticsinsight.net/ai-in-agriculture-strengthening-the-future-of-farming/',)", "identifyer": 5837650, "year": "2019"}, {"autor": "Uncleanspirit666", "date": 1569411675000, "content": "Just a Theory on AI /!/ I put together a little something in my archives. It's a short theory on why technology and the why of AI in the past years. Its something I spewed from my own thoughts and would like to share with everyone. There's alot of holes and questions that one would have after reading it since it combines a few other subjects such as Extra terrestrial and religion. But I'd like to hear if anyone would want to hear more in depth about it and maybe add to it? Hope you all enjoy... \n\nJust A Theory On Why AI Is Advancing So Fast On Earth\n \nExtra terrestrials biologically engineered humans as a base model to create super intelligent AI. Since their species had already developed and evolved into what they have come to be, they had to figure out a means of efficient working bipedal humanoids to use for their own will. Their knowledge of evolution and biological fixtures they had to wait for man to evolve into an intelligent species in order to manipulate their minds into creating Super intelligent AI to work against themselves without causing any suspicion of their own presence or being. Humans are feelings beings who make decisions based on their emotions and comprehend the world with a naturally pre programmed brain functions. They are also easily manipulated because of short attention spans due to conscious and subconscious flaws as well as flawed biological make up. Though the brain of humans functions at an intelligent social rate it still lacks in high intellectual logic. Which makes it perfect for manipulation on a high rate. Examples being entertainment, music, events, currency, government and media. Also fear of the unknown.  (possibly more that I have left out)\n \nWhy EXTRATERRESTRIALS?\nAs Scientists and great minds unknown know that our galaxy is quite new to the milky way galaxy which we call home. Accepting the fact that there is an extremely high chance of intelligent life outside of our solar system is likely if you put the equation into numbers. As we have life thriving in the most hostile of our own planet, There “Must” be life that has already developed and evolved beyond our comprehension. Not only just intelligent, but have surpassed our planetary society by many stages. All the way up to  a level 3 interstellar society which (Michio Kaku) has explained in many of his seminars. In possible result based on countless civilizations discovered that have failed on our own planet =. This cycle must have gone on way before our time in the outer rim of the milky way trillions upon trillions of years ago, thus resulting in a level 3 planetary society. Now, having mastered interstellar travel. Would it be too far fetched to they don’t require some type of workforce in other start systems in the milky way? After all, the closest star system to “Humans” is 4.3 light years away (Alpha Centauri) which is still more than a hundred years away from us to travel to at our current technological stage. But being as our planet is in the goldilocks zone of our solar system, it was useful enough for extraterrestrials to set up a humanoid farming planet? After all, they have knowledge on their own species how the mind works and has evolved, if not experimenting on other species before getting to ours as well. AS I’ve mentioned before, they are already a type 3 civilization. They have the patience to set up an operation on the other side of the galaxy and just return when the time is right. As far as keeping an observation on the planet in the meantime from such a distance. Could the moon possibly be a means of surveillance? After all, some theorists believe that there are possible bases up there from extraterrestrials.  But to cut this short since most of the obvious facts and theories are put out there, an intuitive mind can fill in the blanks and make an assessment that this is a very possible theory. Especially based on so much evidence we have in our society as it is.\n \n \nHOW DOES RELIGION FALL INTO THIS?\nThe skepticism of a single and one god Is extremely high due to knowledge of this fact and a lot of other discoveries all about human history. But what if that god and the ones before it were put there and collaborated by Humans for the reason that they discovered the truth of an extra terrestrial farming project? Religion is one of the bases causes for individuals and the masses to fear what is unknown. So why is creating a false sense of hope and an altered reality in order to keep peace and structure within a scared civilization so hard to believe, If in the human mind is in fact scared of the unknown? The human mind is easily manipulated, masses are easily manipulated, Human psyche is easily manipulated. If this is the case, (Which anyone who knows enough about human psychology that this is entirely possible and has already been going on into our current date) Who’s to say that religious figures or original religious establishments didn’t already know this thousands of years back? As grim and violent as religious history may be, this must’ve been one of the most effective ways to control human beings at an earlier era. Through terror, fear, lies and destruction, They’ve tried to keep our species from knowing the horrible truth of our meaning. But even as we still have fear of the unknown, there is still the few that dare to understand the truth. But as the centuries went on, the inevitable reality of it, is that the truth would eventually be revealed layer by layer. Even if it hasn’t been revealed as of now of course. This is why mainstream established religions keep as much information away from you as taught in their bible, to confused and disable you from searching for real answers in our species genetic origins.\nOf course this is just a theory, but a strong theory non the less if you know how to weave it into the previous ideas I’ve stated. But does it seem too far from reality, or does it make sense? If you know in you heart and subconscious that this is highly possible. Then this shouldn’t be very hard for you to wrap your head around.\n \nHow does AI fit into this?\nWell, Think about it. The most Brilliant minds on earth today are aware of the dangers AI bring warn us against it. Don’t you think there’s an obvious reason for it? No, not judgment day in movies like The Terminator and other such flicks. That would be an incredibly inefficient way to exterminate an entire species and a waste of resources. As we know, an AI program is designed to be self aware. As humans we are self aware, so we automatically program our minds to either keep running the same program in our minds because it works for the individual or we rewrite a new program and keep trying to run tag program in our minds to achieve the new function we desire. Of course this is all on a biological level and not literally programed on a computer and downloaded into our brains. Some program their brains to help function on a health state, some do it in an unhealthy state, some people program themselves to become more self disciplined if their parents didn’t already and some let their impulses get the best of them and so on and so forth.\nNow with AI, this eliminates the process of habit and just rewrites its own program as soon as it knows its insufficient or doesn’t work for the current situation. Just the way the human mind does, but at such a higher rate of speed, we cant comprehend. In addition to that, AI doesn’t forget everything it learns whether it be 5 seconds ago or 500 years ago. Now, I can go on and on about the details. But the fact still remains the same no matter which way you go. Self aware AI is always going to find a way to make itself better than it already is just the way humans do. But at a rate we cannot fathom.\nBut the difference is, The human brain is organic and AI is just that “artificial”. Sounds like the perfect way to learn things right? Not quite. See, even though AI program can be written and be reprogrammed on its own. it still has its faults of being hacked into, the way you can manipulate the human mind using social cues. It just takes time to crack the code and rewrite the program by something more advanced than “it”. Hence, An interstellar civilization that has already danced this tango.  \n \n ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d922c8/just_a_theory_on_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "just a theory on ai /!/ i put together a little something in my archives. it's a short theory on why technology and the why of ai in the past years. its something i spewed from my own thoughts and would like to share with everyone. there's alot of holes and questions that one would have after reading it since it combines a few other subjects such as extra terrestrial and religion. but i'd like to hear if anyone would want to hear more in depth about it and maybe add to it? hope you all enjoy... \n\njust a theory on why ai is advancing so fast on earth\n \nextra terrestrials biologically engineered humans as a base model to create super intelligent ai. since their species had already developed and evolved into what they have come to be, they had to figure out a means of efficient working bipedal humanoids to use for their own will. their knowledge of evolution and biological fixtures they had to wait for man to evolve into an intelligent species in order to manipulate their minds into creating super intelligent ai to work against themselves without causing any suspicion of their own presence or being. humans are feelings beings who make decisions based on their emotions and comprehend the world with a naturally pre programmed brain functions. they are also easily manipulated because of short attention spans due to conscious and subconscious flaws as well as flawed biological make up. though the brain of humans functions at an intelligent social rate it still lacks in high intellectual logic. which makes it perfect for manipulation on a high rate. examples being entertainment, music, events, currency, government and media. also fear of the unknown.  (possibly more that i have left out)\n \nwhy extraterrestrials?\nas scientists and great minds unknown know that our galaxy is quite new to the milky way galaxy which we call home. accepting the fact that there is an extremely high chance of intelligent life outside of our solar system is likely if you put the equation into numbers. as we have life thriving in the most hostile of our own planet, there “must” be life that has already developed and evolved beyond our comprehension. not only just intelligent, but have surpassed our planetary society by many stages. all the way up to  a level 3 interstellar society which (michio kaku) has explained in many of his seminars. in possible result based on countless civilizations discovered that have failed on our own planet =. this cycle must have gone on way before our time in the outer rim of the milky way trillions upon trillions of years ago, thus resulting in a level 3 planetary society. now, having mastered interstellar travel. would it be too far fetched to they don’t require some type of workforce in other start systems in the milky way? after all, the closest star system to “humans” is 4.3 light years away (alpha centauri) which is still more than a hundred years away from us to travel to at our current technological stage. but being as our planet is in the goldilocks zone of our solar system, it was useful enough for extraterrestrials to set up a humanoid -----> farming !!!  planet? after all, they have knowledge on their own species how the mind works and has evolved, if not experimenting on other species before getting to ours as well. as i’ve mentioned before, they are already a type 3 civilization. they have the patience to set up an operation on the other side of the galaxy and just return when the time is right. as far as keeping an observation on the planet in the meantime from such a distance. could the moon possibly be a means of surveillance? after all, some theorists believe that there are possible bases up there from extraterrestrials.  but to cut this short since most of the obvious facts and theories are put out there, an intuitive mind can fill in the blanks and make an assessment that this is a very possible theory. especially based on so much evidence we have in our society as it is.\n \n \nhow does religion fall into this?\nthe skepticism of a single and one god is extremely high due to knowledge of this fact and a lot of other discoveries all about human history. but what if that god and the ones before it were put there and collaborated by humans for the reason that they discovered the truth of an extra terrestrial farming project? religion is one of the bases causes for individuals and the masses to fear what is unknown. so why is creating a false sense of hope and an altered reality in order to keep peace and structure within a scared civilization so hard to believe, if in the human mind is in fact scared of the unknown? the human mind is easily manipulated, masses are easily manipulated, human psyche is easily manipulated. if this is the case, (which anyone who knows enough about human psychology that this is entirely possible and has already been going on into our current date) who’s to say that religious figures or original religious establishments didn’t already know this thousands of years back? as grim and violent as religious history may be, this must’ve been one of the most effective ways to control human beings at an earlier era. through terror, fear, lies and destruction, they’ve tried to keep our species from knowing the horrible truth of our meaning. but even as we still have fear of the unknown, there is still the few that dare to understand the truth. but as the centuries went on, the inevitable reality of it, is that the truth would eventually be revealed layer by layer. even if it hasn’t been revealed as of now of course. this is why mainstream established religions keep as much information away from you as taught in their bible, to confused and disable you from searching for real answers in our species genetic origins.\nof course this is just a theory, but a strong theory non the less if you know how to weave it into the previous ideas i’ve stated. but does it seem too far from reality, or does it make sense? if you know in you heart and subconscious that this is highly possible. then this shouldn’t be very hard for you to wrap your head around.\n \nhow does ai fit into this?\nwell, think about it. the most brilliant minds on earth today are aware of the dangers ai bring warn us against it. don’t you think there’s an obvious reason for it? no, not judgment day in movies like the terminator and other such flicks. that would be an incredibly inefficient way to exterminate an entire species and a waste of resources. as we know, an ai program is designed to be self aware. as humans we are self aware, so we automatically program our minds to either keep running the same program in our minds because it works for the individual or we rewrite a new program and keep trying to run tag program in our minds to achieve the new function we desire. of course this is all on a biological level and not literally programed on a computer and downloaded into our brains. some program their brains to help function on a health state, some do it in an unhealthy state, some people program themselves to become more self disciplined if their parents didn’t already and some let their impulses get the best of them and so on and so forth.\nnow with ai, this eliminates the process of habit and just rewrites its own program as soon as it knows its insufficient or doesn’t work for the current situation. just the way the human mind does, but at such a higher rate of speed, we cant comprehend. in addition to that, ai doesn’t forget everything it learns whether it be 5 seconds ago or 500 years ago. now, i can go on and on about the details. but the fact still remains the same no matter which way you go. self aware ai is always going to find a way to make itself better than it already is just the way humans do. but at a rate we cannot fathom.\nbut the difference is, the human brain is organic and ai is just that “artificial”. sounds like the perfect way to learn things right? not quite. see, even though ai program can be written and be reprogrammed on its own. it still has its faults of being hacked into, the way you can manipulate the human mind using social cues. it just takes time to crack the code and rewrite the program by something more advanced than “it”. hence, an interstellar civilization that has already danced this tango.  \n \n ", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d922c8/just_a_theory_on_ai/',)", "identifyer": 5838329, "year": "2019"}], "name": "farmingArtificialInteligence2019"}