{"interestingcomments": [{"autor": "poojahansa184", "date": 1578035489000, "content": "How AI is trailblazing the tea industry? /!/  The tea industry in India is nearly 180 years old now. It was in 1840 when the Assam Tea Company began the commercial production of tea in the region. It is one out of the few industries that haveadopted research and development way back in 1895 which was formalized with the setting up of Tocklai Tea Research Institute in 1911. In the past , the farmers and stakeholders have relied upon the use of the Tocklai Ballometric Count for determining the “**Fine Leaf Count**” which have stood the test of time. \n\n&amp;#x200B;\n\nAI-based machine that solves the problem for the industry. This machine named ***Tragnext FLC Machine*** determines the fine leaf count of a batch without any human interventions, reducing the process to seconds and improving the overall accuracy. \n\nFine Leaf Count Technology: First AI intervention in the global tea industry to improve tea quality.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ejbyk5/how_ai_is_trailblazing_the_tea_industry/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "leaf", "selectorShort": "leaf", "MarkedSent": "how ai is trailblazing the tea industry? /!/  the tea industry in india is nearly 180 years old now. it was in 1840 when the assam tea company began the commercial production of tea in the region. it is one out of the few industries that haveadopted research and development way back in 1895 which was formalized with the setting up of tocklai tea research institute in 1911. in the past , the farmers and stakeholders have relied upon the use of the tocklai ballometric count for determining the “**fine -----> leaf !!!  count**” which have stood the test of time. \n\n&amp;#x200b;\n\nai-based machine that solves the problem for the industry. this machine named ***tragnext flc machine*** determines the fine leaf count of a batch without any human interventions, reducing the process to seconds and improving the overall accuracy. \n\nfine leaf count technology: first ai intervention in the global tea industry to improve tea quality.", "sortedWord": "None", "removed": "('nan',)", "score": 6, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ejbyk5/how_ai_is_trailblazing_the_tea_industry/',)", "identifyer": 5602152, "year": "2020"}], "name": "leafArtificialInteligence2020"}