{"interestingcomments": [{"autor": "rahi009", "date": 1577905471000, "content": "AI Based Blueprint and 3d Model Generation /!/ Hi There. \n\nI am currently doing my BSCS and i am in my final year, so i want to make my Final Year Project. My Final Year Project is based around Artificial Intelligence which is basically that will help people to have a great blueprint and a 3d model of there house in a matter of seconds. \n\nBasically when the user will turn on the app first he will have to create an account and then after successfully signing up he can manually enter dimensions of there plot or can take a picture of there plot and then draw lines on there mobile phone screens and based on these lines the AI will calculate the dimensions of the plot and will create a blueprint and a 3d model of the plot. \n\nWell i am planning to use Google ML kit for my project. Can anyone help that how can i achieve this milestone.\n\nAny suggestions would be helpful.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/eim5jv/ai_based_blueprint_and_3d_model_generation/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "ai based blueprint and 3d model generation /!/ hi there. \n\ni am currently doing my bscs and i am in my final year, so i want to make my final year project. my final year project is based around artificial intelligence which is basically that will help people to have a great blueprint and a 3d model of there house in a matter of seconds. \n\nbasically when the user will turn on the app first he will have to create an account and then after successfully signing up he can manually enter dimensions of there -----> plot !!!  or can take a picture of there -----> plot !!!  and then draw lines on there mobile phone screens and based on these lines the ai will calculate the dimensions of the -----> plot !!!  and will create a blueprint and a 3d model of the -----> plot !!! . \n\nwell i am planning to use google ml kit for my project. can anyone help that how can i achieve this milestone.\n\nany suggestions would be helpful.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/eim5jv/ai_based_blueprint_and_3d_model_generation/',)", "identifyer": 5602169, "year": "2020"}, {"autor": "roaasoloh", "date": 1601877191000, "content": "Clarification on performance measures /!/ I'm seeking more clarification about these measures in order to implement them in python:\n\nPrecision-recall plot: Precision represents the portion of the K closest matches returned that are in the correct class. Recall represents the portion of objects in M’s class that are in the top K matches. Recall is plotted on the horizontal axis, while precision is plotted on the vertical axis; results closer to the horizontal line y = 1 are desirable.\n\nNearest neighbor (NN): the mean percentage of objects in the query object’s class that are also in the top K = 1 results; results closer to 1.0 are desirable.\n\nFirst-tier (1-tier): the mean percentage of objects in the query object’s class that are also in the top results; results closer to 1.0 are desirable.\n\nSecond-tier (2-tier): the mean percentage of objects in the query object’s class that are also in the top results; results closer to 1.0 are desirable.\n\nE-measure: E-measure is defined where P is the precision and R is the recall over the top K = 32 objects. Results closer to 1.0 are desirable.\n\nDiscounted Cumulative Gain (DCG): DCG reflects the performance of the algorithm when correct results that are retrieved earlier are weighted higher than those retrieved later", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j5e5k9/clarification_on_performance_measures/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "plot", "selectorShort": "plot", "MarkedSent": "clarification on performance measures /!/ i'm seeking more clarification about these measures in order to implement them in python:\n\nprecision-recall -----> plot !!! : precision represents the portion of the k closest matches returned that are in the correct class. recall represents the portion of objects in m’s class that are in the top k matches. recall is plotted on the horizontal axis, while precision is plotted on the vertical axis; results closer to the horizontal line y = 1 are desirable.\n\nnearest neighbor (nn): the mean percentage of objects in the query object’s class that are also in the top k = 1 results; results closer to 1.0 are desirable.\n\nfirst-tier (1-tier): the mean percentage of objects in the query object’s class that are also in the top results; results closer to 1.0 are desirable.\n\nsecond-tier (2-tier): the mean percentage of objects in the query object’s class that are also in the top results; results closer to 1.0 are desirable.\n\ne-measure: e-measure is defined where p is the precision and r is the recall over the top k = 32 objects. results closer to 1.0 are desirable.\n\ndiscounted cumulative gain (dcg): dcg reflects the performance of the algorithm when correct results that are retrieved earlier are weighted higher than those retrieved later", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j5e5k9/clarification_on_performance_measures/',)", "identifyer": 5606275, "year": "2020"}], "name": "plotArtificialInteligence2020"}