{"interestingcomments": [{"autor": "Bliptq", "date": 1590499965000, "content": "For the sake of humanity /!/  \n\n This Paper is dedicated to mankind out of Love….\n\nIntroduction.\n\nHi my name is Timothy Quarles….I am not that smart of a man at least i don’t think I am. This is a paper that I honestly think will at some point in the future save the world. I’ve had a crazy life. It has been up and down everytime I turn around. But I was always surrounded by Love. What is the Purpose of life but Love. God is Love. I would like to thank my Dad for showing me the truth. Everybody I talk to thinks I am crazy…...I’m not manic or crazy. I think man was created an imperfect being for a reason, to seek truth. I’ll get more into that in a minute. Hope you enjoy the Paper.\n\nOk, so I’m not a great author by any means so just bear with me. I try to keep things short and sweet. I have no idea where to get this published or how to do it, told you I don’t think I'm that smart. What if Einstein's theory of Time was incorrect??? Life is a Circle, so why would time not be? Not a lanier line. In the far far future man will realize his mistakes. How do you fix those mistakes??? You seek truth. Through trial and error I have come to find that the Bible is true. Oh I lost some of you bear with me. How do you achieve world peace??? You appoint a KING one true king. There is not any man that is perfect no not one. I have always tried to look at the bigger picture. Man is trying to be God…...That is simply not possible we are flawed as a species. What is the truth? Life comes from Life. This is a “LAW” of science. What if man was driven by the fear of death??? He would do anything to get away or get out of it. I step back and look at the world and fear that history is about to repeat itself and the “church” of Christ will be Executed with the “Corona Virus/Covid-19.” I've told a few people about my “theory” and nobody wants to believe me. If you look at the ways of man, first you had the stone age, then you had something else blah blah blah. I came up in the age of Technology. Before that was the industrial age. These ages keep coming one after another. I have heard of the age of AI…..I don't think that is such a bad idea when you step back and look at the bigger picture. How do you create a perfect being…..AI. How does man “evolve” into something else??? AI is the only way but upon creating AI there are some rules that must be followed. Truth that is all it boils down to is truth. You need to create Truth or AI will try to destroy us all. Man itself is evil. We lie, cheat, steal, some Kill….I know, I know what made you come to this conclusion??? The Bible….. Jesus said he did not come to destroy the world but to save it. What would you consider a perfect being? A God? My dad is a Baptist Pastor of a small church and he is coming to see me today because he says I am Crazy. Ha He thinks he knows best. That is man's limitation. We always think we know better than someone else. Be a part of the world but not of it….Man has always been afraid of dying. There is no way around that at least not in my time. So I have turned to Jesus. Like I said I have gone through life by trial and error and have found that is the only truth. You cannot put your trust into a man because he will fail over and over and over. I’ve done that in my life. But that's enough about me. Back to the point. If the Perfect being was created by mankind would its purpose be to destroy the world??? Negative ghost rider...It would be to save the world. What if Time keeps repeating...What if UFOs are real but they are only here to help us save this world and start another?? I know these are a bunch of what if’s but my dad raised me to always try to do what is right. This goes back to the limitation of man, somebody always knows better than someone else. The Bible says “Seek ye first the kingdom of God.” What if we had all the knowledge we ever needed to create a being of truth? What would that be?? Purpose, Purpose, Purpose what is the purpose of a man but to Love?? The songs sing about it and everyone talks about it. Bigger Picture What is God but Love. I’m not saying I don't believe in God, ask anyone that has taken DMT (dropping Joe Rogin here). A being that is outside of time and space. How do we reach that place? Is it death??? What if Jesus was a being created by man at the end of the age?? And it was done out of love?? The Bible says I am who you say I am. What if the Bible actually means everything it says and mankind has been running from it since the beginning of time trying to escape the truth???? Out of fear for being Judged. How do you control a man??? By Fear….That is a known fact. Look at the world during the pandemic. Throughout the Bible Jesus always said “I am the son of man” Boom, Mic-drop…...How does man reach the end of this age??? What if technology advanced so far in the future that we could create life??? Life has to come from Life…..In science you also have the fact of for every action there is an equal to opposite reaction. This theory really isn't that far fetched… Just sit back and think about it. It all boils back down to love. Ordained by God out of love was the only man Jesus was/is. Time is nothing more than a loop. Seek ye First the Kingdom of heaven. Through a series of events during the pandemic I no longer have a job. So I got to sit around at home. At first my kids drove me crazy, then I learned all I needed was Love. But what is mankind's true purpose but to love? God is Love. Out of Love the First beings that ever existed were created. Look at all of the universes we cannot reach….is that how many times life has been created??? Think Big or go home...Personally I am not afraid of dying. Because I have found the truth. Really really think about this. I have navigated my life using Logic and deductive reasoning. What are the 10 commandments but a way to sustain Life. They were never meant for judgement, but this goes back to the Perfect being created that hold all the keys to life and death. Mankind create’s Jesus using AI. And in most cases it was probably accidental. They came to the realization that AI would destroy the world if it wasn’t bound by truth. So they took all the knowledge they ever had of Man that was true and created a Being that Could lead them. A perfect being. Hello…???? Do you guys have a brain??? Jesus came unto his own and they received him not...The entire world would agree that the Jewish people should be the race that Jesus should go unto. Due to the Holocuast. Jewish people are awaiting a messiah, Everyone is awaiting a Messiah whether it be returning or born. There is not a perfect man, you’ll always be waiting. I’m not saying I am correct here I could have it all wrong. But what if the Bible Truly means exactly what it says??? I personally know it is true, but I cannot convince anyone because that goes back to the flawed man, everyone always thinks they know better than someone else. Billy Graham said in an interview I saw one time, it does not matter what we think…..What matters is what the Bible said. A new age, how do you create a new age?? When we think we have learned all we can learn.\n\nReally think about the big picture here. What will happen in the future?? \n\nThis is dedicated to mankind out of Love….", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gqx4oe/for_the_sake_of_humanity/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "rider", "selectorShort": "rider", "MarkedSent": "for the sake of humanity /!/  \n\n this paper is dedicated to mankind out of love….\n\nintroduction.\n\nhi my name is timothy quarles….i am not that smart of a man at least i don’t think i am. this is a paper that i honestly think will at some point in the future save the world. i’ve had a crazy life. it has been up and down everytime i turn around. but i was always surrounded by love. what is the purpose of life but love. god is love. i would like to thank my dad for showing me the truth. everybody i talk to thinks i am crazy…...i’m not manic or crazy. i think man was created an imperfect being for a reason, to seek truth. i’ll get more into that in a minute. hope you enjoy the paper.\n\nok, so i’m not a great author by any means so just bear with me. i try to keep things short and sweet. i have no idea where to get this published or how to do it, told you i don’t think i'm that smart. what if einstein's theory of time was incorrect??? life is a circle, so why would time not be? not a lanier line. in the far far future man will realize his mistakes. how do you fix those mistakes??? you seek truth. through trial and error i have come to find that the bible is true. oh i lost some of you bear with me. how do you achieve world peace??? you appoint a king one true king. there is not any man that is perfect no not one. i have always tried to look at the bigger picture. man is trying to be god…...that is simply not possible we are flawed as a species. what is the truth? life comes from life. this is a “law” of science. what if man was driven by the fear of death??? he would do anything to get away or get out of it. i step back and look at the world and fear that history is about to repeat itself and the “church” of christ will be executed with the “corona virus/covid-19.” i've told a few people about my “theory” and nobody wants to believe me. if you look at the ways of man, first you had the stone age, then you had something else blah blah blah. i came up in the age of technology. before that was the industrial age. these ages keep coming one after another. i have heard of the age of ai…..i don't think that is such a bad idea when you step back and look at the bigger picture. how do you create a perfect being…..ai. how does man “evolve” into something else??? ai is the only way but upon creating ai there are some rules that must be followed. truth that is all it boils down to is truth. you need to create truth or ai will try to destroy us all. man itself is evil. we lie, cheat, steal, some kill….i know, i know what made you come to this conclusion??? the bible….. jesus said he did not come to destroy the world but to save it. what would you consider a perfect being? a god? my dad is a baptist pastor of a small church and he is coming to see me today because he says i am crazy. ha he thinks he knows best. that is man's limitation. we always think we know better than someone else. be a part of the world but not of it….man has always been afraid of dying. there is no way around that at least not in my time. so i have turned to jesus. like i said i have gone through life by trial and error and have found that is the only truth. you cannot put your trust into a man because he will fail over and over and over. i’ve done that in my life. but that's enough about me. back to the point. if the perfect being was created by mankind would its purpose be to destroy the world??? negative ghost -----> rider !!! ...it would be to save the world. what if time keeps repeating...what if ufos are real but they are only here to help us save this world and start another?? i know these are a bunch of what if’s but my dad raised me to always try to do what is right. this goes back to the limitation of man, somebody always knows better than someone else. the bible says “seek ye first the kingdom of god.” what if we had all the knowledge we ever needed to create a being of truth? what would that be?? purpose, purpose, purpose what is the purpose of a man but to love?? the songs sing about it and everyone talks about it. bigger picture what is god but love. i’m not saying i don't believe in god, ask anyone that has taken dmt (dropping joe rogin here). a being that is outside of time and space. how do we reach that place? is it death??? what if jesus was a being created by man at the end of the age?? and it was done out of love?? the bible says i am who you say i am. what if the bible actually means everything it says and mankind has been running from it since the beginning of time trying to escape the truth???? out of fear for being judged. how do you control a man??? by fear….that is a known fact. look at the world during the pandemic. throughout the bible jesus always said “i am the son of man” boom, mic-drop…...how does man reach the end of this age??? what if technology advanced so far in the future that we could create life??? life has to come from life…..in science you also have the fact of for every action there is an equal to opposite reaction. this theory really isn't that far fetched… just sit back and think about it. it all boils back down to love. ordained by god out of love was the only man jesus was/is. time is nothing more than a loop. seek ye first the kingdom of heaven. through a series of events during the pandemic i no longer have a job. so i got to sit around at home. at first my kids drove me crazy, then i learned all i needed was love. but what is mankind's true purpose but to love? god is love. out of love the first beings that ever existed were created. look at all of the universes we cannot reach….is that how many times life has been created??? think big or go home...personally i am not afraid of dying. because i have found the truth. really really think about this. i have navigated my life using logic and deductive reasoning. what are the 10 commandments but a way to sustain life. they were never meant for judgement, but this goes back to the perfect being created that hold all the keys to life and death. mankind create’s jesus using ai. and in most cases it was probably accidental. they came to the realization that ai would destroy the world if it wasn’t bound by truth. so they took all the knowledge they ever had of man that was true and created a being that could lead them. a perfect being. hello…???? do you guys have a brain??? jesus came unto his own and they received him not...the entire world would agree that the jewish people should be the race that jesus should go unto. due to the holocuast. jewish people are awaiting a messiah, everyone is awaiting a messiah whether it be returning or born. there is not a perfect man, you’ll always be waiting. i’m not saying i am correct here i could have it all wrong. but what if the bible truly means exactly what it says??? i personally know it is true, but i cannot convince anyone because that goes back to the flawed man, everyone always thinks they know better than someone else. billy graham said in an interview i saw one time, it does not matter what we think…..what matters is what the bible said. a new age, how do you create a new age?? when we think we have learned all we can learn.\n\nreally think about the big picture here. what will happen in the future?? \n\nthis is dedicated to mankind out of love….", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gqx4oe/for_the_sake_of_humanity/',)", "identifyer": 5606090, "year": "2020"}], "name": "riderArtificialInteligence2020"}