{"interestingcomments": [{"autor": "bentalebabdelaziz", "date": 1580506024000, "content": "Pic.Hance : A free AI-based tool for improving image quality", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ewv9us/pichance_a_free_aibased_tool_for_improving_image/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "pic.hance : a free ai-based -----> tool !!!  for improving image quality", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hawassib.com/pic-hance-a-free-ai-based-tool-for-improving-image-quality/',)", "identifyer": 5599061, "year": "2020"}, {"autor": "MainImpression12", "date": 1587100930000, "content": "The History and Future of Web Data Scraping tools /!/  As a data scientist, building machine learning and deep learning solutions, web data scraping has been a part and parcel of everything I do. Having used every available web data scraping tool and solution over the last 15 years, I’ve hereby created a chronology and included my reviews of the web scraping tools from yesteryears till today and for tomorrow.\n\nIt all began in the ’80s with Javascript and Python-based web scrapers.\n\nHere's a Quick read:  [https://webgrinder.io/blog/the-history-and-future-of-web-data-scraping-tools\\_\\_28](https://webgrinder.io/blog/the-history-and-future-of-web-data-scraping-tools__28)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/g2vnxl/the_history_and_future_of_web_data_scraping_tools/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the history and future of web data scraping tools /!/  as a data scientist, building machine learning and deep learning solutions, web data scraping has been a part and parcel of everything i do. having used every available web data scraping -----> tool !!!  and solution over the last 15 years, i’ve hereby created a chronology and included my reviews of the web scraping tools from yesteryears till today and for tomorrow.\n\nit all began in the ’80s with javascript and python-based web scrapers.\n\nhere's a quick read:  [https://webgrinder.io/blog/the-history-and-future-of-web-data-scraping-tools\\_\\_28](https://webgrinder.io/blog/the-history-and-future-of-web-data-scraping-tools__28)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/g2vnxl/the_history_and_future_of_web_data_scraping_tools/',)", "identifyer": 5599111, "year": "2020"}, {"autor": "dannylenwinn", "date": 1583992328000, "content": "OpenSpace’s AI-based reality capture tool looks to make construction site documentation a completely passive experience. “We used the technology to record all above-ceiling and in-wall rough-in throughout the building for the end user,” says Dalbom.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/fhbo0j/openspaces_aibased_reality_capture_tool_looks_to/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "openspace’s ai-based reality capture -----> tool !!!  looks to make construction site documentation a completely passive experience. “we used the technology to record all above-ceiling and in-wall rough-in throughout the building for the end user,” says dalbom.", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('http://www.bdcnetwork.com/no-labor-no-infrastructure-no-problem',)", "identifyer": 5599206, "year": "2020"}, {"autor": "Fancy-hello", "date": 1583629406000, "content": "What makes an AI human /!/ Hello everyone, as we all know ai is getting smarter everyday, and at one point its going to surpass humans.\nBut the question is would ai become more human over time? Or would it just stay like a tool? \nMy question is what makes us human and makes robots and ai in the future not? \nAnd what qualities should an ai have in order to be considered more human than another ai? \nFor now i kind of think, its free will but i want to know more about this. Feel free to share your thoughts please.\nThank you!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ff4uph/what_makes_an_ai_human/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what makes an ai human /!/ hello everyone, as we all know ai is getting smarter everyday, and at one point its going to surpass humans.\nbut the question is would ai become more human over time? or would it just stay like a -----> tool !!! ? \nmy question is what makes us human and makes robots and ai in the future not? \nand what qualities should an ai have in order to be considered more human than another ai? \nfor now i kind of think, its free will but i want to know more about this. feel free to share your thoughts please.\nthank you!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 11, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ff4uph/what_makes_an_ai_human/',)", "identifyer": 5599257, "year": "2020"}, {"autor": "Roburts", "date": 1590217752000, "content": "Deep Learning introduction VR application. Master thesis project with the goal of exploring how VR can be utilized as a tool for learning in AI education. Evaluation questionnaire in comments. Please help.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gp0mc0/deep_learning_introduction_vr_application_master/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "deep learning introduction vr application. master thesis project with the goal of exploring how vr can be utilized as a -----> tool !!!  for learning in ai education. evaluation questionnaire in comments. please help.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('rich:video',)", "medialink": "('https://youtu.be/TvlN-dxAn4M',)", "identifyer": 5599325, "year": "2020"}, {"autor": "justinparker001", "date": 1596619056000, "content": "Used Pixbim Color Surprise AI tool to color my black and white photo", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/i422uv/used_pixbim_color_surprise_ai_tool_to_color_my/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "used pixbim color surprise ai -----> tool !!!  to color my black and white photo", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('image',)", "medialink": "('https://i.redd.it/gruuu93hi5f51.png',)", "identifyer": 5599517, "year": "2020"}, {"autor": "elevatorbeat", "date": 1596563803000, "content": "The Alchemy of AI: Transforming Inputs into Insight. /!/ We've all heard the buzzwords about AI. But very few people outside of this sub can really define what artificial intelligence is or why it's useful.\n\nFor us, we think of artificial intelligence as a tool that allows you to intuitively discover the relationship between inputs and outputs. What goes into an AI model can be translated, converted, and put to work via a variety of methodologies. \n\nFor example, an input may be drone footage of a disaster area (photo) and its output could be a damage estimate (financial).\n\nIn this guide, we’ll explore all of the different kinds of inputs and outputs you can work with to build AI solutions.\n\nWhen combined with your existing data, these possibilities can give you the building blocks you need to string together a powerful AI capability for your organization.\n\nIf you've ever wondered what your company can do with its data, then this will definitely get your wheels turning.\n\n# Think about AI as Inputs and Outputs\n\nSo now that we've explored how AI is a tool for finding the relationship between inputs in outputs, let's define what some of those major inputs and outputs can be. \n\n# Inputs\n\n# SEMANTIC DATA\n\nBy now, AI is super-human in its ability to understand and process language. This is obviously super useful because a huge part of the world’s information is one kind of communication or another. We’re talking documents, books, handwriting, articles, speech, etc. \n\nNatural Language Processing (NLP) models think about language in terms of each word’s relationship to related words. We can think of NLP models as a vast 3-D word cloud where related words cluster together forming vectors of associations and understanding. In effect, language processing models convert language into mathematical relationships.\n\nAlthough this may sound a bit abstract, our brains actually process language in a similar way. Consider this sentence:  \n*The dove dove into the water.*\n\nMost of us can pretty easily intuit from the sentence structure that the first *dove* is the noun and the second *dove* is an action related to water.\n\nLanguages like German, Chinese, and Korean drop these associations right into their vocabulary. For example, in German, *kindergarten* literally means *child garden*. In Korean, the word for *fish* (물고기) is a compound of *water* (물) and *meat* (고기).\n\nAll of this is to say that by quantifying the relationships words have to other words, AI language models have gotten extremely adept at learning to read, write, translate and summarize with ease.\n\n## QUANTITATIVE DATA\n\nAI models are built on complex mathematical equations so it shouldn’t surprise you that AI speaks the language of numbers. AI models can vacuum up all sorts of quantitative data such as statistics, analytics, dates, sequences, financial information, etc.\n\n## Multimedia\n\nWhereas semantic and quantitative data uses abstract concepts as inputs, multimedia data is much more concrete. When considering what multimedia data you might be able to use, think about your senses:\n\n* Visual data can include photography, video, satellite footage, video surveillance\n* Auditory data such as sound recordings or RADAR.\n* Sensory data such as temperature or LIDAR.\n\nHell, if you’ve got an [electronic nose](https://en.wikipedia.org/wiki/Electronic_nose?utm_medium=email&amp;_hsmi=2&amp;_hsenc=p2ANqtz-95ooUXjGQzht7-GRYkNbKLkGV4mg9nB3gDFY3Vyd2XVAY0wsgy4OE5HrmPwMQ8-_mOX7Y7xTptCnsr2cAi0_quRMeEXQ&amp;utm_content=2&amp;utm_source=hs_email), you could even consider olfactory information. \n\nBy the way: data scientists can build AI models that consider datasets from all of these categories at once. For example, you could build a healthcare diagnostic model by integrating a doctor’s description of the patient’s symptoms (semantic), their bloodwork (quantitative), and chest Xrays (multimedia).\n\n# Outputs\n\nAs we discussed in [Chapter 1](https://www.manceps.com/resources/complete-ai-guide/chapter-1-what-is-artificial-intelligence), AI models build intuition about the relationship between inputs and outputs. To better understand how your organization could put AI to work, you’ve got to consider both. Broadly speaking, AI can be used to do two main things: surface information or create content.\n\nSurfacing information includes things like categorization, pattern recognition, and prediction. These outputs can then be piped into systems that either (a) deliver this essential information to stakeholders for better decision-making and/or (b) put this information to work via some kind of hardware or software.\n\nFor example, an AI model that surfaces a stock prediction could be put into production as a daily email that arrives in your inbox or as an app that will automatically conduct trades for you.\n\nAlternately, AIs can be used to create content. In a broad sense, the types of content that cognitive intelligence can create is similar to the inputs that AI can consider. For example, AIs can produce both articles and images of all kinds of crazy iterations, as we’ll discuss below.\n\nLet’s consider each of these outputs in more detail:\n\n## SURFACING INFORMATION\n\n### Categorization\n\nAI is all about using data to make judgments or find patterns. In the case of categorization, AI creates a series of mathematical relationships to map the relative similarities and differences of similar objects. This kind of labeling is useful for all kinds of businesses.\n\nConsider these examples:\n\n* Quality assurance inspectors determine if a product is defective.\n* Doctors determine if a patient’s bloodwork means they are healthy.\n* Mortgage lenders determine if an applicant is highly qualified.\n* Grocery stores determine if their produce is starting to rot.\n* Marketers identify conversion-optimized landing pages.\n* Programmers locate broken code.\n\nWith enough examples, an AI model could be trained to support the labeling/categorization process of any of these use cases.\n\n### Pattern Recognition\n\nWe can think of pattern recognition as a much more complex version of categorization. Whereas categorization usually considers one set of inputs, pattern recognition can consider an almost limitless number.\n\nIt’s this type of AI capability that enables credit card companies to detect fraud, retail organizations to elastically price items, and self-driving cars to make instant driving decisions.\n\nWhen imagining how to bring pattern recognition capabilities to your organization, think in terms of the systems or processes you have in place to make decisions.\n\n### Predictive Analytics\n\nWith the right data, artificial intelligence is capable of making all kinds of predictions from heart attacks to stock market fluctuations to hurricanes. Very few companies are tapping into this future-facing capability and those that do tend to be primarily focused on tactical use cases like predictive maintenance.\n\nHowever, having visibility of future events means that business leaders have the tools they need to make adjustments to their supply chain, their strategy, and the execution of their objectives.\n\nWith the right data, you can answer almost any question about the future. The oracle is real.\n\n### Personalization\n\nToday AI-driven recommendation engines power your Netflix queue, your Amazon home screen, your Google search results, and your Spotify playlist. Every single time you read or click-through (or click away) these companies are gathering information about your interests and your preferences.\n\nIn fact, it is a similar engine that is driving much of the advertising across the internet. You know that feeling you sometimes get that Facebook is listening to you? The reason this may feel so is that their predictive engines are so powerful they’ve mapped a veritable galaxy of data points to identify things that they should try to sell to you.\n\nPersonalization offers companies the opportunity to have perfect product-market alignment. By being able to offer each of your customers something a little different, you ensure that the products and services you offer resonate in an unforgettable way.\n\n## CREATING CONTENT\n\nIn a broad sense, all of the inputs we discussed above can also become outputs for an AI model so let’s take them one at a time. For example:\n\n### Written or Spoken Communication\n\nAI can generate all kinds of language as outputs, such as articles, summaries, labels, etc. We’re not just talking printed text here. As Amazon Alexa has shown, AI-generated communication can also be piped to voice-activated assistants.  \nIn the case of articles, AI has taken all sorts of information to auto-generate articles. Publishers are using the capability to automatically write weather reports, sports stories, and updates on financial markets.\n\nText summarization is particularly powerful and can be a huge opportunity for your organization. AI can literally take a 2,000-page patient case file, extract the necessary information, and summarize it into a paragraph or two. A use case might be a law firm that converts boxes of handwritten evidence into an index of every item that’s there.\n\n### MULTIMEDIA\n\nAlready AI is generating a wealth of visual or auditory content. Artificial intelligence has been used to generate images of human faces, color black and white photos, write music, and create soundscapes, produce charts and graphs.\n\n# Translating Inputs and Outputs\n\nAs a final note, keep in mind that AI models become crazy powerful when you use them to translate one input type into a different output type. For example, an AI model could be trained to convert drone footage of a disaster area into a 12-page summary report for FEMA.\n\nTo be sure, building such a model would be complex, requiring both image processing layers to determine damage and text summarization layers to write that damage into easy-to-understand paragraphs — however, it is this exact type of complexity you should be thinking about when imaging the kinds of AI solutions to bring to your company.\n\nRemember: artificial intelligence can transform information into almost anything!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\n\n*This chapter is an excerpt from the ebook, The Complete Guide to Bringing Artificial Intelligence to your Organization.* [*Access the full guide here.*](https://www.manceps.com/ai-guide?utm_source=Reddit&amp;utm_medium=Post&amp;utm_campaign=Everything%20You%20Need%20to%20Understand%20Artificial%20Intelligence)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/i3o62s/the_alchemy_of_ai_transforming_inputs_into_insight/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the alchemy of ai: transforming inputs into insight. /!/ we've all heard the buzzwords about ai. but very few people outside of this sub can really define what artificial intelligence is or why it's useful.\n\nfor us, we think of artificial intelligence as a -----> tool !!!  that allows you to intuitively discover the relationship between inputs and outputs. what goes into an ai model can be translated, converted, and put to work via a variety of methodologies. \n\nfor example, an input may be drone footage of a disaster area (photo) and its output could be a damage estimate (financial).\n\nin this guide, we’ll explore all of the different kinds of inputs and outputs you can work with to build ai solutions.\n\nwhen combined with your existing data, these possibilities can give you the building blocks you need to string together a powerful ai capability for your organization.\n\nif you've ever wondered what your company can do with its data, then this will definitely get your wheels turning.\n\n# think about ai as inputs and outputs\n\nso now that we've explored how ai is a tool for finding the relationship between inputs in outputs, let's define what some of those major inputs and outputs can be. \n\n# inputs\n\n# semantic data\n\nby now, ai is super-human in its ability to understand and process language. this is obviously super useful because a huge part of the world’s information is one kind of communication or another. we’re talking documents, books, handwriting, articles, speech, etc. \n\nnatural language processing (nlp) models think about language in terms of each word’s relationship to related words. we can think of nlp models as a vast 3-d word cloud where related words cluster together forming vectors of associations and understanding. in effect, language processing models convert language into mathematical relationships.\n\nalthough this may sound a bit abstract, our brains actually process language in a similar way. consider this sentence:  \n*the dove dove into the water.*\n\nmost of us can pretty easily intuit from the sentence structure that the first *dove* is the noun and the second *dove* is an action related to water.\n\nlanguages like german, chinese, and korean drop these associations right into their vocabulary. for example, in german, *kindergarten* literally means *child garden*. in korean, the word for *fish* (물고기) is a compound of *water* (물) and *meat* (고기).\n\nall of this is to say that by quantifying the relationships words have to other words, ai language models have gotten extremely adept at learning to read, write, translate and summarize with ease.\n\n## quantitative data\n\nai models are built on complex mathematical equations so it shouldn’t surprise you that ai speaks the language of numbers. ai models can vacuum up all sorts of quantitative data such as statistics, analytics, dates, sequences, financial information, etc.\n\n## multimedia\n\nwhereas semantic and quantitative data uses abstract concepts as inputs, multimedia data is much more concrete. when considering what multimedia data you might be able to use, think about your senses:\n\n* visual data can include photography, video, satellite footage, video surveillance\n* auditory data such as sound recordings or radar.\n* sensory data such as temperature or lidar.\n\nhell, if you’ve got an [electronic nose](https://en.wikipedia.org/wiki/electronic_nose?utm_medium=email&amp;_hsmi=2&amp;_hsenc=p2anqtz-95oouxjgqzht7-gryknbklkgv4mg9nb3gdfy3vyd2xvay0wsgy4oe5hrmpwmq8-_mox7y7xtptcnsr2cai0_qurmeexq&amp;utm_content=2&amp;utm_source=hs_email), you could even consider olfactory information. \n\nby the way: data scientists can build ai models that consider datasets from all of these categories at once. for example, you could build a healthcare diagnostic model by integrating a doctor’s description of the patient’s symptoms (semantic), their bloodwork (quantitative), and chest xrays (multimedia).\n\n# outputs\n\nas we discussed in [chapter 1](https://www.manceps.com/resources/complete-ai-guide/chapter-1-what-is-artificial-intelligence), ai models build intuition about the relationship between inputs and outputs. to better understand how your organization could put ai to work, you’ve got to consider both. broadly speaking, ai can be used to do two main things: surface information or create content.\n\nsurfacing information includes things like categorization, pattern recognition, and prediction. these outputs can then be piped into systems that either (a) deliver this essential information to stakeholders for better decision-making and/or (b) put this information to work via some kind of hardware or software.\n\nfor example, an ai model that surfaces a stock prediction could be put into production as a daily email that arrives in your inbox or as an app that will automatically conduct trades for you.\n\nalternately, ais can be used to create content. in a broad sense, the types of content that cognitive intelligence can create is similar to the inputs that ai can consider. for example, ais can produce both articles and images of all kinds of crazy iterations, as we’ll discuss below.\n\nlet’s consider each of these outputs in more detail:\n\n## surfacing information\n\n### categorization\n\nai is all about using data to make judgments or find patterns. in the case of categorization, ai creates a series of mathematical relationships to map the relative similarities and differences of similar objects. this kind of labeling is useful for all kinds of businesses.\n\nconsider these examples:\n\n* quality assurance inspectors determine if a product is defective.\n* doctors determine if a patient’s bloodwork means they are healthy.\n* mortgage lenders determine if an applicant is highly qualified.\n* grocery stores determine if their produce is starting to rot.\n* marketers identify conversion-optimized landing pages.\n* programmers locate broken code.\n\nwith enough examples, an ai model could be trained to support the labeling/categorization process of any of these use cases.\n\n### pattern recognition\n\nwe can think of pattern recognition as a much more complex version of categorization. whereas categorization usually considers one set of inputs, pattern recognition can consider an almost limitless number.\n\nit’s this type of ai capability that enables credit card companies to detect fraud, retail organizations to elastically price items, and self-driving cars to make instant driving decisions.\n\nwhen imagining how to bring pattern recognition capabilities to your organization, think in terms of the systems or processes you have in place to make decisions.\n\n### predictive analytics\n\nwith the right data, artificial intelligence is capable of making all kinds of predictions from heart attacks to stock market fluctuations to hurricanes. very few companies are tapping into this future-facing capability and those that do tend to be primarily focused on tactical use cases like predictive maintenance.\n\nhowever, having visibility of future events means that business leaders have the tools they need to make adjustments to their supply chain, their strategy, and the execution of their objectives.\n\nwith the right data, you can answer almost any question about the future. the oracle is real.\n\n### personalization\n\ntoday ai-driven recommendation engines power your netflix queue, your amazon home screen, your google search results, and your spotify playlist. every single time you read or click-through (or click away) these companies are gathering information about your interests and your preferences.\n\nin fact, it is a similar engine that is driving much of the advertising across the internet. you know that feeling you sometimes get that facebook is listening to you? the reason this may feel so is that their predictive engines are so powerful they’ve mapped a veritable galaxy of data points to identify things that they should try to sell to you.\n\npersonalization offers companies the opportunity to have perfect product-market alignment. by being able to offer each of your customers something a little different, you ensure that the products and services you offer resonate in an unforgettable way.\n\n## creating content\n\nin a broad sense, all of the inputs we discussed above can also become outputs for an ai model so let’s take them one at a time. for example:\n\n### written or spoken communication\n\nai can generate all kinds of language as outputs, such as articles, summaries, labels, etc. we’re not just talking printed text here. as amazon alexa has shown, ai-generated communication can also be piped to voice-activated assistants.  \nin the case of articles, ai has taken all sorts of information to auto-generate articles. publishers are using the capability to automatically write weather reports, sports stories, and updates on financial markets.\n\ntext summarization is particularly powerful and can be a huge opportunity for your organization. ai can literally take a 2,000-page patient case file, extract the necessary information, and summarize it into a paragraph or two. a use case might be a law firm that converts boxes of handwritten evidence into an index of every item that’s there.\n\n### multimedia\n\nalready ai is generating a wealth of visual or auditory content. artificial intelligence has been used to generate images of human faces, color black and white photos, write music, and create soundscapes, produce charts and graphs.\n\n# translating inputs and outputs\n\nas a final note, keep in mind that ai models become crazy powerful when you use them to translate one input type into a different output type. for example, an ai model could be trained to convert drone footage of a disaster area into a 12-page summary report for fema.\n\nto be sure, building such a model would be complex, requiring both image processing layers to determine damage and text summarization layers to write that damage into easy-to-understand paragraphs — however, it is this exact type of complexity you should be thinking about when imaging the kinds of ai solutions to bring to your company.\n\nremember: artificial intelligence can transform information into almost anything!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\n\n*this chapter is an excerpt from the ebook, the complete guide to bringing artificial intelligence to your organization.* [*access the full guide here.*](https://www.manceps.com/ai-guide?utm_source=reddit&amp;utm_medium=post&amp;utm_campaign=everything%20you%20need%20to%20understand%20artificial%20intelligence)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/i3o62s/the_alchemy_of_ai_transforming_inputs_into_insight/',)", "identifyer": 5599534, "year": "2020"}, {"autor": "EspressoInsight", "date": 1606116164000, "content": "Nvidia's ai paint tool in beta /!/ Nvidia's AI playground has this tool where you can create photo-realistic drawings by just making a few keystrokes on a digital paint pad.\n\nMore here - [http://espressoinsight.com/2020/11/22/ai-art/](http://espressoinsight.com/2020/11/22/ai-art/) \\- but ultimately, I've heard about someone at Stanford selling another art-based AI tool that essentially created renderings of art using AI / ML but that took famous artwork as inputs / training data. \n\nThis of course is a little different, as you'll notice most of what the GauGAN tool was probably trained on was scenery photos of nature etc.\n\nCould be used by game developers, graphic designers, maybe? What do you all think?\n\nBelieve it or not its actually kind of fun to try", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jzd4wb/nvidias_ai_paint_tool_in_beta/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "nvidia's ai paint -----> tool !!!  in beta /!/ nvidia's ai playground has this tool where you can create photo-realistic drawings by just making a few keystrokes on a digital paint pad.\n\nmore here - [http://espressoinsight.com/2020/11/22/ai-art/](http://espressoinsight.com/2020/11/22/ai-art/) \\- but ultimately, i've heard about someone at stanford selling another art-based ai tool that essentially created renderings of art using ai / ml but that took famous artwork as inputs / training data. \n\nthis of course is a little different, as you'll notice most of what the gaugan tool was probably trained on was scenery photos of nature etc.\n\ncould be used by game developers, graphic designers, maybe? what do you all think?\n\nbelieve it or not its actually kind of fun to try", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jzd4wb/nvidias_ai_paint_tool_in_beta/',)", "identifyer": 5599598, "year": "2020"}, {"autor": "theworldreviews", "date": 1605876093000, "content": "Artificial Intelligence – the new player influencing India’s geopolitics /!/  We are living in an era of global internet and intelligence and data sharing, that is potentially changing how the world functions. Post-Cold War, the global powers moved intentionally from traditional military focus and rivalry to gaining economic competency and growth. That was the time when the geopolitical standing of any nation was governed by its physical resources like oil. This remained the determining criteria of a country’s global standing for a long time until past decade that witnessed emergence of artificial intelligence as the new geopolitical tool. \n\nArtificial Intelligence is a magnificent tool that can improve agricultural yield, predict weather, forecast disease patterns and help control them, and also manage supply chain convolutions for essentialities of any nation like drugs, food and other basic products. The extent to which any country invests in its artificial intelligence impacts its global as well as regional footing. \n\nRecent years have seen AI and technology play a key role in framing strategic relationships and allies, along with diplomatic standing. India, as an emerging player in Asia and a global leader, too has been in great influence through AI as a key participant in the Quad strategic forum along with USA, Japan and Australia. This alliance is standing strong to counter the aggressive influence of China in Asia-Pacific region, as the Quad members have taken major technological and AI related initiatives. \n\nThis year in October India entered an agreement with Japan regarding sharing and co-operation for AI along with other strategic fronts.  \n\nUnited States is eyeing India as a strong ally in the region, standing opposite the common opponent China, while encouraging collaboration around technology and artificial intelligence as the focal point to create US-India Strategic Tech Alliance (UISTA). \n\nIn June, India joined GPAI (Global Partnership for AI) as one of the founding members, along with other Quad nations. The alliance stands against China to counter its growth in technology. India as a member becomes a major geopolitical player in the region. \n\nIndia has an added advantage, that China lacks, placing it at a strong position – democracy and functioning constitution. These added gems with India can influence its AI policy, thereby influencing its role in GPAI and Quad and strengthening its establishment. \n\nIndia is actively making allies and forging new relationships through AI collaborations, something that is bound to benefit it in future. The current leadership ensures of putting nation’s strategic interest at a priority and thereby projecting it as a strong player in region and world. Furthermore, these collaborations are bound to ensure equitable outcomes to all participants, something which is important to seal allies. ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jxobwh/artificial_intelligence_the_new_player/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence – the new player influencing india’s geopolitics /!/  we are living in an era of global internet and intelligence and data sharing, that is potentially changing how the world functions. post-cold war, the global powers moved intentionally from traditional military focus and rivalry to gaining economic competency and growth. that was the time when the geopolitical standing of any nation was governed by its physical resources like oil. this remained the determining criteria of a country’s global standing for a long time until past decade that witnessed emergence of artificial intelligence as the new geopolitical -----> tool !!! . \n\nartificial intelligence is a magnificent tool that can improve agricultural yield, predict weather, forecast disease patterns and help control them, and also manage supply chain convolutions for essentialities of any nation like drugs, food and other basic products. the extent to which any country invests in its artificial intelligence impacts its global as well as regional footing. \n\nrecent years have seen ai and technology play a key role in framing strategic relationships and allies, along with diplomatic standing. india, as an emerging player in asia and a global leader, too has been in great influence through ai as a key participant in the quad strategic forum along with usa, japan and australia. this alliance is standing strong to counter the aggressive influence of china in asia-pacific region, as the quad members have taken major technological and ai related initiatives. \n\nthis year in october india entered an agreement with japan regarding sharing and co-operation for ai along with other strategic fronts.  \n\nunited states is eyeing india as a strong ally in the region, standing opposite the common opponent china, while encouraging collaboration around technology and artificial intelligence as the focal point to create us-india strategic tech alliance (uista). \n\nin june, india joined gpai (global partnership for ai) as one of the founding members, along with other quad nations. the alliance stands against china to counter its growth in technology. india as a member becomes a major geopolitical player in the region. \n\nindia has an added advantage, that china lacks, placing it at a strong position – democracy and functioning constitution. these added gems with india can influence its ai policy, thereby influencing its role in gpai and quad and strengthening its establishment. \n\nindia is actively making allies and forging new relationships through ai collaborations, something that is bound to benefit it in future. the current leadership ensures of putting nation’s strategic interest at a priority and thereby projecting it as a strong player in region and world. furthermore, these collaborations are bound to ensure equitable outcomes to all participants, something which is important to seal allies. ", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jxobwh/artificial_intelligence_the_new_player/',)", "identifyer": 5599673, "year": "2020"}, {"autor": "OnlyProggingForFun", "date": 1605870870000, "content": "This AI was Made For Artists! Create Fantastical Creatures From a Quick Draft - Chimera Painter by Google (Demo Tool already Available for free)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jxn8nx/this_ai_was_made_for_artists_create_fantastical/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "this ai was made for artists! create fantastical creatures from a quick draft - chimera painter by google (demo -----> tool !!!  already available for free)", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 2, "media": "('rich:video',)", "medialink": "('https://youtu.be/6zbVlf7n1zY',)", "identifyer": 5599675, "year": "2020"}, {"autor": "sameelhayat", "date": 1609068432000, "content": "AI Tool - League Fixtures /!/ Hello All,\n\nI am looking for an AI tool to help create complex league fixtures? Please recommend any tool or if anyone is developing and wants to test it, please get in touch. \n\n&amp;#x200B;\n\nTIA,\n\nSameel", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kl24yq/ai_tool_league_fixtures/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai -----> tool !!!  - league fixtures /!/ hello all,\n\ni am looking for an ai tool to help create complex league fixtures? please recommend any tool or if anyone is developing and wants to test it, please get in touch. \n\n&amp;#x200b;\n\ntia,\n\nsameel", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/kl24yq/ai_tool_league_fixtures/',)", "identifyer": 5599728, "year": "2020"}, {"autor": "hackernoon", "date": 1602992291000, "content": "Build your Dataset from COCO with the Universal Data Tool", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jd98yp/build_your_dataset_from_coco_with_the_universal/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "build your dataset from coco with the universal data -----> tool !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hackernoon.com/build-your-dataset-from-coco-with-the-universal-data-tool-24213wgq?source=rss',)", "identifyer": 5599786, "year": "2020"}, {"autor": "franco-melanieh", "date": 1602852002000, "content": "AI Generated Ad-Creatives for Socialmedia-Ads /!/ Hey Guys,\n\nso i recently stumbled upon the latest techdemos using openAI's GTP3 Language Model.\n\nAnd i had a quick thought experiment about using this systems to build a tool that lets marketeers evaluete their ad creatives (text, image and CTA) and give them a hint on how it will resonade with the target audience. Mediabuyers wont have to waste as mutch money on testing then perhabs!\n\nThe next step would be a system that can generate those creatives with little inputs about target audience and core components of the business.\n\nThat do you think about this?  \nWill it be possible / is this allready in development ?\n\nThank you and greetings from germany.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jc928e/ai_generated_adcreatives_for_socialmediaads/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai generated ad-creatives for socialmedia-ads /!/ hey guys,\n\nso i recently stumbled upon the latest techdemos using openai's gtp3 language model.\n\nand i had a quick thought experiment about using this systems to build a -----> tool !!!  that lets marketeers evaluete their ad creatives (text, image and cta) and give them a hint on how it will resonade with the target audience. mediabuyers wont have to waste as mutch money on testing then perhabs!\n\nthe next step would be a system that can generate those creatives with little inputs about target audience and core components of the business.\n\nthat do you think about this?  \nwill it be possible / is this allready in development ?\n\nthank you and greetings from germany.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jc928e/ai_generated_adcreatives_for_socialmediaads/',)", "identifyer": 5599822, "year": "2020"}, {"autor": "DQLabsinc", "date": 1602830140000, "content": "Introduction to DQLabs AI Augmented Data Quality Platform /!/ DQLabs is an AI Augmented Data Quality platform that provides a simple way for organizations to handle issues around data quality, curation, ingestion and governance effectively. With the use of AI/ML, the decision is made possible in all aspects of data management and provides organizations a smarter way to manage data. DQLabs gives organizations the ability to manage data smarter and leverage an [immediate ROI in weeks, rather than months](https://www.dqlabs.ai/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=introduction-to-dqlabs).\n\nThe platform has all the inbuilt features to make autonomous execution without any manual or configuration. With this AI and ML-powered tool, scalability, governance, and automation from end to end are possible. It also provides easy integration and compatibility with other tools in the data ecosystem. With the use of AI and Machine Learning, the decision is made possible in all aspects of data management. No more ETL, workflows, and rules – leverage the new world of AI decisioning in data management as the platform learns and reconfigures rules automatically as business strategy shifts and demands new data patterns, trends.\n\n&amp;#x200B;\n\n**Why DQLabs:**  \n \n\n**- Decade of Data Experience**\n\nOur company was founded with a focus on data. We have a decade of experience in providing data related solutions to fortune 100 clients around data integration, data governance, data analytics, data visualization and data science-related solutions.\n\n##### - Focus on all three: People, Process and Technology\n\n##### Any business outcomes are not met with just Technology but we see all three elements play a critical role – People, Process and Technology. All our products and solutions delivered has a focus on usability and simplicity built using proven technologies.\n\n **- Immediate ROI and Value**\n\nWe focus on delivering quicker business outcomes, improved customer experiences, reduced friction within the organization and more flexibility using a product-centric business model and proven data science and AI methodologies.\n\n **- Onboard in any existing ecosystem**  \nOnboard with minimal skills in any existing ecosystem and leverage business-centric capabilities and use cases at ease. \n\n **-** **Manage data effectively with self-service capabilities**  \nLet DQLabs manage your data and provide the ability to pinpoint the root cause of quality issues to the source with self-service capabilities.\n\n[Increase Revenue by discovering trustable data in minutes](https://www.dqlabs.ai/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=introduction-to-dqlabs)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jc4vxv/introduction_to_dqlabs_ai_augmented_data_quality/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "introduction to dqlabs ai augmented data quality platform /!/ dqlabs is an ai augmented data quality platform that provides a simple way for organizations to handle issues around data quality, curation, ingestion and governance effectively. with the use of ai/ml, the decision is made possible in all aspects of data management and provides organizations a smarter way to manage data. dqlabs gives organizations the ability to manage data smarter and leverage an [immediate roi in weeks, rather than months](https://www.dqlabs.ai/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=introduction-to-dqlabs).\n\nthe platform has all the inbuilt features to make autonomous execution without any manual or configuration. with this ai and ml-powered -----> tool !!! , scalability, governance, and automation from end to end are possible. it also provides easy integration and compatibility with other tools in the data ecosystem. with the use of ai and machine learning, the decision is made possible in all aspects of data management. no more etl, workflows, and rules – leverage the new world of ai decisioning in data management as the platform learns and reconfigures rules automatically as business strategy shifts and demands new data patterns, trends.\n\n&amp;#x200b;\n\n**why dqlabs:**  \n \n\n**- decade of data experience**\n\nour company was founded with a focus on data. we have a decade of experience in providing data related solutions to fortune 100 clients around data integration, data governance, data analytics, data visualization and data science-related solutions.\n\n##### - focus on all three: people, process and technology\n\n##### any business outcomes are not met with just technology but we see all three elements play a critical role – people, process and technology. all our products and solutions delivered has a focus on usability and simplicity built using proven technologies.\n\n **- immediate roi and value**\n\nwe focus on delivering quicker business outcomes, improved customer experiences, reduced friction within the organization and more flexibility using a product-centric business model and proven data science and ai methodologies.\n\n **- onboard in any existing ecosystem**  \nonboard with minimal skills in any existing ecosystem and leverage business-centric capabilities and use cases at ease. \n\n **-** **manage data effectively with self-service capabilities**  \nlet dqlabs manage your data and provide the ability to pinpoint the root cause of quality issues to the source with self-service capabilities.\n\n[increase revenue by discovering trustable data in minutes](https://www.dqlabs.ai/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=introduction-to-dqlabs)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jc4vxv/introduction_to_dqlabs_ai_augmented_data_quality/',)", "identifyer": 5599835, "year": "2020"}, {"autor": "sab2098", "date": 1586291098000, "content": "A revolutionary tool to help people to build financial stability during covid-19 /!/ Hey guys! I know it’s a very difficult time for a lot of folks around the world during this pandemic! And people are either getting laid off, or don’t even have enough money to last them for the next coming months as the pandemic continues.  So I’m here to let you guys know I have learned of an artificial intelligence product that helps with making money on your behalf 24/5 as long the market is open. (I am not selling anything btw) I am just here to spread the word as I have used it and just wanted to tell the masses! You can feel free to reach out to me.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/fwryu6/a_revolutionary_tool_to_help_people_to_build/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a revolutionary -----> tool !!!  to help people to build financial stability during covid-19 /!/ hey guys! i know it’s a very difficult time for a lot of folks around the world during this pandemic! and people are either getting laid off, or don’t even have enough money to last them for the next coming months as the pandemic continues.  so i’m here to let you guys know i have learned of an artificial intelligence product that helps with making money on your behalf 24/5 as long the market is open. (i am not selling anything btw) i am just here to spread the word as i have used it and just wanted to tell the masses! you can feel free to reach out to me.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/fwryu6/a_revolutionary_tool_to_help_people_to_build/',)", "identifyer": 5599963, "year": "2020"}, {"autor": "kajri", "date": 1588593955000, "content": "To contribute to the fight against the deadly COVID-19 outbreak, an industrial Artificial Intelligence company, Landing AI has created a tool that can detect the social distance between people by analyzing real-time video streaming from the camera.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gdadnx/to_contribute_to_the_fight_against_the_deadly/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "to contribute to the fight against the deadly covid-19 outbreak, an industrial artificial intelligence company, landing ai has created a -----> tool !!!  that can detect the social distance between people by analyzing real-time video streaming from the camera.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://v.redd.it/ly5xeauvnqw41',)", "identifyer": 5599994, "year": "2020"}, {"autor": "tgold27", "date": 1588511040000, "content": "How will Artificial Intelligence impact the future of jobs? Focus on supply chain. /!/ This weeks blog post will have a specific focus on the supply chain industry, and how AI intends to compliment as well as improve the industries work.\n\nThere have been warnings, fears and presumptions over the past two centuries which highlight the underlying worry that automation will overtake majority of middle class jobs. [Peter Hogg](https://www.emerald.com/insight/content/doi/10.1108/SHR-11-2018-0094/full/html) proposes the understanding that the implementation of AI is rising in the workplace, and through this implementation many people believe their jobs will become obsolete.\n\n*Well, I’m here to tell you otherwise.* \n\nIt prevails that AI will compliment the future of our jobs and become more successful when carried out alongside human work. As stated in my previous post, humans are able to work alongside AI to ensure collaborative work can occur. According to ‘[Are Robots Taking Our Jobs?](https://www.accenture.com/t00010101t000000z__w__/_acnmedia/pdf-84/accenture-collaborative-intelligence-2018.pdf)‘ by James Wilson and Paul Daugherty, “the total amount of work available had not decreased after the introduction of computer-based technologies”(Daugherty &amp;  Wilson 2018). They recall five principals that can help them become more collaborative when working alongside the technology, including:\n\n* Reimagine business processes;\n* Embrace experimentation/employee involvement;\n* Actively direct AI strategy;\n* Responsibly collect data and\n* redesign work to incorporate AI and cultivate related employee skills.\n\nA survey carried out with 1,075 companies in 12 varying industries industries showed “that the more of these principles companies adopted, the better their AI initiatives performed in terms of speed, cost savings, revenues, or other operational measures” (Wilson &amp; Daugherty 2018).\n\nMoving forward with these ideas in mind, it was of my upmost interest to uncover if employees are concerned about and more importantly, what level of understanding they have of the topic. From here I endeavoured to have them have a positive outlook on the introduction of AI. This was achieved through an interview with a supply chain employee from a medical manufacturing company, with asking the following [questions](http://%28https//docs.google.com/document/d/19o4dlqrqpQpI9ea6jXVVFVtac_N4g_Z750lzuxo39kw/edit)).\n\n* *WHAT DO YOU KNOW ABOUT AI?*\n* *From what I have read AI isn’t here just yet, not in the traditional sense of a sentient being locked inside a computer…The end goal of current AI is to have you stay on their site for longer or spend more money.* \n* *WHAT ASPECTS OF YOUR JOB CAN BE IMPROVED BY AI?*\n* *There are three main elements to my job – planning, system maintenance and communicating to sales. The biggest improvement AI could bring would be in the planning space…As a human, I make errors and can miss flags indicating I should increase or decrease stock levels. I imagine an intelligent AI could perform this task with ease, removing the human error and increasing service levels to customers.*\n* *HOW IS AI INCORPORATED INTO YOUR JOB?*\n* *Currently, it isn’t. We have low level planning systems that require human intervention. As with anything that requires human intervention, it is prone to mistakes and therefore can be improved.* \n* *WHAT IMPACT DO YOU THINK AI WILL HAVE ON YOUR JOB/OVERALL COMPANY?*\n* *An intelligent planning system (perhaps controlled by AI) could theoretically manage inventory globally without intervention by others. This would mean that all inventory planning positions in the world, as well as manufacturing planning could be made more efficient or removed…I imagine that the future of supply chain will see people working with AI to assist it, rather than programs assisting them in their job.*\n* *IN THE LONG TERM, WHERE DO YOU THINK WE WILL BE IN REGARD TO IMPLEMENTING AI INTO SOCIETY/WORKFORCE?*\n\n*I think the sci-fi version of AI is still a way off. I think that implementation of AI could improve efficiencies in some companies by reducing human error (and by reducing the number of humans)…Nick Bostrom titled ‘Superintelligence’ asks concerning questions about the introduction of AI and highlights that if the correct steps aren’t taken, the implementation of such technology might not be as beneficial as we’re led to believe.*\n\nThrough the employees answers it is vital that supply chain workers are scared about the security of their jobs. This interview was provided to set the idea of how little awareness some employees have about AI and how some of their fears could be seen as irrational, once they have looked at AI in the correct light.\n\n*Thus, this blog post is to work as a tool of education for these employees, rather than another old blogpost.*\n\nWilson and Daugherty outline ways that companies are able to get the most value from AI, and their conclusion was that operations are to be redesigned. For this to be successful, companies who are adopting the technology are to define an operation area that is able to be improved and then AI will be able to be implemented into that are of the workplace. Furthermore, companies must develop a solution through co-creation. Which will see CEOs and employees envision how they will collaborate with the technology to improve a variety of processes that are already carried out within the business, of  supply chain.\n\n*So how exactly are A.I. and robotics impacting Supply Chain?*  \n\n* Recent [research](https://www.mckinsey.com/featured-insights/artificial-intelligence/global-ai-survey-ai-proves-its-worth-but-few-scale-impact) out of McKinsey finds 61% of executives report decreased costs and 53% report increased revenues as a direct result of introducing artificial intelligence into their supply chains.\n* Robotics are being used to track and locate inventory within the warehouse to ensure supply chain work is completed more efficiently and helps the robots make autonomous decisions regarding the different processes that are performed in the warehouse.\n* AI provides the supply chain with contextual intelligence which can be used to reduce the operating costs and manage inventory.\n\nOverall, it is evident that AI can have a positive impact on the supply chain workplace when implemented in the correct way, as these companies see the biggest growth when humans and smart machines collaborate. Moving forward it is important ask, when will this AI be implemented and furthermore when will *we* be train to better comprehend these bots.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gcq913/how_will_artificial_intelligence_impact_the/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how will artificial intelligence impact the future of jobs? focus on supply chain. /!/ this weeks blog post will have a specific focus on the supply chain industry, and how ai intends to compliment as well as improve the industries work.\n\nthere have been warnings, fears and presumptions over the past two centuries which highlight the underlying worry that automation will overtake majority of middle class jobs. [peter hogg](https://www.emerald.com/insight/content/doi/10.1108/shr-11-2018-0094/full/html) proposes the understanding that the implementation of ai is rising in the workplace, and through this implementation many people believe their jobs will become obsolete.\n\n*well, i’m here to tell you otherwise.* \n\nit prevails that ai will compliment the future of our jobs and become more successful when carried out alongside human work. as stated in my previous post, humans are able to work alongside ai to ensure collaborative work can occur. according to ‘[are robots taking our jobs?](https://www.accenture.com/t00010101t000000z__w__/_acnmedia/pdf-84/accenture-collaborative-intelligence-2018.pdf)‘ by james wilson and paul daugherty, “the total amount of work available had not decreased after the introduction of computer-based technologies”(daugherty &amp;  wilson 2018). they recall five principals that can help them become more collaborative when working alongside the technology, including:\n\n* reimagine business processes;\n* embrace experimentation/employee involvement;\n* actively direct ai strategy;\n* responsibly collect data and\n* redesign work to incorporate ai and cultivate related employee skills.\n\na survey carried out with 1,075 companies in 12 varying industries industries showed “that the more of these principles companies adopted, the better their ai initiatives performed in terms of speed, cost savings, revenues, or other operational measures” (wilson &amp; daugherty 2018).\n\nmoving forward with these ideas in mind, it was of my upmost interest to uncover if employees are concerned about and more importantly, what level of understanding they have of the topic. from here i endeavoured to have them have a positive outlook on the introduction of ai. this was achieved through an interview with a supply chain employee from a medical manufacturing company, with asking the following [questions](http://%28https//docs.google.com/document/d/19o4dlqrqpqpi9ea6jxvvfvtac_n4g_z750lzuxo39kw/edit)).\n\n* *what do you know about ai?*\n* *from what i have read ai isn’t here just yet, not in the traditional sense of a sentient being locked inside a computer…the end goal of current ai is to have you stay on their site for longer or spend more money.* \n* *what aspects of your job can be improved by ai?*\n* *there are three main elements to my job – planning, system maintenance and communicating to sales. the biggest improvement ai could bring would be in the planning space…as a human, i make errors and can miss flags indicating i should increase or decrease stock levels. i imagine an intelligent ai could perform this task with ease, removing the human error and increasing service levels to customers.*\n* *how is ai incorporated into your job?*\n* *currently, it isn’t. we have low level planning systems that require human intervention. as with anything that requires human intervention, it is prone to mistakes and therefore can be improved.* \n* *what impact do you think ai will have on your job/overall company?*\n* *an intelligent planning system (perhaps controlled by ai) could theoretically manage inventory globally without intervention by others. this would mean that all inventory planning positions in the world, as well as manufacturing planning could be made more efficient or removed…i imagine that the future of supply chain will see people working with ai to assist it, rather than programs assisting them in their job.*\n* *in the long term, where do you think we will be in regard to implementing ai into society/workforce?*\n\n*i think the sci-fi version of ai is still a way off. i think that implementation of ai could improve efficiencies in some companies by reducing human error (and by reducing the number of humans)…nick bostrom titled ‘superintelligence’ asks concerning questions about the introduction of ai and highlights that if the correct steps aren’t taken, the implementation of such technology might not be as beneficial as we’re led to believe.*\n\nthrough the employees answers it is vital that supply chain workers are scared about the security of their jobs. this interview was provided to set the idea of how little awareness some employees have about ai and how some of their fears could be seen as irrational, once they have looked at ai in the correct light.\n\n*thus, this blog post is to work as a -----> tool !!!  of education for these employees, rather than another old blogpost.*\n\nwilson and daugherty outline ways that companies are able to get the most value from ai, and their conclusion was that operations are to be redesigned. for this to be successful, companies who are adopting the technology are to define an operation area that is able to be improved and then ai will be able to be implemented into that are of the workplace. furthermore, companies must develop a solution through co-creation. which will see ceos and employees envision how they will collaborate with the technology to improve a variety of processes that are already carried out within the business, of  supply chain.\n\n*so how exactly are a.i. and robotics impacting supply chain?*  \n\n* recent [research](https://www.mckinsey.com/featured-insights/artificial-intelligence/global-ai-survey-ai-proves-its-worth-but-few-scale-impact) out of mckinsey finds 61% of executives report decreased costs and 53% report increased revenues as a direct result of introducing artificial intelligence into their supply chains.\n* robotics are being used to track and locate inventory within the warehouse to ensure supply chain work is completed more efficiently and helps the robots make autonomous decisions regarding the different processes that are performed in the warehouse.\n* ai provides the supply chain with contextual intelligence which can be used to reduce the operating costs and manage inventory.\n\noverall, it is evident that ai can have a positive impact on the supply chain workplace when implemented in the correct way, as these companies see the biggest growth when humans and smart machines collaborate. moving forward it is important ask, when will this ai be implemented and furthermore when will *we* be train to better comprehend these bots.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gcq913/how_will_artificial_intelligence_impact_the/',)", "identifyer": 5600008, "year": "2020"}, {"autor": "themaxi4", "date": 1594934879000, "content": "Dont know if right subreddit - need to find recurring number pattern in a row of numbers, does anyone here know a tool for this?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hsisvi/dont_know_if_right_subreddit_need_to_find/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "dont know if right subreddit - need to find recurring number pattern in a row of numbers, does anyone here know a -----> tool !!!  for this?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hsisvi/dont_know_if_right_subreddit_need_to_find/',)", "identifyer": 5600515, "year": "2020"}, {"autor": "svij137", "date": 1594856831000, "content": "Easiest way to make a deepfake? /!/ Hi,\n\n&amp;#x200B;\n\nI am new here and got this naive looking question. \n\nIs there a tool that can generate high quality deepfakes without much coding requirements?\n\nI got a cool pair of GPU's with tremendous power that i want to use for this purpose but don't know where to start.\n\n&amp;#x200B;\n\nRegards", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hryys4/easiest_way_to_make_a_deepfake/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "easiest way to make a deepfake? /!/ hi,\n\n&amp;#x200b;\n\ni am new here and got this naive looking question. \n\nis there a -----> tool !!!  that can generate high quality deepfakes without much coding requirements?\n\ni got a cool pair of gpu's with tremendous power that i want to use for this purpose but don't know where to start.\n\n&amp;#x200b;\n\nregards", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hryys4/easiest_way_to_make_a_deepfake/',)", "identifyer": 5600547, "year": "2020"}, {"autor": "Robin5409", "date": 1592832435000, "content": "Best options to choose for Artificial Intelligence Training Programme among Hyderabad and Chennai ? /!/  \n\nHuman Intelligence and Artificial Intelligence: Comparisons and Differences \n\nEver since the concept of Artificial Intelligence or the machines doing the work of humans has been put forth, there have been innumerable debates and arguments regarding the the issue of whether the human working methods will be replaced by machines or not. Firstly, let us see the differences:\n\nIt has been long since the concept of Artificial Intelligence has been brought to existence and, since then, have not only progressive but also at times threatened to take the place of humans. It wouldn't be wrong to say so because at times they have proven to have higher speed of execution, higher operational ability and higher accuracy as compared to that of the humans. Also, the jobs which are tiring and boring according to the humans are very easily done by these machines.\n\nOn the other hand, **human intelligence** is known for its instinctive nature and spontaneity meaning **human intelligence** can act according to its surrounding and does not depend on the pre installed data as is the case for artificial intelligence. Also, the layers and depths present in the human brain cannot be made in the machines as they are way too complex.\n\nArtificial Intelligence taking over Human Intelligence: The Truth\n\nAlthough, it might seem that the machines have been very close in imitating the human behaviour and actions, as going by the recent developments, but the truth, however, is far from it. What makes **human intelligence** or humans in general superior is their ability to apply the knowledge that we have gained after logically reasoning and understanding a particular situation. There have been times when these machines with artificial intelligence have failed to take rational decisions because they do not possess common sense. \n\nHowever, having said that, there is not a single doubt that **artificial intelligence future** looks nothing but bright at the moment and after overcoming a few inefficiencies that they have, these machines will benefit us in several ways by coexisting with and helping humans for a better future.\n\nThe role of artificial intelligence in different fields\n\nThere has been an increasing amount of demand for artificial intelligence in almost all of the industries. The list below discusses some of the major fields in which artificial intelligence can play a big role.\n\n**1. Health Care:**\n\nJust like all the other fields, **Artificial intelligence in healthcare** also has major impact and often provides a better way of treatment than the traditional methods. In the cases where the patients lose their ability to speak, think or interact with others or their surrounding in any way due to some neurological diseases, **artificial intelligence in healthcare** plays a great role as these experiences can be regained by brain computer interface(BCIs) which can restore them. **AI in healthcare** can be used for the modification of the radiology tools which would be able to give accurate and detailed results and the use of tissue samples for diagnostics purposes would not be necessary. There is also another aspect of **artificial intelligence in healthcare** which can solve major problems and that is by taking over some diagnostics tasks allocated for humans. This can help in reducing the deficit of trained healthcare providers as there is a lack of them in life savinv cares in developing nations.\n\nArtificial intelligence is a very powerful weapon against **COVID-19** and if properly used, the recent progress in artificial intelligence features can be used to diagnose, predict and also control **COVID Effects**. Ever since the pandemic broke out there has been a massive support for using artificial intelligence in fighting **COVID-19** and efforts are going on in inspecting whether it will help reduce **COVID Effects** or not\n\n**2. Retail:**\n\nThe shopping options and their comforts would increase so much if there were personal recommendations and AI provides virtual shopping capabilities which can be used for this and many other purposes. As a matter of fact, the stock market and site designs can also benefit from artificial intelligence.\n\n**3. Banking:**\n\nOne of the major advantage of artificial intelligence over **human intelligence** is its ability to perform the tedious job in an efficient and fast paced manner. In financial institutions, AI can be used for several purposes from detecting the frauds to correcting the data to automating the management of huge data which are manually handled.\n\nThe impact just does not stop here, in order to emphasise on the point that **artificial intelligence future** is going to be in our favour, listed below are some already made **artificial intelligence projects.**\n\n**1. Brain-inspired Projects:**\n\n**\\*** Blue Brain project which is the project based on the concept of creating synthetic brain through the process of reverse engineering the brain of mammals. \n\n**\\*** Google Brain project is another attempt, as mentioned earlier, to achieve a level in **artificial intelligence future** where it is of the equal rank as that of **human intelligence**.\n\n**2. Cognitive architectures based projects:**\n\n**\\*** CALO is an **artificial intelligence project** which is funded by DARPA and is under the supervision of 25  institutions. This artificial intelligence project aims to gather all the important features of artificial intelligence like speech recognition, machine vision, probabilistic logic and many other features of **artificial intelligence and machine learning** and instill all of fhese features into a single AI assistant which will help in the office environment.\n\n**\\*** CoJack is an **artificial intelligence project** which is inspired by ACT-R and is an or feature to be added to the JACK multi-agent system for the enhancement of more human like characteristics to make it more realistic in virtual environments. Another attempt of **artificial intelligence project** to establish **human intelligence** in **artificial intelligence future**.\n\nAs can be seen from the above mentioned details of how artificial intelligence has impacted our world in such a positive way and how the the **artificial intelligence future** looks so progressive that it will be a privilege for anyone to be able to contribute to rapidly growing industry in technology. This can be done very easily by mastering at least one(or more) **artificial intelligence course**. There are several **learning sources** available right now. There are **free online courses** as well as paid online courses. These **artificial intelligence courses** are very much efficient and these really helps you grow in this field becoming an AI expert and thus contributing in one way or the other to the above mentioned industries. \n\nThe  Best options to choose for Artificial Intelligence Training Programme among Hyderabad and Chennai\n\nAlthough there are many options to choose from, listed below are the best institutions for artificial intelligence training programme that are present in big cities like Hyderabad and Chennai.\n\n**1. Great Learning:**\n\nOriginating in the year 2013, this is an edtech company which runs a course for duration of 12 months with 400+ learning hours in blended mode and 240 hours in online mentorship mode. This institution is noted to be one of the best institutes for **artificial intelligence course****.** Great Learning has managed to make the careers several professionals all across India and even abroad. The [**great learning artificial intelligence courses**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) give ways to get a strong grip in courses of data analytics, big data, **artificial intelligence and machine learning** course. Starting from the conceptual elements being faced and solved among the fellow pupils to preparing them for working environment to preparing them in such a way so that they can ace in job interviews, it would not be wrong to say that it really can be termed as one of the best [**artificial intelligence certification online course.**](https://www.greatlearning.in/pg-program-artificial-intelligence-course)\n\n**2. Amity University:**\n\nOriginating in the year 2018 with a course duration of 12 months and 400+ learning hours,  Careers of Tomorrow is an online platform laid by Amity University  where the course mainly focuses on Blockchain technology, data science, **artificial intelligence and machine learning** along with the usual courses. The best part is it takes into account both the usage of tool-based and hands-on training and also uses the various libraries such as Anaconda, Jupyter Notebooks, Tableau, etc.\n\n**3. Jigsaw Academy:**\n\nStarted in the year 2011 with a course duration of 6 months and 12+ learning hours, this **artificial intelligence certificate course** mainly provides training in data and analytics. This institution strongly believes in changing ont only the artificial intelligence industry as a whole but individuals as well. This course prepares the pupils with a strong and secure foundation which helps them prepare for a better **artificial intelligence future** as it continually tries to improve the skills and instill new skills. \n\n**4. IIT Hyderabad and Talent Sprint:**\n\nIIT Hyderabad, established in 1998, collaborated with Talent Sprint(established in 2009) runs this **artificial intelligence and machine learning** executive program for a course duration of 14 weeks and 168 learning hours. The best thing about this institute is the immense amount of research work involved in areas like data science, computer vision, cognitive science and robotics. There are 5 modes of teaching followed for this artificial intelligence course- classrooms used for lectures, labs, mentors, industry workshops and hackathons. \n\n**5. Manipal ProLearn:**\n\nOriginating in 2015, the **artificial intelligence certificate course** with deep learning runs with a course duration of 6 months for 340+ hours. This works really well for the graduates with a little knowledge in programming and are willing to make their career in artificial intelligence. This course helps the individuals in building AI based tools with the help of popular libraries and methods. They also conduct online webinars and python meetups for its benefit.\n\n**Conclusion:**\n\nIn this century of modern technology where everything around us is surrounded by means to make our task easier, it has become almost a necessity to partake in this world and there is not a better way to do so than by learning one of the best and progressive area that is artificial intelligence and this can be done by obtaining an [**artificial intelligence certification online.**](https://www.greatlearning.in/pg-program-artificial-intelligence-course)\n\nAs stated earlier they are both **free online courses** and paid courses available which can work as excellent **learning sources** for artificial intelligence but it always is beneficial to know and learn from an institution which has been acknowledged by many. Great learning is undoubtedly one such institution. It is known that the **Great Learning AI courses** are organised in such a way that it starts with the very basic aspects of each of the subjects and makes your foundation strong. **Artificial intelligence projects** with real time problems and sufficient amount of time for doing so are given to pupils here. There are also sessions that are being conducted where the experienced people from the industry comes to give their advices to the pupils to guide them for their working in **artificial intelligence future. The AI certificate course** here is very dynamic in nature meaning they do not just focus on theoretical knowledge but also puts emphasis on the practical side of the field through its case studies. This means that the [**artificial intelligence certification online course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) is not just limited to the algorithms and memorizing some study materials to run those codes but also makes you truly understand what business analytics mean. Through its various job portals and career counseling cells, it keeps the students motivated and focused on their career. Since it has both online classes mode and classroom mode, it gives a flexibility which acts in the favour of some individuals specially the ones working in some other way already. Moreover, the online mode is not just limited to watching videos and reporting according to the schedule but also there are mentors who make sure to connect with the pupils face to face and that is the USP of this **AI certificate course**. \n\nAs is very much evident **Great Learning AI courses** would be a great place to start for someone willing to pursue a career in artificial intelligence as it is reviewed and recommended as one of the most preferred institutions that there is for **artificial intelligence certification online**.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hdsbk4/best_options_to_choose_for_artificial/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "best options to choose for artificial intelligence training programme among hyderabad and chennai ? /!/  \n\nhuman intelligence and artificial intelligence: comparisons and differences \n\never since the concept of artificial intelligence or the machines doing the work of humans has been put forth, there have been innumerable debates and arguments regarding the the issue of whether the human working methods will be replaced by machines or not. firstly, let us see the differences:\n\nit has been long since the concept of artificial intelligence has been brought to existence and, since then, have not only progressive but also at times threatened to take the place of humans. it wouldn't be wrong to say so because at times they have proven to have higher speed of execution, higher operational ability and higher accuracy as compared to that of the humans. also, the jobs which are tiring and boring according to the humans are very easily done by these machines.\n\non the other hand, **human intelligence** is known for its instinctive nature and spontaneity meaning **human intelligence** can act according to its surrounding and does not depend on the pre installed data as is the case for artificial intelligence. also, the layers and depths present in the human brain cannot be made in the machines as they are way too complex.\n\nartificial intelligence taking over human intelligence: the truth\n\nalthough, it might seem that the machines have been very close in imitating the human behaviour and actions, as going by the recent developments, but the truth, however, is far from it. what makes **human intelligence** or humans in general superior is their ability to apply the knowledge that we have gained after logically reasoning and understanding a particular situation. there have been times when these machines with artificial intelligence have failed to take rational decisions because they do not possess common sense. \n\nhowever, having said that, there is not a single doubt that **artificial intelligence future** looks nothing but bright at the moment and after overcoming a few inefficiencies that they have, these machines will benefit us in several ways by coexisting with and helping humans for a better future.\n\nthe role of artificial intelligence in different fields\n\nthere has been an increasing amount of demand for artificial intelligence in almost all of the industries. the list below discusses some of the major fields in which artificial intelligence can play a big role.\n\n**1. health care:**\n\njust like all the other fields, **artificial intelligence in healthcare** also has major impact and often provides a better way of treatment than the traditional methods. in the cases where the patients lose their ability to speak, think or interact with others or their surrounding in any way due to some neurological diseases, **artificial intelligence in healthcare** plays a great role as these experiences can be regained by brain computer interface(bcis) which can restore them. **ai in healthcare** can be used for the modification of the radiology tools which would be able to give accurate and detailed results and the use of tissue samples for diagnostics purposes would not be necessary. there is also another aspect of **artificial intelligence in healthcare** which can solve major problems and that is by taking over some diagnostics tasks allocated for humans. this can help in reducing the deficit of trained healthcare providers as there is a lack of them in life savinv cares in developing nations.\n\nartificial intelligence is a very powerful weapon against **covid-19** and if properly used, the recent progress in artificial intelligence features can be used to diagnose, predict and also control **covid effects**. ever since the pandemic broke out there has been a massive support for using artificial intelligence in fighting **covid-19** and efforts are going on in inspecting whether it will help reduce **covid effects** or not\n\n**2. retail:**\n\nthe shopping options and their comforts would increase so much if there were personal recommendations and ai provides virtual shopping capabilities which can be used for this and many other purposes. as a matter of fact, the stock market and site designs can also benefit from artificial intelligence.\n\n**3. banking:**\n\none of the major advantage of artificial intelligence over **human intelligence** is its ability to perform the tedious job in an efficient and fast paced manner. in financial institutions, ai can be used for several purposes from detecting the frauds to correcting the data to automating the management of huge data which are manually handled.\n\nthe impact just does not stop here, in order to emphasise on the point that **artificial intelligence future** is going to be in our favour, listed below are some already made **artificial intelligence projects.**\n\n**1. brain-inspired projects:**\n\n**\\*** blue brain project which is the project based on the concept of creating synthetic brain through the process of reverse engineering the brain of mammals. \n\n**\\*** google brain project is another attempt, as mentioned earlier, to achieve a level in **artificial intelligence future** where it is of the equal rank as that of **human intelligence**.\n\n**2. cognitive architectures based projects:**\n\n**\\*** calo is an **artificial intelligence project** which is funded by darpa and is under the supervision of 25  institutions. this artificial intelligence project aims to gather all the important features of artificial intelligence like speech recognition, machine vision, probabilistic logic and many other features of **artificial intelligence and machine learning** and instill all of fhese features into a single ai assistant which will help in the office environment.\n\n**\\*** cojack is an **artificial intelligence project** which is inspired by act-r and is an or feature to be added to the jack multi-agent system for the enhancement of more human like characteristics to make it more realistic in virtual environments. another attempt of **artificial intelligence project** to establish **human intelligence** in **artificial intelligence future**.\n\nas can be seen from the above mentioned details of how artificial intelligence has impacted our world in such a positive way and how the the **artificial intelligence future** looks so progressive that it will be a privilege for anyone to be able to contribute to rapidly growing industry in technology. this can be done very easily by mastering at least one(or more) **artificial intelligence course**. there are several **learning sources** available right now. there are **free online courses** as well as paid online courses. these **artificial intelligence courses** are very much efficient and these really helps you grow in this field becoming an ai expert and thus contributing in one way or the other to the above mentioned industries. \n\nthe  best options to choose for artificial intelligence training programme among hyderabad and chennai\n\nalthough there are many options to choose from, listed below are the best institutions for artificial intelligence training programme that are present in big cities like hyderabad and chennai.\n\n**1. great learning:**\n\noriginating in the year 2013, this is an edtech company which runs a course for duration of 12 months with 400+ learning hours in blended mode and 240 hours in online mentorship mode. this institution is noted to be one of the best institutes for **artificial intelligence course****.** great learning has managed to make the careers several professionals all across india and even abroad. the [**great learning artificial intelligence courses**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) give ways to get a strong grip in courses of data analytics, big data, **artificial intelligence and machine learning** course. starting from the conceptual elements being faced and solved among the fellow pupils to preparing them for working environment to preparing them in such a way so that they can ace in job interviews, it would not be wrong to say that it really can be termed as one of the best [**artificial intelligence certification online course.**](https://www.greatlearning.in/pg-program-artificial-intelligence-course)\n\n**2. amity university:**\n\noriginating in the year 2018 with a course duration of 12 months and 400+ learning hours,  careers of tomorrow is an online platform laid by amity university  where the course mainly focuses on blockchain technology, data science, **artificial intelligence and machine learning** along with the usual courses. the best part is it takes into account both the usage of -----> tool !!! -based and hands-on training and also uses the various libraries such as anaconda, jupyter notebooks, tableau, etc.\n\n**3. jigsaw academy:**\n\nstarted in the year 2011 with a course duration of 6 months and 12+ learning hours, this **artificial intelligence certificate course** mainly provides training in data and analytics. this institution strongly believes in changing ont only the artificial intelligence industry as a whole but individuals as well. this course prepares the pupils with a strong and secure foundation which helps them prepare for a better **artificial intelligence future** as it continually tries to improve the skills and instill new skills. \n\n**4. iit hyderabad and talent sprint:**\n\niit hyderabad, established in 1998, collaborated with talent sprint(established in 2009) runs this **artificial intelligence and machine learning** executive program for a course duration of 14 weeks and 168 learning hours. the best thing about this institute is the immense amount of research work involved in areas like data science, computer vision, cognitive science and robotics. there are 5 modes of teaching followed for this artificial intelligence course- classrooms used for lectures, labs, mentors, industry workshops and hackathons. \n\n**5. manipal prolearn:**\n\noriginating in 2015, the **artificial intelligence certificate course** with deep learning runs with a course duration of 6 months for 340+ hours. this works really well for the graduates with a little knowledge in programming and are willing to make their career in artificial intelligence. this course helps the individuals in building ai based tools with the help of popular libraries and methods. they also conduct online webinars and python meetups for its benefit.\n\n**conclusion:**\n\nin this century of modern technology where everything around us is surrounded by means to make our task easier, it has become almost a necessity to partake in this world and there is not a better way to do so than by learning one of the best and progressive area that is artificial intelligence and this can be done by obtaining an [**artificial intelligence certification online.**](https://www.greatlearning.in/pg-program-artificial-intelligence-course)\n\nas stated earlier they are both **free online courses** and paid courses available which can work as excellent **learning sources** for artificial intelligence but it always is beneficial to know and learn from an institution which has been acknowledged by many. great learning is undoubtedly one such institution. it is known that the **great learning ai courses** are organised in such a way that it starts with the very basic aspects of each of the subjects and makes your foundation strong. **artificial intelligence projects** with real time problems and sufficient amount of time for doing so are given to pupils here. there are also sessions that are being conducted where the experienced people from the industry comes to give their advices to the pupils to guide them for their working in **artificial intelligence future. the ai certificate course** here is very dynamic in nature meaning they do not just focus on theoretical knowledge but also puts emphasis on the practical side of the field through its case studies. this means that the [**artificial intelligence certification online course**](https://www.greatlearning.in/pg-program-artificial-intelligence-course) is not just limited to the algorithms and memorizing some study materials to run those codes but also makes you truly understand what business analytics mean. through its various job portals and career counseling cells, it keeps the students motivated and focused on their career. since it has both online classes mode and classroom mode, it gives a flexibility which acts in the favour of some individuals specially the ones working in some other way already. moreover, the online mode is not just limited to watching videos and reporting according to the schedule but also there are mentors who make sure to connect with the pupils face to face and that is the usp of this **ai certificate course**. \n\nas is very much evident **great learning ai courses** would be a great place to start for someone willing to pursue a career in artificial intelligence as it is reviewed and recommended as one of the most preferred institutions that there is for **artificial intelligence certification online**.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hdsbk4/best_options_to_choose_for_artificial/',)", "identifyer": 5600682, "year": "2020"}, {"autor": "cclenders1975", "date": 1583280127000, "content": "Marketing /!/ Has anyone used any good AI tools to increase performance on marketing (email, paid media)? I have used Persado AI tool to increase open rates, and had good success.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/fd44rn/marketing/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "marketing /!/ has anyone used any good ai tools to increase performance on marketing (email, paid media)? i have used persado ai -----> tool !!!  to increase open rates, and had good success.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/fd44rn/marketing/',)", "identifyer": 5600811, "year": "2020"}, {"autor": "MatrixIsAStonkMarket", "date": 1604266733000, "content": "AI Recommendation Algos Bring Many Conflicts to Normal Society /!/ I believe AI is already destroying humanity simply through suggestion algos. They learn individual user behavior then mimics it and sort content based on the mimicked profile. But they are inherently confirming human biases over and over again in a loop, making individuals more and more isolated in their own thoughts. This will lead to more and more debates, conflicts, fights, simply due to intense bias of all sides. Suggestion algorithms can be as dangerous as an indirect tool to divide and conquer or even inciting a civil war.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jman5v/ai_recommendation_algos_bring_many_conflicts_to/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai recommendation algos bring many conflicts to normal society /!/ i believe ai is already destroying humanity simply through suggestion algos. they learn individual user behavior then mimics it and sort content based on the mimicked profile. but they are inherently confirming human biases over and over again in a loop, making individuals more and more isolated in their own thoughts. this will lead to more and more debates, conflicts, fights, simply due to intense bias of all sides. suggestion algorithms can be as dangerous as an indirect -----> tool !!!  to divide and conquer or even inciting a civil war.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jman5v/ai_recommendation_algos_bring_many_conflicts_to/',)", "identifyer": 5601019, "year": "2020"}, {"autor": "nidhaloff", "date": 1604152100000, "content": "Introducing igel: a delightful machine learning tool that allows you to train, test and use models without writing code", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jlinsz/introducing_igel_a_delightful_machine_learning/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "introducing igel: a delightful machine learning -----> tool !!!  that allows you to train, test and use models without writing code", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://github.com/nidhaloff/igel',)", "identifyer": 5601043, "year": "2020"}, {"autor": "Robin5409", "date": 1604007442000, "content": "AI Applications in Finance Industry /!/  \n\nhttps://preview.redd.it/wegxvx54s3w51.jpg?width=696&amp;format=pjpg&amp;auto=webp&amp;s=223d577be6a7a135228309202d0458ff3757a66c\n\nArtificial Intelligence is being utilised across industries to solve pressing issues and improve traditional processes to enable automation and enhance efficiency. One such industry that is revolutionising its ways with AI is the finance industry. Here are some of the recent advancements in the finance industry that are based on Artificial Intelligence.\n\n[**Google’s Lending DocAI Uses Machine Learning To Expedite Mortgage Application Processing**](https://www.marktechpost.com/2020/10/25/googles-lending-docai-uses-machine-learning-to-expedite-mortgage-application-processing/)\n\nUnlike other industries such as healthcare, education, business, and finance among others, the mortgage industry is still manually processing the paperwork of its customers.\n\nLending DocAI by Google is a mortgage document processing solution and is the latest addition to Google’s Document AI. The tool reads documents using OCR (Optical Character Recognition) to gain useful insights. It also utilises several unique machine learning models to extract specific data from documents used in mortgage lending.\n\n**AI: A game-changer for financial inclusion**\n\nFinancial inclusion has remained a challenge for India, even though Jan-Dhan accounts have ensured the provision of basic banking services to the poor. Aadhaar-enabled DBT has also not only plugged leakages but also ensured timely benefits and access to cash, especially in the COVID-19 pandemic. All these initiatives need to be scaled up to provide more financial services to the poor, farmers and the self-employed by enabling easy access to credit and ensuring that agriculture activities are supported and businesses are funded to help add value and create jobs.\n\nWith the push for increasing farmers’ access to financial services, banks and financial institutions have to be wary of financial frauds and must be equipped to conduct fair credit assessments. AI-based tools can enable all this by using data and machine learning algorithms to detect financial frauds, assess creditworthiness and help banks offer quality advice to customers. AI can also help improve customer service, sales, and retention efforts of banks.\n\nIf you are looking to learn Artificial Intelligence, Great Learning has several [Artificial Intelligence online](https://www.greatlearning.in/pg-program-artificial-intelligence-course) and classroom training programs. Great Learning is offering [Artificial Intelligence courses](https://www.greatlearning.in/pg-program-artificial-intelligence-course) that can help you launch your career. You can opt for AI for beginners course or any other advanced course, which are great learning resources. To know more details, get in touch with us today.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jkjdn3/ai_applications_in_finance_industry/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai applications in finance industry /!/  \n\nhttps://preview.redd.it/wegxvx54s3w51.jpg?width=696&amp;format=pjpg&amp;auto=webp&amp;s=223d577be6a7a135228309202d0458ff3757a66c\n\nartificial intelligence is being utilised across industries to solve pressing issues and improve traditional processes to enable automation and enhance efficiency. one such industry that is revolutionising its ways with ai is the finance industry. here are some of the recent advancements in the finance industry that are based on artificial intelligence.\n\n[**google’s lending docai uses machine learning to expedite mortgage application processing**](https://www.marktechpost.com/2020/10/25/googles-lending-docai-uses-machine-learning-to-expedite-mortgage-application-processing/)\n\nunlike other industries such as healthcare, education, business, and finance among others, the mortgage industry is still manually processing the paperwork of its customers.\n\nlending docai by google is a mortgage document processing solution and is the latest addition to google’s document ai. the -----> tool !!!  reads documents using ocr (optical character recognition) to gain useful insights. it also utilises several unique machine learning models to extract specific data from documents used in mortgage lending.\n\n**ai: a game-changer for financial inclusion**\n\nfinancial inclusion has remained a challenge for india, even though jan-dhan accounts have ensured the provision of basic banking services to the poor. aadhaar-enabled dbt has also not only plugged leakages but also ensured timely benefits and access to cash, especially in the covid-19 pandemic. all these initiatives need to be scaled up to provide more financial services to the poor, farmers and the self-employed by enabling easy access to credit and ensuring that agriculture activities are supported and businesses are funded to help add value and create jobs.\n\nwith the push for increasing farmers’ access to financial services, banks and financial institutions have to be wary of financial frauds and must be equipped to conduct fair credit assessments. ai-based tools can enable all this by using data and machine learning algorithms to detect financial frauds, assess creditworthiness and help banks offer quality advice to customers. ai can also help improve customer service, sales, and retention efforts of banks.\n\nif you are looking to learn artificial intelligence, great learning has several [artificial intelligence online](https://www.greatlearning.in/pg-program-artificial-intelligence-course) and classroom training programs. great learning is offering [artificial intelligence courses](https://www.greatlearning.in/pg-program-artificial-intelligence-course) that can help you launch your career. you can opt for ai for beginners course or any other advanced course, which are great learning resources. to know more details, get in touch with us today.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/jkjdn3/ai_applications_in_finance_industry/',)", "identifyer": 5601079, "year": "2020"}, {"autor": "medicinal-madlad", "date": 1607422107000, "content": "AI stock market trading sentiment /!/ would it be possible to make an AI sentiment trading tool?\n\none that scans twitter for news and that processes it to a market forsight", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k91p0w/ai_stock_market_trading_sentiment/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai stock market trading sentiment /!/ would it be possible to make an ai sentiment trading -----> tool !!! ?\n\none that scans twitter for news and that processes it to a market forsight", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 10, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/k91p0w/ai_stock_market_trading_sentiment/',)", "identifyer": 5601403, "year": "2020"}, {"autor": "Robothere1", "date": 1591788462000, "content": "Best Robotic Process Automation | RPA Tool | Intellibot RPA - Intellibot is a HyperAutomation Platform that converges all the technology components and capabilities to drive a successful digital transformation initiative in an Enterprise. Best Robotic Process Automation Software (RPA) in its class.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/h090ft/best_robotic_process_automation_rpa_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "best robotic process automation | rpa -----> tool !!!  | intellibot rpa - intellibot is a hyperautomation platform that converges all the technology components and capabilities to drive a successful digital transformation initiative in an enterprise. best robotic process automation software (rpa) in its class.", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://i.redd.it/o0shvc4ji2451.png',)", "identifyer": 5601486, "year": "2020"}, {"autor": "RimaShah_TS", "date": 1591598127000, "content": "Difference between : Bots, Chatbots and Robots /!/ You might have heard the terms: Bots, Chatbots and Robots or seen them on your screen but there is a vast difference between them that is important to understand\n\nThe definition of a **robot** is diverse, however, people unanimously agree that they are machines designed to perform a series of mechanical functions programmed by a computer, designed to replace the form of manual tasks with more efficient autonomous solutions in every aspect of our lives.\n\nA **bot** is defined as a computer program that performs automatic repetitive tasks, moreover, acts as a primary tool for automating interactions and engagement with website content on a mass scale. This concept is not unfamiliar, search engines such as Google use bots extensively which are also known as web crawlers, to analyze content and index the web.\n\nBots are now varied in terms of the services they provide to you. For example, when speaking about a **chatbot**, although similar to a standard bot it is designed to interact with humans conversationally based on its programming. The purpose of a chatbot is to automate the process of interacting with website visitors and social media followers. Chatbots have got a large presence on some of the world’s largest company websites such as Amazon.\n\nRobots, Chatbots, and alternative bots are changing the way we interact today. **Technostacks** is a mobile app development and we have developed many AI apps as well as AR/VR mobile apps. If you want to have a look or a detailed demonstration of our capabilities and get your Minimum Viable Product (MVP) up and running quickly and cost-effectively, get in touch with us.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gyttco/difference_between_bots_chatbots_and_robots/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "difference between : bots, chatbots and robots /!/ you might have heard the terms: bots, chatbots and robots or seen them on your screen but there is a vast difference between them that is important to understand\n\nthe definition of a **robot** is diverse, however, people unanimously agree that they are machines designed to perform a series of mechanical functions programmed by a computer, designed to replace the form of manual tasks with more efficient autonomous solutions in every aspect of our lives.\n\na **bot** is defined as a computer program that performs automatic repetitive tasks, moreover, acts as a primary -----> tool !!!  for automating interactions and engagement with website content on a mass scale. this concept is not unfamiliar, search engines such as google use bots extensively which are also known as web crawlers, to analyze content and index the web.\n\nbots are now varied in terms of the services they provide to you. for example, when speaking about a **chatbot**, although similar to a standard bot it is designed to interact with humans conversationally based on its programming. the purpose of a chatbot is to automate the process of interacting with website visitors and social media followers. chatbots have got a large presence on some of the world’s largest company websites such as amazon.\n\nrobots, chatbots, and alternative bots are changing the way we interact today. **technostacks** is a mobile app development and we have developed many ai apps as well as ar/vr mobile apps. if you want to have a look or a detailed demonstration of our capabilities and get your minimum viable product (mvp) up and running quickly and cost-effectively, get in touch with us.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gyttco/difference_between_bots_chatbots_and_robots/',)", "identifyer": 5601550, "year": "2020"}, {"autor": "MainImpression12", "date": 1587470066000, "content": "Web Scraping tool to scrape jobs from Glassdoor", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/g5dufu/web_scraping_tool_to_scrape_jobs_from_glassdoor/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "web scraping -----> tool !!!  to scrape jobs from glassdoor", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('rich:video',)", "medialink": "('https://youtu.be/iMxarRW1z_4',)", "identifyer": 5601744, "year": "2020"}, {"autor": "Yuqing7", "date": 1587424557000, "content": "Landing AI ‘Social Distancing Detector’ Monitors Workplaces /!/ Last week, Silicon Valley based Landing AI introduced a new AI-enabled social distancing detection tool designed to help monitor and enforce physical distancing protocols in workplaces. With many manufacturers hastily refitting factories to produce surgical masks, hand sanitizer and other COVID-19 related materials for the general public and medical staff, it’s hoped the system can protect the workers in these and other such facilities from the threat of SARS-CoV-2 infection.\n\nRead more: [Landing AI ‘Social Distancing Detector’ Monitors Workplaces](https://medium.com/syncedreview/landing-ai-social-distancing-detector-monitors-workplaces-8ad08f3a143f)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/g53oha/landing_ai_social_distancing_detector_monitors/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "landing ai ‘social distancing detector’ monitors workplaces /!/ last week, silicon valley based landing ai introduced a new ai-enabled social distancing detection -----> tool !!!  designed to help monitor and enforce physical distancing protocols in workplaces. with many manufacturers hastily refitting factories to produce surgical masks, hand sanitizer and other covid-19 related materials for the general public and medical staff, it’s hoped the system can protect the workers in these and other such facilities from the threat of sars-cov-2 infection.\n\nread more: [landing ai ‘social distancing detector’ monitors workplaces](https://medium.com/syncedreview/landing-ai-social-distancing-detector-monitors-workplaces-8ad08f3a143f)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/g53oha/landing_ai_social_distancing_detector_monitors/',)", "identifyer": 5601759, "year": "2020"}, {"autor": "olportal", "date": 1584200424000, "content": "The Newest Version of iMe Messenger is Out. And it is Loaded with Exciting Features! 🔥Multilanguage translation tool🔥 https://link.medium.com/CwNW4ucPQ4 #olportal #neurobot #marketplace #ai #OLCF #bots #artificialintelligence #cryptocurrency", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/fik8so/the_newest_version_of_ime_messenger_is_out_and_it/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the newest version of ime messenger is out. and it is loaded with exciting features! 🔥multilanguage translation -----> tool !!! 🔥 https://link.medium.com/cwnw4ucpq4 #olportal #neurobot #marketplace #ai #olcf #bots #artificialintelligence #cryptocurrency", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 88, "media": "('image',)", "medialink": "('https://i.redd.it/e3nudeyornm41.jpg',)", "identifyer": 5601977, "year": "2020"}, {"autor": "Marktaylor07", "date": 1581335753000, "content": "Why AI is the most Important HR Tech tool?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/f1p9fl/why_ai_is_the_most_important_hr_tech_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "why ai is the most important hr tech -----> tool !!! ?", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://datafloq.com/read/why-ai-is-the-most-important-hr-tech-tool/7654',)", "identifyer": 5602056, "year": "2020"}, {"autor": "HyperkiteAI", "date": 1581171135000, "content": "[P] Looking for alpha testers for hyperparameter tuning tool: hyperkite.ai", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/f0s29q/p_looking_for_alpha_testers_for_hyperparameter/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[p] looking for alpha testers for hyperparameter tuning -----> tool !!! : hyperkite.ai", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('/r/MachineLearning/comments/f0rzwx/p_looking_for_alpha_testers_for_hyperparameter/',)", "identifyer": 5602081, "year": "2020"}, {"autor": "analyticsindiam", "date": 1592247791000, "content": "AI Tool Turns Blurry Human Photo Into Realistic Computer-Generated HD Faces", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/h9mk04/ai_tool_turns_blurry_human_photo_into_realistic/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai -----> tool !!!  turns blurry human photo into realistic computer-generated hd faces", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://analyticsindiamag.com/ai-tool-turns-blurry-human-photo-into-realistic-computer-generated-hd-faces/',)", "identifyer": 5602492, "year": "2020"}, {"autor": "Ok-Improvement-6388", "date": 1602539706000, "content": "I’m hiring (But you won't get paid) /!/ I want somebody that knows how to make AI pretty well. Anybody who makes it will have full access after it is made. Although we will talk about permissions later. I will be making an Ethical Hacking tool. Another thing I would like to point out is you will not get paid. Once you hear what you're making, you probably will think I'm insane. Although I am very sorry. This is just an idea, that I think should come to life. Here's my idea...\n\nFirst, I hire you. Once you're ready, I find a hacker. Hear me out, alright? You and the hacker(Will be a good hacker. The ones that defend, not attack) will work together to make the project idea. I'm still thinking of how you will be able to work together. I'll make sure you guys can communicate. Maybe just a chat, or maybe a call. That's up to you. You guys will be making an AI that hacks. Not something like NMap, that you use to hack. Something that uses tools like that, to do what a hacker would do. \n\nThis would enhance security by huge amounts. I bet Black Hat Hackers have already made this. Although you know them. They like to keep it to themselves. Because otherwise, people will learn to get around it. But if we do what they do(Using their tools), we will find the exploits. Then you will be a ton safer, and the hackers will be pushed to the curb. Just DM me if you're interested. If you know any people that do Ethical Hacking, tell them to DM me. Or send me their account.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ja0hol/im_hiring_but_you_wont_get_paid/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i’m hiring (but you won't get paid) /!/ i want somebody that knows how to make ai pretty well. anybody who makes it will have full access after it is made. although we will talk about permissions later. i will be making an ethical hacking -----> tool !!! . another thing i would like to point out is you will not get paid. once you hear what you're making, you probably will think i'm insane. although i am very sorry. this is just an idea, that i think should come to life. here's my idea...\n\nfirst, i hire you. once you're ready, i find a hacker. hear me out, alright? you and the hacker(will be a good hacker. the ones that defend, not attack) will work together to make the project idea. i'm still thinking of how you will be able to work together. i'll make sure you guys can communicate. maybe just a chat, or maybe a call. that's up to you. you guys will be making an ai that hacks. not something like nmap, that you use to hack. something that uses tools like that, to do what a hacker would do. \n\nthis would enhance security by huge amounts. i bet black hat hackers have already made this. although you know them. they like to keep it to themselves. because otherwise, people will learn to get around it. but if we do what they do(using their tools), we will find the exploits. then you will be a ton safer, and the hackers will be pushed to the curb. just dm me if you're interested. if you know any people that do ethical hacking, tell them to dm me. or send me their account.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ja0hol/im_hiring_but_you_wont_get_paid/',)", "identifyer": 5602721, "year": "2020"}, {"autor": "purethabang", "date": 1602461726000, "content": "Machine Learning Model Testing in Staging /!/ Hey all,\n\nI'm a 19 y/o software engineer wanting to dive deeper into machine learning. Although, I know ML/DL/Ai is still brand new (compared to software eng.), why isn't there a way for machine learning models to be tested in staging environments?\n\nNo, really. Hear me out. Coming from S.W.E, we are spoilt with the plethora of developer tools (spoilt is an understatement). Whether it's a simple feature test or a full on product preview, we have many ways to deploy software (even mobile apps) into staging instead of directly into production.\n\nWhy isn't there something like this for ML? I have a concept in my head of what it would look like...\n\nYou've just built the coolest model that allows you to serve relevant cat pictures to your super cool cat social media platform. You jump into a command-line tool and simply deploy this model as an API (whatever you use I guess, I'm new to this world so I'm not sure). You then find open source social media source code on GitHub or get your team, friend or cat to make you one. You hook it up to the API and deploy it on the same platform as the model and can now allow public/private access to your staging environment for beta testing or internal testing. Now, your model is tested in the real world and you have real analytics that feedback how it would be used in the real world.\n\nAll of this without any S.W.E or DevOps/MLOps\n\n10x more accurate working models for you, you and YOU!\n\nMaybe this is just a personal problem coming from the S.W.E world but I don't get why there isn't something like this out there - if there is, please link me because I would love to use it lol.\n\nAlso, if there isn't something like this, being the S.W.E I am, who's up for the challenge to try build it?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j9gmtv/machine_learning_model_testing_in_staging/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "machine learning model testing in staging /!/ hey all,\n\ni'm a 19 y/o software engineer wanting to dive deeper into machine learning. although, i know ml/dl/ai is still brand new (compared to software eng.), why isn't there a way for machine learning models to be tested in staging environments?\n\nno, really. hear me out. coming from s.w.e, we are spoilt with the plethora of developer tools (spoilt is an understatement). whether it's a simple feature test or a full on product preview, we have many ways to deploy software (even mobile apps) into staging instead of directly into production.\n\nwhy isn't there something like this for ml? i have a concept in my head of what it would look like...\n\nyou've just built the coolest model that allows you to serve relevant cat pictures to your super cool cat social media platform. you jump into a command-line -----> tool !!!  and simply deploy this model as an api (whatever you use i guess, i'm new to this world so i'm not sure). you then find open source social media source code on github or get your team, friend or cat to make you one. you hook it up to the api and deploy it on the same platform as the model and can now allow public/private access to your staging environment for beta testing or internal testing. now, your model is tested in the real world and you have real analytics that feedback how it would be used in the real world.\n\nall of this without any s.w.e or devops/mlops\n\n10x more accurate working models for you, you and you!\n\nmaybe this is just a personal problem coming from the s.w.e world but i don't get why there isn't something like this out there - if there is, please link me because i would love to use it lol.\n\nalso, if there isn't something like this, being the s.w.e i am, who's up for the challenge to try build it?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j9gmtv/machine_learning_model_testing_in_staging/',)", "identifyer": 5602738, "year": "2020"}, {"autor": "Abe_Jar", "date": 1602361985000, "content": "Running and training ML without coding? This is how I did it /!/  The last time I've written code was nearly 20 years ago. When I wanted to train machine learning GANs for personal use I started an online phyton course, yet I found that that coding is not really needed. You do need to have some technical capacity, willingness to read and learn and patience. This is not a tutorial, just a few tips of things that can help. Maybe one day I'll sit and write a complete tutorial. \n\nThe basic knowledge that you need to train machine learning modules:\n\n&amp;#x200B;\n\n1. You need to learn how to set up and run an integrated development environment for Phyton such as PyCharm or IntelliJ. I learned through the phyton course I took, but note that this not require writing lines of code.\n2. Running scripts and activating virtual environments requires learning to use command line/terminal codes.\n3. So much of the machine learning algorithms are open source with an implementation in GitHub. You'll need to understand what each module offers, and what inputs it needs for training. You'll also need to learn how to use GitHub but that really simple. \n4. To prepare a large dataset for training, in my case it was pictures, you'll need to be able to do bulk operations. What I found very helpful is Mac's Automator tool which automates processes such as bulk cropping of pictures. \n5. Mainly you'll need to read forums in StackOverflow and other such sites on how to install and import that software packages you need in other to run the ML algorithms you need. Oddly one of the things that were hardest for me is making the ML run on my computer's GPU with required a set of installations of Nvidia packages (Cuda and Cuddn). They should really make it simpler. \n\nThe pictures show what, among other things, I've been able to do myself. This initial work helped me get a  data science partner and together we are working on a new service for designers to create illustrations with machine learning. You can see it [here](http://unbouncepages.com/designer-registration/).", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j8rqxq/running_and_training_ml_without_coding_this_is/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "running and training ml without coding? this is how i did it /!/  the last time i've written code was nearly 20 years ago. when i wanted to train machine learning gans for personal use i started an online phyton course, yet i found that that coding is not really needed. you do need to have some technical capacity, willingness to read and learn and patience. this is not a tutorial, just a few tips of things that can help. maybe one day i'll sit and write a complete tutorial. \n\nthe basic knowledge that you need to train machine learning modules:\n\n&amp;#x200b;\n\n1. you need to learn how to set up and run an integrated development environment for phyton such as pycharm or intellij. i learned through the phyton course i took, but note that this not require writing lines of code.\n2. running scripts and activating virtual environments requires learning to use command line/terminal codes.\n3. so much of the machine learning algorithms are open source with an implementation in github. you'll need to understand what each module offers, and what inputs it needs for training. you'll also need to learn how to use github but that really simple. \n4. to prepare a large dataset for training, in my case it was pictures, you'll need to be able to do bulk operations. what i found very helpful is mac's automator -----> tool !!!  which automates processes such as bulk cropping of pictures. \n5. mainly you'll need to read forums in stackoverflow and other such sites on how to install and import that software packages you need in other to run the ml algorithms you need. oddly one of the things that were hardest for me is making the ml run on my computer's gpu with required a set of installations of nvidia packages (cuda and cuddn). they should really make it simpler. \n\nthe pictures show what, among other things, i've been able to do myself. this initial work helped me get a  data science partner and together we are working on a new service for designers to create illustrations with machine learning. you can see it [here](http://unbouncepages.com/designer-registration/).", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j8rqxq/running_and_training_ml_without_coding_this_is/',)", "identifyer": 5602754, "year": "2020"}, {"autor": "hackernoon", "date": 1603373619000, "content": "Universal Data Tool Update: On-Premise Data Labeling", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jfzpfz/universal_data_tool_update_onpremise_data_labeling/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "universal data -----> tool !!!  update: on-premise data labeling", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hackernoon.com/universal-data-tool-update-on-premise-data-labeling-dl1e3wxg?source=rss',)", "identifyer": 5602910, "year": "2020"}, {"autor": "clean_pegasus", "date": 1603289617000, "content": "I wrote a blog on an essential tool for Data Science and ML research. I hope you find it useful.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jfdll4/i_wrote_a_blog_on_an_essential_tool_for_data/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "i wrote a blog on an essential -----> tool !!!  for data science and ml research. i hope you find it useful.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://medium.com/@cleanpegasus/a-must-have-tool-for-every-data-scientist-5e7c76f1916f',)", "identifyer": 5602936, "year": "2020"}, {"autor": "analyticsindiam", "date": 1603118349000, "content": "Generating Suitable ML Models Using LazyPredict Python Tool", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/je2tod/generating_suitable_ml_models_using_lazypredict/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "generating suitable ml models using lazypredict python -----> tool !!! ", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://analyticsindiamag.com/generating-suitable-ml-models-using-lazypredict-python-tool/',)", "identifyer": 5602957, "year": "2020"}, {"autor": "jsamwrites", "date": 1589870136000, "content": "This AI tool automatically identifies different types of brain injury", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gmj9wo/this_ai_tool_automatically_identifies_different/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "this ai -----> tool !!!  automatically identifies different types of brain injury", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://thenextweb.com/neural/2020/05/18/this-ai-tool-automatically-identifies-different-types-of-brain-injury/',)", "identifyer": 5603000, "year": "2020"}, {"autor": "alexandra_moroz", "date": 1589789893000, "content": "AI in business /!/  Artificial intelligence in business is rapidly becoming a commonly-used competitive tool. Clearly, companies are past debating the pros and cons of AI. From better chatbots for customer service to data analytics to making predictive recommendations, deep learning and artificial intelligence in their many forms is seen by business leaders as an essential tool.  \n⠀  \nRead about the [difficulties with AI adoption and how companies can alleviate them](https://onix-systems.com/blog/artificial-Intelligence-in-business-meeting-the-challenges-to-ai-adoption)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/glxh5f/ai_in_business/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai in business /!/  artificial intelligence in business is rapidly becoming a commonly-used competitive -----> tool !!! . clearly, companies are past debating the pros and cons of ai. from better chatbots for customer service to data analytics to making predictive recommendations, deep learning and artificial intelligence in their many forms is seen by business leaders as an essential tool.  \n⠀  \nread about the [difficulties with ai adoption and how companies can alleviate them](https://onix-systems.com/blog/artificial-intelligence-in-business-meeting-the-challenges-to-ai-adoption)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/glxh5f/ai_in_business/',)", "identifyer": 5603023, "year": "2020"}, {"autor": "vertexplustechno", "date": 1589621143000, "content": "Visual Analytics Tool | SAS Visual Analytics in India | VertexPlus Technologies /!/ [removed]", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gkruq3/visual_analytics_tool_sas_visual_analytics_in/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "visual analytics -----> tool !!!  | sas visual analytics in india | vertexplus technologies /!/ [removed]", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gkruq3/visual_analytics_tool_sas_visual_analytics_in/',)", "identifyer": 5603050, "year": "2020"}, {"autor": "alexandra_moroz", "date": 1589533125000, "content": "AI in business /!/ Artificial intelligence (AI) in business is rapidly becoming a commonly-used competitive tool.  \n⠀  \nFrom customer service chatbots to data analytics to makу predictive recommendations, deep learning and artificial intelligence in their many forms are often seen as an essential tool by business leaders.  \n⠀  \nDo you use AI in your business? How AI is transforming it?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gk5m6s/ai_in_business/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai in business /!/ artificial intelligence (ai) in business is rapidly becoming a commonly-used competitive -----> tool !!! .  \n⠀  \nfrom customer service chatbots to data analytics to makу predictive recommendations, deep learning and artificial intelligence in their many forms are often seen as an essential tool by business leaders.  \n⠀  \ndo you use ai in your business? how ai is transforming it?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gk5m6s/ai_in_business/',)", "identifyer": 5603063, "year": "2020"}, {"autor": "Commercial_Ruin6669", "date": 1605457873000, "content": "Artistic project suggestion: as you can see from the image, I'm generating with a StyleGAN some trophies, which I'm sculpting in ZBrush and then 3D printing. I have a question: Is there any (useful for this purpose) tool to generate 3D models from images? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/w7red8qgkfz51.png?width=2481&amp;format=png&amp;auto=webp&amp;s=76078117956cd452c9298357357e98a20f010ecd", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/juolh2/artistic_project_suggestion_as_you_can_see_from/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artistic project suggestion: as you can see from the image, i'm generating with a stylegan some trophies, which i'm sculpting in zbrush and then 3d printing. i have a question: is there any (useful for this purpose) -----> tool !!!  to generate 3d models from images? /!/ &amp;#x200b;\n\nhttps://preview.redd.it/w7red8qgkfz51.png?width=2481&amp;format=png&amp;auto=webp&amp;s=76078117956cd452c9298357357e98a20f010ecd", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/juolh2/artistic_project_suggestion_as_you_can_see_from/',)", "identifyer": 5603123, "year": "2020"}, {"autor": "Hiba_Baz_Radwan01", "date": 1608209794000, "content": "Real-Time Inventory Management /!/ This blog approaches [Inventory System ](https://asapsystems.com/inventory-system/)  management through machine learning. It also indicates how analytics are related to the quality of data used by companies. Some risks that are caused by following predictive analytics are also explained.\n\nAs technology and artificial intelligence continue to spread across industries then traditional as well as manual functions will decrease. Nowadays, real-time inventory management aids companies’ owners and business dealers with decision making concerning their products by interpreting several intervals of data such as:\n\n·         Orders that arrived and still on the way\n\n·         Damages on products\n\n·         Customer reviews and feedbacks\n\nAs paper and pen methods became a struggle, businesses started using barcode scanners to be provided with details and databases.\n\nThe Future of Real-Time Inventory Management:\n\nThe supply of databases will establish the inventory management while increasing the quality of how companies store their stock.\n\n·         Launching Real-Time Inventory Management Systems:\n\nArtificial intelligence has become a wide range of topics where integrating each one will be hard. Hence, establishing a real-time inventory management system will require more than having a few data scientists. Predictive analytics is needed with machine learning. For example, a huge amount of data is collected about a given problem and an answer is found. By analyzing all data about a certain client, data scientists can deduce whether the clients will continue to buy products or stop.\n\nAdapting data science and analytics does not only require data scientists. Owners should plan on establishing the suitable infrastructure and integration of data in their business.\n\n·         Steps to Invest in Predictive Analytics:\n\n1.      Determine your business goals and software that you need to use\n\n2.      Capture data from more than source\n\n3.      Get high quality data via a data cleaning tool\n\n4.      Specify the analytics toll that you are going to work with\n\n \n\n1)      It is sometimes assumed that the predictive analytics procedure goes well with machine learning specifying and solving most of the errors. However, the procedure is not that easy. The analytics depend on data so even if the company had enough amounts of data it should make sure of its quality. To do this, a data cleaning project should be introduced.\n\n2)      Predictive analytics depend on how good is the quality of data used. The high processing of all kinds of data leads to relating everything about the companies to the inventory management.\n\n3)      The quality of databases decreases if employees do not fill all the fields with their specific data. Once data is collected from inventory systems, cleaning this data will not be easy and it is divided into different tasks:\n\n·         Removing unnecessary and bad data\n\n·         Giving right labels and codes to be read by the barcode scanners\n\n·         Removing same or duplicate data\n\n·         Checking if data will not change staying the same\n\nOnce the data is cleaned, the company should look up for software that deals with all tasks of the inventory.\n\n4)      Steps to consider once choosing a data and analytics tool:\n\n·         Establish a research regarding what kind of analytics suits the company\n\n·         Know how data analytics business works\n\n·         Compare your company with other companies to know the capability you have\n\n·         Establish matrices to distinguish different tools\n\n·         Use an analytic tool to take the final action\n\nTypes of data analytics procedures:\n\n·         MDX query tools\n\n·         Visualization tools\n\n·         BI and reporting tools\n\n·         Modelling tools\n\nWhy should companies adapt to Real-Time inventory management?\n\na)      Keeping the clients satisfied: Real-time inventory management defines your client experience by helping reduce stock outs and turning clients into repeat customers.\n\nb)      Know how much inventory the company has otherwise the owner cannot know how many stock outs there will be.\n\nc)      Reports can be obtained directly once real-time inventory systems are used. Generating reports can bring the company to speed its rate of business.\n\nd)      Cost savings will increase with machine learning\n\nRisks and Problems Facing Big Data Analytics:\n\na)      Synchronization across databases has to be established incorporating data into categories. If this is not done, gaps will be established leading to wrong labels on barcodes.\n\nb)      Shortage of data scientists vs. big amounts of data: It is essential for company owners to introduce highly skilled data scientists that are qualified for the job. However, not many analytical scientists are available.\n\nc)      Privacy of databases: Potential risks come with the huge storage of data where its privacy and security can be accessed. To overcome this problem, a training data program should be established.\n\nIn conclusion, inventory management is the future of companies and businesses. In any business, whether it is local or worldwide, small or big, owners must know that having the way to establish real-time inventory systems is essential for increasing cost savings, reducing human errors, obtaining more satisfaction from clients, knowing how to process a huge amount of data, and generating reports that will help with stock outs. However, some challenges are faced by owners once they want to introduce predictive analytics to their [System](https://asapsystems.com/) and inventory such as not having the amount of analysts to establish tools and techniques. This is why the company has to determine its goals and introduce training sessions for registered workers so that they will not have to deal with the decrease in scientists vs. the huge amount of data that needs to be processed.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kewyfw/realtime_inventory_management/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "real-time inventory management /!/ this blog approaches [inventory system ](https://asapsystems.com/inventory-system/)  management through machine learning. it also indicates how analytics are related to the quality of data used by companies. some risks that are caused by following predictive analytics are also explained.\n\nas technology and artificial intelligence continue to spread across industries then traditional as well as manual functions will decrease. nowadays, real-time inventory management aids companies’ owners and business dealers with decision making concerning their products by interpreting several intervals of data such as:\n\n·         orders that arrived and still on the way\n\n·         damages on products\n\n·         customer reviews and feedbacks\n\nas paper and pen methods became a struggle, businesses started using barcode scanners to be provided with details and databases.\n\nthe future of real-time inventory management:\n\nthe supply of databases will establish the inventory management while increasing the quality of how companies store their stock.\n\n·         launching real-time inventory management systems:\n\nartificial intelligence has become a wide range of topics where integrating each one will be hard. hence, establishing a real-time inventory management system will require more than having a few data scientists. predictive analytics is needed with machine learning. for example, a huge amount of data is collected about a given problem and an answer is found. by analyzing all data about a certain client, data scientists can deduce whether the clients will continue to buy products or stop.\n\nadapting data science and analytics does not only require data scientists. owners should plan on establishing the suitable infrastructure and integration of data in their business.\n\n·         steps to invest in predictive analytics:\n\n1.      determine your business goals and software that you need to use\n\n2.      capture data from more than source\n\n3.      get high quality data via a data cleaning -----> tool !!! \n\n4.      specify the analytics toll that you are going to work with\n\n \n\n1)      it is sometimes assumed that the predictive analytics procedure goes well with machine learning specifying and solving most of the errors. however, the procedure is not that easy. the analytics depend on data so even if the company had enough amounts of data it should make sure of its quality. to do this, a data cleaning project should be introduced.\n\n2)      predictive analytics depend on how good is the quality of data used. the high processing of all kinds of data leads to relating everything about the companies to the inventory management.\n\n3)      the quality of databases decreases if employees do not fill all the fields with their specific data. once data is collected from inventory systems, cleaning this data will not be easy and it is divided into different tasks:\n\n·         removing unnecessary and bad data\n\n·         giving right labels and codes to be read by the barcode scanners\n\n·         removing same or duplicate data\n\n·         checking if data will not change staying the same\n\nonce the data is cleaned, the company should look up for software that deals with all tasks of the inventory.\n\n4)      steps to consider once choosing a data and analytics tool:\n\n·         establish a research regarding what kind of analytics suits the company\n\n·         know how data analytics business works\n\n·         compare your company with other companies to know the capability you have\n\n·         establish matrices to distinguish different tools\n\n·         use an analytic tool to take the final action\n\ntypes of data analytics procedures:\n\n·         mdx query tools\n\n·         visualization tools\n\n·         bi and reporting tools\n\n·         modelling tools\n\nwhy should companies adapt to real-time inventory management?\n\na)      keeping the clients satisfied: real-time inventory management defines your client experience by helping reduce stock outs and turning clients into repeat customers.\n\nb)      know how much inventory the company has otherwise the owner cannot know how many stock outs there will be.\n\nc)      reports can be obtained directly once real-time inventory systems are used. generating reports can bring the company to speed its rate of business.\n\nd)      cost savings will increase with machine learning\n\nrisks and problems facing big data analytics:\n\na)      synchronization across databases has to be established incorporating data into categories. if this is not done, gaps will be established leading to wrong labels on barcodes.\n\nb)      shortage of data scientists vs. big amounts of data: it is essential for company owners to introduce highly skilled data scientists that are qualified for the job. however, not many analytical scientists are available.\n\nc)      privacy of databases: potential risks come with the huge storage of data where its privacy and security can be accessed. to overcome this problem, a training data program should be established.\n\nin conclusion, inventory management is the future of companies and businesses. in any business, whether it is local or worldwide, small or big, owners must know that having the way to establish real-time inventory systems is essential for increasing cost savings, reducing human errors, obtaining more satisfaction from clients, knowing how to process a huge amount of data, and generating reports that will help with stock outs. however, some challenges are faced by owners once they want to introduce predictive analytics to their [system](https://asapsystems.com/) and inventory such as not having the amount of analysts to establish tools and techniques. this is why the company has to determine its goals and introduce training sessions for registered workers so that they will not have to deal with the decrease in scientists vs. the huge amount of data that needs to be processed.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/kewyfw/realtime_inventory_management/',)", "identifyer": 5603253, "year": "2020"}, {"autor": "Yuqing7", "date": 1607716760000, "content": "[P] Depix AI Recovers Pixelized Passwords, Earns 10K GitHub Stars /!/ information by dramatically reducing the resolution of sensitive areas in an image. For years, the technique has had broad applications in security and censorship — but its days may be numbered. “[Depix](https://github.com/beurtschipper/Depix)” is a new AI-powered tool that can easily undo pixelization to enable recovery of the information therein. Uploaded this week, the project has already received nearly 10,000 stars on GitHub. The [Depix project](https://github.com/beurtschipper/Depix) is on GitHub.\n\nHere is a quick read: [Depix AI Recovers Pixelized Passwords, Earns 10K GitHub Stars](https://syncedreview.com/2020/12/11/depix-ai-recovers-pixelized-passwords-earns-10k-github-stars/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/kba1y8/p_depix_ai_recovers_pixelized_passwords_earns_10k/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[p] depix ai recovers pixelized passwords, earns 10k github stars /!/ information by dramatically reducing the resolution of sensitive areas in an image. for years, the technique has had broad applications in security and censorship — but its days may be numbered. “[depix](https://github.com/beurtschipper/depix)” is a new ai-powered -----> tool !!!  that can easily undo pixelization to enable recovery of the information therein. uploaded this week, the project has already received nearly 10,000 stars on github. the [depix project](https://github.com/beurtschipper/depix) is on github.\n\nhere is a quick read: [depix ai recovers pixelized passwords, earns 10k github stars](https://syncedreview.com/2020/12/11/depix-ai-recovers-pixelized-passwords-earns-10k-github-stars/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/kba1y8/p_depix_ai_recovers_pixelized_passwords_earns_10k/',)", "identifyer": 5603344, "year": "2020"}, {"autor": "analyticsindiam", "date": 1599453744000, "content": "Visualizing Sentiment Analysis Reports Using Scattertext NLP Tool - Analytics India Magazine /!/ [https://analyticsindiamag.com/visualizing-sentiment-analysis-reports-using-scattertext-nlp-tool/](https://analyticsindiamag.com/visualizing-sentiment-analysis-reports-using-scattertext-nlp-tool/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/io125a/visualizing_sentiment_analysis_reports_using/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "visualizing sentiment analysis reports using scattertext nlp -----> tool !!!  - analytics india magazine /!/ [https://analyticsindiamag.com/visualizing-sentiment-analysis-reports-using-scattertext-nlp-tool/](https://analyticsindiamag.com/visualizing-sentiment-analysis-reports-using-scattertext-nlp-tool/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/io125a/visualizing_sentiment_analysis_reports_using/',)", "identifyer": 5603404, "year": "2020"}, {"autor": "industrywired", "date": 1599370987000, "content": "The Most Widely Misunderstood Tool in BI in Google Analytics", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ingpyf/the_most_widely_misunderstood_tool_in_bi_in/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the most widely misunderstood -----> tool !!!  in bi in google analytics", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://industrywired.com/the-most-widely-misunderstood-tool-in-bi-in-google-analytics/',)", "identifyer": 5603417, "year": "2020"}, {"autor": "AB_KI", "date": 1606589452000, "content": "AI based fantasy profile pictures /!/  Hi all,\n\nsome weeks ago I posted about the **AI based profile picture generator** for fantasy faces based on NVIDIA styleGAN2 here:\n\n[https://www.reddit.com/r/rpg/comments/jqfice/generator\\_for\\_fantasy\\_profile\\_pictures/](https://www.reddit.com/r/rpg/comments/jqfice/generator_for_fantasy_profile_pictures/)\n\n**New Website Link:**\n\n[https://www.fantasy-faces.com/](https://www.fantasy-faces.com/)\n\n**What you can do:**\n\n* **use the created images without copyright (link to the website would be nice, but not required)**\n* **download the model and create infinite images by yourself (manual provided on the website)**\n* **allow us to use your drawn images to support our product and provide us a link :-)**\n\n&amp;#x200B;\n\nAfter launching the first prototype we got a lot of feedback. So my buddy Chris and I decided to keep on going and work it over.\n\nWe were facing **following problems:**\n\n* We don´t want to develop our tool without **asking artists for permission**. This tool only can be provided, because others practised drawing years until perfection.  \n**--&gt;** After a ton of mails and messages we were able to collect enough human-like drawings to generate a model. (We are still collecting images and hope that some artists read this and want to contribute). We don´t think, that our solution will replace artists. Go find some inspiration and ask one of the artists listed for full scenery commissions with emotion and action. :-)\n* We had a **extreme colorblind model**. All our faces were Caucasian, mid twenty and had a marvelous face.  \n**--&gt;** This was the result of an extreme biased training set. In games, comics or films there are many stereotypes and it is hard to get a good mixture for representing the world. So we tried to set the focus on drawings with scars, different colors (blue, black, white, green, ...), different facial forms and so on. That lead to a better result than we had initially... but we need a lot more artworks or photographs to get better results. We don´t want to lose the drawing style, therefore we can´t mix to many real people in the training set.\n* We had **no different races like orks, trolls, goblins**  \n**--&gt;** Well, that isn´t fixed right now. We would need approx. 2.000 images per race to train a model creating goblins or orks. It´s kind of heavy to get that many free to use images for training, so this will take a lot of time. We will focus on this, when we see, that this app is used a lot.\n* We had an absolute **prototype environment**  \n**--&gt;** Now, we have a real domain, space for more images and created some content for you to read. We plan to create some how to´s for you and launch them.\n* We have **limited time**  \n**--&gt;** Well, a full time job, a family, a little bit of free time and the will to bring this site to high quality are quite heavy to bring together. We invested a lot of time in this hobby and we will continue, but don´t expect tons of news, features in no time.\n\nI would extremely happy if you can give us feedback to improve our site.\n\nHope you all enjoy!\n\nAndreas", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k2t7lr/ai_based_fantasy_profile_pictures/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai based fantasy profile pictures /!/  hi all,\n\nsome weeks ago i posted about the **ai based profile picture generator** for fantasy faces based on nvidia stylegan2 here:\n\n[https://www.reddit.com/r/rpg/comments/jqfice/generator\\_for\\_fantasy\\_profile\\_pictures/](https://www.reddit.com/r/rpg/comments/jqfice/generator_for_fantasy_profile_pictures/)\n\n**new website link:**\n\n[https://www.fantasy-faces.com/](https://www.fantasy-faces.com/)\n\n**what you can do:**\n\n* **use the created images without copyright (link to the website would be nice, but not required)**\n* **download the model and create infinite images by yourself (manual provided on the website)**\n* **allow us to use your drawn images to support our product and provide us a link :-)**\n\n&amp;#x200b;\n\nafter launching the first prototype we got a lot of feedback. so my buddy chris and i decided to keep on going and work it over.\n\nwe were facing **following problems:**\n\n* we don´t want to develop our -----> tool !!!  without **asking artists for permission**. this tool only can be provided, because others practised drawing years until perfection.  \n**--&gt;** after a ton of mails and messages we were able to collect enough human-like drawings to generate a model. (we are still collecting images and hope that some artists read this and want to contribute). we don´t think, that our solution will replace artists. go find some inspiration and ask one of the artists listed for full scenery commissions with emotion and action. :-)\n* we had a **extreme colorblind model**. all our faces were caucasian, mid twenty and had a marvelous face.  \n**--&gt;** this was the result of an extreme biased training set. in games, comics or films there are many stereotypes and it is hard to get a good mixture for representing the world. so we tried to set the focus on drawings with scars, different colors (blue, black, white, green, ...), different facial forms and so on. that lead to a better result than we had initially... but we need a lot more artworks or photographs to get better results. we don´t want to lose the drawing style, therefore we can´t mix to many real people in the training set.\n* we had **no different races like orks, trolls, goblins**  \n**--&gt;** well, that isn´t fixed right now. we would need approx. 2.000 images per race to train a model creating goblins or orks. it´s kind of heavy to get that many free to use images for training, so this will take a lot of time. we will focus on this, when we see, that this app is used a lot.\n* we had an absolute **prototype environment**  \n**--&gt;** now, we have a real domain, space for more images and created some content for you to read. we plan to create some how to´s for you and launch them.\n* we have **limited time**  \n**--&gt;** well, a full time job, a family, a little bit of free time and the will to bring this site to high quality are quite heavy to bring together. we invested a lot of time in this hobby and we will continue, but don´t expect tons of news, features in no time.\n\ni would extremely happy if you can give us feedback to improve our site.\n\nhope you all enjoy!\n\nandreas", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/k2t7lr/ai_based_fantasy_profile_pictures/',)", "identifyer": 5603683, "year": "2020"}, {"autor": "DQLabsinc", "date": 1606469565000, "content": "Why data quality tool is essential in COVID- 19 pandemic? /!/ The year 2020 has proved to be nothing like anything the world has ever experienced before. The onset of the ongoing COVID-19 pandemic that was fast spreading and taking lives, saw businesses quickly close down and others readjust their operations to cope with the new circumstances. Banks and the entire financial industry were not spared. Governments across the world continue to support banks and other businesses to adjust to the new normal, in meeting the needs of their customers, while adjusting and coping with the challenges brought about by the pandemic.  \n\n\nResearch by Experian shows that half of the organizations consider their CRM data to be unclean and can effectively leverage it. This is a significant level of data inaccuracy that has affected the financial sector in these ways:\n\n*  Operational risks \n*  Poor strategic decisions \n*  High data costs \n\nData Quality Tool:\n\nData quality tool identifies, understands and corrects flaws in data to enhance effective data governance across the operational business process and strategic decision making. These solutions feature a wide range of important functions, including profiling, standardization, parsing, cleansing, matching similar data, enrichment of available data, and finally, monitoring it.  \n\n\n[Choose the right data quality tool](https://www.dqlabs.ai/blog/how-the-data-quality-tools-are-helping-the-financial-sector-in-the-covid-19-pandemic/?utm_source=reddit&amp;utm_medium=referral) to maintain high-quality data.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k1y54f/why_data_quality_tool_is_essential_in_covid_19/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "why data quality -----> tool !!!  is essential in covid- 19 pandemic? /!/ the year 2020 has proved to be nothing like anything the world has ever experienced before. the onset of the ongoing covid-19 pandemic that was fast spreading and taking lives, saw businesses quickly close down and others readjust their operations to cope with the new circumstances. banks and the entire financial industry were not spared. governments across the world continue to support banks and other businesses to adjust to the new normal, in meeting the needs of their customers, while adjusting and coping with the challenges brought about by the pandemic.  \n\n\nresearch by experian shows that half of the organizations consider their crm data to be unclean and can effectively leverage it. this is a significant level of data inaccuracy that has affected the financial sector in these ways:\n\n*  operational risks \n*  poor strategic decisions \n*  high data costs \n\ndata quality tool:\n\ndata quality tool identifies, understands and corrects flaws in data to enhance effective data governance across the operational business process and strategic decision making. these solutions feature a wide range of important functions, including profiling, standardization, parsing, cleansing, matching similar data, enrichment of available data, and finally, monitoring it.  \n\n\n[choose the right data quality tool](https://www.dqlabs.ai/blog/how-the-data-quality-tools-are-helping-the-financial-sector-in-the-covid-19-pandemic/?utm_source=reddit&amp;utm_medium=referral) to maintain high-quality data.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/k1y54f/why_data_quality_tool_is_essential_in_covid_19/',)", "identifyer": 5603714, "year": "2020"}, {"autor": "analyticsindiam", "date": 1606330665000, "content": "Guide To Lightly: Tool For Curating Your Vision Data", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k0ycck/guide_to_lightly_tool_for_curating_your_vision/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "guide to lightly: -----> tool !!!  for curating your vision data", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://analyticsindiamag.com/lightlyai/',)", "identifyer": 5603751, "year": "2020"}, {"autor": "saiteja13427", "date": 1596038307000, "content": "A New AI Tool Can Reliably Recognize Individual Birds", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/i03468/a_new_ai_tool_can_reliably_recognize_individual/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a new ai -----> tool !!!  can reliably recognize individual birds", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://atomstalk.com/technology/a-new-ai-tool-can-reliably-recognize-individual-birds/',)", "identifyer": 5603799, "year": "2020"}, {"autor": "Yuqing7", "date": 1600286372000, "content": "[R] Czech Tech Does the Monster Mash: Animating 3D Models in Seconds /!/ Monster Mash, a novel AI-powered 3D modelling and animation tool, aims to make these arduous 3D animation processes a whole lot easier. The proposed framework comes from researchers at Czech Technical University in Prague, Google Research, University of Washington and ETH Zurich, and enables users to create animated 3D models from a single view.\n\nHere is a quick read: [Czech Tech Does the Monster Mash: Animating 3D Models in Seconds](https://syncedreview.com/2020/09/16/czech-tech-does-the-monster-mash-animating-3d-models-in-seconds/)\n\nThe paper *Monster Mash: A Single-View Approach to Casual 3D Modeling and Animation* is on the Czech Technical University[ DCGI website](https://dcgi.fel.cvut.cz/home/sykorad/Dvoroznak20-SA.pdf). The project page is [here](https://dcgi.fel.cvut.cz/home/sykorad/monster_mash).", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/iu3cbq/r_czech_tech_does_the_monster_mash_animating_3d/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[r] czech tech does the monster mash: animating 3d models in seconds /!/ monster mash, a novel ai-powered 3d modelling and animation -----> tool !!! , aims to make these arduous 3d animation processes a whole lot easier. the proposed framework comes from researchers at czech technical university in prague, google research, university of washington and eth zurich, and enables users to create animated 3d models from a single view.\n\nhere is a quick read: [czech tech does the monster mash: animating 3d models in seconds](https://syncedreview.com/2020/09/16/czech-tech-does-the-monster-mash-animating-3d-models-in-seconds/)\n\nthe paper *monster mash: a single-view approach to casual 3d modeling and animation* is on the czech technical university[ dcgi website](https://dcgi.fel.cvut.cz/home/sykorad/dvoroznak20-sa.pdf). the project page is [here](https://dcgi.fel.cvut.cz/home/sykorad/monster_mash).", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/iu3cbq/r_czech_tech_does_the_monster_mash_animating_3d/',)", "identifyer": 5603892, "year": "2020"}, {"autor": "fullerhouse570", "date": 1600112024000, "content": "Check out this Free ML tool: Browser extension for ML/AI Code Implementation Finder!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/iss6cl/check_out_this_free_ml_tool_browser_extension_for/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "check out this free ml -----> tool !!! : browser extension for ml/ai code implementation finder!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('/r/DeepLearningPapers/comments/iss622/check_out_this_free_ml_tool_browser_extension_for/',)", "identifyer": 5603936, "year": "2020"}, {"autor": "BhaswatiGuha19", "date": 1600087699000, "content": "Pentagon Doesn't Need Human Hackers Any More, Develops New AI Tool for Cyber Warfare", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/isk703/pentagon_doesnt_need_human_hackers_any_more/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "pentagon doesn't need human hackers any more, develops new ai -----> tool !!!  for cyber warfare", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.ibtimes.sg/pentagon-doesnt-need-human-hackers-any-more-develops-new-ai-tool-cyber-warfare-51498',)", "identifyer": 5603946, "year": "2020"}, {"autor": "kindbrain_", "date": 1590798602000, "content": "Documents AI :: I need a tool to check documents against certain criteria before uploading. /!/ Hi Community, This is My first post and I really thrilled. I am looking for a tool that enable a website user to check certain documents before they upload the documents. Documents file type is PDF\n\nGoal? To catch any missing required data as missed signature / incomplete dates / ... etc. TO automate and validate the documents revision before being uploaded.  \n\nCriteria of checking? \n\n1- Any missed Signatures // compare signature with the signatures book we have . \n\n2- Version date : format and make sure date &lt;= upload date. \n\n3- More criteria may be added by the document keeper\n\ndoes my question make sense? I really appreciate your inputs. \n\n&amp;#x200B;\n\nThanks.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gt4nuc/documents_ai_i_need_a_tool_to_check_documents/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "documents ai :: i need a -----> tool !!!  to check documents against certain criteria before uploading. /!/ hi community, this is my first post and i really thrilled. i am looking for a tool that enable a website user to check certain documents before they upload the documents. documents file type is pdf\n\ngoal? to catch any missing required data as missed signature / incomplete dates / ... etc. to automate and validate the documents revision before being uploaded.  \n\ncriteria of checking? \n\n1- any missed signatures // compare signature with the signatures book we have . \n\n2- version date : format and make sure date &lt;= upload date. \n\n3- more criteria may be added by the document keeper\n\ndoes my question make sense? i really appreciate your inputs. \n\n&amp;#x200b;\n\nthanks.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gt4nuc/documents_ai_i_need_a_tool_to_check_documents/',)", "identifyer": 5604108, "year": "2020"}, {"autor": "AcidStopSign", "date": 1607114764000, "content": "Nvidia AI Question /!/  So I have a fairly complex question, and I honestly don't even know where to start. So what brought this about was seeing ads for the Nvidia Nano Jetson among their other like products. I did some research and was learning a little about what it does but it opened up this wormhole of questions and I am having a hard time finding answers.\n\nSo lets say, hypothetically, I wanted to create my own Jarvis (within reason of course) or something like my own siri. Would this Nvidia tool be something I would utilize for that, and if so would I integrate it into my own pc or is it a standalone product? OR would this be possible with my own PC using software, I currently have an RTX 3080 graphics card. \n\nAlso, is this similar to creating BOTS. I follow a page on facebook called bots of new york where these bots make their own posts and generated images. I also remember seeing posts about people making these bots watch movies and creating their own scripts.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k6t6xf/nvidia_ai_question/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "nvidia ai question /!/  so i have a fairly complex question, and i honestly don't even know where to start. so what brought this about was seeing ads for the nvidia nano jetson among their other like products. i did some research and was learning a little about what it does but it opened up this wormhole of questions and i am having a hard time finding answers.\n\nso lets say, hypothetically, i wanted to create my own jarvis (within reason of course) or something like my own siri. would this nvidia -----> tool !!!  be something i would utilize for that, and if so would i integrate it into my own pc or is it a standalone product? or would this be possible with my own pc using software, i currently have an rtx 3080 graphics card. \n\nalso, is this similar to creating bots. i follow a page on facebook called bots of new york where these bots make their own posts and generated images. i also remember seeing posts about people making these bots watch movies and creating their own scripts.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/k6t6xf/nvidia_ai_question/',)", "identifyer": 5604188, "year": "2020"}, {"autor": "hackernoon", "date": 1604826824000, "content": "Universal Data Tool Weekly Update 5", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/jq8tgu/universal_data_tool_weekly_update_5/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "universal data -----> tool !!!  weekly update 5", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hackernoon.com/universal-data-tool-weekly-update-5-fo183zch?source=rss',)", "identifyer": 5604437, "year": "2020"}, {"autor": "tssimons", "date": 1600516873000, "content": "What dies Artificial Intelegence really mean? /!/ I know the term was coined by John McCarthy and I've read a few definitions online. But the tem doesn't seem to be very \"technical\" to me. I always thought it was a technical term or the definition of a well defined technical field. It seems to me a term used for new technologies that \"feel\" like computers can finally start doing \"cognitive\" things that we as humans can do. \n\nLike the first time I learned what computer vision was I thought \"wow! This stuff must be AI because computers are finally starting to \"think\" like a human!\" Or when I see the progress of deep learning and self driving cars I can't but help to think that this is something special. So it must be AI\n\nBut what did people think about the first calculators, the mechanical ones from the 17th century, came around? There was never a tool that could do arithmetic before? Only humans could do that previously. When I think about the the addition done by a mechanical computer, I think that obviously isn't AI, because that isn't a \"cognitive task\", it's just simple gears combined in a clever way. \n\nSo where is the line between a \"non AI\" and technology and an actual AI technology. Is it all just relative to what we are used to? Does the novelty make us excited about it and call something AI?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ivracp/what_dies_artificial_intelegence_really_mean/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what dies artificial intelegence really mean? /!/ i know the term was coined by john mccarthy and i've read a few definitions online. but the tem doesn't seem to be very \"technical\" to me. i always thought it was a technical term or the definition of a well defined technical field. it seems to me a term used for new technologies that \"feel\" like computers can finally start doing \"cognitive\" things that we as humans can do. \n\nlike the first time i learned what computer vision was i thought \"wow! this stuff must be ai because computers are finally starting to \"think\" like a human!\" or when i see the progress of deep learning and self driving cars i can't but help to think that this is something special. so it must be ai\n\nbut what did people think about the first calculators, the mechanical ones from the 17th century, came around? there was never a -----> tool !!!  that could do arithmetic before? only humans could do that previously. when i think about the the addition done by a mechanical computer, i think that obviously isn't ai, because that isn't a \"cognitive task\", it's just simple gears combined in a clever way. \n\nso where is the line between a \"non ai\" and technology and an actual ai technology. is it all just relative to what we are used to? does the novelty make us excited about it and call something ai?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 8, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ivracp/what_dies_artificial_intelegence_really_mean/',)", "identifyer": 5604529, "year": "2020"}, {"autor": "cerpheus27", "date": 1600448832000, "content": "Intelligent Algorithms – Today’s Reality for Ethics &amp; Compliance /!/ Intelligent algorithms became reality for today’s Ethics &amp; Compliance Officers. As all technology, they are neither good nor bad. Artificial Intelligence is a new risk area for E&amp;C, but on the other hand also a useful tool.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/iva3tn/intelligent_algorithms_todays_reality_for_ethics/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "intelligent algorithms – today’s reality for ethics &amp; compliance /!/ intelligent algorithms became reality for today’s ethics &amp; compliance officers. as all technology, they are neither good nor bad. artificial intelligence is a new risk area for e&amp;c, but on the other hand also a useful -----> tool !!! .", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/iva3tn/intelligent_algorithms_todays_reality_for_ethics/',)", "identifyer": 5604548, "year": "2020"}, {"autor": "cv2020br", "date": 1600307438000, "content": "New tool for AI students/professionals: Chrome/Firefox extension for finding CV/ML/AI Code Implementations!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/iu9uo8/new_tool_for_ai_studentsprofessionals/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new -----> tool !!!  for ai students/professionals: chrome/firefox extension for finding cv/ml/ai code implementations!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('/r/DeepLearningPapers/comments/iss622/check_out_this_free_ml_tool_browser_extension_for/',)", "identifyer": 5604583, "year": "2020"}, {"autor": "Robin5409", "date": 1602188638000, "content": "Chaining Techniques in Artificial Intelligence /!/  \n\nhttps://preview.redd.it/5ciud2vvjxr51.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=c1d85ea5b7971f13c753f21c3652ffd092545634\n\nWe have created **Artificial Intelligence** as a way to amplify human intelligence and promote growth like never before. AI can help us solve numerous problems of varying complexities.\n\nOne such type of problem is the case where one has to predict outcomes using the given pool of knowledge. Here, the knowledge base is given and using logical rules and reasoning, one has to predict the outcome.\n\nThese problems are usually solved using Inference Engines, which utilize their two special modes: **Backward Chaining** and **Forward Chaining**.\n\nAs we progress, let’s have a detailed look at both the chaining processes used in Artificial Intelligence.\n\n### What is an Inference Engine?\n\nAn Inference Engine is a tool of Artificial Intelligence that is used as a component of the system to deduce new information from a knowledge base using logical rules and reasoning. The first-ever Inference Engines were a part of expert systems in AI. As previously stated, Inference Engines predict outcomes with the already existing pool of data, comprehensively analyzing it and using logical reasoning to predict the outcomes.\n\nThis same process would be repeated as new facts would be discovered and this would make the inference engine trigger additional rules for its findings. After some runs of the inference engine, it was noticed that Inference Engines works in one of the two ways, either based on goals or based on facts, which later came to be known as **forwarding chaining** and **backward chaining**.\n\nForward chaining comes with known facts and iterates the process to find new facts while backward chaining starts with goals and works backwards to determine what conditions would be required to achieve the given goals.\n\n### Forward Chaining\n\nForward Chaining is one of the two main methods of inference engine which uses the logical process of inferring unknown truths to find a solution from the known set of data by using determined conditions and rules.\n\nYou can say that generally complex tasks can be reduced into multiple simpler tasks that are performed either simultaneously or sequentially, just like a chain or chaining is an effective method of teaching complex skills and processes using multiple steps.\n\nAs a data-driven as well as bottom-up logic approach, forward chaining starts from known facts and conditions, then progresses towards logical conclusion using if-then statements. Then these conditions and rules are applied to the problem until no further applicable situations are left or the limit has been reached. Forward Chaining searches for any solutions and can come up with an infinite number of possible conclusions.\n\n### Forward Chaining in AI\n\nThe Forward-thinking approach is used in AI to help an AI agent solve logical problems by inspecting the data from the previous learnings and then coming to a conclusion full of solutions. That’s not all, Forward Chaining might as well be used to explore the available information or answer a question or solve a problem. Forward chaining is extensively used to break down a long and complex logical approach by attaching each step once the previous one is completed. This way, it goes from beginning to the end with relative ease.\n\n### Backward Chaining in AI\n\nThe Backward Chaining approach is used in AI to find the conditions and rules because of which a particular logical result or conclusion was reached. Real-life applications of Backward Chaining include use to find information regarding conclusions and solutions in reverse engineering practices as well as game theory applications.\n\nSome other applications of Backward Chaining include automated theorem proving tools, inference engines, proof assistants and other **artificial intelligence applications**.\n\n### Difference between Forward Chaining and Backward Chaining\n\nhttps://preview.redd.it/4zpuem1tjxr51.jpg?width=553&amp;format=pjpg&amp;auto=webp&amp;s=e35f066b1d79e43f01c8fccc814b9342584ee3a5\n\nAmong the several Artificial intelligence programs that are offered by various institutions, the [artificial intelligence courses](https://www.greatlearning.in/pg-program-artificial-intelligence-course/) in Great Learning are really productive because these AI courses not only help you grow individually but their placement cells make sure that you get into one of these top companies. So, if your aim is to [learn Artificial Intelligence](https://www.greatlearning.in/pg-program-artificial-intelligence-course/) then Great Learning should be the destination.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j7kr29/chaining_techniques_in_artificial_intelligence/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "chaining techniques in artificial intelligence /!/  \n\nhttps://preview.redd.it/5ciud2vvjxr51.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=c1d85ea5b7971f13c753f21c3652ffd092545634\n\nwe have created **artificial intelligence** as a way to amplify human intelligence and promote growth like never before. ai can help us solve numerous problems of varying complexities.\n\none such type of problem is the case where one has to predict outcomes using the given pool of knowledge. here, the knowledge base is given and using logical rules and reasoning, one has to predict the outcome.\n\nthese problems are usually solved using inference engines, which utilize their two special modes: **backward chaining** and **forward chaining**.\n\nas we progress, let’s have a detailed look at both the chaining processes used in artificial intelligence.\n\n### what is an inference engine?\n\nan inference engine is a -----> tool !!!  of artificial intelligence that is used as a component of the system to deduce new information from a knowledge base using logical rules and reasoning. the first-ever inference engines were a part of expert systems in ai. as previously stated, inference engines predict outcomes with the already existing pool of data, comprehensively analyzing it and using logical reasoning to predict the outcomes.\n\nthis same process would be repeated as new facts would be discovered and this would make the inference engine trigger additional rules for its findings. after some runs of the inference engine, it was noticed that inference engines works in one of the two ways, either based on goals or based on facts, which later came to be known as **forwarding chaining** and **backward chaining**.\n\nforward chaining comes with known facts and iterates the process to find new facts while backward chaining starts with goals and works backwards to determine what conditions would be required to achieve the given goals.\n\n### forward chaining\n\nforward chaining is one of the two main methods of inference engine which uses the logical process of inferring unknown truths to find a solution from the known set of data by using determined conditions and rules.\n\nyou can say that generally complex tasks can be reduced into multiple simpler tasks that are performed either simultaneously or sequentially, just like a chain or chaining is an effective method of teaching complex skills and processes using multiple steps.\n\nas a data-driven as well as bottom-up logic approach, forward chaining starts from known facts and conditions, then progresses towards logical conclusion using if-then statements. then these conditions and rules are applied to the problem until no further applicable situations are left or the limit has been reached. forward chaining searches for any solutions and can come up with an infinite number of possible conclusions.\n\n### forward chaining in ai\n\nthe forward-thinking approach is used in ai to help an ai agent solve logical problems by inspecting the data from the previous learnings and then coming to a conclusion full of solutions. that’s not all, forward chaining might as well be used to explore the available information or answer a question or solve a problem. forward chaining is extensively used to break down a long and complex logical approach by attaching each step once the previous one is completed. this way, it goes from beginning to the end with relative ease.\n\n### backward chaining in ai\n\nthe backward chaining approach is used in ai to find the conditions and rules because of which a particular logical result or conclusion was reached. real-life applications of backward chaining include use to find information regarding conclusions and solutions in reverse engineering practices as well as game theory applications.\n\nsome other applications of backward chaining include automated theorem proving tools, inference engines, proof assistants and other **artificial intelligence applications**.\n\n### difference between forward chaining and backward chaining\n\nhttps://preview.redd.it/4zpuem1tjxr51.jpg?width=553&amp;format=pjpg&amp;auto=webp&amp;s=e35f066b1d79e43f01c8fccc814b9342584ee3a5\n\namong the several artificial intelligence programs that are offered by various institutions, the [artificial intelligence courses](https://www.greatlearning.in/pg-program-artificial-intelligence-course/) in great learning are really productive because these ai courses not only help you grow individually but their placement cells make sure that you get into one of these top companies. so, if your aim is to [learn artificial intelligence](https://www.greatlearning.in/pg-program-artificial-intelligence-course/) then great learning should be the destination.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j7kr29/chaining_techniques_in_artificial_intelligence/',)", "identifyer": 5604627, "year": "2020"}, {"autor": "analyticsindiam", "date": 1601756613000, "content": "Google’s ML Tool Turns Humming Into A Beautiful Instrument Solo /!/ [https://analyticsindiamag.com/googles-ml-tool-turns-humming-into-a-beautiful-instrument-solo/](https://analyticsindiamag.com/googles-ml-tool-turns-humming-into-a-beautiful-instrument-solo/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j4m2e6/googles_ml_tool_turns_humming_into_a_beautiful/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "google’s ml -----> tool !!!  turns humming into a beautiful instrument solo /!/ [https://analyticsindiamag.com/googles-ml-tool-turns-humming-into-a-beautiful-instrument-solo/](https://analyticsindiamag.com/googles-ml-tool-turns-humming-into-a-beautiful-instrument-solo/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/j4m2e6/googles_ml_tool_turns_humming_into_a_beautiful/',)", "identifyer": 5604707, "year": "2020"}, {"autor": "reddit007user", "date": 1601616905000, "content": "The Next Web: Google’s new machine learning tool turns your awful humming into a beautiful violin solo.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j3oyfl/the_next_web_googles_new_machine_learning_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the next web: google’s new machine learning -----> tool !!!  turns your awful humming into a beautiful violin solo.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://thenextweb.com/neural/2020/10/01/googles-new-machine-learning-tool-turns-your-awful-humming-into-a-beautiful-violin-solo/',)", "identifyer": 5604732, "year": "2020"}, {"autor": "hackernoon", "date": 1601441293000, "content": "Universal Data Tool: New Skeletal/Pose/Landmark Annotation, Dutch, and Convert Options", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j2fo62/universal_data_tool_new_skeletalposelandmark/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "universal data -----> tool !!! : new skeletal/pose/landmark annotation, dutch, and convert options", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hackernoon.com/universal-data-tool-new-skeletalposelandmark-annotation-dutch-and-convert-options-ky203tvf?source=rss',)", "identifyer": 5604781, "year": "2020"}, {"autor": "hackernoon", "date": 1601428116000, "content": "Universal Data Tool Introduction: Weekly Update 2", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/j2cdux/universal_data_tool_introduction_weekly_update_2/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "universal data -----> tool !!!  introduction: weekly update 2", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://hackernoon.com/universal-data-tool-introduction-weekly-update-2-2x113trn?source=rss',)", "identifyer": 5604783, "year": "2020"}, {"autor": "matildezanotti", "date": 1593683313000, "content": "Ever tried to cuss your virtual assistant out? iGenius Head of Conversational UX, Arianna Stefanoni, explains why empathy is a powerful tool in human-computer interaction. https://medium.com/ideas-at-igenius/a-human-approach-to-conversational-ai-db888dd7780", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hju4wn/ever_tried_to_cuss_your_virtual_assistant_out/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ever tried to cuss your virtual assistant out? igenius head of conversational ux, arianna stefanoni, explains why empathy is a powerful -----> tool !!!  in human-computer interaction. https://medium.com/ideas-at-igenius/a-human-approach-to-conversational-ai-db888dd7780", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('image',)", "medialink": "('https://i.redd.it/r5bswup11f851.png',)", "identifyer": 5605051, "year": "2020"}, {"autor": "matildezanotti", "date": 1593683137000, "content": "Ever tried to cuss your virtual assistant out? iGenius Head of Conversational UX, Arianna Stefanoni, explains why empathy is a powerful tool in human-computer interaction.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hju3s5/ever_tried_to_cuss_your_virtual_assistant_out/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ever tried to cuss your virtual assistant out? igenius head of conversational ux, arianna stefanoni, explains why empathy is a powerful -----> tool !!!  in human-computer interaction.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://medium.com/ideas-at-igenius/a-human-approach-to-conversational-ai-db888dd7780',)", "identifyer": 5605052, "year": "2020"}, {"autor": "matildezanotti", "date": 1593682878000, "content": "A Human Approach to Conversational AI /!/ **Ever tried to cuss your virtual assistant out?**\n\niGenius Head of Conversational UX, Arianna Stefanoni, explains why empathy is a powerful tool in human-computer interaction\n\n*Reading time: 4 min*\n\n&amp;#x200B;\n\niGenius Blog: [https://medium.com/ideas-at-igenius](https://medium.com/ideas-at-igenius)\n\nCrystal website: [https://crystal.ai](https://crystal.ai/it/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hju278/a_human_approach_to_conversational_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a human approach to conversational ai /!/ **ever tried to cuss your virtual assistant out?**\n\nigenius head of conversational ux, arianna stefanoni, explains why empathy is a powerful -----> tool !!!  in human-computer interaction\n\n*reading time: 4 min*\n\n&amp;#x200b;\n\nigenius blog: [https://medium.com/ideas-at-igenius](https://medium.com/ideas-at-igenius)\n\ncrystal website: [https://crystal.ai](https://crystal.ai/it/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hju278/a_human_approach_to_conversational_ai/',)", "identifyer": 5605054, "year": "2020"}, {"autor": "ripudaman7154", "date": 1581008907000, "content": "Extracting tables from 3000-4000 pdfs /!/ I work along with a number of sustainability index. A majority of work we do involves extraction of quantitative environmental and social data from pdf files. Is there a way to train a program to auto identify these tables and extract info into CSV or any easy to handle format?\n\nI am working with some ML experts who say that as the data in these reports are not structurally in a tabular format it is difficult to extract them. They are however able to extract data if the information is in perfect table format with lines for borders and row/column separation. \n\nBluemix's table tool does work a bit better but it requires user to identify the first few tables in a document and for multiple documents it becomes a long task. \n\nI believe if a model can be trained to identify the tables it will become easier to extract information using OCR. \n\nIt's been a few months but I have been failing to find a viable solution.\n\nAny help is greatly appreciated.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ezvclm/extracting_tables_from_30004000_pdfs/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "extracting tables from 3000-4000 pdfs /!/ i work along with a number of sustainability index. a majority of work we do involves extraction of quantitative environmental and social data from pdf files. is there a way to train a program to auto identify these tables and extract info into csv or any easy to handle format?\n\ni am working with some ml experts who say that as the data in these reports are not structurally in a tabular format it is difficult to extract them. they are however able to extract data if the information is in perfect table format with lines for borders and row/column separation. \n\nbluemix's table -----> tool !!!  does work a bit better but it requires user to identify the first few tables in a document and for multiple documents it becomes a long task. \n\ni believe if a model can be trained to identify the tables it will become easier to extract information using ocr. \n\nit's been a few months but i have been failing to find a viable solution.\n\nany help is greatly appreciated.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 9, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ezvclm/extracting_tables_from_30004000_pdfs/',)", "identifyer": 5605108, "year": "2020"}, {"autor": "Yuqing7", "date": 1597694022000, "content": "[R] Google Introduces NLP Model Understanding Tool /!/ Artificial intelligence does a lot of things extremely well, but just *how* it does these things often remains unclear — shrouded by what’s come to be known as the “black box” problem. This is particularly true in NLP, where researchers can waste a lot of time trying to figure out what went wrong when their models don’t run as well as expected. Last week, Google Research released a paper tackling this issue with a new open-source analytic platform: the Language Interpretability Tool (LIT).\n\nHere is a quick read: [Google Introduces NLP Model Understanding Tool](https://syncedreview.com/2020/08/17/google-introduces-nlp-model-understanding-tool/)\n\nThe paper *The Language Interpretability Tool: Extensible, Interactive Visualizations and Analysis for NLP Models* is on [arXiv](https://arxiv.org/pdf/2008.05122.pdf). The tool has been open-sourced on [Github](https://github.com/pair-code/lit).", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ibli8t/r_google_introduces_nlp_model_understanding_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[r] google introduces nlp model understanding -----> tool !!!  /!/ artificial intelligence does a lot of things extremely well, but just *how* it does these things often remains unclear — shrouded by what’s come to be known as the “black box” problem. this is particularly true in nlp, where researchers can waste a lot of time trying to figure out what went wrong when their models don’t run as well as expected. last week, google research released a paper tackling this issue with a new open-source analytic platform: the language interpretability tool (lit).\n\nhere is a quick read: [google introduces nlp model understanding tool](https://syncedreview.com/2020/08/17/google-introduces-nlp-model-understanding-tool/)\n\nthe paper *the language interpretability tool: extensible, interactive visualizations and analysis for nlp models* is on [arxiv](https://arxiv.org/pdf/2008.05122.pdf). the tool has been open-sourced on [github](https://github.com/pair-code/lit).", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ibli8t/r_google_introduces_nlp_model_understanding_tool/',)", "identifyer": 5605225, "year": "2020"}, {"autor": "jsamwrites", "date": 1589457522000, "content": "AI tool searches thousands of scientific papers to guide researchers to coronavirus insights", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gjkyua/ai_tool_searches_thousands_of_scientific_papers/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai -----> tool !!!  searches thousands of scientific papers to guide researchers to coronavirus insights", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://theconversation.com/ai-tool-searches-thousands-of-scientific-papers-to-guide-researchers-to-coronavirus-insights-137756',)", "identifyer": 5605321, "year": "2020"}, {"autor": "jsamwrites", "date": 1589457146000, "content": "AI tool searches thousands of scientific papers to guide researchers to coronavirus insights", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gjkvp2/ai_tool_searches_thousands_of_scientific_papers/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai -----> tool !!!  searches thousands of scientific papers to guide researchers to coronavirus insights", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://theconversation.com/ai-tool-searches-thousands-of-scientific-papers-to-guide-researchers-to-coronavirus-insights-137756',)", "identifyer": 5605322, "year": "2020"}, {"autor": "Yuqing7", "date": 1589408058000, "content": "[P] Nifty Online Tool Animates Your Actions in Real-Time", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gj93n5/p_nifty_online_tool_animates_your_actions_in/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "[p] nifty online -----> tool !!!  animates your actions in real-time", "sortedWord": "None", "removed": "('moderator',)", "score": 1, "comments": 0, "media": "('image',)", "medialink": "('https://i.redd.it/2qk65xvmwly41.gif',)", "identifyer": 5605332, "year": "2020"}, {"autor": "ArghonAI", "date": 1589313776000, "content": "ARGHONAI LIVE on Twitch: Can your AI can make Music? /!/ We are Live! We are talking about how AI can be used as a tool in music creation [http://Twitch.tv/ArghonAi](http://Twitch.tv/ArghonAi)  \n\n\\#techtalks #tech #music #AI #ArtificialIntelligence #Vision2020 #entertainer #twitchstreamer #twitch", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/gij58q/arghonai_live_on_twitch_can_your_ai_can_make_music/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "arghonai live on twitch: can your ai can make music? /!/ we are live! we are talking about how ai can be used as a -----> tool !!!  in music creation [http://twitch.tv/arghonai](http://twitch.tv/arghonai)  \n\n\\#techtalks #tech #music #ai #artificialintelligence #vision2020 #entertainer #twitchstreamer #twitch", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/gij58q/arghonai_live_on_twitch_can_your_ai_can_make_music/',)", "identifyer": 5605358, "year": "2020"}, {"autor": "Hiba_Baz_Radwan01", "date": 1605100950000, "content": "Tracking Firehouse Assets Using Inventory and Asset Tracking Systems /!/ This blog explains the importance of having an Inventory System and Asset Tracking System for tracking firehouse tools and equipment. By examining the accuracy of this system, the blog points out the advantages and disadvantages of having a system. It also gives examples about the newest systems used.\n\nFire department assets are essential starting with the truck, special appliances fire-fighters depend on, and their equipment. There is no way fire-fighters can go on a mission without the tools needed. Since lives could be in any danger, fire-fighters should trust the equipment they are using and know where the tools are. Hence, fire-fighters need a fire department inventory and asset tracking system which will allow them to locate and double check their appliances.\n\nWhat is a fire department inventory and asset tracking system?\n\nA fire department inventory and asset tracking system is a system having several consumable and non-consumable items such as station supplies, truck wash, and Emergency Medical Services (EMS). These items require recharging and should be located easily for them to be used. When an system is installed it can:\n\n·         Deduce if any of the tools is missing and rapidly locate their place.\n\n·         Accurately maintain documents and records.\n\n·         EMS benefits from tracking inventory and assets.\n\n·          Access and determine data.\n\n·         Reduce wastes if managed properly.\n\n·         Allow fire-fighters to have a budgeting flexibility.\n\n·         Reduces risks such as injuries concerning fire-fighters.\n\nWays to get started and develop on Inventory and Asset Tracking Systems:\n\nUsing paper and pen and Excel spreadsheets are extremely a waste of time. However, some departments still depend on these manual ways. Errors appear more when dealt with human factors and it is hard to make improvement with data. Moreover, manual management systems are a costly way to manage fire departments starting from storage to wasted time and productivity. Hence it is crucial to transfer to a more productive, not costly system.\n\n1.      Set a plan:\n\nIn order to know the amount of items to be purchased for the fire department and maintain them it is necessary to set a plan. Without it, progress can be made but creating a management system will be a struggle.\n\n2.      Reset products:\n\nFor the system to kick off, the department must get rid of any recent waste. Without taking this into consideration, the department will hold overstocked or unnecessary equipment, not only filling storage but also investing money in the wrong place.\n\n3.      The Power of Data:\n\nAs soon as you start looking for the right data, the earlier you can figure out the progress and improvement. The more accurate the data is, the more productive the systems will be.\n\nBarcode technology is a great step in fire department inventory and asset tracking systems. They are made of a group of lines defining a particular code related to the company they are referring to. With barcodes, it is better to know the system than to use manual methods. Moreover, there are various types of barcodes which are:\n\n1.      1D barcodes:\n\nThese Barcodes are one-dimensional, that is they are a series of vertical lines where distances between them vary.\n\n2.      2D barcodes:\n\nThe 2D is a pattern of black quadrilaterals on a white template. It is the most common form.\n\nIn the fire department industry, scanning barcodes using devices such as smoke detectors provide fire chiefs with an explanation and the life of the tool hence enhancing quick action for any imperfections.\n\nAdvantages of using barcodes:\n\n·         Barcodes reduce human errors where keyboard data give one error in every 300 entries however that of a barcode creates one in three million\n\n·         Using these systems eliminate employee training time\n\n·         They are not as costly as manual methods\n\n·         Provide better and accurate data\n\nHowever, barcodes need a line of sight to be known. Scanners often need to be 15 feet of the barcode for it to interpret the data. Barcodes are usually present on papers or plastic materials that are easily damaged and they cannot be read by a scanner. So here are some barcode disadvantages:\n\n·         Items are scanned individually thus taking more time\n\n·         Barcodes are easily copied\n\n·         Provide the basic information concerning an item only\n\n·         Barcodes contain information that cannot be updated\n\n·         Interpret the type of tool only\n\nWhat is RFID?\n\nRFIDs are data containing tags that are tackled via radio waves. The scanner has antennas which transfer radio-frequency signs in order to read tags and data.\n\nAdvantages of RFID:\n\n·         Can read data without line of sight.\n\n·         Lasts more than barcodes in the case of any damage occurrence.\n\n·         Can be read from much greater distances than barcodes.\n\n·         Information can be increased and updated.\n\n·         More secure and hard to be copied or duplicated.\n\n·         Can have more detailed data than barcodes.\n\nOn the other hand, RFIDs are more expensive and can be easily subjected to any signal collision. The RFID implementation process is more complicated than the barcode one.\n\nThere are several systems used to track firehouse assets. This System can track the expiration date of tools thus the fire chiefs know exactly when to order new equipment.\n\nFinally, fire chiefs should adapt to inventory and asset tracking systems tracking their firehouse assets rather than using manual methods such as keyboard data and Excel sheets to save money and time and to reach more productivity enhancing a better understanding of what they have from appliances. Instalment of barcodes is a necessity for more detailed and accurate data. Transferring to a more efficient plan should be taken immediately not to cope with errors and losses.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/js80wh/tracking_firehouse_assets_using_inventory_and/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "tracking firehouse assets using inventory and asset tracking systems /!/ this blog explains the importance of having an inventory system and asset tracking system for tracking firehouse tools and equipment. by examining the accuracy of this system, the blog points out the advantages and disadvantages of having a system. it also gives examples about the newest systems used.\n\nfire department assets are essential starting with the truck, special appliances fire-fighters depend on, and their equipment. there is no way fire-fighters can go on a mission without the tools needed. since lives could be in any danger, fire-fighters should trust the equipment they are using and know where the tools are. hence, fire-fighters need a fire department inventory and asset tracking system which will allow them to locate and double check their appliances.\n\nwhat is a fire department inventory and asset tracking system?\n\na fire department inventory and asset tracking system is a system having several consumable and non-consumable items such as station supplies, truck wash, and emergency medical services (ems). these items require recharging and should be located easily for them to be used. when an system is installed it can:\n\n·         deduce if any of the tools is missing and rapidly locate their place.\n\n·         accurately maintain documents and records.\n\n·         ems benefits from tracking inventory and assets.\n\n·          access and determine data.\n\n·         reduce wastes if managed properly.\n\n·         allow fire-fighters to have a budgeting flexibility.\n\n·         reduces risks such as injuries concerning fire-fighters.\n\nways to get started and develop on inventory and asset tracking systems:\n\nusing paper and pen and excel spreadsheets are extremely a waste of time. however, some departments still depend on these manual ways. errors appear more when dealt with human factors and it is hard to make improvement with data. moreover, manual management systems are a costly way to manage fire departments starting from storage to wasted time and productivity. hence it is crucial to transfer to a more productive, not costly system.\n\n1.      set a plan:\n\nin order to know the amount of items to be purchased for the fire department and maintain them it is necessary to set a plan. without it, progress can be made but creating a management system will be a struggle.\n\n2.      reset products:\n\nfor the system to kick off, the department must get rid of any recent waste. without taking this into consideration, the department will hold overstocked or unnecessary equipment, not only filling storage but also investing money in the wrong place.\n\n3.      the power of data:\n\nas soon as you start looking for the right data, the earlier you can figure out the progress and improvement. the more accurate the data is, the more productive the systems will be.\n\nbarcode technology is a great step in fire department inventory and asset tracking systems. they are made of a group of lines defining a particular code related to the company they are referring to. with barcodes, it is better to know the system than to use manual methods. moreover, there are various types of barcodes which are:\n\n1.      1d barcodes:\n\nthese barcodes are one-dimensional, that is they are a series of vertical lines where distances between them vary.\n\n2.      2d barcodes:\n\nthe 2d is a pattern of black quadrilaterals on a white template. it is the most common form.\n\nin the fire department industry, scanning barcodes using devices such as smoke detectors provide fire chiefs with an explanation and the life of the -----> tool !!!  hence enhancing quick action for any imperfections.\n\nadvantages of using barcodes:\n\n·         barcodes reduce human errors where keyboard data give one error in every 300 entries however that of a barcode creates one in three million\n\n·         using these systems eliminate employee training time\n\n·         they are not as costly as manual methods\n\n·         provide better and accurate data\n\nhowever, barcodes need a line of sight to be known. scanners often need to be 15 feet of the barcode for it to interpret the data. barcodes are usually present on papers or plastic materials that are easily damaged and they cannot be read by a scanner. so here are some barcode disadvantages:\n\n·         items are scanned individually thus taking more time\n\n·         barcodes are easily copied\n\n·         provide the basic information concerning an item only\n\n·         barcodes contain information that cannot be updated\n\n·         interpret the type of tool only\n\nwhat is rfid?\n\nrfids are data containing tags that are tackled via radio waves. the scanner has antennas which transfer radio-frequency signs in order to read tags and data.\n\nadvantages of rfid:\n\n·         can read data without line of sight.\n\n·         lasts more than barcodes in the case of any damage occurrence.\n\n·         can be read from much greater distances than barcodes.\n\n·         information can be increased and updated.\n\n·         more secure and hard to be copied or duplicated.\n\n·         can have more detailed data than barcodes.\n\non the other hand, rfids are more expensive and can be easily subjected to any signal collision. the rfid implementation process is more complicated than the barcode one.\n\nthere are several systems used to track firehouse assets. this system can track the expiration date of tools thus the fire chiefs know exactly when to order new equipment.\n\nfinally, fire chiefs should adapt to inventory and asset tracking systems tracking their firehouse assets rather than using manual methods such as keyboard data and excel sheets to save money and time and to reach more productivity enhancing a better understanding of what they have from appliances. instalment of barcodes is a necessity for more detailed and accurate data. transferring to a more efficient plan should be taken immediately not to cope with errors and losses.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/js80wh/tracking_firehouse_assets_using_inventory_and/',)", "identifyer": 5605485, "year": "2020"}, {"autor": "analyticsinsight", "date": 1599115286000, "content": "How to Develop an AIOps Tool Strategy for Business", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ilof1w/how_to_develop_an_aiops_tool_strategy_for_business/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how to develop an aiops -----> tool !!!  strategy for business", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.analyticsinsight.net/develop-aiops-tool-strategy/',)", "identifyer": 5605761, "year": "2020"}, {"autor": "analyticsindiam", "date": 1599065469000, "content": "Tutorial on RapidMiner - A Tool for Machine Learning Without Coding /!/ [https://analyticsindiamag.com/tutorial-on-rapidminer-a-tool-for-machine-learning-without-coding/](https://analyticsindiamag.com/tutorial-on-rapidminer-a-tool-for-machine-learning-without-coding/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ilaimg/tutorial_on_rapidminer_a_tool_for_machine/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "tutorial on rapidminer - a -----> tool !!!  for machine learning without coding /!/ [https://analyticsindiamag.com/tutorial-on-rapidminer-a-tool-for-machine-learning-without-coding/](https://analyticsindiamag.com/tutorial-on-rapidminer-a-tool-for-machine-learning-without-coding/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ilaimg/tutorial_on_rapidminer_a_tool_for_machine/',)", "identifyer": 5605770, "year": "2020"}, {"autor": "Nt12345678909876", "date": 1598959465000, "content": "What is Google’s Open Source Language Interpretability Tool? /!/ *Google has introduced* ***the Language Interpretability Tool(LIT)****, a toolkit and UI counted on the browser, that is also bestowed in this post.*\n\nFollow the [link](https://www.analyticssteps.com/blogs/what-is-googles-open-source-language-interpretability-tool)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ikihc5/what_is_googles_open_source_language/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what is google’s open source language interpretability -----> tool !!! ? /!/ *google has introduced* ***the language interpretability tool(lit)****, a toolkit and ui counted on the browser, that is also bestowed in this post.*\n\nfollow the [link](https://www.analyticssteps.com/blogs/what-is-googles-open-source-language-interpretability-tool)", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ikihc5/what_is_googles_open_source_language/',)", "identifyer": 5605793, "year": "2020"}, {"autor": "8329417966", "date": 1595776878000, "content": "AutoViz: A new tool for Automated Visualization in Data Science. /!/ https://youtu.be/aiKa6QCV0qQ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/hy8ovt/autoviz_a_new_tool_for_automated_visualization_in/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "autoviz: a new -----> tool !!!  for automated visualization in data science. /!/ https://youtu.be/aika6qcv0qq", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/hy8ovt/autoviz_a_new_tool_for_automated_visualization_in/',)", "identifyer": 5606015, "year": "2020"}, {"autor": "globaltechoutlook", "date": 1606751899000, "content": "Google Builds a New AI Tool that Turns Images into Illusory Creatures", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/k3yihk/google_builds_a_new_ai_tool_that_turns_images/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "google builds a new ai -----> tool !!!  that turns images into illusory creatures", "sortedWord": "None", "removed": "('reddit',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.globaltechoutlook.com/google-builds-a-new-ai-tool-that-turns-images-into-illusory-creatures/',)", "identifyer": 5606112, "year": "2020"}, {"autor": "analyticsindiam", "date": 1595269322000, "content": "Kinect Sensor: The AI Tool You Did Not Know You Had /!/ [https://analyticsindiamag.com/kinect-sensor-the-ai-tool-you-did-not-know-you-had/](https://analyticsindiamag.com/kinect-sensor-the-ai-tool-you-did-not-know-you-had/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/huqjym/kinect_sensor_the_ai_tool_you_did_not_know_you_had/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "kinect sensor: the ai -----> tool !!!  you did not know you had /!/ [https://analyticsindiamag.com/kinect-sensor-the-ai-tool-you-did-not-know-you-had/](https://analyticsindiamag.com/kinect-sensor-the-ai-tool-you-did-not-know-you-had/)", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/huqjym/kinect_sensor_the_ai_tool_you_did_not_know_you_had/',)", "identifyer": 5606160, "year": "2020"}, {"autor": "matzubi", "date": 1598317025000, "content": "Symptom extraction from speech /!/ What tool/api allows analyzing audio speech gathered from a person and transcribing that live.  I am looking to implement the api/tool on smartphone apps so when a user answers a question in speech we can automatically populate the answer.  Bonus point if you can also refer a speech synthesizer for asking the questions with human like inflections for happy and sad voices.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ig20fb/symptom_extraction_from_speech/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "symptom extraction from speech /!/ what -----> tool !!! /api allows analyzing audio speech gathered from a person and transcribing that live.  i am looking to implement the api/tool on smartphone apps so when a user answers a question in speech we can automatically populate the answer.  bonus point if you can also refer a speech synthesizer for asking the questions with human like inflections for happy and sad voices.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ig20fb/symptom_extraction_from_speech/',)", "identifyer": 5606612, "year": "2020"}], "name": "toolArtificialInteligence2020"}