{"interestingcomments": [{"autor": "cipherhut", "date": 1558008130000, "content": "What are the current trends in AI? /!/ As a part of the digital world, we are witnessing the rise in technology, tools, and applications based on [**artificial intelligence**](https://cipherhut.com/), and Machine learning. With the rise 2019, Blockchain has also captured a considerable momentum on the tech ground by finding a place on the various enterprising sectors other than cryptocurrency. AI and Blockchain have found notable applications in the renowned sectors like healthcare, automobile, manufacturing, legal platforms, and agriculture.\n\nCompanies like Amazon, Facebook, Google, IBM, Microsoft, and more have brought AI, ML, and Blockchain in their ecosystem and created a new market trend.\n\n•    The rise of AI enabled chips that will improve the speed of training an AI model and perform the complex computational tasks\n\n•    The convergence of IoT and AI at the edge computing layer in the industrial level to perform outlier detection, root cause analysis, and predictive maintenance of the equipment as IoT is all set to become the biggest driver of artificial intelligence in the business world.\n\n•    Data scientist and developers have picked a neural network as the right tool to perform the complex task in an easy and simplified manner.\n\n•    Automated machine learning has evolved learning models that can address complex scenarios without going through the typical process of training ML models. It delivers the right level of customization through the elaborated workflow.\n\n•    And AI has the capability to automate DevOps through AIOps with the help of modern applications and infrastructure for generating log data to earn benefits from the convergence of AI and DevOps.\n\n&amp;#x200B;\n\n[**CipherHut Software**](https://cipherhut.com/) is delivering artificial Intelligence and Machine learning solutions in collaboration with the Internet of Things. From the business application to the software solution we provide services to impact the industry significantly, for the quick solutions and services you connect with us right away!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bpbofg/what_are_the_current_trends_in_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what are the current trends in ai? /!/ as a part of the digital world, we are witnessing the rise in technology, tools, and applications based on [**artificial intelligence**](https://cipherhut.com/), and machine learning. with the rise 2019, blockchain has also captured a considerable momentum on the tech ground by finding a place on the various enterprising sectors other than cryptocurrency. ai and blockchain have found notable applications in the renowned sectors like healthcare, automobile, manufacturing, legal platforms, and agriculture.\n\ncompanies like amazon, facebook, google, ibm, microsoft, and more have brought ai, ml, and blockchain in their ecosystem and created a new market trend.\n\n•    the rise of ai enabled chips that will improve the speed of training an ai model and perform the complex computational tasks\n\n•    the convergence of iot and ai at the edge computing layer in the industrial level to perform outlier detection, root cause analysis, and predictive maintenance of the equipment as iot is all set to become the biggest driver of artificial intelligence in the business world.\n\n•    data scientist and developers have picked a neural network as the right -----> tool !!!  to perform the complex task in an easy and simplified manner.\n\n•    automated machine learning has evolved learning models that can address complex scenarios without going through the typical process of training ml models. it delivers the right level of customization through the elaborated workflow.\n\n•    and ai has the capability to automate devops through aiops with the help of modern applications and infrastructure for generating log data to earn benefits from the convergence of ai and devops.\n\n&amp;#x200b;\n\n[**cipherhut software**](https://cipherhut.com/) is delivering artificial intelligence and machine learning solutions in collaboration with the internet of things. from the business application to the software solution we provide services to impact the industry significantly, for the quick solutions and services you connect with us right away!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/bpbofg/what_are_the_current_trends_in_ai/',)", "identifyer": 5835443, "year": "2019"}, {"autor": "bencryer123", "date": 1568186935000, "content": "Artificial Intelligence Summit 2019 by Simpliv /!/   \n\n## ABOUT THE EVENT\n\nSimpliv, the learning platform, is organizing the AI Summit India on 18th November at Taj, Vivanta, Bangalore. This two-day summit will be an ideal opportunity to explore critical areas of AI such as digital transformation, AI and deep learning, AI and cybercrime, AI as a tool for enforcing accountability, the various industries that could get impacted by AI, enterprise and process automation using AI, AI and costumer experience, AI’s role in messaging in the advertising, marketing and healthcare and other sectors, AI for the Cognitive Enterprise, and much more.\n\nThis AI Summit will evaluate the nature and scale of changes that AI could bring about in various sectors such as retail, enterprise, consumer and commerce. It will scrutinize the opportunities and transformation that AI could bring about in development and digital platforms.\n\nSimpliv will offer the opportunity for a vivid and thoughtful exchange of viewpoints among panel members, who will be a bright mix of:\n\n· Those who are pioneering path breaking innovations in the field of AI\n\n· Leading brands that are at the forefront of AI\n\n· Well-established leader\n\n· Tech evangelists\n\n· Unicorns, and\n\n· Keenly watched startups.\n\nVisitors at the AI Summit will include AI managers, angel investors, decision makers, innovators, startups, designers, developers, Data Analysts, Managers and Scientists, and brand managers.\n\n##### DAY 1 – Monday, 18th Nov 2019  [Enroll Here](https://www.simpliv.com/summit)\n\n§ Session 1 How AI can help with Digital Transformation\n\n§ Session 2 AI and Deep Learning – The drivers of digital transformation.\n\n§ Session 3 The future impact of AI on cybercrime\n\n§ Session 4 AI as a means to powering transparency and accountability\n\n§ Session 5 AI for the workplace\n\n§ Session 6 AI for your business – Use of AI for different industries\n\n§ Session 7 How to fulfill Enterprise AI\n\n§ Session 8 Process Automation and AI\n\n§ Session 9 Cognitive Enterprise – Cognitive Automation and Robotic Process Automation\n\n##### DAY 2 – Tuesday, 19th Nov 2019  [Enroll Here](https://www.simpliv.com/summit) \n\n§ Session 10 AI integration and customer experience\n\n§ Session 11 Use of AI in the retail and e-commerce industries\n\n§ Session 12 Leveraging the voice driven world for business growth\n\n§ Session 13 Chatbot effectiveness for better business\n\n§ Session 14 Role of Digital Assistants in customer relationship management\n\n§ Session 15 Improving marketing and advertising effectiveness through AI\n\n§ Session 16 Revolution in healthcare through AI and Big Data.\n\n## This Summit By World Best Renowned Speakers:\n\nSameer Dhanrajani\n\nChief Strategy Officer At Fractal Analytics\n\nShibsankar Das\n\nData Scientist @WalmartLabs | 40 Under 40 Data Scientists 2019\n\nManu Chandra\n\nCo-Founder And Chief Data Scientist At FN MathLogic Consulting Services Pvt Ltd\n\nSunil David\n\nRegional Director - IoT At AT&amp;T\n\nIndranath Mukherjee\n\nAVP, Head - Strategic Analytics At  AXA XL\n\nSrini Rengarajan\n\nVice President And Global Head - AI And Data Science At 3i Infotech Ltd.\n\nMandar Mutalikdesai\n\nService Area Leader - Artificial Intelligence And Analytics At IBM\n\nVidhya Veeraraghavan\n\nAssociate Vice President - Analytics At Standard Chartered Global Business Services\n\nVishal Singhal\n\nCo-Founder &amp; AI Evangelist @CellStrat\n\nAswini Vyas\n\nDirector At Digtal Marketers India\n\nPradeepta Mishra\n\nDirector-AI @Lymbyc\n\nRam Dayal Goyal\n\nFounder - RNS Labs\n\nBalakumaran Jayapal\n\nDeputy General Manager (Principal Architect) At Panasonic India Innovation Centre\n\nPiyush Chowhan\n\nSenior Vice President And Chief Information Officer At Arvind Lifestyle Brands Limited\n\nKrithika Surianarayanan\n\nVice President At Standard Chartered Bank\n\nMridul Kabra\n\nDirector Of Digital Marketing At Neta App\n\nDr. Saurav Karmakar\n\nDemo Session Chair At IEEE International Conference On Data Mining (ICDM 2019)\n\nSivesh Kumar\n\nFounder &amp; CEO StartUp Monk\n\nPraveen Srivatsa\n\nDirector At Asthrasoft Consulting\n\nSnehal\n\n## Summit Date: NOVEMBER 18th - 19th, 2019\n\n**Place: Taj, Vivanta, MG Road, Yellappa Chetty Layout, Sivanchetti Gardens, Bangalore, Karnataka, 560001**\n\n[Click Here to continue](https://www.simpliv.com/summit)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d2me9g/artificial_intelligence_summit_2019_by_simpliv/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence summit 2019 by simpliv /!/   \n\n## about the event\n\nsimpliv, the learning platform, is organizing the ai summit india on 18th november at taj, vivanta, bangalore. this two-day summit will be an ideal opportunity to explore critical areas of ai such as digital transformation, ai and deep learning, ai and cybercrime, ai as a -----> tool !!!  for enforcing accountability, the various industries that could get impacted by ai, enterprise and process automation using ai, ai and costumer experience, ai’s role in messaging in the advertising, marketing and healthcare and other sectors, ai for the cognitive enterprise, and much more.\n\nthis ai summit will evaluate the nature and scale of changes that ai could bring about in various sectors such as retail, enterprise, consumer and commerce. it will scrutinize the opportunities and transformation that ai could bring about in development and digital platforms.\n\nsimpliv will offer the opportunity for a vivid and thoughtful exchange of viewpoints among panel members, who will be a bright mix of:\n\n· those who are pioneering path breaking innovations in the field of ai\n\n· leading brands that are at the forefront of ai\n\n· well-established leader\n\n· tech evangelists\n\n· unicorns, and\n\n· keenly watched startups.\n\nvisitors at the ai summit will include ai managers, angel investors, decision makers, innovators, startups, designers, developers, data analysts, managers and scientists, and brand managers.\n\n##### day 1 – monday, 18th nov 2019  [enroll here](https://www.simpliv.com/summit)\n\n§ session 1 how ai can help with digital transformation\n\n§ session 2 ai and deep learning – the drivers of digital transformation.\n\n§ session 3 the future impact of ai on cybercrime\n\n§ session 4 ai as a means to powering transparency and accountability\n\n§ session 5 ai for the workplace\n\n§ session 6 ai for your business – use of ai for different industries\n\n§ session 7 how to fulfill enterprise ai\n\n§ session 8 process automation and ai\n\n§ session 9 cognitive enterprise – cognitive automation and robotic process automation\n\n##### day 2 – tuesday, 19th nov 2019  [enroll here](https://www.simpliv.com/summit) \n\n§ session 10 ai integration and customer experience\n\n§ session 11 use of ai in the retail and e-commerce industries\n\n§ session 12 leveraging the voice driven world for business growth\n\n§ session 13 chatbot effectiveness for better business\n\n§ session 14 role of digital assistants in customer relationship management\n\n§ session 15 improving marketing and advertising effectiveness through ai\n\n§ session 16 revolution in healthcare through ai and big data.\n\n## this summit by world best renowned speakers:\n\nsameer dhanrajani\n\nchief strategy officer at fractal analytics\n\nshibsankar das\n\ndata scientist @walmartlabs | 40 under 40 data scientists 2019\n\nmanu chandra\n\nco-founder and chief data scientist at fn mathlogic consulting services pvt ltd\n\nsunil david\n\nregional director - iot at at&amp;t\n\nindranath mukherjee\n\navp, head - strategic analytics at  axa xl\n\nsrini rengarajan\n\nvice president and global head - ai and data science at 3i infotech ltd.\n\nmandar mutalikdesai\n\nservice area leader - artificial intelligence and analytics at ibm\n\nvidhya veeraraghavan\n\nassociate vice president - analytics at standard chartered global business services\n\nvishal singhal\n\nco-founder &amp; ai evangelist @cellstrat\n\naswini vyas\n\ndirector at digtal marketers india\n\npradeepta mishra\n\ndirector-ai @lymbyc\n\nram dayal goyal\n\nfounder - rns labs\n\nbalakumaran jayapal\n\ndeputy general manager (principal architect) at panasonic india innovation centre\n\npiyush chowhan\n\nsenior vice president and chief information officer at arvind lifestyle brands limited\n\nkrithika surianarayanan\n\nvice president at standard chartered bank\n\nmridul kabra\n\ndirector of digital marketing at neta app\n\ndr. saurav karmakar\n\ndemo session chair at ieee international conference on data mining (icdm 2019)\n\nsivesh kumar\n\nfounder &amp; ceo startup monk\n\npraveen srivatsa\n\ndirector at asthrasoft consulting\n\nsnehal\n\n## summit date: november 18th - 19th, 2019\n\n**place: taj, vivanta, mg road, yellappa chetty layout, sivanchetti gardens, bangalore, karnataka, 560001**\n\n[click here to continue](https://www.simpliv.com/summit)", "sortedWord": "None", "removed": "('nan',)", "score": 4, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d2me9g/artificial_intelligence_summit_2019_by_simpliv/',)", "identifyer": 5835450, "year": "2019"}, {"autor": "OliviaWillson", "date": 1567667033000, "content": "How Facial Landmark Detection Tool works || Make your application more intelligent ||", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/czxcy2/how_facial_landmark_detection_tool_works_make/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how facial landmark detection -----> tool !!!  works || make your application more intelligent ||", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.youtube.com/watch?v=WpEIxjETzXc&amp;t=2s',)", "identifyer": 5835515, "year": "2019"}, {"autor": "technodog303", "date": 1567503436000, "content": "Microsoft AI tool for combining photos from text, anyone remember the name? /!/ Hi there\n\nSorry if it's a bit off topic, I am trying to recall the name of a Slack/FaceBook Messenger/Telegram bot from around 2016, called Project ????? that would create new photos from a text snippet . I think it it was from Microsoft. Can anyone tell me the name of it or it's successor?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/cz2kug/microsoft_ai_tool_for_combining_photos_from_text/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "microsoft ai -----> tool !!!  for combining photos from text, anyone remember the name? /!/ hi there\n\nsorry if it's a bit off topic, i am trying to recall the name of a slack/facebook messenger/telegram bot from around 2016, called project ????? that would create new photos from a text snippet . i think it it was from microsoft. can anyone tell me the name of it or it's successor?", "sortedWord": "None", "removed": "('nan',)", "score": 4, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/cz2kug/microsoft_ai_tool_for_combining_photos_from_text/',)", "identifyer": 5835540, "year": "2019"}, {"autor": "technodog303", "date": 1567499523000, "content": "Can anyone remember the name of the boy by Microsoft that would combine photos from your text description? /!/ Hi everyone \n\nSorry it's a bit off topic, I'm trying (and failing) to remember the name of this AI tool from around 2016, Project ???? which was a Slack/Facebook/Telegram bot that combine photos. Does anyone recall it or it's successor?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/cz22ct/can_anyone_remember_the_name_of_the_boy_by/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "can anyone remember the name of the boy by microsoft that would combine photos from your text description? /!/ hi everyone \n\nsorry it's a bit off topic, i'm trying (and failing) to remember the name of this ai -----> tool !!!  from around 2016, project ???? which was a slack/facebook/telegram bot that combine photos. does anyone recall it or it's successor?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/cz22ct/can_anyone_remember_the_name_of_the_boy_by/',)", "identifyer": 5835541, "year": "2019"}, {"autor": "ramaprasadjena", "date": 1557168687000, "content": "The IntelliCode for AI-assisted coding from Microsoft comes out of the preview /!/  ntelliCode is now generally available, Microsoft’s tool for AI-assisted  coding. It supports C #and XAML in Visual Studio, and in Visual Studio  Code it supports JavaScript, TypeScript, and Python. It is now also  included in Visual Studio 2019 by default, starting with version 16.1’s  second preview, which the company also announced. \n\n[https://planetstoryline.com/the-intellicode-for-ai-assisted-coding-from-microsoft-comes-out-of-the-preview/](https://planetstoryline.com/the-intellicode-for-ai-assisted-coding-from-microsoft-comes-out-of-the-preview/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/blg1q8/the_intellicode_for_aiassisted_coding_from/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "the intellicode for ai-assisted coding from microsoft comes out of the preview /!/  ntellicode is now generally available, microsoft’s -----> tool !!!  for ai-assisted  coding. it supports c #and xaml in visual studio, and in visual studio  code it supports javascript, typescript, and python. it is now also  included in visual studio 2019 by default, starting with version 16.1’s  second preview, which the company also announced. \n\n[https://planetstoryline.com/the-intellicode-for-ai-assisted-coding-from-microsoft-comes-out-of-the-preview/](https://planetstoryline.com/the-intellicode-for-ai-assisted-coding-from-microsoft-comes-out-of-the-preview/)", "sortedWord": "None", "removed": "('nan',)", "score": 16, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/blg1q8/the_intellicode_for_aiassisted_coding_from/',)", "identifyer": 5835826, "year": "2019"}, {"autor": "abhishant96", "date": 1557138764000, "content": "Artificial Intelligence shaping the future of Education. /!/ When you compare the typical 21st century classroom with that of the early 1900s, the differences aren't terribly obvious. Teachers will be standing in front, giving instructions and sharing notes on a modern-day version of the old blackboard-say, an overhead projector or a shared computer display. Students will be sitting at their desks in the classroom or watching via online video-conferencing software. The technology has changed: A lot of the tools and processes have been digitized, some of it has been automated, and geographical barriers have been removed to some extent—but the actors and elements have remained much the same.\n\nBut thanks to advances in artificial intelligence (AI) and machine learning, a slow but steady transformation is coming to education, under the hood. In a few years, teachers will no longer be alone in shouldering the burden of training the young generation or the workforce at corporations.\n\nAlready, AI algorithms are helping enhance education by collecting, analyzing, and correlating every interaction that takes place in physical and virtual classrooms, and helping teachers to address the specific pain points of each student. This might be the beginning of a revolution in one of the oldest and most valuable social skills that mankind has developed, and an imperative in a world where humans live and work alongside smart machines.\n\n**Measuring Learner Progress**\n\nInstructors have to take into account every reaction to a lecture, every blank or attentive stare, every eager or hesitant response to a question, every assignment that is turned in early or late, and a lot more when assessing a student's grasp of a concept. This is how they can find out where students are lagging and steer them in the right direction.\n\nIt is also why measuring a learner's progress, an endeavor that is deeply social in nature, is one of the biggest challenges every teacher faces, and a task that is hard to accomplish with classic rule-based software.\n\nHowever, machine learning algorithms, which are based on analyzing and finding patterns and correlations between data points, are proving to be an effective tool in helping teachers quantify a student's understanding of a lecture.\n\nThe data is then used to build a model that can give real-time insights into a student's understanding and engagement with specific topics. Data models also help in finding common patterns among multiple students and performing predictive analytics, such as forecasting how students will perform in the future.\n\nMore advanced use of AI can involve the employment of complicated computer-vision algorithms to analyze facial expressions, such as boredom and distractions, and link those to the other data gathered on students in order to create a more complete picture of a student's learner model.\n\n## Finding and Addressing Gaps in Teaching\n\nWhen students lag behind in a lesson, flaws in teaching methods and curriculum are often as much to blame as weaknesses in the students themselves. Was the cause of student misunderstanding something about the material itself, the manner in which it was presented, or the timing of the material within the flow of the curriculum? Was it that the student had the flu when some necessary concepts were covered previously? How did the student engage with the material—actively or passively?\n\nThose are some of the questions that every teacher has to answer when assessing the quality of a delivered lesson and investigating the root causes of problems in learning.\n\n## Education Will Remain a Social Experience\n\nWhile we've seen impressive efforts in the application of artificial intelligence in education, the results pale in comparison to other domains where AI algorithms are causing major disruptions. The reason is that education and learning are fundamentally social experiences that are extremely hard—if not impossible—to automate.\n\nThe classroom might remain more or less as it is today, but thanks to digital assistants, AI algorithms, and more capable teachers, future generations will hopefully have access to higher quality education and will be able to learn at a much faster pace.\n\n&amp;#x200B;\n\nFollow us on LinkedIn:  [https://www.linkedin.com/company/14547128/admin/](https://www.linkedin.com/company/14547128/admin/) \n\nor Visit us at: [https://www.plaito.ai](https://www.plaito.ai)\n\n[PLAiTO - Learning Personalized](https://www.plaito.ai)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/blagau/artificial_intelligence_shaping_the_future_of/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence shaping the future of education. /!/ when you compare the typical 21st century classroom with that of the early 1900s, the differences aren't terribly obvious. teachers will be standing in front, giving instructions and sharing notes on a modern-day version of the old blackboard-say, an overhead projector or a shared computer display. students will be sitting at their desks in the classroom or watching via online video-conferencing software. the technology has changed: a lot of the tools and processes have been digitized, some of it has been automated, and geographical barriers have been removed to some extent—but the actors and elements have remained much the same.\n\nbut thanks to advances in artificial intelligence (ai) and machine learning, a slow but steady transformation is coming to education, under the hood. in a few years, teachers will no longer be alone in shouldering the burden of training the young generation or the workforce at corporations.\n\nalready, ai algorithms are helping enhance education by collecting, analyzing, and correlating every interaction that takes place in physical and virtual classrooms, and helping teachers to address the specific pain points of each student. this might be the beginning of a revolution in one of the oldest and most valuable social skills that mankind has developed, and an imperative in a world where humans live and work alongside smart machines.\n\n**measuring learner progress**\n\ninstructors have to take into account every reaction to a lecture, every blank or attentive stare, every eager or hesitant response to a question, every assignment that is turned in early or late, and a lot more when assessing a student's grasp of a concept. this is how they can find out where students are lagging and steer them in the right direction.\n\nit is also why measuring a learner's progress, an endeavor that is deeply social in nature, is one of the biggest challenges every teacher faces, and a task that is hard to accomplish with classic rule-based software.\n\nhowever, machine learning algorithms, which are based on analyzing and finding patterns and correlations between data points, are proving to be an effective -----> tool !!!  in helping teachers quantify a student's understanding of a lecture.\n\nthe data is then used to build a model that can give real-time insights into a student's understanding and engagement with specific topics. data models also help in finding common patterns among multiple students and performing predictive analytics, such as forecasting how students will perform in the future.\n\nmore advanced use of ai can involve the employment of complicated computer-vision algorithms to analyze facial expressions, such as boredom and distractions, and link those to the other data gathered on students in order to create a more complete picture of a student's learner model.\n\n## finding and addressing gaps in teaching\n\nwhen students lag behind in a lesson, flaws in teaching methods and curriculum are often as much to blame as weaknesses in the students themselves. was the cause of student misunderstanding something about the material itself, the manner in which it was presented, or the timing of the material within the flow of the curriculum? was it that the student had the flu when some necessary concepts were covered previously? how did the student engage with the material—actively or passively?\n\nthose are some of the questions that every teacher has to answer when assessing the quality of a delivered lesson and investigating the root causes of problems in learning.\n\n## education will remain a social experience\n\nwhile we've seen impressive efforts in the application of artificial intelligence in education, the results pale in comparison to other domains where ai algorithms are causing major disruptions. the reason is that education and learning are fundamentally social experiences that are extremely hard—if not impossible—to automate.\n\nthe classroom might remain more or less as it is today, but thanks to digital assistants, ai algorithms, and more capable teachers, future generations will hopefully have access to higher quality education and will be able to learn at a much faster pace.\n\n&amp;#x200b;\n\nfollow us on linkedin:  [https://www.linkedin.com/company/14547128/admin/](https://www.linkedin.com/company/14547128/admin/) \n\nor visit us at: [https://www.plaito.ai](https://www.plaito.ai)\n\n[plaito - learning personalized](https://www.plaito.ai)", "sortedWord": "None", "removed": "('nan',)", "score": 7, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/blagau/artificial_intelligence_shaping_the_future_of/',)", "identifyer": 5835830, "year": "2019"}, {"autor": "Sarahalfred09", "date": 1552911793000, "content": "How Artificial Intelligence Could Supercharge Your E commerce Website /!/ AI solutions are easier to use and apply to your e commerce business than ever. Let’s dispel the myths around artificial intelligence to find out how this tool can benefit your business.  \n [Read](https://medium.com/@skypotentialltd/how-artificial-intelligence-could-supercharge-your-ecommerce-website-21cd99c87f10):  \n\nhttps://i.redd.it/rz3wx55ievm21.jpg", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b2i2sj/how_artificial_intelligence_could_supercharge/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how artificial intelligence could supercharge your e commerce website /!/ ai solutions are easier to use and apply to your e commerce business than ever. let’s dispel the myths around artificial intelligence to find out how this -----> tool !!!  can benefit your business.  \n [read](https://medium.com/@skypotentialltd/how-artificial-intelligence-could-supercharge-your-ecommerce-website-21cd99c87f10):  \n\nhttps://i.redd.it/rz3wx55ievm21.jpg", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/b2i2sj/how_artificial_intelligence_could_supercharge/',)", "identifyer": 5836037, "year": "2019"}, {"autor": "skypotentialltd", "date": 1552910025000, "content": "How Artificial Intelligence Could Supercharge Your Ecommerce Website /!/ AI solutions are easier to use and apply to your e commerce business than ever. Let’s dispel the myths around artificial intelligence to find out how this tool can benefit your business.  \n [Read at](https://www.skypotential.co.uk/artificial-intelligence-could-supercharge-ecommerce/):  \n\nhttps://i.redd.it/ncbf4sf69vm21.jpg", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b2hskv/how_artificial_intelligence_could_supercharge/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how artificial intelligence could supercharge your ecommerce website /!/ ai solutions are easier to use and apply to your e commerce business than ever. let’s dispel the myths around artificial intelligence to find out how this -----> tool !!!  can benefit your business.  \n [read at](https://www.skypotential.co.uk/artificial-intelligence-could-supercharge-ecommerce/):  \n\nhttps://i.redd.it/ncbf4sf69vm21.jpg", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/b2hskv/how_artificial_intelligence_could_supercharge/',)", "identifyer": 5836038, "year": "2019"}, {"autor": "alyssaclerk", "date": 1567069989000, "content": "A New Tool For Hackers – AI in Cybersecurity", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/cwydmk/a_new_tool_for_hackers_ai_in_cybersecurity/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "a new -----> tool !!!  for hackers – ai in cybersecurity", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.globalsign.com/en/blog/new-tool-for-hackers-ai-cybersecurity/',)", "identifyer": 5836088, "year": "2019"}, {"autor": "Meesam_ali", "date": 1577605877000, "content": "Anybody used or know about CLIPS \"Expert System\" Software /!/ Hi Everybody, I came across one course on AI &amp; machine learning and the author specifically referred to a program called \"CLIPS Win\" which is like an \"Expert system modelling\" tool. I got the basics from Video and also downloaded the tool but its very hard to find anything useful (like tutorials, books or other reference material) on this software. This problem is worsened by the fact that its name \"CLIPS\" is not helping at all. Any guidance in this regard is helpful.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/eh3djw/anybody_used_or_know_about_clips_expert_system/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "anybody used or know about clips \"expert system\" software /!/ hi everybody, i came across one course on ai &amp; machine learning and the author specifically referred to a program called \"clips win\" which is like an \"expert system modelling\" -----> tool !!! . i got the basics from video and also downloaded the tool but its very hard to find anything useful (like tutorials, books or other reference material) on this software. this problem is worsened by the fact that its name \"clips\" is not helping at all. any guidance in this regard is helpful.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/eh3djw/anybody_used_or_know_about_clips_expert_system/',)", "identifyer": 5836171, "year": "2019"}, {"autor": "manektech", "date": 1576669735000, "content": "Top 6 Must-Have Magento 2 Extensions That Will Drive Your Sales /!/ Today’s e-commerce market demands for decent yet and fully featured  online portals to be successful on the internet. Magento 2 emerged as  one of the biggest, extensible and flexible platforms, bringing loads of  e-commerce functionalities and incredible performance to your website.  However, it still cannot keep up with the requirements raised by the  modern online retailers. That’s why the community of Magento 2  developers is constantly working hard to create specialized Magento 2  extensions to empower your website with specific capabilities.\n\nSince the e-commerce competition is getting tougher, not being  prepared with an exceptional website and effective marketing strategies  can instantly make you lose the game. If you are planning to improve  your **Magento 2 store design and development**, you should [**hire dedicated Magento 2 developers**](https://www.manektech.com/hire-magento-developers.html) to  integrate some extensions that will give a boost to your sales. In this  article, we have curated 6 Magento 2 extensions that are a must-have  for any online business.\n\n### 1 Inventory\n\nManaging inventory in Magento 2 can be challenging. Having the  ability to seamlessly manage your inventory is important for a  successful online storefront. Real time stock availability and vendor  relationship management can result in better satisfaction, and  ultimately more sales. However, if you are equipped with the right  extension during your Magento 2 e-commerce development, you can easily  maintain your stock as well as drive customer fulfillment. Magento 2  advanced inventory extension allows you to auto update the stock  information in real time. This can save you considerable time rather  than spending hours to update stock manually.\n\n**Advantages:**\n\n* Easy management of product information\n* Auto-update stock\n* Manage purchase order\n* Integrate multiple warehouses from different locations\n* Generate sales reports\n\n### 2 Navigation\n\nImagine how frustrating it is when you are not able to get around the  website and locate the page you are looking for. Poor structural design  and lack of proper navigational elements can create a bad experience  for users. Even worse, it can completely ruin your marketing strategies.  You surely wouldn’t want your visitors to end up on the page that they  are not interested in. When dealing with thousands of products, Magento 2  lacks in solving navigational problems. Thanks to Magento 2 layered  navigation extension and [Magento 2 themes integration](https://www.manektech.com/upgrade-magento-1-9-to-magento-2-1.html),  you can add extra flexibility and appealing navigation in your store.  So, hire expert Magento designers who can expand your existing  navigation, resolve certain issues and include various features in your  store.\n\n**Advantages:**\n\n* Speed up your catalog\n* Better sorting\n* SEO-friendly URL structure\n* Ability to display certain filters\n\n### 3 Upsell/Cross-Sell\n\nUpsell and cross-sell is a marketing strategy that is often used to  influence your customers to make additional purchases. Upselling is the  practice of recommending your users to choose a comparatively better and  more expensive product than the one they have chosen. The upsell  products usually appear on the shopping cart page, so upselling is  incorporated during shopping cart development. Cross-selling is the  practice of showing related products or complimentary products, which  can be purchased together with existing products. Upselling and  cross-selling has proven to boost the sales enormously, and that is why  they are the must-have extension for any e-commerce store.\n\n**Advantages:**\n\n* Popup upsell products based on the current cart items\n* Assign related items for each product\n* Smart recommendation with AI\n\n### 4 Site Search\n\nFor any e-commerce site, it is not possible to put all the products  on the single page, and that is why there are structured product and  category pages. Just like a website cannot survive without a good  navigation, efficient site search also plays an equally significant  role. Shoppers these days directly go to the site search without even  going through couple of product pages. Magento 2 offers very limited  on-site search capabilities. Fortunately, there are plenty of Magento 2  site search extensions and Magento 2 customization that empowers your  search with incredible features.\n\n**Advantages:**\n\n* Auto-complete search results\n* Semantic search predicts user intention\n* Smart search suggestions\n* Flexible search configuration options\n* Instant search results\n\n### 5 Reporting\n\nGetting an insight on the underlying business processes is vital for  any organization. Magento 2 out of the box doesn’t offer any extensive  reporting capabilities. Without proper reporting tool, it will be very  difficult for you to understand the performance of your campaigns, and  you will not be able to align your marketing and sales activities with  real-world business. That’s why the Magento ecosystem offers various  Magento 2 reporting extensions that will help you track, monitor and  manage business processes by providing insightful reports. Data received  from sales, purchases, customers and orders are sorted out without any  hassle, which can be of great help in decision-making.\n\n**Advantages:**\n\n* Compare different reports\n* View report data on charts\n* Support multiple report cards\n* Bookmark specific reports\n\n### 6 SEO\n\nAlthough default SEO functionality in Magento 2 is good, but it is  far from perfect. To leverage the full potential of SEO in Magento, you  should get Magento 2 SEO extensions, which are designed to support  intelligent SEO strategies even for complex inventories with thousands  of products. SEO extension for Magento 2 will help you improve your site  ranking by more than 30% and site visitors by more than 150%. Moreover,  some SEO extensions don’t require any changes in the code. It adapts  with your store and drives drastic results.\n\n**Advantages:**\n\n* Use Hreflang tags effortlessly\n* Structured breadcrumbs\n* Prevent duplicate content\n* Improved HTML/XMl sitemap\n* SEO report\n\n**Conclusion**\n\nThe extensions mentioned here are just some of many that can be  applied in certain aspects of your site. However, getting these  extensions are just a half the battle. Implementing and running these  extensions are the other half. These extensions can benefit only when  you choose to work with a professional [Magento website development company](https://www.manektech.com/) – ManekTech. If installed correctly, these extensions can significantly drive your sales and improve your business value.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ecbl2l/top_6_musthave_magento_2_extensions_that_will/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "top 6 must-have magento 2 extensions that will drive your sales /!/ today’s e-commerce market demands for decent yet and fully featured  online portals to be successful on the internet. magento 2 emerged as  one of the biggest, extensible and flexible platforms, bringing loads of  e-commerce functionalities and incredible performance to your website.  however, it still cannot keep up with the requirements raised by the  modern online retailers. that’s why the community of magento 2  developers is constantly working hard to create specialized magento 2  extensions to empower your website with specific capabilities.\n\nsince the e-commerce competition is getting tougher, not being  prepared with an exceptional website and effective marketing strategies  can instantly make you lose the game. if you are planning to improve  your **magento 2 store design and development**, you should [**hire dedicated magento 2 developers**](https://www.manektech.com/hire-magento-developers.html) to  integrate some extensions that will give a boost to your sales. in this  article, we have curated 6 magento 2 extensions that are a must-have  for any online business.\n\n### 1 inventory\n\nmanaging inventory in magento 2 can be challenging. having the  ability to seamlessly manage your inventory is important for a  successful online storefront. real time stock availability and vendor  relationship management can result in better satisfaction, and  ultimately more sales. however, if you are equipped with the right  extension during your magento 2 e-commerce development, you can easily  maintain your stock as well as drive customer fulfillment. magento 2  advanced inventory extension allows you to auto update the stock  information in real time. this can save you considerable time rather  than spending hours to update stock manually.\n\n**advantages:**\n\n* easy management of product information\n* auto-update stock\n* manage purchase order\n* integrate multiple warehouses from different locations\n* generate sales reports\n\n### 2 navigation\n\nimagine how frustrating it is when you are not able to get around the  website and locate the page you are looking for. poor structural design  and lack of proper navigational elements can create a bad experience  for users. even worse, it can completely ruin your marketing strategies.  you surely wouldn’t want your visitors to end up on the page that they  are not interested in. when dealing with thousands of products, magento 2  lacks in solving navigational problems. thanks to magento 2 layered  navigation extension and [magento 2 themes integration](https://www.manektech.com/upgrade-magento-1-9-to-magento-2-1.html),  you can add extra flexibility and appealing navigation in your store.  so, hire expert magento designers who can expand your existing  navigation, resolve certain issues and include various features in your  store.\n\n**advantages:**\n\n* speed up your catalog\n* better sorting\n* seo-friendly url structure\n* ability to display certain filters\n\n### 3 upsell/cross-sell\n\nupsell and cross-sell is a marketing strategy that is often used to  influence your customers to make additional purchases. upselling is the  practice of recommending your users to choose a comparatively better and  more expensive product than the one they have chosen. the upsell  products usually appear on the shopping cart page, so upselling is  incorporated during shopping cart development. cross-selling is the  practice of showing related products or complimentary products, which  can be purchased together with existing products. upselling and  cross-selling has proven to boost the sales enormously, and that is why  they are the must-have extension for any e-commerce store.\n\n**advantages:**\n\n* popup upsell products based on the current cart items\n* assign related items for each product\n* smart recommendation with ai\n\n### 4 site search\n\nfor any e-commerce site, it is not possible to put all the products  on the single page, and that is why there are structured product and  category pages. just like a website cannot survive without a good  navigation, efficient site search also plays an equally significant  role. shoppers these days directly go to the site search without even  going through couple of product pages. magento 2 offers very limited  on-site search capabilities. fortunately, there are plenty of magento 2  site search extensions and magento 2 customization that empowers your  search with incredible features.\n\n**advantages:**\n\n* auto-complete search results\n* semantic search predicts user intention\n* smart search suggestions\n* flexible search configuration options\n* instant search results\n\n### 5 reporting\n\ngetting an insight on the underlying business processes is vital for  any organization. magento 2 out of the box doesn’t offer any extensive  reporting capabilities. without proper reporting -----> tool !!! , it will be very  difficult for you to understand the performance of your campaigns, and  you will not be able to align your marketing and sales activities with  real-world business. that’s why the magento ecosystem offers various  magento 2 reporting extensions that will help you track, monitor and  manage business processes by providing insightful reports. data received  from sales, purchases, customers and orders are sorted out without any  hassle, which can be of great help in decision-making.\n\n**advantages:**\n\n* compare different reports\n* view report data on charts\n* support multiple report cards\n* bookmark specific reports\n\n### 6 seo\n\nalthough default seo functionality in magento 2 is good, but it is  far from perfect. to leverage the full potential of seo in magento, you  should get magento 2 seo extensions, which are designed to support  intelligent seo strategies even for complex inventories with thousands  of products. seo extension for magento 2 will help you improve your site  ranking by more than 30% and site visitors by more than 150%. moreover,  some seo extensions don’t require any changes in the code. it adapts  with your store and drives drastic results.\n\n**advantages:**\n\n* use hreflang tags effortlessly\n* structured breadcrumbs\n* prevent duplicate content\n* improved html/xml sitemap\n* seo report\n\n**conclusion**\n\nthe extensions mentioned here are just some of many that can be  applied in certain aspects of your site. however, getting these  extensions are just a half the battle. implementing and running these  extensions are the other half. these extensions can benefit only when  you choose to work with a professional [magento website development company](https://www.manektech.com/) – manektech. if installed correctly, these extensions can significantly drive your sales and improve your business value.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/ecbl2l/top_6_musthave_magento_2_extensions_that_will/',)", "identifyer": 5836266, "year": "2019"}, {"autor": "sathikalis", "date": 1549264330000, "content": "New Artificial intelligence (AI) Enabled tool may translate thoughts into speech", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/amz8z5/new_artificial_intelligence_ai_enabled_tool_may/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "new artificial intelligence (ai) enabled -----> tool !!!  may translate thoughts into speech", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.developeronrent.com/blogs/artificial-intelligence-enabled-tool-may-translate-thoughts-speech',)", "identifyer": 5836386, "year": "2019"}, {"autor": "mavenickconsulting", "date": 1548580985000, "content": "3 Step Maturity Model for Your Automation Centric Enterprise /!/ &amp;#x200B;\n\n[ 3 Step Maturity Model for Your Automation Centric Enterprise ](https://i.redd.it/y6fw8oggoxc21.png)\n\nOver the past few years, we have seen tremendous advances in [machine learning (ML) and artificial intelligence (AI)](https://www.mavenick.co/3-step-maturity-model-for-your-automation-centric-enterprise/). Rooted in these inspiring technologies is the idea of robotic process automation (RPA), the possibility of automating routine and mundane tasks with software robots capable of interacting with traditional software systems in the same way as human operators would.\n\n&amp;#x200B;\n\nEnterprise executives are attracted by the numerous benefits of RPA, which include significant cost savings and productivity improvements, but they are often left wondering how to best adopt RPA to drive long-term growth.\n\n&amp;#x200B;\n\nAt the same time, deriving the promised benefits from RPA initiatives is not an easy job. Per world’s leading analyst firm – HfS Research – more than 50% of the RPA initiatives haven’t been successful. As per this report, more than 60% of the C-level executives have either said that they are dissatisfied with the results from RPA or have been somewhat satisfied.\n\n&amp;#x200B;\n\nIn this article, we introduce a simple 3-step maturity model for creating an automation-centric enterprise, where intelligent automation spans across physical infrastructure, business management software, operations management, analytics, process automation, artificial intelligence and information security, as visualized below. When an enterprise successfully reaches the last step of our model, the enterprise is ready to transition into a cognitive- and data-oriented model of operation and fully reap all the benefits of RPA.\n\n&amp;#x200B;\n\n[ 3 Step Maturity Model for Your Automation Centric Enterprise ](https://i.redd.it/12bt3q3joxc21.jpg)\n\n&amp;#x200B;\n\n**STEP 1: AD-HOC PHASE**\n\nMost enterprises start adopting RPA on a case-by-case basis. During this phase of RPA adoption, no holistic automation strategy is yet in place, and all tool evaluation and process selection criteria are driven solely by individual team leaders.\n\n&amp;#x200B;\n\nEven though the ad-hoc phase is not governed by any enterprise-wide automation strategy, it is not without a purpose. The adoption of RPA on a case-by-case basis establishes the groundwork for enterprise-wide RPA adoption, considerably reducing the amount of friction such adoption would cause otherwise.\n\n&amp;#x200B;\n\nDuring the ad-hoc phase, the organization should be careful about a few critical aspects :\n\n&amp;#x200B;\n\nEven if you don’t have an organization wide strategy, you cannot have the cost and benefits analysis before you start any automation. Without this, you might end up automating something of low or no value.\n\n&amp;#x200B;\n\nStart with quick wins in mind. If the top management doesn’t see these quick wins, they will lose interest. So it is important to start with simple processes.\n\n&amp;#x200B;\n\nDo not fall into the trap of believing that delivering quick wins enables your team to take on complex processes. There are several aspects that your team needs to be trained on before you touch complex automation. E.g. Change Management, Deep Technical and process engineering skills, operating model, the center of excellence, governance, business model and execution framework.\n\n&amp;#x200B;\n\nThe ad-hoc phase is the perfect time for requirement gathering. The enterprise should carefully evaluate how RPA could best fit into its existing technology environment, and the enterprise should also come up with long-term adoption goals.\n\n&amp;#x200B;\n\nSTEP 2: ADOPTION PHASE\n\nBased on the gathered requirements and the desired long-term RPA adoption goals, a center of excellence is setup, a clear automation adoption strategy is defined, with an evolution model available for scaling the automation across the enterprise. The clearer the enterprise manages to articulate its adoption goals, the more effectively the adoption can be orchestrated.\n\n&amp;#x200B;\n\nThe selection of a specific RPA platform should be based on formally defined evaluation criteria, and the criteria itself should extend beyond the needs of individual functional silos. This is possible only when embracing change management, end-to-end business process management, and metrics for proactive goals &amp; progress tracking, among other things.\n\n&amp;#x200B;\n\nThe most critical components of moving from ad-hoc to adoption phase are – setting up of Automation COE with a holistic charter and a well-defined strategy for digitization and automation adoption. The strategy should include Change Management, training for deep technical and process engineering skills, skills management and staffing, operating model, governance, business model, and execution framework.\n\n&amp;#x200B;\n\nSTEP 3: ADAPTIVE PHASE\n\nWhen an enterprise enters the adaptive phase, it means that the enterprise has reached the end state of our 3-step maturity model for creating an automation-centric enterprise and has implemented continuous improvement and course correction mechanisms.\n\n&amp;#x200B;\n\nAt this stage, the enterprise has matured in various parts of the automation strategy, has built deep and broad automation as well as process engineering skills, due to widespread availability of skills it can now employ a hub and spoke model for decentralized execution but centralized governance, with automation capabilities built across the enterprise and intelligent data analytics for course correction &amp; dynamic risk management. The enterprise has a comprehensive framework for adopting either rule-based or ML/AI-based automation, ensuring consistency and the alignment of all business-driven virtual workforces.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/akams6/3_step_maturity_model_for_your_automation_centric/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "3 step maturity model for your automation centric enterprise /!/ &amp;#x200b;\n\n[ 3 step maturity model for your automation centric enterprise ](https://i.redd.it/y6fw8oggoxc21.png)\n\nover the past few years, we have seen tremendous advances in [machine learning (ml) and artificial intelligence (ai)](https://www.mavenick.co/3-step-maturity-model-for-your-automation-centric-enterprise/). rooted in these inspiring technologies is the idea of robotic process automation (rpa), the possibility of automating routine and mundane tasks with software robots capable of interacting with traditional software systems in the same way as human operators would.\n\n&amp;#x200b;\n\nenterprise executives are attracted by the numerous benefits of rpa, which include significant cost savings and productivity improvements, but they are often left wondering how to best adopt rpa to drive long-term growth.\n\n&amp;#x200b;\n\nat the same time, deriving the promised benefits from rpa initiatives is not an easy job. per world’s leading analyst firm – hfs research – more than 50% of the rpa initiatives haven’t been successful. as per this report, more than 60% of the c-level executives have either said that they are dissatisfied with the results from rpa or have been somewhat satisfied.\n\n&amp;#x200b;\n\nin this article, we introduce a simple 3-step maturity model for creating an automation-centric enterprise, where intelligent automation spans across physical infrastructure, business management software, operations management, analytics, process automation, artificial intelligence and information security, as visualized below. when an enterprise successfully reaches the last step of our model, the enterprise is ready to transition into a cognitive- and data-oriented model of operation and fully reap all the benefits of rpa.\n\n&amp;#x200b;\n\n[ 3 step maturity model for your automation centric enterprise ](https://i.redd.it/12bt3q3joxc21.jpg)\n\n&amp;#x200b;\n\n**step 1: ad-hoc phase**\n\nmost enterprises start adopting rpa on a case-by-case basis. during this phase of rpa adoption, no holistic automation strategy is yet in place, and all -----> tool !!!  evaluation and process selection criteria are driven solely by individual team leaders.\n\n&amp;#x200b;\n\neven though the ad-hoc phase is not governed by any enterprise-wide automation strategy, it is not without a purpose. the adoption of rpa on a case-by-case basis establishes the groundwork for enterprise-wide rpa adoption, considerably reducing the amount of friction such adoption would cause otherwise.\n\n&amp;#x200b;\n\nduring the ad-hoc phase, the organization should be careful about a few critical aspects :\n\n&amp;#x200b;\n\neven if you don’t have an organization wide strategy, you cannot have the cost and benefits analysis before you start any automation. without this, you might end up automating something of low or no value.\n\n&amp;#x200b;\n\nstart with quick wins in mind. if the top management doesn’t see these quick wins, they will lose interest. so it is important to start with simple processes.\n\n&amp;#x200b;\n\ndo not fall into the trap of believing that delivering quick wins enables your team to take on complex processes. there are several aspects that your team needs to be trained on before you touch complex automation. e.g. change management, deep technical and process engineering skills, operating model, the center of excellence, governance, business model and execution framework.\n\n&amp;#x200b;\n\nthe ad-hoc phase is the perfect time for requirement gathering. the enterprise should carefully evaluate how rpa could best fit into its existing technology environment, and the enterprise should also come up with long-term adoption goals.\n\n&amp;#x200b;\n\nstep 2: adoption phase\n\nbased on the gathered requirements and the desired long-term rpa adoption goals, a center of excellence is setup, a clear automation adoption strategy is defined, with an evolution model available for scaling the automation across the enterprise. the clearer the enterprise manages to articulate its adoption goals, the more effectively the adoption can be orchestrated.\n\n&amp;#x200b;\n\nthe selection of a specific rpa platform should be based on formally defined evaluation criteria, and the criteria itself should extend beyond the needs of individual functional silos. this is possible only when embracing change management, end-to-end business process management, and metrics for proactive goals &amp; progress tracking, among other things.\n\n&amp;#x200b;\n\nthe most critical components of moving from ad-hoc to adoption phase are – setting up of automation coe with a holistic charter and a well-defined strategy for digitization and automation adoption. the strategy should include change management, training for deep technical and process engineering skills, skills management and staffing, operating model, governance, business model, and execution framework.\n\n&amp;#x200b;\n\nstep 3: adaptive phase\n\nwhen an enterprise enters the adaptive phase, it means that the enterprise has reached the end state of our 3-step maturity model for creating an automation-centric enterprise and has implemented continuous improvement and course correction mechanisms.\n\n&amp;#x200b;\n\nat this stage, the enterprise has matured in various parts of the automation strategy, has built deep and broad automation as well as process engineering skills, due to widespread availability of skills it can now employ a hub and spoke model for decentralized execution but centralized governance, with automation capabilities built across the enterprise and intelligent data analytics for course correction &amp; dynamic risk management. the enterprise has a comprehensive framework for adopting either rule-based or ml/ai-based automation, ensuring consistency and the alignment of all business-driven virtual workforces.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/akams6/3_step_maturity_model_for_your_automation_centric/',)", "identifyer": 5836436, "year": "2019"}, {"autor": "StcStasi", "date": 1548350108000, "content": "Patent-busting AI tool navigates around protected drug pathways. Chematica software plans chemical syntheses &amp; has been used to circumvent drug patents by avoiding protected pathways to target molecules. Based on algorithm that identifies &amp; preserves particularly important bonds in target compounds.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ajely0/patentbusting_ai_tool_navigates_around_protected/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "patent-busting ai -----> tool !!!  navigates around protected drug pathways. chematica software plans chemical syntheses &amp; has been used to circumvent drug patents by avoiding protected pathways to target molecules. based on algorithm that identifies &amp; preserves particularly important bonds in target compounds.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('link',)", "medialink": "('https://www.chemistryworld.com/news/patent-busting-ai-tool-navigates-around-protected-drug-pathways/3010015.article',)", "identifyer": 5836451, "year": "2019"}, {"autor": "PieWareTeam", "date": 1552774373000, "content": "We have developed a powerful tool in which you can easily create your own speaking artificial intelligence! It's available on the Google Play Store.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b1y18v/we_have_developed_a_powerful_tool_in_which_you/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "we have developed a powerful -----> tool !!!  in which you can easily create your own speaking artificial intelligence! it's available on the google play store.", "sortedWord": "None", "removed": "('nan',)", "score": 7, "comments": 0, "media": "('nan',)", "medialink": "('https://play.google.com/store/apps/details?id=com.electromind.pieware',)", "identifyer": 5836477, "year": "2019"}, {"autor": "droidexpress", "date": 1552495914000, "content": "Suggestion for Tool and language for a game ai project /!/ Hi\n\nI am doing a University project in which i have to make a snake game with DFS or A* algorithm.\n\nBut i am unclear about tool and language. \n\nWhich tool and language should i choose to make this project? The tool should not be complex for graphics so that i focus more on algorithms.\n\nThanks", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b0o97g/suggestion_for_tool_and_language_for_a_game_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "suggestion for -----> tool !!!  and language for a game ai project /!/ hi\n\ni am doing a university project in which i have to make a snake game with dfs or a* algorithm.\n\nbut i am unclear about tool and language. \n\nwhich tool and language should i choose to make this project? the tool should not be complex for graphics so that i focus more on algorithms.\n\nthanks", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/b0o97g/suggestion_for_tool_and_language_for_a_game_ai/',)", "identifyer": 5836566, "year": "2019"}, {"autor": "dannylenwinn", "date": 1551919925000, "content": "AI can now predict your mental health problems: A Cambridge company is rolling out technology that will let a computer predict the state of your mental health. The new feature, known as the 'clinical decision support tool', uses AI to advise therapists on a patient’s main problem.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ay6gjn/ai_can_now_predict_your_mental_health_problems_a/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai can now predict your mental health problems: a cambridge company is rolling out technology that will let a computer predict the state of your mental health. the new feature, known as the 'clinical decision support -----> tool !!! ', uses ai to advise therapists on a patient’s main problem.", "sortedWord": "None", "removed": "('nan',)", "score": 27, "comments": 7, "media": "('link',)", "medialink": "('https://www.cambridge-news.co.uk/business/technology/artificial-intelligence-mental-health-therapy-15930857',)", "identifyer": 5836609, "year": "2019"}, {"autor": "gwen0927", "date": 1554823358000, "content": "Facebook AI Open-Sources PyTorch-BigGraph Tool for ‘Extremely Large’ Graphs", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bb97pk/facebook_ai_opensources_pytorchbiggraph_tool_for/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "facebook ai open-sources pytorch-biggraph -----> tool !!!  for ‘extremely large’ graphs", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://medium.com/syncedreview/facebook-ai-open-sources-pytorch-biggraph-tool-for-extremely-large-graphs-3b741b270693',)", "identifyer": 5836868, "year": "2019"}, {"autor": "gwen0927", "date": 1554823264000, "content": "Facebook AI Open-Sources PyTorch-BigGraph Tool for ‘Extremely Large’ Graphs", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bb971i/facebook_ai_opensources_pytorchbiggraph_tool_for/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "facebook ai open-sources pytorch-biggraph -----> tool !!!  for ‘extremely large’ graphs", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://medium.com/syncedreview/facebook-ai-open-sources-pytorch-biggraph-tool-for-extremely-large-graphs-3b741b270693',)", "identifyer": 5836869, "year": "2019"}, {"autor": "abhishant96", "date": 1554699008000, "content": "PLAiTO - Learning Personalized : Content Development Services /!/ [PLAiTO](https://www.plaito.ai) know what it takes to create effective adaptive content. We have worked on many courseware to make them adaptive. We have created personalized digital courses from print solutions as well as digital solutions, We have: \n\n&amp;#x200B;\n\n* Automated, semi automated and manual ingestion of content in [PLAiTO](https://www.plaito.ai/services/) through FCAT.\n* Sophisticated tool to tag the content for adaptive needs.\n* Learning Science experts to help you deconstruct your courses in granular adaptive learning units.\n* Development, Enhancement and Maintenance of content with deep instructional design skills.\n* Robust content development process.\n\n&amp;#x200B;\n\nhttps://i.redd.it/60nhhduc0zq21.jpg", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bapjqx/plaito_learning_personalized_content_development/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "plaito - learning personalized : content development services /!/ [plaito](https://www.plaito.ai) know what it takes to create effective adaptive content. we have worked on many courseware to make them adaptive. we have created personalized digital courses from print solutions as well as digital solutions, we have: \n\n&amp;#x200b;\n\n* automated, semi automated and manual ingestion of content in [plaito](https://www.plaito.ai/services/) through fcat.\n* sophisticated -----> tool !!!  to tag the content for adaptive needs.\n* learning science experts to help you deconstruct your courses in granular adaptive learning units.\n* development, enhancement and maintenance of content with deep instructional design skills.\n* robust content development process.\n\n&amp;#x200b;\n\nhttps://i.redd.it/60nhhduc0zq21.jpg", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/bapjqx/plaito_learning_personalized_content_development/',)", "identifyer": 5836892, "year": "2019"}, {"autor": "Globaltechcouncil", "date": 1554190623000, "content": "IS ARTIFICIAL INTELLIGENCE THE FUTURE TOOL FOR ANTI-CORRUPTION?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/b8g27p/is_artificial_intelligence_the_future_tool_for/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "is artificial intelligence the future -----> tool !!!  for anti-corruption?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.globaltechcouncil.org/artificial-intelligence/is-artificial-intelligence-the-future-tool-for-anti-corruption/',)", "identifyer": 5836940, "year": "2019"}, {"autor": "Countants123", "date": 1574944442000, "content": "How a Text to Speech Tool Works For Educators?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/e2xfvx/how_a_text_to_speech_tool_works_for_educators/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how a text to speech -----> tool !!!  works for educators?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.countants.com/blogs/how-a-text-to-speech-tool-works-for-educators/?utm_medium=social&amp;utm_source=reddit&amp;utm_campaign=traffic',)", "identifyer": 5837456, "year": "2019"}, {"autor": "Ammalgam3", "date": 1571932612000, "content": "This new Artificial Intelligence tool can tell if you are nervous or confused", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/dmieu0/this_new_artificial_intelligence_tool_can_tell_if/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "this new artificial intelligence -----> tool !!!  can tell if you are nervous or confused", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('link',)", "medialink": "('https://www.unirobotica.com/new-ai-tool-knows-whether-nervous-confused/',)", "identifyer": 5837552, "year": "2019"}, {"autor": "samcharchil", "date": 1571898161000, "content": "Facial recognition: This new AI tool can spot when you are nervous or confused | ZDNet", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/dmccz3/facial_recognition_this_new_ai_tool_can_spot_when/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "facial recognition: this new ai -----> tool !!!  can spot when you are nervous or confused | zdnet", "sortedWord": "None", "removed": "('nan',)", "score": 0, "comments": 0, "media": "('nan',)", "medialink": "('https://www.zdnet.com/article/this-new-ai-tool-can-spot-if-you-are-nervous-or-confused/',)", "identifyer": 5837560, "year": "2019"}, {"autor": "Max_1990", "date": 1573710457000, "content": "Adobe’s new AI tool can detect photoshopped images, could solve deepfakes problem /!/ Adobe recently demonstrated a new project which uses AI to determine manipulation in photos. This AI system can detect how much the photo has been manipulated and also detail which pixels have been altered.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/dw51lb/adobes_new_ai_tool_can_detect_photoshopped_images/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "adobe’s new ai -----> tool !!!  can detect photoshopped images, could solve deepfakes problem /!/ adobe recently demonstrated a new project which uses ai to determine manipulation in photos. this ai system can detect how much the photo has been manipulated and also detail which pixels have been altered.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 7, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/dw51lb/adobes_new_ai_tool_can_detect_photoshopped_images/',)", "identifyer": 5837606, "year": "2019"}, {"autor": "analyticsinsight", "date": 1548043685000, "content": "Artificial Intelligence is a Great Detector Tool | Analytics Insight", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/ai68yq/artificial_intelligence_is_a_great_detector_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence is a great detector -----> tool !!!  | analytics insight", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.analyticsinsight.net/artificial-intelligence-is-a-great-detector-tool/',)", "identifyer": 5837685, "year": "2019"}, {"autor": "SolaceInfotech", "date": 1575876278000, "content": "Advances In AI For Web Development /!/  \n\n## AI for web development-\n\n \n\n### 1. Intelligent code completion-\n\nCode completion has consistently been a key factor for developer productivity. It accelerates the process of coding applications by decreasing errors and other basic mistakes. Today, code completion usually works using an in-memory database of classes, variable names, and different constructs defined in the application. When the user starts typing, IDEs search for possible matches and suggest them in a pop-up window.\n\nArtificial intelligence is now adding logical expectation to code completion. Let’s consider an example where a user starts typing a variable name as now. The IDE can offer completion to the method of getting the current time from the DateTime interface. If a developer types a variable as color, the IDE can offer completion from an interface characterizing the theme of the application. Google recently declared Dart 2.5 SDK with ML Complete- code completion powered by machine learning. It works using a TensorFlow Lite model to predict the conceivable next symbol as the developer is editing.\n\n### 2. Intelligent prefetching-\n\nWeb developers today have been performing code splitting with webpack and other comparable libraries. Development in these libraries has allowed us to optimize the manner in which our code is delivered to the end user. Predictive prefetching could be achieved by preparing a model to predict what pages users are likely to visit dependent on their journey. This can be a basic model that depends on data about how the application is being utilized in general. Further development can be made using deep neural networks to analyze a particular user.\n\nOther than the user’s journey, there are different factors that can influence the probability of a page to be visited next. For instance, links closer to the user’s hand position on a mobile device are more likely to be visited than links farther from the user’s quick reach.\n\nGuess.js is so far the most ideal approach to add predictive prefetching to web applications. It has a webpack plugin and supports [**Angular**](https://solaceinfotech.com/blog/new-features-of-angular-8-0/), Next.js, Nuxt.js, and Gatsby.\n\n### 3.Automated test cases-\n\nTo take UI testing to the next level, image recognition is used. Dynamic UI controls can be recognized regardless of their shape and size, so AI can examine interfaces to check whether changes are advantageous or break the system. AI can also help in analyzing whether certain parts of UI match with the requirements and desires of the audience the product serves.\n\nCreating unit tests that fulfill all conceivable use cases can be teasing now and again. Artificial intelligence has an automated test case generation. By using AI-generated unit tests, developers can accomplish higher code coverage while splitting the time and effort required to build a thorough and significant suite of unit tests.\n\nAnother case is predicting user journeys by inspecting current information and creating flows for end-to-start tests. This will allow the QA engineer to concentrate more on testing new features while remaining secure about keeping current functionalities intact.\n\nHere are a few of the tools that leverage AI to transform software testing:\n\n* Test.ai: A company by ex-Google and ex-Microsoft test leads. It offers an AI-powered test automation platform to help mobile application distributors deliver quality user experiences to their customers.\n* Testim.io: A machine learning tool that authors, executes, and also maintains automated tests.\n* AISTA: While it isn’t actually a tool, the Artificial Intelligence for Software Testing Association connects testers using AI for QA purposes\n\n### 4. Better SEO: Better keywords and multilingual image tagging-\n\nFrom technical reviews, keyword research, and content optimization to content distribution, tag management, and internal linking, AI is making an immense difference in how SEO is done today. Alongside creating multilingual content from one source, AI is also helping to generate relevant meta information.\n\nIt was an expensive task for large scale e- commerce organizations to generate proper keywords against every product image they showed, and also finding the important tag for different languages added a lot to the expense. Today, refined image recognition techniques can automatically generate multilingual tags from the images on display.\n\nAlso, advancement in content analysis are helping content writers and entrepreneurs in producing relevant tags and keyphrases against large documents. This also helps writers to effectively link between the content they have produced previously with freshly brewed stuff.\n\n### 5. Tailoring experiences for everyone-\n\nArtificial intelligence is here to control the next generation in website personalization. This could change the nature of the internet forever. We are going towards a time in which websites will adapt themselves to give an ideal experience custom- made uniquely for each user.\n\nThat may well be possible through a development of the AI tools that power today’s artificial design intelligence (ADI) platform and analytics systems. With big investments from organizations like Adobe and Wix, there’s certain to be a prosperous future ahead for ADI.\n\n## Conclusion-\n\nBased on how AI has influenced the modern world- and the speed at which it is still advancing- clearly we’ve just observed the beginnings of the disruptive force that this technology will apply in the business.\n\nGoing ahead, it’s a virtual certainty that AI will play an essential job in each feature of software development. \n\nAs technology progresses, it affects in many ways in many industries. And is also done with the software development industry. [**Chatbot**](https://solaceinfotech.com/blog/why-you-should-use-chatbot-for-your-business/) is one of them. Know the chatbot development platforms at- [**Top 10 Best Platforms for Chatbot Development**](https://solaceinfotech.com/blog/top-10-best-platforms-for-chatbot-development/).", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/e86qj7/advances_in_ai_for_web_development/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "advances in ai for web development /!/  \n\n## ai for web development-\n\n \n\n### 1. intelligent code completion-\n\ncode completion has consistently been a key factor for developer productivity. it accelerates the process of coding applications by decreasing errors and other basic mistakes. today, code completion usually works using an in-memory database of classes, variable names, and different constructs defined in the application. when the user starts typing, ides search for possible matches and suggest them in a pop-up window.\n\nartificial intelligence is now adding logical expectation to code completion. let’s consider an example where a user starts typing a variable name as now. the ide can offer completion to the method of getting the current time from the datetime interface. if a developer types a variable as color, the ide can offer completion from an interface characterizing the theme of the application. google recently declared dart 2.5 sdk with ml complete- code completion powered by machine learning. it works using a tensorflow lite model to predict the conceivable next symbol as the developer is editing.\n\n### 2. intelligent prefetching-\n\nweb developers today have been performing code splitting with webpack and other comparable libraries. development in these libraries has allowed us to optimize the manner in which our code is delivered to the end user. predictive prefetching could be achieved by preparing a model to predict what pages users are likely to visit dependent on their journey. this can be a basic model that depends on data about how the application is being utilized in general. further development can be made using deep neural networks to analyze a particular user.\n\nother than the user’s journey, there are different factors that can influence the probability of a page to be visited next. for instance, links closer to the user’s hand position on a mobile device are more likely to be visited than links farther from the user’s quick reach.\n\nguess.js is so far the most ideal approach to add predictive prefetching to web applications. it has a webpack plugin and supports [**angular**](https://solaceinfotech.com/blog/new-features-of-angular-8-0/), next.js, nuxt.js, and gatsby.\n\n### 3.automated test cases-\n\nto take ui testing to the next level, image recognition is used. dynamic ui controls can be recognized regardless of their shape and size, so ai can examine interfaces to check whether changes are advantageous or break the system. ai can also help in analyzing whether certain parts of ui match with the requirements and desires of the audience the product serves.\n\ncreating unit tests that fulfill all conceivable use cases can be teasing now and again. artificial intelligence has an automated test case generation. by using ai-generated unit tests, developers can accomplish higher code coverage while splitting the time and effort required to build a thorough and significant suite of unit tests.\n\nanother case is predicting user journeys by inspecting current information and creating flows for end-to-start tests. this will allow the qa engineer to concentrate more on testing new features while remaining secure about keeping current functionalities intact.\n\nhere are a few of the tools that leverage ai to transform software testing:\n\n* test.ai: a company by ex-google and ex-microsoft test leads. it offers an ai-powered test automation platform to help mobile application distributors deliver quality user experiences to their customers.\n* testim.io: a machine learning -----> tool !!!  that authors, executes, and also maintains automated tests.\n* aista: while it isn’t actually a tool, the artificial intelligence for software testing association connects testers using ai for qa purposes\n\n### 4. better seo: better keywords and multilingual image tagging-\n\nfrom technical reviews, keyword research, and content optimization to content distribution, tag management, and internal linking, ai is making an immense difference in how seo is done today. alongside creating multilingual content from one source, ai is also helping to generate relevant meta information.\n\nit was an expensive task for large scale e- commerce organizations to generate proper keywords against every product image they showed, and also finding the important tag for different languages added a lot to the expense. today, refined image recognition techniques can automatically generate multilingual tags from the images on display.\n\nalso, advancement in content analysis are helping content writers and entrepreneurs in producing relevant tags and keyphrases against large documents. this also helps writers to effectively link between the content they have produced previously with freshly brewed stuff.\n\n### 5. tailoring experiences for everyone-\n\nartificial intelligence is here to control the next generation in website personalization. this could change the nature of the internet forever. we are going towards a time in which websites will adapt themselves to give an ideal experience custom- made uniquely for each user.\n\nthat may well be possible through a development of the ai tools that power today’s artificial design intelligence (adi) platform and analytics systems. with big investments from organizations like adobe and wix, there’s certain to be a prosperous future ahead for adi.\n\n## conclusion-\n\nbased on how ai has influenced the modern world- and the speed at which it is still advancing- clearly we’ve just observed the beginnings of the disruptive force that this technology will apply in the business.\n\ngoing ahead, it’s a virtual certainty that ai will play an essential job in each feature of software development. \n\nas technology progresses, it affects in many ways in many industries. and is also done with the software development industry. [**chatbot**](https://solaceinfotech.com/blog/why-you-should-use-chatbot-for-your-business/) is one of them. know the chatbot development platforms at- [**top 10 best platforms for chatbot development**](https://solaceinfotech.com/blog/top-10-best-platforms-for-chatbot-development/).", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/e86qj7/advances_in_ai_for_web_development/',)", "identifyer": 5838145, "year": "2019"}, {"autor": "T_Boner_SwaT", "date": 1568996329000, "content": "Trying to Identify Image ID using the inbuilt Image Classification Algorithm of AWS Sagemaker /!/ &gt;Ok fellow developers I'm in kind of a predicament. Before I begin I want to clear the air by saying that my field of work is in AWS and I'm a noob when it comes to A.I , M.L , D.L etc. \n\nOk so I work on AWS and as a POC/Technology-Demonstration I created an Image Classification system on the AWS platform using a service called Amazon Sagemaker and if you are wondering what even is AWS Sagemaker, \n\nhere's a jist  &gt; *Amazon SageMaker is a fully managed machine learning service. With Amazon SageMaker, data scientists and developers can quickly and easily build and train machine learning models, and then directly deploy them into a production-ready hosted environment. It provides an integrated Jupyter authoring notebook instance for easy access to your data sources for exploration and analysis, so you don't have to manage servers. It also provides common machine learning algorithms that are optimized to run efficiently against extremely large data in a distributed environment. With native support for bring-your-own-algorithms and frameworks, Amazon SageMaker offers flexible distributed training options that adjust to your specific workflows.* Link &gt; [https://docs.aws.amazon.com/sagemaker/latest/dg/whatis.html](https://docs.aws.amazon.com/sagemaker/latest/dg/whatis.html)\n\n**So the business logic that I needed to implement is as follows :-** \n\nThere is a set of 20 images which are finite, distinct and have Image ID's 0-19. The trained model needs to Identify the random input image which will be a lower resolution counterpart of the original set of images, and it will have to say as to which image ID the input image is. Basically I'll have to make the IC model memories the 20 Images(0-19). I know this might sound cringy to the experts but its for a POC and that is the requirement that I have to deal with right now.\n\n**This is the approach I took :-**\n\n**1**. I only have the high resolution images for 1 each of the 20 images which are located in an S3 Bucket, the images are arranged under sub directories like \n\n Bucket\\_name/Data\\_set/ID00/ImageID00.jpg\n\n \\-----------------------------------------/ImageID00Copy.jpg \n\n \\---------------------------------/ID01/ImageID01.jpg\n\n \\-----------------------------------------/ImageID01Copy.jpg  \n\nand so on upto ID19.\n\n**2**. I use [im2rec.py](https://im2rec.py) tool to convert the dataset into a RecordIO file(.rec) one for Training and one for Validation and the data-set is being split between the 2 files.\n\n**3**. Now I create a Training job with Sagemaker's built in Image Classification Algorithm on this tiny dataset hoping that it would work.\n\nLink for the algorithm &gt; [https://docs.aws.amazon.com/sagemaker/latest/dg/image-classification.html](https://docs.aws.amazon.com/sagemaker/latest/dg/image-classification.html)\n\nBut the model created from this just doesn't work at all and now I'm posting this looking for help.\n\nI thought may be its because of the tiny dataset so I doubled the number of copies of the images keeping 4 images in every sub folder for every Class/ImageID and using 3 copies for Training and 1 for Validation.\n\nBut it still didn't work. I believe I am doing some silly/stupid/noob mistake but I don't know what to do so can any one tell me how to make a model that will detect which image ID the input image is.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/d6x8gd/trying_to_identify_image_id_using_the_inbuilt/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "trying to identify image id using the inbuilt image classification algorithm of aws sagemaker /!/ &gt;ok fellow developers i'm in kind of a predicament. before i begin i want to clear the air by saying that my field of work is in aws and i'm a noob when it comes to a.i , m.l , d.l etc. \n\nok so i work on aws and as a poc/technology-demonstration i created an image classification system on the aws platform using a service called amazon sagemaker and if you are wondering what even is aws sagemaker, \n\nhere's a jist  &gt; *amazon sagemaker is a fully managed machine learning service. with amazon sagemaker, data scientists and developers can quickly and easily build and train machine learning models, and then directly deploy them into a production-ready hosted environment. it provides an integrated jupyter authoring notebook instance for easy access to your data sources for exploration and analysis, so you don't have to manage servers. it also provides common machine learning algorithms that are optimized to run efficiently against extremely large data in a distributed environment. with native support for bring-your-own-algorithms and frameworks, amazon sagemaker offers flexible distributed training options that adjust to your specific workflows.* link &gt; [https://docs.aws.amazon.com/sagemaker/latest/dg/whatis.html](https://docs.aws.amazon.com/sagemaker/latest/dg/whatis.html)\n\n**so the business logic that i needed to implement is as follows :-** \n\nthere is a set of 20 images which are finite, distinct and have image id's 0-19. the trained model needs to identify the random input image which will be a lower resolution counterpart of the original set of images, and it will have to say as to which image id the input image is. basically i'll have to make the ic model memories the 20 images(0-19). i know this might sound cringy to the experts but its for a poc and that is the requirement that i have to deal with right now.\n\n**this is the approach i took :-**\n\n**1**. i only have the high resolution images for 1 each of the 20 images which are located in an s3 bucket, the images are arranged under sub directories like \n\n bucket\\_name/data\\_set/id00/imageid00.jpg\n\n \\-----------------------------------------/imageid00copy.jpg \n\n \\---------------------------------/id01/imageid01.jpg\n\n \\-----------------------------------------/imageid01copy.jpg  \n\nand so on upto id19.\n\n**2**. i use [im2rec.py](https://im2rec.py) -----> tool !!!  to convert the dataset into a recordio file(.rec) one for training and one for validation and the data-set is being split between the 2 files.\n\n**3**. now i create a training job with sagemaker's built in image classification algorithm on this tiny dataset hoping that it would work.\n\nlink for the algorithm &gt; [https://docs.aws.amazon.com/sagemaker/latest/dg/image-classification.html](https://docs.aws.amazon.com/sagemaker/latest/dg/image-classification.html)\n\nbut the model created from this just doesn't work at all and now i'm posting this looking for help.\n\ni thought may be its because of the tiny dataset so i doubled the number of copies of the images keeping 4 images in every sub folder for every class/imageid and using 3 copies for training and 1 for validation.\n\nbut it still didn't work. i believe i am doing some silly/stupid/noob mistake but i don't know what to do so can any one tell me how to make a model that will detect which image id the input image is.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/d6x8gd/trying_to_identify_image_id_using_the_inbuilt/',)", "identifyer": 5838387, "year": "2019"}, {"autor": "tozameer", "date": 1559430531000, "content": "This AI tool is translating 2,000 African languages in a bid to boost local economies", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bvqutp/this_ai_tool_is_translating_2000_african/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "this ai -----> tool !!!  is translating 2,000 african languages in a bid to boost local economies", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://thenextweb.com/syndication/2019/06/01/this-ai-tool-is-translating-2000-african-languages-in-a-bid-to-boost-local-economies/',)", "identifyer": 5838540, "year": "2019"}, {"autor": "thumbsdrivesmecrazy", "date": 1559206763000, "content": "Machine Learning Reproducibility Challenges and DVC /!/ When ML models need to be regularly updated in production, a host of challenges emerges. Paramount among ML reproducibility concerns are the following:\n\n* Effectively versioning your models\n* Capturing the exact steps in your data munging and feature engineering pipelines\n* Dependency management (including of your data and infrastructure)\n* Configuration tracking\n\nNo one tool can do it all for you - organizations using a mix of Git, Makefiles, ad hoc scripts and reference files for reproducibility. The following overview explains how DVC enters this mix offering a cleaner solution, specifically targeting data science challenges: [First Impressions of Data Science Version Control (DVC)](https://medium.com/@christopher.samiullah/first-impressions-of-data-science-version-control-dvc-fe96ab29cdda) (full tutorial)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/buqv5o/machine_learning_reproducibility_challenges_and/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "machine learning reproducibility challenges and dvc /!/ when ml models need to be regularly updated in production, a host of challenges emerges. paramount among ml reproducibility concerns are the following:\n\n* effectively versioning your models\n* capturing the exact steps in your data munging and feature engineering pipelines\n* dependency management (including of your data and infrastructure)\n* configuration tracking\n\nno one -----> tool !!!  can do it all for you - organizations using a mix of git, makefiles, ad hoc scripts and reference files for reproducibility. the following overview explains how dvc enters this mix offering a cleaner solution, specifically targeting data science challenges: [first impressions of data science version control (dvc)](https://medium.com/@christopher.samiullah/first-impressions-of-data-science-version-control-dvc-fe96ab29cdda) (full tutorial)", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/buqv5o/machine_learning_reproducibility_challenges_and/',)", "identifyer": 5838558, "year": "2019"}, {"autor": "abhi_uno", "date": 1559091801000, "content": "PiciT: A Powerful A.I Cropping Tool", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/bu883x/picit_a_powerful_ai_cropping_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "picit: a powerful a.i cropping -----> tool !!! ", "sortedWord": "None", "removed": "('nan',)", "score": 6, "comments": 0, "media": "('link',)", "medialink": "('https://www.reddit.com/r/androidapps/comments/bu22iq/picit_a_powerful_ai_cropping_tool/',)", "identifyer": 5838568, "year": "2019"}, {"autor": "mynameisbaseer", "date": 1565189728000, "content": "Microsoft AI.... /!/ Now that Microsoft has finally hopped onto the AI bandwagon and is offering AI options via their Azure services, AI has been easier to implement. I have been intrigued by their platform and their offerings but I would like to get introduced to their AI systems. To keep it short, I have worked in the past with bots and simple AI mechanics but never had the drive or method to go through and learn it. Now that Microsoft is offering a platform for it I do believe that I can enhance my introductory skills. However, I believe because it is a new platform that it is not the best AI tool out there. How do you guys feel about Microsoft AI's services that they provide? Not only for introductory users but for high end automation. Is this worth my time to use or is there a better platform out there?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/cn6tig/microsoft_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "microsoft ai.... /!/ now that microsoft has finally hopped onto the ai bandwagon and is offering ai options via their azure services, ai has been easier to implement. i have been intrigued by their platform and their offerings but i would like to get introduced to their ai systems. to keep it short, i have worked in the past with bots and simple ai mechanics but never had the drive or method to go through and learn it. now that microsoft is offering a platform for it i do believe that i can enhance my introductory skills. however, i believe because it is a new platform that it is not the best ai -----> tool !!!  out there. how do you guys feel about microsoft ai's services that they provide? not only for introductory users but for high end automation. is this worth my time to use or is there a better platform out there?", "sortedWord": "None", "removed": "('nan',)", "score": 19, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/cn6tig/microsoft_ai/',)", "identifyer": 5838688, "year": "2019"}], "name": "toolArtificialInteligence2019"}