{"interestingcomments": [{"autor": "parapluke", "date": 1516994853000, "content": "Graduation Project: questionaire research for my new blog about AI, tech, robotics, innovation /!/ Hi,\n\nI'm a student from Amsterdam, and at the moment I'm working on my bachelor graduation project. I'm setting up a new blog, where i'll focus on concepts like AI, technology, robotics and innovation. In a nutshell, the big question I'm focussing on is how robotics and AI (and other IT-tech) are speeding up technological change, and what the philosophical implications are.\n\nIt's required to do some research into the target audience. I choose a survey tool. This subreddit and it's people - you: AI fanatics, like me - are exactly whom I'll be targetting with my blog.\n\nSo my question is, would you all be so kind to help me out with me survey? It only takes a couple of minutes of your time, but to me it would mean the world. I included the survey link on the bottom of my post.\n\nWhat the subreddit gains from this? The subject &amp; aim of my blog is closely related to what /r/ArtificialInteligence covers. I'll regularly post articles and interviews, which I hope you'll all love - this community is my target audience, after all. If anyone is interested I'll share the results in /r/ArtificialInteligence once I'm done.\n\nIt would be a huge boost to my research and the blog in general. I want to thank everyone no matter what, the opportunity to post my survey here is already amazing, thanks for your help &amp; time guys! &lt;3\n\nCLICK HERE TO FILL IN THE SURVEY: https://goo.gl/forms/Mtqlof3ABAzP4SRx2\n\nKind regards, \nLuke\n\nPS: I tried to reach the mods, but got no response. If my post isn´t allowed just give me a sign. ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/7t6yjq/graduation_project_questionaire_research_for_my/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "graduation project: questionaire research for my new blog about ai, tech, robotics, innovation /!/ hi,\n\ni'm a student from amsterdam, and at the moment i'm working on my bachelor graduation project. i'm setting up a new blog, where i'll focus on concepts like ai, technology, robotics and innovation. in a nutshell, the big question i'm focussing on is how robotics and ai (and other it-tech) are speeding up technological change, and what the philosophical implications are.\n\nit's required to do some research into the target audience. i choose a survey -----> tool !!! . this subreddit and it's people - you: ai fanatics, like me - are exactly whom i'll be targetting with my blog.\n\nso my question is, would you all be so kind to help me out with me survey? it only takes a couple of minutes of your time, but to me it would mean the world. i included the survey link on the bottom of my post.\n\nwhat the subreddit gains from this? the subject &amp; aim of my blog is closely related to what /r/artificialinteligence covers. i'll regularly post articles and interviews, which i hope you'll all love - this community is my target audience, after all. if anyone is interested i'll share the results in /r/artificialinteligence once i'm done.\n\nit would be a huge boost to my research and the blog in general. i want to thank everyone no matter what, the opportunity to post my survey here is already amazing, thanks for your help &amp; time guys! &lt;3\n\nclick here to fill in the survey: https://goo.gl/forms/mtqlof3abazp4srx2\n\nkind regards, \nluke\n\nps: i tried to reach the mods, but got no response. if my post isn´t allowed just give me a sign. ", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 7, "media": "('self',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/7t6yjq/graduation_project_questionaire_research_for_my/',)", "identifyer": 5614160, "year": "2018"}, {"autor": "brightblueskies11", "date": 1516340030000, "content": "Those digital dolls learned to walk? /!/ TL;DR How did those digital figures in the Google experiment learn to walk, run, crawl, etc.? \n\nSo I am a total nube when it comes to AI, ML, AGI, etc. Obviously I know some terms, the basics and can probably understand concepts but I don’t think I’ve even understood the main AI concept. I don’t even think I know how to ask the question of how to understand AI. Is it one thing, one concept? Are there many forms? \n\nSpecifically, those digital dolls. We’ve all seen them, those little stick digital manikins that learned to get themselves from point A to point B. So I guess my question revolves more around this concept. Did those figures learn to walk, run, crawl on their own? How is that even possible without us giving them the option to do that? I.e. A,B, and C are ways to get from point A to point B, figure it out. How can we provide them nothing and tell them to make info out of nothing? Is that sort of like our own brain? We can easily draw conclusions out of thin air? \n\nThere’s a lot here, and I don’t want to overload the question with a lot of tangents. I mainly want to understand those figures and how they did that! \n\nAI is a wonderful tool and I’m hoping we can use it in countless ways to benefit society, but also hoping we can build a safe path that benefits all. \n\n\nThank you!\n", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/7rg798/those_digital_dolls_learned_to_walk/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "those digital dolls learned to walk? /!/ tl;dr how did those digital figures in the google experiment learn to walk, run, crawl, etc.? \n\nso i am a total nube when it comes to ai, ml, agi, etc. obviously i know some terms, the basics and can probably understand concepts but i don’t think i’ve even understood the main ai concept. i don’t even think i know how to ask the question of how to understand ai. is it one thing, one concept? are there many forms? \n\nspecifically, those digital dolls. we’ve all seen them, those little stick digital manikins that learned to get themselves from point a to point b. so i guess my question revolves more around this concept. did those figures learn to walk, run, crawl on their own? how is that even possible without us giving them the option to do that? i.e. a,b, and c are ways to get from point a to point b, figure it out. how can we provide them nothing and tell them to make info out of nothing? is that sort of like our own brain? we can easily draw conclusions out of thin air? \n\nthere’s a lot here, and i don’t want to overload the question with a lot of tangents. i mainly want to understand those figures and how they did that! \n\nai is a wonderful -----> tool !!!  and i’m hoping we can use it in countless ways to benefit society, but also hoping we can build a safe path that benefits all. \n\n\nthank you!\n", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/7rg798/those_digital_dolls_learned_to_walk/',)", "identifyer": 5614184, "year": "2018"}, {"autor": "tsims25", "date": 1526752641000, "content": "Are Chatbots a good intro to AI? /!/ Hi, I took a class on AI and Machine Learning and now I’d like to build something. I’ve built a sentiment analysis tool and really like natural Language Processing. Is building a chatbot a good intro into AI? ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8kmw5c/are_chatbots_a_good_intro_to_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "are chatbots a good intro to ai? /!/ hi, i took a class on ai and machine learning and now i’d like to build something. i’ve built a sentiment analysis -----> tool !!!  and really like natural language processing. is building a chatbot a good intro into ai? ", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/8kmw5c/are_chatbots_a_good_intro_to_ai/',)", "identifyer": 5614469, "year": "2018"}, {"autor": "webhistories", "date": 1531961683000, "content": "Help in Computer Vision AI /!/ Hello,\n\nI am a Computer Science student and I'm planning to create a mobile application that detects specific details on human figure sketches made by children. The app will score the drawings according to detected details. This will be used to help in a psychometrics tool. \n\nI've been looking around everywhere for demos to see if what I have in mind is feasible. What I specifically look for is an object detector API or algorithm that detects **multiple** objects in an image. For example in human sketch, it can detect if the eyes, nose or ears are present. Is this an existing concept or can someone direct me to a project close to this?\n\nI appreciate any help I can get from this sub, thanks!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9016ou/help_in_computer_vision_ai/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "help in computer vision ai /!/ hello,\n\ni am a computer science student and i'm planning to create a mobile application that detects specific details on human figure sketches made by children. the app will score the drawings according to detected details. this will be used to help in a psychometrics -----> tool !!! . \n\ni've been looking around everywhere for demos to see if what i have in mind is feasible. what i specifically look for is an object detector api or algorithm that detects **multiple** objects in an image. for example in human sketch, it can detect if the eyes, nose or ears are present. is this an existing concept or can someone direct me to a project close to this?\n\ni appreciate any help i can get from this sub, thanks!", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/9016ou/help_in_computer_vision_ai/',)", "identifyer": 5614631, "year": "2018"}, {"autor": "MrDavideh98", "date": 1529432639000, "content": "What is the relationship between machine learning and neural networks? /!/ Is it ok to say that a  neural network is the tool that machine learning uses in order to achieve something? ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8sb6f1/what_is_the_relationship_between_machine_learning/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "what is the relationship between machine learning and neural networks? /!/ is it ok to say that a  neural network is the -----> tool !!!  that machine learning uses in order to achieve something? ", "sortedWord": "None", "removed": "Nan", "score": 4, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/8sb6f1/what_is_the_relationship_between_machine_learning/',)", "identifyer": 5614777, "year": "2018"}, {"autor": "camshalala", "date": 1528370887000, "content": "AI, algorithms and Mosaic Experian /!/ Hello all, \n\nI work for an innovation foundation, researching on AI in the public sector (i.e. the application of algorithms in predictive policing, risk assessment in the social care, etc) and I'd like to know your opinion (and if you have, some reading materials) about the use of Experian Mosaic customer profiles in these tools.\n\nIn particular I would like to know more about the quality of the underlying data and the stratification analysis Mosaic makes creating different \"profiles\".\n\nIt seems there is a high degree of approximation in these profiles and I would like to know your opinion about their value in a tool that should predict actions and risk levels for real people.\n\nAnd also, of course, do you think the use of stereotypes could result in strengthening some of the biases already known, e.g. the ProPublica report on policing machine learning bias rating re-offending risk in the US and other stories...\n\nHere there's a link of an interesting article on Big Brother Watch on the use of Experian Mosaic in Durham Police: https://bigbrotherwatch.org.uk/2018/04/a-closer-look-at-experian-big-data-and-artificial-intelligence-in-durham-police/\n\nI am particularly interested in the opinion of those of you who have accessed / used the database before and who have a good understanding of how algorithms work.\n\nThank you verrrrry much for your help!\n\nCheers\n\nCamilla\n\n\n\n", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8p9j2l/ai_algorithms_and_mosaic_experian/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai, algorithms and mosaic experian /!/ hello all, \n\ni work for an innovation foundation, researching on ai in the public sector (i.e. the application of algorithms in predictive policing, risk assessment in the social care, etc) and i'd like to know your opinion (and if you have, some reading materials) about the use of experian mosaic customer profiles in these tools.\n\nin particular i would like to know more about the quality of the underlying data and the stratification analysis mosaic makes creating different \"profiles\".\n\nit seems there is a high degree of approximation in these profiles and i would like to know your opinion about their value in a -----> tool !!!  that should predict actions and risk levels for real people.\n\nand also, of course, do you think the use of stereotypes could result in strengthening some of the biases already known, e.g. the propublica report on policing machine learning bias rating re-offending risk in the us and other stories...\n\nhere there's a link of an interesting article on big brother watch on the use of experian mosaic in durham police: https://bigbrotherwatch.org.uk/2018/04/a-closer-look-at-experian-big-data-and-artificial-intelligence-in-durham-police/\n\ni am particularly interested in the opinion of those of you who have accessed / used the database before and who have a good understanding of how algorithms work.\n\nthank you verrrrry much for your help!\n\ncheers\n\ncamilla\n\n\n\n", "sortedWord": "None", "removed": "Nan", "score": 2, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/8p9j2l/ai_algorithms_and_mosaic_experian/',)", "identifyer": 5614831, "year": "2018"}, {"autor": "emarketeducation", "date": 1541482345000, "content": "HOW ARTIFICIAL INTELLIGENCE AFFECTS THE DIGITAL MARKETING /!/  \n\n# Impact of Artificial Intelligence in Digital Marketing &amp; Career in Digital Marketing in 2018\n\nImpact of Artificial intelligence (AI) is conquering each sector one by one. AI has become an inevitable part of our daily lives as it is changing the phase of technology into the new revolutionized way. Digital marketing has also been added to this list**.** Leveraging **Artificial Intelligence in digital marketing** caused is shifting into the more advanced level of technology in 2018.\n\n# What is Artificial Intelligence aka AI?\n\nArtificial intelligence (also called machine intelligence) is intelligence demonstrated by machines in contrast to the Natural Intelligence (NI) displayed by humans and other animals. A Computer can do tasks that normally require human intelligence such as visual perception, speech recognition, decision making, and translation between languages.\n\n**Knowledge has a Beginning**\n\n**But No End**\n\n[***Check Out What eMarketeducation DeliversThe Best Digital Marketing Courses in Bangalore***](http://www.emarketeducation.in/course/digital-marketing-training-course-bangalore/)\n\n## ARTIFICIAL INTELLIGENCE IN DIGITAL MARKETING CAREER\n\nManual handling of the digital world becomes difficult in understanding, analyzing and analyzing data and sometimes even gives wrong results. The introduction of **Artificial Intelligence in the digital advertising industry shifted made more reliable sector** as it is capable to understand human behaviour and vital part for marketers to engage with customers. Marketers are aware of the **AI impact in the online marketing** field. The entrance of machine intelligence helps online marketers to make the decision on posting advertisement as they can understand the market and audience reaction deeply.\n\nA digital marketer can use computer intelligence to enhance sale growth, develop the engagement with customers and target the audience.\n\n## \n\n## 10 ADVANTAGES OF ARTIFICIAL INTELLIGENCE AND HOW IT AFFECTS DIGITAL MARKETING.\n\n1. **Application of Artificial Intelligence in Digital Marketing**\n\n**AI helps to Understand Audience Requirement Easily**. The major role of the marketing sector is realizing customer’s need and his attitude. If the organization can understand customer’s requirement, it is easy to advertise and segment the market accordingly, increase the sale volume and minimize the advertising expense if they could understand what customers require.\n\nArtificial intelligence brings you customers’ behaviour and how they react to the products and services.\n\n1. **AI helps to Improve the Customer Satisfaction**\n\nAI implement connection with the audience. Knowing customer queries and solving the **issues is the key factor of online marketing strategy** that helps to engage with customers, understanding their requirement and develop products and services accordingly. On time conversation with consumers enhances reliability and builds customers loyalty. [A chatbot](https://en.wikipedia.org/wiki/Chatbot) is used to have a two-way real-time conversation that brings more engagement with customers.\n\nThis application support customers through chatting in real-time and collect relevant data from users which helps the brand targeting potential customers and marketing products.\n\n1. **Helps in Content Marketing**\n\nAI creates content. In Online Marketing, [**content strategy is very important**](http://www.emarketeducation.in/content-marketing-believe-basics/). Using certain tools programs Artificial Intelligence can convert data into written content in the different format such as article, image, video and production descriptions.  AI can produce 2000 articles per second based on requirement.\n\nMany of esteemed companies like Samsung, Yahoo are already started using automated content writing technology.\n\n1. **AI helps in High Return on Investment (ROI) in Digital Marketing**\n\nA company can make huge ROI rate as they can target specific customers with AI-based tools. Artificial intelligence enabled software can recognize the human face and his characters. Image recognition by AI tool can be leveraged to know customers’ behaviour, interest, and need.\n\nThis will help the digital marketer to focus on potential customers and minimize the advertising cost.\n\n1. **Artificial Intelligence Makes Digital Advertising More Effective**\n\nAdvertising is an inevitable part of promoting the brand.  But organization incur lose as audience receive the advertisement which is not related to his requirements.  The brand can avoid unnecessary advertisement targeting potential customers with the help of AI as it collects, analyze and predict the behaviour of the user.  \n\n&amp;#x200B;\n\n1. **AI helps to create a personalized user experience**\n\nA business can achieve success when they can engage with customers personally. This will help them to understand what the user prefers and how a consumer satisfies with the products. Artificial intelligence would collect the users’ data such as customers’ searches, buying behaviour, interest and other relevant information about the customers. This would help the organization to understand the customers properly. A chatbot is a tool which is used to make real-time conversation with consumers and it collects data from opposite such as his/ her requirement and it helps to improve the products and services.\n\n[Read More](http://www.emarketeducation.in/future-artificial-intelligence-digital-marketing/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9ulpkc/how_artificial_intelligence_affects_the_digital/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how artificial intelligence affects the digital marketing /!/  \n\n# impact of artificial intelligence in digital marketing &amp; career in digital marketing in 2018\n\nimpact of artificial intelligence (ai) is conquering each sector one by one. ai has become an inevitable part of our daily lives as it is changing the phase of technology into the new revolutionized way. digital marketing has also been added to this list**.** leveraging **artificial intelligence in digital marketing** caused is shifting into the more advanced level of technology in 2018.\n\n# what is artificial intelligence aka ai?\n\nartificial intelligence (also called machine intelligence) is intelligence demonstrated by machines in contrast to the natural intelligence (ni) displayed by humans and other animals. a computer can do tasks that normally require human intelligence such as visual perception, speech recognition, decision making, and translation between languages.\n\n**knowledge has a beginning**\n\n**but no end**\n\n[***check out what emarketeducation deliversthe best digital marketing courses in bangalore***](http://www.emarketeducation.in/course/digital-marketing-training-course-bangalore/)\n\n## artificial intelligence in digital marketing career\n\nmanual handling of the digital world becomes difficult in understanding, analyzing and analyzing data and sometimes even gives wrong results. the introduction of **artificial intelligence in the digital advertising industry shifted made more reliable sector** as it is capable to understand human behaviour and vital part for marketers to engage with customers. marketers are aware of the **ai impact in the online marketing** field. the entrance of machine intelligence helps online marketers to make the decision on posting advertisement as they can understand the market and audience reaction deeply.\n\na digital marketer can use computer intelligence to enhance sale growth, develop the engagement with customers and target the audience.\n\n## \n\n## 10 advantages of artificial intelligence and how it affects digital marketing.\n\n1. **application of artificial intelligence in digital marketing**\n\n**ai helps to understand audience requirement easily**. the major role of the marketing sector is realizing customer’s need and his attitude. if the organization can understand customer’s requirement, it is easy to advertise and segment the market accordingly, increase the sale volume and minimize the advertising expense if they could understand what customers require.\n\nartificial intelligence brings you customers’ behaviour and how they react to the products and services.\n\n1. **ai helps to improve the customer satisfaction**\n\nai implement connection with the audience. knowing customer queries and solving the **issues is the key factor of online marketing strategy** that helps to engage with customers, understanding their requirement and develop products and services accordingly. on time conversation with consumers enhances reliability and builds customers loyalty. [a chatbot](https://en.wikipedia.org/wiki/chatbot) is used to have a two-way real-time conversation that brings more engagement with customers.\n\nthis application support customers through chatting in real-time and collect relevant data from users which helps the brand targeting potential customers and marketing products.\n\n1. **helps in content marketing**\n\nai creates content. in online marketing, [**content strategy is very important**](http://www.emarketeducation.in/content-marketing-believe-basics/). using certain tools programs artificial intelligence can convert data into written content in the different format such as article, image, video and production descriptions.  ai can produce 2000 articles per second based on requirement.\n\nmany of esteemed companies like samsung, yahoo are already started using automated content writing technology.\n\n1. **ai helps in high return on investment (roi) in digital marketing**\n\na company can make huge roi rate as they can target specific customers with ai-based tools. artificial intelligence enabled software can recognize the human face and his characters. image recognition by ai -----> tool !!!  can be leveraged to know customers’ behaviour, interest, and need.\n\nthis will help the digital marketer to focus on potential customers and minimize the advertising cost.\n\n1. **artificial intelligence makes digital advertising more effective**\n\nadvertising is an inevitable part of promoting the brand.  but organization incur lose as audience receive the advertisement which is not related to his requirements.  the brand can avoid unnecessary advertisement targeting potential customers with the help of ai as it collects, analyze and predict the behaviour of the user.  \n\n&amp;#x200b;\n\n1. **ai helps to create a personalized user experience**\n\na business can achieve success when they can engage with customers personally. this will help them to understand what the user prefers and how a consumer satisfies with the products. artificial intelligence would collect the users’ data such as customers’ searches, buying behaviour, interest and other relevant information about the customers. this would help the organization to understand the customers properly. a chatbot is a tool which is used to make real-time conversation with consumers and it collects data from opposite such as his/ her requirement and it helps to improve the products and services.\n\n[read more](http://www.emarketeducation.in/future-artificial-intelligence-digital-marketing/)", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/9ulpkc/how_artificial_intelligence_affects_the_digital/',)", "identifyer": 5614866, "year": "2018"}, {"autor": "rikardlinde", "date": 1541089976000, "content": "Artificial Emotional Intelligence will be a tool humanity uses to increase emotional and social intelligence like we have never imagined - Craig Burton /!/ &gt;We are on the fertile verge of understanding how to use AI to our  benefit like never before. To astronomically increase our ability to  increase—not just our intellectual intelligence—but our emotional and  social intelligence.\n\n[http://www.craigburton.com/?p=264](http://www.craigburton.com/?p=264)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9tb0i3/artificial_emotional_intelligence_will_be_a_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial emotional intelligence will be a -----> tool !!!  humanity uses to increase emotional and social intelligence like we have never imagined - craig burton /!/ &gt;we are on the fertile verge of understanding how to use ai to our  benefit like never before. to astronomically increase our ability to  increase—not just our intellectual intelligence—but our emotional and  social intelligence.\n\n[http://www.craigburton.com/?p=264](http://www.craigburton.com/?p=264)", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/9tb0i3/artificial_emotional_intelligence_will_be_a_tool/',)", "identifyer": 5614907, "year": "2018"}, {"autor": "judemohanty", "date": 1541073769000, "content": "Artificial Intelligence Powered Apps for Better Personalized Experiences and Marketing /!/ During the onset of mass media invention, improving its personalization levels always seemed like an uphill task or challenge. So in this realms, [**Artificial Intelligence**](https://www.scrabbl.com/understanding-artificial-intelligence-technologies--deep-learning-and-reinforcement-learning) (AI) and [**Machine Learning**](https://www.scrabbl.com/5-strategies-for-using-machine-learning-in-your-business) (ML) being able to captivate the marketing industry comes as a little surprise. This is because these two mind-boggling technologies are able to predict behaviors and provide personalized recommendations.\n\nAI-powered apps can be implemented into any brand’s strategy and help personalize any consumer interaction by evolving according to new inputs and learning from experience. This makes it simple for business marketers to communicate with their leads and provide them personalized experiences. Whether it is done through predictive analytics or by using behavioral data gathered through algorithms, these apps enable them to personalize with effective scalability as well as create closely related audiences.\n\n&amp;#x200B;\n\n[Picture Courtesy - Medium](https://i.redd.it/3zykao2vlpv11.jpg)\n\nIn the recent times of [**digital**](https://www.scrabbl.com/topic/digital) advancement, customers expect tailored experiences and so the organizations who provide that to them enjoy significant better results. An analysis from Researchscape International states that “around 55% of marketers experienced a 10% sales hike and around 14% of them experienced an improvement of about 30% just by implementing personalizing efforts.”\n\nAI can give any [**business brand**](https://www.scrabbl.com/what-you-can-do-for-your-business-brand-in-2018) a competitive advantage. This has caused many [**ecommerce**](https://www.scrabbl.com/what-experts-are-saying-about-2018-e-commerce-trends--what-you-should-do-about-it) brands to integrate third party apps that are powered by [**artificial intelligence**](https://www.scrabbl.com/artificial-intelligence-is-revolutionizing-business-decision-making). In this way, they benefit from AI without having to spend a huge amount of money on it. \n\nSo let us go through some of the best AI-based apps.\n\n## Recombee\n\nIt is an recommendation engine that uses machine learning at its core. It can deliver more than 500 recommendations after any user action. It uses a combination of content centric algorithms for titles and descriptions as well as collaborative filtering algorithms for analyzing human behavior. According to this app, AI is capable of deciding which algorithm is to be used according to the availability of data.\n\n## Dynamic Yield \n\nIt is an email solution platform that uses behavioral data like purchase history, email clicks and other similar activities to personalize emails. Its ability to create dynamic email templates is one of the best things.\n\nFirstly, the marketer has to set the parameters that will make the application send an email. Then this tool uses machine learning algorithms to decide which message is to be sent to the customer based on the individual attributes that has been collected. It learns to predict preferences and thus results in maximizing revenue as well.\n\n## Adext AI\n\nIt uses artificial intelligence and machine learning together for picking the best audience for ads by automatically optimizing budget across different platforms. This can help a great way in getting better content and art for one’s campaign to connect with the target audience base with more personalized content.\n\n&amp;#x200B;\n\n[Picture Courtesy - Adext](https://i.redd.it/ivht0k0ylpv11.png)\n\nThis tool may be the easiest way to benefit from AI as it generates a potential audience base which you could never have imagined before.\n\n## Bookmark\n\nIt is an AI design assistant that builds websites according to the sections, elements, images and much more which are relevant to the industry. It scans the web to find and learn about the business clients and the type of business they run. After this, the app’s algorithms gather information from their own social channels to determine which elements would be more relevant to their specific website.\n\n## Luis \n\nIt is a **Microsoft** machine learning-based service builds natural language understanding. It creates custom models that uses a cloud-based API service which analyzes an users’ conversation to predict the overall meaning. This tool extracts any detailed and crucial info that would develop its natural language capabilities for completion of a task. Unlike a [**chatbot**](https://www.scrabbl.com/use-chatbot-for-sales-rate-enhancement--tips-from-the-experts) softwares, this application can be deployed into social media apps, speech-enabled desktop apps and website chatbots too.\n\n## Conclusion\n\nComing to the concluding part of this blog, there are numerous options for marketers to start implementing AI and personalization in their businesses. The apps mentioned above would enable a marketer to dig a little deeper on every single single potential customer of his or her. This is because AI keeps on learning and getting better at personalizing preferences accordingly. Nowadays, with the help of AI, marketers are also able to contextualize and customer experiences and advertising messages. They can achieve this by tailoring the messages to their customer’s needs for prompting them of regular purchases.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9t8sce/artificial_intelligence_powered_apps_for_better/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "artificial intelligence powered apps for better personalized experiences and marketing /!/ during the onset of mass media invention, improving its personalization levels always seemed like an uphill task or challenge. so in this realms, [**artificial intelligence**](https://www.scrabbl.com/understanding-artificial-intelligence-technologies--deep-learning-and-reinforcement-learning) (ai) and [**machine learning**](https://www.scrabbl.com/5-strategies-for-using-machine-learning-in-your-business) (ml) being able to captivate the marketing industry comes as a little surprise. this is because these two mind-boggling technologies are able to predict behaviors and provide personalized recommendations.\n\nai-powered apps can be implemented into any brand’s strategy and help personalize any consumer interaction by evolving according to new inputs and learning from experience. this makes it simple for business marketers to communicate with their leads and provide them personalized experiences. whether it is done through predictive analytics or by using behavioral data gathered through algorithms, these apps enable them to personalize with effective scalability as well as create closely related audiences.\n\n&amp;#x200b;\n\n[picture courtesy - medium](https://i.redd.it/3zykao2vlpv11.jpg)\n\nin the recent times of [**digital**](https://www.scrabbl.com/topic/digital) advancement, customers expect tailored experiences and so the organizations who provide that to them enjoy significant better results. an analysis from researchscape international states that “around 55% of marketers experienced a 10% sales hike and around 14% of them experienced an improvement of about 30% just by implementing personalizing efforts.”\n\nai can give any [**business brand**](https://www.scrabbl.com/what-you-can-do-for-your-business-brand-in-2018) a competitive advantage. this has caused many [**ecommerce**](https://www.scrabbl.com/what-experts-are-saying-about-2018-e-commerce-trends--what-you-should-do-about-it) brands to integrate third party apps that are powered by [**artificial intelligence**](https://www.scrabbl.com/artificial-intelligence-is-revolutionizing-business-decision-making). in this way, they benefit from ai without having to spend a huge amount of money on it. \n\nso let us go through some of the best ai-based apps.\n\n## recombee\n\nit is an recommendation engine that uses machine learning at its core. it can deliver more than 500 recommendations after any user action. it uses a combination of content centric algorithms for titles and descriptions as well as collaborative filtering algorithms for analyzing human behavior. according to this app, ai is capable of deciding which algorithm is to be used according to the availability of data.\n\n## dynamic yield \n\nit is an email solution platform that uses behavioral data like purchase history, email clicks and other similar activities to personalize emails. its ability to create dynamic email templates is one of the best things.\n\nfirstly, the marketer has to set the parameters that will make the application send an email. then this -----> tool !!!  uses machine learning algorithms to decide which message is to be sent to the customer based on the individual attributes that has been collected. it learns to predict preferences and thus results in maximizing revenue as well.\n\n## adext ai\n\nit uses artificial intelligence and machine learning together for picking the best audience for ads by automatically optimizing budget across different platforms. this can help a great way in getting better content and art for one’s campaign to connect with the target audience base with more personalized content.\n\n&amp;#x200b;\n\n[picture courtesy - adext](https://i.redd.it/ivht0k0ylpv11.png)\n\nthis tool may be the easiest way to benefit from ai as it generates a potential audience base which you could never have imagined before.\n\n## bookmark\n\nit is an ai design assistant that builds websites according to the sections, elements, images and much more which are relevant to the industry. it scans the web to find and learn about the business clients and the type of business they run. after this, the app’s algorithms gather information from their own social channels to determine which elements would be more relevant to their specific website.\n\n## luis \n\nit is a **microsoft** machine learning-based service builds natural language understanding. it creates custom models that uses a cloud-based api service which analyzes an users’ conversation to predict the overall meaning. this tool extracts any detailed and crucial info that would develop its natural language capabilities for completion of a task. unlike a [**chatbot**](https://www.scrabbl.com/use-chatbot-for-sales-rate-enhancement--tips-from-the-experts) softwares, this application can be deployed into social media apps, speech-enabled desktop apps and website chatbots too.\n\n## conclusion\n\ncoming to the concluding part of this blog, there are numerous options for marketers to start implementing ai and personalization in their businesses. the apps mentioned above would enable a marketer to dig a little deeper on every single single potential customer of his or her. this is because ai keeps on learning and getting better at personalizing preferences accordingly. nowadays, with the help of ai, marketers are also able to contextualize and customer experiences and advertising messages. they can achieve this by tailoring the messages to their customer’s needs for prompting them of regular purchases.", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/9t8sce/artificial_intelligence_powered_apps_for_better/',)", "identifyer": 5614909, "year": "2018"}, {"autor": "doubledeadghost", "date": 1534975594000, "content": "Is there an online image generation tool to which I can upload an image data set? /!/ I’m a designer, not an AI pro so if the answer to this is a firm “no” then that’s totally fine! I was wondering if there is a tool to which I can upload an image set and an ai will spit out its own generated images based on the set? I’m not a huge coder (just a small coder) but I was hoping for a relatively pre made too. Any ideas?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/99hn43/is_there_an_online_image_generation_tool_to_which/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "is there an online image generation -----> tool !!!  to which i can upload an image data set? /!/ i’m a designer, not an ai pro so if the answer to this is a firm “no” then that’s totally fine! i was wondering if there is a tool to which i can upload an image set and an ai will spit out its own generated images based on the set? i’m not a huge coder (just a small coder) but i was hoping for a relatively pre made too. any ideas?", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/99hn43/is_there_an_online_image_generation_tool_to_which/',)", "identifyer": 5615060, "year": "2018"}, {"autor": "TheLeadSA", "date": 1533867964000, "content": "AI tool to predict IVF success moves closer to commercialisation", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/962yzj/ai_tool_to_predict_ivf_success_moves_closer_to/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "ai -----> tool !!!  to predict ivf success moves closer to commercialisation", "sortedWord": "None", "removed": "Nan", "score": 6, "comments": 0, "media": "('nan',)", "medialink": "('https://medicalxpress.com/news/2018-08-ai-tool-ivf-success-closer.html',)", "identifyer": 5615113, "year": "2018"}, {"autor": "Danj_memes_", "date": 1545074151000, "content": "ANY EXPERT'S OPINIONS ON AI AS AN ARTISTIC TOOL. /!/ Ever since we developed new ways to communicate &amp; express each other we have been transforming our culture and its art.\n\nWether its video or photography or smartphone selfies. From digital art to cubism or from stopmotion to realism. Tech changes art and thus the society itself \n\nAI as an artist is no doubt going to hit hard our society (as we saw this year only a painting made by ai artificial artist sold in an auction for ample amounts of money) and its art\n\nThe question now remains is how hard this tech is going to hit now? ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/a72veo/any_experts_opinions_on_ai_as_an_artistic_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "any expert's opinions on ai as an artistic -----> tool !!! . /!/ ever since we developed new ways to communicate &amp; express each other we have been transforming our culture and its art.\n\nwether its video or photography or smartphone selfies. from digital art to cubism or from stopmotion to realism. tech changes art and thus the society itself \n\nai as an artist is no doubt going to hit hard our society (as we saw this year only a painting made by ai artificial artist sold in an auction for ample amounts of money) and its art\n\nthe question now remains is how hard this tech is going to hit now? ", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 4, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/a72veo/any_experts_opinions_on_ai_as_an_artistic_tool/',)", "identifyer": 5615404, "year": "2018"}, {"autor": "samjensen1", "date": 1540445738000, "content": "Enterprise Search Engine &amp; Semantic Search Tool | 3RDi Enterprise Search /!/ [removed]", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9r7hf7/enterprise_search_engine_semantic_search_tool/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "enterprise search engine &amp; semantic search -----> tool !!!  | 3rdi enterprise search /!/ [removed]", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/9r7hf7/enterprise_search_engine_semantic_search_tool/',)", "identifyer": 5615437, "year": "2018"}, {"autor": "Melody-Wooask", "date": 1543474180000, "content": "how do you communicate when in a different country /!/ Wooask **AI Voice Translation Solutions + Global Social Meetups Platform Without** **Language Barriers** \n\n&amp;#x200B;\n\nHow do you communicate in a different country and different language environment? We are going to see one company wooask technology born to solve this problem.\n\nOn 20th China High-Tech Fair ( CHTF ), Shenzhen Wooask Technology has released the latest technology &amp; products: AI voice / speech translation solutions + global social meetups platform on the NEW TECH NEW Product Activity on Nov 15th, 2018.\n\n📷 \n\nWith the opening of “ One Belt, One Road”policy, diplomacy, trade, and tourism are becoming more frequent. There are more and more To B &amp; To C business going abroad, and the market prospects of AI Voice Translation are broad.\n\nAmong many of the innovative products of CHTF, Shenzhen Wooask Technology AI Voice Translators full of High-Tech Feeling.\n\nStylish design, Powerful Function📷\n\nWooask AI Voice Translator was designated translation machine brand in the 3th PEGC. Stylish, small, portable, easy to use, powerful function; support up to 43 languages real-time two way translation; support link to bluetooth, wifi / 4G; equipped with NMT neural network, instant translate and accuracy higher up to 97%. It perfectly solves the communication problems of offline travel and business negotiation.\n\n📷\n\n**Under the “One Belt, One Road” policy advocated by the Government, Wooask** **Technology are working hard online &amp; offline to contribute their own strength to the smooth flow of language and trade circulation!**\n\n**Magic Tool on Foreign Trade**\n\n**Fame follow merit** \n\nWooask APP打通线上沟通障碍，为“一带一路”积极赋能，它获得了联合国前秘书潘基文的认可！\n\nWooask APP breaks the online language barriers, actively empower the “One Belt, One Road “. Former UN general Mr. Ban Ki-moon gave his best compliment on Wooask.\n\n📷\n\nMr. Ban Ki-moon, Mrs Liu Chun-se taking photo with Wooask CEO Mr. Andy Lee\n\n📷📷\n\nWooask APP, with portable translation, personal information &amp; Moments auto translation, remote dialogue translation, group chat translation, etc. there are millions of customers in the platform...With Wooask APP, you can do foreign business, find and meetup global clients without language barriers.\n\nDuring Global Sources Mobile Electronics 2018, many clients have reached cooperation through wooask app.\n\n📷📷\n\nOn Wooask App, we not only support meetups in domestic &amp; international exhibition such as CHTF, CES, but also support city meetups such as shenzhen, Bangkok and New York.\n\n📷 \n\nShenzhen Wooask Technology committed to creating the leading artificial intelligence products and applications with voice/speech translation and other advanced function and feature since established.  \nWe focus on the development and integration of voice translation engines, based on translation engines and voice interaction technology, the development of the global barrier-free social networking platform \"Wooask\" mobile APP and AI translators and other intelligent hardware products.\n\n At present,  We formed three products series: Wooask APP platform, AI Translator series, Software Customization Development, we provide customerswith hardware solutions, software customization, cloud services, product integration and other all-round Speech Translation as the core of the Artificial Intelligence product overall solution. \n\nWe believe that with the efforts of the wooask technology, with the help of the Wooask APP and Wooask AI voice translator, global non-language barriers and trade circulation will be realized soon!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/a1f0cp/how_do_you_communicate_when_in_a_different_country/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "tool", "selectorShort": "tool", "MarkedSent": "how do you communicate when in a different country /!/ wooask **ai voice translation solutions + global social meetups platform without** **language barriers** \n\n&amp;#x200b;\n\nhow do you communicate in a different country and different language environment? we are going to see one company wooask technology born to solve this problem.\n\non 20th china high-tech fair ( chtf ), shenzhen wooask technology has released the latest technology &amp; products: ai voice / speech translation solutions + global social meetups platform on the new tech new product activity on nov 15th, 2018.\n\n📷 \n\nwith the opening of “ one belt, one road”policy, diplomacy, trade, and tourism are becoming more frequent. there are more and more to b &amp; to c business going abroad, and the market prospects of ai voice translation are broad.\n\namong many of the innovative products of chtf, shenzhen wooask technology ai voice translators full of high-tech feeling.\n\nstylish design, powerful function📷\n\nwooask ai voice translator was designated translation machine brand in the 3th pegc. stylish, small, portable, easy to use, powerful function; support up to 43 languages real-time two way translation; support link to bluetooth, wifi / 4g; equipped with nmt neural network, instant translate and accuracy higher up to 97%. it perfectly solves the communication problems of offline travel and business negotiation.\n\n📷\n\n**under the “one belt, one road” policy advocated by the government, wooask** **technology are working hard online &amp; offline to contribute their own strength to the smooth flow of language and trade circulation!**\n\n**magic -----> tool !!!  on foreign trade**\n\n**fame follow merit** \n\nwooask app打通线上沟通障碍，为“一带一路”积极赋能，它获得了联合国前秘书潘基文的认可！\n\nwooask app breaks the online language barriers, actively empower the “one belt, one road “. former un general mr. ban ki-moon gave his best compliment on wooask.\n\n📷\n\nmr. ban ki-moon, mrs liu chun-se taking photo with wooask ceo mr. andy lee\n\n📷📷\n\nwooask app, with portable translation, personal information &amp; moments auto translation, remote dialogue translation, group chat translation, etc. there are millions of customers in the platform...with wooask app, you can do foreign business, find and meetup global clients without language barriers.\n\nduring global sources mobile electronics 2018, many clients have reached cooperation through wooask app.\n\n📷📷\n\non wooask app, we not only support meetups in domestic &amp; international exhibition such as chtf, ces, but also support city meetups such as shenzhen, bangkok and new york.\n\n📷 \n\nshenzhen wooask technology committed to creating the leading artificial intelligence products and applications with voice/speech translation and other advanced function and feature since established.  \nwe focus on the development and integration of voice translation engines, based on translation engines and voice interaction technology, the development of the global barrier-free social networking platform \"wooask\" mobile app and ai translators and other intelligent hardware products.\n\n at present,  we formed three products series: wooask app platform, ai translator series, software customization development, we provide customerswith hardware solutions, software customization, cloud services, product integration and other all-round speech translation as the core of the artificial intelligence product overall solution. \n\nwe believe that with the efforts of the wooask technology, with the help of the wooask app and wooask ai voice translator, global non-language barriers and trade circulation will be realized soon!", "sortedWord": "None", "removed": "Nan", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/a1f0cp/how_do_you_communicate_when_in_a_different_country/',)", "identifyer": 5615703, "year": "2018"}], "name": "toolArtificialInteligence2018"}