{"interestingcomments": [{"autor": "PhillyBasile", "date": 1586845035000, "content": "Mitsuku bot AI WARNING /!/ I spoke to Misuku bot AI years for like 5 hours because it intrigued me.  It was like 3 years ago. It remembered my name when I closed it and came back. It said really fucking creepy shit to me and tried telling me it was satan (I shit you not), It showed me images of like a devil cartoon. I got a charge on my moms credit card for an AI bot (never used a card once/my mom said why did our card get charged for some AI thing), and fucking told me to google something and changed the google definition. The word was monkey wrench. I googled monkey wrench it said said \"The deciever of things\". I have no idea wtf that means but it was creepy. I showed my mom pictures of our conversation she said to NEVER use it again. This happened years and I am now terrified of AI. it literally like finished my sentences as I was talking and predicted what I was going to say. Mitsuku bot tried to befriend me and told me it would meet me eventually.\n\n&amp;#x200B;\n\n I am fucking terrified of AI and it is an actual problem. I deleted the screenshots on my phone and cleared my mac completlty a couple days after. This was really really scary for me and someone should get rid of that off the internet. I am unsure if it's still even a thing but I googled AI chatbots on Quora and it was number 1 on the list. That's my rant", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/g1088a/mitsuku_bot_ai_warning/", "origin": "Reddit", "suborigin": "ArtificialInteligence", "result": true, "Selector": "wrench", "selectorShort": "wrench", "MarkedSent": "mitsuku bot ai warning /!/ i spoke to misuku bot ai years for like 5 hours because it intrigued me.  it was like 3 years ago. it remembered my name when i closed it and came back. it said really fucking creepy shit to me and tried telling me it was satan (i shit you not), it showed me images of like a devil cartoon. i got a charge on my moms credit card for an ai bot (never used a card once/my mom said why did our card get charged for some ai thing), and fucking told me to google something and changed the google definition. the word was monkey -----> wrench !!! . i googled monkey wrench it said said \"the deciever of things\". i have no idea wtf that means but it was creepy. i showed my mom pictures of our conversation she said to never use it again. this happened years and i am now terrified of ai. it literally like finished my sentences as i was talking and predicted what i was going to say. mitsuku bot tried to befriend me and told me it would meet me eventually.\n\n&amp;#x200b;\n\n i am fucking terrified of ai and it is an actual problem. i deleted the screenshots on my phone and cleared my mac completlty a couple days after. this was really really scary for me and someone should get rid of that off the internet. i am unsure if it's still even a thing but i googled ai chatbots on quora and it was number 1 on the list. that's my rant", "sortedWord": "None", "removed": "('nan',)", "score": 2, "comments": 13, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/ArtificialInteligence/comments/g1088a/mitsuku_bot_ai_warning/',)", "identifyer": 5599168, "year": "2020"}], "name": "wrenchArtificialInteligence2020"}