{"interestingcomments": [{"Unnamed: 0": 529782, "autor": "NeatHedgehog", "date": 1627243968000, "content": "[Question] how to stop electric fence from energizing chicken tractor /!/ I thought the folks here might know a thing or two about electric fences, moreso than general DIY.\n\nI have a chicken tractor, 6x6ft, covered in chicken wire and sheet metal (for shade). I have a .04 joule 2 mile solar electric fence charger connected to a two-string fence around the tractor, and grounded to 4x 4ft grounding rods 10ft apart from each other.\n\nI set four wooden fence posts, one at each corner of the tractor, about six / eight inches away. I strung the fence wire between plastic insulators screwed to the posts.\n\nWhen I turn the electric fence on everything seems to be working correctly at first. The ground system will not register on my fence tester when the fence is not shorted, reads at &lt;200v when shorted, and the fence wire hits at about 7kv.\n\nThe issue I'm seeing is the chicken wire covering the tractor reads at 200v when I check it with the fence tester at all times with the electric fence turned on, shorted or not. I tripled checked everything to make sure no stray wires are touching the fence, no sticks or twigs or even grass are bridging the gap between the fence and the tractor.\n\nThe fence is turned off right now. I'd rather not zap my chickens just for bumping the sides of the tractor or have some kind of floating voltage issue. I tried moving the ground rods around (closer to the tractor, further from the tractor, etc), but nothing changed. I set the fence further away from the tractor, about a foot and a half, thinking maybe this was some kind of induction issue, but again no change.\n\nI am a bit confused, as the tractor frame is made of wood which rests on the ground, the chicken wire and sheet metal don't even touch the ground.\n\nAny ideas on what I need to change about this setup?", "link": "https://www.reddit.com/r/homestead/comments/oriz2s/question_how_to_stop_electric_fence_from/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[question] how to stop electric fence from energizing chicken tractor /!/ i thought the folks here might know a thing or two about electric fences, moreso than general -----> diy !!! .\n\ni have a chicken tractor, 6x6ft, covered in chicken wire and sheet metal (for shade). i have a .04 joule 2 mile solar electric fence charger connected to a two-string fence around the tractor, and grounded to 4x 4ft grounding rods 10ft apart from each other.\n\ni set four wooden fence posts, one at each corner of the tractor, about six / eight inches away. i strung the fence wire between plastic insulators screwed to the posts.\n\nwhen i turn the electric fence on everything seems to be working correctly at first. the ground system will not register on my fence tester when the fence is not shorted, reads at &lt;200v when shorted, and the fence wire hits at about 7kv.\n\nthe issue i'm seeing is the chicken wire covering the tractor reads at 200v when i check it with the fence tester at all times with the electric fence turned on, shorted or not. i tripled checked everything to make sure no stray wires are touching the fence, no sticks or twigs or even grass are bridging the gap between the fence and the tractor.\n\nthe fence is turned off right now. i'd rather not zap my chickens just for bumping the sides of the tractor or have some kind of floating voltage issue. i tried moving the ground rods around (closer to the tractor, further from the tractor, etc), but nothing changed. i set the fence further away from the tractor, about a foot and a half, thinking maybe this was some kind of induction issue, but again no change.\n\ni am a bit confused, as the tractor frame is made of wood which rests on the ground, the chicken wire and sheet metal don't even touch the ground.\n\nany ideas on what i need to change about this setup?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/oriz2s/question_how_to_stop_electric_fence_from/", "identifyer": 529782, "year": "2021"}, {"Unnamed: 0": 531082, "autor": "PunkNBeans", "date": 1631408725000, "content": "My first DIY solar power test run /!/ This is my first time trying to set up a solar setup. Im attempting a test run before I need to rely on it. I know there's gonna be problems here and so im trying to troubleshoot here. It allows me to power some cell phones and tool batteries atm but I feel like it should be charging the batteries more so than what I think it does.\n\nI've got 6 (275W) solar panels hooked up. 2 sets of 3 hooked together in series . The two pairs are hooked in parallel. \n\nThey go through 10awg solar wire to a 20amp circuit breaker into a 60amp mppt solar charge controller. \n\nThe charge controller is hooked up to batteries by a makeshift splice of 10awg to 6awg wire.  This was necessary to have a large enough battery terminal to connect the wire to the batteries. I know this is not ideal, I'm not sure how to do it better. \n\nThe solar charge controller connects to the batteries through a 60 amp circuit breaker. \n\nThe batteries are (4) 6V golf cart batteries wired in series to accommodate the 24V system. There is an 80amp fuse on the positive germinal of the battery. \n\nThe 3000W inverter is hooked up to the batteries via 4awg wire to the positive and negative terminals.\n\nIt doesn't seem to charge up easily past 25V and drops to at least 24.9V everytime I put any load in it.\n\n\n\nThank you so much for reading through my post, any advice at all would help. I literally just read a book on electronics and decided I wanted to better understand solar power by hooking up my shed and one day go off grid.", "link": "https://www.reddit.com/r/homestead/comments/pmj71x/my_first_diy_solar_power_test_run/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my first -----> diy !!!  solar power test run /!/ this is my first time trying to set up a solar setup. im attempting a test run before i need to rely on it. i know there's gonna be problems here and so im trying to troubleshoot here. it allows me to power some cell phones and tool batteries atm but i feel like it should be charging the batteries more so than what i think it does.\n\ni've got 6 (275w) solar panels hooked up. 2 sets of 3 hooked together in series . the two pairs are hooked in parallel. \n\nthey go through 10awg solar wire to a 20amp circuit breaker into a 60amp mppt solar charge controller. \n\nthe charge controller is hooked up to batteries by a makeshift splice of 10awg to 6awg wire.  this was necessary to have a large enough battery terminal to connect the wire to the batteries. i know this is not ideal, i'm not sure how to do it better. \n\nthe solar charge controller connects to the batteries through a 60 amp circuit breaker. \n\nthe batteries are (4) 6v golf cart batteries wired in series to accommodate the 24v system. there is an 80amp fuse on the positive germinal of the battery. \n\nthe 3000w inverter is hooked up to the batteries via 4awg wire to the positive and negative terminals.\n\nit doesn't seem to charge up easily past 25v and drops to at least 24.9v everytime i put any load in it.\n\n\n\nthank you so much for reading through my post, any advice at all would help. i literally just read a book on electronics and decided i wanted to better understand solar power by hooking up my shed and one day go off grid.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/pmj71x/my_first_diy_solar_power_test_run/", "identifyer": 531082, "year": "2021"}, {"Unnamed: 0": 533657, "autor": "zoolilba", "date": 1609590456000, "content": "Can anyone recommend ways of moving firewood logs out of the woods with limited resources. /!/ I'm planning on cutting my firewood this early spring and i'm trying to find ways to be more efficient. This summer I got about 3 cords free but diy cutting and hauling. It took almost 4 weeks working after work and nearly killed by back. I couldn't get close with the truck and the ground was so uneven it was hard to use a wheel burrow.  I have access to a pickup truck, I own a comealong and some good straps. I honestly don't have the money right now to buy or rent a tractor or atv. At best I could afford an electric wench but it might be in time for this spring. There must be some old fashioned ways of moving firewood. My best thought was maybe making some kind of sled or something.", "link": "https://www.reddit.com/r/homestead/comments/kowpxi/can_anyone_recommend_ways_of_moving_firewood_logs/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "can anyone recommend ways of moving firewood logs out of the woods with limited resources. /!/ i'm planning on cutting my firewood this early spring and i'm trying to find ways to be more efficient. this summer i got about 3 cords free but -----> diy !!!  cutting and hauling. it took almost 4 weeks working after work and nearly killed by back. i couldn't get close with the truck and the ground was so uneven it was hard to use a wheel burrow.  i have access to a pickup truck, i own a comealong and some good straps. i honestly don't have the money right now to buy or rent a tractor or atv. at best i could afford an electric wench but it might be in time for this spring. there must be some old fashioned ways of moving firewood. my best thought was maybe making some kind of sled or something.", "sortedWord": "None", "removed": null, "score": 1, "comments": 22, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/kowpxi/can_anyone_recommend_ways_of_moving_firewood_logs/", "identifyer": 533657, "year": "2021"}], "name": "diyhomestead2021"}