{"interestingcomments": [{"Unnamed: 0": 509770, "autor": "tuliprox", "date": 1606064910000, "content": "Where to Start (learning)? /!/ There is SO. MUCH. to learn regarding homesteading/living self-sufficiently. So my fiance (31 M) and I (22 F) are currently working full time jobs and living at my fiancé's dad's house (lost our condo due to covid caused financial issues). We are saving up to move out and buy our own land (about 4-8 acres of fully wooded, undeveloped land, preferably with a water source and preferably near mountains) up in TN, KY, or CO (we currently live in TX; my fam and I moved here from OH over 10 yrs ago, and his fam and him moved here from Georgia about 20 yrs ago, and from CO to Georgia about 5 yrs before that).\n\nWe plan to live in a temporary shelter/our minivan given to us by his dad (after both of our cars broke down/got wrecked) with our 6 lbs female intact 2 yr old kitty and 3.5 lbs female spayed 13 yr old yorkie while we build our own house from scratch using as much building material as we can from our land (ie using the wood from all of the trees we'll need to fell to clear space for a house, shed, kennels, etc.) and to live as self-sufficiently as possible so that neither of us have to work \"normal/typical\" jobs ever again. I don't mind working hard at all- as long as I'm with my hubby and get to take breaks/eat, go at my own pace, etc. I just hate having to drive 45 min away to work, be forced to stay on my feet for 10+ hrs a day, and punch a clock and never be able to take any break whatsoever unless I'm on lunch or clocked out to go home. But any time we go camping, I have a blast chopping firewood and searching for wood and hiking and sweating my ass of working hard af. I enjoy it, just on my own time and while being around my hubby. We are about to hit our 4 yr anniversary (not legally married yet, just common-law married) of our first official date this December. We are still attached at the hip any time we aren't at work. We are one of the only couples I've seen who almost never get sick of each other lol; even before corona we were almost always together 24/7 besides when at work ever since we had been officially dating for about... somewhere around 1-3 months?\n\nUgh, sorry, I always write the longest posts lol I'm pretty sure I have undiagnosed adhd (trying to see a psych about it, kinda... also having anxiety about that tho) so sorry for getting off track so often and writing so damn much lol.\n\nAnyways. My fiance did the math the other day and figured out exactly how much we each need to save per paycheck so that we will have all of the money we need (for the land itself, all of the supplies/tools/equipment/etc., and a nest egg in case of any emergencies) in one year. The app (earnin) i had been using to automatically save money from my paychecks doesn't let me save that much, so I had to switch to another app. I decided to download Acorns, since it even invests your money. I figure every little bit helps, right? So I just set it to save the amount I need to save every week, and I withdrew all my savings from earnin yesterday so it should hit my bank today, so I plan on moving it all into my acorns account today in a Conservative slow but steady growth for short term investments mix. So hopefully that will help us have some extra emergency money, which of course is always great to have. I also set it to save my spare digital change as well since again, every lite bit will help!\n\nSo as of now, we plan on buying the land and moving somewhere around February-May of 2022. We want to make sure we have as much time as possible to prepare before our first winter there on our own since it will be much colder than the winters here in TX, and we'll be building our own shelter and house. \n\nSo until then, we are trying to learn, practice, research, etc., as much as possible while we save/wait. My fiance has already filled about 40% of a notebook with info/notes on trapping, snaring, and braiding paracord (to make things for ourselves as well as to sell online to make some side income since we won't be working regular jobs, and instead relying on growing/trapping/hunting and selling furs, woodworking, etc etc).\n\nI need to start doing this as well, but there's just so much to learn idk where to even start! I can't prioritise what is the most important thing to start learning first like I know I need to learn about gardening/growing fruits, veggies, herbs, tobacco (we vape, but I want to grow tobacco to have a backup nicotine source in case we ever run out of money for bulk DIY vape liquid ingredients, new mods if ours break/stop working, etc etc.), marijuana (we used to be addicted to H, so nicotine, marijuana, and occasionally psychedelics are our vices we allow ourselves to keep us off that hard shit), shrooms, poppies (since we'll be living rurally and likely far way from hopsitals, we want to have as many natural sources of pain relief and medications as possible on hand in case of any injuries or illnesses if hospital is super far away), etc. I know we'll need to learn about skinning different types of animals we may catch, and which furs are worth selling and/or making clothes and stuff out of, how to tan hides, etc. And then there's learning how to extract essential oils from herbs (like lemongrass, lavender, etc etc), using essential oils for different purposes, learning how to make our own soap, shampoo, conditioner (we both have long, thick, curly, easily-frizzed hair), deodorant, toothpaste, lotion (I have dry and sensitive skin), etc. We also plan on raising/breeding dogs, cats, chickens, goats, and possibly ducks and maybe other animal(s) as well. I'm a dog trainer so ill also be doing that for extra income. We'll need to fell a ton of trees and remove lots of stumps and mill the timber (which my fiance has already looked into how to do), we'll want to plant a bunch of trees when we first get there so that later on our land will be filled with the perfect trees for fruit, sap, wood for woodworking and building, habitats for wild animals, etc.... THERES JUST SO MUCH!! Every time I try and sit down and learn, I get so overwhelmed thinking about everything and not knowing where to start and end up never doing anything. So I need help lol! Where should I start? What are the most important topics to begin with and why? Any inspiration/motivation/interesting facts or tips about any of these topics or related topics to help pique my interest/motivation are highly welcomed as well!! TIA!!\n\nTl;dr: overwhelmed by how much we need to learn while we wait/save to move out and start homesteading/living self-sustainably with my fiance and our small cat and small dog and building our own house, shed, kennels, greenhouse, etc., as well as raising/breeding dogs, cats, goats, chickens, etc. Where should I start?\n\nP.S. cross-posting this across a few related sub-reddits btw", "link": "https://www.reddit.com/r/homestead/comments/jyz4vb/where_to_start_learning/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "we want to make", "selectorShort": "make", "MarkedSent": "where to start (learning)? /!/ there is so. much. to learn regarding homesteading/living self-sufficiently. so my fiance (31 m) and i (22 f) are currently working full time jobs and living at my fiancé's dad's house (lost our condo due to covid caused financial issues). we are saving up to move out and buy our own land (about 4-8 acres of fully wooded, undeveloped land, preferably with a water source and preferably near mountains) up in tn, ky, or co (we currently live in tx; my fam and i moved here from oh over 10 yrs ago, and his fam and him moved here from georgia about 20 yrs ago, and from co to georgia about 5 yrs before that).\n\nwe plan to live in a temporary shelter/our minivan given to us by his dad (after both of our cars broke down/got wrecked) with our 6 lbs female intact 2 yr old kitty and 3.5 lbs female spayed 13 yr old yorkie while we build our own house from scratch using as much building material as we can from our land (ie using the wood from all of the trees we'll need to fell to clear space for a house, shed, kennels, etc.) and to live as self-sufficiently as possible so that neither of us have to work \"normal/typical\" jobs ever again. i don't mind working hard at all- as long as i'm with my hubby and get to take breaks/eat, go at my own pace, etc. i just hate having to drive 45 min away to work, be forced to stay on my feet for 10+ hrs a day, and punch a clock and never be able to take any break whatsoever unless i'm on lunch or clocked out to go home. but any time we go camping, i have a blast chopping firewood and searching for wood and hiking and sweating my ass of working hard af. i enjoy it, just on my own time and while being around my hubby. we are about to hit our 4 yr anniversary (not legally married yet, just common-law married) of our first official date this december. we are still attached at the hip any time we aren't at work. we are one of the only couples i've seen who almost never get sick of each other lol; even before corona we were almost always together 24/7 besides when at work ever since we had been officially dating for about... somewhere around 1-3 months?\n\nugh, sorry, i always write the longest posts lol i'm pretty sure i have undiagnosed adhd (trying to see a psych about it, kinda... also having anxiety about that tho) so sorry for getting off track so often and writing so damn much lol.\n\nanyways. my fiance did the math the other day and figured out exactly how much we each need to save per paycheck so that we will have all of the money we need (for the land itself, all of the supplies/tools/equipment/etc., and a nest egg in case of any emergencies) in one year. the app (earnin) i had been using to automatically save money from my paychecks doesn't let me save that much, so i had to switch to another app. i decided to download acorns, since it even invests your money. i figure every little bit helps, right? so i just set it to save the amount i need to save every week, and i withdrew all my savings from earnin yesterday so it should hit my bank today, so i plan on moving it all into my acorns account today in a conservative slow but steady growth for short term investments mix. so hopefully that will help us have some extra emergency money, which of course is always great to have. i also set it to save my spare digital change as well since again, every lite bit will help!\n\nso as of now, we plan on buying the land and moving somewhere around february-may of 2022. -----> we !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure -----> we !!!  have as much time as possible -----> to !!!  prepare before our first winter there on our own since it will be much colder than the winters here in tx, and -----> we !!! 'll be building our own shelter and house. \n\nso until then, we are trying to learn, practice, research, etc., as much as possible while we save/wait. my fiance has already filled about 40% of a notebook with info/notes on trapping, snaring, and braiding paracord (to make things for ourselves as well as to sell online to make some side income since we won't be working regular jobs, and instead relying on growing/trapping/hunting and selling furs, woodworking, etc etc).\n\ni need to start doing this as well, but there's just so much to learn idk where to even start! i can't prioritise what is the most important thing to start learning first like i know i need to learn about gardening/growing fruits, veggies, herbs, tobacco (we vape, but i want to grow tobacco to have a backup nicotine source in case we ever run out of money for bulk diy vape liquid ingredients, new mods if ours break/stop working, etc etc.), marijuana (we used to be addicted to h, so nicotine, marijuana, and occasionally psychedelics are our vices we allow ourselves to keep us off that hard shit), shrooms, poppies (since we'll be living rurally and likely far way from hopsitals, we want to have as many natural sources of pain relief and medications as possible on hand in case of any injuries or illnesses if hospital is super far away), etc. i know we'll need to learn about skinning different types of animals we may catch, and which furs are worth selling and/or making clothes and stuff out of, how to tan hides, etc. and then there's learning how to extract essential oils from herbs (like lemongrass, lavender, etc etc), using essential oils for different purposes, learning how to make our own soap, shampoo, conditioner (we both have long, thick, curly, easily-frizzed hair), deodorant, toothpaste, lotion (i have dry and sensitive skin), etc. we also plan on raising/breeding dogs, cats, chickens, goats, and possibly ducks and maybe other animal(s) as well. i'm a dog trainer so ill also be doing that for extra income. we'll need to fell a ton of trees and remove lots of stumps and mill the timber (which my fiance has already looked into how to do), we'll want to plant a bunch of trees when we first get there so that later on our land will be filled with the perfect trees for fruit, sap, wood for woodworking and building, habitats for wild animals, etc.... theres just so much!! every time i try and sit down and learn, i get so overwhelmed thinking about everything and not knowing where to start and end up never doing anything. so i need help lol! where should i start? what are the most important topics to begin with and why? any inspiration/motivation/interesting facts or tips about any of these topics or related topics to help pique my interest/motivation are highly welcomed as well!! tia!!\n\ntl;dr: overwhelmed by how much we need to learn while we wait/save to move out and start homesteading/living self-sustainably with my fiance and our small cat and small dog and building our own house, shed, kennels, greenhouse, etc., as well as raising/breeding dogs, cats, goats, chickens, etc. where should i start?\n\np.s. cross-posting this across a few related sub-reddits btw", "sortedWord": "None", "removed": null, "score": 1, "comments": 25, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/jyz4vb/where_to_start_learning/", "identifyer": 509770, "year": "2020"}, {"Unnamed: 0": 510559, "autor": "zirge", "date": 1588707140000, "content": "New 3-Acre Homestead, Deciding on Mowers/Tractors/Equipment /!/ Hello! \n\nMy wife and I are moving to our dream home and homestead very soon! It is a small scale homestead, we are 20 minutes to a city, and we both work full time. So we wanted something manageable and able to stay close. \n\nIt is a 3 Acre property with nearly every bit of it as cleared pasture/grass. So out of the 3 acres, 1.75 Acres are flat grass. We have a large house and a barn already on the property. \n\nWe live in the south and things are starting to heat up. Which means growing! This also means grass management. Now -- our long term plan is to have sheep run the main pasture and they would be the grass management we need for around 1/2 of the land. However, we are starting slow, since we both work full time. It's possible that sheep are still \\~3 years away if not more. We are starting with egg chickens, then meat chickens, rabbits, and bees, then will adventure from there. And even after we get sheep, there will still be grass management for the areas that aren't the pasture. \n\nSo here I am trying to decide about yard equipment. I am going to need to make a purchase within the first month probably. So I see myself having 3 options: A \\[Sub\\]Compact Tractor, a riding lawn mower, or a Zero Turn mower. \n\n* \\[Sub\\]Compact Tractor: Most expensive option, but provides the most utility. I have two gravel driveways on the property (\\~7000 sq/ft total) that would need to be maintained/graded every few years. Would also provide mowing, moving soil/mulch with the bucket loader, and various other aspects. I am talking for example the Kubota BX line. \n* Zero Turn Mower: Middle cost option, fastest mowing. Can hitch onto the back which would allow for towing loads of soil/mulch, etc. \n* Riding Lawn Mower: Cheapest option, usually many available on Craigslist. Can probably hitch onto the back to tow smaller loads. \n\nHoping to get some input that may help us make a decision here.", "link": "https://www.reddit.com/r/homestead/comments/ge4dbl/new_3acre_homestead_deciding_on/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "us make", "selectorShort": "make", "MarkedSent": "new 3-acre homestead, deciding on mowers/tractors/equipment /!/ hello! \n\nmy wife and i are moving to our dream home and homestead very soon! it is a small scale homestead, we are 20 minutes to a city, and we both work full time. so we wanted something manageable and able to stay close. \n\nit is a 3 acre property with nearly every bit of it as cleared pasture/grass. so out of the 3 acres, 1.75 acres are flat grass. we have a large house and a barn already on the property. \n\nwe live in the south and things are starting to heat up. which means growing! this also means grass management. now -- our long term plan is to have sheep run the main pasture and they would be the grass management we need for around 1/2 of the land. however, we are starting slow, since we both work full time. it's possible that sheep are still \\~3 years away if not more. we are starting with egg chickens, then meat chickens, rabbits, and bees, then will adventure from there. and even after we get sheep, there will still be grass management for the areas that aren't the pasture. \n\nso here i am trying to decide about yard equipment. i am going to need to make a purchase within the first month probably. so i see myself having 3 options: a \\[sub\\]compact tractor, a riding lawn mower, or a zero turn mower. \n\n* \\[sub\\]compact tractor: most expensive option, but provides the most utility. i have two gravel driveways on the property (\\~7000 sq/ft total) that would need to be maintained/graded every few years. would also provide mowing, moving soil/mulch with the bucket loader, and various other aspects. i am talking for example the kubota bx line. \n* zero turn mower: middle cost option, fastest mowing. can hitch onto the back which would allow for towing loads of soil/mulch, etc. \n* riding lawn mower: cheapest option, usually many available on craigslist. can probably hitch onto the back to tow smaller loads. \n\nhoping to get some input that may help -----> us !!!  -----> make !!!  a decision here.", "sortedWord": "None", "removed": null, "score": 3, "comments": 27, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/ge4dbl/new_3acre_homestead_deciding_on/", "identifyer": 510559, "year": "2020"}, {"Unnamed: 0": 515514, "autor": "KeyHistorian", "date": 1585833637000, "content": "Looking for name ideas. (i know, another one of \"those\" posts) /!/ So we have been homesteading for a long time, but our business has been unrelated. We actually grew trees until last week. In light of recent events (the \"C\" word) we have decided to make a life change. We now want to turn our operation into a farm. Chickens, Pigs, vegetables, fruit and berries. We kind of jumped in with both feet at the spur of the moment. Woke up one morning, ordered hundreds of chickens, coops, ect. bought thousands of seeds, lumber to build pens, and pigs. Bought a tractor, wood chipper, tiller, just pretty much went nuts across 48 hours. I worked on farms all through high school and college so its not uncharted territory for me.  If we end up flat broke and land on our faces then i will still be happy knowing i went broke trying to take care of our community. \n\nWe live in a rural area and were hard hit by the \"C\"  word. Our grocery store shelves went empty in less than 2 days and the few farms we have in the area sold out within a week.  A lot of people struggled for food for a few weeks until we got re-supplied. \n\nWe're starting this farm out of want to support our local community as the \"C\" word really opened our eyes as to how unprepared our community is.\n\nWe want our farm name to somehow speak to that effect or reflect on why we started. but for the life of me i can't think of a word that means what that is. I'm not a creative person, so finding the right name is going to be the hardest part of this venture which is why i am turning to reddit as a sounding board. \n\nAnybody have suggestions?", "link": "https://www.reddit.com/r/homestead/comments/ftm7pm/looking_for_name_ideas_i_know_another_one_of/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "we have decided to make", "selectorShort": "make", "MarkedSent": "looking for name ideas. (i know, another one of \"those\" posts) /!/ so we have been homesteading for a long time, but our business has been unrelated. we actually grew trees until last week. in light of recent events (the \"c\" word) -----> we !!!  -----> have !!!  -----> decided !!!  -----> to !!!  -----> make !!!  a life change. we now want to turn our operation into a farm. chickens, pigs, vegetables, fruit and berries. we kind of jumped in with both feet at the spur of the moment. woke up one morning, ordered hundreds of chickens, coops, ect. bought thousands of seeds, lumber to build pens, and pigs. bought a tractor, wood chipper, tiller, just pretty much went nuts across 48 hours. i worked on farms all through high school and college so its not uncharted territory for me.  if we end up flat broke and land on our faces then i will still be happy knowing i went broke trying to take care of our community. \n\nwe live in a rural area and were hard hit by the \"c\"  word. our grocery store shelves went empty in less than 2 days and the few farms we have in the area sold out within a week.  a lot of people struggled for food for a few weeks until we got re-supplied. \n\nwe're starting this farm out of want to support our local community as the \"c\" word really opened our eyes as to how unprepared our community is.\n\nwe want our farm name to somehow speak to that effect or reflect on why we started. but for the life of me i can't think of a word that means what that is. i'm not a creative person, so finding the right name is going to be the hardest part of this venture which is why i am turning to reddit as a sounding board. \n\nanybody have suggestions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/ftm7pm/looking_for_name_ideas_i_know_another_one_of/", "identifyer": 515514, "year": "2020"}], "name": "makehomestead2020"}