{"interestingcomments": [{"Unnamed: 0": 402889, "autor": "davidjones357", "date": 1599744372000, "content": "Serviced my petrol lawnmower that wasn't starting /!/ # How it started\n\nSo I have a lawnmower which wasn't starting at all, no matter how many times I pulled the starter rope thing. Owned for like 15 years and it hasn't been serviced once. Decided it was time to service it. It was getting progressively harder to start it (with LOTS of black smoke when first started), until the point where it would no longer start at all.\n\nWatched this video on YouTube [https://www.youtube.com/watch?v=yy9RdTo\\_KwI&amp;ab\\_channel=Repairs101](https://www.youtube.com/watch?v=yy9RdTo_KwI&amp;ab_channel=Repairs101) and was like, erm, I don't think I can do this. This guy is a pro and I'm a noob.\n\n# Air Filter\n\nAnyway, I proceeded to take a screwdriver and open the air filter. To my surprise, it was FULL of blueish oil. I then realised there was no way air was getting inside the engine with the air filter like that. Took it apart and removed the sponge and squeezed it. My hand was COVERED in thick oil, whoa. Took it inside and washed it under hot water for a few minutes with plenty of dishwashing liquid. It returned to its original clean yellow colour. Dried it with paper towels etc and put it back together. Screwed it on and fired it up. She started on the second rope pull!\n\n# Engine Oil\n\nWell, I thought now that I've watched the video and seen where the oil drain plug is (on the bottom), might as well open the plug and let it drain out and then fill her up again with some 2 stroke engine oil. So I did that, and got lots of nice (well not so nice really) dark oil. When the oil stopped coming out, I put the oil drain plug back on and filled her up, slowly, checking the dipstick each time. I didn't wanna fire her up immediately, so I first rotated the blade a bit slowly by hand, and then pulled the rope very very gently a few times. No idea if this helps at all, but my idea was to let the oil circulate a bit so the engine wasn't firing up without oil. I bet some of you can comment on this?\n\n# Dirty solid grass on bottom\n\nTook a vacuum (my DIY one) and put the nozzle bit on it and use the nozzle to scrape out all the old grass from the bottom. Well, first scraped off the big chunks without the vacuum on, and then vacuumed all the little bits. Also, I realised there was tonned of long dry grass thingies curled around the self-propelling shaft, so I decided to cut those all off and give it all a good clean.\n\n# The result\n\nShe starts first time, every time. Beautiful. Didn't bother with sharpening the blade as that looked a little labour intensive. She cuts fine how she is. What do you lot think?\n\nI think the extra oil in the air filter was because once upon a time the oil was a little low and she wasn't starting easily so I thought it was a good idea to just pour some more oil in, I didn't even check the dipstick. Could that have been what caused it?", "link": "https://www.reddit.com/r/gardening/comments/iq38n2/serviced_my_petrol_lawnmower_that_wasnt_starting/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "serviced my petrol lawnmower that wasn't starting /!/ # how it started\n\nso i have a lawnmower which wasn't starting at all, no matter how many times i pulled the starter rope thing. owned for like 15 years and it hasn't been serviced once. decided it was time to service it. it was getting progressively harder to start it (with lots of black smoke when first started), until the point where it would no longer start at all.\n\nwatched this video on youtube [https://www.youtube.com/watch?v=yy9rdto\\_kwi&amp;ab\\_channel=repairs101](https://www.youtube.com/watch?v=yy9rdto_kwi&amp;ab_channel=repairs101) and was like, erm, i don't think i can do this. this guy is a pro and i'm a noob.\n\n# air filter\n\nanyway, i proceeded to take a screwdriver and open the air filter. to my surprise, it was full of blueish oil. i then realised there was no way air was getting inside the engine with the air filter like that. took it apart and removed the sponge and squeezed it. my hand was covered in thick oil, whoa. took it inside and washed it under hot water for a few minutes with plenty of dishwashing liquid. it returned to its original clean yellow colour. dried it with paper towels etc and put it back together. screwed it on and fired it up. she started on the second rope pull!\n\n# engine oil\n\nwell, i thought now that i've watched the video and seen where the oil drain plug is (on the bottom), might as well open the plug and let it drain out and then fill her up again with some 2 stroke engine oil. so i did that, and got lots of nice (well not so nice really) dark oil. when the oil stopped coming out, i put the oil drain plug back on and filled her up, slowly, checking the dipstick each time. i didn't wanna fire her up immediately, so i first rotated the blade a bit slowly by hand, and then pulled the rope very very gently a few times. no idea if this helps at all, but my idea was to let the oil circulate a bit so the engine wasn't firing up without oil. i bet some of you can comment on this?\n\n# dirty solid grass on bottom\n\ntook a vacuum (my -----> diy !!!  one) and put the nozzle bit on it and use the nozzle to scrape out all the old grass from the bottom. well, first scraped off the big chunks without the vacuum on, and then vacuumed all the little bits. also, i realised there was tonned of long dry grass thingies curled around the self-propelling shaft, so i decided to cut those all off and give it all a good clean.\n\n# the result\n\nshe starts first time, every time. beautiful. didn't bother with sharpening the blade as that looked a little labour intensive. she cuts fine how she is. what do you lot think?\n\ni think the extra oil in the air filter was because once upon a time the oil was a little low and she wasn't starting easily so i thought it was a good idea to just pour some more oil in, i didn't even check the dipstick. could that have been what caused it?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/gardening/comments/iq38n2/serviced_my_petrol_lawnmower_that_wasnt_starting/", "identifyer": 402889, "year": "2020"}, {"Unnamed: 0": 406014, "autor": "Expensive_Corgi", "date": 1582071669000, "content": "PLEASE take this survey. Researching power tool brand preferences and product innovation. Do you work with power tools? Enjoy DIY &amp; home renos? Hobbies of gardening, woodworking, outdoor activities? Ever heard of Milwaukee tools? Not a fan? Let us know. Ever heard of heated jackets!?! Now you have.", "link": "https://www.reddit.com/r/gardening/comments/f61tqp/please_take_this_survey_researching_power_tool/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "please take this survey. researching power tool brand preferences and product innovation. do you work with power tools? enjoy -----> diy !!!  &amp; home renos? hobbies of gardening, woodworking, outdoor activities? ever heard of milwaukee tools? not a fan? let us know. ever heard of heated jackets!?! now you have.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 0, "media": null, "medialink": "https://osu.az1.qualtrics.com/jfe/form/SV_e3RFx9uS6E9yTgF", "identifyer": 406014, "year": "2020"}, {"Unnamed: 0": 417660, "autor": "MadOldLogan", "date": 1579465168000, "content": "DIY raised bed ideas for not-so-handy person /!/ I live in the PNW. I'm not very handy but want to give a shot at making a raised bed, also planning to involve/keep my toddler busy. \n\nLooking for simple ideas. There's a ton on the internet, it's just overwhelming. I can rent gear like electric saw from home Depot. I got \"basic\" tools. If it doesn't work out, I'll end up buying something. I want to get on the game soon so I can plant onions on day 1 of spring. I can't wait 😀", "link": "https://www.reddit.com/r/gardening/comments/er1mi8/diy_raised_bed_ideas_for_notsohandy_person/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  raised bed ideas for not-so-handy person /!/ i live in the pnw. i'm not very handy but want to give a shot at making a raised bed, also planning to involve/keep my toddler busy. \n\nlooking for simple ideas. there's a ton on the internet, it's just overwhelming. i can rent gear like electric saw from home depot. i got \"basic\" tools. if it doesn't work out, i'll end up buying something. i want to get on the game soon so i can plant onions on day 1 of spring. i can't wait 😀", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/er1mi8/diy_raised_bed_ideas_for_notsohandy_person/", "identifyer": 417660, "year": "2020"}, {"Unnamed: 0": 420716, "autor": "eschizzle", "date": 1599530811000, "content": "Advice for a newbie putting a raised garden bed on concrete driveway? /!/ Just moved from apartment living to a house and one of the things I was most excited about was upgrading my garden. But I'm quickly realizing that the backyard isn't ideal for an extensive vegetable garden and that the sunniest, best spot is probably the back of my driveway. I've been doing container planting on balconies for the last few years, but never anything more extensive than that.\n\nAny advice on how to approach it as a newbie? Best height/materials to use? I've seen mixed feelings on whether to line the bottom and/or use gravel and the ideal height. Also debating the DIY vs kit approach as I don't have a lot of tools or experience, but seems like a good DIY project to get started on.", "link": "https://www.reddit.com/r/gardening/comments/iol2oe/advice_for_a_newbie_putting_a_raised_garden_bed/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "advice for a newbie putting a raised garden bed on concrete driveway? /!/ just moved from apartment living to a house and one of the things i was most excited about was upgrading my garden. but i'm quickly realizing that the backyard isn't ideal for an extensive vegetable garden and that the sunniest, best spot is probably the back of my driveway. i've been doing container planting on balconies for the last few years, but never anything more extensive than that.\n\nany advice on how to approach it as a newbie? best height/materials to use? i've seen mixed feelings on whether to line the bottom and/or use gravel and the ideal height. also debating the -----> diy !!!  vs kit approach as i don't have a lot of tools or experience, but seems like a good -----> diy !!!  project to get started on.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/iol2oe/advice_for_a_newbie_putting_a_raised_garden_bed/", "identifyer": 420716, "year": "2020"}, {"Unnamed: 0": 441870, "autor": "DarlaLunaWinter", "date": 1594776155000, "content": "Help! Our Better Boy tomato is thriving but falling over /!/ We rather ignorantly bought a better boy tomato which we planted in our nifty little irrigation container above some herbs. Its gotten about four feet tall and we realized today the roots and stem are so heavy the bamboo and two foot rods we got aren't strong enough. We're just getting the first baby tomatos and we'd like to get, at least, one harvest. However we don't really know what we're doing at this point and neither of us have grown indeterminate tomatoes before. So we're thinking of buying a much deeper container (ground gardening is not possible) of about 14 inches in depth if not deeper. We also are going to plant some of our mint with it (because they seem to LOVE each other an its been helping with pests).  But we have no clue what to do about staking or caging. Due to everyone covid gardening we can't find many stakes and local stores are sold out of cages every time we've looked. We have 5 thin bamboo stakes that are thinner than the tomato stems which we tried to teepee and out two short metal stakes.   \n\n\nDoes anyone have any suggestions of how to help the tomato not drag on the ground and support it? We don't have many tools and are not really DIY people. I heard about using a wooden short ladder to help support it, and using the teepee method (the sticks tied together vertically) hasn't been working. Any suggestions or tips to keep Better Boy tomatoes managed and healthy would be appreciated", "link": "https://www.reddit.com/r/gardening/comments/hrebjp/help_our_better_boy_tomato_is_thriving_but/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help! our better boy tomato is thriving but falling over /!/ we rather ignorantly bought a better boy tomato which we planted in our nifty little irrigation container above some herbs. its gotten about four feet tall and we realized today the roots and stem are so heavy the bamboo and two foot rods we got aren't strong enough. we're just getting the first baby tomatos and we'd like to get, at least, one harvest. however we don't really know what we're doing at this point and neither of us have grown indeterminate tomatoes before. so we're thinking of buying a much deeper container (ground gardening is not possible) of about 14 inches in depth if not deeper. we also are going to plant some of our mint with it (because they seem to love each other an its been helping with pests).  but we have no clue what to do about staking or caging. due to everyone covid gardening we can't find many stakes and local stores are sold out of cages every time we've looked. we have 5 thin bamboo stakes that are thinner than the tomato stems which we tried to teepee and out two short metal stakes.   \n\n\ndoes anyone have any suggestions of how to help the tomato not drag on the ground and support it? we don't have many tools and are not really -----> diy !!!  people. i heard about using a wooden short ladder to help support it, and using the teepee method (the sticks tied together vertically) hasn't been working. any suggestions or tips to keep better boy tomatoes managed and healthy would be appreciated", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/hrebjp/help_our_better_boy_tomato_is_thriving_but/", "identifyer": 441870, "year": "2020"}, {"Unnamed: 0": 458567, "autor": "rskk0702", "date": 1590517346000, "content": "DIY reel mower grass catcher? /!/ Guys,\n\nI recently bought a 14” Great States reel mower. It doesn’t have a grass catcher. I was wondering if anyone made their own grass catcher or suggest some ways to make a grass catcher.", "link": "https://www.reddit.com/r/gardening/comments/gr2hee/diy_reel_mower_grass_catcher/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  reel mower grass catcher? /!/ guys,\n\ni recently bought a 14” great states reel mower. it doesn’t have a grass catcher. i was wondering if anyone made their own grass catcher or suggest some ways to make a grass catcher.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/gr2hee/diy_reel_mower_grass_catcher/", "identifyer": 458567, "year": "2020"}, {"Unnamed: 0": 494549, "autor": "beeskers", "date": 1586501400000, "content": "DIY support for gourds - no access to woodshop or tools. /!/ I'm going to try growing loofa and birdhouse gourds this summer. I need to create support for them, but I can't make a wooden structure owing to lack of tools and truck to move wood and well everything you'd need to do that.\n\nI've seen some trellis and arbor ideas with chicken wire, twine, etc being used with support stakes (I can find stakes I think) would those be strong enough to support gourds?", "link": "https://www.reddit.com/r/gardening/comments/fyadzj/diy_support_for_gourds_no_access_to_woodshop_or/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  support for gourds - no access to woodshop or tools. /!/ i'm going to try growing loofa and birdhouse gourds this summer. i need to create support for them, but i can't make a wooden structure owing to lack of tools and truck to move wood and well everything you'd need to do that.\n\ni've seen some trellis and arbor ideas with chicken wire, twine, etc being used with support stakes (i can find stakes i think) would those be strong enough to support gourds?", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/fyadzj/diy_support_for_gourds_no_access_to_woodshop_or/", "identifyer": 494549, "year": "2020"}, {"Unnamed: 0": 494782, "autor": "tartymae", "date": 1586886259000, "content": "Can't compost but want to do something with your scraps? Try a worm bin! /!/ I tried composting in my back yard, but as I didn't want to spend $$$ for a bin on a stand and I don't have the tools (or know how) needed to build one, every time I tried to compost, I just ended up with a giant exceedingly smelly cockroach farm.  BLECCH!\n\nThen I heard about earthworm bins (AKA Vermiculture).  [This website is a good place to get started.](http://working-worms.com/)\n\nI've been doing it about 2 years now, and the worm castings have been a huge boon to my garden.\n\nBecause I lacked some of the tools needed to DIY,  I opted to buy a pre-made \"worm hut\" online for about $100, bought a pound of worms, and gave it ago.  I love it.  There is no stink and it attracts no bugs.  The only odor comes when you open it to add in more food, and it is that wonderful smell that comes from good, rich soil.\n\nI use coconut coir as a base, and add a little fine beach sand or ground oyster shell for grit.  Keep the worms moist, but not wet.  Any lid should be snug, but the system should not be airtight -- they need to breathe.  The worm bin should be in a quiet corner of your house that gets no direct sun.  Mine is in a corner of the kitchen by the pantry.\n\nI leave the top tray empty except for a thick layer of dry straw or shredded paper -- this prevents gnats from setting up shop.\n\nEach tray has a 3-4 month life cycle.  When you are starting, you're going to have to wait 3 months+ for your first crop of \"black gold\", but that's okay. (Also, the black gold does not go bad -- for those of you who live in places with long winters -- it stores in the tray just fine and you can deploy it right away come Spring.)  You prep the new \"active\" tray with your base, set it atop the current \"active tray\", start adding food to it, and stop feeding the other trays.  Give the worms about 2-3 weeks to migrate up.  (I'm now at the point when I give it a month.) The goal is to get a multi tray system going.  I currently have 4 trays in various states (just started a new active tray this morning), plus the 5th one with straw in it.\n\nDo not add meat, dairy, citrus, hot peppers, onion/garlic, or bread (it gets moldy!).  Eggplant, bell pepper, potato peel and tomatoes only occasionally. Other than that, I use my green leafy scraps, banana peels, apple cores, squash and melon rinds, and carrot peels. Worms LOVE coffee grounds and tea leaves (not herbal tea).  I keep a small plastic bin in my fridge (6 inches across, 2.5 inches deep) and every two weeks I add its contents plus my coffee/tea grounds (I keep a bin with a lid just or this) to the active bin.  \n\nGood luck, and your garden (even if it's just a few pots on your balcony or porch) will thank you.", "link": "https://www.reddit.com/r/gardening/comments/g1a57m/cant_compost_but_want_to_do_something_with_your/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "can't compost but want to do something with your scraps? try a worm bin! /!/ i tried composting in my back yard, but as i didn't want to spend $$$ for a bin on a stand and i don't have the tools (or know how) needed to build one, every time i tried to compost, i just ended up with a giant exceedingly smelly cockroach farm.  blecch!\n\nthen i heard about earthworm bins (aka vermiculture).  [this website is a good place to get started.](http://working-worms.com/)\n\ni've been doing it about 2 years now, and the worm castings have been a huge boon to my garden.\n\nbecause i lacked some of the tools needed to -----> diy !!! ,  i opted to buy a pre-made \"worm hut\" online for about $100, bought a pound of worms, and gave it ago.  i love it.  there is no stink and it attracts no bugs.  the only odor comes when you open it to add in more food, and it is that wonderful smell that comes from good, rich soil.\n\ni use coconut coir as a base, and add a little fine beach sand or ground oyster shell for grit.  keep the worms moist, but not wet.  any lid should be snug, but the system should not be airtight -- they need to breathe.  the worm bin should be in a quiet corner of your house that gets no direct sun.  mine is in a corner of the kitchen by the pantry.\n\ni leave the top tray empty except for a thick layer of dry straw or shredded paper -- this prevents gnats from setting up shop.\n\neach tray has a 3-4 month life cycle.  when you are starting, you're going to have to wait 3 months+ for your first crop of \"black gold\", but that's okay. (also, the black gold does not go bad -- for those of you who live in places with long winters -- it stores in the tray just fine and you can deploy it right away come spring.)  you prep the new \"active\" tray with your base, set it atop the current \"active tray\", start adding food to it, and stop feeding the other trays.  give the worms about 2-3 weeks to migrate up.  (i'm now at the point when i give it a month.) the goal is to get a multi tray system going.  i currently have 4 trays in various states (just started a new active tray this morning), plus the 5th one with straw in it.\n\ndo not add meat, dairy, citrus, hot peppers, onion/garlic, or bread (it gets moldy!).  eggplant, bell pepper, potato peel and tomatoes only occasionally. other than that, i use my green leafy scraps, banana peels, apple cores, squash and melon rinds, and carrot peels. worms love coffee grounds and tea leaves (not herbal tea).  i keep a small plastic bin in my fridge (6 inches across, 2.5 inches deep) and every two weeks i add its contents plus my coffee/tea grounds (i keep a bin with a lid just or this) to the active bin.  \n\ngood luck, and your garden (even if it's just a few pots on your balcony or porch) will thank you.", "sortedWord": "None", "removed": null, "score": 7, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/gardening/comments/g1a57m/cant_compost_but_want_to_do_something_with_your/", "identifyer": 494782, "year": "2020"}], "name": "diygardening2020"}