{"interestingcomments": [{"Unnamed: 0": 406100, "autor": "Roar_Im_A_Nice_Bear", "date": 1582051311000, "content": "What to do with cypress leaves waste? /!/ Hi! I'm looking for a bit of advice.\n\n\nMy parents have a pretty big garden with a cypress hedge. We blame the previous tenants... JK, I like it, except for the pollen and the waste.\n\nIt's time for the annual hedge trimming and my dad and I have started doing that. He uses an electric hedge trimmer which leaves a ton of small leaves. We used to burn them in the fire pit, but since last year, we don't have the right to make any fire anymore. Indeed, we live in Provence in France, and the area is pretty dry all year long. Fires in gardens have been prohibited and sanctioned.\n\nThat sucks for us, because we end up with a somewhat massive amount of cypress leaves. Last year, my dad put them on the ground, shredded them with the lawnmower, and yote it back under the hedge. But this is far from optimal (he hurt his back doing so, and one year later they're still there so it's not a sustainable solution). \n\nWe know that cypress leaves are acidic. In fact, we used to make a big pile out of them when we burned them, and the grass had trouble growing back afterwards. We also tried to let them dry, but we just end up with [this](https://i.imgur.com/p4Nbsyr.png) - a pile of dried leaves and sticks. \n\n\n\nWe should end up with 3 to 5 cubic meters of fresh leaves. My dad says that if we shred them, we can cut in half the volume. But it's still a massive pile of waste that we don't really know what to do with.\n\n\nWe were thinking about putting them on the driveway to prevent grass from growing, but I'm convinced that when they will dry out, it will be super ugly. (like a brown carpet with a lot of tiny sticks).\n\n\nAnyway, advice is welcome. Do you have any advice? \n\n\nThanks a lot.", "link": "https://www.reddit.com/r/gardening/comments/f5wh4y/what_to_do_with_cypress_leaves_waste/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "we used to make", "selectorShort": "make", "MarkedSent": "what to do with cypress leaves waste? /!/ hi! i'm looking for a bit of advice.\n\n\nmy parents have a pretty big garden with a cypress hedge. we blame the previous tenants... jk, i like it, except for the pollen and the waste.\n\nit's time for the annual hedge trimming and my dad and i have started doing that. he uses an electric hedge trimmer which leaves a ton of small leaves. we used to burn them in the fire pit, but since last year, we don't have the right to make any fire anymore. indeed, we live in provence in france, and the area is pretty dry all year long. fires in gardens have been prohibited and sanctioned.\n\nthat sucks for us, because we end up with a somewhat massive amount of cypress leaves. last year, my dad put them on the ground, shredded them with the lawnmower, and yote it back under the hedge. but this is far from optimal (he hurt his back doing so, and one year later they're still there so it's not a sustainable solution). \n\nwe know that cypress leaves are acidic. in fact, -----> we !!!  -----> used !!!  -----> to !!!  -----> make !!!  a big pile out of them when -----> we !!!  burned them, and the grass had trouble growing back afterwards. we also tried to let them dry, but we just end up with [this](https://i.imgur.com/p4nbsyr.png) - a pile of dried leaves and sticks. \n\n\n\nwe should end up with 3 to 5 cubic meters of fresh leaves. my dad says that if we shred them, we can cut in half the volume. but it's still a massive pile of waste that we don't really know what to do with.\n\n\nwe were thinking about putting them on the driveway to prevent grass from growing, but i'm convinced that when they will dry out, it will be super ugly. (like a brown carpet with a lot of tiny sticks).\n\n\nanyway, advice is welcome. do you have any advice? \n\n\nthanks a lot.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/gardening/comments/f5wh4y/what_to_do_with_cypress_leaves_waste/", "identifyer": 406100, "year": "2020"}, {"Unnamed: 0": 457494, "autor": "FroztyJack", "date": 1588068583000, "content": "Complete and utter beginner looking for basic advice. /!/        Ill keep it short. I live in the UK and I've never gardened  (probably not even a word) a day in my life. I have a completely flagged back garden and a small triangle of grass in the front. \n       During all this free me and my wife decided we wanted to make the front garden a little more presentable just by popping some pre grown potted plants in the weed ridden little border under the window. I however haven't got a single clue what I am doing and just wanted some general guidance if possible. I can provide more detail and/or pictures if need be. \n       As for tools i ordered a basic kit off amazon with a hand trowel, bulb trowel, weed popper, 3 pronged cultivator and hand fork. I've got 2 bags of all purpose compost from aldi and that's it. Oh and a watering can! \n       Any and all advice is welcomed. Thank you gardeners of reddit.", "link": "https://www.reddit.com/r/gardening/comments/g9kltj/complete_and_utter_beginner_looking_for_basic/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "we wanted to make", "selectorShort": "make", "MarkedSent": "complete and utter beginner looking for basic advice. /!/        ill keep it short. i live in the uk and i've never gardened  (probably not even a word) a day in my life. i have a completely flagged back garden and a small triangle of grass in the front. \n       during all this free me and my wife decided -----> we !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  the front garden a little more presentable just by popping some pre grown potted plants in the weed ridden little border under the window. i however haven't got a single clue what i am doing and just wanted some general guidance if possible. i can provide more detail and/or pictures if need be. \n       as for tools i ordered a basic kit off amazon with a hand trowel, bulb trowel, weed popper, 3 pronged cultivator and hand fork. i've got 2 bags of all purpose compost from aldi and that's it. oh and a watering can! \n       any and all advice is welcomed. thank you gardeners of reddit.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/g9kltj/complete_and_utter_beginner_looking_for_basic/", "identifyer": 457494, "year": "2020"}, {"Unnamed: 0": 506089, "autor": "Backyardprime_com", "date": 1592400361000, "content": "How gardening turned my existence around /!/ Walking home beyond London’s dreary Southbank on a winter’s day it wasn’t hard to look why we were invited to construct a roof garden there with the Eden Project one year before launching my [Backyard Prime ](https://backyardprime.com/) site. It turned into a miserable scene; the best coloration became a shiny yellow staircase, that you couldn’t cross up, and there were some concrete planters with a few useless looking vegetation in.\n\nIn London’s concrete jungle I war to discover inexperienced areas and, having suffered from melancholy, I instinctively am looking for out parks and other inexperienced spaces to stroll in once I am low and need to clean my head. Not lengthy before, I was just getting myself again on my toes after struggling a severe depressive episode and turned into looking for voluntary gardening work, when I met a set of individuals who thought just the same manner. Today I’m part of this superb force this is Grounded Ecotherapy.\n\nTurning a bleak situation into a stunning lawn is a project that we relish. So whilst the Southbank roof lawn build began on a definitely gray day in March and the site turned into only a concrete expanse with the baggage of compost, aggregate, palettes of turf and six large trees, we clearly discovered a manner to do it.\n\nWe are used to operating with little, under circumstances in which others might refuse to work, and collectively we constantly discover away. In the beginning, we had no tea or espresso and few tools but we got caught in building the lawn, moving all the soil and stones around with the handiest one wheelbarrow. When the only manner to get the plant life, wood, vegetable boxes, logs and every different piece of the garden into space became up seven flights of stairs we simply did it. It might sound daunting, however, this is the sort of venture that attracts us collectively and makes our group so strong.\n\nI should admit that the day I got domestic to find my lift damaged after I’d been carrying the baggage of compost up the steps all, I nearly cried — nearly! Instead, I got up the following day and carried on. The remarkable factor is that the laughs far outweigh the tears and no one takes themselves too seriously — we make sure of that.\n\nI can see clean parallels among the transformation of the garden and my personal story: having faced melancholy so extreme that I could find no hope — or maybe the motivation to go away my flat — I had despite the fact that still got myself again on my ft, and all and sundry in the organization has been there too.\n\nBy the time the garden opened to the public, we have been hardly able to stand and each muscle ached, but the end result becomes a spectacular garden. It’s a piece in development and there will constantly be more to do, however, there may be also something new for the general public to look each day, either springing up at the wildflower meadows or in the vegetable plot. The public reaction has been tremendous and all and sundry we’ve got spoken to has been impressed.\n\nNow, I work on my site [Backyard Prime ](https://backyardprime.com/) dedicated to gardening beginners who want to build their gardens from scratch, at Backyardprime we take great pride in the quality of our content, We create original engaging gardening content to help our reader to improve their gardening skills.", "link": "https://www.reddit.com/r/gardening/comments/har2vh/how_gardening_turned_my_existence_around/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "how gardening turned my existence around /!/ walking home beyond london’s dreary southbank on a winter’s day it wasn’t hard to look why we were invited to construct a roof garden there with the eden project one year before launching my [backyard prime ](https://backyardprime.com/) site. it turned into a miserable scene; the best coloration became a shiny yellow staircase, that you couldn’t cross up, and there were some concrete planters with a few useless looking vegetation in.\n\nin london’s concrete jungle i war to discover inexperienced areas and, having suffered from melancholy, i instinctively am looking for out parks and other inexperienced spaces to stroll in once i am low and need to clean my head. not lengthy before, i was just getting myself again on my toes after struggling a severe depressive episode and turned into looking for voluntary gardening work, when i met a set of individuals who thought just the same manner. today i’m part of this superb force this is grounded ecotherapy.\n\nturning a bleak situation into a stunning lawn is a project that we relish. so whilst the southbank roof lawn build began on a definitely gray day in march and the site turned into only a concrete expanse with the baggage of compost, aggregate, palettes of turf and six large trees, we clearly discovered a manner to do it.\n\nwe are used to operating with little, under circumstances in which others might refuse to work, and collectively we constantly discover away. in the beginning, we had no tea or espresso and few tools but we got caught in building the lawn, moving all the soil and stones around with the handiest one wheelbarrow. when the only manner to get the plant life, wood, vegetable boxes, logs and every different piece of the garden into space became up seven flights of stairs we simply did it. it might sound daunting, however, this is the sort of venture that attracts us collectively and makes our group so strong.\n\ni should admit that the day i got domestic to find my lift damaged after i’d been carrying the baggage of compost up the steps all, i nearly cried — nearly! instead, i got up the following day and carried on. the remarkable factor is that the laughs far outweigh the tears and no one takes themselves too seriously — -----> we !!!  -----> make !!!  sure of that.\n\ni can see clean parallels among the transformation of the garden and my personal story: having faced melancholy so extreme that i could find no hope — or maybe the motivation to go away my flat — i had despite the fact that still got myself again on my ft, and all and sundry in the organization has been there too.\n\nby the time the garden opened to the public, we have been hardly able to stand and each muscle ached, but the end result becomes a spectacular garden. it’s a piece in development and there will constantly be more to do, however, there may be also something new for the general public to look each day, either springing up at the wildflower meadows or in the vegetable plot. the public reaction has been tremendous and all and sundry we’ve got spoken to has been impressed.\n\nnow, i work on my site [backyard prime ](https://backyardprime.com/) dedicated to gardening beginners who want to build their gardens from scratch, at backyardprime we take great pride in the quality of our content, we create original engaging gardening content to help our reader to improve their gardening skills.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/gardening/comments/har2vh/how_gardening_turned_my_existence_around/", "identifyer": 506089, "year": "2020"}], "name": "makegardening2020"}