{"interestingcomments": [{"Unnamed: 0": 86311, "autor": "weetabixbandit", "date": 1600450390000, "content": "[RESEARCH] Would you use this item? /!/ Hello everyone! Hope this post is allowed here! I'm part of a Young Enterprise team from the UK. Firstly, this isn't a sales pitch, just market research. We have been challenged to come up with a product or service and then manufacture, market and sell it. Currently, we are only at the beginning of the process and are still thinking of ideas.\n\nOur current strongest idea is a tool/device that measures the water level in the soil of plants. We are aware of similar items available but we would be focusing on sustainability with regards to production and packaging as well as a focus on aesthetics. Plants are quite commonly used for decoration and we don't want to make something that sticks out like a sore thumb. We would be aiming to sell the product somewhere in the region of £5-10 but this would be decided once all costs are calculated. \n\nTheoretically, would this be something you might consider purchasing? If so, would you be happy with the price and features?\n\nIf not, what could we change to make it appeal to you? What elements could we add or remove?\n\nThank you all very much and have a lovely day!", "link": "https://www.reddit.com/r/gardening/comments/ivalld/research_would_you_use_this_item/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "[research] would you use this item? /!/ hello everyone! hope this post is allowed here! i'm part of a young enterprise team from the uk. firstly, this isn't a sales pitch, just market research. we have been challenged to -----> come !!!  -----> up !!!  -----> with !!!  a product or service and then manufacture, market and sell it. currently, we are only at the beginning of the process and are still thinking of ideas.\n\nour current strongest idea is a tool/device that measures the water level in the soil of plants. we are aware of similar items available but we would be focusing on sustainability with regards to production and packaging as well as a focus on aesthetics. plants are quite commonly used for decoration and we don't want to make something that sticks out like a sore thumb. we would be aiming to sell the product somewhere in the region of £5-10 but this would be decided once all costs are calculated. \n\ntheoretically, would this be something you might consider purchasing? if so, would you be happy with the price and features?\n\nif not, what could we change to make it appeal to you? what elements could we add or remove?\n\nthank you all very much and have a lovely day!", "sortedWord": "None", "removed": null, "score": 0, "comments": 9, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/ivalld/research_would_you_use_this_item/", "identifyer": 86311, "year": "2020"}, {"Unnamed: 0": 90063, "autor": "Cupro-Pringle", "date": 1587378510000, "content": "Gravel compaction on a shoestring. /!/ So I need a solution here and I need it fast, because my family isn't going to stop bullying me about this until I come up with something (I'm \"the smart one\", you see) - how do you compact a large area of gravel without using an expensive tool like a plate compactor?", "link": "https://www.reddit.com/r/gardening/comments/g4qdk0/gravel_compaction_on_a_shoestring/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "gravel compaction on a shoestring. /!/ so i need a solution here and i need it fast, because my family isn't going to stop bullying me about this until i -----> come !!!  -----> up !!!  -----> with !!!  something (i'm \"the smart one\", you see) - how do you compact a large area of gravel without using an expensive tool like a plate compactor?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/g4qdk0/gravel_compaction_on_a_shoestring/", "identifyer": 90063, "year": "2020"}, {"Unnamed: 0": 105089, "autor": "GrandmaGos", "date": 1589297432000, "content": "K, so, I'm writing a FAQ. Am I leaving out anything obvious? /!/ I am approaching this from the standpoint of strictly interpreting the phrase \"Frequently Asked Questions\". This is not a \"how to garden\" FAQ. The reason we haven't been able to collectively come up with a FAQ in all this time is because the prospect of writing a \"how to garden\" FAQ covering the entire planet and all its climates and different ways to garden makes our collective heads explode. \n\nBut if it's just a list of the most frequently asked questions, then that's do-able. And thanks to Covid-19, I've had literally nothing else to do , for weeks now, and with more to come, especially if Pritzker gets a bug up his butt in a couple weeks about \"moar testing!\" \n\n\n\nPls note that his is not intended to be a compendium of gardening how-tos, tips, tricks, guidelines, debunkings, and helpful links. It's not rules for posting in the subreddit.   Is there a question that gets asked a lot? Then it should go in. I'm not looking for \"Put in something about gardening in [location]!\" Or, \"Put in something about [gardening method]!\"  If you think that gardening at McMurdo Station or placing magic spells around the yard as a pest deterrent should be included, I would have to differ ,as my experience has not been that we get a lot of questions, \"I'm about to spend a year in Antarctica, what are some plants I can grow there?\" or, \"Can I use an anti-groundhog spell for rabbits?\"\n\n\n\n\n\nI can't post the entire document here, because so far it's already a 12,000 word MS Word document, which far exceeds the reddit post character limit. Once it goes up, I will be happy to edit and correct anything that is demonstrably factually incorrect, but simple differences of opinion should be incorporated into your own FAQ which you can write.  We can have dueling FAQs.  How fun.\n\n\n\n\nSo here are my topic headings so far.  Am I leaving out anything obvious?\n\n\n\nA word about cannabis.\n\nI don’t know anything about plants, but I want to grow a plant.\n\nI don’t know anything about gardening, but I want to start a garden.\n\nI just want to grow a plant in my apartment/dorm room/office cubicle.\n\nWhat can I grow in my apartment/dorm room/office cubicle without any light?\n\nI want to grow fresh fruits and vegetables,  indoors, year-round.\n\nDo I need a UV light to grow plants?\n\nWhat kind of lights do I need to start seeds indoors?\n\nWhat books should I read to get started with plants?\n\nI need to feed my family.\n\nI want to make some money with my garden.\n\nI don’t need to feed my family, but I’d like to help out with the grocery bills.\n\nI just want to get involved in gardening.  I have food already, and I don’t care if I make my expenses back.  \n\nA note about the word “organic”.\n\nWhere do I buy seeds?\n\nWhat are some good seed vendors?\n\nWhere can I buy non-GMO seeds?\n\nWhat about growing things from grocery store produce? Can I plant the seeds from a pepper?\n\nWhat about growing an apple tree from a seed?\n\nCan I plant this sprouted potato?\n\nWhat is this plant?\nWhat is this bug?\n\n[basically, just a headsup to the other subreddits]\n\nHow often should I water?\n\n\nHow do I grow this?\nHow do I prune this?\nHow do I propagate this?\nHow do I fertilize this?\nHow do I plant this?\nHow do I transplant this?\n\n[note: the above will be bundled together under a hopefully more tactfully phrased way of saying \"you can google that\"]\n\nHow do I fix my clay soil? \n\nCan I just dig a hole in the clay and replace it with nice garden soil?\n\nWhat do I use to fill my raised beds?\n\nWhat do I line my raised beds with?\n\nWhat kind of sealer should I use on my raised bed?\n\nThere’s grass where I want to put a garden. Can I just till it all up?\n\nWhat tools do I need?\n\nWhat  is my USDA zone for? \n\nHere’s my proposed vegetable garden plan. How did I do?\n\nWhat is a good garden planning app?\n\nAre my seedlings leggy?\n\nMy seedlings keep dying.\n\nThere are mushrooms in my soil! What do I do?\n\nIs my plant dead?\n\nWhat is the best fertilizer?\n\nCan I make my own fertilizer at home?\n\nHow do I fix my lawn?\n\nI need a ground cover that can stand up to dogs. My yard is a mud pit. \n\nI need a plant to soak up the extra water from a flooded yard.\n\nI want to change my lawn into a wildflower meadow.\n\nWhat are some things I can plant to repel mosquitoes from my yard?\n\nCats keep pooping in my beds.\n\nI just bought a house with a landscaped yard.  Where do I even begin?\nI just bought a house with no landscaping. Where do I even begin?\n\nWhat can I grow on my patio/balcony?\n\nAm I too late to start gardening?", "link": "https://www.reddit.com/r/gardening/comments/gide7z/k_so_im_writing_a_faq_am_i_leaving_out_anything/", "origin": "Reddit", "suborigin": "gardening", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "k, so, i'm writing a faq. am i leaving out anything obvious? /!/ i am approaching this from the standpoint of strictly interpreting the phrase \"frequently asked questions\". this is not a \"how to garden\" faq. the reason we haven't been able to collectively -----> come !!!  -----> up !!!  -----> with !!!  a faq in all this time is because the prospect of writing a \"how to garden\" faq covering the entire planet and all its climates and different ways to garden makes our collective heads explode. \n\nbut if it's just a list of the most frequently asked questions, then that's do-able. and thanks to covid-19, i've had literally nothing else to do , for weeks now, and with more to come, especially if pritzker gets a bug up his butt in a couple weeks about \"moar testing!\" \n\n\n\npls note that his is not intended to be a compendium of gardening how-tos, tips, tricks, guidelines, debunkings, and helpful links. it's not rules for posting in the subreddit.   is there a question that gets asked a lot? then it should go in. i'm not looking for \"put in something about gardening in [location]!\" or, \"put in something about [gardening method]!\"  if you think that gardening at mcmurdo station or placing magic spells around the yard as a pest deterrent should be included, i would have to differ ,as my experience has not been that we get a lot of questions, \"i'm about to spend a year in antarctica, what are some plants i can grow there?\" or, \"can i use an anti-groundhog spell for rabbits?\"\n\n\n\n\n\ni can't post the entire document here, because so far it's already a 12,000 word ms word document, which far exceeds the reddit post character limit. once it goes up, i will be happy to edit and correct anything that is demonstrably factually incorrect, but simple differences of opinion should be incorporated into your own faq which you can write.  we can have dueling faqs.  how fun.\n\n\n\n\nso here are my topic headings so far.  am i leaving out anything obvious?\n\n\n\na word about cannabis.\n\ni don’t know anything about plants, but i want to grow a plant.\n\ni don’t know anything about gardening, but i want to start a garden.\n\ni just want to grow a plant in my apartment/dorm room/office cubicle.\n\nwhat can i grow in my apartment/dorm room/office cubicle without any light?\n\ni want to grow fresh fruits and vegetables,  indoors, year-round.\n\ndo i need a uv light to grow plants?\n\nwhat kind of lights do i need to start seeds indoors?\n\nwhat books should i read to get started with plants?\n\ni need to feed my family.\n\ni want to make some money with my garden.\n\ni don’t need to feed my family, but i’d like to help out with the grocery bills.\n\ni just want to get involved in gardening.  i have food already, and i don’t care if i make my expenses back.  \n\na note about the word “organic”.\n\nwhere do i buy seeds?\n\nwhat are some good seed vendors?\n\nwhere can i buy non-gmo seeds?\n\nwhat about growing things from grocery store produce? can i plant the seeds from a pepper?\n\nwhat about growing an apple tree from a seed?\n\ncan i plant this sprouted potato?\n\nwhat is this plant?\nwhat is this bug?\n\n[basically, just a headsup to the other subreddits]\n\nhow often should i water?\n\n\nhow do i grow this?\nhow do i prune this?\nhow do i propagate this?\nhow do i fertilize this?\nhow do i plant this?\nhow do i transplant this?\n\n[note: the above will be bundled together under a hopefully more tactfully phrased way of saying \"you can google that\"]\n\nhow do i fix my clay soil? \n\ncan i just dig a hole in the clay and replace it with nice garden soil?\n\nwhat do i use to fill my raised beds?\n\nwhat do i line my raised beds with?\n\nwhat kind of sealer should i use on my raised bed?\n\nthere’s grass where i want to put a garden. can i just till it all up?\n\nwhat tools do i need?\n\nwhat  is my usda zone for? \n\nhere’s my proposed vegetable garden plan. how did i do?\n\nwhat is a good garden planning app?\n\nare my seedlings leggy?\n\nmy seedlings keep dying.\n\nthere are mushrooms in my soil! what do i do?\n\nis my plant dead?\n\nwhat is the best fertilizer?\n\ncan i make my own fertilizer at home?\n\nhow do i fix my lawn?\n\ni need a ground cover that can stand up to dogs. my yard is a mud pit. \n\ni need a plant to soak up the extra water from a flooded yard.\n\ni want to change my lawn into a wildflower meadow.\n\nwhat are some things i can plant to repel mosquitoes from my yard?\n\ncats keep pooping in my beds.\n\ni just bought a house with a landscaped yard.  where do i even begin?\ni just bought a house with no landscaping. where do i even begin?\n\nwhat can i grow on my patio/balcony?\n\nam i too late to start gardening?", "sortedWord": "None", "removed": null, "score": 1, "comments": 54, "media": null, "medialink": "https://www.reddit.com/r/gardening/comments/gide7z/k_so_im_writing_a_faq_am_i_leaving_out_anything/", "identifyer": 105089, "year": "2020"}], "name": "withgardening2020"}