{"interestingcomments": [{"Unnamed: 0": 7714, "autor": "fedwester", "date": 1582037838000, "content": "We automated our plant feeder and reservoir for indoor/outdoor cultivation setup - Water Plants Automatically with Remote Monitoring", "link": "https://www.reddit.com/r/Automate/comments/f5szfj/we_automated_our_plant_feeder_and_reservoir_for/", "origin": "Reddit", "suborigin": "Automate", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "we automated our plant feeder and reservoir for indoor/-----> outdoor !!!  cultivation setup - water plants automatically with remote monitoring", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://imgur.com/gallery/0VmqnvH", "identifyer": 3513094, "year": "2020"}, {"Unnamed: 0": 8053, "autor": "Progressive_Auto", "date": 1594820039000, "content": "PA-10 Actuator Overview /!/ INTRODUCING THE PA-10\n\nAn actuator may sometimes be used in applications that experience harsh environments such as saltwater, heavy rain, underwater submissions, or acidic/ corrosive substances. Due to these demanding requirements, the right actuator with proper ratings would be recommended to handle these applications. In this product overview, we will be taking a look at the [PA-10 actuator](https://www.progressiveautomations.com/products/waterproof-linear-actuator-ip68m-for-outdoor-use?_pos=1&amp;_sid=a1867c906&amp;_ss=r) which has the highest Ingress Protection and salt spray rating options offered to make it the ideal outdoor linear actuator.\n\nhttps://preview.redd.it/f35l3ahuw0b51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=1c4200574235fbf7de0d95777f4b80f9d58d8313\n\n \n\n## OVERVIEW OF THE PA-10\n\n### Water Resistance\n\nThe PA-10 is currently the most waterproof linear actuator we offer with an IP rating of IP68M (in motion) and IP69K (when static). With these types of IP ratings, we finally have an actuator with the ability to be fully submerged while in motion and can withstand high-powered water jets while not in motion. For more information on how the IP rating system works, [click here](https://www.progressiveautomations.com/blogs/how-to/complete-guide-to-ip-rating) to understand the true impressiveness of PA-10’s IP capabilities.\n\n### Physical Appearance and Capabilities\n\nOur PA-10 and PA-09 actuators have a similar shape and size however, the PA-10 is slightly larger in dimensions. The off-the-shelf PA-10 units also have 450 lbs of force rating, higher than the PA-09's force rating of 330 lbs. The basic model PA-10 has a no-load speed of 0.28 inch/sec and 0.16 inch/sec fully loaded. In applications where more force or speed is required, the PA-10 does have the option to be custom ordered for 24 VDC motors and have the specifications below:\n\nhttps://preview.redd.it/h6cgkaaxw0b51.jpg?width=867&amp;format=pjpg&amp;auto=webp&amp;s=f81fc33745b688b9b16ae0bbd7d0c1bd1d7d0834\n\n To get a more detailed, comprehensive insight into the capabilities of the PA-10, take a look at its [datasheet](https://cdn.shopify.com/s/files/1/0061/7735/7891/files/PA-10_Waterproof_Linear_Actuator_IP68M.pdf?v=15643474244385777072). For dimensional drawings, head straight to page 3.\n\n### Mounting Brackets\n\nThe [BRK-09](https://www.progressiveautomations.com/products/brk-09) is the compatible mounting bracket for PA-10 actuators. This bracket can be mounted on either the stroke or motor end and offers over 180° rotation.\n\nhttps://preview.redd.it/jnn4v3ozw0b51.jpg?width=392&amp;format=pjpg&amp;auto=webp&amp;s=946e7eb088089f9c2aebdd240182473a776d03cf\n\n \n\n## WHAT MAKES THE PA-10 SPECIAL?\n\nAside from being the most waterproof electric actuator, our standard version of the PA-10 has an approximately 120-hour salt spray rating with anodic oxidation on the stroke rod enclosure and motor housing cap. This means that even the standard model PA-10 would have more corrosion resistance in comparison to the rest of our other actuator models.\n\nThere is also the upgraded SS version of PA-10 that is made of aluminum with porcelain plating finish on the stroke rod enclosure and motor housing cap. A galvanized nickel alloy finish on the motor housing also comes with the salt spray option. The 400-hour salt spray option offers superior protection in harsh corrosive conditions compared to the standard unit.\n\nhttps://preview.redd.it/dr2fdk92x0b51.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=fb2d7c065cbe89ffb6add7b16bb2df0778588cc7\n\nFor more information on how salt spray testing would be performed, take a look at our [in-depth article](https://www.progressiveautomations.com/blogs/products/salt-spray-testing-to-evaluate-corrosion-resistance) that outlines our testing procedure.\n\n## INDUSTRIES &amp; APPLICATIONS OF THE PA-10\n\nSome examples of industries that would be suitable for the PA-10 include marine, automotive, and agricultural applications. The temperature rating from -20ºC to 70ºC (-4ºF to 158ºF) would allow the PA-10’s versatility to operate in temperatures below freezing and on very hot summer days.\n\nSince the PA-10 is our most waterproof linear actuator while static and in motion, it can also cycle while submerged underwater for opening and closing feeders, or underwater doors/gates in zoo aquariums or larger fishponds. In automotive applications, the PA-10's salt spray rating helps protect it from saltwater (motorboats) and salted roads during wintertime (cars, trucks, motorbikes). Agricultural applications would find the waterproof rating and corrosion resistance of the PA-10 useful since certain fertilizers and animal waste may have some corrosive/acidic properties to them which reaches the actuator overtime after being washed down from the rain.\n\n## CONCLUSION\n\nTo summarize, the PA-10 would be a great outdoor linear actuator to consider for applications requiring frequent exposure to rain, water splashes, or submersions. The PA-10 also has the versatility to be purchased with an extra 400-hour salt spray rating that is useful for corrosive/saltwater type environments. In applications that required feedback or synchronization, the PA-10 can also be ordered for hall effect sensors.", "link": "https://www.reddit.com/r/Automate/comments/hrnmt8/pa10_actuator_overview/", "origin": "Reddit", "suborigin": "Automate", "result": true, "Selector": "outdoor", "selectorShort": "outdoor", "MarkedSent": "pa-10 actuator overview /!/ introducing the pa-10\n\nan actuator may sometimes be used in applications that experience harsh environments such as saltwater, heavy rain, underwater submissions, or acidic/ corrosive substances. due to these demanding requirements, the right actuator with proper ratings would be recommended to handle these applications. in this product overview, we will be taking a look at the [pa-10 actuator](https://www.progressiveautomations.com/products/waterproof-linear-actuator-ip68m-for------> outdoor !!! -use?_pos=1&amp;_sid=a1867c906&amp;_ss=r) which has the highest ingress protection and salt spray rating options offered to make it the ideal -----> outdoor !!!  linear actuator.\n\nhttps://preview.redd.it/f35l3ahuw0b51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=1c4200574235fbf7de0d95777f4b80f9d58d8313\n\n \n\n## overview of the pa-10\n\n### water resistance\n\nthe pa-10 is currently the most waterproof linear actuator we offer with an ip rating of ip68m (in motion) and ip69k (when static). with these types of ip ratings, we finally have an actuator with the ability to be fully submerged while in motion and can withstand high-powered water jets while not in motion. for more information on how the ip rating system works, [click here](https://www.progressiveautomations.com/blogs/how-to/complete-guide-to-ip-rating) to understand the true impressiveness of pa-10’s ip capabilities.\n\n### physical appearance and capabilities\n\nour pa-10 and pa-09 actuators have a similar shape and size however, the pa-10 is slightly larger in dimensions. the off-the-shelf pa-10 units also have 450 lbs of force rating, higher than the pa-09's force rating of 330 lbs. the basic model pa-10 has a no-load speed of 0.28 inch/sec and 0.16 inch/sec fully loaded. in applications where more force or speed is required, the pa-10 does have the option to be custom ordered for 24 vdc motors and have the specifications below:\n\nhttps://preview.redd.it/h6cgkaaxw0b51.jpg?width=867&amp;format=pjpg&amp;auto=webp&amp;s=f81fc33745b688b9b16ae0bbd7d0c1bd1d7d0834\n\n to get a more detailed, comprehensive insight into the capabilities of the pa-10, take a look at its [datasheet](https://cdn.shopify.com/s/files/1/0061/7735/7891/files/pa-10_waterproof_linear_actuator_ip68m.pdf?v=15643474244385777072). for dimensional drawings, head straight to page 3.\n\n### mounting brackets\n\nthe [brk-09](https://www.progressiveautomations.com/products/brk-09) is the compatible mounting bracket for pa-10 actuators. this bracket can be mounted on either the stroke or motor end and offers over 180° rotation.\n\nhttps://preview.redd.it/jnn4v3ozw0b51.jpg?width=392&amp;format=pjpg&amp;auto=webp&amp;s=946e7eb088089f9c2aebdd240182473a776d03cf\n\n \n\n## what makes the pa-10 special?\n\naside from being the most waterproof electric actuator, our standard version of the pa-10 has an approximately 120-hour salt spray rating with anodic oxidation on the stroke rod enclosure and motor housing cap. this means that even the standard model pa-10 would have more corrosion resistance in comparison to the rest of our other actuator models.\n\nthere is also the upgraded ss version of pa-10 that is made of aluminum with porcelain plating finish on the stroke rod enclosure and motor housing cap. a galvanized nickel alloy finish on the motor housing also comes with the salt spray option. the 400-hour salt spray option offers superior protection in harsh corrosive conditions compared to the standard unit.\n\nhttps://preview.redd.it/dr2fdk92x0b51.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;s=fb2d7c065cbe89ffb6add7b16bb2df0778588cc7\n\nfor more information on how salt spray testing would be performed, take a look at our [in-depth article](https://www.progressiveautomations.com/blogs/products/salt-spray-testing-to-evaluate-corrosion-resistance) that outlines our testing procedure.\n\n## industries &amp; applications of the pa-10\n\nsome examples of industries that would be suitable for the pa-10 include marine, automotive, and agricultural applications. the temperature rating from -20ºc to 70ºc (-4ºf to 158ºf) would allow the pa-10’s versatility to operate in temperatures below freezing and on very hot summer days.\n\nsince the pa-10 is our most waterproof linear actuator while static and in motion, it can also cycle while submerged underwater for opening and closing feeders, or underwater doors/gates in zoo aquariums or larger fishponds. in automotive applications, the pa-10's salt spray rating helps protect it from saltwater (motorboats) and salted roads during wintertime (cars, trucks, motorbikes). agricultural applications would find the waterproof rating and corrosion resistance of the pa-10 useful since certain fertilizers and animal waste may have some corrosive/acidic properties to them which reaches the actuator overtime after being washed down from the rain.\n\n## conclusion\n\nto summarize, the pa-10 would be a great outdoor linear actuator to consider for applications requiring frequent exposure to rain, water splashes, or submersions. the pa-10 also has the versatility to be purchased with an extra 400-hour salt spray rating that is useful for corrosive/saltwater type environments. in applications that required feedback or synchronization, the pa-10 can also be ordered for hall effect sensors.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/Automate/comments/hrnmt8/pa10_actuator_overview/", "identifyer": 3513462, "year": "2020"}], "name": "outdoorAutomate2020"}