{"interestingcomments": [{"Unnamed: 0": 611, "autor": "petterimard", "date": 1560176316000, "content": "D850 or Z6 for studio portraits / kids /!/ I photograph mostly portraits with studio strobes, in studio or location. As a father I’m taking loads of family pictures also.\nCurrently own D600 and several F-mount lenses.\nI was offered a used D850 with a great price, but at the same time there is also a very tempting discount from the new Z6. Which way to go?\nWould really love the lightness of the Z6 and EVF, but another hand I’d appreciate the battery life and resolution of the D850 in the studio. Z7 is not an option.\nWhich one you’d take for studio/location work and occasional family trips?", "link": "https://www.reddit.com/r/Nikon/comments/byyeg6/d850_or_z6_for_studio_portraits_kids/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "d850 or z6 for studio portraits / kids /!/ i photograph mostly portraits with studio strobes, in studio or -----> location !!! . as a father i’m taking loads of family pictures also.\ncurrently own d600 and several f-mount lenses.\ni was offered a used d850 with a great price, but at the same time there is also a very tempting discount from the new z6. which way to go?\nwould really love the lightness of the z6 and evf, but another hand i’d appreciate the battery life and resolution of the d850 in the studio. z7 is not an option.\nwhich one you’d take for studio/location work and occasional family trips?", "sortedWord": "None", "identifyer": 620, "year": "2019"}, {"Unnamed: 0": 954, "autor": "Ralphique96", "date": 1568548186000, "content": "A pic I took with my old Nikon D5100 with kit lens 😬. What do u guys think? Could've been better or pretty okay-ish? (Location: Harajuk, Japan)", "link": "https://www.reddit.com/r/Nikon/comments/d4jg28/a_pic_i_took_with_my_old_nikon_d5100_with_kit/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a pic i took with my old nikon d5100 with kit lens 😬. what do u guys think? could've been better or pretty okay-ish? (-----> location !!! : harajuk, japan)", "sortedWord": "None", "identifyer": 964, "year": "2019"}, {"Unnamed: 0": 1014, "autor": "DmitryNik777", "date": 1568255390000, "content": "New image, new location, new processing method in C1. Nikon D610, Tamron 28-75mm f/2.8", "link": "https://www.reddit.com/r/Nikon/comments/d31cq1/new_image_new_location_new_processing_method_in/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new image, new -----> location !!! , new processing method in c1. nikon d610, tamron 28-75mm f/2.8", "sortedWord": "None", "identifyer": 1024, "year": "2019"}, {"Unnamed: 0": 105617, "autor": "syedfarhan93", "date": 1564868222000, "content": "Faint milky way? Not sure. Nikon 5600 18-55 mm lens. ISO3200 18mm f/3.5, 20s. First attempt at astrophotography. Edited with Adobe lightroom. Location: Thumamah National Park, Riyadh.", "link": "https://www.reddit.com/r/Nikon/comments/clo7dq/faint_milky_way_not_sure_nikon_5600_1855_mm_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "faint milky way? not sure. nikon 5600 18-55 mm lens. iso3200 18mm f/3.5, 20s. first attempt at astrophotography. edited with adobe lightroom. -----> location !!! : thumamah national park, riyadh.", "sortedWord": "None", "identifyer": 8486, "year": "2019"}, {"Unnamed: 0": 105797, "autor": "DmitryNik777", "date": 1571156362000, "content": "New image, new location. Nikon D610, Nikon 50mm 1.8 Part2", "link": "https://www.reddit.com/r/Nikon/comments/dia7f6/new_image_new_location_nikon_d610_nikon_50mm_18/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new image, new -----> location !!! . nikon d610, nikon 50mm 1.8 part2", "sortedWord": "None", "identifyer": 8669, "year": "2019"}, {"Unnamed: 0": 106791, "autor": "my_lemonade", "date": 1556657091000, "content": "Troubleshooting - Nikon Z6 not Showing up in Mac OS Mojave /!/ Hey everyone,\n\nHoping maybe someone has experienced this as well and could shed some light.\n\nI recently got my Z6. I have the latest version of Mojave on my 2018 Macbook Pro. I'm using the latest version of lightroom CC. Up until yesterday, to load my photos in light room I would do the following:\n\nOpen Lightroom\nPlug in camera via USB (don't have the card reader yet).\nTurn on camera\nHit the (+) on the import tab, and the Z6 would be there as a location to import from, import photos. \nDone.\n\nHowever yesterday, repeating the same steps, and with nothing else being changed, the camera no longer shows up in Lightroom, or on the computer at all.\n\nHas anyone else experienced something like this? Just a little confused as less than 24 hours passed, and now my workflow doesn't work.\n\nAny insight is appreciated, thanks!", "link": "https://www.reddit.com/r/Nikon/comments/bj8dku/troubleshooting_nikon_z6_not_showing_up_in_mac_os/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "troubleshooting - nikon z6 not showing up in mac os mojave /!/ hey everyone,\n\nhoping maybe someone has experienced this as well and could shed some light.\n\ni recently got my z6. i have the latest version of mojave on my 2018 macbook pro. i'm using the latest version of lightroom cc. up until yesterday, to load my photos in light room i would do the following:\n\nopen lightroom\nplug in camera via usb (don't have the card reader yet).\nturn on camera\nhit the (+) on the import tab, and the z6 would be there as a -----> location !!!  to import from, import photos. \ndone.\n\nhowever yesterday, repeating the same steps, and with nothing else being changed, the camera no longer shows up in lightroom, or on the computer at all.\n\nhas anyone else experienced something like this? just a little confused as less than 24 hours passed, and now my workflow doesn't work.\n\nany insight is appreciated, thanks!", "sortedWord": "None", "identifyer": 9677, "year": "2019"}, {"Unnamed: 0": 106835, "autor": "TheWrathOfKhaan", "date": 1556384376000, "content": "D7500 not geotagging photos? Have location data enabled through SnapBridge but location is not shown.", "link": "https://www.reddit.com/r/Nikon/comments/bi13fs/d7500_not_geotagging_photos_have_location_data/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "d7500 not geotagging photos? have -----> location !!!  data enabled through snapbridge but -----> location !!!  is not shown.", "sortedWord": "None", "identifyer": 9721, "year": "2019"}, {"Unnamed: 0": 108418, "autor": "DmitryNik777", "date": 1567206107000, "content": "New image, new location. Nikon D610, Nikon 50mm 1.8", "link": "https://www.reddit.com/r/Nikon/comments/cxoc7b/new_image_new_location_nikon_d610_nikon_50mm_18/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new image, new -----> location !!! . nikon d610, nikon 50mm 1.8", "sortedWord": "None", "identifyer": 11325, "year": "2019"}, {"Unnamed: 0": 108659, "autor": "PM_ME_HUSKY_PUPS", "date": 1551812176000, "content": "D810 vs D850 as first (fullframe) dslr /!/ Hi all,\n\n&amp;#x200B;\n\nI've been saving up quite a bit of cash and with tax returns coming I feel confident that I have a sufficient buffer to splurge on something I've been wanting for a long time: a good camera. Due to my geographical location and holiday preferences I will be shooting a lot in low-light situations (think just before dawn/after dusk but also Aurora photography). My main intent will also be on landscape photography with perhaps a side interst in portaits (and ofcourse my Akita Inu). \n\n&amp;#x200B;\n\nI've also opted for going all out and going for a full-frame camera (mainly for the image quality, the bigger image in general and its advantages in low-light situations. Which left me hung-up on the D810 and the D850. I've been checking out some websites I found through google (mainly [mpb.com](https://mpb.com) and [tweakers.net](https://tweakers.net)) and I usually see second hand D850 go for around 2.000 pounds/2500 euros minimum and the D810 for around 1000 pounds/1100 euros. \n\n&amp;#x200B;\n\nNow I've also seen posts that say the improvements of the D850 over the D810 are minimal and others saying that the D850 is the best camera ever by a landslide. \n\n&amp;#x200B;\n\nSo my question now is, when compared to each other, whats the advantages and disadvantages of each, how does the D810 hold up nowadays and whats your experience with either/both?  \n\n\nThank you in advance!    \n\n\nPS I did read the \"What body to buy - a guide for beginners\" but I guess the D810/D850 don't qualify as beginner cameras. ", "link": "https://www.reddit.com/r/Nikon/comments/axoqod/d810_vs_d850_as_first_fullframe_dslr/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "d810 vs d850 as first (fullframe) dslr /!/ hi all,\n\n&amp;#x200b;\n\ni've been saving up quite a bit of cash and with tax returns coming i feel confident that i have a sufficient buffer to splurge on something i've been wanting for a long time: a good camera. due to my geographical -----> location !!!  and holiday preferences i will be shooting a lot in low-light situations (think just before dawn/after dusk but also aurora photography). my main intent will also be on landscape photography with perhaps a side interst in portaits (and ofcourse my akita inu). \n\n&amp;#x200b;\n\ni've also opted for going all out and going for a full-frame camera (mainly for the image quality, the bigger image in general and its advantages in low-light situations. which left me hung-up on the d810 and the d850. i've been checking out some websites i found through google (mainly [mpb.com](https://mpb.com) and [tweakers.net](https://tweakers.net)) and i usually see second hand d850 go for around 2.000 pounds/2500 euros minimum and the d810 for around 1000 pounds/1100 euros. \n\n&amp;#x200b;\n\nnow i've also seen posts that say the improvements of the d850 over the d810 are minimal and others saying that the d850 is the best camera ever by a landslide. \n\n&amp;#x200b;\n\nso my question now is, when compared to each other, whats the advantages and disadvantages of each, how does the d810 hold up nowadays and whats your experience with either/both?  \n\n\nthank you in advance!    \n\n\nps i did read the \"what body to buy - a guide for beginners\" but i guess the d810/d850 don't qualify as beginner cameras. ", "sortedWord": "None", "identifyer": 11567, "year": "2019"}], "name": "locationnikon2019"}