{"interestingcomments": [{"Unnamed: 0": 23217, "autor": "Agent_441", "date": 1595989049000, "content": "I need help shipping spare rechargeable lithium ion battery for Nikon camera...internationally /!/  Ok so I am having a really hard time trying to figure out how one could  possibly buy spare batteries. I live in Bermuda so middle of nowhere and  stores bring in what sells quick. So how can I buy a preferably Nikon  battery from a international online store. Amazon and B&amp;H have been  unsuccessful and the thought of having to buy another camera just to  ship a battery is crazy cause aviation rules say must come with device.  Is their a company that sells this type of stuff and is dangerous goods  certified so that a courier can ship it? I find it ridiculous amazon  would not have a special department that is certified in shipping things  most people use i.e batteries etc Has anyone else who is in a  international location that faced these type of issues?", "link": "https://www.reddit.com/r/Nikon/comments/hzs7yr/i_need_help_shipping_spare_rechargeable_lithium/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i need help shipping spare rechargeable lithium ion battery for nikon camera...internationally /!/  ok so i am having a really hard time trying to figure out how one could  possibly buy spare batteries. i live in bermuda so middle of nowhere and  stores bring in what sells quick. so how can i buy a preferably nikon  battery from a international online store. amazon and b&amp;h have been  unsuccessful and the thought of having to buy another camera just to  ship a battery is crazy cause aviation rules say must come with device.  is their a company that sells this type of stuff and is dangerous goods  certified so that a courier can ship it? i find it ridiculous amazon  would not have a special department that is certified in shipping things  most people use i.e batteries etc has anyone else who is in a  international -----> location !!!  that faced these type of issues?", "sortedWord": "None", "identifyer": 23610, "year": "2020"}, {"Unnamed: 0": 23737, "autor": "amsterdam_macro", "date": 1580574099000, "content": "Marpissa muscosa - Nikon AF 200mm f/4.0D IF-ED /!/ *  Subject : Marpissa muscosa  \nCamera : Nikon D5600  \nLens : Nikon AF 200mm f/4.0D IF-ED  \nM/Obj : Nikon 4xPlan 0.10 WD30  \nDate: november 2019  \nMagnification: 4.5x  \nLens Settings: iso100, 1/100, f4  \nLocation: Amsterdam NL   \nOther : Extension tubes / Flash / Helicon Focus / Photoshop CC2018 / Srgb 99% / NIK / Diffusers / Stackrail RS90P \n\nhttps://preview.redd.it/vdmm00or8ce41.jpg?width=2028&amp;format=pjpg&amp;auto=webp&amp;s=4f26c1df7661f2c0518efc385d5218d5d3933c2d", "link": "https://www.reddit.com/r/Nikon/comments/ex8fzw/marpissa_muscosa_nikon_af_200mm_f40d_ifed/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "marpissa muscosa - nikon af 200mm f/4.0d if-ed /!/ *  subject : marpissa muscosa  \ncamera : nikon d5600  \nlens : nikon af 200mm f/4.0d if-ed  \nm/obj : nikon 4xplan 0.10 wd30  \ndate: november 2019  \nmagnification: 4.5x  \nlens settings: iso100, 1/100, f4  \n-----> location !!! : amsterdam nl   \nother : extension tubes / flash / helicon focus / photoshop cc2018 / srgb 99% / nik / diffusers / stackrail rs90p \n\nhttps://preview.redd.it/vdmm00or8ce41.jpg?width=2028&amp;format=pjpg&amp;auto=webp&amp;s=4f26c1df7661f2c0518efc385d5218d5d3933c2d", "sortedWord": "None", "identifyer": 24142, "year": "2020"}, {"Unnamed: 0": 26273, "autor": "YW26", "date": 1580115555000, "content": "Taking my own engagement/proposal photos using D3500 &amp; tripod - what lens, setting etc.? (Amateur) /!/ Hey guys,\n\nI’m going to get a shoot a few weeks later with a professional photographer, however for the engagement/proposal itself I thought I could take my own camera to get some nicer photos than the iPhone selfie given the location will be remote. For background, I have a decent understanding of how light works and how to shoot manual. I’ve been shooting for a year so relatively new to this; I’ve mostly shot nature not people so I am clueless as to what the best settings are.\n\nI have the Nikon D3500 (crop), and a 35mm 1.8. I also have the 18-55 kit lens. I probably need to rent an 85mm (or whatever the equivalent is?). I’m aiming for golden hour sunrise or sunset, and I’ll use a tripod.\n\nCan anyone give me tips, what aperture is best for mid-upper body/head focus? Composition wise I’d probably want 1/2 us, 1/2 background. I usually like AF-C (continuous servo I think it’s called) and single point AF, but given that can only focus using one point, another setting may be better so both our faces are in focus? I use back button focus, so hopefully as long as I remember where I’ve locked in before I run in it’ll be focused. \n\nI’ll do a few test runs beforehand but I’m a complete novice at self-portraits so any advice is appreciated! Thanks.", "link": "https://www.reddit.com/r/Nikon/comments/eulfjv/taking_my_own_engagementproposal_photos_using/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "taking my own engagement/proposal photos using d3500 &amp; tripod - what lens, setting etc.? (amateur) /!/ hey guys,\n\ni’m going to get a shoot a few weeks later with a professional photographer, however for the engagement/proposal itself i thought i could take my own camera to get some nicer photos than the iphone selfie given the -----> location !!!  will be remote. for background, i have a decent understanding of how light works and how to shoot manual. i’ve been shooting for a year so relatively new to this; i’ve mostly shot nature not people so i am clueless as to what the best settings are.\n\ni have the nikon d3500 (crop), and a 35mm 1.8. i also have the 18-55 kit lens. i probably need to rent an 85mm (or whatever the equivalent is?). i’m aiming for golden hour sunrise or sunset, and i’ll use a tripod.\n\ncan anyone give me tips, what aperture is best for mid-upper body/head focus? composition wise i’d probably want 1/2 us, 1/2 background. i usually like af-c (continuous servo i think it’s called) and single point af, but given that can only focus using one point, another setting may be better so both our faces are in focus? i use back button focus, so hopefully as long as i remember where i’ve locked in before i run in it’ll be focused. \n\ni’ll do a few test runs beforehand but i’m a complete novice at self-portraits so any advice is appreciated! thanks.", "sortedWord": "None", "identifyer": 26739, "year": "2020"}, {"Unnamed: 0": 26403, "autor": "IroncladDiplomat", "date": 1599092435000, "content": "What is the folder location of images transferred to the phone with snapbridge? /!/ [removed]", "link": "https://www.reddit.com/r/Nikon/comments/ilj09n/what_is_the_folder_location_of_images_transferred/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "what is the folder -----> location !!!  of images transferred to the phone with snapbridge? /!/ [removed]", "sortedWord": "None", "identifyer": 26873, "year": "2020"}, {"Unnamed: 0": 27453, "autor": "vlizana", "date": 1582699523000, "content": "Is it just me or snap bridge does not work at all? /!/ So I saw this [ad](https://www.nikoncenter.cl/uploads/banners/20190821-053731.jpg) in the local nikon seller page (it's in spanish, sorry) about snap bridge and it really pissed me off, because I had already tried it (Nikon d3500) and it was completely not functional:\n\n* RAW images download: my camera does not have wifi but I've already seen in other posts that people are having issues here.\n* Faster automatic image transfer (2 mega pixels): ok haven't tried this one but someone should have noticed the camera shoots in over 20 mega pixels by now.\n* Camera control (adjust focus, aperture, exposure time and beyond): this is complete bs, I can't even get live view to work on my phone as it shows in the picture.\n* Faster pairing: are you kidding me? is this the few times it actually achieves pairing?\n* Energy saving mode: haven't got this far yet in the app, can barely pair it.\n* Location info: same\n* Better design making the app much easier to use: I litteraly have not been able to use the app.\n\nAm I the only one with this issues? because at this point I'm about to put a lawsuit on the store for false advertising, this is completely fake, almost every point.", "link": "https://www.reddit.com/r/Nikon/comments/f9p7ss/is_it_just_me_or_snap_bridge_does_not_work_at_all/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "is it just me or snap bridge does not work at all? /!/ so i saw this [ad](https://www.nikoncenter.cl/uploads/banners/20190821-053731.jpg) in the local nikon seller page (it's in spanish, sorry) about snap bridge and it really pissed me off, because i had already tried it (nikon d3500) and it was completely not functional:\n\n* raw images download: my camera does not have wifi but i've already seen in other posts that people are having issues here.\n* faster automatic image transfer (2 mega pixels): ok haven't tried this one but someone should have noticed the camera shoots in over 20 mega pixels by now.\n* camera control (adjust focus, aperture, exposure time and beyond): this is complete bs, i can't even get live view to work on my phone as it shows in the picture.\n* faster pairing: are you kidding me? is this the few times it actually achieves pairing?\n* energy saving mode: haven't got this far yet in the app, can barely pair it.\n* -----> location !!!  info: same\n* better design making the app much easier to use: i litteraly have not been able to use the app.\n\nam i the only one with this issues? because at this point i'm about to put a lawsuit on the store for false advertising, this is completely fake, almost every point.", "sortedWord": "None", "identifyer": 27967, "year": "2020"}, {"Unnamed: 0": 27895, "autor": "Most-Meringue3731", "date": 1596873044000, "content": "Just got my 50mm 1.4G Nikon D810 /!/ Test shots from the other day or two. ISO mostly 64. Shutter hovering around 1/80/100/200. Location is at Cornell University in Ithaca NY. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/fajzetzkhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=d4a04d3af43f65e1ce78f1a2eeb456e80047038c\n\nhttps://preview.redd.it/uln6m20lhqf51.jpg?width=799&amp;format=pjpg&amp;auto=webp&amp;s=5900b04959d678557668dd2ab03feb9feb17f1ec\n\nhttps://preview.redd.it/pl99y30lhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=aaf1d928e922478cd825f306f1f1623c03217bb7\n\nhttps://preview.redd.it/vyjt630lhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=a717d7546bf893e4c7009b3b16c7e41d6aa7f0b7\n\nhttps://preview.redd.it/7smff20lhqf51.jpg?width=799&amp;format=pjpg&amp;auto=webp&amp;s=d663d836df10246d3816ce897e8f1aa98d4a4340\n\nhttps://preview.redd.it/n0oiltzkhqf51.jpg?width=596&amp;format=pjpg&amp;auto=webp&amp;s=2f83cb38a8175a3deaf4be8d6747c7410024ba2b", "link": "https://www.reddit.com/r/Nikon/comments/i5vd0p/just_got_my_50mm_14g_nikon_d810/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "just got my 50mm 1.4g nikon d810 /!/ test shots from the other day or two. iso mostly 64. shutter hovering around 1/80/100/200. -----> location !!!  is at cornell university in ithaca ny. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/fajzetzkhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=d4a04d3af43f65e1ce78f1a2eeb456e80047038c\n\nhttps://preview.redd.it/uln6m20lhqf51.jpg?width=799&amp;format=pjpg&amp;auto=webp&amp;s=5900b04959d678557668dd2ab03feb9feb17f1ec\n\nhttps://preview.redd.it/pl99y30lhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=aaf1d928e922478cd825f306f1f1623c03217bb7\n\nhttps://preview.redd.it/vyjt630lhqf51.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=a717d7546bf893e4c7009b3b16c7e41d6aa7f0b7\n\nhttps://preview.redd.it/7smff20lhqf51.jpg?width=799&amp;format=pjpg&amp;auto=webp&amp;s=d663d836df10246d3816ce897e8f1aa98d4a4340\n\nhttps://preview.redd.it/n0oiltzkhqf51.jpg?width=596&amp;format=pjpg&amp;auto=webp&amp;s=2f83cb38a8175a3deaf4be8d6747c7410024ba2b", "sortedWord": "None", "identifyer": 28429, "year": "2020"}, {"Unnamed: 0": 28068, "autor": "tepidity", "date": 1589433680000, "content": "My little rescue lens /!/ This is my Nikon AF Nikkor 80-200mm f/2.8D ED. \n\nWhen I took home this lens a little over a month ago, the poor little thing's autofocus wasn't working. It was stuck in manual-focus mode. The M-A ring was cracked, and it wouldn't budge. The seller probably figured it was crippled for life, so he let it go for $160, listing the lens as manual-focus-only. But I had an inkling I could fix this little guy and help it back to its former glory.\n\nThe lens came in the mail two days later. I couldn't wait to take it apart and see what I could do. But I didn't know how. So I scoured the internet for guidance and quickly found [this excellent video](https://www.youtube.com/watch?v=Eu4oA2F2v9Y) that walked me through almost a full teardown of the lens. Bracing myself against the possibility that I'd ruin the lens trying to fix it, I started disassembling.\n\nAfter about an hour of nervous sweat, I finally reached the M-A ring. The source of the trouble was now as clear as day. The former owner (not necessarily the seller) had attempted to mend the cracked ring with superglue—and had only managed to stick it fast to the barrel. It was a few minutes' work to pick out and scrape off the dried glue, which had worked its way far from the location of the crack. When I was done, the M-A ring moved freely once again. Turning it, I could see that the M-A switch mechanism seemed to be working correctly. (The cracked ring was tricky to turn but did not itself prevent operation of the mechanism.) Excitedly, I began putting the beast back together.\n\nWhen I was nearly done reassembling the lens, something very bad happened. In my haste, I tore the flex cable connecting the lens's CPU to the CPU contacts in the bayonet mount. It was only a partial tear, a single trace severed...but I knew the lens was doomed. Still, I finished putting it back together—what else could i do?—mounted it on my camera, and attempted to use it. I tried using autofocus...\n\nNothing. No movement. Not a sound. \n\nNot only was the lens *still* manual-focus only, but as far as the camera was concerned, it no longer registered as a lens. It was now a *non-CPU lens*, like some old manual-focus Nikkor from the days before AF. I would have to enter it in the camera's non-CPU lens database and use it without autofocus, forever.\n\nRight. You know the story doesn't end that way. \n\nI went out and bought a soldering iron from the local Harbor Freight. A ten-dollar, store-branded, Made in China unit, the only kind they had. And some solder. The COVID-19 lockdown had gone into effect only days before here in L.A., and I was the only customer in the store.\n\nWell, to cut the story short, I got home, took the lens apart enough to expose the torn flex cable, and fixed it with the soldering iron. Success.\n\nAnd now I have a fully-working, autofocus-capable Nikon 80-200mm f/2.8D ED lens! One of the best-regarded lenses in the long history of the Nikkor line, mine for the bargain price of $160 ($170 including the soldering iron) and a few hours of anxious work.\n\nLater, I ordered a third-party, *metal* M-A ring to replace the cracked plastic original, which had become nearly unworkable. It took a month to arrive, and it was a pain to install. But now the lens looks as nice as it works.", "link": "https://www.reddit.com/r/Nikon/comments/gjfzk1/my_little_rescue_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "my little rescue lens /!/ this is my nikon af nikkor 80-200mm f/2.8d ed. \n\nwhen i took home this lens a little over a month ago, the poor little thing's autofocus wasn't working. it was stuck in manual-focus mode. the m-a ring was cracked, and it wouldn't budge. the seller probably figured it was crippled for life, so he let it go for $160, listing the lens as manual-focus-only. but i had an inkling i could fix this little guy and help it back to its former glory.\n\nthe lens came in the mail two days later. i couldn't wait to take it apart and see what i could do. but i didn't know how. so i scoured the internet for guidance and quickly found [this excellent video](https://www.youtube.com/watch?v=eu4oa2f2v9y) that walked me through almost a full teardown of the lens. bracing myself against the possibility that i'd ruin the lens trying to fix it, i started disassembling.\n\nafter about an hour of nervous sweat, i finally reached the m-a ring. the source of the trouble was now as clear as day. the former owner (not necessarily the seller) had attempted to mend the cracked ring with superglue—and had only managed to stick it fast to the barrel. it was a few minutes' work to pick out and scrape off the dried glue, which had worked its way far from the -----> location !!!  of the crack. when i was done, the m-a ring moved freely once again. turning it, i could see that the m-a switch mechanism seemed to be working correctly. (the cracked ring was tricky to turn but did not itself prevent operation of the mechanism.) excitedly, i began putting the beast back together.\n\nwhen i was nearly done reassembling the lens, something very bad happened. in my haste, i tore the flex cable connecting the lens's cpu to the cpu contacts in the bayonet mount. it was only a partial tear, a single trace severed...but i knew the lens was doomed. still, i finished putting it back together—what else could i do?—mounted it on my camera, and attempted to use it. i tried using autofocus...\n\nnothing. no movement. not a sound. \n\nnot only was the lens *still* manual-focus only, but as far as the camera was concerned, it no longer registered as a lens. it was now a *non-cpu lens*, like some old manual-focus nikkor from the days before af. i would have to enter it in the camera's non-cpu lens database and use it without autofocus, forever.\n\nright. you know the story doesn't end that way. \n\ni went out and bought a soldering iron from the local harbor freight. a ten-dollar, store-branded, made in china unit, the only kind they had. and some solder. the covid-19 lockdown had gone into effect only days before here in l.a., and i was the only customer in the store.\n\nwell, to cut the story short, i got home, took the lens apart enough to expose the torn flex cable, and fixed it with the soldering iron. success.\n\nand now i have a fully-working, autofocus-capable nikon 80-200mm f/2.8d ed lens! one of the best-regarded lenses in the long history of the nikkor line, mine for the bargain price of $160 ($170 including the soldering iron) and a few hours of anxious work.\n\nlater, i ordered a third-party, *metal* m-a ring to replace the cracked plastic original, which had become nearly unworkable. it took a month to arrive, and it was a pain to install. but now the lens looks as nice as it works.", "sortedWord": "None", "identifyer": 28603, "year": "2020"}, {"Unnamed: 0": 28214, "autor": "routenull", "date": 1603239323000, "content": "Soccer Photography - Moving Beyond The 70-200MM F/2.8 /!/ I mainly shoot soccer photography for my son's club and he's recently transitioned from 7v7 to 9v9, which has resulted in moving to a larger field. This larger field size, plus trying to shoot other matches for the club on even larger fields, has forced me to start looking into other lenses as the reach on the 70-200 is at it's limits.\n\nI'm looking for suggestions on what might go well with my D850 that will give me some more range. 90% of the matches are daylight, so a fast lens isn't 100% necessary.\n\n\n**Lenses I've Considered:**\n\nNikon 300mm f/4E AF-S PF ED VR\n\nNikon 200-500mm f5.6\n\nObviously changing shooting locations around the field was my first thought, given the COVID restrictions clubs are placing on events, that is getting more difficult.", "link": "https://www.reddit.com/r/Nikon/comments/jf2582/soccer_photography_moving_beyond_the_70200mm_f28/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "soccer photography - moving beyond the 70-200mm f/2.8 /!/ i mainly shoot soccer photography for my son's club and he's recently transitioned from 7v7 to 9v9, which has resulted in moving to a larger field. this larger field size, plus trying to shoot other matches for the club on even larger fields, has forced me to start looking into other lenses as the reach on the 70-200 is at it's limits.\n\ni'm looking for suggestions on what might go well with my d850 that will give me some more range. 90% of the matches are daylight, so a fast lens isn't 100% necessary.\n\n\n**lenses i've considered:**\n\nnikon 300mm f/4e af-s pf ed vr\n\nnikon 200-500mm f5.6\n\nobviously changing shooting -----> locations !!!  around the field was my first thought, given the covid restrictions clubs are placing on events, that is getting more difficult.", "sortedWord": "None", "identifyer": 28751, "year": "2020"}, {"Unnamed: 0": 28579, "autor": "CaptainNinj", "date": 1603937436000, "content": "5 years of growth- started with a D3200, then a D7500, and now D750 at the same location. Excited for the future", "link": "https://www.reddit.com/r/Nikon/comments/jk1m5x/5_years_of_growth_started_with_a_d3200_then_a/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "5 years of growth- started with a d3200, then a d7500, and now d750 at the same -----> location !!! . excited for the future", "sortedWord": "None", "identifyer": 29129, "year": "2020"}, {"Unnamed: 0": 28620, "autor": "L1terallyUrDad", "date": 1603816737000, "content": "More Nikon Z 5 observations (and you thought I was done) /!/ Well, so did I.\n\nI'm rolling back home from spending a week in the mountains chasing autumn colors, waterfalls, some landscapes, and a few other interesting subjects.\n\nI packed nearly my complete kit for the trip, which consisted of a Z 5 + FTZ adapter, D500, Tokina 16-20 f/2.8, Nikon 24-85 f/3.5-4.5 (primary lens for the trip), Nikon 60mm f/2.8 macro (not sure how this snuck into the bag, didn't use it), Nikon 105mm f/2.8 macro, Nikon 70-200 f/2.8 VR II, and my Tamron 150-600mm f/5.0-6.3 along with a host of accessories like variable ND filter, step-down ring, cable releases, two tripods (heavy-duty, light travel), release plates for both, etc.\n\nI knew the Z 5 was going to be my camera of choice for most everything. The D500 does have a vertical grip mounted, adding to it's bulk. When hiking for the water falls or out landscaping, I seriouslly appreciated the Z's compact size. I left my 24-70/f2.8 at home over the lighter weight 24-85. I can only imagine donig these shots once I get my hands on the Z mount 24-70 f/4 and won't have the FTZ adapter bulking things up. \n\nThere were two reasons I brought the D500 with me. I had a planned visit to a small zoo and I would want the Tamron 150-600mm which doesn't AF on the Z 5+FTZ combo. There were hopes I would also find some wild deer or a black bear. I also got an opportunity to photograph the moon from a fairly dark sky location, so having it for those photos was good. True to form, the D500 sat unused for most of the trip.\n\nThe Z 5 worked quite very well, to the point I'm almost questioning the need to keep the D500 going forward.\n\nAs I've stated in previous posts, the Z 5 seems like a very suitable replacement for my former D750 except for the lack of a vertical grip and 2 fps (which is important for me). As such I will be sending the Z 5 back and ordering a Z 6II to use as my primary camera.\n\nBut here are a few things to know about the Z 5 (and I presume the entire Z family).\n\n**EVF:** I have a love-hate relationship with the EVF. It's really great to see your exposures. For my watefall shots, I knew that I wanted a 1 second exposure and f/8 or f/11 and I wanted to  keep the ISO low. With the variable ND filter and an optical viewfinder, you're guessing at the exposure. Take the photo, check the results, reshoot if you didn't get it right. The EVF let me dial the ND filter in just where I wanted it before I took the photo. You can zoom in to see your subject better. It creates a lot of flexibility. \n\nBut... it's pretty bright and sometimes it would give me the sensation that the shot was going to be blown out and I was frequently dialing in -EV. Maybe it's a bit too contrasty. I believe the images were okay and I didn't necessarily need to dial in that -0.3 or -0.7, but there were times where it was helpful.\n\nThe  other annoyance is shooting fast sequences for action shots or moving wildlife. At the zoo, when I was shooting short bursts, it was a little disorienting like stuttering slow-mo-video. I'm hoping with the faster frame rate on the Z 6II and less blackout it will help here. It's almost like it is showing the last shot briefly instead. It's weird. When shooting the animals at the zoo, the Optical view finder felt more natural. Maybe I need to use it more in these conditions.  \n\nI love focus peaking. I found myself doing more manual focus including using the Tamron on the Z 5. This is only possible with the EVF.\n\n**Battery Life**: The EN-EL15c basically could shoot all day. Driving back from some of our locations, I did have to pop in another battery while reviewing them. But oddly, the day the battery was drained the most, I only shot 152 stills and 13 video clips. But these were all long exposure waterfall shots. Many of them were in the 1-2 second range with a 2 second shutter delay and the 2 second ones kicked in long exposure noise reduction. I would keep the EVF or LCD awake while adjusting the neutral density filter, so I don't think it's a fair representation if you're just counting numbers of images. The next day I shot 438 images and one video clip and I had power to spare at the end of the day. I had a fair amount of review that day, For time lapse/astro work, I can see where USB power will be a helpful thing.\n\n**Card Speeds**: This is definetly not a camera related issue. I'm using a pair of 64GB UHS-I (95mb/s) cards in the Z 5, since that's what I had already. I have a 440mmb/s XQD card in the D500. The transfer times from cards to my MacBook Pro is quite noticiably different. UHS-II cards are more expensive, but I believe they are going to be worth the investment since they are 300mb/s. Still not as fast as the XQD cards. Since I'm considering the Z 6II, I'm wondering if I will be happy with my XQD cards or if I should get the 2-4 gb/s CFExspress cards, Still get the UHS-II cards for the SD slots.\n\n**Fun Stuff**: On my DSLRs, I pretty much just shot stills. I have a Pluto trigger which can do some fun things like it's laser trigger, but I've really not put it through it's paces. I had played with focus stacking before (doesn't work well handheld and breezy subjects), but I did my first time-lapse of moving clouds . I messed around with in camera HDR. And the whole video experience (flip a switch, press a button) was pretty good.\n\n**Handling**: I love this camera. Period. Full stop. That means I will love the Z 6II even more.\n\n**AF**: On my D750 and for the most part, the D500, I would put it on Dynamic 25 and AF-C and leave it there. You can certainly do that with the Z 5, but I do find myself switching between AF-C and AF-S more frequently. I'm switching between single point, dynamic and auto AF (where eye/face tracking lives) trying to find the best mode for the subject. I can't tell if  this is  a good thing or a bad thing. With the DSLRs, AF-C Dynamic 25 was good enough. I don't know if I'm just finding better ways to AF or if I'm just not trusting the AF to default to a standard settings. I feel like there may be more AF misses, but I can't rule out my error because I'm putzing with different settings. I get plenty of good photos, /shrug\n\n**MF**: As mentioned above, I love focus peaking. I was able to use the big Tamron on the Z 5 without AF. There were a fair amount of my backlight otters that the red contrast highlights made me think the face was in focus, just to find out that I missed a little bit. Zooming in may have helpted, but when you have the camera up to your face gettnig to the Zoom +/- buttons and dealing with a heavy lens is a bit of a challenge. I think it's time to just pony up the money and get the Nikon 200-500 and call it a day. Side note: Red focus peaking highlights on red flowers is useless. Change colors to yellow or blue :-)\n\n**Final thoughts**: This is a great camera. It's just not the right camera for me. I do want a functional vertical grip. I wan't the faster FPS. Based on the info in front of me, the Z 6II is the right camera for me. But if you don't need 12fps or don't want the option of the vertical grip (whcih will make the camera more bulky) the Z 5 is an excellent choice. I think it would be a solid backup camera for a wedding photographer, heck even a pair of them would be a solid wedding combo.  \n\nIt certainly has more than enough features that \"Entry level\" is an insult to this camera. \n\nIt's a full-frame, very well built and weather sealed camera that produces some excellent images. I would not hesitate to recommend this to anyone coming from the Dxxxx family of bodies wanting to go mirrorless and jump to full-frame. I would think anyone coming from D6xx and D7xx bodies would also be quite happy with this if the 4.5fps frame rate isn't a problem and you don't need the vertical grip. It's not quite going to make the D4/D5/D6/D500 user happy. The Z 9 may be that camera. D8xxx users will likely want a Z 7II.", "link": "https://www.reddit.com/r/Nikon/comments/jj4ma9/more_nikon_z_5_observations_and_you_thought_i_was/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "more nikon z 5 observations (and you thought i was done) /!/ well, so did i.\n\ni'm rolling back home from spending a week in the mountains chasing autumn colors, waterfalls, some landscapes, and a few other interesting subjects.\n\ni packed nearly my complete kit for the trip, which consisted of a z 5 + ftz adapter, d500, tokina 16-20 f/2.8, nikon 24-85 f/3.5-4.5 (primary lens for the trip), nikon 60mm f/2.8 macro (not sure how this snuck into the bag, didn't use it), nikon 105mm f/2.8 macro, nikon 70-200 f/2.8 vr ii, and my tamron 150-600mm f/5.0-6.3 along with a host of accessories like variable nd filter, step-down ring, cable releases, two tripods (heavy-duty, light travel), release plates for both, etc.\n\ni knew the z 5 was going to be my camera of choice for most everything. the d500 does have a vertical grip mounted, adding to it's bulk. when hiking for the water falls or out landscaping, i seriouslly appreciated the z's compact size. i left my 24-70/f2.8 at home over the lighter weight 24-85. i can only imagine donig these shots once i get my hands on the z mount 24-70 f/4 and won't have the ftz adapter bulking things up. \n\nthere were two reasons i brought the d500 with me. i had a planned visit to a small zoo and i would want the tamron 150-600mm which doesn't af on the z 5+ftz combo. there were hopes i would also find some wild deer or a black bear. i also got an opportunity to photograph the moon from a fairly dark sky -----> location !!! , so having it for those photos was good. true to form, the d500 sat unused for most of the trip.\n\nthe z 5 worked quite very well, to the point i'm almost questioning the need to keep the d500 going forward.\n\nas i've stated in previous posts, the z 5 seems like a very suitable replacement for my former d750 except for the lack of a vertical grip and 2 fps (which is important for me). as such i will be sending the z 5 back and ordering a z 6ii to use as my primary camera.\n\nbut here are a few things to know about the z 5 (and i presume the entire z family).\n\n**evf:** i have a love-hate relationship with the evf. it's really great to see your exposures. for my watefall shots, i knew that i wanted a 1 second exposure and f/8 or f/11 and i wanted to  keep the iso low. with the variable nd filter and an optical viewfinder, you're guessing at the exposure. take the photo, check the results, reshoot if you didn't get it right. the evf let me dial the nd filter in just where i wanted it before i took the photo. you can zoom in to see your subject better. it creates a lot of flexibility. \n\nbut... it's pretty bright and sometimes it would give me the sensation that the shot was going to be blown out and i was frequently dialing in -ev. maybe it's a bit too contrasty. i believe the images were okay and i didn't necessarily need to dial in that -0.3 or -0.7, but there were times where it was helpful.\n\nthe  other annoyance is shooting fast sequences for action shots or moving wildlife. at the zoo, when i was shooting short bursts, it was a little disorienting like stuttering slow-mo-video. i'm hoping with the faster frame rate on the z 6ii and less blackout it will help here. it's almost like it is showing the last shot briefly instead. it's weird. when shooting the animals at the zoo, the optical view finder felt more natural. maybe i need to use it more in these conditions.  \n\ni love focus peaking. i found myself doing more manual focus including using the tamron on the z 5. this is only possible with the evf.\n\n**battery life**: the en-el15c basically could shoot all day. driving back from some of our locations, i did have to pop in another battery while reviewing them. but oddly, the day the battery was drained the most, i only shot 152 stills and 13 video clips. but these were all long exposure waterfall shots. many of them were in the 1-2 second range with a 2 second shutter delay and the 2 second ones kicked in long exposure noise reduction. i would keep the evf or lcd awake while adjusting the neutral density filter, so i don't think it's a fair representation if you're just counting numbers of images. the next day i shot 438 images and one video clip and i had power to spare at the end of the day. i had a fair amount of review that day, for time lapse/astro work, i can see where usb power will be a helpful thing.\n\n**card speeds**: this is definetly not a camera related issue. i'm using a pair of 64gb uhs-i (95mb/s) cards in the z 5, since that's what i had already. i have a 440mmb/s xqd card in the d500. the transfer times from cards to my macbook pro is quite noticiably different. uhs-ii cards are more expensive, but i believe they are going to be worth the investment since they are 300mb/s. still not as fast as the xqd cards. since i'm considering the z 6ii, i'm wondering if i will be happy with my xqd cards or if i should get the 2-4 gb/s cfexspress cards, still get the uhs-ii cards for the sd slots.\n\n**fun stuff**: on my dslrs, i pretty much just shot stills. i have a pluto trigger which can do some fun things like it's laser trigger, but i've really not put it through it's paces. i had played with focus stacking before (doesn't work well handheld and breezy subjects), but i did my first time-lapse of moving clouds . i messed around with in camera hdr. and the whole video experience (flip a switch, press a button) was pretty good.\n\n**handling**: i love this camera. period. full stop. that means i will love the z 6ii even more.\n\n**af**: on my d750 and for the most part, the d500, i would put it on dynamic 25 and af-c and leave it there. you can certainly do that with the z 5, but i do find myself switching between af-c and af-s more frequently. i'm switching between single point, dynamic and auto af (where eye/face tracking lives) trying to find the best mode for the subject. i can't tell if  this is  a good thing or a bad thing. with the dslrs, af-c dynamic 25 was good enough. i don't know if i'm just finding better ways to af or if i'm just not trusting the af to default to a standard settings. i feel like there may be more af misses, but i can't rule out my error because i'm putzing with different settings. i get plenty of good photos, /shrug\n\n**mf**: as mentioned above, i love focus peaking. i was able to use the big tamron on the z 5 without af. there were a fair amount of my backlight otters that the red contrast highlights made me think the face was in focus, just to find out that i missed a little bit. zooming in may have helpted, but when you have the camera up to your face gettnig to the zoom +/- buttons and dealing with a heavy lens is a bit of a challenge. i think it's time to just pony up the money and get the nikon 200-500 and call it a day. side note: red focus peaking highlights on red flowers is useless. change colors to yellow or blue :-)\n\n**final thoughts**: this is a great camera. it's just not the right camera for me. i do want a functional vertical grip. i wan't the faster fps. based on the info in front of me, the z 6ii is the right camera for me. but if you don't need 12fps or don't want the option of the vertical grip (whcih will make the camera more bulky) the z 5 is an excellent choice. i think it would be a solid backup camera for a wedding photographer, heck even a pair of them would be a solid wedding combo.  \n\nit certainly has more than enough features that \"entry level\" is an insult to this camera. \n\nit's a full-frame, very well built and weather sealed camera that produces some excellent images. i would not hesitate to recommend this to anyone coming from the dxxxx family of bodies wanting to go mirrorless and jump to full-frame. i would think anyone coming from d6xx and d7xx bodies would also be quite happy with this if the 4.5fps frame rate isn't a problem and you don't need the vertical grip. it's not quite going to make the d4/d5/d6/d500 user happy. the z 9 may be that camera. d8xxx users will likely want a z 7ii.", "sortedWord": "None", "identifyer": 29173, "year": "2020"}, {"Unnamed: 0": 28642, "autor": "muzicoholicated", "date": 1594164045000, "content": "Help with lens repair 50mm 1.4D /!/ So, while trying to repair my 50mm 1.4D lens, I broke the ribbon cable that connects the internal electronics of the lens to the camera connector on the lens. When I say 'broke', I mean the length of the cable is intact, but the cable is in two pieces.\n\nI tried searching for the cable on the Internet but no luck till now. Can anybody let me know where I'll find this? Part number, website anything would help.\n\nWhile I do have a Nikon service center in my city, the only thing that they can do is ship it off for 14-21 days to a remote location; as they're just a collection center and they do not do any repairs.\n\nI'm okay with DIY as well in case someone wants to guide me in that direction.\n\nAny help would be appreciated. Thanks :)", "link": "https://www.reddit.com/r/Nikon/comments/hn5klr/help_with_lens_repair_50mm_14d/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help with lens repair 50mm 1.4d /!/ so, while trying to repair my 50mm 1.4d lens, i broke the ribbon cable that connects the internal electronics of the lens to the camera connector on the lens. when i say 'broke', i mean the length of the cable is intact, but the cable is in two pieces.\n\ni tried searching for the cable on the internet but no luck till now. can anybody let me know where i'll find this? part number, website anything would help.\n\nwhile i do have a nikon service center in my city, the only thing that they can do is ship it off for 14-21 days to a remote -----> location !!! ; as they're just a collection center and they do not do any repairs.\n\ni'm okay with diy as well in case someone wants to guide me in that direction.\n\nany help would be appreciated. thanks :)", "sortedWord": "None", "identifyer": 29197, "year": "2020"}, {"Unnamed: 0": 29205, "autor": "blitzkreag", "date": 1592524650000, "content": "Lens Tips for photographing in Yosemite /!/ Hi guys! First time posting here.\n\nI am going on a 4 day trip to Yosemite and Sequoia National Parks at the end of July and wanted to make sure I was properly prepared for the trip so I don't miss out on some amazing shots.\n\nI am looking for some advice on lens I should look into buying/renting or perhaps suggestions on a different camera (mirrorless?) I should invest in. I am pretty open either doubling down on my current setup, or starting fresh to invest in a new upgraded setup.\n\nI currently have a Nikon D3400 with the following lens: (all purchased about 3 years ago) as well as a tripod.\n\n1. Nikon AF-S Nikkor 35mm 1:1.8G DX\n2. Nikon AF-P Nikkor 18-55mm 1:3.5 - 5.6G DX VR\n3. Nikon AF-S Nikkor 55-200mm 1:4 -5.6G II ED DX VR\n\nFor background - I'm an amateur photographer (heavy emphasis on amateur) with most of my experience being walking around cities and hiking in upstate NY and snapping photos just for personal use and friends/family. I haven't shot in a location with such beauty and varying landscapes before.", "link": "https://www.reddit.com/r/Nikon/comments/hbpz6c/lens_tips_for_photographing_in_yosemite/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "lens tips for photographing in yosemite /!/ hi guys! first time posting here.\n\ni am going on a 4 day trip to yosemite and sequoia national parks at the end of july and wanted to make sure i was properly prepared for the trip so i don't miss out on some amazing shots.\n\ni am looking for some advice on lens i should look into buying/renting or perhaps suggestions on a different camera (mirrorless?) i should invest in. i am pretty open either doubling down on my current setup, or starting fresh to invest in a new upgraded setup.\n\ni currently have a nikon d3400 with the following lens: (all purchased about 3 years ago) as well as a tripod.\n\n1. nikon af-s nikkor 35mm 1:1.8g dx\n2. nikon af-p nikkor 18-55mm 1:3.5 - 5.6g dx vr\n3. nikon af-s nikkor 55-200mm 1:4 -5.6g ii ed dx vr\n\nfor background - i'm an amateur photographer (heavy emphasis on amateur) with most of my experience being walking around cities and hiking in upstate ny and snapping photos just for personal use and friends/family. i haven't shot in a -----> location !!!  with such beauty and varying landscapes before.", "sortedWord": "None", "identifyer": 29780, "year": "2020"}, {"Unnamed: 0": 29577, "autor": "breakfastsoup1", "date": 1606341985000, "content": "My next buying decision /!/ Hey guys I'm looking for s bit of advice I'm currently shooting with a cropped sensor. My main priority is investing in glass for now. I'm going to be purchasing a full frame camera next year. Fingers crossed.\n\nCurrently in my kit bag I have the standard 18-55mm kit lens, 35mm 1.8 &amp; 70-300mm ED VR.\n\nI'm going to be purchasing a new lens this month I'm a bit torn. Currently I'm shooting family portraits (on locations) trying to get my foot in the door.\n\nI don't feel too limited with the scope ive got however I think I would like something with a bit more range and a wider aperture so I'm considering the 85mm 1.8 or 50mm 1.8, would you guys recommend going for the 85mm even on a cropped sensor? And would the 50mm give me a noticeable difference over my 35mm thanks in advance.", "link": "https://www.reddit.com/r/Nikon/comments/k122lt/my_next_buying_decision/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "my next buying decision /!/ hey guys i'm looking for s bit of advice i'm currently shooting with a cropped sensor. my main priority is investing in glass for now. i'm going to be purchasing a full frame camera next year. fingers crossed.\n\ncurrently in my kit bag i have the standard 18-55mm kit lens, 35mm 1.8 &amp; 70-300mm ed vr.\n\ni'm going to be purchasing a new lens this month i'm a bit torn. currently i'm shooting family portraits (on -----> locations !!! ) trying to get my foot in the door.\n\ni don't feel too limited with the scope ive got however i think i would like something with a bit more range and a wider aperture so i'm considering the 85mm 1.8 or 50mm 1.8, would you guys recommend going for the 85mm even on a cropped sensor? and would the 50mm give me a noticeable difference over my 35mm thanks in advance.", "sortedWord": "None", "identifyer": 30174, "year": "2020"}, {"Unnamed: 0": 29614, "autor": "midiismysafeword", "date": 1601411534000, "content": "Nikon webcam utility Mojave /!/ Anyone able to get a picture with NWU on Mojave? All I get is the \"Nikon Webcam Utility\" image in whatever program I try to pipe it into.\n\nOn my catalina computer (MBP 10.15.6) it was completely plug and play. Mojave Mac Mini no incantations seem to work, including uninstalling and reinstalling the utility. Also cant seem to track down the process or actual location of the executable, despite looking in all the usual places, as I figured I might need to add it in security prefs.", "link": "https://www.reddit.com/r/Nikon/comments/j27kkk/nikon_webcam_utility_mojave/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "nikon webcam utility mojave /!/ anyone able to get a picture with nwu on mojave? all i get is the \"nikon webcam utility\" image in whatever program i try to pipe it into.\n\non my catalina computer (mbp 10.15.6) it was completely plug and play. mojave mac mini no incantations seem to work, including uninstalling and reinstalling the utility. also cant seem to track down the process or actual -----> location !!!  of the executable, despite looking in all the usual places, as i figured i might need to add it in security prefs.", "sortedWord": "None", "identifyer": 30214, "year": "2020"}, {"Unnamed: 0": 30549, "autor": "gunnar_d", "date": 1606921840000, "content": "Lense and tripod recommendation? /!/ My wife is an avid outdoor photographer, everything from mountains in winter to deserts and lightning. Also does family portraits. \nHas a D850. I know she needs a new lense (current is quite old). Any recommendations under $2500? Multiple lenses under that price? \nWhat about good tripod options (often hiking several miles to location)?\nNot sure what other info would be helpful. Appreciate any help!", "link": "https://www.reddit.com/r/Nikon/comments/k5ay0v/lense_and_tripod_recommendation/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "lense and tripod recommendation? /!/ my wife is an avid outdoor photographer, everything from mountains in winter to deserts and lightning. also does family portraits. \nhas a d850. i know she needs a new lense (current is quite old). any recommendations under $2500? multiple lenses under that price? \nwhat about good tripod options (often hiking several miles to -----> location !!! )?\nnot sure what other info would be helpful. appreciate any help!", "sortedWord": "None", "identifyer": 31182, "year": "2020"}, {"Unnamed: 0": 30797, "autor": "foamoirefresher", "date": 1579708026000, "content": "Hidden Beach Sunset - Nikon Z6 | Sigma 17-35 @17mm | ISO100 | F/7.1 | 30sec /!/ I found this hidden beach over the weekend in the island of Guernsey, where I live.\n\nIts a tiny 60,000 population island, with its longest side being only 7 miles long, its littered with cliffs and open beaches along a gorgeous coastline with about 20 miles of mostly walkable cliffs and paths, but there are a lot of secret and hard to get to coves and little known beaches.  I know a lot of these places as I have been photographing them for the past several years so its pretty awesome to find new locations and be greeting with such an incredible sunset.\n\nThe sun was just going down, and it was accessible through low tide only and having to climb down from the nearest paths I knew I would end up leaving in the dark, so I went prepared from the begining.  I waited for about an hour as the sun was setting, trying out new compositions along the way, with the tide just turning back up again as the sun was just under the horizon.\n\nThe water was just swelling around and this is one of my favourite images from the evening.  Being super low on a tripod and at 17mm the distortion of the wide lens makes the foreground stone even more emphasised and I like that look in my seascape images.\n\nEdited in Lightroom with basic adjustments, nothing too crazy.  It was shot on the 'flat' profile I find it gives the most dynamic range, the files are great coming out of this camera.  Other notes are I used the FTZ adapter and an ND filter.\n\nAny thoughts or comments welcome!", "link": "https://www.reddit.com/r/Nikon/comments/esdsxr/hidden_beach_sunset_nikon_z6_sigma_1735_17mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "hidden beach sunset - nikon z6 | sigma 17-35 @17mm | iso100 | f/7.1 | 30sec /!/ i found this hidden beach over the weekend in the island of guernsey, where i live.\n\nits a tiny 60,000 population island, with its longest side being only 7 miles long, its littered with cliffs and open beaches along a gorgeous coastline with about 20 miles of mostly walkable cliffs and paths, but there are a lot of secret and hard to get to coves and little known beaches.  i know a lot of these places as i have been photographing them for the past several years so its pretty awesome to find new -----> locations !!!  and be greeting with such an incredible sunset.\n\nthe sun was just going down, and it was accessible through low tide only and having to climb down from the nearest paths i knew i would end up leaving in the dark, so i went prepared from the begining.  i waited for about an hour as the sun was setting, trying out new compositions along the way, with the tide just turning back up again as the sun was just under the horizon.\n\nthe water was just swelling around and this is one of my favourite images from the evening.  being super low on a tripod and at 17mm the distortion of the wide lens makes the foreground stone even more emphasised and i like that look in my seascape images.\n\nedited in lightroom with basic adjustments, nothing too crazy.  it was shot on the 'flat' profile i find it gives the most dynamic range, the files are great coming out of this camera.  other notes are i used the ftz adapter and an nd filter.\n\nany thoughts or comments welcome!", "sortedWord": "None", "identifyer": 31440, "year": "2020"}, {"Unnamed: 0": 30841, "autor": "L1terallyUrDad", "date": 1606175925000, "content": "Comparing the Z 24-70 f/4 to the F mount AF-S 24-70 f/2.8G (non-VR lens) /!/ u/HERE4TAC0S asked me if I had a comparison of the two lenses. \n\nI'm not much of a lens comparison person. I don't have a good test facility with controlled lighting, uniform test targets, etc. That's not just my thing.\n\nBut I like to share information and I do have the two lenses, so I attempted to do a comparison. These were shot under some mixed lighting, the overhead light was a bank of old fluorescent kitchen fixture that the lights don't always come on full. I don't have flicker control on in the camera. Behind me is another light with a 100w effective LED bulb in an off-white glass fixture. \n\nThese were shot at ISO 3200, Aperture priority, daylight white balance. Both lenses were set to around 50mm (I think the F mount was at 52mm). I did make exposure and white balance corrections in Adobe Camera RAW. My lighting stinks. Sorry about not being able to be constant. I also was handholding this, so the composition varies a little. Forgive me for using my kitchen.\n\n&amp;#x200B;\n\n[@ f\\/8 F mount on the left, Z mount on the right](https://preview.redd.it/elv0armfr2161.jpg?width=12096&amp;format=pjpg&amp;auto=webp&amp;s=21909880da6f9099e2d3c89f61f0324bc09698aa)\n\n&amp;#x200B;\n\n[@ f\\/4 F mount on the left, Z mount on the right](https://preview.redd.it/2be8pd1lr2161.jpg?width=12096&amp;format=pjpg&amp;auto=webp&amp;s=9e324e6d2d1a62fb5320d2ec8495020c8b83942e)\n\n&amp;#x200B;\n\n[@ f\\/2.8 F mount only. For Depth of Field comparison](https://preview.redd.it/wx6dljgbs2161.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=2c329dc752120849e060627c81b5c02309678277)\n\nLet's start with AF performance. I really didn't think about it. This wasn't something I was thinking about testing. That said, the F mount f/2.8 lens seemed to focus a little faster. I'm not likely to use any of  these of fast moving subjects, so it may be insignificant, but maybe I'll go back later and try to get a better feel for this.\n\nNext let's look at Depth of Field. Clearly the lenses at the same f-stop should have the same depth of field. But many people worry about getting that extra f-stop for a more defocused background. This subject is kinda close, so it might have a little more impact at futher distances, but DOF changes with closer subjects should show more variance. Naturally the f/2.8 has a shallower DOF to the f/4 shot. Is it significantly more pleasing? I can't answer that. Each of us put a different value on that. You will need to judge for yourself, if it's worth the cost difference in the lens or adding a fast prime to your bag is worth it.\n\nThere is a size/weight difference. The f/2.8 lens is already longer and has a larger front element and it's heavier. You have to add the FTZ length and weight to the equation. This impacts camera balance. When you factor this in vs. the depth of field gain, it can help you make that decision. For someone who wants to hike to remote locations, take the camera with you more often, etc. the Z lens would be the lens of choice. If you want that shallow depth of field, you're either going to accept the larger, heavier setup with the F mount lens or carry two lenses which ends up offsetting or being more weight to pack to get a 50 f/1.8 or f/1.4.\n\nFinally, to the main event... Sharpness. I'm not that photographer that's going to pixel peep this. As long as there isn't gross pin-cushion or barrel distortion or obvious CA, it's probably not going to be something I'm going to really worry about too much.\n\nObviouslly  I couldn't do a comparison a f/2.8, but I  don't see much of a difference either in the center or the edge between the lens at either f/4 or f/8. But be your own judge.", "link": "https://www.reddit.com/r/Nikon/comments/jztrdf/comparing_the_z_2470_f4_to_the_f_mount_afs_2470/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "comparing the z 24-70 f/4 to the f mount af-s 24-70 f/2.8g (non-vr lens) /!/ u/here4tac0s asked me if i had a comparison of the two lenses. \n\ni'm not much of a lens comparison person. i don't have a good test facility with controlled lighting, uniform test targets, etc. that's not just my thing.\n\nbut i like to share information and i do have the two lenses, so i attempted to do a comparison. these were shot under some mixed lighting, the overhead light was a bank of old fluorescent kitchen fixture that the lights don't always come on full. i don't have flicker control on in the camera. behind me is another light with a 100w effective led bulb in an off-white glass fixture. \n\nthese were shot at iso 3200, aperture priority, daylight white balance. both lenses were set to around 50mm (i think the f mount was at 52mm). i did make exposure and white balance corrections in adobe camera raw. my lighting stinks. sorry about not being able to be constant. i also was handholding this, so the composition varies a little. forgive me for using my kitchen.\n\n&amp;#x200b;\n\n[@ f\\/8 f mount on the left, z mount on the right](https://preview.redd.it/elv0armfr2161.jpg?width=12096&amp;format=pjpg&amp;auto=webp&amp;s=21909880da6f9099e2d3c89f61f0324bc09698aa)\n\n&amp;#x200b;\n\n[@ f\\/4 f mount on the left, z mount on the right](https://preview.redd.it/2be8pd1lr2161.jpg?width=12096&amp;format=pjpg&amp;auto=webp&amp;s=9e324e6d2d1a62fb5320d2ec8495020c8b83942e)\n\n&amp;#x200b;\n\n[@ f\\/2.8 f mount only. for depth of field comparison](https://preview.redd.it/wx6dljgbs2161.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=2c329dc752120849e060627c81b5c02309678277)\n\nlet's start with af performance. i really didn't think about it. this wasn't something i was thinking about testing. that said, the f mount f/2.8 lens seemed to focus a little faster. i'm not likely to use any of  these of fast moving subjects, so it may be insignificant, but maybe i'll go back later and try to get a better feel for this.\n\nnext let's look at depth of field. clearly the lenses at the same f-stop should have the same depth of field. but many people worry about getting that extra f-stop for a more defocused background. this subject is kinda close, so it might have a little more impact at futher distances, but dof changes with closer subjects should show more variance. naturally the f/2.8 has a shallower dof to the f/4 shot. is it significantly more pleasing? i can't answer that. each of us put a different value on that. you will need to judge for yourself, if it's worth the cost difference in the lens or adding a fast prime to your bag is worth it.\n\nthere is a size/weight difference. the f/2.8 lens is already longer and has a larger front element and it's heavier. you have to add the ftz length and weight to the equation. this impacts camera balance. when you factor this in vs. the depth of field gain, it can help you make that decision. for someone who wants to hike to remote -----> locations !!! , take the camera with you more often, etc. the z lens would be the lens of choice. if you want that shallow depth of field, you're either going to accept the larger, heavier setup with the f mount lens or carry two lenses which ends up offsetting or being more weight to pack to get a 50 f/1.8 or f/1.4.\n\nfinally, to the main event... sharpness. i'm not that photographer that's going to pixel peep this. as long as there isn't gross pin-cushion or barrel distortion or obvious ca, it's probably not going to be something i'm going to really worry about too much.\n\nobviouslly  i couldn't do a comparison a f/2.8, but i  don't see much of a difference either in the center or the edge between the lens at either f/4 or f/8. but be your own judge.", "sortedWord": "None", "identifyer": 31485, "year": "2020"}, {"Unnamed: 0": 31417, "autor": "ColdSpirit", "date": 1605106858000, "content": "Porto and Gaia, Portugal. From Douro River /!/ Photo taken with Nikon D750 + Nikon ED AF Nikkor 80-200mm f/2.8 D  \nLocation: Douro River (Porto and Gaia, Portugal)", "link": "https://www.reddit.com/r/Nikon/comments/js9m9n/porto_and_gaia_portugal_from_douro_river/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "porto and gaia, portugal. from douro river /!/ photo taken with nikon d750 + nikon ed af nikkor 80-200mm f/2.8 d  \n-----> location !!! : douro river (porto and gaia, portugal)", "sortedWord": "None", "identifyer": 32081, "year": "2020"}], "name": "locationnikon2020"}