{"interestingcomments": [{"Unnamed: 0": 154866, "autor": "dannybatista", "date": 1625162917000, "content": "Nikon z7ii, the 24-70 2.8S as always, and a fast-paced shoot concept at a Peerspace location in New York last month. Shot with a Nanlite fs300 and an Aputure fresnel lens attachment (Photos are censored)", "link": "https://www.reddit.com/r/Nikon/comments/obrka3/nikon_z7ii_the_2470_28s_as_always_and_a_fastpaced/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "nikon z7ii, the 24-70 2.8s as always, and a fast-paced shoot concept at a peerspace -----> location !!!  in new york last month. shot with a nanlite fs300 and an aputure fresnel lens attachment (photos are censored)", "sortedWord": "None", "identifyer": 46329, "year": "2021"}, {"Unnamed: 0": 154947, "autor": "Casito94", "date": 1624982684000, "content": "Enjoy your life /!/ Body :D7200\n\nLens :35mm f1.8\n\nF stops: 4.5 \n\nShutter speed: 1/60 sec \n\nIso: 2000\n\nLocation: Sibiu, Romania (2021)", "link": "https://www.reddit.com/r/Nikon/comments/oabb45/enjoy_your_life/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "enjoy your life /!/ body :d7200\n\nlens :35mm f1.8\n\nf stops: 4.5 \n\nshutter speed: 1/60 sec \n\niso: 2000\n\n-----> location !!! : sibiu, romania (2021)", "sortedWord": "None", "identifyer": 46412, "year": "2021"}, {"Unnamed: 0": 155058, "autor": "mad_r_yeah", "date": 1630437936000, "content": "Barn Owl Nikon D7200 Nikkor 200-500 f/5.6 ED VR Exif: f/7.1 , 1/640, 500mm, ISO 1250 Location: Kidderpore , Kolkata, West Bengal, India. Date: 31/08/2021", "link": "https://www.reddit.com/r/Nikon/comments/pfcwkf/barn_owl_nikon_d7200_nikkor_200500_f56_ed_vr_exif/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "barn owl nikon d7200 nikkor 200-500 f/5.6 ed vr exif: f/7.1 , 1/640, 500mm, iso 1250 -----> location !!! : kidderpore , kolkata, west bengal, india. date: 31/08/2021", "sortedWord": "None", "identifyer": 46524, "year": "2021"}, {"Unnamed: 0": 155087, "autor": "_spectron_", "date": 1630362155000, "content": "Problem with Snabridge location accuracy /!/ Hello everyone!\n\nI've only recently started to use Snabridge in order to geotag my photos (I use a D3400, so no in-camera GPS).\n\nThe problem is, the GPS location is not very accurate. I've had photos geotagged kilometers away from the right location, but most of the times it is only 100-200 meters away.\n\nThis wouldn't be a problem if I didn't mostly photograph wildlife and upload the photos to a database that requires accurate locations (the more the better).\n\nHas anyone came across this problem? Any solutions?", "link": "https://www.reddit.com/r/Nikon/comments/peso4n/problem_with_snabridge_location_accuracy/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "problem with snabridge -----> location !!!  accuracy /!/ hello everyone!\n\ni've only recently started to use snabridge in order to geotag my photos (i use a d3400, so no in-camera gps).\n\nthe problem is, the gps location is not very accurate. i've had photos geotagged kilometers away from the right location, but most of the times it is only 100-200 meters away.\n\nthis wouldn't be a problem if i didn't mostly photograph wildlife and upload the photos to a database that requires accurate locations (the more the better).\n\nhas anyone came across this problem? any solutions?", "sortedWord": "None", "identifyer": 46553, "year": "2021"}, {"Unnamed: 0": 155172, "autor": "Johnlsl", "date": 1633027034000, "content": "NX Studio - Found that NX Studio Will Freeze when trying to open a folder /!/ For any Nikon user that uses NX Studio  \nOn NX studio, After I Moved A Large number of folder locations around from NX studio browser   \nFound that when I attempted to open some folder the program will freeze  \n\n\nRenaming the affected folder will cause the program to freeze when you open the program when this happens  \n\n\nwhen I am troubleshooting the problem,   \n(As Reinisall and Rename did not fix the problem, leaving the effect folder empty and try to open it will also crash the program)\n\nIn the end, notest the Problem is Cause by a database corruption in the   \n **\"C:\\\\Users\\\\&lt;User Name&gt;\\\\AppData\\\\Local\\\\Nikon\\\\NX Studio\\\\DB\\\\\"**\n\n **\"C:\\\\Users\\\\&lt;User Name&gt;\\\\AppData\\\\Local\\\\Nikon\\\\NX Studio\\\\DB\\\\FileData.db\"**   \n **\"C:\\\\Users\\\\&lt;User Name&gt;\\\\AppData\\\\Local\\\\Nikon\\\\NX Studio\\\\DB\\\\SNSData.db\"**   \n\n\nJust in case anyone Run into this problem  \nTry to rename the **NX Studio AppData** to something else and the NX Studio will rebuild the DataBase  \n\n\nfor Example\n\n**\"C:\\\\Users\\\\&lt;User Name&gt;\\\\AppData\\\\Local\\\\Nikon\\\\NX Studio\\\\\"**  \n**\"C:\\\\Users\\\\&lt;User Name&gt;\\\\AppData\\\\Local\\\\Nikon\\\\NX Studio\\_old\\\\\"**\n\nI have submitted a support ticket with Nikon and wish Nikon will fix this bug  \n(Why the hell the browser function part will need a Bulky Database....................)", "link": "https://www.reddit.com/r/Nikon/comments/pypz17/nx_studio_found_that_nx_studio_will_freeze_when/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "nx studio - found that nx studio will freeze when trying to open a folder /!/ for any nikon user that uses nx studio  \non nx studio, after i moved a large number of folder -----> locations !!!  around from nx studio browser   \nfound that when i attempted to open some folder the program will freeze  \n\n\nrenaming the affected folder will cause the program to freeze when you open the program when this happens  \n\n\nwhen i am troubleshooting the problem,   \n(as reinisall and rename did not fix the problem, leaving the effect folder empty and try to open it will also crash the program)\n\nin the end, notest the problem is cause by a database corruption in the   \n **\"c:\\\\users\\\\&lt;user name&gt;\\\\appdata\\\\local\\\\nikon\\\\nx studio\\\\db\\\\\"**\n\n **\"c:\\\\users\\\\&lt;user name&gt;\\\\appdata\\\\local\\\\nikon\\\\nx studio\\\\db\\\\filedata.db\"**   \n **\"c:\\\\users\\\\&lt;user name&gt;\\\\appdata\\\\local\\\\nikon\\\\nx studio\\\\db\\\\snsdata.db\"**   \n\n\njust in case anyone run into this problem  \ntry to rename the **nx studio appdata** to something else and the nx studio will rebuild the database  \n\n\nfor example\n\n**\"c:\\\\users\\\\&lt;user name&gt;\\\\appdata\\\\local\\\\nikon\\\\nx studio\\\\\"**  \n**\"c:\\\\users\\\\&lt;user name&gt;\\\\appdata\\\\local\\\\nikon\\\\nx studio\\_old\\\\\"**\n\ni have submitted a support ticket with nikon and wish nikon will fix this bug  \n(why the hell the browser function part will need a bulky database....................)", "sortedWord": "None", "identifyer": 46642, "year": "2021"}, {"Unnamed: 0": 155246, "autor": "cloves_moke", "date": 1635714703000, "content": "New 24-70 or 24-105 lens /!/ Working with a D800 at work and am in need of upgrading a very very old 24-70mm lens. I’m currently looking at the Sigma 24-70 f/2.8, or the Sigma 24-105 f/4 and not quite sure which one to get. \n\nI already have a sigma 105 prime lens, which I typically have been using on model shoots as it was 1000x nicer than the old 24-70mm, so I guess I don’t NEED the new lens to zoom that far. 99% of the new lens would be for shooting product in studio, but would also be used in outdoor locations if needed. \n\nI did notice that there’s a note on the 24-70 that firmware will need to be updated before it can be used (and I have no clue if the previous photographer ever updated firmware to begin with) \n\nWise ones - is there one that you would pick over the other? Or is there a different lens in the 24-70mm realm that I’m missing that would be better than the sigma?", "link": "https://www.reddit.com/r/Nikon/comments/qjyuw9/new_2470_or_24105_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "new 24-70 or 24-105 lens /!/ working with a d800 at work and am in need of upgrading a very very old 24-70mm lens. i’m currently looking at the sigma 24-70 f/2.8, or the sigma 24-105 f/4 and not quite sure which one to get. \n\ni already have a sigma 105 prime lens, which i typically have been using on model shoots as it was 1000x nicer than the old 24-70mm, so i guess i don’t need the new lens to zoom that far. 99% of the new lens would be for shooting product in studio, but would also be used in outdoor -----> locations !!!  if needed. \n\ni did notice that there’s a note on the 24-70 that firmware will need to be updated before it can be used (and i have no clue if the previous photographer ever updated firmware to begin with) \n\nwise ones - is there one that you would pick over the other? or is there a different lens in the 24-70mm realm that i’m missing that would be better than the sigma?", "sortedWord": "None", "identifyer": 46719, "year": "2021"}, {"Unnamed: 0": 155575, "autor": "BlakPhoenix", "date": 1614220684000, "content": "New Nikon Z6 II firmware released with 4k 50p/60p video /!/ The latest firmware for the Nikon Z6 II has been released with many new exciting features.  here's the full change log:\n\n&amp;#x200B;\n\n* Added **3840x2160; 60p** and **3840x2160; 50p** to the options available for **Frame size/frame rate** in the **MOVIE SHOOTING MENU**. More information is available in the portions of the “Reference Manual (complete instructions)” devoted to this feature.  \n   * &lt; CFexpress/XQD Memory Cards &gt;\n   * A card with a maximum data transfer rate of 250 MB/s or faster is  recommended for recording and playback of movies at a frame size of 3840  x 2160 (4K UHD) 60/50p.\n   * &amp;#x200B;\n   * &lt; SD Memory Cards &gt;\n   * A UHS Speed Class 3 or better card with a maximum data transfer rate  of 250 MB/s or faster is recommended for recording and playback of  movies at a frame size of 3840 x 2160 (4K UHD) 60/50p.\n* Improved eye-detection performance in **Auto-area AF (people)** and **Wide-area AF (L-people)** AF-area modes.\n* Support for RAW video output is available via a fee-for-service  upgrade, \\* and firmware version 1.10 adds support under this service for  Blackmagic Design external video recorders (currently the Video Assist  5” 12G HDR and Video Assist 7” 12G HDR). If you have already purchased  the RAW video output upgrade for your camera, updating to firmware  version 1.10 will add support for Blackmagic Design external video  recorders automatically. Note, however, that RAW video output is not  available at a resolution of 4K UHD 60p/50p.\n* Users of Apple’s Final Cut Pro X (version 10.4.9 or later) can now  display and adjust ISO sensitivity and color temperature for ProRes RAW  footage output to ATOMOS NINJA V external recorders using the  fee-for-service RAW video output upgrade. \\*  \n   * &lt; Choosing a RAW Output Type &gt;\n   * Before filming RAW video, choose an option for **HDMI** \\&gt; **Advanced** \\&gt; **RAW output options** \\&gt; **RAW output type** in the **SETUP MENU** based on the type of recorder connected: select **Type A** for NINJA V recorders and **Type B** for Video Assist recorders.\n* Fixed an issue that sometimes prevented  the camera downloading location data via SnapBridge when used with an  MB-N11 power battery pack.\n\n\\* The RAW video output upgrade is available  on a fee-for-service basis. For more information, contact a  Nikon-authorized service representative.\n\nFirmware can be found here: [https://downloadcenter.nikonimglib.com/en/download/fw/394.html](https://downloadcenter.nikonimglib.com/en/download/fw/394.html)", "link": "https://www.reddit.com/r/Nikon/comments/lrvndf/new_nikon_z6_ii_firmware_released_with_4k_50p60p/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new nikon z6 ii firmware released with 4k 50p/60p video /!/ the latest firmware for the nikon z6 ii has been released with many new exciting features.  here's the full change log:\n\n&amp;#x200b;\n\n* added **3840x2160; 60p** and **3840x2160; 50p** to the options available for **frame size/frame rate** in the **movie shooting menu**. more information is available in the portions of the “reference manual (complete instructions)” devoted to this feature.  \n   * &lt; cfexpress/xqd memory cards &gt;\n   * a card with a maximum data transfer rate of 250 mb/s or faster is  recommended for recording and playback of movies at a frame size of 3840  x 2160 (4k uhd) 60/50p.\n   * &amp;#x200b;\n   * &lt; sd memory cards &gt;\n   * a uhs speed class 3 or better card with a maximum data transfer rate  of 250 mb/s or faster is recommended for recording and playback of  movies at a frame size of 3840 x 2160 (4k uhd) 60/50p.\n* improved eye-detection performance in **auto-area af (people)** and **wide-area af (l-people)** af-area modes.\n* support for raw video output is available via a fee-for-service  upgrade, \\* and firmware version 1.10 adds support under this service for  blackmagic design external video recorders (currently the video assist  5” 12g hdr and video assist 7” 12g hdr). if you have already purchased  the raw video output upgrade for your camera, updating to firmware  version 1.10 will add support for blackmagic design external video  recorders automatically. note, however, that raw video output is not  available at a resolution of 4k uhd 60p/50p.\n* users of apple’s final cut pro x (version 10.4.9 or later) can now  display and adjust iso sensitivity and color temperature for prores raw  footage output to atomos ninja v external recorders using the  fee-for-service raw video output upgrade. \\*  \n   * &lt; choosing a raw output type &gt;\n   * before filming raw video, choose an option for **hdmi** \\&gt; **advanced** \\&gt; **raw output options** \\&gt; **raw output type** in the **setup menu** based on the type of recorder connected: select **type a** for ninja v recorders and **type b** for video assist recorders.\n* fixed an issue that sometimes prevented  the camera downloading -----> location !!!  data via snapbridge when used with an  mb-n11 power battery pack.\n\n\\* the raw video output upgrade is available  on a fee-for-service basis. for more information, contact a  nikon-authorized service representative.\n\nfirmware can be found here: [https://downloadcenter.nikonimglib.com/en/download/fw/394.html](https://downloadcenter.nikonimglib.com/en/download/fw/394.html)", "sortedWord": "None", "identifyer": 47062, "year": "2021"}, {"Unnamed: 0": 157145, "autor": "its_atmarg", "date": 1635343568000, "content": "Seagull at Seven Sisters Cliffs (South England, UK) | Nikon Z6 with Nikkor 24-70 f/4 S /!/ Beginner here, have had my Nikon Z6 for about a month. I was trying to take a photo of seagulls near the edge of the cliff at the Seven Sisters (beautiful hike in South England I did last weekend, happy to provide tips on the location if you guys are interested), this guy was flying around again and again and gave me multiple chances for a good shot.\n\nI did this using AF-C and the dynamic area - any thoughts on this? Is this the preferred, or the auto-area would be better? The focus seems good to me, but obviously I'm no expert. Settings are given in the caption: f/4, 1/1250 sec, ISO 100, 70mm. Quick editing in a minute or so using RawTherapee - any advice there is also welcome. I also wasn't sure about the framing - it looks \"cleaner\" if I crop out the ground, but I think keeping the cliff in there makes it a little more dramatic.\n\nAnyway, birds are proving to be excellent subjects to learn the ropes of the camera. Cheers!\n\n[Seagull near the edge of the cliff, taken at 70mm with ISO 100, f\\/4.0, and 1\\/1250 sec.](https://preview.redd.it/r36h19q110w71.jpg?width=2921&amp;format=pjpg&amp;auto=webp&amp;s=a4a343e13cde1ab38188e4c1d307685395c6897e)", "link": "https://www.reddit.com/r/Nikon/comments/qgxgqo/seagull_at_seven_sisters_cliffs_south_england_uk/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "seagull at seven sisters cliffs (south england, uk) | nikon z6 with nikkor 24-70 f/4 s /!/ beginner here, have had my nikon z6 for about a month. i was trying to take a photo of seagulls near the edge of the cliff at the seven sisters (beautiful hike in south england i did last weekend, happy to provide tips on the -----> location !!!  if you guys are interested), this guy was flying around again and again and gave me multiple chances for a good shot.\n\ni did this using af-c and the dynamic area - any thoughts on this? is this the preferred, or the auto-area would be better? the focus seems good to me, but obviously i'm no expert. settings are given in the caption: f/4, 1/1250 sec, iso 100, 70mm. quick editing in a minute or so using rawtherapee - any advice there is also welcome. i also wasn't sure about the framing - it looks \"cleaner\" if i crop out the ground, but i think keeping the cliff in there makes it a little more dramatic.\n\nanyway, birds are proving to be excellent subjects to learn the ropes of the camera. cheers!\n\n[seagull near the edge of the cliff, taken at 70mm with iso 100, f\\/4.0, and 1\\/1250 sec.](https://preview.redd.it/r36h19q110w71.jpg?width=2921&amp;format=pjpg&amp;auto=webp&amp;s=a4a343e13cde1ab38188e4c1d307685395c6897e)", "sortedWord": "None", "identifyer": 48686, "year": "2021"}, {"Unnamed: 0": 157376, "autor": "dipdaabyss", "date": 1612420870000, "content": "Shot on D3300 with Nikkor 18-55mm. Location: India-China border, Sikkim, India.", "link": "https://www.reddit.com/r/Nikon/comments/lc9p5l/shot_on_d3300_with_nikkor_1855mm_location/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shot on d3300 with nikkor 18-55mm. -----> location !!! : india-china border, sikkim, india.", "sortedWord": "None", "identifyer": 48930, "year": "2021"}, {"Unnamed: 0": 158019, "autor": "woodstockbird9", "date": 1609812817000, "content": "I took this night \"portrait\" shot handheld and I didn't have access to a tripod at the time. The location is reckong peo, kalpa valley, himachal pradesh. Iso 4000, shutter speed 1/2sec and aperture 3.5", "link": "https://www.reddit.com/r/Nikon/comments/kqo3j5/i_took_this_night_portrait_shot_handheld_and_i/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i took this night \"portrait\" shot handheld and i didn't have access to a tripod at the time. the -----> location !!!  is reckong peo, kalpa valley, himachal pradesh. iso 4000, shutter speed 1/2sec and aperture 3.5", "sortedWord": "None", "identifyer": 49604, "year": "2021"}, {"Unnamed: 0": 158646, "autor": "Royalepad", "date": 1627418104000, "content": "I took some photos in the mountains! Nikon d780 tamron 35-150 and 14mm samyang. Also that woman in the photo just happened to walk in my shot so i got lucky, edited in lightroom mobile at location.", "link": "https://www.reddit.com/r/Nikon/comments/osunh0/i_took_some_photos_in_the_mountains_nikon_d780/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i took some photos in the mountains! nikon d780 tamron 35-150 and 14mm samyang. also that woman in the photo just happened to walk in my shot so i got lucky, edited in lightroom mobile at -----> location !!! .", "sortedWord": "None", "identifyer": 50260, "year": "2021"}, {"Unnamed: 0": 159012, "autor": "LittleByBlue", "date": 1624641023000, "content": "Help: Pictures automatically downloaded with snapbridge don't have location data embedded /!/ My pictures are automatically geotagged using Snapbridge. I have the app in high precision- and background mode. This works nicely. I can check the pictures on the camera and the geotags are correct.\n\nI also let the camera download the 2Mpx pictures automatically so I can use them using some other apps. In the past the pictures were all geotagged also. I could see the location in the gallery. \n\nSince a couple of days (since June 11 precisely) the downloaded pictures have no geotags anymore. The geo information doesn't show up in the gallery nor in other apps.\n\nIs this something you also experienced? Is that a feature or a bug? Do you know how to get the geotags on the downloaded pictures?", "link": "https://www.reddit.com/r/Nikon/comments/o7rzru/help_pictures_automatically_downloaded_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help: pictures automatically downloaded with snapbridge don't have -----> location !!!  data embedded /!/ my pictures are automatically geotagged using snapbridge. i have the app in high precision- and background mode. this works nicely. i can check the pictures on the camera and the geotags are correct.\n\ni also let the camera download the 2mpx pictures automatically so i can use them using some other apps. in the past the pictures were all geotagged also. i could see the location in the gallery. \n\nsince a couple of days (since june 11 precisely) the downloaded pictures have no geotags anymore. the geo information doesn't show up in the gallery nor in other apps.\n\nis this something you also experienced? is that a feature or a bug? do you know how to get the geotags on the downloaded pictures?", "sortedWord": "None", "identifyer": 50644, "year": "2021"}, {"Unnamed: 0": 159161, "autor": "L1terallyUrDad", "date": 1617564152000, "content": "Yesterday, I felt my Z 6II let me down... /!/ TL;DR: It's me more than the gear! It's almost always the photographer, not the gear.\n\nI went out to our big lake yesterday, well more specifically, the river below the dam eagle hunting. Eagles can be found there frequently, but they are still a hard find other than getting one in a remote tree. My last trip out a few weeks ago was \"Great Blue Heron Day\", with over 30 chilling on the far bank and usually a couple in the air fishing. The Osprey traffic has been increasing as well based on other photographers who frequent the location. The spot is popular. There were 7-8 other photographers there yesterday.\n\nIt was Osprey day. There were at times four buzzing around the spillway, occasionally making the Osprey dive and always coming up with a fish. It's amazing how they can precisely nail a fish in very muddy water from a few hundred feet up in the air.\n\n&amp;#x200B;\n\n[Osprey after grabbing a fish. 1\\/800 f\\/8 200-500+TC14e 700mm considerable crop ISO 250](https://preview.redd.it/ubt5mkafd7r61.jpg?width=2038&amp;format=pjpg&amp;auto=webp&amp;s=b3ad7963768c68c491afb5328fabca882e9b6c28)\n\nI decided the only gear I would pack for the day would be my Z  6II, my Nikon 200-500mm f/5.6, and my Nikon TC14E III (1.4x TC).\n\nI usually do a pretty good job capturing birds in flight with this equipment. Wide area AF works pretty well. The lens focuses fast enough (could be better). The TC-14E doesn't seem to slow things down much.\n\nIn 677 photos, I pitched 122 of them for being obviously out of focus, most of the bird out of the frame, accidents, birds flying behind trees... you know the junk. I would guess 100 of them were clearly out of focus. That's about an 85% hit rate, which I guess isn't that bad.\n\n&amp;#x200B;\n\n[Osprey in flight. The eyes are a bit soft. f\\/5.6 1\\/1250 ISO 200 500mm](https://preview.redd.it/zlxm02r5h7r61.jpg?width=3256&amp;format=pjpg&amp;auto=webp&amp;s=21dab9b02dc4b91929e8af78c5439d69d5b11655)\n\nOnce I got them in Adobe Bridge and looked at them at 100%, a far larger number were soft. Perhaps some were the TC. Many of them show the red focus blocks not on the bird. And this is where my frustration started. The camera really seemed to want to lock on to background elements, rocks, trees, etc. Of course, a small bird against contrasty trees and rocks is going to frustrate any AF system. My lasts trip was a foggy, gray, overcast day. Yesterday was bright and sunny and lots of contrast. I tried different combinations of focus modes. I tried focus tracking, but trying to handhold that beast of a lens and activate focus tracking while the bird is a real challenge.\n\n&amp;#x200B;\n\n[Juvenile Red-tail Hawk - 1\\/800 f\\/5.6 ISO 200 @ 500mm](https://preview.redd.it/enkucl07e7r61.jpg?width=1927&amp;format=pjpg&amp;auto=webp&amp;s=fc4ec58b7f601cd1f8ee350e01b070b10d46e427)\n\nTo make matters worse, many of the birds were pretty much above me. Trying to shoot that combination with the lens pointing straight up really stressed out my left arm. Many of my \"out of frame\" shots were with the bird more overhead.\n\nI had a significant amount of motion blur too. Even with VR in the lens, IBIS in the body and Auto ISO on giving me a handholdable shutter speed, they were just bad.\n\nWith the lighting, it was a challenge to see the LCD on the back. I ended up making most of my adjustments from the EVF. \n\n&amp;#x200B;\n\n[Great Blue Heron in flight, f\\/8 1\\/800 ISO 220, 700mm](https://preview.redd.it/0n7csdpqg7r61.jpg?width=2553&amp;format=pjpg&amp;auto=webp&amp;s=57e26a0a2ca673c887b3abb268d6c563f4af91df)\n\nIt was disappointing.\n\nWhere the gear failed me: \n\n* Weight\n* AF Speed\n\nBut in retrospect, most of the problem is was behind the camera. \n\nWhere I failed me:\n\n* Depending on auto ISO. Had I just set the ISO up to something reasonable like ISO 800 which the camera can easily do, I would have had higher shutter speeds. Auto ISO doesn't want to give me much more than one stop more than 1/focal length.\n* Trying to shoot things over my head where I don't have the upper body strenght to do so. You have to bend over backwards which creates an unbalanced platform.\n* Not enough expereience trying to pan with that lens. Maybe if I had a gimble head and a steady tripod I might be better, or use a monopod. The monopod doesn't provide any vertical flexibility though and the gimble head only gives you some vertical access without you having to squat.\n* I can't move the camera well enough to make subject tracking work.\n* Panning while trying to fill the frame is a challenge.\n\nI wonder if the 500mm f/5.6 PF lens, being almost 2 pounds lighter and I suspect faster AF would make my life better? It's only 3 ounces heavier than the 70-200 f/2.8... Maybe I should get this instead of replacing my 70-200 f/2.8 F mount. I shoot a lot of stuff at 500mm.\n\nOn a good note, the 677 photos consumed two pips of battery. Since the last charge, I've shot 780 photos and have 37% left. That works out to about 1200 shots on a charge.\n\nDo I hate my Z 6II? Absolutly not. I love the camera. Do I hate the 200-500 f/5.6. It's sharp and produces some really good images, but it's a beast. For a $1200 lens in the super telephoto range, you can't ask for everything.", "link": "https://www.reddit.com/r/Nikon/comments/mk2w20/yesterday_i_felt_my_z_6ii_let_me_down/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "yesterday, i felt my z 6ii let me down... /!/ tl;dr: it's me more than the gear! it's almost always the photographer, not the gear.\n\ni went out to our big lake yesterday, well more specifically, the river below the dam eagle hunting. eagles can be found there frequently, but they are still a hard find other than getting one in a remote tree. my last trip out a few weeks ago was \"great blue heron day\", with over 30 chilling on the far bank and usually a couple in the air fishing. the osprey traffic has been increasing as well based on other photographers who frequent the -----> location !!! . the spot is popular. there were 7-8 other photographers there yesterday.\n\nit was osprey day. there were at times four buzzing around the spillway, occasionally making the osprey dive and always coming up with a fish. it's amazing how they can precisely nail a fish in very muddy water from a few hundred feet up in the air.\n\n&amp;#x200b;\n\n[osprey after grabbing a fish. 1\\/800 f\\/8 200-500+tc14e 700mm considerable crop iso 250](https://preview.redd.it/ubt5mkafd7r61.jpg?width=2038&amp;format=pjpg&amp;auto=webp&amp;s=b3ad7963768c68c491afb5328fabca882e9b6c28)\n\ni decided the only gear i would pack for the day would be my z  6ii, my nikon 200-500mm f/5.6, and my nikon tc14e iii (1.4x tc).\n\ni usually do a pretty good job capturing birds in flight with this equipment. wide area af works pretty well. the lens focuses fast enough (could be better). the tc-14e doesn't seem to slow things down much.\n\nin 677 photos, i pitched 122 of them for being obviously out of focus, most of the bird out of the frame, accidents, birds flying behind trees... you know the junk. i would guess 100 of them were clearly out of focus. that's about an 85% hit rate, which i guess isn't that bad.\n\n&amp;#x200b;\n\n[osprey in flight. the eyes are a bit soft. f\\/5.6 1\\/1250 iso 200 500mm](https://preview.redd.it/zlxm02r5h7r61.jpg?width=3256&amp;format=pjpg&amp;auto=webp&amp;s=21dab9b02dc4b91929e8af78c5439d69d5b11655)\n\nonce i got them in adobe bridge and looked at them at 100%, a far larger number were soft. perhaps some were the tc. many of them show the red focus blocks not on the bird. and this is where my frustration started. the camera really seemed to want to lock on to background elements, rocks, trees, etc. of course, a small bird against contrasty trees and rocks is going to frustrate any af system. my lasts trip was a foggy, gray, overcast day. yesterday was bright and sunny and lots of contrast. i tried different combinations of focus modes. i tried focus tracking, but trying to handhold that beast of a lens and activate focus tracking while the bird is a real challenge.\n\n&amp;#x200b;\n\n[juvenile red-tail hawk - 1\\/800 f\\/5.6 iso 200 @ 500mm](https://preview.redd.it/enkucl07e7r61.jpg?width=1927&amp;format=pjpg&amp;auto=webp&amp;s=fc4ec58b7f601cd1f8ee350e01b070b10d46e427)\n\nto make matters worse, many of the birds were pretty much above me. trying to shoot that combination with the lens pointing straight up really stressed out my left arm. many of my \"out of frame\" shots were with the bird more overhead.\n\ni had a significant amount of motion blur too. even with vr in the lens, ibis in the body and auto iso on giving me a handholdable shutter speed, they were just bad.\n\nwith the lighting, it was a challenge to see the lcd on the back. i ended up making most of my adjustments from the evf. \n\n&amp;#x200b;\n\n[great blue heron in flight, f\\/8 1\\/800 iso 220, 700mm](https://preview.redd.it/0n7csdpqg7r61.jpg?width=2553&amp;format=pjpg&amp;auto=webp&amp;s=57e26a0a2ca673c887b3abb268d6c563f4af91df)\n\nit was disappointing.\n\nwhere the gear failed me: \n\n* weight\n* af speed\n\nbut in retrospect, most of the problem is was behind the camera. \n\nwhere i failed me:\n\n* depending on auto iso. had i just set the iso up to something reasonable like iso 800 which the camera can easily do, i would have had higher shutter speeds. auto iso doesn't want to give me much more than one stop more than 1/focal length.\n* trying to shoot things over my head where i don't have the upper body strenght to do so. you have to bend over backwards which creates an unbalanced platform.\n* not enough expereience trying to pan with that lens. maybe if i had a gimble head and a steady tripod i might be better, or use a monopod. the monopod doesn't provide any vertical flexibility though and the gimble head only gives you some vertical access without you having to squat.\n* i can't move the camera well enough to make subject tracking work.\n* panning while trying to fill the frame is a challenge.\n\ni wonder if the 500mm f/5.6 pf lens, being almost 2 pounds lighter and i suspect faster af would make my life better? it's only 3 ounces heavier than the 70-200 f/2.8... maybe i should get this instead of replacing my 70-200 f/2.8 f mount. i shoot a lot of stuff at 500mm.\n\non a good note, the 677 photos consumed two pips of battery. since the last charge, i've shot 780 photos and have 37% left. that works out to about 1200 shots on a charge.\n\ndo i hate my z 6ii? absolutly not. i love the camera. do i hate the 200-500 f/5.6. it's sharp and produces some really good images, but it's a beast. for a $1200 lens in the super telephoto range, you can't ask for everything.", "sortedWord": "None", "identifyer": 50802, "year": "2021"}, {"Unnamed: 0": 160517, "autor": "dipdaabyss", "date": 1613804759000, "content": "Life is like a landscape. You live in the midst of it, but can only describe from the vantage of distance. Shot on Nikon D3300 with Nikkor 18-55mm. Location : Sikkim, India.", "link": "https://www.reddit.com/r/Nikon/comments/lo1oa2/life_is_like_a_landscape_you_live_in_the_midst_of/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "life is like a landscape. you live in the midst of it, but can only describe from the vantage of distance. shot on nikon d3300 with nikkor 18-55mm. -----> location !!!  : sikkim, india.", "sortedWord": "None", "identifyer": 52222, "year": "2021"}, {"Unnamed: 0": 161012, "autor": "Inevitable1811", "date": 1633829914000, "content": "The unfortunate people at a fortunate location!", "link": "https://www.reddit.com/r/Nikon/comments/q4yl3u/the_unfortunate_people_at_a_fortunate_location/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the unfortunate people at a fortunate -----> location !!! !", "sortedWord": "None", "identifyer": 52745, "year": "2021"}, {"Unnamed: 0": 161275, "autor": "AngelinaCreatina", "date": 1626539747000, "content": "Broken Lens and Can't Get it Fixed Even Though it's Fixable /!/ Would love your opinion on this! I’ve used Nikon for 30 years and this is the very first time I had to get something repaired. My 105mm f/2.8G lens got busted from a move. Basically the aperture assembly was completely broken off and the lens is like a shaker now. I took it to a local place here in NYC and pre-paid the $340 repair bill. I kind of forgot about it but then several weeks later I get a phone call that Nikon changed their policy and won’t ship them the parts they need to repair the lens. I got a refund and now I’m required to ship the lens to Nikon only. This seems a bit extreme and I’m not comfortable shipping the lens. It broke in the first place from traveling (even thought it was packed with layers and layers of bubble wrap). Also, I don’t have anything shipped to me because I live in a walkup (3rd floor) and the delivery people just leave things on the sidewalk which sometimes walk away. \n\nSo this is hugely inconvenient and not a very customer-based policy in my opinion. I mean, I love my cameras and am a loyal Nikon user, but I feel stuck on this. Technically I suppose I could go to their location on Long Island but there’s no public transportation there and a 1.5 hour Uber will probably cost more than the lens repair. So now I’m out the lens completely because neither of the two options work for me. I found a used one for about $350 but have no idea how worn down it is. My own lens was used only indoors for product photography on a sporadic basis, so I know that it is in great shape other then the broken aperture. Any advice? Curious to know what you all think!", "link": "https://www.reddit.com/r/Nikon/comments/om7nd5/broken_lens_and_cant_get_it_fixed_even_though_its/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "broken lens and can't get it fixed even though it's fixable /!/ would love your opinion on this! i’ve used nikon for 30 years and this is the very first time i had to get something repaired. my 105mm f/2.8g lens got busted from a move. basically the aperture assembly was completely broken off and the lens is like a shaker now. i took it to a local place here in nyc and pre-paid the $340 repair bill. i kind of forgot about it but then several weeks later i get a phone call that nikon changed their policy and won’t ship them the parts they need to repair the lens. i got a refund and now i’m required to ship the lens to nikon only. this seems a bit extreme and i’m not comfortable shipping the lens. it broke in the first place from traveling (even thought it was packed with layers and layers of bubble wrap). also, i don’t have anything shipped to me because i live in a walkup (3rd floor) and the delivery people just leave things on the sidewalk which sometimes walk away. \n\nso this is hugely inconvenient and not a very customer-based policy in my opinion. i mean, i love my cameras and am a loyal nikon user, but i feel stuck on this. technically i suppose i could go to their -----> location !!!  on long island but there’s no public transportation there and a 1.5 hour uber will probably cost more than the lens repair. so now i’m out the lens completely because neither of the two options work for me. i found a used one for about $350 but have no idea how worn down it is. my own lens was used only indoors for product photography on a sporadic basis, so i know that it is in great shape other then the broken aperture. any advice? curious to know what you all think!", "sortedWord": "None", "identifyer": 53029, "year": "2021"}, {"Unnamed: 0": 161792, "autor": "nasaboi_tj", "date": 1615420616000, "content": "On Location [Nikon D800 + SIgma 35mm]", "link": "https://www.reddit.com/r/Nikon/comments/m2cr7q/on_location_nikon_d800_sigma_35mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on -----> location !!!  [nikon d800 + sigma 35mm]", "sortedWord": "None", "identifyer": 53577, "year": "2021"}, {"Unnamed: 0": 161893, "autor": "FrancoCasher", "date": 1629301695000, "content": "Anchor on milkyway /!/ Hardware :\nD610\nNikkor 24mm f1.8 at 1.8\n\n15 time 5 sec\nIso 3200\n\nSoftware :\nStarryLandscapeStaker\nDarktable\n\nLocation : Pointe Saint-Mathieu, bretagne, France\n14/08/2021", "link": "https://www.reddit.com/r/Nikon/comments/p6tv09/anchor_on_milkyway/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "anchor on milkyway /!/ hardware :\nd610\nnikkor 24mm f1.8 at 1.8\n\n15 time 5 sec\niso 3200\n\nsoftware :\nstarrylandscapestaker\ndarktable\n\n-----> location !!!  : pointe saint-mathieu, bretagne, france\n14/08/2021", "sortedWord": "None", "identifyer": 53683, "year": "2021"}, {"Unnamed: 0": 162535, "autor": "L1terallyUrDad", "date": 1618711430000, "content": "AF-S 300mm f/4 PF lens - shooting day two /!/ My plan for the next three days was to:\n\n* walk a local park looking for birds (today)\n* visit a zoo (Sunday)\n* visit another lake/dam/river where birds of prey visit. (Monday)\n\nThere were specific goals for each. The local park was to test how packable the lens/camera combo is and how tight the shots will be. The Zoo again is more of a \"sharpness with live subjects\" and again how tight it will be. The other lake trip was purely an AF/tracking birds-in-flight trip. Could I handhold it better? Could I track birds better? Can I improve my BIF techniques?\n\nThe weather for Monday does not look favorable, so I decided to pack both birding outings today.\n\nFor the morning excursion, I only took my D500 with the 300mm PF and a 1.4x TC giving me an effective 630mm f/5.6. The lens empressed. I shot mostly with the 1.4x TC. Sometimes I was too tight. I took it off for some photos. \n\n&amp;#x200B;\n\n[Great Blue Heron in flight ISO 800 f\\/5.6 1\\/2000 420mm \\(630mm effective\\)](https://preview.redd.it/sl4o19ud8ut61.jpg?width=3648&amp;format=pjpg&amp;auto=webp&amp;s=491819d81155d39c9a0edff36e90b1d8580051bb)\n\nI actually started liking using my D500 again.  The Z 6II has really spoiled me on mirrorless. I had to remember to \"chimp\" to check my exposures, something I don't need to do with my Z 6II.\n\nThere were a very high keeper rate.\n\nThe afternoon trip to do birds-in-flight was far less successful, but not because of equipment or techinque, but because the birds simply were not cooperating.  I didn't get much of a chance to exercise thing. For those that I did take they were all quite sharp. I'd probably like a little more reach for this location, but it did quite well.\n\n&amp;#x200B;\n\n[Osprey Staredown ISO 320 f\\/5.6 1\\/1600 420mm \\(630mm effective\\)](https://preview.redd.it/6n3mv6wp9ut61.jpg?width=2003&amp;format=pjpg&amp;auto=webp&amp;s=218ab3bc4add2d2641d5d29a7d92b79af5b332de)\n\nI think the decision is made. I want to thank /u/scoglio91 for pushing me over the edge. In a comment he pointed out the 300 pf + 1.4x TC is only 80mm short of the 500mm pf f/5.6 and is much less money. Given I already have the 1.4x TC, he saved me $1700. It kinda makes this decision a no-brainer.\n\nSince I'm aging and after an illness I don't have the upper body strength to pack heavy gear, I'm so in love with how small this lens is.\n\nTomorrow at the Zoo, I'm pretty much going to keep it on the Z 6II and measure how much I'm goign to miss the extra length. With the D500, the 1.5x makes up for a lot, but I prefer to use the Z 6II.\n\nLook for a final update tomorrow!", "link": "https://www.reddit.com/r/Nikon/comments/mt400y/afs_300mm_f4_pf_lens_shooting_day_two/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "af-s 300mm f/4 pf lens - shooting day two /!/ my plan for the next three days was to:\n\n* walk a local park looking for birds (today)\n* visit a zoo (sunday)\n* visit another lake/dam/river where birds of prey visit. (monday)\n\nthere were specific goals for each. the local park was to test how packable the lens/camera combo is and how tight the shots will be. the zoo again is more of a \"sharpness with live subjects\" and again how tight it will be. the other lake trip was purely an af/tracking birds-in-flight trip. could i handhold it better? could i track birds better? can i improve my bif techniques?\n\nthe weather for monday does not look favorable, so i decided to pack both birding outings today.\n\nfor the morning excursion, i only took my d500 with the 300mm pf and a 1.4x tc giving me an effective 630mm f/5.6. the lens empressed. i shot mostly with the 1.4x tc. sometimes i was too tight. i took it off for some photos. \n\n&amp;#x200b;\n\n[great blue heron in flight iso 800 f\\/5.6 1\\/2000 420mm \\(630mm effective\\)](https://preview.redd.it/sl4o19ud8ut61.jpg?width=3648&amp;format=pjpg&amp;auto=webp&amp;s=491819d81155d39c9a0edff36e90b1d8580051bb)\n\ni actually started liking using my d500 again.  the z 6ii has really spoiled me on mirrorless. i had to remember to \"chimp\" to check my exposures, something i don't need to do with my z 6ii.\n\nthere were a very high keeper rate.\n\nthe afternoon trip to do birds-in-flight was far less successful, but not because of equipment or techinque, but because the birds simply were not cooperating.  i didn't get much of a chance to exercise thing. for those that i did take they were all quite sharp. i'd probably like a little more reach for this -----> location !!! , but it did quite well.\n\n&amp;#x200b;\n\n[osprey staredown iso 320 f\\/5.6 1\\/1600 420mm \\(630mm effective\\)](https://preview.redd.it/6n3mv6wp9ut61.jpg?width=2003&amp;format=pjpg&amp;auto=webp&amp;s=218ab3bc4add2d2641d5d29a7d92b79af5b332de)\n\ni think the decision is made. i want to thank /u/scoglio91 for pushing me over the edge. in a comment he pointed out the 300 pf + 1.4x tc is only 80mm short of the 500mm pf f/5.6 and is much less money. given i already have the 1.4x tc, he saved me $1700. it kinda makes this decision a no-brainer.\n\nsince i'm aging and after an illness i don't have the upper body strength to pack heavy gear, i'm so in love with how small this lens is.\n\ntomorrow at the zoo, i'm pretty much going to keep it on the z 6ii and measure how much i'm goign to miss the extra length. with the d500, the 1.5x makes up for a lot, but i prefer to use the z 6ii.\n\nlook for a final update tomorrow!", "sortedWord": "None", "identifyer": 54367, "year": "2021"}, {"Unnamed: 0": 162896, "autor": "whtswrngwithmyplants", "date": 1633123093000, "content": "Has anyone had recent experience sending gear to Nikon for repair? /!/ I live near Long Island and had usually driven over to the Melville location for repairs and recalls but decided to ship it to LI this one time. It took ten days to get estimate and when I finally got it, I found out that my lens was shipped to California. I'm just wondering if this is because Covid or some other thing. \n\nAlso, would Nikon ship it back to me via ground or air? I just want to know in case it's going to take an extra week on top of however long it takes for them to work on the lens.  I miss my local repair shop, but they can no longer work on Nikon stuff onsite.", "link": "https://www.reddit.com/r/Nikon/comments/pzhdpp/has_anyone_had_recent_experience_sending_gear_to/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "has anyone had recent experience sending gear to nikon for repair? /!/ i live near long island and had usually driven over to the melville -----> location !!!  for repairs and recalls but decided to ship it to li this one time. it took ten days to get estimate and when i finally got it, i found out that my lens was shipped to california. i'm just wondering if this is because covid or some other thing. \n\nalso, would nikon ship it back to me via ground or air? i just want to know in case it's going to take an extra week on top of however long it takes for them to work on the lens.  i miss my local repair shop, but they can no longer work on nikon stuff onsite.", "sortedWord": "None", "identifyer": 54753, "year": "2021"}, {"Unnamed: 0": 163345, "autor": "dimm_12", "date": 1629483078000, "content": "Shot with Nikon D3500 , Lens Yongnuo 35mm , f2.8 , iso 100 , shutter speed 1/1250 /!/ Hey , it's my firts post here , hope you like it . Shot in July . Location is Monastiraki , Athens -Greece . You can see the Parthenon , a Greek- Orthodox's church dome , on my left is the ancient ruins of the Library of Adrian .\n\nhttps://preview.redd.it/ipenn0mj0ki71.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=da92f2b51733ca80fc2901310becd655d6f43c00", "link": "https://www.reddit.com/r/Nikon/comments/p8aogd/shot_with_nikon_d3500_lens_yongnuo_35mm_f28_iso/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shot with nikon d3500 , lens yongnuo 35mm , f2.8 , iso 100 , shutter speed 1/1250 /!/ hey , it's my firts post here , hope you like it . shot in july . -----> location !!!  is monastiraki , athens -greece . you can see the parthenon , a greek- orthodox's church dome , on my left is the ancient ruins of the library of adrian .\n\nhttps://preview.redd.it/ipenn0mj0ki71.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=da92f2b51733ca80fc2901310becd655d6f43c00", "sortedWord": "None", "identifyer": 55216, "year": "2021"}], "name": "locationnikon2021"}