{"interestingcomments": [{"Unnamed: 0": 25084, "autor": "chaibhu", "date": 1595204560000, "content": "Looking for right angled DC2 shutter release for Z6 /!/ Hi, I use a Z6 for shooting panoramas and timelapses. I have a Sunwayfoto L-bracket to rotate the camera for portrait and landscape shots.\n\nI am looking for a remote shutter release for the Z6 which uses a DC2 connector but all the options online seem to have a really long connector head which prevents my Z6 from being mounted in portrait orientation. I have tried pushing the L bracket out to the side to make space for  the connector on the side but it makes the camera unstable when mounted and is more susceptible to vibrations (especially when using a heavy UWA lens).\n\nThanks in advance! ", "link": "https://www.reddit.com/r/Nikon/comments/hubdea/looking_for_right_angled_dc2_shutter_release_for/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "looking for right angled dc2 shutter release for z6 /!/ hi, i use a z6 for shooting panoramas and timelapses. i have a sunwayfoto l-bracket to rotate the camera for portrait and landscape shots.\n\ni am looking for a remote shutter release for the z6 which uses a dc2 connector but all the options online seem to have a really long connector head which prevents my z6 from being mounted in portrait -----> orientation !!! . i have tried pushing the l bracket out to the side to make space for  the connector on the side but it makes the camera unstable when mounted and is more susceptible to vibrations (especially when using a heavy uwa lens).\n\nthanks in advance! ", "sortedWord": "None", "identifyer": 25517, "year": "2020"}, {"Unnamed: 0": 27693, "autor": "BulkyPhoto", "date": 1584871325000, "content": "Long exposure at Benvoy Beach, Waterford, Ireland.. Nikon D800/ 20mm 1.8. portrait orientation, cropped.. edited in Lightroom and Affinity Photo..", "link": "https://www.reddit.com/r/Nikon/comments/fmxkwa/long_exposure_at_benvoy_beach_waterford_ireland/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "long exposure at benvoy beach, waterford, ireland.. nikon d800/ 20mm 1.8. portrait -----> orientation !!! , cropped.. edited in lightroom and affinity photo..", "sortedWord": "None", "identifyer": 28216, "year": "2020"}], "name": "orientationnikon2020"}