{"interestingcomments": [{"Unnamed: 0": 158852, "autor": "tragically_", "date": 1623059279000, "content": "portrait shot images are showing up as landscape in acdsee and lightroom. /!/ I shot for a friend and he noted in lightroom all my portrait shot images are shown as landscape orientation. what needs to be changed in the camera?\n\nin camera, I prefer all portrait shot orientation stay in landscape on the screen so I can use the who screen for viewing.\n\nthe same issue shows up for me when I edit in acdsee. images shot in portrait orientation show up in landscape\n\nwhat setting in camera is needed?\n\ncheers", "link": "https://www.reddit.com/r/Nikon/comments/nu8i2t/portrait_shot_images_are_showing_up_as_landscape/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "portrait shot images are showing up as landscape in acdsee and lightroom. /!/ i shot for a friend and he noted in lightroom all my portrait shot images are shown as landscape -----> orientation !!! . what needs to be changed in the camera?\n\nin camera, i prefer all portrait shot orientation stay in landscape on the screen so i can use the who screen for viewing.\n\nthe same issue shows up for me when i edit in acdsee. images shot in portrait orientation show up in landscape\n\nwhat setting in camera is needed?\n\ncheers", "sortedWord": "None", "identifyer": 50478, "year": "2021"}, {"Unnamed: 0": 163124, "autor": "Barnie25", "date": 1628449121000, "content": "4 shot landscape panorama turned into 48MP landscape shot with Nikon Z50 /!/ Today I went out to the forest to hike and try and shoot something. I wanted to test if I could shoot a good panorama with my Z50. I shot 4 portrait orientation shots that combined into a 48MP 2:3 shot that was sharp from front till back. I need to take my time to properly edit the photo but I am pretty happy with the technique.\n\nI shot with the 50mm 1.8 S.", "link": "https://www.reddit.com/r/Nikon/comments/p0kl73/4_shot_landscape_panorama_turned_into_48mp/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "4 shot landscape panorama turned into 48mp landscape shot with nikon z50 /!/ today i went out to the forest to hike and try and shoot something. i wanted to test if i could shoot a good panorama with my z50. i shot 4 portrait -----> orientation !!!  shots that combined into a 48mp 2:3 shot that was sharp from front till back. i need to take my time to properly edit the photo but i am pretty happy with the technique.\n\ni shot with the 50mm 1.8 s.", "sortedWord": "None", "identifyer": 54988, "year": "2021"}, {"Unnamed: 0": 163287, "autor": "darinheinz", "date": 1629640204000, "content": "MB-10 battery grip compatible with N8008s? /!/ I am seeing a lot of conflicting information online when it comes to finding a battery grip that will work for my N8008s. Consensus seems to be that the MB-10 will work, but the secondary shutter release is disabled. Since I only need the battery grip for extended shooting sessions in the field, and rarely shoot in the vertical orientation, would this work?", "link": "https://www.reddit.com/r/Nikon/comments/p9cspx/mb10_battery_grip_compatible_with_n8008s/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mb-10 battery grip compatible with n8008s? /!/ i am seeing a lot of conflicting information online when it comes to finding a battery grip that will work for my n8008s. consensus seems to be that the mb-10 will work, but the secondary shutter release is disabled. since i only need the battery grip for extended shooting sessions in the field, and rarely shoot in the vertical -----> orientation !!! , would this work?", "sortedWord": "None", "identifyer": 55155, "year": "2021"}], "name": "orientationnikon2021"}