{"interestingcomments": [{"Unnamed: 0": 14, "autor": "thomasjbrablec", "date": 1554436547000, "content": "Nikon 50mm Repair /!/ Hello, guys!   \n\n\nI'm a long time Nikon shooter, but I've never done my own lens repair. I recently found an insane deal on what I assumed was a Nikon 50mm f/1.4D. Turns out, it was an early AF version of the lens, the Nikon 50mm f/1.4 Non-D, which I have had trouble finding much information about. I got it for $45 alongside a Nikon N6006, but I got it for the lens. Here's the catch: the focus ring was stuck.   \n\n\nNow I've read up on issues like it... \"it's the internal lubricant/it's something stuck in the helicoid/...\". I thought it could be fun to take it apart, fix it, and possible use it myself. But this focus ring was STUCK. It wouldn't move a millimeter left or right. So I managed to disassemble the entire lens, kept the lens group intact (alongside the aperture), however, once I got to the focus system, I realized the issue was not what I expected. The helicoid on the lens group was fine, but the focus ring couldn't move. I watched videos on a the D-version disassembly, and the focus ring was screwed on, but that didn't work. It ended up coming off by prying it off, because it's sort of pressed on rather than screwed on with a thread.   \n\n\nHere is the problem: I disassembled the rest of the focus group, and it's 3 parts: the metal helicoid attached to the focusing gear (sort of the center piece that everything screws into), one plastic ring with the focus distance window, and the actual focus ring. The focus window piece attaches to the metal helicoid easily, it just doesn't have much space to work around to screw it on. But the actual focus ring (a plastic circle, part of which is wider) is supposed to fit into the two other pieces, sort of fitting between the metal and plastic. However, I believe that it is supposed to click onto the metal piece, since there is a raised ridge and a millimeter wide gap. This incorrect position is causing the ring to get stuck by friction, but I also don't know how to \"click it on\" the metal piece, because it would require a lot of force or a tool I don't have.   \n\n\nDoes anyone here have any experience with these older lenses or replacing the actual focus ring (not the rubber piece)? I would love to hear what the trick is to snap it back on, because I have spent hours trying to figure it out, and I've failed dozens of times.   \n\n\nI appreciate any and all information. I have to admit I won't be sending it in for professional repair, because it is simply not worth my money, considering I got a great deal on it, and I wanted to challenge myself. I can sacrifice \\~$30 for overestimating my abilities, not $100+ for fixing a lens that's probably been forgotten for a reason.  Thank you all in advance!  \n\n\nTL;DR: Nikon 50mm f/1.4 AF Non-D focus ring frozen solid. Focus ring won't snap into place. Any help appreciated. ", "link": "https://www.reddit.com/r/Nikon/comments/b9migc/nikon_50mm_repair/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon 50mm repair /!/ hello, guys!   \n\n\ni'm a long time nikon shooter, but i've never done my own lens repair. i recently found an insane deal on what i assumed was a nikon 50mm f/1.4d. turns out, it was an early af version of the lens, the nikon 50mm f/1.4 non-d, which i have had trouble finding much information about. i got it for $45 alongside a nikon n6006, but i got it for the lens. here's the catch: the focus ring was stuck.   \n\n\nnow i've read up on issues like it... \"it's the internal lubricant/it's something stuck in the helicoid/...\". i thought it could be fun to take it apart, fix it, and possible use it myself. but this focus ring was stuck. it wouldn't move a millimeter left or right. so i managed to disassemble the entire lens, kept the lens group intact (alongside the aperture), however, once i got to the focus system, i realized the issue was not what i expected. the helicoid on the lens group was fine, but the focus ring couldn't move. i watched videos on a the d-version disassembly, and the focus ring was screwed on, but that didn't work. it ended up coming off by prying it off, because it's sort of pressed on rather than screwed on with a thread.   \n\n\nhere is the problem: i disassembled the rest of the focus group, and it's 3 parts: the metal helicoid attached to the focusing gear (sort of the center piece that everything screws into), one plastic ring with the focus distance window, and the actual focus ring. the focus window piece attaches to the metal helicoid easily, it just doesn't have much space to work around to screw it on. but the actual focus ring (a plastic circle, part of which is wider) is supposed to fit into the two other pieces, sort of fitting between the metal and plastic. however, i believe that it is supposed to click onto the metal piece, since there is a raised ridge and a millimeter wide gap. this incorrect -----> position !!!  is causing the ring to get stuck by friction, but i also don't know how to \"click it on\" the metal piece, because it would require a lot of force or a tool i don't have.   \n\n\ndoes anyone here have any experience with these older lenses or replacing the actual focus ring (not the rubber piece)? i would love to hear what the trick is to snap it back on, because i have spent hours trying to figure it out, and i've failed dozens of times.   \n\n\ni appreciate any and all information. i have to admit i won't be sending it in for professional repair, because it is simply not worth my money, considering i got a great deal on it, and i wanted to challenge myself. i can sacrifice \\~$30 for overestimating my abilities, not $100+ for fixing a lens that's probably been forgotten for a reason.  thank you all in advance!  \n\n\ntl;dr: nikon 50mm f/1.4 af non-d focus ring frozen solid. focus ring won't snap into place. any help appreciated. ", "sortedWord": "None", "identifyer": 14, "year": "2019"}, {"Unnamed: 0": 726, "autor": "Ronis_BR", "date": 1562287069000, "content": "Nikon and Sigma 18-35mm F1.8 in 2019 /!/ Hi guys!\n\n&amp;#x200B;\n\nI bought a long time ago a Sigma 18-35mm and used it in three different Nikon bodies. I would like to write this post for people that, in 2019, are looking for information about this lens.\n\n&amp;#x200B;\n\nThe fact is: when you google about it, you find mostly two things: the image quality is superb, the autofocus is crap. Unfortunately, this is true.\n\n&amp;#x200B;\n\nThe autofocus of my lens with my old D7100 was bad. Very bad indeed. The next day I bought this camera, I went to the store to purchase the Sigma dock in order to do fine tuning. When I exchanged my camera with the D7200, it was also awful. However, when I reset the configurations, then it was much better than it was initially with D7100. In fact, I achieved an acceptable behavior using the in-camera fine tuning adjustments. Thus, the autofocus quality really depends on your camera and lens.  \n\n\nHowever, after a good fine tuning of the autofocus, what you get is just amazing, because the image quality is superb. In fact, I don't think there is other DX zoom lens with such good quality for Nikon. The process to fine-tuning the lens is painful at best, but you will not regret. What I did was to develop a setup using a cardboard box and a ruler similar to that in this video: [https://www.youtube.com/watch?v=2OmxtddLfPM](https://www.youtube.com/watch?v=2OmxtddLfPM)   \n\n\nThe process is straightforward: positioning the camera away from the object by one of the distances indicated in the Sigma dock app, take the shots using 18, 24, 28, and 35mm, and check the focus. In all cases, I shot with f1.8. Then, plug the lens into the dock, open the app and adjust. If it is back-focused, then increase the number, otherwise, decrease it. The biggest problem is that, at least for me, the settings were not independent. When I changed the number for, let's say, 24 mm, then the auto-focus behavior using 28mm also changed. Thus, it is a very long try-and-error process that must be repeated for all four distances (0.28m, 0.35m, 0.5m, and infinity) The results for my setup can be seen here: [https://imgur.com/ImMF9Av](https://imgur.com/ImMF9Av)  \n\n\nHere is an example of an image after the calibration process (0.28m, 35mm): [https://imgur.com/6DB57IQ](https://imgur.com/6DB57IQ)   \n\n\nI was not able to verify using the focus at infinity due to my room constraints :D However, in my case, the focus at infinity is very good. After all this process, you realize why this lens is so good. I really would like to do not have to go through all of this, but the image you get after it is just amazing considering the price of it.  \n\n\nWell, I hope this post helps people that want to buy this lens to use in Nikon bodies :)  \n\n\nTL;DR: If you want to buy Sigma 18-35mm to be used in a Nikon body, you would probably need the sigma dock to make micro adjustments in the focus. If you cannot rent it, then buy it! After that, you will probably have the best DX lens in terms of image quality for Nikon.", "link": "https://www.reddit.com/r/Nikon/comments/c99r7t/nikon_and_sigma_1835mm_f18_in_2019/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "nikon and sigma 18-35mm f1.8 in 2019 /!/ hi guys!\n\n&amp;#x200b;\n\ni bought a long time ago a sigma 18-35mm and used it in three different nikon bodies. i would like to write this post for people that, in 2019, are looking for information about this lens.\n\n&amp;#x200b;\n\nthe fact is: when you google about it, you find mostly two things: the image quality is superb, the autofocus is crap. unfortunately, this is true.\n\n&amp;#x200b;\n\nthe autofocus of my lens with my old d7100 was bad. very bad indeed. the next day i bought this camera, i went to the store to purchase the sigma dock in order to do fine tuning. when i exchanged my camera with the d7200, it was also awful. however, when i reset the configurations, then it was much better than it was initially with d7100. in fact, i achieved an acceptable behavior using the in-camera fine tuning adjustments. thus, the autofocus quality really depends on your camera and lens.  \n\n\nhowever, after a good fine tuning of the autofocus, what you get is just amazing, because the image quality is superb. in fact, i don't think there is other dx zoom lens with such good quality for nikon. the process to fine-tuning the lens is painful at best, but you will not regret. what i did was to develop a setup using a cardboard box and a ruler similar to that in this video: [https://www.youtube.com/watch?v=2omxtddlfpm](https://www.youtube.com/watch?v=2omxtddlfpm)   \n\n\nthe process is straightforward: -----> positioning !!!  the camera away from the object by one of the distances indicated in the sigma dock app, take the shots using 18, 24, 28, and 35mm, and check the focus. in all cases, i shot with f1.8. then, plug the lens into the dock, open the app and adjust. if it is back-focused, then increase the number, otherwise, decrease it. the biggest problem is that, at least for me, the settings were not independent. when i changed the number for, let's say, 24 mm, then the auto-focus behavior using 28mm also changed. thus, it is a very long try-and-error process that must be repeated for all four distances (0.28m, 0.35m, 0.5m, and infinity) the results for my setup can be seen here: [https://imgur.com/immf9av](https://imgur.com/immf9av)  \n\n\nhere is an example of an image after the calibration process (0.28m, 35mm): [https://imgur.com/6db57iq](https://imgur.com/6db57iq)   \n\n\ni was not able to verify using the focus at infinity due to my room constraints :d however, in my case, the focus at infinity is very good. after all this process, you realize why this lens is so good. i really would like to do not have to go through all of this, but the image you get after it is just amazing considering the price of it.  \n\n\nwell, i hope this post helps people that want to buy this lens to use in nikon bodies :)  \n\n\ntl;dr: if you want to buy sigma 18-35mm to be used in a nikon body, you would probably need the sigma dock to make micro adjustments in the focus. if you cannot rent it, then buy it! after that, you will probably have the best dx lens in terms of image quality for nikon.", "sortedWord": "None", "identifyer": 735, "year": "2019"}, {"Unnamed: 0": 1105, "autor": "dotdotd0t", "date": 1557205316000, "content": "[Help] Nikon 70-200mm 2.8 VRII upper focus ring stuck and zoom ring locked in 200mm position. /!/ Hey everyone!   \n\n\nI've owned my Nikon 70-200mm for over a year now (got it used) and have been in love with this lens. \n\n  \nI pulled it out of my bag today and noticed that the zoom ring was locked in the 200mm and will not budge. The middle MF ring rotates totally fine but the upper fine MF ring is also locked in position. The AF functions work completely normally.   \n\n\nThis lens was working perfectly a few days ago - I didn't drop it nor do I recall any damage or use that could have caused this.   \n\n\nI'm aware I will likely have to ship it to Nikon but wanted to check if I'm missing something obvious or if there's a simple explanation for this?   \n\n\nThank you all so much.", "link": "https://www.reddit.com/r/Nikon/comments/blmme7/help_nikon_70200mm_28_vrii_upper_focus_ring_stuck/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[help] nikon 70-200mm 2.8 vrii upper focus ring stuck and zoom ring locked in 200mm -----> position !!! . /!/ hey everyone!   \n\n\ni've owned my nikon 70-200mm for over a year now (got it used) and have been in love with this lens. \n\n  \ni pulled it out of my bag today and noticed that the zoom ring was locked in the 200mm and will not budge. the middle mf ring rotates totally fine but the upper fine mf ring is also locked in position. the af functions work completely normally.   \n\n\nthis lens was working perfectly a few days ago - i didn't drop it nor do i recall any damage or use that could have caused this.   \n\n\ni'm aware i will likely have to ship it to nikon but wanted to check if i'm missing something obvious or if there's a simple explanation for this?   \n\n\nthank you all so much.", "sortedWord": "None", "identifyer": 1116, "year": "2019"}, {"Unnamed: 0": 1326, "autor": "AceFebreze", "date": 1546333517000, "content": "HELP: Internal Part Fell Off in Camera Lens? /!/ Hey all, wasn't sure where to post this, please lemme know if I should post to somewhere else.\n\nI heard a shaking sound inside my camera lens today, and when I went to examine it, I saw a small round-shaped lens-looking \"thing\" that's obviously fell off its position INSIDE of the camera lens. Here're some pictures and a quick video to show what I mean:\n\n[PICTURE 1](https://imgur.com/sGOIAgf)\n\n[PICTURE 2](https://imgur.com/GJGpxRo)\n\n[VIDEO](https://streamable.com/z6nz4)\n\nMy question is: What do I do at this point? Send it in for a replacement/refund, or is this something easily fixable by myself?\n\nThanks!", "link": "https://www.reddit.com/r/Nikon/comments/abgs9y/help_internal_part_fell_off_in_camera_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help: internal part fell off in camera lens? /!/ hey all, wasn't sure where to post this, please lemme know if i should post to somewhere else.\n\ni heard a shaking sound inside my camera lens today, and when i went to examine it, i saw a small round-shaped lens-looking \"thing\" that's obviously fell off its -----> position !!!  inside of the camera lens. here're some pictures and a quick video to show what i mean:\n\n[picture 1](https://imgur.com/sgoiagf)\n\n[picture 2](https://imgur.com/gjgpxro)\n\n[video](https://streamable.com/z6nz4)\n\nmy question is: what do i do at this point? send it in for a replacement/refund, or is this something easily fixable by myself?\n\nthanks!", "sortedWord": "None", "identifyer": 1337, "year": "2019"}, {"Unnamed: 0": 105868, "autor": "buckket", "date": 1574457794000, "content": "50mm f/1.8 lens - Are there two distinct positions at 1.8? /!/ Just recently I bought this lens used. While playing around with it, I noticed that my model has two distinct positions at 1.8 where the aperture ring will lock into place. Is this normal behaviour, and if so why is this the case? When closely looking at the lens I can see that at one position the blades are fully retracted and at the other they are ever so slightly visible. The datasheet mentions none if this and I haven't heard or experienced similar behavior before. Maybe someone can enlighten me. Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/e07lw9/50mm_f18_lens_are_there_two_distinct_positions_at/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "50mm f/1.8 lens - are there two distinct -----> positions !!!  at 1.8? /!/ just recently i bought this lens used. while playing around with it, i noticed that my model has two distinct positions at 1.8 where the aperture ring will lock into place. is this normal behaviour, and if so why is this the case? when closely looking at the lens i can see that at one position the blades are fully retracted and at the other they are ever so slightly visible. the datasheet mentions none if this and i haven't heard or experienced similar behavior before. maybe someone can enlighten me. thanks!", "sortedWord": "None", "identifyer": 8741, "year": "2019"}, {"Unnamed: 0": 106247, "autor": "butidontthink", "date": 1555221408000, "content": "Questions about the Sigma 17-50mm F2.8 EX DC OS HSM (Nikon) lens /!/ This was also emailed to Sigma.  I figured that the Reddit Hive Mind may also know the answers.\n\n-----------------\n\nThis is my first Sigma lens, so I'm spending a little time learning how to best use it.  To that end I've been doing something that may sound a bit odd; I'm reading the manual. :)\n\nI've run into a couple places where I need some clarification:\n\n-----------------\n\nThe manual states, under NOTICE:\n\"If you fix the camera with a tripod or another method, please determine the composition when the stabilize unit is in the active status.\"\n\nFurther down the manual states, under ABOUT OS FEATURES:\n\"Do not use the optical stabilizer in the following situations: When the lens is mounted on a tripod...\"\n\nWhich of these is correct?  Am I misunderstanding one of them?\n\n-----------------\n\nThe manual states, under ABOUT OS FEATURES:\n\"Be sure to turn the OS switch to the OFF position before attaching or detaching the lens from the camera.\"\n\nThe manual then states, also under ABOUT OS FEATURES:\n\"If the lens is detached from the camera or the camera power is turned off while the OS function is in operation, the lens may emit a chattering noise, but this is not a malfunction.\"\n\nDoes the OS switch actually need to be OFF when detaching the lens or powering down the camera?  If I inadvertently leave OS on when I detach the lens or power down the camera, is damage to the lens possible?\n\nShould I power off the camera before attaching or detaching the lens from the camera?", "link": "https://www.reddit.com/r/Nikon/comments/bcztz7/questions_about_the_sigma_1750mm_f28_ex_dc_os_hsm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "questions about the sigma 17-50mm f2.8 ex dc os hsm (nikon) lens /!/ this was also emailed to sigma.  i figured that the reddit hive mind may also know the answers.\n\n-----------------\n\nthis is my first sigma lens, so i'm spending a little time learning how to best use it.  to that end i've been doing something that may sound a bit odd; i'm reading the manual. :)\n\ni've run into a couple places where i need some clarification:\n\n-----------------\n\nthe manual states, under notice:\n\"if you fix the camera with a tripod or another method, please determine the composition when the stabilize unit is in the active status.\"\n\nfurther down the manual states, under about os features:\n\"do not use the optical stabilizer in the following situations: when the lens is mounted on a tripod...\"\n\nwhich of these is correct?  am i misunderstanding one of them?\n\n-----------------\n\nthe manual states, under about os features:\n\"be sure to turn the os switch to the off -----> position !!!  before attaching or detaching the lens from the camera.\"\n\nthe manual then states, also under about os features:\n\"if the lens is detached from the camera or the camera power is turned off while the os function is in operation, the lens may emit a chattering noise, but this is not a malfunction.\"\n\ndoes the os switch actually need to be off when detaching the lens or powering down the camera?  if i inadvertently leave os on when i detach the lens or power down the camera, is damage to the lens possible?\n\nshould i power off the camera before attaching or detaching the lens from the camera?", "sortedWord": "None", "identifyer": 9128, "year": "2019"}, {"Unnamed: 0": 107204, "autor": "gingernuts13", "date": 1561134837000, "content": "How to connect D7200 to MacBook Pro for live view and capture /!/ I am doing product photography and will need to do about 200 shots in a row from a fixed position. How do I connect my D7200 to MacBook pro to use as live view and also remote capture. If I can modify settings from Mac that's a plus but not required. I see the USB connector and HDMI on camera but not sure which to use and what's the best software thanks!", "link": "https://www.reddit.com/r/Nikon/comments/c3cve5/how_to_connect_d7200_to_macbook_pro_for_live_view/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to connect d7200 to macbook pro for live view and capture /!/ i am doing product photography and will need to do about 200 shots in a row from a fixed -----> position !!! . how do i connect my d7200 to macbook pro to use as live view and also remote capture. if i can modify settings from mac that's a plus but not required. i see the usb connector and hdmi on camera but not sure which to use and what's the best software thanks!", "sortedWord": "None", "identifyer": 10094, "year": "2019"}, {"Unnamed: 0": 107324, "autor": "jonidog", "date": 1569162219000, "content": "Nikon 24-70mm S - Am I breaking my lens? /!/ Hello, I have the kit lens, using it on my Z6. I've noticed that when my lens is at its widest position @24mm, I can still turn it a little bit tiny more (basically, starting to close the lens) and reach a position that I would estimate being 21mm or 22mm. I can still shoot with the lens without getting the warning \"open lens to use\".\n\nMy question, am I breaking my lens? I think not, but thought of asking...", "link": "https://www.reddit.com/r/Nikon/comments/d7r2m5/nikon_2470mm_s_am_i_breaking_my_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon 24-70mm s - am i breaking my lens? /!/ hello, i have the kit lens, using it on my z6. i've noticed that when my lens is at its widest -----> position !!!  @24mm, i can still turn it a little bit tiny more (basically, starting to close the lens) and reach a -----> position !!!  that i would estimate being 21mm or 22mm. i can still shoot with the lens without getting the warning \"open lens to use\".\n\nmy question, am i breaking my lens? i think not, but thought of asking...", "sortedWord": "None", "identifyer": 10215, "year": "2019"}, {"Unnamed: 0": 108331, "autor": "Hawkeye0914", "date": 1567745615000, "content": "Nikon FE Film Advance Doesn't reset /!/ I'm having a problem with my FE where if I don't let the film advance lever spring back, them mechanism doesn't reset and I can't trigger the shutter.  I have to manually turn the knob for the electric advance back to the perpendicular position then it will allow me to take a photo.  Any ideas on how to fix this?", "link": "https://www.reddit.com/r/Nikon/comments/d0c31i/nikon_fe_film_advance_doesnt_reset/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fe film advance doesn't reset /!/ i'm having a problem with my fe where if i don't let the film advance lever spring back, them mechanism doesn't reset and i can't trigger the shutter.  i have to manually turn the knob for the electric advance back to the perpendicular -----> position !!!  then it will allow me to take a photo.  any ideas on how to fix this?", "sortedWord": "None", "identifyer": 11237, "year": "2019"}, {"Unnamed: 0": 109131, "autor": "Lilrags16", "date": 1564031042000, "content": "D300 fEE question /!/ Just picked up a D300 with a older school Nikon manual lens. Works amazing with the manual lens. \n\nProblem is, with my Grandpa’s AF lens, I get the fEE error. He has this same body and it works fine. My old D70 works as expected as well. Tried cleaning the contacts on the body to no avail. \n\nHas anyone felt with this? Any suggestions? I have made sure the lens F-stop selection is in the locked position. If I set the camera to use the ring select instead of the camera select, it works as expected.", "link": "https://www.reddit.com/r/Nikon/comments/chj9vx/d300_fee_question/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d300 fee question /!/ just picked up a d300 with a older school nikon manual lens. works amazing with the manual lens. \n\nproblem is, with my grandpa’s af lens, i get the fee error. he has this same body and it works fine. my old d70 works as expected as well. tried cleaning the contacts on the body to no avail. \n\nhas anyone felt with this? any suggestions? i have made sure the lens f-stop selection is in the locked -----> position !!! . if i set the camera to use the ring select instead of the camera select, it works as expected.", "sortedWord": "None", "identifyer": 12052, "year": "2019"}, {"Unnamed: 0": 109457, "autor": "therealdankmemelord1", "date": 1560903550000, "content": "AF-S on a D5600 /!/ Hello\n\n&amp;#x200B;\n\nI just bought a D5600, and I think this might be a silly question, but I had a 55-200 DX 1:4-5.6G ED AF-S lens that won't autofocus on the 5600 in auto or manual mode. I can still manual focus with the switch over in the \"M\" position, but when the switch is in the \"A\" position, the camera detects that it is in autofocus mode, but it will not autofocus. Is there an underlying issue or am I just being stupid?", "link": "https://www.reddit.com/r/Nikon/comments/c2a1oe/afs_on_a_d5600/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "af-s on a d5600 /!/ hello\n\n&amp;#x200b;\n\ni just bought a d5600, and i think this might be a silly question, but i had a 55-200 dx 1:4-5.6g ed af-s lens that won't autofocus on the 5600 in auto or manual mode. i can still manual focus with the switch over in the \"m\" -----> position !!! , but when the switch is in the \"a\" -----> position !!! , the camera detects that it is in autofocus mode, but it will not autofocus. is there an underlying issue or am i just being stupid?", "sortedWord": "None", "identifyer": 12384, "year": "2019"}, {"Unnamed: 0": 109798, "autor": "avengerhed", "date": 1559174096000, "content": "A bolt-action camera: D90 Aperture Control Issue - DoF preview reset /!/ I have a D90 that’s giving me aperture control issues. With the Nikon 55-300, I can tell that the aperture is partially stopped down from the moment I turn on the camera. This usually renders autofocus unusable. \n\nIf I then press the DoF preview button, the aperture stops down more and then, upon releasing the DoF preview button, the aperture returns to fully open. At this point, autofocus functions fine and I can take a picture without any problem. \n\nAs soon as the picture is snapped, the aperture returns to half-closed. DoF preview “resets” the aperture to wide open.  I can release the shutter to get a picture then reset the aperture with DoF preview every shot. Essentially, I have a bolt-action camera. \n\nAny lens with an electronic aperture controls works fine. Also, I can verify the issue by observing the aperture control behavior when no lens is in place. It rarely returns to the home position from shot to shot. I took the steps of cleaning the lens contacts and body contacts, verified the lens to be working on my D500 and verified electronic aperture lenses to be working on the D90. \n\nHas anyone experienced this before? Might there be a software/settings fix, or is my aperture control unit shot?\n\nThank you for your insight.", "link": "https://www.reddit.com/r/Nikon/comments/bum6b2/a_boltaction_camera_d90_aperture_control_issue/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a bolt-action camera: d90 aperture control issue - dof preview reset /!/ i have a d90 that’s giving me aperture control issues. with the nikon 55-300, i can tell that the aperture is partially stopped down from the moment i turn on the camera. this usually renders autofocus unusable. \n\nif i then press the dof preview button, the aperture stops down more and then, upon releasing the dof preview button, the aperture returns to fully open. at this point, autofocus functions fine and i can take a picture without any problem. \n\nas soon as the picture is snapped, the aperture returns to half-closed. dof preview “resets” the aperture to wide open.  i can release the shutter to get a picture then reset the aperture with dof preview every shot. essentially, i have a bolt-action camera. \n\nany lens with an electronic aperture controls works fine. also, i can verify the issue by observing the aperture control behavior when no lens is in place. it rarely returns to the home -----> position !!!  from shot to shot. i took the steps of cleaning the lens contacts and body contacts, verified the lens to be working on my d500 and verified electronic aperture lenses to be working on the d90. \n\nhas anyone experienced this before? might there be a software/settings fix, or is my aperture control unit shot?\n\nthank you for your insight.", "sortedWord": "None", "identifyer": 12729, "year": "2019"}], "name": "positionnikon2019"}