{"interestingcomments": [{"Unnamed: 0": 154506, "autor": "klapet", "date": 1614419073000, "content": "Issue focus 50mm f/1.2 Nikkor /!/ Hi ! \n\nI have a beautiful old 50mm F1.2, I don't use it a lot, but it's a great lens. Unfortunately in the past year I lost the hability to focus at infinity with it, something went wrong inside. I can hear and feel something moving inside (I guess a lens ?) when i shake gently the lens up and down.\n\nSometime I manage to shake it the right way and I have infinity once again until the lenses moves back to the wrong position.\n\nDid anyone had this issue before ? What would be the cost the repair it ? Or any video to suggest ?\n\nThanks !", "link": "https://www.reddit.com/r/Nikon/comments/ltkqb1/issue_focus_50mm_f12_nikkor/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "issue focus 50mm f/1.2 nikkor /!/ hi ! \n\ni have a beautiful old 50mm f1.2, i don't use it a lot, but it's a great lens. unfortunately in the past year i lost the hability to focus at infinity with it, something went wrong inside. i can hear and feel something moving inside (i guess a lens ?) when i shake gently the lens up and down.\n\nsometime i manage to shake it the right way and i have infinity once again until the lenses moves back to the wrong -----> position !!! .\n\ndid anyone had this issue before ? what would be the cost the repair it ? or any video to suggest ?\n\nthanks !", "sortedWord": "None", "identifyer": 45960, "year": "2021"}, {"Unnamed: 0": 154785, "autor": "L1terallyUrDad", "date": 1627782294000, "content": "Nikon Z 14-30mm f/4S mini-review /!/ I picked up a refurbished Nikon Z 14-30mm f/4  from NikonUSA this week. Previous to this, I had (well still do have) a Tokina 16-28mm f/2.8 cheap f-mount lens that I got several years ago. It flares badly. It's heavy and takes up quite a bit of space in my camera bag. As such, I almost never carry it with me. If I plan for something ultra-wide, I will specifically take it, but it mostly collects dust.\n\nPart of it is the size, weight and er. \"characteristics\".  The other problem is I simply don't \"see\" in ultra-wide-angle. I'm good up to about 20mm. I can envision those photos and I can make fairly good use of the focal length, but for the most part I don't really want to go much past 24mm. On the other hand I \"see\" in telephoto. I like focusing in on the subject. I love to fill the frame. I love macro to get close details. My mind simply doesn't want to wrap around the concept of make everything look so far away.\n\nhttps://preview.redd.it/87mj8tp3ine71.jpg?width=4024&amp;format=pjpg&amp;auto=webp&amp;s=ad69e13da0c22d14ac1b9466703bf75bb8be6442\n\nThe Z 14-35mm f/4 certainly meets the criteria of small and light. I still haven't figured out a good place to put it in my bag. I will probably take my 60mm macro out since I mostly use that in studio settings and rarely outside of the house. Like the Z 24-70 f/4, to maintain its compactness it has a \"locked\" off position that you have to rotate the zoom ring to the 14mm position before you can shoot it. Oddly, 14mm is the longest length on the lens, 30mm is its more compact setting. \n\nIt has a very similar build to the Z 24-70 f/4. Both are S-line lenses so it feels well built, but neither are at the level of the Z 70-200 f/2.8 S. Looking through the viewfinder things are clear and bright. Saving over $300 from retail with the referb certainly helped me justify a focal length I struggle with.\n\nSomewhere in my head, I thought \"If I have a lens small enough to carry with me more often, I'll find more opportunities to use it.\" \n\nSo today, I walked out of my home with a Z 6II and the 14-30mm f/4 lens in hand. I promised myself that I absolutely would not take anything else with me. But as I was getting ready, I grabbed the full kit, complete with my D500 \"just in case\" I decided to visit a lake and do some wildlife work while I was out.\n\n[Z 14-30mm f\\/4 at 14mm](https://preview.redd.it/qe9nl504hne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=79b690cebf883b100a86ab247921368ed14886c5)\n\nIt all started harmless enough. I visited a popular sunflower field. Then I headed to a small \"one block\" big park downtown, and finally to the local arboretum. Only the 14-30 was used until I got to the arboretum. I walked it with the ultra-wide but I just kept seeing \"ooh that would be great with my telephoto\" and \"ooh there are a lot of bees on flowers is great \"light\". I failed myself. I headed back to the car, dumped the wide-angle. Put a 500mm PF on the Z 5II and a 105mm macro on the D500 and went back.\n\nI failed myself. Enjoy a macro shot from my failures...\n\n[Nikon D500 + AF-S 105mm f\\/2.8G Micro -- Yes, I cheated and went with comfortable. \\*\\*NOT an Ultra-Wide-Angle\\*\\*](https://preview.redd.it/zftxonfchne71.jpg?width=2974&amp;format=pjpg&amp;auto=webp&amp;s=0211cf915f4d5727163e328897acd724db0c8d4e)\n\nAnyway, you've read this far, I should get back to the actual lens. \n\nUltra-wide-angle lenses have a ton of depth of field by their nature. You can easily find a hyperfocal distance that will have from a few feet all the way to infinity in focus without much effort. This means that you should be able to manually focus with UWA lenses quite well. Like a fool, I depended on the camera to focus for me. That meant I focused close a lot and found I didn't have as much DOF as I expected towards infinity. That was cool, because I actually liked blurring the background in these shots. As much as I have a hard time understanding why at 14mm you would want to shoot at f/2.8 when not shooting the Milky Way, I think I understand now.\n\n[You can see the weird \\\\\"bokeh\\\\\" distortion along the edges in the defocused areas.](https://preview.redd.it/fwszvz1ihne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=6c8236b955ab75e574d6be2bc55babfb334652ae)\n\nI don't know if it's normal but my \"bokeh\" has a weird quality to it. It kinda looks like a lot of distortion. I wasn't expecting the lens to have a lot based on other photos I've seen and reviews I've read. Maybe it's the subject matter. Maybe it's the angle I'm shooting at, but the edges seem quite odd.\n\nBut in other photos, I took it looks fine. Boy, do I have a lot to learn about this type of shooting.\n\n[Bee Hotel - Z 14-30mm f\\/4 at 14mm f\\/8. My intent was to make the long tubes look like they were sticking out quite a bit more. I was just a few inches away.](https://preview.redd.it/u3h5l25phne71.jpg?width=5911&amp;format=pjpg&amp;auto=webp&amp;s=39862767032253d06e202772b6c579302874ad2e)\n\nThe color and contrast of the lens is quite good. The in-focus areas are quite sharp. \n\n[Not much distortion here - 14mm f\\/8](https://preview.redd.it/69u9uk1whne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=8204cfb58a739f96e305d2d65031d01418790ca9)\n\nI just need to find more situations where this focal length makes sense and I need to force myself to use it and not depend on my trusted lenses.\n\nFor those who are successful at ultra-wide-angles, my hats of to you. It's a challenging world for certain. I'm glad I added this to my kit. As photographers we should always be trying to grow and challenge ourselves in areas were we weak.\n\nIf you have suggestions on how I can better use this lens (or encourage others who struggle with this focal length) and see better, please leave a comment below.", "link": "https://www.reddit.com/r/Nikon/comments/ovjebv/nikon_z_1430mm_f4s_minireview/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon z 14-30mm f/4s mini-review /!/ i picked up a refurbished nikon z 14-30mm f/4  from nikonusa this week. previous to this, i had (well still do have) a tokina 16-28mm f/2.8 cheap f-mount lens that i got several years ago. it flares badly. it's heavy and takes up quite a bit of space in my camera bag. as such, i almost never carry it with me. if i plan for something ultra-wide, i will specifically take it, but it mostly collects dust.\n\npart of it is the size, weight and er. \"characteristics\".  the other problem is i simply don't \"see\" in ultra-wide-angle. i'm good up to about 20mm. i can envision those photos and i can make fairly good use of the focal length, but for the most part i don't really want to go much past 24mm. on the other hand i \"see\" in telephoto. i like focusing in on the subject. i love to fill the frame. i love macro to get close details. my mind simply doesn't want to wrap around the concept of make everything look so far away.\n\nhttps://preview.redd.it/87mj8tp3ine71.jpg?width=4024&amp;format=pjpg&amp;auto=webp&amp;s=ad69e13da0c22d14ac1b9466703bf75bb8be6442\n\nthe z 14-35mm f/4 certainly meets the criteria of small and light. i still haven't figured out a good place to put it in my bag. i will probably take my 60mm macro out since i mostly use that in studio settings and rarely outside of the house. like the z 24-70 f/4, to maintain its compactness it has a \"locked\" off -----> position !!!  that you have to rotate the zoom ring to the 14mm -----> position !!!  before you can shoot it. oddly, 14mm is the longest length on the lens, 30mm is its more compact setting. \n\nit has a very similar build to the z 24-70 f/4. both are s-line lenses so it feels well built, but neither are at the level of the z 70-200 f/2.8 s. looking through the viewfinder things are clear and bright. saving over $300 from retail with the referb certainly helped me justify a focal length i struggle with.\n\nsomewhere in my head, i thought \"if i have a lens small enough to carry with me more often, i'll find more opportunities to use it.\" \n\nso today, i walked out of my home with a z 6ii and the 14-30mm f/4 lens in hand. i promised myself that i absolutely would not take anything else with me. but as i was getting ready, i grabbed the full kit, complete with my d500 \"just in case\" i decided to visit a lake and do some wildlife work while i was out.\n\n[z 14-30mm f\\/4 at 14mm](https://preview.redd.it/qe9nl504hne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=79b690cebf883b100a86ab247921368ed14886c5)\n\nit all started harmless enough. i visited a popular sunflower field. then i headed to a small \"one block\" big park downtown, and finally to the local arboretum. only the 14-30 was used until i got to the arboretum. i walked it with the ultra-wide but i just kept seeing \"ooh that would be great with my telephoto\" and \"ooh there are a lot of bees on flowers is great \"light\". i failed myself. i headed back to the car, dumped the wide-angle. put a 500mm pf on the z 5ii and a 105mm macro on the d500 and went back.\n\ni failed myself. enjoy a macro shot from my failures...\n\n[nikon d500 + af-s 105mm f\\/2.8g micro -- yes, i cheated and went with comfortable. \\*\\*not an ultra-wide-angle\\*\\*](https://preview.redd.it/zftxonfchne71.jpg?width=2974&amp;format=pjpg&amp;auto=webp&amp;s=0211cf915f4d5727163e328897acd724db0c8d4e)\n\nanyway, you've read this far, i should get back to the actual lens. \n\nultra-wide-angle lenses have a ton of depth of field by their nature. you can easily find a hyperfocal distance that will have from a few feet all the way to infinity in focus without much effort. this means that you should be able to manually focus with uwa lenses quite well. like a fool, i depended on the camera to focus for me. that meant i focused close a lot and found i didn't have as much dof as i expected towards infinity. that was cool, because i actually liked blurring the background in these shots. as much as i have a hard time understanding why at 14mm you would want to shoot at f/2.8 when not shooting the milky way, i think i understand now.\n\n[you can see the weird \\\\\"bokeh\\\\\" distortion along the edges in the defocused areas.](https://preview.redd.it/fwszvz1ihne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=6c8236b955ab75e574d6be2bc55babfb334652ae)\n\ni don't know if it's normal but my \"bokeh\" has a weird quality to it. it kinda looks like a lot of distortion. i wasn't expecting the lens to have a lot based on other photos i've seen and reviews i've read. maybe it's the subject matter. maybe it's the angle i'm shooting at, but the edges seem quite odd.\n\nbut in other photos, i took it looks fine. boy, do i have a lot to learn about this type of shooting.\n\n[bee hotel - z 14-30mm f\\/4 at 14mm f\\/8. my intent was to make the long tubes look like they were sticking out quite a bit more. i was just a few inches away.](https://preview.redd.it/u3h5l25phne71.jpg?width=5911&amp;format=pjpg&amp;auto=webp&amp;s=39862767032253d06e202772b6c579302874ad2e)\n\nthe color and contrast of the lens is quite good. the in-focus areas are quite sharp. \n\n[not much distortion here - 14mm f\\/8](https://preview.redd.it/69u9uk1whne71.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=8204cfb58a739f96e305d2d65031d01418790ca9)\n\ni just need to find more situations where this focal length makes sense and i need to force myself to use it and not depend on my trusted lenses.\n\nfor those who are successful at ultra-wide-angles, my hats of to you. it's a challenging world for certain. i'm glad i added this to my kit. as photographers we should always be trying to grow and challenge ourselves in areas were we weak.\n\nif you have suggestions on how i can better use this lens (or encourage others who struggle with this focal length) and see better, please leave a comment below.", "sortedWord": "None", "identifyer": 46247, "year": "2021"}, {"Unnamed: 0": 156669, "autor": "thisboyisanalog", "date": 1628828467000, "content": "Nikon FE mirror stuck in up position. /!/ Hi all, I’m looking at my first Nikon and got my hands on the seller’s camera. \n\nThe FE looks in great condition but the shutter wouldn’t fire nor would the advance lever move past the ‘pre-cocked’ position. Checked it at M90 but still no luck. The mirror moves with the lever to the side of the lens mount but won’t revert to the down position to fire a shot. How big/bad a problem is this?", "link": "https://www.reddit.com/r/Nikon/comments/p3g7a7/nikon_fe_mirror_stuck_in_up_position/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fe mirror stuck in up -----> position !!! . /!/ hi all, i’m looking at my first nikon and got my hands on the seller’s camera. \n\nthe fe looks in great condition but the shutter wouldn’t fire nor would the advance lever move past the ‘pre-cocked’ position. checked it at m90 but still no luck. the mirror moves with the lever to the side of the lens mount but won’t revert to the down position to fire a shot. how big/bad a problem is this?", "sortedWord": "None", "identifyer": 48191, "year": "2021"}, {"Unnamed: 0": 157098, "autor": "r_golan_trevize", "date": 1635444467000, "content": "Nikon DSLR Video Features Matrix /!/ I started a video project recently and needed a second camera to go with my D7200 and horse traded my way into a D3200 only to discover that while it takes fabulous stills, the video quality kind of stinks (it flickers badly in shadows, even in sunlight, and it has a lot of noise even at lower ISOs). That led me to doing some research into which Nikon bodies can do what as I targeted another body to look for and that led to this which I hope someone else will also find helpful:\n\n[Nikon DSLR Video Features Matrix](https://docs.google.com/spreadsheets/d/1-3cV0vVDR9rToghAxx8bYQWhYd9IFuNb8gEfuSwerY0/edit#gid=0)\n\n(*Prices are a combination of KEH and MPB as of a couple of weeks ago*)\n\nI managed to turn the D3200 into a D3400 and am very pleased with that little guy.\n\nMy criteria for this was strictly video so most of these columns are related to video. They all take fantastic photos, especially any of the older 16/24mp bodies for those on a budget. The stills from the D3200 are only barely behind my D7200 and I would whole heartedly recommend that body for shooting stills, especially for a beginner on a tight budget - seriously, it's marvelous. My requirements for video are different though.\n\nI'm shooting an ongoing interview project so I'm looking for something that shoots at least 1080/30p for up to 30 minutes at a time and it must have a manual exposure mode for video (I was slightly stunned to find that some early bodies don't), Your requirements may differ and if so, you can ignore my recommendations and pick whichever suits you. A few thoughts on features:\n\n* I really like a dedicated/assignable ISO button. Combined with manual lenses, changing aperture and ISO are easy and quick when setting up - no menus,\n* Live view histograms are really great but you need at least a D7200 to get that. I can meter with the D7200 though and transfer those settings to my B-cam. Otherwise, shoot a still and inspect the histogram.\n* Virtual horizon is nice but that's D7000+\n* 1/3 step ISO adjustments is nice as it gives you more fine tuning of exposure control (especially if you're using manual lenses with 1 stop aperture positions). D5200+\n* flat profile is another nice feature (D3400/5500/7200/750/810+) but you can make/import your own. I decided to use a built in profile anyway because I don't feel like grading it.\n* I'm using an external audio recorder so I'm not worried about mic inputs and my D7200 has one anyway if I needed it but that's something to remember as those were removed from the D3400 and D3500\n\nThe TL/DR:\n\nCameras to outright avoid, mainly because they don't have a manual exposure mode in movie mode and are also so old as to be lacking in other important features: D3100, D5000/5100, D90\n\nCameras to seriously consider: D3400, D5500, D5600, D7200, D7500, D500, D750, D780, D810, D850 - get whichever fits your budget and don't worry about it (although mirrorless may make more sense as you get into the higher end of this list - see below).\n\nBest of the bunch if you have the budget: D7500, D500, D780, D850 with the D780 being a standout with its on sensor phase detect autofocus and tilt screen.\n\nAnything not in those lists is meh (to me) for one minor reason or another but mostly good aside from the D3200's flickering/noise issues and the D7000's more limited resolution options.\n\nI didn't get to the single digit name pro bodies. I think people who may be trying to figure out the subtle difference between features on a D3300, D3400 and D3500 are unlikely to be looking at those but I may eventually fill those in. If you're looking at bodies that expensive mainly for video with your collection of F-mount glass, a Z camera or even another brand of mirrorless with an adapter may make more sense. If I were spending real money on this project, I'd probably be looking at one of the Sony A6X00 series bodies that has unlimited recording time and has built in focus peaking and stuff like that but this is a personal project and labor of love so I'm scraping by on scraps and leveraging what I already have to the max and that D3400 is looking like a champ right now, especially since I have basically nothing in it.", "link": "https://www.reddit.com/r/Nikon/comments/qhsw2u/nikon_dslr_video_features_matrix/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "nikon dslr video features matrix /!/ i started a video project recently and needed a second camera to go with my d7200 and horse traded my way into a d3200 only to discover that while it takes fabulous stills, the video quality kind of stinks (it flickers badly in shadows, even in sunlight, and it has a lot of noise even at lower isos). that led me to doing some research into which nikon bodies can do what as i targeted another body to look for and that led to this which i hope someone else will also find helpful:\n\n[nikon dslr video features matrix](https://docs.google.com/spreadsheets/d/1-3cv0vvdr9rtoghaxx8byqwhyd9ifunb8gefuswery0/edit#gid=0)\n\n(*prices are a combination of keh and mpb as of a couple of weeks ago*)\n\ni managed to turn the d3200 into a d3400 and am very pleased with that little guy.\n\nmy criteria for this was strictly video so most of these columns are related to video. they all take fantastic photos, especially any of the older 16/24mp bodies for those on a budget. the stills from the d3200 are only barely behind my d7200 and i would whole heartedly recommend that body for shooting stills, especially for a beginner on a tight budget - seriously, it's marvelous. my requirements for video are different though.\n\ni'm shooting an ongoing interview project so i'm looking for something that shoots at least 1080/30p for up to 30 minutes at a time and it must have a manual exposure mode for video (i was slightly stunned to find that some early bodies don't), your requirements may differ and if so, you can ignore my recommendations and pick whichever suits you. a few thoughts on features:\n\n* i really like a dedicated/assignable iso button. combined with manual lenses, changing aperture and iso are easy and quick when setting up - no menus,\n* live view histograms are really great but you need at least a d7200 to get that. i can meter with the d7200 though and transfer those settings to my b-cam. otherwise, shoot a still and inspect the histogram.\n* virtual horizon is nice but that's d7000+\n* 1/3 step iso adjustments is nice as it gives you more fine tuning of exposure control (especially if you're using manual lenses with 1 stop aperture -----> positions !!! ). d5200+\n* flat profile is another nice feature (d3400/5500/7200/750/810+) but you can make/import your own. i decided to use a built in profile anyway because i don't feel like grading it.\n* i'm using an external audio recorder so i'm not worried about mic inputs and my d7200 has one anyway if i needed it but that's something to remember as those were removed from the d3400 and d3500\n\nthe tl/dr:\n\ncameras to outright avoid, mainly because they don't have a manual exposure mode in movie mode and are also so old as to be lacking in other important features: d3100, d5000/5100, d90\n\ncameras to seriously consider: d3400, d5500, d5600, d7200, d7500, d500, d750, d780, d810, d850 - get whichever fits your budget and don't worry about it (although mirrorless may make more sense as you get into the higher end of this list - see below).\n\nbest of the bunch if you have the budget: d7500, d500, d780, d850 with the d780 being a standout with its on sensor phase detect autofocus and tilt screen.\n\nanything not in those lists is meh (to me) for one minor reason or another but mostly good aside from the d3200's flickering/noise issues and the d7000's more limited resolution options.\n\ni didn't get to the single digit name pro bodies. i think people who may be trying to figure out the subtle difference between features on a d3300, d3400 and d3500 are unlikely to be looking at those but i may eventually fill those in. if you're looking at bodies that expensive mainly for video with your collection of f-mount glass, a z camera or even another brand of mirrorless with an adapter may make more sense. if i were spending real money on this project, i'd probably be looking at one of the sony a6x00 series bodies that has unlimited recording time and has built in focus peaking and stuff like that but this is a personal project and labor of love so i'm scraping by on scraps and leveraging what i already have to the max and that d3400 is looking like a champ right now, especially since i have basically nothing in it.", "sortedWord": "None", "identifyer": 48636, "year": "2021"}, {"Unnamed: 0": 157269, "autor": "bosunphil", "date": 1622391619000, "content": "D7500 can’t read SD cards - card NOT in locker position /!/ I think it’s time I accept I’ll have to send it in for a service, but I just thought I’d check here before I spend a bunch of money. My D7500 was sitting in my closet for months during lockdown, and I finally felt inspired to get back out and do some photography again. However, it is no longer reading SD cards. The camera worked great before I put it away.\n\nI’ve tried resetting by holding both “green dot” buttons. I’ve tried removing the battery, lens and SD card for 30+ seconds. I have tried using multiple different SD cards, all of which have the same issue, but work fine in another camera or on the computer.\n\nI have no idea how this happened, but the last time I took my SD card out of the slot, the switch was broken. This leads me to believe something is askew inside, and perhaps there’s some kind of dust material inside causing trouble. I’ve used a squeeze blower (for sensor cleaning) in the SD card with no luck.\n\nIs there anything else to try or is it just time to send it in? Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/noeknb/d7500_cant_read_sd_cards_card_not_in_locker/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d7500 can’t read sd cards - card not in locker -----> position !!!  /!/ i think it’s time i accept i’ll have to send it in for a service, but i just thought i’d check here before i spend a bunch of money. my d7500 was sitting in my closet for months during lockdown, and i finally felt inspired to get back out and do some photography again. however, it is no longer reading sd cards. the camera worked great before i put it away.\n\ni’ve tried resetting by holding both “green dot” buttons. i’ve tried removing the battery, lens and sd card for 30+ seconds. i have tried using multiple different sd cards, all of which have the same issue, but work fine in another camera or on the computer.\n\ni have no idea how this happened, but the last time i took my sd card out of the slot, the switch was broken. this leads me to believe something is askew inside, and perhaps there’s some kind of dust material inside causing trouble. i’ve used a squeeze blower (for sensor cleaning) in the sd card with no luck.\n\nis there anything else to try or is it just time to send it in? thanks!", "sortedWord": "None", "identifyer": 48814, "year": "2021"}, {"Unnamed: 0": 157309, "autor": "TVDfan29", "date": 1622301874000, "content": "Is there anyway to remotely take a pictures with my Nikon DX VR? /!/ Hey!\n\nCamera: Nikon DX VR that I bought new in 2015, condition good\n\nI want to be able to take self portraits/photos with friends without needing an extra person to take the photo. Are there any extras for my camera I can buy to be able to press a button or something so that I can take multiple photos? I've used the timer function but it's annoying to get into position then run back to see if the photo went alright and have to run back and forth. Do I need to get a new camera or is there anything I can do? \n\nIf you can also suggest an inexpensive tripod that would be amazing as well but that's an easier feat to find. \n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/Nikon/comments/nnppnk/is_there_anyway_to_remotely_take_a_pictures_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is there anyway to remotely take a pictures with my nikon dx vr? /!/ hey!\n\ncamera: nikon dx vr that i bought new in 2015, condition good\n\ni want to be able to take self portraits/photos with friends without needing an extra person to take the photo. are there any extras for my camera i can buy to be able to press a button or something so that i can take multiple photos? i've used the timer function but it's annoying to get into -----> position !!!  then run back to see if the photo went alright and have to run back and forth. do i need to get a new camera or is there anything i can do? \n\nif you can also suggest an inexpensive tripod that would be amazing as well but that's an easier feat to find. \n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 48859, "year": "2021"}, {"Unnamed: 0": 157417, "autor": "4Beast", "date": 1612357948000, "content": "How do I apply rule of thirds on nikon d7200? /!/ So I never really used the rule of thirds before, you know this thing is sometimes an argument in photography, some people live by it and some don't. I positioned objects how I pleased and how I thought it looked the best. Pleasse don't start a war in the comments lecturing me how this rule is bs and then others saying it's not. So after doing some research I have found that some focus points are roughly positioned on the line intersections. But how do I display all focus points so I know which one is the right and select it? Viewfinder currently shows only the focus point that is selected.", "link": "https://www.reddit.com/r/Nikon/comments/lbn7wh/how_do_i_apply_rule_of_thirds_on_nikon_d7200/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "how do i apply rule of thirds on nikon d7200? /!/ so i never really used the rule of thirds before, you know this thing is sometimes an argument in photography, some people live by it and some don't. i -----> positioned !!!  objects how i pleased and how i thought it looked the best. pleasse don't start a war in the comments lecturing me how this rule is bs and then others saying it's not. so after doing some research i have found that some focus points are roughly positioned on the line intersections. but how do i display all focus points so i know which one is the right and select it? viewfinder currently shows only the focus point that is selected.", "sortedWord": "None", "identifyer": 48971, "year": "2021"}, {"Unnamed: 0": 157944, "autor": "gisthrowaway124", "date": 1615994309000, "content": "Upgrading from D3400 to.... /!/ Hi all,\n\nLuckily I'm in a financial position to use my sweet sweet stimmy check for something fun instead of YOLO'ing it into $GME, which is much needed after a stressful year. So, with spring around the corner, and a few road trips planned, I'm getting an itch to upgrade my camera. I enjoy landscape photography the most with some astrophotography mixed in there as well. I have the 1,400$ stim check and about 500$ in amazon points thanks to saving up points on my CC for a over a year, and I'd be willing to throw a few hundred dollars in as well so let say 2,000-2,200$ in spending power. Thoughts and considerations on upgrading from 3400 to either a D5600 + Glass, D7500 + Glass, or a D500 and hold off on glass. I have a few lenses now I like, rokinon 14mm and a nikkor 10-20mm. Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/m72q9j/upgrading_from_d3400_to/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrading from d3400 to.... /!/ hi all,\n\nluckily i'm in a financial -----> position !!!  to use my sweet sweet stimmy check for something fun instead of yolo'ing it into $gme, which is much needed after a stressful year. so, with spring around the corner, and a few road trips planned, i'm getting an itch to upgrade my camera. i enjoy landscape photography the most with some astrophotography mixed in there as well. i have the 1,400$ stim check and about 500$ in amazon points thanks to saving up points on my cc for a over a year, and i'd be willing to throw a few hundred dollars in as well so let say 2,000-2,200$ in spending power. thoughts and considerations on upgrading from 3400 to either a d5600 + glass, d7500 + glass, or a d500 and hold off on glass. i have a few lenses now i like, rokinon 14mm and a nikkor 10-20mm. thanks!", "sortedWord": "None", "identifyer": 49525, "year": "2021"}, {"Unnamed: 0": 158172, "autor": "throwaway30903080", "date": 1625685369000, "content": "Help figure out what this White dot is on pictures from D7200 /!/ I am seeing white dot in most of my pictures on my D7200. Doesn't matter if the light source is in the frame or not. I have changed multiple lenses but the white-dot is always in the same position. It however changes in size as I change f-stop in the camera. The lenses I tried are 17-55 2.8, 50 1.8d, 85 1.8G, 70-200 2.8.\n\nPlease check the attached pictures. Any help to debug the issue is appreciated.\n\nI have cleaned out my sensor 4 times, (two wet swabs &amp; two dry swabs), but it didn't help fix the problem. There is nothing between sensor and the lens, camera is very clean and it is mostly used inside.", "link": "https://www.reddit.com/r/Nikon/comments/ofpxgj/help_figure_out_what_this_white_dot_is_on/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help figure out what this white dot is on pictures from d7200 /!/ i am seeing white dot in most of my pictures on my d7200. doesn't matter if the light source is in the frame or not. i have changed multiple lenses but the white-dot is always in the same -----> position !!! . it however changes in size as i change f-stop in the camera. the lenses i tried are 17-55 2.8, 50 1.8d, 85 1.8g, 70-200 2.8.\n\nplease check the attached pictures. any help to debug the issue is appreciated.\n\ni have cleaned out my sensor 4 times, (two wet swabs &amp; two dry swabs), but it didn't help fix the problem. there is nothing between sensor and the lens, camera is very clean and it is mostly used inside.", "sortedWord": "None", "identifyer": 49767, "year": "2021"}, {"Unnamed: 0": 159386, "autor": "TheNaturalPhenomenon", "date": 1618892240000, "content": "Fell with my Nikon Z50 and splashed it with water /!/ Saturday was a pretty bad day for me. I bought the Nikon z50 almost 3 months ago. Love it to death, but Saturday I felt into some water missing a step taking a photo of my dog. How I landed trying to protect the camera ended up splashing it with water. It currently won't turn on either screen. I hear the sensor and the camera turn on, but nothing else.\n\nAfter I got it wet I dried it with a dry cloth and positioned it to air dry before removing the lens. I then put it in rice over night. Where did I go wrong trying to get it dry?\n\nAlso anyone have experience with new leaf? I bought the accidental plan and I'm hoping they don't decline me.", "link": "https://www.reddit.com/r/Nikon/comments/muifxn/fell_with_my_nikon_z50_and_splashed_it_with_water/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "fell with my nikon z50 and splashed it with water /!/ saturday was a pretty bad day for me. i bought the nikon z50 almost 3 months ago. love it to death, but saturday i felt into some water missing a step taking a photo of my dog. how i landed trying to protect the camera ended up splashing it with water. it currently won't turn on either screen. i hear the sensor and the camera turn on, but nothing else.\n\nafter i got it wet i dried it with a dry cloth and -----> positioned !!!  it to air dry before removing the lens. i then put it in rice over night. where did i go wrong trying to get it dry?\n\nalso anyone have experience with new leaf? i bought the accidental plan and i'm hoping they don't decline me.", "sortedWord": "None", "identifyer": 51038, "year": "2021"}, {"Unnamed: 0": 159948, "autor": "acherion", "date": 1619412638000, "content": "New Z7 II, Z6 II, Z7, Z6, Z5 and Z50 firmware updates available from Nikon /!/ Get em while they're hot! Download from the links below:\n\n[Z7 II firmware v1.20](https://downloadcenter.nikonimglib.com/en/download/fw/403.html)\n\n* Improved live view focus-point display response during face/eye-detection and subject-tracking AF.\n* Improved the performance of face/eye-detection AF and subject visibility with optional flash units.\n* Improved low-light autofocus detection times at a Focus mode setting of Single AF.\n* Fixed the following issues:\n   * Selecting Focus for Custom Setting a1 (AF-C priority selection) would sometimes slow shutter response.\n   * Focus accuracy was sometimes unreliable.\n   * Using custom Picture Controls created with Manage Picture Control when recording movies at a frame size/rate of 3840 x 2160 (4K UHD); 60p or 50p would sometimes produce unexpected results.\n\n[Z6 II firmware v1.20](https://downloadcenter.nikonimglib.com/en/download/fw/404.html)\n\n* Improved live view focus-point display response during face/eye-detection and subject-tracking AF.\n* Improved the performance of face/eye-detection AF and subject visibility with optional flash units.\n* Improved low-light autofocus detection times at a Focus mode setting of Single AF.\n* Fixed the following issues:\n   * Selecting Focus for Custom Setting a1 (AF-C priority selection) would sometimes slow shutter response.\n   * Focus accuracy was sometimes unreliable.\n   * Using custom Picture Controls created with Manage Picture Control when recording movies at a frame size/rate of 3840 x 2160 (4K UHD); 60p or 50p would sometimes produce unexpected results.\n\n[Z7 firmware v3.30](https://downloadcenter.nikonimglib.com/en/download/fw/399.html)\n\n* A Save focus position option has been added to the SETUP MENU. If On is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. This option applies only when the camera is used with Z mount autofocus lenses.\n* Fixed an issue that would sometimes cause the camera to stop responding when time-lapse movie recording was interrupted.\n\n[Z6 firmware v3.30](https://downloadcenter.nikonimglib.com/en/download/fw/400.html)\n\n* A Save focus position option has been added to the SETUP MENU. If On is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. This option applies only when the camera is used with Z mount autofocus lenses.\n* A Voice memo option has been added to the roles that can be assigned to the Movie record button via Custom Setting f2 (Custom control assignment). In the Voice memo role, the movie-record button can be used to record and play voice memos up to about 60 seconds long while a picture is displayed.\n* Fixed an issue that would sometimes cause the camera to stop responding when time-lapse movie recording was interrupted.\n\n[Z5 firmware v1.10](https://downloadcenter.nikonimglib.com/en/download/fw/401.html)\n\n* A Save focus position option has been added to the SETUP MENU. If On is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. This option applies only when the camera is used with Z mount autofocus lenses.\n* Improved low-light autofocus detection times for Custom Setting a11 (Low-light AF).\n\n[Z50 firmware v2.10](https://downloadcenter.nikonimglib.com/en/download/fw/402.html)\n\n* A Save focus position option has been added to the SETUP MENU. If On is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. This option applies only when the camera is used with Z mount autofocus lenses.\n* Fixed an issue that resulted in the option selected for Custom Setting a2 (Auto-area AF face/eye detection) in P, S, A, and M modes being reset whenever Custom Settings for mode U1 or U2 were reset.", "link": "https://www.reddit.com/r/Nikon/comments/mypvrw/new_z7_ii_z6_ii_z7_z6_z5_and_z50_firmware_updates/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new z7 ii, z6 ii, z7, z6, z5 and z50 firmware updates available from nikon /!/ get em while they're hot! download from the links below:\n\n[z7 ii firmware v1.20](https://downloadcenter.nikonimglib.com/en/download/fw/403.html)\n\n* improved live view focus-point display response during face/eye-detection and subject-tracking af.\n* improved the performance of face/eye-detection af and subject visibility with optional flash units.\n* improved low-light autofocus detection times at a focus mode setting of single af.\n* fixed the following issues:\n   * selecting focus for custom setting a1 (af-c priority selection) would sometimes slow shutter response.\n   * focus accuracy was sometimes unreliable.\n   * using custom picture controls created with manage picture control when recording movies at a frame size/rate of 3840 x 2160 (4k uhd); 60p or 50p would sometimes produce unexpected results.\n\n[z6 ii firmware v1.20](https://downloadcenter.nikonimglib.com/en/download/fw/404.html)\n\n* improved live view focus-point display response during face/eye-detection and subject-tracking af.\n* improved the performance of face/eye-detection af and subject visibility with optional flash units.\n* improved low-light autofocus detection times at a focus mode setting of single af.\n* fixed the following issues:\n   * selecting focus for custom setting a1 (af-c priority selection) would sometimes slow shutter response.\n   * focus accuracy was sometimes unreliable.\n   * using custom picture controls created with manage picture control when recording movies at a frame size/rate of 3840 x 2160 (4k uhd); 60p or 50p would sometimes produce unexpected results.\n\n[z7 firmware v3.30](https://downloadcenter.nikonimglib.com/en/download/fw/399.html)\n\n* a save focus -----> position !!!  option has been added to the setup menu. if on is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. this option applies only when the camera is used with z mount autofocus lenses.\n* fixed an issue that would sometimes cause the camera to stop responding when time-lapse movie recording was interrupted.\n\n[z6 firmware v3.30](https://downloadcenter.nikonimglib.com/en/download/fw/400.html)\n\n* a save focus position option has been added to the setup menu. if on is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. this option applies only when the camera is used with z mount autofocus lenses.\n* a voice memo option has been added to the roles that can be assigned to the movie record button via custom setting f2 (custom control assignment). in the voice memo role, the movie-record button can be used to record and play voice memos up to about 60 seconds long while a picture is displayed.\n* fixed an issue that would sometimes cause the camera to stop responding when time-lapse movie recording was interrupted.\n\n[z5 firmware v1.10](https://downloadcenter.nikonimglib.com/en/download/fw/401.html)\n\n* a save focus position option has been added to the setup menu. if on is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. this option applies only when the camera is used with z mount autofocus lenses.\n* improved low-light autofocus detection times for custom setting a11 (low-light af).\n\n[z50 firmware v2.10](https://downloadcenter.nikonimglib.com/en/download/fw/402.html)\n\n* a save focus position option has been added to the setup menu. if on is selected, the focus position in effect when the camera is turned off will be restored when the camera is next turned on. this option applies only when the camera is used with z mount autofocus lenses.\n* fixed an issue that resulted in the option selected for custom setting a2 (auto-area af face/eye detection) in p, s, a, and m modes being reset whenever custom settings for mode u1 or u2 were reset.", "sortedWord": "None", "identifyer": 51636, "year": "2021"}, {"Unnamed: 0": 159974, "autor": "cg-lucas", "date": 1632066474000, "content": "Coolpix L810 - Please help! /!/ Hello, everyone.\n\nI have a Coolpix L810, and it has been with me for many years. I've always used it with care, without letting it fall and always using the appropriate batteries. Never had any issue with it. I've stopped using it for more than 1 year, having stored it without the batteries, keeping the lens protected.  \n\n\nThe thing is: I tried using it this week to take some pictures again, but it wouldn't turn on! When I try to turn it on, it does a \"clicking\" sound, the lens doesn't protract as it should and the flash LED immediately starts flashing with a red light, along with the front LED and the green on/off button, for some seconds. The picture below -- taken from my smartphone camera -- shows what happens.  \n\n\nI've tried researching on the internet and do light troubleshooting and tests. The battery contacts are clean and the lens doesn't seem to be dislocated or with any object or dirt -- at least superficially. I've also tried turning it on at various positions, as it seemed like the lens were stuck -- following the instructions from the scarce web pages I've found that mention solutions for this kind of problem. I've tried removing the SD card and turning it on without it, too, as well as trying to turn it on with the AV Cable connected, trying to induce a factory reset from numerous key combinations and even adding the newest firmware installation file in the SD card, in the hope of triggering any routine that precedes the lens protraction when turning it on.\n\n&amp;#x200B;\n\nHas anyone experienced/solved this issue? Could you please help me figure out if this camera still has a salvation?  \n\n\nThanks in advance.\n\nhttps://preview.redd.it/v8pok0iiaho71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=6018f1ffed8afb18fe8d2fa7ac18aeba38eebf1a", "link": "https://www.reddit.com/r/Nikon/comments/praezc/coolpix_l810_please_help/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "coolpix l810 - please help! /!/ hello, everyone.\n\ni have a coolpix l810, and it has been with me for many years. i've always used it with care, without letting it fall and always using the appropriate batteries. never had any issue with it. i've stopped using it for more than 1 year, having stored it without the batteries, keeping the lens protected.  \n\n\nthe thing is: i tried using it this week to take some pictures again, but it wouldn't turn on! when i try to turn it on, it does a \"clicking\" sound, the lens doesn't protract as it should and the flash led immediately starts flashing with a red light, along with the front led and the green on/off button, for some seconds. the picture below -- taken from my smartphone camera -- shows what happens.  \n\n\ni've tried researching on the internet and do light troubleshooting and tests. the battery contacts are clean and the lens doesn't seem to be dislocated or with any object or dirt -- at least superficially. i've also tried turning it on at various -----> positions !!! , as it seemed like the lens were stuck -- following the instructions from the scarce web pages i've found that mention solutions for this kind of problem. i've tried removing the sd card and turning it on without it, too, as well as trying to turn it on with the av cable connected, trying to induce a factory reset from numerous key combinations and even adding the newest firmware installation file in the sd card, in the hope of triggering any routine that precedes the lens protraction when turning it on.\n\n&amp;#x200b;\n\nhas anyone experienced/solved this issue? could you please help me figure out if this camera still has a salvation?  \n\n\nthanks in advance.\n\nhttps://preview.redd.it/v8pok0iiaho71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=6018f1ffed8afb18fe8d2fa7ac18aeba38eebf1a", "sortedWord": "None", "identifyer": 51664, "year": "2021"}, {"Unnamed: 0": 160558, "autor": "AJZullu", "date": 1622139382000, "content": "whats up with the Z 70-200 zoom/focus ring being switched positions? /!/ Just wondering and sorry im sure this has been talked about a lot but what's the situation with this lens and why did Nikon do it this way?   \n\n\nthen all other lens are not designed in that way.", "link": "https://www.reddit.com/r/Nikon/comments/nmdrn1/whats_up_with_the_z_70200_zoomfocus_ring_being/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "whats up with the z 70-200 zoom/focus ring being switched -----> positions !!! ? /!/ just wondering and sorry im sure this has been talked about a lot but what's the situation with this lens and why did nikon do it this way?   \n\n\nthen all other lens are not designed in that way.", "sortedWord": "None", "identifyer": 52267, "year": "2021"}, {"Unnamed: 0": 160883, "autor": "EuphoricDiver1", "date": 1635140775000, "content": "New D5600w2x lenses or Used D7100 and D7500w /!/ I'm fairly new to photography, having bought my first camera, a Lumix Fz80, only a couple of months ago. I've instantly fallen in love with photography, particularly birding and taking photos of wildlife. Although only recently purchasing my Lumix, I'm yearning for a larger sensor and overall higher quality (iso, shutter speeds). I've found myself in a position where I have two options that are pretty much the same price. \n\nOption 1: Brand New Nikon D5600 with AF-P DX Nikkor 18-55mm &amp; 70-300mm VR lens kit.\n\nOption 2. Used Nikon D7100 (broken shutter) and D7500 (only 20,000 snaps) with three lenses: Nikon 18-55 F/3.5-5.6., Nikon 50mm F/1.8D, and Nikon 80-200 F/4.5-5.6\n\nTo me the better deal seems like the 2x used cameras but because I'm new to photography, I'm nervous about buying a used camera and having no warranty. Secondly, I would not be able to afford more lenses at this time. Would a Nikon 80-200 F/4.5-5.6 be enough for birding?\n\nPlease help 🙏 and thank you for your advice", "link": "https://www.reddit.com/r/Nikon/comments/qfa331/new_d5600w2x_lenses_or_used_d7100_and_d7500w/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new d5600w2x lenses or used d7100 and d7500w /!/ i'm fairly new to photography, having bought my first camera, a lumix fz80, only a couple of months ago. i've instantly fallen in love with photography, particularly birding and taking photos of wildlife. although only recently purchasing my lumix, i'm yearning for a larger sensor and overall higher quality (iso, shutter speeds). i've found myself in a -----> position !!!  where i have two options that are pretty much the same price. \n\noption 1: brand new nikon d5600 with af-p dx nikkor 18-55mm &amp; 70-300mm vr lens kit.\n\noption 2. used nikon d7100 (broken shutter) and d7500 (only 20,000 snaps) with three lenses: nikon 18-55 f/3.5-5.6., nikon 50mm f/1.8d, and nikon 80-200 f/4.5-5.6\n\nto me the better deal seems like the 2x used cameras but because i'm new to photography, i'm nervous about buying a used camera and having no warranty. secondly, i would not be able to afford more lenses at this time. would a nikon 80-200 f/4.5-5.6 be enough for birding?\n\nplease help 🙏 and thank you for your advice", "sortedWord": "None", "identifyer": 52609, "year": "2021"}, {"Unnamed: 0": 161192, "autor": "dannybatista", "date": 1625863070000, "content": "Nikon z7, 24-70 2.8S @ f2.8, Off-camera flash (3ft x 1ft strip horizontally positioned above her, modifying a flashpoint xplor 600. I added a diagram at the end to detail some of the things I think about when shooting.", "link": "https://www.reddit.com/r/Nikon/comments/oh452g/nikon_z7_2470_28s_f28_offcamera_flash_3ft_x_1ft/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "nikon z7, 24-70 2.8s @ f2.8, off-camera flash (3ft x 1ft strip horizontally -----> positioned !!!  above her, modifying a flashpoint xplor 600. i added a diagram at the end to detail some of the things i think about when shooting.", "sortedWord": "None", "identifyer": 52941, "year": "2021"}, {"Unnamed: 0": 162242, "autor": "BannedUser1234567893", "date": 1623305256000, "content": "Stolen Nikon Kit /!/ I don’t know if this the right sub but I’m pretty desperate and I don’t know where else to post.\nI live in an Apartment complex which is very high rated and most residents are good honest working people\nBut while unloading stuff from my last trip coming home someone snatched my kit right from under my door while I was unloading the car. The keys to apartment were in my Nikon case pocket so while we had to unload quickly not to delay Uber driver we just brought our stuff to our door. We have tons of deliveries from food to Amazon purchases sometime just sitting there for a day so Are my neighbors. I was tired and went to help my wife carry a big bag. When we returned it was gone. It had a lot of expensive lenses that I’ve collected over the year, camera body and accessories, filter and all necessities . I’m can’t let this go, I wake up mad everyday. It actually ruined me since then. I know it just a camera and I know I can start from scratch but still. Photography was my antidepressant and as silly as it sounds I was attached to it. I actually plan my vacations just to go take photos, not lay on the beach. \n\nSo I do have a clue who might of have done it just by timing and position of hallway cameras. I’m certain it was a neighbor which leaves maybe 1 to 3 doors down. I could be completely wrong but any other scenario is less possible.\nThe camera has WiFi and NFC I believe so I constantly open my Nikon app to see if someone tried to connect to it.\n\nI know there’s a service that tracks cameras by their NEF meta tag , Has anyone have an luck with it, they charge for extra services like 24/7 scanning of online photos to see if the serial # shows up.\n\nMy other silly idea is to put a fake shipment box as a bait like it’s an an XBOX or something and install a camera in my door peep hole\n\nAlso, I scan markets in case it’s or some of lenses for sale around my area\n\nSorry for a long post. I’m just looking for ideas. I have a suspicion it’s one of my neighbors I’ve seen from time to time. Reporting to police in San Diego I pointless, they got crazier stuff to worry about\n\n\nIf I don’t find it I would like to buy a camera and install a hidden gps in it, I know there are for sale not sure about effectiveness.\n\nFor now I have an old Pentax 35mm film camera kit. I used to develop photos at home but now it would be too much of a hassle.\n\nThat’s it, thanks to reading if you did. Any suggestions or tricks are welcome.\n\nLove my Nikon fam. Pay attention to your stuff, theft is on the rise.Even neighbors doing it which is sad. Sorry for spelling and grammar, had a couple of “beers” :)", "link": "https://www.reddit.com/r/Nikon/comments/nwgiv3/stolen_nikon_kit/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "stolen nikon kit /!/ i don’t know if this the right sub but i’m pretty desperate and i don’t know where else to post.\ni live in an apartment complex which is very high rated and most residents are good honest working people\nbut while unloading stuff from my last trip coming home someone snatched my kit right from under my door while i was unloading the car. the keys to apartment were in my nikon case pocket so while we had to unload quickly not to delay uber driver we just brought our stuff to our door. we have tons of deliveries from food to amazon purchases sometime just sitting there for a day so are my neighbors. i was tired and went to help my wife carry a big bag. when we returned it was gone. it had a lot of expensive lenses that i’ve collected over the year, camera body and accessories, filter and all necessities . i’m can’t let this go, i wake up mad everyday. it actually ruined me since then. i know it just a camera and i know i can start from scratch but still. photography was my antidepressant and as silly as it sounds i was attached to it. i actually plan my vacations just to go take photos, not lay on the beach. \n\nso i do have a clue who might of have done it just by timing and -----> position !!!  of hallway cameras. i’m certain it was a neighbor which leaves maybe 1 to 3 doors down. i could be completely wrong but any other scenario is less possible.\nthe camera has wifi and nfc i believe so i constantly open my nikon app to see if someone tried to connect to it.\n\ni know there’s a service that tracks cameras by their nef meta tag , has anyone have an luck with it, they charge for extra services like 24/7 scanning of online photos to see if the serial # shows up.\n\nmy other silly idea is to put a fake shipment box as a bait like it’s an an xbox or something and install a camera in my door peep hole\n\nalso, i scan markets in case it’s or some of lenses for sale around my area\n\nsorry for a long post. i’m just looking for ideas. i have a suspicion it’s one of my neighbors i’ve seen from time to time. reporting to police in san diego i pointless, they got crazier stuff to worry about\n\n\nif i don’t find it i would like to buy a camera and install a hidden gps in it, i know there are for sale not sure about effectiveness.\n\nfor now i have an old pentax 35mm film camera kit. i used to develop photos at home but now it would be too much of a hassle.\n\nthat’s it, thanks to reading if you did. any suggestions or tricks are welcome.\n\nlove my nikon fam. pay attention to your stuff, theft is on the rise.even neighbors doing it which is sad. sorry for spelling and grammar, had a couple of “beers” :)", "sortedWord": "None", "identifyer": 54051, "year": "2021"}, {"Unnamed: 0": 162443, "autor": "Xenogunter", "date": 1617651430000, "content": "Bought this Tamron 24-70 G2 off ebay. The zoom lock switch is stuck in the on position. Obviously somebody tried to free it already. Any hope of a simple fix or do I immediately fight for a refund?", "link": "https://www.reddit.com/r/Nikon/comments/mksxap/bought_this_tamron_2470_g2_off_ebay_the_zoom_lock/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "bought this tamron 24-70 g2 off ebay. the zoom lock switch is stuck in the on -----> position !!! . obviously somebody tried to free it already. any hope of a simple fix or do i immediately fight for a refund?", "sortedWord": "None", "identifyer": 54266, "year": "2021"}, {"Unnamed: 0": 163213, "autor": "cmarsenal", "date": 1627996686000, "content": "Should I wait for the z9? /!/ I’m going into my senior year of college with a Nikon d7500, my first camera. I’ve been saving for awhile now to upgrade towards a flagship professional camera body as I want to take that step. I shoot sports for my college and recently got a position for a local semi-pro hockey team so I think the upgrade is worth the splurge. I was leaning towards the Nikon D6, or maybe even the D5, as I want to get a body that’s going to last awhile and be at a top level. I recently heard about the Nikon z9 being the next flagship mirrorless and that it could “surpass” the D6 as the flagship sports camera. I was curious what people think, I personally have preferred DSLR’s but taking the big debate of “DSLR vs Mirrorless” out, is it worth it to wait or should I make the investment into a D5 or D6 now?", "link": "https://www.reddit.com/r/Nikon/comments/ox3ark/should_i_wait_for_the_z9/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i wait for the z9? /!/ i’m going into my senior year of college with a nikon d7500, my first camera. i’ve been saving for awhile now to upgrade towards a flagship professional camera body as i want to take that step. i shoot sports for my college and recently got a -----> position !!!  for a local semi-pro hockey team so i think the upgrade is worth the splurge. i was leaning towards the nikon d6, or maybe even the d5, as i want to get a body that’s going to last awhile and be at a top level. i recently heard about the nikon z9 being the next flagship mirrorless and that it could “surpass” the d6 as the flagship sports camera. i was curious what people think, i personally have preferred dslr’s but taking the big debate of “dslr vs mirrorless” out, is it worth it to wait or should i make the investment into a d5 or d6 now?", "sortedWord": "None", "identifyer": 55081, "year": "2021"}, {"Unnamed: 0": 163339, "autor": "ShyMouse007", "date": 1629493069000, "content": "Should I buy aps-c lens or get full frame lenses for my Z50? /!/ I have a Z50 and been using it for about ten months. But as I am looking at new lenses, I am wondering if I should stick to APS-C or full frame lenses? \n\nI am a little worried about getting APS-C as I feel my next camera Warner that maybe will be a full frame and two people I usually ask for camera advice always mentioned how the lenses are usually the one that they keep around forever and I don’t want to be in a position where I have to spend money on new lenses because I bought the crop format ones…", "link": "https://www.reddit.com/r/Nikon/comments/p8dtq2/should_i_buy_apsc_lens_or_get_full_frame_lenses/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i buy aps-c lens or get full frame lenses for my z50? /!/ i have a z50 and been using it for about ten months. but as i am looking at new lenses, i am wondering if i should stick to aps-c or full frame lenses? \n\ni am a little worried about getting aps-c as i feel my next camera warner that maybe will be a full frame and two people i usually ask for camera advice always mentioned how the lenses are usually the one that they keep around forever and i don’t want to be in a -----> position !!!  where i have to spend money on new lenses because i bought the crop format ones…", "sortedWord": "None", "identifyer": 55210, "year": "2021"}, {"Unnamed: 0": 163401, "autor": "Puzzleheaded_Part_72", "date": 1617348941000, "content": "Heceta Head Light House from the same position with a Nikkor 1000mm f11 and a sigma 15mm f2.8 fisheye both on the Nikon Z7", "link": "https://www.reddit.com/r/Nikon/comments/mife8s/heceta_head_light_house_from_the_same_position/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "heceta head light house from the same -----> position !!!  with a nikkor 1000mm f11 and a sigma 15mm f2.8 fisheye both on the nikon z7", "sortedWord": "None", "identifyer": 55278, "year": "2021"}, {"Unnamed: 0": 163837, "autor": "L1terallyUrDad", "date": 1620610564000, "content": "Nikon AF-S 500mm f/5.6 PF Review /!/ I wish I had some better opportunities with the lens, but I think I have a pretty good feel for it. I've taken it out for three birding attempts and a brief quick-test in the backyard.\n\nTL;DR: Is the lens worth $3600 + tax? Yup! Is it better than the 200-500 f/5.6? Other than not being able to zoom, yup! Is it $2300 more value than the 200-500 f/5.6? Maybe. If you're young and strong, have big hands, maybe not. Gonna pack it into the field? You will appreciate the size and weight. This lens is certainly a keeper.\n\n[Eastern Bluebird, Nikon Z 6II + FTZ + 500mm PF, heavy cropping](https://preview.redd.it/50nouzu747y61.jpg?width=1860&amp;format=pjpg&amp;auto=webp&amp;s=8ff44f78c9fcbb90abd6fe4d39fa8f3e12e40428)\n\n**Setup and conditions**\n\nI have a Nikon Z 6II +  FTZ  adapter and a D500. I also have a TC-14e III teleconverter.\n\nThe brief quick-test was some basic AF tests and close focus tests. No real photo taking, just getting used to the weight, putting it on the camera or taking it off, focusing near, far and mid-range.\n\nThe first real trip was exclusively with the Z 6II. I went to a local community park where a great blue heron frequents and I can expect mallard ducks and Canadian ring-necked geese. Squirrels and songbirds can be found around as well. There wasn't much in the way of birds-in-flight except for some very small swallows that were moving way to quick and way too small to do anything with. The heron put on a pretty good show.\n\nThe second trip out was with the D500 to our local reservoir's dam. This is a place where birds of prey frequent, feeding off of the concentration of fish below the dam. On a good day, eagles, osprey, hawks, great blue herons, and cormorants can be found. There is usually a lot of activity, both birds and photographers. I got there late, caught one osprey soaring overhead and one great blue heron. \n\nI went back out today, much earlier and it was just as dead. I got a couple of osprey passes, a couple of GBH passes, a bunch of turkey vultures, a black vulture and a couple of other birds. Today, it was a mix of the D500 and the Z 6II.\n\n&amp;#x200B;\n\n[Great Blue Heron snatching a crawfish, Nikon Z 6II + FTZ + 500mm PF](https://preview.redd.it/9q5xgzdi47y61.jpg?width=3767&amp;format=pjpg&amp;auto=webp&amp;s=b03e0e7f8a9d966eaa965fa8aa06ee102fa119c5)\n\n**Handling**\n\nThis lens handles like a dream. It's a little lighter than my 70-200  f/2.8 VR II making it quite handholdable. It's longer than the 70-200 f/2.8 but a little shorter than the 200-500 f/5.6 when in the 200mm position. It is also has a much smaller diameter near the camera. It's shaped more like a traditional telephoto with a large front that tapers down to a mount-sized diameter. The 200-500 has a wide diameter throughout its length right up to the mount where it tapers quickly. This makes it much easier to grab the lens, quickly change it and not fear that you're going to drop it. This makes it quite easy to handhold. The natural place to hold the lens is at the focus ring. This lens is quite reasonable.\n\nIt was quite easy to carry around for the 30 minutes to an hour that I was out shooting. \n\n&amp;#x200B;\n\n[Osprey fishing - Nikon Z 6II + FTZ + 500mm PF](https://preview.redd.it/22odq5vd57y61.jpg?width=1868&amp;format=pjpg&amp;auto=webp&amp;s=cba6a2b883369e97d09695df3ec09b7a91944736)\n\n**Autofocus**\n\nIt seems to be quite fast. I don't have a 500 f/4 to compare it to or the 400 /2.8, but it's more than fast enough. It had no problem acquiring birds in flight and keeping up with them. There was a small songbird in a tree with a small branch in front of it. The AF kept wanting to grab on the small branch, then I would raise the camera slightly and it would grab the bird. I don't know why it found that little stubby branch so delicious.  \n\nThe D500 is somewhat faster with AF than the Z 6II, but I didn't really have any difficulties with the Z 6II either. The only issue is that the Z 6II doesn't like to rack from far focus to near-minimum distance without AFing on an intermediate point first. I'm seeing this trend with other lenses. The 300 pf did the same thing. My 200-500 does it. It's frustrating and maybe Nikon can fix this at some point, but like anything, you quickly adapt to it once you know the behavior.\n\nWhile not an \"autofocus\" topic. The close focus distance is around 9.5 feet. You can't quite do \"Macro\" with this, but the Bokeh is oh so creamy. If it would focus closer, you could do some serious \"stand-off\" macro work.\n\n[Creamy Bokeh @ f\\/8? Yup. D500 + 500mm f\\/5.6 PF + TC-14e III \\(700mm optical, 1050mm effective\\).](https://preview.redd.it/4x4lpvny47y61.jpg?width=3282&amp;format=pjpg&amp;auto=webp&amp;s=f95d89ba8fb681615d21f32414675f8565df5de5)\n\n**Image Quality**\n\nThe 200-500 is a pretty sharp lens. The 70-200 is too. I know I'm probably a little more tolerant to less than perfect sharpness because my journalist background is about capturing the moment even if it's not perfect. I don't feel this has the sharpness of my 60mm f/2.8 macro but few lenses will. If the 200-500 is sharp enough, then the 500 PF won't disappoint. It's sharper. It's a prime lens. It should be sharper than a zoom. I've not needed to do any AF fine-tuning.\n\nOn the first trip to the lake, I failed to turn VR off and the photos were softer than I hoped, but I'm panning and moving the lens on purpose which fights the VR. Today, I put it in Sport mode and things were much sharper.\n\nThe images have good color properties and great contrast. I'm quite happy with the results.\n\n&amp;#x200B;\n\n[Northern Cardinal, D500 + 500mm PF](https://preview.redd.it/wfbpek8957y61.jpg?width=3443&amp;format=pjpg&amp;auto=webp&amp;s=8b46ae95f385c0fc9785ef02bd06c627ac0807cd)\n\n**Conclusion**\n\nAs someone who is aging (turned 60 in April) and recovering from a severe illness that claimed a lot of upper body strength, I've been struggling with the weight and bulk of the 200-500. I like to handhold my camera unless I'm going to be shooting for hours and the 200-500 was kicking my tail. I borrowed a 300mm PF and totally fell in love with that lens. It's about everything I would want in a telephoto lens. When paired with the 1.4x and dropped on a crop-sensor camera, I get plenty of reach for most things and I felt it brought life back to my D500 to a point where I would want to use it again. But I shoot a lot of birds and I was concerned the 300mm wouldn't be enough and I really want to use my Z 6II. I believe I'm going to be quite happy with it on the Z 6II.\n\nI will likely end up getting the 300mm PF too. I can see needing something between the 70-200 and the 500mm that's the size of a 24-70 f/2.8. I was concerned about spending $3600 on a lens given that I want to get other lenses and it was a large portion of my camera savings budget. But I certainly am enjoying the lens. The price still stings a bit, but photography is my main source of sanity through the COVID era and this lens will make me quite happy.", "link": "https://www.reddit.com/r/Nikon/comments/n8soyg/nikon_afs_500mm_f56_pf_review/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon af-s 500mm f/5.6 pf review /!/ i wish i had some better opportunities with the lens, but i think i have a pretty good feel for it. i've taken it out for three birding attempts and a brief quick-test in the backyard.\n\ntl;dr: is the lens worth $3600 + tax? yup! is it better than the 200-500 f/5.6? other than not being able to zoom, yup! is it $2300 more value than the 200-500 f/5.6? maybe. if you're young and strong, have big hands, maybe not. gonna pack it into the field? you will appreciate the size and weight. this lens is certainly a keeper.\n\n[eastern bluebird, nikon z 6ii + ftz + 500mm pf, heavy cropping](https://preview.redd.it/50nouzu747y61.jpg?width=1860&amp;format=pjpg&amp;auto=webp&amp;s=8ff44f78c9fcbb90abd6fe4d39fa8f3e12e40428)\n\n**setup and conditions**\n\ni have a nikon z 6ii +  ftz  adapter and a d500. i also have a tc-14e iii teleconverter.\n\nthe brief quick-test was some basic af tests and close focus tests. no real photo taking, just getting used to the weight, putting it on the camera or taking it off, focusing near, far and mid-range.\n\nthe first real trip was exclusively with the z 6ii. i went to a local community park where a great blue heron frequents and i can expect mallard ducks and canadian ring-necked geese. squirrels and songbirds can be found around as well. there wasn't much in the way of birds-in-flight except for some very small swallows that were moving way to quick and way too small to do anything with. the heron put on a pretty good show.\n\nthe second trip out was with the d500 to our local reservoir's dam. this is a place where birds of prey frequent, feeding off of the concentration of fish below the dam. on a good day, eagles, osprey, hawks, great blue herons, and cormorants can be found. there is usually a lot of activity, both birds and photographers. i got there late, caught one osprey soaring overhead and one great blue heron. \n\ni went back out today, much earlier and it was just as dead. i got a couple of osprey passes, a couple of gbh passes, a bunch of turkey vultures, a black vulture and a couple of other birds. today, it was a mix of the d500 and the z 6ii.\n\n&amp;#x200b;\n\n[great blue heron snatching a crawfish, nikon z 6ii + ftz + 500mm pf](https://preview.redd.it/9q5xgzdi47y61.jpg?width=3767&amp;format=pjpg&amp;auto=webp&amp;s=b03e0e7f8a9d966eaa965fa8aa06ee102fa119c5)\n\n**handling**\n\nthis lens handles like a dream. it's a little lighter than my 70-200  f/2.8 vr ii making it quite handholdable. it's longer than the 70-200 f/2.8 but a little shorter than the 200-500 f/5.6 when in the 200mm -----> position !!! . it is also has a much smaller diameter near the camera. it's shaped more like a traditional telephoto with a large front that tapers down to a mount-sized diameter. the 200-500 has a wide diameter throughout its length right up to the mount where it tapers quickly. this makes it much easier to grab the lens, quickly change it and not fear that you're going to drop it. this makes it quite easy to handhold. the natural place to hold the lens is at the focus ring. this lens is quite reasonable.\n\nit was quite easy to carry around for the 30 minutes to an hour that i was out shooting. \n\n&amp;#x200b;\n\n[osprey fishing - nikon z 6ii + ftz + 500mm pf](https://preview.redd.it/22odq5vd57y61.jpg?width=1868&amp;format=pjpg&amp;auto=webp&amp;s=cba6a2b883369e97d09695df3ec09b7a91944736)\n\n**autofocus**\n\nit seems to be quite fast. i don't have a 500 f/4 to compare it to or the 400 /2.8, but it's more than fast enough. it had no problem acquiring birds in flight and keeping up with them. there was a small songbird in a tree with a small branch in front of it. the af kept wanting to grab on the small branch, then i would raise the camera slightly and it would grab the bird. i don't know why it found that little stubby branch so delicious.  \n\nthe d500 is somewhat faster with af than the z 6ii, but i didn't really have any difficulties with the z 6ii either. the only issue is that the z 6ii doesn't like to rack from far focus to near-minimum distance without afing on an intermediate point first. i'm seeing this trend with other lenses. the 300 pf did the same thing. my 200-500 does it. it's frustrating and maybe nikon can fix this at some point, but like anything, you quickly adapt to it once you know the behavior.\n\nwhile not an \"autofocus\" topic. the close focus distance is around 9.5 feet. you can't quite do \"macro\" with this, but the bokeh is oh so creamy. if it would focus closer, you could do some serious \"stand-off\" macro work.\n\n[creamy bokeh @ f\\/8? yup. d500 + 500mm f\\/5.6 pf + tc-14e iii \\(700mm optical, 1050mm effective\\).](https://preview.redd.it/4x4lpvny47y61.jpg?width=3282&amp;format=pjpg&amp;auto=webp&amp;s=f95d89ba8fb681615d21f32414675f8565df5de5)\n\n**image quality**\n\nthe 200-500 is a pretty sharp lens. the 70-200 is too. i know i'm probably a little more tolerant to less than perfect sharpness because my journalist background is about capturing the moment even if it's not perfect. i don't feel this has the sharpness of my 60mm f/2.8 macro but few lenses will. if the 200-500 is sharp enough, then the 500 pf won't disappoint. it's sharper. it's a prime lens. it should be sharper than a zoom. i've not needed to do any af fine-tuning.\n\non the first trip to the lake, i failed to turn vr off and the photos were softer than i hoped, but i'm panning and moving the lens on purpose which fights the vr. today, i put it in sport mode and things were much sharper.\n\nthe images have good color properties and great contrast. i'm quite happy with the results.\n\n&amp;#x200b;\n\n[northern cardinal, d500 + 500mm pf](https://preview.redd.it/wfbpek8957y61.jpg?width=3443&amp;format=pjpg&amp;auto=webp&amp;s=8b46ae95f385c0fc9785ef02bd06c627ac0807cd)\n\n**conclusion**\n\nas someone who is aging (turned 60 in april) and recovering from a severe illness that claimed a lot of upper body strength, i've been struggling with the weight and bulk of the 200-500. i like to handhold my camera unless i'm going to be shooting for hours and the 200-500 was kicking my tail. i borrowed a 300mm pf and totally fell in love with that lens. it's about everything i would want in a telephoto lens. when paired with the 1.4x and dropped on a crop-sensor camera, i get plenty of reach for most things and i felt it brought life back to my d500 to a point where i would want to use it again. but i shoot a lot of birds and i was concerned the 300mm wouldn't be enough and i really want to use my z 6ii. i believe i'm going to be quite happy with it on the z 6ii.\n\ni will likely end up getting the 300mm pf too. i can see needing something between the 70-200 and the 500mm that's the size of a 24-70 f/2.8. i was concerned about spending $3600 on a lens given that i want to get other lenses and it was a large portion of my camera savings budget. but i certainly am enjoying the lens. the price still stings a bit, but photography is my main source of sanity through the covid era and this lens will make me quite happy.", "sortedWord": "None", "identifyer": 55739, "year": "2021"}, {"Unnamed: 0": 164010, "autor": "curiousmike1300", "date": 1619201351000, "content": "Cold Reflection. Nikon Z6 + 24-70 f/4 /!/ Frost on the tent, waking up at 6 a.m. to get in position for sunrise.\n\nThis is a stitch of 6 vertical images to get the scene.", "link": "https://www.reddit.com/r/Nikon/comments/mx1d9l/cold_reflection_nikon_z6_2470_f4/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "cold reflection. nikon z6 + 24-70 f/4 /!/ frost on the tent, waking up at 6 a.m. to get in -----> position !!!  for sunrise.\n\nthis is a stitch of 6 vertical images to get the scene.", "sortedWord": "None", "identifyer": 55922, "year": "2021"}, {"Unnamed: 0": 164029, "autor": "johnhawkins1568", "date": 1619171186000, "content": "Autofocus question /!/ Hi team,\n\nI've been noticing lately that, when shooting with my AF-P 70-300mm on my D5600, I have a hard time with the autofocus. More specifically - my camera seems to predominantly focus on what is in the center of the viewfinder, and will focus on the subject well. But if I then re-position the camera to frame the subject at something other than dead center, the camera then re-focuses on something in the background or foreground (which is now in the \"center\"), leaving the subject more or less out of focus. \n\nAny thoughts? I've been using AF-S since I've mostly been shooting stationary subjects, if that's relevant. Do I need to figure out this back button focus people talk about?\n\nThank you!", "link": "https://www.reddit.com/r/Nikon/comments/mwrofd/autofocus_question/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "autofocus question /!/ hi team,\n\ni've been noticing lately that, when shooting with my af-p 70-300mm on my d5600, i have a hard time with the autofocus. more specifically - my camera seems to predominantly focus on what is in the center of the viewfinder, and will focus on the subject well. but if i then re------> position !!!  the camera to frame the subject at something other than dead center, the camera then re-focuses on something in the background or foreground (which is now in the \"center\"), leaving the subject more or less out of focus. \n\nany thoughts? i've been using af-s since i've mostly been shooting stationary subjects, if that's relevant. do i need to figure out this back button focus people talk about?\n\nthank you!", "sortedWord": "None", "identifyer": 55942, "year": "2021"}], "name": "positionnikon2021"}