{"interestingcomments": [{"Unnamed: 0": 22305, "autor": "guy_fromspace", "date": 1596532450000, "content": "Possible issue with 50mm 1.8 S? /!/ I just received my Nikon 50mm 1.8 S for my Z6 a couple days ago. \n\n\nWhile testing it out I noticed that while I manual focused the aperture was twitching to a very slightly tighter aperture. \n\n\nKeep in mind I’m in Manual Mode. \n\nEven looking directly at the front of the lens barrel and turning the focus ring I can physically see the aperture twitching into a slightly darker position. \n\nIt’s probably only a 1/3 of a stop change. \n\nBut I feel like it may be an issue. \n\nMy exposure after taking the photo always seems right. \n\nAnd I’ve noticed this issue does not happen in video mode. \n\nAny ideas on what’s happening? \n\n(I think I’m still on firmware 2.01)\n\nI love this lens. Which is why I really want to be sure it doesn’t have a defect. \n\nThanks", "link": "https://www.reddit.com/r/Nikon/comments/i3g1vq/possible_issue_with_50mm_18_s/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "possible issue with 50mm 1.8 s? /!/ i just received my nikon 50mm 1.8 s for my z6 a couple days ago. \n\n\nwhile testing it out i noticed that while i manual focused the aperture was twitching to a very slightly tighter aperture. \n\n\nkeep in mind i’m in manual mode. \n\neven looking directly at the front of the lens barrel and turning the focus ring i can physically see the aperture twitching into a slightly darker -----> position !!! . \n\nit’s probably only a 1/3 of a stop change. \n\nbut i feel like it may be an issue. \n\nmy exposure after taking the photo always seems right. \n\nand i’ve noticed this issue does not happen in video mode. \n\nany ideas on what’s happening? \n\n(i think i’m still on firmware 2.01)\n\ni love this lens. which is why i really want to be sure it doesn’t have a defect. \n\nthanks", "sortedWord": "None", "identifyer": 22678, "year": "2020"}, {"Unnamed: 0": 23564, "autor": "elvin3247", "date": 1606094964000, "content": "Lens Help: 85mm vs 70-200mm /!/ Currently, I have a 50mm 1.8 and a 24-70mm 2.8 and am looking for my next lens. I'm unsure of which lens to go with next and need some help. If you were in my position, would you go for the prime or zoom lens as your next lens. I have a Nikon D750 if that helps. I currently shoot friends/family and landscape for fun.", "link": "https://www.reddit.com/r/Nikon/comments/jz82tw/lens_help_85mm_vs_70200mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens help: 85mm vs 70-200mm /!/ currently, i have a 50mm 1.8 and a 24-70mm 2.8 and am looking for my next lens. i'm unsure of which lens to go with next and need some help. if you were in my -----> position !!! , would you go for the prime or zoom lens as your next lens. i have a nikon d750 if that helps. i currently shoot friends/family and landscape for fun.", "sortedWord": "None", "identifyer": 23963, "year": "2020"}, {"Unnamed: 0": 23843, "autor": "ishitondreams", "date": 1601254652000, "content": "Just got a D90 and a lens for $220, it's out of focus /!/ First time DSLR user, only ever used a smart phone. The picture is out of focus when the zoom is in the photo taking \"mode\" but I can see a clear picture through the viewfinder when I'm half way to the \"travel mode\" position.", "link": "https://www.reddit.com/r/Nikon/comments/j12il9/just_got_a_d90_and_a_lens_for_220_its_out_of_focus/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just got a d90 and a lens for $220, it's out of focus /!/ first time dslr user, only ever used a smart phone. the picture is out of focus when the zoom is in the photo taking \"mode\" but i can see a clear picture through the viewfinder when i'm half way to the \"travel mode\" -----> position !!! .", "sortedWord": "None", "identifyer": 24249, "year": "2020"}, {"Unnamed: 0": 24256, "autor": "Gstpierre", "date": 1582221766000, "content": "Any Tips for someone starting out in a newspaper part time photographer position? /!/ Hi, I’ve been a photographer for 10 years, but haven’t done much professionally since last year. I took some photos for a restaurant, and have taken some portraits for clients. I just got a job at a college newspaper, and I’m looking for some good tips to get the best results. I have a z6 with the 24-70 f4s, and the 50 1.8s. I have a tamron 70-210 f4 in the mail, and I already have the ftz. In scenarios of very dim light, is the 50 1.8s the only way to get good results without using flash, or I guess I’m asking for an acceptable picture, what is the max iso you’d feel comfortable delivering pictures at? Another question is if ch+ focuses well enough to be worthwhile over CH? Also, even with image stabilization, is a shutter speed of 1/125 enough to really freeze motion of a speaker at a podium? I also just got the fw 3.0, is subject tracking good enough to use in lowlight or should I stick with dynamic zone continuous focus?\n\nI know that a lot of these questions are subjective, and thats exactly why I’m asking them. At this point in time, just based off instinct I can set exposure without taking my camera out of my bag haha. I just have significantly more experience with people posing and not quite as much with candid in lower light scenarios. I also know that an f4 lens is probably not enough for some low light scenarios, but I’m hoping that either flash or high iso can help me there. \n\nThanks in advance for all of the tips, I guess I’m just nervous for it and would like to be prepared.", "link": "https://www.reddit.com/r/Nikon/comments/f6wxhu/any_tips_for_someone_starting_out_in_a_newspaper/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "any tips for someone starting out in a newspaper part time photographer -----> position !!! ? /!/ hi, i’ve been a photographer for 10 years, but haven’t done much professionally since last year. i took some photos for a restaurant, and have taken some portraits for clients. i just got a job at a college newspaper, and i’m looking for some good tips to get the best results. i have a z6 with the 24-70 f4s, and the 50 1.8s. i have a tamron 70-210 f4 in the mail, and i already have the ftz. in scenarios of very dim light, is the 50 1.8s the only way to get good results without using flash, or i guess i’m asking for an acceptable picture, what is the max iso you’d feel comfortable delivering pictures at? another question is if ch+ focuses well enough to be worthwhile over ch? also, even with image stabilization, is a shutter speed of 1/125 enough to really freeze motion of a speaker at a podium? i also just got the fw 3.0, is subject tracking good enough to use in lowlight or should i stick with dynamic zone continuous focus?\n\ni know that a lot of these questions are subjective, and thats exactly why i’m asking them. at this point in time, just based off instinct i can set exposure without taking my camera out of my bag haha. i just have significantly more experience with people posing and not quite as much with candid in lower light scenarios. i also know that an f4 lens is probably not enough for some low light scenarios, but i’m hoping that either flash or high iso can help me there. \n\nthanks in advance for all of the tips, i guess i’m just nervous for it and would like to be prepared.", "sortedWord": "None", "identifyer": 24670, "year": "2020"}, {"Unnamed: 0": 24389, "autor": "vexxed82", "date": 1597862765000, "content": "Nikkor 19mm PCE Tilt-Shit softness issue /!/ I've been using the Nikkor 19mm PCE lens for architecture work for about 1.5 years now. I absolutely love it...most of the time. But Sometimes, about 1/4 of the left side of my frames (when shot in landscape mode) and shifted up, is slightly soft. The other 3/4 of the frame is tack sharp. \n\nWhen I use it, I'm typically shooting within the following parameters:\n\n1. On a tripod\n2. Remote release\n3. F8 or greater\n4. Tilt locked in the 0° position. \n\nThe strange part is that this doesn't happen all the time. Sometimes the full-frame is sharp. So it feels like there is some degree of user errors, but I can't quite put my finger on what I'm doing wrong.  \n\n\nI had it serviced a year ago after a drop and it worked fine there after. I had since brought it in for the softness issue, but the techs weren't able to recreate the sotness so there was nothing to fix. Has anyone experienced similar problems?", "link": "https://www.reddit.com/r/Nikon/comments/ictogc/nikkor_19mm_pce_tiltshit_softness_issue/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikkor 19mm pce tilt-shit softness issue /!/ i've been using the nikkor 19mm pce lens for architecture work for about 1.5 years now. i absolutely love it...most of the time. but sometimes, about 1/4 of the left side of my frames (when shot in landscape mode) and shifted up, is slightly soft. the other 3/4 of the frame is tack sharp. \n\nwhen i use it, i'm typically shooting within the following parameters:\n\n1. on a tripod\n2. remote release\n3. f8 or greater\n4. tilt locked in the 0° -----> position !!! . \n\nthe strange part is that this doesn't happen all the time. sometimes the full-frame is sharp. so it feels like there is some degree of user errors, but i can't quite put my finger on what i'm doing wrong.  \n\n\ni had it serviced a year ago after a drop and it worked fine there after. i had since brought it in for the softness issue, but the techs weren't able to recreate the sotness so there was nothing to fix. has anyone experienced similar problems?", "sortedWord": "None", "identifyer": 24805, "year": "2020"}, {"Unnamed: 0": 25459, "autor": "[deleted]", "date": 1592155210000, "content": "Nikon AF400. Someone can tell me the difference between the middle and most right positions of the slider below the objective? Thanks!! /!/ [deleted]", "link": "https://www.reddit.com/r/Nikon/comments/h8xqv7/nikon_af400_someone_can_tell_me_the_difference/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "nikon af400. someone can tell me the difference between the middle and most right -----> positions !!!  of the slider below the objective? thanks!! /!/ [deleted]", "sortedWord": "None", "identifyer": 25901, "year": "2020"}, {"Unnamed: 0": 25732, "autor": "kerriliane", "date": 1579029917000, "content": "Just upgraded to a D800 from a D90 - FX lens help! /!/ Hello there folks!  \nI've been shooting with a nikon for 10 years now, and have always left it to the camera to do the thinking, and I have always just done the composition, we've been great partners, but now that I've left my d90 at the altar, and run away with a d800 - I need help!  \nI've figured out how to rock it on A - so for now that works for me until I can master that. Then I'll master S and then go full manual - really hard to take photos of my fast moving kids without knowing the settings so, one of the semi auto modes is still necessary.   \n\n\n**The help I need is with Lenses!**  \n**I had an 18-105mm on the d90 and I loved the versatility, but that's a DX lens, and I would like the FX version.**  \n**Yes, I have a prime 50mm f/1.8 but honestly I don't really like using it.**   \nI have a puppy, when I try to get closer to her, she then leaps up from where I've posed her and she runs at me.   \nA zoom lens will help me achieve multiple options for my composition without having to excite the puppy by changing my position.   \n\n\n**I was looking at the Tamron 24-70mm with VC but somehwere online I saw some article about it not being a FX lens?**  \n**I have also been looking at the Nikon or Tamron 28-300mm VR/VC lens.**  \n**Both are f/2.8 and I know that means that I can keep the 2.8 no matter what level of zoom I am, but when doing 90% portraits, and macro shots when not doing portraits, will a f/2.8 lens be that beneficial for me?**  *I have never used a lens like that so I am having a hard time understanding why I would want it.*  \n*Please also keep in mind that I am still learning my ways around manual mode, and would like a lens that works best for me now, and later on I can change to a different lens that suits my capabilities better.*   \n\n\nI shot this below on A mode, zoomed in most of the way with my 70-300mm tamron.  I would have preferred the focus on her nose, but she moved after i focused it (once again why auto wins in my book with moving objects lol) - I generally zoom in, focus on whatever it is that I want in focus specifically and then zoom out to compose the photo while still half holding the shutter to keep the focus where I want it.   \n\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9wuuqgaiosa41.jpg?width=4912&amp;format=pjpg&amp;auto=webp&amp;s=75069c71f97f8a42debc847fb99484ee050048dc", "link": "https://www.reddit.com/r/Nikon/comments/eoq000/just_upgraded_to_a_d800_from_a_d90_fx_lens_help/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just upgraded to a d800 from a d90 - fx lens help! /!/ hello there folks!  \ni've been shooting with a nikon for 10 years now, and have always left it to the camera to do the thinking, and i have always just done the composition, we've been great partners, but now that i've left my d90 at the altar, and run away with a d800 - i need help!  \ni've figured out how to rock it on a - so for now that works for me until i can master that. then i'll master s and then go full manual - really hard to take photos of my fast moving kids without knowing the settings so, one of the semi auto modes is still necessary.   \n\n\n**the help i need is with lenses!**  \n**i had an 18-105mm on the d90 and i loved the versatility, but that's a dx lens, and i would like the fx version.**  \n**yes, i have a prime 50mm f/1.8 but honestly i don't really like using it.**   \ni have a puppy, when i try to get closer to her, she then leaps up from where i've posed her and she runs at me.   \na zoom lens will help me achieve multiple options for my composition without having to excite the puppy by changing my -----> position !!! .   \n\n\n**i was looking at the tamron 24-70mm with vc but somehwere online i saw some article about it not being a fx lens?**  \n**i have also been looking at the nikon or tamron 28-300mm vr/vc lens.**  \n**both are f/2.8 and i know that means that i can keep the 2.8 no matter what level of zoom i am, but when doing 90% portraits, and macro shots when not doing portraits, will a f/2.8 lens be that beneficial for me?**  *i have never used a lens like that so i am having a hard time understanding why i would want it.*  \n*please also keep in mind that i am still learning my ways around manual mode, and would like a lens that works best for me now, and later on i can change to a different lens that suits my capabilities better.*   \n\n\ni shot this below on a mode, zoomed in most of the way with my 70-300mm tamron.  i would have preferred the focus on her nose, but she moved after i focused it (once again why auto wins in my book with moving objects lol) - i generally zoom in, focus on whatever it is that i want in focus specifically and then zoom out to compose the photo while still half holding the shutter to keep the focus where i want it.   \n\n\n&amp;#x200b;\n\nhttps://preview.redd.it/9wuuqgaiosa41.jpg?width=4912&amp;format=pjpg&amp;auto=webp&amp;s=75069c71f97f8a42debc847fb99484ee050048dc", "sortedWord": "None", "identifyer": 26182, "year": "2020"}, {"Unnamed: 0": 26799, "autor": "KerryKongsgaard", "date": 1602245219000, "content": "Moonrise and Moonset of the 10/8/20 waning gibbous moon- taken from the same tripod position 8 hours apart", "link": "https://www.reddit.com/r/Nikon/comments/j7xqb2/moonrise_and_moonset_of_the_10820_waning_gibbous/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "moonrise and moonset of the 10/8/20 waning gibbous moon- taken from the same tripod -----> position !!!  8 hours apart", "sortedWord": "None", "identifyer": 27291, "year": "2020"}, {"Unnamed: 0": 27541, "autor": "tofufish123", "date": 1607294843000, "content": "Case for ginormous camera setup /!/ Howdy. I am looking for a camera cube (to put in my backpack) or a holster bag or anything else yall reccomend that will work to carry the D500 w/ battery grip w/ the nikkor 200-500mm lens. I was ideally looking for something that can carry it with the hood in ready to go position and the battery grip attached. I dont want to buy a camera backpack. I plan on taking the camera hiking with me. Let me know what yall think- any help is appreciated!", "link": "https://www.reddit.com/r/Nikon/comments/k83xew/case_for_ginormous_camera_setup/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "case for ginormous camera setup /!/ howdy. i am looking for a camera cube (to put in my backpack) or a holster bag or anything else yall reccomend that will work to carry the d500 w/ battery grip w/ the nikkor 200-500mm lens. i was ideally looking for something that can carry it with the hood in ready to go -----> position !!!  and the battery grip attached. i dont want to buy a camera backpack. i plan on taking the camera hiking with me. let me know what yall think- any help is appreciated!", "sortedWord": "None", "identifyer": 28061, "year": "2020"}, {"Unnamed: 0": 30192, "autor": "L1terallyUrDad", "date": 1608434258000, "content": "Nikon Z 6II AF test vs. birds in flight w/ AF-S 200-500 f/5.6 /!/ TL;DR - Wide-area AF works great for birds in flight. Subject tracking works great if the animals are not rapidly changing and you can't keep the center on the subject long enough to lock on. The AF is fast enough for wildlife.\n\nOkay, before anyone complains, I'm a photographer, not a testing lab. I can just share my experiences and you can take from it what you like. No complaints about my methodology please.\n\nFirst a quick side-bar. Let's talk wildlife. People may envision traipsing through the woods looking for bears or moose (and that is part of it), but wildlife includes bugs on flowers, birds sitting on branches, chasing squirrels in your backyard, tigers at the zoo (though some could argue that's not really wildlife), or going on a safari. \n\nIn general, bugs on flowers aside, having a super-telephoto lens is about the one constant. Birds and squirrels are small. Larger birds like raptors tend to be skittish around people and unless you're walking through a neighborhood in Anchorage, those moose are going to usually be downrange from you. (Are moose in Anchorage really wildlife or more like pets? Yes, I have photographed moose in an Anchorage neighborhood before. A 70-200 was almost too much lens)\n\n[A neighborhood moose in Anchorage, AK. Probably a Nikon D200 + AF-S 80-200 f\\/2.8](https://preview.redd.it/sr69mi59b9661.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=d9fd32bafc2ba05e84534fde45e3ea218b6c4a18)\n\nThere is a misconception though about the camera that you need. Clearly, a high-resolution sensor is helpful. It gives you room to crop, and when you should not be closer than 50 meters to a bear, that extra cropping is useful. The 45.7mp D850 and Z 7/Z 7II's 1.5x DX crop produces a 20mp image, the same as the D500, which is a nice way to turn that 500mm lens into a 750mm effective lens.\n\nBut in many cases you don't need 14 frames per second. You don't need lighting fast autofocus. That bear or moose isn't going to be moving very fast. Maybe if you're lucky enough to be chasing a cheetah taking down a zebra on a safari, anything over 8 fps should be usable. Sure 14 fps will be cool.  But AF just needs to be good enough. In many wildlife cases, you have time to get the animal in focus and even use tracking mode. Again, naturally faster is better, but not required.\n\nIn my recent trip to the zoo with the Z 6II and 200-500/FTZ combo, I only missed two shots out of 345 because I wasn't able to get the animals in focus. I'm constantly nailing focus on the birds and squirrels in the back yard. Maybe in the future, I'll get a chance to find that wild cheetah running through the African savannah.\n\n[Elk Bull, NC Zoo - Nikon Z 6II + AF-S 200-500mm f\\/5.6 @ 500mm](https://preview.redd.it/ya0uzqlsb9661.jpg?width=4044&amp;format=pjpg&amp;auto=webp&amp;s=7f493a3032adc58dcc25082570755d2a0aae1742)\n\nBirds in flight, well that's a totally different story. They are small, fast, and like to change direction and distance to and from your position. Sure, a hawk making lazy circles in the sky isn't all that challenging, but an osprey diving into the water to grab that fish is a time where you are going to want those 14 frames per second. You need AF to be tracking the bird throughout its dive and subsequent departure, which isn't always linear. You can't control the path the bird takes to or from you.\n\nYou certainly need incredible AF to do this, and you need a deep buffer to handle some fairly long 3-4 second bursts (50+ photos).\n\nToday, I took my Z 6II + AF-S 200-500mm f/5.6 + FTZ adapter along with my D500 and a 1.4x TC to a local river that sits just below the dam for one of our local reservoirs. This is a popular place to go birding because we have bald eagles, osprey, red tail and red shoulder hawks, vultures, great blue herons, cormorants, gulls, and more. \n\nFWIW, I saw a couple of bald eagles, but they were too far down the river and heavily backlit to get anything. They also were not flying around much. I had a couple of great blue herons, but they really were not being active either and were hiding out in brush or in situations where you couldn't separate them from the background. Who needs another heron portrait anyway, right? (You do. You know you do!)\n\n[Great Blue Heron. Nikon D500 + Nikon AF-S 200-500mm f.5.6 @ 500mm](https://preview.redd.it/1720edeu19661.jpg?width=3322&amp;format=pjpg&amp;auto=webp&amp;s=8f2e4b5510a4299ff1281e7ab21e7945a56b2fb5)\n\nBut I had hundreds of gulls and quite a few active cormorants to play with. That was fine, I wanted to play with birds in flight anyway.\n\nI tried the Z 6II in Wide-Area AF. I also have my Fn1 button set to put the camera into Subject Tracking mode. These two modes were really all I should need for birds in flight. I'm not much of a back button AF person, but it seems to work better in Subject Tracking mode as the Z 6II's trigger's half-press is pretty short compared to the DSLRs I've used over the years.\n\nI was very, very frustrated with Subject Tracking and the gulls. In this mode, you're presented with a square in the center of the finder that's probably about 9 AF points big. When you half-press or back focus AF, the white box turns yellow, and whatever is there will be tracked. This generally works pretty well, but I guess my reflexes with that big lens were just too slow. I would just watch the yellow box zip to the right side of the viewfinder as I panned left trying to keep up with the gulls. Basically, it got out of the box before the camera could lock on. I feel like I'm 100% blame for this. That lens is big and heavy and those birds were moving... fast... I just couldn't keep that small box on the small bird long enough for it to lock on.\n\nWhen it did catch, it worked pretty well, though trying to follow the yellow box will trick you as it's movement sometimes lags where it's really at. The proof was in the photos. If I got the gull in initial focus, the next few frames (typically a 3-5 frame burst) were also in focus. But more often than not, I wasn't taking photos because I didn't get a lock on.\n\nThe cormorants were quite a bit easier to track, their movement was slower and less chaotic. They tended to fly in straighter lines or bigger arcs. The gulls were pure chaos. The photo below is from a 20 frame burst over 2ish seconds. All of them were in focus.\n\n[Cormorants flying in formation. Nikon Z 6II + 200-500mm f\\/5.6 @ 500mm.](https://preview.redd.it/ogomunrt49661.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=6a9f2ea47eeb778f83003c1db560ac9260b49f4b)\n\nAfter a while, I wasn't getting anything, so I switched over to the D500. I put the 1.4x TC on to see if I could get the down-river eagles. This gave me an effective 1050mm f/8 lens. I tried to track the gulls with this setup as well. I tried both group mode and 3D tracking. The D500 struggled to lock on as well. I suspect it was the TC since it was making the lens f/8 instead of f/5.6. Sadly I didn't try taking the TC off to get a speed comparison. But the Z 6II lock-on speed (when I was able to get a lock on) seemed to be as fast as the D500. I didn't get enough of a feel to see if the 3D tracking was able to track better. I suspect it is.\n\nI went back to the Z 6II and the gulls. This time, I didn't mess with Subject Tracking racking mode. I just let the Wide-Area AF do its thing. For the most part, it found them and kept them in focus. It was able to drive that big lens and reasonably keep up with those randomly moving gulls.\n\n[Gull in flight - Nikon Z 6II + Nikon AF-S 200-500mm f\\/5.6 @ 500mm](https://preview.redd.it/ios604te89661.jpg?width=3956&amp;format=pjpg&amp;auto=webp&amp;s=3d6a22c3ed3e43b98b1ac243365ab7c109047f6b)\n\nAF speed was good enough to track birds in flight. It handled the big lens quite well.  Being able to Subject Track something that's moving chaotically and quickly is hard for me to do. Since I wasn't shooting in Single AF point mode, I was shooting more like 12 fps with the camera. The viewfinder lag (well showing the last shot briefly between frames) is a touch jarring.  \n\nI have no doubt that people will be very successful shooting all kinds of wildlife, though some rapidly, randomly moving birds will be a challenge with Subject Tracking, though Wide-Area AF should do the trick.", "link": "https://www.reddit.com/r/Nikon/comments/kgmilz/nikon_z_6ii_af_test_vs_birds_in_flight_w_afs/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon z 6ii af test vs. birds in flight w/ af-s 200-500 f/5.6 /!/ tl;dr - wide-area af works great for birds in flight. subject tracking works great if the animals are not rapidly changing and you can't keep the center on the subject long enough to lock on. the af is fast enough for wildlife.\n\nokay, before anyone complains, i'm a photographer, not a testing lab. i can just share my experiences and you can take from it what you like. no complaints about my methodology please.\n\nfirst a quick side-bar. let's talk wildlife. people may envision traipsing through the woods looking for bears or moose (and that is part of it), but wildlife includes bugs on flowers, birds sitting on branches, chasing squirrels in your backyard, tigers at the zoo (though some could argue that's not really wildlife), or going on a safari. \n\nin general, bugs on flowers aside, having a super-telephoto lens is about the one constant. birds and squirrels are small. larger birds like raptors tend to be skittish around people and unless you're walking through a neighborhood in anchorage, those moose are going to usually be downrange from you. (are moose in anchorage really wildlife or more like pets? yes, i have photographed moose in an anchorage neighborhood before. a 70-200 was almost too much lens)\n\n[a neighborhood moose in anchorage, ak. probably a nikon d200 + af-s 80-200 f\\/2.8](https://preview.redd.it/sr69mi59b9661.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=d9fd32bafc2ba05e84534fde45e3ea218b6c4a18)\n\nthere is a misconception though about the camera that you need. clearly, a high-resolution sensor is helpful. it gives you room to crop, and when you should not be closer than 50 meters to a bear, that extra cropping is useful. the 45.7mp d850 and z 7/z 7ii's 1.5x dx crop produces a 20mp image, the same as the d500, which is a nice way to turn that 500mm lens into a 750mm effective lens.\n\nbut in many cases you don't need 14 frames per second. you don't need lighting fast autofocus. that bear or moose isn't going to be moving very fast. maybe if you're lucky enough to be chasing a cheetah taking down a zebra on a safari, anything over 8 fps should be usable. sure 14 fps will be cool.  but af just needs to be good enough. in many wildlife cases, you have time to get the animal in focus and even use tracking mode. again, naturally faster is better, but not required.\n\nin my recent trip to the zoo with the z 6ii and 200-500/ftz combo, i only missed two shots out of 345 because i wasn't able to get the animals in focus. i'm constantly nailing focus on the birds and squirrels in the back yard. maybe in the future, i'll get a chance to find that wild cheetah running through the african savannah.\n\n[elk bull, nc zoo - nikon z 6ii + af-s 200-500mm f\\/5.6 @ 500mm](https://preview.redd.it/ya0uzqlsb9661.jpg?width=4044&amp;format=pjpg&amp;auto=webp&amp;s=7f493a3032adc58dcc25082570755d2a0aae1742)\n\nbirds in flight, well that's a totally different story. they are small, fast, and like to change direction and distance to and from your -----> position !!! . sure, a hawk making lazy circles in the sky isn't all that challenging, but an osprey diving into the water to grab that fish is a time where you are going to want those 14 frames per second. you need af to be tracking the bird throughout its dive and subsequent departure, which isn't always linear. you can't control the path the bird takes to or from you.\n\nyou certainly need incredible af to do this, and you need a deep buffer to handle some fairly long 3-4 second bursts (50+ photos).\n\ntoday, i took my z 6ii + af-s 200-500mm f/5.6 + ftz adapter along with my d500 and a 1.4x tc to a local river that sits just below the dam for one of our local reservoirs. this is a popular place to go birding because we have bald eagles, osprey, red tail and red shoulder hawks, vultures, great blue herons, cormorants, gulls, and more. \n\nfwiw, i saw a couple of bald eagles, but they were too far down the river and heavily backlit to get anything. they also were not flying around much. i had a couple of great blue herons, but they really were not being active either and were hiding out in brush or in situations where you couldn't separate them from the background. who needs another heron portrait anyway, right? (you do. you know you do!)\n\n[great blue heron. nikon d500 + nikon af-s 200-500mm f.5.6 @ 500mm](https://preview.redd.it/1720edeu19661.jpg?width=3322&amp;format=pjpg&amp;auto=webp&amp;s=8f2e4b5510a4299ff1281e7ab21e7945a56b2fb5)\n\nbut i had hundreds of gulls and quite a few active cormorants to play with. that was fine, i wanted to play with birds in flight anyway.\n\ni tried the z 6ii in wide-area af. i also have my fn1 button set to put the camera into subject tracking mode. these two modes were really all i should need for birds in flight. i'm not much of a back button af person, but it seems to work better in subject tracking mode as the z 6ii's trigger's half-press is pretty short compared to the dslrs i've used over the years.\n\ni was very, very frustrated with subject tracking and the gulls. in this mode, you're presented with a square in the center of the finder that's probably about 9 af points big. when you half-press or back focus af, the white box turns yellow, and whatever is there will be tracked. this generally works pretty well, but i guess my reflexes with that big lens were just too slow. i would just watch the yellow box zip to the right side of the viewfinder as i panned left trying to keep up with the gulls. basically, it got out of the box before the camera could lock on. i feel like i'm 100% blame for this. that lens is big and heavy and those birds were moving... fast... i just couldn't keep that small box on the small bird long enough for it to lock on.\n\nwhen it did catch, it worked pretty well, though trying to follow the yellow box will trick you as it's movement sometimes lags where it's really at. the proof was in the photos. if i got the gull in initial focus, the next few frames (typically a 3-5 frame burst) were also in focus. but more often than not, i wasn't taking photos because i didn't get a lock on.\n\nthe cormorants were quite a bit easier to track, their movement was slower and less chaotic. they tended to fly in straighter lines or bigger arcs. the gulls were pure chaos. the photo below is from a 20 frame burst over 2ish seconds. all of them were in focus.\n\n[cormorants flying in formation. nikon z 6ii + 200-500mm f\\/5.6 @ 500mm.](https://preview.redd.it/ogomunrt49661.jpg?width=6048&amp;format=pjpg&amp;auto=webp&amp;s=6a9f2ea47eeb778f83003c1db560ac9260b49f4b)\n\nafter a while, i wasn't getting anything, so i switched over to the d500. i put the 1.4x tc on to see if i could get the down-river eagles. this gave me an effective 1050mm f/8 lens. i tried to track the gulls with this setup as well. i tried both group mode and 3d tracking. the d500 struggled to lock on as well. i suspect it was the tc since it was making the lens f/8 instead of f/5.6. sadly i didn't try taking the tc off to get a speed comparison. but the z 6ii lock-on speed (when i was able to get a lock on) seemed to be as fast as the d500. i didn't get enough of a feel to see if the 3d tracking was able to track better. i suspect it is.\n\ni went back to the z 6ii and the gulls. this time, i didn't mess with subject tracking racking mode. i just let the wide-area af do its thing. for the most part, it found them and kept them in focus. it was able to drive that big lens and reasonably keep up with those randomly moving gulls.\n\n[gull in flight - nikon z 6ii + nikon af-s 200-500mm f\\/5.6 @ 500mm](https://preview.redd.it/ios604te89661.jpg?width=3956&amp;format=pjpg&amp;auto=webp&amp;s=3d6a22c3ed3e43b98b1ac243365ab7c109047f6b)\n\naf speed was good enough to track birds in flight. it handled the big lens quite well.  being able to subject track something that's moving chaotically and quickly is hard for me to do. since i wasn't shooting in single af point mode, i was shooting more like 12 fps with the camera. the viewfinder lag (well showing the last shot briefly between frames) is a touch jarring.  \n\ni have no doubt that people will be very successful shooting all kinds of wildlife, though some rapidly, randomly moving birds will be a challenge with subject tracking, though wide-area af should do the trick.", "sortedWord": "None", "identifyer": 30811, "year": "2020"}, {"Unnamed: 0": 30279, "autor": "_Juaquine", "date": 1597262343000, "content": "Nikon FG Stuck /!/ Hey I just received a Nikon FG as a gift from a grandparent, it's been in it's case for probably 20 years and after taking one photo the mirror locked in the up position. Additionally the film counter is on S and the film advance lever is locked. I just replaced the battery, everything looks clean, tried putting film in, but I couldn't get anything to work.  \n\n\nAny advice from my film guru friends?", "link": "https://www.reddit.com/r/Nikon/comments/i8ky21/nikon_fg_stuck/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fg stuck /!/ hey i just received a nikon fg as a gift from a grandparent, it's been in it's case for probably 20 years and after taking one photo the mirror locked in the up -----> position !!! . additionally the film counter is on s and the film advance lever is locked. i just replaced the battery, everything looks clean, tried putting film in, but i couldn't get anything to work.  \n\n\nany advice from my film guru friends?", "sortedWord": "None", "identifyer": 30903, "year": "2020"}, {"Unnamed: 0": 30539, "autor": "pi-town", "date": 1606942222000, "content": "SnapBridge WB limitations. Alternatives? /!/ I just realized the WB features in SnapBridge have been updated. In previous versions, Auto WB was the only option available. Back then, the convenience of being able to “tap-to-focus” as well as check/change exposure came with the caveat of Auto WB possibly creating inconsistencies. For me, that came in the form of some footage being cool while other footage was warm, ceteris paribus (maybe slight changes in natural light or the subject moving slightly in the frame caused Auto WB to recalibrate in between takes?)\n\nCurrently, SnapBridge now allows you to select WB presets as well as Auto WB. Those presets are as follows: Direct Sunlight [5200k], Cloudy [6000k], Shade [8000k], Incandescent [3000k] and a Fluorescent preset. Unfortunately, presets for various fluorescent bulbs are not available and furthermore custom WB presets are also unavailable. While I’m happy to have something other than Auto WB so I can avoid changes in color while shooting in the same setting for long periods of time not having the ability to dial in a Custom WB has left me feeling unsatisfied. \n\nI use a D780 to film videos of myself working on projects so having “tap-to-focus” on the ready is extremely important. Also, I feel like it goes without saying that when filming yourself, live previews are also important for checking composition and exposure but being able to also remotely change said settings via your live preview is not only convenient but ideal for situations when you want to avoid accidentally moving the camera’s position.\n\nThis newest version of SnapBridge is an improvement on the last but I still feel using the application puts a governor on the camera’s abilities. Unfortunately, I am using Mac OS so ControlMyNikon is not an option. If anyone has any alternative recommendations, I’d be interested to check them out.", "link": "https://www.reddit.com/r/Nikon/comments/k5i342/snapbridge_wb_limitations_alternatives/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "snapbridge wb limitations. alternatives? /!/ i just realized the wb features in snapbridge have been updated. in previous versions, auto wb was the only option available. back then, the convenience of being able to “tap-to-focus” as well as check/change exposure came with the caveat of auto wb possibly creating inconsistencies. for me, that came in the form of some footage being cool while other footage was warm, ceteris paribus (maybe slight changes in natural light or the subject moving slightly in the frame caused auto wb to recalibrate in between takes?)\n\ncurrently, snapbridge now allows you to select wb presets as well as auto wb. those presets are as follows: direct sunlight [5200k], cloudy [6000k], shade [8000k], incandescent [3000k] and a fluorescent preset. unfortunately, presets for various fluorescent bulbs are not available and furthermore custom wb presets are also unavailable. while i’m happy to have something other than auto wb so i can avoid changes in color while shooting in the same setting for long periods of time not having the ability to dial in a custom wb has left me feeling unsatisfied. \n\ni use a d780 to film videos of myself working on projects so having “tap-to-focus” on the ready is extremely important. also, i feel like it goes without saying that when filming yourself, live previews are also important for checking composition and exposure but being able to also remotely change said settings via your live preview is not only convenient but ideal for situations when you want to avoid accidentally moving the camera’s -----> position !!! .\n\nthis newest version of snapbridge is an improvement on the last but i still feel using the application puts a governor on the camera’s abilities. unfortunately, i am using mac os so controlmynikon is not an option. if anyone has any alternative recommendations, i’d be interested to check them out.", "sortedWord": "None", "identifyer": 31172, "year": "2020"}, {"Unnamed: 0": 30817, "autor": "BITCHAMIGO", "date": 1606237886000, "content": "I need help, please /!/ This is probably out of the topic but idk where to ask this. My Nikon Coolpix L810 zoom is making a loud and horrible sound. With the sound comes a shift in the picture.( like on the screen, the image shows like is being pulled to the side, but then recovers, taking a picture with zoom is difficult cuz the zoom changes the position and the picure comes out like is moving, even tho is perfectly still) this only happends when the zoom is fully extended. At a specific zoom it can be seen the shift in the picture. Is like is being cropped? But like still intact? I dont even know. I looked inside the lenses and i could've seen the shift, i thought that it was broken, but it looks intact. I have a video but dont know if im allowed to post it. Did this happened to anyone here? I tried to open the lense cap but i couldn't. Coud it be some dust moving the zoom in such position that it would disturb the aligned lenses? If so, how can i fix it? Im sorry if i didnt explain correctly or i didnt put is such way to be understandable, if you have any ideea or suggestion i would be grateful! Thank you for your time and have a good day!", "link": "https://www.reddit.com/r/Nikon/comments/k093j5/i_need_help_please/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i need help, please /!/ this is probably out of the topic but idk where to ask this. my nikon coolpix l810 zoom is making a loud and horrible sound. with the sound comes a shift in the picture.( like on the screen, the image shows like is being pulled to the side, but then recovers, taking a picture with zoom is difficult cuz the zoom changes the -----> position !!!  and the picure comes out like is moving, even tho is perfectly still) this only happends when the zoom is fully extended. at a specific zoom it can be seen the shift in the picture. is like is being cropped? but like still intact? i dont even know. i looked inside the lenses and i could've seen the shift, i thought that it was broken, but it looks intact. i have a video but dont know if im allowed to post it. did this happened to anyone here? i tried to open the lense cap but i couldn't. coud it be some dust moving the zoom in such position that it would disturb the aligned lenses? if so, how can i fix it? im sorry if i didnt explain correctly or i didnt put is such way to be understandable, if you have any ideea or suggestion i would be grateful! thank you for your time and have a good day!", "sortedWord": "None", "identifyer": 31461, "year": "2020"}], "name": "positionnikon2020"}