{"interestingcomments": [{"Unnamed: 0": 248251, "autor": "brooklynite", "date": 1539605288000, "content": "Z7 Discussion after my first weekend of shooting /!/ Was excited to get my Z7 close to launch day and then of course didn't have time to play with it.\n\nI am a long time full frame Nikon shooter and bought this camera hoping to hate/return it but.... now I'm having trouble.\n\nPros:\n\n* Exceptional white balance, 10 bit color noticeable\n* Auto ISO better than any Nikon I've ever used\n* Battery life significantly better than rated - I took \\~500 pictures and several videos and still had three notches left\n* On Fine\\* file size approximates the 850 - was concerned than on Fine it was \\~10mb\n\nCons\n\n* AF pretty wonky. Single spot is adjustable by joystick or screen touch. My large nose kept sticking the AF on a corner, not locked in center (I'm sure this is adjustable?)\n* Slow start-up/wake time - at least two seconds to get a shot off when the camera has slept\n* Viewfinder - might take some getting used to, still feels strange\n\nI'm just not sure I can sell my 850 and switch over to this. Will test the FTZ and my normal lenses and see what's what. Tough decision and I'm not a person who needs two $3k camera bodies. ", "link": "https://www.reddit.com/r/Nikon/comments/9oc35m/z7_discussion_after_my_first_weekend_of_shooting/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "z7 discussion after my first weekend of shooting /!/ was excited to get my z7 close to launch day and then of course didn't have time to play with it.\n\ni am a long time full frame nikon shooter and bought this camera hoping to hate/return it but.... now i'm having trouble.\n\npros:\n\n* exceptional white balance, 10 bit color noticeable\n* auto iso better than any nikon i've ever used\n* battery life significantly better than rated - i took \\~500 pictures and several videos and still had three notches left\n* on fine\\* file size approximates the 850 - was concerned than on fine it was \\~10mb\n\ncons\n\n* af pretty wonky. single -----> spot !!!  is adjustable by joystick or screen touch. my large nose kept sticking the af on a corner, not locked in center (i'm sure this is adjustable?)\n* slow start-up/wake time - at least two seconds to get a shot off when the camera has slept\n* viewfinder - might take some getting used to, still feels strange\n\ni'm just not sure i can sell my 850 and switch over to this. will test the ftz and my normal lenses and see what's what. tough decision and i'm not a person who needs two $3k camera bodies. ", "sortedWord": "None", "identifyer": 43555, "year": "2018"}, {"Unnamed: 0": 248294, "autor": "twistedhobbs", "date": 1539238457000, "content": "Nothing like finding your pictures online and they’ve been destroyed! Who can spot the issue?", "link": "https://www.reddit.com/r/Nikon/comments/9n7eki/nothing_like_finding_your_pictures_online_and/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nothing like finding your pictures online and they’ve been destroyed! who can -----> spot !!!  the issue?", "sortedWord": "None", "identifyer": 43598, "year": "2018"}, {"Unnamed: 0": 248438, "autor": "Export_Eh", "date": 1517587997000, "content": "Metering with Flash /!/ Hello,\n\nI'm a flash photography newbie but I'm learning. \n\nI thought with a TTL flash, it would adjust the metering in camera. \n\nWith my flash on it doesn't affect the meting on camera to show if it will be over exposed or under exposed. The scale in a darker room is always to the right (under exposed) with the flash on. \n\nHope I'm explaining this in a way that makes sense. \n\nSo right now my camera is set up the following way:\nNikon D5300\nManual mode. \nShutter 1/60, \nISO 100, \nF/2.8\nSpot metering\nCAMERON W700HS TTL-N Flash set on TTL\n\nI also have a CAMERON HSS 240 if needed. \n\nHow do I get the camera to meter with the flash or am I way out with my thinking?\n\nThank you in advance!", "link": "https://www.reddit.com/r/Nikon/comments/7usca7/metering_with_flash/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "metering with flash /!/ hello,\n\ni'm a flash photography newbie but i'm learning. \n\ni thought with a ttl flash, it would adjust the metering in camera. \n\nwith my flash on it doesn't affect the meting on camera to show if it will be over exposed or under exposed. the scale in a darker room is always to the right (under exposed) with the flash on. \n\nhope i'm explaining this in a way that makes sense. \n\nso right now my camera is set up the following way:\nnikon d5300\nmanual mode. \nshutter 1/60, \niso 100, \nf/2.8\n-----> spot !!!  metering\ncameron w700hs ttl-n flash set on ttl\n\ni also have a cameron hss 240 if needed. \n\nhow do i get the camera to meter with the flash or am i way out with my thinking?\n\nthank you in advance!", "sortedWord": "None", "identifyer": 43747, "year": "2018"}, {"Unnamed: 0": 248560, "autor": "2Ways", "date": 1523805272000, "content": "D750 Autofocus calibration/repair /!/ My D750 took a small knock. Everything appeared to be working but I've discovered the autofocus is out on all lenses. This can't be corrected using the fine tuning.  I checked autofocus with the screen on (which I believe uses the sensor for autofocus) and it's spot on.\n\nHas anyone else experienced this? Any idea on cost / feasibility to repair or calibrate?", "link": "https://www.reddit.com/r/Nikon/comments/8cfqpl/d750_autofocus_calibrationrepair/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d750 autofocus calibration/repair /!/ my d750 took a small knock. everything appeared to be working but i've discovered the autofocus is out on all lenses. this can't be corrected using the fine tuning.  i checked autofocus with the screen on (which i believe uses the sensor for autofocus) and it's -----> spot !!!  on.\n\nhas anyone else experienced this? any idea on cost / feasibility to repair or calibrate?", "sortedWord": "None", "identifyer": 43871, "year": "2018"}, {"Unnamed: 0": 248645, "autor": "NullandRandom", "date": 1530103303000, "content": "Need help to clear sensor dust/particle which doesn't come in the final picture /!/ I have a little weird situation. I have Nikon d5300 on which I can see a dust or some small particle from the view finder. But when I click a picture the spot doesn't come in the final picture. So I don't know how to remove it from there. Any help is appropriated.", "link": "https://www.reddit.com/r/Nikon/comments/8u9a88/need_help_to_clear_sensor_dustparticle_which/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need help to clear sensor dust/particle which doesn't come in the final picture /!/ i have a little weird situation. i have nikon d5300 on which i can see a dust or some small particle from the view finder. but when i click a picture the -----> spot !!!  doesn't come in the final picture. so i don't know how to remove it from there. any help is appropriated.", "sortedWord": "None", "identifyer": 43956, "year": "2018"}, {"Unnamed: 0": 248730, "autor": "ElDuderino1129", "date": 1533407070000, "content": "Buying a used D600 question. /!/ My main body is a D600, and I got one of the ones that continually spout out spots onto the sensor.  I’ve been contemplating purchasing a new body because of timelapses tying up that one.  I’ve seen a deal on KEH for some used D600 bodies, but knowing what they’re capable of in the spot department.  \n\nThe question is this: does Nikon still do free cleanings on this even though I’m not the original purchaser of said body?  My current D600 has been in twice, and don’t want to have the same problem.  Or should I just keep out for a D610?", "link": "https://www.reddit.com/r/Nikon/comments/94l94v/buying_a_used_d600_question/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "buying a used d600 question. /!/ my main body is a d600, and i got one of the ones that continually spout out -----> spots !!!  onto the sensor.  i’ve been contemplating purchasing a new body because of timelapses tying up that one.  i’ve seen a deal on keh for some used d600 bodies, but knowing what they’re capable of in the spot department.  \n\nthe question is this: does nikon still do free cleanings on this even though i’m not the original purchaser of said body?  my current d600 has been in twice, and don’t want to have the same problem.  or should i just keep out for a d610?", "sortedWord": "None", "identifyer": 44044, "year": "2018"}, {"Unnamed: 0": 248749, "autor": "EnglishBronco", "date": 1533218995000, "content": "Need advice: Issue after torrential rain, D750 /!/ Hey all,\n\nNot sure if anyone can help me with some advice but to cut a long story, I was caught in some torrential rain at the German F1 a couple weeks ago and my D750 appears to be... mostly okay however the viewfinder display is no longer appearing. The exposure meters and numbering along the bottom within the viewfinder are all appearing fine, however the black display and focus squares are no longer appearing within the viewfinder. I am still able to spot focus, move it around and take photos etc however I have no visual reference for more accurate focusing. I was wondering if anyone has any advice on a repair (if possible) or alternative ideas? Also sorry if this is the wrong sub to be dropping this in!\nThanks in advance!", "link": "https://www.reddit.com/r/Nikon/comments/93zl41/need_advice_issue_after_torrential_rain_d750/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need advice: issue after torrential rain, d750 /!/ hey all,\n\nnot sure if anyone can help me with some advice but to cut a long story, i was caught in some torrential rain at the german f1 a couple weeks ago and my d750 appears to be... mostly okay however the viewfinder display is no longer appearing. the exposure meters and numbering along the bottom within the viewfinder are all appearing fine, however the black display and focus squares are no longer appearing within the viewfinder. i am still able to -----> spot !!!  focus, move it around and take photos etc however i have no visual reference for more accurate focusing. i was wondering if anyone has any advice on a repair (if possible) or alternative ideas? also sorry if this is the wrong sub to be dropping this in!\nthanks in advance!", "sortedWord": "None", "identifyer": 44063, "year": "2018"}, {"Unnamed: 0": 249212, "autor": "NurseWizzle", "date": 1537801363000, "content": "Weird \"defect\" showing up on pics from D7100, three guys at the camera shop can't figure it out. /!/ https://imgur.com/a/xOn7eV1\n\nI just got this at a pretty good price last week. Maybe I know why!\n\nThe guys at the store can't figure it out. They cleaned the sensor and it didn't help. The spot appears in the same place in all pics (when it shows up) no matter what lens is used. I say \"when it shows up\" because in some pics you can't see it. Its really apparent in pics with a blue sky, not really apparent in other pics. \n\nAnyone have ideas?", "link": "https://www.reddit.com/r/Nikon/comments/9iinvp/weird_defect_showing_up_on_pics_from_d7100_three/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird \"defect\" showing up on pics from d7100, three guys at the camera shop can't figure it out. /!/ https://imgur.com/a/xon7ev1\n\ni just got this at a pretty good price last week. maybe i know why!\n\nthe guys at the store can't figure it out. they cleaned the sensor and it didn't help. the -----> spot !!!  appears in the same place in all pics (when it shows up) no matter what lens is used. i say \"when it shows up\" because in some pics you can't see it. its really apparent in pics with a blue sky, not really apparent in other pics. \n\nanyone have ideas?", "sortedWord": "None", "identifyer": 44532, "year": "2018"}, {"Unnamed: 0": 249245, "autor": "ericcee613", "date": 1537560587000, "content": "Shooting My First Concert /!/ I’m sure this has been asked before (if so, please direct me to the thread), but from experience, what are some tips/words of advice when shooting your first concert? I’ve shot at a few little gigs in dark bars, but not in a theatre, which is where I’ll be shooting tomorrow. What settings should I be using? Spot metering? Continuous focus? Fast shutter speeds and wide apertures? I’m shooting with a D7100 and a 70-200 2.8. ", "link": "https://www.reddit.com/r/Nikon/comments/9htl35/shooting_my_first_concert/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shooting my first concert /!/ i’m sure this has been asked before (if so, please direct me to the thread), but from experience, what are some tips/words of advice when shooting your first concert? i’ve shot at a few little gigs in dark bars, but not in a theatre, which is where i’ll be shooting tomorrow. what settings should i be using? -----> spot !!!  metering? continuous focus? fast shutter speeds and wide apertures? i’m shooting with a d7100 and a 70-200 2.8. ", "sortedWord": "None", "identifyer": 44566, "year": "2018"}, {"Unnamed: 0": 249398, "autor": "PrymLens", "date": 1536085249000, "content": "Spotted: Nikon Middle East taking delivery of the first FTZ adapter", "link": "https://www.reddit.com/r/Nikon/comments/9cyakn/spotted_nikon_middle_east_taking_delivery_of_the/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! : nikon middle east taking delivery of the first ftz adapter", "sortedWord": "None", "identifyer": 44723, "year": "2018"}, {"Unnamed: 0": 249560, "autor": "SoneJason", "date": 1534379812000, "content": "Renting Lenses /!/ Hey friends. I own a D750, and I've been rocking the 50mm f/1.8 for a couple of years now, haven't got the budget to get any new lens yet. However, I'm going to be shooting a friend's wedding up in NorCal in two weeks, and I was thinking that I could rent a 24-70mm f/2.8. \n\nFor people who's familiar with renting, how's your experience? Also, got any recommendations for some good spots? ", "link": "https://www.reddit.com/r/Nikon/comments/97nnh3/renting_lenses/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "renting lenses /!/ hey friends. i own a d750, and i've been rocking the 50mm f/1.8 for a couple of years now, haven't got the budget to get any new lens yet. however, i'm going to be shooting a friend's wedding up in norcal in two weeks, and i was thinking that i could rent a 24-70mm f/2.8. \n\nfor people who's familiar with renting, how's your experience? also, got any recommendations for some good -----> spots !!! ? ", "sortedWord": "None", "identifyer": 44887, "year": "2018"}, {"Unnamed: 0": 249618, "autor": "UghKakis", "date": 1515622909000, "content": "Large spots through viewfinder. Looks like on the mirror /!/ I've tried to blow it off but no help. How can I get these off without ruining my camera? Spots don't come out in the picture, just very annoying. \n\nCan I take to a local camera store and have them clean it? \n\nIt's a d5300", "link": "https://www.reddit.com/r/Nikon/comments/7pjair/large_spots_through_viewfinder_looks_like_on_the/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "large -----> spots !!!  through viewfinder. looks like on the mirror /!/ i've tried to blow it off but no help. how can i get these off without ruining my camera? spots don't come out in the picture, just very annoying. \n\ncan i take to a local camera store and have them clean it? \n\nit's a d5300", "sortedWord": "None", "identifyer": 44945, "year": "2018"}, {"Unnamed: 0": 249621, "autor": "onstageguy", "date": 1515610793000, "content": "Dust spots in my Nikon D3 viewfinder. Cleaned everything and its still there! Help /!/ Hi There,\n\nI recently just bought a mint condition Nikon D3 with 3500 shutter clicks.\nI cleaned the exterior to remove any possible germs.\nAnd just cleaned The insides: Sensor, mirror, focusing screen on both sides, the interior side when i open the focusing screen. On the outside took out the round eyepiece and i cleaned the first glass piece from the viewfinder. Everything has been cleaned with special optic cleaning fluid + the sterile wipes on the stick (dunnno how you call 'em) + i used the blower at each on of them. I repeated this process twice but i still can see two dark dust spots in the top right corner. I even checked everything before closing in bright LED lamp.\nIts clear that its in the pentaprism. But what do you suggest me to do? I don't wanna send it to a shop, because its a pro body the cost is the same as if I would send a Nikon D5, which is ridiculous for a 10 year old camera.\nIs there any other lens opening?\nPlease let me know! I wanna calm down my \"OCD\"", "link": "https://www.reddit.com/r/Nikon/comments/7phsd9/dust_spots_in_my_nikon_d3_viewfinder_cleaned/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dust -----> spots !!!  in my nikon d3 viewfinder. cleaned everything and its still there! help /!/ hi there,\n\ni recently just bought a mint condition nikon d3 with 3500 shutter clicks.\ni cleaned the exterior to remove any possible germs.\nand just cleaned the insides: sensor, mirror, focusing screen on both sides, the interior side when i open the focusing screen. on the outside took out the round eyepiece and i cleaned the first glass piece from the viewfinder. everything has been cleaned with special optic cleaning fluid + the sterile wipes on the stick (dunnno how you call 'em) + i used the blower at each on of them. i repeated this process twice but i still can see two dark dust spots in the top right corner. i even checked everything before closing in bright led lamp.\nits clear that its in the pentaprism. but what do you suggest me to do? i don't wanna send it to a shop, because its a pro body the cost is the same as if i would send a nikon d5, which is ridiculous for a 10 year old camera.\nis there any other lens opening?\nplease let me know! i wanna calm down my \"ocd\"", "sortedWord": "None", "identifyer": 44948, "year": "2018"}, {"Unnamed: 0": 249711, "autor": "AmericanKamikaze", "date": 1521936023000, "content": "I shot an entire wedding in Lake Arrowhead with just a D750 and my 50mm 1.8G, that was an adventure. /!/ This was my first wedding with my D750\n\nFirstly the D750 lowlight is amazing. Cranked it up to iso 4000 to shoot 200th/s and the pictures look super clean. \n\nI have a 28mm 1.8g, a 35mm f2D the 50mm and my 80-200 afs (2 ring) The 28mm was too wide, my 35mm is older and the 80-200 was way to long. So I just left the 50mm on and zoomed with my feet. \n\nThe ring, shoes, etc detail shots I did at f1.8, the preparation I shot at f2.8 and he wedding was 80% f2.8 and 20% f1.8. \n\nIn the rooms I nailed the focus, but for some reason in the main room of the hotel where it was darker the 50mm didn’t even hunt, it just wouldn’t lock a focus. I found myself smashing on the shutter button and cycling the power/Manual/Autofocus switches. I really found it difficult to find a spot of light on their nose or eyebrow for it lock lock. \n\nThe 50mm ended up being just too narrow for shooting inside the hotel but I didn’t want to grab my other lenses, not enough time. I wish I had just bought the Tamron 24-70 G2 that I wanted but I’m not getting paid for this wedding so maybe next time. \n\nThe ceremony was outside and being so high up the wind was blowing the clouds at a good clip so one minute I was at 4000th/s and others I was 800th/s. Same with post wedding photos on the dock. The first half was bright and the second half was gloomy. \n\nAll in all I’m very happy with my D750. Better than my D700 was for sure. And I am less happy with the 50mm that came with the D750. Aperture Priority with Auto Iso didn’t work as well as I hoped. I spent too much time fiddling with the exposure compensation that I just switched back to manual.  \n\nOh, and can somebody tell me how to say (in Spanish) “Stop taking photos, you’re distracting the bride and groom.”? They had a cousin who was “Going to school for photography” with a D5200, kit lens, Sb600 and followed us around. \n\nAnyway, that’s for reading. I didn’t have anyone else to share my adventure with. ", "link": "https://www.reddit.com/r/Nikon/comments/86x3q5/i_shot_an_entire_wedding_in_lake_arrowhead_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i shot an entire wedding in lake arrowhead with just a d750 and my 50mm 1.8g, that was an adventure. /!/ this was my first wedding with my d750\n\nfirstly the d750 lowlight is amazing. cranked it up to iso 4000 to shoot 200th/s and the pictures look super clean. \n\ni have a 28mm 1.8g, a 35mm f2d the 50mm and my 80-200 afs (2 ring) the 28mm was too wide, my 35mm is older and the 80-200 was way to long. so i just left the 50mm on and zoomed with my feet. \n\nthe ring, shoes, etc detail shots i did at f1.8, the preparation i shot at f2.8 and he wedding was 80% f2.8 and 20% f1.8. \n\nin the rooms i nailed the focus, but for some reason in the main room of the hotel where it was darker the 50mm didn’t even hunt, it just wouldn’t lock a focus. i found myself smashing on the shutter button and cycling the power/manual/autofocus switches. i really found it difficult to find a -----> spot !!!  of light on their nose or eyebrow for it lock lock. \n\nthe 50mm ended up being just too narrow for shooting inside the hotel but i didn’t want to grab my other lenses, not enough time. i wish i had just bought the tamron 24-70 g2 that i wanted but i’m not getting paid for this wedding so maybe next time. \n\nthe ceremony was outside and being so high up the wind was blowing the clouds at a good clip so one minute i was at 4000th/s and others i was 800th/s. same with post wedding photos on the dock. the first half was bright and the second half was gloomy. \n\nall in all i’m very happy with my d750. better than my d700 was for sure. and i am less happy with the 50mm that came with the d750. aperture priority with auto iso didn’t work as well as i hoped. i spent too much time fiddling with the exposure compensation that i just switched back to manual.  \n\noh, and can somebody tell me how to say (in spanish) “stop taking photos, you’re distracting the bride and groom.”? they had a cousin who was “going to school for photography” with a d5200, kit lens, sb600 and followed us around. \n\nanyway, that’s for reading. i didn’t have anyone else to share my adventure with. ", "sortedWord": "None", "identifyer": 45040, "year": "2018"}, {"Unnamed: 0": 249780, "autor": "Scootermcgavin11", "date": 1521426116000, "content": "Thoughts/experiences with D610 /!/ Hi everyone, I’m new to this reddit so please bare with me. So I’ve been contemplating buying a fx camera and it’s pretty much between D750 and D610. From the research that I’ve done, it seems the only complaint about the D610 is the presence of oil spots. I was just curious if any one shoots with a D610 and can offer me some insight on the camera. Thank you!", "link": "https://www.reddit.com/r/Nikon/comments/85g71d/thoughtsexperiences_with_d610/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "thoughts/experiences with d610 /!/ hi everyone, i’m new to this reddit so please bare with me. so i’ve been contemplating buying a fx camera and it’s pretty much between d750 and d610. from the research that i’ve done, it seems the only complaint about the d610 is the presence of oil -----> spots !!! . i was just curious if any one shoots with a d610 and can offer me some insight on the camera. thank you!", "sortedWord": "None", "identifyer": 45109, "year": "2018"}, {"Unnamed: 0": 249818, "autor": "CityShooter", "date": 1522967769000, "content": "Eagle Spotting on 42nd Street. D610 with 24-120 F4. Handheld at 100 ISO", "link": "https://www.reddit.com/r/Nikon/comments/8a49m9/eagle_spotting_on_42nd_street_d610_with_24120_f4/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "eagle -----> spotting !!!  on 42nd street. d610 with 24-120 f4. handheld at 100 iso", "sortedWord": "None", "identifyer": 45149, "year": "2018"}, {"Unnamed: 0": 249939, "autor": "st3ph3n", "date": 1527974233000, "content": "80-200 2.8D - dirt on internal elements /!/ I have a Nikkor 80-200 f/2.8D lens that's probably about 15 years old now. It is the one with zoom and focus rings, not push-pull zoom. Unfortunately, today I noticed a bunch of ugly spots in several pictures I shot this morning. I thought it was just a case of my D610's sensor needing cleaning at first, but the spots weren't evident on shots taken with other lenses. I cleaned the front and rear elements of the 80-200, but when I look through it with the aperture ring set all the way open, I can still see a fairly significant amount of crud in there, and it appears to be on the internal elements.\n\nIn short, is there any way to clean this out, or am I screwed?\n\nYou can see several of the spots on this cropped picture I took today: https://flic.kr/p/26pHTar", "link": "https://www.reddit.com/r/Nikon/comments/8o3o8i/80200_28d_dirt_on_internal_elements/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "80-200 2.8d - dirt on internal elements /!/ i have a nikkor 80-200 f/2.8d lens that's probably about 15 years old now. it is the one with zoom and focus rings, not push-pull zoom. unfortunately, today i noticed a bunch of ugly -----> spots !!!  in several pictures i shot this morning. i thought it was just a case of my d610's sensor needing cleaning at first, but the spots weren't evident on shots taken with other lenses. i cleaned the front and rear elements of the 80-200, but when i look through it with the aperture ring set all the way open, i can still see a fairly significant amount of crud in there, and it appears to be on the internal elements.\n\nin short, is there any way to clean this out, or am i screwed?\n\nyou can see several of the spots on this cropped picture i took today: https://flic.kr/p/26phtar", "sortedWord": "None", "identifyer": 45271, "year": "2018"}, {"Unnamed: 0": 249954, "autor": "jeremyg729", "date": 1527797130000, "content": "Lens Sweet Spots /!/ [removed]", "link": "https://www.reddit.com/r/Nikon/comments/8nllq6/lens_sweet_spots/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "lens sweet -----> spots !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 45286, "year": "2018"}, {"Unnamed: 0": 250075, "autor": "hopsmonkey", "date": 1528991863000, "content": "D3400 Live View AF frame gets stuck /!/ Very often the AF frame seems to get ‘stuck’ in one spot (often way in a corner). Moving it away from the subject will not get it to reset, even if I then re-point at an obvious face subject. It’s pretty frustrating but I wouldn’t be surprised if I’m just doing it wrong. Any tips/tricks/suggestions very much appreciated!", "link": "https://www.reddit.com/r/Nikon/comments/8r2yxe/d3400_live_view_af_frame_gets_stuck/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d3400 live view af frame gets stuck /!/ very often the af frame seems to get ‘stuck’ in one -----> spot !!!  (often way in a corner). moving it away from the subject will not get it to reset, even if i then re-point at an obvious face subject. it’s pretty frustrating but i wouldn’t be surprised if i’m just doing it wrong. any tips/tricks/suggestions very much appreciated!", "sortedWord": "None", "identifyer": 45407, "year": "2018"}, {"Unnamed: 0": 250257, "autor": "JohnKuz", "date": 1519504872000, "content": "Another bald eagle arrived as I was shooting. I’ve spotted 7 eagles in the same area. Nikon COOLPIX P900.", "link": "https://www.reddit.com/r/Nikon/comments/7zzd5b/another_bald_eagle_arrived_as_i_was_shooting_ive/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "another bald eagle arrived as i was shooting. i’ve -----> spotted !!!  7 eagles in the same area. nikon coolpix p900.", "sortedWord": "None", "identifyer": 45592, "year": "2018"}, {"Unnamed: 0": 250377, "autor": "explodingliver", "date": 1532137823000, "content": "Need some advice/ideas for supplemental glass for a D800 w/ sigma lens? /!/ Hello! First post on here and was actually quite happy to see how active this subreddit is!\n\nI've recently made a very big upgrade from a Nikon D90 that I bought brand new 9 years ago up to the full-frame FX D800 camera body. The D90 has served me VERY well over the past 9 years but I figured if there was any time to upgrade, now was the best time!\n\nA big reason for the upgrade as well is because I was selling off a guitar I had and the guy helped \"pay\" for the guitar with a **Sigma 24-35mm f/2 DG Art lens**. I had already been thinking about upgrading my camera body for a while but now I felt like I was committed. \n\nSo that leaves me in a very weird spot...because I realize the focal range I get is *pretty short* and I know most guys go for a 24-70 for the versatility. And I've been looking through a ton of lenses and still don't have much of a clue on what would probably be my best bet. Another major thing is that many of the lenses I used for my D90 are for an APS-C sensor so I'm basically starting from scratch which is fine with me. I'll be selling those in the near future. \n\nMy budget is probably up to $500 max. I shoot mostly architecture, landscapes, some wildlife but not enough to constitute dropping big money on a lens, portraiture, street. Should I go for a zoom w/ more range like a 28-105mm Nikkor? Or go for a prime like an 50mm, 85mm, or 105mm for portraits?\n\nThanks guys!", "link": "https://www.reddit.com/r/Nikon/comments/90lscj/need_some_adviceideas_for_supplemental_glass_for/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need some advice/ideas for supplemental glass for a d800 w/ sigma lens? /!/ hello! first post on here and was actually quite happy to see how active this subreddit is!\n\ni've recently made a very big upgrade from a nikon d90 that i bought brand new 9 years ago up to the full-frame fx d800 camera body. the d90 has served me very well over the past 9 years but i figured if there was any time to upgrade, now was the best time!\n\na big reason for the upgrade as well is because i was selling off a guitar i had and the guy helped \"pay\" for the guitar with a **sigma 24-35mm f/2 dg art lens**. i had already been thinking about upgrading my camera body for a while but now i felt like i was committed. \n\nso that leaves me in a very weird -----> spot !!! ...because i realize the focal range i get is *pretty short* and i know most guys go for a 24-70 for the versatility. and i've been looking through a ton of lenses and still don't have much of a clue on what would probably be my best bet. another major thing is that many of the lenses i used for my d90 are for an aps-c sensor so i'm basically starting from scratch which is fine with me. i'll be selling those in the near future. \n\nmy budget is probably up to $500 max. i shoot mostly architecture, landscapes, some wildlife but not enough to constitute dropping big money on a lens, portraiture, street. should i go for a zoom w/ more range like a 28-105mm nikkor? or go for a prime like an 50mm, 85mm, or 105mm for portraits?\n\nthanks guys!", "sortedWord": "None", "identifyer": 45713, "year": "2018"}, {"Unnamed: 0": 250537, "autor": "riverfate", "date": 1534171046000, "content": "Cleaning d800 sensor /!/ Hi, looking for advice to clean the sensor on my d800.  Have tried using the camera mode, but one or two spots are still showing on the images.  I had heard the physically cleaning the sensor was a professional job?  Thanks in advance ", "link": "https://www.reddit.com/r/Nikon/comments/96ytla/cleaning_d800_sensor/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning d800 sensor /!/ hi, looking for advice to clean the sensor on my d800.  have tried using the camera mode, but one or two -----> spots !!!  are still showing on the images.  i had heard the physically cleaning the sensor was a professional job?  thanks in advance ", "sortedWord": "None", "identifyer": 45877, "year": "2018"}, {"Unnamed: 0": 251055, "autor": "DatPorkchop", "date": 1518619345000, "content": "Nikkor-Q 13.5cm spotted in the wild! (Used by UC Berkeley for a research project)", "link": "https://www.reddit.com/r/Nikon/comments/7xifz9/nikkorq_135cm_spotted_in_the_wild_used_by_uc/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "nikkor-q 13.5cm -----> spotted !!!  in the wild! (used by uc berkeley for a research project)", "sortedWord": "None", "identifyer": 46404, "year": "2018"}, {"Unnamed: 0": 251569, "autor": "JohnKuz", "date": 1519008735000, "content": "I spotted this beauty by the side of a bridge, parked and pulled out my Nikon COOLPIX P900. Bald Eagle, bird of prey.", "link": "https://www.reddit.com/r/Nikon/comments/7yjk50/i_spotted_this_beauty_by_the_side_of_a_bridge/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i -----> spotted !!!  this beauty by the side of a bridge, parked and pulled out my nikon coolpix p900. bald eagle, bird of prey.", "sortedWord": "None", "identifyer": 46925, "year": "2018"}, {"Unnamed: 0": 251621, "autor": "trackz1lla", "date": 1516399566000, "content": "Green lines appearing in images using D7200 with Nikkor 50mm f/1.8G /!/ Playing around with a newly acquired NIkkor 50mm f/1.8G lens and noticing green lines appearing at black/white transitions in some images.  In [image#1](https://i.imgur.com/W01MOrt.jpg) there are vertical green lines on the edges of the white posts behind the dog.  In [image#2](https://i.imgur.com/3ldwG86.jpg) I am seeing green lines around the black spot on the dog's back and along the edges where the white fur interacts with the blue carpet.  \n\nEver experience green lines such as this?  I do not think they are chromatic aberrations as LR does not remove them when checked.  ", "link": "https://www.reddit.com/r/Nikon/comments/7rlxxa/green_lines_appearing_in_images_using_d7200_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "green lines appearing in images using d7200 with nikkor 50mm f/1.8g /!/ playing around with a newly acquired nikkor 50mm f/1.8g lens and noticing green lines appearing at black/white transitions in some images.  in [image#1](https://i.imgur.com/w01mort.jpg) there are vertical green lines on the edges of the white posts behind the dog.  in [image#2](https://i.imgur.com/3ldwg86.jpg) i am seeing green lines around the black -----> spot !!!  on the dog's back and along the edges where the white fur interacts with the blue carpet.  \n\never experience green lines such as this?  i do not think they are chromatic aberrations as lr does not remove them when checked.  ", "sortedWord": "None", "identifyer": 46977, "year": "2018"}, {"Unnamed: 0": 251687, "autor": "dancedar", "date": 1527336712000, "content": "D7100 18-140 focus issues /!/ I've had a D80, D200 &amp; D300s and been shooting for over a decade, and bought a D7100 used from Jessops. I have two 18-140vr and and18-55vr &amp; started noticing focus issues occasionally from 18mm, and half the time between 35 &amp; 50mm. I've tested on tripods, vr off (on when handheld) at 1/1000 iso200 f5.6, middle focus point and a few around, reset camera etc, but really the issue is:\n\nUsing central AF (or other) point in A, focus locks and squeeze shutter/timer release on tripod, but the focus is way off, not a simple back/front focus. This image shows a typical example: https://www.dropbox.com/s/i5ezzpqtsve4d6a/2.jpg?dl=0\n\nSooc &amp; 2 other screenshots at https://www.dropbox.com/sh/exflxhptzjy0elq/AAB2w8DaPQ86SK9bVmBsQliha?dl=0\n\nExact same lenses on a D3400 has no issue at all. I've tried re-focussing, changing point. In A, single shot, af-c or af-s both same.\n\nIt's not shutter speed/handheld issue, it's clearly saying it's locked on to chosen af point when something is actually out. Shooting on a 50mm 1.8D (which uses cameras af drive not internal lens drive) is fine 100% of the time at the same apetures. Live View of course works perfectly as uses contrast af rather than the af &amp; mirror system. I'm taking care focussing, and unfocussing before each shot so it's not using 'old' focus values.\n\nOne thing I noticed was the mirror has clear swabbing/cleaning streaks down it when it arrived - could this be the issue?\n\nI'm at a complete loss as to what this could be, and using any of the other af modes doesn't help - surely the 51-point should be accurate enough for these single spot focussing tests?\n", "link": "https://www.reddit.com/r/Nikon/comments/8m9rjc/d7100_18140_focus_issues/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d7100 18-140 focus issues /!/ i've had a d80, d200 &amp; d300s and been shooting for over a decade, and bought a d7100 used from jessops. i have two 18-140vr and and18-55vr &amp; started noticing focus issues occasionally from 18mm, and half the time between 35 &amp; 50mm. i've tested on tripods, vr off (on when handheld) at 1/1000 iso200 f5.6, middle focus point and a few around, reset camera etc, but really the issue is:\n\nusing central af (or other) point in a, focus locks and squeeze shutter/timer release on tripod, but the focus is way off, not a simple back/front focus. this image shows a typical example: https://www.dropbox.com/s/i5ezzpqtsve4d6a/2.jpg?dl=0\n\nsooc &amp; 2 other screenshots at https://www.dropbox.com/sh/exflxhptzjy0elq/aab2w8dapq86sk9bvmbsqliha?dl=0\n\nexact same lenses on a d3400 has no issue at all. i've tried re-focussing, changing point. in a, single shot, af-c or af-s both same.\n\nit's not shutter speed/handheld issue, it's clearly saying it's locked on to chosen af point when something is actually out. shooting on a 50mm 1.8d (which uses cameras af drive not internal lens drive) is fine 100% of the time at the same apetures. live view of course works perfectly as uses contrast af rather than the af &amp; mirror system. i'm taking care focussing, and unfocussing before each shot so it's not using 'old' focus values.\n\none thing i noticed was the mirror has clear swabbing/cleaning streaks down it when it arrived - could this be the issue?\n\ni'm at a complete loss as to what this could be, and using any of the other af modes doesn't help - surely the 51-point should be accurate enough for these single -----> spot !!!  focussing tests?\n", "sortedWord": "None", "identifyer": 47043, "year": "2018"}, {"Unnamed: 0": 251700, "autor": "notsolurkinglurker", "date": 1543396012000, "content": "Lens repair/service question for 18mm 2.8AF-D /!/ hello r/nikon\n\nMy 18mm 2.8 afd was recently dropped from abt 1 foot onto wood, putting a slight but noticeable (and nonetheless annoying) dent on the filter threads. Filters still screw on but its finicky. There doesnt seem to be any damage done to the glass elements, but better safe than sorry. \n\nIts a rare-ish lens nowadays (in my experience) and im not sure how common parts are. I could do with the ring being shaped back close to its original state, for now, though I would eventually like to have it replaced with a new part. This lens is imperative to my work and its my favorite out of them all, so I find it worth the trouble/money.\n\nIf you guys have any suggestions, id love to know. Regardless im going to a local spot for now to see what they could do and for how much. will also check in with nikon to see what can be done.\n\nthanks!", "link": "https://www.reddit.com/r/Nikon/comments/a14kuz/lens_repairservice_question_for_18mm_28afd/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens repair/service question for 18mm 2.8af-d /!/ hello r/nikon\n\nmy 18mm 2.8 afd was recently dropped from abt 1 foot onto wood, putting a slight but noticeable (and nonetheless annoying) dent on the filter threads. filters still screw on but its finicky. there doesnt seem to be any damage done to the glass elements, but better safe than sorry. \n\nits a rare-ish lens nowadays (in my experience) and im not sure how common parts are. i could do with the ring being shaped back close to its original state, for now, though i would eventually like to have it replaced with a new part. this lens is imperative to my work and its my favorite out of them all, so i find it worth the trouble/money.\n\nif you guys have any suggestions, id love to know. regardless im going to a local -----> spot !!!  for now to see what they could do and for how much. will also check in with nikon to see what can be done.\n\nthanks!", "sortedWord": "None", "identifyer": 47056, "year": "2018"}, {"Unnamed: 0": 251835, "autor": "SunshineAndPenguins", "date": 1541169980000, "content": "Will I be happy with a D750? /!/ I need an upgrade to my DSLR.. I've always had a soft spot for the D750, despite only having used one briefly. I've got the money set aside for a new body and it's my leading choice. They're still quite expensive here even used and I know it's an older design. I often see D800s for less money which would say to me that the 750 is somehow a better camera? I havnt seen many negative things about the 750, the biggest complaints that I see are the shutter recall, a 'non pro body'? And the AF points not being laid out great.. However in the short time that I used one, I thought the AF was incredibly fast and accurate (although I didn't get a chance to do moving targets). I do a bit of everything, a lot of outdoor / animal photography.. But lately some indoor and lower light photography, where my camera is really falling short. The useable ISO range in the 750 blows my camera away.\n\nIs there a better body for the money? I know generally people say for wildlife, a crop sensor is better but I've been getting more and more into other things where a FF low light advantage would help significantly.\n\nI have looked at a D7xxx but for what they also go for used here, it seems like the 750 is still a better camera in every way so I might as well just spend the extra.\n\nMy other big concern is if Nikon comes out with a replacement soon.. Did I just spend 1800 on a now obsolete camera when a new one won't be a crazy amount more. Any D750 owners have any drawbacks I might not be thinking about? Any quirks? Why do they consider it a non pro body? Is it just the layout, or does the IQ suffer as well\n", "link": "https://www.reddit.com/r/Nikon/comments/9tkq85/will_i_be_happy_with_a_d750/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "will i be happy with a d750? /!/ i need an upgrade to my dslr.. i've always had a soft -----> spot !!!  for the d750, despite only having used one briefly. i've got the money set aside for a new body and it's my leading choice. they're still quite expensive here even used and i know it's an older design. i often see d800s for less money which would say to me that the 750 is somehow a better camera? i havnt seen many negative things about the 750, the biggest complaints that i see are the shutter recall, a 'non pro body'? and the af points not being laid out great.. however in the short time that i used one, i thought the af was incredibly fast and accurate (although i didn't get a chance to do moving targets). i do a bit of everything, a lot of outdoor / animal photography.. but lately some indoor and lower light photography, where my camera is really falling short. the useable iso range in the 750 blows my camera away.\n\nis there a better body for the money? i know generally people say for wildlife, a crop sensor is better but i've been getting more and more into other things where a ff low light advantage would help significantly.\n\ni have looked at a d7xxx but for what they also go for used here, it seems like the 750 is still a better camera in every way so i might as well just spend the extra.\n\nmy other big concern is if nikon comes out with a replacement soon.. did i just spend 1800 on a now obsolete camera when a new one won't be a crazy amount more. any d750 owners have any drawbacks i might not be thinking about? any quirks? why do they consider it a non pro body? is it just the layout, or does the iq suffer as well\n", "sortedWord": "None", "identifyer": 47191, "year": "2018"}, {"Unnamed: 0": 251948, "autor": "brackmania", "date": 1530656139000, "content": "Spotted Dolphins off the coast of Pico Island, Azores - D5600 + 55-200mm (55mm, 1/2000, f7.1, ISO 400)", "link": "https://www.reddit.com/r/Nikon/comments/8vwd97/spotted_dolphins_off_the_coast_of_pico_island/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  dolphins off the coast of pico island, azores - d5600 + 55-200mm (55mm, 1/2000, f7.1, iso 400)", "sortedWord": "None", "identifyer": 47306, "year": "2018"}, {"Unnamed: 0": 251966, "autor": "JoePilot93", "date": 1530548972000, "content": "I happened to catch this little guy while plane spotting at Dulles last week. [Nikon D3400 + Nikon 70-300mm f/11)", "link": "https://www.reddit.com/r/Nikon/comments/8vjzvx/i_happened_to_catch_this_little_guy_while_plane/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "i happened to catch this little guy while plane -----> spotting !!!  at dulles last week. [nikon d3400 + nikon 70-300mm f/11)", "sortedWord": "None", "identifyer": 47324, "year": "2018"}], "name": "spotnikon2018"}