{"interestingcomments": [{"Unnamed: 0": 353, "autor": "cybertec69", "date": 1551416053000, "content": "Northern Cardinal during sunset, D500 and Nikon 200-500mm hand held, shot at 500mm, f6. 3, shutter speed 1/320, ISO 3200, spot metering. PP using DXO PhotoLab Elite and Affinity photo.", "link": "https://www.reddit.com/r/Nikon/comments/aw0s7q/northern_cardinal_during_sunset_d500_and_nikon/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "northern cardinal during sunset, d500 and nikon 200-500mm hand held, shot at 500mm, f6. 3, shutter speed 1/320, iso 3200, -----> spot !!!  metering. pp using dxo photolab elite and affinity photo.", "sortedWord": "None", "identifyer": 359, "year": "2019"}, {"Unnamed: 0": 532, "autor": "coxyuk2017", "date": 1575071521000, "content": "Z6 and 105mm f1.4 for dance photography /!/ I’ve recently been shooting with a Sony A6400 which has amazing af but less good ergonomics. I’m tempted back to ff and still have a soft spot for the way Nikon’s handle. Anyone here been using the Z6 and 105mm f1.4 (with adapter) for dance photography?  Interested to know how it performs.  AF on the D800 has always been hit and miss and I’m hearing mixed reports about the Z6 also.", "link": "https://www.reddit.com/r/Nikon/comments/e3ncz5/z6_and_105mm_f14_for_dance_photography/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "z6 and 105mm f1.4 for dance photography /!/ i’ve recently been shooting with a sony a6400 which has amazing af but less good ergonomics. i’m tempted back to ff and still have a soft -----> spot !!!  for the way nikon’s handle. anyone here been using the z6 and 105mm f1.4 (with adapter) for dance photography?  interested to know how it performs.  af on the d800 has always been hit and miss and i’m hearing mixed reports about the z6 also.", "sortedWord": "None", "identifyer": 541, "year": "2019"}, {"Unnamed: 0": 858, "autor": "Sailor806", "date": 1557674771000, "content": "Timing is everything in shooting sports. Nikon D-750 Sigma 70-200mm 2.8. Can you spot the ball?", "link": "https://www.reddit.com/r/Nikon/comments/bnq4ib/timing_is_everything_in_shooting_sports_nikon/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "timing is everything in shooting sports. nikon d-750 sigma 70-200mm 2.8. can you -----> spot !!!  the ball?", "sortedWord": "None", "identifyer": 868, "year": "2019"}, {"Unnamed: 0": 1008, "autor": "Septimus__", "date": 1568289604000, "content": "Literally bought my Z6 today and it has 1 stuck / hot pixel, blue all the time in same spot... /!/ Should I go back to the store and ask for a new body... or what should I do?  \nSo strange and unexpected. Although it's 1 tiny dot on the LCD... it's still annoying! Distracts me.", "link": "https://www.reddit.com/r/Nikon/comments/d36u55/literally_bought_my_z6_today_and_it_has_1_stuck/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "literally bought my z6 today and it has 1 stuck / hot pixel, blue all the time in same -----> spot !!! ... /!/ should i go back to the store and ask for a new body... or what should i do?  \nso strange and unexpected. although it's 1 tiny dot on the lcd... it's still annoying! distracts me.", "sortedWord": "None", "identifyer": 1018, "year": "2019"}, {"Unnamed: 0": 1136, "autor": "my_name_is_jody", "date": 1557070065000, "content": "I upgraded from a D90 to a Z6. Here's what I gained and lost. /!/ I recently upgraded from a D90...a 10year old camera, which was my first and only DSLR that I have had for 10 years. This is my experience over the past couple months after upgrading.  My perspective is as a historically budget conscious user.\n\n# tl;dr\nThe Z6 is amazing camera and a massive upgrade in so many ways, but I wish there were a few less tradeoffs, especially ones that cost me MORE money after dropping $2300 on the camera body (and adapter).  I was never going to buy a Sony or Canon....but I still have to replace ALL my lenses...so in retrospect, why was I so against that?  I probably could have gotten my top 2 benefits by buying a D7500 without a lot of the tradeoffs including not replacing all my lenses.  Ask me again in a year when I've finished replacing all my lenses.\n\n# Things I Lost After Upgrading\n* No wireless raw transfer to my phone (I had an eyefi type memory card)...this is literally not possible on the Z6.\n* A dead simple (and cheap) wireless shutter trigger (D90 - infrared $12... Z6 uses snap bridge which is still a bit flaky and takes awhile to connect or a  $200 ~~thing~~ WR-R10&amp;WR-T10). \n* Insanely good battery life ...I didn't own a 2nd battery until last year....I would go entire vacations without having to recharge the D90's...The Z6 lasts...a LOT less longer.  I just bought 2 batteries to deal with this.\n* No more AF-A mode (didn't reallllly care, I use back button AF-C 95% of the time)\n* Need to buy new memory card(s)...at $150 each.  (but I got a free one with the purchase of my camera body)\n* No wireless CLS flash system with TTL cause there's no built in flash (need to buy an su-800 or something else to control off camera flashes) (I have an sb-600, an sb-24, and own cactus triggers, so this isn't that big of a loss.)\n* ~~No easy flash compensation control (not even in (i) menu)~~ Nevermind, it's built in to regular exposure compensation.  See setting e3.\n\n# Things I Gained\n## Game Changers:\n* ISO performance is off the charts compared to the D90 which honestly maxed out at 1600 before becoming a complete mess.\n* Awesome auto ISO that's very easy to turn on/off (hold iso button, roll front dial) ...D90's sucked mostly because so much noise even at 800 or 1600. \n* WYSIWYG Mode (settings applied to viewfinder)\n* In.Body.Image.Stabilization!!!  All non-stabilized lenses are now stabilized.  All non-VR lenses (non-screw AF) just got a boost in value.  \n* Can use my dad's M42 mount lenses... awesome. They're manual focus, and the focus peaking is EXTREMELY awesome in helping focus...esp on the 50mm 1.4 that I have. AND they now get IBIS!! \n* Not just usable, but great video capability.  The D90 was the first DSLR with video...and it sucked.  Rolling shutter was horrendous so panning was basically not allowed.  I never took video because of this...I'm excited to use video for, really, the first time ever.\n* Soon to be Eye-AF.  Assuming it works well.\n\n## Also good stuff:\n* Higher image quality\n* Much better metering...D90 feels almost unusable now (maybe I'm exaggerating)\n* LOTS of customizable buttons...but this is almost negated by all the missing dedicated buttons on the D90.  For example, in my current configuration which takes into account the { i } button...which is less good than a dedicated button, I'm losing these buttons in the Z6 - ~~Flash compensation/Flash setting (slow, etc)~~, My Menu, Physical Autofocus/Manual focus switch...but most lenses have that so maybe who cares.\n* On screen level (that i keep forgetting is there, but my landscapes were perpetually off level with D90)\n* Silent mode.  Ever take photos at a baptism in a quiet church? The D90 shutter was like a gunshot.  Z6 is literally 0 noise.  And it can deal with light flicker which is apparently a problem on other mirrorless cameras' silent modes.\n* Built in focus shift shooting (excited to use this...never bothered with D90)\n* Interval timer &amp; Timelapse movie (haven't used....but want to)\n* Face Detection...but it kinda struggles to do what I expect/want sometimes.  (Soon to be eye AF....we'll see)\n* WAY more focus points. D90 had like 12, this has like, infinity.\n\n## I don't care new stuff:\n* Up/down tilty screen (which is sometimes kinda useful...low shots &amp; crowd shots I guess)\n* Prettier/bigger LCD\n* Faster FPS (that I don't use)\n* Insane buffer (that I don't use)\n* On screen histogram...but who cares cause you can see the actual photo before you take it with the WYSIWYG mode\n* Built in HDR -- would rather do in post, doesn't work with RAW anyway\n* Touch screen\n* STAR quality settings for jpg.\n\n# BAD\n## Very Bad:\n* Lightroom automatically applied lens profiles that you can't turn off and thus spot and local image corrections are s...l...o...w.  There's a reason the lens correction is at the bottom of the workflow in Lightroom.\n* My lenses aren't good enough.\n-- My screw type AF lenses don't AF anymore and need to be replaced\n-- My DX lenses (all but the screw one) all make the Z6 have 10mp instead of the 12 I had on D90...literally a downgrade.  They technically work, but why.\n-- My Sigma 17-50mm f/2.8 has a bug that causes it to keep the IBIS on 100% of the time which kills the entire battery in like 1.5hrs. I THINK it's even on when the camera is off?  Haven't fully tested, but my battery has gone down with that lens on and charging through the USB-C cable\n* DUST!  I literally never got dust on my D90 sensor.  Z6 has had it almost every time I shoot.  Cleaning needs become a ritual.\n\n## Just Annoying: \n* U1/U2/U3 settings (that I don't use and screwed me into taking a ton of small jpgs instead of raw once)\nable. okok, I should learn to use them...they seem pretty cool.\n* Compared to the D90, it's SO. SLOW. to turn on after going to sleep.  It might be 1 second, but feels like forever.\n* Bad situation with the FTZ adapter and tripods.  Normal plates struggle to fit on the camera when FTZ is there, so if you're switching between Z and F mount lenses, you maybe have to have 2 plates ...one attached to the FTZ, and one directly on the camera.  OR you could keep moving the plate...ew.  \n* Lenses are expensive....kit lens is $900 if you didn't get the kit (like my dumb self)\n* Z mount prime lenses are big...1.5 - 2.x the size of their F mount equivalent.  \n\n## Disappointingly Break Even:\nWeight.  The D90 weighs almost exactly the same as the Z6 with the FTZ adapter.  oh well.\n\n\nHopefully I don't sound too ungrateful here.  My intention is to illustrate some of the tradeoffs when switching from a DSLR to mirrorless, and also from switching from a amateur level to a pro level (or at least near-pro).  Happy to hear any feedback. Thanks for reading!", "link": "https://www.reddit.com/r/Nikon/comments/bkz009/i_upgraded_from_a_d90_to_a_z6_heres_what_i_gained/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i upgraded from a d90 to a z6. here's what i gained and lost. /!/ i recently upgraded from a d90...a 10year old camera, which was my first and only dslr that i have had for 10 years. this is my experience over the past couple months after upgrading.  my perspective is as a historically budget conscious user.\n\n# tl;dr\nthe z6 is amazing camera and a massive upgrade in so many ways, but i wish there were a few less tradeoffs, especially ones that cost me more money after dropping $2300 on the camera body (and adapter).  i was never going to buy a sony or canon....but i still have to replace all my lenses...so in retrospect, why was i so against that?  i probably could have gotten my top 2 benefits by buying a d7500 without a lot of the tradeoffs including not replacing all my lenses.  ask me again in a year when i've finished replacing all my lenses.\n\n# things i lost after upgrading\n* no wireless raw transfer to my phone (i had an eyefi type memory card)...this is literally not possible on the z6.\n* a dead simple (and cheap) wireless shutter trigger (d90 - infrared $12... z6 uses snap bridge which is still a bit flaky and takes awhile to connect or a  $200 ~~thing~~ wr-r10&amp;wr-t10). \n* insanely good battery life ...i didn't own a 2nd battery until last year....i would go entire vacations without having to recharge the d90's...the z6 lasts...a lot less longer.  i just bought 2 batteries to deal with this.\n* no more af-a mode (didn't reallllly care, i use back button af-c 95% of the time)\n* need to buy new memory card(s)...at $150 each.  (but i got a free one with the purchase of my camera body)\n* no wireless cls flash system with ttl cause there's no built in flash (need to buy an su-800 or something else to control off camera flashes) (i have an sb-600, an sb-24, and own cactus triggers, so this isn't that big of a loss.)\n* ~~no easy flash compensation control (not even in (i) menu)~~ nevermind, it's built in to regular exposure compensation.  see setting e3.\n\n# things i gained\n## game changers:\n* iso performance is off the charts compared to the d90 which honestly maxed out at 1600 before becoming a complete mess.\n* awesome auto iso that's very easy to turn on/off (hold iso button, roll front dial) ...d90's sucked mostly because so much noise even at 800 or 1600. \n* wysiwyg mode (settings applied to viewfinder)\n* in.body.image.stabilization!!!  all non-stabilized lenses are now stabilized.  all non-vr lenses (non-screw af) just got a boost in value.  \n* can use my dad's m42 mount lenses... awesome. they're manual focus, and the focus peaking is extremely awesome in helping focus...esp on the 50mm 1.4 that i have. and they now get ibis!! \n* not just usable, but great video capability.  the d90 was the first dslr with video...and it sucked.  rolling shutter was horrendous so panning was basically not allowed.  i never took video because of this...i'm excited to use video for, really, the first time ever.\n* soon to be eye-af.  assuming it works well.\n\n## also good stuff:\n* higher image quality\n* much better metering...d90 feels almost unusable now (maybe i'm exaggerating)\n* lots of customizable buttons...but this is almost negated by all the missing dedicated buttons on the d90.  for example, in my current configuration which takes into account the { i } button...which is less good than a dedicated button, i'm losing these buttons in the z6 - ~~flash compensation/flash setting (slow, etc)~~, my menu, physical autofocus/manual focus switch...but most lenses have that so maybe who cares.\n* on screen level (that i keep forgetting is there, but my landscapes were perpetually off level with d90)\n* silent mode.  ever take photos at a baptism in a quiet church? the d90 shutter was like a gunshot.  z6 is literally 0 noise.  and it can deal with light flicker which is apparently a problem on other mirrorless cameras' silent modes.\n* built in focus shift shooting (excited to use this...never bothered with d90)\n* interval timer &amp; timelapse movie (haven't used....but want to)\n* face detection...but it kinda struggles to do what i expect/want sometimes.  (soon to be eye af....we'll see)\n* way more focus points. d90 had like 12, this has like, infinity.\n\n## i don't care new stuff:\n* up/down tilty screen (which is sometimes kinda useful...low shots &amp; crowd shots i guess)\n* prettier/bigger lcd\n* faster fps (that i don't use)\n* insane buffer (that i don't use)\n* on screen histogram...but who cares cause you can see the actual photo before you take it with the wysiwyg mode\n* built in hdr -- would rather do in post, doesn't work with raw anyway\n* touch screen\n* star quality settings for jpg.\n\n# bad\n## very bad:\n* lightroom automatically applied lens profiles that you can't turn off and thus -----> spot !!!  and local image corrections are s...l...o...w.  there's a reason the lens correction is at the bottom of the workflow in lightroom.\n* my lenses aren't good enough.\n-- my screw type af lenses don't af anymore and need to be replaced\n-- my dx lenses (all but the screw one) all make the z6 have 10mp instead of the 12 i had on d90...literally a downgrade.  they technically work, but why.\n-- my sigma 17-50mm f/2.8 has a bug that causes it to keep the ibis on 100% of the time which kills the entire battery in like 1.5hrs. i think it's even on when the camera is off?  haven't fully tested, but my battery has gone down with that lens on and charging through the usb-c cable\n* dust!  i literally never got dust on my d90 sensor.  z6 has had it almost every time i shoot.  cleaning needs become a ritual.\n\n## just annoying: \n* u1/u2/u3 settings (that i don't use and screwed me into taking a ton of small jpgs instead of raw once)\nable. okok, i should learn to use them...they seem pretty cool.\n* compared to the d90, it's so. slow. to turn on after going to sleep.  it might be 1 second, but feels like forever.\n* bad situation with the ftz adapter and tripods.  normal plates struggle to fit on the camera when ftz is there, so if you're switching between z and f mount lenses, you maybe have to have 2 plates ...one attached to the ftz, and one directly on the camera.  or you could keep moving the plate...ew.  \n* lenses are expensive....kit lens is $900 if you didn't get the kit (like my dumb self)\n* z mount prime lenses are big...1.5 - 2.x the size of their f mount equivalent.  \n\n## disappointingly break even:\nweight.  the d90 weighs almost exactly the same as the z6 with the ftz adapter.  oh well.\n\n\nhopefully i don't sound too ungrateful here.  my intention is to illustrate some of the tradeoffs when switching from a dslr to mirrorless, and also from switching from a amateur level to a pro level (or at least near-pro).  happy to hear any feedback. thanks for reading!", "sortedWord": "None", "identifyer": 1147, "year": "2019"}, {"Unnamed: 0": 1318, "autor": "I_am_no_Ghost", "date": 1546391727000, "content": "D200 weird spot shows up in photos /!/ My wife was outside shooting with my d200 and noticed a weird spot showed up in half her photos in the same spot. No lense change or anything. Lense wasnt bumped at all either. I'm thinking something got on the sensor but how do I check? If sensor is dirty how do I clean it?\n\nAlso the lense in question is a kit 18-55mm.\n\npicture showing spot showing up suddenly.\nhttps://imgur.com/a/0oBhsbn", "link": "https://www.reddit.com/r/Nikon/comments/abo96o/d200_weird_spot_shows_up_in_photos/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d200 weird -----> spot !!!  shows up in photos /!/ my wife was outside shooting with my d200 and noticed a weird spot showed up in half her photos in the same spot. no lense change or anything. lense wasnt bumped at all either. i'm thinking something got on the sensor but how do i check? if sensor is dirty how do i clean it?\n\nalso the lense in question is a kit 18-55mm.\n\npicture showing spot showing up suddenly.\nhttps://imgur.com/a/0obhsbn", "sortedWord": "None", "identifyer": 1329, "year": "2019"}, {"Unnamed: 0": 105562, "autor": "carry_a_laser", "date": 1558241494000, "content": "Underexposed photos: Metering Mode \"Other\", D850 + Tamron 70-200 f2.8 G2 /!/ Dear Nikon friends,\n\nI am dismayed having shot some nearly unusable photos on my D850 yesterday.  Conditions were rough - bright sunlight and about 40mph wind and I wasn't checking the screen as much as I should have.  However, in the middle of my shoot there is a string of about 55 shots (157 total) that are severely underexposed.  While trying to figure out why it happened, I checked the EXIF data and see on the good shots, I have:\n\n    Metering Mode                   : Multi-segment\n    ...\n    Matrix Metering                 : Face Detection On\n\nI'm pretty sure these were matrix metered shots...   I have no idea about face detection or why it would be on.\n\nOn the underexposed shots I have the following:\n\n    Metering Mode                   : Other\n    ...\n    Matrix Metering                 : Face Detection On\n\nBeing in quite a hurry, these photos were important to my clients (friends thankfully) and they were getting cold and so I may have missed something but I'm pretty sure I tried switching to Spot metering for some of these...   but the exif says otherwise (\"Other\").  \n\n&amp;#x200B;\n\nHas anyone else had this happen?  Hopefully it was just something I did wrong, but I am worried that something is wrong with the camera.  I'm not aware of an \"Other\" metering mode, so I'm not sure why it would write that to the exif.  Any thoughts or ideas are appreciated.  Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/bqd3yh/underexposed_photos_metering_mode_other_d850/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "underexposed photos: metering mode \"other\", d850 + tamron 70-200 f2.8 g2 /!/ dear nikon friends,\n\ni am dismayed having shot some nearly unusable photos on my d850 yesterday.  conditions were rough - bright sunlight and about 40mph wind and i wasn't checking the screen as much as i should have.  however, in the middle of my shoot there is a string of about 55 shots (157 total) that are severely underexposed.  while trying to figure out why it happened, i checked the exif data and see on the good shots, i have:\n\n    metering mode                   : multi-segment\n    ...\n    matrix metering                 : face detection on\n\ni'm pretty sure these were matrix metered shots...   i have no idea about face detection or why it would be on.\n\non the underexposed shots i have the following:\n\n    metering mode                   : other\n    ...\n    matrix metering                 : face detection on\n\nbeing in quite a hurry, these photos were important to my clients (friends thankfully) and they were getting cold and so i may have missed something but i'm pretty sure i tried switching to -----> spot !!!  metering for some of these...   but the exif says otherwise (\"other\").  \n\n&amp;#x200b;\n\nhas anyone else had this happen?  hopefully it was just something i did wrong, but i am worried that something is wrong with the camera.  i'm not aware of an \"other\" metering mode, so i'm not sure why it would write that to the exif.  any thoughts or ideas are appreciated.  thanks!", "sortedWord": "None", "identifyer": 8431, "year": "2019"}, {"Unnamed: 0": 105985, "autor": "paparoachfan420", "date": 1577559191000, "content": "Cleaning a 50mm 1.8 AI-S pancake? /!/ I was carrying my camera in some light mist and ended up with some condensation on the inside of the rear element.  There are 7 or 8 little water spots now - does anyone know how to go about cleaning this?  I haven't been able to find much info on it.  I just bought the lens in mint condition for about $200 and I think sending it off for repair will be near the cost of a new lens.", "link": "https://www.reddit.com/r/Nikon/comments/eguixg/cleaning_a_50mm_18_ais_pancake/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning a 50mm 1.8 ai-s pancake? /!/ i was carrying my camera in some light mist and ended up with some condensation on the inside of the rear element.  there are 7 or 8 little water -----> spots !!!  now - does anyone know how to go about cleaning this?  i haven't been able to find much info on it.  i just bought the lens in mint condition for about $200 and i think sending it off for repair will be near the cost of a new lens.", "sortedWord": "None", "identifyer": 8861, "year": "2019"}, {"Unnamed: 0": 106065, "autor": "raildriverpone", "date": 1561923607000, "content": "Looking to get help/input on finding where these \"spots\" are in my body and/or the lenses. I have a D3300 kit and both an 18-55mm lens and a 55-200mm lens. The image below was taken earlier today with the 55-200mm. Any more information needed can be provided. Thank you! /!/ &amp;#x200B;\n\nhttps://i.redd.it/v2pz7ahxoj731.png", "link": "https://www.reddit.com/r/Nikon/comments/c7il9x/looking_to_get_helpinput_on_finding_where_these/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looking to get help/input on finding where these \"-----> spots !!! \" are in my body and/or the lenses. i have a d3300 kit and both an 18-55mm lens and a 55-200mm lens. the image below was taken earlier today with the 55-200mm. any more information needed can be provided. thank you! /!/ &amp;#x200b;\n\nhttps://i.redd.it/v2pz7ahxoj731.png", "sortedWord": "None", "identifyer": 8942, "year": "2019"}, {"Unnamed: 0": 106141, "autor": "monsieur_mungo", "date": 1561563347000, "content": "One of my favorite Chicago spots. D610 Tonika 16-28mm F/2.8", "link": "https://www.reddit.com/r/Nikon/comments/c5rabj/one_of_my_favorite_chicago_spots_d610_tonika/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "one of my favorite chicago -----> spots !!! . d610 tonika 16-28mm f/2.8", "sortedWord": "None", "identifyer": 9020, "year": "2019"}, {"Unnamed: 0": 106222, "autor": "Mandaris_purake", "date": 1555353488000, "content": "Do lenses have a sweet spot for focal distance? /!/ I have a Nikon 200-500mm 5.6  and it seems to me that the images come out really sharp when I am focusing on subjects less than 50 feet away, and sometimes less sharp when the subject is 200 feet away.   \nI only use this lens in good to great light conditions and i never shoot slower than 1/400 because the lens is on a D7500 (cropped sensor camera). despite this some of the photos are not super while others are.  \nI'm just curious if any others have had this experience, or know how to resolve the issue.", "link": "https://www.reddit.com/r/Nikon/comments/bdjnq9/do_lenses_have_a_sweet_spot_for_focal_distance/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do lenses have a sweet -----> spot !!!  for focal distance? /!/ i have a nikon 200-500mm 5.6  and it seems to me that the images come out really sharp when i am focusing on subjects less than 50 feet away, and sometimes less sharp when the subject is 200 feet away.   \ni only use this lens in good to great light conditions and i never shoot slower than 1/400 because the lens is on a d7500 (cropped sensor camera). despite this some of the photos are not super while others are.  \ni'm just curious if any others have had this experience, or know how to resolve the issue.", "sortedWord": "None", "identifyer": 9103, "year": "2019"}, {"Unnamed: 0": 106292, "autor": "BojanM79", "date": 1566210642000, "content": "Two deer. One very suspicious :) D7500, 200-500 f5.6 - ISO 6400 260mm 1/1250s f8. Just arrived to the spot and one minute later \"pufff\" from the bushes. Camera settings totally off.", "link": "https://www.reddit.com/r/Nikon/comments/csf8y5/two_deer_one_very_suspicious_d7500_200500_f56_iso/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "two deer. one very suspicious :) d7500, 200-500 f5.6 - iso 6400 260mm 1/1250s f8. just arrived to the -----> spot !!!  and one minute later \"pufff\" from the bushes. camera settings totally off.", "sortedWord": "None", "identifyer": 9173, "year": "2019"}, {"Unnamed: 0": 106403, "autor": "Coronadoisdead", "date": 1563079698000, "content": "Do DX specific lenses already take crop into account on their reported focal length ranges? /!/ I got one of the newer 70-300mm 4.5-6.3 DX VR lenses in my D7500 kit.  I also have an older 70-300mm 4.5-5.3 G VR.\n\nBoth on the D7500 and on a tripod, here is the new DX specific lens at 300mm pointed at a disc:\n\n\\[Imgur\\]([https://i.imgur.com/RTCZKRP.jpg](https://i.imgur.com/RTCZKRP.jpg))\n\nAnd here is the older lens at 300mm pointed at the same thing from the same spot:\n\n\\[Imgur\\]([https://i.imgur.com/eYb4Nwt.jpg](https://i.imgur.com/eYb4Nwt.jpg))\n\nAny idea why the old one seems to zoom in farther?\n\nThanks!", "link": "https://www.reddit.com/r/Nikon/comments/ccz3l8/do_dx_specific_lenses_already_take_crop_into/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do dx specific lenses already take crop into account on their reported focal length ranges? /!/ i got one of the newer 70-300mm 4.5-6.3 dx vr lenses in my d7500 kit.  i also have an older 70-300mm 4.5-5.3 g vr.\n\nboth on the d7500 and on a tripod, here is the new dx specific lens at 300mm pointed at a disc:\n\n\\[imgur\\]([https://i.imgur.com/rtczkrp.jpg](https://i.imgur.com/rtczkrp.jpg))\n\nand here is the older lens at 300mm pointed at the same thing from the same -----> spot !!! :\n\n\\[imgur\\]([https://i.imgur.com/eyb4nwt.jpg](https://i.imgur.com/eyb4nwt.jpg))\n\nany idea why the old one seems to zoom in farther?\n\nthanks!", "sortedWord": "None", "identifyer": 9284, "year": "2019"}, {"Unnamed: 0": 106653, "autor": "itum26", "date": 1552503182000, "content": "Odd spots without showing on photos", "link": "https://www.reddit.com/r/Nikon/comments/b0ppqe/odd_spots_without_showing_on_photos/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "odd -----> spots !!!  without showing on photos", "sortedWord": "None", "identifyer": 9539, "year": "2019"}, {"Unnamed: 0": 106754, "autor": "brettmaverick82", "date": 1556906582000, "content": "Gear Advice: Nikon D600 /!/ So, I thought I scored a good deal on a lightly used D600 on ebay. Lowish shutter count, extra batteries etc. \n\n&amp;#x200B;\n\nI bought this as a backup to my D750 for a trip to Alaska at the end of this month and I also went into this knowing that there is a possibility of the sensor spewing oil and that it is covered by Nikon.\n\n&amp;#x200B;\n\nI can't find any oil/dust spots (sensor might have been cleaned before shipping) but one of the card slots does not function. The seller has been non-responsive and by the time ebay makes a decision on what to do, plus the time it will take for the refund to be approved I could have most likely shipped the body to Nikon under the recall and let them service it and have it back in my hands before I leave on the 22nd of this month. There is also a chance the camera wouldn't be back to me before I leave and I'll have to go on this trip with a single body. \n\n&amp;#x200B;\n\nHave any of you sent your D600 in for repair/service and if so what was your turn around time? Should I risk a one body trip or should I risk bringing a semi functional D600 with me and hope the main card slot does not die also or oil/dust starts showing up and potentially ruining images?\n\n&amp;#x200B;\n\nThoughts / Opinions / Advice?", "link": "https://www.reddit.com/r/Nikon/comments/bkbh6n/gear_advice_nikon_d600/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "gear advice: nikon d600 /!/ so, i thought i scored a good deal on a lightly used d600 on ebay. lowish shutter count, extra batteries etc. \n\n&amp;#x200b;\n\ni bought this as a backup to my d750 for a trip to alaska at the end of this month and i also went into this knowing that there is a possibility of the sensor spewing oil and that it is covered by nikon.\n\n&amp;#x200b;\n\ni can't find any oil/dust -----> spots !!!  (sensor might have been cleaned before shipping) but one of the card slots does not function. the seller has been non-responsive and by the time ebay makes a decision on what to do, plus the time it will take for the refund to be approved i could have most likely shipped the body to nikon under the recall and let them service it and have it back in my hands before i leave on the 22nd of this month. there is also a chance the camera wouldn't be back to me before i leave and i'll have to go on this trip with a single body. \n\n&amp;#x200b;\n\nhave any of you sent your d600 in for repair/service and if so what was your turn around time? should i risk a one body trip or should i risk bringing a semi functional d600 with me and hope the main card slot does not die also or oil/dust starts showing up and potentially ruining images?\n\n&amp;#x200b;\n\nthoughts / opinions / advice?", "sortedWord": "None", "identifyer": 9640, "year": "2019"}, {"Unnamed: 0": 106901, "autor": "Gamgee_The_Wise", "date": 1575732068000, "content": "Sherwink Trail is amazing! One the best spots in Newfoundland by far - Nikon D750 Nikkor 50mm", "link": "https://www.reddit.com/r/Nikon/comments/e7fhjp/sherwink_trail_is_amazing_one_the_best_spots_in/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sherwink trail is amazing! one the best -----> spots !!!  in newfoundland by far - nikon d750 nikkor 50mm", "sortedWord": "None", "identifyer": 9789, "year": "2019"}, {"Unnamed: 0": 106924, "autor": "MrNaturalAZ", "date": 1575519687000, "content": "Bought a used D3200 - what should I check to be sure it's good? /!/ (my first attempt at posting this got rejected by spambot - not sure why, perhaps because I named the vendor?)\n\nI just picked up a used D3200 body to replace my aging D40 (which has also developed a sensor defect - a red spot and accompanying vertical stripe). I'm looking forward to the upgrade. Yeah, it's a 7 year old model, but there haven't been any really huge changes in Nikon's 3000 range aside from the processor (resulting in higher ISO, faster burst mode, and 1080p60 video). I think they may even be using the same sensor. Anyway, the price was right for someone like me on a tight budget\n\nI found it on online for 139 and Prime shipping (but plus tax) so in my hands for under 150. There were several to choose from around that price from various sellers - this one had the lowest shutter count (under 1k!) and included everything a new one would. So I took a chance on it. It arrived today and looks super clean, could pass for new! I haven't gotten to try it out yet - waiting for the battery to charge as I write this.\n\nAnyhow, my question is, what should I check for while I still have an opportunity to return it? Aside from basic functionality and obvious things like sensor or mirror defects, what else could be wrong that might not be obvious right off, but might be a deal breaker or make me kick myself should I discover it later on?\n\nI still amazed at just how clean this thing is for a \"used\" camera. Maybe someone bought it, used it for a bit, then it sat in a closet? or maybe a demo or display model that can no longer be sold as \"new\". If it works as well as it looks I'll be quite happy and I think I got a pretty good deal. I welcome all comments and suggestions -- Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/e6buj9/bought_a_used_d3200_what_should_i_check_to_be/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bought a used d3200 - what should i check to be sure it's good? /!/ (my first attempt at posting this got rejected by spambot - not sure why, perhaps because i named the vendor?)\n\ni just picked up a used d3200 body to replace my aging d40 (which has also developed a sensor defect - a red -----> spot !!!  and accompanying vertical stripe). i'm looking forward to the upgrade. yeah, it's a 7 year old model, but there haven't been any really huge changes in nikon's 3000 range aside from the processor (resulting in higher iso, faster burst mode, and 1080p60 video). i think they may even be using the same sensor. anyway, the price was right for someone like me on a tight budget\n\ni found it on online for 139 and prime shipping (but plus tax) so in my hands for under 150. there were several to choose from around that price from various sellers - this one had the lowest shutter count (under 1k!) and included everything a new one would. so i took a chance on it. it arrived today and looks super clean, could pass for new! i haven't gotten to try it out yet - waiting for the battery to charge as i write this.\n\nanyhow, my question is, what should i check for while i still have an opportunity to return it? aside from basic functionality and obvious things like sensor or mirror defects, what else could be wrong that might not be obvious right off, but might be a deal breaker or make me kick myself should i discover it later on?\n\ni still amazed at just how clean this thing is for a \"used\" camera. maybe someone bought it, used it for a bit, then it sat in a closet? or maybe a demo or display model that can no longer be sold as \"new\". if it works as well as it looks i'll be quite happy and i think i got a pretty good deal. i welcome all comments and suggestions -- thanks!", "sortedWord": "None", "identifyer": 9812, "year": "2019"}, {"Unnamed: 0": 107012, "autor": "fritzltouw", "date": 1557915923000, "content": "First shot overexposed on D750 /!/ As the title says, I have a strange issue. I often get an overexposed first frame of a series of photos I take regardless of the mode or lens I'm shooting in. Bracketing is turned off. I don't use burst mode but it's basically the first shot after I pick up the camera in a new exposure situation. For instance, I do a lot of bird photography, I see something, aperture priority is on, I take a shot in a slightly darker area and the first shot will be blown out, the rest ok. Then seconds later I point higher up in a tree with more light and again the first shot is blown out. Once it's used to it, at least so it seems, the shots are fine. \n\nI've checked the file data and if I take for instance two or three shots with the same exposure settings in manual mode or aperture priority, the data will be exactly the same in the file except for the fact that the first frame is overexposed and the rest is spot on. Does anyone know what this problem could be? \n\nI am using some nikon custom presets but that shouldn't make a difference I guess. Also, white balance is set to manual or custom.\nThanks", "link": "https://www.reddit.com/r/Nikon/comments/bow7va/first_shot_overexposed_on_d750/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first shot overexposed on d750 /!/ as the title says, i have a strange issue. i often get an overexposed first frame of a series of photos i take regardless of the mode or lens i'm shooting in. bracketing is turned off. i don't use burst mode but it's basically the first shot after i pick up the camera in a new exposure situation. for instance, i do a lot of bird photography, i see something, aperture priority is on, i take a shot in a slightly darker area and the first shot will be blown out, the rest ok. then seconds later i point higher up in a tree with more light and again the first shot is blown out. once it's used to it, at least so it seems, the shots are fine. \n\ni've checked the file data and if i take for instance two or three shots with the same exposure settings in manual mode or aperture priority, the data will be exactly the same in the file except for the fact that the first frame is overexposed and the rest is -----> spot !!!  on. does anyone know what this problem could be? \n\ni am using some nikon custom presets but that shouldn't make a difference i guess. also, white balance is set to manual or custom.\nthanks", "sortedWord": "None", "identifyer": 9900, "year": "2019"}, {"Unnamed: 0": 107128, "autor": "Was_Silly", "date": 1553405712000, "content": "Getting spots in images. I think it’s frost as it was a very cold and windy morning. Any way to prevent this? I have no idea where this is - lens, sensor? D7200 with 18-140 f 16@20mm iso200. 400 shutter", "link": "https://www.reddit.com/r/Nikon/comments/b4sy8x/getting_spots_in_images_i_think_its_frost_as_it/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "getting -----> spots !!!  in images. i think it’s frost as it was a very cold and windy morning. any way to prevent this? i have no idea where this is - lens, sensor? d7200 with 18-140 f 16@20mm iso200. 400 shutter", "sortedWord": "None", "identifyer": 10017, "year": "2019"}, {"Unnamed: 0": 107572, "autor": "xqdsdcf", "date": 1570643702000, "content": "Nikon Z50 mirrorless spotted in the wild, and pricing info leaks out", "link": "https://www.reddit.com/r/Nikon/comments/dfkpjh/nikon_z50_mirrorless_spotted_in_the_wild_and/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "nikon z50 mirrorless -----> spotted !!!  in the wild, and pricing info leaks out", "sortedWord": "None", "identifyer": 10469, "year": "2019"}, {"Unnamed: 0": 107648, "autor": "colizard", "date": 1573924745000, "content": "I currently have a Nikon D610 and I'm looking to upgrade /!/ Hello all, I'm a fashion photographer and I've been shooting with my D610 for about 4 years now. I'm looking to upgrade since I feel the camera quality has been deteriorating and my camera has spots that show up in photos on the inside of the body that I can't remove. I've been recommended the D750 and the D800 but what would be the most natural progression or the better option to go with? I'm not well versed in gear and the tech side of photography so any help I can get is welcome.", "link": "https://www.reddit.com/r/Nikon/comments/dx9nkm/i_currently_have_a_nikon_d610_and_im_looking_to/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i currently have a nikon d610 and i'm looking to upgrade /!/ hello all, i'm a fashion photographer and i've been shooting with my d610 for about 4 years now. i'm looking to upgrade since i feel the camera quality has been deteriorating and my camera has -----> spots !!!  that show up in photos on the inside of the body that i can't remove. i've been recommended the d750 and the d800 but what would be the most natural progression or the better option to go with? i'm not well versed in gear and the tech side of photography so any help i can get is welcome.", "sortedWord": "None", "identifyer": 10547, "year": "2019"}, {"Unnamed: 0": 107678, "autor": "Jens-Ritchie-photo", "date": 1573712735000, "content": "Sunset in La Jolla Ca. NikonD90 Tamron 11-16mm2.8 f/22 6.sec 11.5mm ISO 320... picked up this Tamron lens recently, and have been enjoying it quite a bit. Weather and tides played a big factor in doing this shot. Editing was done on Lightroom3. Post edited on photoshop fix via iPad to remove spots..", "link": "https://www.reddit.com/r/Nikon/comments/dw5fiz/sunset_in_la_jolla_ca_nikond90_tamron_1116mm28/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sunset in la jolla ca. nikond90 tamron 11-16mm2.8 f/22 6.sec 11.5mm iso 320... picked up this tamron lens recently, and have been enjoying it quite a bit. weather and tides played a big factor in doing this shot. editing was done on lightroom3. post edited on photoshop fix via ipad to remove -----> spots !!! ..", "sortedWord": "None", "identifyer": 10578, "year": "2019"}, {"Unnamed: 0": 107726, "autor": "brown-ale", "date": 1573506135000, "content": "Recently got a Nikon Z6 - Noticed 2 white spots when using my 50mm, is something wrong with my sensor or lens?", "link": "https://www.reddit.com/r/Nikon/comments/duyyb1/recently_got_a_nikon_z6_noticed_2_white_spots/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "recently got a nikon z6 - noticed 2 white -----> spots !!!  when using my 50mm, is something wrong with my sensor or lens?", "sortedWord": "None", "identifyer": 10626, "year": "2019"}, {"Unnamed: 0": 108016, "autor": "coconutballoon", "date": 1562457299000, "content": "Spotted a Spotted Deer", "link": "https://www.reddit.com/r/Nikon/comments/ca0g7v/spotted_a_spotted_deer/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  a -----> spotted !!!  deer", "sortedWord": "None", "identifyer": 10920, "year": "2019"}, {"Unnamed: 0": 108045, "autor": "LMNii", "date": 1572120037000, "content": "In response to the carspotting post. Here is an Audi RS6+ tuned by ABT, spotted in Berlin | Nikon D5200, 18-105 f3.5/5.6", "link": "https://www.reddit.com/r/Nikon/comments/dnixld/in_response_to_the_carspotting_post_here_is_an/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "in response to the carspotting post. here is an audi rs6+ tuned by abt, -----> spotted !!!  in berlin | nikon d5200, 18-105 f3.5/5.6", "sortedWord": "None", "identifyer": 10949, "year": "2019"}, {"Unnamed: 0": 108144, "autor": "Emily8694", "date": 1560011423000, "content": "Coolpix L820 trouble /!/ Hello!!\nI have had my camera for over two years now... I bought it used from someone who had only used it once or twice. The camera had some corrosion, which I cleaned up, and it worked fine after that.\nI always took the batteries out after I was done using the camera, and I always kept the camera in its case. This weekend, I am at a convention, and I had been using the camera prior to today. Yesterday, I forgot to take the batteries out after I was done using it.... so I went to turn my camera on this morning, and it didn’t turn on!! After I eventually got it on, it took one picture, and then shut off, saying the battery was exhausted. The charge showed a full battery. So I bought a new set of batteries and put them in. The camera turned on, took one picture, and then turned back off. I haven’t been able to get it back on since. There is a tiny spot of corrosion on the top lid of the battery cover, which I will clean tonight, however it was there prior and I had no issues. I have tried removing the memory card, and turning it on and nothing happened. This is really frustrating because like I said, I am at a convention and I want to get really good pictures.\nPlease help!!\nThank you.", "link": "https://www.reddit.com/r/Nikon/comments/by9q1h/coolpix_l820_trouble/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "coolpix l820 trouble /!/ hello!!\ni have had my camera for over two years now... i bought it used from someone who had only used it once or twice. the camera had some corrosion, which i cleaned up, and it worked fine after that.\ni always took the batteries out after i was done using the camera, and i always kept the camera in its case. this weekend, i am at a convention, and i had been using the camera prior to today. yesterday, i forgot to take the batteries out after i was done using it.... so i went to turn my camera on this morning, and it didn’t turn on!! after i eventually got it on, it took one picture, and then shut off, saying the battery was exhausted. the charge showed a full battery. so i bought a new set of batteries and put them in. the camera turned on, took one picture, and then turned back off. i haven’t been able to get it back on since. there is a tiny -----> spot !!!  of corrosion on the top lid of the battery cover, which i will clean tonight, however it was there prior and i had no issues. i have tried removing the memory card, and turning it on and nothing happened. this is really frustrating because like i said, i am at a convention and i want to get really good pictures.\nplease help!!\nthank you.", "sortedWord": "None", "identifyer": 11049, "year": "2019"}, {"Unnamed: 0": 108168, "autor": "itum26", "date": 1559771731000, "content": "Anyone can tell what are these spots? I see them only when I look through the lens, they don’t show on images or from view finder, this is a brand new d750", "link": "https://www.reddit.com/r/Nikon/comments/bx8hpi/anyone_can_tell_what_are_these_spots_i_see_them/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone can tell what are these -----> spots !!! ? i see them only when i look through the lens, they don’t show on images or from view finder, this is a brand new d750", "sortedWord": "None", "identifyer": 11073, "year": "2019"}, {"Unnamed: 0": 108662, "autor": "DmitryNik777", "date": 1551804674000, "content": "Last Sunday, I shot a car in the Parking lot. Here's what happened when i connected 20 photos togever. On the photo is not edit, just original photo. On photo see spots from speedlight and on the left in the photo you can see me partially). Shooted on Nikon D5100, lens 18-105mm.", "link": "https://www.reddit.com/r/Nikon/comments/axna8h/last_sunday_i_shot_a_car_in_the_parking_lot_heres/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "last sunday, i shot a car in the parking lot. here's what happened when i connected 20 photos togever. on the photo is not edit, just original photo. on photo see -----> spots !!!  from speedlight and on the left in the photo you can see me partially). shooted on nikon d5100, lens 18-105mm.", "sortedWord": "None", "identifyer": 11570, "year": "2019"}, {"Unnamed: 0": 108861, "autor": "thefourblackbars", "date": 1574754490000, "content": "Nikon D800 and dust specks /!/ Hey all, \n\nI bought a second hand D800 and I had a look through the viewfinder when I bought it and it was clean and took it home and now it has dust specks. I think the dust specks are in the view finder (??) because when I zoom in on a shot, there aren't any black spots. What do you think? How can I get rid of these? They are a bit distracting when taking shots.", "link": "https://www.reddit.com/r/Nikon/comments/e1ur8r/nikon_d800_and_dust_specks/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "nikon d800 and dust specks /!/ hey all, \n\ni bought a second hand d800 and i had a look through the viewfinder when i bought it and it was clean and took it home and now it has dust specks. i think the dust specks are in the view finder (??) because when i zoom in on a shot, there aren't any black -----> spots !!! . what do you think? how can i get rid of these? they are a bit distracting when taking shots.", "sortedWord": "None", "identifyer": 11775, "year": "2019"}, {"Unnamed: 0": 108908, "autor": "M_swindoneer", "date": 1563745173000, "content": "Oil spots and sensor cleaning on grey market D610 /!/ Hello all,\n\nI've had my D610 for about a year and a quarter, a nice step up from my former D7000 in terms of my 35/2D and 50/1.8G actually being the focal lengths they are. Unfortunately, it's developed spots along the left side of every image that I've come to assume are oil, visible on solid light coloured backgrounds, which have not changed in the last couple hundred shots.\n\nThey don't shift around with a rocket blower or the clean function. Both lenses produce the same result. They can seem rather big but only because I edit zoomed in on a 28\" 4K monitor. They are generally translucent instead of opaque, but can appear almost black when zoomed out.\n\nHas anyone had experience with cleaning oil off the D610? Unfortunately, I got it as a gift and the purchaser wasn't aware of the whole grey market thing so it's a (J) marked model, meaning warranty and maybe even paid repair are meaningless to me in Canada. No large shops here seem to do sensor cleaning, and the ones that do are extremely poorly reviewed \"camera repair\" shops. The Nikon website doesn't even work for me when I try to schedule a repair due to a security issue with the website that interrupts the process when it gets to the payment stage.  \n\nI'm assuming that I have to get a kit with the cleaning liquid and a bunch of swabs, to do it myself. Some FX-size recommendations would be nice, as none of them stand out in terms of reviews. I live in the Vancouver area. \n\nGenerally, my D610 has been great for me, and helped me improve what I mostly do (product placement-type) and try new things as well, such as portraits and outdoor walkabout photos. But I really do hope I don't have a repeat of the nasty D600 oil epidemic on my hands here.\n\nThanks in advance.", "link": "https://www.reddit.com/r/Nikon/comments/cg4guh/oil_spots_and_sensor_cleaning_on_grey_market_d610/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "oil -----> spots !!!  and sensor cleaning on grey market d610 /!/ hello all,\n\ni've had my d610 for about a year and a quarter, a nice step up from my former d7000 in terms of my 35/2d and 50/1.8g actually being the focal lengths they are. unfortunately, it's developed spots along the left side of every image that i've come to assume are oil, visible on solid light coloured backgrounds, which have not changed in the last couple hundred shots.\n\nthey don't shift around with a rocket blower or the clean function. both lenses produce the same result. they can seem rather big but only because i edit zoomed in on a 28\" 4k monitor. they are generally translucent instead of opaque, but can appear almost black when zoomed out.\n\nhas anyone had experience with cleaning oil off the d610? unfortunately, i got it as a gift and the purchaser wasn't aware of the whole grey market thing so it's a (j) marked model, meaning warranty and maybe even paid repair are meaningless to me in canada. no large shops here seem to do sensor cleaning, and the ones that do are extremely poorly reviewed \"camera repair\" shops. the nikon website doesn't even work for me when i try to schedule a repair due to a security issue with the website that interrupts the process when it gets to the payment stage.  \n\ni'm assuming that i have to get a kit with the cleaning liquid and a bunch of swabs, to do it myself. some fx-size recommendations would be nice, as none of them stand out in terms of reviews. i live in the vancouver area. \n\ngenerally, my d610 has been great for me, and helped me improve what i mostly do (product placement-type) and try new things as well, such as portraits and outdoor walkabout photos. but i really do hope i don't have a repeat of the nasty d600 oil epidemic on my hands here.\n\nthanks in advance.", "sortedWord": "None", "identifyer": 11823, "year": "2019"}, {"Unnamed: 0": 108939, "autor": "Fire_And_Blood_7", "date": 1563630693000, "content": "Help! Having issues with my camera! /!/ Hi all!\n\nI shoot with a D7500 with an 18-300mm lens.\n\nI’m panicking a little, I have to take engagement photos (or a surprise proposal photos) in about 2 hours. I’ve done my prepping, but in between I let my mom borrow my camera and now when I go to shoot, the camera is only focusing in one spot (directly middle) rather than many like the D7500 is supposed to do. She says she didnt change any settings, so I can’t figure out how to get the settings back. The manual is not with me.\n\nIn addition, my glass keeps fogging up (in Chicago and hottest day of the year). How can I make that stay away?\n\nLastly, I was gonna rent a lens for portrait pics but I’m shooting across from a pond which my lens seems to be sufficient. If I were to get up in close range (say15-25ft) what type of lens would I rent?\n\nI’m an amateur if you can’t tell lol.\n\nAny help or advice would be much appreciated!", "link": "https://www.reddit.com/r/Nikon/comments/cfm0wx/help_having_issues_with_my_camera/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help! having issues with my camera! /!/ hi all!\n\ni shoot with a d7500 with an 18-300mm lens.\n\ni’m panicking a little, i have to take engagement photos (or a surprise proposal photos) in about 2 hours. i’ve done my prepping, but in between i let my mom borrow my camera and now when i go to shoot, the camera is only focusing in one -----> spot !!!  (directly middle) rather than many like the d7500 is supposed to do. she says she didnt change any settings, so i can’t figure out how to get the settings back. the manual is not with me.\n\nin addition, my glass keeps fogging up (in chicago and hottest day of the year). how can i make that stay away?\n\nlastly, i was gonna rent a lens for portrait pics but i’m shooting across from a pond which my lens seems to be sufficient. if i were to get up in close range (say15-25ft) what type of lens would i rent?\n\ni’m an amateur if you can’t tell lol.\n\nany help or advice would be much appreciated!", "sortedWord": "None", "identifyer": 11854, "year": "2019"}, {"Unnamed: 0": 109230, "autor": "the_uberkaz", "date": 1569981673000, "content": "Northern Lights in Voyageurs national park - D5, 14-24@14, 2.5, 8 sec, ISO 10,000. We were in Voyageurs and the KP index was predicted to be high, so I staked out a spot and waited. I have way too many photos from the light show, but this wide one may be my favorite.", "link": "https://www.reddit.com/r/Nikon/comments/dc3qgd/northern_lights_in_voyageurs_national_park_d5/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "northern lights in voyageurs national park - d5, 14-24@14, 2.5, 8 sec, iso 10,000. we were in voyageurs and the kp index was predicted to be high, so i staked out a -----> spot !!!  and waited. i have way too many photos from the light show, but this wide one may be my favorite.", "sortedWord": "None", "identifyer": 12155, "year": "2019"}, {"Unnamed: 0": 109245, "autor": "acherion", "date": 1569928971000, "content": "/r/Nikon monthly photo assignment [October 2019] /!/ **Welcome to this month's** r/Nikon **monthly photo assignment!**\n\nAnother month, another photo assignment! Here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below.\n\nCongratulations to the following redditors, who had the highest scoring submissions in the month of [August](https://www.reddit.com/r/Nikon/comments/ckmuwq/rnikon_monthly_photo_assignment_august_2019/), which had the topic of **Height**:\n\n1. [/u/nf_photos's submission](https://imgur.com/a/YwDIH5O) titled ‘Bubble by the river’, with 141 upvotes – great shot, well deserving of the top spot for last month!\n2. [/u/Pandamonium09's submission](https://i.imgur.com/1bosIcb.jpg) of their husband's grandmother, with 6 upvotes\n3. [/u/lenswork4's submission](https://flic.kr/p/2hgsVA5), titled 'Great to Swell', also with 6 upvotes\n\nWell done and thank you to everyone who participated! \n\nAt this stage I can’t say there’s any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work!\n\n# This month’s topic is: Nature\n\nThe subject for this month is Nature. It goes without saying that at this time of the year, as it gets cooler (at least in the northern hemisphere!), nature that exists around us changes along with it. Try to capture in a photo what 'nature' means to you.\n\nThe photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\nIt would be great if we can all stick to the following points:\n\n* Please submit only one photo per assignment – obviously your best one!\n* **Your assignment submission must be taken during the current month.**\n* Upload to your Flickr account with EXIF data, or you can upload to Imgur and add the list of gear you used in your comment underneath the link\n* It goes with saying – photo must be taken with some sort of Nikon photography equipment. Whether that’s a Nikon 1, DSLR (with a Nikon lens or otherwise), Z-body mirrorless, bridge camera or Coolpix camera, or a Nikon lens on another manufacturer’s body, is all acceptable.\n* Images submitted to the assignment must be Safe For Work (SFW)\n* Feel free to comment on other people’s submissions. Of course, any comments placed need to follow the subreddit rules (see sidebar)\n\nWe’ve all been beginners at one stage in our lives, so don’t be intimidated with more seasoned photogs, all submissions are most welcome!\n\nSo what are you waiting for? Get out there and take some photos!", "link": "https://www.reddit.com/r/Nikon/comments/dbrxln/rnikon_monthly_photo_assignment_october_2019/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "/r/nikon monthly photo assignment [october 2019] /!/ **welcome to this month's** r/nikon **monthly photo assignment!**\n\nanother month, another photo assignment! here is a chance to show what photos you can take with your gear – simply take a photo with the current month's assignment topic in mind, and post a link to it in the comments below.\n\ncongratulations to the following redditors, who had the highest scoring submissions in the month of [august](https://www.reddit.com/r/nikon/comments/ckmuwq/rnikon_monthly_photo_assignment_august_2019/), which had the topic of **height**:\n\n1. [/u/nf_photos's submission](https://imgur.com/a/ywdih5o) titled ‘bubble by the river’, with 141 upvotes – great shot, well deserving of the top -----> spot !!!  for last month!\n2. [/u/pandamonium09's submission](https://i.imgur.com/1bosicb.jpg) of their husband's grandmother, with 6 upvotes\n3. [/u/lenswork4's submission](https://flic.kr/p/2hgsva5), titled 'great to swell', also with 6 upvotes\n\nwell done and thank you to everyone who participated! \n\nat this stage i can’t say there’s any prizes, other than that sweet, sweet comment karma, but for the redditors mentioned above, great work!\n\n# this month’s topic is: nature\n\nthe subject for this month is nature. it goes without saying that at this time of the year, as it gets cooler (at least in the northern hemisphere!), nature that exists around us changes along with it. try to capture in a photo what 'nature' means to you.\n\nthe photo you share with us **must be taken during the current month**; after all, the point of this assignment is to get you, the photographer, out there and taking photos!\n\nit would be great if we can all stick to the following points:\n\n* please submit only one photo per assignment – obviously your best one!\n* **your assignment submission must be taken during the current month.**\n* upload to your flickr account with exif data, or you can upload to imgur and add the list of gear you used in your comment underneath the link\n* it goes with saying – photo must be taken with some sort of nikon photography equipment. whether that’s a nikon 1, dslr (with a nikon lens or otherwise), z-body mirrorless, bridge camera or coolpix camera, or a nikon lens on another manufacturer’s body, is all acceptable.\n* images submitted to the assignment must be safe for work (sfw)\n* feel free to comment on other people’s submissions. of course, any comments placed need to follow the subreddit rules (see sidebar)\n\nwe’ve all been beginners at one stage in our lives, so don’t be intimidated with more seasoned photogs, all submissions are most welcome!\n\nso what are you waiting for? get out there and take some photos!", "sortedWord": "None", "identifyer": 12170, "year": "2019"}, {"Unnamed: 0": 109399, "autor": "Mynameisadam44", "date": 1573239169000, "content": "Spotted Hyena. Nikon Z6 | sigma 150-600mm C.", "link": "https://www.reddit.com/r/Nikon/comments/dtjva1/spotted_hyena_nikon_z6_sigma_150600mm_c/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  hyena. nikon z6 | sigma 150-600mm c.", "sortedWord": "None", "identifyer": 12325, "year": "2019"}, {"Unnamed: 0": 109793, "autor": "Vaughan7", "date": 1559215282000, "content": "I found an ornate box turtle roaming my garden looking for a nesting spot", "link": "https://www.reddit.com/r/Nikon/comments/burxvs/i_found_an_ornate_box_turtle_roaming_my_garden/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found an ornate box turtle roaming my garden looking for a nesting -----> spot !!! ", "sortedWord": "None", "identifyer": 12724, "year": "2019"}, {"Unnamed: 0": 109796, "autor": "gloomwind", "date": 1559183316000, "content": "Viewfinder Dust - Cleaning insanity /!/ Hi all! Just got back from a trip and picked up a lot of dust in my viewfinder. Specifically the top glass piece and mirror. So I took it apart by removing the clip in the top part of the glass assemltin the prism. Cleaned with lens cleaner, sensor swabs and lint free lens cloths. I wore surgical gloves, and made sure our houses fans were off so as to not circulate air.\n\nAll of that being said, I've now disassembled, cleaned, reassembled, at least 15 times now. Each time I finish, there's a new spot of dust, or that damned felt lining inside the camera box has left something behind on either glass pieces. I'm going absolutely nuts and feel defeated.\n\nHas anyone got any recommendations? Should I bring it to Nikon Services in Toronto?", "link": "https://www.reddit.com/r/Nikon/comments/bunrtf/viewfinder_dust_cleaning_insanity/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "viewfinder dust - cleaning insanity /!/ hi all! just got back from a trip and picked up a lot of dust in my viewfinder. specifically the top glass piece and mirror. so i took it apart by removing the clip in the top part of the glass assemltin the prism. cleaned with lens cleaner, sensor swabs and lint free lens cloths. i wore surgical gloves, and made sure our houses fans were off so as to not circulate air.\n\nall of that being said, i've now disassembled, cleaned, reassembled, at least 15 times now. each time i finish, there's a new -----> spot !!!  of dust, or that damned felt lining inside the camera box has left something behind on either glass pieces. i'm going absolutely nuts and feel defeated.\n\nhas anyone got any recommendations? should i bring it to nikon services in toronto?", "sortedWord": "None", "identifyer": 12727, "year": "2019"}, {"Unnamed: 0": 109921, "autor": "Exitare", "date": 1546717358000, "content": "Does anyone know why there is this spot on my pictures? (Example Pic) Not edited /!/ [removed]", "link": "https://www.reddit.com/r/Nikon/comments/acxflm/does_anyone_know_why_there_is_this_spot_on_my/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone know why there is this -----> spot !!!  on my pictures? (example pic) not edited /!/ [removed]", "sortedWord": "None", "identifyer": 12855, "year": "2019"}, {"Unnamed: 0": 109945, "autor": "BrokenAim_", "date": 1565455834000, "content": "✌️ /!/ Hello guys, bought a new camera today and tried to take a photos of sun( only for about 5-10 sec). My camera didn't catch the focus ( obviously, my dumb ass) and now I spotted a round (very faded white)  circle about my middle viewfinder point( not sure if it was there before).  Is there any possibility that it was caused by sun ?  I can't really see any damage on a camera sensor", "link": "https://www.reddit.com/r/Nikon/comments/cokg6r/_/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "✌️ /!/ hello guys, bought a new camera today and tried to take a photos of sun( only for about 5-10 sec). my camera didn't catch the focus ( obviously, my dumb ass) and now i -----> spotted !!!  a round (very faded white)  circle about my middle viewfinder point( not sure if it was there before).  is there any possibility that it was caused by sun ?  i can't really see any damage on a camera sensor", "sortedWord": "None", "identifyer": 12879, "year": "2019"}], "name": "spotnikon2019"}