{"interestingcomments": [{"Unnamed: 0": 154463, "autor": "himlaklar", "date": 1614707798000, "content": "Why did I have such a bad experience with the Z50? /!/ I own a Nikon D5200 with the 18-55 kit lens, which isn't much of a camera compared to some others these days. I figured I wanted an upgrade and ordered the Z50 with both kit lenses. \n\nI fiddled many hours with AF-settings, AF-mode and other stuff. Always saving as raw of course.   \nNo matter how I tried I felt that the AF had a hard time, like I was fighting with it.   \n\"Please focus on this tiny spot here!\" \"Oh, you mean that 1/3 fraction of the spot instead of the big thing in the middle of it, there you go!\". I could focus from being near, like on a bench in front on me, and then out on a field, and it just didn't change focus until some second later when it was like \"oh, right uuh, here's the focus!\" My D5200 is just like snap snap with those things. It even tracks birds with it's kit-lens with no problem. When the Z50 found the focus out on a twig in the lake where I sat the point, I was like yeah, now we got it! Going back to Lightroom and it's still out of focus. Doing that Zoom-focus thing gave me so little choice since it tries to focus on the whole zoomed part.   \n\n\n Then I took a picture on 2s countdown from both the D5200 48mm, ISO 400, and 1/2s, at Z50, at 50mm, 400 ISO. 1/4s. The result was so much darn noise from the Z50.  \n[https://imgur.com/a/G3cWkbL](https://imgur.com/a/G3cWkbL)   \n I don't know what I did wrong, was it a faulty Z50 without me realizing?   \nAm I just not used to mirrorless?   \nI want to ugrade to another camera but now I'm afraid to even touch something else than my old D5200.", "link": "https://www.reddit.com/r/Nikon/comments/lw87i9/why_did_i_have_such_a_bad_experience_with_the_z50/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why did i have such a bad experience with the z50? /!/ i own a nikon d5200 with the 18-55 kit lens, which isn't much of a camera compared to some others these days. i figured i wanted an upgrade and ordered the z50 with both kit lenses. \n\ni fiddled many hours with af-settings, af-mode and other stuff. always saving as raw of course.   \nno matter how i tried i felt that the af had a hard time, like i was fighting with it.   \n\"please focus on this tiny -----> spot !!!  here!\" \"oh, you mean that 1/3 fraction of the spot instead of the big thing in the middle of it, there you go!\". i could focus from being near, like on a bench in front on me, and then out on a field, and it just didn't change focus until some second later when it was like \"oh, right uuh, here's the focus!\" my d5200 is just like snap snap with those things. it even tracks birds with it's kit-lens with no problem. when the z50 found the focus out on a twig in the lake where i sat the point, i was like yeah, now we got it! going back to lightroom and it's still out of focus. doing that zoom-focus thing gave me so little choice since it tries to focus on the whole zoomed part.   \n\n\n then i took a picture on 2s countdown from both the d5200 48mm, iso 400, and 1/2s, at z50, at 50mm, 400 iso. 1/4s. the result was so much darn noise from the z50.  \n[https://imgur.com/a/g3cwkbl](https://imgur.com/a/g3cwkbl)   \n i don't know what i did wrong, was it a faulty z50 without me realizing?   \nam i just not used to mirrorless?   \ni want to ugrade to another camera but now i'm afraid to even touch something else than my old d5200.", "sortedWord": "None", "identifyer": 45913, "year": "2021"}, {"Unnamed: 0": 154567, "autor": "_Lukisha_", "date": 1617320911000, "content": "Taking timelapses but without a tripod /!/ Now I’ve got a weird one, basically what I’m trying to do is make a timelapse of a few months, probably whole summer and spring, but the trick is, I’m gonna have to somehow take the timelapse by hand and from a slightly different spot (Going to take once every week), so I’m thinking how I should do it, I’ve marked the spot from which I’m taking it but still no idea on how to do it, I’m taking them all on the same focal lenght and got a basic plan of what I want in the frame but I’m worried that It’ll be all weird and different, so basically my main question is, is there any way to get around this specifically in post proccesing, I have a basic knowledge of photoshop for photography but not the best in it, would it be possible to crop the 10 or so pictures that I’ll have to make it look like it was taken from the same place or should I just do something else? And forgot to mention the timelapse is actually of a small plot of land on which I’ve planted some stuff and want to make a timelapse of how it’s progressing.", "link": "https://www.reddit.com/r/Nikon/comments/mi87hr/taking_timelapses_but_without_a_tripod/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "taking timelapses but without a tripod /!/ now i’ve got a weird one, basically what i’m trying to do is make a timelapse of a few months, probably whole summer and spring, but the trick is, i’m gonna have to somehow take the timelapse by hand and from a slightly different -----> spot !!!  (going to take once every week), so i’m thinking how i should do it, i’ve marked the -----> spot !!!  from which i’m taking it but still no idea on how to do it, i’m taking them all on the same focal lenght and got a basic plan of what i want in the frame but i’m worried that it’ll be all weird and different, so basically my main question is, is there any way to get around this specifically in post proccesing, i have a basic knowledge of photoshop for photography but not the best in it, would it be possible to crop the 10 or so pictures that i’ll have to make it look like it was taken from the same place or should i just do something else? and forgot to mention the timelapse is actually of a small plot of land on which i’ve planted some stuff and want to make a timelapse of how it’s progressing.", "sortedWord": "None", "identifyer": 46021, "year": "2021"}, {"Unnamed: 0": 154743, "autor": "USReaper", "date": 1611897003000, "content": "Spotted. Nikon D5600. Nikon 200-500 f/5.6.", "link": "https://www.reddit.com/r/Nikon/comments/l7k0zd/spotted_nikon_d5600_nikon_200500_f56/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! . nikon d5600. nikon 200-500 f/5.6.", "sortedWord": "None", "identifyer": 46203, "year": "2021"}, {"Unnamed: 0": 154856, "autor": "SunComprehensive6960", "date": 1625193738000, "content": "My favorite pic from my Colorado trip! I was so excited when i spotted this guy! He just kept getting closer &amp; closer. This was great luck because I had my wide lens on at the time! With this cool of a pic I had to try some funky Lightroom editing. Nikon Z50 FTZ Sigma 18-35. 35mm f1.8 1/640 iso100.", "link": "https://www.reddit.com/r/Nikon/comments/oc13vq/my_favorite_pic_from_my_colorado_trip_i_was_so/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "my favorite pic from my colorado trip! i was so excited when i -----> spotted !!!  this guy! he just kept getting closer &amp; closer. this was great luck because i had my wide lens on at the time! with this cool of a pic i had to try some funky lightroom editing. nikon z50 ftz sigma 18-35. 35mm f1.8 1/640 iso100.", "sortedWord": "None", "identifyer": 46319, "year": "2021"}, {"Unnamed: 0": 154899, "autor": "DaytonaDemon", "date": 1625086121000, "content": "Yesterday, my Nikon Z6II with Eye AF kept focusing on a subject's nostrils, mistaking them for eyes! /!/ I guess Nikon's artificial intelligence engineers still have a ways to go. I was doing a woman's headshot yesterday and had Human Eye AF detect switched on. It's usually spot on with other human subjects, but in this case I could for the life of me not get the camera to stop focusing on the lady's nostrils. \n\nWhen you think about it, I suppose nostrils are sort of dark and eye-shaped, like, well...eyes.\n\nKind of a black \\_\\_\\_\\_\\_ for Nikon if you ask me. :-)", "link": "https://www.reddit.com/r/Nikon/comments/ob68dy/yesterday_my_nikon_z6ii_with_eye_af_kept_focusing/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yesterday, my nikon z6ii with eye af kept focusing on a subject's nostrils, mistaking them for eyes! /!/ i guess nikon's artificial intelligence engineers still have a ways to go. i was doing a woman's headshot yesterday and had human eye af detect switched on. it's usually -----> spot !!!  on with other human subjects, but in this case i could for the life of me not get the camera to stop focusing on the lady's nostrils. \n\nwhen you think about it, i suppose nostrils are sort of dark and eye-shaped, like, well...eyes.\n\nkind of a black \\_\\_\\_\\_\\_ for nikon if you ask me. :-)", "sortedWord": "None", "identifyer": 46362, "year": "2021"}, {"Unnamed: 0": 155314, "autor": "nothingspecialva", "date": 1635559234000, "content": "I guess we won't get David Yarrow to showcase the Z9 (being other wildlife shooters in the launch event)... his small documentaries about how he works for his famous shots are always great /!/ I remember seeing videos of him showcasing the D850 and the D6. I hope Nikon also gives him a spot to showcase the Z9... among the strengths of his videos, he always gives credit to the people that scout the terrain and bring him to the locations. \n\nAs I remember in one of his videos he argues that 90% of the work for a wildlife photo is research and preparation; pressing the shutter is a very small part. It might sound obvious, but that has always resonated with me.", "link": "https://www.reddit.com/r/Nikon/comments/qirm57/i_guess_we_wont_get_david_yarrow_to_showcase_the/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i guess we won't get david yarrow to showcase the z9 (being other wildlife shooters in the launch event)... his small documentaries about how he works for his famous shots are always great /!/ i remember seeing videos of him showcasing the d850 and the d6. i hope nikon also gives him a -----> spot !!!  to showcase the z9... among the strengths of his videos, he always gives credit to the people that scout the terrain and bring him to the locations. \n\nas i remember in one of his videos he argues that 90% of the work for a wildlife photo is research and preparation; pressing the shutter is a very small part. it might sound obvious, but that has always resonated with me.", "sortedWord": "None", "identifyer": 46792, "year": "2021"}, {"Unnamed: 0": 155762, "autor": "DarkLordMalak", "date": 1617029178000, "content": "Any experience with sensor burn in Z series cameras? /!/ Since mirrorless cameras always have the sensor exposed, isn't it possible to damage the sensor just from composing a photo with the sun in frame for too long?  Just for reference--I was taking photos yesterday of a blooming dogwood and the soon was decently high in the sky, peeking through the branches at me.  35mm, f1.8,  generally focused a few feet in front of me.  But the sun was in frame and it was  very, very bright. \n\nI hadn't known about sensor burn until later that night.  Made me paranoid.  I've taken some photos since.  I don't THINK I see any damage or dark spots or anything.  But wanted to know some experiences (or lack thereof) in order to help my paranoia.  \n\nI know around the eclipse time in 2017, fstoppers made a video about burning the sensor.  But they had a ridiculous 400m lense pointed directly at the sun.  I assume focused to infinite.  Obviously it absolutely destroyed the camera very quickly.", "link": "https://www.reddit.com/r/Nikon/comments/mfr4c9/any_experience_with_sensor_burn_in_z_series/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "any experience with sensor burn in z series cameras? /!/ since mirrorless cameras always have the sensor exposed, isn't it possible to damage the sensor just from composing a photo with the sun in frame for too long?  just for reference--i was taking photos yesterday of a blooming dogwood and the soon was decently high in the sky, peeking through the branches at me.  35mm, f1.8,  generally focused a few feet in front of me.  but the sun was in frame and it was  very, very bright. \n\ni hadn't known about sensor burn until later that night.  made me paranoid.  i've taken some photos since.  i don't think i see any damage or dark -----> spots !!!  or anything.  but wanted to know some experiences (or lack thereof) in order to help my paranoia.  \n\ni know around the eclipse time in 2017, fstoppers made a video about burning the sensor.  but they had a ridiculous 400m lense pointed directly at the sun.  i assume focused to infinite.  obviously it absolutely destroyed the camera very quickly.", "sortedWord": "None", "identifyer": 47259, "year": "2021"}, {"Unnamed: 0": 156059, "autor": "poigle", "date": 1627525326000, "content": "Pink spots in images? Nikon D850 help please /!/ I have a 2nd hand Nikon D850 that I love and am learning more about each day. I am a horticulture photographer so my subjects are 90% plants, in the studio, for catalogue and ecommerce work.  I have been dealing with random (seemingly) pink spots in my RAW images. I've tried different lenses, and that does not help. I've done the sensor cleaning process, no difference. \n\nIt is not every single photo, at least not that I can tell - I do try to scope them out. It's usually anywhere from one to four of these small pink spots/blotches in the image. I've tried searching but nothing is coming up similar to what I'm seeing. \n\nSample photo attached, taken with a 35mm lens.\n\nAny brilliant photogs out there with some ideas? Do I need to send it to a camera doctor? Very appreciated!!", "link": "https://www.reddit.com/r/Nikon/comments/otojjs/pink_spots_in_images_nikon_d850_help_please/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "pink -----> spots !!!  in images? nikon d850 help please /!/ i have a 2nd hand nikon d850 that i love and am learning more about each day. i am a horticulture photographer so my subjects are 90% plants, in the studio, for catalogue and ecommerce work.  i have been dealing with random (seemingly) pink spots in my raw images. i've tried different lenses, and that does not help. i've done the sensor cleaning process, no difference. \n\nit is not every single photo, at least not that i can tell - i do try to scope them out. it's usually anywhere from one to four of these small pink spots/blotches in the image. i've tried searching but nothing is coming up similar to what i'm seeing. \n\nsample photo attached, taken with a 35mm lens.\n\nany brilliant photogs out there with some ideas? do i need to send it to a camera doctor? very appreciated!!", "sortedWord": "None", "identifyer": 47565, "year": "2021"}, {"Unnamed: 0": 156679, "autor": "Daastle", "date": 1628799578000, "content": "Spotted in the forest.... Nikon D5300 + 70-300mm", "link": "https://www.reddit.com/r/Nikon/comments/p37yl2/spotted_in_the_forest_nikon_d5300_70300mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  in the forest.... nikon d5300 + 70-300mm", "sortedWord": "None", "identifyer": 48202, "year": "2021"}, {"Unnamed: 0": 156989, "autor": "Mystery_Asian", "date": 1634269372000, "content": "Hot pixel on new camera /!/  I just got a Nikon Z6 and the first I did with it is night photography (because I needed the camera in the upcoming days, and the only time I had to try the camera was during an evening). (I'm fairly new to photography. I mainly do videography.)\n\nI was using the body with the FTZ adapter and the Nikkor 24-85mm f/3.5-4.5G ED VR lens.\n\nBack on the computer, I noticed a lot of my pictures had a white dot at the same spot. Some of them had more than one dot. I thought it might be hot pixels since it was shot at a long exposure and high ISO. So, I tested it again in low light and the white dots did show up.\n\nMy question is:\n\n# Is it normal for a brand new camera to have multiple hot pixels?\n\nAnd, should I file a warranty claim about it?\n\nMaybe I am wrong and it's not hot pixels. Anyway, it is a small white dot about the size of a pixel. When, in low light (slow shutter, high ISO), I can notice a heck of a lot of dots on the screen, but there are at most 5 to 8 white dots in the pictures. Under normal lighting, there are no dots.\n\nI don't know what I should do. So, I'm asking you guys, who no doubt have more knowledge than me, for help and opinion about it.", "link": "https://www.reddit.com/r/Nikon/comments/q8fw3y/hot_pixel_on_new_camera/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hot pixel on new camera /!/  i just got a nikon z6 and the first i did with it is night photography (because i needed the camera in the upcoming days, and the only time i had to try the camera was during an evening). (i'm fairly new to photography. i mainly do videography.)\n\ni was using the body with the ftz adapter and the nikkor 24-85mm f/3.5-4.5g ed vr lens.\n\nback on the computer, i noticed a lot of my pictures had a white dot at the same -----> spot !!! . some of them had more than one dot. i thought it might be hot pixels since it was shot at a long exposure and high iso. so, i tested it again in low light and the white dots did show up.\n\nmy question is:\n\n# is it normal for a brand new camera to have multiple hot pixels?\n\nand, should i file a warranty claim about it?\n\nmaybe i am wrong and it's not hot pixels. anyway, it is a small white dot about the size of a pixel. when, in low light (slow shutter, high iso), i can notice a heck of a lot of dots on the screen, but there are at most 5 to 8 white dots in the pictures. under normal lighting, there are no dots.\n\ni don't know what i should do. so, i'm asking you guys, who no doubt have more knowledge than me, for help and opinion about it.", "sortedWord": "None", "identifyer": 48522, "year": "2021"}, {"Unnamed: 0": 157032, "autor": "these_mods_suck", "date": 1634151437000, "content": "Great spotted woodpecker using the Nikon D500 + 200-500mm F5.6", "link": "https://www.reddit.com/r/Nikon/comments/q7i0gd/great_spotted_woodpecker_using_the_nikon_d500/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "great -----> spotted !!!  woodpecker using the nikon d500 + 200-500mm f5.6", "sortedWord": "None", "identifyer": 48566, "year": "2021"}, {"Unnamed: 0": 157047, "autor": "GoneCanuck", "date": 1634103565000, "content": "Nikon D850 with Sigma 60-600 sport Spotted Towhee pictures very busy but he was in the bush deep 😎👍", "link": "https://www.reddit.com/r/Nikon/comments/q74k80/nikon_d850_with_sigma_60600_sport_spotted_towhee/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "nikon d850 with sigma 60-600 sport -----> spotted !!!  towhee pictures very busy but he was in the bush deep 😎👍", "sortedWord": "None", "identifyer": 48582, "year": "2021"}, {"Unnamed: 0": 157286, "autor": "vartoooza", "date": 1622354996000, "content": "As I leaned down to take a picture of a flower, I spotted...D3300 + Sigma 18-300 (300mm F8 1/400 ISO3200)", "link": "https://www.reddit.com/r/Nikon/comments/no4ulr/as_i_leaned_down_to_take_a_picture_of_a_flower_i/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "as i leaned down to take a picture of a flower, i -----> spotted !!! ...d3300 + sigma 18-300 (300mm f8 1/400 iso3200)", "sortedWord": "None", "identifyer": 48832, "year": "2021"}, {"Unnamed: 0": 157288, "autor": "vartoooza", "date": 1622351890000, "content": "As I leaned down to take a picture of a flower, I spotted...D3300 + Sigma 18-300 (300mm 1/400 F8 ISO3200)", "link": "https://www.reddit.com/r/Nikon/comments/no44u9/as_i_leaned_down_to_take_a_picture_of_a_flower_i/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "as i leaned down to take a picture of a flower, i -----> spotted !!! ...d3300 + sigma 18-300 (300mm 1/400 f8 iso3200)", "sortedWord": "None", "identifyer": 48835, "year": "2021"}, {"Unnamed: 0": 157616, "autor": "Cobra_Fast", "date": 1613957868000, "content": "How to adjust focus in a DX 35/1.8G? Not AF fine tune! /!/ Just took apart my 2nd hand AF-S DX 35mm 1:1.8G lens for cleaning, greasing, and checking if there was an obvious way to correct the -15 AF fine tune it needs on my D7000.\n\nAfter taking the lens partially apart (so far has having the cover removed) and putting it back together after a few blows of air and a tiny drop of oil into the plastic gears (which had grinding dust on them), the lens still works perfectly fine mechanically and electronically, but now needs more than -20 AF fine tune.\n\nI suspect the spacer rings right underneath the bajonet element are there to adjust the lens, since people in two repair YouTube videos and me all have different amounts of spacers (I have a thick and a thin one). However the focusing behaviour doesn't change at all with the combination of spacers I put into the lens, even if I put none in.\n\nI also have the DX 18-55/3.5-5.6G lens which is spot on at -5 AF fine tune, so I doubt it's the D7000 that's off. Is there some way to tell if the camera is off?\n\nWhat's the correct way to adjust the focus of the lens itself?", "link": "https://www.reddit.com/r/Nikon/comments/lpbzow/how_to_adjust_focus_in_a_dx_3518g_not_af_fine_tune/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to adjust focus in a dx 35/1.8g? not af fine tune! /!/ just took apart my 2nd hand af-s dx 35mm 1:1.8g lens for cleaning, greasing, and checking if there was an obvious way to correct the -15 af fine tune it needs on my d7000.\n\nafter taking the lens partially apart (so far has having the cover removed) and putting it back together after a few blows of air and a tiny drop of oil into the plastic gears (which had grinding dust on them), the lens still works perfectly fine mechanically and electronically, but now needs more than -20 af fine tune.\n\ni suspect the spacer rings right underneath the bajonet element are there to adjust the lens, since people in two repair youtube videos and me all have different amounts of spacers (i have a thick and a thin one). however the focusing behaviour doesn't change at all with the combination of spacers i put into the lens, even if i put none in.\n\ni also have the dx 18-55/3.5-5.6g lens which is -----> spot !!!  on at -5 af fine tune, so i doubt it's the d7000 that's off. is there some way to tell if the camera is off?\n\nwhat's the correct way to adjust the focus of the lens itself?", "sortedWord": "None", "identifyer": 49181, "year": "2021"}, {"Unnamed: 0": 157680, "autor": "isuckatpickinguserid", "date": 1613437129000, "content": "I spotted this hawk while out driving with my son. He stopped the car so I could walk back to get a few pictures. I was really lucky that it didn't take off right away. Shot on my D750 and Nikon 200-500 lens. I love this camera lens combo. I think it's as sharp as the talons in the last shot.", "link": "https://www.reddit.com/r/Nikon/comments/lkrwl0/i_spotted_this_hawk_while_out_driving_with_my_son/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i -----> spotted !!!  this hawk while out driving with my son. he stopped the car so i could walk back to get a few pictures. i was really lucky that it didn't take off right away. shot on my d750 and nikon 200-500 lens. i love this camera lens combo. i think it's as sharp as the talons in the last shot.", "sortedWord": "None", "identifyer": 49247, "year": "2021"}, {"Unnamed: 0": 158002, "autor": "Slip_Kid_", "date": 1609876740000, "content": "Help identifying smudges in photos /!/ &amp;#x200B;\n\n*Processing img yhojta5hkk961...*\n\n \n\nHey everyone! I've been doing photography for a little while now, and while I'm no stranger to sensor dust (green circle for reference), I haven't seen any smudges like this before. In my experience, dust on the rear element of my lens has always had more uniform borders, but these seem to be blotchy and widespread. The place where they are most visible is circled in red, but they seem to appear throughout the sky to some degree. They appear in the same spots between photos, and they're most noticeable when you increase the contrast/blacks in post. Also, the Z6 was my first full frame, so I've tested other lenses, but they're crop lenses using an adapter for the new mount, so I'm not sure how reliable of a comparison it is. Any ideas would be much appreciated!\n\n\\-------\n\nDetails are as follows:\n\nCamera: Nikon Z6\n\nLens: 24-70mm f/4\n\nAperture: f/22\n\nShutter: 1/160\n\nISO: 100", "link": "https://www.reddit.com/r/Nikon/comments/kr6br1/help_identifying_smudges_in_photos/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help identifying smudges in photos /!/ &amp;#x200b;\n\n*processing img yhojta5hkk961...*\n\n \n\nhey everyone! i've been doing photography for a little while now, and while i'm no stranger to sensor dust (green circle for reference), i haven't seen any smudges like this before. in my experience, dust on the rear element of my lens has always had more uniform borders, but these seem to be blotchy and widespread. the place where they are most visible is circled in red, but they seem to appear throughout the sky to some degree. they appear in the same -----> spots !!!  between photos, and they're most noticeable when you increase the contrast/blacks in post. also, the z6 was my first full frame, so i've tested other lenses, but they're crop lenses using an adapter for the new mount, so i'm not sure how reliable of a comparison it is. any ideas would be much appreciated!\n\n\\-------\n\ndetails are as follows:\n\ncamera: nikon z6\n\nlens: 24-70mm f/4\n\naperture: f/22\n\nshutter: 1/160\n\niso: 100", "sortedWord": "None", "identifyer": 49587, "year": "2021"}, {"Unnamed: 0": 158228, "autor": "williams357", "date": 1625577544000, "content": "Help with A-Level product design /!/ Hi all, for my A-Level product design NEA project my focus is on wildlife photography, if possible could you answer the following questions:\n\nHow much camera equipment do you carry with you whilst out?\n\nDo you move around and area to find the best spot or do you just set up anywhere?\n\nCan mobility be an issue for you whilst out talking photographs?\n\nAlternatively if you have time could you answer the following 2 surveys?\n\nhttps://www.surveymonkey.com/r/JZ62658\n\nhttps://www.surveymonkey.com/r/KZTFBB6\n\nThank you in advance", "link": "https://www.reddit.com/r/Nikon/comments/oeurto/help_with_alevel_product_design/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with a-level product design /!/ hi all, for my a-level product design nea project my focus is on wildlife photography, if possible could you answer the following questions:\n\nhow much camera equipment do you carry with you whilst out?\n\ndo you move around and area to find the best -----> spot !!!  or do you just set up anywhere?\n\ncan mobility be an issue for you whilst out talking photographs?\n\nalternatively if you have time could you answer the following 2 surveys?\n\nhttps://www.surveymonkey.com/r/jz62658\n\nhttps://www.surveymonkey.com/r/kztfbb6\n\nthank you in advance", "sortedWord": "None", "identifyer": 49826, "year": "2021"}, {"Unnamed: 0": 158537, "autor": "imheretostudybitch", "date": 1624081828000, "content": "Black spots when viewed through viewfinder /!/ Using Nikon D5300 from the past 4 years and have been noticing black spots through viewfinder from the last 1 year. It doesn't appear in the image so never bothered.\n[Images](https://imgur.com/a/Z23EMRu)\nAny way to get rid of it? As I want to sell it now.\n\nPS: I checked, its not on the mirror.", "link": "https://www.reddit.com/r/Nikon/comments/o39bxm/black_spots_when_viewed_through_viewfinder/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  when viewed through viewfinder /!/ using nikon d5300 from the past 4 years and have been noticing black -----> spots !!!  through viewfinder from the last 1 year. it doesn't appear in the image so never bothered.\n[images](https://imgur.com/a/z23emru)\nany way to get rid of it? as i want to sell it now.\n\nps: i checked, its not on the mirror.", "sortedWord": "None", "identifyer": 50148, "year": "2021"}, {"Unnamed: 0": 158692, "autor": "Antennahead2021", "date": 1627326706000, "content": "Dust on sensor D810 - previous post re Artifacts /!/ Thanks to everyone who responded! Got a kit for cleaning my sensor and I'm now spot free. My neighbor had a similar issue and I was able to clean his too. In all seriousness he said \"I don't know how it got so dirty. I don't take dirty pictures.\"", "link": "https://www.reddit.com/r/Nikon/comments/os5qvp/dust_on_sensor_d810_previous_post_re_artifacts/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dust on sensor d810 - previous post re artifacts /!/ thanks to everyone who responded! got a kit for cleaning my sensor and i'm now -----> spot !!!  free. my neighbor had a similar issue and i was able to clean his too. in all seriousness he said \"i don't know how it got so dirty. i don't take dirty pictures.\"", "sortedWord": "None", "identifyer": 50307, "year": "2021"}, {"Unnamed: 0": 158948, "autor": "nothingspecialva", "date": 1624740696000, "content": "noob question, in d850 can I make the Fn1 button act like AF-mode button (as in the Z7)? /!/ I have been alternating using d850 and a z7, and after a few weeks I realize using the Fn1 function as an AF-mode button is quite handy as I can use my same shooting hand, instead of having to use the other hand to press the circular button on the left of the lens in the d850.\n\nI have never used the custom buttons in the d850, and from the menus I see I can select a particular AF mode (single spot, group, etc) to the Fn1, but I have not found how to make the Fn1 act as the AF-mode so I can use the front dial to select.", "link": "https://www.reddit.com/r/Nikon/comments/o8itvv/noob_question_in_d850_can_i_make_the_fn1_button/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "noob question, in d850 can i make the fn1 button act like af-mode button (as in the z7)? /!/ i have been alternating using d850 and a z7, and after a few weeks i realize using the fn1 function as an af-mode button is quite handy as i can use my same shooting hand, instead of having to use the other hand to press the circular button on the left of the lens in the d850.\n\ni have never used the custom buttons in the d850, and from the menus i see i can select a particular af mode (single -----> spot !!! , group, etc) to the fn1, but i have not found how to make the fn1 act as the af-mode so i can use the front dial to select.", "sortedWord": "None", "identifyer": 50579, "year": "2021"}, {"Unnamed: 0": 158962, "autor": "Constant-Floor", "date": 1624727417000, "content": "Great-spotted woodpecker, Nikon D500 and Nikkor 200-500mm, 1/640, f/5.6, ISO 6400", "link": "https://www.reddit.com/r/Nikon/comments/o8eu0b/greatspotted_woodpecker_nikon_d500_and_nikkor/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "great------> spotted !!!  woodpecker, nikon d500 and nikkor 200-500mm, 1/640, f/5.6, iso 6400", "sortedWord": "None", "identifyer": 50593, "year": "2021"}, {"Unnamed: 0": 158980, "autor": "piercemj", "date": 1624705894000, "content": "Mexican Spotted Owl in Zion National Park [ Z7 &amp; Nikkor 200-500mm f/5.6]", "link": "https://www.reddit.com/r/Nikon/comments/o88shq/mexican_spotted_owl_in_zion_national_park_z7/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "mexican -----> spotted !!!  owl in zion national park [ z7 &amp; nikkor 200-500mm f/5.6]", "sortedWord": "None", "identifyer": 50612, "year": "2021"}, {"Unnamed: 0": 159072, "autor": "DaytonaDemon", "date": 1623486675000, "content": "I'm having issues with my new Nikon Z6II cameras. Anyone else? /!/ Pro photographer here. I shoot mostly weddings and portraits. Coming off three D750 DSLRs, I recently dove headfirst into the Nikon Z system with the purchase of two Z6II bodies, plus the Z 70-200 f/2.8 S, the Z 24-70 f/4 S, the Z 24-70 f/2.8s, the Z 24-200 f/4-5.6, the Z 50mm f/1.8, and the Z-mount Meike 85mm f/2.8 MF macro.\n\nI'm almost three weeks in and while I've come home from photo jobs with great images every time — exemplary sharpness and nice vibrant colors! — I've had issues too.\n\n1. My cameras tend to overexpose to the point of clipping when *a part* of my photos is taken up by a white building in the sun. At first I thought it was my fault — maybe I'd accidentally used exposure compensation, or spot metering rather than matrix, and so on. The next time I went back to the same scene I was very careful to watch my settings, and I set exposure compensation to two-thirds of a stop *under*, with the camera in matrix metering for sure. Still came home with the white building *way* overexposed, almost clipping. Had the same problem yesterday, but less pronounced, when I shot group photos that included someone wearing white pants. The pants were over-exposed by two or three stops. Never had that issue with any of my DSLRs. \n2. The shutter on one of my Z6II cameras locked up soon after I began using it. The display read *ERR* and a message said to press the shutter again. I did and nothing happened. Turned the camera off, then on again, still the same message but this time pressing the shutter button worked and everything went back to normal. Hmm.\n3. Two days ago I came home from a job with a whole bunch of NEF files *missing* from the main card, maybe 200 files (!) total. No reason that I can think of. I had to use my backup JPEGs to be able to deliver the job. Thank the heavens for that double card slot. I would've been hosed if I'd used a Z6.\n4. Could be operator error, but I've found repeatedly that when I photograph a group in AF-C and with wide-area people eye detect on (but tracking not engaged), the small yellow box will find an eye (which is good)...but I can't reliably move the eye box. There may be someone standing next to the person the focus is on, and frustratingly there's no little solid yellow triangle that indicates I can move the focus there with the thumb joystick. Sometimes that little yellow triangle only appears to the *other* side of the person the camera focuses on, even if that's not the direction where I want to move the focus point.\n\nAnyone else? I love these Z6II cameras in all sorts of ways, and the lenses are wonderful, but at this point I'm not sure that my 12-grand investment is paying off as nicely as I'd imagined.", "link": "https://www.reddit.com/r/Nikon/comments/ny22ru/im_having_issues_with_my_new_nikon_z6ii_cameras/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm having issues with my new nikon z6ii cameras. anyone else? /!/ pro photographer here. i shoot mostly weddings and portraits. coming off three d750 dslrs, i recently dove headfirst into the nikon z system with the purchase of two z6ii bodies, plus the z 70-200 f/2.8 s, the z 24-70 f/4 s, the z 24-70 f/2.8s, the z 24-200 f/4-5.6, the z 50mm f/1.8, and the z-mount meike 85mm f/2.8 mf macro.\n\ni'm almost three weeks in and while i've come home from photo jobs with great images every time — exemplary sharpness and nice vibrant colors! — i've had issues too.\n\n1. my cameras tend to overexpose to the point of clipping when *a part* of my photos is taken up by a white building in the sun. at first i thought it was my fault — maybe i'd accidentally used exposure compensation, or -----> spot !!!  metering rather than matrix, and so on. the next time i went back to the same scene i was very careful to watch my settings, and i set exposure compensation to two-thirds of a stop *under*, with the camera in matrix metering for sure. still came home with the white building *way* overexposed, almost clipping. had the same problem yesterday, but less pronounced, when i shot group photos that included someone wearing white pants. the pants were over-exposed by two or three stops. never had that issue with any of my dslrs. \n2. the shutter on one of my z6ii cameras locked up soon after i began using it. the display read *err* and a message said to press the shutter again. i did and nothing happened. turned the camera off, then on again, still the same message but this time pressing the shutter button worked and everything went back to normal. hmm.\n3. two days ago i came home from a job with a whole bunch of nef files *missing* from the main card, maybe 200 files (!) total. no reason that i can think of. i had to use my backup jpegs to be able to deliver the job. thank the heavens for that double card slot. i would've been hosed if i'd used a z6.\n4. could be operator error, but i've found repeatedly that when i photograph a group in af-c and with wide-area people eye detect on (but tracking not engaged), the small yellow box will find an eye (which is good)...but i can't reliably move the eye box. there may be someone standing next to the person the focus is on, and frustratingly there's no little solid yellow triangle that indicates i can move the focus there with the thumb joystick. sometimes that little yellow triangle only appears to the *other* side of the person the camera focuses on, even if that's not the direction where i want to move the focus point.\n\nanyone else? i love these z6ii cameras in all sorts of ways, and the lenses are wonderful, but at this point i'm not sure that my 12-grand investment is paying off as nicely as i'd imagined.", "sortedWord": "None", "identifyer": 50705, "year": "2021"}, {"Unnamed: 0": 159141, "autor": "kathcancan", "date": 1617587428000, "content": "D850 not performing as well as D3 /!/ Hello.  I have shot with a D3 for over 10 years.  It's so reliable - I have done thousands of photo sessions with it.\n\nMy husband recently bought me a D850.  I have scoured the settings and manual, but the pictures I'm getting from it are awful.  In addition to really variable exposures (compared to the reliability of the D3), the pictures are grainy.  Not blurry, but grainy/pixeley.  I don't know why.  And it's not all of them, but it's a lot.  I've NEVER had a grainy/pixeley pic from the D3.\n\nhttps://preview.redd.it/k2as42bjg9r61.jpg?width=7475&amp;format=pjpg&amp;auto=webp&amp;s=23a56a7c16d13a815af9d4a2a29aab8056db50dd\n\nAny thoughts about what is happening...?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yq0s548mg9r61.png?width=1249&amp;format=png&amp;auto=webp&amp;s=56b07833202d20eea77a03af7e73e9304268d10d\n\nFor example, in the quick candid shot below, everything is grainy.  It's not a depth of field issue (it's not like the foreground it in focus and the background isn't), the whole damn thing is pixelated, in every spot.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/b2qztf0ng9r61.png?width=1389&amp;format=png&amp;auto=webp&amp;s=06cfab431d79f91501c81d8dea2d135ce9650693\n\nI know the D3 like the back of my hand and the controls on this camera are very similar.  What on earth is the issue?!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/whm9p7ong9r61.png?width=1450&amp;format=png&amp;auto=webp&amp;s=ded2f6dd29278f89afabb0661a2b41075a27e42e\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pdzcjxcog9r61.png?width=1022&amp;format=png&amp;auto=webp&amp;s=1f1d06d51e8f631f8999f8f5b1ee3462dd38bca1", "link": "https://www.reddit.com/r/Nikon/comments/mka09q/d850_not_performing_as_well_as_d3/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "d850 not performing as well as d3 /!/ hello.  i have shot with a d3 for over 10 years.  it's so reliable - i have done thousands of photo sessions with it.\n\nmy husband recently bought me a d850.  i have scoured the settings and manual, but the pictures i'm getting from it are awful.  in addition to really variable exposures (compared to the reliability of the d3), the pictures are grainy.  not blurry, but grainy/pixeley.  i don't know why.  and it's not all of them, but it's a lot.  i've never had a grainy/pixeley pic from the d3.\n\nhttps://preview.redd.it/k2as42bjg9r61.jpg?width=7475&amp;format=pjpg&amp;auto=webp&amp;s=23a56a7c16d13a815af9d4a2a29aab8056db50dd\n\nany thoughts about what is happening...?\n\n&amp;#x200b;\n\nhttps://preview.redd.it/yq0s548mg9r61.png?width=1249&amp;format=png&amp;auto=webp&amp;s=56b07833202d20eea77a03af7e73e9304268d10d\n\nfor example, in the quick candid shot below, everything is grainy.  it's not a depth of field issue (it's not like the foreground it in focus and the background isn't), the whole damn thing is pixelated, in every -----> spot !!! .\n\n&amp;#x200b;\n\nhttps://preview.redd.it/b2qztf0ng9r61.png?width=1389&amp;format=png&amp;auto=webp&amp;s=06cfab431d79f91501c81d8dea2d135ce9650693\n\ni know the d3 like the back of my hand and the controls on this camera are very similar.  what on earth is the issue?!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/whm9p7ong9r61.png?width=1450&amp;format=png&amp;auto=webp&amp;s=ded2f6dd29278f89afabb0661a2b41075a27e42e\n\n&amp;#x200b;\n\nhttps://preview.redd.it/pdzcjxcog9r61.png?width=1022&amp;format=png&amp;auto=webp&amp;s=1f1d06d51e8f631f8999f8f5b1ee3462dd38bca1", "sortedWord": "None", "identifyer": 50782, "year": "2021"}, {"Unnamed: 0": 159273, "autor": "pininghi", "date": 1617805251000, "content": "Cleaned the lens, now AF does not work anymore (D7000, 18-105 AF) /!/ Hi guys, I am fairly new to photography so excuse me in advance.\n\nI have a D7000 with a 18-105mm AF VR. I happened to see dust in the form of dark spots in pictures. I removed the lens and cleaned it with a cloth for glasses. Dust is gone but my AF does not work anymore! What did I do wrong? I tried to clean pins but none of this works! What have I done? \n\nI did not touch the mirror inside the reflex.\nManual focus happens to work flawlessly.\n\nThanks in advance!", "link": "https://www.reddit.com/r/Nikon/comments/mm35qy/cleaned_the_lens_now_af_does_not_work_anymore/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaned the lens, now af does not work anymore (d7000, 18-105 af) /!/ hi guys, i am fairly new to photography so excuse me in advance.\n\ni have a d7000 with a 18-105mm af vr. i happened to see dust in the form of dark -----> spots !!!  in pictures. i removed the lens and cleaned it with a cloth for glasses. dust is gone but my af does not work anymore! what did i do wrong? i tried to clean pins but none of this works! what have i done? \n\ni did not touch the mirror inside the reflex.\nmanual focus happens to work flawlessly.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 50919, "year": "2021"}, {"Unnamed: 0": 159276, "autor": "magmastick", "date": 1617793534000, "content": "How to use only external spot light without built-in flash? /!/ Hello: i have a Nikon D3300 which i want to use to take some pictures with an external light (wireless). This external light already works in sync when i use flash mode, but how can i keep using the synced external light without using the built-in flash?\n\nThanks in advance", "link": "https://www.reddit.com/r/Nikon/comments/mlzms2/how_to_use_only_external_spot_light_without/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to use only external -----> spot !!!  light without built-in flash? /!/ hello: i have a nikon d3300 which i want to use to take some pictures with an external light (wireless). this external light already works in sync when i use flash mode, but how can i keep using the synced external light without using the built-in flash?\n\nthanks in advance", "sortedWord": "None", "identifyer": 50922, "year": "2021"}, {"Unnamed: 0": 160019, "autor": "F-O", "date": 1631973590000, "content": "D600 bought used from local store shows significant oil spots on sensor despite them assuring me it had been repaired by Nikon. Should I get the sensor cleaned first or get reimbursed right away? /!/ Around three weeks ago I saw a decent deal on a used D600 in a local shop. It was ranked \"C\" on their ranking scale (it goes all the way to F) meaning it was in relatively good condition. Its shutter count was 23500 which is pretty good too. I went in and knowing the sensor issues of the D600 and that the recall program was over, so the first thing I asked if they knew if it had been repaired. The guy knew exactly what I was talking about and guaranteed me it had been repaired by Nikon and that he wouldn't have bought it otherwise. The store also had a 90 day guaranty on used items , and I wouldn't have bought it otherwise.\n\nWell yesterday I tried shooting at f10/f11 for the first time and, you guessed it, there are 7-8 oil spots, apparent enough for them to be noticeable even when looked unzoomed in live view.\n\nNow I'm wondering if I should at the store to clean the sensor first or if I should just ask for reimbursement right away.\n\nMy fear if I get it cleaned is that the spots will start reappearing after the 90 day guaranty has expired and I'll be stuck with it.\n\nThose who have or have used a D600, what do you think I should do? Is a sensor cleaning enough? Did the camera actually get repaired? If the price I got it for wasn't good I wouldn't bother and just get it reimbursed but now if I have to change cameras I will likely have to spend a few hundreds dollars more.\n\nThanks for your help!", "link": "https://www.reddit.com/r/Nikon/comments/pqmy6o/d600_bought_used_from_local_store_shows/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "d600 bought used from local store shows significant oil -----> spots !!!  on sensor despite them assuring me it had been repaired by nikon. should i get the sensor cleaned first or get reimbursed right away? /!/ around three weeks ago i saw a decent deal on a used d600 in a local shop. it was ranked \"c\" on their ranking scale (it goes all the way to f) meaning it was in relatively good condition. its shutter count was 23500 which is pretty good too. i went in and knowing the sensor issues of the d600 and that the recall program was over, so the first thing i asked if they knew if it had been repaired. the guy knew exactly what i was talking about and guaranteed me it had been repaired by nikon and that he wouldn't have bought it otherwise. the store also had a 90 day guaranty on used items , and i wouldn't have bought it otherwise.\n\nwell yesterday i tried shooting at f10/f11 for the first time and, you guessed it, there are 7-8 oil spots, apparent enough for them to be noticeable even when looked unzoomed in live view.\n\nnow i'm wondering if i should at the store to clean the sensor first or if i should just ask for reimbursement right away.\n\nmy fear if i get it cleaned is that the spots will start reappearing after the 90 day guaranty has expired and i'll be stuck with it.\n\nthose who have or have used a d600, what do you think i should do? is a sensor cleaning enough? did the camera actually get repaired? if the price i got it for wasn't good i wouldn't bother and just get it reimbursed but now if i have to change cameras i will likely have to spend a few hundreds dollars more.\n\nthanks for your help!", "sortedWord": "None", "identifyer": 51710, "year": "2021"}, {"Unnamed: 0": 160523, "autor": "AarohiRane", "date": 1613794662000, "content": "Pictures coming soft. /!/ Hi. I don't know if I am the only one or is there anyone else. \nI have a Nikon D5300 and I have been shooting back button from the past three years. Lately I have been getting images that are off focus. I mean the focus goes behind the subject. \nMy settings are: \nAF-S \nMetering: Spot. \nIs there something wrong I am doing or there is something wrong with my camera.", "link": "https://www.reddit.com/r/Nikon/comments/lnyz8e/pictures_coming_soft/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pictures coming soft. /!/ hi. i don't know if i am the only one or is there anyone else. \ni have a nikon d5300 and i have been shooting back button from the past three years. lately i have been getting images that are off focus. i mean the focus goes behind the subject. \nmy settings are: \naf-s \nmetering: -----> spot !!! . \nis there something wrong i am doing or there is something wrong with my camera.", "sortedWord": "None", "identifyer": 52228, "year": "2021"}, {"Unnamed: 0": 161057, "autor": "OhSixTJ", "date": 1621562715000, "content": "Found her in her hiding spot. Z7, 35/1.8S and a little Lightroom.", "link": "https://www.reddit.com/r/Nikon/comments/nhhhnu/found_her_in_her_hiding_spot_z7_3518s_and_a/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "found her in her hiding -----> spot !!! . z7, 35/1.8s and a little lightroom.", "sortedWord": "None", "identifyer": 52795, "year": "2021"}, {"Unnamed: 0": 161073, "autor": "the20thh", "date": 1621531136000, "content": "Why did they make the 18-140 lens cap area less recessed? The cap literally falls off if the wind blows /!/ All my other lenses fit nice and snug, but the 18-140 lens has a super shallow spot for the cap to grab, am I missing something here?", "link": "https://www.reddit.com/r/Nikon/comments/nh5ztl/why_did_they_make_the_18140_lens_cap_area_less/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why did they make the 18-140 lens cap area less recessed? the cap literally falls off if the wind blows /!/ all my other lenses fit nice and snug, but the 18-140 lens has a super shallow -----> spot !!!  for the cap to grab, am i missing something here?", "sortedWord": "None", "identifyer": 52812, "year": "2021"}, {"Unnamed: 0": 161196, "autor": "britz_crackers", "date": 1625859746000, "content": "Does the FTZ adapter change the \"sweet spot\" of my lens? /!/ I'm an entry-level/hobbyist landscape photographer with a Nikon Z6II camera. My fav lens is my Nikon f/1.4 50mm with an F mount (eventually I plan to pick up some Z-mount lenses). Does using the FTZ adapter change my lens's \"sweet spot\"? Is the sweet spot different with every lens/camera combo?\n\nThanks so much in advance!! &lt;3 :)", "link": "https://www.reddit.com/r/Nikon/comments/oh324m/does_the_ftz_adapter_change_the_sweet_spot_of_my/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does the ftz adapter change the \"sweet -----> spot !!! \" of my lens? /!/ i'm an entry-level/hobbyist landscape photographer with a nikon z6ii camera. my fav lens is my nikon f/1.4 50mm with an f mount (eventually i plan to pick up some z-mount lenses). does using the ftz adapter change my lens's \"sweet spot\"? is the sweet spot different with every lens/camera combo?\n\nthanks so much in advance!! &lt;3 :)", "sortedWord": "None", "identifyer": 52945, "year": "2021"}, {"Unnamed: 0": 161368, "autor": "unfortunatelyequivoc", "date": 1610179678000, "content": "Random “dust looking” spots on camera lcd, only with my new lens /!/ Hi photographers of reddit!\n\nFor christmas I received a 70-300m AF Nikkor lens \n\ni had yet to use it unfortunately cause i had been very busy however when i put it on my camera tonight there were some random spots on the screen \n\nI thought maybe it was dirty so I cleaned the lens and even used this like dust thing and they were still there\n\nit was not through the viewfinder though just the screen \n\ni then put on my other lens and nothing was wrong, so i know it cannot be my camera so it must be the lens\n\ni will attach a photo please let me know if you have any idea what’s going on\n\ni believe i can return the lens but if it’s not a real problem and perhaps just me missing something i’d prefer that\n\nthanks! \n[Photo (spots are circled, some more prominent than others) ](https://imgur.com/gallery/kvlmFGP)", "link": "https://www.reddit.com/r/Nikon/comments/ktmx3y/random_dust_looking_spots_on_camera_lcd_only_with/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "random “dust looking” -----> spots !!!  on camera lcd, only with my new lens /!/ hi photographers of reddit!\n\nfor christmas i received a 70-300m af nikkor lens \n\ni had yet to use it unfortunately cause i had been very busy however when i put it on my camera tonight there were some random spots on the screen \n\ni thought maybe it was dirty so i cleaned the lens and even used this like dust thing and they were still there\n\nit was not through the viewfinder though just the screen \n\ni then put on my other lens and nothing was wrong, so i know it cannot be my camera so it must be the lens\n\ni will attach a photo please let me know if you have any idea what’s going on\n\ni believe i can return the lens but if it’s not a real problem and perhaps just me missing something i’d prefer that\n\nthanks! \n[photo (spots are circled, some more prominent than others) ](https://imgur.com/gallery/kvlmfgp)", "sortedWord": "None", "identifyer": 53129, "year": "2021"}, {"Unnamed: 0": 162146, "autor": "scoglio91", "date": 1624530198000, "content": "Great Spotted Woodpecker | D500 + 300PF / TC-14E III", "link": "https://www.reddit.com/r/Nikon/comments/o6y3yx/great_spotted_woodpecker_d500_300pf_tc14e_iii/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "great -----> spotted !!!  woodpecker | d500 + 300pf / tc-14e iii", "sortedWord": "None", "identifyer": 53948, "year": "2021"}, {"Unnamed: 0": 162280, "autor": "Agile37904l", "date": 1623199515000, "content": "Finally found a nice spot of wild garlic this year! Nikon Z6 + 14-30mm", "link": "https://www.reddit.com/r/Nikon/comments/nvj6ia/finally_found_a_nice_spot_of_wild_garlic_this/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "finally found a nice -----> spot !!!  of wild garlic this year! nikon z6 + 14-30mm", "sortedWord": "None", "identifyer": 54092, "year": "2021"}, {"Unnamed: 0": 162348, "autor": "BillBigsB", "date": 1610858993000, "content": "Just got a used nikon d500 and the 200-500 lens. First day out and there are these blurry spots showing up. Any ideas? I've tried a different lens and they don't seem to be there but the nikon glass looks clean?", "link": "https://www.reddit.com/r/Nikon/comments/kyzp6d/just_got_a_used_nikon_d500_and_the_200500_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just got a used nikon d500 and the 200-500 lens. first day out and there are these blurry -----> spots !!!  showing up. any ideas? i've tried a different lens and they don't seem to be there but the nikon glass looks clean?", "sortedWord": "None", "identifyer": 54164, "year": "2021"}, {"Unnamed: 0": 162416, "autor": "vaykanahc", "date": 1617689456000, "content": "Spot the rainbow. Nikon D700 + Nikkor 70-200mm f/2.8", "link": "https://www.reddit.com/r/Nikon/comments/ml529u/spot_the_rainbow_nikon_d700_nikkor_70200mm_f28/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  the rainbow. nikon d700 + nikkor 70-200mm f/2.8", "sortedWord": "None", "identifyer": 54238, "year": "2021"}, {"Unnamed: 0": 162653, "autor": "lazerlike42", "date": 1622911144000, "content": "Deciding between a D500/Z7ii. /!/ I currently have a D5600 (and a Canon M50 which I don't use much) which I've been generally happy with but have been wanting to replace for a while as I've outgrown it a bit (e.g., lack of high-speed sync, would prefer more controls, want to improve high ISO performance at least a little bit, etc.) What's really prompted me to actually act is that in trying to purchase the 200-500 I had some problems and started to be confronted with the lack of an AF fine tune on the D5600.\n\nI have 4 lenses: the 18-55 VR kit, 70-300 (no VR), 35/1.8, the 200-500. I photograph kids running around, portraits, and wildlife.\n\nConsidering the D500 and the Z7ii\n\nReasons for considering the D500:\n* Autofocus, which has been a minor peeve of mine on the 5600\n* DX format so no trouble with the lenses\n* Versatile control scheme\n* Tried and true\n* Cost\n\nReasons against the D500:\n* It's fairly old at this point and while this may not mean a whole lot right now, it's a factor. \n* Every SLR/DSLR I've ever had wound up getting debris in the viewfinder, which bothers me when I use it\n* Poor quality video, so I'd keep the M50 for video (which I'm also not entirely happy with)\n\nReasons for considering the Z7ii:\n* Better futureproofing \n* I like EVFs \n* I like some of the user interface mechanics of mirrorless cameras\n* Eye detection and similar tools\n* Potential for significant improvements with firmware updates\n* Strong video performance to replace and sell the M50\n* Potential to move to better full frame lenses in the future\n\nReasons against the Z7ii:\n* Autofocus with action is improved, but still sounds like at least a minor sore spot\n* Control scheme is not as customizable - at least right now\n* Cost\n\nHonestly I think I'd be happy with either, and the biggest factor making the decision difficult is the cost difference. I can do either, but the less expensive option is certainly more comfortable. I think ideally I would prefer the mirrorless, but as much as I've listed some reasons here I'm not sure how much of that is an honest desire and how much is about the newness and \"shininess\" of them.\n\nI've *considered* less expensive mirrorless options, but it seems reasonable to decide against them because:\n\n* The first gen Z6/Z7 seem to be at the end of the line in terms of updates and already lack at least a few features I think I'd use (e.g., eye-focus while in smaller area modes)\n* The Z6ii is tempting BUT with my DX lenses I feel locked into the 45 MP sensor so that I will still get a good ~20MP image out of them. If I did the Z6ii, I think I'd have to spend a lot more in updating my lenses. \n\nI've obviously thought a lot about this and so there may not be a ton of new factual information for people to add to the equation here, but I am curious to hear people's thoughts, opinions, and experiences.", "link": "https://www.reddit.com/r/Nikon/comments/nszqok/deciding_between_a_d500z7ii/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "deciding between a d500/z7ii. /!/ i currently have a d5600 (and a canon m50 which i don't use much) which i've been generally happy with but have been wanting to replace for a while as i've outgrown it a bit (e.g., lack of high-speed sync, would prefer more controls, want to improve high iso performance at least a little bit, etc.) what's really prompted me to actually act is that in trying to purchase the 200-500 i had some problems and started to be confronted with the lack of an af fine tune on the d5600.\n\ni have 4 lenses: the 18-55 vr kit, 70-300 (no vr), 35/1.8, the 200-500. i photograph kids running around, portraits, and wildlife.\n\nconsidering the d500 and the z7ii\n\nreasons for considering the d500:\n* autofocus, which has been a minor peeve of mine on the 5600\n* dx format so no trouble with the lenses\n* versatile control scheme\n* tried and true\n* cost\n\nreasons against the d500:\n* it's fairly old at this point and while this may not mean a whole lot right now, it's a factor. \n* every slr/dslr i've ever had wound up getting debris in the viewfinder, which bothers me when i use it\n* poor quality video, so i'd keep the m50 for video (which i'm also not entirely happy with)\n\nreasons for considering the z7ii:\n* better futureproofing \n* i like evfs \n* i like some of the user interface mechanics of mirrorless cameras\n* eye detection and similar tools\n* potential for significant improvements with firmware updates\n* strong video performance to replace and sell the m50\n* potential to move to better full frame lenses in the future\n\nreasons against the z7ii:\n* autofocus with action is improved, but still sounds like at least a minor sore -----> spot !!! \n* control scheme is not as customizable - at least right now\n* cost\n\nhonestly i think i'd be happy with either, and the biggest factor making the decision difficult is the cost difference. i can do either, but the less expensive option is certainly more comfortable. i think ideally i would prefer the mirrorless, but as much as i've listed some reasons here i'm not sure how much of that is an honest desire and how much is about the newness and \"shininess\" of them.\n\ni've *considered* less expensive mirrorless options, but it seems reasonable to decide against them because:\n\n* the first gen z6/z7 seem to be at the end of the line in terms of updates and already lack at least a few features i think i'd use (e.g., eye-focus while in smaller area modes)\n* the z6ii is tempting but with my dx lenses i feel locked into the 45 mp sensor so that i will still get a good ~20mp image out of them. if i did the z6ii, i think i'd have to spend a lot more in updating my lenses. \n\ni've obviously thought a lot about this and so there may not be a ton of new factual information for people to add to the equation here, but i am curious to hear people's thoughts, opinions, and experiences.", "sortedWord": "None", "identifyer": 54493, "year": "2021"}, {"Unnamed: 0": 162865, "autor": "skyestalimit", "date": 1633228756000, "content": "Visited my new astro spot during daytime, was not disappointed! D610, Bower 14mm 2.8", "link": "https://www.reddit.com/r/Nikon/comments/q090rp/visited_my_new_astro_spot_during_daytime_was_not/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "visited my new astro -----> spot !!!  during daytime, was not disappointed! d610, bower 14mm 2.8", "sortedWord": "None", "identifyer": 54719, "year": "2021"}, {"Unnamed: 0": 162911, "autor": "VillyP77", "date": 1632266103000, "content": "sweet spot for best sharpness? 17-55mm 2.8 lens /!/ topic, just wondering what the sweet spot for aperture is. I don't quite understand what a full f-stop is. But I hear it's 2-3 steps lower than the lowest aperture your lens is capable of. \n\n&amp;#x200B;\n\nSo, for 2.8, would it be...4.5-5.6?", "link": "https://www.reddit.com/r/Nikon/comments/psundz/sweet_spot_for_best_sharpness_1755mm_28_lens/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sweet -----> spot !!!  for best sharpness? 17-55mm 2.8 lens /!/ topic, just wondering what the sweet spot for aperture is. i don't quite understand what a full f-stop is. but i hear it's 2-3 steps lower than the lowest aperture your lens is capable of. \n\n&amp;#x200b;\n\nso, for 2.8, would it be...4.5-5.6?", "sortedWord": "None", "identifyer": 54768, "year": "2021"}, {"Unnamed: 0": 162973, "autor": "flora_y_fauno", "date": 1632152593000, "content": "Spot metering with BBF on D5600? /!/ I’m a beginner, so bear with me.\n\nI really like using back-button focus on my Nikon D5600, but I’m also trying to get better at spot metering.\n\nLet’s say I’m taking a picture of a black dog in a field of grass. I want my spot metering to be set for the grass, but I’d like my point of focus to be the black dog.\n\nIs there any way to do this on the D5600 while using back-button focus?\n\nThere seems to be an option to set the half-shutter to AE-Lock, but doing this alongside using the AE-L/AF-L for focus is a little….challenging.\n\nIs there any other way? Do I have absolutely no idea what I’m talking about? SOS.", "link": "https://www.reddit.com/r/Nikon/comments/prxg8q/spot_metering_with_bbf_on_d5600/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering with bbf on d5600? /!/ i’m a beginner, so bear with me.\n\ni really like using back-button focus on my nikon d5600, but i’m also trying to get better at spot metering.\n\nlet’s say i’m taking a picture of a black dog in a field of grass. i want my spot metering to be set for the grass, but i’d like my point of focus to be the black dog.\n\nis there any way to do this on the d5600 while using back-button focus?\n\nthere seems to be an option to set the half-shutter to ae-lock, but doing this alongside using the ae-l/af-l for focus is a little….challenging.\n\nis there any other way? do i have absolutely no idea what i’m talking about? sos.", "sortedWord": "None", "identifyer": 54833, "year": "2021"}, {"Unnamed: 0": 162976, "autor": "steelrattus", "date": 1632149110000, "content": "D3100 Tether Software? /!/ Hi folks,\n\nI work at a school in the IT department, and I'm trying to help out our photography teacher. She has a number of older Nikon cameras (mostly if not all D3100s), and for teaching purposes she would like to be able to reproduce what you can see - more or less - on her laptop by connecting the camera to it. I understand this is called tethering. Having read around the topic it looks like the D3100 may not support this well, if at all.\n\nI have been to Nikon's download page for the D3100 and there are various apps such as NX Studio, Capture NX-D, ViewNX-i, ViewNX 2, and Capture NX 2. Do any of these support tethering?\n\nIt might not be catastrophic if it doesn't display exactly what the camera shows, it's probably more than you can adjust settings, take pictures, and see the results, from a teaching perspective.\n\nIf Nikon's software cannot do it, is there anything 3rd party out there that will?\n\nI've spotted an HDMI connector on the camera, although the ideal would be to control this via the computer, rather than connect the camera directly to a projector (and a lot of our projectors only have VGA connectors).\n\nThanks", "link": "https://www.reddit.com/r/Nikon/comments/prwbxe/d3100_tether_software/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "d3100 tether software? /!/ hi folks,\n\ni work at a school in the it department, and i'm trying to help out our photography teacher. she has a number of older nikon cameras (mostly if not all d3100s), and for teaching purposes she would like to be able to reproduce what you can see - more or less - on her laptop by connecting the camera to it. i understand this is called tethering. having read around the topic it looks like the d3100 may not support this well, if at all.\n\ni have been to nikon's download page for the d3100 and there are various apps such as nx studio, capture nx-d, viewnx-i, viewnx 2, and capture nx 2. do any of these support tethering?\n\nit might not be catastrophic if it doesn't display exactly what the camera shows, it's probably more than you can adjust settings, take pictures, and see the results, from a teaching perspective.\n\nif nikon's software cannot do it, is there anything 3rd party out there that will?\n\ni've -----> spotted !!!  an hdmi connector on the camera, although the ideal would be to control this via the computer, rather than connect the camera directly to a projector (and a lot of our projectors only have vga connectors).\n\nthanks", "sortedWord": "None", "identifyer": 54836, "year": "2021"}, {"Unnamed: 0": 162999, "autor": "tragically_", "date": 1631855673000, "content": "mk2 ftz /!/ you see, this is why I have a hard time with nikon decisions. they effed up z mk1 with 1 slot, then the ftz with no room for a tripod plate. who are the idiots that design these and more so, who are the idiots that authorize these mistakes tp be put out?\n\nI have to say that not making an adapter for afd pretty much makes nikon z a no go. af is slow as hell on the dance floor too.  im starting to consider other brands. more third party lens support too. I really like tamron and sigma lenses the last few years.  no, those garbage chinese lenses are not interesting to me. \n\nI cant believe I would have a day where I would consider sony or canon or even panasonic s1h . I plan to move to video and the d780 would have fit the bill (and with no ibis) had it recorded to both cards. now I look elsewhere. \n\n I hope they can turn around. though with mistakes so many, and their stubborn way, not sure. z8 yea, so what.  I already have the d3s and d4s and use my d750 than both of those for the smaller size. \n\nfrustrated and hopeless feeling with nikons decisions. lets not mention d750 recall, I had that. nikon d600 oil spots, had that and traded it for the d3s. sb900 overheating. had that. replaced bulb and fresnel lens as well. nikon d800 af spot error. 300 pf vr issue. why they dont learn. \n\nand the biggest crime with nikon gear is the rubbers falling apart. yes they are more comfortable than canon but when they come apart when im working, there is nothing that feels good with that and its an ongoing feeling day after day. that has never been addressed. ive since accumalated pictures of nikon gear with the issue from other pro photogs. \n\nwhat can I say. maybe its the reason nikon fell to 3rd place. I was with nikon since f801 film days. I think they are on a downhill trajectory if they dont take peoples needs into considerations.  pay attention to small details and cheap out on basic must haves.", "link": "https://www.reddit.com/r/Nikon/comments/pptxg7/mk2_ftz/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "mk2 ftz /!/ you see, this is why i have a hard time with nikon decisions. they effed up z mk1 with 1 slot, then the ftz with no room for a tripod plate. who are the idiots that design these and more so, who are the idiots that authorize these mistakes tp be put out?\n\ni have to say that not making an adapter for afd pretty much makes nikon z a no go. af is slow as hell on the dance floor too.  im starting to consider other brands. more third party lens support too. i really like tamron and sigma lenses the last few years.  no, those garbage chinese lenses are not interesting to me. \n\ni cant believe i would have a day where i would consider sony or canon or even panasonic s1h . i plan to move to video and the d780 would have fit the bill (and with no ibis) had it recorded to both cards. now i look elsewhere. \n\n i hope they can turn around. though with mistakes so many, and their stubborn way, not sure. z8 yea, so what.  i already have the d3s and d4s and use my d750 than both of those for the smaller size. \n\nfrustrated and hopeless feeling with nikons decisions. lets not mention d750 recall, i had that. nikon d600 oil -----> spots !!! , had that and traded it for the d3s. sb900 overheating. had that. replaced bulb and fresnel lens as well. nikon d800 af spot error. 300 pf vr issue. why they dont learn. \n\nand the biggest crime with nikon gear is the rubbers falling apart. yes they are more comfortable than canon but when they come apart when im working, there is nothing that feels good with that and its an ongoing feeling day after day. that has never been addressed. ive since accumalated pictures of nikon gear with the issue from other pro photogs. \n\nwhat can i say. maybe its the reason nikon fell to 3rd place. i was with nikon since f801 film days. i think they are on a downhill trajectory if they dont take peoples needs into considerations.  pay attention to small details and cheap out on basic must haves.", "sortedWord": "None", "identifyer": 54859, "year": "2021"}, {"Unnamed: 0": 163114, "autor": "samjh1", "date": 1628460368000, "content": "Greater spotted woodpecker in the garden - Nikon Z7ii body (Tamron 70-200mm G2 Lens) - 1/500, f/5, ISO 400. Had to crop in quite a bit unfortunately due to 200mm not having enough reach. Hopefully i'll get myself a TC soon!", "link": "https://www.reddit.com/r/Nikon/comments/p0o385/greater_spotted_woodpecker_in_the_garden_nikon/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "greater -----> spotted !!!  woodpecker in the garden - nikon z7ii body (tamron 70-200mm g2 lens) - 1/500, f/5, iso 400. had to crop in quite a bit unfortunately due to 200mm not having enough reach. hopefully i'll get myself a tc soon!", "sortedWord": "None", "identifyer": 54978, "year": "2021"}, {"Unnamed: 0": 163209, "autor": "the_rolling_paper", "date": 1628006301000, "content": "How do you guys clean your camera sensor? /!/ I've a Nikon D3500 with no option to clean sensor. I tried cleaning it manually but it still has soke dirt spots on it.\n\nI need some advice or suggestions on how to remove those.", "link": "https://www.reddit.com/r/Nikon/comments/ox6fnh/how_do_you_guys_clean_your_camera_sensor/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do you guys clean your camera sensor? /!/ i've a nikon d3500 with no option to clean sensor. i tried cleaning it manually but it still has soke dirt -----> spots !!!  on it.\n\ni need some advice or suggestions on how to remove those.", "sortedWord": "None", "identifyer": 55077, "year": "2021"}, {"Unnamed: 0": 163525, "autor": "nukeaccounteveryweek", "date": 1634953595000, "content": "Fishing spot - D3100 + 18-55 VR (f/8, 1/320, ISO100 at 18mm)", "link": "https://www.reddit.com/r/Nikon/comments/qdvaa1/fishing_spot_d3100_1855_vr_f8_1320_iso100_at_18mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fishing -----> spot !!!  - d3100 + 18-55 vr (f/8, 1/320, iso100 at 18mm)", "sortedWord": "None", "identifyer": 55410, "year": "2021"}, {"Unnamed: 0": 163602, "autor": "confucuis", "date": 1633739299000, "content": "Upgrading from a D3200 to D7100 for Motorsport photography? /!/ Hi All,\nI have been using a D3200 for years for motorsport photography as a hobby. An acquaintance of mine is selling his D7100 and it got me thinking maybe it might be time for an upgrade? I've also been noticing my D3200 is beginning to have issues too like not auto focusing, and even when it does, shots at times come out in soft focus or the subject matter is out of focus but a random spot in the background/foreground is in tack sharp focus!\n\nSo the price is 400 Euro ONO for:\n\nNikon d7100 + Battery Charger + Nikon battery grip + Nikon 18-105 lens and a shutter count = 76270\n\nMy (limited) understanding is that the shutter count is quite high?\n\nA quick search reveals another D7100 at 500 euro with a lower shutter count of 4800 that comes with  a Nikon 18-55mm 1:3.5-5.6G VR lens + Remote + Battery &amp; Charger + Lens reversing ring.\n\nNow it doesn't have to be a 7100, that just happened to be the camera that he was selling which got me thinking about upgrading. I don't really want to break the bank on this as I prefer racing to photographing racing but if the right deal came up my max budget could be 1000 euro (I realise that might be quite low and there are a lot of cameras which go for multiples of that!!)\n\nAny suggestions welcome!", "link": "https://www.reddit.com/r/Nikon/comments/q4aicj/upgrading_from_a_d3200_to_d7100_for_motorsport/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "upgrading from a d3200 to d7100 for motorsport photography? /!/ hi all,\ni have been using a d3200 for years for motorsport photography as a hobby. an acquaintance of mine is selling his d7100 and it got me thinking maybe it might be time for an upgrade? i've also been noticing my d3200 is beginning to have issues too like not auto focusing, and even when it does, shots at times come out in soft focus or the subject matter is out of focus but a random -----> spot !!!  in the background/foreground is in tack sharp focus!\n\nso the price is 400 euro ono for:\n\nnikon d7100 + battery charger + nikon battery grip + nikon 18-105 lens and a shutter count = 76270\n\nmy (limited) understanding is that the shutter count is quite high?\n\na quick search reveals another d7100 at 500 euro with a lower shutter count of 4800 that comes with  a nikon 18-55mm 1:3.5-5.6g vr lens + remote + battery &amp; charger + lens reversing ring.\n\nnow it doesn't have to be a 7100, that just happened to be the camera that he was selling which got me thinking about upgrading. i don't really want to break the bank on this as i prefer racing to photographing racing but if the right deal came up my max budget could be 1000 euro (i realise that might be quite low and there are a lot of cameras which go for multiples of that!!)\n\nany suggestions welcome!", "sortedWord": "None", "identifyer": 55494, "year": "2021"}, {"Unnamed: 0": 163863, "autor": "rajapraveen80", "date": 1620566219000, "content": "Spot-billed pelican - Nikon D500 Sigma 150.0-600.0 mm f/5.0-6.3", "link": "https://www.reddit.com/r/Nikon/comments/n8e28l/spotbilled_pelican_nikon_d500_sigma_15006000_mm/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!! -billed pelican - nikon d500 sigma 150.0-600.0 mm f/5.0-6.3", "sortedWord": "None", "identifyer": 55765, "year": "2021"}, {"Unnamed: 0": 164169, "autor": "SarsaparillaCorona", "date": 1623803976000, "content": "How tight should the Aperture dial on a 50mm 1.2 AIS feel? /!/ Just got a 9 bladed 50mm 1.2 and as you can imagine I need to do some work to it, just the usual dust removal and Helicoid greasing, but I've noticed that the aperture dial adjustment is tight, much tighter than my relatively clean 50mm 1.4. it clicks fine, and there aren't any dead spots, but should I be concerned by the fact it's tight, or are the 1.2 aperture rings just tighter on purpose to accomodate for the 1.4 unmarked F stop?", "link": "https://www.reddit.com/r/Nikon/comments/o0sq0e/how_tight_should_the_aperture_dial_on_a_50mm_12/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how tight should the aperture dial on a 50mm 1.2 ais feel? /!/ just got a 9 bladed 50mm 1.2 and as you can imagine i need to do some work to it, just the usual dust removal and helicoid greasing, but i've noticed that the aperture dial adjustment is tight, much tighter than my relatively clean 50mm 1.4. it clicks fine, and there aren't any dead -----> spots !!! , but should i be concerned by the fact it's tight, or are the 1.2 aperture rings just tighter on purpose to accomodate for the 1.4 unmarked f stop?", "sortedWord": "None", "identifyer": 56085, "year": "2021"}, {"Unnamed: 0": 164457, "autor": "CaligoIntus", "date": 1624312367000, "content": "A wild rabbit I spotted at Deception pass state park in Washington state - Nikon D4s, Tamron 150-600 G2", "link": "https://www.reddit.com/r/Nikon/comments/o56lnc/a_wild_rabbit_i_spotted_at_deception_pass_state/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "a wild rabbit i -----> spotted !!!  at deception pass state park in washington state - nikon d4s, tamron 150-600 g2", "sortedWord": "None", "identifyer": 56386, "year": "2021"}, {"Unnamed: 0": 165011, "autor": "MobileLocal", "date": 1619970983000, "content": "Do you have the little cover for grip connection spot, D610? /!/ I didn't break it, but have misplaced the little cover for the grip connection rectangle on my d610. I am paring it down to streamline for a moment and don't want to damage that spot. Does anyone have that bit as a spare I could purchase, please? TIA 🤓", "link": "https://www.reddit.com/r/Nikon/comments/n39biw/do_you_have_the_little_cover_for_grip_connection/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do you have the little cover for grip connection -----> spot !!! , d610? /!/ i didn't break it, but have misplaced the little cover for the grip connection rectangle on my d610. i am paring it down to streamline for a moment and don't want to damage that spot. does anyone have that bit as a spare i could purchase, please? tia 🤓", "sortedWord": "None", "identifyer": 56972, "year": "2021"}], "name": "spotnikon2021"}