{"interestingcomments": [{"Unnamed: 0": 248621, "autor": "nal1200", "date": 1530301983000, "content": "[META] Can we get post flair for different kinds of posts? /!/ It seems within the past year or so this sub has become more of an /r/pics clone. While I don't necessarily think we should prohibit posting pictures taken with Nikon bodies, it'd be nice if all \"just for show\" photos could be tagged as such. This could also apply to \"help me, what is going on with my camera/lens\" posts, etc etc.", "link": "https://www.reddit.com/r/Nikon/comments/8uw441/meta_can_we_get_post_flair_for_different_kinds_of/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "[meta] can we get post flair for different kinds of posts? /!/ it seems within the past year or so this sub has become more of an /r/pics clone. while i don't necessarily think we should prohibit posting pictures taken with nikon bodies, it'd be nice if all \"just for show\" photos could be -----> tagged !!!  as such. this could also apply to \"help me, what is going on with my camera/lens\" posts, etc etc.", "sortedWord": "None", "identifyer": 43932, "year": "2018"}, {"Unnamed: 0": 248684, "autor": "showmak", "date": 1529891841000, "content": "Unfortunately It's time to quite. Come in and participate... /!/ Hi everyone,\n\nUnfortunately I decided to quit photography due to time restraints. It's very difficult for me to let my gears go but I need to do this as I'm also in need for the money to support my family.\n\nSo, if you were me how much would you sell each one of your equipment as listed below. The condition for each one is 99% if not 101%, all with original boxes and full accessories.\n\n1. Nikon D4S Body (original battery charger and two original battery)\n2. Nikon AF-S NIKKOR 14-24mm f/2.8G ED Lens\n3. Nikon AF-S NIKKOR 24-70mm f/2.8G ED Lens\n4. Nikon AF-S NIKKOR 70-200mm f/2.8G VR II Lens\n5. Nikon AF-S NIKKOR 28-300mm f/3.5-5.6G ED VR Lens\n6. Sigma 85mm f/1.4 DG HSM Lens\n7. Nikon SB-910 AF Speedlight\n\nPlease tag your price for each item.", "link": "https://www.reddit.com/r/Nikon/comments/8tmstt/unfortunately_its_time_to_quite_come_in_and/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "unfortunately it's time to quite. come in and participate... /!/ hi everyone,\n\nunfortunately i decided to quit photography due to time restraints. it's very difficult for me to let my gears go but i need to do this as i'm also in need for the money to support my family.\n\nso, if you were me how much would you sell each one of your equipment as listed below. the condition for each one is 99% if not 101%, all with original boxes and full accessories.\n\n1. nikon d4s body (original battery charger and two original battery)\n2. nikon af-s nikkor 14-24mm f/2.8g ed lens\n3. nikon af-s nikkor 24-70mm f/2.8g ed lens\n4. nikon af-s nikkor 70-200mm f/2.8g vr ii lens\n5. nikon af-s nikkor 28-300mm f/3.5-5.6g ed vr lens\n6. sigma 85mm f/1.4 dg hsm lens\n7. nikon sb-910 af speedlight\n\nplease -----> tag !!!  your price for each item.", "sortedWord": "None", "identifyer": 43996, "year": "2018"}, {"Unnamed: 0": 249448, "autor": "acherion", "date": 1535693444000, "content": "Please remember to tag/flair your posts!", "link": "https://www.reddit.com/r/Nikon/comments/9bqxn8/please_remember_to_tagflair_your_posts/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "please remember to -----> tag !!! /flair your posts!", "sortedWord": "None", "identifyer": 44774, "year": "2018"}, {"Unnamed: 0": 250188, "autor": "Zerubbabel83", "date": 1520040392000, "content": "Tamron 35mm 1.8 First Impression /!/ Just received this lens today from B&amp;H. And I would like to give it a first impression review. \n\n1. Tamron has stepped up their game with the packaging and feel of their lenses. Older model Tamrons have felt slightly cheaper than say Sigma or Nikon lenses, but not this new one. It feels solid and well built. You will not have to justify the $600 price tag due the look of it.\n\n2. I’ve taken about 50 photos with the lens - all outside at ~3pm and at f5.6. They are sharp. Very sharp. Sharper than I expected. Sharp at 400% zoom.\n\n3. 35mm (on a full frame) is the exact midpoint between street photography and landscape photography. It’s not as wide as you might need to take the whole scene in when you’re standing on top of a mountain, but not so narrow that you won’t need to be in the “space” of your subject to get decent detail.\n\n4. That is all.", "link": "https://www.reddit.com/r/Nikon/comments/81kzsb/tamron_35mm_18_first_impression/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "tamron 35mm 1.8 first impression /!/ just received this lens today from b&amp;h. and i would like to give it a first impression review. \n\n1. tamron has stepped up their game with the packaging and feel of their lenses. older model tamrons have felt slightly cheaper than say sigma or nikon lenses, but not this new one. it feels solid and well built. you will not have to justify the $600 price -----> tag !!!  due the look of it.\n\n2. i’ve taken about 50 photos with the lens - all outside at ~3pm and at f5.6. they are sharp. very sharp. sharper than i expected. sharp at 400% zoom.\n\n3. 35mm (on a full frame) is the exact midpoint between street photography and landscape photography. it’s not as wide as you might need to take the whole scene in when you’re standing on top of a mountain, but not so narrow that you won’t need to be in the “space” of your subject to get decent detail.\n\n4. that is all.", "sortedWord": "None", "identifyer": 45522, "year": "2018"}, {"Unnamed: 0": 250318, "autor": "acherion", "date": 1532645473000, "content": "Three new tag / filter options /!/ Hi all,\n\nI've added three new tag / filter options: \n\n* I Broke My Gear -- when you've broken your Nikon something and want an opinion on what to do next. This includes any warranty questions you might have.\n* Rumors -- speculation and rumors can be tagged with this.\n* Show &amp; Tell -- If you have just bought a new lens or camera body and you want some cheap karma, post it with this tag **and include a story**.\n\nI've added the Show and Tell flair as in the past we had some people posting up pics of their gear to show it off, some redditors didn't like this but many more did, so to appease everyone, I've added this filter. To prevent super cheap karma whoring though, you **must** include the story -- was it a bargain? What photos have you taken with it (post examples)? What do you think of the lens? etc. If you post a picture with this tag and have no story, it'll get deleted.", "link": "https://www.reddit.com/r/Nikon/comments/92729n/three_new_tag_filter_options/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "three new -----> tag !!!  / filter options /!/ hi all,\n\ni've added three new tag / filter options: \n\n* i broke my gear -- when you've broken your nikon something and want an opinion on what to do next. this includes any warranty questions you might have.\n* rumors -- speculation and rumors can be tagged with this.\n* show &amp; tell -- if you have just bought a new lens or camera body and you want some cheap karma, post it with this tag **and include a story**.\n\ni've added the show and tell flair as in the past we had some people posting up pics of their gear to show it off, some redditors didn't like this but many more did, so to appease everyone, i've added this filter. to prevent super cheap karma whoring though, you **must** include the story -- was it a bargain? what photos have you taken with it (post examples)? what do you think of the lens? etc. if you post a picture with this tag and have no story, it'll get deleted.", "sortedWord": "None", "identifyer": 45654, "year": "2018"}, {"Unnamed: 0": 251011, "autor": "razeus", "date": 1541453414000, "content": "Why aren't we seeing the kind of photography innovation from the likes of Nikon/Canon, like we are from Apple/Google? /!/ Seems like every smartphone keynote, major innovations are coming in the form of photography. \n\nWith it's Apple's \"Smart HDR\" that stacks multiple photos together or Android's Pixel front facing camera, it seems that Nikon should be doing so much more with their cameras.\n\nI'm still surprised that DSLR's released this year still don't have GPS and Wi-Fi as built-in options. There aren't \"easy modes\" for the types of things you see smartphones doing. Granted, a lot of this is better doing it the old-fashioned way, but I can see some of these features being useful for the DX style cameras. \n\nDon't even get me started on the apps. Nikon's wi-fi app for my D750 is atrocious. Granted, it works, but not what you would expect. The GPS, for whatever reason, tags my photos somewhere in the Middle East; I can't transfer multiple RAWs at a time; resize options for doing bulk transfers are seemingly too small; and the UI is just behind the times. I still don't see why I can't have the app set the time on the camera automatically, which is useful when I use geotagging apps. You should be able to set all camera settings from the app. It's almost like it's hacked together and no one at Nikon is forward-looking.\n\nClearly, the resources aren't where they need to be to continue to compete. Granted, the people buying DSLR's are a different beast than a smartphone but at these prices, there are some things current and future DSLR buyers would expect given the smartphone revolution.", "link": "https://www.reddit.com/r/Nikon/comments/9uhtl4/why_arent_we_seeing_the_kind_of_photography/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "why aren't we seeing the kind of photography innovation from the likes of nikon/canon, like we are from apple/google? /!/ seems like every smartphone keynote, major innovations are coming in the form of photography. \n\nwith it's apple's \"smart hdr\" that stacks multiple photos together or android's pixel front facing camera, it seems that nikon should be doing so much more with their cameras.\n\ni'm still surprised that dslr's released this year still don't have gps and wi-fi as built-in options. there aren't \"easy modes\" for the types of things you see smartphones doing. granted, a lot of this is better doing it the old-fashioned way, but i can see some of these features being useful for the dx style cameras. \n\ndon't even get me started on the apps. nikon's wi-fi app for my d750 is atrocious. granted, it works, but not what you would expect. the gps, for whatever reason, -----> tags !!!  my photos somewhere in the middle east; i can't transfer multiple raws at a time; resize options for doing bulk transfers are seemingly too small; and the ui is just behind the times. i still don't see why i can't have the app set the time on the camera automatically, which is useful when i use geotagging apps. you should be able to set all camera settings from the app. it's almost like it's hacked together and no one at nikon is forward-looking.\n\nclearly, the resources aren't where they need to be to continue to compete. granted, the people buying dslr's are a different beast than a smartphone but at these prices, there are some things current and future dslr buyers would expect given the smartphone revolution.", "sortedWord": "None", "identifyer": 46359, "year": "2018"}, {"Unnamed: 0": 251025, "autor": "HeyChason", "date": 1518915609000, "content": "Beginner photography questions /!/ My wife has just recently started to get into photography as a hobby and I wanted to post some of her recent questions here.\n\nIf this isn’t the place for it, please let me know and I’ll remove. Community Info page made it seem that it was ok.\n\nLittle background:\n\nShe began taking pictures about a month and a half ago using a D40 that I had purchased in college around 10 years ago. She started out using the only lens I had, which was a Nikkor 18-200mm (I think [this](https://www.amazon.com/Nikon-18-200mm-3-5-5-6G-Telephoto-DX-Format/dp/B002JCSV8A) is it for ref). Anyways, she found quickly she needed a new one, so I got her a 50mm a few weeks ago. \n\nShe’s been learning a lot about ISO, white balance, etc. by reading articles and signing up for some free classes. I also got her a reflector grey card, one of the ones that folds up. \n\nShe is interested in upgrading the camera to a D3300 or D3400 and an expo disc - the card has proven to be difficult to work with in some settings. Based on her level of skills and experience is the D3400/D3300 a good step up from the D40? Any other camera or lens you would recommend? She primarily takes photos of children or couples in outdoor settings and I think uses Lightroom for editing. \n\nRight now she is just taking photos of friends and families to learn, for no charge. Eventually I think she would like to turn it into something bigger - but she wants more time to practice before thinking about that. \n\nI don’t want this tagged as a promotional post, so I don’t want to link to any of her photos unless requested. \n\nAgain, if this isn’t the sub for this, I’ll remove it. Just looking to help my wife out with her new hobby! Thanks in advance. ", "link": "https://www.reddit.com/r/Nikon/comments/7yaxbn/beginner_photography_questions/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "beginner photography questions /!/ my wife has just recently started to get into photography as a hobby and i wanted to post some of her recent questions here.\n\nif this isn’t the place for it, please let me know and i’ll remove. community info page made it seem that it was ok.\n\nlittle background:\n\nshe began taking pictures about a month and a half ago using a d40 that i had purchased in college around 10 years ago. she started out using the only lens i had, which was a nikkor 18-200mm (i think [this](https://www.amazon.com/nikon-18-200mm-3-5-5-6g-telephoto-dx-format/dp/b002jcsv8a) is it for ref). anyways, she found quickly she needed a new one, so i got her a 50mm a few weeks ago. \n\nshe’s been learning a lot about iso, white balance, etc. by reading articles and signing up for some free classes. i also got her a reflector grey card, one of the ones that folds up. \n\nshe is interested in upgrading the camera to a d3300 or d3400 and an expo disc - the card has proven to be difficult to work with in some settings. based on her level of skills and experience is the d3400/d3300 a good step up from the d40? any other camera or lens you would recommend? she primarily takes photos of children or couples in outdoor settings and i think uses lightroom for editing. \n\nright now she is just taking photos of friends and families to learn, for no charge. eventually i think she would like to turn it into something bigger - but she wants more time to practice before thinking about that. \n\ni don’t want this -----> tagged !!!  as a promotional post, so i don’t want to link to any of her photos unless requested. \n\nagain, if this isn’t the sub for this, i’ll remove it. just looking to help my wife out with her new hobby! thanks in advance. ", "sortedWord": "None", "identifyer": 46373, "year": "2018"}, {"Unnamed: 0": 251623, "autor": "ladekjaer", "date": 1516390933000, "content": "Writing keywords to NEF-files /!/ Hi. I am a happy owner of a Nikon D3400 and am shooting i both JPEG and RAW. I have been trying to tag my photos with keywords with both Adobe Bridge and Digikam. It works well for the JPEG files, but not for the NEF files. Digikam writes the keywords to its own central database and Bridge writes an XML file for each NEF.\n\nHow do you add keywords, or other metadata, to your NEF files?", "link": "https://www.reddit.com/r/Nikon/comments/7rkx44/writing_keywords_to_neffiles/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "writing keywords to nef-files /!/ hi. i am a happy owner of a nikon d3400 and am shooting i both jpeg and raw. i have been trying to -----> tag !!!  my photos with keywords with both adobe bridge and digikam. it works well for the jpeg files, but not for the nef files. digikam writes the keywords to its own central database and bridge writes an xml file for each nef.\n\nhow do you add keywords, or other metadata, to your nef files?", "sortedWord": "None", "identifyer": 46979, "year": "2018"}, {"Unnamed: 0": 252004, "autor": "CaptainPolaroid", "date": 1538320882000, "content": "Lenses that have 'plasticity' /!/ A while ago, I bought a Sigma 24mm Super Wide II for a fiver. It was sort of an tag-on when I bought another lens, but it was interesting and too cheap to let it go. I never really used the lens until I tried selling my old camera. I did some shots with it to kinda show 'n tell, but the lens really surprised me. It sort of added an effect to the photo, giving it a certain something. Since then I have learned that this is called 'plasticity'.\n\nAfter clearing out my collection all I have left is a 24mm and a 35mm (Nikkor 35/1.8) I do all my shooting with (D7200). I must admit I am really starting to gravitate towards the 24mm because of the personality it adds to photo's.\n\nI added an example. It is rather strong in this example. The sun causes a lens flare which gives it an orange sheen. But apart from that effect it really captured the misty gradient that faded the cliffs that are further back to be softer. On my 35mm, I would have really lost that detail and give a perfect and sharp representation of reality but without the character.\n\nThis made me curious: Are there other lenses out there that add 'plasticity'? I would love to hear (and see) similar experiences!", "link": "https://www.reddit.com/r/Nikon/comments/9k74mi/lenses_that_have_plasticity/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "lenses that have 'plasticity' /!/ a while ago, i bought a sigma 24mm super wide ii for a fiver. it was sort of an -----> tag !!! -on when i bought another lens, but it was interesting and too cheap to let it go. i never really used the lens until i tried selling my old camera. i did some shots with it to kinda show 'n tell, but the lens really surprised me. it sort of added an effect to the photo, giving it a certain something. since then i have learned that this is called 'plasticity'.\n\nafter clearing out my collection all i have left is a 24mm and a 35mm (nikkor 35/1.8) i do all my shooting with (d7200). i must admit i am really starting to gravitate towards the 24mm because of the personality it adds to photo's.\n\ni added an example. it is rather strong in this example. the sun causes a lens flare which gives it an orange sheen. but apart from that effect it really captured the misty gradient that faded the cliffs that are further back to be softer. on my 35mm, i would have really lost that detail and give a perfect and sharp representation of reality but without the character.\n\nthis made me curious: are there other lenses out there that add 'plasticity'? i would love to hear (and see) similar experiences!", "sortedWord": "None", "identifyer": 47362, "year": "2018"}], "name": "tagnikon2018"}