{"interestingcomments": [{"autor": "OGBobaFett", "date": "2019-08-03 01:50:31", "content": "I’m creating an Instagram engagement group for Fujifilm Photographers/Enthusiasts /!/ If you’d like to join, comment below with your Instagram username and I will add you! The goal is to generate organic engagement with posts. As a small content creator it can be very hard to get your posts to show with Instagram’s new algorithms. Plus this is a great way to interact with other Fuji photographers!\n\nWe are a smaller group than Nikon, Sony, or Canon but we can unite!", "link": "https://www.reddit.com/r/fujifilm/comments/cld3uv/im_creating_an_instagram_engagement_group_for/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’m creating", "selectorShort": "create", "MarkedSent": "-----> i !!! ’m -----> creating !!!  an instagram engagement group for fujifilm photographers/enthusiasts /!/ if you’d like to join, comment below with your instagram username and i will add you! the goal is to generate organic engagement with posts. as a small content creator it can be very hard to get your posts to show with instagram’s new algorithms. plus this is a great way to interact with other fuji photographers!\n\nwe are a smaller group than nikon, sony, or canon but we can unite!", "sortedWord": "None", "Identifyer": null, "identifyer": 23504, "year": "2019"}, {"autor": "calerouxz", "date": "2019-06-05 13:52:10", "content": "Help me decide on an ultrawide prime! /!/ I've just recently (actually don't even have it on my hands yet) purchased a new X-Pro2 with the 23mm f/2 lens, but I do generally like ultrawide lenses, I used a Canon 5D mark II with the 17-40mm f/4L a lot. I decided on creating a prime only kit for the X-Pro2, as the point is mostly to cut down on weight and size while maximizing image quality, that's why I won't be thinking of the XF 10-24mm f/4. Here are my choices:\n\n* **Fujifilm XF 14mm f/2.8 R:** This seems like the optically better lens out of the bunch, but I'm not sure if I will be happy with the narrower field of view of the equivalent to 21mm focal length, but I also assume it will be easier to stitch panoramas with it.\n* **Zeiss Touit 12mm f/2.8:** This lens seems great as far as specs go, it seems to not be as sharp as the other two, but still pretty good. It's got a field of view that I like better than the 14mm. After searching for images made with this lens, I don't find all that many and am not particularly impressed with them, but maybe that's due to a lower adoption rate because of it's higher price tag to the other two.\n* **Samyang 12mm f/2 NCS CS:** Apparently this is sharper than the Zeiss, with the same field of view, and also much cheaper. Things I dislike about it are the fact that there's no communication to the camera (so no EXIF data), no autofocus (given the focal length, this is probably not an issue anyways), but I'm much more worried about lateral chromatic aberration, which is according to lens tip the higher of the three and also the 5 apperture blades in this lens produced rather bad looking sun stars which I'm not a fan of. On the other hand, the images I've seen created with this lens look great.\n\nI'm particularly interested in the Zeiss lens, but am rather skeptical due to the fact that I'm not all that impressed by the images I've seen created with this lens. It's also the most expensive one.", "link": "https://www.reddit.com/r/fujifilm/comments/bx2svq/help_me_decide_on_an_ultrawide_prime/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've seen created", "selectorShort": "create", "MarkedSent": "help me decide on an ultrawide prime! /!/ i've just recently (actually don't even have it on my hands yet) purchased a new x-pro2 with the 23mm f/2 lens, but i do generally like ultrawide lenses, i used a canon 5d mark ii with the 17-40mm f/4l a lot. i decided on creating a prime only kit for the x-pro2, as the point is mostly to cut down on weight and size while maximizing image quality, that's why i won't be thinking of the xf 10-24mm f/4. here are my choices:\n\n* **fujifilm xf 14mm f/2.8 r:** this seems like the optically better lens out of the bunch, but i'm not sure if i will be happy with the narrower field of view of the equivalent to 21mm focal length, but i also assume it will be easier to stitch panoramas with it.\n* **zeiss touit 12mm f/2.8:** this lens seems great as far as specs go, it seems to not be as sharp as the other two, but still pretty good. it's got a field of view that i like better than the 14mm. after searching for images made with this lens, i don't find all that many and am not particularly impressed with them, but maybe that's due to a lower adoption rate because of it's higher price tag to the other two.\n* **samyang 12mm f/2 ncs cs:** apparently this is sharper than the zeiss, with the same field of view, and also much cheaper. things i dislike about it are the fact that there's no communication to the camera (so no exif data), no autofocus (given the focal length, this is probably not an issue anyways), but i'm much more worried about lateral chromatic aberration, which is according to lens tip the higher of the three and also the 5 apperture blades in this lens produced rather bad looking sun stars which i'm not a fan of. on the other hand, the images -----> i !!! 've -----> seen !!!  -----> created !!!  with this lens look great.\n\ni'm particularly interested in the zeiss lens, but am rather skeptical due to the fact that i'm not all that impressed by the images i've seen created with this lens. it's also the most expensive one.", "sortedWord": "None", "Identifyer": null, "identifyer": 24003, "year": "2019"}, {"autor": "shacerez", "date": "2019-06-02 14:54:10", "content": "Hi, just wondering. Is it legal if I create a page wherein I collect certain Fujifilm photos using X-T100? Of course I will give credit to the owner. I’m new to this curation thingy.", "link": "https://www.reddit.com/r/fujifilm/comments/bvy5im/hi_just_wondering_is_it_legal_if_i_create_a_page/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "hi, just wondering. is it legal if -----> i !!!  -----> create !!!  a page wherein -----> i !!!  collect certain fujifilm photos using x-t100? of course i will give credit to the owner. i’m new to this curation thingy.", "sortedWord": "None", "Identifyer": null, "identifyer": 25551, "year": "2019"}, {"autor": "IBurnInTheSun", "date": "2019-01-16 14:48:09", "content": "Moving to Fuji Ecosystem - more questions! /!/ Last week I created a post on whether the X-T2 would be a good choice for me. This can be found [here](https://www.reddit.com/r/fujifilm/comments/aeil74/is_the_xt2_for_me/). I'm 100% going to make the move to Fuji from my Canon 7Dmkii setup. \n\nI am slightly tempted to go for the X-T3 in order to be more up to date... still deciding on this. Do you reckon I spend that extra bit of cash?\n\nLens choice is what I'm having an issue with. Fuji seems to have so many fantastic lenses I just don't know what to go for. If you haven't read my previous post, I plan to shoot static cars and travel. \n\nThe lens I have at the top of the list is the Fuji 23mm F2 WR. Being lightweight, low profile and weather resistant I feel this lens might be the best choice for me to start with. It will allow me to go back to the basics and think more about my shots, rather than being lazy and just moving the focal distance.\n\nFor a lens to start off with, are there any better options? \n\n&amp;#x200B;\n\nI'm only picking one lens to start with, so what do you reckon? \n\n&amp;#x200B;\n\nThanks in advance!!", "link": "https://www.reddit.com/r/fujifilm/comments/agltq9/moving_to_fuji_ecosystem_more_questions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "moving to fuji ecosystem - more questions! /!/ last week -----> i !!!  -----> created !!!  a post on whether the x-t2 would be a good choice for me. this can be found [here](https://www.reddit.com/r/fujifilm/comments/aeil74/is_the_xt2_for_me/). i'm 100% going to make the move to fuji from my canon 7dmkii setup. \n\ni am slightly tempted to go for the x-t3 in order to be more up to date... still deciding on this. do you reckon i spend that extra bit of cash?\n\nlens choice is what i'm having an issue with. fuji seems to have so many fantastic lenses i just don't know what to go for. if you haven't read my previous post, i plan to shoot static cars and travel. \n\nthe lens i have at the top of the list is the fuji 23mm f2 wr. being lightweight, low profile and weather resistant i feel this lens might be the best choice for me to start with. it will allow me to go back to the basics and think more about my shots, rather than being lazy and just moving the focal distance.\n\nfor a lens to start off with, are there any better options? \n\n&amp;#x200b;\n\ni'm only picking one lens to start with, so what do you reckon? \n\n&amp;#x200b;\n\nthanks in advance!!", "sortedWord": "None", "Identifyer": null, "identifyer": 26070, "year": "2019"}, {"autor": "reanimation815", "date": "2019-12-13 16:39:34", "content": "Searching for some feedback on Fujifilm's Camera Remote application /!/ Hi guys, I'm a UX Designer attempting to put together a case study for Fujifilm's Camera Remote smartphone application.  I've created a short ten question survey to gather some opinions and understanding of the app. If you could submit your thoughts, I would really appreciate it [Fujifilm Camera Remote Survey](https://forms.gle/WfmcQRCwiF359Zzs6). \n\nWould love to hear some feedback on reddit as well if possible, what are user's thoughts on the application? Have you used anything similar before from another brand (I haven't)?\n\nAlso if there is any other Fujifilm/UX enthusiasts out there, please help me with this one. \n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/ea6bgg/searching_for_some_feedback_on_fujifilms_camera/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "searching for some feedback on fujifilm's camera remote application /!/ hi guys, i'm a ux designer attempting to put together a case study for fujifilm's camera remote smartphone application.  -----> i !!! 've -----> created !!!  a short ten question survey to gather some opinions and understanding of the app. if you could submit your thoughts, i would really appreciate it [fujifilm camera remote survey](https://forms.gle/wfmcqrcwif359zzs6). \n\nwould love to hear some feedback on reddit as well if possible, what are user's thoughts on the application? have you used anything similar before from another brand (i haven't)?\n\nalso if there is any other fujifilm/ux enthusiasts out there, please help me with this one. \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 27996, "year": "2019"}, {"autor": "SF-35mm", "date": "2019-11-27 02:02:03", "content": "I recently created a new subreddit for folks to post analog photographs taken in the Bay Area. Check out r/SanFranciscoAnalog if that’s your thing.", "link": "https://www.reddit.com/r/fujifilm/comments/e28spq/i_recently_created_a_new_subreddit_for_folks_to/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> recently !!!  -----> created !!!  a new subreddit for folks to post analog photographs taken in the bay area. check out r/sanfranciscoanalog if that’s your thing.", "sortedWord": "None", "Identifyer": null, "identifyer": 28201, "year": "2019"}], "name": "createfujifilm2019"}