{"interestingcomments": [{"autor": "B0kah", "date": "2018-03-18 06:45:47", "content": "This Instagram is off to a good start! I created this page to feature fuji only photographers, no theme necessarily, just find me and tag me in your photos and I’ll feature them in the Instagram! (I’ll usually repost 4 or 5 photos a day :) see you in there!", "link": "https://www.reddit.com/r/fujifilm/comments/859r55/this_instagram_is_off_to_a_good_start_i_created/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "this instagram is off to a good start! -----> i !!!  -----> created !!!  this page to feature fuji only photographers, no theme necessarily, just find me and tag me in your photos and -----> i !!! ’ll feature them in the instagram! (i’ll usually repost 4 or 5 photos a day :) see you in there!", "sortedWord": "None", "Identifyer": null, "identifyer": 495, "year": "2018"}, {"autor": "EyeDrawYourPost", "date": "2018-07-04 16:48:12", "content": "Fujifilm F-Log LUT Packs Ideas Wanted /!/ Hi guys. I am a LUT creator and videographer who recently moved from Panasonic &amp; Sony to Fuji (specifically an X-T2) and absolutely LOVE it. Created LUTs for Panasonic systems and Sony previously with great success.  \nWould be really interested in creating some LUTs for the system and would like your thoughts or opinions on what we as a community would use / need for cinematography / photography.  \nFeel free to leave thoughts below or even examples of styles you'd like replicated.", "link": "https://www.reddit.com/r/fujifilm/comments/8w333h/fujifilm_flog_lut_packs_ideas_wanted/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "fujifilm f-log lut packs ideas wanted /!/ hi guys. i am a lut creator and videographer who recently moved from panasonic &amp; sony to fuji (specifically an x-t2) and absolutely love it. -----> created !!!  luts for panasonic systems and sony previously with great success.  \nwould be really interested in creating some luts for the system and would like your thoughts or opinions on what we as a community would use / need for cinematography / photography.  \nfeel free to leave thoughts below or even examples of styles you'd like replicated.", "sortedWord": "None", "Identifyer": null, "identifyer": 852, "year": "2018"}], "name": "createfujifilm2018"}