{"interestingcomments": [{"autor": "boytanical", "date": "2020-03-11 04:44:50", "content": "Instagram Handles Anyone? /!/ Hey!  I recently created an instagram account that my partner and I use for posting our pictures.  We use an XT3 and an X100F.  Any Fujifilm users interested in sharing their handles?  Let's be friends!  :)  ours is @ fujigays", "link": "https://www.reddit.com/r/fujifilm/comments/fgrpan/instagram_handles_anyone/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "instagram handles anyone? /!/ hey!  -----> i !!!  -----> recently !!!  -----> created !!!  an instagram account that my partner and -----> i !!!  use for posting our pictures.  we use an xt3 and an x100f.  any fujifilm users interested in sharing their handles?  let's be friends!  :)  ours is @ fujigays", "sortedWord": "None", "Identifyer": null, "identifyer": 57178, "year": "2020"}, {"autor": "sourovdebmishu", "date": "2020-05-25 11:52:20", "content": "Any professional Silkypix user here? Looking for tutorials. /!/ I have tried capture pro, Dxo photolab, on1 photo raw for one month each for 3 months. \nWith each software, I have retouched about 2000 raw images from Fuji xt20, dng from my smartphone and raw files from Panasonic DMZ Bridge. I have created Color and BW images, panorama of available, and HDR.p \nOn1 raw had hopes. But it's so slow to load images. Dxo photolab was not bad. Specially it had awesome user interface and noise reduction in phenomenal. But doesn't support Fuji or Pentax (not that I have).\nCapture was was in another league. The speed is unbeaten. Excellent for  productivity. \nI almost baught it. \nThen I have heard of Silkypix which I had installed but never used it. \nSo, just before I was about to take my wallet out for Capture One I gave silkypix a go. \nSo, I have edited about another 2000 images with files from Fuji RAF, Panasonic raw and dng from my smartphone.\nOne word. Color. It doesn't possess the speed of capture one or dxo. Local adjustment was not bad. \nBut, to recover highlights, NR it is as good as others if not better. Sharpness is not bad either. On top, \nSilkypix could produce literally exact same colors as jpegs with better details. And just because of that, I am sold. Plus it has different stacking options. The sliders are not to aggressive. I find it enough to professional work. If I really need to push the boundaries and need some more specific work then I use Affinity Photo.\nTheir manual is very well explained. Everything is pretty straightforward. Less is more\n So, I like it. \n I repeat, Capture is in another league when it comes to speed and retouching options. Even the free version is pretty awesome. But silkypix developer is fantastic for it's color rendition. It made me feel same way I felt with Fuji ergonomics and canon colors. It supports every camera brands and lens. They even make softwares for nikon, Fuji, Olympic and Panasonic and more. They work directly with the camera manufacturers.\nOnly one problem though, there aren't many tutorials available just in case if I find something specific. \nIs there anyone else out there who are also using Silkypix+Affinity Photo (Photoshop) combo? What is your workflow? Is there any in depth tutorials on the internet? \nWhat is your thoughts in general on this software if you ever have used it?", "link": "https://www.reddit.com/r/fujifilm/comments/gq9o63/any_professional_silkypix_user_here_looking_for/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "any professional silkypix user here? looking for tutorials. /!/ i have tried capture pro, dxo photolab, on1 photo raw for one month each for 3 months. \nwith each software, i have retouched about 2000 raw images from fuji xt20, dng from my smartphone and raw files from panasonic dmz bridge. -----> i !!!  -----> have !!!  -----> created !!!  color and bw images, panorama of available, and hdr.p \non1 raw had hopes. but it's so slow to load images. dxo photolab was not bad. specially it had awesome user interface and noise reduction in phenomenal. but doesn't support fuji or pentax (not that i have).\ncapture was was in another league. the speed is unbeaten. excellent for  productivity. \ni almost baught it. \nthen i have heard of silkypix which i had installed but never used it. \nso, just before i was about to take my wallet out for capture one i gave silkypix a go. \nso, i have edited about another 2000 images with files from fuji raf, panasonic raw and dng from my smartphone.\none word. color. it doesn't possess the speed of capture one or dxo. local adjustment was not bad. \nbut, to recover highlights, nr it is as good as others if not better. sharpness is not bad either. on top, \nsilkypix could produce literally exact same colors as jpegs with better details. and just because of that, i am sold. plus it has different stacking options. the sliders are not to aggressive. i find it enough to professional work. if i really need to push the boundaries and need some more specific work then i use affinity photo.\ntheir manual is very well explained. everything is pretty straightforward. less is more\n so, i like it. \n i repeat, capture is in another league when it comes to speed and retouching options. even the free version is pretty awesome. but silkypix developer is fantastic for it's color rendition. it made me feel same way i felt with fuji ergonomics and canon colors. it supports every camera brands and lens. they even make softwares for nikon, fuji, olympic and panasonic and more. they work directly with the camera manufacturers.\nonly one problem though, there aren't many tutorials available just in case if i find something specific. \nis there anyone else out there who are also using silkypix+affinity photo (photoshop) combo? what is your workflow? is there any in depth tutorials on the internet? \nwhat is your thoughts in general on this software if you ever have used it?", "sortedWord": "None", "Identifyer": null, "identifyer": 57291, "year": "2020"}, {"autor": "35mm-dreams-", "date": "2020-04-13 04:57:44", "content": "Zine/book of photos ? /!/ I haven’t printed any of my images so far and among the 16-20 images I’ve captured so far during this period of uncertainty. I plan to create either a Zine or a hardcover book of photos. Need advice how to go about either. \n\nI have no experience whatsoever. Googling has given me more answers than I need. I’m figuring that a small photobook like the ones made by Blurb probably are the way to go because of colour and image reproduction. I’m open to suggestions. Thank you.", "link": "https://www.reddit.com/r/fujifilm/comments/g0cabr/zinebook_of_photos/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i plan to create", "selectorShort": "create", "MarkedSent": "zine/book of photos ? /!/ i haven’t printed any of my images so far and among the 16-20 images i’ve captured so far during this period of uncertainty. -----> i !!!  -----> plan !!!  -----> to !!!  -----> create !!!  either a zine or a hardcover book of photos. need advice how to go about either. \n\ni have no experience whatsoever. googling has given me more answers than i need. i’m figuring that a small photobook like the ones made by blurb probably are the way to go because of colour and image reproduction. i’m open to suggestions. thank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 58037, "year": "2020"}, {"autor": "SideshowBoB44", "date": "2020-08-26 08:53:43", "content": "Creating custom JPEG profiles C1-C7 question (new user) /!/ Why is it that when i edit for example C1, it then creates a duplicate called Base C1 with the same settings? \n\nAre C1-C7 just used to create Base C1-C7?", "link": "https://www.reddit.com/r/fujifilm/comments/igvdhu/creating_custom_jpeg_profiles_c1c7_question_new/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  custom jpeg profiles c1-c7 question (new user) /!/ why is it that when i edit for example c1, it then creates a duplicate called base c1 with the same settings? \n\nare c1-c7 just used to create base c1-c7?", "sortedWord": "None", "Identifyer": null, "identifyer": 62581, "year": "2020"}, {"autor": "EraserheadAux", "date": "2020-08-16 03:36:40", "content": "Creating Ripples...Shot with X-100V...", "link": "https://www.reddit.com/r/fujifilm/comments/ialjtx/creating_ripplesshot_with_x100v/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  ripples...shot with x-100v...", "sortedWord": "None", "Identifyer": null, "identifyer": 66674, "year": "2020"}], "name": "createfujifilm2020"}