{"interestingcomments": [{"autor": "SemperScrotus", "date": "2018-10-28 09:37:56", "content": "Upgrading the Canon T3i /!/ Hello, folks! I apologize in advance for the wall of text. 😂\n\n&amp;#x200B;\n\nSo I've been using my trusty ol' Canon Rebel T3i now for years. For most of that time, I was never super into photography honestly; I used it mostly just to take pictures of the wife and dogs and travel shots. Nothing too serious and never much editing. The only lenses I've got are the EFS 18-55/3.5-56 IS, the EFS 18-200/3.5-5.6 IS, and the 50mm 1.8.\n\n \n\nWell recently I've developed a photography itch that needs scratching, thanks in large part to a couple of friends of mine who are serious hobbyists. I want to get more serious, and after a ton of research and reading articles and watching videos and talking with my photographer friends I think it's time to take the plunge into the world of full-frame mirrorless. I'm looking for some input from people who know better than I do about this stuff and maybe who have found themselves in a similar situation in the past.\n\n&amp;#x200B;\n\nThe kind of shooting I plan on doing is mostly photography; videography and YouTube content creation or whatever just isn't what I'm going for. I want to do street photography (especially night-time stuff), travel photography to include landscape stuff, and portrait photography. I'm a helicopter pilot in the Marine Corps, and it would be nice to get some great shots of the aircraft in action as well as the Marines hard at work maintaining them.\n\n&amp;#x200B;\n\nAfter an obscene amount of research, I thought I had narrowed it down to the Sony A6500.  But then I started reading all about the XT-3, and maybe it would be a better fit for me.  In fact, the only real drawback that I can tell is the lack of IBIS and the effect that may have on low-light stills.  Then again, how important is that really considering the newer backlit sensor and its (likely) better low-light performance than the A6500's older sensor?\n\n&amp;#x200B;\n\nAs for lenses, I was thinking of perhaps foregoing the kit lens altogether and just getting a few good fast primes: the 23mm F/2 for street stuff and general walkaround (I think I really prefer wider angles) and the 35mm F/1.4 for portraiture and sweet, sweet BOKEHHHHHHH!!  Though a 50mm may be more appropriate for portraiture, the Fuji doesn't have anything faster than a 50 F/2 unless you want to pay nearly a grand for a 56 F/1.2!  \n\n&amp;#x200B;\n\nAnyway, what do you folks think? Am I on the right path here? Overthinking things? Biting off more than I can chew? What would you do in my shoes?  🤔", "link": "https://www.reddit.com/r/fujifilm/comments/9s20sx/upgrading_the_canon_t3i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "upgrading the canon t3i /!/ hello, folks! i apologize in advance for the wall of text. 😂\n\n&amp;#x200b;\n\nso i've been using my trusty ol' canon rebel t3i now for years. for most of that time, i was never super into photography honestly; i used it mostly just to take pictures of the wife and dogs and travel shots. nothing too serious and never much editing. the only lenses i've got are the efs 18-55/3.5-56 is, the efs 18-200/3.5-5.6 is, and the 50mm 1.8.\n\n \n\nwell recently -----> i !!! 've -----> developed !!!  a photography itch that needs scratching, thanks in large part to a couple of friends of mine who are serious hobbyists. i want to get more serious, and after a ton of research and reading articles and watching videos and talking with my photographer friends i think it's time to take the plunge into the world of full-frame mirrorless. i'm looking for some input from people who know better than i do about this stuff and maybe who have found themselves in a similar situation in the past.\n\n&amp;#x200b;\n\nthe kind of shooting i plan on doing is mostly photography; videography and youtube content creation or whatever just isn't what i'm going for. i want to do street photography (especially night-time stuff), travel photography to include landscape stuff, and portrait photography. i'm a helicopter pilot in the marine corps, and it would be nice to get some great shots of the aircraft in action as well as the marines hard at work maintaining them.\n\n&amp;#x200b;\n\nafter an obscene amount of research, i thought i had narrowed it down to the sony a6500.  but then i started reading all about the xt-3, and maybe it would be a better fit for me.  in fact, the only real drawback that i can tell is the lack of ibis and the effect that may have on low-light stills.  then again, how important is that really considering the newer backlit sensor and its (likely) better low-light performance than the a6500's older sensor?\n\n&amp;#x200b;\n\nas for lenses, i was thinking of perhaps foregoing the kit lens altogether and just getting a few good fast primes: the 23mm f/2 for street stuff and general walkaround (i think i really prefer wider angles) and the 35mm f/1.4 for portraiture and sweet, sweet bokehhhhhhh!!  though a 50mm may be more appropriate for portraiture, the fuji doesn't have anything faster than a 50 f/2 unless you want to pay nearly a grand for a 56 f/1.2!  \n\n&amp;#x200b;\n\nanyway, what do you folks think? am i on the right path here? overthinking things? biting off more than i can chew? what would you do in my shoes?  🤔", "sortedWord": "None", "Identifyer": null, "identifyer": 1247, "year": "2018"}], "name": "developfujifilm2018"}