{"interestingcomments": [{"autor": "NorbertTheTurtle", "date": "2020-02-12 04:15:12", "content": "Next lens purchase? Seeking advice from the old heads. /!/ Hey folks. I’m a new Fuji boy; just got my X-T1 about a month ago. I’ve been shooting with the 35 f/2, but it’s time to broaden my horizons...and focal length. \n\nI’m looking to go a bit wider, so I am looking toward my next lens purchase. I’m considering either the 23mm f/1.4 or the f/2. Also considering the 18-55mm since it’s so cheap and zoom lenses are so practical. \n\nMy long-term goal is to completely switch from Nikon to Fuji. I use Nikon for work right now and Fuji for fun, but once I’ve developed a sufficient Fuji kit, I’ll buy a newer body and migrate over completely. With that in mind, I’d like my next lens purchase to be a permanent member of my future kit. \n\nWeather sealing isn’t super important to me. Autofocus speed isn’t super important to me. The 16mm 1.4 is a bit too wide for me right now. \n\nLet me know which of the three lenses you prefer! If you have any alternative suggestions, I’d be glad to hear them.", "link": "https://www.reddit.com/r/fujifilm/comments/f2lc10/next_lens_purchase_seeking_advice_from_the_old/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve developed", "selectorShort": "develop", "MarkedSent": "next lens purchase? seeking advice from the old heads. /!/ hey folks. i’m a new fuji boy; just got my x-t1 about a month ago. i’ve been shooting with the 35 f/2, but it’s time to broaden my horizons...and focal length. \n\ni’m looking to go a bit wider, so i am looking toward my next lens purchase. i’m considering either the 23mm f/1.4 or the f/2. also considering the 18-55mm since it’s so cheap and zoom lenses are so practical. \n\nmy long-term goal is to completely switch from nikon to fuji. -----> i !!!  use nikon for work right now and fuji for fun, but once -----> i !!! ’ve -----> developed !!!  a sufficient fuji kit, -----> i !!! ’ll buy a newer body and migrate over completely. with that in mind, i’d like my next lens purchase to be a permanent member of my future kit. \n\nweather sealing isn’t super important to me. autofocus speed isn’t super important to me. the 16mm 1.4 is a bit too wide for me right now. \n\nlet me know which of the three lenses you prefer! if you have any alternative suggestions, i’d be glad to hear them.", "sortedWord": "None", "Identifyer": null, "identifyer": 61306, "year": "2020"}], "name": "developfujifilm2020"}