{"interestingcomments": [{"autor": "grygrx", "date": "2019-07-29 14:57:55", "content": "[Advice] Help with my dive back into Fuji. X-T30 /!/ I previously owned a x100 series camera for a few years and used it a ton.  Size and general picture quality, and quality of carry were amazing.  It was great for light traveling and street, but quirky for some which it was otherwise well suited (lowlight DIY concerts).  Sold it awhile back to fund other things and still miss it all the time.   Wanting to dive back into the Fuji realm and after quite a bit of research I've targeted the X-T30 with a couple of nice prime lens to start with. \n\n* FujiFilm X-T30\n* Fujinon XF27mm F2.8 (pancake) - Super low profile for street / jacket travel\n* Fujinon XF56mm F1.2 R (prime) - Low light, 'serious' looking but not overwhelming.\n\n\nI'd love some holes poked in my idea, best places to shop, or coupons or whatever.\n\n[cart image:](https://imgur.com/a/C6Vntre )", "link": "https://www.reddit.com/r/fujifilm/comments/cjcckb/advice_help_with_my_dive_back_into_fuji_xt30/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[advice] help with my dive back into fuji. x-t30 /!/ i previously owned a x100 series camera for a few years and used it a ton.  size and general picture quality, and quality of carry were amazing.  it was great for light traveling and street, but quirky for some which it was otherwise well suited (lowlight -----> diy !!!  concerts).  sold it awhile back to fund other things and still miss it all the time.   wanting to dive back into the fuji realm and after quite a bit of research i've targeted the x-t30 with a couple of nice prime lens to start with. \n\n* fujifilm x-t30\n* fujinon xf27mm f2.8 (pancake) - super low profile for street / jacket travel\n* fujinon xf56mm f1.2 r (prime) - low light, 'serious' looking but not overwhelming.\n\n\ni'd love some holes poked in my idea, best places to shop, or coupons or whatever.\n\n[cart image:](https://imgur.com/a/c6vntre )", "sortedWord": "None", "Identifyer": null, "identifyer": 24293, "year": "2019"}, {"autor": "coolal88", "date": "2019-02-03 20:30:07", "content": "Stacked lens macro /!/ Like many, I've been wanting to try macro but struggle with the high price point of all dedicated macro lenses. I came across a cool [youtube](https://youtu.be/PW-44IKD8l0) showing a very cheap macro DIY setup, but was disappointed to find that the gear used wasn't compatible with Fuji. \n\nPlaying around with the same idea of using multiple lenses, I found that you could get a pretty good result by simply holding two lenses on top of each other, without any need for special equipment. \n\nThis [stacked lens album](https://imgur.com/a/M4fdk7S) shows some examples of stacking a 50mmF2 on top of a 23mmF2. This was done by simply holding the 50mm (not reversed) in front of the 23mmF2. I tried many combinations and while I still need to experiment more, here's some of my initial takeaways for those interested:\n\n* This works way better than reversing a single lens. Example in the album. Images were sharper and easier to focus, and obviously more magnified. \n* Reversing the 2nd lens didn't change much. I was surprised by this, maybe I was doing something wrong? I also had a perfect fit using the 23mm hood against the 50mm mount ring which made the setup fairly steady. See the first image for a better idea of what I'm talking about. \n* F stop didn't make much of a difference. When I stopped down on the 23mm, the background became clearer as expected, but it was a long ways from being in focus. The true focus plane never really increased. Speaking of focus plane...\n* There is a razor thin focus plane : ( and I had to move my body to get there. Focusing the lens did nothing from what I could tell. I just kept both to min focus distance and moved the camera physically. This is where a true macro lens would be awesome. \n* You have to get SUPER close. I couldn't shoot some objects because the shape meant I'd inadvertently bump the subject and front lens element. Also lighting became tricky. I used a flash and a light box for all my shots. \n\nTLDR: Using two Fuji lenses stacked on top of each other works pretty well for those wanting to experiment with macro without committing big bucks for a dedicated macro lens. [Album](https://imgur.com/a/M4fdk7S)", "link": "https://www.reddit.com/r/fujifilm/comments/amtmz6/stacked_lens_macro/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "stacked lens macro /!/ like many, i've been wanting to try macro but struggle with the high price point of all dedicated macro lenses. i came across a cool [youtube](https://youtu.be/pw-44ikd8l0) showing a very cheap macro -----> diy !!!  setup, but was disappointed to find that the gear used wasn't compatible with fuji. \n\nplaying around with the same idea of using multiple lenses, i found that you could get a pretty good result by simply holding two lenses on top of each other, without any need for special equipment. \n\nthis [stacked lens album](https://imgur.com/a/m4fdk7s) shows some examples of stacking a 50mmf2 on top of a 23mmf2. this was done by simply holding the 50mm (not reversed) in front of the 23mmf2. i tried many combinations and while i still need to experiment more, here's some of my initial takeaways for those interested:\n\n* this works way better than reversing a single lens. example in the album. images were sharper and easier to focus, and obviously more magnified. \n* reversing the 2nd lens didn't change much. i was surprised by this, maybe i was doing something wrong? i also had a perfect fit using the 23mm hood against the 50mm mount ring which made the setup fairly steady. see the first image for a better idea of what i'm talking about. \n* f stop didn't make much of a difference. when i stopped down on the 23mm, the background became clearer as expected, but it was a long ways from being in focus. the true focus plane never really increased. speaking of focus plane...\n* there is a razor thin focus plane : ( and i had to move my body to get there. focusing the lens did nothing from what i could tell. i just kept both to min focus distance and moved the camera physically. this is where a true macro lens would be awesome. \n* you have to get super close. i couldn't shoot some objects because the shape meant i'd inadvertently bump the subject and front lens element. also lighting became tricky. i used a flash and a light box for all my shots. \n\ntldr: using two fuji lenses stacked on top of each other works pretty well for those wanting to experiment with macro without committing big bucks for a dedicated macro lens. [album](https://imgur.com/a/m4fdk7s)", "sortedWord": "None", "Identifyer": null, "identifyer": 24460, "year": "2019"}], "name": "diyfujifilm2019"}