{"interestingcomments": [{"autor": "GandhiBob", "date": "2018-05-22 13:51:35", "content": "X-T10 capacitor repair /!/ My trusty X-T10 was dropped onto a stone surface. Luckily it landed on an L-bracket I've mounted, so no external damage.\n\nUnfortunately it does seem to have affected the internals. Upon turning off the camera, all settings are lost. Even with a fully charged (original) battery inserted. I also seem to be unable to set the date - I can choose date and time, but it immediately reverts to January 1st 2000. Even if I don't turn it off. Google tells me that the capacitor is busted or disconnected.\n\nMy question is: How screwed am I in terms of repair cost? \n\nThe body is out of warranty... And I live in Denmark which, if you know about the place, can be a challenge when you need repairs or parts at a reasonable price.\n\nOr maybe I'm lucky enough that someone knows a diy solution to the issue?", "link": "https://www.reddit.com/r/fujifilm/comments/8la4qm/xt10_capacitor_repair/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "x-t10 capacitor repair /!/ my trusty x-t10 was dropped onto a stone surface. luckily it landed on an l-bracket i've mounted, so no external damage.\n\nunfortunately it does seem to have affected the internals. upon turning off the camera, all settings are lost. even with a fully charged (original) battery inserted. i also seem to be unable to set the date - i can choose date and time, but it immediately reverts to january 1st 2000. even if i don't turn it off. google tells me that the capacitor is busted or disconnected.\n\nmy question is: how screwed am i in terms of repair cost? \n\nthe body is out of warranty... and i live in denmark which, if you know about the place, can be a challenge when you need repairs or parts at a reasonable price.\n\nor maybe i'm lucky enough that someone knows a -----> diy !!!  solution to the issue?", "sortedWord": "None", "Identifyer": null, "identifyer": 13, "year": "2018"}], "name": "diyfujifilm2018"}