{"interestingcomments": [{"autor": "np2fast", "date": "2020-08-05 05:51:44", "content": "Where to go from here? Improving my photography. /!/ Hey photogs, \n\nLike many, I am currently in a photography funk. No quite sure where to go from here. \n\nAbout me:  \nBeen shooting for the last 5-7 years. Have greatly improved over this time but have hit a stagnant bit. Have been mostly shooting with an Olympus OMD em10 mark 1 and 2; love them but not sure if it's time to move on? Will changing cameras help my photography?\n\nIf not that, should I be working on my composition? Should I be relearning editing?\n\n[My IG for some reference.](https://www.instagram.com/tallcupofchocolatemilk/)\n\nLove shooting, just looking for some insight on what else I can do to progress from here. \n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/i3zt1o/where_to_go_from_here_improving_my_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "where to go from here? -----> improving !!!  my photography. /!/ hey photogs, \n\nlike many, i am currently in a photography funk. no quite sure where to go from here. \n\nabout me:  \nbeen shooting for the last 5-7 years. have greatly improved over this time but have hit a stagnant bit. have been mostly shooting with an olympus omd em10 mark 1 and 2; love them but not sure if it's time to move on? will changing cameras help my photography?\n\nif not that, should i be working on my composition? should i be relearning editing?\n\n[my ig for some reference.](https://www.instagram.com/tallcupofchocolatemilk/)\n\nlove shooting, just looking for some insight on what else i can do to progress from here. \n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 59691, "year": "2020"}, {"autor": "OGB234", "date": "2020-01-09 01:10:04", "content": "Improve Photography! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/em27s1/improve_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  photography! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 62920, "year": "2020"}, {"autor": "OGB234", "date": "2020-01-08 23:14:47", "content": "Improve Photography! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/em0p6j/improve_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  photography! /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 62929, "year": "2020"}, {"autor": "UnitAppropriate", "date": "2020-12-14 19:20:19", "content": "Improving portraits by adding light after a picture was taken", "link": "https://www.reddit.com/r/photography/comments/kd4c3z/improving_portraits_by_adding_light_after_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  portraits by adding light after a picture was taken", "sortedWord": "None", "Identifyer": null, "identifyer": 72917, "year": "2020"}, {"autor": "davidcorkill", "date": "2020-10-27 10:05:13", "content": "Improving Water Sports photography and light reflection /!/ Hi Photography, \n\nI am an avid windsurfer and also a keen amateur photographer (emphasis on the amateur) and as such enjoy taking photographs of windsurfing, as well as other water activities. The location that I sail and take most of my photographs from (or if I am sailing my wife takes them) is facing into the south west and so usually towards the sun. This often results in a lot of water light reflection in the images (here is an example [https://imgur.com/a/A8ZLhV4](https://imgur.com/a/A8ZLhV4)) and can be quite bad at times meaning the subject is dark. I have tried with some limited knowledge to remove the highlights but often so bright nothing can be done. The winter sun lower in the sky doesn't help at times either.\n\nDoes anyone have any experience with shooting with water in this scenario to even out light across the image and make the subjects better quality? I think that maybe a polarized filter of some type may help but before I invest in one I would like to make sure it is the best solution. I have a Canon 70D and just got a Canon 100-400mm lens of Ebay to get a bit closer to the subjects on the water. \n\nPotentially there are better settings to use or post processing I could try? And don't get me wrong, occasionally I get a really nice image with the sailor silhouetted against the water, but not what I want all the time.\n\nFirst time posting here so I hope I have done it right and any advice would be really appreciated.", "link": "https://www.reddit.com/r/photography/comments/jiycvq/improving_water_sports_photography_and_light/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  water sports photography and light reflection /!/ hi photography, \n\ni am an avid windsurfer and also a keen amateur photographer (emphasis on the amateur) and as such enjoy taking photographs of windsurfing, as well as other water activities. the location that i sail and take most of my photographs from (or if i am sailing my wife takes them) is facing into the south west and so usually towards the sun. this often results in a lot of water light reflection in the images (here is an example [https://imgur.com/a/a8zlhv4](https://imgur.com/a/a8zlhv4)) and can be quite bad at times meaning the subject is dark. i have tried with some limited knowledge to remove the highlights but often so bright nothing can be done. the winter sun lower in the sky doesn't help at times either.\n\ndoes anyone have any experience with shooting with water in this scenario to even out light across the image and make the subjects better quality? i think that maybe a polarized filter of some type may help but before i invest in one i would like to make sure it is the best solution. i have a canon 70d and just got a canon 100-400mm lens of ebay to get a bit closer to the subjects on the water. \n\npotentially there are better settings to use or post processing i could try? and don't get me wrong, occasionally i get a really nice image with the sailor silhouetted against the water, but not what i want all the time.\n\nfirst time posting here so i hope i have done it right and any advice would be really appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 85982, "year": "2020"}, {"autor": "berni_g03", "date": "2021-01-29 22:21:46", "content": "Improve my pictures /!/ Dear people of r/photography,\n\nonce again I‘ve come to ask for your tips. I recently bought a new lense for my camera (EOS 250D, yes beginner) and I really love shooting with it.\nBut as good as the pictures are, there are still some things which disturb me. Quite a lot of my shots tend to be boring and in post production I dont really know what aspects to go for. Like I really love bright colours but it usually tends to be hard to look at longer cuz of the contrast. \nDo you have any tips for improvement?", "link": "https://www.reddit.com/r/photography/comments/l862ib/improve_my_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  my pictures /!/ dear people of r/photography,\n\nonce again i‘ve come to ask for your tips. i recently bought a new lense for my camera (eos 250d, yes beginner) and i really love shooting with it.\nbut as good as the pictures are, there are still some things which disturb me. quite a lot of my shots tend to be boring and in post production i dont really know what aspects to go for. like i really love bright colours but it usually tends to be hard to look at longer cuz of the contrast. \ndo you have any tips for improvement?", "sortedWord": "None", "Identifyer": null, "identifyer": 98040, "year": "2021"}, {"autor": "Moonclockaside", "date": "2021-04-19 13:18:09", "content": "Improve the quality of a picture to make a poster /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/mu0epb/improve_the_quality_of_a_picture_to_make_a_poster/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  the quality of a picture to make a poster /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 13240, "year": "2021"}, {"autor": "dc_Chinmay", "date": "2021-08-02 05:43:10", "content": "Improving and expanding my photography kit /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ow8f5a/improving_and_expanding_my_photography_kit/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  and expanding my photography kit /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 15876, "year": "2021"}, {"autor": "MookieSnipes13", "date": "2021-05-25 23:56:29", "content": "Improving! Nikon D7500, Nikon 55-200mm f4.5-5.6", "link": "https://www.reddit.com/r/Nikon/comments/nl3h7w/improving_nikon_d7500_nikon_55200mm_f4556/", "origin": "Reddit", "suborigin": "nikon", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!! ! nikon d7500, nikon 55-200mm f4.5-5.6", "sortedWord": "None", "Identifyer": null, "identifyer": 52346, "year": "2021"}, {"autor": "simpsn2", "date": "2020-04-09 22:25:24", "content": "Improve iOS wifi speed /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/fy23aw/improve_ios_wifi_speed/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  ios wifi speed /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60119, "year": "2020"}, {"autor": "MegMCJourno", "date": "2020-02-29 18:31:11", "content": "XT3 or XT4? for enthusiast stills photographer /!/ I'm an enthusiast photographer, mostly using my camera for travel, street, family, portrait and occasional photojournalism.\n\nI am not in the Fuji system yet. I've got an MFT Olympus Pen-F, which is a lovely camera which I plan to keep for travel and walk-around stuff where weight is a priority. I decided about a year ago that I want to get into the Fuji system for those times when I want better image quality and low light performance ... plus, you know, I just like buying camera stuff and playing with it and the Fuji system has a wonderful retro boutique allure.\n\nMy plan had been to wait around for the XT3 to lower in price to around $1k, which it very nearly has, so I could have enough change to buy a couple used lenses, probably the 35mm 1.4 or 2 and the 16-55 2.8. (Also lusting for the 56 1.2 and a third party superwide. Curious about the new 16-80 f4 but not sure it's quite right for my needs plus we already have a Canon 24-105L)\n\nBut when I heard the XT4 has IBIS my calculus changed. This seems like a dramatic upgrade over the XT3, and one that could potentially bump up the camera's value in low light situations, which is one of my rationales for adding another system to my lineup.\n\nHowever, I am not at this time very interested in video so I'm uncertain of the cost to benefit ratio of this feature for stills, given the pretty significant (and maybe more significant in coming months) price differential. Sure it will help with camera shake at slower shutter, but not with motion blur. And it would mean I would have to slow my roll a bit on lens accumulation.\n\nBefore the Olympus I was shooting on an ancient APS-C Canon 40D. My husband has the Canon 6Dii and I'm fairly happy in low light without IBIS or OS on those, but I don't know what I'm missing out on (and the full frame is not a good comparison). The Olympus does have IBIS and is still pretty much useless in low light, likely due to the constraints of MFT.\n\nMaybe a Fuji community is the wrong place to ask this question since only one of their other cameras currently has IBIS so presumably most everyone is shooting without it, but would love to hear your opinion.\n\nI have nearly pressed the \"Buy\" button on an XT-4 preorder several times but I keep waffling. Improved battery life is a bonus I care about and I do think I would appreciate the ever so slightly larger grip, but neither is worth $500 to me, and none of the other upgrades, besides IBIS, really matter to me at present.\n\nThoughts?", "link": "https://www.reddit.com/r/fujifilm/comments/fbgs8x/xt3_or_xt4_for_enthusiast_stills_photographer/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "xt3 or xt4? for enthusiast stills photographer /!/ i'm an enthusiast photographer, mostly using my camera for travel, street, family, portrait and occasional photojournalism.\n\ni am not in the fuji system yet. i've got an mft olympus pen-f, which is a lovely camera which i plan to keep for travel and walk-around stuff where weight is a priority. i decided about a year ago that i want to get into the fuji system for those times when i want better image quality and low light performance ... plus, you know, i just like buying camera stuff and playing with it and the fuji system has a wonderful retro boutique allure.\n\nmy plan had been to wait around for the xt3 to lower in price to around $1k, which it very nearly has, so i could have enough change to buy a couple used lenses, probably the 35mm 1.4 or 2 and the 16-55 2.8. (also lusting for the 56 1.2 and a third party superwide. curious about the new 16-80 f4 but not sure it's quite right for my needs plus we already have a canon 24-105l)\n\nbut when i heard the xt4 has ibis my calculus changed. this seems like a dramatic upgrade over the xt3, and one that could potentially bump up the camera's value in low light situations, which is one of my rationales for adding another system to my lineup.\n\nhowever, i am not at this time very interested in video so i'm uncertain of the cost to benefit ratio of this feature for stills, given the pretty significant (and maybe more significant in coming months) price differential. sure it will help with camera shake at slower shutter, but not with motion blur. and it would mean i would have to slow my roll a bit on lens accumulation.\n\nbefore the olympus i was shooting on an ancient aps-c canon 40d. my husband has the canon 6dii and i'm fairly happy in low light without ibis or os on those, but i don't know what i'm missing out on (and the full frame is not a good comparison). the olympus does have ibis and is still pretty much useless in low light, likely due to the constraints of mft.\n\nmaybe a fuji community is the wrong place to ask this question since only one of their other cameras currently has ibis so presumably most everyone is shooting without it, but would love to hear your opinion.\n\ni have nearly pressed the \"buy\" button on an xt-4 preorder several times but i keep waffling. -----> improved !!!  battery life is a bonus i care about and i do think i would appreciate the ever so slightly larger grip, but neither is worth $500 to me, and none of the other upgrades, besides ibis, really matter to me at present.\n\nthoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 60704, "year": "2020"}, {"autor": "LukeOnTheBrightSide", "date": "2020-10-28 07:51:33", "content": "X-T3 Firmware Update Version 4.00 Released. Improved AF speed, AF tracking performance, Eye AF, and low-light AF.", "link": "https://www.reddit.com/r/fujifilm/comments/jjjme4/xt3_firmware_update_version_400_released_improved/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "x-t3 firmware update version 4.00 released. -----> improved !!!  af speed, af tracking performance, eye af, and low-light af.", "sortedWord": "None", "Identifyer": null, "identifyer": 62097, "year": "2020"}, {"autor": "TDMS76", "date": "2020-01-24 14:14:59", "content": "Improving post game /!/ I thought I would ask here, my post game I feel is not great and I compensate it by working really hard to get better pictures  as I take them. I also forgive myself because most of my photography is low light and pictures of people dancing. Poor light, erratic motion = frustration :).\n\n&amp;#x200B;\n\nCan some of you in the Fuji crew have some suggestions on resources to up the post game. I have LR and PS. I am considering getting C1 after seeing how it handles color and light with Fuji cameras.   \n\n\nPicture added for context.", "link": "https://www.reddit.com/r/fujifilm/comments/etay2h/improving_post_game/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  post game /!/ i thought i would ask here, my post game i feel is not great and i compensate it by working really hard to get better pictures  as i take them. i also forgive myself because most of my photography is low light and pictures of people dancing. poor light, erratic motion = frustration :).\n\n&amp;#x200b;\n\ncan some of you in the fuji crew have some suggestions on resources to up the post game. i have lr and ps. i am considering getting c1 after seeing how it handles color and light with fuji cameras.   \n\n\npicture added for context.", "sortedWord": "None", "Identifyer": null, "identifyer": 64256, "year": "2020"}, {"autor": "manu_trackandfield", "date": "2019-09-23 10:15:45", "content": "Improve old or completely new? /!/ Hi guys, I have a little thinking to do.\nCurrently I’ve got a Lumix DMC GX7 with 12-60mm. \nI want to buy 50-200mm lenses (1500 Euro).\nRight now I don’t know if it’s worth the investment for this camera. Do you think it will be okay for the next few years technically or do you suggest to sell the old and buy a new camera (maybe Canon 7D Mark 2) to have a more solid base for the next few years?", "link": "https://www.reddit.com/r/Cameras/comments/d84jdi/improve_old_or_completely_new/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  old or completely new? /!/ hi guys, i have a little thinking to do.\ncurrently i’ve got a lumix dmc gx7 with 12-60mm. \ni want to buy 50-200mm lenses (1500 euro).\nright now i don’t know if it’s worth the investment for this camera. do you think it will be okay for the next few years technically or do you suggest to sell the old and buy a new camera (maybe canon 7d mark 2) to have a more solid base for the next few years?", "sortedWord": "None", "Identifyer": null, "identifyer": 79088, "year": "2019"}, {"autor": "milestparker", "date": "2021-08-21 20:09:35", "content": "Improving Fujifilm app quality /!/ Continuing discussion about usability issues with Fuji desktop apps, specifically the Fuji Raw convertor which is otherwise one of the most useful apps in my workflow. The frustrating thing is that the actual functionality works really well, I just think people can't get past the interface. Not sure if  /u/Suspicious_Suspect42 has vision issues per se, but it sucks when companies don't think about stuff like this.\n\nFuji's apps are remarkably amateur hour when compared to quality of their hardware and firmware, I've almost thought of offerring my services to fix, heh. Maybe we could convince them to open source them. If they had an API, that would be ideal. Wonder how to approach them about community help with solving these issues.  \n[https://www.reddit.com/r/fujifilm/comments/p8fjos/film\\_bracket\\_with\\_raw/h9ro9z0?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/fujifilm/comments/p8fjos/film_bracket_with_raw/h9ro9z0?utm_source=share&amp;utm_medium=web2x&amp;context=3)", "link": "https://www.reddit.com/r/fujifilm/comments/p8ycsr/improving_fujifilm_app_quality/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  fujifilm app quality /!/ continuing discussion about usability issues with fuji desktop apps, specifically the fuji raw convertor which is otherwise one of the most useful apps in my workflow. the frustrating thing is that the actual functionality works really well, i just think people can't get past the interface. not sure if  /u/suspicious_suspect42 has vision issues per se, but it sucks when companies don't think about stuff like this.\n\nfuji's apps are remarkably amateur hour when compared to quality of their hardware and firmware, i've almost thought of offerring my services to fix, heh. maybe we could convince them to open source them. if they had an api, that would be ideal. wonder how to approach them about community help with solving these issues.  \n[https://www.reddit.com/r/fujifilm/comments/p8fjos/film\\_bracket\\_with\\_raw/h9ro9z0?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/fujifilm/comments/p8fjos/film_bracket_with_raw/h9ro9z0?utm_source=share&amp;utm_medium=web2x&amp;context=3)", "sortedWord": "None", "Identifyer": null, "identifyer": 86607, "year": "2021"}, {"autor": "aLegobuilder", "date": "2020-03-11 20:04:59", "content": "Improve Your SMARTPHONE Photography in 60 SECONDS!", "link": "https://www.reddit.com/r/Cameras/comments/fh3dod/improve_your_smartphone_photography_in_60_seconds/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  your smartphone photography in 60 seconds!", "sortedWord": "None", "Identifyer": null, "identifyer": 1535, "year": "2020"}, {"autor": "stewartrivera82", "date": "2021-08-05 07:41:04", "content": "Improve Railroad Security with Tactical", "link": "https://www.reddit.com/r/Cameras/comments/oycojq/improve_railroad_security_with_tactical/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  railroad security with tactical", "sortedWord": "None", "Identifyer": null, "identifyer": 20380, "year": "2021"}, {"autor": "CreativeVideoTips", "date": "2021-09-14 13:37:49", "content": "Improve Your GoPro! /!/ Did you know you can UNLOCK more features on your current GoPro with a fancy new firmware?  You download it from GoPro Labs.  It uses QR code’s and it’ll change the way you use your camera big time.  Check it out in this weeks Creative Video Tips!\nhttps://youtu.be/hj7HwElr3NY", "link": "https://www.reddit.com/r/Cameras/comments/po2y3s/improve_your_gopro/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  your gopro! /!/ did you know you can unlock more features on your current gopro with a fancy new firmware?  you download it from gopro labs.  it uses qr code’s and it’ll change the way you use your camera big time.  check it out in this weeks creative video tips!\nhttps://youtu.be/hj7hwelr3ny", "sortedWord": "None", "Identifyer": null, "identifyer": 22992, "year": "2021"}, {"autor": "EerikSandstrom", "date": "2018-02-26 07:34:45", "content": "Improve your Mountain Bike Photography", "link": "https://www.reddit.com/r/photography/comments/80ba3g/improve_your_mountain_bike_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  your mountain bike photography", "sortedWord": "None", "Identifyer": null, "identifyer": 19530, "year": "2018"}, {"autor": "d2boostingdestiny", "date": "2018-03-09 09:50:29", "content": "Improve your Rank with Destiny 2 Rank Boosting services", "link": "https://www.reddit.com/r/photography/comments/835kh9/improve_your_rank_with_destiny_2_rank_boosting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  your rank with destiny 2 rank boosting services", "sortedWord": "None", "Identifyer": null, "identifyer": 19821, "year": "2018"}, {"autor": "iiboxs3", "date": "2018-09-07 14:10:03", "content": "Improving my instagram page /!/ Hi all. Is there any chance, someone could critique my photography page? Hashtags, content, post frequency/order etc?\n\nMy market is mainly the cosplay market but i also do a bit of regular fashion/portraiture.\nI am debating about splitting my page into 2 or 3 pages however (cosplay, fashion/glamour, weddings) but am unsure as to how to name my pages.\n\nAny constructive feedback is appreciated!\n\nhttps://www.instagram.com/satindressphotography/", "link": "https://www.reddit.com/r/photography/comments/9duowm/improving_my_instagram_page/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  my instagram page /!/ hi all. is there any chance, someone could critique my photography page? hashtags, content, post frequency/order etc?\n\nmy market is mainly the cosplay market but i also do a bit of regular fashion/portraiture.\ni am debating about splitting my page into 2 or 3 pages however (cosplay, fashion/glamour, weddings) but am unsure as to how to name my pages.\n\nany constructive feedback is appreciated!\n\nhttps://www.instagram.com/satindressphotography/", "sortedWord": "None", "Identifyer": null, "identifyer": 23440, "year": "2018"}, {"autor": "thebushtuckerman", "date": "2018-06-23 13:33:56", "content": "Improving composition /!/ I have been shooting for a while but I feel like I'm in a little bit of a rut. What are some books or podcasts etc that would challenge me to improve my composition to better me as a photographer. ", "link": "https://www.reddit.com/r/photography/comments/8t9ydu/improving_composition/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  composition /!/ i have been shooting for a while but i feel like i'm in a little bit of a rut. what are some books or podcasts etc that would challenge me to improve my composition to better me as a photographer. ", "sortedWord": "None", "Identifyer": null, "identifyer": 35601, "year": "2018"}, {"autor": "Quick-Teach-9605", "date": "2021-04-01 15:56:20", "content": "Improve your mobile photography", "link": "https://www.reddit.com/r/canon/comments/mhybg0/improve_your_mobile_photography/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  your mobile photography", "sortedWord": "None", "Identifyer": null, "identifyer": 38080, "year": "2021"}, {"autor": "JohnDeere6930Premium", "date": "2020-06-29 21:15:30", "content": "Improving Powershot SX420IS image quality /!/ Is there any way of improving image quality of a fixed-lens camera", "link": "https://www.reddit.com/r/canon/comments/hi8zuo/improving_powershot_sx420is_image_quality/", "origin": "Reddit", "suborigin": "canon", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  powershot sx420is image quality /!/ is there any way of -----> improving !!!  image quality of a fixed-lens camera", "sortedWord": "None", "Identifyer": null, "identifyer": 45130, "year": "2020"}, {"autor": "Gabrier", "date": "2019-05-22 15:09:58", "content": "Improve the Quality of Your Images With a New Technology", "link": "https://www.reddit.com/r/photography/comments/brpxzh/improve_the_quality_of_your_images_with_a_new/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  the quality of your images with a new technology", "sortedWord": "None", "Identifyer": null, "identifyer": 69242, "year": "2019"}, {"autor": "Albierschiller", "date": "2019-05-22 14:57:58", "content": "Improve the Quality of Your Images With a New Technology", "link": "https://www.reddit.com/r/photography/comments/brpsv2/improve_the_quality_of_your_images_with_a_new/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  the quality of your images with a new technology", "sortedWord": "None", "Identifyer": null, "identifyer": 69244, "year": "2019"}], "name": "fujifilm2019improve"}