{"interestingcomments": [{"autor": "milestparker", "date": "2021-08-21 20:09:35", "content": "Improving Fujifilm app quality /!/ Continuing discussion about usability issues with Fuji desktop apps, specifically the Fuji Raw convertor which is otherwise one of the most useful apps in my workflow. The frustrating thing is that the actual functionality works really well, I just think people can't get past the interface. Not sure if  /u/Suspicious_Suspect42 has vision issues per se, but it sucks when companies don't think about stuff like this.\n\nFuji's apps are remarkably amateur hour when compared to quality of their hardware and firmware, I've almost thought of offerring my services to fix, heh. Maybe we could convince them to open source them. If they had an API, that would be ideal. Wonder how to approach them about community help with solving these issues.  \n[https://www.reddit.com/r/fujifilm/comments/p8fjos/film\\_bracket\\_with\\_raw/h9ro9z0?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/fujifilm/comments/p8fjos/film_bracket_with_raw/h9ro9z0?utm_source=share&amp;utm_medium=web2x&amp;context=3)", "link": "https://www.reddit.com/r/fujifilm/comments/p8ycsr/improving_fujifilm_app_quality/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  fujifilm app quality /!/ continuing discussion about usability issues with fuji desktop apps, specifically the fuji raw convertor which is otherwise one of the most useful apps in my workflow. the frustrating thing is that the actual functionality works really well, i just think people can't get past the interface. not sure if  /u/suspicious_suspect42 has vision issues per se, but it sucks when companies don't think about stuff like this.\n\nfuji's apps are remarkably amateur hour when compared to quality of their hardware and firmware, i've almost thought of offerring my services to fix, heh. maybe we could convince them to open source them. if they had an api, that would be ideal. wonder how to approach them about community help with solving these issues.  \n[https://www.reddit.com/r/fujifilm/comments/p8fjos/film\\_bracket\\_with\\_raw/h9ro9z0?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/fujifilm/comments/p8fjos/film_bracket_with_raw/h9ro9z0?utm_source=share&amp;utm_medium=web2x&amp;context=3)", "sortedWord": "None", "Identifyer": null, "identifyer": 86607, "year": "2021"}], "name": "improvefujifilm2021"}