{"interestingcomments": [{"autor": "simpsn2", "date": "2020-04-09 22:25:24", "content": "Improve iOS wifi speed /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/fy23aw/improve_ios_wifi_speed/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "-----> improve !!!  ios wifi speed /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60119, "year": "2020"}, {"autor": "MegMCJourno", "date": "2020-02-29 18:31:11", "content": "XT3 or XT4? for enthusiast stills photographer /!/ I'm an enthusiast photographer, mostly using my camera for travel, street, family, portrait and occasional photojournalism.\n\nI am not in the Fuji system yet. I've got an MFT Olympus Pen-F, which is a lovely camera which I plan to keep for travel and walk-around stuff where weight is a priority. I decided about a year ago that I want to get into the Fuji system for those times when I want better image quality and low light performance ... plus, you know, I just like buying camera stuff and playing with it and the Fuji system has a wonderful retro boutique allure.\n\nMy plan had been to wait around for the XT3 to lower in price to around $1k, which it very nearly has, so I could have enough change to buy a couple used lenses, probably the 35mm 1.4 or 2 and the 16-55 2.8. (Also lusting for the 56 1.2 and a third party superwide. Curious about the new 16-80 f4 but not sure it's quite right for my needs plus we already have a Canon 24-105L)\n\nBut when I heard the XT4 has IBIS my calculus changed. This seems like a dramatic upgrade over the XT3, and one that could potentially bump up the camera's value in low light situations, which is one of my rationales for adding another system to my lineup.\n\nHowever, I am not at this time very interested in video so I'm uncertain of the cost to benefit ratio of this feature for stills, given the pretty significant (and maybe more significant in coming months) price differential. Sure it will help with camera shake at slower shutter, but not with motion blur. And it would mean I would have to slow my roll a bit on lens accumulation.\n\nBefore the Olympus I was shooting on an ancient APS-C Canon 40D. My husband has the Canon 6Dii and I'm fairly happy in low light without IBIS or OS on those, but I don't know what I'm missing out on (and the full frame is not a good comparison). The Olympus does have IBIS and is still pretty much useless in low light, likely due to the constraints of MFT.\n\nMaybe a Fuji community is the wrong place to ask this question since only one of their other cameras currently has IBIS so presumably most everyone is shooting without it, but would love to hear your opinion.\n\nI have nearly pressed the \"Buy\" button on an XT-4 preorder several times but I keep waffling. Improved battery life is a bonus I care about and I do think I would appreciate the ever so slightly larger grip, but neither is worth $500 to me, and none of the other upgrades, besides IBIS, really matter to me at present.\n\nThoughts?", "link": "https://www.reddit.com/r/fujifilm/comments/fbgs8x/xt3_or_xt4_for_enthusiast_stills_photographer/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "xt3 or xt4? for enthusiast stills photographer /!/ i'm an enthusiast photographer, mostly using my camera for travel, street, family, portrait and occasional photojournalism.\n\ni am not in the fuji system yet. i've got an mft olympus pen-f, which is a lovely camera which i plan to keep for travel and walk-around stuff where weight is a priority. i decided about a year ago that i want to get into the fuji system for those times when i want better image quality and low light performance ... plus, you know, i just like buying camera stuff and playing with it and the fuji system has a wonderful retro boutique allure.\n\nmy plan had been to wait around for the xt3 to lower in price to around $1k, which it very nearly has, so i could have enough change to buy a couple used lenses, probably the 35mm 1.4 or 2 and the 16-55 2.8. (also lusting for the 56 1.2 and a third party superwide. curious about the new 16-80 f4 but not sure it's quite right for my needs plus we already have a canon 24-105l)\n\nbut when i heard the xt4 has ibis my calculus changed. this seems like a dramatic upgrade over the xt3, and one that could potentially bump up the camera's value in low light situations, which is one of my rationales for adding another system to my lineup.\n\nhowever, i am not at this time very interested in video so i'm uncertain of the cost to benefit ratio of this feature for stills, given the pretty significant (and maybe more significant in coming months) price differential. sure it will help with camera shake at slower shutter, but not with motion blur. and it would mean i would have to slow my roll a bit on lens accumulation.\n\nbefore the olympus i was shooting on an ancient aps-c canon 40d. my husband has the canon 6dii and i'm fairly happy in low light without ibis or os on those, but i don't know what i'm missing out on (and the full frame is not a good comparison). the olympus does have ibis and is still pretty much useless in low light, likely due to the constraints of mft.\n\nmaybe a fuji community is the wrong place to ask this question since only one of their other cameras currently has ibis so presumably most everyone is shooting without it, but would love to hear your opinion.\n\ni have nearly pressed the \"buy\" button on an xt-4 preorder several times but i keep waffling. -----> improved !!!  battery life is a bonus i care about and i do think i would appreciate the ever so slightly larger grip, but neither is worth $500 to me, and none of the other upgrades, besides ibis, really matter to me at present.\n\nthoughts?", "sortedWord": "None", "Identifyer": null, "identifyer": 60704, "year": "2020"}, {"autor": "LukeOnTheBrightSide", "date": "2020-10-28 07:51:33", "content": "X-T3 Firmware Update Version 4.00 Released. Improved AF speed, AF tracking performance, Eye AF, and low-light AF.", "link": "https://www.reddit.com/r/fujifilm/comments/jjjme4/xt3_firmware_update_version_400_released_improved/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "x-t3 firmware update version 4.00 released. -----> improved !!!  af speed, af tracking performance, eye af, and low-light af.", "sortedWord": "None", "Identifyer": null, "identifyer": 62097, "year": "2020"}, {"autor": "TDMS76", "date": "2020-01-24 14:14:59", "content": "Improving post game /!/ I thought I would ask here, my post game I feel is not great and I compensate it by working really hard to get better pictures  as I take them. I also forgive myself because most of my photography is low light and pictures of people dancing. Poor light, erratic motion = frustration :).\n\n&amp;#x200B;\n\nCan some of you in the Fuji crew have some suggestions on resources to up the post game. I have LR and PS. I am considering getting C1 after seeing how it handles color and light with Fuji cameras.   \n\n\nPicture added for context.", "link": "https://www.reddit.com/r/fujifilm/comments/etay2h/improving_post_game/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "-----> improving !!!  post game /!/ i thought i would ask here, my post game i feel is not great and i compensate it by working really hard to get better pictures  as i take them. i also forgive myself because most of my photography is low light and pictures of people dancing. poor light, erratic motion = frustration :).\n\n&amp;#x200b;\n\ncan some of you in the fuji crew have some suggestions on resources to up the post game. i have lr and ps. i am considering getting c1 after seeing how it handles color and light with fuji cameras.   \n\n\npicture added for context.", "sortedWord": "None", "Identifyer": null, "identifyer": 64256, "year": "2020"}], "name": "improvefujifilm2020"}