{"interestingcomments": [{"autor": "patiszejuicebox", "date": "2020-03-12 02:41:10", "content": "50mm f2 vs 60mm 2.4 Macro? /!/ Hiya!\n\n  \nA friend of my introduced me to the Fuji system, and I'm trying to figure out my setup. I currently have a budget of $1500 and plan on getting a used XT2. In regards for the lenses, I know I want a wide angle lens such as the 23mm f2. Currently right now, I want to compliment it with a short telephoto lens, but I can't decide between the 50 f2 or the 60mm f2.4 Macro.  \n\n\nFor better reference, I shoot portraits, street, travel, occasionally landscapes, textures, and food.", "link": "https://www.reddit.com/r/fujifilm/comments/fh9e53/50mm_f2_vs_60mm_24_macro/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "my introduced", "selectorShort": "introduce", "MarkedSent": "50mm f2 vs 60mm 2.4 macro? /!/ hiya!\n\n  \na friend of -----> my !!!  -----> introduced !!!  me to the fuji system, and i'm trying to figure out -----> my !!!  setup. i currently have a budget of $1500 and plan on getting a used xt2. in regards for the lenses, i know i want a wide angle lens such as the 23mm f2. currently right now, i want to compliment it with a short telephoto lens, but i can't decide between the 50 f2 or the 60mm f2.4 macro.  \n\n\nfor better reference, i shoot portraits, street, travel, occasionally landscapes, textures, and food.", "sortedWord": "None", "Identifyer": null, "identifyer": 57142, "year": "2020"}, {"autor": "rcdenn", "date": "2020-01-21 00:13:20", "content": "New to the system (sort of) /!/ Okay, I was introduced to FujiFilm with the X100F. I have (soon to be had) a Nikon DSLR with a variety of lenses. I am selling all that and the X100F and just bought an XT20 with the 35mm and 55-200mm lenses. So I am officially invested in the system. \n\nThese lens cover almost everything I do on the Nikon. I might get the 27mm in the future for a pancake lens. And I might get the 100-400 for birds. Otherwise, I think I am set. \n\nAny recommendations on accessories, lenses (not otherwise mentioned)? Also, I am going to the beach soon. My Nikon is weather sealed, but as I said I am selling it. I was wondering your thoughts on taking the XT20 to the beach with a WR prime taking precautions such as keeping it in a sealed bag when not in use. Would it be worth getting an XT1 to use just for this purpose?\n\nI like the size of the XT20 so I don’t want to just go up to the XT2 as my sole camera. I also know my wife will like the auto switch in the XT20 for her use (she hates using the X100F or Nikon, although she loves the Fuji images).", "link": "https://www.reddit.com/r/fujifilm/comments/ermcjp/new_to_the_system_sort_of/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "new to the system (sort of) /!/ okay, -----> i !!!  -----> was !!!  -----> introduced !!!  to fujifilm with the x100f. i have (soon to be had) a nikon dslr with a variety of lenses. i am selling all that and the x100f and just bought an xt20 with the 35mm and 55-200mm lenses. so i am officially invested in the system. \n\nthese lens cover almost everything i do on the nikon. i might get the 27mm in the future for a pancake lens. and i might get the 100-400 for birds. otherwise, i think i am set. \n\nany recommendations on accessories, lenses (not otherwise mentioned)? also, i am going to the beach soon. my nikon is weather sealed, but as i said i am selling it. i was wondering your thoughts on taking the xt20 to the beach with a wr prime taking precautions such as keeping it in a sealed bag when not in use. would it be worth getting an xt1 to use just for this purpose?\n\ni like the size of the xt20 so i don’t want to just go up to the xt2 as my sole camera. i also know my wife will like the auto switch in the xt20 for her use (she hates using the x100f or nikon, although she loves the fuji images).", "sortedWord": "None", "Identifyer": null, "identifyer": 61162, "year": "2020"}], "name": "introducefujifilm2020"}