{"interestingcomments": [{"Unnamed: 0": 191501, "autor": "qUxUp", "date": 1628932123000, "content": "I used to study art, work as a designer and have taken photos on my cellphones from 2008. Have done some research, tried out cameras in the store and really enjoyed Fujifilm X-T3 and X-T4. Can you please give some advice regarding possible alternatives? /!/ **TLDR: I went to a photography store and tried out multiple cameras. Ended up liking Fujifilm T3 and T4 the most. Now I'm looking to get some feedback from whoever is willing to drop a few lines :)** \n\n&amp;nbsp;\n\nHello! \n\n\n\nI used to study art, with focus on painting, drawing, composition, art history, design history, graphics design (corel, photoshop, macromedia flash rip). After that I worked as a designer for years (mostly graphics design). Did some photography (camera provided by employer) when needed but never had any formal photography training. I have never owned my personal camera. As a hobby I've taken photos with all of my phones (from dumbphones to smartphones, current phone is Google Pixel 5). My phone \"photography\" experience started around 2008. I've used most of the known android camera applications (Google Camera, Modified versions of google camera, filmic pro, open camera and many more); to expand on my phone camera capabilities I've used my own experimental \"lenses\", such as taking photographs through looking glasses, binoculars, eyeglasses, regular glasses, tinted glass, reflections from surfaces, through multiple surfaces, through containers filled with water etc. \n\n&amp;nbsp;\n\nAfter leaving the design industry I've continued to draw, craft and have taken photos with my smartphone. Since I've hit the technical limitations on my phone cameras for far too long and haven't found workarounds, I have realized that it's better to just get a dedicated camera as a tool to realize my artistic visions, capture scenes and moments as an artistic expression for myself and for my family and close friends. Most common photo scenarios: nature (flora, fauna, especially birds, insects), cats, people, some sort of astro photography capability would be a godsend, architecture, rivers, bunkers.\n\nGoogle Pixel 5 isn't giving me enough control over pretty much all settings (I posted the limitations to my previous thread, but just in case, I'll add them to the end of my post). \n\n&amp;nbsp;\n\nAnyhow after the suggestions I got on reddit I did much more research - found out that I really like how Fujifilm camera colors look pre-editing, the multiple physical controls on the camera. Earlier today I went to a photography shop and tried different cameras (held them in hand, how they fit, how the buttons feels etc). \n\nOut of the ones I tested (and considered to fit my needs) Canon m50 mk 2 was okay (it didn't feel that good to be honest) but I loved Fujifilm t3 and t4. Those seemed to fit my hand size perfectly. I also really enjoy physical controls on the camera. As a bonus my partner also liked Fujifilm cameras the most, so that is a plus. \n\n&amp;nbsp;\n\nSo with that wall of text aside.\n\nMy plan is to stick with this camera for years. This could be a very wrong approach when it comes to photography, so please correct me if I'm wrong: I usually prefer to buy a single high quality tool and use it for a long time, until it breaks and/or I reach a technical limitation (less bought products = smaller carbon footprint and so on). I also want to invest in a few lenses after buying the camera &amp; keep expanding the lens selection as the need arises. At some point I'll buy another camera (or cameras?), but I don't see that happening for many years. \n\n&amp;nbsp;\n\n**Are there any other cameras besides Fujifilm T3 &amp; T4 that I should consider?** While I have an art education and experience as a graphical designer and I've taken photos on my smartphones, I have not owned a dedicated camera, so I consider myself to be a beginner. Fujifilm T3 and T4 seem good and I love the variety of controls, but they are also quite advanced. \n\n**Would it be a bad idea to get a camera that advanced with my very limited experience? Fujitsu T3 and T4 cost around 1300 - 2000+ € in Estonia. Perhaps there is something cheaper that I should take a look at?** \n\n**Besides Fujitsu T3 and T4, are there any other mirrorless cameras that I should take a look at? I live in Europe, Estonia and there is a quite decent used camera market here. I'm hoping to buy the camera used but if that's not possible, I am open to buying it new locally or ordering online (if you know any good locations for buying used or new cameras in Europe that ship in Europe, I'd be very thankful for the suggestion).** \n\n\n**The features I am looking for:** \n\nmultiple physical controls, \n\nmany manual settings,\n\nweight around 500 g (without lens) would be perfect but I'm also open to cameras that are around 400 g or a little less \n\nquality build \n\n\n&amp;nbsp;\n\n\n\n\n**Oh... my. Thank you so much for reading my post! If you have any suggestions or thoughts, I'd be very happy to read them. I am an open book and here to learn!** \n\n\n&amp;nbsp;\n\n\nCheers :) \n\n\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n\n\nMy current technical limitations:\n\nI can't switch lenses (it would be lovely to have the option to use different lenses to optimize the picture depending subject matter),\n\ncolors can be very inaccurate,\n\nthe photos are stored in the phone which is connected to internet (I'm trying to slighlty distance myself from the internet);\n\nfocusing issues,\n\npictures in medium range and distance are too blurry,\n\nsharpness of edges,\n\ntoo little control over various camera settings (light, focus range etc),\n\nchanging settings on a smartphone camera is very inconvinient and slow - I'd like to be able to change settings faster,\n\nproblems in medium and low light make it very hard to take decent pictures (details get muddy, there is much more noise),\n\nproblems with capturing moving objects,\n\ntoo little control over colors,\n\ntaking pictures of objects that are dark colored are very hit and miss (one of my cats is black, it's very sad that I currently can't capture her savagery well enough),\n\nzoom causes noticable noise (long range pictures) ,\n\nlittle details are muddy when looking up close,\n\nI'd like to take long exposure shots,\n\nI'd like to have more control over different settings (like exposure, higher resolution),\n\nno tripod supprt,\n\nit is very small - I'd like to get something that is bigger and if there is an option to change how the camera feels in hand (maybe grips?) it would be sweet,", "link": "https://www.reddit.com/r/fujifilm/comments/p44qdl/i_used_to_study_art_work_as_a_designer_and_have/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i used to study art, work as a designer and have taken photos on my cellphones from 2008. have done some research, tried out cameras in the store and really enjoyed fujifilm x-t3 and x-t4. can you please give some advice regarding possible alternatives? /!/ **tldr: i went to a photography store and tried out multiple cameras. ended up liking fujifilm t3 and t4 the most. now i'm looking to get some feedback from whoever is willing to drop a few lines :)** \n\n&amp;nbsp;\n\nhello! \n\n\n\ni used to study art, with focus on painting, drawing, composition, art history, design history, graphics design (corel, photoshop, macromedia flash rip). after that i worked as a designer for years (mostly graphics design). did some photography (camera provided by employer) when needed but never had any formal photography training. i have never owned my personal camera. as a hobby i've taken photos with all of my phones (from dumbphones to smartphones, current phone is google pixel 5). my phone \"photography\" experience started around 2008. i've used most of the known android camera applications (google camera, modified versions of google camera, filmic pro, open camera and many more); to expand on my phone camera capabilities i've used my own experimental \"lenses\", such as taking photographs through looking glasses, binoculars, eyeglasses, regular glasses, tinted glass, reflections from surfaces, through multiple surfaces, through containers filled with water etc. \n\n&amp;nbsp;\n\nafter leaving the design industry i've continued to draw, craft and have taken photos with my smartphone. since i've hit the technical limitations on my phone cameras for far too long and haven't found workarounds, i have realized that it's better to just get a dedicated camera as a tool to realize my artistic visions, capture scenes and moments as an artistic expression for myself and for my family and close friends. most common photo scenarios: nature (flora, fauna, especially birds, insects), cats, people, some sort of astro photography capability would be a godsend, architecture, rivers, bunkers.\n\ngoogle pixel 5 isn't giving me enough control over pretty much all settings (i posted the limitations to my previous thread, but just in case, i'll add them to the end of my post). \n\n&amp;nbsp;\n\nanyhow after the suggestions i got on reddit i did much more research - found out that i really like how fujifilm camera colors look pre-editing, the multiple physical controls on the camera. earlier today i went to a photography shop and tried different cameras (held them in hand, how they fit, how the buttons feels etc). \n\nout of the ones i tested (and considered to fit my needs) canon m50 mk 2 was okay (it didn't feel that good to be honest) but i loved fujifilm t3 and t4. those seemed to fit my hand size perfectly. i also really enjoy physical controls on the camera. as a bonus my partner also liked fujifilm cameras the most, so that is a plus. \n\n&amp;nbsp;\n\nso with that wall of text aside.\n\nmy plan is to stick with this camera for years. this could be a very wrong approach when it comes to photography, so please correct me if i'm wrong: i usually prefer to buy a single high quality tool and use it for a long time, until it breaks and/or i reach a technical limitation (less bought products = smaller carbon footprint and so on). i also want to invest in a few lenses after buying the camera &amp; keep expanding the lens selection as the need arises. at some point i'll buy another camera (or cameras?), but i don't see that happening for many years. \n\n&amp;nbsp;\n\n**are there any other cameras besides fujifilm t3 &amp; t4 that i should consider?** while i have an art education and experience as a graphical designer and i've taken photos on my smartphones, i have not owned a dedicated camera, so i consider myself to be a beginner. fujifilm t3 and t4 seem good and i love the variety of controls, but they are also quite advanced. \n\n**would it be a bad idea to get a camera that advanced with my very limited experience? fujitsu t3 and t4 cost around 1300 - 2000+ € in estonia. perhaps there is something cheaper that i should take a look at?** \n\n**besides fujitsu t3 and t4, are there any other mirrorless cameras that i should take a look at? i live in europe, estonia and there is a quite decent used camera market here. i'm hoping to buy the camera used but if that's not possible, i am open to buying it new locally or ordering online (if you know any good -----> locations !!!  for buying used or new cameras in europe that ship in europe, i'd be very thankful for the suggestion).** \n\n\n**the features i am looking for:** \n\nmultiple physical controls, \n\nmany manual settings,\n\nweight around 500 g (without lens) would be perfect but i'm also open to cameras that are around 400 g or a little less \n\nquality build \n\n\n&amp;nbsp;\n\n\n\n\n**oh... my. thank you so much for reading my post! if you have any suggestions or thoughts, i'd be very happy to read them. i am an open book and here to learn!** \n\n\n&amp;nbsp;\n\n\ncheers :) \n\n\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n\n\nmy current technical limitations:\n\ni can't switch lenses (it would be lovely to have the option to use different lenses to optimize the picture depending subject matter),\n\ncolors can be very inaccurate,\n\nthe photos are stored in the phone which is connected to internet (i'm trying to slighlty distance myself from the internet);\n\nfocusing issues,\n\npictures in medium range and distance are too blurry,\n\nsharpness of edges,\n\ntoo little control over various camera settings (light, focus range etc),\n\nchanging settings on a smartphone camera is very inconvinient and slow - i'd like to be able to change settings faster,\n\nproblems in medium and low light make it very hard to take decent pictures (details get muddy, there is much more noise),\n\nproblems with capturing moving objects,\n\ntoo little control over colors,\n\ntaking pictures of objects that are dark colored are very hit and miss (one of my cats is black, it's very sad that i currently can't capture her savagery well enough),\n\nzoom causes noticable noise (long range pictures) ,\n\nlittle details are muddy when looking up close,\n\ni'd like to take long exposure shots,\n\ni'd like to have more control over different settings (like exposure, higher resolution),\n\nno tripod supprt,\n\nit is very small - i'd like to get something that is bigger and if there is an option to change how the camera feels in hand (maybe grips?) it would be sweet,", "sortedWord": "None", "identifyer": 84284, "doc": "b'x\\x9c\\xed]\\x07\\\\\\x13\\xc9\\xf7\\x07{\\xef\\xe8!\\xd8\\x0b\\xeaa\\x03\\xf5\\xd4;\\x0b\\x88x\\x16\\x04\\x01;\\n!\\t\\x10\\rI\\xcc&\"\\xf6\\xd3\\xb3\\x97SO=EQI\\xa1\\xdbP9\\xecb\\xef\\xbd\\xfe\\xecbW<\\xd1S\\xac\\xe7\\x7f\\x16\\x18\\x95\\xe7\\xcd\\x8f\\xc9\\xed\\xfc\\x16\\xbd\\xbf\\xe1\\xc3~w\\xb3\\xc9Nf\\xe6\\xcd{o\\xde\\xbc\\xf7fZ\\xccp\\xb9\\x96S\\xa8U\\xc6fM\\x9a\\x9b%:\\x9d\\x96\\x8bt\\xe9\\xd4\\xb5[\\xf7\\x1e\\x1e==\\xbd\\x8eX\\xef>b\\xbd\\xe7\\x88\\xf5\\xdeh\\x9dz\\xa8\\\\\\xc5\\xed\\xb5*\\xd06\\xa0F\\x8d\\xab\\x9a\\xba\\xf3\\xb6\\xb9c\\xdc\\xde\\xd9m\\xd8\\xbb\\x94*.\\xfeV\\xd9\\xafK\\xf5:4\\xad\\xf9|\\xf2\\xd6\\x95\\xd6\\xd9\\xd7\\x05\\xacr\\xbf\\xac\\x01\\xe2\\xd7\\xa3\\x9e\\x1b\\xef?\\\\\\x9a9\\x1c_\\x1b:\\x0c\\x97\\x96K\\x1e\\xf9\\x14\\xa3K@\\xbd\\xdfc\\xc3d\\xfe\\xb2\\x9c\\xfbw[\\x8f\\xda0)P\\x9d\\xde\\xe3\\xf8\\x98?L\\xbbo\\x0e\\x83\\xe5\\xe0\\xd7\\xbb\\x9c\\x17\\xbev]\\xbd0\\xb2D\\x8b\\x01\\x7f\\xe1\\xeb9/kZ\\'\\xb5Y\\xd6\\x02\\xe2\\xe0\\x9c\\xfb\\x8e\\xc7e]\\xa6?\\x89\\xf1X\\x90G}`9\\xfbA\\x05\\xe3;\\\\\\xbd\\xd8l\\x94\\xd5\\xf7\\x10q}\\x06\\xff\\x1e~\\xb2\\xc6\\x85r{v\\x12\\xca\\xf9\\xeb]\\xee\\x17~\\xff\\xb8\\xbb\\xb72\\xe3UXk|]\\xbe\\xc8\\xccI\\xfbm\\x8b6\\x83\\xe8\\x97s?\\xa9\\xee\\xfe.\\t\\xed\\x87\\x9d^A(\\xe7\\x1d\\xa1\\x9c\\xa6;\\xae\\xbc\\xaa\\xdd\\xe2\\xf7\\xa5\\xf8zc\\xe5\\xaa3f\\xa5\\xbf\\xa9\\x03Q\\x02\\xeeo\\xb5\\xb0>\\x7f\\x14\\x9c\\xbf\\xfax\\x99Q\\xa7\\xf0\\xf5\\x9d\\xa1\\xc3\\xbb\\xfb\\xaf\\xf7\\x9c\\x01\\x11\\xd6\\'\\x82P\\xce[\\xca\\xfa\\xdcH5\\xf8\\xd7\\xfe\\xf5\\xbb`\\x88\\xbds\\xee\\xd7\\x08\\x1a\\x9c\\xee\\x14\\xf8\\xa8\\xfcf\\x0b\\xdb\\r\\xd2A\\xa3\\xee\\xc1\\xcf\\xd7\\xdd\\xfa\\xd6\\x0cq@\\xce\\xfd\\xc57\\x8cvc\"\\xaf\\x9fZn!\\xbd\\xed\\xec\\xbb\\xb0O\\xd5\\xd9\\xd2p|\\xadm\\xd90\\xcc\\xb7\\xcb\\xb9*\\x10a\\xbb\\xfdna\\xff\\xc0v;\\xd3\\xe5\\x92\\xc3\\xcc\\xc6kk@\\xec\\x8f\\xeb\\xdbxp\\xa0K\\x9d\\x0bO\\x7f#\\x94\\xf3\\x86TNl\\x87\\xae\\x83=.\\xd4\\xc7\\xd7\\x15\\x8en\\xba\\xd1!\\xf3\\xf6!\\x88}q\\xbb\\xbd\\xf6q\\x1c\\xa8\\xfby\\x9c\\xa5\\xe3\\xd4\\xebq\\xc5\\xdd\\xc5f\\x8e\\xde\\x83\\xaf\\x1bl-Uw\\xa1t\\xd3\\x0c\\x8c\\xca&.\\x13\\xd2\\xdf\\xb4\\x1e\\x8c\\xc7\\xa9S\\xffy\\x92\\xa7gK\\xb6$\\xd1\\xdb+B}\\n\\x97\\xdc^\\xa9C\\xf3\\x97\\xd3\\xf1u\\xf2\\xe8\\xe5\\xebN\\xd6M\\xb5\\xc18\\xa4\\x98\\xfd\\xa9\\xce\\x15O\\'\\xe2\\xfe\\x19\\xd5\\xa3\\xda7\\x85{]-a\\xe98-9ba\\xab\"\\x9b\\x8a\\xd9\\xe2\\xeb\\xcd\\xad\\xb6\\x8d\\xac\\xb6\\xcc\\xbd\\'DZ\\xba&\\xd1\\x01\\xa4\\xeb\\xd5\\t\\xa9\\xe5F\\xba6(\\x08\\x11\\xcb\\x85\\x1f\\xbd\\x8e\\xd6\\xd9/\\tl\\x9dba\\xfft\\x1d\\xd5\\xf7\\xdc\\x0e\\xfb\\xa4\\xef\\xf0u\\xfd\\xe5Uw\\xff0\\xfcJ,\\xc61\\xaevQ\\x0fo\\xdf\\xab\\x05\\xdb\\xcdR\\xba\\x86\\xed\\x16\\xe7\\xdc\\xaf\\xc1\\x18\\xe3j%D\\xdav{M\\xd9n\\xb1\\xfbl\\x97\\x8c\\xdd9\\xe7\\x0c\\xc4A9\\xf7\\xfdjVLy0\\xfa\\xa9\\x0e\\xd7\\xa7`\\xce\\xfbS\\xacs\\xb7\\x17,\\'\\xb9x\\x8d%\\x93~w\\xae\\x8c\\xaf\\r;\\x13{<\\xbc0n5D\\t\\xb8O\\xe2\\xd7\\x8f\\x08\\xe58z\\x8f\\x0c\\xf2\\x1f<\\x15\\xff\\\\f\\xe3\\x14\\xea\\x07p\\x9c\\x8e\\xf95\\xa5\\xcb\\xc0\\x99{\\xf6a\\x8c^\\xa1.\\xfd\\xcb\\xceg\\xd5\\xe08\\xb5T?\\x80\\xe348\\xe4\\xbc[\\xcd\\xed\\xf5%\\x10\\x85\\xf2kH\\x07\\x1bV,MK\\\\\\xe2\\xd9\\x06\"\\xad\\xdc\\xa6\\xe5\\xd7B\\xe56I\\x9eB\\xb9-\\x99\\xa2\\xef\\xb9\\xec^\\xab\\xed\\x18W\\xdd\\xb2\\xbb\\xb2\\xf4\\xe6>W\\xa8\\xbf\\x91\\xf8(I.@\\xfd-I\\xbf{Z\\x97\\xb4\\x99U \\xe2qzi\\xe2\\xb0\\x98\\xe4\\xe2-\\xfc\\xb7\\x08\\x94\\xdbS\\xa6\\x16(\\xac\\x7f\\xf5\\xf4\\x05\\xc6\\xb9\\x85{Op\\xcb\\xfc\\xa16-\\xbf\\xa6\\xe5;\\xd2\\xa4\\x8b\\xbf6\\xde\\x96\\xd8\\x10\"-\\xdf!\\xf5\\x0f\\xac\\xcf\\xbc\\x08\\xaeetP\\x99`\\x88B\\xe9\\xfa\\xd1o\\xe5\\xfc\\xae\\xa5$\\xbf\\xc4\\xd7\\xfa\\xe2\\x06\\x1bO\\xebsr\\x88\\x9f\\x9b\\x1eB\\x92\\xdbP\\x0f\\xd1\\xae\\x980\\xfaRI\\xbfC\\x10\\xfb\\xe4\\xdc\\xbf\\xb1\\xf9f3\\xf7\\xf2]\\x0b\\xcc\\x11\\xc8\\x0f\\\\\\xf6\\x1d\\x92$\\x0em\\xaa\\xc1X\\xdd\\xb9\\xfd\\xdaI\\x11\\x03\\xb7\\xd1\\x8e\\x9f\\x17\\x94\\xe3\\xc7\\xad\\xe9\\x88\\xeb\\xaeN\\x05\\x9aC\\x0c\\xc8\\xb9_\\xbe\\xed\\xb9\\x1di\\x13\\x9b_\\x14:_8z\\xb6\\x86\\xe3\\x91\\xa4A\\x11\\x10Y\\xf3\\xb7\\rk#\\x16T\\xb6*:\\x0e\"m9\\xb4\\xf3\\x85\\x80\\xbe;\\xbc\\x7f{\\x1dV\\xfe\\x13\\xa4l7\\xa2\\xde\\xcb\\x98\\xae\\x89\\xfd\\x03\\xe8:\\xaf\\xfe\\xc1\\xfc\\x8dDo\\xb4\\xfc\\x8d\\xb6\\x7f\\x84\\xce\\xe7lW5\\x98\\xfb\\xbcf\\xd2\\x13\\x88P\\xaf\"\\xf5\\x0fi\\xfc\\xb0\\xd6\\xab\\x1e\\x10\\xca\\x81z\\xd5\\x82\\xb3\\x8d\\x1c\\xfa\\x8e\\xad\\xe4\\x07\\x11\\xebU\\x15\\x16\\xda\\'\\xafY\\xe9y\\x9d\\xa4Wa\\xbd\\x11\\xeaU;\\x8f\\x0c<^\\xaf@\\x84\\x03\\xbe\\x1e\\xe4\\xfa89u\\xf8Q\\x05DZ\\xfb\\x0e\\xbe\\x86\\xf5\\x19k\\x8a\\x9c\\xb8\\xf8EG)\\xbe^Z\\xadSGC\\x13\\xa95\\xc4\\x819\\xf7\\xe7\\xb60URx\\xd7ml\\x16\\xc8G\\'ti=\\xb6\\xe9\\xa4\\x99Q\\x10\\xa1\\xdd\\xc5R=\\x11\\xda]\\xc4\\xd2\\x13\\xfd\\xe7\\x96\\xbc:\\xa5\\x89\\xdb\\x02\\x88\\xac\\xf9h\\x9de\\xb5\\x7f\\x91\\x1d\\xdf\\xdf\\x12\\xa3GdW\\xf5]\\xbd\\xcb\\x7fp\\xbb\\xcdy8\\xce\\xa3\\xb5[7\\x1bK\\xf5\\x90w\\xf5\\x07\\x1e\\xef8\\xf2\\xdcq|=\\xadN\\x86CM\\xd7\\x01\\x15 \\xfa\\xe6\\xdc\\xbf\\xb0\\xaa\\xd0\\xee\\xa9\\xfb\\xc2\\xe7\\xcd\\xb3\\xb0\\xdd\\x82\\xdf\\xd9U\\x8b:Y\\x9b\\xc3\\xd7\\xc6\\xea\\x15L\\xa6\\xf2\\xaeR\\x8c\\xb7\\x9aU|\\x90\\xb0\\xdf\\xe5!\\xeby\\xa3{`\\xdf\\x89J\\xee\\xea0\\x88\\xb4\\xfc\\x80\\xa4\\x87@~\\x90i\\x7fZ\\x13P\\xee\\xa4-D\\\\N\\x85\\xa9u\\xdf\\xdc~\\x16t\\x94T\\xceKB9\\x90\\xde\\xbc\\x1fT\\xbcQi\\xc4Y;\\x88\\xb4\\xe5\\xe0k\\xc8wX\\x97C;~\\xfa\\r\\xab\\xddl\\xed\\xe1.\\xfb \\xb2\\x9e7.,\\xe9\\xb8\\xca\\xeb\\xd7\\x92+ J\\xc0}R}\\xdeQ\\xf6\\x0f+{<,\\x07\\xda\\xe3\\xfd\\x9d\\x9a\\xbft\\xf7\\xeb\\xeb\\x8b\\xb1\\xe1\\xb1\\xdbK\\x96\\xbc\\xb0QC}t\\x91\\x85\\xfc\\x80\\xd6\\x1e\\xff\\xb9\\xd9aIr\\x0e\\xdaa}/6{qy\\xfe/3 B~\\xed\\xd3\\xdd\\xa1\\xf6\\xf3m\\t\\x12\\xda\\xfe\\x81\\xfcZ\\xe8<\\x8bV\\xaf\\x12\\xaa\\x8f\\x92\\xecbP\\x1f\\x15j? \\xf1\\xd1\\xfc\\xb2\\x1fh\\x923.T\\xdb\\xb2\\xeb6D\\xd6rN\\xa8\\x9d\\x82D\\x07P\\xce\\t\\xd5{\\x9f\\x13\\xca\\x81rn\\xad\\xef\\xb1\\xd1\\xc5\\xa2<\\xcea\\x1c?-\\xfe\\xe2\\xddz\\xeeo-]\\x07\\x84\\xf2\\x07\\xd2A\\xda\\xdcE\\x7f>\\xef3\\xa9:D\\xd6t\\x10\\xe23m\\xf2owO<\\xc28\\xb9\\xf3\\x99\\x08;\\xf7qo\\xa0^e\\xe9: \\xd4\\xab,\\x9d\\xd7\\xe3\\xf9\\xc1\\xb8<\\xec\\xca\\xfft\\x1e\\xfc+(g\\x82\\x85\\xe5\\x885\\x0f&\\xcd\\x1ba}\"\\x08\\xedF\\xab_\\x8be\\x7f;\\xf7\\xbc\\xe6\\t\\x9bt\\xbb\\x08\\x88\\xd8^\\xb5\\xa0\\xe1_5\\n\\x7f3\\xc1.\\xd1B>:\\xeb\\xac_X\\xb7k\\xdbJ\\xe0k\\xa1\\xfc \\x93\\x92\\x1fl\\xa9\\x1eb]\\xc9l\\xf7\\x08\"\\xad\\xfd\\x8d4\\x0ff\\xadW\\x91\\xf4\\x03\\xa8W\\x9d\\x88\\xdf\\x11\\xb4n}\\x91\\xe1\\x01e\\x9e\\xd6K6x\\x96~~\\xd5\\\\=\\xb1Y\\xe59B\\xd75k\\x1e\\x0ciZ \\xaaJ%|}\\xb7\\xae\\xb7ar\\xd0\\x96\\x93\\x18\\x0f\\xc6?\\xb3\\x9fXVz\\x15\\xf2\\x1dK\\xf5^\\xc8w\\xc4\\xf2\\xa7\\xe8x=eLF\\xd1\\x0c;\\x88\\xac\\xfd)\\xc4\\x9a\\xd7O,!{T\\xf1TR0D\\xd6\\xf3z\\xa1\\xeb\\x9a$>\\n\\xeb3\\xf0G\\xd3O\\x07_\\xfaxA\\xc4\\xe3\\xa7\\x84\\xf7\\xcaZ\\xda]\\x9b]-\\x9d\\x97\\xc0r\\\\S\\x1eV\\x91\\r\\xef\\xd7\\x14#\\x1c?\\x15\\xdeV\\x88\\xbb\\xd4\\xb7kj\\xb2\\x85\\xed\\xe6w\\xeeO\\xaf\\x81\\x0f\\x9f\\xf4\\xc3\\xd7E\\xba\\x0cZ\\x9b>\\xe1\\xd5D\\x88P\\x7f\\x9bma\\xbbA\\xfdM\\xac\\xf1\\xb3\\xa0OFZ\\xd2\\xa8BE!\\xb2\\x1e?\\xb4\\xf3\\xacm\\x16\\xd6\\x07\\xce\\xb3V\\xfc\\xdcq\\xeb\\xb3\\xe6\\xabL\\x10Y\\xeb\\xd7\\x17\\x0b\\xad<\\xd2\\xeda\\xdc8\\x8cMN\\xdf<U\\x7fP\\xf8\\xcf\\xac\\xf5k\\x8f\\xcc\\x05sk\\xd84\\xf0\\x86Hk\\x0fyB9N\\x85\\xda]h\\xf9\\x81X\\xf6\\x9d\\xd9\\x8b7\\xca\\x16\\x07-)\\x0518\\xe7\\xbe\\xb6\\xe4\\xa4S\\x9e]\\x12\\xfc\\x97\\x11\\xca\\xf9\\x83\\xb2>\\xb5\\x1a\\xed=g\\xdfi\\xf3Y\\x88\\xac\\xf5\\xd1-\\x87g\\\\};&e0D\\xda\\xf5\\x12Z\\xb9\\xf0X\\x928\\xfeH\\xe7]\\xc5 \\xd2\\xda\\xabh\\xd7\\x9d\\x85\\xf6\\x0fi\\xbd\\x04\\x96\\xd3\\xf3A\\x85\\xe8\\xf3v%| \\x06\\xe4\\xdc\\xc7z<\\xa9\\x9c\\xfb\\x94\\xed\\x16P\\xfd\\xc6\\x95\\x95E\\x0e>\\x81H\\xab\\xf7\\xde#\\x94\\x03\\xf5\\xde\\xdfvy\\x0c\\xd8f\\x1c\\x9b\\x01\\x91\\xb6\\xdd\\xf0\\xeb\\x7f\\xad\\xf7\\xd2\\xda\\x13i\\xfd{\\xb7[H\\xd7_\\xfd{?\\x0f\\xff^\\xd2\\xfa6\\xf4\\x13Ri\\xc7\\x9b~8\\xb9|%D\\xd6~v\\x9b\\xbb\\x8e\\xbc\\x95f\\xfb(\\x11\"\\xad}\\x94\\xb6\\xdd\\x84\\xfa[\\x92\\xca\\xf9\\x84\\x8f\\xbe\\x91\\xddT\\xf6|P\\x1f\"\\xeb\\xfa\\x08\\xa5\\x03R9\\x90\\x0e\\x16F\\x84l<\\x15\\xfen\\x19D\\xd6rN\\xac\\xfa\\xcc\\x19]{\\x99\\xdc\\xb7h#\\x88_j}h\\xf9\\x8e\\xd0u\\x0c\\x97>6=\\x17\\xd7\\xdb\\xdc\\x07\"k\\xff\\x10\\xb1\\xda\\xad\\xcc\\xce\\x86\\x93\\xf7Uz\\xd1\\x1a\\xe2\\xd7v\\xfb\\xef\\xedV\\xe3\\xecQ\\x9d\\xf3\\xfd[\\'0\\x16\\xcc\\xdcbHXV\\xb4\\x00\\x9cgY\\xdanp\\x9eE\\xdb?B\\xdb-\\xf9D\\xb2\\xe6\\xc87A\\xab!\\xe2v+\\xdb\\x81k[|\\xe7\\xf0tK\\xdbMuc\\xd5\\xaf{No\\xba\\x8c\\xaf\\xed\\xf6\\\\|\\xe7\\xb3\\xc9\\xe6g\\x88\\x019\\xf7I\\xf6xK\\xed\\xd7b\\xd1\\xc1\\x08\\xe7\\xb4\\x97\\xd7\\xa6M\\xee\\x04\\x11\\xd6\\'\\xbf\\xf9(I\\x0f\\x81\\xf5iQ\\xed\\x9e\\xe4d\\xf3\\xda\\x05!\\xc2\\xfa`\\xba\\x86\\xfdC\\xb2+\\xc3\\xfa\\xbc\\x980}\\xe1\\xae\\x83\\x03\\x13!\\x92\\xca\\xf9\\xa7|gn\\xdc\\xd92/\\'\\xc4\\xbaA\\x84\\xe5X\\xea\\xa7\\n\\xcbY\\xb2g\\xf3\\xc8i\\xdb\\xbd[B\\xc4\\xfdcs\\xb7\\xd0\\xc2\\x15\\xbf\\xb6\\xaem\\xe9\\xfaB\\xe1\\x96\\xfb\\xae/,\\xc2\\xe1\\xe9\\x8d\\xe0u\\x8c\\xab\\x84r\\xe0|n\\xc6\\xdcs\\x1e\\xd5\\xcc\\x037A\\xa4\\xd5\\x13i\\xd71.\\xae\\x8a\\x91\\xdc\\xe8\\x7f\\xe0\\x07\\x88\\xb8\\xc2\\xd8\\xfef\\xa9\\x9e\\xa8\\xff\\xf3\\x8f\\xab\\x8d\\x8f\\xe9+\\xe2k\\xb1\\xe6\\x8d\\'}\\xa6\\xc6\\xa9G\\xf5\\xaf\\x8f\\x11\\xc7\\x03\\xb2\\x8e\\x0b\\xfd\\x1a\\x0f\\x98\\xfbE\\xcbG\\xc7\\x99Co^.2\\xe7\\nD\\xd6\\xed\\x96Z\\xd4\\xa6\\xd1\\xc1\\xa9[&b\\xbc\\x90z{\\xbf\\x87\\xbf\\xf1(\\xc9\\x9f\\x8f6n\\n\\xea\\x07b\\xc9m\\xd7\\xfe\\x01\\xbf\\x97\\xd3\\xb7[\\x0c\\x91v]\\x93$\\x17>\\xb1\\xef|fz\\xd5\\xaf\\x84\\xfa\\xd0\\xfa\\xc7\\x0b\\x95\\x0b$?\\x14\\xd6r\\xe1\\x19\\xa1\\x1c(\\x176\\xd8\\\\\\x8d\\xdc\\xdb~\\xc2\\x16\\x8c0\\xae\\x8d\\x95\\xbf\\x8bX\\xeb\\x9a\\xb4\\xfeoB\\xd75\\xc5\\x1a\\xa7\\xd8\\x9f\\n\"-]\\xd3\\xd6\\xa7\\xdb\\xb7\\xdbl\\x0f\\xae\\x8e*\\x84q\\xcb\\xc8DE\\xe99\\xc7Z@?\\xd5]\\x16\\xd6\\x07\\xfa\\xa9\\xb6\\xfe)d\\xc7YM\\xf4]\\x88\\x90_\\xcf\\x15\\xc8\\xaf\\xadO\\x84\\xb8V\\xfc\\xbe\\xd7B\\x88\\xac\\xedUB\\xf9\\x01\\x89\\xef@~\\xb0\\xeft\\xe9G\\x8b\\xcf\\x0f\\xbe\\x0810\\xe7\\xbe\\xc7\\x05\\'\\x87\\xe7\\x0b\\x9c\\x9e\\n\\x8d\\x03K\\xb8:\\xefe\\xe3?fL\\xc5\\xd8\\xf4\\xe4o\\xdfu\\xefg.\\x02\\xe9\\xe0\\x17K\\xf9\\x1b\\xa0\\x03}B\\xd3\\x8e\\xaa>\\x15\\x0eBd\\xbd\\x9euHSQ1\\xe2\\xde\\xeb\\x85\\x10\\xa1\\x9c\\x8b\\x13\\xd8nS\\xae\\xf9\\x9e\\xb9\\xd1\\xe1\\xe2:\\x8c8\\x0e\\x99\\xd6\\x7f\\x94\\xd6_\\xf9f\\xdc\\xbc\\xeb\\x1b\\xfcF$C\\xa4\\xe5\\xa3X/\\xc9\\xab>\\xab\\x9a\\xdexv\\xc3}\\xca\\x11\\x88\\xb4\\xeb\\xdb$\\xfd\\x00\\xaeo\\x8b\\xe5\\xaf\\xac,\\x1c:h\\xd4\\x8d\\x9d\\xf3 \\xd2\\xca\\x05Z\\xfd@\\xac\\xb8w\\xa1\\xf3\\x1f\\xd2|\\x0e\\xce\\x7f\\x84\\xc6\\xd7\\x93\\xe8\\x00\\xc6\\xd7\\x8b5N\\x17\\xcf\\xda^\\xb1@\\x85\\x8a.\\x18/\\xfe\\xbc\\xfb\\xdc\\x8a\\x07)uY\\xc7c\\x08\\xcdOAj7\\x98\\x9fbZ\\x99s\\xb7\\xadR\\x9f\\x96\\x84\\xc8\\xda\\x0f\\x85V\\x0f\\x11\\x1a\\xe7*t\\xfc\\x90\\xc6)\\x1c?B\\xe7\\xdb\\x85A\\xfb\\xe1W~\\xcd\\xb7+\\xb7T,oU<s7D\\xd6\\xf3m\\xb1\\xfcT\\xd7{\\xdb\\x9a\\xf4\\xfd\\xc66\\xc4\\xfc\\x06_\\xe7W\\xfe\\x1d\\x92\\xbeS\\x96PN~\\xe5\\xdf\\x11\\xba\\xbeM*\\x07\\xd2u\\xc6\\xcdV5\\xaf\\x8f\\xa8\\xb2\\t\\xa2P;\\x1f,g\\xdb\\xc6\\xde{\\xaf_\\xef^\\n\"\\xeb\\xfa\\x88\\x95Oh\\xf2\\x85\\xcb\\x01\\xb5w\\x1a*`\\xbc\\xbf\\xad\\xb4\\xb1\\xd0\\xa9j\\x97X\\xc7\\x85\\n\\x9d\\x9f\\x92\\xe25\\xe1\\xfcT\\xa8\\x7f/\\xc9\\x1e\\x0f\\xfb\\xa7\\xb0C\\xc5\\x15\\x19\\xc7\\xbat\\xc5\\xd8\\xf8`\\xad\\x136\\xa36\\xef\\xa0m7\\xda\\xf1#4\\x1e\\x904\\xff\\x81\\xf5\\xb1\\x9b\\xfb|`\\xbd\\xe1>\\xeb0f\\x16\\xcc,1\\xac`\\x91\\xe9\\xac\\xeb#t\\x9d\\x894_\\x80\\xebL\\x9d\\xfelt\\xf7\\x8a\\xff\\xe1\\xa1\\x10Y\\xeb!x\\xbc@\\x84r\\xceR\\xbb?\\x94s\\xb4~\\xde\\x96\\xea\\x89\\xd0\\xcf;\\xba\\xc3\\xf5G\\xe7\\xac\\x17\\xdbA\\x0c\\xc8\\xb9\\xcfj\\xdd\\xec\\x95S\\xf0\\x91{\\xeag\\x1a\\x88\\xb0\\x9c\\xf9\\x02\\xf5\\x03\\xb7\\xa1\\xa7\\xabDM*X\\r\"\\xcc\\x83\\xd1/\\xf6TR\\x1a\\xe7\\x90\\x84\\xe9kV\\x1evr\\x98\\x07C\\xa8\\xdd\\x85T\\x1f\\xd6vX\\xd2:-\\xd4G\\x85\\xca\\x1f\\x92>\\n\\xe5\\x0f\\xed\\xf8\\x89\\'\\x94S(\\x07\\xf3\\xa2\\x83\\xf8\\xd8\\xf1\\xbd\\xc7\\xba\\x0f\\xbb\\x04\\x11\\xb7\\xdb\\xb8w\\x93\\x1c\\xacF\\xbdp\\xb3\\x94\\xef\\xa4;\\xbf\\xd1\\xbb\\x8clm\\xc6\\xd7\\xb4\\xf6\\x03R}h\\xd7\\xb7\\xf3\\xaa\\x8f\\xadym\\xc9\\x88k]v[\\xeaO\\xee\\xadL\\xf6\\xf8e\\xd1\\xbd}\\xf8z\\xda\\x99em\\x8a\\xc6\\xef\\x8f\\x81\\xc8\\x9a\\xbf\\xf9\\x1fJ\\xdf\\x13^x\\xe4K\\x8c\\xad~\\xa9ulT\\xab?\\xfa\\xb3^\\xd7\\x1c\\xb8\\xc6ih9G_G\\x88\\xac\\xf5\\xb7/%\\xaf!i\\x1e\\xcc\\xda\\xbe\\x83\\xaf\\xf3\\xb2\\xef\\x885\\xcf\\xca\\xcb\\xff\\x9a\\x95\\xdd\\x85\\x14\\x7f\\x8a\\xf5\\x10yJ\\x92\\x97\\xfd\\xc3\\xad\\x87-\\x9dg\\xc1\\xf8S\\xb1\\xe6%B\\xe3vI\\xfc\\x1a\\xc6\\xed\\x1e^\\xb4\\xfeE\\xdf\\xa5\\xe3<1\\x16\\x08;\\xd9p\\xf3>\\xddP\\xd8?$\\xfd\\x8d\\xc4\\xafa\\xff\\x8c>\"\\x97\\xd4\\xae}\\xf9\\x02D\\xd6\\xf6^Z{\\x95\\xd0r2\\xba\\x15\\x1a\\xd5v\\xccOC1>(7\\xad\\x9e\\xdf\\xc3\\x11si\\xf5x\\x92~\\x90_~\\x01b\\xe9\\xa3B\\xd75?7\\xffQ\\xbb\\xd0\\x12\\xb6\\x13N>h\\x8eQ5q\\xc5\\xfd\\xa9\\x15_\\x05\\xd0\\x8e\\x1fR\\xbb\\xc1\\xf1\\xa3\\x9c\\x7f\\xf8\\xe9\\xbczo\\x15\\x18\\xbb\\xbd\\xab4\\xb1\\xc7\\xd5\\xe5ui\\xe9\\x8d\\xe4\\x17\\x00\\xe9M,\\xfe\\xf6\\xb9\\xd1\\x9bP\\xfb\\xa8X\\xf46\\xbag\\xc8\\x12\\xd3\\xb7\\rZC\\xa4\\x9do\\x93\\xe4\\x02\\x9co\\xf7\\xfc\\xb9\\xd5\\x85\\x05\\x83\\xcd\\x9e\\x10i\\xcb!\\xc9\\x05X\\x8e\\xd0v#\\xe9\\xf1\\xb0\\xdd::\\xfa\\xd6\\xabj\\xed\\xa1\\x81\\x98_\\xeb%\\x96\\xe6\\x13\\xca\\xaf<%\\xd2\\xfeK=\\x1bO\\xbb9\\x19\"\\xebv\\xfb\\xa3\\xe6k/\\xab\\xfa\\xaf\\xabA\\xc4\\xe5\\xb8\\xf6Yu\\xe3\\xc0\\xf8\\x03\\x05-]G\\x0f{\\x11\\xfc\\xd8\\xdfs\\xc9\\x0e|-\\xd4~\\xf0\\x94P\\x0e\\xb4\\x1f\\x08\\x8ds\\xbdE(\\x07\\xf2Q\\xb1\\xe2\\x0e/=Zl(\\x96\\xe8W\\x05\"m\\xdca\\x1a\\xa1>0\\xeeP\\xac\\xb86\\xa1v\\x17\\x12\\x7f\\xfb\\xa7v\\x97/E\\xef\\x9d\\xb87\\xb2\\xc2\\xb3s{m1\\xfef<\\x9ctb\\xe2\\xbc\\x99\\xb4z\\x08i\\x9d\\x16\\xea!\\xff\\xb6\\xf5F\\xday0\\x89\\xbf]$\\xf1\\x1d\\xc6\\xfe\\x07$\\xfd\\x00\\xd25\\xf6\\x9f\\x80\\xc8Z?8\\xaa\\xac\\xd5\\xbf\\xc3\\xa5\\x19\\xc5!\\xb2\\xf6G\\x12j\\xb7$\\xd1\\x01\\xb4[&\\x95\\x89m\\x94\\xf9\\xf2\\xc0.\\x8c>\\x99*\\xeb\\x8cC\\xdc \\xda\\xf5`\\xday\\xa3P\\xbb%\\x89\\x8fB\\xbb\\xa5X\\xfb35.\\x19ougg\\xe6z\\x88\\xac\\xf5\\x10\\xa1\\xfe!$\\xfe\\xf6I\\\\A\\xe4\\x96\\x1f:\\xad\\xf3\\xeb\\x88\\x11\\xfa\\x1f\\xe0<Y\\xa4|B\\xa4\\xfe\\x81y\\xb2\\xc6}\\xff\\xdc\\xb1\\xda\\xc0\\xeaa\\x18\\x13\\x15\\xd7\\xea\\xec\\xf2\\xf6\\xf9d\\xddY\\xa8\\xffA\\xfb\\x04\\xb7r\\xe6uG\\xde@d\\xbd\\xff\\x0fm~1K\\xe9\\x00\\xb6[;\\xf9\\xf7\\xa3g9NO\\xc1\\xf8\\xbdm\\x99\\xa0\\x9e\\x83\\xee\\xfb\\xb1^\\xaf\\x17k\\xdeX\\xfa\\xcc \\xbf\\x98\\xef\\x9a\\xdd\\xc3\\xd8\\xa9\\xd2\\xe8\\xefn+\\xcf\\x9ca\\x9dw_\\xac\\xfa\\xac\\xdb\\xfb\\xae\\xf9&\\xf7\\xc9C0\\xb6\\xba\\xbd\\xaf\\xf6\\xfeFE\\xd4_j}\\x1e\\x06\\x16\\xa8}\\xf2R\\xa1\\xf3\\x10Y\\xf37Z\\xba\\xb6t\\x9e\\x95_\\xed\\xd6\\xbd\\xda\\x8a\\xf0ag\\x1e\\xed\\x84\\xc8\\xba\\xddp;A\\xfcR\\xe3\\xde\\x93\\x06\\xac\\xf4\\x9c3*\\xa86\\xc6Zu\\xaf\\x05\\xba\\xbe\\xaa\\xb8\\x84\\xf5\\xf8\\x11+\\x0f`\\x0f\\xd5\\x95\\xa6\\xef\\xee\\r\\xf0\\xc0h\\x98\\xbf\\xf5\\xf0\\xd4Q\\xb3\\x7f\\xfa\\xdc\\xfcj\\xd2)\\xfbG\\xa8<}H\\xd9nb\\xe5\\x8b\\x16\\xda?b\\xf1kR\\x9e,\\xd6\\xfds\\x97\\xb2\\x7f\\xeco\\\\\\xbdZkV\\xe5\\x10\\x8c\\xb5\\r\\x07\\xe6\\xa4\\xfex\\xc0\\x93\\xb9\\xff[R\\xd7\\x1b\\xe1\\n\\x87\\xea\\x18KL\\xd8]\\xbd\\xb0\\xacIC\\xd6q`b\\xf9\\xa9\\xdejw\\xe0\\xa5\\xb3\\xf5\"\\x19D\\xd6\\xf6\\x90\\x9f\\xca_L\\xd8t\\xbe\\x9e\\x17Dy\\xce\\xfdI/\\xedR\\x96/\\xdcv\\xc6R\\xba\\xde\\x18\\xda\\xdc\\xba\\xd9\\x8bb\\x97\\xf05\\xc9\\xff\\x00\\x96C\\xa2\\xebu\\x94\\xe5\\x08\\xcd\\x9b\\x97D\\xd9?_\\xf3\\x1a\\xe6~\\xad\\xa6l7\\xa1\\xfd\\xb3\\x8a\\xb2\\x1c\\xa1y#VR\\x96\\xd3\\xdeq\\xd0d\\x7f;\\x9bZ\\x18;\\x0eH\\t\\x1ex:y2\\xeby\\xb0P\\x7f\\n\\xa2=\\x11\\xf8S\\x88\\x95\\x87\\xc9\\xf6r\\xda\\xd8N\\x7fnJ\\x83\\xc8:.\\xe7\\xdff\\x87=\\xd0\\xe9\\x99W\\xc4\\x0f/\\xd7b\\x94\\x7fo\\xdd\\xb6\\xc3\\xf8\\xe7\\x12(\\xe7H\\xfb\\xcbD\\x13\\xda\\r\\xca9\\xb1\\xd6e\\x06\\xca\\xa6\\xd9m>{\\xc8\\x0c\\x91u>H\\xb1\\xe6%\\xbf\\xf7u\\xf7)\\xfc\\x1f\\xa7\\xea\\x10Y\\xc7\\xf1\\x8b\\xb5\\xbf\\xcc\\x97\\xb2\\x9f8)\\xee\\xe3K\\x8dg\\xfa\\xdc\\xf6\\x13\\xc7q\\x1e\\x10Y\\xfb\\xa1\\x08\\xf5S\\x8d \\x94\\x03\\xfdT3N\\x87(\\x1eF\\xac\\x9f\\x0110\\xe7>\\xee\\x9f\\x98<\\xd6\\x7f@w\\xe4\\xdb\\xfe\\x18b\\xc9\\x1f{/;\\xe7W\\xb1=\\x82!\\xd2\\xc6\\x1d\\xe2\\x8d6\\xf2\\x1a\\xa7b\\xe9;\\x15\\xee+\\x1b=\\xab\\xd3\\x9c\\x83\\xc8\\xda~\\xb0\\xb6\\x9d\\xed\\xba\\xe7\\x1b\\x9d\\x8ea\\xecm?\\xb7]\\xc1\\xb4\\xa2cX\\xe7\\xc3\\xffR\\xfc\\x0fH\\xfd\\x93_\\xfe\\x07\\xb4\\xfb\\x81Y\\xba/\\x1c\\xec\\x1f\\xa1y\\xbfh\\xe3\\x0e[\\x1c\\x199\\xf6\\x8fy\\r\\x07Cd\\x9d\\'\\xabeDF\\xa9\\xdb\\x17&\\xc6Cd\\xbd\\xcf\\xf7\\xca\\xe5;\\x95\\x97\\x1d\\xd3\\xd7A\\x84\\xe5\\x90\\xe6Y\\xb4y\\xf7\\x85\\xeaU\\x7f\\x12\\xcaa\\xadW\\x91\\xfa\\x07\\xf2\\xebr\\xc6\\xd5\\xa9\\xbf\\x17\\xf7\\xb3\\xdf\\x10\\xb9\\xc8\\xb5\\xc4\\xfeVE0b=\\xfe\\x9f\\xe6\\xa7(\\xfe$\\xf6\\xd0\\xb0\\xb7e;\\xbf\\xff=\\xc1o\\xaa%>\\x1cX\\x0cc\\x85\\xd5\\xf1\\x7ft\\xbeR\\xe86\\xad\\xfe\\x96Ah7(\\x17\\xeeq\\xfb\\xcb\\xda^\\xfb\\xfd{\\x8c#\\xc2\\x1b\\x0f\\x0b>\\xb2\\x80z_\\x11\\x12\\x7f\\xcb\\xaf\\xf8S\\xb1\\xf4\\x03\\xb1\\xf4x_\\x9b\\xf8KI\\xd3\\xfb>\\xc2\\x98\\xf6\\xb6\\x9d\\xcd\\x9b^\\xad\\xde\\xb1\\x8e\\x97!\\xe5\\xeb\\xa4\\xd5\\xdfh\\xf9\\x9b\\xc37\\xe9\\xa5\\x8eV\\xb4\\x9d\\r\\x91\\xb6\\x7fH\\xed\\xb6qB\\xef\\x11\\xce\\xf5wM\\xc5\\xd7\\x95\\xdf\\xae1\\x065}\\x93\\x86\\x91\\x14\\xb7k\\xe9\\xbe\\xb10n\\xf7\\xec_Nw\\xf6d\\xde\\xdd\\x84\\xd1\\xafI\\xeb!S\\xa7\\x1fk\\x0f\\xfdT-\\xdd\\x9f\\t\\xfa\\xa9\\n\\xb5\\x1f\\xd0\\xf6\\xcf\\xb7\\xe7z\\x9f[\\x1e\\xd3B\\n\\x91\\xb5\\xfc\\x11\\xba\\x8f\\x1a\\xc9\\xaf\\xe6\\x9f\\xee\\x03%t\\xbf\\xdd\\x84\\xe7\\xbe.I\\x0f\\xa6\\xdc\\x82\\xf8\\xa5\\xe6\\xdf\\x11\\xcb\\xefI\\xac\\xbc8\\xe7\\'\\x9bz4\\x9cQ\\xeb0D\\xd6\\xf3m\\xb1\\xec|X\\x0e@\\x84\\xe3\\xc7\\xd2}l\\xe0\\xf8\\x11k^\\x92Z|\\xcd\\xa8\\x1fZ\\x8d_\\r\\x91\\xf5\\xf8\\xf1Y\\xe07\\xe7.w\\xb8\\t\\xc6\\xb3q\\xa5\\xdb\\x1d\\xd8\\xb0p;\\xeby\\xa3X\\xfb\\xd8,_\\xb4f\\xa3C\\xec\\x9c`\\x88\\x90\\x0eHz\"\\xc9n\\t\\xe9`a\\xc3B.n\\x0e\\x0f\\xfacL\\xfc\\xb9\\xef\\xa2\\xc1\\xb6K\\x96\\xb3\\xd6\\x13\\xc5\\x8ac1W\\xef\\\\r\\xe3\\xaaT7\\x8cMb\\xf6\\xfe>\\xec\\x873\\xabY\\xfb\\xbb\\x88\\xc5G;\\xf7Z5/2r\\xfa\\t\\x88\\xac\\xe5\\x9cX\\xe34\\xf3\\xc6\\xd8\\t\\x8f\\xd36\\xae\\x82H\\xcb\\xafi\\xe5\\x9cXy\\xc3\\xdf\\xfa\\xdb\\xb69\\xbc\\xa1uu\\x88P\\xef\\xb5\\xd4o\\xa3W\\x9ffGz\\xa7\\xf6+\\x89\\xaf\\x85\\x8e\\x1f\\xa2\\x9c\\x03\\xe3\\x87\\xb6\\xdd,\\xf5\\x7f\\xcb/{\\xbcc\\xbb\\xd9[\\x83/\\\\|\\x0b\\x91\\xb5~ \\x16\\x7f\\xdb\\xeeS\\xb2\\x9d4\\xfcl\\x1aD\\xd6\\xe3\\xb4YIW\\xff%\\x95\\xff\\xea\\x87\\x91{\\xf6\\xebZ\\xf3\\xf6\\xf67X\\xfb\\x8f\\n]\\xc7 \\xc5\\xcb\\xc0u\\x0c\\xda}\\xcb\\xf3\\x9a\\xff\\xc0u\\x0c\\x987\\xe2a\\xd9r\\xfb5>\\xab\\xa3!\\xb2\\x8ec\\xc1\\xebq\\x10Y\\xdb{7\\xcd\\xb0Y\\x13V\\xf8\\xe5x\\x8c\\xf1\\x87\\x9ft\\x99\\x129a\\x0b\\xa4\\x03\\xd2\\xbc\\x1ewt^t\\x80\\xfdf J\\xc0}\\xa1\\xfb\\xc6\\x16\\xef\\xba3\\xb2\\xec\\x15\\xe7:\\x10Y\\xe7[\\x17+\\x9f\\xc3\\xca\\x8cV\\xf3G\\xefL\\xfb\\x13\"\\xec\\x1fK\\xeb\\x93_~\\xden\\xeeWj\\x1cJ\\xbf4\\x19\\xe2\\x97\\xea\\xef\\xbf\\xab\\xd3\\xd2W/\\xe7\\x9f\\xdf\\x06\\x91\\xb5\\xdd\\xe5h\\xa3c\\xb6V[\\xc29\\x8cI\\xdaa\\xd7\\x8f\\x98Z~\\x12\\xafI\\xa2\\x03\\xdax3\\xb1\\xdaM7\\xbe@\\xe3\\xae\\xcf\\xde\\xfc\\x88qZ-Yr\\xd9U\\x1d\\xe4\\xac\\xe9@h\\x9c8\\xa9>0N\\\\h\\xbb\\x91\\xf2z|b\\'?6\\xf2\\xbc\\xeb\\xa1\\x94D\\x8c\\x13\\xf7F\\x1cr\\x9d1\\xa6;m\\xbb\\x91\\xd6e\\xf2\\x8b\\x0eJ\\x95\\x98\\x17\\xa9\\x92\\x04* ~\\xa9\\xfc@\\xac}R\\x1c\\xea\\xd7\\xabQ\\xbc\\xdd\\xe5\\x06\\x10i\\xe5\\x1c\\xd1\\xef\\t\\xc89\\xb1\\xf2\\xc8\\x9c\\x0f\\x1c05t\\xb7\\xc7\\x11\\x88\\x019\\xf7\\xf3\\xca#C\\xd2\\xab`}\\xc4\\xda\\xaf\\x00\\xc7\\xd3Cd=\\x0f\\xbe\\xf2S\\xd7=\\xb56\\x96\\x90@|\\xbf^\\xb2\\xd0>y\\xcdJ\\xcf\\xeb\\x96\\xda-w\\x1e\\x19x\\xbc^\\x81\\x08\\x07|\\x8d\\xd7a \\xe2r\\xb0\\xbd\\xca\\xd2\\xf5,\\xd6v\\x7fZ\\xbb\\xf2\\x8a\\xb1\\xeb\\xb6\\xedNJ\\x9b\\x00\\x11\\xea\\xf1\\x96\\xe6Se\\x9d\\x17\\x87\\x96\\xef\\xb4\\x9c}bU\\x81&\\xc7\\xc3!\\xb2\\xf6\\x8f\\x17\\xab>\\xa1I-\\x96ni}\\xcf\\x15c\\xaf\\xc0\\x16n\\xd3\\x93z\\x8f\\xfdR\\xe5\\xc2fm\\xa3\\xc8\\xc8&\\x91W0\\x8e\\x9f\\xa7;\\xed\\xfam\\xe9\\xb7\\xac\\xeb#t\\xbeM\\xda\\xf7\\x12\\xce\\xb7\\x85\\xc6/\\x14\\xc9A8\\xdf\\xce\\xaf\\xfcb\\xb4\\xf9\\x95\\x85\\xce\\x1b\\xc5\\xca\\xafL\\x9b\\xff\\xda\\xd2ug\\xb8\\x8e.\\x96_M\\xcaw\\xf5\\xa6\\r.\\x1f\\xfa+\\xc6\\t]Z\\x8fm:if\\x14\\x8c/!\\xf9\\x05`C+,\\x07\\xc6\\x97\\x8co\\xd9\\xff\\xe8\\xceKS\\xdf`$\\xf9\\xa1\\xcc/{p\\xf8\\xde\\x9bE\\xbe\\xa3\\xe5\\x07\\xd5_\\x0e\\xbcq\\xa5Z\\xb9\\xee\\xf8\\xda\\xb3\\xd8\\x00\\xbd\\xfa\\xda\\x0cw\\x88\\xac\\xed|-\\x03}\\x074\\xbf\\xfe\\xb8(D\\xd6\\xeb\\xceM\\x96\\xbaO\\xab=mcw\\x88\\xac\\xf5\\xc4\\xa2\\x8d\\x0c\\x8d[\\xd5\\x0b\\t\\x82\\xc8z\\xbe=\\xb2\\xb5\\xbd}\\xb3\\xdd\\xff\\xa9\\n\\x11\\x96c\\xa9]\\x99v\\x1f\\x0e\\xd6\\xf3\\x85n\\xc1\\xb7\\x8b\\xff\\xb0v\\xed;\\x8c\\x85\\xb7zxHk\\x9e/E\\xbb\\x0eH\\xf2\\xb7d\\x9d\\xe7\\x94\\xc4w\\xa0]L\\xac\\xfd\\x83\\xdfT\\xa9\\xb2z\\xf0\\xf4Z\\r0\\xda/\\xdd\\xbf\\xa0\\x8e>r \\xeb<\\xdbB\\xfd\\xbc\\x89\\xf5\\x01~\\xdeB\\xfd\\xafi\\xf5\\x10\\xa1\\xfbp\\x88\\xb5\\xceD\\xeb\\xe7P\\xdc\\xb1F\\xc2X\\xb7\\xe4X\\x88\\xac\\xf9u\\xa8V/\\x7f\\xb5\\xe8\\xf8\\x1c\\x88\\xac\\xe7\\x8dB\\xf5^R\\x9c\\x11\\xd4{\\x85\\xee\\x13I\\xdc\\xef\\x1d\\xac\\x9b\\x89\\xe5\\xff&M\\xba\\xf8k\\xe3m\\x89\\r!Z\\xba\\xefX^\\xe5\\x94\\xb1qn\\xac\\xc9\\x9c\\xa9\\x81\\xc8z\\xff\\xd3\\x7f\\x9b\\x7fo\\xdfe\\xc1iqU6z\\x95\\xa9\\xba\\xac`\\xd5\\xb9\\xe5\\xff\\xc2\\xd7B\\xed!\\xb1\\xaa\\xd0\\xccF\\xae\\xd3\\x0e\\xe2\\xebp\\xae\\xf6 \\xe9\\x86\\x1e\\xbe\\x10i\\xfdwH~\\xde\\xd0\\x1e2\\xcbh\\xbcQT\\xbaV\\x85qa\\x82\\xfb\\x80]\\xf6N\\xf7a\\xbbY\\xea\\xbfSu\\xfd\\x89\\xae\\xa9\\x1b\\xdb\\x1e\\xc3\\xd7B\\xf95\\xad\\xbe#\\x96\\x9c\\x1b?-\\xfe\\xe2\\xddz\\xeeo!\\xb2\\xf6\\x0b\\xf8\\xb7\\xedo\\x86\\xf5\\x1b\\x88\\xac\\xdbM\\xe8\\xba\\x0cI.\\xb0\\xde\\xff\\x87\\x94\\xdf\\x85\\xb5=\\x04\\xe7\\xeb\\xcc\\xcb\\x1e\\xf25\\xdfF\\xee\\x17\\xad\\x9e(\\xb4\\x7f\\xb0\\x03H^\\xe5\\xe8\\xab\\xce=\\xed\\x1c\\xa1\\x18\\x06\\x91V\\x0f)NY\\x8e\\xd0\\xbc\\x1e\\xa4\\xfc\\xb0\\xf9\\xc5\\xaf;\\xafq\\x1dQk\\xcek9\\xc6\\xea\\xde\\x05S\\x1fx\\xb49\\xcf:\\xaf\\x94X\\xf3\\xc6\\x9a[J6\\xd2=\\x9d\\xb7\\n#\\x8c\\x93\\xc0\\xf3FR|0\\xa9\\x7f\\xe0\\xbcQ\\xac8\\xd7\"\\xaa\\xbb\\xed9\\xb5w;\\x88\\xac\\xf5Q\\xb1\\xfag\\x83\\xcd\\xd5\\xc8\\xbd\\xed\\'l\\xc1\\x18\\xbdB]\\xfa\\x97\\x9d\\xcf\\xaaa=\\x11\\xf7\\x0fIO$\\xe9\\xf1\\xb0\\x7fh\\xedHB\\xe7%\\xb4y\\xf7-\\x9d\\xd7\\xc3x\\xa6\\r+\\x96\\xa6%.\\xf1l\\x03\\x11\\xd2A\\xa2\\x85z<\\xa4\\x83\\rk#\\x16T\\xb6*:\\x0e\"\\x96\\x0bog\\x9d=x\\xc4\\xceJki\\x1e\\xe7\\x93+\\x9bl\\x9f?\\xed\\xc8\\x86\\xf7\\xbf\\x872^Sh\\x9c^\\x92~\\xf7\\xb4.i3\\xab@\\xc4\\xe3\\xf4\\xd2\\xc4a1\\xc9\\xc5[\\xf8o\\x118N\\x85\\xc6\\x03\\x92\\xe6s\\xf9\\x95\\xcfA\\xbbb\\xc2\\xe8K%\\xfd\\x0eAd=~&w>\\x13a\\xe7>\\xee\\rDL\\x078.\\x94\\xb4\\xbe@\\xf2\\xa7\\xf81r\\xb2\\xd7\\xb1G%\\xdf\\xaf\\xa3o\\xf2^\\x12\\xb7g\\xbd\\xf1\\x06D\\xdc?\\x1e\\x17\\x9c\\x1c\\x9e/pzJ\\xaa\\x0f\\xad\\xdcvk:\\xe2\\xba\\xabS\\x81\\xe6\\x10\\x03r\\xee\\xb3\\xf2\\xa7\\x10k\\xbf\\x02\\xef\\xfa\\xdfT\\x9a\\x99l\\xff\\x06c\\x97K\\x8b\\x07\\x87>\\xda+\\xa1\\xf5S%\\x95\\x03\\xf5\\x03\\x9c\\x87\\x1a\"k:X|k\\xe3\\x02\\x07[\\xd7#\\x10\\xa1=\\xd1\\xd2\\xf8ShO$\\xf1Q\\xdarh\\xfd\\x1c\\xbaG\\xef\\xb9\\xd5\\xb1\\xc4\\xae\\x81\\x10!\\x1d\\x90\\xca\\x11\\xcbnI\\x1a?\\xd0^%T\\xef%\\xf1Q\\xa8\\xf7\\n\\xcd\\xdbJ\\xebO\\x9eV\\xe4\\xfb~\\xe9\\x8a\\xabM!\\xb2\\xb6_\\x07\\xb9\\xed\\xbf\\x9f\\xb0w\\xebl\\x8cp\\xbd1\\xaf\\xf5\\x85G\\x04:\\xc8\\xaf\\xfc.b\\xcd\\x7f\\xc4\\xda\\xdfL\\xa8=\\xe4>\\xa1\\x1ch\\x0f\\x91\\x9b~Y\\xa7\\xda\\x18\\xbd\\x01\\xe3\\xba\\xc8\\xb7\\xf7\\xf6\\xf4\\x0e,\\x8b\\xe5v\\xc8\\xa1\\xf8\\x83\\xbfq=\\xabb9\\x87\\xc7\\xcbT\\xeb\\xdc\\xed\\x06\\xed!P\\x1f\\x1d\\x95r\\xbbZ\\xe3}\\xed\\x17C$\\xe9\\xa3\\xf8ySA\\xfd\\xf2j7\\xb1\\xe6%\\xfeN\\xcd_\\xba\\xfb\\xf5\\xf5\\xc5\\xd8\\xf0\\xd8\\xed%K^\\xd8\\xa8Y\\xaf7\\n\\xb5\\xf7\\xd2\\x8e\\x1f\\xb1\\xe2\\xf8\\xc5\\xf2\\xeb\\xec6\\xdbkF9\\xf7\\xe0\\x8b\\x10Y\\xaf\\xcf\\x89\\x95\\xd7P2E\\xdfs\\xd9\\xbdV\\xdb1\\xae\\xbaewe\\xe9\\xcd}\\xae\\x90\\xde,\\xdd\\xe7\\x0e\\xd2[\\xf73\\x85\\x17l\\x1d\\xdf4\\x03\"k\\xf9C\\x9b\\xbfJ\\xe8\\xfa\\xb6P?\\x07R}\\xa0\\x9f\\xc3\\xb5\\x1f\\x8b\\x8e}]\\xda\\xdb\\x11cu\\x87\\xb0o\\x06=}\\xdb\\x82\\xb6\\x7f\\x9eS\\xf6\\x8fX\\xebLB\\xd7Oi\\xd7\\x99\\x9c\\x17\\x1f(~\\xb7\\xcc\\xa0\\xf9\\x10?\\xb7\\xf5S\\xda|\\x01B\\xe7\\x8d$>\\n\\xdb\\r\\xf7;D\\xa1rn\\x9f_z\\xbb\\xc7\\xe1\\x8b\\xf6\\xe2\\xeb\\x03\\xd3\\xcf\\x8e]\\xd3<\\xbe\\x1fD\\xday\\x16\\xc9\\xff\\x00\\xce\\xb3\\xc4\\xf2\\xef\\x15\\xda?\\xb4v\\x17\\xb1\\xf4\\xd1\\xc7s4\\x81\\x1b\\xd7\\xc7\\xbc\\xc0\\xb8d\\xd1\\xfd}\\xfd\\xc7\\xd6]\\xc3z\\xbe\\xed\\xb7>\\xad\\xfd\\xecR\\xa5\\x9a`,m;\\xa2P\\xfa\\xe5U\\x9e\\x98\\x0e\\xb0\\x9f\\xaa\\xa5y0\\x94~\\x05\\xeeW\\xe9p\\xe7\\xbd\\x9d\\x8f\\x94\\xdf\\x1f\\xf2\\x03R}h\\xf9\\x81\\xd0u\\xcd\\'\\x84rX\\xafk\\xde!\\x94\\xc3z]\\xb3b\\x0e\\xe6\\xb5\\xae\\x99\\x97}\\x94\\x95>*\\xd6z\\xbdX\\xe3\\xf4h\\x95\\xd2s\\xc6\\xd8u/\\x8c\\xb1_7\\xe9!ux\\x9b\\'_\\xea\\xba\\xd9\\xd6\\x83g\\x96r\\x0e\\x1d\\x87c\\xd4\\x05O\\xdd\\x7ffLXe\\xa8\\xefX\\x9a\\x1f\\t\\xea;B\\xf57\\x92\\xfc\\x81\\xfa\\x9bP=\\x9e\\xd6\\xffmG\\x8b\\xb4\\xe5\\xd5;\\xf5\\xe8\\x80\\xb1I\\xd5\\x05\\xe7\\x0ck\\xd3\\x1f\\xd3\\xe6\\x9d$\\xc5}\\xe4W>\\xfc\\xbc\\xf4\\x03V\\xf9\\xf0\\xc5\\xf2\\xab\\xd93aM\\xbb\\x9f\\x9a**`lz\\xf2\\xb7\\xef\\xba\\xf73\\x17a=/\\x11*\\x7fH\\xeb\\x9aP\\xfe\\xac\\xca\\xac0{\\x8cU\\xd3#\\x10\\x03r\\xee\\xe7\\xb5\\xbe@\\xd2w\\xa0<Mw\\xf8.\\xa4x\\xcf6g!\\xd2\\x96Ck\\xdfQ\\xcd\\x1f\\xd7\",m\\xd33\\x88\\xb4\\xe5\\xd0\\xda\\x0ffw)\\x1c_\\xf9`\\xfcI\\x88\\xb0\\x1cK\\xf9(,\\'\\xe0\\xfe\\xe6\\x12\\xbd\\xee\\xad\\x99\\x86\\x11\\xc6\\xff\\xfcS;\\xd2\\xed-VW\\x03b\\xdd\\xdd\\xf1\\xb5\\xf3\\xdbrNK\\x1bv\\xef\\x0f\\x91\\xf5:\\x86P~M\\xf2\\xaf\\x82\\xfcZh\\x9eS\\x12]\\xc3<\\xa7\\xd0\\xef\\xc0R\\xff\\x03\\x12]C9\\'V|\\x16\\xd6\\xdb!B~-4>X\\xac\\xf5\\xed\\x8b;RO)Ot\\xf2\\x84Hk\\xaf\\xa2\\xa5k\\xb1\\xe4)m\\xfc6i\\xbeM\\x9b\\xb7\\xb5\\xe6\\xf5Ms\\xc7+\\x8c[!\\xb2\\xe6\\x07B\\xe5\\x1c\\xc9n\\t\\xe5\\x9c\\xd0\\xf8\\x05\\x92\\x9e\\x08\\xf57\\xb1\\xf4k\\xfb\\xcd\\xcfv\\xde\\xf1,\\x7f\\x18\\xe3\\x9e\\rS\\x1d\\xf6\\xb6\\rp\\xa6\\xb5\\'\\x92\\xf4D\\xc8w\\x84\\xfa\\x1fP\\xcb\\xb9\\xbe;\\xbc\\x7f{\\x1dV\\xfe\\x13\\x04\\xe5`\\xbd\\n\\x8f\\xff\\t9\\xd7\\x9f[\\xfe7\\xdbU\\r\\xe6>\\xaf\\x99\\xf4\\x04\"\\xacO\\x04\\xa8\\xcf8\\x0b\\xeb#\\xd4~@\\xb2\\xbb@\\xfbA\\x91%w\\xd6\\x99S&\\xfc\\x08\\x11\\xd35\\x9e\\x07\\xe7E\\xd7Pn\\x17\\x0b\\xacwH\\x1dp\\x0f\\xab\\xabV\\x95\\xca\\x8c\\xb2zy2=\\x16\\xa3\\xf2\\xe2\\xa2\\xd9\\x91\\x1d\\xff:)\\xd6\\xba\\xd9\\xff\\xd7\\xf9\\x0fI\\x0f\\x81\\xf3\\x1fZ{\\xbcP~\\xd0\\xf3|\\xb2\\xfc\\x88\\x7f\\xc5\\xb7\\x10Y\\xc7;\\xdfj\\xf0\"\\xec\\xfc\\xd8\\xb4\\x9e\\x10i\\xfd\\xd2h\\xf3\\xc3\\n\\x1d\\xa7$\\xf9\\x03\\xc7\\xa9P\\xf9C\\xda\\x07\\n\\xca\\x9f\\x87-\\xda]kj\\x97\\x1c\\x03\\x91\\xf5~,b\\xf9\\rVwn\\xbfvR\\xc4\\xc0m\\x10Y\\xeb\\xbd_\\x8a\\xff\\x0e\\xad\\x9dB\\xa8\\xff\\x0em\\xdc\\xc7W\\xff\\x9d\\xdc/\\x92\\xde\\x0b\\xf9\\x81\\xd0\\xfc\\xd7e@\\xfb\\xe1W~\\xed# u\\xbf\\x98Y8\\xf1\\xd1$\\x88\\xac\\xfbG,{\\xa2\\xb9\\xe9\\xf82Vu\\x1b\\x9e\\x82H\\xbb\\x9eEk\\x17\\x13\\xca\\xafi\\xf9h\\xc7>\\x8e^\\xcd\\xa7\\xcd\\x8c\\xc7\\x08\\xfd\\xaf\\xf3\\xb2\\xfb\\x93\\xe4\\xa9\\xd0y\\t\\xd4\\xafi\\xf5\\x10\\xb1\\xfcP\\xc4\\xe2o\\xb4\\xf9\\x95Iq\\x1f\\xa4\\xfe\\x81\\xf9\\x95\\x85\\xae\\xd7\\x93\\xe6%p\\xbd^\\xed\\x96\\x18\\xa0n\\xbd}\\nD\\xda\\xf9\\x1c\\x89\\x8f\\xc2\\xf9\\x1c\\xc9^e\\xe9\\xfc\\x07\\x96\\xa3\\xff\\xf3\\x8f\\xab\\x8d\\x8f\\xe9\\xf1\\xf2*u\\xbe\\'K\\xf5\\x10\\x98\\xefI,~\\x1d1@ZdQ\\x95\\xf0j\\x10!\\x7f\\xb34?\\x1fkyJ\\xd2CX\\xaf\\xa3\\xc3\\xf6\\xc3\\xaf\\xaf\\xf1\\xc1\\x9fG|0\\xed|\\x8e\\xc4w\\xa0\\xfd\\x9a\\xa4W\\x91\\xf8\\x1b,G\\xe8\\xbe\\xcb$\\xfeF\\x1bo&\\x94\\x1f@\\xfe\\x96\\x12\\xd9d\\x842\\xbd\\xfb~\\x88_j>\\x87\\x9e\\xcf\\xd5\\xb1\\x03\\x9dg\\x9d\\x80\\xc8\\xda?\\xb1\\xc0\\x98\\xcbK\\xca\\xb7\\xb9m\\x82H\\xab\\xbf\\xd1\\x8e\\x1f\\xa1|\\x94\\x94\\x97\\x9a5\\x1f\\xa5\\xdd\\xafZ,=\\xde\\xb3\\xb7k\\xc3\\xfb}\\xb7\\x0c\\x84H\\xab\\xc7\\xd3\\xea\\xa3b\\xe9\\x07b\\xd9G\\xdb_\\xd5\\xfdx\\x7fT\\xc4i\\x88\\xac\\xed\\xa3B\\xf9(-?\\xf0\\xf8v\\xe1\\xac\\xe37\\x93\\xec \\xb2\\xe6\\xa3b\\xd9)\\x84\\xee\\xcfD+OS\\x8b\\xda4:8u\\xcbD\\x8c\\x17Ro\\xef\\xf7\\xf07\\x1e%\\xf9\\xbf\\xe1\\xf1?\\xc5:w{\\xc1rX\\xe7\\xd5%\\xf9qA\\xfeF\\xa2\\x03\\xda\\xf9\\x02\\xbe\\x86\\xfc\\r\\xd2A\\xaa\\xe1\\xe5\\xad\\xa9:\\xab\\x10\\x88\\xf9\\x957\\x9c\\xb4\\xee\\x8c\\x13\\xda\\xe65N\\x85\\xceKH~\\x01p^\\x12Y\\xe5\\xc1\\xc5\\x03\\x8d\\'\\xfc\\x0c\\x91\\xb5=dB\\xfa\\xaf\\xf6\\x1b\\x8aG\\r\\x84\\xc8\\xda\\xde\\xab\\x1ft\\xb8\\xdc/\\xfb\\x9a}\\x82\\xb4\\xf3,\\xd28\\x85\\xfc`\\xdf\\xe9\\xd2\\x8f\\x16\\x9f\\x1f|\\x11\"\\xeb\\xf8\\x05\\xb1\\xf6)\\xaeY\\xd3\\xad\\xc0\\xe0G=g`\\x9c4\\xeei\\x9dF\\xbdc\\xbaB\\xbfuR~\\x17\\xd2\\xba\\x0c\\xf4[\\x17+N\\x8f6~.\\xbf\\xe3eH\\xf1L\\xb4\\xf6\\x1d\\xd6\\xebLK\\xabu\\xeahh\"\\xb5\\x8680\\xe7\\xfe\\xdc\\x16\\xa6J\\n\\xef\\xba\\x8d\\xcd\\x02\\xf9\\xc1\\xeb\\xfd:\\xe7]w\\x87\\xec\\x82H\\x9bo\\xf0)\\xa1\\xdd \\x1f\\xa5\\xcd\\x7fmi\\x1c\\x18\\xcc\\x7f]\\xe6\\xf1/\\x07K\\xbc\\xd9\\x9c\\x08\\x91\\xd6\\x8f\\x8b\\xb6\\x7f\\xc4\\xf2\\xab9\\x11\\xbf#h\\xdd\\xfa\"\\xc3\\x03\\xca<\\xad\\x97l\\xf0,\\r\\xe5\\x1c\\x8eg\"\\xf1\\x03\\x12\\x1f\\xady0\\xa4i\\x81\\xa8*\\x95\\xf05\\xad\\\\\\x10\\xea_%t\\xbf\\xb6\\xcf-\\x8f\\xccc\\xa7\\xf6\\xf7\\x9al\\xf6:\\x05\\x91\\xb5\\xdcn\\xab+;e\\xbcM\\xbdb\\x10a\\\\\\x9b\\xa5\\xf3,\\x18\\xd7&\\xd6<\\xab\\xd6\\xeb\\x96\\x91\\xaf\\xf7v\\x98\\x08\\x91\\xf5<K\\xa8\\xfeF\\xca\\xeb\\x01\\xf5\\xb7%\\xf5l5\\xe6\\x05\\xe7&A\\xa4\\xd5\\xabHt\\r\\xc7\\xcf\\xa0\\x03w\\xbc\\xe6\\xcf\\xfe6\\x0c\"k\\xfd\\xad\\xed\\x13OOS\\xfdEa\\x10Y\\xfb\\xd5\\xd0\\xee\\xc3N\\x92\\x0b\\xb4\\xfbM\\t\\xf5\\xb3\\xa3]\\x97q\\t\\xa8\\xf7{l\\x98\\xcc\\x1f\"\\xad<%\\xe9o\\x90\\xaei\\xf5QK\\xe5iT\\x9d\\xd0\\xd4~\\xdd\\xae\\xe1\\xe6\\x17<\\xdf\\xa6\\x8d\\xab\\x16+\\x9f\\xc3\\xca\\xe5;\\x95\\x97\\x1d\\xd3\\xd7Ad=~Vl8\\xd9\\xc3*\\xc5k\\x14\\xc4\\xcf-\\xdf:\\x89\\xae\\xa1\\xde\\xfbMP\\x89\\xd4iO\\xfa4\\x80\\xc8Z\\xaf\\x12k\\x9e\\xb5\\xe0\\xcd\\x05\\xa7\\xc0\\xf4\\x17K0\\x8e\\x9d\\x1dx!mUr\\x0f\\xday\\x16\\xc9_\\x19\\xce\\xb3\\x8a\\xbf5\\x1a\\x87\\xd51r\\x10Y\\xaf\\x9b\\x89\\xa5\\x8f\\xeewy\\\\\\xe5\\xc7?\\xccW B=\\xc4\\xd2\\xfd\\x9d\\xa1\\x1e\"\\x16?\\xa8p_\\xd9\\xe8Y\\x9d\\xe6\\x1cD\\xd6\\xfc\\x00\\xef\\x87\\x01\\x91\\xb5\\xff\\xa8X\\xfb\\xa4<OV\\xf5\\xb9}\\xd8\\xb1\\x18DR\\x1e&\\xdav\\x83y\\x98\\xa6\\xaf<\\xeca:\\xd7\\xfaG\\x8cPO\\xc4\\xf1\\xa7\\x96\\xf6\\x0f\\x8c?=\\xf7}\\xab\\x8e[\\xca\\x15\\x90aL\\xae>8\\xa4\\xf2\\xb0V\\xd5\\xa0\\xbd\\x97\\xb4O\\x17i\\x9e\\x05\\xed\\xbd\\xfeN\\x07\\x7f\\xf5\\\\x\\'\\x02\"-\\xbf&\\xf1\\x03\\xc8\\xaf\\xeb\\x9c=\\xd5\\xfee\\xd47M1\\xeeQ\\xf65\\xcd\\xf8\\xb6\\xfc\\x03\\x98\\xb7\\xd5\\xd2\\xfco\\xb0\\x7f\\xbe/4\\xa7\\xf1\\xf6\\xd2\\xaf\\xbc!\\xb2\\xd6\\x13\\xfd\\xe6o\\x7fw\\xcc94\\xf2\\x13\\x04\\xe5\\x90\\xfa\\x87\\x18\\xef\\x9cO\\xf1\\x18B\\xedH\\xb4\\xf3,\\x92?,,\\xc7R~\\r\\xcb\\x11\\x1a7E\\xda\\xb7\\x82u~\\x8a\\x8b\\x84rX\\xfb\\xad\\x93\\xd6KX\\xfb\\xad\\xd3\\xd2\\xc1\\xd6\\xb1kM\\xb1J\\x8d\\x02\\xe2\\x97j?x\\x14\\xa4\\xcc\\xf8\\xc9/\\xe8 D\\xd6\\xf6\\x03\\xa1y\\xa5H\\xfc \\xbf\\xe6?+~\\xee\\xb8\\xf5Y\\xf3U&\\x88\\xac\\xf5\\x9d\\xa42\\xb1\\x8d2_\\x1e\\xd8\\x85\\xd1\\'Se\\x9dq\\x88\\x1bD\\x9b?\\x84\\xc4w\\xa0<\\x15\\xba_\\x01\\xad\\xdf\\xd3\\x9a\\xc56\\x0f\\xd4\\xd7\\xba\\x17\\xc2\\x08\\xf5\\x10\\xbcOd\\xb2\\x85t\\x00\\xf7\\x89\\xfc\\xdc\\xe2\\n,\\xf5#\\x86\\xf2T,\\xbf\\xc1\\xf8\\xc7\\xdd\\x86=\\xaa}\\xba\\x18\\xc4\\x80\\x9c\\xfb0\\xbe1\\xbf\\xfc\\x06I\\xeb%\\x90\\xdeF\\x1b]\\n\\x1d\\xcfp\\x1f\\x0b\\x91\\xd6\\x8eD\\xca\\xf7\\x04\\xf9[\\xff16\\xc3S\\xbb?y\\x81\\xf1\\xd2\\xa3\\xc5\\x86b\\x89~U ]\\x93\\xf8\\xa8XtM\\xb4\\xc7\\x03\\xba\\xee>\\xaf\\xfc\\xf9\\x03\\rv\\x95\\x86\\xc8Z\\x1f\\xad\\x1escr\\xf1\\xbf\\xdas\\x10Y\\xcf\\xe7\\x84\\xc6\\xcb\\x90\\xfa\\'\\xbf\\xe2\\x99p~\\x1a\\x88\\xac\\xfd\\xd2\\x9c\\x8eK\\xaf\\x04nh\\x99\\x811\\xaa\\xd5S\\x877\\xd1G\\xcc\\xd0\\xbec\\xa9\\xfc\\x81\\xf6\\x1d\\xa1\\xfa\\xe8=B9P\\x1f\\r*\\xb6\\xb6]\\xb9\\xe9\\xf7\\xa3 Z\\xba? \\xd4G!\\x1d\\x04\\x87\\x9cw\\xab\\xb9\\xbd\\xbe\\x04\"\\xeb}c\\x93\\xd6\\x95\\xd9\\x12X\\xf6\\xd4Y\\x88\\xac\\xfd\\xc5\\xfem\\xfb\\x03\\xd2\\xae\\x9b\\t\\x8d\\x0bM?ty`\\xe6\\x8b[2\\x88\\xac\\xe9@,=D\\xa8]\\x8c\\xc4G\\xa1]l\\xcb\\xa56\\x8b\\xc3\\xba\\xdds\\x86H\\xab\\xef\\x10\\xeb\\x03\\xf4\\x1d\\xda80K\\xe7\\xf5P\\xbfv\\x0f\\xec;Q\\xc9]\\x1d\\x06\\x91\\x96\\xbf\\xd1\\xc6\\x85\\n\\xb5\\x1f\\x90\\xd6\\xcd\\xa0\\xfd@\\xe8z\\t\\xc9\\x8e\\xc4z\\x7fZ\\xd2\\xfa\\x02k\\xbb?q?\\t\\xc0\\xdf`>)\\x98W\\n\\xdb\\x0f,\\xcd+\\xe5\\xf5\\xb8\\xe2\\xeeb3G\\xef\\xc1\\xd7b\\xe5\\x95rYyu\\xdd\\xc1\\x80\\xf1f\\x88\\xac\\xfd\\x9e\\xc4\\x8a\\xd3\\xb3\\x9e\\x1b\\xbfs{Jf\\x0f\\x8c\\xbe\\xcd5kmK\\xad.\\x00\\xf5x\\x92?,\\x89\\xef@=^\\xe8z\\xf0;B9\\x9f\\xec\\x87\\xdc\\x7f\\xa9g\\xe3i7\\'C$\\xd9)\\xa0\\xff5\\xad\\x9d\\xc2R?o\\xfc\\\\\\\\\\x0em<\\xadX\\xf1\\xf5B\\xe3X\\x8aZ\\xe5\\xae\\'~}\\x8d\\x07\\xfc\\xb2\\xe2\\x01\\xbd\\x1fT\\xbcQi\\xc4Y;\\x88\\xb8>\\x15\\xa6\\xd6}s\\xfbY\\xd0QK\\xe3\\x9d--\\'\\xafv\\xa3\\x8d\\x07\\xdc\\xf6n\\xa1\\xe3P\\xcd\\x9c\\xce\\x18I~\\x90\\x96\\xea\\xbdP\\xfeX9\\xd6\\xb8\\xd35\\xb2W5\\x88\\x98_o\\xdc1\\xb7\\xe1\\xbbY\\x8d\\xcfD\\t\\xe4o7\\xe3\\xe6]\\xdf\\xe07\"\\x19\\xa2P{\\x08,\\xa7\\x9e\\xf5\\xc2\\xb2\\xf6>\\xbe\\xe5 \\xe6\\xd7\\xfe\\x18\\x96\\xfa\\xfbC>Z\\xb8\\x8f\\xcb\\x9b:\\x7f\\x169\\x06\\x11\\xfa\\xa1\\x08\\x95?\\xb4\\xf9\\x1c`\\xfc\\x0f\\xce\\xe7@*\\xe7\\x9f\\xe6\\x99\\xfb\\x15\\xc8\\x1fK\\xcb\\xb1\\x94_S\\x97#\\xd0\\x0e\\x0b\\xcb\\x11\\x8b_\\xd3\\xf2\\x1d\\xda\\xbcy\\xbf\\x12\\xe8\\x80\\x98\\xa7\\x11\\xd4\\x876\\xff(i\\x1e\\xfc\\xb9\\xf9Eo\\xfa\\xae\\xcf\\xae\\x81\\x87\\xcf\\xcd\\x86\\xc8:\\x0e\\x0c\\xe7#\\x87\\x08\\xf5xK\\xf3\\xbb@=^\\xe8<\\xf81\\xa1\\x1c\\xa8\\xbf\\t\\x95\\xdbUA\\xfb\\xe1\\x17k\\xfd\\x003\\xe4\\xbc\\xe8m\\xfd\\xcd\\x1d\\xcf\\x93\\x9b\\x87\\x96\\x81\\xc8\\xdaoP,\\xff\\xb7\\nG7\\xdd\\xe8\\x90y\\xfb\\x10D\\xb8\\x8eN\\xf2\\x1b$\\xc5\\x1dB=\\xa4s\\xafU\\xf3\"#\\xa7\\x9f\\x80\\xc8z=\\xb8|\\x91\\x99\\x93\\xf6\\xdb\\x16m\\x06\\x91\\xf5z\\xc9\\xa9\\xb9\\xbfk*\\x0cp^\\n\\x91\\xf5z\\x89X\\xfe;\\xd3\\xce,kS4~\\x7f\\x0cD\\xd6\\xf3\\x12\\xa1\\xeb?\\xb4\\xf3\\x12\\xb1\\xfc\\x0f\\x86\\xf7\\xdd:\\xf4E\\xd1\\xe6\\xad!\\xb2\\xd6G\\xb5-\\x1b\\x86\\xf9v9W\\x05\\xe2\\xe7\\xb6\\x9f\\x1e)\\xee\\x90\\xb5\\x9d\\x8fVn\\xaf\\xf7\\xb65\\xe9\\xfb\\x8dm\\x88\\xf9\\x1a\\xbe\\xa6\\xb5\\xf3\\x91\\xfa\\x07\\xf2\\xb7\\x06[K\\xd5](\\xdd4\\x03\\xa3\\xb2\\x89\\xcb\\x84\\xf47\\xad\\x07\\xd3\\xee+B\\xb2\\xbfA\\xbf\\xce\\xe4\\xd1\\xcb\\xd7\\x9d\\xac\\x9bj\\x83qH1\\xfbS\\x9d+\\x9eN\\xa4\\xcd\\x97F\\xe2\\x07\\xac\\xf3N\\xd2\\xc6I\\x88\\x95?\\xc4n\\xee\\xf3\\x81\\xf5\\x86\\xfb\\xac\\xc3\\x98Y0\\xb3\\xc4\\xb0\\x82E\\xa6\\xb3\\xde\\xffG\\xac}\\x97\\xc5\\xb2\\x93\\x93\\xf4\\x03\\xd6vrh\\x1f\\xff_\\xd9\\xc9\\x17\\xcf\\xda^\\xb1@\\x85\\x8a.\\x18/\\xfe\\xbc\\xfb\\xdc\\x8a\\x07)u\\xe18%\\xd9\\x95\\xb1=1\\xafq*\\x96\\xfcIx\\xee\\xeb\\x92\\xf4`\\xca-\\x88\\xac\\xe5\\x8f\\xd0uM\\xb1\\xe2\\x7fHt\\x9d_q\\xefb\\xe9\\xf1y\\xcd\\x1bY\\xf9\\xc3\\xbe\\xf5\\xb7msxC\\xeb\\xea\\x10\\x85\\xca\\xed^}\\x9a\\x1d\\xe9\\x9d\\xda\\xaf$\\xbe\\xfeR\\xf6\\xfb \\xd15\\xeb\\xb8]\\xa2\\xfd\\x00\\xf0\\x83v\\'\\xfb\\x8c\\xb9X\\xaa\\xcb\\x19\\x88\\x9f[>H\\xda\\xf5\\x1fZ\\xbb%\\xa67h\\xaf\"\\xedg$\\xd4n\\t\\xf7\\xc7xG\\xd9n\\xff\\xb6\\xfd1\\xf0\\xfe\\x11\\x10Y\\xf3\\x1d\\xda}\\x86\\xd6Z\\xd8nP\\xce\\t\\xed\\x1fZ\\x7f\\x17\\xb1\\xe4\\x02\\xde\\xb7\\x06\"m|#\\xc9\\x9e\\x08\\xfbG,\\x7f\\xcbk\\xc6\\xe8\\xe6\\r.\\x14VBd\\xed_%V~K\\xda}\\x04,\\xcd\\'\\xc4z^B\\x9b/Z\\xa8\\x9f\\x10m^\\x02\\xb1\\xf6\\xdf\\xa6]\\xa7%\\x8d\\x1f\\x92\\x7f\\x15\\x9c\\xff\\x08\\x8d\\x9b\\xa2\\xa5\\xb7\\xe3\\xca\\xa6\\x9aE\\xc7\\xaa.\\x81\\xc8:>\\xebR\\xab\\x05\\x9d\\xb6Don\\x05\\x916\\xff\\x0eI\\xaf\\x82\\xfcZ\\xa8\\x1eB\\xe2o\\xac\\xfdPh\\xfd\\x95\\x85\\xaec\\xd0\\xd2\\x81\\xd0rh\\xd7\\xe7\\xae\\xfc\\xd4uO\\xad\\x8d%$\\x10i\\xd7\\xcd\\x88\\xf3`\\xb0n&V\\x9e\\x05\\xda\\xf9\\x82P\\x7fe\\xb1\\xec\\x07\\xcd^\\xa6\\x1cjs\\xb2k\\x02D\\xd6\\xf6\\x83[\\x9d\\x9b\\x07\\xa66q\\xf1\\x80H;/\\xa1\\xb5\\x1f\\x885o\\xecx=eLF\\xd1\\x0c;\\x88\\xb4\\xf1\\x9a$y\\x9a_\\xf3F\\xb1\\xfc\\xd6\\xf3\\xf2\\x1f\\xbd\\xd1\\xbf\\x95\\x87\\xdb7\\x9b\\x1fY:N\\xd7\\xdf\\xe9\\x99\\xfe\\xf2\\x8c\\xeb\\xfbq\\n\\xe5\\xce\\x90We\\xae\\xbc\\x9a\\xb0\\xe21\\xed>)\\xb4\\xfb\\xa3\\x8b\\x95\\xf7X\\xa8\\x9d\\x9c\\xc4\\xaf\\xa1\\x9d\\\\\\xac\\xbc\\xad\\xb5\\x8e\\x9cy\\xeb\\xf2\\xa4\\xfcj\\x88\\xac\\xf9\\x0e\\xed\\xba&I\\xbf\\xa6\\xcd\\xdb*\\xd4\\x9f\\x82\\x94/\\x00\\xea!3\\xf4\\xb1-\\xc7\\xc7\\xf9\\xce\\x80\\x18\\x90s\\xff\\xab=$\\xa7\\x9c|\\xb2\\x874\\xea\\xa5Y4\\xaer\\xeaP\\x88\\xac\\xf7\\xd7\\x1c\\xb8\\xc6ih9G_G\\x88\\xac\\xc7\\xe9\\xa3\\x8ao\\xde\\xda\\xfb6o\\x0c\\x11\\x13\\xa4_\\xcd\\x8a)\\x0fF?\\xd5Y*\\x17\\x92\\x8b\\xd7X2\\xe9wg\\xec>b\\xb5am\\xc4\\x82\\xcaVE\\xc7A\\x94\\xe6\\xdc\\xc7H\\x1a?\\xb4\\xf5\\x19[f\\xe6[G\\x9fc)\\x10a},]\\xd7\\x84\\xf5\\xf91`\\xd8\\xeb\\x913\\xdc\\xb7A\\x84\\xf5!\\xd15\\xad\\x9fCW\\x9b\\x9e\\xcd\\xb4\\xcbG)G\\xf4\\x0eW\\x95+\\xfd\\xdbR|\\x1d\\x90s?\\xaf8qZ\\xfe&4o\\x04\\xc9o\\x10\\xd6\\xc7\\xbd\\xbe\\xff$S\\xf2\\x8aA\\x10a}\\xa0\\x9f\\xeax\\x0b\\xf9\\x8e\\xd0y#)\\x9e\\t\\xf2\\xeb\\xf4^\\x17\\xaf\\xd70\\x9bl Z\\xba\\xce\\x94\\xd7\\xbcQ\\xa8\\x9f7\\xed\\xf8!\\xed\\x8f\\x01\\xe3\\x90\\x85\\xee\\x8f\\xe1\\x98\\xe0\\xd9\\xf9\\x8a\\xac\\\\\\x06D\\\\\\x9f\\xbc\\xe6\\x0b$:\\xa8?\\xe4j\\xc7J\\xcdk\\xc6\\xe3\\xeb\\xd9QA*\\xdfM+\\x8aa\\xfc\\xabT\\xf2k\\xd7\\xe4\\xc7mh\\xf3J\\x91\\xca\\x81y\\xa5h\\xfdaI~\\x83\\xff_\\xfda\\xb1\\x1f\\rDZ\\x7f\\xd8\\xcfm\\x9eu0\\xfe\\x99\\xfd\\xc4\\xb2\\xd2\\xab\\x10Y\\xcf\\xb3\\x84\\xc6\\xd7\\x93\\xe8\\xfa\\x13~-P\\xef%\\xf9\\x8b\\xb1\\xf6#\\xa6]\\xaf\\x17Z\\x0e-\\x1f\\x15jO\\xa4\\xcd\\xbb\\xf2\\xa5\\xd8\\x13i\\xfd\\xc5\\x84\\xc6\\xcb\\xd0\\xeaU\\xb4\\xf3,\\xb1\\xe2e\\xfa\\xc5\\x9eJJ\\xe3\\x1c\\x92\\xbe\\xce\\xb3\\xb2_b\\xc5\\xbd\\x0b]\\xff\\xb9O(\\xe7K\\x8d\\xd3\\xa3\\xd5C\\x84\\xc6\\xe9\\x91\\xf85\\xb4\\xefD\\x17\\xdd\\xf8S\\xc1U\\xdf\\xdaCd\\xed\\xef/4\\x1e\\x90\\xa4\\x87\\xc0uZZ\\xfb\\xa8\\xa5z\"\\xb4\\x8f~\\xd5\\x13s\\xbfh\\xe3\\xa6\\xbe\\xea\\x89\\xb9_\\xb4|G\\xa8\\x9ex\\x99P\\x0e\\xeb<\\xa7\\xd6\\x00\\xf1\\x0b\\xd2u\\xba\\xad\\xdd\\xf9\\x12\\xcdf\\xed\\x80\\xc8\\xda\\xefI\\xac|\\x9d\\xcb\\xcf\\rj<k\\xc9\"O\\x88\\x019\\xf7I\\xfa\\xceO\\x16\\xea!B\\xe56\\xa9\\x1c(\\xb7i\\xedHP\\x0f\\xc1v$\\xda\\xf1#T\\xaf\"\\xee\\xf7\\x01\\xf4\\xaa\\xcf\\xcd\\xbec\\xe9~\\x1f\\xac\\xf7G\\xc7\\xfe\\x14\\xb0\\x1c\\xc8G\\xc5\\xf2w9\\xe4\\x9bZvp\\xe1I\\x91\\x10Y\\xef\\x97c\\xe80\\\\Z.y\\xe4S\\x8cp?\\x96\\xbc\\xf2\\xc7\\x93\\xe46\\x8c_\\xa0]\\x0f\\x16\\xaaW\\x9d\\x0eI8\\xef\\xe4\\xed\\xdb\\r\"\\xad_\\x00\\xd1_\\x0c\\x943T\\xbba\\xc0\\xa2Y\\x1b\\nC\\xa4\\xa5\\x03\\x12]\\xaf\\xba\\x1bY\\x7faR\\xec\\x9f\\xf8Z\\xac\\xfdO\\xc5\\xca\\xe7M\\xbb_\\x9b\\xa5\\xfa\\x1b\\xdc\\xaf\\xad[\\xdf\\xb3\\xc3\\x13\\xf6\\xcd\\xf5\\xc5\\xb8e\\xba\\xfd\\x15G\\xd5\\xc8v0\\xdf\\x93\\xa5\\xf2\\x14\\xe6{\\xfa\\xb7\\xed\\x07\\xf6o\\xcb\\xafL\\xcb\\xdf,\\xf5S\\x85\\xfcM\\xa8\\x9fj1\\xd0~\\xef\\xeb\\x03\\xe4\\xb6X\\xfb7\\x8a\\x95\\x97\\xad\\xf2\\xdb5\\xc6\\xa0\\xa6o\\xd20\\x92\\xf6G\\'\\xe5\\x0b \\xc9m\\xa8\\x1f\\x08\\x8d\\x07|G\\xa0\\x03\\x18\\x0f8\\xadN\\x86CM\\xd7\\x01\\x15 \\xd2\\xfa\\xa9\\x92\\xe8\\x1a\\xcam\\xa1z/\\x89\\x0eX\\xc7\\x85\\x12\\xf9\\x01\\x90\\x0bX\\x1e\\xe4%\\x17HqS5\\t\\xe5@\\xb9\\xd0\\xd1\\xd1\\xb7^Uk\\x0f\\rD\\xd6\\xfbx\\x8a\\xb5\\x7f\\xb0Xy\\xf7\\xc5\\xdaO\\xef\\xc9=\\x8f\\'E\\xca\\xbcp\\x81\\x08\\xfb\\x87\\xa4W\\xd1\\x8e\\x9fmcF\\x1b\\xcf?\\xf5\\x7f\\n\\x91V\\x7f\\xa3\\xb5\\xfb\\x0b\\xcdwK\\xf4\\xa7\\x00r\\xa1\\xe3\\x7f*%\\xfd\\xee\\xbdc%\\xc6\\xc6i\\xa3\\x96\\xad\\x7f\\xe2\\x99\\x0c\\xe9\\x804\\xcf\"\\xc99H\\x07\\xc5\\rw\\x9a<-i\\xf3\\x00\"\\xeb\\xb8\\x02\\xa1\\xf9\\x88Iyd`>b\\xb1\\xe4\\xe9 \\xd7\\xc7\\xc9\\xa9\\xc3\\x8f* \\n\\xe5\\xa3cM\\x91\\x13\\x17\\xbf\\xe8\\x88\\xdd\\x7f\\xac\\n\\x84\\x9dl\\xb8y\\x9fn(D\\xda\\xfc;X0\\xc3r\\xa0\\x1dI\\xac\\xfc|\\xb4qzB\\xfd:\\xbf/}b\\xf4\\x81V=6`\\x9c\\x16\\xed\\xdb|\\xf5\\xcc\\x1e\\xdf\\xd3\\xe6\\xc1\\xa0\\xcd\\x17-V~X\\xb1\\xe4\\x82P\\xfb\\x01\\xc9N\\x01\\xf5k\\xa1|\\x94T\\x1f\\xc8Gi\\xe5\\x8f\\xa5y\\x8b\\xfei>H\\x12\\xbd\\xd1\\xe6\\x83\\x14j\\xef\\xa5\\xcds*\\x96\\xbd\\x974/\\x11:?\\x85\\xf3\\x92Q\\xb6\\xbeI\\x85\\x8b\\xf7\\x1e\\x0f\\x91v~J\\xbb\\x9f\\xdeW{|\\xee\\x17m\\xbe\\r\\xb1\\xd6\\x1bm\\xf7\\x05\\xc7\\xbae\\x0cZ\\x82\\xd1\\xd2x3\\xda\\xf5F\\xb1\\xe2\\xc0\\xc4\\x8a\\xc7\\x18\\xd9v\\xf8\\xa1\\xe4\\xe2KJAd=\\x0f\\x16K\\x9e\\x8ae\\x17\\xab\\xee]0\\xf5\\x81G\\x9b\\xf3\\x10Y\\xef\\xfb\"t?\\t\\x92\\x9d\\x9c\\xf5~\\x94$;\\xf9\\xff\\xca\\x9f\\x0f\\xda\\xdf\\xf2\\xcb\\x9fo\\xce\\x84\\xba\\x17\\x95\\xf1\\x97\\x83 \\xd2\\xfa\\xf3\\x91\\xe6?\\xffv\\x7f>\\xb1\\xc6\\xa9r\\xf0\\xd8\\x1b[\\xaa\\x1f\\xb4\\xc3\\xf8\\xb3|\\xe3\\xba\\x8ee\\xce\\xa7\\xb1\\xde\\x0fY,9Gk\\x7f\\x13\\xba.s\\xb7\\xae\\xb7ar\\xd0\\x96\\x93\\x18\\xb1\\x1f\\n\\x9c\\x97\\x90\\xfcjH\\xf3\\xac\\xfc\\xda\\x87\\xe3E\\x87\\xd6a7K\\xad\\xd8\\x00\\x11\\xf27K\\xf3m\\xb0\\xe6o$\\xbfh\\xd6~\\xc4\\xcf(\\xcb\\xd1$g\\\\\\xa8\\xb6e\\xd7m\\x88\\xac\\xfd\\xf9\\xd2\\x8a|\\xdf/]q\\xb5)D\\xd6\\xf6\\x03\\xda\\xbc+$~@\\xda\\x8f\\x92u\\xde\\x15R\\\\(\\xd4\\xaf\\x85\\xd2\\x01)\\x9f\\xb7\\xd0}l\\xfe)\\x1d\\x04z\\xceM\\xffy\\xf2\\xab\\x08\\x88\\xac\\xe9\\xa0[\\xf0\\xed\\xe2?\\xac]\\xfb\\x0ec\\xe1\\xad\\x1e\\x1e\\xd2\\x9a\\xe7K\\xd1\\xd2A\\xbaHt@\\xe2;\\xac\\xe9\\x80V\\xdf\\x99w\\xf8aD\\x85U\\xcem B;\\x12I\\xce\\x15\\'\\x94\\x03\\xedHb\\xc5\\xb9\\x06\\xbd\\xbd\\xd5\\xa7^\\x05\\x9b\\x97\\x10a\\\\(\\xf6\\xc3\\xa7-\\x07\\xc6\\x85\\xc6_\\x98\\xe3yoK\\x97>\\x10Y\\xe7\\xd1\\x14k\\x7f\\xc0+\\xee\\xcb\\xae)\\xf6I\\\\ \\xb2\\xce\\x13L\\xbb\\x0f\\xae\\xa5r\\x9b\\xf5<\\x8b\\xa4\\'\\xc2y\\x96\\xd0\\xbc8\\x9f\\x9b\\x9d\\xa2\\xcd\\xd6M\\xd2Wk\\xaaU\\x81\\xc8z\\x9dV\\xa8\\xdf\\xc6\\xe7\\x96\\x9f\\x8f\\xd6\\xbf\\xca\\xd2\\xf8m\\xa8\\xc7\\x8b\\x95_L\\xe8z=\\xad\\x1dI\\xac\\xf5zZ\\xbb\\xbf\\xd0\\xfc|b\\xe5\\xc5\\xa1\\x8dg\\xb24/\\x0e\\x8cg\\x12Kn\\xaf\\x8e[\\x9d*\\xbd\\x19\\xbc\\x12b~\\xc9m\\xa1\\xf9\\xab\\xc4Z7\\x13+\\x8ee\\xc6\\x1f\\xf37\\xf6\\x8bJ\\x9a\\x02\\x11\\xf2\\x83D\\x81z\\xfc\\xf3dU\\x9f\\xdb\\x87\\x1d\\x8bA\\xa4\\x8d\\xe3\\'\\x95\\x03\\xe3\\xf8\\x85\\xea\\xd7\\xa4u&H\\xd7m\\x9fxz\\x9a\\xea/\\n\\x83\\x08\\xe9-\\xde\\xc2y\\x16\\xa4\\xb7\\xbe\\xf3\\xa7w\\x196&\\xe9\\x1cD\\xd6~\\xdeB\\xed\\xa3\\xb4\\xfe;_\\xf7\\xf1\\xcc\\xfd\\xbaK\\xd9n\\x8bG\\xf8\\xcc\\xfb\\xf6\\xf1\\xdc\\xe2\\x10i\\xfb\\xe7\\ne9\\xf9\\x1d\\xc7\\x0f\\xfb\\xc7R\\xbb?\\xec\\x9f~\\x8d\\xe6G.-\\x13\\xd0\\x03\\xe2\\xc0\\x9c\\xfbs[\\x98*)\\xbc\\xeb66\\x0b\\xa4k\\xe7\\xed\\xbdC;<I_\\x08\\x91\\x96\\x0eHt\\xfdO\\xf3\\xcc\\x91\\xeaC\\xf2?\\x80y\\xe6\\x84\\xae3]\\'\\x94\\x03\\xed\\xb0\\r|b}\\xac\\n\\xf4\\x1f\\r\\xd1\\xd28=\\xb8\\xce\\x04\\xfd\\xabh\\xfd\\xc5,\\xf5\\xb7\\xfckl\\xe0\\xd9\\xa5\\xd2\\xde\\x9b\\xf0\\xb5\\xd0}+h\\xf5\\xaa\\x91\\xad\\xed\\xed\\x9b\\xed\\xfeOU\\x88\\xac\\xfd-\\x85\\xda\\xfdi\\xf7\\x0f\\xee\\xd9\\xb9\\xd9\\xfd\\xe3\\x8d\\x7f\\x19\\x88\\xf1\\xc1\\xea\\xb2W\\x9a$\\xc5\\x18Y\\xfbW\\x89\\xb5\\x9f\\x91\\xfd\\xd2\\xfd\\x0b\\xea\\xe8#\\x07Bd\\x1d\\x8f\\x11P\\xfd\\xc6\\x95\\x95E\\x0e>\\x81H;Ni\\xe3\\x99\\xfem~\\x9dB\\xf7U$\\xad\\xcb\\xc0y\\x96P\\xbfNZ~\\xd0y\\x8d\\xeb\\x88Zs^\\xcb1B?\\x87\\xbc\\xfc\\xdfh\\xf7\\xcf\\x12k\\xfe3\\xe0r\\xad)\\xd3{\\xbc\\x8a\\xc7\\xd8\\xa5\\xdc\\xd4\\x9a\\xf1\\xa5:\\x8e\\x83\\xf5\\xb1T\\x7fcm\\xf7\\xff\\xea_\\xf5\\xdf\\xed\\x96\\xa4\\xfe!\\xad\\xcb\\xe4\\x97\\x7f\\x95)\\xe2T\\x95\\x83\\x8f\\x03\\x0bB\\x14\\xcb.\\xc6:\\xbe\\x11\\xcbO\\x88\\xac\\xe3\\x1bg\\x19\\x8d7\\x8aJ\\xd7\\xaa0\\x92\\xf6y\\xb0T\\xaf\\xaa\\xba\\xfeD\\xd7\\xd4\\x8dm\\x8f\\xe1k\\xa1\\xfa\\xe8\\x1dB9\\xf9\\x95\\x9fBh|Vw\\xd0~\\xf8}hW\\x16k__Z\\xbb\\xb2\\xd0\\xf5\\xe0\\xebm\\xf6\\x96H\\xd9\\x98\\xbc\\x1d\"k;\\x9f\\xd0\\xbc\\x11\\xb4qFB\\xe3\\xdeI\\xfd\\x03\\xe3\\xde\\xc5\\xe2;\\xb1\\x95\\xcb\\xbf\\x19a\\xaa9\\x19\"\\xe4;\\x96\\xe6\\xa7\\x80|G\\xa8\\xdeK\\xe2;\\xac\\xfd\\x84h\\xd7O\\xbf\\x14?H\\xda\\xf9\\xdcW;_\\xee\\x17\\xc9\\x1f\\x89u\\xff\\x90\\xfc\\x91>\\x99o?\\x1eR\\xa4N\\xe7j\\xa71V\\x8f\\xdcV\\xd8iO\\xcc)\\xa8_[\\xea\\x8f\\x04\\xf5k\\x8f\\xcc\\x05sk\\xd84\\xf0\\x86(\\xcf\\xb9?\\xaeP\\xd3\\xb0\\xe0\\xba\\x9b\\x8f\\t\\xb5\\x8b\\xfd\\xdaQS\\xbd\\xd9\\xe9\\x05\\xeb \\xd2\\xb6\\x1b\\xed8\\xfdJ\\xd7\\xb9_\\xb4\\xf1L\\xbf\\xed\\xf2\\x18\\xb0\\xcd86\\x03\"m\\xff\\x90\\xfc\\xe3\\xbf\\xf6\\xcf\\x7f\\xef\\x1fZ;\\x9f\\xd0\\xfe\\xf9*\\x17\\xfeY\\xff\\xd0\\xe6\\t\\x16\\xca\\xdfh\\xe5\\x8fX\\xfb\\xd8t\\xfa\\xb3\\xd1\\xdd+\\xfe\\x87\\x87Bd\\xed\\xa7Z\\xe1\\xbe\\xb2\\xd1\\xb3:\\xcd9\\x88\\xac\\xe7%k\\xdb\\xd9\\xae{\\xbe\\xd1\\xe9\\x18\\xc6\\xde\\xf6s\\xdb\\x15L+:\\x86\\xd6O\\xf5\\x11\\xa1\\x7f\\xa0<\\xc5\\xf4\\x04\\x91\\xf5:\\x93\\xd0u\\xf4K\\x94\\xe5\\x08\\x9do\\x93\\xe8\\r\\xce\\xb7\\xaf\\x8e,<\\xe3\\xafomR\\x17\\x9cm\\xe4\\xd0wl%?\\x8cB\\xf7\\xb9\\x8bU\\x85f6r\\x9dv\\x10_\\x973\\xaeN\\xfd\\xbd\\xb8\\x9f\\xfd?\\xcd\\x8bC\\xa27\\x98\\x17\\xa7d\\xddy\\x1d\\xf5+\\x1b\\x85B\\xa4\\x9dg\\x9d\\'\\xf4\\x0f\\x9cg%\\x95\\x89m\\x94\\xf9\\xf2\\xc0.\\x8c>\\x99*\\xeb\\x8cC\\xdc Z\\xbb2\\x89\\xde ]\\x0b\\xf5\\x87%\\xd1\\x01\\xf4\\x87\\x15\\xba\\x0f!\\x89\\x0e\\xe0>\\x84\\x9f\\x9b\\xff\\xe8z\\x0b\\xf57H\\x07E\\xfa\\xbd\\xeb}7\\xea\\xce\\x1a\\x88b\\xe5\\xf9am\\xa7\\xc8k\\xfd\\'/\\xfb(\\xed\\xbe\\xf2b\\xc5\\xcf\\xed>PH\\x93\\x1a\\x9al\\x0f\\x91\\xf5z\\xa3X\\xfd\\x83\\xf3^@\\x84\\xfd\\xb3K\\xa0\\xfd\\xba\\xfb\\x99\\xc2\\x0b\\xb6\\x8eo\\x9a\\x01\\x91\\xb5~ \\x94\\x8f\\xd2\\xaeg\\x89\\xd5?\\xfdU.;|;\\x87N\\x84H;~h\\xf3y\\x8b5~\\x8e\\xa4\\xa5{>,{~<D\\xd6\\xe3\\'\\xa1Z\\xe9Y^WV\\xa7c\\xbc\\xa4Ye\\xda2\\xb0L\\x1f\\xe8\\xe7`\\xe9\\xfe\\x18\\xd0\\xcf\\xe1\\xafL\\xbf.\\xb2\\x01\\xdf\\\\\\x80\\xc8\\xdao\\xd0)\\xe9i\\x97v7\\x14\\x07 ~n\\xf1\\xf5\\x7f\\x10\\xca\\x81q\\x1fB\\xd7\\x83\\xf1\\xfe\\x8d\\xb0\\x9c\\xfc\\x8a\\x03\\xf3\\xae\\xffM\\xa5\\x99\\xc9\\xf6o0v\\xb9\\xb4xp\\xe8\\xa3\\xbd\\x12\\xc8w,\\xd5w \\xdf\\x81z\\xb5\\xa5\\xfa\\xb5X\\xeb\\xce[)\\xf9\\x8eX\\xeb\\xce\\x9a\\x8c\\xb2\\x03N=\\xfe\\xa6\\x01\\xc4\\xcf-\\xbf%)/(k\\xba&\\x8d\\x9f\\xfc\\xcaK\\x90<z\\xf9\\xba\\x93uSm0\\x0e)f\\x7f\\xaas\\xc5\\xd3\\x89p\\xfc\\xac\\x128~h\\xe3>\\x16ZX\\x1f\\xe8\\x8f\\x94Y\\xd5\\xb8 \\xad\\xfc\\xb0\\x16\\x18\\xf5\\xc5\\r6\\x9e\\xd6\\xe7\\xe40.\\x94\\xb4\\xee\\\\\\x8aP\\x0e\\x8c\\x0b\\x15+\\x0f\\x93Xtp\\x7f[ic\\xa1S\\xd5.Ad-\\xe7\\x0e\\xf4xa\\xa8Y\\xa7h D,\\xa0p\\x9c\\x91\\xa5\\xf4F\\xbb\\x8f\\x00\\xcc\\x13l)\\xbd\\xc1<\\xc1\\xbb\\x8c\\xc9\\xb5&^\\xec\\x92\\x88Q1\\xca\\xa7N\\xe9\\xe4Y\\xa3 \\xbdY\\x9a\\x9f\\x02\\xd2\\x9bX\\xf1fq\\x01\\x03\\x96\\x954\\x1e\\xf8\\r\"\\xeb8W\\xb1\\xec!b\\xf9\\xa5\\x89\\x95\\xa7\\xfeZ\\xc4\\x1a\\x8dO\\xed\\x9d\\xdd0\\xae\\xbaewe\\xe9\\xcd}\\xaeP\\xbf&\\xf17\\x1bB9\\xf9\\x95\\xa7\\xde\\xf7\\xfcR\\xe7A\\xad\\xe2\\xefCd\\xed\\xc7u+\\xfd\\xf5\\xc3\\x9f\\xdeEW\\x83H;\\xff\\xa1\\xa5\\xeb\\xb7\\xfe\\xb6m\\x0eoh]\\x1d\"\\xa47R\\xbc\\x19\\xa9>\\xbd\\xfa4;\\xd2;\\xb5_I|\\x1d\\xe7\\xdc\\xaf\\xc1\\x18\\xe3j%DZ~@\\xbbn&\\x96\\xfc\\x11\\xcaw\\xc4\\x9ag\\x91\\xfc\\xc9\\xe1<K\\xe8\\xba\\x19i\\x7fg\\xd6\\xeb\\x18\\x98\\xa0\\xf2*g\\x8e\\xc2\\xf1I\\xb7C\\x0150n\\xee:\\xf2V\\x9a\\xed\\xa3D\\xc8wH\\xf6*\\xd2\\xf8\\x81|\\xa7\\xe1\\xd4\\xebE\\x1f\\xbd\\xd1\\xad\\xc3hU8\\xfd\\xbb\\xa2\\xbei.\\xac\\xed\\xf1B\\xe7\\x0b\\xa4\\xf1\\xc3z\\xbe@\\xbb\\xee\\xac\\xdc\\xdf\\xe7F\\xabz\\x95\\xae`\\x84\\xf6\\x1d\\xdcn\\xa4\\xfe\\xa1\\xdd\\x1fP,\\xbd\\xb7J\\xdc\\xcei=^ti\\x0b\\x91\\xb5\\xdd\\xb2F\\xbb*\\xfd\\xab\\xbc\\xd88\\x05\"k\\xbe#\\xd6\\xfe\\xa7\\xb4rN\\xa8_\\x00\\xed|\\x8e\\xa4\\x87\\x90\\xe6\\xdbp>\\xd72\"\\xa3\\xd4\\xed\\x0b\\x13\\xe3!\\xb2\\xb6S\\xdc\\x19\\xad\\r)0b\\xe8E\\x88\\x9f\\x9b\\x9d\\x82\\xa4\\x8f\\xe6\\x97\\xfd\\xcd:fe\\xed\\xaee*]\\x83\\x08\\xe9\\x8dD\\x07u\\x08\\xe5|Bo\\x1b{\\xef\\xbd~\\xbd{)\\x88\\xac\\xf9\\x8e\\xf5\\xdc\\x8c\\xbd\\xf7\\x8c\\xa9\\x170v\\xef$_\\xf5\\xcd\\x0fGw\\xb2\\xce\\xb7\\xf1o\\x93?b\\x8dS\\xda|\\x0eB\\xe5\\x02\\xce\\xc7\\x07\\x91v\\xbe@\\xf2\\xf3\\x86t\\xddd\\xa9\\xfb\\xb4\\xda\\xd36v\\x87\\xc8\\x9a\\xaeW\\xd7\\x9f\\xf6\\xa7F\\xd7\\xe4\\x1cD\\xd6\\xfeHb\\xed\\xdbG\\x9b7\\x8f4Ni\\xf7_\\x10+\\x8fY\\x99\\xba\\xe6>\\x07N\\x19|!\\xc2\\xfe!\\xe5\\xdb\\xa0\\xdd\\xbfQ\\xac<\\x80x~\\x00\\x915\\x1d\\xd0\\xeaoB\\xcb\\xf9\\xa9\\xfc\\xc5\\x84M\\xe7\\xebyA\\xc4~\\xde\\x93^\\xda\\xa5,_\\xb8\\xed\\x0c\\xc9\\xff\\x8d\\xe4\\xdf\\xbb1\\xb4\\xb9u\\xb3\\x17\\xc5.\\xe1k\\xa1\\xf3S\\x12\\xdfa\\xbd\\x0eH\\x8aod-\\x7f\\x8a\\xe6`^\\xfc-\\xfe\\xd2\\x06\\x97\\xc0kV51\\xbe=\\xb4|L\\x97%\\xad\\xbfc=?\\xa5\\xe5;B\\xe7\\xa7\\x9b[m\\x1bYm\\x99{O\\x88\\xac\\xe5\\x82\\xd0<L$\\xb9\\x00\\xe3\\xe72\\x0bf\\x96\\x18V\\xb0\\xc8t\\x88\\xac\\xe56\\xad\\xfc\\xb1T.@~@\\xbb\\xbe@\\x9ag\\xdd\"\\x94\\x03\\xd7\\x17\\xc4Z\\xa7\\xdd\\xb6\\xbcq\\xb2\\xacC\\xb3u\\x10Y\\xcf\\x7f\\xc4\\x9a\\x07?o0{\\xdc\\xd6A=| \\xb2\\xde\\x97g\\xc3\\xda\\x88\\x05\\x95\\xad\\x8a\\x8e\\x83Hk\\xe7#\\xc9m\\xd6~\\xc4\\xb4\\xeb\\x18b\\xc5\\xd7O\\xee|&\\xc2\\xce}\\xdc\\x1b\\x88\\xd0\\xeeO\\x9a7\\x96#\\x94\\x03\\xed\\xfeb\\xadc\\xd0\\xfam\\x08]\\xc7\\xf8-\\xf8b\\xc3\\x9a\\xfd\\x1eT\\x86\\xf8\\xa5\\xfa\\xa9b9\\r\\x91\\xf5\\xfa\\x8fXr{B\\xcb\\xcbmO\\x8d{\\x9a\\x88\\xf1\\xfb\\x82\\xb7\\x9a\\xff\\xb9\\xb2\\xaf-\\xe6\\xd7!\\x87\\xe2\\x0f\\xfe\\xc6\\xf5\\xacj\\xe9~\\x940\\x0f\\xa0P\\xfd\\r\\xef\\x1f\\x0c\\xcb\\xc9/;R\\xffA\\xad%\\xdb*}\\x93\\x88q\\xe8\\xc3\\xbao\\x16]\\xa8\\xd8\\x9e\\xd6\\x8f\\xab\\x08\\xa1\\x9c/\\xd5~M;\\x9f\\x13K\\x9e\\xf6*w\\xfb\\xe2\\xd5\\x04\\xdf]\\x10Y\\xcbS\\xd2<\\x98V\\x7f#\\xe6%\\x00\\xfa[H\\xcd\\xb8\\xca\\x8d\\xfdC\\'A\\x84\\xf9\\x91H\\xf2\\xa7\\x0ch?\\xfc>\\xcc\\xcb&V<\\x86Xz\\xe2\\xa6\\x07\\xbf}\\xd7\\xb5\\xa0\\xbf\\x17DH\\x07\\xa4v#\\xe9\\xd7\\xf9%\\x7f\\x94M\\\\&\\xa4\\xbfi=\\x18\"k\\xf9s\\xc87\\xb5\\xec\\xe0\\xc2\\x93\"!\\xb2\\x9e\\xff\\xd0\\xae\\x03\\n\\xf5\\xc3\\x17j\\x17#\\xd15\\xb4\\x8be<\\xec\\xe3\\xec\\x17\\x99\\xd9\\x1f\\xe3\\xc5i\\xa7\\xf6\\x0cMP;\\xd3\\xca\\x05R\\xbb\\xc1\\xfat\\xbc\\x9e2&\\xa3h\\x86\\x1dDZ~@\\xda/\\x07\\xf2\\x83\\xd4\\xd2\\xd5\\xaf\\xedo\\xd5\\xc2\\x05\"k\\xfdM\\xacu&+\\xc7\\x1aw\\xbaF\\xf6\\xaa\\x06\\x11\\xf3\\xb7\\x8d;\\xe66|7\\xab\\xf1\\x99(\\x81\\xe3\\x944\\xdf\\xc6\\xfd\\x83\\xe7\\xdb\\xa4\\xfe\\xf9\\x96P\\x0e\\x9co\\x0b\\xcd;I[\\x9f?j\\xbe\\xf6\\xb2\\xaa\\xff\\xba\\x1aD\\xd6\\xf9\\xa2m\\xfe(1yc\\xdc/c \\xb2\\xce\\'$\\xd6\\xbe\\x15\\xff\\xb6\\xf5SZ\\xbd\\x97\\xd4?${/\\xe4o*\\xedx\\xd3\\x0f\\'\\x97\\xaf\\x84\\xc8Z\\xefM\\xda\\xff\\x9b\\xf55\\xd9\\xc4\\xf6\\x18\\x97/Z\\xb3\\xd1!vN0\\xeb<\\xa77{\\r\\xb9\\xd3o\\xf9\\x9d\\xee\\x18\\xbf\\xaf\\xb0\\xeb\\xed\\xc1\\xcb\\xa77\\xc3r,\\x1d?\\xb0\\x9c=K\\xeb;\\xb9W\\x1d\\xdd\\x02\\xa3\\xfb\\xb4\\x15\\xe1+\\xcbv\\xfb\\x83\\xb5<\\x15J\\xd7$\\xff\\x1d\\xd6tM\\x9b\\xa7\\xe4\\xff\\xebz\\xb0P\\xbb\\xb2X\\xeb\\xc1\\xb4qS\\xf9\\xed\\xe7\\xf0\\xa7Ht}\\x8f\\xb2\\xddR#\\xb7\\xfc\\xd0i\\x9d_G\\x8cp\\xbe\\xc0j\\x9dI\\xa8\\x1eO\\xdb?b\\xf9\\xd5\\xd0\\xf2\\xd1\\xaf\\xfb\\xd8\\xe4\\xf6\\x7f+?\\xfa;C\\x05\\xab\\x1f\\xceA\\x84\\xfc\\xcdR>\\n\\xf9[b\\x8bqe\\x1c\\xbb\\xa8KAd\\xbd\\xfe#4\\x0e\\x8c\\xa4\\xbf\\xc1v\\x13\\xcb\\x1eb\\xefe\\xe7\\xfc*\\xb6G0D\\x18\\xffC\\xb2\\x8b\\x91\\xf6\\x11\\x80\\xf1?b\\xd9\\xf9Tn\\xda\\x94\\x94\\xc5\\xcd\\x96Adm\\xe7\\x13j? \\xf9\\x8fB\\xfbA\\xbfn\\xd2C\\xea\\xf06O \\xc2\\xfd\\x99H\\xfc\\x80\\x14\\xaf\\t\\xf7g\\x12\\x8b\\x8f\\x8a\\x95\\xdf\\xbf\\xc6\\xb1\\x91\\xe7]\\x0f\\xa5$b\\x9c\\xb87\\xe2\\x90\\xeb\\x8c1\\xddi\\xf95\\xad\\xdeK\\xbb\\x8eN\\xca\\xefB\\x8a\\xc7\\x80\\xf3\\xfa?\\xe7<\\x95\\xae^;\\xc6\\x17\\xe2\\x97jw\\x11jW&\\xd1\\x01\\xb4+W~\\xbb\\xc6\\x18\\xd4\\xf4M\\x1aFR\\xff\\x90\\xec.\\xd5\\x08\\xe5\\xe4\\x97\\x9f\\x83\\xbdy_\\xcdR!\\xbd\\'@d-\\xe7HzH`\\xce\\xfd\\xbc\\xf6\\x93 \\xf17\\xd6~\\x01$\\xfe\\x06\\xfd\\x02|\\n\\x8f\\xbee\\xbe\\xa7\\x98\\x04\\x91\\xb6\\x7fh\\xfd\\x1c\\xfemy\\xcc\\xb0\\xfd\\x03\"\\xad\\x9f\\x03\\x89\\xbf\\xc1\\xf5\\x05\\x8f\\x92\\xfb\\xce\\x17\\xa9Z\\xbd\\rD\\xa1r\\xa1{\\xefU\\x97j\\xac\\x9b\\xf9\\xfe\\xe3[+\\xac<\\x17R$\\xa5\\x1eD\\xd6yd\\xfc\\x9a\\xb4\\x1e2u\\xfa\\xb1\\xf6\\x10\\x85\\xf2\\x038N=\\x8b\\r\\xd0\\xab\\xaf\\xcdp\\x87H[\\x0e\\xad\\x7f\\xbcP\\xfb(\\xc9\\xbe\\xc3\\xda>Z\\x96\\xd0n\\xac\\xe7\\xdb\\xa4q\\n\\xdbM\\xb5\\xb6e\\x8a\\xfbP\\xbfZ\\x10\\xe1\\xbaL\\x19\\x1b\\xe7\\xc6\\x9a\\xcc\\x99\\x1aZ\\xb9\\r\\xd7e~y\\x15\\xe15\\xb6\\xc4\\x94I\\x18;;U\\xd9\\xdc9\\xb8tM\\xda\\xf5\\x05R\\xde\\x08\\xa5_\\x81\\xfbU:\\xdc\\xd9\\x80\\xaf\\xebv\\xbe1{\\xf6\\x8f\\xaa\\x16\\x10Y\\xdb\\xabh\\xed\\xfeB\\xc7\\xa9Xq\\xfc+\\x97\\xefT^vL_\\x07\\x91u\\xfc\\x82X\\xfe\\xe4\\xb4\\xf6\\x1d\\x92?9\\x89\\xef@\\xfdZ(\\xdf!\\x8d\\x9f/5\\xaf\\x14-\\xdf\\x11\\xcb\\xae,\\xd6\\xfa\\xb6\\xd0x\\xcd\\x12\\x84r\\xa0\\xddE\\xac\\xf5\\xed}\\xa7K?Z|~\\xf0E\\x88X\\xbf\\xf6\\xb8\\xe0\\xe4\\xf0|\\x81\\xd3S\\xa1\\xf3\\x85\\xbbu\\xbd\\r\\x93\\x83\\xb6\\x9c\\xc4x0\\xfe\\x99\\xfd\\xc4\\xb2\\xd2\\xab\\xd0\\xdeK\\xdaG\\x8d6\\x9f]\\xda\\xdcE\\x7f>\\xef3\\xa9:Dl?\\xb84qXLr\\xf1\\x16\\xfe[\\x04\\xda\\x0f\\xb6\\xfb\\x94l\\'\\r?\\x9b\\x06\\x91V\\xdf\\xa1\\xddG\\xe0K\\xe1\\x07_\\xfd\\xaf\\xff\\xbb\\xff5\\x89\\xaeI\\xfc \\xbf\\xfc\\xaf\\xc5\\xf2\\xe3\\x12K\\x0f1\\xfee\\xb7z\\xc0\\xd1\\xba\\x91\\x10Y\\xeb!\\xcb\\xfe\\x9c\\xb0\\xefE\\xb7\\xea\\xeb0\\x86\\x05d\\x0cT\\xdfuoK\\xbb\\xceD\\x1bG\\xf9\\x95\\x1f\\xe4~}\\xa9\\xfc\\x80\\xa4\\x1fT!\\x94\\x93_\\xfc@h\\xfekZ~ \\x96\\x1f\\x97\\xd0xt\\xda\\xf9\\x9cX\\xfe\\x07b\\xe5\\xa5\\x16\\x1a\\'.\\x96?,\\xa9\\xdd\\xe0<\\x984Ni\\xfb\\x87V\\x7f\\xa3\\x95?B\\xf3\\x00\\x8a\\x15\\x8f\\x9e\\xd6\\xfaE\\xf5\\x95\\x03z\\xd5\\xc68\\xe8\\xc0\\x1d\\xaf\\xf9\\xb3\\xbf\\rc=N\\x03\\xadGDM\\x1c27\\x0e\"m\\xfe\\x1d\\xb1\\xfc-\\xc5\\x8a\\x13\\x17+\\xce\\x88\\x96\\xefL\\xa8\\xbd\\xba\\xff\\x93aM7@\\x14\\x1a\\xef\\xfc\\x89\\xff[b\\x8bf\\xe9\\xb6\\x8e\\x9f k\\xfd\\xad\\xae\\x8d\\xea\\xdc\\x9c\\xde\\xa6H\\x88\\xb4r\\x81\\x96\\xde\\xc4\\xdaGZ,\\xfb\\x8eX\\xeb\\xa7\\xb4\\xeb\\xdb$\\xbd\\x8a\\x14\\xd7\\x96_\\xeb\\xa7{\\x94}M3\\xbe-\\xff\\x00\"\\xeb\\xf5\\xd3\\xafq\\xd5\\xb9_\\xac\\xf5\\xf8\\x1e\\xc7\\xc7\\xfca\\xda}s\\x18,\\x07\\xbf`9\\xf9\\xa5\\xc7\\xe7\\x15\\x97\\xc3J\\x8fwL\\xf0\\xec|EV.\\x03\"\\xa6\\x83\\x7f\\x9a\\x1f\\xb6\\xfe\\x90\\xab\\x1d+5\\xaf\\x19\\x8f\\xaf\\xc5\\xf2O\\xa4\\xe5;\\x96\\xfa\\'B\\xbe#\\xbf\\xee\\xd4\\xc3vgX\"F\\xc9\\xf3\\xceN\\x97\\xa4n\\xe7\\xa0^e\\xa9\\xbd\\x17\\xeaUB\\xfd\\xdf\\x88\\xf9\\xb8\\x80\\xff[\\x99\\xc7\\xbf\\x1c,\\xf1fs\"DZ\\xbf\\rZ\\xf9\\xf3\\xb9\\xc5M\\x91\\xec|\\xa5\\t\\xe5@:\\x10\\xba\\x0f;\\x91\\xbf\\x81<2\\xb4\\xfb@\\x91\\xe2e>\\xb7}\\xa0h\\xf3\\x1f\\x08\\xdd\\x07j\\x93\\xf7\\x92\\xb8=\\xeb\\x8d7 \\xd2\\xae\\x97\\xd0\\xcaS\\xb1\\xf2E\\xd3\\xe6\\xf9\\xb1\\x94\\x8f~\\xe2\\x87\\xb2>\\xad\\xfd\\xecR\\xa5\\x9a`,m;\\xa2P\\xfa\\xe5U\\x9e\\xb4~\\x01\\xa4uZ\\xe8\\x17 V^\\x02\\xe7\\xc5\\x07\\x8a\\xdf-3h>\\xc4\\xcf-\\xbf?\\x89\\x8fB{\\xc8\\xf9\\x053g\\xdc+\\xe1v\\t\"k\\xbd7\\xbaj\\xc1\\x91\\xbe\\xb3\\xea\\xf7\\xc6\\xf8,\\xb3\\xa9,\\xa0\\x90\\xf3\\x1ahG\"\\xcd\\xebI\\xf1%\\xd0\\x8e\\xe4\\x1e\\xd8w\\xa2\\x92\\xbb:\\x0c\"n7\\xc3\\xce\\xc4\\x1e\\x0f/\\x8c[m\\xa9=\\xc4\\xd1{d\\x90\\xff\\xe0\\xa9\\xd8\\xedY\\xb0\\xfd\\xe0\\x0e\\xa1\\x1ch?`\\x95\\xff\\x00\\x8a\\xcf\\xcf}?J\\xa1\\xfau\\x97F\\x83;V\\xdeT\\xac5\\xc4\\xcf\\xcd_\\x99$\\x7f\\xe0\\xbc>\\x9a\\xd3H\\xa4rnO\\xe1\\xd1\\xd6\\xe8ee\\xfd\\xf1\\xcb\\n\\xbe\\x85\\xba\\x83/\\xee\\xe3\\x0f||\\xf9\\xf1\\x87\\xad\\xe0\\xc3\\xb2\\xbe\\x9d]\\xe6G\\x0f\\xb6\\xca\\xfa\\xc3\\x9f\\xce\\xb9\\xf5\\xf1#\\xad\\xf0\\xa5\\x15|\\xfc\\xdf\\xfc\\xc4\\x8f>c\\xf5\\xe1AV\\xb9\\xbeg\\x95\\xfb\\xe7Y\\xe5\\xfa\\xf2\\xc7\\xf5\\x01?\\xed\\xa3GgW\\x03\\x96\\xf8wu\\xfeP\\x0cl\\x0bk\\xf8\\xc25\\xb1\\xca)\\xd5\\xca*\\xd7\\x0f\\xcf\\xf99\\xd9\\xe5Z\\x81\\xaf}\\xf8\\xfa\\x87\\xdf\\xf2\\xf1\\xaf\\xfc\\xbb\\xd7\\xc7\\x15\\x85\\xbf\\xe3C\\x19VV\\x1fj\\x9d\\xbb8+k\\xf0\\xc6\\'O\\xfb\\x940r\\xfd&@H\\x9fT\\xc9\\xca\\x9a\\xd0H\\x9f\\x94\\x03\\x1b\\x1d<\\x177\\xcd\\xc7M\\xf7\\x9e\\xaf\\x80/}\\xd2b\\xb0\\xda\\x7f\\xf7\\x83s=\\x94\\xfc\\x93A\\xcfe\\x17f\\xf5\\x81\\xba\\xc1wr7\\x1fyd\\xfd]+}h\\xe2\\x0f\\xbf\\xe9=aY\\x7f(\\xf4o\\x893\\xfb\\x03\\x1f\\x8d\\xd4\\x8f?\\xf3I\\xc7\\xbf\\xaf\\x86\\xd5G\\xdf\\xc3M\\x8b\\x1f\\xf17d\\x88\\x1b\\x1f4\\xd9\\xc7=b\\x95\\xabAq\\x01\\x1f\\x7f\\x10Rx\\xee\\x0f\\xc3J\\xfd]\\xb9\\xf0\\x83\\xef\\t5\\xd7\\xe5\\x87^\\xb2\\xb2\\xfe\\xe8\\x17|D\\xca\\x80\\xc5X\\xe5\\xfa\\xb5\\x84Q\\x88\\x9fee\\x15\\xa3\\x94\\xab\\x82u!\\xdc\\xeeB\\xa3\\x0b\\xa3+N\\xa7U\\xa8\\x82\\xb9K\\x05\\x96\\xad0\\x94(a,Q\\xa2\\x84\\t\\xfd\\x970\\xf3\\x87\\x12\\xd1Y\\xc7\\x12Q\\xb5\\xa2jG\\xd5\\x8d\\xaaopp08\\xc8\\x8c\\x0eJ\\xa5\\xc1!\\xd4\\xe0\\xc0\\x19\\x1d\\x86\\xcb\\xa3\\x1aD5\\x8cj\\x14\\xf5m\\x94cTcs\\xe3\\x1e\\xde\\xae\\xe8\\xe8\\x8d\\x8eQM\\x8cM\\x9a416\\xad\\xd5\\xd4\\xd4\\xdc\\xb9Y\\xb3(\\'\\x93S\\xb3f\\xcd\\xf8Ckc\\x0bt\\xdd\\xd2\\xd8\\x12\\x1d\\xdb\\x1a\\xda64\\xb4m\\x14\\xf5}T\\xbb\\xa8\\x0e\\x17\\xea\\xbap\\x1a\\xb9T\\xd7\\xceK\\xae\\r\\x1a\\xed+Wq\\xf2v^\\x12N7\\xba\\x8f\\\\\\x1b\\xe8\\xae\\xd6\\x86\\xa2+\\xad\\xee\\xc3\\xa7\\xb4\\xea`\\xfc)\\xad\\x9c\\xcb\\xfd\\xa9\\xd8N.\\xden]{\\xba\\xf40t\\xead\\xe8\\xe4v\\xa1U\\'\\t\\xfa\\x9c\\x8bT:\\xba\\x8b\\\\%\\x93k\\xdb\\xf5\\x94\\xebu\\xa3{\\xeaC\\x03\\xd1\\xb9\\x0fj\\x81\\xd1\\xa8PN\\xadj\\xe7<\\x1a=W\\xe5\\x1b\\xae\\xe1\\x9f\\xca]h\\xf4\\xfe{9\\x9f\\xf5R\\xea\\xb5\\xb4\\x9f\\xfd\\xf8\\xb9\\xcds\\x7f\\xb6%\\xfdgG{\\xcb\\x83\\x94\\xf2\\x11\\xed\\xfa\\xcb\\xb9m\\xef\\xbf\\x95\\xf3I\\xa7\\xdcO\\xcd\\xaeeOu\\xe8?\\xaa%\\xff=\\xdaZ~\\xf4Y\\xf2/\\xdf\\xf6\\xfe\\xa3\\x7f\\xfbs\\x13;\\xa9UC\\xb2.:\\x85jLn.\\xbe\\x9d\\rn\\xbe\\x1b\\xdd\\xe4A\\n\\x95B\\'o\\x87N>|\\xdcE\\xab\\xfbp\\xa7\\xabJ\\x96\\xebN\\xbc\\x9b<X+\\xcfz\\x0c>\\xf5Rs\\xf8\\xd4G\\xaf1t\\xeegp\\xef\\x9b\\x80\\xa8C\\xae\\x08V\\xf1-i\\xec\\xe2\\xd5\\xf9B\\xcb\\x9cVr\\x97\\xffmeP\\xc5\\xd5\\x1c\\xc7\\x7f:\\xd7\\xcf6\\xfd\\xd8\\xdf\\xeb\\xc7\\xa8\\xae\\x86\\xae=\\r\\xdd\\xba\\x19\\xbbu\\xf3F\\xff>\\xc6\\x1e\\x9e\\x9d\\x0c\\x1en\\x17Zz\\xa8\\xd5\\xb2\\xac\\x1f\\xf8\\xb7\\xad\\xf3w\\xe4\\xea\\xaeP\\xfd\\xf7\\xaf9\\xff\\xedX\\xa0\\xff\\xda\\'\\xa5\\xd5|\\xff5\\xc2\\'\\x8c=\\xdd\\xbd\\x0c={\\x1a{\\xf6\\xf4B\\xff>\\x89\\xe8\\xe9\\xd9\\xfd$\\xd1\\xca\\x12>\"\\x91\\x94\\\\\\xe4\\x82\\xdb\\xc8M\\x1e\\x9a\\xf0\\xd1\\xef\\xb9\\xd0\\xe8\\xef\\t\\xe5\\xef\\xda\\xf6\\x82\\xa3%\\x15I\\xc9\\xf5\\xe1\\x8f\\x8a\\xff\\xfb\\x1b\\xa8\\xc2FO\\xef.1^\\xde\\x9en\\xbd;\\xf9\\x1a\\xbd\\xbc\\xbdL\\xe8\\xbfn\\xa2\\x97Z)\\xd1*t\\xe1h\\xb8\\x04\\'~\\xfc\\x9c\\x0f\\x17\\xder\\xe5\\x16/\\xbdJ\\xaa\\xf3Q\\xc8\\xe4|\\xd9\\xa3\\xb3\\xae\\xb2\\xee\\xb9j\\xa5C\\x897{\\xe9\\xd5\\xba\\x8fnvU)\\xc8\\xdf\\xcc}\\x93\\xff\\xe6\\xaa\\x0f\\x97\\x9d\\xd4\\xa1\\xa1\\x1f]\\xbaI\\xb8\\x90\\x8f.QS)\\x0c\\xde\\xaeFoWo\\xf4\\xefc\\xf2\\xf6\\xf4\\xf45x{\\x19}\\xfa{\\x98|\\xbbzt6\\xf8z\\xfeN\\xa0\\xa2\\xdf\\t\\xadk\\xe8\\xfd\\xa3\\xa1\\x8f\\xab\\xb1\\x8f\\xab\\x1b\\xfa\\xef\\x82\\xfe{\\xa2\\x7f/\\xf4? \\xf1\\xe3\\x8f}\\xb8\\xe8\\xaa\\n\\xca\\xba\\xc8\\xfaA\\x1ej\\x99\\xb1\\xaf\\x9b\\xaf\\xa1\\xaf\\x97\\xb1\\xaf\\xb7\\xab\\xa1_?\\xa3\\xbf\\x8f\\x97!  Jb\\x92\\x04*\\xe5F\\x89Ti\\x96H\\xd5\\xa1\\x1a\\xa3D&\\x8b\\x91\\xc8\\x86KTRyl\\x0e\\xca\\xcc\\xe8D\\xaa\\x8cFG\\x85T\\xceC\\xa8\\x1a\\xbd\\x17\\xa4\\x93k\\xcd\\x92`\\xb9Jg\\x94(\\x95&\\x89\\x92S\\'H\\x94\\xe8M\\x95D\\xa7\\x18.O\\xfc\\xe8\\x9c3HBM\\x12\\xf4-\\xa3$T\\x13\\x8b\\xfe\\xbfW\\x05r\\x1a\\x83De\\x94\\xa8d\\xd1\\xe8\\xbf\\xa9Z\\x1b\\x83@\\xabV\\xa0\\xd2Uj]\\x88\\\\\\x8bn\\x85\\xa3[\\xe1!\\xea\\xb0\\x04\\x89F\\xa3TH\\xd1\\xa3\\xd4\\xaa\\xc4\\x8f\\xce93\\xbaPs\\xb1\\xe8\\xa8UK\\xa4!\\x89\\x12\\xad4\\x04\\xb1$\\xa9N\\xafEu\\xd2\\xca\\xcd\\x88\\x908\\xf4\\x8b\\xf9#\\x87@\\xadGD\\xc7\\xcb#\\xf4\\xaf\\xe0t\\n\\xa9A\\x82\\x9e\\xc1\\xa1\\xdeFG\\x9dVm\\x90\\xe8L\\x12\\x9d\\x0e\\x95\\xad\\x1f\\x11\\x83\\xfe5\\x12\\x8e3\\x06Jd\\x86@yl\\xa0<X\\xa1R\\xc9\\xb51\\x81r\\xfe\\x0b\\\\t\\xa0\\\\\\x87*h\\x0cT\\x04G\\xa3\\xff`\\xb96.P\\xa1RK\\xf5\\x88z\\xe3\\xdf\\x9fq\\xa6@\\x85Vf\\xe6\\x0f\\x9c9P)\\x91\\x0e\\x8d\\x0eD\\xc3S\\x1bn\\x0eT\\xab\\xf4\\xe8\\xaeZ\\x8d\\xdeQ\\xeb\\x83Ct\\xe6@\\xad\\\\\\x82.\\xf8#\\xfa\\xac^\\xa1\\x94E\\x07\\xeaUC\\xf9\"\\xb3\\x00\\xfd\\x14\\xbd\\x0e\\xbd\\xa5\\xd3\\xa9U1\\xd9\\xc0\\xbf\\x15\\x8e\\xde\\nGC\\xcb\\x10\\x18n\\x90J\\xa2\\xa5\\x92P\\xb9V\\x12\\x93\\r\\x9cQ*Q\\x99\\xd1?j8\\xa9D#\\tT(\\x15:\\x85\\x9c\\x8b\\x7f\\x7f\\x11\\x8e>\\xa9\\xe1\\xdb+.\\x1b\\xd1\\x83\\xd0#\\xb4\\xe8\\xd7\\x99\\xa4H^\\xa0\\xef\\xeb\\xd0\\x89\\x8eC\\x0f\\xd1\\xa3\\xa6\\xcc:r\\x06\\xa9\\xd4,\\xe5\\xc9%N*W*5!j\\x95<\\xfe\\xfd\\x19\\x17-\\r\\x91\\xa8\\x82\\xe5\\xb1Y\\x80\\x9eg\\x96\\x86\\xc8%\\x9a\\x98\\xac#\"\\x19\\x84rmt\\xd6\\x11=U\\xa9\\xe6\\xe4f\\xa9Z\\x89\\x08 \\xeb(\\x97Eg!gB\\xcf\\xe7\\xef\\x84\\xf2\\x0fD\\xa3M\\xadJ\\xe0KTs\\n\\xbe\\xebc\\xb3\\xceQw\\xa2\\x8f\\xa9\\x86\\xa0\\xaf\\xa2\\xae\\x91\\xea\\xe2rP.C\\xf7U|7i\\xe3\\xf1\\x89\\\\\\xc6\\xdf\\xd5I\\x14\\xaa\\xec7\\xb3\\xcf8\\xfe\\x83:\\x85J/\\x8f\\xc3\\'2\\xfei\\x88\\x18\\x94\\xb19\\x88~%\\xfa]J\\xf4\\xb6V\\x8b\\x1e\\x8eJ\\xe4t\\xe8-\\xbdRf\\x96j\\xd10\\x88\\x91\\xa2\\x0eE\\xc3 .\\x07\\x95\\xe1&\\x99D;4Z\\x96E\\xfb\\xd12\\xb9\\x94\\xbf)\\x93\\xcbx\\xb2\\x95\\xcb\\x8c2\\xb9\\x06\\xbd\\xa9A\\xd2..\\x1b\\xf86G\\x14\\x85\\x84al6 \\xb2\\x92\\xc9u\\xe8=\\xf4#\\x951\\xd9\\xc0\\x19e\\n\\xf4\\x05EP\\x90\\x9c/$V\\x86\\x08\\x98\\x1f\\x9d\\x06\\x99\\xda$S\\x07\\x0eA\\x07\\x95\\xdc$\\xd3J\\xc2b\\xf8\\x03z&\\xbaPk\\xe2d\\x88\\xf9f\\xf7\\xd0\\xfb3.F.\\xd1*\\x15\\xa8/x\\x0c7\\xc9e\\xc1r3\\x7f@7d\\xa8yU\\xc1qr\\x99>{\\x8c\\xc5\\xcaC5Ju8\\xfaE\\xe8\\x87\\x9ay\\t\\xcd\\x1f\\x87\\xa8\\xc3c\\xb2\\x8e\\xa8\\xbb\\xe4*\\x9e|\\xe3\\xe5\\xbc\\x1e\\xa8@\\x9c\\x00\\xdd\\xe1\\x10i*$F\\xb9N\\x1a-\\xd7\\xa3\\x1f!\\x8f\\x96\\xa3\\xb1\\x84\\xea\\x9b\\r\\xa8\\x80xt\\x86\\x98\\xa4\\x1cU 1\\xfb4\\x14UJ\\xa24\\xa1\\x0be,:\\xa89D\\x93\\xfc\\xa7\\x10#\\xe4\\xb2~G\\xb8<X\\x89\\xc6c<>At\\x11$\\tU(\\xc3\\x8dA\\x12\\xad)\\x08\\r\\xe0h\\xfe\\x80j\\x15$\\xd1\\xab$1Ar\\tO\\xd7\\xb19\\xc8\\xa1\\x13\\xb9,\\x10\\x8d@\\x13:Q\\x9a\\xf9\\x03g\\x0c\\x92\\x87\\x99\\x82\\x14Je4\\x7f@\\x95A\\x10\\xaa\\x90\\xa2\\xb7\\x10\\xa3\\x08R\\xe8\\xccA\\xa8\\xa4\\x10tTk%\\xe6 4\\xa4\\xd1S\\xf8#\\xdfDAj\\xb5N\\x83\\xc6\\x8b\\xce\\x18\\xa4\\xd6F\\xa3\\xffP\\tz*O\\x93\\xd1A|\\xcdd1\\xd9\\xc0\\x99\\x82\\xb4\\xea\\xd0\\xd8 \\xfd\\x10\\x05\\xff\\xf4\\x18\\xfeD\\xc7\\xe9\\xa3\\x82\\x8d\\xc1r\\x9d)\\x98\\'\\x11t\\xe0\\xc7IV\\xb5br*g\\x08V\\xc7\\x04\\xabe\\x1cz\\x82)\\x18i\\x08\\xd1\\xe8\\x10\\x8cXu\\xb0Z\\x17\\x13\\xac\\x95hB\\x14\\xd2\\xb8\\x1c\\x94(cs\\xce8S\\xb0V\\xa11\\xf3\\x07\\xce\\x18\"\\x91\\x99Bx\\x06\\x1b\\x82\\x18\\xa4\\\\\\x15\\x97\\r|A\\xfcY8\\xba\\xa7\\xe5?0\\\\n\\n\\x91#ZF\\x07\\xa5\\xda\\x888/\\xba\\xd4\\xa2\\xf7\\x14\\xc1!\\xd1\\xfc\\x01\\xf1\\x9f\\x10Dkjm\\xb8\\x111Ws\\x88:0\\x10}W\\x8d\\xb8S\\x16-\\xe9\\xd09\\xea`t@O6\"n\\x1d\\xa50\\xa1\\xf1&1(\\x82\\x0c\\nU\\xbcB%\\x91\\xa2q\\x81\\x08?Q\\xa1B\\x03\\nUT\\xc1\\x93/j`=b\\xb9\\xe1\\xd1\\n$\\xee\\xa4\\xba\\x98l\\xe0\\xd0\\xfb\\xbc\\xd4@\\r\\x83N\\x86\\xa0\\x9bHx\\xe8\\x0c\\n\\xce\\xac\\xe08\\xbd<:\\xeb\\xc8\\x19\\x14:\\xd3\\x10\\xf4m\\xd3P\\xb9\\\\c\\x1a\\xaaR\\x87\\x99\\xf9\\x83\\xca\\xacD\\xf4\\x9cu\\x1c.\\x8f\\xe1\\x8f\\xfc @\\x13,\\xce\\xcc\\x1f\\xe4\\xd1YG\\x0e\\xbd\\xc3\\xa1wP\\xcdt&\\xa5b\\xa8\\xdc\\xcc\\x1fd\\xd1\\xe8\\xc8\\xd3\\xa5R\\x11\\xaa\\xd0eQ~\\xc2\\x87S.&\\xeb\\\\.C_P\\xf1_\\xe0\\xb9\\x1cb\\x9e:\\xa5\\x1c\\xbd\\xc3\\x17\\xa6\\x96\\xf2\\x94\\x1f\\xcb#\\xff\\x858|\\x82JS\\xf3?\\x02\\xb1\\xf9\\x18\\xfe\\x90\\xf5\\x8b\\xd4\\xc3\\xd13\\xd0\\x01\\x15\\x8a\\x8e\\x88\\x80\\x95\\xea0ch\\xcbf\\xf1\\xa1\\x12)\"\\x154\\x06%\\xa6P\\xc9Pyt\\xa8D\\xa5Gc\\x02A8: \\x96\\xc2\\x1f\\x10c\\x08\\x95\\xf0\\xa2\\xc7\\x1c*\\t\\x0f\\x94\\x1bB\\xd1\\xe7\\xd0W\\xf4\\xa1\\xf1\\xa1\\n\\xadV\\xad\\xe5\\xabg\\nE-e\\x08\\x1d\\x1a\\x8bd.\\xa2:TR\\xd6I8\\x02~\\x9c\\xc5d\\x03\\xfa\\x18bl\\xe8\\x80\\x86\\x0e\\x7f@\\xac \\x14\\xfd t\\x9e\\xd5r\\xa1zi\\x889T/\\x93\\x85\\xc7\\x86\\xea\\x95:\\x85F\\x89\\nC\\x8f\\x08\\xe7\\xe4\\xca \\xa3\\xcaA\\x17\\xad\\xca\\x1aY&\\x15\\x1aX\\xd1\\xfc\\x01\\xf1\\x06\\x1e8\\xa3J\\x1e\\x8c\\xce\\x86#\\xae\\xa1B\\x03L\\x85\\n7\\xa8\\xd4f\\x95\\x1a\\xc9a#\\x12\\xefq\\xe8\\x1f\\x91-\\xafy\\xa0~\\x8bUirt\\n\\x15\\xa7\\x0f\\x1c\\x12\\x97u\\xe4Eo\\xb4J\\x8f\\xf8\\xbe,\\x1aq7\\x9eD\\xb2\\x813\\xa8\\x83\\x0c\\xea\\x10\\x93z\\xa8$\\xdc\\xa0V\\x19y\\xae\\x97%u\\xd4*\\xbe_L\\x88\\x18U\\xe8\\xa0\\x95\\xc5\\xaa5:\\xd4k#\\xe5\\xd1\\xfc\\x89ZePk\\xcdj-\\x92\\x04\\xb1YG~\\x1cd+\\x1aj\\xbd\\xce\\xa4\\xe6\\x7f+OB\\xe8\\x1fI\\x0f\\r\\x12\\x0eY|P#A\\xa4+\\x19\\xa1\\xe0b\\xd0\\x99\\x0e1f\\xb3\\x86\\x97<\\xd1\\x1a\\xb9\\x1a5G\\x0cb\\\\A\\xbc\\xdc\\xc9A\\xc4\\xfb\\xd0\\x19\\x1a]\\\\\\xac&K[F\\x1c!\\x8b\\xe3Fg\\xf3]\\xfeB\\xa7\\x8e\\xcf:f\\x8d\\xd8\\x84\\x0f\\xa7\\xdcG\\xe7\\xe1\\xd1Y\\xe7\\\\\\\\6\\xa0\\xb1\\x15\\x8b\\xde\\xe4\\xf8\\x91\\x1e\\xa3Qd\\xa97\\xb19\\x88\\x9e\\xa9\\x18!W\\x9a4J\\x89*\\x1a\\xfd$$\\xb3\\xd19\\xd2,4\\xa8\\xb9\\xcc\\x1a5\\xaa\\x07:\\xe5\\xd0\\x0fB\\x07\\x05jq\\xfeJ\\x17\\xcd\\x1f\\x90(B\\xdc5\\x1a\\xfd#\\x91bB\\xa0\\xe1\\xcfu\\xba\\xf0X\\x04\\xc3\\x15j=\\x87\\xee\\xabc\\xd0?\\xfaZhl\\x0er\\xfc\\x1bH:\\xe8bs0\\xeb\\x8d\\xe1h\\xc8\\xc7\\xe6 \\xffX\\x9dY\\xc3k\\xc31\\xc3\\x10\\xfd\"%#\\x16\\xa1J\\xc7w\\xf10=\\x1aGf-\\xaf \\x98\\x91\\xa6#\\r1\\xa1\\xa3,\\x86?\\xa0\\xf6\\xe6Q\\x89\\xba,6\\x07e\\xd1\\xfc\\x892\\x1c\\x81\\x0cI\\xa6x-?\\xf9\\x96f\\x8d\\xce\\x0f\\xa7\\x1c\\xba\\x1b\\x8cxY\\\\6d?&\\x98\\xd7\\xbeP\\tJ\\xa9\\x12=\\x8c\\x93\\xf3\\xaa!\\xfa:\\xa7V\\xea\\xf9\\xef\\x18y6\\xa9ECW\\x1b\\x9du\\xe4\\x8c\\x9cD\\x16\\xcbI\\x86#\\x85V\\x1b\\x1e\\xcb!\\x91\\x8d\\xb4Fu\\x1c>\\xe1\\xcc\\xfc\\x99<:\\xeb\\x88>,\\x97\\x9b\\xd0\\x7fh4\\x7f@\\x9a\\x05\\x1a\\x11\\xd9\\xbf%\\x86C\\r\\x88~Al\\x0erq\\x1cb\\xb3\\x1a\\x15?&\\xb9\\x10\\x85\\xc6\\xc4w&\\x7f\\xd0\\x99\\xf9\\x03\\x17\\x8d\\x8e\\xbc\"\\x81$\\nR\\xady\\xb9\\x82z\\x88\\xe3[\\x80\\xe39\\x94R\\x17n\\xe2\\x10w0sH\\xb8(c\\xb2\\x8eH}A\\xa8\\xd5e\\x91T\\xc2\\x87S\\xce\\xc0\\xa9M\\x1c\\x1a\\xd8q\\xfcA\\x17\\xc2\\x0faN\\x8dz\\x02\\xe9\\tZ]L\\xd6\\x11\\rP^\\xed\\x1dj\\xe6\\xf99*\\x8f?\\xf2o\\xe9e\\xe11\\xfc\\xa8\\xe3\\xd5\\x1b\\x0e\\r\\xfbxN\\x8f4Z.\\xab\\xa1?\\x9c\\xa2_\\xabG\\xaa6z\\x96^\\x1b$A\\x13\\x84\\x1cD\\x8d\\x13&Gl\\x89\\x0bS\\xe8\\xa4!\\x06\\x9d\\xb3A\\xd7\\xc2\\xa4C\\x0c\\xcc\\xcc\\x1fT\\xd1\\xe8\\xc8\\x8f%\\xa4\\x98\\x87\\xa8x\\x1a6\\xe9\\xd0\\xf3\\xa2\\xf9\\x03\\xe2\\xa8:\\xf9\\x08\\x9dY\\x87\\xe4\\xd4\\xd0\\xd8\\xacc\\x90\\x1e\\xdd\\x0f\\x91\\xe8\\x8chl\\xa2\\x13y\\xa8Y\\x97%\\x8f\\xd01\\x1c\\x1d\\x90(\\xd0\\x85 \\x9d1\\x06\\x1dy\\xad96\\x07\\xb9h]H\\x16%!\\xe0\\xdf0\\xa1\\xb1/\\x8f\\xd6\\xf1\\xe2\\x04\\x95\\xa1\\x94i\\r:\\xb5Y\\xa7\\x96I\\xc2\\x8d:\\xb5\\xda\\x84\\xfe\\x95\\xb1:-\\x1a\\xe6<\\x1f\\xd0iy\\x16\\x89\\x8e\\x1a4E\\xe1\\x85\\x12\\xfa\\xe7\\xdf\\xd7#&\\xa04\\xe85F\\xa4\\xf4\\x9a\\xd0\\xbf,F\\xcf\\xe9\\xb3T\\x9c\\xe1\\x88(\\xe4\\xbalD\\x03%\\x86\\'!^K\\xc9A\\xce\\x84N\\xc2\\xa3\\x87+\\xf8\\x8b\\x98l\\xe0La\\xfc<)\\x0c\\r\\x04c\\x18\\x9aw\\x84!\\x99\\xa8\\x8d\\x0e\\x93g\\t\\xa209\\x7f\\x0b\\xf1dSX\\x88\\\\e\\x0eC\\xb2<\\x84?\"\\x1e\\x13\\x16\\xa2\\xe69\\xa9)\\x0ci(1\\xfc\\x81\\xefX\\xd4\\xd2!1\\xfc\\x81g^aj\\xed\\xd0x\\xfe\\x90=\\xc3I\\xf8p\\xcaE\\xf3\\xe7\\xa8\\x8b\\xc3\\xb2\\xa8,\\x0cM\\xa0\\x83\\xa3F\\x98G\\xf0<\\xcc\\x14\\x8e\\x06\\x85\\x99?p\\xc6p\\xb5\\xde4R\\xad\\x0e5\\xde\\x98\\x90\\x98\\xa5\\xee\\xcf\\x1d\\xcf\\xab>\\xc1\\xdc\\xdc\\x9f\\x92B$\\x9c?\\x9a\\x7f\\xf0\\x02\\xd6?{\\xcdhg\\x02B\\x95\\x7f0*B\\xc3\\xcd\\xddm=\\xe7\\xff\\x00\\xee\\xf1YC'", "year": "2021"}, {"Unnamed: 0": 191502, "autor": "qUxUp", "date": 1628931910000, "content": "Those of you who are familiar with the Fujifilm camera lineup, could you please give me some advice? Mostly regarding Fujifilm T lineup and a possible alternative to Fujifilm T 3 or 4. /!/ **TLDR: I went to a photography store and tried out multiple cameras. Ended up liking Fujifilm T3 and T4 the most. Now I'm looking to get some feedback from whoever is willing to drop a few lines :)** \n\n&amp;nbsp;\n\nHello! \n\n\n\nI used to study art, with focus on painting, drawing, composition, art history, design history, graphics design (corel, photoshop, macromedia flash rip). After that I worked as a designer for years (mostly graphics design). Did some photography (camera provided by employer) when needed but never had any formal photography training. I have never owned my personal camera. As a hobby I've taken photos with all of my phones (from dumbphones to smartphones, current phone is Google Pixel 5). My phone \"photography\" experience started around 2008. I've used most of the known android camera applications (Google Camera, Modified versions of google camera, filmic pro, open camera and many more); to expand on my phone camera capabilities I've used my own experimental \"lenses\", such as taking photographs through looking glasses, binoculars, eyeglasses, regular glasses, tinted glass, reflections from surfaces, through multiple surfaces, through containers filled with water etc. \n\n&amp;nbsp;\n\nAfter leaving the design industry I've continued to draw, craft and have taken photos with my smartphone. Since I've hit the technical limitations on my phone cameras for far too long and haven't found workarounds, I have realized that it's better to just get a dedicated camera as a tool to realize my artistic visions, capture scenes and moments as an artistic expression for myself and for my family and close friends. Most common photo scenarios: nature (flora, fauna, especially birds, insects), cats, people, some sort of astro photography capability would be a godsend, architecture, rivers, bunkers.\n\nGoogle Pixel 5 isn't giving me enough control over pretty much all settings (I posted the limitations to my previous thread, but just in case, I'll add them to the end of my post). \n\n&amp;nbsp;\n\nAnyhow after the suggestions I got on reddit I did much more research - found out that I really like how Fujifilm camera colors look pre-editing, the multiple physical controls on the camera. Earlier today I went to a photography shop and tried different cameras (held them in hand, how they fit, how the buttons feels etc). \n\nOut of the ones I tested (and considered to fit my needs) Canon m50 mk 2 was okay (it didn't feel that good to be honest) but I loved Fujifilm t3 and t4. Those seemed to fit my hand size perfectly. I also really enjoy physical controls on the camera. As a bonus my partner also liked Fujifilm cameras the most, so that is a plus. \n\n&amp;nbsp;\n\nSo with that wall of text aside.\n\nMy plan is to stick with this camera for years. This could be a very wrong approach when it comes to photography, so please correct me if I'm wrong: I usually prefer to buy a single high quality tool and use it for a long time, until it breaks and/or I reach a technical limitation (less bought products = smaller carbon footprint and so on). I also want to invest in a few lenses after buying the camera &amp; keep expanding the lens selection as the need arises. At some point I'll buy another camera (or cameras?), but I don't see that happening for many years. \n\n&amp;nbsp;\n\n**Are there any other cameras besides Fujifilm T3 &amp; T4 that I should consider?** While I have an art education and experience as a graphical designer and I've taken photos on my smartphones, I have not owned a dedicated camera, so I consider myself to be a beginner. Fujifilm T3 and T4 seem good and I love the variety of controls, but they are also quite advanced. \n\n**Would it be a bad idea to get a camera that advanced with my very limited experience? Fujitsu T3 and T4 cost around 1300 - 2000+ € in Estonia. Perhaps there is something cheaper that I should take a look at?** \n\n**Besides Fujitsu T3 and T4, are there any other mirrorless cameras that I should take a look at? I live in Europe, Estonia and there is a quite decent used camera market here. I'm hoping to buy the camera used but if that's not possible, I am open to buying it new locally or ordering online (if you know any good locations for buying used or new cameras in Europe that ship in Europe, I'd be very thankful for the suggestion).** \n\n\n**The features I am looking for:** \n\nmultiple physical controls, \n\nmany manual settings,\n\nweight around 500 g (without lens) would be perfect but I'm also open to cameras that are around 400 g or a little less \n\nquality build \n\n\n&amp;nbsp;\n\n\n\n\n**Oh... my. Thank you so much for reading my post! If you have any suggestions or thoughts, I'd be very happy to read them. I am an open book and here to learn!** \n\n\n&amp;nbsp;\n\n\nCheers :) \n\n\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n\n\nMy current technical limitations:\n\nI can't switch lenses (it would be lovely to have the option to use different lenses to optimize the picture depending subject matter),\n\ncolors can be very inaccurate,\n\nthe photos are stored in the phone which is connected to internet (I'm trying to slighlty distance myself from the internet);\n\nfocusing issues,\n\npictures in medium range and distance are too blurry,\n\nsharpness of edges,\n\ntoo little control over various camera settings (light, focus range etc),\n\nchanging settings on a smartphone camera is very inconvinient and slow - I'd like to be able to change settings faster,\n\nproblems in medium and low light make it very hard to take decent pictures (details get muddy, there is much more noise),\n\nproblems with capturing moving objects,\n\ntoo little control over colors,\n\ntaking pictures of objects that are dark colored are very hit and miss (one of my cats is black, it's very sad that I currently can't capture her savagery well enough),\n\nzoom causes noticable noise (long range pictures) ,\n\nlittle details are muddy when looking up close,\n\nI'd like to take long exposure shots,\n\nI'd like to have more control over different settings (like exposure, higher resolution),\n\nno tripod supprt,\n\nit is very small - I'd like to get something that is bigger and if there is an option to change how the camera feels in hand (maybe grips?) it would be sweet,\n\n:P.", "link": "https://www.reddit.com/r/fujifilm/comments/p44owx/those_of_you_who_are_familiar_with_the_fujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "those of you who are familiar with the fujifilm camera lineup, could you please give me some advice? mostly regarding fujifilm t lineup and a possible alternative to fujifilm t 3 or 4. /!/ **tldr: i went to a photography store and tried out multiple cameras. ended up liking fujifilm t3 and t4 the most. now i'm looking to get some feedback from whoever is willing to drop a few lines :)** \n\n&amp;nbsp;\n\nhello! \n\n\n\ni used to study art, with focus on painting, drawing, composition, art history, design history, graphics design (corel, photoshop, macromedia flash rip). after that i worked as a designer for years (mostly graphics design). did some photography (camera provided by employer) when needed but never had any formal photography training. i have never owned my personal camera. as a hobby i've taken photos with all of my phones (from dumbphones to smartphones, current phone is google pixel 5). my phone \"photography\" experience started around 2008. i've used most of the known android camera applications (google camera, modified versions of google camera, filmic pro, open camera and many more); to expand on my phone camera capabilities i've used my own experimental \"lenses\", such as taking photographs through looking glasses, binoculars, eyeglasses, regular glasses, tinted glass, reflections from surfaces, through multiple surfaces, through containers filled with water etc. \n\n&amp;nbsp;\n\nafter leaving the design industry i've continued to draw, craft and have taken photos with my smartphone. since i've hit the technical limitations on my phone cameras for far too long and haven't found workarounds, i have realized that it's better to just get a dedicated camera as a tool to realize my artistic visions, capture scenes and moments as an artistic expression for myself and for my family and close friends. most common photo scenarios: nature (flora, fauna, especially birds, insects), cats, people, some sort of astro photography capability would be a godsend, architecture, rivers, bunkers.\n\ngoogle pixel 5 isn't giving me enough control over pretty much all settings (i posted the limitations to my previous thread, but just in case, i'll add them to the end of my post). \n\n&amp;nbsp;\n\nanyhow after the suggestions i got on reddit i did much more research - found out that i really like how fujifilm camera colors look pre-editing, the multiple physical controls on the camera. earlier today i went to a photography shop and tried different cameras (held them in hand, how they fit, how the buttons feels etc). \n\nout of the ones i tested (and considered to fit my needs) canon m50 mk 2 was okay (it didn't feel that good to be honest) but i loved fujifilm t3 and t4. those seemed to fit my hand size perfectly. i also really enjoy physical controls on the camera. as a bonus my partner also liked fujifilm cameras the most, so that is a plus. \n\n&amp;nbsp;\n\nso with that wall of text aside.\n\nmy plan is to stick with this camera for years. this could be a very wrong approach when it comes to photography, so please correct me if i'm wrong: i usually prefer to buy a single high quality tool and use it for a long time, until it breaks and/or i reach a technical limitation (less bought products = smaller carbon footprint and so on). i also want to invest in a few lenses after buying the camera &amp; keep expanding the lens selection as the need arises. at some point i'll buy another camera (or cameras?), but i don't see that happening for many years. \n\n&amp;nbsp;\n\n**are there any other cameras besides fujifilm t3 &amp; t4 that i should consider?** while i have an art education and experience as a graphical designer and i've taken photos on my smartphones, i have not owned a dedicated camera, so i consider myself to be a beginner. fujifilm t3 and t4 seem good and i love the variety of controls, but they are also quite advanced. \n\n**would it be a bad idea to get a camera that advanced with my very limited experience? fujitsu t3 and t4 cost around 1300 - 2000+ € in estonia. perhaps there is something cheaper that i should take a look at?** \n\n**besides fujitsu t3 and t4, are there any other mirrorless cameras that i should take a look at? i live in europe, estonia and there is a quite decent used camera market here. i'm hoping to buy the camera used but if that's not possible, i am open to buying it new locally or ordering online (if you know any good -----> locations !!!  for buying used or new cameras in europe that ship in europe, i'd be very thankful for the suggestion).** \n\n\n**the features i am looking for:** \n\nmultiple physical controls, \n\nmany manual settings,\n\nweight around 500 g (without lens) would be perfect but i'm also open to cameras that are around 400 g or a little less \n\nquality build \n\n\n&amp;nbsp;\n\n\n\n\n**oh... my. thank you so much for reading my post! if you have any suggestions or thoughts, i'd be very happy to read them. i am an open book and here to learn!** \n\n\n&amp;nbsp;\n\n\ncheers :) \n\n\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n&amp;nbsp;\n\n\n\n\n\nmy current technical limitations:\n\ni can't switch lenses (it would be lovely to have the option to use different lenses to optimize the picture depending subject matter),\n\ncolors can be very inaccurate,\n\nthe photos are stored in the phone which is connected to internet (i'm trying to slighlty distance myself from the internet);\n\nfocusing issues,\n\npictures in medium range and distance are too blurry,\n\nsharpness of edges,\n\ntoo little control over various camera settings (light, focus range etc),\n\nchanging settings on a smartphone camera is very inconvinient and slow - i'd like to be able to change settings faster,\n\nproblems in medium and low light make it very hard to take decent pictures (details get muddy, there is much more noise),\n\nproblems with capturing moving objects,\n\ntoo little control over colors,\n\ntaking pictures of objects that are dark colored are very hit and miss (one of my cats is black, it's very sad that i currently can't capture her savagery well enough),\n\nzoom causes noticable noise (long range pictures) ,\n\nlittle details are muddy when looking up close,\n\ni'd like to take long exposure shots,\n\ni'd like to have more control over different settings (like exposure, higher resolution),\n\nno tripod supprt,\n\nit is very small - i'd like to get something that is bigger and if there is an option to change how the camera feels in hand (maybe grips?) it would be sweet,\n\n:p.", "sortedWord": "None", "identifyer": 84285, "doc": "b'x\\x9c\\xed]\\x07\\\\S\\xc9\\xf3\\x07{\\xef\\xe8!\\xd8\\x0b\\xea\\xa1(\\xa8g9\\x0b\\x88x\\x16\\x04\\x01{\\x81\\x90\\x04\\x88\\x86$\\xa6\\x88\\xd8O\\xcf^N=\\xbb\\xa2\\x92F\\xb5\\xa1\"*\\x16\\xec\\xbd\\xd7\\x9f]\\xec\\x8a\\x8a\\x9eb=\\xff\\xfb\\x80U\\x19o\\x7fl\\xee\\xed\\xef\\xa1\\xf77\\x9fO\\xde\\xf7\\xbd\\xbc\\xe4mvwvfvvfvj\\xd40\\xa9Z#S*\\x0c\\x8d\\x1b51\\x89\\xb4Z\\xb5&\\xc2\\xb5C\\xe7.]\\xbbyv\\xf7\\xf2>j\\xbd\\xe7\\xa8\\xf5\\xde\\xa3\\xd6\\xfb\\xccZ\\xe5\\x10\\xa9B\\xb3\\xcf*_\\xd3\\xb5\\x85\\x96\\xde]oJ\\x1a\\xff\\x0bD\\x7f\\xab\\xac\\xd7\\xe2\\x9b\\x06\\xbb\\xd1\\x117N\\xaf\\xb2\\xce\\xba\\xceg\\x95\\xf3U:\\x1b\\xad\\xc1\\xe7E\\x02\\xeb\\x1cV\\x06\\xdc/\\x88\\xaf\\xb7o\\xee\\xb9\\xef\\xc6\\x8d\\xae% \\xf6\\xcc\\xbe_-hP\\x9as\\xe0\\xe3\\xb2[\\t\\xe5|\\x00/\\xfc\\xf9\\x01P\\xf0@\\xb7\\xa7\\x89)\\xc3\\x8e\\xc9 \\xe2\\xfa\\\\\\xae\\xd3\\xce\\xa9\\xfa\\xcbI\\xdb6YX\\xce_c\\x02\\xcf-\\x13\\xf7\\xdc\\x82\\xafM\\xcf$\\xbf\\xb5\\x0f<\\xda\\x0c\".\\xa7\\x98\\xcf\\xaa\\x1a\\xea\\xdd[\\xddH\\xed\\x86\\xffvn\\xf5\\xd9\\xfea\\x81\\xe3\\x10\\xd5\\xec\\x8e\\x18_^3U\\x8do\\\\qv\\xef\\xec\\xfb\\x8b\\xdf\\xfa:\\xf6\\xd7\\xfe6v\\x07\\xa1\\x9cw\\x84\\xfax?-\\xbf\\xa7\\xc8\\x8cQ{\\xf1\\xf5\\x85\\xf9\\xf7\\xec\\xb6\\xbf>\\xe6\\r\\xd1/\\xfb\\xfe\\xc5\\xd5\\x05\\xf6L\\xd9\\x1f>w\\x96\\x85\\xed\\x16\\xfc\\xc1\\xaeJ\\xe4\\xa9\\x9a\\x1a|\\xadP\\x8f3\\xfe|j\\xc5*\\x88\\xac\\xe9`\\xee\\x12M3sP\\xa9`\\x88\\xfdp\\xbbe\\xd3\\xf5\\nB9\\xf9Ay\\xf8\\xf3\\xc7\\x0b\\xcb\\x0c\\xb8\\x9e\\x94\\xf8\\x1a_\\xbb;\\r\\xbf\\xe1\\xe6\\x9c\\xaf\\t\\xc4\\x80\\xec\\xfbe[\\x9d\\xdf\\x99:\\xa1\\xc9%\\xdf\\xae\\x0e5_n\\x8f\\x13\\xe1\\xe7\\x8e\\x05\\xe5\\xc2r\\x9cv^}S\\xb3\\xe9\\xa6e\\xf8zN\\xc1\\x9e\\xe3\\xdd3~\\xae\\tq@\\xf6\\xfd\\x84\\xda\\x07:\\xc5\\xb5\\x1dz\\x06\\x97CKo\\xb0\\x9cN\\x17\\xea\\xea\\xbb$\\xacZ\\x08\\x11\\x96C\\x1a?$z\\x83\\xe5l\\xaeXy\\xfa\\xcc\\xb4w\\xb5 \\x8a\\xc0\\xfdm\\x84r\\n\\x10\\xea\\xf3$\\xff\\xbc5\\'J\\x8d<\\x8d\\xafS\\xf4\\xafoO\\xd1Z\\x85@\\xc4\\xe3\\xa7\\xdc\\x02\\xfb\\xc4\\xb5\\xab\\xbcn\\xcc\\xb7\\x90\\x0ev\\x1d\\xed\\x7f\\xa2N\\xbe%\\x0e\\xf8\\x9a\\x96\\xef\\x90\\xf8\\x01\\x89\\x0e\\xc6\\x18#&,~\\xd5^\\x8c\\xaf\\x97U\\xe9\\xd0^\\xdfHl\\r\\xb1\\x7f\\xf6\\xfd9M\\x8d\\x15d>\\xb5\\x1b\\x9ax\\xf2\\x9d\\xf1\\x9dZ\\x8cq\\x9a8#\\x12\\xa2$\\xfb\\xfe\\xa0M\\xe1\\xa7\\xaa],\\xb3\\xb7\\xdb\\x89\\xd1O\\x8c{n\\r\\x85\\xe5\\xe0\\x17,\\xe7\\x84\\x87\\x8f<\\xfdMX\\x0b|=\\xaeY\\xdfc\\xbb.Oy\\x87qGG\\xf7\\xa1\\x1f\\x92*\\xb9\\xc2v\\x9bW\\xfa\\xd0\\xb0}\\xb7\\n\\xfdD\\xcb\\x0f\\xaa\\xbe\\xee\\x7f\\xf3j\\x952]\\xf1up\\xc8\\x05\\xf7\\xea;\\xea\\x8a \\xd2\\xf2\\x03\\xdav\\xf3\\x9fS\\xfc\\xda\\xe4F\\xee\\xf3!\\xc2\\xf1\\xb3\\x92P\\xce{\\xca\\xf1\\xe3\\x11\\xd8{\\x82\\\\sm(D<~\\xf4\\xbb\\xe2\\xbb=\\xba8v\\ri\\xfc\\x90\\xc6\\xa9\\xa3\\xcf\\x88 \\xffAS\\x06\\xe2k\\xb7\\xbe\\x01\\x9b\\xca\\xe8\\xda,\\x86\\xd8+\\xfb\\xfe\\xcd\\xad\\xb7\\x1a{\\x94\\xed\\x9cov.\\xed\\x06\\xf5\\x03\\xd8n\\xb5\\x96\\xd7\\xfc]r\\xe2@3\\x8c\\x9e\\x11\\x9d\\x95\\xf7t\\xae\\xff\\xc1\\xf46\\xfb\\xd1X\\xcf\\x16\\xee]l,\\xa5\\xb7\\x0fu\\xfb\\x9fh?\\xe2\\xfc\\t|-\\x14\\xbf\\xae-vs(9\\xb9\\xcbY\\x88\\xa4r\\xf2\\x8a_\\xd3\\xd2\\xdb\\xd9N\\x97\\x1df4\\\\W\\rb\\xdf\\xec\\xfb\\r\\x1a\\x0e\\nt\\xadu\\xf1\\xf9B\\x0b\\xe5\\xb6St\\xbb\\xce\\x83</\\xd6\\xc5\\xd7\\r\\xba\\x06\\xbf\\\\\\x7f\\xfbG\\x13D\\xdaqJ\\xea\\x9f]\\xbd\\x17\\xf4\\xaa<K\\x1c\\x8e\\xaf\\xa7\\xd6Jw\\xa8\\xee\\xd6\\xaf\\x1cD\\xa8\\xef\\xcc\\xb5\\x90\\x1f@}\\xe7v\\xe3\\xf2\\x0f\\xe3\\x0e\\xb8>\\x82\\x08\\xfbg\\tOy:\\xfbuu\\xeb\\x84\\x96\\xcb\\x9bBd\\xadWY:~\\xfe)]\\xd3\\x8e\\x1f\\x12]\\xffE\\xd9n)W\\xcf\\x1b\\x97\\xb9\\x0f*\\x02\\x113\\xc0\\x01\\xd5\\xcb\\'=\\x1c\\xf5\\\\\\xdb\\'\\xfatB\\xaa\\xc6!\\x01\\xf3\\x83\\x99\\xd6\\xff\\xbd\\xdd\\x12\\x8bV[:q\\x93KE|\\x9d|\\xb9\\xe5\\xe2\\xb0.\\xf7] \\xd2\\x8e\\x1fb}\\xc0\\xf8\\x19\\x16\\xb6\\xe7l\\x97-\\x03\\xefA\\x84\\xf5\\xc1\\xf4\\x06\\xebC\\xe2\\x07\\xb0>X\\xbe@\\xa4\\x95?\\xcf\\x08\\xe5@\\xf9\\x93a\\x7fF\\x15P\\xe6\\x94-D\\\\N\\xb9)\\xb5\\xdf\\xddy\\x11t,7\\xb9\\x90\\x9b\\xfc\\xf1yX\\xfef\\x85\\xe1\\xe7\\xec \\xc2rH\\xf5\\xc1\\xd7\\xff\\xebrh\\xf5\\x90>Ck6^w\\xa4\\xd3~\\x88X\\x9e:\\xf7\\x9d+z~\\xaex3K\\xe5i\\xc1\\xe2;*\\xb4k\\xf2z\\x1a\\xbe^P\\xdcq\\xb5\\xf7\\x1f\\xc5WB\\x14\\x81\\xfb\\xa4\\xfa\\xd0\\xf2\\x9dj\\xd5\\xae\\xa9j\\xcf\\xdd\\xee\\x81\\x91\\xa4\\'Z:\\xdf~\\xdc}\\xf3\\x83G\\xcb2\\x86\\xe1k\\x7f\\xe7&\\xaf=\\x06\\xf4\\xf6\\xc3X\\xff\\xf8\\x9d\\xa5K_\\xd9(q\\xbb\\xddk1r\\xe3\\xc4@e\\xda\"\\x0b\\xe5\\xa9\\xdb\\x9a\\x05\\x11\\xc5\\x9a\\xf6\\xfb\\x0b_\\x0b\\xc5\\xaf\\x85\\x92\\xa7~\\x97\\x1a\\xbf\\xba2\\xef\\xf7\\xe9\\x10Y\\xcfOuE\\xf56^\\xd6\\xe7\\xa5\\x10\\xbf6}\\xe7-%\\xbf\\x16M\\xd6u_~\\xbf\\xf9\\x0e\\x8c\\xabo\\xdb]]vk\\xbf\\x1b\\xa47\\x92~\\xf0\\x86\\x92\\xde\\x12t{\\xa6vJ\\x9dQ\\t\"\\xa6\\xb7\\xcb\\x13\\x86F%\\x16m\\xea\\x9f\\xcc\\x93\\xdeT\\x89\\xe9\\x17\\xab$\\xef\\xbe\\x03\\x91\\xb5^5yJ\\xbe\\x82\\xba7\\xcf_a\\x84\\xf6\\x90\\x91\\xdd\\xaa\\xfcP\\xb0\\xc7\\xb5b\\x96\\xce\\xb3\\x8a\\x0f_\\xd0\\xbc\\xd0\\x96\"\\xb6\\xf8\\x9a\\xaf\\x9c{I(\\x07\\xca\\xb9u~\\xc7G\\x15\\x89\\xf4<\\x8fq\\xdc\\xd4\\xd8K\\xf7\\xeax\\xbc\\x87t`\\xa9\\x9c\\x83t\\x90:g\\xd1\\x9f/{M\\xac\\n\\x915\\x1d\\x84\\xf8N\\x9d\\xb4\\xf0\\xde\\xc9\\xc7\\x18\\'u<\\xbb\\xc4\\xcec\\xec;8\\x9f\\xdbe\\xa1\\xbe\\xf3O\\xe7s\\x98\\x0e\\xe0|\\x8eT\\x1f\\xc8\\x0f\\x02z\\xef\\xf4Y\\xf86\\xac\\xec\\x17\\x08\\xca\\xf9\\x03\\x943\\xde\\xc2r\\x84\\x9ag\\xd9\\xae\\xae7\\xe7e\\xf5\\x84g\\x10a}\\xa0\\x9e\\x88\\xdb\\x8dV\\xbf\\xe6k\\x87%\\xcam`\\x87=\\xff\\xb2\\xfaI\\x9b4\\xbb%\\x10\\xb1\\x9db~\\xfd\\xbf\\xaa\\x15\\xfca\\xbc]\\xbc\\x85|t\\xe6\\xb9\\x01a]\\xaeo/\\x86\\xaf\\xf9\\xf2\\x83\\x0cJ~\\x90\\\\5\\xc4\\xba\\x82\\xc9\\xee1DZ\\xbb\\x0b\\xee\\xaf\\xdc\\xf4Q\\xbez\\x15I?\\x80z\\xd5\\xc9\\xd8\\x9dA\\xeb7\\x14\\x1a\\x16P\\xeay\\x9dD\\xbdWI\\xd2:\\x06\\xc9\\x0eK\\xa2\\x83\\xea\\x87B\\x9c\\xf2EV\\xaa\\x80\\xaf\\xef\\xd5\\xf6\\xd1O\\nJ>\\x85\\xf1P\\xec\\x0b\\xfb\\t\\xa5\\xc5\\xd7X\\xdb\\x91H\\xfa\\xdb\\xa0\\xec\\xfb\\x8e\\'$\\x9d\\xa6=\\x8b\\xf2\\xb4\\xb4>\\xb0\\x7f\\xda\\xdfH\\x1a\\x9d^8\\xdd\\x0e\"\\xb4\\xc3Z\\xcaG\\xa1\\x1dV(\\xfb\\xe8\\x84b\\x92\\xc7\\xe5O\\'\\x04C\\xa4\\xb5\\x8f\\xd2\\xf2\\x9d\\x18\\x97>\\xf5F\\x1b\\xd6\\xc8!\\xb2\\xd6\\xaf\\xfb\\xffb\\xfc\\xf5\\xd0k_o\\x88\\xac\\xd7\\x01\\xdd\\x92\\x1eU\\x92\\x0c\\xeb\\xe3\\x84\\x11\\x8e\\x9fr\\xef\\xcb\\xc5\\\\\\xee\\xdd9%\\xd1\\xc2v\\x1bp\\xfeO\\xef\\xfe\\x8f\\x9e\\xf5\\xc1\\xd7\\x85:\\r\\\\\\x976\\xfe\\xcd\\x04\\x88\\xac\\xd7\\x01\\x85\\x1a?\\xf3{\\xa5\\xa7&\\x8c,P\\x18\"\\xeb\\xf1C;\\xcf\\xdana}\\xe0<k\\xe5o\\xed\\xb7\\xbdh\\xb2\\xda\\x08\\x91\\xb5~}\\xa9\\xc0\\xaa\\xa3]\\x1e\\xc5\\x8c\\xc5\\xd8\\xe8\\xcc\\xad\\xd3u\\x07\\x86\\xff\\xc6Z\\xbf\\xf6\\xcc\\x98?\\xa7\\x9aM=\\x1f\\x88\\xb4\\xf6\\x10\\x92\\x1d\\x89\\xb5\\xdd\\x85\\x96\\x1f\\x08e\\xdf\\x99\\xb5x\\xb3dq\\xd0\\xd2\\x12\\x10\\x83\\xb3\\xef\\xab\\x8bO<\\xed\\xd5)\\xce\\x7f9\\xa1\\x9c\\'\\x94\\xf5\\xa9\\xd1`\\xdfy\\xfb\\x0e[\\xcfAd\\xad\\x8f&\\x1f\\x99~\\xed\\xfd\\xe8\\xa4A\\x10i\\xed\\xe4\\xb4r\\xe1\\xa9(~\\xdc\\xd1\\x8e\\xbb\\x8b@\\xa4\\xb5W\\x91\\xe8\\x9au\\xff<\\xa4,\\xa7\\xfb\\xc3r\\xe6\\x0bv\\xc5|!\\x06d\\xdf\\xc7z<\\xa9\\x9c\\x07\\x94\\xed\\x16P\\xf5\\xe6\\xd5U\\x85\\x0e=\\x83H\\xab\\xf7\\xde\\'\\x94\\x03\\xf5\\xde\\x85\\xbb=\\xfbm7\\x8cI\\x87H\\xdbn\\xf8\\xf5\\xbf\\xd6{i\\xed\\x89\\xfav\\xc3\\xc4e\\x12G<\\xc7\\xe8\\x1aPgSt\\x98\\xc4\\x1f\\xce\\xebI\\xfe;$\\xba\\xa6\\xb5\\'\\xb2\\x96\\xa7\\xb1\\xed\\xae]j<\\xd2\\xaa5D\\xd6\\xf2\\xb4l\\xa1\\x19\\x13\\x0f\\xd8\\x16n\\x0c\\x91VO$\\xf2\\x1d\\xc6~(\\xa4\\xf59\\xe8\\x87\\xc2\\xd7\\xef\\x89dO\\x84\\xfd\\xb3\\xb5\\xf3\\x88\\xdb\\xa9\\xb6\\x8f\\xe3!\\xd2\\xdaGi\\xdbmk\\xf3\\xed#\\xaa,\\xf7\\xe8\\x0e\\x91\\xb5~=\\xeb\\x9d\\xe4\\x96\\xbc\\xfb\\xc3\\xba\\x10Y\\xd7\\x87/\\x1d\\x90\\xca\\x81t\\xb0`I\\xc8\\xe6\\xd3\\xe1\\x1f\\x96Cd-\\xe7\\x84\\xaa\\xcf\\xecQ5\\x97K\\xfd\\n7\\x80\\xf8\\xad\\xd6\\x87\\x96\\xef\\xf0]\\xc7p\\xede\\xd3}q\\x9d\\xad\\xbd \\xd2\\xb6\\x1b\\xed:\\x86P\\xedVjW\\xfdI\\xfb+\\xbcj\\x01\\xf1{\\xbb\\xfd\\xf7v\\xabv\\xee\\x98\\xd6\\xe5\\xc1\\xed\\x93\\x18\\xf3g$\\xeb\\xe3\\x96\\x17\\xce\\x07\\xe7Y\\x96\\xb6\\x1b\\x9cg\\xd1\\xf6\\x0f\\xdfvK<\\x99\\xa8:\\xfaC\\xd0\\x1a\\x88\\xb8\\xddJ\\xb7\\xd3\\xb4*\\xbakX\\x9a\\xa5\\xed\\xa6\\xb8\\xb9\\xfa\\x8f\\xbdg\\xb6\\\\\\xc1\\xd7v{/}\\xf0\\xddb\\xf3\\x1b\\xc4\\x80\\xec\\xfb${\\xbc\\xa5\\xf6k\\xa1\\xe8`\\xb8K\\xea\\xeb\\xebS\\'u\\x80\\x08\\xeb\\x93\\xd7|\\x94\\xa4\\x87\\xc0\\xfa4\\xadr_t\\xaaI\\xcd\\xfc\\x10a}\\xf8\\xfa\\xd9\\xbd\\x1a?m\\xc1\\xeeC\\xfd\\xe3!\\x92\\xca\\xf9\\xa7|gN\\xcc\\xb9R\\xaf\\xc7G\\xbbC\\x84\\xe5\\x90\\xfa\\xe7\\x15e\\xff,\\xdd\\xbbu\\xc4\\xd4\\x1d>\\xcd \\xe2\\xfe\\xb1\\xb9W`\\xc1\\xca?Z\\xd4\\xb4t}\\xa1`\\xb3\\xfd7\\x16\\x14\\xd2\\xe0\\xe9\\r\\xefu\\x8ck\\x84r\\xe0|n\\xfa\\x9c\\xf3\\x9eUL\\xfd\\xb7@\\xa4\\xd5\\x13i\\xd71.\\xad\\x8e\\x12\\xdd\\xec{\\xf0g\\x880\\x8e\\xc5R=Q\\xf7\\xe7\\x93k\\r\\x8f\\xeb\\xca\\xe3k\\xa1\\xe6\\x8d\\xa7|\\xa7\\xc4(G\\xf6\\xad\\x8b\\xf1\\xee\\x90a]\\xfd7xM\\xb7t=\\x18\\x96\\x03\\xe7\\x8d7S\\xf4\\xfe5\\xff\\xf8)\\x18\\xe2\\xd7\\xe6\\x87Bk\\x1fU7\\xab\\x1f\\xe6\\xd7\\xe9|%\\x88\\xb4\\xf3\\x05Z>:\\xd6\\x14z\\xebJ\\xa1\\xd9W!\\xb2n\\xb7\\x94\\xc26\\r\\x0eMI\\x9e\\x80\\xf1b\\xca\\x9d\\x03\\x9e\\xfe\\x86cP?\\xd8\\x04\\xe4\\xdc\\xe4\\\\\\xd6\\x9d\\xa1~ \\x94\\xdc\\xe6\\xebON\\x92\\x0b_\\xd8w\\xbe2\\xbd\\xea\\x0fB}h\\xfd{\\xf9\\xca\\x05\\x92\\x1f\\nk\\xb9\\xf0\\x82P\\x0e\\x94\\x0b\\x1bm\\xaeE\\xeck;>\\x19\\xa3y\\xa5\\xb2\\xe4\\xef\\xbb^Ta\\xed\\xef\"\\xd4\\xba&\\xad\\xff\\x1b\\xdfuM\\xa1\\xc6)m\\xbc\\x19\\x89\\xaei\\xeb\\xd3\\xe5\\xc7\\xed\\xb6\\x87\\xd6D\\x16\\xc0\\x98<\"^Vr\\xf6\\xf1\\xa6\\xd0Ou\\xb7\\x85\\xf5\\x81~\\xaa-~\\r\\xd9yNe\\xbe\\x07\\x11\\xf2\\xeb9<\\xf9\\xb5\\xf5\\xc9\\x10\\xb7\\xf2\\xad{,\\x80\\xc8\\xda^\\xc5\\x97\\x1f\\x90\\xf8\\x0e\\xe4\\x07\\xfb\\xcf\\x94|\\xbc\\xf8\\xc2\\xa0K\\x10\\x03\\xb3\\xef{^tvx9\\xdf\\xf9yn\\xf1?\\xb9\\xb5[\\xdc\\xb5\\xb9\\xaf\\x1b>\\x99>\\x05\\xa3\\xd3\\xa9\\x85?u\\xedc*\\x04\\xe9\\xe0wK\\xf9\\x1b\\xa0\\x03]\\x9cS{E\\xafr\\x87 \\xb2^\\xcf:\\xac*/\\x1b~\\xff\\xed\\x02\\x88P\\xce\\xc5\\xf0l\\xb7\\xc9\\xd7\\xfd\\xce\\xdelwi=\\xc6r\\xc7\\xb6\\xdcl\\x97q\\xe70\\xad\\xff(\\xad\\xbf\\xf2\\xad\\x98\\xb976\\x0e\\x18\\x9e\\x08\\x91o<-\\xac\\xcfj\\xa7\\x9b/nzL>\\n\\x91v}\\x9b\\xa4\\x1f\\xc0\\xf5m\\xa1\\xfc\\x95\\xe5\\x05C\\x07\\x8e\\xbc\\xb9k.DZ\\xb9@\\xab\\x1f\\xf0\\x95\\xdb\\x8f\\t\\xe5@\\xb9\\xcdw\\xfeC\\x9a\\xcf\\xc1\\xf9\\x0f\\xa6c\\x88\\xb4\\xfeb$:\\x80q\\xefB\\x8d\\xd3\\xc53w\\x94\\xcfW\\xae\\xbc+\\xc6K\\xbf\\xed9\\xbf\\xf2aRm\\xd6\\xf1\\x18k\\xe2R\\xca\\x8cp\\xab\\x97\\x1f\"\\xee\\x9f_\\xbc\\x8f\\xd5: \\nl\\x91da\\xbbu\\x1e\\xd9\\xfb\\xfcN\\xfb\\x84\\x9f\\xf0\\xf5\\xd4R\\xe7\\xefX\\xa5</\\x0e\\x91\\xb5\\x1f\\n\\xad\\x1e\\xc27\\x9e\\x96\\xef\\xf8\\xa1\\x8d\\xa7\\xe5;\\xdf\\xc6\\t5r\\xb3\\x87\\x085\\xdf\\xae\\xd8L\\xb6\\xa2y\\xd1\\x8c=\\x10Y\\xcf\\xb7\\x85\\xf2S\\xdd\\xe0ck\\xd4\\xf5\\x19S\\x1f\\xf3\\x1b|\\xcd\\xd7O\\x15\\xf2\\x9dz\\xdbJ\\xd4^ \\xde2\\x1d\\xa3\\xbc\\x91\\xeb\\xf8\\xb4w-\\x06\\xd1\\xea;8\\xefJn\\xfc q\\xd4\\x8a\\xf5\\xa7j\\xa7\\xd8`\\x1c\\\\\\xc4\\xfet\\xc7\\xf2g\\xe2\\xe1<\\xd8\\xd2ut8\\x0f\\x16*\\xafG\\xfa\\xad\\xe6\\xd5o\\x0c\\xaf\\xb4\\x05\"_;\\xdf\\x17yW\\x04\\xcaW\\xc3\\x97_\\x93\\xe8\\r\\xf2\\xebI\\x17\\xaf\\x04\\xd4\\xdc\\xa5/\\x87\\xf1\\xc1\\xf6\\x92\\x86\\x02\\xa7\\xab\\\\&\\xd9\\x91h\\xc7)k;\\xd2kB9p~\\xca\\xd7\\xbf\\x97d\\x8f\\x87\\xfdS\\xd0\\xa1\\xfc\\xca\\xf4\\xe3\\x9d:clx\\xa8\\xc6I\\x9b\\x91[w\\xd2\\xb6\\x1b\\xed\\xf8\\xe1\\x1b\\x0fH\\x9a\\xff\\xc0\\xfa\\xd8\\xcdy\\xd9\\xbf\\xce0\\xdf\\xf5\\x183\\xf2g\\x14\\x1b\\x9a\\xbf\\xd04\\xd6\\xf5\\xe1\\xbb\\xceD\\x9a/\\xc0u\\xa6\\x0e\\x7f6\\xb8w\\xd5\\xff\\xc8\\x10\\x88\\xac\\xf5\\x10<^ B9g\\xa9\\xdd\\x1f\\xca9Z?oK\\xf5D\\xe8\\xe7mnw\\xe3\\xf1y\\xeb\\xc5v\\x10\\x03\\xb2\\xef\\xb3Z7{\\xe3\\x1c|\\xf4\\xbe\\xf2\\x85\\n\",g\\x1eO\\xfd\\xc0}\\xc8\\x99J\\x91\\x13\\xf3W\\x81\\xc8:\\x8e\\x9f\\xaf\\xdd\\x85T\\x1f\\xd6vX\\xd2:-\\xd4G\\xf9\\xca\\x1f\\x92>\\n\\xe5\\x0f\\xed\\xf8\\x89%\\x94C\\xca\\xf7\\x04\\xe9 6z\\\\\\xcf1\\x1eC/C\\xc4\\xed6\\xf6\\xc3D\\x07\\xab\\x91\\xaf\\xdc-\\xe5;i.\\xeft\\xae#Z\\x98\\xf05\\xad\\xfd\\x80T\\x1f\\xda\\xf5\\xed\\xdc\\xeackZW|\\xc9\\xf5N{,\\xf5\\'\\xf7\\x91\\'z\\xfe\\xbe\\xe8\\xfe~|=\\xf5\\xec\\xf2\\x96\\x85c\\x0fDAd\\xcd\\xdf\\xfc\\x0f\\xa7\\xed\\r/8\\xe25\\xc6\\xe6\\xbf\\xd78>\\xb2\\xf9\\x93\\xbe\\xac\\xd75\\xfb\\xafu\\x1eR\\xc6\\xd1\\xcf\\x11\"k\\xfd-z\\xbf\\xed\\xd21\\xbbf\\x9f\\x85\\x08\\xf9\\x8e\\xa5\\xebs\\xac\\xf3m\\x90\\xe6\\xc1\\xac\\xed;\\xf8:7\\xfb\\x8eP\\xf3\\xac\\xdc\\xfc\\xafY\\xd9]H\\xf1\\xa7X\\x0f\\x91&%x\\xdb?\\xdav\\xc4\\xd2y\\x16\\x8c?\\x15j^\\xc27n\\x97\\xc4\\xafa\\xdc\\xee\\x91E\\x1b^\\xf5^6\\xd6\\x0bc\\xbe\\xb0S\\xf5\\xb7\\xee\\xd7\\x0e\\x81\\xfdC\\xd2\\xdfH\\xfc\\x1a\\xf6\\xcf\\xa8\\xa3RQ\\xcd\\x9aW.Bdm\\xef\\x15*Ocz\\x97\\x02#[\\x8d\\xfeu\\x08\\xc6\\x87e\\xa6\\xd6\\x19\\xf0h\\xf8\\x1cZ=\\x9e\\xa4\\x1f\\xe4\\x95_\\x80P\\xfa(\\xdfu\\xcd\\xaf\\xcd\\x7f\\xd4.\\xb4\\x98\\xed\\xf8S\\x0f\\x9b`TLX\\xf9`J\\xf97\\x01\\xb4\\xe3\\x87\\xd4np\\xfc\\xc8\\xe7\\x1dy>\\xb7\\xce{\\x19\\xc6.\\x1f*L\\xe8vmEmZz#\\xf9\\x05@z\\x13\\x8a\\xbf}m\\xf4\\xc6\\xd7>*\\x14\\xbd\\x8d\\xea\\x1e\\xb2\\xd4\\xf8c\\xbd\\x16\\x10i\\xe7\\xdb$\\xb9\\x00\\xe7\\xdb\\xdd\\x7fk~q\\xfe \\x93\\x17D\\xdarHr\\x01\\x96\\xc3\\xb7\\xddHz<l\\xb7\\xf6\\x8e~u*[{\\xaa \\xe6\\xd5z\\x89\\xa5\\xf9\\x84\\xf2*O\\x89\\xb8\\xef2\\xaf\\x86SoM\\x82\\xc8\\xba\\xdd\\x9eT\\x7f\\xebmU\\xf7m\\x15\\x88\\xb8\\x1c\\xb7^\\xabo\\x1e\\x1cw0\\xbf\\xa5\\xeb\\xe8a\\xaf\\x82\\x9f\\xfa{-\\xdd\\x89\\xaf\\xf9\\xda\\x0f\\x9e\\x13\\xca\\x81\\xf6\\x03\\xbeq\\xae\\xb7\\t\\xe5@>*T\\xdc\\xe1\\xe5\\xc7\\x8b\\xf5E\\xe2\\x07T\\x82H\\x1bw\\x98J\\xa8\\x0f\\x8c;\\x14*\\xae\\x8d\\xaf\\xdd\\x85\\xc4\\xdf\\xfe\\xa9\\xdd\\xe5[\\xd1{\\'\\xec\\x8b(\\xf7\\xe2\\xfc>[\\x8c\\x0b\\rG\\x12NN\\x98;\\x83V\\x0f!\\xad\\xd3B=\\xe4\\xdf\\xb6\\xdeH;\\x0f&\\xf1\\xb7K$\\xbe\\xc3\\xd8\\xff\\x80\\xa4\\x1f@\\xba\\xc6\\xfe\\x13\\x10Y\\xeb\\x07\\xc7\\xe45\\xfa\\xb6\\xbb<\\xbd(D\\xd6\\xfeH|\\xed\\x96$:\\x80v\\xcb\\x84R\\xd1\\r2^\\x1f\\xdc\\x8d\\xd17Ca\\x9d~X3\\x90v=\\x98v\\xde\\xc8\\xd7nI\\xe2\\xa3\\xd0n\\xc9W\\x7f#\\xe9\\xd7P\\x7fkX<\\xd6\\xea\\xee\\xae\\x8c\\r\\x10Y\\xeb!|\\xfdCH\\xfc\\xed\\x8b\\xb8\\x82\\x88\\xe4\\x9f;\\xac\\x1f\\xd0\\x1e#\\xf4?\\xc0y\\xb2H\\xf9\\x84H\\xfd\\x03\\xf3d\\x8dm\\xfd\\xd2\\xb1J\\xff\\xaaa\\x18\\xe3e\\xd7k\\xed\\xf6\\xf1\\xfdb\\xdd\\x99\\xaf\\xffA\\xdb8\\xf72\\xa6\\xf5G\\xdfA\\xa4m7\\x12\\x1d\\xc0v\\xa3\\xcd/f)\\x1d\\xc0vk#m=j\\xa6\\xe3\\xb4$\\x8c\\xadmK\\x05u\\x1f\\xf8`\\x00\\xeb\\xf5z\\xa1\\xe6\\x8d%\\xcf\\x0e\\x1c\\x10\\xf5S\\xe3\\xfb\\x18;T\\x18\\xf5\\xd3\\x1d\\xf9\\xd9\\xb3\\xb0>\\x96\\xc67\\xe6U}\\xd6\\xef\\xfb\\xd0d\\x8b\\xc7\\xa4\\xc1\\x18\\x9b\\xdf\\xd9_\\xf3@\\x83B\\xcao\\xb5>\\x8f\\x02\\xf3\\xd5<u\\xb9\\xc0\\x05\\x88\\xac\\xf9\\x1b-][:\\xcf\\xca\\xabv\\xebZee\\xf8\\xd0\\xb3\\x8fwAd\\xddn\\xb8\\x9d ~\\xabq\\xef\\t\\xfdVy\\xcd\\x1e\\x19T\\x13c\\x8d\\xda\\xd7\\x03\\xdd\\xde\\x94_\\xcaz\\xfc\\x08\\x95\\x07\\xb0\\x9b\\xe2\\xaa\\xd3\\x87\\xfb\\xfd<1\\xea\\xe7m;2e\\xe4\\xac_\\xbf6\\xbf\\x9a4\\xca\\xfe\\xe1+O\\x1fQ\\xb6\\x9bP\\xf9\\xa2\\xf9\\xf6\\x8fP\\xfc\\x9a\\x94\\'\\x8bu\\xff\\xdc\\xa3\\xec\\x1f\\xfb\\x9b\\xd7\\xae\\xd5\\x98Y1\\x04cM\\xfd\\xc1\\xd9)\\xbf\\x1c\\xf4b\\xee\\xff\\x96\\xd0\\xf9f\\xb8\\xcc\\xa1*\\xc6b\\xe3\\xf7T-(iT\\x9fu\\x1c\\x98P~\\xaa\\xb7\\xdb\\x1c|\\xedb\\xbdH\\x02\\x91\\xb5=\\xe4\\xd7\\xb2\\x97\\xe2\\xb6\\\\\\xa8\\xe3\\rQ\\x9a}\\x7f\\xe2k\\xbb\\xa4\\x15\\x0b\\xb6\\x9f\\xb5\\x94\\xae7\\x876\\xb1n\\xfc\\xaa\\xc8e|M\\xf2?\\x80\\xe5\\x90\\xe8z=e9|\\xf3\\xe6%P\\xf6\\xcf\\xf7\\xbc\\x869_k(\\xdb\\x8do\\xff\\xac\\xa6,\\x87o\\xde\\x88U\\x94\\xe5\\xb4u\\x1c8\\xc9\\xdf\\xce\\xa6\\x06\\xc6\\xf6\\xfd\\x92\\x82\\xfb\\x9fI\\x9c\\xc4z\\x1e\\xcc\\xd7\\x9f\\x82hO\\x04\\xfe\\x14B\\xe5a\\xb2\\xbd\\x92:\\xa6\\xc3\\x9f[R!\\xb2\\x8e\\xcb\\xf9\\xb7\\xd9a\\x0fvx\\xe1\\xbd\\xe4\\xe7\\xd7\\xeb0J[[\\xb7j7\\xee\\xa5\\x08\\xca9\\xd2\\xfe2fB\\xbbA9\\'\\xd4\\xbaL\\x7f\\xc9T\\xbb\\xad\\xe7\\x0e\\x9b \\xb2\\xce\\x07)\\xd4\\xbcdSo\\x0f\\xdf\\x82\\xffq\\xae\\n\\x91u\\x1c\\xbfP\\xfb\\xcb\\xf0\\x8d\\xa3\\xa4\\xa5k\\xdax&\\x92\\x9c#\\xc5}|\\xab\\xf1L\\xb4\\xf6D\\xa1\\xe2\\x7fp\\x9c\\x07D\\xd6~(|\\xfdT\\x97\\x10\\xca\\x81~\\xaa\\xe9gBd\\x8f\\x96l\\x98\\x0e10\\xfb>\\xee\\x9f\\xa8\\\\\\xd6\\x7f@w\\xe4\\xd9\\xfe\\x18B\\xc9\\x1f{o;\\x977\\xd1\\xdd\\x82!\\xd2\\xc6\\x1d\\xe2\\x8d6r\\x1b\\xa7B\\xe9;\\xe5\\x1e\\xc8\\x1b\\xbc\\xa8\\xd5D\\x03\\x91\\xb5\\xfd`]\\x1b\\xdb\\xf5/7;\\x1f\\xc7\\xd8\\xd3~N\\x9b\\xfc\\xa9\\x85G\\xb3\\xce\\x87\\xff\\xad\\xf8\\x1f\\x90\\xfa\\'\\xaf\\xfc\\x0fh\\xf7\\x03\\xb3t_8\\xd8?|\\xf3~\\xd1\\xc6\\x1d6=:b\\xcc\\x93\\xb9\\xf5\\x07Ad\\x9d\\'\\xab\\xd9\\x92\\xf4\\x12w.N\\x88\\x85h\\xe9\\xfe\\xce\\xb9\\x95\\xb3j\\xc5.\\xf9\\x15\\xc7\\xb4\\xf5\\x10a9\\xa4y\\x16m\\xde}\\xbez\\xd5\\x9f\\x84rX\\xebU\\xa4\\xfe\\x81\\xfc\\xba\\x8caM\\xca\\xa6\\xa2\\x03\\xec7F,r+v\\xa0y!\\x8cX\\x8f\\xff\\xa7\\xf9)\\x8a>\\x8b><\\xf4}\\xe9\\x8e\\x1f\\xffO\\xf0\\xbb*\\xf1\\x8f\\xfa\\x17\\xc1XnM\\xec\\x93\\x8eW\\x0b\\xdc\\xa1\\xd5\\xdf\\xd2\\t\\xed\\x06\\xe5\\xc2}\\xcd\\x81\\xd2\\xb6\\xd77\\xb5\\xc68<\\xbc\\xe1\\xd0\\xe0\\xa3\\xf3\\xa9\\xf7\\x15!\\xf1\\xb7\\xbc\\x8a?\\x15J?\\x10J\\x8f\\xf7\\xb3\\x89\\xbd\\x9c0\\xad\\xf7c\\x8c\\xa9\\xef\\xdb\\xd8\\xbc\\xeb\\xd1\\xfc\\x03\\xebx\\x19R\\xbeNZ\\xfd\\x8d\\x96\\xbf9\\xfc\\x90V\\xe2Xy\\xdbY\\x10i\\xfb\\x87\\xd4n\\x9b\\xc7\\xf7\\x1c\\xeeRw\\xf7\\x14|]\\xf1\\xfdZC\\x90\\xd3\\xbbT\\x8c\\xa4\\xb8]K\\xf7\\x8d\\x85q\\xbb\\xe7\\xfer\\xbe\\xbb7\\xe3\\xde\\x16\\x8c\\x03\\x1a\\xb5\\x18<e\\xda\\xf1\\xb6\\xd0O\\xd5\\xd2\\xfd\\x99\\xa0\\x9f*_\\xfb\\x01m\\xff\\xfcx\\xbe\\xe7\\xf9\\x15QM\\xc5\\x10Y\\xcb\\x1f\\xbe\\xfb\\xa8\\x91\\xfcj\\xfe\\xe9>P|\\xf7\\xdb\\x8d{\\xe9\\xe7\\x9a\\xf0p\\xf2m\\x88\\xdfj\\xfe\\x1d\\xa1\\xfc\\x9e\\x84\\xca\\x8bsa\\x92\\xb1[\\xfd\\xe95\\x8e@d=\\xdf\\x16\\xca\\xce\\x87\\xe5\\x00D8~,\\xdd\\xc7\\x06\\x8e\\x1f\\xa1\\xe6%)E\\xd7\\x8e\\xfc\\xb9\\xf9\\xb85\\x10Y\\x8f\\x1f\\xdf\\xf9\\x03f\\xdf\\xd3\\x1ci\\x84\\xf1\\\\L\\xc96\\x077.\\xd8\\xc1z\\xde(\\xd4>6+\\x16\\xad\\xdd\\xec\\x10=;\\x18\"\\xa4\\x03\\x92\\x9eH\\xb2[B:XP\\xbf\\x80\\xab\\xbb\\xc3\\xc3\\xbe\\x18\\xe3\\x7f\\xeb\\xbdh\\x90\\xed\\xd2\\x15\\xac\\xf5D\\xa1\\xe2XLU;\\x16\\xdf\\xbc:\\xc5\\x1dc\\xa3\\xa8}\\x9b\\x86\\xfe|v\\rk\\x7f\\x17\\xa1\\xf8h\\xc7\\x1e\\xab\\xe7FDL;\\t\\x91\\xb5\\x9c\\x13j\\x9cf\\xdc\\x1c3\\xfei\\xea\\xe6\\xd5\\x10i\\xf95\\xad\\x9c\\x13*o\\xf8{\\x7f\\xdb\\x96G6\\xb6\\xa8\\n\\x11\\xea\\xbd\\x96\\xfam\\xf4\\xe8\\xd5\\xf8h\\xcf\\x94>\\xc5\\xf15\\xdf\\xf1C\\x94s`\\xfc\\xd0\\xb6\\x9b\\xa5\\xfeoye\\x8fwl3k[\\xf0\\xc5K\\xef!\\xb2\\xd6\\x0f\\x84\\xe2o;|\\x8b\\xb7\\x11\\x87\\x9fK\\x85\\xc8z\\x9c6.\\xee\\xe6\\xbf\\xb4\\xe2_}0j^\\xfc\\xb1\\xce\\xb4\\xa3\\xedM\\xd6\\xfe\\xa3|\\xd71H\\xf12p\\x1d\\x83v\\xdf\\xf2\\xdc\\xe6?p\\x1d\\x03\\xe6\\x8dxT\\xba\\xcc\\x01\\x95\\xef\\x1a3D\\xd6q,x=\\x0e\"k{\\xef\\x96\\xe96k\\xc3\\n\\xbe\\x1e\\x871\\xf6\\xc8\\xb3N\\x93#\\xc6\\'C: \\xcd\\xebqG\\xe7F\\x07\\xd8o\\x06\\xa2\\x08\\xdc\\xe7\\xbbol\\xd1\\xce\\xbb\"J_u\\xa9\\x05\\x91u\\xbeu\\xa1\\xf29\\xacJo>o\\xd4\\xae\\xd4?!\\xc2\\xfe\\xb1\\xb4>y\\xe5\\xe7\\xed\\xeeq\\xb5\\xda\\xe1\\xb4\\xcb\\x93 ~\\xab\\xfe\\xfe\\xbb;,{\\xf3z\\xde\\x85\\xed\\x10Y\\xdb]\\x8e58nk\\x95\\x1c\\xae\\xc1\\x98\\xa0\\x1ez\\xe3\\xa8\\xb1\\xd9\\x17\\xf1\\x9a$:\\xa0\\x8d7\\x13\\xaa\\xdd\\xb4\\xe3\\xf25\\xec\\xfc\\xe2\\xdd/\\x18\\xa7\\xd6\\x90$\\x96^\\xddN\\xca\\x9a\\x0e\\xf8\\xc6\\x89\\x93\\xea\\x03\\xe3\\xc4\\xf9\\xb6\\x1b)\\xaf\\xc7\\x17v\\xf2\\xe3#.\\xb8\\x1dN\\x8a\\xc78a\\xdf\\x92\\xc3n\\xd3Gw\\xa5m7\\xd2\\xbaL^\\xd1A\\x89bs#\\x14\\xa2@\\x19\\xc4o\\x95\\x1f\\x08\\xb5O\\x8aC\\xdd:\\xd5\\x8a\\xb6\\xb9R\\x0f\"\\xad\\x9c#\\xfa=\\x019\\'T\\x1e\\x99\\x0b\\x81\\xfd\\xa6\\x84\\xee\\xf1<\\n1 \\xfb~nydHz\\x15\\xac\\x8fP\\xfb\\x15\\xe0xz\\x88\\xac\\xe7\\xc1W\\x7f\\xed\\xbc\\xb7\\xc6\\xe6b\"\\x88\\x1f\\xd7K\\x16\\xd8\\'\\xae]\\xe5u\\xc3R\\xbb\\xe5\\xae\\xa3\\xfdO\\xd4\\xc9\\xb7\\xc4\\x01_\\xe3u\\x18\\x88\\xb8\\x1cl\\xaf\\xb2t=\\x8b\\xb5\\xdd\\x9f\\xd6\\xae\\xbcr\\xcc\\xfa\\xed{\\x12R\\xc7C\\x84z\\xbc\\xa5\\xf9TY\\xe7\\xc5\\xa1\\xe5;\\xcdf\\x9d\\\\\\x9d\\xaf\\xd1\\x89p\\x88\\xac\\xfd\\xe3\\x85\\xaaOhB\\xd3e\\xc9-\\xee\\xbba\\xec\\x11\\xd8\\xd4}ZB\\xcf1\\xdf\\xaa\\\\\\xd8\\xaan\\x10\\x11\\xd1(\\xe2*\\xc6qs\\xb5g\\xdc~,\\xf9\\x9eu}\\xf8\\xce\\xb7I\\xfb^\\xc2\\xf96\\xdf\\xf8\\x85B\\xd9\\x08\\xe7\\xdby\\x95_\\x8c6\\xbf2\\xdfy\\xa3P\\xf9\\x95i\\xf3_[\\xba\\xee\\x0c\\xd7\\xd1\\x85\\xf2\\xabI\\xfa\\xa9\\xce\\xd4AeC\\xff\\xc08\\xbeS\\x8b1N\\x13gD\\xc2\\xf8\\x12\\x92_\\x006\\xb4\\xc2r`|\\xc9\\xb8f}\\x8f\\xed\\xba<\\xe5\\x1dF\\x92\\x1f\\xca\\xbc\\xd2\\x87\\x86\\xed\\xbbU\\xe8\\'Z~P\\xf5u\\xff\\x9bW\\xab\\x94\\xe9\\x8a\\xaf\\xbd\\x8a\\xf4\\xd3)\\xafO\\xf7\\x80\\xc8\\xda\\xce\\xd7,\\xd0\\xaf_\\x93\\x1bO\\x0bCd\\xbd\\xee\\xdch\\x99\\xc7\\xd4\\x9aS7w\\x85\\xc8ZO,\\xdc@\\xdf\\xb0y\\x9d\\x90 \\x88\\xac\\xe7\\xdb#Z\\xd8\\xdb7\\xde\\xf3\\x9f\\xca\\x10a9\\x96\\xda\\x95i\\xf7\\xe1`=_\\xe8\\x12|\\xa7\\xe8\\xcf\\xeb\\xd6}\\xc0Xp\\x9b\\xa7\\xa7\\xb8\\xfa\\x85\\x12\\xb4\\xeb\\x80$\\x7fK\\xd6yNI|\\x07\\xda\\xc5\\x84\\xda?\\xf8]\\xa5Jk\\x06M\\xabQ\\x0f\\xa3\\xfd\\xb2\\x03\\xf3k\\xe9\"\\xfa\\xb3\\xce\\xb3\\xcd\\xd7\\xcf\\x9bX\\x1f\\xe0\\xe7\\xcd\\xd7\\xff\\x9aV\\x0f\\xe1\\xbb\\x0f\\x87P\\xebL\\xb4~\\x0eE\\x1d\\xab\\xc5\\x8dqO\\x8c\\x86\\xc8\\x9a_\\x87\\xaau\\xd27\\x8bN\\xcc\\x86\\xc8z\\xde\\xc8W\\xef%\\xc5\\x19A\\xbd\\x97\\xef>\\x91\\xc4\\xfd\\xde\\xc1\\xba\\x99P\\xfeo\\xe2\\x84K\\x7f4\\xdc\\x1e_\\x1f\\xa2\\xa5\\xfb\\x8e\\xe5VN)\\x1b\\x97\\x86\\xaa\\x8c\\x19*\\x88\\xac\\xf7?\\xfd\\xb7\\xf9\\xf7\\xf6^\\x1e\\x9c\\x1aSi\\xb3w\\xa9\\xca\\xcb\\xf3W\\x9eS\\xf6/|\\xcd\\xd7\\x1e\\x12\\xad\\x08\\xcdh\\xe06\\xf5\\x10\\xbe\\x0e\\xd7\\xd4\\x1c(\\xde\\xd8\\xcd\\x0f\"\\xad\\xff\\x0e\\xc9\\xcf\\x1b\\xdaCf\\x1a\\x0c7\\x0b\\x8b\\xd7)0.\\x88\\xf3\\xe8\\xb7\\xdb\\xde\\xf9\\x01l7K\\xfdw*o8\\xd99es\\xab\\xe3\\xf8\\x9a/\\xbf\\xa6\\xd5w\\x84\\x92s\\xe3\\xa6\\xc6^\\xbaW\\xc7\\xe3=D\\xd6~\\x01\\xff\\xb6\\xfd\\xcd\\xb0~\\x03\\x91u\\xbb\\xf1]\\x97!\\xc9\\x05\\xd6\\xfb\\xff\\x90\\xf2\\xbb\\xb0\\xb6\\x87\\xe0|\\x9d\\xb9\\xd9C\\xbe\\xe7\\xdb\\xc8\\xf9\\xa2\\xd5\\x13\\xf9\\xf6\\x0fv\\x00\\xc9\\xad\\x1c]\\xe59g\\\\\\x96\\xc8\\x86B\\xa4\\xd5C\\x8aR\\x96\\xc37\\xaf\\x07)?l^\\xf1\\xeb\\x8ek\\xdd\\x86\\xd7\\x98\\xfdV\\x8a\\xb1\\xaaO\\xfe\\x94\\x87\\x9e-/\\xb0\\xce+%\\xd4\\xbc\\xb1zr\\xf1\\x06\\xda\\xe7sWc\\x84q\\x12x\\xdeH\\x8a\\x0f&\\xf5\\x0f\\x9c7\\n\\x15\\xe7ZHq\\xaf\\xadF\\xe9\\xd3\\x06\"k}T\\xa8\\xfe\\xd9hs-b_\\xdb\\xf1\\xc9\\x18\\xcd+\\x95%\\x7f\\xdf\\xf5\\xa2\\n\\xd6\\x13q\\xff\\x90\\xf4D\\x92\\x1e\\x0f\\xfb\\x87\\xd6\\x8e\\xc4w^B\\x9bw\\xdf\\xd2y=\\x8cg\\xda\\xb8rYj\\xfcR\\xaf\\x96\\x10!\\x1d\\xc4[\\xa8\\xc7C:\\xd8\\xb8n\\xc9\\xfc\\x8aV\\x85\\xc7B\\xc4r\\xe1\\xfd\\xccs\\x87\\x8e\\xdaY\\xa9-\\xcd\\xe3|jU\\xa3\\x1d\\xf3\\xa6\\x1e\\xdd\\xf8\\xf1\\xffP\\xc6k\\xf2\\x8d\\xd3K\\xd0\\xed\\x99\\xda)uF%\\x88x\\x9c^\\x9e04*\\xb1hS\\xffd\\x9e\\xe3\\x94o< i>\\x97W\\xf9\\x1c\\xd4+\\xc7\\x8f\\xba\\\\|\\xc0a\\x88\\xac\\xc7\\xcf\\xa4\\x8eg\\x97\\xd8y\\x8c}\\x07\\x11\\xd3\\x01\\x8e\\x0b%\\xad/\\x90\\xfc)~\\x89\\x98\\xe4}\\xfcq\\xf1\\x8f\\xeb\\xe8[|\\x96\\xc6\\xec\\xdd`\\xb8\\t\\x11\\xf7\\x8f\\xe7Eg\\x87\\x97\\xf3\\x9d\\x9f\\x93\\xeaC+\\xb7\\xdd\\x9d\\x86\\xdfps\\xce\\xd7\\x04b@\\xf6}V\\xfe\\x14B\\xedW\\xe0S\\xf7\\x87\\n3\\x12\\xed\\xdfa\\xecty\\xf1\\xa0\\xd0\\xc7\\xfbD\\xb4~\\xaa\\xa4r\\xa0~\\x80\\xf3PCdM\\x07\\x8boo\\x9e\\xef`\\xebv\\x14\"\\xb4\\'Z\\x1a\\x7f\\n\\xed\\x89$>J[\\x0e\\xad\\x9fCW\\xf3\\xde\\xdb\\xed\\x8b\\xed\\xee\\x0f\\x11\\xd2\\x01\\xa9\\x1c\\xa1\\xec\\x96\\xa4\\xf1\\x03\\xedU|\\xf5^\\x12\\x1f\\x85z/\\xdf\\xbc\\xad\\xb4\\xfe\\xe4\\xa9\\x85Z\\xf7I\\x93]s\\x82\\xc8\\xda~\\x1d\\xe4~\\xe0A\\xdc\\xbem\\xb30\\xc2\\xf5\\xc6\\xdc\\xd6\\x17\\x1e\\x13\\xe8 \\xaf\\xf2\\xbb\\x085\\xff\\x11j\\x7f3\\xbe\\xf6\\x90\\x07\\x84r\\xa0=Dj\\xfc}\\xbdb\\xb3y#\\xc6\\xf5\\x11\\xef\\xef\\xef\\xed\\x19X\\x1a\\xcb\\xed\\x90\\xc3\\xb1\\x87\\x16j\\xbaW\\xc6r\\x0e\\x8f\\x97)\\xd69\\xdb\\r\\xdaC\\xa0>:2\\xe9N\\x95\\x86\\xfb\\xdb.\\x86H\\xd2G\\xf1\\xf3\\xa6\\x80\\xfa\\xe5\\xd6nB\\xcdK\\xfc\\x9d\\x9b\\xbc\\xf6\\x18\\xd0\\xdb\\x0fc\\xfd\\xe3w\\x96.}e\\xa3d\\xbd\\xde\\xc8\\xd7\\xdeK;~\\x84\\x8a\\xe3\\x17\\xca\\xaf\\xb3\\xcb,\\xef\\xe9e<\\x82/Ad\\xbd>\\'T^C\\xd1d]\\xf7\\xe5\\xf7\\x9b\\xef\\xc0\\xb8\\xfa\\xb6\\xdd\\xd5e\\xb7\\xf6\\xbbAz\\xb3t\\x9f;Ho]\\xcf\\x16\\x9c\\xbfm\\x9cS:D\\xd6\\xf2\\x876\\x7f\\x15\\xdf\\xf5m\\xbe~\\x0e\\xa4\\xfa@?\\x87\\xeb\\xbf\\x14\\x1e\\xf3\\xb6\\xa4\\x8f#\\xc6\\xaa\\x0ea?\\x0c|\\xfe\\xbe)m\\xff\\xbc\\xa4\\xec\\x1f\\xa1\\xd6\\x99\\xf8\\xae\\x9f\\xd2\\xae3\\xb9,>X\\xf4^\\xa9\\x81\\xf3 ~m\\xeb\\xa7\\xb4\\xf9\\x02\\xf8\\xce\\x1bI|\\x14\\xb6\\x1b\\xeew\\x88|\\xe5\\xdc\\xfe\\x01im\\x9e\\x86/\\xda\\x87\\xaf\\x0fN;7fm\\x93\\xd8>\\x10i\\xe7Y$\\xff\\x038\\xcf\\x12\\xca\\xbf\\x97o\\xff\\xd0\\xda]\\x84\\xd2G\\x9f\\xceV\\x05n\\xde\\x10\\xf5\\n\\xe3\\xd2E\\x0f\\xf6\\xf7\\x1dS{-\\xeb\\xf9\\xf6\\x80\\r\\xa9mg\\x95(\\xd1\\x08cI\\xdb\\xe1\\x05\\xd2\\xae\\xac\\xf6\\xc2t\\x80\\xfdT-\\xcd\\x83!\\x1f\\x90\\xefA\\xa5vw?\\xda\\xf9H\\xf9\\xfd!? \\xd5\\x87\\x96\\x1f\\xf0]\\xd7|F(\\x87\\xf5\\xba\\xe6]B9\\xac\\xd75\\xcbgcn\\xeb\\x9a\\xb9\\xd9GY\\xe9\\xa3B\\xad\\xd7\\x0b5N\\x8fU*9{\\xb4]\\xd7\\x82\\x18\\xfbt\\x11\\x1fV\\x86\\xb7|\\xf6\\xad\\xae\\x9bm;tv\\x99\\xc6\\xa1\\xfd0\\x8c\\xda\\xe0)\\x07\\xce\\x8e\\x0e\\xab\\x08\\xf5\\x1dK\\xf3#A}\\x87\\xaf\\xfeF\\x92?P\\x7f\\xe3\\xab\\xc7\\xd3\\xfa\\xbf\\xedl\\x9a\\xba\\xa2j\\x87n\\xed06\\xaa<\\xff\\xbc~]\\xdaS\\xda\\xbc\\x93\\xa4\\xb8\\x8f\\xbc\\xca\\x87\\x9f\\x9b~\\xc0*\\x1f\\xbeP~5{\\xc7\\xafm\\xf3\\xab\\x93\\xac\\x1cF\\xa7S\\x0b\\x7f\\xea\\xda\\xc7T\\x88\\xf5\\xbc\\x84\\xaf\\xfc!\\xadkB\\xf9\\xb3:\\xa3\\xdc\\xac\\xd1VNG!\\x06d\\xdf\\xcfm}\\x81\\xa4\\xef@y\\x9a\\xe6\\xf0SH\\xd1\\xee-\\xcfA\\xa4-\\x87\\xd6\\xbe\\xa3\\x987\\xb6iX\\xea\\x96\\x17\\x10i\\xcb\\xa1\\xb5\\x1f\\xcc\\xeaT0\\xb6\\xe2\\xa1\\xd8S\\x10a9\\x96\\xf2QXN\\xc0\\x83\\xad\\xc5z\\xdc_;\\x15#\\x8c\\xff\\xf9\\xa7v\\xa4;\\xc9V\\xd7\\x02\\xa2=<\\xf0\\xb5\\xcb\\xfb2\\xce\\xcb\\xeaw\\xed\\x0b\\x91\\xf5:\\x06_~M\\xf2\\xaf\\x82\\xfc\\x9ao\\x9eS\\x12]\\xc3<\\xa7\\xd0\\xef\\xc0R\\xff\\x03\\x12]C9\\'T|\\x16\\xd6\\xdb!B~\\xcd7>X\\xa8\\xf5\\xedK;SN\\xcbOv\\xf0\\x82Hk\\xaf\\xa2\\xa5k\\xa1\\xe4)m\\xfc6i\\xbeM\\x9b\\xb7\\xb5\\xfa\\x8d-s\\xc6\\xc9\\x0c\\xdb \\xb2\\xe6\\x07|\\xe5\\x1c\\xc9n\\t\\xe5\\x1c\\xdf\\xf8\\x05\\x92\\x9e\\x08\\xf57\\xa1\\xf4k\\xfb\\xad/v\\xdd\\xf5*{\\x04\\xe3\\xde\\x8dS\\x1c\\xf6\\xb5\\np\\xa1\\xb5\\'\\x92\\xf4D\\xc8w\\xf8\\xfa\\x1fP\\xcb\\xb9\\xde;}\\x16\\xbe\\r+\\xfb\\x05\\x82r\\xb0^\\x85\\xc7\\xff\\xf8\\xec\\xeb\\xaf-\\xff\\x9b\\xed\\xeazs^VOx\\x06\\x11\\xd6g\\t\\xa8\\xcfX\\x0b\\xeb\\xc3\\xd7~@\\xb2\\xbb@\\xfbA\\xa1\\xa5w\\xd7\\x9b\\x92\\xc6\\xff\\x02\\x11\\xd35\\x9e\\x07\\xe7F\\xd7Pn\\x17\\t\\xacsX\\x19p\\x1f\\xab\\xabV\\x15J\\x8d\\xb4z}*-\\x1a\\xa3\\xfc\\xd2\\xa2Y\\x11\\xed\\xff:%\\xd4\\xba\\xd9\\xff\\xd7\\xf9\\x0fI\\x0f\\x81\\xf3\\x1fZ{<_~\\xd0\\xfdB\\xa2\\xf4\\xa8\\x7f\\xf9\\xf7\\x10Y\\xc7;\\xdf\\xae\\xf7*\\xec\\xc2\\x98\\xd4\\xee\\x10i\\xfd\\xd2h\\xf3\\xc3\\xf2\\x1d\\xa7$\\xf9\\x03\\xc7)_\\xf9C\\xda\\x07\\n\\xca\\x9fGM\\xdb\\\\w\\xb2K\\x8c\\x82\\xc8z?\\x16\\xa1\\xfc\\x06\\xab\\xba\\xb4]7qI\\xff\\xed\\x10Y\\xeb\\xbd\\xdf\\x8a\\xff\\x0e\\xad\\x9d\\x82\\xaf\\xff\\x0em\\xdc\\xc7w\\xff\\x9d\\x9c/\\x92\\xde\\x0b\\xf9\\x01\\xdf\\xfc\\xd7\\xa5@\\xfb\\xe1W^\\xed# \\xf6\\xb8\\x94Q0\\xfe\\xf1D\\x88\\xac\\xfbG({\\xa2\\xc9i\\\\)\\xab\\xda\\xf5OC\\xa4]\\xcf\\xa2\\xb5\\x8b\\xf1\\xe5\\xd7\\xb4|\\xb4}/G\\xef&Sg\\xc4b\\x84\\xfe\\xd7\\xb9\\xd9\\xfdI\\xf2\\x94\\xef\\xbc\\x04\\xea\\xd7\\xb4z\\x88P~(B\\xf17\\xda\\xfc\\xca\\xa4\\xb8\\x0fR\\xff\\xc0\\xfc\\xca|\\xd7\\xebI\\xf3\\x12\\xb8^\\xaft\\x8f\\x0fP\\xb6\\xd81\\x19\"\\xed|\\x8e\\xc4G\\xe1|\\x8ed\\xaf\\xb2t\\xfe\\x03\\xcb\\xd1\\xfd\\xf9\\xe4Z\\xc3\\xe3:\\xbc\\xbcJ\\x9d\\xef\\xc9R=\\x04\\xe6{\\x12\\x8a_/\\xe9\\'.\\xb4\\xa8Rx\\x15\\x88\\x90\\xbfY\\x9a\\x9f\\x8f\\xb5<%\\xe9!\\xac\\xd7\\xd1a\\xfb\\xe1\\xd7\\xf7\\xf8\\xe0\\xaf#>\\x98v>G\\xe2;\\xd0~M\\xd2\\xabH\\xfc\\r\\x96\\xc3w\\xdfe\\x12\\x7f\\xa3\\x8d7\\xe3\\xcb\\x0f \\x7fK\\x8ah4\\\\\\x9e\\xd6\\xf5\\x00\\xc4o5\\x9fC\\xf7\\x97\\xca\\xe8\\xfe.3OBd\\xed\\x9f\\x98o\\xf4\\x95\\xa5e[\\xde1B\\xa4\\xd5\\xdfh\\xc7\\x0f_>J\\xcaK\\xcd\\x9a\\x8f\\xd2\\xeeW-\\x94\\x1e\\xef\\xd5\\xd3\\xad\\xfe\\x83\\xde\\xc9\\xfd!\\xd2\\xea\\xf1\\xb4\\xfa\\xa8P\\xfa\\x81P\\xf6\\xd1\\xb6\\xd7\\xb4\\xbf<\\x18\\xb9\\xe4\\x0cD\\xd6\\xf6Q\\xbe|\\x94\\x96\\x1fx\\xfe\\xb8`\\xe6\\x89[\\tv\\x10Y\\xf3Q\\xa1\\xec\\x14|\\xf7g\\xa2\\x95\\xa7)\\x85m\\x1a\\x1c\\x9a\\x92<\\x01\\xe3\\xc5\\x94;\\x07<\\xfd\\r\\xc7H\\xfeox\\xfcO\\xb6\\xce\\xd9^\\xb0\\x1c\\xd6yuI~\\\\\\x90\\xbf\\x91\\xe8\\x80v\\xbe\\x80\\xaf!\\x7f\\x83t\\x90\\xa2\\x7f}{\\x8a\\xd6*\\x04b^\\xe5\\r\\'\\xad;\\xe3\\x84\\xb6\\xb9\\x8dS\\xbe\\xf3\\x12\\x92_\\x00\\x9c\\x97DTzx\\xe9`\\xc3\\xf1\\xbfAdm\\x0f\\x19\\x9f\\xf6\\x87\\xfd\\xc6\\xa2\\x91\\xfd!\\xb2\\xb6\\xf7\\xea\\x06\\x1e)\\xf3\\xfb\\xfe\\xc6_ \\xed<\\x8b4N!?\\xd8\\x7f\\xa6\\xe4\\xe3\\xc5\\x17\\x06]\\x82\\xc8:~A\\xa8}\\x8a\\xabWw\\xcf7\\xe8q\\xf7\\xe9\\x18\\'\\x8e}^\\xabA\\xcf\\xa8\\xce\\xd0o\\x9d\\x94\\xdf\\x85\\xb4.\\x03\\xfd\\xd6\\x85\\x8a\\xd3\\xa3\\x8d\\x9f\\xcb\\xebx\\x19R<\\x13\\xad}\\x87\\xf5:\\xd3\\xb2*\\x1d\\xda\\xeb\\x1b\\x89\\xad!\\xf6\\xcf\\xbe?\\xa7\\xa9\\xb1\\x82\\xcc\\xa7vC\\x13O~\\xf0\\xf6\\x80\\xd6e\\xf7\\xbd\\xc1\\xbb!\\xd2\\xe6\\x1b|Nh7\\xc8Gi\\xf3_[\\x1a\\x07\\x06\\xf3_\\x97z\\xfa\\xfb\\xa1b\\xef\\xb6\\xc6C\\xa4\\xf5\\xe3\\xa2\\xed\\x1f\\xa1\\xfcjN\\xc6\\xee\\x0cZ\\xbf\\xa1\\xd0\\xb0\\x80R\\xcf\\xeb$\\xea\\xbdJB9\\x87\\xe3\\x99H\\xfc\\x80\\xc4G\\xab\\x1f\\nq\\xca\\x17Y\\xa9\\x02\\xbe\\xa6\\x95\\x0b|\\xfd\\xab\\xf8\\xee\\xd7\\xf6\\xb5\\xe5\\x91y\\xea\\xdc\\xf6~\\xa3\\xad\\xde\\xa7!\\xb2\\x96\\xdb\\xad\\xb4\\xa5\\'\\x8f\\xb3\\xa9S\\x04\"\\x8ck\\xb3t\\x9e\\x05\\xe3\\xda\\x84\\x9ag\\xd5x\\xdb,\\xe2\\xed\\xbev\\x13 \\xb2\\x9eg\\xf1\\xd5\\xdfHy=\\xa0\\xfe\\xb6\\xb4\\x8e\\xad\\xca4\\xff\\xfcD\\x88\\xb4z\\x15\\x89\\xae\\xe1\\xf8\\x19x\\xf0\\xae\\xf7\\xbcY?\\x86Ad\\xad\\xbf\\xb5z\\xe6\\xe5e\\xac\\xbb(\\x0c\"k\\xbf\\x1a\\xda}\\xd8Ir\\x81v\\xbf)\\xbe~v\\xb4\\xeb2\\xae\\x01u6E\\x87I\\xfc!\\xd2\\xcaS\\x92\\xfe\\x06\\xe9\\x9aV\\x1f\\xb5T\\x9eF\\xd6\\nM\\xe9\\xd3\\xe5:n~\\xde\\xf3m\\xda\\xb8j\\xa1\\xf29\\xacZ\\xb1K~\\xc51m=D\\xd6\\xe3g\\xe5\\xc6S\\xdd\\xac\\x92\\xbcGB\\xfc\\xda\\xf2\\xad\\x93\\xe8\\x1a\\xea\\xbd?\\x04\\x15K\\x99\\xfa\\xacW=\\x88\\xac\\xf5*\\xa1\\xe6Y\\xf3\\xdf]t\\x0eL{\\xb5\\x14\\xe3\\x98Y\\x81\\x17SW\\'v\\xa3\\x9dg\\x91\\xfc\\x95\\xe1<\\xab\\xe8{\\x83ah-\\x83\\x06\"\\xebu3\\xa1\\xf4\\xd1\\x03\\xaeO+\\xfd\\xf2\\xc4t\\x15\"\\xd4C,\\xdd\\xdf\\x19\\xea!B\\xf1\\x83r\\x0f\\xe4\\r^\\xd4j\\xa2\\x81\\xc8\\x9a\\x1f\\xe0\\xfd0 \\xb2\\xf6\\x1f\\x15j\\x9f\\x94\\x97\\x89\\x8a^w\\x8e8\\x16\\x81H\\xca\\xc3D\\xdbn0\\x0f\\xd3\\xb4UG<\\x8d\\xe7[\\xfc\\x82\\x11\\xea\\x898\\xfe\\xd4\\xd2\\xfe\\x81\\xf1\\xa7\\xe7[7o\\x9f\\\\&\\x9f\\x04cb\\xd5A!\\x15\\x876\\xaf\\x02\\xed\\xbd\\xa4}\\xbaH\\xf3,h\\xef\\xf5w>\\xf4\\x87\\xd7\\x82\\xbbK \\xd2\\xf2k\\x12?\\x80\\xfc\\xba\\xd6\\xb9\\xd3m_G\\xfe\\xe0\\x84q\\xaf\\xbc\\xb7q\\xfa\\x8fe\\x1f\\xc2\\xbc\\xad\\x96\\xe6\\x7f\\x83\\xfd\\xd3\\xba\\xc0\\xec\\x86;J\\xbe\\xf1\\x81\\xc8ZO\\x1c0o\\xc7\\x87\\xe3.\\xa1\\x11_ (\\x87\\xd4?\\xc4x\\xe7<\\x8a\\xc7\\xe0kG\\xa2\\x9dg\\x91\\xfcaa9\\x96\\xf2kX\\x0e\\xdf\\xb8)\\xd2\\xbe\\x15\\xac\\xf3S\\\\\"\\x94\\xc3\\xdao\\x9d\\xb4^\\xc2\\xdao\\x9d\\x96\\x0e\\xb6\\x8dYg\\x8c\\x96\\xabd\\x10\\xbfU\\xfb\\xc1\\xe3 y\\xfa\\xaf\\x03\\x82\\x0eAdm?\\xe0\\x9bW\\x8a\\xc4\\x0f\\xf2j\\xfe\\xb3\\xf2\\xb7\\xf6\\xdb^4Ym\\x84\\xc8Z\\xdfI(\\x15\\xdd \\xe3\\xf5\\xc1\\xdd\\x18}3\\x14\\xd6\\xe9\\x875\\x03i\\xf3\\x87\\x90\\xf8\\x0e\\x94\\xa7|\\xf7+\\xa0\\xf5{Z\\xbb\\xd8\\xe6\\xa1\\xf2z\\xd7\\x02\\x18\\xa1\\x1e\\x82\\xf7\\x89L\\xb4\\x90\\x0e\\xe0>\\x91_[\\\\\\x81\\xa5~\\xc4P\\x9e\\n\\xe57\\x18\\xfb\\xb4\\xcb\\xd0\\xc75\\xcf\\x14\\x81\\x18\\x90}\\x1f\\xc67\\xe6\\x95\\xdf i\\xbd\\x04\\xd2\\xdb(\\x83k\\x81\\x13\\xe9\\x1ec \\xd2\\xda\\x91H\\xf9\\x9e \\x7f\\xeb;\\xdafXJ\\xd7g\\xaf0^~\\xbcX_$~@%H\\xd7$>*\\x14]\\x13\\xed\\xf1\\x80\\xae\\xbb\\xce-{\\xe1`\\xbd\\xdd%!\\xb2\\xd6G\\xabF\\xdd\\x9cT\\xf4\\xaf\\xb6\\x1a\\x88\\xac\\xe7s|\\xe3eH\\xfd\\x93W\\xf1L8?\\rD\\xd6~i\\xce\\'\\xc4W\\x0376K\\xc7\\x18\\xd9\\xfc\\xb9\\xc3;\\xf3Q\\x13\\xb4\\xefX*\\x7f\\xa0}\\x87\\xaf>z\\x9fP\\x0e\\xd4G\\x83\\x8a\\xackSf\\xda\\x83H\\x88\\x96\\xee\\x0f\\x08\\xf5QH\\x07\\xc1!\\x17\\xdc\\xab\\xef\\xa8+\\x82\\xc8z\\xdf\\xd8\\x84\\xf5\\xa5\\x92\\x03K\\x9f>\\x07\\x91\\xb5\\xbf\\xd8\\xbfm\\x7f@\\xdau3\\xbeq\\xa1i\\x87\\xaf\\xf4\\xcfxu[\\x02\\x915\\x1d\\x08\\xa5\\x87\\xf0\\xb5\\x8b\\x91\\xf8(\\xb4\\x8b%_n\\xb98\\xac\\xcb}\\x17\\x88\\xb4\\xfa\\x0e\\xb1>@\\xdf\\xa1\\x8d\\x03\\xb3t^\\x0f\\xf5k\\x8f\\xc0\\xde\\x13\\xe4\\x9akC!\\xd2\\xf27\\xda\\xb8P\\xbe\\xf6\\x03\\xd2\\xba\\x19\\xb4\\x1f\\xf0]/!\\xd9\\x91X\\xefOKZ_`m\\xf7\\'\\xee\\'\\x01\\xf8\\x1b\\xcc\\'\\x05\\xf3Ja\\xfb\\x81\\xa5y\\xa5\\xbc\\x9f\\x96\\xdfSd\\xc6\\xa8\\xbd\\xf8Z\\xa8\\xbcR\\xae\\xab\\xae\\xad?\\x140\\xce\\x04\\x91\\xb5\\xdf\\x93Pqz\\xd6sbw\\xedH\\xca\\xe8\\x86\\xd1\\xaf\\x89j\\x9dm\\x895\\xf9\\xa0\\x1eO\\xf2\\x87%\\xf1\\x1d\\xa8\\xc7\\xf3]\\x0f\\xfe@(\\xe7\\x8b\\xfd\\x90\\xfb.\\xf3j8\\xf5\\xd6$\\x88$;\\x05\\xf4\\xbf\\xa6\\xb5SX\\xea\\xe7\\x8d\\x9f\\x8b\\xcb\\xa1\\x8d\\xa7\\x15*\\xbe\\x9eo\\x1cKa\\xab\\x9c\\xf5\\xc4\\xaf\\xef\\xf1\\x80\\xdfV<\\xa0\\xcf\\xc3\\xf27+\\x0c?g\\x07\\x11\\xd7\\xa7\\xdc\\x94\\xda\\xef\\xee\\xbc\\x08:fi\\xbc\\xb3\\xa5\\xe5\\xe4\\xd6n\\xb4\\xf1\\x80\\xdb?,p\\x1c\\xa2\\x9a\\xdd\\x11#\\xc9\\x0f\\xd2R\\xbd\\x17\\xca\\x1f+\\xc7jw;G\\xf4\\xa8\\x02\\x11\\xf3\\xeb\\xcd;\\xe7\\xd4\\xff0\\xb3\\xe1\\xd9H\\x9e\\xfc\\xedV\\xcc\\xdc\\x1b\\x1b\\x07\\x0cO\\x84\\xc8\\xd7\\x1e\\x02\\xcb\\xa9c\\xbd\\xa0\\xb4\\xbd\\xaf_\\x19\\x88y\\xb5?\\x86\\xa5\\xfe\\xfe\\x90\\x8f\\x16\\xec\\xe5\\xfa\\xae\\xd6\\x9f\\x85\\x8eC\\x84~(|\\xe5\\x0fm>\\x07\\x18\\xff\\x83\\xf39\\x90\\xca\\xf9\\xa7y\\xe6\\xfe\\x00\\xf2\\xc7\\xd2r,\\xe5\\xd7\\xd4\\xe5\\xf0\\xb4\\xc3\\xc2r\\x84\\xe2\\xd7\\xb4|\\x876o\\xde\\x1f\\x04: \\xe6i\\x04\\xf5\\xa1\\xcd?J\\x9a\\x07\\x7fm~\\xd1[~\\xea\\xb5\\xbb\\xff\\x91\\xf3\\xb3 \\xb2\\x8e\\x03\\xc3\\xf9\\xc8!B=\\xde\\xd2\\xfc.P\\x8f\\xe7;\\x0f~J(\\x07\\xeao|\\xe5ve\\xd0~\\xf8\\xc5Z?\\xc0\\x0c97z\\xdbpk\\xe7\\xcb\\xc4&\\xa1\\xa5 \\xb2\\xf6\\x1b\\x14\\xca\\xff\\xad\\xdc\\xb1-7\\xdbe\\xdc9\\x0c\\x11\\xae\\xa3\\x93\\xfc\\x06Iq\\x87P\\x0f\\xe9\\xd8c\\xf5\\xdc\\x88\\x88i\\'!\\xb2^\\x0f.[h\\xc6\\xc4\\x03\\xb6\\x85\\x1bCd\\xbd^rz\\xce&U\\xb9~.\\xcb \\xb2^/\\x11\\xca\\x7fg\\xea\\xd9\\xe5-\\x0b\\xc7\\x1e\\x88\\x82\\xc8z^\\xc2w\\xfd\\x87v^\"\\x94\\xff\\xc1\\xb0\\xde\\xdb\\x86\\xbc*\\xdc\\xa4\\x05D\\xd6\\xfa\\xa8\\xbaY\\xfd0\\xbfN\\xe7+A\\xfc\\xda\\xf6\\xd3#\\xc5\\x1d\\xb2\\xb6\\xf3\\xd1\\xca\\xed\\r>\\xb6F]\\x9f1\\xf51_\\xc3\\xd7\\xb4v>R\\xff@\\xfeVo[\\x89\\xda\\x0b\\xc4[\\xa6c\\x947r\\x1d\\x9f\\xf6\\xae\\xc5 \\xda}EH\\xf67\\xe8\\xd7\\x998j\\xc5\\xfaS\\xb5Sl0\\x0e.b\\x7f\\xbac\\xf93\\xf1\\xb4\\xf9\\xd2H\\xfc\\x80u\\xdeI\\xda8\\t\\xa1\\xf2\\x87\\xd8\\xcdy\\xd9\\xbf\\xce0\\xdf\\xf5\\x183\\xf2g\\x14\\x1b\\x9a\\xbf\\xd04\\xd6\\xfb\\xff\\x08\\xb5\\xef\\xb2Pvr\\x92~\\xc0\\xdaN\\x0e\\xed\\xe3\\xff+;\\xf9\\xe2\\x99;\\xca\\xe7+W\\xde\\x15\\xe3\\xa5\\xdf\\xf6\\x9c_\\xf90\\xa96\\x1c\\xa7$\\xbb2\\xb6\\'\\xe66N\\x85\\x92?q/\\xfd\\\\\\x13\\x1eN\\xbe\\r\\x91\\xb5\\xfc\\xe1\\xbb\\xae)T\\xfc\\x0f\\x89\\xae\\xf3*\\xee](=>\\xb7y#+\\x7f\\xd8\\xf7\\xfe\\xb6-\\x8fllQ\\x15\"_\\xb9\\xdd\\xa3W\\xe3\\xa3=S\\xfa\\x14\\xc7\\xd7\\xdf\\xca~\\x1f$\\xbaf\\x1d\\xb7K\\xb4\\x1f\\x00~\\xd0\\xe6T\\xaf\\xd1\\x97Jt:\\x0b\\xf1k\\xcb\\x07I\\xbb\\xfeCk\\xb7\\xc4\\xf4\\x06\\xedU\\xa4\\xfd\\x8c\\xf8\\xda-\\xe1\\xfe\\x18\\x1f(\\xdb\\xed\\xdf\\xb6?\\x06\\xde?\\x02\"k\\xbeC\\xbb\\xcf\\xd0:\\x0b\\xdb\\r\\xca9\\xbe\\xfdC\\xeb\\xef\"\\x94\\\\\\xc0\\xfb\\xd6@\\xa4\\x8do$\\xd9\\x13a\\xff\\x08\\xe5oy\\xdd`nR\\xefbA9D\\xd6\\xfeUB\\xe5\\xb7\\xa4\\xddG\\xc0\\xd2|B\\xac\\xe7%\\xb4\\xf9\\xa2\\xf9\\xfa\\t\\xd1\\xe6%\\x10j\\xffm\\xdauZ\\xd2\\xf8!\\xf9W\\xc1\\xf9\\x0f\\xdf\\xb8)Zz;!wR-:^y)D\\xd6\\xf1Y\\x97\\x9b\\xcf\\xef\\x90l\\xde\\xda\\x1c\"m\\xfe\\x1d\\x92^\\x05\\xf95_=\\x84\\xc4\\xdfX\\xfb\\xa1\\xd0\\xfa+\\xf3]\\xc7\\xa0\\xa5\\x03\\xbe\\xe5\\xd0\\xae\\xcf]\\xfd\\xb5\\xf3\\xde\\x1a\\x9b\\x8b\\x89 \\xd2\\xae\\x9b\\x11\\xe7\\xc1`\\xddL\\xa8<\\x0b\\xb4\\xf3\\x05\\xbe\\xfe\\xcaB\\xd9\\x0f\\x1a\\xbfN:\\xdc\\xf2T\\xe78\\x88\\xac\\xed\\x07\\xb7;6\\tLi\\xe4\\xea\\t\\x91v^Bk?\\x10j\\xde\\xd8\\xfeF\\xd2\\xe8\\xf4\\xc2\\xe9v\\x10i\\xe35I\\xf24\\xaf\\xe6\\x8dB\\xf9\\xad\\xe7\\xe6?z\\xb3osO\\xf7\\x1f\\xb6>\\xb6t\\x9cn\\xb8\\xdb=\\xed\\xf5Y\\xb7\\x8f\\xe3\\x14\\xca\\x9d\\xc1oJ]}3~\\xe5S\\xda}Rh\\xf7G\\x17*\\xef1_;9\\x89_C;\\xb9Py[k\\x1c=\\xfb\\xde\\xf5Y\\xd95\\x10Y\\xf3\\x1d\\xdauM\\x92~M\\x9b\\xb7\\x95\\xaf?\\x05)_\\x00\\xd4C\\xa6\\xeb\\xa2\\x9b\\x8d\\x8b\\xf1\\x9b\\x0e1 \\xfb\\xfew{Hv9yd\\x0fi\\xd0C\\xb5hl\\xc5\\x94!\\x10Y\\xef\\xaf\\xd9\\x7f\\xad\\xf3\\x902\\x8e~\\x8e\\x10Y\\x8f\\xd3\\xc7\\xe5\\xdf\\xbd\\xb7\\xf7k\\xd2\\x10\"&\\xc8\\x01\\xd5\\xcb\\'=\\x1c\\xf5\\\\k\\xa9\\\\H,Zm\\xe9\\xc4M.\\xd8}\\xc4j\\xe3\\xba%\\xf3+Z\\x15\\x1e\\x0bQ\\x9c}\\x1f#i\\xfc\\xd0\\xd6gL\\xa9\\x19\\xef\\x1d}\\x8f\\'A\\x84\\xf5\\xb1t]\\x13\\xd6\\xe7\\x97\\x80\\xa1oGL\\xf7\\xd8\\x0e\\x11\\xd6\\x87D\\xd7\\xb4~\\x0e\\x9dm\\xba7V\\xaf\\x18)\\x1f\\xde3\\\\Q\\xa6\\xe4\\xc2e\\xf8: \\xfb~nq\\xe2\\xb4\\xfc\\x8do\\xde\\x08\\x92\\xdf \\xac\\x8fG]\\xff\\x89\\xc6\\xc4\\x95\\x03!\\xc2\\xfa@?\\xd5q\\x16\\xf2\\x1d\\xbe\\xf3FR<\\x13\\xe4\\xd7i=.\\xdd\\xa8f2\\xda@\\xb4t\\x9d)\\xb7y#_?o\\xda\\xf1C\\xda\\x1f\\x03\\xc6!\\xf3\\xdd\\x1f\\xc31\\xce\\xab\\xe3UI\\x99t\\x88\\xb8>\\xb9\\xcd\\x17HtPw\\xf0\\xb5\\xf6\\x15\\x9aT\\x8f\\xc5\\xd7\\xb3\"\\x83\\x14~[V\\x16\\xc1\\xf8W\\x89\\xc4\\xb7n\\x89O[\\xd2\\xe6\\x95\"\\x95\\x03\\xf3J\\xd1\\xfa\\xc3\\x92\\xfc\\x06\\xff\\xbf\\xfa\\xc3b?\\x1a\\x88\\xb4\\xfe\\xb0_\\xdb<\\xebP\\xec\\x0b\\xfb\\t\\xa5\\xc5\\xd7 \\xb2\\x9eg\\xf1\\x8d\\xaf\\'\\xd1\\xf5\\x17\\xfc\\x9a\\xa7\\xdeK\\xf2\\x17c\\xedGL\\xbb^\\xcf\\xb7\\x1cZ>\\xca\\xd7\\x9eH\\x9bw\\xe5[\\xb1\\'\\xd2\\xfa\\x8b\\xf1\\x8d\\x97\\xa1\\xd5\\xabh\\xe7YB\\xc5\\xcb\\xf4\\x89>\\x9d\\x90\\xaaqH\\xf8>\\xcf\\xcaz\\t\\x15\\xf7\\xcew\\xfd\\xe7\\x01\\xa1\\x9co5N\\x8fV\\x0f\\xe1\\x1b\\xa7G\\xe2\\xd7\\xd0\\xbec.\\xbc\\xf9\\xd7\\xfc\\xab\\x7f\\xb4\\x87\\xc8\\xda\\xdf\\x9fo< I\\x0f\\x81\\xeb\\xb4\\xb4\\xf6QK\\xf5Dh\\x1f\\xfd\\xae\\'\\xe6|\\xd1\\xc6M}\\xd7\\x13s\\xbeh\\xf9\\x0e_=\\xf1\\n\\xa1\\x1c\\xd6yN\\xad\\x01\\xe2\\x17\\xa4\\xeb4[\\xbb\\x0b\\xc5\\x1a\\xcf\\xdc\\t\\x91\\xb5\\xdf\\x93P\\xf9:W\\x9c\\x1f\\xd8p\\xe6\\xd2E^\\x10\\x03\\xb2\\xef\\x93\\xf4\\x9d_-\\xd4C\\xf8\\xcamR9Pn\\xd3\\xda\\x91\\xa0\\x1e\\x82\\xedH\\xb4\\xe3\\x87\\xaf^E\\xdc\\xef\\x03\\xe8U_\\x9b}\\xc7\\xd2\\xfd>X\\xef\\x8f\\x8e\\xfd)`9\\x90\\x8f\\n\\xe5\\xefr\\xd8/\\xa5\\xf4\\xa0\\x82\\x13# \\xb2\\xde/G\\xdfn\\x98\\xb8L\\xe2\\x88\\xe7\\x18\\xe1~,\\xb9\\xe5\\x8f\\'\\xc9m\\x18\\xbf@\\xbb\\x1e\\xccW\\xaf:\\x13\\x12w\\xc1\\xd9\\xc7\\xaf\\x0bDZ\\xbf\\x00\\xa2\\xbf\\x18(g\\x88zc\\xbfE37\\x16\\x84HK\\x07$\\xba^}/\\xa2\\xee\\x82\\x84\\xe8?\\xf1\\xb5P\\xfb\\x9f\\n\\x95\\xcf\\x9bv\\xbf6K\\xf57\\xb8_[\\x97\\xde\\xe7\\x86\\xc5\\xed\\x9f\\xe3\\x871y\\x9a\\xfdUG\\xc5\\x8860\\xdf\\x93\\xa5\\xf2\\x14\\xe6{\\xfa\\xb7\\xed\\x07\\xf6o\\xcb\\xafL\\xcb\\xdf,\\xf5S\\x85\\xfc\\x8d\\xaf\\x9fj\\x11\\xd0~\\x1f\\xeb\\x03\\xe4\\xb6P\\xfb7\\n\\x95\\x97\\xad\\xe2\\xfb\\xb5\\x86 \\xa7w\\xa9\\x18I\\xfb\\xa3\\x93\\xf2\\x05\\x90\\xe46\\xd4\\x0f\\xf8\\xc6\\x03~ \\xd0\\x01\\x8c\\x07\\x9cZ+\\xdd\\xa1\\xba[\\xbfr\\x10i\\xfdTIt\\r\\xe56_\\xbd\\x97D\\x07\\xac\\xe3B\\x89\\xfc\\x00\\xc8\\x05,\\x0fr\\x93\\x0b\\xa4\\xb8\\xa9\\xea\\x84r\\xa0\\\\h\\xef\\xe8W\\xa7\\xb2\\xb5\\xa7\\n\"\\xeb}<\\x85\\xda?X\\xa8\\xbc\\xfbB\\xed\\xa7\\xf7\\xec\\xbe\\xe7\\xb3B\\xa5^\\xb9B\\x84\\xfdC\\xd2\\xabh\\xc7\\xcf\\xf6\\xd1\\xa3\\x0c\\x17\\x9e\\xfb?\\x87H\\xab\\xbf\\xd1\\xda\\xfd\\xf9\\xe6\\xbb%\\xfaS\\x00\\xb9\\xd0\\xfe?\\x15\\x126\\xf9\\xec\\\\\\x85\\xb1a\\xea\\xc8\\xe5\\x1b\\x9ey%B: \\xcd\\xb3Hr\\x0e\\xd2AQ\\xfd\\xddF\\xcf\\x8b\\xdb<\\x84\\xc8:\\xae\\x80o>bR\\x1e\\x19\\x98\\x8fX(y:\\xd0\\xedib\\xca\\xb0c2\\x88|\\xf9\\xe8\\x18c\\xc4\\x84\\xc5\\xaf\\xdac\\xf7\\x1f\\xab|a\\xa7\\xeao\\xdd\\xaf\\x1d\\x02\\x916\\xff\\x0e\\x16\\xcc\\xb0\\x1chG\\x12*?\\x1fm\\x9c\\x1e_\\xbf\\xce\\xd6%O\\x8e:\\xd8\\xbc\\xdbF\\x8cS\\xcd~M\\xd6\\xcc\\xe8\\xd6\\x9a6\\x0f\\x06m\\xbeh\\xa1\\xf2\\xc3\\n%\\x17\\xf8\\xda\\x0fHv\\n\\xa8_\\xf3\\xe5\\xa3\\xa4\\xfa@>J+\\x7f,\\xcd[\\xf4O\\xf3A\\x92\\xe8\\x8d6\\x1f$_{/m\\x9eS\\xa1\\xec\\xbd\\xa4y\\t\\xdf\\xf9)\\x9c\\x97\\x8c\\xb4\\xf5K(X\\xb4\\xe78\\x88\\xb4\\xf3S\\xda\\xfd\\xf4\\xbe\\xdb\\xe3s\\xbeh\\xf3m\\x08\\xb5\\xdeh\\xbb?8\\xda=}\\xe0R\\x8c\\x96\\xc6\\x9b\\xd1\\xae7\\n\\x15\\x07&T<\\xc6\\x88V\\xc3\\x0e\\'\\x16]Z\\x02\"\\xeby\\xb0P\\xf2T(\\xbbXU\\x9f\\xfc)\\x0f=[^\\x80\\xc8z\\xdf\\x17\\xbe\\xfbI\\x90\\xec\\xe4\\xac\\xf7\\xa3$\\xd9\\xc9\\xffW\\xfe|\\xd0\\xfe\\x96W\\xfe|\\xb3\\xc7\\xd7\\xbe$\\x8f\\xbd\\x12\\x04\\x91\\xd6\\x9f\\x8f4\\xff\\xf9\\xb7\\xfb\\xf3\\t5N\\xe5\\x83\\xc6\\xdcL\\xaez\\xc8\\x0e\\xe3o\\xd2\\xcd\\xeb\\xdb\\x97\\xba\\x90\\xcaz?d\\xa1\\xe4\\x1c\\xad\\xfd\\x8d\\xef\\xba\\xcc\\xbd\\xda>\\xfaIA\\xc9\\xa70b?\\x148/!\\xf9\\xd5\\x90\\xe6Yy\\xb5\\x0f\\xc7\\xabv-\\xc2n\\x95X\\xb9\\x11\"\\xe4o\\x96\\xe6\\xdb`\\xcd\\xdfH~\\xd1\\xac\\xfd\\x88_P\\x96\\xa3JL\\xbfX%y\\xf7\\x1d\\x88\\xac\\xfd\\xf9R\\x0b\\xb5\\xee\\x93&\\xbb\\xe6\\x04\\x91\\xb5\\xfd\\x806\\xef\\n\\x89\\x1f\\x90\\xf6\\xa3d\\x9dw\\x85\\x14\\x17\\n\\xf5k\\xbet@\\xca\\xe7\\xcdw\\x1f\\x9b\\x7fJ\\x07\\x81^s\\xd2~\\x9b\\xf4f\\tD\\xd6t\\xd0%\\xf8N\\xd1\\x9f\\xd7\\xad\\xfb\\x80\\xb1\\xe06OOq\\xf5\\x0b%h\\xe9 M : \\xf1\\x1d\\xd6t@\\xab\\xef\\xcc=\\xf2hI\\xb9\\xd5.-!B;\\x12I\\xce\\x15%\\x94\\x03\\xedHB\\xc5\\xb9\\x06\\xbd\\xbf\\xdd\\xabN9\\x9b\\xd7\\x10a\\\\(\\xf6\\xc3\\xa7-\\x07\\xc6\\x85\\xc6^\\x9c\\xedu?\\xb9S/\\x88\\xac\\xf3h\\n\\xb5?\\xe0U\\x8f\\xe5\\xd7e\\xfbE\\xae\\x10Y\\xe7\\t\\xa6\\xdd\\x07\\xd7R\\xb9\\xcdz\\x9eE\\xd2\\x13\\xe1<\\x8bo^\\x9c\\xaf\\xcdN\\xd1r\\xdb\\x16\\xf1\\x9b\\xb5U*Ad\\xbdN\\xcb\\xd7o\\xe3k\\xcb\\xcfG\\xeb_ei\\xfc6\\xd4\\xe3\\x85\\xca/\\xc6w\\xbd\\x9e\\xd6\\x8e$\\xd4z=\\xad\\xdd\\x9fo~>\\xa1\\xf2\\xe2\\xd0\\xc63Y\\x9a\\x17\\x07\\xc63\\t%\\xb7\\xd7\\xc4\\xacI\\x11\\xdf\\n^\\x051\\xaf\\xe46\\xdf\\xfcUB\\xad\\x9b\\t\\x15\\xc72\\xfd\\xc9\\xbc\\xcd}\"\\x13&C\\x84\\xfc \\x9e\\xa7\\x1e\\xff2Q\\xd1\\xeb\\xce\\x11\\xc7\"\\x10i\\xe3\\xf8I\\xe5\\xc08~\\xbe\\xfa5i\\x9d\\t\\xd2u\\xabg^^\\xc6\\xba\\x8b\\xc2 Bz\\x8b\\xb5p\\x9e\\x05\\xe9\\xad\\xf7\\xbci\\x9d\\x86\\x8eN8\\x0f\\x91\\xb5\\x9f7_\\xfb(\\xad\\xff\\xce\\xf7}<s\\xbe\\xeeQ\\xb6\\xdb\\xe2\\xe1\\xbes\\x7f|:\\xa7(D\\xda\\xfe\\xb9JYN^\\xc7\\xf1\\xc3\\xfe\\xb1\\xd4\\xee\\x0f\\xfb\\xa7O\\x83y\\x11\\xcbJ\\x05t\\x83\\xd8?\\xfb\\xfe\\x9c\\xa6\\xc6\\n2\\x9f\\xda\\rM<\\xe9\\xdaeG\\xcf\\xd0v\\xcf\\xd2\\x16@\\xa4\\xa5\\x03\\x12]\\xff\\xd3<s\\xa4\\xfa\\x90\\xfc\\x0f`\\x9e9\\xbe\\xebL7\\x08\\xe5@;l=\\xdfh_\\xab|}GA\\xb44N\\x0f\\xae3A\\xff*Z\\x7f1K\\xfd-\\xff\\x1a\\x13xn\\x99\\xb8\\xe7\\x16|\\xcdw\\xdf\\nZ\\xbdjD\\x0b{\\xfb\\xc6{\\xfeS\\x19\"k\\x7fK\\xbev\\x7f\\xda\\xfd\\x83\\xbbwl\\xfc\\xe0D\\xc3\\xdf\\xfbc|\\xb8\\xa6\\xf4\\xd5F\\tQ\\x06\\xd6\\xfeUB\\xedgd\\xbf\\xec\\xc0\\xfcZ\\xba\\x88\\xfe\\x10Y\\xc7c\\x04T\\xbdyuU\\xa1C\\xcf \\xd2\\x8eS\\xdax\\xa6\\x7f\\x9b_\\'\\xdf}\\x15I\\xeb2p\\x9e\\xc5\\xd7\\xaf\\x93\\x96\\x1ft\\\\\\xeb6\\xbc\\xc6\\xec\\xb7R\\x8c\\xd0\\xcf!7\\xff7\\xda\\xfd\\xb3\\x84\\x9a\\xff\\xf4\\xbbRc\\xf2\\xb4nob1v*3\\xa5zl\\x89\\xf6ca},\\xd5\\xdfX\\xdb\\xfd\\xbf\\xfbW\\xfdw\\xbb%\\xa9\\x7fH\\xeb2y\\xe5_e\\\\r\\xba\\xd2\\xa1\\xa7\\x81\\xf9!\\ne\\x17c\\x1d\\xdf\\x88\\xe5\\'D\\xd6\\xf1\\x8d3\\r\\x86\\x9b\\x85\\xc5\\xeb\\x14\\x18I\\xfb<X\\xaaWU\\xdep\\xb2s\\xca\\xe6V\\xc7\\xf15_}\\xf4.\\xa1\\x9c\\xbc\\xcaO\\xc17>\\xab+h?\\xfc9\\xb4+\\x0b\\xb5\\xaf/\\xad]\\x99\\xefz\\xf0\\x8d\\x96\\xfb\\x8a%mN\\xdc\\x01\\x91\\xb5\\x9d\\x8fo\\xde\\x08\\xda8#\\xbeq\\xef\\xa4\\xfe\\x81q\\xefB\\xf1\\x9d\\xe8\\x8ae\\xdf\\r7V\\x9f\\x04\\x11\\xf2\\x1dK\\xf3S@\\xbe\\xc3W\\xef%\\xf1\\x1d\\xd6~B\\xb4\\xeb\\xa7\\xdf\\x8a\\x1f$\\xed|\\xee\\xbb\\x9d/\\xe7\\x8b\\xe4\\x8f\\xc4\\xba\\x7fH\\xfeH_\\xcc\\xb7\\x9f\\x0e.T\\xabc\\x953\\x18\\xabFl/\\xe8\\xbc7\\xea4\\xd4\\xaf-\\xf5G\\x82\\xfa\\xb5g\\xc6\\xfc9\\xd5l\\xea\\xf9@\\x94f\\xdf\\x1f[\\xc0),\\xb8\\xf6\\xd6\\xe3|\\xedb\\x7f\\xb4WUm|f\\xfez\\x88\\xb4\\xedF;N\\xbf\\xd3u\\xce\\x17m<\\xd3\\xc2\\xdd\\x9e\\xfd\\xb6\\x1b\\xc6\\xa4C\\xa4\\xed\\x1f\\x92\\x7f\\xfc\\xf7\\xfe\\xf9\\xef\\xfdCk\\xe7\\xe3\\xdb?\\xdf\\xe5\\xc2?\\xeb\\x1f\\xda<\\xc1|\\xf9\\x1b\\xad\\xfc\\x11j\\x1f\\x9b\\x0e\\x7f6\\xb8w\\xd5\\xff\\xc8\\x10\\x88\\xac\\xfdT\\xcb=\\x907xQ\\xab\\x89\\x06\"\\xeby\\xc9\\xba6\\xb6\\xeb_nv>\\x8e\\xb1\\xa7\\xfd\\x9c6\\xf9S\\x0b\\x8f\\xa6\\xf5S}L\\xe8\\x1f(O1=Ad\\xbd\\xce\\xc4w\\x1d\\xfd2e9|\\xe7\\xdb$z\\x83\\xf3\\xedk#\\nN\\xff\\xebG\\x9b\\x94\\xf9\\xe7\\x1a8\\xf4\\x1eSa\\x00F\\xbe\\xfb\\xdcE+B3\\x1a\\xb8M=\\x84\\xaf\\xcb\\x18\\xd6\\xa4l*:\\xc0\\xfe\\x9f\\xe6\\xc5!\\xd1\\x1b\\xcc\\x8bS\\xbc\\xf6\\xdc\\xf6\\xbaU\\rB!\\xd2\\xce\\xb3.\\x10\\xfa\\x07\\xce\\xb3\\x12JE7\\xc8x}p7F\\xdf\\x0c\\x85u\\xfaa\\xcd@Z\\xbb2\\x89\\xde ]\\xf3\\xf5\\x87%\\xd1\\x01\\xf4\\x87\\xe5\\xbb\\x0f!\\x89\\x0e\\xe0>\\x84_\\x9b\\xff\\xe8\\x06\\x0b\\xf57H\\x07\\x85\\xfa|\\xe8y/\\xf2\\xeeZ\\x88B\\xe5\\xf9am\\xa7\\xc8m\\xfd\\'7\\xfb(\\xed\\xbe\\xf2B\\xc5\\xcf\\xed9X@\\x95\\x12\\x9ah\\x0f\\x91\\xf5z\\xa3P\\xfd\\x83\\xf3^@\\x84\\xfd\\xb3\\x9b\\xa7\\xfd\\xba\\xeb\\xd9\\x82\\xf3\\xb7\\x8dsJ\\x87\\xc8Z?\\xe0\\xcbGi\\xd7\\xb3\\x84\\xea\\x9f\\xbe\\n\\xd7\\x9d~\\x1dC\\'@\\xa4\\x1d?\\xb4\\xf9\\xbc\\x85\\x1a?GS\\xd3\\xbc\\x1e\\x95\\xbe0\\x0e\"\\xeb\\xf1\\x13W\\xa5\\xe4L\\xef\\xabk\\xd20^V\\xad6&\\xf7/\\xd5\\x0b\\xfa9X\\xba?\\x06\\xf4s\\xf8+c@\\'I\\xbf\\x1f.Bd\\xed7\\xe8\\x9c\\xf0\\xbcS\\x9b\\x9b\\xb2\\x83\\x10\\xbf\\xb6\\xf8\\xfa\\'\\x84r`\\xdc\\x07\\xdf\\xf5`\\xbc\\x7f#,\\'\\xaf\\xe2\\xc0|\\xea\\xfePaF\\xa2\\xfd;\\x8c\\x9d./\\x1e\\x14\\xfax\\x9f\\x08\\xf2\\x1dK\\xf5\\x1d\\xc8w\\xa0^m\\xa9~-\\xd4\\xba\\xf36J\\xbe#\\xd4\\xba\\xb3*\\xbdt\\xbf\\xd3O\\x7f\\xa8\\x07\\xf1k\\xcboI\\xca\\x0b\\xca\\x9a\\xaeI\\xe3\\'\\xaf\\xf2\\x12$\\x8eZ\\xb1\\xfeT\\xed\\x14\\x1b\\x8c\\x83\\x8b\\xd8\\x9f\\xeeX\\xfeL<\\x1c?\\xaby\\x8e\\x1f\\xda\\xb8\\x8f\\x05\\x16\\xd6\\x07\\xfa#eT6\\xccO-;\\xb4)F]Q\\xbd\\x8d\\x97\\xf5y)\\x8c\\x0b%\\xad;\\x97 \\x94\\x03\\xe3B\\x85\\xca\\xc3$\\x14\\x1d<\\xd8^\\xd2P\\xe0t\\x95\\xcb\\x10Y\\xcb\\xb9\\x83\\xdd^\\xe9\\xab\\xd7*\\x1c\\x08\\x11\\x0b(\\x1cgd)\\xbd\\xd1\\xee#\\x00\\xf3\\x04[Jo0O\\xf0nCb\\x8d\\t\\x97:\\xc5c\\x94\\x8d\\xf4\\xadU2q\\xe6HHo\\x96\\xe6\\xa7\\x80\\xf4&T\\xbcYL@\\xbf\\xe5\\xc5\\r\\x07\\x17Bd\\x1d\\xe7*\\x94=D(\\xbf4\\xa1\\xf2\\xd4__\\xb2V\\xe5[sW\\x17\\x8c\\xabo\\xdb]]vk\\xbf\\x1b\\xd4\\xafI\\xfc\\xcd\\x86PN^\\xe5\\xa9\\xf7\\xbb\\xb0\\xcce`\\xf3\\xd8\\x07\\x10Y\\xfbq\\xddN{\\xfb\\xe8\\xd7\\x0f\\xe6*\\x10i\\xe7?\\xb4t\\xfd\\xde\\xdf\\xb6\\xe5\\x91\\x8d-\\xaaB\\x84\\xf4F\\x8a7#\\xd5\\xa7G\\xaf\\xc6G{\\xa6\\xf4)\\x8e\\xafc\\\\\\xfa\\xd4\\x1bmX#\\x87H\\xcb\\x0fh\\xd7\\xcd\\x84\\x92?|\\xf9\\x8eP\\xf3,\\x92?9\\x9cg\\xf1]7#\\xed\\xef\\xccz\\x1d\\x03\\x13Tn\\xe5\\xcc\\x969>\\xebr8\\xa0\\x1a\\xc6\\xad\\x9dG\\xdcN\\xb5}\\x1c\\x0f\\xf9\\x0e\\xc9^E\\x1a?\\x90\\xef\\xd4\\x9fr\\xa3\\xf0\\xe3w\\xda\\xf5\\x18\\xad\\n\\xa6\\xfdT\\xd8/\\xd5\\x95\\xb5=\\x9e\\xef|\\x814~X\\xcf\\x17h\\xd7\\x9d\\xe5\\x07z\\xddl^\\xa7\\xc2U\\x8c\\xd0\\xbe\\x83\\xdb\\x8d\\xd4?\\xb4\\xfb\\x03\\n\\xa5\\xf7V\\x8a\\xd95\\xb5\\xdb\\xabN\\xad \\xb2\\xb6[VkS\\xa9o\\xa5W\\x9b\\'Cd\\xcdw\\x84\\xda\\xff\\x94V\\xce\\xf1\\xf5\\x0b\\xa0\\x9d\\xcf\\x91\\xf4\\x10\\xd2|\\x1b\\xce\\xe7\\x9a-I/q\\xe7\\xe2\\x84X\\x88\\xac\\xed\\x14wG\\xa9C\\xf2\\r\\x1fr\\t\\xe2\\xd7f\\xa7 \\xe9\\xa3ye\\x7f\\xb3\\x8eZU\\xb3s\\xa9\\n\\xd7!Bz#\\xd1A-B9_\\xd0\\xdb\\xe6\\x9e\\xfbn\\xdc\\xe8Z\\x02\"k\\xbec=\\'}\\xdf}C\\xcaE\\x8c];HW\\xff\\xf0\\xf3\\xb1]\\xac\\xf3m\\xfc\\xdb\\xe4\\x8fP\\xe3\\x946\\x9f\\x03_\\xb9\\x80\\xf3\\xf1A\\xa4\\x9d/\\x90\\xfc\\xbc!]7Z\\xe61\\xb5\\xe6\\xd4\\xcd]!\\xb2\\xa6\\xeb5u\\xa7\\xfe\\xa9\\xd26:\\x0f\\x91\\xb5?\\x92P\\xfb\\xf6\\xd1\\xe6\\xcd#\\x8dS\\xda\\xfd\\x17\\x84\\xcacV\\xaa\\xb6\\xa9\\xd7\\xc1\\xd3z?\\x88\\xb0\\x7fH\\xf96h\\xf7o\\x14*\\x0f \\x9e\\x1f@dM\\x07\\xb4\\xfa\\x1b\\xdfr~-{)n\\xcb\\x85:\\xde\\x10\\xb1\\x9f\\xf7\\xc4\\xd7vI+\\x16l?K\\xf2\\x7f#\\xf9\\xf7n\\x0emb\\xdd\\xf8U\\x91\\xcb\\xf8\\x9a\\xef\\xfc\\x94\\xc4wX\\xaf\\x03\\x92\\xe2\\x1bY\\xcb\\x9f\\xc2\\xd9\\x98\\x1b\\x7f\\x8b\\xbd\\xbc\\xd15\\xf0\\xbaUu\\x8c\\xef\\x0f\\xaf\\x18\\xddii\\x8b\\x9fX\\xcfOi\\xf9\\x0e\\xdf\\xf9\\xe9\\xd6\\xe6\\xdbGTY\\xee\\xd1\\x1d\"k\\xb9\\xc07\\x0f\\x13I.\\xc0\\xf8\\xb9\\x8c\\xfc\\x19\\xc5\\x86\\xe6/4\\r\"k\\xb9M+\\x7f,\\x95\\x0b\\x90\\x1f\\xd0\\xae/\\x90\\xe6Y\\xb7\\t\\xe5\\xc0\\xf5\\x05\\xa1\\xd6i\\xb7\\xafh\\x98(i\\xd7x=D\\xd6\\xf3\\x1f\\xa1\\xe6\\xc1/\\xeb\\xcd\\x1a\\xbbm`7_\\x88\\xac\\xf7\\xe5\\xd9\\xb8n\\xc9\\xfc\\x8aV\\x85\\xc7B\\xa4\\xb5\\xf3\\x91\\xe46k?b\\xdau\\x0c\\xa1\\xe2\\xeb\\'u<\\xbb\\xc4\\xcec\\xec;\\x88\\xd0\\xeeO\\x9a7\\x96!\\x94\\x03\\xed\\xfeB\\xadc\\xd0\\xfam\\xf0]\\xc7X\\x18|\\xa9~\\xf5>\\x0f+B\\xfcV\\xfdT\\xb1\\x9c\\x86\\xc8z\\xfdG(\\xb9=\\xbe\\xd9\\x95V\\xa7\\xc7>\\x8f\\xc7\\xd8:\\xff\\xed&\\x7f\\xae\\xeam\\x8b\\xf9u\\xc8\\xe1\\xd8C\\x0b5\\xdd+[\\xba\\x1f%\\xcc\\x03\\xc8W\\x7f\\xc3\\xfb\\x07\\xc3r\\xf2\\xca\\x8e\\xd4w`\\x0b\\xd1\\xf6\\n?\\xc4c\\x1c\\xf2\\xa8\\xf6\\xbbE\\x17\\xcb\\xb7\\xa5\\xf5\\xe3*D(\\xe7[\\xb5_\\xd3\\xce\\xe7\\x84\\x92\\xa7=\\xca\\xdc\\xb9t-\\xceo7D\\xd6\\xf2\\x944\\x0f\\xa6\\xd5\\xdf\\x88y\\t\\x80\\xfe\\x16R=\\xa6bC\\xff\\xd0\\x89\\x10a~$\\x92\\xfc)\\x05\\xda\\x0f\\x7f\\x0e\\xf3\\xb2\\t\\x15\\x8f!\\x94\\x9e\\xb8\\xe5\\xe1\\xc2\\x9f:\\xe7\\xf7\\xf7\\x86\\x08\\xe9\\x80\\xd4n$\\xfd:\\xaf\\xe4\\x8f\\xbc\\x91\\xeb\\xf8\\xb4w-\\x06Ad-\\x7f\\x0e\\xfb\\xa5\\x94\\x1eTpb\\x04D\\xd6\\xf3\\x1f\\xdau@\\xbe~\\xf8|\\xedb$\\xba\\x86v\\xb1\\xf4G\\xbd\\\\\\x06Dd\\xf4\\xc5xi\\xea\\xe9\\xbdC\\xe2\\x94.\\xb4r\\x81\\xd4n\\xb0>\\xedo$\\x8dN/\\x9cn\\x07\\x91\\x96\\x1f\\x90\\xf6\\xcb\\x81\\xfc \\xa5d\\xd5\\xeb\\x07\\x9a7u\\x85\\xc8Z\\x7f\\x13j\\x9d\\xc9\\xca\\xb1\\xda\\xdd\\xce\\x11=\\xaa@\\xc4\\xfcm\\xf3\\xce9\\xf5?\\xcclx6\\x92\\xe78%\\xcd\\xb7q\\xff\\xe0\\xf96\\xa9\\x7f~$\\x94\\x03\\xe7\\xdb|\\xf3N\\xd2\\xd6\\xe7I\\xf5\\xb7\\xdeVu\\xdfV\\x81\\xc8:_\\xb4\\xcd\\x93b\\x936\\xc7\\xfc>\\x1a\"\\xeb|BB\\xed[\\xf1o[?\\xa5\\xd5{I\\xfdC\\xb2\\xf7B\\xfe\\xa6P\\x8f3\\xfe|j\\xc5*\\x88\\xac\\xf5\\xde\\x84\\x03\\x0b\\xad\\xafK&\\xb4\\xc5\\xb8b\\xd1\\xda\\xcd\\x0e\\xd1\\xb3\\x83Y\\xe79\\xbd\\xd5c\\xf0\\xdd>+\\xeev\\xc5\\xd8\\xba\\xdc\\xee\\xf7\\x87\\xae\\x9c\\xd9\\n\\xcb\\xb1t\\xfc\\xc0r\\xf6.\\xab\\xeb\\xecQyTS\\x8c\\x1eSW\\x86\\xaf*\\xdd\\xe5\\tky\\xca\\x97\\xaeI\\xfe;\\xac\\xe9\\x9a6O\\xc9\\xff\\xd7\\xf5`\\xbeve\\xa1\\xd6\\x83i\\xe3\\xa6\\xf2\\xda\\xcf\\xe1O\\x81\\xe8\\xfa>e\\xbb\\xa5D$\\xff\\xdca\\xfd\\x80\\xf6\\x18\\xe1|\\x81\\xd5:\\x13_=\\x9e\\xb6\\x7f\\x84\\xf2\\xab\\xa1\\xe5\\xa3\\xdf\\xf7\\xb1\\xc9\\xe9\\xffVv\\xd4O\\xfarV?\\x9f\\x87\\x08\\xf9\\x9b\\xa5|\\x14\\xf2\\xb7\\xf8\\xa6cK9vR\\x96\\x80\\xc8z\\xfd\\x87o\\x1c\\x18I\\x7f\\x83\\xed&\\x94=\\xc4\\xde\\xdb\\xce\\xe5Mt\\xb7`\\x880\\xfe\\x87d\\x17#\\xed#\\x00\\xe3\\x7f\\x84\\xb2\\xf3)\\xdc\\xd5II\\x8b\\x1b/\\x87\\xc8\\xda\\xce\\xc7\\xd7~@\\xf2\\x1f\\x85\\xf6\\x83>]\\xc4\\x87\\x95\\xe1-\\x9fA\\x84\\xfb3\\x91\\xf8\\x01)^\\x13\\xee\\xcf$\\x14\\x1f\\x15*\\xbf\\x7f\\xb5\\xe3#.\\xb8\\x1dN\\x8a\\xc78a\\xdf\\x92\\xc3n\\xd3Gw\\xa5\\xe5\\xd7\\xb4z/\\xed::)\\xbf\\x0b)\\x1e\\x03\\xce\\xeb\\xff\\x9c\\xfd\\\\\\xbcf\\xddh?\\x88\\xdf\\xaa\\xdd\\x85\\xaf]\\x99D\\x07\\xd0\\xae\\\\\\xf1\\xfdZC\\x90\\xd3\\xbbT\\x8c\\xa4\\xfe!\\xd9]\\xaa\\x10\\xca\\xc9+?\\x07{\\xd3\\xfe\\xea%Bz\\x8e\\x87\\xc8Z\\xce\\x91\\xf4\\x90\\xc0\\xec\\xfb\\xb9\\xed\\'A\\xe2o\\xac\\xfd\\x02H\\xfc\\r\\xfa\\x05\\xf8\\x16\\x1cu\\xdbt_6\\x11\"m\\xff\\xd0\\xfa9\\xfc\\xdb\\xf2\\x98a\\xfb\\x07DZ?\\x07\\x12\\x7f\\x83\\xeb\\x0b\\x9e\\xc5\\xf7_(T\\xb9jK\\x88|\\xe5B\\xd7\\x9e\\xab/W[?\\xe3\\xe3\\xd7\\xb7\\x95[u>\\xa4PR\\x1d\\x88\\xac\\xf3\\xc8\\x0ch\\xd4b\\xf0\\x94i\\xc7\\xdbB\\xe4\\xcb\\x0f\\xe08\\xf5*\\xd2O\\xa7\\xbc>\\xdd\\x03\"m9\\xb4\\xfe\\xf1|\\xed\\xa3$\\xfb\\x0ek\\xfbhiB\\xbb\\xb1\\x9eo\\x93\\xc6)l7\\xc5\\xbafI\\x1eC\\x06\\xd4\\x80\\x08\\xd7eJ\\xd9\\xb84Te\\xccP\\xd1\\xcam\\xb8.\\xf3\\xfb\\x9b%\\xdec\\x8aM\\x9e\\x88\\xb1\\xa3s\\xa5\\xad\\x1d\\x83KV\\xa7]_ \\xe5\\x8d\\x90\\x0f\\xc8\\xf7\\xa0R\\xbb\\xbb\\x1b\\xf1u\\xed\\x8e7g\\xcd\\xfaE\\xd1\\x14\"k{\\x15\\xad\\xdd\\x9f\\xef8\\x15*\\x8e\\x7f\\xd5\\x8a]\\xf2+\\x8ei\\xeb!\\xb2\\x8e_\\x10\\xca\\x9f\\x9c\\xd6\\xbeC\\xf2\\'\\'\\xf1\\x1d\\xa8_\\xf3\\xe5;\\xa4\\xf1\\xf3\\xad\\xe6\\x95\\xa2\\xe5;B\\xd9\\x95\\x85Z\\xdf\\xe6\\x1b\\xafY\\x8cP\\x0e\\xb4\\xbb\\x08\\xb5\\xbe\\xbd\\xffL\\xc9\\xc7\\x8b/\\x0c\\xba\\x04\\x11\\xeb\\xd7\\x9e\\x17\\x9d\\x1d^\\xcew~\\xcew\\xbep\\xaf\\xb6\\x8f~RP\\xf2)\\x8c\\x87b_\\xd8O(-\\xbe\\x06\\xed\\xbd\\xa4}\\xd4h\\xf3\\xd9\\xa5\\xceY\\xf4\\xe7\\xcb^\\x13\\xabB\\xc4\\xf6\\x83\\xcb\\x13\\x86F%\\x16m\\xea\\x9f\\xcc\\xd3~\\xb0\\xc3\\xb7x\\x1bq\\xf8\\xb9T\\x88\\xb4\\xfa\\x0e\\xed>\\x02\\xdf\\n?\\xf8\\xee\\x7f\\xfd\\xdf\\xfd\\xafItM\\xe2\\x07y\\xe5\\x7f-\\x94\\x1f\\x97Pz\\x88\\xe1/\\xbb5\\xfd\\x8e\\xd5\\x8e\\x80\\xc8Z\\x0fY\\xfe\\xe7\\xf8\\xfd\\xaf\\xbaT]\\x8f1, \\xbd\\xbf\\xf2\\x9eG+\\xdau&\\xda8\\xca\\xef\\xfc \\xe7\\xeb[\\xe5\\x07$\\xfd\\xa0\\x12\\xa1\\x9c\\xbc\\xe2\\x07|\\xf3_\\xd3\\xf2\\x03\\xa1\\xfc\\xb8\\xf8\\xc6\\xa3\\xd3\\xce\\xe7\\x84\\xf2?\\x10*/5\\xdf8q\\xa1\\xfcaI\\xed\\x06\\xe7\\xc1\\xa4qJ\\xdb?\\xb4\\xfa\\x1b\\xad\\xfc\\xe1\\x9b\\x07P\\xa8x\\xf4\\xd4\\x16\\xaf\\xaa\\xae\\xea\\xd7\\xa3&\\xc6\\x81\\x07\\xefz\\xcf\\x9b\\xf5c\\x18\\xebq\\x1ah=<r\\xc2\\xe091\\x10i\\xf3\\xef\\x08\\xe5o)T\\x9c\\xb8PqF\\xb4|g|\\xcd5}\\x9f\\ru\\xda\\x08\\x91o\\xbc\\xf3\\x17\\xfeo\\xf1M\\x1b\\xa7\\xd9:~\\x81\\xac\\xf5\\xb7\\xda6\\x8a\\xf3\\xb3{\\x1a# \\xd2\\xca\\x05Zz\\x13j\\x1fi\\xa1\\xec;B\\xad\\x9f\\xd2\\xaeo\\x93\\xf4*R\\\\[^\\xad\\x9f\\xee\\x95\\xf76N\\xff\\xb1\\xecC\\x88\\xac\\xd7O\\xbf\\xc7U\\xe7|\\xb1\\xd6\\xe3\\xbb\\x9d\\x18\\xfd\\xc4\\xb8\\xe7\\xd6PX\\x0e~\\xc1r\\xf2J\\x8f\\xcf-.\\x87\\x95\\x1e\\xef\\x18\\xe7\\xd5\\xf1\\xaa\\xa4L:DL\\x07\\xff4?l\\xdd\\xc1\\xd7\\xdaWhR=\\x16_\\x0b\\xe5\\x9fH\\xcbw,\\xf5O\\x84|Gz\\xc3\\xb9\\x9b\\xed\\xae\\xb0x\\x8c\\xa2\\x97\\x1d\\x9d/\\x8b\\xdd\\xcfC\\xbd\\xcaR{/\\xd4\\xab\\xf8\\xfa\\xbf\\x11\\xf3q\\x01\\xff\\xb7RO\\x7f?T\\xec\\xdd\\xd6x\\x88\\xb4~\\x1b\\xb4\\xf2\\xe7k\\x8b\\x9b\"\\xd9\\xf9J\\x12\\xca\\x81t\\xc0w\\x1fv\"\\x7f\\x03ydh\\xf7\\x81\"\\xc5\\xcb|m\\xfb@\\xd1\\xe6?\\xe0\\xbb\\x0f\\xd4\\x16\\x9f\\xa51{7\\x18nB\\xa4]/\\xa1\\x95\\xa7B\\xe5\\x8b\\xa6\\xcd\\xf3c)\\x1f\\xfd\\xc2\\x0feCj\\xdbY%J4\\xc2X\\xd2vx\\x81\\xb4+\\xab\\xbdh\\xfd\\x02H\\xeb\\xb4\\xd0/@\\xa8\\xbc\\x04.\\x8b\\x0f\\x16\\xbdWj\\xe0<\\x88_[~\\x7f\\x12\\x1f\\x85\\xf6\\x90\\x0b\\xf3gL\\xbf_\\xcc\\xfd2D\\xd6z\\xaf\\xb9r\\xfe\\x11~3\\xeb\\xf6\\xc4\\xf8\"\\xc3I\\x12P\\xc0e-\\xb4#\\x91\\xe6\\xf5\\xa4\\xf8\\x12hG\\xf2\\x08\\xec=A\\xae\\xb96\\x14\"n7\\xfd\\xae\\xf8n\\x8f.\\x8e]c\\xa9=\\xc4\\xd1gD\\x90\\xff\\xa0)\\xd8\\xed\\x99\\xb7\\xfd\\xe0.\\xa1\\x1ch?`\\x95\\xff\\x00\\x8a\\xcf\\xaf}?J\\xbe\\xfau\\xa7\\x06\\x83\\xdaW\\xdcR\\xa4\\x05\\xc4\\xaf\\xcd_\\x99$\\x7fX\\xcf\\xebi\\xf7+\\x10j\\xff`\\x8f\\xe5\\x9b>\\x94\\x9c\\xb4\\xde\\x19\"\\xe4\\xa3\\xb9\\xd1\\x01\\xa4k\\xc8G\\xcd\\x1a\\x95H,\\xd5\\xec-\\xa8\\xb0\\xfe\\xf8\\xb2\\x02\\xf8\\xd9\\xe7\\xdc\\x13\\xbf\\xfcb\\xd6-\\xf8m\\\\v\\xd6\\x9d\\xec\\x83U\\xf6W\\xad\\xb2\\xbf\\x91\\x059\\x8b\\xc0_\\xcf\\xf1x\\xeb\\xcf\\x1e\\xf2\\xd9\\x95\\xd5\\xc7\\xc2>\\xfd\\xf2\\xf3\\xdfY\\xe5\\xfc{V9~\\xfcy}\\xc0_\\xfb\\xec\\xd1Y\\xd5\\x80%\\xfe]\\x9d?\\x15\\x03\\xdb\\xc2\\x1a\\xbepM\\xac\\xb2K\\xb5\\xb2\\xca\\xf1\\xc7\\xb3\\xffNV\\xb9V\\xe0g\\x9f~\\xfe\\xe9\\xbf|\\xfe/\\xff\\xee\\xf5yE\\xe1\\xff\\xf8T\\x86\\x95\\xd5\\xa7Z\\xe7,\\xce\\xca\\x1a|\\xf0\\xc5\\xd3\\xbe$\\x8c\\x1c\\xff\\xe9\\xf3?\\x97\\xe3/|j\\xe6/\\xff\\xf4\\xdf\\x9d\\xc2J\\xc2\\xe7\\xe2\\xa6\\xf9\\xbc\\xe9>\\x0e\\x03\\xf0\\xa3/Z\\x0cV\\xfb\\xef\\xfep\\x8e\\x87\\x92\\xff2\\xe8\\xb9\\xac\\xc2\\xac>Q7\\xf8M\\xce\\xe6#\\x8f\\xac\\xbfk\\xa5OM\\xfc\\xe9?}$,\\xebO\\x85\\xfe-qf}\\xe1\\xb3\\x91\\xfa\\xf9w\\xbe\\xe8\\xf8\\x8f\\xd5\\xb0\\xfa\\xecw\\xb8i\\xf1#\\xfe\\x86\\x0cq\\xe3\\x83&\\xfb\\xbcG\\xacr4(.\\xe0\\xf3/B\\n\\xcf\\xf9eX\\xa9\\xbf+\\x17~\\xf1#\\xa1\\xe6\\xb8\\xfc\\xd4KV\\xd6\\x9f\\xfd\\x83\\xcfH\\x19\\xb0\\x18\\xab\\x1c\\xff\\x960\\n\\xf1\\xb32[+J.U\\x04kC4{\\n(\\n\\xa2+\\x8dV-S\\x04k.\\xe7[\\xb1R_\\xac\\x98\\xa1X\\xb1bF\\xf4.f\\xe2\\x0e\\xc5\\xcc\\x99\\xc7b\\x915\"kF\\xd6\\x8e\\xac\\xabwp\\xd0;H\\x0c\\x0er\\xb9\\xde!T\\xef\\xa018\\x0c\\x93F\\xd6\\x8b\\xac\\x1f\\xd9 \\xf2\\xc7H\\xc7\\xc8\\x86\\xa6\\x86\\xdd|\\xdc\\xd0\\xd1\\x07\\x1d#\\x1b\\x19\\x1a5jdp\\xaa\\xe1dl\\xe2\\xd2\\xb8q\\xa4\\xb3\\xd1\\xb9q\\xe3\\xc6\\xdc\\xa1E\\xa4KdSCS\\xf4Y3C3tl\\xa5oU_\\xdf\\xaaAd\\xeb\\xc86\\x91\\xed.\\xd6v\\xd5\\xa8\\xa4bm\\x1bo\\xa9:h\\x94\\x9fT\\xa1\\x91\\xb6\\xf1\\x16i\\xb4\\xa3zI\\xd5\\x81\\x1eJu(\\xbaRk?}K\\xad\\x0c\\xc6\\xdfRK59\\xbf\\x15\\xdd\\xc1\\xd5\\xc7\\xbdsw\\xd7n\\xfa\\x0e\\x1d\\xf4\\x1d\\xdc/6\\xef B\\xdfs\\x15\\x8bGu\\x92*$Ru\\x9b\\xeeR\\x9dvTw]h :\\xf7E\\xad0\\n\\x15\\xaaQ*\\xda\\xb8\\x8cB\\xcfU\\xf8\\x85\\xab\\xb8\\xa7j.6\\xf8\\xf8\\xbb\\xec\\xefz\\xcbuj\\xda\\xef~\\xfe\\xdc&9\\xbf\\xdb\\x8c\\xfe\\xbb\\xa3|\\xa4Ar\\xe9\\xf06}\\xa5\\x9a\\xed\\x1f\\x7f\\x95\\xfdM\\xe7\\x9cO\\xcd\\xaaewe\\xe8?\\xaa%\\xf7;\\xdaZ~\\xf6]\\xf2?\\xdf\\xfe\\xf1\\xab\\x7f\\xfbw\\xe3;(\\x15\\x833/:\\x84\\xaa\\x8c\\xee\\xae~\\x1d\\xf5\\xee~\\x9b\\xdd\\xa5A2\\x85L+m\\x83N>}\\xddU\\xad\\xfdt\\xa7\\xb3B\\x92\\xe3N\\xac\\xbb4X-\\xcd|\\x0c>\\xf5Vj\\xf0\\xa9\\xafN\\xa5\\xef\\xd8G\\xef\\xd1;\\x0eQ\\x87T\\x16\\xac\\xe0Z\\xd2\\xd0\\xc9\\xbb\\xe3\\xc5f\\xd9\\xad\\xe4!\\xfd\\xdb\\xca\\xa0\\x8a+5\\x1a\\xee\\xdb9\\xfe\\xb6\\xf1\\x97\\xbe\\xde\\xbfDv\\xd6w\\xee\\xae\\xef\\xd2\\xc5\\xd0\\xa5\\x8b\\x0fz\\xfb\\x1a\\xbayu\\xd0{\\xba_l\\xe6\\xa9TJ2\\xff\\xe0\\xdf\\xb6\\xce\\xdf\\x91\\xab\\x87L\\xf1\\xdf\\x7f\\xe6\\xf2\\xb7c\\x81\\xfeg_\\x94V\\xfd\\xe3\\xcf\\x08\\xdf0t\\xf7\\xf0\\xd6w\\xefn\\xe8\\xde\\xdd\\x1b\\xbd}\\xe3\\xd1\\xd3\\xb3\\xfaI\\xa4\\x96\\xc4}F\"I9\\xc8\\x05\\xb7\\x91\\xbb44\\xee\\xb3\\xffs\\xb1\\xc1\\xdf\\x13\\xca\\xdf\\xb5\\xedEGK*\\x92\\x94\\xe3\\xcb\\x9f\\x15\\xff\\xf77P\\x85\\r^>\\x9d\\xa2\\xbc}\\xbc\\xdc{v\\xf03x\\xfbx\\x1b\\xd1\\xbbv\\xbc\\xb7R.R\\xcb\\xb4\\xe1h\\xb8\\x04\\xc7\\x7f\\xfe\\x9cO\\x17>Ry\\xb2\\xb7N!\\xd6\\xfa\\xca$R\\xae\\xecQ\\x99W\\x99\\xf7\\xdc\\xd4\\xe2!\\xc4\\x9b=tJ\\xedg7;+d\\xe4_\\xe6\\xbc\\xc9\\xfdr\\xf5\\xa7\\xcb\\x0e\\xca\\xd0\\xd0\\xcf.\\xddE\\x9a\\x90\\xcf.QS\\xc9\\xf4>n\\x06\\x1f7\\x1f\\xf4\\xf65\\xfaxy\\xf9\\xe9}\\xbc\\r\\xbe}=\\x8d~\\x9d=;\\xea\\xfd\\xbc6\\x11\\xa8h\\x13\\xa1u\\xf5=\\x7f\\xd1\\xf7r3\\xf4rsG\\xefN\\xe8\\xdd\\x1d\\xbd\\xbd\\xd1\\xbb_\\xfc\\xe7_\\xfbt\\xd1Y\\x11\\x94y\\x91\\xf9\\x87<\\x95\\x12Cow?}ooCo\\x1f7}\\x9f>\\x06\\x7f_o}@@\\xa4\\xc8(\\n\\x94K\\r\"\\xb1\\xdc$\\x12+CU\\x06\\x91D\\x12%\\x92\\x0c\\x13)\\xc4\\xd2\\xe8l\\x94\\x98\\xd0\\x89XnFG\\x99X\\xcaA\\xa8\\x12}\\x16\\xa4\\x95\\xaaM\\xa2`\\xa9Bk\\x10\\xc9\\xe5F\\x91\\\\\\xa3\\x8c\\x13\\xc9\\xd1\\x87\\n\\x91V6L\\xaa\\x17\\x85\\x1aE\\xe8\\x8b\\x06Q\\xa8*\\x1a\\xbd[+\\x025*\\xbdHa\\x10)$f\\xf4vR\\xaa\\xa3\\x10\\xa8\\x952T\\xa0B\\xa9\\r\\x91\\xaa\\xd1\\xadpt+<D\\x19\\x16\\'R\\xa9\\xe421z\\x92R\\x11\\xff\\xd9\\xb9\\xc6\\x84.\\x94\\x9ahtT+E\\xe2\\x90x\\x91Z\\x1c\\x82\\xb8\\x90X\\xabS\\xa3j\\xa8\\xa5&D;\\x1a\\xf4\\'\\xb9\\xa3\\x06\\x81R\\x87\\xe8\\x8c\\x13A\\xe8-\\xd3heb\\xbd\\x08=C\\x83:\\x18\\x1d\\xb5j\\xa5^\\xa45\\x8a\\xb4ZT\\xb6nx\\x14z\\xabD\\x1a\\x8d!P$\\xd1\\x07J\\xa3\\x03\\xa5\\xc12\\x85B\\xaa\\x8e\\n\\x94r?\\xd0\\x98\\x03\\xa5ZT?C\\xa0,\\xd8\\x8c\\xde\\xc1RuL\\xa0L\\xa1\\x14\\xeb\\x10\\xc1\\xc6~<\\xd3\\x18\\x03ej\\x89\\x89;hL\\x81r\\x91x\\x889\\x10\\x8dHu\\xb8)P\\xa9\\xd0\\xa1\\xbbJ%\\xfaD\\xa9\\x0b\\x0e\\xd1\\x9a\\x02\\xd5R\\x11\\xba\\xe0\\x8e\\xe8\\xbb:\\x99\\\\b\\x0e\\xd4)\\x86pEf\\x02\\xfa+:-\\xfaH\\xabU*\\xa2\\xb2\\x80\\xfb(\\x1c}\\x14\\x8eF\\x93>0\\\\/\\x16\\x99\\xc5\\xa2P\\xa9Z\\x14\\x95\\x05\\x1a\\x83X\\xa40\\xa17j8\\xb1H%\\n\\x94\\xc9eZ\\x99T\\x13\\xfb\\xf1\"\\x1c}S\\xc5\\xb5WL\\x16\\xa2\\x07\\xa1G\\xa8\\xd1\\xbf3\\x8a\\x91\\x88@\\xbf\\xd7\\xa2\\x13\\xad\\x06=D\\x87\\x9a2\\xf3\\xa8\\xd1\\x8b\\xc5&1G!fq\\x88H\\x11,\\x8d\\xce\\x04\\xf4S\\x938D*REe\\x1e\\x11A \\x94\\xaa\\xcd\\x99G\\xf4\\x00\\xb9R#5\\x89\\x95r\\xd4\\xd7\\x99G\\xa9\\xc4\\x9c\\x89\\x1a#z\\x14w\\'\\x14\\xb5*:\\x86*\\x15q\\xdc\\xc3\\x95\\x1a\\x19\\xd7\\xcb\\xd1\\x99\\xe7\\xa8\\xe7\\xd0\\xd7\\x14\\x83\\xd1OQ/\\x88\\xb51\\xd9(\\x95\\xa0\\xfb\\n\\xaeG\\xd4\\xb1\\xf8D*\\xe1\\xeejE2E\\xd6\\x87Yg\\x1a\\xee\\x8bZ\\x99B\\'\\x8d\\xc1\\'\\x12\\xeei\\xa8\\xdf\\xe5\\xd1\\xd9\\x88\\xfe%\\xfa_r\\xf4\\xb1Z\\x8d\\x1e\\x8eJ\\xd4h\\xd1G:\\xb9\\xc4$V#\"\\x8f\\x12\\xa3\\xbeCD\\x1e\\x93\\x8d\\xf2p\\xa3D\\xa4\\x1eb\\x96dR\\xb9Y\"\\x15s7%R\\tG\\xa1R\\x89A\"U\\xa1\\x0fUH\\x96\\xc5d\\x01\\xd7\\xbc\\x88x\\x90\\xa8\\x8b\\xce\\x02DA\\x12\\xa9\\x16}\\x86\\xfe\\xa4<*\\x0b4\\x06\\x89\\x0c\\xfd@\\x16\\x14$\\xe5\\n\\x89\\x96 Z\\xe5\\xc6\\x9e^\\xa24J\\x94\\x81\\x83\\x8d\\x12\\xb5(,\\x8a;\\xa0\\xc7\\xa1\\x0b\\xa5*F\\x82\\xb8\\xaa*D\\xa9\\x90\\xc6~<\\xd3DIEj\\xb9\\x0cu\\x03\\x87\\xe1F\\xa9$Xj\\xe2\\x0e\\xe8\\x86\\x04\\xb5\\xac\"8F*\\xd1e\\x8d\\xa4hi\\xa8J\\xae\\x0cG\\x7f\\x06\\xfdG\\x13\\'z\\xb9\\xe3`e\\xb8Y\\xaa\\xe0\\x883V\\xca)v24\\xb4\\xc3\\xa3\\xa4\\x1aDx2\\x91A\\xaa\\x15\\x9b\\xa5:T\\xb8\\xd4,E#\\x05U1\\x0b\\xd0\\x83c\\xd1\\x19\\xe2zR\\xf4\\x9f\\xe3\\xb3NCQ=Dr#\\xba\\x90G\\xa3\\x83R\\x83(\\x8e\\xfb\\x16\\xe2l\\x9a\\xcc\\xf2\\xc3\\xa5\\xc1r4\\xdab\\xf1\\x89T\\x13\\x1d$\\nE\\x14*R\\x9b3O\\xc2\\rA\"\\xb51\\x08\\x8dS3w@\\xd5\\n\\x12\\xe9\\x14\\xa2\\xa8 \\xa9\\x88#\\xdf\\xe8lD?\\x93J%\\x81h\\xa0\\x19\\xd1\\x89\\xdc\\xc4\\x1d4\\x86 i\\x981H&\\x97\\x9b\\xb9\\x03\\xa2;\\x04\\xa121\\xfa\\x08\\xf1\\x83 \\x99\\xd6\\x14\\x84\\x8a\\x0cAG\\xa5Zd\\nB#\\x17=\\x85;rm\\x14\\xa4TjUhXh\\rAJ\\xf4W\\x107\\x15\\xa1\\xa7r\\xf4h\\x0e\\xe2\\xaa(\\x89\\xca\\x02\\x8d1H\\xad\\x0c\\x8d\\x0e\\xd2\\r\\x96qO\\x8f\\xe2N\\xb4\\x1a]d\\xb0!X\\xaa5\\x06s\\xe4\\x81\\x0e\\xdc\\x18\\xc9\\xac_Tv-\\xf5\\xc1\\xca\\xa8`\\xa5D\\x83\\x9e`\\x0cF\\xb2\\xdf\\x8c\\x0e\\xc1\\x88\\t\\x07+\\xb5Q\\xc1j\\x91*D&\\x8e\\xc9F\\x91<:\\xfbLc\\x0cV\\xcbT&\\xee\\xa01\\x84\\x88$\\xc6\\x10\\x8e\\x8f\\x86 >(U\\xc4d\\x01W\\x10w\\x16\\x8e\\xee\\xa9\\xb9/\\x0c\\x93\\x1aC\\xa4\\x88\\x8e\\xd1A\\xae4 \\x06\\x8b.\\xd5\\xe83Yp\\x88\\x99; 6\\x13\\x82\\xe8L\\xa9\\x0e7 \\x1ej\\nQ\\x06\\x06\\xa2\\xdf*\\x11\\x13\\xca$&-:G=\\x8d\\x0e\\xe8\\xc9\\x06\\xc4\\x94#eF4\\xd6DzY\\x90^\\xa6\\x88\\x95)Db4&\\x10\\xd1\\xc7\\xcb\\x14h0\\xa1\\x8a\\xca8\\xd2E\\r\\xacC\\x9c5\\xdc,C\\x82L\\xac\\x8d\\xca\\x02\\r\\xfa\\x9c\\x93\\r\\xa8a\\xd0\\xc9`ts\\x18*A/\\xd3\\x98d\\x1a\\x8dNj\\xce<j\\xf42\\xadq0\\xfa\\xb5q\\x88T\\xaa2\\x0eQ(\\xc3L\\xdcAa\\x92#\\x82\\xce<\\x0e\\x93FqGn\\x14\\xa0\\xe9\\x93\\xc6\\xc4\\x1d\\xa4\\xe6\\xcc\\xa3\\x06}\\xa2A\\x9f\\xa0\\x9ai\\x8dr\\xd9\\x10\\xa9\\x89;H\\xcc\\xe8\\xc8\\x11\\xa8\\\\\\x16*\\xd3f\\x92~\\xdc\\xa7SMT\\xe6\\xb9T\\x82~\\xa0\\xe0~\\x80\\xeam\\xe6\\x8e:\\x15\\x02\\xadV.E7\\xb82\\x95bn$Ds\\xc8\\xfd.\\x06\\x9f\\xa0B\\x95\\xdc\\x7fAL=\\x8a;d\\xfe1\\xe50\\xf4(t@e\\xa3#\\xa2c\\xb92\\xcc\\x10\\xda\\xacql\\xa8H\\x8c(\\x06\\x8dE\\x911T4Dj\\x0e\\x15)th\\x8c \\x08G\\x07\\xc4U\\xb8\\x03\\xe2\\r\\xa1\"N\\xd0\\x98BE\\xe1\\x81R}(\\xfa\\x1e\\xfa\\x89.46T\\xa6V+\\xd5\\\\-\\x8d\\xa1\\xa8\\xc1\\xf4\\xa1C\\xa2\\x91\\x84E\\xc4\\x87J\\xca<\\tG\\xc0\\x8d\\xbb\\xa8,@_C\\xbc\\r\\x1d\\xd0\\x08\\xe2\\x0e\\x88%\\x84\\xa2?\\x84\\xce3\\x1b0T\\'\\x0e1\\x85\\xea$\\x92\\xf0\\xe8P\\x9d\\\\+S\\xc9Qa\\xe8\\x11\\xe1\\x1a\\xa9<\\xc8\\xa0p\\xd0\\x9a\\x15\\x99\\x03\\xcc\\xa8@\\xe3\\xcb\\xcc\\x1d\\x10\\x8f\\xe0@cPH\\x83\\xd1\\xd90\\xc4=\\x14h\\x9c)P\\xe1z\\x85\\xd2\\xa4P\"\\xa9k@\\xc2<\\x06\\xbd\\x11\\xf5r\\xaa\\x05\\xea\\xbeh\\x85*[iPht\\x81\\x83c2\\x8f\\x9c\\xa05+t\\x88\\xf5K\\xcc\\x88\\xc1q\\x94\\x92\\x05\\x1a\\xbd2H\\xaf\\x0c1*\\x87\\x88\\xc2\\xf5J\\x85\\x01\\x91\\xa2\\x91#G\\xb3R\\xc1u\\x8c\\x11\\xd1\\xa4\\x02\\x1d\\xd4\\x92h\\xa5J\\x8b:o\\x84\\xd4\\xcc\\x9d(\\x15z\\xa5\\xda\\xa4T#a\\x10\\x9dy\\xe4\\x86C\\x96Z\\xa1\\xd4i\\x8dJ\\xee\\xbfr\\x94\\x84\\xdeR\\x89^\\xd5(Z\\x85DD&KT\\x89\\x10\\x11\\x8b\\x86\\xcb4Q\\xe8L\\x8b\\xd8\\xb3I\\x95)\\xe8TR%j\\x91(\\xc4\\xcb\\x828\\xe9\\x93\\x8d\\x88\\x1d\\xa234\\xce4\\xd1\\xaaL\\x8d\\x18\\xf1\\x86L\\xe6k\\xceb\\xc1\\xdc\\x85V\\x19\\x9by\\xcc\\x1c\\xbbq\\x9fN5\\x9f\\x9d\\x87\\x9b3\\xcf51Y\\x80FY4\\xfaP\\xc3\\x8d\\xf9(\\x95,S\\x9f\\x89\\xceF\\xf4L\\xd9p\\xa9\\xdc\\xa8\\x92\\x8b\\x14f\\xf4\\x97\\x90\\x90F\\xe7H\\x95P\\xa1\\x163\\xa9\\x94\\xa8\\x1e\\xe8T\\x83\\xfe\\x10:\\xc8P\\xa3sWZ3w@\\x02\\t1\\\\3z#\\xc1bD\\xa0\\xe2\\xce\\xb5\\xda\\xf0h\\x04\\xc3dJ\\x9d\\x06\\xddWF\\xa17\\xfaYht6j\\xb8\\x0f\\x90\\xa0\\xd0Fgc\\xe6\\x07\\xc3\\xd0\\xe0\\x8f\\xceF\\xee\\xb1Z\\x93\\x8a\\xd3x\\xa3\\x86\"\\x12FZE4B\\x85\\x96\\xeb\\xe5\\xa1:4\\xa2LjNM0!\\xd5F\\x1cbDGI\\x14w@\\xed\\xcd\\xa1\\x1c\\xf5Zt6J\\xcc\\xdc\\x89<\\x1c\\x81\\x04\\t\\xa9X57\\xc1\\x16g\\x8e\\xd3O\\xa7\\x1at7\\x18q\\xb5\\x98,\\xc8zL0\\xa7n\\xa1\\x12\\xe4b9z\\x98F\\xca\\xe9\\x82\\xe8\\xe7\\x1a\\xa5\\\\\\xc7\\xfd\\xc6\\xc01L5\\x1a\\xbdjs\\xe6Qc\\xd0\\x88$\\xd1\\x1a\\xd10\\xa4\\xb4\\xaa\\xc3\\xa35Hp#5Q\\x19\\x83O4&\\xeeLj\\xce<\\xa2/K\\xa5F\\xf4\\x0e5s\\x07\\xa4_\\xa0A\\x91\\xf5_\\xa24\\xa8\\x01\\xd1?\\x88\\xceFM\\x8c\\x061\\\\\\x95\\x82\\x1b\\x96\\x9a\\x10\\x99\\xca\\xc8u&w\\xd0\\x9a\\xb8\\x83\\xc6\\x8c\\x8e\\x9c:\\x81d\\x0bR\\x9f9\\t\\x83zH\\xc3\\xb5\\x80\\x86\\xe3Urm\\xb8Q\\x83\\x18\\x84I\\x83\\xc4\\x8c<*\\xf3\\x88\\x94\\x18\\x84jm&I\\xc5}:\\xd5\\xe85J\\xa3\\x06\\x8d\\xed\\x18\\xee\\xa0\\r\\xe1F\\xb1F\\x89z\\x02i\\x0bjmT\\xe6\\x11\\x8dQN\\xcf\\x1db\\xe28;*\\x8f;r\\x1f\\xe9$\\xe1Q\\xdc\\xc0\\xe3\\x94\\x1c\\r\\x1a\\xf9\\xb1\\x1a\\x1dRa5\\x99\\r\\xfd\\xe9\\x14\\xfd[\\x1d\\xd2\\xad\\xd1\\xb3t\\xea \\x11\\x9a\\x04d#j\\x9c0)\\xe2L\\x9a0\\x99V\\x1c\\x12\\xa9\\xd5k]\\xf4\\xda\\xa6F-\\xe2b&\\xee\\xa00\\xa3#7\\x9a\\x90.\\x1e\\xa2\\xe0\\xa8\\xd8\\xa8EO4s\\x07\\xc4]\\xb5\\xd2\\xe1Z\\x93\\x16\\xc9\\xac!\\xd1\\x99\\xc7 \\x1d\\xba\\x1f\"\\xd2\\x1a\\xd0\\x00E\\'\\xd2P\\x936S6\\xa1c8: \\xb1\\xa0\\rA\\xbac\\x14:r\\x8art6j\\xcc\\xda\\x90LZB\\xc0}`D\\x0c@j\\xd6r\\xa2\\x05\\x95!\\x97\\xa8\\xf5Z\\xa5I\\xab\\x94\\x88\\xc2\\rZ\\xa5\\xd2\\x88\\xde\\xf2h\\xad\\x1a\\rt\\x8e\\x19h\\xd5\\x1c\\x9fDG\\x15\\x9a\\x95p\\x02\\n\\xbd\\xb9\\xcfu\\x88\\r\\xc8\\xf5:\\x95\\x01\\xe9\\xb9F\\xf4\\x96D\\xe94\\xbaL\\xbdg\\x18\"\\x0b\\xa96\\x0b\\xd1P\\x89\\xe2\\x88\\x88S]\\xb2QcD\\'\\xe1\\xe6a2\\xee\"*\\x0b4\\xc60n6\\x14\\x86\\x86\\x82!\\x0cM5\\xc2\\x90|T\\x9b\\xc3\\xa4\\x99B)L\\xca\\xddB\\x8c\\xd9\\x18\\x16\"U\\x98\\xc2\\x90\\\\\\x0f\\xe1\\x8e\\x88M\\x86\\x85(\\xa3\\xd0\\x9bc\\xa9\\xc60\\xa4\\xb1Dq\\x07\\xae{Q{\\x87Dq\\x07\\x8e\\x8b\\x85)\\xd5Cb\\xb9C\\xd6\\xc4&\\xee\\xd3\\xa9\\xc6\\xcc\\x9d\\xa3\\x8e\\x0e\\xcb\\xa4\\xb504U\\x0e6\\r\\xe7\\xf8\\x981\\x1c\\r\\x0c\\x13w\\xd0\\x18\\xc2\\x95:\\xe3\\x08\\xa52\\xd4ps||\\xa6\\x8e?g\\x1c\\xa7\\x08\\x05k\\xe6\\xfc\\x9a\\x10\"\\xd2\\xf8\\xa3I\\x07\\'n\\xfd\\xb3V\\x84v\\xc5!T\\xf8\\x07\\xa3\\x02T\\x9a9{\\xacg\\xff\\x1f|\\xb3hE'", "year": "2021"}, {"Unnamed: 0": 191834, "autor": "Saeedbest", "date": 1626406053000, "content": "Photographer scouting his location | X-T10 + 56mm 1.2", "link": "https://www.reddit.com/r/fujifilm/comments/ol8ktj/photographer_scouting_his_location_xt10_56mm_12/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "photographer scouting his -----> location !!!  | x-t10 + 56mm 1.2", "sortedWord": "None", "identifyer": 84628, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\x96\\x07\\xf9\\x9dY\\xef\\xfc\\xe2w%\\xa0\\xd31\\x0c\\x10\\xb0I\\xe5\\x84\\xfbj\\xbb\\xc2+k\\x19!|&\\x06T\\xc0\\x88F\\xc3\\x80\\xfe\\x81{\\xbf\\x94L\\xb6\\xcf\\x81\\xf1]\\xce]\\xbcV\\xed\\xa3\\x95\\x0c\\xa3_:\\xa4\\x1a\\xdd\\x9f\\xe3i\\x9e\\x02\\x95\\x9f\\xf0\\xa6\\xde\\xd7\\xc2\\xc5K\\xd4\\xe7B\\xed\\xfb%G\\x9e\\x14\\xa2\\xdb\\x03\\x03\\xff\\xa1\\x00\\xceW\\x8b\\xbe\\xe0Pu\\xfd\\x02\\x8c\\xff\\xcb\\xa9\\xf5\\xbc\\x91\\xd4;\\x15t:\\x1e*\\xef\\x11pN\\xf9Db\\x92\\xc5\\x0e\\x02\\xfeA\\xb7\\xe7\\xe6\\xaa\\xecO=K\\xf2ta\\xfc\\xcee!\\x86\\xeb{|\\xac\\xd1i\\xf4p[\\x80\\xc3\\x9e\\x7f\\xffQ\\x01\\xaepk;\\xf8\\xd6\\xef\\xde\\x027it\\x9aX{\\xfe\\x12i\\xcf\\xb9k\\xf2:g7\\xc5\\xceB\\xa7a\\xf6T\\xfb\\xc8J\\xb0\\x06\\xde\\xe7\\xc2e\\xcf\\x1f\\x1c\\xf6pWL3c\\xdb\\xc5!\\t\\xe3o\\xdd8k\\xaa\\x18\\x03{=:M\\xac\\x7f~\\x13\\xe9\\x9f\\xbb[\\xc4\\xfe\\xdcNh\\x97@\\xa7C\\xa0\\xf27\\xd7\\xb1\\x1c\\xe98^9i\\r\\x0e{~\\xe1\\xb0\\'\\xfd\\xbf\\xb4\\xec\\xc2KJ\\xc50\\xbeGB\\xe1\\xef\\xaan\\xb7}\\xe8t$T^K7.\\xc9Q\\xf9\\xe6\\xe7\\xe98\\xec\\xf9\\x8f\\xcb?+\\xec=\\xe3|o\\xaa\\xc1\\xf8gW\\xde\\xab\\xd9\\xa1\\xf3\\x84\\x19\\x9d\\x8e\\x85\\xca\\xc7(\\x08\\xefx]\\xf3\\xb9$b\\xc5\\xe5M\\x8f\\x8b\\xd57\\x11\\x9b\\xae\\xb7q\\xca\\xcfn\\xddn,\\x06\\xe3?\\x8a\\x89\\xefN\\x8b\\xee\\x89A\\xa7\\xd1\\xed\\x99EbzC\\xb7GLk\\xce\\xfc\\x7f\\x15j\\xfe\\xe84\\xb1\\xfe\\xc1\\x15n\\xe8\\xf6,+.HLN->\\xc2\\xc3\\x08\\x02\\xc0p`\\x04\\x06\\xc5\\xf2\\x9c\\xd4\\xbc\\xf4\\x92\\x8c\\xe2#,<@%\\xcb\\x8bK\\x8a2\\xf3\\xd2\\x8b\\xef0\\xa8,X\\xa8\\xbdPw\\xb1\\xa1\\x9e\\xd1\"S\\xb3\\x9b*\\x8e\\xc5\\x05\\xa9\\xc9%\\xb6\\x01E\\xf9\\xe95!\\xc0\\xe22\\x15\\xc8L-\\xae\\tK-Jr\\xcb/\\xca\\xb5\\rH,*Y\\xe4\\xec\\xbc\\xc8\\xd9e\\x8ds~^VHeA\\xaa\\xadsn\\xc1*\\x97\\xd4\\xf4\\xa2T\\xa0\\xe2\\xfc\\xe2\\x9bf\\xee\\xa9y)\\xa9E\\xb6\\xbe\\x89\\xc5\\xc95~\\xa5\\xb9I@v0\\xd0\\xb2\\x9a\\x00`1\\x9d\\x9fgk\\\\\\x03TUl\\x1b\\t4\\x16hM\\x1e\\xd8\\x88\\x80\\xa2\\xe2E^^\\x8b\\xfc\\xfc\\x16\\xfb\\xf9\\x05\\xaf\\x01j\\x82\\x18\\x9cX\\x94\\xb2\\x1ajB@Ni\\xd1j$\\xd3\\x96\\x04\\x04\\x05\\xa8,\\t\\xf2\\xf7\\x0fY\\x1c\\xe6\\xe4\\xbe(9yI2\\xd0=KR\\xf2\\x93\\xb2\\x16gd\\x16\\xaf\\xc8\\xc9ON,\\x01V\\n\\x8brsW\\xe4\\x15$\\xa6\\x94\\xe5\\xe6\\xa7,\\xcd+.M\\xcaZ\\x96W\\x9a\\x0b\\xe4\\xac)\\xc8\\xc8/\\xc9O/J,\\xc8H-ZR\\x00t\\xd2\\xd2\\xe2\\xe4\\xfc\\xd2\\x92\\x15`\\x12h\\xc3\\xe2\\x12C\\x83\\x85\\x15\\x0bk\\x96\\x00\\r*\\x9e\\xd8\\xb04-\\'1\\xbdxb\\xe3\\xa6\\x8c\\xc4\\xe2\\xf8\\xd2\\xbc\\xec\\xbc\\xfc\\xf2\\xbcxHH\\x1fZ\\r\\xa4\\xf3\\xe2\\xd3\\x8b\\xf2K\\x0b\\x8a\\'\\x1ea\\x9c\\x00\\x00:\\xe0Kf'", "year": "2021"}, {"Unnamed: 0": 191994, "autor": "romiloff", "date": 1627547131000, "content": "Shoot with fujixt4 and 16-80 mm lens. Location is beach Karadere, Bulgaria.", "link": "https://www.reddit.com/r/fujifilm/comments/ottf33/shoot_with_fujixt4_and_1680_mm_lens_location_is/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shoot with fujixt4 and 16-80 mm lens. -----> location !!!  is beach karadere, bulgaria.", "sortedWord": "None", "identifyer": 84797, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\xb6\\x17\\x8dO\\x0cxBuE\\xe4\\xd0\\xe9\\x14\\x06\\x08\\x88\\xdb^yI\\xfe\\xa6\\xc0Q\\x9f\\x0b\\xb5\\xef\\x97\\x1cyR\\xc8\\xc4\\x80\\x1d0\\xa2\\xf1/\\xb8\\x05\\xe5|\\xfcUn\\x01\\xe3\\xe7\\x155,\\xb1\\xb94\\x7f-:\\x1d\\n\\x95\\x97O\\x8b{k\\x94\\xf4Np7\\xd4 t{\\xfe\\xa3\\x01\\x98\\xf8\\t4\\x8b\\x03\\x8c\\xe6l\\xe0\\x8b\\x14\\x17G\\xa7c\\xa0\\xf2\\x9bTN\\xb8\\xaf\\xb6+\\xbc\\xb2\\x9dD{\\xf4\\x0f\\xdc\\xfb\\xa5d\\xb2}\\x0e\\x8c\\x7f\\xd5\\xfd\\x8ez\\x8f\\xeeFyt:\\x12*\\xaf\\xa5\\x1b\\x97\\xe4\\xa8|\\xf3\\xf3tR\\xedYa\\xef\\x19\\xe7{S\\r\\xc6w^\\xfa\\xcb\\xee\\xc0\\x95D+t:\\x16*\\x1f\\xa3 \\xbc\\xe3u\\xcd\\xe7\\x92\\x88\\x15\\x977=.V\\xdf\\xc4\\x0c\\x15\\xef\\x85\\xda\\xcb\\x8cf\\x1f\\xcc\\xdcm\\x9c\\xf2\\xb3[\\xb7\\x1b\\x8b\\xc1\\xf8[7\\xce\\x9a*\\xc6\\xc0^\\x8fN\\'C\\xe5a\\xf4^\\xa8\\xb9\\xb0`\\xefE\\xe3\\x13\\x8a\\x9f\\xe5w\\xc5\\x1e\\xba\\xa7H\\x1fE\\xa7\\xd1\\xfd\\xb3\\x1b\\x87=\\xffp\\x84\\x1b\\xba\\x7f\\x1e\\xc5\\xc4w\\xa7E\\xf7\\xc4\\xa0\\xd3\\xe8\\xe9`\\x16\\x0e{~\\x13\\x99\\x0e\\xbc\\'\\t\\xde8\\xa9q\\x98\\x17\\x9d&6\\xbd\\xfd$\\xd2\\x9eE\\x87\\xd6\\xf8\\xbc\\xb9Y\\xbf\\x1e\\x9dND\\x93\\xdf\\x8b\\xc3\\x9e\\xef8\\xec\\xd1\\t\\xaaJ\\x8b\\x8f\\xeb\\x80\\x05?C\\xe7\\xb2\\x10\\xc3\\xf5=>\\xd6\\xe84\\xba\\x7f\\xd6\\xe2\\xb0\\x87\\x11\\x8d\\xc6\\xe5\\x1f\\xa7\\x1do\\xc4S\\xca\"\\xf4a\\xf4\\xb7\\xfbK\\xe5\\xd6\\x18\\x88M\\x08\\x87\\xca\\x0b\\xfd\\x15Zy\\'\\xdc\\xf3 \\xa1r\\x07\\xdd?1\\xd7\\xbf\\x04D\\xbf\\xf9\\x14\\x01\\xe3/W\\x8fj\\xbb\\xfb\\xc5\\xef0:\\x8d\\xee\\x9f`ou\\xa5o\\xfbV\\'\\xc2\\xf2K\\x03\\x81t\\x8d\\xee\\x9f\\xf8\\xf7GgH\\tY\\xb3\\xa0\\xd3\\tPyA\\xab\\xeb\\x07\\x1e7\\x1b\\xde\\x9e\\x82fn\\x03\\x81t\\x8dn\\xcfN1\\xa9\\xee\\xde\\xb7\\x7f\\x94\\xd1\\xe9D4y\\\\\\xe9\\x00W\\xb9\\xf3\\x9ey\\xca\\xfa\\x0b|\\xd5\\x97a\\xfc\\xb5\\xaf\\x96\\x98\\x85\\x18\\xdc\\rA\\xa7\\xd1\\xfd3\\x19\\xad\\x9c!\\xd5?\\x94\\xa6k\\\\\\xf9\\x14=]/+.HLN->\"\\xc8\\x08\\x04\\xc0\\xe0gd\\x003\\x80\\xcc\\xe59\\xa9y\\xe9%\\x19\\xc5GX\\x04\\x81\\xea\\x96\\x17\\x97\\x14e\\xe6\\xa5\\x17\\xdfa\\xd0[\\xb0Pg\\xa1\\xeeB\\xbdE\\x86f\\x8b,\\x0cV8;\\x06\\xb9x\\xfa9\\xfa,rv^\\xe4\\xec\\xb2\\xc69?/+\\xa4\\xb2 \\xd5\\xd69\\xb7`\\xb1{\\x80\\xeb\"O\\xbf\\x9b\\xa6\\xbe\\xf9\\xf9)\\xb6\\x9ey)5~\\xa5\\xb9I\\xa9E\\xb6\\xc1@\\x93j\\x02\\x80\\x15r~\\x9e\\xadqM\\x08\\xb0\\xc6M\\xb5\\r(J-\\xae\\tK-Jr\\xcb/\\xca\\xb5u\\xcb\\xcc[\\xe4\\xe7\\xb7\\xd8\\xcf/`\\rP\\x0f\\xc4\\xc0\\xc4\\xa2\\x94\\xd5H\\x06\\xac\\x0b(\\xcdK.\\x81H\\xe5\\xe7\\xe6\"q\\x81&g.\\t\\xf2\\xf7\\x0fY\\x1c\\x1c\\xe9\\xbb(\\xcciq\\x98S\\xd4\\x1a\\xb8\\xd1\\x9eyi\\x8b\\x13\\xf3R\\x96&\\x16\\x14\\xe4\\x17/\\x015\\x05\\x16%\\xa5.MJML\\xceX\\x91T\\x9a\\x93\\x9eX\\x94\\x99\\xb8(9yEr~nA~i^\\xca\\x92d\\xa0\\x97\\x96\\xa7\\x95feV\\x94\\x98,\\xca,^\\x91\\x9dX\\x94\\x98\\x92Z\\x94\\xba\\x04\\x18@\\xc5+r\\xf2\\x93\\x13K\\x80\\r\\x8bE\\xb9\\xb9K\\xf3\\x8aK\\x93\\xb2\\x96\\xe5\\x95\\xe6\\xe6\\xe6\\xa7,)\\xc8O\\xcaZRP\\x94Z\\xb0\\xb4\\x00\\xe4\\xb2\\xa5\\xc5\\x19\\xf9\\xf9%K\\xca3K2\\x96\\x00u\\x14OlX\\x9a\\x96\\x93\\x98^<\\xb1qSFbq|i^v^~y^<$:\\x0e\\xad\\x06\\xd2y\\xf1\\xe9E\\xf9\\xa5\\x05\\xc5\\x13\\x8f0N\\x00\\x00wg\\xf9n'", "year": "2021"}, {"Unnamed: 0": 192313, "autor": "UpstairsEconomics836", "date": 1619748359000, "content": "X-T30 - best lens for Travel. Landscape photos (oceans, mountain, sunset, sunrise, etc) /!/ Looking for a lens that would take sharp landscape images in varying light. Also have the option of taking photos of my significant other at the locations we travel to. So having sharp images of her and the landscape is ideal.\n\nCurrently have the 18-55 that came with the camera. Thank you!", "link": "https://www.reddit.com/r/fujifilm/comments/n1jz1c/xt30_best_lens_for_travel_landscape_photos_oceans/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "x-t30 - best lens for travel. landscape photos (oceans, mountain, sunset, sunrise, etc) /!/ looking for a lens that would take sharp landscape images in varying light. also have the option of taking photos of my significant other at the -----> locations !!!  we travel to. so having sharp images of her and the landscape is ideal.\n\ncurrently have the 18-55 that came with the camera. thank you!", "sortedWord": "None", "identifyer": 85131, "doc": "b'x\\x9c\\xd5Y\\tX\\x13g\\x1a\\x0e^U\\xac\\x8a\\xba\\xe2E\\xc5[KU\\xb0\\x8a\\xa5[Y\\xcbQ1\\x9c\\x91 \\x8a\\x078$\\x93C\\x93\\x99tf\\x02\"\\xb1\\xd4Z\\\\\\xed\\xaa\\x8bZ\\xe9#\\xd6j&\\x07X\\xa2\\xac\\xb8\\x02^(.x\\xed\\xe2\"x\\xb1\\xde\\xac\\xb6\\xee.\\xa8\\xd5\\xaeW\\xd5\\xee\\x1f\\xcc\\x8f\\xfa=\\xceC\\xf2\\xc0\\xc3\\xb3\\x0eO\\xfew\\xde|\\x93\\xff\\x9b\\xef\\xfb\\xff\\xef\\x98aen\\n\\xc9\\xb0j\\x9a2\\xf9\\x8d\\x1bo!8\\x8ea7\\x07\\x85\\x88\\xc3#\"\\xa3\\xa2c$\\x95n\\xe5\\x95n\\x15\\x95nG\\xac\\x1c\\xbd\\x90\\xa4\\xd8\\x8a!%\\'\\xcfz\\x8f\\xa9,\\x9c\\x97\\x03\\x91\\x14=?\\x82\\x8dU_zU\\xa8nDV-\\xb9m.\\xbf\\xfei;\\xd1\\xeb\\x0f7\\xc0\\x15\\xcb\\x0f\\xaa\\xffX\\xb8x\\x0e\\xe6\\xbbw\\xe6l\\xf0\\x14\\xbd\\x95\\x01q\\xaeC^8\\xfcXX\\xfe\\xef>=}\\xc01\\x11\\xd4\\xf3+8\\xf0\\xf7\\xbe\\x87.?\\x1e:\\xb1\\xf8[\\xcc\\xad\\xd3\\x98\\xbe\\xc6\\x07\\xeaz\\x88P\\x8fM@\\x0f\\xe6\\xcd\\xe9\\x11\\xb2\\x87p\\xc8\\x9f\\xae>{\\xa2r\\xa0\\x88\\x11\\xb2\\x07\\xfb\\x0b\\xea\\xa9\\xde>\\xee\\xe0\\xd7++wc\\x9e\\xf0\\xccmC\\x82\\xef\\x81x\\x8c\\x17\\x0e\\x95\\xd5hN\\x85\\xc4\\xc49\\xe4dI\\xa1\\xc4\\xab\\xfe\\xc0\\xdf\\xd6\\xb9\\xa8g\\xf5\\xd9\\xb9\\xa9\\xe1WK\\xdd1\\x8fX\\xd7\\xf3\\xfc\\xf1\\xd1\\x7f\\xe9\\x06\\x11\\xfam\\xab\\x80\\x9e\\'N\\xaeO\\x86E{\\xfdR\\xa7\\xac\\xcb\\x10g8\\xe4\\xde\\x8a\\xc4\\x86\\xf7\\x93o\\xf5\\xdc\\xe7\\xe2>8\\x066`\\xf8\\xb3\\x87\\x83\\xce\\xed\\xf4^\\x02\\x11\\xdaS\\xdc\\xc2\\xfd\\xc6\\x1f\\xb6E\\xd6\\xd7f\\x14@$\\x80\\\\h\\x1f<\\x14\\xd03&v\\xb1\")q\\xc5\\xbc&{\\xbc\\xf4=\\xc4\\xe1\\xcb\\xc2!B{\\xa4\\x11\\xa3\\x86\\xde/\\xcd\\'\\x84\\xf6\\x01\\x8cShO\\x91a\\xcb\\xae\\xea\\xe1e}0.\\xe8\\xecU\\xf3I\\xef\\xd36\\xac\\'=\\xf2\\x9d~\\x1d\\xa7_q\\xdf.`O7\\xe0?\\xfc}\\xd7E\\xd9\\x93:\\xed\\xed\\xdc\\xbfI\\xcf\\xa9\"]e?E\\x01D\\xec\\xb7\\x1eS\\xd8\\xdfv9\\x9c\\xd2\\xe0j>\\xa0\\xeav\\xac\\xaf8\\xbd\\xf7\\x12\\xe6*\\xf7\\x9eu\\x92\\x9e\\xed\\x8c\\x18\\xa7\\x1f\\xf2+\\x1d\\xc9g\\x19\\xa1=\\xeb\\x05\\xf4<\\x13\\xd0\\x03\\xed\\xd9\\xe39\\xe0\\x0f\\xab\\x1b\\x9e\\x0c\\x83H\\x00\\xb9\\xab\\xf6\\xdcn\\xffuAU\\xf7\\xf4\\x1a\\xccs\\x16\\xc5d{L/\\x9f\\x00\\x11\\xee\\x83\\x1c\\x17\\xed\\x81\\xfb\\xa0\\xad\\xecY\\xbf\\xd4\\xd6\\xabO\\x97\\x94\\xab\\x10\\xdfT{\\x96\\xf7\\xa1\\xab\\x1e\\xf5]_\\x0c\\xf1M\\xb5gi\\xcf\\x0b\\xf9{\\xcf\\x8f\\x90@\\xc4\\xfdA\\xe6\\xa3\\x81%[\\xb2K\\xcf\\xb8j\\xcf\\x1e\\xedx7\\xbf\\x87\\x9d/b\\xbe\\xa9b\\xdf\\xe2\\x95\\x07c\\xfd!b{\\xfa\\xdc\\xec\\x90\\xbdu}\\xc0P!{\\x9e\\n\\xe8\\xe9\\xe8\\x7f\\xf4Zv\\'6\\t\\xf3\\x07^\\xa7u\\xf3=\\xaa\\xfbCt6_\\xff,\\xa0\\x07\\xe6\\xeb\\x9b\\xc3c\\xf9\\xe5\\x8a\\xfd\\xd5\\x18O|\\xff_\\xafe=dW\\xe4\\x0eyV}FT@hx\\x9f\\xe6\\xfa*\\xa8\\xe7\\xd7\\x91s\\xaa>^|\\xae\\n\\xf3\\xb6\\xaa\\xa7>\\x11\\xca\\xfb\\xbbn\\xbcg\\x818\\xdb!\\xdfXg\\x1a\\xb8d\\xf3\\xb5\\x9a-.\\xf6!\\x87gf\\xc7\\x0fX#K\\xc3\\xdc\\xd9>D\\xa8n;\\x1b?\\x17v\\xe4\\x12u\\t\\xc7\\'C\\xc4\\x1b\\xa5.aRTh\\xbf}\\xb7\\x84\\xea\\x9cP\\x9f\\xf8\\xe7\\x1f\\xa3\\x1b\\x1e\\x9d\\t^\\x81\\xf9\\xe5\\xa5\\xe2\\x8a!{\\xdc\\t\\x883\\x1d\\xf2^\\xd9^E\\x7f\\xda\\x1esm\\x83\\xab~\\xab\\x9cS5\\xa2]\\xce(\\xcc5\\xe3\\x82\\xbehx\\x12\\x90\\x08\\x11\\xef\\xb7\\xc4\\xe2\\xb4j\\xefZ\\x8f\\x8a\\x83.\\xc6O\\xd5\\xd4X\\xcdO\\x8fS\\x030\\x7f\\xf2Vz\\xc2J/\\xf5~\\x88\\xb8\\x1f\\xad\\xdd\\xd1\\xa1|\\xc5\\xd1\\xb4uB\\xfd\\xa8\\x90\\xdf\\x94\\xbf\\x0e|\\xc7X=\\x94\\xc5\\xbc\\xb5\\xfa\\x9d\\xe6\\xf6\\xc1\\xe4\\xaa\\x02\\xcf\\x8c\\xfe\\x9eG1>\\x98\\xf2\\xf8.\\x15\\xb6\\xea\\x16\\xec\\x0f\\x84\\xfa^!\\xbf\\xc1\\xfe@Vxa\\xfd\\xd8R\\xdb\\xbb\\x10\\x9d\\x8dS\\xa1\\xfe\\x1a\\xc6\\xe9\\x85\\xb01\\x99\\xdd\\x1f1\\x05\\x18\\xd3\\x0f-\\x9a\\xd5pj\\xa7/\\xcc;\\xae>/\\xc0\\xbc\\xd3}\\xb8%\\xfex\\r\\x1f\\x07\\xb1\\xb5\\xe3\\xb4\\xa5\\xfd\\xf5=\\x01=0_\\xd7O\\x0c\\xbc\\xea;\\xb0(\\x17b\\xbcC^\\xb7\\xef\\xba\\xdf\\xd4\\x9e\\xe2vY\\xcd\\xf8\\r\\xf6\\xd7p}z\\x9d\\xdc[7\\xe5\\xc1\\x0f\\x7f\\x85\\x88\\xd7g\\xe3/\\xd21s\\xb8/3\\\\\\xad\\x0b\\x92;\\xbd\\xcb;\\xaf2T`\\xbe.\\x87\\xf5\\xb7*\\xba+!\\xb64_\\xdf\\xfa\\xc6c\\xee\\xd5\\x92\\xa2G\\x98\\x97\\x1f\\xef\\xa0+\\xd3\\x16yAt\\xf6\\xb9\\xd1\\xd9}P\\xbag\\xc6\\x91k\\xd7\"\\xde\\x86\\xd8\\xdau\\xael\\xf3\\xfe\\xc9!\\xbb\\xe6~\\x8c\\x11\\xe6Q\\x1c?E.\\xea\\x81\\xf1\\xe3\\xecs\\x96\\x90\\xdf\\x84\\xf4\\xc0\\xbc\\xd3V~+\\xc8/\\xf3X\\x1c<\\xba=D\\\\O\\xa7IN\\x0e;F$\\x07\\x94\\xb8X\\x17\\xc4\\xe93\\xcf\\x1d\\xf2*\\xfc\\x00s\\x7f\\x9f\\xfe\\x07J6f-\\x83\\xe8l\\xfd\\x11\\xda\\xd7\\xb0\\xfe\\x8cp\\xcb\\xee\\xe1%\\x8d\\xf3\\x80\\x08\\xf5\\x08\\xe57\\xa1\\xba\\x00\\xf5(:\\xef\\x0c\\xf4\\xf8\\xea\\xdfF\\x88\\xce\\xae\\xcfc\\'\\xd7\\xa7\\xad\\xf2\\xc1G\\xddN\\x19\\x8eO\\x8a\\xdc\\x8dq\\xa55n|\\xc1\\xaa\\xc8\\x8f\\xe0\\xbev\\xb5.\\xc0}\\xcd\\x8f\\xabm\\xf7\\x9e\\xfb\\xed\\xcb\\x10\\xf1~\\xbb8b\\x8a\\xef\\xe0\\xfb\\xcb\\x0f\\x08\\xf5o\\x82\\xf6TJ\\xe6\\xb3\\xdd\\xfa\\xd90\\x17z\\x8f\\x04\\xf3\\xb5P_%d\\xcf\\xb4\\xcd\\xcb%\\x7f\\xbf\\xd5\\xb5\\xa9\\x7f\\xcbz4\\xd8\\xad\\xf0\\xc3\\xef&Bl\\xed8mi=\\xbd#\\xa0\\x07\\xd6S:\\xd46\\x9f\\x0e8\\xf8{\\x88\\xad]O7\\xc9~\\x1aw;<f1FXO[\\xeb9\\xab\\xa5}\\xaf\\xb3y\\xa7\\xa5\\xfd\\xa8\\xb3\\xf1\\xd3Vu!\\xaa\\xeb\\xd1\\xf3\\x9d\\x06\\x0c\\xfa\\x10\\xe3\\xa9\\x0e7\\x97\\xa4P_\\xcd\\x83q\\xea\\xea{\\xd8\\'\\x0b\\xee\\x88EG>k\\xb2\\xe7L\\xd8\\xc5Q\\xab\\xc6\\xee\\xf4\\x86\\x98\\xe0\\x90\\xfb\\x8cML\\x0e\\x1aV{\\xef\\x1b\\x01=\\xbf\\x08\\xe8\\xf1\\xcd\\x9b\"N\\x8c\\xaa\\x1d\\x89y[\\xe5Qg\\x9f\\x7f\\\\\\xcdo\\xb0\\xaf\\n.\\xa9\\xef+O\\x99\\xe5\\x8b\\xf1\\xfe\\x15\\xcb \\x9b\\x9fgV\\xd3\\xf3\\xe9\\xd3^\\xdb.\\xce\\x14\\x97\\t\\xbd\\xdf\\x11z\\x7f=\\xf7\\xdc\\xcf\\x929\\xf5wga\\xde\\xcd}\\xd9\\xed\\x93\\x11\\xb6\\x0f \\xc2\\xf8Y\\xe3\\xe2>\\x80\\xf1\\xd3\\xd2\\xfc&\\x14?0\\xbf\\xad\\xd9\\xb8G\\xbeQ\\xb1\\xe9m\\x88J\\x87\\x9c\\xe9\\x9aY\\x13\\x13\\x96\\x9f\\xf4]3\\xfdNs\\xf9M\\xda\\xd1p\\xc3\\xf2/u&DW\\xf3hsq\\xfa\\xa6<\\x97\\xb4\\x17\\xd0\\x03\\xe3\\xe77ZB\\xe3\\x1d9\\xdd\\x07\"^\\xc0\\xb9\\x83{\\x97\\xfc\\xc7p\\x8f\\x9b\\x95WS\\xf8OvT\\xa1\\xb3\\xfdhQ\\x17\\xefM\\x99\\xc5\\x13<1\\x17\\xfa?\\xa0\\xcc!\\xc7\\xe8\\xea\\xff\\x01\\xe1\\xfa|\"_3\\xac\\xe3?bs B{\\\\\\xfd\\xff\\x1c\\xb4\\xa7\\xa5\\xef\\xc5\\x84\\xec\\x81\\xef\\xc5\\xae^8\\xf7\\xa3\\xc8\\xe7\\x87K\\x1833\\xee\\r\\xf3\\x99\\x91+\\xc6\\xfb\\xedf@\\xfa\\xee\\xccd\\xba\\xc1\\xd5\\xbe*\\xb8 {\\xb3\\xfb\\xc4\\xd9\\xcf0\\xa7\\x98\\xcf\\xcd\\x93\\xab\\xb7l\\x87\\xd8\\xdau\\xae\\xad\\xea\\xc2\\xda\\x8e3\\xbe\\x08}0y(\\xc4\\xff\\xb7\\xf7.\\xf7\\x9d\\xcc\\xa3\\xa3\\xa5yRQ\\xbb\\x04\\x03DW\\xf3\\x0e\\xcc\\xa3\\xb0\\xbf\\x9e\\x17|\\xa7\\xa8,\\xe5\\xa4\\x1a\"\\xecC\\\\}\\xde~\\xf6Y\\xf2\\xd9oe3\\xf6b>\\x7fP\\xdd\\xe5\\xed\\x9dN\\xdc\\x85\\xd8\\xda\\xf5\\xc7\\xca\\xea\\x08\\x19\\xc9\\x96K\\x91\\xe9\\xf6\\xc3>\\xda\\xbd\\xe0\\xf8{\\xe5\\x00\\x14|#\\x129~\\xeb\\x10\\x88D\\xb9\\x1a\\x92Rr*\\xb6\\xbc\\x03\\x9a]\\x94\\xcbr\\x8c\\x9aR\\xb2\\x17Ek\\xb6\\xf2\\xee\\xee\\xc6!\\xc6\\xd1\\xc6w\\x8dc\\x8cc-c#c\\x83\\xd1\\x18\\x8bF\\xe38\\x93\\xef\\x10_~|\\x00\\xef\\xef_;<\\x88\\xd5\\x912.P\\xc2\\xd0JC\\x1cI\\xb1$:%YC<\\xc9$O\\xa5\\x19m\\xa0\\x84`8>$\\x84\\x0f\\t\\xad\\xf5\\x0f!\\x908H&3\\x84\\x91\\x94\\x9cd\\x02\\xa7\\x92ZC\\xb4^\\x9b\\x8cN\\xa5H\\xadAB2,M\\x05N0\\xa0\\xd9\\xa8\\xb84\\x9d}.\\xb6\\xb4\\xe9W\\x0e\\xf1\\xfb\\xaf\\x88k}\\x1a\\xe5\\xd1t\\xd3T\\x12\\x8d\\x9e\\xc1\\xd7\\x8e\\x7f\\xe5Z[\\x08M-h$!Z\\x1d\\x1f\\x1a\\xb7\\'\\x94T\\xa8)5G\\x06\\xa2\\x93\\x17W\\x061\\xdc\\x0b\\x89\\x98\\x92\\xbf\"\\xf9>\\x94T2$\\x9a\\x8ef\\xf1\\xa9T\\xaf\\xe3\\xa7\\xce\\xccG\\xe6\\x92j%\\x15\\x98@\\xb2\\xe6i\\t\\x92i\\xbc8\\x9a\\x0f\\x0f7\\x85\\x87K\\xf9H)\\x1f\\x85\\xec\\x8f\\xa2iy\\xe3\\x84\\xaf5\\xfau\\xde\\x9b\\xaa\\xa6j\\x077\\xfdL\\xe0\\n>:\\xda\\x14\\x1d-\\xb5\\xa1Y\\x9f\\x1bG0\\xf2|Lb\\x9e\\x9fc\\xc7\\xe4\\xbf\\xa4\\xba\\xd6\\xe75\\xf7\\x81<F\\xb3\\xac\\xdd\\x88W\\\\g\\x92\\xc4J\\xcc\\xe83\\xdc\\xd6\\xf4m,\\xa9\\xd9/\\xd1S2N\\xaa\\x96\\x93\\xf6\\xfb04\\xb2FY0#[\\xf8\\x92PL\\xa9\\x81p\\xc7\\x0b\\x1aBk\\xb5/\\xd1P\\x82U\\xbdD\\xd1m\\xa9\\xf9\\xd8`slLL\\x9cI\\x9a\\x10U\\xecp\\x02\\xc1r\\xaf8\\xa1X\\xc89\\xf1\\xc1\\xa6\\xf8\\xe0P\\xf4\\tC\\x1f\\t\\xfa\\xcc\\xb6\\xbd,\\x7fA\\xc4\\x94\\xc2434\\xce\\x94$\\x95\\x18\\t\\x0b!\\xa3\\xb5:+!O\\xd1\\xd2r3\\xa1ai3\\x81\\xceL\\x04%\\xb7\\x10:\\x1d\\xcd\\xf2\\x04g\"\\xf4\\x8b\\xf8d\\xd2\\x9cL\\xb2\\x9cYFhI\\xab}`\\x08^&3\\xa3_\\x93y\\xf6)h=%G\\x8cZ\\xb0M\\xa6g\\x18\\x92\\xe24i&9\\xa9C\\x1f\\xce,\\xa7\\x93\\x17\\x98HNfR\\xd0\\x8cY\\x89V\\xd9\\xac\"RH+\\x1a\\xd0\\x82\\x98T$cA\\xce#4\\x16\\xb5\\x96P\\x92\\xd6\\xc6\\x91\\xe5\\x91Ijv\\x9b\\x06\\xdd\\x08+#t\\xa4\\x19\\x050k\\xd1\\xa8\\x95*.OC\\xcb\\x08NMS\\xdb\\xf0\\tk\\xd6\\xd0\\xf4\\xc2\\\\\\xfb\\x80f\\xcc\\xd3\\xa2\\x9b\\xe1\\x084\\x816-\\x8f\\xd2=\\xb7\\xcdB\\xb1\\xfa\\xe4\\x05VJ\\xaf\\xb5\\x13ZF\\x12\\x94\\xb5qdyZa\\xa5u\\xf6i,4g\\xbf\\x19\\x9d\\xdd\\x1e\\x8bNEs\\xb4\\xb5qd\\xcd:d\\x01\\x1aXt\\xc6\\x90Hf_6\\x0bCjd\\x1a\\x0b\\xab\"\\x18\\x9d\\x89U\\x91\\xf9,\\x8a\\n\\xb5B-#(\\x8eg\\xe9\\\\VO1j\\x96\\xb4\"dI\\xce\\xc4M\\xf03s\\xc4B\\xd2\\x8a\\x06t\\x93\\x16NEP\\x0b\\xcdhD\"\\x15\\xc9#]\\x1c\\x83\\xbc\\xa21\\xa7\\x10LZ\\xae}@W\\xf1\\xa9\\xa49U\\xcd\\xa9,\\xa9\\xb4^#7.2\\xa5\\xd1z\\xb4\\x04\\x1c\\xbb\\xf6s\\x8bBC(\\xd9\\xb5K\\x0bU\\x04\\x9b\\xa4\\xa7\\x16Rt*\\x95\\xf4<\\x83\\x1e\\xceGH%)\\x19Z\\xafc\\xd7\\x96\\xbbe\\xfd\\x0f\\xdcE\\xc8\\x0e'", "year": "2021"}, {"Unnamed: 0": 193799, "autor": "Brianrolfephoto", "date": 1629462185000, "content": "XPro3 Test Drive /!/ So I spent the day with the XPro3 yesterday, coming from the XT1 and XPro1 I was really impressed with the advances in autofocus and the fact that it seems to have retained that filmic feel of the XPro1 which I love. I'm a bit torn between the XPro3 and XT3 now, I'm not sure if the hidden lcd is going to get annoying. For studio/commercial work I'm still using my DSLR so this is mostly my natural light/location camera. The AWB on the Fuji cameras is just so much better than Canon and the EVF exposure preview makes life so much easier. Happy with the results, just need to think about which way to go and try to forget that the XPro3 dura silver is beautiful to look at!\n\nhttps://preview.redd.it/obkiljn4aii71.png?width=729&amp;format=png&amp;auto=webp&amp;s=392161531a94b1df1736f7e8fadbc4bd791b2d4e", "link": "https://www.reddit.com/r/fujifilm/comments/p844h4/xpro3_test_drive/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "xpro3 test drive /!/ so i spent the day with the xpro3 yesterday, coming from the xt1 and xpro1 i was really impressed with the advances in autofocus and the fact that it seems to have retained that filmic feel of the xpro1 which i love. i'm a bit torn between the xpro3 and xt3 now, i'm not sure if the hidden lcd is going to get annoying. for studio/commercial work i'm still using my dslr so this is mostly my natural light/-----> location !!!  camera. the awb on the fuji cameras is just so much better than canon and the evf exposure preview makes life so much easier. happy with the results, just need to think about which way to go and try to forget that the xpro3 dura silver is beautiful to look at!\n\nhttps://preview.redd.it/obkiljn4aii71.png?width=729&amp;format=png&amp;auto=webp&amp;s=392161531a94b1df1736f7e8fadbc4bd791b2d4e", "sortedWord": "None", "identifyer": 86681, "doc": "b'x\\x9c\\xdd\\x9c\\x0b\\\\\\x14U\\x17\\xc0A\\x13\\xfb\\xd4L\\x8d\\xd4\\xc2WJ\\x9aO\\xe4!\\x8f\\x92T \\x0c\\x15\\xd8\\x00\\x1f\\x98\\t\\xb3;\\xb3\\xbb\\x03\\xb33\\xeb\\xcc,+\\ni\\x96\\x89\\xa6\\x86~\\xf9\\x8e\\x94\\xdd\\x99\\x05\\x05\\xa1,\\xdf\\xf9\\xc8\\xb4\\x94|\\xa5\\x95\\x91o2-\\xf3M\\xf9*\\xed\\x1bto\\xc9\\xc9\\x9b\\xb3\\xed\\xfe(\\xbf\\xfd\\xfdf\\xfes\\xf6\\xce\\xce\\x999\\xf7\\xdc{\\xcf=sajQ\\x16\\xc5\\x0b4\\xc7\\xda{\\xf7\\n\\x94\\tQ\\xe4\\x85\\x82\\x01\\xd1q\\x83\\x06\\x0f\\x89OH\\xd4\\xec\\xf2\\xde\\xba\\xcb{\\xdb.\\xefO\\x1c\"\\x97I\\xb1\\xc2\\xb6\\xc8\\x11\\x136l\\xbaZ\\xaf[U\\x04d\\xba\\xd7\\xedO\\xf3\\xa7\\x0fl\\xfe\\xf6\\xd5\\xc0\\x83\\xc9\\x83\\xbbt\\xbc\\xbc\\xb1\\x84\\xa8\\xe7U\\xfb\\x83do\\xf0}\\xc0\\xe6#\\xd7;\\x86\\xac~\\x1b\\xc9\\xa2!o\\xfb\\x97\\xb9\\xd6\\x96\\x90\\xa3\\x9c\\xe5+\\xfc\\xb7\\x0f,yv\\xcc\\x178=\\xe8\\xfa\\xbf9?8=\\xd1\\x05\\x15#~\\xf2i>\\x19\\x12\\xea\\x19\\xb27\\xf7\\xbc\\xb4\\xf5\\xc4\\x18\\xa8\\x07}\\xee\\xa5\\xe7J\\x9b/\\xcc\\xe9\\xcd\\xf6=\\x06I8\\xcbm[J\\x87\\x9c\\xa9\\x9cP\\xbe\\xc1\\xbb\\xb6\\x9d\\xe0\\xf5\\xa1\\x9e\\x1eI\\xe3\\xf4i\\xa3\\xf3^B2\\x17S\\x9a\\xce\\x85o\\x9a\\x029\\xccY^\\xb5\\xfeD\\xef\\xd8\\xe6q\\xf5\\xf21zp\\xf5\\xb3\\x1d|\\xd1\\xbe\\xfdQ\\xb3\\xff\\xec\\x8d\\xb1\\x88\\x9b\\x9e\\x8b\\x19\\xf3\\xdb\\x9aV\\x03\\xd2\\x9c\\xe5\\x87\\x9e\\xec\\x17\\xd0\\xe1\\xf2\\xeb\\x1b\\x96c\\xf4\\xe0\\xea\\xe7\\\\\\xc2\\xda\\xd3g\\xde\\xbe\\x92\\x85\\xe4\\xdd\\x13\\xcb\\xabv\\xee^0\\x071\\xccg\\xd9\\x11i\\xfb\\xf40\\xd2Y\\xfe}\\xf8\\xf8\\x95\\x93\\xb5\\xdcYW\\xeb\\'\\xaa|nA\\xa3\\x90\\x917\\x91<{\\xa1\\xd0\\xc7\\xa1oj\\x80\\x1c\\xe9,_Pe\\xf7\\xcb-8\\xbe\\x7f\\xb1\\xab\\xcf3\\xaf\\xd9\\xa8ckV]C\\xf2\\xd9\\x8e\\x9b\\xdf\\xf7\\x19\\x97\\xd4\\x12\\x12\\xfa\\xdb\\x12\\x8c\\x9e\\x9b\\x18?\\x80\\xfe\\xc6\\xf2\\x13\\xa5\\xbe\\xfb\\x16/\\x87\\x1c\\xea,o\\xaf\\x1f}6H{\\xae\\xf9z\\x8c\\x9e\\x1b\\x18=\\xd0\\x0f\\xea\\xcan\\xb8~\\x07\\xd9m\\xfc\\x90\\xb6\\xad\\x1b\\xbcp\\xb4\\xd1j\\x17\\xed\\xd6x\\xec\\xdcP\\x9fu\\x0f>\\x86\\xe4\\x8d\\x9d\\x82\\xbe\\xc9\\x1bE\\xb4\\x86\\x84\\xf5S\\xea\\xd4S\\xdf\\xf9\\xfd\\x14\\xa7|]e\\xfd\\xacm\\xf9\\xf8\\x1b3\\xce\\xfe\\xda\\t\\x92\\x00\\xe5\\xb8\\xfe\\xe0\\x1aF\\xcf\\xf9\\xfao\\x95\\xefm:~?\\x92\\x1b\\xfe\\x18z\\xf4L\\xf4\\x92K\\x88\\x93\\'Tw\\xea6\\xb4(\\x0e\\xb5\\x9f\\xfc3\\x13\\xe2\\xc3c\\x06=\\xfa&F\\xcfU\\x8c\\x9e\\xdf:\\xbf\\xb8\\xb7\\xff\\xb8\\x03{\\x91\\xbc4x\\xc4S\\xb9\\xf6r\\x06R\\xad\\xbf\\xe1\\xfa\\xb7\\x7f\\xca\\xdf.|\\xfeB\\xe8S{vO\\x82Lw\\x96\\xa3q\\xceU\\x7f\\x83~\\xf0\\xe5\\xc0C]\\xa6\\xf7|\\xaf=d\\xaa\\xb3\\xbc[\\xcf\\xd1\\xda\\x01\\x9d*\\xab\\xe7\\xb9h\\xb7\\x80\\xe2~q\\xa3\\xe3+;#\\xf9\\xd3\\xe0\\x0f\\xb7\\xccx\\xb9\\x82\\x82\\x84~\\xbd\\xd0\\xcd\\xe7\\xa9\\xabq!\\xfd\\xf4\\xfaF/\\xfc\\xf0\\xeeT\\xc4\\xcbG\\xe5v\\xa5\\xbd[\\xe6\\x0fw\\x96\\xa3q\\x01\\xf7<\\x171\\xcfs\\xf2C\\xaf\\xa3\\xe9\\xc5\\xb1\\xb1H\\xe6\\x97L\\xca9\\xd4x\\xd4g\\x90j\\xc7S\\xdc\\xf3@\\xbf\\x9e\\x9b\\x9f:\\xb1\\xdd\\xce9\\r!S\\x9c\\xe5\\x95e\\x0fl\\xcd\\xfb4{\\xf6L\\x17\\xeb\\xc7\\xf0\\x9b_\\xdb\\xc2}\\x1d\\x05$\\xbb;.\\xfc\\xdb\\xdai\\\\AY\\x8b\\x85q\\xe7C\\x113\\xae7=r}\\xd2\\x92\\x0b\\x9e\\x1e\\x17t+\\x0e\\xfe\\xb7\\xe7\\xc6\\xd2\\xae\\x90\\x9e\\xb6\\x9b\\xbc*\\xe25\\x1f]\\xc8\\'\\x90\\xb0\\x9d\\xe2\\x9e\\x07\\xdb\\x1fx\\xb8\\xdf\\xc1\\xc5\\x07\\xb0\\xdf\\xa9+?\\x98\\xf2\\xc87\\xfeB\\xc4\\xb9\\x10H\\xb5\\xfd\\xdb/*\\xedv\\xb0\\xac\\x88\\xa8J\\xdd\\xd1\\x17R\\xeb,G~Pt\\x8f\\xf8\\xfa^~\\xd0\\xa5\\xf5\\xd9&\\xbb\\x1fyl&\\xa4\\xbb\\xfd\\xe8\\xdaIC\\xc7\\x06w\\xfe8\\x0f\\xc9}\"\\xf2V\\xfag\\xfe\\xfc\\x04\"sp\\xfe\\xcc\\x82\\xfe7\\xf7\\xa1\\xf8\\xa0\\xc5\\x8d\\x16K\\x0f\\r\\x8f\\xfb\\xe8c\\x17\\xfd\\x80\\x19U\\xeft\\xab~\\xa7V\"9\\xffZ\\x07\\xef\\x15\\x11\\xef\\x84@\\x8ev\\x96\\xf7\\xd8K\\x0e\\x9cv\\xa9(~\\x8e\\x9bvk\\xb1{]U\\xbf+\\'?\\x83D\\xe3\\xc2\\xe8\\xd5\\xd9\\xfb\\xdaW6\\xdb\\x86\\xd3\\x83\\xb3\\xdb\\xde\\xd8$\\xe6\\xe2uk8\\x92+/X\\x1d\\xa3\\xbb~t\\x15\\xf1\\xe1\\x16\\xcc\\xd7A\\x175\\x8d\\x90\\xdd\\x82Rg\\x13\\xd5_5\\xee\\xb3\\xc5E\\xbb5h\\xbc\\xc9\\xb7_\\xe0\\xb5iH\\xc6\\xf9\\x9b\\xda\\xf6\\x83\\xb3\\x9b\\xe5\\xa7\\xf3G{\\xee\\xb1<\\x82\\xe4\\x9c\\x04\\xe3\"\\xa9\\xfbS\\xe1\\x90p\\xfc\\x99\\xed\\xa2\\xdd\\xe0\\xf8\\xf3\\xd0cc\\x1f8{\\xb8,\\x11R\\xed\\xfc\\x07\\xdb\\xef\\x80v\\xbaq\\xed\\xd0O\\x8e\\x1f\\x1f\\xdc\\x04\\xf2~\\x1d\\xe7\\xd4\\xc6o\\xee\\xc6\\xa3;\\x86\\\\\\xb5u\\xe8\\xd4P\\x0b\\x89\\xfa\\x9d\\xaa\\xd4\\xd0\\xf8\\x98\\xd6\\xeb\\xcf\\xe1\\xeaGm;\\xad\\xab8q\\xdb\\xca\\xbc.\\x9f<\\x9d\\x1e\\x0c\\x89\\xda\\xe9\\x82_\\x92{\\xbc(\\xbe6a\\x93\\x8b\\xfe\\xf6|\\xc1\\xeb\\x9a=\\xe7\\x1awA2\\xca\\xdf@\\xaa\\xcd\\xef\\x1c\\xc0\\xe8\\x81\\xf9\\x1dO\\xd9\\r\\xe6w\\xa0\\xdd>_\\xb6Y\\xff\\xfe\\x07>Y\\xe9M\\xab\\x9f\\\\eK|\\x08\\xc6\\xd7\\xc8n\\xae\\xe6]:T\\x18\\x03\\xea\\x15\\xb6\\xf2Er\\xb7\\xc1\\x86\\xcb\\xef\\x7f\\xd7]\\x86t\\xb7\\xfdl\\x19>w\\xd8\\xe33u\\xd9H\\xde\\xb9`~\\x9b\\xe6\\xedN\\xb5\\x86\\xc4\\xcd\\xeb\\xffn>1\\xd7{\\xd9\\x9b\\xf5\\xf4\\xe5\\xab \\xd5\\xc6\\xf18\\x7f\\x83\\xfdh\\xd7W\\x9e\\x9d\\x97\\xc9\\x87\\x18!\\xef\\xd7\\xfe\\xad\\xae\\xf2;\\xee\\xc6\\xbd\\xb8\\xbc\\x0b\\x8c{c\\xab\\x1f\\xcf>\\xfc\\xe4\\xc8XH\\xb5\\xed\\xf4\\x01\\x8c\\xdd\\x9e\\xd1\\xadLjpc\\xd7r$\\x7f\\xd8\\xce\\xe8\\xed+\\xfb\\x9d\\x83T;?E\\xf9\\xab{\\xf9\\x81\\xbb\\xf9*\\xdc\\xb8\\x00\\xf3Uu5.\\xa8\\xed\\xdfp\\xf3\\x85\\x9f0~\\x00\\xfb\\xb7\\x95\\x05\\xf3\\xa3\\x1am\\x0f\\xf5\\x81Dq/\\xaa\\x9f\\xa5.\\xb6\\xd3\\xff\\\\*\\xfel\\xcc\\x8d\\x87\\x9fC\\xf2\\x92c\\xe6f9\\x15\\\\WHO\\xe7\\x0f\\x9a^x\\xb3\\xa2\\xd1\\xaf\\xebK!\\xd5\\xce\\x7f\\x1a\\x80\\xe7B\\xdf{\\xba\\xdf\\xc1\\xf9\\x1b\\xecwf\\\\l\\xdb\\xd7\\x9a\\xfezcHO\\xc7\\xbd_xo\\xceab\\xbe{\\x02\\x12\\x8e?8\\xbf\\xc6=\\x0f\\x1c\\x7f\\xa2\\xd6\\x9ciEf\\x8d\\x08@\\x84~\\x8d\\xe6s\\xae\\xce\\x7fF\\x1d\\xf8I\\xf3\\xe2\\x99K#\\x90\\xbc\\xae\")\\xff\\xc7\\x9d\\xf26\\xc4\\xae{N.Zt\\xf5Q\\xce\\xd3yew\\xe7\\x8dj\\xf3o\\xfd\\x8f\\xaf\\xc9\\xbd\\xd8\\xf0\\xa2\\x1f$z\\x1e4o\\xc4\\xcd\\xe7p\\xed\\x07\\xce\\x1bg,\\xa4\\x8fm;\\x11;\\x00Rm;\\xc5\\xf5\\x07\\xd0\\xdf\\xdc\\x8dGq\\xfd\\x1b\\x8cG\\'\\xc8\\xa6\\x13\\x87}\\xf2\\x8f@\\xaa\\x8dC\\x1et\\xf2^\\xef\\x1b_p\\xcc?=\\xeb\\x8b7\\xebC\\xc2\\xf6\\xb3\\xcc\\xcd\\xf6C?b\\xf8\\xb4\\xba\\xe73\\x1d!u\\xcerD\\x9c\\xdd\\xd4\\xfa\\xdbF\\xc3\\xc1\\xa67\\xcb\\x8fu\\x80\\xf4t\\xbfs*3kp\\xda\\x07\\x89o@\\xaa\\x9d7\\xfe\\x8a\\xf1\\x03O\\xe7\\xfdqq\\xc8\\xdf\\x1d\\xb7]\\xcd#\\xc1q\\x9b\\xf8\\xeaP\\xf3\\xb5s\\x0cI\\x90\\x9e\\xce\\xfb/\\xa7.}tm\\xd2\\xc9o\\x11\\x07\\xa4?\\xb9\\xba\\xd8J\\xa6\\xc1~\\xd4\\xd5y\\x16\\xecG\\xcbK>j6.\\xea\\xa9\\xfa\\x90\\xa8~\\x9e\\xd7\\xec\\xee\\xb4\\x9d\\xd0\\x86\\xafq\\xf1y\\xe2\\xc6\\x0f?\\xb0\\xb9\\xcd\\x8a0$\\'\\x0f\\n\\x98\\xbf/qC<\\xa4\\xa7\\xdfo\\xab]\\xe7\\xe0n\\x1e6\\xbe\\xfb\\xdc\\x19{O\\xac\\xf0\\x83DvCq\\x88\\xab\\xf1(\\xcc\\xbf\\xa9\\x1d\\xb7q\\xe3).\\x7f\\r\\xc7\\xed\\xa8\\xd4\\xf4\\xd5\\xcd,\\x91\\x0b \\xd5\\xfa5n\\xfc\\x81vs\\xd7\\xdfpq\"\\xf4\\xb7\\x93\\xd7\\xaf&\\x9e\\xfb\\xba:\\x18Rm?\\x8a\\x9bg\\xfd)\\xee\\xf5\\x97\\x87\\xed\\xd8oK\\x81\\xbc_\\xc7\\x9f\\xa9\\x8e\\x94\\xc0\\xf2\\xe9C\\x9e\\x81\\xf4\\xf4\\xfa\\xaaY\\r\\x86N\\x8a\\xb9\\xd2\\xb7#$\\xd4\\xf3\\x96\\xab\\xf3m\\xa0\\xc7\\xddx\\xa7\\x1a\\xa3\\x07\\xc6;\\x9e\\xca\\x87\\xfc)\\xff\\x06\\xe6%M\\xae|\\xde\\xdf\\xc4\\xee\\xec\\x02\\xa9v\\xbe\\x80k?\\xd0n\\xebC7\\x8ek\\xfbNl\\x02\\xe4\\xbf-\\x8f\\xa4v>\\xd7\\x90\\x90G\\x94\\xf1\\x8bzA\\xa6;\\xcb\\xef\\xb5>Q\\xad_O\\xc9\\xab\\xd7\\xc0r\\xbd\\xfa*$\\xd2sX\\xb7\\xf0\\xb2o\\xd9w\\x8bpq\\x15.\\xcf\\x07\\xf3Uj\\xc7\\x05W\\xe3\\x038.t?0\\xf4\\xc0\\xe2\\xa2\\x10\\x1d\\xa4\\xa7\\xf3H\\xee\\xaeOT\\xdb\\xbf\\x8d\\x0bo\\xd3\\xa6\\xf7\\xd6o\\x1e\\x87\\xf4\\xb4\\x9e\\xafn\\x06\\x9d\\xdav\\xe5\\xfbu\\x88\\xa3z\\x85g\\xe4M\\xdb\\xf3,\\x1a\\x7f\\xa2\\x86\\x95U\\xed\\x98\\xb8\\xa3>n>\\x87\\x8b\\xaf\\xadW\\r\\x17\\xd2\\x12\\x17mF\\xf2\\x01\\xdf\\x1f\\xa7\\xa6\\xbf\\xb3k\\x0e\\xa4\\xa7\\xdbi\\xd9\\x95\\x163s\\xbd\\x02vA\\xfe\\xdb\\xd6\\x1f`\\xf5xx\\xfd\\x01v^\\x02\\xfa\\x9dW\\x7f\\x9d\\xbc\\xf8\\xad\\xd5sn@\\xaa\\x1dO\\xd5\\xc6\\x07\\xf6\\x9b~\\xe5#w\\xfb\\x17@zz\\xdc>\\x1b\\x10\\xe5\\xff\\xb6\\xa5i\\x01\\xa4\\xa7\\xd7S\\xf4\\xf4\\x9d2z\\xfc\\x0c\\xff5\\x88\\xc6\\x0eK[\\xf6L3M\\x86\\xeb\\x0fpq/.O\\x01\\xd7\\x1f\\xc4\\xd9\\xde\\x98\\xe87\\xbb\\xe4\\x04\\xa4\\xda\\xf1\\x14\\xe7\\x07\\x7fw^r\\xbf\\xf4o\\x8b_\\xdb\\xf5\\xf2\\x8a\\xd3\\xbe\\x9f!\\xfe\\xd0\\xc6\\xf2\\xee\\xb4\\x1e\\xdd\\xec\\xb0\\x7f\\x9b\\xeff\\xff\\xe6n\\xfcv\\x1e\\xa3\\x07\\xc6o\\xd2\\xc2\\xfd\\xad*.h\\xebC\\xc2\\xf9\\x02\\xce\\xdf|\\x80\\xfd\\xd0\\xe7\\xff}\\x9d\\xdd\\xfa\\xd7{\\x0f\\x99Q\\x9dU\\x81X2.\\xb9\\xd8\\xda\\xf7\\x83\\x13\\x9e~?WW\\xef\\x99\\xdc\\x8dw\\xd4\\xb6\\x9f\\x80}\\xf3\\xc2\\x06\\x8f\\x90} a^\\xd9\\xd5\\xf8\\r\\xe6\\x95\\xeb*O\\xde\\xe4\\xb0\\xeex\\xb7\\x0bA\\xa7!=\\x9d\\'g\\x06\\xe7\\xe7\\xb6=\\xe5\\xfb\\x10\\xa4\\xa7\\xdb\\x0fn\\xbd\\x0bj?h\\xbd\\x8b\\xab\\xed\\x07\\xea\\x99\\xeex\\xadY\\xaaFL\\x83\\xf4\\xf4\\xfa\\x9d\\xba\\xf2\\x03\\xf4\\xbe\\x07\\x12\\xfa\\x01n]\\x8dZ?\\xa8\\xab8\\xb1\\xec;\\xbf#o\\x9f\\xf84\\n\\x12>\\x8f\\xab\\xeb\\xe3\\xff\\xa9v\\xda\\xdb\\xb7\\x7f\\xb0\\x90u,\\x10\\xd2\\xd3\\xed\\xd4\\xdd\\xf5\\xb0u\\xf5>Xm\\x1c\\x7f\\xafu(\\x9e\\xca\\xf3\\xad-\\x0c\\x99\\xd2y\\x8c\\xdc\\x03\\xd2\\xd3\\xef\\x7f\\x16\\xe4p\\x9dR\\x8a#\\xa3!\\xd5\\xc6\\xbdj\\xe7\\x0bj\\xf3\\x14\\xb88\\x11\\xf7wS0O1l\\xe6C\\r\\xae]{\\xa9!\\xa4\\xa7\\xdf\\x9f\\xd6U;\\xadX\\xf6s\\x9bW\\x1f\\xd6\\x1d\\x85\\xf4t;\\xd5?\\xf8^d\\xb3i\\xa7\\x0b!==\\x9e\\xa6\\xb7\\xab:\\xb2\\xdc\\xa7\\xe2\\x12\\xa4\\xda8\\xfe4F\\x0f\\x8c\\xe3g.XK.\\xd0/j\\x02ip\\x96\\xf3\\x8d\\'\\xefO\\x1cX\\x92\\xf6\\x0eF\\xcf\\x0f*\\x9f\\xe7T^\\xee\\xc5\\xbc#~\\xe3!\\xd3\\x9d\\xe5(\\x9f\\x88{\\x9f\\xf5=F\\x0fl?\\x0e\\xc1L\\xe8(a\\xeb<\\xef;>^\\xde\\xf7\\xfax\\xddq\\x8eW\\xad\\xf3\\x95c/\\xaf\\xda\\x97\\xf0\\xf2\\xc2^\\xd1\\xeb\\xaf\\xd4\\xd5\\xdc_\\x11C\\xb1\\x06\\xd1(l}`^\\x8d$\\x88<\\xcd\\x1a\\x84C^\\xeb\\x96\\xd8\\x1a5*|\\xc2\\xd6\\xc5T\\xd8\\xa3\\xb0Wa\\x80=\\xe0\\x89\\x80J\\xff\\x01\\x82\\x99\\xd2\\x89\\x91\\x1a\\x8a\\xd7\\xe7\\xa4P\\xac@Ej\\x08A\\xcc\\x19F\\xf1\\xdaX\\x8e7)\\x12/\\xfeq\\x16\\xcf\\x19\\xd0Y<%\\xd4>\\xcb\\x16\\x1d]\\x19\\x1aM(e\\t\\x9c)g \\xc5\\x92\\x14\\x1f\\x99@Y\\xc4\\x9c\\x04\\x8bI\\xab\\x1c\\'+\\xf7\\x91\\xa3(\\x128628G\\xb9\\x16\\x9b\\x92m\\xae\\xb9\\x92P\\xd9\\xed\\xf7\\xdf\\xdd\\xe5\\xdc\\xc0Z\\xe7\\x96Fsl\\xc6-!\\xdad\\x96b\\x06\\xa4<g\\x8bIY\\x1bC\\xe9i\\x96\\x16\\xa9H\\xe5\\xe0\\x8f\\xd3\\x07\\xf0\\xe2\\x1f%q,Y\\xabdY\\x0ce\\xe0\\xa9[\\x97A\\x87\\x1aN(\\x8c\\xb3\\xc5%\\xd8\\x06\\r\\xb2\\x0f\\x1a\\x94T\\xd9\\'\\x9e\\xe3\\xc8[?\\xbc\\xebm\\xdd\\xcd\\x12\\xb14\\xfb\\xd7?\\x0b\\xbe\\xab\\x99\\xd5\\xff\\x0cj\\xb3%$\\xd8\\x13\\x124\\x92\\xb2%+\\x07\\xc9%\\xce\\x1fk\\x18\\x0b_r\\xc7\\x85*\\xbb\\xdd\\xdd\\xb4\\x9c D\\xa6*\\xd7\\xacU\\x1f=\\\\\\xb9\\x835\\xb5NF\\x97\\x89\\xa1LvM\\x92FR6\\xffR\\r\\xc7\\x10<-f+\\xfe`(\\xbdSS\\x99\\xc6\\xc2\\xea\\xc4\\xdb\\xd5\\xc9\\x99Lw\\x88\\x8aV\\xda\\x96\\x14%%%&\\xa6\\xd8\\x93S\\xe3m)\\x89\\xab1\\x96[\\x8d3\\xcd\\xb0(\\xfb\\xb0\\xa8\\x18e\\x1b\\xa8l\\t\\xca\\xa6Q\\xb6\\x91\\xa5\\xbf\\x9f\\x13\\xc7\\xea\\xed\\xc3cR\\xeci\\xc9\\x9aBB&\\xb4\\x9cE\\xb4\\x13:F&t\\x9c\\xc9\\\\D\\x90Y\\x04\\xab\\xa3\\x8a\\x9d\\x14d\\xe5@\\xc78\\x94\\xbd\\x89#m\\x84I\"\\x14\\xda\\t\\x96,&X\\x96\\xcbV\\x9e\\xdeF\\x88R\\xcd\\x7ffXJXDN\\xcf\\xe9,\\x82\\x9d\\xb0\\x8c\\xb5\\x13V\\xadMK-\\xd5R\\xca\\xd7\\xb4\\xde\\xc28\\xb4\\x94(R|\\x91\\x02+E\\xb1v--:t\\x84\\x89\\xe2\\x89\\xa2\\xdb\\x10d\\x1d\\xc1r\\xacM\\xa7\\x93u5\\xb7\");\\xca\\xa1\\xec\\x14\\x1d\\xcb\\x14(\\xe7\\xe8h\\x82)\\xae)\\xe3,,\\xa9\\x94\\xb3\\x19v\\x92\\xc8\\xb6\\x93\\x94Y\\xd9D\\x89\\xe4\\xb4\\x192\\xc9\\xd3Y\\x94D\\n\\x0c/\\x91\\x16\\x9epP\\x84@S\\xbc\\xa4 \\xdbNe\\xe9\\x8b\\xa9\\xb1fN\\xb0\\xf0\\x94\\xa4\\'t\\xa2\\xa4\\xa7(\\xc6\\xa1\\xa7\\x19\\x13\\xad\\xb3\\xeb9\\xde\\xa1l\\x06\\xe5Jz\\x9e3IzK\\x06mW$\\x9b\\x81\\x93\\r\\x9cr\\x17\\xb2\\x910\\x9b\\xb3%#\\x91E9\\x8c4IRl\\xe5\\x04\\xa3(\\x9a\\x85\\xa7\\x03\\x02\\xcc<\\x95ES\\xd6^<E\\x92\\xbdh1\\x80\\xd3f\\xd2L\\x06\\x1bB\\xd0tX`/3k\\xe8g\\xa5I\\xd1\\x18\\x19\\x16\\x14\\xd1\\x990\\x99\\x9fQ\\x14\\x99\\x081R)\\xb8%\\xd6\\xd8.\\xd2Ji\\xcd\\xb7$!28\"(04\\xb0Op \\x11\\x11\\xa2\\r$\\xf5\\x81a\\xc1\\xa1\\xfa0*\\\\O\\x90Z]\\x88\\x96\\x0c\\x8b\\x08\\xd4\\x06\\x91!T!m\\xa3\\xf5Ki\\x93\\xa2^\\x10(\\xd2\\xa6\\xd4?-\\xd8hQ\\xca\\xb0\\x08\\xa2\\x9d\\xd1\\x91\\x12C\\xeb)\\x99\\xa1\\rF\\xb1\\x98\\xe1t\\x84Hs\\xac\\xc4p\\\\\\xa6\\xb2S\\xecd\"2)\\xb9f\\'(\\x87|\\xa6\\xc3\\xc4\\t\"\\x93-\\x99,:\\xa3\\xcd\\x94]\\xc4\\x12\\xa2bCFb)\\x8a\\xb4\\xb3\\x94Abkj\\x9f\\xe5De\\xb3\\x16\\xb3\\xe6\\xdbn!\\xb3\\x82E\\x9ba\\xe3\\xf46\\xe5\\xdaf\\xa5\\x12\\x94\\x9d H\\xca=\\x99\\x8b\\x9cv\\x91\\xcd5>\\xee\\xe0)\\x82a\\xb2e\\x9eb\\x14\\x9fRn\\xd9\\xc2\\x88E\\xb7!(\\xa2H\\xd0l\\xf1mP\\xa4$P\\x94I\\xae\\xd9\\t\\x0e\\x81f\\xb2(\\xde&p\\xb2\\xd2%\\xb3\\xe4\\xad\\xbd(\\x0b\"\\xcd0\\x0eA\\xb4\\x904\\'\\xdd\\xaaR\\x91\\x12DI4\\x12l\\xcdN\\xb4\\x8bFJ\\x16\\x8d4\\x9b\\xa9\\x88\\x8aUDN\\x129\\x9e\\xb5\\x8b|\\xb6\\xdd\"P\\xb2EP\\xea\\xd4n%\\x04e\\xcb\\x96\\xac\\x14\\xc3\\xc8V#\\xad3JVZTv\\x1c\\x9f)\\x8f\\xadq6y\\xac\\x99\\xe7\\x02o\\xed\\x83\\xedc\\xc5@e\\x0b^\\x9a\\xad\\xa8\\xa2x\\xc5\\xfb$\\xc5\\xa6\\xc2\\xac\\x89\\xb2\\x9e!\\x0c\\xc2\\xacWV\\x18\\t!\\xcd\\xc2f*\\xf6a\\xd3n\\x0f\\x9a[J\\x14\\xb2i\\x06\\x9e\\xb3\\x98\\x85Y[\\xbd\\xf3\\xff\\x071k\\x83\\xaa'", "year": "2021"}, {"Unnamed: 0": 194245, "autor": "romiloff", "date": 1623085696000, "content": "Fuji xt4 - 16-80mm, f2! This is a picture from my parents' village! Location - Negovanovtsi, Bulgaria.", "link": "https://www.reddit.com/r/fujifilm/comments/nuhqva/fuji_xt4_1680mm_f2_this_is_a_picture_from_my/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji xt4 - 16-80mm, f2! this is a picture from my parents' village! -----> location !!!  - negovanovtsi, bulgaria.", "sortedWord": "None", "identifyer": 87143, "doc": "b'x\\x9c\\xbd\\x97\\x0fL\\x1bU\\x1c\\xc7\\xdb\\xb1?:\\x13t[D\\x05\\x05\\xdd\\x1f\\x99\\xdb`0&.3]\\x02\\xd4\\xf1\\xaf\\x94\\x13*\\x7f6\\x06\\\\\\xdbk9\\xd6\\xde\\xdd\\xee\\xdd\\xf1\\xb7\\x04\\xd4\\x98H\\x80\\x05\"\\x92(.\\x8ekKY\\x80\\xa1\\x98\\t\\xdb\\x9c\\x02\\x01C0uD\\x16\\x19:F\\x06\\xd3E\\x05I\\xe6\\xc2\\x96e\\x88\\x07\\xbdg\\xe0\\xc5\\x0b\\xa0f\\xbf\\xa4\\xfd\\xf4w\\xbf\\xeb\\xfb\\xbe\\xdf{\\xbf\\xbc\\xdf]\\xb9+\\x8f`\\x01IS\\xf6\\x90\\xe0P\\'\\xceq,8\\x15\\x11\\x15\\x1b\\x17\\xafI\\xd0&bne\\xaf[\\xd9\\xe7V~\\xdd\\xc8\\xd1\\xc7\\t\\n\\xf4m\\xac\\xde\\x80;\\xd3\\xce\\xb2\\xf5\\xc1(\\xb3\\x15\\x1e\\xdbtp\\xb8k\\xe2\\xed\\xd0\\x1f\\x93\\xe3\\x03\\xb7\\xce|\\xd9\\x8c\\xafQ,5%Bh{\\xbb\\xae\\xdf\\xdf\\xba\\xbf\\xe3#\\xe8{_v\\xe5k\\xa6Jw\\xa0\\\\\\xa9\\xce:\\x89s\\x92\\xc9\\xe9\\x9c\\xfb\\xf4\\xc3\\xf7}\\x14\\x1bJQ\\xe2R|\\xb6\\xea\\xfb\\x01\\xb7\\x9f\\x82\\xbd$M\\x18\\xd5Y+\\xa3\\xf3]k\\xf0W\\xb5\\xe5\\xees\\xd0\\x8fr\\xde?\\xd4u\\x05?\\x88\\xf2\\x98\\x14\\xcfx~K\\xe7o\\xb6?\\xb8\\xb4\\xa6\\xa1\\xf6\\t\\x10\\xd8\\xee%]\\xaf\\x92t\\xbddt>\\x7f4\\xa0\\xfe\\x9d\\x8e0\\x9f\\xe5\\xf21HqH\\x98\\x0f\\xdc\\x87*\\xc4Gu\\xfa\\x91\\rs\\x8d\\xfa\\xdc\\x886\\xfa\\xf5\\xa1D\\xf3\\xb9(\\xa3\\xf3\\xe7\\xdcR\\x93\\xcbg<#\\xab\\xc2t\\xb42\\x03%\\xaa\\xa3\\x19,\\x99v\\xf4\\xde<\\x81\\xea@[N\\xe7\\xbc\\x8foE\\xd5\\xd4\\x83m(q$.W\\x07s2\\xf9L{\\xd5\\xb6\\rz\\x17\\x0fA\\xff\\xc5_n\\xb9g\\x07\\xba+PfKqX\\xd7\\xef!\\xfb^\\xba\\xcc\\xba\\xa1u\\x9d\\xed?~\\xbdu\\xfd\\xc0m\\x940\\x1f\\xa1\\xa7E39R\\xda&\\x97\\xcf\\xac\\x8c\\xce\\x9e\\xa4\"SV\\xe6\\xbbp\\xf9\\x15\\t\\xbb\\xeb\\xaa\\x06o\\xb6\\xfb\\xa1\\xcc\\x92\\xe2\\x1f\\x8c\\xdb\\xfdJN\\xdd\\x18j\\x95\\xd1\\x91;\\x0f\\xf8;\\xd3cA\\x97\\xf9-\\xd0\\x8f\\xec\\x9c|\\xca\\x98\\x97\\xb6\\x17rf\\xcc\\xe9\\xdf\\x12\\xe2S\\x9d*\\xc57\\xcfn>s-5\\xb6\\x1b\\xd6\\x01\\xaa\\x03\\r\\xcd\\'c\\xf8\\x0evt\\xf2v\\x1a\\xf4w\\xc5\\x9bg>\\xfbi\\xb7\\x13\\xe5\\x11$\\x9f\\x8f\\x97\\xc9\\x07\\xd5\\xe9I\\xadK\\xf1=i(\\x84\\xbe{b*q\\xf2\\xf1\\xabe(3\\xa4x\\xfb\\xf6\\xfe\\xe8\\xe6C\\'\\xae\\xd4\\xca\\xe8\\xac\\xb4\\x0e\\xce\\x84\\xa5\\xed,\\xb1\\xb7YP\\xbe!\\xc5\\x03L\\x99S\\xfb\\xf4\\xbfo\\xba\\xb8\\xca\\xbaF\\xcf\\x83\\xb6\\xe6\\xee\\'\\x8a\"wz\\xa1\\x84u\\x10\\x83}\\xbb\\xad\\x1f\\xd7\\x1f\\xe8\\\\\\xe5\\xba\\xc5\\x16\\xa7\\x0ew=\\xdb\\xfe\\n\\xf4?\\x89\\xb8t\\xb7\\xcd>w\\x1a\\xd2_w/\\x8e\\xa9\\xfbB\\t\\xd7\\xadX\\xf3\\xdc\\xd3\\xeb^\\x1f\\xdb(\\xa7\\x03}T\\xe7\\xb1\\x82\\xba\\xf0\\xf5\\x17\\x1ey\\x06\\xfa\\xa3\\xdf\\xd8\\xaa~\\xd6^\\xa8G\\x99)\\xc5\\xe3$z?\\x19\\x16\\xc4\\xdc\\xadd\\xfe\\xed\\xba9_\\xfa\\xa1e\\xc7\\xd5\\x805(\\xd1:\\xe8\\x90\\xc9\\xe7\\xc1C:\\x0f\\xee\\xad\\xf0<(o\\xd4\\x85\\xb6Uj^E\\x89\\xe6#\\xd7\\xb7\\xa1\\xbf\\xdc\\xf3\\xc1\\x7f\\xed\\xdbr\\xf5\\x86\\xf6\\xedc\\xf9\\x85o\\x15\\x15\\xd8n\\xa1\\xcc\\x96\\xe2\\xf0\\xbc^\\xed\\xb9\\x83\\xe6\\xf3\\xb0\\xfaO\\xeb\\xaf\\x8ep]\\xc8\\xa8\\x0e%\\x9a\\x0f\\xda\\x7f\\xcaV\\xd9\\x7f`=\\xa1\\xfc\\xbf\\xfbO#`p\\x03\\x01z}\\x95\\xca\\x85\\x91\\x94\\n\\xa5\\xc7<\\xbf\\xe6\\xf7\\xd9e!(3\\x97\\x03z\\xd7\\xfa\\x8a7\\xb8\\x00\\xc7\\x92\\x94\\x19\\\\S\\xa8N7\\xbc\\xd0\\x10\\xd8\\xb0\\xa7!\\xa8!X\\x08\\r\\x17\\x0e\\x844EE$\\xa9c\\xb5\\x11\\x1a!J-\\xa8u\\xe7\\xd5\\x84\\x89\\xa4H\\x8eP\\xc5RF\\x1b\\xc6\\xd2\\x94\\xae\\x90!T\\x11,g\\x8f\\xc6^s\\xc4\\xa4c1B\\xacv\\xe4\\xe5\\x04\\x9a6.\\xdc\\xa2\\xe5\\xadz\\x82U%\\x8b\\xe3\\xdb0\\xf1\\xb9\\x9a\\xa6Ta6\\x9d\\xf8\\xe0L\\xa80\\x96\\x00\\xb6\\x14\\x82\\xd5\\x1f\\xa6Y\\xab\\xea0I\\tZ\\xad]\\xab\\xc5\\xc4Or\\x8b\\xf8\\xbf\\x85\\x91\\xa3p\\xd6\\xd8,\\r\\x82Yx\\xb6y\\xd1\\x80#\\xbb\\xfea\\xf4P\\x1bF\\x03\\xa0J\\x17\\xc7\\xfe{z\\x18\\x0b:\\x97\\xdc\\n\\x03j\\xc2jOL\\x8a\\xb6c\\x89\\xc9\\x0e,\\t\\xdb~\\x16\\xe3)\\x03\\xe7\\x11\\xa6\\xad\\xd6E\\xae\\x1a\\x079\\x8b\\\\Q\\x8ct$%&\\xea\\xec\\xc9\\xe9\\t\\xf6\\x94\\xc8#\\r\\xb8\\x13g\\x18\\x1a8\\xe6_\\x18\\x04=\\xd1\\xa4\\xe7-f\\x9c%q\\x87\\x01\\x07D\\x93\\x81\\xb624O\\x19\\xedF\\x82\\x13L\\xfb\\x1c&\\x96\\xb6:L|.)\\x90\\xa0\\xc9B\\x1bpN|\\xe1\\x10\\xacV\\xc1Z\\xd8B\\x11f:\\x0f\\xa7\\xe8<\\x0e\\x90N\\n\\xf0\\xfa\\xdcF\\x8a\\xb7Zic#\\x83\\xb3\\x04\\xc5\\xb9<\\x00.\\x864p<K8\\x18Z\\x9f+~\\x01\\xe0`X\\x82q2\\xf3\\xb3tp9$p\\xe5\\x91\\x16\\x0bn&\\xec\\x05\\xdc~q\\x1e\\x1c\\xa8)s\\x9a\\xc4\\x0b\\xa0\\xe6\\xcd\\xf6\\x1c\\x1cd\\xf1\\xd4q\\x8a\\xce\\xa7\\xb2<\\x05\\xd3\\xd3,\\x92\\xca2\\xb34\\xcf\\x80\\x9a^e\\xf5_\\x8d\\x15V\\xbc'", "year": "2021"}, {"Unnamed: 0": 196083, "autor": "lungbunny", "date": 1611005934000, "content": "Fuji XH1 - XF16-55, ISO 200, 1/200 @ ƒ/5.6. August 2019. Location: 66°06'43.8\"N 23°06'25.1\"W", "link": "https://www.reddit.com/r/fujifilm/comments/l04hnt/fuji_xh1_xf1655_iso_200_1200_ƒ56_august_2019/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji xh1 - xf16-55, iso 200, 1/200 @ ƒ/5.6. august 2019. -----> location !!! : 66°06'43.8\"n 23°06'25.1\"w", "sortedWord": "None", "identifyer": 89069, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q.\\r\\xf6\\xc4\\xa5\\x11\\xeb\\x8af\\xeb\\xa1\\xd3\\t\\x0c\\x10 hu\\xfd\\xc0\\xe3f\\xc3\\xdb\\xc1\\xde\\xeaJ\\xdf\\xf6\\xadNdb@\\x05\\x8ch4\\x0c\\xe8\\x1f\\xb8\\xf7K\\xc9d\\xfb\\x1c\\x18\\xff\\xa1qs\\xd5\\xc6\\x98\\xf3u\\xe84\\xba=\\xf3\\xa0\\x06\\xa1\\xdb\\x03\\xe3\\xff\\x87\\x02\\\\\\xf6l\\xdd8k\\xaa\\x18\\x03{=:\\x9d\\x08\\x95\\xff\\xdb{\\xed\\xd4Yi\\x86\\xa2\\xbd8\\xec\\x81\\xf9\\x03\\xdd\\x9eKk\\xf5\\xf6O\\xe9<\\xbb\\x15\\xc6\\xb7\\xcf\\x97\\xdc\\xb1Q\\xe4\\x91\\x06:\\x8d\\xee\\x1f\\x9f\\x0b\\xb5\\xef\\x97\\x1cyR\\x88n\\x0f\\x0c\\xd0\\xda?\\xff\\xd1\\x00.\\xff\\xb8\\xa6\\xf4)\\xb3\\xde\\n\\x9a\\x85N\\xc7B\\xe5c\\x14\\x84w\\xbc\\xae\\xf9\\\\\\x12\\xb1\\xe2\\xf2\\xa6\\xc7\\xc5\\xea\\x9b\\xd0\\xed\\xf9\\x87\\xc3\\x9em\\x9c\\xf2\\xb3[\\xb7\\x1b\\x8b\\xc1\\xf8;\\xc5\\xa4\\xba{\\xdf\\xfeQF\\xa7\\x13\\xd1\\xe4q\\xf9\\xe7/\\x0e{\\xde3OY\\x7f\\x81\\xaf\\xfa2\\x8c_\\xf8J\\xf2\\xa2p\\xeb\\xff[\\xe8t\\x02T\\x9ePz\\xfb\\x83\\xc3\\x1e\\xf4\\xf8\\xf9b\\x9a\\xd0\\xf2\\xca\\xc5\\xcc\\x1a\\x9d\\xc6\\x15n\\xccP\\xf1^F\\xfc\\xf1C\\xedp\\xc3\\x15?\\xe8\\xe1\\x96\\x9e\\xdb\\xb9\\xe8\\xbf\\xdd\\x8fFt\\x1a\\xdd?k\\xa0\\xf6\\xa0\\xfb\\x07W\\xfc\\xa0\\xfb\\x87\\xbd\\xa1\\xcb\\xff\\x12\\x97\\xa89:\\x1d\\n\\x95\\x97O\\x8b{k\\x94\\xf4Np7\\x89\\xf1s\\x02\\xad :\\xb7s\\x1d\\xef\\xb1\\x825\\x05\\xe8t\\x02T\\x1e\\x96\\x0e\\xb6\\x93\\x98\\x7f\\xd0\\xd3\\xc1\\xa2Ck|\\xde\\xdc\\xac_\\x8fN\\'\\xa2\\xc9\\xe3\\x8a\\x9fo8\\xec\\xd1\\t\\xaaJ\\x8b\\x8f\\xeb\\x80\\x05?\\x03\\xfb\\\\\\xd1\\x9b\\x8e\\x17\\\\6\\xa3\\xd3\\xe8\\xfe\\x81\\x95;\\xb0\\xf8iG\\x0b\\x17B\\xe5\\xf5\\xe5k\\x19\\xab\\'Ms\\x16B\\xa7q\\xa5k\\x98y\\xed$\\xa6kJ\\xc3\\rW\\xbaF\\x0f\\xb7\\xcee!\\x86\\xeb{|\\xac\\xd1\\xe9\\x18\\xa8\\xfc&\\x95\\x13\\xee\\xab\\xed\\n\\xaf\\x10*\\xaf\\t\\x85\\xdb4n\\x9du\\x01\\x93\\xb9\\x17\\xa0\\xd3\\x89h\\xf2\\xa4\\x96\\xd7\\xe8\\xe9\\xba\\xef\\xb3\\xfd\\xfa\\xdc\\x12\\xc5Ft\\x9a\\xd8r\\x07W=\\x87\\x1e?M\\xd72\\x8bM\\xb2+\\x02\\xd1iX\\xb8U\\xfb\\xc8J\\xb0\\x06\\xde\\xe7\\x9a\\x8cf.\\xa1\\xf2\\x80\\xbbb\\x9a\\x19\\xdb.\\x0eI\\x18\\xff9G\\xebiO\\xe1-\\x9f\\xd1it\\xffL&1\\xdc\\xd0\\xfd\\xe3\\xd2w\\xbf\\xf9\\xeb/\\x8fjt\\x9a\\xd8z\\x8e\\xda\\xe1\\xb6\\x86\\xc4z\\x0e=\\xdcrz4\\x13O.=\\xff\\x16\\x9d&6\\xdcp\\x95\\xa3\\xe8\\xfeYV\\\\\\x90\\x98\\x9cZ|D\\x92\\x91\\x11d\\x12\\x90`\\x04c\\x06\\x10\\x04\\x87\\xca\\xf2\\x9c\\xd4\\xbc\\xf4\\x92\\x8c\\xe2#, \\xc7-/.)\\xca\\xccK/\\xbe\\xc3\\xa0\\xbb`\\xa1\\xceB\\xdd\\x85z+\\r\\xcc\\xd4\\x8dL\\xf5\\x0c\\x95\\xcaA,\\x13c=\\x0b\\xa5\\xbc\\xa5\\x86\\xfaF\\x06\\x06\\x8b\\x81x\\x89\\x91\\x81\\xa1\\xe5\"#\\xe3E\\xa6\\xa6\\x8b\\xcc\\xcc\\x16Z-tX\\xe1\\xec\\x18\\xe4\\xe2\\xe9\\xe7\\xe8\\xb3\\xc8\\xd9e\\x89\\x8bc\\x88\\xeb\\x12\\x8f\\xc8\\x00\\x8fE\\x9e~\\x8b\\xfc\\xfc\\x16\\xfb\\xf9\\x05\\x00q\\xf0\\x1a\\xbf\\xd2\\xdc\\x90\\xca\\x82T[\\xe7\\xc4\\xa2\\x94\\xd5@NRj\\x91m@Ni\\x11\\x8c\\x1d\\x0ct\\xc3\\xba\\x80\\xd2\\xbc\\xe4\\x12\\x88\\xb2\\xfc\\xdc\\\\$\\xaeKbq\\x06\\x127 \\xb5(sI\\x90\\xbf\\x7f\\xc8\\xd2\\xc4\\x82\\x82\\xfc\\xe2e\\x89\\xa5\\xe9\\xa5\\xc5%+\\x92\\xf3s\\x0b\\xf2K\\xf3R\\x16\\xa7\\xa4\\x16,I+\\xcd\\xca\\\\\\x9cY\\x9c\\xbf\"\\'?9\\xb1\\x04\\xd8\\xd0^\\x91W\\x90\\x98R\\x96\\x9b\\x9f\\xb2,\\xaf4\\x17H-)\\xc8O\\xcaZRP\\x94Z\\xb0\\xb4\\x00d\\xf2\\x92\\x8a4C\\xb3\\xc5\\x15\\x19\\x86\\x8b\\x0emXvl\\x92\\xbe\\xa9\\x9e\\xd9\\x12\\xa0\\xce\\xe2\\x89\\rK\\xd3r\\x12\\xd3\\x8b\\'6n\\xcaH,\\x8e/\\xcd\\xcb\\xce\\xcb/\\xcf\\x8b\\x87\\x04\\xf3\\xa1\\xd5@:/>\\xbd(\\xbf\\xb4\\xa0x\\xe2\\x11\\xc6\\t\\x00\\x1c)\\x03\\xa3'", "year": "2021"}, {"Unnamed: 0": 196482, "autor": "FunFunFunction", "date": 1635289695000, "content": "Best medium format youtube channels (ideally Fuji)? /!/ Hey everyone. I was curiousnif you were aware of medium format photographers with YouTube presence.\n\nI love Thomas Heaton and he has some videos featuring the GFX camera. Any others?\n\nI'll take everything and anything - gear reviews, on-location shooting, vlogs, tutorials, etc. \n\nIdeally Fuji but honestly open about other brands. Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/qgirjc/best_medium_format_youtube_channels_ideally_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "best medium format youtube channels (ideally fuji)? /!/ hey everyone. i was curiousnif you were aware of medium format photographers with youtube presence.\n\ni love thomas heaton and he has some videos featuring the gfx camera. any others?\n\ni'll take everything and anything - gear reviews, on------> location !!!  shooting, vlogs, tutorials, etc. \n\nideally fuji but honestly open about other brands. thanks!", "sortedWord": "None", "identifyer": 89488, "doc": "b'x\\x9c\\xd5Y\\tT\\x14G\\x1a\\x06\\xef\\xd5x\\xe0\\x1a5\\x9e\\xc4;D.\\xa3>\\x9e\\x1b\"W\\xc0A\\x8eq\\x06O\\x8c\\xd03Ss\\xc0L\\xf7\\xd0\\xdd3\\x88\\xe2z\\xe7I\\x8cF\\xbcO\\x94\\xb9\\x18\\x04\\x8f\\xe8z \\x8aG@]]\\x0c\\xf1f%\"^1\\x060\\xab.\\x1e\\xd1\\xb8\\xcd8\\x85\\xf0oz\\x9dy\\xc3\\xe6\\xbd4\\xaf\\xeb\\xeb\\xbf\\xfe\\xea\\xfa\\xf8\\xab\\xfe\\xfa\\xff\\xaa\\x9e\\x8c\\x1c=\\xa2\\x19\\x15E\\x1a\\xfd|\\xfc\\xcd\\x04\\xcb\\xd2\\xcc\\x96\\xe0PA\\xe4\\xf8\\xa8\\xe8\\x98Xa\\xa9{q\\xa9{I\\xa9\\xfbI\\x0bK%#\\x92)\\xf1\\x9c7\\xf5W\\xf75S}\\x8fL\\xc2x\\xed\\xd8\\xf1\\x0b\\xea\\xefBc\\xe3\\xdc^_\\xe8\\xe0\\x1ea\\x9f\\xea#\\xffX\\xe9\\xfeZn\\xe1\\xd6\\xf4\\xc2\\xb2;\\xa8_vyzj\\xe4\\x8d\\xa2\\xf6X\\xee\\x91{\"#\\xeai\\xc4\\x18\\x88\\x98\\xa7|g\\xab\\xe2%\\xa7\\xd2V\\xf2\\xf1\\xe0\\xfe_\\xd9/\\\\\\xafx\\xd5\\xbbo\\xf6\\xf9\\x01\\x0c\\x96\\xe7}S\\xfa\\xe1\\xe0\\xc0\\x13\\xd1\\x10\\xa7\\xdb\\xf5{\\x06\\x9d\\x8e\\xc8\\xfb$\\xe5\\xa2x\\xfc\\xd0\\x01uEy\\x04\\x9f=\\x90\\xc7\\xf7\\xd8\\xf5\\xe7\\x03F\\x1e\\xd8\\x8ceQ\\x16\\xb9X\\xb8}g\\x1f\\x88\\x8e\\xf2\\xf0\\xd9\\x03y\\x96V=S\\x06\\x9d\\x92\\xf7\\xc3h=\\xf7\\xe3\\xdc\\xc8/\\xeaT\\x98gvT\\xdf\\x9e\\xad\\'T\\xb6\\x8f*\\x9b\\xf3\\xc0T|;\\x05\\xf2\\xe0\\x0b\\xf2t\\x98\\xb9vt\\x9bC\\xed\\xde\\xc3\\xf2\\xfe\\xef\\xf6kK{\\xcawA$\\xec\\xfa\\xcec\\x991\\x7f:\\xa1\\xaf9\\xc23?\\xaf\\xc0\\x85\\xeb\\xc9\\x9b;W\\x95\\\\<\\xf4=\\x96\\xcf\\xca\\xbcW\\xc7\\xae\\xd9T\\x06q\\x92]\\x7f\\xb3\\xf0\\xb6_\\xb8\\x87\\xa0\\xc5\\n\\'\\xfd\\xe04p\\xc0\\xb6\\x84y\\xcaNz\\x93\\x0f\\xc4D\\xbb\\xdec\\xcc\\x95c\\xb7\\x16\\xfa_[\\xc5\\xc3\\xf3\\x92\\xc7\\x1e8?\\x9bJ\\nge\\x1c\\x15\\x8d\\x82\\x88\\xc7\\xed\\xdd{\\xad\\xd6n[\\x150\\x80o\\xdc^\\xf0\\xf0\\xb4\\x1eu\\xaajm\\x1b&\\x01\\xcb\\xe1\\x92\\xc9\\x0b\\xd5Le\\nD\\xccc8\\x91\\x1fU]>w\\x17\\x1f\\xcf/<<\\xc3E\\xb3\\xe4\\t3\\x96|\\x86\\xe5\\'}.j\\x13\\xbb\\x9c\\x7f\\x0f\"\\xe4y\\x9b\\xbf\\xc1x\\x00y\\x1e^*L!\\x16\\xcf\\x9a\\x021\\xde\\xae\\xcf\\x1ci\\xea\\xa6\\x12\\r\\xf26\\xbf\\xc5\\x0f \\x0f\\xf4\\x83\\xd2\\x89\\xe7\\x1e]\\x8e\\xda\\xcd@\\xc4\\x03\\x8b\\xd7\\xa9\\xb3\\xebgHReP7\\x7f\\xcf\\xedX\\xc6\\xe3\\x02\\xd1\\xd1\\xf9\\xe1[?p\\xdc\\xfa\\xf7\\xaf\\xd4\\x0eZY\\x14\\x8e\\xf1\\xe8\\xa7a)\\xaf\\x0e\\xf6\\x08\\xc6\\xf6T\\x0c\\x1e\\xeb\\xebY\\xf7\\xf9\\x91\\x1dN\\xc6\\xeb\\xda\\x98\\x82\\xfb\\xd5\\x9b\\x9f\\xe8\\xb1\\x9cx\\xbf\\xb0\\xfd\\x84\\x1fwg`\\xac\\xab4\\xf7\\xcb\\xf7\\xeb\\xbeb\\xb2]\\x7f/`\\xf6\\xbe\\xc5\\x12\\xaaf\\x8d\\x93\\xeb\\xf4\\xeea\\xb7\\xcaDkx8\\x96\\x07iF\\xb7\\xbb=l\\xfd\\x9f!\\xca\\xec\\xfa\\x15\\xd5s\\xa3\\x03\\xc2\"\\xdfuv~^\\r\\x89/\\x0b\\x9au\\xa5\\x0c\\xcb\\x9f\\x85\\xfc\\xbc\\xff\\xb8\\xfe\\x9c\\n\\xa2\\xa3\\xe3\\xc6g\\xcf_M[\\x16nx\\x1a$\\xc5r?\\xa9\\x8fa\\x93\\xf9\\xfc\"\\x8c|\\xe3\\xb6\\x9e\\x87\\xe7W\\x1e?\\xd8\\x98_\\xbe\\xfb\\xd2L:\\x12\\xcbQ\\x01\\xab/G\\'\\x9c\\xfe\\x1e\"\\xcc\\xa7\\xcb\\x9d\\xf47\\x98O\\x8b\\n&\\x9e\\xac\\xaa\\x1a\\xff\\x0e\\xc4\\x89v}\\x7f\\xf9\\x8c\\x9a\\x11\\x92Z\\x8fB\\'y\\xe0:\\xfd\\xa3\\xec\\x0f\\x1c\\xcd\\xdb\\xb5g[\\xe6\\xb4\\xaa\\xb3,\\xc5He$\\xd5\\xc6$\\x1cJ\\x84y\\xfb\\x80\\x93\\xf9\\x07\\xe6m\\x92\\x9eg\\xfa\\xf8\\xfc\\xd6\\x1d\\x10\\x9b{~\\xf8\\xf6;\\x89v=\\xce\\xa7\\xae\\x8e[\\xf1\\xfa=\\x922\\xa6`\\x11D\\xc8\\xc37n|\\xeb\\x07\\xf2\\xb8\\x1a\\xaf\\xff\\xcd\\xc3\\x03\\xe3\\xf5\\xf2\\r\\x05\\xb2\\r\\xf2M\\xef@T\\xd8\\xf5t\\x87\\xc5\\x17b#\\xf2\\x12\\xb2xx\\xe0\\xf8\\xe1\\x0b\\xce\\x8f\\xaby\\x81o~`^(\\xd9\\xb7d\\xe8\\xc91\\x89\\x1fA\\xc4\\xf1z\\xc3/\\xe2\\xe1\\xf1\\xec\\xa2\\xb9G\\x9d\\x9c\\x9fq[>\\x17~[\\xdba(\\x96G\\xaa\\x13\\xc3v\\xca\\x0b\\x17BL\\xb4\\xeb\\xa1\\xbf\\xb5\\xb4\\xd7\\xa7\\xbb\\xffo{\\xa0\\x1f\\xb4\\xdc\\xb6i\\xd5\\xde/\\x04\\x12\\x88\\x90g\\x1b\\xe8\\x17\\xf38\\xeao\\x97\"*\\x86~\\xe9\\xfdu\\x7f\\x88S\\xedz/\\xef\\x19\\x92\\xe0\\x81\\xe5\\x8f\\xd69\\xbb\\x1f\\xb5\\x8e\\x15\\xcc\\x88.\\x1f\\x82\\xe5\\x82\\xf8\\xad\\x0f\\xfc\\xff\\xf9\\xb4;DW\\xfd\\x80Z\\xa1\\xbf\\xf7\\xf2Qu\\xc3~\\xe7\\xae\\xae\\xa8\\xe3s\\x83\\xc8\\x03c\\xd7s\\x87n\\x8e}r\\xf7,\\xf6\\x83\\xae/\\xbb\\xe6VL\\x16\\x1c\\xdf\\xe8\\xe4~t\\xfa\\x95\\xc7\\xc2\\xf8\\xea\\x87S\\xb0\\xacP^\\r\\xf3<:\\x84\\x808\\xcd\\xae\\xdfp\\xd3\\xd8{\\xce\\x96\\xaa\\x0b[]</\\x08\\xe7\\xf9\\x95\\x19\"_\\x1e\\xc6\\xe8\\xaf\\xe8\\xb8\\xba{\\xcf\\xe7\\x010^os\\xd2\\xafa\\xbc\\xf6j\\xb3\\xb7*:\\xe5\\x87\\n\\x8c\\x8bP\\xc1\\xde\\xa0NWo\\xc1\\xfd\\xce7N\\xc6k\\xb8\\xdfY\\xb9\\x91\\x19e\\x91wR@tt\\xdc\\xf8\\xce\\xc1\\xb5\\xeb\\xbaL\\xbfqp\\xff3,\\xd3\\xa1z\\xe2\\x80W\\xcf\\xad\\x10\\x13\\xed\\xfa\\xe6\\xca\\x0b\\x99\\xad\\'.\\x08{\\xf2\\xf1\\x00\\x880o\\xf3\\xcd\\x8f\\xa3\\xe79W\\xf3\\xc23\\x1e\\x1e\\x98\\x17n\\xe7\\xae\\xac\\xda7}\\xe6~\\x88\\xce\\xfa\\xf5\\xdb\\xf2\\xc2\\xed\\x03w\\xda\\n\\x06\\xb6-\\xc18\\xd8}m\\xe7>\\xe2\\xb8.\\xcd\\xfd\\xfd\\xc0\\xd5\\xf3)\\x9f_7w>\\xc5y\\xe2\\xff\\x9dOy\\xd7\\x0f\\xc8\\xa7\\x93\\xb3\\x14\\xb7r{\\x14\\x08;\\xf5\\xcaj\\xd9+\\xd3\\xe3W,\\xe3\\xf3B\\xd7\\xb5}\\xf6\\xef\\xde\\x11[\\xe5\\xec9\\xcbJj\\x9ex\\x85d\\x9c\\xc1\\xb2\\xda\\'xA\\xcd\\x8b\\x80\\x19\\x10q\\xdc\\x99q \\xed|\\xff\\xf2.%\\xce\\xfaAY\\xb8H\\xfd\\xaf\\xe7\\xa9\\x01X\\x0eX]ull\\xc5\\xba\\x05\\x10\\xe1y\\x9bo\\x9d\\xf2\\xf9\\x01<o\\xbb\\x9aO\\xf9x`>}|*\\xffoW=RVA\\x84\\xf68\\xfb=\\x11\\xda\\xb3\\xef\\xeb\\x8dk\\xba\\xbb\\xb5\\x9d\\x0b\\x11\\xaf\\x9f\\x97\\xcb.\\x9f)\\xed\\xedF\\xf3\\xad\\x1f>?8\\xbf\\xc3\\xe7\\xe8\\xea\\x8c\\xd2}X\\xbe\\xe0\\x119fD\\x9c\\xbf\\x00\"\\x8c\\xa3|y\\x9b\\xef{\\x15\\x8c\\xa3\\xba\\x17w\\xd9\\xbd)\\xb1w0\\x06U\\x07\\xa6=\\x1d~5\\x1e\\xc6\\x1dg\\xf7\\x070\\xee\\x14t\\xef\\xb5tY\\xcd\\x8b\\x81\\x10\\t\\xa0w6\\xee<h\\xb9zWY\\xa7\\xd9\\x17\\xb0\\\\8\\xbahV\\xdf\\xac\\xf0\\x18\\x88\\x8e\\x9e\\xb3\\x9e\\xf2\\xf0\\xc0\\xb8\\xe3\\xaa\\x1f\\xf0\\xd9\\x03\\xfd \\xc3\\x12\\xe7\\xbf\\xeb\\xcb\\xa8\\xbf@\\x84~\\xe0\\xea9ka\\x84_\\xf1\\x8d9\\xf3\\xb2 :\\x9a\\xb7\\xf9\\xceY\\x90\\xe7\\xf7\\xf2\\x03\\x9d\\xe6\\xef_\\x9d\\xfc\\xc4\\xab\\x08\\xe3\\xc9\\x82\\xaf<W=O\\xaeu\\xd4\\xaf\\x1d\\xdd\\'\\xfe^\\xf6x]\\xad|\\\\\\xf7s\\xc2\\x1d\\x8cG\"<\\xaa\\x97~;a\\xd0\\x1f\\xd5\\x9e\\xf9\\x1e\\xd7\\xf2\\x0e]\\x1d,\\x84\\x88\\xec\\xfa\\xc5\\xcfz\\x1f\\xdc\\xba\\xb6\\xe8\\x92\\xb3\\xf6\\x14h\\xfc\\xdd\\xfd\\x9e\\xb6\\xab\\xc02\\xdf>\\x11\\xf2\\xf0\\xd9S\\xeb \\x8f\\xab\\xfb\\x9d\\x1a\\x1e\\x1e\\x18w\\\\\\xfd]\\xa6\\xdaA\\x1eG\\x7f\\x97\\xe1\\x8b\\x07?\\xf1\\xf0\\xfcW\\xfe\\xc9\\xf3\\r\"\\'u=\\x03\\xb1\\xb9\\xf7\\x07Y/\\x95\\xba\\x0f\\xafo~\\x04\\xb1\\xb9\\x7f\\xcf\\n\\x1a\\x1e7\\xb8\\x97{\\xb4\\x16\"\\xdc\\xbf\\xf1\\xf95\\xdf\\xf9\\x07\\xee\\xdf\\xd4\\xe3W\\xcc\\xe9\\xfbC\\xb7\\x8e\\x10\\x9b\\xfb{\">\\x87@l\\xee\\xef\\xbd\\xf3\\xa7y\\xff\\x94\\x17h\\xf1\\xc4\\xf8A\\xe7\\xfb\\xa3\\xe2\\xc9\\xfe\\xa3\\x1c\\xfd\\x0e\\xebh|s\\xf5\\xdcx\\x9b\\x87\\x07\\x9e\\x7f\\xc4^\\x0f\\xacC6\\x0cO\\xc68Ll\\x15\\xbb\\xb5\\x98\\x9a\\xee\\xecy\\x0e\\x9e\\x7f\\xa0=\\x89\\xfdn^\\xdf\\xd1\\xe6\\xccC\\x88\\xcd}\\x9e\\xb30ZB\\x8a\\x98b\\xa1{\\xfdU\\xffo\\xd9\\xa0\\xf1\\xe5\\xe6\\xd6Dv\\xb3\\xd5\\xb85H\\xf5\\xb64\\xfc\\xbd\\xa9\\xccQ#R\\xc1*\\x99\\xe2VB\\xaeu\\x0e\\xc3\\xd2*R\\xc1T\\xb8-\\xdffh\\xdf>\\xfb}\\xe3P\\xb5:{X\\xf6\\x07\\xd9\\xc3\\xb3\\xbd\\xcd\\xdeQ\\xa2\\x10\\xae\\x14qe\\xb6\\x8f\\xd1\\xf7}\\xdf\\xec\\xb1\\xe5\\x83\\x82\\x19-\\x92\\xb2\\x81B\\x9aR\\xa4\\xc7!\\x92A\\xdc#b\\xd2\\'!Z\\x12N\\xd1\\x9a@!A\\xb3\\x86\\xd0\\xd0\\xf2\\xd1\\xa1\\x04\\xa7\\x8b\\xa14\\xe9\\x11\\x88\\x94!:0\\x9a`\\xa4\\xe91:\\x8d\\x84{\\x16s\\xa4\\xe9BD3\\x14\\x19\\xf8Q:\\xd7\\x17\\x19\\x97\\xa6\\xad\\xef\\x89)\\xf7jx\\xef7\\xda\\xfa7i[\\xd4\\xd0\\xd4\\xae\\x1e\\xd1D\\x9d\\x1fJ\\x91I6!T\\xa35\\x84\\xc5\\x15\\x84!\\xb9\\x8aT\\xb1(\\x90{x\\xd32\\x98f\\xb7\\x87!\\x05\\x8d\\xb8\\x97(\\x06?\\x8auZC\\xf8\\xe4<\\xce$\\xa4R\\x90\\x81S\\x11c\\x1a7U8.[`\\x10\\xc4\\x18\"#\\x8d\\x91\\x91bCtX\\xf9\\xa8h\\x8a\\x92\\x05\\nH\\xd9o[f\\x1f \\x82a\\xdf\\x0cP\\xb8\\x8at\\xf0\\xb5&\\xe3Z\\xff\\x9ag\\xc3k<\\x1d\\x1bbb\\x8c11B\\xee\\x16\\xe7\\xd9{\\x16\\xaaut^#\\x96\\x83M\\x18\\xf1 p}Z\\x84\\x9f\\x8a\\xc4\\xb11F\\xa1HxX\\xa8#\\xa5\\xacX%C\\xf5\\x9d\\xa6\\xdb$[\\xb3\\x10Z\\x9a\\xdcH) U@\\xb9\\xf3\\x8d\\x18Ji4\\x8d\\xc40\\x82Q6\\x129[U\\x06Q\\x88I\\x14\\x1b\\x1bw\\x80\\xc7^\\xc3\\xc4q\\x86I!\\xc6I!a\\xdc\\x1d\\xc1\\xddB\\xee\\x9e\\x96\\xdf\\xd0D@\\xcam\\x82\\xad\\xc3hJfL\\x10\\x0b\\xcd\\x84\\x84\\xd2\\xb1FB\\xaa6\\x13RJ\\xa3\\xb5\\x102\\xbd\\x86\\x92\\x99\\x08\\xae0\\x12d\\xfd\\x9df\\xe5nV\\xc9\\xd9o&\\xb4Z\\x8a1\\x12\\xba\\x99f\"\\x95\\xa0\\x91A\\x82L\\x12\\xc4\\xb0f\\t\\xcd5\\xb5\\xd8J\\xc6(\\xd1\\xb1\\x16)\\xa1A4a\\x90J\\xcd\\xd2\\xfa^s\\xa4J\\x82$\\x91\\xdajG\\xc6Z_K\\xe9H\\x99I\\xca9\\xddv\\xa9\\x8eVQ:\\x86T\\xc9\\x8d2\\xa4\\xe5n\\xd6$\\xa3$IF\\xc4J\\xadH\\x8f\\xe84\\x8aD\\xdbm\\x0f\\xb6\\xff#G\\x8e\\x08VG\\xa3\\xdc\\xd7\\xc8\\xd5X\\xe4\\x9c\\x81\\x04k\\x92\\xeb\\x92T&\\x05\"h\\xa3B>\\xd3\\xa4\\xe0\\xa6\\xdf\\xa8$\\x18\\x93\\x92\\xd0#\\x83\\x12Y\\x94\\\\{\\x8a4*Q\\x9aU\\xc9u\\xc9\\xb0\\xea\\xb4lU\\x0e75\\x84Z\\x9dfR\\x91l\\x92UMI\\tVE\\x91&5\\xa5G\\x16\\r\\x92\\xa9t\\x1a3\\xc9\\xe8$I\\x06Jn\\xe0\\xea)-\"\\xcd\\x14\\xabD\\xb4\\xc5V2\\xf9Z%\\xc5R\\n\\x9a\\xd0r\\xd2\\x8e\\xc6\\x02c\\xd2rV\\x98\\xb44\\xd2Z\\xb9\\x82A\\xa4\\x14\\x99\\xb5\\xf5sj\\xa6\\x91Z\\xaa\\xb6\\xd0H\\xafB\\xa99\\xaf\\x81\\xb12J\\x8ab9kL\\x0c\\xa5A&\\x96HFf\\x96\\x1b\\xb0d\\x8b\\xadd\\x8c\\x1c\\x1d\\xf7Hi\\x08\\xc6\\xca\\xeaX\\x8aV\\x11\\xea\\\\\\xfc\\xc0\\x98\\xf5\\x9c\\x1d\\x94\\xc5V2&\\xbd\\x9aR\\x98\\xeb\\x0b\\xc6\\x98\\xca\\r@*\\xa2\\x91)U\\xa5Vs\\x05\\xab4\\xa6Q\\xba\\x1c\\xeefu\\xdc\\x04r\\xe62\\x99\\xf3\\xccr5\\xa1`2\\xe7\\xef\\xe1\\x86+AG&\\x93T*\\x99\\xf0:\\xa8\\x9e\\xc8\\xe3\\x90LP\\xd0\\x94N\\xcbd\\x16\\xbb\\xaf\\xf8\\x0f\\xeb\\x00p,'", "year": "2021"}, {"Unnamed: 0": 197801, "autor": "romiloff", "date": 1628168755000, "content": "Location: Pomorie, Bulgaria - at the Black Sea. Shoot with fujixt4, 16-80mm, f4 lens!", "link": "https://www.reddit.com/r/fujifilm/comments/oyh55h/location_pomorie_bulgaria_at_the_black_sea_shoot/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "-----> location !!! : pomorie, bulgaria - at the black sea. shoot with fujixt4, 16-80mm, f4 lens!", "sortedWord": "None", "identifyer": 90866, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\xce\\x88\\xcee!\\x86\\xeb{|\\xac\\xd1\\xe9\\x18\\x06\\x08\\xd8\\xa4r\\xc2}\\xb5]\\xe1\\x15\\x9f\\x0b\\xb5\\xef\\x97\\x1cyR\\xc8\\xc4\\x80\\x1d0\\xa2\\xf1\\xf5\\x0f\\xdc\\xfb\\xa5d\\xb2}\\x0e\\x8c?\\x8d[g]\\xc0d\\xee\\x05\\xe8t\"\\x9a\\xfc^\\xa8A\\xe8\\xf6\\xfcG\\x030\\xf1\\x13h\\x16\\x97\\xed-e\\xe2\\xd7r\\x89F\\xa7\\xd1\\xfd3\\x19\\xaa\\x8f\\x19*\\xde\\x00\\xe5\\xff\\xc3a\\x0f\\xba\\x7fv\\x8aIu\\xf7\\xbe\\xfd\\xa3\\x8cN\\'\\xa2\\xc9\\x93\\xea\\x9f\\xf7\\xccS\\xd6_\\xe0\\xab\\xbe\\x0c\\xe3\\xaf}\\xb5\\xc4,\\xc4\\xe0n\\x08:\\x9d\\x00\\x95\\x17\\xb4\\xba~\\xe0q\\xb3\\xe1mJ\\xfd\\xb3u\\xe3\\xac\\xa9b\\x0c\\xec\\xf5\\xe84\\xb1\\xf1\\xf3\\x97\\xc8\\xf8I\\xe3\\xd8h+\\xd0\\xf5j!:\\x1d\\n\\x95\\x97O\\x8b{k\\x94\\xf4Np7\\x0e{\\xfe\\x10i\\xcf\\xa4Y\\xc5\\xa6\\xcb\\xd2\\xf8\\xd2\\xd1\\xe9(\\xa8\\xfc\\xccG\\x8b\\xa5k\\xe7>\\xbc<\\x1f\\x87=0>\\xba=\\xef\\xa6\\x0b\\xc4<\\xd8\\xb1\\xed\\'\\x8c\\xffe\\xc2\\xe7\\xe4\\xf5\\x1bkC\\xd0\\xe9\\x04\\xa8<,~\\x82\\xbd\\xd5\\x95\\xbe\\xed[\\x9d\\x88n\\x0f\\xcc\\xd9\\x84\\xe2\\xe7\\x94x\\xe9\\xb3(6&=t\\x1a=]o\\'1~\\xd0\\xedYth\\x8d\\xcf\\x9b\\x9b\\xf5\\xeb\\xd1\\xe9D4y\\\\\\xe9\\xe0\\x1b\\x0e{t\\x82\\xaa\\xd2\\xe2\\xe3:ba\\xfc\\xc6\\'\\x06<\\xa1\\xba\"r\\xe8t\\nT>n{\\xe5%\\xf9\\x9b\\x02GI-w.\\xb8\\x05\\xe5|\\xfcUn\\x01\\xe3\\xe7\\x155,\\xb1\\xb94\\x7f-:Mlz#\\xb6\\xdc\\t0\\x9a\\xb3\\x81/R\\\\\\x1c\\x9d&6~p\\xd9C\\xedr\\x07W:@/w\\x9c\\x97\\xfe\\xb2;p%\\xd1\\n\\x9d\\x86E`\\x8c\\x82\\xf0\\x8e\\xd75\\x9fK\"V\\\\\\xde\\xf4\\xb8X}\\x13\\xac\\xdc\\xe9F+\\x87\\xd0\\xed\\xd9\\xc6)?\\xbbu\\xbb\\xb1\\x18\\x8c\\x8f\\xab\\xdcI\\x86\\xca\\xc3h\\x98\\x7f`\\xc1\\xde\\x8d\\xc6\\'\\x14?\\xcb\\xef\\x8a=tO\\x91>\\x8aN\\xa3\\xfbg7\\x0e{p\\x95\\xa3\\xe8\\xfey\\x14\\x13\\xdf\\x9d\\x16\\xdd\\x13\\x83N\\xa3\\xdb\\xb3\\x06\\x87=?\\x89\\xb4\\x87^\\xf5\\x8f\\xc0\\x9e)\\xf9\\x97\\x9c\\x12\\x85\\xd0\\xe9\\x04\\xa8<\\xb5\\xca7\\xefI\\x827Nj\\x1c\\xe6E\\xa7\\xd1\\xed\\x99La\\xf9\\x96 \\xf7\\xe8\\xdeZ\\xb6S\\x9f\\xd0ib\\xcb\\xb7\\xafD\\x96o\\xcb\\x8a\\x0b\\x12\\x93S\\x8b\\x8f\\x88\\x03C\\x80\\x11\\x0c\\x18\\xc0\\x18\\x1c&@ryNj^zIF\\xf1\\x11\\x16q\\xa0\\xc8\\xf2\\xe2\\x92\\xa2\\xcc\\xbc\\xf4\\xe2;\\x0c\\xba\\x0b\\x16*.\\xd4Y\\xa8\\xbbPo\\x91\\xa1\\xd9\"\\x0b\\x83\\x85V\\x8b\\x9c]\\x16\\xb9\\x84\\xectIM\\xcb\\xcc\\xcb,I\\xb5\\x052j\\x02\\x8a\\xf2\\xf3B*\\x0bRm\\x1d\\x8bJ\\x16\\xbb\\x07\\xb8.\\xf2\\xf4[\\xe4\\xe7\\xb7\\xd8\\xcf/`\\x8d_i.X\\xc69\\xb1(e5\\x90\\x93\\x94Zd\\x1b\\x0c4{]@i^r\\tD*?7\\x17\\x89\\x1b\\x90Z\\x94\\xb9\"0\\xd4\\xd1/\\xc43$rI\\x90\\xbf\\x7f\\xc8\\xe2\\xe0H\\xdfEaNk\\xc2R\\x8b\\x92\\xdc\\xf2\\x8brm=\\xf3\\xd2\\x96&\\x16\\x14\\xe4\\x17/J,Y\\x9a\\x94\\x93\\x98\\x9c\\xbd\"\\xa94\\'=\\xb1(3qEr~nA~i^\\xca\\xe2\\x94\\xd4\\x92Ei&\\xcb\\xd3J\\xb32+JL\\x96\\x00=X\\xbc\"\\'?9\\xb1\\x04\\xd8\\x1c]\\x94\\x9b\\xbb\"\\xaf 1\\xa5,7?eY^i.\\x90ZR\\x90\\x9f\\x94\\xb5\\xbc ?7\\xbf(3uIAQj\\xc1\\xd2\\x02\\x90\\x9b\\x16\\x17\\xa7&.-\\xce\\xc8\\xcf/Y\\\\\\x92\\x91\\xba\\xa4<\\xb3$c\\t\\xd0\\x90\\xe2\\x89\\rK\\xd3r\\x12\\xd3\\x8b\\'6n\\xcaH,\\x8e/\\xcd\\xcb\\xce\\xcb/\\xcf\\x8b\\x87\\x84\\xf3\\xa1\\xd5@:/>\\xbd(\\xbf\\xb4\\xa0x\\xe2\\x11\\xc6\\t\\x00V\\xc4\\xa9\\xe2'", "year": "2021"}, {"Unnamed: 0": 199669, "autor": "togauh", "date": 1622758737000, "content": "Fujifilm X-S10 vs X-T4 for videography /!/ Hello all you wonderful people! I'm torn between these two choices and I can't really decide on which one would suit me better for B-Roll, nature, skit / cinematic like videos. I'm still learning about videography myself so I apologise if I say anything misleading.\n\nI have sufficient money to get a Fujifilm X-T4 + a budget lens like a 16mm F 2.8 lens, or the Fujifilm X-S10 + a lens for low-light like the 16mm F 1.4. I'm going to be mainly working with low-light, street videography and forest / nature scenes so I'm thinking the lower aperture could help with better low-light quality, but I could be wrong here.\n\nI've also heard that for videography the X-S10 has one of the best 1080p video because it's inherently recording at 100mps or something like that, but then the X-T4 has the 10-bit color feature which could be useful when editing. \n\nWhen I'm not recording I'm also going to do general photography of many scenarios / locations so weather sealing is probably also a good idea. \n\nI guess my question really is if the X-T4 is worth the premium to get a multi-faceted camera and if the lens choices are good or if there's a better camera / lens combo choice to suit my needs and budget.\n\nThank you everyone and have a awesome day!", "link": "https://www.reddit.com/r/fujifilm/comments/nrpm5u/fujifilm_xs10_vs_xt4_for_videography/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "fujifilm x-s10 vs x-t4 for videography /!/ hello all you wonderful people! i'm torn between these two choices and i can't really decide on which one would suit me better for b-roll, nature, skit / cinematic like videos. i'm still learning about videography myself so i apologise if i say anything misleading.\n\ni have sufficient money to get a fujifilm x-t4 + a budget lens like a 16mm f 2.8 lens, or the fujifilm x-s10 + a lens for low-light like the 16mm f 1.4. i'm going to be mainly working with low-light, street videography and forest / nature scenes so i'm thinking the lower aperture could help with better low-light quality, but i could be wrong here.\n\ni've also heard that for videography the x-s10 has one of the best 1080p video because it's inherently recording at 100mps or something like that, but then the x-t4 has the 10-bit color feature which could be useful when editing. \n\nwhen i'm not recording i'm also going to do general photography of many scenarios / -----> locations !!!  so weather sealing is probably also a good idea. \n\ni guess my question really is if the x-t4 is worth the premium to get a multi-faceted camera and if the lens choices are good or if there's a better camera / lens combo choice to suit my needs and budget.\n\nthank you everyone and have a awesome day!", "sortedWord": "None", "identifyer": 92835, "doc": "b'x\\x9c\\xed]\\x07|TE\\xb7\\'\\x94(%H\\x17\\x04\\x04i\\x01LH\\x011\\xd2S(!\\xa4\\x10B \\x10\\x93\\xdc\\xdd\\xbd\\xbbY\\xb2{\\xef\\xb2\\xf7n\\x9aA\\xca\\x87\\x10E\\xa4HG\\xd4lK\\xa5\\x18\\r\\x90\\xa04Aj\\x00A\\x81\\xfc\\xe8(\\xf0)\\xd5\\x80\\xf4\\xf2fC\\x06\\xc2y\\xcc\\xcb,w\\xdf\\xaa\\xdf{\\xfb\\xfb\\xed\\xfd\\xdf\\xd9{\\xef\\x9c;3g\\xce9s\\xe6\\xcc\\xec\\x87\\xd9\\xc9\\xac^P\\xf3\\x9c\\xc9\\xbb\\x87\\x8f\\x85\\x11E\\xbd\\xb0\\xc2?0xx\\xc8\\x88\\xd0\\xb0\\xf0\\x88R\\x97m\\xa5.\\xdbK]~\\xb0\\x8a|\\x12\\xcb\\t\\xdb\\r\\x07\\x82\\xbcR\\xcf\\x04\\xf8\\xd6\\xf4\\x81\\x98P\\xe3\\xf1\\xa7q\\x9f#\\x9b\\x7f\\xf9\\x97\\xcf\\xb1\\x11\\x07&]5o\\xfbub\\xad\\xca\\xdf\\'\\xbb\\xd4x\\xe6\\x03\\x925\\xbc6\\x9f\\xbc\\xdb\\xa1\\xd7\\xba\\xcfpz\\xdf\\xe1v\\x1e\\xa5\\x85\\xef.\\x83\\x18[y\\xbd\\xb0\\xd3\\xce\\xa1\\xf9\\x03&\\xfe46\\xe7P\\xe1/\\x82{!\\xce\\x0f\\xd3y\\x04>$:E_-[\\xd8\\xa2\\xc6K\\x93!B:\\x9f\\xba<\\xfb\\xde\\x98\\xceCJ:\\x97\\x9bo\\n<x\\xd1u>DH\\xe7K\\x02\\x9d\\x07\\x94t:G[sK{Mk\\x0eqt\\xe5\\xf5v\\xca\\xb8\\xcb\\xbe\\xb2+\\x8d7T\\xe6[\\x13\\xb4\\xc3}\\x02\\x9d\\x9d\\xa0\\xc1\\xaak\\x9f\\xf7F\\xb4mYg\\xe4\\xa9z\\xeb\\x08tH\\xedS?uQo\\xd7\\x92\\x97[\\xe14\\xa9}\\x12*\\xafc~#\\xd1\\xa1m\\x9fV\\xab\\xba\\xce\\xbb\\xd9\\xbe\\xb0\\x1c\"-\\x1d\\xda\\xf6\\x99l\\xd1\\xfez\\xc2u\\xeeI\\x88\\x8en\\x9f+\\x07\\xae\\xbb\\xedl\\x985\\x15\"\\xe47{\\xdb\\x07\\x96\\xe7V\\x9b\\x9ft\\t\\x8d\\x0e\\xb6\\x82\\xc8T^7n-\\x18q\\xa9l\\xf2\\xea\\xef\\x08tn\\x12\\xe8xD\\xa6+\\xe3\\xe32\\xdf\\xc5\\xe9\\xb0\\x8bM\\xacG[\\xd7\\x1b\\x05q|\\xe5\\xf5y\\xbd\\xcc\\xcd\\xd4\\x91\\x9d<\\xb1\\xdc\\x81t\\xf0\\x07\\xca\\x1dXo\\x7f\\xfc\\xda\\xbb\\xfd\\x99\\xd4WK \\xc6W^_z\\xd6\\xd4z\\xd2\\x8a3\\x87\\xda_M\\xa9\\xaf\\x1ap~=\\xa4\\x83\\xe5]u\\xed\\xf3n\\xc0\\xb5\\xb5[\\x92\\xf7\\xa9!b:\\xc7;\\x0f\\xf4j\\x7fs\\xc6wy\\x84z\\xc3iHg\\xf3\\xac\\x80[\\xd6\\x99\\xdd<qz\\xc6\\xce\\x85\\xa1\\xb9_M\\xbf\\x051\\xaa\\xf2z\\xd9\\xaa\\xda\\xdb2w\\xa4\\xcd\\x9fO\\xa0\\x83_\\x1b\\xd2Q=j\\xdd6\\xeb`\\x07\\x01\\xa7\\x1b\\xd4\\x9b\\xbf\\x82cdj\\x88P\\x1e|i\\'_Cy\\x90\\xf0\\xfa\\xd9\\x93+]w\\x97C\\xa4\\xe5\\xb7{\\x94\\xfc\\xd6\\xae\\xdd)]\\xa7\\xf9\\x1b\\x87`\\xdc48h\\xe2\\xa3\\xf5\\xaf\\xfa\\xc3\\xf6YYM\\xbdA~\\xbb\\x12V\\xfc\\xfb\\xa5\\xcfn%\\xe3\\xf4\\x8fy\\x9b\\x95_\\x7f\\xe3\\x9a\\x9c\\xd0\\xf0z\\xe7\\xb5\\xc6p\\xb7\\x9b\\xa7,\\xaf\\x17x\\xb7\\x98;\\xa6\\xf2\\xfa\\xd2{\\xa3<\\xc6\\x8b\\xd3\\'W\\xc7\\xd7\\xb0<\\xedw\\'z\\xd5\\xccz\\xb5\\x19NOr\\xc9\\x9bSS\\xb9z-\\xc6\\x05.\\xbb\\xbe\\xcd\\xbe\\xe4{GQy\\xdd7f>s\\xfdp\\xfd\\xb7>\\xb1S\\x1e\\xd4\\xa9\\xbf\\xa9\\xd9@\\x9f;\\x1f\\xe1t\\xb7\\xa9\\x03\\x16\\'\\xe9{%B\\xa4\\x95o$:\\xb0\\xff4)n9p\\xf6=s\\x0c\\xc4q\\xb8\\xde*\\xfb\\xe9\\x17v\\xf6\\x9f\\x97e\\x9d\\xf7\\xf0\\t\\xbf\\xd5\\xc1\\xe9\\x84Z\\x9b\\x1f\\x9e\\xda\\x97i\\x84\\x88\\x19%\\xb6}\\xd3\\xf5\\x173\\xae\\x8b\\xd8\\x0e\\xc1\\xfd\\x7f6\\xd0\\xe3\\x90\\xce\\xda\\xba\\xed\\x96\\x7f\\xb0\\xaeg\\x0b\\x9c\\xde}o\\xe0\\x8fc\\xfe\\xac\\x9f\\x8e\\xf1\\x86\\xeb\\xb0\\xb2\\xbb!\\xc6\\x1d\\xb4\\xfa\\x94\\xa4\\x7f`\\xff\\xf9y\\xe8q\\xf7\\x8f=\\xbfj\\x071\\xa6\\xf2zw\\xcf8\\x99\\x7f\\xc7\\xb2\\xeb\\x8b\\tt\\xee\\x12\\xe8x\\xe5\\x0c\\x0c\\x8e\\x0b-\\xeb\\x82\\xd3R\\xfbOmB\\xbd\\xc1\\xfes*\\xbd\\xce\\xac\\x87o6\\xdf\\xb2\\xf0pw\\xf71\\xef7\\x8b\\xc5\\x88\\xfbO\\x93Em\\xd6\\xaeY\\x19~f!\\x81\\x0eI^\\xe7p\\xda[\\xdd\\x03>\\xdc\\x8d\\xd3\\x8dL\\xab\\xb7\\xac\\xab\\x1b\\xdb\\xa6h\\xc5\\x92\\x80z;{\\xbbb\\x8c\\xab\\xbc~v\\xc3\\xaf\\xdeC\\x1a\\x07\\xd7\\xcc\\xb5\\x93\\xdf\\xea\\x96\\xe7\\xec\\x99\\xf8\\xe0\\x95\\xc18\\xad\\xffrZ\\xc6\\xf1\\xfa\\xb1{ F\\x03:s\\xed\\x94\\xd7\\xb0\\xff4\\xe8\\x1e\\x12\\xd8d.\\xe7\\x0b\\x11\\xcb\\x83\\xb8ui\\x07\\xdb\\x955\\xda\\xbe\\x8c@\\xe7O\\x02\\x1f\\x1c\\x18\\x12\\xa9\\xf9\\xe3n\\x8a\\x1fNo\\xe8\\xbd1\\xbd\\xed\\xe7C\\xc2 \\xd2\\xca\\x03\\x12\\x1f\\xc0\\xf2\\xec\\x1aq\\xdb\\xd8\\xbe\\xe3K2\\x88\\x98\\xdf\\xce\\xc6\\xf4\\x0e\\rj\\xb9\\xe1\\x8a\\xbd\\xf6\\x0e\\xa43v\\xb8|\\x0f\\x9f\\xf6N9DZ\\xbe&\\xf1A_yQd\\x9d\\x07\\xa5+q\\xfa\\xe4\\xd4\\xe0\\xedo\\x14\\xd7c \\xd2\\xf25\\x89\\x0f\\xb6\\x96\\x8e?\\xd0\\xb9\\xe62w\\x9c\\xaeu\\xe6\\x84\\xeb\\xbb\\x05%\"D\\xc8\\x07[\\xed\\xd4\\xa7\\x90\\x0f\\xa6\\xbc\\x15\\xb3o\\xeb\\xf1\\xcc\\xfb\\x18I\\xf2\\x80d\\x1f\\x90\\xda\\xe7\\xf5;\\xe3\\xcf\\x9el\\xdb(\\x04\\xa7\\x0f?\\xf4\\xbd\\xb0\\xfd\\xd6\\xbfK0\\xc6\\xf6\\xf0\\x9b\\x90\\xf9\\xd1\\xfe\\x01\\xb8\\xff$\\xee\\xc9\\xdb\\xbdX\\x08{\\x8d\\xd4\\x7fH\\xe3\\x85\\x94\\xdb\\xaak\\xf1\\xe1\\xcb7\\xe3\\xb4T;\\x9e$\\xaf!\\xbf\\x15\\x9d\\x9eV\\xd2rv\\xeaQ\\x88\\xa4q0\\xa4\\xe3\\n\\xea\\x0f\\xff\\xfe\\xa2\\xe3`\\x92]\\x85\\x15futZ\\xc64\\xfb\"k\\xd9\\xe9\\x12\\x88\\x90\\x0e\\xc9\\xee%\\xc9\\x03H\\xa7\\xb8\\xc5k\\xb3f_\\xbe\\xdf\\x11\"\\x03\\xae\\x93\\xcaC\\xe2\\xb7\\xab\\xb5\\x16\\xac>\\xd0\\xf0\\xbdC8]7x\\xeb\\x8aWN\\xf6\\xec\\x08\\x11\\x96\\x87$Gi\\xc7\\xa7\\xce*\\xcf9~\\xd2\\x8c|C\\xd9\\x16\\x88\\xb4\\xe3\\xc6;\\x94\\xe5Q7U\\xed\\xb8\\xee\\xd9\\xb7\\x03DG\\x97\\'\\xb4\\\\\\xd9y\\xbf\\xf6V\\x04D\\xda\\xf1\\x0f\\xa9}\\xe0\\xf8g\\xc6\\xe0\\x9f\\x97\\xb5\\x1e2\\xf9>DZyp\\x9dR\\x1eDL\\xf1>`\\x1c\\xfe\\xe0[\\x8c>*\\xb7\\x05-Z\\xde\\xf5s\\xb4\\xdf\\x05\\x8f\\xa3 \\xd2\\x8e\\xb3.\\x11\\xe88z\\x9c\\x85\\xed7G\\x8d\\xb3H\\xfa\\x94\\xa4\\xb7\\xe18\\x8b9|\\xbcq\\xf1BU$DG\\xdbo\\x1e\\xf7\\xeb\\xfd8}\\xf7y\\x16cN\\x8b\\xc6\\xf7S\\xcd\\xedg`\\xbd=\\xf7\\xd2\\xe4P\\xbf\\xa0\\xe1\\xcd\\x97\\x10\\xe8\\x90\\xf4\\xc2\\xa3.\\xe3\\x0f\\x0cJ?r\\x00\\xa75!s\\'\\xb5\\xbd\\xd0\\xcc\\r\\xa2\\xa3\\xc7s\\xce\\xf2W=\\x88o\\xf5\\xce\\xde\"\\xbf\\xd7!\\xd2\\xda!$\\xbd=2\\xda\\xbbt\\xf4\\x96\\xb1\\xf5q\\x9a\\x0f*H\\xe0\\xfd6\\xcd\\x84\\x08\\xf9 \\xdbN~\\x83\\xf5\\xe6(?\\x05\\xa4\\x03\\xfb\\x8f\\xfe\\\\\\xf9\\x9f\\xcd\\xbfO\\xce\\x9c\\xfe0\\xa6[\\xeb\\xc8\\x07Wq\\x1a\\xf3\\xdb\\x8b\\xfa)\\x86\\xad\\x98\\x11\\xb1\\xffJ\\xfd\\'\\xf6h\\xc3ksv\\xd7\\xbb\\xbf\\xa1\\x00\\xa2\\x0c\\x97\\xb7\\x92\\xdf\\xfe)\\xf5\\xd6\\xbag\\xe3S\\xb9c3S!\\xc2z\\x9bc\\'\\xbf\\xc1z\\xbb\\xb1\\xa3\\xe0\\x9b\\xa3\\x8d\\'~\\n\\x11\\x97\\x07\\xce/\\xd0\\xf6\\x9f.\\x13N\\rj\\xe6\\xd3>\\x0f\\xa7_)<\\xba2\\xb6Y\\xc9\\x18\\x88\\xb4\\xfa\\x94D\\x07\\xeaS\\xa9\\xfa\\x87\\xe4\\xa7\\x80\\xfa\\xe7\\x93\\xa5\\xc5\\x8a\\xa5\\xca\\xe5\\r \\xaa*\\xaf\\xeb\\xeb\\x7fp(|h~\\xfc\\xe7\\xd5\\xf0[u~eg\\xf1[\\x93}%g\\x07\\xde:\\xbf\\x07\\xa2\\xd4~\\x1aq\\xad\\xe9\\xb6\\x97?\\xce\\xd8\\x8e\\xd3\\x1e{\\xaf\\xf9^\\xad\\x15\\xaf\\x82\\xe8h\\xbfr\\xe8\\xc9\\xbc\\xe2\\xfa\\xea:\\xfb!\\x92\\xe6\\xcd^\\xd4\\xbe\\x9e{\\xa7\\xbdK\\xe1;\\x9f\\xf7\\x82\\x88\\xfd;\\x1e\\x07\\x14C?*\\xcf\\x0e\\xb5w\\xbc\\r\\xf9`\\xd0\\x99\\xf5\\x93\\xfex\\xe9\\x8f\\xd6\\x10\\xe1x{\\x93\\x9d\\xe5\\x81\\xe3\\xed\\xee!\\xaa\\x9b_\\x9f{\\xd3\\x02Q\\xaa\\x7ft\\xeb\\x98E\\xd1\\xaf}\"O\\xc3i\\xd2|0\\xedx\\x8eTo\\xf6\\xce\\x07W7\\xbf@\\xeb\\x1f\\xa5\\x9do\\xb4w\\x1e\\xe3E\\xe7\\x1bItH~\\x17HgX\\xc2\\xc4{\\xe9\\xb3\\x86l\\x84H\\xeb\\xef%\\xc9k\\xe8\\xefu\\x16\\xbf\\xbdt\\xae\\xed\\xa6\\xe0\\x86+\\x05\\x88\\x90\\xdfF\\x85\\xb8w\\xb8\\xb91\\x9fyQ~\\x0b\\x99\\xdf\\xf8\\xe8\\xae\\xae\\xdf\\xbbA\\xa4\\x95;\\xb7(\\xdbG\\xea\\xb8\\x91\\xd4>P\\xeeHm\\x1f\\x92\\x7f\\x07\\xb6O\\xa0\\xe5\\xee\\x80\\xcd?1} V7_2\\x0b\\xd0\\x85t\\xe0|\\xc9\\xd9\\xd8\\xf8Y\\xca\\xf1\\x1f\\xc7BL\\xa8\\xbc\\x8e\\xfb\\x0f\\x96;\\xb8:f\\x81tu\\xed\\xd3q\\x99g\\xb4zGy\\x11D\\x12\\x1dZ\\xbe\\x86tf\\x96\\x95)\\xfdF\\xaf<\\n\\x91v\\x9e\\x89\\xc4\\x07\\xb0\\xde ?\\xcf\\xf4\\xe8g\\xf8\\xd6;y#\\xad\\xff\\x80dWA9\\xea,\\x7f\\xd5\\xb7\\xc7\\xdfY\\x9a2\\xfc\\xb7\\x9e\\x10i\\xe5\\x1b\\xd1>\\x00\\xf2m\\xfe2\\xe1-\\xab\\xb2\\xa1\\n\\xa2T\\xf9veq\\xa3\\xd8\\xd3\\xeb\\xd7\\xde\\xc1i\\xda\\xf8*\\xa9\\xf2\\x8dV\\x9f\\x92\\xfc\\x96$\\xfdC\\xabOI\\xf1U\\xd4\\xf3\\x8d/\\x18_U \\xd1o\\xf9O\\xd1\\xa7\\xc4\\xf9\\x1f \\xafi\\xf5\\x1c\\x89\\x0fH\\xf1;\\x8e\\x8e{\"\\xd5\\x1b\\xd4s#\\x1b\\x9d?v*?\\xea{\\x88\\xb4\\xe3\\x12R?\\x85\\xe3\\x12\\x12_c\\xf9\\xf6`\\xf6\\xe1\\xdd\\xa5\\xadk\\xe8I\\xf2\\x8d\\xd4>\\x07W\\xf6\\xd8\\xb4\\xe0\\xc3\\xd2\"\\x9cn\\xd8\\xc9\\x12\\xbd\\xeb\\x901\\n\"\\xad_\\x8c6.M\\xaa\\x1dB\\x92\\x07\\xb0}\\xa4\\xcaQ\\xd2|=\\x94\\xa3R\\xed\\x10\\xda\\xb8\\x8d\\xbf\\x9b\\x1dB\\xe2\\x03\\xdaq\\xc9>Ms\\xd5\\xc4\\xcc6g!:\\xda\\x0e\\x91\\xea\\xdf9B\\xa0\\xe3\\xe8\\xf9\\x05\\x92\\x7f\\xc7\\xd1\\xf3\\x0b$>\\x80\\xf3\\x0b%\\xbb#\\xe7^\\xdck\\xd9\\x8e\\xb1\\xdb\\xfe\\xf3\\xcb\\x97\\xdfn\\xceC\\xbf\\xbf\\xbd\\xfe\\x1d\\xe8\\xf7\\x97\\xea\\x0f\\xa1\\x8d\\x83\\xc4\\xf5\\x04\\x11\\xd7\\x1b\\xf6\\x87\\xd8;/\\x03\\xfd!kZo\\xf1\\xce\\xe8\\xf4N\\x03\\x88\\x8e\\x9e\\x97I?\\x9f\\xbet\\xfch\\xcf\\x93\\x18/$%\\x87\\xc4\\x7f\\x13>\\x0b\\xb6\\x0f)\\x9e\\x82\\xd4Oa\\xfbp\\xfa)\\xe6~\\x07\\xbfX\\t\\xf1\\xff\\xf5\\xe9\\xb3th\\xf5),\\x0fi<\\xf72ey\\x9c5\\xfe\\xe9\\x13\\xd2\\xee\\xb7\\xd4Y{G@t\\xb4?\\x84v~\\x8ed\\'\\xd2\\xda!R\\xe3\\x13I\\xf5\\x06\\xed\\xeb\\xbe\\x9d#_\\x12\\x92\\xc3VA\\xa4\\xf5[\\xd2\\x8e\\xebIq\\x0e\\xf2\\xca\\xeb\\x18\\xed\\xe5k\\xd8O\\xa5\\xc6\\xa1\\xd0\\xda\\x07\\x8b\\xba\\xd5\\xf6\\x0fr\\xbf\\x18\\x83\\xb1`\\xfa\\x98%q\\xad\\x96\\x7fA\\xeb? \\xc5\\r\\xc2q#\\xed\\xfc)I^\\x93\\xe2\\x02\\x1c=/C\\x1c\\xd7\\xffE\\xf6A\\xd6\\xb0\\xd5w\\x0eMX8\\x07c\\x83\\x13\\xf23\\xdd\\xaf\\xf9\\xfe\\xeeh\\xfb\\xc0Y\\xfe\\x10\\xc5gc}?\\xd9\\x107\\x0c#\\xd4?\\x01\\xd1\\xab\\xce\\xee\\x9a\\xb2\\xab\\x96\\xbd\\xf3L0\\x9e\\xef\\xd8\\xb9\\xdew\\xbe\\x9b\\\\\\xbe\\x1c\"\\xec?\\xf6\\xf2\\x01\\xec?[\\x8cw\\xcee\\x8a5\\x12!::\\xae\\xf3\\xf3\\xaf\\x86\\xba5\\xdb\\x1eY\\x0e\\x11\\xce3\\x91\\xe2Ch\\xe3:\\x9de\\x87\\x90\\xe2:i\\xf9\\x80\\x147\\x08\\xf9\\xe0\\xff\\x8a\\xbd\\xe3h\\xfb\\xa0Oyx\\xb8\\xb9\\xcb\\x92\\x14\\x88\\xb4~\\n\\xda\\xf9,\\xa9v\\xd5\\r\\x02\\x1dhW\\x19\\xf2\\xbd\\x06q\\xd1MvC\\xa4\\xb5CH\\xf1|\\x8e^\\'A\\xab\\x7f\\x9c%wh\\xc7s$;\\xe4\\x1a\\xa5\\xdc\\x99v\\xf9\\xd36Eu\\xb3\\xc6C\\x84\\xfd\\xd4\\xde\\xf5L\\xb0\\x9f&\\xe9\\x8b\\xc6-\\x99]T\\x07\"\\xad\\x1dB\\x9a_X\\xf5\\xef\\x15]\\x16\\x15\\xe6\\xdc\\xc0i\\xa9\\xfe\\x10\\x92}\\xed\\xe8x\\x17,G\\xff\\xb7\\xed*\\xa2\\x9f\\x0f\\xf0\\xf57\\x91\\xad\\xcc\\x86\\xb1\\xefw\\xc3q.8-5\\xae\\x13\\xc6\\xbb\\\\\\xea\\xd5\\xff\\xb4W\\xeb\\xb5\\xd9\\x10\\x1d\\xed?\\xe8\\xd3g\\x9d\\xba\\xd9\\xb4]\\x85\\x18\\xafs\\x8b\\'\\xbc\\x929\\xf04\\\\\\xa7g\\xaf\\xfd\\x06\\xd7\\xe9\\x1d[\\x95\\xcd\\x9c\\x8d\\xd9\\xd5\\x0f\"n\\x1fl\\xbf\\xd9\\x1b/f\\xb8q\\xf5\\x94\\xe7~CS\\x9c\\x96\\xea\\xf7\\'\\xc5\\xa9\\xfeU\\xf1\\xa3R\\xed^\\x12\\x1f@\\xbb\\x97v~\\xce\\xde\\xfe\\xf3\\xa2\\xf3sR\\xed^\\xd2\\xfc\\\\B\\xe5u\\xec\\xbf\\xb67\\xfe\\r\\xd29o\\xd8\\xe8v\\xd7\\x18\\xd9\\x18#\\x8c\\x7fk\\xf2\\xa0I\\xee\\xf11\\xc1[Hv\\xefm\\x02\\x1f\\xc4\\x1e\\xb9\\x111\\xfeR\\xf9X\\x9c&\\xad\\x03\\x83~r\\xdc\\x7f^\\xd4O\\xbe\\xb1x\\xf4\\x0fg\\xce\\x844\\x80\\xe8h\\xfb\\xdaY\\xf321\\x0f]\\x16\\xc6x}\\x17\\x8d\\xf1\\xd8\\xe6-\\x874?\\x06\\x86c\\xbd\\xcd\\xae/\\x8chs\\xe9\\xbb\\xbd\\xf6\\xda\\xd7\\xb3\\x0f\\xc7\\xa6\\x0c?\\xbd\\xb1\\x1eN\\xcf\\xbc|&x\\xb9\\xf7\\x07\\xfd \\xc2\\xf6\\xb1\\xd7\\xee\\x85\\xed\\x83\\xd7_@\\xa4\\x95;\\xb4~\\x97\\x9a\\'\\xe2~\\x9a\\xeb\\xda\\xf7\"D\\xda\\xb8h\\xdau\\x94\\xee-/7\\xd8\\xd7\\xb4\\xd5\\'\\x10\\xa5\\xea\\xed\\xe2i\\xa3S{v\\xf9>\\x13\\xa7[<XcRz\\xdd\\xff\\x05#\\xb4\\x13q?\\xb5Wo\\xc3~:2\\xfd\\xc8\\xbeU}\\x87\\x8f\\x83\\xe8h\\xbd\\x9d\\xe4\\xe7S~\\xe0\\x03\\xc31\\x8c\\xe1\\xb9\\x8a\\x13\\xc7<\\xaf\\xac\\x86~\\x17R\\x9c7\\xc9/\\x06\\xfd.\\xca\\x97\\xbf\\xea\\xdf\\xe8\\xa3\\xdf\\xb3 :Z\\x1e${\\x99Kg\\xee\\xab-B\\x84\\xfdg\\x1d\\x90o3\\xed\\x94oR\\xe3wHt\\xe08\\xcb#?|\\xf0IE\\xa3? \\xc2\\xf8x{\\xd7\\xe9\\xc1\\xf8xg\\xc5\\xf3\\xd1\\xdao\\xf6\\xda;\\xd0~\\x93:\\xde>O\\xa0\\xe3\\xe8\\xf1\\xf69J>8\\xb4$\\xb2\\xa7g\\xc4\\xb4N\\x10i\\xe5\\x01)\\x0e\\x12\\x8e\\xe7\\x9c\\xa5Oi\\xedD\\x92\\x9e#\\xc9\\xd1\\x17\\x8d\\x8b\\x96\\xeaG\\xa2\\x8d\\x8bv\\x96\\x9dH\\x92\\x07\\xa7\\x08\\xfc\\x06\\xf5\\x8fT> \\xf1\\x1b\\xe4\\x83qY\\xedF\\x94\\\\{{<D\\xda\\xb8\\r\\xda\\xb8[g\\xf9-\\xf7.]\\xd2\\xa6\\xf1\\xeb\\x17ZB\\xa4\\xf5[\\xd2\\x8eK\\x86\\x1e_\\x1a\\xa7\\xbd\\xf2\\x03\\x03\\xd1\\xd1\\xfe\\xd1\\xe9l\\xf1\\xd7\\x83\\x1a\\x1e\\xfd\\x05\"m<9m\\x1c$\\xed>\\x18\\xf6\\x8e\\xe7\\xa0\\xfe\\xf9\\xbb\\xf9\\x13I\\xebeH~1\\xe8O\\xcc\\x19|h\\xf6\\xed\\x9d!K :\\xda\\x9f\\xb8\\xe3\\'\\xb7+K\\x8f\\xc6\\x1d\\x83\\x88\\xed\\xf8\\xd02_\\xf7\\x9b\\x0b}\\xafK\\xb5GC\\xac\\xdb\\xcf\\r\\xaa\\xf7\\xfdx\\x8c\\xaf\\x05\\xc9Z\\x9b\\x96\\xf7\\x98Jk\\x8f\\x92\\xea\\r\\xda\\xa3R\\xfd\\x96$?\\xb9\\xa3\\xfd\\x96uA\\xfd\\x91\\xeaMj\\xfb\\xd0\\x8e\\xb3\\x9c\\xe5\\x1fu\\xd6\\xbaw\\xb8/\\x92\\xbd\\xfb#\\x91\\xf8\\x1a\\xee\\x8fD;\\xce\"\\xc9\\x03\\xd2<\\x13\\xe4\\xeb\\xff\\xb4\\xf6q\\x96\\xff\\xfa\\x9f\\x12\\x9fH[\\x1e\\xeb\\x97\\xbc\\xdb\\x9c\\xad\\x7f\\xb6\\x85H\\xbb?\\x12\\xedz\\xcd\\x87\\x137\\x9d\\xf0\\xf0\\x7fc\\x00DG\\xaf\\xa7\\x8d:\\xe6}\\xfb\\xc4\\x829\\xb3 :z=\\xad\\xb3\\xfc\\x96\\xf2\\x98\\xcf\\xc2=?\\xfcu\\x06DG\\xd7[\\xc9\\xac\\xe6kR\\xea\\xdc\\x99\\x821oo\\xf9\\xd0\\x99+\\xa6}K\\x1b\\xf7D\\xaa78\\xcer\\xd6\\xbe8}\\xdd~\\xcc\\xd8\\xd5{D\\x11\\xc6\\x0f\\xadQ>\\xab?\\x1e\\xd1\\x17\\x96\\x87\\xb4.\\x87\\xb6<\\xa48.Z\\xbf%m\\x1c\\xf1L\\xd5\\x83\\xa6\\xdd\\xdc\\x98\\x96\\x10\\x1dm\\xc7\\x1bK/\\xd4\\x1e\\x97\\x1b\\x16\\x0e\\x91v\\xbe\\x84\\x96N\\xc0\\xfaK\\xaf*\\x92\\xc7za$\\xf9GI\\xf6\\x1b\\xc9\\xae\\x82\\xe3\\xd3\\xabi\\xa7\\x16y\\xfefN\\x86H\\xab\\x17h\\xfb\\xa9T\\xfdC\\xe27G\\xafs%\\xe9S\\xb8n\\n\\xcf[@t\\xb4\\xdc97\\xd8G\\xb6\\xa5\\x87\\x7f(D\\xc8o\\x0b$\\xc6\\xd5H\\xb5\\xe3/\\x13\\xe8\\xfc\\xa7\\xef\\xb715\\xe1\\x81\\xd8\\xd9/\\xa9)DG\\xef\\x8b\\xb3:\\x7fK\\xa3\\xf4\\x80\\xae\\xb5 \\xe2\\xf2\\x0c\\x8b\\xd8\\xd7q\\'#\\xf3[ogy\\x82\\xdf\\x1bsds\\x9b\\xc2\\xb7qz\\x82\\xa6U\\xd7\\xae\\xd3\\x16/\\x84\\xe8\\xe8\\xf9`g\\xedsJ+GI\\xf3\\xc1\\xa4\\xf99(G\\xa5\\xee[D\\xf2\\xf3\\xfdU\\xf3\\xb4\\x7f\\xb5_\\x99v\\xdf\\xc9\\xbf\\x9b_Y\\xaa\\xde&\\xf9\\xf9 \\xbf5\\xb8\\x9a|\\xf4\\xf4}!\\x0f\\xa2\\xa3\\xfdU\\xce\\x8aw\\xc9u\\xbb\\xbf\\x7f\\xca\\xbd\\xbd\\x03!\\xd2\\xae\\xdf\\xfe\\xa7\\xee\\xf3c\\xef:0G\\xef\\xf3C\\xf2WA{\\xe7\\xe8\\xa6Fn\\xf7\\xfb\\xad\\xf0\\x82Hk\\xef\\x90\\xe4\\x0em\\\\\\xb4\\xa3\\xe3\\xaf\\x97\\xf9\\xfdY\\xbe\\xba\\xf8\\xd15\\x88\\x8e\\xb6\\xdf\\xe6\\xd5\\x19=-\\xe8V\\xbf\\x0e\\x10i\\xc7\\xdb\\xb4\\xf6\\x9b\\xd4uS\\xa4\\xf8\\x038\\x7f*U\\xcf\\xd1\\xfaG\\x9d\\xb5\\xbe\\x84v\\xff\\x03\\xa9\\xe3F\\xda\\xfd\\xfd\\xed\\xd5?P\\x9fn|\\xb4\\xc8#I7w0F\\x92?\\xd1\\xde\\xf8k\\x18\\x0fK;\\xfe\\x91\\xaa\\x7f\\x9c\\xb5\\xbf\\x8b\\xb3\\xf6\\x9d\\xac\\xe1\\xd1\\xeeB\\xf0\\x8a\\x91m!b;\\xbex\\xf3\\xbcn\\x8ff{\\xfe\\x9c%Q\\xff\\x90\\xe2\\xabh\\xe7\\xb7Ir\\x07\\xda!R\\xf5\\x0f)\\xbe\\x17\\xea\\x1f\\xa9\\xeb\\x7fH\\xf65\\\\\\xffC+\\xaf\\xff)\\xebB\\x9d%\\xdf\\xca\\xcc\\xb5\\xaf\\xff\\xeb\\xe3\\xfdq\\x10\\x1dM\\x07\\xcbM\\x88\\xb4\\xfe\\x10\\xda}~\\x9ce\\'\\xd2\\xfe\\xff\\x82\\xd4\\xfd \\x9d\\xe5?\\xd8>mM\\xff\\xa9^\\xea&\\x18\\xbd\\x0e.~;d\\xac\\xc5\\x95v\\x9fFZ\\xbf\\xb2\\xb3\\xd6\\x89\\xd3\\xee7(u\\x7f\\x7f\\xa9\\xfe\\xb7C\\x04:\\x8e\\xf6\\xbf\\xb9\\x00\\xc4\\x1f\\xc8\\xd7]G\\xe5\\x8c\\xaaQ3&\\x03\\xa2\\xa3\\xfdb\\xb4\\xff\\xa3f\\xef:\\x96\\x87\\xef\\xcb\\x0e\\x7f&\\x1f]\\x82\\xd3\\xa5\\xa3\\xf7]?<b\\x8d\\x00\\x11\\xc6\\x8f\\xda\\xcb\\xd70~T*_\\x13\\xf7Y\\x00|M\\xbbO\\xb0\\xbd\\xfb\\x05@;\\xd1^\\xfb\\x00\\xc6\\x11\\xd3\\xfa\\xe3\\xf3B>\\x8d\\xd6-\\xbc\\xe3\\x01\\x914\\x9e\\xc3\\xec:\\x13\\xa4!\\x1dh\\x8f^\\xee\\xb0\\xf9k\\xd7\\xf4\\xc8\\x16\\x10\\xab\\xfb\\x1fOL\\x87v\\x1f\\x0c\\xa9\\xffsGZ\\xc7\\x02\\xe5\\x81U\\xd01rV\\xd8\\xee\\xd2\\x01e\\xe4R\\xf1}\\xfcAo\\xfe\\xf4\\xf4\\xe9\\xa7\\xa2H\\xf0\\x86\\'W\\x9e\\x9cVy\\xb2F\\x95_jT\\xfe\\xf0\\xf4\\xd9*OU\\xc9\\xef\\t\\x91\\x8a\\xd2\\xc1\\\\]\\xc0\\xab=\\xce\\xf5\\x997\\xaf\\xe1\\xe2\\x02^\\xef9\\xc5z\\xce\\xd9\\x7f{\\xac*\\xf9l\\r\\xcb\\xa9\\xc4Da[m[ee\\x0b\\xa2^\\xcd\\xa9\\x84\\xe3.\\xb5\\xbe4\\xd6\\xab\\x97\\xf5\\x86\\xd1]kt\\x17L\\xee\\xc9l\\xd6\\x9bY\\x1eY\\x9eY=\\xb2\\xbcL^ox\\x99|z\\xf42\\xfax[}\\xbc\\xbd\\xb5:\\xc1\\xe2\\xe3\\xed\\xe7\\xad3\\xfa\\xf46\\xf9\\xf6\\xf0+\\xeb\\xe4/\\xe8X\\xb9\\xd8?\\x82\\xd5+3\\xa2XN`\\xfbG0\\x82\\x98\\x11\\xcd\\xeaeCx\\xbd\\x16\\xa5\\xf4\\xe2\\xd3\\xbb\\xf4\\xbc\\n\\xdf\\xa5g\\x85g\\xef\\xca\\t\\xf4\\x8f\\x0c\\n\\x0e\\xf3\\x1fa\\x0c\\x0c4\\x06\\x06\\x95u\\x0fd\\xd0}\\xferyF\\x98A+c\\xf5\\xfdG\\xa1\\xb7\\xcd@\\x84\\x04\\x9e\\xeb\\xef\\x93\\x81\\xf2\\xe2\\xa2\\xd2t\\xb6\\x9c\\x84\\xb2\\xb7\\xe8\\xef\\xcd\\x88d\\x95\\x1a6\\xb5\\x7f\\x0c+l|\\xf2T\\xe5\\x9d\\xbe\\xcf\\xe6\\xda\\xbb\\xe2z\\x18\\xaf\\xcd\\x18\\xcar\\n\\x94k\\x18k\\x10\\x9fG\\xa1\\xe7\\xb3\\xcfu\\x7f\\xf2\\\\\\xb5oS\\x10\\xc8s\\x13*\\x12\\x81Z\\x9d9\\xc8?j\\xb01(\\xaa8\\x88U\\xaa9\\xb5\\xc8\\xf6G\\'Oo\\xf7\\xd7\\x8bO\\xaf\\x04s\\x8ag\\xae\\xe4\\x05\\xb1*=[\\x91\\r>\\x8d\\xe0\\x05|:\\xca\\xa03\\x0e\\x1ek\\x1e\\x16\\x131,+\\xd8\\x18\\x1cf\\x1c>\\xdc4|x$\\xfa\\x8e2\\x86\\x06\\x95\\xbd\\x15\\xca\\xf3\\x8a\\x8a,\\x9f\\xfb\\xc2\\xcfk\\xb1!j\\xee\\x7f~\\xac\\'\\xf1\\xb1\\xf6O\\x1e#\\xdca\\x0c\\x0b3\\x85\\x85E\\xa0\\xef\\xa8\\x02\\x94\\xf3\\xe3\\xeaa\\xf4\\x8a\\xfcJ2\\x11\\x1a\\x83~}\\x95\\xf3\\xa7\\x15\\x11\\xc4j\\xf3\\xab\\xbcKY\\xf7\\xe77\\x00/\\x08\\xb6\\xf6\\x7f\\xa6%\\xd6?sk\\x95\\x0c\\x9f\\x7f\\x01\\xbd\\xbe)<r\\xa8)\"2\\xc2\\x8c\\xbe\\x9d\\x8a\\x9e\\xcbB\\x05\\x11\\xbc\\x86\\xd1\\xab\\xc54\\xc4:\\xaa\\x82\\xaa\\xb9\\x16T\\xbdmU\\x84\\x81\\x93\\x8b\\x8f\\xcb\\xc9k\\xb5U\\x92A\\x8c\\x90X%\\x89\\x88\\xa8sF\\x8e\\xf6\\x0f\\x8b\\n\\x8e\\x8a1F\\x06\\x98\"\\x03\"\\xcd\\x91\\xe1\\xe1Q\\xa6Q1\\xa1\\xc6\\xa8\\xf0u\\xa4\\x1a\\x1d=\\xcc\\x18\\x1d`\\x8a\\x0e\\x18\\x8a\\xbea\\xe8\\x1b\\x81\\xbe\\xe3\\n\\xaa\\xde\\xf24\\x11\\xcc)+\\x12\\x15\\x14Cy\\x85iLP\\x94i\\x0c\"\\x16?*\"\\x8b\\xb102\\xde Z\\x189\\xaf\\xd5Y\\x18E\\xb2\\\\cEG-\\xba\\x8d\\xd1h\\xcc\\x8cF\\xe0\\x8d\\x8c\\xd6\\xccT\\xfc\\xc0)r\\x18.MLD5\\x97\\xc3\\xe8X\\xbdh\\xd0\\xb3\\xb9\\x8c\\x8e\\xd7\\xf0*\\xb5\\xf0\\xe4,\\x9d\\xb50:\\x1d/\\x98\\x18=kdD\\xb3\\xed_\\xbcM\\x8c!5\\x9bIa\\x05^\\xcbf\\xc9\\x8c26[\\xc6\\xca\\x19\\x83\\xc0\\x9ae\\xac Ze\\xac(\\xb2z\\xf4\\x9b\\x98\\xc2\\xb2\\x9cI\\xa6F?\\x19\\x14*V4\\xc9\\x0c\\xa2Q\\xceX\\xe5\\x8c\\x96\\xd53&9\\xc3\\x19\\xe5r\\x8b\\xdc\\xf6\\xb2Vy\"\\xaf\\x96\\xb3\\xd9\\x8fA\\xc8\\x95\\xab9V\\xcb\\x88jt\\x19\\xbd\\x86\\x1e\\x1d\\xb52>\\xc7v\\'o\\xe0\\x14f9\\xea\\x98\\xe87\\x83FaR0iV\\x05+W+X\\x93\\x82\\xd5\\xa1\\xafhT\\xf0f\\x05/\\x9b`f\\x15j1\\xdbv\\xb0\\x15\\x91Mf\\xf5i<\\xc7\\x9a\\xd9T\\x9d&K\\x99\\xadD\\x9aId\\x15\\xd9J\\x96\\xb1\\x95\\xdc\\xa4\\xe4\\xf5V\\xf4E\\x05\\xc8Q\\x1a&\\xa8\\x95j\\x8d6[\\xc5r\\xe8E5&\\xf4\\xeeF\\x15oQ\\xf1(#\\xb3\\nu\\x10\\x8b\\xca\\xc0\\n\\x82)\\x91\\x11\\xcc\\x89L2kNd\\x19\\xbd\\xc5vP\\xa0\\xa3F\\xc3\\xa3\\x1f4:t\\xd0\\xb3Yj3z5\\xc6\\xa8V\\xe6\\xa99\\xdb\\x0f\\x9c\\xa8I3\\xaa\\x05\\xa3Z\\xb4h\\xd0\\x03\\\\N\\xc5\\x11elB\\n\\xc0\\x8c\\xbe\\x82E\\xa3V%\\x8af\\x8d:\\x89\\xcd\\xd1\\xf0rT\\x0b<\\x97\\x8bO\\x04\\x93\\x86O\\xb1\\xa0/\\xab\\xb7j\\x195\\xa7I3kQ3\\xa2\\x83>\\xc9\\xa8e\\xf3\\xb4j\\x01e\\xa8@\\xf9\\x19\\xb5Z\\x8b\\x16\\x158\\xcd\\xa25hD\\xb5Q\\x9bf\\xd5\\xa6\\t\\xacFi\\xe2\\xdcE+WQj3\\xc7\\xb2\\n\\x8b\\xed \\x988Ve\\xe6l\\x9c\\xc1\\xf1b\\x0e\\xa7{\\xcc7\\x16N0\\xc8&X9\\x83\\x16%\\x8c\\xbc\\xd2\\xc8s&\\x94\\xa7\\x11U\\x96\\x8e\\xe5u\\x1a6_\\x97\\xc8\\x8b\\xbcJ\\xcf\\xe8\\x12\\xd3\\xcc:[\\xad#f\\x11\\xac:=\\x8bZ\"\\x1b\\x81Vm\\xd0\\x9a\\x11\\xeartz^\\xc6\\xc84i\\x16\\x9d\\xad\\xcbdO40\\x1a\\xd4\\xf9r&\\xa2\\xaa\\xb4\\x95\\xcc\\xaag\\x11\\x93\\xa6!\\x90\\xf3zE\\xeec@\\xe5\\xb0\\xe8Y\\x8d\\\\c\\xd6\\xf3\\x1a\\x8dI\\xf0\\xf16\\tLZ\\x8e g9\\xd4u\\xf9\\\\|\"Xlg\\xac\\xb5\\xe2(d\\x0b(+[[\\tIj\\xd1(\\xa0\\xdb\\x10\\xa7Vp\\xba\\x05\\x91\\xd2h\\xacH\\xbb\\xb2\\xac\\x98\\'\\x18\\x94J\\xb5\\\\\\x8d\\xda\\xc4,\\x18\\xd0\\x9db/\\xb3hkI1\\x91\\xe1\\x92\\xcc\\xe8(\\x9a\\xc4D\\x16\\x9d\\xb0\\x1c\\xfa\\r5\\x9e\\xed(\\xd8\\x8ej.)\\xa7\\xe2h\\xabh\\x917\\x8b\\xbc\\x9e3\\x89)\\xbc\\x15\\xf5\\x02\\xa5AcIF\\x8d\\xce\\xe7W\\x1c\\x1f\\xd7\\x8d\\xb5\\xe2\\\\0&\\x0b\\xd9)\\x88\\xe3Pf\\xe6\\x14\\xc4)\\xe6\\x14[\\xde)\\x89jy\\xa29E-&\\xe6\\xa6\\xf06e\\x86\\xb20\\xa7\\xf0\\xfa\\xa4l\\xdb\\xc1\\xf6\\xda\\x08\\xc5DtD\\x1coIA\\xc2I\\x95\\x95jI\\xb5u\\x07S\\x1ao0#\\xd6\\x10\\xe6M\\xb1(5\\x8cJ\\x987\\xb5\\x10\\xb1e\\xbc\\x81K\\xe2\\xf8\\x14.\\xfe\\xb1\\x05\\xb65\\x1f!\\x17\\xaf\\xd2\\xf3\\x06\\x9d0o\\x9b\\xcb\\xdc\\xff\\x02\\x8b^\\x05\\xa8'", "year": "2021"}, {"Unnamed: 0": 200746, "autor": "AlienCatnip", "date": 1613744451000, "content": "Why do I need to allow the camera remote app permission to access my location all the time?? Seems unnecessary. Or am I missing something?", "link": "https://www.reddit.com/r/fujifilm/comments/lngz54/why_do_i_need_to_allow_the_camera_remote_app/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "why do i need to allow the camera remote app permission to access my -----> location !!!  all the time?? seems unnecessary. or am i missing something?", "sortedWord": "None", "identifyer": 93968, "doc": "b'x\\x9c\\xbdW\\x0fLSG\\x1c\\xa6\\xe8\\x16\\x13\\xa3!\\xce\\x8dd\\x8c\\xd9!\\xeaFP\\xc4\\xfff\\xab\\xfc\\xabh\\x11h\\x07U\\xa62\\xd8k{\\x94B\\xdf\\xbb\\xc7\\xbbW\\n\\x8aqsf\\xd1i6 1\\xca\\xa2\\x0c^_\\x0bR&\\x19\\tZ\\xb7\\xe9\\x14\\xcbF\\\\X\\x0833\\x9dL\\xa61[f\\x0c\\xca\\x9c\\x18u\\xca\\x0e\\xe99\\xbd\\xf0\"\\x84\\xc5K\\xee}\\xefw\\xbf\\xbb\\xfb\\xee\\xbb\\xfb\\xdd\\xbd{\\xbb\\x1bJ\\x81\\x80l\\x90s-\\\\\\x10\\xeffDQ@\\x87\\x92Rti\\xeb\\xd232\\xf5\\x86.\\x95\\xbfK\\xd5\\xd1\\xa5\\xfa\\xce#\\xc2b\\xc0\\xa1\\x8e\\xa9\\x9dG\\x7f\\xe9?\\x9fs\\xbf\\xf82\\x8d\\xa6\\x90\\x91\\x94\\x11X4op\\xdf\\xa2\\x9b\\x95\\xaa\\x11;4\\xe4\\xc94)\\x88*\\xaa\\xbc\\x93*\\xf0\\xd4\\xc1i\\x9f\\xb6\\xdf\\x8a\\xa41\\'\\xe8\\xaf\\xb9\\x97\\x1d\\xbbY\\xdc\\xb9}\\x9f\\x02\\x0f\\xb1\\x87\\x82\\x89\\x94\\x1bn\\xbc\\xe0\\x9f\\xb2\\xb7\\xa2\\x83\\xd8\\xb3f\\xf5\\xf1\\xd1\\xd5\\'S\\t~\\xbbZ[2\\xe4\\x0bO\\xca\\x0f\\xfa{\\xe7$\\xc4\\xa9\\x07?:\\xf1\\x85\\x02\\x0f\\x196\\xcd\\xd3\\x9fy\\xfc\\xea\\xb5\\x83\\xb7K\\x89\\x1d\\xd7\\xb3\\x7f\\xf9\\xbaw\\xdc\\xcf\\xd3h\\t\\xfa\\xf3\\x8e\\x95\\xf7\\xcc\\n\\x84u\\xa4wo\\xbb.\\xfb\\xaf\\x94\\xd0<$\\xd1<\\xdd\\xa9Y\\xf6\\x81\\xbb\\xce\\x15\\xc4\\xae\\xbc\\xa3V\\xb5\\xae\\xac]Bc^\\xd0\\x1f\\xdbmY\\xf3\\xf1_\\r\\x19J\\xf3\\xa6\\xa4\\x87^\\x9f\\xaf\\xd7{\\xd7\\xf7\\x1e\\xa8\\xddH#\\xad\\xa7]\\x81\\xe7\\xc1\\xd0\\x93IIO\\xf5gh\\xa9\\xa7`\\xba\\x95\\xc6MA\\x7f\\xcdeW\\xc4\\xb6C\\x97~\\xfa|\\xbc\\xeb\\xb3?,\\xf77\\xdf\\xd1;\\xc4\\xaezn\\xfd\\x0e\\xed\\xed\\xb7\\xa2h\\xcc\\r\\xfa[\\xa3;\\xd7xW\\x95\\x9ckzJ\\\\\\xd3<q\\xa7.\\xde\\x8dZr\\xec \\xb1\\xd5/\\xcf\\xd8y\\xfa\\xed3o\\xd0h\\x0c\\xfa\\x03G&\\xfbw}_^]=N=\\xd6\\xa1\\x88\\xc8\\xfa\\x9e(D\\xec\\xd2\\x88\\x924>\\xae\\xec.\\x8d\\xb4\\x9e\\xecu\\xf3\\xa2\\x06Oz\\x99\\xb1\\xf2\\xd0z\\xe4e;\\x9cgOL\\x99O#\\xcdS\\xa7\\xa0\\xe7\\x9eB\\x1c\\xd0<\\xcf*\\xae\\xbd\\xfas\\x95\\xf9\\xf3\\xf6\\xfcL#\\x1d\\xd7g&\\x18\\xd7-\\xde\\xd3a[\\x92_\\x9fD#9w\\xd6\\x1a~\\x9c\\xdd\\xc9\\x98V\\xf8\\xc6\\xa9G\\xb75\\xe7\\xfc\\xa9WZ\\x97\\x13{\\xb7\\xc7\\x18\\xdf\\xb27\\xfdM\\x1a\\xc7\\xba>Jz\\xe8\\xf5\\x19\\xb8\\xb2L}\\xa9,\\xfc+\\x1a\\xc9>\\xbd\\xd8\\x7fgO\\xef\\x85\\x0e\\xab\\xfa\\xbas\\xaau\\xd5\\xef\\xbe\\xb1\\x9e\\xd7\\xf4\\xfa<\\xab\\xf3\\xa0\\xae\\xad\\'=\\xc4g\\xd8J#=o\\xcd\\x13\\x8c\\xebTS\\xce\\x87v\\xd4WB#\\x13\\xf4K\\xed\\xcd\\xe9\\xd7\\x02\\xdb[N(\\xf0\\x0c(\\xf0\\xc4fm)\\xc8\\xcf\\xdb\\xf5\\xee\\xff\\xc5sc\\x8c<KW\\xeej\\x8b.\\xbe\\xf5\\x1aA\\xfb\\x85\\x03\\x9f\\x1cJ|\\xd0C\\xf6\\xcf\\x8c\\xfb3\\x0e\\xf7\\xe6\\xe8N?\\xed;G\\xdf\\x0f\\xec\\xb9\\xa1W\\xc3\\x13\\xfeh#v\\x7f\\xed\\x0f\\xa6\\xe6_\\xff\\x0e\\xa5\\x91>G\\xbfT\\xd03\\xa4\\xa0\\x87>G\\xc9\\xbc\\xd08\\xd6yS\\xda?\\xf4\\xbc}\\xd3\\xbb\\xb2\\xc6\\x99\\xf6\\xe7b\\x1a7\\x06\\xfd1\\xf3\\xf3LI\\xb3\\x037\\xf7\\x8f\\xf3^\\x15\\xd7\\x98\\xa0\\xcb\\xcb\\x08\\xcc%\\xf6{\\xd3o\\xce9*\\xe9\\xa7\\x11\\x1c\\xecs\\xbf\\xda\\xbc\\xf0\\xa5\\xca\\x89\\xde\\xab\\xd4g\\x0b\\xe3B\\xeb\\xc3g\\x12\\xfbY\\xdd\\xab\\x90y\\xb6\\xfcO\\x97c\\x80 \\xa7\\x15|\\xbe\\x9a\\x85\\xb5$\\xde*\\xafm\\xcfX\\xa1M{q\\xbc\\xf7\\xaa\\xa1\\xb9\\x9b\\xbb\\x13\\xb7\\x9c\\xef&v\\xacW\\xbf\\xfa\\xa2%l\\x80F\\xa2\\xe7i\\xe7\\xa8R\\xbc\\xcd-\\xeaK\\x9c\\x19\\xafn\"\\xf6D\\xf7\\xe9X\\xe3\\xcd\\x83x\\xc6\\x0c\\x90?RE\\'<\\xf7\\xaa\\x90\\xe0[\\x83\\x1dpV\\xb1\\x10\\xf9\\'G\\xe26\\rH\\x14l\\x9c\\x15\\xf5\\x86\\xac\\xad\\xab_P\\x9f\\x10\\x88NB<0\\x8b\\x1a\\x83\\x00\\xad\\x15F\\xfc\\x83\\x00\\xf0+@\\x15\\x1b\\x80`J\\x85\\x02\\xab10\\x82(\\xa5\\xa4\\x04bR\\x18\\xec\\xcb\\x84lE\\xa6\\x835\\x01A\\x93\\x8d\\xfb\\xa90\\xe0_\\x0f\\xc8i\\xe2+p{\\xceX\\xce\\x0f\\xb7F\\xcd)\\x90+zh\\xa4\\xb0\\xbc\\xa45\\x1e\\xd7\\x82\\x02\\x1bg\\x13\\x81\\x06\\xbf\\xfcW3I\\x10\\x9b\\xb4\\xc0*\\x00\\xdc\\x08\\xa2z\\x9d\\x94\\x96\\x16X\\x9a\\x01\\xa1E\\xa3\\xe3,\\xa3\\xb3\\x8c6\\xc0T\\x1b\\x17P?j\\xa6PC\\xca\\xcc\\xf4>\\xd6c ft\\x11\\x10!\\xcdF\\xdc\\xf4q5\\x81\\xd8Q\\xea.V\"\\xf2=Q\\x99t\\x83G\\xe62h\\x8d.C\\x96A\\xc69\\xfa\\x88\\xc1\\xc1\\x99\\xc5\\x11\\x06 \\xd8\\xe4,\\xbd\\xde(\\x19\\xf5\\xd2\\x86d\\xd7\\x86\\xe458\\x1bp\\xde\\xd4\\xfc\\xa8c\\x1dW\\xe0\\xca\\xc9J\\xf60f\\xbc\\xe0\\xc8\\xc5\\x98\\xed\\x1e\\xc6R\\xcaB\\x8b\\x8b\\xb1\\xdb\\xdd8C\\xa7\\xc4\\xb02\\xf3\\xb0\\x84\\xe7]\\x8c\\xa3L2\\x01\\x8f\\x99a\\x81\\xc0Hfs\\xa3\\x19\\xb2<t\\xe0QX\\x80(Y\\xa0l\\x81\\xa6\\xa2z[\\xa3\\x1d\\x9a\\x19\\x11\\xff:\\xca\\xac\\r\\xa1\\x86\\xe1\\x07\\x1e\\xb6\\xc4\\x96\\xcb\\x1c\\x00\\x16\\x99\\xc3\\xdd5r\\xfc\\x08\\x93\\x9bC\\x0eS\\x91\\x0cy\\xc1\"A\\xa1\\x89\\x07\\xc2\\xc3\\xea\\xb8-\\x8fg\\xcd\\xc3\\x0b\\x00w\\xed\\xe6\\x87uy\\x04\\xc0B\\x11\\xc8\\x08\\x00\\xd6=\\xfc@\\x87\\x11d\\x81X\\x88;w\\x89\\x85@\\x16m,\\x90D\\xe8up\\x1c\\x18\\x16\\xc4\\x08\\xe5.ga\\xb9\\xbblx\\x982\\x1e\\x12\\xaaz\\xdf]`g\\xac\\xa8\\xea\\x83\\xd6B\\x06\\xe5;\\xb8b\\x0e:\\xb9\\xfc\\x91\\x88o\\xf7b\\xe4\\xf2\\xad\\x02t\\xf0\\xa8\\xca\\xaf\\xaa\\xfc\\x179\\xa2\\xdb\\x98'", "year": "2021"}, {"Unnamed: 0": 201933, "autor": "chipboyz", "date": 1610281488000, "content": "XT2 - is it a worth while second hand purchase? /!/ I bought an XE3 about three months ago. Some days I love it, I like that it’s small and quite intuitive and the images are cracking! Some days though I find it limiting, living where I live I spend lots of time outside taking landscapes and watching nature and the static screen/EVF location often hinders me composing images when on a tripod (especially when I’m down low). I bought it because I just needed a camera, I’d gone long enough without! \n\nSo I’ve been looking at acquiring a second hand XT2. New to the Fuji world so was hoping to hear your opinions on whether it’s still a worthy purchase in this day and age? \n\nSide note: if anyone has any suggestions on glass for wildlife photography I’d welcome that too. To get me started while I continue to save for the 100-400.\n\nCheers, have a good one!", "link": "https://www.reddit.com/r/fujifilm/comments/kudloi/xt2_is_it_a_worth_while_second_hand_purchase/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "xt2 - is it a worth while second hand purchase? /!/ i bought an xe3 about three months ago. some days i love it, i like that it’s small and quite intuitive and the images are cracking! some days though i find it limiting, living where i live i spend lots of time outside taking landscapes and watching nature and the static screen/evf -----> location !!!  often hinders me composing images when on a tripod (especially when i’m down low). i bought it because i just needed a camera, i’d gone long enough without! \n\nso i’ve been looking at acquiring a second hand xt2. new to the fuji world so was hoping to hear your opinions on whether it’s still a worthy purchase in this day and age? \n\nside note: if anyone has any suggestions on glass for wildlife photography i’d welcome that too. to get me started while i continue to save for the 100-400.\n\ncheers, have a good one!", "sortedWord": "None", "identifyer": 95213, "doc": "b'x\\x9c\\xdd\\\\\\t\\\\\\x13\\xd7\\xd6\\x07\\xab\\xa8\\xb8k\\xd5\\xbao\\xad\\xbeZ\\x10\\\\K\\xb5>d\\x11d\\x8f\\x88\\x0b\\x8a\\xca\\x90LB$\\x99\\x89\\x99\\t\\x8b\\xe2O\\xab\\x9f>\\xdc*nX\\xa5\\xa8$\\x93\\x80\\x80\\xe2R\\x11\\xb5\\xc5\\xa5n\\xb5\\xcf\\xa5j\\x15\\x1e\\x8a\\x8a>\\xabV\\xb4b\\xabU\\xb1\\xbc\\x1b\\xccu9\\xf5~L\\x9a\\xfc\\xf8|_~\\xcc\\xfd\\xcf\\x99;3g\\xee9\\xe7\\xdes\\xee\\xb93,\\xcc\\x8a\\xa7\\xb5\\x9c\\x92e\\x0c\\xee\\xfd\\xfa\\x1b)\\x9e\\xd7r\\x19^>\\x01\\x81A\\xc1!\\xa1a\\x92\\x13\\x8e\\x87N8\\x1e>\\xe1x\\xc4\\xc4\\xb3q4\\xc3\\x1d\\x0e>\\x96\\xbf\\xa1\\xc7\\xaa\\xfb\\x13\\xae\\x15B\\x8cvx\\xfek5\\xf4\\xc2\\xfek\\xf3\\xfa\\x97\\xe69>\\xa7\\xeb9\\xbc\\xfe\\xc3\\xb4#8\\xee\\xb6\\xbf\\xecI\\xcfA\\xbb\\xbe\\xc4\\xf4\\xcem\\xebV\\xb7sh8\\x1b\"e\\xa9Ok\\xe2\\xb2E\\xb2\\xb2\\xc9\\xc6o\\x08|\\xf0\\xfd\\xab-?|\\xfc\\x18`\\xec]x\\xa7\\xbd,~\\x82\\x1b\\xc6\\x87\\x97\\x8d]\\xf3\\xdc\\xdb\\xa5\\x8e\\xb7\\xd4\\xb7~\\xd6z\\xd3\\xc5\\xf1\\x01\\x07\\x82O\\xcf\\xba\\'\\x1c\\xba>\\x1d\\xf2\\xc1?\\xc8\\'\\xea\\xc2\\xaf\\x92Iw*\\'`\\xba\\xcf{\\x15MO\\xb6\\xe9\\xf09\\xc4\\xa9\\x96\\xfa\\x8b\\x1fx\\xbau\\x7f\\xb8\\xe0\\x9b\\xcd\\x84\\xf6T\\x83\\x1f>\\xbe{\\xee\\xd8\\xc4\\x81\\xbd\\xbfM\\xc1t\\xdf \\xc5\\xc3\\x1d\\xff\\xfe\\xc8\\x08q\\xa2\\xa5~m\\xb9\\xa1\\xd3\\xac\\x8c\\xabg7X)\\xb7\\x83\\xe3\\xd3\\xc6u\\xfc\\\\\\x9a\\x84\\xe9\\xa6\\xf7\\xe2\\x8b\\xafTq9\\x10\\xa3,\\xf5\\xdb\\xdf?\\xe6\\x9f\\xfb\\xf7\\xe9\\xe7V\\x11\\xf8<#\\xb4\\x07\\xda\\xc1W\\xd7\\xf7?,\\xe8\\xafn\\x0e1\\xc6R\\xdfM>\\xa5b@\\xcc\\xddV{\\t|\\xaa\\x08|\\xa0\\x1dl\\xba\\xf0\\xf1\\xce\\x03\\x053\\xab FX\\xeaK\\xb6\\xd4?\\x94r4i\\xc5\\n\\xcbu\\xefX\\x8e/q\\xfc\\xdf\\xe5\\xa6\\xa8\\xee\\xd4%\\xf3LO\\x0e\\xd3\\x03\\xd7~\\xd7\\xf8f\\xf3\\xc9\\xab B\\xb9\\x8d\\t\\xea\\xd3\\xf3aQ.%V?Pn\\xaa\\x16\\xb3=N\\x1a\\xa2\\x02 B>\\xbbl\\xd4\\x8f_\\xcc\\xf8y*\\xee\\xf2t\\x88\\xb8\\x9f\\xea\\x0f\\xe6\\x05\\xdf)\\x99\\x9dO\\xea\\xa7\\xbf\\x13\\xf8\\xb8\\x84\\xcf\\x90O\\x9d\\x922\\x19\\xd3\\x8f:\\x9f\\xd3D\\xb7<\\xd3\\x01\"\\xe4\\x83\\xfb)\\xd6\\xcf,\\xa0g8\\xee@>\\xdd\\xba]\\xd6\\xbc\\xbf\\xa2\\xc8\\x0f\\xe3\\xbe\\x91\\xbe\\xd3\\xab\\x0b\\xdb{\\x89\\xed\\xa7\\x8e\\x00\\xf1\\xefn\\xe8\\xee\\xdbw\\xbe|\\x14\\x8f\\xe9E\\x9b\\xff\\x19\"\\\\\\xf0\\x18\\x85\\xb1\\xc7\\xd3\\xc1\\x19O\\x8fx\\xce\\x93Y\\xeaoz\\xcc\\xdc9?\\x86\\xad\\xb0v\\xdc\\xf1\\xceO\\xcbp\\x1e4\\xf1\\x0fL\\x8f\\x1c\\xbdeEF\\xc6\\xa2\\x1f \\xda{<\\xf8\\xad,\\xdea\\xd6\\x89?fB\\xc4\\x82\\x8d\\xea\\xde\\xa6\\xf0\\xe7\\xe4\\x07\\xfcF\\x02\\x9f?\\x08vP\\xd0\\xb8[\\xfa\\xfc]\\x03\\xdbaZ\\x15\\x94:\\xab\\xcbO\\xef6\\x838\\xceR_\\xbe\\xf7\\xba\\xbb_\\xab\\x80z\\xa9\\xa0\\x9f\\xfe\\xa3\\x96~\\n\\xc7\\x83\\xc9\\x85\\x89\\x03s?\\x8e\\xd6\\xfe\\tA{&d\\x9f\\xdd~\\x8d\\xeb\\xb3\\x1d_^\\x1b\\x1f\\xd8\\x9e\\r\\xc9\\xbd\\x7f\\xbdN\\xab\\xd21^\\xfcj[\\x9e\\xe0\\xd1\\xe2\\x14\\xee\\xa73\\x83\\xbb\\xbc\\xd7`\\xf4e\\xe7<p\\xdf\\xda\\xf84IL\\x1b\\xe2\\xb4\\xa7Q\\x07L\\xa7t|/\\xa6o\\x8fS\\xd5\\x10Ir\\x83|\\x9e\\x88\\x1cGq?\\x84(v<x,r<P\\xc4\\x16\\xfbv\\xdf\\xd7\\x9b\\x82H\\xb2k\\x92\\x1d\\xc0~\\n\\xdb\\xd3\\xd8#&rR\\xab\\x87\\xd5\\x18+z\\xee\\xdf\\xe14#\\xbc\\x9dX\\xfd\\xe0\\xf6\\xd5\\xa6\\x1f{\\x8d;\\x90\\x0f\\x1cw\\x0e\\xefL\\xe9sdh\\xf4@\\x88x\\xdcY\\xfbt\\x8c\\xcb$\\xfe\\x7ff\\x7fA\\xe0S\\x9f\\xc0gT\\xc6\\x02\\xc9\\xa9\\xbbM\\xfa`Zl\\xbcC\\x1a\\x0f\\xaa\\tv\\x90\\xd9K}`B\\xe0\\x15,~\\x87\\xdd\\xed:.^ZQ\\xd5\\x0b\"\\x05\\xeaI\\xf6F\\xd2\\xcf\\xbdwV\\xe5\\x9fn>\\xf3,\\xa6\\xebJ?\\x0bF\\xfe\\xb8\\xae\\x93\\xdf\\xec*\\x88P?\\xd6\\xfa\\x05\\xa8\\x9f\\xd2-YTy\\xe4w\\x9fB\\xc4\\xed\\xc1\\xfd\\'\\xcbJ\\xb9\\xe9~\\xbdw\\xd9\\xf5\\x94\\xae\\r\\xa6m\\x8d{Ir\\x83q\\xef\\xd6\\x8dz\\xef\\xcf2R\\x1a\\xb5{\\xb6\\xd5 w\\xab\\xba6\\xec\\x93\\xe0\\x16+\\x1a\\x9d\\x9b\\x83\\xe5\\x86\\xe3x\\x92]\\x93\\xe2\\x1dUT\\xbd\\xdb\\xed=\\x7f\\xda\\x89\\xe9\\xc3\\xaa\\xf1\\xc2\\xe2\\x8fZ\\xfd\\x0c\\x11\\xc6\\x89\\x9f[i\\xd70N\\xfc\\xd1\\xffb\\x9f%\\xae\\xdb\\xbaA\\x8c\\xb4\\xd4\\xf7u\\x9d\\x12\\xe3\\xd5\\xab\\xe4\\xc1\\x1a+\\xf9\\xb8e{\\x06L\\t)\\xe9\\x8d\\xe9\\xd3*7\\xcd\\x17\\xa7:\\xa6C$\\xf9\\x85\\xbf:\\xcf\\xba\\xb09\\xf1\\xc8\\xbf\\x9f\\xaek\\t\\x11\\xcam\\x9d\\x95\\xfa\\xb1\\xb7\\xdc\\x9e\\x8a\\x94\\xdb\\x8au\\xdc`\\x93\\xbc\\xb9\\x02\\xa2\\xadq\\xd5\\xdd5-\\xa3\\xae\\x14\\x16<\\xc6\\xf4\\xa7\\xa7\\xf3\\xdb\\xcd\\xee\\xd0\\xee(\\xc6G\\x9eO*\\x19\\xff%w\\xa1\\xff!\\xf5\\x1f\\xb1\\xfe\\xa7\\xa8:\\xcd%N\\x93:\\x12#\\x9c\\x07\\xe3qg\\xb5\\x95\\xed\\x91\\xfc\\xd2\\xe6P\\xa3%\\xc9\\x871=\\xf8\\x9eo\\x84\\xbb\\xa4\\xdf\\xa7\\x18{~\\xf1\\xd3\\xbfF\\xdd\\xba\\x11\\x89\\xfbi\\xea\\x9d\\xd9!\\x1e\\xbe\\x81mIv\\xf0\\x88\\xa0\\x9f\\xea\\xde\\x93N\\x8f\\x98q\\xe14\\xa6\\xa3\\xbb\\x96\\x97mv:^\\tQl\\x1c\\xf2\\x80\\xc0\\xe7\\xbf5\\x0e\\xc1|k\\xb3\\x03\\x8f6y\\x9a\\x94\\xf53\\x7f\\x82\\x08\\xc7\\x03k\\xfd\\x02lO]\\xf9\\xd3\\xd6\\xf99\\xf7F\\x96\\xd5\\xbf\\x01\\x11\\xfa\\xd3e\\x04>\\x8d\\t|\\xfej\\xbcc\\xab\\x9fk\\xd3y\\xdc\\xbbKb65\\xc7H\\xab\"Z\\x7f\\xf1Mq}\\xd8\\x7fH~\\x8e4\\xcf\\x82\\xfd\\xc7\\xd6\\xb8\\xaa\\x9a\\xc0\\x07\\xc6U\\x9b6l/L\\xbf\\xa1/\\xc1X\\xd1\\xa1S\\xb1\\xb3\\xfb\\xd2\\xfd\\xb0=$\\xfd\\x88mO\\xd4\\xef\\xc6\\x1d\\xb3\\xa6\\'\\x96C\\xc4y\\xa4\\x90\\x92\\x01}\\x1e\\xae\\x1e\\xf0\\x80\\xe4\\xe7\\xde6\\xbb\\xc6r\\x82(\\xd6\\xaeI\\xfe\\x14\\xdau]\\xb5\\xe7c\\xa7\\x9c2\\xe1\\xd8\\x92\\x8f!\\xda;\\xee\\x1d\\xfdU\\xcf\\xe2\\xa0\\xe8\\x8cG\\x18G\\x0c\\xad,\\xba\\x99\\xee\\x1c\\r\\xc7Qk\\xe7%\\x7f\\xf2\\xa7\\xbb\\xc7\\x1e\\xb9z5\\xa8)\\xc4\\xb1X\\xae\\xb5\\xe4-I|\\xa0\\xbdm\\xdcy&\\xd8\\xa1P2\\x13\\xa2\\xd8<\\x1f\\x89\\x0f\\xcc\\xf3\\xb1\\xc2\\xdfK\\x9d\\xe6\\xf8\\xe7B\\x14\\xdb\\x1e\\xb1y\\xd8\\x03\\x19_\\x7f\\xea\\xb3#j\\x04FU?\\xaf\\xb9\\x15U\\x1eS\\xe0xP`e{\\xe0xpm\\x9a\\xcb\\\\\\xd61n\\x1b\\xc6\\xc0\\xce\\xba\\x16\\x01\\x81\\xf3\\x02\\xedm\\x07\\xb6\\xc6\\xa3\\xa4\\xf1\\r\\xc6\\xa3\\xa1m\\xd2\\'\\'\\xfbW5\\xc6(+u\\x99Q\\xfctng\\xb1q\\x15i<\\x80rk\\x1cp0\\xa3E\\xd9\\xc0^\\x10\\xa1\\xbdY+7hou5\\xff\\xb15\\x8eo\\x00\\xf8\\xe1\\xe30\\x8e\\xcf\\x9b*l\\xdf\\xddy]W\\x88\\xa4\\xf5\\x05\\xb1y\\x178\\xff\\xa9\\xfcJr)\\x7f\\xd2\\x16_\\x88P?9V\\xfa9\\xa8\\x1fe\\x1b\\xc5\\xd1\\x07\\xae\\xc3zB\\x94Z\\xea1\\xda\\xba>7\\xafj\\xfe\\x86U\\xbbV?\\x83h\\xef\\xf5\\x92\\x85\\xa6\\x88\\xfe\\xf9K\\x82\\x87A\\x84|H\\xfd\\x87\\x94\\xb7\\x84|F\\xfc\\xcda\\xdb\\x90\\x89\\xf2\\x04\\x88\\xf6\\x9eo7\\xfb-\\xff\\xb3z\\r&\\xad\\xc2\\xe8\\x7f\\xbfkT\\xbd\\xae\\xe1\\xae0\\x1f\\xb2\\x9e\\xc0\\xe7.\\xa1=0\\x1f2gp\\xe4\\xc9\\x83\\x17S\\xaa0\\x92\\xe2\\x03k\\xc7\\x83\\xae\\x8f\\'\\x95\\x97ui\\x19\\x84if\\xc7\\xf9;\\x81\\x17\\x03\\xdbB\\x84\\xfa9h\\xed8\\n\\xf4#v\\xbem\\xab_8z\\xae\\xd9\\xdd\\xb5\\xc5SJ!\\x8a\\x8dG\\xc5\\xda\\xc1\\xde!E3\\xba\\xac\\xf7\\x0b\\x85(\\xd6o\\xdf\"\\xb4\\x07\\xf2\\xa9\\xabu\\xe7\\xc1y\\x83\\xdc+:\\xb8\\xfc\\t\\xc5\\xc6;b\\xed\\xa0\\xe0\\x87\\x02\\xcd\\x89\\xf7\\xe4\\xf9\\x10\\xf1\\xfc\\xa7\\x85\\'7\\xb4\\xf1\\xc1\\xf8\\nk\\xe7?L\\xf9\\x96\\x95\\x87\\xcf\\xed\\xb9\\x84\\xe9o}\\xbe|\\xf2xUq\\x11D\\xb1\\xe3\\x01i^\\x0f\\xf5c\\xab\\xbd\\xbdm\\xf3\\x9f\\x98\\xf2Qj\\xdd\\xc3\\x8e\\xcb\\xa2\\x9b?\\xf8\\xa0@\\x1f\\xd6\\x0c\\xd3b\\xe7?\\xe5\\x04\\xfd\\xc0\\xf9\\xc2\\xeai\\xefvZ\\xae\\xee\\x12\\tQ\\xac~Hv\\x00\\xe56\\xba\\xe5\\x8d\\xd2\\xcb\\xb9\\x11\\xdfB\\x84\\xf1\\x01\\x89\\x0f\\xc9\\xaea|\\x90~x\\xef\\x8c\\x85\\xfb\\xc2\\x07C\\xc4v\\xdd\\xf6f\\xfd\\xb4\\x8d+=z\\x92\\xec\\x9a\\x14\\'6\\x18|\\xf4j\\x9a\\x13\\x87\\xd5l\\xf3:`\\x19\\x81\\xcf\\xff\\xf7\\xf5\\xfa\\xbaZ7\\xabwi\\xca\\xb9T\\xa7a?C\\x84\\xef\\xd5\\x90\\xf2|b\\xc7\\x1d[\\xf5C\\x1aw\\xa0~>\\xba0\\xf6\\xc2\\x86\\xacAR\\x88\\xf6\\x8e\\xabr/\\xafx\\xeczoq\\nF\\xb73k>\\x0e\\x9a`t\\x82v@\\x1awH\\xeb\\x0b\\xd0\\x0e\\xea\\xca\\x9f.o0v\\xae\\xef\\xa3O{B\\x14;\\x9f\\x13\\xebOm\\xcd\\'\\x92\\xec\\xcd\\xde\\xeb\\xb4b\\xed\\xed\\x87\\x1foO\\x1c\\xf18\\xa8_\\x87\\xa3\\x8al\\xdf\\xfb\\x93\\xd31\\x8d\\xd7K\\xb0\\x1dX\\xbb^\\x02\\xed\\xe0\\xb7\\x03\\xa1Ky\\xcd\\xb2a\\x18?<u#=\\xfd\\xf7\\xb6,\\xb6\\xb7\\x01\\x91+\\xa8\\x07\\xe7\\x9b\\x0c&\\xcdK~#\\x8d\\xd7M\\xf6\\xbd\\xeb\\xd9\\xff\\xf1\"Lo\\xdepPu\\xc9\\xa5b\\x07D{\\xf7\\x9f\\xb0F\\x13u\\xec\\x95\\xc5~\\x10\\xc5\\xf2!\\xd9\\x1b\\xe4S\\xe6\\xb7\\xfe\\x8a\\xf2(\\xe5\\x05Ql\\xdcK\\xf2s\\x90\\x8f\\xad\\xebL\\xa4\\xbc\\x18\\xf4s\\x9f\\xaf\\xdd-[+Oo\\nQa\\xa9\\xd76\\x99\\x7f6\\xcc?w*i>\\x87\\xf3\\x14\\xb5\\xad3\\xb1\\xbey\\xd1\\xac\\xc7\\xbe\\x7f@\\x14\\xab\\x1fR\\x9e\\xc2\\xde~\\x814\\x1e\\xc0~z2m\\xe5\\x8ca\\xcf\\x16\\x1dl}rO\\xb9\\xe7\\xa3\\x1b\\xdfcZ\\xec\\xba&i<\\x80q\\xa2[\\x9f\\x03\\x87n\\x8d,\\xd8\\x8c\\x11\\xae\\x9f\\xe2~j\\xedx\\x90\\xe9\\xe5\\x91\\xd0\\x8aj\\xb6\\x11\\xd37\\xdf\\x0f\\xd7/\\x90\\x7f}\\x06\\xe3\\xf1\\x9c\\xdf:\\xcfk!\\xbd\\x0c\\xf3|\\xd6\\xc6!0\\xcf\\'o\\xb4mx\\xcbE\\xb73!\\xda;\\x7f]Y,=1\\xfd\\xd8\\xea\\xa3\\x18]\\x83\\xa2*\\x07\\xae\\xdev\\xc0\\xde\\xf9^[\\xfd)\\xc9\\x0e\\xa0?}\\xdb\\xde#&\\xf9m\\xb1\\xef\\xf7\\x8a}\\xdf\\x9f\\xc4\\x874\\xbeA>u\\xf5\\xde`\\xe5\\xad\\x90J\\xa7\\xe6\\xbf{A\\x84\\xfa!\\xc5o\\r-\\x08\\xc7Q\\xa8\\x9f\\xd4\\xc7\\xdd\\x1d\\xb7\\x7f\\xb2~\\x10D{\\xf7\\x1f[\\xf3\\xd7\\xc4x\\x07\\xe4\\xaf\\x1bR\\xc6\\t[\\xb4\\xe9\\xfd F[\\xea\\xb1\\x1d\\xd8\\x9a\\x87=\\xdf\\xa6\\xa8`m=\\xa1=D\\xc8\\xc7\\xd6\\xf7\\xd6m\\xf5sb\\xf3!\\xd1\\xb7\\xf7:\\x8f\\xbe\\xb5u!F\\xe8\\x17\\xfej\\x9cx\\xe3k\\x87\\xcb\\xd1\\xd9~~\\x98\\x0e\\x1c\\x7f>>\\xf7\\xe8\\xf2\\x08\\x8c_/\\xea\\\\\\xe6\\xc2\\xcc\\x18no\\xbf@\\xb2\\xeb)\\x96z\\x97\\xd32\\xffE\\x95Y!\\xd6\\xb6\\x07\\xca\\xed\\x01\\xb3fZ\\x8b\\x14\\xcf+\\x10q{\\xa6\\xecJ:\\xd3\\xad\\xa4\\xe5ak\\xf3\\xbd\\xa7\\xfd\\xc2U\\xf7\\x9f$x\\xbc\\xe0\\x9b\\xd6\\xe9\\x1d\\x9d\\xf3\\xd9\\xb6\\x10q\\x1c2Jr\\xb2\\xd71*\\xc6\\xa3\\xd0\\xca\\xf6\\xacI\\x9d\\xf3\\xf9\\xcdV\\x15\\xdfczuRT\\xf5\\xfaQE\\xf50\\xde\\x95\\xb9\\xc6\\xe7~\\xb9\\xe7;\\xb1yeR{`^\\xd9\\xd6|\\xaf\\xd8\\xb87\\xcbEr\\xeb\\xfc\\xb6k\\x1e\\x10\\xc5\\xe6\\x0f\\xc4\\xf6\\x9f\\xb7\\xed\\xfdQR\\x1c\"\\xf6\\xfdQ\\xea\\xfc\\xc5V\\xbbW+\\xc2!\\xda;\\x9fXW\\xf1N\\xfb\\x9f\\x07-H\\x1a\\xea\\xd2\\x14\\xa2\\xd8uM\\xb1\\xf1\\x8e\\xd8\\xef\\x99H\\xdf\\x9b\\x89\\x8dC\\xa4\\xdbKW\\xba\\x16\\xe5}\\x08\\xd1\\xde~;\\xe4\\xa3\\xb4\\xa5\\xa7\\xafo\\xef\\x04\\xd1\\xda\\xf7\\x06!\\x1f\\xf8\\xfe5~O\\x10\"i\\xbd\\x04\\xdf\\x17\\xf3\\x11\\x9b\\xdf\\xa9\\xab\\xf5\\xfa\\x86\\xf5\"\\x1a\\x15L\\x1e\\x9b\\nQ\\xec:\\xad\\xd8\\xf6\\xd8\\xfa]\\x1bi\\xfd\\xd4\\xde\\xf3zL\\xd76\\xaf_\\xb1[]\\xe09\\xdf3\\x11\\xa2\\xbd\\xd7\\xd1\\xd7\\xa4\\xcc9\\xd5x\\xf4\\xb1\\x00\\x88\\x90\\x8f\\xb5q\\x08\\xe4\\x83\\xbf\\xff\\x85H\\x81zk\\xd7\\xe7\\xa0\\xdc\\x9a\\xff\\xb2\\xec\\xb8s\\xd5\\xde<\\x88\\xf6\\xf6s\\xe7\\x9d?\\xb8\\xbb%\\xcf\\xc5\\t\"\\xf6sXn\\xd6\\xfa\\xb9\\xde\\xd3.\\x8fx\\xb7\\x7f\\xf7\\x1cL\\xdf\\xd0\\x155{\\xa2\\x0fo\\x85\\x11\\xe7E\\xa0\\x9f#\\xcd\\x7fH\\xe3(\\xfc\\xde\\xf9\\xfa\\xa6\\x15WwF%\\x16@\\xb45\\x7f\\r\\xe56r\\xabwb\\x8f\\xd4\\xa74\\xc6\\xae\\xe1\\xef\\x1c\\xf89\\xe4\\x93\\xe2\\xb7-\\xae\\x12ko\\xc3:4\\x97\\x87N\\xbe\\x1d\\x05\\xd1\\xde\\xef\\xf3\\xcd6\\xaa\\xaf_rJ-\\x83h\\xef\\xf6\\xec\\r0\\xb4^c\\xd8\\xe9\\t\\xd1\\xde\\xe3ND\\xa9\\xfb\\xef\\x97V-[\\x0c\\xd1\\xde\\xef\\x05\\xd8k}\\xa1\\xb6\\xf5\\xc6\\xda\\xd6\\x17Z\\xa7u.\\xd8\\xba9\\xec\\xeaJ+\\xf5\\x93\\xcd\\xa8\\x1f\\xf5\\xf5^x\\x1c\\xd3_D\\xe9\\xfd\\x1d\\x8aK\\xf7@\\xfc\\xbf\\xfa\\xde\\xcc\\xdauM\\x18\\xef\\x0c^w\\xbf\\xe9\\x8d\\x92y9\\x10\\xed\\xbd\\xbe`k\\xbe\\x8a4_\\x80\\xf1\\x81\\xbd\\xe6\\xdb\\xb5\\xc5\\x07#\\xae\\x16\\xce\\xba\\xdf\\xf0~\\'\\x88p\\xbem\\xad\\x1d\\xc0\\xf9\\xb6\\xd8\\xf7\\xc5\\xac\\xf5s\\xf0}\\xb1\\xa9\\xdfW\\x1cNj0\\xe31\\xc6!\\xcbz\\x9c\\x9a9\\xe4^$\\\\7\\xb3\\xf6;\\t\\xb8n&\\xf6\\xffS\\xfc\\xb7|/C\\x0fs\\x1c\\xea9\\xe7!\\x05Q\\xec{5\\xa4\\xf5m8\\x1e\\xd4U\\x1e\\xa9\\xfb\\xad\\x93\\xeb\\xa3\\x86V\\xb4\\x83h\\xef<R]\\xf9\\xd3\\xba\\xfa\\xee\\x90q\\xae\\x98wc\\xbf*\\x1b\"\\xfc\\xff\\x07\\xd8\\x9f\\xe2\\xf9\\xe9\\xd2Z\\xe6\\x8d\\xf0\\xff\\x1f\\xd4\\xf6\\x7f~\\x9e-=\\x7f\\xfcD\\'\\x07-\\x1eG\\x1d\\x01\\x1fR{\\xcel\\xee\\xb7o\\xd5\\xc2\\x13/\\xf2.\\xf9\\x9b\\xf2\\x0fH\\xaf+6C\\x84\\xed\\xd9K\\xe0#\\xb6=\\xb6\\xfa\\x05\\xb1\\xdf\\x1d\\xda:o\\x14\\xeb\\x17B\\x7f\\x99\\xe6\\xd4kd\\x97s\\x18\\xbbf\\x145\\x18p8\\xeb\\xac\\xbd\\xbf?\\xad\\xab\\xef\\xcd\\xf0|\\x07\\xa2\\xad\\xf1\\x0e\\xfc\\xce\\xb5\\xae\\xf2o\\xa5\\xfb\\x0f\\x9cU\\xfd\\xe0\\x13\\x06\\xd1\\xde\\xf9\\xb7\\t\\x81\\xd2\\xef\\xd9\\xa4O*!\\xda{\\xbd\\xb1\\xae\\xde\\xa70q\\x1aJJs\\x87\\xbeq\\xc4?\\x07\\xb0\\xe7\\xf0\\xa6\\x83\\xaf\\x1ey\\xf9sx\\xf5\\xa0\\xc3\\xf3\\xbfW\\xaft\\xc0\\xe0\\xf0\\xcaI\\xaf\\xdf\\xe1\\xb5\\xb3\\xc1\\xed^?\\xdb\\xa2\\xb7\\x9a\\xbd,\\x15\\xcd(\\xf8X\\xeeP\\xfdo\\xd0\\xb1,\\x8e\\xd7*\\x19\\x05w\\xd1\\xa1b\\xa3\\xde\\xd99\\xb3\\x87\\xbe\\x8fL\\xdf\\x87\\xcb\\xfc[\\xe6\\x87\\x99.\\x99\\xaeF\\xd7\\xe0poT\\x86\\xa32\\xb3_\\xa6\\x9b\\xc1\\xad\\x87\\x9b\\xa1\\xbf\\xbb\\xbba\\x90\\xbb{\\xe6\\xd0L\\xcf\\x92\\xf7\\xbd8\\r-\\xe5\\x87Kh\\xad<9\\x82f8z\\xb8\\x84\\xe2\\xf8\\xe4q\\xb46\\xc6\\x8f\\xd5\\xaa\\x11\\xa5\\xe5_\\x9e\\xa5e\\x15\\xf8,-\\xcd\\xbd~V\\xb6\\x8fW\\xb8o@\\xa8W\\xb0\\xde\\xc7G\\xef\\xe3[2\\xc4\\x87B\\xe7yI\\xa5\\xc9\\xfe4#\\xa3\\xb5\\xc3Ci\\x1d\\x9f\\x1c\\xaaS\\xc7\\xa0\\xfd1\\xe8\\xa1\\x93\\x11S\\x8ee\\x86\\x0fLF\\xf7e\"\\x924\\xe6\\xbbr%}_\\\\\\xf7\\x86s\\xfb\\xbf~\\xees\\x1e\\xa1\\xac\\xfa/\\xf10_W+\\x8f<\\x1f\\x96\\x99VC\\xf8\\xa85\\x82\\xafW\\xc4H\\xbdo\\xc4n_Z\\xaed\\x94<=\\x1c\\xed\\xbc<\\xddK\\xcb\\xbf\\xac\\t`d\\xaf\\xd5\\xe4\\xf8\\xd2\\n-\\x8d\\xee\\xc9r\\xc2\\xa8H\\xc9\\xa8\\xcc\\x00}@\\xa8>0P\\x1f\\xe2[28\\x84ee5W\\xbc\\xf1\\xd9\\xdf\\xa4\\x18?%#\\xf2\\xb2\\xd74e\\xbe\\xac\\xfb\\x8b\\xcb\\x08g\\xe8CC\\r\\xa1\\xa1\\x12\\xb4\\x8d\\x11B\\xc3\\xc2%y\\xe8\\xf6\\xcfE@ie\\xb9\\x16^\\x12\\x95N\\x9b\\xfb\\n\\xdf\\x12\\x17k\\x1e\\xa2\\xf0\\xb5\\x93\\xb1\\x98|i\\xf5\\x9b+\\xd0\\xc3f\\x85=7/\\x83$\\\\\"\\xa0\\xed\\xfd\"\\x0b\\x8f\\x01\\xc9H\\xa4\\xdc\\xf0H\\xc4\\xe1U\\xc5}-\\xd11R~\\x8cRF\\x9b\\xf9%\\xd7P5u\\xdeZi\\xdc+\\x95\\x01\\x8c\\x12TnyI\\xfa\\xb0j\\xf5+\\xa4/\\xc5\\xc5\\xbeB\\xa2\\x07P\\xea\\xc3\\xbd\\x85\\xf0\\xb0\\xb0\\x08\\xc3\\x98\\xc8\\x10}D\\xd8.\\x82\\xae\\nI\\x9dk\\x17I\\x07\\xe3\\xbc\\r\\xe3\\xbc}\\xd1\\xe6\\x8f\\xb6P\\xb4I\\xd061\\xef\\xc59\\x01\\x8c\\xbc\\x86\\xa8y\\x92\\x10Vf\\x18\\x1f\\xeem\\x98:F\\x92I\\x19\\xa9\\x18V\\xc7\\x1b))\\xab\\xd6dQ\\xd2\\xe9:\\xa5\\x96\\xde\\xf4\\x1c\\x91P\\x8d\\x94,^\\xaa2\\xa1R\\x8d.\\xa2\\x144\\xdaX=\\xa5\\x16(D\\xeb)\\xc6@1\\xe80\\x93dB\\x1b\\xcb\\xd0FJ\\xa3a9\\x03\\xa5\\xa5\\xf5\\x14/\\x98\\xff]\\xa4\\x81\\xd2%\\xeac\\xe8\\xac\\x18ZJ\\xe98Z\\x88\\xa1i\\xc6\\x848*byC\\x8c.\\xc9$\\xa5\\xd4\\xb4\\x96\\xd2K\\xa5F\\xa9\\xf9\\t\\x8c\\xd2X\\x9a\\xd6\\x9ajJn\\x93\\xf9\\x08\\xcb\\xa1\\xc7\\xc8\\xae\\xd9\\xd312A\\x8a:\\x18\\xa2\\x18^\\xc9\\xe8h\\xa3TKI\\xe3\\xb2kJt\\x96AF%\\th\\xe3\\x0c2Z\\x836^\\x90\\xb11\\xd3P\\x91\\xc0\\x98h\\xc6\\xcc3\\x876\\x8fMJJ\\xa5J2\\xd0\\xf1r\\x01\\xf5>\\x99A\\xcej\\x05\\xb9n\\x9a\\xd2\\xa0\\xa0y\\xa3BEq\\x9c^\\xc1\\n\\n\\xd4\\x1cT\\xb02!\\xd6\\xdc\\xc6X\\x8aC;\\xf1\\xb4\\x10KSZS\\xac\\xd2<\\x80d=\\x07T\\xc1jh\\x13*\\xd03d*\\xf5J\\xb9Q\\xa9F\\xa22\\xd5\\x94\\x9c^\\xc9lR2\\xbcN\\xc9+\\xe3i\\xbd\\x12\\xd1\\xbc0M\\xc7\\xf1\\x9bT\\xe8\\xbe\\x9c\\x94\\xd2\\xd09/\\xf68A\\xa5\\x8c\\xa3\\x8d*\\xa5Z\\xc9g\\xd7\\x94\\xe8\\x96\\xe8X<mB\\x85Y\\x10*VJ\\xf1J\\x96\\x11T\\xac\\xb9\\x86e\\xe3\\xb2\\xcc\\x85\\xb9\\xf5*\\x96G\\x07xt\\x0f6\\x9eFT\\x82\\xa0\\xa6\\xb4qz5mT#y\\xc5\\x9ajJ\\xce\\xc4P\\xbcNK\\x0b\\x0cM\\xcbL\\xe6\\x82\\x96\\x19\\x18:A`\\x90B\\x05\\x86\\xe5\\xe9lF\\xf3\\\\\\xddF\\x86\\xd3\\xc5L31:\\xb5Y\\xd7\\xac\\xdc\\xc8\\xcay\\x9a\\xd1\\xb3\\x8c\\x01\\x89&\\xcb\\xdcZ\\xf4\\x1c\\xd9\\x16\\xe4\\xb2\\x90\\x15q\\xa8\\x8b\\x185f]\\xe5jbY\\x9eUh)Ml\\x92\\xa01k\\x01)\\x92\\x134ZZc\\xd4\\x98\\xbbD\\xb6F\\xa7\\x95\"\\xa1\\xd2Fdi<-pH\\xb6&N\\xaa5\\x9b\\x07G#\\x05\\xcb\\x84\\x9a\\xbbqj\\xa4,=\\xc7\\n\\x1c\\x8b\\x1a\\x82\\xb4\\xc7\\xc8\\x8c\\x1c\\x8f\\xbaBVM\\x89\\xda\\x80\\x90WJ\\xd1A\\xa5J\\x95\\xc3\\xe9\\x14H\\xe4f\\x01\\xe5\\xbe\\xdc\\xe5\\x04\\x9e\\x8a\\xa3M\\xa80K\\x93\\x8f\\xa5x\\x03\\x1fK\\xa3\\x1d%g\\xe2c\\xcdva\\xe4c\\x11g\\x81W\\xaai=\\xcf\\x1ax\\x965!W\\xa9A&\\x9f@q\\xc6\\x04\\x8a\\x97\\xc6f\\xd7\\x94\\xe8\\x06Y\\t\\xb4\\n5\\x91\\x16\\x12bi\\xc6\\x88\\n-\\x9d\\x85JtG-\\xa2\\x94*:;A\\xa9\\x92\\xa9\\x94rtXi\\xbe=oL`\\xb5*\\x99\\xb9DZ\\xa8)\\x93\\x8c\\x89f)\\x19\\x12\\xe9\\x81\\x86D~\\x80\\x90\\xc4\\xea\\xb4\\x86\\xf29k\\x05\\xb4\\xc9\\xcc\\x85\\xda\\\\pFT \\x93C\\x1a\\xe7\\x96\\xcf1\\xcaU\\x94\\x82[\\xfe\\xd9v$\\xb5\\xa9:&\\x8eAf=\\xf5y\\x94r0\\x17!3U\\xa1eu\\x1an\\xf9!\\xc7\\xd4\\xff\\x00\\x8e\\xcd\\xeb\\xe1'", "year": "2021"}, {"Unnamed: 0": 202051, "autor": "lungbunny", "date": 1610898310000, "content": "Fuji XH1. 1/1600 @ƒ/5.6. Location: 65°37'11.2\"N 37°37'18.4\"W - Greenland.", "link": "https://www.reddit.com/r/fujifilm/comments/kz8nif/fuji_xh1_11600_ƒ56_location_6537112n_3737184w/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji xh1. 1/1600 @ƒ/5.6. -----> location !!! : 65°37'11.2\"n 37°37'18.4\"w - greenland.", "sortedWord": "None", "identifyer": 95342, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\xb6\\x17\\xec\\x89K#\\xd6\\x15\\xcd\\xd6C\\xa7\\x13\\x18 @\\xd0\\xea\\xfa\\x81\\xc7\\xcd\\x86\\xb7}.\\xd4\\xbe_r\\xe4I!\\x13\\x03v\\xc0\\x88\\xc6\\xd7?p\\xef\\x97\\x92\\xc9\\xf690\\xfeC\\xe3\\xe6\\xaa\\x8d1\\xe7\\xeb\\xd0it{\"V\\\\\\xde\\xf4\\xb8X}\\x13\\xba=\\xff\\xd1\\x00.{\\x16\\x1dZ\\xe3\\xf3\\xe6f\\xfdzt:\\x11M~/\\xd4\\xc1\\xe8\\xf6\\xfc\\xc3a\\x8fNPUZ|\\\\G,\\x8c_\\x14 5m\\xe7\\x83\"\\x13t\\x1a\\x97\\x7f\\x98\\xa1\\xe2\\xbd\\x8c\\xa8\\xe1E(\\xdc\\xd6\\xd85m\\xf7\\x9cy\\xab\\x08\\x9dN\\x85\\xca\\x8bo\\xea\\x8d\\xf3{\\xe8U\\x05\\x8b\\x1f\\x98=Mh\\x06\\xa3\\xfb\\xe7\\x04\\x9a<\\xa5\\xe1\\x86+~\\xd0\\xc3\\xadsY\\x88\\xe1\\xfa\\x1e\\x1fkt:\\x06*\\xbfI\\xe5\\x84\\xfbj\\xbb\\xc2+\\x94\\xa6\\xb7i\\xdc:\\xeb\\x02&s/@\\xa7\\x13\\xd1\\xe4I\\xf5\\x0fz\\xb8Y<}\\xdfxW\\xe3\\xd2bt\\x1a\\xe6\\xe1\\x18\\x05\\xe1\\x1d\\xafk>\\x97\\x10J\\x07\\xe8\\xf6l\\xe3\\x94\\x9f\\xdd\\xba\\xddX\\x0c\\xc6o\\xba\\x96Yl\\x92]\\x11\\x88N\\xa3\\xdb\\xb3\\n\\x87\\x7f\\x88\\xb5\\'\\x9e\\xc5:\\x82Q\\xc6Z\\x14\\x9d&\\xd6?\\xacD\\xda\\xa3\\xab1\\xd5t\\xe6\\xf5(7t\\x1a\\xdd\\x9e\\xc9$\\xc6\\x0f\\xb9\\xe1\\x86\\xcb\\x1e\\\\\\xe5\\x01F\\xb8i\\xb63\\x9d\\xe9\\x95\\x0eB\\xa7\\x89\\r7b\\xfd\\xb3u\\xe3\\xac\\xa9b\\x0c\\xec\\xf5\\xe84,]\\xff\\xed\\xbdv\\xea\\xac4C\\x11\\xaet\\x8d+\\x1d\\\\Z\\xab\\xb7\\x7fJ\\xe7\\xd9\\xad0\\xbek\\x1fW\\xb0\\xe9\\x05\\xd7\\xbf\\xe8t\\x02T\\x1eV\\xbe\\xe1\\n\\xb7\\xeft*\\xaf\\xbf\\x11Y\\xee,+.HLN->\"\\xc8\\xc8\\xc0\\x08D\\xa0p\\x00! ^\\x9e\\x93\\x9a\\x97^\\x92Q|\\x84E\\x10\\xa8nyqIQf^z\\xf1\\x1d\\x06\\xf9\\x05\\x0bu\\x17\\xea-3\\xd47430Xdl\\xbe\\xd2\\xd8\\\\\\xdd\\xd0P\\xcfH)\\x0f\\xcc\\xb2\\xd03Q*_df\\xba\\xd0j\\xb9\\xc3\\xb1I\\xfa\\xa6zf\\x8b\\x1d]\\\\V8;\\x06\\xb9x\\xfa9\\xfa,rvY\\xe2\\x11\\x19\\xe0\\xb1\\xc8\\xcfo\\xb1\\x9f_\\xc0\\x1a\\xbf\\xd2\\xdc\\x90\\xca\\x82T[\\xe7\\xc4\\xa2\\x94\\xd5@NRj\\x91m0\\xd0\\xa2\\xe5\\x01A\\xfe.\\xa1\\xce!\\xeb\\x02J\\xf3\\x92K\\xc0J\\\\\\x12\\x8b3\\x90\\xb8\\x01\\xa9E\\x99K\\x82\\xfc\\xfdC\\x96&\\x16\\x14\\xe4\\x17/I+\\xcd\\xca\\\\\\x99^\\x94\\x9a\\x9a\\x97\\x93\\x98\\x97\\xb2\"\\'?9\\xb1\\x04X\\xe1/\\xc9\\xcb\\xcdOY\\x96W\\x9a\\x0b\\xa4\\x96\\x16\\x80t/\\xae\\xc80\\\\th\\xc3\\x12\\xa0|\\xf1\\xc4\\x86\\xa5i9\\x89\\xe9\\xc5\\x13\\x1b7e$\\x16\\xc7\\x97\\xe6e\\xe7\\xe5\\x97\\xe7\\xc5C\\x02\\xe5\\xd0j \\x9d\\x17\\x9f^\\x94_ZP<\\xf1\\x08\\xe3\\x04\\x00\\xc0\\xf0\\xb8\\x06'", "year": "2021"}, {"Unnamed: 0": 203294, "autor": "lungbunny", "date": 1611501336000, "content": "Fuji XH1 - XF16-55. ISO 200. 1/1000@ƒ/5.6. Tasilaq Greenland. Location: 65°37'10.1\"N 37°37'54.9\"W.", "link": "https://www.reddit.com/r/fujifilm/comments/l4164a/fuji_xh1_xf1655_iso_200_11000ƒ56_tasilaq/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji xh1 - xf16-55. iso 200. 1/1000@ƒ/5.6. tasilaq greenland. -----> location !!! : 65°37'10.1\"n 37°37'54.9\"w.", "sortedWord": "None", "identifyer": 96632, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\xce\\x03\\xec\\x89K#\\xd6\\x15\\xcd\\xd6C\\xa7\\x13\\x18 @\\xd0\\xea\\xfa\\x81\\xc7\\xcd\\x86\\xb7\\x83\\xbd\\xd5\\x95\\xbe\\xed[\\x9d\\xc8\\xc4\\x80\\n\\x18\\xd1h\\x18\\xd0?p\\xef\\x97\\x92\\xc9\\xf690\\xfeC\\xe3\\xe6\\xaa\\x8d1\\xe7\\xeb\\xd0it{\\xe6A\\rB\\xb7\\x07\\xc6\\xff\\x0f\\x05\\xb8\\xec\\xd9\\xbaq\\xd6T1\\x06\\xf6zt:\\x11*\\xff\\xb7\\xf7\\xda\\xa9\\xb3\\xd2\\x0cE{q\\xd8\\x03\\xf3\\x07\\xba=\\x97\\xd6\\xea\\xed\\x9f\\xd2yv+\\x8co\\x9f/\\xb9c\\xa3\\xc8#\\rt\\x1a\\xdd?>\\x17j\\xdf/9\\xf2\\xa4\\x10\\xdd\\x1e\\x18\\xa0\\xb5\\x7f\\xfe\\xa3\\x01\\\\\\xfeqM\\xe9Sf\\xbd\\x154\\x0b\\x9d\\x8e\\x85\\xca\\xc7(\\x08\\xefx]\\xf3\\xb9d2\\x0e{\\xfe\\xe1\\xb0g\\x1b\\xa7\\xfc\\xec\\xd6\\xed\\xc6b0\\xfe\\xa2Ck|\\xde\\xdc\\xac_\\x8fN\\'\\xa2\\xc9\\xe3\\xf2\\xcf_\\x1c\\xf6\\xe8\\x04U\\xa5\\xc5\\xc7u\\xc0\\x9c\\xcbP\\xf8J\\xf2\\xa2p\\xeb\\xff[\\xe8t\\x02T\\x9e\\xd8\\xf8!\\x94\\xae\\xbf\\x98&\\xb4\\xbcr1\\xb3F\\xa7\\xd1\\xc3-b\\xc5\\xe5M\\x8f\\x8b\\xd571C\\xc5{\\xa1\\x06\\xe3\\x8a\\x1fj\\x87\\x1b\\xae\\xf8A\\x0f\\xb7c\\xdf\\x0c\\x9c{\\xd5\\x9d\\xca\\xd1it\\xff\\xc0\\xc2\\r\\xdd?\\xb8\\xc2\\x8d\\xda\\xfe\\xc1\\x15n\\xe8\\xfe\\x11j}\\xaazYg\\xee1t:\\x01*\\x8f^\\xbe\\xc1\\xfcS\\xc3\\x88\\xea\\x0fB\\xe9\\xc0\\xb5\\x8f+\\xd8\\xf4\\x82\\xeb_t\\x1a\\xdd\\x1eX\\xb8\\xc1\\xcc\\xabA3\\x98Py@\\xafp\\xeb\\\\\\x16b\\xb8\\xbe\\xc7\\xc7\\x1a\\x9d\\x8e\\x81\\xcaoR9\\xe1\\xbe\\xda\\xae\\xf0\\n\\xa5\\xf9g\\x1a\\xb7\\xce\\xba\\x80\\xc9\\xdc\\x0b\\xd0\\xe9D4yR\\xfds\\x02\\xcdb\\x8b\\xa7\\xef\\x1b\\xefj\\\\Z\\x8cN\\x13\\xca\\xa7\\x1dh\\xe9\\x80P>m\\xba\\x96Yl\\x92]\\x11\\x88N\\xe3*Ga\\xe6\\xc2\\xec\\xc1U\\xbe\\xa1\\xdb\\xc3\\x9by%\\xf1\\xd4\\x8d\\xbd\\xcf\\xd1i\\\\\\xfeA\\xb7\\x07W}\\x8an\\x8f\\xae\\xc6T\\xd3\\x99\\xd7\\xa3\\xdc\\xd0i\\\\\\xf6\\x10[\\x9f\\x12\\x1bn\\xb0\\xf4V\\xed#+\\xc1\\x1ax\\x9f\\x0bW\\xfd\\x83+\\xdc\\xb8+\\xa6\\x99\\xb1\\xed\\xe2\\x90\\x84\\xf1\\xad\"<]\\x1c\\x96\\xeb\\\\B\\xa7\\x89-\\xaf\\xff\\xd0\\xa9\\xbc\\xfeAd>]V\\\\\\x90\\x98\\x9cZ|D\\x82\\x91\\x11d\\x12\\x90`\\x84\\x12\\xd0\\xb0_\\x9e\\x93\\x9a\\x97^\\x92Q|\\x84E\\x02\\xc4+.)\\xca\\xccK/\\xbe\\xc3\\xa0\\xb6`\\xa1\\xeeB\\xbd\\xb5\\x86\\xfa\\x86\\x06\\x06\\x06\\x0e\\xc7&\\xe9\\x9b\\xea\\x99-620Xdl\\xbe\\xd2\\xd8\\\\\\xdd\\x10\\xd8~T\\xca\\x03\\xb1LM\\xf4,\\x95\\xca\\x17\\x99\\x9a.23]h\\xb5\\xc2\\xd91\\xc8\\xc5\\xd3\\xcf\\xd1g\\x91\\xb3\\xcb\\x12\\x8f\\xc8\\x00\\x8fE~~\\x8b\\xfd\\xfc\\x02\\x808x\\x8d_inHeA\\xaa\\xadsbQ\\xcaj \\')\\xb5\\xc86 \\xa7\\xb4\\x08\\xc6\\x0e\\x06Z\\xbd,\\xc05(\\xd8\\xdfo]@i^r\\tX\\xb5Kbq\\x06\\x127 \\xb5(sI\\x90\\xbf\\x7f\\xc8\\x92\\x10O_\\xd7\\xa5\\x89\\x05\\x05\\xf9\\xc5+\\x92\\xf3s\\x0b\\xf2K\\xf3R\\x16\\xa7\\xa4\\x16,I+\\xcd\\xca\\\\\\x99^\\x94\\x9a\\x9a\\x97\\x93\\x08\\x14\\xca,\\xce_\\x91\\x93\\x9f\\x9cX\\x02l\\xf6.\\xcb+\\xcd\\xcd\\xcdOYZ\\x002nyIbqfNb\\xe1\\x92\\x8a4C\\xb3\\xc5\\x15\\x19\\x86\\x8b\\x0emX\\x02TW<\\xb1aiZNbz\\xf1\\xc4\\xc6M\\x19\\x89\\xc5\\xf1\\xa5y\\xd9y\\xf9\\xe5y\\xf1\\x90\\xa0<\\xb4\\x1aH\\xe7\\xc5\\xa7\\x17\\xe5\\x97\\x16\\x14O<\\xc28\\x01\\x00a\\xdd\\xbd\\x02'", "year": "2021"}, {"Unnamed: 0": 203296, "autor": "lungbunny", "date": 1611498789000, "content": "Torshavn (Faroe Is), Denmark. XH1 - XF90mmƒ2.8 - 1/400@ƒ/5.6. Pano 7478x3956. Location: 61°59'49.0\"N 6°45'41.2\"W. August 8, 2019", "link": "https://www.reddit.com/r/fujifilm/comments/l40i86/torshavn_faroe_is_denmark_xh1_xf90mmƒ28_1400ƒ56/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "torshavn (faroe is), denmark. xh1 - xf90mmƒ2.8 - 1/400@ƒ/5.6. pano 7478x3956. -----> location !!! : 61°59'49.0\"n 6°45'41.2\"w. august 8, 2019", "sortedWord": "None", "identifyer": 96634, "doc": "b'x\\x9c\\xadW\\rL\\x1be\\x18n\\xe5gN\\x16\\x8d\\x18\\x18j`\\xa6\\x9a\\xa0\\x91\\x95\\x16Z\\x06h\\x9dP\\x06\\xc3\\x95R\\n\\x19\\xe8\\xd0r\\xd0\\x83V\\xe8]\\xb9\\xbbBeu073\\x89\\x92\\xf03\\xd18g\\xe8\\x1f\\xb4\\x96\\xc1\\x86\\x8e\\xcdm:d\\x80sI#\\x8e\\x85\\x05\\xf7\\x9795sBX\\xd4,:E<\\xc6}\\x91\\xbdz\\xa18\\xbe\\xb4\\xf7\\xdc\\xf3\\xbd\\xb9\\xf7\\xb9\\xf7{\\xdf\\xf7\\xbb\\xbb\\xc6\\xae\\x1a\\x9c\\xa2\\x8d$\\xe1\\x94\\x88\\xa5n\\x8ca(zo\\x9a2\\xfb\\xb9M\\xaa\\x1cu\\xae\\xc6/\\x1c\\xf2\\x0b\\x87\\xfd\\xc2\\x91N\\x86\\xac\\xc4\\tzx\\x95\\xc4\\xdbrm\\x7f\\xcb\\xa9\\xea:\\x88\\xc5\\x82\\xf9\\xb1U\\x15\\x1d\\x15\\x92w\\xe9\\x1e\\xd5\\xe8\\xab\\xd3\\xae\\xa1\\xef\\xaa\\xef\\x12\\xfc\\xf7\\x10\\x02\\x1efmO\\n=r\\xf7\\x83\\x88\\xf7\\x7f\\xddo\\xf6G\\x95\\xf7B\\xc48\\xfb}\\xeb\\xe9\\xd4\\x95\\x835S\\x9fr\\x8e\\xa0\\x0e\\xe2\\xb3\\xdc@\\xf3\\xc4\\xb7=m\\xc3g\\x8e\\\\@|\\xf6\\xc2\\xaa<\\xc7\\x0f\\r\\xd1\\x10K8\\xfb\\xfd\\xa9g\\x07\\xae\\xec\\x90\\x9e\\xdb\\xc7\\xe9\\x04q\\xf3\\xf5\\xc2\\xdb\\xe3\\x80:\\xf1\\x03\\x17o\\x8ad\\x87\\xdeG<\\xfd\\xf0\\xe4j}MQ<\\xc2\\x1b\\x97\\xdc1\\xdd\\x92\\xc8\\xe6B\\xce\\x1e>\\x13\\xee=_\\x98\\xfd\\xf9\\xc7<\\xf1\\xcc\\xcc\\xde>\\xd0|\\xf1\\xd9_5[&\\x7f.B|\\xcf\\xf0\\xd1\\xba\\xc6\\xe3Z9D\\xb4n\\x11W\\x83\\xdb;\\xda\\x92E|\\xeb6\\xcb\\xa3\\x13\"\\xff\\xe2r{(\\xadC\\xfc\\x93\\xc8\\x87\\xdel\\x9a\\xfa\\xf3Q\\x88\\x18\\xb0\\xf3\\xe9\\xfc\\xc5\\xa33\\x1d\\xb4\\xbbw\\xf4\\xde\\xadc\\x88\\xafo\\xaa\\xbdz\\x0eS\\x9c\\x86X\\xc2\\xd9Q~\\xbaA~\\x1a8~\\x93G\\x07\\xe6\\xc71\\xd8\\xad\\x9a\\x9c\\xa8\\xef\\x85\\x88\\x01;_<\\xbf\\xf3\\xe8\\xc4i\\xeb\\xcau/\\xbd\\xf1\"\\xe2\\x97\\x13w\\xd4\\x1d(\\xfej\\x1bD\\x18O\\xfe\\xa6X\\xd1\\x8d\\xcf|\\x18\\xd4\\t\\xe6\\x10\\xf6\\x0f\\x8c\\xe7\\xe0\\x81\\xf7\\xde\\x8e\\x14\\xac\\xa8\\x87\\x88\\xe2\\x99i\\x1a?\\xe5\\x7fX@\\xf1\\xc5\\x83\\xd6\\x11\\xc6sz\\x9f\\xf8\\xf8\\xeeF\\xffA\\xc4\\xb7\\\\d\\x8e\\xae)\\xceqB\\x0c4\\x1e\\xbe>]\\xeex\\xf8\\xfa\\x14\\xc6\\xb3\\xdaN\\xf8NDU\\x0f@D\\t,~\\xe4\\x81\\xc3?\\xd9~a\\x16\\xdb\\xdf\\xa0N\\xff\\xca5{^?\\x94\\x18\\x89\\xf8\\x9d\\xd6\\x1b_\\x9f\\xc2z\\xfb>\\x9a\\x14\\x14^\\xef\\x8f\\x80X\\xc2\\xd9Q~\\x96\\xba_\\xc3\\xfc\\xc8\\xe4S\\xde\\x1f\\xe3\\x85a\\x10\\xa1N\\x91g\\xac\\xef\\n\\x1d\\xdb\\x17h<\\xcb\\xdd\\xa7|\\xfb\\x0e\\\\\\xb7\\xc6\\xce\\x02i\\xef[\\xaa\\xa7 \\xa2\\xe7\\\\\\xdfc\\'\\xb3|\\xcfT\\x9f\\xb9\\xd3uk\\x0f\\x8b\\xeb\\xd1\\xb4\\x85u@\\xc4\\x80}\\xa9up\\x12\\x08\\'~\\xe9\\r\\x0f\\x15\\xfd\\x11\\x0e\\x11\\xd65\\xca\\x0f\\xea\\xff&\\xceO\\x08\\xd0C~a]\\xbf6n\\xa4e\\x95\\xd6<\\x88P\\xe7C\\xf0\\xfclZ\\xe4y\\nu\\x9c\\xdf\\xc4\\xed\\x14_\\xd3\\xcd@\\x0cT\\x87o\\x7f\\x83:\\xd73\\x85\\xcd\\'\\x9e\\xeez\\x17\"\\xd4i\\xe3\\xd1\\xe1\\xcb\\xcf\\xff]7>\\x1d\\xbe\\xba\\xfe\\xd7\\xbaE4\\xd6\\x1d\\xeb\\xdb\\xfe\\x0e\\xc4@u\\xf8\\x9es\\xcb\\xbd\\xbf\\xfd\\x16`\\x9f\\xae\\xd8\\x1b1\\x916\\x9a\\xf1\\x11\\xc4\\x12\\xce\\x0e\\xf77\\x94\\xf7]\\xa0?\\x16\\xeb\\xd3\\x0f\\xb6M?\\xe9\\xde\\x19\\x94\\x05\\x91\\xaf\\x7f\\x90\\xbf]K\\xac\\x83\\xa5\\xbeWA\\x9d@\\xdf\\xab\\xc6\\xc6\\r\\xbe\\xd6ve8\\xc4@\\xe3\\xe1{\\x1f\\x85\\xf1t\\xd2f\\xac\\x0c\\xa7\\x87b\\x84s\\xb7\\xca\\x1e\\xe6\\x86`\\xee7\\xcf\\x05\\xf3\\xe7]U8Q\\xc1\\x18\\xe8\\xa1\\xe0\\x18v\\xaa\\x8bf(#QA\\x9f\\x17$w\\xd8\\x1f\\xb7?a\\x8f\\xb3\\xafu\\xafUi\\xd3\\xd9\\xa3\\x96=\\xda\\xc5\\xdd\\xd2x\\x99D\\xf2\\xecHk\\xbc\\\\\\x9c\\xe4J\\x90HS\\xbc2y\\xacL*N\\x10\\xd5z\\xe5)\\xb1\\xb2\\x14\\xb1DD\\xd8\\x93\\x1cIR\\xef:\\xd9\\xbadkb\\x8a<\\xc9\\x9elO\\xf5(\\xd3\\xb4\\x19\\xd9\\xea4\\x95C\\x99\\xe1\\xcaH+\\xd8\\xe0\\xcc\\xd2lpm|^\\xb3qB\\x9eC\\x92zE6\\xa1\\xb7\\xa9-\\xa6R\\x9cR\\xe4\\xb3\\xf7`\\xd3\\xb0\\xdfG$\\xa1H\\xb4\\x15\\xb0\\x1f@\\xb8BC\\xe1\\xb4m3N\\x95f\\x92\\x94I\\x91i$\\x1cj\\xb5S\\xad\\xd6\\xb0\\xff\\xfcn\\xf6\\xba\\x82W\\xcc\\xb8B\\x89Qz\\x1f\\xe7DSe\\xa1|\\x0b\\x1c:s\\xb5Y\\xc74\\x16\\xa2\\x8c\\xc97\\xea\\xf19\\x0f\\xb6[\\xec\\xd6\\x85\\xe9TY\\xe5\\x02c6a\\x04\\xc6\\x9e\\x7f\\xa8\\x924\\x99\\x16\\xd0\\x0c\\x8c6,\\xa0\\xecm\\x1b]\\xda\\xdc\\xdc\\x02\\xe7\\xe6\\xf4\\x17\\xdc\\x98\\xd9L\\xd2\\x9d\\x98\\xa5\\xc2B3\\x8eR\\xdcSF\\x9a\\xcc\\xa4\\x85\\xd0w\\xe9q\\xc2\\x84Q\\x95\\xeer\\x8c\"q\\x87\\x91\\xf6T\\x91e\\x18\\xc3~\\x0f\\xba\\x08\\x13\\xa9\\xf7\\x10fL_\\xc3\\x9e\\xb8\\t\\xdaR\\xfar\\'a1\\xb1\\xc4e\\xc6\\x08\\xd2k\\xc6(\\x8c\\xc1\\xacF\\xdam\\x9e\\x13\\xf50$E\\x1b\\xb0\\x1a\\xc2g-O\\x91\\x98L#\\xad\\t\\xe2d\\xa7\\xd5 u\\x0c\\xeew\\xb1.\\xe9\\x96\\x06wy\\x15VA\\xb7l\\xef3`\\xb4\\xceBT\\x12d-\\xa1\\x9b/\\x8fA\\x1f\\x8b\\x84\\xae\\x82\"-f\\xbaeH\\xd8\\xfc7\\xc2\\x18\\xe13'", "year": "2021"}, {"Unnamed: 0": 205078, "autor": "lungbunny", "date": 1610818110000, "content": "Fuji XH1. XF 16-55ƒ2.8. 1/320 @ ƒ/5.6. Location: 65°58'00.2\"N 18°16'57.8\"W .", "link": "https://www.reddit.com/r/fujifilm/comments/kyn4n6/fuji_xh1_xf_1655ƒ28_1320_ƒ56_location_6558002n/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji xh1. xf 16-55ƒ2.8. 1/320 @ ƒ/5.6. -----> location !!! : 65°58'00.2\"n 18°16'57.8\"w .", "sortedWord": "None", "identifyer": 98527, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\x8e\\x0e\\xf6\\xc4\\xa5\\x11\\xeb\\x8af\\xeb\\xa1\\xd3\\t\\x0c\\x10 hu\\xfd\\xc0\\xe3f\\xc3\\xdb>\\x17j\\xdf/9\\xf2\\xa4\\x90\\x89\\x01;`D\\xe3\\xeb\\x1f\\xb8\\xf7K\\xc9d\\xfb\\x1c\\x18\\xff\\xa1qs\\xd5\\xc6\\x98\\xf3u\\xe84\\xba=\\x11+.oz\\\\\\xac\\xbe\\t\\xdd\\x9e\\xffh\\x00\\x97=\\x8b\\x0e\\xad\\xf1ys\\xb3~=:\\x9d\\x88&\\xbf\\x17\\xea`t{\\xfe\\xe1\\xb0G\\'\\xa8*->\\xae#\\x16\\xee\\x1f\\x17\\xb1F\\xfbCkO\\xa0\\xd3\\xd4\\x0e7\\xe7\\xa5\\xbf\\xec\\x0e\\\\I\\xb4B\\xa7a\\x0e\\x89Q\\x10\\xde\\xf1\\xba\\xe6s\\xc9v\\x1c\\xfe\\xc1\\x15n\\xdb8\\xe5g\\xb7n7\\x16\\x83\\xf1\\xb7n\\x9c5U\\x8c\\x81\\xbd\\x1e\\x9dN\\x86\\xca\\xc3h\\\\\\xe1\\x06\\xf3\\x07\\xba=\\'\\xd0<\\x18\\xfd+\\xf2Q\\x85\\x8b\\xd1\\x12t\\x1a\\xdd?\\xbbq\\xd8\\xf3\\x97H\\xffP\\x9a\\x0e\\xfe\\x10\\x99\\x0e^\\xafS=\\x9a\\x9b\\xd9;\\x0f\\x9dF\\xf7\\x0f\\xa9\\xe9\\x00\\xdd?\\xec\\r]\\xfe\\x97\\xb8D\\xcd\\xd1\\xe9P\\xa8\\xbc|Z\\xdc[\\xa3\\xa4w\\x82\\xb8\\xc2\\rW:@\\x8f\\x9fs;\\xd7\\xf1\\x1e+XS\\x80N\\'@\\xe5a\\xe9\\x9a\\xd4\\xf4F\\xed|\\x8a+\\x1d\\xa0\\xc7O\\xe7\\xb2\\x10\\xc3\\xf5=>\\xd6\\xe8t\\x0cT~\\x93\\xca\\t\\xf7\\xd5v\\x85W(\\xcd\\xa7\\xd3\\xb8u\\xd6\\x05L\\xe6^\\x80N\\'\\xa2\\xc9\\xe3\\xf2\\x0f\\xb1\\xf1c\\xf1\\xf4}\\xe3]\\x8dK\\x8b\\xd1i\\xf4\\xf4\\x06+G\\x99\\xa1\\xe2\\xbdh\\xf6\\x12\\xca?M\\xd72\\x8bM\\xb2+\\x02\\xd1it{V\\x91X\\x1e\\xa0\\xdb\\xb3z\\xa9;\\xd3\\xb1\\xfa4>t\\x1a\\xdd\\x9e\\xc9P\\x03\\xd1\\xfd\\x83+\\x9f\\xa2\\xdb#\\x92\\x9b\\x98#\\xef\\x13\\xa8\\x85N\\xe3\\n7t\\xffP;\\xdc\\x82\\xbd\\xd5\\x95\\xbe\\xed[\\x9dHn\\xb8\\x85p\\xd4n_\\xfd@\\xb9\\x03\\x9dF\\xb7g\\r\\x8ep\\xa3W9\\xfa\\x83\\xc8|\\xba\\xac\\xb8 19\\xb5\\xf8\\x88(#\\x03#\\xc8(F \\t\\x82\\x10\\xb4<\\'5/\\xbd$\\xa3\\xf8\\x08\\x8b(PnyqIQf^z\\xf1\\x1d\\x06\\x95\\x05\\x0bu\\x17\\xea-5\\xd4762Xdh\\xb6\\xd2\\xd0L\\xdd\\xd4\\\\\\xcfB\\xa9|\\x91\\xa1\\xc5rS\\xd3c\\x93\\x8c\\xf4,V\\x9aZ\\xa8\\x1b\\x18\\xe8\\x19)\\xe5-23]h\\xb5\\xd0a\\x85\\xb3c\\x90\\x8b\\xa7\\x9f\\xa3\\xcf\"g\\x97E\\x9e~\\x8b\\xfc\\xfc\\x16\\xfb\\xf9\\x05\\xac\\xf1+\\xcd\\r\\xa9,H\\xb5uN,JY\\r\\xe4$\\xa5\\x16\\xd9\\x06\\x03\\xadY\\x17P\\x9a\\x97\\\\\\x02\\x96\\nH-\\xca\\\\\\x12\\xe4\\xef\\x1f\\xb288\\xd2wibAA~\\xf1\\x8a\\xe4\\xfc\\xdc\\x82\\xfc\\xd2\\xbc\\x94%i\\xa5Y\\x99+r\\xf2\\x93\\x13K\\x80\\xcd\\xaf%y\\xb9\\xf9)+\\xf2\\n\\x12S\\xca\\x80\\x8cey\\xa5\\xb9@jIA~R\\xd6\\x92\\x82\\xa2\\xd4\\x82\\xa5\\x05 3\\x17U\\xa4-\\xae\\xc80\\\\th\\xc3\\xb2c\\x93\\xf4M\\xf5\\xcc\\x96\\x005\\x17OlX\\x9a\\x96\\x93\\x98^<\\xb1qSFbq|i^v^~y^<$|\\x0e\\xad\\x06\\xd2y\\xf1\\xe9E\\xf9\\xa5\\x05\\xc5\\x13\\x8f0N\\x00\\x00\\xd1\\xc2@~'", "year": "2021"}, {"Unnamed: 0": 205085, "autor": "lungbunny", "date": 1610813810000, "content": "XH1 - XF16-55mmƒ2.8. 1/30 @ƒ/2.8. ISO 200. Location: 55°59'28.2\"N 3°10'56.2\"W", "link": "https://www.reddit.com/r/fujifilm/comments/kylqgw/xh1_xf1655mmƒ28_130_ƒ28_iso_200_location_5559282n/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "xh1 - xf16-55mmƒ2.8. 1/30 @ƒ/2.8. iso 200. -----> location !!! : 55°59'28.2\"n 3°10'56.2\"w", "sortedWord": "None", "identifyer": 98534, "doc": "b'x\\x9c\\xeb\\\\^\\x96ZT\\x9c\\x99\\x9f\\xb7\\xd8@\\xcfpibIIQ\\xf1\\\\GgO/o\\x1f_?\\xff\\x80\\xb3\\x8cG\\xce2\\x1e=\\xcbxlYI~vj^\\xf1Q\\x0e\\x85\\x87\\xc6\\xcdU\\x1bc\\xce\\xd7\\xa1\\xd3\\t\\x0c\\x10 hu\\xfd\\xc0\\xe3f\\xc3\\xdb\\xf3\\x18!|&\\x06T\\x00\\xe33\\xa2\\x89\\xeb\\x1f\\xb8\\xf7K\\xc9d\\xfb\\x1c\\x18\\x7f\\xeb\\xc6YS\\xc5\\x18\\xd8\\xeb\\xd1\\xe9D\\xa8\\xfc4n\\x9du\\x01\\x93\\xb9\\x17\\xec\\xc5a\\x0f\\xcc\\xfc\\xffP\\x00\\x13?\\x81f\\xb1}\\xbe\\xe4\\x8e\\x8d\"\\x8f4\\xd0it\\xff\\xf8\\\\\\xa8}\\xbf\\xe4\\xc8\\x93Bt{`\\x00\\xdd\\x1ej\\xfb\\xe7?\\x1a\\xc0\\xe5\\x9f\\xae\\xe5\\xbe\\xbe3\\xae\\x1dLD\\xa7c\\xa1\\xf21\\n\\xc2;^\\xd7|.\\x99\\x8c\\xc3\\x9e\\x7f8\\xec\\xd9\\xc6)?\\xbbu\\xbb\\xb1\\x18\\x8c\\xbf\\xe8\\xd0\\x1a\\x9f77\\xeb\\xd7\\xa3\\xd3\\x89h\\xf2\\xb8\\xfc\\xf3\\x17\\x87=:AUi\\xf1q\\x1d0\\xe724sV\\xcaNl[q\\n\\x9dF\\xf7O\\xc4\\x8a\\xcb\\x9b\\x1e\\x17\\xabob\\x86\\x8a\\xf7B\\xed\\x85\\x05\\x0fzzC\\xf7\\x0f\\x13\\xf7K+\\xc9\\xc9kY\\xd0\\xe9\\x18\\xa8\\xfc&\\x95\\x13\\xee\\xab\\xed\\n\\xafP\\x9a\\x0e(\\r7\\\\\\xe9\\x00=\\xdc\\n_I^\\x14n\\xfd\\x7f\\x0b\\x9dN\\x80\\xca\\xa3\\xa7kX\\xb8\\xd5\\xa0\\x05\\x14\\xa1|\\xfa\\xc54\\xa1\\xe5\\x95\\x8b\\x995:\\x8d+~`\\xe6\\xc1\\xec\\xc1\\xe5\\x1fj\\xa77\\\\\\xe9\\x1a=\\xdc:\\x97\\x85\\x18\\xae\\xef\\xf1\\xb1F\\xa7IM\\x07\\x84\\xc2\\r\\x96\\xdf\\xd1ij\\x97\\x07\\xae)}\\xca\\xac\\xb7\\x82f\\xa1\\xd3\\xa4\\xe6\\x1fB\\xf1\\xd3t-\\xb3\\xd8$\\xbb\"\\x10\\x9dF\\xb7g\\x15\\x89\\xe55\\xba=\\x07d\\xb9\\xd9\\xd3\\xcd\\xf55\\xd1i\\\\\\xe5\\x1b\\xcc?\\rP\\xfe\\x1f\"\\xd3\\xdb\\xc1{\\xd7\\x97\\xccq\\x89\\xe3@\\xa7q\\x85\\x1b\\xb1\\xf1Cl\\xb8%@\\xe5\\xef&\\xcf\\xfa&\\xb2\\xee\\xe9\\xec}$\\xa6k\\xee\\x8aifl\\xbb8$a\\xfc\\xfc\\xbf\\x89\\x0bu\\x1f?\\x99\\x85N\\xa3\\xfb\\x07Wz\\xfbI\\xa4\\x7f\\x96\\x15\\x17$&\\xa7\\x16\\x1f\\x11a\\x04\\x19\\x04$@\\x08\\x14\\xbb \\xee\\xf2\\x9c\\xd4\\xbc\\xf4\\x92\\x8c\\xe2#,\" ^qIQf^z\\xf1\\x1d\\x06\\xe5\\x05\\x0bu\\x17\\xea-1\\xd476Xih\\xa0nj\\xa6g\\xa4T\\xbe\\xd8\\xc8\\xc0`\\xa1\\xf1\"S\\xd3\\x95\\xa6\\xa6\\xb9\\xb9\\xc7&\\x19\\xe9Y\\xac4\\xb5T7\\xb2\\x00J\\xe6-\\xb4Z\\xeepl\\x92>Pl\\x85\\xb3c\\x90\\x8b\\xa7\\x9f\\xa3\\xcf\"g\\x97\\xc5\\xee\\x01\\xae\\x8b\\xfc\\xfc\\x16\\xfb\\xf9\\x05,\\x01\\xe2\\xe05~\\xa5\\xb9!\\x95\\x05\\xa9\\xb6\\xce\\x89E)\\xab\\x81\\x9c\\xa4\\xd4\"\\xdb\\x80\\x9c\\xd2\"\\x18;\\x18h\\xff\\xb2\\x00\\xd7\\xa0`\\x7f\\xbfu\\x01\\xa5y\\xc9%`\\xd5\\x01\\xa9E\\x99K\\x82\\xfc\\xfdC\\x96&\\x16\\x14\\xe4\\x17/NI-X\\x9cY\\x9c\\xbf\"\\'?9\\xb1\\x04\\xd8VZ\\x92\\x97\\x9b\\x9f\\xb2,\\xaf4\\x17H--\\x00i[QX\\x9a\\x98W\\x02\\xe4.\\xa9H34[\\\\\\x91a\\xb8\\xe8\\xd0\\x86%@\\xd5\\xc5\\x13\\x1b\\x96\\xa6\\xe5$\\xa6\\x17Ol\\xdc\\x94\\x91X\\x1c_\\x9a\\x97\\x9d\\x97_\\x9e\\x17\\x0f\\t\\xa5C\\xab\\x81t^|zQ~iA\\xf1\\xc4#\\x8c\\x13\\x00j\\r\\x15\\xf4'", "year": "2021"}], "name": "locationfujifilm2021"}