{"interestingcomments": [{"Unnamed: 0": 228619, "autor": "miguev", "date": 1564807527000, "content": "Please help, can what is this? I try to keep my sensor clean but keep getting this kind of family-size hot/stuck pixels but they show up at random, on short exposures on low ISO, and they change location, shape and size all the time. (X-T2, 56mm, f/1.2, 1/2400 s, ISO 100)", "link": "https://www.reddit.com/r/fujifilm/comments/clespb/please_help_can_what_is_this_i_try_to_keep_my/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "please help, can what is this? i try to keep my sensor clean but keep getting this kind of family-size hot/stuck pixels but they show up at random, on short exposures on low iso, and they change -----> location !!! , shape and size all the time. (x-t2, 56mm, f/1.2, 1/2400 s, iso 100)", "sortedWord": "None", "identifyer": 23503, "year": "2019"}, {"Unnamed: 0": 229032, "autor": "Patrickoloan", "date": 1556465828000, "content": "Yasss Queen - cosmetics shoot on location", "link": "https://www.reddit.com/r/fujifilm/comments/bicgsu/yasss_queen_cosmetics_shoot_on_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "yasss queen - cosmetics shoot on -----> location !!! ", "sortedWord": "None", "identifyer": 23930, "year": "2019"}, {"Unnamed: 0": 229185, "autor": "JakeyBabyy", "date": 1561186246000, "content": "Finally feel as though I did this location justice [Xt2 &amp; 16 1.4]", "link": "https://www.reddit.com/r/fujifilm/comments/c3mhk3/finally_feel_as_though_i_did_this_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "finally feel as though i did this -----> location !!!  justice [xt2 &amp; 16 1.4]", "sortedWord": "None", "identifyer": 24088, "year": "2019"}, {"Unnamed: 0": 229412, "autor": "BawceHog", "date": 1564189980000, "content": "Is there a Fujifilm model that always records GPS meta data of photo? /!/ I rely heavily on GPS location meta data (city, state) for cataloging/discovering photos in Lightroom. Every picture I take with my iPhone records this information no problem, which is great. The issue with my Fujifilm X-T2 is that I have to sync it with the shitty FujiFilm app for it to record the location, but when I turn the camera off between shots it disconnects and I lose the GPS meta data on many photos. This requires me to manually tag the photo in a way to make it discoverable in Lr.\n\nIs there a Fujifilm model that has GPS capabilities built in? If not Fujifilm, is there another brand that does this?", "link": "https://www.reddit.com/r/fujifilm/comments/cibatw/is_there_a_fujifilm_model_that_always_records_gps/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "is there a fujifilm model that always records gps meta data of photo? /!/ i rely heavily on gps -----> location !!!  meta data (city, state) for cataloging/discovering photos in lightroom. every picture i take with my iphone records this information no problem, which is great. the issue with my fujifilm x-t2 is that i have to sync it with the shitty fujifilm app for it to record the location, but when i turn the camera off between shots it disconnects and i lose the gps meta data on many photos. this requires me to manually tag the photo in a way to make it discoverable in lr.\n\nis there a fujifilm model that has gps capabilities built in? if not fujifilm, is there another brand that does this?", "sortedWord": "None", "identifyer": 24332, "year": "2019"}, {"Unnamed: 0": 229574, "autor": "crunchy2naroll", "date": 1548731142000, "content": "ALSO just joined the club with an X100F! /!/ I recently moved to Japan and picked up photography as a hobby with the Canon EOS 7D Mark I my stepdad gave me before I left. I wanted something more compact, easier to carry around, and less frilly to bring along with me whenever I travel to other cities and heard nothing but good things about the X100 line. I was always keeping an eye out and was planning to buy a used one from a prominent chain next time I was in Tokyo but one in almost-new conditon popped up at a location near me so I decided to hop on it. Got it for a bit over 800 usd. Haven't used it much yet but I'm excited to bring it with me on some upcoming trips I have planned. Any early-usage tips would be appreciated! ", "link": "https://www.reddit.com/r/fujifilm/comments/akvnbt/also_just_joined_the_club_with_an_x100f/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "also just joined the club with an x100f! /!/ i recently moved to japan and picked up photography as a hobby with the canon eos 7d mark i my stepdad gave me before i left. i wanted something more compact, easier to carry around, and less frilly to bring along with me whenever i travel to other cities and heard nothing but good things about the x100 line. i was always keeping an eye out and was planning to buy a used one from a prominent chain next time i was in tokyo but one in almost-new conditon popped up at a -----> location !!!  near me so i decided to hop on it. got it for a bit over 800 usd. haven't used it much yet but i'm excited to bring it with me on some upcoming trips i have planned. any early-usage tips would be appreciated! ", "sortedWord": "None", "identifyer": 24498, "year": "2019"}, {"Unnamed: 0": 229868, "autor": "Kamukix", "date": 1577486213000, "content": "X-T2 and 18-55mm, quick scouting a sunrise location", "link": "https://www.reddit.com/r/fujifilm/comments/egi2uc/xt2_and_1855mm_quick_scouting_a_sunrise_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "x-t2 and 18-55mm, quick scouting a sunrise -----> location !!! ", "sortedWord": "None", "identifyer": 24794, "year": "2019"}, {"Unnamed: 0": 231132, "autor": "gajan66", "date": 1547263580000, "content": "Fuji GFX 50R Hands-On Review (Fashion + Location Photography Samples Included)", "link": "https://www.reddit.com/r/fujifilm/comments/af3gdv/fuji_gfx_50r_handson_review_fashion_location/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fuji gfx 50r hands-on review (fashion + -----> location !!!  photography samples included)", "sortedWord": "None", "identifyer": 26097, "year": "2019"}, {"Unnamed: 0": 231235, "autor": "bearcat--", "date": 1549990786000, "content": "First Trip with Fuji X-T2 to Scandinavia - Impressions and Thoughts /!/ Hi everyone, I just recently embarked on a 2-week trip to Scandinavia where my camera was tested in multiple conditions. I just wanted to share my experience with everyone here, as it may answer some questions that have been asked previously.\n\n**Locations travelled:**\n\n* Ranua, North Finland\n* Helsinki, Finland\n* Stockholm, Sweden\n* Copenhagen, Denmark\n\n**Info about myself:**\n\n* hobbyist shooter, mostly street\n* recently switched to X-T2 from Canon 5D2 last fall\n\n**My gear (**I only travelled with a backpack for this trip)\n\n* X-T2, 23mm f1.4, 56mm f1.2, Manfrotto Pixi Evo Mini tripod\n* I used a hiking/travel backpack and bought some camera inserts for my gear (not spending $300 CAD on a camera backpack that can only carry camera gear) - this combo allowed me to also pack clothes and a surface book\n\n**Thoughts on Weight:**\n\nSince switching from my heavy Canon 5D mk2, the reduced weight of the X-T2 made it so easy to carry all day long. Sure, with the 56mm attached, it can get heavy towards the end of a long day, but overall still 50% lighter than what I had before and it made me keep the camera out at all times.\n\n**Weather Sealing:**\n\n**Cold Weather:** This is a common question I've seen from users. Ranua is around -25C to -30C, and at times I was out there for at least 3-4 hours in the cold. I've read up on how to protect my camera before I left for the trip and was recommended to keep camera ziplock bag when entering inside a warmer climate from outside. I never actually used my ziplock bags. I was slightly worried since both my lens don't have WR, but really this isn't an issue. My camera functioned perfectly fine in the super cold weather, and when I went inside where there was heating, I would just place it in my backpack. \n\n**Rain:** When it rained in Copenhagen, I would try not to expose the camera too much and place under my jacket. There would be droplets on the camera and lens occasionally but it didn't bother it much and functioned fine. \n\n**Choice of Lens:**\n\nI definitely used the 23mm 90% or more most of the time. There were times I wished I had a wider lens when taking pictures of buildings, the 16mm would have worked better to capture the entire building, but overall I am very happy with the 23mm as it is a pretty versatile lens. The 56mm I used for the zoo for it's longer focal length and used it at some other parts of the trip as well when I needed the slightly extra reach. \n\n**Battery:** I had 2 batteries, and I would usually turn off the camera if not in use to converse battery. In the cold, it definitely drained pretty fast - I kept a spare in my pocket to keep it warm. I'm a somewhat conservative shooter, so 2 batteries worked well for me.\n\n**Highlights of my trip:**\n\n**Northern Lights:** got super lucky ...we saw it 2x!! I managed to even capture a video of it too while we were driving. I managed to got a few 'okay' photos of it from where I was staying.\n\n**Ranua:** Beautiful winter area - everything was snow and ice, it felt so eerie but magical at same time. We also visited Ranua Zoo and fed Artic Fox and saw Polar Bears feed.\n\n[https://www.reddit.com/r/fujix/comments/an5p0s/rare\\_arctic\\_fox\\_north\\_finland\\_at\\_ranua\\_zoo\\_xt2/](https://www.reddit.com/r/fujix/comments/an5p0s/rare_arctic_fox_north_finland_at_ranua_zoo_xt2/)\n\n[https://www.reddit.com/r/fujix/comments/amt73m/about\\_to\\_feed\\_polar\\_bears\\_in\\_finland\\_ranua\\_zoo/](https://www.reddit.com/r/fujix/comments/amt73m/about_to_feed_polar_bears_in_finland_ranua_zoo/)\n\n[https://www.reddit.com/r/fujix/comments/am3s4m/start\\_of\\_vacation\\_arctic\\_fox\\_igloo\\_reception\\_xt2/](https://www.reddit.com/r/fujix/comments/am3s4m/start_of_vacation_arctic_fox_igloo_reception_xt2/)\n\nI have to sort through my photos, more of my stuff can be found on my IG: @yummyhawtsauce \n\nI love Fuji and I am very happy with my switch. The portability combined with the quality images it produces is a winner for my style of shooting.\n\nFeel free to ask me anything about my experience and hope this will help others somehow. ", "link": "https://www.reddit.com/r/fujifilm/comments/apvg7s/first_trip_with_fuji_xt2_to_scandinavia/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "first trip with fuji x-t2 to scandinavia - impressions and thoughts /!/ hi everyone, i just recently embarked on a 2-week trip to scandinavia where my camera was tested in multiple conditions. i just wanted to share my experience with everyone here, as it may answer some questions that have been asked previously.\n\n**-----> locations !!!  travelled:**\n\n* ranua, north finland\n* helsinki, finland\n* stockholm, sweden\n* copenhagen, denmark\n\n**info about myself:**\n\n* hobbyist shooter, mostly street\n* recently switched to x-t2 from canon 5d2 last fall\n\n**my gear (**i only travelled with a backpack for this trip)\n\n* x-t2, 23mm f1.4, 56mm f1.2, manfrotto pixi evo mini tripod\n* i used a hiking/travel backpack and bought some camera inserts for my gear (not spending $300 cad on a camera backpack that can only carry camera gear) - this combo allowed me to also pack clothes and a surface book\n\n**thoughts on weight:**\n\nsince switching from my heavy canon 5d mk2, the reduced weight of the x-t2 made it so easy to carry all day long. sure, with the 56mm attached, it can get heavy towards the end of a long day, but overall still 50% lighter than what i had before and it made me keep the camera out at all times.\n\n**weather sealing:**\n\n**cold weather:** this is a common question i've seen from users. ranua is around -25c to -30c, and at times i was out there for at least 3-4 hours in the cold. i've read up on how to protect my camera before i left for the trip and was recommended to keep camera ziplock bag when entering inside a warmer climate from outside. i never actually used my ziplock bags. i was slightly worried since both my lens don't have wr, but really this isn't an issue. my camera functioned perfectly fine in the super cold weather, and when i went inside where there was heating, i would just place it in my backpack. \n\n**rain:** when it rained in copenhagen, i would try not to expose the camera too much and place under my jacket. there would be droplets on the camera and lens occasionally but it didn't bother it much and functioned fine. \n\n**choice of lens:**\n\ni definitely used the 23mm 90% or more most of the time. there were times i wished i had a wider lens when taking pictures of buildings, the 16mm would have worked better to capture the entire building, but overall i am very happy with the 23mm as it is a pretty versatile lens. the 56mm i used for the zoo for it's longer focal length and used it at some other parts of the trip as well when i needed the slightly extra reach. \n\n**battery:** i had 2 batteries, and i would usually turn off the camera if not in use to converse battery. in the cold, it definitely drained pretty fast - i kept a spare in my pocket to keep it warm. i'm a somewhat conservative shooter, so 2 batteries worked well for me.\n\n**highlights of my trip:**\n\n**northern lights:** got super lucky ...we saw it 2x!! i managed to even capture a video of it too while we were driving. i managed to got a few 'okay' photos of it from where i was staying.\n\n**ranua:** beautiful winter area - everything was snow and ice, it felt so eerie but magical at same time. we also visited ranua zoo and fed artic fox and saw polar bears feed.\n\n[https://www.reddit.com/r/fujix/comments/an5p0s/rare\\_arctic\\_fox\\_north\\_finland\\_at\\_ranua\\_zoo\\_xt2/](https://www.reddit.com/r/fujix/comments/an5p0s/rare_arctic_fox_north_finland_at_ranua_zoo_xt2/)\n\n[https://www.reddit.com/r/fujix/comments/amt73m/about\\_to\\_feed\\_polar\\_bears\\_in\\_finland\\_ranua\\_zoo/](https://www.reddit.com/r/fujix/comments/amt73m/about_to_feed_polar_bears_in_finland_ranua_zoo/)\n\n[https://www.reddit.com/r/fujix/comments/am3s4m/start\\_of\\_vacation\\_arctic\\_fox\\_igloo\\_reception\\_xt2/](https://www.reddit.com/r/fujix/comments/am3s4m/start_of_vacation_arctic_fox_igloo_reception_xt2/)\n\ni have to sort through my photos, more of my stuff can be found on my ig: @yummyhawtsauce \n\ni love fuji and i am very happy with my switch. the portability combined with the quality images it produces is a winner for my style of shooting.\n\nfeel free to ask me anything about my experience and hope this will help others somehow. ", "sortedWord": "None", "identifyer": 26204, "year": "2019"}, {"Unnamed: 0": 231385, "autor": "Glosoli9", "date": 1555118198000, "content": "Does Fujifilm not save GPS location in metadata? I can’t find gps information on my photos.", "link": "https://www.reddit.com/r/fujifilm/comments/bclc17/does_fujifilm_not_save_gps_location_in_metadata_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "does fujifilm not save gps -----> location !!!  in metadata? i can’t find gps information on my photos.", "sortedWord": "None", "identifyer": 26357, "year": "2019"}, {"Unnamed: 0": 232998, "autor": "calypsonoximera", "date": 1576174412000, "content": "Fujifilm Xpro-1 + Helios 44M-4 (old russian lens). The sunset was really beautiful that day. Location: Oreshets, South Bulgaria.", "link": "https://www.reddit.com/r/fujifilm/comments/e9r8tl/fujifilm_xpro1_helios_44m4_old_russian_lens_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fujifilm xpro-1 + helios 44m-4 (old russian lens). the sunset was really beautiful that day. -----> location !!! : oreshets, south bulgaria.", "sortedWord": "None", "identifyer": 28017, "year": "2019"}, {"Unnamed: 0": 233348, "autor": "Sebayn", "date": 1549518706000, "content": "night landscapes and astrophotography /!/ Hi,\n\nI'm considering investing in a XPro-2 rig and am curious how it and assorted wideangle Fuji lenses work for night landscapes and astrophotography. I'm hoping to go up to Iceland this year and a few other exotic locations and getting some dazzling long exposures is one of my main photography goals this year.\n\nIf anyone has any experience or advice I'd love to hear it.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/ao0m53/night_landscapes_and_astrophotography/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "night landscapes and astrophotography /!/ hi,\n\ni'm considering investing in a xpro-2 rig and am curious how it and assorted wideangle fuji lenses work for night landscapes and astrophotography. i'm hoping to go up to iceland this year and a few other exotic -----> locations !!!  and getting some dazzling long exposures is one of my main photography goals this year.\n\nif anyone has any experience or advice i'd love to hear it.\n\nthanks!", "sortedWord": "None", "identifyer": 28377, "year": "2019"}], "name": "locationfujifilm2019"}