{"interestingcomments": [{"autor": "SoCalDawg", "date": "2018-05-01 16:16:13", "content": "Upgrade to XT-2.. advice. /!/ I know this has been debated all over the information superhighway but was hoping to get some current perspective here.\n\nI sold my Nikon D7100 and lenses recently and moved to the Fuji system, X-T20, 16-50 and 23 f2. I LOVE the Fuji system and images I am getting.\n\nMy main reason for switching was that I would never take my D7100 with me and when I did it was an ‘event’ due to it’s size and bag. That ..and PRICE .. was why I went with the X-T20. \n\nFast forward to today and while I am very happy with the XT20, I have had to make some tweaks for it to fit my hand well. I have added the half-grip from Fuji (it’s quirk is it blocks in-camera charging), a wrist strap and I have a Lensmate thumb grip on the way.\n\nSo while I have my ‘small’ solution .. I have had to work to make it work.\n\nI will say I like the touchscreen but I prefer to change focus points with the camera to my eye so the joystick works better. I tried it on an X100F and really liked it. I didn’t have to ‘menu’ in for it to work.. I just moved the joystick and bam.. nice.\n\nNow it seems that the price of the XT20 has come down significantly. I can find new for under $1,300 and used in great shape for about $1,000. I estimate I can get around $800 for my XT20 kit but I lose the zoom lens.\n\nIn this case.. what are the thoughts here on selling the XT20 and going to the XT2 if I can do it for under $400?\n\nAlso, how close are we to an XT3 as that may drive my decision?\n\nMy wife and I are going to Italy in August so I would like to have the best option I can for that trip.\n\nThank you for any feedback and guidance you can provide.", "link": "https://www.reddit.com/r/fujifilm/comments/8g9o1q/upgrade_to_xt2_advice/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have had to make", "selectorShort": "make", "MarkedSent": "upgrade to xt-2.. advice. /!/ i know this has been debated all over the information superhighway but was hoping to get some current perspective here.\n\ni sold my nikon d7100 and lenses recently and moved to the fuji system, x-t20, 16-50 and 23 f2. i love the fuji system and images i am getting.\n\nmy main reason for switching was that i would never take my d7100 with me and when i did it was an ‘event’ due to it’s size and bag. that ..and price .. was why i went with the x-t20. \n\nfast forward -----> to !!!  today and while -----> i !!!  am very happy with the xt20, -----> i !!!  -----> have !!!  -----> had !!!  -----> to !!!  -----> make !!!  some tweaks for it -----> to !!!  fit my hand well. i have added the half-grip from fuji (it’s quirk is it blocks in-camera charging), a wrist strap and i have a lensmate thumb grip on the way.\n\nso while i have my ‘small’ solution .. i have had to work to make it work.\n\ni will say i like the touchscreen but i prefer to change focus points with the camera to my eye so the joystick works better. i tried it on an x100f and really liked it. i didn’t have to ‘menu’ in for it to work.. i just moved the joystick and bam.. nice.\n\nnow it seems that the price of the xt20 has come down significantly. i can find new for under $1,300 and used in great shape for about $1,000. i estimate i can get around $800 for my xt20 kit but i lose the zoom lens.\n\nin this case.. what are the thoughts here on selling the xt20 and going to the xt2 if i can do it for under $400?\n\nalso, how close are we to an xt3 as that may drive my decision?\n\nmy wife and i are going to italy in august so i would like to have the best option i can for that trip.\n\nthank you for any feedback and guidance you can provide.", "sortedWord": "None", "Identifyer": null, "identifyer": 75, "year": "2018"}, {"autor": "isolerphoto", "date": "2018-06-12 20:12:51", "content": "A mini-documentary series shot on X-H1 and X-T2. /!/ Hey folks,\n\nI just finished the first episode of a docu\\-series about career transitions. I shot it mostly on the Fuji X\\-H1 with the X\\-T2 as my B camera. \n\nMy channel isn't monetized! I'm not making money off of this. I just thought you guys might like to see how these cameras can be used on a project like this.\n\nWatch if you wish. [https://youtu.be/rjeP7RfcPm0](https://youtu.be/rjeP7RfcPm0)", "link": "https://www.reddit.com/r/fujifilm/comments/8qm7pv/a_minidocumentary_series_shot_on_xh1_and_xt2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm not making", "selectorShort": "make", "MarkedSent": "a mini-documentary series shot on x-h1 and x-t2. /!/ hey folks,\n\ni just finished the first episode of a docu\\-series about career transitions. i shot it mostly on the fuji x\\-h1 with the x\\-t2 as my b camera. \n\nmy channel isn't monetized! -----> i !!! 'm -----> not !!!  -----> making !!!  money off of this. i just thought you guys might like to see how these cameras can be used on a project like this.\n\nwatch if you wish. [https://youtu.be/rjep7rfcpm0](https://youtu.be/rjep7rfcpm0)", "sortedWord": "None", "Identifyer": null, "identifyer": 166, "year": "2018"}, {"autor": "tarkani", "date": "2018-06-02 03:54:04", "content": "I think I made a mistake. X-T20 + 16-55mm f2.8 /!/ I wanted to have an all around versatile lens to take picture of my kids while we are traveling, but ended up a quite heavy and large setup. \n\nThis kind of kills the purpose of having a mirrorless camera, don’t you think?\n\nDid I make a mistake? Please help me get used to this.\n\n[Pic](https://imgur.com/gallery/mhYFIOV)\n", "link": "https://www.reddit.com/r/fujifilm/comments/8ny1kb/i_think_i_made_a_mistake_xt20_1655mm_f28/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  think -----> i !!!  -----> made !!!  a mistake. x-t20 + 16-55mm f2.8 /!/ i wanted to have an all around versatile lens to take picture of my kids while we are traveling, but ended up a quite heavy and large setup. \n\nthis kind of kills the purpose of having a mirrorless camera, don’t you think?\n\ndid i make a mistake? please help me get used to this.\n\n[pic](https://imgur.com/gallery/mhyfiov)\n", "sortedWord": "None", "Identifyer": null, "identifyer": 191, "year": "2018"}, {"autor": "AutisticPizzaBoy", "date": "2018-03-10 09:44:39", "content": "X-T20? /!/ I'm considering to buy the X-T20 but i still haven't decided what lens to buy with it. I was thinking about to go for one of the kit lenses &amp; buy the Samyang/Rokinon 12mm f2 with it. \nIs the 18-55 worth it compared to the 16-50mm? \nIf i buy the 18-55 &amp; Samyang it will cost me around 1627 Euros. It's a lot of money so i want to be sure i'm making the right decision. All around for most situations but primarily landscape. I'm a beginner. \nOr do you guys have any other suggestions for different lenses? or camera? I want the retro dials, best quality for least amount of money. ", "link": "https://www.reddit.com/r/fujifilm/comments/83e9on/xt20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "x-t20? /!/ i'm considering to buy the x-t20 but i still haven't decided what lens to buy with it. i was thinking about to go for one of the kit lenses &amp; buy the samyang/rokinon 12mm f2 with it. \nis the 18-55 worth it compared to the 16-50mm? \nif i buy the 18-55 &amp; samyang it will cost me around 1627 euros. it's a lot of money so -----> i !!!  want to be sure -----> i !!! 'm -----> making !!!  the right decision. all around for most situations but primarily landscape. i'm a beginner. \nor do you guys have any other suggestions for different lenses? or camera? i want the retro dials, best quality for least amount of money. ", "sortedWord": "None", "Identifyer": null, "identifyer": 210, "year": "2018"}, {"autor": "sqwigles", "date": "2018-02-28 07:24:22", "content": "Fuji tx2 auto focus /!/ Hi,\nIs there anyway to turn to auto focus off? I can't take a sharp picture and I need to do some product photography. \n\nhttps://imgur.com/NPkwyXM\n\nThis is one of the photos I've taken. The lid is in focus but not the rest of it. How can I make the whole image in focus?", "link": "https://www.reddit.com/r/fujifilm/comments/80u74r/fuji_tx2_auto_focus/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "fuji tx2 auto focus /!/ hi,\nis there anyway to turn to auto focus off? i can't take a sharp picture and i need to do some product photography. \n\nhttps://imgur.com/npkwyxm\n\nthis is one of the photos i've taken. the lid is in focus but not the rest of it. how can -----> i !!!  -----> make !!!  the whole image in focus?", "sortedWord": "None", "Identifyer": null, "identifyer": 252, "year": "2018"}, {"autor": "ravenhawk82", "date": "2018-02-26 11:47:06", "content": "Nikon convert looking for suggestions /!/ I've shot Nikon for 10 years, but after buying a used X100S a while back and not shooting my D610 at all since then, I'm now looking to jump into the Fuji system and begin selling my Nikon gear.\n\nSome background: I primarily shoot landscapes and wide field astrophotography, with some street photography and casual portraits thrown in here and there. Currently, my bag usually contains a D610, a 35 f/1.8 (this lens is on the camera about 80% of the time), a 70-300VR, and a Tokina 16-28 f/2.8. It does everything I need, but after hiking a couple miles up a steep hill with that bag I'm about ready to throw it into a river. Now that tax returns are coming, I'm looking to make the jump and save my future self some back pain. Below is what I'm looking at to fill the roles of my current gear with something smaller and lighter, but I still have some questions and am open to other suggestions.\n\nBody: X-Pro2 - Pretty firm on this choice. Part practicality and part taste, I need an optical viewfinder. This is the reason I didn't jump to mirrorless cameras years ago. The EVFs are fantastic, and for most usage scenarios I have no problem using them exclusively. However, when it comes to shooting in a pitch black location in the middle of the night, it's nearly impossible to compose a shot with an EVF that is only resolving a handful of point sources from the brightest stars. I also just prefer seeing things optically, and especially with the histogram overlay in the X100S I find myself using the OVF in most cases.\n\nWide Angle: Samyang 12mm F2 or 10mm F2.8 - Here's a spot where I'm looking for some input. The wider angle of the 10 is appealing, but so is the faster optics and lighter weight of the 12. I'm currently leaning toward the 12, but I'm curious what others think. Manual focus is fine, this lens will be used mostly at night when autofocus stops being useful anyway. I was considering the Fuji 10-24 for a while, but its coma and lower speed along with higher cost made it less appealing.\n\nGeneral purpose: Fuji XF23mm f/2 - This would fill the role of my 35 f1.8, which is the lens I use the vast majority of the time anyway. I've also been eyeing the larger f1.4 version and am not opposed to saving a bit more if it's worth it, but as a lens that'll be going everywhere with me I think that the weather resistance will come in the more useful than the extra speed.\n\nTelephoto: Fuji XF55-200 or XC50-230 - Another spot where I'm having trouble deciding. For those of you who have tried them, is the aperture ring and build quality of the XF worth the drastic cost increase? This lens would get the least use of the three, but I don't want to give up on image quality if I'm already springing for an X-Pro2. Thoughts on this one? \n\n\nI'm open to suggestions on any of these. I think I've done enough research to have a good idea of what I'm getting into, but as with any big purchase I'd like to get a second opinion from those with experience before pulling the trigger.", "link": "https://www.reddit.com/r/fujifilm/comments/80cgfd/nikon_convert_looking_for_suggestions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm looking to make", "selectorShort": "make", "MarkedSent": "nikon convert looking for suggestions /!/ i've shot nikon for 10 years, but after buying a used x100s a while back and not shooting my d610 at all since then, i'm now looking to jump into the fuji system and begin selling my nikon gear.\n\nsome background: i primarily shoot landscapes and wide field astrophotography, with some street photography and casual portraits thrown in here and there. currently, my bag usually contains a d610, a 35 f/1.8 (this lens is on the camera about 80% of the time), a 70-300vr, and a tokina 16-28 f/2.8. it does everything i need, but after hiking a couple miles up a steep hill with that bag i'm about ready to throw it into a river. now that tax returns are coming, -----> i !!! 'm -----> looking !!!  -----> to !!!  -----> make !!!  the jump and save my future self some back pain. below is what i'm looking at to fill the roles of my current gear with something smaller and lighter, but i still have some questions and am open to other suggestions.\n\nbody: x-pro2 - pretty firm on this choice. part practicality and part taste, i need an optical viewfinder. this is the reason i didn't jump to mirrorless cameras years ago. the evfs are fantastic, and for most usage scenarios i have no problem using them exclusively. however, when it comes to shooting in a pitch black location in the middle of the night, it's nearly impossible to compose a shot with an evf that is only resolving a handful of point sources from the brightest stars. i also just prefer seeing things optically, and especially with the histogram overlay in the x100s i find myself using the ovf in most cases.\n\nwide angle: samyang 12mm f2 or 10mm f2.8 - here's a spot where i'm looking for some input. the wider angle of the 10 is appealing, but so is the faster optics and lighter weight of the 12. i'm currently leaning toward the 12, but i'm curious what others think. manual focus is fine, this lens will be used mostly at night when autofocus stops being useful anyway. i was considering the fuji 10-24 for a while, but its coma and lower speed along with higher cost made it less appealing.\n\ngeneral purpose: fuji xf23mm f/2 - this would fill the role of my 35 f1.8, which is the lens i use the vast majority of the time anyway. i've also been eyeing the larger f1.4 version and am not opposed to saving a bit more if it's worth it, but as a lens that'll be going everywhere with me i think that the weather resistance will come in the more useful than the extra speed.\n\ntelephoto: fuji xf55-200 or xc50-230 - another spot where i'm having trouble deciding. for those of you who have tried them, is the aperture ring and build quality of the xf worth the drastic cost increase? this lens would get the least use of the three, but i don't want to give up on image quality if i'm already springing for an x-pro2. thoughts on this one? \n\n\ni'm open to suggestions on any of these. i think i've done enough research to have a good idea of what i'm getting into, but as with any big purchase i'd like to get a second opinion from those with experience before pulling the trigger.", "sortedWord": "None", "Identifyer": null, "identifyer": 262, "year": "2018"}, {"autor": "gayselle", "date": "2018-01-28 19:33:41", "content": "New to Fufjifilm compacts - used x70 or x100t? /!/ Ideally I would like to get the x100F after researching, however, it is impossible to find it used where I am and after taxes it will cost nearly $2000 CAD. Right now it is just not feasible to drop that much on a camera. \n\n\nI'm not completely a newbie with cameras and have used Nikon DSLRs. I am mainly looking for a compact for travel purposes and find DSLR too bulky. We are going to Japan in May and would like a nice travel camera going forward that is of relatively good quality. Outside of travel I plan to also take fashion (blogging) photos and food photography. I also like to post photos on social media which is one of the draws I have for the x70.\n\n\nI have an opportunity to purchase mint condition used x70 ($700 CAD) or x100t ($900 CAD), both come with extra batteries in terms of accessories. If the prices weren't so close the decision would be easier. I don't mind spending an extra $200 for a supposedly \"nicer\" camera, although I cannot make up my mind because the reviews are very mixed. \n\nThank you! ", "link": "https://www.reddit.com/r/fujifilm/comments/7tmgsv/new_to_fufjifilm_compacts_used_x70_or_x100t/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i cannot make", "selectorShort": "make", "MarkedSent": "new to fufjifilm compacts - used x70 or x100t? /!/ ideally i would like to get the x100f after researching, however, it is impossible to find it used where i am and after taxes it will cost nearly $2000 cad. right now it is just not feasible to drop that much on a camera. \n\n\ni'm not completely a newbie with cameras and have used nikon dslrs. i am mainly looking for a compact for travel purposes and find dslr too bulky. we are going to japan in may and would like a nice travel camera going forward that is of relatively good quality. outside of travel i plan to also take fashion (blogging) photos and food photography. i also like to post photos on social media which is one of the draws i have for the x70.\n\n\ni have an opportunity to purchase mint condition used x70 ($700 cad) or x100t ($900 cad), both come with extra batteries in terms of accessories. if the prices weren't so close the decision would be easier. -----> i !!!  don't mind spending an extra $200 for a supposedly \"nicer\" camera, although -----> i !!!  -----> can !!! -----> not !!!  -----> make !!!  up my mind because the reviews are very mixed. \n\nthank you! ", "sortedWord": "None", "Identifyer": null, "identifyer": 326, "year": "2018"}, {"autor": "Kyl080", "date": "2018-01-27 06:29:35", "content": "Fujifilm filters; gimmick or added value /!/ Hi photography enthousiasts! I just made the transition from Nikon fullframe to the X-T2 and couldn’t be happier. The thing that I found most peculiar where the filter settings. At first, this seemed like a real gimmick, or something for the Instagram lovers out there. On the other hand, Fuji has always been very serious about it’s analog films, so a simulated setting on a system camera is a nice added bonus. \n\nWhat are your opinions on the filters? Gimmick, or valuable option? Do you use it a lot?", "link": "https://www.reddit.com/r/fujifilm/comments/7tb3dm/fujifilm_filters_gimmick_or_added_value/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "fujifilm filters; gimmick or added value /!/ hi photography enthousiasts! -----> i !!!  -----> just !!!  -----> made !!!  the transition from nikon fullframe to the x-t2 and couldn’t be happier. the thing that i found most peculiar where the filter settings. at first, this seemed like a real gimmick, or something for the instagram lovers out there. on the other hand, fuji has always been very serious about it’s analog films, so a simulated setting on a system camera is a nice added bonus. \n\nwhat are your opinions on the filters? gimmick, or valuable option? do you use it a lot?", "sortedWord": "None", "Identifyer": null, "identifyer": 329, "year": "2018"}, {"autor": "vettebadeend", "date": "2018-04-18 16:35:15", "content": "I’m going to make the switch to Fujifilm /!/ I’m going to do it. Switching from my current Nikon setup (D800, 14-24mm 2.8, 24-70mm 2.8, 50mm 1,8) to Fujifilm X-t2 or X-h1. What would you guys do? And I was thinking of getting the 16-55mm 2.8 lens with it. Any tips for a good (portrait) lens?\n", "link": "https://www.reddit.com/r/fujifilm/comments/8d70ts/im_going_to_make_the_switch_to_fujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’m going to make", "selectorShort": "make", "MarkedSent": "-----> i !!! ’m -----> going !!!  -----> to !!!  -----> make !!!  the switch -----> to !!!  fujifilm /!/ i’m going to do it. switching from my current nikon setup (d800, 14-24mm 2.8, 24-70mm 2.8, 50mm 1,8) to fujifilm x-t2 or x-h1. what would you guys do? and i was thinking of getting the 16-55mm 2.8 lens with it. any tips for a good (portrait) lens?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 399, "year": "2018"}, {"autor": "maaubel", "date": "2018-04-05 15:04:13", "content": "Hi guys, question for my fellow xt-2 owners. /!/ In february i bought the xt-2 and since then it has been with me for about 2-3 weeks. A week after i got it seemed to not turn on sometimes. So i sent it to fuji for repairs. I’ve got it back now but my problem stil persists. I can make this happen any time. When i turn the camera on and off and 2-3 secs later on again somtimes the screen stays black but you can hear the regular sound it makes when an xt2 turns on. However the camera is completely inresponsive. If that happens i have to take the battery completely out and put it back in to make it work again. But i can easily recreate this issue time and time again. \n\nMy question to my fellow xt-2 owners is, can you guys make the same thing happen to your xt-2’s?\n\nI just want to know whether the xt2 i got is a faulty one or whether this is common in all xt2’s. Before i send it in again for another 4 weeks for repairs... \n\nI even bought a new battery in the hope that would solve the issue but alas. Nope...\n\nIt also isnt the sd card, formatted in in my mac etc etc. \n\nThere is no dust on the eye sensor, the ev also wont go on if this issue happens.\n\nKnow that this doesnt just happen to me when i force recreate the issue, it also happens sporadically. So basically its a lottery of getting a shot or not...\n\nPlease help me out, thanks guys!\n\nEdit: at fuji they replaced the screen and main circuit board..", "link": "https://www.reddit.com/r/fujifilm/comments/8a0g5z/hi_guys_question_for_my_fellow_xt2_owners/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "hi guys, question for my fellow xt-2 owners. /!/ in february i bought the xt-2 and since then it has been with me for about 2-3 weeks. a week after i got it seemed to not turn on sometimes. so i sent it to fuji for repairs. i’ve got it back now but my problem stil persists. -----> i !!!  -----> can !!!  -----> make !!!  this happen any time. when i turn the camera on and off and 2-3 secs later on again somtimes the screen stays black but you can hear the regular sound it makes when an xt2 turns on. however the camera is completely inresponsive. if that happens i have to take the battery completely out and put it back in to make it work again. but i can easily recreate this issue time and time again. \n\nmy question to my fellow xt-2 owners is, can you guys make the same thing happen to your xt-2’s?\n\ni just want to know whether the xt2 i got is a faulty one or whether this is common in all xt2’s. before i send it in again for another 4 weeks for repairs... \n\ni even bought a new battery in the hope that would solve the issue but alas. nope...\n\nit also isnt the sd card, formatted in in my mac etc etc. \n\nthere is no dust on the eye sensor, the ev also wont go on if this issue happens.\n\nknow that this doesnt just happen to me when i force recreate the issue, it also happens sporadically. so basically its a lottery of getting a shot or not...\n\nplease help me out, thanks guys!\n\nedit: at fuji they replaced the screen and main circuit board..", "sortedWord": "None", "Identifyer": null, "identifyer": 433, "year": "2018"}, {"autor": "pork_floss", "date": "2018-03-22 01:47:35", "content": "Did I make the right decision? x100s instead of x100t /!/ I’m leaving for a trip next week and had my eye on a used x100t for $750 that possibly won’t be delivered in time. I stopped by my local camera shop today and they had an x100s and I picked it up for $400. It had 9700 shutter count, pretty great condition. I still have 30 days to return it. I read it focuses much slower, and after a few hours of playing with it tonight I did notice that. I’m not sure how much it will bother me while on the trip. Should I keep it or should i return it and  hold out for a nicely used x100t when I get back from my trip? Those that have used both, did you care?", "link": "https://www.reddit.com/r/fujifilm/comments/867x1w/did_i_make_the_right_decision_x100s_instead_of/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "did -----> i !!!  -----> make !!!  the right decision? x100s instead of x100t /!/ i’m leaving for a trip next week and had my eye on a used x100t for $750 that possibly won’t be delivered in time. i stopped by my local camera shop today and they had an x100s and i picked it up for $400. it had 9700 shutter count, pretty great condition. i still have 30 days to return it. i read it focuses much slower, and after a few hours of playing with it tonight i did notice that. i’m not sure how much it will bother me while on the trip. should i keep it or should i return it and  hold out for a nicely used x100t when i get back from my trip? those that have used both, did you care?", "sortedWord": "None", "Identifyer": null, "identifyer": 480, "year": "2018"}, {"autor": "TerrickCEF", "date": "2018-07-20 07:08:21", "content": "How to make sure that the used camera is still in good conditions? (Fuji experts please come in) /!/ I have made up my mind to buy the Fujifilm X100F.\n\nI found a seller that claimed his used X100F to be \"97% like new in the box set\" with 1-month personal warranty (not the product warranty which has already ended). I still have no idea what it means by 97% like new.\n\nSo how do I make sure if it's still good in conditions for me to use for an extended period of time? (presumably 3-4 years)\n\nCheers", "link": "https://www.reddit.com/r/fujifilm/comments/90dueq/how_to_make_sure_that_the_used_camera_is_still_in/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "how to make sure that the used camera is still in good conditions? (fuji experts please come in) /!/ -----> i !!!  -----> have !!!  -----> made !!!  up my mind to buy the fujifilm x100f.\n\ni found a seller that claimed his used x100f to be \"97% like new in the box set\" with 1-month personal warranty (not the product warranty which has already ended). i still have no idea what it means by 97% like new.\n\nso how do i make sure if it's still good in conditions for me to use for an extended period of time? (presumably 3-4 years)\n\ncheers", "sortedWord": "None", "Identifyer": null, "identifyer": 577, "year": "2018"}, {"autor": "Svilis", "date": "2018-07-13 13:39:00", "content": "Scratch on sensor /!/ Hey!\n\nI bought my xt2 used on ebay several months ago. And recently I realized that I got ripped off because of 2 small scratches on sensor. I am over being mad at the fact and ready for just paying a service and getting it repaired. Stupid mistake I made buying camera used, but I still love it and it is still on my hands. So, the question is - how much would cost to get rid of those scratches or replacing of sensor, or maybe even just sensor protecting glass? Thank you!", "link": "https://www.reddit.com/r/fujifilm/comments/8yk1lw/scratch_on_sensor/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "scratch on sensor /!/ hey!\n\ni bought my xt2 used on ebay several months ago. and recently i realized that i got ripped off because of 2 small scratches on sensor. i am over being mad at the fact and ready for just paying a service and getting it repaired. stupid mistake -----> i !!!  -----> made !!!  buying camera used, but -----> i !!!  still love it and it is still on my hands. so, the question is - how much would cost to get rid of those scratches or replacing of sensor, or maybe even just sensor protecting glass? thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 614, "year": "2018"}, {"autor": "42_milkmen42", "date": "2018-10-14 22:45:53", "content": "Second body for tethered studio shooting /!/ I currently use an X-T20 for my personal landscape and travel photography.  I've been branching out into headshots and would like to shoot tethered.  I'm trying to decide between the X-T1 and X-T2 for my second body for this usage.  There's still other gear I need to pick up, so I am budget conscious.  I anticipate using Capture One with the newly released native tethering support (although I can't find any recent videos to show the native tethering improvements?).  Will the T2 be noticeably better for tethered studio shooting?  Autofocus is not a big deal to me (does the T2 have an advantage of lower EV focusing?  I know the T3 is advertised as -5EV), 16MP is plenty for a headshot, and I shoot at ISO 200 or 400.  The T2 uses USB3.0 and the T1 uses USB2.0 - does this have a real-world impact?  The one card slot on the T1 doesn't matter because C1 only saves to the PC when tethered anyway.  \n\nIs there anything I'm missing to help me make a decision between the T1 and T2 for my use case?", "link": "https://www.reddit.com/r/fujifilm/comments/9o75em/second_body_for_tethered_studio_shooting/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "second body for tethered studio shooting /!/ i currently use an x-t20 for my personal landscape and travel photography.  i've been branching out into headshots and would like to shoot tethered.  i'm trying to decide between the x-t1 and x-t2 for my second body for this usage.  there's still other gear i need to pick up, so i am budget conscious.  i anticipate using capture one with the newly released native tethering support (although i can't find any recent videos to show the native tethering improvements?).  will the t2 be noticeably better for tethered studio shooting?  autofocus is not a big deal to me (does the t2 have an advantage of lower ev focusing?  i know the t3 is advertised as -5ev), 16mp is plenty for a headshot, and i shoot at iso 200 or 400.  the t2 uses usb3.0 and the t1 uses usb2.0 - does this have a real-world impact?  the one card slot on the t1 doesn't matter because c1 only saves to the pc when tethered anyway.  \n\nis there anything i'm missing to help -----> me !!!  -----> make !!!  a decision between the t1 and t2 for my use case?", "sortedWord": "None", "Identifyer": null, "identifyer": 636, "year": "2018"}, {"autor": "Inevitable_Soup", "date": "2018-10-04 02:46:16", "content": "How is Shadow detail when shooting video on x-t3? /!/ Hi all.  Can anyone comment on the shadow detail when shooting 4k on the X-T3, specifically with the Eterna profile? I'm making a difficult decision between the x-t3 and a7iii, and an important quality for me is shadow detail.\n\nI love the colors fuji cameras produce for narrative cinema work, but I tend to shoot a lot of dark rooms and african-american subjects. I've scoured youtube and vimeo for sample footage and it looks like a lot of shadow detail gets lost, and without direct light figures turn to dark silhouettes. \n\nCan anyone comment on this?  Can details be pulled from the darker parts of the frame in post?Will the highlights hold if exposing for a darker subject? How is the highlight roll-off?\n", "link": "https://www.reddit.com/r/fujifilm/comments/9l80kb/how_is_shadow_detail_when_shooting_video_on_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "how is shadow detail when shooting video on x-t3? /!/ hi all.  can anyone comment on the shadow detail when shooting 4k on the x-t3, specifically with the eterna profile? -----> i !!! 'm -----> making !!!  a difficult decision between the x-t3 and a7iii, and an important quality for me is shadow detail.\n\ni love the colors fuji cameras produce for narrative cinema work, but i tend to shoot a lot of dark rooms and african-american subjects. i've scoured youtube and vimeo for sample footage and it looks like a lot of shadow detail gets lost, and without direct light figures turn to dark silhouettes. \n\ncan anyone comment on this?  can details be pulled from the darker parts of the frame in post?will the highlights hold if exposing for a darker subject? how is the highlight roll-off?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 683, "year": "2018"}, {"autor": "sheldoneousk", "date": "2018-09-28 13:05:19", "content": "Olympus user thinking of swtiching /!/ Good morning,\n\nI currently use an OMD EM5 Olympus Micro 4/3s camera.  However, it is starting to show its age a bit and some of the lack of features are kind of annoying. I have been thinking of getting a new body and have also been pondering a switch to a different system entirely. I like the aesthetics of the Fuji cameras and some of the photos that I've seen them produce are quite stellar. \n\nI am mostly a faux street photographer. Meaning that when i am in a new place or places with a lot of people i will take pics of street scenes but also use my camera to take pics of family as well. I have a tendency to shoot in a lot of low light scenarios as well. \n\nThings I am looking for are something that is budget friendly (around 1000usd this includes selling off or trading current gear). Something which is fairly portable, I would say pocketable but I am not sure I want to limit myself to a fixed focal length..yet) has things like wifi/ decent viewfinder and LCD (EM5s LCD is garbage)/ Geotagging and hopefully decent video. Would be looking for a kit to get me started. I prefer Primes to Zooms as well. \n\nAll in all I was hoping you all might be able to help me make an informed decision or tell me I'm a crazy person. \n\n&amp;#x200B;\n\nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/9jmrw0/olympus_user_thinking_of_swtiching/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "olympus user thinking of swtiching /!/ good morning,\n\ni currently use an omd em5 olympus micro 4/3s camera.  however, it is starting to show its age a bit and some of the lack of features are kind of annoying. i have been thinking of getting a new body and have also been pondering a switch to a different system entirely. i like the aesthetics of the fuji cameras and some of the photos that i've seen them produce are quite stellar. \n\ni am mostly a faux street photographer. meaning that when i am in a new place or places with a lot of people i will take pics of street scenes but also use my camera to take pics of family as well. i have a tendency to shoot in a lot of low light scenarios as well. \n\nthings i am looking for are something that is budget friendly (around 1000usd this includes selling off or trading current gear). something which is fairly portable, i would say pocketable but i am not sure i want to limit myself to a fixed focal length..yet) has things like wifi/ decent viewfinder and lcd (em5s lcd is garbage)/ geotagging and hopefully decent video. would be looking for a kit to get me started. i prefer primes to zooms as well. \n\nall in all i was hoping you all might be able to help -----> me !!!  -----> make !!!  an informed decision or tell -----> me !!!  i'm a crazy person. \n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 713, "year": "2018"}, {"autor": "jayr5978", "date": "2018-09-10 12:20:45", "content": "Fujifilm Camera Remote transferred photo orientation /!/ Hi All,\n\nNew Fujifilm X-T2 owner here. When I send photos to my Galaxy S9+ taken with the X-T2 in portrait orientation, the photos appear in the gallery rotated 90 degrees. When I use the crop/rotate tool in the gallery app, the photo appears in the correct orientation and I am not allowed to save it because I've not made any changes to it. I've tried a 3rd party gallery app (Focus Go) and it does the reverse (photo has correct orientation in the gallery view but opening the photo shows it rotated 90 degrees). This is incredibly frustrating and all my Googling for anything on this issue comes up blank, so I'm assuming I am doing something wrong. \n\nHas anyone else seen this problem? FYI, photos transferred to my wife's iPhone 8 with no problem and have the correct orientation in both gallery and image viewer.", "link": "https://www.reddit.com/r/fujifilm/comments/9emlmx/fujifilm_camera_remote_transferred_photo/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've not made", "selectorShort": "make", "MarkedSent": "fujifilm camera remote transferred photo orientation /!/ hi all,\n\nnew fujifilm x-t2 owner here. when i send photos to my galaxy s9+ taken with the x-t2 in portrait orientation, the photos appear in the gallery rotated 90 degrees. when -----> i !!!  use the crop/rotate tool in the gallery app, the photo appears in the correct orientation and -----> i !!!  am -----> not !!!  allowed to save it because -----> i !!! 've -----> not !!!  -----> made !!!  any changes to it. i've tried a 3rd party gallery app (focus go) and it does the reverse (photo has correct orientation in the gallery view but opening the photo shows it rotated 90 degrees). this is incredibly frustrating and all my googling for anything on this issue comes up blank, so i'm assuming i am doing something wrong. \n\nhas anyone else seen this problem? fyi, photos transferred to my wife's iphone 8 with no problem and have the correct orientation in both gallery and image viewer.", "sortedWord": "None", "Identifyer": null, "identifyer": 729, "year": "2018"}, {"autor": "brockindaz", "date": "2018-08-30 18:42:23", "content": "Is there still a firmware update coming for the X100F? /!/ Recently some other models got update with new features, improvements, etc. I seem to remember the X100F was supposed to get one as well, albeit a little delayed.\n\nHave I made that up or is it still the case? ", "link": "https://www.reddit.com/r/fujifilm/comments/9bmbpk/is_there_still_a_firmware_update_coming_for_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "is there still a firmware update coming for the x100f? /!/ recently some other models got update with new features, improvements, etc. i seem to remember the x100f was supposed to get one as well, albeit a little delayed.\n\nhave -----> i !!!  -----> made !!!  that up or is it still the case? ", "sortedWord": "None", "Identifyer": null, "identifyer": 779, "year": "2018"}, {"autor": "damshawty", "date": "2018-08-27 01:23:10", "content": "Would you rather /!/ I made an earlier post about this. Long story short, im going to Iceland in 2 months. Albeit i mostly shoot street, i like flexibility. Would you rather the 16-55 or the 18-55 and the 16mm. I have the 35/1.4 still as a great prime, just wanted to hear some feedback. Cheers", "link": "https://www.reddit.com/r/fujifilm/comments/9akt8i/would_you_rather/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "would you rather /!/ -----> i !!!  -----> made !!!  an earlier post about this. long story short, im going to iceland in 2 months. albeit i mostly shoot street, i like flexibility. would you rather the 16-55 or the 18-55 and the 16mm. i have the 35/1.4 still as a great prime, just wanted to hear some feedback. cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 792, "year": "2018"}, {"autor": "Bulldor81", "date": "2018-08-22 08:48:53", "content": "Convince me to get a X-T2 /!/ Hey all. I'm making the switch from sony to fuji. Currently I own both an a7 and an a6000. I'm looking to buy either an X-T20 or an X-T2. I've been doing a lot of reading and I can't decide if I want to pay the extra price for the X-T2 or not. It's really difficult to tell the real life benefits just from specs on paper. \n\nSo I'd like to hear from owners who have either or both and why you prefer one or the other.\n\nI don't have any need for the weather sealing as I almost exclusively shoot indoors or in sunny weather. But there are more benefits to the X-T2 aswell, I'm just not sure if its enough to justify the extra cost.", "link": "https://www.reddit.com/r/fujifilm/comments/99bol8/convince_me_to_get_a_xt2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "convince me to get a x-t2 /!/ hey all. -----> i !!! 'm -----> making !!!  the switch from sony to fuji. currently i own both an a7 and an a6000. i'm looking to buy either an x-t20 or an x-t2. i've been doing a lot of reading and i can't decide if i want to pay the extra price for the x-t2 or not. it's really difficult to tell the real life benefits just from specs on paper. \n\nso i'd like to hear from owners who have either or both and why you prefer one or the other.\n\ni don't have any need for the weather sealing as i almost exclusively shoot indoors or in sunny weather. but there are more benefits to the x-t2 aswell, i'm just not sure if its enough to justify the extra cost.", "sortedWord": "None", "Identifyer": null, "identifyer": 805, "year": "2018"}, {"autor": "French_Syd", "date": "2018-07-07 08:25:26", "content": "X Raw studio stopped working suddenly (OSX) /!/ Hi, I'm having a problem with the software. Ive been using it for months without issues, and now when I open it, the main window is not showing at all. The global menu shows the different menus for the app, I can also open preferences and such. I've made sure it's not hidden somewhere too. I've also tried deleting and installing the app.\n\nI'm running High Sierra on a late 2013 Retina MBP\n\nScreenshots here: https://imgur.com/a/trPKgFY", "link": "https://www.reddit.com/r/fujifilm/comments/8wrrng/x_raw_studio_stopped_working_suddenly_osx/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "x raw studio stopped working suddenly (osx) /!/ hi, i'm having a problem with the software. ive been using it for months without issues, and now when i open it, the main window is not showing at all. the global menu shows the different menus for the app, i can also open preferences and such. -----> i !!! 've -----> made !!!  sure it's not hidden somewhere too. i've also tried deleting and installing the app.\n\ni'm running high sierra on a late 2013 retina mbp\n\nscreenshots here: https://imgur.com/a/trpkgfy", "sortedWord": "None", "Identifyer": null, "identifyer": 844, "year": "2018"}, {"autor": "illuminotyou", "date": "2018-11-21 15:18:10", "content": "Basic Gear for Events (Weddings, Baptisms, etc) /!/ Hi everyone, I'm planning to do events and I'm wondering how my gear roadmap should be like. I'm talking small events first with low budget. I'd love to purchase everything at once but my bank account won't make that happen.\n\nHere's what I have currently:\nXT20\n16-50mm kit lens\n35mm f2\nGodox tt350\n\nWishlist:\n\nBody\n- get another body, probably an XT2 for the dual card slot, available battery grip\n\nLens \n- this is where I'm not sure, \n1. should I get the 50-140 f2.8 for versatility?\n2. 56mm f1.2 for portraits\n3. 16mm f1.4 for the wide group shots/intimate close ups\n\n\nMy plan:\n1. Get the 56 f1.2 first so I can hopefully make some money while waiting to compete my events gear?\n2. Get the 50-140 f2.8 for a versatile lens\n\nThanks in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/9z42ik/basic_gear_for_events_weddings_baptisms_etc/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can hopefully make", "selectorShort": "make", "MarkedSent": "basic gear for events (weddings, baptisms, etc) /!/ hi everyone, i'm planning to do events and i'm wondering how my gear roadmap should be like. i'm talking small events first with low budget. i'd love to purchase everything at once but my bank account won't make that happen.\n\nhere's what i have currently:\nxt20\n16-50mm kit lens\n35mm f2\ngodox tt350\n\nwishlist:\n\nbody\n- get another body, probably an xt2 for the dual card slot, available battery grip\n\nlens \n- this is where i'm not sure, \n1. should i get the 50-140 f2.8 for versatility?\n2. 56mm f1.2 for portraits\n3. 16mm f1.4 for the wide group shots/intimate close ups\n\n\nmy plan:\n1. get the 56 f1.2 first so -----> i !!!  -----> can !!!  -----> hopefully !!!  -----> make !!!  some money while waiting to compete my events gear?\n2. get the 50-140 f2.8 for a versatile lens\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 882, "year": "2018"}, {"autor": "thenightmancommeth88", "date": "2018-12-24 10:08:55", "content": "Fujifilm Cashback Issue /!/ Hi,\n\nI’m trying to claim a cash back offer in the UK but it won’t let me select which store I made the purchase at. I’ve tried it on 3 different browsers and my phone, but it’s not giving me any options to choose. \n\nIt’s one day after the 30 day wait period. \n\nAnyone else had this issue?", "link": "https://www.reddit.com/r/fujifilm/comments/a93tbp/fujifilm_cashback_issue/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "fujifilm cashback issue /!/ hi,\n\ni’m trying to claim a cash back offer in the uk but it won’t let me select which store -----> i !!!  -----> made !!!  the purchase at. i’ve tried it on 3 different browsers and my phone, but it’s not giving me any options to choose. \n\nit’s one day after the 30 day wait period. \n\nanyone else had this issue?", "sortedWord": "None", "Identifyer": null, "identifyer": 1004, "year": "2018"}, {"autor": "Grego54", "date": "2018-03-16 04:09:57", "content": "I Finally Did It!!! /!/ I just finally took a big step and purchased myself a fujifilm camera and 2 lenses. I've been researching and researching and researching about what my next camera will be. Then discovered fujifilm and really kept going back to them when I would look at other cameras and their lenses.  So after a lot of research and more importantly, the love and support from my incredible wife, I did it!  \n\nI bought the x-t2 + 18-55mm because I absolutely love the setup of the body and how you can physically see and adjust your settings on the camera. I've only used primes before on my previous camera, so I thought the 18-55 for the price would be a good start.\n\nThe second lens I chose was the 16mm f1.4.  I was torn between this and the 56 f1.2, but went with the 16 because I mostly enjoy taking landscapes and it's weather resistant. I'll make the 56 a big goal of mine to get in the future.  Plus I'm turning 30 this year my wife said she will get me the 35 f2, which I think isn't too bad of a start for a setup.  \n\nI'm super excited and honestly cannot wait to start shooting with it. I'm also overjoyed that I can now officially post to the fujifilm community as an official owner of their camera and lenses.", "link": "https://www.reddit.com/r/fujifilm/comments/84srib/i_finally_did_it/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "i finally did it!!! /!/ i just finally took a big step and purchased myself a fujifilm camera and 2 lenses. i've been researching and researching and researching about what my next camera will be. then discovered fujifilm and really kept going back to them when i would look at other cameras and their lenses.  so after a lot of research and more importantly, the love and support from my incredible wife, i did it!  \n\ni bought the x-t2 + 18-55mm because i absolutely love the setup of the body and how you can physically see and adjust your settings on the camera. i've only used primes before on my previous camera, so i thought the 18-55 for the price would be a good start.\n\nthe second lens i chose was the 16mm f1.4.  i was torn between this and the 56 f1.2, but went with the 16 because i mostly enjoy taking landscapes and it's weather resistant. -----> i !!! -----> 'll !!!  -----> make !!!  the 56 a big goal of mine to get in the future.  plus i'm turning 30 this year my wife said she will get me the 35 f2, which i think isn't too bad of a start for a setup.  \n\ni'm super excited and honestly cannot wait to start shooting with it. i'm also overjoyed that i can now officially post to the fujifilm community as an official owner of their camera and lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 1109, "year": "2018"}, {"autor": "mattjunes", "date": "2018-09-24 03:25:51", "content": "Help me pick a telephoto lens please! /!/ I’m looking to add either the 50 f2, 56 f1.2 or 90 f2 to my collection of 16 1.4 and 35 2, but I can’t make a decision on which one to get. Hoping those of you with experience with these lenses could offer your thoughts to help me narrow it down. I shoot a little bit of everything - adventure and travel, street, candids with friends and family, my dog, or whatever I’m feeling really. I don’t do a whole lot of posed portraits at the moment. Which would you recommend? Budget isn’t really an issue. Thanks. ", "link": "https://www.reddit.com/r/fujifilm/comments/9ien6z/help_me_pick_a_telephoto_lens_please/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can’t make", "selectorShort": "make", "MarkedSent": "help me pick a telephoto lens please! /!/ -----> i !!! ’m looking to add either the 50 f2, 56 f1.2 or 90 f2 to my collection of 16 1.4 and 35 2, but -----> i !!!  -----> ca !!! -----> n’t !!!  -----> make !!!  a decision on which one to get. hoping those of you with experience with these lenses could offer your thoughts to help me narrow it down. i shoot a little bit of everything - adventure and travel, street, candids with friends and family, my dog, or whatever i’m feeling really. i don’t do a whole lot of posed portraits at the moment. which would you recommend? budget isn’t really an issue. thanks. ", "sortedWord": "None", "Identifyer": null, "identifyer": 1127, "year": "2018"}, {"autor": "dearpisa", "date": "2018-08-13 14:32:49", "content": "Which 23mm and which 35mm? /!/ Hi all,\n\nI'm planning to buy the two primes mentioned along with my kit lens, the main reasons are: \n\n* I want a weather sealed lens when I need it\n* I want a fast prime for low-light and/or bokehlicious portraits\n\nI wonder whch combination of the f2 and f1.4 I should by. The 23 f2 and 35 f1.4 sounds nice to me, however if I'm shooting indoors (which means low light) the wider lens might be more useful. On the other hand, if I choose the combo of 23 f1.4 and 35 f2, there would be less bokeh I can make out of them.\n\nI suppose many of Fuji shooters have faced the same dilemma. Can you give me advice on which to choose?", "link": "https://www.reddit.com/r/fujifilm/comments/96ys8x/which_23mm_and_which_35mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "which 23mm and which 35mm? /!/ hi all,\n\ni'm planning to buy the two primes mentioned along with my kit lens, the main reasons are: \n\n* i want a weather sealed lens when i need it\n* i want a fast prime for low-light and/or bokehlicious portraits\n\ni wonder whch combination of the f2 and f1.4 i should by. the 23 f2 and 35 f1.4 sounds nice to me, however if i'm shooting indoors (which means low light) the wider lens might be more useful. on the other hand, if -----> i !!!  choose the combo of 23 f1.4 and 35 f2, there would be less bokeh -----> i !!!  -----> can !!!  -----> make !!!  out of them.\n\ni suppose many of fuji shooters have faced the same dilemma. can you give me advice on which to choose?", "sortedWord": "None", "Identifyer": null, "identifyer": 1177, "year": "2018"}, {"autor": "SlowpokeSloth69", "date": "2018-10-22 18:50:07", "content": "I work at Fuji and... /!/ I work for customer support. When you guys call, can you please be a little more patient and less rude when complaining about the product. All we can do is assist and assure, We do not make the cameras. Thank you.", "link": "https://www.reddit.com/r/fujifilm/comments/9qgr41/i_work_at_fuji_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "we do not make", "selectorShort": "make", "MarkedSent": "i work at fuji and... /!/ i work for customer support. when you guys call, can you please be a little more patient and less rude when complaining about the product. all -----> we !!!  can -----> do !!!  is assist and assure, -----> we !!!  -----> do !!!  -----> not !!!  -----> make !!!  the cameras. thank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 1276, "year": "2018"}, {"autor": "Sphinxcob", "date": "2018-12-02 10:40:12", "content": "How do I achieve this level of sharpness? (see linked) /!/ Dear all,\n\nI was scrolling through Instagram and I saw this post:  https://www.instagram.com/p/Bq2S9LNhofC/?utm\\_source=ig\\_web\\_button\\_share\\_sheet \n\nJust wondering how it is possible to achieve this level of sharpness @ 100% on a Fuji X system? I have an X-T20 which I am very happy with, but can't come close to this level of detail. \n\nI acknowledge that I am making a comparison with one of Sony's best mirrorless \\[full frame\\] cameras and lenses with my mid-tier APS-C Fuji.", "link": "https://www.reddit.com/r/fujifilm/comments/a2cau2/how_do_i_achieve_this_level_of_sharpness_see/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i am making", "selectorShort": "make", "MarkedSent": "how do i achieve this level of sharpness? (see linked) /!/ dear all,\n\ni was scrolling through instagram and i saw this post:  https://www.instagram.com/p/bq2s9lnhofc/?utm\\_source=ig\\_web\\_button\\_share\\_sheet \n\njust wondering how it is possible to achieve this level of sharpness @ 100% on a fuji x system? i have an x-t20 which i am very happy with, but can't come close to this level of detail. \n\n-----> i !!!  acknowledge that -----> i !!!  -----> am !!!  -----> making !!!  a comparison with one of sony's best mirrorless \\[full frame\\] cameras and lenses with my mid-tier aps-c fuji.", "sortedWord": "None", "Identifyer": null, "identifyer": 1356, "year": "2018"}, {"autor": "PUSH_IT_A_STOP", "date": "2018-11-25 17:24:57", "content": "Traded my 23 f2 &amp; my 56 for this. I was nervous about letting go of the 56, but I think I made the right choice 😩💦", "link": "https://www.reddit.com/r/fujifilm/comments/a0abtu/traded_my_23_f2_my_56_for_this_i_was_nervous/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "traded my 23 f2 &amp; my 56 for this. -----> i !!!  was nervous about letting go of the 56, but -----> i !!!  think -----> i !!!  -----> made !!!  the right choice 😩💦", "sortedWord": "None", "Identifyer": null, "identifyer": 1390, "year": "2018"}, {"autor": "bearcat--", "date": "2018-11-24 15:16:05", "content": "Bought my first XT2 - thanks to fujifilm for helping me make my choice - any tips?", "link": "https://www.reddit.com/r/fujifilm/comments/9zz7l8/bought_my_first_xt2_thanks_to_fujifilm_for/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "bought my first xt2 - thanks to fujifilm for helping -----> me !!!  -----> make !!!  my choice - any tips?", "sortedWord": "None", "Identifyer": null, "identifyer": 1396, "year": "2018"}], "name": "makefujifilm2018"}