{"interestingcomments": [{"autor": "wheezealittlejuice", "date": "2021-09-29 19:18:33", "content": "Lens advice for new Fujifilm X user /!/ Hello I made the switch from Canon to a Fuji X body and looking for lens recommendations.\n\nI currently have the canon nifty 50 &amp; EFS 55-250mm for which I'm considering the Fringer adapter instead of buying new Fuji glass. Also would like to replace my pancake EF-M 22mm f2 and kit 15-45mm with something similar as there is no way to adapt them. I would mainly be shooting street photography, outdoor sports/automotive tutorial videos, b roll and some talking head stuff indoors.\n\nAnyone have experience with the adapter or could recommend any lenses?\n\nNot against going for other brands, I like to save money!\n\nThanks for looking : )", "link": "https://www.reddit.com/r/fujifilm/comments/py2j9c/lens_advice_for_new_fujifilm_x_user/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "lens advice for new fujifilm x user /!/ hello -----> i !!!  -----> made !!!  the switch from canon to a fuji x body and looking for lens recommendations.\n\ni currently have the canon nifty 50 &amp; efs 55-250mm for which i'm considering the fringer adapter instead of buying new fuji glass. also would like to replace my pancake ef-m 22mm f2 and kit 15-45mm with something similar as there is no way to adapt them. i would mainly be shooting street photography, outdoor sports/automotive tutorial videos, b roll and some talking head stuff indoors.\n\nanyone have experience with the adapter or could recommend any lenses?\n\nnot against going for other brands, i like to save money!\n\nthanks for looking : )", "sortedWord": "None", "Identifyer": null, "identifyer": 83101, "year": "2021"}, {"autor": "Spartacusz", "date": "2021-08-31 16:35:11", "content": "Stuck between 27mm and 35mm f2 lenses /!/ I mainly do street, nature, landscapes and close up objects. I want to go for a “just one lens” setup to have a minimalistic setup.\n\nShould I get the 27mm r wr for compactness, wider view with more flexibility to crop in, or get the 35mm f2 for extra f-stop and shallower dof \n\nIm leaning towards the 27mm but its out of stock everywhere so maybe the 35mm would be the better option?\n\nI really have no experience with primes and I want to make the right choice for long term as well. The 2 options: Wait for 27mm r wr or buy 35mm f2 now?\n\nThanks for your help in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/pf9hle/stuck_between_27mm_and_35mm_f2_lenses/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "stuck between 27mm and 35mm f2 lenses /!/ i mainly do street, nature, landscapes and close up objects. i want to go for a “just one lens” setup to have a minimalistic setup.\n\nshould -----> i !!!  get the 27mm r wr for compactness, wider view with more flexibility -----> to !!!  crop in, or get the 35mm f2 for extra f-stop and shallower dof \n\n-----> i !!! m leaning towards the 27mm but its out of stock everywhere so maybe the 35mm would be the better option?\n\n-----> i !!!  really have no experience with primes and -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  the right choice for long term as well. the 2 options: wait for 27mm r wr or buy 35mm f2 now?\n\nthanks for your help in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 83125, "year": "2021"}, {"autor": "Ikraaap", "date": "2021-08-01 16:27:49", "content": "Is it possible to add a film sim recipe you made to a RAF file? /!/ I accidentally turned of shooting in JPG and continued to shoot RAF only during a little trip. Now half of my shots are RAF + JPG with the recipe and the other half are RAF only. Is it possible to add the recipe I made to the other half of my shots?", "link": "https://www.reddit.com/r/fujifilm/comments/ovv8u5/is_it_possible_to_add_a_film_sim_recipe_you_made/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "is it possible to add a film sim recipe you made to a raf file? /!/ i accidentally turned of shooting in jpg and continued to shoot raf only during a little trip. now half of my shots are raf + jpg with the recipe and the other half are raf only. is it possible to add the recipe -----> i !!!  -----> made !!!  to the other half of my shots?", "sortedWord": "None", "Identifyer": null, "identifyer": 83208, "year": "2021"}, {"autor": "EasyGreek", "date": "2021-04-01 22:21:40", "content": "Help for fast portrait lens /!/ One of my favorite lenses of all time is a vintage Zuiko 50mm f/1.4 I'd use on an old Olympus 4/3 DSLR. Those sensors had a crop factor of 2.0, making my lens 100mm.\n\nI don't know what it was about that lens, but the portraits I made with it wide open were really something. Very soft and aetherial but somehow sharp at the same time. Amazing bokeh too.\n\nNow I'm wondering what I can get to recreate this effect on an X-T4. I still have the lens, so I guess I could try getting a 4/3 → X-mount adapter. Any other ideas for vintage and non-vintage prime tele X-mount lenses? \n\n I also have a Fringer EF adapter, so that increases options a lot.\n\nThank you!", "link": "https://www.reddit.com/r/fujifilm/comments/mi6kgt/help_for_fast_portrait_lens/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "help for fast portrait lens /!/ one of my favorite lenses of all time is a vintage zuiko 50mm f/1.4 i'd use on an old olympus 4/3 dslr. those sensors had a crop factor of 2.0, making my lens 100mm.\n\n-----> i !!!  don't know what it was about that lens, but the portraits -----> i !!!  -----> made !!!  with it wide open were really something. very soft and aetherial but somehow sharp at the same time. amazing bokeh too.\n\nnow i'm wondering what i can get to recreate this effect on an x-t4. i still have the lens, so i guess i could try getting a 4/3 → x-mount adapter. any other ideas for vintage and non-vintage prime tele x-mount lenses? \n\n i also have a fringer ef adapter, so that increases options a lot.\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 83613, "year": "2021"}, {"autor": "Street_Heat2156", "date": "2021-04-01 00:02:11", "content": "Can I make a fujifilm pinepix S4530 in to a webcam? /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/mhj44j/can_i_make_a_fujifilm_pinepix_s4530_in_to_a_webcam/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "can -----> i !!!  -----> make !!!  a fujifilm pinepix s4530 in to a webcam? /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 83660, "year": "2021"}, {"autor": "noaknobler", "date": "2021-02-27 03:43:32", "content": "Deity V-Mic D3 Pro staying on standby mode using my Fujifilm X-T3 Camera /!/ Hello Everyone, \n\nI recently purchased the Deity V-Mic D3 Pro for my Fujifilm X-T3 Camera, and I am having the problem of it staying on standby mode, even when I turn my camera on and start recording. I hooked up my mic to the camera using a TRRS audio cable that came with the mic and made sure that it was plugged in the mic port. I also turned off the internal mic on my camera and turned on the external mic, and I adjusted the dB gain on my camera and the mic. I also made sure the mic was fully charged before using it. I ordered the same mic before and had to return it for the same reasoning. Do you guys know what the problem might be? Any help would mean the world to me.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qr95gfiqyxj61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=a23a9f33dc2988d10c801ebbe184c7c9146af5d6", "link": "https://www.reddit.com/r/fujifilm/comments/ltfg4e/deity_vmic_d3_pro_staying_on_standby_mode_using/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i also made", "selectorShort": "make", "MarkedSent": "deity v-mic d3 pro staying on standby mode using my fujifilm x-t3 camera /!/ hello everyone, \n\ni recently purchased the deity v-mic d3 pro for my fujifilm x-t3 camera, and i am having the problem of it staying on standby mode, even when i turn my camera on and start recording. i hooked up my mic to the camera using a trrs audio cable that came with the mic and made sure that it was plugged in the mic port. i also turned off the internal mic on my camera and turned on the external mic, and i adjusted the db gain on my camera and the mic. -----> i !!!  -----> also !!!  -----> made !!!  sure the mic was fully charged before using it. i ordered the same mic before and had to return it for the same reasoning. do you guys know what the problem might be? any help would mean the world to me.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qr95gfiqyxj61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=a23a9f33dc2988d10c801ebbe184c7c9146af5d6", "sortedWord": "None", "Identifyer": null, "identifyer": 83772, "year": "2021"}, {"autor": "leugenaars", "date": "2021-09-28 12:20:25", "content": "Fringer adapter NF-FX with X-T1 /!/ Hello,\n\nI've been a long time Nikon cameras user, but two years ago I bought a second hand Fujifilm X-T1 for good price. Since then I have been using mostly Fuji, but only own a 27mm f/2.8 lens for street shots.\n\nWith my Nikon D7000 I mostly shot concerts with a Nikkor 50mm f/1.8, a  Nikkor 55-200mm f/4-5.6 and a Tokina 11-16mm f/2.8, but I use the 50mm lens 90% of the time. A prime lens with the same capability for Fuji is too expensive if I want to shoot shows with the X-T1, so I have looked for a Fringer NF-FX adapter instead to use my previous lenses.\n\nDoes anyone have experience using a X-T1 with the Fringer adapter? How's the performance? I know the AF might be a slower than usual, but truth is the D7000 is not really a good staple at very fast focusing either so I would be fairly satisfied if I got the very same performance on my X-T1. Also I am a very patient photographer when it comes to shooting shows.\n\nI just fear the X-T1 and X-Trans II censor are just too outdated for a good Fringer adapter performance, so it would be great if anyone could help me to make a decision.\n\nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/px56iy/fringer_adapter_nffx_with_xt1/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me to make", "selectorShort": "make", "MarkedSent": "fringer adapter nf-fx with x-t1 /!/ hello,\n\ni've been a long time nikon cameras user, but two years ago i bought a second hand fujifilm x-t1 for good price. since then i have been using mostly fuji, but only own a 27mm f/2.8 lens for street shots.\n\nwith my nikon d7000 i mostly shot concerts with a nikkor 50mm f/1.8, a  nikkor 55-200mm f/4-5.6 and a tokina 11-16mm f/2.8, but i use the 50mm lens 90% of the time. a prime lens with the same capability for fuji is too expensive if i want to shoot shows with the x-t1, so i have looked for a fringer nf-fx adapter instead to use my previous lenses.\n\ndoes anyone have experience using a x-t1 with the fringer adapter? how's the performance? i know the af might be a slower than usual, but truth is the d7000 is not really a good staple at very fast focusing either so i would be fairly satisfied if i got the very same performance on my x-t1. also i am a very patient photographer when it comes to shooting shows.\n\ni just fear the x-t1 and x-trans ii censor are just too outdated for a good fringer adapter performance, so it would be great if anyone could help -----> me !!!  -----> to !!!  -----> make !!!  a decision.\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 84182, "year": "2021"}, {"autor": "IceColdSeltzer", "date": "2021-08-29 22:13:47", "content": "X-T4 bricked after firmware update via Android app. Will not power on. /!/ I purchased it used and the person I purchased it from purchased it from someone else so there is no purchase date that I know of.  It only had about 1100 clicks on it and I had taken photos and recorded video with no problems. He offered my money back but I feel this is fuji's fault and as the camera worked fine until the firmware update I can't make this his problem because of my bad luck.  Is there any way to reset it?  Is there any way to check warranty status and would it transfer to me?  Otherwise I will have to pay for the repair.  I am in New York.    \nThanks", "link": "https://www.reddit.com/r/fujifilm/comments/pe501d/xt4_bricked_after_firmware_update_via_android_app/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "x-t4 bricked after firmware update via android app. will not power on. /!/ i purchased it used and the person i purchased it from purchased it from someone else so there is no purchase date that i know of.  it only had about 1100 clicks on it and i had taken photos and recorded video with no problems. he offered my money back but -----> i !!!  feel this is fuji's fault and as the camera worked fine until the firmware update -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  this his problem because of my bad luck.  is there any way to reset it?  is there any way to check warranty status and would it transfer to me?  otherwise i will have to pay for the repair.  i am in new york.    \nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 84302, "year": "2021"}, {"autor": "Peter_55", "date": "2021-04-14 21:46:24", "content": "Fuji X100V - Problems With Accessories and GAS /!/ Are there many of us that are obsessed with accessories for our X100 cameras?  Maybe there are a lot of normal users out there who stick with the clean and plain lines of their cameras?  Voice your opinion or criticism.  I can take it, lol.\n\nHere is a list of my accessories for the X100V:\n\n* Haoge square hood and adapter\n* B+W Clear 49mm filter\n* Haoge convex soft release button\n* JJC grip with arca swiss base\n* Peak Design Leash camera strap\n* On Order - Haoge thumb grip\n* Pretty sure I'm done!\n\nI have certainly added some weight to my tiny camera. I like to make excuses and I do have bigger hands, lol.  Also, this kit is still far smaller and lighter than my Nikon D500.", "link": "https://www.reddit.com/r/fujifilm/comments/mr0tx0/fuji_x100v_problems_with_accessories_and_gas/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i like to make", "selectorShort": "make", "MarkedSent": "fuji x100v - problems with accessories and gas /!/ are there many of us that are obsessed with accessories for our x100 cameras?  maybe there are a lot of normal users out there who stick with the clean and plain lines of their cameras?  voice your opinion or criticism.  i can take it, lol.\n\nhere is a list of my accessories for the x100v:\n\n* haoge square hood and adapter\n* b+w clear 49mm filter\n* haoge convex soft release button\n* jjc grip with arca swiss base\n* peak design leash camera strap\n* on order - haoge thumb grip\n* pretty sure i'm done!\n\ni have certainly added some weight to my tiny camera. -----> i !!!  -----> like !!!  -----> to !!!  -----> make !!!  excuses and -----> i !!!  do have bigger hands, lol.  also, this kit is still far smaller and lighter than my nikon d500.", "sortedWord": "None", "Identifyer": null, "identifyer": 84486, "year": "2021"}, {"autor": "Bigdickshortguy", "date": "2021-05-30 02:16:04", "content": "Need help!!! /!/ Just got an x-a5. Been charging all day, and it still won’t turn on. Yes I made sure the battery was charged while camera was in the off position. Yes I then turned it on and pressed the shutter button down half way to get the monitor to turn on. Yes I ejected the battery and tried it all again. Yes I tried charging it on a different outlet. Yes the green charging light shows that “it’s apparently charging”! Help.... suggestions... tips?", "link": "https://www.reddit.com/r/fujifilm/comments/no1gh5/need_help/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "need help!!! /!/ just got an x-a5. been charging all day, and it still won’t turn on. yes -----> i !!!  -----> made !!!  sure the battery was charged while camera was in the off position. yes i then turned it on and pressed the shutter button down half way to get the monitor to turn on. yes i ejected the battery and tried it all again. yes i tried charging it on a different outlet. yes the green charging light shows that “it’s apparently charging”! help.... suggestions... tips?", "sortedWord": "None", "Identifyer": null, "identifyer": 84549, "year": "2021"}, {"autor": "photomikey", "date": "2021-07-15 06:11:51", "content": "With the recent talks of a Fujimount Voigtlander, I was inspired to make this combo a reality—easily my favorite combo at the moment. I’m curious to see what everyone else’s favorite non-native combo is and why?! Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/okmtt5/with_the_recent_talks_of_a_fujimount_voigtlander/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i was inspired to make", "selectorShort": "make", "MarkedSent": "with the recent talks of a fujimount voigtlander, -----> i !!!  -----> was !!!  -----> inspired !!!  -----> to !!!  -----> make !!!  this combo a reality—easily my favorite combo at the moment. i’m curious to see what everyone else’s favorite non-native combo is and why?! thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 84673, "year": "2021"}, {"autor": "whatodonext101", "date": "2021-07-30 22:37:40", "content": "What should I pay attention when buying a used X-T3? /!/ As the title implies, I found a good deal on an X-T3 but, being new to cameras and photography, I wonder what should I look at, what tests should I make, etc.\nAll help is much appreciated!", "link": "https://www.reddit.com/r/fujifilm/comments/ouvjdj/what_should_i_pay_attention_when_buying_a_used_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "what should i pay attention when buying a used x-t3? /!/ as the title implies, -----> i !!!  found a good deal on an x-t3 but, being new to cameras and photography, -----> i !!!  wonder what should -----> i !!!  look at, what tests should -----> i !!!  -----> make !!! , etc.\nall help is much appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 84715, "year": "2021"}, {"autor": "GTX1090ti", "date": "2021-06-30 13:42:41", "content": "A brand new PIKACHU-styled color for Fuji X-T2! /!/ Nikon has published new retro look cameras. Fujifilm looks beautiful, but they need more colors like Nikon! So I removed the old black skin and glued new colorful skin cut by myself. I also made this little red ball hot-shoe decoration with a joystick handle. \n\nhttps://preview.redd.it/adwd4cg1pe871.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=e3e1fa068deadecb83e6744502ae6871c99e5fb8\n\nhttps://preview.redd.it/o7ayp9g1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=3214934a98e2abead42a7e3057c81dce2a120110\n\nhttps://preview.redd.it/tftwqdg1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=79afb595e79ef1ae0fa79c09aa2660bbc0b05586\n\nhttps://preview.redd.it/j2vjbph1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=1fe0846758b890f26ba6f0f109fa9a1744eb3abb", "link": "https://www.reddit.com/r/fujifilm/comments/oaxli9/a_brand_new_pikachustyled_color_for_fuji_xt2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i also made", "selectorShort": "make", "MarkedSent": "a brand new pikachu-styled color for fuji x-t2! /!/ nikon has published new retro look cameras. fujifilm looks beautiful, but they need more colors like nikon! so i removed the old black skin and glued new colorful skin cut by myself. -----> i !!!  -----> also !!!  -----> made !!!  this little red ball hot-shoe decoration with a joystick handle. \n\nhttps://preview.redd.it/adwd4cg1pe871.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=e3e1fa068deadecb83e6744502ae6871c99e5fb8\n\nhttps://preview.redd.it/o7ayp9g1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=3214934a98e2abead42a7e3057c81dce2a120110\n\nhttps://preview.redd.it/tftwqdg1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=79afb595e79ef1ae0fa79c09aa2660bbc0b05586\n\nhttps://preview.redd.it/j2vjbph1pe871.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=1fe0846758b890f26ba6f0f109fa9a1744eb3abb", "sortedWord": "None", "Identifyer": null, "identifyer": 84905, "year": "2021"}, {"autor": "sailorbunni", "date": "2021-05-16 02:49:06", "content": "Photos not showing up when I plug my camera into my laptop /!/ Hello! I have the x100f and I wanted to import the files from my camera, so I connected it to my laptop (I have a MacBook Air) using a USB cable. The issue is that when my Photos App or Image Capture application comes up after connecting, it says I have no photos (even though when I checked back on my actual camera the photos are still there)! I'm not really sure what the problem is, I made sure my SD card was in properly and my battery was OK. Has anyone had this issue before? I tried looking it up but I couldn't find any answers. Do I need to put my camera on a certain setting to view photos or something??\n\n&amp;#x200B;\n\nSorry if this is a dumb question -- this is my first camera and I'm completely lost :(", "link": "https://www.reddit.com/r/fujifilm/comments/ndet4b/photos_not_showing_up_when_i_plug_my_camera_into/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "photos not showing up when i plug my camera into my laptop /!/ hello! i have the x100f and i wanted to import the files from my camera, so i connected it to my laptop (i have a macbook air) using a usb cable. the issue is that when my photos app or image capture application comes up after connecting, it says i have no photos (even though when i checked back on my actual camera the photos are still there)! -----> i !!! 'm not really sure what the problem is, -----> i !!!  -----> made !!!  sure my sd card was in properly and my battery was ok. has anyone had this issue before? i tried looking it up but i couldn't find any answers. do i need to put my camera on a certain setting to view photos or something??\n\n&amp;#x200b;\n\nsorry if this is a dumb question -- this is my first camera and i'm completely lost :(", "sortedWord": "None", "Identifyer": null, "identifyer": 85047, "year": "2021"}, {"autor": "EirikHavre", "date": "2021-02-24 20:35:32", "content": "After comparing an X-T2 to an X-T100 I feel like Fujifilm needs to move past the X-Trans sensor. I'll try to explain why and I will include a couple of comparisons AND the RAF files. Can we have a real discussion about this? /!/ First, I need to make it clear that the X-Trans sensor does not absolutely ruin any shots. And in some instances, its problems are not very visible at all. Its mostly when shooting landscapes that it starts to become annoying.\n\n&amp;#x200B;\n\nSecond, **I am not here to make anyone feel bad for their choices in cameras!** This is mostly me venting a little bit. And I personally LOVE my X-T2, I just dont love the sensor it has.\n\n&amp;#x200B;\n\nThird, all of this is based on mostly landscape photography and on selling prints. Selling prints means I pixel peep to make sure things are sharp and in focus and to fix dead/hot pixels. I think that is valid.\n\n&amp;#x200B;\n\n**EDIT:** I should also mention that yes, the way Lightroom handles X-Trans files is terrible. And if they could get their shit together I would be really happy. Maybe if they did that, some aspect of the X-Trans sensor would make it stand out. Or maybe it would just bring it up to the same quality as a normal sensor. But I would be happy if Adobe fixed LR, just to be clear!\n\n**EDIT2:** The more I think about it, the more I blame Lightroom. I might post these comparisons over on the Lightroom subreddit.\n\n&amp;#x200B;\n\nThese are the two big problems with the X-Trans sensor, in my opinion:\n\n&amp;#x200B;\n\n1. There are swirly artifacts that look ugly and needs to be fixed in small details in the image. Like, if a tiny object has a different color to its surroundings, it looks desaturated and does not keep its color as well as it should.\n2. Colors look washed out. Meaning, there is less “color definition” in small details in the image. Like, if a tiny object has a different color to its surroundings, it looks desaturated and does not keep its color as well as it should.\n\n&amp;#x200B;\n\nEither I can fix these issues by using the Enhance Detail feature in LR. The problem with that is that it requires more clicks, more time, and more disk space. And If I want to delete those files afterwards, to save up disk space, it requires even more clicking and time. With thousands of photos over several years, that adds up, and it does not feel like a good solution to me.\n\nOr I can fix them by using a different program to edit my RAF files in. But that is something that is very hard for me to do because I make a lot of panoramas. And I have yet to find any other RAW editor that lets me stitch RAW files and that outputs a panorama with all the dynamic range of the RAW files I stitched. For me, that is a killer feature.\n\nMaybe there are other ways of fixing these issues that I cant remember. But here is the thing, if the files from this sensor needs fixing, is this sensor even worth using? I’m genuinely curious! What is it about this sensor that makes it worth it?\n\nThe X-Trans sensor has very few GOOD aspects that a normal sensor doesn’t also have. Except 2 small things when compared to the X-T100 sensor. (Small for me at least). In the dark, high ISO shots look a less noisy (but even then the normal sensor shows fine detail and color definition better).  And X-Trans has less moiré patterns. But that is very rarely an issue for me.\n\nMaybe I have overlooked something, but right now I can’t think of any aspects of the X-Trans sensor that makes it worth it. At least not for me.\n\n**Here are the comparisons:**\n\nThese were shot with an X-T2 and an X-T100. I used a Laowa 65mm lens. Its fully manual, so that is why it says that the aperture is f1, but I shot all of these at f8. I used that lens because its very sharp and it has practically no chromatic aberrations.\n\nAlso, these are not very nice photos. I shot them only to highlight how the X-Trans sensor behaves. I did not want to take really nice shots and share those. Hope you understand.\n\n\\[The first comparison is a landscape. Look at how the X-Trans sensor looses the color in the grass and how the ground looks “wrong”. It’s a little hard to describe, but it does not look good. The trees dont look right either IMO\\]([https://i.imgur.com/5Jku4oH.jpeg](https://i.imgur.com/5Jku4oH.jpeg))\n\nHere are the RAF files:\n\n&amp;#x200B;\n\n[https://drive.google.com/file/d/1TaouEUmnoIOwshGcO9ZXgb8aTrHeP\\_7y/view?usp=sharing](https://drive.google.com/file/d/1TaouEUmnoIOwshGcO9ZXgb8aTrHeP_7y/view?usp=sharing)\n\n[https://drive.google.com/file/d/1zye5uuCE3vfLnIgOumCTyoN-DBgz8l\\_D/view?usp=sharing](https://drive.google.com/file/d/1zye5uuCE3vfLnIgOumCTyoN-DBgz8l_D/view?usp=sharing)\n\n\\[Here is the other one. Its just a picture of sand. But there are a lot of details in the sand and actually a lot of different colors. To me, this is a good example of how the X-Trans sensor looses color definition in small details\\]([https://i.imgur.com/PsLVkPF.jpeg](https://i.imgur.com/PsLVkPF.jpeg))\n\nThe raw files:\n\n&amp;#x200B;\n\n[https://drive.google.com/file/d/1ux5G\\_TyRVPJ565F\\_oqX6eU6LwOTjXMbn/view?usp=sharing](https://drive.google.com/file/d/1ux5G_TyRVPJ565F_oqX6eU6LwOTjXMbn/view?usp=sharing)\n\n[https://drive.google.com/file/d/19cL3h7T\\_Vk5a26OgoQCuk4oIroemEPvi/view?usp=sharing](https://drive.google.com/file/d/19cL3h7T_Vk5a26OgoQCuk4oIroemEPvi/view?usp=sharing)\n\nBTW, I know this is only a couple of examples, but I did not make this post ONLY because of these two comparisons. I’ve had this opinion (that X-Trans is worse than normal sensors) long before I shot these. I’ve been shooting with many different cameras over the years and the last 5 years have been with Fujifilm. So I have seen the effects of the X-Trans sensor for a while.\n\n&amp;#x200B;\n\nI’m not posting any of the other photos where X-Trans made them look bad only because I dont have a direct comparison with the X-T100 for them. **But if there is any interest in seeing single examples, I’ll see what I can do.** (Can’t guarantee anything ofc)\n\n&amp;#x200B;\n\n**EDIT:**\n\nHere are some more samples. This first one is NOT a great comparison, just to be clear. Its not great because it was shot on different days from slightly different angles and the light and weather was different. Only the subject and the lens is the same.\n\n[I shot the X-T2 photo because I liked how the tree stood out from the dark background. When I got home and saw how terrible it looks, I decided I NEED to get an X-T100 to compare. So the second photo was shot several days later. And just so you know, in the jpeg comparison I changed the white balance to make them look more similar. I'll include the RAWs so you can see for yourself](https://i.imgur.com/OEgqsGw.jpg)\n\n&amp;#x200B;\n\nRAW:\n\n[https://drive.google.com/file/d/174lzt4KxroGW7JeKlvNuN9SWaNeKA3iP/view?usp=sharing](https://drive.google.com/file/d/174lzt4KxroGW7JeKlvNuN9SWaNeKA3iP/view?usp=sharing)\n\n[https://drive.google.com/file/d/1-VyJSc5ZIjQkilhw35VffqGrjyAfrC4R/view?usp=sharing](https://drive.google.com/file/d/1-VyJSc5ZIjQkilhw35VffqGrjyAfrC4R/view?usp=sharing)\n\n.\n\n[Here is a single example of the \"X-Tran swirls\". I dont have an X-T100 comparison for this one](https://i.imgur.com/FujNLWz.jpg)\n\nRAW:\n\n[https://drive.google.com/file/d/1ffT7N44sTHeOWtOusZzPWA2vFQCYbVjP/view?usp=sharing](https://drive.google.com/file/d/1ffT7N44sTHeOWtOusZzPWA2vFQCYbVjP/view?usp=sharing])\n\n&amp;#x200B;\n\nIf I had my way, Fujifilm would make 2 versions of the X-T5. One with X-Trans (for those who wants that) and one with a normal sensor. I know that is not going to happen, but I can dream right =P\n\nBut a more realistic think I hope happens is that they make almost ANY camera with a normal sensor AND 2 memory card slots. I need 2 slots to feel safe. I have had cards fail before and its not fun.\n\nAm I the only one who feels like this?\n\nAm I wrong for feeling like this?\n\nIs the X-Trans sensor better than I think?\n\n&amp;#x200B;\n\nHave you compared any of the Fuji cameras with and without X-Trans? If yes, what is your experience?\n\n(English is not my native language, so I hope this was understandable)", "link": "https://www.reddit.com/r/fujifilm/comments/lrmsar/after_comparing_an_xt2_to_an_xt100_i_feel_like/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": "after comparing an x-t2 to an x-t100 i feel like fujifilm needs to move past the x-trans sensor. i'll try to explain why and i will include a couple of comparisons and the raf files. can we have a real discussion about this? /!/ first, -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  it clear that the x-trans sensor does not absolutely ruin any shots. and in some instances, its problems are not very visible at all. its mostly when shooting landscapes that it starts to become annoying.\n\n&amp;#x200b;\n\nsecond, **i am not here to make anyone feel bad for their choices in cameras!** this is mostly me venting a little bit. and i personally love my x-t2, i just dont love the sensor it has.\n\n&amp;#x200b;\n\nthird, all of this is based on mostly landscape photography and on selling prints. selling prints means i pixel peep to make sure things are sharp and in focus and to fix dead/hot pixels. i think that is valid.\n\n&amp;#x200b;\n\n**edit:** i should also mention that yes, the way lightroom handles x-trans files is terrible. and if they could get their shit together i would be really happy. maybe if they did that, some aspect of the x-trans sensor would make it stand out. or maybe it would just bring it up to the same quality as a normal sensor. but i would be happy if adobe fixed lr, just to be clear!\n\n**edit2:** the more i think about it, the more i blame lightroom. i might post these comparisons over on the lightroom subreddit.\n\n&amp;#x200b;\n\nthese are the two big problems with the x-trans sensor, in my opinion:\n\n&amp;#x200b;\n\n1. there are swirly artifacts that look ugly and needs to be fixed in small details in the image. like, if a tiny object has a different color to its surroundings, it looks desaturated and does not keep its color as well as it should.\n2. colors look washed out. meaning, there is less “color definition” in small details in the image. like, if a tiny object has a different color to its surroundings, it looks desaturated and does not keep its color as well as it should.\n\n&amp;#x200b;\n\neither i can fix these issues by using the enhance detail feature in lr. the problem with that is that it requires more clicks, more time, and more disk space. and if i want to delete those files afterwards, to save up disk space, it requires even more clicking and time. with thousands of photos over several years, that adds up, and it does not feel like a good solution to me.\n\nor i can fix them by using a different program to edit my raf files in. but that is something that is very hard for me to do because i make a lot of panoramas. and i have yet to find any other raw editor that lets me stitch raw files and that outputs a panorama with all the dynamic range of the raw files i stitched. for me, that is a killer feature.\n\nmaybe there are other ways of fixing these issues that i cant remember. but here is the thing, if the files from this sensor needs fixing, is this sensor even worth using? i’m genuinely curious! what is it about this sensor that makes it worth it?\n\nthe x-trans sensor has very few good aspects that a normal sensor doesn’t also have. except 2 small things when compared to the x-t100 sensor. (small for me at least). in the dark, high iso shots look a less noisy (but even then the normal sensor shows fine detail and color definition better).  and x-trans has less moiré patterns. but that is very rarely an issue for me.\n\nmaybe i have overlooked something, but right now i can’t think of any aspects of the x-trans sensor that makes it worth it. at least not for me.\n\n**here are the comparisons:**\n\nthese were shot with an x-t2 and an x-t100. i used a laowa 65mm lens. its fully manual, so that is why it says that the aperture is f1, but i shot all of these at f8. i used that lens because its very sharp and it has practically no chromatic aberrations.\n\nalso, these are not very nice photos. i shot them only to highlight how the x-trans sensor behaves. i did not want to take really nice shots and share those. hope you understand.\n\n\\[the first comparison is a landscape. look at how the x-trans sensor looses the color in the grass and how the ground looks “wrong”. it’s a little hard to describe, but it does not look good. the trees dont look right either imo\\]([https://i.imgur.com/5jku4oh.jpeg](https://i.imgur.com/5jku4oh.jpeg))\n\nhere are the raf files:\n\n&amp;#x200b;\n\n[https://drive.google.com/file/d/1taoueumnoiowshgco9zxgb8atrhep\\_7y/view?usp=sharing](https://drive.google.com/file/d/1taoueumnoiowshgco9zxgb8atrhep_7y/view?usp=sharing)\n\n[https://drive.google.com/file/d/1zye5uuce3vflnigoumctyon-dbgz8l\\_d/view?usp=sharing](https://drive.google.com/file/d/1zye5uuce3vflnigoumctyon-dbgz8l_d/view?usp=sharing)\n\n\\[here is the other one. its just a picture of sand. but there are a lot of details in the sand and actually a lot of different colors. to me, this is a good example of how the x-trans sensor looses color definition in small details\\]([https://i.imgur.com/pslvkpf.jpeg](https://i.imgur.com/pslvkpf.jpeg))\n\nthe raw files:\n\n&amp;#x200b;\n\n[https://drive.google.com/file/d/1ux5g\\_tyrvpj565f\\_oqx6eu6lwotjxmbn/view?usp=sharing](https://drive.google.com/file/d/1ux5g_tyrvpj565f_oqx6eu6lwotjxmbn/view?usp=sharing)\n\n[https://drive.google.com/file/d/19cl3h7t\\_vk5a26ogoqcuk4oiroemepvi/view?usp=sharing](https://drive.google.com/file/d/19cl3h7t_vk5a26ogoqcuk4oiroemepvi/view?usp=sharing)\n\nbtw, i know this is only a couple of examples, but i did not make this post only because of these two comparisons. i’ve had this opinion (that x-trans is worse than normal sensors) long before i shot these. i’ve been shooting with many different cameras over the years and the last 5 years have been with fujifilm. so i have seen the effects of the x-trans sensor for a while.\n\n&amp;#x200b;\n\ni’m not posting any of the other photos where x-trans made them look bad only because i dont have a direct comparison with the x-t100 for them. **but if there is any interest in seeing single examples, i’ll see what i can do.** (can’t guarantee anything ofc)\n\n&amp;#x200b;\n\n**edit:**\n\nhere are some more samples. this first one is not a great comparison, just to be clear. its not great because it was shot on different days from slightly different angles and the light and weather was different. only the subject and the lens is the same.\n\n[i shot the x-t2 photo because i liked how the tree stood out from the dark background. when i got home and saw how terrible it looks, i decided i need to get an x-t100 to compare. so the second photo was shot several days later. and just so you know, in the jpeg comparison i changed the white balance to make them look more similar. i'll include the raws so you can see for yourself](https://i.imgur.com/oegqsgw.jpg)\n\n&amp;#x200b;\n\nraw:\n\n[https://drive.google.com/file/d/174lzt4kxrogw7jeklvnun9swaneka3ip/view?usp=sharing](https://drive.google.com/file/d/174lzt4kxrogw7jeklvnun9swaneka3ip/view?usp=sharing)\n\n[https://drive.google.com/file/d/1-vyjsc5zijqkilhw35vffqgrjyafrc4r/view?usp=sharing](https://drive.google.com/file/d/1-vyjsc5zijqkilhw35vffqgrjyafrc4r/view?usp=sharing)\n\n.\n\n[here is a single example of the \"x-tran swirls\". i dont have an x-t100 comparison for this one](https://i.imgur.com/fujnlwz.jpg)\n\nraw:\n\n[https://drive.google.com/file/d/1fft7n44stheowtouszzpwa2vfqcybvjp/view?usp=sharing](https://drive.google.com/file/d/1fft7n44stheowtouszzpwa2vfqcybvjp/view?usp=sharing])\n\n&amp;#x200b;\n\nif i had my way, fujifilm would make 2 versions of the x-t5. one with x-trans (for those who wants that) and one with a normal sensor. i know that is not going to happen, but i can dream right =p\n\nbut a more realistic think i hope happens is that they make almost any camera with a normal sensor and 2 memory card slots. i need 2 slots to feel safe. i have had cards fail before and its not fun.\n\nam i the only one who feels like this?\n\nam i wrong for feeling like this?\n\nis the x-trans sensor better than i think?\n\n&amp;#x200b;\n\nhave you compared any of the fuji cameras with and without x-trans? if yes, what is your experience?\n\n(english is not my native language, so i hope this was understandable)", "sortedWord": "None", "Identifyer": null, "identifyer": 85483, "year": "2021"}, {"autor": "aidanlee56789", "date": "2021-02-24 19:31:21", "content": "How can I make my camera quieter? /!/ I am already using the electronic shutter, is there any way to make it even quieter for wildlife? I find the sound still irritates small animals and birds sometimes.", "link": "https://www.reddit.com/r/fujifilm/comments/lrl9hd/how_can_i_make_my_camera_quieter/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "how can -----> i !!!  -----> make !!!  my camera quieter? /!/ i am already using the electronic shutter, is there any way to make it even quieter for wildlife? i find the sound still irritates small animals and birds sometimes.", "sortedWord": "None", "Identifyer": null, "identifyer": 85490, "year": "2021"}, {"autor": "boddy_nock", "date": "2021-01-13 14:55:37", "content": "Finally Feel Like My Setup Is Almost Complete /!/ Hey All,\nI made the switch from Nikon to Fujifilm about 6 months ago and I absolutely love it. My lenses are below:\n\nBody: Fujifilm XT3 \nPrimes: 16mm F1.4, 35mm F1.4\nZooms: 18-55mm Kit Lens, 55-200mm\n\nDo you guys think I am pretty much set? What lenses would you recommend? I do mostly landscapes and cityscape shots.", "link": "https://www.reddit.com/r/fujifilm/comments/kwhzbk/finally_feel_like_my_setup_is_almost_complete/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "finally feel like my setup is almost complete /!/ hey all,\n-----> i !!!  -----> made !!!  the switch from nikon to fujifilm about 6 months ago and -----> i !!!  absolutely love it. my lenses are below:\n\nbody: fujifilm xt3 \nprimes: 16mm f1.4, 35mm f1.4\nzooms: 18-55mm kit lens, 55-200mm\n\ndo you guys think i am pretty much set? what lenses would you recommend? i do mostly landscapes and cityscape shots.", "sortedWord": "None", "Identifyer": null, "identifyer": 85570, "year": "2021"}, {"autor": "eiv69", "date": "2021-10-30 09:21:42", "content": "Face/eye detection on Fujifilm XH-1 /!/ The face/eye detection on my XH-1 is grayed out except the face on/eye off. How do I make them to work?", "link": "https://www.reddit.com/r/fujifilm/comments/qixuhg/faceeye_detection_on_fujifilm_xh1/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "face/eye detection on fujifilm xh-1 /!/ the face/eye detection on my xh-1 is grayed out except the face on/eye off. how do -----> i !!!  -----> make !!!  them to work?", "sortedWord": "None", "Identifyer": null, "identifyer": 85804, "year": "2021"}, {"autor": "Xumade", "date": "2021-09-07 07:00:16", "content": "Finally solved displaying the entire frame the Electronic Rangefinder Window in AP-S mode for the X100 and X-Pro cameras /!/ I've been trying to shoot more with my X100V in OVF mode since that was one of the major draws to buying this camera. Since I shoot mostly straight out of camera, I wanted to use the Electronic Range Finder Window (ERW) to check that I have the exposure set correctly. Adjusting exposure is one of the key elements to nailing the no-post-processing workflow. \n\nIn testing this process I discovered the ERW only displayed the full frame in AP-C mode. To my original annoyance, the ERW is fully zoomed into the focus point in AP-S mode. It's so zoomed in that I can't tell if the shadows are exposed to my liking. I originally thought this was by design to nail focus in OVF+ERW mode. \n\nThen tonight I discovered it's adjustable from randomly reading the comments of Youtube reviews of the X100V. I had to piece some parts together, but here's what you need to do:\n\n1.\tPick a button that you can adjust and set it to Focus Check in settings. I used the rear command dial press. \n2.\tLook through the viewfinder and make sure it's in OVF+ERW mode. \n3.\tPress the rear command dial to shuffle through the ERW zoom levels. \n\nNote there's 3 levels you can cycle through: \n1.\tSuper zoomed to the focus point\n2.\tZoomed to the rough size of the OVF focus box\n3.\tFully zoomed out\n\nI probably will use option 3 so once I set it I can change the rear command dial press back to another function. \n\nThis also works in manual mode which helps if you use focus highlighting.\n\nI know this isn't the breakthrough I'm making this out to be, but it's a pretty big deal in my workflow. Before discovering this I only used the EVF. I tried using AP-C but the focus point kept slightly shifting and I didn't like that I couldn't have full control of the focus. \n\nHope this helps someone who was struggling to find an answer like I did. Leave a comment if you have other related focusing tips.", "link": "https://www.reddit.com/r/fujifilm/comments/pjhvs2/finally_solved_displaying_the_entire_frame_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "finally solved displaying the entire frame the electronic rangefinder window in ap-s mode for the x100 and x-pro cameras /!/ i've been trying to shoot more with my x100v in ovf mode since that was one of the major draws to buying this camera. since i shoot mostly straight out of camera, i wanted to use the electronic range finder window (erw) to check that i have the exposure set correctly. adjusting exposure is one of the key elements to nailing the no-post-processing workflow. \n\nin testing this process i discovered the erw only displayed the full frame in ap-c mode. to my original annoyance, the erw is fully zoomed into the focus point in ap-s mode. it's so zoomed in that i can't tell if the shadows are exposed to my liking. i originally thought this was by design to nail focus in ovf+erw mode. \n\nthen tonight i discovered it's adjustable from randomly reading the comments of youtube reviews of the x100v. i had to piece some parts together, but here's what you need to do:\n\n1.\tpick a button that you can adjust and set it to focus check in settings. i used the rear command dial press. \n2.\tlook through the viewfinder and make sure it's in ovf+erw mode. \n3.\tpress the rear command dial to shuffle through the erw zoom levels. \n\nnote there's 3 levels you can cycle through: \n1.\tsuper zoomed to the focus point\n2.\tzoomed to the rough size of the ovf focus box\n3.\tfully zoomed out\n\ni probably will use option 3 so once i set it i can change the rear command dial press back to another function. \n\nthis also works in manual mode which helps if you use focus highlighting.\n\n-----> i !!!  know this isn't the breakthrough -----> i !!! 'm -----> making !!!  this out to be, but it's a pretty big deal in my workflow. before discovering this i only used the evf. i tried using ap-c but the focus point kept slightly shifting and i didn't like that i couldn't have full control of the focus. \n\nhope this helps someone who was struggling to find an answer like i did. leave a comment if you have other related focusing tips.", "sortedWord": "None", "Identifyer": null, "identifyer": 85915, "year": "2021"}, {"autor": "RoninCeroEspada", "date": "2021-09-07 01:21:24", "content": "Lens assistance /!/ Hello all! I just bought an X-T30 and I'm looking to make the most of it as a novice with:\n\n- Astrophotography (looking to capture the Milky Way, blurry stars in motion, etc)\n- Boudoir/Fashion (lowlight environments, lots of upclose shots, etc)\n- Landscape Photography (timelapse of sunrises and sunsets, wide shots with mountains and large bodies of water, etc)\n- Public Events (clubs, concerts, malls, sporting events, parties, etc)\n- Action Shots (supercars and motorcycles going over 100 mph, stuntwork and fight choreography, etc). \n\nIf I had to buy only two lenses for these duties, which two would be up for the task. Does one need to be a prime and another zoom necessarily? Or can both work in a pinch? Should I acquire a 1.4 over a 2.8? \n\nAny help would be amazing :) thank you all in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/pjcxzj/lens_assistance/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm looking to make", "selectorShort": "make", "MarkedSent": "lens assistance /!/ hello all! -----> i !!!  just bought an x-t30 and -----> i !!! 'm -----> looking !!!  -----> to !!!  -----> make !!!  the most of it as a novice with:\n\n- astrophotography (-----> looking !!!  -----> to !!!  capture the milky way, blurry stars in motion, etc)\n- boudoir/fashion (lowlight environments, lots of upclose shots, etc)\n- landscape photography (timelapse of sunrises and sunsets, wide shots with mountains and large bodies of water, etc)\n- public events (clubs, concerts, malls, sporting events, parties, etc)\n- action shots (supercars and motorcycles going over 100 mph, stuntwork and fight choreography, etc). \n\nif i had to buy only two lenses for these duties, which two would be up for the task. does one need to be a prime and another zoom necessarily? or can both work in a pinch? should i acquire a 1.4 over a 2.8? \n\nany help would be amazing :) thank you all in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 85943, "year": "2021"}, {"autor": "Monkeyguy88", "date": "2021-09-13 13:56:38", "content": "Couple pins I made of the original 1934 logo. X-t3 laowa 65mm macro", "link": "https://www.reddit.com/r/fujifilm/comments/pnfybs/couple_pins_i_made_of_the_original_1934_logo_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "couple pins -----> i !!!  -----> made !!!  of the original 1934 logo. x-t3 laowa 65mm macro", "sortedWord": "None", "Identifyer": null, "identifyer": 86119, "year": "2021"}, {"autor": "YashenTheVeganZombie", "date": "2021-09-27 22:18:46", "content": "Wanted a viewfinder for my xf10 so I made an adapter.", "link": "https://www.reddit.com/r/fujifilm/comments/pws27w/wanted_a_viewfinder_for_my_xf10_so_i_made_an/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "wanted a viewfinder for my xf10 so -----> i !!!  -----> made !!!  an adapter.", "sortedWord": "None", "Identifyer": null, "identifyer": 86311, "year": "2021"}, {"autor": "AlyFrogman", "date": "2021-09-27 02:25:16", "content": "I want to share the images I made on my Industar-69 remade to a monolense (X-T10)", "link": "https://www.reddit.com/r/fujifilm/comments/pw7t4u/i_want_to_share_the_images_i_made_on_my/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  want to share the images -----> i !!!  -----> made !!!  on my industar-69 remade to a monolense (x-t10)", "sortedWord": "None", "Identifyer": null, "identifyer": 86362, "year": "2021"}, {"autor": "MaleficusAD", "date": "2021-08-20 20:51:02", "content": "Lens Purchase Opinions /!/ Hey all. My current lineup of lenses is the 35mm f2, 23mm f2, and the 16-80 f4 zoom. Im debating making a few changes to this lineup and would love opinions. Im debating selling the 23mm and purchasing the 16mm f2.8. Is having the 23mm and 35mm too close in FL? I do enjoy the 16mm for landscapes, but my 16-80 does that. How does the 16 2.8 compare to the 23 f2? I generally take the 16-80 as my travel lens, and one of the other two when I want to be more discreet or know what I want to photograph.\n\nI was also thinking of replacing my 35mm f2 with the f1.4 version. I hear everyone talk about the \"magic\" of that lens. Would that be a good replacement as well? I can get one for $450 like new. I would take one of the other two lenses when weather conditions are a worry. How's the build quality on the 1.4?\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/p8dpbx/lens_purchase_opinions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "im debating making", "selectorShort": "make", "MarkedSent": "lens purchase opinions /!/ hey all. my current lineup of lenses is the 35mm f2, 23mm f2, and the 16-80 f4 zoom. -----> i !!! -----> m !!!  -----> debating !!!  -----> making !!!  a few changes to this lineup and would love opinions. im debating selling the 23mm and purchasing the 16mm f2.8. is having the 23mm and 35mm too close in fl? i do enjoy the 16mm for landscapes, but my 16-80 does that. how does the 16 2.8 compare to the 23 f2? i generally take the 16-80 as my travel lens, and one of the other two when i want to be more discreet or know what i want to photograph.\n\ni was also thinking of replacing my 35mm f2 with the f1.4 version. i hear everyone talk about the \"magic\" of that lens. would that be a good replacement as well? i can get one for $450 like new. i would take one of the other two lenses when weather conditions are a worry. how's the build quality on the 1.4?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 86663, "year": "2021"}, {"autor": "2milelanding", "date": "2021-08-26 17:26:04", "content": "Fuji XF10 DOF preview? /!/ Hello! I own both a fuji xf10 and a fuji x-e4 with the new 27mm pancake and a 35mm f/2. On my x-e4 I shoot fully manual so that there is less for the camera to process. While shooting in manual it is normal for the lenses to keep the aperture I set it as and show me the accurate DOF preview meaning there is no lag between holding the shutter button down and having the aperture chatter into place. On my xf10 however, there is no DOF preview in manual mode. You can assign a function button to make it preview however it does not lock into place I have to press it every time I want to take a photo. Is there any way that I am missing to make DOF preview a permanent setting on the xf10? It is so frustrating that it keeps opening the aperture up and then stopping it down once I press on the shutter as it creates a buffer time before taking a photo. Any help is appreciated", "link": "https://www.reddit.com/r/fujifilm/comments/pc47et/fuji_xf10_dof_preview/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i am missing to make", "selectorShort": "make", "MarkedSent": "fuji xf10 dof preview? /!/ hello! i own both a fuji xf10 and a fuji x-e4 with the new 27mm pancake and a 35mm f/2. on my x-e4 i shoot fully manual so that there is less for the camera to process. while shooting in manual it is normal for the lenses to keep the aperture i set it as and show me the accurate dof preview meaning there is no lag between holding the shutter button down and having the aperture chatter into place. on my xf10 however, there is no dof preview in manual mode. you can assign a function button to make it preview however it does not lock into place i have to press it every time i want to take a photo. is there any way that -----> i !!!  -----> am !!!  -----> missing !!!  -----> to !!!  -----> make !!!  dof preview a permanent setting on the xf10? it is so frustrating that it keeps opening the aperture up and then stopping it down once i press on the shutter as it creates a buffer time before taking a photo. any help is appreciated", "sortedWord": "None", "Identifyer": null, "identifyer": 86771, "year": "2021"}, {"autor": "cornfed85", "date": "2021-06-20 16:46:13", "content": "Manual Focus X-S10 /!/ Greetings! After several years of photographing on premium camera phones (Pixel 3XL Samsung S21+) I made the leap to my first real camera with a X-S10. It came with a kit lens F2.8-4 18/55 and I am enjoying it so far albeit mostly in auto mode. I tend to shoot in the blue hour quite often and the auto focus struggles. Switching to a manual setting I am decent enough to set my exposure settings, but my pictures are all coming out slightly to full on blurry. I've tried reading the user manual and watching tutorials, but the manual focus aides included in the camera just aren't working for me. Obviously I'm doing something wrong, just don't know what or how to improve. Any suggestions? Thank you", "link": "https://www.reddit.com/r/fujifilm/comments/o49pmr/manual_focus_xs10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "manual focus x-s10 /!/ greetings! after several years of photographing on premium camera phones (pixel 3xl samsung s21+) -----> i !!!  -----> made !!!  the leap to my first real camera with a x-s10. it came with a kit lens f2.8-4 18/55 and i am enjoying it so far albeit mostly in auto mode. i tend to shoot in the blue hour quite often and the auto focus struggles. switching to a manual setting i am decent enough to set my exposure settings, but my pictures are all coming out slightly to full on blurry. i've tried reading the user manual and watching tutorials, but the manual focus aides included in the camera just aren't working for me. obviously i'm doing something wrong, just don't know what or how to improve. any suggestions? thank you", "sortedWord": "None", "Identifyer": null, "identifyer": 86998, "year": "2021"}, {"autor": "tahoos16", "date": "2021-07-27 22:06:19", "content": "XT-4 changing shutter speeds while shooting bursts? /!/ I’m a professional photographer and videographer who has just recently made the switch from Canon to Fuji (tho I’ve had an X100F as a personal camera for a few years, so I have some experience shooting on the Fuji systems).\n\nI am currently editing my first professional  shoot with the XT-4 and I’ve started to notice a weird phenomenon: every group of three photos (all nearly the same pose, shot in burst) have a different shutter speed and thus exposed slightly different. The first one in the burst is 1/250, then 1/200, then 1/320th. \n\nDoes anyone know why this might be happening? As far as I know, I didn’t have any settings on to make it shoot like this. Since I’m familiar with the X100F, I prefer to use the control dials only when shooting and manually change exposure. I thought perhaps at first I had put it in an hdr mode that took the same photo at three different exposures, but that doesn’t seem to be right because the  background seems to shift slightly between the set of three photos. \n\nAnyone who has any idea/advice about what I’m doing to make this happen would be super helpful, as I’m still trying to learn the system. \n\nThanks.", "link": "https://www.reddit.com/r/fujifilm/comments/oswdq9/xt4_changing_shutter_speeds_while_shooting_bursts/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’m doing to make", "selectorShort": "make", "MarkedSent": "xt-4 changing shutter speeds while shooting bursts? /!/ i’m a professional photographer and videographer who has just recently made the switch from canon to fuji (tho i’ve had an x100f as a personal camera for a few years, so i have some experience shooting on the fuji systems).\n\ni am currently editing my first professional  shoot with the xt-4 and i’ve started to notice a weird phenomenon: every group of three photos (all nearly the same pose, shot in burst) have a different shutter speed and thus exposed slightly different. the first one in the burst is 1/250, then 1/200, then 1/320th. \n\ndoes anyone know why this might be happening? as far as i know, i didn’t have any settings on to make it shoot like this. since i’m familiar with the x100f, i prefer to use the control dials only when shooting and manually change exposure. i thought perhaps at first i had put it in an hdr mode that took the same photo at three different exposures, but that doesn’t seem to be right because the  background seems to shift slightly between the set of three photos. \n\nanyone who has any idea/advice about what -----> i !!! ’m -----> doing !!!  -----> to !!!  -----> make !!!  this happen would be super helpful, as -----> i !!! ’m still trying -----> to !!!  learn the system. \n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 87267, "year": "2021"}, {"autor": "fordprefect48", "date": "2021-07-22 16:58:59", "content": "Question about viewfinder preview and result shot being different after it was taken. (XT-30 with XF27mmF2.8 R WR) /!/ I have been enjoying my XT-30 as my first camera with the XF18-55 lens kit for a while, however the other day I was with another Fujifilm X user friend who owns some more lens and I decided to try the XF27mmF2.8. \n\nWe were shooting at night and when I thought I was getting great pictures, I check them on playback the result shots were different than what I saw in the viewfinder. The resulting shots were all underexposed / darker with a significant difference than the viewfinder. \n\nI made sure exposure compensation was at 0 and was using Single shot mode. One weird thing is that the viewfinder doesn't really change when I mess around with the shutter speed and ISO dials, however the resulting shots do change according to the adjustments, so I think it's the viewfinder that's not previewing true to the settings. My friend has no idea how that happened and googling some questions and keywords didn't come up with a result. When I switched back to my kit lens the problem was solved. \n\nI really want to buy the pancake lens since its so nice and light with the XT-30 but I want to make sure I understand what caused this problem first before buying my first prime lens! So does anyone ever have a problem like this? or am I missing a part of a setting while changing to prime lenses? Thank you in advance.", "link": "https://www.reddit.com/r/fujifilm/comments/opi18x/question_about_viewfinder_preview_and_result_shot/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "question about viewfinder preview and result shot being different after it was taken. (xt-30 with xf27mmf2.8 r wr) /!/ i have been enjoying my xt-30 as my first camera with the xf18-55 lens kit for a while, however the other day i was with another fujifilm x user friend who owns some more lens and i decided to try the xf27mmf2.8. \n\nwe were shooting at night and when i thought i was getting great pictures, i check them on playback the result shots were different than what i saw in the viewfinder. the resulting shots were all underexposed / darker with a significant difference than the viewfinder. \n\n-----> i !!!  -----> made !!!  sure exposure compensation was at 0 and was using single shot mode. one weird thing is that the viewfinder doesn't really change when i mess around with the shutter speed and iso dials, however the resulting shots do change according to the adjustments, so i think it's the viewfinder that's not previewing true to the settings. my friend has no idea how that happened and googling some questions and keywords didn't come up with a result. when i switched back to my kit lens the problem was solved. \n\ni really want to buy the pancake lens since its so nice and light with the xt-30 but i want to make sure i understand what caused this problem first before buying my first prime lens! so does anyone ever have a problem like this? or am i missing a part of a setting while changing to prime lenses? thank you in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 87315, "year": "2021"}, {"autor": "MeaningfulThoughts", "date": "2021-07-22 15:17:01", "content": "GFX100s owners: do you recommend it? /!/ Currently considering switching from my Leica SL2, for the increase in megapixels, from 47 to 102. I intend to make rather large, gallery-quality prints.\n\nWould you know if there is an sound zoom lens for it as well? The Vario-Elmarit SL 24–90mm f2.8–4 ASPH I use is a great multipurpose lens that’s served me well. I’d love to find a similarity sharp, quality lens if it exists.\n\nThank you!", "link": "https://www.reddit.com/r/fujifilm/comments/opfw7p/gfx100s_owners_do_you_recommend_it/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i intend to make", "selectorShort": "make", "MarkedSent": "gfx100s owners: do you recommend it? /!/ currently considering switching from my leica sl2, for the increase in megapixels, from 47 to 102. -----> i !!!  -----> intend !!!  -----> to !!!  -----> make !!!  rather large, gallery-quality prints.\n\nwould you know if there is an sound zoom lens for it as well? the vario-elmarit sl 24–90mm f2.8–4 asph i use is a great multipurpose lens that’s served me well. i’d love to find a similarity sharp, quality lens if it exists.\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 87324, "year": "2021"}, {"autor": "TAZ2532", "date": "2021-04-07 05:30:51", "content": "X-T3 or X-T30, I am very New /!/ Hello,\n\nSo I really have been wanting to get into photography and when looking for cameras, Fujifilm REALLY caught my eye. \n\nFor Christmas my mom basically gave me $500 to use  to go towards my camera and I still haven’t decided which one yet. Since I want this camera to last quite some time I want to make sure it’s a good quality camera that I will love and cherish. Right now I am stuck between the X-T30 and X-T3. I am leaning more towards the 3 because it looks bigger, has weather seal, physical ISO dial, more rugged (in case it happens to fall?). I’d really like to do some street and hiking(landscape) photography.\n\n  I’m thinking of getting whichever on Amazon and paying it off with no interest over some months but I want to make sure I am making the right purchase. Are these cameras worth nearly $2K?\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/mlv5fh/xt3_or_xt30_i_am_very_new/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "x-t3 or x-t30, i am very new /!/ hello,\n\nso i really have been wanting to get into photography and when looking for cameras, fujifilm really caught my eye. \n\nfor christmas my mom basically gave me $500 to use  to go towards my camera and i still haven’t decided which one yet. since -----> i !!!  -----> want !!!  this camera -----> to !!!  last quite some time -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure it’s a good quality camera that -----> i !!!  will love and cherish. right now i am stuck between the x-t30 and x-t3. i am leaning more towards the 3 because it looks bigger, has weather seal, physical iso dial, more rugged (in case it happens to fall?). i’d really like to do some street and hiking(landscape) photography.\n\n  i’m thinking of getting whichever on amazon and paying it off with no interest over some months but i want to make sure i am making the right purchase. are these cameras worth nearly $2k?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 87466, "year": "2021"}, {"autor": "JVLfilms", "date": "2021-04-06 21:45:50", "content": "X-S10 with IBIS issue /!/ Hello everyone! I made a post about this a few weeks ago in this group but I couldn't really find an answer. This is my X-S10 with the Viltrox 33mm F/1.4 in video (4K/f1.4/30fps/200) and I'm getting this weird issue with IBIS where there's noticeable warping in the frame (you can see on the left hand side)\n\nIt looks almost as if there's a digital stabilizer being applied but I can assure you, there is no DIS selected in my options menu. I've been sure to check this 50x to confirm. My 23mm Viltrox has a similar issue so I hope there's nothing wrong with my X-S10 body but I can't seem to replicate it otherwise.\n\nAny ideas on how to proceed?\n\n&amp;#x200B;\n\n*Processing video 2x94u57himr61...*", "link": "https://www.reddit.com/r/fujifilm/comments/mlmnry/xs10_with_ibis_issue/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "x-s10 with ibis issue /!/ hello everyone! -----> i !!!  -----> made !!!  a post about this a few weeks ago in this group but -----> i !!!  couldn't really find an answer. this is my x-s10 with the viltrox 33mm f/1.4 in video (4k/f1.4/30fps/200) and i'm getting this weird issue with ibis where there's noticeable warping in the frame (you can see on the left hand side)\n\nit looks almost as if there's a digital stabilizer being applied but i can assure you, there is no dis selected in my options menu. i've been sure to check this 50x to confirm. my 23mm viltrox has a similar issue so i hope there's nothing wrong with my x-s10 body but i can't seem to replicate it otherwise.\n\nany ideas on how to proceed?\n\n&amp;#x200b;\n\n*processing video 2x94u57himr61...*", "sortedWord": "None", "Identifyer": null, "identifyer": 87488, "year": "2021"}, {"autor": "modularblur", "date": "2021-06-28 10:26:41", "content": "Macro photography on a Fujifilm X100V /!/ Hello!\n\n&amp;#x200B;\n\nI'm about to buy a X100V and even though this camera is clearly not meant for macro photography, I do want to make some macro shoots with it. \n\n&amp;#x200B;\n\nI've read about using Raynox lenses and I was wondering if these are compatible with the X100V. Also, what other options do I have to be able to macro shoot with this camera?\n\n&amp;#x200B;\n\nThank you!", "link": "https://www.reddit.com/r/fujifilm/comments/o9hi8a/macro_photography_on_a_fujifilm_x100v/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i do want to make", "selectorShort": "make", "MarkedSent": "macro photography on a fujifilm x100v /!/ hello!\n\n&amp;#x200b;\n\n-----> i !!! 'm about -----> to !!!  buy a x100v and even though this camera is clearly not meant for macro photography, -----> i !!!  -----> do !!!  -----> want !!!  -----> to !!!  -----> make !!!  some macro shoots with it. \n\n&amp;#x200b;\n\ni've read about using raynox lenses and i was wondering if these are compatible with the x100v. also, what other options do i have to be able to macro shoot with this camera?\n\n&amp;#x200b;\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 87528, "year": "2021"}, {"autor": "tullyscurry", "date": "2021-06-28 09:53:50", "content": "Film Simulations in RAF look different to the shot JPG? /!/ Hi All,\n\nFirstly, thanks for taking the time to look at my question.\n\nFujifilm noob here and I'm hoping for some sage advice from those smarter than me! \n\nI currently have an X-T4 with an assortment of lenses. I shot the below image at 50mm 2.8 with a 50-140mm using a custom film simulation recipe (Specifically called KodaChrome which changes some things todo with the white balance against the traditional Classic Chrome film sim).\n\nI like to edit my photos in lightroom/Capture one, but after I open the RAF file in lightroom (same in capture one), apply the Chrome film sim through \"Profile\" I get this version of the RAF...it looks a lot different to the JPG. (left is JPG, Right is RAF). Additionally, When i first boot the raf photo in windows photos it looks exactly like the jpg for a split second before the colours go all strange.\n\nPhoto on left is JPG with the fujifilm sim recipe and the one on the right in the RAF file.\n\nhttps://preview.redd.it/so641gu3bz771.jpg?width=3375&amp;format=pjpg&amp;auto=webp&amp;s=60807e64e18db490007b739596dc8d6563cda741\n\nAm I doing something wrong here? I can't for the life of me figure out how to get it to look how I shot so i can begin fiddling with it a bit more. I'm guessing this is todo with the fact a RAF file outlines the shooting conditions, but not the specifics of changes i have made to the chrome profile?\n\nIs there anyway I can resolve this or am I just better off shooting in the stock film simulations and then just editing them in LR to get the same effect?", "link": "https://www.reddit.com/r/fujifilm/comments/o9h2py/film_simulations_in_raf_look_different_to_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "film simulations in raf look different to the shot jpg? /!/ hi all,\n\nfirstly, thanks for taking the time to look at my question.\n\nfujifilm noob here and i'm hoping for some sage advice from those smarter than me! \n\ni currently have an x-t4 with an assortment of lenses. i shot the below image at 50mm 2.8 with a 50-140mm using a custom film simulation recipe (specifically called kodachrome which changes some things todo with the white balance against the traditional classic chrome film sim).\n\ni like to edit my photos in lightroom/capture one, but after i open the raf file in lightroom (same in capture one), apply the chrome film sim through \"profile\" i get this version of the raf...it looks a lot different to the jpg. (left is jpg, right is raf). additionally, when i first boot the raf photo in windows photos it looks exactly like the jpg for a split second before the colours go all strange.\n\nphoto on left is jpg with the fujifilm sim recipe and the one on the right in the raf file.\n\nhttps://preview.redd.it/so641gu3bz771.jpg?width=3375&amp;format=pjpg&amp;auto=webp&amp;s=60807e64e18db490007b739596dc8d6563cda741\n\nam i doing something wrong here? i can't for the life of me figure out how to get it to look how i shot so i can begin fiddling with it a bit more. -----> i !!! 'm guessing this is todo with the fact a raf file outlines the shooting conditions, but not the specifics of changes -----> i !!!  -----> have !!!  -----> made !!!  to the chrome profile?\n\nis there anyway i can resolve this or am i just better off shooting in the stock film simulations and then just editing them in lr to get the same effect?", "sortedWord": "None", "Identifyer": null, "identifyer": 87529, "year": "2021"}, {"autor": "bmason8", "date": "2021-04-22 03:02:23", "content": "I made an app for Fujifilm photographers (create/save your own jpg recipes) /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/mvvxa3/i_made_an_app_for_fujifilm_photographers/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  an app for fujifilm photographers (create/save your own jpg recipes) /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 87726, "year": "2021"}, {"autor": "jellyman98", "date": "2021-03-04 19:22:29", "content": "Fuji X-T3 PD Power Bank question /!/ Hey y'all, Im trying to figure out a long-running power solution for my X-T3. I was going to use an old v mount but I want to make the setup small enough for travel. I saw you can use the Anker PowerCore Speed 26800 PD to power the camera but do other brands besides Anker work? I was looking at the RavPower PD Pioneer 20100 too. \n\nRavPower\n\n[https://www.bhphotovideo.com/c/product/1522344-REG/ravpower\\_rp\\_pb095\\_power\\_bank\\_20100mah\\_pd.html](https://www.bhphotovideo.com/c/product/1522344-REG/ravpower_rp_pb095_power_bank_20100mah_pd.html)\n\nAnker\n\n[https://www.amazon.com/Anker-Charger-PowerCore-Portable-Delivery/dp/B07XRJZXKY/ref=sr\\_1\\_4?dchild=1&amp;keywords=anker+power+PD&amp;qid=1614885701&amp;sr=8-4](https://www.amazon.com/Anker-Charger-PowerCore-Portable-Delivery/dp/B07XRJZXKY/ref=sr_1_4?dchild=1&amp;keywords=anker+power+PD&amp;qid=1614885701&amp;sr=8-4)\n\n&amp;#x200B;\n\nThanks in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/lxsty7/fuji_xt3_pd_power_bank_question/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "fuji x-t3 pd power bank question /!/ hey y'all, im trying to figure out a long-running power solution for my x-t3. -----> i !!!  was going -----> to !!!  use an old v mount but -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  the setup small enough for travel. i saw you can use the anker powercore speed 26800 pd to power the camera but do other brands besides anker work? i was looking at the ravpower pd pioneer 20100 too. \n\nravpower\n\n[https://www.bhphotovideo.com/c/product/1522344-reg/ravpower\\_rp\\_pb095\\_power\\_bank\\_20100mah\\_pd.html](https://www.bhphotovideo.com/c/product/1522344-reg/ravpower_rp_pb095_power_bank_20100mah_pd.html)\n\nanker\n\n[https://www.amazon.com/anker-charger-powercore-portable-delivery/dp/b07xrjzxky/ref=sr\\_1\\_4?dchild=1&amp;keywords=anker+power+pd&amp;qid=1614885701&amp;sr=8-4](https://www.amazon.com/anker-charger-powercore-portable-delivery/dp/b07xrjzxky/ref=sr_1_4?dchild=1&amp;keywords=anker+power+pd&amp;qid=1614885701&amp;sr=8-4)\n\n&amp;#x200b;\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 88079, "year": "2021"}, {"autor": "Mr_Kinton", "date": "2021-05-27 22:32:43", "content": "Just committed to switching to the Fujifilm system /!/ I found an XT-3 on sale for US$1,200 before tax and just pulled the trigger on it. I've been considering switching to Fuji from my Canon APS-C system which I've never really loved, though it has been a reliable setup for me for a long time. But I decided to invest in a new direction, and was sold on Fuji after a bit of research and debate between sticking with APS-C or going full frame, staying with Canon or moving elsewhere. \n\n&amp;#x200B;\n\nUltimately I decided I wanted to start fresh with mirrorless, a new system, body, and lenses. I'm happy to invest a bit of cash into it, as I've only ever cut corners in the past and don't want to settle as I make a new, more aggressive push in my professional ambitions. But I didn't feel it was worth the price to go with some of the beefier options from Canon, and I found Sony to be cumbersome to use. \n\n&amp;#x200B;\n\nAnyway, $1200 for a new XT-3 felt like a good deal to me. I wanted something near the top of Fuji's lineup (again, no compromises this time) but decided that I'm not going to become such a prolific videographer that I need an XT-4 at this time. The savings will go towards a range of lenses and a battery grip.\n\n&amp;#x200B;\n\nMy interests are portraiture and street photography, with a goal to eventually shoot commercial/editorial. I've been looking at Fuji's 23mm and 56mm primes, but I'm wondering which are the most bang-for-your-buck and whether I should also invest in a versatile zoom? (not telephoto, just something in the 24-105mm kind of range). Any additional advice would be greatly appreciated. I'm excited to join the community and look forward to sharing my experiences once I get everything up and running.", "link": "https://www.reddit.com/r/fujifilm/comments/nmjgy8/just_committed_to_switching_to_the_fujifilm_system/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "just committed to switching to the fujifilm system /!/ i found an xt-3 on sale for us$1,200 before tax and just pulled the trigger on it. i've been considering switching to fuji from my canon aps-c system which i've never really loved, though it has been a reliable setup for me for a long time. but i decided to invest in a new direction, and was sold on fuji after a bit of research and debate between sticking with aps-c or going full frame, staying with canon or moving elsewhere. \n\n&amp;#x200b;\n\nultimately i decided i wanted to start fresh with mirrorless, a new system, body, and lenses. -----> i !!! 'm happy to invest a bit of cash into it, as -----> i !!! 've only ever cut corners in the past and don't want to settle as -----> i !!!  -----> make !!!  a new, more aggressive push in my professional ambitions. but i didn't feel it was worth the price to go with some of the beefier options from canon, and i found sony to be cumbersome to use. \n\n&amp;#x200b;\n\nanyway, $1200 for a new xt-3 felt like a good deal to me. i wanted something near the top of fuji's lineup (again, no compromises this time) but decided that i'm not going to become such a prolific videographer that i need an xt-4 at this time. the savings will go towards a range of lenses and a battery grip.\n\n&amp;#x200b;\n\nmy interests are portraiture and street photography, with a goal to eventually shoot commercial/editorial. i've been looking at fuji's 23mm and 56mm primes, but i'm wondering which are the most bang-for-your-buck and whether i should also invest in a versatile zoom? (not telephoto, just something in the 24-105mm kind of range). any additional advice would be greatly appreciated. i'm excited to join the community and look forward to sharing my experiences once i get everything up and running.", "sortedWord": "None", "Identifyer": null, "identifyer": 88163, "year": "2021"}, {"autor": "pesum41", "date": "2021-05-21 09:11:40", "content": "Purchase dilemma /!/ Hi everyone. I want to buy a small camera to bring everywhere with me. After spending months reviewing basically all fujifilm models (xt30, x100 series, xpro and xe) I thought I could settle with x-e4 (i like the rangefinder style and would want an ILC as primary camera).\n\nNow that I could make the purchase, I am having second thoughts: maybe is it too much for me to spend 1100€ altogether? I mean I can buy it, but thinking I could have buyer remorse.\n\nSo maybe an x-e3 or x-2/x-2s could be better for me? Learn with previous models and then progress?\n\nMoney is not really a problem, but I was thinking that it could be wiser to learn and enjoy with previous iterations (which are kinda cheap) and then upgrade when newest models enter the market (if i need to). I like the idea to not being slave to GAS, but I wouldn't want either to regret buying old models and thinking a newer one could get the job done.\n\nI like x-2 form and buttons (I could buy some vintage lenses as well). Is it too big compared to x-e3/x-e4? With autofocus lenses is it good enough? I just shoot for travels and hobby, nothing fancy.", "link": "https://www.reddit.com/r/fujifilm/comments/nho57e/purchase_dilemma/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "purchase dilemma /!/ hi everyone. i want to buy a small camera to bring everywhere with me. after spending months reviewing basically all fujifilm models (xt30, x100 series, xpro and xe) i thought i could settle with x-e4 (i like the rangefinder style and would want an ilc as primary camera).\n\nnow that -----> i !!!  -----> could !!!  -----> make !!!  the purchase, -----> i !!!  am having second thoughts: maybe is it too much for me to spend 1100€ altogether? i mean i can buy it, but thinking i could have buyer remorse.\n\nso maybe an x-e3 or x-2/x-2s could be better for me? learn with previous models and then progress?\n\nmoney is not really a problem, but i was thinking that it could be wiser to learn and enjoy with previous iterations (which are kinda cheap) and then upgrade when newest models enter the market (if i need to). i like the idea to not being slave to gas, but i wouldn't want either to regret buying old models and thinking a newer one could get the job done.\n\ni like x-2 form and buttons (i could buy some vintage lenses as well). is it too big compared to x-e3/x-e4? with autofocus lenses is it good enough? i just shoot for travels and hobby, nothing fancy.", "sortedWord": "None", "Identifyer": null, "identifyer": 88774, "year": "2021"}, {"autor": "Depth-Sea", "date": "2021-01-06 01:22:27", "content": "Looking for recommendations for a lens for X-A10. /!/ I have the default 16-50 XC lens. How do I make this camera to take better shots?", "link": "https://www.reddit.com/r/fujifilm/comments/krcyi2/looking_for_recommendations_for_a_lens_for_xa10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "looking for recommendations for a lens for x-a10. /!/ i have the default 16-50 xc lens. how do -----> i !!!  -----> make !!!  this camera to take better shots?", "sortedWord": "None", "Identifyer": null, "identifyer": 88825, "year": "2021"}, {"autor": "marigoldandpatchwork", "date": "2021-01-12 11:24:09", "content": "35mm lens owners, what is your other go-to prime? /!/ I recently made the switch from Canon to an X-T3. The 35mm F2 prime was the obvious choice for my first lens as I loved the FF 50mm FOV and wanted a small, light prime. At some stage I’d like a wider prime for landscapes and indoor shots. The 23mm F2 is excellent but it is a little too similar to the 35mm and never quite as wide as I want. \n\nI’ve been looking at a few relatively inexpensive options. The 16mm F1.4 seems to be universally loved but it’s more than I’d like to spend. I’ve read good things about the Rokinon 12mm F2 and the Fuji 14mm F2. Does anyone have other suggestions? TIA.", "link": "https://www.reddit.com/r/fujifilm/comments/kvpw91/35mm_lens_owners_what_is_your_other_goto_prime/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i recently made", "selectorShort": "make", "MarkedSent": "35mm lens owners, what is your other go-to prime? /!/ -----> i !!!  -----> recently !!!  -----> made !!!  the switch from canon to an x-t3. the 35mm f2 prime was the obvious choice for my first lens as i loved the ff 50mm fov and wanted a small, light prime. at some stage i’d like a wider prime for landscapes and indoor shots. the 23mm f2 is excellent but it is a little too similar to the 35mm and never quite as wide as i want. \n\ni’ve been looking at a few relatively inexpensive options. the 16mm f1.4 seems to be universally loved but it’s more than i’d like to spend. i’ve read good things about the rokinon 12mm f2 and the fuji 14mm f2. does anyone have other suggestions? tia.", "sortedWord": "None", "Identifyer": null, "identifyer": 88917, "year": "2021"}, {"autor": "Skukkix23", "date": "2021-10-13 14:57:08", "content": "I made a comparison of all my lenses, including standard lenses like the Fuji 27mm and 18mm or the Canon 50mm f1.8, or fast lenses like the expensive Handevision 40mm f0.85 or the lesser known Kaxinda 25mm f0.95. Upload still needs a bit for the full packages: tiny.cc/LensComp", "link": "https://www.reddit.com/r/fujifilm/comments/q7cybf/i_made_a_comparison_of_all_my_lenses_including/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a comparison of all my lenses, including standard lenses like the fuji 27mm and 18mm or the canon 50mm f1.8, or fast lenses like the expensive handevision 40mm f0.85 or the lesser known kaxinda 25mm f0.95. upload still needs a bit for the full packages: tiny.cc/lenscomp", "sortedWord": "None", "Identifyer": null, "identifyer": 89361, "year": "2021"}, {"autor": "35mm-dreams-", "date": "2021-02-11 14:35:57", "content": "I had made a fair amount of pictures today in black and white. When I stumbled upon a riot of colour. This image is one of many made at sunset. Another frame shows a car with its headlights on moving towards me. And yes. I worked the scene till it was completely dark. XT3. 35mm F2", "link": "https://www.reddit.com/r/fujifilm/comments/lhlx6v/i_had_made_a_fair_amount_of_pictures_today_in/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i had made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> had !!!  -----> made !!!  a fair amount of pictures today in black and white. when i stumbled upon a riot of colour. this image is one of many made at sunset. another frame shows a car with its headlights on moving towards me. and yes. i worked the scene till it was completely dark. xt3. 35mm f2", "sortedWord": "None", "Identifyer": null, "identifyer": 89716, "year": "2021"}, {"autor": "NoxiousChilli", "date": "2021-02-10 18:27:17", "content": "X-T20 or X-T30? /!/ I currently use an Olympus OM-D E-M10 Mark II, but I am looking at moving over to Fujifilm due to the retro feel. I also love the colour tones produced by Fuji cameras, and am interested using the platform to bring out my creative side. \n\nI’ve had my eye on the X-T30, but many reviews I’ve made comparisons to the X-T20. My question is for those that have used one or both of these cameras, is it worth investing in the X-T30, or saving some money and going for the X-T20? \n\nTDLR: Is it worth investing in the X-T30 or X-T20?", "link": "https://www.reddit.com/r/fujifilm/comments/lh04m2/xt20_or_xt30/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve made", "selectorShort": "make", "MarkedSent": "x-t20 or x-t30? /!/ i currently use an olympus om-d e-m10 mark ii, but i am looking at moving over to fujifilm due to the retro feel. i also love the colour tones produced by fuji cameras, and am interested using the platform to bring out my creative side. \n\n-----> i !!! ’ve had my eye on the x-t30, but many reviews -----> i !!! ’ve -----> made !!!  comparisons to the x-t20. my question is for those that have used one or both of these cameras, is it worth investing in the x-t30, or saving some money and going for the x-t20? \n\ntdlr: is it worth investing in the x-t30 or x-t20?", "sortedWord": "None", "Identifyer": null, "identifyer": 89762, "year": "2021"}, {"autor": "imperialka", "date": "2021-09-17 13:42:01", "content": "Is my xt30 ruined? /!/ I bought a used xt30 about a month ago my local camera store and it’s been working perfectly fine. I took out my camera this morning for a walk and the weather was like 70 degrees, cloudy, and it was drizzling very lightly (like specks of water). I took my camera out only to take 2 photos for maybe 5 minutes tops, but the majority of the walk the camera was in my bag. \n\nI come home and I notice my screen flickering under artificial light when turning it on for a few seconds (which I googled this appears to be normal). But the biggest issue is when I AF on something I can see my shutter curtain dragging. It appears like a dark curtain in my EVF and on my screen when I AF. \n\nWhen I actually take a photo you can clearly see the shutter curtain dragging and it appears like a shadow on top of the photo in different parts of the frame. I made sure my shutter speed isn’t really slow and I was taking photos at like 1/400 SS. \n\nIs it possible water or humidity ruined it in the few minutes I took it out? I find it hard to believe the camera is that sensitive, because it’s not like it was raining. \n\nI tried changing lenses and noticed the same problem so I think it’s definitely an issue with my body. \n\nI’m thinking of bringing my camera to my local camera store where I bought this camera and see if they can help me under their 90 day warranty for used, but is this my fault?", "link": "https://www.reddit.com/r/fujifilm/comments/pq0e0u/is_my_xt30_ruined/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "is my xt30 ruined? /!/ i bought a used xt30 about a month ago my local camera store and it’s been working perfectly fine. i took out my camera this morning for a walk and the weather was like 70 degrees, cloudy, and it was drizzling very lightly (like specks of water). i took my camera out only to take 2 photos for maybe 5 minutes tops, but the majority of the walk the camera was in my bag. \n\ni come home and i notice my screen flickering under artificial light when turning it on for a few seconds (which i googled this appears to be normal). but the biggest issue is when i af on something i can see my shutter curtain dragging. it appears like a dark curtain in my evf and on my screen when i af. \n\nwhen i actually take a photo you can clearly see the shutter curtain dragging and it appears like a shadow on top of the photo in different parts of the frame. -----> i !!!  -----> made !!!  sure my shutter speed isn’t really slow and -----> i !!!  was taking photos at like 1/400 ss. \n\nis it possible water or humidity ruined it in the few minutes -----> i !!!  took it out? i find it hard to believe the camera is that sensitive, because it’s not like it was raining. \n\ni tried changing lenses and noticed the same problem so i think it’s definitely an issue with my body. \n\ni’m thinking of bringing my camera to my local camera store where i bought this camera and see if they can help me under their 90 day warranty for used, but is this my fault?", "sortedWord": "None", "Identifyer": null, "identifyer": 90012, "year": "2021"}, {"autor": "-Hello-_-World-", "date": "2021-09-23 03:14:03", "content": "Anyone else use just one focal length? /!/ Hey everyone! Over the last couple years, I've added some lenses to my collection, but I find myself (almost) always shooting 50mm equivalent, so my 35mm f1.4. I'm trying to make the hard decision to sell off my other lenses that I don't use a lot.\n \nI'm asking to see if anyone else is like this lol and maybe that they only own one focal length. I've considered that I could sell off the lenses and then buy the cheaper 3rd party manual lenses that way I still have some variety.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/ptmcxm/anyone_else_use_just_one_focal_length/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm trying to make", "selectorShort": "make", "MarkedSent": "anyone else use just one focal length? /!/ hey everyone! over the last couple years, i've added some lenses to my collection, but i find myself (almost) always shooting 50mm equivalent, so my 35mm f1.4. -----> i !!! 'm -----> trying !!!  -----> to !!!  -----> make !!!  the hard decision -----> to !!!  sell off my other lenses that -----> i !!!  don't use a lot.\n \ni'm asking to see if anyone else is like this lol and maybe that they only own one focal length. i've considered that i could sell off the lenses and then buy the cheaper 3rd party manual lenses that way i still have some variety.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 90253, "year": "2021"}, {"autor": "Brownfletching", "date": "2021-09-05 00:16:32", "content": "Must-have lenses for a new X-S10 owner? /!/ I'm finally making the jump from Nikon back to my roots with Fuji, and I'm planning to order an X-S10 ASAP. My current lens collection is all Nikon F mount, so my plan is to sell it all and start rebuilding with Fuji &amp; compatible glass. \n\nI'm specifically looking for a good long zoom lens for opportunistic wildlife photography, and a good super wide angle for astrophotography/landscapes. \n\nBut don't let my specific interests hinder the discussion, there may be others that find this thread with different photography interests. What lenses would you all consider must haves?\n\n(P.s. does anyone make a good Nikon-Fuji converter? There is one lens I'd like to hold onto if possible)", "link": "https://www.reddit.com/r/fujifilm/comments/pi2rrq/musthave_lenses_for_a_new_xs10_owner/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm finally making", "selectorShort": "make", "MarkedSent": "must-have lenses for a new x-s10 owner? /!/ -----> i !!! 'm -----> finally !!!  -----> making !!!  the jump from nikon back to my roots with fuji, and -----> i !!! 'm planning to order an x-s10 asap. my current lens collection is all nikon f mount, so my plan is to sell it all and start rebuilding with fuji &amp; compatible glass. \n\ni'm specifically looking for a good long zoom lens for opportunistic wildlife photography, and a good super wide angle for astrophotography/landscapes. \n\nbut don't let my specific interests hinder the discussion, there may be others that find this thread with different photography interests. what lenses would you all consider must haves?\n\n(p.s. does anyone make a good nikon-fuji converter? there is one lens i'd like to hold onto if possible)", "sortedWord": "None", "Identifyer": null, "identifyer": 90397, "year": "2021"}, {"autor": "coned88", "date": "2021-09-25 19:08:38", "content": "is there a way to disable physical buttons? /!/ This may be an odd question. Since why would somebody buy a Fuji if they didn't like physical dials and such. But I like the output of the pictures quite a bit and like Fuji as a company. But I find the dials make this much more complex than they need to be. Such as just the other day I was trying to take a picture of my mom and couldn't get why the camera wasn't auto focusing. On the screen I made sure the AF icon was there in the upper right (the one that can be changed to off and spot). I then pressed the Q button and saw the 2nd box on the first row being set to MF. I went to change it with the wheel, bit it wouldn't change. Odd I said to myself. Maybe it's because I was in was a button on the lens I said to myself. Oh yes the AF was set to ring instead of \"A\". I change it and also turn on OIS. But still it doesn't work. So now I have a camera that's telling me it's in AF mode by the upper right corner and a lens that is also in \"A\" mode. But my Q menu still shows MF and I can't change it. I'm stumped. Then it clicks and I remember front dial which I move from M (which was accidentally changed) back to C. Then AF starts to work again. \n\nWhen you only have a few seconds to get a shot of a moment. That's just too much triaging to think about. I like fuji. I use it mainly for taking pictures of birds and the x-H1 and 100-400 give me amazing results. But as the first time taking more candid shots. I'm finding the controls much more difficult. I think it would just be easier to not use the fuji specific dials and buttons. Is that possible?", "link": "https://www.reddit.com/r/fujifilm/comments/pvdeal/is_there_a_way_to_disable_physical_buttons/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "is there a way to disable physical buttons? /!/ this may be an odd question. since why would somebody buy a fuji if they didn't like physical dials and such. but i like the output of the pictures quite a bit and like fuji as a company. but i find the dials make this much more complex than they need to be. such as just the other day i was trying to take a picture of my mom and couldn't get why the camera wasn't auto focusing. on the screen -----> i !!!  -----> made !!!  sure the af icon was there in the upper right (the one that can be changed to off and spot). i then pressed the q button and saw the 2nd box on the first row being set to mf. i went to change it with the wheel, bit it wouldn't change. odd i said to myself. maybe it's because i was in was a button on the lens i said to myself. oh yes the af was set to ring instead of \"a\". i change it and also turn on ois. but still it doesn't work. so now i have a camera that's telling me it's in af mode by the upper right corner and a lens that is also in \"a\" mode. but my q menu still shows mf and i can't change it. i'm stumped. then it clicks and i remember front dial which i move from m (which was accidentally changed) back to c. then af starts to work again. \n\nwhen you only have a few seconds to get a shot of a moment. that's just too much triaging to think about. i like fuji. i use it mainly for taking pictures of birds and the x-h1 and 100-400 give me amazing results. but as the first time taking more candid shots. i'm finding the controls much more difficult. i think it would just be easier to not use the fuji specific dials and buttons. is that possible?", "sortedWord": "None", "Identifyer": null, "identifyer": 90655, "year": "2021"}, {"autor": "kebscayabyab", "date": "2021-08-24 09:52:46", "content": "Sharing JPEG recipes that I made (X-T4 &amp; 50mm 2 &amp; 16mm 2.8)", "link": "https://www.reddit.com/r/fujifilm/comments/pak5lw/sharing_jpeg_recipes_that_i_made_xt4_50mm_2_16mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "sharing jpeg recipes that -----> i !!!  -----> made !!!  (x-t4 &amp; 50mm 2 &amp; 16mm 2.8)", "sortedWord": "None", "Identifyer": null, "identifyer": 91591, "year": "2021"}, {"autor": "MMACheerpuppy", "date": "2021-04-08 12:13:49", "content": "Sony A6400 v. X-S10 /!/ Hello, \n\nI don't want to cross post but I recently posted [https://www.reddit.com/r/AskPhotography/comments/mmq46a/sony\\_a6400\\_v\\_xs10/](https://www.reddit.com/r/AskPhotography/comments/mmq46a/sony_a6400_v_xs10/) here about deliberations I am trying to make picking a new camera. I love the low light performance of the A6400 and Sigma 30mm lens, and how it cleanly captures those deep luscious autumn reds.\n\nI am trying to find evidence that Fujifilm's cameras can step up to that plate. I am not bothered about the in camera image editing but most of the time will be found taking JPEGs. I feel Sony's technology might be a bit more advanced, overall, but my main target is image photography.\n\nThought this would be the right place to ask.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/mmqgai/sony_a6400_v_xs10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i am trying to make", "selectorShort": "make", "MarkedSent": "sony a6400 v. x-s10 /!/ hello, \n\ni don't want to cross post but -----> i !!!  recently posted [https://www.reddit.com/r/askphotography/comments/mmq46a/sony\\_a6400\\_v\\_xs10/](https://www.reddit.com/r/askphotography/comments/mmq46a/sony_a6400_v_xs10/) here about deliberations -----> i !!!  -----> am !!!  -----> trying !!!  -----> to !!!  -----> make !!!  picking a new camera. i love the low light performance of the a6400 and sigma 30mm lens, and how it cleanly captures those deep luscious autumn reds.\n\ni am trying to find evidence that fujifilm's cameras can step up to that plate. i am not bothered about the in camera image editing but most of the time will be found taking jpegs. i feel sony's technology might be a bit more advanced, overall, but my main target is image photography.\n\nthought this would be the right place to ask.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 91617, "year": "2021"}, {"autor": "Greenmountainpapa", "date": "2021-07-18 11:55:24", "content": "Photo/film making hybrid lens kit? /!/ So, all you Fuji enthusiasts out there. I am making the full switch to mirrorless after years and years of mainly shooting Nikon (with my travel camera being an X-E1 with a 27mm pancake for stealth street photography). I just love the feel and the colors that these cameras offer.\n\nMy question, if you are doing some portrait and live music concert photography, but more film making work (documentary, live musician sessions, some commercial work), like 35/65 split photo to video: what 3-5 lenses are you choosing to be in your kit for versatility and covering most of your bases?\n\nI still have my 27mm pancake.\n\nThanks all!", "link": "https://www.reddit.com/r/fujifilm/comments/omp5g1/photofilm_making_hybrid_lens_kit/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i am making", "selectorShort": "make", "MarkedSent": "photo/film making hybrid lens kit? /!/ so, all you fuji enthusiasts out there. -----> i !!!  -----> am !!!  -----> making !!!  the full switch to mirrorless after years and years of mainly shooting nikon (with my travel camera being an x-e1 with a 27mm pancake for stealth street photography). i just love the feel and the colors that these cameras offer.\n\nmy question, if you are doing some portrait and live music concert photography, but more film making work (documentary, live musician sessions, some commercial work), like 35/65 split photo to video: what 3-5 lenses are you choosing to be in your kit for versatility and covering most of your bases?\n\ni still have my 27mm pancake.\n\nthanks all!", "sortedWord": "None", "Identifyer": null, "identifyer": 91773, "year": "2021"}, {"autor": "Only_Outcome", "date": "2021-07-18 03:59:16", "content": "[B] XH-1 purchase /!/ I kinda of made an impulse eBay purchase and was hoping to get thoughts on price.  \n\n\nI figured that by going $1.00 above seller’s starting bid, it'd get rejected and I could wait (i had already made an offer below the starting bid).  And oops, it got accepted, lol, paid $868 for a Fujifilm X-H1 with battery, charger, strap, manual book and XF 18-55mm f:2.8-4 (both look great).  Obviously need to make sure it works, but if everything works as it should, figured it's an ok price with the “extras” listed below.\n\nAlso includes:\n\nK&amp;F MD-FX adapter\n\nFocal MC 2x converter\n\n35mm f2.8 MF Minolta\n\nMC Rokkor 55mm f1.7\n\nCanon 70-210 F4 MD  \n\n\nWe'll see.", "link": "https://www.reddit.com/r/fujifilm/comments/omj6ta/b_xh1_purchase/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i kinda of made", "selectorShort": "make", "MarkedSent": "[b] xh-1 purchase /!/ -----> i !!!  -----> kinda !!!  -----> of !!!  -----> made !!!  an impulse ebay purchase and was hoping to get thoughts on price.  \n\n\ni figured that by going $1.00 above seller’s starting bid, it'd get rejected and i could wait (i had already made an offer below the starting bid).  and oops, it got accepted, lol, paid $868 for a fujifilm x-h1 with battery, charger, strap, manual book and xf 18-55mm f:2.8-4 (both look great).  obviously need to make sure it works, but if everything works as it should, figured it's an ok price with the “extras” listed below.\n\nalso includes:\n\nk&amp;f md-fx adapter\n\nfocal mc 2x converter\n\n35mm f2.8 mf minolta\n\nmc rokkor 55mm f1.7\n\ncanon 70-210 f4 md  \n\n\nwe'll see.", "sortedWord": "None", "Identifyer": null, "identifyer": 91790, "year": "2021"}, {"autor": "bmason8", "date": "2021-07-17 20:06:16", "content": "Looking for volunteers for jpg recipe extraction help /!/ I'm the developer of the Fuji Custom Recipe app (let's you create your own jpg recipes) and I'm working on an update where you can import a jpg and 'extract' the recipe that was used to make it. It turns out it's a painful process because I have to figure out what each 'MakerNote Tag' means for each setting and you wouldn't believe how convoluted Fujifilm has made it. I've searched the internet for some type of lookup table for this stuff but for the one I found almost all of it was wrong for an image from an xtrans4 (new version) sensor. I've done the work of figuring out most of the settings for that sensor but was wondering if anyone was interested in helping streamline some of the older sensors. What I'm hoping for is for someone to iterate through all the jpg settings for a given sensor and take a picture of the current settings as they go along. That way I can import each photo and confirm what the values should be. For instance, 1st photo:  \nProvia, color = 0, grain size = small, sharpness = 0, etc.  \n2nd photo:  \nAstia, color = +1, grain size = Large, sharpness = +1, etc.  \nImportantly, the photo would be of the settings written down or in a notes app on your computer or something.  \nIf you're not bored yet here are some details about what makes this so difficult...  \n1. For most settings I have to make sense of what something like this means '0x1438'. So I take multiple photos and track how the values change.  \n2. MakerNotes Tag's don't appear in the exif data so they aren't standardized  \n3. Fuji doesn't just use the actual values AND they don't always use predictable patterns (for example for 'Color': 1216 = -3 but 'Low 2' = -2) WHY FUJI?!  \n4. There can be multiple keys to process for a single setting (example: not all film simulations can be extracted from the same key. Monochrome films sims appear under a different key).  \n\n\nUnfortunately the best I can offer anyone who helps is a free download code for the app so this is basically a thankless task unfortunately. That being said, if you do want to help please comment below. And this is something we can figure out later but just an FYI: If you compress the image at all once it's off the camera (ie upload to almost any service), the all important MakerNote tags will be removed (you can still compress the jpg in camera though).  \nPlease ignore how bad the UI looks...this is just what I hastily built for debugging.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5vtyx3ipxtb71.png?width=945&amp;format=png&amp;auto=webp&amp;s=4f9a87e60755cf89a871436e955a527060d76686", "link": "https://www.reddit.com/r/fujifilm/comments/ombo41/looking_for_volunteers_for_jpg_recipe_extraction/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have to make", "selectorShort": "make", "MarkedSent": "looking for volunteers for jpg recipe extraction help /!/ i'm the developer of the fuji custom recipe app (let's you create your own jpg recipes) and i'm working on an update where you can import a jpg and 'extract' the recipe that was used to make it. it turns out it's a painful process because i have to figure out what each 'makernote tag' means for each setting and you wouldn't believe how convoluted fujifilm has made it. i've searched the internet for some type of lookup table for this stuff but for the one i found almost all of it was wrong for an image from an xtrans4 (new version) sensor. i've done the work of figuring out most of the settings for that sensor but was wondering if anyone was interested in helping streamline some of the older sensors. what i'm hoping for is for someone to iterate through all the jpg settings for a given sensor and take a picture of the current settings as they go along. that way i can import each photo and confirm what the values should be. for instance, 1st photo:  \nprovia, color = 0, grain size = small, sharpness = 0, etc.  \n2nd photo:  \nastia, color = +1, grain size = large, sharpness = +1, etc.  \nimportantly, the photo would be of the settings written down or in a notes app on your computer or something.  \nif you're not bored yet here are some details about what makes this so difficult...  \n1. for most settings -----> i !!!  -----> have !!!  -----> to !!!  -----> make !!!  sense of what something like this means '0x1438'. so i take multiple photos and track how the values change.  \n2. makernotes tag's don't appear in the exif data so they aren't standardized  \n3. fuji doesn't just use the actual values and they don't always use predictable patterns (for example for 'color': 1216 = -3 but 'low 2' = -2) why fuji?!  \n4. there can be multiple keys to process for a single setting (example: not all film simulations can be extracted from the same key. monochrome films sims appear under a different key).  \n\n\nunfortunately the best i can offer anyone who helps is a free download code for the app so this is basically a thankless task unfortunately. that being said, if you do want to help please comment below. and this is something we can figure out later but just an fyi: if you compress the image at all once it's off the camera (ie upload to almost any service), the all important makernote tags will be removed (you can still compress the jpg in camera though).  \nplease ignore how bad the ui looks...this is just what i hastily built for debugging.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/5vtyx3ipxtb71.png?width=945&amp;format=png&amp;auto=webp&amp;s=4f9a87e60755cf89a871436e955a527060d76686", "sortedWord": "None", "Identifyer": null, "identifyer": 91814, "year": "2021"}, {"autor": "LazyMitchell", "date": "2021-07-27 12:12:49", "content": "Low effort example photos from the cards I made earlier. Hope this helps! im going to bed... /!/ &amp;#x200B;\n\n[Kodak Portra 400](https://preview.redd.it/nkino16sxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=cf4d9f7e6a419072fdfec2093b2a9e0212181a35)\n\n[Ramen Fury](https://preview.redd.it/uoats8iwxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=79d499b787a29d9246603bd008291c6273916851)\n\n[Fuji Juice \\(german film\\)](https://preview.redd.it/mj4hfx1yxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=d9471191cbf958838fc4e70b3d16780f43891151)\n\n[Valencia Italia](https://preview.redd.it/484xfzl0yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=8d2445dd27b38cbf73de512c94b5d09e84ae6733)\n\n[Joker](https://preview.redd.it/4rdzq992yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=a96602eb682e52efe46cd3188f89c4bdcbf970cb)\n\n[Soft Negative ](https://preview.redd.it/95iff8j3yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=fe6e911dca5bd71b3a89bd59285c655ddc2996be)\n\n[Little Purrdy](https://preview.redd.it/yjaeb9q4yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=aa97cc83a3cac73ca7b92d794e1abe348f46f2d6)", "link": "https://www.reddit.com/r/fujifilm/comments/osln4a/low_effort_example_photos_from_the_cards_i_made/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "low effort example photos from the cards -----> i !!!  -----> made !!!  earlier. hope this helps! im going to bed... /!/ &amp;#x200b;\n\n[kodak portra 400](https://preview.redd.it/nkino16sxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=cf4d9f7e6a419072fdfec2093b2a9e0212181a35)\n\n[ramen fury](https://preview.redd.it/uoats8iwxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=79d499b787a29d9246603bd008291c6273916851)\n\n[fuji juice \\(german film\\)](https://preview.redd.it/mj4hfx1yxqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=d9471191cbf958838fc4e70b3d16780f43891151)\n\n[valencia italia](https://preview.redd.it/484xfzl0yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=8d2445dd27b38cbf73de512c94b5d09e84ae6733)\n\n[joker](https://preview.redd.it/4rdzq992yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=a96602eb682e52efe46cd3188f89c4bdcbf970cb)\n\n[soft negative ](https://preview.redd.it/95iff8j3yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=fe6e911dca5bd71b3a89bd59285c655ddc2996be)\n\n[little purrdy](https://preview.redd.it/yjaeb9q4yqd71.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=aa97cc83a3cac73ca7b92d794e1abe348f46f2d6)", "sortedWord": "None", "Identifyer": null, "identifyer": 91828, "year": "2021"}, {"autor": "drunk-ninja", "date": "2021-05-11 14:55:06", "content": "Need help deciding between XF 35mm f/2 and XF 50mm f/2! /!/ First-time poster here. I'm currently struggling to decide which lens I should invest my money in next.\n\nI have a XT-20 and primarily use a XF 27mm f/2.8. These were my first lens (as it was really cheap), and I mostly do travel and street photography for leisure so far. I also bought a vintage Asahi Pentax 55mm/f1.8 under a hundred bucks for fun, and while the 55mm is great, it is MF only. \n\nI'm currently looking to go into shooting portraits commercially, for pets and people. A fast AF is important especially for the former, so unfortunately I can't rely on my manual lens. At a $400 budget, I'm looking at getting a **pre-owned xf 35mm/f2** or **50mm/f2** for better portraits. I've heard great reviews for both lenses, especially with the 35 (almost cultishly positive). \n\nThe 35 is theoretically great for portraits at 50ish mm full-frame equivalent. However, I'm currently leaning towards the 50mm, as it balances out better with my quite-versatile 27mm to give me a more well-rounded range. I might also get the 50mm for the time being and upgrade to the 56mm once I've made some money with my starting set up.\n\nWhat do you pros think? Any input would be greatly appreciated, especially if you have experience with either lenses or shooting portraits.", "link": "https://www.reddit.com/r/fujifilm/comments/n9yv5x/need_help_deciding_between_xf_35mm_f2_and_xf_50mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "need help deciding between xf 35mm f/2 and xf 50mm f/2! /!/ first-time poster here. i'm currently struggling to decide which lens i should invest my money in next.\n\ni have a xt-20 and primarily use a xf 27mm f/2.8. these were my first lens (as it was really cheap), and i mostly do travel and street photography for leisure so far. i also bought a vintage asahi pentax 55mm/f1.8 under a hundred bucks for fun, and while the 55mm is great, it is mf only. \n\ni'm currently looking to go into shooting portraits commercially, for pets and people. a fast af is important especially for the former, so unfortunately i can't rely on my manual lens. at a $400 budget, i'm looking at getting a **pre-owned xf 35mm/f2** or **50mm/f2** for better portraits. i've heard great reviews for both lenses, especially with the 35 (almost cultishly positive). \n\nthe 35 is theoretically great for portraits at 50ish mm full-frame equivalent. however, i'm currently leaning towards the 50mm, as it balances out better with my quite-versatile 27mm to give me a more well-rounded range. -----> i !!!  might also get the 50mm for the time being and upgrade to the 56mm once -----> i !!! 've -----> made !!!  some money with my starting set up.\n\nwhat do you pros think? any input would be greatly appreciated, especially if you have experience with either lenses or shooting portraits.", "sortedWord": "None", "Identifyer": null, "identifyer": 92194, "year": "2021"}, {"autor": "Cofain", "date": "2021-04-18 09:33:25", "content": "To the people who take their camera with them everywhere. /!/ I want to make a habit of taking my x100v with me more often, even when the focus is not on taking pictures.\n\nI use a camera strap for this, but it can sometimes be quite impractical, but as a man I also don't want to have to carry a bag all the time.\n\nTo the people who take their camera with them everywhere.\nDo you take the camera with you every time you go out or only for walks with the family?\n\nHow do you carry or transport the camera?\nDo you have a neck strap or do you use a small fanny pack or backpack?\n\nDo you have any tips for building this habit? How have you done it?", "link": "https://www.reddit.com/r/fujifilm/comments/mt9of4/to_the_people_who_take_their_camera_with_them/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "to the people who take their camera with them everywhere. /!/ -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  a habit of taking my x100v with me more often, even when the focus is not on taking pictures.\n\ni use a camera strap for this, but it can sometimes be quite impractical, but as a man i also don't want to have to carry a bag all the time.\n\nto the people who take their camera with them everywhere.\ndo you take the camera with you every time you go out or only for walks with the family?\n\nhow do you carry or transport the camera?\ndo you have a neck strap or do you use a small fanny pack or backpack?\n\ndo you have any tips for building this habit? how have you done it?", "sortedWord": "None", "Identifyer": null, "identifyer": 92243, "year": "2021"}, {"autor": "Hellmark", "date": "2021-06-24 00:54:35", "content": "Uploading directly to Google Photos from X-S10 /!/ I am thinking about making a jump from Sony and getting a X-S10. For the most part it seems like it is a better offering than the a6400 which is the next logical upgrade point from my current camera (NEX-6). One thing though that I really make a lot of use of and I'm curious if I can do is I am able to connect my camera over Wi-Fi and sync directly to Google Photos. This really simplifies things a lot especially when I'm not near my computer.\n\nSo the big question is, am I able to do this with Fuji, or do I have to jump through more hoops then just hitting something on the camera itself?", "link": "https://www.reddit.com/r/fujifilm/comments/o6q3zm/uploading_directly_to_google_photos_from_xs10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i really make", "selectorShort": "make", "MarkedSent": "uploading directly to google photos from x-s10 /!/ i am thinking about making a jump from sony and getting a x-s10. for the most part it seems like it is a better offering than the a6400 which is the next logical upgrade point from my current camera (nex-6). one thing though that -----> i !!!  -----> really !!!  -----> make !!!  a lot of use of and -----> i !!! 'm curious if -----> i !!!  can do is -----> i !!!  am able to connect my camera over wi-fi and sync directly to google photos. this really simplifies things a lot especially when i'm not near my computer.\n\nso the big question is, am i able to do this with fuji, or do i have to jump through more hoops then just hitting something on the camera itself?", "sortedWord": "None", "Identifyer": null, "identifyer": 92579, "year": "2021"}, {"autor": "2milelanding", "date": "2021-04-02 23:27:16", "content": "X-E4 Shutter dial wobble normal? /!/ Hello! Sorry if this is a weird question but I am a college student and saved up to buy this camera and after a week of shooting the shutter dial has become wobbly a bit and when you press it down makes this clicking noise.\n\nI hate to be nitpicky, I love the hell out of this camera but as I just bought it I want to make sure everything's okay and ask if others have a similar experience with their fuji cameras? Thank you!\n\nhttp://imgur.com/gallery/kuOZn3F", "link": "https://www.reddit.com/r/fujifilm/comments/miwfe5/xe4_shutter_dial_wobble_normal/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "x-e4 shutter dial wobble normal? /!/ hello! sorry if this is a weird question but i am a college student and saved up to buy this camera and after a week of shooting the shutter dial has become wobbly a bit and when you press it down makes this clicking noise.\n\n-----> i !!!  hate -----> to !!!  be nitpicky, -----> i !!!  love the hell out of this camera but as -----> i !!!  just bought it -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure everything's okay and ask if others have a similar experience with their fuji cameras? thank you!\n\nhttp://imgur.com/gallery/kuozn3f", "sortedWord": "None", "Identifyer": null, "identifyer": 92696, "year": "2021"}, {"autor": "nichstp", "date": "2021-04-02 21:54:27", "content": "How to make... /!/ How can I make my x-t200 take pictures similarly to my instax 8? I’ve tried setting the shutter to 1/60 but that’s as far as I got.\n\nI found online that the instax has a 60mm focal length but idk what the mirrorless equivalent of that would be. \n\nAny insight would be really appreciated!", "link": "https://www.reddit.com/r/fujifilm/comments/miun3c/how_to_make/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "how to make... /!/ how can -----> i !!!  -----> make !!!  my x-t200 take pictures similarly to my instax 8? i’ve tried setting the shutter to 1/60 but that’s as far as i got.\n\ni found online that the instax has a 60mm focal length but idk what the mirrorless equivalent of that would be. \n\nany insight would be really appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 92699, "year": "2021"}, {"autor": "zmreJ", "date": "2021-06-02 04:23:53", "content": "18-55 OR 16-55 for wedding photography? /!/ A friend of mine asked me to do their wedding photos in a couple weeks, and i'd like to have a zoom lens for it. Currently I only have primes (23, 35, 56) so i was looking at picking up a zoom lens so im not switching lenses all the time. Im torn between the 16-55 f2.8 and the 18-55 f2.8-4. Is it super worth it to spring for the constant aperture f2.8, or should I be fine with the variable aperture? Any other good alternatives i should be made aware of?", "link": "https://www.reddit.com/r/fujifilm/comments/nqd8qb/1855_or_1655_for_wedding_photography/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i should be made", "selectorShort": "make", "MarkedSent": "18-55 or 16-55 for wedding photography? /!/ a friend of mine asked me to do their wedding photos in a couple weeks, and i'd like to have a zoom lens for it. currently i only have primes (23, 35, 56) so i was looking at picking up a zoom lens so im not switching lenses all the time. im torn between the 16-55 f2.8 and the 18-55 f2.8-4. is it super worth it to spring for the constant aperture f2.8, or should i be fine with the variable aperture? any other good alternatives -----> i !!!  -----> should !!!  -----> be !!!  -----> made !!!  aware of?", "sortedWord": "None", "Identifyer": null, "identifyer": 92914, "year": "2021"}, {"autor": "amash1", "date": "2021-06-10 17:29:01", "content": "How can I make this better in terms of noise and make it more pleasant? At f/8 3s 200ISO | X-T100 XF 55-200", "link": "https://www.reddit.com/r/fujifilm/comments/nwtb76/how_can_i_make_this_better_in_terms_of_noise_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "how can -----> i !!!  -----> make !!!  this better in terms of noise and -----> make !!!  it more pleasant? at f/8 3s 200iso | x-t100 xf 55-200", "sortedWord": "None", "Identifyer": null, "identifyer": 93097, "year": "2021"}, {"autor": "PeoplesPrinceofNYC", "date": "2021-05-03 22:39:59", "content": "SD Card For The X-T4 /!/ So I finally pulled the trigger and bought my very 1st big boy camera (also the most expensive single item purchase I've ever made). I've seen a few suggestions on various sites on which card is best compatible with the X-T4, but in the end I figured I'd get my best answer from you guys. \n\nAs of right now I'll mostly be playing around with stills, but of course once I'm more comfortable I'd like to also try my hand at shooting video to the best of the camera's capabilities. So I guess my question is which card works best, do I just buy the biggest size, should I buy two of the same one or is there any benefits to having two different card types?\n\nAppreciate any and all help", "link": "https://www.reddit.com/r/fujifilm/comments/n49hd5/sd_card_for_the_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've ever made", "selectorShort": "make", "MarkedSent": "sd card for the x-t4 /!/ so i finally pulled the trigger and bought my very 1st big boy camera (also the most expensive single item purchase -----> i !!! 've -----> ever !!!  -----> made !!! ). i've seen a few suggestions on various sites on which card is best compatible with the x-t4, but in the end i figured i'd get my best answer from you guys. \n\nas of right now i'll mostly be playing around with stills, but of course once i'm more comfortable i'd like to also try my hand at shooting video to the best of the camera's capabilities. so i guess my question is which card works best, do i just buy the biggest size, should i buy two of the same one or is there any benefits to having two different card types?\n\nappreciate any and all help", "sortedWord": "None", "Identifyer": null, "identifyer": 93662, "year": "2021"}, {"autor": "Do-Not-Cover", "date": "2021-04-25 09:36:33", "content": "Street photographer Kudo Bass on the Fuji way /!/ Kudo Bass is a Scotland-based street photographer and [her process](https://www.instagram.com/p/COEUQ54HuPC/) speaks to what makes Fuji's cameras so good for SOOC:\n\n&gt; I’m sure most of you know that I don’t use Lightroom or Photoshop (or CaptureOne, or whatever). I don’t use a laptop or a computer. I hardly spend any time at all ‘editing’. Just a quick tweak of a Fuji Jpeg in Snapseed, and I’m done. ••• Why? Not because I can’t. I used Photoshop for years, at a professional level - earning my living. ••• I just don’t want to spend the little time I have for photography staring at a screen, trying to make a bad photograph look good. I’d rather go out and shoot and shoot and shoot, until I get something that looks pretty good to me, straight out of camera. (Yes, I still crop and tweak!) ••• It’s about more than how I spend my time though. I don’t want my work to be primarily a creation of the editing room. ••• High contrast bnw, with large areas artificially blacked out. Cool atmospherics and intense colours, all created with a slider. All that stuff - it looks great, it’s sexy as hell. But it’s all in the edit. ••• No. I want to capture great images using the camera. That’s fffing hard to do. It’s a challenge. It’s where the real fun is, for me.\n\nBass shoots exclusively with an X-T3 and XF50F2.\n\nI shoot RAW+JPEG and I try as much as possible to only go back to the RAW if I need to make white balance changes. I see the RAF file as the negative but the photograph is the JPG \"print\" and I try to get that as right in camera as possible. I dig the idea of not trying to rescue a photo through editing but instead going back out to make another one.", "link": "https://www.reddit.com/r/fujifilm/comments/my4wa4/street_photographer_kudo_bass_on_the_fuji_way/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": "street photographer kudo bass on the fuji way /!/ kudo bass is a scotland-based street photographer and [her process](https://www.instagram.com/p/coeuq54hupc/) speaks to what makes fuji's cameras so good for sooc:\n\n&gt; i’m sure most of you know that i don’t use lightroom or photoshop (or captureone, or whatever). i don’t use a laptop or a computer. i hardly spend any time at all ‘editing’. just a quick tweak of a fuji jpeg in snapseed, and i’m done. ••• why? not because i can’t. i used photoshop for years, at a professional level - earning my living. ••• i just don’t want to spend the little time i have for photography staring at a screen, trying to make a bad photograph look good. i’d rather go out and shoot and shoot and shoot, until i get something that looks pretty good to me, straight out of camera. (yes, i still crop and tweak!) ••• it’s about more than how i spend my time though. i don’t want my work to be primarily a creation of the editing room. ••• high contrast bnw, with large areas artificially blacked out. cool atmospherics and intense colours, all created with a slider. all that stuff - it looks great, it’s sexy as hell. but it’s all in the edit. ••• no. i want to capture great images using the camera. that’s fffing hard to do. it’s a challenge. it’s where the real fun is, for me.\n\nbass shoots exclusively with an x-t3 and xf50f2.\n\n-----> i !!!  shoot raw+jpeg and -----> i !!!  try as much as possible -----> to !!!  only go back -----> to !!!  the raw if -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  white balance changes. i see the raf file as the negative but the photograph is the jpg \"print\" and i try to get that as right in camera as possible. i dig the idea of not trying to rescue a photo through editing but instead going back out to make another one.", "sortedWord": "None", "Identifyer": null, "identifyer": 94089, "year": "2021"}, {"autor": "vegan_persian_rug", "date": "2021-05-19 21:29:39", "content": "Slug days - XF10 (sooc but I made the slug a bit lighter and cropped in Snapseed)", "link": "https://www.reddit.com/r/fujifilm/comments/nghqgl/slug_days_xf10_sooc_but_i_made_the_slug_a_bit/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "slug days - xf10 (sooc but -----> i !!!  -----> made !!!  the slug a bit lighter and cropped in snapseed)", "sortedWord": "None", "Identifyer": null, "identifyer": 94343, "year": "2021"}, {"autor": "CardinalDrinker", "date": "2021-05-19 11:55:52", "content": "I finally made the Switch from Canon to Fuji", "link": "https://www.reddit.com/r/fujifilm/comments/ng3sdk/i_finally_made_the_switch_from_canon_to_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> finally !!!  -----> made !!!  the switch from canon to fuji", "sortedWord": "None", "Identifyer": null, "identifyer": 94372, "year": "2021"}, {"autor": "Fujifan5000", "date": "2021-05-06 18:34:26", "content": "7artisans 35mm f0.95 focus /!/ Can you rely on the focus distance markings of the 7artisans 35mm f0.95? Are they accurate? What about the infinity marking? Asking because I have a cheap 25mm f1.8 and the focus markings are way off. I'm wondering if the 35 0.95 has the same issue before I make a decision.\n\n(I posted this in this sub because I heard that the reason some 7artisans lenses focus past infinity is to compensate for different flange distances on different lens mounts.)\n\nThx :-)", "link": "https://www.reddit.com/r/fujifilm/comments/n6e5zb/7artisans_35mm_f095_focus/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "7artisans 35mm f0.95 focus /!/ can you rely on the focus distance markings of the 7artisans 35mm f0.95? are they accurate? what about the infinity marking? asking because i have a cheap 25mm f1.8 and the focus markings are way off. -----> i !!! 'm wondering if the 35 0.95 has the same issue before -----> i !!!  -----> make !!!  a decision.\n\n(i posted this in this sub because i heard that the reason some 7artisans lenses focus past infinity is to compensate for different flange distances on different lens mounts.)\n\nthx :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 94495, "year": "2021"}, {"autor": "LoRez", "date": "2021-07-09 05:02:03", "content": "X-T200 sunset mode question. Can I see what settings the camera is using to capture and image in Sunset Mode? /!/ So I was trying to take a pic of some golden hour sun coming through some trees but when I took the pic in Manual mode the colors came out just looking like normal daylight and not the golden orange I was seeing, even with vivid color film emulator on and the internal color bumped up a bit.  So I put the camera into Sunset mode and it was able to capture the golden hour light I was seeing in front of me.  My question is is there a way I can tell what the camera is doing/adjusting to make this happen? Sunset mode is limited in the adjustments you can make and the displayed info on the pic in Play back mode just tells me that I used Sunset Mode and what shutter/aperture/zoom setting I used.  Can I make the adjustments myself in the camera to capture the same thing as Sunset mode without having to rely on the camera to seeming use an internal filter to capture what i'm seeing?  Thanks in advance", "link": "https://www.reddit.com/r/fujifilm/comments/ogolij/xt200_sunset_mode_question_can_i_see_what/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x-t200 sunset mode question. can i see what settings the camera is using to capture and image in sunset mode? /!/ so i was trying to take a pic of some golden hour sun coming through some trees but when i took the pic in manual mode the colors came out just looking like normal daylight and not the golden orange i was seeing, even with vivid color film emulator on and the internal color bumped up a bit.  so i put the camera into sunset mode and it was able to capture the golden hour light i was seeing in front of me.  my question is is there a way i can tell what the camera is doing/adjusting to make this happen? sunset mode is limited in the adjustments you can make and the displayed info on the pic in play back mode just tells me that i used sunset mode and what shutter/aperture/zoom setting i used.  can -----> i !!!  -----> make !!!  the adjustments myself in the camera to capture the same thing as sunset mode without having to rely on the camera to seeming use an internal filter to capture what -----> i !!! 'm seeing?  thanks in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 94781, "year": "2021"}, {"autor": "carrienationhatchet", "date": "2021-02-14 15:20:52", "content": "Just got a X-H1 and loving the IBIS--took this shot with my 23mmf2 at 1/20. Side note; I had a really hard time attaching the strap with the triangular clips to the body; can someone please post a photo of theirs so I can make sure mine is correct?", "link": "https://www.reddit.com/r/fujifilm/comments/ljq94p/just_got_a_xh1_and_loving_the_ibistook_this_shot/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "just got a x-h1 and loving the ibis--took this shot with my 23mmf2 at 1/20. side note; -----> i !!!  had a really hard time attaching the strap with the triangular clips to the body; -----> can !!!  someone please post a photo of theirs so -----> i !!!  -----> can !!!  -----> make !!!  sure mine is correct?", "sortedWord": "None", "Identifyer": null, "identifyer": 94950, "year": "2021"}, {"autor": "Chaoticgoodcharacter", "date": "2021-01-07 22:16:27", "content": "Fujifilm instax SQ20 not working... /!/ Hi! I got an SQ20 for Christmas and put the first film in it worked great and has been awesome to use. I even made my New Years resolution to take one photo everyday for all of 2021. My only problem is now when I put in more film it spit out that little black film cover and the screen has said processing for a half an hour. I’ve tried turning it off I even took the film out and put it back in. (Yes ik that might have made the film turn white I did it in a dark room in case that helped...) Nothing seems to be working and I really don’t want to have to return it for a replacement as that will hurt my goal of a pic a day. So, my question is, has anyone else had this problem? Another question, what would you recommend I try next? \nAt this point the best option I can think of is to let it sit and hope it dies at some point so I can plug it in and maybe it will reboot to normal idk... \nThx in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/kso9qe/fujifilm_instax_sq20_not_working/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i even made", "selectorShort": "make", "MarkedSent": "fujifilm instax sq20 not working... /!/ hi! i got an sq20 for christmas and put the first film in it worked great and has been awesome to use. -----> i !!!  -----> even !!!  -----> made !!!  my new years resolution to take one photo everyday for all of 2021. my only problem is now when i put in more film it spit out that little black film cover and the screen has said processing for a half an hour. i’ve tried turning it off i even took the film out and put it back in. (yes ik that might have made the film turn white i did it in a dark room in case that helped...) nothing seems to be working and i really don’t want to have to return it for a replacement as that will hurt my goal of a pic a day. so, my question is, has anyone else had this problem? another question, what would you recommend i try next? \nat this point the best option i can think of is to let it sit and hope it dies at some point so i can plug it in and maybe it will reboot to normal idk... \nthx in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 95139, "year": "2021"}, {"autor": "Fapplet", "date": "2021-01-21 13:51:44", "content": "What should I get the a second hand Fuji XT3 or XT30? /!/ Hello, after religiously reading every post about the XT30 and XT3 on this subreddit plus online I really would like some advice.\n\nI was planning on getting a Brand new XT30 because it's in my budget range but I found a used XT3 for the same price (5500\\~ clicks). Buying a second hand camera makes me quite very nervous (I even had a bad dream about it today)  because it will be my first expensive professional camera ever and I am super scared that something is wrong/will go wrong with it plus it will be lacking a warranty. I am planning on filming lots of videos but also taking many pictures. \n\nI noticed that the XT3 is 40% heavier than the XT30 ( 383 vs 539) and it is larger so that is also a consideration. \n\nOn the other hand the XT3 does have weatherproof (even though I'm not planning on doing any extreme stuff with it) .\n\nI know at the end of the day I will need to make the final choice but I would really appreciate advice!\n\nMy worry gut is telling me buy a a NEW XT30 so I don't need to worry about it but a \"get more what you pay\" for is telling me USED XT3. \n\nCheers all  \n(By the way I'm not from US/EUROPE and there is only 1 XT3 second hand on the market)", "link": "https://www.reddit.com/r/fujifilm/comments/l1ytyr/what_should_i_get_the_a_second_hand_fuji_xt3_or/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i will need to make", "selectorShort": "make", "MarkedSent": "what should i get the a second hand fuji xt3 or xt30? /!/ hello, after religiously reading every post about the xt30 and xt3 on this subreddit plus online i really would like some advice.\n\ni was planning on getting a brand new xt30 because it's in my budget range but i found a used xt3 for the same price (5500\\~ clicks). buying a second hand camera makes me quite very nervous (i even had a bad dream about it today)  because it will be my first expensive professional camera ever and i am super scared that something is wrong/will go wrong with it plus it will be lacking a warranty. i am planning on filming lots of videos but also taking many pictures. \n\ni noticed that the xt3 is 40% heavier than the xt30 ( 383 vs 539) and it is larger so that is also a consideration. \n\non the other hand the xt3 does have weatherproof (even though i'm not planning on doing any extreme stuff with it) .\n\n-----> i !!!  know at the end of the day -----> i !!!  -----> will !!!  -----> need !!!  -----> to !!!  -----> make !!!  the final choice but i would really appreciate advice!\n\nmy worry gut is telling me buy a a new xt30 so i don't need to worry about it but a \"get more what you pay\" for is telling me used xt3. \n\ncheers all  \n(by the way i'm not from us/europe and there is only 1 xt3 second hand on the market)", "sortedWord": "None", "Identifyer": null, "identifyer": 95459, "year": "2021"}, {"autor": "FullTopMax", "date": "2021-10-23 23:59:35", "content": "X-S10 sensor cleaning /!/ Today I was out for a shoot and saw a spec of dust in the viewfinder, removed the lens and used some zeiss lens cleaning wipes wrapped over a q-tip to clean the sensor. Camera was turned off. The sensor jiggled a bit while I was doing the cleaning. I got home now and found many videos that advise this camera sensor to be cleaned camera on and IBIS off......so, given I've done it the opposite way, how do I make sure I didn't screw anything up? Camera works, IBIS works...but how can I be sure it's all good? :D", "link": "https://www.reddit.com/r/fujifilm/comments/qegnn1/xs10_sensor_cleaning/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x-s10 sensor cleaning /!/ today i was out for a shoot and saw a spec of dust in the viewfinder, removed the lens and used some zeiss lens cleaning wipes wrapped over a q-tip to clean the sensor. camera was turned off. the sensor jiggled a bit while i was doing the cleaning. i got home now and found many videos that advise this camera sensor to be cleaned camera on and ibis off......so, given -----> i !!! 've done it the opposite way, how do -----> i !!!  -----> make !!!  sure -----> i !!!  didn't screw anything up? camera works, ibis works...but how can i be sure it's all good? :d", "sortedWord": "None", "Identifyer": null, "identifyer": 95720, "year": "2021"}, {"autor": "micromophone", "date": "2021-02-09 16:06:01", "content": "X100V vs. X100F for video recording daughter’s basketball games...and is the V worth the upgrade with the F heavily discounted? /!/ Had an old fuji finepix 15-20 years ago and absolutely loved it for photos. Looking back at the pictures I took make me want another all in one camera to upgrade from the iphone. Settled on a X100V or X100F, but I’ve read that it may over heat and/or has a 30 minute max video recording time. I also would really like to be able to record decent video with it like my daughter’s basketball games. I know Sony or maybe Canon would be better for that, but really like the fuji for pictures and simplicity/retro/controls. Bhvideo has a great deal on the X100F @$899 USD and the X100V @$1399 USD, so wondering if the V is worth the upgrade for video as I’d like to keep cost low as possible but don’t know if either can handle the video I need. FYI I’ll be ordering from Canada because every local store is much more expensive and have always had great service from bhvideo in the past.", "link": "https://www.reddit.com/r/fujifilm/comments/lg6j5x/x100v_vs_x100f_for_video_recording_daughters/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i took make", "selectorShort": "make", "MarkedSent": "x100v vs. x100f for video recording daughter’s basketball games...and is the v worth the upgrade with the f heavily discounted? /!/ had an old fuji finepix 15-20 years ago and absolutely loved it for photos. looking back at the pictures -----> i !!!  -----> took !!!  -----> make !!!  me want another all in one camera to upgrade from the iphone. settled on a x100v or x100f, but i’ve read that it may over heat and/or has a 30 minute max video recording time. i also would really like to be able to record decent video with it like my daughter’s basketball games. i know sony or maybe canon would be better for that, but really like the fuji for pictures and simplicity/retro/controls. bhvideo has a great deal on the x100f @$899 usd and the x100v @$1399 usd, so wondering if the v is worth the upgrade for video as i’d like to keep cost low as possible but don’t know if either can handle the video i need. fyi i’ll be ordering from canada because every local store is much more expensive and have always had great service from bhvideo in the past.", "sortedWord": "None", "Identifyer": null, "identifyer": 96199, "year": "2021"}, {"autor": "jcov7", "date": "2021-02-09 13:53:35", "content": "16-55 f2.8 or 56 f1.2 &amp; 16 f1.4 combo? /!/ Long time Sony user. Recently sold my gear a switched over to Fuji after trying out a few of my friends XT3/XT4 I fell in love. I just purchased the XT4 and I’m trying to figure out where to start.\n\nI mainly shoot photos around NYC. Street photography and cityscape. I also like to do landscapes. I’m not much of a portrait shooter, but portraits sometimes play a role in my street photography. \n\nI’ve read countless threads and posts for the past week and figured I would make a post. Also realized the Fuji community is way better than the Sony community.\n\nIf you were starting out all over again would you go with the Fuji 16-55 or 2 primes the 56 and 16?", "link": "https://www.reddit.com/r/fujifilm/comments/lg3rjg/1655_f28_or_56_f12_16_f14_combo/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "16-55 f2.8 or 56 f1.2 &amp; 16 f1.4 combo? /!/ long time sony user. recently sold my gear a switched over to fuji after trying out a few of my friends xt3/xt4 i fell in love. i just purchased the xt4 and i’m trying to figure out where to start.\n\ni mainly shoot photos around nyc. street photography and cityscape. i also like to do landscapes. i’m not much of a portrait shooter, but portraits sometimes play a role in my street photography. \n\n-----> i !!! ’ve read countless threads and posts for the past week and figured -----> i !!!  -----> would !!!  -----> make !!!  a post. also realized the fuji community is way better than the sony community.\n\nif you were starting out all over again would you go with the fuji 16-55 or 2 primes the 56 and 16?", "sortedWord": "None", "Identifyer": null, "identifyer": 96205, "year": "2021"}, {"autor": "speednap", "date": "2021-09-21 22:27:23", "content": "X-T4 low FPS in EVF w/ clarity setting /!/ Hi,\n\nI'm not sure if it has always been like that or if it just started happening a few days ago but it's something that I can't unsee now and it got me a bit worried so I wanted to make sure that my unit isn't defective:\n\nCan X-T4 owners confirm that there is a noticeable difference in EVF \"smoothness\" depending on the clarity setting? Can someone test this by setting clarity to +1 and switching between S and CL modes and then report back if they see any difference in EVF smoothness (when panning, etc)? (CL mode force-disables the clarity setting, hence why it's one the easiest ways to test this).\n\nFor me, EVF with clarity at 0 is silky smooth (feels like 60 FPS?) and clarity at +1 is slightly choppy, 30-ish FPS, maybe? Boost mode doesn't seem to make any difference and neither do any other IQ options.\n\nThe lag isn't too bad and I assigned \"natural view\" to a button (natural view is consistently smooth) for quick switching, but I could've sworn there wasn't any lag before 🤷‍♂️\n\nQuick google search shows that I'm not the only one having this issue\n\n[https://www.dpreview.com/forums/thread/4523071](https://www.dpreview.com/forums/thread/4523071)\n\nbut I wanted to double check to make sure.\n\nThank you.", "link": "https://www.reddit.com/r/fujifilm/comments/pstrmh/xt4_low_fps_in_evf_w_clarity_setting/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "x-t4 low fps in evf w/ clarity setting /!/ hi,\n\ni'm not sure if it has always been like that or if it just started happening a few days ago but it's something that -----> i !!!  can't unsee now and it got me a bit worried so -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure that my unit isn't defective:\n\ncan x-t4 owners confirm that there is a noticeable difference in evf \"smoothness\" depending on the clarity setting? can someone test this by setting clarity to +1 and switching between s and cl modes and then report back if they see any difference in evf smoothness (when panning, etc)? (cl mode force-disables the clarity setting, hence why it's one the easiest ways to test this).\n\nfor me, evf with clarity at 0 is silky smooth (feels like 60 fps?) and clarity at +1 is slightly choppy, 30-ish fps, maybe? boost mode doesn't seem to make any difference and neither do any other iq options.\n\nthe lag isn't too bad and i assigned \"natural view\" to a button (natural view is consistently smooth) for quick switching, but i could've sworn there wasn't any lag before 🤷‍♂️\n\nquick google search shows that i'm not the only one having this issue\n\n[https://www.dpreview.com/forums/thread/4523071](https://www.dpreview.com/forums/thread/4523071)\n\nbut i wanted to double check to make sure.\n\nthank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 96311, "year": "2021"}, {"autor": "saugatpandeya", "date": "2021-09-07 12:39:32", "content": "16-55mm f2.8 vs 16-80mm f4 /!/ Hey guys, so I'm struggling to make a decision here as to which lens to buy. I currently have the XT3 and looking for an all round lens for travel/landscapes (stills). Also, I will be using the 35mm f2 for travel as well. Anyone have experiences of using either of these lenses?", "link": "https://www.reddit.com/r/fujifilm/comments/pjm9bm/1655mm_f28_vs_1680mm_f4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm struggling to make", "selectorShort": "make", "MarkedSent": "16-55mm f2.8 vs 16-80mm f4 /!/ hey guys, so -----> i !!! 'm -----> struggling !!!  -----> to !!!  -----> make !!!  a decision here as -----> to !!!  which lens -----> to !!!  buy. i currently have the xt3 and looking for an all round lens for travel/landscapes (stills). also, i will be using the 35mm f2 for travel as well. anyone have experiences of using either of these lenses?", "sortedWord": "None", "Identifyer": null, "identifyer": 96503, "year": "2021"}, {"autor": "keltonpanda", "date": "2021-10-26 17:57:51", "content": "Focus questions /!/ I have been going out on my weekends and trying to take some landscape photos. I was curious how people like to use autofocus in general not just for landscapes? I found myself not getting the sharpest images when I didn’t make my focus point the smallest area it can be. When I did this it produced great results the weekend before in the mountains.\n\nI’ve been following a Nigel Danson rule that you focus on the furthest part of your shot and everything should be in acceptable focus if you’re aperture is right (smaller aperture for most landscapes)\n\nAlso in manual focus does anyone find infinity is not very focused? It’s hard to tell on the focus check and I’ve tried peaking and don’t think it’s very accurate either. I just want some good quality images and help appreciated!\n\n:shooting on an xt20 with an 18-55", "link": "https://www.reddit.com/r/fujifilm/comments/qgc52t/focus_questions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i didn’t make", "selectorShort": "make", "MarkedSent": "focus questions /!/ i have been going out on my weekends and trying to take some landscape photos. i was curious how people like to use autofocus in general not just for landscapes? -----> i !!!  found myself not getting the sharpest images when -----> i !!!  -----> did !!! -----> n’t !!!  -----> make !!!  my focus point the smallest area it can be. when i did this it produced great results the weekend before in the mountains.\n\ni’ve been following a nigel danson rule that you focus on the furthest part of your shot and everything should be in acceptable focus if you’re aperture is right (smaller aperture for most landscapes)\n\nalso in manual focus does anyone find infinity is not very focused? it’s hard to tell on the focus check and i’ve tried peaking and don’t think it’s very accurate either. i just want some good quality images and help appreciated!\n\n:shooting on an xt20 with an 18-55", "sortedWord": "None", "Identifyer": null, "identifyer": 96519, "year": "2021"}, {"autor": "WeaponsGradeLager", "date": "2021-10-25 21:08:33", "content": "GFX100S vs GFX50R color differences /!/ I used to own GFX50R and now I have 100S. Looking back at my 50R photos in Lightroom I can't help but admire color palettes, the soft blues and pinks. Ever since I bought GFX100S, I frankly hated the colors. They are pedestrian regular Sony-like. There is nothing special about them, certainly nothing GFX about them. I can't tell apart my Sony a7RIV from GFX100S apart. Am I crazy or does anybody else familiar with these cameras also sees this? Don't get me wrong I've made very nice long exposures with GFX100S and ND filters, but as for snapshots - forget it.\n\nI'm picking up a used GFX50R tomorrow and I've put my GFX100S for sale. From what I've seen GFX50SII also exhibits the same disgusting muddy colors as GFX100S.", "link": "https://www.reddit.com/r/fujifilm/comments/qfqgmo/gfx100s_vs_gfx50r_color_differences/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "gfx100s vs gfx50r color differences /!/ i used to own gfx50r and now i have 100s. looking back at my 50r photos in lightroom i can't help but admire color palettes, the soft blues and pinks. ever since i bought gfx100s, i frankly hated the colors. they are pedestrian regular sony-like. there is nothing special about them, certainly nothing gfx about them. i can't tell apart my sony a7riv from gfx100s apart. am i crazy or does anybody else familiar with these cameras also sees this? don't get me wrong -----> i !!! 've -----> made !!!  very nice long exposures with gfx100s and nd filters, but as for snapshots - forget it.\n\ni'm picking up a used gfx50r tomorrow and i've put my gfx100s for sale. from what i've seen gfx50sii also exhibits the same disgusting muddy colors as gfx100s.", "sortedWord": "None", "Identifyer": null, "identifyer": 96586, "year": "2021"}, {"autor": "BrownWithCamera", "date": "2021-10-19 14:51:20", "content": "Third party batteries for X-S10 /!/ If you guys remember few days ago I made a post about getting a Fujifilm camera, I pulled the trigger and got Fujifilm X-S10. So far, I am enjoying taking photos with it. But X-S10 is quite weak in the battery performance.\n\nSo, I was thinking about 1 or may be 2 additional batteries. \n\n1. How are the third party batteries? \n2. Is it bad to use third party batteries?\n3. Which third party batteries are good?\n4. should I stick to original fuji NP-W126S battery?", "link": "https://www.reddit.com/r/fujifilm/comments/qbd47c/third_party_batteries_for_xs10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "third party batteries for x-s10 /!/ if you guys remember few days ago -----> i !!!  -----> made !!!  a post about getting a fujifilm camera, -----> i !!!  pulled the trigger and got fujifilm x-s10. so far, i am enjoying taking photos with it. but x-s10 is quite weak in the battery performance.\n\nso, i was thinking about 1 or may be 2 additional batteries. \n\n1. how are the third party batteries? \n2. is it bad to use third party batteries?\n3. which third party batteries are good?\n4. should i stick to original fuji np-w126s battery?", "sortedWord": "None", "Identifyer": null, "identifyer": 96876, "year": "2021"}, {"autor": "-916Tips-", "date": "2021-10-19 05:27:31", "content": "Shoot of a leather wrapped guitar I just made | XT4 | 35 f2 | Kodachrome 64 and Ilford HP Plus 400 sims", "link": "https://www.reddit.com/r/fujifilm/comments/qb4sl5/shoot_of_a_leather_wrapped_guitar_i_just_made_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "shoot of a leather wrapped guitar -----> i !!!  -----> just !!!  -----> made !!!  | xt4 | 35 f2 | kodachrome 64 and ilford hp plus 400 sims", "sortedWord": "None", "Identifyer": null, "identifyer": 96893, "year": "2021"}, {"autor": "FullTopMax", "date": "2021-10-24 16:13:33", "content": "Silly request - can anyone record me how X-S10 sounds when powered on? /!/ I need to hear it and see if my is sounding \"off\" (I want to make sure my IBIS is working properly, long story...)\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/qeva0w/silly_request_can_anyone_record_me_how_xs10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "silly request - can anyone record me how x-s10 sounds when powered on? /!/ -----> i !!!  need -----> to !!!  hear it and see if my is sounding \"off\" (-----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure my ibis is working properly, long story...)\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 98957, "year": "2021"}, {"autor": "n1ck1982", "date": "2021-10-01 17:55:08", "content": "Sony FF to Fuji /!/ I'll start off by saying that I'm strictly a hobbyist photographer. The majority of images I take, I post online -- i.e. mainly Reddit and Flickr. Once in awhile, I will print out an image to hang in our house. But the largest print I've made to date is 36x24 and that was from a D800E years ago. I mainly photograph cityscapes/landscapes/travel. \n\nI currently shoot with a Sony a7RIII and various Sony lenses. The camera and lenses have served me well and I've made a lot of great images. However, a couple months ago I picked up used X100V and my Sony gear has taken a backseat to the V. I love the fact that I can take it anywhere and sling it over my should with a Peak Design strap. It's also the de facto camera I use to photograph our son. \n\nThat got me to thinking that I don't need a FF 42mp sensor. I would still like an interchangeable body and lenses for those cityscape/landscape/travel images that I like to take to pair with my X100V. So I have been thinking of selling my Sony gear and picking up a X-T3 + 16-80mm and 10-24mm lenses. \n\nFor those of you who have transitioned from Sony FF (especially from the a7RII/III) to Fuji, what have your thoughts been? Would you do it again? Did you regret it?", "link": "https://www.reddit.com/r/fujifilm/comments/pzdcqx/sony_ff_to_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "sony ff to fuji /!/ i'll start off by saying that i'm strictly a hobbyist photographer. the majority of images i take, i post online -- i.e. mainly reddit and flickr. once in awhile, i will print out an image to hang in our house. but the largest print -----> i !!! 've -----> made !!!  to date is 36x24 and that was from a d800e years ago. i mainly photograph cityscapes/landscapes/travel. \n\ni currently shoot with a sony a7riii and various sony lenses. the camera and lenses have served me well and i've made a lot of great images. however, a couple months ago i picked up used x100v and my sony gear has taken a backseat to the v. i love the fact that i can take it anywhere and sling it over my should with a peak design strap. it's also the de facto camera i use to photograph our son. \n\nthat got me to thinking that i don't need a ff 42mp sensor. i would still like an interchangeable body and lenses for those cityscape/landscape/travel images that i like to take to pair with my x100v. so i have been thinking of selling my sony gear and picking up a x-t3 + 16-80mm and 10-24mm lenses. \n\nfor those of you who have transitioned from sony ff (especially from the a7rii/iii) to fuji, what have your thoughts been? would you do it again? did you regret it?", "sortedWord": "None", "Identifyer": null, "identifyer": 99014, "year": "2021"}], "name": "makefujifilm2021"}