{"interestingcomments": [{"autor": "tomboyjeans", "date": "2019-09-09 00:43:26", "content": "I'm getting overwhelmed and need opinion on which X Series camera I should get. /!/ I'm buying my first camera and I have narrowed it down to 3 options. I have done a lot of research so far and I'm close to making a decision, but first I'd like to get some opinions from this community.   \n\nI am choosing between the X-T20, X-A5, and X-T100.  \n\nMy main reason for buying a camera is to step up my street photography game. I want something that is good for walking around with and can take great photos of moving subjects. All the cameras have similar specs and a few differences, but I will say that video recording would only be maybe 10% of what I use the camera for. \n\nAny insight you guys might have would definitely help me make this decision!", "link": "https://www.reddit.com/r/fujifilm/comments/d1jkhm/im_getting_overwhelmed_and_need_opinion_on_which/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "i'm getting overwhelmed and need opinion on which x series camera i should get. /!/ i'm buying my first camera and i have narrowed it down to 3 options. i have done a lot of research so far and i'm close to making a decision, but first i'd like to get some opinions from this community.   \n\ni am choosing between the x-t20, x-a5, and x-t100.  \n\nmy main reason for buying a camera is to step up my street photography game. i want something that is good for walking around with and can take great photos of moving subjects. all the cameras have similar specs and a few differences, but i will say that video recording would only be maybe 10% of what i use the camera for. \n\nany insight you guys might have would definitely help -----> me !!!  -----> make !!!  this decision!", "sortedWord": "None", "Identifyer": null, "identifyer": 23599, "year": "2019"}, {"autor": "oldjoints", "date": "2019-09-08 02:28:14", "content": "Need help narrowing camera options (XE-3 vs. XT-20) /!/ Hi! Following up from an earlier post I made, am now deciding between these two cameras for landscapes and general photography while hiking and trekking, and also some street while travelling. Weight and portability are most important for me, and I'm moving from a Nikon DSLR (D7000) and am a big fan of prime lenses which pretty much live on my current cameras: a 50mm 1.8 on my Canon SLR and a 35mm 1.8 on my D7000. Not a fan of zoom or kit lenses (prefer to walk to compose the shot), been using primes exclusively for the past 4 years mainly for IQ and weight, although I've been hearing good things about the Fuji 18-55. Not into videography. \n\n* XE-3: Love the size and the look, and being able to get the 23mm bundle is very tempting. Read some reviews that weren't too happy with the EVF. \n* XT-20: The tilting screen could be useful for hiking, but I've never had a camera with a tilt screen so it's not a huge gamechanger. \n* Ergonomics of both are similar for me. I'm not keen on the XT-2 because it's pretty much as heavy as my DSLR. I don't forsee myself getting into larger lenses, if my previous photography experience is anything to go by -- I'm really into going as light as possible. \n\nMy 3 options are:\n\n(1) XE-3 with 23mm f.2 -- too narrow for landscapes while hiking? Found the 35mm on a Nikon DSLR a little too cramped sometimes.\n\n(2) XE-3 with 18-55 \n\n(3) XT-20 with 18-55\n\nCheers!", "link": "https://www.reddit.com/r/fujifilm/comments/d15b2m/need_help_narrowing_camera_options_xe3_vs_xt20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "need help narrowing camera options (xe-3 vs. xt-20) /!/ hi! following up from an earlier post -----> i !!!  -----> made !!! , am now deciding between these two cameras for landscapes and general photography while hiking and trekking, and also some street while travelling. weight and portability are most important for me, and i'm moving from a nikon dslr (d7000) and am a big fan of prime lenses which pretty much live on my current cameras: a 50mm 1.8 on my canon slr and a 35mm 1.8 on my d7000. not a fan of zoom or kit lenses (prefer to walk to compose the shot), been using primes exclusively for the past 4 years mainly for iq and weight, although i've been hearing good things about the fuji 18-55. not into videography. \n\n* xe-3: love the size and the look, and being able to get the 23mm bundle is very tempting. read some reviews that weren't too happy with the evf. \n* xt-20: the tilting screen could be useful for hiking, but i've never had a camera with a tilt screen so it's not a huge gamechanger. \n* ergonomics of both are similar for me. i'm not keen on the xt-2 because it's pretty much as heavy as my dslr. i don't forsee myself getting into larger lenses, if my previous photography experience is anything to go by -- i'm really into going as light as possible. \n\nmy 3 options are:\n\n(1) xe-3 with 23mm f.2 -- too narrow for landscapes while hiking? found the 35mm on a nikon dslr a little too cramped sometimes.\n\n(2) xe-3 with 18-55 \n\n(3) xt-20 with 18-55\n\ncheers!", "sortedWord": "None", "Identifyer": null, "identifyer": 23624, "year": "2019"}, {"autor": "nezMB", "date": "2019-06-06 07:14:28", "content": "Anyone buy the mitakon 35 0.95 recently? /!/ Hi. I just bought this lens and the packaging does not look how I was expecting (the fancy leather box). Instead it came in a black box and a padded lens case.\n\nIt looks like the pictures I have seen online and the weight is 460g, but it doesn't say mitakon anywhere on the packaging just zhong yi optics. Have they changed them recently?\n\nI'm not bothered about the box, I'm jus making sure I have got what I paid for. Thanks", "link": "https://www.reddit.com/r/fujifilm/comments/bxdrqp/anyone_buy_the_mitakon_35_095_recently/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm jus making", "selectorShort": "make", "MarkedSent": "anyone buy the mitakon 35 0.95 recently? /!/ hi. i just bought this lens and the packaging does not look how i was expecting (the fancy leather box). instead it came in a black box and a padded lens case.\n\nit looks like the pictures i have seen online and the weight is 460g, but it doesn't say mitakon anywhere on the packaging just zhong yi optics. have they changed them recently?\n\n-----> i !!! 'm not bothered about the box, -----> i !!! 'm -----> jus !!!  -----> making !!!  sure -----> i !!!  have got what -----> i !!!  paid for. thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 23991, "year": "2019"}, {"autor": "YashenTheVeganZombie", "date": "2019-06-05 15:54:08", "content": "I have made a simple diffuser for the EF-X20 (download link in comments!)", "link": "https://www.reddit.com/r/fujifilm/comments/bx45ms/i_have_made_a_simple_diffuser_for_the_efx20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> have !!!  -----> made !!!  a simple diffuser for the ef-x20 (download link in comments!)", "sortedWord": "None", "Identifyer": null, "identifyer": 24001, "year": "2019"}, {"autor": "drphilwasright", "date": "2019-07-31 20:21:05", "content": "Has anyone tried the 7artisans 35mm 1.2? /!/ Hey guys, just looking for some input on this lens. I'm buying an XT2 today locally and I don't have the extra cash to buy the Fuji 23mm that I want, but this lens is pretty cheap and would hold me over until I have the cash for Fuji glass.\n\nDoes anyone have any experience with it? The reviews I read make it seem decent enough, and ultra high IQ and sharpness isn't a super big deal to me. I like lenses with \"character\" anyways.\n\nFor a budget lens that'll hold me over for a month or so, should I go for it? Or try to find another option?", "link": "https://www.reddit.com/r/fujifilm/comments/ckdv0k/has_anyone_tried_the_7artisans_35mm_12/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i read make", "selectorShort": "make", "MarkedSent": "has anyone tried the 7artisans 35mm 1.2? /!/ hey guys, just looking for some input on this lens. i'm buying an xt2 today locally and i don't have the extra cash to buy the fuji 23mm that i want, but this lens is pretty cheap and would hold me over until i have the cash for fuji glass.\n\ndoes anyone have any experience with it? the reviews -----> i !!!  -----> read !!!  -----> make !!!  it seem decent enough, and ultra high iq and sharpness isn't a super big deal to me. i like lenses with \"character\" anyways.\n\nfor a budget lens that'll hold me over for a month or so, should i go for it? or try to find another option?", "sortedWord": "None", "Identifyer": null, "identifyer": 24255, "year": "2019"}, {"autor": "Shaka1277", "date": "2019-07-29 10:08:52", "content": "My experience with the 1.4x TC and 50-140 mm f/2.8 - a test /!/ Hi all!\n\nWith the money earned by selling my Nikon 70-200, the recent cashback deal, a gift card I got for my birthday, and my LCS confirming that the cashback deal applied to the 50-140 **and** 1.4 TC kit (~€300 savings vs. buying separately), I decided to buy said kit. With the cashback deal, which I was on the last day of, I effectively got the 1.4x TC for €50 as it worked out. I figured I'd get it, and sell it if it wasn't up to snuff. I mostly planned to use this lens for larger wildlife [like dogs](https://www.flickr.com/photos/155307394@N06/48108226933/in/album-72157691838507272/), or [birds in zoos and parks](https://www.flickr.com/photos/155307394@N06) (note: these were taken with the Nikon), and mostly for events. I wasn't aiming for the 100-400 because I need the faster aperture for my paid gigs.\n\nI used the lens with the 1.4x TC immediately after buying it, and have some thoughts to share:\n\n- It's god damn heavy. It's only 130 g, but it's so dense that it feels massive in the hand. \n\n- It's extremely tightly built. I never had an issues with it in that regard. Got caught in a massive rainstorm and the lens, TC, and camera were fine.\n\n- Finally, the reason I'm making this post: **It's not a good companion to the 50-140 except in the most extreme cases, at least for my use case**.\n\nI figured this *might* be the case, but again, it basically cost me €50, and I can sell it easily and make a bit. I wasn't happy with many of the shots from that first day, and decided to do a semi-scientific test.\n\n**Aim:**\n\n- To test whether the inevitable sharpness degradation of the 1.4x TC was more severe than the loss of resolution caused by cropping a shot taken without the TC to yield a similar field of view. \n\n- If the sharpness degradation is low, to investigate whether the sharpness loss is worth losing a stop of light.\n\n- To compare the background rendition between the effective 140 m f/2.8 and 196 mm f/4 lenses.\n\n**Setup/methods:**\n\n- Fuji X-H1 on tripod, 2s self timer\n\n- ISO 200, wide open (f/2.8, f/4), manual shutter speed\n\n- 140 mm lens focal length only, as I only use the TC when I need range.\n\n- Subject: Hair gel on my desk. \n\n- Two sets of shots: 1 m focus distance, and a bit less than 2 m focus distance (ish). Just wanted to eyeball how much of a difference focus distance made, but I didn't want to check 10 m or 20 m as most of my wildlife shots are within a 5 m range. It's more \"animal portraiture\" than classical wildlife photography, but I digress.\n\n- Imported as-is into LR\n\n- Non-TC shots duplicated, and the latter copies were cropped visually to match as closely as possible. **This yields an approximately 12-13 MP image depending on the precision of your crop**: One was 12.0 MP, the other 12.9 MP.\n\n**Results:**\n\n- [Full album here](https://imgur.com/a/2bvvQjU)\n\n- [Two original shots at ~1.8-2 m focus distance, with TC shot on the right](https://i.imgur.com/WJqZSRB.png)\n\n- [The non-TC shot is now cropped to more or less match the TC shot](https://i.imgur.com/tvtxxHr.png)\n\n- [At 100%, the TC shot is noticeably, and in my opinion, significantly softer than the non-TC shot that was cropped](https://i.imgur.com/71F9jA4.jpg). Bear in mind that the left is a 100% view at 12.0 MP, and the latter at 24 MP. I presume the difference in magnification here is the result of the 100% view amplifying slight differences in FoV caused by my imprecise cropping.\n\n- [Shots taken at 1 m, with the non-TC already cropped in](https://i.imgur.com/ytnQfon.png)\n\n- [Again, the TC shot at 24 MP is significantly softer than the 12.9 MP (in this case) shot](https://i.imgur.com/Av6rzPn.jpg).\n\n**Conclusion:**\n\n- The sharpness degradation at 100% is significant, and in my opinion, worse than simply cropping in. \n\n- The background rendition is different between the two, but negligible in my eyes except within a direct side-by-side comparison. The extra focal length does not significantly outweigh the slower aperture.\n\n- This test is limited by the range of focus distances tested. It is my opinion that in very extreme cases where the subject is *very* far away, the increase in resolution from (say) 2.5 MP to ~5 MP may overcome the softness when using the TC.\n\n- This test is limited by the fact that the lens was only tested wide open in both cases. My use case is: wide open; get close. For landscapes, I rarely shoot above 135 mm equivalent, so I would never use the TC in that scenario and am not interested in testing it. For events, lack of light means I'm often at ISO 3200 and f/2.8 anyway.\n\n- This test is also limited by the low ISO used. Noise at high ISO may decrease the difference in apparent resolution.\n\n**Further work:**\n\n- Set up a shot with fine detail (possibly my garden shed), repeat this test, and see if the difference is noticeable in print form. I'll do this just for the sake of it. The actual sharpness difference is too high IMO, and I never print larger than 12x8\", and the loss of light is significant for my purposes.", "link": "https://www.reddit.com/r/fujifilm/comments/cj998v/my_experience_with_the_14x_tc_and_50140_mm_f28_a/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "my experience with the 1.4x tc and 50-140 mm f/2.8 - a test /!/ hi all!\n\nwith the money earned by selling my nikon 70-200, the recent cashback deal, a gift card i got for my birthday, and my lcs confirming that the cashback deal applied to the 50-140 **and** 1.4 tc kit (~€300 savings vs. buying separately), i decided to buy said kit. with the cashback deal, which i was on the last day of, i effectively got the 1.4x tc for €50 as it worked out. i figured i'd get it, and sell it if it wasn't up to snuff. i mostly planned to use this lens for larger wildlife [like dogs](https://www.flickr.com/photos/155307394@n06/48108226933/in/album-72157691838507272/), or [birds in zoos and parks](https://www.flickr.com/photos/155307394@n06) (note: these were taken with the nikon), and mostly for events. i wasn't aiming for the 100-400 because i need the faster aperture for my paid gigs.\n\ni used the lens with the 1.4x tc immediately after buying it, and have some thoughts to share:\n\n- it's god damn heavy. it's only 130 g, but it's so dense that it feels massive in the hand. \n\n- it's extremely tightly built. i never had an issues with it in that regard. got caught in a massive rainstorm and the lens, tc, and camera were fine.\n\n- finally, the reason -----> i !!! 'm -----> making !!!  this post: **it's not a good companion to the 50-140 except in the most extreme cases, at least for my use case**.\n\ni figured this *might* be the case, but again, it basically cost me €50, and i can sell it easily and make a bit. i wasn't happy with many of the shots from that first day, and decided to do a semi-scientific test.\n\n**aim:**\n\n- to test whether the inevitable sharpness degradation of the 1.4x tc was more severe than the loss of resolution caused by cropping a shot taken without the tc to yield a similar field of view. \n\n- if the sharpness degradation is low, to investigate whether the sharpness loss is worth losing a stop of light.\n\n- to compare the background rendition between the effective 140 m f/2.8 and 196 mm f/4 lenses.\n\n**setup/methods:**\n\n- fuji x-h1 on tripod, 2s self timer\n\n- iso 200, wide open (f/2.8, f/4), manual shutter speed\n\n- 140 mm lens focal length only, as i only use the tc when i need range.\n\n- subject: hair gel on my desk. \n\n- two sets of shots: 1 m focus distance, and a bit less than 2 m focus distance (ish). just wanted to eyeball how much of a difference focus distance made, but i didn't want to check 10 m or 20 m as most of my wildlife shots are within a 5 m range. it's more \"animal portraiture\" than classical wildlife photography, but i digress.\n\n- imported as-is into lr\n\n- non-tc shots duplicated, and the latter copies were cropped visually to match as closely as possible. **this yields an approximately 12-13 mp image depending on the precision of your crop**: one was 12.0 mp, the other 12.9 mp.\n\n**results:**\n\n- [full album here](https://imgur.com/a/2bvvqju)\n\n- [two original shots at ~1.8-2 m focus distance, with tc shot on the right](https://i.imgur.com/wjqzsrb.png)\n\n- [the non-tc shot is now cropped to more or less match the tc shot](https://i.imgur.com/tvtxxhr.png)\n\n- [at 100%, the tc shot is noticeably, and in my opinion, significantly softer than the non-tc shot that was cropped](https://i.imgur.com/71f9ja4.jpg). bear in mind that the left is a 100% view at 12.0 mp, and the latter at 24 mp. i presume the difference in magnification here is the result of the 100% view amplifying slight differences in fov caused by my imprecise cropping.\n\n- [shots taken at 1 m, with the non-tc already cropped in](https://i.imgur.com/ytnqfon.png)\n\n- [again, the tc shot at 24 mp is significantly softer than the 12.9 mp (in this case) shot](https://i.imgur.com/av6rzpn.jpg).\n\n**conclusion:**\n\n- the sharpness degradation at 100% is significant, and in my opinion, worse than simply cropping in. \n\n- the background rendition is different between the two, but negligible in my eyes except within a direct side-by-side comparison. the extra focal length does not significantly outweigh the slower aperture.\n\n- this test is limited by the range of focus distances tested. it is my opinion that in very extreme cases where the subject is *very* far away, the increase in resolution from (say) 2.5 mp to ~5 mp may overcome the softness when using the tc.\n\n- this test is limited by the fact that the lens was only tested wide open in both cases. my use case is: wide open; get close. for landscapes, i rarely shoot above 135 mm equivalent, so i would never use the tc in that scenario and am not interested in testing it. for events, lack of light means i'm often at iso 3200 and f/2.8 anyway.\n\n- this test is also limited by the low iso used. noise at high iso may decrease the difference in apparent resolution.\n\n**further work:**\n\n- set up a shot with fine detail (possibly my garden shed), repeat this test, and see if the difference is noticeable in print form. i'll do this just for the sake of it. the actual sharpness difference is too high imo, and i never print larger than 12x8\", and the loss of light is significant for my purposes.", "sortedWord": "None", "Identifyer": null, "identifyer": 24297, "year": "2019"}, {"autor": "fool_on_a_hill", "date": "2019-02-01 23:57:30", "content": "Kit lens or Rokinon 12mmf2 for landscape photography? /!/ I'm trying to decide which lens to go with for general landscape photography. I understand that the 12mm is wider but I'm okay with 18mm for landscape tbh, especially with the added versatility in focal length. My main concerns are things like sharpness (I plan to make large-ish prints), chromatic aberration, and coma (for occasional wide field milky way shots). I really would like the versatility of having the 18-55 but I'm not sure how it compares optically with the rokinon. I'd also welcome any personal preferences or opinions. Thanks in advance! ", "link": "https://www.reddit.com/r/fujifilm/comments/am8gp5/kit_lens_or_rokinon_12mmf2_for_landscape/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i plan to make", "selectorShort": "make", "MarkedSent": "kit lens or rokinon 12mmf2 for landscape photography? /!/ i'm trying to decide which lens to go with for general landscape photography. i understand that the 12mm is wider but i'm okay with 18mm for landscape tbh, especially with the added versatility in focal length. my main concerns are things like sharpness (-----> i !!!  -----> plan !!!  -----> to !!!  -----> make !!!  large-ish prints), chromatic aberration, and coma (for occasional wide field milky way shots). i really would like the versatility of having the 18-55 but i'm not sure how it compares optically with the rokinon. i'd also welcome any personal preferences or opinions. thanks in advance! ", "sortedWord": "None", "Identifyer": null, "identifyer": 24475, "year": "2019"}, {"autor": "usarca2001", "date": "2019-03-12 01:57:16", "content": "Need some help - Flash Issues XT-3 /!/ Hi everyone!\n\n&amp;#x200B;\n\nWondering if you all could help me with a problem that I've been having with my XT-3. I was working a job recently and towards the end of the night I started having problems with my flash (Godox TT685F). I was shooting at a dimly lit bar and was shooting at 1/250 and suddenly my flash started working. I had been using it most of the day but at speeds faster then 1/250 (I was in a fairly well lit room and just needed to balance the light with a telephoto).  First thing I did was put new batteries but alas nothing. Luckily I had a backup camera (X-Pro2) and fired it up and the flash worked perfectly.\n\n&amp;#x200B;\n\nFlash forward (pun intended) to tonight and I did all sorts of tests, including trying to use my EF-X8, and I couldn't make it work on 1/250. However, the 685 worked flawlessly at everything above 1/250. So what am I missing here? I checked my settings multiple times and there were no glaring errors (set to mechanical shutter and single frame). \n\n&amp;#x200B;\n\nAppreciate any help!", "link": "https://www.reddit.com/r/fujifilm/comments/b021bc/need_some_help_flash_issues_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "need some help - flash issues xt-3 /!/ hi everyone!\n\n&amp;#x200b;\n\nwondering if you all could help me with a problem that i've been having with my xt-3. i was working a job recently and towards the end of the night i started having problems with my flash (godox tt685f). i was shooting at a dimly lit bar and was shooting at 1/250 and suddenly my flash started working. i had been using it most of the day but at speeds faster then 1/250 (i was in a fairly well lit room and just needed to balance the light with a telephoto).  first thing i did was put new batteries but alas nothing. luckily i had a backup camera (x-pro2) and fired it up and the flash worked perfectly.\n\n&amp;#x200b;\n\nflash forward (pun intended) to tonight and -----> i !!!  did all sorts of tests, including trying to use my ef-x8, and -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it work on 1/250. however, the 685 worked flawlessly at everything above 1/250. so what am i missing here? i checked my settings multiple times and there were no glaring errors (set to mechanical shutter and single frame). \n\n&amp;#x200b;\n\nappreciate any help!", "sortedWord": "None", "Identifyer": null, "identifyer": 24564, "year": "2019"}, {"autor": "Bbymystic_lady", "date": "2019-03-08 02:55:16", "content": "Fujifilm XT-20 or XT-30? Is it worth an extra $350 to get the latest and greatest? /!/ I'm buying a new camera for the first time in about 9 years. I want whatever I buy to last! I don't feel like I need to latest and greatest camera and when I went and tried out the XT-20 I really liked it and it's being sold at a great price. But is it worth spending the extra money to get the soon to be released X-30 ... or is the upgrade even worth an extra $350? I make decent money but not a lot, little enough that $350 gives me pause. I just worry that technology ages to quickly these days! ", "link": "https://www.reddit.com/r/fujifilm/comments/ayla02/fujifilm_xt20_or_xt30_is_it_worth_an_extra_350_to/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "fujifilm xt-20 or xt-30? is it worth an extra $350 to get the latest and greatest? /!/ i'm buying a new camera for the first time in about 9 years. i want whatever i buy to last! i don't feel like i need to latest and greatest camera and when i went and tried out the xt-20 i really liked it and it's being sold at a great price. but is it worth spending the extra money to get the soon to be released x-30 ... or is the upgrade even worth an extra $350? -----> i !!!  -----> make !!!  decent money but not a lot, little enough that $350 gives me pause. i just worry that technology ages to quickly these days! ", "sortedWord": "None", "Identifyer": null, "identifyer": 24605, "year": "2019"}, {"autor": "the_Chainvaper", "date": "2019-03-05 03:11:51", "content": "Hey R/fujifilm! /!/ I just made my first camera purchase, I bought a XT20.. it should Arrive Friday.  I’m super pumped to explore the world of photography outside of my iPhone camera. Can anyone confirm that this is intact a great camera? The guy in the store sold me. But I wanted to get some user reviews! Thanks! ", "link": "https://www.reddit.com/r/fujifilm/comments/axgaqo/hey_rfujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "hey r/fujifilm! /!/ -----> i !!!  -----> just !!!  -----> made !!!  my first camera purchase, -----> i !!!  bought a xt20.. it should arrive friday.  i’m super pumped to explore the world of photography outside of my iphone camera. can anyone confirm that this is intact a great camera? the guy in the store sold me. but i wanted to get some user reviews! thanks! ", "sortedWord": "None", "Identifyer": null, "identifyer": 24625, "year": "2019"}, {"autor": "sleepygirl2019", "date": "2019-04-17 01:39:59", "content": "Not sure if this is the sub to post but...I bought a fujifilm disposable camera the other day. And forgive me, but I was soo young when these were in. But anywho, if I’m taking pics outdoors with the sun, do I use flash or no flash? I don’t want it to come out dark (hopefully I make sense) /!/ Thanks in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/be22vy/not_sure_if_this_is_the_sub_to_post_buti_bought_a/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "not sure if this is the sub to post but...i bought a fujifilm disposable camera the other day. and forgive me, but i was soo young when these were in. but anywho, if i’m taking pics outdoors with the sun, do i use flash or no flash? -----> i !!!  don’t want it to come out dark (hopefully -----> i !!!  -----> make !!!  sense) /!/ thanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 24687, "year": "2019"}, {"autor": "Jammeshaw", "date": "2019-04-16 13:54:28", "content": "Just ordered the Fuji X-h1 with grip for £1000, did I make the right choice /!/ I'm gonna be using it mostly for video. \n\nShould i have got the x-t2 and saved myself some money or spent more and got the x-t3", "link": "https://www.reddit.com/r/fujifilm/comments/bdu7w1/just_ordered_the_fuji_xh1_with_grip_for_1000_did/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "just ordered the fuji x-h1 with grip for £1000, did -----> i !!!  -----> make !!!  the right choice /!/ i'm gonna be using it mostly for video. \n\nshould i have got the x-t2 and saved myself some money or spent more and got the x-t3", "sortedWord": "None", "Identifyer": null, "identifyer": 24698, "year": "2019"}, {"autor": "SnapshotWill", "date": "2019-12-29 04:09:02", "content": "Lens vs Lens Assistance /!/ Hello Everyone,\n\nI am planning on pulling the trigger on a zoom lens within the week, and am stuck between two different lenses for my purchase. The XF16-55mm &amp; XF16-80mm. \n\nI currently shoot with 2 prime lenses; 35mm &amp; 50mm.  I have managed to make due with these two lenses for quite sometime on my X-T20 &amp; X-H1. However, I have been running into a wall regarding my next lens. I have been a prime shooter for sometime, and was thinking of getting a few more prime lenses over time that would be as low as 16mm, and fill in the gaps as needed for other focal lengths. However, I have come to my senses, and began giving the Fuji zoom lenses consideration. The thought of not having to swap lenses as frequently, and travel with less. Would be very nice. \n\nAfter doing some research, I find the XF16-55mm very appealing. It has a low aperture for a zoom lens, professional grade class lens, sharp focus, and is highly revered amongst photographers. The lens doesn’t have IOS, but I have a camera body with IBIS (X-H1). \n\nI have also had recommendations to look into the XF16-80mm as well. It’s a year newer, more compact, has a little more reach, $200 cheaper and has OIS. \n\nI really do not have a “niche” when it comes to photography, but enjoy landscapes and portraits. I have ran into circumstances where a little more reach would be beneficial, but have managed with just a 50mm (75mm equivalent) lens. \n\nTherefore, I want opinions and suggestions on which would be the best lens to purchase between the two. The $200 difference is NOT an issue, and or reason I would choose one over the other. \n\nThank you 🙏", "link": "https://www.reddit.com/r/fujifilm/comments/eh1a6v/lens_vs_lens_assistance/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have managed to make", "selectorShort": "make", "MarkedSent": "lens vs lens assistance /!/ hello everyone,\n\ni am planning on pulling the trigger on a zoom lens within the week, and am stuck between two different lenses for my purchase. the xf16-55mm &amp; xf16-80mm. \n\ni currently shoot with 2 prime lenses; 35mm &amp; 50mm.  -----> i !!!  -----> have !!!  -----> managed !!!  -----> to !!!  -----> make !!!  due with these two lenses for quite sometime on my x-t20 &amp; x-h1. however, i have been running into a wall regarding my next lens. i have been a prime shooter for sometime, and was thinking of getting a few more prime lenses over time that would be as low as 16mm, and fill in the gaps as needed for other focal lengths. however, i have come to my senses, and began giving the fuji zoom lenses consideration. the thought of not having to swap lenses as frequently, and travel with less. would be very nice. \n\nafter doing some research, i find the xf16-55mm very appealing. it has a low aperture for a zoom lens, professional grade class lens, sharp focus, and is highly revered amongst photographers. the lens doesn’t have ios, but i have a camera body with ibis (x-h1). \n\ni have also had recommendations to look into the xf16-80mm as well. it’s a year newer, more compact, has a little more reach, $200 cheaper and has ois. \n\ni really do not have a “niche” when it comes to photography, but enjoy landscapes and portraits. i have ran into circumstances where a little more reach would be beneficial, but have managed with just a 50mm (75mm equivalent) lens. \n\ntherefore, i want opinions and suggestions on which would be the best lens to purchase between the two. the $200 difference is not an issue, and or reason i would choose one over the other. \n\nthank you 🙏", "sortedWord": "None", "Identifyer": null, "identifyer": 24763, "year": "2019"}, {"autor": "dheevm", "date": "2019-08-17 19:58:04", "content": "Should I get a Fujifilm X100f? /!/ I own a Sony A7 III with Zeiss Loxia 35 mm f2 and Sony Zeiss 55mm f1.8 mm lenses. I love street photography and shall be living in London for the next 3 years at least. I shall commute by walking and public transport. I don’t know if I should get a Fuji x100f because I fear that this may be a waste of money given that I don’t make money from photography. Please, help me decide.", "link": "https://www.reddit.com/r/fujifilm/comments/crr3fz/should_i_get_a_fujifilm_x100f/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i don’t make", "selectorShort": "make", "MarkedSent": "should i get a fujifilm x100f? /!/ i own a sony a7 iii with zeiss loxia 35 mm f2 and sony zeiss 55mm f1.8 mm lenses. i love street photography and shall be living in london for the next 3 years at least. i shall commute by walking and public transport. -----> i !!!  -----> do !!! -----> n’t !!!  know if -----> i !!!  should get a fuji x100f because -----> i !!!  fear that this may be a waste of money given that -----> i !!!  -----> do !!! -----> n’t !!!  -----> make !!!  money from photography. please, help me decide.", "sortedWord": "None", "Identifyer": null, "identifyer": 24928, "year": "2019"}, {"autor": "maxiu9", "date": "2019-10-13 13:33:03", "content": "Green flashes in EVF /!/ Hello! Long time photographer. I've had my Fuji X-T3 for a few weeks now (upgraded from X-T2). I've noticed that occasionally, like a few times every dozen frames, when using Continuous Low (5fps), when I take my finger off the shutter button halfway to stop shooting, I get either a) a momentary thick green bar across the top 1/5th of the EVF, or b) a quick green flash across the entire screen. It does not effect image quality, which makes me think it is solely on the EVF, or else happening on the sensor after the shot has been taken. Any ideas? It seems to happen whether or not the green horizon level is on. I can't make it happen on single shot/single servo. It happens with all batteries, cards, and lenses. No working theories at all. Anyone else experience this? I'd hate to return the camera but it is still an option at this point. Thanks for chiming in.", "link": "https://www.reddit.com/r/fujifilm/comments/dhamx7/green_flashes_in_evf/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "green flashes in evf /!/ hello! long time photographer. i've had my fuji x-t3 for a few weeks now (upgraded from x-t2). i've noticed that occasionally, like a few times every dozen frames, when using continuous low (5fps), when i take my finger off the shutter button halfway to stop shooting, i get either a) a momentary thick green bar across the top 1/5th of the evf, or b) a quick green flash across the entire screen. it does not effect image quality, which makes me think it is solely on the evf, or else happening on the sensor after the shot has been taken. any ideas? it seems to happen whether or not the green horizon level is on. -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it happen on single shot/single servo. it happens with all batteries, cards, and lenses. no working theories at all. anyone else experience this? i'd hate to return the camera but it is still an option at this point. thanks for chiming in.", "sortedWord": "None", "Identifyer": null, "identifyer": 25141, "year": "2019"}, {"autor": "criting", "date": "2019-11-15 16:42:49", "content": "Switching to Fuji /!/ Hi all. I'm thinking about switching to Fuji, but I'm wondering what camera will fit my needs. I have used full-frame(Nikon d750, Sony A7) and Sony a6300/a6400. My mine focus is street portraits, wide-angle portraits, sometimes more close up portraits, but it's mainly street ones. I've bee looking at the x-t2, but I was thinking, with my kind of usage, will x-t100 be enough for now, so I can invest in expensive lenses first. I've made the mistake before to buy an expensive body and then having the most expensive lens because I didn't have any money left..  Can someone share their point of view and help me decide which is the best way to go.\n\nThank you!", "link": "https://www.reddit.com/r/fujifilm/comments/dwtc0n/switching_to_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "switching to fuji /!/ hi all. i'm thinking about switching to fuji, but i'm wondering what camera will fit my needs. i have used full-frame(nikon d750, sony a7) and sony a6300/a6400. my mine focus is street portraits, wide-angle portraits, sometimes more close up portraits, but it's mainly street ones. i've bee looking at the x-t2, but i was thinking, with my kind of usage, will x-t100 be enough for now, so i can invest in expensive lenses first. -----> i !!! 've -----> made !!!  the mistake before to buy an expensive body and then having the most expensive lens because -----> i !!!  didn't have any money left..  can someone share their point of view and help me decide which is the best way to go.\n\nthank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 25501, "year": "2019"}, {"autor": "vandalxvisuals", "date": "2019-11-14 19:23:38", "content": "Does anyone know a decent amount about shooting video with Fujifilm? /!/ I recently started a Youtube channel and I have been tinkering more with my Fuji XT-1's video settings. The video quality is pretty decent I must say, especially for it being an older camera and not really meant for video. I have been playing around with custom settings to get the look/colours I want and it seemed to be going well. It took a couple of tries but I finally made a few custom settings I was happy with; one that was a flatter image for colour grading and another more standard image that I could use straight out of the body. My issue arises when I offload the footage onto my desktop or laptop. In short, the picture looks way different. Far more contrasted and saturated to the point where it doesn't resemble what I saw on my LCD whatsoever.\n\ntl;dr - When you make any sort of in-camera modifications like changing the DR, colour level, highlight/shadow tone, film simulation does that affect the picture when you film or only when you take pictures?", "link": "https://www.reddit.com/r/fujifilm/comments/dweeb8/does_anyone_know_a_decent_amount_about_shooting/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "does anyone know a decent amount about shooting video with fujifilm? /!/ i recently started a youtube channel and i have been tinkering more with my fuji xt-1's video settings. the video quality is pretty decent i must say, especially for it being an older camera and not really meant for video. i have been playing around with custom settings to get the look/colours i want and it seemed to be going well. it took a couple of tries but -----> i !!!  -----> finally !!!  -----> made !!!  a few custom settings -----> i !!!  was happy with; one that was a flatter image for colour grading and another more standard image that -----> i !!!  could use straight out of the body. my issue arises when i offload the footage onto my desktop or laptop. in short, the picture looks way different. far more contrasted and saturated to the point where it doesn't resemble what i saw on my lcd whatsoever.\n\ntl;dr - when you make any sort of in-camera modifications like changing the dr, colour level, highlight/shadow tone, film simulation does that affect the picture when you film or only when you take pictures?", "sortedWord": "None", "Identifyer": null, "identifyer": 25534, "year": "2019"}, {"autor": "ShinobiKrow", "date": "2019-06-02 09:11:43", "content": "Would the X-t100/X-t20 be an update over the D5500? /!/ I currently shoot with a D5500 and a 50mm 1.8. I would love to go a bit wider, but overall i'm happy with the set. I get nice, crisp images with good colors and cool bokeh. My priority is image quality and low light performance. I'm interested in going full frame eventually, but for now i'm staying with crop sensors. \n\n&amp;#x200B;\n\nNow, even though i like my D5500, i do wish it was a bit smaller. It's not a big camera but it's kind of fat when compared with the Fujifilm. General video could also be better. Especially the auto focus.\n\n&amp;#x200B;\n\nAnother problem i have with the D5500 is that there's no way you can nail manual focus. At least it is super hard. Images always turn out soft. This pretty much throws out of the window the possibility of buying some cool manual focus lens.\n\n&amp;#x200B;\n\nNow, if i sell my gear i might be able to afford either a used x-t20 or  a new x-t100. Eventually i would buy a fuji 35mm 1.4 but for now i might buy a cheap manual focus lens like the 7artisans. I could wait a bit more to sell my camera but my shutter count is already 7k in less than 1 year, and i'm afraid if i wait too long i might end up having an hard time selling the camera for a decent price. With Fuji film cameras i guess isn't much of a factor, but with Nikons buyers do take into consideration shutter count. \n\n&amp;#x200B;\n\nSo, do you think that if i bought either of these cameras and maybe a 7artisan just for start this could be considered an upgrade over what i have? I shoot mainly models and urban landscapes. \n\n&amp;#x200B;\n\nSome possible pros:\n\n&amp;#x200B;\n\n\\- Slightly better low light performance(in the t-20). Especially with a 1.2 lens. \n\n&amp;#x200B;\n\n\\- Better autofocus? Though in the first few months i wouldn't make use of it.\n\n&amp;#x200B;\n\n\\- Better video than the D5500?\n\n&amp;#x200B;\n\n\\- Smaller\n\n&amp;#x200B;\n\n\\- Better colors?\n\n&amp;#x200B;\n\nCons:\n\n&amp;#x200B;\n\n\\- Battery life\n\n&amp;#x200B;\n\n\\- Handling(D550 feels amazing in the hand)", "link": "https://www.reddit.com/r/fujifilm/comments/bvvkgc/would_the_xt100xt20_be_an_update_over_the_d5500/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "would the x-t100/x-t20 be an update over the d5500? /!/ i currently shoot with a d5500 and a 50mm 1.8. i would love to go a bit wider, but overall i'm happy with the set. i get nice, crisp images with good colors and cool bokeh. my priority is image quality and low light performance. i'm interested in going full frame eventually, but for now i'm staying with crop sensors. \n\n&amp;#x200b;\n\nnow, even though i like my d5500, i do wish it was a bit smaller. it's not a big camera but it's kind of fat when compared with the fujifilm. general video could also be better. especially the auto focus.\n\n&amp;#x200b;\n\nanother problem i have with the d5500 is that there's no way you can nail manual focus. at least it is super hard. images always turn out soft. this pretty much throws out of the window the possibility of buying some cool manual focus lens.\n\n&amp;#x200b;\n\nnow, if i sell my gear i might be able to afford either a used x-t20 or  a new x-t100. eventually i would buy a fuji 35mm 1.4 but for now i might buy a cheap manual focus lens like the 7artisans. i could wait a bit more to sell my camera but my shutter count is already 7k in less than 1 year, and i'm afraid if i wait too long i might end up having an hard time selling the camera for a decent price. with fuji film cameras i guess isn't much of a factor, but with nikons buyers do take into consideration shutter count. \n\n&amp;#x200b;\n\nso, do you think that if i bought either of these cameras and maybe a 7artisan just for start this could be considered an upgrade over what i have? i shoot mainly models and urban landscapes. \n\n&amp;#x200b;\n\nsome possible pros:\n\n&amp;#x200b;\n\n\\- slightly better low light performance(in the t-20). especially with a 1.2 lens. \n\n&amp;#x200b;\n\n\\- better autofocus? though in the first few months -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  use of it.\n\n&amp;#x200b;\n\n\\- better video than the d5500?\n\n&amp;#x200b;\n\n\\- smaller\n\n&amp;#x200b;\n\n\\- better colors?\n\n&amp;#x200b;\n\ncons:\n\n&amp;#x200b;\n\n\\- battery life\n\n&amp;#x200b;\n\n\\- handling(d550 feels amazing in the hand)", "sortedWord": "None", "Identifyer": null, "identifyer": 25555, "year": "2019"}, {"autor": "bdlflt", "date": "2019-07-10 20:19:06", "content": "Just got a used XF 27mm f2.8 (pancake) and XC 50-230mm - what do I need to know? /!/ I've had my eye on the 27mm for a while since I shoot a decent amount of candids when I'm out and about, especially with family and friends, and something at this length that is unobtrusive really piqued my interest. I'd been keeping my eye out for used deals and finally found one. In talking with the seller they said they had the XC 50-230 also and would cut a deal if I wanted both. I'm about to go on a trip so had been looking into renting some telephoto but did some quick research and decided I'd get both if they both worked well. They passed muster so here I am with both of these for just under $400... \nThis adds to my 18-55mm and the 7Artisans 55mm f1.4 for my X-T20. I wasn't planning on increasing my kit so much, and may end up getting rid of whichever lens I use the least. \nSo my questions are:\n\n\nWhat do I need to know shooting wildlife with the 50-230mm? \n\nWould you have grabbed this deal? (Aka I kind of made a more rapid decision regarding the 50-230mm than I am used to, so looking for additional feedback...)\n\nIf you were to bring 2 lenses on a trip to Pacific NW, which of mine would you bring? What about 3 lenses?\n\n\nThanks, love this sub for the inspirational photos, feedback, and wealth of info!", "link": "https://www.reddit.com/r/fujifilm/comments/cblvjk/just_got_a_used_xf_27mm_f28_pancake_and_xc/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i kind of made", "selectorShort": "make", "MarkedSent": "just got a used xf 27mm f2.8 (pancake) and xc 50-230mm - what do i need to know? /!/ i've had my eye on the 27mm for a while since i shoot a decent amount of candids when i'm out and about, especially with family and friends, and something at this length that is unobtrusive really piqued my interest. i'd been keeping my eye out for used deals and finally found one. in talking with the seller they said they had the xc 50-230 also and would cut a deal if i wanted both. i'm about to go on a trip so had been looking into renting some telephoto but did some quick research and decided i'd get both if they both worked well. they passed muster so here i am with both of these for just under $400... \nthis adds to my 18-55mm and the 7artisans 55mm f1.4 for my x-t20. i wasn't planning on increasing my kit so much, and may end up getting rid of whichever lens i use the least. \nso my questions are:\n\n\nwhat do i need to know shooting wildlife with the 50-230mm? \n\nwould you have grabbed this deal? (aka -----> i !!!  -----> kind !!!  -----> of !!!  -----> made !!!  a more rapid decision regarding the 50-230mm than -----> i !!!  am used to, so looking for additional feedback...)\n\nif you were to bring 2 lenses on a trip to pacific nw, which -----> of !!!  mine would you bring? what about 3 lenses?\n\n\nthanks, love this sub for the inspirational photos, feedback, and wealth of info!", "sortedWord": "None", "Identifyer": null, "identifyer": 25651, "year": "2019"}, {"autor": "nokton", "date": "2019-07-25 05:34:05", "content": "Hey y’all, I’m looking to get a camera basically and am torn between the X100F and the X Pro2. I like the fact that the X100F is compact and all but I fear that the fixed lens may be limiting. Help me make a decision!", "link": "https://www.reddit.com/r/fujifilm/comments/chjjim/hey_yall_im_looking_to_get_a_camera_basically_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "hey y’all, i’m looking to get a camera basically and am torn between the x100f and the x pro2. i like the fact that the x100f is compact and all but i fear that the fixed lens may be limiting. help -----> me !!!  -----> make !!!  a decision!", "sortedWord": "None", "Identifyer": null, "identifyer": 25764, "year": "2019"}, {"autor": "Nebeldiener", "date": "2019-07-24 19:40:01", "content": "Does my X-Pro2 have dead pixels? /!/ Hi,\n\nI bought a used X-Pro2 with the grip and the 27mm F/2.8 for 1k off  new price. The camera had about 2'000 shutter releases and still has  guarantee until August next year.\n\nThe seller wrote (translated from German to English): Superb condition, functions flawlessly, little use. I do have his address because there was the option to pick the camera up in person.\n\nYesterday I went shooting with the OVF. Back home in Lightroom I  realized that one picture had terrible white points (dead pixels?).\n\n&amp;#x200B;\n\n![img](o6sdyuihzac31 \"Full size\")\n\n&amp;#x200B;\n\n![img](oq6xtbdlzac31)\n\n&amp;#x200B;\n\n![img](3ca0rcjmzac31)\n\n&amp;#x200B;\n\n![img](k38y7ranzac31)\n\n I tried the \"Pixel Mapping\" and this seems to have helped a bit (didn't have time since then to go out shooting):   \n\n\n![img](49pxon0szac31)\n\n&amp;#x200B;\n\n![img](0fy67d0tzac31)\n\n&amp;#x200B;\n\n![img](bvqp0xstzac31)\n\n \n\nI previously only shot with M43 (G6, GX85, G85), so I don't know how the X-Trans sensor handles stuff like this.\n\nAre the dead pixel random? Is the camera having problem processing  the images? Shouldn't I be able to reproduce the \"dead\" pixels? After I shot the black picture with the whit line I restarted the camera and shot two new pictures but I'm not able tho find the white line in the new ones.\n\n&amp;#x200B;\n\nShould I live with that?  \nShould I make use of the guarantee?  \nShould I get back with the seller?\n\n&amp;#x200B;\n\nAnd if I make use of the guarantee, how do I make sure that the  camera reproduces the dead pixel while in repair? I don't want a case of  \"The camera seems fine. There is nothing to repair.\"  \nThe previous owner bought the camera in an online shop in Switzerland. They have 48 months guarantee  for everything. So the guarantee is handled by this online shop and not  directly by Fujifilm.\n\nOther than that the camera really works flawlessly.\n\nAny help is appreciated.", "link": "https://www.reddit.com/r/fujifilm/comments/chcw7x/does_my_xpro2_have_dead_pixels/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "does my x-pro2 have dead pixels? /!/ hi,\n\ni bought a used x-pro2 with the grip and the 27mm f/2.8 for 1k off  new price. the camera had about 2'000 shutter releases and still has  guarantee until august next year.\n\nthe seller wrote (translated from german to english): superb condition, functions flawlessly, little use. i do have his address because there was the option to pick the camera up in person.\n\nyesterday i went shooting with the ovf. back home in lightroom i  realized that one picture had terrible white points (dead pixels?).\n\n&amp;#x200b;\n\n![img](o6sdyuihzac31 \"full size\")\n\n&amp;#x200b;\n\n![img](oq6xtbdlzac31)\n\n&amp;#x200b;\n\n![img](3ca0rcjmzac31)\n\n&amp;#x200b;\n\n![img](k38y7ranzac31)\n\n i tried the \"pixel mapping\" and this seems to have helped a bit (didn't have time since then to go out shooting):   \n\n\n![img](49pxon0szac31)\n\n&amp;#x200b;\n\n![img](0fy67d0tzac31)\n\n&amp;#x200b;\n\n![img](bvqp0xstzac31)\n\n \n\ni previously only shot with m43 (g6, gx85, g85), so i don't know how the x-trans sensor handles stuff like this.\n\nare the dead pixel random? is the camera having problem processing  the images? shouldn't i be able to reproduce the \"dead\" pixels? after i shot the black picture with the whit line i restarted the camera and shot two new pictures but i'm not able tho find the white line in the new ones.\n\n&amp;#x200b;\n\nshould i live with that?  \nshould -----> i !!!  -----> make !!!  use of the guarantee?  \nshould i get back with the seller?\n\n&amp;#x200b;\n\nand if i make use of the guarantee, how do i make sure that the  camera reproduces the dead pixel while in repair? i don't want a case of  \"the camera seems fine. there is nothing to repair.\"  \nthe previous owner bought the camera in an online shop in switzerland. they have 48 months guarantee  for everything. so the guarantee is handled by this online shop and not  directly by fujifilm.\n\nother than that the camera really works flawlessly.\n\nany help is appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 25776, "year": "2019"}, {"autor": "Fkleppe", "date": "2019-06-12 19:01:39", "content": "AF does not work during video recording on XT-30 /!/ Hi you, I'm trying to record a video where I need the AF to work all the time during my video recording, but it just focuses right when the video starts and only if I press the \"record\" button again softly.\n\nHow can I make the camera to AF all the time during a recording? I have tried to change some of the settings but without any luck.", "link": "https://www.reddit.com/r/fujifilm/comments/bzv7ij/af_does_not_work_during_video_recording_on_xt30/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "af does not work during video recording on xt-30 /!/ hi you, i'm trying to record a video where i need the af to work all the time during my video recording, but it just focuses right when the video starts and only if i press the \"record\" button again softly.\n\nhow can -----> i !!!  -----> make !!!  the camera to af all the time during a recording? i have tried to change some of the settings but without any luck.", "sortedWord": "None", "Identifyer": null, "identifyer": 25927, "year": "2019"}, {"autor": "Bro-mo-sah-bee", "date": "2019-06-12 17:53:08", "content": "I made a wrist strap from a leather bracelet I haven't worn in years.", "link": "https://www.reddit.com/r/fujifilm/comments/bzudao/i_made_a_wrist_strap_from_a_leather_bracelet_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a wrist strap from a leather bracelet -----> i !!!  haven't worn in years.", "sortedWord": "None", "Identifyer": null, "identifyer": 25929, "year": "2019"}, {"autor": "Bro-mo-sah-bee", "date": "2019-06-12 17:50:39", "content": "I made a wrist strap from things a leather bracelet I haven't worn in years.", "link": "https://www.reddit.com/r/fujifilm/comments/bzuc9i/i_made_a_wrist_strap_from_things_a_leather/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a wrist strap from things a leather bracelet -----> i !!!  haven't worn in years.", "sortedWord": "None", "Identifyer": null, "identifyer": 25930, "year": "2019"}, {"autor": "ericcee613", "date": "2019-01-17 20:29:01", "content": "Fujifilm 27mm 2.8 vs 7artisans 25mm 1.8 /!/ So I made up my mind and decided that I’ll be picking up a lightly used XT1 this Friday. \n\nI’ve been debating over the Fuji 27mm or the 7artisans 25mm. I’m on a tight budget and that’s why the latter is appealing. \n\nI understand that the 7artisans is a ‘budget’ manual lens, and therefore lacks autofocus found in the Fuji lens, as well as has lesser IQ.\n\nShould I wait and save up money for the Fuji lens or hop on the 7artisans? ", "link": "https://www.reddit.com/r/fujifilm/comments/ah23ml/fujifilm_27mm_28_vs_7artisans_25mm_18/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "fujifilm 27mm 2.8 vs 7artisans 25mm 1.8 /!/ so -----> i !!!  -----> made !!!  up my mind and decided that -----> i !!! ’ll be picking up a lightly used xt1 this friday. \n\ni’ve been debating over the fuji 27mm or the 7artisans 25mm. i’m on a tight budget and that’s why the latter is appealing. \n\ni understand that the 7artisans is a ‘budget’ manual lens, and therefore lacks autofocus found in the fuji lens, as well as has lesser iq.\n\nshould i wait and save up money for the fuji lens or hop on the 7artisans? ", "sortedWord": "None", "Identifyer": null, "identifyer": 26062, "year": "2019"}, {"autor": "clairelions88", "date": "2019-01-16 13:40:28", "content": "Just bought 2 Meike lenses for 100€, did I make a mistake? /!/ I found the 25mm f1.8 and the 35mm f1.7 Meike lenses used for 100€, I'm just scared I won't be able to use them since they are manual.\n\nSomeone as any experience with them?", "link": "https://www.reddit.com/r/fujifilm/comments/agl87n/just_bought_2_meike_lenses_for_100_did_i_make_a/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "just bought 2 meike lenses for 100€, did -----> i !!!  -----> make !!!  a mistake? /!/ i found the 25mm f1.8 and the 35mm f1.7 meike lenses used for 100€, i'm just scared i won't be able to use them since they are manual.\n\nsomeone as any experience with them?", "sortedWord": "None", "Identifyer": null, "identifyer": 26071, "year": "2019"}, {"autor": "longerpath", "date": "2019-01-07 20:43:18", "content": "Not sure which lens to get? I made a cheatsheet comparing all popular X-Mount lenses (suggestions welcome!)", "link": "https://www.reddit.com/r/fujifilm/comments/adlznf/not_sure_which_lens_to_get_i_made_a_cheatsheet/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "not sure which lens to get? -----> i !!!  -----> made !!!  a cheatsheet comparing all popular x-mount lenses (suggestions welcome!)", "sortedWord": "None", "Identifyer": null, "identifyer": 26126, "year": "2019"}, {"autor": "TheAngryMister", "date": "2019-02-18 11:56:45", "content": "Exposure changes are very uneven in videos [X-T2] /!/ Whenever the exposure changes in video, the steps are very ungradual. This is killing some footage, especially where you slowly pan. I've tried various combinations of having some/all exposure settings on auto but the exposure changes are still very steppy. Are there any proper workarounds for this? I've tried making small incremental exposure changes in PP/AE to fix this, but that isn't very easy and takes time... Guess it's time for a software update, but will Fujifilm hear any of this?", "link": "https://www.reddit.com/r/fujifilm/comments/arwipz/exposure_changes_are_very_uneven_in_videos_xt2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i've tried making", "selectorShort": "make", "MarkedSent": "exposure changes are very uneven in videos [x-t2] /!/ whenever the exposure changes in video, the steps are very ungradual. this is killing some footage, especially where you slowly pan. i've tried various combinations of having some/all exposure settings on auto but the exposure changes are still very steppy. are there any proper workarounds for this? -----> i !!! 've -----> tried !!!  -----> making !!!  small incremental exposure changes in pp/ae to fix this, but that isn't very easy and takes time... guess it's time for a software update, but will fujifilm hear any of this?", "sortedWord": "None", "Identifyer": null, "identifyer": 26147, "year": "2019"}, {"autor": "wfjcc", "date": "2019-02-18 06:20:53", "content": "Autofocus while video recording x-a3 /!/ Hey guys, im having a hard time autofocusing on x-a3 during video recording. I need to focus stuff im showing in the video, for example I will talk on camera and then show a product infront of me. It wont fous on the product. What settings should I make to autofocus continuously through out the recording. Thanks in advance.", "link": "https://www.reddit.com/r/fujifilm/comments/aru6ff/autofocus_while_video_recording_xa3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "autofocus while video recording x-a3 /!/ hey guys, im having a hard time autofocusing on x-a3 during video recording. i need to focus stuff im showing in the video, for example i will talk on camera and then show a product infront of me. it wont fous on the product. what settings should -----> i !!!  -----> make !!!  to autofocus continuously through out the recording. thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 26148, "year": "2019"}, {"autor": "dylanjcole", "date": "2019-02-14 01:26:03", "content": "Coming from Olympus and have my sights set on the X-H1 for its IBIS. Can anyone try to change my mind before I make the jump?", "link": "https://www.reddit.com/r/fujifilm/comments/aqe81f/coming_from_olympus_and_have_my_sights_set_on_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "coming from olympus and have my sights set on the x-h1 for its ibis. can anyone try to change my mind before -----> i !!!  -----> make !!!  the jump?", "sortedWord": "None", "Identifyer": null, "identifyer": 26190, "year": "2019"}, {"autor": "654_321", "date": "2019-02-08 00:58:34", "content": "First Prime Lens Help /!/ I am looking to purchase my first prime lens. I am a new photographer and I mainly take pictures of friends, family, and catching candid moments. Sometimes I'll go out into the city and take some shots. I'm still practicing. I'm not looking to become a professional photographer but more of a hobbyist.\n\n&amp;#x200B;\n\nI am stuck between the 23mm, 35mm, and the 56mm. I probably won't be buying a new lens for a little while after this one so I want to make the best decision.", "link": "https://www.reddit.com/r/fujifilm/comments/aoazlm/first_prime_lens_help/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "first prime lens help /!/ i am looking to purchase my first prime lens. i am a new photographer and i mainly take pictures of friends, family, and catching candid moments. sometimes i'll go out into the city and take some shots. i'm still practicing. i'm not looking to become a professional photographer but more of a hobbyist.\n\n&amp;#x200b;\n\ni am stuck between the 23mm, 35mm, and the 56mm. -----> i !!!  probably won't be buying a new lens for a little while after this one so -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  the best decision.", "sortedWord": "None", "Identifyer": null, "identifyer": 26239, "year": "2019"}, {"autor": "thomaskoppel", "date": "2019-02-27 12:32:16", "content": "Do I have GAS or do I make a valid point? /!/ Ok. Hear me out. \n\n&amp;#x200B;\n\nI've been with the Fujifilm X mount system for the last two years and love it. My current set up is: 35mm f/1.4 (love it), Helios 44-2 58mm and the 18-55 mm f/2.8-4. (prev. owned the 23mm also)\n\n&amp;#x200B;\n\nI am contemplating weather or not I should add either the 16mm f/1.4 prime or the 16-55 f/2.8 zoom.\n\n&amp;#x200B;\n\n**In theory** I like the idea of having a bunch of primes and then swapping according to my use. However in reality I find it kind of a headache in a travel situation. I have no problem with a constrains of a prime in a daily shooting scenario, but when traveling (either for the weekend or 2-3 weeks at the time) the ease of a zoom is a big plus for me. \n\n&amp;#x200B;\n\nI therefore used my 18-55 f/2.8-4 lens on my last trip, but I have to admit that I am simply not that pleased with the pictures that lens produces. I know it's good and all that, but I wonder if the 16-55 f/2.8 would be a better all round lens for me in those scenarios + it is WR. \n\n&amp;#x200B;\n\nI have no problems with the size of the 16-55 f/2.8, and have a 3 weeks road trip to the US west coast coming up, and I honestly need a second opinion. The bodies I use is the X-H1 as a primary body and does 50/50 photo/video. The other body is the X-E3 which pairs nicely with the 35mm and my SO like to use that set-up. \n\n&amp;#x200B;\n\nThe questions in all this: 1) Have anyone else been in the situation that the prefer the results of using primes, but due ease chose to use the 16-55mm instead? 2) For those of you who own both the 18-55 and 16-55. How do you find the difference in use and output. ", "link": "https://www.reddit.com/r/fujifilm/comments/avczlu/do_i_have_gas_or_do_i_make_a_valid_point/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "do -----> i !!!  have gas or do -----> i !!!  -----> make !!!  a valid point? /!/ ok. hear me out. \n\n&amp;#x200b;\n\ni've been with the fujifilm x mount system for the last two years and love it. my current set up is: 35mm f/1.4 (love it), helios 44-2 58mm and the 18-55 mm f/2.8-4. (prev. owned the 23mm also)\n\n&amp;#x200b;\n\ni am contemplating weather or not i should add either the 16mm f/1.4 prime or the 16-55 f/2.8 zoom.\n\n&amp;#x200b;\n\n**in theory** i like the idea of having a bunch of primes and then swapping according to my use. however in reality i find it kind of a headache in a travel situation. i have no problem with a constrains of a prime in a daily shooting scenario, but when traveling (either for the weekend or 2-3 weeks at the time) the ease of a zoom is a big plus for me. \n\n&amp;#x200b;\n\ni therefore used my 18-55 f/2.8-4 lens on my last trip, but i have to admit that i am simply not that pleased with the pictures that lens produces. i know it's good and all that, but i wonder if the 16-55 f/2.8 would be a better all round lens for me in those scenarios + it is wr. \n\n&amp;#x200b;\n\ni have no problems with the size of the 16-55 f/2.8, and have a 3 weeks road trip to the us west coast coming up, and i honestly need a second opinion. the bodies i use is the x-h1 as a primary body and does 50/50 photo/video. the other body is the x-e3 which pairs nicely with the 35mm and my so like to use that set-up. \n\n&amp;#x200b;\n\nthe questions in all this: 1) have anyone else been in the situation that the prefer the results of using primes, but due ease chose to use the 16-55mm instead? 2) for those of you who own both the 18-55 and 16-55. how do you find the difference in use and output. ", "sortedWord": "None", "Identifyer": null, "identifyer": 26274, "year": "2019"}, {"autor": "bellapinkk", "date": "2019-04-10 05:29:57", "content": "X-Pro2 or X-T3 /!/ Hi, I'm somewhat of a novice shooter I've shot fairly extensively for the past five or six years, but I'm most entirely self taught, and I only have shot on film. I've been given a grant for a photojournalism trip abroad however, and I want to get a digital camera to use, partly because I'm weary of shooting an entire trip on film lest something goes wrong, and partly for future use because I don't want to be solely an analogue photographer. \n\n&amp;#x200B;\n\nI'm pretty keen on the X-Pro 2 or the X-T3 but I'm not really sure which one would be best, I'm leaning more towards the X-Pro 2 because I like the sleeker cleaner feel and I'm able to get it second hand so its a decent bit cheaper with the quotes I've gotten. I also like the OVF, coming from analogue photography I find it a little uncomfortable using the EVF however I do feel like the viewfinder on the X-T3 is better.. I just dont know how I feel about only having an electronic viewfinder. I also prefer the body's dials and button layout on the X-Pro2 more because it feels too cluttered on the X-T3. \n\n&amp;#x200B;\n\nReading back It feels like the X-Pro2 is what I'm leaning towards, but as people who know about shooting digitally (and photography in general) am I making a mistake? Most articles seem to push me to the X-T3 as did the camera store people but it feels clunky and I feel like the only thing I prefer about the X-T3 is the viewfinder if its in EVF mode..", "link": "https://www.reddit.com/r/fujifilm/comments/bbibaq/xpro2_or_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i making", "selectorShort": "make", "MarkedSent": "x-pro2 or x-t3 /!/ hi, i'm somewhat of a novice shooter i've shot fairly extensively for the past five or six years, but i'm most entirely self taught, and i only have shot on film. i've been given a grant for a photojournalism trip abroad however, and i want to get a digital camera to use, partly because i'm weary of shooting an entire trip on film lest something goes wrong, and partly for future use because i don't want to be solely an analogue photographer. \n\n&amp;#x200b;\n\ni'm pretty keen on the x-pro 2 or the x-t3 but i'm not really sure which one would be best, i'm leaning more towards the x-pro 2 because i like the sleeker cleaner feel and i'm able to get it second hand so its a decent bit cheaper with the quotes i've gotten. i also like the ovf, coming from analogue photography i find it a little uncomfortable using the evf however i do feel like the viewfinder on the x-t3 is better.. i just dont know how i feel about only having an electronic viewfinder. i also prefer the body's dials and button layout on the x-pro2 more because it feels too cluttered on the x-t3. \n\n&amp;#x200b;\n\nreading back it feels like the x-pro2 is what -----> i !!! 'm leaning towards, but as people who know about shooting digitally (and photography in general) am -----> i !!!  -----> making !!!  a mistake? most articles seem to push me to the x-t3 as did the camera store people but it feels clunky and i feel like the only thing i prefer about the x-t3 is the viewfinder if its in evf mode..", "sortedWord": "None", "Identifyer": null, "identifyer": 26394, "year": "2019"}, {"autor": "Sharesomeartsystuff", "date": "2019-08-13 13:45:51", "content": "Swap 23mm for 16mm /!/ Hi! I have the 23mm F1.4 and although I love the colors I’m a bit disappointed in the sharpness. I’ve found someone willing to trade their 16mm F1.4 for it and was wondering if anyone has experience from owning both. How do they compare in terms of AF and sharpness? Obviously the focal length are different enough that I might consider getting the 23mm F2 as well if I make the swap.", "link": "https://www.reddit.com/r/fujifilm/comments/cptczq/swap_23mm_for_16mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "swap 23mm for 16mm /!/ hi! i have the 23mm f1.4 and although i love the colors i’m a bit disappointed in the sharpness. i’ve found someone willing to trade their 16mm f1.4 for it and was wondering if anyone has experience from owning both. how do they compare in terms of af and sharpness? obviously the focal length are different enough that -----> i !!!  might consider getting the 23mm f2 as well if -----> i !!!  -----> make !!!  the swap.", "sortedWord": "None", "Identifyer": null, "identifyer": 26696, "year": "2019"}, {"autor": "Millennial-falcon-", "date": "2019-08-13 07:53:16", "content": "Primes? /!/ I just made the switch from canon and want new glass for my xt-3. I have the 16-55 f2.8 and want a fast prime specifically for bokeh and subject separation. I’ve heard the 1.4s are not great for video work which is my primary use. Would it be worth it to even buy a prime that only clicks one more stop to f2? Or would it be better to just sacrifice autofocus or possibly buy a manual 3rd party f1.4?", "link": "https://www.reddit.com/r/fujifilm/comments/cppx22/primes/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "primes? /!/ -----> i !!!  -----> just !!!  -----> made !!!  the switch from canon and want new glass for my xt-3. i have the 16-55 f2.8 and want a fast prime specifically for bokeh and subject separation. i’ve heard the 1.4s are not great for video work which is my primary use. would it be worth it to even buy a prime that only clicks one more stop to f2? or would it be better to just sacrifice autofocus or possibly buy a manual 3rd party f1.4?", "sortedWord": "None", "Identifyer": null, "identifyer": 26700, "year": "2019"}, {"autor": "croissantamande", "date": "2019-08-12 14:08:29", "content": "I'm sure this gets asked all the time but, x-T2 or x-T20? /!/ Hi all, \nI'm making the switch from Olympus (OMD10) to Fujifilm and can not decide between the X-T2 and X-T20.\nRight now there's a $150 difference between  a new x-T20 and a Fuji refurbished X-T2... After holding both in the store, I was leaning more towards the X-T2 because of the weather sealing but I like the smaller size, weight, and price of the x-T20. The x-T20 felt small but it is about the same size as the Olympus so with a leather half case I don't think it'll be fine.  I'm currently travelling in Australia and plan on using prime lenses. Any recommendations?", "link": "https://www.reddit.com/r/fujifilm/comments/cpcv0f/im_sure_this_gets_asked_all_the_time_but_xt2_or/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "i'm sure this gets asked all the time but, x-t2 or x-t20? /!/ hi all, \n-----> i !!! 'm -----> making !!!  the switch from olympus (omd10) to fujifilm and can not decide between the x-t2 and x-t20.\nright now there's a $150 difference between  a new x-t20 and a fuji refurbished x-t2... after holding both in the store, i was leaning more towards the x-t2 because of the weather sealing but i like the smaller size, weight, and price of the x-t20. the x-t20 felt small but it is about the same size as the olympus so with a leather half case i don't think it'll be fine.  i'm currently travelling in australia and plan on using prime lenses. any recommendations?", "sortedWord": "None", "Identifyer": null, "identifyer": 26713, "year": "2019"}, {"autor": "kotonoshi", "date": "2019-08-31 01:14:44", "content": "Canon SL2 to Fuji X-T20 w/ XC 16-55mm /!/ Hello! I've been looking at Fujifilm for a while now, and I've recently found an outstanding deal, specifically on the Fujifilm X-T20 with the 16-55mm for USD 450. I'm making this to ask if switching to the X-T20 will be more beneficial to me. I've always wanted to go mirrorless, as they tend to be way smaller than DSLRs and are easier to travel with, and I find Fuji's EVFs as a massive plus over a traditional viewfinder. I also want to be able to use all of Fuji's lenses, but I'm more concerned with whether or not the X-T20 will be a good step-up over the Canon SL2. I mainly do portraits and some street photography. Any insights and opinions are much appreciated! Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/cxpshq/canon_sl2_to_fuji_xt20_w_xc_1655mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "canon sl2 to fuji x-t20 w/ xc 16-55mm /!/ hello! i've been looking at fujifilm for a while now, and i've recently found an outstanding deal, specifically on the fujifilm x-t20 with the 16-55mm for usd 450. -----> i !!! 'm -----> making !!!  this to ask if switching to the x-t20 will be more beneficial to me. i've always wanted to go mirrorless, as they tend to be way smaller than dslrs and are easier to travel with, and i find fuji's evfs as a massive plus over a traditional viewfinder. i also want to be able to use all of fuji's lenses, but i'm more concerned with whether or not the x-t20 will be a good step-up over the canon sl2. i mainly do portraits and some street photography. any insights and opinions are much appreciated! thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 26847, "year": "2019"}, {"autor": "bigbigbutsmall", "date": "2019-10-23 19:39:51", "content": "will the xpro3 OVF work with the 18mm? /!/ Looks like they changed the magnification and I want to make sure I can still use my favorite lens :).", "link": "https://www.reddit.com/r/fujifilm/comments/dm4gvf/will_the_xpro3_ovf_work_with_the_18mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "will the xpro3 ovf work with the 18mm? /!/ looks like they changed the magnification and -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  can still use my favorite lens :).", "sortedWord": "None", "Identifyer": null, "identifyer": 27235, "year": "2019"}, {"autor": "lukeisme2474", "date": "2019-03-27 10:37:35", "content": "Adapting Canon FD 50mm f1.8D to FX? /!/ Has anyone done this? I read one thread on dpreview that said it was total garbage, so I wanted to make sure if that was true before I bought an adapter.", "link": "https://www.reddit.com/r/fujifilm/comments/b62v6n/adapting_canon_fd_50mm_f18d_to_fx/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "adapting canon fd 50mm f1.8d to fx? /!/ has anyone done this? -----> i !!!  read one thread on dpreview that said it was total garbage, so -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure if that was true before -----> i !!!  bought an adapter.", "sortedWord": "None", "Identifyer": null, "identifyer": 27273, "year": "2019"}, {"autor": "JTDubs23", "date": "2019-03-26 02:52:39", "content": "Decisions! My next lenses /!/ Loving my xt20 with the 18-55 but i love street photography and nature so what would be my next x series lenses i was thinking about the 27mm but i cant make decisions for the life of me.", "link": "https://www.reddit.com/r/fujifilm/comments/b5kdcu/decisions_my_next_lenses/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i cant make", "selectorShort": "make", "MarkedSent": "decisions! my next lenses /!/ loving my xt20 with the 18-55 but i love street photography and nature so what would be my next x series lenses i was thinking about the 27mm but -----> i !!!  -----> ca !!! -----> nt !!!  -----> make !!!  decisions for the life of me.", "sortedWord": "None", "Identifyer": null, "identifyer": 27290, "year": "2019"}, {"autor": "EirikHavre", "date": "2019-03-25 14:19:06", "content": "Why do some shortcuts on the X-T2 does not work? /!/ I want one of my buttons to let me change shutter type. But I cant make it work. On my X-T1 I used to have this function set to the Fn button on top. On my X-T2 I have tried that one and the \"arrow down\" button, if that makes sense. But pressing the button does nothing.\n\nWhat is happening? I'm probably missing something, but I dont know what.", "link": "https://www.reddit.com/r/fujifilm/comments/b5b91g/why_do_some_shortcuts_on_the_xt2_does_not_work/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i cant make", "selectorShort": "make", "MarkedSent": "why do some shortcuts on the x-t2 does not work? /!/ i want one of my buttons to let me change shutter type. but -----> i !!!  -----> ca !!! -----> nt !!!  -----> make !!!  it work. on my x-t1 i used to have this function set to the fn button on top. on my x-t2 i have tried that one and the \"arrow down\" button, if that makes sense. but pressing the button does nothing.\n\nwhat is happening? i'm probably missing something, but i dont know what.", "sortedWord": "None", "Identifyer": null, "identifyer": 27296, "year": "2019"}, {"autor": "NominalNom", "date": "2019-04-20 02:16:42", "content": "Can't get face/eye detection working /!/ Newbie X-T3 owner here, using it for video. I'm trying to get face/eye detect working but for the life of me I haven't been able to get the green box to come up around faces. I'm trying in 4K 24P video mode. Currently I'm just in face detect mode to keep things simple but am not getting the green box. Been trying for a few weeks on and off and just upgraded to firmware 3.00 too. This just seems really strange and I must be making a super basic mistake. Tried with the 18-55mm kit lens and the XF35mm f1.4, and I'm in continuous autofocus mode. Looked online for tutorials, read the manual, and there don't seem to be any specific steps beyond what I've already tried. Cheers for any insight.", "link": "https://www.reddit.com/r/fujifilm/comments/bf7djy/cant_get_faceeye_detection_working/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i must be making", "selectorShort": "make", "MarkedSent": "can't get face/eye detection working /!/ newbie x-t3 owner here, using it for video. i'm trying to get face/eye detect working but for the life of me i haven't been able to get the green box to come up around faces. i'm trying in 4k 24p video mode. currently i'm just in face detect mode to keep things simple but am not getting the green box. been trying for a few weeks on and off and just upgraded to firmware 3.00 too. this just seems really strange and -----> i !!!  -----> must !!!  -----> be !!!  -----> making !!!  a super basic mistake. tried with the 18-55mm kit lens and the xf35mm f1.4, and i'm in continuous autofocus mode. looked online for tutorials, read the manual, and there don't seem to be any specific steps beyond what i've already tried. cheers for any insight.", "sortedWord": "None", "Identifyer": null, "identifyer": 27358, "year": "2019"}, {"autor": "viewtifuljer", "date": "2019-05-26 16:35:51", "content": "Shooting ONLY in JPEG? /!/ Does anyone have experience shooting only in JPEG with their Fuji camera? I'm thinking about making the move to JPEG only, and here's my rationale:\n\n1. **TIME:** I like messing around with photos in Lightroom, but ultimately find that the post-processing process is what stops me from *doing* anything with my photos. JPEG only would allow me to do more with them.\n2. **CONVENIENCE**: I *can* still mess around with my photos in Lightroom. I've been impressed with how much I can move or recover lost values even in my JPEGS.\n3. **X-TRANS/LIGHTROOM ISSUES:** Though probably overblown, the sharpening issues are annoying, and I *love* how the JPEGs look right out of the camera.\n\nCan anyone support or debunk any of my reasoning? Should I make the switch? Has anyone else?", "link": "https://www.reddit.com/r/fujifilm/comments/bt9zj3/shooting_only_in_jpeg/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "shooting only in jpeg? /!/ does anyone have experience shooting only in jpeg with their fuji camera? i'm thinking about making the move to jpeg only, and here's my rationale:\n\n1. **time:** i like messing around with photos in lightroom, but ultimately find that the post-processing process is what stops me from *doing* anything with my photos. jpeg only would allow me to do more with them.\n2. **convenience**: i *can* still mess around with my photos in lightroom. i've been impressed with how much i can move or recover lost values even in my jpegs.\n3. **x-trans/lightroom issues:** though probably overblown, the sharpening issues are annoying, and i *love* how the jpegs look right out of the camera.\n\ncan anyone support or debunk any of my reasoning? should -----> i !!!  -----> make !!!  the switch? has anyone else?", "sortedWord": "None", "Identifyer": null, "identifyer": 27582, "year": "2019"}, {"autor": "ccddhh", "date": "2019-07-01 12:03:27", "content": "Shooting a conference (1hr30) on my XT-3. Can I plug into a mains socket? /!/ So I won’t be continuously recording (I’ll take breaks between each speaker) but the camera will need to be on for 90 minutes. \n\nWould it be possible to plug in the battery grip and run the camera from a standard wall wart? \n\nI have three batteries but I need to make sure the camera doesn’t cut out at all.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/c7rq60/shooting_a_conference_1hr30_on_my_xt3_can_i_plug/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": "shooting a conference (1hr30) on my xt-3. can i plug into a mains socket? /!/ so i won’t be continuously recording (i’ll take breaks between each speaker) but the camera will need to be on for 90 minutes. \n\nwould it be possible to plug in the battery grip and run the camera from a standard wall wart? \n\ni have three batteries but -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  sure the camera doesn’t cut out at all.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 27651, "year": "2019"}, {"autor": "Wolfi23", "date": "2019-01-04 07:51:18", "content": "What is better for me. XT-1 or XT-2? /!/ Hey! I am selling my beginner nikon gear right now because I want to get better in quality and more professional. I got a chance at a company to make portraits of the people who work there, and later I would like to make more work like this. Next to portraits I like to take pictures at events and maybe family portraits. \n\nI am between the XT-1 and the XT-2 and my problem is money. I would like to buy to the camera a decent lens to start with and I bought an adapter alredy (M42 to FX) for older fixed lenses for portrait like those helios lenses.  \n\nFor the lens I dont know which one to choose, 16-55 f/2.8 is the most expensive, but I could use it perfectly on events and also when the company would like a wider shot of the people working or so. (Now I have a Tamron 17-50 f/2.8 and I love it actually). I heard that the 18-55 is very good too. The other lenses are the 23mm f/2 and the 35mm f/1.4.\n\nIf i can get the lens cheap I could buy the XT-2 or when somebody could show me that it is much better than the 1. \n\nThe prices near me are currently something like:\nXT-1 ~ 350-400€ -My friend is selling one in        relly good condition\nXT-2 ~ 700-800€\n\n16-55 ~ 800€\n17-55 ~ 300€\n35 1.4 ~ 600€ (new)\n23 2 ~ 500€ (new)       -I didn't found any used\n\nMy budget is about 1500€ and I will need a flashlight too.\n\nI just want your opinion or if you did something similar like me please write it down. What were it like for you. What did you go with. Was it easy to get some money at the start. etc.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/acfzi0/what_is_better_for_me_xt1_or_xt2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i would like to make", "selectorShort": "make", "MarkedSent": "what is better for me. xt-1 or xt-2? /!/ hey! i am selling my beginner nikon gear right now because i want to get better in quality and more professional. -----> i !!!  got a chance at a company -----> to !!!  -----> make !!!  portraits of the people who work there, and later -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  more work -----> like !!!  this. next to portraits i like to take pictures at events and maybe family portraits. \n\ni am between the xt-1 and the xt-2 and my problem is money. i would like to buy to the camera a decent lens to start with and i bought an adapter alredy (m42 to fx) for older fixed lenses for portrait like those helios lenses.  \n\nfor the lens i dont know which one to choose, 16-55 f/2.8 is the most expensive, but i could use it perfectly on events and also when the company would like a wider shot of the people working or so. (now i have a tamron 17-50 f/2.8 and i love it actually). i heard that the 18-55 is very good too. the other lenses are the 23mm f/2 and the 35mm f/1.4.\n\nif i can get the lens cheap i could buy the xt-2 or when somebody could show me that it is much better than the 1. \n\nthe prices near me are currently something like:\nxt-1 ~ 350-400€ -my friend is selling one in        relly good condition\nxt-2 ~ 700-800€\n\n16-55 ~ 800€\n17-55 ~ 300€\n35 1.4 ~ 600€ (new)\n23 2 ~ 500€ (new)       -i didn't found any used\n\nmy budget is about 1500€ and i will need a flashlight too.\n\ni just want your opinion or if you did something similar like me please write it down. what were it like for you. what did you go with. was it easy to get some money at the start. etc.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 27773, "year": "2019"}, {"autor": "InsomniacAvocado", "date": "2019-01-02 02:59:48", "content": "Fuji telephoto options for landscape photography /!/ Hi All, \n\nThanks to some of the assuring and positive responses from users in this forum I made the switch to Fuji X system. \n\nI’m looking for opinions or reviews on a sharp telephoto lens option for shooting landscapes.\n\nIs XF 55 - 200 the only option in this case?\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/abp4v7/fuji_telephoto_options_for_landscape_photography/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "fuji telephoto options for landscape photography /!/ hi all, \n\nthanks to some of the assuring and positive responses from users in this forum -----> i !!!  -----> made !!!  the switch to fuji x system. \n\ni’m looking for opinions or reviews on a sharp telephoto lens option for shooting landscapes.\n\nis xf 55 - 200 the only option in this case?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 27784, "year": "2019"}, {"autor": "nerwin802", "date": "2019-08-08 14:43:23", "content": "Feeling stressed about gear /!/ Hello everyone, I'm a first time reddit user. Though I've been stalking the Fujifilm subreddit for quite some time. Looks like a great community and I thought maybe someone here has went through something similar that I'm going through as of right now. \n\nA couple years ago I switched from Nikon to Fujifilm, mainly because of the weight reduction and to make photography more fun by bringing the camera with me more often (which hasn't been true). I also wanted better video capabilities for my YouTube channel. \n\nSo I had the Nikon D610, 20 1.8G, 50 1.8G and the 70-200 f/4 VR all which I absolutely loved and just made sense to me. I had fun with it but at the time I decided to make the switch I was getting kind of bored with it. I don't know why. I just wasn't \"seeing\" things anymore.\n\nI made a change of camera equipment for the reasons stated above in hopes that maybe it spark my interest and it did spark my interest again. I had a blast throughout 2018 shooting with my new Fuji system.  But yet here we are at nearly the end of 2019 (this year gone by TOO fast) and I'm feeling the same way I did when I had my Nikon system. Like I'm just not having fun anymore.\n\nI've bought and sold many, many Fujifilm lenses. I've owned the 35 f/2, same with the 23 f/2. I've sold the 18-55 and then bought it again and thinking about selling it again. I've bought the 10-24 and then sold it (although it was because of money issues), I've also bought the 35 1.4, didn't like it much and got rid of it a couple months later. I bought the 60 2.4 macro when I first got my XT2 kit and still have it now. A lot of my best photos were taken with that lens but I'm kind of bored of it now and hate the mechanics of it. The lens has pissed me off more than once. I even bought a cheap Meike manual focus lens but found it meh. Just recently I bought the Rokinon 12mm f/2 and I hate it. I can't stand the sunstars it creates, horrible and distracting. Although, the lens is amazing for astrophotography which I rarely do. I also miss having the 10-24 for that crazy UWA distortion at 10mm, its something I haven't experienced before. \n\nSo currently in my bag I have a XT2, 18-55, 23 f/2, 60 2.4 and the Rokinon 12mm f/2. Sounds like a well rounded kit, right? It is honestly. It shouldn't hinder my creativity at all, but every single time I feel like I want to go out and shoot, I never know what lens to use and I ended up getting stressed over the decision or wish I had brought something else or wish I had this bought this lens instead or whatever.\n\nI just feel like my passion and interest in photography is slipping away. I want to have fun with creating photographs again. It's always been a way of therapy for me as I deal with depression. Lately its been making me further depressed. Once in a while I'll have a good day or two when I actually enjoy shooting but those days are getting far and far less.\n\nI've thought about just selling it all and picking up a X100F and just rolling with that for a while and shoot the heck out of it and maybe I'll find my way again. I also thought about just taking a break from photography and focusing on other projects in the meantime and maybe it will come back to me when the time is right or maybe it just won't. Yet others also said to just keep pushing through.\n\nThe issue is being a generalist, I don't have one particular subject I enjoy shooting. I like shooting anything that sparks my interest and lately it hasn't been much.\n\nI know for a lot of photographers who switched to Fujifilm really made them have fun with photography again and that was my intent when I switched but it only worked for a year. I don't if it's just time for another change or I'm stressing out over the gear that I have and neglect sometimes? Lately I seem to be only using the 23 f/2. \n\nI'm hoping others have been through something similar and could give me advice on what you did that helped. Anything would be appreacited and I want to thank you for reading this long post. Just felt like something I wanted to get off my chest and clear my mind a little bit. Also would make me feel better known that others out there have been through something like this too.", "link": "https://www.reddit.com/r/fujifilm/comments/cnmq1g/feeling_stressed_about_gear/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i decided to make", "selectorShort": "make", "MarkedSent": "feeling stressed about gear /!/ hello everyone, i'm a first time reddit user. though i've been stalking the fujifilm subreddit for quite some time. looks like a great community and i thought maybe someone here has went through something similar that i'm going through as of right now. \n\na couple years ago i switched from nikon to fujifilm, mainly because of the weight reduction and to make photography more fun by bringing the camera with me more often (which hasn't been true). i also wanted better video capabilities for my youtube channel. \n\nso i had the nikon d610, 20 1.8g, 50 1.8g and the 70-200 f/4 vr all which i absolutely loved and just made sense to me. -----> i !!!  had fun with it but at the time -----> i !!!  -----> decided !!!  -----> to !!!  -----> make !!!  the switch -----> i !!!  was getting kind of bored with it. i don't know why. i just wasn't \"seeing\" things anymore.\n\ni made a change of camera equipment for the reasons stated above in hopes that maybe it spark my interest and it did spark my interest again. i had a blast throughout 2018 shooting with my new fuji system.  but yet here we are at nearly the end of 2019 (this year gone by too fast) and i'm feeling the same way i did when i had my nikon system. like i'm just not having fun anymore.\n\ni've bought and sold many, many fujifilm lenses. i've owned the 35 f/2, same with the 23 f/2. i've sold the 18-55 and then bought it again and thinking about selling it again. i've bought the 10-24 and then sold it (although it was because of money issues), i've also bought the 35 1.4, didn't like it much and got rid of it a couple months later. i bought the 60 2.4 macro when i first got my xt2 kit and still have it now. a lot of my best photos were taken with that lens but i'm kind of bored of it now and hate the mechanics of it. the lens has pissed me off more than once. i even bought a cheap meike manual focus lens but found it meh. just recently i bought the rokinon 12mm f/2 and i hate it. i can't stand the sunstars it creates, horrible and distracting. although, the lens is amazing for astrophotography which i rarely do. i also miss having the 10-24 for that crazy uwa distortion at 10mm, its something i haven't experienced before. \n\nso currently in my bag i have a xt2, 18-55, 23 f/2, 60 2.4 and the rokinon 12mm f/2. sounds like a well rounded kit, right? it is honestly. it shouldn't hinder my creativity at all, but every single time i feel like i want to go out and shoot, i never know what lens to use and i ended up getting stressed over the decision or wish i had brought something else or wish i had this bought this lens instead or whatever.\n\ni just feel like my passion and interest in photography is slipping away. i want to have fun with creating photographs again. it's always been a way of therapy for me as i deal with depression. lately its been making me further depressed. once in a while i'll have a good day or two when i actually enjoy shooting but those days are getting far and far less.\n\ni've thought about just selling it all and picking up a x100f and just rolling with that for a while and shoot the heck out of it and maybe i'll find my way again. i also thought about just taking a break from photography and focusing on other projects in the meantime and maybe it will come back to me when the time is right or maybe it just won't. yet others also said to just keep pushing through.\n\nthe issue is being a generalist, i don't have one particular subject i enjoy shooting. i like shooting anything that sparks my interest and lately it hasn't been much.\n\ni know for a lot of photographers who switched to fujifilm really made them have fun with photography again and that was my intent when i switched but it only worked for a year. i don't if it's just time for another change or i'm stressing out over the gear that i have and neglect sometimes? lately i seem to be only using the 23 f/2. \n\ni'm hoping others have been through something similar and could give me advice on what you did that helped. anything would be appreacited and i want to thank you for reading this long post. just felt like something i wanted to get off my chest and clear my mind a little bit. also would make me feel better known that others out there have been through something like this too.", "sortedWord": "None", "Identifyer": null, "identifyer": 27928, "year": "2019"}, {"autor": "SnekLord666", "date": "2019-12-13 08:00:50", "content": "X-T100 Eye Sensor Issues /!/ Hi Everyone.   \n\n\nI've had my X-T100 since January, and recently the eye sensor has started bugging out. Whenever I'm in a EVF/LCD mode that should split between them, the eye sensor initially realises I don't have my face up top it. Then as soon as I bring it to my face, it will switch into EVF as it should, but then it stays there. the only way I can get it back into LCD after removing my face is to put it on LCD only. switching back to an eye sensor base mode automatically puts it back into EVF without me triggering it. This is incredibly frustrating. I have made sure there's no dust on the sensor or anything, have tried updating firmware, but i was already up to date, have tried a reset with no luck (although couldn't find a way to do proper factory reset or rollback the firmware and reinstall).\n\n&amp;#x200B;\n\nSending in for warranty repair would be difficult as I am currently not in my country of purchase and wont be back for a few months at least.  \n\n\nHas anyone else had this issue?   \n\n\nAny recommendations much appreciated.", "link": "https://www.reddit.com/r/fujifilm/comments/ea15ul/xt100_eye_sensor_issues/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "x-t100 eye sensor issues /!/ hi everyone.   \n\n\ni've had my x-t100 since january, and recently the eye sensor has started bugging out. whenever i'm in a evf/lcd mode that should split between them, the eye sensor initially realises i don't have my face up top it. then as soon as i bring it to my face, it will switch into evf as it should, but then it stays there. the only way i can get it back into lcd after removing my face is to put it on lcd only. switching back to an eye sensor base mode automatically puts it back into evf without me triggering it. this is incredibly frustrating. -----> i !!!  -----> have !!!  -----> made !!!  sure there's no dust on the sensor or anything, -----> have !!!  tried updating firmware, but -----> i !!!  was already up to date, -----> have !!!  tried a reset with no luck (although couldn't find a way to do proper factory reset or rollback the firmware and reinstall).\n\n&amp;#x200b;\n\nsending in for warranty repair would be difficult as i am currently not in my country of purchase and wont be back for a few months at least.  \n\n\nhas anyone else had this issue?   \n\n\nany recommendations much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 28008, "year": "2019"}, {"autor": "enigmaticjas", "date": "2019-11-28 06:31:21", "content": "XT-3 + Power Grip + 18-55 + 55-20 bundle /!/ So I think I’ll finally make the switch from my Sony A6500 to Fujifilm. \n\nI noticed a great Black Friday deal on Wed (uk) including the XT-3 + Power Grip for £999 after a £180 rebate or the aforementioned with the 18-55 and 55-200 lenses for £1819 after rebate. \n\nWas wondering your guys thoughts on this deal?", "link": "https://www.reddit.com/r/fujifilm/comments/e2u0bl/xt3_power_grip_1855_5520_bundle/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ll finally make", "selectorShort": "make", "MarkedSent": "xt-3 + power grip + 18-55 + 55-20 bundle /!/ so -----> i !!!  think -----> i !!! -----> ’ll !!!  -----> finally !!!  -----> make !!!  the switch from my sony a6500 to fujifilm. \n\ni noticed a great black friday deal on wed (uk) including the xt-3 + power grip for £999 after a £180 rebate or the aforementioned with the 18-55 and 55-200 lenses for £1819 after rebate. \n\nwas wondering your guys thoughts on this deal?", "sortedWord": "None", "Identifyer": null, "identifyer": 28176, "year": "2019"}, {"autor": "inamsterdamforaweek", "date": "2019-04-04 13:03:07", "content": "How to improve? /!/ Hey all,\n\nI'm working with my camera a lot these days and I just had a mini-session with food for a friend's business. We tried to do some quality food shots. Now x100 might not be perfect for this but I still think Igot some great shots.\n\nHowever, I missed a ton or some were just not right..color was off..and more importantly the focus was super weird.\n\nIn some cases, it just FEELS wrong but I can't really point as to why..\n\nNow the question is how do I get some feedback or how do I learn to use the camera better.\n\nExample:\n\nAF-S: I was under the impression that I can lock the focus on S and just shoot but when I did this most of the photos where unfocused and bleah.\n\nExposure; can I even lock exposure? Should I?\n\nI'm trying to make more shots without always checking lcd so I can get in a flow.\n\nLastly: moving people. Can this camera even take good photos of people who are on the move? I figured that maybe very high shutter is the solution and very good lighting or else.. but even so, the focus is all over the place.\n\nI was a bit disappointed when I got home to look at the shots...", "link": "https://www.reddit.com/r/fujifilm/comments/b9cfsa/how_to_improve/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm trying to make", "selectorShort": "make", "MarkedSent": "how to improve? /!/ hey all,\n\ni'm working with my camera a lot these days and i just had a mini-session with food for a friend's business. we tried to do some quality food shots. now x100 might not be perfect for this but i still think igot some great shots.\n\nhowever, i missed a ton or some were just not right..color was off..and more importantly the focus was super weird.\n\nin some cases, it just feels wrong but i can't really point as to why..\n\nnow the question is how do i get some feedback or how do i learn to use the camera better.\n\nexample:\n\naf-s: i was under the impression that i can lock the focus on s and just shoot but when i did this most of the photos where unfocused and bleah.\n\nexposure; can i even lock exposure? should i?\n\n-----> i !!! 'm -----> trying !!!  -----> to !!!  -----> make !!!  more shots without always checking lcd so -----> i !!!  can get in a flow.\n\nlastly: moving people. can this camera even take good photos of people who are on the move? i figured that maybe very high shutter is the solution and very good lighting or else.. but even so, the focus is all over the place.\n\ni was a bit disappointed when i got home to look at the shots...", "sortedWord": "None", "Identifyer": null, "identifyer": 28280, "year": "2019"}, {"autor": "inamsterdamforaweek", "date": "2019-04-01 08:56:04", "content": "Taming the X100 - as a super noob! /!/ Hello all!!\n\nI finally made the jump into \"cameras\" and bought a SH x100. I read a lot of good reviews online for a camera this old on Youtube and online so I figured for 250$ is a good entry. \n\nNow, I have/had some doubts. My friends told me is not worth it and I'd be better off buying and iPhone X ( currently have an 6s) and that buying an old point and shoot camera in 2019 is retarded.\n\nOh well.\n\nNow..I must prove them wrong!\n\n&amp;#x200B;\n\nI already started to play with it, watched some tutorials and even made some good photos that I feel no way could have been taken with my iPhone. But it is quirky and weird and confusing. Anyone has any experience.advice or maybe there is some magic blog with more instructions?\n\n&amp;#x200B;\n\nI am super confused by the focus. Should I keep it on Manual or AF-S? I know there's a button that auto-focuses but today I shot on AF-S and I just didn't feel that I could direct the focus where I wanted it. It did focus on some good points at times but..didn't feel in control. \n\n&amp;#x200B;\n\nSecondly, I FINALLY...figured how to do Apperture priority ( just set the shutter to A right?) but what are the other letters-shutter settings and when to use them?! \n\n&amp;#x200B;\n\nAs for the apperture..I gotta say I notice almost no difference from going to 2.8--&gt;8. I will read more on this.\n\n&amp;#x200B;\n\nLastly: colors. I like more vibrant warm colors and when I shoot in \"film\" they do get so - maybe a little too much - but I can't seem to make vibrant photos with normal shooting. I feel they are a little bland...\n\n&amp;#x200B;\n\nMy main focus is portraits and street photography and food photography. Is what I find myself attracted to. \n\nI think this could be great for \"face\" portrait and I already took some pretty nice one. but for \"whole human\" photos ( including clothes, dogs, etc, fashion) I'm not sure if I can get close enough to see details but not \"cut\" the person with this 35mm lenses. I'll have to experiment more but I'm sure people already did this 1000 times and I'd like to read what they figure but couldn't find something specific yet.\n\n&amp;#x200B;\n\nOk, long post! Sorry! and thank you!!", "link": "https://www.reddit.com/r/fujifilm/comments/b7zogf/taming_the_x100_as_a_super_noob/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "taming the x100 - as a super noob! /!/ hello all!!\n\n-----> i !!!  -----> finally !!!  -----> made !!!  the jump into \"cameras\" and bought a sh x100. i read a lot of good reviews online for a camera this old on youtube and online so i figured for 250$ is a good entry. \n\nnow, i have/had some doubts. my friends told me is not worth it and i'd be better off buying and iphone x ( currently have an 6s) and that buying an old point and shoot camera in 2019 is retarded.\n\noh well.\n\nnow..i must prove them wrong!\n\n&amp;#x200b;\n\ni already started to play with it, watched some tutorials and even made some good photos that i feel no way could have been taken with my iphone. but it is quirky and weird and confusing. anyone has any experience.advice or maybe there is some magic blog with more instructions?\n\n&amp;#x200b;\n\ni am super confused by the focus. should i keep it on manual or af-s? i know there's a button that auto-focuses but today i shot on af-s and i just didn't feel that i could direct the focus where i wanted it. it did focus on some good points at times but..didn't feel in control. \n\n&amp;#x200b;\n\nsecondly, i finally...figured how to do apperture priority ( just set the shutter to a right?) but what are the other letters-shutter settings and when to use them?! \n\n&amp;#x200b;\n\nas for the apperture..i gotta say i notice almost no difference from going to 2.8--&gt;8. i will read more on this.\n\n&amp;#x200b;\n\nlastly: colors. i like more vibrant warm colors and when i shoot in \"film\" they do get so - maybe a little too much - but i can't seem to make vibrant photos with normal shooting. i feel they are a little bland...\n\n&amp;#x200b;\n\nmy main focus is portraits and street photography and food photography. is what i find myself attracted to. \n\ni think this could be great for \"face\" portrait and i already took some pretty nice one. but for \"whole human\" photos ( including clothes, dogs, etc, fashion) i'm not sure if i can get close enough to see details but not \"cut\" the person with this 35mm lenses. i'll have to experiment more but i'm sure people already did this 1000 times and i'd like to read what they figure but couldn't find something specific yet.\n\n&amp;#x200b;\n\nok, long post! sorry! and thank you!!", "sortedWord": "None", "Identifyer": null, "identifyer": 28316, "year": "2019"}, {"autor": "TintaTonti", "date": "2019-10-01 07:51:01", "content": "X-T30 with 15-45mm kit /!/ I am new to the camera world. I was shopping around for my class program. My budget was $1,299 Canadian. Is X-T30 with 15-45mm good kit? I had the choice to either buy X-T20 with 18-55mm or X-T30 with 15-45mm as both are at the same price. I bought X-T30 with 15-45mm kit. Did I make the right choice? \n\n\nFujifilm X-T30 Mirrorless Camera with 15-45mm OIS PZ Lens Kit - Silver $1,299\n\n\nFujifilm X-T20 Mirrorless Kit Silver w/XF 18-55mm f/2.8-4.0 R LM OIS Lens $1,299\n\n\nFujifilm X-T30 Mirrorless Kit Silver w/XF 18-55mm f/2.8-4.0 R LM OIS Lens $1,699", "link": "https://www.reddit.com/r/fujifilm/comments/dbq00e/xt30_with_1545mm_kit/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x-t30 with 15-45mm kit /!/ i am new to the camera world. i was shopping around for my class program. my budget was $1,299 canadian. is x-t30 with 15-45mm good kit? i had the choice to either buy x-t20 with 18-55mm or x-t30 with 15-45mm as both are at the same price. i bought x-t30 with 15-45mm kit. did -----> i !!!  -----> make !!!  the right choice? \n\n\nfujifilm x-t30 mirrorless camera with 15-45mm ois pz lens kit - silver $1,299\n\n\nfujifilm x-t20 mirrorless kit silver w/xf 18-55mm f/2.8-4.0 r lm ois lens $1,299\n\n\nfujifilm x-t30 mirrorless kit silver w/xf 18-55mm f/2.8-4.0 r lm ois lens $1,699", "sortedWord": "None", "Identifyer": null, "identifyer": 28415, "year": "2019"}, {"autor": "iwannacameragetphoto", "date": "2019-03-20 02:59:26", "content": "XT-20 New User Questions /!/ Hi All,\n\nI've posted here a few time, I recently purchased a Fuji XT-20, I have been loving it so far but have an assortment of questions i'm hoping I can get some help with.  Sorry is this is alot or these seem basic, im just struggling a bit with the amount of things I feel like I dont know.  Feel free to answer as many as you can/would like to.\n\n*So far I've been shooting jpegs just because I wanted to experiment a bit without diving into RAW.  I have Capture One for editing, (more so when I start messing around with raw) are there meaningful edits I can make with Jpegs? I've been messing around with a few a bit and i'm struggling with what exactly to do.  Are there certain adjustments that should be made everytime that are pretty standard? Are there certain edits that should be made taking into account what type of camera and lens combo you are using/focal length?  Or is it really by individual photo?  Is there a good guide for making adjustments to photos that someone can point me to?  Not just a how to, but also why.  Like how to adjust something, but also how to recognize what needs to be adjusted in a photo, and why that adjustment produces a better image.\n\n*I would like to start shooting Jpeg+RAW so I can start messing around with RAW.  My understanding of RAW is that it saves more image data so that you have more info with which to work with/edit later?  How much time editing does this require?  Is there a workflow or common set of setting that you can apply to all your RAW photos when you download them from your camera? Is RAW that much better than Jpeg?  Or does it depend on the image/how you are shooting?\n\n*Is anyone aware of just a general XT-20 guide (bonus for info about using XF18-55mm) beyond just the standard Fuji manual?\n\nCamera Gear and such\n*Camera came with a micro sd card in a standard sd adapter.  Is there any reason to use a micro?  I would like to pick up a second SD card, at lest 64gb but preferably 128gb.  What is a good card?  I was looking at the san disk extreme pro SDXC.\n\n*Is there any sort of regular maintenance I need to do with the camera?  Is there any reason that I should ever clean the sensor?  Any particular way I should be cleaning the lenses?\n\n*Is there any other \"must have\" gear that you would recommend?  I already have a small camera bag and L plate grip.  I'm interested in getting a adjustable camera strap that I can switch from wearing high up on my chest to around my hip, seems like the peak straps are pretty popular.  I'm also interested in a small packable tripod, just something I can use to set up for time lapse and such, any recommendations?   Any thoughts on value of thumb grips, shutter buttons?\n\nThanks for the help everyone!  I'm really enjoying the camera so far!", "link": "https://www.reddit.com/r/fujifilm/comments/b36ri0/xt20_new_user_questions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "xt-20 new user questions /!/ hi all,\n\ni've posted here a few time, i recently purchased a fuji xt-20, i have been loving it so far but have an assortment of questions i'm hoping i can get some help with.  sorry is this is alot or these seem basic, im just struggling a bit with the amount of things i feel like i dont know.  feel free to answer as many as you can/would like to.\n\n*so far i've been shooting jpegs just because i wanted to experiment a bit without diving into raw.  -----> i !!!  have capture one for editing, (more so when -----> i !!!  start messing around with raw) are there meaningful edits -----> i !!!  -----> can !!!  -----> make !!!  with jpegs? i've been messing around with a few a bit and i'm struggling with what exactly to do.  are there certain adjustments that should be made everytime that are pretty standard? are there certain edits that should be made taking into account what type of camera and lens combo you are using/focal length?  or is it really by individual photo?  is there a good guide for making adjustments to photos that someone can point me to?  not just a how to, but also why.  like how to adjust something, but also how to recognize what needs to be adjusted in a photo, and why that adjustment produces a better image.\n\n*i would like to start shooting jpeg+raw so i can start messing around with raw.  my understanding of raw is that it saves more image data so that you have more info with which to work with/edit later?  how much time editing does this require?  is there a workflow or common set of setting that you can apply to all your raw photos when you download them from your camera? is raw that much better than jpeg?  or does it depend on the image/how you are shooting?\n\n*is anyone aware of just a general xt-20 guide (bonus for info about using xf18-55mm) beyond just the standard fuji manual?\n\ncamera gear and such\n*camera came with a micro sd card in a standard sd adapter.  is there any reason to use a micro?  i would like to pick up a second sd card, at lest 64gb but preferably 128gb.  what is a good card?  i was looking at the san disk extreme pro sdxc.\n\n*is there any sort of regular maintenance i need to do with the camera?  is there any reason that i should ever clean the sensor?  any particular way i should be cleaning the lenses?\n\n*is there any other \"must have\" gear that you would recommend?  i already have a small camera bag and l plate grip.  i'm interested in getting a adjustable camera strap that i can switch from wearing high up on my chest to around my hip, seems like the peak straps are pretty popular.  i'm also interested in a small packable tripod, just something i can use to set up for time lapse and such, any recommendations?   any thoughts on value of thumb grips, shutter buttons?\n\nthanks for the help everyone!  i'm really enjoying the camera so far!", "sortedWord": "None", "Identifyer": null, "identifyer": 28512, "year": "2019"}], "name": "makefujifilm2019"}