{"interestingcomments": [{"autor": "SomeFunPun", "date": "2020-02-05 22:50:08", "content": "Speculation Thread: What Will the 3 New lenses Be? /!/ Figured I'd make a thread to ask what we expect the new lenses to be that Fuji hasn't yet announced for the X Mount. \n\nMy thoughts: with the XC 35 f2 lens, I think at least one of the new lenses will be a partner lens. I assume they will make an XC 50 f2, and they might even make an XC 23 f2. Whether or not those come so soon, or after Fuji sees the sales figured on their XC 35 f2 remains to be seen. \n\nThe next I imagine is a lens designed for the Olympics. They already have a 100-400 and a 200 f2, but I could see them developing a longer prime with a significantly smaller aperture. I think an f4 or f5.6 would be a good guess. \n\nLast is my pipe dream, but I'd love to see the XF 10mm F2 they teased in a slide at last year's Fuji X Summit. Would be nice to have a lens designed for tasks like astrophotography from Fuji, and it is can be small like the Rokinon 10, it'd be a killer.", "link": "https://www.reddit.com/r/fujifilm/comments/ezi3z1/speculation_thread_what_will_the_3_new_lenses_be/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": "speculation thread: what will the 3 new lenses be? /!/ figured -----> i !!! -----> 'd !!!  -----> make !!!  a thread to ask what we expect the new lenses to be that fuji hasn't yet announced for the x mount. \n\nmy thoughts: with the xc 35 f2 lens, i think at least one of the new lenses will be a partner lens. i assume they will make an xc 50 f2, and they might even make an xc 23 f2. whether or not those come so soon, or after fuji sees the sales figured on their xc 35 f2 remains to be seen. \n\nthe next i imagine is a lens designed for the olympics. they already have a 100-400 and a 200 f2, but i could see them developing a longer prime with a significantly smaller aperture. i think an f4 or f5.6 would be a good guess. \n\nlast is my pipe dream, but i'd love to see the xf 10mm f2 they teased in a slide at last year's fuji x summit. would be nice to have a lens designed for tasks like astrophotography from fuji, and it is can be small like the rokinon 10, it'd be a killer.", "sortedWord": "None", "Identifyer": null, "identifyer": 57197, "year": "2020"}, {"autor": "bleuscout__", "date": "2020-12-28 19:35:19", "content": "Photoshop, Lightroom, and RAF files /!/ Not sure if this is the place to ask but...I'm somewhat new to using Fujifilm and I've had some issues with editing my RAF files in Lightroom and Photoshop. The main issue being that both end up being super slow in comparison to my experience with editing Canon CR2 files. I'm not sure if this is a global issue with Fujifilm files and Adobe or if this is just more of a personal issue. Please let me know if I'm making any mistakes or if you have insights on what I should do. Thanks :)", "link": "https://www.reddit.com/r/fujifilm/comments/klx93y/photoshop_lightroom_and_raf_files/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "photoshop, lightroom, and raf files /!/ not sure if this is the place to ask but...i'm somewhat new to using fujifilm and i've had some issues with editing my raf files in lightroom and photoshop. the main issue being that both end up being super slow in comparison to my experience with editing canon cr2 files. i'm not sure if this is a global issue with fujifilm files and adobe or if this is just more of a personal issue. please let me know if -----> i !!! 'm -----> making !!!  any mistakes or if you have insights on what -----> i !!!  should do. thanks :)", "sortedWord": "None", "Identifyer": null, "identifyer": 57446, "year": "2020"}, {"autor": "PitchForkMaster", "date": "2020-10-17 17:25:17", "content": "Switching to fuji X system /!/ Hi guys ! \n\nI’m looking to make the switch to Fuji X system from Canon. Is there anyone here using an adapter EF to X mount ? Which adapter and is that working correctly ? \n\nThank you for your help !", "link": "https://www.reddit.com/r/fujifilm/comments/jcz93w/switching_to_fuji_x_system/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’m looking to make", "selectorShort": "make", "MarkedSent": "switching to fuji x system /!/ hi guys ! \n\n-----> i !!! ’m -----> looking !!!  -----> to !!!  -----> make !!!  the switch -----> to !!!  fuji x system from canon. is there anyone here using an adapter ef to x mount ? which adapter and is that working correctly ? \n\nthank you for your help !", "sortedWord": "None", "Identifyer": null, "identifyer": 57512, "year": "2020"}, {"autor": "weird-human-of-earth", "date": "2020-04-14 19:20:04", "content": "Hello guys! I just made a little article about why I shoot with Fuji, I will be happy if you will take a look :)", "link": "https://www.reddit.com/r/fujifilm/comments/g1bxtf/hello_guys_i_just_made_a_little_article_about_why/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "hello guys! -----> i !!!  -----> just !!!  -----> made !!!  a little article about why -----> i !!!  shoot with fuji, -----> i !!!  will be happy if you will take a look :)", "sortedWord": "None", "Identifyer": null, "identifyer": 57994, "year": "2020"}, {"autor": "13thSpider", "date": "2020-04-13 09:03:30", "content": "Why I moved back to Fuji from Sony /!/ I thought this would be a relevant post seeing as the often asked question of whether Fuji will ever make a Full Frame camera ( Spoiler- they wont) has been asked once again.\n\nI'm a passionate amateur photographer, and while I don't make money from photography I take it seriously and I have shot with a number of cameras / systems over the last few years. I'm not a fanboy and I enjoy trying different systems.\n\nFor a few years I was shooting with a Fuji X-T2, but around a year ago I decided to make a change to a Sony A7iii, purely as I was curious as to how much difference there would be. I had shot Full Frame ( DSLR) in the past and wanted to see what a FF mirrorless set up would be like.\n\n&amp;#x200B;\n\n I  shot Sony for a year and I have to say that its a great system and there are a number of things that I would consider to be advantages over Fuji. Obviously a FF sensor will have certain benefits in terms of noise and DOF, and also the camera itself had great AF.\n\n&amp;#x200B;\n\nHowever there are a number of things that I didn't like with the Sony. \n\n&amp;#x200B;\n\nThe first was cost. Don't get me wrong, Fuji is far from a cheap system, but the Sony ecosystem, as great as it is, is very expensive. \n\n&amp;#x200B;\n\nThe size is also, for me, an issue. If I'm out just to photograph it's not an issue, but I like to be able to bring my camera on family days out etc, and anything FF is going to be bigger than I like.\n\n&amp;#x200B;\n\nThe last thing, and this one is completely subjective,  I didn't like the files the camera produced. Don't get me wrong, with work I could get fantastic images ( as you can with any camera), but I'm not a fan of having to do huge amounts of post processing. This is probably the thing that I missed most of all, and something that really pushed me back to Fuji.\n\n&amp;#x200B;\n\nFuji RAW files might be a bit noisier at high ISO's, they might not have as thin a DOF, and they might have a bit less dynamic range, but they have something special in their colour and tone that means, for me, they are essentially almost ready SOOC. I find myself spending so much less time in front of a screen when I shoot Fuji and that for me is hugely important.\n\n&amp;#x200B;\n\nI also love how the Fuji cameras feel,and the manual dials was something I really missed as well.\n\n&amp;#x200B;\n\nSo I ended up selling the A7iii and lenses and moving back to a very simple set up of an X-T3, 23 / 50 F2, 10-24 ( and when finances allow I'll add an 18-55).\n\n&amp;#x200B;\n\nSome people ( usually those who have never shot Fuji) are horrified that I would choose an APSC sensor camera over a Full Frame one, but I know that I've made the best decision for me.", "link": "https://www.reddit.com/r/fujifilm/comments/g0fcjh/why_i_moved_back_to_fuji_from_sony/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i don't make", "selectorShort": "make", "MarkedSent": "why i moved back to fuji from sony /!/ i thought this would be a relevant post seeing as the often asked question of whether fuji will ever make a full frame camera ( spoiler- they wont) has been asked once again.\n\n-----> i !!! 'm a passionate amateur photographer, and while -----> i !!!  -----> do !!! -----> n't !!!  -----> make !!!  money from photography -----> i !!!  take it seriously and -----> i !!!  have shot with a number of cameras / systems over the last few years. i'm not a fanboy and i enjoy trying different systems.\n\nfor a few years i was shooting with a fuji x-t2, but around a year ago i decided to make a change to a sony a7iii, purely as i was curious as to how much difference there would be. i had shot full frame ( dslr) in the past and wanted to see what a ff mirrorless set up would be like.\n\n&amp;#x200b;\n\n i  shot sony for a year and i have to say that its a great system and there are a number of things that i would consider to be advantages over fuji. obviously a ff sensor will have certain benefits in terms of noise and dof, and also the camera itself had great af.\n\n&amp;#x200b;\n\nhowever there are a number of things that i didn't like with the sony. \n\n&amp;#x200b;\n\nthe first was cost. don't get me wrong, fuji is far from a cheap system, but the sony ecosystem, as great as it is, is very expensive. \n\n&amp;#x200b;\n\nthe size is also, for me, an issue. if i'm out just to photograph it's not an issue, but i like to be able to bring my camera on family days out etc, and anything ff is going to be bigger than i like.\n\n&amp;#x200b;\n\nthe last thing, and this one is completely subjective,  i didn't like the files the camera produced. don't get me wrong, with work i could get fantastic images ( as you can with any camera), but i'm not a fan of having to do huge amounts of post processing. this is probably the thing that i missed most of all, and something that really pushed me back to fuji.\n\n&amp;#x200b;\n\nfuji raw files might be a bit noisier at high iso's, they might not have as thin a dof, and they might have a bit less dynamic range, but they have something special in their colour and tone that means, for me, they are essentially almost ready sooc. i find myself spending so much less time in front of a screen when i shoot fuji and that for me is hugely important.\n\n&amp;#x200b;\n\ni also love how the fuji cameras feel,and the manual dials was something i really missed as well.\n\n&amp;#x200b;\n\nso i ended up selling the a7iii and lenses and moving back to a very simple set up of an x-t3, 23 / 50 f2, 10-24 ( and when finances allow i'll add an 18-55).\n\n&amp;#x200b;\n\nsome people ( usually those who have never shot fuji) are horrified that i would choose an apsc sensor camera over a full frame one, but i know that i've made the best decision for me.", "sortedWord": "None", "Identifyer": null, "identifyer": 58033, "year": "2020"}, {"autor": "xapp678", "date": "2020-02-22 01:14:38", "content": "Help choosing lenses /!/ Newcomer to Fuji, need some help with lenses\n\nI'm planning on getting an X-T2 or X-T3 once the new X-T4 comes out and I'd like to buy one or two lenses to use with it. As it would be my first set of lenses in the Fuji system, I'd like to start with something general (so probably a zoom lens but correct me if I'm making a poor assumption). \n\nIn addition to general use, I primarily want to use it for backpacking and mountaineering, so size, weight, and weather resistance are all things that I'm weighing. My first thought was to get the 18-55mm along with something wider for alpine landscapes. I'm now unsure though, because of the lack of weather resistance with the 18-55mm and how wide I should go for the other lens. The 16-55mm is also really appealing but it weighs twice as much as the 18-55mm and would be a lot bulkier to manage while hiking. It also lacks OIS (how important is OIS given that I'm going to want to take photos without a tripod a lot of the time?) and costs a lot more. Which zoom/general lens would you recommend? \n\nAlso, if I wanted a second, wider, lens what recommendations do you have? I've read good things about the Rokinon 12mm and Fuji 16mm f2.8 (but this one might overlap with the zoom lens). \n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/f7l72l/help_choosing_lenses/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "help choosing lenses /!/ newcomer to fuji, need some help with lenses\n\ni'm planning on getting an x-t2 or x-t3 once the new x-t4 comes out and i'd like to buy one or two lenses to use with it. as it would be my first set of lenses in the fuji system, -----> i !!! 'd like to start with something general (so probably a zoom lens but correct me if -----> i !!! 'm -----> making !!!  a poor assumption). \n\nin addition to general use, i primarily want to use it for backpacking and mountaineering, so size, weight, and weather resistance are all things that i'm weighing. my first thought was to get the 18-55mm along with something wider for alpine landscapes. i'm now unsure though, because of the lack of weather resistance with the 18-55mm and how wide i should go for the other lens. the 16-55mm is also really appealing but it weighs twice as much as the 18-55mm and would be a lot bulkier to manage while hiking. it also lacks ois (how important is ois given that i'm going to want to take photos without a tripod a lot of the time?) and costs a lot more. which zoom/general lens would you recommend? \n\nalso, if i wanted a second, wider, lens what recommendations do you have? i've read good things about the rokinon 12mm and fuji 16mm f2.8 (but this one might overlap with the zoom lens). \n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 58126, "year": "2020"}, {"autor": "throwawayqo", "date": "2020-08-04 15:26:26", "content": "Why did Fujifilm limit the X-T30 to 4k 30FPS and made high speed FHD recording played back in slow motion? /!/ Hi everyone, I hope you are all doing well. \n\nI have recently made the switch from Canon mirrorless line to a Fujifilm X-T30 and not regretting it one bit. I have been shooting in 4k 25FPS at 100mbps and I am absolutely loving Eterna and its post production potential. \n\nI never missed the 4k 60FPS to be fair. However, recently I got a project where I had to have some slow motion shots overlapping with normal-speed shots so I have now to record at a higher frame rate, and the way I usually do it is recording in 50FPS. First thing I did obviously was to revert back to 1080p and shoot there with 50FPS at 100mbps, and then I had some issues while uploading the footage to YouTube in 1080p. The quality dropped significantly so I had to upscale the footage to 1440p in order to preserve the quality, but I could tell that the image is defintely obviously upscaled and doesnt have that certain crisp to it like the 4k does, and this is when I started missing the 4k 50FPS.\n\nI made some tests and I started noticing some odd things. First thing is, the frame rate does not affect the size of the video file neither in 4k nor in 1080p, unlike the Canon cameras. With Canons, the higher the frame rate, the bigger the file size becomes and the faster the camera overheats. Go ahead try it yourself and you will see that the file size stays almost the same on the Fujis.\n\nSecondly, the video resolution does not also affect the video size at all. 4k at 100mbps has the same video size as 1080p at 100mbps. The only thing that changes the video size is the 200mbps feature. Other than that it stays the same which leads me to asking: \n\nWhy cant we have the option of recording in 4k 60FPS on the X-T30? I really wish that this can be fixed because I really think it is a very unnecessary limitation. I can live with the 10 minutes recording limit, that is absolutely fine as to not go crazy with the camera, but the 4k 60FPS being left out like that is just odd in my opinion because the camera is very much capable of recording in 4k 60FPS... or is it? \n\nFrom what I am seeing, since the frame rates and the resolution do not affect the file size it means that the camera is putting the same amount of efforts into recording them? It is just a small haunch. Correct me if I am mistaken please! \n\nAnd the other annoying thing is that slow motion playback of high frame rate videos... I mean why. Why cant we just review the video normally without the extremely slow playback? I would really appreciate it if we had at least an option of changing the playback speed.  ", "link": "https://www.reddit.com/r/fujifilm/comments/i3lbkq/why_did_fujifilm_limit_the_xt30_to_4k_30fps_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have recently made", "selectorShort": "make", "MarkedSent": "why did fujifilm limit the x-t30 to 4k 30fps and made high speed fhd recording played back in slow motion? /!/ hi everyone, i hope you are all doing well. \n\n-----> i !!!  -----> have !!!  -----> recently !!!  -----> made !!!  the switch from canon mirrorless line to a fujifilm x-t30 and not regretting it one bit. i have been shooting in 4k 25fps at 100mbps and i am absolutely loving eterna and its post production potential. \n\ni never missed the 4k 60fps to be fair. however, recently i got a project where i had to have some slow motion shots overlapping with normal-speed shots so i have now to record at a higher frame rate, and the way i usually do it is recording in 50fps. first thing i did obviously was to revert back to 1080p and shoot there with 50fps at 100mbps, and then i had some issues while uploading the footage to youtube in 1080p. the quality dropped significantly so i had to upscale the footage to 1440p in order to preserve the quality, but i could tell that the image is defintely obviously upscaled and doesnt have that certain crisp to it like the 4k does, and this is when i started missing the 4k 50fps.\n\ni made some tests and i started noticing some odd things. first thing is, the frame rate does not affect the size of the video file neither in 4k nor in 1080p, unlike the canon cameras. with canons, the higher the frame rate, the bigger the file size becomes and the faster the camera overheats. go ahead try it yourself and you will see that the file size stays almost the same on the fujis.\n\nsecondly, the video resolution does not also affect the video size at all. 4k at 100mbps has the same video size as 1080p at 100mbps. the only thing that changes the video size is the 200mbps feature. other than that it stays the same which leads me to asking: \n\nwhy cant we have the option of recording in 4k 60fps on the x-t30? i really wish that this can be fixed because i really think it is a very unnecessary limitation. i can live with the 10 minutes recording limit, that is absolutely fine as to not go crazy with the camera, but the 4k 60fps being left out like that is just odd in my opinion because the camera is very much capable of recording in 4k 60fps... or is it? \n\nfrom what i am seeing, since the frame rates and the resolution do not affect the file size it means that the camera is putting the same amount of efforts into recording them? it is just a small haunch. correct me if i am mistaken please! \n\nand the other annoying thing is that slow motion playback of high frame rate videos... i mean why. why cant we just review the video normally without the extremely slow playback? i would really appreciate it if we had at least an option of changing the playback speed.  ", "sortedWord": "None", "Identifyer": null, "identifyer": 58438, "year": "2020"}, {"autor": "JacReviewsStuff", "date": "2020-05-04 15:38:39", "content": "I wanna share my unboxing experience with with you guys. I made a review about my latest camera... I love it so much and I hope you like my videos =)", "link": "https://www.reddit.com/r/fujifilm/comments/gddtlj/i_wanna_share_my_unboxing_experience_with_with/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i wanna share my unboxing experience with with you guys. -----> i !!!  -----> made !!!  a review about my latest camera... i love it so much and i hope you like my videos =)", "sortedWord": "None", "Identifyer": null, "identifyer": 58629, "year": "2020"}, {"autor": "thanospal", "date": "2020-05-03 14:13:44", "content": "Fujinon 56mm f1.2 or 23mm f1.4 Dilemma /!/ Hello fuji-friends I wanna extend my arsenal adding one more lens. But I cannot decide. I am not that much into portrait but I do make some product images. I like bokeh very much and I have to mention that it is my hobby. I have the 35mmF2 18mmf2 and the 27mmf2.8. I love my 35 so much but the bokeh isn’t that great. Thanks!\n\n[View Poll](https://www.reddit.com/poll/gcr9z0)", "link": "https://www.reddit.com/r/fujifilm/comments/gcr9z0/fujinon_56mm_f12_or_23mm_f14_dilemma/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i do make", "selectorShort": "make", "MarkedSent": "fujinon 56mm f1.2 or 23mm f1.4 dilemma /!/ hello fuji-friends i wanna extend my arsenal adding one more lens. but i cannot decide. i am not that much into portrait but -----> i !!!  -----> do !!!  -----> make !!!  some product images. i like bokeh very much and i have to mention that it is my hobby. i have the 35mmf2 18mmf2 and the 27mmf2.8. i love my 35 so much but the bokeh isn’t that great. thanks!\n\n[view poll](https://www.reddit.com/poll/gcr9z0)", "sortedWord": "None", "Identifyer": null, "identifyer": 58654, "year": "2020"}, {"autor": "theplanlessman", "date": "2020-11-20 08:18:09", "content": "Is the 16-80 f/4 as bad as they say? /!/ Hi reddit,\n\nI'm looking to make the switch over to fuji, and the idea of the 16-80 f/4 lens intrigued me. Ithe focal lengths match my current 12-60 standard zoom on my m43 camera, I like the constant f/4 max aperture, and it's at a good price when part of a kit.\n\nHowever, the reviews and forums seem to have raised three big issues that could be deal breakers for me:\n\n1. Soft corners. I'd be looking to take this out on hikes to get landscape shots. Some reviewers are saying the corners really don't get anything beyond \"fair\" sharpness, which isn't ideal. Can anyone confirm/contradict this point?\n\n2. Shutter shock at low shutter speeds. Again, as a landscape photographer I sometimes shoot at quite slow shutter speeds, so if it's not able to provide sharp images then that's a real deal breaker. Has anyone experienced this?\n\n3. Focus wobble while zooming in video. This one is less critical to me at the moment, but I am planning to get more into video so I'd like my next kit lens to be capable in that regard. Has anyone noticed this?\n\nFinally, it seems this lens has gone through quite a number of firmware updates already, have they managed to fix any of these issues?", "link": "https://www.reddit.com/r/fujifilm/comments/jxlbtx/is_the_1680_f4_as_bad_as_they_say/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'm looking to make", "selectorShort": "make", "MarkedSent": "is the 16-80 f/4 as bad as they say? /!/ hi reddit,\n\n-----> i !!! 'm -----> looking !!!  -----> to !!!  -----> make !!!  the switch over -----> to !!!  fuji, and the idea of the 16-80 f/4 lens intrigued me. ithe focal lengths match my current 12-60 standard zoom on my m43 camera, i like the constant f/4 max aperture, and it's at a good price when part of a kit.\n\nhowever, the reviews and forums seem to have raised three big issues that could be deal breakers for me:\n\n1. soft corners. i'd be looking to take this out on hikes to get landscape shots. some reviewers are saying the corners really don't get anything beyond \"fair\" sharpness, which isn't ideal. can anyone confirm/contradict this point?\n\n2. shutter shock at low shutter speeds. again, as a landscape photographer i sometimes shoot at quite slow shutter speeds, so if it's not able to provide sharp images then that's a real deal breaker. has anyone experienced this?\n\n3. focus wobble while zooming in video. this one is less critical to me at the moment, but i am planning to get more into video so i'd like my next kit lens to be capable in that regard. has anyone noticed this?\n\nfinally, it seems this lens has gone through quite a number of firmware updates already, have they managed to fix any of these issues?", "sortedWord": "None", "Identifyer": null, "identifyer": 59387, "year": "2020"}, {"autor": "dolphin_spit", "date": "2020-06-08 22:23:14", "content": "Finally purchased an X-Pro3 yesterday, but it was defective due to the light leak viewfinder issue (OVF/EVF screen is washed out) /!/ Just wanted to share this as I don't see it posted too often, whether here or in blogs. I feel like it's important to know for prospective buyers that even cameras purchased in June of 2020 could still potentially face this issue.\n\nI'm not trying to disparage Fujifilm at all (I would consider myself a pretty vocal supporter of Fujifilm amongst my friends/colleagues when recommending cameras). Rather, the point of this is to hopefully add some visibility into this issue, and confirm that it is still happening more than 6 months after product launch, because I am not seeing that messaging in the documentation, dealers, blogs/videos online, nor Fuji themselves. And $2700 CAD is alotta dough.\n\nThanks\n\n**Important PSA for new users**: The **very first thing** you need to do before even playing with the settings of your camera, is to update the firmware. You should literally not do anything else with it first. Fuji has since released a firmware update for the camera that PREVENTS this issue, but if the issue is already occurring, it *cannot fix* the issue. I just want to throw that out there because this isn't documented very much online, and there are certainly no warning labels on or in the box, and my Fuji dealer did not mention this at all. It needs way more visibility.\n\nI drove 2 hours to pick up my camera. I finally found a store in my approximate region that has one in stock. I've been dreaming of an X-Pro camera for a couple of years and after watching countless videos about the camera, decided the X-Pro3 is what I want.\n\nI got the camera, started playing around with the settings and setup in my car. Everything looked good! Finally got everything set up, then went to explore the city and try it out.\n\nI was having a good time getting used to how it worked, working out which knob/button did what, and had a good time shooting. At some point, probably about an hour after I first started shooting, I noticed that I could no longer activate the hybrid viewfinder mode. When I was setting the camera up before, it worked -- I saw the focus points in the bottom right. However, no matter which way I pushed the viewfinder selector, it wasn't switching anymore. This was kind of nagging at me, but I hoped there was something I was missing and would do more research when I got home and was able to use my computer to dig around.\n\nAbout an hour after that, I grabbed some lunch, and wanted to get a shot from inside the restaurant to outside. When I put the camera up to my eyes, the EVF was completely washed out with a bright gray/white. I could barely make out the subject in front of me. Prior to this, I noticed the low battery warning so I figured this washed out look was probably (hopefully) the result of the camera not having enough power. For the record, the OVF was also experiencing the same issue. Even though it's an optical viewfinder, there was a large square in the middle (inside of where you would normally see the electronic frame lines) that was completely washed out.\n\nWhen I got back to my car, I changed the battery with a new one. It didn't resolve the issue. I tried a second new battery, same issue. One of these new batteries was fully charged. After messing around with the Fuji mobile app, I realized I could update the camera's firmware via my phone connection to my camera. I downloaded the 46MB update on my phone, then connected to my camera via Wifi and the camera updated. Upon restarting, the issue was still persisting.\n\nIt was at that point that I looked online and found a small number of forum posts regarding this same issue. Fuji has stated this only affects a 'few' units but I'm not really too sure how realistic that is given the number of posts I've seen. The X-Pro3 is already a pretty niche camera, so even having 1000 affected units would translate to a pretty high percentage of total units. I also learned that Fuji has confirmed that the firmware update is confirmed to prevent this issue from happening, but it CANNOT fix a camera that is already experiencing the issue. It's shocking that given this important information, there is zero notice of how crucial this firmware update is immediately upon receiving the camera.\n\nI've been really happy with Fujifilm after switching from Canon a couple of years ago. I've liked their branding and philosophy -- their response to this strikes me as a bit odd and is definitely disappointing. I admire their design philosophy and overall craftsmanship that goes into their cameras and optics, and will continue as a fan. But I truthfully am finding it a bit harder to blindly trust that their products are going to be built with the utmost quality. Many products have defects, especially in the first run, but the reluctance to admit the full reach of it is a little concerning.\n\nFuji has asked for me to send it in to them, provide a copy of my receipt IF I want it covered under warranty (it was purchased yesterday..), and there'll be a wait time for the technician to determine if the issue can be repaired, or if a replacement needs to be sent out. The wait time is understandable with the current situation, for sure. \n\nI've decided to take an early drive tomorrow back to the dealer. They've set aside another camera, and I'm going to swap it -- this is my dream camera, so I'm going to try again. I'm going to update the firmware as soon as I get it. Fingers crossed, because I can't wait to get into shooting normally with my new camera.", "link": "https://www.reddit.com/r/fujifilm/comments/gz9r6z/finally_purchased_an_xpro3_yesterday_but_it_was/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i could barely make", "selectorShort": "make", "MarkedSent": "finally purchased an x-pro3 yesterday, but it was defective due to the light leak viewfinder issue (ovf/evf screen is washed out) /!/ just wanted to share this as i don't see it posted too often, whether here or in blogs. i feel like it's important to know for prospective buyers that even cameras purchased in june of 2020 could still potentially face this issue.\n\ni'm not trying to disparage fujifilm at all (i would consider myself a pretty vocal supporter of fujifilm amongst my friends/colleagues when recommending cameras). rather, the point of this is to hopefully add some visibility into this issue, and confirm that it is still happening more than 6 months after product launch, because i am not seeing that messaging in the documentation, dealers, blogs/videos online, nor fuji themselves. and $2700 cad is alotta dough.\n\nthanks\n\n**important psa for new users**: the **very first thing** you need to do before even playing with the settings of your camera, is to update the firmware. you should literally not do anything else with it first. fuji has since released a firmware update for the camera that prevents this issue, but if the issue is already occurring, it *cannot fix* the issue. i just want to throw that out there because this isn't documented very much online, and there are certainly no warning labels on or in the box, and my fuji dealer did not mention this at all. it needs way more visibility.\n\ni drove 2 hours to pick up my camera. i finally found a store in my approximate region that has one in stock. i've been dreaming of an x-pro camera for a couple of years and after watching countless videos about the camera, decided the x-pro3 is what i want.\n\ni got the camera, started playing around with the settings and setup in my car. everything looked good! finally got everything set up, then went to explore the city and try it out.\n\ni was having a good time getting used to how it worked, working out which knob/button did what, and had a good time shooting. at some point, probably about an hour after i first started shooting, i noticed that i could no longer activate the hybrid viewfinder mode. when i was setting the camera up before, it worked -- i saw the focus points in the bottom right. however, no matter which way i pushed the viewfinder selector, it wasn't switching anymore. this was kind of nagging at me, but i hoped there was something i was missing and would do more research when i got home and was able to use my computer to dig around.\n\nabout an hour after that, i grabbed some lunch, and wanted to get a shot from inside the restaurant to outside. when i put the camera up to my eyes, the evf was completely washed out with a bright gray/white. -----> i !!!  -----> could !!!  -----> barely !!!  -----> make !!!  out the subject in front of me. prior to this, i noticed the low battery warning so i figured this washed out look was probably (hopefully) the result of the camera not having enough power. for the record, the ovf was also experiencing the same issue. even though it's an optical viewfinder, there was a large square in the middle (inside of where you would normally see the electronic frame lines) that was completely washed out.\n\nwhen i got back to my car, i changed the battery with a new one. it didn't resolve the issue. i tried a second new battery, same issue. one of these new batteries was fully charged. after messing around with the fuji mobile app, i realized i could update the camera's firmware via my phone connection to my camera. i downloaded the 46mb update on my phone, then connected to my camera via wifi and the camera updated. upon restarting, the issue was still persisting.\n\nit was at that point that i looked online and found a small number of forum posts regarding this same issue. fuji has stated this only affects a 'few' units but i'm not really too sure how realistic that is given the number of posts i've seen. the x-pro3 is already a pretty niche camera, so even having 1000 affected units would translate to a pretty high percentage of total units. i also learned that fuji has confirmed that the firmware update is confirmed to prevent this issue from happening, but it cannot fix a camera that is already experiencing the issue. it's shocking that given this important information, there is zero notice of how crucial this firmware update is immediately upon receiving the camera.\n\ni've been really happy with fujifilm after switching from canon a couple of years ago. i've liked their branding and philosophy -- their response to this strikes me as a bit odd and is definitely disappointing. i admire their design philosophy and overall craftsmanship that goes into their cameras and optics, and will continue as a fan. but i truthfully am finding it a bit harder to blindly trust that their products are going to be built with the utmost quality. many products have defects, especially in the first run, but the reluctance to admit the full reach of it is a little concerning.\n\nfuji has asked for me to send it in to them, provide a copy of my receipt if i want it covered under warranty (it was purchased yesterday..), and there'll be a wait time for the technician to determine if the issue can be repaired, or if a replacement needs to be sent out. the wait time is understandable with the current situation, for sure. \n\ni've decided to take an early drive tomorrow back to the dealer. they've set aside another camera, and i'm going to swap it -- this is my dream camera, so i'm going to try again. i'm going to update the firmware as soon as i get it. fingers crossed, because i can't wait to get into shooting normally with my new camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 59763, "year": "2020"}, {"autor": "PrivateCeralion", "date": "2020-04-08 11:38:06", "content": "Need help with xt 30 settings. /!/ Hi :) I have a xt 30 and bought me an HDMI Capture Card because I want to use my Camera as High-Quality Webcam. I set the Info Display of, because I want the Clear picture. But every time I am in the Image, I see a box around my Face in the HDMI output. How can I make the box away? But I still want, that it focuses my face.\n\nThank you for your help!", "link": "https://www.reddit.com/r/fujifilm/comments/fx4y86/need_help_with_xt_30_settings/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "need help with xt 30 settings. /!/ hi :) i have a xt 30 and bought me an hdmi capture card because i want to use my camera as high-quality webcam. i set the info display of, because i want the clear picture. but every time i am in the image, i see a box around my face in the hdmi output. how can -----> i !!!  -----> make !!!  the box away? but i still want, that it focuses my face.\n\nthank you for your help!", "sortedWord": "None", "Identifyer": null, "identifyer": 60152, "year": "2020"}, {"autor": "domiglover", "date": "2020-09-28 05:03:49", "content": "Mercedes Benz 300TD I captured on my Fujifilm XT100 Mirrorless. Best purchase I’ve made in time.", "link": "https://www.reddit.com/r/fujifilm/comments/j15znv/mercedes_benz_300td_i_captured_on_my_fujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve made", "selectorShort": "make", "MarkedSent": "mercedes benz 300td i captured on my fujifilm xt100 mirrorless. best purchase -----> i !!! ’ve -----> made !!!  in time.", "sortedWord": "None", "Identifyer": null, "identifyer": 60202, "year": "2020"}, {"autor": "motorcyclejpg", "date": "2020-09-27 19:51:43", "content": "Should I sell my X-T3 for a X100V /!/ I know similar versions of this question have been asked before, but this has been driving me crazy for weeks and I can't seem to shake the feeling.\n\nI am a hobbyist photographer in college, and few months ago I switched from Canon to Fuji. This was my first camera upgrade since 2013, and I bought a beautiful used X-T3 after many weeks of research trying to determine the best camera for me to buy. I was totally sold on the X-T3. It had the dials I wanted, a highly praised EVF, weather sealing, dual card slots, and my must-have feature, the tilting screen because I love shooting from the hip. The looks were just the cherry on top.\n\nI love this camera, but after shooting with it for a while, I realized I always had my 18-55 set on either 23mm or 55mm 99% of the time. I mainly shoot street and travel, and occasionally enjoy shooting portraits with my girlfriend and family. I figured the best move for me would be to buy the 23mm f2, and the 50mm f2, and I was content with picking those up over the next few months or so. I have not bought either yet, and continue to only use my 18-55.\n\nThe more I shoot with this camera, the bigger and heavier it seems. Don't get me wrong, I really love it, and its way smaller and lighter than my Canon DSLR, and feels fantastic in hand. However I NEVER use the EVF because it's still so strange to me looking at a screen compared to the OVF I am used to. I have no interest in the 27mm, and planned to rarely use the 18-55 after buying the 23mm and 50mm f2. As time goes on, I find myself going places that couldn't justify bringing a backpack or camera bag, and wishing my form factor would just fit in a coat pocket or fanny pack. I get to these places, without my camera, and see beautiful moments I wish I could have captured, but couldn't because I didn't want to be that guy bringing a full system to the grocery store, or that guy getting his camera stolen from his car because he left it in there when going into the grocery store. You get the idea.\n\nNow I'm realizing, that if I don't use the EVF, I only really want 2 affordable primes, and am not doing any paid work, I may have over-compensated for my needs in an attempt to future proof myself as much as possible. Would my needs be better fulfilled by a X100V and using the TCL on occasion?\n\nI know this seems like I've just kind of typed out the fact that I already know what I want, and that I should make the switch, but I also know how fantastic and feature packed the X-T3 is, and that me having it with me or not is my responsibility, and form factor is kind of a lame excuse for missing shots, especially when the camera isn't really that big. I just can't shake the feeling that even though I should be content with this camera body, it's just more than I need. Yet, on the other hand I feel like if I make the switch, I may miss the opportunities to use the tighter focal lengths when I want to take portraits. It's very possible I am just getting too obsessed with form factor, and I need to just shut up and take photos, but the temptation to be able to take the X100V with me literally anywhere, anytime, is killing me. I am generally a very conscious shopper, and almost never regret my purchases, but I'm so on the fence about this and don't really have any photography pals to talk me into or out of it. Do you guys think the X100V is enough for a main system?\n\nSorry this is so long, just wanted to give as much insight as possible to why I'm thinking what I'm thinking.\n\nTL;DR : I am a hobbyist and recently got X-T3 to have a smaller form factor camera than my Canon DSLR, still feels to big sometimes and I don't really like the EVF, why keep it if I mainly shoot at 23mm(35mmFF) anyway?", "link": "https://www.reddit.com/r/fujifilm/comments/j0xlue/should_i_sell_my_xt3_for_a_x100v/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i should make", "selectorShort": "make", "MarkedSent": "should i sell my x-t3 for a x100v /!/ i know similar versions of this question have been asked before, but this has been driving me crazy for weeks and i can't seem to shake the feeling.\n\ni am a hobbyist photographer in college, and few months ago i switched from canon to fuji. this was my first camera upgrade since 2013, and i bought a beautiful used x-t3 after many weeks of research trying to determine the best camera for me to buy. i was totally sold on the x-t3. it had the dials i wanted, a highly praised evf, weather sealing, dual card slots, and my must-have feature, the tilting screen because i love shooting from the hip. the looks were just the cherry on top.\n\ni love this camera, but after shooting with it for a while, i realized i always had my 18-55 set on either 23mm or 55mm 99% of the time. i mainly shoot street and travel, and occasionally enjoy shooting portraits with my girlfriend and family. i figured the best move for me would be to buy the 23mm f2, and the 50mm f2, and i was content with picking those up over the next few months or so. i have not bought either yet, and continue to only use my 18-55.\n\nthe more i shoot with this camera, the bigger and heavier it seems. don't get me wrong, i really love it, and its way smaller and lighter than my canon dslr, and feels fantastic in hand. however i never use the evf because it's still so strange to me looking at a screen compared to the ovf i am used to. i have no interest in the 27mm, and planned to rarely use the 18-55 after buying the 23mm and 50mm f2. as time goes on, i find myself going places that couldn't justify bringing a backpack or camera bag, and wishing my form factor would just fit in a coat pocket or fanny pack. i get to these places, without my camera, and see beautiful moments i wish i could have captured, but couldn't because i didn't want to be that guy bringing a full system to the grocery store, or that guy getting his camera stolen from his car because he left it in there when going into the grocery store. you get the idea.\n\nnow i'm realizing, that if i don't use the evf, i only really want 2 affordable primes, and am not doing any paid work, i may have over-compensated for my needs in an attempt to future proof myself as much as possible. would my needs be better fulfilled by a x100v and using the tcl on occasion?\n\n-----> i !!!  know this seems like -----> i !!! 've just kind of typed out the fact that -----> i !!!  already know what -----> i !!!  want, and that -----> i !!!  -----> should !!!  -----> make !!!  the switch, but -----> i !!!  also know how fantastic and feature packed the x-t3 is, and that me having it with me or not is my responsibility, and form factor is kind of a lame excuse for missing shots, especially when the camera isn't really that big. i just can't shake the feeling that even though i should be content with this camera body, it's just more than i need. yet, on the other hand i feel like if i make the switch, i may miss the opportunities to use the tighter focal lengths when i want to take portraits. it's very possible i am just getting too obsessed with form factor, and i need to just shut up and take photos, but the temptation to be able to take the x100v with me literally anywhere, anytime, is killing me. i am generally a very conscious shopper, and almost never regret my purchases, but i'm so on the fence about this and don't really have any photography pals to talk me into or out of it. do you guys think the x100v is enough for a main system?\n\nsorry this is so long, just wanted to give as much insight as possible to why i'm thinking what i'm thinking.\n\ntl;dr : i am a hobbyist and recently got x-t3 to have a smaller form factor camera than my canon dslr, still feels to big sometimes and i don't really like the evf, why keep it if i mainly shoot at 23mm(35mmff) anyway?", "sortedWord": "None", "Identifyer": null, "identifyer": 60212, "year": "2020"}, {"autor": "Docshooter", "date": "2020-02-18 14:29:49", "content": "X pro series help? /!/  \n\nI have struggled in a love hate relationship with my (formerly) X pro1's. I say formerly because eventually I made the call and sold them, regrettably, with my X mount lenses.\n\nMy reasoning was in answering the question; was investing in supplementing the poor battery life worth it?\n\nI had decided that since I could not use a manual focus lens with the OVF - like a true range finder- then I was not going to buy 8 more batteries at $110 CAD each.\n\nThe focus-by-wire of the fuji AF lenses and plasticky feel made using the X pro1's lovely OVF and focus indicator feel quite gimmicky. Furthermore, using the EVF to manual focus drained the battery quite quickly.\n\nI eventually got 2 bodies to see if I could 'stretch' their battery life by switching between the two (approx. $350 CAD ea.). Manual focus + EVF on one, and OVF+AF on the other. The EVF always died faster, even when interchanging the batteries.\n\n*Now, I know fuji lovers are passionate and I am not saying there is anything wrong with the X pro1 - It just didn't suit my desires and expectations from a digital rangefinder.*\n\nThen, upon research into the X pro2, I found out there is a beautiful thing known as the ERF that would allow one to use a nice mechanical manual focus lens with the beloved OVF.\n\nNow, I had not invested much into the two X pro1 bodies, spare battery, 2 manual and 2 pancake AF lenses I bought, and then sold. However, I feel as though I want to know far more about the X pro2 (or possibly X pro3) before purchase.\n\nTL:DR;\n\nMy questions are:\n\nWhat info should one know before buying the X pro2 (or 3), to use the OVF+ERF with a manual focus lens?\n\nDoes the ERF 'drain the battery' as the EVF did on my X pro1?\n\nAre there limitations to the lenses that can be used with the ERF?\n\nIs the ERF limited in low light? Can it be used in, say, a candle lit pub?\n\nAre there other known solutions to using mechanical manual focus lenses with the OVF?\n\n*I dont mind making the investment into supplementing the poor battery life, as long as I am conviced the 'rangefinder' will not disappoint.*", "link": "https://www.reddit.com/r/fujifilm/comments/f5slwm/x_pro_series_help/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "x pro series help? /!/  \n\ni have struggled in a love hate relationship with my (formerly) x pro1's. -----> i !!!  say formerly because eventually -----> i !!!  -----> made !!!  the call and sold them, regrettably, with my x mount lenses.\n\nmy reasoning was in answering the question; was investing in supplementing the poor battery life worth it?\n\ni had decided that since i could not use a manual focus lens with the ovf - like a true range finder- then i was not going to buy 8 more batteries at $110 cad each.\n\nthe focus-by-wire of the fuji af lenses and plasticky feel made using the x pro1's lovely ovf and focus indicator feel quite gimmicky. furthermore, using the evf to manual focus drained the battery quite quickly.\n\ni eventually got 2 bodies to see if i could 'stretch' their battery life by switching between the two (approx. $350 cad ea.). manual focus + evf on one, and ovf+af on the other. the evf always died faster, even when interchanging the batteries.\n\n*now, i know fuji lovers are passionate and i am not saying there is anything wrong with the x pro1 - it just didn't suit my desires and expectations from a digital rangefinder.*\n\nthen, upon research into the x pro2, i found out there is a beautiful thing known as the erf that would allow one to use a nice mechanical manual focus lens with the beloved ovf.\n\nnow, i had not invested much into the two x pro1 bodies, spare battery, 2 manual and 2 pancake af lenses i bought, and then sold. however, i feel as though i want to know far more about the x pro2 (or possibly x pro3) before purchase.\n\ntl:dr;\n\nmy questions are:\n\nwhat info should one know before buying the x pro2 (or 3), to use the ovf+erf with a manual focus lens?\n\ndoes the erf 'drain the battery' as the evf did on my x pro1?\n\nare there limitations to the lenses that can be used with the erf?\n\nis the erf limited in low light? can it be used in, say, a candle lit pub?\n\nare there other known solutions to using mechanical manual focus lenses with the ovf?\n\n*i dont mind making the investment into supplementing the poor battery life, as long as i am conviced the 'rangefinder' will not disappoint.*", "sortedWord": "None", "Identifyer": null, "identifyer": 60302, "year": "2020"}, {"autor": "TheLLort", "date": "2020-07-17 00:28:25", "content": "Used X-T1 for 260€ a good deal, or splurge some more for something else? /!/ Hey guys!    \nI have made the decision to switch to fuji. But not yet what camera, is a X-T1 still a good deal? I don't need to make big prints but I could also afford a X-T2 or X-T20, though they are much more expensive. On a german site for used electronics I found an X-T1 for 260€ used, one year warranty. Is that still a good camera and a good deal?      \n\nLooking forward to join the fuji family!", "link": "https://www.reddit.com/r/fujifilm/comments/hslss8/used_xt1_for_260_a_good_deal_or_splurge_some_more/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "used x-t1 for 260€ a good deal, or splurge some more for something else? /!/ hey guys!    \n-----> i !!!  -----> have !!!  -----> made !!!  the decision to switch to fuji. but not yet what camera, is a x-t1 still a good deal? i don't need to make big prints but i could also afford a x-t2 or x-t20, though they are much more expensive. on a german site for used electronics i found an x-t1 for 260€ used, one year warranty. is that still a good camera and a good deal?      \n\nlooking forward to join the fuji family!", "sortedWord": "None", "Identifyer": null, "identifyer": 60393, "year": "2020"}, {"autor": "PapaDole1995", "date": "2020-07-16 21:02:54", "content": "Thoughts on the Fujifilm 50-230? /!/ I’ve been looking for a telephoto to fill the blind spots in my current kit (16mm 2.8, 35mm 2.0, 50mm 2.0) and I’ve been thinking about the 50-230. I’ve seen a lot of reviews that say it punches a lot harder than it’s price and build would suggest, and I mostly shoot outside in bright sun regardless so the lower than average aperture isn’t a deal breaker. Does anyone who have this lens have a mini impressions or review that can help me make a decision? Thanks all!", "link": "https://www.reddit.com/r/fujifilm/comments/hsickz/thoughts_on_the_fujifilm_50230/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "me make", "selectorShort": "make", "MarkedSent": "thoughts on the fujifilm 50-230? /!/ i’ve been looking for a telephoto to fill the blind spots in my current kit (16mm 2.8, 35mm 2.0, 50mm 2.0) and i’ve been thinking about the 50-230. i’ve seen a lot of reviews that say it punches a lot harder than it’s price and build would suggest, and i mostly shoot outside in bright sun regardless so the lower than average aperture isn’t a deal breaker. does anyone who have this lens have a mini impressions or review that can help -----> me !!!  -----> make !!!  a decision? thanks all!", "sortedWord": "None", "Identifyer": null, "identifyer": 60395, "year": "2020"}, {"autor": "freelancer01", "date": "2020-07-16 12:34:35", "content": "Meike 35mm or Pergear 35mm Lens? /!/ Hi there - I made a silly mistake a couple nights ago and ordered a Meike 35mm f1.6 from Amazon. It's on the way via snail mail due to arrive early next week.\n\nI say a mistake because shortly ordered I discovered the Pergear 35mm 1.6. It seems like its a 2020 released lens and would love to hear from anyone that might have one, or has used one? For $100 they seem cheap and cheerful which is what I'm going for.", "link": "https://www.reddit.com/r/fujifilm/comments/hs8tdd/meike_35mm_or_pergear_35mm_lens/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "meike 35mm or pergear 35mm lens? /!/ hi there - -----> i !!!  -----> made !!!  a silly mistake a couple nights ago and ordered a meike 35mm f1.6 from amazon. it's on the way via snail mail due to arrive early next week.\n\ni say a mistake because shortly ordered i discovered the pergear 35mm 1.6. it seems like its a 2020 released lens and would love to hear from anyone that might have one, or has used one? for $100 they seem cheap and cheerful which is what i'm going for.", "sortedWord": "None", "Identifyer": null, "identifyer": 60412, "year": "2020"}, {"autor": "danfern22", "date": "2020-04-30 18:35:18", "content": "Paracord Camera Wrist Strap - We all need Support /!/ Hi everyone right now is a difficult time for me and my family and if you could just take a look at my etsy page and perhaps buy a paracord camera wrist strap I make that would mean the world. \n\n[https://www.etsy.com/listing/765953429/paracord-camera-wrist-strap-for-dslr?ref=listings\\_manager\\_grid](https://www.etsy.com/listing/765953429/paracord-camera-wrist-strap-for-dslr?ref=listings_manager_grid)", "link": "https://www.reddit.com/r/fujifilm/comments/gb1ey3/paracord_camera_wrist_strap_we_all_need_support/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "paracord camera wrist strap - we all need support /!/ hi everyone right now is a difficult time for me and my family and if you could just take a look at my etsy page and perhaps buy a paracord camera wrist strap -----> i !!!  -----> make !!!  that would mean the world. \n\n[https://www.etsy.com/listing/765953429/paracord-camera-wrist-strap-for-dslr?ref=listings\\_manager\\_grid](https://www.etsy.com/listing/765953429/paracord-camera-wrist-strap-for-dslr?ref=listings_manager_grid)", "sortedWord": "None", "Identifyer": null, "identifyer": 60537, "year": "2020"}, {"autor": "TastyBathwater", "date": "2020-04-29 02:51:40", "content": "Can anyone help me with this issue I am having with some of my pictures? [x-t30, 35mm] /!/ I have this issue with some of my pictures and it drives me crazy. It becomes more prominent when I edit my jpeg files. It happens when I use my 35mm lens on my x-t30. See attached image for example. There are these weird lines that appear and ruin the image. Does anybody know why this is happening? What noob mistake am I making here? Thanks guys. \n\nhttps://preview.redd.it/pjoplmod8ov41.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=66ae3c0addbb16e21d039a5702134e59ea5abbfd", "link": "https://www.reddit.com/r/fujifilm/comments/ga1fs6/can_anyone_help_me_with_this_issue_i_am_having/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i making", "selectorShort": "make", "MarkedSent": "can anyone help me with this issue i am having with some of my pictures? [x-t30, 35mm] /!/ i have this issue with some of my pictures and it drives me crazy. it becomes more prominent when i edit my jpeg files. it happens when i use my 35mm lens on my x-t30. see attached image for example. there are these weird lines that appear and ruin the image. does anybody know why this is happening? what noob mistake am -----> i !!!  -----> making !!!  here? thanks guys. \n\nhttps://preview.redd.it/pjoplmod8ov41.jpg?width=6240&amp;format=pjpg&amp;auto=webp&amp;s=66ae3c0addbb16e21d039a5702134e59ea5abbfd", "sortedWord": "None", "Identifyer": null, "identifyer": 60580, "year": "2020"}, {"autor": "grobinsoniii", "date": "2020-01-29 18:34:53", "content": "Help! Two great cameras, but I must make a decision. /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/evqxq4/help_two_great_cameras_but_i_must_make_a_decision/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i must make", "selectorShort": "make", "MarkedSent": "help! two great cameras, but -----> i !!!  -----> must !!!  -----> make !!!  a decision. /!/ [removed]", "sortedWord": "None", "Identifyer": null, "identifyer": 60602, "year": "2020"}, {"autor": "Nautiliuz", "date": "2020-02-11 08:44:47", "content": "X100V or XT-3? (Ex x100s and xt20 owner) /!/ Hello everyone, like many of you I have a dilemma in my hands. Some background first - I've been a photographer for 13+ years. I shoot landscapes, architecture and street photography. I've had entry level DSLR's, I've had Nikon FF cameras and plenty of great lenses. I gave all of that up because it was just too heavy and I bought the x100s.I loved it, everything about it was fantastic, but after 2 years of shooting I really started to miss the telephoto perspective even though I had the TCL converter. I sold it and got the XT-20 with the 18-55 kit lens. Something just didn't click for me, I never liked the images that came out the same as I did with the x100s. I even got the 27mm pancake to try and get a similar feel, it didn't work. The last attempt was getting the 55-200mm for a trip in California and that lens provided a different perspective but at that point my bag was insanely heavy and I didn't want to take it anywhere, so I sold everything again. 6 months later I find myself looking for another camera to try and spark my love for photography again... And here comes the dilemma. I know what the X100v will give me and I'm sure that I will love it, but the price is a bit steep. Looking at the second hand market, I can get the XT-3 with a lens for that money or an X-Pro2.  My concern here is if my disappointment with the XT-20 was not in the lenses...and I will be making the same mistake again. \n\nThank you", "link": "https://www.reddit.com/r/fujifilm/comments/f25o3h/x100v_or_xt3_ex_x100s_and_xt20_owner/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i will be making", "selectorShort": "make", "MarkedSent": "x100v or xt-3? (ex x100s and xt20 owner) /!/ hello everyone, like many of you i have a dilemma in my hands. some background first - i've been a photographer for 13+ years. i shoot landscapes, architecture and street photography. i've had entry level dslr's, i've had nikon ff cameras and plenty of great lenses. i gave all of that up because it was just too heavy and i bought the x100s.i loved it, everything about it was fantastic, but after 2 years of shooting i really started to miss the telephoto perspective even though i had the tcl converter. i sold it and got the xt-20 with the 18-55 kit lens. something just didn't click for me, i never liked the images that came out the same as i did with the x100s. i even got the 27mm pancake to try and get a similar feel, it didn't work. the last attempt was getting the 55-200mm for a trip in california and that lens provided a different perspective but at that point my bag was insanely heavy and i didn't want to take it anywhere, so i sold everything again. 6 months later i find myself looking for another camera to try and spark my love for photography again... and here comes the dilemma. i know what the x100v will give me and i'm sure that i will love it, but the price is a bit steep. looking at the second hand market, i can get the xt-3 with a lens for that money or an x-pro2.  my concern here is if my disappointment with the xt-20 was not in the lenses...and -----> i !!!  -----> will !!!  -----> be !!!  -----> making !!!  the same mistake again. \n\nthank you", "sortedWord": "None", "Identifyer": null, "identifyer": 61327, "year": "2020"}, {"autor": "ericbza", "date": "2020-12-16 23:10:54", "content": "af light doesn't work on fujifilm x-t4 /!/ i just got my x-t4 and overall i'm really impressed. however, the af light doesn't turn on, even when its too dark for the normal focus to work. i have turned af light on in the settings, and i made sure that the led is working. i haven't found anything online. can anyone help me?", "link": "https://www.reddit.com/r/fujifilm/comments/keki2s/af_light_doesnt_work_on_fujifilm_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "af light doesn't work on fujifilm x-t4 /!/ i just got my x-t4 and overall i'm really impressed. however, the af light doesn't turn on, even when its too dark for the normal focus to work. -----> i !!!  have turned af light on in the settings, and -----> i !!!  -----> made !!!  sure that the led is working. i haven't found anything online. can anyone help me?", "sortedWord": "None", "Identifyer": null, "identifyer": 62256, "year": "2020"}, {"autor": "bubb1ez", "date": "2020-08-25 21:39:32", "content": "Selling my X-100F for an X-Pro3 /!/ I have been considering selling my X-100F and purchasing an X-Pro3. \n\nMy x100F has been my favourite camera I’ve owned to date. There is just a joy it sparks from just picking it up. The combination of handling and film simulations, often means I reach for that over my A7iii for personal shooting.\n\n&amp;#x200B;\n\nLately I have been considering an upgrade. My first thought being the 100V, and there are certainly enough reasons for myself to justify that upgrade. However, this camera being a personal companion to my main camera, a bit more flexibility would be awesome. So I started to look at the xPro3. It carries the features I love from my x100F but of course offers the freedom to change lenses.\n\n&amp;#x200B;\n\nThere are a couple of reservations that I have. The first is buying into another ecosystem. In addition to selling the x100F, I would also be selling my a6500 as I no longer use this, but my a7iii is my primary camera. Honestly, if the thought of selling all my Sony gear didn’t terrify me, I probably would switch all my gear to Fuji. But given the investment I’ve made on lenses for Sony, buying lenses I own Sony equivalents of seems unwise.\n\nThe second is size. The size of the x100F was one of the factors in first getting it. It was much easier keeping it in my everyday bag than my a7iii with a lens attached. The xpro3 would still certainly be smaller than my a7iii, so I’m not sure size is too much of an issue comparing it to the x100F.\n\n&amp;#x200B;\n\nAnyone have any thoughts or words of wisdom?", "link": "https://www.reddit.com/r/fujifilm/comments/iglqg0/selling_my_x100f_for_an_xpro3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve made", "selectorShort": "make", "MarkedSent": "selling my x-100f for an x-pro3 /!/ i have been considering selling my x-100f and purchasing an x-pro3. \n\nmy x100f has been my favourite camera i’ve owned to date. there is just a joy it sparks from just picking it up. the combination of handling and film simulations, often means i reach for that over my a7iii for personal shooting.\n\n&amp;#x200b;\n\nlately i have been considering an upgrade. my first thought being the 100v, and there are certainly enough reasons for myself to justify that upgrade. however, this camera being a personal companion to my main camera, a bit more flexibility would be awesome. so i started to look at the xpro3. it carries the features i love from my x100f but of course offers the freedom to change lenses.\n\n&amp;#x200b;\n\nthere are a couple of reservations that i have. the first is buying into another ecosystem. in addition to selling the x100f, i would also be selling my a6500 as i no longer use this, but my a7iii is my primary camera. honestly, if the thought of selling all my sony gear didn’t terrify me, i probably would switch all my gear to fuji. but given the investment -----> i !!! ’ve -----> made !!!  on lenses for sony, buying lenses -----> i !!!  own sony equivalents of seems unwise.\n\nthe second is size. the size of the x100f was one of the factors in first getting it. it was much easier keeping it in my everyday bag than my a7iii with a lens attached. the xpro3 would still certainly be smaller than my a7iii, so i’m not sure size is too much of an issue comparing it to the x100f.\n\n&amp;#x200b;\n\nanyone have any thoughts or words of wisdom?", "sortedWord": "None", "Identifyer": null, "identifyer": 62590, "year": "2020"}, {"autor": "ndunning", "date": "2020-10-11 21:03:12", "content": "X-pro 2 view mode settings /!/ I'm sure my X100 can do this and wondering how to set up my xpro2 to do the same...\n\n&amp;#x200B;\n\nHow do I make it so that I only use the viewfinder to shoot but when I push the menu button, it pops up on the rear screen? At the moment I have only figured out how to make the viewfinder work solely but then the menu also only pops up in the viewfinder which is a pain to navigate.\n\nIf you push the playback button in viewfinder only mode, the images pop up on the back of the camera.", "link": "https://www.reddit.com/r/fujifilm/comments/j9dh8u/xpro_2_view_mode_settings/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x-pro 2 view mode settings /!/ -----> i !!! 'm sure my x100 can do this and wondering how to set up my xpro2 to do the same...\n\n&amp;#x200b;\n\nhow do -----> i !!!  -----> make !!!  it so that -----> i !!!  only use the viewfinder to shoot but when -----> i !!!  push the menu button, it pops up on the rear screen? at the moment i have only figured out how to make the viewfinder work solely but then the menu also only pops up in the viewfinder which is a pain to navigate.\n\nif you push the playback button in viewfinder only mode, the images pop up on the back of the camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 62739, "year": "2020"}, {"autor": "Nolesman357", "date": "2020-08-10 21:19:02", "content": "Beginner Camera: X-E3 w/18-55 lens /!/ Should I buy a used X-E3 with the 18-55 kit lens for $679 USD? Is that a good deal? The camera is in good condition. I know almost nothing about photography and am looking to start. I’ve been browsing lots of different subs and watched YouTube videos, and I’m kinda sold on Fuji, but I don’t know if I should look for cheaper options or a DSLR. The max I wanna spend is $700 so the X-E3 is within my budget. I just want some insight from experienced photography connoisseurs before I make any investments in my photography future.", "link": "https://www.reddit.com/r/fujifilm/comments/i7dvzj/beginner_camera_xe3_w1855_lens/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "beginner camera: x-e3 w/18-55 lens /!/ should i buy a used x-e3 with the 18-55 kit lens for $679 usd? is that a good deal? the camera is in good condition. i know almost nothing about photography and am looking to start. i’ve been browsing lots of different subs and watched youtube videos, and i’m kinda sold on fuji, but i don’t know if i should look for cheaper options or a dslr. the max i wanna spend is $700 so the x-e3 is within my budget. -----> i !!!  just want some insight from experienced photography connoisseurs before -----> i !!!  -----> make !!!  any investments in my photography future.", "sortedWord": "None", "Identifyer": null, "identifyer": 62971, "year": "2020"}, {"autor": "mackventure", "date": "2020-03-31 19:47:44", "content": "It’s finally time! But need help narrowing it down! /!/ Howdy fuji-people,\n\nI’ve shot film for the better part of 8 years, and as a college student this isn’t the cheapest. During this time of over-sleeping and social distancing I’ve come to the conclusion that I’m making the inevitable switch to digital.  \n\nI think I’ve narrowed it down to a few cameras and just wanted some other peoples inputs without watching another 50 hours of the same YouTube review.  \n  \nI’m between: x-pro1, x-t1, and x-e3.  \n\nA little background, I shoot mostly street bs, close quarters venue photography, and architecture. Video isn’t super important to me, and the lenses I’ll figure out later. For the time being I’ll just pick up an adaptor for some of the film lenses I have.  \n\nLet me know what y’all think, thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/fsjtvb/its_finally_time_but_need_help_narrowing_it_down/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’m making", "selectorShort": "make", "MarkedSent": "it’s finally time! but need help narrowing it down! /!/ howdy fuji-people,\n\ni’ve shot film for the better part of 8 years, and as a college student this isn’t the cheapest. during this time of over-sleeping and social distancing -----> i !!! ’ve come to the conclusion that -----> i !!! ’m -----> making !!!  the inevitable switch to digital.  \n\ni think i’ve narrowed it down to a few cameras and just wanted some other peoples inputs without watching another 50 hours of the same youtube review.  \n  \ni’m between: x-pro1, x-t1, and x-e3.  \n\na little background, i shoot mostly street bs, close quarters venue photography, and architecture. video isn’t super important to me, and the lenses i’ll figure out later. for the time being i’ll just pick up an adaptor for some of the film lenses i have.  \n\nlet me know what y’all think, thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 63111, "year": "2020"}, {"autor": "TheRootedCorpse", "date": "2020-09-16 04:12:01", "content": "I finally made the switch. Goodbye Canon.", "link": "https://www.reddit.com/r/fujifilm/comments/itokau/i_finally_made_the_switch_goodbye_canon/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> finally !!!  -----> made !!!  the switch. goodbye canon.", "sortedWord": "None", "Identifyer": null, "identifyer": 63505, "year": "2020"}, {"autor": "TheRootedCorpse", "date": "2020-09-16 04:09:46", "content": "I finally made the switch. Goodbye Canon.", "link": "https://www.reddit.com/r/fujifilm/comments/itoj5i/i_finally_made_the_switch_goodbye_canon/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> finally !!!  -----> made !!!  the switch. goodbye canon.", "sortedWord": "None", "Identifyer": null, "identifyer": 63506, "year": "2020"}, {"autor": "ElioLanz", "date": "2020-12-07 23:37:27", "content": "[Help] X100F vs XE-3 /!/ I’ve been shooting film for almost 10 years and I’ve never owned a digital camera.\nI am not a professional and I don’t make a living out of photography. This is a hobby I take very seriously though. I primarily shoot cityscapes, urban life (not street photography per se; I mean not people crossing streets or whatever without them noticing me) and some portraits.\n\nI want a small and lightweight camera that’s easy to carry around and that doesn’t get too much in the way. I’m interested in taking photos more than in having to deal all the time with the gear. \nI need an EVF, I prefer prime lenses (on film I’m very used to 50mm) and portability is key.\n\nI’ve narrowed my options to the Fuji X100F and the XE-3. For the latter, I was thinking about the 35mm f2 lens. The pancake 27mm seems nice but the lack of an aperture ring bugs me. \nI love the look of both cameras. I reckon the XE-3 is bigger though. I’ve heard is more noisy.\nI’ve read about the sticky shutter problem on the x100f. It seems more portable and lightweight than the XE-3.\n\nCould you please share your experiences and thoughts? Thanks.", "link": "https://www.reddit.com/r/fujifilm/comments/k8shek/help_x100f_vs_xe3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i don’t make", "selectorShort": "make", "MarkedSent": "[help] x100f vs xe-3 /!/ i’ve been shooting film for almost 10 years and i’ve never owned a digital camera.\n-----> i !!!  am not a professional and -----> i !!!  -----> do !!! -----> n’t !!!  -----> make !!!  a living out of photography. this is a hobby i take very seriously though. i primarily shoot cityscapes, urban life (not street photography per se; i mean not people crossing streets or whatever without them noticing me) and some portraits.\n\ni want a small and lightweight camera that’s easy to carry around and that doesn’t get too much in the way. i’m interested in taking photos more than in having to deal all the time with the gear. \ni need an evf, i prefer prime lenses (on film i’m very used to 50mm) and portability is key.\n\ni’ve narrowed my options to the fuji x100f and the xe-3. for the latter, i was thinking about the 35mm f2 lens. the pancake 27mm seems nice but the lack of an aperture ring bugs me. \ni love the look of both cameras. i reckon the xe-3 is bigger though. i’ve heard is more noisy.\ni’ve read about the sticky shutter problem on the x100f. it seems more portable and lightweight than the xe-3.\n\ncould you please share your experiences and thoughts? thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 63564, "year": "2020"}, {"autor": "XTutorials", "date": "2020-12-07 09:59:56", "content": "I wrote the perfect book for any Fujifilm beginner /!/ Hello there,\n\nI spent the last few months writing a book entitled \"The Complete Guide for A Fujifilm Beginner\". As the title says, this book is made for all first-time Fujifilm user, or for any first-time camera (which is Fujifilm) user. The book contains a multitude of important chapters, such as a guide on buying the right Fujifilm camera for you, along with numerous other guides and tips. The book has 168 pages and it also has a few bonuses, such as a mini photographic term dictionary. Overall the book will make the process of getting used to your camera much easier, and in my opinion this should be a must-buy for any beginner. This doesn't mean a more experienced user can't buy it, as anyone can learn something new every day.\n\nI'm sorry if this sounds like an advertisement, but this is the first book I published and since it's related to Fujifilm and I thought this is a good place to talk about it. I'm also aware that this book doesn't look and feel like a professional one, but its content is still good enough, considering its affordable price. As you will see, the book has the First Edition subtitle. If there's enough demand, along with community support, I will start making a second version of the book, with what the community suggests to make it an even better, up-to-date book.\n\nFor anyone interested, you can find it already on Amazon ( [here](https://www.amazon.com/Complete-Guide-Fujifilm-Beginner-First-ebook/dp/B08PS899X5/ref=sr_1_6?dchild=1&amp;keywords=fujifilm&amp;qid=1607335048&amp;s=digital-text&amp;sr=1-6) ) , but it will be available soon on Google Play and Apple iBooks.\n\nThank you for your attention.", "link": "https://www.reddit.com/r/fujifilm/comments/k8duqs/i_wrote_the_perfect_book_for_any_fujifilm_beginner/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i will start making", "selectorShort": "make", "MarkedSent": "i wrote the perfect book for any fujifilm beginner /!/ hello there,\n\ni spent the last few months writing a book entitled \"the complete guide for a fujifilm beginner\". as the title says, this book is made for all first-time fujifilm user, or for any first-time camera (which is fujifilm) user. the book contains a multitude of important chapters, such as a guide on buying the right fujifilm camera for you, along with numerous other guides and tips. the book has 168 pages and it also has a few bonuses, such as a mini photographic term dictionary. overall the book will make the process of getting used to your camera much easier, and in my opinion this should be a must-buy for any beginner. this doesn't mean a more experienced user can't buy it, as anyone can learn something new every day.\n\ni'm sorry if this sounds like an advertisement, but this is the first book i published and since it's related to fujifilm and i thought this is a good place to talk about it. i'm also aware that this book doesn't look and feel like a professional one, but its content is still good enough, considering its affordable price. as you will see, the book has the first edition subtitle. if there's enough demand, along with community support, -----> i !!!  -----> will !!!  -----> start !!!  -----> making !!!  a second version of the book, with what the community suggests to make it an even better, up-to-date book.\n\nfor anyone interested, you can find it already on amazon ( [here](https://www.amazon.com/complete-guide-fujifilm-beginner-first-ebook/dp/b08ps899x5/ref=sr_1_6?dchild=1&amp;keywords=fujifilm&amp;qid=1607335048&amp;s=digital-text&amp;sr=1-6) ) , but it will be available soon on google play and apple ibooks.\n\nthank you for your attention.", "sortedWord": "None", "Identifyer": null, "identifyer": 63597, "year": "2020"}, {"autor": "monkeychip30", "date": "2020-04-07 01:21:00", "content": "I made a wooden frame for my 90 instax photos! I’m a photographer and woodworker, thought it would be a great way to finally showcase all these little memories.", "link": "https://www.reddit.com/r/fujifilm/comments/fwb9l0/i_made_a_wooden_frame_for_my_90_instax_photos_im/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a wooden frame for my 90 instax photos! i’m a photographer and woodworker, thought it would be a great way to finally showcase all these little memories.", "sortedWord": "None", "Identifyer": null, "identifyer": 63648, "year": "2020"}, {"autor": "rjcamargo", "date": "2020-01-10 08:40:17", "content": "Dynamic range question (problem?) /!/ Hey guys,\n\nRecently I made the switch from Sony to an XT-3. I’ve been having troubles with the dynamic range of the camera. I take pictures like [this](https://imgur.com/cM3uOE0) where I can only expose either the sky or the trees. I’m aware that the sun is pointing right at me and stuff but sometimes it happens on a regular cloudy day.\n\nI come from using an a6000 which I think it doesn’t compare to the XT-3, and I didn’t have a problem whatsoever with the dynamic range with that camera. I know I could save the pictures in post, but one of the reason I made the switch was for the jpegs straight out of camera, so that shouldn’t be the solution.\n\nMy setting are DR100% with DR priority off. This happens with both Pro Neg and Classic Chrome, Velvia not si much, but I don’t enjoy that one so much. Anyone can point me what I might be doing wrong or any setting I should change?\n\nThanks in advance", "link": "https://www.reddit.com/r/fujifilm/comments/emo8wr/dynamic_range_question_problem/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "dynamic range question (problem?) /!/ hey guys,\n\nrecently -----> i !!!  -----> made !!!  the switch from sony to an xt-3. i’ve been having troubles with the dynamic range of the camera. i take pictures like [this](https://imgur.com/cm3uoe0) where i can only expose either the sky or the trees. i’m aware that the sun is pointing right at me and stuff but sometimes it happens on a regular cloudy day.\n\ni come from using an a6000 which i think it doesn’t compare to the xt-3, and i didn’t have a problem whatsoever with the dynamic range with that camera. i know i could save the pictures in post, but one of the reason i made the switch was for the jpegs straight out of camera, so that shouldn’t be the solution.\n\nmy setting are dr100% with dr priority off. this happens with both pro neg and classic chrome, velvia not si much, but i don’t enjoy that one so much. anyone can point me what i might be doing wrong or any setting i should change?\n\nthanks in advance", "sortedWord": "None", "Identifyer": null, "identifyer": 63739, "year": "2020"}, {"autor": "thisisludicrous-", "date": "2020-12-24 11:12:20", "content": "X series x-t30 /!/ Hi everyone! So I’ve been wanting a new camera for a while, and went into my local camera shop hoping to look at a canon 90d, they didn’t have one but my eyes landed on a fujifilm x series x-t30 and I was instantly interested! It’s a lot different to the kind of thing I wanted, but I love the look of it and when I had a quick go with it it seemed great and easy to use! \nCould anyone please tell me some benefits or downfalls to it if possible? I’d like to know as much as possible before I make the leap and buy it!", "link": "https://www.reddit.com/r/fujifilm/comments/kjdpyo/x_series_xt30/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x series x-t30 /!/ hi everyone! so i’ve been wanting a new camera for a while, and went into my local camera shop hoping to look at a canon 90d, they didn’t have one but my eyes landed on a fujifilm x series x-t30 and i was instantly interested! it’s a lot different to the kind of thing i wanted, but i love the look of it and when i had a quick go with it it seemed great and easy to use! \ncould anyone please tell me some benefits or downfalls to it if possible? -----> i !!! ’d like to know as much as possible before -----> i !!!  -----> make !!!  the leap and buy it!", "sortedWord": "None", "Identifyer": null, "identifyer": 64011, "year": "2020"}, {"autor": "adrianoasca", "date": "2020-01-26 05:35:41", "content": "XT20 + XF18-55mm - Opinion. /!/ Hi Guys,\n\nI'd like to confirm if I have made a good purchase, bought one xt20 with xf18-55 for $700.  I was willing to buy the XT30 with the same kit, but I would be paying more than $600. And I am not sure if it worth it. Also, I am a newbie, and this camera will be my first real. So, I will need to learn a lot about photography. :-)\n\n&amp;#x200B;\n\nSo, what do you think?\n\nThanks,", "link": "https://www.reddit.com/r/fujifilm/comments/eu2ris/xt20_xf1855mm_opinion/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "xt20 + xf18-55mm - opinion. /!/ hi guys,\n\n-----> i !!! 'd like to confirm if -----> i !!!  -----> have !!!  -----> made !!!  a good purchase, bought one xt20 with xf18-55 for $700.  i was willing to buy the xt30 with the same kit, but i would be paying more than $600. and i am not sure if it worth it. also, i am a newbie, and this camera will be my first real. so, i will need to learn a lot about photography. :-)\n\n&amp;#x200b;\n\nso, what do you think?\n\nthanks,", "sortedWord": "None", "Identifyer": null, "identifyer": 64202, "year": "2020"}, {"autor": "RareRibeye", "date": "2020-01-24 21:34:09", "content": "X100F or X-T3 for first-time photographer? /!/ My experience with cameras is basically limited to smartphones, and I’ve been wanting to make the jump to mirrorless in order to pick up photography as a hobby. \n\nI realize this question may seem odd as the cameras are for completely different customers (fixed vs. interchangeable lens), but I just wanted to get general thoughts from Fuji users. \n\nMy rough thought process is debating if I should go X100F in order to ease myself into photography, with a highly portable camera that will make me want to go out to take photos and learn. Then once I get some experience, I could sell the X100F and upgrade down the line. \n\nAlternatively, I could buy something like the XT-3 straight away. With this route, I’d have more flexibility with various lens options, weather resistance, photo/video quality, and so on. Disadvantages being double the weight/bulk and higher costs. \n\nIn reality, I’m actually wanting to debate the X100V vs. X-T4, but given these cameras are not yet announced, I wanted to pose a hypothetical question with their predecessors, to see what photographers would suggest for a beginner. I have ~$3K to spend, so I could get the higher end X-T with a decent prime lens to start, or go with the X100 line and save some money to start.", "link": "https://www.reddit.com/r/fujifilm/comments/etgzwe/x100f_or_xt3_for_firsttime_photographer/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve been wanting to make", "selectorShort": "make", "MarkedSent": "x100f or x-t3 for first-time photographer? /!/ my experience with cameras is basically limited -----> to !!!  smartphones, and -----> i !!! ’ve -----> been !!!  -----> wanting !!!  -----> to !!!  -----> make !!!  the jump -----> to !!!  mirrorless in order -----> to !!!  pick up photography as a hobby. \n\ni realize this question may seem odd as the cameras are for completely different customers (fixed vs. interchangeable lens), but i just wanted to get general thoughts from fuji users. \n\nmy rough thought process is debating if i should go x100f in order to ease myself into photography, with a highly portable camera that will make me want to go out to take photos and learn. then once i get some experience, i could sell the x100f and upgrade down the line. \n\nalternatively, i could buy something like the xt-3 straight away. with this route, i’d have more flexibility with various lens options, weather resistance, photo/video quality, and so on. disadvantages being double the weight/bulk and higher costs. \n\nin reality, i’m actually wanting to debate the x100v vs. x-t4, but given these cameras are not yet announced, i wanted to pose a hypothetical question with their predecessors, to see what photographers would suggest for a beginner. i have ~$3k to spend, so i could get the higher end x-t with a decent prime lens to start, or go with the x100 line and save some money to start.", "sortedWord": "None", "Identifyer": null, "identifyer": 64243, "year": "2020"}, {"autor": "Biandra", "date": "2020-07-10 23:40:28", "content": "Beginner. Got an X-T3, what I need to know/do? /!/ Hey everyone, \n\nOver the last 4 weeks I’ve been reading a lot, too much actually, on which camera to get. I have narrowed it down to Sony a6400 or the Fuji X-T3. I found a nice discount in Germany and pulled the trigger (credit card) on a X-T3 with the XF 18-55mm f / 2.8-4 R LM OIS kit lens basically for 100 Euros extra. (1.300 Euros in total).\n\nI have never owned any camera outside of my phone. This is my first camera ever. Some of you will say that’s an overkill, that I’m crazy and I should have started with something cheaper, and you’re totally right. But I see this as an investment on the long run, I don’t change gadgets every year and this will force me to learn proper techniques due to the investment that I made. \n\nThe main 2 reasons why I got a camera are:\n- Taking memory’s (photos and videos) of a newborn\n- Trips &amp; Vacation photos\n\n\nQuestions:\n1. Is there any tips &amp; tricks or settings changes that I absolutely have to do for the camera?\n2. Which tutorials you recommend for learning this camera/lens? \n3. Which accessories you guys recommend?\n4. I read a lot about RAW vs jpeg. For beginner, should I stick to jpeg or RAW it’s an absolut must for better quality?\n5. Which apps you recommend for the phone (iOS)?\n6. For newborn pictures, is this kit lens good enough? If not, which portrait lens you recommend (mostly indoor, and not the most expensive ones)\n\n\nI really do appreciate the effort that you’ve put into reading my message and answering these questions. \n\nThank you 🙏", "link": "https://www.reddit.com/r/fujifilm/comments/hoztdq/beginner_got_an_xt3_what_i_need_to_knowdo/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "beginner. got an x-t3, what i need to know/do? /!/ hey everyone, \n\nover the last 4 weeks i’ve been reading a lot, too much actually, on which camera to get. i have narrowed it down to sony a6400 or the fuji x-t3. i found a nice discount in germany and pulled the trigger (credit card) on a x-t3 with the xf 18-55mm f / 2.8-4 r lm ois kit lens basically for 100 euros extra. (1.300 euros in total).\n\ni have never owned any camera outside of my phone. this is my first camera ever. some of you will say that’s an overkill, that i’m crazy and i should have started with something cheaper, and you’re totally right. but -----> i !!!  see this as an investment on the long run, -----> i !!!  don’t change gadgets every year and this will force me to learn proper techniques due to the investment that -----> i !!!  -----> made !!! . \n\nthe main 2 reasons why i got a camera are:\n- taking memory’s (photos and videos) of a newborn\n- trips &amp; vacation photos\n\n\nquestions:\n1. is there any tips &amp; tricks or settings changes that i absolutely have to do for the camera?\n2. which tutorials you recommend for learning this camera/lens? \n3. which accessories you guys recommend?\n4. i read a lot about raw vs jpeg. for beginner, should i stick to jpeg or raw it’s an absolut must for better quality?\n5. which apps you recommend for the phone (ios)?\n6. for newborn pictures, is this kit lens good enough? if not, which portrait lens you recommend (mostly indoor, and not the most expensive ones)\n\n\ni really do appreciate the effort that you’ve put into reading my message and answering these questions. \n\nthank you 🙏", "sortedWord": "None", "Identifyer": null, "identifyer": 64337, "year": "2020"}, {"autor": "siemmcfc", "date": "2020-01-19 22:49:12", "content": "Today I tried to make a moped look fast. Fuji x-t3 18-55mm f/2.8-4", "link": "https://www.reddit.com/r/fujifilm/comments/er3rp1/today_i_tried_to_make_a_moped_look_fast_fuji_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i tried to make", "selectorShort": "make", "MarkedSent": "today -----> i !!!  -----> tried !!!  -----> to !!!  -----> make !!!  a moped look fast. fuji x-t3 18-55mm f/2.8-4", "sortedWord": "None", "Identifyer": null, "identifyer": 64390, "year": "2020"}, {"autor": "siemmcfc", "date": "2020-01-19 22:47:59", "content": "Today I tried to make a moped look fast. Fuji x-t3 18-55mm f/2.8-4", "link": "https://www.reddit.com/r/fujifilm/comments/er3r38/today_i_tried_to_make_a_moped_look_fast_fuji_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i tried to make", "selectorShort": "make", "MarkedSent": "today -----> i !!!  -----> tried !!!  -----> to !!!  -----> make !!!  a moped look fast. fuji x-t3 18-55mm f/2.8-4", "sortedWord": "None", "Identifyer": null, "identifyer": 64391, "year": "2020"}, {"autor": "kousuu", "date": "2020-07-29 22:54:43", "content": "Anyone know what this means on a Instax Wide 300? /!/ I've had my instax for 4 years now, my friend got cracker crumbs stuck in the aperture shortly after i got it, so its always had a bit of trouble opening and shutting all the way, but otherwise it's worked fine. I haven't really used it much in over a year, but last time i tried using it, it worked fine. But now when I try to turn it on, I get nothing, no mechanical whirring or anything. nada. The aperture is permanently stuck open now but i dont know if that has anything to do with it.\n\nI've tried replacing the batteries and making sure they're in the right way (hard to mess up on this camera since it has the little battery diagram right in the slots showing you which way to go.) Whenever I put in the last battery, the little screen will display '18 LD' and a thunderbolt symbol, before going dark. I've checked the inside, and my lens pegs are on the track and i can manually make the lens go in and out, i just cant get the damn thing to turn on and google has no fruit for me. Anyone know what I can do?\n\nI've tried using a needle to put isopropyl alcohol into the aperture to unstick it, but i've had no luck getting it to close again. But I really dont know if that has anything to do with it. The manual has been useless too. One suggestion was to replace the batteries while the lens was fully extended, which i have tried, but that didnt work either. If anyone can help, that would be very appreciated! I just bought 40$ worth of film before finding out the camera wasn't turning on, and I dont really want to have to buy a whole new camera.", "link": "https://www.reddit.com/r/fujifilm/comments/i0an8c/anyone_know_what_this_means_on_a_instax_wide_300/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can manually make", "selectorShort": "make", "MarkedSent": "anyone know what this means on a instax wide 300? /!/ i've had my instax for 4 years now, my friend got cracker crumbs stuck in the aperture shortly after i got it, so its always had a bit of trouble opening and shutting all the way, but otherwise it's worked fine. i haven't really used it much in over a year, but last time i tried using it, it worked fine. but now when i try to turn it on, i get nothing, no mechanical whirring or anything. nada. the aperture is permanently stuck open now but i dont know if that has anything to do with it.\n\ni've tried replacing the batteries and making sure they're in the right way (hard to mess up on this camera since it has the little battery diagram right in the slots showing you which way to go.) whenever i put in the last battery, the little screen will display '18 ld' and a thunderbolt symbol, before going dark. -----> i !!! 've checked the inside, and my lens pegs are on the track and -----> i !!!  -----> can !!!  -----> manually !!!  -----> make !!!  the lens go in and out, -----> i !!!  just cant get the damn thing to turn on and google has no fruit for me. anyone know what i can do?\n\ni've tried using a needle to put isopropyl alcohol into the aperture to unstick it, but i've had no luck getting it to close again. but i really dont know if that has anything to do with it. the manual has been useless too. one suggestion was to replace the batteries while the lens was fully extended, which i have tried, but that didnt work either. if anyone can help, that would be very appreciated! i just bought 40$ worth of film before finding out the camera wasn't turning on, and i dont really want to have to buy a whole new camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 64866, "year": "2020"}, {"autor": "freshwings421", "date": "2020-07-28 14:54:49", "content": "Anyone else is having white balance issues when on auto wb? /!/ Hi, so I have just recently made the switch to the Fujifilm X-T30 and with my old Canon I would usually shoot with the white balance on automatic and it does a fairly decent job. Minor readjustments in post and it is all good. I have a grey and white card for white balance but I would usually not use it on set to save time. \n\nBut with the Fuji, it seems that more often than not the auto wb is doing a terrible job, skin tones and colours are always weird after adding a bit of saturation ( I shoot in eterna) and doesnt matter how hard I try to bring it back to normal, the colours just stay looking weird.", "link": "https://www.reddit.com/r/fujifilm/comments/hzg2vg/anyone_else_is_having_white_balance_issues_when/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have just recently made", "selectorShort": "make", "MarkedSent": "anyone else is having white balance issues when on auto wb? /!/ hi, so -----> i !!!  -----> have !!!  -----> just !!!  -----> recently !!!  -----> made !!!  the switch to the fujifilm x-t30 and with my old canon -----> i !!!  would usually shoot with the white balance on automatic and it does a fairly decent job. minor readjustments in post and it is all good. i have a grey and white card for white balance but i would usually not use it on set to save time. \n\nbut with the fuji, it seems that more often than not the auto wb is doing a terrible job, skin tones and colours are always weird after adding a bit of saturation ( i shoot in eterna) and doesnt matter how hard i try to bring it back to normal, the colours just stay looking weird.", "sortedWord": "None", "Identifyer": null, "identifyer": 64898, "year": "2020"}, {"autor": "Fancy_Routine", "date": "2020-06-17 17:35:34", "content": "How to use global auto iso settings in quick menu profiles? /!/ Is there a way to globally overwrite the auto iso settings in the quick menu profiles with the global auto iso configuration?\n\nSay I want to change the \"auto iso 3\" mode to have 125 minimum shutter and 1600 maximum iso. It seems to me that I have to make this change for each of the 7 profiles (under I.Q. &gt; edit/save custom settings). Otherwise, if I just change it in the global shootings settings, then every time I use the quick menu to switch profiles, the global change gets overwritten by whatever \"auto 3\" was defined to do in the corresponding profile.\n\nIs there a better way to define what the 3 auto iso modes do? Preferrably in a single place?", "link": "https://www.reddit.com/r/fujifilm/comments/havz8a/how_to_use_global_auto_iso_settings_in_quick_menu/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i have to make", "selectorShort": "make", "MarkedSent": "how to use global auto iso settings in quick menu profiles? /!/ is there a way to globally overwrite the auto iso settings in the quick menu profiles with the global auto iso configuration?\n\nsay i want to change the \"auto iso 3\" mode to have 125 minimum shutter and 1600 maximum iso. it seems -----> to !!!  me that -----> i !!!  -----> have !!!  -----> to !!!  -----> make !!!  this change for each of the 7 profiles (under i.q. &gt; edit/save custom settings). otherwise, if i just change it in the global shootings settings, then every time i use the quick menu to switch profiles, the global change gets overwritten by whatever \"auto 3\" was defined to do in the corresponding profile.\n\nis there a better way to define what the 3 auto iso modes do? preferrably in a single place?", "sortedWord": "None", "Identifyer": null, "identifyer": 65498, "year": "2020"}, {"autor": "Fearisnotreal", "date": "2020-11-11 18:12:46", "content": "Xs10 vs xt3 /!/ I want to make vlogs, do travel photography, and do photo shoots for my friends. Which camera would be better for me? I keep seeing that the xt3 has better specs but xs10 has ibis and is newer so idk? Any help would be appreciated", "link": "https://www.reddit.com/r/fujifilm/comments/jsdb8z/xs10_vs_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "xs10 vs xt3 /!/ -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  vlogs, do travel photography, and do photo shoots for my friends. which camera would be better for me? i keep seeing that the xt3 has better specs but xs10 has ibis and is newer so idk? any help would be appreciated", "sortedWord": "None", "Identifyer": null, "identifyer": 65966, "year": "2020"}, {"autor": "fulluphigh", "date": "2020-11-14 01:11:36", "content": "Tips on getting started with capture one? My fuji raws are blurry and distorted after processing /!/ Hi all, complete and total beginner with capture one (and off-camera post processing in general). I wanted to start using it for a few reasons, including organizing my shots, previewing film sims and edits on a larger screen, and learning to actually edit my raws. \n\nI'm shooting with a fuji xt30, and I'm not having any luck with getting the capture one jpgs to look anywhere near as good as the jpgs processed in-body on the camera.\nI was worried that capture one's reproductions of the film sims would be off, but they actually look 100% accurate, which is hype. But when I finally exported my first jpg it looked off. When I compared it to the one processed by the camera body, it's pretty dramatic. Not as bad as silkypix (at least there's no chromatic aberration), but still blurry and distorted.\n\nI haven't made any changes to settings, as I wouldn't know what to change... I also just assumed that the fujifilm specific version of the software would handle fuji raws optimally out of the box, in terms of sharpness and accuracy, at least. I'm processing raws and the software is picking up the correct lens and loading the correct lens profile. \"Diffraction correction\" wasn't checked by default, so I tried checking that, but no difference.\n\nHere's a pair of sample jpegs, one processed in the camera and the other in capture one, with no edits to either and the same film sim (yes, you have to zoom in a little to tell, it's not very noticable as a mobile thumbnail. It is very noticable full size or just full screen though =/): https://imgur.com/a/ugjNKZ0\n\nI read somewhere to try disabling hardware acceleration for processing, so I tried that, and it did indeed take longer, but no difference in the final image.\n\nFor some reason the default output resolution is 300 px/inch, so I tried changing that to 72 px/inch to match the camera jpgs, but didn't make any difference (what should it be set to, if not for print or web but just maximum jpeg quality?). The capture one output is slightly lower resolution, and I don't know what's up with that either? They clock in at 5959 x 3973, whereas the camera jpgs are 6240 x 4160. No idea what's causing that =/\n\nAside from that, not sure what else to add. I haven't messed with any edits, I'm using \"export variants...\", default settings except turned jpeg quality up to 100, sRGB ICC profile, scale is \"fixed\" at 100%.\n\nAnd I apologize if I'm missing something super basic =( I confess I haven't even checked any tutorials yet, just tried jumping in and seeing where it would get me. If one of the tutorials in the sidebar would sort this out for me, please feel free to just point me at it and tell me to shut up until I've properly educated myself =p\n\nTl;dr: my capture one jpgs are coming out blurry and distorted compared to the camera body jpgs, and I don't know why. I assumed capture one would match the camera body by default, but if that was a faulty assumption, could anyone point me to some tips or a profile to use as a starting place to get the same results as the camera SoC gives?\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/jtssxe/tips_on_getting_started_with_capture_one_my_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i haven't made", "selectorShort": "make", "MarkedSent": "tips on getting started with capture one? my fuji raws are blurry and distorted after processing /!/ hi all, complete and total beginner with capture one (and off-camera post processing in general). i wanted to start using it for a few reasons, including organizing my shots, previewing film sims and edits on a larger screen, and learning to actually edit my raws. \n\ni'm shooting with a fuji xt30, and i'm not having any luck with getting the capture one jpgs to look anywhere near as good as the jpgs processed in-body on the camera.\ni was worried that capture one's reproductions of the film sims would be off, but they actually look 100% accurate, which is hype. but when i finally exported my first jpg it looked off. when i compared it to the one processed by the camera body, it's pretty dramatic. not as bad as silkypix (at least there's no chromatic aberration), but still blurry and distorted.\n\n-----> i !!!  -----> have !!! -----> n't !!!  -----> made !!!  any changes to settings, as -----> i !!!  would-----> n't !!!  know what to change... i also just assumed that the fujifilm specific version of the software would handle fuji raws optimally out of the box, in terms of sharpness and accuracy, at least. i'm processing raws and the software is picking up the correct lens and loading the correct lens profile. \"diffraction correction\" wasn't checked by default, so i tried checking that, but no difference.\n\nhere's a pair of sample jpegs, one processed in the camera and the other in capture one, with no edits to either and the same film sim (yes, you have to zoom in a little to tell, it's not very noticable as a mobile thumbnail. it is very noticable full size or just full screen though =/): https://imgur.com/a/ugjnkz0\n\ni read somewhere to try disabling hardware acceleration for processing, so i tried that, and it did indeed take longer, but no difference in the final image.\n\nfor some reason the default output resolution is 300 px/inch, so i tried changing that to 72 px/inch to match the camera jpgs, but didn't make any difference (what should it be set to, if not for print or web but just maximum jpeg quality?). the capture one output is slightly lower resolution, and i don't know what's up with that either? they clock in at 5959 x 3973, whereas the camera jpgs are 6240 x 4160. no idea what's causing that =/\n\naside from that, not sure what else to add. i haven't messed with any edits, i'm using \"export variants...\", default settings except turned jpeg quality up to 100, srgb icc profile, scale is \"fixed\" at 100%.\n\nand i apologize if i'm missing something super basic =( i confess i haven't even checked any tutorials yet, just tried jumping in and seeing where it would get me. if one of the tutorials in the sidebar would sort this out for me, please feel free to just point me at it and tell me to shut up until i've properly educated myself =p\n\ntl;dr: my capture one jpgs are coming out blurry and distorted compared to the camera body jpgs, and i don't know why. i assumed capture one would match the camera body by default, but if that was a faulty assumption, could anyone point me to some tips or a profile to use as a starting place to get the same results as the camera soc gives?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 66277, "year": "2020"}, {"autor": "Kodama_95", "date": "2020-09-19 10:11:28", "content": "Recently got my first Fuji! Here is something I made on a random walk. (X100v, f.5.6, 1/125s, iso 160)", "link": "https://www.reddit.com/r/fujifilm/comments/ivpxra/recently_got_my_first_fuji_here_is_something_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "recently got my first fuji! here is something -----> i !!!  -----> made !!!  on a random walk. (x100v, f.5.6, 1/125s, iso 160)", "sortedWord": "None", "Identifyer": null, "identifyer": 66540, "year": "2020"}, {"autor": "MrMysteryBox", "date": "2020-10-26 17:47:20", "content": "X100v LCD Question /!/ Hey all,\n\nJust joined the family with an x100v! I'm absolutely in love with every thing about it. I have  quick question about the LCD. When shooting using the LCD, I see a preview that doesn't match the final image. On my g85,  any changes I make to SS/A/ISO etc. would be shown on the screen as I changed the settings. Is that possible on the X100v?\n\nBonus question,  when I was experimenting with the camera OoB, I was able to slightly digitally zoom by twisting the lense slightly near the aperture ring. I think I accidentally turned this function off somehow. If anyone could point me in the right direction,I would very much appreciate it. Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/jij9wa/x100v_lcd_question/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "x100v lcd question /!/ hey all,\n\njust joined the family with an x100v! i'm absolutely in love with every thing about it. i have  quick question about the lcd. when shooting using the lcd, i see a preview that doesn't match the final image. on my g85,  any changes -----> i !!!  -----> make !!!  to ss/a/iso etc. would be shown on the screen as -----> i !!!  changed the settings. is that possible on the x100v?\n\nbonus question,  when i was experimenting with the camera oob, i was able to slightly digitally zoom by twisting the lense slightly near the aperture ring. i think i accidentally turned this function off somehow. if anyone could point me in the right direction,i would very much appreciate it. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 66919, "year": "2020"}, {"autor": "mdb616", "date": "2020-12-14 05:15:21", "content": "the xt-3 was the best purchase i’ve ever made", "link": "https://www.reddit.com/r/fujifilm/comments/kcr9n3/the_xt3_was_the_best_purchase_ive_ever_made/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i’ve ever made", "selectorShort": "make", "MarkedSent": "the xt-3 was the best purchase -----> i !!! ’ve -----> ever !!!  -----> made !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 67012, "year": "2020"}, {"autor": "grilledscheese", "date": "2020-11-25 14:19:24", "content": "Trouble getting x100f to connect to X RAW Studio /!/ Hey all, I'm wondering if I could get a bit of help figuring out how to use X RAW Studio. (I'm normally a C1 user, looking to try out a new tool though.)   \n\n\nWhere I'm running into problems is getting my x100f to connect to my macbook air -- I have turned the setting to USB Raw Conversion/Backup in the camera's settings, but the camera still doesn't register as being connected to the computer for this purpose. If I turn it off, I can charge it via USB no problem, but not get it set up for X RAW Studio. Any common fixes? Do I need to download another utility like Fuji X Acquire, to pair the two? \n\nI checked and it's not a firmware thing, I'm up to date on 2.11 for that. I can't seem to get the camera to click into USB conversion mode -- even when i select that in the menu, when i connect it with the computer and then turn the camera on, it goes into a normal shooting mode. The green light comes on when it is off (i assume its charging the battery then) and when it goes into sleep mode, but otherwise there's no USB connection mode i can seem to make work.\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/k0sz4e/trouble_getting_x100f_to_connect_to_x_raw_studio/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i can seem to make", "selectorShort": "make", "MarkedSent": "trouble getting x100f to connect to x raw studio /!/ hey all, i'm wondering if i could get a bit of help figuring out how to use x raw studio. (i'm normally a c1 user, looking to try out a new tool though.)   \n\n\nwhere i'm running into problems is getting my x100f to connect to my macbook air -- i have turned the setting to usb raw conversion/backup in the camera's settings, but the camera still doesn't register as being connected to the computer for this purpose. if i turn it off, i can charge it via usb no problem, but not get it set up for x raw studio. any common fixes? do i need to download another utility like fuji x acquire, to pair the two? \n\ni checked and it's not a firmware thing, i'm up to date on 2.11 for that. i can't seem to get the camera to click into usb conversion mode -- even when i select that in the menu, when i connect it with the computer and then turn the camera on, it goes into a normal shooting mode. the green light comes on when it is off (-----> i !!!  assume its charging the battery then) and when it goes into sleep mode, but otherwise there's no usb connection mode -----> i !!!  -----> can !!!  -----> seem !!!  -----> to !!!  -----> make !!!  work.\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 67081, "year": "2020"}, {"autor": "Sackpfeife", "date": "2020-01-23 20:41:59", "content": "Friend makes the knives, I make the pictures [x-t20, Konica Hexanon 40mm]", "link": "https://www.reddit.com/r/fujifilm/comments/esz2zw/friend_makes_the_knives_i_make_the_pictures_xt20/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "friend makes the knives, -----> i !!!  -----> make !!!  the pictures [x-t20, konica hexanon 40mm]", "sortedWord": "None", "Identifyer": null, "identifyer": 67511, "year": "2020"}, {"autor": "CptKiwiCanon", "date": "2020-07-24 13:39:46", "content": "Is this a good time to buy an X-T30? /!/ Hi!\n\n&amp;#x200B;\n\nI was presented this offer for a X-T30 with the 18-55 lens for 1215 EURO. I kind of need a camera right now for a trip I am making in a week. So I like to know if this camera is going to crash plummet in price in the near future or not?\n\n&amp;#x200B;\n\nAnyone knows?", "link": "https://www.reddit.com/r/fujifilm/comments/hx1yja/is_this_a_good_time_to_buy_an_xt30/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i am making", "selectorShort": "make", "MarkedSent": "is this a good time to buy an x-t30? /!/ hi!\n\n&amp;#x200b;\n\ni was presented this offer for a x-t30 with the 18-55 lens for 1215 euro. -----> i !!!  kind of need a camera right now for a trip -----> i !!!  -----> am !!!  -----> making !!!  in a week. so i like to know if this camera is going to crash plummet in price in the near future or not?\n\n&amp;#x200b;\n\nanyone knows?", "sortedWord": "None", "Identifyer": null, "identifyer": 67903, "year": "2020"}, {"autor": "Buzzy_SquareWave", "date": "2020-07-24 11:42:24", "content": "Advice needed buying a fuji camera /!/ I've been wanting to get into digital photography and fuji seemed like the brand that fits most what I'd want out of a camera. Now, I'm a hobbyist and I don't have much of a budget, so I lookied into the older models. I'm mostly interested in still images. I'm kinda doubting between two models now. The X-E2 and the original X100.\n\nI have acces to some vintage lensen, so with the X-E2, I thought I'd begin with using some of those with an adapter. I come from analog photography, so I'd be fine with focussing and setting aperture manually. I'm more worried about the crop factor, because I don't have many wide angle lensen. The widest would be my canon fd 35mm F2.8 lens, but that would add up to about 50mm or more? I still don't really understand how the crop factor affects the focal length of the lenses very well.\n\nNow with the X100 you'd already have a wide angle lens, which I like, but no options to switch out the lens. I think this wouldn't be so bad for me though, because I still have a lot to learn, and swapping out lenses a lot would be a big distraction as well.\n\nI'm interested what people think would be a better and more durable option for me. I'm no professional or anything, but I'd like to make pretty images. So which camera is more useable in 2020?\n\ntl;dr: Should I, a beginner, get an X-E2 with vintage lenses or an original X100?", "link": "https://www.reddit.com/r/fujifilm/comments/hx09ka/advice_needed_buying_a_fuji_camera/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i'd like to make", "selectorShort": "make", "MarkedSent": "advice needed buying a fuji camera /!/ i've been wanting to get into digital photography and fuji seemed like the brand that fits most what i'd want out of a camera. now, i'm a hobbyist and i don't have much of a budget, so i lookied into the older models. i'm mostly interested in still images. i'm kinda doubting between two models now. the x-e2 and the original x100.\n\ni have acces to some vintage lensen, so with the x-e2, i thought i'd begin with using some of those with an adapter. i come from analog photography, so i'd be fine with focussing and setting aperture manually. i'm more worried about the crop factor, because i don't have many wide angle lensen. the widest would be my canon fd 35mm f2.8 lens, but that would add up to about 50mm or more? i still don't really understand how the crop factor affects the focal length of the lenses very well.\n\nnow with the x100 you'd already have a wide angle lens, which i like, but no options to switch out the lens. i think this wouldn't be so bad for me though, because i still have a lot to learn, and swapping out lenses a lot would be a big distraction as well.\n\ni'm interested what people think would be a better and more durable option for me. -----> i !!! 'm no professional or anything, but -----> i !!! -----> 'd !!!  -----> like !!!  -----> to !!!  -----> make !!!  pretty images. so which camera is more useable in 2020?\n\ntl;dr: should i, a beginner, get an x-e2 with vintage lenses or an original x100?", "sortedWord": "None", "Identifyer": null, "identifyer": 67906, "year": "2020"}, {"autor": "jaserhunter", "date": "2020-07-01 22:56:05", "content": "I just made the switch from Nikon to Fuji, and I should have done it sooner. [X-T4 and 35mm f/1.4]", "link": "https://www.reddit.com/r/fujifilm/comments/hjl629/i_just_made_the_switch_from_nikon_to_fuji_and_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> just !!!  -----> made !!!  the switch from nikon to fuji, and -----> i !!!  should have done it sooner. [x-t4 and 35mm f/1.4]", "sortedWord": "None", "Identifyer": null, "identifyer": 67978, "year": "2020"}, {"autor": "glossuser", "date": "2020-07-01 19:00:22", "content": "which zoom lens to get? /!/ hi! i’m planning to purchase a fujifilm camera soon but the zoom lens aspect is very important to me. the entire reason i’m getting a camera is to take pictures of something that’s going to be far so i want to make sure i have a zoom lens to work with it. the cameras i’m looking at are either the x-t1 (probably used) or the x-t200 (new). my budget is pretty wiped after the camera itself so i’m thinking of getting a vintage manual lens. some examples are the sigma 18-250mm, Pentax-m 80-200mm, etc... please recommend me some other lenses like this too! i’m also wondering how to know if they’re compatible with the camera i’m buying? like they’re actually going to fit on the camera if i get them right lol...(???)", "link": "https://www.reddit.com/r/fujifilm/comments/hjgmfy/which_zoom_lens_to_get/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "which zoom lens to get? /!/ hi! i’m planning to purchase a fujifilm camera soon but the zoom lens aspect is very important to me. the entire reason -----> i !!! ’m getting a camera is -----> to !!!  take pictures of something that’s going -----> to !!!  be far so -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  have a zoom lens -----> to !!!  work with it. the cameras i’m looking at are either the x-t1 (probably used) or the x-t200 (new). my budget is pretty wiped after the camera itself so i’m thinking of getting a vintage manual lens. some examples are the sigma 18-250mm, pentax-m 80-200mm, etc... please recommend me some other lenses like this too! i’m also wondering how to know if they’re compatible with the camera i’m buying? like they’re actually going to fit on the camera if i get them right lol...(???)", "sortedWord": "None", "Identifyer": null, "identifyer": 67982, "year": "2020"}, {"autor": "gryff42", "date": "2020-06-30 23:47:16", "content": "What can we do to make Fujifilm realize a 65:24 ratio mode on X-series cameras? /!/ Think about it, a digital/portable/affordable X-Pan/TX-1/TX-2 would be a dream to come true. The GFX-cameras already feature this ratio, so Fuji knows people are interested in this format. \n\nI know there are workarounds for this format, but seeing and composing with that ratio right in the viewfinder and getting jpegs in that format would be a much better experience.\n\nI hope some of you agree, hopefully Fujifilm somehow becomes aware of people's interest in that format.", "link": "https://www.reddit.com/r/fujifilm/comments/hiz5kv/what_can_we_do_to_make_fujifilm_realize_a_6524/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "we do to make", "selectorShort": "make", "MarkedSent": "what can -----> we !!!  -----> do !!!  -----> to !!!  -----> make !!!  fujifilm realize a 65:24 ratio mode on x-series cameras? /!/ think about it, a digital/portable/affordable x-pan/tx-1/tx-2 would be a dream to come true. the gfx-cameras already feature this ratio, so fuji knows people are interested in this format. \n\ni know there are workarounds for this format, but seeing and composing with that ratio right in the viewfinder and getting jpegs in that format would be a much better experience.\n\ni hope some of you agree, hopefully fujifilm somehow becomes aware of people's interest in that format.", "sortedWord": "None", "Identifyer": null, "identifyer": 68002, "year": "2020"}, {"autor": "mysteriouskiwi", "date": "2020-07-08 12:24:17", "content": "Fuji X-T2 equivalent lens to Canon 70-200 F4/L IS? /!/ So I swapped my Canon setup for a Fuji setup a few years ago and I've loved every minute of it. Best decision I made for my hobby.\n\n60D to X-T2, trading in my lens sets and such in a complete ecosystem change. I miss the L glass, and could have adapted it, but wanted a clean slate. And looking at what people say about Fuji glass I was happy to try something new.\n\nOne thing I've really missed though is my old beautiful Canon 70-200 F4/L IS. It was my go to lens as I really enjoyed that focal length. I currently only have the kit for the Fuji as its a really damn good lens (especially compared to Canon's kit) and I haven't really had the time since making the swap to appreaciate and get back into photography.\n\nBut, I'd like to get back into it, and that focal length is really now getting an itchy spot for me again.\n\nI've looked around at Fuji's offerings and I'm not really sure which of their lenses best covers it. Any recommendations?", "link": "https://www.reddit.com/r/fujifilm/comments/hng3wv/fuji_xt2_equivalent_lens_to_canon_70200_f4l_is/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "fuji x-t2 equivalent lens to canon 70-200 f4/l is? /!/ so i swapped my canon setup for a fuji setup a few years ago and i've loved every minute of it. best decision -----> i !!!  -----> made !!!  for my hobby.\n\n60d to x-t2, trading in my lens sets and such in a complete ecosystem change. i miss the l glass, and could have adapted it, but wanted a clean slate. and looking at what people say about fuji glass i was happy to try something new.\n\none thing i've really missed though is my old beautiful canon 70-200 f4/l is. it was my go to lens as i really enjoyed that focal length. i currently only have the kit for the fuji as its a really damn good lens (especially compared to canon's kit) and i haven't really had the time since making the swap to appreaciate and get back into photography.\n\nbut, i'd like to get back into it, and that focal length is really now getting an itchy spot for me again.\n\ni've looked around at fuji's offerings and i'm not really sure which of their lenses best covers it. any recommendations?", "sortedWord": "None", "Identifyer": null, "identifyer": 68049, "year": "2020"}, {"autor": "KeepGoing15", "date": "2020-07-19 15:39:12", "content": "What focus mode is best for landscapes/mountains? XT-3 18-55 /!/ What focus mode do you use when shooting something in the mountains or landscapes in general? AF-S + Single point focus, Zone, or something else? I'm using the 18-55 lens. I've yet to take my XT-3 hiking, but when I do I want to make sure I'm shooting my shots with the best settings, or at least knowing what to avoid. Thanks!", "link": "https://www.reddit.com/r/fujifilm/comments/hu2g9n/what_focus_mode_is_best_for_landscapesmountains/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "what focus mode is best for landscapes/mountains? xt-3 18-55 /!/ what focus mode do you use when shooting something in the mountains or landscapes in general? af-s + single point focus, zone, or something else? i'm using the 18-55 lens. -----> i !!! 've yet -----> to !!!  take my xt-3 hiking, but when -----> i !!!  do -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure -----> i !!! 'm shooting my shots with the best settings, or at least knowing what -----> to !!!  avoid. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 68173, "year": "2020"}, {"autor": "Nudelstrudel_CH", "date": "2020-12-12 09:47:18", "content": "XF 50-140 Noises? /!/ I have bought a XF 50-140 lens for my X-T2 used online. Now after receiving it and using it for a quick test i noticed that as soon as its connected to the camera i makes a very subtle humming noise. Is that normal? Focus and zoom are working without noticeable problems.", "link": "https://www.reddit.com/r/fujifilm/comments/kbmjeg/xf_50140_noises/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i makes", "selectorShort": "make", "MarkedSent": "xf 50-140 noises? /!/ i have bought a xf 50-140 lens for my x-t2 used online. now after receiving it and using it for a quick test -----> i !!!  noticed that as soon as its connected to the camera -----> i !!!  -----> makes !!!  a very subtle humming noise. is that normal? focus and zoom are working without noticeable problems.", "sortedWord": "None", "Identifyer": null, "identifyer": 68423, "year": "2020"}, {"autor": "ShakyFuzz", "date": "2020-12-02 12:18:56", "content": "Question from a first time buyer /!/ I’m about to buy the X100V which will be my  first Fujifilm digital camera. I’m curious if I should check the amount of photos clicked (shutter count) and if it shouldn’t exceed a certain amount. I’m going to be purchasing a new camera from a Fujifilm endorsed shop and even though that’s seemingly safe, it’s a lot of money for me so I want to make sure that I cover all bases.", "link": "https://www.reddit.com/r/fujifilm/comments/k587fb/question_from_a_first_time_buyer/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "question from a first time buyer /!/ i’m about to buy the x100v which will be my  first fujifilm digital camera. i’m curious if i should check the amount of photos clicked (shutter count) and if it shouldn’t exceed a certain amount. i’m going to be purchasing a new camera from a fujifilm endorsed shop and even though that’s seemingly safe, it’s a lot of money for me so -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure that -----> i !!!  cover all bases.", "sortedWord": "None", "Identifyer": null, "identifyer": 68511, "year": "2020"}], "name": "makefujifilm2020"}