{"interestingcomments": [{"Unnamed: 0": 191760, "autor": "Bigdickshortguy", "date": 1622340964000, "content": "Need help!!! /!/ Just got an x-a5. Been charging all day, and it still won’t turn on. Yes I made sure the battery was charged while camera was in the off position. Yes I then turned it on and pressed the shutter button down half way to get the monitor to turn on. Yes I ejected the battery and tried it all again. Yes I tried charging it on a different outlet. Yes the green charging light shows that “it’s apparently charging”! Help.... suggestions... tips?", "link": "https://www.reddit.com/r/fujifilm/comments/no1gh5/need_help/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help!!! /!/ just got an x-a5. been charging all day, and it still won’t turn on. yes i made sure the battery was charged while camera was in the off -----> position !!! . yes i then turned it on and pressed the shutter button down half way to get the monitor to turn on. yes i ejected the battery and tried it all again. yes i tried charging it on a different outlet. yes the green charging light shows that “it’s apparently charging”! help.... suggestions... tips?", "sortedWord": "None", "identifyer": 84549, "year": "2021"}, {"Unnamed: 0": 192819, "autor": "tkeichler18", "date": 1611786802000, "content": "Trees and snow. Fuji X-T200. 15-45mm kit lens. Messing around with the “Scene Position” setting and the snow shooting feature.", "link": "https://www.reddit.com/r/fujifilm/comments/l6gcn9/trees_and_snow_fuji_xt200_1545mm_kit_lens_messing/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "trees and snow. fuji x-t200. 15-45mm kit lens. messing around with the “scene -----> position !!! ” setting and the snow shooting feature.", "sortedWord": "None", "identifyer": 85657, "year": "2021"}, {"Unnamed: 0": 194494, "autor": "P3nguin_God", "date": 1617850298000, "content": "What is the best all-rounder lens for the X-T4 under $400? /!/ Do you know what the best lensbwould be fpr an all rounder shooting video and photo?\n\nI originally got the Kamalan 28mm f1.4 manual lens with my X-T4 a few days ago for $150 and I dont like it. Probably going to return it.\n\nThe focusing is so hard to use and I have to get the second ring in the exact right position which is hard to tell from a 3 inch screen. And if I move forward or backwards at all, it goes out of focus and I have to manually change the focus again mid-video.\n\nI need a lens that can auto focus and is good for video on YouTube + shooting stock photos of landscapes. I was thinking about the Fringer EF-FX PRO II + Sigma 18-35mm F1.8 but that would be around $1100 which is out of my budget right now because I'm looking for something under $370 or $400. I'll eventually get those two in the future though.\n\nI found the regular Fuji Film Lens XF 18-55mm F2.8-4.0 at $329 but I was wondering if anyone knows an all rounder that is even better around the same price?", "link": "https://www.reddit.com/r/fujifilm/comments/mmie5p/what_is_the_best_allrounder_lens_for_the_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what is the best all-rounder lens for the x-t4 under $400? /!/ do you know what the best lensbwould be fpr an all rounder shooting video and photo?\n\ni originally got the kamalan 28mm f1.4 manual lens with my x-t4 a few days ago for $150 and i dont like it. probably going to return it.\n\nthe focusing is so hard to use and i have to get the second ring in the exact right -----> position !!!  which is hard to tell from a 3 inch screen. and if i move forward or backwards at all, it goes out of focus and i have to manually change the focus again mid-video.\n\ni need a lens that can auto focus and is good for video on youtube + shooting stock photos of landscapes. i was thinking about the fringer ef-fx pro ii + sigma 18-35mm f1.8 but that would be around $1100 which is out of my budget right now because i'm looking for something under $370 or $400. i'll eventually get those two in the future though.\n\ni found the regular fuji film lens xf 18-55mm f2.8-4.0 at $329 but i was wondering if anyone knows an all rounder that is even better around the same price?", "sortedWord": "None", "identifyer": 87415, "year": "2021"}, {"Unnamed: 0": 195824, "autor": "zborro66", "date": 1609957270000, "content": "What Fuji should I get? /!/ Hi all. I've been shooting Nikon for a while now.\n\nI started with a DX 24 megapixel entry-level camera (D5200) and worked my way up to the beautiful D700 (12 mp but unique rendition, heavy as hell, durable, awesome ergonomics and feeling, great low light capability), so now I'm used to that level of quality.\n\nI was thinking of buying a Fujifilm camera for various reasons: they're sexy, most are lightweight, they're great pieces of technology and they're mirrorless. I have some old Topcor lenses I cannot adapt to my Nikon cameras because the rear element protrudes inward too much and would damage the mirror. In addition I kinda want to get into lomography, as there are many yard sales and street markets where I could find some vintage lenses.\n\nI've looked at all Fuji cameras, reviews and specs and I'm leaning towards a used X-E2 or X-E2s, but I need some advice.\n\nWhat I'm looking for:\n\n* More than 12 megapixels, preferably 16 or 24\n* Portability, light weight, good ergos (I really like the position of the viewfinder in the E and pro series)\n* Good low light capability, low/pleasant noise\n* Fast viewfinder (I tried the X-E1 but it's painfully slow)\n* Smooth experience\n* A sensor with good rendition and good color, that doesn't produce subpar images (I know most of that depends on the lens, but the sensor plays a part too)\n* Relatively \"cheap\", I still don't know the budget\n* A good \"feel\" in the hands\n\nJust for reference, my go-to used photo store has these prices (some cameras are out of stock):\n\nX-H1 (\\~950€), X-T1 (\\~360€), X-Pro1 (\\~350€), X-T10 (\\~370€), X-T100 (\\~370€), X-E1 (\\~180€), X-A1 (\\~340€), X-A1 (\\~250€), X-T2 (\\~650€), X-T20 (\\~500€), X-T200 (\\~590€), X-E2s (\\~320€), X-T3 (\\~950€), X-E3 (\\~490€), X-T4 (\\~1450€)\n\n&amp;#x200B;\n\nThanks in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/krtp4l/what_fuji_should_i_get/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what fuji should i get? /!/ hi all. i've been shooting nikon for a while now.\n\ni started with a dx 24 megapixel entry-level camera (d5200) and worked my way up to the beautiful d700 (12 mp but unique rendition, heavy as hell, durable, awesome ergonomics and feeling, great low light capability), so now i'm used to that level of quality.\n\ni was thinking of buying a fujifilm camera for various reasons: they're sexy, most are lightweight, they're great pieces of technology and they're mirrorless. i have some old topcor lenses i cannot adapt to my nikon cameras because the rear element protrudes inward too much and would damage the mirror. in addition i kinda want to get into lomography, as there are many yard sales and street markets where i could find some vintage lenses.\n\ni've looked at all fuji cameras, reviews and specs and i'm leaning towards a used x-e2 or x-e2s, but i need some advice.\n\nwhat i'm looking for:\n\n* more than 12 megapixels, preferably 16 or 24\n* portability, light weight, good ergos (i really like the -----> position !!!  of the viewfinder in the e and pro series)\n* good low light capability, low/pleasant noise\n* fast viewfinder (i tried the x-e1 but it's painfully slow)\n* smooth experience\n* a sensor with good rendition and good color, that doesn't produce subpar images (i know most of that depends on the lens, but the sensor plays a part too)\n* relatively \"cheap\", i still don't know the budget\n* a good \"feel\" in the hands\n\njust for reference, my go-to used photo store has these prices (some cameras are out of stock):\n\nx-h1 (\\~950€), x-t1 (\\~360€), x-pro1 (\\~350€), x-t10 (\\~370€), x-t100 (\\~370€), x-e1 (\\~180€), x-a1 (\\~340€), x-a1 (\\~250€), x-t2 (\\~650€), x-t20 (\\~500€), x-t200 (\\~590€), x-e2s (\\~320€), x-t3 (\\~950€), x-e3 (\\~490€), x-t4 (\\~1450€)\n\n&amp;#x200b;\n\nthanks in advance!", "sortedWord": "None", "identifyer": 88805, "year": "2021"}, {"Unnamed: 0": 196300, "autor": "SuccuHand", "date": 1633530956000, "content": "X-S10 - File Transfer via App painfully slow /!/ Hi,\n\nso I really like my new X-S10. It is an upgrade from X-T200. Both are very good cameras, with X-T200 having a better screen and X-S10 more processing power and customization (C1..4-modes = Quality-of-Life!). It's also good to have a Bayer Sensor (X-T200) and a X-Trans Sensor (X-S10). \n\nAfter I get the hang out of the Android Fuji App, I'm nearly always able to connect and transfer pictures.\n\nHowever, I noticed, that the file transfer from X-S10 is so much slower than from X-T200 - it is not even funny. X-T200 is like 4x faster. With X-S10 it takes like 5 Minutes to get 10 Pics.\n\n&amp;#x200B;\n\nDoes someone know some tweaks how to improve it? Is it based on the metallic case? Are there some positions at which the transfer is faster? Did I have bad luck with my model?", "link": "https://www.reddit.com/r/fujifilm/comments/q2lr0c/xs10_file_transfer_via_app_painfully_slow/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "x-s10 - file transfer via app painfully slow /!/ hi,\n\nso i really like my new x-s10. it is an upgrade from x-t200. both are very good cameras, with x-t200 having a better screen and x-s10 more processing power and customization (c1..4-modes = quality-of-life!). it's also good to have a bayer sensor (x-t200) and a x-trans sensor (x-s10). \n\nafter i get the hang out of the android fuji app, i'm nearly always able to connect and transfer pictures.\n\nhowever, i noticed, that the file transfer from x-s10 is so much slower than from x-t200 - it is not even funny. x-t200 is like 4x faster. with x-s10 it takes like 5 minutes to get 10 pics.\n\n&amp;#x200b;\n\ndoes someone know some tweaks how to improve it? is it based on the metallic case? are there some -----> positions !!!  at which the transfer is faster? did i have bad luck with my model?", "sortedWord": "None", "identifyer": 89298, "year": "2021"}, {"Unnamed: 0": 199470, "autor": "arctanx-1", "date": 1617506447000, "content": "Which models have the scene positions? /!/ I'm looking for a list of Fujifilm cameras that have the scene position options. My wife wants to upgrade from our x20. Any help would be appreciated!", "link": "https://www.reddit.com/r/fujifilm/comments/mjnxjy/which_models_have_the_scene_positions/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "which models have the scene -----> positions !!! ? /!/ i'm looking for a list of fujifilm cameras that have the scene position options. my wife wants to upgrade from our x20. any help would be appreciated!", "sortedWord": "None", "identifyer": 92630, "year": "2021"}, {"Unnamed: 0": 201007, "autor": "4fips", "date": 1621283505000, "content": "Resetting the focus point back to the central position on X-E4 /!/ I wonder, can I click the joystick on X-E4  (twice) to reset the focus point back to the central position? This works on my X-T30 and I believe on other Fujis as well. But I read somewhere that this might not be the case on X-E4, where the BACK button needs to be used for centering the focus point (this also works on X-T30, but I don't like this method that much). Can someone familiar with X-E4 comment on that. Thanks", "link": "https://www.reddit.com/r/fujifilm/comments/ner0ss/resetting_the_focus_point_back_to_the_central/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "resetting the focus point back to the central -----> position !!!  on x-e4 /!/ i wonder, can i click the joystick on x-e4  (twice) to reset the focus point back to the central position? this works on my x-t30 and i believe on other fujis as well. but i read somewhere that this might not be the case on x-e4, where the back button needs to be used for centering the focus point (this also works on x-t30, but i don't like this method that much). can someone familiar with x-e4 comment on that. thanks", "sortedWord": "None", "identifyer": 94243, "year": "2021"}], "name": "positionfujifilm2021"}