{"interestingcomments": [{"autor": "WaBearUltra", "date": "2021-07-07 04:53:42", "content": "Just a RIP to my Fuji XPro1 . It died today after a great hike /!/ The wifey and I went to the narrows in Zion National Park and did most of the hike before turning around and making our way back. I took photos all along the way and had great fun in doing so. \n\nFor anyone who wants to know, no I didn’t get it wet. I have a personal ring system that I use. I have a shoulder sling that screws into the base and then I 3D printed a ring that I use a decoration and safety for these situations. I put it around my pinky and it holds it above waist level.\n\nSo yeah, it’s dead. I’m going to try one more thing that probably isn’t it and that’s a different battery. I am in Utah and can’t get a battery so I am pronouncing it dead prematurely but I’ll do a small, “it’s alive!” Post if it is just the battery. Both are 12 years old, battery and camera so either one went or they both did.", "link": "https://www.reddit.com/r/fujifilm/comments/ofc2pl/just_a_rip_to_my_fuji_xpro1_it_died_today_after_a/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "just a rip to my fuji xpro1 . it died today after a great hike /!/ the wifey and i went to the narrows in zion national park and did most of the hike before turning around and making our way back. i took photos all along the way and had great fun in doing so. \n\nfor anyone who wants to know, no i didn’t get it wet. i have a personal ring system that i use. i have a shoulder sling that screws into the base and then i -----> 3d !!!  -----> printed !!!  a ring that i use a decoration and safety for these situations. i put it around my pinky and it holds it above waist level.\n\nso yeah, it’s dead. i’m going to try one more thing that probably isn’t it and that’s a different battery. i am in utah and can’t get a battery so i am pronouncing it dead prematurely but i’ll do a small, “it’s alive!” post if it is just the battery. both are 12 years old, battery and camera so either one went or they both did.", "sortedWord": "None", "Identifyer": null, "identifyer": 88277, "year": "2021"}, {"autor": "TapesNStuff", "date": "2021-02-19 14:48:42", "content": "F-stop lever for X-100 series? /!/ Hey all, \n\nWhat I'm looking for is a little hard to describe, but it's basically some sort of lever that makes it easier to change the aperture on a X-100. If you ever saw a QL-17 from back in the day, [they have a lever](https://upload.wikimedia.org/wikipedia/commons/d/d2/Canonet_QL17.jpg) so its easier to change the f-stop. \n\nI can do it now, but between carpal tunnel and my hand being fat it's not as easy as I'd like. I figured there has to be some sort of adaptor out there, or even a 3d printed solution. \n\nThanks.", "link": "https://www.reddit.com/r/fujifilm/comments/lnhlew/fstop_lever_for_x100_series/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "f-stop lever for x-100 series? /!/ hey all, \n\nwhat i'm looking for is a little hard to describe, but it's basically some sort of lever that makes it easier to change the aperture on a x-100. if you ever saw a ql-17 from back in the day, [they have a lever](https://upload.wikimedia.org/wikipedia/commons/d/d2/canonet_ql17.jpg) so its easier to change the f-stop. \n\ni can do it now, but between carpal tunnel and my hand being fat it's not as easy as i'd like. i figured there has to be some sort of adaptor out there, or even a -----> 3d !!!  -----> printed !!!  solution. \n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 93967, "year": "2021"}], "name": "printfujifilm2021"}