{"interestingcomments": [{"Unnamed: 0": 190424, "autor": "koken1337", "date": 1630336277000, "content": "Fujifilm XS-10 with 18-55 Lens, Good first canera? Where to buy? /!/ Hello,\n\nThinking about getting my wife her first nice camera. She’s really into photography and making little short videos and I think it’s probably time she’s upgraded from her point and shoot Cannon.\n\nMy first question is, do you think this is a good first camera?\n\nMy second question is, where to even buy one of these? It seems like the kit with the 18-55 lens is sold out everywhere I look. Am I looking in the wrong spots?", "link": "https://www.reddit.com/r/fujifilm/comments/pek0q7/fujifilm_xs10_with_1855_lens_good_first_canera/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "fujifilm xs-10 with 18-55 lens, good first canera? where to buy? /!/ hello,\n\nthinking about getting my wife her first nice camera. she’s really into photography and making little short videos and i think it’s probably time she’s upgraded from her point and shoot cannon.\n\nmy first question is, do you think this is a good first camera?\n\nmy second question is, where to even buy one of these? it seems like the kit with the 18-55 lens is sold out everywhere i look. am i looking in the wrong -----> spots !!! ?", "sortedWord": "None", "identifyer": 83169, "year": "2021"}, {"Unnamed: 0": 191272, "autor": "dashelltheshell", "date": 1631645563000, "content": "California car spotting with Kodak Porta 400 film sim [X-T4 +56mm 1.2]", "link": "https://www.reddit.com/r/fujifilm/comments/po90xi/california_car_spotting_with_kodak_porta_400_film/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "california car -----> spotting !!!  with kodak porta 400 film sim [x-t4 +56mm 1.2]", "sortedWord": "None", "identifyer": 84043, "year": "2021"}, {"Unnamed: 0": 192389, "autor": "NaturallyAdorkable", "date": 1615923083000, "content": "Looking for advice for buying a Fujifilm mirrorless camera /!/ As the title says, I'm looking for advice for buying a Fujifilm mirrorless camera. I currently own a Canon 5D (original model) and a bunch of EF primes (20mm, 28mm, 50mm, and 100mm). As much as I love my current system, my 5D is quite old and I am not sure I would be willing to invest on a expensive DSLR replacement. Also, even when using these lightweight primes, the whole kit is still quite bulky and weights a lot. So I am currently considering to sell my camera and jump into the mirrorless bandwagon.\n\nI was hoping you guys and gals could help me narrow down a couple of models that I should consider. Here are a couple of thoughts about it:\n\n* I tend to prefer working with primes, as I really enjoy fast apertures. 35mm to 50mm  (in full-frame) is my sweet spot\n* I prefer mechanical controls and dials whenever possible, so cameras like the X100, X-T, X-Pro, etc. are quite attractive in that regard\n* I do end up cropping most of my photos in a ratio of 1:1 or 5:4, so any camera that would be able to show me crop lines for these proportions in the viewfinder would be an excellent plus (not sure if this is a feature as I never played around with these Fujifilm cameras)\n* I don't need the latest and shiniest camera; I am also hoping to be able to sell my lenses and camera and not have to put up more money on it\n* I tend to shoot raw but I am quite conservative with how much I edit my photos. I've heard wonderful things about the film simulation and jpg files created by the Fujifilm cameras.\n\nCurrently, the camera that is attracting me the most is the Fujifilm X100V. Would it be worth the price difference from a X100F? Or are there other models I should consider? \n\nMany thanks in advance!", "link": "https://www.reddit.com/r/fujifilm/comments/m6h9j0/looking_for_advice_for_buying_a_fujifilm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for advice for buying a fujifilm mirrorless camera /!/ as the title says, i'm looking for advice for buying a fujifilm mirrorless camera. i currently own a canon 5d (original model) and a bunch of ef primes (20mm, 28mm, 50mm, and 100mm). as much as i love my current system, my 5d is quite old and i am not sure i would be willing to invest on a expensive dslr replacement. also, even when using these lightweight primes, the whole kit is still quite bulky and weights a lot. so i am currently considering to sell my camera and jump into the mirrorless bandwagon.\n\ni was hoping you guys and gals could help me narrow down a couple of models that i should consider. here are a couple of thoughts about it:\n\n* i tend to prefer working with primes, as i really enjoy fast apertures. 35mm to 50mm  (in full-frame) is my sweet -----> spot !!! \n* i prefer mechanical controls and dials whenever possible, so cameras like the x100, x-t, x-pro, etc. are quite attractive in that regard\n* i do end up cropping most of my photos in a ratio of 1:1 or 5:4, so any camera that would be able to show me crop lines for these proportions in the viewfinder would be an excellent plus (not sure if this is a feature as i never played around with these fujifilm cameras)\n* i don't need the latest and shiniest camera; i am also hoping to be able to sell my lenses and camera and not have to put up more money on it\n* i tend to shoot raw but i am quite conservative with how much i edit my photos. i've heard wonderful things about the film simulation and jpg files created by the fujifilm cameras.\n\ncurrently, the camera that is attracting me the most is the fujifilm x100v. would it be worth the price difference from a x100f? or are there other models i should consider? \n\nmany thanks in advance!", "sortedWord": "None", "identifyer": 85208, "year": "2021"}, {"Unnamed: 0": 192574, "autor": "EddysPen", "date": 1614336881000, "content": "What are the three spots on the top corner of my lens?", "link": "https://www.reddit.com/r/fujifilm/comments/lsvbcp/what_are_the_three_spots_on_the_top_corner_of_my/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are the three -----> spots !!!  on the top corner of my lens?", "sortedWord": "None", "identifyer": 85407, "year": "2021"}, {"Unnamed: 0": 192609, "autor": "M3GATR0N12", "date": 1614270533000, "content": "Are the spots from the camera or the lens? How do I figure this out/fix it?", "link": "https://www.reddit.com/r/fujifilm/comments/lsago1/are_the_spots_from_the_camera_or_the_lens_how_do/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are the -----> spots !!!  from the camera or the lens? how do i figure this out/fix it?", "sortedWord": "None", "identifyer": 85442, "year": "2021"}, {"Unnamed: 0": 193075, "autor": "GratefulCake", "date": 1630985145000, "content": "White spot on photos. Cant tell if dust or broken pixel? /!/ Pics: https://imgur.com/a/dCO317W/ \n\nYou have to zoom in the photo significantly to see it. You cant notice from an uncropped or unzoomed image. Certain photos it looks brighter than others. There is also a second dot at the top of the image but its harder to notice. Tried different lenses so Im guessing its the sensor so I took the sensor to get cleaned a few days ago and its still there. When i look at the sensor under certain direction of light I can see what looks like a microscopic spec (idk if dust or dried water tiny dot) on the sensor. So I bought sensor swabs and solution and will try to clean myself soon. \n\nNoticed its been in photos from a couple months ago. Do you think its a stuck piece of dust or broken pixel? Sorry I guess I have OCD but I figured id ask here if anyone might know or have something similar with theres?", "link": "https://www.reddit.com/r/fujifilm/comments/pjewp0/white_spot_on_photos_cant_tell_if_dust_or_broken/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "white -----> spot !!!  on photos. cant tell if dust or broken pixel? /!/ pics: https://imgur.com/a/dco317w/ \n\nyou have to zoom in the photo significantly to see it. you cant notice from an uncropped or unzoomed image. certain photos it looks brighter than others. there is also a second dot at the top of the image but its harder to notice. tried different lenses so im guessing its the sensor so i took the sensor to get cleaned a few days ago and its still there. when i look at the sensor under certain direction of light i can see what looks like a microscopic spec (idk if dust or dried water tiny dot) on the sensor. so i bought sensor swabs and solution and will try to clean myself soon. \n\nnoticed its been in photos from a couple months ago. do you think its a stuck piece of dust or broken pixel? sorry i guess i have ocd but i figured id ask here if anyone might know or have something similar with theres?", "sortedWord": "None", "identifyer": 85927, "year": "2021"}, {"Unnamed: 0": 193747, "autor": "Zersorger", "date": 1629556984000, "content": "Sweet spot for macro extension tubes and lenses? /!/ Hey, I was wondering if anyone tested macro extension tubes (10/11mm and 16mm) with Fuji lenses and if there are some sweet spot cpmbinations to uses that give a good working distance with a high magnification number? I got a XF 18-55mm, 27mm and XC 50-230mm, but I believe in my case the 27mm works best so far.", "link": "https://www.reddit.com/r/fujifilm/comments/p8snka/sweet_spot_for_macro_extension_tubes_and_lenses/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sweet -----> spot !!!  for macro extension tubes and lenses? /!/ hey, i was wondering if anyone tested macro extension tubes (10/11mm and 16mm) with fuji lenses and if there are some sweet spot cpmbinations to uses that give a good working distance with a high magnification number? i got a xf 18-55mm, 27mm and xc 50-230mm, but i believe in my case the 27mm works best so far.", "sortedWord": "None", "identifyer": 86629, "year": "2021"}, {"Unnamed: 0": 193911, "autor": "Picz4funatl", "date": 1629944516000, "content": "Red-Spotted Purple; XS10 16-80", "link": "https://www.reddit.com/r/fujifilm/comments/pbq6ws/redspotted_purple_xs10_1680/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "red------> spotted !!!  purple; xs10 16-80", "sortedWord": "None", "identifyer": 86799, "year": "2021"}, {"Unnamed: 0": 194047, "autor": "Viv_Winternight", "date": 1624309292000, "content": "Is the 1.4x converter a must have for wildlife? /!/ As per title.\nGot the 100-400mm and it's good, yes, but up to a point. Many stars need to align in order to get the best results. Most of the time, simply you cannot get close to your subjects (physical barriers, or far too shy birds).\n\nTo put in context: in order to get a more than decent shot of a common Whitethroat in my local patch I had to wait 2 months, so that I could get at approximately 5 meters from it. Before that, it was just a brown spot in a see of vegetation.\n\nNow I got the chance to increase the reach with the converter, but I know that I'll lose aperture and perhaps struggle a bit more to nail the focus, especially in low light conditions.\n\nI can't visually quantify the gain in magnification. Is there a website I can check out?\n\nI'm learning to play around the lens reach limitations simply by snapping different photos.\n\nIf I can save those £400 (approx), I will be very happy because I want the x100V.. 😁\n\nThank you!", "link": "https://www.reddit.com/r/fujifilm/comments/o55g8q/is_the_14x_converter_a_must_have_for_wildlife/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is the 1.4x converter a must have for wildlife? /!/ as per title.\ngot the 100-400mm and it's good, yes, but up to a point. many stars need to align in order to get the best results. most of the time, simply you cannot get close to your subjects (physical barriers, or far too shy birds).\n\nto put in context: in order to get a more than decent shot of a common whitethroat in my local patch i had to wait 2 months, so that i could get at approximately 5 meters from it. before that, it was just a brown -----> spot !!!  in a see of vegetation.\n\nnow i got the chance to increase the reach with the converter, but i know that i'll lose aperture and perhaps struggle a bit more to nail the focus, especially in low light conditions.\n\ni can't visually quantify the gain in magnification. is there a website i can check out?\n\ni'm learning to play around the lens reach limitations simply by snapping different photos.\n\nif i can save those £400 (approx), i will be very happy because i want the x100v.. 😁\n\nthank you!", "sortedWord": "None", "identifyer": 86938, "year": "2021"}, {"Unnamed: 0": 194169, "autor": "xSickBoyx", "date": 1623565883000, "content": "Lens recommendation XT3 /!/ I currently have an XT3 with a 23mm 1.4  which is an incredible lens. So incredible, that I believe that for over a year I've been in my comfort zone with compositions. It's the only lens I own for Fuji as I normally am in confined spaces when shooting for clients and at home. But I want to keep learning and maximize my camera. I shoot mostly lifestyle photography, so I never really consider telephoto lenses. I'm having doubts as to how to challenge myself and improve. \n\nWhenever I go to BHphoto for lenses, I'm always considering how much different my shots would look vs. my 23 mm and if the difference is negligible.  Although the 18 mm looks really interesting, I'm always (probably incorrectly) assuming that the difference won't be much. The 23 mm is just so in the middle. \n\nI've only seen Fuji lenses, I'm not aware of other brands with interesting focal lengths. My budget is &gt;$1000. I'm open to zoom lenses although mostly enjoy prime. Any recommendations?  I know it's a lot of personal preferences and intentions, but if you've been in a similar spot I'd appreciate any comments. Thank you.", "link": "https://www.reddit.com/r/fujifilm/comments/nyqeds/lens_recommendation_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens recommendation xt3 /!/ i currently have an xt3 with a 23mm 1.4  which is an incredible lens. so incredible, that i believe that for over a year i've been in my comfort zone with compositions. it's the only lens i own for fuji as i normally am in confined spaces when shooting for clients and at home. but i want to keep learning and maximize my camera. i shoot mostly lifestyle photography, so i never really consider telephoto lenses. i'm having doubts as to how to challenge myself and improve. \n\nwhenever i go to bhphoto for lenses, i'm always considering how much different my shots would look vs. my 23 mm and if the difference is negligible.  although the 18 mm looks really interesting, i'm always (probably incorrectly) assuming that the difference won't be much. the 23 mm is just so in the middle. \n\ni've only seen fuji lenses, i'm not aware of other brands with interesting focal lengths. my budget is &gt;$1000. i'm open to zoom lenses although mostly enjoy prime. any recommendations?  i know it's a lot of personal preferences and intentions, but if you've been in a similar -----> spot !!!  i'd appreciate any comments. thank you.", "sortedWord": "None", "identifyer": 87061, "year": "2021"}, {"Unnamed: 0": 194278, "autor": "arvmedia1", "date": 1623032055000, "content": "Does anyone know what this white spot is?", "link": "https://www.reddit.com/r/fujifilm/comments/nu1kmq/does_anyone_know_what_this_white_spot_is/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone know what this white -----> spot !!!  is?", "sortedWord": "None", "identifyer": 87178, "year": "2021"}, {"Unnamed: 0": 194619, "autor": "Agaac1", "date": 1624836220000, "content": "Weird magenta spots on all my X-T3 pictures.", "link": "https://www.reddit.com/r/fujifilm/comments/o9846c/weird_magenta_spots_on_all_my_xt3_pictures/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird magenta -----> spots !!!  on all my x-t3 pictures.", "sortedWord": "None", "identifyer": 87546, "year": "2021"}, {"Unnamed: 0": 194620, "autor": "Agaac1", "date": 1624835976000, "content": "Weird magenta spots in all photos? Has anyone ever experienced this?", "link": "https://www.reddit.com/r/fujifilm/comments/o981ov/weird_magenta_spots_in_all_photos_has_anyone_ever/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird magenta -----> spots !!!  in all photos? has anyone ever experienced this?", "sortedWord": "None", "identifyer": 87547, "year": "2021"}, {"Unnamed: 0": 194664, "autor": "malko2", "date": 1624797878000, "content": "Spotted! (Milan)", "link": "https://www.reddit.com/r/fujifilm/comments/o8weiw/spotted_milan/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! ! (milan)", "sortedWord": "None", "identifyer": 87594, "year": "2021"}, {"Unnamed: 0": 195355, "autor": "enjoi_romain", "date": 1626284458000, "content": "[X100v] Same spot than my last post, different mood.", "link": "https://www.reddit.com/r/fujifilm/comments/ok9gqo/x100v_same_spot_than_my_last_post_different_mood/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[x100v] same -----> spot !!!  than my last post, different mood.", "sortedWord": "None", "identifyer": 88309, "year": "2021"}, {"Unnamed: 0": 195967, "autor": "vicariou5", "date": 1610392492000, "content": "Found this lush spot in a concrete jungle | Fuji XT-20, 35mm, 0.95 (Noise: Strong, Simulation: Pro Neg Std (edited))", "link": "https://www.reddit.com/r/fujifilm/comments/kv9nrh/found_this_lush_spot_in_a_concrete_jungle_fuji/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "found this lush -----> spot !!!  in a concrete jungle | fuji xt-20, 35mm, 0.95 (noise: strong, simulation: pro neg std (edited))", "sortedWord": "None", "identifyer": 88949, "year": "2021"}, {"Unnamed: 0": 196236, "autor": "xtravbx", "date": 1633613943000, "content": "Golden Orb weaver spotted on my way to work today. X100V.", "link": "https://www.reddit.com/r/fujifilm/comments/q39anp/golden_orb_weaver_spotted_on_my_way_to_work_today/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "golden orb weaver -----> spotted !!!  on my way to work today. x100v.", "sortedWord": "None", "identifyer": 89231, "year": "2021"}, {"Unnamed: 0": 196286, "autor": "teal_quartz", "date": 1633539935000, "content": "Switch from X100V to X-T3... What am I gaining? /!/ The X100V is fantastic and the 23 mm (35 mm equivalent) focal length is good for 90% of what I photograph. HOWEVER, I *have* started to get curious about other focal lengths or zooms. My question is, assuming I keep the X100V and 23 mm lens, will another midrange length feel too similar? What telephoto threshold do you think would make you significantly adjust your style or the way you use the lens? The 23 mm lens is wide enough for me. I mostly photograph the usual stuff (my people, events, a day trip around the city, nature, etc), but my passion is street photography. I want better photos of people, but without invading their space too much. As much as I know establishing a rapport with people is part of \"street\", many people just want to go about their day and I like the candid shots best, which you lose getting too close. I just worry if I go too long, keeping the wide depth of field to keep things in focus will be too tough for street photography and too narrow for tight spaces, but that any other wider angle lens will just feel too close to the X100V and be a waste of money.\n\nIn most situations, I can move forward and back several feet, or I can crop a bit if I have to. To my naive eye, 35 and 50 mm (and everything in between) seem so close, like I could just move forward a bit and have the same composition. Where would you start if you wanted something much different, but usable for a wide range of genres?\n\nI am looking at a used X-T3 with the XF 18-55 mm, but my X100V falls right in the middle of that range and likely has better sharpness. Can't decide if it's just GAS and I should use my X100V differently. Or whether I could really gain some new perspective from using the 18 and 55 mm endpoints. I am also open to a new prime at the more telephoto end, but hoping the 18-55 mm helps me find that sweet spot. The image quality will be the same in both cameras. I have all the features I need in the X100V. It's really just the focal length as the variation.\n\nThoughts?", "link": "https://www.reddit.com/r/fujifilm/comments/q2or19/switch_from_x100v_to_xt3_what_am_i_gaining/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "switch from x100v to x-t3... what am i gaining? /!/ the x100v is fantastic and the 23 mm (35 mm equivalent) focal length is good for 90% of what i photograph. however, i *have* started to get curious about other focal lengths or zooms. my question is, assuming i keep the x100v and 23 mm lens, will another midrange length feel too similar? what telephoto threshold do you think would make you significantly adjust your style or the way you use the lens? the 23 mm lens is wide enough for me. i mostly photograph the usual stuff (my people, events, a day trip around the city, nature, etc), but my passion is street photography. i want better photos of people, but without invading their space too much. as much as i know establishing a rapport with people is part of \"street\", many people just want to go about their day and i like the candid shots best, which you lose getting too close. i just worry if i go too long, keeping the wide depth of field to keep things in focus will be too tough for street photography and too narrow for tight spaces, but that any other wider angle lens will just feel too close to the x100v and be a waste of money.\n\nin most situations, i can move forward and back several feet, or i can crop a bit if i have to. to my naive eye, 35 and 50 mm (and everything in between) seem so close, like i could just move forward a bit and have the same composition. where would you start if you wanted something much different, but usable for a wide range of genres?\n\ni am looking at a used x-t3 with the xf 18-55 mm, but my x100v falls right in the middle of that range and likely has better sharpness. can't decide if it's just gas and i should use my x100v differently. or whether i could really gain some new perspective from using the 18 and 55 mm endpoints. i am also open to a new prime at the more telephoto end, but hoping the 18-55 mm helps me find that sweet -----> spot !!! . the image quality will be the same in both cameras. i have all the features i need in the x100v. it's really just the focal length as the variation.\n\nthoughts?", "sortedWord": "None", "identifyer": 89283, "year": "2021"}, {"Unnamed: 0": 196454, "autor": "Loco0292", "date": 1635357694000, "content": "Recommendations for 28mm - 40mm prime lens /!/ I've been using the Fuji 23mm f2 and Takumar 55mm f1.8 on my XT3. I love both of these lenses, but I feel like the sweet spot for me is somewhere in the middle. I don't mind manual focusing, and I really like the character of vintage glass. Sharpness is not my biggest concern. I would like to keep my budget &lt;$300 if possible. I've been looking at the 7Artisans 35mm lenses (f0.95 and f1.2) along with a number of vintage options, but I would love get some outside opinions. I thought it might be worth getting the 7Artisans f1.2 along with a vintage lens with a different focal length, but was a little worried about the quality and quirkiness of the 7Artisans stuff. I do shoot a lot in low light and I appreciate interesting bokeh, so I'd like a relatively fast lens. Sorry if this is long winded. Thanks in advance for the help!", "link": "https://www.reddit.com/r/fujifilm/comments/qh2kym/recommendations_for_28mm_40mm_prime_lens/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "recommendations for 28mm - 40mm prime lens /!/ i've been using the fuji 23mm f2 and takumar 55mm f1.8 on my xt3. i love both of these lenses, but i feel like the sweet -----> spot !!!  for me is somewhere in the middle. i don't mind manual focusing, and i really like the character of vintage glass. sharpness is not my biggest concern. i would like to keep my budget &lt;$300 if possible. i've been looking at the 7artisans 35mm lenses (f0.95 and f1.2) along with a number of vintage options, but i would love get some outside opinions. i thought it might be worth getting the 7artisans f1.2 along with a vintage lens with a different focal length, but was a little worried about the quality and quirkiness of the 7artisans stuff. i do shoot a lot in low light and i appreciate interesting bokeh, so i'd like a relatively fast lens. sorry if this is long winded. thanks in advance for the help!", "sortedWord": "None", "identifyer": 89457, "year": "2021"}, {"Unnamed: 0": 196813, "autor": "Windows10HomeEdition", "date": 1631204107000, "content": "Anyone had experience with a black spot on the EVF of an X-Pro3? Saw this one on eBay and I wonder if it's worth the purchase?", "link": "https://www.reddit.com/r/fujifilm/comments/pl0y9x/anyone_had_experience_with_a_black_spot_on_the/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone had experience with a black -----> spot !!!  on the evf of an x-pro3? saw this one on ebay and i wonder if it's worth the purchase?", "sortedWord": "None", "identifyer": 89833, "year": "2021"}, {"Unnamed: 0": 197032, "autor": "Lemy64", "date": 1631798003000, "content": "Cruisin! Fleet of low riders spotted in Montreal! GFX 50s &amp; M mount TTartisans 50mm f0.95", "link": "https://www.reddit.com/r/fujifilm/comments/ppd25n/cruisin_fleet_of_low_riders_spotted_in_montreal/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "cruisin! fleet of low riders -----> spotted !!!  in montreal! gfx 50s &amp; m mount ttartisans 50mm f0.95", "sortedWord": "None", "identifyer": 90063, "year": "2021"}, {"Unnamed: 0": 197080, "autor": "gnosis3", "date": 1632086399000, "content": "Spotted! [XE1 XC50-230]", "link": "https://www.reddit.com/r/fujifilm/comments/prgrph/spotted_xe1_xc50230/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! ! [xe1 xc50-230]", "sortedWord": "None", "identifyer": 90112, "year": "2021"}, {"Unnamed: 0": 197285, "autor": "alizaman", "date": 1630897133000, "content": "Importing a japanese x-pro2 from ebay -- any reason i wouldn't want to do this? /!/ Hi everyone, long story short...\n\ni'm in the market for an X-Pro2. Availability is tough now and some of the japanese sellers on ebay have pretty fair deals. Is there any reason i would want to avoid a japan-sourced camera? i can't imagine there would be a problem, but just checking for blind spots. \n\nthanks!", "link": "https://www.reddit.com/r/fujifilm/comments/piqym2/importing_a_japanese_xpro2_from_ebay_any_reason_i/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "importing a japanese x-pro2 from ebay -- any reason i wouldn't want to do this? /!/ hi everyone, long story short...\n\ni'm in the market for an x-pro2. availability is tough now and some of the japanese sellers on ebay have pretty fair deals. is there any reason i would want to avoid a japan-sourced camera? i can't imagine there would be a problem, but just checking for blind -----> spots !!! . \n\nthanks!", "sortedWord": "None", "identifyer": 90322, "year": "2021"}, {"Unnamed: 0": 197332, "autor": "Hour-of-the-Wolf", "date": 1630849335000, "content": "Evening Spot | X-Pro 1, Hanimex 28mm 2.8", "link": "https://www.reddit.com/r/fujifilm/comments/pidbbl/evening_spot_xpro_1_hanimex_28mm_28/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "evening -----> spot !!!  | x-pro 1, hanimex 28mm 2.8", "sortedWord": "None", "identifyer": 90370, "year": "2021"}, {"Unnamed: 0": 197476, "autor": "boddy_nock", "date": 1616976800000, "content": "How do you feel about the 16-55mm f/2.8 lens? /!/ I want an all purpose lens for landscape and portraits. My 16mm 1.4 lens is scratched and is leaving spots in my images. What is your opinion on this lens? Any other recommendations? I like the constant aperture which is why I am looking into this lens.", "link": "https://www.reddit.com/r/fujifilm/comments/mfdi6s/how_do_you_feel_about_the_1655mm_f28_lens/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how do you feel about the 16-55mm f/2.8 lens? /!/ i want an all purpose lens for landscape and portraits. my 16mm 1.4 lens is scratched and is leaving -----> spots !!!  in my images. what is your opinion on this lens? any other recommendations? i like the constant aperture which is why i am looking into this lens.", "sortedWord": "None", "identifyer": 90518, "year": "2021"}, {"Unnamed: 0": 197607, "autor": "coned88", "date": 1632596918000, "content": "is there a way to disable physical buttons? /!/ This may be an odd question. Since why would somebody buy a Fuji if they didn't like physical dials and such. But I like the output of the pictures quite a bit and like Fuji as a company. But I find the dials make this much more complex than they need to be. Such as just the other day I was trying to take a picture of my mom and couldn't get why the camera wasn't auto focusing. On the screen I made sure the AF icon was there in the upper right (the one that can be changed to off and spot). I then pressed the Q button and saw the 2nd box on the first row being set to MF. I went to change it with the wheel, bit it wouldn't change. Odd I said to myself. Maybe it's because I was in was a button on the lens I said to myself. Oh yes the AF was set to ring instead of \"A\". I change it and also turn on OIS. But still it doesn't work. So now I have a camera that's telling me it's in AF mode by the upper right corner and a lens that is also in \"A\" mode. But my Q menu still shows MF and I can't change it. I'm stumped. Then it clicks and I remember front dial which I move from M (which was accidentally changed) back to C. Then AF starts to work again. \n\nWhen you only have a few seconds to get a shot of a moment. That's just too much triaging to think about. I like fuji. I use it mainly for taking pictures of birds and the x-H1 and 100-400 give me amazing results. But as the first time taking more candid shots. I'm finding the controls much more difficult. I think it would just be easier to not use the fuji specific dials and buttons. Is that possible?", "link": "https://www.reddit.com/r/fujifilm/comments/pvdeal/is_there_a_way_to_disable_physical_buttons/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there a way to disable physical buttons? /!/ this may be an odd question. since why would somebody buy a fuji if they didn't like physical dials and such. but i like the output of the pictures quite a bit and like fuji as a company. but i find the dials make this much more complex than they need to be. such as just the other day i was trying to take a picture of my mom and couldn't get why the camera wasn't auto focusing. on the screen i made sure the af icon was there in the upper right (the one that can be changed to off and -----> spot !!! ). i then pressed the q button and saw the 2nd box on the first row being set to mf. i went to change it with the wheel, bit it wouldn't change. odd i said to myself. maybe it's because i was in was a button on the lens i said to myself. oh yes the af was set to ring instead of \"a\". i change it and also turn on ois. but still it doesn't work. so now i have a camera that's telling me it's in af mode by the upper right corner and a lens that is also in \"a\" mode. but my q menu still shows mf and i can't change it. i'm stumped. then it clicks and i remember front dial which i move from m (which was accidentally changed) back to c. then af starts to work again. \n\nwhen you only have a few seconds to get a shot of a moment. that's just too much triaging to think about. i like fuji. i use it mainly for taking pictures of birds and the x-h1 and 100-400 give me amazing results. but as the first time taking more candid shots. i'm finding the controls much more difficult. i think it would just be easier to not use the fuji specific dials and buttons. is that possible?", "sortedWord": "None", "identifyer": 90655, "year": "2021"}, {"Unnamed: 0": 197614, "autor": "VaGaBonD2", "date": 1632582219000, "content": "Montréal Marché Bonsecours - XT-3 / 18-55mm /!/ Hi guys !\n\nSo I just switched from Nikon D7000 to FujiFilm XT-3 about 2 weeks ago. So so pleased with my move (I was first thinking about going for the D7500 but made the jump), I'm bringing it everywhere even when it's just a trip to the corner store, I never had a camera that create such an urge to play with it.\n\nAnyway ! I took that one yesterday during the golden hour in the old part of my hometown Montréal, Canada, I'm more of a portrait photog but I loved the light and it's rare that there is no one around at this spot.\n\nISO 1250\n\n21 mm\n\nF/7.1\n\n1/200s\n\nMinor contrast adjustements (+10)", "link": "https://www.reddit.com/r/fujifilm/comments/pv8gnt/montréal_marché_bonsecours_xt3_1855mm/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "montréal marché bonsecours - xt-3 / 18-55mm /!/ hi guys !\n\nso i just switched from nikon d7000 to fujifilm xt-3 about 2 weeks ago. so so pleased with my move (i was first thinking about going for the d7500 but made the jump), i'm bringing it everywhere even when it's just a trip to the corner store, i never had a camera that create such an urge to play with it.\n\nanyway ! i took that one yesterday during the golden hour in the old part of my hometown montréal, canada, i'm more of a portrait photog but i loved the light and it's rare that there is no one around at this -----> spot !!! .\n\niso 1250\n\n21 mm\n\nf/7.1\n\n1/200s\n\nminor contrast adjustements (+10)", "sortedWord": "None", "identifyer": 90663, "year": "2021"}, {"Unnamed: 0": 198245, "autor": "thot_slayer_2000", "date": 1629383042000, "content": "Any idea on why my xt3 is showing blinking black spots?", "link": "https://www.reddit.com/r/fujifilm/comments/p7fu6n/any_idea_on_why_my_xt3_is_showing_blinking_black/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "any idea on why my xt3 is showing blinking black -----> spots !!! ?", "sortedWord": "None", "identifyer": 91334, "year": "2021"}, {"Unnamed: 0": 198571, "autor": "nal1200", "date": 1626802429000, "content": "Comparing the XF 27 f/2.8 R WR to the XF 35 f/2 R WR /!/ I now own both of these lenses, and have found from personal experience that when considering getting a lens, searching reddit for personal anecdotes is always helpful. This is intended to share my thoughts for those of you considering getting either of these.\n\n\n**Image Quality**\n\nI have found that the 35 is softer in the extreme corners at almost every aperture than the 27, but is equally as sharp across the remainder of the frame at all apertures. Contrast and color are just a tad bit better on the 35. I don't personally notice any significant differences in vignetting or distortion between the two. Color fringing appears a bit more of a concern on the 35. Sharpness at f/2 at the minimum focusing distance is poor on the 35. The 27, while not able to focus as closely and limited to f/2.8, is extremely sharp at the minimum.\n\n\n**Ease of Use**\nThe 27 does of course feel practically non-existent when mounted. There's basically no grip for the left hand, similar to the X100 series, so you'll be dependent on the right hand for stability. Makes modifying the shutter dial a bit of a pain. The 35 is wonderful to use. The weight difference between the two is pretty insignificant in use. The 27 focuses loudly and much slower than the 35. Despite the 27 being weather-sealed, the focusing element does move in and out a bit, not a fan of that.\n\n\n**Bokeh**\n\nNo surprise here that the 35 will get a you a more shallow DoF. That said, the 27 is very pleasant and can do in a pinch.\n\n\n**Misc**\n\nI've found that the 27 seems to \"focus pop\" after releasing the shutter. I don't know what is causing this, but you get a split second of focus movement after each shutter release. Mildly annoying. When in continuous autofocus, the 27 can sometimes hunt for seemingly no reason when it should be locked onto a subject. This seems to occur mainly when their is low contrast in the focus point. 35 is pretty spot on.\n\n\nLooking back, I'd say that if I had to choose one, it'd be a pretty easy win for the 35. I'll be keeping the 27 though, as the pancake factor is unique and makes for the lightest possible kit with my X-T4.", "link": "https://www.reddit.com/r/fujifilm/comments/oo6uqz/comparing_the_xf_27_f28_r_wr_to_the_xf_35_f2_r_wr/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "comparing the xf 27 f/2.8 r wr to the xf 35 f/2 r wr /!/ i now own both of these lenses, and have found from personal experience that when considering getting a lens, searching reddit for personal anecdotes is always helpful. this is intended to share my thoughts for those of you considering getting either of these.\n\n\n**image quality**\n\ni have found that the 35 is softer in the extreme corners at almost every aperture than the 27, but is equally as sharp across the remainder of the frame at all apertures. contrast and color are just a tad bit better on the 35. i don't personally notice any significant differences in vignetting or distortion between the two. color fringing appears a bit more of a concern on the 35. sharpness at f/2 at the minimum focusing distance is poor on the 35. the 27, while not able to focus as closely and limited to f/2.8, is extremely sharp at the minimum.\n\n\n**ease of use**\nthe 27 does of course feel practically non-existent when mounted. there's basically no grip for the left hand, similar to the x100 series, so you'll be dependent on the right hand for stability. makes modifying the shutter dial a bit of a pain. the 35 is wonderful to use. the weight difference between the two is pretty insignificant in use. the 27 focuses loudly and much slower than the 35. despite the 27 being weather-sealed, the focusing element does move in and out a bit, not a fan of that.\n\n\n**bokeh**\n\nno surprise here that the 35 will get a you a more shallow dof. that said, the 27 is very pleasant and can do in a pinch.\n\n\n**misc**\n\ni've found that the 27 seems to \"focus pop\" after releasing the shutter. i don't know what is causing this, but you get a split second of focus movement after each shutter release. mildly annoying. when in continuous autofocus, the 27 can sometimes hunt for seemingly no reason when it should be locked onto a subject. this seems to occur mainly when their is low contrast in the focus point. 35 is pretty -----> spot !!!  on.\n\n\nlooking back, i'd say that if i had to choose one, it'd be a pretty easy win for the 35. i'll be keeping the 27 though, as the pancake factor is unique and makes for the lightest possible kit with my x-t4.", "sortedWord": "None", "identifyer": 91673, "year": "2021"}, {"Unnamed: 0": 199268, "autor": "anton217", "date": 1620570700000, "content": "Fishing Spot [ X-T30 // 35mm F2 ]", "link": "https://www.reddit.com/r/fujifilm/comments/n8fdjl/fishing_spot_xt30_35mm_f2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fishing -----> spot !!!  [ x-t30 // 35mm f2 ]", "sortedWord": "None", "identifyer": 92416, "year": "2021"}, {"Unnamed: 0": 199538, "autor": "Gwen_BR", "date": 1617390240000, "content": "X100V dust spots ? /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/mir43a/x100v_dust_spots/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "x100v dust -----> spots !!!  ? /!/ [removed]", "sortedWord": "None", "identifyer": 92704, "year": "2021"}, {"Unnamed: 0": 199725, "autor": "yearhight", "date": 1622633204000, "content": "What bag do you use with your system? /!/ I like bags and knowing that when my gear isn't in use, it's safely stowed away. I especially have a soft spot for slings due to their small size and the ease of access they provide when you're walking down the street and want to quickly get your camera to take a photo. I'll be getting an xt3 and the 35mm f2 to go with it so I wanted to get some good ideas on what bag to get with it (especially since my old one was ruined while I moved) so it'll be safe. I prefer slings but like I said, I like bags in general and want to know what everyone else uses", "link": "https://www.reddit.com/r/fujifilm/comments/nqjlvf/what_bag_do_you_use_with_your_system/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what bag do you use with your system? /!/ i like bags and knowing that when my gear isn't in use, it's safely stowed away. i especially have a soft -----> spot !!!  for slings due to their small size and the ease of access they provide when you're walking down the street and want to quickly get your camera to take a photo. i'll be getting an xt3 and the 35mm f2 to go with it so i wanted to get some good ideas on what bag to get with it (especially since my old one was ruined while i moved) so it'll be safe. i prefer slings but like i said, i like bags in general and want to know what everyone else uses", "sortedWord": "None", "identifyer": 92898, "year": "2021"}, {"Unnamed: 0": 200011, "autor": "abmwinnoch", "date": 1626038060000, "content": "I fired off a sequence as this beast took flight, but due to user-error, none were spot-on focus. But I think that I just about got away with this one; X-T4 with XF100-400 @400mm. 1/500 sec. f/5.6 ISO200.", "link": "https://www.reddit.com/r/fujifilm/comments/oicse9/i_fired_off_a_sequence_as_this_beast_took_flight/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i fired off a sequence as this beast took flight, but due to user-error, none were -----> spot !!! -on focus. but i think that i just about got away with this one; x-t4 with xf100-400 @400mm. 1/500 sec. f/5.6 iso200.", "sortedWord": "None", "identifyer": 93194, "year": "2021"}, {"Unnamed: 0": 200152, "autor": "nal1200", "date": 1625372560000, "content": "His afternoon nap spot // X-T4, MITAKON 35 f0.95", "link": "https://www.reddit.com/r/fujifilm/comments/odd4nb/his_afternoon_nap_spot_xt4_mitakon_35_f095/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "his afternoon nap -----> spot !!!  // x-t4, mitakon 35 f0.95", "sortedWord": "None", "identifyer": 93347, "year": "2021"}, {"Unnamed: 0": 200929, "autor": "piter_sk", "date": 1613940727000, "content": "Sigh... when you clean your sensor from spots which are on the display of your laptop...", "link": "https://www.reddit.com/r/fujifilm/comments/lp6c7i/sigh_when_you_clean_your_sensor_from_spots_which/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sigh... when you clean your sensor from -----> spots !!!  which are on the display of your laptop...", "sortedWord": "None", "identifyer": 94163, "year": "2021"}, {"Unnamed: 0": 201074, "autor": "sildargod", "date": 1621513889000, "content": "Spotted Eagle Owl - X100v", "link": "https://www.reddit.com/r/fujifilm/comments/ngyy2j/spotted_eagle_owl_x100v/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  eagle owl - x100v", "sortedWord": "None", "identifyer": 94316, "year": "2021"}, {"Unnamed: 0": 201939, "autor": "Lidodido", "date": 1610274733000, "content": "X-S10 Auto ISO/Auto shutter faulty? /!/ Hi,\n\nI'm new to Fujifilm. Bought an X-S10 two weeks ago and I'm loving the camera despite missing the array of buttons, levers and controls from my old Nikon D7000. It's good enough that I've gone from spot metering/fully manual to mostly automatic with full image metering.\n\nHowever, the auto ISO is bothering me. From what I've read, the minimum shutter speed when using the auto setting should be 1/focal_length.\n\nI am however getting 1/100 at 18mm even though the ISO is in the 4-5000's with a selected range of 160-6400. Zooming in on my 18-55 brings me up to 1/120, 1/160 and up to 1/200 even which seems excessive for 55mm on camera with an IBIS/OIS-combo which should easily handle 1/20.\n\nAnyone else with the same camera and issue? Seems like a bug to me.", "link": "https://www.reddit.com/r/fujifilm/comments/kuc7io/xs10_auto_isoauto_shutter_faulty/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x-s10 auto iso/auto shutter faulty? /!/ hi,\n\ni'm new to fujifilm. bought an x-s10 two weeks ago and i'm loving the camera despite missing the array of buttons, levers and controls from my old nikon d7000. it's good enough that i've gone from -----> spot !!!  metering/fully manual to mostly automatic with full image metering.\n\nhowever, the auto iso is bothering me. from what i've read, the minimum shutter speed when using the auto setting should be 1/focal_length.\n\ni am however getting 1/100 at 18mm even though the iso is in the 4-5000's with a selected range of 160-6400. zooming in on my 18-55 brings me up to 1/120, 1/160 and up to 1/200 even which seems excessive for 55mm on camera with an ibis/ois-combo which should easily handle 1/20.\n\nanyone else with the same camera and issue? seems like a bug to me.", "sortedWord": "None", "identifyer": 95220, "year": "2021"}, {"Unnamed: 0": 202214, "autor": "Laobr", "date": 1634491966000, "content": "Brown/black spot in EVF - Maybe burned from the sun? /!/ [removed]", "link": "https://www.reddit.com/r/fujifilm/comments/qa3ewv/brownblack_spot_in_evf_maybe_burned_from_the_sun/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "brown/black -----> spot !!!  in evf - maybe burned from the sun? /!/ [removed]", "sortedWord": "None", "identifyer": 95513, "year": "2021"}, {"Unnamed: 0": 203005, "autor": "johant123", "date": 1631968023000, "content": "Our cat on his favourite spot, my backpack ;-) (X-Pro2, Pentax Super-Takumar 3.5/35, Classic Chrome film simulation JPEG)", "link": "https://www.reddit.com/r/fujifilm/comments/pqlid0/our_cat_on_his_favourite_spot_my_backpack_xpro2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "our cat on his favourite -----> spot !!! , my backpack ;-) (x-pro2, pentax super-takumar 3.5/35, classic chrome film simulation jpeg)", "sortedWord": "None", "identifyer": 96332, "year": "2021"}, {"Unnamed: 0": 203091, "autor": "bearcat--", "date": 1631118157000, "content": "Found a new hiding spot [xe4, 35mm1.4]", "link": "https://www.reddit.com/r/fujifilm/comments/pkdt1y/found_a_new_hiding_spot_xe4_35mm14/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "found a new hiding -----> spot !!!  [xe4, 35mm1.4]", "sortedWord": "None", "identifyer": 96421, "year": "2021"}, {"Unnamed: 0": 203217, "autor": "z604", "date": 1635236633000, "content": "Fn button to toggle between options instead of opening menu /!/ Hey there,\n\nI’m new to Fuji cameras and I’ve set up the function buttons to my taste.\n\nWhen assigning a setting like photometry to a fn button, it brings up the menu, and then I’ve got to use the d-pad to select the option.\n\nIs there a way to set up a fn button to just toggle through the different options to not have to use different fingers/buttons?\n\nFeels like I’d be faster just double tapping to switch from multi to spot, instead of fn button/down/down/shutter, for instance.\n\nThanks,\nCheers", "link": "https://www.reddit.com/r/fujifilm/comments/qg1t85/fn_button_to_toggle_between_options_instead_of/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fn button to toggle between options instead of opening menu /!/ hey there,\n\ni’m new to fuji cameras and i’ve set up the function buttons to my taste.\n\nwhen assigning a setting like photometry to a fn button, it brings up the menu, and then i’ve got to use the d-pad to select the option.\n\nis there a way to set up a fn button to just toggle through the different options to not have to use different fingers/buttons?\n\nfeels like i’d be faster just double tapping to switch from multi to -----> spot !!! , instead of fn button/down/down/shutter, for instance.\n\nthanks,\ncheers", "sortedWord": "None", "identifyer": 96552, "year": "2021"}, {"Unnamed: 0": 203808, "autor": "abmwinnoch", "date": 1626712760000, "content": "Photometry for video /!/ Maybe a bit of a daft question with an obvious answer, but why does photometry not work in movie mode? At least not with the X-t3 and 4. Is it not still useful to be able to set the lighting for spot, centre-weighted or wider areas?", "link": "https://www.reddit.com/r/fujifilm/comments/onhrkb/photometry_for_video/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "photometry for video /!/ maybe a bit of a daft question with an obvious answer, but why does photometry not work in movie mode? at least not with the x-t3 and 4. is it not still useful to be able to set the lighting for -----> spot !!! , centre-weighted or wider areas?", "sortedWord": "None", "identifyer": 97181, "year": "2021"}, {"Unnamed: 0": 204036, "autor": "Ok_Establishment3888", "date": 1629603677000, "content": "how many birds can you spot? | x-t10 + Zeiss 50mm f1.4", "link": "https://www.reddit.com/r/fujifilm/comments/p95dvo/how_many_birds_can_you_spot_xt10_zeiss_50mm_f14/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how many birds can you -----> spot !!! ? | x-t10 + zeiss 50mm f1.4", "sortedWord": "None", "identifyer": 97419, "year": "2021"}, {"Unnamed: 0": 204309, "autor": "worrymonster", "date": 1624593373000, "content": "Lens suggestion for close-ups /!/ I'm looking for a cheap manual lens for close subject work. Not full macro. Think detail product photography.\n\nI've been recording and documenting my craft and restoration work and I'm having a hard time getting the sweet spot I want. I have a neewer 35mm that sits a little too far, and some macro extension tubes that get me too close. I'm shooting subjects usually about a foot in size.\n\nI'm a little boggled at this point trying to guess what focal length I'm looking for. I'm looking at the Meike 50mm f/2 but it's saying the minimum focal distance is around 2' so now I guess I'm just confused. I assumed a 50mm would be in that gap i'm trying to fit without being full macro like a 60+ mm", "link": "https://www.reddit.com/r/fujifilm/comments/o7fvmr/lens_suggestion_for_closeups/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens suggestion for close-ups /!/ i'm looking for a cheap manual lens for close subject work. not full macro. think detail product photography.\n\ni've been recording and documenting my craft and restoration work and i'm having a hard time getting the sweet -----> spot !!!  i want. i have a neewer 35mm that sits a little too far, and some macro extension tubes that get me too close. i'm shooting subjects usually about a foot in size.\n\ni'm a little boggled at this point trying to guess what focal length i'm looking for. i'm looking at the meike 50mm f/2 but it's saying the minimum focal distance is around 2' so now i guess i'm just confused. i assumed a 50mm would be in that gap i'm trying to fit without being full macro like a 60+ mm", "sortedWord": "None", "identifyer": 97713, "year": "2021"}, {"Unnamed: 0": 204641, "autor": "Gayfortay", "date": 1618775628000, "content": "Is there a way to bracket custom film recipes? /!/ As the title says, is there a way to create multiple film recipes then have the camera produce all 3 on the spot? Or is it just the default film sims available on bracketing. If not is there some other way to apply the film recipes without a computer(as I would not have one available on vacation for example) Any help would be appreciated. I would test it out but I don't have a Fujifilm yet lol.", "link": "https://www.reddit.com/r/fujifilm/comments/mtk3ag/is_there_a_way_to_bracket_custom_film_recipes/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there a way to bracket custom film recipes? /!/ as the title says, is there a way to create multiple film recipes then have the camera produce all 3 on the -----> spot !!! ? or is it just the default film sims available on bracketing. if not is there some other way to apply the film recipes without a computer(as i would not have one available on vacation for example) any help would be appreciated. i would test it out but i don't have a fujifilm yet lol.", "sortedWord": "None", "identifyer": 98061, "year": "2021"}, {"Unnamed: 0": 204685, "autor": "sagelywizard", "date": 1625975061000, "content": "D Range Priority photos look very dark when importing into C1 /!/ When I take a photo with D Range Priority set to STRONG (shooting RAW on X-T4), the photo looks great in the viewfinder, but when I import it into C1, it looks super dark. Even after editing, I'm not able to reconstruct the image that's shown in the viewfinder (e.g. some of the darker spots have detail in the viewfinder image, but are lost when imported into C1). Does anyone know why this is happening?", "link": "https://www.reddit.com/r/fujifilm/comments/ohx6ju/d_range_priority_photos_look_very_dark_when/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "d range priority photos look very dark when importing into c1 /!/ when i take a photo with d range priority set to strong (shooting raw on x-t4), the photo looks great in the viewfinder, but when i import it into c1, it looks super dark. even after editing, i'm not able to reconstruct the image that's shown in the viewfinder (e.g. some of the darker -----> spots !!!  have detail in the viewfinder image, but are lost when imported into c1). does anyone know why this is happening?", "sortedWord": "None", "identifyer": 98107, "year": "2021"}, {"Unnamed: 0": 204884, "autor": "abmwinnoch", "date": 1625775075000, "content": "Always having my X-T3 and a long-reach lens with me paid off today when I spotted these guys as I walked across a busy bridge over a river in central Aberdeen (Bridge of Don). XC 50-230 ISO 160 1/200 sec. f/6.7 230 mm. Image SOOC JPG", "link": "https://www.reddit.com/r/fujifilm/comments/ogfd84/always_having_my_xt3_and_a_longreach_lens_with_me/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "always having my x-t3 and a long-reach lens with me paid off today when i -----> spotted !!!  these guys as i walked across a busy bridge over a river in central aberdeen (bridge of don). xc 50-230 iso 160 1/200 sec. f/6.7 230 mm. image sooc jpg", "sortedWord": "None", "identifyer": 98320, "year": "2021"}], "name": "spotfujifilm2021"}