{"interestingcomments": [{"Unnamed: 0": 229103, "autor": "calerouxz", "date": 1559742730000, "content": "Help me decide on an ultrawide prime! /!/ I've just recently (actually don't even have it on my hands yet) purchased a new X-Pro2 with the 23mm f/2 lens, but I do generally like ultrawide lenses, I used a Canon 5D mark II with the 17-40mm f/4L a lot. I decided on creating a prime only kit for the X-Pro2, as the point is mostly to cut down on weight and size while maximizing image quality, that's why I won't be thinking of the XF 10-24mm f/4. Here are my choices:\n\n* **Fujifilm XF 14mm f/2.8 R:** This seems like the optically better lens out of the bunch, but I'm not sure if I will be happy with the narrower field of view of the equivalent to 21mm focal length, but I also assume it will be easier to stitch panoramas with it.\n* **Zeiss Touit 12mm f/2.8:** This lens seems great as far as specs go, it seems to not be as sharp as the other two, but still pretty good. It's got a field of view that I like better than the 14mm. After searching for images made with this lens, I don't find all that many and am not particularly impressed with them, but maybe that's due to a lower adoption rate because of it's higher price tag to the other two.\n* **Samyang 12mm f/2 NCS CS:** Apparently this is sharper than the Zeiss, with the same field of view, and also much cheaper. Things I dislike about it are the fact that there's no communication to the camera (so no EXIF data), no autofocus (given the focal length, this is probably not an issue anyways), but I'm much more worried about lateral chromatic aberration, which is according to lens tip the higher of the three and also the 5 apperture blades in this lens produced rather bad looking sun stars which I'm not a fan of. On the other hand, the images I've seen created with this lens look great.\n\nI'm particularly interested in the Zeiss lens, but am rather skeptical due to the fact that I'm not all that impressed by the images I've seen created with this lens. It's also the most expensive one.", "link": "https://www.reddit.com/r/fujifilm/comments/bx2svq/help_me_decide_on_an_ultrawide_prime/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "help me decide on an ultrawide prime! /!/ i've just recently (actually don't even have it on my hands yet) purchased a new x-pro2 with the 23mm f/2 lens, but i do generally like ultrawide lenses, i used a canon 5d mark ii with the 17-40mm f/4l a lot. i decided on creating a prime only kit for the x-pro2, as the point is mostly to cut down on weight and size while maximizing image quality, that's why i won't be thinking of the xf 10-24mm f/4. here are my choices:\n\n* **fujifilm xf 14mm f/2.8 r:** this seems like the optically better lens out of the bunch, but i'm not sure if i will be happy with the narrower field of view of the equivalent to 21mm focal length, but i also assume it will be easier to stitch panoramas with it.\n* **zeiss touit 12mm f/2.8:** this lens seems great as far as specs go, it seems to not be as sharp as the other two, but still pretty good. it's got a field of view that i like better than the 14mm. after searching for images made with this lens, i don't find all that many and am not particularly impressed with them, but maybe that's due to a lower adoption rate because of it's higher price -----> tag !!!  to the other two.\n* **samyang 12mm f/2 ncs cs:** apparently this is sharper than the zeiss, with the same field of view, and also much cheaper. things i dislike about it are the fact that there's no communication to the camera (so no exif data), no autofocus (given the focal length, this is probably not an issue anyways), but i'm much more worried about lateral chromatic aberration, which is according to lens tip the higher of the three and also the 5 apperture blades in this lens produced rather bad looking sun stars which i'm not a fan of. on the other hand, the images i've seen created with this lens look great.\n\ni'm particularly interested in the zeiss lens, but am rather skeptical due to the fact that i'm not all that impressed by the images i've seen created with this lens. it's also the most expensive one.", "sortedWord": "None", "identifyer": 24003, "year": "2019"}, {"Unnamed: 0": 229610, "autor": "yannissgarra", "date": 1548118676000, "content": "Fujifilm xe3 bluetooth capacity /!/ Does the fujifilm xe3 can automaticaly tag gps location on photo with bluetooth and smartphone ? If yes, does the application kill the battery or not ?", "link": "https://www.reddit.com/r/fujifilm/comments/aihaqn/fujifilm_xe3_bluetooth_capacity/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "fujifilm xe3 bluetooth capacity /!/ does the fujifilm xe3 can automaticaly -----> tag !!!  gps location on photo with bluetooth and smartphone ? if yes, does the application kill the battery or not ?", "sortedWord": "None", "identifyer": 24535, "year": "2019"}, {"Unnamed: 0": 232879, "autor": "haluknet", "date": 1568284272000, "content": "Fujifilm reveals X-A7 with improved AF, 4K/30p video and $700 price tag /!/  \n\nFujifilm has announced the X-A7, an entry-level mirrorless camera with some key improvements over its X-A5 predecessor. A new 24MP sensor offers 8.5 times more phase-detection autofocus points than the previous model and includes 4K/30p video recording – a welcome upgrade over the X-A5's 4K/15p. Burst shooting remains at 6 fps.\n\n![video](d59i9o6g45m31)\n\nThe X-A7 offers a fully articulated, ultra-high-res 3.5\" touch screen LCD, which is the primary means of interacting with camera controls, as the camera offers only a few physical controls on the back panel. The camera with kit lens attached weighs just 455g (1lb) altogether.\n\nOther new offerings include an update to Fujifilm's auto scene recognition mode called Bright Mode, which utilizes HDR and other camera settings to create brighter, more vivid images with little user input.\n\nThe [**Fujifilm X-A7**](https://crazygadgetshere.com/the-stylishly-designed-fujifilm-x-a7-is-introduced) will be available October 24th kitted with a Fujinon XC 15-45mm F3.5-5.6 OIS PZ lens for $700. Shaking things up a bit, Fujifilm will offer the camera body in dark silver, 'camel', mint green and silver color options. A 'navy' color will also be available in some regions.", "link": "https://www.reddit.com/r/fujifilm/comments/d35xh2/fujifilm_reveals_xa7_with_improved_af_4k30p_video/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "fujifilm reveals x-a7 with improved af, 4k/30p video and $700 price -----> tag !!!  /!/  \n\nfujifilm has announced the x-a7, an entry-level mirrorless camera with some key improvements over its x-a5 predecessor. a new 24mp sensor offers 8.5 times more phase-detection autofocus points than the previous model and includes 4k/30p video recording – a welcome upgrade over the x-a5's 4k/15p. burst shooting remains at 6 fps.\n\n![video](d59i9o6g45m31)\n\nthe x-a7 offers a fully articulated, ultra-high-res 3.5\" touch screen lcd, which is the primary means of interacting with camera controls, as the camera offers only a few physical controls on the back panel. the camera with kit lens attached weighs just 455g (1lb) altogether.\n\nother new offerings include an update to fujifilm's auto scene recognition mode called bright mode, which utilizes hdr and other camera settings to create brighter, more vivid images with little user input.\n\nthe [**fujifilm x-a7**](https://crazygadgetshere.com/the-stylishly-designed-fujifilm-x-a7-is-introduced) will be available october 24th kitted with a fujinon xc 15-45mm f3.5-5.6 ois pz lens for $700. shaking things up a bit, fujifilm will offer the camera body in dark silver, 'camel', mint green and silver color options. a 'navy' color will also be available in some regions.", "sortedWord": "None", "identifyer": 27894, "year": "2019"}, {"Unnamed: 0": 233359, "autor": "vladshap", "date": 1549465209000, "content": "Which lens to buy next. XF 10-24 f/4 or 50-140 f/2.8 or 8-16 f/2.8 /!/ I'm currently in a debacle. I want to take advantage of the current sale, but having a hard time making a decision.\n\nFor three years I traveled around with the X-T1, 18-135 and 16mm 1.4, where the camera spent most of it's life attached to the Peak Design capture clip on my backpack. Through rain, snow, desert heat, high altitudes, cold temps, etc. I felt that between those two lenses I covered a lot of my needs. The camera is still going without a hitch, aside from the usual battle wounds.. paint chips, and having to glue the rubber grip back on. \n\nMore recently I picked up an X-T3 from BH, and 56mm f/1.2 &amp; 16-55 f/2.8 (got a fantastic deal on a two lens combo on Craigslist in SF. $1200 for the pair). I've gotta say, these lenses are beautiful, and so is the new X-T3.\n\nBut here is the problem. Even though I upgraded my glass quality, and the photos look phenomenal, I'm still stuck in the same focal ranges that I'm already used to. \n\nSo I'm trying to fill the void. I can't decide between getting the 10-24, 50-140 or 8-16. \n\nThe current BH deal on the 10-24 for $750 with two filters is hard to pass.\n\nOn the other hand the 8-16 might seem like a better choice, given it's current $500 discount. My  concern for that one is lack of filters and IS. With the high price tag and lack of filter threads, I'm afraid of damaging the front glass element, as I'm used to having filters on ALL of my lenses. \n\nYou might ask, how is 50-140 even on this list? Well, given that I have the 16-55 f/2.8, I now feel the need to finish out the range that I'm used to with the 18-135. The 18-135 is an absolutely fantastic lens, but after seeing the sharpness of the 16-55, it's hard to unsee... Plus the ability to add a teleconverter (1.4 or 2x) and getting the extra focal length without bringing an even longer lens, is pretty attractive.\n\nSo what do you think? Should I go for 8-16, 10-24, or 50-140? I can only afford one. \n\nI love to shoot landscapes, as well as portraits. A lot of times portraits in beautiful landscapes.", "link": "https://www.reddit.com/r/fujifilm/comments/anrie4/which_lens_to_buy_next_xf_1024_f4_or_50140_f28_or/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "which lens to buy next. xf 10-24 f/4 or 50-140 f/2.8 or 8-16 f/2.8 /!/ i'm currently in a debacle. i want to take advantage of the current sale, but having a hard time making a decision.\n\nfor three years i traveled around with the x-t1, 18-135 and 16mm 1.4, where the camera spent most of it's life attached to the peak design capture clip on my backpack. through rain, snow, desert heat, high altitudes, cold temps, etc. i felt that between those two lenses i covered a lot of my needs. the camera is still going without a hitch, aside from the usual battle wounds.. paint chips, and having to glue the rubber grip back on. \n\nmore recently i picked up an x-t3 from bh, and 56mm f/1.2 &amp; 16-55 f/2.8 (got a fantastic deal on a two lens combo on craigslist in sf. $1200 for the pair). i've gotta say, these lenses are beautiful, and so is the new x-t3.\n\nbut here is the problem. even though i upgraded my glass quality, and the photos look phenomenal, i'm still stuck in the same focal ranges that i'm already used to. \n\nso i'm trying to fill the void. i can't decide between getting the 10-24, 50-140 or 8-16. \n\nthe current bh deal on the 10-24 for $750 with two filters is hard to pass.\n\non the other hand the 8-16 might seem like a better choice, given it's current $500 discount. my  concern for that one is lack of filters and is. with the high price -----> tag !!!  and lack of filter threads, i'm afraid of damaging the front glass element, as i'm used to having filters on all of my lenses. \n\nyou might ask, how is 50-140 even on this list? well, given that i have the 16-55 f/2.8, i now feel the need to finish out the range that i'm used to with the 18-135. the 18-135 is an absolutely fantastic lens, but after seeing the sharpness of the 16-55, it's hard to unsee... plus the ability to add a teleconverter (1.4 or 2x) and getting the extra focal length without bringing an even longer lens, is pretty attractive.\n\nso what do you think? should i go for 8-16, 10-24, or 50-140? i can only afford one. \n\ni love to shoot landscapes, as well as portraits. a lot of times portraits in beautiful landscapes.", "sortedWord": "None", "identifyer": 28388, "year": "2019"}], "name": "tagfujifilm2019"}