{"interestingcomments": [{"Unnamed: 0": 190602, "autor": "Frarod17", "date": 1625120420000, "content": "What to get? /!/ So this is going to be my first professional camera which I want to use to click portraits,street,travel, family functions, a little bit of sports, outdoor events during day and night, indoor talks and maybe a wedding once in a while (tag along a professional photographer to learn)\n\nI was considering buying the XT-3 since I wanted to get a decent camera. I'm 80% in to photography but videography comes up often. Initially I was confused between Sony's a6400 and fuji xt3 but after a bunch of research alot of people have told me xt3 got the upper hand.\n\nSo my next question is what lens to get? Should I get a 18-55mm or a 16-80mm or a prime? What would be an ideal jack of all trades lens to invest in?\n\nAlso how are viltrox primes compared to fuji primes?", "link": "https://www.reddit.com/r/fujifilm/comments/obfqpf/what_to_get/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what to get? /!/ so this is going to be my first professional camera which i want to use to click portraits,street,travel, family functions, a little bit of sports, outdoor events during day and night, indoor talks and maybe a wedding once in a while (-----> tag !!!  along a professional photographer to learn)\n\ni was considering buying the xt-3 since i wanted to get a decent camera. i'm 80% in to photography but videography comes up often. initially i was confused between sony's a6400 and fuji xt3 but after a bunch of research alot of people have told me xt3 got the upper hand.\n\nso my next question is what lens to get? should i get a 18-55mm or a 16-80mm or a prime? what would be an ideal jack of all trades lens to invest in?\n\nalso how are viltrox primes compared to fuji primes?", "sortedWord": "None", "identifyer": 83358, "year": "2021"}, {"Unnamed: 0": 190924, "autor": "P3nguin_God", "date": 1617169856000, "content": "Mirrorless Camera vs Smartphone /!/ Hey guys, I need advice on something. I recently bought a Fujifilm X-T4 for $1550 and a Galaxy Note 10 Plus for $600 and canceled the order on the Note 10 Plus. \n\n\nI need advice because with my impulsiveness and having ADHD, I don't know if this was the right move.\n\n\nThe camera will no doubt, last me a long time and take great videos and pictures, having good quality in those areas is pretty important because social media is a way we portray ourselves with pictures on Instagram, to videos on Tik Tok and YouTube. It feels like it has become and important part of our lives.\n\n\nBut who carries around a mirrorless camera now, doesn't everyone carry around a phone because it is an all in one package and can handle pictures and videos at near the same quality?\n\n\nThe Note 10 Plus in particular is said to have an even better camera than the Note 20 Ultra and it is 512gb with the small price tag.\n\n\nFor the price of the camera, I could easily get a 16gb ram m1 mac mini along with the phone for around the same price, it is a lot of money.\n\n\nIf I carry around the camera doing a vlog or something, what if it gets stolen?\n\n\nWhy do people even use a mirrorless camera over a smartphone, I am having a hard time justifying how much that camera just cost me. Would it be better to return it and just save my money as a college student. \n\n\nWhy would you guys in your own situtaion, get a Mirrorless Camera over a Smartphone which can easily compete at a fraction of the price. \n\n\nIt may be just my anxiety but this is my dream camera, and the Note 10 Plus was always my dream phone. It's just that the camera costs so much money and because I have bad judgement and don't really make good decisions, I don't know if getting this was the right decision or not.\n\n\nLike if I go to a college campus and take out a Silver Fujifilm X-T4, it's going to turn heads and attract a lot more attention than having a cell phone and doing the same thing. This also applies to any area you go to, it can also attract unwanted attention.\n\n\nThere is also an argument to be made that the phone takes up ram over time and may become slower and the battery isn't removable so it may have to be replaced after 5 to 6 years. While a  Mirrorless Camera will last a lot longer as the batteries are removable, both also have memory expansion. \n\n\nI am just really bad at these decisions so I would like to hear everyone's thoughts please.", "link": "https://www.reddit.com/r/fujifilm/comments/mgzbba/mirrorless_camera_vs_smartphone/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "mirrorless camera vs smartphone /!/ hey guys, i need advice on something. i recently bought a fujifilm x-t4 for $1550 and a galaxy note 10 plus for $600 and canceled the order on the note 10 plus. \n\n\ni need advice because with my impulsiveness and having adhd, i don't know if this was the right move.\n\n\nthe camera will no doubt, last me a long time and take great videos and pictures, having good quality in those areas is pretty important because social media is a way we portray ourselves with pictures on instagram, to videos on tik tok and youtube. it feels like it has become and important part of our lives.\n\n\nbut who carries around a mirrorless camera now, doesn't everyone carry around a phone because it is an all in one package and can handle pictures and videos at near the same quality?\n\n\nthe note 10 plus in particular is said to have an even better camera than the note 20 ultra and it is 512gb with the small price -----> tag !!! .\n\n\nfor the price of the camera, i could easily get a 16gb ram m1 mac mini along with the phone for around the same price, it is a lot of money.\n\n\nif i carry around the camera doing a vlog or something, what if it gets stolen?\n\n\nwhy do people even use a mirrorless camera over a smartphone, i am having a hard time justifying how much that camera just cost me. would it be better to return it and just save my money as a college student. \n\n\nwhy would you guys in your own situtaion, get a mirrorless camera over a smartphone which can easily compete at a fraction of the price. \n\n\nit may be just my anxiety but this is my dream camera, and the note 10 plus was always my dream phone. it's just that the camera costs so much money and because i have bad judgement and don't really make good decisions, i don't know if getting this was the right decision or not.\n\n\nlike if i go to a college campus and take out a silver fujifilm x-t4, it's going to turn heads and attract a lot more attention than having a cell phone and doing the same thing. this also applies to any area you go to, it can also attract unwanted attention.\n\n\nthere is also an argument to be made that the phone takes up ram over time and may become slower and the battery isn't removable so it may have to be replaced after 5 to 6 years. while a  mirrorless camera will last a lot longer as the batteries are removable, both also have memory expansion. \n\n\ni am just really bad at these decisions so i would like to hear everyone's thoughts please.", "sortedWord": "None", "identifyer": 83691, "year": "2021"}, {"Unnamed: 0": 192351, "autor": "harga24864", "date": 1619686347000, "content": "Going GFX or f1.0? /!/ I quit a pretty bad habit last year that saves me a very decent amount of money.\n\nNow i wanted to treat myself with something nice. Being a Fuji owner since medium format film, i had the idea to get me a GF50R with the 50mm lens. I always dreamed about having a digital medium format camera and Fuji kinda made it accessible.\n\nMy friend at the Camera shop however tried to talk me out of the GFX system and mentioned the 50mm f1.0 that would work with the XPro2 that i already own. His argument is that it is very usable wide open and that the images can be very three-dimensional as well. Just like witj MF.\n\nAs a bonus, compared to a GFX Body and Lens…the price tag is much lower.\n\nWhat is your experience with that lens? \nWould you go with a new (to me) GFX or the fifty f1.0 on a APS-C X-Pro2?\n\nI am a hobbyist. Travel, landscapes and the occasional portrait.", "link": "https://www.reddit.com/r/fujifilm/comments/n108xc/going_gfx_or_f10/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "going gfx or f1.0? /!/ i quit a pretty bad habit last year that saves me a very decent amount of money.\n\nnow i wanted to treat myself with something nice. being a fuji owner since medium format film, i had the idea to get me a gf50r with the 50mm lens. i always dreamed about having a digital medium format camera and fuji kinda made it accessible.\n\nmy friend at the camera shop however tried to talk me out of the gfx system and mentioned the 50mm f1.0 that would work with the xpro2 that i already own. his argument is that it is very usable wide open and that the images can be very three-dimensional as well. just like witj mf.\n\nas a bonus, compared to a gfx body and lens…the price -----> tag !!!  is much lower.\n\nwhat is your experience with that lens? \nwould you go with a new (to me) gfx or the fifty f1.0 on a aps-c x-pro2?\n\ni am a hobbyist. travel, landscapes and the occasional portrait.", "sortedWord": "None", "identifyer": 85169, "year": "2021"}, {"Unnamed: 0": 198704, "autor": "bmason8", "date": 1626552376000, "content": "Looking for volunteers for jpg recipe extraction help /!/ I'm the developer of the Fuji Custom Recipe app (let's you create your own jpg recipes) and I'm working on an update where you can import a jpg and 'extract' the recipe that was used to make it. It turns out it's a painful process because I have to figure out what each 'MakerNote Tag' means for each setting and you wouldn't believe how convoluted Fujifilm has made it. I've searched the internet for some type of lookup table for this stuff but for the one I found almost all of it was wrong for an image from an xtrans4 (new version) sensor. I've done the work of figuring out most of the settings for that sensor but was wondering if anyone was interested in helping streamline some of the older sensors. What I'm hoping for is for someone to iterate through all the jpg settings for a given sensor and take a picture of the current settings as they go along. That way I can import each photo and confirm what the values should be. For instance, 1st photo:  \nProvia, color = 0, grain size = small, sharpness = 0, etc.  \n2nd photo:  \nAstia, color = +1, grain size = Large, sharpness = +1, etc.  \nImportantly, the photo would be of the settings written down or in a notes app on your computer or something.  \nIf you're not bored yet here are some details about what makes this so difficult...  \n1. For most settings I have to make sense of what something like this means '0x1438'. So I take multiple photos and track how the values change.  \n2. MakerNotes Tag's don't appear in the exif data so they aren't standardized  \n3. Fuji doesn't just use the actual values AND they don't always use predictable patterns (for example for 'Color': 1216 = -3 but 'Low 2' = -2) WHY FUJI?!  \n4. There can be multiple keys to process for a single setting (example: not all film simulations can be extracted from the same key. Monochrome films sims appear under a different key).  \n\n\nUnfortunately the best I can offer anyone who helps is a free download code for the app so this is basically a thankless task unfortunately. That being said, if you do want to help please comment below. And this is something we can figure out later but just an FYI: If you compress the image at all once it's off the camera (ie upload to almost any service), the all important MakerNote tags will be removed (you can still compress the jpg in camera though).  \nPlease ignore how bad the UI looks...this is just what I hastily built for debugging.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5vtyx3ipxtb71.png?width=945&amp;format=png&amp;auto=webp&amp;s=4f9a87e60755cf89a871436e955a527060d76686", "link": "https://www.reddit.com/r/fujifilm/comments/ombo41/looking_for_volunteers_for_jpg_recipe_extraction/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for volunteers for jpg recipe extraction help /!/ i'm the developer of the fuji custom recipe app (let's you create your own jpg recipes) and i'm working on an update where you can import a jpg and 'extract' the recipe that was used to make it. it turns out it's a painful process because i have to figure out what each 'makernote -----> tag !!! ' means for each setting and you wouldn't believe how convoluted fujifilm has made it. i've searched the internet for some type of lookup table for this stuff but for the one i found almost all of it was wrong for an image from an xtrans4 (new version) sensor. i've done the work of figuring out most of the settings for that sensor but was wondering if anyone was interested in helping streamline some of the older sensors. what i'm hoping for is for someone to iterate through all the jpg settings for a given sensor and take a picture of the current settings as they go along. that way i can import each photo and confirm what the values should be. for instance, 1st photo:  \nprovia, color = 0, grain size = small, sharpness = 0, etc.  \n2nd photo:  \nastia, color = +1, grain size = large, sharpness = +1, etc.  \nimportantly, the photo would be of the settings written down or in a notes app on your computer or something.  \nif you're not bored yet here are some details about what makes this so difficult...  \n1. for most settings i have to make sense of what something like this means '0x1438'. so i take multiple photos and track how the values change.  \n2. makernotes tag's don't appear in the exif data so they aren't standardized  \n3. fuji doesn't just use the actual values and they don't always use predictable patterns (for example for 'color': 1216 = -3 but 'low 2' = -2) why fuji?!  \n4. there can be multiple keys to process for a single setting (example: not all film simulations can be extracted from the same key. monochrome films sims appear under a different key).  \n\n\nunfortunately the best i can offer anyone who helps is a free download code for the app so this is basically a thankless task unfortunately. that being said, if you do want to help please comment below. and this is something we can figure out later but just an fyi: if you compress the image at all once it's off the camera (ie upload to almost any service), the all important makernote tags will be removed (you can still compress the jpg in camera though).  \nplease ignore how bad the ui looks...this is just what i hastily built for debugging.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/5vtyx3ipxtb71.png?width=945&amp;format=png&amp;auto=webp&amp;s=4f9a87e60755cf89a871436e955a527060d76686", "sortedWord": "None", "identifyer": 91814, "year": "2021"}, {"Unnamed: 0": 199162, "autor": "V1v3nci0", "date": 1618619659000, "content": "Tokyo tagged | XT-3 | XF18mm f2", "link": "https://www.reddit.com/r/fujifilm/comments/msgdi8/tokyo_tagged_xt3_xf18mm_f2/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "tokyo -----> tagged !!!  | xt-3 | xf18mm f2", "sortedWord": "None", "identifyer": 92304, "year": "2021"}, {"Unnamed: 0": 199506, "autor": "zakariasabbagh", "date": 1617465589000, "content": "Considering switching to Fujifilm from Sony A7 III. What are your thoughts? /!/ Last year I upgraded to Sony A7 III. It was a big upgrade and it has been a joy using it, but recently it has now hit me the big drawback of having FF. Weight and cost. Lenses are so expensive in the Sony FE lineup and it feels sad that I somehow missed out thoroughly checking Fujifilm as an alternative last year. I guess I was a bit narrow-mindes at the moment of purchase. For this reason, I am very tempted to transition to Fujifilm (especially X-T4) for its more lightweight gear with more reasonable price-tags.\n\nI have felt recently that the Sony A7 III makes photography a bit much of a machinery, as much to get the desired result requires quite a bit of post-editing.\n\nI am therefore wondering, if anyone has had both a full frame mirrorless camera and a Fujifilm X-mount camera of this generation and how big difference they are in image quality? Is a transition something you could recommend? Also, are the lenses of Fuji as good as they are rumored to be (especially the weather sealed primes of f2 and the 16-80 f4 lens)?\n\nIf anybody has much experience of working with Fujifilm RAW files in Lightroom compared to other systems, how does it work out for you?", "link": "https://www.reddit.com/r/fujifilm/comments/mjbab4/considering_switching_to_fujifilm_from_sony_a7/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "considering switching to fujifilm from sony a7 iii. what are your thoughts? /!/ last year i upgraded to sony a7 iii. it was a big upgrade and it has been a joy using it, but recently it has now hit me the big drawback of having ff. weight and cost. lenses are so expensive in the sony fe lineup and it feels sad that i somehow missed out thoroughly checking fujifilm as an alternative last year. i guess i was a bit narrow-mindes at the moment of purchase. for this reason, i am very tempted to transition to fujifilm (especially x-t4) for its more lightweight gear with more reasonable price------> tags !!! .\n\ni have felt recently that the sony a7 iii makes photography a bit much of a machinery, as much to get the desired result requires quite a bit of post-editing.\n\ni am therefore wondering, if anyone has had both a full frame mirrorless camera and a fujifilm x-mount camera of this generation and how big difference they are in image quality? is a transition something you could recommend? also, are the lenses of fuji as good as they are rumored to be (especially the weather sealed primes of f2 and the 16-80 f4 lens)?\n\nif anybody has much experience of working with fujifilm raw files in lightroom compared to other systems, how does it work out for you?", "sortedWord": "None", "identifyer": 92670, "year": "2021"}, {"Unnamed: 0": 200371, "autor": "currently_", "date": 1615347859000, "content": "Hobbyists, what's your storage, organization, and back-up system like? /!/ Hoping to hear from Capture One users, but everyone welcome. Some talking points:\n\n1. Do you use a cataloguing software? (Capture One, Lightroom, etc.)\n2. What's your workflow like?\n   1. How often do you offload your SD card?\n   2. Where do you store your photos? Do you store and work off a portable/external drive?\n   3. Do you use LR/CO to import directly to storage?\n   4. When do you \"weed out\" your photos/slim down your library? (In camera, after transfer, etc.) \n   5. Do you keep all RAW files?\n   6. Do you organize your catalogue based by ratings, tags, etc?\n   7. How often do you go through your library/how often do you edit? After every SD card dump?\n3. What HDD/SSD storage and backup solutions do you use?\n4. What cloud backup solutions do you use?", "link": "https://www.reddit.com/r/fujifilm/comments/m1ojyq/hobbyists_whats_your_storage_organization_and/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "hobbyists, what's your storage, organization, and back-up system like? /!/ hoping to hear from capture one users, but everyone welcome. some talking points:\n\n1. do you use a cataloguing software? (capture one, lightroom, etc.)\n2. what's your workflow like?\n   1. how often do you offload your sd card?\n   2. where do you store your photos? do you store and work off a portable/external drive?\n   3. do you use lr/co to import directly to storage?\n   4. when do you \"weed out\" your photos/slim down your library? (in camera, after transfer, etc.) \n   5. do you keep all raw files?\n   6. do you organize your catalogue based by ratings, -----> tags !!! , etc?\n   7. how often do you go through your library/how often do you edit? after every sd card dump?\n3. what hdd/ssd storage and backup solutions do you use?\n4. what cloud backup solutions do you use?", "sortedWord": "None", "identifyer": 93579, "year": "2021"}], "name": "tagfujifilm2021"}