{"interestingcomments": [{"autor": "justinarkinson", "date": "2021-03-28 11:40:29", "content": "Viltrox EF-FX1 Adapter Firmware /!/ Hi all\n\n&amp;#x200B;\n\nHope someone can help.\n\n&amp;#x200B;\n\nI am a FX-T1 user and currently up until today using Canon EF lenses on my camera with the Viltrox EF-FX1 adapater.\n\n&amp;#x200B;\n\nIt was working perfectly! No issues focuses etc.\n\n&amp;#x200B;\n\nI updated to the latest firmware v2.29 and now it constantly focus hunts.\n\n&amp;#x200B;\n\nDoes anyone have the older firmware saved or can point me in the right direction? I see Viltrox no longer have the older firmwares on their site. I have been searching for hours and am coming up with nothing.\n\n&amp;#x200B;\n\nThe firmware I upgraded from was v2.14 so preferably but willing to try any. \n\n&amp;#x200B;\n\nThanks in advance.", "link": "https://www.reddit.com/r/fujifilm/comments/mezuxe/viltrox_effx1_adapter_firmware/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "viltrox ef-fx1 adapter firmware /!/ hi all\n\n&amp;#x200b;\n\nhope someone can help.\n\n&amp;#x200b;\n\ni am a fx-t1 user and currently up until today using canon ef lenses on my camera with the viltrox ef-fx1 adapater.\n\n&amp;#x200b;\n\nit was working perfectly! no issues focuses etc.\n\n&amp;#x200b;\n\ni updated to the latest firmware v2.29 and now it constantly focus hunts.\n\n&amp;#x200b;\n\ndoes anyone have the older firmware saved or can point me in the right direction? i see viltrox no longer have the older firmwares on their site. i have been searching for hours and am -----> coming !!!  -----> up !!!  -----> with !!!  nothing.\n\n&amp;#x200b;\n\nthe firmware i upgraded from was v2.14 so preferably but willing to try any. \n\n&amp;#x200b;\n\nthanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 90571, "year": "2021"}, {"autor": "SulphaTerra", "date": "2021-08-24 14:20:43", "content": "Opinions of X100V as grab&amp;go camera /!/ Hello folks! I came up with the decision to get a compact camera as grab&amp;go option when I'm going to places where I'm not sure I will have the chance to shoot or not, or for the occasions in which I wouldn't bring my heavier FF camera for a variety of reasons. I'm talking about trekkings, museums, walks around the city, boat trips... You name one. I don't have any specific use in mind, on the contrary I just want something that does not make me regret of leaving the camera at home (which happened a lot in the past years because FF is bulkier/heavier/I need a specific bag/etc). I don't like using the smartphone for taking photos, and I care about photo quality.\n\nI would probably use it for street photos, but also landscapes, portraits. I'm not scared by the fixed lens because many times I just use the Sony 35mm f/1.8 on the FF, and I used APS-C before, so I'm aware of the differences in terms of low-light performances&amp;co. I don't need something that fits a jeans pocket (I usually have a little backpack with me - or girlfriend's purse). I would like your opinions on the X100V for my use-case (or if you have different suggestions!). I don't have a specific budget in mind, other than not wanting to spend thousands for a Leica :)\n\nThank you very much for your inputs!", "link": "https://www.reddit.com/r/fujifilm/comments/paoaqh/opinions_of_x100v_as_grabgo_camera/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "opinions of x100v as grab&amp;go camera /!/ hello folks! i -----> came !!!  -----> up !!!  -----> with !!!  the decision to get a compact camera as grab&amp;go option when i'm going to places where i'm not sure i will have the chance to shoot or not, or for the occasions in which i wouldn't bring my heavier ff camera for a variety of reasons. i'm talking about trekkings, museums, walks around the city, boat trips... you name one. i don't have any specific use in mind, on the contrary i just want something that does not make me regret of leaving the camera at home (which happened a lot in the past years because ff is bulkier/heavier/i need a specific bag/etc). i don't like using the smartphone for taking photos, and i care about photo quality.\n\ni would probably use it for street photos, but also landscapes, portraits. i'm not scared by the fixed lens because many times i just use the sony 35mm f/1.8 on the ff, and i used aps-c before, so i'm aware of the differences in terms of low-light performances&amp;co. i don't need something that fits a jeans pocket (i usually have a little backpack with me - or girlfriend's purse). i would like your opinions on the x100v for my use-case (or if you have different suggestions!). i don't have a specific budget in mind, other than not wanting to spend thousands for a leica :)\n\nthank you very much for your inputs!", "sortedWord": "None", "Identifyer": null, "identifyer": 91580, "year": "2021"}, {"autor": "nitwos", "date": "2021-06-08 15:46:26", "content": "Lens repair experience with Fujifilm NJ? /!/ A little while back my 35mm f1.4 was involved in a sudden gravitational encounter with the floor. Fortunately it dropped onto carpet, but unfortunately it hit the edge of my desk on its way down. There were no external signs of damage and some quick testing at the time didn’t indicate anything was wrong with it, however I didn’t do any extensive tests since I’d gotten an X100V and wasn’t using my X-T1/lenses much at the time. Fast forward to this weekend, I’ve just replaced my X100V with an X-Pro3 and while playing around with the 35mm I started getting a “Turn off camera and turn on again” error while manual focusing. This only seems to happen while manual focusing and when the front element is extended at its furthest, and not during any AF functions but I did notice it hunts a bit more in AF mode than I remembered (though again it’s been a while since I used it regularly). I’ve tested the camera with other lenses as well and the error only comes up with the 35mm.  \n\nI’ve decided to ship it to Fuji’s repair center in NJ for inspection and repair and was wondering what people’s experiences have been when sending in damaged lenses. More specifically, what is the average turn-around time and is there any chance I’ll have this back before my trip in a month? Also, there’s an option to have them send you a replacement unit rather than repairing it. I’m assuming this means a quicker return, but is there a higher cost for this vs a repair?", "link": "https://www.reddit.com/r/fujifilm/comments/nv71o1/lens_repair_experience_with_fujifilm_nj/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "lens repair experience with fujifilm nj? /!/ a little while back my 35mm f1.4 was involved in a sudden gravitational encounter with the floor. fortunately it dropped onto carpet, but unfortunately it hit the edge of my desk on its way down. there were no external signs of damage and some quick testing at the time didn’t indicate anything was wrong with it, however i didn’t do any extensive tests since i’d gotten an x100v and wasn’t using my x-t1/lenses much at the time. fast forward to this weekend, i’ve just replaced my x100v with an x-pro3 and while playing around with the 35mm i started getting a “turn off camera and turn on again” error while manual focusing. this only seems to happen while manual focusing and when the front element is extended at its furthest, and not during any af functions but i did notice it hunts a bit more in af mode than i remembered (though again it’s been a while since i used it regularly). i’ve tested the camera -----> with !!!  other lenses as well and the error only -----> comes !!!  -----> up !!!  -----> with !!!  the 35mm.  \n\ni’ve decided to ship it to fuji’s repair center in nj for inspection and repair and was wondering what people’s experiences have been when sending in damaged lenses. more specifically, what is the average turn-around time and is there any chance i’ll have this back before my trip in a month? also, there’s an option to have them send you a replacement unit rather than repairing it. i’m assuming this means a quicker return, but is there a higher cost for this vs a repair?", "sortedWord": "None", "Identifyer": null, "identifyer": 97007, "year": "2021"}, {"autor": "Svperb", "date": "2021-07-02 19:45:20", "content": "X100T: Cannot transfer images to MacBook /!/ Hi all -  \n\n\nI tried looking at a few threads from 2017 and onwards on this but everyone seemed to find a solve but me. I cannot get my wifi sync setup and would prefer to use my microUSB to transfer images to my Macbook anyhow. I have my microUSB/USB plugged into my USB/USB C extension and when I turn the camera on it comes up with USB on the screen. I've tried opening Image Capture and iPhoto but my Macbook is not recognizing/showing any sign of the camera being connected.  \n\n\nUrgently need a solve as I've been looking for weeks and cannot find what's wrong.", "link": "https://www.reddit.com/r/fujifilm/comments/ochsaz/x100t_cannot_transfer_images_to_macbook/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "x100t: cannot transfer images to macbook /!/ hi all -  \n\n\ni tried looking at a few threads from 2017 and onwards on this but everyone seemed to find a solve but me. i cannot get my wifi sync setup and would prefer to use my microusb to transfer images to my macbook anyhow. i have my microusb/usb plugged into my usb/usb c extension and when i turn the camera on it -----> comes !!!  -----> up !!!  -----> with !!!  usb on the screen. i've tried opening image capture and iphoto but my macbook is not recognizing/showing any sign of the camera being connected.  \n\n\nurgently need a solve as i've been looking for weeks and cannot find what's wrong.", "sortedWord": "None", "Identifyer": null, "identifyer": 97823, "year": "2021"}], "name": "withfujifilm2021"}