{"interestingcomments": [{"autor": "DanyTheConqueror", "date": "2019-10-17 09:33:03", "content": "X-T3 Firmware: IBIS? /!/ Is it possible that Fuji will come up with an IBIS firmware update for this X-T3 like they did with the X-H1? Or should I wait for the release of an X-H2 (which hopefully can be on par with the GH5's impeccable IBIS). \n\nI know IBIS isn't a deal breaker for most consumers, but I'd really like to get organic non-jittery handheld video and don't like the idea of spending on gimbals or more stabilization accessories.", "link": "https://www.reddit.com/r/fujifilm/comments/dj3y0j/xt3_firmware_ibis/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "x-t3 firmware: ibis? /!/ is it possible that fuji will -----> come !!!  -----> up !!!  -----> with !!!  an ibis firmware update for this x-t3 like they did -----> with !!!  the x-h1? or should i wait for the release of an x-h2 (which hopefully can be on par with the gh5's impeccable ibis). \n\ni know ibis isn't a deal breaker for most consumers, but i'd really like to get organic non-jittery handheld video and don't like the idea of spending on gimbals or more stabilization accessories.", "sortedWord": "None", "Identifyer": null, "identifyer": 23659, "year": "2019"}, {"autor": "randomMAC", "date": "2019-08-28 03:38:03", "content": "Lightroom workflow /!/ Just got the X-T3 and trying to figure everything out. I have so far been using Lightroom before the Fuji.\n\nImmediately I have seen one issue. When I import the RAF file in to Lightroom , my simulation goes away as Lightroom applies the adobe default profile. I found out that I can switch the profile manually to select a fuji simulation, however I have no way of knowing what the originally applied simulation was in the camera.\n\nRight now I am shooting RAW+JPEG just so I have the original image as well. Is there a way to get Lightroom to apply the right profile as I import the raw file?\n\nAlso in general what is a good workflow with Lightroom . I have been reading posts about needing the Iridient transformer? Is that really necessary? I tried playing around with Capture One for 5 minutes, maybe that wasn't enough time but it looked way too different and I don't think I want to transfer my entire catalog of images over.  Is it really that much better?\n\nWhat are some Lightroom best practices you guys have come up with?\n\nThanks!", "link": "https://www.reddit.com/r/fujifilm/comments/cwfd6x/lightroom_workflow/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "lightroom workflow /!/ just got the x-t3 and trying to figure everything out. i have so far been using lightroom before the fuji.\n\nimmediately i have seen one issue. when i import the raf file in to lightroom , my simulation goes away as lightroom applies the adobe default profile. i found out that i can switch the profile manually to select a fuji simulation, however i have no way of knowing what the originally applied simulation was in the camera.\n\nright now i am shooting raw+jpeg just so i have the original image as well. is there a way to get lightroom to apply the right profile as i import the raw file?\n\nalso in general what is a good workflow with lightroom . i have been reading posts about needing the iridient transformer? is that really necessary? i tried playing around with capture one for 5 minutes, maybe that wasn't enough time but it looked way too different and i don't think i want to transfer my entire catalog of images over.  is it really that much better?\n\nwhat are some lightroom best practices you guys have -----> come !!!  -----> up !!!  -----> with !!! ?\n\nthanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 26891, "year": "2019"}], "name": "withfujifilm2019"}