{"interestingcomments": [{"autor": "Hunter422", "date": "2020-03-10 15:00:25", "content": "Trouble deciding what should be my 1st lens after the XF 18-55 f2.8-4 /!/ I know lenses are subjective and it’s hard to recommend one so I will try to explain my needs as best as I can, so please bare with me.\n\nI absolutely love the kit lens and the sharpness and versatility it provides. I am only a hobbyist and I don’t rely on photography as a source of income. I take mostly travel and street photography with some landscape and portrait that naturally occur while on travel. I have 2 main reasons why I want a new lens - 1st is low light performance. One example was when I was on a dinner cruise and couldn’t capture any photos without bumping the ISO up to 6400. I really think a fast Prime lens would have helped a lot in this case. 2nd is focal length although this might have been more situational. We went to an open zoo/reserve and 55mm was nowhere near enough to capture the animals and shows the way I wanted to. Here I feel like a longer zoom would have helped tremendously. On further reflection though, how often do I really go on zoos or watch theatrical performances from a distance - probably not so much. Then again, having the option of having a lens with a long focal length would be good to have.\n\nI am also struggling between the old Prime vs. Zoom argument. I do feel like I should get a Prime for both the practical aspects as well as for improving my own skill by being locked to a fixed focal point but I feel like I was “spoiled” by starting with a zoom lens and I feel like I would miss quite a lot of shots if I were to use a Prime.\n\nI really want something to compliment the 18-55 rather than replace it as I really love the lens. After a lot of research and thinking, I have come up with the following options in order of what I think is best for my situation:\n\n1. XC 35mm F2 and Viltrox 85mm F1.8 - 2 lenses for the price of 1 XF lens. Both are very fast lenses and from what I’ve read are very sharp. The only negatives here are neither are XF lenses and both are Primes but those aren’t really a negative.\n\n2. XF 55-200mm F3.5-4.8 - A zoom lens that would compliment the 18-55 beautifully. Negative is it’s a zoom so it’s not as fast or as sharp as Primes. Also I don’t get any low light advantages a Prime would provide.\n\n3. XF 16mm F1.4 - Lots of good reviews for this lens, the 16mm and F1.4 as well as super close min focus distance allow for a lot of creative and unique shots which I do wish to learn and experience. The big negative for this lens is it’s not very versatile. Super wide angle requires a lot of shot composition and no classic/lazy flattering portrait shots allowed. For landscape I feel the 18mm on the kit would also work similarly to this lens especially since the F1.4 aperture wouldn’t matter in this case though I could be wrong.\n\n4. XF 50-140mm F2.8 - This one is the red badge monster and a big part of me wanting this feels more emotional than anything practical. Feels like the opposite of my 1st option which is the most practical but less “exciting” option.\n\n5. 23mm F2 or 35mm F2 - The most common all-rounders. I just feel like the kit lens does well enough @23mm and the existence of the XC 35mm F2 for half the price really makes these lenses a tough buy for me.\n\nThese are my options. If you were in my situation, what would you get? Feel free to recommend other lenses as well. Another thing I might have glanced over is budget, I am willing to shell out as long as it gives the best results for the money It costs.\n\nSorry for the long post, if you have made it this far, thanks for your time and advice!", "link": "https://www.reddit.com/r/fujifilm/comments/fgf49d/trouble_deciding_what_should_be_my_1st_lens_after/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "trouble deciding what should be my 1st lens after the xf 18-55 f2.8-4 /!/ i know lenses are subjective and it’s hard to recommend one so i will try to explain my needs as best as i can, so please bare with me.\n\ni absolutely love the kit lens and the sharpness and versatility it provides. i am only a hobbyist and i don’t rely on photography as a source of income. i take mostly travel and street photography with some landscape and portrait that naturally occur while on travel. i have 2 main reasons why i want a new lens - 1st is low light performance. one example was when i was on a dinner cruise and couldn’t capture any photos without bumping the iso up to 6400. i really think a fast prime lens would have helped a lot in this case. 2nd is focal length although this might have been more situational. we went to an open zoo/reserve and 55mm was nowhere near enough to capture the animals and shows the way i wanted to. here i feel like a longer zoom would have helped tremendously. on further reflection though, how often do i really go on zoos or watch theatrical performances from a distance - probably not so much. then again, having the option of having a lens with a long focal length would be good to have.\n\ni am also struggling between the old prime vs. zoom argument. i do feel like i should get a prime for both the practical aspects as well as for improving my own skill by being locked to a fixed focal point but i feel like i was “spoiled” by starting with a zoom lens and i feel like i would miss quite a lot of shots if i were to use a prime.\n\ni really want something to compliment the 18-55 rather than replace it as i really love the lens. after a lot of research and thinking, i have -----> come !!!  -----> up !!!  -----> with !!!  the following options in order of what i think is best for my situation:\n\n1. xc 35mm f2 and viltrox 85mm f1.8 - 2 lenses for the price of 1 xf lens. both are very fast lenses and from what i’ve read are very sharp. the only negatives here are neither are xf lenses and both are primes but those aren’t really a negative.\n\n2. xf 55-200mm f3.5-4.8 - a zoom lens that would compliment the 18-55 beautifully. negative is it’s a zoom so it’s not as fast or as sharp as primes. also i don’t get any low light advantages a prime would provide.\n\n3. xf 16mm f1.4 - lots of good reviews for this lens, the 16mm and f1.4 as well as super close min focus distance allow for a lot of creative and unique shots which i do wish to learn and experience. the big negative for this lens is it’s not very versatile. super wide angle requires a lot of shot composition and no classic/lazy flattering portrait shots allowed. for landscape i feel the 18mm on the kit would also work similarly to this lens especially since the f1.4 aperture wouldn’t matter in this case though i could be wrong.\n\n4. xf 50-140mm f2.8 - this one is the red badge monster and a big part of me wanting this feels more emotional than anything practical. feels like the opposite of my 1st option which is the most practical but less “exciting” option.\n\n5. 23mm f2 or 35mm f2 - the most common all-rounders. i just feel like the kit lens does well enough @23mm and the existence of the xc 35mm f2 for half the price really makes these lenses a tough buy for me.\n\nthese are my options. if you were in my situation, what would you get? feel free to recommend other lenses as well. another thing i might have glanced over is budget, i am willing to shell out as long as it gives the best results for the money it costs.\n\nsorry for the long post, if you have made it this far, thanks for your time and advice!", "sortedWord": "None", "Identifyer": null, "identifyer": 58301, "year": "2020"}, {"autor": "shotkit", "date": "2020-05-12 10:02:08", "content": "Wireless transfer on the X100V no longer working /!/ I've had the X100V for about a month now and have been loving it (my review of it [here](https://shotkit.com/fujifilm-x100v-review/) if you're interested).\n\nMy main peeve is that I can no longer get it to connect to my iphone to transfer images - it literally worked once on the day I got it, and then never again.\n\nI've reset the phone, the camera, tried various settings, inside my home wifi network and outside with no wifi... and it still refuses to maintain a connection long enough to transfer a photo.\n\nDoes anyone else have any similar experiences? The Fuji remote app has always been dodgy af, and even the newer version sucks.\n\nReally wish they'd come up with a better solution...", "link": "https://www.reddit.com/r/fujifilm/comments/gi8c8x/wireless_transfer_on_the_x100v_no_longer_working/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "wireless transfer on the x100v no longer working /!/ i've had the x100v for about a month now and have been loving it (my review of it [here](https://shotkit.com/fujifilm-x100v-review/) if you're interested).\n\nmy main peeve is that i can no longer get it to connect to my iphone to transfer images - it literally worked once on the day i got it, and then never again.\n\ni've reset the phone, the camera, tried various settings, inside my home wifi network and outside with no wifi... and it still refuses to maintain a connection long enough to transfer a photo.\n\ndoes anyone else have any similar experiences? the fuji remote app has always been dodgy af, and even the newer version sucks.\n\nreally wish they'd -----> come !!!  -----> up !!!  -----> with !!!  a better solution...", "sortedWord": "None", "Identifyer": null, "identifyer": 61224, "year": "2020"}, {"autor": "streetdapper", "date": "2020-06-23 00:01:11", "content": "What lenses to go for first? (X-t3) /!/ Hey guys, i need some help coming to a conclusion as I've managed to come up with the money to purchase the x-t3 since it is for the most part on sale right now. I currently have the money for the body plus 2 other lenses priced at 400-500 each. I also plan to sell my current camera and lenses to possibly purchase a third lens. Do any of you guys have any recommendations for lens to go for? I was considering the 35mm and 50mm but then i keep thinking of something lower than 23mm or even the 23mm itself. However i do already own the x100f and that in itself is 23mm. Or would it make more sense to sell that x100f and purchase a 23mm for the x-t3? thanks for the thoughts people! btw i do photography/videography. Street/lifestyle/fashion/portraits. With video its a mix between documentary/youtube. Any help is appreciated :)", "link": "https://www.reddit.com/r/fujifilm/comments/he3vcj/what_lenses_to_go_for_first_xt3/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what lenses to go for first? (x-t3) /!/ hey guys, i need some help coming to a conclusion as i've managed to -----> come !!!  -----> up !!!  -----> with !!!  the money to purchase the x-t3 since it is for the most part on sale right now. i currently have the money for the body plus 2 other lenses priced at 400-500 each. i also plan to sell my current camera and lenses to possibly purchase a third lens. do any of you guys have any recommendations for lens to go for? i was considering the 35mm and 50mm but then i keep thinking of something lower than 23mm or even the 23mm itself. however i do already own the x100f and that in itself is 23mm. or would it make more sense to sell that x100f and purchase a 23mm for the x-t3? thanks for the thoughts people! btw i do photography/videography. street/lifestyle/fashion/portraits. with video its a mix between documentary/youtube. any help is appreciated :)", "sortedWord": "None", "Identifyer": null, "identifyer": 61679, "year": "2020"}, {"autor": "marissathehorrible", "date": "2020-05-31 14:42:48", "content": "Trying to come up with an in-cam jpeg recipe... it’s a bit green but getting there. I do love the 56 f1.2, but the AF drives me nuts sometimes.... (XT3)", "link": "https://www.reddit.com/r/fujifilm/comments/gu0amk/trying_to_come_up_with_an_incam_jpeg_recipe_its_a/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "trying to -----> come !!!  -----> up !!!  -----> with !!!  an in-cam jpeg recipe... it’s a bit green but getting there. i do love the 56 f1.2, but the af drives me nuts sometimes.... (xt3)", "sortedWord": "None", "Identifyer": null, "identifyer": 62840, "year": "2020"}, {"autor": "sigasaul092", "date": "2020-11-03 19:10:23", "content": "Reccomendations on Fuji Camera + Lens combo /!/ Hi Fuji Shooters,\n\nI'm really close to finalizing my camera setup after a ton of research. I'm moving from a canon m50 to fuji for the video and still upgrade. Really love the film simulations, and overall usability of the fuji system (analog buttons and knobs etc).\n\nI've narrowed down to an XT3 body but I'm wondering what the best lens combo for me to get. I enjoy shooting landscape mostly, but also enjoy some hobby portraiture shots. Additionally, I'm looking to get into action photography, mainly snowboarding. Also I do dable in video a bit (Mostly short 5 min videos of hikes).\n\nWith this in mind, and with a few sales going on with XT3 bodys and lenses I've come up with a couple options:\n\n* Option 1: XT3 body with the 16-55 f2.8 ($2,600 CAD)\n* Option 2: XT3 Body with 16-80 F4, and 55-200  F3.5-4.8 ($2,698 CAD)\n\nMy original idea was to get the 16-55 f2.8 and save up for the 50-140 f2.8 and eventually complete the trinity with a 10-24 f4. But I'm starting to wonder if it may make more economical sense to go with the 16-80 and 55-200 and give up that low light/bokeh. The sharpness tests with the 16-80 and 55-200 online seem that it's really close to the red badge 16-55 and 55-140. \n\nGiven the stuff I want to shoot (Mostly landscape, some portrait/travel, and snowboarding action) will the additional stops of light on the 2.8 lenses really make a difference? Or should I save the money and grab the second option?", "link": "https://www.reddit.com/r/fujifilm/comments/jngmux/reccomendations_on_fuji_camera_lens_combo/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "reccomendations on fuji camera + lens combo /!/ hi fuji shooters,\n\ni'm really close to finalizing my camera setup after a ton of research. i'm moving from a canon m50 to fuji for the video and still upgrade. really love the film simulations, and overall usability of the fuji system (analog buttons and knobs etc).\n\ni've narrowed down to an xt3 body but i'm wondering what the best lens combo for me to get. i enjoy shooting landscape mostly, but also enjoy some hobby portraiture shots. additionally, i'm looking to get into action photography, mainly snowboarding. also i do dable in video a bit (mostly short 5 min videos of hikes).\n\n-----> with !!!  this in mind, and -----> with !!!  a few sales going on -----> with !!!  xt3 bodys and lenses i've -----> come !!!  -----> up !!!  -----> with !!!  a couple options:\n\n* option 1: xt3 body -----> with !!!  the 16-55 f2.8 ($2,600 cad)\n* option 2: xt3 body -----> with !!!  16-80 f4, and 55-200  f3.5-4.8 ($2,698 cad)\n\nmy original idea was to get the 16-55 f2.8 and save -----> up !!!  for the 50-140 f2.8 and eventually complete the trinity -----> with !!!  a 10-24 f4. but i'm starting to wonder if it may make more economical sense to go with the 16-80 and 55-200 and give up that low light/bokeh. the sharpness tests with the 16-80 and 55-200 online seem that it's really close to the red badge 16-55 and 55-140. \n\ngiven the stuff i want to shoot (mostly landscape, some portrait/travel, and snowboarding action) will the additional stops of light on the 2.8 lenses really make a difference? or should i save the money and grab the second option?", "sortedWord": "None", "Identifyer": null, "identifyer": 65398, "year": "2020"}, {"autor": "AlxDzNutz", "date": "2020-08-13 17:06:33", "content": "Which Lens should I buy next? (XT-4) /!/ I am new to Fuji's! I got an XT-4 and I am loving it. I currently own the 16mm 1.4 and 90mm F2. Both Lenses are great! I just got the 90mm and man, it has challenged me to shoot differently, but I love the shots I have come up with. So different than the 16mm. Although, it can be a challenge because I have to be so far away from the subject. I shoot both indoor photos of my family and also shoot a lot of vehicles. Im enjoying the focal length of the 90mm, but maybe want a lens where i dont have to be that far away, maybe a step down from the 90mm or adding a zoom lens possibly. Thank you for your help!", "link": "https://www.reddit.com/r/fujifilm/comments/i93szj/which_lens_should_i_buy_next_xt4/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "which lens should i buy next? (xt-4) /!/ i am new to fuji's! i got an xt-4 and i am loving it. i currently own the 16mm 1.4 and 90mm f2. both lenses are great! i just got the 90mm and man, it has challenged me to shoot differently, but i love the shots i have -----> come !!!  -----> up !!!  -----> with !!! . so different than the 16mm. although, it can be a challenge because i have to be so far away from the subject. i shoot both indoor photos of my family and also shoot a lot of vehicles. im enjoying the focal length of the 90mm, but maybe want a lens where i dont have to be that far away, maybe a step down from the 90mm or adding a zoom lens possibly. thank you for your help!", "sortedWord": "None", "Identifyer": null, "identifyer": 66764, "year": "2020"}], "name": "withfujifilm2020"}