{"interestingcomments": [{"autor": "thextianbay", "date": "2018-01-26 04:13:42", "content": "X-Pro 1 eye sensor doesn't switch back to lCD /!/ This seems like a common issue that still hasn't been answered. And by common I mean I found 3 threads via Google search and within that thread, many people have left comments somewhere between the lines of \"has anyone found an answer yet as I'm having the same issue\" and \"this just happened to me a few days ago.\" I'm not falling into the latter group as this just happened to me.\n\n\nI've tried cleaning the sensor, resetting, removing the battery, on and off. My online search has kind of killed any hope as it seems like an unsolvable issue. But one thing I noticed is that there wasn't any reddit threads that came up with the issue. I may have just not been searching hard enough.\n\n\nTo keep it short. I've come here to see if anyone has had this issue, known any one who have experienced this issue, and know a fix for said issue. \n\n\nThanks in advance everyone. ", "link": "https://www.reddit.com/r/fujifilm/comments/7t24c1/xpro_1_eye_sensor_doesnt_switch_back_to_lcd/", "origin": "Reddit", "suborigin": "fujifilm", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "x-pro 1 eye sensor doesn't switch back to lcd /!/ this seems like a common issue that still hasn't been answered. and by common i mean i found 3 threads via google search and within that thread, many people have left comments somewhere between the lines of \"has anyone found an answer yet as i'm having the same issue\" and \"this just happened to me a few days ago.\" i'm not falling into the latter group as this just happened to me.\n\n\ni've tried cleaning the sensor, resetting, removing the battery, on and off. my online search has kind of killed any hope as it seems like an unsolvable issue. but one thing i noticed is that there wasn't any reddit threads that -----> came !!!  -----> up !!!  -----> with !!!  the issue. i may have just not been searching hard enough.\n\n\nto keep it short. i've come here to see if anyone has had this issue, known any one who have experienced this issue, and know a fix for said issue. \n\n\nthanks in advance everyone. ", "sortedWord": "None", "Identifyer": null, "identifyer": 336, "year": "2018"}], "name": "withfujifilm2018"}