{"interestingcomments": [{"Unnamed: 0": 9256, "autor": "Marinlik", "date": 1548609041000, "content": "Cleaned backside of a7ii. All buttons dead /!/ So i cleaned the backside of my a7ii with some lens cleaner and a wipe because I thought it was smart. Well now all buttons have become messed up. The ok buttons opens the picture archive. Every button except for the spin wheel and shutter (which both work) now opens the archive. Am I screwed with a near brick camera here?", "link": "https://www.reddit.com/r/SonyAlpha/comments/akdx5f/cleaned_backside_of_a7ii_all_buttons_dead/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "cleaned backside of a7ii. all buttons dead /!/ so i cleaned the backside of my a7ii with some lens cleaner and a wipe because i thought it was smart. well now all buttons have become messed up. the ok buttons opens the picture -----> archive !!! . every button except for the spin wheel and shutter (which both work) now opens the archive. am i screwed with a near brick camera here?", "sortedWord": "None", "identifyer": 9384, "year": "2019"}, {"Unnamed: 0": 9486, "autor": "dougthecamera", "date": 1553360973000, "content": "Hello! Just looking to get some suggestions from Sony users on how they manage, backup and archive ARWs and JPEGs. I'm just having issues with organization and archiving and thought the community might be able to help! 😀", "link": "https://www.reddit.com/r/SonyAlpha/comments/b4ljik/hello_just_looking_to_get_some_suggestions_from/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "hello! just looking to get some suggestions from sony users on how they manage, backup and -----> archive !!!  arws and jpegs. i'm just having issues with organization and archiving and thought the community might be able to help! 😀", "sortedWord": "None", "identifyer": 9616, "year": "2019"}, {"Unnamed: 0": 10353, "autor": "vlemieux", "date": 1564601029000, "content": "How to archive that look ? (right side) I buy a cheap amazon studio lights setup but I thing I need more powerfull light. I think my result is a little bit too much flat.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ckd3na/how_to_archive_that_look_right_side_i_buy_a_cheap/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how to -----> archive !!!  that look ? (right side) i buy a cheap amazon studio lights setup but i thing i need more powerfull light. i think my result is a little bit too much flat.", "sortedWord": "None", "identifyer": 10491, "year": "2019"}], "name": "archiveSonyAlpha2019"}