{"interestingcomments": [{"autor": "ViaJCE", "date": "2019-03-16 18:57:30", "content": "Created My Own Version of a Wristband Camera Leash (Sony A7III)", "link": "https://www.reddit.com/r/SonyAlpha/comments/b1vvk3/created_my_own_version_of_a_wristband_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  my own version of a wristband camera leash (sony a7iii)", "sortedWord": "None", "Identifyer": null, "identifyer": 6546, "year": "2019"}, {"autor": "brennan135", "date": "2019-07-21 22:53:20", "content": "GREECE 2019 | Sony A6500 /!/ LINK: [https://youtu.be/a7p6PhaFM9g](https://youtu.be/a7p6PhaFM9g)\n\nThis is one of the longer videos I've ever shot, edited and produced. I'm very much a beginner but would love to show you guys the work I've done. I'm very proud of it regardless!\n\nIt's 7 minutes long, filled with commentary and music. I tried to create more of a storyline, something that gets your feelings going instead of your typical EDM style travel vlog.\n\nHope you enjoy!", "link": "https://www.reddit.com/r/SonyAlpha/comments/cg59u7/greece_2019_sony_a6500/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i tried to create", "selectorShort": "create", "MarkedSent": "greece 2019 | sony a6500 /!/ link: [https://youtu.be/a7p6phafm9g](https://youtu.be/a7p6phafm9g)\n\nthis is one of the longer videos i've ever shot, edited and produced. i'm very much a beginner but would love to show you guys the work i've done. i'm very proud of it regardless!\n\nit's 7 minutes long, filled with commentary and music. -----> i !!!  -----> tried !!!  -----> to !!!  -----> create !!!  more of a storyline, something that gets your feelings going instead of your typical edm style travel vlog.\n\nhope you enjoy!", "sortedWord": "None", "Identifyer": null, "identifyer": 9830, "year": "2019"}, {"autor": "theonlyandreib", "date": "2019-04-01 20:35:58", "content": "Life Changing Decision! /!/ About 5 months ago, I decided to begin venturing for fun into something I’ve always wanted to do and that is videography and Photography. Decided to buy my first camera, a Sony A7iii, and the rest is history.\n\nYesterday as we were going over some footage that me and my friend shot for our brand, he showed me a friend of his that did a 100-day coding challenge. Looking over at how it impacted his life, I thought to myself, I need to do this too. \n\nTherefore, with no hesitation I’ve decided to start today. \n\nSo far, a lot of my work has been photography, but I want to expand and also become better at video. Therefore, this first 100-day challenge will be more focused towards improving my abilities with Adobe Premiere, Aftereffects and filming but will not be limited and also include photography.\n\nEveryday I will tackle a different part of the editing process and share with you guys. If it’s getting better with a tool, or achieving a certain effect, that is what I will base my days around. If I got a certain image in head, I will try to achieve it, or if It’s a problem to fix I will fix it. \n\n&amp;#x200B;\n\n**Rules of 100 Day Challenge.** \n\n**1.** **4-6 Hours minimum editing per day.** \n\n**2.** **Release video every 2 weeks** \n\n**3.** **Posts for IG &amp; Reddit every 3 days describing process.**  \n\n**5.** **Revision Notes at the end of each 10 days.** \n\n&amp;#x200B;\n\n**How?** \n\n\\- **Daily Journaling** \n\n\\- **Organize Days between** \n\n\\- **Hardwork/Dumbwork/Hardwork + Break**\n\n\\- **Hardwork -&gt; Actual Editing and Studying**\n\n\\- **Dumbwork -&gt; Emails,Calls &amp; Shooting.** \n\n\\- **Break – Working out or reading**\n\n&amp;#x200B;\n\n**Example of Day** \n\n\\- **4:30AM – 5:00 -&gt; Stretch, Clean Room.**\n\n\\- **5:00 – 10:00 -&gt; Hardwork Editing**\n\n\\- **10:00-11:00 -&gt; Eat &amp; Shower**\n\n\\- **11:00 – 12:00 -&gt; Send Emails,Call Business.**\n\n\\- **12:00-1:00 -&gt; Meeting** \n\n\\- **1:00-6:00 -&gt; Shoot**\n\n\\- **6 -9:00 -&gt; Hard work Editing**\n\n\\- **9:00-10:00 Journaling Prepare Next Day**\n\n&amp;#x200B;\n\nIn order to improve my abilities, I will be consulting a lot of online sources, such as YouTube, Skill Share, Udemy, etc. In addition, to also collaborating with established editors, effect specialists, business owners, and more. \n\nMy Goal at the end of this 100 Day Progress, is to become a strong consideration in my own local market when it comes to building strong and effective digital media, but also finally be able to launch my own platform, that will build towards a long career. \n\nI've taken a lot of motivation and inspiration from various posts on this sub-reddit, and I would love for this to be a movement we can create. I believe if this challenge is executed with discipline many of us can aspire to have the careers with the results we've always wanted to. \n\n&amp;#x200B;\n\n**TL;DR : Starting 100 Day challenge with primary focus on video but also photography, and wanted to share this so this can become a movement.**\n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/SonyAlpha/comments/b88jlh/life_changing_decision/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "we can create", "selectorShort": "create", "MarkedSent": "life changing decision! /!/ about 5 months ago, i decided to begin venturing for fun into something i’ve always wanted to do and that is videography and photography. decided to buy my first camera, a sony a7iii, and the rest is history.\n\nyesterday as we were going over some footage that me and my friend shot for our brand, he showed me a friend of his that did a 100-day coding challenge. looking over at how it impacted his life, i thought to myself, i need to do this too. \n\ntherefore, with no hesitation i’ve decided to start today. \n\nso far, a lot of my work has been photography, but i want to expand and also become better at video. therefore, this first 100-day challenge will be more focused towards improving my abilities with adobe premiere, aftereffects and filming but will not be limited and also include photography.\n\neveryday i will tackle a different part of the editing process and share with you guys. if it’s getting better with a tool, or achieving a certain effect, that is what i will base my days around. if i got a certain image in head, i will try to achieve it, or if it’s a problem to fix i will fix it. \n\n&amp;#x200b;\n\n**rules of 100 day challenge.** \n\n**1.** **4-6 hours minimum editing per day.** \n\n**2.** **release video every 2 weeks** \n\n**3.** **posts for ig &amp; reddit every 3 days describing process.**  \n\n**5.** **revision notes at the end of each 10 days.** \n\n&amp;#x200b;\n\n**how?** \n\n\\- **daily journaling** \n\n\\- **organize days between** \n\n\\- **hardwork/dumbwork/hardwork + break**\n\n\\- **hardwork -&gt; actual editing and studying**\n\n\\- **dumbwork -&gt; emails,calls &amp; shooting.** \n\n\\- **break – working out or reading**\n\n&amp;#x200b;\n\n**example of day** \n\n\\- **4:30am – 5:00 -&gt; stretch, clean room.**\n\n\\- **5:00 – 10:00 -&gt; hardwork editing**\n\n\\- **10:00-11:00 -&gt; eat &amp; shower**\n\n\\- **11:00 – 12:00 -&gt; send emails,call business.**\n\n\\- **12:00-1:00 -&gt; meeting** \n\n\\- **1:00-6:00 -&gt; shoot**\n\n\\- **6 -9:00 -&gt; hard work editing**\n\n\\- **9:00-10:00 journaling prepare next day**\n\n&amp;#x200b;\n\nin order to improve my abilities, i will be consulting a lot of online sources, such as youtube, skill share, udemy, etc. in addition, to also collaborating with established editors, effect specialists, business owners, and more. \n\nmy goal at the end of this 100 day progress, is to become a strong consideration in my own local market when it comes to building strong and effective digital media, but also finally be able to launch my own platform, that will build towards a long career. \n\ni've taken a lot of motivation and inspiration from various posts on this sub-reddit, and i would love for this to be a movement -----> we !!!  -----> can !!!  -----> create !!! . i believe if this challenge is executed with discipline many of us can aspire to have the careers with the results we've always wanted to. \n\n&amp;#x200b;\n\n**tl;dr : starting 100 day challenge with primary focus on video but also photography, and wanted to share this so this can become a movement.**\n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 12182, "year": "2019"}, {"autor": "artist_jimmy", "date": "2019-08-17 07:03:37", "content": "A7R III + Tamron 28-75 2.8. Mission Beach, San Diego. /!/ Hello,\n\nthis is actually my first day with My A7R III and Tamron 28-75. Very impressed by the lens. Definitely not just a budget lens...\n\n&amp;#x200B;\n\nThis is also my first day and first post on Reddit. I'll try to create something worth sharing here!", "link": "https://www.reddit.com/r/SonyAlpha/comments/criwdg/a7r_iii_tamron_2875_28_mission_beach_san_diego/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i'll try to create", "selectorShort": "create", "MarkedSent": "a7r iii + tamron 28-75 2.8. mission beach, san diego. /!/ hello,\n\nthis is actually my first day with my a7r iii and tamron 28-75. very impressed by the lens. definitely not just a budget lens...\n\n&amp;#x200b;\n\nthis is also my first day and first post on reddit. -----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> create !!!  something worth sharing here!", "sortedWord": "None", "Identifyer": null, "identifyer": 13515, "year": "2019"}, {"autor": "Simos805", "date": "2019-01-04 02:02:45", "content": "I need a favor please... /!/ Hi, I need a favor from anyone who lives in US!!!\n\nLet me explain... \nI live in Greece and I have an a7rii. I wanted to buy the Time Lapse app from the PlayMemories Store on my camera but the first time I tried with my Greek Sony account it just won’t logged me in because “those features aren’t available in my country” (damn sony...)\nSo, I created a US Sony account (with difficulties because my ISP won’t let me visit sony network after that, I don’t know why and the only way to visit the US Sony account is from my iPhone using cellular). So then, I connected this account to my camera (using hotspot from my iPhone to let the camera connect to the US servers because the ISP won’t let me connect as I said) and all seemed to be working.\nBut then, when I tried to add my credit card to this sony account it didn’t accept it because it is a Greek credit card... So, I tried to add PayPal but again it refuses even to accept my PayPal account because it’s a Greek PayPal account... \n\nSo... anyone of you reading this and live in the US and have a US paypal account I really really begging you, if you want to help me and do this for me:\nI’ll give you my Sony US account email and password, so you will sign in and add your paypal account to it (I can’t see your paypal information from my sony account even if I wanted to), so then I will go to my camera, I will buy the $9.99 Time Lapse app,  then you will remove your PayPal account from my Sony account and you will tell me your PayPal username or email to send you back the $10 directly from my PayPal!\n\nPlease... I will be very thankful to anyone help me with this mess.... I really want this Time Lapse app and the only alternative to the app is to buy an expensive remote control for my camera to let me set the camera capture multiple pictures one by one for hours to create beautiful TimeLapse videos! \nPlease!!🥺🥺", "link": "https://www.reddit.com/r/SonyAlpha/comments/acd5ul/i_need_a_favor_please/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i need a favor please... /!/ hi, i need a favor from anyone who lives in us!!!\n\nlet me explain... \ni live in greece and i have an a7rii. i wanted to buy the time lapse app from the playmemories store on my camera but the first time i tried with my greek sony account it just won’t logged me in because “those features aren’t available in my country” (damn sony...)\nso, -----> i !!!  -----> created !!!  a us sony account (with difficulties because my isp won’t let me visit sony network after that, -----> i !!!  don’t know why and the only way to visit the us sony account is from my iphone using cellular). so then, i connected this account to my camera (using hotspot from my iphone to let the camera connect to the us servers because the isp won’t let me connect as i said) and all seemed to be working.\nbut then, when i tried to add my credit card to this sony account it didn’t accept it because it is a greek credit card... so, i tried to add paypal but again it refuses even to accept my paypal account because it’s a greek paypal account... \n\nso... anyone of you reading this and live in the us and have a us paypal account i really really begging you, if you want to help me and do this for me:\ni’ll give you my sony us account email and password, so you will sign in and add your paypal account to it (i can’t see your paypal information from my sony account even if i wanted to), so then i will go to my camera, i will buy the $9.99 time lapse app,  then you will remove your paypal account from my sony account and you will tell me your paypal username or email to send you back the $10 directly from my paypal!\n\nplease... i will be very thankful to anyone help me with this mess.... i really want this time lapse app and the only alternative to the app is to buy an expensive remote control for my camera to let me set the camera capture multiple pictures one by one for hours to create beautiful timelapse videos! \nplease!!🥺🥺", "sortedWord": "None", "Identifyer": null, "identifyer": 13752, "year": "2019"}, {"autor": "Aerics", "date": "2019-08-20 11:53:32", "content": "New purchasing /!/ Hello, everybody.\n\nI am a hobby photographer and it is important to bring high quality pictures from my holiday home. Outside of my holidays I rarely take pictures on trips. The majority of my pictures consist of landscape and city photos, as well as portraits of my wife.\n\nI started with a Canon EOS 400 with a Tamron. Due to bacteria and the fact that I never changed the lens I came to my current Panasonic LX100. I liked the small construction very much. Over the years I notice that the resolution is not enough for me. You don't have any crop possibilities and there is always a lack of zoom. Since I like to create portraits of my wife, I also wish a little more dof. From the lowlight performance I also wish for a little more. A today's Google Pixel creates partly low-noise pictures. In addition, there is now some dust inside and cleaning is not possible.\n\nNow I would like to buy a new camera. I am now looking for a solution with which I hope to make a qualitative jump. Since I do not like to exchange lenses, there should be a very good all-rounder. I don't want to have a compact camera anymore, because you have to throw everything away after a few years.\n\nThe question that I ask myself now is if I would buy an A6400/6500, for example. Would there be a lens to recommend and would the difference to my LX100 be noticeable? At the moment I also have an eye on the A7III with the Tamron 28-70. Of course this solution is much bigger and more expensive, but I hope for a big jump here. But I'm a little afraid of the size, so maybe you won't always take the camera with you. Also I am not always sure when looking at pictures here. There are pictures of people there you can see every skin pore, but also again pictures that look average what my LX100 also performs. Also many night shots are blurred and partly not nice to look at. But here I assume that these were taken out of hand and are not due to the camera. What also strikes me is that you always see a lot of noise in the pictures. I don't have that at the moment.\n\nSummary:\n\nWould an A6400/6500 with only one lens be an improvement on my LX100? Or would the purchase be a waste of money?\n\nDoes it have to be an A7III? \n\nMy last solution would be to put it completely on a mobile phone, e.g. Google Pixel 4. I would go back a few steps, I would miss Zoom etc. but for that I would have a device which I always have with me and no additional costs.\n\nI just don't know if I should just take 3k€ in my hand, if there is an interim solution, or if I should hang up my hobby.", "link": "https://www.reddit.com/r/SonyAlpha/comments/csxg09/new_purchasing/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i like to create", "selectorShort": "create", "MarkedSent": "new purchasing /!/ hello, everybody.\n\ni am a hobby photographer and it is important to bring high quality pictures from my holiday home. outside of my holidays i rarely take pictures on trips. the majority of my pictures consist of landscape and city photos, as well as portraits of my wife.\n\ni started with a canon eos 400 with a tamron. due to bacteria and the fact that i never changed the lens i came to my current panasonic lx100. i liked the small construction very much. over the years i notice that the resolution is not enough for me. you don't have any crop possibilities and there is always a lack of zoom. since -----> i !!!  -----> like !!!  -----> to !!!  -----> create !!!  portraits of my wife, -----> i !!!  also wish a little more dof. from the lowlight performance i also wish for a little more. a today's google pixel creates partly low-noise pictures. in addition, there is now some dust inside and cleaning is not possible.\n\nnow i would like to buy a new camera. i am now looking for a solution with which i hope to make a qualitative jump. since i do not like to exchange lenses, there should be a very good all-rounder. i don't want to have a compact camera anymore, because you have to throw everything away after a few years.\n\nthe question that i ask myself now is if i would buy an a6400/6500, for example. would there be a lens to recommend and would the difference to my lx100 be noticeable? at the moment i also have an eye on the a7iii with the tamron 28-70. of course this solution is much bigger and more expensive, but i hope for a big jump here. but i'm a little afraid of the size, so maybe you won't always take the camera with you. also i am not always sure when looking at pictures here. there are pictures of people there you can see every skin pore, but also again pictures that look average what my lx100 also performs. also many night shots are blurred and partly not nice to look at. but here i assume that these were taken out of hand and are not due to the camera. what also strikes me is that you always see a lot of noise in the pictures. i don't have that at the moment.\n\nsummary:\n\nwould an a6400/6500 with only one lens be an improvement on my lx100? or would the purchase be a waste of money?\n\ndoes it have to be an a7iii? \n\nmy last solution would be to put it completely on a mobile phone, e.g. google pixel 4. i would go back a few steps, i would miss zoom etc. but for that i would have a device which i always have with me and no additional costs.\n\ni just don't know if i should just take 3k€ in my hand, if there is an interim solution, or if i should hang up my hobby.", "sortedWord": "None", "Identifyer": null, "identifyer": 13852, "year": "2019"}, {"autor": "jtxhd", "date": "2019-06-04 15:51:43", "content": "Help with resetting the photo folders/directory on my a6000 without deleting my photos! /!/ https://i.imgur.com/DIkVTq8.jpg\n\nSo I’m not sure how to do this, but I know i’m in the right place in Settings. I managed to create too many new photo folders. When I plug my SD card into my Mac my a6000’s photo folders are labeled 100MSDCF thru 109MSDCF and some folders don’t even have photos in them.\n\nCan I get rid of all these folders, change my folder setup to date format and have the photos sorted into those folders?\n\nIf not, I‘m guessing my only option is to copy all my SD card photos to my Mac, format the SD, then start over with the date format selected, correct?\n\nThanks.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bwqag2/help_with_resetting_the_photo_foldersdirectory_on/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i managed to create", "selectorShort": "create", "MarkedSent": "help with resetting the photo folders/directory on my a6000 without deleting my photos! /!/ https://i.imgur.com/dikvtq8.jpg\n\nso i’m not sure how to do this, but i know i’m in the right place in settings. -----> i !!!  -----> managed !!!  -----> to !!!  -----> create !!!  too many new photo folders. when i plug my sd card into my mac my a6000’s photo folders are labeled 100msdcf thru 109msdcf and some folders don’t even have photos in them.\n\ncan i get rid of all these folders, change my folder setup to date format and have the photos sorted into those folders?\n\nif not, i‘m guessing my only option is to copy all my sd card photos to my mac, format the sd, then start over with the date format selected, correct?\n\nthanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 18622, "year": "2019"}, {"autor": "Dann-Oh", "date": "2019-03-06 17:33:38", "content": "Camera Settings / Workflow question for A7iii /!/ Hey All,\n\n&amp;#x200B;\n\nThe Plan:\n\nI am planning for a trip this weekend to the desert (aka Dark Sky Site). I am planning to do capture 3 different kinds of photography; Landscape/Rock Climbing,  Astro,  and LandscapeAstro photography. My astrophotography subject is both  the Orion and Flame Nebula in the same frame. My LandscapeAstro target is a nice star trail image with a Joshua Tree decently lit in the foreground. My Landscape/Rock Climbing subjects are going to be of our group out bouldering and and just the natural beauty of Joshua Tree National Park.\n\n&amp;#x200B;\n\nThe Dilemma:\n\nIs there a way I can set up folders on the A7iii so when I start taking photos of a new project it automatically loads the photos into a new folder?  If I cant do it automatically can I create new folders manually?  My back up solution is to dump each memory card onto an external hard drive before each subject is photographed. i have a few spare memory cards so i wont have any down time.\n\n&amp;#x200B;\n\nI hope I have explained my dilemma well enough that someone has a workable solution.  Thanks in advanced.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/SonyAlpha/comments/ay1gcy/camera_settings_workflow_question_for_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "camera settings / workflow question for a7iii /!/ hey all,\n\n&amp;#x200b;\n\nthe plan:\n\ni am planning for a trip this weekend to the desert (aka dark sky site). i am planning to do capture 3 different kinds of photography; landscape/rock climbing,  astro,  and landscapeastro photography. my astrophotography subject is both  the orion and flame nebula in the same frame. my landscapeastro target is a nice star trail image with a joshua tree decently lit in the foreground. my landscape/rock climbing subjects are going to be of our group out bouldering and and just the natural beauty of joshua tree national park.\n\n&amp;#x200b;\n\nthe dilemma:\n\nis there a way i can set up folders on the a7iii so when i start taking photos of a new project it automatically loads the photos into a new folder?  if -----> i !!!  cant do it automatically can -----> i !!!  -----> create !!!  new folders manually?  my back up solution is to dump each memory card onto an external hard drive before each subject is photographed. i have a few spare memory cards so i wont have any down time.\n\n&amp;#x200b;\n\ni hope i have explained my dilemma well enough that someone has a workable solution.  thanks in advanced.\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 19277, "year": "2019"}, {"autor": "HeatCheckStefan", "date": "2019-10-11 00:52:18", "content": "a6400 users: Can you help me out with a very specific question? /!/ I recently created an overhead rig for my rx100 V. I planned on just leaving it up with all the settings dialed in, and when I need it- just turn on and start recording. A 1 touch operation.\nThing is: Memory recall saves everything EXCEPT focus for some reason. So every time I turn it on, the manual focus is reset, so I spend time to punch in, set the focus, punch out and THEN start.\nAs a more feature packed camera I am hoping that the a6400 does not have this issue. \nAs this is quite a niche thing I couldn't find the answer on google, so I turn to you guys for help:\n**Can the a6400 save the manual focus setting in memory recall?**", "link": "https://www.reddit.com/r/SonyAlpha/comments/dg7hhs/a6400_users_can_you_help_me_out_with_a_very/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i recently created", "selectorShort": "create", "MarkedSent": "a6400 users: can you help me out with a very specific question? /!/ -----> i !!!  -----> recently !!!  -----> created !!!  an overhead rig for my rx100 v. -----> i !!!  planned on just leaving it up with all the settings dialed in, and when -----> i !!!  need it- just turn on and start recording. a 1 touch operation.\nthing is: memory recall saves everything except focus for some reason. so every time i turn it on, the manual focus is reset, so i spend time to punch in, set the focus, punch out and then start.\nas a more feature packed camera i am hoping that the a6400 does not have this issue. \nas this is quite a niche thing i couldn't find the answer on google, so i turn to you guys for help:\n**can the a6400 save the manual focus setting in memory recall?**", "sortedWord": "None", "Identifyer": null, "identifyer": 21692, "year": "2019"}], "name": "createSonyAlpha2019"}