{"interestingcomments": [{"autor": "actuallypittsburgh", "date": "2018-03-13 16:21:16", "content": "A7III Preorder Shipping Time Estimates (USA) /!/ I know there is an earlier post discussing shipping time estimates for the A7III from different online retailers. I am creating a post with updates about the information I was able to gather.  \n  \n**AMAZON**: I used Amazon live chat to speak with a sales representative. They said, due to high number of preorders, they can only guarantee free 5-8 business days shipping time (even with Prime membership.) Prime members who've already preordered have the highest likelihood of getting closer to 1-2 days Prime shipping time.  \n  \n**B&amp;H**: They can guarantee 1-3 business days expedited shipping based on your location in the USA. Map is available here: https://www.bhphotovideo.com/images/freeShipMap_3.png  \n  \n**ADORAMA**: They offer free overnight shipping to the lower contiguous 48 states. Shipping details are available via their [A7III preorder page](https://www.adorama.com/isoa7m3.html)  \n  \n**BEST BUY**: Depending on your location and date of preorder, will have [A7III available for in-store pickup](https://www.bestbuy.com/site/sony-alpha-a7-iii-mirrorless-camera-body-only/6213101.p?skuId=6213101) on release day  \n  \n**SAMY'S CAMERA**: Guaranteed [3-day shipping](https://www.samys.com/p/US-Only-Shipping/ILCE-7M3/Alpha-a7-III-Mirrorless-Digital-Camera-Body/201197.html)  \n  \n**BEDFORD**: Free [overnight shipping](https://www.bedfords.com/ilce-7m3)", "link": "https://www.reddit.com/r/SonyAlpha/comments/845f9d/a7iii_preorder_shipping_time_estimates_usa/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "a7iii preorder shipping time estimates (usa) /!/ i know there is an earlier post discussing shipping time estimates for the a7iii from different online retailers. -----> i !!!  -----> am !!!  -----> creating !!!  a post with updates about the information -----> i !!!  was able to gather.  \n  \n**amazon**: i used amazon live chat to speak with a sales representative. they said, due to high number of preorders, they can only guarantee free 5-8 business days shipping time (even with prime membership.) prime members who've already preordered have the highest likelihood of getting closer to 1-2 days prime shipping time.  \n  \n**b&amp;h**: they can guarantee 1-3 business days expedited shipping based on your location in the usa. map is available here: https://www.bhphotovideo.com/images/freeshipmap_3.png  \n  \n**adorama**: they offer free overnight shipping to the lower contiguous 48 states. shipping details are available via their [a7iii preorder page](https://www.adorama.com/isoa7m3.html)  \n  \n**best buy**: depending on your location and date of preorder, will have [a7iii available for in-store pickup](https://www.bestbuy.com/site/sony-alpha-a7-iii-mirrorless-camera-body-only/6213101.p?skuid=6213101) on release day  \n  \n**samy's camera**: guaranteed [3-day shipping](https://www.samys.com/p/us-only-shipping/ilce-7m3/alpha-a7-iii-mirrorless-digital-camera-body/201197.html)  \n  \n**bedford**: free [overnight shipping](https://www.bedfords.com/ilce-7m3)", "sortedWord": "None", "Identifyer": null, "identifyer": 29251, "year": "2018"}, {"autor": "djdadi", "date": "2018-03-15 01:06:11", "content": "I created Camera Profiles for the A7R3 for Lightroom and Capture One /!/ I'm very colorblind, so I hate correcting for color.  So, I bought an X-Rite Color Checker.  I made profile for a few situations for the a7r3 for both Adobe and for Capture one **however** most pictures using the Capture One profiles don't look right to me - so don't get your hopes up Capture One users :)\n\nThe Skin profile is one I found for the a7r2 made by another user, the rest were calculated using the Color Checker.\n\n[Download](https://drive.google.com/file/d/12g0BLG8x7KsOJ80wxBg9-v8-3WHvvyH2/view?usp=sharing)", "link": "https://www.reddit.com/r/SonyAlpha/comments/84indp/i_created_camera_profiles_for_the_a7r3_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  camera profiles for the a7r3 for lightroom and capture one /!/ i'm very colorblind, so i hate correcting for color.  so, i bought an x-rite color checker.  i made profile for a few situations for the a7r3 for both adobe and for capture one **however** most pictures using the capture one profiles don't look right to me - so don't get your hopes up capture one users :)\n\nthe skin profile is one i found for the a7r2 made by another user, the rest were calculated using the color checker.\n\n[download](https://drive.google.com/file/d/12g0blg8x7ksoj80wxbg9-v8-3whvvyh2/view?usp=sharing)", "sortedWord": "None", "Identifyer": null, "identifyer": 36969, "year": "2018"}, {"autor": "jefflan", "date": "2018-11-12 19:07:55", "content": "I created the whole Visual identity of a Coffee shop using my Sony a6300", "link": "https://www.reddit.com/r/SonyAlpha/comments/9wgz3b/i_created_the_whole_visual_identity_of_a_coffee/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  the whole visual identity of a coffee shop using my sony a6300", "sortedWord": "None", "Identifyer": null, "identifyer": 37468, "year": "2018"}, {"autor": "Mun-Mun", "date": "2018-10-07 12:49:19", "content": "I created a bokeh wall.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9m4sgs/i_created_a_bokeh_wall/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a bokeh wall.", "sortedWord": "None", "Identifyer": null, "identifyer": 37566, "year": "2018"}, {"autor": "Mosheridze", "date": "2018-11-30 06:02:12", "content": "Created 3D Printed Grip for Sony a7iii / a7riii / a9 What do you think? *Gear*", "link": "https://www.reddit.com/r/SonyAlpha/comments/a1psdy/created_3d_printed_grip_for_sony_a7iii_a7riii_a9/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  3d printed grip for sony a7iii / a7riii / a9 what do you think? *gear*", "sortedWord": "None", "Identifyer": null, "identifyer": 37938, "year": "2018"}, {"autor": "dilyz", "date": "2018-04-09 12:12:28", "content": "Help with Aperture /!/ So I'm new to using a camera and want to record a video. The scene I wish to create starts with the camera still, with books in the foreground at the bottom left and a desk at the background with a person about to sit down and work on it. I want the camera to focus on the books while the background remains blurred then shift to the books being blurred and the person walking to the desk and sitting on it.\n\nHow do I do this? The camera I use is a Sony a6000. If possible, what settings do I shoots this on if I want it to be bright.\n\n\nAnother question, how do I make a kinda dark room darker when I video?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8axxse/help_with_aperture/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i wish to create", "selectorShort": "create", "MarkedSent": "help with aperture /!/ so i'm new to using a camera and want to record a video. the scene -----> i !!!  -----> wish !!!  -----> to !!!  -----> create !!!  starts with the camera still, with books in the foreground at the bottom left and a desk at the background with a person about -----> to !!!  sit down and work on it. i want the camera to focus on the books while the background remains blurred then shift to the books being blurred and the person walking to the desk and sitting on it.\n\nhow do i do this? the camera i use is a sony a6000. if possible, what settings do i shoots this on if i want it to be bright.\n\n\nanother question, how do i make a kinda dark room darker when i video?", "sortedWord": "None", "Identifyer": null, "identifyer": 41503, "year": "2018"}, {"autor": "emiliotakas", "date": "2018-11-28 01:06:40", "content": "I have created 3 Cinematic Luts and I'm giving them for FREE. /!/ Hello wonderful people of Sony Alpha subreddit. I created 3 cinematic luts and Im giving them for FREE. The luts work best with Sony Cine Profiles. Of course you can play around with the exposure to get the look that you want, but overall these luts can help you achieve an easy cinematic look in your videos. Link for the video to see the luts and to download them: [https://youtu.be/yculdx9I8EI](https://youtu.be/yculdx9I8EI)\n\nhttps://i.redd.it/ril94sth1z021.jpg", "link": "https://www.reddit.com/r/SonyAlpha/comments/a115xb/i_have_created_3_cinematic_luts_and_im_giving/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> have !!!  -----> created !!!  3 cinematic luts and -----> i !!! 'm giving them for free. /!/ hello wonderful people of sony alpha subreddit. i created 3 cinematic luts and im giving them for free. the luts work best with sony cine profiles. of course you can play around with the exposure to get the look that you want, but overall these luts can help you achieve an easy cinematic look in your videos. link for the video to see the luts and to download them: [https://youtu.be/yculdx9i8ei](https://youtu.be/yculdx9i8ei)\n\nhttps://i.redd.it/ril94sth1z021.jpg", "sortedWord": "None", "Identifyer": null, "identifyer": 42302, "year": "2018"}, {"autor": "NomiaMedia", "date": "2018-12-04 04:36:34", "content": "Hidden Files On A7iii Memory Card? /!/ Hey all!\n\n&amp;#x200B;\n\nI've searched everywhere for answers with no success so I'm trying here. I shot a music festival on the weekend and towards the end my card was getting full so after a dump to the editor, I deleted a few clips and decided to play with the folder feature on my A7III. I created a new folder, assuming all the clips would go into that folder. I can view all the clips on the camera, but the second I connect the memory card or camera to the computer I am unable to find them!\n\n&amp;#x200B;\n\nI can see a new folder under DCIM &gt; 101MSDCF, but there is no new folder under PRIVATE, or anywhere else containing video clips. I have tried WiFi connection and every other way possible and am unable to find the clips besides on the camera itself.\n\n&amp;#x200B;\n\nI am DYING out here, just want to format card after I dump the rest of the clips. Anyone?! Anything?!\n\n&amp;#x200B;\n\nCheers.", "link": "https://www.reddit.com/r/SonyAlpha/comments/a2x7n8/hidden_files_on_a7iii_memory_card/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hidden files on a7iii memory card? /!/ hey all!\n\n&amp;#x200b;\n\ni've searched everywhere for answers with no success so i'm trying here. i shot a music festival on the weekend and towards the end my card was getting full so after a dump to the editor, i deleted a few clips and decided to play with the folder feature on my a7iii. -----> i !!!  -----> created !!!  a new folder, assuming all the clips would go into that folder. i can view all the clips on the camera, but the second i connect the memory card or camera to the computer i am unable to find them!\n\n&amp;#x200b;\n\ni can see a new folder under dcim &gt; 101msdcf, but there is no new folder under private, or anywhere else containing video clips. i have tried wifi connection and every other way possible and am unable to find the clips besides on the camera itself.\n\n&amp;#x200b;\n\ni am dying out here, just want to format card after i dump the rest of the clips. anyone?! anything?!\n\n&amp;#x200b;\n\ncheers.", "sortedWord": "None", "Identifyer": null, "identifyer": 42441, "year": "2018"}], "name": "createSonyAlpha2018"}