{"interestingcomments": [{"autor": "Damneddesigns", "date": "2019-10-20 07:32:06", "content": "Touit 50 2.8 macro vs Sigma 56 1.4 on a6500 /!/  \n\nI have the A6500 and the Sigma 56 1.4. It's my favorite lens and is always on my camera. The 18-105 and Sigma 30 are rarely in use.\n\nWhile portrait is my preferred style of photography, I also do the occasional street photography. I need a Portrait lens to shoot products that I design and here are my options\n\n1. Sony 30mm macro. Costs about $300 but means I will need to carry this with my Sigma.\n\n2. Zeiss Touit 50 2.8. While at 2.8 this is slower than my Sigma, I'm wondering if anyone has used both for Portrait or regular non macro work?\n\nI'm keen on owning just one primary lens and i'd rather get rid of the Sigma to fund the Zeiss at $999.\n\nI've heard some things about bad autofocus on the Zeiss but the sigma struggles in low light too so i'm trying to determine just how much of a difference is there.\n\nThanks in Advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/dkgida/touit_50_28_macro_vs_sigma_56_14_on_a6500/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "touit 50 2.8 macro vs sigma 56 1.4 on a6500 /!/  \n\ni have the a6500 and the sigma 56 1.4. it's my favorite lens and is always on my camera. the 18-105 and sigma 30 are rarely in use.\n\nwhile portrait is my preferred style of photography, i also do the occasional street photography. -----> i !!!  need a portrait lens to shoot products that -----> i !!!  -----> design !!!  and here are my options\n\n1. sony 30mm macro. costs about $300 but means i will need to carry this with my sigma.\n\n2. zeiss touit 50 2.8. while at 2.8 this is slower than my sigma, i'm wondering if anyone has used both for portrait or regular non macro work?\n\ni'm keen on owning just one primary lens and i'd rather get rid of the sigma to fund the zeiss at $999.\n\ni've heard some things about bad autofocus on the zeiss but the sigma struggles in low light too so i'm trying to determine just how much of a difference is there.\n\nthanks in advance!", "sortedWord": "None", "Identifyer": null, "identifyer": 10862, "year": "2019"}, {"autor": "Havel_88", "date": "2019-03-02 15:40:29", "content": "I design your online gallery for free :) /!/ Hello, I have come to offer you my services to design a web based on wordpress. I'm not kidding, I'll work for free. You will be asking if I am crazy, but if you contact me I will explain it to you in detail.\n\nIn a normal scenario, you have to pay hosting, domain and designer. But if you buy hosting and domain with a company of my choice (very good prices, about 3.50$/hosting and free domain), the company will pay me for designing a web for you :)\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/awix12/i_design_your_online_gallery_for_free/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "-----> i !!!  -----> design !!!  your online gallery for free :) /!/ hello, i have come to offer you my services to design a web based on wordpress. i'm not kidding, i'll work for free. you will be asking if i am crazy, but if you contact me i will explain it to you in detail.\n\nin a normal scenario, you have to pay hosting, domain and designer. but if you buy hosting and domain with a company of my choice (very good prices, about 3.50$/hosting and free domain), the company will pay me for designing a web for you :)\n", "sortedWord": "None", "Identifyer": null, "identifyer": 13257, "year": "2019"}], "name": "designSonyAlpha2019"}