{"interestingcomments": [{"autor": "driftmark", "date": "2018-09-11 22:34:20", "content": "Concept photography/fantasy photography recommendations? /!/ I'm experimenting with my first concept/fantasy shoot this weekend and it's been hard finding people to talk to or resources where I can see the process behind similar work. The only fantasy photographer I know who's shared behind-the-scenes footage is Bella Kotak (whose work I love), and I remember at one point seeing a BTS video of one of Annie Leibovitz's Disney portraits, but that's about it. Anyone have any experience with concept or fantasy photography and want to discuss their process or offer recommendations for photographers/resources to look into? The only other photographer that comes to mind is Paolo Roversi, so throw some names at me! I'm also interested in how photographers tackle set design or art direction in a fantasy shoot, because I'm DIYing everything and a) it's hard and b) it's expensive!", "link": "https://www.reddit.com/r/photography/comments/9f22rh/concept_photographyfantasy_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i'm diying", "selectorShort": "diye", "MarkedSent": "concept photography/fantasy photography recommendations? /!/ i'm experimenting with my first concept/fantasy shoot this weekend and it's been hard finding people to talk to or resources where i can see the process behind similar work. the only fantasy photographer i know who's shared behind-the-scenes footage is bella kotak (whose work i love), and i remember at one point seeing a bts video of one of annie leibovitz's disney portraits, but that's about it. anyone have any experience with concept or fantasy photography and want to discuss their process or offer recommendations for photographers/resources to look into? the only other photographer that comes to mind is paolo roversi, so throw some names at me! -----> i !!! 'm also interested in how photographers tackle set design or art direction in a fantasy shoot, because -----> i !!! 'm -----> diying !!!  everything and a) it's hard and b) it's expensive!", "sortedWord": "None", "Identifyer": null, "identifyer": 11503, "year": "2018"}], "name": "diyeSonyAlpha2020"}