{"interestingcomments": [{"autor": "_rosebud01", "date": "2018-10-05 18:22:04", "content": "DIY Sony a6300 External Power Solution /!/ Might be a little late to ask this. I have a wedding to shoot tomorrow and just now had this idea. \n\nI have 4 batteries and wall chargers and can surely make them work for the wedding, but was wondering if there’s any DIY external power solutions I can make with items from Walmart to help Sony’s battery last longer and prevent overheating (mainly just last longer). Preferably something I wouldn’t have to buy online. \n\nAny ideas??", "link": "https://www.reddit.com/r/SonyAlpha/comments/9lotx5/diy_sony_a6300_external_power_solution/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  sony a6300 external power solution /!/ might be a little late to ask this. i have a wedding to shoot tomorrow and just now had this idea. \n\ni have 4 batteries and wall chargers and can surely make them work for the wedding, but was wondering if there’s any diy external power solutions i can make with items from walmart to help sony’s battery last longer and prevent overheating (mainly just last longer). preferably something i wouldn’t have to buy online. \n\nany ideas??", "sortedWord": "None", "Identifyer": null, "identifyer": 33453, "year": "2018"}, {"autor": "_rosebud01", "date": "2018-10-03 23:27:46", "content": "Can you enable AF Illuminator for video on a6300? /!/ Shooting in low light soon. \n\nSays I can’t enable for video when I look elsewhere online, but I feel like I read somewhere that it can be enabled for video. Am I incorrect?\n\nIf so, any tips for shooting video in low light? How can I nail AF? Any DIY AF Illuminator methods?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9l6iv5/can_you_enable_af_illuminator_for_video_on_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "can you enable af illuminator for video on a6300? /!/ shooting in low light soon. \n\nsays i can’t enable for video when i look elsewhere online, but i feel like i read somewhere that it can be enabled for video. am i incorrect?\n\nif so, any tips for shooting video in low light? how can i nail af? any -----> diy !!!  af illuminator methods?", "sortedWord": "None", "Identifyer": null, "identifyer": 33525, "year": "2018"}, {"autor": "wolftatu", "date": "2018-03-04 22:57:05", "content": "A99II 1 DIY led light, 1 window and 4 cellophane paper", "link": "https://www.reddit.com/r/SonyAlpha/comments/821c4e/a99ii_1_diy_led_light_1_window_and_4_cellophane/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a99ii 1 -----> diy !!!  led light, 1 window and 4 cellophane paper", "sortedWord": "None", "Identifyer": null, "identifyer": 35659, "year": "2018"}, {"autor": "random_guy12", "date": "2018-03-04 19:41:53", "content": "[Lens Question] Sony FE 85mm f/1.8 vs 50mm f/1.8 OSS for portraits on A6300 /!/ Hey all,\n\nI'm looking in to buying my third prime for my A6300, primarily for portraits (both head &amp; shoulders type things as well as full body ones with lots of bokeh). Currently I'm using the Sigma 16mm f/1.4 and the Sony 35 mm f/1.8. \n\nThey are brilliant lenses, though I do want something with a bit more reach and \"flattening\", for both portraits as well as city detail shots. \n\nThe go-to portrait lens on APS-C Sony bodies seems to be the 50mm f/1.8 OSS. I tried a friend's copy the other day, and it's a nice lens, but I didn't get the impression that it was doing anything my 35mm f/1.8 couldn't already do with some cropping. And for anything outside of portraits, I often either found it too long or too short. \n\nIt is cheap though, and a long focal length wouldn't be my daily shooter (the 16 or 35 would still be my walk-aroundds). So from a cost to actual use perspective, it seems like the right choice. \n\nHowever, the FE 85mm f/1.8 is also interesting. I'm not sure if the focal length would be crazy limiting on APS-C (127.5mm equivalent), but it seems like that ~135mm length on full-frame is often used for portraits. This lens also seems like a bokeh monster. \n\nMy questions about it are:\n\n* How far back do you need to stand to get a waist-up portrait on APS-C?\n* How far back do you need to stand to get a full-body portrait?\n* If you have to be really far back, do you find yourself limited by lighting? Since things like the pop-up flash with a DIY diffuser might be too far to be useful\n* Is the lack of OSS a huge limiter for getting clear shots, especially in the evening/night. \n\n\nMy other qualm about the 85 is the price. I know it is generally considered great value for FF bodies, but I feel like it would be my least used lens (probably only about 15-20% of the time), and $550 would be my most expensive lens. \n\nOne other option is to wait for a new Sigma APS-C release - I heard that after the 16 f/1.4 and 30 f/1.4, Sigma plans to release a short-telephoto f/1.4 lens, but it's unclear what the time frame of release would be. Could be a year for all I know. \n\nI know the 60 f/2.8 exists, but I think that's too slow for the bokeh I want. \n\nThanks!\n\n\n\n\n\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/81zz5s/lens_question_sony_fe_85mm_f18_vs_50mm_f18_oss/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[lens question] sony fe 85mm f/1.8 vs 50mm f/1.8 oss for portraits on a6300 /!/ hey all,\n\ni'm looking in to buying my third prime for my a6300, primarily for portraits (both head &amp; shoulders type things as well as full body ones with lots of bokeh). currently i'm using the sigma 16mm f/1.4 and the sony 35 mm f/1.8. \n\nthey are brilliant lenses, though i do want something with a bit more reach and \"flattening\", for both portraits as well as city detail shots. \n\nthe go-to portrait lens on aps-c sony bodies seems to be the 50mm f/1.8 oss. i tried a friend's copy the other day, and it's a nice lens, but i didn't get the impression that it was doing anything my 35mm f/1.8 couldn't already do with some cropping. and for anything outside of portraits, i often either found it too long or too short. \n\nit is cheap though, and a long focal length wouldn't be my daily shooter (the 16 or 35 would still be my walk-aroundds). so from a cost to actual use perspective, it seems like the right choice. \n\nhowever, the fe 85mm f/1.8 is also interesting. i'm not sure if the focal length would be crazy limiting on aps-c (127.5mm equivalent), but it seems like that ~135mm length on full-frame is often used for portraits. this lens also seems like a bokeh monster. \n\nmy questions about it are:\n\n* how far back do you need to stand to get a waist-up portrait on aps-c?\n* how far back do you need to stand to get a full-body portrait?\n* if you have to be really far back, do you find yourself limited by lighting? since things like the pop-up flash with a -----> diy !!!  diffuser might be too far to be useful\n* is the lack of oss a huge limiter for getting clear shots, especially in the evening/night. \n\n\nmy other qualm about the 85 is the price. i know it is generally considered great value for ff bodies, but i feel like it would be my least used lens (probably only about 15-20% of the time), and $550 would be my most expensive lens. \n\none other option is to wait for a new sigma aps-c release - i heard that after the 16 f/1.4 and 30 f/1.4, sigma plans to release a short-telephoto f/1.4 lens, but it's unclear what the time frame of release would be. could be a year for all i know. \n\ni know the 60 f/2.8 exists, but i think that's too slow for the bokeh i want. \n\nthanks!\n\n\n\n\n\n", "sortedWord": "None", "Identifyer": null, "identifyer": 35668, "year": "2018"}, {"autor": "jefflan", "date": "2018-12-24 02:21:16", "content": "DIY Gift ideas every Photographer will love! [Sony a6300 4k downgraded to 1080p]", "link": "https://www.reddit.com/r/SonyAlpha/comments/a90u0k/diy_gift_ideas_every_photographer_will_love_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  gift ideas every photographer will love! [sony a6300 4k downgraded to 1080p]", "sortedWord": "None", "Identifyer": null, "identifyer": 36386, "year": "2018"}, {"autor": "Shagwahli", "date": "2018-08-19 11:16:34", "content": "A quick DIY sugru custom made Sony A7ii eyecup", "link": "https://www.reddit.com/r/SonyAlpha/comments/98jkdb/a_quick_diy_sugru_custom_made_sony_a7ii_eyecup/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a quick -----> diy !!!  sugru custom made sony a7ii eyecup", "sortedWord": "None", "Identifyer": null, "identifyer": 38900, "year": "2018"}, {"autor": "fisheveadventures", "date": "2018-12-20 22:10:12", "content": "My DIY Diffuser I use on my 90mm G OSS (a6300)", "link": "https://www.reddit.com/r/SonyAlpha/comments/a8351u/my_diy_diffuser_i_use_on_my_90mm_g_oss_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my -----> diy !!!  diffuser i use on my 90mm g oss (a6300)", "sortedWord": "None", "Identifyer": null, "identifyer": 41232, "year": "2018"}, {"autor": "mfrymus", "date": "2018-05-15 03:57:26", "content": "Record Button Hack (DIY) - Hate the placement of the record button? This should help you, it did for me!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8jinll/record_button_hack_diy_hate_the_placement_of_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "record button hack (-----> diy !!! ) - hate the placement of the record button? this should help you, it did for me!", "sortedWord": "None", "Identifyer": null, "identifyer": 42049, "year": "2018"}, {"autor": "fisheveadventures", "date": "2018-11-04 21:30:29", "content": "A6300 - Create Your own DIY Flash Diffuser in under 5 Minutes", "link": "https://www.reddit.com/r/SonyAlpha/comments/9u7bxf/a6300_create_your_own_diy_flash_diffuser_in_under/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a6300 - create your own -----> diy !!!  flash diffuser in under 5 minutes", "sortedWord": "None", "Identifyer": null, "identifyer": 43049, "year": "2018"}], "name": "diySonyAlpha2018"}