{"interestingcomments": [{"autor": "Hankitsune", "date": "2020-03-01 21:39:42", "content": "I'm not here to look at your pictures /!/ I'm getting tired of all the photo shares here and just want to exchange knowledge about settings, tips and tricks, hardware related talk, add-ons etcetera.\nAnyone else interested in a subreddit where it's not allowed to post pictures except when it's meant to illustrate issues, diy related stuff and quality comparison?", "link": "https://www.reddit.com/r/SonyAlpha/comments/fc15i0/im_not_here_to_look_at_your_pictures/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm not here to look at your pictures /!/ i'm getting tired of all the photo shares here and just want to exchange knowledge about settings, tips and tricks, hardware related talk, add-ons etcetera.\nanyone else interested in a subreddit where it's not allowed to post pictures except when it's meant to illustrate issues, -----> diy !!!  related stuff and quality comparison?", "sortedWord": "None", "Identifyer": null, "identifyer": 35120, "year": "2020"}, {"autor": "Danskkat", "date": "2020-12-27 22:35:53", "content": "Starting Modeling/Product Photography with a6000 /!/  As title suggests, I'm looking at getting in to modeling and product photography. I want to be able to get good marketing pictures for local costumers, makeup artists, artisans, etc.\n\nHowever, all I have is my a6000 kit with the telephoto and the kit lens that came with it. I don't know a ton about where to get started in editing, either.\n\nSo I guess first things first - Where should I start with gear?\n\nI know people stan the Sigma lenses around here. Is there a specific one I should be looking at for now? I probably need to learn how to do better lighting, as well. Am looking in to a DIY lightbox for some product pictures.\n\nI've been using the CaptureOne free Sony version with some post stuff in GIMP, any recommendations on reading/viewing material for good professional editing for these things?  \n\n\n(Am currently eyeballing a Sigma 60mm F2.8 but it's out of stock on Amazon - recommended vendors also appreciated)", "link": "https://www.reddit.com/r/SonyAlpha/comments/kld4ot/starting_modelingproduct_photography_with_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "starting modeling/product photography with a6000 /!/  as title suggests, i'm looking at getting in to modeling and product photography. i want to be able to get good marketing pictures for local costumers, makeup artists, artisans, etc.\n\nhowever, all i have is my a6000 kit with the telephoto and the kit lens that came with it. i don't know a ton about where to get started in editing, either.\n\nso i guess first things first - where should i start with gear?\n\ni know people stan the sigma lenses around here. is there a specific one i should be looking at for now? i probably need to learn how to do better lighting, as well. am looking in to a -----> diy !!!  lightbox for some product pictures.\n\ni've been using the captureone free sony version with some post stuff in gimp, any recommendations on reading/viewing material for good professional editing for these things?  \n\n\n(am currently eyeballing a sigma 60mm f2.8 but it's out of stock on amazon - recommended vendors also appreciated)", "sortedWord": "None", "Identifyer": null, "identifyer": 38495, "year": "2020"}, {"autor": "brian_m1982", "date": "2020-06-25 19:37:58", "content": "Gear advice on a macro adapter /!/ Hello all:\nJust hoping someone can point me in a direction i haven't doing yet. I started out with a 3 alpha, but a few years back watched to the Nex-7. Off and on, I've been looking for a reverse autofocus adapter.  It seems that Nikon, Canon, and everyone else had one. A couple years back, Novoflex came out with one, but for the 400+ price tag, i might as well purchase a dedicated macro lens, which is by something I'm looking to do at this time. I'm just wondering if anyone out there has find a cheaper option for a reverse autofocus adapter for a Sony e- mount. Or has a way to diy one. Thank you all.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hfslo1/gear_advice_on_a_macro_adapter/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "gear advice on a macro adapter /!/ hello all:\njust hoping someone can point me in a direction i haven't doing yet. i started out with a 3 alpha, but a few years back watched to the nex-7. off and on, i've been looking for a reverse autofocus adapter.  it seems that nikon, canon, and everyone else had one. a couple years back, novoflex came out with one, but for the 400+ price tag, i might as well purchase a dedicated macro lens, which is by something i'm looking to do at this time. i'm just wondering if anyone out there has find a cheaper option for a reverse autofocus adapter for a sony e- mount. or has a way to -----> diy !!!  one. thank you all.", "sortedWord": "None", "Identifyer": null, "identifyer": 40910, "year": "2020"}, {"autor": "Mat0fr", "date": "2020-11-10 15:57:48", "content": "Turning the A7III into a cinema camera with a DIY Anamorphic lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/jrnge4/turning_the_a7iii_into_a_cinema_camera_with_a_diy/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "turning the a7iii into a cinema camera with a -----> diy !!!  anamorphic lens", "sortedWord": "None", "Identifyer": null, "identifyer": 45646, "year": "2020"}], "name": "diySonyAlpha2020"}