{"interestingcomments": [{"autor": "chiclet_fanboi", "date": "2019-11-22 09:09:42", "content": "I ruined my poor little NEX, but now it sees stuff I don't (DIY full spectrum + transmittance of stock filter) /!/ So, I tried to do a full spectrum conversion on a old NEX-5 which I essentially bought for its accessories, and I would have been fine, killing it in the process, unless...\n\nWell I took it apart and was able to remove the stock IR and UV cut filter. I obviously didn't want to spend 100 bucks on a professional grade window especially chosen and cut for this application, so I used the cheapest sort of right thickness glass I could imagine, a microscope sample slide. When reassembled I turned it on and - a blank screen greeted me. But I heard the lens whirring, and with a SD card it took nicely red tinted and sharp pictures. Turned out I had butchered the LCD connector. I mean if I killed the sensor or the CPU, but this was a way to close loose on the conversion.\n\nMy last ressort was getting one of these small Raspberry Pi HDMI monitors in case the HDMI port was still working - and it did! So my now full spectrum camera is literally on life support, but working:\n\nhttps://imgur.com/tTh1SHg\n\nA few weeks I got rightfully grilled in r/photography for stating that the internal IR cut filter doesn't affect visible light, I just assumed it would be similar to a screw on IR and UV cut filter: [https://hoyafilter.com/product/uv\\_ir\\_cut/](https://hoyafilter.com/product/uv_ir_cut/)\n\nTo cofirm that this assumtion was as wrong as can be, I did a quick check with a spectrometer, to get an idea of the transmittance curve of the stock sensor. My lighting, containing a halogen lamp and a UV flashlight, lacked blue, so the curve gets quite noisy in the blues - but you can make out what the filter does. Cuts way into the visible spectrum!\n\nhttps://imgur.com/QzacZQ7", "link": "https://www.reddit.com/r/SonyAlpha/comments/dzyjew/i_ruined_my_poor_little_nex_but_now_it_sees_stuff/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i ruined my poor little nex, but now it sees stuff i don't (-----> diy !!!  full spectrum + transmittance of stock filter) /!/ so, i tried to do a full spectrum conversion on a old nex-5 which i essentially bought for its accessories, and i would have been fine, killing it in the process, unless...\n\nwell i took it apart and was able to remove the stock ir and uv cut filter. i obviously didn't want to spend 100 bucks on a professional grade window especially chosen and cut for this application, so i used the cheapest sort of right thickness glass i could imagine, a microscope sample slide. when reassembled i turned it on and - a blank screen greeted me. but i heard the lens whirring, and with a sd card it took nicely red tinted and sharp pictures. turned out i had butchered the lcd connector. i mean if i killed the sensor or the cpu, but this was a way to close loose on the conversion.\n\nmy last ressort was getting one of these small raspberry pi hdmi monitors in case the hdmi port was still working - and it did! so my now full spectrum camera is literally on life support, but working:\n\nhttps://imgur.com/tth1shg\n\na few weeks i got rightfully grilled in r/photography for stating that the internal ir cut filter doesn't affect visible light, i just assumed it would be similar to a screw on ir and uv cut filter: [https://hoyafilter.com/product/uv\\_ir\\_cut/](https://hoyafilter.com/product/uv_ir_cut/)\n\nto cofirm that this assumtion was as wrong as can be, i did a quick check with a spectrometer, to get an idea of the transmittance curve of the stock sensor. my lighting, containing a halogen lamp and a uv flashlight, lacked blue, so the curve gets quite noisy in the blues - but you can make out what the filter does. cuts way into the visible spectrum!\n\nhttps://imgur.com/qzaczq7", "sortedWord": "None", "Identifyer": null, "identifyer": 1982, "year": "2019"}, {"autor": "useyourownillusion", "date": "2019-12-27 07:06:16", "content": "DIY fractal filter and playing with rocks (A7iii+28-70mm 3.5-5.6)", "link": "https://www.reddit.com/r/SonyAlpha/comments/eg7wu9/diy_fractal_filter_and_playing_with_rocks/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  fractal filter and playing with rocks (a7iii+28-70mm 3.5-5.6)", "sortedWord": "None", "Identifyer": null, "identifyer": 3602, "year": "2019"}, {"autor": "christianjackson", "date": "2019-04-15 16:42:27", "content": "Trouble finding a specific part (mic pcb A7III) /!/ A few months back my a7 III took a fall from a table with a mic attached and I ended up damaging the mic input jack's pcb traces. I'm a very DIY fix it yourself type of person and took the camera apart (not a fun project, by the way) to attempt to re-run the cracked traces in the paper-thin pcb, but I was unsuccessful in fixing the traces. Put the camera back together and have been using onboard audio for that time.\n\n&amp;#x200B;\n\nSo now I just need to find the whole mic input pcb and replace it entirely, but none of the official parts websites I've found. Tried to cruise through ebay and alibaba, but without an actual part number or a diagram, I don't know what to search for.  \n\n\nAnyone out there able to help before I cave and buy another body?  \n\n\nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/bdi85e/trouble_finding_a_specific_part_mic_pcb_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "trouble finding a specific part (mic pcb a7iii) /!/ a few months back my a7 iii took a fall from a table with a mic attached and i ended up damaging the mic input jack's pcb traces. i'm a very -----> diy !!!  fix it yourself type of person and took the camera apart (not a fun project, by the way) to attempt to re-run the cracked traces in the paper-thin pcb, but i was unsuccessful in fixing the traces. put the camera back together and have been using onboard audio for that time.\n\n&amp;#x200b;\n\nso now i just need to find the whole mic input pcb and replace it entirely, but none of the official parts websites i've found. tried to cruise through ebay and alibaba, but without an actual part number or a diagram, i don't know what to search for.  \n\n\nanyone out there able to help before i cave and buy another body?  \n\n\nthanks", "sortedWord": "None", "Identifyer": null, "identifyer": 3767, "year": "2019"}, {"autor": "LambChop94", "date": "2019-08-30 14:14:56", "content": "DIY Lens Carrying Tips? /!/ Hey Reddit, I'm looking for some tips on how everyone carries their extra lenses when out in the field. The obvious answer is bring a bag but generally when I'm out adventuring I like to keep it light and just bring the cam on a sling strap and one other lens. But what is the best way to carry the lens? I've thought of trying to make some sort of pant clip for it but so far I haven't figured out a decent way. \n\nHow do you carry your extra lens(es) when you're going sans bag?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cxhiuw/diy_lens_carrying_tips/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  lens carrying tips? /!/ hey reddit, i'm looking for some tips on how everyone carries their extra lenses when out in the field. the obvious answer is bring a bag but generally when i'm out adventuring i like to keep it light and just bring the cam on a sling strap and one other lens. but what is the best way to carry the lens? i've thought of trying to make some sort of pant clip for it but so far i haven't figured out a decent way. \n\nhow do you carry your extra lens(es) when you're going sans bag?", "sortedWord": "None", "Identifyer": null, "identifyer": 11883, "year": "2019"}, {"autor": "Dave_Moshi", "date": "2019-07-10 12:01:59", "content": "Any tips for a good stabilization rig for the A7iii (diy is definitely an option) /!/ Soooo. I realise I could just buy a gimbal. But I’m getting a bit fed up with everyone’s videos having that floaty super smooth gimbal look to them all the time. Rewatching breaking bad recently made me realise how much I love “handheld” shots, however... using the A7iii made me realise how much I hate the infamous micro jitters 😂. \n\nSo I was wondering if anyone here has made or bought a type of handheld stabilization rig? Keeping it compact is definitely a pro. I’ve seen a few YouTube videos on people showing off their irig setups etc, but none of them seem to have any sample footage showing what the results are in real world use cases. \n\nThanks in advance for any help!", "link": "https://www.reddit.com/r/SonyAlpha/comments/cbfuen/any_tips_for_a_good_stabilization_rig_for_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "any tips for a good stabilization rig for the a7iii (-----> diy !!!  is definitely an option) /!/ soooo. i realise i could just buy a gimbal. but i’m getting a bit fed up with everyone’s videos having that floaty super smooth gimbal look to them all the time. rewatching breaking bad recently made me realise how much i love “handheld” shots, however... using the a7iii made me realise how much i hate the infamous micro jitters 😂. \n\nso i was wondering if anyone here has made or bought a type of handheld stabilization rig? keeping it compact is definitely a pro. i’ve seen a few youtube videos on people showing off their irig setups etc, but none of them seem to have any sample footage showing what the results are in real world use cases. \n\nthanks in advance for any help!", "sortedWord": "None", "Identifyer": null, "identifyer": 16074, "year": "2019"}, {"autor": "its_wakeuptoryan", "date": "2019-02-19 17:27:00", "content": "DIY Light Leaks and Lens Flares in 60 Seconds", "link": "https://www.reddit.com/r/SonyAlpha/comments/ascvhh/diy_light_leaks_and_lens_flares_in_60_seconds/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  light leaks and lens flares in 60 seconds", "sortedWord": "None", "Identifyer": null, "identifyer": 18023, "year": "2019"}], "name": "diySonyAlpha2019"}