{"interestingcomments": [{"Unnamed: 0": 139113, "autor": "jintakhan", "date": 1632728134000, "content": "GPS tethering with multiple bodies /!/ I regularly shoot with two a9s and sometimes a third a9 or an a7R IV. I've found that geotagging helps my workflow immensely but the god-awful Imaging Edge Mobile app only allows one GPS-tethered camera per phone, forcing me to carry multiple phones just for geotagging my photos. Is there a way to simplify this so I don't have to stuff my pocket with phones?\n\nSo far I've tried cloning the IEM app on my Android phone but the cloned app apparently does not have access to GPS tethering. Also, iPhones apparently have trouble keeping a Bluetooth connection with the camera.\n\nNo, a separate GPS logger will not work, especially when I'm on deadline. Copying geotag information between cameras won't work either because I may be working with remote cameras.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pwca45/gps_tethering_with_multiple_bodies/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "gps tethering with multiple bodies /!/ i regularly shoot with two a9s and sometimes a third a9 or an a7r iv. i've found that -----> geotagging !!!  helps my workflow immensely but the god-awful imaging edge mobile app only allows one gps-tethered camera per phone, forcing me to carry multiple phones just for -----> geotagging !!!  my photos. is there a way to simplify this so i don't have to stuff my pocket with phones?\n\nso far i've tried cloning the iem app on my android phone but the cloned app apparently does not have access to gps tethering. also, iphones apparently have trouble keeping a bluetooth connection with the camera.\n\nno, a separate gps logger will not work, especially when i'm on deadline. copying geotag information between cameras won't work either because i may be working with remote cameras.", "sortedWord": "None", "identifyer": 30002, "year": "2021"}], "name": "geotaggingSonyAlpha2021"}