{"interestingcomments": [{"Unnamed: 0": 239159, "autor": "someToast", "date": 1537207864000, "content": "What’s the secret to getting geotagging working with A7iii and iPhone X? /!/ Coming from an a6000, I was excited to have an option for automatic geotagging with the A7iii, but it’s turned out to be more frustrating than anything.\n\nThe camera pairs with the phone fine, the PlayMemories app shows that it’s connected, and photos are taken with location information, but before long, it’ll stop, with the camera showing Bluetooth connected but a slashed circle on the map icon. Sometimes while in this state, I’ll see that maybe eight out of a couple dozen photos taken in the same location have coordinates, without me having had tried to do anything to fix it.\n\nOther times I’ll turn on the camera and see both the “no location” and “no Bluetooth” icons. I’ll go into the phone’s Bluetooth settings and connect to the camera (and the camera’s Bluetooth icon lights up immediately) but I still don’t get location. I’ll then open the PlayMemories app and it will be stuck on “Searching for the camera…”. My only solution is to delete the pairing from the phone’s Bluetooth list, delete the linked camera from the PlayMemories app and start over… which fixes the issue for ten minutes or so.\n\nIs there a secret trick to getting geotagging to work reliably?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9gmqxi/whats_the_secret_to_getting_geotagging_working/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "what’s the secret to getting geotagging working with a7iii and iphone x? /!/ coming from an a6000, i was excited to have an option for automatic -----> geotagging !!!  with the a7iii, but it’s turned out to be more frustrating than anything.\n\nthe camera pairs with the phone fine, the playmemories app shows that it’s connected, and photos are taken with location information, but before long, it’ll stop, with the camera showing bluetooth connected but a slashed circle on the map icon. sometimes while in this state, i’ll see that maybe eight out of a couple dozen photos taken in the same location have coordinates, without me having had tried to do anything to fix it.\n\nother times i’ll turn on the camera and see both the “no location” and “no bluetooth” icons. i’ll go into the phone’s bluetooth settings and connect to the camera (and the camera’s bluetooth icon lights up immediately) but i still don’t get location. i’ll then open the playmemories app and it will be stuck on “searching for the camera…”. my only solution is to delete the pairing from the phone’s bluetooth list, delete the linked camera from the playmemories app and start over… which fixes the issue for ten minutes or so.\n\nis there a secret trick to getting geotagging to work reliably?", "sortedWord": "None", "identifyer": 34284, "year": "2018"}], "name": "geotaggingSonyAlpha2018"}