{"interestingcomments": [{"Unnamed: 0": 234066, "autor": "tovu87", "date": 1542800406000, "content": "/a6000+sigma 30 f1.4/ 2 frames taken the same night at the same location", "link": "https://www.reddit.com/r/SonyAlpha/comments/9z2hyj/a6000sigma_30_f14_2_frames_taken_the_same_night/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "/a6000+sigma 30 f1.4/ 2 frames taken the same night at the same -----> location !!! ", "sortedWord": "None", "identifyer": 29120, "year": "2018"}, {"Unnamed: 0": 234195, "autor": "actuallypittsburgh", "date": 1520958076000, "content": "A7III Preorder Shipping Time Estimates (USA) /!/ I know there is an earlier post discussing shipping time estimates for the A7III from different online retailers. I am creating a post with updates about the information I was able to gather.  \n  \n**AMAZON**: I used Amazon live chat to speak with a sales representative. They said, due to high number of preorders, they can only guarantee free 5-8 business days shipping time (even with Prime membership.) Prime members who've already preordered have the highest likelihood of getting closer to 1-2 days Prime shipping time.  \n  \n**B&amp;H**: They can guarantee 1-3 business days expedited shipping based on your location in the USA. Map is available here: https://www.bhphotovideo.com/images/freeShipMap_3.png  \n  \n**ADORAMA**: They offer free overnight shipping to the lower contiguous 48 states. Shipping details are available via their [A7III preorder page](https://www.adorama.com/isoa7m3.html)  \n  \n**BEST BUY**: Depending on your location and date of preorder, will have [A7III available for in-store pickup](https://www.bestbuy.com/site/sony-alpha-a7-iii-mirrorless-camera-body-only/6213101.p?skuId=6213101) on release day  \n  \n**SAMY'S CAMERA**: Guaranteed [3-day shipping](https://www.samys.com/p/US-Only-Shipping/ILCE-7M3/Alpha-a7-III-Mirrorless-Digital-Camera-Body/201197.html)  \n  \n**BEDFORD**: Free [overnight shipping](https://www.bedfords.com/ilce-7m3)", "link": "https://www.reddit.com/r/SonyAlpha/comments/845f9d/a7iii_preorder_shipping_time_estimates_usa/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7iii preorder shipping time estimates (usa) /!/ i know there is an earlier post discussing shipping time estimates for the a7iii from different online retailers. i am creating a post with updates about the information i was able to gather.  \n  \n**amazon**: i used amazon live chat to speak with a sales representative. they said, due to high number of preorders, they can only guarantee free 5-8 business days shipping time (even with prime membership.) prime members who've already preordered have the highest likelihood of getting closer to 1-2 days prime shipping time.  \n  \n**b&amp;h**: they can guarantee 1-3 business days expedited shipping based on your -----> location !!!  in the usa. map is available here: https://www.bhphotovideo.com/images/freeshipmap_3.png  \n  \n**adorama**: they offer free overnight shipping to the lower contiguous 48 states. shipping details are available via their [a7iii preorder page](https://www.adorama.com/isoa7m3.html)  \n  \n**best buy**: depending on your location and date of preorder, will have [a7iii available for in-store pickup](https://www.bestbuy.com/site/sony-alpha-a7-iii-mirrorless-camera-body-only/6213101.p?skuid=6213101) on release day  \n  \n**samy's camera**: guaranteed [3-day shipping](https://www.samys.com/p/us-only-shipping/ilce-7m3/alpha-a7-iii-mirrorless-digital-camera-body/201197.html)  \n  \n**bedford**: free [overnight shipping](https://www.bedfords.com/ilce-7m3)", "sortedWord": "None", "identifyer": 29251, "year": "2018"}, {"Unnamed: 0": 234663, "autor": "-IntoEternity-", "date": 1536554565000, "content": "Found out I'm going to Washington D.C this Friday. Does anyone have any good locations they've scoped and would like to share? /!/ I'm frantically trying to find and plot all the landmarks, so I haven't even thought about which places are best to photograph under certain conditions. I definitely want to hit the streets at night, so if you've found any can't miss night ops - let me know. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/9ejqla/found_out_im_going_to_washington_dc_this_friday/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "found out i'm going to washington d.c this friday. does anyone have any good -----> locations !!!  they've scoped and would like to share? /!/ i'm frantically trying to find and plot all the landmarks, so i haven't even thought about which places are best to photograph under certain conditions. i definitely want to hit the streets at night, so if you've found any can't miss night ops - let me know. ", "sortedWord": "None", "identifyer": 29723, "year": "2018"}, {"Unnamed: 0": 234968, "autor": "olivergoldvalente", "date": 1516147606000, "content": "Is the a6300 That Much More Rugged Than the a6000? /!/ I personally have the a7rii, but I baby it so I don't know it's limits. \n\nI have a friend who's gaining interest in photography. She has the nex 5 and and is looking for a substantial upgrade but is on a somewhat slim budget. She does a lot of senior photos for extra money but really loves creative shoots with interesting subjects and locations. \n\nThe biggest thing for her is she doesn't want to buy another camera in 2-5 years. \n\nTLDR; Is the a6300 that much more rugged than the a6000? Is it worth the extra money? \n\nThanks for any and all help my friends.", "link": "https://www.reddit.com/r/SonyAlpha/comments/7qwvnh/is_the_a6300_that_much_more_rugged_than_the_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "is the a6300 that much more rugged than the a6000? /!/ i personally have the a7rii, but i baby it so i don't know it's limits. \n\ni have a friend who's gaining interest in photography. she has the nex 5 and and is looking for a substantial upgrade but is on a somewhat slim budget. she does a lot of senior photos for extra money but really loves creative shoots with interesting subjects and -----> locations !!! . \n\nthe biggest thing for her is she doesn't want to buy another camera in 2-5 years. \n\ntldr; is the a6300 that much more rugged than the a6000? is it worth the extra money? \n\nthanks for any and all help my friends.", "sortedWord": "None", "identifyer": 30033, "year": "2018"}, {"Unnamed: 0": 235047, "autor": "[deleted]", "date": 1515945499000, "content": "A7Rii w/Zeiss 35mm f2.8 lens. Location: Los Angeles /!/ [deleted]", "link": "https://www.reddit.com/r/SonyAlpha/comments/7qclnc/a7rii_wzeiss_35mm_f28_lens_location_los_angeles/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7rii w/zeiss 35mm f2.8 lens. -----> location !!! : los angeles /!/ [deleted]", "sortedWord": "None", "identifyer": 30112, "year": "2018"}, {"Unnamed: 0": 235057, "autor": "-benjaminfoureyes", "date": 1515901067000, "content": "A7Rii w/Zeiss 35mm f2.8 lens. Location: Disneyland", "link": "https://www.reddit.com/r/SonyAlpha/comments/7q9ir3/a7rii_wzeiss_35mm_f28_lens_location_disneyland/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7rii w/zeiss 35mm f2.8 lens. -----> location !!! : disneyland", "sortedWord": "None", "identifyer": 30123, "year": "2018"}, {"Unnamed: 0": 235856, "autor": "chau1988", "date": 1538185100000, "content": "\"Shore Break\" location: Sandy Beach, Honolulu HI. Shot on Sony A7RII with Aquatech water housing.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9jsro8/shore_break_location_sandy_beach_honolulu_hi_shot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "\"shore break\" -----> location !!! : sandy beach, honolulu hi. shot on sony a7rii with aquatech water housing.", "sortedWord": "None", "identifyer": 30931, "year": "2018"}, {"Unnamed: 0": 236123, "autor": "hulahuluu", "date": 1534910493000, "content": "Finding the Milky Way /!/ I have a Sony a6000 + rokinon 12 mm. I’m going to be in Lake Tahoe this weekend and want to try astrophotography for the first time. Stupid question but how do I find the Milky Way? How do I find a good location to shoot it and whether or not I will see it. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/99a515/finding_the_milky_way/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "finding the milky way /!/ i have a sony a6000 + rokinon 12 mm. i’m going to be in lake tahoe this weekend and want to try astrophotography for the first time. stupid question but how do i find the milky way? how do i find a good -----> location !!!  to shoot it and whether or not i will see it. ", "sortedWord": "None", "identifyer": 31205, "year": "2018"}, {"Unnamed: 0": 237356, "autor": "zytron11", "date": 1541040673000, "content": "Be Alpha LA Meetup /!/ Hey y'all! I was just wondering if anyone here has been to one of the alpha universe meetups in other locations? What was it like? and if anyone is going to the LA meetup? I got off the waitlist for a ticket and I'm super excited!", "link": "https://www.reddit.com/r/SonyAlpha/comments/9t5qzj/be_alpha_la_meetup/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "be alpha la meetup /!/ hey y'all! i was just wondering if anyone here has been to one of the alpha universe meetups in other -----> locations !!! ? what was it like? and if anyone is going to the la meetup? i got off the waitlist for a ticket and i'm super excited!", "sortedWord": "None", "identifyer": 32451, "year": "2018"}, {"Unnamed: 0": 238106, "autor": "moxiesmiley", "date": 1541739914000, "content": "Anyone know how soon the gmaster lenses are replenished in stores? I want to buy the 24mm 1.4 gmaster but not sure when they be back in stock. /!/ I know this question varies greatly on location and such, but does anyone have a ballpark answer on how often lenses shipments get replenished? Thank you", "link": "https://www.reddit.com/r/SonyAlpha/comments/9vhn1o/anyone_know_how_soon_the_gmaster_lenses_are/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "anyone know how soon the gmaster lenses are replenished in stores? i want to buy the 24mm 1.4 gmaster but not sure when they be back in stock. /!/ i know this question varies greatly on -----> location !!!  and such, but does anyone have a ballpark answer on how often lenses shipments get replenished? thank you", "sortedWord": "None", "identifyer": 33214, "year": "2018"}, {"Unnamed: 0": 238193, "autor": "jdenaliwebmaster", "date": 1542428939000, "content": "Sony a7r III – Zeiss Cp.2 Lenses – Feedback Welcome! – Jennifer Denali – \"Painkiller\" /!/ [https://youtu.be/B45T4Ns12Kk](https://youtu.be/B45T4Ns12Kk)\n\nHey Reddit Fam,\n\nI'm the co-writer, producer and mix engineer on 'Painkiller' for singer [Jennifer Denali](http://jenniferdenali.com). Today we premiered the [official music video](https://youtu.be/B45T4Ns12Kk). It's been such a long journey for us to get to this point, we're super grateful to share this. The video itself was an intense process. After securing a small budget, we encountered many hurdles leading up to, during and after the shoot. Everything from securing the locations, crew members, to having major creative differences and budget issues with the original director. \n\nLong story short, I ended up shooting 50%-60% of the final video, editing it, color grading and some VFX. After 2 months of non-stop work, Et voila! I think we have solid final product. **Would love to know your thoughts!**\n\n**Equipment:**\n\nThe original crew shot with a RED Scarlett, Rokinon Cine Lenses. I ended up buying a Sony a7r III, a Zhiyun Crane V2 and rented Zeiss Cp.2 21mm and 35mm lenses to shoot the new footage. I edited in Premiere, Graded in Resolve, VFX in Photoshop &amp; After Effects.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9xtiwn/sony_a7r_iii_zeiss_cp2_lenses_feedback_welcome/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony a7r iii – zeiss cp.2 lenses – feedback welcome! – jennifer denali – \"painkiller\" /!/ [https://youtu.be/b45t4ns12kk](https://youtu.be/b45t4ns12kk)\n\nhey reddit fam,\n\ni'm the co-writer, producer and mix engineer on 'painkiller' for singer [jennifer denali](http://jenniferdenali.com). today we premiered the [official music video](https://youtu.be/b45t4ns12kk). it's been such a long journey for us to get to this point, we're super grateful to share this. the video itself was an intense process. after securing a small budget, we encountered many hurdles leading up to, during and after the shoot. everything from securing the -----> locations !!! , crew members, to having major creative differences and budget issues with the original director. \n\nlong story short, i ended up shooting 50%-60% of the final video, editing it, color grading and some vfx. after 2 months of non-stop work, et voila! i think we have solid final product. **would love to know your thoughts!**\n\n**equipment:**\n\nthe original crew shot with a red scarlett, rokinon cine lenses. i ended up buying a sony a7r iii, a zhiyun crane v2 and rented zeiss cp.2 21mm and 35mm lenses to shoot the new footage. i edited in premiere, graded in resolve, vfx in photoshop &amp; after effects.", "sortedWord": "None", "identifyer": 33304, "year": "2018"}, {"Unnamed: 0": 238766, "autor": "rteyistoenr", "date": 1529293401000, "content": "Which lens do you think I should get? /!/ Ok...this is the scenario I am in.\n\nI used to own the Canon 7d with the Tokina 11-16mm f/2.8 (that was ONE of my lenses). During late summer months, due to the northern location of my work, I got some spectacular Northern Lights shots. This spring, I purchased the a7iii with the kit lens. After thinking about it for the past few days, I am debating on which lens to buy for the aurora. I originally was planning on the 16-35mm f2.8, but with the ISO range and the quality of full frame/noise, I am wondering, do you think I could get away with the 16-35mm f4? I am planning on purchasing my lens in about 3-4 weeks time. Just keep in mind...I am 100% getting the 16-35mm, just not sure which aperture that I should get. In addition to the aurora, my main passion of shooting, is landscapes and trophy catches (fish, hunting)\n\nSo, what are your thoughts?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8rwi5a/which_lens_do_you_think_i_should_get/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "which lens do you think i should get? /!/ ok...this is the scenario i am in.\n\ni used to own the canon 7d with the tokina 11-16mm f/2.8 (that was one of my lenses). during late summer months, due to the northern -----> location !!!  of my work, i got some spectacular northern lights shots. this spring, i purchased the a7iii with the kit lens. after thinking about it for the past few days, i am debating on which lens to buy for the aurora. i originally was planning on the 16-35mm f2.8, but with the iso range and the quality of full frame/noise, i am wondering, do you think i could get away with the 16-35mm f4? i am planning on purchasing my lens in about 3-4 weeks time. just keep in mind...i am 100% getting the 16-35mm, just not sure which aperture that i should get. in addition to the aurora, my main passion of shooting, is landscapes and trophy catches (fish, hunting)\n\nso, what are your thoughts?", "sortedWord": "None", "identifyer": 33882, "year": "2018"}, {"Unnamed: 0": 239185, "autor": "reigningnovice", "date": 1537144397000, "content": "Canon User Wanting to Make the Leap. Has Service Repair improved? /!/ I shoot video for weddings &amp; have tried out the A7III and loved it.  I think I'm going to wait for the A7SIII to come out to jump ship.  \n\nI live in Los Angeles &amp; we have 2 Canon Official Service shops.  I could mail it in and get it back in around 4-5 business days.. or actually drive to the location and pick it up within 2-3 days.\n\nIs there anything at all regarding Sony that has speedy service?  I hear there's a PRO subscription of some sort where you need at least 2 bodies, and they're relatively quick.  Any stories?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9gfpey/canon_user_wanting_to_make_the_leap_has_service/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "canon user wanting to make the leap. has service repair improved? /!/ i shoot video for weddings &amp; have tried out the a7iii and loved it.  i think i'm going to wait for the a7siii to come out to jump ship.  \n\ni live in los angeles &amp; we have 2 canon official service shops.  i could mail it in and get it back in around 4-5 business days.. or actually drive to the -----> location !!!  and pick it up within 2-3 days.\n\nis there anything at all regarding sony that has speedy service?  i hear there's a pro subscription of some sort where you need at least 2 bodies, and they're relatively quick.  any stories?", "sortedWord": "None", "identifyer": 34313, "year": "2018"}, {"Unnamed: 0": 241913, "autor": "torrelocchetta", "date": 1532256113000, "content": "Should I buy the Sony 85mm f1.8 for my needs? /!/ I’ve just begun a career in wedding photography.\nI’m working with a Sony A7ii paired with the kit lens. My team provides me a 50mm f1.8 when they are not using it elsewhere.\nThey are making me shoot mainly details of the locations (flowers, plates, candles...), but I’m training to take pictures of the bride and groom as well, of course.\n\nAfter long searches I’ve come down to the Sony 85mm f1.8 for its amazing portraits and bokeh. But it requires at least a 80cm distance.\nMy fear is that it wouldn’t be convenient for shooting details and generally for shooting pics of the bride and groom as they walk here and there in the location.\n\nDo you think it would fit my purposes the most? Or should I go for a 50/55mm?", "link": "https://www.reddit.com/r/SonyAlpha/comments/90wy9e/should_i_buy_the_sony_85mm_f18_for_my_needs/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "should i buy the sony 85mm f1.8 for my needs? /!/ i’ve just begun a career in wedding photography.\ni’m working with a sony a7ii paired with the kit lens. my team provides me a 50mm f1.8 when they are not using it elsewhere.\nthey are making me shoot mainly details of the -----> locations !!!  (flowers, plates, candles...), but i’m training to take pictures of the bride and groom as well, of course.\n\nafter long searches i’ve come down to the sony 85mm f1.8 for its amazing portraits and bokeh. but it requires at least a 80cm distance.\nmy fear is that it wouldn’t be convenient for shooting details and generally for shooting pics of the bride and groom as they walk here and there in the location.\n\ndo you think it would fit my purposes the most? or should i go for a 50/55mm?", "sortedWord": "None", "identifyer": 37082, "year": "2018"}, {"Unnamed: 0": 242676, "autor": "kaymdveen", "date": 1531393901000, "content": "Photo color profile lightroom. /!/ Hi all. As I shot canon for Many Many years I was shockend importing my first raw photos in Lightroom. Weird color casts, greenish, magenta  just weird. These where from different locations and different times of day. \n\nSo I went nuts on camera profiles or HSL\nChanges inside Lightroom. I though it might be cool to share your settings. I’ll share some photos raw + camera\nProfile changes. What do you use? ", "link": "https://www.reddit.com/r/SonyAlpha/comments/8y8ts7/photo_color_profile_lightroom/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "photo color profile lightroom. /!/ hi all. as i shot canon for many many years i was shockend importing my first raw photos in lightroom. weird color casts, greenish, magenta  just weird. these where from different -----> locations !!!  and different times of day. \n\nso i went nuts on camera profiles or hsl\nchanges inside lightroom. i though it might be cool to share your settings. i’ll share some photos raw + camera\nprofile changes. what do you use? ", "sortedWord": "None", "identifyer": 37860, "year": "2018"}, {"Unnamed: 0": 244391, "autor": "tozgentas", "date": 1525020086000, "content": "About to get my own alpha /!/ Hello everyone,\n\nİ live in nyc and am considering to buy an Alpha 7 R 3. Currently considerin B and H as the place to get it. Anyone know the best location or online place to get it for the lowest price possible. \n\nThanks for your help in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8fshjj/about_to_get_my_own_alpha/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "about to get my own alpha /!/ hello everyone,\n\ni̇ live in nyc and am considering to buy an alpha 7 r 3. currently considerin b and h as the place to get it. anyone know the best -----> location !!!  or online place to get it for the lowest price possible. \n\nthanks for your help in advance!", "sortedWord": "None", "identifyer": 39611, "year": "2018"}, {"Unnamed: 0": 245296, "autor": "brave21wr", "date": 1525670952000, "content": "On location for a photo shoot...", "link": "https://www.reddit.com/r/SonyAlpha/comments/8hl76q/on_location_for_a_photo_shoot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on -----> location !!!  for a photo shoot...", "sortedWord": "None", "identifyer": 40531, "year": "2018"}, {"Unnamed: 0": 245544, "autor": "gerardmpatience", "date": 1519940708000, "content": "People who have used both a6500 and a7sii---is the footage actually comparable? /!/ I've been looking at flipping my a7sii for an a6500 (to switch all my glass to aps-c mostly and get out of the a7sii before the a7siii drops). On paper, people love to say they are comparable in their image quality for 4k video and overcranked 1080 video (obviously less iso ability).\n\nHowever, when looking at cinematic samples, the a6500 seems to have much worse compression, especially in areas beyond critical focus.\n\nMy suspicion is that it either attracts less experienced operators due to the lower price point (so exposure, color, and even focus aren't being managed properly on location) or it isn't actually as comparable as the numbers would make it seem.\n\nI would love to hear anyone who has been hands on with both cam's take on this.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8191rp/people_who_have_used_both_a6500_and_a7siiis_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "people who have used both a6500 and a7sii---is the footage actually comparable? /!/ i've been looking at flipping my a7sii for an a6500 (to switch all my glass to aps-c mostly and get out of the a7sii before the a7siii drops). on paper, people love to say they are comparable in their image quality for 4k video and overcranked 1080 video (obviously less iso ability).\n\nhowever, when looking at cinematic samples, the a6500 seems to have much worse compression, especially in areas beyond critical focus.\n\nmy suspicion is that it either attracts less experienced operators due to the lower price point (so exposure, color, and even focus aren't being managed properly on -----> location !!! ) or it isn't actually as comparable as the numbers would make it seem.\n\ni would love to hear anyone who has been hands on with both cam's take on this.", "sortedWord": "None", "identifyer": 40784, "year": "2018"}, {"Unnamed: 0": 245770, "autor": "supernitin", "date": 1545443300000, "content": "A7 iii Bluetooth geo location connection w/iPhone XS /!/ Any luck on getting this to work? I can’t even get the camera to show up in my Bluetooth menu. Tried to reset network settings in both devices and still no luck. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/a8gp2f/a7_iii_bluetooth_geo_location_connection_wiphone/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7 iii bluetooth geo -----> location !!!  connection w/iphone xs /!/ any luck on getting this to work? i can’t even get the camera to show up in my bluetooth menu. tried to reset network settings in both devices and still no luck. ", "sortedWord": "None", "identifyer": 41017, "year": "2018"}, {"Unnamed: 0": 245898, "autor": "samuistudio", "date": 1525965788000, "content": "Sony A7 + 50mm f1.8 /!/ One of my favorite shot from the day. Took this during sunset with the signature coconut and long tail boat that describe how this little island in Thailand is.\n\nLocation : Conrad Hotel, Koh Samui, Thailand\n\nShutter Speed : 200\n\nISO : 400\n\nAperture : f3.5\n\n*Processing img 8ecpjvjdp1x01...*", "link": "https://www.reddit.com/r/SonyAlpha/comments/8ifpnz/sony_a7_50mm_f18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony a7 + 50mm f1.8 /!/ one of my favorite shot from the day. took this during sunset with the signature coconut and long tail boat that describe how this little island in thailand is.\n\n-----> location !!!  : conrad hotel, koh samui, thailand\n\nshutter speed : 200\n\niso : 400\n\naperture : f3.5\n\n*processing img 8ecpjvjdp1x01...*", "sortedWord": "None", "identifyer": 41146, "year": "2018"}, {"Unnamed: 0": 246928, "autor": "trspanache", "date": 1533825670000, "content": "How do you keep expensive gear safe on a hike? /!/ I do many multi day hikes into the mountains to beautiful locations but it’s often a range of hot, freezing, dusty, raining, snowing, etc.  How do you bring your gear and not constantly worry about it? ", "link": "https://www.reddit.com/r/SonyAlpha/comments/95wzzi/how_do_you_keep_expensive_gear_safe_on_a_hike/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "how do you keep expensive gear safe on a hike? /!/ i do many multi day hikes into the mountains to beautiful -----> locations !!!  but it’s often a range of hot, freezing, dusty, raining, snowing, etc.  how do you bring your gear and not constantly worry about it? ", "sortedWord": "None", "identifyer": 42201, "year": "2018"}, {"Unnamed: 0": 248101, "autor": "jam-hay", "date": 1522530359000, "content": "Sony A5100 Flash not working /!/ Hi hope this is the right place to post and if so someone can help. I've had my A5100 for a few years great camera however today I took a couple of pics in lowlight the flash fired however did make a strange louder snapping/ cracking sound. I didn't think too much of it at the time... it actually sounded pretty cool it wasn't until later when I tried taking low light pics with the flash it wouldn't fire. \n\nI tried again.. all different settings, taking the battery out, new fresh battery, different lenses.. but nothing. Tried different locations from lowlight to pitch dark but nothing.\n\nAny ideas?\n\nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/88lob2/sony_a5100_flash_not_working/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony a5100 flash not working /!/ hi hope this is the right place to post and if so someone can help. i've had my a5100 for a few years great camera however today i took a couple of pics in lowlight the flash fired however did make a strange louder snapping/ cracking sound. i didn't think too much of it at the time... it actually sounded pretty cool it wasn't until later when i tried taking low light pics with the flash it wouldn't fire. \n\ni tried again.. all different settings, taking the battery out, new fresh battery, different lenses.. but nothing. tried different -----> locations !!!  from lowlight to pitch dark but nothing.\n\nany ideas?\n\nthanks", "sortedWord": "None", "identifyer": 43401, "year": "2018"}], "name": "locationSonyAlpha2018"}