{"interestingcomments": [{"Unnamed: 0": 2096, "autor": "dermosa", "date": 1555577818000, "content": "Sony Alpha 6300 | 16-50 mm Kit lens Location: San Gimignano Italy", "link": "https://www.reddit.com/r/SonyAlpha/comments/beja15/sony_alpha_6300_1650_mm_kit_lens_location_san/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony alpha 6300 | 16-50 mm kit lens -----> location !!! : san gimignano italy", "sortedWord": "None", "identifyer": 2112, "year": "2019"}, {"Unnamed: 0": 2898, "autor": "MrKodijack", "date": 1563489922000, "content": "A6300 Videos to iPad Pro /!/ I’m thinking about buying the A6300. What are my options to transfer videos directly to my iPad? So far I read, I have to record in mp4. Not a problem. Connecting the camera directly or use an usbc adapter obviously doesn’t work, because of file naming and location on the SD-Card. How good is the Imaging Edge App? Do Videos get transferred in full resolution? How long does it take? I don’t care, if it is taking longer, as long as it doesn’t take hours for every clip. \n\nThanks in advance", "link": "https://www.reddit.com/r/SonyAlpha/comments/cezguz/a6300_videos_to_ipad_pro/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a6300 videos to ipad pro /!/ i’m thinking about buying the a6300. what are my options to transfer videos directly to my ipad? so far i read, i have to record in mp4. not a problem. connecting the camera directly or use an usbc adapter obviously doesn’t work, because of file naming and -----> location !!!  on the sd-card. how good is the imaging edge app? do videos get transferred in full resolution? how long does it take? i don’t care, if it is taking longer, as long as it doesn’t take hours for every clip. \n\nthanks in advance", "sortedWord": "None", "identifyer": 2922, "year": "2019"}, {"Unnamed: 0": 2916, "autor": "Lanky1911", "date": 1563468519000, "content": "New 400mm f/2.8 Available! /!/ We have a 400mm f/2.8 available!  Local pick-up preferred! Store location is Southampton PA 18966.\nhttps://i.imgur.com/fOteo8U.jpg", "link": "https://www.reddit.com/r/SonyAlpha/comments/ceuzdp/new_400mm_f28_available/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "new 400mm f/2.8 available! /!/ we have a 400mm f/2.8 available!  local pick-up preferred! store -----> location !!!  is southampton pa 18966.\nhttps://i.imgur.com/foteo8u.jpg", "sortedWord": "None", "identifyer": 2940, "year": "2019"}, {"Unnamed: 0": 3426, "autor": "Dann-Oh", "date": 1553177972000, "content": "Teleconverter Question /!/ As I understand it the Sony teleconverters will only work with the GM glass due to the location of the rear most glass element.\n\n&amp;#x200B;\n\nMy question is would setting up the imaging train the following way still work:  I dont recall seeing and glass elements in the MC11 adapter.\n\nA7iii + 2x Tele (sony) + MC11 Adapter + Canon 70-200 f4 lens?\n\n&amp;#x200B;\n\nI also understand that I could add a teleconverter on the canon side of the imaging train such as:\n\nA7iii + MC11 Adapter + 2x Tele (canon) + Canon 70-200 f4 lens?", "link": "https://www.reddit.com/r/SonyAlpha/comments/b3r2vg/teleconverter_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "teleconverter question /!/ as i understand it the sony teleconverters will only work with the gm glass due to the -----> location !!!  of the rear most glass element.\n\n&amp;#x200b;\n\nmy question is would setting up the imaging train the following way still work:  i dont recall seeing and glass elements in the mc11 adapter.\n\na7iii + 2x tele (sony) + mc11 adapter + canon 70-200 f4 lens?\n\n&amp;#x200b;\n\ni also understand that i could add a teleconverter on the canon side of the imaging train such as:\n\na7iii + mc11 adapter + 2x tele (canon) + canon 70-200 f4 lens?", "sortedWord": "None", "identifyer": 3453, "year": "2019"}, {"Unnamed: 0": 3705, "autor": "DoraForscher", "date": 1555372794000, "content": "Sony FE 1.8/50mm lens problem. Any help? On location.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bdn6mo/sony_fe_1850mm_lens_problem_any_help_on_location/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony fe 1.8/50mm lens problem. any help? on -----> location !!! .", "sortedWord": "None", "identifyer": 3741, "year": "2019"}, {"Unnamed: 0": 6055, "autor": "Cyuna", "date": 1572035911000, "content": "A7III Eye AF in use vs Fuji's AF question /!/ Hey there,\n\nI've recently acquired the A7III coming from an XT3 from Fuji and I had a question regarding the Eye-AF. When shooting Fuji the face and eye detection is basically on all the time and the location is locked when you half press the shutter or use back button focus. This basically functions across the entire sensor. When not detecting a face or eye it uses your chosen focus point, such as single point small which is my personal preference. \n\nWhen shooting Sony it seems that eye AF functions best when having it bound to a button or when using the half shutter press on wide. This means that I can't combine my small flexible point with eye-AF across the entire sensor with just the shutter button as it loses the eye if it moves too far away from the point. \n\nWhile this is a small complaint as I can move the focus point around I much prefer the Fuji way of doing it, is there any way it can be recreated on Sony or do you just have to deal with using a separate button for eye AF? \n\nThanks and appreciate the time.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dn3fsp/a7iii_eye_af_in_use_vs_fujis_af_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7iii eye af in use vs fuji's af question /!/ hey there,\n\ni've recently acquired the a7iii coming from an xt3 from fuji and i had a question regarding the eye-af. when shooting fuji the face and eye detection is basically on all the time and the -----> location !!!  is locked when you half press the shutter or use back button focus. this basically functions across the entire sensor. when not detecting a face or eye it uses your chosen focus point, such as single point small which is my personal preference. \n\nwhen shooting sony it seems that eye af functions best when having it bound to a button or when using the half shutter press on wide. this means that i can't combine my small flexible point with eye-af across the entire sensor with just the shutter button as it loses the eye if it moves too far away from the point. \n\nwhile this is a small complaint as i can move the focus point around i much prefer the fuji way of doing it, is there any way it can be recreated on sony or do you just have to deal with using a separate button for eye af? \n\nthanks and appreciate the time.", "sortedWord": "None", "identifyer": 6119, "year": "2019"}, {"Unnamed: 0": 7378, "autor": "incorrect_light", "date": 1554926686000, "content": "Starting to learn positioning is makes the photo than the location. This was shot in front of an Olive Garden. | A7iii 85mm f/1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/bbqnxc/starting_to_learn_positioning_is_makes_the_photo/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "starting to learn positioning is makes the photo than the -----> location !!! . this was shot in front of an olive garden. | a7iii 85mm f/1.8", "sortedWord": "None", "identifyer": 7464, "year": "2019"}, {"Unnamed: 0": 7527, "autor": "keenfeed", "date": 1554577168000, "content": "Sony A7iii- 70-200 2.8 GM location: Newfoundland, Canada", "link": "https://www.reddit.com/r/SonyAlpha/comments/ba7oi1/sony_a7iii_70200_28_gm_location_newfoundland/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony a7iii- 70-200 2.8 gm -----> location !!! : newfoundland, canada", "sortedWord": "None", "identifyer": 7618, "year": "2019"}, {"Unnamed: 0": 7637, "autor": "Els236", "date": 1566420583000, "content": "Is the price increase for an F1.4 lens worth it over an F2.8 lens? /!/ Hey guys and gals;\n\nI am seriously interested in shooting the stars and milky way and I know that most people use lenses between 15 and 50mm of focal length. I have been using my SEL 50 F1.8 to semi-decent effect, but prefer to have something that I will use for the sole purpose of doing these sorts of shots when I go on holiday to more rural locations.\n\nI know you can obviously use any lens and make it work, but a good wide-angle with a low F number (1.4/1.8, etc) are likely the better options, especially seeing as the 500 rule goes down to only 10 seconds of exposure with a 50mm lens, which sometimes does not let enough light in.\n\n&amp;#x200B;\n\nAnyway, I've currently got my eyes on the Samyang 35mm F1.4 and the Samyang 35mm F2.8 and I know that if money were no issue you would likely recommend the F1.4 for this type of shooting.\n\nHowever, the price difference between these 2 lenses is quite large at £300;\n\n\\- Samyang AF 35mm F1.4 retails at £599.99 but has a Prime deal at £516.63\n\n\\- Samyang AF 35mm F2.8 retails at £280 but has a Prime deal at £249\n\n&amp;#x200B;\n\nIs the almost £300 price hike between the 2 lenses worth it for this type of photography? \n\nI can get either on \"5 monthly payments of £x\", so neither will bust my bank account in this sense, but if any of you have either of these lenses, which is better and which is better value?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ctmuq2/is_the_price_increase_for_an_f14_lens_worth_it/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "is the price increase for an f1.4 lens worth it over an f2.8 lens? /!/ hey guys and gals;\n\ni am seriously interested in shooting the stars and milky way and i know that most people use lenses between 15 and 50mm of focal length. i have been using my sel 50 f1.8 to semi-decent effect, but prefer to have something that i will use for the sole purpose of doing these sorts of shots when i go on holiday to more rural -----> locations !!! .\n\ni know you can obviously use any lens and make it work, but a good wide-angle with a low f number (1.4/1.8, etc) are likely the better options, especially seeing as the 500 rule goes down to only 10 seconds of exposure with a 50mm lens, which sometimes does not let enough light in.\n\n&amp;#x200b;\n\nanyway, i've currently got my eyes on the samyang 35mm f1.4 and the samyang 35mm f2.8 and i know that if money were no issue you would likely recommend the f1.4 for this type of shooting.\n\nhowever, the price difference between these 2 lenses is quite large at £300;\n\n\\- samyang af 35mm f1.4 retails at £599.99 but has a prime deal at £516.63\n\n\\- samyang af 35mm f2.8 retails at £280 but has a prime deal at £249\n\n&amp;#x200b;\n\nis the almost £300 price hike between the 2 lenses worth it for this type of photography? \n\ni can get either on \"5 monthly payments of £x\", so neither will bust my bank account in this sense, but if any of you have either of these lenses, which is better and which is better value?", "sortedWord": "None", "identifyer": 7730, "year": "2019"}, {"Unnamed: 0": 8290, "autor": "gmehje", "date": 1568788653000, "content": "Dream locations in Europe for one week? /!/ Loving this forum. Such inspirational photos and suggestions. \n\nHere’s the thing. I have an unexpected free week from 18th October. \n\nI live near London and was originally going do some cycling stuff but due to a quite severe crash a couple of months ago  I can’t ride my bike (or even drive a car) due to wrist injury. \n\nBut I can take photos and hike and Airbnb. :)\n\nSo where in Europe for one week? \nThere’s just so much choice!\n\nI’ll be travelling alone and would like to do landscapes, vistas and getting up ridiculously early for sunrises etc. \n\nAny thoughts greatly appreciated!\n\nG", "link": "https://www.reddit.com/r/SonyAlpha/comments/d5tt55/dream_locations_in_europe_for_one_week/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "dream -----> locations !!!  in europe for one week? /!/ loving this forum. such inspirational photos and suggestions. \n\nhere’s the thing. i have an unexpected free week from 18th october. \n\ni live near london and was originally going do some cycling stuff but due to a quite severe crash a couple of months ago  i can’t ride my bike (or even drive a car) due to wrist injury. \n\nbut i can take photos and hike and airbnb. :)\n\nso where in europe for one week? \nthere’s just so much choice!\n\ni’ll be travelling alone and would like to do landscapes, vistas and getting up ridiculously early for sunrises etc. \n\nany thoughts greatly appreciated!\n\ng", "sortedWord": "None", "identifyer": 8396, "year": "2019"}, {"Unnamed: 0": 9182, "autor": "rocknroll_allnite", "date": 1562457417000, "content": "A7III: Wireless tethering to iPad/tablet /!/ I just attended a masterclass where the photographer was tethering a Canon wirelessly to an ipad. This is ideal when you're shooting for a client on set and they need to check the results on the fly, or even if you want a better idea of whether you got your shot or not. I can't seem to find anything related regarding Sony and I'm starting to wonder if I actually should sell everything and switch to Canon for this reason. Please someone tell me I can do that with my A7iii. Tethering to C1 on a Mac with a cable is ok in a studio, but when shooting on location, especially if we're on the run the whole day, makes it way convenient to tether to iPad / tablet wirelessly.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ca0gwt/a7iii_wireless_tethering_to_ipadtablet/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7iii: wireless tethering to ipad/tablet /!/ i just attended a masterclass where the photographer was tethering a canon wirelessly to an ipad. this is ideal when you're shooting for a client on set and they need to check the results on the fly, or even if you want a better idea of whether you got your shot or not. i can't seem to find anything related regarding sony and i'm starting to wonder if i actually should sell everything and switch to canon for this reason. please someone tell me i can do that with my a7iii. tethering to c1 on a mac with a cable is ok in a studio, but when shooting on -----> location !!! , especially if we're on the run the whole day, makes it way convenient to tether to ipad / tablet wirelessly.", "sortedWord": "None", "identifyer": 9310, "year": "2019"}, {"Unnamed: 0": 9412, "autor": "neko_stillwater", "date": 1571027880000, "content": "Why does this picture look \"fake\" to me? /!/ I took this picture on a recent trip to Japan. It looks strangely artificial or \"photoshopped\" even though it's not.  Other shots I took from the same location look nothing like . Can anyone explain why it has that strange \"artificial\" look to it?  I went into DXO photolab and turned off the auto lens correction, including the one for CA and noise reduction, and it still looks \"fake\" to me. Any ideas on what could cause this?\n\nOh, it was shot on a A7riii with the Sony Zeiss 35mm 2.8, in case that helps.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dhlmul/why_does_this_picture_look_fake_to_me/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "why does this picture look \"fake\" to me? /!/ i took this picture on a recent trip to japan. it looks strangely artificial or \"photoshopped\" even though it's not.  other shots i took from the same -----> location !!!  look nothing like . can anyone explain why it has that strange \"artificial\" look to it?  i went into dxo photolab and turned off the auto lens correction, including the one for ca and noise reduction, and it still looks \"fake\" to me. any ideas on what could cause this?\n\noh, it was shot on a a7riii with the sony zeiss 35mm 2.8, in case that helps.", "sortedWord": "None", "identifyer": 9541, "year": "2019"}, {"Unnamed: 0": 9822, "autor": "Hotshoedrew", "date": 1563209871000, "content": "Question about AUTO ISO/ ISO AUTO Min. SS /!/ I am shooting with an A7R III, and I would really like to not worry too much about changing ISO as I tend to do a lot of street/ urban photography and lighting situations tend to differ drastically from location to location.\n\nCurrenty I am using AUTO ISO  set to 100 - 12800, and ISO AUTO Min.ss is set to \"Faster\" as I tend to shoot all times of the day/ night. \n\nI am finding that the camera seems to drastically over estimate how high my ISO needs to be. Especially in situations without direct sunlight. (choosing ISO 2000+ when the conditions only really call for something around 400 - 800).\n\nI'm sure I'm missing something incredibly obvious, so I figured I'd ask how everyone that uses AUTO ISO has their settings configured. What is your go to metering mode for shooting outdoors in varying lighting conditions?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cdk0n2/question_about_auto_iso_iso_auto_min_ss/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "question about auto iso/ iso auto min. ss /!/ i am shooting with an a7r iii, and i would really like to not worry too much about changing iso as i tend to do a lot of street/ urban photography and lighting situations tend to differ drastically from -----> location !!!  to -----> location !!! .\n\ncurrenty i am using auto iso  set to 100 - 12800, and iso auto min.ss is set to \"faster\" as i tend to shoot all times of the day/ night. \n\ni am finding that the camera seems to drastically over estimate how high my iso needs to be. especially in situations without direct sunlight. (choosing iso 2000+ when the conditions only really call for something around 400 - 800).\n\ni'm sure i'm missing something incredibly obvious, so i figured i'd ask how everyone that uses auto iso has their settings configured. what is your go to metering mode for shooting outdoors in varying lighting conditions?", "sortedWord": "None", "identifyer": 9956, "year": "2019"}, {"Unnamed: 0": 10209, "autor": "King-Benny", "date": 1573014988000, "content": "I’m trying to find an affordable underwater housing for my A6400, but can only find one for A6300. Can someone with experience of both cameras tell me if the size and button locations are the same so I can use the A6300 housing for my A6400.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dsb9mv/im_trying_to_find_an_affordable_underwater/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i’m trying to find an affordable underwater housing for my a6400, but can only find one for a6300. can someone with experience of both cameras tell me if the size and button -----> locations !!!  are the same so i can use the a6300 housing for my a6400.", "sortedWord": "None", "identifyer": 10345, "year": "2019"}, {"Unnamed: 0": 10727, "autor": "Chvrche5", "date": 1571542330000, "content": "If you were offered an A6500 for USD$100 more than an A6400, which would you pick for 85% photography work. /!/ - I'm upgrading from an old A6300 which has been malfunctioning from time to time.\n- All my lenses have OSS\n- I mainly shoot events in low-light using flashes and portraits (both on location and in studio).\n- I have a gimbal for video work, but I rarely get any paid video work so I pretty much only focus photography for my personal projects.\n- I use Capture One, unsure if they've optimised the A6400 camera profile yet.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dkeckm/if_you_were_offered_an_a6500_for_usd100_more_than/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "if you were offered an a6500 for usd$100 more than an a6400, which would you pick for 85% photography work. /!/ - i'm upgrading from an old a6300 which has been malfunctioning from time to time.\n- all my lenses have oss\n- i mainly shoot events in low-light using flashes and portraits (both on -----> location !!!  and in studio).\n- i have a gimbal for video work, but i rarely get any paid video work so i pretty much only focus photography for my personal projects.\n- i use capture one, unsure if they've optimised the a6400 camera profile yet.", "sortedWord": "None", "identifyer": 10876, "year": "2019"}, {"Unnamed: 0": 11750, "autor": "f4fotografy", "date": 1567124248000, "content": "Sometimes a lunchtime location scouting trip yields a surprise gem. Like this tiny waterfall in a shady part of the botanical gardens. A7iii + 24-70 Zeiss", "link": "https://www.reddit.com/r/SonyAlpha/comments/cx9c6u/sometimes_a_lunchtime_location_scouting_trip/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sometimes a lunchtime -----> location !!!  scouting trip yields a surprise gem. like this tiny waterfall in a shady part of the botanical gardens. a7iii + 24-70 zeiss", "sortedWord": "None", "identifyer": 11910, "year": "2019"}, {"Unnamed: 0": 11751, "autor": "f4fotografy", "date": 1567122774000, "content": "Sometimes a lunchtime location scouting trip yields a surprise gem. Like this tiny waterfall in a shady part of the botanical gardens.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cx9206/sometimes_a_lunchtime_location_scouting_trip/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sometimes a lunchtime -----> location !!!  scouting trip yields a surprise gem. like this tiny waterfall in a shady part of the botanical gardens.", "sortedWord": "None", "identifyer": 11911, "year": "2019"}, {"Unnamed: 0": 11987, "autor": "jojimboy", "date": 1560443050000, "content": "Which is better for video: sony 18-105mm or sigma 16mm? /!/ I plan to buy an alfa 6400 for video recording an i will use it with a gimbal at night and in indoor locations. Maybe the sigma is better for the aperture?", "link": "https://www.reddit.com/r/SonyAlpha/comments/c07wkc/which_is_better_for_video_sony_18105mm_or_sigma/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "which is better for video: sony 18-105mm or sigma 16mm? /!/ i plan to buy an alfa 6400 for video recording an i will use it with a gimbal at night and in indoor -----> locations !!! . maybe the sigma is better for the aperture?", "sortedWord": "None", "identifyer": 12150, "year": "2019"}, {"Unnamed: 0": 15151, "autor": "analogadrian", "date": 1569286247000, "content": "Can you guess the location? | a7iii | 28-70mm kit", "link": "https://www.reddit.com/r/SonyAlpha/comments/d8fsoe/can_you_guess_the_location_a7iii_2870mm_kit/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "can you guess the -----> location !!! ? | a7iii | 28-70mm kit", "sortedWord": "None", "identifyer": 15379, "year": "2019"}, {"Unnamed: 0": 15379, "autor": "TanmayPadhye", "date": 1575755909000, "content": "The most photographed location in Colorado!", "link": "https://www.reddit.com/r/SonyAlpha/comments/e7kmej/the_most_photographed_location_in_colorado/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the most photographed -----> location !!!  in colorado!", "sortedWord": "None", "identifyer": 15609, "year": "2019"}, {"Unnamed: 0": 15547, "autor": "CosyOreo", "date": 1555859143000, "content": "iPad editing workflow and RAW+JPG catalogue management solutions /!/  \n\nI am an enthusiast photographer, looking for ideas on efficient workflows for (1) iPad photo editing + (2) storage management.\n\n&amp;#x200B;\n\n**2011 - 2016**\n\n&amp;#x200B;\n\nI used to do more photography back then (Nikon DSLR), but for the lack of time and size of the kit (was just reluctant to bring along 1.5kg of body+lens sometimes) ended up not using it at all and sold in the end. I used Lightroom on PC, and later Capture One, where I edited and stored (local HDD) my library.\n\n&amp;#x200B;\n\n**2017 - 2018**\n\n&amp;#x200B;\n\nIn this period I didn’t touch my catalogue, it just sat there on my HDD, and everything I shot on my phone I kept in Google Photos.\n\nRecently decided to jump back into this hobby because I miss it and my phone snaps from recent holiday just look sad.\n\n&amp;#x200B;\n\n**2019 -**\n\n&amp;#x200B;\n\nI opted in for Sony A6300 due to its size/ capability and reviews, I intend to exclusively use my iPad Pro 2018 for editing.\n\n&amp;#x200B;\n\n**Editing**\n\n&amp;#x200B;\n\nThe first dilemma was the editing, I am trying to use PixelmatorPhoto and Pixelmator on the iPad right now, but despite of how easy these are to use, photos need to be imported and then exported one by one, which is super painful. I’ve watched a couple of Lightroom reviews on YT and it looks like people are taking advantage of the CC organisation, so import/export and storage of raw/jpeg is less of a pain. Also heard good things about Affinity Photo, but I’m not sure this will solve my problems.\n\n&amp;#x200B;\n\n**Catalogue**\n\n&amp;#x200B;\n\n**iCloud**\n\n&amp;#x200B;\n\nAt first I bought iCloud 200GB, and tried importing my DSLR Library into iPad. I was used to backing up to Google photos, and once they are backed up I would free up space on the device by deleting them. My mistake was I assumed you could do that on Apple Photos. To be honest I don't understand the point of cloud backup if there is no way to delete photos from iPad without removing from the cloud library\n\n&amp;#x200B;\n\n1. apparently you can factory reset device, and then not re-download from cloud, but that doesn't sound appealing\n2. I know Apple has the ‘optimise iPad storage’ option, but I had 2 GB left and when I tried importing a big video it kept saying the storage is full, while not optimising the storage (didn’t delete already backed up photos to make space)\n\n&amp;#x200B;\n\nI stopped iCloud Photos and downgraded to 50GB plan which I will use for backups etc.\n\n&amp;#x200B;\n\n**Google Photos**\n\n&amp;#x200B;\n\nI ended up importing all of my photos and videos into Google Drive as organised albums, Google also nicely lets add location data and adjust timestamps with relative time shifts.\n\n**Amazon Photos**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI learned that as a Prime member I get unlimited photos in original (even raw) quality. Apparently Sony raw files are not supported for thumbnail creation, I'm still looking into this. Another downside is that I only get 5GB for videos, so if I end up going with Amazon, I will need to pay £16 a year (happy to if that's what I'm going with) for 100GB.\n\n&amp;#x200B;\n\nRight now my workflow is sort of like:\n\n1. Import photos from SD card reader into iPad photos app\n2. at this point Google will start auto uploading everything (wouldn't want to turn this off as I do actually use if for my mobile devices)\n3. favourite decent shots in iPad Photos app (to mark what I want to keep / edit), delete the rest\n4. open PixelmatorPhoto, import (one at a time!) to adjust crop, exposure, curves, colours etc. (occasionally then open in Pixelmator to make regional adjustments)\n5. at this point (again, one at a time) I can choose to save as a copy or modify original (I think this replaces my raw in photos with jpg)\n6. at this stage I would want to store raw on Amazon (as a backup since it’s unlimited) and edited compressed files as an album (in whatever cloud service). The issue is that Google already backed up everything at step 2) (unedited selected photos as well as stuff I later decided to delete) as jpg. I also have problems with uploading raw to Google Photos, only jpgs get imported.\n\n&amp;#x200B;\n\nFor videos I’m using Lumafusion which is amazing, and I’m planning to just Private post them on YT, as Google Photos doesn't replay 60fps unless I download the video first.\n\n&amp;#x200B;\n\n**Ideally I would want to have albums with selected AND edited photos (some photos I want to keep but never edit) for easy access anywhere, but also Raw files backed up. What are my options and are there solutions more affordable than 9.99/ month Lightroom CC (if it does address my workflow gaps)?**", "link": "https://www.reddit.com/r/SonyAlpha/comments/bfpqcq/ipad_editing_workflow_and_rawjpg_catalogue/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "ipad editing workflow and raw+jpg catalogue management solutions /!/  \n\ni am an enthusiast photographer, looking for ideas on efficient workflows for (1) ipad photo editing + (2) storage management.\n\n&amp;#x200b;\n\n**2011 - 2016**\n\n&amp;#x200b;\n\ni used to do more photography back then (nikon dslr), but for the lack of time and size of the kit (was just reluctant to bring along 1.5kg of body+lens sometimes) ended up not using it at all and sold in the end. i used lightroom on pc, and later capture one, where i edited and stored (local hdd) my library.\n\n&amp;#x200b;\n\n**2017 - 2018**\n\n&amp;#x200b;\n\nin this period i didn’t touch my catalogue, it just sat there on my hdd, and everything i shot on my phone i kept in google photos.\n\nrecently decided to jump back into this hobby because i miss it and my phone snaps from recent holiday just look sad.\n\n&amp;#x200b;\n\n**2019 -**\n\n&amp;#x200b;\n\ni opted in for sony a6300 due to its size/ capability and reviews, i intend to exclusively use my ipad pro 2018 for editing.\n\n&amp;#x200b;\n\n**editing**\n\n&amp;#x200b;\n\nthe first dilemma was the editing, i am trying to use pixelmatorphoto and pixelmator on the ipad right now, but despite of how easy these are to use, photos need to be imported and then exported one by one, which is super painful. i’ve watched a couple of lightroom reviews on yt and it looks like people are taking advantage of the cc organisation, so import/export and storage of raw/jpeg is less of a pain. also heard good things about affinity photo, but i’m not sure this will solve my problems.\n\n&amp;#x200b;\n\n**catalogue**\n\n&amp;#x200b;\n\n**icloud**\n\n&amp;#x200b;\n\nat first i bought icloud 200gb, and tried importing my dslr library into ipad. i was used to backing up to google photos, and once they are backed up i would free up space on the device by deleting them. my mistake was i assumed you could do that on apple photos. to be honest i don't understand the point of cloud backup if there is no way to delete photos from ipad without removing from the cloud library\n\n&amp;#x200b;\n\n1. apparently you can factory reset device, and then not re-download from cloud, but that doesn't sound appealing\n2. i know apple has the ‘optimise ipad storage’ option, but i had 2 gb left and when i tried importing a big video it kept saying the storage is full, while not optimising the storage (didn’t delete already backed up photos to make space)\n\n&amp;#x200b;\n\ni stopped icloud photos and downgraded to 50gb plan which i will use for backups etc.\n\n&amp;#x200b;\n\n**google photos**\n\n&amp;#x200b;\n\ni ended up importing all of my photos and videos into google drive as organised albums, google also nicely lets add -----> location !!!  data and adjust timestamps with relative time shifts.\n\n**amazon photos**\n\n&amp;#x200b;\n\n&amp;#x200b;\n\ni learned that as a prime member i get unlimited photos in original (even raw) quality. apparently sony raw files are not supported for thumbnail creation, i'm still looking into this. another downside is that i only get 5gb for videos, so if i end up going with amazon, i will need to pay £16 a year (happy to if that's what i'm going with) for 100gb.\n\n&amp;#x200b;\n\nright now my workflow is sort of like:\n\n1. import photos from sd card reader into ipad photos app\n2. at this point google will start auto uploading everything (wouldn't want to turn this off as i do actually use if for my mobile devices)\n3. favourite decent shots in ipad photos app (to mark what i want to keep / edit), delete the rest\n4. open pixelmatorphoto, import (one at a time!) to adjust crop, exposure, curves, colours etc. (occasionally then open in pixelmator to make regional adjustments)\n5. at this point (again, one at a time) i can choose to save as a copy or modify original (i think this replaces my raw in photos with jpg)\n6. at this stage i would want to store raw on amazon (as a backup since it’s unlimited) and edited compressed files as an album (in whatever cloud service). the issue is that google already backed up everything at step 2) (unedited selected photos as well as stuff i later decided to delete) as jpg. i also have problems with uploading raw to google photos, only jpgs get imported.\n\n&amp;#x200b;\n\nfor videos i’m using lumafusion which is amazing, and i’m planning to just private post them on yt, as google photos doesn't replay 60fps unless i download the video first.\n\n&amp;#x200b;\n\n**ideally i would want to have albums with selected and edited photos (some photos i want to keep but never edit) for easy access anywhere, but also raw files backed up. what are my options and are there solutions more affordable than 9.99/ month lightroom cc (if it does address my workflow gaps)?**", "sortedWord": "None", "identifyer": 15780, "year": "2019"}, {"Unnamed: 0": 16376, "autor": "TheWizard", "date": 1563040901000, "content": "Sony a9 + Zeiss Loxia 21mm f/2.8 Location: 200 miles west of Dallas, TX", "link": "https://www.reddit.com/r/SonyAlpha/comments/ccsb7v/sony_a9_zeiss_loxia_21mm_f28_location_200_miles/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony a9 + zeiss loxia 21mm f/2.8 -----> location !!! : 200 miles west of dallas, tx", "sortedWord": "None", "identifyer": 16626, "year": "2019"}, {"Unnamed: 0": 16820, "autor": "ffffbbbbffffbbbb", "date": 1573752363000, "content": "Cinematic travel video filmed on my Sony Alpha 6300! Breathtaking locations captured...", "link": "https://www.reddit.com/r/SonyAlpha/comments/dwcpnc/cinematic_travel_video_filmed_on_my_sony_alpha/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "cinematic travel video filmed on my sony alpha 6300! breathtaking -----> locations !!!  captured...", "sortedWord": "None", "identifyer": 17077, "year": "2019"}, {"Unnamed: 0": 18168, "autor": "DatedMovieReference", "date": 1566645349000, "content": "Cairns Festival Fireworks (QLD Australia) I've never shot fireworks before but I am fairly happy with the results considering it was the best location I could get. A6000 rokinon 12mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/cus5zn/cairns_festival_fireworks_qld_australia_ive_never/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "cairns festival fireworks (qld australia) i've never shot fireworks before but i am fairly happy with the results considering it was the best -----> location !!!  i could get. a6000 rokinon 12mm", "sortedWord": "None", "identifyer": 18463, "year": "2019"}, {"Unnamed: 0": 19297, "autor": "nathan118", "date": 1559152912000, "content": "Location Linking A6400 - Only When I wake phone /!/ Hi everybody. Been trying to get location linking working well, and I've narrowed it down to one small issue.\n\nI'm running a pixel 3, and I've got everything working. When my phone is on, I turn the camera on, and the imaging edge mobile app connects within seconds. Confirmed on camera lcd and phone's persistent notification.\n\nThe only problem is it ONLY links when I wake my phone. If the screen is off in my pocket, and I turn the phone on, it doesn't connect. The SECOND I put my finger on the fingerprint and wake up my phone, it connects.\n\nAny ideas? I assume the phone is trying to save battery by not constantly scanning Bluetooth...but having to remember to wake the phone everytime I turn on the camera is bad.", "link": "https://www.reddit.com/r/SonyAlpha/comments/buhyva/location_linking_a6400_only_when_i_wake_phone/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "-----> location !!!  linking a6400 - only when i wake phone /!/ hi everybody. been trying to get location linking working well, and i've narrowed it down to one small issue.\n\ni'm running a pixel 3, and i've got everything working. when my phone is on, i turn the camera on, and the imaging edge mobile app connects within seconds. confirmed on camera lcd and phone's persistent notification.\n\nthe only problem is it only links when i wake my phone. if the screen is off in my pocket, and i turn the phone on, it doesn't connect. the second i put my finger on the fingerprint and wake up my phone, it connects.\n\nany ideas? i assume the phone is trying to save battery by not constantly scanning bluetooth...but having to remember to wake the phone everytime i turn on the camera is bad.", "sortedWord": "None", "identifyer": 19612, "year": "2019"}, {"Unnamed: 0": 20521, "autor": "srirachase", "date": 1574643089000, "content": "I have a missing piece for on my a7iii. Can you help me? /!/ So a while ago, when I was getting really annoyed with the usb-c cover on my a7iii, I decided to cut the little cord that connected it to the camera body, so that I could fully remove it when I was transferring files via usb-c. I have officially come to regret that day, because I haven't been able to find that cover for probably 2 months or more. I had initially googled a little bit to see if I could find one online, but had no luck. So I have two questions: does anybody know where I could possibly find another cover piece online? Even if it had to be a rubber piece that plugged all the way into the usb-c (and I wanna say that has the mini-HDMI? not 100% sure), that would be fine. And second, I have a warranty that is still currently active. Could I use that warranty to just get a new a7iii body? I guess it would help to take a look at the warranty itself, but I'm not within 200 miles of its location atm, so if anybody has had a small issue and was able to get help through the warranty, that would be very helpful. I can send a picture to anybody who believes they could help me, if that helps out in any way. \n\n&amp;#x200B;\n\nLastly, yeah, I know. It was a stupid idea to cut off the cover. I think I made it about a month and a half before it came off somewhere. I've searched pretty much everywhere that my camera has been stored, so yeah.", "link": "https://www.reddit.com/r/SonyAlpha/comments/e17zvz/i_have_a_missing_piece_for_on_my_a7iii_can_you/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i have a missing piece for on my a7iii. can you help me? /!/ so a while ago, when i was getting really annoyed with the usb-c cover on my a7iii, i decided to cut the little cord that connected it to the camera body, so that i could fully remove it when i was transferring files via usb-c. i have officially come to regret that day, because i haven't been able to find that cover for probably 2 months or more. i had initially googled a little bit to see if i could find one online, but had no luck. so i have two questions: does anybody know where i could possibly find another cover piece online? even if it had to be a rubber piece that plugged all the way into the usb-c (and i wanna say that has the mini-hdmi? not 100% sure), that would be fine. and second, i have a warranty that is still currently active. could i use that warranty to just get a new a7iii body? i guess it would help to take a look at the warranty itself, but i'm not within 200 miles of its -----> location !!!  atm, so if anybody has had a small issue and was able to get help through the warranty, that would be very helpful. i can send a picture to anybody who believes they could help me, if that helps out in any way. \n\n&amp;#x200b;\n\nlastly, yeah, i know. it was a stupid idea to cut off the cover. i think i made it about a month and a half before it came off somewhere. i've searched pretty much everywhere that my camera has been stored, so yeah.", "sortedWord": "None", "identifyer": 20852, "year": "2019"}, {"Unnamed: 0": 21949, "autor": "TheOverratedPhotog", "date": 1551228605000, "content": "Using Godox with the Sony A7iii/A7riii /!/ I put together an instructional for using Godox with Sony so hopefully it helps people. I have the original on my site but I figured I would post this here so people don't have to go to the link.\n\n# Introduction\n\nI’ve written this article as there seems to be a gap in the information provided by Godox specific articles, videos and Sony flash articles with specific reference to the Godox system and how to use it with Sony cameras. Like any camera system, there are unique ways the lighting system works and this can be confusing for many people.\n\nI’ve noted this is specific to the A7iii and A7Riii, however, this is due to these being the only two Sony cameras I have. As a result, I can’t test it across the entire range of Sony cameras. It may or may not be applicable, feel free to try it out, it won’t break anything.\n\nI will also try to update this article as time goes on, but if you feel anything is wrong here, please feel free to let me know, either via the comments or email. I might have missed something while writing it. If you know of any additional cameras from Sony that would be supported in the same way and you can validate they work, let me know and I’ll update the article to reflect compatibility.\n\n&gt;***Note****: Godox do rebrand their gear under a number of names, so this should also be applicable to Flashpoint, Neewer, Adorama and Cheetah although I can’t tell you the exact models*\n\nI’ve tried to cover an overview of the most commonly used Godox gear first, along with some recommendations on what I believe are the best first purchases if you plan on buying into the Godox system with Sony. After the gear port of the article, I’ve moved straight into the use with Sony, so feel free to skip the gear section if you feel this is irrelevant.\n\n## FLASH BASICS\n\nWhen I wrote this article, I realised that the audience in some cases may be new to flash. As a result, I’ve included fairly basic descriptions of what I consider “Flash Basics” at certain points in the article. These will be relevant to a specific area I am writing about and will help extend the knowledge for a novice. These are not comprehensive detailed descriptions so you may need to research these further if you don’t understand. They are areas that more experienced photographers will already know and as a result, to avoid boring the crap out of the more experienced photographers, I’ve included these in a box entitled “Flash Basics”. An example of a subject I am talking about is “What is Flash vs Ambient”. In some cases, I’ve written a short description, in others, I’ve just pointed to a video that covers these areas well enough that it’s pointless me writing about it.\n\nIf you are someone who has used flash extensively, feel free to ignore them, and I’ve put them in blocks to make it easier to identify them. They have a bolded “Flash Basics” that looks like this:\n\n&gt;***Flash Basics: Sample***  \n*This is a sample example of flash basics description*\n\n# An overview of Godox Speedlights, Strobes and Triggers\n\nOne of the greatest advantages of the Godox system is the ability to mix and match speedlights and strobes with a variety of camera systems, along with the low-cost entry point for people looking to experiment or start using lighting for the first time. Many of the Strobe brands do not manufacture speedlights and many speedlight brands do not manufacture strobes. Godox (along with Profoto) is one of the few to provide both options. I’ve tried to cover all speedlights, strobes, and triggers here, and I will continue to update these as time goes on, and new models arrive, but please understand I’m not planning to buy every speedlight and strobe they manufacture so my hands-on experience with some models may be limited.  I have not covered the non-battery studio models of their strobe lineup.\n\n&gt;***Flash Basics – Speedlights vs strobes***  \n*The difference between these two has always been blurred, more so in recent years. Do a search on google and you’ll find 5 different definitions. Some people consider the difference to be the power output; others whether it has a cable or battery, for some it’s whether it has a fresnel or globe head.*  \n*I couldn’t find any definitive definition which is part of the challenge. As a result, lets assume for the sake of this article that a speedlight is a lightweight flash that can be used on camera and the strobe is a high-powered flash designed to be used off camera. It’s not to say you can’t put a speedlight off camera, but you can’t put a strobe on camera.*\n\n### Speedlight Options\n\nWith Godox’s speedlight lineup, there are only 2 sizes for Godox, each with sub-options. You have a small low powered flash and a larger full powered flash. For each of these, there is a sub option with AA Batteries or a Godox rechargeable battery option, but they’re essentially the same or similar model with different battery options/\n\nTypically in the speedlight range, a TT version is an AA battery version and a V version is one supplied with a rechargeable battery.  In the case of some (like the TT350/V350), the names match however with the V860 and TT685, they don’t…don’t ask me why. The S indicates Sony version, although they are compatible with other cameras if used with the brand specific trigger. i.e. you can trigger a Sony flash on a Fujifilm camera with a Fujifilm trigger.\n\n#### Godox TT350S/V350S\n\nThe Godox TT350S and V350S are similar the same unit, however, the V350S version comes with a battery and charger whilst the TT350S uses 2 AA batteries. The V350S goes for $159 and the TT350S goes for $89.\n\nThe small flash is more suited to the size of the Sony mirrorless cameras, however, these units have a limited amount of power, about 2 stops worse than the larger brother, and this, in turn, will limit your capability with the speedlight. I’m personally not a huge fan of on camera flash, so I would avoid this option unless you intend using it as an on camera flash for travel where you need to keep the weight down. Long term, I think most users will outgrow the capability of the speedlight fairly quickly, so unless you’re a point and shoot photographer with no intentions of ever taking the flash off your camera, go for the V860 which I cover in the next section.\n\n&amp;#x200B;\n\nhttps://i.redd.it/aacqnammc0j21.jpg\n\nI would recommend the internal rechargeable over the AA version if you do go for this model. The recharge time between flashes is faster and the batteries can produce more full-powered flashes per charge. The version that comes with rechargeable batteries is more expensive for obvious reasons.\n\n#### Godox TT685S/V860iiS\n\nThe TT688S and X are the full powered speedlights Godox’s range offering a power output of 85ws, hence the 85 in the name. Whilst the 685 is large, it also offers what I consider the minimum acceptable power for any decent flash work.\n\nAs with the TT350, the 685 is offered in two different versions, an AA version, and a rechargeable version. The V860iiS goes for $189 whilst the TT685S goes for $110. As you can see from the pricing, there is only a small premium for the V860 over the V350 with a substantial power increase, and as a result, unless size is a constraint, I’d recommend buying the more powerful version.\n\n&amp;#x200B;\n\nhttps://i.redd.it/0fwkntinc0j21.jpg\n\nImportant note: The TT685 and V860ii are prone to hotshoe breaks for some obscure reason. If this does occur, hotshoes can be purchased separately and at a fairly low cost. I haven’t had to replace mine as I do not do much on-camera flash, but I’d recommend carrying a spare speedlight if you shoot weddings. For more information on replacing the hotshoe, have a look at this article and video.\n\n&gt;**Important note:** The larger Godox speedlights are known to have hotshoe breakage issues for people who use them heavily.  \nIf this occurs, you can buy replacement hotshoes on [EBay](https://www.ebay.com/itm/New-Hot-Shoe-mounting-foot-for-Godox-V860IIS-V860-S-Flash-Speedlite-repair-parts-/182728975320) or at your local Godox stockist. There are many videos that show the replacement process on [youtube](https://www.youtube.com/watch?v=jS5XKzbSvuo).\n\n### Strobe options (200WS+ options)\n\nGodox has a good range of strobes, but for the purpose of this, I’m going to focus on the battery-powered strobes which include the AD200, AD360, AD400 and AD600/AD600 Pro. The name indicates the power output of the strobe. I.e. the AD200 has 200ws of power whilst the AD600 has 600ws.\n\n#### Godox AD200\n\nThe AD200 is the most popular strobe from Godox due to the compact size and high-powered output. It’s provided in a case with both a fresnel and bulb head, along with a bracket to mount it on a light stand. If you are looking to get into off-camera flash, this is where I would start. It’s small, flexible and lightweight, and you can carry 3 with you without breaking a sweat. The AD200 retails for around US$300 without a trigger which is pretty reasonable.\n\n&amp;#x200B;\n\nhttps://i.redd.it/z5z2ohipc0j21.jpg\n\nBattery power on the AD200 is very good. I’ve used two of these in a forest with 4 fellow photographers and about 1,000 pops without draining the battery but ultimately it’s going to depend on the power output.\n\n&amp;#x200B;\n\nhttps://i.redd.it/1s80w83rc0j21.jpg\n\nOne of the great things with the AD200 is that Godox offer a bowens bracket with built in modelling lamp that allows you to combine two AD200’s into a single 400ws strobe. That gives you the flexibility of having a single AD400 and two AD200’s depending on what you are planning to do.\n\n&amp;#x200B;\n\nhttps://i.redd.it/kbanlhzrc0j21.jpg\n\n#### Godox AD400\n\nThe AD400 was released in 2018 and is new to the Godox lineup. It falls cleanly between the AD200 and AD600. The AD400 starts to bridge into a territory of being too large to carry around in your camera bag, due to the increased thickness which is twice as thick as the AD200.\n\nI don’t have hands-on experience with this model, but many of photographers I know that have purchased these love them.\n\nIn comparison to the AD600 Pro, I would question whether you will need 600WS of power. The AD400 should be sufficient for most situations. My Magbox review consisted of two AD200’s shooting into the sun and it was more than enough power to overpower the sun so it would have to be some pretty brutal light or a large softbox to need more than this.\n\n#### Godox AD600/AD600 Pro (available in TTL or Manual/HSS)\n\nThe AD600 and AD600 Pro models are the most powerful strobes in Godox’s lineup that consist of a built-in battery as opposed to an external battery pack. The pro version is a recent upgrade to the AD6oo and offers more stable colour temperature and faster recycle times. The AD600 series comes with a weight premium over the smaller models.\n\nThe AD600 (non-Pro) comes in a manual version which includes HSS, or a TTL version which includes HSS. They used to offer it in a unique Godox or Bowens mount, but the Godox mount seems to have been phased out in favour of Bowens mount. If you have the option of both, I’d recommend a TTL Bowens mount.\n\n&amp;#x200B;\n\nhttps://i.redd.it/ph1pksntc0j21.jpg\n\n#### Common Godox strobe accessories\n\nGodox offer some nice accessories for the AD series of strobes. These include extension cables to take the strobe bulb off the head of the strobe and extend it on a cable with the strobe unit becoming a battery pack. This is great for keeping weight off the head in stronger winds or when you have an assistant hand holding a softbox on a boom and they aren’t Superman.\n\n### Triggers\n\nGodox has two triggers which I have covered below. If you want to skip this section and know which to buy, buy the XPro S, it’s worth the additional cost over the X1S. If buying the XPro is going to mean you can feed yourself, get the X1, it’ll do most of what the XPro can do, but it’s not nearly as intuitive or well designed.\n\nThe Godox speedlights can also be used as triggers but I’d recommend using a dedicated trigger for usability reasons.\n\n#### Godox X1 S Trigger\n\nThe X1 is the original trigger from Godox. I had this when I was shooting Nikon, and when I shot with Fujifilm but switched to the XPro when it was released. It’s a good trigger, but with the availability of the XPro trigger, I wouldn’t recommend it for the simple reason that you can get a far better trigger for a minimal amount more and it is worth the difference.\n\nThe X1 trigger offers full control over the Godox tangle of speedlights and strobes with the ability to switch between manual and TTL and it’s capable of triggering HSS with compatible cameras.\n\n&amp;#x200B;\n\nhttps://i.redd.it/f454v99vc0j21.jpg\n\nWhilst the X1 is capable of doing the job, it has some small annoyances which is why I recommend the XPro:\n\n1. For one, the trigger sits flat on the hot shoe which limits access to some of the controls on the camera. This is less of an issue with Sony but with Fujifilm, the top dials were more critical.\n2. The second big annoyance is the rear dials one the trigger bump your head when looking through the viewfinder and are accidentally adjusted\n3. Usability is far worse – the XPro is more intuitive\n\n#### Godox XPro S Trigger\n\nThe XPro S is what I consider V2 of the X1 trigger and a far better design. In conjunction to the functionality offered with the X1 trigger, the XPro offers:\n\n1. TTL to Manual – The ability to take the current TTL settings and switch over to complete manual allowing you more control if you are not happy with some of the refinements in TTL. This reduces the requirement for a light meter.  \nSmaller increments\n2. From a usability perspective, the XPro wins heads and shoulders over the X1, it’s almost hard to compare the two, like a beta and a final version.\n3. You can zoom in so only the current group is shown on-screen if you aren’t using multiple groups\n4. The design offers more of a slanted upright view, ensuring the trigger is kept away from the controls and your forehead\n\n&amp;#x200B;\n\nhttps://i.redd.it/osytp12yc0j21.jpg\n\n### Receivers\n\nAll of the strobes and speedlights covered in this article have receivers built into the flash unit.\n\n### Do I buy TTL or Manual?\n\nThis will probably be controversial, but some of the seasoned professionals are going to tell you “don’t worry about TTL, no professional uses TTL”. I’m going to respectfully disagree with these people, many of whom have never actually shot with a TTL strobe. For them, it’s about the comfort of doing things they way they have always done and the discomfort with losing control, but like anything, technology changes and TTL has matured to a point where it is pro-ready. Think of it like mirrorless. The initial mirrorless cameras were basic consumer grade cameras, but now mirrorless is good enough for professional use and the same applies to TTL. Its matured and in many cases is capable of making decisions more accurately due to its ability to adapt to changing lighting conditions. Using TTL isn’t about losing control, you have the same level of control in dynamic situations. I.e. sun goes behind the clouds and all of a sudden, your lighting needs to change, but with TTL, it doesn’t.\n\nIn short, if you know enough about strobes to know what you need, buy whatever you want, if you don’t, buy the TTL version. Best case scenario, you buy TTL and don’t use it, worst case, you buy manual and need TTL and don’t have it.\n\n&gt;**Flash Basics: What is TTL?**  \nTTL (Through The Lens) is where the flash automatically decides how much exposure to use based on what it see’s through the lens. The idea is you set up the depth of field and shutter, and TTL will try ensure you get a perfectly exposed image. Here is a simple explanation of TTL on [youtube](https://youtu.be/VnU-QHIyp5o)\n\n### What Godox gear would I recommend buying?\n\nIf you’re an experience flash photographer you can probably skip this section because you should have a fair idea of what you need.\n\n* If you are on a limited budget and have no experience with the flash, you could start with the TT350 or V350, but overall, if your budget isn’t limited I’d recommend getting the V860ii instead because it is a little better from a future-proofing perspective.\n* If you want a recommended starting point for getting into off camera flash, I’d recommended starting point would be an AD200 and an XPro Trigger. This will give you a starting point with a powerful enough flash to grow into decent softboxes. It is also powerful enough to overpower the sun in many situations and can be doubled up with another one in a Godox supplied bracket for a 400ws strobe.\n* If you have a good budget, I’d say get a single AD600 Pro and two AD200’s or AD400’s, depending on how many lights you need. You could also get a V860ii which could double as a 4th light due to the interoperability of the lights.\n\n&gt;***Flash Basics: What about modifiers Should I buy?***   \n*Flash modifiers is a massive topic in itself – you could write an entire article dedicated to it. For the sake of keeping it simple, if you’re new to lighting, I’d recommend starting with the* [*40 or 60cm square softbox if you have a speedlight*](http://www.godox.com/EN/Products_S_type_Speedlite_Bracket.html)*, or an 80-90cm Octa (round) softbox if you are buying a strobe. My preference for larger softboxes is the Magbox or Rimelite due to the ease at which they can be set up but they also come with a big price premium. If you can’t afford these, a basic Godox model would be adequate.*\n\n# How to get going with flash on your Sony Gear\n\n## PRE-SETTINGS TO AVOID COMMON PROBLEMS\n\nWhen using the Godox system with your Sony camera, there are a couple of things you need to set up on your camera to avoid problems. I’ve tried to include reasons where possible:\n\n### Create a custom mode just for flash if you have one spare\n\nSony has the great functionality where you can create a whole set of custom settings which you can recall at any point in time. That saves you having to change the settings on a regular basis. There are a couple of settings you are more likely to only use during flash so having the ability to switch these over automatically for when you use flash will save you a lot of time every time you have to change these settings. If you want to know how to do it, check out this video from [Mark Galer](http://www.markgaler.com/) that covers the setup of custom modes or memory recalls. Mark Galer is a respected Sony Ambassador and has some great video tutorials on his site so I’d recommend having a look when you have time.\n\n### Switch off silent shooting\n\nGo to Camera Setting 2 (the camera with the 2 next to it), page 4/9 and the first option in the list will be silent shooting. You will need to switch off silent shooting. Flash doesn’t work with an electronic shutter so the Sony system will not trigger the flash if it’s switched on. Great for not annoying guests at weddings, terrible for flash work because your flash won’t actually work.\n\n&amp;#x200B;\n\nhttps://i.redd.it/aj4kh9c2d0j21.jpg\n\n### Switch off electronic front curtain shutter\n\nGo to Camera Setting 2 (the camera with the 2 next to it), page 4/9 and the second option in the list will be e-Front Curtain Shut. The front curtain shutter causes banding when used with HSS so its recommended that you switch off front curtain shutter and stick to mechanical when shooting flash.\n\n&amp;#x200B;\n\nhttps://i.redd.it/d58jvd64d0j21.jpg\n\n### Switch wireless off\n\nGo to Camera Setting 1 (the camera with the 1 next to it), page 11/14 entitled “Flash” and for the option called wireless and switch this off. The wireless option is for Sony’s wireless speedlight system, not the Godox system. I haven’t picked up any adverse reactions through having this on, but I have had speedlight issues so unless you are using Sony’s wireless system, turn it off.\n\n&amp;#x200B;\n\nhttps://i.redd.it/kke41rv5d0j21.jpg\n\n### Make sure the trigger or flash is seated properly\n\nOn occasion, you will encounter an issue where TTL or HSS won’t work but the flash seems to be triggering fine. More often than not, this is as a result of the flash not being seated correctly. When you seat the flash or trigger, take the time to make sure it’s seated properly.\n\n### Separate Exposure Compensation for Flash and Ambient\n\nGo to Camera Setting 1 (the camera with the 1 next to it), page 11/14 entitled “Flash” and for the option called Exp.comp.set ensure this is set to Ambient only. This is to separately the exposure compensation for ambient and flash because flash can be adjusted using the TTL settings on the flash or trigger and the ambient can be adjusted with the exposure compensation dial. Realistically you would have the ISO set to manual anyway, but in the beginning, this may not be the case.\n\n&amp;#x200B;\n\nhttps://i.redd.it/glmxron7d0j21.jpg\n\n&gt;***Flash Basics – Flash vs Ambient***  \n*If you don’t know the difference, flash is where the light from flash is impacting, ambient is everywhere the flash isn’t impacting. Imagine you are shooting a model in a forest; if you turn off the flash, that is ambient because the flash will only affect a portion of the photo. You need to be able to change this, because you may want to portray a scene as dark and moody with the highlight on the model, or just fill enough of the shadows to make it difficult to tell that flash was used. This is part of the creative process. The second issue is that the flash can sometimes impact ambient, so by separating these, you can change a setting without impacting the whole scene.*  \n*When you shoot flash, you need to adjust these independently if you aren’t in manual mode. Eventually you will be in manual and this won’t make a difference.*\n\n### Turn off Anti-Flicker Mode\n\nYes, I know it sounds strange but you have to turn off anti-flicker mode and there are some good reasons behind it. When you use anti-flicker, it interferes with the ability to turn the Shot Result Preview display on. I’ll cover why in the next point. Go to Camera Setting 1, Page 14/14 and turn anti-flicker off.\n\n### Assign Shot Result Preview to a button if you shoot flash regularly.\n\nGo to Camera Setting 2, 8/9 (Custom Operation1) and select the first option which is for photos. Assign Shot Result Display to a button, I normally use C1 which is right now the shutter button.\n\n&amp;#x200B;\n\nhttps://i.redd.it/qlkr8g0bd0j21.jpg\n\nShot Result Display preview is the functionality that allow you to see what the exposure looks like.  If you’re shooting indoors at f/8 1/250 and ISO100 with flash, the ambient is going to be pretty dark so you may not be able to see what you’re shooting. Sony cameras are smart – When they detect a flash they turn off the live preview and there is a good reason behind it so now you can see as if you were looking at a perfectly exposed photo.\n\nBut that’s a good and bad thing, because if you are shooting in a forest with a flash on the subject, you still want to see what the areas will look like that aren’t getting flash and to do that, you’re going to have to turn off the trigger the whole time, which may or may not cause some of the settings on the flashes to change. By assigning this to a button, you can switch it on the preview by holding down the button and it will show you what the ambient will look like for as long as you hold down the button.\n\n## HOW DO I SWITCH ON TTL?\n\nUsing TTL with the Godox system is relatively easy. All you have to do is setup the camera the way you want and then put on the flash or trigger, set the group to TTL and fire away. Provided you have changed the settings above, it should work.\n\nScroll through the wireless selection button (furthest right) and the mode button and the screen on the speedlight it should look like this:\n\n&amp;#x200B;\n\nhttps://i.redd.it/yqub1rhcd0j21.jpg\n\nOn the trigger, it should look like this depending on how many groups you have set up\n\n&amp;#x200B;\n\nhttps://i.redd.it/rh4nqrged0j21.jpg\n\nAdditional considerations for speedlights\n\nFor speedlights, it is important to ensure that they are in the correct receiver/trigger setup.\n\n* If you are using it on camera, it needs to be setup so the flash is in receiver mode. The screen of the V860ii will change between orange and green depending on the mode it is in. For on camera, it should be in green.\n* If you are using it wirelessly, ensure that it is in wireless receiver mode, and the group and channel are set correctly. The screen on the V860ii will be orange in this mode with a flashing wireless sign in the top left corner.\n\nIf it looks like this, it won’t work. This indicates it is being used as a controller.\n\n&amp;#x200B;\n\nhttps://i.redd.it/bfyvjotfd0j21.jpg\n\n&gt;**Flash basics: What are groups and channels in flash?**  \nGroups and channels are used to ensure that you can only trigger a specific set of speedlights or strobes and you can adjust the settings of individual strobes or groups of strobes.  \nLet’s take two hypothetical situations:  \nDifferent channel example: More than one person using wireless at the same location (a skateboard park as an example) – In this case you would use different channels to avoid interfering with each other if you were both using the same brand of lights because it is possible that he could trigger your lights  \nDifferent group example: Lets assume you are in a studio and you have 3 strobes setup. The one on the backdrop you may want at full power to make it white, the key light at half power and the hair light at one eighth power. To set the strobes up this way, you need to assign each to its own channel so you can adjust them independently.For more info on groups and channels, have a look at this [link](http://www.the-photography-blogger.com/groups-channels-flash-photography/).\n\n## HOW DO I SWITCH ON HSS?\n\nHSS can be switched on one of two ways, in manual or TTL. In TTL the HSS fires automatically when the shutter is higher than the sync speed which is 1/180 to 1/250 on most cameras.\n\nTo turn on HSS, click on the button assigned to sync and you will see a little bolt of lighting arrow with an H on it. You can see it below under the second “m” of the 24mm\n\n&amp;#x200B;\n\nhttps://i.redd.it/urczyuphd0j21.jpg\n\n&gt;**Flash Basics: What is HSS?**  \nHSS (High Speed Sync) is the ability to shoot photos faster than the sync speed of the camera and is typically used for action or photos where you are shooting into the sun with a shallow depth of field which requires a faster shutter. You can read more about it at this [link](https://www.exposureguide.com/high-speed-sync-flash/).\n\n## OTHER CONSIDERATIONS\n\n### Set ISO manually and understand your flash power\n\nThe problem with most flash systems is that TTL doesn’t use the full power of the flash. You can test easily by leaving auto ISO on and taking a photo with the flash bouncing off the ceiling.\n\nSet the camera to f/8, 1/250 and Auto ISO and take a photo with TTL. In a largish dark room, you will find the ISO rising to around 3200 or 6400.\n\nThen set your camera to f/8 1/250 and ISO100 and take a photo with TTL. The photo will likely be exposed at the same level (unless its a really large room, a small flash or a high ceiling) and yet, you have a much lower ISO.\n\nNow set the flash to manual and conduct the same exercise. If the flash photo is overexposed, it means the flash wasn’t using full power at ISO100. What this means is you have to be careful about the use of auto ISO.\n\nOne option if you’re not sure what ISO value to set based on the flash power is to set an acceptable level of ISO as a maximum, ISO800 as an example and let the camera push the ISO up to this maximum level. This will allow you some level of leeway without having to worry about the camera pushing the ISO up too high.\n\n## FREQUENTLY ASKED QUESTIONS:\n\n### I run two systems…will my Sony specific V860ii S or V350 S work with my Nikon/Canon/Fujifilm etc.\n\nYes and no. It will only work in manual mode for on-camera flash, but it will work with TTL and HSS if you have the appropriate trigger. I.e. Canon Trigger with Canon Camera.\n\n### Can the speedlight be used as a transmitter?\n\nYes, they can, but the interface isn’t that user-friendly. I’d recommend getting a dedicated trigger.\n\n### Do I need TTL?\n\nIf you are asking that question, then yes, I’d recommend getting TTL. Your learning curve will be much faster.\n\n### What lighting tutorials would you recommend?\n\nI’d recommend starting with youtube, it’s free. If you can’t find what you want, try [http://www.kelbyone.com](http://www.kelbyone.com/)and have a look at some of the education streams that take you from beginner all the way up.\n\n### Can I charge the V350 or V860 by the USB port?\n\nNo, it’s only for firmware. Batteries must be charged with the provided charger.\n\n### Where can I learn how to use individual speedlights or strobes from Godox?\n\nI’d recommend [Robert Hall](https://www.youtube.com/user/rrhallPD/videos) as a source for videos on individual Godox components. He has an [extensive library of videos](https://www.youtube.com/user/rrhallPD/videos) covering each of the speedlights and strobes.\n\n## KNOWN PROBLEMS\n\nI added this section after someone highlighted an error with the Godox V860 and I was able to validate it.\n\n### Sync speed issues over 1/250 with the A7riii (not sure if this occurs with other cameras) and the V860\n\nThe V860 seems to have an issue where the speedlight goes to full power when you have the speedlight on camera and the shutter goes to 1/250, even when HSS is set. If you use a wireless trigger, it seems to work fine with the same speedlight. I’ve confirmed this error and will let you know if this is resolved through a firmware update.", "link": "https://www.reddit.com/r/SonyAlpha/comments/av7014/using_godox_with_the_sony_a7iiia7riii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "using godox with the sony a7iii/a7riii /!/ i put together an instructional for using godox with sony so hopefully it helps people. i have the original on my site but i figured i would post this here so people don't have to go to the link.\n\n# introduction\n\ni’ve written this article as there seems to be a gap in the information provided by godox specific articles, videos and sony flash articles with specific reference to the godox system and how to use it with sony cameras. like any camera system, there are unique ways the lighting system works and this can be confusing for many people.\n\ni’ve noted this is specific to the a7iii and a7riii, however, this is due to these being the only two sony cameras i have. as a result, i can’t test it across the entire range of sony cameras. it may or may not be applicable, feel free to try it out, it won’t break anything.\n\ni will also try to update this article as time goes on, but if you feel anything is wrong here, please feel free to let me know, either via the comments or email. i might have missed something while writing it. if you know of any additional cameras from sony that would be supported in the same way and you can validate they work, let me know and i’ll update the article to reflect compatibility.\n\n&gt;***note****: godox do rebrand their gear under a number of names, so this should also be applicable to flashpoint, neewer, adorama and cheetah although i can’t tell you the exact models*\n\ni’ve tried to cover an overview of the most commonly used godox gear first, along with some recommendations on what i believe are the best first purchases if you plan on buying into the godox system with sony. after the gear port of the article, i’ve moved straight into the use with sony, so feel free to skip the gear section if you feel this is irrelevant.\n\n## flash basics\n\nwhen i wrote this article, i realised that the audience in some cases may be new to flash. as a result, i’ve included fairly basic descriptions of what i consider “flash basics” at certain points in the article. these will be relevant to a specific area i am writing about and will help extend the knowledge for a novice. these are not comprehensive detailed descriptions so you may need to research these further if you don’t understand. they are areas that more experienced photographers will already know and as a result, to avoid boring the crap out of the more experienced photographers, i’ve included these in a box entitled “flash basics”. an example of a subject i am talking about is “what is flash vs ambient”. in some cases, i’ve written a short description, in others, i’ve just pointed to a video that covers these areas well enough that it’s pointless me writing about it.\n\nif you are someone who has used flash extensively, feel free to ignore them, and i’ve put them in blocks to make it easier to identify them. they have a bolded “flash basics” that looks like this:\n\n&gt;***flash basics: sample***  \n*this is a sample example of flash basics description*\n\n# an overview of godox speedlights, strobes and triggers\n\none of the greatest advantages of the godox system is the ability to mix and match speedlights and strobes with a variety of camera systems, along with the low-cost entry point for people looking to experiment or start using lighting for the first time. many of the strobe brands do not manufacture speedlights and many speedlight brands do not manufacture strobes. godox (along with profoto) is one of the few to provide both options. i’ve tried to cover all speedlights, strobes, and triggers here, and i will continue to update these as time goes on, and new models arrive, but please understand i’m not planning to buy every speedlight and strobe they manufacture so my hands-on experience with some models may be limited.  i have not covered the non-battery studio models of their strobe lineup.\n\n&gt;***flash basics – speedlights vs strobes***  \n*the difference between these two has always been blurred, more so in recent years. do a search on google and you’ll find 5 different definitions. some people consider the difference to be the power output; others whether it has a cable or battery, for some it’s whether it has a fresnel or globe head.*  \n*i couldn’t find any definitive definition which is part of the challenge. as a result, lets assume for the sake of this article that a speedlight is a lightweight flash that can be used on camera and the strobe is a high-powered flash designed to be used off camera. it’s not to say you can’t put a speedlight off camera, but you can’t put a strobe on camera.*\n\n### speedlight options\n\nwith godox’s speedlight lineup, there are only 2 sizes for godox, each with sub-options. you have a small low powered flash and a larger full powered flash. for each of these, there is a sub option with aa batteries or a godox rechargeable battery option, but they’re essentially the same or similar model with different battery options/\n\ntypically in the speedlight range, a tt version is an aa battery version and a v version is one supplied with a rechargeable battery.  in the case of some (like the tt350/v350), the names match however with the v860 and tt685, they don’t…don’t ask me why. the s indicates sony version, although they are compatible with other cameras if used with the brand specific trigger. i.e. you can trigger a sony flash on a fujifilm camera with a fujifilm trigger.\n\n#### godox tt350s/v350s\n\nthe godox tt350s and v350s are similar the same unit, however, the v350s version comes with a battery and charger whilst the tt350s uses 2 aa batteries. the v350s goes for $159 and the tt350s goes for $89.\n\nthe small flash is more suited to the size of the sony mirrorless cameras, however, these units have a limited amount of power, about 2 stops worse than the larger brother, and this, in turn, will limit your capability with the speedlight. i’m personally not a huge fan of on camera flash, so i would avoid this option unless you intend using it as an on camera flash for travel where you need to keep the weight down. long term, i think most users will outgrow the capability of the speedlight fairly quickly, so unless you’re a point and shoot photographer with no intentions of ever taking the flash off your camera, go for the v860 which i cover in the next section.\n\n&amp;#x200b;\n\nhttps://i.redd.it/aacqnammc0j21.jpg\n\ni would recommend the internal rechargeable over the aa version if you do go for this model. the recharge time between flashes is faster and the batteries can produce more full-powered flashes per charge. the version that comes with rechargeable batteries is more expensive for obvious reasons.\n\n#### godox tt685s/v860iis\n\nthe tt688s and x are the full powered speedlights godox’s range offering a power output of 85ws, hence the 85 in the name. whilst the 685 is large, it also offers what i consider the minimum acceptable power for any decent flash work.\n\nas with the tt350, the 685 is offered in two different versions, an aa version, and a rechargeable version. the v860iis goes for $189 whilst the tt685s goes for $110. as you can see from the pricing, there is only a small premium for the v860 over the v350 with a substantial power increase, and as a result, unless size is a constraint, i’d recommend buying the more powerful version.\n\n&amp;#x200b;\n\nhttps://i.redd.it/0fwkntinc0j21.jpg\n\nimportant note: the tt685 and v860ii are prone to hotshoe breaks for some obscure reason. if this does occur, hotshoes can be purchased separately and at a fairly low cost. i haven’t had to replace mine as i do not do much on-camera flash, but i’d recommend carrying a spare speedlight if you shoot weddings. for more information on replacing the hotshoe, have a look at this article and video.\n\n&gt;**important note:** the larger godox speedlights are known to have hotshoe breakage issues for people who use them heavily.  \nif this occurs, you can buy replacement hotshoes on [ebay](https://www.ebay.com/itm/new-hot-shoe-mounting-foot-for-godox-v860iis-v860-s-flash-speedlite-repair-parts-/182728975320) or at your local godox stockist. there are many videos that show the replacement process on [youtube](https://www.youtube.com/watch?v=js5xkzbsvuo).\n\n### strobe options (200ws+ options)\n\ngodox has a good range of strobes, but for the purpose of this, i’m going to focus on the battery-powered strobes which include the ad200, ad360, ad400 and ad600/ad600 pro. the name indicates the power output of the strobe. i.e. the ad200 has 200ws of power whilst the ad600 has 600ws.\n\n#### godox ad200\n\nthe ad200 is the most popular strobe from godox due to the compact size and high-powered output. it’s provided in a case with both a fresnel and bulb head, along with a bracket to mount it on a light stand. if you are looking to get into off-camera flash, this is where i would start. it’s small, flexible and lightweight, and you can carry 3 with you without breaking a sweat. the ad200 retails for around us$300 without a trigger which is pretty reasonable.\n\n&amp;#x200b;\n\nhttps://i.redd.it/z5z2ohipc0j21.jpg\n\nbattery power on the ad200 is very good. i’ve used two of these in a forest with 4 fellow photographers and about 1,000 pops without draining the battery but ultimately it’s going to depend on the power output.\n\n&amp;#x200b;\n\nhttps://i.redd.it/1s80w83rc0j21.jpg\n\none of the great things with the ad200 is that godox offer a bowens bracket with built in modelling lamp that allows you to combine two ad200’s into a single 400ws strobe. that gives you the flexibility of having a single ad400 and two ad200’s depending on what you are planning to do.\n\n&amp;#x200b;\n\nhttps://i.redd.it/kbanlhzrc0j21.jpg\n\n#### godox ad400\n\nthe ad400 was released in 2018 and is new to the godox lineup. it falls cleanly between the ad200 and ad600. the ad400 starts to bridge into a territory of being too large to carry around in your camera bag, due to the increased thickness which is twice as thick as the ad200.\n\ni don’t have hands-on experience with this model, but many of photographers i know that have purchased these love them.\n\nin comparison to the ad600 pro, i would question whether you will need 600ws of power. the ad400 should be sufficient for most situations. my magbox review consisted of two ad200’s shooting into the sun and it was more than enough power to overpower the sun so it would have to be some pretty brutal light or a large softbox to need more than this.\n\n#### godox ad600/ad600 pro (available in ttl or manual/hss)\n\nthe ad600 and ad600 pro models are the most powerful strobes in godox’s lineup that consist of a built-in battery as opposed to an external battery pack. the pro version is a recent upgrade to the ad6oo and offers more stable colour temperature and faster recycle times. the ad600 series comes with a weight premium over the smaller models.\n\nthe ad600 (non-pro) comes in a manual version which includes hss, or a ttl version which includes hss. they used to offer it in a unique godox or bowens mount, but the godox mount seems to have been phased out in favour of bowens mount. if you have the option of both, i’d recommend a ttl bowens mount.\n\n&amp;#x200b;\n\nhttps://i.redd.it/ph1pksntc0j21.jpg\n\n#### common godox strobe accessories\n\ngodox offer some nice accessories for the ad series of strobes. these include extension cables to take the strobe bulb off the head of the strobe and extend it on a cable with the strobe unit becoming a battery pack. this is great for keeping weight off the head in stronger winds or when you have an assistant hand holding a softbox on a boom and they aren’t superman.\n\n### triggers\n\ngodox has two triggers which i have covered below. if you want to skip this section and know which to buy, buy the xpro s, it’s worth the additional cost over the x1s. if buying the xpro is going to mean you can feed yourself, get the x1, it’ll do most of what the xpro can do, but it’s not nearly as intuitive or well designed.\n\nthe godox speedlights can also be used as triggers but i’d recommend using a dedicated trigger for usability reasons.\n\n#### godox x1 s trigger\n\nthe x1 is the original trigger from godox. i had this when i was shooting nikon, and when i shot with fujifilm but switched to the xpro when it was released. it’s a good trigger, but with the availability of the xpro trigger, i wouldn’t recommend it for the simple reason that you can get a far better trigger for a minimal amount more and it is worth the difference.\n\nthe x1 trigger offers full control over the godox tangle of speedlights and strobes with the ability to switch between manual and ttl and it’s capable of triggering hss with compatible cameras.\n\n&amp;#x200b;\n\nhttps://i.redd.it/f454v99vc0j21.jpg\n\nwhilst the x1 is capable of doing the job, it has some small annoyances which is why i recommend the xpro:\n\n1. for one, the trigger sits flat on the hot shoe which limits access to some of the controls on the camera. this is less of an issue with sony but with fujifilm, the top dials were more critical.\n2. the second big annoyance is the rear dials one the trigger bump your head when looking through the viewfinder and are accidentally adjusted\n3. usability is far worse – the xpro is more intuitive\n\n#### godox xpro s trigger\n\nthe xpro s is what i consider v2 of the x1 trigger and a far better design. in conjunction to the functionality offered with the x1 trigger, the xpro offers:\n\n1. ttl to manual – the ability to take the current ttl settings and switch over to complete manual allowing you more control if you are not happy with some of the refinements in ttl. this reduces the requirement for a light meter.  \nsmaller increments\n2. from a usability perspective, the xpro wins heads and shoulders over the x1, it’s almost hard to compare the two, like a beta and a final version.\n3. you can zoom in so only the current group is shown on-screen if you aren’t using multiple groups\n4. the design offers more of a slanted upright view, ensuring the trigger is kept away from the controls and your forehead\n\n&amp;#x200b;\n\nhttps://i.redd.it/osytp12yc0j21.jpg\n\n### receivers\n\nall of the strobes and speedlights covered in this article have receivers built into the flash unit.\n\n### do i buy ttl or manual?\n\nthis will probably be controversial, but some of the seasoned professionals are going to tell you “don’t worry about ttl, no professional uses ttl”. i’m going to respectfully disagree with these people, many of whom have never actually shot with a ttl strobe. for them, it’s about the comfort of doing things they way they have always done and the discomfort with losing control, but like anything, technology changes and ttl has matured to a point where it is pro-ready. think of it like mirrorless. the initial mirrorless cameras were basic consumer grade cameras, but now mirrorless is good enough for professional use and the same applies to ttl. its matured and in many cases is capable of making decisions more accurately due to its ability to adapt to changing lighting conditions. using ttl isn’t about losing control, you have the same level of control in dynamic situations. i.e. sun goes behind the clouds and all of a sudden, your lighting needs to change, but with ttl, it doesn’t.\n\nin short, if you know enough about strobes to know what you need, buy whatever you want, if you don’t, buy the ttl version. best case scenario, you buy ttl and don’t use it, worst case, you buy manual and need ttl and don’t have it.\n\n&gt;**flash basics: what is ttl?**  \nttl (through the lens) is where the flash automatically decides how much exposure to use based on what it see’s through the lens. the idea is you set up the depth of field and shutter, and ttl will try ensure you get a perfectly exposed image. here is a simple explanation of ttl on [youtube](https://youtu.be/vnu-qhiyp5o)\n\n### what godox gear would i recommend buying?\n\nif you’re an experience flash photographer you can probably skip this section because you should have a fair idea of what you need.\n\n* if you are on a limited budget and have no experience with the flash, you could start with the tt350 or v350, but overall, if your budget isn’t limited i’d recommend getting the v860ii instead because it is a little better from a future-proofing perspective.\n* if you want a recommended starting point for getting into off camera flash, i’d recommended starting point would be an ad200 and an xpro trigger. this will give you a starting point with a powerful enough flash to grow into decent softboxes. it is also powerful enough to overpower the sun in many situations and can be doubled up with another one in a godox supplied bracket for a 400ws strobe.\n* if you have a good budget, i’d say get a single ad600 pro and two ad200’s or ad400’s, depending on how many lights you need. you could also get a v860ii which could double as a 4th light due to the interoperability of the lights.\n\n&gt;***flash basics: what about modifiers should i buy?***   \n*flash modifiers is a massive topic in itself – you could write an entire article dedicated to it. for the sake of keeping it simple, if you’re new to lighting, i’d recommend starting with the* [*40 or 60cm square softbox if you have a speedlight*](http://www.godox.com/en/products_s_type_speedlite_bracket.html)*, or an 80-90cm octa (round) softbox if you are buying a strobe. my preference for larger softboxes is the magbox or rimelite due to the ease at which they can be set up but they also come with a big price premium. if you can’t afford these, a basic godox model would be adequate.*\n\n# how to get going with flash on your sony gear\n\n## pre-settings to avoid common problems\n\nwhen using the godox system with your sony camera, there are a couple of things you need to set up on your camera to avoid problems. i’ve tried to include reasons where possible:\n\n### create a custom mode just for flash if you have one spare\n\nsony has the great functionality where you can create a whole set of custom settings which you can recall at any point in time. that saves you having to change the settings on a regular basis. there are a couple of settings you are more likely to only use during flash so having the ability to switch these over automatically for when you use flash will save you a lot of time every time you have to change these settings. if you want to know how to do it, check out this video from [mark galer](http://www.markgaler.com/) that covers the setup of custom modes or memory recalls. mark galer is a respected sony ambassador and has some great video tutorials on his site so i’d recommend having a look when you have time.\n\n### switch off silent shooting\n\ngo to camera setting 2 (the camera with the 2 next to it), page 4/9 and the first option in the list will be silent shooting. you will need to switch off silent shooting. flash doesn’t work with an electronic shutter so the sony system will not trigger the flash if it’s switched on. great for not annoying guests at weddings, terrible for flash work because your flash won’t actually work.\n\n&amp;#x200b;\n\nhttps://i.redd.it/aj4kh9c2d0j21.jpg\n\n### switch off electronic front curtain shutter\n\ngo to camera setting 2 (the camera with the 2 next to it), page 4/9 and the second option in the list will be e-front curtain shut. the front curtain shutter causes banding when used with hss so its recommended that you switch off front curtain shutter and stick to mechanical when shooting flash.\n\n&amp;#x200b;\n\nhttps://i.redd.it/d58jvd64d0j21.jpg\n\n### switch wireless off\n\ngo to camera setting 1 (the camera with the 1 next to it), page 11/14 entitled “flash” and for the option called wireless and switch this off. the wireless option is for sony’s wireless speedlight system, not the godox system. i haven’t picked up any adverse reactions through having this on, but i have had speedlight issues so unless you are using sony’s wireless system, turn it off.\n\n&amp;#x200b;\n\nhttps://i.redd.it/kke41rv5d0j21.jpg\n\n### make sure the trigger or flash is seated properly\n\non occasion, you will encounter an issue where ttl or hss won’t work but the flash seems to be triggering fine. more often than not, this is as a result of the flash not being seated correctly. when you seat the flash or trigger, take the time to make sure it’s seated properly.\n\n### separate exposure compensation for flash and ambient\n\ngo to camera setting 1 (the camera with the 1 next to it), page 11/14 entitled “flash” and for the option called exp.comp.set ensure this is set to ambient only. this is to separately the exposure compensation for ambient and flash because flash can be adjusted using the ttl settings on the flash or trigger and the ambient can be adjusted with the exposure compensation dial. realistically you would have the iso set to manual anyway, but in the beginning, this may not be the case.\n\n&amp;#x200b;\n\nhttps://i.redd.it/glmxron7d0j21.jpg\n\n&gt;***flash basics – flash vs ambient***  \n*if you don’t know the difference, flash is where the light from flash is impacting, ambient is everywhere the flash isn’t impacting. imagine you are shooting a model in a forest; if you turn off the flash, that is ambient because the flash will only affect a portion of the photo. you need to be able to change this, because you may want to portray a scene as dark and moody with the highlight on the model, or just fill enough of the shadows to make it difficult to tell that flash was used. this is part of the creative process. the second issue is that the flash can sometimes impact ambient, so by separating these, you can change a setting without impacting the whole scene.*  \n*when you shoot flash, you need to adjust these independently if you aren’t in manual mode. eventually you will be in manual and this won’t make a difference.*\n\n### turn off anti-flicker mode\n\nyes, i know it sounds strange but you have to turn off anti-flicker mode and there are some good reasons behind it. when you use anti-flicker, it interferes with the ability to turn the shot result preview display on. i’ll cover why in the next point. go to camera setting 1, page 14/14 and turn anti-flicker off.\n\n### assign shot result preview to a button if you shoot flash regularly.\n\ngo to camera setting 2, 8/9 (custom operation1) and select the first option which is for photos. assign shot result display to a button, i normally use c1 which is right now the shutter button.\n\n&amp;#x200b;\n\nhttps://i.redd.it/qlkr8g0bd0j21.jpg\n\nshot result display preview is the functionality that allow you to see what the exposure looks like.  if you’re shooting indoors at f/8 1/250 and iso100 with flash, the ambient is going to be pretty dark so you may not be able to see what you’re shooting. sony cameras are smart – when they detect a flash they turn off the live preview and there is a good reason behind it so now you can see as if you were looking at a perfectly exposed photo.\n\nbut that’s a good and bad thing, because if you are shooting in a forest with a flash on the subject, you still want to see what the areas will look like that aren’t getting flash and to do that, you’re going to have to turn off the trigger the whole time, which may or may not cause some of the settings on the flashes to change. by assigning this to a button, you can switch it on the preview by holding down the button and it will show you what the ambient will look like for as long as you hold down the button.\n\n## how do i switch on ttl?\n\nusing ttl with the godox system is relatively easy. all you have to do is setup the camera the way you want and then put on the flash or trigger, set the group to ttl and fire away. provided you have changed the settings above, it should work.\n\nscroll through the wireless selection button (furthest right) and the mode button and the screen on the speedlight it should look like this:\n\n&amp;#x200b;\n\nhttps://i.redd.it/yqub1rhcd0j21.jpg\n\non the trigger, it should look like this depending on how many groups you have set up\n\n&amp;#x200b;\n\nhttps://i.redd.it/rh4nqrged0j21.jpg\n\nadditional considerations for speedlights\n\nfor speedlights, it is important to ensure that they are in the correct receiver/trigger setup.\n\n* if you are using it on camera, it needs to be setup so the flash is in receiver mode. the screen of the v860ii will change between orange and green depending on the mode it is in. for on camera, it should be in green.\n* if you are using it wirelessly, ensure that it is in wireless receiver mode, and the group and channel are set correctly. the screen on the v860ii will be orange in this mode with a flashing wireless sign in the top left corner.\n\nif it looks like this, it won’t work. this indicates it is being used as a controller.\n\n&amp;#x200b;\n\nhttps://i.redd.it/bfyvjotfd0j21.jpg\n\n&gt;**flash basics: what are groups and channels in flash?**  \ngroups and channels are used to ensure that you can only trigger a specific set of speedlights or strobes and you can adjust the settings of individual strobes or groups of strobes.  \nlet’s take two hypothetical situations:  \ndifferent channel example: more than one person using wireless at the same -----> location !!!  (a skateboard park as an example) – in this case you would use different channels to avoid interfering with each other if you were both using the same brand of lights because it is possible that he could trigger your lights  \ndifferent group example: lets assume you are in a studio and you have 3 strobes setup. the one on the backdrop you may want at full power to make it white, the key light at half power and the hair light at one eighth power. to set the strobes up this way, you need to assign each to its own channel so you can adjust them independently.for more info on groups and channels, have a look at this [link](http://www.the-photography-blogger.com/groups-channels-flash-photography/).\n\n## how do i switch on hss?\n\nhss can be switched on one of two ways, in manual or ttl. in ttl the hss fires automatically when the shutter is higher than the sync speed which is 1/180 to 1/250 on most cameras.\n\nto turn on hss, click on the button assigned to sync and you will see a little bolt of lighting arrow with an h on it. you can see it below under the second “m” of the 24mm\n\n&amp;#x200b;\n\nhttps://i.redd.it/urczyuphd0j21.jpg\n\n&gt;**flash basics: what is hss?**  \nhss (high speed sync) is the ability to shoot photos faster than the sync speed of the camera and is typically used for action or photos where you are shooting into the sun with a shallow depth of field which requires a faster shutter. you can read more about it at this [link](https://www.exposureguide.com/high-speed-sync-flash/).\n\n## other considerations\n\n### set iso manually and understand your flash power\n\nthe problem with most flash systems is that ttl doesn’t use the full power of the flash. you can test easily by leaving auto iso on and taking a photo with the flash bouncing off the ceiling.\n\nset the camera to f/8, 1/250 and auto iso and take a photo with ttl. in a largish dark room, you will find the iso rising to around 3200 or 6400.\n\nthen set your camera to f/8 1/250 and iso100 and take a photo with ttl. the photo will likely be exposed at the same level (unless its a really large room, a small flash or a high ceiling) and yet, you have a much lower iso.\n\nnow set the flash to manual and conduct the same exercise. if the flash photo is overexposed, it means the flash wasn’t using full power at iso100. what this means is you have to be careful about the use of auto iso.\n\none option if you’re not sure what iso value to set based on the flash power is to set an acceptable level of iso as a maximum, iso800 as an example and let the camera push the iso up to this maximum level. this will allow you some level of leeway without having to worry about the camera pushing the iso up too high.\n\n## frequently asked questions:\n\n### i run two systems…will my sony specific v860ii s or v350 s work with my nikon/canon/fujifilm etc.\n\nyes and no. it will only work in manual mode for on-camera flash, but it will work with ttl and hss if you have the appropriate trigger. i.e. canon trigger with canon camera.\n\n### can the speedlight be used as a transmitter?\n\nyes, they can, but the interface isn’t that user-friendly. i’d recommend getting a dedicated trigger.\n\n### do i need ttl?\n\nif you are asking that question, then yes, i’d recommend getting ttl. your learning curve will be much faster.\n\n### what lighting tutorials would you recommend?\n\ni’d recommend starting with youtube, it’s free. if you can’t find what you want, try [http://www.kelbyone.com](http://www.kelbyone.com/)and have a look at some of the education streams that take you from beginner all the way up.\n\n### can i charge the v350 or v860 by the usb port?\n\nno, it’s only for firmware. batteries must be charged with the provided charger.\n\n### where can i learn how to use individual speedlights or strobes from godox?\n\ni’d recommend [robert hall](https://www.youtube.com/user/rrhallpd/videos) as a source for videos on individual godox components. he has an [extensive library of videos](https://www.youtube.com/user/rrhallpd/videos) covering each of the speedlights and strobes.\n\n## known problems\n\ni added this section after someone highlighted an error with the godox v860 and i was able to validate it.\n\n### sync speed issues over 1/250 with the a7riii (not sure if this occurs with other cameras) and the v860\n\nthe v860 seems to have an issue where the speedlight goes to full power when you have the speedlight on camera and the shutter goes to 1/250, even when hss is set. if you use a wireless trigger, it seems to work fine with the same speedlight. i’ve confirmed this error and will let you know if this is resolved through a firmware update.", "sortedWord": "None", "identifyer": 22318, "year": "2019"}], "name": "locationSonyAlpha2019"}