{"interestingcomments": [{"Unnamed: 0": 134329, "autor": "DeadInFiftyYears", "date": 1619850294000, "content": "A7C vs A7S3 for video /!/ I've seen quite a few reviews online comparing these two cameras.  Fortunately, rather than taking one side or the other, I happen to own both, and can speak objectively to their pros and cons.\n\nFirst, let's talk about what the A7C does as well or better than the A7S3.  The A7C is a smaller camera.  The range-style viewfinder is more compact and factors into that smaller overall size.  Maybe you don't even use the viewfinder in your application, in which case you'll definitely appreciate that it isn't making a significant addition to bulk and heft, as the viewfinder does for other cameras in the A7 lineup.  The A7C also has a higher photo resolution, at 24MP - vs 12MP on the A7S3 - which makes it a better hybrid/multi-use camera.  If shooting in reasonable lighting conditions, the picture quality produced by the A7C is close enough to parity with the A7S3 that you probably won't be able to notice a difference.  Finally - and maybe most importantly to some - the A7C is also roughly only half the price of the A7S3, despite still being a full-frame camera, that can shoot high-quality 4K video.\n\nSo with those things in mind, it might seem like a waste to pay double for the bulkier A7S3.  And for many, the A7S3 won't be worth it.  But, there are a number of things the A7S3 does better than the A7C, and they may matter to you.  Let's start with some of the more obvious/well known ones, and work our way down from there.\n\nWhile the A7C can shoot 4K video at 24 or 30 FPS, the A7S3 also has 60 and 120 FPS options available - especially useful for shooting slo-mo clips.  The A7S3 supports shooting 4K video with 10-bit color, whereas the A7C only supports 8-bit.  This mostly matters if there is a lot of dynamic range in the video you're shooting, and especially if you'd like to shoot using some variant of S-Log color for more color-correction flexibility in post.\n\nAnd while the A7C does quite well in low light, the A7S3, with its 12MP full-frame sensor - and referred to by various titles along the lines of the \"king of darkness\" - is even better; maybe the best modern camera available today for extremely low-light, and can produce usable video in lower light than you would likely feel comfortable walking around in. Also, while the A7C does pretty well on 4K video recording runtime when set to high-temperature mode, the A7S3 does significantly better still in this category - which for some will be the very most important and deciding feature.\n\nThe A7S3's viewfinder is significantly better, in both a more ergonomically friendly location, and sporting a significantly higher resolution.  The A7S3 has four custom buttons vs the A7C's single custom button - actually the A7S3 has more like 5 customizable buttons on the body if you count the also-customizable AEL button.  Five vs one is a big difference.  The longer you use the camera and the more comfortable you get with it, the more you care about those custom buttons - which can be mapped to things like the extremely-useful focus assist, white balance adjustment, etc.\n\nThe A7S3 also has a front dial - typically mapped to aperture - and a joystick - typically used for adjusting the autofocus focus point.  The A7C has neither of those.  The new menu system on the A7S3, in addition to being more convenient to use - and supporting direct touch input - also supports customizing the default back dial rotation function, which I have set to control ISO.  Being able to control ISO outside of the function menu, makes it convenient to adjust to match against the exposure meter, and without having to tie up any other custom buttons - I haven't been able to figure out a way to make a similar configuration on the A7C (let me know if it exists).\n\nOne that seems to be relatively hidden/hasn't been called out in videos by anyone that I know of - the A7S3 allows for temporarily activating autofocus while in manual focus mode by pressing the AF-ON button.  If you try the same on the A7C, it will display a message saying that AF is disabled when in MF mode. \n\nOn the other hand, one feature that I haven't been able to find on the A7S3 that is available on the A7C, is automatically activating focus assist when adjusting the focus wheel on supported lenses.  You can save mapping it to a custom button that way, by having focus assist automatically activate on adjustment of the focus wheel, and then automatically turn itself back off when you leave the wheel alone for a couple seconds.\n\nThe A7S3 also has two memory card slots vs the A7C's single slot, with the capability to allow swapping of the non-active card during continuous filming, and a full-size HDMI port for a more robust connection vs the A7C's micro-HDMI.  Those memory slots on the A7S3 - in addition to supporting regular high-speed SD cards like the A7C - also support CF Express Type A cards that can handle a higher bitrate; but they are only really needed for 4K@60 and 4K@120 video which the A7C doesn't support anyway.  The A7S3 also supports active image stabilization in camera vs. only passive stabilization in the A7C - though both support stabilizing in post using Catalyst Browse, which is even better, but requires the aforementioned post step, and works best with higher shutter speeds than you'd normally use, so you may end up needing to also add in motion blur in post as well - yet another step.\n\nIn my typical setup, the A7C is used in conjunction with a gimbal, where the lack of custom buttons, missing front dial, and lesser viewfinder are non-issues, and the smaller size/weight is a bonus.  The A7S3 I use handheld, where the better viewfinder, custom buttons, etc., are very useful.  So I like them both; they each have their niche in my setup.", "link": "https://www.reddit.com/r/SonyAlpha/comments/n2cq8w/a7c_vs_a7s3_for_video/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a7c vs a7s3 for video /!/ i've seen quite a few reviews online comparing these two cameras.  fortunately, rather than taking one side or the other, i happen to own both, and can speak objectively to their pros and cons.\n\nfirst, let's talk about what the a7c does as well or better than the a7s3.  the a7c is a smaller camera.  the range-style viewfinder is more compact and factors into that smaller overall size.  maybe you don't even use the viewfinder in your application, in which case you'll definitely appreciate that it isn't making a significant addition to bulk and heft, as the viewfinder does for other cameras in the a7 lineup.  the a7c also has a higher photo resolution, at 24mp - vs 12mp on the a7s3 - which makes it a better hybrid/multi-use camera.  if shooting in reasonable lighting conditions, the picture quality produced by the a7c is close enough to parity with the a7s3 that you probably won't be able to notice a difference.  finally - and maybe most importantly to some - the a7c is also roughly only half the price of the a7s3, despite still being a full-frame camera, that can shoot high-quality 4k video.\n\nso with those things in mind, it might seem like a waste to pay double for the bulkier a7s3.  and for many, the a7s3 won't be worth it.  but, there are a number of things the a7s3 does better than the a7c, and they may matter to you.  let's start with some of the more obvious/well known ones, and work our way down from there.\n\nwhile the a7c can shoot 4k video at 24 or 30 fps, the a7s3 also has 60 and 120 fps options available - especially useful for shooting slo-mo clips.  the a7s3 supports shooting 4k video with 10-bit color, whereas the a7c only supports 8-bit.  this mostly matters if there is a lot of dynamic range in the video you're shooting, and especially if you'd like to shoot using some variant of s-log color for more color-correction flexibility in post.\n\nand while the a7c does quite well in low light, the a7s3, with its 12mp full-frame sensor - and referred to by various titles along the lines of the \"king of darkness\" - is even better; maybe the best modern camera available today for extremely low-light, and can produce usable video in lower light than you would likely feel comfortable walking around in. also, while the a7c does pretty well on 4k video recording runtime when set to high-temperature mode, the a7s3 does significantly better still in this category - which for some will be the very most important and deciding feature.\n\nthe a7s3's viewfinder is significantly better, in both a more ergonomically friendly -----> location !!! , and sporting a significantly higher resolution.  the a7s3 has four custom buttons vs the a7c's single custom button - actually the a7s3 has more like 5 customizable buttons on the body if you count the also-customizable ael button.  five vs one is a big difference.  the longer you use the camera and the more comfortable you get with it, the more you care about those custom buttons - which can be mapped to things like the extremely-useful focus assist, white balance adjustment, etc.\n\nthe a7s3 also has a front dial - typically mapped to aperture - and a joystick - typically used for adjusting the autofocus focus point.  the a7c has neither of those.  the new menu system on the a7s3, in addition to being more convenient to use - and supporting direct touch input - also supports customizing the default back dial rotation function, which i have set to control iso.  being able to control iso outside of the function menu, makes it convenient to adjust to match against the exposure meter, and without having to tie up any other custom buttons - i haven't been able to figure out a way to make a similar configuration on the a7c (let me know if it exists).\n\none that seems to be relatively hidden/hasn't been called out in videos by anyone that i know of - the a7s3 allows for temporarily activating autofocus while in manual focus mode by pressing the af-on button.  if you try the same on the a7c, it will display a message saying that af is disabled when in mf mode. \n\non the other hand, one feature that i haven't been able to find on the a7s3 that is available on the a7c, is automatically activating focus assist when adjusting the focus wheel on supported lenses.  you can save mapping it to a custom button that way, by having focus assist automatically activate on adjustment of the focus wheel, and then automatically turn itself back off when you leave the wheel alone for a couple seconds.\n\nthe a7s3 also has two memory card slots vs the a7c's single slot, with the capability to allow swapping of the non-active card during continuous filming, and a full-size hdmi port for a more robust connection vs the a7c's micro-hdmi.  those memory slots on the a7s3 - in addition to supporting regular high-speed sd cards like the a7c - also support cf express type a cards that can handle a higher bitrate; but they are only really needed for 4k@60 and 4k@120 video which the a7c doesn't support anyway.  the a7s3 also supports active image stabilization in camera vs. only passive stabilization in the a7c - though both support stabilizing in post using catalyst browse, which is even better, but requires the aforementioned post step, and works best with higher shutter speeds than you'd normally use, so you may end up needing to also add in motion blur in post as well - yet another step.\n\nin my typical setup, the a7c is used in conjunction with a gimbal, where the lack of custom buttons, missing front dial, and lesser viewfinder are non-issues, and the smaller size/weight is a bonus.  the a7s3 i use handheld, where the better viewfinder, custom buttons, etc., are very useful.  so i like them both; they each have their niche in my setup.", "sortedWord": "None", "identifyer": 25070, "year": "2021"}, {"Unnamed: 0": 134785, "autor": "isnotclinteastwood", "date": 1633016555000, "content": "Question about a7S III File Settings /!/ Hey all, \n\nI've been watching [this video](https://youtu.be/fXW4Zj9Jygg) and it has been a great resource for learning the ins and outs of my camera. I was wondering if anyone on here is familiar with how the File Settings work. My question is this: Say I set my camera to name its files LocationA(series)... When I move to the next location I'd like to go into the settings and name the files LocationB(series). Will the camera change all of the file names to LocationA or will LocationA and LocationB remain with separate naming conventions?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pymfbo/question_about_a7s_iii_file_settings/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "question about a7s iii file settings /!/ hey all, \n\ni've been watching [this video](https://youtu.be/fxw4zj9jygg) and it has been a great resource for learning the ins and outs of my camera. i was wondering if anyone on here is familiar with how the file settings work. my question is this: say i set my camera to name its files locationa(series)... when i move to the next -----> location !!!  i'd like to go into the settings and name the files locationb(series). will the camera change all of the file names to locationa or will locationa and locationb remain with separate naming conventions?", "sortedWord": "None", "identifyer": 25534, "year": "2021"}, {"Unnamed: 0": 134829, "autor": "Buzz_Buzz_Buzz_", "date": 1632947076000, "content": "Any way to default to USB Streaming mode on ZV-E10 (or any other Sony)? /!/ I picked up a ZV-E10 to use as a webcam because it's one of very few cameras that can stream and charge through USB at the same time (after extensive research, the only others I'm aware of are the much more bulky and expensive Fujifilm X-T3/4, Canon EOS R series, and Blackmagic Pocket Cinema). I have a DSLR setup with an external power adapter in my office/studio, but I wanted a single-cable solution for a secondary location (bedroom and travel). I like the convenience of being able to flip a switch on the camera and just have it start working with Zoom, Skype, or OVR.\n\nI'm impressed with the quality of the ZV-E10, but unfortunately it reverts to USB MTP mode every time it's powered off and back on, requiring a manual selection of USB Streaming mode. Is there any way to change this default? I don't want to have to move the camera or even touch it beyond turning it on and off.\n\nI have the capability to use HDMI, but again, I'm looking for a single-cable solution with no extra hardware.\n\nOn a related note, it's surprising to me that Sony, an early adopter of USB-C in its other product lines, didn't put it in the latest RX100 or 6000 series cameras.", "link": "https://www.reddit.com/r/SonyAlpha/comments/py3vd0/any_way_to_default_to_usb_streaming_mode_on_zve10/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "any way to default to usb streaming mode on zv-e10 (or any other sony)? /!/ i picked up a zv-e10 to use as a webcam because it's one of very few cameras that can stream and charge through usb at the same time (after extensive research, the only others i'm aware of are the much more bulky and expensive fujifilm x-t3/4, canon eos r series, and blackmagic pocket cinema). i have a dslr setup with an external power adapter in my office/studio, but i wanted a single-cable solution for a secondary -----> location !!!  (bedroom and travel). i like the convenience of being able to flip a switch on the camera and just have it start working with zoom, skype, or ovr.\n\ni'm impressed with the quality of the zv-e10, but unfortunately it reverts to usb mtp mode every time it's powered off and back on, requiring a manual selection of usb streaming mode. is there any way to change this default? i don't want to have to move the camera or even touch it beyond turning it on and off.\n\ni have the capability to use hdmi, but again, i'm looking for a single-cable solution with no extra hardware.\n\non a related note, it's surprising to me that sony, an early adopter of usb-c in its other product lines, didn't put it in the latest rx100 or 6000 series cameras.", "sortedWord": "None", "identifyer": 25580, "year": "2021"}, {"Unnamed: 0": 136348, "autor": "llitkr", "date": 1629028924000, "content": "Connecting Bluetooth automatic with Android smartphone /!/ Hello. I'm using Android smartphone and installed Imaging edge app for connect phone with my a7siii mirrorless camera.\n\nI should connect my phone and camera for write GPS location information into photography file and it's important because of categorizing files after move it to my PC.\n\nIt's not so difficult, I can do it by just unlock my phone and open imaging edge app, then it will connect with camera itself.\n\nSometimes I turn on the camera few minutes later from I turned off it, it automatically connect with my phone on bluetooth but after about 15-30 minutes, it doesn't connect automatic. I think it's because Android system shutdown the bluetooth usage of imaging edge app for battery save.\n\nI think there is a way to stop Android system turn off imaging edge app's bluetooth connection but cannot find how to do it. I wish there is someone here who solved this problem.", "link": "https://www.reddit.com/r/SonyAlpha/comments/p4s69o/connecting_bluetooth_automatic_with_android/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "connecting bluetooth automatic with android smartphone /!/ hello. i'm using android smartphone and installed imaging edge app for connect phone with my a7siii mirrorless camera.\n\ni should connect my phone and camera for write gps -----> location !!!  information into photography file and it's important because of categorizing files after move it to my pc.\n\nit's not so difficult, i can do it by just unlock my phone and open imaging edge app, then it will connect with camera itself.\n\nsometimes i turn on the camera few minutes later from i turned off it, it automatically connect with my phone on bluetooth but after about 15-30 minutes, it doesn't connect automatic. i think it's because android system shutdown the bluetooth usage of imaging edge app for battery save.\n\ni think there is a way to stop android system turn off imaging edge app's bluetooth connection but cannot find how to do it. i wish there is someone here who solved this problem.", "sortedWord": "None", "identifyer": 27131, "year": "2021"}, {"Unnamed: 0": 136935, "autor": "bearded_badg3r", "date": 1615253243000, "content": "Location: 🤫 A7RII with Sigma 14mm 1.8 Art", "link": "https://www.reddit.com/r/SonyAlpha/comments/m0vgnu/location_a7rii_with_sigma_14mm_18_art/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "-----> location !!! : 🤫 a7rii with sigma 14mm 1.8 art", "sortedWord": "None", "identifyer": 27741, "year": "2021"}, {"Unnamed: 0": 137464, "autor": "itsjellogamer", "date": 1613622419000, "content": "So I found this dude twice in different locations took fast and without any desire to make these look good, yet I feel like I have accomplished something. What yall think?", "link": "https://www.reddit.com/r/SonyAlpha/comments/lmdnv3/so_i_found_this_dude_twice_in_different_locations/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "so i found this dude twice in different -----> locations !!!  took fast and without any desire to make these look good, yet i feel like i have accomplished something. what yall think?", "sortedWord": "None", "identifyer": 28293, "year": "2021"}, {"Unnamed: 0": 139195, "autor": "dslrhunter25", "date": 1634106953000, "content": "Shot on A7III using the 70-200 G lens. Location: Lion Rock, Hong Kong.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q75bos/shot_on_a7iii_using_the_70200_g_lens_location/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shot on a7iii using the 70-200 g lens. -----> location !!! : lion rock, hong kong.", "sortedWord": "None", "identifyer": 30086, "year": "2021"}, {"Unnamed: 0": 139806, "autor": "Klauslee", "date": 1628400273000, "content": "Cage or mount for camera? /!/ The sony a6400 flip screen blocks the mic and I need something to change the location of the mic. I've seen people suggesting \"small rig\".  What's the difference between the cage and the mount?\n\nThis is the mount people suggest-[https://www.amazon.com/SMALLRIG-Field-Monitor-Holder-Swivel/dp/B07VQF78CF/ref=sr\\_1\\_3?dchild=1&amp;keywords=smallrig&amp;qid=1628399854&amp;sr=8-3](https://www.amazon.com/SMALLRIG-Field-Monitor-Holder-Swivel/dp/B07VQF78CF/ref=sr_1_3?dchild=1&amp;keywords=smallrig&amp;qid=1628399854&amp;sr=8-3)\n\nThis is the cage people suggest-[https://www.amazon.com/SMALLRIG-Camera-A6400-A6100-Cage/dp/B07Q72B997/ref=sr\\_1\\_3dchild=1&amp;keywords=sony+cage+sony+a6400&amp;qid=1628400221&amp;sr=8-3](https://www.amazon.com/SMALLRIG-Camera-A6400-A6100-Cage/dp/B07Q72B997/ref=sr_1_3?dchild=1&amp;keywords=sony+cage+sony+a6400&amp;qid=1628400221&amp;sr=8-3)", "link": "https://www.reddit.com/r/SonyAlpha/comments/p08ufa/cage_or_mount_for_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "cage or mount for camera? /!/ the sony a6400 flip screen blocks the mic and i need something to change the -----> location !!!  of the mic. i've seen people suggesting \"small rig\".  what's the difference between the cage and the mount?\n\nthis is the mount people suggest-[https://www.amazon.com/smallrig-field-monitor-holder-swivel/dp/b07vqf78cf/ref=sr\\_1\\_3?dchild=1&amp;keywords=smallrig&amp;qid=1628399854&amp;sr=8-3](https://www.amazon.com/smallrig-field-monitor-holder-swivel/dp/b07vqf78cf/ref=sr_1_3?dchild=1&amp;keywords=smallrig&amp;qid=1628399854&amp;sr=8-3)\n\nthis is the cage people suggest-[https://www.amazon.com/smallrig-camera-a6400-a6100-cage/dp/b07q72b997/ref=sr\\_1\\_3dchild=1&amp;keywords=sony+cage+sony+a6400&amp;qid=1628400221&amp;sr=8-3](https://www.amazon.com/smallrig-camera-a6400-a6100-cage/dp/b07q72b997/ref=sr_1_3?dchild=1&amp;keywords=sony+cage+sony+a6400&amp;qid=1628400221&amp;sr=8-3)", "sortedWord": "None", "identifyer": 30713, "year": "2021"}, {"Unnamed: 0": 141096, "autor": "averyycuriousman", "date": 1613931562000, "content": "Sony A7Riv as a b cam? /!/ How well could the a7riv serve as a backup camera for video? I mostly want it for it's photography capabilities, since I travel to crazy locations around the world, but I also need a camera that I can have as a backup and or positioned in different angles for shoots. I shoot video mostly with the gh5, but I am considering getting the a7r iv for its photography capabilities (gh5 not amazing for that) but am wondering if the a74 iv's video capabilities would be \"good enough\" to have as a backup. Or should I just wait for the a7 iv? Thoughts?", "link": "https://www.reddit.com/r/SonyAlpha/comments/lp31h2/sony_a7riv_as_a_b_cam/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony a7riv as a b cam? /!/ how well could the a7riv serve as a backup camera for video? i mostly want it for it's photography capabilities, since i travel to crazy -----> locations !!!  around the world, but i also need a camera that i can have as a backup and or positioned in different angles for shoots. i shoot video mostly with the gh5, but i am considering getting the a7r iv for its photography capabilities (gh5 not amazing for that) but am wondering if the a74 iv's video capabilities would be \"good enough\" to have as a backup. or should i just wait for the a7 iv? thoughts?", "sortedWord": "None", "identifyer": 32047, "year": "2021"}, {"Unnamed: 0": 141134, "autor": "nifiction", "date": 1613886343000, "content": "Weird issue with formatting SD cards on SonyA7Riv with Mac Finder Sidebar /!/ My works horse is my A7riv. Whenever I'm done with a shoot, I format the SD card.\n\nNow, for a while, that has caused Finder on my Mac to not display the card in the sidebar under \"Locations\" (which is where it used to live).\n\nAfter HOURS on the pretty solid Apple phone support, they told me it's because of the fact that my camera renames the SD card to \"Untitled\" when formatting it. The way to have it show up, then, is to open disk utility, find the drive without a name (the SD card), give it a name, relaunch Finder.\n\nObviously super tedious and I was wondering if I'm the only one with that issue?! I find it strange that MacOS would not recognize a drive simply because it's called \"Untitled\" but who knows?! \n\nMacOS: 11.2.1  \nSony A7riv: Ver. 1.00", "link": "https://www.reddit.com/r/SonyAlpha/comments/loq7lh/weird_issue_with_formatting_sd_cards_on_sonya7riv/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "weird issue with formatting sd cards on sonya7riv with mac finder sidebar /!/ my works horse is my a7riv. whenever i'm done with a shoot, i format the sd card.\n\nnow, for a while, that has caused finder on my mac to not display the card in the sidebar under \"-----> locations !!! \" (which is where it used to live).\n\nafter hours on the pretty solid apple phone support, they told me it's because of the fact that my camera renames the sd card to \"untitled\" when formatting it. the way to have it show up, then, is to open disk utility, find the drive without a name (the sd card), give it a name, relaunch finder.\n\nobviously super tedious and i was wondering if i'm the only one with that issue?! i find it strange that macos would not recognize a drive simply because it's called \"untitled\" but who knows?! \n\nmacos: 11.2.1  \nsony a7riv: ver. 1.00", "sortedWord": "None", "identifyer": 32087, "year": "2021"}, {"Unnamed: 0": 141594, "autor": "siaracci", "date": 1626251112000, "content": "Sony a7III - what is it? /!/ Hey guys!\n\nI was making a photo hyper lapse, and on few photos this appears - on different location. Only for few photos like 4-5. \n\nSeems like a light leak or it is just a sun flare - what exactly it is?\n\nI did other hyper lapses this day too, and I haven't noticed any issues like that.\n\nShould I be worried? This body took only 600 photos. It's like a new one :(\n\nI was using a batis 25mm lens.\n\n&amp;#x200B;\n\n*Processing img 66l7lkny15b71...*\n\n*Processing img ketklbfx15b71...*", "link": "https://www.reddit.com/r/SonyAlpha/comments/ojzzo7/sony_a7iii_what_is_it/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sony a7iii - what is it? /!/ hey guys!\n\ni was making a photo hyper lapse, and on few photos this appears - on different -----> location !!! . only for few photos like 4-5. \n\nseems like a light leak or it is just a sun flare - what exactly it is?\n\ni did other hyper lapses this day too, and i haven't noticed any issues like that.\n\nshould i be worried? this body took only 600 photos. it's like a new one :(\n\ni was using a batis 25mm lens.\n\n&amp;#x200b;\n\n*processing img 66l7lkny15b71...*\n\n*processing img ketklbfx15b71...*", "sortedWord": "None", "identifyer": 32562, "year": "2021"}, {"Unnamed: 0": 144099, "autor": "Peacelake", "date": 1620345549000, "content": "a6600 WiFi and Bluetooth Questions... /!/ I read about both of these features and I find them a bit confusing!  Here's what I've experienced...\n\n\\- I tried connecting using Send to Smartphone, was presented with a QR code, scanned it in the Imaging Edge app and all went well.  I never set any WiFi settings, but this used my WiFi apparently to make the connection.  How?  Is this secure??\n\n\\- I tried using Ctrl w/Smartphone, and since Imaging Edge had previously connected, this worked as well, but, the app was a bit janky in that sometimes the shutter wouldn't fire and it would throw an error, then, it would work again.  Is this a known issue?\n\n\\- I connected via BT just fine, but apparently this is just for geo location?  If you choose Bluetooth Remote Control this is not for the Imaging Edge app, but rather a dedicated hardware remote?\n\n\\- Is there any reason for me to actually enter my WiFi SSID and password, or does the QR code completely cover that connection, somehow?\n\n\\- Lastly, I plan to try my hand at capturing hummingbirds at the feeders I have thought that using a remote would be the ticket.  In that use case, will the app work well (response and reliability) or should I get a hardware remote?\n\nLots of questions!  But even after reading an excellent book on this camera, I still have these practical questions floating around in my head.\n\nThanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/n6lfuk/a6600_wifi_and_bluetooth_questions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a6600 wifi and bluetooth questions... /!/ i read about both of these features and i find them a bit confusing!  here's what i've experienced...\n\n\\- i tried connecting using send to smartphone, was presented with a qr code, scanned it in the imaging edge app and all went well.  i never set any wifi settings, but this used my wifi apparently to make the connection.  how?  is this secure??\n\n\\- i tried using ctrl w/smartphone, and since imaging edge had previously connected, this worked as well, but, the app was a bit janky in that sometimes the shutter wouldn't fire and it would throw an error, then, it would work again.  is this a known issue?\n\n\\- i connected via bt just fine, but apparently this is just for geo -----> location !!! ?  if you choose bluetooth remote control this is not for the imaging edge app, but rather a dedicated hardware remote?\n\n\\- is there any reason for me to actually enter my wifi ssid and password, or does the qr code completely cover that connection, somehow?\n\n\\- lastly, i plan to try my hand at capturing hummingbirds at the feeders i have thought that using a remote would be the ticket.  in that use case, will the app work well (response and reliability) or should i get a hardware remote?\n\nlots of questions!  but even after reading an excellent book on this camera, i still have these practical questions floating around in my head.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 35148, "year": "2021"}, {"Unnamed: 0": 144634, "autor": "Kaixus", "date": 1627191974000, "content": "Sony 35mm 1.8FE vs Samyang /!/ Hi Sony fam, I have a a7ii and really want to retry the 35mm focal length again. \n\nI had a iffy time with the old Zeiss, but recently found there were some locations where 35mm really shined for me. Also it's been a while since the sony35mm came out so the used market has made it a little more affordable to me. What's the community's consensus between the two lens? Is it worth the price jump to go for the Sony? Or is the Samyang completely capable and I can just skip out on the Sony?\n\nThanks for sharing!", "link": "https://www.reddit.com/r/SonyAlpha/comments/or5ykk/sony_35mm_18fe_vs_samyang/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony 35mm 1.8fe vs samyang /!/ hi sony fam, i have a a7ii and really want to retry the 35mm focal length again. \n\ni had a iffy time with the old zeiss, but recently found there were some -----> locations !!!  where 35mm really shined for me. also it's been a while since the sony35mm came out so the used market has made it a little more affordable to me. what's the community's consensus between the two lens? is it worth the price jump to go for the sony? or is the samyang completely capable and i can just skip out on the sony?\n\nthanks for sharing!", "sortedWord": "None", "identifyer": 35704, "year": "2021"}, {"Unnamed: 0": 145486, "autor": "MrVideoMaker", "date": 1615391517000, "content": "Rydz and I Explored Island City Portsmouth, scouting for a new shooting location at night. The video was shot with my favorite my A7III , 24mm f1.4 GM , Black Pro Mist 1/2 and DJI SC. Night Test", "link": "https://www.reddit.com/r/SonyAlpha/comments/m20k6x/rydz_and_i_explored_island_city_portsmouth/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "rydz and i explored island city portsmouth, scouting for a new shooting -----> location !!!  at night. the video was shot with my favorite my a7iii , 24mm f1.4 gm , black pro mist 1/2 and dji sc. night test", "sortedWord": "None", "identifyer": 36598, "year": "2021"}, {"Unnamed: 0": 145487, "autor": "MrVideoMaker", "date": 1615391394000, "content": "Night Test A7III , 24mm f1.4 GM , Black Pro Mist 1/2 and DJI SC /!/ Rydz and I Explored Island City Portsmouth, scouting for a new shooting location at night. The video was shot with my favorite my A7III , 24mm f1.4 GM , Black Pro Mist 1/2 and DJI SC. Full 4k video on my YouTube channel shortly. [https://youtu.be/aLNbOocyiqk](https://youtu.be/aLNbOocyiqk)", "link": "https://www.reddit.com/r/SonyAlpha/comments/m20ifr/night_test_a7iii_24mm_f14_gm_black_pro_mist_12/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "night test a7iii , 24mm f1.4 gm , black pro mist 1/2 and dji sc /!/ rydz and i explored island city portsmouth, scouting for a new shooting -----> location !!!  at night. the video was shot with my favorite my a7iii , 24mm f1.4 gm , black pro mist 1/2 and dji sc. full 4k video on my youtube channel shortly. [https://youtu.be/alnboocyiqk](https://youtu.be/alnboocyiqk)", "sortedWord": "None", "identifyer": 36599, "year": "2021"}, {"Unnamed: 0": 145799, "autor": "amndz1990", "date": 1609799004000, "content": "How much of a difference does weather sealing make? /!/ Does having a camera with weather sealing make a huge difference when taking photographs at locations when it’s foggy, light rain, or there’s dew in the air that falls on the camera and lens? Have an a6100 with the sigma 16mm and 56mm lenses and often find myself taking photos in these situations. \n\nScared I may eventually ruin the camera in these situations and wondering if upgrading eventually to a camera such as the a6600 or a full frame that’s weather sealed.\n\nI do avoid taking the camera out in the rain but sometimes water does get on it a bit. (I am aware there’s rain covers for cameras too but I’ve used them before and not a fan of them.) \n\nAny advice/tips? \n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/kqjli2/how_much_of_a_difference_does_weather_sealing_make/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "how much of a difference does weather sealing make? /!/ does having a camera with weather sealing make a huge difference when taking photographs at -----> locations !!!  when it’s foggy, light rain, or there’s dew in the air that falls on the camera and lens? have an a6100 with the sigma 16mm and 56mm lenses and often find myself taking photos in these situations. \n\nscared i may eventually ruin the camera in these situations and wondering if upgrading eventually to a camera such as the a6600 or a full frame that’s weather sealed.\n\ni do avoid taking the camera out in the rain but sometimes water does get on it a bit. (i am aware there’s rain covers for cameras too but i’ve used them before and not a fan of them.) \n\nany advice/tips? \n\nthanks!", "sortedWord": "None", "identifyer": 36924, "year": "2021"}, {"Unnamed: 0": 147158, "autor": "_kweso", "date": 1629984554000, "content": "Finally upgraded to the 21st century (from Canon Rebel T2i to Sony a6400) /!/ Hey all. I hope I am not wrong in this board with some beginner technical issues. If so, do you know a better place?\n\nFirst of all, I am so happy to carry half the weight and size of bag I used to with the old cam. And the Sony AF is killer.\n\nI started with the kit lens (actually quite happy with it after one week on family vacation). But I think I'll soon add the 35mm F1.8 (for indoors and portraits) and the 18-105mm F4.0 (because I love alrounders)\n\nAs I expected after the reviews, I spent quite some time to get used to the UI / menu. But after roughly two hours I think I know what does what where to look for stuff. I even customised some buttons and the FN-menu already. But I still have a few questions:\n\n1: Can I get stuff like \"[movie] File Format\" (essentially 4K or HD) or \"[movie] Record Setting\" (resolution and bit rate) on a custom botton or, better, into the FN-menu.\n\n2: Can I set different FN-menu items for photo vs movie mode(s)?\n\n3: Why do I have to reconnect to my android phone (Imaging Edge Mobile) every time after sending one item to smartphone.\n\n4: I have paired my smartphone via bt once. But gps location info was still not possible. And I cant connect to the cam a second time. I always have to delete the cam from the device list in my phones bt-menu and re-pair it again. But gps info on the cam doesn't work even then anyway ...\n\nSo I'd appreciate any little hint that could help me.\nAlso any other sony alpha pro tips about stuff that I'm not even thinking about now.\n\nAgain, if this board is not supposed to be a beginner tech support: SORRY. \n\nIn any case, looking forward to share my fist Photo after I get back to my PC and lightroom...\nThanks in advance...\nAnd greetings from Croatia", "link": "https://www.reddit.com/r/SonyAlpha/comments/pbziyu/finally_upgraded_to_the_21st_century_from_canon/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "finally upgraded to the 21st century (from canon rebel t2i to sony a6400) /!/ hey all. i hope i am not wrong in this board with some beginner technical issues. if so, do you know a better place?\n\nfirst of all, i am so happy to carry half the weight and size of bag i used to with the old cam. and the sony af is killer.\n\ni started with the kit lens (actually quite happy with it after one week on family vacation). but i think i'll soon add the 35mm f1.8 (for indoors and portraits) and the 18-105mm f4.0 (because i love alrounders)\n\nas i expected after the reviews, i spent quite some time to get used to the ui / menu. but after roughly two hours i think i know what does what where to look for stuff. i even customised some buttons and the fn-menu already. but i still have a few questions:\n\n1: can i get stuff like \"[movie] file format\" (essentially 4k or hd) or \"[movie] record setting\" (resolution and bit rate) on a custom botton or, better, into the fn-menu.\n\n2: can i set different fn-menu items for photo vs movie mode(s)?\n\n3: why do i have to reconnect to my android phone (imaging edge mobile) every time after sending one item to smartphone.\n\n4: i have paired my smartphone via bt once. but gps -----> location !!!  info was still not possible. and i cant connect to the cam a second time. i always have to delete the cam from the device list in my phones bt-menu and re-pair it again. but gps info on the cam doesn't work even then anyway ...\n\nso i'd appreciate any little hint that could help me.\nalso any other sony alpha pro tips about stuff that i'm not even thinking about now.\n\nagain, if this board is not supposed to be a beginner tech support: sorry. \n\nin any case, looking forward to share my fist photo after i get back to my pc and lightroom...\nthanks in advance...\nand greetings from croatia", "sortedWord": "None", "identifyer": 38338, "year": "2021"}, {"Unnamed: 0": 149293, "autor": "Iamatruckk", "date": 1613269482000, "content": "I feel like a f*cking idiot /!/ Went out for a day of exploration and taking shots of my truck. Lots of stopping to take some quick pictures. Found some really cool locations, old dilapidated buildings that made for great shots. Now when I shoot I generally don't look at the pictures until I get them on my computer. Got home, opened up my a6600 to find that I had left my sd card in my laptop and didn't get any of the shots. Please join me in feeling my pain.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ljf823/i_feel_like_a_fcking_idiot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i feel like a f*cking idiot /!/ went out for a day of exploration and taking shots of my truck. lots of stopping to take some quick pictures. found some really cool -----> locations !!! , old dilapidated buildings that made for great shots. now when i shoot i generally don't look at the pictures until i get them on my computer. got home, opened up my a6600 to find that i had left my sd card in my laptop and didn't get any of the shots. please join me in feeling my pain.", "sortedWord": "None", "identifyer": 40545, "year": "2021"}, {"Unnamed: 0": 149529, "autor": "stiehll", "date": 1631223544000, "content": "Sony Alpha Event Locations? /!/ Sony Alpha Events\nIs there a way to see where Sony Alpha will represent themselves at events throughout the country?  I know they have a calendar on the SonyAlpha Universe page. But then I see that they are a sponsor at Summit Workshops, but that wasn’t listed on their calendar. I’m sure they are at other events too. Any ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pl7a5q/sony_alpha_event_locations/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "sony alpha event -----> locations !!! ? /!/ sony alpha events\nis there a way to see where sony alpha will represent themselves at events throughout the country?  i know they have a calendar on the sonyalpha universe page. but then i see that they are a sponsor at summit workshops, but that wasn’t listed on their calendar. i’m sure they are at other events too. any ideas?", "sortedWord": "None", "identifyer": 40791, "year": "2021"}, {"Unnamed: 0": 150924, "autor": "oooolf", "date": 1627103872000, "content": "Buying recommendation /!/ I have an a7RIV and more glass than I care to admit. I use it with a battery grip and, depending on location, with the 12-24, 16-35 or the 135 - generally pretty heavy lenses. I'm considering a secondary body for the lighter Batis lenses and an occasional art lens. \n\nThe obvious choice would be the a7C, but I can get nearly double the resolution with on the a7RII - with current promos at 2/3rd the price; or I could match the resolution with an a7II for half the price.\n\nAs far as convenience goes, the a7C shares the battery format with my A7RIV... but then, $600 savings buys a lot of batteries, and I might still have one or two of the smaller ones from my A6300 days.  I'm not hugely concerned with AF points or video. I'm used to large/heavier set-ups, so the 3-4 oz difference between the a7C and the a7RII would be barely a factor, nor the extra inch for the center EVF. \n\nAny a7C owners want to weigh in? That camera has a huge draw, and it's the shiny new thing, but it's hard to defend based on the numbers.\n\nPS: I don't want to start the megapixel wars here - IMO, more is better for an amateur like myself, because I can crop and fix composition in post.", "link": "https://www.reddit.com/r/SonyAlpha/comments/oqjnx3/buying_recommendation/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "buying recommendation /!/ i have an a7riv and more glass than i care to admit. i use it with a battery grip and, depending on -----> location !!! , with the 12-24, 16-35 or the 135 - generally pretty heavy lenses. i'm considering a secondary body for the lighter batis lenses and an occasional art lens. \n\nthe obvious choice would be the a7c, but i can get nearly double the resolution with on the a7rii - with current promos at 2/3rd the price; or i could match the resolution with an a7ii for half the price.\n\nas far as convenience goes, the a7c shares the battery format with my a7riv... but then, $600 savings buys a lot of batteries, and i might still have one or two of the smaller ones from my a6300 days.  i'm not hugely concerned with af points or video. i'm used to large/heavier set-ups, so the 3-4 oz difference between the a7c and the a7rii would be barely a factor, nor the extra inch for the center evf. \n\nany a7c owners want to weigh in? that camera has a huge draw, and it's the shiny new thing, but it's hard to defend based on the numbers.\n\nps: i don't want to start the megapixel wars here - imo, more is better for an amateur like myself, because i can crop and fix composition in post.", "sortedWord": "None", "identifyer": 42240, "year": "2021"}, {"Unnamed: 0": 151052, "autor": "larxiz", "date": 1626723039000, "content": "Forest - A7RIII + FE 4/24-70mm /!/ Location: Huelgoat Forest in Brittany, France\n\nBody: Sony A7RIII\n\nLense: 24-70mm F4 ZA OSS\n\n70mm, ISO 640, F14, 1/125sec, Handheld", "link": "https://www.reddit.com/r/SonyAlpha/comments/onlbof/forest_a7riii_fe_42470mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "forest - a7riii + fe 4/24-70mm /!/ -----> location !!! : huelgoat forest in brittany, france\n\nbody: sony a7riii\n\nlense: 24-70mm f4 za oss\n\n70mm, iso 640, f14, 1/125sec, handheld", "sortedWord": "None", "identifyer": 42371, "year": "2021"}, {"Unnamed: 0": 152745, "autor": "tastehbacon", "date": 1628702022000, "content": "Difficulty turning zoom ring on my e mount sigma 24-70 f2.8? /!/ I haven't been to any sandy locations nor have I dropped the lense so I am not sure what caused this issue. Any advice? It doesn't take a lot of effort when the zoom ring gets \"stuck\" but it is noticeable. It was previously smooth as butter to turn. I then went a few weeks without shooting and when I pulled it out the issue was there. It was stored in a quality padded camera backpack and was not moved the entire time.\n\nCan it be fixed and does it need to be fixed at a shop?", "link": "https://www.reddit.com/r/SonyAlpha/comments/p2hgtz/difficulty_turning_zoom_ring_on_my_e_mount_sigma/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "difficulty turning zoom ring on my e mount sigma 24-70 f2.8? /!/ i haven't been to any sandy -----> locations !!!  nor have i dropped the lense so i am not sure what caused this issue. any advice? it doesn't take a lot of effort when the zoom ring gets \"stuck\" but it is noticeable. it was previously smooth as butter to turn. i then went a few weeks without shooting and when i pulled it out the issue was there. it was stored in a quality padded camera backpack and was not moved the entire time.\n\ncan it be fixed and does it need to be fixed at a shop?", "sortedWord": "None", "identifyer": 44135, "year": "2021"}], "name": "locationSonyAlpha2021"}