{"interestingcomments": [{"Unnamed: 0": 136001, "autor": "inorman", "date": 1623747462000, "content": "ClearImage Zoom and APS-C modes are AMAZING for video. /!/ Seriously, ClearImage Zoom and APS-C modes are severely underrated tools on your Sony camera. They're AMAZING for video work and have clear [resolution benefits](https://imgur.com/a/w8QI7an). If you do video work with your Sony camera, do yourself a favor add them to your tool chest right now by mapping them to a custom key or into your Fn menu. \n\nWHAT IT IS: \n\nYou probably already know this, but anyways: ClearImage Zoom and APS-C modes effectively apply a crop to your recording so that you can, well, \"zoom-in\", for when you need more reach from your lens. These modes are particularly useful for video work. \n\nThe best part about these functions is that on any of the 24MP+ bodies like the a7III a7RIV, etc., you can still maintain true 4K video resolution, even with the 1.5x cropping of ClearImage Zoom or APS-C mode, making for a tangible benefit to video recording if you need more reach from your lens.\n\nIn my experience, this is extremely effective and any kind of quality difference between full-frame and APS-C modes or 1.5x ClearImage Zoom for video are negligible. In fact, the extra \"reach\" of the crop gives you more resolution on distant subjects and can really make a positive difference in detail in your video shots when you need just a little tighter field of view. \n\nI personally shoot a lot with prime lenses (usually for the aperture/size benefit) but sometimes that can feel restricting in terms of focal length coverage... but ClearImage Zoom and/or APS-C modes dramatically increased the usability range of my fixed focal length prime lenses. \n\nPRIMES BECOME ZOOMS\n\nIn my case, ClearImage Zoom has totally changed the way that I look at the usefulness of my primes. My a7III and a7C can do ClearImage Zoom up to 1.5x in 4K/24p/30p. With that, now my 18mm can be effectively an 18-27mm for 4K/24p recording. And with all 3 of my primes: 18mm, 35mm and 55mm, I basically have nearly full FOV coverage from an equivalent 18-72.5mm coverage in 4K shooting. \n\nZOOMS BECOME ZOOMIER\n\nThis is also beneficial to zoom lenses of course. It means a 24-70mm can become effectively a 24-105. Or as another example, a 17-28mm becomes up to a 17-56mm. That's a really useful improvement in overall reach with a single zoom lens. \n\nBUT WAIT, THERE'S MORE... IT GOES EVEN FARTHER: \n\nIt gets even more interesting and useful because in 4K recording, you can **COMBINE 1.5x APS-C mode with 1.5x ClearImage Zoom to get an effective 2.25x crop**, all while still capturing what's basically a 2.7K section of the sensor (on the a7III at least) that gets upsampled to 4K. The resulting video when doing this still looks exceptionally good in a 4K timeline and there's still a tangible resolution benefit to doing this: you'll be able to resolve significantly more detail on distant subjects.\n\nJust as an example, here's [what's possible on just my 55mm lens in term of zoom fields of view](https://imgur.com/a/fckAzrY) by using these modes. And these crops show that there is a [clear benefit in terms of resolution on distant subjects](https://imgur.com/a/w8QI7an) when combining both APS-C and ClearImage Zoom.\n\nSo even better now, by combining both modes, my single 18mm prime lens is now effectively an 18-40mm zoom.  And with my 3 small prime lenses (18, 35, 55), I can cover nearly any focal length equivalent from 18mm to 124mm. \n\nWHY AREN'T YOU USING THESE MODES FOR VIDEO?\n\nFor 4K video shooters, I really feel like these features are heavily overlooked because the idea of cropping an image feels inherently destructive. Why not use the full sensor if we have it right? \n\nBut remember that the fact that our output in video is already limited to 3840 pixels wide means that we're already dramatically downsampling from the full sensor width. Why not use some of those extra pixels for some extra zoom reach when we need it?\n\nDo you you ClearImage Zoom or APS-C mode for your video work? Why or why not?", "link": "https://www.reddit.com/r/SonyAlpha/comments/o09t6i/clearimage_zoom_and_apsc_modes_are_amazing_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapping", "selectorShort": "map", "MarkedSent": "clearimage zoom and aps-c modes are amazing for video. /!/ seriously, clearimage zoom and aps-c modes are severely underrated tools on your sony camera. they're amazing for video work and have clear [resolution benefits](https://imgur.com/a/w8qi7an). if you do video work with your sony camera, do yourself a favor add them to your tool chest right now by -----> mapping !!!  them to a custom key or into your fn menu. \n\nwhat it is: \n\nyou probably already know this, but anyways: clearimage zoom and aps-c modes effectively apply a crop to your recording so that you can, well, \"zoom-in\", for when you need more reach from your lens. these modes are particularly useful for video work. \n\nthe best part about these functions is that on any of the 24mp+ bodies like the a7iii a7riv, etc., you can still maintain true 4k video resolution, even with the 1.5x cropping of clearimage zoom or aps-c mode, making for a tangible benefit to video recording if you need more reach from your lens.\n\nin my experience, this is extremely effective and any kind of quality difference between full-frame and aps-c modes or 1.5x clearimage zoom for video are negligible. in fact, the extra \"reach\" of the crop gives you more resolution on distant subjects and can really make a positive difference in detail in your video shots when you need just a little tighter field of view. \n\ni personally shoot a lot with prime lenses (usually for the aperture/size benefit) but sometimes that can feel restricting in terms of focal length coverage... but clearimage zoom and/or aps-c modes dramatically increased the usability range of my fixed focal length prime lenses. \n\nprimes become zooms\n\nin my case, clearimage zoom has totally changed the way that i look at the usefulness of my primes. my a7iii and a7c can do clearimage zoom up to 1.5x in 4k/24p/30p. with that, now my 18mm can be effectively an 18-27mm for 4k/24p recording. and with all 3 of my primes: 18mm, 35mm and 55mm, i basically have nearly full fov coverage from an equivalent 18-72.5mm coverage in 4k shooting. \n\nzooms become zoomier\n\nthis is also beneficial to zoom lenses of course. it means a 24-70mm can become effectively a 24-105. or as another example, a 17-28mm becomes up to a 17-56mm. that's a really useful improvement in overall reach with a single zoom lens. \n\nbut wait, there's more... it goes even farther: \n\nit gets even more interesting and useful because in 4k recording, you can **combine 1.5x aps-c mode with 1.5x clearimage zoom to get an effective 2.25x crop**, all while still capturing what's basically a 2.7k section of the sensor (on the a7iii at least) that gets upsampled to 4k. the resulting video when doing this still looks exceptionally good in a 4k timeline and there's still a tangible resolution benefit to doing this: you'll be able to resolve significantly more detail on distant subjects.\n\njust as an example, here's [what's possible on just my 55mm lens in term of zoom fields of view](https://imgur.com/a/fckazry) by using these modes. and these crops show that there is a [clear benefit in terms of resolution on distant subjects](https://imgur.com/a/w8qi7an) when combining both aps-c and clearimage zoom.\n\nso even better now, by combining both modes, my single 18mm prime lens is now effectively an 18-40mm zoom.  and with my 3 small prime lenses (18, 35, 55), i can cover nearly any focal length equivalent from 18mm to 124mm. \n\nwhy aren't you using these modes for video?\n\nfor 4k video shooters, i really feel like these features are heavily overlooked because the idea of cropping an image feels inherently destructive. why not use the full sensor if we have it right? \n\nbut remember that the fact that our output in video is already limited to 3840 pixels wide means that we're already dramatically downsampling from the full sensor width. why not use some of those extra pixels for some extra zoom reach when we need it?\n\ndo you you clearimage zoom or aps-c mode for your video work? why or why not?", "sortedWord": "None", "identifyer": 26779, "doc": "b'x\\x9c\\xed]\\x07@\\x14G\\xd4\\x86Xc\\x8b\\xbd\\x1bKTbE\\x05\\x94hPA\\x14\\xb1 \\xa2(*Q\\x96\\xbb\\xe589\\xee\\xce\\xdb;Z4\\x1a\\x8d\\x89]4\\x8a-&r\\x85\\xae&\\x16\\x14\\xb1\\x97\\xd8\\x82\\x1a\\x8d-\\x96\\xd85F\\xec\\x05c\\xfb\\xe7\\xf0\\xc6\\xf2\\xe2\\xfc\\xcc9\\xfb/$\\xbf\\xa7\\xb7\\xdf\\r\\xbb\\xb7s;\\xf3\\xe6\\xcdk\\xf3frr\\x14\\xaf\\x13\\x94\\x1a\\xb5\\xa9M\\xeb\\xb6\\x16N\\xaf\\xd7\\t\\x8b=\\xbb\\xf9\\xf6\\xea\\xdd\\xa7\\xaf_?\\xff\\x1c\\xc7\\xed9\\x8e;r\\x1c\\x7fN\\xd2k\"x\\xb5\\xf0\\xb3\\x83\\xe3\\xd0I\\xb7#\\xa6\\xee\\xceu\\r~\\x001\\xd8\\xe1\\xf9kE\\xe3]>\\xe9\\x9dG\\xfd\\x96\\xe6\\xf8\\xbc\\xfc\\x9e\\xc3\\xeb/G\\x80\\xf8\\xe5\\xbc\\xf9\\xf4\\xdf\\x8d\\\\\\xd7|\\x87\\xcb\\xea\\x9f\\xdc\\xd6\\xf6\\x88\\x08n\\x08\\x91\\xb6\\x9e\\x126|f{\\x91\\xea9\\xecs\\xd2iZ\\xab\\x9f\\xeaC\\x1cb;\\xdf\\xbc\\xd5\\xf0P\\xcf\\x8f\\x8e\\xdf\\x99G\\xa8\\xe7\\x19x\\xbd\\xa8\\'\\xa5\\x8b\\xef\\xf0\\xbe\\xc7\\x9b\\xe2\\xf2\\xd3\\xd6\\xefMY\\xb88\\xb3\\r\\xc6\\x85\\t\\x9egkx\\x0f\\xfc\\x11?\\xcf\\xe7}\\xea\\xd5,\\xd1\\xff\\x8f2\\x03z;5\\xba\\xbf1\\x9d+f\\xfb\\xfbXP/\\xac\\xa7lLB\\xfb\\x92\\xebJ\\xd7\\xc2\\xe5\\xd5?-\\x9c[\\xdd\\xa1\\xd4X\\x88\\x9c\\xed\\xfc\\x93\\xe9G\\xf6\\xe4\\xd4q\\xd0m\\xb0\\xdd\\x17\\xf7\\xc3XP\\x86\\xf5\\x1c\\\\\\xdaz\\xd3\\x9c\\xc99\\xabq\\xb9C\\xf3\\xe6\\xb3\\xc7<\\x9ez\\x15\"\\xec\\x9f\\x85\\x84z\\x1e\\x93\\xda\\r\\xf4Op\\xb1U\\x99\\x1e\\x1a\\xe7\\xe5\\x18\\xbf\\x1a_1\\xfa\\xe4\\xb0>-a\\xbb--\\x80\\xde\\nj\\xb7\\x8d\\xcf\\x12ZFh\\xe3\\xbbc\\xbc\\xff\\x87\\xe5\\xc3\\x8c6\\xd5\\xe3\\x07\\xdb\\xce/x4\\xa0\\xe50\\xfdWc\\xfb\\x1c\\x18s\\xc3\\xbc\\xfd\\xc2(X\\x0f~\\xc1z\\xfcoV\\xd9^z\\xda\\xe8\\x1d\\xb8\\xfc`\\x9a\\xe7\\x84_\\xba\\xe6\\xad\\x848\\xd0v\\xfe\\xf8\\xb2\\xe2\\xdb\\'\\xed\\x8c\\x9d=\\xc3NzS<\\xabS/\\xf1`#\\x01\\x97\\xc7Z\"/\\x9c*\\x19\\x7f\\x1ab\\xa0\\xed|\\xfd\\xb0\\xe1\\xb9\\xedB\\xafW\\xca\\xb6\\xb3\\x9e]`\\xe0\\xb6U\\x94\\x9fS\\xbd\\xe6\\xdf\\xee\\x10!\\x1d\\xac\\xb1w\\xfc\\x00:0n\\xcd\\xe8s\\xed\\xf8\\xd8\\xe5\\x109p~\\x03\\xa1\\x1e\\x12\\xbd\\xb5\\x0c\\x88\\x0b\\x1b1|\\xd2g\\xb8\\xfc\\xa0\\xeeo\\xda\\x90\\x8a\\x07kA\\xc4\\xf5T\\x9e\\xd4\\xf8\\xf1\\xa5{a\\xfb0\\x1d\\xe0q:\\x06\\xb4\\x0b\\xe4o\\xb0\\xdd\\x86\\x04f_\\xd91~\\xfc0\\x88\\x83l\\xe7\\xcfe_h\\xd3\\xa3\\x92\\xef{\\xf1\\x84\\xe7y\\x9f\\xb2\\x9e\\xac\\xea\\xb5\\xa7N\\xcf}\\xfc\\x11D\\x0e\\x9c\\'\\xb5[i\\x1b\\xc2v\\xbbQl\\xce\\xf2\\x03\\x15>?\\x84\\xcb\\xb4\\xf3\\x02\\xe6o\\xb4\\xe3\\xf4\\xdd\\xbc\\xf0n^\\xc8o\\xb7\\xff\\xf8\\xbc \\xab\\xd0{~\\xed\\xcff\\x05B\\xa4\\xe5\\x07\\xa4\\xe7\\x81\\xfc \\xea\\xa6a\\xd0\\xee\\x83\\x9bk@\\x84\\xf3\\xcfl;\\xeb\\x81\\xf3\\xcf\\xc4\\xda\\xf7\\xf2v7l<\\x00\\xe3\\xb1\\xaf\\xcd}\\x9aMm\\xf8\\x0b\\xec\\x9f9\\x84z\\x9e\\x10\\xe8\\x00\\xf6Ov\\xfb\\x8dq\\xf5\\xbe\\xef\\xe1\\x07Q\\xecynWB\\x9db\\x862\\x87\\xaaA\\x1ca;\\xdf\\xd3\\x7f\\xdfG\\xbb\\xb8P\\xf7\\xb5\\x84zH\\xe3t^\\xfc\\xb8\\x19W*\\xe5\\xee\\xc5\\xe5\\x84z\\xa7\\x836]9\\x12\\x0f1\\xc4v\\xbeR\\xc7\\xa3\\x9b\\xcfOh{\\x82\\xc4\\x0fh\\xf9\\xe8\\xac\\x12\\x81\\xe3\\xbd\\x1f|\\xda\\x08\"\\xed\\xbcM\\xea\\x1f\\xb1\\xe7\\xed<B=p\\xdeNH\\xef1t[\\xddvW!\\xe2\\xfe9\\xd9\\xa4\\x8bs\\x83\\xfb_o(\\x88\\x1f\\xc0\\xf9tgp\\xae\\xc7\\xcd\\xd8\\xf9?\\xe3\\xf2\\xb0(\\xc3\\xed\\x80\\xb5\\xddJ\\xbd\\x93\\x13\\xff\\xf7z\\xdeVNd\\x95\\x0f.GD\\xf5\\x1e\\xb1\\xaa\\xdfT\\x88\\xb4t\\xfd\\x94\\x92\\xaeY\\xe5\\x83G\\xa4z\\x80|Py\\xdf\\xbas]\\x1e\\\\\\xda\\x0b\\x11\\xd2\\xdb\\\\;\\xf95\\xa4\\xb7;\\xd3\\xda\\x9f\\xeeq\\xf8I\\x1aDHo\\x0b\\t\\xf5<\\xa4\\xa47\\x97\\xb9{\\x0e\\x9c\\x9cT\\xd6\\x03\"o;?\\xb6\\xb8s\\xb4\\xa2q\\xf6\\xfe\\xef\\xed\\x1c\\xa7\\x90\\xdeB\\x1dc\\x12\\'\\x8c\\x9c\\x95\\n\\x11\\xd2\\x81\\xbd\\xe3\\x14\\xd2A\\xf4\\x8d\\xcb3r\\x9e\\xc5\\x05B\\x0c\\xb1\\x9d\\xc7\\xfcz\\t\\xa3\\xfe\\xa3\\xac\\xa2\\xd8y\\xa7U\\xa7F\\x10e\\xb6\\xf3\\x18I|\\x14\\xcf\\x13\\x05\\x8d\\xd3\\xe6\\xbd\\x15\\xf7W^la\\x818\\xd4v~\\xc19S\\x9d1\\x8b\\xcf\\x1e\\xfa\\xc1\\xceyn\\xeb\\xe0\\x84A\\xb5g\\xc8b\\xc5z\\x1eZy\\xe7R\\xc8\\x81\\xb83\\xeb\\xebL\\x84\\x18b;\\x8f\\xfb\\xe7[;\\xf5F\\xd8?\\x8bvd\\xc7M\\xde\\x14\\xe0\\x06\\x11\\xcfs\\xd5\\xae\\x14OX\\xf2\\xad{#\\xd2\\xf3\\x90\\xf8A\\t\\xb7\\x9dg\\x13J\\nx\\x1ac\\x9eOI\\xe3\\x14\\xce\\xa7\\x15n\\xce\\xdcS\\xe6qv\\x06\\xc4P\\xdby</$\\x17@\\x07\\x05\\x8d\\xd3\\xcf\\xbcnfn\\x89\\xda\\xa7\\x84h\\xef\\xbc\\r\\x9f\\xe7\\x0b\\xf3\\xe2\\t\\x0b\\xf2\\xbab2rHZ\\xa2)?s\\xeb\\xbdz\\x10\\xe5\\xb6\\xf3\\x98\\x8f\\xce\\xb4S\\x0f\\x86|\\xb4\\xa8\\xcds$\\xbeC;\\xcf\\xa9u\\xe3\\xcc\\x9f\\x1e\\xfca)\\xc4w\\xf2\\xf5\\xff\\xdenR\\xc9\\xd7\\xac\\xf6\\x1d\\xd2\\xf3@\\xfb\\x0ei\\xfc\\xd0\\xca!\\xc5\\t\\xf5\\xc0\\xf1\\xe33s\\xef\\xfdO\\xef:\\xb5\\x80\\x08\\xf9\\xc1\\x9c\\x0f\\xf6D\\xfd|\\xa1d\\x07Zzkqk\\xe3\\xa1\\xaf\\xb3\\xefw\\xc3e\\xd6y\\x8e\\xd4np\\x9e\\xbb9/fy\\xb3\\xd9\\x9d\\x9c B:\\xb0\\x97\\xbfA:\\x88\\x15\\x1a}&[\\xddg D\\xcc\\xdf\\x86\\xaf\\x89=X\\xffx\\xc5\\x1d\\xf6\\xca;\\x07z\\x04\\xa8n\\xfd\\x1d\\xed\\x8e\\xcb\\xd3M\\xa6s\\xa5d?\\xa91\\x92\\xf4,{\\xe5\\x9d\\xda\\xab~\\xf5\\xdd\\x92\\xd5q?.\\xc7?l\\xe0\\xb8\\xe2\\x93\\xef]!\\xd2\\xf2\\x1d\\x12\\x7f+,\\xbe\\x83\\xed\\x1f\\x10\\xc5\\x9e\\x17\\xd6nr\\xbb\\xba.\\xa2\\x8d\\x0fD\\xb1\\xf9\\xce\\xa3&\\xc9\\xb7\\x84\\xefF\\x07@\\x14\\xdb^\\xb5\\xfe\\xc3p\\xc7\\xaa\\x96:\\xd7!\\xd2\\xd6C\\x92w`=\\xee_\\x86o>\\xa2M\\xba\\x02\\x91\\x96\\xdeHv\\nX\\x8f\\x83\\xbeg5\\xaf`\\x07_\\x8c\\r\\xdf_w-0!\\xd8\\x05\\x8f\\xd3\\xf8kc\\xfb\\xba{\\xf7\\xaa\\x96i\\xe7\\xf8y\\xd6t\\xd8\\x81\\xaeqG\\x0f\\xe0\\xf2\\x7fm\\x9cJ\\xa5\\x97\\xfc\\xda)t\\xd3\\x96\\xec\\xaaC \\x8a=N\\x1f\\x0e\\xfa}\\xbe\\xb2k^*D\\xb1\\xc7\\xe9\\xfa\\x93\\x9f,\\x88\\xee\\xf5\\xa7\\x0bDZ;\\x05Q\\xff\\x01v\\x8a\\xfb\\x11\\x9e\\x81n{\\xc6\\xb6\\x82\\x08\\xe9\\x80d? \\xe9?\\x85\\xc5\\xaf\\x17t\\xae\\xd1\\xec\\xc9\\x07\\xb3\\xa6A\\x14\\x9b\\x0er\\x87\\xd5xzs\\xf64=\\xc4\\xa2f\\x87\\xbdF\\xa8\\x07\\xea\\x8d3\\x16d\\xc9\\x17\\x84-*\\x07Qa;\\xaf+;\\xf1P?\\x9f\\xf4\\x11$\\xfb\\x0e\\xad_\\xd3\\xc1\\xad\\xa1\\xc7f\\xb3\\xa2?DL\\x07e\\x02\\x966\\xd4m\\xcb\\xf6\"\\xf9\\x17Ht\\x00\\xebq\\xaa\\x99[n_\\x95Z3 \\xb2\\xea\\xa7Y\\xe3\\x03c\\\\\\x9an\\x9b\\x84\\xcb^k\\xaf\\xd5\\x90G\\x059c\\x84v\\xe5\\xcaO*\\xa7\\x9e\\x1c\\xec\\xbbe\\xbe\\x9dt\\x10|\\xf4\\xae\\xff\\xb0k\\xb7\\x83p9\\xa1l\\xcbe\\xfe\\xdf\\x96]\\x02\\x91\\x03\\xe7\\xed\\xf5\\xa3\\xc3vc\\xa5\\x03Z~\\xc0j? \\xd9\\xc5\\xa0\\xfd\\xe0F\\xec\\x1f\\t\\xad\\xfe4GA\\xa4\\x95Ch\\xe9\\xedX\\xf0\\xa4\\xa5\\xbf\\x8f\\xfaj9D\\xb1\\xe5\\xaa\\xf7\\xa2\\x0f6\\xcb\\xde\\xa9\\x8f\\x80\\x08\\xed!\\xf6\\xea\\x0b=\\x17\\x7f\\xed\\xbf\\xffzY\\'\\\\\\xee\\xdb\"a\\xfa\\x81\\x0b+\\xea@\\xc4\\xfd\\x83\\xe7m{\\xe5\\x10\\xc3\\xdd\\x1b\\x7f\\xb4\\xdao\\xa8\\x82\\xcb\\xacz0I\\x0e\\x81z\\xb0!\\xdd\\xb9\\xabzP\\xe5=\\x10i\\xe7S\"\\xbf\\x06\\xf3\\xe9\\xc0\\xdf\\xc6\\xcf\\x9c\\xb3f\\xe06\\x88\\xb4tP\\x06\\xb4\\x1f\\xfe;\\xa4\\x03V~@\\xea\\x1fXOQ\\x8b\\x0f!\\xc9!\\xb4\\xf3\\xe9\\xbb\\xf8\\x90\\xd7\\xeb!\\xf5\\xcf\\xbf5>\\x84\\xb6\\xdd|\\xff\\x8e\\xae\\xfe\\xbd\\xb9\\xe9p\\x88b\\xf3\\xeby9\\xb7\\xf7\\xdc\\x9e\\xf6S\\x1cDh\\xdf!\\xd1\\xf5mB\\xbbA\\xfb\\x8eTv1\\xb7Z\\xc6N\\xcf\\xb2\\xf3\\x9c \\x8am\\xbff\\xd5OI\\xfc@l\\xbd\\x84\\xd4nP/\\x89po{\\xfb\\xc0D\\xc3\\t\\x88b\\xfb\\xb75\\xde\\x19!\\x1a\\xf7M\\xdf@\\xa4\\xf5\\xff\\xd0\\xfa\\x1bO,K\\xe6\\xce\\r\\xd9\\xfd)D{\\xfdL\\x05\\xd5#\\x95\\x9fi\\xee\\x91\\xe6N\\x83\\xbf\\xa8\\x1a\\x0c\\xf1\\x85\\x1c\\x9fP7\\xf3\\xc7\\xa5\\xfd\\xce\\x92\\xfcL\\x0f\\x08\\xfd\\xb35g\\xd8\\x81&\\xef-|!W\\xb1\\xca;\\xf7\\t\\xf5@y\\'\\xb8\\xb5\\xfb\\xc8IS\\xf6w\\x868\\xccv~\\x96\\xab\\xb9\\xaa2\\xa0q+\\x12\\x7f\\xbbG9~X\\x9f\\xe7\\x19\\xe5\\xf3\\xa4\\xa5\\x8c\\x0b\\xfc\\xa2\\xc7\\xa8\\x93\\x10q=c\\x9fMtr\\xf8<\\xcf\\xdb^91\\xd7\\xe5\\xb1\\xc13\\xce\\xdd\\x82\\xcb\\xb4r\\x08I\\xde!\\xd15\\x1c\\xa7\\xf6\\xce\\xdb\\xb4t\\r\\xe7m\\xd9\\x8a\\x13\\xdf\\xb6\\xda\\x98\\xd1\\x0c\"\\xad\\\\E\\x8cw\\x01\\xcfSP\\xff\\xd4\\xb2\\xfcTv\\xe1\\x19\\x9f\\xed\\xf6\\xd2A\\x80*\\xb3\\xef\\xcc\\xf9\\x7f\\xee\\xc4eVz\\xbbNIo\\xac\\xf1U\\xb9\\x94\\xe3g\\xe7o\\xe5\\xaf/86\\xfc\\x04D\\xccG\\xfb\\x1eo\\xe7t\\x7fn\\xbb;\\xac\\xfa\\xa9T|\\xd4\\xf9\\xe0\\xbc\\x0e\\xbd\\x83,%!B\\xfd\\x94d\\'\\'\\xcd\\xdbP?\\xbd\\xd1\\xe0\\x91\\xbfC\\xd3G\\xf5 \\xe2\\xb8\\'\\xafA\\xcb\\xce\\xed\\x1e\\xb7\\xbb\\x98\\xbd\\xf1\\xb0\\xd1y\\x8a\\x9b#\\xfa-\\xda\\xfc\\xa2\\x1d=o\\xd6\\xe8y\\xc3r\\x1a\\xa2\\xd8\\xf2N\\xaaK\\xd0\\xc7cL\\xcbU\\x10\\x8b\\x9a\\xbf\\x9eV\\xde\\xe9=\\xbb\\xd2\\xb1\\xdd\\x1fo+\\x8f\\xf1\\x9b\\x96\\x9f\\x1a\\xd6\\xb7\\x89\\xda\\x08\\xe5x{\\xe5\\x1d(\\xc7\\xb3\\xdaG/\\x10\\xea\\x81\\xf6\\xd1\\xcaY5\\xbbL\\x7fd\\x1e\\x02\\xd1^\\xf9\\x1a\\x9aCK\\x876\\xd9\\xab\\t\\xf9\\x13/o\\xf8\\xcf\\xc5\\xc7w\\xbauf\\xfd\\xe7\\x1dV\\xbe\\x07Ql=+\\xa5\\xfb\\xa1\\xe9y\\xbbz\\xcf\\x87H\\x1bwK\\xa2\\xb7wq\\xb7\\xe2\\xe8%\\xac\\xe3\\xf4o\\xcaq\\xcaj\\xbf.\\x05\\xda\\x0f\\xbf`\\xff\\xcc^(\\xb8%\\x85UP@d\\xf5k^\\x9fW1\\xf8\\xcc\\xda\\xcc\\x87\\xb8<\\xe4\\xa9\\xe3\\xdc!\\xce\\x1b\\x06a<\\xb1y\\xcb!\\xd5\\xaf\\xdd\\xfaa\\xba\\xe6\\xd7\\xae\\xf0\\xaf{m\\xc3/\\xf6\\xces\\xd3\\x8f\\x04G\\xf7:\\xb3\\x11\\x9b\\x1b\\x1dfN\\x0b,=\\xce\\xc3\\xb33DH\\x07\\xa4xKZ\\xfb\\x9b\\xaaw\\xfc\\x98z\\x97\\xab\\x96\\x87(\\xf6\\xf8\\x11\\x8b_\\xc3z \\xbfnvm\\xb7f]X\\xf69\\x8cy\\x936\\xdfk\\xef\\xe0WZ\\xecy\\x8e\\xd6\\xcfd/\\xbf\\x86~&V\\xbd\\xbe2\\xa1\\x1e\\xd8?\\xac\\xeb\\x7f*Q\\xd6s!u\\xf6\\xd9\\xd5\\xc11\\x99\\x10\\xa1\\x1f\\xc3\\xdeu\\xae\\xb0\\x9e\\x8dY\\x81?\\x9f=\\xdb\\xbb\\x1cD\\xb1\\xe9Z*\\xbe\\x93\\xbb[\\xf6\\xf1\\xc9\\x92+B bF\\x1b\\xdc\\xa0\\xca\\xda\\xbfF\\xdf\\xd1\\x07\\xa5\\x1cZq^pZ\\x81\\xedF\\xd3\\x0b\\xb0+g\\xbe_\\x7f\\xd1\\xc45.\\xd5q\\xd9u\\\\\\xf5[\\xfak\\x9f\\x04a\\x8c\\x9c\\x92\\xf9e\\xce\\xbd\\xe04\\xda\\xf1C\\xbb\\xde\\xec\\xeb\\xee\\x87\\x17\\xd6\\xe91\\xf61\\xc4\\xa2\\xd6?\\xa4v\\x83\\xfd3aw\\xefAKrJ\\x95\\x81(6\\xdfQ\\xb6Q\\xceP\\xcc\\x1b9\\x15\"\\x94\\xdf\\xb0>\\x07\\xfd\\x18$\\xbb\\x98\\xd8v$Z\\xbb\\xd8\\x97\\x95N\\xa4\\xaf;\\xd6\\xc4\\x1f\"^\\xc72\\xf1a\\x9d\\xb5?$l<Lj7\\x92],+\\xb2\\xadc\\x9b\\xbc\\xd2\\'q\\x99$\\xef\\xd0\\xd6s\\x97\\xb2\\x1e\\xd6v#\\xc5\\xf7\\xc2v\\x93\\xca_Ok\\x87%\\xc5+\\x13\\xe3\\xc5\\x80\\x1d\\x96;r\\xb2R\\xd6\\\\E\\x00D\\xb1\\xf5\\x92\\xcb\\xe3\\xe6\\xefI6\\xa6\\xfb@\\x84\\xfe\\x1fR|\\x08\\xc9\\x8e\\x04\\xfd?\\xfaQ\\x8e\\xf2\\x0f\\x9d[* \\xd2\\xae\\x0f&\\xf5\\x0f\\xd4\\x7f\\xb8qa\\x97#\\xdcS\\xcaB\\xa4\\x9d\\x17H\\xfd\\x03\\xe7\\x05\\xa9\\xf4\\x1f\\xda\\xf5f$\\xfb\\x0e\\xad_S*;\\xf9\\xc8\\xee\\xc7\\xd6\\xb9\\xfb%\\xde\\x84(6]\\xb3\\xae/\\xa1\\x8d\\xef\\x95J\\xde\\xf9\\xde/\\x93\\xf3Zz\\xbb4DH\\xd7\\xd0_o\\xaf\\xbc\\xb3\\xea\\xc0\\x1c\\xcf\\x9f\\xaaf\\xb4\\x81(v\\xdc\\xa0T\\xf2hQ\\x8b\\x0fa\\xb5S\\xb0\\xc6\\xdd\\x92\\xda\\xad\\xa0\\xf8\\x10\\x8c\\xa4v\\xa3\\x8d\\x0fa\\xf53\\xe1\\xfe(\\xaa\\xf1!\\xd8\\x1e\\n\\x91\\x96\\x0eH|Gl~M\\x9a\\xb7!\\xbf\\x9e\\xa6\\xbe\\xd9\\xb3X\\xb9\\x9d\\xefa\\x0co\\x90Z\\xbd\\xd5\\x88\\xc8\\x89p]\\x01\\xc9\\xefL\\x8a\\xef\\x85\\xeb\\n\\xa4\\xb2[J\\x15\\xef\\x7f\"\\xdecU=\\x9dOM\\x88b\\xe7CQ\\xfc\\x92dl2\\xbb\\xffR\\x88b\\xf3k\\xd6x\\x17\\xda\\xfe\\x91J\\xae\\x92*\\xdeE\\xac\\xf5\\xce\\x05\\xb5[Q\\xf3\\x9f\\x92\\xf8\\x01I\\x0f~\\xe7?}\\xe7?\\xb5\\xbe\\xc4\\xf6\\x9f\\xee&\\xd4#\\xb6_\\xa6$h?\\xfc\\x82\\xfdC\\x8aw\\x11\\x9b\\x0e\\x96\\xa7o\\xa9\\x18\\xe7\\xf5q1\\x88\\xact\\xe0\\xfb\\xf9\\xe0\\xa3\\x9b\\xeb\\xae\\xe8\\x80\\xcb\\x93\\x0f\\x7f\\xffI\\xa9\\xb4]\\xc9\\x10\\xc5\\xe6\\xa3\\xac\\xf2\\x0e\\x89\\x8fBy\\x87v]\\x81\\xbd|\\x14\\xae+\\x90\\xca_\\xd2\\xa1\\xfd\\x04n\\x8f\\xef=\\x01\\xa2\\xd8\\xfav\\xeb\\xd1\\xf1\\xc3\\xdb\\xc7UI\\x85(\\xb6\\x7f\\x9b5>\\x9ev\\x9d\\x04\\xc9/\\xc3j\\'\\x87\\xed\\xd6\\xc9\\xe7\\xcc\\xe7.\\x8ec\\x93 \\xd2\\xae\\xe3\\xc7\\x04U\\xd0\\xf8\\x91J\\xdf\\xeex\\xbb_?s\\xd3\\xf9\\xd1\\x10\\xc5\\x96\\xdfF\\xee[[z\\xe7\\xd6\\xbc\\x18\\x88b\\xf3\\x9df_v\\x9e\\x17\\xa1s\\r\\x87(v\\xbb\\xd5\\x1b\\xd7\\xbc\\xb7\\xc3\\xd3\\xf4a\\x10i\\xf5\\x05\\x12\\x7f\\x83\\xe3G\\xaa\\xb8\\xce\\x8b\\x03\\xbf\\xf3\\xdf8\\xfb\\x97a\\x10\\xff\\xbf\\xe4S\\xa5\\xed\\x1f\\xd6\\xf52o\\xdb?\\xf6\\xdaC\\xde\\xd6\\xaeL\\x1b/F\\x1a\\xa7\\xa4\\xfc\\x07\\xb0\\xdd\\xa4\\xb2\\x8b\\xd1\\xdaaY\\xfd\\xce\\xb4vK\\xd6\\xf5f\\xb4v\\xcbm\\x84znR\\xd6S\\xd4\\xe2\\xd2X\\xf3\\x86\\xd3\\xc6\\'\\x92\\xfa\\xe7\\n\\xa1\\x1e\\x18\\x9f\\xa8\\xe3\\xdb>>\\xfdp\\xd2\\x1a\\x88b\\xe7\\xebd\\xd5\\xb3H\\xf3)\\xd4\\xb3X\\xf5\\x9f\\xb26,H\\xcf\\xfa\\xa6\\xca\\xef\\x8d\\x85O\\xae\\xbbB\\x14\\x9b\\x0eX\\xf5\\x12\\x9c\\x97\\x00\\xd6\\x03\\xf5\\x12V?\\x13\\xc9\\x7f\\n\\xfdL\\xf7\\x9a\\x069\\xfe\\x18\\xf7A\\x10D\\xb1\\xe5\\x10\\xd6\\xf52$>\\n\\xd7\\xcb\\xd0\\xdawH\\xf25\\xad\\x1c\"\\xd5\\xfa\\x12V9\\x9e6/\\x8eTqB\\xb4\\xeb5Y\\xe5\\xf8\\xfa\\xb7?\\x0e\\xbcv*%\\x03\\xe3x\\x1f\\xf7/\\x9c\\'NK\\xc4v\\xcb\\xb7\\xd5\\xb7U\\xc1\\xef]\\xad\\xd1\\xe5\\xf2\\x0b\\xb9\\x8a\\xd6\\x0eko\\x9e\\xb9\\xcdS\\xbd\\x1e$}\\xd3\\xac\\x15.Ke\\x1fe\\x8d?\\xa0\\x95C\\xa4\\xca\\xb7\\xfes\\x8d\\xda\\xfc\\xfe\\xab^# \\x8a\\xed\\x97\\xf9\\xf3\\xaf\\x12\\xeb\\x0el\\x9a\\x9a\\x8d\\xf1\\xe9\\x83`\\x1f\\xf9\\xd0\\x9a\\xc7\\xc5\\xb6\\x8f\\xb2\\xea?D\\x7f#\\x90{\\xa5\\x8a{\\xd2-\\x19?\\xfad\\xd9\\xe0\\xbd\\x10\\xc5\\xb6Wa?&D\\xdau\\xef$?\\x86\\xd8\\xeb\\xdei\\xfd\\x8d>Mn\\xee\\xf3\\xee\\xfa\\xf9(\\x88b\\xd35\\xad\\xdd\\x85\\x95\\x1fHe\\'?1\\xf9\\xd0\\x8e\\x88t\\x8d\\x0bD\\xb1\\xe5D\\xd6\\xe7!\\xad/)\\xac<fR\\xf9i\\xbf\\xbf;~g^\\xaf\\x0fWb\\x8c\\x0e\\xb95Ls\\xa5GG\\xb1\\xe3\\xaf\\xff\\xbf\\xaes%\\xf9iI\\xf1\\xbd\\xd0O\\xdb\\xe2h\\xe0\\xd1\\x1f\\x92]e\\x10\\xc5\\xce_E\\xcbG7\\xda\\xd9n\\x90\\x8fN\\xbd1\\'+(q\\xc57\\x10\\xc5\\x9e\\x7f\\xb2\\xc2\\x94\\x99\\xd327p\\x18;\\x9el\\xd0|\\xca\\xdc\\xe2[\\xc5\\x96\\xdfN\\x1e\\xac\\xb5\\x7fm\\xe5g\\xdb!\\xd2\\xf2k\\xda\\xf5\\xf5R\\xf9\\x17V\\x8c\\x9b\\xf9\\xa8\\xd1v\\xd7\\xc6\\x10\\xc5\\xe6\\xd7\\xac\\xf6\\x90s\\x84z\\xc4\\xf6;c\\xbd\\xbe {H\\xfd\\xfa\\x7fh\\x1b\\xcf\\xde\\xd8\\x03\\xe3\\xa6\\xee\\xde\\xa3\\x9e\\xad\\xad\\xe1I\\xcbw\\x88q\\xaa~YW\\xaf}\\xf7 \\n\\x97\\xfb\\xf9\\x05\\xa6\\xde\\x1e\\xf9\\xc9,\\x88b\\x8f\\x9f//\\xb4)\\x17\\xd8\\xaa\\xea\\x87\\x10\\xc5\\xce3\\'U\\xde\\xa2\\xae\\x1doo\\xbc\\xb2\\xa8L\\x08\\xc4\\xa2\\x96w\\x9f6o\\xd1\\xa2\\x93\\x1b\\x16.T\\xc9\\x16A\\x14[\\x1e]Q!\\xa5\\xf9\\x83\\x87\\xbb\\xb7a\\x1c\\xf0@\\xedxk\\xaf\\xf0\\x99\\xd8zV\\xe6\\xaf\\x99\\xda\\x9c\\x9aa\\xcb!b~\\xf0A\\x17\\xa1\\xe3\\xfb[\\xa3r\\xed\\xb5\\xef\\xa8\\xcf-\\xfbv\\xc7o\\xebN\\xe1\\xf2\\xcdv\\x9d\\xffl\\x9d\\xed\\x7f\\x08\\xa2\\xd8\\xe3\\x87\\xd5\\x1eO\\x9b\\x97\\x9a\\xd5\\x8eDZ\\xff\\x03\\xedH\\'.\\xb6\\x7f\\xb8a\\xec\\xedE\\x10i\\xfd\\x8d\\xb4\\xf1\\xcaR\\xed/\\xe3w,\\x93\\xcf\\x19Q\\xe5\\tD\\xb1\\xe5k\\xd6\\xf8QZ\\xf9\\x80u\\x1f\\x1bR\\x9e9\\xb8\\x8f\\rk\\x1e\\xcd[\\xa4\\xe7\\x01\\xf6\\x10\\xafV\\xbeMf\\xe4\\xc9\\x9bA\\xa4\\x1d\\xa7\\xacy\\xcch\\xe3\\x91Ht\\r\\xe3\\x91X\\xed;\\xc4y\\x0e\\xd8w\\xca\\xd7\\x8a)\\x9e{jY?\\x88\\xb4v\\x17\\xda\\xf5f\\xbf}\\x10\\xda\\xbe\\xf8wc\\xfbb\\xec\\x1c~\\xe1\\xca\\xf0\\xed\\x15\\xa6\\xc0\\xb8\\xf5\\xadv\\xf2k\\x18\\xb7.\\x95\\x9d\"H\\xb1U\\xf5\\xcbt~\\x10\\xc6\\x06\\xde>\\x1e\\x19C\\xb2:\\xd3\\xces\\xa4z\\xfe\\x91wE\"9\\xfe\\xde\\xf0c\\xba\\x98n3GB\\x14[>\\xf80\\xa7\\xe2\\xb6\\xa5\\xb5\\x8f\\x95\\x84(6\\x1f\\rh\\xea\\xdb_3{\\x893D\\xb1\\xe3\\xf0]6\\x05Fv\\xb9\\x9d\\x9b\\x00\\x11\\xf3\\xd1\\x82\\xf2\\xea\\xd2\\xce\\xdb\\xac|\\x94\\xb4\\xae\\x1a\\xf2\\xd1\\xa2\\xb6>\\x8b5\\x1e\\xe9\\xfd\\'&\\xd3\\xa8\\x8fL\\x02\\xc4\\xc2^\\x9f\\xf5\\xb6\\xf2\\xce\\xff\\xd7x$\\xd6\\xfc\\xbd\\x9e%\\'\\xce\\xab:yA#\\x88b\\xcb\\xf1u\\x06_\\xfeMu\\xa4\\xff=\\x8c\\x07.\\xdf\\xaa$h\\x1aW\\xc2\\xf3\\xdc\\x15\\xf7\\xcfWO\\x0c\\xd5\\xe4\\x92\\xda\\x8d\\x94o\\xd0ky\\xc2\\xe22\\xaeC\\x9f\\xe2\\xb2T\\xeb\\\\3\\x15wc\\xf4_=\\xf9\\n\\xa2\\xd8\\xfc\\xa0\\xbeG\\x8d!5\\xf2\\xb2\\xbe\\x81(\\xb6\\x1fC\\xaa\\xf9\\x945\\xde\\x9f\\xc4\\xdf`\\xbc\\x7fj\\xc7\\xe1\\x1d\\xea\\xed\\xdeP\\x1c\\xa2\\xd8\\xf1!EM>`\\xd5\\x1b\\xff-\\xf6\\x10\\x92\\x9fI\\xecu9\\xe7\\t\\xf5\\x88m\\x1fu\\x04\\x88_p\\xfc\\x94\\xd2w\\xfekA\\xee\\x890\\x8c\\xb8\\x7f\\xc4\\xcekxg\\xfb\\xa1^7\\x1e\\xf9.\\x83\\x08\\xed\\x96\\xa4|\\x1b8\\xfe\\r\\xd6\\x03\\xed\\x96\\xf3u\\xbb\\x86\\xd4o_>\\x1d#\\x94w\\xf0\\xf3\\xd8\\x1b7\\x08\\x9f\\x87\\xb5\\x7fh\\xe3\\x91X\\xf5,Z\\xbb\\xa5T\\xeb\\xa6*Tsi\\xa5}0M\\x0b\\xb1\\xa8\\xad\\x9b\"\\xcd\\x0b0>\\xb1\\xa8\\xc9\\xf1\\xf6\\xe6\\xf9\\x81\\xf5\\\\2l,\\xff\\xb71\\xa0\\x12F\\xb8?:\\x8e\\x17\\xb37\\xde\\x05\\xae\\xcf\\xea}\\xa1k\\x8b\\xae\\x07/\\xce\\x80(\\xb6\\x9cx/g\\xe8\\xc46c\\xba\\x95\\xc7\\xf8d\\xef\\x0fc|\\x16\\xb9w\\xc0|\\xa7\\xdd\\x90\\xd9\\xdc\\x9d#e\\xdd\\xec\\xf5\\x97\\x94(\\xbb\\xa9j\\x97\\xb6\\x0f\\xa7\\xe0\\xb2Tq\\x83\\xd3\\x92\\xbe\\xaa8\\xc4_?\\x02\"\\xa4\\x83\\x0c\\xc6\\xf1S\\x90\\xfd\\xed\\xdc\\x90\\xf6}\\xbdkf_\\xb7\\xd7\\xbf\\xbd\\xea\\xb2_\\xee\\xc3\\xc3^/\\xf6\\xe9b\\xf5\\xcf\\x11\\xdb\\r\\xf8\\xe7\\xf6\\xa4\\xdd\\xab;\\xe1\\x03\\xd9\\x1f\\x10\\xe1\\xfc\\xb3\\xc9N>\\n\\xe7\\x9f\\xb0\\xd2?yT\\x9cr5\\x11\\xe2\\xbf5\\x9f\\xdd\\xbe<\\xd38S\\xc2\\x86\\\\\\x88b\\xf3\\xeb\\x7f\\x8b\\xbe@;\\xcf\\xd1\\xcaU\\x85\\xbdN\\x9c\\x14\\xef\\x02\\xe5Q\\xb1\\xda\\r\\xca\\xa3\\xb0\\xddh\\xf3\\'\\x92\\xf8\\x01\\xc9o&v\\xfc(\\x89\\xde\\xa0\\xbd*}\\xa3s\\x80K-ee\\x88\\x90\\xbf\\x91\\xec\\x14$:\\xe8$[\\x1dP\\xe2I\\xceR\\\\\\x96\\xca\\x8fA\\xda\\xb7\\\\\\xec}\\xb1Ir\\x15\\xac\\xc7\\xde}\\xee`=$\\xb9\\n\\xd6C\\x8a\\x17#\\xf5\\x0f\\xac\\xe7\\xfc\\xac\\xf9w\\xef\\x0f\\x9a\\xf8!D\\xc8\\xdfH\\xf3)-\\x7f\\x93*_\\r\\xedz@\\xcc\\xdf\\xe0z@R=p= \\xab\\xfeC\\xbb\\xbf\\xe6\\x83\\xeaGV\\xd6\\xbd\\xd2x.D\\xb1\\x9f\\x87\\x95_\\x93\\xfc\\x18\\x90_\\xb3\\xc6\\xbb\\x94\\xb6aA\\xf6\\x03Z?\\xad\\xbd\\xfe9\\xb1\\xf7\\xa3\\xc4yJ`=P\\x9fc\\xdd\\x1f\\x9d\\xa47\\x8a-\\x87\\x90\\xe4k8\\x9fV\\x8d\\xe4T\\xf5\\xfb\\xf4o\\x0e\\xb1\\xa0u\\xbbSm\\xf5\\x92\\xe6\\x05H\\xd7\\xe7\\x82GL\\r\\x1b6-\\x18\"i\\xde\\xc6\\xf7\\x9d\\n\\x9e\\x0f\\xd6\\x03\\xe7m\\xa9\\xe69\\xbc\\xae\\x15\"\\xaeG\\xacy\\x8eu\\xbfCZ~\\xdd\\xbd\\xff\\xb2\\xd9\\x8b\\x17O\\xf9\\x15\"k<\\x12\\x8c\\xe7{[z\\x9b\\x0e\\xf8jA\\xf4F\\xf2\\xcf\\x89\\x1d\\x8f\\xb4\\xffq\\xde\\xc7\\xeb\\x97\\x94\\xef\\x0c\\x11>\\x8f\\xbd\\xeb\\x0e\\xdfv\\xfc\\x90\\xf6\\xdf\\xa6\\xb5_K\\xb5\\x1e=\\xee\\xaf\\xf3Q\\xc7\\r\\xe7OB\\x14;o\\xabT\\xf9\\xecX\\xe7m\\xd2\\xba)8o\\xb3\\xea%x\\xc2\\x84\\xf36\\xd4KX\\xe5\\x03\\xda\\xfd$n]h\\xdf\\xe0lL\\x8du\\x10\\xc5\\xce\\'\\xb4\\xe5\\xf4Q\\xf3w\\xde\\xc3KC\\xa4\\x95\\xdfh\\xc7\\xe9;;\\xc5\\xeb/Z;\\x05\\xeb\\xbe\\xd8$\\xf9\\x00\\xb6[Q\\x91w\\xe0\\xbe<P\\xde!\\xf1\\xeb\\xc2\\xcaO>9!y\\xc9\\xdc\\x8bS\\xebA\\x94\\xaa\\xddBl\\xe7+u<\\xba\\xf9\\xfc\\x84\\xb6\\'H\\xedV\\xd4\\xf6\\x13\\xef.\\x9f\\xf1Q\\x89\\xdf\\x03\\x16B,,z\\x83y\\x9c\\xedm7Vz#\\xc9o\\x90\\xde\\xa4Z\\x97s\\xff\\xe7\\x86\\x1fW(\\xde\\xca\\x11\\xa2\\xd8~&\\xec\\'\\x83\\xc8\\xba.\\xe7\\x1fyq\\x06\\x0c\\xa9U\\xcem\\xf2\\x19\\x88b?\\x8fTy\\xd9\\xca\\x17/\\xed\\xdc\\xefP\\x99/ \\xc2z\\xec\\xd5\\x7f`=\\xb4q\\xaa\\xac\\xfbIH\\x95\\xef\\x96U\\x9f#\\xd9C\\xa0>\\xf7h\\x9a\":d\\x8d>\\x10\"-\\x1d\\x90\\xec!\\xb0\\x7fX\\xe7\\xed\\xff+\\xbd\\x11\\xf2Q\\xda\\xf1c\\x98;.rSfX\\x7f\\x88$\\xbd\\x11\\xd6\\xc3\\xaa7\\x92\\xf4,\\xda\\xe7\\x81\\xf5\\xb0\\xc6y\\xd3\\xe6\\xf7\\x97j]\\x01\\xed~9\\xac\\xfa\\xe9\\x04\\x9f6\\xdb\\xcf\\x8c\\x19\\xf7=\\xc4\\xa2\\xa6\\x9f\\x92\\xf2\\xd9\\x15V\\\\\\x1a\\x8c\\xe3\\xc2\\x18b;\\x7fJ\\xb6\\xf0~\\xd5e\\x17\\x17I\\x15\\x97\\xc6\\xba\\x9e\\xf6\\xda\\x95b\\xbf\\x8e\\xf9\\xec\\x99\\x1a\"\\x96w\\xca\\x04,m\\xa8\\xdb\\x96\\xedE\\xb2\\xef\\xd0\\xd2\\xb5TqiE-_4)n\\x904o\\xc3x\\xa4k\\xae\\x1eg\\x9c\\xebd&C\\x14\\xdb\\x0e\\xeb5fi\\xd6\\xad\\xcd\\xfaj\\x10\\xc5\\xce\\x17-\\x95\\x1f\\x906.\\x8d5\\xfeM\\xaa\\xf5\\xceR\\xd9w\\xca\\x8c\\x8a\\t\\x9d\\xcc\\x15k\\n\\xb1\\xa8\\xe5s\\xa0\\x8d\\x0fq\\xaa\\x99[n_\\x95Z3 \\xda\\x1b\\xc7\\x05\\xe7\\x85\\xac\\xf1\\x811.M\\xb7\\xbd\\x88\\x17+\\xe9V;kW\\xfc\\xca\\'\\x18\\x9b\\x8c>\\xd1\\xb2\\xaf\\xa7\\xfb1\\xb1\\xf3\\xd9\\xb1\\xe6?\\xa0\\xf5\\x97\\xec\\xd89\\xb9\\xfe\\xa5#\\xb2{\\x10\\xa5\\x92{1\\x1d\\x90\\xf6\\x9b*HN\\x84\\xeb\\x99\\xa6\\x1e\\x0eT\\xdf]\\xb9\\xea\\x06D\\xa9\\xe4\\xde\\x7f\\xab\\xbf\\xb1 9\\xa4\\xa0\\xfd(I\\xf2ua\\xf9\\x1b\\xa5\\xca\\x1fB;~\\xe6\\x80\\xf1\\x82\\xe5x\\x92]\\xac\\xb0\\xfc\\x8d\\r\\x92\\xfaM\\xf3oP\\xc6\\x0b\\xa2\\xd8\\xfeF\\xd6y\\x81d\\xbf\\x86\\xf3\\x02k~\\xf22\\xa0\\xfd\\xf0\\x0b\\xdaa\\xcfm1\\x8eh\\xf4m\\x07\\x05D\\xday\\x9b\\x94\\x8f\\x18\\xf6O\\xee\\xdeS\\xc3\\x1e\\xe4]\\x94C\\x14\\xdb\\x9fu\\xd0\\xad\\xf2NY\\xf5\\xd1\\xe5 \\x16\\xb5u\\x12\\xb4q5R\\xcd\\xa7\\xd1\\x8f\\xaae:\\x9d1\\x05C\\xfc\\xb7\\xda\\x91\\xaa_\\xba\\xb7\\xce\\xadRW\\x7f\\x88Em>\\xa5\\xd5\\xb7\\xef/\\x1d\\xedy\\xf2\\xb3\\xcdu0\\xc2yN,\\xf9\\x8d\\x14o)\\xf6<\\'\\x95\\x9e\\xf5n\\xfc\\xbc^\\x0f\\xed\\xf8\\xc9I==zm\\xcb\\x0b\\xc5 \\x16\\x96\\x1dv\\r\\xa1\\x1eR>\\xa1\\xc2\\x8a\\x1fe\\xcd\\xbfC\\xd2\\xe7\\xa0}\\xa7\\xfa\\x93\\x1fMa\\xce\\x8f\\xcfc\\xfc\\xbf\\xda\\x0f\\x8cu\\xfc\\x90\\xe8\\x1a\\x8e\\x1f\\xa9\\xf28\\xa7t?4=oW\\xef\\xf9\\x10\\xc5^W]|\\xf2\\xa8\\x8f<\\xaf\\x0f\\xdf\\x03\\x11\\xca!$\\xbb%\\xad\\xdfL*\\xbb\\xffn>\\xb4\\xe6\\xfa\\xf7*DC\\x14\\xbb\\xddh\\xf7_`\\x95\\xdfX\\xe3\\xb8h\\xdbM\\xaa\\xf1\\xb3\\xa8I-\\xade\\xee\\xd1\\x89\\x10\\xc5\\xee\\x1f\\xa9\\xec\\x96p\\xbfP\\x8c\\xb4t@;~X\\xe7\\x85;\\x94\\xf3\\x02\\xab\\x7f\\x01\\xb6\\x1f~\\x89\\x9d\\x87\\x89D\\xd7Pol\\xbf7\\xcd\\xfd\\xce\\xd1\\xea\\x83 B\\xff\\x8f\\xbd\\xeb\\xb3\\xa0\\xffG\\xac}<a\\xbbA=\\xcb\\xa1e\\xfd\\xcb\\xbe\\x8b\\xfb\\xd7\\x83\\x88\\xe7\\xed\\xac\\xcd\\xb3\\x9a=\\x9b\\xde\\xeap\"\\xe3\\xfcC\\x9a\\xb7Y\\xe5x8o\\xd3\\xee\\xf7a\\xaf\\xdf\\x0c\\xe6\\x8bf\\xcd/F\\xeb7\\x93\\xcaN\\xfe\\xd9\\x9e\\xf8\\t\\xd5j\\\\}\\x8c\\xb1\\xd9\\xfeK\\x8b\\x16\\xe5U\\xd3\\xc0\\xfe!\\xd9\\x13Iz=\\xd4\\xb3Fv?\\xb6\\xce\\xdd/\\xf1&D\\xb1\\xe5\\x9d\\xee\\x9f5\\x9c\\xdbkJ\\xfcF\\x8c\\xae9q_\\xdc\\x98\\xdd\\x8c\\xdanI\\xdb?\\xacq\\xaa\\xb4\\xf9-Y\\xf9(m<\\xacX\\xf4\\x06\\xeb\\x81\\xf4\\xf6\\xa0\\xe3\\xc3\\xe3So\\x1c>\\x8e\\xb1\\xeb\\xd9\\xb5cn\\x95\\xbaUGl\\xbd^*z#\\xf1\\x1d\\\\O\\xf8\\xde\\xb4=\\xf3\\x04\\xbf\\xda\\xf6\\xd6\\x03\\xf9\\x8e\\xa5Ap\\xb7\\x1d\\xca\\xd3s!\\xd2\\xfa\\x83I\\xf6k\\xb1\\xf7\\x0f&\\xf1Q8\\x9f\\xd2\\xea%\\xf6\\xce\\xa7\\xf0y\\xde;5\\xfc\\xb7\\xf8\\x92\\x9d\\xfe\\x82\\x18j;\\x8f\\xe5\\xdedF{/\\xab^\\x82\\xd7Q\\x16T\\x0fm<\\x12\\xeb\\xfe\\x9aR\\xad\\x97\\x91*\\xff\\x0e\\xeb\\xbe\"$\\xbb\\x18\\xdcW\\x84\\xd5\\x0fH\\xd4\\x7f\\x80\\x1f0\\xe0\\xaf*\\xe7\\xaa\\xc6\\x1c\\xa9\\x03\\x11\\xb7[\\xe5I\\x8d\\x1f_\\xba\\x17\\xb6\\x8fu\\x9d\\x04k=\\xb4|\\xf4\\xca\\xe1<\\x17_\\xf7\\x05\\x1e\\x10i\\xd7\\xd7\\x93\\xf2RC\\xbf&\\xeb\\xfe\\xb4$:\\x80\\xe3\\xc7\\xde\\xfc\\xa3\\xb8\\x9e\\xf1\\xe0\\xf9\\n\\x1a?o\\xeb\\xaf\\x1f_\\x00?x\\xdb\\xfc\\xa30~\\xb4\\xa0z\\xe0\\xf3\\xe0|\\xa3\\x10\\xc5\\xde\\x8fE*{HQ\\xdb\\x0f\\x99\\xd9\\x8eDi\\x0f!\\x8dSb\\xdecP\\x0f\\xc9_2\\xdcv\\xbe\\xe5\\x01\\xb9\\xcf\\x94\\xdb\\xc9}\\xed\\x8d\\xa7\\x80\\xfd\\x83\\xe5O\\x88\\xb4|\\xe7\\x1e%\\xdfa\\x8d\\xc3\\xa7\\xb5\\x8b\\xb5\\x1e\\x1d?\\xbc}\\\\\\x95T\\x88b\\xaf\\xc7\\xd8\\xef]\\xefI;\\x97\\x9dG!\\x8aM\\xd7\\xb4\\xfb\\x9f\\xb2\\xae\\xc7`\\x9d\\xe7h\\xf9\\x01k=7(\\xeba\\x95\\xabHy\\x8f\\xa1\\\\EZ\\xb7\\x0b\\xfd?$\\xfd\\x87\\xb4_\\x01|\\x9eU\\x176\\xdf\\xcfl\\x1bY\\x01\"\\xad\\x1cO+\\xefpGNV\\xca\\x9a\\xab\\x08\\x80(\\xb6\\xde\\xb8b\\xd7<\\xc73\\xf2\\t\\x9d1\\xfe0\\xff\\xc7,\\xa7\\x94x\\x05\\xdc\\x7f\\x81\\xc4w\\xae\\x12\\xda\\r\\xee\\xbf\\xe0\\xe0\\xd6\\xd0c\\xb3Y\\xd1\\x1f\"\\x8c\\'\\xb7W\\xaf\\xa7\\xb5\\xf3\\xd1\\xc6_\\x93\\xe6\\x1fh\\xe7c]\\xa7G;N\\xa5\\xda\\x97\\xf4\\x97\\x1b\\xdbL\\xdeg74\\x83(6\\x1f-\\xb9zW\\xe5\\xa0\\x87\\xb5vA\\x14\\xdb?\\'U\\\\\\xb4Ty\\r\\xbf\\xdc\\xfd\\xe5\\xde\\xb8\\x9e\\\\c\\x88b\\xcbU\\xac\\xfbg\\x91\\xfc\\xf5p\\xff,\\xd6}\\xa4I\\xf2[a\\xf5\\x0fm\\x1e@\\xd6x\\x7f\\xda|\\x9d\\xac\\xf3B\\x9f\\xa01:O\\x87\\xe0d\\x88X~\\xe3\\xd7\\xae\\xf0\\xaf{m\\xc3/\\xa4zH\\xe3t\\xfa\\x91\\xe0\\xe8^g6\\xe20I\\xe6\\xfd\\xa6~\\'\\xd4\\x03\\xf7\\x9b\\xa2\\xcd\\x0fk\\xef\\xfc\\x03\\xf3\\xc3\\xd2\\xda\\x95I\\xf6\\xc4c\\x84\\xe7\\x81v\\xe5\\xe9O\\x8f\\r\\xfd\\xfa~\\xcey\\x88\\xb4v\\xd8g\\x84z\\nk]\\x0e\\xad=\\xb1\\xb0\\xf3\\xd9\\xed \\xd4\\x03\\xfd\\xceb\\xed\\xc3\\x01\\xfdf\\x90\\xefl\\xf9\\xaa\\xf2>\\x8fN\\xa6\\x05\\x18\\xd3\\xe3\\x06\\xa4D\\x7f\\xba\\xea\\x02\\x94\\xdf\\xec\\x8d?\\x80\\xf2\\x1b\\xed>\\xd2\\xa4\\xf1C\\xbb/\\x0f\\xeb\\xfe\\xce\\xb4\\xfc\\xcd)\\xe8\\xcc\\xa9\\x1b7\\xae\\xcd\\xc2\\x08\\xf3\\x82\\xe2v#\\xe5W&\\xf1k\\xd8n\\xb4\\xeb\\x0e\\xed\\xcd\\x0b\\n\\xe3\\xd2\\xa4\\xd2\\x17\\x96,[\\xd2\\xe20\\xdf+\\x1c#\\xccK]\\x90|]\\x8dP\\x0f\\xe4o\\x1b\\xf6\\x86\\x99\\xb7\\xbb\\xfe\\xae\\x82(\\xf6\\xf3\\x9c\\xd8\\xbc\\xe5\\x90\\xea\\xd7n\\xfd \\x8a\\xbd\\xbeQ\\xaa}\\x11\\xa4\\xd2\\x17\\xa4Z\\x8f^\\xeeP\\xce\\xc2\\x96\\x1br;C\\x14{\\xbf6V\\x7f#1_\\x00\\xf07\\x16\\xb5x\\x17\\x92\\x1cB\\x92\\xaf\\xa1\\x1e\\xcc\\xcawH\\xfc\\xad\\xb0\\xe2\\xf9N\\xc4{\\xac\\xaa\\xa7\\xf3\\xa9\\tQ\\xecx\\xbeP\\xc7\\x98\\xc4\\t#g\\xa5B,\\xac}cI\\xfa6\\xad\\x1fC*9\\x91v\\xde\\xce\\xb4\\xb3\\x9e\\xc2\\x9a\\xb7\\xa5\\x8a\\xdfa\\xf5;\\x93\\xe6\\x05\\xe8w\\x1e\\xfc\\xbd\\xe2|j\\x8d,\\xff\\n\\xb5\\xbf/V{V\\xa5\\xa7\\xb8\\xcc\\xba\\xfe4E\\x1d\\xf9\\xa0\\xb9\\xd7\\xe4=\\xb8,U\\xbe\\xdby\\x8a\\x13\\xcd\\x1a\\x04\\xfdU\\x1d\\xa2Tz\\x96\\xd8~&\\x8f;\\xe5\\xe6\\xec\\xdas\\xa0\\x1aD\\xe8g\"\\xed\\xb7K\\x9b?~G@+\\x973\\x97/\\x9e\\x83(U\\xdc\\x13\\x8c\\xb7\\xb4\\x97_\\xc3\\xb8\\xa7\\x13\\x93\\x0f\\xed\\x88H\\xd7\\xb8@\\x14{\\x1fBV\\xbb\\x18-\\x1f\\xfd\\xb9Fm~\\xffU\\xaf\\x11\\x10\\xc5\\x9e\\xe7\\xfe\\xfc\\xab\\xc4\\xba\\x03\\x9b\\xa6fc|\\xfa \\xd8G>\\xb4\\xe6\\xf1\\xa2\\xb6\\xaf\\x08m\\xbe[\\xd68\\xc8R\\xa0\\xfd\\xf0\\x0b\\xf6O\\x8b\\xa3\\x81G\\x7fHv\\x95A\\xa4\\x1d?\\xa4xXX\\x0f\\xeb:d\\xda\\xfc\\xf1\\xac~g\\x12\\xbdA\\xf9\\xed\\xdf\\xb2\\x0e\\x994\\x9fB\\xbff\\x84n\\xf5\\xd0\\xf9\\xd3W\\x97\\x80\\xc8\\xcaG\\x97]Y\\xdc4aE\\xca]\\\\\\x96j]\\x9b\\xcb\\xdc=\\x07NN*\\xeb\\x01\\x91\\xb7\\x9d\\x1f[\\xdc9Z\\xd18{?\\xab\\x7f\\xfb\\xdf\\xe2o$\\xcd\\x0b\\xb0\\xdd&\\x7ft\\xcb\\xa9\\x81\\xd7\\xd0\\xca\\x10\\xc5\\x96CX\\xe7\\x1f\\xda\\xb8uV\\xfeF\\x8a\\x7f\\x13;/5I\\xbe\\x86y\\xa9\\x8bZ^]{\\xf3\\'\\x8a\\xbd\\x0e\\x8cVo\\x94j\\x1de\\x03o\\x1f\\x8f\\x8c!Y\\x9d!\\x8a\\x9d\\xbfJ*\\xbf\\xb3T\\xeb\\x01/L[=\\xa3o\\xc4.\\x0f\\x8c\\'\\x0f\\xd6\\xda\\xbf\\xb6\\xf2\\xb3\\xed\\xff\\xd6<f\\x9b\\x15\\x9e\\xc2W\\xa7\\x1ax@\\x0c\\xb1\\x9d\\xc7\\xf9\\xbcY\\xe9@YE\\xb1\\xf3N\\xabN\\x8d \\xd2\\xe6\\xdf\\xa1}\\x1e\\xa9\\xec\\xbd\\xac\\xcfC;\\x9f\\xea\\xa7n\\x9e\\x14Zq\\xe5x\\x88!\\xb6\\xf30\\xdf\\xfa\\xdb\\xc6\\x87\\xb0\\xfa\\x9dI\\xfc\\r\\xfa\\x9d\\xdd\\xbf\\x0c\\xdf|D\\x9bt\\x05\"-]_\\xa3\\xa4\\x83\\xa5\\xfc\\xed-\\x0f\\xc7_:\\x8f\\xd13\\xa4\\xc9\\x9a\\x94h\\xf9\\x08\\xb1\\xedb\\x95\\xb3jv\\x99\\xfe\\xc8<\\x04\"\\xab\\x1c_:\\xb4\\xc9^M\\xc8\\x9fX\\x9dp\\x08.\\xb6*\\xd3C\\xe3\\xbc\\x1c#\\x8c\\xbf\\xc6|\\x87\\xa4oK\\xa57^$\\xd4#\\xf6>)X^\\x80b.\\xf4/H\\xd5?m\\xe6\\x8c3\\xb7j\\x96\\xb2\\x1f#\\x8c\\x87\\x15k\\x1fv\\xb3c\\x89\\xbf\\xdb|\\xb7\\xa06D\\xb1\\xf3\\xdd\\x92\\xe2C\\xc4\\x8e\\xeb\\x94\\xca\\xffC\\xcaCK\\xeb\\xa7\\xa5\\xd5K\\xa4\\xf2\\xcb\\x90\\xf4F<Nq\\\\Z\\x9a\\x9d\\xfd\\x03\\xe3\\xd2\\xeeLk\\x7f\\xba\\xc7\\xe1\\'i\\x10\\xc5\\xb6\\x8b\\xb1\\xfae\\x8aZ\\x9e\\x92 \\xc5V\\xd5/\\xd3\\xf9A\\x18\\xa1|]\\x90\\x9cH\\xaa\\xa7\\xb0\\xe4DZ\\xff\\x1c\\xab\\x9c\\xf8_\\xb3\\xf7n\\xf8=.D\\xe9\\xdf`>Dl\\xdf\\xa9\\xb1b\\xfap\\xbf\\xb3\\xbd\\xe2\\xec\\xd5\\x17\\xe0\\xf3\\xb0\\xca\\xa3\\xb4~\\xb3\\xff\\x9a|})\\xe4@\\xdc\\x99\\xf5u&B\\x0c\\xb1\\x9d/*\\xf25\\x89\\xae\\xa1|-U\\xbcX\\r\\x9f&U\\xa2\\xfd\\xb7\\xe7b\\x84\\xebB\\x0bZ\\'AZ\\xc7\\x02\\xe5\\xeb\\xa7u\\xa3\\xd7\\xcfp\\xfa)\\x14\"\\xf4;\\xafc\\xa4k\\xb8\\x1eta\\x82\\xe7\\xd9\\x1a\\xde\\x03\\x7f\\x84\\xfc\\x1a\\xc6\\xef\\x8c\\x05\\xf5\\xc2z \\xbf~\\xdbu\\xa1cA\\x19\\xd6\\xf3\\xb6\\xebB\\x97\\x10\\xea\\xa1\\xa5k\\xa9\\xf2\\x12\\xd0\\xae\\xa3\\xb47/\\xc1\\xdb\\xae\\xa3$\\xe9Y\\xb4\\xfb\\xa4\\xb0\\xeaY\\xe7\\t\\xf5\\x88\\xed\\x9f\\xabd\\xc3\\x82\\xfcs\\x1a\\xef\\x8c\\x10\\x8d\\xfb\\xa6o \\xd2\\xda\\xafi\\xf5\\x05\\xa9\\xf2\\x87\\x1cy\\xda\\xee\\xf2\\x8e\\x07W\\xd6a\\x0cn\\xed>r\\xd2\\x94\\xfd\\x9di\\xf3\\x87\\x90\\xf4\\x05\\xe8Gg\\xdd\\xaf\\x9av\\x7ftV\\xff\\x1c\\xc9\\xbe\\x03\\xfds\\xac\\xf6\\x1dR^\\xea\\xb7\\x9d\\x7fX\\xed;\\xa4\\xf9G\\xec|\\xd1R\\xd9wX\\xe9\\x00\\xfb\\xeb\\x0b\\xa2\\x03V?\\x13\\xc9\\x8f\\x0e\\xfdL\\xac\\xf9\\x06I~3\\xb1\\xf77c\\xf5g\\xc1z\\xd2\\xc0}\\x0b\\xda\\x17\\x01\\xd6\\x83\\xf7\\x89\\x85(\\xb6\\xfeC\\xeb7\\xb3\\xd7.\\x06\\xe7S\\xda}\\x86X\\xfd\\xf5\\xac\\xfc\\x9a\\xc4w ?`\\xdd\\xe7\\x81Vod\\x8dC!\\x8dS\\xb1\\xf6\\x95/\\xaay\\xa9\\x87s\\xef\\x7f4e\\xc1\\x82\\x1e\\x10\\x0b+\\xaf\\xbb\\xbd\\xfem8/\\xd0\\xca\\xbd$\\xfb\\x1bi\\x9d\\xab\\xd8r/)\\x0e\\x1f\\xca\\xbd\\x95\\xf2zl\\xbd\\xd3Q\\x19\\x05\\x91V\\xee\\xc5\\xfb\\xa3\\x17$\\xf7J\\xa5\\xff\\xb0\\xe6\\xc5\\xa1\\xe5\\x07\\xac\\xf36i>\\x85\\xf36\\xed~\\xef\\xa4\\xf5\\xf5\\xb4\\xfc`\\x87j\\xb0yj\\x8bJ\\x7fA\\x14;\\xef\\x8aT\\xf3)\\xeb>j$9\\x1e\\xf2\\x03\\xd6u\\xef$\\xba\\x86\\xfe\\x05\\xday\\xe1[\\xd0\\xef\\xdf\\xd8\\xc9G\\xed\\x95{\\x1dA=$}\\xeem\\xf7a\\x87\\xfb\\xa3\\xe3zH\\xfa\\x9c\\xd8\\xcfC\\xab\\xcf\\xd1\\xc6q\\x91\\xfa\\x87\\xa4\\xcf\\xfdC\\x1ee\\xb4\\x8f\\x92\\xec.\\xd0>\\xfa_\\xdb\\x1f]\\xaa\\xfd\\xcdV^\\xbb~\\xb5\\xe1\\xe2\\x85\\xd7 \\xc2u\\x12\\xac\\xebK\\xa4\\xda\\x1f\\xfdB\\xea\\xec\\xb3\\xab\\x83c2!B\\xbb2\\x9e\\x7f\\xde\\xd6^uo\\xf81]L\\xb7\\x99#!\\x8a=/|\\x98Sq\\xdb\\xd2\\xda\\xc7JB\\x14;\\x1f\\x17\\xeb~\\xe2\\xcf\\x08\\xf5\\xc0\\xe7\\x91j\\x1f\\xf6\\xc2\\xd6\\xebI\\xfeSZ}A\\xecu\\x87\\xb4\\xeb\\xaaw\\x7f\\x9e1\\xea\\xa3O9\\x19D\\xa9\\xda-\\xc4v\\x1e\\xc6\\'\\xbem\\xbbI\\xb5\\xcf*\\xab=\\x1e/\\x94,H/\\xc9\\xfc\\xfd\\xfa\\xd1\\xc1O\"\\xceA\\xa4\\xf5\\x03\\xd2\\xc6\\x93o|\\x96\\xd02B\\x1b\\xdf\\x1d#\\xb4\\xbb\\xe0x${\\xf3\\xea\\xfa\\xdf\\xac\\xb2\\xbd\\xf4\\xb4\\xd1;p\\xb9\\xa2i\\xf9\\x965\\xef\\x07\\xd7]\\xbdx\\xbeW\\x99]\\xedKb\\xc4\\xeb\\x01\\xf1\\xbc\\x90j\\xe7|\\xfa\\xfe\\xed\\x94\\xbd\\xa3\\x9e|\\xd0\\x1d\\x97Y\\xd7\\x85\\x92\\xe8\\x1a\\xae\\x0b\\xa5\\x8dO$\\xe5\\xdb \\xc9o\\xff\\xf5\\xf8\\xc4\\xb1\\x96\\xc8\\x0b\\xa7J\\xc6\\x9f\\x86(\\xf6\\xbc@\\x9b\\xdf\\x855\\xde\\xa5G\\xe8\\xe0\\t*\\xe1\\x8fQ\\x10i\\xf9\\x0e\\x89\\x0e\\xc4\\xe6;\\xb4~\\x19\\xd6\\xfe!\\xc9\\xf1b\\xe7[\\xa7\\xb5\\x93\\xd3\\xd2\\x01\\xeb\\xba\\x823\\x03\\xbc\\x17\\xdc\\x1e\\x9e\\xba\\x18c\\xe7bc}K\\xa7\\x9e\\xc9\\xa1\\xd5\\xebI\\xf3\\xb6\\xd8\\xfe\\x9f\\xa2\\xa6\\xffH\\xb5_[\\xf9Z1\\xc5sO-\\xeb\\x07Q\\xec\\xb8\\xdb\\xaf\\xbb\\x1f^X\\xa7\\xc7\\xd8\\xc7\\x10i\\xe3ni\\xd7\\x9fJ5/\\xa8\\x86\\x7fqn\\xfd\\x87{\\xea`\\xfc\\x8a\\xcfZ\\xd9\\xb5\\xc2\\xb1\\xf3\\x90\\xae\\x97\\xd9Io\\xff\\x88\\x83\\xa4\\x94C\\x12\\xec\\xa47(\\x87lR?\\xbb\\xf2\\x89\\xc7\\xfbF\\x88b\\xd3[\\xa9mQ\\xda\\xc5w\\x87\\xce\\xc48vE\\xca\\x84&\\xe5\\x8a\\x97\\xc2\\xf4\\xd6n\\xc8l\\xee\\xce\\x91\\xb2n\\xa4\\xf8*\\x12\\xbf.QvS\\xd5.m\\x1fNy\\xf1\\xdc\\x8c\\xfbp\\x90\\xfc\\xc1\\x85\\x95w\\xf2b\\xf7\\xb6\\xa1[Z{\\xf6\\x85(v^6\\xa9\\xe2nW\\x1d\\x98\\xe3\\xf9S\\xd5\\x8c6\\x18\\xf1\\xba\\x02\\xb1\\xe3\\x1c\\xa4Z\\x8f\\xfe\\xa0\\xcb\\xdf\\xb7\\xd5>\\xd3\\xaeC\\xa4\\xb5S\\xd0\\xeas\\xc1\\xab\\xcew\\x9eQ\\xae\\\\k\\x8c\\x90_c\\x7f0i\\xfc\\x90\\xfcY0/[\\xff\\xb8\\xa3\\xfb\\x96u\\xea5\\x14\\xa2\\xd8\\xfc \\xe4\\x8f\\xa3\\xab\\xba]X\\x10\\x07Q\\xec\\xbcl\\xacz0)\\x0f:\\x94GY\\xf5S\\\\.H\\x0f\\x86\\xfa\\xa2\\xbdz#\\xa9\\x7f\\xa0\\xde\\x88\\xf57\\x88b\\xdbG\\xc5\\xca\\xa3Y\\x10\\x1f\\xad7\\xaeyo\\x87\\xa7\\xe9\\xc3 \\x8am\\xb7\\xa4\\xcd\\xe3\\xcc\\x9aG\\xa6\\xc2\\xcd\\x99{\\xca<\\xce\\xce\\x80H;\\xcf\\xd1\\xda{\\x8d\\xad\\x8f\\xbf\\xd7\\xa2\\xcc\\x8d\\xd3\\x10Y\\xed\\x07\\xd7s\\xfcC\\x84\\xf253p\\xb9\\xf2\\xbeu\\xe7\\xba<\\xb8\\xb4\\x17\"\\x94G\\xed\\x95\\x0f\\xa0\\xbcC\\xbb\\xff\\x9c\\xbdy\\xbf\\x12?\\x8a\\xdc\\x12\\xd4\\xeb\\x0c\\xeef\\x87GM\\x92o\\t\\xdf\\x8d\\x0e\\x80\\x08\\xe9\\xcd\\xdex\\x17Ho\\xac\\xfa6m\\xfc\\x01\\xab\\xbeM\\xca\\xbf#\\xf6>\\xab\\xa4}R`\\xfcAf@|\\x95e\\xe6\\xa3\\x8b!\\xd2\\xee\\xb3J\\xb2\\x8f\\x8a\\xbd\\xee\\xb0\\xbc\\r\\x0bj7\\xa9\\xe4\\xd1o\\xaa\\xfc\\xdeX\\xf8\\xe4\\xba+DZy\\xb4,\\xa1\\x1e\\xc8\\xdfX\\xdb\\x8dV\\x8e\\xd7,\\xcc[\\xdc\\xb8\\xf6\\xf5;\\x10i\\xe3CH\\xedvy\\xe4\\xad[\\xde\\xd7\\xb6\\xb7\\xc4\\xe56}\\xe75\\xff\\xf4\\xea\\xc7u \\xc2v#\\xe9\\x8d\\xb4r\\xbcT\\xeb\\x01\\xa5\\xb2\\'\\xd2\\xc6A\\xda\\xab\\x07\\xc38\\xc8c\\xc1\\x93\\x96\\xfe>\\xea\\xab\\xe5\\x10\\xc5\\x8e\\x83l\\x98s\\xf8\\x89\\xe7\\xedJ\\xcb1\\xf2\\xaa\\x81\\x95\\xe7o8V\\x1c\\xea\\xc1\\xdb\\xec\\x94\\xe3\\xa1\\x1e,U\\xbe\\xcey\\x0b\\xb5={\\xdc\\xaa\\xbb\\x00\\xa2\\xd8y\\xdd\\xe5\\xdf]\\xdc\\xfd[\\xd8o\\xd51\\xfe\\xddN\\x91\\xf3\\xa7\\xe6\\x9e\\x16\\xea?\\xf6\\xda\\xdf\\xa0\\xfe\\x135\\xe8\\x9b\\xbc\\x80\\xd1\\x9a\\xaa\\x10\\xc5\\x96\\x13K\\xba\\xd5\\xce\\xda\\x15\\xbf\\xf2\\t\\xc6&\\xa3O\\xb4\\xec\\xeb\\xe9~\\x8cv\\xfd\\xf6MB\\xbb\\xc1\\xe7a\\xe5\\xa3\\xb4\\xf67V9\\x91\\xe4\\x9f\\x83r\\xe2\\xb0(\\xc3\\xed\\x80\\xb5\\xddJ\\xfd_\\xfb\\xe7X\\xf9\\x01\\xad|\\xedYr\\xe2\\xbc\\xaa\\x93\\x174\\x82(\\xb6\\xbe=\\xa2\\xd3\\x97\\x15\\xc7\\xc9\\xf6\\xfc\\x81q\\xf30\\xd75YA\\x95\\'@\\xbb\\x0b\\x89\\xdeH\\xf25\\xb4\\xbbH\\x15\\xe7\\xc0*\\xef\\x90\\xe8@l\\xbd\\x916\\xde\\x92Vod\\xf5\\xcb \\r\\xe8B\\xca\\xdd\\x11\\xf1\\x10i\\xe7m\\xda\\xb8\\x1aV\\xbb\\x0bi\\x9f\\x94wv\\x97\\xff}\\x9f\\xc8\\xaa\\x84z\\xa0\\xddE\\x11~\\xcc\\xbb\\xc1\\xa6\\xa6\\x1cD\\x18/f\\xaf\\x1e\\xfc\\x8fx\\n\\x89\\xec\\xca%\\x17]^iY;\\xbe\\'DV;\\x12\\xf4\\xff\\xdck\\x1a\\xe4\\xf8c\\xdc\\x07A\\x10\\xc5\\x96\\x0fH\\xf2\\x8e\\xd8\\xfeS\\xa9\\xe2\\x0fH\\xf4\\xc6\\xca\\xaf\\xff\\x11\\x9f(Q\\xffH\\x95\\x9fo\\x97\\xe7\\xcd\\x1a=oXNC\\x14\\x9b_\\xb3\\xe6Y(j\\xf6D\\xe7\\x83\\xf3:\\xf4\\x0e\\xb2\\x94\\x84HkO\\xbcCh7h\\xdf\\x91\\xca\\x9e\\xc8j\\xe7#\\xed[.\\xb6\\x9d\\x8f\\xa4\\x97@:\\xc0\\xfb:@\\x14[\\x8e\\x97j_\\x04\\xa9\\xe2\\xecHy#\\xc4\\xf6\\xcb\\xb0\\xe6\\x8d \\xd15\\xe4;\\xebO~\\xb2 \\xba\\xd7\\x9f.\\x10\\xc5^o\\x06\\xf3\\xa1`\\xa4\\xe5\\xd7$:\\x80\\xcfco>\\x14Z:x\\xdb|($\\xfb5\\xed\\xbc\\x80\\xe3\\x1e!\\xd2\\xd2\\x01Io\\x84\\xf5H%\\x87\\xecJ\\xa8S\\xccP\\xe6P5\\x88\\xb4\\xf6^\\x12\\x1d\\xcc\\x8b\\x1f7\\xe3J\\xa5\\xdc\\xbd\\xb8,U\\x9c\\xdd\\xe5\\x88\\xa8\\xde#V\\xf5\\x9b\\nQ\\xec\\xfd\\xb3X\\xe7\\x1f\\x92_\\xe6m\\xf5\\xb9\\x82\\xf8[A\\xfa\\x9cT|\\x87U?\\xa5\\xb5\\xef\\xd0\\xea\\xa7$~@\\xa2\\x03\\xa8\\x9f\\xb2\\xd2\\x01\\xa9\\xdd \\x1d$\\tZN\\xc6\\x0b;\\x8a\\x05::\\xa2[9Z_\\x0e\\xf9\\xff_\\x14\\x9f\\xff\\xc9\\xe1\\x95\\x8f\\xcf[\\xec\\xe5\\x1f\\x08/\\x87\\xe7wr \\xdc\\xd3v\\x05\\xe1f\\x0eo\\xb8\\xaf\\xc3+_\\x7f\\xe5\\xac\\xc3\\x1b\\xae\\xcd\\xbf\\xe7\\xebu9\\x80\\'\\xca?\\xed@\\xfc\\xf5\\xaf?\\xc6\\xcbJam\\x0e/\\xee\\x0e\\xbf\\xf3\\x8f\\x9f\\x00~\\xf7+\\xbf\\xe2\\xe5o~q\\x81\\x83\\xad\\xa6\\xd7\\xeelk*p\\xc2\\xe1\\x95S//y\\xf5/\\xff\\xf8\\xcd\\xf8\\xdf\\xeb\\xcf\\xf7\\xb2M\\xdeT\\xab#\\xa8\\xf0\\r\\xcf\\xf3\\xfaE\\xaf\\xf5\\x91\\x03\\xae\\x17\\xde\\xcb\\xe1\\xe5/\\xfe\\xc7-^\\x9csx\\xe5\\x1e\\xf8g\\xberk\\x87WJ\\xaf\\x91\\x89\\xad!^^\\xf0z#\\xbf\\xf1\\x87\\xc3\\xdf\\xfe\\xa6G\\xfb\\xc7)\\x87\\x17\\xf7\\x7fy\\x85\\x83C\\xb2\\x8aW+\\xf4\\xe1\\xc2\\xf6\\xe2\\x81H\\x92N\\x16\\xf4:\\xa5Z!\\x9ct\\xfcq\\x89\\xb1L\\x99\\xc4\\x06\\x89\\x8d\\x8cNN&\\'\\x95\\xca\\xe4\\xa4\\xe3\\x8dNB\\xe2\\xc7\\x89\\xcd\\x12\\x9b\\'\\xb6Llei\\xd5\\'\\xc0\\x0b\\x1d\\x03\\xd01\\xb1\\xb5\\xa9u\\xeb\\xd6\\x89\\xce&\\xe7\\x86\\xce\\xe6\\xb6\\xad\\xddbLm\\xdb\\xb8\\x99\\xda\\xb6s5\\xb6\\xed`l\\xebni\\xd7\\xba\\x9d[\\x8c\\xb9]\\xeb\\x0e\\x11\\xc6v\\xae\\x96v\\xae\\x91\\xda\\x16\\xc6v\\x1d\\x8c\\xed\\xdc\\x13]\\x8c.nf\\x17w\\xd76F\\xeb\\xff\\x88$\\xd7\\x08\\xe7v\\xae\\xda\\xb4\\xe7\\xe0\\xec\\xd2Fkts3\\xba\\xb57vhc\\xee\\xd0\\xae\\xb5[b\\xc7\\xc4.&Oo\\xef\\xe3\\x8d=\\x05-/\\xd3{\\xf8\\xf3\\xba\\xb0\\xd1\\x03y\\xb5\\xc0{\\xf8s\\x82~\\xf4 ^\\x17\\xdaC\\xa3\\x8bD%\\x9d\\xfe\\xe5U:\\x8d\\x02_\\xa5\\xe3\\x85\\xd7\\xafJ\\xe9\\xe6\\x19\\xe0\\xed\\xeb\\xe7\\xd9\\xc7\\xd8\\xad\\x9b\\xb1\\x9b\\xf7\\xf1\\xf6\\xdd8t\\x9d\\xa7L6\\xda\\x87W\\xcby\\x9d\\x87\\x1fo\\xd0\\x8f\\xf63D\\x86\\xa2\\xcf\\x03P\\xeb\\x8cF\\x95\\n\\x1a\\xb5\\x87\\xcbht_\\xf5\\xc0X\\xad\\xf5\\xae\\xc2\\xf1\\xe6/\\xbeg\\xbb\\xd6_e\\xd0\\x11\\xaem\\xf6\\xe2Z\\xdb\\xf9v\\xaf\\x9d\\x1f\\x1d\\xc0\\x87\\xa9\\xf8\\x18\\x8f!\\xbc`\\xfb9~\\x9a\\xc8\\xb7\\xfa9\\xd6\\xef\\xbd\\xe1\\xe7\\xb4\\xb5\\xe3\\xda\\x82\\xee\\xfb\\xeaox\\xfd\\xbe\\x1b_\\\\\\xfa\\xc6\\xa7\\xcc\\xe8\\xa6Q\\x8f\\xcc/t\\x8b\\xd4\\x9a\\xbd=\\x07v7z\\x0f\\xcc\\xf2\\xe6\\xc3\\x94j\\xa5\\x9e\\xf7@\\x1f^^\\xee\\xa9\\xd3\\xbf<\\xe3\\xab\\x96\\xbfv&\\xcd\\x9bW\\xe8\\xf8\\xfc\\xdb\\xe0\\x8f\\xfe\\x1a\\x01\\x7f\\x1c`\\xd0\\x1a\\xbb\\x07\\x19{\\x0cNG]\\xce+\\x15jk\\xb3\\x9a{\\x0e\\xf1\\xef\\x99\\xe8k\\xf4\\xf53\\xf6\\xeae\\xea\\xd5+\\x00\\xbd\\x07\\x18\\xfbz\\x1fw\\xeb\\xab\\xd1\\xc8\\xf3kxc\\x13\\xbf\\x89\\x88z(\\xd5\\xc7\\x1b\\xbc\\xf8\\x1a\\xe1\\n\\x93_\\x0f\\x7f\\xa3\\x9f\\x9f\\xc9\\xcf\\xcf\\xdf\\x8c\\xde\\x03\\xd0\\x87\\x01f\\xbf~\\x01\\xfe\\x19\\xa8\\x9e\\xe7\\x8d\\xc0\\xe9\\xe4\\xe9\\xaf\\xb4\\xff\\xf1\\xe6o\\xee8\\x8d X\\x9f\\xe0\\xb5\\xa6\\\\\\xfb\\xda\\xa5\\xf8\\x847\\x1f\\x99\\xfe\\xcaS\\xbc\\xb8!\\xe8\\xb17\\xdd\\xf0xK{\\x1e\\x7f\\xedk\\x17\\xbfR\\xbd\\xa9_\\x80O\\xb2\\x7f@?\\xef\\xc0n\\x03M\\xfe\\x01\\xfef\\xf4n\\xbc\\xf1%5\\xbc\\xa9\\xea\\xd5o&\\x16\\x7f\\x8d\\x8a\\xd3)\\xf5\\xb1\\x88\\xfe\\x15\\x19\\xaf\\xd6\\x91\\xf1\\xfae\\xb8\\x10\\xc0\\xab\\xd6\\xfb\\x1b\\xd42\\xfd\\x00\\xa5\\x9c\\xb7\\xfe\\xc8\\xd1\\xf9\\xa5\\xfcs^:Y\\x04\\xf1d\\x7f\\x83F\\xff\\xcaI_\\xb5\\x92\\xfc\\xcd\\xd7OZ\\xbf\\xb9\\xece\\xb1\\x9b&2\\xf2\\x95\\xa27\\'\\x84\\xbfRDO\\xa9L\\xe9\\x1f\\xe8\\xe97\\xd0w\\xe0\\x10c\\x80\\x97)\\xc0+\\xc0\\x1c\\xd0\\xaf\\xdf@\\xd3\\x80!}\\x8d\\x03\\xfb\\xady\\x13WC\\xbft\\r\\xa1\\x0f\\x8c\\x81=\\x8d\\x83\\xbcL\\x83\\xbc\\xbc\\xd1\\xdb\\x07\\xbd\\xfd\\xd0\\xdb\\x1f\\xbd\\x87f\\xbcz\\xd9\\xcb\\x82\\xaf:,\\xbf\\x90\\xffk\\xfaj\\xe4\\xa6\\xc1\\xde\\x03\\x8d\\x83\\xfdM\\x83\\x03\\xbc\\x8cAA\\x89\\xc3L#\\x06\\xf8\\x1bCB\\x129\\x13\\xd7Af\\xe1:(\\x95Jt\\xd4)\\xa3\\xcc\\\\\\xa8\\x8a\\xb7p\\xa1\\x1a\\x83\\xde\\xc4\\xc9T\\x16N\\xa6\\x89\\xd4\\x9a8\\xb9\\xdc\\xc2\\xc9\\xa3d\\xaa$t\\x8cD\\xb7\\xe3T\\xaadN\\xa5\\xe39y\\xac\\x99S\\t\\x9ad.\\x92\\x8bC\\x04b\\xe6\\xd0Y#\\xa76qjy\\x12z;kt\\xc9\\x9cZ\\xa3\\x0f\\xe7u\\xe8O\\xb1\\xe8sl4\\x17+\\x189m\\n\\xa7\\xe5uz\\x83\\x0eU\\xa6\\xd5\\xaab\\xadG\\x8d`\\xe2\\xb4\\xe8\\x8d&#\\x0e]\\xa27sz=\\xfa\\x9a!&\\x19\\xbd\\xb5\\x9c \\xa4\\x86r\\x82R\\x86\\xea\\x8e5\\x86\\xf2\\xc9\\xa1\\xbc\\x8c3\\x08|\\x12BMd~\\x11\\x81\\x90\\x16\\xca\\xab\\x11/\\x91)9U\\xf2\\xf3\\x8f\\xfal\\x1b\\n\\x9f}\\x1c\\xae\\xd7k\\x85\\x8e\\xce\\xce\\xcaH\\x85A\\xd7\\x1a}\\xc1\\x1c\\xca\\x0bzt\\x0b\\xbd\\x9e\\xd7\\xa1\\xeb\\xf5\\xd1<\\xafN\\n\\xd5\\xc8\\x95\\x88\\x8d \\x88E\\x07}\\xb8)\\xd4\\xa07\\x86\\xc6&\\xca\\x92d\\\\$\\xaf\\xe3L2N\\x9d,\\xe3\\xb4\\xd6\\x9f\\x9f\\xfa\\x1c\\xad\\xcf.C\\x1c\\xd1(\\x93Yd\\xd66K\\x92\\x85sj\\x05\\x9f\\xfc\\x1c\\xe4\\x16Y8\\xaa\\xc8\"S\\xf1\\x9c.-\\xff\\xa8\\x8c\\xe4\\xac\\xa75\\x91\\xa1J5\\xbaK>\\xa2\\xbb\\xa4X\\xbf\\xac1\\xa8\\xe5f\\x19\\xe2\\xa0I2\\x8dA\\'\\xf0\\x16\\x99&\\x8a\\xd7\\xa5\\xe4\\x1f\\xd1\\xb7\\xcc2\\x9dF\\x9bb=h\\xd17,\\xd6\\x0fB\\x92\\xcc \\xe85\\x91IrN\\xaf\\x8c\\xe2Mr^\\x9b.G5\\xea\\x0c2[Y\\x9f\\x84\\xde\\x9cR\\x95&W\\x86\\x85\\xf1:^-\\xe3\\x93\\xe5JA\\xcf\\xa9\\xf5F\\xb9\\xc6,\\xd7\\x84\\x8e\\xb4\\xc85\\xe8~irM\\xb4Z\\xe0\"\\xb5*>\\xe3\\xc5G\\xf4\\xf7\\x0c\\xb9\\x0e\\xf5\\xb2\\xfey\\x07\\xa4\\xf2\\xe8&\\xf9\\xb7N\\x7f\\xf1I\\x15\\x9b\\xc6\\x8f2(\\xa38$v\\xe8M\\xbc^f\\xe6\\xa3xu2\\x1f\\x93\\x7f\\xaf\\xa5|\\x8c\\x8c\\xd7\\xea\\x95\\x1a\\xb5\\xf5\\xfbi|\\x0c\\xea\\x7f\\xa5\\xf5W\\x98\\xd1G\\x95\\x85\\x8f\\xd1\\xeb\\xb8T\\xeb\\x91\\x8fDw2\\x87q2\\xbd)\\x8c\\xd3%\\xa3\\xb7\\x95|,a\\\\\\x14\"\\xa60Y\\x04\\x17\\xa7\\x8bM\\x0e\\xe39k\\xeb\\xa7\\xd8P0\\x87\\xf1\\xbc\\xcab=\\x08\\x960%\\xaf\\x92\\'\\xe5\\x1f\\xad\\x85\\x18^n\\x0cS[\\xc24\\xe8\\x87\\x9b\\xc24:\\xf4\\x8e\\xb2\\x84\\xa1g\\xe1\\xcda:D\\x01a\\x06\\x95*%\\xcc:v\\xd1oK\\xc5\\x1f\\x04\\x93\\x82\\xd7\\x9b\\xd1[0+\\xd0\\xb3Y\\xac\\x07\\xc1\\xa8\\xd0\\x98\\x15\\x1aT\\x9b\\x02\\xcd\\x08\\xa6pN0\\x87sQ|r8\\xcfE)\\xd1oF?\\x93OT\\x9a\\x11\\xf3\\xe0\\x8c\\xca0K~\\x0f\\xa7+#\\xb5:\\xd4o\\x91\\xa8M\\x8cJu\\x8aR-C\\xc3F\\xe0S\\xf1\\x07y\\x9aRm\\xfd\\xa2Z\\xaf\\x8aMW\\xaa\\x11\\x1d\\xa2n\\xb3\\x92\\x13\\xfa\\xac1*\\x05\\xa3Ro\\x1e\\x89\\xfa\\xd6\\x14\\xc1\\xc7\\x9a#\\x94\\x880\"\\xd4\\x9ah\\x0b\"!\\xf47\\xd4\\xd2I\\xcf\\x85<3\\x02\\xc1b=\\xf0I\\xf9G\\xc1\\xacRF\\xf0\\x16\\x952R\\xa9O\\xce?\\xf2\\xf2$\\x95R\\xafW\\xf1f\\x95F\\x13a\\xb1\\x1e\\x04\\x93J\\xa3O\\x89\\xe4P]\\xe8m\\x8e\\xe4\"\\xf8$t@\\xd5\\x9b\"9m2z[)\\x0c\\xfd]\\x17a\\x8e\\xe49\\xb5\\xc5z\\x10\\xd0G\\xb5\\xc1\\x18\\x19iF\\x83\\x9d\\xb7X\\x0f\\xe8Oh\\xfe5F\\xc6\\x9a\\xd4N\\xfa$5\"o\\xd4\\x1cj\\x9e\\x97\\x9b\\xd4\\xbc\"\\r\\xbdUJ\\x85\\x12q\\x16\\xb3\\xda\\xca=\\x10C@\\xef\\xe8\\x14\\xb5\\xf69;\\xb1\\xa8\\x05C\\xe8\\xc8\\xd4\\xfc\\xa3u\\x9c\\'\\xa9\\r\\x91V>\\xa2\\t3j\\xd4F\\xd4ch\\x10$!\\x8e\\xa45\\xe8\\x93\\xf3\\x87\\x00\\xea0+Z\\x9f \\r\\x7f\\xe0\\xe5f-\"\\x95\\x0c\\xebA)3\\xa8\\xac?\\xc1\\xa2\\xb5\\x8e\\xa64m\\xfe\\xa4c%;\\x8b\\x16\\x91\\x83*)\\xff(\\x98\\xb5\\x88\\xe6S\\x10\\xdbQZ\\xa9\\x17\\x95\\x04\\xc1Z\\x12\\xac?4Y\\xab\\xe3\\xad\\x03\\xd0\\x8cPk\\xd1\\xa2\\xd1\\xca\\'\\xe5\\x1f\\xd1%:M(\\xe2\\x92\\xe8^VRI\\x1ee\\xe0P\\xab\\xc6\\xa6 T\\xeb\\xad\\x0f\\xa3\\xb3\\x0ex\\x0b\\xea[Yx\\x12:Z\\x07\\x8b\\xf5^:\\xb9u\\xac\\xeax\\x95L\\x95b\\xa5q\\xeb\\xa4\\x9a\\x86\\xfaZ\\xa32X\\xe9-9\\xffc\\x14\\x9fb\\xed~\\x9dR\\xa6O\\xc7\\x1f\\xd0\\xd7\\xd0}\\x04\\x83J\\x9f\\xfa\\x1c\\xf2\\xef\\xa3T\\x84\\xeb\\x93\\x05>\\x9fV\\x93\\x04\\xd4\\xe1\\x1a]\\xaa\\x80F\\x94\\xc6 \\xa8bS\\x044\\xf2PU\\xb1\\x16!\\\\\\xa3A\\xd7Y\\x8f\\x88\\x81\\xd8Px\\xfe\\xc1\\xda\\xb3\\xe8\\x83\\xdez\\x11\"st\\x8c^* \\x19J\\x89\\xd8\\'g%\\xc7$\\x01]\\x82:MP\\xc6\\xf1\\x16!\\x12=\\x8aQ\\xd0\\x98\\x05\\xc4fS\\xad\\x07\\xbd\\xb59PQ\\x8d\\xaa\\xd1+\\xd1\\x8c`\\xed?\\xf4\\x8bRl(d\\xe3\\x0fo`\\xbc)\\x88\\xf1<\\'\\t\\xf4\\x83\"-\\xd6\\x83`\\xd6\\x87sz\\x13\\x1a\\xed\\xe8\\x03\\x8f\\xfef\\x1d\\x16\\xd6\\xa3\\x90\\xff\\x87XtP\\n\\xa8\\xacA\\x0cQ\\x9f\\xff\\xfc\\xf9G\\xf4\\\\\\xd6_\\x82X\\x14o\\xd4k\\xccz\\x8dFe\\xb1\\x1e\\x84d\\xbdFom~3\\xe2\\x82|\\x9a\\xc1*`\\xeb84\\n\\x8c\\x06m\\xaaA\\xfb\\x9c\\xc3\\xc9S\\r\\x02\\x17\\xaa\\xb4\\xf6\\xa0\\xc9:\\x99\\xa07\\xe2\\x07i\\xcfA\\xcd\\x0b\\x82\\xc5`m\\x84d\\x83`\\xc8\\xa7\\x9f(4\\xb85\\xe6(%\\x1f\\xbd\\xc6zx\\xc3\\x83%G\\xbb\\x8fRv\\xe0\\xd4\\xe6hN\\xa97\\xa1\\xd9\\xce\\x18\\xcd\\x9b\\xa3y\\x95\\xca\\x1c\\x8d\\x9e\\x0e\\x1dx\\xb5%:\\\\\\xa9\\xe2M\\xd1\\xe1\\xb1\\xe6ht?\\x0b:\\xa0\\x01\\x1c\\xad\\xb4^\\xa3\\xb4~\\xd2\\xe8\",1\\xf93o\\xac\\xc6`Fo]Jl\\xfeD\\xa0\\n3\\xc7iP\\x1d\\xd6\\x83\\x121E+\\nh\\xe2\\xd1\\x0b\\xb3\\xc6Y\\xc2T\\x9cB\\x98\\xf5\\xe5\\n\\xc4\\x97F\\x18\\xd4V.\\xa1\\x1e\\xf1\\xdc\\xc0\\xb25\\x1d\\xa1z\\x84B\\xa7A\\xcf=k\\xbbc\\xfc\\xff\\x00@C$='", "year": "2021"}, {"Unnamed: 0": 139569, "autor": "cnr0", "date": 1609629557000, "content": "Are there any Sony QX users? /!/ I have purchased not one, but two QX100's in 2013. Still rocking it - these devices has their own niche, connects to your smartphone via WLAN and you can take pictures and videos in DSLR quality but in a very small form factor. \n\nI am still using them as video recorders - with 1 inch sensor they provide incredible result for talking-heads videos and interviews,  but really hate the PlayMemories / ImagingEdge apps and it seems like nobody is interested into developing some new software / firmware into it. I really wish I can map the shutter button to video, firmware is  very buggy, but still, the development has been stopped already. \n\nAnybody here still uses their QX? Just wanted to gather and share experiences.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kp89g1/are_there_any_sony_qx_users/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "are there any sony qx users? /!/ i have purchased not one, but two qx100's in 2013. still rocking it - these devices has their own niche, connects to your smartphone via wlan and you can take pictures and videos in dslr quality but in a very small form factor. \n\ni am still using them as video recorders - with 1 inch sensor they provide incredible result for talking-heads videos and interviews,  but really hate the playmemories / imagingedge apps and it seems like nobody is interested into developing some new software / firmware into it. i really wish i can -----> map !!!  the shutter button to video, firmware is  very buggy, but still, the development has been stopped already. \n\nanybody here still uses their qx? just wanted to gather and share experiences.", "sortedWord": "None", "identifyer": 30469, "doc": "b'x\\x9c\\xc5\\\\\\t\\\\T\\xd5\\xfe\\x07q)\\xb7BM-\\xf3\\xb9\\xeb\\xff\\x19\\x88\\xb8\\x94Z\\xa6\\xc8&(0\\t*(\\x89\\x97\\x99\\xcbpe\\xe6\\xde\\xe1\\xde;\\xc0\\xa8\\x89[f\\x0b\\x86\\x1b\\x11F\\xc9\\xcc\\x1dfX\\xd4\\xb4d\\xa9\\\\0L\\xcbT\\x1e\\xe6\\xc2\\xd3\\'%\\xbc\\xcc\\xb5Bs!\\xccwF\\xe7 \\xfe\\xf4\\xfc\\xb9\\xf3\\x86\\x0f\\x8f\\xcf\\xe7\\x9c\\xef\\xf9\\xcd9s\\x7f\\xf7\\xfc\\xce\\xef\\xfc~\\xbf\\xb3\\x0co[\\x92h^`8\\xd64r\\x84\\xb7\\x99\\x12E^\\xc8\\xf6\\xf1\\r\\n\\x9e6=$4Lq\\xd8\\xb5\\xfc\\xb0\\xeb\\xfe\\xc3\\xae\\xdf\\xe4\\x8a\\\\\\x02\\xcd\\n\\xfb\\'\\xee\\xdd}7\\xc3#A\\x97\\xee\\x8f\\xf1F\\xb5\\xf9o\\x85#{\\xa6\\xcfv\\xb9\\xff\\xf7\\xe1\\x9f\\xe1\\x1es\\xc5\\x95\\xa9\\xd3+\\xde\\xf8U*\\xafMl\\xe3\\xf2\\xf8?W@+~\\xeb^\\xfe\\xc4{\\x8b\\xf77~\\xe0\\xd1\\xef|P\\xf6k}!\\xc6\\xd8\\xabK\\xf7\\xae\\xfd\\xfb\\xdd4\\xcf\\xe39\\xf6\\x07A>w\\xc1\\x1f\\xfe\\xfc `\\\\\\x9b\\xb7\\xee\\xa7\\x9d\\xd1)E\\x10\\xe7\\xe0\\xfe\\x9c3\\xf5y#\\xfb\\xa7c\\x9f\\x10\\xf8\\xb8\\x01~$>\\x19}\\xcfF\\xee\\xf9\\xe5D:\\xc4\\xf9\\xf6z\\xf7\\t\\'\\xf7\\xd6\\xac\\xf0>\\x9d\\xef\\xfa\\xf0sS\\x01_\\xc8\\xc7k\\xef\\xd9\\xfa\\x81c\\x8a?\\xc2\\xf4-\\xc5K/\\xbf\\xbe\\xa7\\xf7R\\x88\\x90O\\xf8\\xb4a\\x03o\\xec.\\xa0`\\x7f\\xf0k7\\xc7\\'\\xb2c}U\\xf7\\xf3\\x13\\x1aq\\xad\\xcf\\xeai\\x89\\x1d:\\x9f\\x8a\\xb6\\xd7/\\x9a\\xde\\xb7w\\xbb\\xd7\\xaa;n \\xc8\\xedO\\xc2\\xf8tJ\\xc9x\\xb1\\xfd\\x17O<\\x8b\\xe9\\x80\\xd8\\xd9+4Bu\"D\\xca^o\\xdcW8\\xfdrU\\xea\\xb6]\\x04>\\xf5\\x04>\\x1e3\\x16\\xc6\\xc5\\xcc[\\xfd:\\xa6o>\\xff\\x83n\\xfe\\xd3\\x95\\xcfB\\x84|\\x1c\\xd5k\\xc8\\xa7_\\xbfj\\xdd\\xe0u\\xbb\\x030\\xee\\xf1\\xf7K\\xbc[\\xd2\\xcb\\x07\\xeb\\xf5\\x99!\\x93\\xbc\\xfa\\xdfX\\xb5k\\x0b\\xa1?\\x98\\x86|\\xae\\x86\\x96^\\xbc\\xfc\\xd1\\xcd$Lw;\\xf2\\xc5\\xb9I7\\x7f>\\x04\\x11\\xce\\xd3\\x8d\\x04>$=\\x80\\xf34fW\\xd0\\xf1>g\\x92\\x120j\\x9eJ\\x1dw\\xc4\\x14\\x1d\\xa4\\xb2\\xd7\\x8f\\x8aZG];\\xd1ilsr\\x83|\\xdau\\xda\\xd3c\\x92\\xf7\\xedw0\\xbd3;sJ\\xc7\\x83/\\xb6\\x878\\xcf^\\x7f\\xee\\xcb\\xda\\x91\\x01\\xeeAm\\xf2\\x1c\\xec\\xcf\\x93u\\xd6C\\x89w\\x9e\\xf2\\xc7td\\xb0\\xf2\\x10g\\x18_\\x07\\x11\\x0f`t\\xff\\xee%\\x97\\x16_\\x137\\x13\\xf8\\xfcE\\xd0\\xb7\\xa2\\'\\xfbmz\\xb3xtOL\\x97\\xf6|\\xee\\xdd\\xb4+\\r\\x83 R\\xa0\\x9e\\xa4\\xd7w\\x08|~u\\xdb\\xb0\\xad\\xa2\\xeb\\xa2c\\x98\\xd6\\x17xMfgu\\xfb\\x0eb\\x94\\xbd~\\xb8\\xe7\\xbcX\\x9fAU\\xd7> \\xf0i \\xf0\\xf1\\xb2N\\n\\x9a\\x17R5\\x14\\xd3\\xf3\\xdd\\xf6\\xfeU}d\\xb5\\x11\"\\x94[\\xa4\\xf5\\xd8\\x8e\\x1aa\\xd8\\x0el\\xdf\\xd2\\xec|I\\xe3\\x03\\xe5v;p\\x93~\\x83\\x7f\\x96\\x19\\xe2|{=\\xb6oY\\x04;J\\xb2\\x07\\xd0\\xbe\\xf5\\xbc\\xf3\\xa9)\\xce\\xab\\xa1\\x06#\\xf4s\\xdd\\xeet\\xcb;3;\\xa8\\xac\\xeb3\\xa3=u7\\xdf\\xd3\\xb9\\x02>w\\t|\\xa2O^W\\xcc\\xbd\\\\\\x17\\x89i\\xe5\\x8e\\xd3\\xeb=w\\x17\\xfe\\x1d\\xe2L{}\\xbf\\xb8yWF\\xc5^u\\xff\\xd2I?\\xe7\\xd1\\xb6\\xe1\\xc2*\\x03\\x95\\x01\\x11\\x8eO1\\x90\\xdb[\\xcd\\xf4\\x07\\x8e\\x0f\\xb6\\x93\\x10\\xe5\\xdak\\x92\\xbeA;J\\x9d8\\xe3^\\xbaQ=\\x03\\xe2,{=\\xb6\\x07\\xe9\\xcd\\xd8\\x03hG\\xa1\\xdc2\\xdf\\xe8\\xa5\\xbe|$o\\x16\\xc6\\xf1\\xfe\\xef\\xdf^\\x9bS\\xdf\\x80\\xed[\\xfa\\xe5\\xd4\\x90q~\\xc1\\xcf\\xbcO\\xe0\\xd3\\xce\\xe5a\\xf9\\xe1\\xcf\\xef\\x0e\\x9d[1y\\xe1\\xc9\\nL\\x0f\\xeb}\\xa5\\xf3\\x91\\xee\\xcf\\xae\\x81\\x08\\xfd\\x02\\xc9\\xee\\x90\\xc6\\'g\\x90\\xb6,2\\xf8G\\xec\\x96]vn\\xcf\\xda\\xd8\\xd3\\xa5C*D<>\\x19\\x9d<\\xb6*\\xd6w\\xdaL\\x1a\\x1f\\xb9\\xf1N\\xb7\\xd2\\xde\\x93\\xd2\\xfe\\x94\\xa2 \\xca\\x8d\\xabH\\xf6\\xe0\\x89\\xd8!\\x87\\xb8\\xf9\\x17\\xb0X]j>H\\xf3-<P\\xb7\\x04\\xe3uU\\x80\\xe9\\xea\\x8587\\x18\\x87\\x90\\xfc)\\x89\\x0f\\x8cC~\\xd6\\xef\\xeeRo\\x9c\\xe1\\x8e\\x11\\xfbS\\xac\\x07\\xd8\\x1e8\\xea\\xe7\\xa0=X\\xb8h\\xdd+\\x03\\xbe??\\x01\"\\xd6\\x83\\xa9\\x8a#\\x83\\x0eR\\xb1\\xe3J\\x9a\\x89\\x0f \\x1ff\\xde\\xee\\x0eV\\xf5\\xd5XL\\x9f^Y~r\\xf3\\xa5\\x92\\xc1\\x10#\\xec\\xf5U[\\xdb\\x96\\xaf>`X\\xb7\\xceA\\xb9\\xa9\\xef\\xf6\\xe9\\x9bS9P\\xc0\\xb4\\xfbNU\\xf0\\xa5\\xcb\\xff\\xfc\\x01\"\\x1e\\x9f\\x1d\\x83\\x0f\\x06\\x16\\xbc\\x9a\\xf8\\x03I\\xafI~\\x0e\\xdakg\\xfd)\\xc9\\xee@\\x7f\\xfaz\\x89_\\x9b\\x99\\xef\\xce\\xed\\x80\\x91Y\\x14>\\xa8KQ\\xda\"\\xa8\\x07Y\\x04>\\xa4\\xb8W\\x13\\xdd\\xe6b\\xafI\\xe7wb:\\xfdv\\x7f\\xd7\\x1d\\xe3?\\x1e\\x03\\xb1\\xa5\\xfd\\xc2\\xc1\\x8c>n\\xfa\\x8e\\xc7\\x9e\\x81(W\\xdfHz\\xf0A\\xfa\\xd25\\xbf\\xb8_9\\x84\\xe9\\x9bn7;&\\xba\\xb5\\x7f\\x07\"\\xd4\\x83b\\x02\\x1fR\\\\\\x05\\xf5\\xc0#y\\xcb\\x92>\\xe3{\\xdc\\x82(Wn$=\\x80r[4\\xa7\\xacw\\xdf\\x7f$\\x0c\\x81(\\xb7?\\xa4\\xf1\\x81\\xfd9\\x1exf\\xd8{\\x9e\\xdb\\xfbA\\x94\\x1b\\xbf\\xfdA\\xe2\\x03\\xe2\\xb7\\xd7\\xa7\\xfcVT\\x96t\\x84\\x81\\xe8\\xe8\\xba\\x04\\xf2Y\"e\\xaf\\xf8\\xf0\\xd6d%\\xa67\\x9e\\x18>l\\xf6\\x92\\x1e\\xd1\\x10\\x1b\\xe3\\xaa\\x8c\\xe7\\x8b>\\xdd\\x12\\xf6\\x93\\xa3\\xeb\\x92}\\x87\\xe7V\\x0ci\\x935\\x0c\\xd3\\x9a\\x11>\\xcb\\xaf4\\x8c\\x9b\\x07\\x11\\xcf\\xd3y\\xc5\\x86\\xca~UO\\xef\\'\\xcd\\xd3:\\x82\\xdc*\\x02fh~\\xafO\\x1e\\xd7\\xc8\\xe7\\xe0\\xacs/\\x0e\\xe9q\\x16\\xe3\\xe1\\x9a+a\\x97\\x9f:\\xb5\\x14\\xfa\\x1fG\\xfd6\\xf4?\\xce\\xea\\x01Q\\xdf\\x80\\x1e(\\x96\\x8e\\xac0\\x06\\xdf\\xf9\\n\\xa3\\xb7\\xba\\xcb\\x86\\x9e\\xbd\\xeb\\xc7\\xc1\\xfe\\x90\\xe4F\\x9a\\xa7\\xb0?\\xce\\xc6\\xbdr\\xe7ix\\xb0Wfe\\xd8\\xae\\x10\\x88\\xf3\\xed\\xf5-\\xb5\\x1f2\\xa1.,L\\x1a\\x9a\\x99\\x0c\\xb1\\xa5\\xed\\x9b\\xb3\\xeb\\xb9\\xdb2\\xf5@\\xee\\xf8\\x90\\xf4\\xe0\\x96\\xcc\\xf1\\x19>M}\\xe3\\xb3\\x7f\\xbf`\\x86(7Nlk\\xc7G\\xec\\xc1\\xec\\x8cY\\xcf\\xadQ\\x1a0\\x9d\\xdd\\xeb\\xd2\\xe9o=\\x97\\xaf\\x84\\xe8\\xe8z\\xa1\\xb9\\xfe\\xec\\xd7\\xcc\\x96\\xde}\\xc1\\xfd\\x12D\\xb9q\\x15\\xc9\\x8e\\xc2\\xb8*\\xcd\\xb3\\x9dq\\xef\\xe6\\xfdg!B}sz\\x9f\\xef\\xcdE\\t\\xc9+\\xde\\xa9\\x86(W\\xafI\\xf1\\x0e\\xe4\\xe3\\xec\\xba\\x91d\\xaf\\xe1\\xbaq\\xcd\\x87\\xa5\\xaa\\x0f\\xe36u\\x86\\xa8\\xb6\\xd7\\xf3\\x9d\\xde<\\x16\\x16X\\x10\\xf3q3\\xfa\\xd6\\xdc\\xba\\xd1\\xd9}>\\xd2:\\x0b\\xee\\xf3\\xcd\\xefzmH\\x911\\xac\\x0bF\\xd2~<\\xc9\\x9f\\x92\\xf4\\xad\\xffw\\xf1^mrz\\xf5\\xc0tK\\xad\\xb7\\x9b\\x9b?[\\xe8\\xba\\xb2\\xdb\\xcb\\x7f\\xae\\xc1\\xe83\\x7fH\\xb15Y\\x15\\x03\\xd7\\xdb\\x8e\\xae\\xb3\\xe0z;\\xcdd:\\xd7A\\xb9\\x9d\\xc5\\x98Q\\x100\\xe7\\xeb\\xe7G]tv\\xbd\\xfd\\xdc\\xe7\\xff\\x08*+\\x9dp\\x14\\xd3\\xe7\\xca\\x8c1\\x03\\xd7\\xbf\\xa4\\x86(\\xd7\\xcf\\x91\\xfc\\x02\\x94\\x1b\\xf6\\xd3\\x10[\\xda\\x1e\\\\\\xaf}\\xab\\xe7\\xef\\xcb\\xb3:c\\\\\\x93\\xd4\\xcbR[\\xdfo\\x01\\x8c\\x0f\\x1c\\xf5s0>pv\\x9f\\x824>Pn,\\xbfTz\\xa5\\xf2\\x93-\\x10[z|\\x94}\\x8fN\\xf3\\x18uh:\\xc4\\xe6\\xf6G\\xdfup\\x7f\\xd4\\xa8\\x8d\\xfc\\xec\\xff\\x82^=\\n\\x91\\xa4\\x07\\xae2\\xf9@=X\\xf6\\xed\\xb2C\\x0b\\xa7R\\x83!\\xca\\xf5\\x0br\\xd7\\xf5x^B\\x94kGI\\xfd9\\x10}e\\xe2o\\x86\\xcco0\\xfd\\xd5\\xc2B\\xa6K\\xfa\\xd11\\x10\\xb1\\xdd\\xc1v4\\xd3\\xc1u\\xd6\\xd4\\xecU\\x8a\\xa3W;5\\xaeK\\x961\\xf5\\xcb\\x12\\xca\\xc67@l\\xe9}\\x97\\x82\\x85\\xe1\\xd6\\xe4W>\\xaf\\x85(w\\xdfEn<\\x9aj\\xd6\\xd6\\xfe\\xab}\\xfaY\\x88-\\xbdOa\\x0e\\xe9\\xf6\\xed\\x88\\xb5fo\\x8cSj\\x8a\\x8b\\x07}\\x9fX\\x06\\xfd\\x02\\xc9\\xbe\\x91\\xfc\\x1c\\xf4\\x0b\\xcd\\xd9\\x9d;i\\'\\xbe;\\xdc\\xc7\\x85\\'\\xd9\\x1d\\xd2\\xf8Tn\\x19\\xb1g\\xc3\\xdb\\x87\\x1b\\xf7w\\xa6\\xd7\\x96\\x19\\xdb\\x0f}\\xe1O\\x8c\\xd6n\\x01C\\x02\\x0f\\x9e\\x12\\xa1\\x1du\\xd4^C;*w=G\\x9a\\xa7\\xa4u\\xd6\\xffj}\\xfa}\\xe7\\x8f.\\x16\\xbf\\xb5.\\x12c\\xff\\xac\\xb3\\xed\\xac\\xb7|\\xbfn\\xe9\\xf5ik\\x9d\\xcf\\xb9\\xdf\\n\\xd8wm\\x02\\x93\\x04Qn<zQ\\xe6\\xfcqv\\xddxA\\xe6\\xf8\\xf0\\x9b\\x97/>\\xd3)\\xfa\\x10\\xc4\\x96\\x8e\\x13\\x7f\\\\\\x92\\x165`oe\\nDh\\xafIzp\\x9e\\xd0\\x1fh\\xaf\\xd7e\\tcs\\xe3\\xba\\xaa!:\\xbb>\\xbd\\xfa\\xc1\\xd3\\xd1?\\x96\\x14\\xdd\\xc6t\\xac\\xdb\\x91\\xb6\\xeb\\x16\\x0c\\x121\\xae?\\xfaU\\xe2g3\\xbf\\\\\\r\\xf5:\\x9f\\xc0\\x87d\\xdf\\xa0^3\\xdd\\xd5\\x07\\xaey\\xbe<\\x10\"\\xde\\xa0\\xc3\\xe8\\xa8}\\x83\\xe3\\xa3H\\xd3%\\xbd|\\xed\\xf06\\x88-\\x1d\\x8f\\xd6\\xa6Ic\\xbfz\\xb5R\\xc4\\x98\\xd4\\'1X\\xe7\\x95R/w\\xffM\\xee=\\x14g\\xed\\xdbO2\\xe7\\x8f\\xdcs@G\\xe3\\x9d\\xd2\\xe53SF\\x0f\\xfdz5\\xa6\\xc7\\x8e_\\xbdsp\\xc2\\x1f\\x030jNg\\xae\\xc9\\x9e\\xfcW\\xa5\\xdcs\\x8cjB\\x7f\\xe09\\xc6*\\xff\\xe3Y}\\x02R\\x1b \\xe2\\x83(\\x1c\\x1fX\\x1c\\xd4k\\xa8o~\\xea\\xcf{\\x8e\\xd4\\xdfz\\t\"\\x96\\x1b\\xd67G\\xe56tA\\xf5\\xe4\\x1e\\xde\\xfd\\xf31=\\xa5\\xe4r/UR\\xa4\\x17F\\xd2\\xbd\\x00R\\x9cH\\xf2\\x0b\\xf0\\x1c\\xd0P\\xb9\\x89\\xdf\\xf8\\xda\\x8fm \\xc28q\\x8d\\x83\\xfe\\x14\\xc6\\x897\\x12|f\\x8e\\xfd.\\xd5\\x13bK\\xc7o\\xbfM\\xa9\\xb8{\"\\xa8t\\x04\\xc6`7\\x8f\\xdc\\x04mv-\\x8c\\xdf\\x8a\\x1c\\xe4\\x03\\xe37u\\xfc)\\xbf\\xfe{\\x86R\\x10\\x9d\\xb5\\xd7\\xb0?u\\x17B\\xea\\xdaw\\xbd\\xe5\\x03\\xb1\\xa5\\xe3\\xf8\\xcaT\\xe5\\x1f\\x9eY7\\x13!B;\\xea\\xa8_\\x80v\\xb4\\xb5\\xfc\\xc2\\xcf5\\x1b\\x0f\\x0f\\x9d\\xfa6\\x07Q\\xee\\xbaD\\xee~\\xa2\\xb3zM\\xba\\'\\x04\\xfb#\\xd7^;z\\x0e\\x08\\xefm\\xb4\\xd6\\xfehk\\xddOl\\xad8\\x91\\xb98\\xfc\\x95\\t\\xcb\\xd9\\x7fC\\x94\\xbb\\xae\\xefD\\xe0\\x03\\xe3\\xc4\\x96\\x92\\x1b\\xe4\\x03\\xe5\\xd6Z\\xe7\\xa7\\x03\\x9e\\xfc\\xe2\\xf2\\xcc\\x8c\\xe8\\xd1\\x10\\xe1\\xf9\\xa9\\xa3~\\x0e\\x9e\\x9f:\\x1b_\\x13\\xe5\\x06\\xe2k&\\xbc\\xe8\\xea\\xf2\\xe3\\xccm\\x88-\\x1d\\x8fn\\xca\\xbcx j\\xc9\\xe0O!\\xb6\\xf4}\\x97\\xd6\\xba\\x1f\"w_\\xd9\\xd9{\\x0e\\xce\\xae\\xb7Iz\\x00\\xd7\\xdbr\\xfd\\x8f\\xa3q\"\\xec\\x8f\\xdc8\\xd1\\xd9\\xfbb\\xce\\xee\\x1f\\xc8\\xd5\\x83\\xd6:?\\x1d;\\xbc|\\xf4\\xd3\\xcb\\xaf\\xee\\x83(7\\xee%\\xcd\\x1f\\x18W\\xb5\\xd6}1g\\xf7]\\x88\\xf1\\x0eX7:{>\\xd7\\xde\\x8e\\xcd\\x8d\\x8f\\xb3r#\\xdd\\x87\\x85rs\\xd6/\\x90\\xf4\\r\\xfa\\x85\\x03\\xcf%?\\x95\\'\\xb8\\x17@\\x84\\xf6`\\xab\\x83\\xe7\\xb4\\xd0\\x1e\\x90\\xee\\x8fB{\\xe0\\xe89-\\xb4\\x07^\\xc3\\xca\\xca/\\xf8\\x17m\\xc1\\x08\\xed\\x0e\\xfe=F\\x86\\x83r\\xcb\\xf1\\x19\\x97\\xecNu\\xd9\\x8c\\xe9\\x953C~\\xdd\\xca\\xd4\\xb7\\xc1Xs5x\\xb3!q\\x98\\x08\\x7f\\xf7A\\xda?\\xb8N\\xd0k\\xf8\\xbb\\x8fS\\xd1\\xab\\xb7\\xfc3q\\xe56\\x88r\\xf5Z\\xae}s6\\xbe&\\xed+\\xff\\xaf\\xee\\x1ft\\xfe\\xe6\\xfb\\x8a%)\\x03\\xf6A\\x94\\xbb\\x1fB\\xd2k\\xb8\\x1f\\x92\\xc0\\xef\\x9c\\x93\\x99\\xb6\\xb3\\x1dDg\\xc7g\\xeb/\\xd9C3vX\\xafc\\xba\\xb5\\xee\\x1f$\\tu\\x11\\xe3\\xaaWTb\\x84\\xf7\\x0f\\xfe[\\xbf\\r\\xf7\\xc5\\x9c\\xbd\\xe7M\\xea\\x0f\\xbc\\xe7M\\xfa=\\xa0\\xdc\\xfdQ\\xb9\\xe7%\\xa4\\xdf\\xe9\\xcd\\xb7\\xd7\\xe3{v\\xce\\xc6\\xbd/\\x9c\\x9cy\\xf2\\x13\\xcb\\x18%\\xc4\\x96\\xd6\\x03_\\x95\\xe7\\xefSK\\xbe\\xf0\\xc2\\xb8k\\xc9v\\xc9\\xaa\\xd11X\\x0f~\\x19\\xb7h\\xe7\\x9b\\xb1\\xdc\\x95}\\x0e\\xfa\\xed)\\xdb2\\xb2;\\x8e\\x99\\xf3\\x17\\xa6Iq<\\xfe]\\x9bG\\x85*\\xf0\\x9d:K\\x88\\xa3\\xeb\\xb9G~\\x8f\\xb1\\xfe\\xdb\\t\\xf1y1\\x81\\x10\\xe1z\\x8e\\xd4\\x1f\\x92\\x1e\\xc0\\xf5\\\\k\\x9d\\x03v(\\xf7o\\xf8\\xbc\\xdc\\x97\\x87\\x08\\xfb\\xe3\\xe8z\\x0e\\xf6\\xe7\\xfd\\xed\\x1b^*[\\xa5q\\xc3\\xf8\\xf6\\xf1\\x8f\\xc7w\\xc8?h\\x91{\\xdeH\\xd2k8\\x7f\\x9c\\xf5?\\xa4\\xfb\\x07\\xd0\\xff\\xe4\\n:JI\\x0b\\xe5\\x99\\xae\\xb6?\\x17\\xd7Fpi\\xa4\\x9aT<\\xf2\\xe7\\xf2\\xb8\\x1a\\x17\\x17R\\xcd#\\xcfjl\\xd9\\xc8\\xd9\\xe5\\xa16..\\x16\\r\\xcd\\xaa\\xc5x\\xa1\\xbcm&z]\\x8b \\xf2\\x0c\\xab\\x16\\xce\\xb8\\x9c\\xdal\\xec\\xd81\\xa7\\xbfq\\x98\\x90\\xe3\\x91\\xe3\\x993\"\\xc7\\xcb\\xe45\\xc0+\\xc7[\\x1a5\\xd2{t\\xce\\x84\\x9cIU\\x83}\\x04\\x1d\\xad\\x14\\'*h>nq\\x04\\xcd\\n\\xf4D\\x05%\\x88\\x8bg\\xd1|l\\x00\\xc7k\\x11\\xc5\\x8b\\x0fZ\\xf1\\x9c\\x1a\\xb7\\xe2i\\xe1\\xe1VV_\\x9f\\x19~A\\xa1>\\xd3\\x8d\\xbe\\xbeF_\\xbf\\xaa\\x17})\\xd4\\xceG\\xa9\\\\\\x1cH\\xb3*\\x9a\\x9f\\x18J\\xeb\\xc5\\xc5\\xa1zm,*\\x87\\xa3\\x17\\\\\\x8c\\x98\\n\\x1c;q\\xf4b\\xf4\\\\6\\xc2\\xa0\\xb3=U\\xa8\\x1a\\xde\\xf8={[\\x85F\\xcf\\x13\\xda\\xde\\xe7\\x11\\xcai\\xff+\\x1e\\xb6\\xef5\\xcf\\xe3\\x91\\xb6M\\x9f\\xeb\\xfdP\\xdb\\xdd\\x8dM\\xed\\xd5\\xa3\\x1e\\xaa.\\xf4\\xe5\\xd8\\x05\\xf7\\x08_\\xadN\\xf2\\xf3\\x89\\xf07\\xfaE\\x94\\xfa\\xd1q\\x0c\\xcb\\x88\\xf4DTx\\xd0\\xdc\\x87\\x17\\x1f\\xd4\\x04\\xb1\\xaa\\x87j\\xf2\\xfdh5O\\xa3gr\\x82\\xd1?R\\x9a\\x1a\\xa5\\x98\\x9a\\x13d\\x0c\\n5\\x06\\x07\\x1bC\\xfc\\xaa\\xc6\\x86p\\x9c\\xea\\xde\\x97\\x1e\\xfb\\xc6\\x8f\\x1b\\xc0\\x00\\x86\\xfd\\xff\\xbf6\\x9a\\xf8\\xb5\\xfe\\x8d_#\\xb40\\x86\\x86\\x9aBC\\x15(\\x85\\x17\\xa2\\'\\xdf\\x17\\x00\\xc5\\xab\\n\\x9a\\xc8\\xbej\\xf8\\xe3\\x07\\x82\\x13\\x84\\x89Q\\xe8yM\\xc5X\\xf2PS\\\\\\xe1Gk\\x0b\\x9a\\xbcw\\x95\\x87#\\x9d(y\\xa81~$\\xea\\x93)lF\\xa0I1C!\\xa14x\\xf7\\x83Q}\\xdc{\\x15*8\\r\\xc53\\xa2\\x01i\\xa1\\xba\\xb0\\xe9\\x8bmU\\xe8Y\\xa5x\\xbf\\xe3\\x9c\\xb6)\\xe9G\\t\\xf1MH\\xc4\\x80\\xb1\\xbe6\\xd3\\'4\"(\"\\xca8c\\x8a4#,,\\xc2\\x14\\x1e\\x15b\\x8c\\x08+~\\xdc\\xf4\\xb4\\xbd;i\\xda\\x16\\x93\\xc6c\\xd6\\x14\\xd3\\xac)~(\\x05\\xa2\\x14\\x8a\\x92\\x02\\xa59\\x85M\\xdb< \\x82\\xd88SL\\xb8\"\\x872SJN\\xab3S\\xaa$\\xa5&\\x17\\xe5ZNe\\xa14<M\\xa9\\x0cFJ+Q\\x886Q\\xac-\\x19,(\\xc5r*\\x83\\x89\\xd2\\xe9$\\x94\\x04\\x13\\xc5\\xd3FJ\\x90l\\xff,\\xc3D\\xe9S,(\\xe9(A0\\xc6\\xd2R,M\\xb3\\xe6X\\xbdZm0\\xc5\\xea\\xc5\\\\\\x94D\\x8e5))VR\\xa2\\xd9dT*\\xcdJ\\x1bc\\xab-\\xe3\\xf4\\xacJR\\xa2YdA\\x19\\x8bL\\x92\\xd5\\x8e\\x82IE\\xebP\\x12-*:\\x89\\xd6p\\xba|;\\xa2\\x01-\\xb0\\x17\\xb54+\\xe6\\xa22\\xa3\\xa4-\\xf7A\\x90T\\\\\\xec\\x02I%h\\xf8|:E\\x87\\x84O\\xb3J\\xba\\xe0AQ\\x90PY\\x93\\x1bG)E\\x8e\\xb7\\xc61\\xbc6\\x19\\xf5\\xc4\\x14\\xc7\\xf1\\x12J\\xda\\\\5%\\xc6\\xd3\\xbc)\\x1eu-\\x9e\\x12i\\x94%\\xa1\\x0c\\x89\\xc4l\\xcb\\xd0\\x874O\\xe70\\x05\\x8c\\x96R\\xa3\\x17\\xa1Uj\\xda\\xc8\\xb0\\x12\\xc3*\\xe3\\xf3Q\\xc6\\xd3*&VC\\xa3\\xa2\\x88\\xda\\t\"\\xad\\xca\\xbbWLb\\xe8\\xe4\\xfc\\xc6\\x92\\x80\\xda\\x8b\\x9c\\x91\\x11\\x8c\\x8c(-\\xd0\\x0b\\xa2\\xa4a\\x12h\\x93\\x96\\xd2IZ\\x8aO0\\xb1\\xb4\\x1a\\xa5d3\\xcb(\\xe3i\\x89E\\xc3\\x90\\xcbr\\xf7\\xa4\\xcfr\\xa2\\x99\\x15\\xf4\\xb1\\x0b\\xf2\\xee\\xe56\\x81\\xe7\\xb2z\\xadm\\xa08\\x966q\\xc9\\xacYg\\x93\\xaaE\\xc7(E=O[\\xed(\\x14\\xe84\\x94AKk9$\\x85\\xc2&eA\\xd2\\xd9\\xe4\\xa5C\\xda/\\xe9x\\x1a}\\x91\\xe7\\x92\\x18\\x15m\\xd6\\xd94\\xd8\\xaa\\xd3\\xf3J$\\n:\\x0f\\x17T\\x96D=\\xa5A3\\xc2\\x98\\x98bNL\\xf1\\x1e92\\x17\\xe9\\x8bFc\\xb0\\xf2\\xb4\\x92\\xe3\\x91\\xc1\\xce\\xc3\\x05\\x01\\xd5\\x08z\\x8d(\\xf1\\x9c2\\xc1b\\xcb\\x90\\xc0$\\x81\\xa6\\xb5f[&\\xe4\\nH\\x999\\xde,\\xc4\\xa3\\x01\\xb0\\x08\\xf1HKhDi\\xd1\\xd3\\xf2Q\\xce\\x8b\\xbax\\xd4\\'\\xab\\xc0\\xc5\\x89\\xb6!\\x92\\x04Nk\\xcbX\\x83Y\\x10\\x19\\x8dF\\x12DNg\\xb1e:Z%\\x89T\\x02\\x8d2M\\x82\\xc5\\x96!F&4\\x8cf\\x94\\x18^B\\xb9\\xd6V\\xe4\\xef} \\xd0\\xb6\\x0f\\x0cF\\x913\\x89\\xc9\\x9cI\\x8fh\\x94x\\xb3-\\x13lE\\x01\\x15mo\\x9aD\\xf3\\x06S\\x12C\\x99m\\xf2\\xe0r\\xef\\xe5\\x82\\x94L!\\x95\\xb3e\\x88i2#\\xc4\\xa3LD\\x99\\x86b\\xcd)6\\xc9\\x9b\\x0c\\x9c^B\\x89G\\xba.\\nk\\x97\\x9a\\xe34\\x94ZX\\xbbl\\x07\\x92^\\x8c\\x9eM`\\xd1\\x18\\xc5\\xdc\\x8f>\\xf6\\x15 dc\\xd4<\\xa7\\xd7\\tk\\xcb]\\xd3\\xff\\x03\\x9c(Y9'", "year": "2021"}, {"Unnamed: 0": 143350, "autor": "nurse_miles", "date": 1623398134000, "content": "Awaiting New Macro GM Lens /!/ Anyone else waiting for Sony to drop a new macro lens? Iv been saving my money for when/if they drop the lens this year. Sony Alpha Rumors posted a road map that listed the Macro GM Lens right below the 50mm f/1.2…", "link": "https://www.reddit.com/r/SonyAlpha/comments/nxagyc/awaiting_new_macro_gm_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "awaiting new macro gm lens /!/ anyone else waiting for sony to drop a new macro lens? iv been saving my money for when/if they drop the lens this year. sony alpha rumors posted a road -----> map !!!  that listed the macro gm lens right below the 50mm f/1.2…", "sortedWord": "None", "identifyer": 34381, "doc": "b'x\\x9c\\xedX{T\\x13W\\x1a\\'J\\xed\\x8a\\xd5#\\xc7J\\xeb\\xab\"b\\xf1X\\x05y\\xc8\\xd2nY\\x0b\\xa6(jB\\x0c\\x01D\\xb3\\xc0$\\xb9\\t\\xd1\\xccL\\x9c\\x99\\x88\\x91\\xb8\\xb4\\xdbmk\\xed\\x03\\xe4\\x14\\xb6t\\xa5\\x95\\xcc$a!BO\\xba+\\xb49]_(\\xd0=*\\xc7\\xba*G\\x17v\\x91\\xed\\xa2\\x15T\\xd8\\xa5\\xebc\\xcbN4\\xb7\\xca]g\\x99\\x1c\\xf6\\xf4\\xaf\\x9ds\\xe6\\xfe\\xe6\\x97o\\xe6\\xfe\\xe6\\xbb\\xf7\\xbb\\xdfw\\'o\\xb9\\xb6\\x03\\x8a6\\x92\\x04\\xbb<:\\xd6\\x811\\x0cEW\\xa7\\xacJ_\\xbbn\\xbdL\\x9e\\xa18)i9)9~Rr\\xc2\\xc9\\x90[\\x01A\\x1f\\x9fy\\xe3R\\xfb\\x87\\xd7\\xdf|\\xd1V\\n1a\\xc3\\x85t\\x171\\xef\\x9a.\\xe8\\xfeQv\\xadD\\x96$];s}\\xc7\\xae\\xeb\\\\K\\xef\\xb6\\tA\\x8f>$\\x08\\x1fyvs\\xc7K;\\xcfw@>xE68i\\xda?SPT\\xf9\\xed\\x9d\\r\\xc1-\\xbb[\\xad\\xe5\\xe5\\xfe\\x8eP\\x9d\\x89\\xb0_\\xff\\x01\\x7f7\\x8c\\xcc\\x99Ws&\\x82\\x86|\\xcfo<\\xa97G\\xba\\'\\xa3(V\\x07\\xf2\\xb1t\\xdc\\xcb\\xc2\\x1a\"m!\\x05(\\x16\\xf8\\xed\\xa1/\\x9c?|\\xf9\\xb5\\xd8\\x8b\\x99\\xeb\\xa2\"\\x86\\x7f_\\x8f\\xa1:p\\xbcP\\x9d\\x98\\xc3]\\xb7#\\x12\\x9a\\xf6A\\xbe\\xae<\\xf4B\\xfb\\xe2cSQT\\xfb\\xed\\x9e\\xc8\\xb6\\xd5\\xf5?\\xddvv\\xbf\\x80?wGF\\x1fB:\\xdf\\xce=k.\\x98~f\\x16\\x8a\\x98\\xdfn?\\xea^\\x7f\\xad\\xb3\\xa4\\xf1\\x0b\\x01\\x9d;\\x02:K\\x95;\\xf5\\xf9y\\xbb\\x7f\\x06\\xf9\\xb9\\x90E\\x03\\r\\xee\\xa5\\x93P\\xccG\\xfc\\t4\\xde\\x9e\\xdd\\xd2\\xfd\\xd2\\x93\\xb1\\xe1u\\x907l\\xfa\\xe0U\\xaf\\xfb\\xae\\x1c\\xc5l\\xbf\\xbd\\xc7\\xdb\\xbb<-4}B\\x99\\x80?#\\x02\\xfe\\xb4!\\xc2_W\\xd5\\xc6\\xe6\\x9cxF\\r1\\xf1\\x0fuIC\\xe7\\xc3\\xb2\\xd1\\xf5sL@\\xe7;\\x01\\x1dt\\xfd\\x948\\xf0\\xde?M*\\xebBQ\\xe3\\xb7\\xcf\\xd7\\xe7\\xf5\\xc7i\\x06B]\\x01\\xae\\x1f\\xd4\\x9f\\xcay]\\x1b\\x0f\\xf5\\x9d+C\\xb1\\xc0o\\x87q}@2\\xba\\xdf\\x12Dw\\xacx+\\xbb\\x15.\\xf1<\\xffQ\\x02\\x8ay~\\xfb\\xd2\\x0e\\xdd\\xea=\\x83.Y\\x85\\x80?B\\xeb\\x07\\xf5\\xa7\"\\xfb\\xe6eOq\\xf0\\xe3(\\xc2\\xf9\\xc9k\\xb2\\x9e\\x99\\xdf9\\xfdxi\\x80\\xeb\\xa7#Mi\\xbay\\xbb(\\t\\xf2%\\xeb\\x0c\\xc3\\x9f\\xfe\\xf59\\x07\\x8a\\x9b\\xfc\\xf6\\xaa\\x1ev\\xce\\xae\\xea\\xbf|\\xf5q\\x80\\xf3s4\\xa72{\\xf6{Z+\\xe4\\xe3\\xcd\\xa3b\\xf3\\xdbx\\xf3\\xa8\\xd0\\xfc\\xa0:?T~K\\xd3\\xe4\\xbcf\\xa2\\xbb\\xb7\\xa1(6\\xbf\\xfdCd~\\x9bE\\xb4\\x94\\xfd\\xe2\\xfa\\xc4\\xa9(\\xe6\\xf8\\xed%\\xc11E\\x86H\\xefi\\xa1\\xb8\\x86\\x1c\\xcdoh\\\\\\xc7D\\x1di\\xb9\\xf2\\xf2\\xc1\\x03\\x10\\x87\\xbb\\x1d\\xcf\\xb8\\x97\\x87\\x95A\\x9d\\xb8\\xdcrl\\xe8\\xdc\\x94\\x15\\x81\\xae\\x9f\\x9a\\x94\\xa4\\xa2Pl\\xea~\\xc8\\xdd!\\xf1o\\xbd[\\xf1\\xb8\\x01b\\xf8\\x95S\\x1f\\xa9_\\xe8\\x0f\\x0bt\\x7f0V~k\\xac?2}g\\xea\\xe2\\x89(\\xc2\\xba\\xb0Fqja\\x1b\\xa6Ij\\x0e\\xd0\\x9f\\xf4\\xe2\\x9c\\xf3\\x87\\xe7z~\\x0c\\xb9\\xac\\xab\\xee\\xb3)\\xc6\\xc7N\\xa3(6\\xde\\x84\\xf25\\x1aoB\\xf9:\\xcbo\\x87\\xf9\\xda+\\xa0\\xf3/\\x01\\x1d4\\x0eZ\\xcfN\\x1d\\xa8\\xba\\x90w\\x11EX\\x17d\\x9dqQ\\xc3\\x15qCBu.X`\\xdcP\\x1d\\xe3\\x0cC\\xeb\\xd0\\xb2\\x9fD\\xa0\\xa8\\xf5\\xdb!\\n\\xad\\x9f\\x11\\x91\\xfeL\\xbbQ\\xfae\\xc8]\\xaf\\x1bE\\xb1uN(\\xbf\\xfdG\\x9d\\xabO\\xdbtln\\xdcU\\x14a\\xbc]Z\\xb42&|\\xf8\\x8d/\\x0e\\x04\\x18o\\xad\\xea\\xfe\\xe4\\x1b\\xd6\\x0fN@>V\\xfd\\xa9\\xba\\x93\\xb9t3\\xf3\\xcb\\x92\\x83\\x01\\xee\\xab\\xd6T\\xbf\\xa18=0%\\n\\xf2\\xf2\\x0f\\xe9\\x15N\\xfd4\\x03\\x8ab\\xeb\\x8f\\x90?\\x03\\xbf\\x9a\\xae\\xfes\\xf3\\xc1[\\x90\\x8f7_\\x8b]?\\xb2\\xe7*\\xdf\\xed\\xe8\\xf5\\xccAQ\\xc8\\x1fX?\\xdf\\x94\\xfcw\\x7f,\\x7f\\xbf\\xde\\xbd\\xec\\xb4e\\x06\\xe4\\x9dG\\xben\\x93\\xe5\\xb3\\xa7PD\\xfdq#\\xfdB\\x1d\\xb1\\xf5\\x07\\xd6\\x17\\x14\\xc5\\xd6\\x9f!\\x01\\x1d\\xb4\\xfe\\x88\\xdd\\xbf\\xc1\\xef\\x12\\xa1\\xfd\\x1bZ\\x7fP\\x7f8o{k\\xc2,\\xef{(\\xa2\\xe36\\xde\\xef\\x9f\\x1d\\xd4\\xa1\\xba\\n\\xc3\\'\\xdfB,mT=\\x1f^y\\xb8\\x0f\\xea\\x14\\xaf\\x9f\\xf7\\xf4c\\x1b\\xbaC\\x02]\\xa7SvT&N\\xfa\\xfcG\\xb3 \\xbf\\xfb\\xd4S\\x8dy{\\x16,\\x868w_[\\xc5BK\\xf5f\\xb8N\\xfb\\x92\\x8a\\x7f\\xf7\\xba\\x86\\xec\\x0f\\xb4\\xce\\xa56VV\\x87$l\\xfa\\x0e\\xf2\\xf1\\xee\\x13\\x85\\xf2\\x1b\\xbaO\\xcc\\x9a\\x135\\xadvv\\x9f\\x17\\xc5\\xff\\xf5\\xfc,\\x98\\xfc\\xf9\\xb5\\xacJu<\\x8ab\\xf3\\x81P\\x9dCu.6\\xb8\\xb0\\x9e\\xdc\\xf6\\x17Q\\x84\\xf9\\xba\\'7Q&}\\xda;\\x10h\\x1c\\xfc\\xf6o\\xf2\\xfe[\\x7fL\\xdd\\ry\\xfb\\xbe\\xdd\\x13\\xbe\\xa9\\x9d}\\x0ebI\\xc4\\x8a\\x1af\\xcd\\xaeA4\\x0e\\x0e\\x05\\x98\\xdf\\xd08\\x18o\\xbe\\x16\\xfa^@\\xf3\\xf5\\xff\\xff\\x0f\\x19}\\x88\\xcd\\xd7w\\x16\\xb9n\\xd2\\xfblJ\\x14\\xc5\\xfe\\x7f \\xf6\\xfb\\xf4\\x89\\xec\\xae\\x82\\'2\\xde\\xf7\\xa2(v\\x9fx[\\xc0\\x1fT\\xe7\\x87\\x8a\\xb7\\x85\\xa5\\x98\\xab\\xf8\\xea\\x97}(\\xc2\\x02\\xa5\\x0e\\x9f\\xd1\\xfc\\x8dm\\x88\\xd9X\\xfb\\x95\\xe72\\x1d\\xe5\\x81\\xfd\\xbe=F\\xdd>8y\\xfe\\xaf_o\\x8a\\x0f\\x83\\xbcG\\x9d\\xff\\xb6~\\xf3;j\\x14\\xd1\\xba\\x00\\xe3M\"R\\x07\\xad\\x0b\\t\\x1b\\x06\\x16T\\xf5\\x85_E\\x11\\x8d\\xb7\\xa6q\\xc6\\xdb\\xcfK{g6\\\\\\x9c\\xe0\\x8a?\\x94\\x85\\xaf\\x1c\\xec\\xaf\\x84\\\\\\xec\\xfe\\xe0\\x86\\x80\\x0e\\xba?p\\xd2fL\\x0b\\xe8\\x96D\\tr\\x04A\\x0c\\x1a\\xcd\\x1f\\xbe#(\\xc8e\\x02\\x84\\x81)\\xa4[\\x82\\x13\\xf9\\xce\\\\4C\\x19\\t\\x03})\\x08\\xdf_\\x13\\xcdFGG\\xd7\\xc4\\xb01\\x0bb\\xec+\\x96\\xd7\\xac\\xec\\x8cL\\xa1\\xcd@\\xcb$+(\\xd2`S\\x01\\x82\\x06\\xfc%\\xa0m\\xd9\\x80\\xd2\\xa4\\x91\\x14\\x9e\\xac\\xc0(\\xc6\\xbeJ\\xda\\xb9d\\x15\\xc6\\xdb\\xe4$n\\x93[p\\r\\xa0\\x92\\x15&\\x0beS\\x00\\x8a&\\x89\\xe4x\\x1b\\xff<\\xa1\\xb2\\x9a}O\\xd3\\x9c4E\\xf5\\xb2]\\xaa\\xfaL\\n\\xf4F\\xc2\\xc8\\x80d\\xfe\\xe2\\xc1\\x1d)\\x14\\xf3\\xc0\\x92N\\xe8FY\\xea\\xa4\\xc0@\\x01\\xbe\\x1b\\x92\\xb6\\xa7\\xcb\\xedk\\xd7\\xda\\xe5rV.W\\xf0g\\xa6\\x9bW\\xbew\\xdf*\\x8c\\xd2\\xd5?\\xf4\\x1a\\xf0:\\x93\\xf7\\xb3s\\xc9C\\x04\\xbe_\\xac\\x8d\\xef\\x8fN\\xce\\xe5\\x1d{\\xf8E\\x9bG\\xdd\\n\\rR\\x80?\\xda\\xc0\\xbf+\\x9b\\xa1\\\\\\xcd*\\x94\\n\\x8e?#\\xdd\\xdf[\\x94\\xc0\\xd4\\xa0\\xb0\\x10Z\\xe6~\\xcf\\x802\\xd6n\\xc8J\\x91\\xab\\xd2U\\xb9ve*\\xa7\\xcc\\xc8P\\xb1\\x99\\xb92\\xbb*\\xa3\\xc9?\\xc6\\x18\\xcd<\\x18\\xe34#\\xd1\\xfc\\xa8\\xdf}c\\xdf\\xf4\\xa8I\\xe1\\x1f\\xb0g\\xa7\\xb2\\xd9\\xa9R\\xfe\\\\\\xcd\\x9fr\\xfeT\\xb8\\xbf\\xb7\\xa7\\x13z6G\\xaabs\\x94\\xa9\\xf6\\x8d\\x1bk0\\x16\\xd3\\x9a\\x1c\\x98n\\xbb\\xd6\\xe4\\xe4[\\x9c\\xd490\\x93\\xb9\\x10\\xe30\\xfe\\xd2\\x89\\x11V\\x92\\x00,f\\xd9\\xe1\\xc0\\x8a0#S{\\xaf\\xe5=\\xb7k\\x00\\xa7\\x01\\x80ph\\x80\\x89,\\xaa\\xd5\\x92\\xb8\\x99\\xb4\\xf0c\\xa0\\x03\\x0c\\xa7#5[8\\x1dE\\x9a9`\\xa2\\x81C\\x1f\\x13\\x1b\\x1d\\xc7\\xeaI\\xcan\\xc0\\xedF\\xbd\\xdd\\xb8\\x9d\\xe3\\x83\\x90\\xe6LF\\x9aq\\xfa\\x1a\\xa0s\\xe0\\x98\\x96\"Y\\x1c3s8Fm\\xb5\\xe3\\xb8\\x03\\xe7u\\xadv\\xdc\\xca\\x12\\xa0\\xa8\\x960\\xfb_\\x8d\\xa0-\\x9a-N\\xc2\\x82\\xfb\\x88\\xd9\\xa7\\xca\\x99}jf~\\n}\\r\\xe3\\xf45@\\xc7\\x99)`v\\x98}\\xc3\\xee\\xa0\\x80\\x89\\xf7\\x902\\x1a\\n\\x19\\x8e\"1\\x9d\\x83\\xb2\\xe0$\\xe5\\xbc\\xd7\\xd2\\x1c\\x8dm\\x07N\\xbe\\xe1}\\xe2\\xf8p\\xb0rL!\\xc6\\xb0L!\\xe0/\\x80\\x8f\\x19i;Cr>\\xb7]~\\xdf\\xb9\\xa2B@pV\\x80Ql\\xcf+NN\\x8b1\\xf4\\xdeW\\x1cz\\x13f\\xa0\\xf7\\xbe\\xea)\\xc4\\xe8|\\x0b\\xb1\\x95 \\x8b\\x88\\xfc\\xfbk\\xf5h=\\x8fD\\xbe\\x81\"-fzo\\x8b\\xa4\\xec\\xdf\\x8adK\\xc0'", "year": "2021"}, {"Unnamed: 0": 143606, "autor": "Benjiblobs", "date": 1622134846000, "content": "Record button not work on my A7S ii /!/ As the title states, the record/movie button on my A7S ii has randomly stopped working. The camera hasn't taken a hit or been damp to my knowledge and the button has been working fine up until a few days ago.\n\nIt's not a huge deal because I have the movie record button mapped to C3 anyway (lifelong Canon user and old habits die hard) but I'd like to at least have the option of using it if possible. \n\nI've gone through the settings to see if there's anything set wrong, but I can't find anything. The setting that allows you to disable the button in modes other than movie mode is set to 'always' and I've been using the camera in movie mode.\n\nDoes anyone have any advice/anything else I can try?\n\nCheers in advance,\n\nBen", "link": "https://www.reddit.com/r/SonyAlpha/comments/nmc11u/record_button_not_work_on_my_a7s_ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "record button not work on my a7s ii /!/ as the title states, the record/movie button on my a7s ii has randomly stopped working. the camera hasn't taken a hit or been damp to my knowledge and the button has been working fine up until a few days ago.\n\nit's not a huge deal because i have the movie record button -----> mapped !!!  to c3 anyway (lifelong canon user and old habits die hard) but i'd like to at least have the option of using it if possible. \n\ni've gone through the settings to see if there's anything set wrong, but i can't find anything. the setting that allows you to disable the button in modes other than movie mode is set to 'always' and i've been using the camera in movie mode.\n\ndoes anyone have any advice/anything else i can try?\n\ncheers in advance,\n\nben", "sortedWord": "None", "identifyer": 34644, "doc": "b'x\\x9c\\xed\\\\\\x0b\\\\\\x13W\\xd6\\x07\\x9f\\x05\\xac\"\\xb6V+\\x16E\\x94\\xea\\x82T\\xa9J[Y\\xe5!\\x16\\x94\\x90\\x86\\x87\\xa2T\\x98$C\\x88&3!3\\x01A\\xac-\\xadV\\xeb\\xfa@W\\x8a\\xcf\\x85LB\\xb0 TkQ`\\xa5b\\xb1\\xb6v\\xb1~\\xf5U\\xd6\\x07U[\\xfaU\\xc5\\x07\\xbe\\xaa\\xa5e\\'\\x98\\x8br\\xea]&\\x9b|\\xb4\\xbf\\xfd}\\xf3c\\xee?g\\xee\\xcc\\x9c\\xdc{\\xcf=\\xaf{\\xc3\\nS\\x1a\\xa9e\\x944\\xc5\\xbd0v\\x9c\\x91`Y-\\xb35($<b\\xc6\\xccHQ\\x94\\xb8\\xce\\xb1\\xb6\\xce\\xf1`\\x9d\\xe3g\\x85,\\xbd\\x80\\xa4\\x98\\x83a\\x1fFm\\x97\\x9f=\\xed{\\xb5\\x0cb\\x82\\xc3\\x83c\\x97\\xd7\\xe7\\xd3\\x8b\\xff\\x9cz<z\\x86\\xb7\\xe7\\x9d\\xeab\\xa2\\x9bC\\xc7\\xc3\\x11 :\\xfc\\xf6\\x9f\\xbb\\xef\\xf9\\xe2\\x9e-\\x88\\xde\\x9cw\\xe9P\\xfc\\x1b^\\x1fB\\x84|vX^\\x04\\xf9 \\xba\\xd5r\\xe0\\xf8|\\xbc5/\\xd8\\xf9\\xf3\\x89\\xbd \\xce\\xb3\\xd4_\\xa8\\xfa\\xee\\x85\\xb0\\xfe\\xe1\\xdd\\xb6c\\xf8\\xa0v@>N\\xcdE_\\xa6\\xfe\\xd2o\\x1a\\xa2\\x7fX\\x906#qw\\xd4J\\x88rK\\xfd\\xbc=\\x19_{\\xd4\\xbb\\x1e\\x9cyt\\xf15C\\xedw\\xa9\\x90\\x0f: \\x9f\\xa3a\\x12\\xd5\\x8d\\xfb\\xe9\\x01\\x88\\xae\\x9aX\\x9d9t[\\x98\\x08b\\xac\\xa5\\xde#y^\\xd3x\\xe9\\xd5\\xfeU\\x98\\xf6\\xb4\\x82\\x03]\\xff\\x1c\\x0cXYq\\x8dkf\\xf0\\xf3\\xdd!&Z\\xea_\\x15\\x1f\\x19\\xf19!\\r\\xd8k\\xe5\\xf8\\x84/\\x9auj\\xbf\\xfb\\xaeI\\x88\\xee}\\xa3i\\xf6\\xb2\\x7f\\x96]\\x83\\x98d\\xa9\\xef\\xff\\xf2\\xa9\\xfd\\x17\\xdf\\x1ew\\xba3y\\xebL\\x0e\\xbaO.2\\xc5\\xe4\\xe5TA|\\xddR\\x9f0l\\xc0\\xde\\xcbY7\\xd9=\\x98\\xf6\\xfc\\x82\\xe9\\xb7r\\'\\x8f\\xcdK\\xf7\\xf8\\x0fD\\xf4]\\xf7\\xe3\\x9a$\\xd7\\xaf\\x07C$,\\xf5n\\xcb\\xbdZ\\x1ao\\'\\x1f\\xd9g\\xe1\\xd3\\xddr}\\xb1\\x85\\xfeY\\xe0\\xf8\\\\\\xa8\\xd1\\'z\\xae\\x9f\\xa4\\x80(T\\x0e\\\\A\\xff\\xe1\\xf8\\xac\\xdb\\xc4L(L\\xee\\xab\\x808\\xc7R\\xbf\\xf1\\x027d\\xf1\\xd6\\xf3\\xc7\\xfef\\xa5\\x1c\\\\}\\xdf5\\xe1\\xdb\\xbd\\xe5\\xf7\\x10\\x9d\\xeb\\xf7\\xeb\\x91\\x7fL\\x8e\\x0b\\x80h\\xad\\xde\\xe9L\\x0eZz\\x8c\\x08qj\\x96\\x8ck\\xc7\\xde\\x01\\xab\\x9b\\xaf\\r\\xdf\\x89\\xf8,\\x9a9tP\\xcf\\xd7\\x1a\\x9c\\xad\\x95\\x03\\x97\\x85\\xb9\\x13{U>1\\x18\\xd1\\x15\\x03\\x9f]\\xb9\\xaa\\xa9e\\x04D\\x02\\xd4\\xef\\xb3r\\x9e^\\xeb\\xfe\\xd7\\xb2\\xa3}\\x17\\x1dC\\xb4\\xad\\xe3\\xd3\\x03\\xd3op|\\x84\\xda\\x85\\x0fl\\xd4\\xd7\\xca\\x01\\x8aC7}_\\xf1\\x84(\\xb3\\xd4#\\xc4\\xf5\\x1bN\\x0e\\xa0\\\\\\x0f*x\\x89\\x1ep\\xa9\\xb6\\x05\\xa2\\xbd\\xe5\\xcdV;\\xd7[ \\x9f\\xff\\xb7\\x0b\\x1d\\x0f[\\xed\\x02\\x1c\\x1fk\\xf5\\x01\\xe4\\xd3\\xa8\\xab~\\xf2\\xbe^\\xd2\\x1f\\xa1\\xdb\\x91\\xca\\x0bS\\xee6~9\\xcbR\\xef\\xf6\\x8b\\xdb\\xf63\\xb3\\xc2k6X\\xd9o\\t\\xa7n\\x89\\xe7^i\\x9e\\x8d\\xe8\\xa65Sv\\xf8n\\xb9s\\x0cb\\x9c\\xa5\\x1e\\xf9;km\\x9c?\\xef\\xc4F^+U\\xde\\xef\\x86\\xf0\\xe2\\xd5\\x88\\xfc\\x8cTo\\x16\\xf9;\\xe3\\xe3\\xd7\\x117O\\xbaL\\xb0\\xd6\\xdf\\xe9\\xe9\\xf2\\xc9SS\\xc6\\xdd{\\x0f\\xd1\\x99\\x8d\\x99\\x1b\\xe7\\xc6\\xfa\\x9eC\\x08\\xfd\\xaa\\xb5W\\x96D\\x06\\x84F<}\\xc0J\\xb9n\\x1d5\\xf7\\xe8\\xd4\\xccSG\\x11\\xad?P2\\xf3J\\xfd\\x922\\x88\\x04\\xa8\\xc7\\xe9\\x9d_1||$\\x99\\xc9\\x89\\xf3\\x96#7\\xc3f}\\x8d\\xf3\\xaf\\xa1\\xbe\\xce\\xe9\\x19\\x9b\\x1dzw\\xb2\\'D\\xa1z\\x07\\xf9%\\x7f\\x14\\xb9v\\xe5\\xcaj\\xf68%\\xb8\\xff_\\xfb\\xf1\\xcf\\xef\\xeb\\xe3\\x95+\\xab\\\\\\x89P56(\\xbb\\xa9%`\\x9e\\xbd\\xe5z\\xcc\\x0c\\xc5\\x9d\\x8f\\xbe\\xff\\x93\\x11\\xa2\\xb5r\\x00\\xf9\\x1c\\x98\\x95\\x1b\\xf7\\xecjY\\x06\\xa2\\xdd\\xc5C\\xfc\\xef\\x17\\xcdT@\\x84r\\x90o\\xa5\\\\C9\\xf8\\xfb\\x99\\x976\\xa6G\\xfc\\xe8\\x0f1\\x1e\\xb5\\xd7w\\x9e4hD\\xfd\\xcd\\xf7\\xad\\xd5\\xa3ES\\xc2\\xe7E\\xd6\\x8fj\\xa7\\xbdkj\\x7f\\x9cV\\xbe\\x03\\xe1\\x9d\\x06\\xe3s%/\\x0c\\\\\\x8b\\xe4\\r\\x8d\\xcf&\\x0c\\x9f\\x16\\x0c\\x9f\\x82\\xa0\\x80\\xf4\\xfe\\xc4\\x93\\xf9\\x88>|{D\\xe8\\xf7_{_\\x86\\x18c\\xa9\\xaf/\\xedQ\\xbb\\xfcP\\xc6\\xba\\xd5V\\xea\\x1dE\\xeb\\x90\\xa1\\x05_{2\\x88^{o\\x98\\xe3\\xae\\x97\\xb6\\xbd\\x08\\xf1\\x8ff\\xb7q\\xf2\\x06\\xed\\xf6\\x9b\\x9f5I\\xce\\xf6+s\\x81(\\xd4\\x9e\\n\\x95\\xb7\\x13\\xd3\\xcfx\\xff\\xc5w\\xa7\\x07D\\xa1\\xf2vW\\xa0\\xbc\\xd9K_C>P_\\xdb\\xea\\'\\xfe\\xd1\\xf4\\xb5\\xd0y\\x8a\\xe3\\x83\\xeb78O\\x85\\xfa\\x078}\\xd0\\x8c\\x91\\x03\\xe8\\x1f\\xec\\xbb\\xd5k\\xbe\\x07\\xf7\\xda%\\x88B\\xfd*\\xa1\\xf3\\xf4bN\\xde\\xad;qK\\x9f\\x83\\x88\\xf4\\xc1\\x99\\xb7SM\\xe5N/&\\xe2\\xf8\\xe0\\xe6\\xcfo\\xe2\\x9fd\\xe7\\x9a\\x15\\xcdq\\xcfC\\x14\\xaawp\\xfa\\x1a\\xf2\\xb1\\xd6\\xce!9~\\x17\\xf0\\x85|\\xa0\\x9d\\xcb\\x7fg\\xea\\xbe\\xdb\\xe3J\\r\\x10\\xa1\\xbe^gy/\\xfa\\x9a\\xef\\x02\\x1a\\xf2\\x81\\xfa\\xda)@\\x1a?\\xb7\\xff\\x9dV\\x84M\\x9e\\xfb?\\xea\\x95)\\x19\\x08\\xf3\\x07%V\\xf2\\x81\\xf9\\x83\\xe5\\xcf\\x0e\\x92\\x8e\\x19\\xfeU+D(o\\xe5\\x18>8;\\x07\\xc7\\xc7V\\xbf\\xf7\\'\\x0c\\x1f\\xe8\\xf7\\xae\\xdeX!\\xdf\\x98\\xbc\\xb9\\x0fD\\x85\\xa5^\\xeb\\xb2\\xf4X\\xd4\\xf4\\xe2\\xc4m\\x9d\\xe8\\x9d\\xce\\xf2U\\xde\\x83\\x9a\\xfa\\x1c\\x190x5Dd\\xe7\\xce\\x8c\\x9c\\xe27\\xec\\xce\\xb2}8=\\x8a\\x1b\\x9f\\x8a\\xec\\xd8\\x85\\xfe\\xa3>]\\x8e\\xe8\\x81\\xbf|\\xc8%\\xfb\\xb5\\\\D\\x08\\xf5\\x1b\\xd2\\xa3y\\x18>\\xcf`\\xf8@=jk\\xfe\\x1a\\xa7w\\xa0\\xdfk\\xab?*t\\x9e\\x9e8Nl\\xe8=\\xbe\\xfb9\\x88\\xb8y*t|\\xe0<\\xcd\\x0e\\\\\\xe9\\xbf8\\xf0\\xd6u\\x88\\xd0\\x9e\\xfe\\xd5J?\\x11\\xda\\xd3ng\\xe7\\x1d_\\xdb\\xeb\\x95\\xcb\\x10\\xa5\\x96z\\xa4GMV\\xf6\\x1b\\x94k\\x0f\\x8f\\x06\\x8d\\xd7\\xba\\xea0\\x84\\x9fL\\x0bMm\\xdd\\xfbL\\x90\\xadr}UTq\\xe9\\xca\\x96\\xbbi\\x88F\\xfe\\x00DdO7\\xfe\\x1c\\xed3\\x97}g\\xc9\\x1a\\x0c\\x9f{\\x98~\\x13_\\x1fP\\xfb\\xc4_\\xb2\\x0e\"\\xdaV\\xbf\\n\\xe7\\xef@\\xbf\\xaa\\xab\\xf2|\\xf6Z7\\xeb\\x8c\\x8fP?\\x11\\x17\\xcf\\t\\x95\\xeb\\x9fO&\\x9b\\xaa\\xd4\\xaf^F8\\xdc\\xa9\\xf2Jln\\x82?\\x8c\\x83?\\xb5R\\xef\\xc08\\xb8\\xab\\xe2\\x9f\\xaac\\x95\\xc3\\xd4k\\xbd\\xb2!&Y\\xeaQ>\\x11\\xc5%H\\xbe\\x968\\xfe{>\\xb0\\xdf\\xeeL\\xfa\\x9b\\xcf\\xfa\\xafb\\x8a \\n\\xf5\\x13q\\xf6\\x14\\xb6\\xa7\\xfc\\x7f\\xca5u\\x83\\x92\\xcb \"\\xbb\\xddo\\n\\xf3\\xb2\\xd3\\x81\\xb4&\\x9c\\xdd\\xc6\\xc5?\\xd4\\x85\\xd2\\xf5\\x07\\x8fW\\x9eE\\xb4\\xcbs/\\xccYtki&D\\xa1\\xfa\\x1a\\xa7\\xdf\\xa0\\xbe.\\xbd\\xeb\\xb6z\\xb1\\x83_\\x1dD{\\xcf\\x9f\\x9c\\xa0\\xe53R{\\xf7\\xf9\\x06\\xa2\\xd08\\x0b\\xb7^b\\xef\\xf8\\x14+o >\\x95l\\xdc?\\xf6\\x9f\\x15:O\\x88\\xf6\\xb6\\xa7^sNG\\xbd;r\\x90\\x0e\\xe1\\xca\\x17\\x97%\\x9drv\\xdb\\x00\\xfd^\\\\\\x9c%t\\xdd\\xcc\\xa5G\\xea\\xa5m\\xc1\\xb9\\xe3 B\\xfbcm\\xfe\\xed\\xd5\\xad\\xcb\\xc4_]u\\xf1Ft\\xe5\\xe5\\xf7\\'\\x85wO\\x14C\\xb4w<\\xb7\\xf9`U\\xe6\\x8aO$\\x13 \\xa2y\\xfa\\xf4\\xff\\xf6\\xc8\\xcd_\\x1f\\xe0im^\\xb9\\xe7\\x84C\\xe7s{1\\xc8\\xfc;\\xe8\\x8a\\xfd\\xa6Rqn\\x87!\\xda;\\xfff\\xab\\x1f\\x82]\\x0f\\x06~\\xc8\\xe0C\\x8a\\xa2\\xd0\\x1b\\xafoFx\\xee\\xad\\xf0\\x83\\xc3+\\x9c\\x89v\\xff:\\xd7\\xbd\\xfc\\xc3\\x1dQ\\xe7\\xad\\xcd\\x1f\\x1c\\xa8\\x9b{td\\xb7M\\xedr\\xb0l\\xda\\x89MC\\xc2\\x96\\xb4@\\x84\\xfb6pr}\\x1f\\xd3op\\xdf\\x06\\xce\\xce!?\\xde\\xe7\\xa8|\\xfa{\\xcd\\xa6H\\\\{p\\xfe\\x0e\\x94\\xb7\\xe4\\'v\\x06\\xba\\xbew\\xa9\\x00\\xa2\\xbd\\xd7\\x7ff\\xce^\\xac\\rrH0ADz\\x87\\xdc\\xbbK\\xec~e\\xdf?\\xac\\xe5\\xb3\\xeadBz\\xc4\\xb7\\xd5\\xce\\x88\\xee\\xcc\\x1fE\\xe3\\x83[\\xff\\xc1\\xf9;p|\\xba*\\xcfW\\xfbE\\x0fM\\x8d\\xba\\xdc\\x1d\\xa2\\xbd\\xf3\\xf1\\xd5\\x15\\xb1\\x9f\\x9d??\\xa3\\x0fD{\\xfbU;\\xc8\\xe6\\x9a{\\xd9\\x8d\\x17\\x11\\x06%\\x8d\\xdcS\\x94.O\\x84\\xf9\\xb7r+\\xf9\\xc0\\xfc\\x9b\\xd0\\xb8\\x1e\\xd7o8>\\x05#\\xd45\\xb3#\\xbeE\\xdd\\xef\\xd0\\xf7\\xfa\\x9a\\xc3\\xce-U%\\x10\\x85\\xc6sB\\xe7\\xcf\\x8a\\x117\\xbc\\x87\\x05\\xcfq\\x83\\x08\\xed6.\\xce\\xc2\\xe9kh\\xb7m\\xcd\\xef\\xdc\\xc2\\xf0\\xb1w~\\x07\\xe9\\xb7\\xce\\xf2;]e\\x7fvK\\x06\\x1bt\\xb3\\xdf\\x18\\x8d\\xf4\\r\\xa2\\x91\\xfdA~\\x88\\xb5\\xf6\\x07\\xc6\\xc1\\xb7kD\\xabX\\xcd\\x9aW\\x10\\x8e\\xfe\\xaaq\\xf3\\xe6\\x9f\\x9e\\xa6\\xed\\xbd\\xde\\xf8\\xe7\\xe2PW\\xe3Gu-\\x10\\xed\\xad\\x0f\\xbaJ\\x8fF(\\x1a\\x9d&\\xef\\xdc\\xd9\\x8a\\xb0\\xe7\\xbe\\xc8H\\xd9\\xb0o\\xfa\\x08\\xdd\\xc7\\x85\\xd3\\xa3\\xd0\\x1f\\xb5\\xd5n\\x0b\\xd5\\x07A;\\x1a>:\\x9c\\xf4\\xa6\\x11\"\\xb4s8}\\x80\\xdb7\\x08\\xed\\x9c\\xad\\xfaMh\\xbe\\xca\\xc1\\xc7\\xe3\\x87\\xf0\\xad\\xaf\\r\\x85\\x88\\xe6i\\xc5\\xfe\\x9c\\xd1\\xad\\xab|O\\x14\\xd8\\xd8o\\xb8<,\\xea\\xb7\\xce\\xf2\\xb08=\\n\\xf3\\xb0\\xb7\\x0e\\x95\\xec\\xfe\\xa6\\x7f\\xeaz\\x88\\xa8=\\x9d\\xe5\\x13q\\xf3g\\xd4\\xfc\\x86\\xa9O\\x8d\\x1b\\xf6\\x01\\xa2\\x8bGU\\x7f1z\\xbft\\x0bD{\\xe7]\\xb2\\x9b\\xd6\\xbb\\x7f\\xecT0\\x17\"\\xb4?;m\\\\\\xdf\\xb6u\\x1f$\\xce\\xfe\\xc0}\\x90\\xb6\\xc6?71|\\xec\\x1d\\xff`\\xf3\\x96\\xc0\\xfe4d\\xf6\\\\\\xf9\\xeb\\x9f\\x9e\\xae\\xd9pr\\x8c\\xf7\\xac7\\x9eJ@(4\\xfe\\xc1\\xcd\\xd3\"J}wL\\xf0\\x8a\\xc3\\x88\\xee\\xaa}5ne\\x1f\\\\\\x9bv\\xaeG#D\\xa1q\\xd65\\x81\\xfaM\\xe8<\\xb5\\xd6O\\x84\\xf3\\xf4\\xbfm\\xbf\\x18\\xb2\\x9f\\x10a\\\\R\\x8a\\xe1\\xd3\\x0f\\xf4\\x1f\\xba\\x0e\\xe3\\x92\\xd3\\xa5&\\xe2B\\xfc\\x17\\x93!\\xa2\\xf1\\xb9\\x10?12tP\\xd5Uk\\xd71v\\xff j\\xbaw\"\\xb8}}\\xee\\xcb\\x97\\xc76|\\xdfw\\xa9\\x0caUlq\\xec\\x99\\xbcm\\xf1\\xd0.|b\\xe5\\xf8\\xa8\\x12\\xba]zf\\xca\\x0f\\x1f#\\xfa\\xf5\\xe0\\xeb\\xe55iG\\x94\\x10m\\xf5G\\xdf0l}{\\xe3OS\\xd1v\\xe7.\\xf3C\\xaa\\xb6\\xe9o\\x9c?\\xba\\xa9\\x0c\"\\x9c\\xa7\\xd6\\xda\\xd3\\xdf+\\xde\\xb6u\\xbdDh\\xbc-\\xdbuz\\xbdou\\xc9h\\x88\\xf6\\xf6\\xaf\\x13\\xba\\xef.\\x0f\\xa4\\xfd\\xca\\x10\\xbe\\x93\\xed\\x9a~f\\xeeL\\x1f\\xa1~/\\x8e\\x0f\\xf4{G:\\xe6\\xf6s\\x8f\\x8eq\\x85(4\\xaf\\x8c\\xe3\\x03\\xfd\\x83SO]^\\x91\\xb4\\xadn\\x03D{\\xf7[W\\xad\\x03\\xa2\\xf1\\x80h\\xef\\xfdo\\xc1{\\xaf<#O\\x9b\\xed\\x87\\x10\\xb7\\xff \\xd7\\xca\\xf9\\x03\\xfd^\\xa1\\xfe\\xa8\\xad\\xf1\\xa9P\\xfdf\\xab\\x1c\\x9c\\xfd2kU\\xa3\\xa8r3Dd\\xb7\\x97\\xb4.\\xf5vX\\xf4S\\xa8\\xb5\\xbf\\xcbi\\xf2o\\xd1\\x05e\\x06\\x18\\x11\\xed\\x99z\\xbe\\xa4\\xa92\\xbd\\x19\"n\\xff\\xce\\x7f\\xba\\x8f\\xab\\xb3\\xf6\\x0c6\\xeet\\xd9\\xf4\\xed\\xf4Z\\\\{p\\xf9Q\\x89\\xaa<rM\\xde\\x8f\\x87\\x10m\\xebz\\x16.>\\xfd\\xbd\\xfck[\\xf3;8\\xbb\\r\\xf3;]\\xb5\\x0fRh\\x1e\\x16\\xe7_\\xe3\\xd6\\x83a\\x1e\\xb6\\xab\\xec\\xb6\\xd0\\xdf/\\xfc\\xdev[\\xe8>\\xc8\\xff6\\xfbck\\xfc\\x83[7\\xfb\\xbd\\xf2\\xcay\\xf9\\x1e\\xc7.\\xd4\\xbd2\\x18aa>\\xfd\\xe4\\x9a\\x03\\xb7\\x87\\xda{_\\xf4I\\xe7\\x91WKK|zA\\x84\\xf1\\xa9\\xb5\\xf1\\x0f\\x8cO\\x85\\xae\\x9b\\xd9\\xfa{\\xf4\\xef\\xb6\\xaf;\\xffq\\xc2\\xc2r\\x88\\xb6\\xea\\x038>\\x899.\\r\\xef\\x8e\\r\\xdd\\x00\\xd1\\xde\\xfa\\xc0\\xd6\\xdf\\x9f\\n\\xd5\\x07\\xb6\\xe6)pv\\x1b\\xcaA\\xe9\\x9c\\xbc\\xb7\\xaaJZD\\x10\\xed\\xbd\\xcf\\xa1\\xab\\xd6e`>\\xcc\\xda\\xbc\\x98\\xd0}\\x01\\xa5\\xdf\\x0f9\\xb7\\xe5\\xbbC\\xc1\\x10\\xe1\\xfc\\xc1\\xe5\\x0f\\x84\\xae;\\x87Ig\\xbd\\xadb\\x1aR!\\n\\xd5\\xa38\\xbbmo=zG\\xa0\\x1c\\x88\\xae\\xcf\\xef5b\\xda\\xd0\\xe3\\x08\\x9f\\xdbZ\\xdds\\xfcA\\xd31\\x18\\x9f\\xe2\\xe4\\xfa6\\x86\\x0f\\x8cOm\\xb5\\xdb\\xb8\\xbc2l\\xcf\\xfc\\xfb}\\xcf\\xdd\\xcf\\xce\\xbf\\x0eQ\\xa8=\\xc5\\xcd\\x1f\\xa8wl\\xcd\\x93\\xe3~\\xc7\\x02\\xf3\\xe4\\xb6\\xca\\xc1\\r\\x81\\xfd\\xd6O\\xea\\x92^\\xf1\\xa9A\\x0b1\\xc9R\\x8f\\xf6[\\xe2\\xe4\\xe0\\xba\\xc0~+d4\\x84\\x8cdjK\\x1d\\x1f9\\x1c\\xf8?\\x87G)G\\x07\\xc7\\xc7\\x1e\\xe67\\xfc\\xe6\\xda#/\\xe9x\\xfd\\xe1\\xbd\\x0e\\x0f\\xcf\\xc7\\xbd\\xd9\\xe1\\x91\\xeb\\x16\\x0e\\xa8tx\\xc0\\xd4\\xa4\")\\x05\\x9b\\xc2\\xd4\\xf6(5S\\x0c\\xabUR\\n\\xe6\\x8c\\xc3\\x89|\\xbd\\xb3s\\x81\\xb7\\xde\\x9b\\xff\\x93\\xeb\\xbd\\x19\\xce;\\x8d,x\\xbe`t\\x81\\x8f\\xd1w\\xa6$\\xd8\\xd7\\xe8+\\xe1\\xcb\\x82\\xb1\\x05~\\x9c\\xdfp\\xbf\\x82)\\xf5^A\\x8c\\x86\\x94\\xb1\\x81bR\\x9b\\x9c\\x15CR\\x0c\\x19(&\\x186+\\x8e\\xd4J\\xc3h\\xad\\x9a\\xa7\\xb4\\xec\\xc3\\xbb\\xb4\\xb4\\x02\\xdd\\xa5%\\x99\\x8ew\\xe9CB\\xf4!\\xa1\\xf5\\x13C\\x08\\xbe:H&\\xcb\\x9aNRrR\\x1b(\"ul\\x96H\\xa7\\x96\\xf2\\x9f\\xa3\\xf9\\xaf\\x99\\xc5\\xf3bh*\\xd0?\\x8b\\x7f\\x1d\\x15\\x93\\xa11\\xbf\\x8c\\xb1<\\'\\xa2\\xd5V>7\\xa6\\xfd\\xb9\\xc7\\xdc;\\xae\\xc3\\xbd\\xd5\\xed\\xb7Z\\xaa\\xc7w\\xa8.\\t\\xa1\\xa9\\xf9mD\\x88Zc\\x08\\r\\x8a\\x99\\xa6\\x0f\\x8d\\xa9\\x08%\\x93\\x95\\x94\\x92%\\x03\\xf9\\x0f\\x0fo\\x0f\\xd2\\xb2\\x0fk\\xc2)y\\x87\\x9a\\x0fBI\\x85\\x96\\xe4\\xdfI3\\xe8c\\xb4N\\xa3\\x9f6\\xbb \\\\\\x1f.\\xd2GDp\\x11\\x11\\xd1\\xfa\\xc8\\xd0\\xfa\\t\\x914-o{\\xfc\\xb1\\xed|\\\\O\\x87)\\xa9\\xfaa\\xed\\x8fa\\xee\\xe0Dab\\xbdH\\xc4\\x89Db\\xfe\\x8c6\\x88\\xa2$\\xe2\\x12\\x9e\\xc5\\x83\\xc6\\x11Zy\\xb1\\x85\\x9fX\\xa5\\xd3\\x16?\\xc2\\xbb~\\xcc\\xe3;\\x91f\\x98\\xc0x\\x9eI\\x87\\x9e\\xf7\\xb1\\xe6K\\xef\\xedp3z\\r\\xdf\\x06.J2\\x9d\\x13K\\xc4\\x06\\xfe\\xf4*\\x11\\xd3*B\\xabd3\\xf8\\xd1W\\x94\\xb4\\xdf&!U\\x7f\\x17\\xeb(\\x19\\x1b\\xad\\x94\\x93\\xe6\\xb7e\\xb5Qmu\\xc1Z\\xd9\\x02l\\xe5k:\\x9a}\\xa42\\x9cR\\xe2\\x9f\\xecXi~\\xb2\\xf4!\\x19B\\xab\\xd5\\x8f\\x90|k\\x95zI\\xb0A\\x12\\x15\\x15\\xa3\\x97\\x88\\xb9\\xe8\\xf8H}L\\xd4^\\xdc\\x04\\xda\\x83\\xe9\\x14}\\\\0\\x17\\x17<\\x9d?E\\xfc)\\xe6\\xcf9%\\x8f\\xd6?$\\xc2\\xa9\\xe46\\xa2\\x8d{$-\\xe7f\\x85\\xc6p\\x89\\xd1b}RR\\x01\\xc1\\x11\\x93\\x18\\x8e\\x90\\xa9\\x8c\\x84\\x8cVkL\\x84<\\x8d\\xa0d\\xa4\\x91G\\x99\\xaa\\x90/\\x952\\xd2\\x0cj\\xfe1BA\\x1b\\t\\x95\\x8aN/l+\\x19\\x1e\\xd2\\x89\\x0c\\xc6@\\xb4UR\\xe63\\xa3\\x90?i\\x8a,\\xe2\\x81M\\xe1\\x87\\xcbL\\xf37\\xe9\\tFO\\xb0\\x06\\xf3?\\x01\\xe3\\x08\\xddB\\x13\\x7fj\\x08\\x86\\xd1KI\\x93\\x94\\x94\\x11:\\x864HI\\x92\\xe2\\xa4\\xe6S\\xc7\\x16\\xf2\\'KSz\\x99\\xbf^F\\x14\\xca\\x085\\xa9%8\\x19A\\x19\\xf9\\xd3|Yf\\x94\\x99\\xbf\\xadQ\\x96B\\x92\\xda\\xc2\\xb6\\x92)2_\\xa1u\\x94\\xdc \\xe3\\xa7\\xa2AN\\xa85\\x9c\\x9c\\xc8\\xe0?\\xf0_QN\\x12*NN\\xf2WH\\x96\\x93+I\\x93\\\\\\xc9\\x10R\\x15\\xa9\\x97\\xd3\\x069-\\xe5o\\xa7I\\xc6@\\xaa\\xf8\\xefA.\\xd4\\xa8\\xb8d2\\xdd\\xc0OP\\xb9\\xb9 \\xf5\\n\\xda\\xa0\\xe0\\x1beL!\\xa4J\\xb6\\xb0\\xadd\\x0c)\\xfcT\\xe0R\\x08\\xf3\\x874\\x92KQ\\xb2\\x86\\x14\\x9d\\x82,P\\xea\\x95\\xc9z%_Rz%\\xa3W\\xb2\\xdb\\x17Pt\\xba\\x8a\\x94+H\\xa3\\x8a\\xe4\\x07\\xb7H\\xa5L&U4\\xa50\\xa8\\x94\\x0bHNMh\\n\\xf9SC\\xca\\rjB\\xbb\\xc0\\xc0w%i4\\x17\\x0c_\\xa6)I\\xbd:\\x83\\xa3\\xbcY\\x8e\"\\x15\\x06\\xca\\xdc\\xcf\\x14\\xcd\\x16Q\\x9a\\x07#b\\xa4\\x18\\x9dt\\xfe\\xf6\\xb6\\xb2\\xad;\\xe9d\\x8eV\\xc9\\xf54e\\xa05Zy!\\xada\\x95|w\\xd1Z#\\xcd\\xa6\\x90Z\\xa3\\xc6\\xdcE\\x06\\x8d\\xb9\\xbd\\x1a~V\\x16\\x99\\x0b%\\xdf\\x0b\\x06\\x8d\\x96\\xd4\\x185f\\t-\\xd2\\xf2\\x03I\\xabU\\x19\\x85ZRFk\\xe5F-\\xa9\\x92\\xa98\\x86$\\xf9\\x935\\xf1\\'\\xcb\\x8fj\\x91\\x05\\x19#\\xc3\\x12,Y\\xd8V2\\x06\\x86\\xa55&san\\x0eK, \\x8d\\xe6\\x822\\xb0)D[\\xc1r\\xfc\\xd70\\x9a\\xbf\\nibS\\xb4\\xb4N\\x91bd\\x95,?\\x0c,\\xcd\\xb1\\xda\\x0c\\xa3\\x8eb\\x95*\\xbdN\\xc3\\x99\\x05\\x82?\\xb5F\\x1d\\xc3\\xb31\\xa4\\xd3\\xda\\x05&s\\xc1\\x13\\xc6tZ\\xa7\\x92\\x1b\\xd3\\xf9\\xf9\\xad0.4\\xb7\\x88\\xcb\\xa0u\\x06\\x19\\xc129o\\x1a\\x93U\\x84\\x82\\xc9yk\\x17?0\\x89:\\xca\\xdc\\xf7T\\xe2\\x033}\\xa0\\x98G*Q\\xc1\\xb3\\xd509\\xb5\\x8ek\\xff\\x05\\xa0\\xf8\\xfdq'", "year": "2021"}, {"Unnamed: 0": 146577, "autor": "existorexit", "date": 1628770612000, "content": "Keeping apart 4K &amp; Full HD shots apart during shooting on a Sony A7 III /!/ Is it possible for them to get stored in 2 different maps so I don't have to look up the resolution everytime in post-production before moving it into the timeline? That why I could make 2 folders for my footage so it's easier to know which shots are Full HD, and which shots are 4K.\n\nThanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/p2ymwc/keeping_apart_4k_full_hd_shots_apart_during/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "keeping apart 4k &amp; full hd shots apart during shooting on a sony a7 iii /!/ is it possible for them to get stored in 2 different -----> maps !!!  so i don't have to look up the resolution everytime in post-production before moving it into the timeline? that why i could make 2 folders for my footage so it's easier to know which shots are full hd, and which shots are 4k.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 37734, "doc": "b'x\\x9c\\xe5Z{X\\x13W\\x16\\x07\\xdf\\x8a\\xdb\\xfa*\\xad\\x16\\x15\\xc5J\\xcbB\\xf1]\\xd7\\xd6Z\\x1eB\\x03\\x12\"O\\x15W\\x9c$\\x93\\x10\\x93\\xcc\\x84\\x99\\t\\x88\\xc5B\\xa5vm\\xb7\\xb5h\\x0bU\\xab\\xd6\\xcc$!<DK\\xb7\\x8a\\xb2>@\\xacJ?\\\\V\\xad|i\\xadX\\xb4\\xb5\\x0fD\\xd1\\x16\\x1f\\xd5\\xba\\x13\\xc8\\xf5q>\\xefg\\xb2\\xf0\\xb9\\x7f\\xec|\\xdf\\xdc\\xdf\\x9c9w\\xee/\\xf7\\xdcs\\xcf\\x9c{\\'o\\x17e\\x90\\x0c\\xab\\xa1)a\\xc2\\xf3\\x13-\\x04\\xc71\\xec\\xa6\\x900IT\\xf4\\x9c\\x18i\\xac\\xac\\xde\\xb3\\xb6\\xde\\xf3`\\xbd\\xe7\\x17V\\x8e\\xd6\\x92\\x14{p\\xec\\xaa\\xe3\\xefW\\xce\\xb6G\\x1e>\\x8b0[\\x08\\xe9\\xd5\\xd0\\x16\\xf1\\xba\\xd2\\xa3\\xf3\\xc8o\\xc9\\x89\\x99\\x1e\\x1e\\xf5\\xc4F\\xcfN\\xb9\\x87\\xc7\\xfd\\xc7\\x10\\'z\\x82\\xfb\\xb7\\xc7\\xa74\\xbc\\xb2\\xac\\xb1\\x01\\xc93\\x0e\\x9e\\xf4\\x8a\\xb8|\\xe5*\\xc4$\\xa7\\xbe\\xb9\\xea\\xdc\\x84\\x88\\xc1\\x92\\x1e\\xf9\\x18\\x9e\\xdb\\xe0@\\xf7\\x0f\\x03b\"Wu^;\\xdd\\xe6\\x05q\\xb1S?xF\\xe3\\xfe\\xb3y\\x13\\xbf\\xd9\\x82\\xe1\\xf9\\x03\\xc3\\x13\\xbc\\xff\\xf4\\x8d\\xb1SvnD\\xf2\\x98\\x80/\\x1a}\\xc2\\xaaNB\\x9c\\xef\\xd4\\x07\\x04-\\x92\\x87\\xf8\\xd9\\xaf|\\xe4f\\x7f\\x82m\\xb3$\\x8bb\\xec\\xe3\\x91\\\\r)*\\xbdu\\xec\\x89~\\x10a\\x7f6t\\xb1?\\x97\\x88\\xb2\\xdc\\xfa\\xd9\\x07\\xfaA$\\x9c\\xfaB\\xaf\\xc0r\\xd9\\x07^[\\xf6`x~wq|F\\xe6\\x06D{\\xfcQ\\x9a\\x021\\xc1\\xa9\\xb7\\x97\\xf7\\xaa]u(k\\xedZ\\x0c\\x0f\\x92!\\x8f\\xfa\\xf6\\xd3#M\\xc7\\xc6\\xb2Hn\\xd9r2\\xef\\xd0\\xc6\\x86\\xed\\x10\\x17:\\xf5\\x15\\xe3\\x0eG\\x96\\xbe\\x9c~\">\\xda\\x7fl\\xfb\\xdeR\\x02\\xf2\\xa0\\x9f\\xfd0\\xbbm\\xfeu\\xc5\\xa1kQ\\xa3>C\\x98\\xb9\\xb8-\\x85\\xfe1b\\x06\\xe2ym\\xce\\xc8\\xa7z\\xcfm\\x1a\\x80\\x1b\\x9fk\\x18\\xbby--\\x9c\\xd6gw\\xbf\\xe1H~T\\xf3\\xa7\\xcf\\xfe\\xa9\\xd5\\x91\\xe5\\xe9g &:\\xf5\\xa3U\\x8b.L\\x92\\xb7\\x0e\\xae\\xea\"O^\\xe4\\x84\\xda3\\xcbs7#|\\xe3\\xdc\\x84\\x81\\x89A\\xc3F\\xc1\\xb8\\xb3\\xc3M\\x1e\\x18w\\xaa\\xa6\\xed]6rs\\x84\\x14bw\\xf7\\' Z\\xdd\\xfe\\xd9\\xf7\\x7f\\xb6@\\\\\\xe0\\xd4\\xafo\\x16\\x9e^\\xbe\\xe9\\xbb\\xe3\\x9f`xz\\x02>t\\xbf&\\xb90i\\xc4jE\\x16\\x92\\x0bG\\x9e\\x9e\\xb7\\xef\\xc7\\x93\\xf9\\x10\\x17;\\xf5(\\x1e \\xbfF\\xed\\xe6\\x00\\xde\\x87\\xf9u\\xff\\xacg\\xe3[_M\\xf9\\x05\\xe2\\xc3xV8y\\\\\\x9d?\\xad\\x92\\xb7\\xf2V\\x04\\xdd\\xd4C\\x84<;A\\xbb\\x88\\xe7\\xa6\\x8b\\xf1\\xed\\xaa\\xcf\\t\\xc3\\xe2A\\xc7\\x86CD\\xf1m\\xc8\\xaaq7\\x7f\\xf8Mut\\x0f\\x86\\xe7\\xa2\\x8b~\\x10Z\\xd9\\xf2\\xa42c^0\\xc2\\xf6&\\xcb\\xa8\\xb2\\t\\xde\\xf9\\xc9\\x88\\xe7\\xd6\\x90\\xe2S\\xc9\\x92\\xea9\\r\\xcb/\\x9ak\\xcf\\xa5C?@\\x07\\xe4Y\\xd8\\xf8\\xab,\\xa5\\xe5\\xf2<$\\xfb?ua\\xe0\\xd1\\xa1\\xc3WCLu\\xeaO=3+\\xd8\\xb7\\xfd\\xad=[\\xdd\\xf4\\xeb]+\\x12\\x97N\\x1e\\x7f`\\x15\\x92\\xdf\\xf6k\\xf3\\xf7\\r]0\\x04\"\\x8c\\xd7\\xab\\xdd|\\xff\\xc0x\\x9dc\\xd1\\x9f\\xfb\\xb6O\\xfei\\x88r\\xa7\\x1e\\xcd\\xd3\"\\x0cO/\\x8c\\xdd\\xe0\\xf8\\xbc\\'\\x08\\xcd}\\x15\\x9fR\\x08\\x0bK#\\x16\\x1c\\xf0\\x99\\xf43\\xb4[\\xb9\\x9b\\xf3t\\xc4?\\xfe-\\xa9\\xde5\\xe3_H\\xce\\xbf\\xee\\xebY\\xf1\\x97\\xcdS .r\\xea\\x03\\x1b\\x94\\x91\\xef\\\\.\\x8a)p\\xf3=\\x07\\xfb\\xf3\\xcaw\\x95\\xcb\\xdb\\xfa\\xb6=\\r\\x11\\xf9\\xdb\\xa2\\x9dY\\xc7F\\xdb\\x07\\x1d,\\xc4\\xf0\\xe0\\xe6iCD\\x9c\\xae\\xedF\\xe6t$_\\x1d!\\x14\\x9c\\x1d\\x9c>\\x05\\xa1\\xb1?\\xffD\\xacg#\\x89\\xe2\\xf5\\xa4\\xf9k\\x89+\\'\\xbd\\xa6\\xbe\\x8f\\xe1\\xb9\\x8e\\xf1\\x83\\xde^\\xfb\\x86\\xcd\\x9ax\\xfd\\x1d$+*\\xbe\\xf9 ho\\xd9s\\x10\\xbb;^\\xaf\\x8e\\xec]\\xe2]Wr\\x0c\\xe2_\\x9d\\xfa\\x85\\xbeC+\\x7f\\xc9\\xbe\\xc2\\xcd\\xb3\\x1d\\xaf8\\xcb\\xfaW\\xa0q\\x7f\\xef!qtG\\xff\\xd1\\x1f\\xaf\\xdc9\\xd9\\x1b\\xc9\\xd1_\\xf5.\\xd8\\x93\\x1b\\xdc\\x06\\xd1\\xd5|\\x077>p\\xfe4-(\\xdb\\xfdV]\\xc2\\x14\\x84c\\xfa\\xefnI,\\\\8\\x19\\xe6!;1<\\xb70v\\x83y\\x08\\x1d^\\xb6\\x98\\x9e\\xbe\\xefo\\x10\\xbb{\\x9e\\x8e\\x1e\\xddd\\x18\\xb7vo\\x04\\xc2}\\xb3\\xc3\\xd3oW>\\x19\\xe2j|\\xc3\\xcd\\xd3V\\xe9\\xae\\x9f[6^\\xcd@\\xb2u\\x0b\\xfd\\xa7\\xf7k~\\x1b\\t\\x11\\xcd\\x9f\\xf5\\xbf\\xc7\\x07\\xa6po\\xe6\\xb8;Oe\\x97\\x86\\xd6\\xf6{7\\xfb \\x92\\x07\\t\\xdb\\xaaw\\xf6_\\xe8\\xf3\\xf9\\xa6u\\xa1\\x03\\x0eO\\xeb\\x83\\x10\\xc5\\x03\\x94\\xbf\\x15\\xbb\\xe9\\x07\\xfd/\\xdb\\xbeL\\xbf\\xf5\\xf8l$\\x0f9\\xba\\xbby\\xd6\\xd5\\x1f\\xbe\\x84\\x88\\xe6)\\x8a\\x07\\xb8yz\\t\\xe3\\x070\\x1et5\\xbe\\xe1\\xfa\\x03\\xfd\\xa0\\xae\\xe47\\x9f\\xbc\\xc7\\x15M\\x10a\\x7fj\\xdc|\\xff\\xc0\\xfe\\x9c]\\xb3\\xee\\xd7\\xf6\\xa4\\x95\\xa3 \\xc2\\xb8\\xf3\\xcf.\\xc6\\x9d\\xb5\\x1b\\xd8\\xa9V\\xd5cj\\x88\\xae\\xe6\\x898\\xbb\\xb5~4h\\xe1\\x99\\xca\\x1d\\xd7\\x91,\\xf7\\\\j\\xca[\\xb2\\xa6\\x18\"\\\\\\xff\\xe0\\xe2\\x81\\xab\\xeb\\xc6W\\xdf\\xfc:H\\xbd\\xf5\\xfa\\xe3\\x10]]\\x97\\xe0\\xf27h\\xb7G\\xf5^\\xf0\\xd9x\\xb8\\xc0\\xcf\\xb8)\\x05\\xa2\\xabv\\xc3\\xf1@\\xbb}\\xfe\\xe9\\x86\\x02o\\x8f\\xbe9\\x10\\xbb{|\\xaa\\x94/\\xbdp\\xd3\\xaf\\xce\\x07\\xa2\\xab<\\xb8\\xf7\\x02\\xe41\\xaf\\x1bS;t\\xd3\\xf0M\\x10]\\x1d\\x9f\\xab.\\x8e\\xcf\\xb9\\xb9K\\xce\\xcf\\xfb\\xe4|4\\xc2\\x17\\x87\\x1c\\xb8U\\xf7\\xed\\x89\\xaa\\xee^7\\xba\\x9a_\\xe3\\xf6\\x91p<&?}\\xf5\\xbc\\xa83\\xc8\\xfc\\x1e\\xed\\xda\\x90\\xc4\\xa9u9A\\x10]\\xb5\\x1b\\xce\\x0f\\xfeWqg\\xe0\\xf1\\xfa\\r\\x81{.\\xbc\\x0c\\xb1\\xbb\\xfd:B\\x9e\\x9c\\xa7c\\x9b\\xd2!\\xa2\\xf5\\x1c_S6\\xa7\\xc5\\x9e\\xb3\\r\\xb7_\\xd5\\x84\\xe1\\t\\x8c[\\xa6J]\\xb4\\n\\xa5\\x81\\x1e\\xdf\\x94\\x17\\x11\\xcd\\xf3\\x8f\\xbc\\x04\\xd1\\xdd|\\x07\\xee\\x8f\\xc2\\xf1\\xd9\\xf1ukc\\xf2-m3D\\xc4\\x13c\\x9f\\xe4\\xdf^0\\xe9\\n.\\x8e\\xe2\\xf2\\x9d\\xee\\xce\\xabp\\xf9\\x0e\\xcc\\xab\\xaa\\xf9\\xeb\\xdf\\xaf\\xe2<\\xd2 \\xdeY\\x07\\x17\\xfa\\xec\\xd8\\xbe5\\xf6;w\\xf3\\x83\\x9a\\xfa\\x94\\x86gzl\\xf0Gr\\x9ao\\xb1wP\\xaa~%D\\x98\\x1f\\xb8\\xbb\\xde\\x86\\xf9AW\\xd7\\x0b\\xb8\\xfe\\xc0\\xf5\\xc2\\x8b\\xd6\\xe4\\xf3\\x05M\\xd7l\\x08\\x9f\\x9f\\xfb\\xcc\\xa0R\\xc9\\xe5\\x1e0\\x8fww\\xff\\x1a\\xe6\\xf1\\xb8\\xf5\\xb6\\xabq\\x07\\xf7^\\x80\\xfe\\xb6\\xad\\xb4z\\xd0\\xb2\\xd0g{BD\\xfe\\xf6\\xaa\\xec\\xa8\\xdfaB>\\xbd\\xd2M?\\x90\\xbc\\x96\\xdc\\xb8\\xdf\\xa7\\xe2\\x05$\\xcf\\x8d\\x96\\x84\\xf2\\xc3Zk vw\\xdc\\xe9\\xea\\xfa\\xc7\\xd5u}W\\xf7wpv\\x83\\xfb;\\xde\\xb7\\xb6\\x0b\\xaa\\xe0\\x9bg\\x11\\xe2\\xf6\\xabp\\xeb\\x05\\xdc\\xfe5\\xdc\\xaf\\xfa\\xe4\\xcd\\xfa\\xd7+~\\x1e\\xf6%\\xc2\\x9f|\\x8c\\xdb\\xdf\\t\\x0c\\x10\\xd0:84\\xa9\\xbc\\xf9H\\xee\\x91\\x9e\\xb8}\\xa4\\xdb\\x18\\x9e\\xcck\\xeaK\\xa9\\xb1\\x1f\\xefG\\xf2\\xa3Z\\x97\\xf4\\xc8<\\xf6\\\\\\xd5!N\\x0b\\xb1\\xbb\\xd7%G\\xe6\\\\\\xe3}\\xfd\\xfa\\xca!\\xa2\\xf7v\\xf3\\xfci1\\xe1OU\\xb5\\xba\\xfb\\xde\\x86\\xfdq\\xf5;\\x86\\xbb\\xfe\\x06\\xe3\\xce\\xde\\xdb\\x85\\x81ZC\\xfel\\x84\\xd0\\xdf\\xd0z{\\x9d\\x9bq\\x07\\xae\\xb7\\xbb\\xfa\\x9d\\xc9\\xd5}\\x17W\\xbf3}\\xd8\\xc5\\xb8\\xb3\\xcb{\\xc4\\xdf\\xdf\\xbbp\\xd3\\x0f\"\\x01\\xf4\\xb8|\\x07\\x97__\\xec\\xf9\\xe1\\xb6\\x86\\xc7^;\\x8e\\xe4\\xaf\"O\\xf9\\xbf\\x1b\\xf4\\xe9h\\x88\\xae~\\xd7l\\xc7\\xf5\\x07|\\xd7\\xfc\\x7f\\xf5k\\xdcw\\xc0+.\\xfa5\\xee\\xfb6\\xccC\\x90\\xbf\\xc1<\\x04\\x17Ga\\x1e\\x82\\xf2g\\x88\\xae\\xe6\\xd7?ax`~\\xbdz\\xfd.\\xe5z\\xd5\\xc7\\x03!\\xaa\\x9dz\\xc6k\\xe5\\xf1\\xd8\\xc8\\xd2\\xd4\\xcd\\x18\\x1et<,\\xbf\\x8e\\x0f\\xb8h\\x1b\\xbf>P\\x8b\\xf0\\xd9x[\\xbcG\\x8f\\xf9\\xd9\\xd0\\x0f\\xca\\xdc|\\xff@?xT\\xfb\\x14Kn<v\\xfa\\xc6\\x8a-\\x97 v\\xf7>\\xc5\\xe2Q\\xcd\\xa7\\xb7\\xf6\\xa9\\xbb\\x0c\\xd1U?\\xc0\\xed\\xef@?\\xb0\\xb2\\x06BA\\xb2\\xb5\\x89\\x9e\\x9ebK\\x9e\\xf8\\xe3\\xae\\x0eU\\xf3x\\xa0\\xda\\xc3Y\\xc7\\xc3Q\\x14\\xe9HJ\\xcd\\xa5\\xb1\\xb5\\xbd\\x1c\\xe3P\\xc4r\\x8c\\x86R\\xb3\\xa7<6o\\xe1\\x07\\x0c0\\x8d1\\x8d\\xe7\\xfdYS\\xa0)\\xc8\\xf4\\xbc\\x10<&\\xd84\\x89\\x9f\\xa25\\xcd0\\xbdh\\x9ae\\x1f\\x17\\xc2\\x1aH\\x057SF2\\xaa\\xec\\x04\\x92b\\xc9\\x992\\x82\\xe5\\xb2\\x93HF\\x1eA3zQb\\xb8\\xbb\\xb5\\x18Z\\x8dj1${\\x7f-[XH\\\\\\xb8D\\x1a2\\x87\\x0f\\x0b\\xe3\\xc3\\xc2\\xed\\xd3\\xc2\\x08\\xb1^\\x88B\\x91\\x1dIRJ\\x92\\x99)%\\x8d\\\\\\xb6\\xd4\\xa8\\x97\\x8b\\xd7\\xf1\\xe2\\x0f\\xcc\\x16IY\\x9a\\x9a99[l\\x97J\\xc828Ze\\xed\\x01w\\x9es\\xd6\\x95\\xe9\\x8c\\x0c\\xa6n\\'\\x87\\x94\\xd6\\xffW\\x1c\\x8e\\xe7\\x1ePw\\xe2}u\\xcb\\xc2hjI\\x87\\x10\\xa67\\xf0\\xe1\\t\\xbb\\xc2I\\x95\\x86\\xd2p\\xe4L\\xf1\\xe2n\\xcd\\x10\\x86\\xbb\\xab\\x91P\\xca\\xfb4%\\xe1\\xa4\\x9a!;Z@\\x972\\x9a5Ix\\x89\\x94\\x8f\\x8a\\x12\\xa2\\xa2\\xe2\\xf8\\x98p\\xfb\\xd4\\x18\\x9aVv<\\xfb\\xc0\\x0e<\\xc8\\xee\\x11\\x1a\\xca\\xee{\\xe71L\\rA\\x1a!\\xe3\\xa5RA*\\x95\\x89g|\\x99\\xd8zg\\x7f\\x08FYz\\x8f\\x8dK\\xef\\xa1\\xb5\\x07<\\xd804\\xcb\\xce\\x9c/\\xb6\\x7f\\xaf\\x85\\x84\\xd8\\xb8\\xc8\"Y\\\\lxbX\\x82 \\x8b\\x93\\x99\\xc5s\\\\\\x99\\x8c\\xd6\\x11\\x8c\\x86\\xcb\\x12\\x87D].3R\\n\\xae\\x93\\x94\\xd6\\xeb\\xef\\x11\\xc5\\x965|\\\\\\xa89.66\\x81O\\x88\\xe5\\x93B\\x85\\xa4\\xd0H\\xf1\\x94\\x8a\\xa7L<\\x17\\x94\\xdd\\xdb\\x95\\xbb\\x82\\x84R\\t\\xc9\\xe1\\tBr\\\\\\xa8\\x90\\x1a/3\\x11<\\xf1\\x82\\x85P\\xd0zC\\x11\\xa1\\xcc (\\x05i\\x11Q\\xa1\\xb3\\x8a\\xa5\\x9eV\\x9a\\t\\xb1\\x10\\x08\\xbdA (\\xa5\\x850\\x88\\xfe*\\x10\\x0civ\\xfc\\x85L \\x8cK\\x8b\\xc4\\xd3@\\xb0,/\\'\\xadrRE3$\\xafPX\\x14\\x8e\\xf6l\\x8e\\x826RJ\\xb3B\\xf4\\x04\\x8b\\x826\\xea\\x94\\x16\\x05k\\x94/\\x11\\x94\\xa4A<\\xb9b\\xa5F\\xa5\"\\x19\\x92\\xe2x%mV\\xd2\\xf2%V\\xa5\\xd11\\x05\\xad$\\xc1jH\\xc6,BV1\\x99A2Y\\x9cFOZU\\xb4N\\xf4\\xd5\\xa2N`E\\xa49BM\\n\"\\xabYe\\xd4\\xe9\\x045\\xc9\\x99\\xd3\\x88\\x0c\\x92OS\\x9a4\\x82F\\xa3\\xe15\\x94YCq4\\xafay\\rg\\xd6\\x92\\xa4\\xa1\\xc8Q\\x88\\x14f-Eg\\x9au4\\xad5\\xeb\\t-)\\xe8\\t\\x83xa`\\xc5\\x82\\x11o\\xd1\\x19\\xa4U,\\xc4\\x8a\\xbc>K\\xa0\\xfc9\\x81\"\\xd5\\x02Es6\\xca\\xd0i\\x19\\x0b\\xe5\\xe8JqG\\xe9\\xb0\\x80\\x952\\xea\\xc5\\xdb<MY\\x0c\\x8e\\x9e\\x9b\\rb\\x7f\\xc4\\x82em\\x8eB#\\xd7\\x91\\x0e\\x893\\x1b\\x18\\xd2Pb`h\\xa5Q\\xc19\\xfe\\x91g`8\\x8b\\xc11\\xb0%\\xa2\\x03\\xd2:\\xa3\\xe3\\xa6\\x85M\\x13;g\\xeb(\\x1d?V\\xbc\\xe0\\x1c\\xf78\\x96gi\\xb3\\xe8SY\\x16\\x96\\x13\\x8dm\\xed(\\x95\\x16.\\x8d\\xa0\\xb4\\xd6\\x8e\\x925\\x8b\\xc0\\t\\\\\\x1a)^\\x90zG\\x91es\\x98O\\xa7\\xa1H^\\xb4\\x85\\xd1`\\xc9L\\xd3(\\xd2\\x84\\xcc\\xb4,\\xcb\\xd2\\x8e\\x9f\\xaa 8vM\\xaeE\\xa5#\\xd4\\xec\\x9a7*\\xd2\\x086\\xd5H9\\x0cD\\xa5v\\xc6\\xdf\\x9aR\\x11\\xa9T5C\\x1b\\r\\xec\\x9aZ\\xcf\\xfc\\xff\\x00L\"\\x19\\xa7'", "year": "2021"}, {"Unnamed: 0": 149693, "autor": "daush", "date": 1617419648000, "content": "Back button mapped to Menu , Sony A7C /!/ Hi there, I don’t know if I’m posting in the right place.\n\nI got Sony A7C, update from nex 5n\nAnd one thing bitter me a lot. The back button is mapped to the Menu button up the touch screen.\nIs uncomfortable and difficult access. \nWhen I want to press back using my left hand the screen turn off (view finder)\n\nI tried but I can’t see an option to map the back/return button to another key.\n\nIs that possible ?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mj07j4/back_button_mapped_to_menu_sony_a7c/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "back button -----> mapped !!!  to menu , sony a7c /!/ hi there, i don’t know if i’m posting in the right place.\n\ni got sony a7c, update from nex 5n\nand one thing bitter me a lot. the back button is mapped to the menu button up the touch screen.\nis uncomfortable and difficult access. \nwhen i want to press back using my left hand the screen turn off (view finder)\n\ni tried but i can’t see an option to map the back/return button to another key.\n\nis that possible ?", "sortedWord": "None", "identifyer": 40965, "doc": "b'x\\x9c\\xd5[\\x0b\\\\\\x14\\xe5\\x16\\x07\\x1f\\xdd+\\xa6\\xf9*\\xcbG \\xa2\\x14A\\xa4BY\\xf7\\x1a\\xb2\\xe0\\x03\\x15\\xd8V\\xe4!\\x04\\xcc\\xee\\xce.\\x1b\\xbb3\\xe3\\xcc\\xac\\x84\\xe2\\xa3[V>R\\xc0$I)\\x99\\xd9]@\\x10\\x8cn\\x80i\\x92\\x08\\x17\\xb5\\x9fEjz\\xb9\\x9a\\\\\\xb0\\xd2LL\\xc50\\xd2\\xb4Y\\xdcO\\xe5\\xfc\\x9c\\x1f3w\\xf9iw~\\xce\\xfc=s>\\xbf3\\xdf9\\xe7;\\xe7\\xcc\\x99ue\\xc1B\\x9cf\\x0c$\\xc1?\\xf3\\xf4\\x04+\\xc6\\xb24\\x93\\x17\\x1c\\x126k\\xf6\\x9c\\xf0\\x88H\\xe5A\\xd7\\xda\\x83\\xaeu\\x07]\\xffec\\xc9T\\x9c`\\xea|\\xb7/H\\xfa\\x86\\x8b\\xff\\xb8\\xf20\\xc4(\\x97\\x9bGci\\x9f\\xda\\xb7\\xeb\\xd3\\xb3\\xe7\\xce\\xf6\\xf6l\\xdf]\\x8c\\xf5r\\xe9z\\xb8\\x02D\\x87\\xfe\\xc6\\xc8\\xd1\\xf9\\x87<\\x19Do\\xdax\\xb6>n\\xa9\\xd7v\\x88\\t\\x0e~\\xb9\\xd7\\xbe\\x19\\xc5/.82\\xa7a\\xc9\\xcf\\x96\\xda\\xef\\x16@9\\xe8\\xb8\\xe18\\x10\\xed\\xff\\xf9\\xc9\\xdf<\\x03*7#\\xfa\\xeaQ]\\xc1N\\xd3\\xcc\\x9f\\x10\\x8e\\xe9\\xf7\\xe9\\xb9y9\\t\\x93\\xb4\\x0e\\xfe\\xc4\\xb8l\\xac\\xedh\\xff\\xc0\\xbd\\x8e\\x07\\x86rn\\x80\\x03\\xdd\\xef\\xdb\\xbfzX\\xd0\\x84\\x8eU\\x88\\xce\\xec\\xf0p-\\x7f\\xfe\\x83\\x00\\x88\\xf3\\x1c|w]b\\xebD\\xf5\\xf9\\xc1;e\\xca\\xd9\\x07\\x14\\xd9\\x1a?\\xfc\\xfa\\x85\\xec5,D\\xa8\\xb7J\\x99r\\xa0\\xdev<2b\\xf5;\\xad\\xd7\\xc6B\\xc4\\x00\\xff3\\x119\\xd7D\\xe4\\xfc\\xdc\\xfb\\xdd\\xb2\\x86\\x81\\x8b\\x0f#:g\\xf4\\xc9\\xd8\\xea3G3!&;\\xf8\\x83_8\\xf6\\xf9\\xa9\\xd7\\'\\x1cG\\xfe\\xd6\\xdbq\\x7f\\x99C.ROw\\xeb)\\xde\\xed\\xaf\\x9a\\xf4\\x98a\\x08D(g=\\x98\\x17\\xc9\\xf9M\\xa2\\xde\\xae\\x8c:B%\\x0f:\\xf4\\x18D\\xa47\\xae\\xa6d\\xce\\xb9\\xc6eeHoh=K\\x1ct\\x87\\x88\\x1c_\\xd5\"]R\\xe2\\xdb/#z\\xb1\\xdf<\\x8eq9y\\x16b\\xbc\\x83\\x9f\\x15`\\x19fPy\\xf9\\xad\\x13\\xb1\\xcf\\x03.]\\xd7\\x89\\x0e\\xe8o.\\xbe\\xee\\xa7\\xc3\\xf2^\\x1a\\r1\\xda\\xc1n\\xd9\\xf9\\xdd3\\xd3\\x07\\x87\\xf5\\xca\\x94\\xe9o\\xa5g\\xf2\\xc6\\xe7\\x94\\x17^F\\xb4\\xb3\\xfe\\xd6\\x07\\xc8C\\xf7\\xa1\\xbf\\xb9\\xbb7Q^\\xd9\\xbb\\xa7#\\xac\\x9e\\x16\\xba\\xe0F\\xd5\\xf0\\xe0$\\x07\\xff\\xc4\\xb8 \\x7f\\x8f\\xf67?\\xdb&\"\\x07\\xd9\\x0b\\xca9\\x1f\\xb1\\xe3\\xec\\xb9\\xcdW\\x16\"\\xda\\xb6\\x85\\x1c\\xb0\\xae\\xe6\\x97\\xd1\\x10c\\x1c\\xfc\\xdc\\xabs}\\xe3\\xd97\\x96m\\x10\\x91\\x83h(Gyah\\xed_\\xd7d\\xd4!\\xba\\xce\\xf5\\xc8\\x9ah\\xfd\\x85\\xd3\\x9f\\xe4mT\\xb8\\xed{\\xf6\\x01\\x84\\x89\\x0e>\\xb2O\\x91\\x88\\x1c\\xb1\\xfd\\x03\\xfd\\xa0W\\xda\\xa1\\'w\\xd6\\xb3\\xa9\\x10Q\\x1cM\\xacL?\\xe4\\xde8\\xa8Nn\\xbcn\\x98\\xae2^\\xfc-m2\\xa2\\x07^Xw\\xc0\\xed\\xda\\xce\\x12\\x88j\\x07\\x1f\\xc5\\xd1\\x02\\x99\\xf6\\x81\\xebq\\xd6\\x0f\\xc4\\xec\\x03\\xfd@\\xdd2\\xd3dn\\x1f\\xb1.y`\\xdb\\xb8\\n.r\\x00\\xa2\\x91\\x1f\\x0c\\xf9}H\\xd1\\x89\\x98\\xb0=b~ f\\x1fcB\\xaf\\xb3\\xc3\\x83N\\x7f\\x82\\xe8\\xa0\\xc9\\x87F%\\xd4\\x164!\\x1c\\xb5y\\xdf\\x86\\xb1\\xe6\\xbcxd\\x9f\\xccs\\xcb\\xc2\\'\\x87\\xcezx\\xa3\\xccx}c||\\xc3\\xd4E\\xc7\\x1a\\x10\\xad)?\\xbe\\xdeow\\xc9\\x93\\x10{:\\xcfe\\xbf\\xcf\\x04\\xdat\\x03\\xf5\\x10\\xe7;\\xf8\\xb9-\\xfc\\xc8%y\\xcd\\x87?\\x94k\\x9f\\xf7\\x06%\\xfc\\xb7\\xaa\\xa2\\x03\\xd1W\\xc7\\x15\\\\d6g\\xa8 \\xc2z\\'[\\xa6}`\\xbd3&\\xa8\\xb1\\xf7\\xb8\\xcd\\x8a\\x14\\x88R\\xf3\\xf6\\xef\\x12\\xf3\\x0f\\xca/\\x10\\xc5\\xf2\\x0f\\x94sEb\\xfeY\\x9b\\xbbC\\x9b\\xab\\xdb\\xf4 D\\xbd\\x83O\\xf7_q8rFq\\xd2\\x07\\xdd\\xd8\\xa7\\xbb\\xfc\\xe3\\xec>\\x15\\xb3\\x0f\\xdc\\xa7\\x1e\\xbb\\xfa\\xfb\\xb0m\\xd9\\xa5\\x08\\xa76W-\\xb9\\xf8\\x97\\x8b#\\xd1\\xfe93y\\xf1\\'+\\xd4d\\xab\\xdc\\xf8\\xa6(\\xcb\\xc9s\\x0b\\x98\\x7f\\x1d\\xd1\\x7f\\xb6zg\\x8bH\\xbds]\\xa2\\xbf9\\x9b\\xb7\\xc5\\xe2\\x01\\xcc\\xdb\\xc3\\x8a\\xf6N8\\xadj\\x1a\\x01\\x11\\xd9\\x07\\xe5S\\xb9\\xf1mf\\xde\\x9b\\xca\\xaf\\xce\\xf7\\xf7Ft\\xd1\\xa4\\xd8\\'\\x96\\xf0eF\\x88=\\x1d\\xdf\\xbex-}\\xce\\x96\\xa3_=\\x061\\xd9\\xc1G\\xf6\\xd9\\n\\xea\\xc4\\xb7\\x80\\xdc\\xee\\xec\\xb3\\x7f\\xc8\\x9b\\x1e\\r#\\x9bk!B9\\xb1\\x85\\x87\\xcbO1\\xde\\xe5\\xae@\\x8e\\xd8z\\xa0\\x9c\\xb3\\xc3\\x7fL_\\x1a\\xf0\\xf2\\x00\\x88R\\xe3\\x81X|\\x83z\\xfbf\\xc6\\t\\xef5~\\x1f\\xb9C\\x8cs\\xf0}\\xfc\\x12\\xd5\\xc1c\\x1b\\xdb\\xde\\x13\\x91sUl=\\x85Aa\\x89\\xe1\\x8d\\xe3\\x11\\x1d;K\\xf3\\x05\\x99\\xfe\\xfc%\\x88(\\x00&x\\x0c\\xad\\xfa)\\xa3\\x8dEzC\\xf6y\\xa7\\x9b}Z\\xd1\\xcf}\\xd3\\x8a\\xcaI\\x8f zWu\\xf4\\x1b\\x8f~\\xaa\\xf2\\x84\\x08\\xf3\\x82\\xdc\\xf8\\x06\\xed\\xd3\\x97\\xf7\\x88}\\xb0y\\xf9`\\x880\\xcf\\xbd/\"\\xe7W\\x11\\xbd\\xc1<\\xb7<0\\xee\\xcb\\x9a\\x13o_C(\\x16\\xaf\\xb7\\xc8\\xdc?\\x8fw\\xc4\\xb7\\x9c\\x1c=h6\\xa2}f\\xeb\\xdb?\\xfe\\xfe)+D\\xa9\\xf5\\x81\\x98\\xdejbr\\xa2G\\xac\\xd5\\xa4#z\\xea\\x0b\\x97v\\x9f\\xd9\\xe4\\x96\\x0c\\x11\\xda\\xa7\\xe4>\\xe7\\xed\\x0b\"r`\\xde\\xee\\xa9\\xba\\n\\xe6mXWI\\xed#9[WI\\xed#\\x95\\xca\\xac\\x13\\xa1}\\x14U\\xe7\\x86k\\x17\\xc6\\xfa#lo\\xb2>^\\xf2\\xcc#\\x99\\xb0\\x8e\\xcf\\x91\\xb9\\x9e\\x84c\\x97\\x95\\xf1\\xe7.\\xc5\"Zj\\xbfJn\\x1dr\\xbf\\xfaU\\xf7\\xaa\\x8e\\x97\\xda\\x17\\xeb\\xaeo\\xd9\\x9d\\x1f\\x88\\xf9\\x1b|\\x0f\\x96[\\xc7\\xc3\\xf7\\xe0SY\\x1b/\\xb7G\\xafx\\x1c\"\\xb2\\xcf\\x89\\xd7\\x17\\x14T\\xf4\\x0bH\\xda\\xf5\\x7fb\\x1fs\\xd6\\xf1\\x03\\xef-9X\\x0b\\xb1\\xa7\\xeds\\xe9\\x9f\\xcao\\xcb\\xe2KC!B9b\\xf9G\\xacN\\xbc_\\xefY\\xce\\xd6Ub\\xfdx\\xe8\\x07R\\xe3\\x9b\\xdc\\xb8\\x03\\xe3\\xdb\\x87\\xbb\\xd6mj=\\xa5\\xd6B\\x84ya\\xadL\\xbf\\x86y\\xc1\\xd9:QL\\x0e\\xac\\x13\\xb7V\\xee\\xdd\\xbe\\xfd\\xac\\xbb\\x0e\\xa2\\xd4\\xbaJ\\xec=\\x0b\\xae\\xa78\\xf2Hf\\x92\\xf7\\xea\\xa3\\x10\\xa1_\\xbf{\\x9f\\xfdZ\\xac\\xbe\\xeei\\xbf\\x1e\\xe0\\xc0\\xee\\xfc\\xba\\xfe\\xc8\\x80\\xf3\\xb9\\xffN<\\x0e\\x11\\xf5\\x13\\xc3\\x1b\\'z\\xb7o\\x98\\xd8&\\xd6\\xbf\\x16\\x8bo\\xf7\\xabO\\xf1\\xd9\\xd2\\x8f,\\x85F\\xca\\x00\\x11\\xbe\\x07W\\xcb\\xcc?\\xf0=X\\xac>@}e\\xdf\\x06\\xed\\x8cU\\x97\\n\\xc2\\xe5\\xf6-\\xa1\\xde^\\x8c\\xdd\\xf5l\\xf3/\\x86F\\x880\\x9f\\xd6\\xc8\\xdc?0\\x9f\\x8a\\xd5\\xa3\\xce~\\xc7\\x80\\xeb\\xd9\\x86_\\xda\\xd3\\xf1\\x8f\\x1fN!\\x0cN\\x1eWY\\x98\\xa6M\\x82}X\\xb1\\xef2b\\xeb\\x81}\\xd8\\xb2\\xe2=\\x83\\x16)\\x9e\\xe8\\r\\x11\\xf9\\xdbL\\xe5\\x97c\\xf7a\\xea\\xc9U2\\xfd:lq\\xcc\\xb1\\xcfG\\x95?\\x87\\xe8\\xf3/V\\xb2c\\xf4k\\x9f\\x83\\xd8\\xd3u\\xfc\\xa4\\xdc\\xfd\\xfd\\xce\\x0c|\\xf9]\\x88R\\xf3\\xb6\\xd4\\xf7,g\\xeb\\x1d\\xd1}\\n\\xea\\x1d\\xa9u\\x88\\xb3\\xef\\xf5\\xf5\\xd3\\x0e-\\xf6\\x8e<\\xa9\\x86\\xd8\\xd3\\xdfe\\xb2\\xc6-\\xbe|\\xb1};\\x06\\xb1\\xa7\\xeb\\xd1\\x8a\\xaf+\\xa8\\x83\\x8f\\xea\\xca \\xa2\\xfc\\xf3P\\x10\\xf3B\\xbf\\x9a\\x85\\xadb\\xf9Gl\\xff\\x10-\\xa5\\xeb\\xeb\\x8e|\\xfa-\\xa2\\xcb\\x97\\xaf\\xbb\\xeaY\\x1b\\xe0\\x05\\xb1\\xa7\\xeb\\xd1\\xe6\\x87\\n\\x7f\\xe8=~o\\x07D\\xa9\\xfd\\x03\\xa9y{S\\xdd\\xceE+\\xabU\\x81\\x10\\x91\\xde\\x1e>\\xd3\\'g\\xcb\\xfa\\xc9\\x9er\\xfb\\xb0}\\x03\\xeb\\x9bs\\x1e`PXq\\xba\\xef/\\xf6\\x1d\\xfd~\\xe5S\\xec-s\\xc4\\x07?>[\\x8d\\xb0\\xf4\\xfb\\x91\\'7\\x7fW\\xaf\\x80}\\x7f\\xb9}1\\xd8\\xf77\\x17\\xfbO%\\xa2\\x87\\x1c\\x80\\xd8\\xd3\\xf5\\xe8\\xbd\\xfa\\xbe\\xdd\\xb4\\xa8\\xef\\xea\\xebO=\\xbcg\\xc3Q\\x1f\\xef\\x98\\xa5\\xc3\\x12\\x10\\xdez_\\xc8\\x19U\\xb1}[d\\xb3\\xdc\\xef\\xdb\\x85\\x84\\xe9\\x8a\\x8fb\\xe5\\x01D\\xdf\\xab\\xef\\xdb\\xc1\\xdb\\x9a>>\\x90\\xbc\\xdc\\n\\x11\\xc6Q1?\\x10\\xab{a\\x1c\\x9d\\xf6Riv^\\xde\\xaa\\xaf!\\xf6t\\xdf\\xb2v\\x7f\\x1fj\\x8f\\xa9b\\x14D\\xa9\\xf9T\\xea\\xf7\\x9f{U\\'\\xa2>\\x18Dh\\x1f\\xb1\\xdfqI\\xad\\x13\\x9d\\xad\\x0f\\xc4~\\x87\\xf2\\xbf\\xf6G\\xb7\\xca\\xdc?\\xb0\\xae2\\x0c\\xd5\\xd7\\xb7\\xf9\\xfd\\xcd\\x13\\xa2\\xc6\\xc1G(\\x96\\x17\\xa4\\xdag\\xe3k\\xefG\\x0fx\\xab\\xf2\\r\\x88\\xf7\\xaa\\xff&\\xd5\\xafE\\xbf\\xffH\\xf4k\\xa9\\xfdQ\\xa9y\\xae\\xf5\\x8bo\\xe3\\xaf\\xfc\\xfa\\xbd\\x16\\xa2\\xb3\\xf1\\x00\\xca\\xe9\\x88\\xfe\\xcfF\\xc3\\xd4_\\x8b J\\xfd\\xfd\\x81\\xd4x\\xe0l\\xff\\xe0\\xbc\\x88\\x9c\\x9e\\xfe\\xfd\\xc1\\x9f\\xad/v\\xbc\\xb4\\x00k\\x89\\xdb\\xffw\\x88(o#?\\x10\\xcb\\xdb7D\\xf4f\\xbe\\xfcs\\x93\\xdfW\\xe6\\xa1\\x88^9\\xf6\\xa2\\xb7\\x87b\\xfe\\x10\\x88R\\xfboR\\xfbU\\xd3\\xd51\\xaf\\x1b\\x99\\xa6\\x05\\x10\\xa5\\xfa\\x81\\xd8\\xfb\\x1c\\xf4\\x03\\x1bCa\\x1a\\x9c\\xa9%\\\\o\\x1d.\\x9d\\x7f:OW\\xfb\\xec\\xe8\\xef..\\xb7\\xf8w\\x1c7\\x07\\x087\\xbb\\xdevu\\xb9\\xcdA\\x03\\xef\\x98\\xaf\\xc0\\x88\\x13z6\\x85\\xa9\\xedC\\x08w\\n\\x18\\x966\\x10z\\xe6\\x84\\x8buK\\xbe\\x1b\\xe7\\xe6\\x96\\xffD\\xfe\\x93\\xf9\\xbeV\\xbf9*\\x85\\x9f\\xd5O%\\\\\\xf3\\x9f\\xce\\xf7\\xe7\\xfd\\xc7\\xf8s\\x81D~P\\xa3W0C\\xe1\\x1av\\x8a\\x12\\xa7u\\x19Q8\\xc1\\xe0S\\x94\\x18\\xc3fD\\xe3\\xb4z:I\\x9b\\x04\\x8afo\\x8f\\xa2I=\\x1aE\\xe3L\\xd7Q\\x85!\\xc1\\xaa\\xd0\\xb0\\x88\\xe09\\\\H\\x08\\x17\\x12\\xda\\xe8\\x13\\x82\\t\\xe3\\x825\\x9a\\x8c\\x08\\xb3I\\x8d\\xd3S\\xe6\\nO\\x96!\\x08bHb\\xca\\x84\\x0ca.\"*\\x9d\\xb2\\xcf\\xc48\\xc6F\\x90\\xa6\\xee\\xc7\\x96\\x84\\x90\\xc4+\\x9dD\\x88\\x89\\xb2\\x84\\x06GM\\xe3B\\xa3v\\x84\\xe2:\\x03a`\\xf1)\\xc2_n\\x0f\\x0f\\xa6\\xd9\\xdb\\x9c0B\\xdb\\x85\\xb35\\x14\\xd7\\xd3\\xb80\\'\\xc9\\xe4\\x87qa\\x11\\xdc\\xacY\\\\xhc`8Ij;\\x07\\xdf\\xe5Q&\\xddu\\xf5\\xd3\\rD\\xa3\\xc7\\xad\\x7f&2\\x82\\x8b\\x88\\xe0#\"\\x94\\x96\\x88H\\x95\\xb2D\\x98\\xfa\\xe6\\x120Z[|\\x87\\x9cF\\x9f\\xbb\\xaf\\x9fd\\x98)q\\xc2\\x84]\\x94\\xe6+\\xe7\\x01\\xab\\xba\\x0cF\\xd3\\x84\\xe2&>R5\\x83W\\xaa\\x94\\x16\\xe1\\xf4*\\xb9\\x93\\xb3Ki&4\\xec\\\\\\x83\\x16\\xb7O\\x90\\xd1Iu\\xf2\\x14\\xb4&\\xf5\\x0ef\\x18a\\x00\\xcc\\xd2\\xdbd\\x08i2\\xddA\\n\\x8fi\\xe0T\\n\\x8b*22\\x8aS)\\xf9\\xb9q\\xe1\\\\Td\\xe5\\xdd<O\\x90Y)\\xa6\\xcby3\\xb9h\\x05\\x1f\\xad\\x08\\x15\\xce\\x19\\xc2\\x19!\\x9cJ\\xe1\\x9c_rkX\\x18\\xa1\\xeb$:\\xc5\\x86\\x93Z>F\\xa5\\xe0\\x93\\xe6*\\xf31\\x1e{Nc\\xc34\\xc2fexLc\\xb4b\\x1a\\xd2DY1\\xedB\\x8d\\xd1&\\\\M\\xa4\\x96\\xc3L\\x16\\xac\\x13\\t\\x1e#\\xb4\\x05\\x18A\\xb2)8m\\xc5(\\x8ad,\\xf6\\xff\\xbc\\xc0c\\xe6W\\x0b\\x84\\x93\\xc2\\x18\\xc6\\xa2\\xc64\\xa9\\x9c\\x1a\\xb7\\xa9\\r,\\x8b\\xd3\\xbc\\xda\\xcc\\xda\\x84\\x93%\\tN\\x83\\xf1\\x1aL\\x00\\x8dUc\\x17Rh\\xbf\\x90fBk\\xd1\\x08N\\xcckqJ8\\xd9\"\\xadA\\xa73h\\xccF\\x96\\xd3\\x92\\x16-\\xa9~\\xc5&\\xb8\\xac\\x16\\xa7-:\\x9a4\\xf1z\\x9c\\xe5\\xf5$kI\\x11\\x9e\\x84K1\\xe4\\x1b8\\x83\\x8e\\x13t``\\xf8T<\\xdd\\x92J\\x90i\\x16#\\xaecy#\\xc9\\xf2&\\x8c\\xb2\\t\\'\\x85k-&\\x8cN\\xe5L\\xb8\\xc5\\x84\\x13f\\xce\\x94\\xce\\x13\\xb8^8_\\xb5\\x10\\xc2\\xc2xaA\\x85\\x04us\\xb5V\\x821\\xab_)\\xea\\xbc\\xda\\xd7c#\\xcc\\xa6\\xce\\xdb-\\xcbsY\\x9e\\xd4\\xe9x\\x92\\xc0m$\\xc5\\x1aH\\xc2J\\x19\\x85(g\\xa1\\x84\\x87\\x14.\\x0cSh\\xbf\\x18\\xd4F\\xfb-\\x86-\\xb0_\\x04\\x07\\xb3P4NY\\x85\\x8b\\xa0a\\x8af\\xad\\x94\\xdd\\xfeV\\x1a7\\n\\x1a\\xa6q\\xd6L\\x13V\\xda\\xa0Oam\\x8cF\\xd8\\x81\\x04\\xcf\\xe0\\xb8E\\xf0\\xdet\\x0b\\x9b\\x82\\xb1\\xbc\\xa0j\\xab]\\xdd\\xf6\\xab0\\x19\\xc7\\x92V\\x964kR\\xacBl\\xc3\\xb5<K\\x0b\\xe3\\x84)\\xb6\\t\\x93\\x92&\\x1dI\\xb3\\x98 \\x9f3S63\\xa5\\xc5X\\x9c73\\xb8\\xd5\\xcc\\xd8\\x1fc\\xa1\\x01O\\xb3\\xa4a\\x04kIK\\xc1\\t\\xeb\\xabv\\xf5[\\x84U\\x99,\\x1a\\x8ce\\xb2\\x96[uFL\\xcfd\\xbdV\\x9e\\x821If\\xc2\\xaeJ\"\\xe9f\\x1c\\xaf)\\x16\\x90H\\xd2\\xd3\\xa4\\x99b\\xb2j]3\\xff\\x00\\xfd\\x1d{\\xf2'", "year": "2021"}, {"Unnamed: 0": 149818, "autor": "smh_photo", "date": 1631965888000, "content": "Road map or schedule about next gears? /!/ Is there any road map or something like schedule about next gears, camera, lens etc. which is published officially by sony?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pql0um/road_map_or_schedule_about_next_gears/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "road -----> map !!!  or schedule about next gears? /!/ is there any road map or something like schedule about next gears, camera, lens etc. which is published officially by sony?", "sortedWord": "None", "identifyer": 41090, "doc": "b'x\\x9c\\xedW{L\\x14G\\x18\\xbf\\xf3\\xdd\\x1a\\x8dg\\x8c/\\xa4\\xea\\x89\\xd26(\\x0f\\xabmm\\xaf\\x8a\\xe0\\xd1\\xe3qw\\xc2!`)\\xb8\\xb77\\xf7\\x80\\xbb\\xddegO\\xa1B\\x90\\x1a\\x1b\\xda\\xc6\\x16\\xa8\\xa1\\xd1\\x94X\\xf6\\xf6x\\x1dbb\\xd2\\n\\xd2*\\xb5X\\xf5\\x0f[#\\x8a\\x12\\tDK*MQ\\xd2bU\\x0c\\x96.\\xb2cu\\x92\\xadP\\x88\\x7f\\xf5Kv~\\xf7\\xed\\xb77\\xbf\\xf9\\xbe\\x99\\xf9\\xcd\\xee\\x87\\x95\\xdb\\x01\\x0b\\x1d4\\xe5\\tY\\x15\\xea%8\\x8e\\x85e\\xe1\\x11\\xba\\xe8\\x98\\xd88\\xbd\\xc1xN\\xd9|Ny\\xea\\x9c\\xf2\\x87\\n\\x8e\\xce\\x04\\x14<5\\xe3|\\xa2_\\xe0\\xcc\\xaa\\x85\\xdd\\x8d8\\xa6*\\x86\\xedH\\xc0\\x99(\\xdf[Y\\x17\\x13b\\x02\\xd5w\\x8e\\xfb\\x88\\t\\x8a\\'M\\x89!\\xb2\\xe0\\xa6\\x8e\\xfb\\xeaW\\x8e~\\x81\\xfc\\xa5\\xcf\\x1d\\xebI,M]\\x8d#\\xce\\x13{>\\xafWh\\xee\\xca\\xc2y\\x90\\rJ&\\xc7\\xf3M\\xfb\\xeb\\xfbwD\\xff\\xba\\x1a\\xc7\\x14)\\xfe\\xf2\\xca4s\\xf8\\xb2\\xb6\\xbe\\xcf\\xa5\\x01\\xe3<\\x83\\x98=\\xe2\\xa9Z\\xafK\\x8bk[\\x81\\xfc\\x84\\xbe\\xb2\\xcc\\x89\\xcb\\xf7\\x04\\xe0\\x88\\xe7s@\\x86\\xe7/9\\x1e,\\x1fgLQ\\x9e\\xff\\x8d93pL\\x94\\xe2\\x8b\\xadi7\\xc3\\xcc\\xb7T\\x8d\\xa3\\xcc\\xe7\\x0c6a\\xea]\\x9fTm\\xb0~\\x16\\x87\\xa3I\\x8a\\xb7\\xd5Mj.<\\x9dSR\"\\xc3\\x83\\xba\\xc3yl\\x83~\\xfe\\xe5\\x17\\xd4\\x10\\xf9\\xee[\\xf3V\\xd5\\xbc\\xf1\\xb6\\x06a\\x8b*z]\\x98)T\\x87\\xea\\xb63\\xd6\\x7f\\xfe\\xe4\\xcd\\x9d\\xcf\\x1f\\x1de\\xdd\\xa6g\\x97\\xae\\x9drl\\xda\\x02\\xe4k\\xcdI\\xbb\\x9d\\xb03\\x0bGB\\x8a\\xf3\\'kc{\\xda\\xf2\\x0f\\x7f+\\xc3s_\\x86\\'(\\xfe=kzZ\\xe1\\xbb\\xc8\\xbf\\xbb\\xe8\"\\xb3m\\xd6\\x85\\x058\"\\x9e\\xd9\\x85\\x01\\x03\\xbf\\xfci\\xfd\\xf1\\x90\\xc43Q\\xba\\x9f\\xa7|\\xb2n\\xf8\\xfe\\xc1\\xe7gc}\\xcf<\\xcb\\xf6\\xe4`\\x84w:\\xbd/\\xd4\\x86\\xcc-JB<\\x0ffW\\xb7\\'\\xe9\\xbe\\x1b\\xed\\xfeI\\xbd|\\xdb\\xf8N\\xcf\\x1f\\xc9\\x8f\\x1e\\x08Z|CW\\xb6\\xd9\\x1f\\xc7t)\\xdc\\xd0T\\xfc\\xd2\\xe0\\xde\\x95\\x97\\xca\\xc7\\xb8\\xde\\xba\\xaaK\\xae}\\x95\\x9a\\xfd5\\x8e[\\xa5\\xf8\\xfe\\xeb\\x1e\\xbf\\xbc\\xb2k-\\x07ex\\x90\\xff4\\x9e\\xf1\\xd2\\xb7\\xa7\\xed\\xd3\\x91\\xea\\xdb>\\x99|\\x06F\\xa8\\x07\\xcfJ\\xdf\\x82|\\x86M\\x1d\\x96Y\\xbf\\xe3\\x88\\xd6\\xc1\\x7f\\xd5\\xb7\\x15\\x19\\x9d\\x1b\\xe6\\x84.\\xa9A\\xfe\\x07\\x9b.\\x1d\\xf0\\xd3\\xe6\\x0f\\xe08\\xde\\xfa6R\\xbd\\x96\\xd3\\x1d\\xd9\\xba\\xfd\\xaf\\xd7\\xe3\\xa2\\xd7\\rs\\x17~\\xbc\\xf7\\xe6\\xc02\\x1c\\t,.\\xa7\\xd7ru\\xeb\\x9d\\xb8\\xef\\xf0\\xf9\\x99;[\\x90_<9\\xf1\\xfd\\xc8\\xbbo\\xaaq\\x1c\\xefs\\xfbY\\xe5\\x13S\\xa2\\xbar\\xf6\\xc5\\xefg\\xe08\\xde\\xf9\\x14\\xa8\\xae\\xfa\\x8e]Yn\\xc4\\x11H\\xf1=\\xfd~\\xf5\\x07K\\x8f_\\x92\\xe3y \\xc3\\xd3\\xe0\\nU\\x86\\xdc\\x9b\\xd6\\x8e|t.\\xe3\\x88\\xf3\\xc8\\xd5\\xadw\\x84<gc\\xef\\xf1K\\x96M5\\xe3\\x88\\xf4\\xedz\\xca\\xda\\xb8\\xc8\\xf9\\x8d\\xb7\\xea\\xc6x\\xfe\\x8c\\xf4\\xdc.\\x1d\\xe5>\\xc5\\xcf\\xed\\xc0\\xfeE-a\\xa5G\\x13\\x10\\xfe\\xd6qz\\xea\\xd6\\xdb\\xaf\\xce\\xb5H\\xf1\\xb0\\x94\\x12\\xa2\\xafu\\xfa\\x9aOexzd\\xea6y\\xfa\\x899\\xebC\\xfb?B\\xfe\\xa1\\xb4)?\\xf9\\xb3Z\\x03\\x8e[P\\xdd\\x1a\\xbbB\\xb4*\\xdd\\x84\\xa21\\xea\\xdbk\\x05\\xf6\\xa6V\\xa6\\xa2\\x1bG\\\\G\\x8bG\\xb9\\xaeq\\x9eR\\xff\\x8e\\xe4\\x13\\xdd\\xadE8n\\x93\\xe2\\xaau\\x97\\x9b~\\xde\\x1dz\\x15\\xe9\\x1bz\\x7f\\xcbW\\xfe{>\\xf8\\xfe\\x19\\xeb\\xfbh\\xb7\\x0c\\x0f\\xfe>Z\\x01\\x19\\x82\\x04\\xb0Y\\xad|h\\n\\xe5\\xe3\\xa6\\x18\\xf2\\xa5[\\nE\\xa5\\x13P6\\xce\\x0e\\x9b\\'\\xa9\\xc5?VB\\x8euP6\\xd8\\xae\\x88\\xfa\\xb2<\\xa8|\\x95\\'xip\\xf9\\xfa\\xb6\\x80p\\xc8\\x00\\x92\\xd3\\x18\\x01k\\xcd5\\x89\\xdf\\x8c@c$ \\x97\\xbb\\x05\\xb0f-\\xcd\\xbaD\\x8f\\xe5\\xf8\\x88\\x88\\xda\\x08\\x9a\\xca0\\xe50@\\x13\\xe1b\\xf8HSM$\\xb0\\xb1@|\\x98\\x86\\xfc\\xa6d^\\x9b\\xe4\\x13\\x9f\\x06\\x0e\\x1b\\xa5I\\x01\\x90\\xd7\\xe9\\xf9\\xe8\\xe8\\xb65q4m\\xd1\\xe8(K\\xae\\xde\\xed2\\x03V\\x93 \\x0e Wd\\x824\\xa5Y\\x8d\\xd8X\\x00\\xffa\\xd3:(\\x8f^k\\xe4\\xf5z\\x8f^o\\x14\\xaf\\x04Ao\\x887\\xfa\\xa4\\x0e\\x8cN7\\xeb{\\xac\\xb3\\xfa\\':fi\\xea\\xe1\\x08EF\\x8f!>\\xaa\\xce\\xe8\\xa6Hnx\\xcc\\xb4\\xcb\\xf5\\x98+\\x0e\\xc1\\xc1\\xc7o\\x14\\xe2\\r\\x06\\x93g\\xcbF\\xbdxm\\xf5$E\\x9a\\xbc\\x84\\x99vs^\\xc2\\xb2\\x9dtV\\x88\\xad\\x8b\\xb6x\\t\\x1b\\xa08\\x81\\x10\\x7fz\\x08*G\\x18\\xfa\\xe4\\xae$\\xdc\\xd9\\x0c\\x01!o\\x06\\xbc9\\xa7\\x82$\\\\\\x80%x\\x92\\xac\"i\\x17C\\xbb)\\x8b@\\x8a\\xc5\\xf2X\\x00\\xe7\\x01\\x1c)\\x80l\\xc6)\\xd8\\x00\\xc1z\\x87\\x1a\\xc8;\\xa0 \\xce\\x8c\\xd882\\x81\\xc7E0\\x02\\x05\\xb29/\\x05\\xdd\\xe6\\x8c\\xea\\x87\\xedP\\xdf5\\xb4\\xd5\\xea \\x1d\\x84\\xd3\\x99\\xc3\\xd3\\xac\\xc0\\xd0\\xe6\\x0c\\x81a\\x01S\\xc9\\xb8\\xcdN\\x07\\xb4WK\\x08,^f(/\\x81\\xa5\\tK\\x15$\\xc5\\x1bn\\'\\xa8\\x86\\xb4\\x0bpv\\xb1*\\x82X\\xeb\\x1c/g\\x07,\\xf0\\xee\\xb0;H\\xbb@\\x12\\x1c,\\xde\\xe5\\xb5:\\t\\x1b,.8b\\'`\\xba\\x9b\\xca\\xa4\\xe8\\x1dT\\xfa\\xf0\\xda:\\xe9\\x13\\x91J\\xb7\\xb1\\xb4\\x9b\\x81\\xc5\\xcd\\xca\\xa2\\xbf\\x01\\xfe\\xefeO'", "year": "2021"}], "name": "mapSonyAlpha2021"}