{"interestingcomments": [{"Unnamed: 0": 37911, "autor": "barbe99", "date": 1583588613000, "content": "HELP for my attempt to a social media for photographer /!/  \n\ni'm developing, as you read in the title, a kind of new social media for photographer (landscaper mainly)...\n\nthe mainly difference is that for each photo you upload i extract metadata (model, iso, gps and other) so other can reply your result and a maps (with marker) you can navigate to see photos taken near you....\n\nPersonal photo are not allowed... Only nature/landspaces. You use a Nickname not the real name, and of you cant take private photo noone would know Who you are\n\nThe reason i'm creating this (apart form personal satisfaction) is because i always see question like \"where is it? Which machine are you using?\" and stuff like that under photo in other social\n\nWhy i need your help?? i would like to know which feature you would appreciate more...", "link": "https://www.reddit.com/r/SonyAlpha/comments/feva9k/help_for_my_attempt_to_a_social_media_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "help for my attempt to a social media for photographer /!/  \n\ni'm developing, as you read in the title, a kind of new social media for photographer (landscaper mainly)...\n\nthe mainly difference is that for each photo you upload i extract metadata (model, iso, gps and other) so other can reply your result and a -----> maps !!!  (with marker) you can navigate to see photos taken near you....\n\npersonal photo are not allowed... only nature/landspaces. you use a nickname not the real name, and of you cant take private photo noone would know who you are\n\nthe reason i'm creating this (apart form personal satisfaction) is because i always see question like \"where is it? which machine are you using?\" and stuff like that under photo in other social\n\nwhy i need your help?? i would like to know which feature you would appreciate more...", "sortedWord": "None", "identifyer": 38732, "year": "2020"}, {"Unnamed: 0": 41971, "autor": "Heyitsakexx", "date": 1594754072000, "content": "Eye AF not working on Sony A7iii /!/ I’ve had my a7iii since launch. After not shooting for a few months with covid I came back to my camera not being able to use eye AF. I have is custom mapped to multiple buttons that do not work.\n\nIs there a setting I could be missing or a firm ware update? \nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/hr7und/eye_af_not_working_on_sony_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "eye af not working on sony a7iii /!/ i’ve had my a7iii since launch. after not shooting for a few months with covid i came back to my camera not being able to use eye af. i have is custom -----> mapped !!!  to multiple buttons that do not work.\n\nis there a setting i could be missing or a firm ware update? \nthanks", "sortedWord": "None", "identifyer": 42913, "year": "2020"}, {"Unnamed: 0": 47325, "autor": "obviousoctopus", "date": 1580448441000, "content": "Long shutter lag when shooting in continuous AF mode. Am I doing someting wrong? /!/ a7iii with sony 35 f/1.4 and also with adapted canon EF via sigma adapter. \n\nI come from Canon, using 1d3 (old!) and 5d3. I moving subjects in often low-ish light and am used to continuous focus. \n\nWith the a7iii I am experiencing up to half as second (!) shutter lag when I use continuous AF. I have to let go of the af button (mapped to the AF button) if I want an immediate shutter release -- which defies the purpose of using continuous AF. Is there a second I need to adjust for this, as in possibly the camera firing even if imperfectly focused?\n\nWhen I shoot in low light, I usually shoot wide open, at f/1.4 or f/1.2. I know the a7iii tries to obtain focus at the current aperture (unlike canon at max aperture) and that might be problematic in low light. But it shouldn't be an issue in my case. \n\nAny ideas? \n\nThank you!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ewjiml/long_shutter_lag_when_shooting_in_continuous_af/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "long shutter lag when shooting in continuous af mode. am i doing someting wrong? /!/ a7iii with sony 35 f/1.4 and also with adapted canon ef via sigma adapter. \n\ni come from canon, using 1d3 (old!) and 5d3. i moving subjects in often low-ish light and am used to continuous focus. \n\nwith the a7iii i am experiencing up to half as second (!) shutter lag when i use continuous af. i have to let go of the af button (-----> mapped !!!  to the af button) if i want an immediate shutter release -- which defies the purpose of using continuous af. is there a second i need to adjust for this, as in possibly the camera firing even if imperfectly focused?\n\nwhen i shoot in low light, i usually shoot wide open, at f/1.4 or f/1.2. i know the a7iii tries to obtain focus at the current aperture (unlike canon at max aperture) and that might be problematic in low light. but it shouldn't be an issue in my case. \n\nany ideas? \n\nthank you!", "sortedWord": "None", "identifyer": 48453, "year": "2020"}, {"Unnamed: 0": 50393, "autor": "zoro1238", "date": 1596062737000, "content": "a6600 eye AF in video question /!/ I have a a6300 and was thinking of getting a a6600 as an upgrade but I wanted to know if you have to keep holding down a button to have eye AF during video just like how you have to hold it down for photos?\n\nWell, I only know about the a6300 capabilities and for the eye AF in my model I have to map the eye AF to a button and hold it down while pressing the shutter button.\n\nWhen I do video, I use a gimbal and I don't want to keep holding down a button on the camera because that will give me unwanted movement in the video. I was wondering for video if I can just press a button once and press the record button and the a6600 will keep focusing on the eye?", "link": "https://www.reddit.com/r/SonyAlpha/comments/i0ahq7/a6600_eye_af_in_video_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "a6600 eye af in video question /!/ i have a a6300 and was thinking of getting a a6600 as an upgrade but i wanted to know if you have to keep holding down a button to have eye af during video just like how you have to hold it down for photos?\n\nwell, i only know about the a6300 capabilities and for the eye af in my model i have to -----> map !!!  the eye af to a button and hold it down while pressing the shutter button.\n\nwhen i do video, i use a gimbal and i don't want to keep holding down a button on the camera because that will give me unwanted movement in the video. i was wondering for video if i can just press a button once and press the record button and the a6600 will keep focusing on the eye?", "sortedWord": "None", "identifyer": 51638, "year": "2020"}], "name": "mapSonyAlpha2020"}