{"interestingcomments": [{"Unnamed: 0": 2931, "autor": "The_Endless_", "date": 1563459367000, "content": "Is it possible to set a Memory 3 custom preset for video recording? [Sony A7iii] /!/ Hey ladies and gents, on my A7iii I have my custom video modes 1 and 2 on the top dial set for 24fps and 120fps, respectively.  I would like to set a third custom memory preset setting for 60fps situations, but I'm struggling to find a youtube video or article that outlines if this is possible.  I'm assuming it's possible but I can't figure out how to go about it.  \n\nHave any of you done this?  Would you be so kind as to give me some insight on how to do it and finally, once you set it up and save the custom 3 mode, what button or menu path do you have it mapped to so that you can quickly toggle to it and use it?\n\nThank you in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/cet1o3/is_it_possible_to_set_a_memory_3_custom_preset/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "is it possible to set a memory 3 custom preset for video recording? [sony a7iii] /!/ hey ladies and gents, on my a7iii i have my custom video modes 1 and 2 on the top dial set for 24fps and 120fps, respectively.  i would like to set a third custom memory preset setting for 60fps situations, but i'm struggling to find a youtube video or article that outlines if this is possible.  i'm assuming it's possible but i can't figure out how to go about it.  \n\nhave any of you done this?  would you be so kind as to give me some insight on how to do it and finally, once you set it up and save the custom 3 mode, what button or menu path do you have it -----> mapped !!!  to so that you can quickly toggle to it and use it?\n\nthank you in advance!", "sortedWord": "None", "identifyer": 2955, "year": "2019"}, {"Unnamed: 0": 3917, "autor": "burning1rr", "date": 1560274603000, "content": "Thoughts on the 200-600 from a 100-400 owner /!/ Hi folks!\n\nSony dropped the press blackout on the 200-600G. I've got to say that I'm extremely excited. This looks to be almost everything we've wanted in a super-zoom lens.\n\nI've tested most of the 600mm zooms that can be adapted to the A7III, and I own the 70-200GM, the 100-400GM, and the 1.4x TC.\n\nA few major features I've noticed so far:\n\nThe obvious ones:\n\n* We finally have an E-native 600mm zoom\n* It does support the 1.4 and 2x teleconverters.\n* It's a variable aperture zoom, but mild enough to be practically fixed (1/3 stop from 200-600)\n* It hit the $2000 price point (it had to be in this range to be a viable lens.)\n\nSurprising stuff:\n\n* It's internal zooming and focusing. This is unique among 600mm zooms (as far as I know.)\n* It supports mode 3 OSS. This makes OSS more responsive to changes in pan direction. Great for sports and wildlife!\n* It has a 1/4 turn zoom. This is huge! The long 1/2 throw is a major issue on most 600mm zooms.\n* It appears to use the same foot as the 70-200 and 100-400. Great for folks who already have an aftermarket foot.\n\nStuff I would have liked:\n\n* It would have been nice to have a drop in filter, but that's not something I was actually expecting to get.\n\nStuff I don't know and want to know:\n\n* I'd like to know if it supports full-time focus override like the 70-200, or if it needs to be put in manual mode like the 100-400.\n* Weight? (I might have missed it.)\n\nMy thoughts?\n\nI'm going to rent before making a decision. The 100-400 is fine for a full-day of shooting.   My experience with 600mm zooms is that they really limit mobility. And really wear out the shooter.\n\n200-600s usually require special carrying bags. Swapping them off a body sucks, and it's difficult to simply sling them.\n\nThe 1/4 turn zoom ring is a huge usability and ergonomic win. A half turn requires a lot of wrist travel. Racking the zoom is surprisingly difficult with the front hand having to travel so far while supporting the weight of a heavy lens. 1/4 turn is very comfortable, even with a big zoom ring and heavy lens.\n\nThe internal zoom is a huge selling point for me. It eliminates the need for a zoom lock, keeps the lens balanced, and significantly improves weather sealing. Generally, internal zooming lenses have great zoom rings.\n\nA full-time autofocus override would be appreciated. I haven't heard whether or not we'll get that. I have to map a custom manual focus toggle for the 100-400, so that I can pre-focus it. With the 70-200GM I just have to turn the focus ring. I'd really like that. The 400 ƒ2.8 has a full-time override, as does the 600 ƒ4.\n\nI think that this lens is going to be most viable for folks who already have the 70-200GM with the 1.4x teleconverter. It would also pair well with the 70-300. 200mm is kind of limiting on the wide end, and it's good to have a compact option for times when huge reach isn't necessary.\n\nFor folks who don't have a ~200mm zoom, the 100-400 is almost certainly going to be the better option. The 100mm wide-end offers a lot of flexibility for shooting portraiture, concerts, and other stuff that would be problematic at 200mm. The 1.4x offers similar reach to the 200-600, while maintaining good autofocus performance and great sharpness.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bzfk15/thoughts_on_the_200600_from_a_100400_owner/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "thoughts on the 200-600 from a 100-400 owner /!/ hi folks!\n\nsony dropped the press blackout on the 200-600g. i've got to say that i'm extremely excited. this looks to be almost everything we've wanted in a super-zoom lens.\n\ni've tested most of the 600mm zooms that can be adapted to the a7iii, and i own the 70-200gm, the 100-400gm, and the 1.4x tc.\n\na few major features i've noticed so far:\n\nthe obvious ones:\n\n* we finally have an e-native 600mm zoom\n* it does support the 1.4 and 2x teleconverters.\n* it's a variable aperture zoom, but mild enough to be practically fixed (1/3 stop from 200-600)\n* it hit the $2000 price point (it had to be in this range to be a viable lens.)\n\nsurprising stuff:\n\n* it's internal zooming and focusing. this is unique among 600mm zooms (as far as i know.)\n* it supports mode 3 oss. this makes oss more responsive to changes in pan direction. great for sports and wildlife!\n* it has a 1/4 turn zoom. this is huge! the long 1/2 throw is a major issue on most 600mm zooms.\n* it appears to use the same foot as the 70-200 and 100-400. great for folks who already have an aftermarket foot.\n\nstuff i would have liked:\n\n* it would have been nice to have a drop in filter, but that's not something i was actually expecting to get.\n\nstuff i don't know and want to know:\n\n* i'd like to know if it supports full-time focus override like the 70-200, or if it needs to be put in manual mode like the 100-400.\n* weight? (i might have missed it.)\n\nmy thoughts?\n\ni'm going to rent before making a decision. the 100-400 is fine for a full-day of shooting.   my experience with 600mm zooms is that they really limit mobility. and really wear out the shooter.\n\n200-600s usually require special carrying bags. swapping them off a body sucks, and it's difficult to simply sling them.\n\nthe 1/4 turn zoom ring is a huge usability and ergonomic win. a half turn requires a lot of wrist travel. racking the zoom is surprisingly difficult with the front hand having to travel so far while supporting the weight of a heavy lens. 1/4 turn is very comfortable, even with a big zoom ring and heavy lens.\n\nthe internal zoom is a huge selling point for me. it eliminates the need for a zoom lock, keeps the lens balanced, and significantly improves weather sealing. generally, internal zooming lenses have great zoom rings.\n\na full-time autofocus override would be appreciated. i haven't heard whether or not we'll get that. i have to -----> map !!!  a custom manual focus toggle for the 100-400, so that i can pre-focus it. with the 70-200gm i just have to turn the focus ring. i'd really like that. the 400 ƒ2.8 has a full-time override, as does the 600 ƒ4.\n\ni think that this lens is going to be most viable for folks who already have the 70-200gm with the 1.4x teleconverter. it would also pair well with the 70-300. 200mm is kind of limiting on the wide end, and it's good to have a compact option for times when huge reach isn't necessary.\n\nfor folks who don't have a ~200mm zoom, the 100-400 is almost certainly going to be the better option. the 100mm wide-end offers a lot of flexibility for shooting portraiture, concerts, and other stuff that would be problematic at 200mm. the 1.4x offers similar reach to the 200-600, while maintaining good autofocus performance and great sharpness.", "sortedWord": "None", "identifyer": 3954, "year": "2019"}, {"Unnamed: 0": 5322, "autor": "beatsnbanjos", "date": 1564116971000, "content": "Learn from my Mistakes. /!/ I love the customizability of my a7iii. It’s amazing how I can map tons of functions to different buttons! \n\nNow I shoot a lot of events, most of which I shoot on .JPEG, and use the APS-C crop regularly for a little more reach out of my 24-70 G-Master. So I had APS-C mapped to custom button 2 on top. It’s hella handy for event stuff! \n\nBut I also do a lot of Portrait work, all in RAW, all full frame. But on a few different occasions, I’ve accidentally shot whole portrait shoots on Crop Mode.... which sucks. I mean, 10mp is fine for Instagram and such, but it limits you hardcore in the cropping department. So I just unmapped it from there, so I don’t accidentally leave it in crop mode again... learn from my mistakes!", "link": "https://www.reddit.com/r/SonyAlpha/comments/chyiiw/learn_from_my_mistakes/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "learn from my mistakes. /!/ i love the customizability of my a7iii. it’s amazing how i can -----> map !!!  tons of functions to different buttons! \n\nnow i shoot a lot of events, most of which i shoot on .jpeg, and use the aps-c crop regularly for a little more reach out of my 24-70 g-master. so i had aps-c mapped to custom button 2 on top. it’s hella handy for event stuff! \n\nbut i also do a lot of portrait work, all in raw, all full frame. but on a few different occasions, i’ve accidentally shot whole portrait shoots on crop mode.... which sucks. i mean, 10mp is fine for instagram and such, but it limits you hardcore in the cropping department. so i just unmapped it from there, so i don’t accidentally leave it in crop mode again... learn from my mistakes!", "sortedWord": "None", "identifyer": 5379, "year": "2019"}, {"Unnamed: 0": 6105, "autor": "maywashere", "date": 1571944794000, "content": "Subway Map - Sony a6300, 16-50mm lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/dml8oo/subway_map_sony_a6300_1650mm_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "subway -----> map !!!  - sony a6300, 16-50mm lens", "sortedWord": "None", "identifyer": 6171, "year": "2019"}, {"Unnamed: 0": 14931, "autor": "LumpySangsu", "date": 1557616315000, "content": "My first try with photoshop. It's like playing a game. With attempts of Frequency separation skin softening, double curve dodge and burn, usm sharpening, gradient map, a7 iii, 85 gm", "link": "https://www.reddit.com/r/SonyAlpha/comments/bniblt/my_first_try_with_photoshop_its_like_playing_a/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "my first try with photoshop. it's like playing a game. with attempts of frequency separation skin softening, double curve dodge and burn, usm sharpening, gradient -----> map !!! , a7 iii, 85 gm", "sortedWord": "None", "identifyer": 15158, "year": "2019"}, {"Unnamed: 0": 17882, "autor": "burning1rr", "date": 1564290703000, "content": "Casual competition seed for the 4th week of July /!/ Welcome to the 4th week of July everyone. Hope you're staying cool, and/or enjoying the weather.\n\nQuick heads-up: Next week I'm going to move us back to open seeds for a mild change of pace. I'm enjoying escape, but variety is good. :)\n\n[New seed for this week:](https://alttpr.com/en/h/ZeM4PYKLMj)\n\n* Logic: no-glitches-30\n* ROM build: 2018-10-18\n* Difficulty: normal\n* Variation: none\n* State: standard\n* Swords: randomized\n* Goal: ganon\n* Permalink: https://alttpr.com/en/h/ZeM4PYKLMj\n* Created: less than a minute ago\n* Code: Map, Boots, Hammer, Net, Ice Rod\n\n\n[Results for last week:](/r/alttpr/comments/cfwqtm/casual_competition_seed_for_the_4th_week_of_july/)\n\n* /u/anongogogo: **1:32:20**  *134/216*\n* /u/fataIist: **1:32:53**  *139/216*\n* /u/Mercuric_Wanderer: **1:42:37**  *154/216*\n* /u/coolpapa2282: **1:43:15**  *154/216*\n* /u/mushr00m_man: **1:44:12**  *159/216*\n* /u/theturtlewagon: **1:45:20**  *154/216*\n* /u/noveltine1: **1:45:51**  *152/216*\n* /u/compiling: **1:45:55**  *153/216*\n* /u/SpamMusubi11: **1:49:37**  *147/216*\n* /u/bressinghamvoigt: **1:51:38**  *157/216*\n* /u/Karningul: **1:55:11**  *147/216*\n* /u/drzalost42: **1:58:36**  *160/216*\n* /u/Mikael_Johansson: **2:00:14**  *153/216*\n* /u/Blackwax143: **2:00:15**  *158/216*\n* /u/MystressBree: **2:01:13**  *140/216*\n* /u/Zeitnix: **2:03:13**  *153/216*\n* /u/agwrts2010: **2:03:44**  *169/216*\n* /u/savannahgooner: **2:04:29** \n* /u/bsj72380: **2:06:15**  *157/216*\n* /u/RedGyarados2010: **2:10:16**  *162/216*\n* /u/ShiningDrill: **2:11:41**  *164/216*\n* /u/TheJerzeyDragon: **2:16:47**  *167/216*\n* /u/Fourthwoll: **2:21:20** \n* /u/UragGroShub: **2:21:26**  *171/216*\n* /u/Rhapsody_in_Peace: **2:33:25**  *156/216*\n* /u/Beyahs: **3:45:15**  *164/216*\n\n26 results were submitted.\nThe median time was 2:00:15.\nThe median collection rate was 156/216.\n\nCongrats to /u/anongogogo for taking the top spot with a result of 1:32:20, and lowest CR of 134/216. That was a close result on a difficult seed. :)\n\n[anongogogo's comments:](/r/alttpr/comments/cfwqtm/casual_competition_seed_for_the_4th_week_of_july/euejxku/)\n\n&gt; &gt;!1:32:20 134/216!&lt;\n&gt; \n&gt; &gt;!Feels like a jet seed with the hints being quite useful. Only double dip EP. Didn't even touch SW or TT!&lt;\n\nAs always, the rules:\n\n* Timing is based on the in-game timer, not real time\n* All \"thinking\" time should be done in-game on the clock\n* Reset using save quit to preserve in-game timing\n* Halting the game (turning off the clock) to do real life stuff is fine\n* Fast-forwarding is fine\n* Rewind and slow motion aren't allowed\n* Save states can be used to halt/continue the game, but not as a way to revert mistakes\n* [Major Glitches](https://pastebin.com/bb0vHjcm) are not permitted. [Minor glitches](https://docs.google.com/document/d/1cio22fU4_cEsMcHN0I1KceUzB5P1aFgB7dOBrZuwRHU/edit) are allowed and encouraged\n* At the end of the run, put your total time and comments\n* Feel free to submit disqualified times; simply note that the time was DQ and mention why", "link": "https://www.reddit.com/r/SonyAlpha/comments/cirypn/casual_competition_seed_for_the_4th_week_of_july/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "casual competition seed for the 4th week of july /!/ welcome to the 4th week of july everyone. hope you're staying cool, and/or enjoying the weather.\n\nquick heads-up: next week i'm going to move us back to open seeds for a mild change of pace. i'm enjoying escape, but variety is good. :)\n\n[new seed for this week:](https://alttpr.com/en/h/zem4pyklmj)\n\n* logic: no-glitches-30\n* rom build: 2018-10-18\n* difficulty: normal\n* variation: none\n* state: standard\n* swords: randomized\n* goal: ganon\n* permalink: https://alttpr.com/en/h/zem4pyklmj\n* created: less than a minute ago\n* code: -----> map !!! , boots, hammer, net, ice rod\n\n\n[results for last week:](/r/alttpr/comments/cfwqtm/casual_competition_seed_for_the_4th_week_of_july/)\n\n* /u/anongogogo: **1:32:20**  *134/216*\n* /u/fataiist: **1:32:53**  *139/216*\n* /u/mercuric_wanderer: **1:42:37**  *154/216*\n* /u/coolpapa2282: **1:43:15**  *154/216*\n* /u/mushr00m_man: **1:44:12**  *159/216*\n* /u/theturtlewagon: **1:45:20**  *154/216*\n* /u/noveltine1: **1:45:51**  *152/216*\n* /u/compiling: **1:45:55**  *153/216*\n* /u/spammusubi11: **1:49:37**  *147/216*\n* /u/bressinghamvoigt: **1:51:38**  *157/216*\n* /u/karningul: **1:55:11**  *147/216*\n* /u/drzalost42: **1:58:36**  *160/216*\n* /u/mikael_johansson: **2:00:14**  *153/216*\n* /u/blackwax143: **2:00:15**  *158/216*\n* /u/mystressbree: **2:01:13**  *140/216*\n* /u/zeitnix: **2:03:13**  *153/216*\n* /u/agwrts2010: **2:03:44**  *169/216*\n* /u/savannahgooner: **2:04:29** \n* /u/bsj72380: **2:06:15**  *157/216*\n* /u/redgyarados2010: **2:10:16**  *162/216*\n* /u/shiningdrill: **2:11:41**  *164/216*\n* /u/thejerzeydragon: **2:16:47**  *167/216*\n* /u/fourthwoll: **2:21:20** \n* /u/uraggroshub: **2:21:26**  *171/216*\n* /u/rhapsody_in_peace: **2:33:25**  *156/216*\n* /u/beyahs: **3:45:15**  *164/216*\n\n26 results were submitted.\nthe median time was 2:00:15.\nthe median collection rate was 156/216.\n\ncongrats to /u/anongogogo for taking the top spot with a result of 1:32:20, and lowest cr of 134/216. that was a close result on a difficult seed. :)\n\n[anongogogo's comments:](/r/alttpr/comments/cfwqtm/casual_competition_seed_for_the_4th_week_of_july/euejxku/)\n\n&gt; &gt;!1:32:20 134/216!&lt;\n&gt; \n&gt; &gt;!feels like a jet seed with the hints being quite useful. only double dip ep. didn't even touch sw or tt!&lt;\n\nas always, the rules:\n\n* timing is based on the in-game timer, not real time\n* all \"thinking\" time should be done in-game on the clock\n* reset using save quit to preserve in-game timing\n* halting the game (turning off the clock) to do real life stuff is fine\n* fast-forwarding is fine\n* rewind and slow motion aren't allowed\n* save states can be used to halt/continue the game, but not as a way to revert mistakes\n* [major glitches](https://pastebin.com/bb0vhjcm) are not permitted. [minor glitches](https://docs.google.com/document/d/1cio22fu4_cesmchn0i1kceuzb5p1afgb7dobrzuwrhu/edit) are allowed and encouraged\n* at the end of the run, put your total time and comments\n* feel free to submit disqualified times; simply note that the time was dq and mention why", "sortedWord": "None", "identifyer": 18168, "year": "2019"}, {"Unnamed: 0": 20423, "autor": "KosherAthiest", "date": 1569270933000, "content": "Is there a way to map a button to switch between EVF and Display on the A7Rii? /!/ I've been using an A7Rii for about 2 months now after converting from Canon, and while it's been great otherwise the proximity sensor has been causing me a ton of pain. \n\nWhen I shoot video, it will randomly switch from back screen to EVF leaving me shooting blind until it switches back. When I'm shooting photos, It will randomly switch as well when I tilt the camera to review photos. I know there is a menu setting to make it specifically stay on display or EVF, but this doesn't work so much where I need to review and show clients photos, or need the screen for video. \n\nIs there a way to map a menu button to switch between back screen and EVF, or is there a way to set the camera so that shooting photo is always through the EVF and reviewing media is always on the back screen?\n\nThanks in advance for the help!", "link": "https://www.reddit.com/r/SonyAlpha/comments/d8chrt/is_there_a_way_to_map_a_button_to_switch_between/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "is there a way to -----> map !!!  a button to switch between evf and display on the a7rii? /!/ i've been using an a7rii for about 2 months now after converting from canon, and while it's been great otherwise the proximity sensor has been causing me a ton of pain. \n\nwhen i shoot video, it will randomly switch from back screen to evf leaving me shooting blind until it switches back. when i'm shooting photos, it will randomly switch as well when i tilt the camera to review photos. i know there is a menu setting to make it specifically stay on display or evf, but this doesn't work so much where i need to review and show clients photos, or need the screen for video. \n\nis there a way to map a menu button to switch between back screen and evf, or is there a way to set the camera so that shooting photo is always through the evf and reviewing media is always on the back screen?\n\nthanks in advance for the help!", "sortedWord": "None", "identifyer": 20753, "year": "2019"}, {"Unnamed: 0": 21175, "autor": "PlatinumAero", "date": 1566164115000, "content": "I used to run a company that sold aviation maps on womens clothing. A7III 24—105 f/4 G, Jones Beach State Park, Wantagh, New York", "link": "https://www.reddit.com/r/SonyAlpha/comments/cs7guk/i_used_to_run_a_company_that_sold_aviation_maps/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i used to run a company that sold aviation -----> maps !!!  on womens clothing. a7iii 24—105 f/4 g, jones beach state park, wantagh, new york", "sortedWord": "None", "identifyer": 21522, "year": "2019"}], "name": "mapSonyAlpha2019"}