{"interestingcomments": [{"Unnamed: 0": 133984, "autor": "TinyTurboAbarth", "date": 1617301710000, "content": "polarized sunglasses and the A73 LCD screen /!/ Hey all.  Does anyone know of a solution to be able to use my sunglasses and still be able to see the LCD display?  I don't take many photos in portrait orientation.  :P\n\n&amp;#x200B;\n\nI remember seeing that there's a certain screen protector that I can use on the camera's LCD but I can't seem to find it.", "link": "https://www.reddit.com/r/SonyAlpha/comments/mi1oti/polarized_sunglasses_and_the_a73_lcd_screen/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "polarized sunglasses and the a73 lcd screen /!/ hey all.  does anyone know of a solution to be able to use my sunglasses and still be able to see the lcd display?  i don't take many photos in portrait -----> orientation !!! .  :p\n\n&amp;#x200b;\n\ni remember seeing that there's a certain screen protector that i can use on the camera's lcd but i can't seem to find it.", "sortedWord": "None", "identifyer": 24715, "year": "2021"}, {"Unnamed: 0": 134693, "autor": "PramodRamnath", "date": 1630378282000, "content": "Nodal point for portrait orientation without L bracket /!/ Hi guys. Sort of new to landscape photography over here. I have an A7c with a Peak Design Capture Clip. I also have a camera case that is made of leather and looks the part. Somehow camera cages just don't seem to have the same appeal to me. I like my silver two-tone camera body with a patina leather case just fine. What I don't want to do is get an L cage. Just a personal preference. \n\nKeeping that aside, I just bought a cheap $20 Neewer nodal slide. I'm certain I can find the nodal point for cleaner panos in landscape orientation. But will I be able to \"tilt\" my camera by 90 degrees on my ball head in portrait orientation, and pan left to right, at that pre-ascertained nodal point? Somehow the axis of orientation, at least to me, seems the same. So I believe it should be fine. As I see it no different than using an L bracket and loading the camera on portrait orientation on a level ball head. \n\nOf course I will be trying it first hand this week. But wanted to see if anyone can help guide me through this if I have it conceptually wrong. Thanks much. Minor gripe of course. But essentially I'd love to just leave my leather case the way it is. And not have to worry about switching cases.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pex97o/nodal_point_for_portrait_orientation_without_l/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "nodal point for portrait -----> orientation !!!  without l bracket /!/ hi guys. sort of new to landscape photography over here. i have an a7c with a peak design capture clip. i also have a camera case that is made of leather and looks the part. somehow camera cages just don't seem to have the same appeal to me. i like my silver two-tone camera body with a patina leather case just fine. what i don't want to do is get an l cage. just a personal preference. \n\nkeeping that aside, i just bought a cheap $20 neewer nodal slide. i'm certain i can find the nodal point for cleaner panos in landscape orientation. but will i be able to \"tilt\" my camera by 90 degrees on my ball head in portrait orientation, and pan left to right, at that pre-ascertained nodal point? somehow the axis of orientation, at least to me, seems the same. so i believe it should be fine. as i see it no different than using an l bracket and loading the camera on portrait orientation on a level ball head. \n\nof course i will be trying it first hand this week. but wanted to see if anyone can help guide me through this if i have it conceptually wrong. thanks much. minor gripe of course. but essentially i'd love to just leave my leather case the way it is. and not have to worry about switching cases.", "sortedWord": "None", "identifyer": 25441, "year": "2021"}, {"Unnamed: 0": 135760, "autor": "robdeguzman", "date": 1621179913000, "content": "A7C + 20mm G Lens LCD Display Issue /!/ Hi, I was wondering if anyone who has this same setup has this issue as well. While set to record video in 24p, I recently noticed that when I have the lcd screen flipped out and facing forward in selfie mode and power the camera on, the image on the lcd flips back to a non-mirrored orientation. So for example, when I move my head to the left, the image on the screen has my head moving to the right. I have to manually flip the screen up / down or back / forth for it re-orient itself back into the proper mirrored display. This only happens in 24p and not other frame rates or photo modes. Sometimes it doesn’t happen on first power on but it happens every time I power on / off after that. \n\nIt’s not a major thing but when I have the camera setup and it goes to sleep, I have to re-flip the lcd when I power on and use it again which I don’t have to do on any other camera I own. \n\nThis issue resolves itself when I use any other setting than 24p or if I change the lens to my other 50mm 1.8 Sony lens. \n\nI called Sony and they want me to send the camera and lens in to review and possibly repair because it’s not a normal function of the camera. Before I do that I was wondering if it was just a bug or something that other people can re-create. If so, then I don’t want to send it in and be without my camera and lens for 2 weeks or more. \n\nCan anyone out there who has this same setup re-create this? Thanks for your time. \n\nI can provide a link to a video for those who want to see what I’m talking about.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ndr2ze/a7c_20mm_g_lens_lcd_display_issue/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a7c + 20mm g lens lcd display issue /!/ hi, i was wondering if anyone who has this same setup has this issue as well. while set to record video in 24p, i recently noticed that when i have the lcd screen flipped out and facing forward in selfie mode and power the camera on, the image on the lcd flips back to a non-mirrored -----> orientation !!! . so for example, when i move my head to the left, the image on the screen has my head moving to the right. i have to manually flip the screen up / down or back / forth for it re-orient itself back into the proper mirrored display. this only happens in 24p and not other frame rates or photo modes. sometimes it doesn’t happen on first power on but it happens every time i power on / off after that. \n\nit’s not a major thing but when i have the camera setup and it goes to sleep, i have to re-flip the lcd when i power on and use it again which i don’t have to do on any other camera i own. \n\nthis issue resolves itself when i use any other setting than 24p or if i change the lens to my other 50mm 1.8 sony lens. \n\ni called sony and they want me to send the camera and lens in to review and possibly repair because it’s not a normal function of the camera. before i do that i was wondering if it was just a bug or something that other people can re-create. if so, then i don’t want to send it in and be without my camera and lens for 2 weeks or more. \n\ncan anyone out there who has this same setup re-create this? thanks for your time. \n\ni can provide a link to a video for those who want to see what i’m talking about.", "sortedWord": "None", "identifyer": 26534, "year": "2021"}, {"Unnamed: 0": 137639, "autor": "8stringLTD", "date": 1635538834000, "content": "A6600 how do I rotate orientation? /!/ Hey guys, I need some help! I’m trying to do a top down video but is there a way to flip the orientation 180 so that the camera can still be on a tripod in front of me but The image can look like the camera is using my POV? Thanks I’m advance I’ve looked everywhere and can’t figure this out.\n\nCheers!", "link": "https://www.reddit.com/r/SonyAlpha/comments/qilhyp/a6600_how_do_i_rotate_orientation/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a6600 how do i rotate -----> orientation !!! ? /!/ hey guys, i need some help! i’m trying to do a top down video but is there a way to flip the orientation 180 so that the camera can still be on a tripod in front of me but the image can look like the camera is using my pov? thanks i’m advance i’ve looked everywhere and can’t figure this out.\n\ncheers!", "sortedWord": "None", "identifyer": 28478, "year": "2021"}, {"Unnamed: 0": 139312, "autor": "JustLo619", "date": 1627440352000, "content": "Please help me with portrait mode on an a7iii. /!/ Question about shooting in portrait mode. I do car photography for the most part, and I’ve been shooting in landscape mode 99% of the time since I got my first digital camera a couple years ago. I mainly just post on Instagram and I just recently realized how much of the image I’m giving up by posting pics in landscape orientation. I need to be cropping at 4:5 to get the best out of Instagram. \n\nI’m having a real hard time composing shots using the lcd screen when the camera is tilted on its side. It’s ok until I’m going for low angle shots. But it’s really hard to see the lcd screen to confirm if it’s in focus etc, especially in bright sunlight. I’ve got a bad back so constantly crouching, or getting on a knee to get low is a no-go for me. \n\nDo you guys have any pointers to make it easier? Should I use the touch screen to focus on these low angle shots and hope for the best? I’m so close to returning my a7iii to pick up an a7c just because of the flip screen, but I really don’t want to go that route. Please help! And thank you!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ot15qp/please_help_me_with_portrait_mode_on_an_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "please help me with portrait mode on an a7iii. /!/ question about shooting in portrait mode. i do car photography for the most part, and i’ve been shooting in landscape mode 99% of the time since i got my first digital camera a couple years ago. i mainly just post on instagram and i just recently realized how much of the image i’m giving up by posting pics in landscape -----> orientation !!! . i need to be cropping at 4:5 to get the best out of instagram. \n\ni’m having a real hard time composing shots using the lcd screen when the camera is tilted on its side. it’s ok until i’m going for low angle shots. but it’s really hard to see the lcd screen to confirm if it’s in focus etc, especially in bright sunlight. i’ve got a bad back so constantly crouching, or getting on a knee to get low is a no-go for me. \n\ndo you guys have any pointers to make it easier? should i use the touch screen to focus on these low angle shots and hope for the best? i’m so close to returning my a7iii to pick up an a7c just because of the flip screen, but i really don’t want to go that route. please help! and thank you!", "sortedWord": "None", "identifyer": 30207, "year": "2021"}, {"Unnamed: 0": 142892, "autor": "Miesseek_n_destroy", "date": 1631540467000, "content": "metabones smart iv w/ non-is ef 70-200 2.8L issues /!/ I just got both of these to expand my AF kit, otherwise shoot with adapted FDs. AF is a little funky, so i updated firmware. performance is not good on my a7s2, but i understand that's just the case. a7r2 needs coercion, but works pretty darn well together. \n\nI am, however, getting these super weird glitches every so often. Curious if anyone else has had them. Haven't been able to correlate with a specific FL or setting just yet. This occurred at different shutter speeds and apertures and both landscape vs portrait orientation. I haven't shot as much since i switched to EFCS, but the problem has been lesser since i did. \n\nI'm going to try to clean the contacts between the adapter and lens. My other AF lens works without issue\n\nhas anyone else experienced this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pnfo7x/metabones_smart_iv_w_nonis_ef_70200_28l_issues/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "metabones smart iv w/ non-is ef 70-200 2.8l issues /!/ i just got both of these to expand my af kit, otherwise shoot with adapted fds. af is a little funky, so i updated firmware. performance is not good on my a7s2, but i understand that's just the case. a7r2 needs coercion, but works pretty darn well together. \n\ni am, however, getting these super weird glitches every so often. curious if anyone else has had them. haven't been able to correlate with a specific fl or setting just yet. this occurred at different shutter speeds and apertures and both landscape vs portrait -----> orientation !!! . i haven't shot as much since i switched to efcs, but the problem has been lesser since i did. \n\ni'm going to try to clean the contacts between the adapter and lens. my other af lens works without issue\n\nhas anyone else experienced this?", "sortedWord": "None", "identifyer": 33909, "year": "2021"}, {"Unnamed: 0": 143468, "autor": "nifiction", "date": 1623022368000, "content": "Milkyway above Joshua Tree - Sony A7rIV FE 16-35mm f/2.8 GM /!/ I shot this a while back in Joshua Tree. I actually shot two portrait-orientation images and stitched them together in post (turns out that's quite a beast to do if you want it to look good ;-)). \n\nThanks for your feedback - this is what I shoot for pleasure instead of work.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ntyocw/milkyway_above_joshua_tree_sony_a7riv_fe_1635mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "milkyway above joshua tree - sony a7riv fe 16-35mm f/2.8 gm /!/ i shot this a while back in joshua tree. i actually shot two portrait------> orientation !!!  images and stitched them together in post (turns out that's quite a beast to do if you want it to look good ;-)). \n\nthanks for your feedback - this is what i shoot for pleasure instead of work.", "sortedWord": "None", "identifyer": 34502, "year": "2021"}, {"Unnamed: 0": 144207, "autor": "mnamna-mnamna", "date": 1621309877000, "content": "A6000 screen going blank? /!/ New to this camera, but have noticed the screen going blank suddenly when in use. Def not timing out, as it can happen if I change the cameras orientation suddenly or if I tilt the screen to a dift angle. Any experience with this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/nf0g3m/a6000_screen_going_blank/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a6000 screen going blank? /!/ new to this camera, but have noticed the screen going blank suddenly when in use. def not timing out, as it can happen if i change the cameras -----> orientation !!!  suddenly or if i tilt the screen to a dift angle. any experience with this?", "sortedWord": "None", "identifyer": 35260, "year": "2021"}, {"Unnamed: 0": 148108, "autor": "kaitlyn2004", "date": 1635290327000, "content": "How do you choose between a6600 and a7c? /!/ Context: Previous shot all canon, last was Canon 5D Mark IV with all L-quality glass. Did a bunch of commercial work but that slowly transitioned to more casual/hobby photography. Sold my 5D+lenses earlier this year. It was expensive, big, and heavy, to bring along on my outdoor adventures. I now want to get a new camera to bring along with me (trail running, hiking/backpacking, backcountry skiing, etc.) and ideally both weight and size wouldn't be too much.\n\nThe a6600 plus the brand new sigma 18-50 sounds like the perfect setup, maybe bringing along a small wide angle prime for those times I want wider. And then a telephoto which I might only bring sometimes if I expect to use it. I guess the biggest concern is just the relatively ancient APS-C technology with software enhancements but same sensor, etc.? Plus having shot full frame for sooo long, I definitely worry about being disappointed by crop.\n\nSo then there is the a7c - full frame if I want to/need to stick some really quality glass on there. Similar size/weight to the a6600. Really like the tilting screen as a lot of shots will be portrait orientation, and won't always be able to use viewfinder. BUT the viewfinder is... so sub-par. :(. Plus, yeah the camera is smaller but full frame glass is still bigger + heavier - so the whole setup is a bigger step up.\n\nBoth seem to offer leading AF tracking for both humans and animals, which is becoming increasingly important to me.\n\nAre there any real differences between their overall build quality/weather sealing/etc.?\n\nHow would you pick between the two, ASSUMING price was the same? I guess the A7 IV isn't totally out of possibilities either, but from starting off looking at the a6400, the a7 IV is already 50%+ heavier for just the body.", "link": "https://www.reddit.com/r/SonyAlpha/comments/qgiyue/how_do_you_choose_between_a6600_and_a7c/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "how do you choose between a6600 and a7c? /!/ context: previous shot all canon, last was canon 5d mark iv with all l-quality glass. did a bunch of commercial work but that slowly transitioned to more casual/hobby photography. sold my 5d+lenses earlier this year. it was expensive, big, and heavy, to bring along on my outdoor adventures. i now want to get a new camera to bring along with me (trail running, hiking/backpacking, backcountry skiing, etc.) and ideally both weight and size wouldn't be too much.\n\nthe a6600 plus the brand new sigma 18-50 sounds like the perfect setup, maybe bringing along a small wide angle prime for those times i want wider. and then a telephoto which i might only bring sometimes if i expect to use it. i guess the biggest concern is just the relatively ancient aps-c technology with software enhancements but same sensor, etc.? plus having shot full frame for sooo long, i definitely worry about being disappointed by crop.\n\nso then there is the a7c - full frame if i want to/need to stick some really quality glass on there. similar size/weight to the a6600. really like the tilting screen as a lot of shots will be portrait -----> orientation !!! , and won't always be able to use viewfinder. but the viewfinder is... so sub-par. :(. plus, yeah the camera is smaller but full frame glass is still bigger + heavier - so the whole setup is a bigger step up.\n\nboth seem to offer leading af tracking for both humans and animals, which is becoming increasingly important to me.\n\nare there any real differences between their overall build quality/weather sealing/etc.?\n\nhow would you pick between the two, assuming price was the same? i guess the a7 iv isn't totally out of possibilities either, but from starting off looking at the a6400, the a7 iv is already 50%+ heavier for just the body.", "sortedWord": "None", "identifyer": 39315, "year": "2021"}, {"Unnamed: 0": 151906, "autor": "artyrocktheparty", "date": 1633377130000, "content": "Recommendations for L Bracket/Smallrig for A7R series? /!/ I’ve been needing to get an L bracket or small rig for my A7RIV. I mainly need it for portrait orientation on the tripod, rather than mounting items. Any recommendations for a good make and model that won’t block ports?", "link": "https://www.reddit.com/r/SonyAlpha/comments/q1dibw/recommendations_for_l_bracketsmallrig_for_a7r/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "recommendations for l bracket/smallrig for a7r series? /!/ i’ve been needing to get an l bracket or small rig for my a7riv. i mainly need it for portrait -----> orientation !!!  on the tripod, rather than mounting items. any recommendations for a good make and model that won’t block ports?", "sortedWord": "None", "identifyer": 43259, "year": "2021"}], "name": "orientationSonyAlpha2021"}