{"interestingcomments": [{"Unnamed: 0": 235357, "autor": "Wintershrike", "date": 1522016802000, "content": "Experimenting with panorama mode to cheat wider lens effect /!/ Still pretty new to photography and the a6000, but I've recently been messing around a lot with the panoramic mode as I'm traveling with just the kit lens and trying to get as much out of it as I can. Doing panoramas vertically can let you photograph tall structures up close pretty effectively like so [One](https://flic.kr/p/22GM74G) [Two] (https://flic.kr/p/22GM23j) or switching the width to standard, and then the orientation to portrait can open things up a bit better like this [Three](https://flic.kr/p/FNzHJV)\n\nThe only problem is lens flare can get repeated across the images which I've had to edit out in some, and it can take a bit of practice to do smoothly. Having loads of fun with it though. If I was after a lens to get this kind of effect natively, what size would I need, and would I probably need to move to full frame?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8749rg/experimenting_with_panorama_mode_to_cheat_wider/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "experimenting with panorama mode to cheat wider lens effect /!/ still pretty new to photography and the a6000, but i've recently been messing around a lot with the panoramic mode as i'm traveling with just the kit lens and trying to get as much out of it as i can. doing panoramas vertically can let you photograph tall structures up close pretty effectively like so [one](https://flic.kr/p/22gm74g) [two] (https://flic.kr/p/22gm23j) or switching the width to standard, and then the -----> orientation !!!  to portrait can open things up a bit better like this [three](https://flic.kr/p/fnzhjv)\n\nthe only problem is lens flare can get repeated across the images which i've had to edit out in some, and it can take a bit of practice to do smoothly. having loads of fun with it though. if i was after a lens to get this kind of effect natively, what size would i need, and would i probably need to move to full frame?", "sortedWord": "None", "identifyer": 30424, "year": "2018"}, {"Unnamed: 0": 235907, "autor": "MeteoraGB", "date": 1538073896000, "content": "A7II EVF sensitivity /!/ Just received my A7II not too long ago and am loving it.\n\nBut I notice that the EVF is super sensitive - hanging the camera around my shoulder or neck never seems to auto shut off/hibernation when setting it to a minute. I've tried over the shoulder with the camera facing behind me, in front of me and hanging it around my neck but so far I haven't had much luck in reliably getting the camera to shut off.\n\nAnyone know a workaround or orientation to have the camera set to?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9jfj07/a7ii_evf_sensitivity/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a7ii evf sensitivity /!/ just received my a7ii not too long ago and am loving it.\n\nbut i notice that the evf is super sensitive - hanging the camera around my shoulder or neck never seems to auto shut off/hibernation when setting it to a minute. i've tried over the shoulder with the camera facing behind me, in front of me and hanging it around my neck but so far i haven't had much luck in reliably getting the camera to shut off.\n\nanyone know a workaround or -----> orientation !!!  to have the camera set to?", "sortedWord": "None", "identifyer": 30983, "year": "2018"}, {"Unnamed: 0": 242139, "autor": "mrgambitjr", "date": 1531264998000, "content": "100-400GM rotation ring knob problem /!/ Hey guys,\n\nThe rotation ring clamp screw on my 100-400GM is loose.\n\nIt does not screw or unscrew.\n\nAs a result, the rotation cannot be used to change the orientation for the lens.\n\n[https://imgur.com/a/yNMc4Pq](https://imgur.com/a/yNMc4Pq)\n\nHas anyone encountered the same problem with this lens ?\n\nAny solution to fix this without sending it in.\n\nI bought this lens from a used lens shop in Japan. I'm located in the US. The rotation ring was fine until a few weeks ago where I think I may have accidentally over-tightened it.\n\nAny help is appreciated. \n\nThanks.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8xue1k/100400gm_rotation_ring_knob_problem/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "100-400gm rotation ring knob problem /!/ hey guys,\n\nthe rotation ring clamp screw on my 100-400gm is loose.\n\nit does not screw or unscrew.\n\nas a result, the rotation cannot be used to change the -----> orientation !!!  for the lens.\n\n[https://imgur.com/a/ynmc4pq](https://imgur.com/a/ynmc4pq)\n\nhas anyone encountered the same problem with this lens ?\n\nany solution to fix this without sending it in.\n\ni bought this lens from a used lens shop in japan. i'm located in the us. the rotation ring was fine until a few weeks ago where i think i may have accidentally over-tightened it.\n\nany help is appreciated. \n\nthanks.", "sortedWord": "None", "identifyer": 37313, "year": "2018"}, {"Unnamed: 0": 246544, "autor": "Cochise_Gil", "date": 1528779997000, "content": "[HELP] Variable Lines in Haze - Help with theories as to how and why? /!/ I took this image during an evening vigil recently and whilst shooting vertical these \" lines\" appeared in the background haze.  They are not present when I shot horizontal however.  \n\n* Sony a7r 3.  FE 24\\-70 f2.8 GM ,\n*  ISO 12800  shot at 70 mm at 2.8.  \n* 1/80 sec  e\\-shutter.\n*  No flash.  \n\nMy guess is the distant lights are LED and are vibrating at a frequency that the camera flickers only when at vertical.  In the series of images you can see how the lines seem to change from one image to another.  I feel its a flicker issue as I did not have the flicker warning on. I didn't take any other shutter speeds or even think to turn on the flicker in camera.  I used silent shutter for obvious reasons as to not disturb the participants so I was not able to use the mechanical shutter.  Lucky for me it was not present when I shot in the other orientation and that was the image I decided upon. But if there are any other theories please feel free to let me know . If my theory is correct then I guess we just need to be more aware of that issue now that more and more street lights are  going to these now.  Thank you in advance! \n\n*Processing img 490fztcp3i311...*\n\n*Processing img 354wmzcp3i311...*\n\n*Processing img uorvxacp3i311...*\n\n*Processing img 62dolfc44i311...*", "link": "https://www.reddit.com/r/SonyAlpha/comments/8qgbcn/help_variable_lines_in_haze_help_with_theories_as/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "[help] variable lines in haze - help with theories as to how and why? /!/ i took this image during an evening vigil recently and whilst shooting vertical these \" lines\" appeared in the background haze.  they are not present when i shot horizontal however.  \n\n* sony a7r 3.  fe 24\\-70 f2.8 gm ,\n*  iso 12800  shot at 70 mm at 2.8.  \n* 1/80 sec  e\\-shutter.\n*  no flash.  \n\nmy guess is the distant lights are led and are vibrating at a frequency that the camera flickers only when at vertical.  in the series of images you can see how the lines seem to change from one image to another.  i feel its a flicker issue as i did not have the flicker warning on. i didn't take any other shutter speeds or even think to turn on the flicker in camera.  i used silent shutter for obvious reasons as to not disturb the participants so i was not able to use the mechanical shutter.  lucky for me it was not present when i shot in the other -----> orientation !!!  and that was the image i decided upon. but if there are any other theories please feel free to let me know . if my theory is correct then i guess we just need to be more aware of that issue now that more and more street lights are  going to these now.  thank you in advance! \n\n*processing img 490fztcp3i311...*\n\n*processing img 354wmzcp3i311...*\n\n*processing img uorvxacp3i311...*\n\n*processing img 62dolfc44i311...*", "sortedWord": "None", "identifyer": 41809, "year": "2018"}], "name": "orientationSonyAlpha2018"}