{"interestingcomments": [{"Unnamed: 0": 234403, "autor": "MistahDabadoo", "date": 1527241364000, "content": "Ordered A7 III through Amazon - share your experience (rant inside) /!/ I ordered from them on April 15 with an estimated delivery date of 5/7 to 5/23. I spoke with a CSR about a more exact delivery date and all I got was \"by may 23.\" I then spoke with another rep on the 22nd to see what was happening because it still wasn't shipped yet despite my order status still saying \"expected may 23.\"\n\nThis was his/her reply: \"Upon checking i could see that this order was stuck in the shipping stage due to some technical glitch wit the fulfillment center. But no need to worry, in this case i would request you to please cancel this order and would request you to please place a new order for the same with the fastest shipping method and i will waive off the shipping charges for you.\nAnd i will keep a track on that so that tis should not happen again. \"\n\nI follow the CSR's directions and cancel my current order and place a new order. The ETA for that order is 6/12 to 6/26. I ask if placing a new order effectively \"resets\" my position in waiting for the camera, but I get a non-answer and a $20 credit as a token of apology. I placed an additional order through B&amp;H, as I should have done from the beginning.\n\nThe following day, I contact CS to ask for a follow up and if placing a new order as instructed meant having to wait another 6 weeks, which he confirmed to be the case. \n\nTo those who ordered with amazon, what was your turnaround time between ordering and arrival? I'm probably going to cancel the amazon order in about a week and just wait on B&amp;H. For sure I won't ordering backordered items through amazon again.\n\nTLDR: Ordered A7iii on amazon, waited 5 weeks just to wait another 4 to 6. Am pretty salty. Ordered through B&amp;H. Won't touch amazon for backordered stuff.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8m0hjk/ordered_a7_iii_through_amazon_share_your/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ordered a7 iii through amazon - share your experience (rant inside) /!/ i ordered from them on april 15 with an estimated delivery date of 5/7 to 5/23. i spoke with a csr about a more exact delivery date and all i got was \"by may 23.\" i then spoke with another rep on the 22nd to see what was happening because it still wasn't shipped yet despite my order status still saying \"expected may 23.\"\n\nthis was his/her reply: \"upon checking i could see that this order was stuck in the shipping stage due to some technical glitch wit the fulfillment center. but no need to worry, in this case i would request you to please cancel this order and would request you to please place a new order for the same with the fastest shipping method and i will waive off the shipping charges for you.\nand i will keep a track on that so that tis should not happen again. \"\n\ni follow the csr's directions and cancel my current order and place a new order. the eta for that order is 6/12 to 6/26. i ask if placing a new order effectively \"resets\" my -----> position !!!  in waiting for the camera, but i get a non-answer and a $20 credit as a token of apology. i placed an additional order through b&amp;h, as i should have done from the beginning.\n\nthe following day, i contact cs to ask for a follow up and if placing a new order as instructed meant having to wait another 6 weeks, which he confirmed to be the case. \n\nto those who ordered with amazon, what was your turnaround time between ordering and arrival? i'm probably going to cancel the amazon order in about a week and just wait on b&amp;h. for sure i won't ordering backordered items through amazon again.\n\ntldr: ordered a7iii on amazon, waited 5 weeks just to wait another 4 to 6. am pretty salty. ordered through b&amp;h. won't touch amazon for backordered stuff.", "sortedWord": "None", "identifyer": 29460, "year": "2018"}, {"Unnamed: 0": 234578, "autor": "hacksawfred", "date": 1536703089000, "content": "A7iii battery dies even though switch is in 'OFF' position .. /!/ I have a Sony A7iii with a Fotodiox electronic adapter and a Canon TS-E 24mm 3.5 lens attached. I have noticed that when I have the adapter and lens attached, I lose approximately 10% battery life per day even when the switch is in off mode. If I only have the adapter by itself or no adapter, battery life is fine. Airplane mode and remote control are disabled. Anyone experiencing something similar? Any suggestions on how to deal with this? Thanks.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9f1sjt/a7iii_battery_dies_even_though_switch_is_in_off/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7iii battery dies even though switch is in 'off' -----> position !!!  .. /!/ i have a sony a7iii with a fotodiox electronic adapter and a canon ts-e 24mm 3.5 lens attached. i have noticed that when i have the adapter and lens attached, i lose approximately 10% battery life per day even when the switch is in off mode. if i only have the adapter by itself or no adapter, battery life is fine. airplane mode and remote control are disabled. anyone experiencing something similar? any suggestions on how to deal with this? thanks.", "sortedWord": "None", "identifyer": 29637, "year": "2018"}, {"Unnamed: 0": 235020, "autor": "Black3ternity", "date": 1515993994000, "content": "First Nightsky-Shot /!/ Hi guys and girls,\n\nI'm new to the whole Sony Alpha and Camera-equipment.\nBought my Alpha 6000 used (three month old) with the Double-Lens-Kit (16-50 &amp; 55-210mm lenses).\n\nBefore that I was passionate with my Lumia 1020 and know a little bit about shutter speeds and stuff like that.\nAnyways - yesterday I saw a clear night sky and I immediately thought: I need to try that!\nHere's the outcome. \n1st one - 16-50mm @16mm, F3.5, ISO 800 - 25sec\nhttps://imgur.com/ARzGuC9\n\n2nd one - 55-210mm @210mm F6.3, ISO 1600 - 4sec\nhttps://imgur.com/f7srLEJ\n\nI know - it's no milky way and especially the light pollution in the first pic is pretty awful. I just went outside on my balcony and shot away - knowingly that I'm capturing the pollution with the camera\n\nHere's my thing: I focused manually. In a pretty awkward position because my tripod is not that tall and I was shooting at nearly 90° upwards - It seems a bit out of focus - even if I did \"as best as I could\". \nAny advice on how to focus properly and do more? I've read already through www.lonelyspeck.com and read that lenses with smaller focal length and lower F-Stop are way better but right now I want to get the most out of the gear I bought. \n\nAny feedback and of course constructive criticism is welcome.\n\nCheers,", "link": "https://www.reddit.com/r/SonyAlpha/comments/7qhl82/first_nightskyshot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "first nightsky-shot /!/ hi guys and girls,\n\ni'm new to the whole sony alpha and camera-equipment.\nbought my alpha 6000 used (three month old) with the double-lens-kit (16-50 &amp; 55-210mm lenses).\n\nbefore that i was passionate with my lumia 1020 and know a little bit about shutter speeds and stuff like that.\nanyways - yesterday i saw a clear night sky and i immediately thought: i need to try that!\nhere's the outcome. \n1st one - 16-50mm @16mm, f3.5, iso 800 - 25sec\nhttps://imgur.com/arzguc9\n\n2nd one - 55-210mm @210mm f6.3, iso 1600 - 4sec\nhttps://imgur.com/f7srlej\n\ni know - it's no milky way and especially the light pollution in the first pic is pretty awful. i just went outside on my balcony and shot away - knowingly that i'm capturing the pollution with the camera\n\nhere's my thing: i focused manually. in a pretty awkward -----> position !!!  because my tripod is not that tall and i was shooting at nearly 90° upwards - it seems a bit out of focus - even if i did \"as best as i could\". \nany advice on how to focus properly and do more? i've read already through www.lonelyspeck.com and read that lenses with smaller focal length and lower f-stop are way better but right now i want to get the most out of the gear i bought. \n\nany feedback and of course constructive criticism is welcome.\n\ncheers,", "sortedWord": "None", "identifyer": 30085, "year": "2018"}, {"Unnamed: 0": 236122, "autor": "PhilyP89", "date": 1534910536000, "content": "A7R ii or A7 iii /!/ Hey guys. So haven’t had a camera since college. Sold it for money (7 years ago) but now I’m in the position to purchase and get back to this hobby. When I had a camera I took mostly landscape and architecture photography.\n\nNow I’m intrigued with the new A7 iii out that I’ve heard so much about. My dilemma is that I found an A7R ii used in great shape for 1500. That’s 500 less than the iii. \n\nSo my question is if the iii is worth the 500 for the new features and battery or should I just go for the a7 r ii for its higher resolution which I feel would be more beneficial to landscape and architecture photography. \n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/99a585/a7r_ii_or_a7_iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7r ii or a7 iii /!/ hey guys. so haven’t had a camera since college. sold it for money (7 years ago) but now i’m in the -----> position !!!  to purchase and get back to this hobby. when i had a camera i took mostly landscape and architecture photography.\n\nnow i’m intrigued with the new a7 iii out that i’ve heard so much about. my dilemma is that i found an a7r ii used in great shape for 1500. that’s 500 less than the iii. \n\nso my question is if the iii is worth the 500 for the new features and battery or should i just go for the a7 r ii for its higher resolution which i feel would be more beneficial to landscape and architecture photography. \n\nthanks!", "sortedWord": "None", "identifyer": 31204, "year": "2018"}, {"Unnamed: 0": 237043, "autor": "Artikunu", "date": 1515298595000, "content": "Looking for some help with recently purchased A7R /!/ Hello Everyone, \n\nI have been saving money for the last year in hopes to purchase a camera. Finally, after Christmas, I had enough saved for a used Sony A7R. I bought it through Ebay. \n\nAlong with the camera, I purchased a Voightlander f/1.4 40mm lens off of amazon. \n\nThe camera came a few days before the lens. I inspected it, and all seemed to be satisfactory. After that, the camera sat in my camera bag for a few days while I waited for the lens to arrive. \n\nFinally the day came, and the lens arrived. I mounted it, took a few photos, and all of the sudden a message appeared: \"Camera Error. Turn power off then on.\" The shudder is also stuck in a its closed position. \n\nI have no warranty for this camera through Sony nor Ebay. \n\nI'm at an absolute loss in regards for what to do next. Do I contact Ebay and request my money be returned? I sank a majority of my savings into this set up, so another $300 on top for repairs is not feasible. \n\nI would really appreciate some advice... I am freaking out. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/7oogpj/looking_for_some_help_with_recently_purchased_a7r/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for some help with recently purchased a7r /!/ hello everyone, \n\ni have been saving money for the last year in hopes to purchase a camera. finally, after christmas, i had enough saved for a used sony a7r. i bought it through ebay. \n\nalong with the camera, i purchased a voightlander f/1.4 40mm lens off of amazon. \n\nthe camera came a few days before the lens. i inspected it, and all seemed to be satisfactory. after that, the camera sat in my camera bag for a few days while i waited for the lens to arrive. \n\nfinally the day came, and the lens arrived. i mounted it, took a few photos, and all of the sudden a message appeared: \"camera error. turn power off then on.\" the shudder is also stuck in a its closed -----> position !!! . \n\ni have no warranty for this camera through sony nor ebay. \n\ni'm at an absolute loss in regards for what to do next. do i contact ebay and request my money be returned? i sank a majority of my savings into this set up, so another $300 on top for repairs is not feasible. \n\ni would really appreciate some advice... i am freaking out. ", "sortedWord": "None", "identifyer": 32134, "year": "2018"}, {"Unnamed: 0": 237092, "autor": "random_guy12", "date": 1515193994000, "content": "Same dot/artifact in same position on every bokeh ball? (Sony 35mm f/1.8 OSS) /!/ Hey all,\n\nI got an A6300 along with the kit lens and Sony 35mm F1.8 about a three weeks ago. \n\nI'm really enjoying the setup. Though a few days ago I was playing around the 35mm lens wide open at night with out-of-focus lights. Basically trying to make massive bokeh balls. \n\nHowever, in a lot of the images I take, I see a small black mark towards the lower right of the larger bokeh balls. \n\nSee here: https://imgur.com/a/FUYSU\n\nThe last image on the river probably shows this best. \n\nI assume that it's not a dirty sensor issue...since it's not a dot on the same part of every image - bokeh balls are in different locations. \n\nI figured it could be the front or rear lens element, so I cleaned them initially with microfiber - which didn't help. Today I purchased and tried a lens brush/blower, some lens fluid, and some lens paper, but from what I can tell, the issue is still there. \n\nAnd under like 5 different kinds of bright light, I can't for the life of me find any scratches on either element. \n\nCould it possibly be a piece of dust inside the lens? Alternatively, is it possible for a very minor scratch that's hard to find visually to cause a dot that big? \n\nI'm unsure if this was an issue with the lens out of the box. Usually I'm shooting street shots or environmental portraits, so the bokeh balls rarely get big enough to notice the artifacts. \n\nIn general, this isn't a huge deal. It's just a little irritating since this lens was really expensive and it's only been a few weeks since I got it. \n\nFor context, I would say I baby it a lot. It does get exposed to the environment pretty often though, since I switch between the kit lens for wide-angle and the SEL35 a lot. \n\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/7of6t5/same_dotartifact_in_same_position_on_every_bokeh/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "same dot/artifact in same -----> position !!!  on every bokeh ball? (sony 35mm f/1.8 oss) /!/ hey all,\n\ni got an a6300 along with the kit lens and sony 35mm f1.8 about a three weeks ago. \n\ni'm really enjoying the setup. though a few days ago i was playing around the 35mm lens wide open at night with out-of-focus lights. basically trying to make massive bokeh balls. \n\nhowever, in a lot of the images i take, i see a small black mark towards the lower right of the larger bokeh balls. \n\nsee here: https://imgur.com/a/fuysu\n\nthe last image on the river probably shows this best. \n\ni assume that it's not a dirty sensor issue...since it's not a dot on the same part of every image - bokeh balls are in different locations. \n\ni figured it could be the front or rear lens element, so i cleaned them initially with microfiber - which didn't help. today i purchased and tried a lens brush/blower, some lens fluid, and some lens paper, but from what i can tell, the issue is still there. \n\nand under like 5 different kinds of bright light, i can't for the life of me find any scratches on either element. \n\ncould it possibly be a piece of dust inside the lens? alternatively, is it possible for a very minor scratch that's hard to find visually to cause a dot that big? \n\ni'm unsure if this was an issue with the lens out of the box. usually i'm shooting street shots or environmental portraits, so the bokeh balls rarely get big enough to notice the artifacts. \n\nin general, this isn't a huge deal. it's just a little irritating since this lens was really expensive and it's only been a few weeks since i got it. \n\nfor context, i would say i baby it a lot. it does get exposed to the environment pretty often though, since i switch between the kit lens for wide-angle and the sel35 a lot. \n\n", "sortedWord": "None", "identifyer": 32183, "year": "2018"}, {"Unnamed: 0": 237791, "autor": "malzzzzzzzzzzzz", "date": 1544326077000, "content": "Sony 35mm F1.4 lens has totally inconsistent manual focus... /!/ I noticed something weird when using this lens today in conjunction with an Edelkrone HeadPlus w/focus module.  Normally I'd use a cine lens with this setup, but I thought I'd try the Sony with a gear ring attached.  What I found was that I'd set a few positions with focus, but when transitioning from one position to another, the Sony lens did not maintain focus despite the focus ring returning to the exact same position as when I initially set the focus.  And I'm not talking about a small discrepancy - the focus was off enough that text went from tack sharp to completely unreadable.    \n\nHas anyone noticed this type of behavior?", "link": "https://www.reddit.com/r/SonyAlpha/comments/a4hn7k/sony_35mm_f14_lens_has_totally_inconsistent/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "sony 35mm f1.4 lens has totally inconsistent manual focus... /!/ i noticed something weird when using this lens today in conjunction with an edelkrone headplus w/focus module.  normally i'd use a cine lens with this setup, but i thought i'd try the sony with a gear ring attached.  what i found was that i'd set a few -----> positions !!!  with focus, but when transitioning from one position to another, the sony lens did not maintain focus despite the focus ring returning to the exact same position as when i initially set the focus.  and i'm not talking about a small discrepancy - the focus was off enough that text went from tack sharp to completely unreadable.    \n\nhas anyone noticed this type of behavior?", "sortedWord": "None", "identifyer": 32895, "year": "2018"}, {"Unnamed: 0": 237851, "autor": "liamaewright", "date": 1532472610000, "content": "Looking to buy my first camera and thinking of the A6000, but I need some help /!/ Bit of background: so I’ve been interested in filmmaking and photography for ages now, and I’m finally in a position to justify financing this. Im also at university where I’ll have more opportunities to explore filmmaking and photography so now seems like the right time.\n\nI want a camera that serves both of these purposes and I’ve heard good things about the A6000 in this respect, especially for my budget of around £500. As this is the Alpha sub I thought you would all be more experienced, so how good is it really for these purposes? \n\nHowever, I am concerned about the microphone situation. I’ve heard mixed things about the microphones for the hot shoe, but this matter for filmmaking? Would an external voice recorder be best for filmmaking and videography anyway? \n\nWould this be the best camera for my purposes and my budget? The next A camera up has an audio jack and 4K but the price difference is huge. Would this be a safe bet? ", "link": "https://www.reddit.com/r/SonyAlpha/comments/91m8yc/looking_to_buy_my_first_camera_and_thinking_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking to buy my first camera and thinking of the a6000, but i need some help /!/ bit of background: so i’ve been interested in filmmaking and photography for ages now, and i’m finally in a -----> position !!!  to justify financing this. im also at university where i’ll have more opportunities to explore filmmaking and photography so now seems like the right time.\n\ni want a camera that serves both of these purposes and i’ve heard good things about the a6000 in this respect, especially for my budget of around £500. as this is the alpha sub i thought you would all be more experienced, so how good is it really for these purposes? \n\nhowever, i am concerned about the microphone situation. i’ve heard mixed things about the microphones for the hot shoe, but this matter for filmmaking? would an external voice recorder be best for filmmaking and videography anyway? \n\nwould this be the best camera for my purposes and my budget? the next a camera up has an audio jack and 4k but the price difference is huge. would this be a safe bet? ", "sortedWord": "None", "identifyer": 32957, "year": "2018"}, {"Unnamed: 0": 237961, "autor": "MaxUtilPerUSD", "date": 1518410951000, "content": "Brand New To Photography - Sony A6500 Good Choice? /!/ Please bear with me, as I have no experience with photography outside of taking old-school film shots where we had to develop the film in photo class in high school. I like to travel a lot and take photos with my smartphone. I'm going on a couple of more trips this year, and one of them is with my mom, who hasn't even been on a plane in over 20 years. I'd really love to capture this moment in our lives since I may not have this chance again.\n\nAnyway, I am interested in taking nice pictures and video, and may even want to learn how to edit videos so that I can post things on Youtube. I have done some research, and I love the cinematic videos and really nice professional-looking pictures. As a novice, I don't know how to explain it but there is definitely a noticeable quality difference between something that looks \"really good\" vs something that was taken with a smartphone. I want to learn how to do the former.\n\nSo I've done a little research, and I'm looking for an all-around camera that will do many things well. The Sony A6500 piqued my interest because I've seen great cinematic video from it, slow-mo video, great picture quality, small size to travel with, in the price range I want to spend ($1000-$1500 camera body), etc.\n\nNow here are my newbie questions (sorry if this may offend due to the naivete :D)\n\n1. I see cameras sold body only. Most of the pro cameras I see have these mounts where you attach a lens, which can be just as much as the camera in cost. I see these really long lenses that protrude out from the camera as well as shorter lenses. Can the camera be operated body only without a lens? I suspect the answer is no, and these pro cameras require a lens just to take basic pictures. What is a good all-around starter lens?\n\n2. Is my initial inclination toward the Sony A6500 a good choice given the fact that I want to do photo and video, slow-motion and cinematic video, maybe vlog, costs $1000-$1500, and travel around with little weight and baggage?\n\n3. Are there any other recommendations that you have? I don't want to drop in price range simply because I need to \"learn the basics first.\" I've purchased items in the past with my hobbies where I had settled at the beginner level and regretted it later because I went on to replace the multi-hundred dollar item with something that was $1000+.\n\n4. What other accessories and costs should I consider? I think I should get one of those octopus tripods where the 3 legs are made of ball-like things and you can position in many different ways. I'm also considering these: cage to mount various accessories, microphone (I see these puff balls coming out of cameras), and underwater case so I can take pics and video in water. Oh, I would also need a high capacity SD card and maybe an additional HD to store all those large file sizes.\n\nThanks in advance for any help. I am a beginner in this arena, and just want to capture those great experiences.\n\n-Chris C.", "link": "https://www.reddit.com/r/SonyAlpha/comments/7wye19/brand_new_to_photography_sony_a6500_good_choice/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "brand new to photography - sony a6500 good choice? /!/ please bear with me, as i have no experience with photography outside of taking old-school film shots where we had to develop the film in photo class in high school. i like to travel a lot and take photos with my smartphone. i'm going on a couple of more trips this year, and one of them is with my mom, who hasn't even been on a plane in over 20 years. i'd really love to capture this moment in our lives since i may not have this chance again.\n\nanyway, i am interested in taking nice pictures and video, and may even want to learn how to edit videos so that i can post things on youtube. i have done some research, and i love the cinematic videos and really nice professional-looking pictures. as a novice, i don't know how to explain it but there is definitely a noticeable quality difference between something that looks \"really good\" vs something that was taken with a smartphone. i want to learn how to do the former.\n\nso i've done a little research, and i'm looking for an all-around camera that will do many things well. the sony a6500 piqued my interest because i've seen great cinematic video from it, slow-mo video, great picture quality, small size to travel with, in the price range i want to spend ($1000-$1500 camera body), etc.\n\nnow here are my newbie questions (sorry if this may offend due to the naivete :d)\n\n1. i see cameras sold body only. most of the pro cameras i see have these mounts where you attach a lens, which can be just as much as the camera in cost. i see these really long lenses that protrude out from the camera as well as shorter lenses. can the camera be operated body only without a lens? i suspect the answer is no, and these pro cameras require a lens just to take basic pictures. what is a good all-around starter lens?\n\n2. is my initial inclination toward the sony a6500 a good choice given the fact that i want to do photo and video, slow-motion and cinematic video, maybe vlog, costs $1000-$1500, and travel around with little weight and baggage?\n\n3. are there any other recommendations that you have? i don't want to drop in price range simply because i need to \"learn the basics first.\" i've purchased items in the past with my hobbies where i had settled at the beginner level and regretted it later because i went on to replace the multi-hundred dollar item with something that was $1000+.\n\n4. what other accessories and costs should i consider? i think i should get one of those octopus tripods where the 3 legs are made of ball-like things and you can -----> position !!!  in many different ways. i'm also considering these: cage to mount various accessories, microphone (i see these puff balls coming out of cameras), and underwater case so i can take pics and video in water. oh, i would also need a high capacity sd card and maybe an additional hd to store all those large file sizes.\n\nthanks in advance for any help. i am a beginner in this arena, and just want to capture those great experiences.\n\n-chris c.", "sortedWord": "None", "identifyer": 33067, "year": "2018"}, {"Unnamed: 0": 238879, "autor": "LoverOfInternets", "date": 1534732810000, "content": "Corrupted .ARW files when a \"splash\" from the ocean hit my camera. Chance of recovery and likely damage to my A7III? /!/ During my vacation I was snapping some portraits of my friends in the ocean, waist deep. We were in the Bahamas and I couldn't resist the angle and beauty of the water. During this time a larger \"wave\" (they weren't that big) than what was coming in previously popped up and hit the camera for a brief second.\n\nNow before I hear, \"you shouldn't have been in that position with your gear\" or anything of the sort, I have full coverage on my gear for anything that were to happen outside of intentional damage. Thank you.\n\nWhen this happened I was shooting 10fps and was during a large burst. Probably 60-80 photos. I stopped to check it out but everything seemed fine at the moment. A minute later, the screen went all purple and pixelated. I turned it off and let it sit for a minute. After turning it back on it worked as expected and had 0 issues the rest of the trip.\n\nAlthough, when importing the pictures into Lightroom CC taken during that time I got an error. So I decided to copy the corrupted files to my computer and attempt data recovery, opening them up in photoshop, affinity photo, and Lightroom Classic, and  trying to convert them to DNGs using Adobe's converter. None of which work.\n\nAll that being said, I have two questions.\n\n1. Does anyone have any ideas on how I might be able to recover these images. I know this is a long shot and I've already accepted that they're gone.\n2. Does anyone know what kind of damage my camera received or a way to tell if any damage as occurred?\n\nThank you for reading a long \"my camera got wet and files are now corrupted. Please halp\" post. Context is important? ¯\\\\\\_(ツ)\\_/¯ ", "link": "https://www.reddit.com/r/SonyAlpha/comments/98pxft/corrupted_arw_files_when_a_splash_from_the_ocean/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "corrupted .arw files when a \"splash\" from the ocean hit my camera. chance of recovery and likely damage to my a7iii? /!/ during my vacation i was snapping some portraits of my friends in the ocean, waist deep. we were in the bahamas and i couldn't resist the angle and beauty of the water. during this time a larger \"wave\" (they weren't that big) than what was coming in previously popped up and hit the camera for a brief second.\n\nnow before i hear, \"you shouldn't have been in that -----> position !!!  with your gear\" or anything of the sort, i have full coverage on my gear for anything that were to happen outside of intentional damage. thank you.\n\nwhen this happened i was shooting 10fps and was during a large burst. probably 60-80 photos. i stopped to check it out but everything seemed fine at the moment. a minute later, the screen went all purple and pixelated. i turned it off and let it sit for a minute. after turning it back on it worked as expected and had 0 issues the rest of the trip.\n\nalthough, when importing the pictures into lightroom cc taken during that time i got an error. so i decided to copy the corrupted files to my computer and attempt data recovery, opening them up in photoshop, affinity photo, and lightroom classic, and  trying to convert them to dngs using adobe's converter. none of which work.\n\nall that being said, i have two questions.\n\n1. does anyone have any ideas on how i might be able to recover these images. i know this is a long shot and i've already accepted that they're gone.\n2. does anyone know what kind of damage my camera received or a way to tell if any damage as occurred?\n\nthank you for reading a long \"my camera got wet and files are now corrupted. please halp\" post. context is important? ¯\\\\\\_(ツ)\\_/¯ ", "sortedWord": "None", "identifyer": 34001, "year": "2018"}, {"Unnamed: 0": 240826, "autor": "CookieBoy8888", "date": 1514871551000, "content": "A6500 or A7S II /!/ Hi guys!\n\nI'm stuck between the A7S II and a6500 as they both seem to have similar video capabilities and it’s giving me pre purchase anxiety. I have a budget of around $4,500 and I’m just not sure what’s the best way to go, especially since I’ve seen videos that make both cameras look amazing. \n\nI work at a recording studio so as a little side hustle I want to shoot some behind the scenes styled content but I also want to do a bit of vlogging, tech review, tutorials, etc.\n\nWhat would you recommend for someone with my budget, in my position?", "link": "https://www.reddit.com/r/SonyAlpha/comments/7nkhbm/a6500_or_a7s_ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a6500 or a7s ii /!/ hi guys!\n\ni'm stuck between the a7s ii and a6500 as they both seem to have similar video capabilities and it’s giving me pre purchase anxiety. i have a budget of around $4,500 and i’m just not sure what’s the best way to go, especially since i’ve seen videos that make both cameras look amazing. \n\ni work at a recording studio so as a little side hustle i want to shoot some behind the scenes styled content but i also want to do a bit of vlogging, tech review, tutorials, etc.\n\nwhat would you recommend for someone with my budget, in my -----> position !!! ?", "sortedWord": "None", "identifyer": 35973, "year": "2018"}, {"Unnamed: 0": 240968, "autor": "BalingWire", "date": 1532966220000, "content": "Missing focus position indicator in MF Video mode. /!/ In stills modes I get a graphic at the bottom of the screen showing where the focus is at (from infinity to macro), but that graphic is not showing up in video. Is it not supported in video, or am I not finding the option in the menu maze?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9359hh/missing_focus_position_indicator_in_mf_video_mode/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "missing focus -----> position !!!  indicator in mf video mode. /!/ in stills modes i get a graphic at the bottom of the screen showing where the focus is at (from infinity to macro), but that graphic is not showing up in video. is it not supported in video, or am i not finding the option in the menu maze?", "sortedWord": "None", "identifyer": 36118, "year": "2018"}, {"Unnamed: 0": 242919, "autor": "lunalavendermoon", "date": 1541688480000, "content": "I have a Sony a6300 how do I taking shots with motion in them? /!/ I’m not looking to take “sports” shots or shots in action I’m looking for taking shots with almost like a double exposer effect but more so being able to visually see the movement in the image where you can see subject or person move from different positions within the image. What settings will help me achieve this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9valfo/i_have_a_sony_a6300_how_do_i_taking_shots_with/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i have a sony a6300 how do i taking shots with motion in them? /!/ i’m not looking to take “sports” shots or shots in action i’m looking for taking shots with almost like a double exposer effect but more so being able to visually see the movement in the image where you can see subject or person move from different -----> positions !!!  within the image. what settings will help me achieve this?", "sortedWord": "None", "identifyer": 38112, "year": "2018"}, {"Unnamed: 0": 242983, "autor": "shneedle_woods", "date": 1541538877000, "content": "The moment the shutter sound gave away my position; Cambodia, 2018. Sony a6000, Sony 18-200 OSS LE.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9ushkb/the_moment_the_shutter_sound_gave_away_my/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the moment the shutter sound gave away my -----> position !!! ; cambodia, 2018. sony a6000, sony 18-200 oss le.", "sortedWord": "None", "identifyer": 38177, "year": "2018"}, {"Unnamed: 0": 244362, "autor": "shaokee", "date": 1525094819000, "content": "A7iii kit at ~USD2376 vs body only at ~USD2264. Minimal difference in price, normal? /!/ Just wondering if this is the kind of price in other countries as well or just over here in Malaysia. I was browsing through to see prices and I feel puzzled that the difference is that minimal between the two options. Is that not a great deal to get the kit instead of body only?\n\n[A7iii with kit lens](https://shashinki.com/shop/sony-alpha-mirrorless-digital-camera-with-70mm-lens-sony-malaysia-p-36675.html)\n\n[A7iii body only](https://shashinki.com/shop/sony-alpha-mirrorless-digital-camera-body-only-free-32gb-sony-special-strap-sony-malaysia-p-36613.html)\n\nOh and yes I now feel like selling off my A7ii to get the iii. Holy shit the urge is strong hahah. I already have the 28mm and 55mm FE. Also have A-mount 135mm f/1.8 and Tokina 11-16 f/2.8 that are used with the LAEA4 adapter. Not sure why I need the iii, but it feels like it'll make me enjoy taking photos more. Used to take a lot of wedding photos as part time work, but nowadays I just take photos for Instagram uploads. Would you upgrade if you're in my position?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8fzfhv/a7iii_kit_at_usd2376_vs_body_only_at_usd2264/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7iii kit at ~usd2376 vs body only at ~usd2264. minimal difference in price, normal? /!/ just wondering if this is the kind of price in other countries as well or just over here in malaysia. i was browsing through to see prices and i feel puzzled that the difference is that minimal between the two options. is that not a great deal to get the kit instead of body only?\n\n[a7iii with kit lens](https://shashinki.com/shop/sony-alpha-mirrorless-digital-camera-with-70mm-lens-sony-malaysia-p-36675.html)\n\n[a7iii body only](https://shashinki.com/shop/sony-alpha-mirrorless-digital-camera-body-only-free-32gb-sony-special-strap-sony-malaysia-p-36613.html)\n\noh and yes i now feel like selling off my a7ii to get the iii. holy shit the urge is strong hahah. i already have the 28mm and 55mm fe. also have a-mount 135mm f/1.8 and tokina 11-16 f/2.8 that are used with the laea4 adapter. not sure why i need the iii, but it feels like it'll make me enjoy taking photos more. used to take a lot of wedding photos as part time work, but nowadays i just take photos for instagram uploads. would you upgrade if you're in my -----> position !!! ?", "sortedWord": "None", "identifyer": 39580, "year": "2018"}, {"Unnamed: 0": 246768, "autor": "lokilokigram", "date": 1526392035000, "content": "Anyone have any insider info on the availability of the a7 III? /!/ I wasn't in a position to preorder before the camera was first released, but I am able to purchase it now. I'd love to be able to get the body and 24-70mm lens package ASAP, and would be willing to drive almost anywhere in New England to buy it. Sure, I can hop on the next preorder from Best Buy or B&amp;H and have it delivered in late June, but *I WANT IT NOWWWW* because I'm a big baby who needs instant gratification. Anyone have any leads on where I could pick one up immediately? Or is the story going to be the same everywhere I look?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8jlox5/anyone_have_any_insider_info_on_the_availability/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "anyone have any insider info on the availability of the a7 iii? /!/ i wasn't in a -----> position !!!  to preorder before the camera was first released, but i am able to purchase it now. i'd love to be able to get the body and 24-70mm lens package asap, and would be willing to drive almost anywhere in new england to buy it. sure, i can hop on the next preorder from best buy or b&amp;h and have it delivered in late june, but *i want it nowwww* because i'm a big baby who needs instant gratification. anyone have any leads on where i could pick one up immediately? or is the story going to be the same everywhere i look?", "sortedWord": "None", "identifyer": 42036, "year": "2018"}, {"Unnamed: 0": 247834, "autor": "oddjobbodgod", "date": 1527416395000, "content": "Developing a better Play Memories app (iOS only for now) /!/ Hi everyone, hope you’re having a good weekend and have been getting lots of awesome shots on your Sony gear!\n\nTo give you some background to this post, I’m an amateur photographer, but my full time profession is as an iOS developer. Recently I’ve been posting a lot more of my photography to social media and I’ve become increasingly frustrated with the state of getting photos into a decent editing programme. The current process I'm having to go through is: \n\n- Take my memory card out from my camera\n- Copy paste the photos from the memory card to my MacBook\n- Import them to lightroomAnd if I don't have access to my computer, I'm entirely restricted to transferring from the Sony PlayMemories app as jpeg.\n\nI’d love to be able to quickly edit RAW images directly on my phone using lightroom CC and upload them to all my social media accounts, but I can’t... sadly the Sony PlayMemories app is a load of rubbish, severely outdated and doesn’t (I’m unsure if the latest update supports it) allow transfer of RAW files.\n\nBecause I’m an iOS dev, and Sony have a lovely open API for remote camera control, I decided that I’d give it a go at creating a remote control / image transfer app for iOS users!\n\nI’m currently in a good position with the app, I have the following functionality available (with bugs mind)\n- Transfer of images from camera to phone \n- Viewing camera’s live view\n- Focussing and taking a photo\n- Setting certain camera settings (so far ISO, Shutter Speed and Aperture, but they’re very quick to add)\n\nWhat I want from you is a couple of things:\n1. At the point at which I have a working alpha build, I’m going to want to get as many people testing it as possible, if you’re interested please DM me\n2. Ideas for functionality! I already have a lot of ideas which aren’t yet implemented, but I’d love to hear any of your ideas for useful or cool pieces of functionality, nothing is too wacky!\n\nThanks everyone, and happy shooting!\n\np.s. If people are interested I’d be happy to show some demo video of where I’m currently at.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8mgx6y/developing_a_better_play_memories_app_ios_only/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "developing a better play memories app (ios only for now) /!/ hi everyone, hope you’re having a good weekend and have been getting lots of awesome shots on your sony gear!\n\nto give you some background to this post, i’m an amateur photographer, but my full time profession is as an ios developer. recently i’ve been posting a lot more of my photography to social media and i’ve become increasingly frustrated with the state of getting photos into a decent editing programme. the current process i'm having to go through is: \n\n- take my memory card out from my camera\n- copy paste the photos from the memory card to my macbook\n- import them to lightroomand if i don't have access to my computer, i'm entirely restricted to transferring from the sony playmemories app as jpeg.\n\ni’d love to be able to quickly edit raw images directly on my phone using lightroom cc and upload them to all my social media accounts, but i can’t... sadly the sony playmemories app is a load of rubbish, severely outdated and doesn’t (i’m unsure if the latest update supports it) allow transfer of raw files.\n\nbecause i’m an ios dev, and sony have a lovely open api for remote camera control, i decided that i’d give it a go at creating a remote control / image transfer app for ios users!\n\ni’m currently in a good -----> position !!!  with the app, i have the following functionality available (with bugs mind)\n- transfer of images from camera to phone \n- viewing camera’s live view\n- focussing and taking a photo\n- setting certain camera settings (so far iso, shutter speed and aperture, but they’re very quick to add)\n\nwhat i want from you is a couple of things:\n1. at the point at which i have a working alpha build, i’m going to want to get as many people testing it as possible, if you’re interested please dm me\n2. ideas for functionality! i already have a lot of ideas which aren’t yet implemented, but i’d love to hear any of your ideas for useful or cool pieces of functionality, nothing is too wacky!\n\nthanks everyone, and happy shooting!\n\np.s. if people are interested i’d be happy to show some demo video of where i’m currently at.", "sortedWord": "None", "identifyer": 43130, "year": "2018"}], "name": "positionSonyAlpha2018"}