{"interestingcomments": [{"Unnamed: 0": 134651, "autor": "Bittabola", "date": 1630435467000, "content": "Dirt in the shutter button (A7C) /!/ Hi all,\n\nBanana juice got on the A7C shutter button. I cleaned with a wet wipe and it looks clean from the outside. But the button is stuck when I press it and returns to the original position very slowly and it feels very mushy. I believe there's some banana residue under the button.\n\nIs it possible to open up the button to clean underneath?\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/pfc362/dirt_in_the_shutter_button_a7c/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "dirt in the shutter button (a7c) /!/ hi all,\n\nbanana juice got on the a7c shutter button. i cleaned with a wet wipe and it looks clean from the outside. but the button is stuck when i press it and returns to the original -----> position !!!  very slowly and it feels very mushy. i believe there's some banana residue under the button.\n\nis it possible to open up the button to clean underneath?\n\nthanks!", "sortedWord": "None", "identifyer": 25398, "year": "2021"}, {"Unnamed: 0": 135338, "autor": "vidati", "date": 1614362546000, "content": "About to pull the trigger on the A7III with 28-75mm Tamron Lens, need a recommendation for flash. /!/ Hi, \n\nSo as the title states :) \n\nI was wondering about getting a flash unit for the camera but I'm not really sure what's what. \n\nI need a decent flash for outdoor portraits and i would be happy if its wireless so i can position the flash on different angles or behind the subject.  \n\nThanks.", "link": "https://www.reddit.com/r/SonyAlpha/comments/lt3otz/about_to_pull_the_trigger_on_the_a7iii_with/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "about to pull the trigger on the a7iii with 28-75mm tamron lens, need a recommendation for flash. /!/ hi, \n\nso as the title states :) \n\ni was wondering about getting a flash unit for the camera but i'm not really sure what's what. \n\ni need a decent flash for outdoor portraits and i would be happy if its wireless so i can -----> position !!!  the flash on different angles or behind the subject.  \n\nthanks.", "sortedWord": "None", "identifyer": 26102, "year": "2021"}, {"Unnamed: 0": 135550, "autor": "Luke_Matthews", "date": 1618530162000, "content": "Sling Bag for a7r IV w/Grip attached? /!/ So, I just picked up my a7r IV with the vertical grip, and I'm wondering if anyone has any good recs for a sling bag that can hold the camera with both a lens and the grip attached? The Lowepro bag I currently have doesn't accommodate the grip well.\n\nIdeally, I'd like something that, when pulled forward, offers quick access to the camera without having to put the whole thing in sideways or in a wonky position. Any ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mrr25h/sling_bag_for_a7r_iv_wgrip_attached/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sling bag for a7r iv w/grip attached? /!/ so, i just picked up my a7r iv with the vertical grip, and i'm wondering if anyone has any good recs for a sling bag that can hold the camera with both a lens and the grip attached? the lowepro bag i currently have doesn't accommodate the grip well.\n\nideally, i'd like something that, when pulled forward, offers quick access to the camera without having to put the whole thing in sideways or in a wonky -----> position !!! . any ideas?", "sortedWord": "None", "identifyer": 26319, "year": "2021"}, {"Unnamed: 0": 135816, "autor": "-HyperConnectivity-", "date": 1622475152000, "content": "Sony Alpha 7s III memory card slot stuck /!/ Hello all. Got a new camera today and everything was fine at first, but now, the memory card slot will not open, when I slide the button to the open position.\n\nIt opened earlier just fine, but now, it wont. What has happened?\n\nI have not placed any cards in the slot yet.\n\nAnd the camera is brand new.", "link": "https://www.reddit.com/r/SonyAlpha/comments/np63n2/sony_alpha_7s_iii_memory_card_slot_stuck/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sony alpha 7s iii memory card slot stuck /!/ hello all. got a new camera today and everything was fine at first, but now, the memory card slot will not open, when i slide the button to the open -----> position !!! .\n\nit opened earlier just fine, but now, it wont. what has happened?\n\ni have not placed any cards in the slot yet.\n\nand the camera is brand new.", "sortedWord": "None", "identifyer": 26592, "year": "2021"}, {"Unnamed: 0": 135874, "autor": "YoungSanchez", "date": 1622402407000, "content": "Need help to find a budget cage for old Sony a7s /!/ Hey friends, I need a cage for the old Sony a7s and I can't find it.\n\nThe thing is that the dollar is too expensive for me, and its to expensive to buy those older cages from 2014 when the cam was released...\n\nSo I'm trying to find a cage for another camera that can work with the Sony a7s, mostly from aliexpress or some chinese brand. I tried the Smallrig 2999 for the a7s III but did not fit... besides the old a7s been smaller than the a7s III the screw hole is not in the same position.\n\nAnyone can help me?", "link": "https://www.reddit.com/r/SonyAlpha/comments/noicm8/need_help_to_find_a_budget_cage_for_old_sony_a7s/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help to find a budget cage for old sony a7s /!/ hey friends, i need a cage for the old sony a7s and i can't find it.\n\nthe thing is that the dollar is too expensive for me, and its to expensive to buy those older cages from 2014 when the cam was released...\n\nso i'm trying to find a cage for another camera that can work with the sony a7s, mostly from aliexpress or some chinese brand. i tried the smallrig 2999 for the a7s iii but did not fit... besides the old a7s been smaller than the a7s iii the screw hole is not in the same -----> position !!! .\n\nanyone can help me?", "sortedWord": "None", "identifyer": 26652, "year": "2021"}, {"Unnamed: 0": 136111, "autor": "DaNPrS", "date": 1634337010000, "content": "Something is wrong with my A7Riii /!/ I haven't used it in about a week. Today I charged the battery, inserted it and turned on the camera. Here's everything that's happening. \n\n* Shutter button does nothing\n* Screen is dim\n* Mode select works sometimes\n* Function buttons do not work (C1, C2, C3, Fn...)\n* Unable to read SD cards. Seems to detect them, just not read them.\n* Menu works! Yay\n* Navigating to Settings Reset &gt; Initialize does nothing. Unable to select this option. Pressing, pressing and holding on Initialize does nothing. \n* Same goes for Camera Settings Reset, nothing happens when I press it. \n* Switching the camera to the off position, the screen remains on. I have to remove the battery to turn it off. \n\nRunning v3.10. I've tried a different battery, both are Sony. I've tried removing the battery for a few mins. At this point it might need a repair though. I'm not sure what else to try.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q8z2lk/something_is_wrong_with_my_a7riii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "something is wrong with my a7riii /!/ i haven't used it in about a week. today i charged the battery, inserted it and turned on the camera. here's everything that's happening. \n\n* shutter button does nothing\n* screen is dim\n* mode select works sometimes\n* function buttons do not work (c1, c2, c3, fn...)\n* unable to read sd cards. seems to detect them, just not read them.\n* menu works! yay\n* navigating to settings reset &gt; initialize does nothing. unable to select this option. pressing, pressing and holding on initialize does nothing. \n* same goes for camera settings reset, nothing happens when i press it. \n* switching the camera to the off -----> position !!! , the screen remains on. i have to remove the battery to turn it off. \n\nrunning v3.10. i've tried a different battery, both are sony. i've tried removing the battery for a few mins. at this point it might need a repair though. i'm not sure what else to try.", "sortedWord": "None", "identifyer": 26890, "year": "2021"}, {"Unnamed: 0": 136460, "autor": "WonderingThunder", "date": 1615829941000, "content": "Better way to setup self portraits? [a6300] /!/ I have an a6300 and I use my phone to remote with it on the Sony Imaging Edge app. Advantage is I can see where the frame is and my position before I take the shot. Disadvantage is I can only set a 2 second timer (the app interface overrides camera settings) so I can't do much between hitting the button and getting my phone out of the shot. If I use a standard remote, I can't see my position in the frame before I take it (so I have to trial and error running back and forth after each shot), but I can use a 10s timer. Any workarounds for this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/m5q6xm/better_way_to_setup_self_portraits_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "better way to setup self portraits? [a6300] /!/ i have an a6300 and i use my phone to remote with it on the sony imaging edge app. advantage is i can see where the frame is and my -----> position !!!  before i take the shot. disadvantage is i can only set a 2 second timer (the app interface overrides camera settings) so i can't do much between hitting the button and getting my phone out of the shot. if i use a standard remote, i can't see my position in the frame before i take it (so i have to trial and error running back and forth after each shot), but i can use a 10s timer. any workarounds for this?", "sortedWord": "None", "identifyer": 27248, "year": "2021"}, {"Unnamed: 0": 136587, "autor": "_xen0L", "date": 1609965285000, "content": "Prime Position. a6300 + Sigma 30 mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/krwkbv/prime_position_a6300_sigma_30_mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "prime -----> position !!! . a6300 + sigma 30 mm", "sortedWord": "None", "identifyer": 27382, "year": "2021"}, {"Unnamed: 0": 139360, "autor": "elialone", "date": 1626975687000, "content": "sigma 16mm 1.4 or sony 35mm 1.8? /!/ I have a a7C with a 16mm 1.4 for my a6600. Im thinking about getting the 35 1.8FE, but having the 16mm on apsc mode is basically  24mm 1.4 vs 35mm 1.8 correct? Do you guys think its worth getting a 35mm 1.8 in my position?", "link": "https://www.reddit.com/r/SonyAlpha/comments/opixg4/sigma_16mm_14_or_sony_35mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sigma 16mm 1.4 or sony 35mm 1.8? /!/ i have a a7c with a 16mm 1.4 for my a6600. im thinking about getting the 35 1.8fe, but having the 16mm on apsc mode is basically  24mm 1.4 vs 35mm 1.8 correct? do you guys think its worth getting a 35mm 1.8 in my -----> position !!! ?", "sortedWord": "None", "identifyer": 30255, "year": "2021"}, {"Unnamed: 0": 140071, "autor": "Ezra_I", "date": 1609872513000, "content": "Question about lenses /!/ Hello everyone! \nI have a 6500 with the kit 16-50mm lens which I like because of its versatility and size. The problem is that my son accidentally dropped the camera and landed on the lens which is now useless. It’s stuck on the open position, slightly bent and the ring doesn’t move. \nTo fix it, it would cost about $280 Canadian which it’s almost as much as a new one. \n\nMy question for you is which lens to get... I’m thinking between the same 16-50 as it’s quite versatile and small (as I mentioned) but I also know a prime might be better/faster... so I’m also looking to either a 35mm or a 50mm. \n\nI’m not a professional photographer, I mainly use the camera for family pictures and general shots... I’m also not entirely sure about the 35mm equivalency as I don’t have a point of reference to campare to. I know a 50mm is about 80 or 85mm on a 35 but I’m not sure how would that affect my decision on which lens to get. \n\nAnyways, after this whole long post, any tips would be appreciated. \nCheers!", "link": "https://www.reddit.com/r/SonyAlpha/comments/kr4ttf/question_about_lenses/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question about lenses /!/ hello everyone! \ni have a 6500 with the kit 16-50mm lens which i like because of its versatility and size. the problem is that my son accidentally dropped the camera and landed on the lens which is now useless. it’s stuck on the open -----> position !!! , slightly bent and the ring doesn’t move. \nto fix it, it would cost about $280 canadian which it’s almost as much as a new one. \n\nmy question for you is which lens to get... i’m thinking between the same 16-50 as it’s quite versatile and small (as i mentioned) but i also know a prime might be better/faster... so i’m also looking to either a 35mm or a 50mm. \n\ni’m not a professional photographer, i mainly use the camera for family pictures and general shots... i’m also not entirely sure about the 35mm equivalency as i don’t have a point of reference to campare to. i know a 50mm is about 80 or 85mm on a 35 but i’m not sure how would that affect my decision on which lens to get. \n\nanyways, after this whole long post, any tips would be appreciated. \ncheers!", "sortedWord": "None", "identifyer": 30990, "year": "2021"}, {"Unnamed: 0": 140151, "autor": "5upralapsarian", "date": 1610243240000, "content": "Is it safe to push/pull on a zoom lens? /!/ I unfortunately didn't lock my Sony 70-350mm lens when I was storing it so I was taking it out of the bag, the lens hood (which was in reverse position) caught the bag and I ended up pulling the zoom out.\n\nI kinda felt bad about it, being a brand new lens and all but then again I've seen people zooming their zoom lens by pulling/pushing on the lens hood so it got me wondering: is it safe to zoom by pushing/pulling a zoom lens?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ku4o7f/is_it_safe_to_pushpull_on_a_zoom_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is it safe to push/pull on a zoom lens? /!/ i unfortunately didn't lock my sony 70-350mm lens when i was storing it so i was taking it out of the bag, the lens hood (which was in reverse -----> position !!! ) caught the bag and i ended up pulling the zoom out.\n\ni kinda felt bad about it, being a brand new lens and all but then again i've seen people zooming their zoom lens by pulling/pushing on the lens hood so it got me wondering: is it safe to zoom by pushing/pulling a zoom lens?", "sortedWord": "None", "identifyer": 31072, "year": "2021"}, {"Unnamed: 0": 140652, "autor": "T_T_Kreischwurst", "date": 1611134222000, "content": "Quick release L-bracket on a6xxx /!/ Does someone use a L-bracket to mount their a6xxx vertically on a tripod? I'm considering buying one because i'm using a legacy telephoto lens on my a6000 but i can't mount that combination vertically because the setup is very front-heavy (800g lens on 344g camera...). If i turn the ballhead of my tripod in vertical position the camera screws itself off of the screw of the release plate. Now i'm wondering if someone else tried to solve this by using a l bracket and can tell me if it works.", "link": "https://www.reddit.com/r/SonyAlpha/comments/l15pb8/quick_release_lbracket_on_a6xxx/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "quick release l-bracket on a6xxx /!/ does someone use a l-bracket to mount their a6xxx vertically on a tripod? i'm considering buying one because i'm using a legacy telephoto lens on my a6000 but i can't mount that combination vertically because the setup is very front-heavy (800g lens on 344g camera...). if i turn the ballhead of my tripod in vertical -----> position !!!  the camera screws itself off of the screw of the release plate. now i'm wondering if someone else tried to solve this by using a l bracket and can tell me if it works.", "sortedWord": "None", "identifyer": 31589, "year": "2021"}, {"Unnamed: 0": 141063, "autor": "danieldflip", "date": 1613956640000, "content": "A7iii won’t turn on, blinking red light /!/ Hey fellow Sony users, I need some help. I have an a7iii that I’ve only had for a year now. I’ve been having trouble and can’t turn on my camera. It has a blinking red light near the memory card slot and black screen whether it’s on the on or off position. Things I’ve done so far:\n\n- removed the battery and used other ones including original Sony batteries\n- removed the SD cards\n- tried to switch modes \n- removed the lens attached \n\nI need serious help since I have a wedding gig this coming weekend and none of the things I’ve tried worked nor Google has any solution or similar problems to this :(", "link": "https://www.reddit.com/r/SonyAlpha/comments/lpbm5m/a7iii_wont_turn_on_blinking_red_light/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7iii won’t turn on, blinking red light /!/ hey fellow sony users, i need some help. i have an a7iii that i’ve only had for a year now. i’ve been having trouble and can’t turn on my camera. it has a blinking red light near the memory card slot and black screen whether it’s on the on or off -----> position !!! . things i’ve done so far:\n\n- removed the battery and used other ones including original sony batteries\n- removed the sd cards\n- tried to switch modes \n- removed the lens attached \n\ni need serious help since i have a wedding gig this coming weekend and none of the things i’ve tried worked nor google has any solution or similar problems to this :(", "sortedWord": "None", "identifyer": 32014, "year": "2021"}, {"Unnamed: 0": 141136, "autor": "jeffreyhyun", "date": 1613883979000, "content": "Is Sony OSS better than Tamron VC as an optical stabilization system? /!/ I'm a new-ish photographer and was playing around with some lenses on an a6500. The subject was a logo on a flat plane perpendicular to the lens in low light. Shooting position was the same and used manual focus.\n\nI got a surprisingly \"sharp\" and \"blur-less\" handheld image at settings which I thought I couldn't (Sony OSS 18-135 f/3.5-5.6 @ 70mm f/5.6 iso100 1/2\"). Thought it was a fluke and took a bunch more and had similar results. I then tried with a Tamron VC 17-70 f/2.8 @ 70mm f/5.6 iso100 1/2\" and every shot was worse with significant blur. Considering the \"good\" pictures are coming from a lower quality lens, I'm left wondering if there's a big difference in the optical stabilization systems.\n\nhttps://preview.redd.it/metkm9o2dri61.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=5f550e6dc61eff6307edc52b97ceafa57fd17da5", "link": "https://www.reddit.com/r/SonyAlpha/comments/lopkpv/is_sony_oss_better_than_tamron_vc_as_an_optical/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is sony oss better than tamron vc as an optical stabilization system? /!/ i'm a new-ish photographer and was playing around with some lenses on an a6500. the subject was a logo on a flat plane perpendicular to the lens in low light. shooting -----> position !!!  was the same and used manual focus.\n\ni got a surprisingly \"sharp\" and \"blur-less\" handheld image at settings which i thought i couldn't (sony oss 18-135 f/3.5-5.6 @ 70mm f/5.6 iso100 1/2\"). thought it was a fluke and took a bunch more and had similar results. i then tried with a tamron vc 17-70 f/2.8 @ 70mm f/5.6 iso100 1/2\" and every shot was worse with significant blur. considering the \"good\" pictures are coming from a lower quality lens, i'm left wondering if there's a big difference in the optical stabilization systems.\n\nhttps://preview.redd.it/metkm9o2dri61.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=5f550e6dc61eff6307edc52b97ceafa57fd17da5", "sortedWord": "None", "identifyer": 32089, "year": "2021"}, {"Unnamed: 0": 141636, "autor": "Stfnoo", "date": 1626199149000, "content": "Wide angle lens suggestions /!/ I'm fairly new to the art of photography and got myself a A6000 a few months ago to start learning and get  a feeling for it.  \nI got myself the FE 50mm 1.8 and 55-210 lenses with which I shot almost daily.  \nHowever I primarily want to do landscape photography  and was looking for a good lens for that.  \nBudget is around 1k € and was eying the 20mm 1.8 G or 24mm 1.4 GM are there better options for my current position?  \n\n\nI know of the 1.5 Crop factor of the APS-C sensor, but will probably upgrade to a A7R down the line", "link": "https://www.reddit.com/r/SonyAlpha/comments/ojl2m9/wide_angle_lens_suggestions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wide angle lens suggestions /!/ i'm fairly new to the art of photography and got myself a a6000 a few months ago to start learning and get  a feeling for it.  \ni got myself the fe 50mm 1.8 and 55-210 lenses with which i shot almost daily.  \nhowever i primarily want to do landscape photography  and was looking for a good lens for that.  \nbudget is around 1k € and was eying the 20mm 1.8 g or 24mm 1.4 gm are there better options for my current -----> position !!! ?  \n\n\ni know of the 1.5 crop factor of the aps-c sensor, but will probably upgrade to a a7r down the line", "sortedWord": "None", "identifyer": 32606, "year": "2021"}, {"Unnamed: 0": 143907, "autor": "inorman", "date": 1622708419000, "content": "The a7C is the best Sony camera design to date. /!/ I love the a7C design. Even already owning an a7III, I actually love the control layout of the a7C. I'd personally say that I like it as much or more than my a7III. There are a few things that particularly stand out. \n\n* It's properly small and light. This is the reason I originally switched from Canon DSLRs to Sony mirrorless back in the days of the first gen a7. Sony's full frame bodies have since increased in size ever since. Finally, we are where I originally wanted full frame mirrorless cameras to be. Also, If I feel like I want a bigger grip for long lenses, I'll can put on an [accessory grip](https://www.reddit.com/r/SonyAlpha/comments/lhd7p8/really_enjoying_the_wooden_grip_on_my_a7c/) or L -bracket, but honestly, the a7C is fine even using it with my Sigma 105mm f/1.4 Art lens. As light as the body is, it's very stiff and solid feeling in the hand. \n* I actually like the EVF. It's smaller than the a7III but it's just as high resolution (which is totally adequate), and its position in the corner is so much better. No more scrunching my nose up against the monitor... I simply love the \"rangefinder-style\" design layout in terms of ergonomics. With a mirrorless camera, there's absolutely no reason that the viewfinder needs to be centered with the lens. Why are modern camera designs trying to mimic the antiquated constraints of DSLR design? This is how a mirrorless camera should be. \n* Lack of a joystick? I've found that I *prefer* the touch screen especially since you can enable the touch screen as a touch pad for Focus point selection while using the EVF. Under Menu&gt;Toolbox (Setup) Tab&gt;Setup3/6&gt;Touch Panel/Pad, if you set to Touch Panel+Pad and then set Touch Pad Settings to Relative Position and Right 1/2, you can use the monitor as a really fast way (arguably faster than the a7III joystick) to move the focus point while looking through the viewfinder. Furthermore, the offset EVF position makes this configuration even more comfortable than if you used the same setting on the a7III, where your nose gets in the way. With the default AF-ON button behavior, this also allows you to instantly define your tracking point for AF-C lock on tracking via the touch screen, making for instantaneous switching between AF-S focusing and AF-C tracking depending on if you're using the shutter half-press or the AF-ON button for focusing. \n* Video AF tracking. This is a *huge* upgrade to the a7III's tracking and the a7III was already damn good. It has dramatically increased my confidence in my camera to maintain focus for a video shots. In order to make this more accessible, I leave touch tracking on by default and I've added the \"Func. of Touch Operation\" menu item to the My Menu in order to make this quicker to select between the\"touch focus\" and \"touch tracking\" settings for being able to use tracking with video or the more traditional focus point selection for stills.\n* Fully articulating screen. Seriously, this should be on every ~~Sony~~ camera body. Low slung shots, high overhead shots, top down shots, selfies, landscape orientation, portrait orientation, vlogging. I'm not sure I need to say more. \n* An extra custom dial mode. Now we get a 3rd custom mode dial setting as opposed to just 2 on the a7III. If you're not already using these on your Sony cameras, you need to spend the time to set them up. I've got each of my 1, 2 and 3 modes set exactly how I prefer to use my camera for 1: main vlog 4K recording, 2: slow motion 1080p60 b-roll, and 3:very slow motion 1080p120 b-roll. \n\nI understand why this body doesn't receive as much love as the a7III / RIV / 1 / 9II / SIII bodies, but I think that in the right hands and with the right configuration it's arguably a more enjoyable design than those cameras. For the price, it's just damn good. For me, it's pretty much better than the a7III in every way. The a7C is the best Sony camera design to date. IMHO.", "link": "https://www.reddit.com/r/SonyAlpha/comments/nr8bsg/the_a7c_is_the_best_sony_camera_design_to_date/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the a7c is the best sony camera design to date. /!/ i love the a7c design. even already owning an a7iii, i actually love the control layout of the a7c. i'd personally say that i like it as much or more than my a7iii. there are a few things that particularly stand out. \n\n* it's properly small and light. this is the reason i originally switched from canon dslrs to sony mirrorless back in the days of the first gen a7. sony's full frame bodies have since increased in size ever since. finally, we are where i originally wanted full frame mirrorless cameras to be. also, if i feel like i want a bigger grip for long lenses, i'll can put on an [accessory grip](https://www.reddit.com/r/sonyalpha/comments/lhd7p8/really_enjoying_the_wooden_grip_on_my_a7c/) or l -bracket, but honestly, the a7c is fine even using it with my sigma 105mm f/1.4 art lens. as light as the body is, it's very stiff and solid feeling in the hand. \n* i actually like the evf. it's smaller than the a7iii but it's just as high resolution (which is totally adequate), and its -----> position !!!  in the corner is so much better. no more scrunching my nose up against the monitor... i simply love the \"rangefinder-style\" design layout in terms of ergonomics. with a mirrorless camera, there's absolutely no reason that the viewfinder needs to be centered with the lens. why are modern camera designs trying to mimic the antiquated constraints of dslr design? this is how a mirrorless camera should be. \n* lack of a joystick? i've found that i *prefer* the touch screen especially since you can enable the touch screen as a touch pad for focus point selection while using the evf. under menu&gt;toolbox (setup) tab&gt;setup3/6&gt;touch panel/pad, if you set to touch panel+pad and then set touch pad settings to relative position and right 1/2, you can use the monitor as a really fast way (arguably faster than the a7iii joystick) to move the focus point while looking through the viewfinder. furthermore, the offset evf position makes this configuration even more comfortable than if you used the same setting on the a7iii, where your nose gets in the way. with the default af-on button behavior, this also allows you to instantly define your tracking point for af-c lock on tracking via the touch screen, making for instantaneous switching between af-s focusing and af-c tracking depending on if you're using the shutter half-press or the af-on button for focusing. \n* video af tracking. this is a *huge* upgrade to the a7iii's tracking and the a7iii was already damn good. it has dramatically increased my confidence in my camera to maintain focus for a video shots. in order to make this more accessible, i leave touch tracking on by default and i've added the \"func. of touch operation\" menu item to the my menu in order to make this quicker to select between the\"touch focus\" and \"touch tracking\" settings for being able to use tracking with video or the more traditional focus point selection for stills.\n* fully articulating screen. seriously, this should be on every ~~sony~~ camera body. low slung shots, high overhead shots, top down shots, selfies, landscape orientation, portrait orientation, vlogging. i'm not sure i need to say more. \n* an extra custom dial mode. now we get a 3rd custom mode dial setting as opposed to just 2 on the a7iii. if you're not already using these on your sony cameras, you need to spend the time to set them up. i've got each of my 1, 2 and 3 modes set exactly how i prefer to use my camera for 1: main vlog 4k recording, 2: slow motion 1080p60 b-roll, and 3:very slow motion 1080p120 b-roll. \n\ni understand why this body doesn't receive as much love as the a7iii / riv / 1 / 9ii / siii bodies, but i think that in the right hands and with the right configuration it's arguably a more enjoyable design than those cameras. for the price, it's just damn good. for me, it's pretty much better than the a7iii in every way. the a7c is the best sony camera design to date. imho.", "sortedWord": "None", "identifyer": 34952, "year": "2021"}, {"Unnamed: 0": 144163, "autor": "Alexa777s", "date": 1621380876000, "content": "How to focus only my face with sony a6600? /!/ Hello, I have a problem with my sony a6600. I have put a shotgun microphone in front of me (visible in the frame) and the camera prefers to focus it instead of focusing on my face (I am recording a video, not photography). I need the camera to focus only on my face. The microphone is positioned about 12 inches closer to the camera than my face. Is there a focus-to-face only function? How can it be activated? (I'm new to cameras of all kinds)\n\n&amp;#x200B;\n\nThanks for the help! :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/nfprka/how_to_focus_only_my_face_with_sony_a6600/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "how to focus only my face with sony a6600? /!/ hello, i have a problem with my sony a6600. i have put a shotgun microphone in front of me (visible in the frame) and the camera prefers to focus it instead of focusing on my face (i am recording a video, not photography). i need the camera to focus only on my face. the microphone is -----> positioned !!!  about 12 inches closer to the camera than my face. is there a focus-to-face only function? how can it be activated? (i'm new to cameras of all kinds)\n\n&amp;#x200b;\n\nthanks for the help! :)", "sortedWord": "None", "identifyer": 35212, "year": "2021"}, {"Unnamed: 0": 144609, "autor": "froyolychee", "date": 1627222797000, "content": "Does Sony automatically take photos in 3:2 aspect ratio regardless? /!/ I am testing out my Sony a6400 to take photos in my makeshift studio. When I opened the photos on my laptop, the photos looked wider, I saw parts of my wall on the left and right side. I was confused because when I took the photos, I carefully positioned and zoomed the camera so that the photos only showed the model and the backdrop - no walls. That is the composition I saw on the live view monitor during the photoshoot and in the playback previews after the photoshoot.\n\n*Processing img jcijh6hc9dd71...*\n\nThen I imported the photos into Lightroom (LR). In the Library preview and Develop preview, I saw that my photos didn't have the extra pixels on the left and right sides, they looked as they did in the camera monitor. However, I noticed there was a crop icon for every photo even though I haven't even edited them yet. I guess LR automatically cropped my photos? So I went to the Develop mode and opened the crop settings and voila, the photos showed the left and right sides (as seen on photo above). When I checked my camera, I found out that I had set my aspect ratio to 16:9 and forgot to change it to 3:2. So I realised when the photos look wider, the aspect ratio is 3:2, and when skinny, it is 16:9. \n\nSo here are my questions:\n\n1. How come Sony recorded my photos in 3:2 even though I set the settings to 16:9? How do I fix this so that if I set it to 16:9, it will be 16:9 anywhere that I open the photos?\n2. How do I stop Lightroom from automatically cropping my photos?\n\nSorry if my explanation seems messy, I have been researching for hours haha. Thank you guys!", "link": "https://www.reddit.com/r/SonyAlpha/comments/orcett/does_sony_automatically_take_photos_in_32_aspect/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "does sony automatically take photos in 3:2 aspect ratio regardless? /!/ i am testing out my sony a6400 to take photos in my makeshift studio. when i opened the photos on my laptop, the photos looked wider, i saw parts of my wall on the left and right side. i was confused because when i took the photos, i carefully -----> positioned !!!  and zoomed the camera so that the photos only showed the model and the backdrop - no walls. that is the composition i saw on the live view monitor during the photoshoot and in the playback previews after the photoshoot.\n\n*processing img jcijh6hc9dd71...*\n\nthen i imported the photos into lightroom (lr). in the library preview and develop preview, i saw that my photos didn't have the extra pixels on the left and right sides, they looked as they did in the camera monitor. however, i noticed there was a crop icon for every photo even though i haven't even edited them yet. i guess lr automatically cropped my photos? so i went to the develop mode and opened the crop settings and voila, the photos showed the left and right sides (as seen on photo above). when i checked my camera, i found out that i had set my aspect ratio to 16:9 and forgot to change it to 3:2. so i realised when the photos look wider, the aspect ratio is 3:2, and when skinny, it is 16:9. \n\nso here are my questions:\n\n1. how come sony recorded my photos in 3:2 even though i set the settings to 16:9? how do i fix this so that if i set it to 16:9, it will be 16:9 anywhere that i open the photos?\n2. how do i stop lightroom from automatically cropping my photos?\n\nsorry if my explanation seems messy, i have been researching for hours haha. thank you guys!", "sortedWord": "None", "identifyer": 35677, "year": "2021"}, {"Unnamed: 0": 145671, "autor": "DeadInFiftyYears", "date": 1633486079000, "content": "Intentionally setting the focal point - not just focal distance /!/ This is particularly applicable to wide-angle photography, when using something like the 12-24GM, where perspective distortion - and the point where it originates from - is very apparent.\n\nAnyone who has any exposure to photography understands the importance of adjusting focal distance.  But beyond that, composition tends to be explained by things like the \"rule of 3rds\" - which works well at emulating human vision tendencies at normal focal lengths such as 35 or 50 mm, but is not really suited to wide angle or telephoto.\n\nOn a normal camera lens - tilt/shift lenses being the exception - the focal point is the center of the capture area at the focal distance.  This is where if you were a human viewing the scene in person, the center of your vision would be at.\n\nIf you can't crop - and again, are not using a T/S lens - this point will always be in the center of the image.  But with cropping, it opens up the possibility to make the focal point the primary consideration when taking the shot, saving composition in terms of where things end up in the final output image for post.\n\nSo instead of taking photos based on how things are composed in the viewfinder, take your photos based on making sure the center of the image is where you want the viewer's focal point to be, and crop as needed afterward.   You can use that focal point to guide the viewer's eyes first to the primary subject, and then - based on the direction that the focal point is shifted from the primary subject - to the next point of interest in the shot.\n\nFor example, say you are taking a photo of someone looking over the edge of a cliff.  Using this technique, you might center the image a couple feet in front of the primary in-focus subject in the direction they are looking, and potentially even tilt the camera to emulate how the subject is looking downward.\n\nAt this point, you don't care about where that puts the subject in the shot composition-wise - only that you end up with enough capture area to include everything you'll want in the final image.  Then in post, you level the image to counteract any tilt you applied when taking the shot, and crop most of it away on the side the subject isn't looking, to place the subject in an appropriate position in the frame and generate the desired composition.\n\nWhat you're left with is an image that first draws attention to the corner where the primary subject resides in the final composition, but then will also draw attention afterward to what the subject is looking at.  Most people won't be able to tell why the image is engaging, just that it \"feels\" interesting.\n\nThis is also a very natural technique to apply to wide-angle, as it emulates human vision, in the scenario where you are looking at something, but then shift to paying attention to something in your peripheral vision without changing what you're directly looking at.\n\nI hope that I am not going to somehow talk myself into buying a high-res body at this point - I just put in an order for the 100-400GM lens - but would welcome something like a 100MP sensor which would allow for placing the focal point in any corner of the frame and still ending up with at least a 25MP image after cropping.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q2avnn/intentionally_setting_the_focal_point_not_just/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "intentionally setting the focal point - not just focal distance /!/ this is particularly applicable to wide-angle photography, when using something like the 12-24gm, where perspective distortion - and the point where it originates from - is very apparent.\n\nanyone who has any exposure to photography understands the importance of adjusting focal distance.  but beyond that, composition tends to be explained by things like the \"rule of 3rds\" - which works well at emulating human vision tendencies at normal focal lengths such as 35 or 50 mm, but is not really suited to wide angle or telephoto.\n\non a normal camera lens - tilt/shift lenses being the exception - the focal point is the center of the capture area at the focal distance.  this is where if you were a human viewing the scene in person, the center of your vision would be at.\n\nif you can't crop - and again, are not using a t/s lens - this point will always be in the center of the image.  but with cropping, it opens up the possibility to make the focal point the primary consideration when taking the shot, saving composition in terms of where things end up in the final output image for post.\n\nso instead of taking photos based on how things are composed in the viewfinder, take your photos based on making sure the center of the image is where you want the viewer's focal point to be, and crop as needed afterward.   you can use that focal point to guide the viewer's eyes first to the primary subject, and then - based on the direction that the focal point is shifted from the primary subject - to the next point of interest in the shot.\n\nfor example, say you are taking a photo of someone looking over the edge of a cliff.  using this technique, you might center the image a couple feet in front of the primary in-focus subject in the direction they are looking, and potentially even tilt the camera to emulate how the subject is looking downward.\n\nat this point, you don't care about where that puts the subject in the shot composition-wise - only that you end up with enough capture area to include everything you'll want in the final image.  then in post, you level the image to counteract any tilt you applied when taking the shot, and crop most of it away on the side the subject isn't looking, to place the subject in an appropriate -----> position !!!  in the frame and generate the desired composition.\n\nwhat you're left with is an image that first draws attention to the corner where the primary subject resides in the final composition, but then will also draw attention afterward to what the subject is looking at.  most people won't be able to tell why the image is engaging, just that it \"feels\" interesting.\n\nthis is also a very natural technique to apply to wide-angle, as it emulates human vision, in the scenario where you are looking at something, but then shift to paying attention to something in your peripheral vision without changing what you're directly looking at.\n\ni hope that i am not going to somehow talk myself into buying a high-res body at this point - i just put in an order for the 100-400gm lens - but would welcome something like a 100mp sensor which would allow for placing the focal point in any corner of the frame and still ending up with at least a 25mp image after cropping.", "sortedWord": "None", "identifyer": 36789, "year": "2021"}, {"Unnamed: 0": 146773, "autor": "reptur1", "date": 1611524149000, "content": "Running an A7s iii through proxy? /!/ What’s poppin home slice.\n\nI’m looking to upgrade from a 6400, I REALLY like the look of the A7s iii spec wise, and everything I’ve seen just looks superb. \n\nI keep hearing that if you’re upgrading to the A7s iii for video, then you’ll probably have to upgrade the rest of your kit as well. \n\nI’m running the current entry level 16” MBP with FCPX. Does anyone have any thoughts or experience running media through the proxy setting, or is this just a bad idea?\n\nI’m not in a position to upgrade my Mac, so if this will be a bad way to go, is the A7 iii still a good choice in 2021.\n\nThanks peeps!", "link": "https://www.reddit.com/r/SonyAlpha/comments/l488p3/running_an_a7s_iii_through_proxy/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "running an a7s iii through proxy? /!/ what’s poppin home slice.\n\ni’m looking to upgrade from a 6400, i really like the look of the a7s iii spec wise, and everything i’ve seen just looks superb. \n\ni keep hearing that if you’re upgrading to the a7s iii for video, then you’ll probably have to upgrade the rest of your kit as well. \n\ni’m running the current entry level 16” mbp with fcpx. does anyone have any thoughts or experience running media through the proxy setting, or is this just a bad idea?\n\ni’m not in a -----> position !!!  to upgrade my mac, so if this will be a bad way to go, is the a7 iii still a good choice in 2021.\n\nthanks peeps!", "sortedWord": "None", "identifyer": 37935, "year": "2021"}, {"Unnamed: 0": 148722, "autor": "mungoshearer2020", "date": 1630888131000, "content": "Another question about the Sony A7iii /!/ I know now from my previous question that you can set the iso to the control dial, but now I'm wondering if you set the aperture to the control dial (I'm kind of used to that position) can the iso be set the back dial and shutter speed on the front dial? This question might seem silly but I just wanted to know, thanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pioq36/another_question_about_the_sony_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "another question about the sony a7iii /!/ i know now from my previous question that you can set the iso to the control dial, but now i'm wondering if you set the aperture to the control dial (i'm kind of used to that -----> position !!! ) can the iso be set the back dial and shutter speed on the front dial? this question might seem silly but i just wanted to know, thanks in advance.", "sortedWord": "None", "identifyer": 39951, "year": "2021"}, {"Unnamed: 0": 150776, "autor": "dunghole", "date": 1621231319000, "content": "Currently have a900. Nervous about updating to a7iii. /!/ Obviously I’ve had my camera for a long time. It still works fine.\n\nIt doesn’t do everything I want it to. And it’s huge.\n\nI’m looking to upgrade, but I’m concerned about getting one of the new cameras. There’s the stigma around new tech not being built to last.. getting the most bang for my buck..\n\nAnyone else been in a similar position?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ne88q5/currently_have_a900_nervous_about_updating_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "currently have a900. nervous about updating to a7iii. /!/ obviously i’ve had my camera for a long time. it still works fine.\n\nit doesn’t do everything i want it to. and it’s huge.\n\ni’m looking to upgrade, but i’m concerned about getting one of the new cameras. there’s the stigma around new tech not being built to last.. getting the most bang for my buck..\n\nanyone else been in a similar -----> position !!! ?", "sortedWord": "None", "identifyer": 42088, "year": "2021"}, {"Unnamed: 0": 151819, "autor": "joelovescash", "date": 1627321760000, "content": "A7Riii shutter repair options (camera error) /!/ My A7Riii is at 100k and the shutter has started to \"stick\", ie the dreaded camera error message pops up frequently and I have to restart the camera. The shutter will get stuck in the down position and I have to give it a little push with my finger to unstick it. I've been reduced to shooting e-shutter only. However, sometimes it just decides to work, and will do so without issue for a couple hundred shots.\n\nI'm torn on whether to send in the camera, which I've been quoted around $400 for a shutter replacement, or just buy the part online and do it myself.\n\nIs it possible I just need to clean the old shutter and it would work fine? Since the shutter isn't completely out of commission, it just frequently jams.", "link": "https://www.reddit.com/r/SonyAlpha/comments/os40wl/a7riii_shutter_repair_options_camera_error/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a7riii shutter repair options (camera error) /!/ my a7riii is at 100k and the shutter has started to \"stick\", ie the dreaded camera error message pops up frequently and i have to restart the camera. the shutter will get stuck in the down -----> position !!!  and i have to give it a little push with my finger to unstick it. i've been reduced to shooting e-shutter only. however, sometimes it just decides to work, and will do so without issue for a couple hundred shots.\n\ni'm torn on whether to send in the camera, which i've been quoted around $400 for a shutter replacement, or just buy the part online and do it myself.\n\nis it possible i just need to clean the old shutter and it would work fine? since the shutter isn't completely out of commission, it just frequently jams.", "sortedWord": "None", "identifyer": 43167, "year": "2021"}], "name": "positionSonyAlpha2021"}