{"interestingcomments": [{"Unnamed: 0": 133969, "autor": "Caphenning", "date": 1617318460000, "content": "Seeking advice on which Alpha body... /!/ Good day all &amp; TIA. So long story slightly less long, after selling off my Nikon 400-2.8 EDAF after a neck surgery left me incapable of carrying it, I was really missing having a good 400mm for birds and wildlife, plus architectural details. So while my GF stopped into a camera shop in Amsterdam for batteries, I spotted the 70-400 4/5.6 SSM G series. So I checked it out and it seemed light enough to give it a try, hoping that the image stabilization would make up for the couple stops lost light. Not sure it would work out, I asked the guy what the cheapest body I could buy for that lens was, and was sold an a33.\n\nTo say I have been very pleased with it would be an understatement, it really has been great, and the image stabilization is worth more than the 2 stops in the low light end, and with 400mm, the depth of field difference between 2.8 and 5.6 is barely noticeable.\n\nThe lens is still as excellent as day 1, but the body technology has come a long way, and I’d like to take advantage of some of that. I’m not a pro photographer anymore, and my cameras aren’t making money, so spending thousands on a body isn’t going to happen. So given a budget of $750-$900 which body would you recommend, emphasis on adding video capabilities?\n\nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/mi7g1j/seeking_advice_on_which_alpha_body/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "seeking advice on which alpha body... /!/ good day all &amp; tia. so long story slightly less long, after selling off my nikon 400-2.8 edaf after a neck surgery left me incapable of carrying it, i was really missing having a good 400mm for birds and wildlife, plus architectural details. so while my gf stopped into a camera shop in amsterdam for batteries, i -----> spotted !!!  the 70-400 4/5.6 ssm g series. so i checked it out and it seemed light enough to give it a try, hoping that the image stabilization would make up for the couple stops lost light. not sure it would work out, i asked the guy what the cheapest body i could buy for that lens was, and was sold an a33.\n\nto say i have been very pleased with it would be an understatement, it really has been great, and the image stabilization is worth more than the 2 stops in the low light end, and with 400mm, the depth of field difference between 2.8 and 5.6 is barely noticeable.\n\nthe lens is still as excellent as day 1, but the body technology has come a long way, and i’d like to take advantage of some of that. i’m not a pro photographer anymore, and my cameras aren’t making money, so spending thousands on a body isn’t going to happen. so given a budget of $750-$900 which body would you recommend, emphasis on adding video capabilities?\n\nthanks", "sortedWord": "None", "identifyer": 24700, "year": "2021"}, {"Unnamed: 0": 134045, "autor": "Reynoodle_at", "date": 1617231645000, "content": "Fav spot of Vienna main station. Sony A7III Tamron 28-75 mm F/2.8Di III RXD", "link": "https://www.reddit.com/r/SonyAlpha/comments/mhhzu6/fav_spot_of_vienna_main_station_sony_a7iii_tamron/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fav -----> spot !!!  of vienna main station. sony a7iii tamron 28-75 mm f/2.8di iii rxd", "sortedWord": "None", "identifyer": 24779, "year": "2021"}, {"Unnamed: 0": 134107, "autor": "Someguywhomakething", "date": 1612034069000, "content": "Coffee Spot / / a6300 x Minitar 32mm f2.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/l8t5nn/coffee_spot_a6300_x_minitar_32mm_f28/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "coffee -----> spot !!!  / / a6300 x minitar 32mm f2.8", "sortedWord": "None", "identifyer": 24842, "year": "2021"}, {"Unnamed: 0": 134301, "autor": "marklopezzz", "date": 1619887911000, "content": "It’s always fun coming up with shots on the spot. Sony A7C", "link": "https://www.reddit.com/r/SonyAlpha/comments/n2m8sk/its_always_fun_coming_up_with_shots_on_the_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it’s always fun coming up with shots on the -----> spot !!! . sony a7c", "sortedWord": "None", "identifyer": 25040, "year": "2021"}, {"Unnamed: 0": 134479, "autor": "BRAVEHEART277", "date": 1625169004000, "content": "Spotted sandpiper, a7iii, Sigma 100-400 DG DN", "link": "https://www.reddit.com/r/SonyAlpha/comments/obto2b/spotted_sandpiper_a7iii_sigma_100400_dg_dn/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  sandpiper, a7iii, sigma 100-400 dg dn", "sortedWord": "None", "identifyer": 25221, "year": "2021"}, {"Unnamed: 0": 134694, "autor": "dirtyyd94", "date": 1630377988000, "content": "Keeping the sensor dust-free /!/ I'm coming from shooting with film cameras and it's been bothering me how easy it is to ruin a picture with a mere speck of dust on the sensor. I've taken pictures with my A7iii, only to realize later that there is a small dark spot somewhere in the frame on every picture taken during that session. I'm mainly a prime shooter, so I do find myself changing lenses quite frequently. I assume this isn't so much a problem on mirrored digital cameras as the mirror blocks the sensor before one engages the shutter. \n\n&amp;#x200B;\n\nIs there any way to avoid this pitfall? I like mirrorless for its decreased weight, but I'm finding the blatant exposure to be annoying.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pex6cn/keeping_the_sensor_dustfree/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "keeping the sensor dust-free /!/ i'm coming from shooting with film cameras and it's been bothering me how easy it is to ruin a picture with a mere speck of dust on the sensor. i've taken pictures with my a7iii, only to realize later that there is a small dark -----> spot !!!  somewhere in the frame on every picture taken during that session. i'm mainly a prime shooter, so i do find myself changing lenses quite frequently. i assume this isn't so much a problem on mirrored digital cameras as the mirror blocks the sensor before one engages the shutter. \n\n&amp;#x200b;\n\nis there any way to avoid this pitfall? i like mirrorless for its decreased weight, but i'm finding the blatant exposure to be annoying.", "sortedWord": "None", "identifyer": 25442, "year": "2021"}, {"Unnamed: 0": 134741, "autor": "Fox_Intoxx", "date": 1633077885000, "content": "A7iii + Sony 85mm f/1.8 /!/ Tell me which one you like the most.\n\n&amp;#x200B;\n\n(The bikes are not very clean, we did ride for 1 hour before arriving on the spot)", "link": "https://www.reddit.com/r/SonyAlpha/comments/pz3vsp/a7iii_sony_85mm_f18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii + sony 85mm f/1.8 /!/ tell me which one you like the most.\n\n&amp;#x200b;\n\n(the bikes are not very clean, we did ride for 1 hour before arriving on the -----> spot !!! )", "sortedWord": "None", "identifyer": 25490, "year": "2021"}, {"Unnamed: 0": 134819, "autor": "Picklesadog", "date": 1632958282000, "content": "Spot the Kayak! Island of Kauai - a7iii w/Sony 20mm g", "link": "https://www.reddit.com/r/SonyAlpha/comments/py7fht/spot_the_kayak_island_of_kauai_a7iii_wsony_20mm_g/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  the kayak! island of kauai - a7iii w/sony 20mm g", "sortedWord": "None", "identifyer": 25569, "year": "2021"}, {"Unnamed: 0": 134874, "autor": "gwebby_gotnochill", "date": 1635683185000, "content": "Indian Spotted Eagle, A6400 + 18-135mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/qjogm3/indian_spotted_eagle_a6400_18135mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "indian -----> spotted !!!  eagle, a6400 + 18-135mm", "sortedWord": "None", "identifyer": 25626, "year": "2021"}, {"Unnamed: 0": 134930, "autor": "Alexa777s", "date": 1615965290000, "content": "Focus and metering with a6600, video project. /!/ Hello. I would like to know what kind of focus and light metering should I use for my video project with sony a6600 (I am new to cameras and especially sony). I attached an image of my recording. I am standing at the intersection of a third of the plane most of the time, only sometimes I move to the sides or back a little, so I need the focus to follow me at those times. I want to achieve something like what appears in the screenshot that I left. The background that is black (I have a black cloth) and that only my face and my torso are well exposed. I don't know which focus mode I should use or what kind of light metering. I made this recording with continuous auto focus, with priority on the face, and in tracking: wide mode, with metering of highlights, and I linked the metering to the focus. Would another focus and metering setup be better? Spot metering, for example? I know that a center type of focus will not do, because the light metering would overexpose my face, since I am in the third. I tested the spot by aiming my face, but it still overexposes. I'm doing something wrong, and only the high-light metering allows a correct exposure of my face. However, I would like to know your opinions, because there may be a better way to do it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jas6sqpvgjn61.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=714801a2aa5d93b8f7844bd4a0a07f2b33121ebe\n\nThanks for the help.", "link": "https://www.reddit.com/r/SonyAlpha/comments/m6ungd/focus_and_metering_with_a6600_video_project/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focus and metering with a6600, video project. /!/ hello. i would like to know what kind of focus and light metering should i use for my video project with sony a6600 (i am new to cameras and especially sony). i attached an image of my recording. i am standing at the intersection of a third of the plane most of the time, only sometimes i move to the sides or back a little, so i need the focus to follow me at those times. i want to achieve something like what appears in the screenshot that i left. the background that is black (i have a black cloth) and that only my face and my torso are well exposed. i don't know which focus mode i should use or what kind of light metering. i made this recording with continuous auto focus, with priority on the face, and in tracking: wide mode, with metering of highlights, and i linked the metering to the focus. would another focus and metering setup be better? -----> spot !!!  metering, for example? i know that a center type of focus will not do, because the light metering would overexpose my face, since i am in the third. i tested the spot by aiming my face, but it still overexposes. i'm doing something wrong, and only the high-light metering allows a correct exposure of my face. however, i would like to know your opinions, because there may be a better way to do it.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/jas6sqpvgjn61.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=714801a2aa5d93b8f7844bd4a0a07f2b33121ebe\n\nthanks for the help.", "sortedWord": "None", "identifyer": 25682, "year": "2021"}, {"Unnamed: 0": 135520, "autor": "AndyD89", "date": 1618579666000, "content": "Maserati headlight | SONY A7 III+Samyang 35 mm f/ 1.8 | Can you spot me ?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ms34wy/maserati_headlight_sony_a7_iiisamyang_35_mm_f_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "maserati headlight | sony a7 iii+samyang 35 mm f/ 1.8 | can you -----> spot !!!  me ?", "sortedWord": "None", "identifyer": 26288, "year": "2021"}, {"Unnamed: 0": 135702, "autor": "HeftyHideaway99", "date": 1619739277000, "content": "Big spot on sensor- how can I remove the spot in (any) post processing? /!/ Title says it all. Big glaring floating spot in an important video from a speck on the sensor. Can't I just somehow \"select all\" and \"heal\" that one exact spot? If there is a software that does this, pluze help, my Sony video peeps!", "link": "https://www.reddit.com/r/SonyAlpha/comments/n1hbqb/big_spot_on_sensor_how_can_i_remove_the_spot_in/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "big -----> spot !!!  on sensor- how can i remove the spot in (any) post processing? /!/ title says it all. big glaring floating spot in an important video from a speck on the sensor. can't i just somehow \"select all\" and \"heal\" that one exact spot? if there is a software that does this, pluze help, my sony video peeps!", "sortedWord": "None", "identifyer": 26475, "year": "2021"}, {"Unnamed: 0": 136116, "autor": "ThisCryptographer745", "date": 1634326491000, "content": "Problems Exposing Skin Tones For Self-Directed Videos? /!/ Hello,\n\nI'm using a Sony A7iii to film workout videos of myself. As there is no flip screen on this camera I'm unable to see if my skin is correctly exposed until after the shot which can sometimes lead to overexposure and the highlights getting blowin out.  \n\n\nIdeally, I would have someone else stand in my place while I get it right from behind the camera however this is not possible as I film solo. \n\nIs there anything I can use to take the place of a person to allow me to get the exposure correct (or close enough) from behind the camera? For example, placing a piece of paper in the spot where I will be filming and exposing correctly based on this? Or is there simply nothing that can replace human skin?  \n\n\nThanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q8vqav/problems_exposing_skin_tones_for_selfdirected/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "problems exposing skin tones for self-directed videos? /!/ hello,\n\ni'm using a sony a7iii to film workout videos of myself. as there is no flip screen on this camera i'm unable to see if my skin is correctly exposed until after the shot which can sometimes lead to overexposure and the highlights getting blowin out.  \n\n\nideally, i would have someone else stand in my place while i get it right from behind the camera however this is not possible as i film solo. \n\nis there anything i can use to take the place of a person to allow me to get the exposure correct (or close enough) from behind the camera? for example, placing a piece of paper in the -----> spot !!!  where i will be filming and exposing correctly based on this? or is there simply nothing that can replace human skin?  \n\n\nthanks in advance.", "sortedWord": "None", "identifyer": 26895, "year": "2021"}, {"Unnamed: 0": 136189, "autor": "rogerwilco2000", "date": 1634233469000, "content": "S-Log3 color differences between cameras /!/ I have an A7siii and an A7C. Using an identical lens, with identical default presets of PP8 (S-Log3/S-Gamut3.Cine color mode), and the identical Sony S-Log3 &gt; 709 production LUT, the color from the A7Siii is almost spot on and the color from the A7C has an intense red (not magenta) cast which shows up as a streak in the highlights in a vectorscope.\n\nI know the A7C is 8-bit but AFAIK this would not affect a dramatic color cast as much as contribute to banding under some circumstances.\n\nUngraded, the color looks similar enough, in either log or a non-log gamma.\n\nI can manually grade the A7C footage to match the A7Siii, or close enough, but what I don't know is what is contributing to the color shift? Is the science between the two cameras that much different, or the default Picture Profile settings are not equal, or is the LUT not compatible between the cameras, or something else?\n\nThanks for any advice.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q84snm/slog3_color_differences_between_cameras/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "s-log3 color differences between cameras /!/ i have an a7siii and an a7c. using an identical lens, with identical default presets of pp8 (s-log3/s-gamut3.cine color mode), and the identical sony s-log3 &gt; 709 production lut, the color from the a7siii is almost -----> spot !!!  on and the color from the a7c has an intense red (not magenta) cast which shows up as a streak in the highlights in a vectorscope.\n\ni know the a7c is 8-bit but afaik this would not affect a dramatic color cast as much as contribute to banding under some circumstances.\n\nungraded, the color looks similar enough, in either log or a non-log gamma.\n\ni can manually grade the a7c footage to match the a7siii, or close enough, but what i don't know is what is contributing to the color shift? is the science between the two cameras that much different, or the default picture profile settings are not equal, or is the lut not compatible between the cameras, or something else?\n\nthanks for any advice.", "sortedWord": "None", "identifyer": 26969, "year": "2021"}, {"Unnamed: 0": 137079, "autor": "devctxt", "date": 1614184442000, "content": "I have a heavy doubt about my decision /!/ Guys , story time , today , i bought a6500 and to be honest , i want happy with my choice considering i did my research on the a6400 that i targeted , now im having breakdown and dont know what to do , i scratched up a tiny spots on the body and i hope i can downgrade to a6400 for the flip screen and the real time tracking af , if you know any solution , just comment down below 😔😞", "link": "https://www.reddit.com/r/SonyAlpha/comments/lrgyej/i_have_a_heavy_doubt_about_my_decision/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i have a heavy doubt about my decision /!/ guys , story time , today , i bought a6500 and to be honest , i want happy with my choice considering i did my research on the a6400 that i targeted , now im having breakdown and dont know what to do , i scratched up a tiny -----> spots !!!  on the body and i hope i can downgrade to a6400 for the flip screen and the real time tracking af , if you know any solution , just comment down below 😔😞", "sortedWord": "None", "identifyer": 27895, "year": "2021"}, {"Unnamed: 0": 137444, "autor": "JamalSteve", "date": 1613662184000, "content": "Apparently A7siii gets Cinetone now with a firmware update! I followed the link in the article and it still says firmware version 1.02 - not sure where to go to get the download if I'm not in the right spot...(link below) /!/ [https://www.sonyalpharumors.com/rumor-sony-a1-cine-colour-profile-will-come-for-the-a7siii-via-future-firmware-update/](https://www.sonyalpharumors.com/rumor-sony-a1-cine-colour-profile-will-come-for-the-a7siii-via-future-firmware-update/)\n\n&amp;#x200B;\n\nI'm in the US, if that matters, but I checked the UK link in the article and didn't see it either...", "link": "https://www.reddit.com/r/SonyAlpha/comments/lmpa7l/apparently_a7siii_gets_cinetone_now_with_a/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "apparently a7siii gets cinetone now with a firmware update! i followed the link in the article and it still says firmware version 1.02 - not sure where to go to get the download if i'm not in the right -----> spot !!! ...(link below) /!/ [https://www.sonyalpharumors.com/rumor-sony-a1-cine-colour-profile-will-come-for-the-a7siii-via-future-firmware-update/](https://www.sonyalpharumors.com/rumor-sony-a1-cine-colour-profile-will-come-for-the-a7siii-via-future-firmware-update/)\n\n&amp;#x200b;\n\ni'm in the us, if that matters, but i checked the uk link in the article and didn't see it either...", "sortedWord": "None", "identifyer": 28273, "year": "2021"}, {"Unnamed: 0": 137461, "autor": "Jaggu_D", "date": 1613625509000, "content": "Is my lens damaged? Is it repairable? /!/ I own the sony 18-105 f4 G lens for about an year. I recently noticed a spot damaged and spiderwebbing to an extent on the inner side of the top element glass of the lens. \n[photo of lens](https://imgur.com/sEcfQQE) \nI don't even if its a crack. Please help me understand. \n\nI also went a shoot after noticing the same. And the images don't seem to differ unless there is a flare coming from extreme angles which is like 1 out of 1000 times. \n\nShould i send it in for repair? Is it repairable?\n\nPS. Warranty available.", "link": "https://www.reddit.com/r/SonyAlpha/comments/lmekul/is_my_lens_damaged_is_it_repairable/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is my lens damaged? is it repairable? /!/ i own the sony 18-105 f4 g lens for about an year. i recently noticed a -----> spot !!!  damaged and spiderwebbing to an extent on the inner side of the top element glass of the lens. \n[photo of lens](https://imgur.com/secfqqe) \ni don't even if its a crack. please help me understand. \n\ni also went a shoot after noticing the same. and the images don't seem to differ unless there is a flare coming from extreme angles which is like 1 out of 1000 times. \n\nshould i send it in for repair? is it repairable?\n\nps. warranty available.", "sortedWord": "None", "identifyer": 28290, "year": "2021"}, {"Unnamed: 0": 137617, "autor": "ediav2", "date": 1635571947000, "content": "Sony A6300 focus point stuck? /!/ I’ve had my a6300 for a good couple years and recently I’ve been experiencing some issues with the focus point and the shutter button. I have the focus set to flexible spot and sometimes when I shoot, the box stays green as if I’m half pressing the shutter button even when I’m not. I am therefore locked out of all my other controls except for fully pressing the button and taking a photo. I am unable to get it to unlock as half pressing the shutter doesn’t do anything but sometimes it fixes itself but then it comes back and it’s quite frustrating.  Does the shutter button need repairing or is it something more simple?", "link": "https://www.reddit.com/r/SonyAlpha/comments/qiuubt/sony_a6300_focus_point_stuck/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6300 focus point stuck? /!/ i’ve had my a6300 for a good couple years and recently i’ve been experiencing some issues with the focus point and the shutter button. i have the focus set to flexible -----> spot !!!  and sometimes when i shoot, the box stays green as if i’m half pressing the shutter button even when i’m not. i am therefore locked out of all my other controls except for fully pressing the button and taking a photo. i am unable to get it to unlock as half pressing the shutter doesn’t do anything but sometimes it fixes itself but then it comes back and it’s quite frustrating.  does the shutter button need repairing or is it something more simple?", "sortedWord": "None", "identifyer": 28453, "year": "2021"}, {"Unnamed: 0": 137826, "autor": "psykai69", "date": 1626356347000, "content": "i found these red spots in my pictures, what might be the issue? help.", "link": "https://www.reddit.com/r/SonyAlpha/comments/okt14j/i_found_these_red_spots_in_my_pictures_what_might/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i found these red -----> spots !!!  in my pictures, what might be the issue? help.", "sortedWord": "None", "identifyer": 28672, "year": "2021"}, {"Unnamed: 0": 137926, "autor": "MrBombasticc", "date": 1631625287000, "content": "I lost a Sony Alpha 1 to a scam PSA /!/ I’m writing this post because I was recently a victim of a PayPal scam and don’t wish to see what happened to me happen to others. \n\nI was recently selling my Sony Alpha 1 as I’d just changed career paths and didn’t require such a beast of a camera. \n\nI had the idea in my mind that as a seller I couldn’t fall victim to a scam. After all, I wasn’t the one sending money. \n\nI had received an offer through eBay and the buyer asked to pay through PayPal. I thought this would be fine. What could go wrong?\nI received an email from “PayPal” telling me that I’d received a payment and that the funds would become available once I provided tracking information. I posted the camera thinking I’d received  £6030. \n\nThe morning after I posted the parcel, something clicked in my head and I checked the email and something didn’t seem right. I contacted PayPal and they told me that the transaction ID was associated with a payment in July to someone I’d never heard of. I’d been receiving emails that were made to look like they were from PayPal. I attempted to stop the parcel however Royal Mail offered absolutely no help despite giving them 4 hours notice before it was delivered. \n\nAt the end of it I’m stuck in the process of trying to get the authorities to actually deal with the issue. I’m out 6k and sick knowing what a huge mistake I made. \n\nI would consider myself someone that is vigilant of scams and not someone that would be susceptible to one. But I did. \n\nI hope that anyone seeing this will take more precautions than I did. \n\n-If a payment doesn’t appear in your account check everything. Don’t take your email as gospel. Emails can easily be faked. \n\n-Check to make sure the email address you received an email from is a genuine email address  of the organisation. \n\nIt’s not hard to spot a scam but it is easy to become complacent. It’s never worth not being cautious.", "link": "https://www.reddit.com/r/SonyAlpha/comments/po2jo2/i_lost_a_sony_alpha_1_to_a_scam_psa/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i lost a sony alpha 1 to a scam psa /!/ i’m writing this post because i was recently a victim of a paypal scam and don’t wish to see what happened to me happen to others. \n\ni was recently selling my sony alpha 1 as i’d just changed career paths and didn’t require such a beast of a camera. \n\ni had the idea in my mind that as a seller i couldn’t fall victim to a scam. after all, i wasn’t the one sending money. \n\ni had received an offer through ebay and the buyer asked to pay through paypal. i thought this would be fine. what could go wrong?\ni received an email from “paypal” telling me that i’d received a payment and that the funds would become available once i provided tracking information. i posted the camera thinking i’d received  £6030. \n\nthe morning after i posted the parcel, something clicked in my head and i checked the email and something didn’t seem right. i contacted paypal and they told me that the transaction id was associated with a payment in july to someone i’d never heard of. i’d been receiving emails that were made to look like they were from paypal. i attempted to stop the parcel however royal mail offered absolutely no help despite giving them 4 hours notice before it was delivered. \n\nat the end of it i’m stuck in the process of trying to get the authorities to actually deal with the issue. i’m out 6k and sick knowing what a huge mistake i made. \n\ni would consider myself someone that is vigilant of scams and not someone that would be susceptible to one. but i did. \n\ni hope that anyone seeing this will take more precautions than i did. \n\n-if a payment doesn’t appear in your account check everything. don’t take your email as gospel. emails can easily be faked. \n\n-check to make sure the email address you received an email from is a genuine email address  of the organisation. \n\nit’s not hard to -----> spot !!!  a scam but it is easy to become complacent. it’s never worth not being cautious.", "sortedWord": "None", "identifyer": 28776, "year": "2021"}, {"Unnamed: 0": 138005, "autor": "Patient404", "date": 1618423876000, "content": "Spotted at nikon corp", "link": "https://www.reddit.com/r/SonyAlpha/comments/mqwe3z/spotted_at_nikon_corp/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  at nikon corp", "sortedWord": "None", "identifyer": 28860, "year": "2021"}, {"Unnamed: 0": 138335, "autor": "Groovygranny121760", "date": 1622243738000, "content": "Spot focus /!/ Does anyone use spot focus?", "link": "https://www.reddit.com/r/SonyAlpha/comments/nnaa06/spot_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  focus /!/ does anyone use spot focus?", "sortedWord": "None", "identifyer": 29199, "year": "2021"}, {"Unnamed: 0": 138447, "autor": "chairlifting", "date": 1632261932000, "content": "Sony 16-35mm f/2.8 GM at 35mm /!/ I love using this lens for landscape photography, but how does it compare at 35mm instead of using a prime lens? Is it good for portrait shots at 35mm and if so, what is the aperture sweet spot at that focal length?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pstce0/sony_1635mm_f28_gm_at_35mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony 16-35mm f/2.8 gm at 35mm /!/ i love using this lens for landscape photography, but how does it compare at 35mm instead of using a prime lens? is it good for portrait shots at 35mm and if so, what is the aperture sweet -----> spot !!!  at that focal length?", "sortedWord": "None", "identifyer": 29313, "year": "2021"}, {"Unnamed: 0": 139603, "autor": "mixtick", "date": 1609591278000, "content": "Using my SonyA7III at best spot in Tokyo.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kowvs9/using_my_sonya7iii_at_best_spot_in_tokyo/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "using my sonya7iii at best -----> spot !!!  in tokyo.", "sortedWord": "None", "identifyer": 30505, "year": "2021"}, {"Unnamed: 0": 139607, "autor": "undegaard", "date": 1609585344000, "content": "[A7 III 28mm f2.8] Three views from the same spot", "link": "https://www.reddit.com/r/SonyAlpha/comments/kovqjv/a7_iii_28mm_f28_three_views_from_the_same_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[a7 iii 28mm f2.8] three views from the same -----> spot !!! ", "sortedWord": "None", "identifyer": 30509, "year": "2021"}, {"Unnamed: 0": 139791, "autor": "Kyler182", "date": 1612287656000, "content": "Made it to one of the darkest spots in Colorado (Sony A7iii tamron 17-28)", "link": "https://www.reddit.com/r/SonyAlpha/comments/lb1ii7/made_it_to_one_of_the_darkest_spots_in_colorado/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "made it to one of the darkest -----> spots !!!  in colorado (sony a7iii tamron 17-28)", "sortedWord": "None", "identifyer": 30698, "year": "2021"}, {"Unnamed: 0": 140038, "autor": "ajuulz", "date": 1609897822000, "content": "At her favorite spot. A7III + Sony 50mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/krdguq/at_her_favorite_spot_a7iii_sony_50mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "at her favorite -----> spot !!! . a7iii + sony 50mm 1.8", "sortedWord": "None", "identifyer": 30955, "year": "2021"}, {"Unnamed: 0": 140069, "autor": "optile1", "date": 1609873527000, "content": "[a7RIII] What are the dancing green dots and why are gone with native lenses? /!/ I'm using an a7RIII with one Sony lens, one adapted Canon lens, and one adapted Sigma lens.  I use Af-C and usually flexible spot (small).  When I use my adapted lenses, I see the little green squares dancing around when I autofocus.  When I use my Sony lens, I don't see the green squares dancing around.  Are these the phase detect points lighting up?\n\n&amp;#x200B;\n\n(Sigma MC-11 + Sigma EX 50 mm f/1.4) = green squares\n\n(Sigma MC-11 + Canon 400 mm f/5.6 L) = green squares\n\n(Sony 200-600 mm f/5.6-6.3) = solid green box w/out green squares", "link": "https://www.reddit.com/r/SonyAlpha/comments/kr56yw/a7riii_what_are_the_dancing_green_dots_and_why/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[a7riii] what are the dancing green dots and why are gone with native lenses? /!/ i'm using an a7riii with one sony lens, one adapted canon lens, and one adapted sigma lens.  i use af-c and usually flexible -----> spot !!!  (small).  when i use my adapted lenses, i see the little green squares dancing around when i autofocus.  when i use my sony lens, i don't see the green squares dancing around.  are these the phase detect points lighting up?\n\n&amp;#x200b;\n\n(sigma mc-11 + sigma ex 50 mm f/1.4) = green squares\n\n(sigma mc-11 + canon 400 mm f/5.6 l) = green squares\n\n(sony 200-600 mm f/5.6-6.3) = solid green box w/out green squares", "sortedWord": "None", "identifyer": 30988, "year": "2021"}, {"Unnamed: 0": 140426, "autor": "GuilleX", "date": 1628904632000, "content": "Model shoot / A7iii + 16 35 GM / a little photshop (can you spot it?)", "link": "https://www.reddit.com/r/SonyAlpha/comments/p3yr1f/model_shoot_a7iii_16_35_gm_a_little_photshop_can/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "model shoot / a7iii + 16 35 gm / a little photshop (can you -----> spot !!!  it?)", "sortedWord": "None", "identifyer": 31356, "year": "2021"}, {"Unnamed: 0": 141153, "autor": "Maybedoc1", "date": 1613861914000, "content": "How much of an upgrade would an A7III be over my Nikon D7100? /!/ Hello all,\n\nI've been considering getting the A7iii for years now and I'm thinking about pulling the trigger with the reduced price on Sony's website. I currently have a Nikon D7100 that I bought used about 4 or 5 years ago. I mainly use the 18-140mm kit lens with it. I've gotten some great shots (to me) with it, but lots of bad shots too. Not sure if it's the camera or me and I'm wondering if upgrading to the A7iii is worth the money.\n\nI live out West and I mainly shoot nature-y landscape-type stuff. I like shooting in low/challenging-light and I also like shooting things with wide dynamic ranges (I think that's the right word?). Things like huge western landscapes where there are many different colors and shadows/highlights. For example, the sun might be hitting one spot of the canyon, but the rest is in shadows. I often see a great, complex picture in front of me, but I can't get it with my D7100 and it's frustrating. The picture may look bland or doesn't capture the grandiosity of what I'm looking at or I can't get the different light levels, etc. Again I'm not sure if it's the limitations of the camera or my skill. \n\nThoughts? Would the A7iii be a worthy upgrade? I shoot manual and edit in lightroom. Even with that  I often struggle to get the shots that I see in front of me.", "link": "https://www.reddit.com/r/SonyAlpha/comments/loiz12/how_much_of_an_upgrade_would_an_a7iii_be_over_my/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much of an upgrade would an a7iii be over my nikon d7100? /!/ hello all,\n\ni've been considering getting the a7iii for years now and i'm thinking about pulling the trigger with the reduced price on sony's website. i currently have a nikon d7100 that i bought used about 4 or 5 years ago. i mainly use the 18-140mm kit lens with it. i've gotten some great shots (to me) with it, but lots of bad shots too. not sure if it's the camera or me and i'm wondering if upgrading to the a7iii is worth the money.\n\ni live out west and i mainly shoot nature-y landscape-type stuff. i like shooting in low/challenging-light and i also like shooting things with wide dynamic ranges (i think that's the right word?). things like huge western landscapes where there are many different colors and shadows/highlights. for example, the sun might be hitting one -----> spot !!!  of the canyon, but the rest is in shadows. i often see a great, complex picture in front of me, but i can't get it with my d7100 and it's frustrating. the picture may look bland or doesn't capture the grandiosity of what i'm looking at or i can't get the different light levels, etc. again i'm not sure if it's the limitations of the camera or my skill. \n\nthoughts? would the a7iii be a worthy upgrade? i shoot manual and edit in lightroom. even with that  i often struggle to get the shots that i see in front of me.", "sortedWord": "None", "identifyer": 32108, "year": "2021"}, {"Unnamed: 0": 141437, "autor": "OutdoorsyGeek", "date": 1630088414000, "content": "Auto-Focus &amp; Hummingbirds /!/ I want to photograph hummingbirds in my backyard but I am not getting great auto-focus on them. I know I can go manual but I am hoping to make Auto work better. I currently have it set as Focus Area: Center. I am thinking I need to change it to Flexible Spot. I have never used the Flexible Spot mode. If you are quite familiar with it, please describe in depth how I will use it to photograph hummingbirds so as to prevent the camera from auto-focusing on the background since the subject is so small. Should I enable touch screen control or is the multi-selector good enough to control this mode? Would I be able to activate tracking once it has the hummingbird in focus and would that be effective as it quickly decided to fly around? I want to be able to hold down the shutter on maximum drive speed and have it track and continuously re-focus on the hummingbird which again is so tiny in the frame. Thank you for your advice.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pcsy05/autofocus_hummingbirds/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "auto-focus &amp; hummingbirds /!/ i want to photograph hummingbirds in my backyard but i am not getting great auto-focus on them. i know i can go manual but i am hoping to make auto work better. i currently have it set as focus area: center. i am thinking i need to change it to flexible -----> spot !!! . i have never used the flexible spot mode. if you are quite familiar with it, please describe in depth how i will use it to photograph hummingbirds so as to prevent the camera from auto-focusing on the background since the subject is so small. should i enable touch screen control or is the multi-selector good enough to control this mode? would i be able to activate tracking once it has the hummingbird in focus and would that be effective as it quickly decided to fly around? i want to be able to hold down the shutter on maximum drive speed and have it track and continuously re-focus on the hummingbird which again is so tiny in the frame. thank you for your advice.", "sortedWord": "None", "identifyer": 32398, "year": "2021"}, {"Unnamed: 0": 141565, "autor": "flamast", "date": 1626288761000, "content": "Focus doesn't \"hold\". Is my lense broken? /!/ Newb here. I'm not even sure if this is normal or not because I have nothing to compare to. Recently I've got an used Sony A7 with FE1.8/50 lens. \n\nHere's the issue - while holding the button to adjust focus I can see on preview how the sharpness changes, but, for the life of me, I can't stop it at the desired spot - just as I release the button the focus moves back ever slightly and the sharpness is lost. Is my lense broken? Or is this normal?\n\n I can hear some mechanism moving about when I hold the button, when I release it the mechanism is still moving a little bit longer. It's like - I'm holding, focus moves 1-2-3-4-5-6-7, I release and it drops back to 6.87.", "link": "https://www.reddit.com/r/SonyAlpha/comments/okaycw/focus_doesnt_hold_is_my_lense_broken/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focus doesn't \"hold\". is my lense broken? /!/ newb here. i'm not even sure if this is normal or not because i have nothing to compare to. recently i've got an used sony a7 with fe1.8/50 lens. \n\nhere's the issue - while holding the button to adjust focus i can see on preview how the sharpness changes, but, for the life of me, i can't stop it at the desired -----> spot !!!  - just as i release the button the focus moves back ever slightly and the sharpness is lost. is my lense broken? or is this normal?\n\n i can hear some mechanism moving about when i hold the button, when i release it the mechanism is still moving a little bit longer. it's like - i'm holding, focus moves 1-2-3-4-5-6-7, i release and it drops back to 6.87.", "sortedWord": "None", "identifyer": 32531, "year": "2021"}, {"Unnamed: 0": 141803, "autor": "emike9fcmc", "date": 1612741358000, "content": "Touchscreen focus while using EVF /!/ Hi all,\n\nI just got an A7c and trying to learn all the many functions it has. Is there a way to use the EVF and touch the touchscreen to select a focus area, or am I best to just use flexible spot and the direction keys to move my focus point around?", "link": "https://www.reddit.com/r/SonyAlpha/comments/leyu6o/touchscreen_focus_while_using_evf/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "touchscreen focus while using evf /!/ hi all,\n\ni just got an a7c and trying to learn all the many functions it has. is there a way to use the evf and touch the touchscreen to select a focus area, or am i best to just use flexible -----> spot !!!  and the direction keys to move my focus point around?", "sortedWord": "None", "identifyer": 32777, "year": "2021"}, {"Unnamed: 0": 142279, "autor": "Milan12332567", "date": 1617496468000, "content": "Weird dots on A6000 /!/ Hi, so after a night timelapse shoot, I realised that there were some static dots on the image. I coved the lens and made a pic and sure enough, the dots are there:\n\n&amp;#x200B;\n\n[ISO 6400 F\\/3.5 5 sec shutter](https://preview.redd.it/p2tgfreex1r61.png?width=1611&amp;format=png&amp;auto=webp&amp;s=be87d29e6d93f0ffef090f0d3e4e191e99a697b4)\n\nTheyre on the same spot in timelapse. Any idea what is causing them?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mjl5ap/weird_dots_on_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird dots on a6000 /!/ hi, so after a night timelapse shoot, i realised that there were some static dots on the image. i coved the lens and made a pic and sure enough, the dots are there:\n\n&amp;#x200b;\n\n[iso 6400 f\\/3.5 5 sec shutter](https://preview.redd.it/p2tgfreex1r61.png?width=1611&amp;format=png&amp;auto=webp&amp;s=be87d29e6d93f0ffef090f0d3e4e191e99a697b4)\n\ntheyre on the same -----> spot !!!  in timelapse. any idea what is causing them?", "sortedWord": "None", "identifyer": 33269, "year": "2021"}, {"Unnamed: 0": 142282, "autor": "shutterqut", "date": 1617494753000, "content": "Best focus area setting for group photos? /!/ I'm still figuring out my way around the a7r2 that I recently purchased. In terms of focus area setting what would be the ideal focus area setting for a shoot such as a family photoshoot? \nZone, flexible spot? etc", "link": "https://www.reddit.com/r/SonyAlpha/comments/mjknm7/best_focus_area_setting_for_group_photos/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best focus area setting for group photos? /!/ i'm still figuring out my way around the a7r2 that i recently purchased. in terms of focus area setting what would be the ideal focus area setting for a shoot such as a family photoshoot? \nzone, flexible -----> spot !!! ? etc", "sortedWord": "None", "identifyer": 33272, "year": "2021"}, {"Unnamed: 0": 142315, "autor": "zb0t1", "date": 1617990324000, "content": "Agama agama spotted in Réunion Island [A5100 + 16-50 Kit Lens]", "link": "https://www.reddit.com/r/SonyAlpha/comments/mnmmlb/agama_agama_spotted_in_réunion_island_a5100_1650/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "agama agama -----> spotted !!!  in réunion island [a5100 + 16-50 kit lens]", "sortedWord": "None", "identifyer": 33306, "year": "2021"}, {"Unnamed: 0": 142621, "autor": "jerrywm2", "date": 1623591799000, "content": "Touch tracking without actually touching /!/ Hi all! I know this sounds like a strange question, but is there any way to activate touch tracking on a subject without actually having to touch the screen? For instance, it would be helpful for me to be able to assign a custom button on my a7siii to activate object tracking based on where the center focus point is. I know I can do this with spot focus, but I want to actually activate touch tracking. That way, I could keep my left hand on my lens (to stabilize/zoom/etc.) and just use a button with my right hand to start (and then preferably stop) tracking a subject that I point at. I can't find a way to do this. Any ideas or workarounds? Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/nywm4t/touch_tracking_without_actually_touching/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "touch tracking without actually touching /!/ hi all! i know this sounds like a strange question, but is there any way to activate touch tracking on a subject without actually having to touch the screen? for instance, it would be helpful for me to be able to assign a custom button on my a7siii to activate object tracking based on where the center focus point is. i know i can do this with -----> spot !!!  focus, but i want to actually activate touch tracking. that way, i could keep my left hand on my lens (to stabilize/zoom/etc.) and just use a button with my right hand to start (and then preferably stop) tracking a subject that i point at. i can't find a way to do this. any ideas or workarounds? thanks!", "sortedWord": "None", "identifyer": 33624, "year": "2021"}, {"Unnamed: 0": 143141, "autor": "discretions915", "date": 1620673130000, "content": "Please HELP! Sensor cleaning issue! /!/ Hello I have an issue that I’m too worried to dive into before knowing more info. About two days ago I was swapping lenses in a relatively humid area little did I know that this is very problematic…I got condensation on my sensor and didn’t notice until about a few hours later it was very subtle. Now the condescension has dried and has left these micro dew like water spots. Only really noticeable under a certain light. This bothers me extremely and also worries me a lot in terms of getting rid of it. I ordered the proper cleaning swabs and a really good solution but I’m too worried to clean it due to my lack of knowledge, I know most people only deal with dust. Please help!!", "link": "https://www.reddit.com/r/SonyAlpha/comments/n9d1lt/please_help_sensor_cleaning_issue/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "please help! sensor cleaning issue! /!/ hello i have an issue that i’m too worried to dive into before knowing more info. about two days ago i was swapping lenses in a relatively humid area little did i know that this is very problematic…i got condensation on my sensor and didn’t notice until about a few hours later it was very subtle. now the condescension has dried and has left these micro dew like water -----> spots !!! . only really noticeable under a certain light. this bothers me extremely and also worries me a lot in terms of getting rid of it. i ordered the proper cleaning swabs and a really good solution but i’m too worried to clean it due to my lack of knowledge, i know most people only deal with dust. please help!!", "sortedWord": "None", "identifyer": 34165, "year": "2021"}, {"Unnamed: 0": 143515, "autor": "under_brecher", "date": 1622969809000, "content": "Little spotted woodpecker. SEL200600 A7 II - 600mm f 8.0", "link": "https://www.reddit.com/r/SonyAlpha/comments/nthhm9/little_spotted_woodpecker_sel200600_a7_ii_600mm_f/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "little -----> spotted !!!  woodpecker. sel200600 a7 ii - 600mm f 8.0", "sortedWord": "None", "identifyer": 34551, "year": "2021"}, {"Unnamed: 0": 143735, "autor": "puppy2016", "date": 1625755709000, "content": "Spot the hare (A7C + Tamron 28-200)", "link": "https://www.reddit.com/r/SonyAlpha/comments/og8ql2/spot_the_hare_a7c_tamron_28200/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  the hare (a7c + tamron 28-200)", "sortedWord": "None", "identifyer": 34776, "year": "2021"}, {"Unnamed: 0": 143799, "autor": "maybedragon", "date": 1625674077000, "content": "A7iii as webcam - can not get box on screen to go away /!/ Hi there,\n\nI am trying to use my new A7iii for streaming, but every time I have it connected and the video feed shows up, and it spots a face, it puts a box around it to track it. I want to have a 'clean' image and do not want a box around my face as it tracks it around the screen.\n\nHow do I turn this box off please?\n\nThank you!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ofm0fk/a7iii_as_webcam_can_not_get_box_on_screen_to_go/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a7iii as webcam - can not get box on screen to go away /!/ hi there,\n\ni am trying to use my new a7iii for streaming, but every time i have it connected and the video feed shows up, and it -----> spots !!!  a face, it puts a box around it to track it. i want to have a 'clean' image and do not want a box around my face as it tracks it around the screen.\n\nhow do i turn this box off please?\n\nthank you!", "sortedWord": "None", "identifyer": 34841, "year": "2021"}, {"Unnamed: 0": 144133, "autor": "sorbuss", "date": 1621423999000, "content": "Fighting for a nesting spot / A6600 - Sony E 70-350mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/ng3d0r/fighting_for_a_nesting_spot_a6600_sony_e_70350mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fighting for a nesting -----> spot !!!  / a6600 - sony e 70-350mm", "sortedWord": "None", "identifyer": 35182, "year": "2021"}, {"Unnamed: 0": 144134, "autor": "sorbuss", "date": 1621423881000, "content": "Fighting for a nesting spot / a6600 - Sony E 70-350", "link": "https://www.reddit.com/r/SonyAlpha/comments/ng3bor/fighting_for_a_nesting_spot_a6600_sony_e_70350/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "fighting for a nesting -----> spot !!!  / a6600 - sony e 70-350", "sortedWord": "None", "identifyer": 35183, "year": "2021"}, {"Unnamed: 0": 144492, "autor": "starvingpixelpainter", "date": 1633974735000, "content": "horizontal lines and spots showing up on lcd screen and viewfinder? /!/ After going through tsa at the airport, I went to take some photos out the window of the plane and noticed horizontal lines and specs showing up on the lcd screen. They’re also showing up through the eye viewer. Is this normal?", "link": "https://www.reddit.com/r/SonyAlpha/comments/q61hx2/horizontal_lines_and_spots_showing_up_on_lcd/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "horizontal lines and -----> spots !!!  showing up on lcd screen and viewfinder? /!/ after going through tsa at the airport, i went to take some photos out the window of the plane and noticed horizontal lines and specs showing up on the lcd screen. they’re also showing up through the eye viewer. is this normal?", "sortedWord": "None", "identifyer": 35555, "year": "2021"}, {"Unnamed: 0": 144701, "autor": "Holiday-Zeppelin-66", "date": 1626898361000, "content": "Looking for advice on sensor cleaning - Sony A6000 /!/ &amp;#x200B;\n\nhttps://preview.redd.it/ien0yoziimc71.png?width=1856&amp;format=png&amp;auto=webp&amp;s=b9ee81954b573d5ec6ac4da5176a5d2f348500ea\n\nThis is the ***really***  dirty sensor on my \\~5 year old Sony A6000 that's occasionally been used  in somewhat extreme conditions, but I'm usually pretty careful while  switching lenses. I've only cleaned the sensor with an air blower in the  past.\n\nSo I clicked a picture of a bright white wall (30mm, f16, 1 sec, ISO 100) and maxed out the '*Spot Removal —&gt; Visualize Spots*' setting in Lightroom. This was taken after I got rid of visible dust using a simple air blower.\n\nI've  never done this it the past, but if it'll be enough to clean the sensor  well, should I be attempting to clean it with the sensor cleaning swabs  that you get on Amazon? I ideally don't want to drop it off at a camera  store (I'm not too trusting, plus it'll cost around 5 times as much at  the couple of places I've asked).\n\nAny  tips on using the sensor cleaning swabs are more than welcome – e.g.  wet vs dry swabs; alcohol based cleaning solution vs simple distilled  water, etc.)", "link": "https://www.reddit.com/r/SonyAlpha/comments/ooxzc6/looking_for_advice_on_sensor_cleaning_sony_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for advice on sensor cleaning - sony a6000 /!/ &amp;#x200b;\n\nhttps://preview.redd.it/ien0yoziimc71.png?width=1856&amp;format=png&amp;auto=webp&amp;s=b9ee81954b573d5ec6ac4da5176a5d2f348500ea\n\nthis is the ***really***  dirty sensor on my \\~5 year old sony a6000 that's occasionally been used  in somewhat extreme conditions, but i'm usually pretty careful while  switching lenses. i've only cleaned the sensor with an air blower in the  past.\n\nso i clicked a picture of a bright white wall (30mm, f16, 1 sec, iso 100) and maxed out the '*-----> spot !!!  removal —&gt; visualize spots*' setting in lightroom. this was taken after i got rid of visible dust using a simple air blower.\n\ni've  never done this it the past, but if it'll be enough to clean the sensor  well, should i be attempting to clean it with the sensor cleaning swabs  that you get on amazon? i ideally don't want to drop it off at a camera  store (i'm not too trusting, plus it'll cost around 5 times as much at  the couple of places i've asked).\n\nany  tips on using the sensor cleaning swabs are more than welcome – e.g.  wet vs dry swabs; alcohol based cleaning solution vs simple distilled  water, etc.)", "sortedWord": "None", "identifyer": 35772, "year": "2021"}, {"Unnamed: 0": 144897, "autor": "cydonia8388", "date": 1619051057000, "content": "Dark/Black Spots on Image | Sony a6300, Sigma 30mm. /!/ I was testing out my camera/lens, and I notice a few black spots in the image.  They are in the same exact spot on each image I take...\n\nThe camera is a Sony a6300, the lens is a Sigma 30mm.\n\nAny ideas what they could be?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mvt9qs/darkblack_spots_on_image_sony_a6300_sigma_30mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dark/black -----> spots !!!  on image | sony a6300, sigma 30mm. /!/ i was testing out my camera/lens, and i notice a few black spots in the image.  they are in the same exact spot on each image i take...\n\nthe camera is a sony a6300, the lens is a sigma 30mm.\n\nany ideas what they could be?", "sortedWord": "None", "identifyer": 35974, "year": "2021"}, {"Unnamed: 0": 144996, "autor": "aperturecultures", "date": 1617026092000, "content": "Early Morning Blackbirds /!/ Spotted these little guys during an early morning drive and ended up shooting them from the car as I didn't want to scare them off by trying to get out of the car and move closer.  It was also a very cold morning and so you can see the condensation from their breaths as they were going on about their morning calls and moving about the little pond that they were all near.\n\nShot on a Sony A6500 with the Sigma 100-400mm DN lens.\n\n&amp;#x200B;\n\n[Red-Winged Blackbird during the sunrise](https://preview.redd.it/3cjrvta63zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=5fb3cc9e6ae5725816436ce2b636f22f449ed698)\n\n&amp;#x200B;\n\n[Red-Winged Blackbird during the sunrise](https://preview.redd.it/9z146gh73zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=6402cdd1aa21a13bff8b79bab0cf31d0f9d39c74)\n\n&amp;#x200B;\n\n[Running along the frost covered wood beam](https://preview.redd.it/dbjirkk83zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=c7dbce36e7d2acfd6584af6fd6038e49736e7839)", "link": "https://www.reddit.com/r/SonyAlpha/comments/mfq2ia/early_morning_blackbirds/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "early morning blackbirds /!/ -----> spotted !!!  these little guys during an early morning drive and ended up shooting them from the car as i didn't want to scare them off by trying to get out of the car and move closer.  it was also a very cold morning and so you can see the condensation from their breaths as they were going on about their morning calls and moving about the little pond that they were all near.\n\nshot on a sony a6500 with the sigma 100-400mm dn lens.\n\n&amp;#x200b;\n\n[red-winged blackbird during the sunrise](https://preview.redd.it/3cjrvta63zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=5fb3cc9e6ae5725816436ce2b636f22f449ed698)\n\n&amp;#x200b;\n\n[red-winged blackbird during the sunrise](https://preview.redd.it/9z146gh73zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=6402cdd1aa21a13bff8b79bab0cf31d0f9d39c74)\n\n&amp;#x200b;\n\n[running along the frost covered wood beam](https://preview.redd.it/dbjirkk83zp61.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=c7dbce36e7d2acfd6584af6fd6038e49736e7839)", "sortedWord": "None", "identifyer": 36080, "year": "2021"}, {"Unnamed: 0": 145071, "autor": "sorbuss", "date": 1616951794000, "content": "First time taking A6600 + 70-350 out /!/ I saw him with couple of does few days ago, wondered if they are at the same spot again. Not a bad start for a new camera and lens!", "link": "https://www.reddit.com/r/SonyAlpha/comments/mf57hy/first_time_taking_a6600_70350_out/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first time taking a6600 + 70-350 out /!/ i saw him with couple of does few days ago, wondered if they are at the same -----> spot !!!  again. not a bad start for a new camera and lens!", "sortedWord": "None", "identifyer": 36166, "year": "2021"}, {"Unnamed: 0": 145519, "autor": "jawnbravo", "date": 1615352915000, "content": "Picture of my 22 year old cat hanging out in her favorite window spot. Shot with Sony a6000 Sony 50mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/m1q028/picture_of_my_22_year_old_cat_hanging_out_in_her/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "picture of my 22 year old cat hanging out in her favorite window -----> spot !!! . shot with sony a6000 sony 50mm 1.8", "sortedWord": "None", "identifyer": 36632, "year": "2021"}, {"Unnamed: 0": 145714, "autor": "Picklesadog", "date": 1633420532000, "content": "Plumeria Blossom, spot the ant! a7iii w/Sony 20mm G", "link": "https://www.reddit.com/r/SonyAlpha/comments/q1rkxq/plumeria_blossom_spot_the_ant_a7iii_wsony_20mm_g/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "plumeria blossom, -----> spot !!!  the ant! a7iii w/sony 20mm g", "sortedWord": "None", "identifyer": 36832, "year": "2021"}, {"Unnamed: 0": 145767, "autor": "NotAGoodPlayer", "date": 1609852946000, "content": "Please help me choose a wide angle lens for Sony A7III /!/ Hi all.\n\nI would like to buy a wide angle lens with autofocus for my camera for months now and I just can't decide which would be the best option for me. The use will be mostly for landscape, cityscape and long exposure night scenes, also shots from the hand at night. But I intend to use the lens also for interior shots for real estate. \n\nOption 1 : Batis 18mm\n\nMy only problem with this lens is that it came out 5 years ago if not more and it still cost a fortune. 18mm is also a weird spot, not too wide enough for some people. Also not sure if 2.8 is fast enough. I shoot mostly at night and don't have my tripod always with me.\n\nOption 2 : Sigma 14-24mm \n\nThis lens looks amazing, but the only one thing holding me back is the lack of filters and non removable lens hood. Same applies as above, not sure if the aperture is fast enough for night time.\n\nOption 3 : Sigma 14mm\n\nThis would be perfect I guess also 1.8 , but the weight of this lens is 1.2kilograms while the Batis is only 330 grams. Really not interested to carry this heavy beast around.\n\nOption 4 : Tamron 17 - 28mm\n\nNot a fan of Tamron, because I don't like that cheap plastic feel. Also it is only 2.8 , same as Option 1 and 2.\n\nOption 5 : What else is there ? I am not looking at Samyang , Rokinon and such lenses. I simply want the best option.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kqyd9w/please_help_me_choose_a_wide_angle_lens_for_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "please help me choose a wide angle lens for sony a7iii /!/ hi all.\n\ni would like to buy a wide angle lens with autofocus for my camera for months now and i just can't decide which would be the best option for me. the use will be mostly for landscape, cityscape and long exposure night scenes, also shots from the hand at night. but i intend to use the lens also for interior shots for real estate. \n\noption 1 : batis 18mm\n\nmy only problem with this lens is that it came out 5 years ago if not more and it still cost a fortune. 18mm is also a weird -----> spot !!! , not too wide enough for some people. also not sure if 2.8 is fast enough. i shoot mostly at night and don't have my tripod always with me.\n\noption 2 : sigma 14-24mm \n\nthis lens looks amazing, but the only one thing holding me back is the lack of filters and non removable lens hood. same applies as above, not sure if the aperture is fast enough for night time.\n\noption 3 : sigma 14mm\n\nthis would be perfect i guess also 1.8 , but the weight of this lens is 1.2kilograms while the batis is only 330 grams. really not interested to carry this heavy beast around.\n\noption 4 : tamron 17 - 28mm\n\nnot a fan of tamron, because i don't like that cheap plastic feel. also it is only 2.8 , same as option 1 and 2.\n\noption 5 : what else is there ? i am not looking at samyang , rokinon and such lenses. i simply want the best option.", "sortedWord": "None", "identifyer": 36892, "year": "2021"}, {"Unnamed: 0": 145817, "autor": "JoeBaggz", "date": 1609785314000, "content": "Finding good angles and subjects in the Florida woods can feel pretty difficult at times. This egret chose one of the best spots to sit! Sony a7Riii + FE 24-105 G", "link": "https://www.reddit.com/r/SonyAlpha/comments/kqepnm/finding_good_angles_and_subjects_in_the_florida/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "finding good angles and subjects in the florida woods can feel pretty difficult at times. this egret chose one of the best -----> spots !!!  to sit! sony a7riii + fe 24-105 g", "sortedWord": "None", "identifyer": 36942, "year": "2021"}, {"Unnamed: 0": 146013, "autor": "civex", "date": 1624058499000, "content": "a6400 and flexible spot S, L, M /!/ I can't find out what those letters mean. It's not in the manual, and my online searches turn up nothing. I'm stumped.\n\nHelp, please.", "link": "https://www.reddit.com/r/SonyAlpha/comments/o32yui/a6400_and_flexible_spot_s_l_m/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6400 and flexible -----> spot !!!  s, l, m /!/ i can't find out what those letters mean. it's not in the manual, and my online searches turn up nothing. i'm stumped.\n\nhelp, please.", "sortedWord": "None", "identifyer": 37143, "year": "2021"}, {"Unnamed: 0": 146155, "autor": "odasneat", "date": 1628044691000, "content": "Help with sony a6000 as webcam /!/ Recently picked up a sony a6000 second hand, was a great price and thus far the camera has worked excellent. I wanted to have a go at using it as a webcam to livestream on twitch, i purchased an elgato cam link to enable this, and also got a micro hdmi to hdmi cord from amazon...  \n\n\nWhen i set everything up as per multiple videos, using the camera in movie mode etc, it still remains as no signal on my computer/monitor, ive managed to cancel out thge possibility of it being the cable  itself, as well as the cam link, so my only question now is whether the hdmi port on the camera is damaged, is there any way to tell? visually i can't spot anything wrong with it and the cable goes in etc.. any help appreciated", "link": "https://www.reddit.com/r/SonyAlpha/comments/oxj4h2/help_with_sony_a6000_as_webcam/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with sony a6000 as webcam /!/ recently picked up a sony a6000 second hand, was a great price and thus far the camera has worked excellent. i wanted to have a go at using it as a webcam to livestream on twitch, i purchased an elgato cam link to enable this, and also got a micro hdmi to hdmi cord from amazon...  \n\n\nwhen i set everything up as per multiple videos, using the camera in movie mode etc, it still remains as no signal on my computer/monitor, ive managed to cancel out thge possibility of it being the cable  itself, as well as the cam link, so my only question now is whether the hdmi port on the camera is damaged, is there any way to tell? visually i can't -----> spot !!!  anything wrong with it and the cable goes in etc.. any help appreciated", "sortedWord": "None", "identifyer": 37296, "year": "2021"}, {"Unnamed: 0": 146187, "autor": "KCLOUDZZ", "date": 1628015304000, "content": "Astrophotography in the smokies /!/ I’m currently in the gatlinburg Tennessee and wanted to try astrophotography for the first time. I want to try Newfound gap wanted to know if any photographers in the area have tried it out there or if you know any other spots that’s helpful too. Unfortunately I can’t do cades cove", "link": "https://www.reddit.com/r/SonyAlpha/comments/ox9mvw/astrophotography_in_the_smokies/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "astrophotography in the smokies /!/ i’m currently in the gatlinburg tennessee and wanted to try astrophotography for the first time. i want to try newfound gap wanted to know if any photographers in the area have tried it out there or if you know any other -----> spots !!!  that’s helpful too. unfortunately i can’t do cades cove", "sortedWord": "None", "identifyer": 37328, "year": "2021"}, {"Unnamed: 0": 146349, "autor": "wings303", "date": 1633296961000, "content": "What is this dark spot? /!/ See the dark spot inside the red circle. What is this spot? It appeared in the same place each time I took this photo. It was in the same part of the frame no matter where I moved the camera. I checked the lens but didn't see any dust or anything on the lens that might cause it? Nonetheless, I wiped the lense and the still saw the spot.\n\nThe spot only appeared when I shot an image. It wasn't visible if I was just looking through the view finder before taking the shot. Any ideas? Thanks!\n\n&amp;#x200B;\n\n[Dark spot in the image](https://preview.redd.it/8hd0peir0br71.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=baf7515f40240c5294e107c739d007e3e5f800d4)", "link": "https://www.reddit.com/r/SonyAlpha/comments/q0rdr6/what_is_this_dark_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is this dark -----> spot !!! ? /!/ see the dark spot inside the red circle. what is this spot? it appeared in the same place each time i took this photo. it was in the same part of the frame no matter where i moved the camera. i checked the lens but didn't see any dust or anything on the lens that might cause it? nonetheless, i wiped the lense and the still saw the spot.\n\nthe spot only appeared when i shot an image. it wasn't visible if i was just looking through the view finder before taking the shot. any ideas? thanks!\n\n&amp;#x200b;\n\n[dark spot in the image](https://preview.redd.it/8hd0peir0br71.jpg?width=6000&amp;format=pjpg&amp;auto=webp&amp;s=baf7515f40240c5294e107c739d007e3e5f800d4)", "sortedWord": "None", "identifyer": 37499, "year": "2021"}, {"Unnamed: 0": 146350, "autor": "wings303", "date": 1633296846000, "content": "What is this spot in my images? /!/ See the dark spot inside the red circle. What is this spot? It appeared in the same place each time I took this photo. It was in the same part of the frame no matter where I moved the camera. I checked the lens but didn't see any dust or anything on the lens that might cause it? Nonetheless, I wiped the lense and the still saw the spot. \n\nThe spot only appeared when I shot an image. It wasn't visible if I was just looking through the view finder before taking the shot. Any ideas? Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/q0rcdk/what_is_this_spot_in_my_images/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is this -----> spot !!!  in my images? /!/ see the dark spot inside the red circle. what is this spot? it appeared in the same place each time i took this photo. it was in the same part of the frame no matter where i moved the camera. i checked the lens but didn't see any dust or anything on the lens that might cause it? nonetheless, i wiped the lense and the still saw the spot. \n\nthe spot only appeared when i shot an image. it wasn't visible if i was just looking through the view finder before taking the shot. any ideas? thanks!", "sortedWord": "None", "identifyer": 37500, "year": "2021"}, {"Unnamed: 0": 146458, "autor": "Grove_is_King", "date": 1610154102000, "content": "[Question] About a7 series ISO \"sweet spots\" and variance /!/ Hello! Some time ago I read somewhere (can't remember where exactly) something along the lines of \"The a7 series cameras have two sweet spots, one at base (native) iso 100 and one at iso 640\".\n\nToday it randomly popped into my mind to google it and verify it. I found out these graphs about my a7iii, and there are other similar ones for the rest of the a7 series.\n\n[Photographic Dynamic Range Shadow Improvement versus ISO Setting Graph](https://i.imgur.com/MeBE9Lq.png)\n\n[Photographic Dynamic Range Shadow Improvement versus ISO Setting Chart](https://i.imgur.com/OZtOYfa.png)\n\n[Read Noise in DNs versus ISO Setting Graph](https://i.imgur.com/jvBuUjs.png)\n\nLooking at these graphs, am I right to assume that the best ISO settings to take photos with my a7iii is at 100 and 640 when there is ample natural light?\n\nWhat about night shots or shots when there isn't enough light? What ISO are you using? Personally I never go above 12800.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ktge8r/question_about_a7_series_iso_sweet_spots_and/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[question] about a7 series iso \"sweet -----> spots !!! \" and variance /!/ hello! some time ago i read somewhere (can't remember where exactly) something along the lines of \"the a7 series cameras have two sweet spots, one at base (native) iso 100 and one at iso 640\".\n\ntoday it randomly popped into my mind to google it and verify it. i found out these graphs about my a7iii, and there are other similar ones for the rest of the a7 series.\n\n[photographic dynamic range shadow improvement versus iso setting graph](https://i.imgur.com/mebe9lq.png)\n\n[photographic dynamic range shadow improvement versus iso setting chart](https://i.imgur.com/oztoyfa.png)\n\n[read noise in dns versus iso setting graph](https://i.imgur.com/jvbuujs.png)\n\nlooking at these graphs, am i right to assume that the best iso settings to take photos with my a7iii is at 100 and 640 when there is ample natural light?\n\nwhat about night shots or shots when there isn't enough light? what iso are you using? personally i never go above 12800.", "sortedWord": "None", "identifyer": 37609, "year": "2021"}, {"Unnamed: 0": 146461, "autor": "[deleted]", "date": 1610153755000, "content": "[Question] About a7iii ISO \"sweet spots\" and variance /!/ [deleted]", "link": "https://www.reddit.com/r/SonyAlpha/comments/ktgadx/question_about_a7iii_iso_sweet_spots_and_variance/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[question] about a7iii iso \"sweet -----> spots !!! \" and variance /!/ [deleted]", "sortedWord": "None", "identifyer": 37612, "year": "2021"}, {"Unnamed: 0": 147206, "autor": "Aaronlvlia", "date": 1610854565000, "content": "Just started getting into photography &amp; had to shoot my favorite spot in my home town. A7ii + 24mm GM", "link": "https://www.reddit.com/r/SonyAlpha/comments/kyyh5m/just_started_getting_into_photography_had_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just started getting into photography &amp; had to shoot my favorite -----> spot !!!  in my home town. a7ii + 24mm gm", "sortedWord": "None", "identifyer": 38388, "year": "2021"}, {"Unnamed: 0": 147358, "autor": "Zaco32", "date": 1611033794000, "content": "Trying to create something unique in one of the most popular local spots | A7RII + 70-200MM |", "link": "https://www.reddit.com/r/SonyAlpha/comments/l0d26l/trying_to_create_something_unique_in_one_of_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "trying to create something unique in one of the most popular local -----> spots !!!  | a7rii + 70-200mm |", "sortedWord": "None", "identifyer": 38544, "year": "2021"}, {"Unnamed: 0": 147661, "autor": "JamalSteve", "date": 1624898340000, "content": "How to enable touch spot focus to tracking focus? A7siii /!/ I can only choose one or the other--I want to be able to cycle between them as I've seen possible with the touch function...any idea how to do this? Thanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/o9o1wz/how_to_enable_touch_spot_focus_to_tracking_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to enable touch -----> spot !!!  focus to tracking focus? a7siii /!/ i can only choose one or the other--i want to be able to cycle between them as i've seen possible with the touch function...any idea how to do this? thanks in advance.", "sortedWord": "None", "identifyer": 38861, "year": "2021"}, {"Unnamed: 0": 148824, "autor": "CT12221", "date": 1617714605000, "content": "A tour of some Graffiti spots of Hannover, Germany /a6000+ Helios44-2+ Kit", "link": "https://www.reddit.com/r/SonyAlpha/comments/mlbamw/a_tour_of_some_graffiti_spots_of_hannover_germany/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a tour of some graffiti -----> spots !!!  of hannover, germany /a6000+ helios44-2+ kit", "sortedWord": "None", "identifyer": 40057, "year": "2021"}, {"Unnamed: 0": 148897, "autor": "ChoclitoMix", "date": 1617637714000, "content": "Strange spot on the middle of the sensor - NEW SONY A7S III /!/  Hey! Thank you for your help. I just received my new Sony A7s III, while  I was trying it for the first time I checked the body and I noticed  that there was some strange circles in the middle of the sensor, I  haven't seen anything like it before. From the tests in video and photo  that I have made, I can't seee any affectations of that in my PC  monitor, the image just looks great. So I don't really know if this is  something normal or something I should be worried about. I'll leave you  some images so you can understand what kind of \"staind\" is this. Thank  you alot for your help and support. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ffwoxu6xldr61.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=8210769f4afc24971bb7c85883153ec96b6f1992\n\nhttps://preview.redd.it/6ngg2r6xldr61.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=3f015a7b3b2190ba5f3af73ae1a6bdc8a0112f59", "link": "https://www.reddit.com/r/SonyAlpha/comments/mknri5/strange_spot_on_the_middle_of_the_sensor_new_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "strange -----> spot !!!  on the middle of the sensor - new sony a7s iii /!/  hey! thank you for your help. i just received my new sony a7s iii, while  i was trying it for the first time i checked the body and i noticed  that there was some strange circles in the middle of the sensor, i  haven't seen anything like it before. from the tests in video and photo  that i have made, i can't seee any affectations of that in my pc  monitor, the image just looks great. so i don't really know if this is  something normal or something i should be worried about. i'll leave you  some images so you can understand what kind of \"staind\" is this. thank  you alot for your help and support. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/ffwoxu6xldr61.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=8210769f4afc24971bb7c85883153ec96b6f1992\n\nhttps://preview.redd.it/6ngg2r6xldr61.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=3f015a7b3b2190ba5f3af73ae1a6bdc8a0112f59", "sortedWord": "None", "identifyer": 40130, "year": "2021"}, {"Unnamed: 0": 149198, "autor": "puppy2016", "date": 1619201605000, "content": "Any Samyang 18/F2.8 AF owners? I got weird unsharp spot in the center", "link": "https://www.reddit.com/r/SonyAlpha/comments/mx1gr4/any_samyang_18f28_af_owners_i_got_weird_unsharp/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any samyang 18/f2.8 af owners? i got weird unsharp -----> spot !!!  in the center", "sortedWord": "None", "identifyer": 40446, "year": "2021"}, {"Unnamed: 0": 149518, "autor": "Vegetable_Basket6480", "date": 1631239138000, "content": "Focusing question /!/ Hi,\n\nI am quite new to photography, my camera is A6400.\n\nI have seen some pro photographers mention that they put their target in the middle of the frame, focus and then move the camera so the target is more to a side, but I struggle to replicate this.\n\nI mostly use continuous AF and flexible spot.\n\nIf I half press shutter button and move camera, it loses focus, what am I doing wrong ?\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/plbon7/focusing_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focusing question /!/ hi,\n\ni am quite new to photography, my camera is a6400.\n\ni have seen some pro photographers mention that they put their target in the middle of the frame, focus and then move the camera so the target is more to a side, but i struggle to replicate this.\n\ni mostly use continuous af and flexible -----> spot !!! .\n\nif i half press shutter button and move camera, it loses focus, what am i doing wrong ?\n\nthanks!", "sortedWord": "None", "identifyer": 40779, "year": "2021"}, {"Unnamed: 0": 149631, "autor": "Martii52", "date": 1617480807000, "content": "Sony a7riii 200 600 f5.6 6.3 /!/ Guys im using this set up for birding may I ask, 1 what responsive settings  are you using 1 or 5 I know 1 is the setting for tracking but I'm having hit and miss success with this, am I better using responsive  5  in Wide ,Zone and Spot, I've done all the you tube videos with Mark galer and Mark Smith settings but thats their settings for them which are different as different can be , any constructive comment would be appreciated .", "link": "https://www.reddit.com/r/SonyAlpha/comments/mjgaqd/sony_a7riii_200_600_f56_63/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a7riii 200 600 f5.6 6.3 /!/ guys im using this set up for birding may i ask, 1 what responsive settings  are you using 1 or 5 i know 1 is the setting for tracking but i'm having hit and miss success with this, am i better using responsive  5  in wide ,zone and -----> spot !!! , i've done all the you tube videos with mark galer and mark smith settings but thats their settings for them which are different as different can be , any constructive comment would be appreciated .", "sortedWord": "None", "identifyer": 40900, "year": "2021"}, {"Unnamed: 0": 149762, "autor": "BOOOOOMER1398", "date": 1622045034000, "content": "PINK SPOTS ON CAMERA /!/ Hi just wanted to ask if this is dirt or a sensor damage? (referring to the pink spots)  \n\n\nThanks!  \n\n\nhttps://preview.redd.it/a5ybvbf0nh171.png?width=1524&amp;format=png&amp;auto=webp&amp;s=0dd4455bab1d7879a8ff14d97b6ceaf238d81f10\n\nhttps://preview.redd.it/6k8ab982nh171.png?width=975&amp;format=png&amp;auto=webp&amp;s=ae90040f96191d5ea4c7e757f1f03c147aaccc38", "link": "https://www.reddit.com/r/SonyAlpha/comments/nlkjhz/pink_spots_on_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "pink -----> spots !!!  on camera /!/ hi just wanted to ask if this is dirt or a sensor damage? (referring to the pink spots)  \n\n\nthanks!  \n\n\nhttps://preview.redd.it/a5ybvbf0nh171.png?width=1524&amp;format=png&amp;auto=webp&amp;s=0dd4455bab1d7879a8ff14d97b6ceaf238d81f10\n\nhttps://preview.redd.it/6k8ab982nh171.png?width=975&amp;format=png&amp;auto=webp&amp;s=ae90040f96191d5ea4c7e757f1f03c147aaccc38", "sortedWord": "None", "identifyer": 41034, "year": "2021"}, {"Unnamed: 0": 149803, "autor": "OMGerm", "date": 1631988558000, "content": "Camera/Lens Recommendations /!/ I’ve been doing some reading and after plenty of deliberation, I thought I’d better ask the community here as well.\n\nMy wife and I like to day-hike (occasional 5-7 day backpacking in some spots like Peru, Banff, Glacier, Yosemite, etc.).  We’d like to shoot both landscapes and some wildlife when the opportunity arises.  Astro could be something we dabble in.\n\nWe currently have an a7r iii paired with a 16-35 gm.  That’s it right now; I’m open to selling everything and “starting over.”  Budget isn’t a huge concern (minus something like the 600 gm prime), but also want a minimal setup.  Weight is a consideration of course.  We’d like to know what thoughts you might have for us.\n\nQuestions we’re struggling with:\n\n-\tShould we sell the a7r iii and buy the a7r iv?\n-\tShould we sell the 16-35gm and buy the 12-24gm?\n-\tShould we keep the 16-35gm and buy a 14gm if astro becomes a focus?\n-\tIs the 100-400gm “good enough” for wildlife?  Size/weight seems reasonable compared to something like the 200-600g.\n-\tIs the 16-35gm and 100-400gm a good pairing for our use case?  Anything better?\n\nThank you, we really appreciate any guidance you might want to offer!", "link": "https://www.reddit.com/r/SonyAlpha/comments/pqrekc/cameralens_recommendations/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "camera/lens recommendations /!/ i’ve been doing some reading and after plenty of deliberation, i thought i’d better ask the community here as well.\n\nmy wife and i like to day-hike (occasional 5-7 day backpacking in some -----> spots !!!  like peru, banff, glacier, yosemite, etc.).  we’d like to shoot both landscapes and some wildlife when the opportunity arises.  astro could be something we dabble in.\n\nwe currently have an a7r iii paired with a 16-35 gm.  that’s it right now; i’m open to selling everything and “starting over.”  budget isn’t a huge concern (minus something like the 600 gm prime), but also want a minimal setup.  weight is a consideration of course.  we’d like to know what thoughts you might have for us.\n\nquestions we’re struggling with:\n\n-\tshould we sell the a7r iii and buy the a7r iv?\n-\tshould we sell the 16-35gm and buy the 12-24gm?\n-\tshould we keep the 16-35gm and buy a 14gm if astro becomes a focus?\n-\tis the 100-400gm “good enough” for wildlife?  size/weight seems reasonable compared to something like the 200-600g.\n-\tis the 16-35gm and 100-400gm a good pairing for our use case?  anything better?\n\nthank you, we really appreciate any guidance you might want to offer!", "sortedWord": "None", "identifyer": 41075, "year": "2021"}, {"Unnamed: 0": 149811, "autor": "ParadiseBizz", "date": 1631977733000, "content": "Sony 50mm f/1.8 after the firmware upgrade to version 03 /!/  I bought the Sony 50mm f/1.8 for a video review on my youtube channel ParadiseBizz \n\nIt currently retails between $199 and $240, so it really doesn't break the bank.  \n\n\nI checked in my camera menu (toolbox page 6 &gt;&gt; version) which firmware it came with and I saw that the latest firmware version 3 was already applied.  \n\n\nIf you don't have the latest firmware, it is easy to upgrade: [https://www.sony.com/electronics/support/lenses-e-mount-lenses/sel50f18f](https://www.sony.com/electronics/support/lenses-e-mount-lenses/sel50f18f)  \n\n\nWith the new firmware the focus is SPOT ON, it is snappy and accurate. I never missed a shot.  \n\n\nEven in video mode it is very good and reliable. The only problem in video mode: the AF motor is very noisy, you need to use an external mic.  \n\n\nBut overall, for a lens at this price point: very impressive. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/lbgvaen32ao71.jpg?width=1350&amp;format=pjpg&amp;auto=webp&amp;s=28dffb1a8defedc5c9e8296bb379485a4a095f6f", "link": "https://www.reddit.com/r/SonyAlpha/comments/pqo5c0/sony_50mm_f18_after_the_firmware_upgrade_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony 50mm f/1.8 after the firmware upgrade to version 03 /!/  i bought the sony 50mm f/1.8 for a video review on my youtube channel paradisebizz \n\nit currently retails between $199 and $240, so it really doesn't break the bank.  \n\n\ni checked in my camera menu (toolbox page 6 &gt;&gt; version) which firmware it came with and i saw that the latest firmware version 3 was already applied.  \n\n\nif you don't have the latest firmware, it is easy to upgrade: [https://www.sony.com/electronics/support/lenses-e-mount-lenses/sel50f18f](https://www.sony.com/electronics/support/lenses-e-mount-lenses/sel50f18f)  \n\n\nwith the new firmware the focus is -----> spot !!!  on, it is snappy and accurate. i never missed a shot.  \n\n\neven in video mode it is very good and reliable. the only problem in video mode: the af motor is very noisy, you need to use an external mic.  \n\n\nbut overall, for a lens at this price point: very impressive. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/lbgvaen32ao71.jpg?width=1350&amp;format=pjpg&amp;auto=webp&amp;s=28dffb1a8defedc5c9e8296bb379485a4a095f6f", "sortedWord": "None", "identifyer": 41083, "year": "2021"}, {"Unnamed: 0": 149990, "autor": "PVPirates", "date": 1625544539000, "content": "What lenses for first timer Outdoor, night sky, etc? /!/ Hey folks! I'm a nomad who's been traveling around New Zealand taking some super sick shots with my phone lol. I think it's time to take things seriously and purchase an A7iii. My question is, which lens or lenses would you recommend that won't break the bank?\n\nIs there a jack of all trades for let's say landscape, scenery?\n\nI'm pretty much a noob and I'd like to be able to take pictures of the sky, scenery and maybe if the budget allows it, closeups when we spot small animals or birds. I know it's a pretty general question so maybe it'll help if you watched the video we made with my phone and my trusty drone. Just want to step up from a phone to something way better 😁\n\nHere's our video of our one year trip around New Zealand:\n[New Zealand in a Year](https://youtu.be/74Z2o1B34rw)", "link": "https://www.reddit.com/r/SonyAlpha/comments/oenegl/what_lenses_for_first_timer_outdoor_night_sky_etc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what lenses for first timer outdoor, night sky, etc? /!/ hey folks! i'm a nomad who's been traveling around new zealand taking some super sick shots with my phone lol. i think it's time to take things seriously and purchase an a7iii. my question is, which lens or lenses would you recommend that won't break the bank?\n\nis there a jack of all trades for let's say landscape, scenery?\n\ni'm pretty much a noob and i'd like to be able to take pictures of the sky, scenery and maybe if the budget allows it, closeups when we -----> spot !!!  small animals or birds. i know it's a pretty general question so maybe it'll help if you watched the video we made with my phone and my trusty drone. just want to step up from a phone to something way better 😁\n\nhere's our video of our one year trip around new zealand:\n[new zealand in a year](https://youtu.be/74z2o1b34rw)", "sortedWord": "None", "identifyer": 41266, "year": "2021"}, {"Unnamed: 0": 150100, "autor": "naveeth88", "date": 1620810355000, "content": "Milkyway spot.... Sony A6400 + Sigma 16mm F1.4 15secs ISO1600", "link": "https://www.reddit.com/r/SonyAlpha/comments/nak9zr/milkyway_spot_sony_a6400_sigma_16mm_f14_15secs/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "milkyway -----> spot !!! .... sony a6400 + sigma 16mm f1.4 15secs iso1600", "sortedWord": "None", "identifyer": 41381, "year": "2021"}, {"Unnamed: 0": 150543, "autor": "GER_3spectre", "date": 1620325760000, "content": "Spot in midtown Manhattan a7ii 24mm 1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/n6e1ql/spot_in_midtown_manhattan_a7ii_24mm_14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  in midtown manhattan a7ii 24mm 1.4", "sortedWord": "None", "identifyer": 41845, "year": "2021"}, {"Unnamed: 0": 151094, "autor": "FiveSpree", "date": 1609469125000, "content": "Sony Imaging Edge and Starring Images in Camera. /!/ Hi Everyone! \n\nRecent convert from Canon over to the Sony Ecosystem. I after playing around with the A7iii from the Canon 6D, I am absolutely in love. However, I am **struggling** in one area. I do professional studio photography and  family photography. I often work in teams with editors and stylists. With my Canon 6D and its native WIFI app, I was able to do get clients to wirelessly monitor shots and most importantly I was able to get my clients to star and flag their photos OOC before I upload to LR, it cut down on my edit times **immensely**. It also added a significant amount of value to my family photography as well, because my clients could also select their photos immediately.\n\nI cant seem to access the gallery or have the same function with the Sony Imaging Edge app, am I looking in the wrong spot, or is that not possible with the A7 currently?\n\nThank you so much for your time", "link": "https://www.reddit.com/r/SonyAlpha/comments/ko3kcm/sony_imaging_edge_and_starring_images_in_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony imaging edge and starring images in camera. /!/ hi everyone! \n\nrecent convert from canon over to the sony ecosystem. i after playing around with the a7iii from the canon 6d, i am absolutely in love. however, i am **struggling** in one area. i do professional studio photography and  family photography. i often work in teams with editors and stylists. with my canon 6d and its native wifi app, i was able to do get clients to wirelessly monitor shots and most importantly i was able to get my clients to star and flag their photos ooc before i upload to lr, it cut down on my edit times **immensely**. it also added a significant amount of value to my family photography as well, because my clients could also select their photos immediately.\n\ni cant seem to access the gallery or have the same function with the sony imaging edge app, am i looking in the wrong -----> spot !!! , or is that not possible with the a7 currently?\n\nthank you so much for your time", "sortedWord": "None", "identifyer": 42414, "year": "2021"}, {"Unnamed: 0": 151316, "autor": "Vegetable_Basket6480", "date": 1632336962000, "content": "Tracking fast moving objects ? /!/ Hi,\n\nI am new to photography and the camera I use is A6400, I am also mostly using AF-C with Expand Flexible Spot L.\n\nI'm wondering if I would like to make multiple shoots of fast moving objects like a dog or airplane, will I be fine with the settings I am currently using or should I use something else ?\n\nI have tried using \"Wide\" for most shoots but It does sometimes focus things I don't want it to focus.\n\nI know there is also some tracking option in my camera, you can click on an object you see on the display and it will track it, why would I use it ? Is it for video only ?\n\nAlso when it comes to Eye tracking, do I just half press shutter all the time for it to track ?\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ptec7e/tracking_fast_moving_objects/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tracking fast moving objects ? /!/ hi,\n\ni am new to photography and the camera i use is a6400, i am also mostly using af-c with expand flexible -----> spot !!!  l.\n\ni'm wondering if i would like to make multiple shoots of fast moving objects like a dog or airplane, will i be fine with the settings i am currently using or should i use something else ?\n\ni have tried using \"wide\" for most shoots but it does sometimes focus things i don't want it to focus.\n\ni know there is also some tracking option in my camera, you can click on an object you see on the display and it will track it, why would i use it ? is it for video only ?\n\nalso when it comes to eye tracking, do i just half press shutter all the time for it to track ?\n\nthanks!", "sortedWord": "None", "identifyer": 42645, "year": "2021"}, {"Unnamed: 0": 151486, "autor": "adayasatiger", "date": 1616931187000, "content": "Lens Coating Scratched Off (Sigma Lens, Sony A5100) /!/ Hi all!\n\nRookie question here, sorry if this doesn't make much sense. I have somehow managed to... rub off, I guess? the top coating of my Sigma lens (pictures attached) and it's affecting the quality of my photos (a noticeably blurry spot corresponding to where the damage is). It doesn't look like a scratch, per se (though it may be), but rather as though some sort of layer has been rubbed off. Can someone shed some light on what it is and how to fix it (if at all possible without sending it back to be replaced?). I've tried the rubbing alcohol solution for scratches I've seen suggested online, to no result. Help!\n\nPics:\n\n[https://ibb.co/Pg09zDP](https://ibb.co/Pg09zDP)\n\n[https://ibb.co/Y7nQvPc](https://ibb.co/Y7nQvPc)", "link": "https://www.reddit.com/r/SonyAlpha/comments/mezrcf/lens_coating_scratched_off_sigma_lens_sony_a5100/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens coating scratched off (sigma lens, sony a5100) /!/ hi all!\n\nrookie question here, sorry if this doesn't make much sense. i have somehow managed to... rub off, i guess? the top coating of my sigma lens (pictures attached) and it's affecting the quality of my photos (a noticeably blurry -----> spot !!!  corresponding to where the damage is). it doesn't look like a scratch, per se (though it may be), but rather as though some sort of layer has been rubbed off. can someone shed some light on what it is and how to fix it (if at all possible without sending it back to be replaced?). i've tried the rubbing alcohol solution for scratches i've seen suggested online, to no result. help!\n\npics:\n\n[https://ibb.co/pg09zdp](https://ibb.co/pg09zdp)\n\n[https://ibb.co/y7nqvpc](https://ibb.co/y7nqvpc)", "sortedWord": "None", "identifyer": 42821, "year": "2021"}, {"Unnamed: 0": 151904, "autor": "omani805", "date": 1633377833000, "content": "Perfect spot in Chicago (A6000)", "link": "https://www.reddit.com/r/SonyAlpha/comments/q1drxo/perfect_spot_in_chicago_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "perfect -----> spot !!!  in chicago (a6000)", "sortedWord": "None", "identifyer": 43257, "year": "2021"}, {"Unnamed: 0": 152128, "autor": "PoundKitchen", "date": 1623938738000, "content": "Suggestions for A-Mount APSC potrrait lens? /!/ What's likely to be be my last summer season with a-mount, I have unexpectedly got portrait shots to deal with. I don't usually do portrait shooting. Looking in my kit bag I'm seeing Minolta 85/1.4 or Sony 16-50/2.8 DT, but on APS-C A77ii neither stand our as offering a classic portrait lens focal length with the crop sensor. The Minolta is impractically long, and a touch softer than I like, while the DT would be *good enough* fully zoomed with lens correction. My 70mm+ zooms are f4 full open, one clinical the other homely. I'm not seeing primes in that sweet spot focal lengths and apertures for cropped sensor bodies. So I'm open to suggestions, used primes or zooms that other have used for portraits! \n\nTIA", "link": "https://www.reddit.com/r/SonyAlpha/comments/o1y278/suggestions_for_amount_apsc_potrrait_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "suggestions for a-mount apsc potrrait lens? /!/ what's likely to be be my last summer season with a-mount, i have unexpectedly got portrait shots to deal with. i don't usually do portrait shooting. looking in my kit bag i'm seeing minolta 85/1.4 or sony 16-50/2.8 dt, but on aps-c a77ii neither stand our as offering a classic portrait lens focal length with the crop sensor. the minolta is impractically long, and a touch softer than i like, while the dt would be *good enough* fully zoomed with lens correction. my 70mm+ zooms are f4 full open, one clinical the other homely. i'm not seeing primes in that sweet -----> spot !!!  focal lengths and apertures for cropped sensor bodies. so i'm open to suggestions, used primes or zooms that other have used for portraits! \n\ntia", "sortedWord": "None", "identifyer": 43484, "year": "2021"}, {"Unnamed: 0": 152340, "autor": "AnxietyRoyal9903", "date": 1628111660000, "content": "Speedlite 430EXII with Sony A6600? /!/  Today I purchased a Sony A6600 and I am loving it so far.  I realized that I would likely need a flash, so I busted out my old Speedlite that I used with my Canon Rebel series camera, and much to my surprise it works!  Only thing is, photos are hyper saturated with way too much light.  I've tweaked the settings a bit on the Speedlite, but can't get to a spot where the flash is usable under Auto settings on the A6600.  Anyone have any success getting the flash to work?  I'm not looking to use it as a slave at this point, just wanted a nice go to flash to work on the go.  Thank you!", "link": "https://www.reddit.com/r/SonyAlpha/comments/oy2iwt/speedlite_430exii_with_sony_a6600/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "speedlite 430exii with sony a6600? /!/  today i purchased a sony a6600 and i am loving it so far.  i realized that i would likely need a flash, so i busted out my old speedlite that i used with my canon rebel series camera, and much to my surprise it works!  only thing is, photos are hyper saturated with way too much light.  i've tweaked the settings a bit on the speedlite, but can't get to a -----> spot !!!  where the flash is usable under auto settings on the a6600.  anyone have any success getting the flash to work?  i'm not looking to use it as a slave at this point, just wanted a nice go to flash to work on the go.  thank you!", "sortedWord": "None", "identifyer": 43716, "year": "2021"}, {"Unnamed: 0": 152357, "autor": "EmjeYy", "date": 1628099567000, "content": "Weird blue spots on a6000", "link": "https://www.reddit.com/r/SonyAlpha/comments/oxy84e/weird_blue_spots_on_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird blue -----> spots !!!  on a6000", "sortedWord": "None", "identifyer": 43733, "year": "2021"}, {"Unnamed: 0": 152606, "autor": "devindoyle", "date": 1628441937000, "content": "Sony A1: need back button focus to also lock exposure /!/ Recently started using back button focus (linked to AF-ON) instead of shutter. How do I set the camera to also lock exposure when I've set that focus point? Right now, exposure changes when I re-compose, even though 'metering mode' is set to SPOT and 'spot metering point' is set to FOCUS POINT LINK.\n\n&amp;#x200B;\n\nOr stated another way:\n\nI want to place my focus point on a subject, push AF-ON once to lock both focus and exposure, then re-compose and click the shutter without either of these changing.\n\nThanks for any insight.", "link": "https://www.reddit.com/r/SonyAlpha/comments/p0icd0/sony_a1_need_back_button_focus_to_also_lock/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a1: need back button focus to also lock exposure /!/ recently started using back button focus (linked to af-on) instead of shutter. how do i set the camera to also lock exposure when i've set that focus point? right now, exposure changes when i re-compose, even though 'metering mode' is set to -----> spot !!!  and '-----> spot !!!  metering point' is set to focus point link.\n\n&amp;#x200b;\n\nor stated another way:\n\ni want to place my focus point on a subject, push af-on once to lock both focus and exposure, then re-compose and click the shutter without either of these changing.\n\nthanks for any insight.", "sortedWord": "None", "identifyer": 43993, "year": "2021"}, {"Unnamed: 0": 152652, "autor": "sithlord89", "date": 1629916385000, "content": "Camera backpack okay for cycling? /!/ Hey guys and gals,\nI have an A7RIII and there is a couple of great landscape spot in my hometown that are about 6 miles out on a mostly paved bike trail. I was wondering if this back pack Yesker Camera Backpack... https://www.amazon.com/dp/B085DP96WY?ref=ppx_pop_mob_ap_share would be okay for the ride on my back? Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/pbhb1b/camera_backpack_okay_for_cycling/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera backpack okay for cycling? /!/ hey guys and gals,\ni have an a7riii and there is a couple of great landscape -----> spot !!!  in my hometown that are about 6 miles out on a mostly paved bike trail. i was wondering if this back pack yesker camera backpack... https://www.amazon.com/dp/b085dp96wy?ref=ppx_pop_mob_ap_share would be okay for the ride on my back? thanks!", "sortedWord": "None", "identifyer": 44041, "year": "2021"}, {"Unnamed: 0": 152836, "autor": "MarkLewisadventurer", "date": 1629329198000, "content": "A7iii Focus mode for filming wedding speeches? /!/ I’m a youtuber but about to use my a7iii for something else and film speeches at my wedding. As they will all be given from the same spot in the room, my plan was to set the camera up….focused on a test subject at that spot…. And then switch off auto focus. My worry was the camera focusing onto something else in the foreground…. Or picks up a closer face!   As long as the speech givers don’t wander too far from their spot, that’s best right??? Or am I missing something?", "link": "https://www.reddit.com/r/SonyAlpha/comments/p72whe/a7iii_focus_mode_for_filming_wedding_speeches/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii focus mode for filming wedding speeches? /!/ i’m a youtuber but about to use my a7iii for something else and film speeches at my wedding. as they will all be given from the same -----> spot !!!  in the room, my plan was to set the camera up….focused on a test subject at that -----> spot !!! …. and then switch off auto focus. my worry was the camera focusing onto something else in the foreground…. or picks up a closer face!   as long as the speech givers don’t wander too far from their spot, that’s best right??? or am i missing something?", "sortedWord": "None", "identifyer": 44229, "year": "2021"}, {"Unnamed: 0": 153029, "autor": "HamEdits95", "date": 1624810842000, "content": "70-350mm missing focus /!/ I’ve just got the 70-350mm Sony lens for my a6500 and I think it’s great it’s really good but for some reason 70 percent of the time I’m shooting dogs in action it misses focus I’ve tried so many different focus modes like center,zone,wide,flexible spot expandable \nMy settings are 1/1500 shutter, f 4.5 iso 800\nEven a slow running dog it still focuses on the small fresh cut grass even if I focus on the dog and I see in my view finder the dogs in focus when I review them after it always focuses on other stuff other than the dog I’d really appreciate some advice as it sucks to have to sell the lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/o909j7/70350mm_missing_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "70-350mm missing focus /!/ i’ve just got the 70-350mm sony lens for my a6500 and i think it’s great it’s really good but for some reason 70 percent of the time i’m shooting dogs in action it misses focus i’ve tried so many different focus modes like center,zone,wide,flexible -----> spot !!!  expandable \nmy settings are 1/1500 shutter, f 4.5 iso 800\neven a slow running dog it still focuses on the small fresh cut grass even if i focus on the dog and i see in my view finder the dogs in focus when i review them after it always focuses on other stuff other than the dog i’d really appreciate some advice as it sucks to have to sell the lens", "sortedWord": "None", "identifyer": 44426, "year": "2021"}, {"Unnamed: 0": 153575, "autor": "W1cH099", "date": 1630522064000, "content": "Is it possible to keep the camera sensor dust free? /!/ Hello guys! \n\n&amp;#x200B;\n\nso I just cleaned my camera sensor with a wet wipe from a camera cleaning kit and tried taking a photo with a white background on Lightroom to see if it was clean, it still has like 2 tiny spots in there.\n\n&amp;#x200B;\n\nit doesn't annoy me and ill leave it like that but im left wondering, is it possible to keep your sensor 100% dust free? what are your experience guys?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pg0bal/is_it_possible_to_keep_the_camera_sensor_dust_free/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is it possible to keep the camera sensor dust free? /!/ hello guys! \n\n&amp;#x200b;\n\nso i just cleaned my camera sensor with a wet wipe from a camera cleaning kit and tried taking a photo with a white background on lightroom to see if it was clean, it still has like 2 tiny -----> spots !!!  in there.\n\n&amp;#x200b;\n\nit doesn't annoy me and ill leave it like that but im left wondering, is it possible to keep your sensor 100% dust free? what are your experience guys?", "sortedWord": "None", "identifyer": 44988, "year": "2021"}, {"Unnamed: 0": 153673, "autor": "Konmaru-Doma", "date": 1630726087000, "content": "chill spot - A7RII + Sigma 20mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/phjzi1/chill_spot_a7rii_sigma_20mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "chill -----> spot !!!  - a7rii + sigma 20mm", "sortedWord": "None", "identifyer": 45086, "year": "2021"}, {"Unnamed: 0": 154389, "autor": "powerarm", "date": 1618850046000, "content": "How to focus rack / pull with the A6000 /!/ I've seen tutorials done with the higher up models that have touchscreen but I'm having trouble doing a focus rack/pull with mine for video. I have a fixed lens and I can't control the manual focus, so I've tried adjusting the focus to be a flexible spot, but then when I half press the shoot button to refocus the image, it doesn't do the focus rack properly, it blurs up the whole image and then focuses on the flexible spot that I wanted to focus on. Anyone have any idea how to do this manually? I thought if I adjusted the focus spot it would automatically shift to that, but it requires me to half press the shoot button to refocus.", "link": "https://www.reddit.com/r/SonyAlpha/comments/mu4jwt/how_to_focus_rack_pull_with_the_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to focus rack / pull with the a6000 /!/ i've seen tutorials done with the higher up models that have touchscreen but i'm having trouble doing a focus rack/pull with mine for video. i have a fixed lens and i can't control the manual focus, so i've tried adjusting the focus to be a flexible -----> spot !!! , but then when i half press the shoot button to refocus the image, it doesn't do the focus rack properly, it blurs up the whole image and then focuses on the flexible -----> spot !!!  that i wanted to focus on. anyone have any idea how to do this manually? i thought if i adjusted the focus spot it would automatically shift to that, but it requires me to half press the shoot button to refocus.", "sortedWord": "None", "identifyer": 45837, "year": "2021"}, {"Unnamed: 0": 154422, "autor": "Big-Priority-OCTANE", "date": 1619424244000, "content": "can someone tell me what are these patches on my sensor ? /!/ recently i bought a used sony a6300 from my friend. but when i zoom into photos taken by it there were some red spots on the image . it doesn't seem to be a hot pixel. Can someone help me to identify the issue.", "link": "https://www.reddit.com/r/SonyAlpha/comments/myslrk/can_someone_tell_me_what_are_these_patches_on_my/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "can someone tell me what are these patches on my sensor ? /!/ recently i bought a used sony a6300 from my friend. but when i zoom into photos taken by it there were some red -----> spots !!!  on the image . it doesn't seem to be a hot pixel. can someone help me to identify the issue.", "sortedWord": "None", "identifyer": 45872, "year": "2021"}], "name": "spotSonyAlpha2021"}