{"interestingcomments": [{"Unnamed: 0": 31783, "autor": "Bguiliano", "date": 1590334667000, "content": "Animal real time tracking - Sony a7rIV /!/ Hi all,\n\nI just picked up a used 200-600mm and tested it out for the first time yesterday. I found it odd that when i switched the to the animal eye tracking (switched from human) and in AF-C, the focusing mode...spot with tracking was not available. I kept getting an message that its not available when eye focus is switched to Animal. That doesn't seem right, as i thought real time tracking was made, in part, for wildlife. What am i doing wrong? I have it in full manual mode...\n\nthanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/gprpx2/animal_real_time_tracking_sony_a7riv/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "animal real time tracking - sony a7riv /!/ hi all,\n\ni just picked up a used 200-600mm and tested it out for the first time yesterday. i found it odd that when i switched the to the animal eye tracking (switched from human) and in af-c, the focusing mode...-----> spot !!!  with tracking was not available. i kept getting an message that its not available when eye focus is switched to animal. that doesn't seem right, as i thought real time tracking was made, in part, for wildlife. what am i doing wrong? i have it in full manual mode...\n\nthanks", "sortedWord": "None", "identifyer": 32450, "year": "2020"}, {"Unnamed: 0": 31924, "autor": "Harz_marz", "date": 1596699315000, "content": "Spots on my images - please help!", "link": "https://www.reddit.com/r/SonyAlpha/comments/i4ndwr/spots_on_my_images_please_help/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!!  on my images - please help!", "sortedWord": "None", "identifyer": 32592, "year": "2020"}, {"Unnamed: 0": 32222, "autor": "alexrogerswbu", "date": 1606131430000, "content": "Need help with sensor fix! /!/ I have a Sony a6500 with a couple dead pixels (really bright pink spots on all images and videos). I want to replace or fix my sensor and I was wondering if:\n\n1) it was possible!\n2) if there are any recommendations I can go to get this fixed/sensor replaced (I am in the UK!)\n\nAny help would be amazing. Thank you!", "link": "https://www.reddit.com/r/SonyAlpha/comments/jzg21u/need_help_with_sensor_fix/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need help with sensor fix! /!/ i have a sony a6500 with a couple dead pixels (really bright pink -----> spots !!!  on all images and videos). i want to replace or fix my sensor and i was wondering if:\n\n1) it was possible!\n2) if there are any recommendations i can go to get this fixed/sensor replaced (i am in the uk!)\n\nany help would be amazing. thank you!", "sortedWord": "None", "identifyer": 32897, "year": "2020"}, {"Unnamed: 0": 32376, "autor": "universalpasta", "date": 1609221747000, "content": "Spot-billed Pelican | Sony A6000 | 55-210 kit lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/km8i7x/spotbilled_pelican_sony_a6000_55210_kit_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!! -billed pelican | sony a6000 | 55-210 kit lens", "sortedWord": "None", "identifyer": 33057, "year": "2020"}, {"Unnamed: 0": 32403, "autor": "Bad_generalist", "date": 1609199709000, "content": "Didn't spot the 2 yellow bugs until editing! a7iii w/ 50mm Macro", "link": "https://www.reddit.com/r/SonyAlpha/comments/km291d/didnt_spot_the_2_yellow_bugs_until_editing_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "didn't -----> spot !!!  the 2 yellow bugs until editing! a7iii w/ 50mm macro", "sortedWord": "None", "identifyer": 33085, "year": "2020"}, {"Unnamed: 0": 32535, "autor": "Baron_Bathory", "date": 1579276869000, "content": "[a6400] Video settings for well lit set /!/ Hey all,\n\nLooking for some beginner advice. Will be shooting a video soon. The camera will be still, on a tripod and the subject will be well lit and indoor. They'll be moving around on the spot, but there won't be any reason to move around the camera. I'm wondering how I should shoot this. Would shutter priority work? It will be shot in 4k, 30 fps, 100 Mbps. I will set the shutter speed to 1/60 and was planning to just leave ISO auto. Would that work okay? Is there anything important I should note? Quite new to capturing video.  \n\n\nThank you so much in advance :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/eq2928/a6400_video_settings_for_well_lit_set/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[a6400] video settings for well lit set /!/ hey all,\n\nlooking for some beginner advice. will be shooting a video soon. the camera will be still, on a tripod and the subject will be well lit and indoor. they'll be moving around on the -----> spot !!! , but there won't be any reason to move around the camera. i'm wondering how i should shoot this. would shutter priority work? it will be shot in 4k, 30 fps, 100 mbps. i will set the shutter speed to 1/60 and was planning to just leave iso auto. would that work okay? is there anything important i should note? quite new to capturing video.  \n\n\nthank you so much in advance :)", "sortedWord": "None", "identifyer": 33220, "year": "2020"}, {"Unnamed: 0": 32672, "autor": "Sgt-Frame", "date": 1580761620000, "content": "Wildlife spotting on a bounty island / A6000 &amp; 18-135", "link": "https://www.reddit.com/r/SonyAlpha/comments/eydb5m/wildlife_spotting_on_a_bounty_island_a6000_18135/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "wildlife -----> spotting !!!  on a bounty island / a6000 &amp; 18-135", "sortedWord": "None", "identifyer": 33367, "year": "2020"}, {"Unnamed: 0": 33096, "autor": "ItsRayRa", "date": 1588734824000, "content": "A7s Help! Seeing red and blue spots in images", "link": "https://www.reddit.com/r/SonyAlpha/comments/gec7b1/a7s_help_seeing_red_and_blue_spots_in_images/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a7s help! seeing red and blue -----> spots !!!  in images", "sortedWord": "None", "identifyer": 33801, "year": "2020"}, {"Unnamed: 0": 33247, "autor": "akshirsamn", "date": 1582345796000, "content": "Spotted Owlet in Karnataka, India [A6400, MC11, Sigma 150-600C]", "link": "https://www.reddit.com/r/SonyAlpha/comments/f7nkb6/spotted_owlet_in_karnataka_india_a6400_mc11_sigma/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  owlet in karnataka, india [a6400, mc11, sigma 150-600c]", "sortedWord": "None", "identifyer": 33956, "year": "2020"}, {"Unnamed: 0": 33308, "autor": "GunGun-Iceland", "date": 1585563566000, "content": "Going from Sony to Pentax - Overwhelmed with choices /!/  Hello  Sony photographers. I'm have finally decided to take the jump to Sony.  Well the thing is that I'm quite torn on what lenses to buy. I'm a part  time portrait/fashion/advertising photographer at my own studio called [www.epic.is](https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.epic.is%2F%3Ffbclid%3DIwAR3Il1aQYOI_1iXOeedpulzZ_8Xx1w-BViPQsWdtBzHLSEZ-_NeiYz7nFas&amp;h=AT1nFbIEK68wZuvvNM6EZc7dHPK8u0PAy2OYsGcJGDkE3P58kXFf9M9K7yIa7UK5Bph4u_j_LZjQTgg3JXq9OnAp1zxusiIAHu7wMPaYQmPLobMBLmlHvMsDc3ShDdx9EGci6D6waDmsSV4FzjtNybIMm2sS) \n\n Currently I'm shooting Pentax K1 with various lenses. The main reason  I'm switching is the eye focus as the A7 RIV can finally deliver better  MP that the K1. \n\nMy current workhorses.   \n \\- Pentax 24-70 2.8 (  My under pressure lens, If I'm working on a changing area, birthday or  something similar where I have to be shooting portraits and group candid  at the same time I use this lens. )  \n \\- Pentax 100mm Macro ( My favorite portrait lens and crucial for product shoots in Nature )   \n  \\- Sigma 35 1.4 Art. ( Love this one, defiantly outshines the 24-70 and  use it when ever I can, awesome for outdoors and when I take landscapes.  \n\nMy current backups.   \n \\- Pentax 50mm 1.4 ( Only used in  certain advertising shoots, it is sharper than 24-70 but I'm often lazy  to put it on as the 24-70 does the job. )  \n \\- Samyang 85mm 1.4 ( Was my main portrait lens but 100mm Macro just owns that spot ) \n\n Notice that there is a big cap in higher than 100mm, that is because  Pentax does not have good enough auto focus for me to focus on that kind  of photography, so that is a area I'm interested in but not my main  focus. As I said I mostly shoot people and need my gear to focus on that  but having the options is fun.\n\nSo for the Sony talk. I'm trading all my gear away, I will get Sony A7 R IV and then I have some Sigma options. \n\nThe option I'm debating on is getting \n\nSigma 105mm 1.4 Art and with it Sigma 35mm 1.4 Art   \n vs   \n Sigma 24-70mm 2.8 and with it Sigma 35mm 1.4 Art.\n\nAfter this debate I'm ready to spend 4000-6000$ to finish the lens setup. \n\n So my thoughts it that 105 1.4 is a holy grail lens for me but I'm  still wondering if it is worth having as I will always need a macro lens  also and the 90mm Macro seams to stand out for Sony and I think I will  then mostly leave my 105mm at home and take the 90mm instead. I would  love to fit the 105mm into the line up but I don't want it to be forced  there just to have it. \n\n24-70 Sigma on the other hand is getting a  really good reviews but auto focus is a tad slower in tests than the  Sony 24-70 2.8. When I use primes I don´t depend on auto focus a lot but  in this Zoom I want it to be fast and good. Coming from Pentax I think I  will be happy with either choice.\n\nSo when I have made this choice the world opens up and I need to fill my bag 📷:) \n\nSo areas we need to cover In rank of importance.  \n \\- Portrait   \n \\- Fashion   \n \\- Weddings   \n \\- Products Macro   \n \\- Landscapes and aurora \n\nNice to have would be   \n Event and Concerts   \n Sports and Wildlife \n\n First lens I want to ask about is the Sony 90mm Macro is there a good  alternative ? Is there some other lens that does a great macro job but  is maybe 50-70mm as that gives me a better room for the 105mm ? \n\nIf I choose the 105mm Sigma I will need to buy a 24-70 lens I guess the Sony 2.8 here is a no brainer ? \n\n Otherwise if I choose the 24-70 Sigma Art then I will have to choose a  portrait lens, something that will not be to close with the macro so if  the Macro lens is 90mm I'm not going with a 85mm lens then I'm looking  more into 135mm or 50mm ( Also thinking the 50mm might be nice to have  for video ) The33 Sony 135mm 1.8 is interesting here or the Sigma 135. \n\nSo if I have the setup   \n Macro lens   \n Portrait lens ( long )  \n 24-70  \n 35 art lens \n\n Maybe money is better spent adding a 50mm or something that will  increase depth of lenses for people photography. Otherwise I'm looking  at 100-400 or some nice 70-200mm to open up that area. \n\nSo here  are my thoughts, so for the long read this is just a whole lot of  options for someone coming out of Pentax and I want to do my research  and do this right. I'm in no hurry.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fro7ho/going_from_sony_to_pentax_overwhelmed_with_choices/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "going from sony to pentax - overwhelmed with choices /!/  hello  sony photographers. i'm have finally decided to take the jump to sony.  well the thing is that i'm quite torn on what lenses to buy. i'm a part  time portrait/fashion/advertising photographer at my own studio called [www.epic.is](https://l.facebook.com/l.php?u=http%3a%2f%2fwww.epic.is%2f%3ffbclid%3diwar3il1aqyoi_1ixoeedpulzz_8xx1w-bvipqswdtbzhlsez-_neiyz7nfas&amp;h=at1nfbiek68wzuvvnm6ezc7dhpk8u0pay2oysgcjgdke3p58kxff9m9k7yia7uk5bph4u_j_lzjqtgg3jxq9onap1zxusiiahu7wmpayqmplobmblmlhvmsdc3shddx9egci6d6wadmssv4fzjtnybimm2ss) \n\n currently i'm shooting pentax k1 with various lenses. the main reason  i'm switching is the eye focus as the a7 riv can finally deliver better  mp that the k1. \n\nmy current workhorses.   \n \\- pentax 24-70 2.8 (  my under pressure lens, if i'm working on a changing area, birthday or  something similar where i have to be shooting portraits and group candid  at the same time i use this lens. )  \n \\- pentax 100mm macro ( my favorite portrait lens and crucial for product shoots in nature )   \n  \\- sigma 35 1.4 art. ( love this one, defiantly outshines the 24-70 and  use it when ever i can, awesome for outdoors and when i take landscapes.  \n\nmy current backups.   \n \\- pentax 50mm 1.4 ( only used in  certain advertising shoots, it is sharper than 24-70 but i'm often lazy  to put it on as the 24-70 does the job. )  \n \\- samyang 85mm 1.4 ( was my main portrait lens but 100mm macro just owns that -----> spot !!!  ) \n\n notice that there is a big cap in higher than 100mm, that is because  pentax does not have good enough auto focus for me to focus on that kind  of photography, so that is a area i'm interested in but not my main  focus. as i said i mostly shoot people and need my gear to focus on that  but having the options is fun.\n\nso for the sony talk. i'm trading all my gear away, i will get sony a7 r iv and then i have some sigma options. \n\nthe option i'm debating on is getting \n\nsigma 105mm 1.4 art and with it sigma 35mm 1.4 art   \n vs   \n sigma 24-70mm 2.8 and with it sigma 35mm 1.4 art.\n\nafter this debate i'm ready to spend 4000-6000$ to finish the lens setup. \n\n so my thoughts it that 105 1.4 is a holy grail lens for me but i'm  still wondering if it is worth having as i will always need a macro lens  also and the 90mm macro seams to stand out for sony and i think i will  then mostly leave my 105mm at home and take the 90mm instead. i would  love to fit the 105mm into the line up but i don't want it to be forced  there just to have it. \n\n24-70 sigma on the other hand is getting a  really good reviews but auto focus is a tad slower in tests than the  sony 24-70 2.8. when i use primes i don´t depend on auto focus a lot but  in this zoom i want it to be fast and good. coming from pentax i think i  will be happy with either choice.\n\nso when i have made this choice the world opens up and i need to fill my bag 📷:) \n\nso areas we need to cover in rank of importance.  \n \\- portrait   \n \\- fashion   \n \\- weddings   \n \\- products macro   \n \\- landscapes and aurora \n\nnice to have would be   \n event and concerts   \n sports and wildlife \n\n first lens i want to ask about is the sony 90mm macro is there a good  alternative ? is there some other lens that does a great macro job but  is maybe 50-70mm as that gives me a better room for the 105mm ? \n\nif i choose the 105mm sigma i will need to buy a 24-70 lens i guess the sony 2.8 here is a no brainer ? \n\n otherwise if i choose the 24-70 sigma art then i will have to choose a  portrait lens, something that will not be to close with the macro so if  the macro lens is 90mm i'm not going with a 85mm lens then i'm looking  more into 135mm or 50mm ( also thinking the 50mm might be nice to have  for video ) the33 sony 135mm 1.8 is interesting here or the sigma 135. \n\nso if i have the setup   \n macro lens   \n portrait lens ( long )  \n 24-70  \n 35 art lens \n\n maybe money is better spent adding a 50mm or something that will  increase depth of lenses for people photography. otherwise i'm looking  at 100-400 or some nice 70-200mm to open up that area. \n\nso here  are my thoughts, so for the long read this is just a whole lot of  options for someone coming out of pentax and i want to do my research  and do this right. i'm in no hurry.", "sortedWord": "None", "identifyer": 34017, "year": "2020"}, {"Unnamed: 0": 33518, "autor": "shesellsseashells15", "date": 1596512251000, "content": "Help with finding out focus mode/points from my photos (Sony a6000) /!/ Hi all. I am a beginner photographer, and am starting to get really confused between eye AF, face detection, when to use AF-S and AF-C, wide vs spot focus. I took some photos recently of my friend and was quite disappointed with how they turned out. \n\nI'm looking back at old photos that I took when I knew literally nothing about cameras and the photos were much better! I guess I am overthinking things now. But I want to know which focus modes and focus areas I was using to get these shots: [https://imgur.com/a/vMX8RHD](https://imgur.com/a/vMX8RHD) \n\nWhen taking these photos, I was in a MOVING tuk-tuk in India and these photos came out better than I expected. I'm wondering how I was able to get these people in focus with the bars of the tuk-tuk blurred, and the example of the bike shop owner in focus with the man passing on the left blurred. Does that mean I was likely using something like a focus spot in the center, since a wide focus area would have put the closest thing to my lens in focus? I really cannot remember what settings I used, the ride and the photo taking happened so fast. I do know I would usually like to focus in the center and recompose.. but in these photos it looks like there is a lot more in focus than what is just in the center. (or is that not what focus in the center means)? \n\nSince I discovered eye-AF and face detection, it threw me off because I didn't really know what I was doing! I know these can be really useful tools, but sometimes ignorance is bliss..\n\nMost of these photos are f/2.0 and 1/1250 sec at ISO Auto. Taken on Sony a6000 with 35mm F1.8 OSS lens. \n\nI am using Lightroom CC and unfortunately that program does not allow plug-ins, but I was hoping a trained photographer eye could tell maybe by just looking at it? \n\nAny help or advice would be really appreciated!", "link": "https://www.reddit.com/r/SonyAlpha/comments/i3c16g/help_with_finding_out_focus_modepoints_from_my/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with finding out focus mode/points from my photos (sony a6000) /!/ hi all. i am a beginner photographer, and am starting to get really confused between eye af, face detection, when to use af-s and af-c, wide vs -----> spot !!!  focus. i took some photos recently of my friend and was quite disappointed with how they turned out. \n\ni'm looking back at old photos that i took when i knew literally nothing about cameras and the photos were much better! i guess i am overthinking things now. but i want to know which focus modes and focus areas i was using to get these shots: [https://imgur.com/a/vmx8rhd](https://imgur.com/a/vmx8rhd) \n\nwhen taking these photos, i was in a moving tuk-tuk in india and these photos came out better than i expected. i'm wondering how i was able to get these people in focus with the bars of the tuk-tuk blurred, and the example of the bike shop owner in focus with the man passing on the left blurred. does that mean i was likely using something like a focus spot in the center, since a wide focus area would have put the closest thing to my lens in focus? i really cannot remember what settings i used, the ride and the photo taking happened so fast. i do know i would usually like to focus in the center and recompose.. but in these photos it looks like there is a lot more in focus than what is just in the center. (or is that not what focus in the center means)? \n\nsince i discovered eye-af and face detection, it threw me off because i didn't really know what i was doing! i know these can be really useful tools, but sometimes ignorance is bliss..\n\nmost of these photos are f/2.0 and 1/1250 sec at iso auto. taken on sony a6000 with 35mm f1.8 oss lens. \n\ni am using lightroom cc and unfortunately that program does not allow plug-ins, but i was hoping a trained photographer eye could tell maybe by just looking at it? \n\nany help or advice would be really appreciated!", "sortedWord": "None", "identifyer": 34230, "year": "2020"}, {"Unnamed: 0": 33563, "autor": "Nate072107", "date": 1596469019000, "content": "Hiked to a little spot in the Smokey’s. This is actually my first attempt at a long exposer. Any advise would be much appreciated. ⛰ a7iii \\Tamron 20mm 2.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/i2z7dl/hiked_to_a_little_spot_in_the_smokeys_this_is/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hiked to a little -----> spot !!!  in the smokey’s. this is actually my first attempt at a long exposer. any advise would be much appreciated. ⛰ a7iii \\tamron 20mm 2.8", "sortedWord": "None", "identifyer": 34275, "year": "2020"}, {"Unnamed: 0": 33627, "autor": "Sirchacha", "date": 1598111612000, "content": "Dumb newbie issue with af system /!/ Hi I grabbed a used a6000 earlier this year but since I got it I haven't been able to get the like little dot autofocus system back, I went to flexible spot for photography but now I can't seem to get that crazy always changing af dots it's just the bigger \"multi\" squares. What an I'm missing and for photography would you guys recommend that system or the flexible spot?", "link": "https://www.reddit.com/r/SonyAlpha/comments/iekurf/dumb_newbie_issue_with_af_system/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dumb newbie issue with af system /!/ hi i grabbed a used a6000 earlier this year but since i got it i haven't been able to get the like little dot autofocus system back, i went to flexible -----> spot !!!  for photography but now i can't seem to get that crazy always changing af dots it's just the bigger \"multi\" squares. what an i'm missing and for photography would you guys recommend that system or the flexible spot?", "sortedWord": "None", "identifyer": 34340, "year": "2020"}, {"Unnamed: 0": 33765, "autor": "citizenkanus", "date": 1599571201000, "content": "Sunset over Lake Michigan. The spot was almost perfect if not for the trees in the center. Shot with Sony a7iii 28-70mm.", "link": "https://www.reddit.com/r/SonyAlpha/comments/iotez2/sunset_over_lake_michigan_the_spot_was_almost/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sunset over lake michigan. the -----> spot !!!  was almost perfect if not for the trees in the center. shot with sony a7iii 28-70mm.", "sortedWord": "None", "identifyer": 34486, "year": "2020"}, {"Unnamed: 0": 33900, "autor": "Hexxen-panda", "date": 1602793150000, "content": "Professor Pringles | Sony a6000 | Sigma 56mm 1.4 /!/ &amp;#x200B;\n\n[Thinking about upgrading to either FF or A6400 once I have the money for it. The A6000 takes amazing images, but I find myself spotting so many mistakes in post that I couldn't see in the little low-res viewfinder. ](https://preview.redd.it/fb84c4xzgbt51.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=8c33c31d8166b5ad3c427f6c7ac2dbd3ed5f8a83)", "link": "https://www.reddit.com/r/SonyAlpha/comments/jbvfg2/professor_pringles_sony_a6000_sigma_56mm_14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "professor pringles | sony a6000 | sigma 56mm 1.4 /!/ &amp;#x200b;\n\n[thinking about upgrading to either ff or a6400 once i have the money for it. the a6000 takes amazing images, but i find myself -----> spotting !!!  so many mistakes in post that i couldn't see in the little low-res viewfinder. ](https://preview.redd.it/fb84c4xzgbt51.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=8c33c31d8166b5ad3c427f6c7ac2dbd3ed5f8a83)", "sortedWord": "None", "identifyer": 34622, "year": "2020"}, {"Unnamed: 0": 34133, "autor": "wokebuffalo", "date": 1605916625000, "content": "Gizmo Spots a Laser Dot | a6000 &amp; Sigma 30mm f1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/jy0i4l/gizmo_spots_a_laser_dot_a6000_sigma_30mm_f14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "gizmo -----> spots !!!  a laser dot | a6000 &amp; sigma 30mm f1.4", "sortedWord": "None", "identifyer": 34867, "year": "2020"}, {"Unnamed: 0": 34356, "autor": "CountVaukav", "date": 1583116625000, "content": "Weird red spots on photo when using Exposure X5. Anyone else encounter this? (A7II kit lens)", "link": "https://www.reddit.com/r/SonyAlpha/comments/fc58f2/weird_red_spots_on_photo_when_using_exposure_x5/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird red -----> spots !!!  on photo when using exposure x5. anyone else encounter this? (a7ii kit lens)", "sortedWord": "None", "identifyer": 35098, "year": "2020"}, {"Unnamed: 0": 34530, "autor": "NA__Scrubbed", "date": 1578366000000, "content": "24-105 f4 G and Batis 40 2 CF test /!/ So I recently acquired a copy of the 24-105 f4 G lens in a swap for one of my other lenses and I thought I would check the close focus performance against my current CF champ, the Batis 40. They have fairly similar reproduction ratios, with the [24-105 pulling just ahead](https://www.bhphotovideo.com/c/product/1369442-REG/sony_sel24105g_fe_24_105mm_f_4_g.html/specs) at 0.31x to the [Batis' 0.3x](https://www.bhphotovideo.com/c/product/1436738-REG/zeiss_000000_2239_137_batis_40mm_f_2_cf.html/specs) magnification. The reason I thought this comparison had some merit was because they're both trying to be 'the minivan' in different ways, and both are things you might consider taking outdoors for a walkabout and in the process grab some impromptu shots of flowers and insects. \n\nWith that said, let's have a look at the scene:\n\n[Batis 40 f11](https://preview.redd.it/o354osolh9941.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=8bf3e3a021b0e07e2842396e75ca457e270a5d0f)\n\n&amp;#x200B;\n\n[24-105g f11](https://preview.redd.it/zyk34roih9941.jpg?width=2875&amp;format=pjpg&amp;auto=webp&amp;s=26780bb8f468fb06f13586fa086896cf7802c4ec)\n\n&amp;#x200B;\n\nAs you can see, both lenses do a pretty good job. I'm a little more impressed by the zoom honestly, as it has the much more complex design and difficult job. That being said, even without pixel peeping the Batis has an advantage when it comes to large scale contrast and color reproduction—however I'm not sure it's significant enough that I'd be able to tell if the images weren't side by side. To be clear, I did nothing to these images after capture other than import them to Capture One express and convert them to jpeg. All default settings were used. Before we get into some pretty heavy crop comparisons, let's get a few things out of the way. \n\n1. Due to the Batis having both a wider focal length *and* a lower magnification, I expect it to have more depth of field than the 24-105 at every magnification. This will be an advantage in the field if the G zoom doesn't provide superior resolution with its extra 0.01x magnification (unlikely to be significant, even if the 24-105 is very good.).\n2. While I may have alluded to it before, I am explicitly expecting the Batis to perform better here based on two facts. The first is that they are similarly priced lenses with one being a prime and one being a zoom. Primes being simpler to manufacture and design are usually optically superior to same generation zooms. Secondly, the Batis is already stopped down twice just to get even with the 24-105's aperture wide open. This should also deliver a better performance. \n3. The body used was an a7iii, locked down on a tripod for all comparison shots. ISO was set to 100, and with each change in aperture I adjusted the shutter speed until I metered 0 EV on a -2—+2 scale. This comparison was a little imperfect in the setup, as I don't have a macro slider on me and had to manually move the tripod on carpet to get to my focus point. I managed to get my focus point for both lenses under a centimeter apart from each other, but they are not focused on the exact same spot. Still, the focus points are close enough to be within my 400% crop so I don't think this comparison is completely invalidated. \n\nLet's get going on the crops. Starting with center crops. \n\n[Batis 40 f4](https://preview.redd.it/8t5mox9qm9941.jpg?width=577&amp;format=pjpg&amp;auto=webp&amp;s=024e6704b8a0e4c672bb3712e21b78ead82149c8)\n\n[24-105 f4](https://preview.redd.it/290llm1wm9941.jpg?width=584&amp;format=pjpg&amp;auto=webp&amp;s=74cebd4fa02eb41269127682851ac49cab99454f)\n\n[Batis 40 f5.6](https://preview.redd.it/mn1sjt93n9941.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=b40478226599a8b05da4d422424b5c1f39ddec67)\n\n[24-105 f5.6](https://preview.redd.it/ibcgjiy5n9941.jpg?width=548&amp;format=pjpg&amp;auto=webp&amp;s=836487df67353469a1d75d5ba0fc37b41993a10e)\n\n[Batis 40 f11](https://preview.redd.it/bvcbswj9n9941.jpg?width=543&amp;format=pjpg&amp;auto=webp&amp;s=29c0f4ed6197f6583a6c26c781d39467da727190)\n\n[24-105 f11](https://preview.redd.it/8bhl87ven9941.jpg?width=546&amp;format=pjpg&amp;auto=webp&amp;s=57f05c6b6354181ef95e46e7258db5f6c8015e78)\n\n*Processing img ohkqs89in9941...*\n\n[24-105 f16](https://preview.redd.it/yzhgr8wkn9941.jpg?width=546&amp;format=pjpg&amp;auto=webp&amp;s=34226a98d7816df1ef64f7bb007a65b24aeeb98f)\n\n&amp;#x200B;\n\nOkay, a few things to take away here. \n\n1. The Batis lens has levels of fine (or micro, if you will) contrast that surpass the zoom at every aperture. This isn't too surprising, as higher element counts lead to lower contrast ratios usually. See [this article](http://www.dslrbodies.com/lenses/lens-articles/what-is-micro-contrast.html) for further reading.\n2. Resolution on the Batis appears to be higher at every aperture as well. As stated earlier, this is the expected result. \n3. Both lenses seem to start getting diffraction limited on f16. \n4. Also as expected: the Batis seems to have greater depth of field at every aperture. \n\nLet's look a bit off center, to see how the DOF and IQ extend a bit away from the center. This will be the last comparison, as this scene has a lot of depth and any kind of corner crop would require focus stacking.\n\n[Batis 40 f11](https://preview.redd.it/cn85v3zgs9941.jpg?width=544&amp;format=pjpg&amp;auto=webp&amp;s=ac8d5bdecb7721326d371c5a00581753dde3d560)\n\n[24-105 f11](https://preview.redd.it/juath58ls9941.jpg?width=557&amp;format=pjpg&amp;auto=webp&amp;s=e80ff54861189969d0fe6a9deae9544a6bad81db)\n\n[Batis 40 f16](https://preview.redd.it/uldltyvps9941.jpg?width=544&amp;format=pjpg&amp;auto=webp&amp;s=381f00a64d8e6bdd83ddb44f2e3ff2e7c39a991a)\n\n[24-105 f16](https://preview.redd.it/bsp31cyrs9941.jpg?width=557&amp;format=pjpg&amp;auto=webp&amp;s=718c4514283a701673e5b444cdb64c144b06c794)\n\n[Batis 40 f16](https://preview.redd.it/2p12617us9941.jpg?width=547&amp;format=pjpg&amp;auto=webp&amp;s=2a43a6cca1084d0bbc272a97cdd45c8f3342b3d0)\n\n[24-105 f16](https://preview.redd.it/v467l5wkt9941.jpg?width=542&amp;format=pjpg&amp;auto=webp&amp;s=9e792604b2fca5728cf368bfe8d066135213e080)\n\nAs we can see, off center it's a bit more of the same. Using the leaf edge and bodies as crops shows that the Batis 40 performs better with a greater depth of field. \n\nWith this comparison we can see that the 40 is as expected: the superior lens in terms of close focus performance. However, the 24-105 performed pretty well honestly. If you have the lens (and indeed, most people probably would have the 24-105 over the Batis 40), it's a pretty great performer in close up shots.", "link": "https://www.reddit.com/r/SonyAlpha/comments/el5647/24105_f4_g_and_batis_40_2_cf_test/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "24-105 f4 g and batis 40 2 cf test /!/ so i recently acquired a copy of the 24-105 f4 g lens in a swap for one of my other lenses and i thought i would check the close focus performance against my current cf champ, the batis 40. they have fairly similar reproduction ratios, with the [24-105 pulling just ahead](https://www.bhphotovideo.com/c/product/1369442-reg/sony_sel24105g_fe_24_105mm_f_4_g.html/specs) at 0.31x to the [batis' 0.3x](https://www.bhphotovideo.com/c/product/1436738-reg/zeiss_000000_2239_137_batis_40mm_f_2_cf.html/specs) magnification. the reason i thought this comparison had some merit was because they're both trying to be 'the minivan' in different ways, and both are things you might consider taking outdoors for a walkabout and in the process grab some impromptu shots of flowers and insects. \n\nwith that said, let's have a look at the scene:\n\n[batis 40 f11](https://preview.redd.it/o354osolh9941.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=8bf3e3a021b0e07e2842396e75ca457e270a5d0f)\n\n&amp;#x200b;\n\n[24-105g f11](https://preview.redd.it/zyk34roih9941.jpg?width=2875&amp;format=pjpg&amp;auto=webp&amp;s=26780bb8f468fb06f13586fa086896cf7802c4ec)\n\n&amp;#x200b;\n\nas you can see, both lenses do a pretty good job. i'm a little more impressed by the zoom honestly, as it has the much more complex design and difficult job. that being said, even without pixel peeping the batis has an advantage when it comes to large scale contrast and color reproduction—however i'm not sure it's significant enough that i'd be able to tell if the images weren't side by side. to be clear, i did nothing to these images after capture other than import them to capture one express and convert them to jpeg. all default settings were used. before we get into some pretty heavy crop comparisons, let's get a few things out of the way. \n\n1. due to the batis having both a wider focal length *and* a lower magnification, i expect it to have more depth of field than the 24-105 at every magnification. this will be an advantage in the field if the g zoom doesn't provide superior resolution with its extra 0.01x magnification (unlikely to be significant, even if the 24-105 is very good.).\n2. while i may have alluded to it before, i am explicitly expecting the batis to perform better here based on two facts. the first is that they are similarly priced lenses with one being a prime and one being a zoom. primes being simpler to manufacture and design are usually optically superior to same generation zooms. secondly, the batis is already stopped down twice just to get even with the 24-105's aperture wide open. this should also deliver a better performance. \n3. the body used was an a7iii, locked down on a tripod for all comparison shots. iso was set to 100, and with each change in aperture i adjusted the shutter speed until i metered 0 ev on a -2—+2 scale. this comparison was a little imperfect in the setup, as i don't have a macro slider on me and had to manually move the tripod on carpet to get to my focus point. i managed to get my focus point for both lenses under a centimeter apart from each other, but they are not focused on the exact same -----> spot !!! . still, the focus points are close enough to be within my 400% crop so i don't think this comparison is completely invalidated. \n\nlet's get going on the crops. starting with center crops. \n\n[batis 40 f4](https://preview.redd.it/8t5mox9qm9941.jpg?width=577&amp;format=pjpg&amp;auto=webp&amp;s=024e6704b8a0e4c672bb3712e21b78ead82149c8)\n\n[24-105 f4](https://preview.redd.it/290llm1wm9941.jpg?width=584&amp;format=pjpg&amp;auto=webp&amp;s=74cebd4fa02eb41269127682851ac49cab99454f)\n\n[batis 40 f5.6](https://preview.redd.it/mn1sjt93n9941.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=b40478226599a8b05da4d422424b5c1f39ddec67)\n\n[24-105 f5.6](https://preview.redd.it/ibcgjiy5n9941.jpg?width=548&amp;format=pjpg&amp;auto=webp&amp;s=836487df67353469a1d75d5ba0fc37b41993a10e)\n\n[batis 40 f11](https://preview.redd.it/bvcbswj9n9941.jpg?width=543&amp;format=pjpg&amp;auto=webp&amp;s=29c0f4ed6197f6583a6c26c781d39467da727190)\n\n[24-105 f11](https://preview.redd.it/8bhl87ven9941.jpg?width=546&amp;format=pjpg&amp;auto=webp&amp;s=57f05c6b6354181ef95e46e7258db5f6c8015e78)\n\n*processing img ohkqs89in9941...*\n\n[24-105 f16](https://preview.redd.it/yzhgr8wkn9941.jpg?width=546&amp;format=pjpg&amp;auto=webp&amp;s=34226a98d7816df1ef64f7bb007a65b24aeeb98f)\n\n&amp;#x200b;\n\nokay, a few things to take away here. \n\n1. the batis lens has levels of fine (or micro, if you will) contrast that surpass the zoom at every aperture. this isn't too surprising, as higher element counts lead to lower contrast ratios usually. see [this article](http://www.dslrbodies.com/lenses/lens-articles/what-is-micro-contrast.html) for further reading.\n2. resolution on the batis appears to be higher at every aperture as well. as stated earlier, this is the expected result. \n3. both lenses seem to start getting diffraction limited on f16. \n4. also as expected: the batis seems to have greater depth of field at every aperture. \n\nlet's look a bit off center, to see how the dof and iq extend a bit away from the center. this will be the last comparison, as this scene has a lot of depth and any kind of corner crop would require focus stacking.\n\n[batis 40 f11](https://preview.redd.it/cn85v3zgs9941.jpg?width=544&amp;format=pjpg&amp;auto=webp&amp;s=ac8d5bdecb7721326d371c5a00581753dde3d560)\n\n[24-105 f11](https://preview.redd.it/juath58ls9941.jpg?width=557&amp;format=pjpg&amp;auto=webp&amp;s=e80ff54861189969d0fe6a9deae9544a6bad81db)\n\n[batis 40 f16](https://preview.redd.it/uldltyvps9941.jpg?width=544&amp;format=pjpg&amp;auto=webp&amp;s=381f00a64d8e6bdd83ddb44f2e3ff2e7c39a991a)\n\n[24-105 f16](https://preview.redd.it/bsp31cyrs9941.jpg?width=557&amp;format=pjpg&amp;auto=webp&amp;s=718c4514283a701673e5b444cdb64c144b06c794)\n\n[batis 40 f16](https://preview.redd.it/2p12617us9941.jpg?width=547&amp;format=pjpg&amp;auto=webp&amp;s=2a43a6cca1084d0bbc272a97cdd45c8f3342b3d0)\n\n[24-105 f16](https://preview.redd.it/v467l5wkt9941.jpg?width=542&amp;format=pjpg&amp;auto=webp&amp;s=9e792604b2fca5728cf368bfe8d066135213e080)\n\nas we can see, off center it's a bit more of the same. using the leaf edge and bodies as crops shows that the batis 40 performs better with a greater depth of field. \n\nwith this comparison we can see that the 40 is as expected: the superior lens in terms of close focus performance. however, the 24-105 performed pretty well honestly. if you have the lens (and indeed, most people probably would have the 24-105 over the batis 40), it's a pretty great performer in close up shots.", "sortedWord": "None", "identifyer": 35278, "year": "2020"}, {"Unnamed: 0": 34978, "autor": "NBP3", "date": 1590090428000, "content": "I've walked past this spot a million times, but on the million and first it really hit me. So happy with this shot. Taken with Sony a6500, 18-105mm F4", "link": "https://www.reddit.com/r/SonyAlpha/comments/go3sqp/ive_walked_past_this_spot_a_million_times_but_on/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've walked past this -----> spot !!!  a million times, but on the million and first it really hit me. so happy with this shot. taken with sony a6500, 18-105mm f4", "sortedWord": "None", "identifyer": 35733, "year": "2020"}, {"Unnamed: 0": 35267, "autor": "brybry1416", "date": 1592544689000, "content": "Just did this on the spot, looking to get some insight:)", "link": "https://www.reddit.com/r/SonyAlpha/comments/hbuwei/just_did_this_on_the_spot_looking_to_get_some/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just did this on the -----> spot !!! , looking to get some insight:)", "sortedWord": "None", "identifyer": 36028, "year": "2020"}, {"Unnamed: 0": 35429, "autor": "GavinKrohm", "date": 1586877958000, "content": "Raccoon Butterflyfish I spotted off the coast of Hawaii during a dive. They're quite common but such beautiful animals nonetheless. Taken with Sony A7S. - If you like this I have plenty more on my Instagram: GavinKrohm", "link": "https://www.reddit.com/r/SonyAlpha/comments/g17jte/raccoon_butterflyfish_i_spotted_off_the_coast_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "raccoon butterflyfish i -----> spotted !!!  off the coast of hawaii during a dive. they're quite common but such beautiful animals nonetheless. taken with sony a7s. - if you like this i have plenty more on my instagram: gavinkrohm", "sortedWord": "None", "identifyer": 36197, "year": "2020"}, {"Unnamed: 0": 35488, "autor": "Illwarthog", "date": 1586805289000, "content": "A question about lens mechanics. /!/ So some lenses focus easily, and some search more, especially in low light.\n\nMy question is why this would matter from lens to lens. \n\nFor example my 50 f1.8 kinda sucks in low light and searches a lot, yet it’s a relatively sharp lens I would think. Is it not the camera body that finds the focus and stops the motors in the lens? I realize the speed of the focus would be on the speed of the motors able to get the the focus spot. But the searching.. what’s up with that.", "link": "https://www.reddit.com/r/SonyAlpha/comments/g0pky2/a_question_about_lens_mechanics/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a question about lens mechanics. /!/ so some lenses focus easily, and some search more, especially in low light.\n\nmy question is why this would matter from lens to lens. \n\nfor example my 50 f1.8 kinda sucks in low light and searches a lot, yet it’s a relatively sharp lens i would think. is it not the camera body that finds the focus and stops the motors in the lens? i realize the speed of the focus would be on the speed of the motors able to get the the focus -----> spot !!! . but the searching.. what’s up with that.", "sortedWord": "None", "identifyer": 36256, "year": "2020"}, {"Unnamed: 0": 35512, "autor": "project_papi_", "date": 1586783987000, "content": "Sensor spots. Giottos air blaster not cutting it. Any suggestions?", "link": "https://www.reddit.com/r/SonyAlpha/comments/g0istg/sensor_spots_giottos_air_blaster_not_cutting_it/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sensor -----> spots !!! . giottos air blaster not cutting it. any suggestions?", "sortedWord": "None", "identifyer": 36280, "year": "2020"}, {"Unnamed: 0": 35737, "autor": "Reverend_Bad_Mood", "date": 1588611725000, "content": "Help with prime lens selection for a new A7III /!/ Good day all. I'm new to this community but not new to photography. Just in terms of my background, I'm not a pro, but it's a hobby. I got my first film camera back in 1989, a Konica FC-1. Then in the mid-1990s, I got a used Olympus OM-10 and then a second one a couple years later. I had a few different lenses over the years for them, and I used my OM-10s up until 2014. I gave my film camera to my nephews last year.\n\nAt this point, I skipped right over DSLR and on the advice of a friend, took a look at the Sony RX100II. By that time, my interests were mostly travel-related to include city/street photography, landscape (think mountains/beaches) and architecture (churches, buildings, etc). This camera won me over mostly on its compact size which was very nice for travel (I've always been a one-bag, carry-only only sort of traveler). And of course it really does make a nice photograph.\n\nSo with my background out of the way, the A7III caught my eye when it was released and seemed like a body right in the sweet spot of cost/performance. I don't do much if any video and it seems that run 2020, this is still a good match for me.\n\nI think I've decided I'm going to start off with a single prime lens. I've made this decision after the realization that on my RX100 I very rarely ever use the zoom. I find myself typically zoomed all the way out, and if I don't like the framing or composition, I will move closer if I can or perhaps do some cropping in Capture One.\n\nThere is a bunch of buzz around the Sigma 40mm ART lens and while impressive, I think it is too heavy and unwieldy for the sort of uses I have in mind and the amount of travel I try to do (though 2020 is likely going to be a dud :( ). I took a close look at Sony prime GM lenses with E-mount for the A7III and I guess I'm just trying to decide which direction to go.\n\nThe 24mm f/1.4 seems like a ridiculously good lens that is a good compromise for my typical uses. For mountains or landscapes, the wide angle is adequate if not good. And for street use, you typically have to fiddle with your position, but I've seen some great images online. Finally, the f/1.4 will be nice for low-light scenarios -- think old churches/cathedrals I might visit on my travels. That's a challenge for me now. I generally don't use flash in that setting, permitted or not.\n\nBut then there's the cost. Technically, this in my budget, but I can't help but wonder: given what I've described, would I be better served by the Sony 20mm G-Lens, not G-Master (is that right?? I'm not familiar with all the lens quality levels yet) f/1.8 and I also see Sony has an f/2.8 16mm (non G-anything model) combined with their 35mm (non G-anything) lens for street type of images?\n\nThere is a lot here, I realize. I'm happy to hear from anyone who has made a similar journey in thought and learn what you eventually decided and why. If I can provide any more background to help you help me, please let me know.\n\nAlso, it seems that none of these components are significantly discounted at any place that sells them - Amazon, Adorama, etc. all have this stuff for about the same price. I bought my RX100 from Amazon, but can someone tell me any advantages from buying from a more camera-specific dealer online?", "link": "https://www.reddit.com/r/SonyAlpha/comments/gdfeoa/help_with_prime_lens_selection_for_a_new_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with prime lens selection for a new a7iii /!/ good day all. i'm new to this community but not new to photography. just in terms of my background, i'm not a pro, but it's a hobby. i got my first film camera back in 1989, a konica fc-1. then in the mid-1990s, i got a used olympus om-10 and then a second one a couple years later. i had a few different lenses over the years for them, and i used my om-10s up until 2014. i gave my film camera to my nephews last year.\n\nat this point, i skipped right over dslr and on the advice of a friend, took a look at the sony rx100ii. by that time, my interests were mostly travel-related to include city/street photography, landscape (think mountains/beaches) and architecture (churches, buildings, etc). this camera won me over mostly on its compact size which was very nice for travel (i've always been a one-bag, carry-only only sort of traveler). and of course it really does make a nice photograph.\n\nso with my background out of the way, the a7iii caught my eye when it was released and seemed like a body right in the sweet -----> spot !!!  of cost/performance. i don't do much if any video and it seems that run 2020, this is still a good match for me.\n\ni think i've decided i'm going to start off with a single prime lens. i've made this decision after the realization that on my rx100 i very rarely ever use the zoom. i find myself typically zoomed all the way out, and if i don't like the framing or composition, i will move closer if i can or perhaps do some cropping in capture one.\n\nthere is a bunch of buzz around the sigma 40mm art lens and while impressive, i think it is too heavy and unwieldy for the sort of uses i have in mind and the amount of travel i try to do (though 2020 is likely going to be a dud :( ). i took a close look at sony prime gm lenses with e-mount for the a7iii and i guess i'm just trying to decide which direction to go.\n\nthe 24mm f/1.4 seems like a ridiculously good lens that is a good compromise for my typical uses. for mountains or landscapes, the wide angle is adequate if not good. and for street use, you typically have to fiddle with your position, but i've seen some great images online. finally, the f/1.4 will be nice for low-light scenarios -- think old churches/cathedrals i might visit on my travels. that's a challenge for me now. i generally don't use flash in that setting, permitted or not.\n\nbut then there's the cost. technically, this in my budget, but i can't help but wonder: given what i've described, would i be better served by the sony 20mm g-lens, not g-master (is that right?? i'm not familiar with all the lens quality levels yet) f/1.8 and i also see sony has an f/2.8 16mm (non g-anything model) combined with their 35mm (non g-anything) lens for street type of images?\n\nthere is a lot here, i realize. i'm happy to hear from anyone who has made a similar journey in thought and learn what you eventually decided and why. if i can provide any more background to help you help me, please let me know.\n\nalso, it seems that none of these components are significantly discounted at any place that sells them - amazon, adorama, etc. all have this stuff for about the same price. i bought my rx100 from amazon, but can someone tell me any advantages from buying from a more camera-specific dealer online?", "sortedWord": "None", "identifyer": 36507, "year": "2020"}, {"Unnamed: 0": 35984, "autor": "Jdsd77", "date": 1581539803000, "content": "Hollywood Nights! Taken from one of my new favorite sunset spots, Barnsdall Park...I’ve been shooting more multi shot panoramic images lately. This one was around 12 images, stitched together in Lightroom. Sony A7RIII : Sony 85 FE 1/100sec, f4, ISO 400", "link": "https://www.reddit.com/r/SonyAlpha/comments/f2xn01/hollywood_nights_taken_from_one_of_my_new/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hollywood nights! taken from one of my new favorite sunset -----> spots !!! , barnsdall park...i’ve been shooting more multi shot panoramic images lately. this one was around 12 images, stitched together in lightroom. sony a7riii : sony 85 fe 1/100sec, f4, iso 400", "sortedWord": "None", "identifyer": 36757, "year": "2020"}, {"Unnamed: 0": 36074, "autor": "SCPH1000", "date": 1582224410000, "content": "Unborn Flower: Sony A900, F/2.8, 1/4000s, ISO 100, -1 EXPOSURE, Minolta 85mm lens, spot metered. I tend to like my shots slightly underexposed. This image has only been cropped, no sharpening, no colour boost, no nothing", "link": "https://www.reddit.com/r/SonyAlpha/comments/f6xluc/unborn_flower_sony_a900_f28_14000s_iso_100_1/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "unborn flower: sony a900, f/2.8, 1/4000s, iso 100, -1 exposure, minolta 85mm lens, -----> spot !!!  metered. i tend to like my shots slightly underexposed. this image has only been cropped, no sharpening, no colour boost, no nothing", "sortedWord": "None", "identifyer": 36852, "year": "2020"}, {"Unnamed: 0": 36196, "autor": "seroo_y", "date": 1584648523000, "content": "Why are my pictures not sharp? /!/ I have the Sony a7ii and just recently bought the Sony FE 85mm 1.8. \n\nI quite like it, I shoot RAW and edit my pictures on lightroom but I noticed that my pictures just aren't that sharp compared to other people's.\n\nI did all the settings, I know about the shutter speed, I know about the F stop, I know about the focusing (I do flexible spot focusing where you can change and select a spot to focus on). Also Eye AF does not seem to work, even though I selected the AEL button as Eye AF...\n\nStill, the pictures just don't seem very sharp. it always seems blurry and I have a feeling that pics taken with a new iPhone even look much better and sharper... Is it because the lense just isn't a GM lense and therefore is not as good? I mainly post them on Instagram. I seriously don't know the reason behind it. In my opinion, a $500+ lense should still be very sharp, even when it is not a GM.\n\nWould very much appreciate your experience, thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/flgsxl/why_are_my_pictures_not_sharp/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why are my pictures not sharp? /!/ i have the sony a7ii and just recently bought the sony fe 85mm 1.8. \n\ni quite like it, i shoot raw and edit my pictures on lightroom but i noticed that my pictures just aren't that sharp compared to other people's.\n\ni did all the settings, i know about the shutter speed, i know about the f stop, i know about the focusing (i do flexible -----> spot !!!  focusing where you can change and select a -----> spot !!!  to focus on). also eye af does not seem to work, even though i selected the ael button as eye af...\n\nstill, the pictures just don't seem very sharp. it always seems blurry and i have a feeling that pics taken with a new iphone even look much better and sharper... is it because the lense just isn't a gm lense and therefore is not as good? i mainly post them on instagram. i seriously don't know the reason behind it. in my opinion, a $500+ lense should still be very sharp, even when it is not a gm.\n\nwould very much appreciate your experience, thanks in advance!", "sortedWord": "None", "identifyer": 36976, "year": "2020"}, {"Unnamed: 0": 36258, "autor": "boofreddy882", "date": 1594163294000, "content": "Traditional zoom focal ranges /!/ I was discussing with a Sony mate 'wouldn't it be great if there was a fast zoom that straddled the usual ranges of like,14-24mm and 24-70mm types. \n\nIt got me thinking, on my old Nikon D200 I had a brilliant 17-55 2.8 which I loved. Of course this was about the same as a 24-70 in 35mm terms, but how come there are no actual 17-55mms for full frames out there? This covers 95% of my usage on my A7Riii and I change regularly between my 16-35 and 28-75. A 17-55mm on full frame would be the sweet spot for me, and I expect a lot of other people too. Also because it does the work of two lenses I'd be prepared to pay a premium for that lens too.\n\nArguments we've come with are zooms are compromised on range and speed and size, but there are zooms with bigger ranges (e.g. 100-400, 150-500), plenty of 2.8 zooms and Sony's clearly not afraid to make big expensive lenses. \n\nThe only thing we could come up with is that the optics of a 'wide lens' work differently to a normal / tele lens which is why standard zooms don't tend to be wider than 24mm, but isn't normal supposed to 35mm or 50mm, why is 24mm apparently the cut-off? \n\nAny ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hn5cjr/traditional_zoom_focal_ranges/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "traditional zoom focal ranges /!/ i was discussing with a sony mate 'wouldn't it be great if there was a fast zoom that straddled the usual ranges of like,14-24mm and 24-70mm types. \n\nit got me thinking, on my old nikon d200 i had a brilliant 17-55 2.8 which i loved. of course this was about the same as a 24-70 in 35mm terms, but how come there are no actual 17-55mms for full frames out there? this covers 95% of my usage on my a7riii and i change regularly between my 16-35 and 28-75. a 17-55mm on full frame would be the sweet -----> spot !!!  for me, and i expect a lot of other people too. also because it does the work of two lenses i'd be prepared to pay a premium for that lens too.\n\narguments we've come with are zooms are compromised on range and speed and size, but there are zooms with bigger ranges (e.g. 100-400, 150-500), plenty of 2.8 zooms and sony's clearly not afraid to make big expensive lenses. \n\nthe only thing we could come up with is that the optics of a 'wide lens' work differently to a normal / tele lens which is why standard zooms don't tend to be wider than 24mm, but isn't normal supposed to 35mm or 50mm, why is 24mm apparently the cut-off? \n\nany ideas?", "sortedWord": "None", "identifyer": 37039, "year": "2020"}, {"Unnamed: 0": 36434, "autor": "JamesBoboFay", "date": 1595711909000, "content": "A nice spot to chill in Glacier National Park, Montana | A7iii w/ 24mm GM", "link": "https://www.reddit.com/r/SonyAlpha/comments/hxufp0/a_nice_spot_to_chill_in_glacier_national_park/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a nice -----> spot !!!  to chill in glacier national park, montana | a7iii w/ 24mm gm", "sortedWord": "None", "identifyer": 37219, "year": "2020"}, {"Unnamed: 0": 37376, "autor": "coshelix", "date": 1601892719000, "content": "How to take good backlit photos with A7iii /!/ Hey guys.. I need your wisdom. I recently moved from Nikon and got my A7iii with a  24-70mm GM lens. \nTook my wife out early morning for a photoshoot but all the photos I got with the sun rising on her back were a disaster. Any advice? Spot metering was center.. maybe change it to focus area? Please guide this poor soul to take better backlit pics :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/j5gstz/how_to_take_good_backlit_photos_with_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to take good backlit photos with a7iii /!/ hey guys.. i need your wisdom. i recently moved from nikon and got my a7iii with a  24-70mm gm lens. \ntook my wife out early morning for a photoshoot but all the photos i got with the sun rising on her back were a disaster. any advice? -----> spot !!!  metering was center.. maybe change it to focus area? please guide this poor soul to take better backlit pics :)", "sortedWord": "None", "identifyer": 38186, "year": "2020"}, {"Unnamed: 0": 37583, "autor": "thirstygreek", "date": 1605201713000, "content": "How to find out your sensor is a mess.. /!/ I regularly use a bulb blower to clean out my sensor of dust in between lens changes. I’d have an occasional spot of dust I’d notice on a photo from time to time. Nothing content aware can’t zap in a second. \n\nI just bought the Sigma 105mm 2.8 Macro for client work and - HOLY CRAP when your 4” away from an object every spec of dust shows up. The photos looked like I splattered grey paint on my shots! So bad. Luckily I learned this at home in my studio before I brought their products in. \n\nJust bought a sensor cleaning kit at my locks camera shop. \n\nWhat’s the lesson? If you don’t actually clean your sensor once in a while it’s prob filthy.", "link": "https://www.reddit.com/r/SonyAlpha/comments/jsypx6/how_to_find_out_your_sensor_is_a_mess/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to find out your sensor is a mess.. /!/ i regularly use a bulb blower to clean out my sensor of dust in between lens changes. i’d have an occasional -----> spot !!!  of dust i’d notice on a photo from time to time. nothing content aware can’t zap in a second. \n\ni just bought the sigma 105mm 2.8 macro for client work and - holy crap when your 4” away from an object every spec of dust shows up. the photos looked like i splattered grey paint on my shots! so bad. luckily i learned this at home in my studio before i brought their products in. \n\njust bought a sensor cleaning kit at my locks camera shop. \n\nwhat’s the lesson? if you don’t actually clean your sensor once in a while it’s prob filthy.", "sortedWord": "None", "identifyer": 38397, "year": "2020"}, {"Unnamed: 0": 37732, "autor": "Skinopolus", "date": 1609070413000, "content": "Saw \"got the goods\" here and raise my take on what I believe is the exact same spot", "link": "https://www.reddit.com/r/SonyAlpha/comments/kl2j2s/saw_got_the_goods_here_and_raise_my_take_on_what/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "saw \"got the goods\" here and raise my take on what i believe is the exact same -----> spot !!! ", "sortedWord": "None", "identifyer": 38551, "year": "2020"}, {"Unnamed: 0": 37796, "autor": "OngoGablogian5", "date": 1583347846000, "content": "Camping spot, Alaska | a7iii Tamron 28-75", "link": "https://www.reddit.com/r/SonyAlpha/comments/fdhofv/camping_spot_alaska_a7iii_tamron_2875/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camping -----> spot !!! , alaska | a7iii tamron 28-75", "sortedWord": "None", "identifyer": 38616, "year": "2020"}, {"Unnamed: 0": 37878, "autor": "Fedoragang420", "date": 1583632124000, "content": "Weird Spot - A6000 - 30mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/ff5g2l/weird_spot_a6000_30mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird -----> spot !!!  - a6000 - 30mm", "sortedWord": "None", "identifyer": 38698, "year": "2020"}, {"Unnamed: 0": 38164, "autor": "doitnowplease", "date": 1578087856000, "content": "Returning to the Fold /!/ When I was in school for graphic design I purchased the first Sony Alpha as my camera of choice as I went through my photography training.  A few years ago I had to sell it and the rest of my camera gear because I was in a tight spot financially.\n\nI’m happy to say I purchased my first mirrorless camera yesterday - a7 III - and I’m so excited to get back into my passion.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ejmary/returning_to_the_fold/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "returning to the fold /!/ when i was in school for graphic design i purchased the first sony alpha as my camera of choice as i went through my photography training.  a few years ago i had to sell it and the rest of my camera gear because i was in a tight -----> spot !!!  financially.\n\ni’m happy to say i purchased my first mirrorless camera yesterday - a7 iii - and i’m so excited to get back into my passion.", "sortedWord": "None", "identifyer": 38992, "year": "2020"}, {"Unnamed: 0": 38203, "autor": "hamidzact", "date": 1578029518000, "content": "A6400 + kit lens sweet spot? /!/ Anyone know what the sweet spot for this lens is? Some of my images come out nice and sharp and others just look kinda soft and very digital...", "link": "https://www.reddit.com/r/SonyAlpha/comments/ejax2a/a6400_kit_lens_sweet_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6400 + kit lens sweet -----> spot !!! ? /!/ anyone know what the sweet spot for this lens is? some of my images come out nice and sharp and others just look kinda soft and very digital...", "sortedWord": "None", "identifyer": 39032, "year": "2020"}, {"Unnamed: 0": 38501, "autor": "revraul", "date": 1608323340000, "content": "Spot light. Sony A7RII + 35mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/kfszal/spot_light_sony_a7rii_35mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  light. sony a7rii + 35mm 1.8", "sortedWord": "None", "identifyer": 39342, "year": "2020"}, {"Unnamed: 0": 38870, "autor": "pickledzuccini12", "date": 1579832211000, "content": "Clicking noise from IBIS when shooting video on A7III /!/ I don't know if this is the right place to post this, so if there's a better spot let me know. \n\nAs the title says, I've got a little problem with what I believe to be IBIS on my A7III. It only happens with my Rokinon 35 F1.4 AF. It almost sounds like wood creaking. Anyways [here is a video](https://imgur.com/hdQXGyq) of the issue. Please forgive the out of focus video, it was just to show the audio. You may need to turn it up in order to hear it. Like I said it ONLY happens with this one lens, which leads me to believe that it's an issue with the lens and not the camera itself, hopefully. Don't really know what to do, any info is helpful! Thanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/et3pg3/clicking_noise_from_ibis_when_shooting_video_on/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "clicking noise from ibis when shooting video on a7iii /!/ i don't know if this is the right place to post this, so if there's a better -----> spot !!!  let me know. \n\nas the title says, i've got a little problem with what i believe to be ibis on my a7iii. it only happens with my rokinon 35 f1.4 af. it almost sounds like wood creaking. anyways [here is a video](https://imgur.com/hdqxgyq) of the issue. please forgive the out of focus video, it was just to show the audio. you may need to turn it up in order to hear it. like i said it only happens with this one lens, which leads me to believe that it's an issue with the lens and not the camera itself, hopefully. don't really know what to do, any info is helpful! thanks in advance.", "sortedWord": "None", "identifyer": 39719, "year": "2020"}, {"Unnamed: 0": 38976, "autor": "bikefried", "date": 1580251359000, "content": "Do you see it? The sweet camping spot (bottom left) | Sony A6000 | Ouray, Co", "link": "https://www.reddit.com/r/SonyAlpha/comments/evd3di/do_you_see_it_the_sweet_camping_spot_bottom_left/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do you see it? the sweet camping -----> spot !!!  (bottom left) | sony a6000 | ouray, co", "sortedWord": "None", "identifyer": 39826, "year": "2020"}, {"Unnamed: 0": 39053, "autor": "michail71", "date": 1580578355000, "content": "Focus Tracking Setup? /!/ The following are my favorite default A7R IV settings as it relates to focus.  \n\n* AF w/ shutter: Off\n* Focus Mode: AF-C\n* Priority Set: AF\n* Tracking: Center\n* Face/Eye: On\n\nWhat I'm not sure about are situations in which I would want to deviate from Center tracking when in handheld situations. It seems like a quick tracking lock and recompose covers just about every situation.  Am I overlooking a situation where I'd want to go Zone, Wide, Flex Spot (M/S/L), Expanded Spot?\n\nIt does sometimes cause an issue with some types of AEL.  I have confirmed with Sony that focus point AEL does not work with the actual tracked subject's location.  I tried to insist it should but they said it's by design.\n\nI also wish there was full time DMF override.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ex9jix/focus_tracking_setup/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focus tracking setup? /!/ the following are my favorite default a7r iv settings as it relates to focus.  \n\n* af w/ shutter: off\n* focus mode: af-c\n* priority set: af\n* tracking: center\n* face/eye: on\n\nwhat i'm not sure about are situations in which i would want to deviate from center tracking when in handheld situations. it seems like a quick tracking lock and recompose covers just about every situation.  am i overlooking a situation where i'd want to go zone, wide, flex -----> spot !!!  (m/s/l), expanded -----> spot !!! ?\n\nit does sometimes cause an issue with some types of ael.  i have confirmed with sony that focus point ael does not work with the actual tracked subject's location.  i tried to insist it should but they said it's by design.\n\ni also wish there was full time dmf override.", "sortedWord": "None", "identifyer": 39905, "year": "2020"}, {"Unnamed: 0": 39143, "autor": "Mrwubidywobwob", "date": 1589035829000, "content": "Could anyone help me, getting dark spots in my pics Sony A7 II + FE 3.5-5.6/28-70mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/gggoy6/could_anyone_help_me_getting_dark_spots_in_my/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "could anyone help me, getting dark -----> spots !!!  in my pics sony a7 ii + fe 3.5-5.6/28-70mm", "sortedWord": "None", "identifyer": 39998, "year": "2020"}, {"Unnamed: 0": 39531, "autor": "dontreeg", "date": 1607522811000, "content": "Switched from Canon to Sony a6400 and I'm confused /!/ I hope someone can help me out here. I have a small youtube channel and mostly just do talking head videos shot in my living room. I started off with Canon g7x mark ii which I just sold because I was fed up with the camera not having a mic jack. After doing some research, a6400 seems perfect for my use and it also fit my budget. \n\nI got it yesterday and I'm not sure if I'm doing any wrong but the the video colours seems to be MUCH less vibrant and bright, seems a lot more grey out comparing to canon shot in the same spot &amp; lighting. \n\nDo you always have to colour grade the videos produced from sony alpha cameras? Is there any way to set it in the way that minimal colour grading is required during edit? I never had to change colours when editing videos produced from the g7x mark ii and as I am using Filmora 9, which isn't as advanced as Adobe so I don't think there is much I can manipulate during editing.", "link": "https://www.reddit.com/r/SonyAlpha/comments/k9sf1l/switched_from_canon_to_sony_a6400_and_im_confused/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "switched from canon to sony a6400 and i'm confused /!/ i hope someone can help me out here. i have a small youtube channel and mostly just do talking head videos shot in my living room. i started off with canon g7x mark ii which i just sold because i was fed up with the camera not having a mic jack. after doing some research, a6400 seems perfect for my use and it also fit my budget. \n\ni got it yesterday and i'm not sure if i'm doing any wrong but the the video colours seems to be much less vibrant and bright, seems a lot more grey out comparing to canon shot in the same -----> spot !!!  &amp; lighting. \n\ndo you always have to colour grade the videos produced from sony alpha cameras? is there any way to set it in the way that minimal colour grading is required during edit? i never had to change colours when editing videos produced from the g7x mark ii and as i am using filmora 9, which isn't as advanced as adobe so i don't think there is much i can manipulate during editing.", "sortedWord": "None", "identifyer": 40395, "year": "2020"}, {"Unnamed: 0": 40084, "autor": "icysandstone", "date": 1593029991000, "content": "Does dust show up more readily with longer focal lengths? /!/ In all my years, I’ve never noticed dust in my photos like I do with my new 200-600.  I always thought the longer focal lengths just blasted through dust, but I’m seeing lots of very annoying spots that totally ruin photos.  (I’ve only changed lenses twice since acquiring the a7iii, so I have doubts that the dust is on the sensor.)\n\nIs dust super problematic with long focal lengths?\n\nUntil recently, I’ve always had inexpensive gear and used a cotton T-shirt to wipe lenses as needed.  With pro gear now, I suppose there’s a better pro method of cleaning dust from lenses.  What do you use?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hf8lyg/does_dust_show_up_more_readily_with_longer_focal/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does dust show up more readily with longer focal lengths? /!/ in all my years, i’ve never noticed dust in my photos like i do with my new 200-600.  i always thought the longer focal lengths just blasted through dust, but i’m seeing lots of very annoying -----> spots !!!  that totally ruin photos.  (i’ve only changed lenses twice since acquiring the a7iii, so i have doubts that the dust is on the sensor.)\n\nis dust super problematic with long focal lengths?\n\nuntil recently, i’ve always had inexpensive gear and used a cotton t-shirt to wipe lenses as needed.  with pro gear now, i suppose there’s a better pro method of cleaning dust from lenses.  what do you use?", "sortedWord": "None", "identifyer": 40961, "year": "2020"}, {"Unnamed: 0": 40240, "autor": "anxlokke", "date": 1592152312000, "content": "Centrally located and easily spotted, Raketten has transcended over time to become an iconic landmark in Tromsø. Established in 1911, the octagonal building with a base of 2.8 x 2 meters survived both world wars, and was designated as an important cultural monument in 2009.", "link": "https://www.reddit.com/r/SonyAlpha/comments/h8wx7f/centrally_located_and_easily_spotted_raketten_has/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "centrally located and easily -----> spotted !!! , raketten has transcended over time to become an iconic landmark in tromsø. established in 1911, the octagonal building with a base of 2.8 x 2 meters survived both world wars, and was designated as an important cultural monument in 2009.", "sortedWord": "None", "identifyer": 41122, "year": "2020"}, {"Unnamed: 0": 40474, "autor": "thefilmjerk", "date": 1588103325000, "content": "Haven't posted much since I got a new non-sony camera but wanted to share frames from a spot I just won a district Addy for that I shot solely on my a7iii. Still love this camera! Cheers.", "link": "https://www.reddit.com/r/SonyAlpha/comments/g9u52n/havent_posted_much_since_i_got_a_new_nonsony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "haven't posted much since i got a new non-sony camera but wanted to share frames from a -----> spot !!!  i just won a district addy for that i shot solely on my a7iii. still love this camera! cheers.", "sortedWord": "None", "identifyer": 41365, "year": "2020"}, {"Unnamed: 0": 40549, "autor": "maverickmonday", "date": 1587444665000, "content": "Help with Sony A7iii action settings /!/ Hi, I am having issues with shooting action on my A7iii - switched from Canon last year and love everything about the camera except action. I am trying to photograph a subject running straight at the camera. \n\nI have watched a number of videos on youtube and tried all the suggested settings but no luck. Left to right tracking of moving subjects works fine, if I move the camera around slowly (eg focusing on an item and then moving the body up/down/side the focus stays locked, however when the subject is moving at the camera the focus doesn't lock. This was never an issue on my Canon however is causing huge issues on the Sony. Happens across all lenses, I use native Sony and Sigma.\n\nThis is an example action sequence: [https://imgur.com/a/pquDxJx](https://imgur.com/a/pquDxJx)\n\nMy settings for this sequence were 1/1250, f/2, ISO800. Focus area is Lock-on AF: Flexible Spot L (have tried with smaller flexible spots also with the same results. Dog's face is perfectly focused before he starts to move but the camera doesn't retain the focus lock). AF-C. Human subject, Face/Eye Priority off. AF drive speed is Fast, AF Track sensor is Responsive. Focus mode Continuous AF and using BBF.\n\nI know the options are there for Wide and Zone focus however the issue with dogs is that they usually lock onto the dogs chest, nose or long fur. Hence why I am trying to use the Lock on flexible spot so I can focus on the eye area - however it doesn't lock or track at all. I also then don't have the option to select which subjects when there are multiple.\n\nAnimal eye doesn't work for Lock on flexible spot so that is not an option for tracking.\n\nI am beyond frustrated with this as it's just impossible and I don't think it should be this hard. With my Canon, I selected the eye as the focus point and it locked on so an action sequence like this example would have say 6 of 8 shots in focus.\n\nIf anyone has any suggestions I would be so grateful.", "link": "https://www.reddit.com/r/SonyAlpha/comments/g58wlt/help_with_sony_a7iii_action_settings/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with sony a7iii action settings /!/ hi, i am having issues with shooting action on my a7iii - switched from canon last year and love everything about the camera except action. i am trying to photograph a subject running straight at the camera. \n\ni have watched a number of videos on youtube and tried all the suggested settings but no luck. left to right tracking of moving subjects works fine, if i move the camera around slowly (eg focusing on an item and then moving the body up/down/side the focus stays locked, however when the subject is moving at the camera the focus doesn't lock. this was never an issue on my canon however is causing huge issues on the sony. happens across all lenses, i use native sony and sigma.\n\nthis is an example action sequence: [https://imgur.com/a/pqudxjx](https://imgur.com/a/pqudxjx)\n\nmy settings for this sequence were 1/1250, f/2, iso800. focus area is lock-on af: flexible -----> spot !!!  l (have tried with smaller flexible spots also with the same results. dog's face is perfectly focused before he starts to move but the camera doesn't retain the focus lock). af-c. human subject, face/eye priority off. af drive speed is fast, af track sensor is responsive. focus mode continuous af and using bbf.\n\ni know the options are there for wide and zone focus however the issue with dogs is that they usually lock onto the dogs chest, nose or long fur. hence why i am trying to use the lock on flexible spot so i can focus on the eye area - however it doesn't lock or track at all. i also then don't have the option to select which subjects when there are multiple.\n\nanimal eye doesn't work for lock on flexible spot so that is not an option for tracking.\n\ni am beyond frustrated with this as it's just impossible and i don't think it should be this hard. with my canon, i selected the eye as the focus point and it locked on so an action sequence like this example would have say 6 of 8 shots in focus.\n\nif anyone has any suggestions i would be so grateful.", "sortedWord": "None", "identifyer": 41440, "year": "2020"}, {"Unnamed: 0": 41105, "autor": "rocamera", "date": 1586049982000, "content": "Saturday in the Park - A7RIII + Voigtlander 40mm f1.2 [1/320 sec at f/1.2, ISO 50] + Interfit S1 /!/ Off Camera Flash: Interfit S1 500w at 80% power, HSS, 36\" octagonal softbox\n\nLightroom: Applied custom preset tone curve, -15 highlights, +15 shadows, +white, -5 black, chromatic aberration correction. Lowered hue and saturation of greens and yellows. \n\nPhotoshop: Spot heal brush for blemish corrections, dodge and burn, high pass sharpening, &amp; liquefy to make the dress drape more naturally.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fv5eak/saturday_in_the_park_a7riii_voigtlander_40mm_f12/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "saturday in the park - a7riii + voigtlander 40mm f1.2 [1/320 sec at f/1.2, iso 50] + interfit s1 /!/ off camera flash: interfit s1 500w at 80% power, hss, 36\" octagonal softbox\n\nlightroom: applied custom preset tone curve, -15 highlights, +15 shadows, +white, -5 black, chromatic aberration correction. lowered hue and saturation of greens and yellows. \n\nphotoshop: -----> spot !!!  heal brush for blemish corrections, dodge and burn, high pass sharpening, &amp; liquefy to make the dress drape more naturally.", "sortedWord": "None", "identifyer": 42017, "year": "2020"}, {"Unnamed: 0": 41148, "autor": "brennan135", "date": 1585968469000, "content": "Can Someone Help Me Understand What I'm Doing Wrong? /!/ While I was browsing YouTube tonight, I stumbled upon a YouTube channel by the name of Ryan Kao ([link](https://www.youtube.com/watch?v=mvdPaR0H3mM)). He's an Alpha shooter just like all of us, but as soon as I started watching one of his videos I realized how GOOD they looked. This is the moment I realized that I'm very subpar in what I do.\n\nWhat do I mean by that? I'll explain. I've always had a strong passion for photo &amp; video work. Even though I tend to stress and obsess on ideas, I don't put them into play nearly as much as I would like to. My 9-5 has made me too burnt out to actually go out and hit record, even though my mind is constantly wanting to. I might make 1-2 videos a year. It's a weird spot to be in and I'm having a very hard time getting out of it.\n\nThis ([link](https://www.youtube.com/watch?v=a7p6PhaFM9g&amp;t=380s)) is my most recent piece of work (get a few minutes in, that's when I switch to my A6500). Upon finishing it I was very proud. Looking back I was probably just proud that I actually completed a project start to finish. But putting it side by side to Ryan's videos, it made me realize how my colors, my shots, my music, almost everything seemed laughable compared to Ryan's. I then took it a step further and noticed 95% of the other channels I follow also look much better than mine. Womp womp.\n\nNow I'm not usually one to compare to others, as part of the creative process is shooting what you want to shoot. But it's hard to look at both pieces of work side by side and not get down on yourself about it. That being said, it's inspired me to actually learn the process of making great looking video and hone in on that until I'm happy with my quality.\n\nNow for the question - seeing my work and the work I'm referencing, what tips would you give me going forward to learn my process better. I use an A6500 with the Sony 18-105mm and Sigma 16mm lenses. Was eyeing the A7III but quickly realized the camera isn't the issue - it's me.\n\nI appreciate it if you made it this far. Thanks for reading.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fum0f1/can_someone_help_me_understand_what_im_doing_wrong/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone help me understand what i'm doing wrong? /!/ while i was browsing youtube tonight, i stumbled upon a youtube channel by the name of ryan kao ([link](https://www.youtube.com/watch?v=mvdpar0h3mm)). he's an alpha shooter just like all of us, but as soon as i started watching one of his videos i realized how good they looked. this is the moment i realized that i'm very subpar in what i do.\n\nwhat do i mean by that? i'll explain. i've always had a strong passion for photo &amp; video work. even though i tend to stress and obsess on ideas, i don't put them into play nearly as much as i would like to. my 9-5 has made me too burnt out to actually go out and hit record, even though my mind is constantly wanting to. i might make 1-2 videos a year. it's a weird -----> spot !!!  to be in and i'm having a very hard time getting out of it.\n\nthis ([link](https://www.youtube.com/watch?v=a7p6phafm9g&amp;t=380s)) is my most recent piece of work (get a few minutes in, that's when i switch to my a6500). upon finishing it i was very proud. looking back i was probably just proud that i actually completed a project start to finish. but putting it side by side to ryan's videos, it made me realize how my colors, my shots, my music, almost everything seemed laughable compared to ryan's. i then took it a step further and noticed 95% of the other channels i follow also look much better than mine. womp womp.\n\nnow i'm not usually one to compare to others, as part of the creative process is shooting what you want to shoot. but it's hard to look at both pieces of work side by side and not get down on yourself about it. that being said, it's inspired me to actually learn the process of making great looking video and hone in on that until i'm happy with my quality.\n\nnow for the question - seeing my work and the work i'm referencing, what tips would you give me going forward to learn my process better. i use an a6500 with the sony 18-105mm and sigma 16mm lenses. was eyeing the a7iii but quickly realized the camera isn't the issue - it's me.\n\ni appreciate it if you made it this far. thanks for reading.", "sortedWord": "None", "identifyer": 42060, "year": "2020"}, {"Unnamed: 0": 41328, "autor": "GaryLFortner", "date": 1589924487000, "content": "Cool spot in ATL! (A7iii + Tamron 28-75)", "link": "https://www.reddit.com/r/SonyAlpha/comments/gmxycg/cool_spot_in_atl_a7iii_tamron_2875/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "cool -----> spot !!!  in atl! (a7iii + tamron 28-75)", "sortedWord": "None", "identifyer": 42247, "year": "2020"}, {"Unnamed: 0": 41651, "autor": "michail71", "date": 1581797387000, "content": "Question on face detection /!/ If I'm shooting with back button focus on AF-C and expanded flexible spot, does the face detection mean anything when it is outside of the flexible spot?\n\nI notice the face detection box working even though my focal point is somewhere else and the face is out of focus (as was my intent).", "link": "https://www.reddit.com/r/SonyAlpha/comments/f4ewf2/question_on_face_detection/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question on face detection /!/ if i'm shooting with back button focus on af-c and expanded flexible -----> spot !!! , does the face detection mean anything when it is outside of the flexible -----> spot !!! ?\n\ni notice the face detection box working even though my focal point is somewhere else and the face is out of focus (as was my intent).", "sortedWord": "None", "identifyer": 42578, "year": "2020"}, {"Unnamed: 0": 41783, "autor": "beetotherai", "date": 1594072286000, "content": "Lovely spot for dinner. Sony a6000 | Kiron 105mm f/2.8 macro", "link": "https://www.reddit.com/r/SonyAlpha/comments/hmhd4m/lovely_spot_for_dinner_sony_a6000_kiron_105mm_f28/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lovely -----> spot !!!  for dinner. sony a6000 | kiron 105mm f/2.8 macro", "sortedWord": "None", "identifyer": 42716, "year": "2020"}, {"Unnamed: 0": 42052, "autor": "Kizzume", "date": 1596310520000, "content": "A5100, this is a clip (audio removed) from a video that was using auto-exposure and ISO, using spot metering, what's the deal? It darkens the image sometimes when it's dark, it brightens the image sometimes when it's bright. My phone does a better job at auto-settings. What's the trick to this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/i1y53n/a5100_this_is_a_clip_audio_removed_from_a_video/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a5100, this is a clip (audio removed) from a video that was using auto-exposure and iso, using -----> spot !!!  metering, what's the deal? it darkens the image sometimes when it's dark, it brightens the image sometimes when it's bright. my phone does a better job at auto-settings. what's the trick to this?", "sortedWord": "None", "identifyer": 42999, "year": "2020"}, {"Unnamed: 0": 42142, "autor": "CatchAfilM", "date": 1596040140000, "content": "Sony A6500 continues AF failure /!/ Ok, i’m really frustrated from this. \n\ni’m using my A6500 for videos and most of my shots was made by manual focus, however i try using the auto focus and it’s just horrible for some reason, i did search among youtube for tutorials and did everything i can. \n\ni will give an example, while shooting session of friend of mine at the gym i was using my A6500 + Sony 35mm f/1.8 on a Zhiyun Crane plus. \n\nThe camera literally refused to get focus on him !\n\nthe AfF speed set to normal and responsive track sense. \n\ni was trying any focus area possible, zone - center - wide - except flexible spot. \n\nPlease help me with this, i’m super frustrated with this, i thought about borrow my brother’s Sony A7iii and check if the continues AF mode is also making this. \n\ni can share the footage taken with my Sony A6500 while recording continues AF - not able to get focus on the subject.\n\n&amp;#x200B;\n\n\\*\\* i couldn't edit and upload to my old post about it the video i wanted to so i post a new one with the footage.", "link": "https://www.reddit.com/r/SonyAlpha/comments/i03mwf/sony_a6500_continues_af_failure/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6500 continues af failure /!/ ok, i’m really frustrated from this. \n\ni’m using my a6500 for videos and most of my shots was made by manual focus, however i try using the auto focus and it’s just horrible for some reason, i did search among youtube for tutorials and did everything i can. \n\ni will give an example, while shooting session of friend of mine at the gym i was using my a6500 + sony 35mm f/1.8 on a zhiyun crane plus. \n\nthe camera literally refused to get focus on him !\n\nthe aff speed set to normal and responsive track sense. \n\ni was trying any focus area possible, zone - center - wide - except flexible -----> spot !!! . \n\nplease help me with this, i’m super frustrated with this, i thought about borrow my brother’s sony a7iii and check if the continues af mode is also making this. \n\ni can share the footage taken with my sony a6500 while recording continues af - not able to get focus on the subject.\n\n&amp;#x200b;\n\n\\*\\* i couldn't edit and upload to my old post about it the video i wanted to so i post a new one with the footage.", "sortedWord": "None", "identifyer": 43092, "year": "2020"}, {"Unnamed: 0": 42169, "autor": "CatchAfilM", "date": 1596009090000, "content": "Sony A6500 continues focus /!/ Ok, i’m really frustrated from this. \ni’m using my A6500 for videos and most of my shots was made by manual focus, however i try using the auto focus and it’s just horrible for some reason, i did search among youtube for tutorials and did everything i can. \ni will give an example, while shooting session of friend of mine at the gym i was using my A6500 + Sony 35mm f/1.8 on a Zhiyun Crane plus. \nThe camera literally refused to get focus on him !\nthe AfF speed set to normal and responsive track sense. \ni was trying any focus area possible, zone - center - wide - except flexible spot. \nPlease help me with this, i’m super frustrated with this, i thought about borrow my brother’s Sony A7iii and check if the continues AF mode is also making this. \ni can share the footage taken with my Sony A6500 while recording continues AF - not able to get focus on the subject.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hzwm9m/sony_a6500_continues_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6500 continues focus /!/ ok, i’m really frustrated from this. \ni’m using my a6500 for videos and most of my shots was made by manual focus, however i try using the auto focus and it’s just horrible for some reason, i did search among youtube for tutorials and did everything i can. \ni will give an example, while shooting session of friend of mine at the gym i was using my a6500 + sony 35mm f/1.8 on a zhiyun crane plus. \nthe camera literally refused to get focus on him !\nthe aff speed set to normal and responsive track sense. \ni was trying any focus area possible, zone - center - wide - except flexible -----> spot !!! . \nplease help me with this, i’m super frustrated with this, i thought about borrow my brother’s sony a7iii and check if the continues af mode is also making this. \ni can share the footage taken with my sony a6500 while recording continues af - not able to get focus on the subject.", "sortedWord": "None", "identifyer": 43119, "year": "2020"}, {"Unnamed: 0": 42267, "autor": "Anonymous-existence", "date": 1596941206000, "content": "Spotted a cool guy on Nathan Phillips Square, Toronto. Shot on Sony a6100 sigma 56mm f/1.4 ISO 1000 1/30s", "link": "https://www.reddit.com/r/SonyAlpha/comments/i6c12i/spotted_a_cool_guy_on_nathan_phillips_square/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  a cool guy on nathan phillips square, toronto. shot on sony a6100 sigma 56mm f/1.4 iso 1000 1/30s", "sortedWord": "None", "identifyer": 43218, "year": "2020"}, {"Unnamed: 0": 42287, "autor": "hhpl15", "date": 1596918591000, "content": "Question about flexible spot autofocus alpha 6300 /!/ If I activate the flexible spot AF I can move the spot around. When I deactivate it (pressing the middle button) to change iso (button right) or some other setting I can't activate it again by pressing the middle button. Only when I choose the flexible spot af on the menu again. I have nothing assigned to the middle button. \n\nWhat am I missing? Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/i667gn/question_about_flexible_spot_autofocus_alpha_6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question about flexible -----> spot !!!  autofocus alpha 6300 /!/ if i activate the flexible spot af i can move the spot around. when i deactivate it (pressing the middle button) to change iso (button right) or some other setting i can't activate it again by pressing the middle button. only when i choose the flexible spot af on the menu again. i have nothing assigned to the middle button. \n\nwhat am i missing? thanks!", "sortedWord": "None", "identifyer": 43238, "year": "2020"}, {"Unnamed: 0": 42317, "autor": "eqbirvin", "date": 1596865575000, "content": "a7R IV Update - When will we see closeable shutter after camera is off? /!/ The a9 II got it and its a great feature for those of us who work in windy spots. I asked Sony about when the feature will be added and they just sent the idea up to the update team. Do you guys think they will add this feature? How come the a9 ii got it but the a7r iv didn't? \n\n&amp;#x200B;\n\nIf we keep asking them, hopefully they will add the feature.", "link": "https://www.reddit.com/r/SonyAlpha/comments/i5txj6/a7r_iv_update_when_will_we_see_closeable_shutter/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a7r iv update - when will we see closeable shutter after camera is off? /!/ the a9 ii got it and its a great feature for those of us who work in windy -----> spots !!! . i asked sony about when the feature will be added and they just sent the idea up to the update team. do you guys think they will add this feature? how come the a9 ii got it but the a7r iv didn't? \n\n&amp;#x200b;\n\nif we keep asking them, hopefully they will add the feature.", "sortedWord": "None", "identifyer": 43271, "year": "2020"}, {"Unnamed: 0": 42690, "autor": "threeetwo", "date": 1597571830000, "content": "Secret swimming spot - A6500 &amp; 16mm Sigma", "link": "https://www.reddit.com/r/SonyAlpha/comments/iapstq/secret_swimming_spot_a6500_16mm_sigma/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "secret swimming -----> spot !!!  - a6500 &amp; 16mm sigma", "sortedWord": "None", "identifyer": 43659, "year": "2020"}, {"Unnamed: 0": 43012, "autor": "s3w47m88", "date": 1599431632000, "content": "30p vs 30fps /!/ I've discovered that there are three different places where \"p\" and \"fps\" are used, once in the same spot with two different settings.  \n\n\nI thought p was short for FPS, but now that doesn't seem to be the case.   \n\n\n* Menu &gt; Camera 2 &gt; Page 1 &gt; Record Setting 24p\n* S&amp;Q Record Setting &gt; 24p\n* Frame Rate &gt; 30fps", "link": "https://www.reddit.com/r/SonyAlpha/comments/invjfp/30p_vs_30fps/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "30p vs 30fps /!/ i've discovered that there are three different places where \"p\" and \"fps\" are used, once in the same -----> spot !!!  with two different settings.  \n\n\ni thought p was short for fps, but now that doesn't seem to be the case.   \n\n\n* menu &gt; camera 2 &gt; page 1 &gt; record setting 24p\n* s&amp;q record setting &gt; 24p\n* frame rate &gt; 30fps", "sortedWord": "None", "identifyer": 43992, "year": "2020"}, {"Unnamed: 0": 43386, "autor": "NaifAlqahtani", "date": 1604093034000, "content": "Skin appears wrinkly? [a6100] /!/ Hey guys, I just bought the a6100 a few days ago. I honestly love the camera! I especially love the fast autofocus.\n\n&amp;#x200B;\n\nI seem to have a problem with how my skin appears in video. It seems like it makes all the little details way more prominent than it actually is. I do have pimples and some sun spots but that isn't the problem I face.\n\n&amp;#x200B;\n\nThe problem is that it shows my skin as if it was wrinkly a bit. I thought it was just me but I showed it to my family and friends but all of them defiantly notice it and think I don't look like that in real life.\n\n&amp;#x200B;\n\nEverytime I try to google it, results are about how to fix the skin tones. My lighting isn't that great here but I tried better lighting and the minor problem still presists. I still feel like my skin is wrinkly.\n\n&amp;#x200B;\n\nDoes anyone know if maybe the issue is with the settings I used or is it from the camera itself. I would love it if you can help me out a little.\n\n&amp;#x200B;\n\nvideo settings:\n\nfull HD at 25p (I noticed that 4k makes the issue I'm facing way worse)\n\nshutter speed: 1/50\n\niso: 100\n\naperture at 4.0\n\nusing the 16-50 mm kit lens\n\n&amp;#x200B;\n\nHere's a screenshot of the video. It looks a little more blurred here than original, maybe due to compression? I don't really know\n\nhttps://preview.redd.it/fb9gx2mwsaw51.png?width=497&amp;format=png&amp;auto=webp&amp;s=1b2e37973e065905686c82169a9e504edf7b6330", "link": "https://www.reddit.com/r/SonyAlpha/comments/jl5kkz/skin_appears_wrinkly_a6100/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "skin appears wrinkly? [a6100] /!/ hey guys, i just bought the a6100 a few days ago. i honestly love the camera! i especially love the fast autofocus.\n\n&amp;#x200b;\n\ni seem to have a problem with how my skin appears in video. it seems like it makes all the little details way more prominent than it actually is. i do have pimples and some sun -----> spots !!!  but that isn't the problem i face.\n\n&amp;#x200b;\n\nthe problem is that it shows my skin as if it was wrinkly a bit. i thought it was just me but i showed it to my family and friends but all of them defiantly notice it and think i don't look like that in real life.\n\n&amp;#x200b;\n\neverytime i try to google it, results are about how to fix the skin tones. my lighting isn't that great here but i tried better lighting and the minor problem still presists. i still feel like my skin is wrinkly.\n\n&amp;#x200b;\n\ndoes anyone know if maybe the issue is with the settings i used or is it from the camera itself. i would love it if you can help me out a little.\n\n&amp;#x200b;\n\nvideo settings:\n\nfull hd at 25p (i noticed that 4k makes the issue i'm facing way worse)\n\nshutter speed: 1/50\n\niso: 100\n\naperture at 4.0\n\nusing the 16-50 mm kit lens\n\n&amp;#x200b;\n\nhere's a screenshot of the video. it looks a little more blurred here than original, maybe due to compression? i don't really know\n\nhttps://preview.redd.it/fb9gx2mwsaw51.png?width=497&amp;format=png&amp;auto=webp&amp;s=1b2e37973e065905686c82169a9e504edf7b6330", "sortedWord": "None", "identifyer": 44377, "year": "2020"}, {"Unnamed: 0": 43457, "autor": "ripviserion", "date": 1602190523000, "content": "Round white spot... A7iii + 16-35mm f/2.8 A-mount + LA-EA4 ... any ideas why please ?", "link": "https://www.reddit.com/r/SonyAlpha/comments/j7lbq6/round_white_spot_a7iii_1635mm_f28_amount_laea4/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "round white -----> spot !!! ... a7iii + 16-35mm f/2.8 a-mount + la-ea4 ... any ideas why please ?", "sortedWord": "None", "identifyer": 44449, "year": "2020"}, {"Unnamed: 0": 43702, "autor": "ZPD__Master", "date": 1599134510000, "content": "Help is appreciated: I found a used A7iii and the picture shows two dark spots on the sensor. What could these spots be? Is this something that can be cleaned? Thanks to anyone who can offer some suggestions on whether I should buy it. It’s priced at around 1,600 USD no lens.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ils21h/help_is_appreciated_i_found_a_used_a7iii_and_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help is appreciated: i found a used a7iii and the picture shows two dark -----> spots !!!  on the sensor. what could these spots be? is this something that can be cleaned? thanks to anyone who can offer some suggestions on whether i should buy it. it’s priced at around 1,600 usd no lens.", "sortedWord": "None", "identifyer": 44701, "year": "2020"}, {"Unnamed: 0": 43718, "autor": "Tri-tourmaline", "date": 1599096981000, "content": "Dark spots in pictures. Help on how to remove. Sony a6100", "link": "https://www.reddit.com/r/SonyAlpha/comments/ilk740/dark_spots_in_pictures_help_on_how_to_remove_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dark -----> spots !!!  in pictures. help on how to remove. sony a6100", "sortedWord": "None", "identifyer": 44717, "year": "2020"}, {"Unnamed: 0": 43939, "autor": "narcississtic-seal", "date": 1603890189000, "content": "Question for videographers /!/ Im using a Sony a7iii, just wondering is there a way to play back your slow motion clips on your camera but in real time speed. For example when i shoot at 120fps and i want to watch it on the spot, the camera plays it in slow motion, and its kind of frustrating sometimes because im in the middle of the shoot and i want to check the clip quickly, any help would be great.", "link": "https://www.reddit.com/r/SonyAlpha/comments/jjnbg5/question_for_videographers/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question for videographers /!/ im using a sony a7iii, just wondering is there a way to play back your slow motion clips on your camera but in real time speed. for example when i shoot at 120fps and i want to watch it on the -----> spot !!! , the camera plays it in slow motion, and its kind of frustrating sometimes because im in the middle of the shoot and i want to check the clip quickly, any help would be great.", "sortedWord": "None", "identifyer": 44951, "year": "2020"}, {"Unnamed: 0": 44126, "autor": "trashymcgeee", "date": 1597842689000, "content": "Is there anyway to get these spots off my sensor?", "link": "https://www.reddit.com/r/SonyAlpha/comments/icncwk/is_there_anyway_to_get_these_spots_off_my_sensor/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is there anyway to get these -----> spots !!!  off my sensor?", "sortedWord": "None", "identifyer": 45144, "year": "2020"}, {"Unnamed: 0": 44146, "autor": "ExprssJGonzo", "date": 1597804141000, "content": "Took a stroll downtown looking for some spots for a later model shoot. Found a nice classic hiding out, too. (A7iii, Tamron 28-75)", "link": "https://www.reddit.com/r/SonyAlpha/comments/icf84j/took_a_stroll_downtown_looking_for_some_spots_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "took a stroll downtown looking for some -----> spots !!!  for a later model shoot. found a nice classic hiding out, too. (a7iii, tamron 28-75)", "sortedWord": "None", "identifyer": 45164, "year": "2020"}, {"Unnamed: 0": 44264, "autor": "seanprefect", "date": 1584633743000, "content": "Spotted on this week's Flash episode we get a good shot of the back too.", "link": "https://www.reddit.com/r/SonyAlpha/comments/flcfhr/spotted_on_this_weeks_flash_episode_we_get_a_good/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  on this week's flash episode we get a good shot of the back too.", "sortedWord": "None", "identifyer": 45290, "year": "2020"}, {"Unnamed: 0": 44270, "autor": "filippomasoni", "date": 1584629687000, "content": "ISO AUTO Min. SS not working in P mode | A7III and a6300 /!/ I've recently been testing P mode for day to night to day timelapse but I'm having some issues. \n\nI've tried both on my a7III and a6300 and it has the same behavior. \n\nThe function ISO AUTO Min SS ([sony manual](https://helpguide.sony.net/ilc/1720/v1/en/contents/TP0001653146.html?search=iso%20auto%20min%20ss))  works as expected in A (Aperture mode) it raises the shutter speed until the limit I set and then starts to increase the ISO again until the limit I set and then if it's not enough it'll go past the shutter speed to maintain exposure like it's specified on the manual.\n\nWhen I go into P mode though, it looks like it doesn't follow the min SS rule anymore, it wants to keep the ISO at 100 and increases the shutter speed past the limit I have set. But I noticed that the behavior changes if I turn one of the dials while in P mode. If I turn it lowering the aperture to the biggest I have, then it'll follow the min SS limit, but if the aperture is set higher it won't change it as much and prefers to go past the SS limit instead of increasing the ISO or lowering that aperture. I'm not sure what's the deal with P mode but I don't think this is the correct behavior. \n\nTo reproduce this quickly I set spot metering and moved the camera from a bright source of light to a dark area and I could see the settings changing in real-time, you can do the same to try.\n\nI hope there's something I'm missing and this is fixable otherwise P mode is quite useless.", "link": "https://www.reddit.com/r/SonyAlpha/comments/flbbb4/iso_auto_min_ss_not_working_in_p_mode_a7iii_and/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "iso auto min. ss not working in p mode | a7iii and a6300 /!/ i've recently been testing p mode for day to night to day timelapse but i'm having some issues. \n\ni've tried both on my a7iii and a6300 and it has the same behavior. \n\nthe function iso auto min ss ([sony manual](https://helpguide.sony.net/ilc/1720/v1/en/contents/tp0001653146.html?search=iso%20auto%20min%20ss))  works as expected in a (aperture mode) it raises the shutter speed until the limit i set and then starts to increase the iso again until the limit i set and then if it's not enough it'll go past the shutter speed to maintain exposure like it's specified on the manual.\n\nwhen i go into p mode though, it looks like it doesn't follow the min ss rule anymore, it wants to keep the iso at 100 and increases the shutter speed past the limit i have set. but i noticed that the behavior changes if i turn one of the dials while in p mode. if i turn it lowering the aperture to the biggest i have, then it'll follow the min ss limit, but if the aperture is set higher it won't change it as much and prefers to go past the ss limit instead of increasing the iso or lowering that aperture. i'm not sure what's the deal with p mode but i don't think this is the correct behavior. \n\nto reproduce this quickly i set -----> spot !!!  metering and moved the camera from a bright source of light to a dark area and i could see the settings changing in real-time, you can do the same to try.\n\ni hope there's something i'm missing and this is fixable otherwise p mode is quite useless.", "sortedWord": "None", "identifyer": 45296, "year": "2020"}, {"Unnamed: 0": 44473, "autor": "ProfoundMenace", "date": 1582583756000, "content": "Planar T* FE 50mm f/1.4 ZA - Is my copy not sharp or am I crazy? /!/ **Backstory:** picked up a used Sony FE 50 f/1.4 from KEH at a bargain price about a month ago to use with my A7iii. I tested it initially with a few camera-to-phone transfers and didn't notice anything out of the ordinary. I had a gig this past weekend where I was shooting a family event relying heavily on Eye AF (with AF-C and wide focus area) and was woefully underwhelmed when I pulled the images into LR. They're useable, sure, but for a lens that has often been lauded for its sharpness across all apertures, I was sorely disappointed. \n\nHere's a quick test I put together to try and test sharpness. Certainly not a 1-1 comparison to what I was shooting this weekend, but I think it illustrates the point. Wide-open is useable but blurry, sharpness really improves by f/1.8 and is nearly perfect by f/2. I'd love an extra set of eyes to look it over. All were shot at 1/125, variable aperture, auto ISO. These were shot in AF-S and Flexible Spot area to ensure consistency across each image. \n\nRaws here: [https://www.dropbox.com/sh/r7jaj2q62tdbty3/AADsxwWFOFUxWixihctaoTNMa?dl=0](https://www.dropbox.com/sh/r7jaj2q62tdbty3/AADsxwWFOFUxWixihctaoTNMa?dl=0)", "link": "https://www.reddit.com/r/SonyAlpha/comments/f8zli6/planar_t_fe_50mm_f14_za_is_my_copy_not_sharp_or/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "planar t* fe 50mm f/1.4 za - is my copy not sharp or am i crazy? /!/ **backstory:** picked up a used sony fe 50 f/1.4 from keh at a bargain price about a month ago to use with my a7iii. i tested it initially with a few camera-to-phone transfers and didn't notice anything out of the ordinary. i had a gig this past weekend where i was shooting a family event relying heavily on eye af (with af-c and wide focus area) and was woefully underwhelmed when i pulled the images into lr. they're useable, sure, but for a lens that has often been lauded for its sharpness across all apertures, i was sorely disappointed. \n\nhere's a quick test i put together to try and test sharpness. certainly not a 1-1 comparison to what i was shooting this weekend, but i think it illustrates the point. wide-open is useable but blurry, sharpness really improves by f/1.8 and is nearly perfect by f/2. i'd love an extra set of eyes to look it over. all were shot at 1/125, variable aperture, auto iso. these were shot in af-s and flexible -----> spot !!!  area to ensure consistency across each image. \n\nraws here: [https://www.dropbox.com/sh/r7jaj2q62tdbty3/aadsxwwfofuxwixihctaotnma?dl=0](https://www.dropbox.com/sh/r7jaj2q62tdbty3/aadsxwwfofuxwixihctaotnma?dl=0)", "sortedWord": "None", "identifyer": 45509, "year": "2020"}, {"Unnamed: 0": 45187, "autor": "nasadiya_sukta", "date": 1578195224000, "content": "Histograms clipped consistently at the same exposure value /!/ I have a Sony A6500, and a 18-200mm lens.\n\nI've  come back from a hike, and see that almost all my histograms are  clipped, and all of them are clipped at about the same spot.  I don't  understand what's happening here.  I was shooting in manual mode.  I  wasn't looking at the histograms while taking photos, but was paying  attention to the exposure in live view, in which the photos did seem to  well exposed (as they did when previewing them on the camera -- come on, we  all chimp!).\n\nHere's an example.  Any suggestions as to what I'm doing wrong?  They all have a maximum exposure value at around the same point, and often a cliff in the exposure at that point.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qjle54lvqv841.png?width=1222&amp;format=png&amp;auto=webp&amp;s=f7d9a195e0e992551fdaf2a2fcd9b666a05ac30d\n\n📷", "link": "https://www.reddit.com/r/SonyAlpha/comments/ek7el0/histograms_clipped_consistently_at_the_same/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "histograms clipped consistently at the same exposure value /!/ i have a sony a6500, and a 18-200mm lens.\n\ni've  come back from a hike, and see that almost all my histograms are  clipped, and all of them are clipped at about the same -----> spot !!! .  i don't  understand what's happening here.  i was shooting in manual mode.  i  wasn't looking at the histograms while taking photos, but was paying  attention to the exposure in live view, in which the photos did seem to  well exposed (as they did when previewing them on the camera -- come on, we  all chimp!).\n\nhere's an example.  any suggestions as to what i'm doing wrong?  they all have a maximum exposure value at around the same point, and often a cliff in the exposure at that point.\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qjle54lvqv841.png?width=1222&amp;format=png&amp;auto=webp&amp;s=f7d9a195e0e992551fdaf2a2fcd9b666a05ac30d\n\n📷", "sortedWord": "None", "identifyer": 46251, "year": "2020"}, {"Unnamed: 0": 45302, "autor": "NiceGuyAbe", "date": 1600281864000, "content": "Looking for a Sharper Lens /!/ Got the a7ii with the 28-70mm kit lens recently and have been disappointed at the lack of sharpness in my landscape photos. Is this at least partially due to the lens and not my inexperience? Does anyone have a sweet spot they like to stay in for this lens? Otherwise, what's an ultra crisp lens I should look into buying for landscape photography?", "link": "https://www.reddit.com/r/SonyAlpha/comments/iu1qon/looking_for_a_sharper_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for a sharper lens /!/ got the a7ii with the 28-70mm kit lens recently and have been disappointed at the lack of sharpness in my landscape photos. is this at least partially due to the lens and not my inexperience? does anyone have a sweet -----> spot !!!  they like to stay in for this lens? otherwise, what's an ultra crisp lens i should look into buying for landscape photography?", "sortedWord": "None", "identifyer": 46367, "year": "2020"}, {"Unnamed: 0": 45511, "autor": "nhofl", "date": 1577918067000, "content": "A sloth spotted in Costa Rica. A6300 | 18-105mm | F4", "link": "https://www.reddit.com/r/SonyAlpha/comments/eiowng/a_sloth_spotted_in_costa_rica_a6300_18105mm_f4/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "a sloth -----> spotted !!!  in costa rica. a6300 | 18-105mm | f4", "sortedWord": "None", "identifyer": 46581, "year": "2020"}, {"Unnamed: 0": 45526, "autor": "DasRico", "date": 1577896515000, "content": "I need help with my ILCA-77M2 /!/ I got a Sony Alpha A77II which is supposed to nail focus while bursting at 8fps with lock on- flexible spot focus mode, yet it doesn't perform both tasks at the same time despite doing what I have seen in tutorials and what I could sneaked up on a digital library to check Gary Friedman's boooook about the A77II. I don't know if it's a software issue or I got a faked A77II. The awful thing is that it does have the same amount of focus points and I have had tested three A77II before. The camera's body is really sturdy and solid as I love them and has the nearly indestructible A-mount but I can't help raging when I'm getting unsharp photos because the steady shot inside doesn't seem to work with my 600mm and I constantly lack shots because the camera doesn't even shoot when the focus is nearly achieved; missing beautiful moments and not even getting what I expected when I was there at the market purchasing it. I bought it on April  2018, it was a show item so it got near 500 shoots but it was pretty in good condition externally. The first days it worked just perfect and never missed a shot. It was a month after when the camera started to show problems reading cards, doing strange sh!t with the shutter curtains when I turn it off (not the IBIS auto brrrt when you turn off every Alpha with steady shot inside) and now it would do focus hunting with all my lenses, I'm not able to get sharp shots, not able to shoot a single continuous burst, unable to track moving subjects and feel really frustrated because 1: It started to fail very badly once the date of refund expired and 2: if I'm selling it for a reasonable price I won't win anything, and selling it for €500 is total scamming. Is there any way to for example remove all software and use the SD card to implement the 2.0 update on it? It's already supposedly running the 2.0 update but it fails too much. Please help, thank you for reading my Quixote.", "link": "https://www.reddit.com/r/SonyAlpha/comments/eik7uv/i_need_help_with_my_ilca77m2/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i need help with my ilca-77m2 /!/ i got a sony alpha a77ii which is supposed to nail focus while bursting at 8fps with lock on- flexible -----> spot !!!  focus mode, yet it doesn't perform both tasks at the same time despite doing what i have seen in tutorials and what i could sneaked up on a digital library to check gary friedman's boooook about the a77ii. i don't know if it's a software issue or i got a faked a77ii. the awful thing is that it does have the same amount of focus points and i have had tested three a77ii before. the camera's body is really sturdy and solid as i love them and has the nearly indestructible a-mount but i can't help raging when i'm getting unsharp photos because the steady shot inside doesn't seem to work with my 600mm and i constantly lack shots because the camera doesn't even shoot when the focus is nearly achieved; missing beautiful moments and not even getting what i expected when i was there at the market purchasing it. i bought it on april  2018, it was a show item so it got near 500 shoots but it was pretty in good condition externally. the first days it worked just perfect and never missed a shot. it was a month after when the camera started to show problems reading cards, doing strange sh!t with the shutter curtains when i turn it off (not the ibis auto brrrt when you turn off every alpha with steady shot inside) and now it would do focus hunting with all my lenses, i'm not able to get sharp shots, not able to shoot a single continuous burst, unable to track moving subjects and feel really frustrated because 1: it started to fail very badly once the date of refund expired and 2: if i'm selling it for a reasonable price i won't win anything, and selling it for €500 is total scamming. is there any way to for example remove all software and use the sd card to implement the 2.0 update on it? it's already supposedly running the 2.0 update but it fails too much. please help, thank you for reading my quixote.", "sortedWord": "None", "identifyer": 46596, "year": "2020"}, {"Unnamed: 0": 45841, "autor": "whosflyingthisthing_", "date": 1607875250000, "content": "Leaving Spot [Sony A7iii + 16-35mm f4 Zeiss]", "link": "https://www.reddit.com/r/SonyAlpha/comments/kcczuq/leaving_spot_sony_a7iii_1635mm_f4_zeiss/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leaving -----> spot !!!  [sony a7iii + 16-35mm f4 zeiss]", "sortedWord": "None", "identifyer": 46921, "year": "2020"}, {"Unnamed: 0": 46170, "autor": "bigmessy1", "date": 1579411678000, "content": "Sony Alpha A7iii : Seeking help on the following : 1)Green AF squares not displaying . I have already selected auto focus clear to off and display cont. AF area to on . 2) I cannot get the Lock on AF:Expand flexible spot working for video rec", "link": "https://www.reddit.com/r/SonyAlpha/comments/eqscvm/sony_alpha_a7iii_seeking_help_on_the_following/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony alpha a7iii : seeking help on the following : 1)green af squares not displaying . i have already selected auto focus clear to off and display cont. af area to on . 2) i cannot get the lock on af:expand flexible -----> spot !!!  working for video rec", "sortedWord": "None", "identifyer": 47260, "year": "2020"}, {"Unnamed: 0": 46342, "autor": "kkadavy", "date": 1580141401000, "content": "Sunday On The Rocks. A7ii 24-105 f4. 24mm f11. 3 captures stacked for focus. Still a beginner so any tips are greatly appreciated! (Updated with cloning for dust spots)", "link": "https://www.reddit.com/r/SonyAlpha/comments/eupwu9/sunday_on_the_rocks_a7ii_24105_f4_24mm_f11_3/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sunday on the rocks. a7ii 24-105 f4. 24mm f11. 3 captures stacked for focus. still a beginner so any tips are greatly appreciated! (updated with cloning for dust -----> spots !!! )", "sortedWord": "None", "identifyer": 47434, "year": "2020"}, {"Unnamed: 0": 46710, "autor": "Co0kies_Q", "date": 1605480365000, "content": "Night climbers spotted on El Capitan last night (11/15/2020) - Sony A7III + Sony 24 f1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/juv9k1/night_climbers_spotted_on_el_capitan_last_night/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "night climbers -----> spotted !!!  on el capitan last night (11/15/2020) - sony a7iii + sony 24 f1.4", "sortedWord": "None", "identifyer": 47814, "year": "2020"}, {"Unnamed: 0": 47441, "autor": "sniikklefriittz", "date": 1592325742000, "content": "Lightroom Presets for Outdoor Trip /!/ Wife and I are taking a trip to Seattle and Portland in a few days. Looking at shooting with my a6400 with 18-135 kit as well as the Sigma 30mm 1.4. Any suggestions on any presets to achieve a certain look? We’re going to be doing a lot of outdoor nature/scenic spots as well as some portraits and bit of urban photography as well. Just looking for suggestions on where to find killer presets/color toning to achieve a similar look for all the photos.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ha7koo/lightroom_presets_for_outdoor_trip/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "lightroom presets for outdoor trip /!/ wife and i are taking a trip to seattle and portland in a few days. looking at shooting with my a6400 with 18-135 kit as well as the sigma 30mm 1.4. any suggestions on any presets to achieve a certain look? we’re going to be doing a lot of outdoor nature/scenic -----> spots !!!  as well as some portraits and bit of urban photography as well. just looking for suggestions on where to find killer presets/color toning to achieve a similar look for all the photos.", "sortedWord": "None", "identifyer": 48576, "year": "2020"}, {"Unnamed: 0": 47499, "autor": "kangsterizer", "date": 1592242294000, "content": "A slightly different take on a popular spot - A7RIII / 24-105F4", "link": "https://www.reddit.com/r/SonyAlpha/comments/h9ksnk/a_slightly_different_take_on_a_popular_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a slightly different take on a popular -----> spot !!!  - a7riii / 24-105f4", "sortedWord": "None", "identifyer": 48641, "year": "2020"}, {"Unnamed: 0": 47503, "autor": "YubYub2201", "date": 1592240652000, "content": "Spotted on the Streets of SF | A7r III | 50mm/1.4 |", "link": "https://www.reddit.com/r/SonyAlpha/comments/h9k9xz/spotted_on_the_streets_of_sf_a7r_iii_50mm14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  on the streets of sf | a7r iii | 50mm/1.4 |", "sortedWord": "None", "identifyer": 48646, "year": "2020"}, {"Unnamed: 0": 47651, "autor": "Camhammel", "date": 1592005166000, "content": "Hummingbird looking for a snack (spot the spider!) shot on A7iii w/ 200-600 G", "link": "https://www.reddit.com/r/SonyAlpha/comments/h7vx7c/hummingbird_looking_for_a_snack_spot_the_spider/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hummingbird looking for a snack (-----> spot !!!  the spider!) shot on a7iii w/ 200-600 g", "sortedWord": "None", "identifyer": 48799, "year": "2020"}, {"Unnamed: 0": 48400, "autor": "silverfangme", "date": 1588052109000, "content": "Sony RX0 II /!/ I don't see the point in this camera. As far as i know, it is made as a kind of action camera.\n\nBut where is the continuous autofocus? The camera is always focusing on the spot where it was focused when you pressed the record button. To refocus, you need to stop recording and start again.\n\n&amp;#x200B;\n\nIn the right circumstances, this camera can make some very very good footage, but without the AF-C, it's garbage.\n\n&amp;#x200B;\n\nIf only they make a Sony RX0 III with AF-C, that would be a fucking awesome camera.", "link": "https://www.reddit.com/r/SonyAlpha/comments/g9hdjq/sony_rx0_ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony rx0 ii /!/ i don't see the point in this camera. as far as i know, it is made as a kind of action camera.\n\nbut where is the continuous autofocus? the camera is always focusing on the -----> spot !!!  where it was focused when you pressed the record button. to refocus, you need to stop recording and start again.\n\n&amp;#x200b;\n\nin the right circumstances, this camera can make some very very good footage, but without the af-c, it's garbage.\n\n&amp;#x200b;\n\nif only they make a sony rx0 iii with af-c, that would be a fucking awesome camera.", "sortedWord": "None", "identifyer": 49578, "year": "2020"}, {"Unnamed: 0": 48600, "autor": "grovemau5", "date": 1589836074000, "content": "Another beautiful spot from last week's road trip. a6500 + 10-18", "link": "https://www.reddit.com/r/SonyAlpha/comments/gma9nh/another_beautiful_spot_from_last_weeks_road_trip/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "another beautiful -----> spot !!!  from last week's road trip. a6500 + 10-18", "sortedWord": "None", "identifyer": 49781, "year": "2020"}, {"Unnamed: 0": 48894, "autor": "treksf6", "date": 1595368287000, "content": "Gold finches, male and female. A6600 @ 600mm ISO 1000, F6.3 and 7.1, 1/125 to 1/250. Flexible spot focus small. Monopod used.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hvgqcw/gold_finches_male_and_female_a6600_600mm_iso_1000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "gold finches, male and female. a6600 @ 600mm iso 1000, f6.3 and 7.1, 1/125 to 1/250. flexible -----> spot !!!  focus small. monopod used.", "sortedWord": "None", "identifyer": 50082, "year": "2020"}, {"Unnamed: 0": 49042, "autor": "MikeyTheK1d", "date": 1582001547000, "content": "Is this a dust/fingerprint spot? /!/ Just got back from Disney and tried out a new 85 1.8 and noticed this post on the upper left in all the pics. Its doesn't stand out in every pic unless I edit the exposure and contrast. I then checked my 35 1.8 and saw the same thing. I don't see any dust or fingerprints on the sensor.\nhttps://imgur.com/JVqJRq7", "link": "https://www.reddit.com/r/SonyAlpha/comments/f5mc31/is_this_a_dustfingerprint_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this a dust/fingerprint -----> spot !!! ? /!/ just got back from disney and tried out a new 85 1.8 and noticed this post on the upper left in all the pics. its doesn't stand out in every pic unless i edit the exposure and contrast. i then checked my 35 1.8 and saw the same thing. i don't see any dust or fingerprints on the sensor.\nhttps://imgur.com/jvqjrq7", "sortedWord": "None", "identifyer": 50234, "year": "2020"}, {"Unnamed: 0": 49231, "autor": "Kantares", "date": 1597489300000, "content": "Lens recommendation for Holidays - zoom or primes /!/ Hello everybody,\n\nPerhaps a question like thousand before - what do you think?\n\nI am planning a \"slow\" holiday trip. Giving me and my wife some time to relax and take some photos of sunsets, landscapes, ourselves, architecture, etc.\n\nI think time is not an issue as I am not planning a group tour. We are organising everything our own so no limitation in staying at single spot. It is more to get some memories to print and hang on the wall.\n\nI own a A6000 and sigma 16mm f 1.4, Sigma 30 mm F1.4, Sony 16-15 Kit lens, 55-210 f3.5-5.6. I am considering to take sigma glass and buy sigma 24-70 f2.8 art to get more flexibility and do not think about dust and spots on sensor.\n\nAs a second thought I could get sigma 56 mm f1.4 and even squeeze Sony 85 mm f1.8. Together still for less than the sigma zoom.\n\nI really like the sharpness of sigma primes and my wife loves the bokeh. After using the primes we could not use the kit lens anymore.\n\nI am considering 2 kits:\n\n1. 16 mm f1.4 + 30 mm f1.4 + Sigma 24-70 f2.8\n\n2. 16 mm f1.4 + 30 mm f1.4 + Sigma 56 mm f1.4 + Sony 85 mm f 1.8\n\nI have hard trouble making my mind between 2 primes that will give me more reach with 85 (130 mm on FF equivalent) and expected flexibility of the zoom.\n\nWhat would you suggest?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ia5el0/lens_recommendation_for_holidays_zoom_or_primes/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lens recommendation for holidays - zoom or primes /!/ hello everybody,\n\nperhaps a question like thousand before - what do you think?\n\ni am planning a \"slow\" holiday trip. giving me and my wife some time to relax and take some photos of sunsets, landscapes, ourselves, architecture, etc.\n\ni think time is not an issue as i am not planning a group tour. we are organising everything our own so no limitation in staying at single -----> spot !!! . it is more to get some memories to print and hang on the wall.\n\ni own a a6000 and sigma 16mm f 1.4, sigma 30 mm f1.4, sony 16-15 kit lens, 55-210 f3.5-5.6. i am considering to take sigma glass and buy sigma 24-70 f2.8 art to get more flexibility and do not think about dust and spots on sensor.\n\nas a second thought i could get sigma 56 mm f1.4 and even squeeze sony 85 mm f1.8. together still for less than the sigma zoom.\n\ni really like the sharpness of sigma primes and my wife loves the bokeh. after using the primes we could not use the kit lens anymore.\n\ni am considering 2 kits:\n\n1. 16 mm f1.4 + 30 mm f1.4 + sigma 24-70 f2.8\n\n2. 16 mm f1.4 + 30 mm f1.4 + sigma 56 mm f1.4 + sony 85 mm f 1.8\n\ni have hard trouble making my mind between 2 primes that will give me more reach with 85 (130 mm on ff equivalent) and expected flexibility of the zoom.\n\nwhat would you suggest?", "sortedWord": "None", "identifyer": 50430, "year": "2020"}, {"Unnamed: 0": 49244, "autor": "ostettd", "date": 1597459581000, "content": "Q: Any way of getting a 4:5/5:4 aspect ratio outline while shooting photos? /!/ Hi there, not sure if this is in the right spot. I shoot with an A7Riii.\n\nWas wondering if there is a setting for this somewhere. Would be very helpful to see the instagram crop for portraits in camera while shooting in 2:3/3:2 aspect ratio.", "link": "https://www.reddit.com/r/SonyAlpha/comments/i9zspd/q_any_way_of_getting_a_4554_aspect_ratio_outline/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "q: any way of getting a 4:5/5:4 aspect ratio outline while shooting photos? /!/ hi there, not sure if this is in the right -----> spot !!! . i shoot with an a7riii.\n\nwas wondering if there is a setting for this somewhere. would be very helpful to see the instagram crop for portraits in camera while shooting in 2:3/3:2 aspect ratio.", "sortedWord": "None", "identifyer": 50443, "year": "2020"}, {"Unnamed: 0": 49342, "autor": "EightTwentyFourTen", "date": 1593621479000, "content": "Took a crack at a popular local spot. New to photography and first time in LightRoom. Photo/edit feedback appreciated! (A7III, Tamron 28-75)", "link": "https://www.reddit.com/r/SonyAlpha/comments/hjdsls/took_a_crack_at_a_popular_local_spot_new_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "took a crack at a popular local -----> spot !!! . new to photography and first time in lightroom. photo/edit feedback appreciated! (a7iii, tamron 28-75)", "sortedWord": "None", "identifyer": 50546, "year": "2020"}, {"Unnamed: 0": 49397, "autor": "SebastianHuber", "date": 1596809079000, "content": "This morning I spotted nice corn crops a and thought about putting them to use. Sony A7III + Tamron 70-180mm f/2.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/i5ee49/this_morning_i_spotted_nice_corn_crops_a_and/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "this morning i -----> spotted !!!  nice corn crops a and thought about putting them to use. sony a7iii + tamron 70-180mm f/2.8", "sortedWord": "None", "identifyer": 50602, "year": "2020"}, {"Unnamed: 0": 49665, "autor": "merple454", "date": 1595797596000, "content": "Star trails tips /!/ Never got the chance to do start trails before. Tomorrow I’m going on vacation to a spot perfect for astrophotography, assuming weather is good, which I have never tried before.\n\nI know to use the widest aperture, slow shutter speed and higher ISO, but I’m wondering how to pass the time as it seems monotonous to sit around and press the shutter every so often", "link": "https://www.reddit.com/r/SonyAlpha/comments/hyet2l/star_trails_tips/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "star trails tips /!/ never got the chance to do start trails before. tomorrow i’m going on vacation to a -----> spot !!!  perfect for astrophotography, assuming weather is good, which i have never tried before.\n\ni know to use the widest aperture, slow shutter speed and higher iso, but i’m wondering how to pass the time as it seems monotonous to sit around and press the shutter every so often", "sortedWord": "None", "identifyer": 50876, "year": "2020"}, {"Unnamed: 0": 49692, "autor": "1mag1nat1on", "date": 1584147698000, "content": "Pretty well known spot but I wanted my own version [A7RIII] [Tamron 28-75 2.8]", "link": "https://www.reddit.com/r/SonyAlpha/comments/fiade2/pretty_well_known_spot_but_i_wanted_my_own/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pretty well known -----> spot !!!  but i wanted my own version [a7riii] [tamron 28-75 2.8]", "sortedWord": "None", "identifyer": 50907, "year": "2020"}, {"Unnamed: 0": 49699, "autor": "JamminJeff3206", "date": 1584135149000, "content": "I found this amazing spot in downtown Indianapolis. Shot on Sony A7Rii 1/40 f2.0 ISO 640", "link": "https://www.reddit.com/r/SonyAlpha/comments/fi7929/i_found_this_amazing_spot_in_downtown/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found this amazing -----> spot !!!  in downtown indianapolis. shot on sony a7rii 1/40 f2.0 iso 640", "sortedWord": "None", "identifyer": 50915, "year": "2020"}, {"Unnamed: 0": 49790, "autor": "aleksVibes", "date": 1598285808000, "content": "I found this spot and I love the way that sky looks! Was like a big breathe of calm!| a6400 with 18 105 f4", "link": "https://www.reddit.com/r/SonyAlpha/comments/ifs270/i_found_this_spot_and_i_love_the_way_that_sky/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i found this -----> spot !!!  and i love the way that sky looks! was like a big breathe of calm!| a6400 with 18 105 f4", "sortedWord": "None", "identifyer": 51009, "year": "2020"}, {"Unnamed: 0": 50159, "autor": "smallbrownman", "date": 1603751729000, "content": "Macro Shot - Sony a6400 with 7artisans 60mm f2.8 manual macro lens /!/ I just bought a 7artisans 60mm f2.8 manual macro lens over the weekend. My first several shots were terrible, i had a hard time with focus. I watched a video about using the focus magnifier to confirm that you are actually focused the way you **think** you are. I also decided to use a shutter timer to make sure i didn't move the camera at all once the shot was set.  \n\n\nFortunately the spider stayed still and my wife used her cellphone to shine a bit more light until we found a sweet spot that made his eyes light up.  \n\n\nThis was at the f2.8 setting, shutter speed 1/30, ISO1250  \n\n\nI cannot wait to learn even more with this lens!\n\nhttps://preview.redd.it/m20jgsslmiv51.jpg?width=5065&amp;format=pjpg&amp;auto=webp&amp;s=3ec8d19ab47899f413767898eb34ea5ad6f4ffd8", "link": "https://www.reddit.com/r/SonyAlpha/comments/jip053/macro_shot_sony_a6400_with_7artisans_60mm_f28/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "macro shot - sony a6400 with 7artisans 60mm f2.8 manual macro lens /!/ i just bought a 7artisans 60mm f2.8 manual macro lens over the weekend. my first several shots were terrible, i had a hard time with focus. i watched a video about using the focus magnifier to confirm that you are actually focused the way you **think** you are. i also decided to use a shutter timer to make sure i didn't move the camera at all once the shot was set.  \n\n\nfortunately the spider stayed still and my wife used her cellphone to shine a bit more light until we found a sweet -----> spot !!!  that made his eyes light up.  \n\n\nthis was at the f2.8 setting, shutter speed 1/30, iso1250  \n\n\ni cannot wait to learn even more with this lens!\n\nhttps://preview.redd.it/m20jgsslmiv51.jpg?width=5065&amp;format=pjpg&amp;auto=webp&amp;s=3ec8d19ab47899f413767898eb34ea5ad6f4ffd8", "sortedWord": "None", "identifyer": 51392, "year": "2020"}, {"Unnamed: 0": 50270, "autor": "Tyrannosaurocorn", "date": 1603990055000, "content": "Would appreciate the input of people who owned any of the Sony APS-C mirrorless cameras that were released anywhere from and between 2010-2015 (NEX series, a5000, etc.) /!/ Hi everyone! So, I’m in the market for an old, used mirrorless camera to take around with me when I don’t feel like jeopardizing the lives of my DSLRs. I also want to be able to, for instance, loan this camera to family members without worrying about them breaking it. (As in, if it’s broke, I didn’t spend a lot of money on it in the first place.) \n\nSo far, I’ve been looking into a lot of APS-C and M43 cameras, and there are a fair chunk of older Sony mirrorless cameras floating around for pretty cheap!\n\nMostly, the NEX stuff, and early a series cams like the a5000 and the a6000.\n\nEveryone and their mama has suggested the a6000 to me, which is a camera I like and have used, but to be honest, a good condition one runs anywhere from $300 to $400, and while my budget is around $300, picking up an a6000 is literally like picking up a great camera whose life I will, similarly, not want to jeopardize. \n\nOn the other hand, I see a lot of dirt cheap NEX cameras floating around, and I’ve spotted the a5000 for pretty cheap. \n\nI don’t have any specific NEX cameras in mind, so I would appreciate it if people who owned ANY of those cameras, as well as either the a5000 or a5100, could weigh in on, for instance, the handling of the camera they had, the image quality with a good piece of glass, menu layouts, features, etc. If anyone can share image samples they’ve shot, I’d really appreciate that too! I know some of these cameras are conventionally used for videography over photography, but I’m definitely more interested in the photo taking aspects. \n\nAlso, do you still find yourselves using these cameras actively today, if you’ve got other, better bodies?\n\nTo be clear, I’m not looking for a super advanced camera for $50-$100; I don’t care about ibis or autofocus, though some video features might be nice. I’m more focused on it being a comfortable experience, and also about producing images I’ll be at least happy with, for me. \n\nAlso will most likely be adapting old Nikkor lenses.\n\nThanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/jkdmyy/would_appreciate_the_input_of_people_who_owned/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "would appreciate the input of people who owned any of the sony aps-c mirrorless cameras that were released anywhere from and between 2010-2015 (nex series, a5000, etc.) /!/ hi everyone! so, i’m in the market for an old, used mirrorless camera to take around with me when i don’t feel like jeopardizing the lives of my dslrs. i also want to be able to, for instance, loan this camera to family members without worrying about them breaking it. (as in, if it’s broke, i didn’t spend a lot of money on it in the first place.) \n\nso far, i’ve been looking into a lot of aps-c and m43 cameras, and there are a fair chunk of older sony mirrorless cameras floating around for pretty cheap!\n\nmostly, the nex stuff, and early a series cams like the a5000 and the a6000.\n\neveryone and their mama has suggested the a6000 to me, which is a camera i like and have used, but to be honest, a good condition one runs anywhere from $300 to $400, and while my budget is around $300, picking up an a6000 is literally like picking up a great camera whose life i will, similarly, not want to jeopardize. \n\non the other hand, i see a lot of dirt cheap nex cameras floating around, and i’ve -----> spotted !!!  the a5000 for pretty cheap. \n\ni don’t have any specific nex cameras in mind, so i would appreciate it if people who owned any of those cameras, as well as either the a5000 or a5100, could weigh in on, for instance, the handling of the camera they had, the image quality with a good piece of glass, menu layouts, features, etc. if anyone can share image samples they’ve shot, i’d really appreciate that too! i know some of these cameras are conventionally used for videography over photography, but i’m definitely more interested in the photo taking aspects. \n\nalso, do you still find yourselves using these cameras actively today, if you’ve got other, better bodies?\n\nto be clear, i’m not looking for a super advanced camera for $50-$100; i don’t care about ibis or autofocus, though some video features might be nice. i’m more focused on it being a comfortable experience, and also about producing images i’ll be at least happy with, for me. \n\nalso will most likely be adapting old nikkor lenses.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 51510, "year": "2020"}, {"Unnamed: 0": 50834, "autor": "rsh2045", "date": 1594365272000, "content": "Help - Cannot reposition focus point on my a6400 /!/ Hello Sony shooters, I am a beginner and was wondering if someone could help me out with Focus Area setting on my a6400 that I have been struggling with. After I choose flexible spot under Focus Area, I can move the selection square around using the control wheel and lock on the desired area. However, if I want to readjust the position of my square, I try pressing the round button (Select Focus Point On/Off) inside the control wheel to unlock the square to reposition, but it doesn't work. What am I doing wrong?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hokhlo/help_cannot_reposition_focus_point_on_my_a6400/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help - cannot reposition focus point on my a6400 /!/ hello sony shooters, i am a beginner and was wondering if someone could help me out with focus area setting on my a6400 that i have been struggling with. after i choose flexible -----> spot !!!  under focus area, i can move the selection square around using the control wheel and lock on the desired area. however, if i want to readjust the position of my square, i try pressing the round button (select focus point on/off) inside the control wheel to unlock the square to reposition, but it doesn't work. what am i doing wrong?", "sortedWord": "None", "identifyer": 52100, "year": "2020"}, {"Unnamed: 0": 51362, "autor": "D_0_S", "date": 1608864633000, "content": "I think he spotted something... A7iii and 24-105 F4.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kjrs1x/i_think_he_spotted_something_a7iii_and_24105_f4/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i think he -----> spotted !!!  something... a7iii and 24-105 f4.", "sortedWord": "None", "identifyer": 52639, "year": "2020"}, {"Unnamed: 0": 51369, "autor": "Snoo_13751", "date": 1608853242000, "content": "New to Sony and Video Formats Help ! /!/ Hello I am new to Sony Ecosystem and I was wondering if anyone could help me with the video format questions.\n\n1. What Video format is best XAVC or AVHCD ? Not shooting in 4k only 1080p and below \n2. Whats the best way to be able to import videos to my macbook and to finalcut pro here are some pictures of how it looks for me. I have to go to Clips and then these XML files appear which is annoying , just want to be able have all my clips in one spot . Id appreciate the help very much ! Thanks in advance.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kjp7ez/new_to_sony_and_video_formats_help/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "new to sony and video formats help ! /!/ hello i am new to sony ecosystem and i was wondering if anyone could help me with the video format questions.\n\n1. what video format is best xavc or avhcd ? not shooting in 4k only 1080p and below \n2. whats the best way to be able to import videos to my macbook and to finalcut pro here are some pictures of how it looks for me. i have to go to clips and then these xml files appear which is annoying , just want to be able have all my clips in one -----> spot !!!  . id appreciate the help very much ! thanks in advance.", "sortedWord": "None", "identifyer": 52646, "year": "2020"}, {"Unnamed: 0": 51469, "autor": "drinkyourtapwater", "date": 1599853249000, "content": "A6400 | My first time doing star trails. Think it was quite successful, now excited to find a nice spot to have another go!", "link": "https://www.reddit.com/r/SonyAlpha/comments/iqxpa6/a6400_my_first_time_doing_star_trails_think_it/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6400 | my first time doing star trails. think it was quite successful, now excited to find a nice -----> spot !!!  to have another go!", "sortedWord": "None", "identifyer": 52748, "year": "2020"}, {"Unnamed: 0": 51747, "autor": "thefachymarin", "date": 1600145873000, "content": "Hidden spot - A6000 + Sigma 30 1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/it24m9/hidden_spot_a6000_sigma_30_14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hidden -----> spot !!!  - a6000 + sigma 30 1.4", "sortedWord": "None", "identifyer": 53041, "year": "2020"}, {"Unnamed: 0": 51807, "autor": "FutureEcologist", "date": 1607860001000, "content": "Why does my second-hand A6300 keep having dust/spots smudges?? /!/ Every time... I clean the mirror the lenses check it's fine against a white background before I go out and then I film and come back and the film is covered in smudges or spots. \n\nI swear this camera is a money-sink, first the stabilisation is one of the most awful I have encountered so I invested in a gimbal. Now the dust and smudge spots just keep coming back whatever I do. It ruins perfectly good videos. \n\nHow do I get rid of these once and for all?", "link": "https://www.reddit.com/r/SonyAlpha/comments/kc9aoa/why_does_my_secondhand_a6300_keep_having/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "why does my second-hand a6300 keep having dust/-----> spots !!!  smudges?? /!/ every time... i clean the mirror the lenses check it's fine against a white background before i go out and then i film and come back and the film is covered in smudges or spots. \n\ni swear this camera is a money-sink, first the stabilisation is one of the most awful i have encountered so i invested in a gimbal. now the dust and smudge spots just keep coming back whatever i do. it ruins perfectly good videos. \n\nhow do i get rid of these once and for all?", "sortedWord": "None", "identifyer": 53103, "year": "2020"}, {"Unnamed: 0": 52038, "autor": "bazinga0313", "date": 1606280268000, "content": "Auto focus setting changes when I rotate from landscape to portrait. Help! /!/ I just got my sony a7iii and I have run into an inconvenient feature! I love the camera and it was a major upgrade from my Pentax KS-2! So here's the situation: I'm shooting something in landscape on flexible spot expanded, I use a custom button to quickly charge it to wide via the focus area setting. When I switch over to shoot in portrait the focus area changed back to flexible spot expanded. This still happened when I changed the custom button from focus area to focus setting and did the same actions. I find this extremely annoying, when I change the focus area I want it changed until I change it back. Is there a way to prevent it from switching without me telling it to switch? Thank you in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/k0lk67/auto_focus_setting_changes_when_i_rotate_from/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "auto focus setting changes when i rotate from landscape to portrait. help! /!/ i just got my sony a7iii and i have run into an inconvenient feature! i love the camera and it was a major upgrade from my pentax ks-2! so here's the situation: i'm shooting something in landscape on flexible -----> spot !!!  expanded, i use a custom button to quickly charge it to wide via the focus area setting. when i switch over to shoot in portrait the focus area changed back to flexible spot expanded. this still happened when i changed the custom button from focus area to focus setting and did the same actions. i find this extremely annoying, when i change the focus area i want it changed until i change it back. is there a way to prevent it from switching without me telling it to switch? thank you in advance!", "sortedWord": "None", "identifyer": 53348, "year": "2020"}, {"Unnamed: 0": 52128, "autor": "siloxanesavior", "date": 1607305879000, "content": "Best settings for continuous AF memory recall? A7RIII /!/ I'm primarily a stills photographer, but sometimes I do want to use C-AF and/or Eye AF.  On my A7RII, I often found myself having to change multiple settings to get this working ideally.  So, taking advantage of the better AF that the III has, I want to make a memory recall I can switch to and I'm ready to roll.\n\nSo far, I've made these setttings:\nDrive Mode - MID\nFocus Mode - AF-C\nFocus Area - Lock-On AF: Expand Flexible Spot\nCenter button - Eye AF\nAF-ON button - AF On\nFocus Hold Button - Eye AF\n\nAnything else you would do?  Is this pretty ideal to quickly switch from stills to continuous with tracking?", "link": "https://www.reddit.com/r/SonyAlpha/comments/k872iu/best_settings_for_continuous_af_memory_recall/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best settings for continuous af memory recall? a7riii /!/ i'm primarily a stills photographer, but sometimes i do want to use c-af and/or eye af.  on my a7rii, i often found myself having to change multiple settings to get this working ideally.  so, taking advantage of the better af that the iii has, i want to make a memory recall i can switch to and i'm ready to roll.\n\nso far, i've made these setttings:\ndrive mode - mid\nfocus mode - af-c\nfocus area - lock-on af: expand flexible -----> spot !!! \ncenter button - eye af\naf-on button - af on\nfocus hold button - eye af\n\nanything else you would do?  is this pretty ideal to quickly switch from stills to continuous with tracking?", "sortedWord": "None", "identifyer": 53440, "year": "2020"}, {"Unnamed: 0": 52364, "autor": "rabidsoggymoose", "date": 1581245647000, "content": "Remote control a6500 with Android and changing camera settings? /!/ I feel pretty dumb asking this, but I downloaded the Sony Imaging Edge Mobile app for my a6500 (before I had the PlayMemories app) and I can't seem to do basically anything?\n\nI have a live view of what the camera sees and the remote shutter works, but:\n\n- I can't tap somewhere to focus on that spot.\n\n- Can't change any settings like aperture, ISO, or shutter speed even if the camera is in M, S, or A modes.\n\nWhat am I doing wrong?", "link": "https://www.reddit.com/r/SonyAlpha/comments/f176gq/remote_control_a6500_with_android_and_changing/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "remote control a6500 with android and changing camera settings? /!/ i feel pretty dumb asking this, but i downloaded the sony imaging edge mobile app for my a6500 (before i had the playmemories app) and i can't seem to do basically anything?\n\ni have a live view of what the camera sees and the remote shutter works, but:\n\n- i can't tap somewhere to focus on that -----> spot !!! .\n\n- can't change any settings like aperture, iso, or shutter speed even if the camera is in m, s, or a modes.\n\nwhat am i doing wrong?", "sortedWord": "None", "identifyer": 53690, "year": "2020"}, {"Unnamed: 0": 53227, "autor": "yoket", "date": 1606504733000, "content": "First time spotting an owl in the wild! A6000/Sony 70-350", "link": "https://www.reddit.com/r/SonyAlpha/comments/k27noh/first_time_spotting_an_owl_in_the_wild_a6000sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "first time -----> spotting !!!  an owl in the wild! a6000/sony 70-350", "sortedWord": "None", "identifyer": 54598, "year": "2020"}, {"Unnamed: 0": 53307, "autor": "Hisonwang", "date": 1603679516000, "content": "How to quickly and easily remove the dirty spots on the camera sensor COMS", "link": "https://www.reddit.com/r/SonyAlpha/comments/ji6ka0/how_to_quickly_and_easily_remove_the_dirty_spots/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how to quickly and easily remove the dirty -----> spots !!!  on the camera sensor coms", "sortedWord": "None", "identifyer": 54679, "year": "2020"}], "name": "spotSonyAlpha2020"}