{"interestingcomments": [{"Unnamed: 0": 234193, "autor": "duckstudent", "date": 1520960395000, "content": "Just got a A7II and have a few questions. /!/ I've been using a canon rebel for the last 7 years and decided to upgrade to a full frame.  I really like the a7ii but have a few questions.  On the rebel I was able to zoom in then autofocus and I can't do that on the a7ii.  What is the best way to focus with this camera?  It seems like the majority of the pictures I take are slightly out of focus.  I've tried DMF but have a hard time seeing if I'm truely in pinpoint focus when zoomed in using the view finder.  Whats the most consistent method for AF? Wide, zone, center, or flexible spot?  Does the lens make a difference?  I'm using the kit lens right now but have the f4 24-105 on order.\n\n\nSecond, I never had an issue with dust on the sensor on the canon but about a quarter of the pictures I've taken so far I've had to dust correct on the sony. I know its because there is no mirror in front of the sensor, but is there a good way to keep the dust out?  Unfortunately it's not always easy seeing you have a dust spot until after the pictures are taken and you're editing them.", "link": "https://www.reddit.com/r/SonyAlpha/comments/845quv/just_got_a_a7ii_and_have_a_few_questions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just got a a7ii and have a few questions. /!/ i've been using a canon rebel for the last 7 years and decided to upgrade to a full frame.  i really like the a7ii but have a few questions.  on the rebel i was able to zoom in then autofocus and i can't do that on the a7ii.  what is the best way to focus with this camera?  it seems like the majority of the pictures i take are slightly out of focus.  i've tried dmf but have a hard time seeing if i'm truely in pinpoint focus when zoomed in using the view finder.  whats the most consistent method for af? wide, zone, center, or flexible -----> spot !!! ?  does the lens make a difference?  i'm using the kit lens right now but have the f4 24-105 on order.\n\n\nsecond, i never had an issue with dust on the sensor on the canon but about a quarter of the pictures i've taken so far i've had to dust correct on the sony. i know its because there is no mirror in front of the sensor, but is there a good way to keep the dust out?  unfortunately it's not always easy seeing you have a dust spot until after the pictures are taken and you're editing them.", "sortedWord": "None", "identifyer": 29249, "year": "2018"}, {"Unnamed: 0": 235051, "autor": "TidusRed", "date": 1515930053000, "content": "sony a6300 focus for dog run photos /!/ \n\nI write because I wanted to ask you what focus settings I must use to be able to focus on the face of the dog in the race, I tried to use AF-C continuous with Flexible Spot M but failed to focus anything, I have to try to use the Expanded Flexible Spot with AF lock? or only Expanded Flexible Spot?\n\nThank you all.\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/7qbfhx/sony_a6300_focus_for_dog_run_photos/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6300 focus for dog run photos /!/ \n\ni write because i wanted to ask you what focus settings i must use to be able to focus on the face of the dog in the race, i tried to use af-c continuous with flexible -----> spot !!!  m but failed to focus anything, i have to try to use the expanded flexible -----> spot !!!  with af lock? or only expanded flexible spot?\n\nthank you all.\n", "sortedWord": "None", "identifyer": 30117, "year": "2018"}, {"Unnamed: 0": 235054, "autor": "shyguylh", "date": 1515906745000, "content": "Got NEX-3n Kit (16-50PZ) For Only $50 /!/ 4 days ago (01-09-2018) I got a majorly good deal. I spotted a Sony NEX-3n, I model I'd owned before, for only $50 with the 16-50 PZ lens. (I've also owned the A6000 and NEX-6 but after my A6000 fell in the river on vacation last year I've been using a Nikon D3300.) He couldn't try powering it on as its battery was dead &amp; he had no charger, but I charged up my batteries from where I had the A6000 before to see if was functional.\n\nIt was posted on that day just as a \"Sony camera\" by someone who apparently didn't realize it was a nicer model than your typical Cybershot or smartphone camera, but I recognized it as an NEX-3n in the photo and in fact it was. The guy found it in the couch cushions of an apartment he manages, it was left behind by a previous tenant who didn't ever claim it. He didn't seem all that fazed when I told him it was a nicer model used by enthusiasts and pros as a backup for travel etc, although I didn't flat-out tell him he could probably get $200 for it on eBay, regardless he didn't seem fazed. He did know it was an NEX-3n when he messaged me about its availability but I guess he couldn't be bothered to do a quick eBay search--even if he didn't want the bother of shipping still it would've told him what he could ask for it in a sale. \n\nI haven't taken it yet on a real shoot, I need to soon, as portable as it is and with its image quality it begs for it, but I cleaned it up and took some test shots and it works just fine. \n\nTo get something like that for $50, man oh man what a deal.", "link": "https://www.reddit.com/r/SonyAlpha/comments/7q9zw4/got_nex3n_kit_1650pz_for_only_50/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "got nex-3n kit (16-50pz) for only $50 /!/ 4 days ago (01-09-2018) i got a majorly good deal. i -----> spotted !!!  a sony nex-3n, i model i'd owned before, for only $50 with the 16-50 pz lens. (i've also owned the a6000 and nex-6 but after my a6000 fell in the river on vacation last year i've been using a nikon d3300.) he couldn't try powering it on as its battery was dead &amp; he had no charger, but i charged up my batteries from where i had the a6000 before to see if was functional.\n\nit was posted on that day just as a \"sony camera\" by someone who apparently didn't realize it was a nicer model than your typical cybershot or smartphone camera, but i recognized it as an nex-3n in the photo and in fact it was. the guy found it in the couch cushions of an apartment he manages, it was left behind by a previous tenant who didn't ever claim it. he didn't seem all that fazed when i told him it was a nicer model used by enthusiasts and pros as a backup for travel etc, although i didn't flat-out tell him he could probably get $200 for it on ebay, regardless he didn't seem fazed. he did know it was an nex-3n when he messaged me about its availability but i guess he couldn't be bothered to do a quick ebay search--even if he didn't want the bother of shipping still it would've told him what he could ask for it in a sale. \n\ni haven't taken it yet on a real shoot, i need to soon, as portable as it is and with its image quality it begs for it, but i cleaned it up and took some test shots and it works just fine. \n\nto get something like that for $50, man oh man what a deal.", "sortedWord": "None", "identifyer": 30120, "year": "2018"}, {"Unnamed: 0": 235102, "autor": "RoePats", "date": 1520647246000, "content": "Lightbulb type spotted - Sony a7ii tokina 150-500 5.6 at 500mm f/9 1/200th ISO 200", "link": "https://www.reddit.com/r/SonyAlpha/comments/83c4z4/lightbulb_type_spotted_sony_a7ii_tokina_150500_56/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "lightbulb type -----> spotted !!!  - sony a7ii tokina 150-500 5.6 at 500mm f/9 1/200th iso 200", "sortedWord": "None", "identifyer": 30169, "year": "2018"}, {"Unnamed: 0": 235262, "autor": "Bguiliano", "date": 1522238768000, "content": "Dust spot /!/ I have an A7rii \nI noticed one annoying, what I think is a dust spot on the sensor\nI was thinking of having it cleaned \n\nBut my local camera store charges $79 for full frame cleaning \n\nShould i wait a bit longer ?\n\nTried rocket blower and cleaning mode\n\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/87rchn/dust_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dust -----> spot !!!  /!/ i have an a7rii \ni noticed one annoying, what i think is a dust spot on the sensor\ni was thinking of having it cleaned \n\nbut my local camera store charges $79 for full frame cleaning \n\nshould i wait a bit longer ?\n\ntried rocket blower and cleaning mode\n\n", "sortedWord": "None", "identifyer": 30329, "year": "2018"}, {"Unnamed: 0": 236226, "autor": "trspanache", "date": 1530077762000, "content": "Quiet spot with a grand view. A7iii 55mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/8u726f/quiet_spot_with_a_grand_view_a7iii_55mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "quiet -----> spot !!!  with a grand view. a7iii 55mm 1.8", "sortedWord": "None", "identifyer": 31313, "year": "2018"}, {"Unnamed: 0": 236311, "autor": "Mller013", "date": 1528581002000, "content": "I wanted to shy away from the conventional spots but still make it feel like Paris. [Sony a7riii, 85mm 1.8]", "link": "https://www.reddit.com/r/SonyAlpha/comments/8pw6t1/i_wanted_to_shy_away_from_the_conventional_spots/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i wanted to shy away from the conventional -----> spots !!!  but still make it feel like paris. [sony a7riii, 85mm 1.8]", "sortedWord": "None", "identifyer": 31399, "year": "2018"}, {"Unnamed: 0": 236449, "autor": "Sliger", "date": 1527084175000, "content": "Sony a6000, Sigma 30mm. This is in Northern Utah at my go-to reading spot.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8ljlo2/sony_a6000_sigma_30mm_this_is_in_northern_utah_at/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6000, sigma 30mm. this is in northern utah at my go-to reading -----> spot !!! .", "sortedWord": "None", "identifyer": 31537, "year": "2018"}, {"Unnamed: 0": 236648, "autor": "jaemelo", "date": 1517530436000, "content": "[24-70mm GM owners] What f stop are you guys using for landscape?! f8, f11 ect ect?! Im basically trying to figure out this lenses sweet spot for landscapes.", "link": "https://www.reddit.com/r/SonyAlpha/comments/7unc6j/2470mm_gm_owners_what_f_stop_are_you_guys_using/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[24-70mm gm owners] what f stop are you guys using for landscape?! f8, f11 ect ect?! im basically trying to figure out this lenses sweet -----> spot !!!  for landscapes.", "sortedWord": "None", "identifyer": 31737, "year": "2018"}, {"Unnamed: 0": 236708, "autor": "naeem151287", "date": 1517361993000, "content": "Spot the bee | A6300 + 16mm 1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/7u64k2/spot_the_bee_a6300_16mm_14/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  the bee | a6300 + 16mm 1.4", "sortedWord": "None", "identifyer": 31797, "year": "2018"}, {"Unnamed: 0": 237235, "autor": "GRang3r", "date": 1545927617000, "content": "This spot in the Azores provided me a great opportunity to try my first multi photo stitch together using Lightroom. A5100 kit lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/aa0jh9/this_spot_in_the_azores_provided_me_a_great/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this -----> spot !!!  in the azores provided me a great opportunity to try my first multi photo stitch together using lightroom. a5100 kit lens", "sortedWord": "None", "identifyer": 32328, "year": "2018"}, {"Unnamed: 0": 237692, "autor": "Torrero", "date": 1521766115000, "content": "Looking for an A6000 Accessory /!/ I just go the A6000 and I am trying to get it just the way I like it. \n\nThis may seem like something insignificant, and I do not know the name of this particular spot, but the mount on the top of the body, where you would attach a dedicated flash, that spot. \n\nDo they make something that fills in that hole and covers the contacts? I know I will never get a flash for this thing and I just want to clean up the look of the camera from the top. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/86gp3o/looking_for_an_a6000_accessory/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for an a6000 accessory /!/ i just go the a6000 and i am trying to get it just the way i like it. \n\nthis may seem like something insignificant, and i do not know the name of this particular -----> spot !!! , but the mount on the top of the body, where you would attach a dedicated flash, that -----> spot !!! . \n\ndo they make something that fills in that hole and covers the contacts? i know i will never get a flash for this thing and i just want to clean up the look of the camera from the top. ", "sortedWord": "None", "identifyer": 32794, "year": "2018"}, {"Unnamed: 0": 238091, "autor": "Black3ternity", "date": 1541774688000, "content": "Horrible QC with SEL70300G - Advice? /!/ Hi there,   \n\nhas anyone encountered QC issues with the SEL70300G?  \n\nI've received my second lens now and it has couple of spots on the second lens element that make it impossible to enjoy. The first lens had a single spot and some sort of \"debris\" floating around when you rattled it. I bought it used and thought that it might be abused. So I returned it to Amazon because it was still under warranty. Exchanged it for a brand new one that just now arrived and this is the first picture with F22 against a clean wall.   \n\nIt's shot with an A6000 so it's basically right in the middle of the lens. And I can see all these spots. It's infuriating.  \n\nWhat should I do about that? Return it again to Amazon and order a replacement? They must think I'm stupid.  ", "link": "https://www.reddit.com/r/SonyAlpha/comments/9vkziu/horrible_qc_with_sel70300g_advice/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "horrible qc with sel70300g - advice? /!/ hi there,   \n\nhas anyone encountered qc issues with the sel70300g?  \n\ni've received my second lens now and it has couple of -----> spots !!!  on the second lens element that make it impossible to enjoy. the first lens had a single spot and some sort of \"debris\" floating around when you rattled it. i bought it used and thought that it might be abused. so i returned it to amazon because it was still under warranty. exchanged it for a brand new one that just now arrived and this is the first picture with f22 against a clean wall.   \n\nit's shot with an a6000 so it's basically right in the middle of the lens. and i can see all these spots. it's infuriating.  \n\nwhat should i do about that? return it again to amazon and order a replacement? they must think i'm stupid.  ", "sortedWord": "None", "identifyer": 33199, "year": "2018"}, {"Unnamed: 0": 238982, "autor": "foxrocksphotography", "date": 1534089083000, "content": "Mountain biking on Goat Ridge near Squamish, BC /!/ Incredible spot to ride your bike.  Very difficult access.", "link": "https://www.reddit.com/r/SonyAlpha/comments/96pz91/mountain_biking_on_goat_ridge_near_squamish_bc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mountain biking on goat ridge near squamish, bc /!/ incredible -----> spot !!!  to ride your bike.  very difficult access.", "sortedWord": "None", "identifyer": 34105, "year": "2018"}, {"Unnamed: 0": 239215, "autor": "condacto", "date": 1535654203000, "content": "Problem with Sony rx100 iv focusring. /!/ Yesterday I dropped my sony rx100 iv. There was no damage or anything but today I wanted to use the focusring and I realised that I cant use the focus ring as usual. There are spots where it is really hard to turn and other spots where it works normally.\n\nDoes anyone know if there is a fix for this or if the ring is just brokes.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9bm9we/problem_with_sony_rx100_iv_focusring/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "problem with sony rx100 iv focusring. /!/ yesterday i dropped my sony rx100 iv. there was no damage or anything but today i wanted to use the focusring and i realised that i cant use the focus ring as usual. there are -----> spots !!!  where it is really hard to turn and other -----> spots !!!  where it works normally.\n\ndoes anyone know if there is a fix for this or if the ring is just brokes.", "sortedWord": "None", "identifyer": 34343, "year": "2018"}, {"Unnamed: 0": 239392, "autor": "TrueEclective", "date": 1537762518000, "content": "A7iii tracking sensitivity: Went from 5 to 1 (focus lock) today and still had trouble. /!/ I shot a disc dog show today with really busy backgrounds and kept losing focus of the dog and getting focus behind them on the crowd. No matter what my sensitivity was set to, it didn’t seem to matter. Other settings were:\n\n1. Spot AF with a M spot in center (expandable was way too sporadic)\n2. Back-button AF\n3. Face recognition off\n\nAny other suggestions? Smaller hit box, or try larger? I feel like I did a decent job of keeping the dog in my focus area, but still ended up getting tons of back-focus. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/9iey53/a7iii_tracking_sensitivity_went_from_5_to_1_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii tracking sensitivity: went from 5 to 1 (focus lock) today and still had trouble. /!/ i shot a disc dog show today with really busy backgrounds and kept losing focus of the dog and getting focus behind them on the crowd. no matter what my sensitivity was set to, it didn’t seem to matter. other settings were:\n\n1. -----> spot !!!  af with a m -----> spot !!!  in center (expandable was way too sporadic)\n2. back-button af\n3. face recognition off\n\nany other suggestions? smaller hit box, or try larger? i feel like i did a decent job of keeping the dog in my focus area, but still ended up getting tons of back-focus. ", "sortedWord": "None", "identifyer": 34521, "year": "2018"}, {"Unnamed: 0": 239454, "autor": "b_a_c_o_n_", "date": 1528347028000, "content": "Took some rollers of a 240z spotted driving through LA \\\\ a7r ii + 24-70 F4 [F4, ISO 100, 1/50]", "link": "https://www.reddit.com/r/SonyAlpha/comments/8p7j1q/took_some_rollers_of_a_240z_spotted_driving/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "took some rollers of a 240z -----> spotted !!!  driving through la \\\\ a7r ii + 24-70 f4 [f4, iso 100, 1/50]", "sortedWord": "None", "identifyer": 34585, "year": "2018"}, {"Unnamed: 0": 240034, "autor": "Unrelated_to_this", "date": 1516545816000, "content": "Does my 18-105mm have an issue or is this lens hit and miss with focus? /!/ 1 out of 5 pics will have soft focus. Strange part is, wherever I choose to focus in the frame using small spot focus, the lens focuses just a bit away from where I intended in the image. So this must be an issue of the camera and not lens? Other lenses never do this.\n  \nAnd even the good focus images, I'm not exactly satisfied with the sharpness when zooming in. Unreasonable as viewing the images normally seems perfectly sharp, but I think I miss my primes I sold for this lens :(.", "link": "https://www.reddit.com/r/SonyAlpha/comments/7ry0z7/does_my_18105mm_have_an_issue_or_is_this_lens_hit/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does my 18-105mm have an issue or is this lens hit and miss with focus? /!/ 1 out of 5 pics will have soft focus. strange part is, wherever i choose to focus in the frame using small -----> spot !!!  focus, the lens focuses just a bit away from where i intended in the image. so this must be an issue of the camera and not lens? other lenses never do this.\n  \nand even the good focus images, i'm not exactly satisfied with the sharpness when zooming in. unreasonable as viewing the images normally seems perfectly sharp, but i think i miss my primes i sold for this lens :(.", "sortedWord": "None", "identifyer": 35173, "year": "2018"}, {"Unnamed: 0": 240166, "autor": "animelov", "date": 1526048799000, "content": "a6300 crashing with video after about 3 minutes, Sony support wasn't much help, any thoughts? /!/ https://youtu.be/B-rCwAODt5g?t=82\n\n\nApologies in advance for the bouncy video, crash happens faster that way.\n\n\nI've had this issue for awhile now, and I finally made a video of it and submitted it to Sony for help.  They sent me a generic 'try this, and if it doesn't work, submit it to be serviced'.  Well, they didn't watch the video (still has one view...me), it didn't work, and since it is out of warranty, service is about $200.  Has anybody seen this and have a resolution?  Given the way it crashes, I have a feeling it's bad RAM on the camera, and once the buffer reaches that spot on memory, it crashes.  I think this because if there is alot of activity on the camera, it will happen much sooner (about 3 minutes) than if it were still and pointed at the wall (11 minutes).  I get no thermal indicator, nor is warm when after it crashes, so that's not it.  So far I've tried:\n\n\n-Two Batteries\n-Two memory cards (one UHC-1 and one UHC-3)\n-All of my lenses (kit lens, 35 and 50mm Sony 1.8, 50-200mm Sony and 10-18mm Sony)\n-All recording modes\n\n\nAny thoughts?  Thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8io5o9/a6300_crashing_with_video_after_about_3_minutes/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6300 crashing with video after about 3 minutes, sony support wasn't much help, any thoughts? /!/ https://youtu.be/b-rcwaodt5g?t=82\n\n\napologies in advance for the bouncy video, crash happens faster that way.\n\n\ni've had this issue for awhile now, and i finally made a video of it and submitted it to sony for help.  they sent me a generic 'try this, and if it doesn't work, submit it to be serviced'.  well, they didn't watch the video (still has one view...me), it didn't work, and since it is out of warranty, service is about $200.  has anybody seen this and have a resolution?  given the way it crashes, i have a feeling it's bad ram on the camera, and once the buffer reaches that -----> spot !!!  on memory, it crashes.  i think this because if there is alot of activity on the camera, it will happen much sooner (about 3 minutes) than if it were still and pointed at the wall (11 minutes).  i get no thermal indicator, nor is warm when after it crashes, so that's not it.  so far i've tried:\n\n\n-two batteries\n-two memory cards (one uhc-1 and one uhc-3)\n-all of my lenses (kit lens, 35 and 50mm sony 1.8, 50-200mm sony and 10-18mm sony)\n-all recording modes\n\n\nany thoughts?  thanks in advance!", "sortedWord": "None", "identifyer": 35307, "year": "2018"}, {"Unnamed: 0": 240297, "autor": "ParanoidPhantom", "date": 1523063371000, "content": "Camera overheated, white dot on sensor. Will the problem get worse? /!/ Hey all,\n\nI had a bit of a mishap recently - I was using my a6000 on a flight and when I packed the camera back in my bag towards the end of the flight I must have jolted it. The camera got switched on and the lens wasn't fully attached so it stayed switched on stuck on the \"please attach lens\" screen. It was left in my bag like this for a few hours until I arrived at my hotel. By the time I took it out of my bag it was hot to the touch and almost out of power.\n\nI left the camera to cool then turned it on to check and while most of it seems fine, there's a permanent white spot on my sensor that shows up both in the viewfinder and on photos. I know it is on the sensor as it is always outlined when focus peaking is turned on.\n\nI haven't seen anyone online describe anything similar, so I am not sure how much of a problem this could be. It looks quite small right now, but I worry it could get worse in the future.\n\nDoes anyone have any idea what this is and if there is any way I can fix or minimise the issue?\n\nThanks for taking the time to read this post. Apologies for the lack of example photos but I currently have no access to a PC. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/8aeotv/camera_overheated_white_dot_on_sensor_will_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camera overheated, white dot on sensor. will the problem get worse? /!/ hey all,\n\ni had a bit of a mishap recently - i was using my a6000 on a flight and when i packed the camera back in my bag towards the end of the flight i must have jolted it. the camera got switched on and the lens wasn't fully attached so it stayed switched on stuck on the \"please attach lens\" screen. it was left in my bag like this for a few hours until i arrived at my hotel. by the time i took it out of my bag it was hot to the touch and almost out of power.\n\ni left the camera to cool then turned it on to check and while most of it seems fine, there's a permanent white -----> spot !!!  on my sensor that shows up both in the viewfinder and on photos. i know it is on the sensor as it is always outlined when focus peaking is turned on.\n\ni haven't seen anyone online describe anything similar, so i am not sure how much of a problem this could be. it looks quite small right now, but i worry it could get worse in the future.\n\ndoes anyone have any idea what this is and if there is any way i can fix or minimise the issue?\n\nthanks for taking the time to read this post. apologies for the lack of example photos but i currently have no access to a pc. ", "sortedWord": "None", "identifyer": 35439, "year": "2018"}, {"Unnamed: 0": 240766, "autor": "jwr_", "date": 1515070743000, "content": "So apparently some lasers at a concert left red spots on the CCD of my A6500 and Sony says it's not covered by the guarantee (Small Rant) /!/ Just wanted to share my experience with you guys. I bought A6500 on April. I was a Canon 550D user for 5 years so this was a HUGE step up game from me. I bought lenses and everything. \n\nI attended a [Royksopp](https://en.wikipedia.org/wiki/R%C3%B6yksopp) concert here in my country in June. After this concert I went to Paris and when i reviewed my footage I saw [small red spots](https://www.dropbox.com/sh/rtmrgpeqcsd6x70/AADFUHbe65LgsrNKoFHj8Sb9a?dl=0) on the video and photos too. After a short google I thought there were stuck pixels and did the [date trick](http://www.4kshooters.net/2015/12/01/an-easy-trick-to-fix-dreadful-dead-pixels-in-your-sony-a7s-ii/)\n\nIt didn't work. As the red spots weren't too visible I continued to work with that camera and I couldn't send it for a fix since it was my only camera. Fast forward to December, my local shop sends it to Sony Service in Poland. \n&gt; \n&gt; The camera has been exposed to severe lighting *or* lasers that partly destroyed the CCD. Unfortunately this is *not covered by the guarantee* and in order to fix this it will cost **536€**\n\nAs you can understand I was shocked and infuriated. A two month old camera has been destroyed from some lasers at a concert. I know DSLRs and Mirrorless are sensitive to this stuff but this is insane. This camera had almost 2k when I bought it. It can't be destroyed SO easily. I have tortured my 550D so much these years I even shot some docs in [EXIT Festival](https://www.youtube.com/watch?v=4fxfcTuS8ts) (**twice**) with *huge* amounts of lasers and this thing survived everything. \n\n\nNot trying to find a solution here just wanted to share my experience and listen to your thoughts on this. I decided not to give 1/3 of the camera to fix this and wait for the next model which is just around the corner. Yeah I know some will say why don't you stick with Canon then. Well, I am very very happy with this camera and the features it gave me that I can't go back. (plus I need lenses again etc).\n\n\n**TLDR**: Two month old A6500 CCD got burnt ([Red spots on videos and photos](https://www.dropbox.com/sh/rtmrgpeqcsd6x70/AADFUHbe65LgsrNKoFHj8Sb9a?dl=0)) from [this laser concert](https://www.youtube.com/watch?v=iZ8qItdTpjA).\n  Sony says it's not covered by guarantee and asked me 536€ to fix this. \n", "link": "https://www.reddit.com/r/SonyAlpha/comments/7o2szc/so_apparently_some_lasers_at_a_concert_left_red/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "so apparently some lasers at a concert left red -----> spots !!!  on the ccd of my a6500 and sony says it's not covered by the guarantee (small rant) /!/ just wanted to share my experience with you guys. i bought a6500 on april. i was a canon 550d user for 5 years so this was a huge step up game from me. i bought lenses and everything. \n\ni attended a [royksopp](https://en.wikipedia.org/wiki/r%c3%b6yksopp) concert here in my country in june. after this concert i went to paris and when i reviewed my footage i saw [small red spots](https://www.dropbox.com/sh/rtmrgpeqcsd6x70/aadfuhbe65lgsrnkofhj8sb9a?dl=0) on the video and photos too. after a short google i thought there were stuck pixels and did the [date trick](http://www.4kshooters.net/2015/12/01/an-easy-trick-to-fix-dreadful-dead-pixels-in-your-sony-a7s-ii/)\n\nit didn't work. as the red spots weren't too visible i continued to work with that camera and i couldn't send it for a fix since it was my only camera. fast forward to december, my local shop sends it to sony service in poland. \n&gt; \n&gt; the camera has been exposed to severe lighting *or* lasers that partly destroyed the ccd. unfortunately this is *not covered by the guarantee* and in order to fix this it will cost **536€**\n\nas you can understand i was shocked and infuriated. a two month old camera has been destroyed from some lasers at a concert. i know dslrs and mirrorless are sensitive to this stuff but this is insane. this camera had almost 2k when i bought it. it can't be destroyed so easily. i have tortured my 550d so much these years i even shot some docs in [exit festival](https://www.youtube.com/watch?v=4fxfctus8ts) (**twice**) with *huge* amounts of lasers and this thing survived everything. \n\n\nnot trying to find a solution here just wanted to share my experience and listen to your thoughts on this. i decided not to give 1/3 of the camera to fix this and wait for the next model which is just around the corner. yeah i know some will say why don't you stick with canon then. well, i am very very happy with this camera and the features it gave me that i can't go back. (plus i need lenses again etc).\n\n\n**tldr**: two month old a6500 ccd got burnt ([red spots on videos and photos](https://www.dropbox.com/sh/rtmrgpeqcsd6x70/aadfuhbe65lgsrnkofhj8sb9a?dl=0)) from [this laser concert](https://www.youtube.com/watch?v=iz8qitdtpja).\n  sony says it's not covered by guarantee and asked me 536€ to fix this. \n", "sortedWord": "None", "identifyer": 35912, "year": "2018"}, {"Unnamed: 0": 241102, "autor": "knubb3", "date": 1545066130000, "content": "Horseshoe Bend, Arizona. (I know this spot has been photographed a million times before but I was pleased with how this turned out)", "link": "https://www.reddit.com/r/SonyAlpha/comments/a71ldz/horseshoe_bend_arizona_i_know_this_spot_has_been/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "horseshoe bend, arizona. (i know this -----> spot !!!  has been photographed a million times before but i was pleased with how this turned out)", "sortedWord": "None", "identifyer": 36254, "year": "2018"}, {"Unnamed: 0": 241466, "autor": "BannerIsBeautiful", "date": 1540869603000, "content": "Should my sensor be 100% free of dust? /!/ Brand new A6500 owner here. I cleaned my sensor, I can't see any spot in pictures and at naked eye, the sensor looks clean.\n\nWhen I put the phone flashlight to see it, I can still see 6 or seven little dust particles. Should I be worried about it? Should I try to remove every little dust particle? Is there a problem to leave it as it is?\n\nThanks so much.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9sk98j/should_my_sensor_be_100_free_of_dust/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "should my sensor be 100% free of dust? /!/ brand new a6500 owner here. i cleaned my sensor, i can't see any -----> spot !!!  in pictures and at naked eye, the sensor looks clean.\n\nwhen i put the phone flashlight to see it, i can still see 6 or seven little dust particles. should i be worried about it? should i try to remove every little dust particle? is there a problem to leave it as it is?\n\nthanks so much.", "sortedWord": "None", "identifyer": 36625, "year": "2018"}, {"Unnamed: 0": 241866, "autor": "Silentism", "date": 1532346007000, "content": "[a6000][Sigma 16mm f1.4] First steel wool shoot. Unfortunately no high enough spot to get the sparks to fall vertically", "link": "https://www.reddit.com/r/SonyAlpha/comments/916bis/a6000sigma_16mm_f14_first_steel_wool_shoot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[a6000][sigma 16mm f1.4] first steel wool shoot. unfortunately no high enough -----> spot !!!  to get the sparks to fall vertically", "sortedWord": "None", "identifyer": 37035, "year": "2018"}, {"Unnamed: 0": 242171, "autor": "datguywelbzzz", "date": 1531208213000, "content": "Best focus settings for wildlife photography with the A7ii? /!/ I've been struggling a bit with the A7ii with wildlife photography - going back and forth between centre, wide and zone lock-on AF as well as flexible spot lock-on AF and I end up missing a few shots here and there with all of them. Any advice on the best settings for wildlife photography? Thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8xmomq/best_focus_settings_for_wildlife_photography_with/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best focus settings for wildlife photography with the a7ii? /!/ i've been struggling a bit with the a7ii with wildlife photography - going back and forth between centre, wide and zone lock-on af as well as flexible -----> spot !!!  lock-on af and i end up missing a few shots here and there with all of them. any advice on the best settings for wildlife photography? thanks in advance!", "sortedWord": "None", "identifyer": 37345, "year": "2018"}, {"Unnamed: 0": 242236, "autor": "unrealfreak1", "date": 1542152557000, "content": "Kimi No Na Wa spot in Tokyo (6500 | Sigma 16mm)", "link": "https://www.reddit.com/r/SonyAlpha/comments/9wui9x/kimi_no_na_wa_spot_in_tokyo_6500_sigma_16mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "kimi no na wa -----> spot !!!  in tokyo (6500 | sigma 16mm)", "sortedWord": "None", "identifyer": 37412, "year": "2018"}, {"Unnamed: 0": 242307, "autor": "dressedlikerappers", "date": 1542027479000, "content": "Dust Spot on Sony A7iii - no lens change?", "link": "https://www.reddit.com/r/SonyAlpha/comments/9wdsll/dust_spot_on_sony_a7iii_no_lens_change/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dust -----> spot !!!  on sony a7iii - no lens change?", "sortedWord": "None", "identifyer": 37485, "year": "2018"}, {"Unnamed: 0": 243017, "autor": "mxt79", "date": 1542360078000, "content": "Canon - Sony adapter ? /!/ I need an adapter for my Samyang/Rokinon lenses.\nI already have one but the makings on the focus ring and infinity are way of with this one and causes weird diffraction and blur. My current one is a Commlite.\n\nCan anyone recommend a brand that is reliable and makes the lenses perform correct. I have adapters for Olympus/Pentax etc and those are spot-on sharp and works great. It’s just the canon one. Guess it’s a design flaw/wrong measurement. I don’t need adapter with electronics. Just an accurate one for manual lenses.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9xkntk/canon_sony_adapter/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon - sony adapter ? /!/ i need an adapter for my samyang/rokinon lenses.\ni already have one but the makings on the focus ring and infinity are way of with this one and causes weird diffraction and blur. my current one is a commlite.\n\ncan anyone recommend a brand that is reliable and makes the lenses perform correct. i have adapters for olympus/pentax etc and those are -----> spot !!! -on sharp and works great. it’s just the canon one. guess it’s a design flaw/wrong measurement. i don’t need adapter with electronics. just an accurate one for manual lenses.", "sortedWord": "None", "identifyer": 38211, "year": "2018"}, {"Unnamed: 0": 243133, "autor": "Proplus888", "date": 1539167145000, "content": "New v2.00 firmware released for A7iii and A7Riii /!/ [https://www.sony.co.uk/electronics/support/e-mount-body-ilce-7-series/ilce-7m3/downloads/00015510](https://www.sony.co.uk/electronics/support/e-mount-body-ilce-7-series/ilce-7m3/downloads/00015510)\n\n[https://www.sony.com/electronics/support/e-mount-body-ilce-7-series/ilce-7rm3/downloads/00015521](https://www.sony.com/electronics/support/e-mount-body-ilce-7-series/ilce-7rm3/downloads/00015521)\n\nA7III an A7rIII: Benefits and Improvements from the latest update\n\nSupport of “SEL400F28GM”and “SEL24F14GM”\n\n* Optimization of the optical image stabilization performance, and addition of a new image stabilization mode of the lens (Mode 3)(Only “SEL400F28GM”).\n* Addition of a Function Ring(Lens) to the menu.  \nNote: For the SEL400F28GM lens, the APS-C S35/Full Frame Sel. setting is assignable to the Function Ring in addition to Power Focus.\n* Addition of \\[Aperture Drive in AF\\] setting in the menu.  \n\\*Using the lens “SEL400F28GM” or “SEL24F14GM”, when \\[Silent priority\\] is selected, the sound emitted by the aperture drive will be reduced. This is useful in shooting conditions where camera.  \nnoise should be kept to a minimum. Note that Auto Focus may become slower when \\[Silent priority\\] is selected.\n\nNew features:\n\n* \\[AF Track Sens\\] can be assigned to a custom key.\n* When used with the LA-EA3 mount adaptor \\[link to product page\\], all focus areas are supported.  \nNote : Focus Area options added : Zone, Expand Flexible Spot, and Lock-on AF.  \nBracket shooting is available during silent shooting when \\[File Format\\] is set to \\[RAW\\] or \\[RAW &amp; JPEG\\] and \\[RAW File Type\\] is set to \\[Uncompressed\\].\n\nOther improvements:\n\n* Improvement of the performance and the overall stability of the camera.\n* Better reproduction of the gradation of RAW pictures.  \nNote: [Imaging Edge software](http://www.sony.net/disoft/d/) needs to be updated to benefit from the improvement in the RAW processing.\n* When shooting with a flash in an environment with flickering light sources, the stability of the exposure is improved.\n* Improvement of managing continuously shot images as a group.  \nPlease refer to the [HelpGuide](http://helpguide.sony.net/ilc/1720/v1/h_zz/index.html) for updated function usage.", "link": "https://www.reddit.com/r/SonyAlpha/comments/9my8jy/new_v200_firmware_released_for_a7iii_and_a7riii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "new v2.00 firmware released for a7iii and a7riii /!/ [https://www.sony.co.uk/electronics/support/e-mount-body-ilce-7-series/ilce-7m3/downloads/00015510](https://www.sony.co.uk/electronics/support/e-mount-body-ilce-7-series/ilce-7m3/downloads/00015510)\n\n[https://www.sony.com/electronics/support/e-mount-body-ilce-7-series/ilce-7rm3/downloads/00015521](https://www.sony.com/electronics/support/e-mount-body-ilce-7-series/ilce-7rm3/downloads/00015521)\n\na7iii an a7riii: benefits and improvements from the latest update\n\nsupport of “sel400f28gm”and “sel24f14gm”\n\n* optimization of the optical image stabilization performance, and addition of a new image stabilization mode of the lens (mode 3)(only “sel400f28gm”).\n* addition of a function ring(lens) to the menu.  \nnote: for the sel400f28gm lens, the aps-c s35/full frame sel. setting is assignable to the function ring in addition to power focus.\n* addition of \\[aperture drive in af\\] setting in the menu.  \n\\*using the lens “sel400f28gm” or “sel24f14gm”, when \\[silent priority\\] is selected, the sound emitted by the aperture drive will be reduced. this is useful in shooting conditions where camera.  \nnoise should be kept to a minimum. note that auto focus may become slower when \\[silent priority\\] is selected.\n\nnew features:\n\n* \\[af track sens\\] can be assigned to a custom key.\n* when used with the la-ea3 mount adaptor \\[link to product page\\], all focus areas are supported.  \nnote : focus area options added : zone, expand flexible -----> spot !!! , and lock-on af.  \nbracket shooting is available during silent shooting when \\[file format\\] is set to \\[raw\\] or \\[raw &amp; jpeg\\] and \\[raw file type\\] is set to \\[uncompressed\\].\n\nother improvements:\n\n* improvement of the performance and the overall stability of the camera.\n* better reproduction of the gradation of raw pictures.  \nnote: [imaging edge software](http://www.sony.net/disoft/d/) needs to be updated to benefit from the improvement in the raw processing.\n* when shooting with a flash in an environment with flickering light sources, the stability of the exposure is improved.\n* improvement of managing continuously shot images as a group.  \nplease refer to the [helpguide](http://helpguide.sony.net/ilc/1720/v1/h_zz/index.html) for updated function usage.", "sortedWord": "None", "identifyer": 38329, "year": "2018"}, {"Unnamed: 0": 243213, "autor": "SearedBasket", "date": 1515467979000, "content": "Possibly taking a NJ-AZ roadtrip in july, looking for destination spots with my camera, and tips for the FLIGHT back /!/ I'm possibly taking a 2 week roadtrip from New Jersey to Arizona in July to help a friend.  We plan on driving their, leaving the car, and flying back.\n\nI'm looking for a few destination spots to hit for pictures with my a6000, samyang 12mm, and sigma 30mm.  Also wondering if I should pick up/rent another lens for the trip?\n\nI'm also wondering about flying with my camera + gear.  What is the best way to do that safely and ensure my camera arriving home in tact?\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/7p48x2/possibly_taking_a_njaz_roadtrip_in_july_looking/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "possibly taking a nj-az roadtrip in july, looking for destination -----> spots !!!  with my camera, and tips for the flight back /!/ i'm possibly taking a 2 week roadtrip from new jersey to arizona in july to help a friend.  we plan on driving their, leaving the car, and flying back.\n\ni'm looking for a few destination spots to hit for pictures with my a6000, samyang 12mm, and sigma 30mm.  also wondering if i should pick up/rent another lens for the trip?\n\ni'm also wondering about flying with my camera + gear.  what is the best way to do that safely and ensure my camera arriving home in tact?\n", "sortedWord": "None", "identifyer": 38411, "year": "2018"}, {"Unnamed: 0": 243530, "autor": "macd0t", "date": 1529089271000, "content": "Slightly off topic: Best places to stop in Utah? /!/ I'm taking a trip down highway 15 this summer and have seen so many beautiful pictures people here have taken in the national parks. I was wondering if anyone has suggestions of places to stop off for a few hours or a day. I know Zion is right there and Bryce isn't too far off, but all the parks are so large I would like to plan to hit some specific spots that have great scenery. Thanks for any suggestions!", "link": "https://www.reddit.com/r/SonyAlpha/comments/8rdgh2/slightly_off_topic_best_places_to_stop_in_utah/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "slightly off topic: best places to stop in utah? /!/ i'm taking a trip down highway 15 this summer and have seen so many beautiful pictures people here have taken in the national parks. i was wondering if anyone has suggestions of places to stop off for a few hours or a day. i know zion is right there and bryce isn't too far off, but all the parks are so large i would like to plan to hit some specific -----> spots !!!  that have great scenery. thanks for any suggestions!", "sortedWord": "None", "identifyer": 38733, "year": "2018"}, {"Unnamed: 0": 244371, "autor": "poipoipoi_2016", "date": 1525054975000, "content": "a6500 or a7 iii /!/ I'm going to be hiking Half Dome this fall and Grand Canyon next year, and my cell phone, which I have been moderately thrilled with, is .  \n\nBasically... Where's the sweet spot here in terms of weight to performance?  The A6500 or the A7 iii?\n\nAnd here, I must admit to heresy, because half of me wants to get the A6500, learn with that, then flip over to Nikon and use the Nikon D750 replacement for the Grand Canyon when half my backpack isn't taken up by the camping gear.  ", "link": "https://www.reddit.com/r/SonyAlpha/comments/8fw9l5/a6500_or_a7_iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6500 or a7 iii /!/ i'm going to be hiking half dome this fall and grand canyon next year, and my cell phone, which i have been moderately thrilled with, is .  \n\nbasically... where's the sweet -----> spot !!!  here in terms of weight to performance?  the a6500 or the a7 iii?\n\nand here, i must admit to heresy, because half of me wants to get the a6500, learn with that, then flip over to nikon and use the nikon d750 replacement for the grand canyon when half my backpack isn't taken up by the camping gear.  ", "sortedWord": "None", "identifyer": 39590, "year": "2018"}, {"Unnamed: 0": 244942, "autor": "allpress2", "date": 1537075907000, "content": "Viewfinder magnifier for A7Rii? /!/ Hello,\n\nI have been trying to find a magnifier eyepiece that actually magnifies what you see in the live view magnifier on the A7Rii. I use manual focus lenses, so it would be great to be able to see a larger image so I can ensure my exposure is spot-on!\n\n&amp;#x200B;\n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/9g89kg/viewfinder_magnifier_for_a7rii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "viewfinder magnifier for a7rii? /!/ hello,\n\ni have been trying to find a magnifier eyepiece that actually magnifies what you see in the live view magnifier on the a7rii. i use manual focus lenses, so it would be great to be able to see a larger image so i can ensure my exposure is -----> spot !!! -on!\n\n&amp;#x200b;\n\nthanks!", "sortedWord": "None", "identifyer": 40173, "year": "2018"}, {"Unnamed: 0": 245125, "autor": "brocahantas", "date": 1523557015000, "content": "Bracketing &amp; S-Log questions for you Sony folks /!/ Still getting the hang of the Sony system after switching to an A7III from Canon. Couple miscellaneous questions below.\n\n**1) UNCOMPRESSED BRACKETING**\n\nIs this a bug, or can I not shoot bracketed exposures in uncompressed raws? \n\nAll the bracket options are greyed out, but if I switch to compressed raw I can use them. I can't fathom why this wouldn't be possible while uncompressed, so I'm wondering if I'm doing something wrong.\n\n**2) S-Log**\n\nOkay I know this is a topic of its own that could go for days. I've been doing a ton of research but a few things are still unclear.\n\nMETERING\n\nGeneral consensus seems to be to overexpose by 1.5-2 stops, does it matter how you meter the shot though? Should I be spot metering for a certain part of the scene or just evaluative (whatever sony calls it) meter the whole shot and overexpose from there?\n\nWHAT'S ADJUSTABLE?\n\nAnd what do you change to adjust exposure? I'm seeing that you should lock in your iso at base iso (for s-log2 on the a7iii i'm guessing that's 800 since it's the lowest I can go, but I'm seeing conflicting info). \n\nAnd typically when shooting video I keep my shutter speed in line with the 180 degree rule, which leaves aperture and ND filters for adjusting exposure.\n\nThis makes me feel like shooting s-log in low-light would be difficult (since iso is locked in at 800). \n\nThoughts?", "link": "https://www.reddit.com/r/SonyAlpha/comments/8bscvx/bracketing_slog_questions_for_you_sony_folks/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bracketing &amp; s-log questions for you sony folks /!/ still getting the hang of the sony system after switching to an a7iii from canon. couple miscellaneous questions below.\n\n**1) uncompressed bracketing**\n\nis this a bug, or can i not shoot bracketed exposures in uncompressed raws? \n\nall the bracket options are greyed out, but if i switch to compressed raw i can use them. i can't fathom why this wouldn't be possible while uncompressed, so i'm wondering if i'm doing something wrong.\n\n**2) s-log**\n\nokay i know this is a topic of its own that could go for days. i've been doing a ton of research but a few things are still unclear.\n\nmetering\n\ngeneral consensus seems to be to overexpose by 1.5-2 stops, does it matter how you meter the shot though? should i be -----> spot !!!  metering for a certain part of the scene or just evaluative (whatever sony calls it) meter the whole shot and overexpose from there?\n\nwhat's adjustable?\n\nand what do you change to adjust exposure? i'm seeing that you should lock in your iso at base iso (for s-log2 on the a7iii i'm guessing that's 800 since it's the lowest i can go, but i'm seeing conflicting info). \n\nand typically when shooting video i keep my shutter speed in line with the 180 degree rule, which leaves aperture and nd filters for adjusting exposure.\n\nthis makes me feel like shooting s-log in low-light would be difficult (since iso is locked in at 800). \n\nthoughts?", "sortedWord": "None", "identifyer": 40358, "year": "2018"}, {"Unnamed: 0": 245600, "autor": "Cade64", "date": 1532753037000, "content": "Trouble tracking with Sony A7 III (continuous Auto Focus) /!/ Hey everyone, \n\nI picked up a Sony A7 III upgrading from my A7 recently and I've noticed one difference that I'm trying to figure out. On my A7 when I had C-AF on a green box would form around my subject and allow me to track them while they moved etc. I am having trouble getting this green box to appear on my a7 III. I have C-AF on and have my focus spot set to flexible medium and have had no dice yet. If anyone encountered this problem and has a fix please let me know!", "link": "https://www.reddit.com/r/SonyAlpha/comments/92jiyv/trouble_tracking_with_sony_a7_iii_continuous_auto/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "trouble tracking with sony a7 iii (continuous auto focus) /!/ hey everyone, \n\ni picked up a sony a7 iii upgrading from my a7 recently and i've noticed one difference that i'm trying to figure out. on my a7 when i had c-af on a green box would form around my subject and allow me to track them while they moved etc. i am having trouble getting this green box to appear on my a7 iii. i have c-af on and have my focus -----> spot !!!  set to flexible medium and have had no dice yet. if anyone encountered this problem and has a fix please let me know!", "sortedWord": "None", "identifyer": 40841, "year": "2018"}, {"Unnamed: 0": 245611, "autor": "shankskill", "date": 1544694573000, "content": "A7iii – touch screen with manual lens /!/ Finally bought the Voigtländer 40mm 1.2. It is a thing of beauty. I blame u/SonyKilledMyNikon, but that’s an aside...\n\nI favour MF Assist for focussing, and would like to know whether it’s possible to use the touch screen to specify which area of the image is zoomed when focus is adjusted. I often use Flexible Spot with the DMF mode, and don’t see why this shouldn’t be possible on a manual lens.\n\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/a5s4ur/a7iii_touch_screen_with_manual_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii – touch screen with manual lens /!/ finally bought the voigtländer 40mm 1.2. it is a thing of beauty. i blame u/sonykilledmynikon, but that’s an aside...\n\ni favour mf assist for focussing, and would like to know whether it’s possible to use the touch screen to specify which area of the image is zoomed when focus is adjusted. i often use flexible -----> spot !!!  with the dmf mode, and don’t see why this shouldn’t be possible on a manual lens.\n\n", "sortedWord": "None", "identifyer": 40852, "year": "2018"}, {"Unnamed: 0": 246489, "autor": "evverg", "date": 1528934326000, "content": "Camp Spot in the High Sierra. a7ii, 16-35 f4", "link": "https://www.reddit.com/r/SonyAlpha/comments/8qxary/camp_spot_in_the_high_sierra_a7ii_1635_f4/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "camp -----> spot !!!  in the high sierra. a7ii, 16-35 f4", "sortedWord": "None", "identifyer": 41753, "year": "2018"}, {"Unnamed: 0": 246572, "autor": "RKRagan", "date": 1543808752000, "content": "Standing on a slippery, moss-covered rock in the rain with my hat on my camera at my favorite spot. // Sony a5000, Samyang 12mm, 30 second exposures.", "link": "https://www.reddit.com/r/SonyAlpha/comments/a2kswq/standing_on_a_slippery_mosscovered_rock_in_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "standing on a slippery, moss-covered rock in the rain with my hat on my camera at my favorite -----> spot !!! . // sony a5000, samyang 12mm, 30 second exposures.", "sortedWord": "None", "identifyer": 41838, "year": "2018"}, {"Unnamed: 0": 246625, "autor": "Hexxys", "date": 1543708132000, "content": "A7III: Setting focus point when using external monitor? /!/ I'm using an external monitor with my A7III right now (not an external recorder, just a monitor).  When I plug in the HDMI cable, the screen on the camera goes blank.  This happens in both XAVC S formats (4K and HD).  When this happens, it apparently becomes impossible to \"tap to focus\" in center or flexible spot focusing area modes.\n\nIs there any way to make it so the camera screen doesn't turn off?  Or, at the very least, is there a way to keep tap-to-focus on?  Even if it requires an actual external recorder?", "link": "https://www.reddit.com/r/SonyAlpha/comments/a2886j/a7iii_setting_focus_point_when_using_external/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii: setting focus point when using external monitor? /!/ i'm using an external monitor with my a7iii right now (not an external recorder, just a monitor).  when i plug in the hdmi cable, the screen on the camera goes blank.  this happens in both xavc s formats (4k and hd).  when this happens, it apparently becomes impossible to \"tap to focus\" in center or flexible -----> spot !!!  focusing area modes.\n\nis there any way to make it so the camera screen doesn't turn off?  or, at the very least, is there a way to keep tap-to-focus on?  even if it requires an actual external recorder?", "sortedWord": "None", "identifyer": 41891, "year": "2018"}, {"Unnamed: 0": 247110, "autor": "SheerFartAttack", "date": 1544025657000, "content": "This spot?", "link": "https://www.reddit.com/r/SonyAlpha/comments/a3dkqy/this_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this -----> spot !!! ?", "sortedWord": "None", "identifyer": 42385, "year": "2018"}, {"Unnamed: 0": 247231, "autor": "Ekshtashish", "date": 1529586751000, "content": "Is there something wrong with my A7iii? /!/  I've had my A7iii for a couple weeks now, and I've been using it with my one lens, the Sony Zeiss Distagon 35mm f/1.4. Maybe worth noting this is my first Sony and my first full-frame. \n\nUp until two days ago nothing really stuck out to me as dysfunctional about the camera. Been getting great shots and everything. But something I noticed yesterday that didn't seem to be the case in the preceding weeks was that in Aperture Priority mode (set to f/1.4 always), in my warmly but not that brightly lit home office space at night, the shutter speed was very very stubbornly attached to 1/40. \n\nWith my medium spot metering centered and linked to my focus point, I aimed it at a totally dark, unlit area of my house, and it stayed at 1/40 and cranked the ISO until it was unrealistically brightened. The shutter speed only changed when I focused straight into the nearest light source. The next day I took the camera out in broad daylight, and once again it stayed at 1/40 and basically gave me a full screen zebra, adjusting nothing to balance the histo.\n\nLater I was hanging out in my friends' basement with many more and brighter lights around than my home office, and the shutter still stayed at 1/40 (unless aimed directly at a light source, again). In my maybe less attentive mind's eye, I did not notice this behavior at any time up until this point.\n\nDoes anyone know what could be wrong, or what settings I can fiddle with to troubleshoot this issue? I'm no stranger to Manual Mode but I rely on Aperture Priority in most cases. Thank you for your help.\n\nTL;DR Aperture Priority Mode stubbornly attached to 1/40 speed at f/1.4 in various lighting conditions, warm or cold or even natural daylight. Spot Metering M, Focus Point Link.", "link": "https://www.reddit.com/r/SonyAlpha/comments/8srqmv/is_there_something_wrong_with_my_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there something wrong with my a7iii? /!/  i've had my a7iii for a couple weeks now, and i've been using it with my one lens, the sony zeiss distagon 35mm f/1.4. maybe worth noting this is my first sony and my first full-frame. \n\nup until two days ago nothing really stuck out to me as dysfunctional about the camera. been getting great shots and everything. but something i noticed yesterday that didn't seem to be the case in the preceding weeks was that in aperture priority mode (set to f/1.4 always), in my warmly but not that brightly lit home office space at night, the shutter speed was very very stubbornly attached to 1/40. \n\nwith my medium -----> spot !!!  metering centered and linked to my focus point, i aimed it at a totally dark, unlit area of my house, and it stayed at 1/40 and cranked the iso until it was unrealistically brightened. the shutter speed only changed when i focused straight into the nearest light source. the next day i took the camera out in broad daylight, and once again it stayed at 1/40 and basically gave me a full screen zebra, adjusting nothing to balance the histo.\n\nlater i was hanging out in my friends' basement with many more and brighter lights around than my home office, and the shutter still stayed at 1/40 (unless aimed directly at a light source, again). in my maybe less attentive mind's eye, i did not notice this behavior at any time up until this point.\n\ndoes anyone know what could be wrong, or what settings i can fiddle with to troubleshoot this issue? i'm no stranger to manual mode but i rely on aperture priority in most cases. thank you for your help.\n\ntl;dr aperture priority mode stubbornly attached to 1/40 speed at f/1.4 in various lighting conditions, warm or cold or even natural daylight. spot metering m, focus point link.", "sortedWord": "None", "identifyer": 42514, "year": "2018"}, {"Unnamed: 0": 247717, "autor": "Hyunwoocam", "date": 1535193577000, "content": "Dino in a Rose a7iii;90mm macro f2.8;merge of 5 shots at 2.8 /!/ &amp;#x200B;\n\n[This is a cufflink I have I stuck in the middle of a rose. Shot with a Sony 90mm Macro, at f2.8. Stack of 5 shots and some cleanup in photoshop. There were a lot of random light specks in the original merge which I used photoshop to remove spots. Also had a pretty intense glare issue on the top corners which I attempted to fix up using a combo of cloning and spot healing. It's not clean, would love some feedback on how best to go about doing things like that in photoshop. Any other comments on general style etc. are also welcome.](https://i.redd.it/3dmgvvxxw7i11.jpg)", "link": "https://www.reddit.com/r/SonyAlpha/comments/9a5wl0/dino_in_a_rose_a7iii90mm_macro_f28merge_of_5/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dino in a rose a7iii;90mm macro f2.8;merge of 5 shots at 2.8 /!/ &amp;#x200b;\n\n[this is a cufflink i have i stuck in the middle of a rose. shot with a sony 90mm macro, at f2.8. stack of 5 shots and some cleanup in photoshop. there were a lot of random light specks in the original merge which i used photoshop to remove -----> spots !!! . also had a pretty intense glare issue on the top corners which i attempted to fix up using a combo of cloning and spot healing. it's not clean, would love some feedback on how best to go about doing things like that in photoshop. any other comments on general style etc. are also welcome.](https://i.redd.it/3dmgvvxxw7i11.jpg)", "sortedWord": "None", "identifyer": 43010, "year": "2018"}, {"Unnamed: 0": 247775, "autor": "itsarealme", "date": 1541331692000, "content": "I think I was spotted...", "link": "https://www.reddit.com/r/SonyAlpha/comments/9u2pzn/i_think_i_was_spotted/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i think i was -----> spotted !!! ...", "sortedWord": "None", "identifyer": 43070, "year": "2018"}, {"Unnamed: 0": 247776, "autor": "itsarealme", "date": 1541331614000, "content": "I think so she spotted me...", "link": "https://www.reddit.com/r/SonyAlpha/comments/9u2ps3/i_think_so_she_spotted_me/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i think so she -----> spotted !!!  me...", "sortedWord": "None", "identifyer": 43071, "year": "2018"}, {"Unnamed: 0": 247941, "autor": "Edamski88", "date": 1545146562000, "content": "A7 improper focusing. /!/ Hey guys, got myself an A7 last night and I've found it quite frustrating so far. The auto focus doesn't focus, I'll watch it cycling through finding focus, see it find focus and then move off it to something close to being in focus. \n\nI've tried single, continuous, framed, wide, centre, spot (all three), manual, auto, A, P, S. All seem to suffer from the same issues. Had a search online and seen a few things but nothing definitive.\n\nIt's really off putting when I've only just got it, does anyone have any recommendations for things to try? \n\nFirmware is 3.20\n\nCheers", "link": "https://www.reddit.com/r/SonyAlpha/comments/a7byup/a7_improper_focusing/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7 improper focusing. /!/ hey guys, got myself an a7 last night and i've found it quite frustrating so far. the auto focus doesn't focus, i'll watch it cycling through finding focus, see it find focus and then move off it to something close to being in focus. \n\ni've tried single, continuous, framed, wide, centre, -----> spot !!!  (all three), manual, auto, a, p, s. all seem to suffer from the same issues. had a search online and seen a few things but nothing definitive.\n\nit's really off putting when i've only just got it, does anyone have any recommendations for things to try? \n\nfirmware is 3.20\n\ncheers", "sortedWord": "None", "identifyer": 43240, "year": "2018"}, {"Unnamed: 0": 248036, "autor": "docshay", "date": 1524200442000, "content": "Weird bug / artifact shows up in the same spot for pictures but not previews - probably dust in the sensor? /!/ Hi all,\n\nNot sure if this is the right place for this, but I was really looking for some help! \n\nWithin the last 2 days, some of my A6300 pictures have been showing a bug that pops up after the image is taken, but not during the preview on the EVF or LCD screen. \n\n[example 1, 10-18](https://imgur.com/a/YxkXOXc)\n\n[example 2, nikon 55-300](https://imgur.com/a/U4CsP7q)\n\n[example 3, nikon 55-300](https://imgur.com/a/WYSGszC)\n\nAt first I thought it was only for some pictures, but not others, but looking back at it seems like its faintly or blatantly at the same spot on every picture. \n\nI am surprised why the preview is not catching this, and I believe I have used different lenses.\n\nJust wanted to confirm that I should try to air out sensor with one of those bubble things? \n\nAny help is appreciated! I am pretty new to this stuff. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/8dl3kx/weird_bug_artifact_shows_up_in_the_same_spot_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird bug / artifact shows up in the same -----> spot !!!  for pictures but not previews - probably dust in the sensor? /!/ hi all,\n\nnot sure if this is the right place for this, but i was really looking for some help! \n\nwithin the last 2 days, some of my a6300 pictures have been showing a bug that pops up after the image is taken, but not during the preview on the evf or lcd screen. \n\n[example 1, 10-18](https://imgur.com/a/yxkxoxc)\n\n[example 2, nikon 55-300](https://imgur.com/a/u4csp7q)\n\n[example 3, nikon 55-300](https://imgur.com/a/wysgszc)\n\nat first i thought it was only for some pictures, but not others, but looking back at it seems like its faintly or blatantly at the same spot on every picture. \n\ni am surprised why the preview is not catching this, and i believe i have used different lenses.\n\njust wanted to confirm that i should try to air out sensor with one of those bubble things? \n\nany help is appreciated! i am pretty new to this stuff. ", "sortedWord": "None", "identifyer": 43335, "year": "2018"}], "name": "spotSonyAlpha2018"}