{"interestingcomments": [{"Unnamed: 0": 1585, "autor": "Dann-Oh", "date": 1555602087000, "content": "Sun Spot on 4-17-19", "link": "https://www.reddit.com/r/SonyAlpha/comments/ben1ew/sun_spot_on_41719/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sun -----> spot !!!  on 4-17-19", "sortedWord": "None", "identifyer": 1596, "year": "2019"}, {"Unnamed: 0": 1613, "autor": "eels_no1", "date": 1549415431000, "content": "My car's hiding spot - a6000 / 35mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/anl6ab/my_cars_hiding_spot_a6000_35mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my car's hiding -----> spot !!!  - a6000 / 35mm 1.8", "sortedWord": "None", "identifyer": 1624, "year": "2019"}, {"Unnamed: 0": 1624, "autor": "pwnjob", "date": 1549401175000, "content": "Cleaned with a sensor cleaning kit multiple times but dark spot still there, anything else I can do to fix it?", "link": "https://www.reddit.com/r/SonyAlpha/comments/aniry1/cleaned_with_a_sensor_cleaning_kit_multiple_times/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "cleaned with a sensor cleaning kit multiple times but dark -----> spot !!!  still there, anything else i can do to fix it?", "sortedWord": "None", "identifyer": 1635, "year": "2019"}, {"Unnamed: 0": 2243, "autor": "dressedlikerappers", "date": 1568196239000, "content": "Can a camera sensor ever be perfectly clean? /!/ I seem to notice this a lot more on my Sony camera than I even did with my Fuji or Nikon (probably because the evf makes it easier to spot) - but I got my sensor cleaned professionally for the first time before I go on holiday and it seems all good - however I’ve done a few shots and there’s still some super tiny dust spots (2 or 3 on the edges) at f22 at a blue sky but I don’t know if that means that they’ve done an average job or I’m just being pedantic - should I expect it to be spotless or is there always gonna be some sensor dust.\n\nnothing seems viable at f14", "link": "https://www.reddit.com/r/SonyAlpha/comments/d2nqhd/can_a_camera_sensor_ever_be_perfectly_clean/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can a camera sensor ever be perfectly clean? /!/ i seem to notice this a lot more on my sony camera than i even did with my fuji or nikon (probably because the evf makes it easier to -----> spot !!! ) - but i got my sensor cleaned professionally for the first time before i go on holiday and it seems all good - however i’ve done a few shots and there’s still some super tiny dust spots (2 or 3 on the edges) at f22 at a blue sky but i don’t know if that means that they’ve done an average job or i’m just being pedantic - should i expect it to be spotless or is there always gonna be some sensor dust.\n\nnothing seems viable at f14", "sortedWord": "None", "identifyer": 2261, "year": "2019"}, {"Unnamed: 0": 2774, "autor": "ovidiuxa2", "date": 1552419833000, "content": "Heaven spotted | sony a6000", "link": "https://www.reddit.com/r/SonyAlpha/comments/b0c43i/heaven_spotted_sony_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "heaven -----> spotted !!!  | sony a6000", "sortedWord": "None", "identifyer": 2797, "year": "2019"}, {"Unnamed: 0": 2920, "autor": "Hol2k", "date": 1563465796000, "content": "A6300 Kit lens – Sweet Spot /!/ Hi! I am very new to photograpy and have bought A6300 with the kit lens. I keep reading that each and every lens has its own sweet spot, and I’m having trouble finding it. Does anyone know the settings? Thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ceudu3/a6300_kit_lens_sweet_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6300 kit lens – sweet -----> spot !!!  /!/ hi! i am very new to photograpy and have bought a6300 with the kit lens. i keep reading that each and every lens has its own sweet spot, and i’m having trouble finding it. does anyone know the settings? thanks!", "sortedWord": "None", "identifyer": 2944, "year": "2019"}, {"Unnamed: 0": 3654, "autor": "PowerFerrie", "date": 1554629618000, "content": "I wonder how long he's been coming to that fishing spot? (a6500 - 35mm f1.8)", "link": "https://www.reddit.com/r/SonyAlpha/comments/baemrv/i_wonder_how_long_hes_been_coming_to_that_fishing/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i wonder how long he's been coming to that fishing -----> spot !!! ? (a6500 - 35mm f1.8)", "sortedWord": "None", "identifyer": 3690, "year": "2019"}, {"Unnamed: 0": 3676, "autor": "Sirioberati", "date": 1555423461000, "content": "Inspired by Game of Thrones. Shot on a7iii. Can you spot the dragon?", "link": "https://www.reddit.com/r/SonyAlpha/comments/bdubqi/inspired_by_game_of_thrones_shot_on_a7iii_can_you/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "inspired by game of thrones. shot on a7iii. can you -----> spot !!!  the dragon?", "sortedWord": "None", "identifyer": 3712, "year": "2019"}, {"Unnamed: 0": 4166, "autor": "TheMountainBeast", "date": 1546818017000, "content": "Are red spots in pictures normal when photographing in the direction of the sun? (Example Attached) /!/ I am a beginner at photographer so forgive me if this is a dumb question but I noticed some issues with some pictures I took recently showing red spots and other defects when taking pictures in the direction of the sun. I have attached a picture to show what I mean. Shot with a Sony a6500 and Rokinon 12mm lens. Mainly just making sure its explainable and not an issue with either my sensor or lens (Both purchased recently). Thanks in advance!\n\n*Processing img slkm0uxx1w821...*", "link": "https://www.reddit.com/r/SonyAlpha/comments/adbf1g/are_red_spots_in_pictures_normal_when/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are red -----> spots !!!  in pictures normal when photographing in the direction of the sun? (example attached) /!/ i am a beginner at photographer so forgive me if this is a dumb question but i noticed some issues with some pictures i took recently showing red spots and other defects when taking pictures in the direction of the sun. i have attached a picture to show what i mean. shot with a sony a6500 and rokinon 12mm lens. mainly just making sure its explainable and not an issue with either my sensor or lens (both purchased recently). thanks in advance!\n\n*processing img slkm0uxx1w821...*", "sortedWord": "None", "identifyer": 4209, "year": "2019"}, {"Unnamed: 0": 4245, "autor": "maverickmonday", "date": 1566480602000, "content": "Animal Eye AF /!/ I’ve recently switched to my a7iii from Canon and trying to wrap my head around the Sony menu settings. I photograph dogs so I want to have animal eye switched on...however it doesn’t always work, especially in low light or with black dogs. The issue is that when Animal Eye AF is switched on, locked flexible spot is greyed out? The option is disabled so I can’t select this - meaning I don’t have a way to lock a focus point that will track across a screen. Am I missing something or does this seems incredibly backwards? Wide or zone focus modes aren’t specific enough to set the focal point where I and I don’t know what else to do?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ctxgw8/animal_eye_af/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "animal eye af /!/ i’ve recently switched to my a7iii from canon and trying to wrap my head around the sony menu settings. i photograph dogs so i want to have animal eye switched on...however it doesn’t always work, especially in low light or with black dogs. the issue is that when animal eye af is switched on, locked flexible -----> spot !!!  is greyed out? the option is disabled so i can’t select this - meaning i don’t have a way to lock a focus point that will track across a screen. am i missing something or does this seems incredibly backwards? wide or zone focus modes aren’t specific enough to set the focal point where i and i don’t know what else to do?", "sortedWord": "None", "identifyer": 4289, "year": "2019"}, {"Unnamed: 0": 4270, "autor": "mixtick", "date": 1576029674000, "content": "Tokyo Hidden Spots. Aony A7III - 55mm 1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/e90iiq/tokyo_hidden_spots_aony_a7iii_55mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "tokyo hidden -----> spots !!! . aony a7iii - 55mm 1.8", "sortedWord": "None", "identifyer": 4314, "year": "2019"}, {"Unnamed: 0": 5174, "autor": "silsurf", "date": 1548430507000, "content": "Troubleshooting AF? /!/ I recently purchased a refurb A7lll on Amazon. I was unable to get continuous auto focus with a flexible spot to track. I was trying on Canon 16-36 Mk II and Canon 24-70 Mk II and a Samyang 35 E-Mount. The the Canons using a metabones Mk V adapter. On the Canons the AF would constantly search and chatter, quite a large spread, out to infinty (and beyond) and back, never locking on at all. On the Samyang it would not even search, the flexible box would come up, but the focus did not even attempt to search or lock.\n\nThe camera came at firmware 1.10. I upgraded it to the latest (2.10), but it made no difference. Everything else appears to be functioning correctly.\n\n&amp;#x200B;\n\nI am replacing the body thru Amazon, but in preparation would love some help on how to best diagnose where the issue lies if it persists with a new body. Thanks very much for you help\n\n&amp;#x200B;\n\nHenry", "link": "https://www.reddit.com/r/SonyAlpha/comments/ajq626/troubleshooting_af/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "troubleshooting af? /!/ i recently purchased a refurb a7lll on amazon. i was unable to get continuous auto focus with a flexible -----> spot !!!  to track. i was trying on canon 16-36 mk ii and canon 24-70 mk ii and a samyang 35 e-mount. the the canons using a metabones mk v adapter. on the canons the af would constantly search and chatter, quite a large spread, out to infinty (and beyond) and back, never locking on at all. on the samyang it would not even search, the flexible box would come up, but the focus did not even attempt to search or lock.\n\nthe camera came at firmware 1.10. i upgraded it to the latest (2.10), but it made no difference. everything else appears to be functioning correctly.\n\n&amp;#x200b;\n\ni am replacing the body thru amazon, but in preparation would love some help on how to best diagnose where the issue lies if it persists with a new body. thanks very much for you help\n\n&amp;#x200b;\n\nhenry", "sortedWord": "None", "identifyer": 5230, "year": "2019"}, {"Unnamed: 0": 5205, "autor": "Shpixx", "date": 1548366554000, "content": "A stranger's Outback I spotted while driving home from the mountains [Sony A7iii, 16-35 F4]", "link": "https://www.reddit.com/r/SonyAlpha/comments/ajhp5q/a_strangers_outback_i_spotted_while_driving_home/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "a stranger's outback i -----> spotted !!!  while driving home from the mountains [sony a7iii, 16-35 f4]", "sortedWord": "None", "identifyer": 5261, "year": "2019"}, {"Unnamed: 0": 5301, "autor": "EmpGuard_Sun", "date": 1564149118000, "content": "a7III - Unable to display after offloading and deleting images /!/ So I recently picked up the a7III and I'm loving it. However, I am running into the issue where after if I offload my images onto my computer and delete them from the card, the deleted images still have a spot on the camera's playback but say 'Unable to display'. And since I am only able to delete 100 images at once through the menu settings, I cannot simply select photos from a specific date and delete all of them from that date. Individually selecting and deleting these phantom images is very tedious and I was hoping someone might know of a solution.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ci34ih/a7iii_unable_to_display_after_offloading_and/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii - unable to display after offloading and deleting images /!/ so i recently picked up the a7iii and i'm loving it. however, i am running into the issue where after if i offload my images onto my computer and delete them from the card, the deleted images still have a -----> spot !!!  on the camera's playback but say 'unable to display'. and since i am only able to delete 100 images at once through the menu settings, i cannot simply select photos from a specific date and delete all of them from that date. individually selecting and deleting these phantom images is very tedious and i was hoping someone might know of a solution.", "sortedWord": "None", "identifyer": 5358, "year": "2019"}, {"Unnamed: 0": 5747, "autor": "dokkababecallme", "date": 1576591597000, "content": "A7III + Sony 50 1.8 // Squirrel Has Been Spotted", "link": "https://www.reddit.com/r/SonyAlpha/comments/ebw7ny/a7iii_sony_50_18_squirrel_has_been_spotted/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "a7iii + sony 50 1.8 // squirrel has been -----> spotted !!! ", "sortedWord": "None", "identifyer": 5809, "year": "2019"}, {"Unnamed: 0": 5878, "autor": "Roboimu22", "date": 1572638574000, "content": "Albufera in Valencia (Spain) is the spot to be to enjoy sunsets - Sony Alpha 6000 (55-210mm)", "link": "https://www.reddit.com/r/SonyAlpha/comments/dq9j1n/albufera_in_valencia_spain_is_the_spot_to_be_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "albufera in valencia (spain) is the -----> spot !!!  to be to enjoy sunsets - sony alpha 6000 (55-210mm)", "sortedWord": "None", "identifyer": 5942, "year": "2019"}, {"Unnamed: 0": 6189, "autor": "KosKos13", "date": 1550821189000, "content": "Question on what options you all think would be best? /!/ Hey everyone,\nI am looking into a Sony camera for filmmaking/shooting videos in general. \n\nThe main thing is that I want to be able to shoot great videos in all kinds of lighting, though I’m not extremely worried because I do have a light kit for on the go. The one thing that has caught my attention (I know this is lame) is the auto focus features in filming. I am kind of looking for something that will auto focus while not having to pull focus myself as sometimes I need to just set up the camera and go and I don’t always have a person there to film for me. \n\nWith that said, i know a lot of people recommend the a7iii, and I was looking more at the a7ii... I also don’t have a budget at this moment for $2.4k-3k camera.\n\nSo the question is should I stick with my choice so far of the a7ii or is there another option some of you recommend? \n\nThanks and sorry if I’m posting this in the wrong spot.", "link": "https://www.reddit.com/r/SonyAlpha/comments/atepr5/question_on_what_options_you_all_think_would_be/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question on what options you all think would be best? /!/ hey everyone,\ni am looking into a sony camera for filmmaking/shooting videos in general. \n\nthe main thing is that i want to be able to shoot great videos in all kinds of lighting, though i’m not extremely worried because i do have a light kit for on the go. the one thing that has caught my attention (i know this is lame) is the auto focus features in filming. i am kind of looking for something that will auto focus while not having to pull focus myself as sometimes i need to just set up the camera and go and i don’t always have a person there to film for me. \n\nwith that said, i know a lot of people recommend the a7iii, and i was looking more at the a7ii... i also don’t have a budget at this moment for $2.4k-3k camera.\n\nso the question is should i stick with my choice so far of the a7ii or is there another option some of you recommend? \n\nthanks and sorry if i’m posting this in the wrong -----> spot !!! .", "sortedWord": "None", "identifyer": 6255, "year": "2019"}, {"Unnamed: 0": 6365, "autor": "scorpuz", "date": 1555239833000, "content": "A peaceful spot with a city view (a6500, sigma 30mm f1.4)", "link": "https://www.reddit.com/r/SonyAlpha/comments/bd1oi8/a_peaceful_spot_with_a_city_view_a6500_sigma_30mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a peaceful -----> spot !!!  with a city view (a6500, sigma 30mm f1.4)", "sortedWord": "None", "identifyer": 6433, "year": "2019"}, {"Unnamed: 0": 6717, "autor": "ELI7E", "date": 1561540390000, "content": "Parliament Plane Spotting [a6500, yus 135mm f2.8]", "link": "https://www.reddit.com/r/SonyAlpha/comments/c5nlfy/parliament_plane_spotting_a6500_yus_135mm_f28/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "parliament plane -----> spotting !!!  [a6500, yus 135mm f2.8]", "sortedWord": "None", "identifyer": 6791, "year": "2019"}, {"Unnamed: 0": 6768, "autor": "Bastage1", "date": 1560957959000, "content": "Good spot to catch some sun | Sony A7 III 24-105 G", "link": "https://www.reddit.com/r/SonyAlpha/comments/c2ifsi/good_spot_to_catch_some_sun_sony_a7_iii_24105_g/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good -----> spot !!!  to catch some sun | sony a7 iii 24-105 g", "sortedWord": "None", "identifyer": 6842, "year": "2019"}, {"Unnamed: 0": 6878, "autor": "labuddha", "date": 1560141933000, "content": "Help with shooting movie car shots on A7rii /!/ Hi, I’m looking to shoot someone driving from the passengers seat. Wondering any help with getting correct exposure as it meters and exposes for the bright light of outside the window which makes the subject underexposed. \n\nIdeally, I could move the spot meter to where the subjects face is but I don’t seem to be able to do so. \n\nAny tips on how best to do this would be great! \n\nThanks", "link": "https://www.reddit.com/r/SonyAlpha/comments/bytlsa/help_with_shooting_movie_car_shots_on_a7rii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help with shooting movie car shots on a7rii /!/ hi, i’m looking to shoot someone driving from the passengers seat. wondering any help with getting correct exposure as it meters and exposes for the bright light of outside the window which makes the subject underexposed. \n\nideally, i could move the -----> spot !!!  meter to where the subjects face is but i don’t seem to be able to do so. \n\nany tips on how best to do this would be great! \n\nthanks", "sortedWord": "None", "identifyer": 6955, "year": "2019"}, {"Unnamed: 0": 7056, "autor": "therealpretzel", "date": 1553035115000, "content": "Secret Spot, CA - A7III + Nikon 28mm 1.8 Manual Focus Lens", "link": "https://www.reddit.com/r/SonyAlpha/comments/b34068/secret_spot_ca_a7iii_nikon_28mm_18_manual_focus/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "secret -----> spot !!! , ca - a7iii + nikon 28mm 1.8 manual focus lens", "sortedWord": "None", "identifyer": 7136, "year": "2019"}, {"Unnamed: 0": 7164, "autor": "potnia_theron", "date": 1552340530000, "content": "Anyone know what the sweet spot is on the Tamron 28-75? /!/ I was surprised Google didn't have the answer.  Has anyone tested this out?", "link": "https://www.reddit.com/r/SonyAlpha/comments/azz87g/anyone_know_what_the_sweet_spot_is_on_the_tamron/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone know what the sweet -----> spot !!!  is on the tamron 28-75? /!/ i was surprised google didn't have the answer.  has anyone tested this out?", "sortedWord": "None", "identifyer": 7245, "year": "2019"}, {"Unnamed: 0": 7332, "autor": "04andrew22", "date": 1554999155000, "content": "Having trouble figuring out a fair price -- original a7 with 75k shutter count /!/ Apologies if this isn't the right place to ask, but I know they do not allow these on /r/photomarket \n\nThe camera is several years old and has definitely seen better days cosmetically (beat up with classic a7 spots/wear on screen and viewfinder), but is in great working condition. \n\nConsidering its relatively high shutter count, what would you deem a fair price? Any guidance would be much appreciated - thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/bc1q9y/having_trouble_figuring_out_a_fair_price_original/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "having trouble figuring out a fair price -- original a7 with 75k shutter count /!/ apologies if this isn't the right place to ask, but i know they do not allow these on /r/photomarket \n\nthe camera is several years old and has definitely seen better days cosmetically (beat up with classic a7 -----> spots !!! /wear on screen and viewfinder), but is in great working condition. \n\nconsidering its relatively high shutter count, what would you deem a fair price? any guidance would be much appreciated - thanks!", "sortedWord": "None", "identifyer": 7418, "year": "2019"}, {"Unnamed: 0": 7776, "autor": "squarezz", "date": 1546742163000, "content": "A7III | Sony 16- 35mm 2.8 | Horseshoe Bend by moonlight 25 sec exposure the bright spot is the moon, What do you think?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ad1dkr/a7iii_sony_16_35mm_28_horseshoe_bend_by_moonlight/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7iii | sony 16- 35mm 2.8 | horseshoe bend by moonlight 25 sec exposure the bright -----> spot !!!  is the moon, what do you think?", "sortedWord": "None", "identifyer": 7872, "year": "2019"}, {"Unnamed: 0": 8571, "autor": "r217m", "date": 1575108879000, "content": "sony a7 focusing area /!/ just got my first ever sony(and full frame) camera, I am used to canon dslr spot af, looking at focusing area options it looks like center af is most like that one, but default is wide and youtube videos say wide is better, which one do I use? I am not doing any photography that requires tracking of people/animals just landscapes/street etc.", "link": "https://www.reddit.com/r/SonyAlpha/comments/e3u8mo/sony_a7_focusing_area/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a7 focusing area /!/ just got my first ever sony(and full frame) camera, i am used to canon dslr -----> spot !!!  af, looking at focusing area options it looks like center af is most like that one, but default is wide and youtube videos say wide is better, which one do i use? i am not doing any photography that requires tracking of people/animals just landscapes/street etc.", "sortedWord": "None", "identifyer": 8686, "year": "2019"}, {"Unnamed: 0": 9498, "autor": "NeillDrake", "date": 1553350513000, "content": "Breaking the rules. I chose to ignore the Rule of Thirds here, because I wanted to give the feeling of \"Loneliness\" or \"Isolation\". To freeze this penguin in his spot, where he stood for 3 hours. A7Riii 70-200 G 4", "link": "https://www.reddit.com/r/SonyAlpha/comments/b4jm3d/breaking_the_rules_i_chose_to_ignore_the_rule_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "breaking the rules. i chose to ignore the rule of thirds here, because i wanted to give the feeling of \"loneliness\" or \"isolation\". to freeze this penguin in his -----> spot !!! , where he stood for 3 hours. a7riii 70-200 g 4", "sortedWord": "None", "identifyer": 9628, "year": "2019"}, {"Unnamed: 0": 9679, "autor": "kont1221", "date": 1563759841000, "content": "My lovely dog Nova in her favorite spot. a6000, Rokinon 12mm/f2.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cg70gs/my_lovely_dog_nova_in_her_favorite_spot_a6000/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my lovely dog nova in her favorite -----> spot !!! . a6000, rokinon 12mm/f2.", "sortedWord": "None", "identifyer": 9811, "year": "2019"}, {"Unnamed: 0": 9851, "autor": "FatherStorm", "date": 1563160324000, "content": "Sony A7RII with a APS-C 17-50mm Tamron lens. exposure-stacked. left all the dirty/spots that were on the lens. you can literally see the inside of the lens.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cdc6ar/sony_a7rii_with_a_apsc_1750mm_tamron_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sony a7rii with a aps-c 17-50mm tamron lens. exposure-stacked. left all the dirty/-----> spots !!!  that were on the lens. you can literally see the inside of the lens.", "sortedWord": "None", "identifyer": 9985, "year": "2019"}, {"Unnamed: 0": 9856, "autor": "Darkshelby", "date": 1563151655000, "content": "Can you spot the bad photoshop lol first time messing with PS sony a7iii 24-105", "link": "https://www.reddit.com/r/SonyAlpha/comments/cdap94/can_you_spot_the_bad_photoshop_lol_first_time/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you -----> spot !!!  the bad photoshop lol first time messing with ps sony a7iii 24-105", "sortedWord": "None", "identifyer": 9990, "year": "2019"}, {"Unnamed: 0": 9994, "autor": "DevinOlsen", "date": 1548218404000, "content": "So I think I ruined the glass on my 24-70 GMaster lens... What are my options? /!/ First here are some pictures.\nhttps://imgur.com/a/Qm4M2yG\n\nSo I was filming my friend landing his helicopter, and the rotor wash blew sand towards my camera/lens - Since then I am left with a bunch of marks/cuts on the front piece of glass that will not come off.  \n\nIs there anything I can do? Can I replace the glass or send it in for repair?  I can still take photo's with it, but anything above f2.8 and I really start to see the spots in the photo's from the small marks.\n\nAny help would be appreciated!", "link": "https://www.reddit.com/r/SonyAlpha/comments/aivzvf/so_i_think_i_ruined_the_glass_on_my_2470_gmaster/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "so i think i ruined the glass on my 24-70 gmaster lens... what are my options? /!/ first here are some pictures.\nhttps://imgur.com/a/qm4m2yg\n\nso i was filming my friend landing his helicopter, and the rotor wash blew sand towards my camera/lens - since then i am left with a bunch of marks/cuts on the front piece of glass that will not come off.  \n\nis there anything i can do? can i replace the glass or send it in for repair?  i can still take photo's with it, but anything above f2.8 and i really start to see the -----> spots !!!  in the photo's from the small marks.\n\nany help would be appreciated!", "sortedWord": "None", "identifyer": 10129, "year": "2019"}, {"Unnamed: 0": 10130, "autor": "kimahri27", "date": 1573825606000, "content": "Sony A6100. Wasted my time trusting stupid people online. /!/ I shoot in low light. I had an A6000 prior. Wanted something pocketable. Got a Canon G7X III. Was miffed at the slow contrast focus. Upgraded the a6000 to the a6100 because EVERYONE and their mother online, including this worthless subreddit, said it was identical to the A6400 except for S.Log, 4k recording time, and EVF, none of which I use or care about. You wonder why there are no in-depth A6100 reviews anywhere? Because all the idiots just keep on making the same assumption it's an a6400 with some higher end features removed. It's not.\n\nReasons I returned this POS.\n\n1. Half the settings are gone in the menu. Including the most basic thing of all in 2019, a minimum shutter for auto ISO. This is a $750 camera. It's not a $200 point and shoot.\n2. Screen is taken from a Nintendo DS from 15 years ago. It's the same one from the A6000. Absolute shame on a $750 device. It's even smaller than other 3\" screens since it's 16:9 so its squat. I'd imagine the sRGB coverage is 40% or some low ass number and the contrast is 1:200.\n3. The white balance sucks ass in artificial lighting. All my images turned out green under this outdoor lamp that was not green. Not just a green tint. The whole image was green. Went to another light. Now it's ORANGE. Maybe I would have known the white balance was this bad if the screen wasn't washed out junk. Both my phone and the canon g7x were doing significantly better.\n4. I was fine with the kit lens on the A6000 until I wanted something that was sharper. The only fast prime with OSS is the 35mm f/1.8. It's equivalent to a 52mm. Actually even more narrow since I compared the 52mm on my canon and my phone's 2x zoom which is 52mm and they were both wider. Every idiot on the web brags about how great this lens is for street photography or walking around. What a joke. There's a serious medical condition called retinities pigmentosa where your vision gradually narrows until you can't see anything wider than a straw. This is late stage retinitis pigmentosa. I point it across the street and all I can see is the front door of a building. If you want a zoomed in portrait of someone's face and nothing else, sure. It's a joke for everything else. Dear god was it awful for video. The OSS is a complete joke. Even at 1/30 it was blurring. I had to set it to 1/60, which meant my ISO shot up to 12800. What's the point of such a large sensor if the glass and the stabilization for that glass is shit? Pay twice as much for an A6600 for maybe one extra stop of difference? Because the a6600 IBIS is awful as well. Pocket cameras like the canon g5x ii and g7x iii as well as any modern phone with optical stabilization are leagues ahead with fast glass and stabilization. My phone automatically shoots 1/10 for almost all my low light shots. The canon I've set to 1/15 without issue. It also has a real minimum shutter setting, so I don't have to worry when it gets brighter. Did I also mention they all focus way closer than ONE FOOT away?\n5. Crap low light focus. The focus is amazing they say. It can track animal and human eyes they say. It's the best and most advanced focusing system on any camera they say. On a still subject (a cat) from three feet away it can't focus for shit. It wasn't pitch black. I could see the cat well and good. There was a light directly above. Blur after blur after blur. Multiple attempts and multiple autofocus fails. My phone had zero issue in the same spot. My canon would hunt and flutter for a second or two but it would eventually find it. The hybrid and phase detect most advanced focusing system on the planet can't even compete against basic contrast focus used on most budget point and shoot cameras. Ditto even a cheap cellphone.\n6. Loud as f\\*ck shutter. I know most of you are old and deaf but even being deaf, you can at least feel the loud shutter through the strong vibrations. I thought they would have improved it over the A6000. Nope. Every living thing from a one block radius will run when it hears that death contraption. Here is a list of APSC cameras with far quieter shutters I've used: Canon M100, Fuji X-A5, Fuji XF10, Canon M6, Ricoh GR3. Most of these are cheaper than the Sony. You can't use price as an excuse. They are also smaller so you can't use size either. My canon G7x just flutters like a small bird. That's it. Turn on electronic shutter? Why not just use a cellphone in other words.\n7. Sony's still asinine playback options. Not that I want to use the subpar screen for literally anything beyond framing, but even trying to weed out bad images from the camera itself is a chore with zero touch functionality and not even a zoom lever. Speaking of zoom lever...\n8. Instead of a zoom lever they have a worthless on/off switch that's near impossible to figure out which way is which and never flips properly or decisively, is hard to push and has no feedback. I've had multiple occasions where the a6000 would get stuck and never turn off even though the switch was set to OFF. I'd imagine the A6100 is going to go through the same crap since it uses the exact same switch. Five years worth of progress. Beautiful. And the worst placed dials on any camera. Let's put the mode dial and custom dial right next to each other and have them be the same size and feel instead of staggering them and changing the size or texture like every other camera out there. They also downgraded the I/O flap. It's a thin piece of plastic that slides into place instead of a thick well hinged door.\n9. I liked the grip on the A6000. The A6100 feels like it's fat cancerous brother. Not just the grip, but the whole body in general. You would have to be blind to mistake the two side by side. The main body is significantly thicker and fatter and clumsier. They increased the bulk of the grip but didn't spread it far enough away from the lens and it barely juts out from the thicker body. The a6000 actually jutted out more and had more space where you put your fingers. It feels constrained and unpleasant. What did you gain from the 50g of extra weight, a whopping 10mm or more extra thickness in the main body, and a shittier grip? A screen that can do selfies and 4k with no guarantee of record length. Sure as hell didn't gain anything else.\n\nDpreview said this camera was a great family camera. I can't imagine any normal consumer would actually use this over a cellphone or pocket camera zoom like the g7x. And with the latest report from CIPA showing \\~25% decline in camera sales from last year, which is considered \"less\" than previous declines, I am hoping this whole worthless APSC segment will finally die. It's not small enough or better quality enough to warrant considering for a normal person. And considering how Sony is just recycling the same shit but making it worse, they obviously don't care about their APSC line and neither should anyone else. The camera market outside of professional full frame users is basically dead since Sony and others keep on releasing these shit products.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dwqzwg/sony_a6100_wasted_my_time_trusting_stupid_people/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sony a6100. wasted my time trusting stupid people online. /!/ i shoot in low light. i had an a6000 prior. wanted something pocketable. got a canon g7x iii. was miffed at the slow contrast focus. upgraded the a6000 to the a6100 because everyone and their mother online, including this worthless subreddit, said it was identical to the a6400 except for s.log, 4k recording time, and evf, none of which i use or care about. you wonder why there are no in-depth a6100 reviews anywhere? because all the idiots just keep on making the same assumption it's an a6400 with some higher end features removed. it's not.\n\nreasons i returned this pos.\n\n1. half the settings are gone in the menu. including the most basic thing of all in 2019, a minimum shutter for auto iso. this is a $750 camera. it's not a $200 point and shoot.\n2. screen is taken from a nintendo ds from 15 years ago. it's the same one from the a6000. absolute shame on a $750 device. it's even smaller than other 3\" screens since it's 16:9 so its squat. i'd imagine the srgb coverage is 40% or some low ass number and the contrast is 1:200.\n3. the white balance sucks ass in artificial lighting. all my images turned out green under this outdoor lamp that was not green. not just a green tint. the whole image was green. went to another light. now it's orange. maybe i would have known the white balance was this bad if the screen wasn't washed out junk. both my phone and the canon g7x were doing significantly better.\n4. i was fine with the kit lens on the a6000 until i wanted something that was sharper. the only fast prime with oss is the 35mm f/1.8. it's equivalent to a 52mm. actually even more narrow since i compared the 52mm on my canon and my phone's 2x zoom which is 52mm and they were both wider. every idiot on the web brags about how great this lens is for street photography or walking around. what a joke. there's a serious medical condition called retinities pigmentosa where your vision gradually narrows until you can't see anything wider than a straw. this is late stage retinitis pigmentosa. i point it across the street and all i can see is the front door of a building. if you want a zoomed in portrait of someone's face and nothing else, sure. it's a joke for everything else. dear god was it awful for video. the oss is a complete joke. even at 1/30 it was blurring. i had to set it to 1/60, which meant my iso shot up to 12800. what's the point of such a large sensor if the glass and the stabilization for that glass is shit? pay twice as much for an a6600 for maybe one extra stop of difference? because the a6600 ibis is awful as well. pocket cameras like the canon g5x ii and g7x iii as well as any modern phone with optical stabilization are leagues ahead with fast glass and stabilization. my phone automatically shoots 1/10 for almost all my low light shots. the canon i've set to 1/15 without issue. it also has a real minimum shutter setting, so i don't have to worry when it gets brighter. did i also mention they all focus way closer than one foot away?\n5. crap low light focus. the focus is amazing they say. it can track animal and human eyes they say. it's the best and most advanced focusing system on any camera they say. on a still subject (a cat) from three feet away it can't focus for shit. it wasn't pitch black. i could see the cat well and good. there was a light directly above. blur after blur after blur. multiple attempts and multiple autofocus fails. my phone had zero issue in the same -----> spot !!! . my canon would hunt and flutter for a second or two but it would eventually find it. the hybrid and phase detect most advanced focusing system on the planet can't even compete against basic contrast focus used on most budget point and shoot cameras. ditto even a cheap cellphone.\n6. loud as f\\*ck shutter. i know most of you are old and deaf but even being deaf, you can at least feel the loud shutter through the strong vibrations. i thought they would have improved it over the a6000. nope. every living thing from a one block radius will run when it hears that death contraption. here is a list of apsc cameras with far quieter shutters i've used: canon m100, fuji x-a5, fuji xf10, canon m6, ricoh gr3. most of these are cheaper than the sony. you can't use price as an excuse. they are also smaller so you can't use size either. my canon g7x just flutters like a small bird. that's it. turn on electronic shutter? why not just use a cellphone in other words.\n7. sony's still asinine playback options. not that i want to use the subpar screen for literally anything beyond framing, but even trying to weed out bad images from the camera itself is a chore with zero touch functionality and not even a zoom lever. speaking of zoom lever...\n8. instead of a zoom lever they have a worthless on/off switch that's near impossible to figure out which way is which and never flips properly or decisively, is hard to push and has no feedback. i've had multiple occasions where the a6000 would get stuck and never turn off even though the switch was set to off. i'd imagine the a6100 is going to go through the same crap since it uses the exact same switch. five years worth of progress. beautiful. and the worst placed dials on any camera. let's put the mode dial and custom dial right next to each other and have them be the same size and feel instead of staggering them and changing the size or texture like every other camera out there. they also downgraded the i/o flap. it's a thin piece of plastic that slides into place instead of a thick well hinged door.\n9. i liked the grip on the a6000. the a6100 feels like it's fat cancerous brother. not just the grip, but the whole body in general. you would have to be blind to mistake the two side by side. the main body is significantly thicker and fatter and clumsier. they increased the bulk of the grip but didn't spread it far enough away from the lens and it barely juts out from the thicker body. the a6000 actually jutted out more and had more space where you put your fingers. it feels constrained and unpleasant. what did you gain from the 50g of extra weight, a whopping 10mm or more extra thickness in the main body, and a shittier grip? a screen that can do selfies and 4k with no guarantee of record length. sure as hell didn't gain anything else.\n\ndpreview said this camera was a great family camera. i can't imagine any normal consumer would actually use this over a cellphone or pocket camera zoom like the g7x. and with the latest report from cipa showing \\~25% decline in camera sales from last year, which is considered \"less\" than previous declines, i am hoping this whole worthless apsc segment will finally die. it's not small enough or better quality enough to warrant considering for a normal person. and considering how sony is just recycling the same shit but making it worse, they obviously don't care about their apsc line and neither should anyone else. the camera market outside of professional full frame users is basically dead since sony and others keep on releasing these shit products.", "sortedWord": "None", "identifyer": 10266, "year": "2019"}, {"Unnamed: 0": 10282, "autor": "jsoltysik", "date": 1564697315000, "content": "What is your favorite method of cleaning the Sony A7 series sensors? /!/ I use Eclipse Cleaning Fluid + PSI Sensor Swab Tabs but I still have spots on all of my Sony Alpha bodies. Has anyone here used a better method?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ckv4df/what_is_your_favorite_method_of_cleaning_the_sony/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what is your favorite method of cleaning the sony a7 series sensors? /!/ i use eclipse cleaning fluid + psi sensor swab tabs but i still have -----> spots !!!  on all of my sony alpha bodies. has anyone here used a better method?", "sortedWord": "None", "identifyer": 10420, "year": "2019"}, {"Unnamed: 0": 10862, "autor": "Tehnomaag", "date": 1547471570000, "content": "Is there a technical reason why somebody has not installed a full frame senor in approx a6500 size body? /!/ Something I have been wondering about for a little while. One of the main benefits of going mirrorless is the lighter/smaller body, right? Yet the A7 series are all looking more like a traditional DSLR (although as small as the smaller APS-C offerings) than more like a rangefinder (like a6000 series). I can see certain logic behind it initially, as the system was aimed at pro's at first and that was what they were used to. \n\n&amp;#x200B;\n\nSo I have to wonder, is there a technical reason such a thing is not done? Heat? The viewfinder in the corner is bad somehow (yet it works ofr 6000/6300/6500 apparently somehow) ?\n\n&amp;#x200B;\n\nThere is something from Leica like that I think? Ummm .. Typ 220 or 240 or something like that? But Leica stuff is not really for people with budget constraints ... \n\n&amp;#x200B;\n\nThing is  - I think I would like something like 6500 (and 'proper' smallish DSLR size grip) with the difference being that instead of APS-C I would like to have a FF sensor in that box. You see .. I kinda like my legacy glass ... But I also quite like for the camera to be almost pocket-able with the right lens. But after googling on this for half a day it seems that is not a common wish at all. What am I missing? \n\n&amp;#x200B;\n\nI considered the following possibilities of why it might not be a good idea.\n\n* Ergonomics. Things like the grip, the placement of buttons. the fact that full-frame lenses are kinda heavy often enough and putting 1 kg of lens into a 0.5 kg body might feel a bit too front heavy. But .. that cant be really *it*? Put a proper grip in there, and ... with larger lens I hold the lens anyway with my other arm, or have to use tripod if it gets that heavy (I do not own any large enough lens to really have to use trippod though).  The a6500 series is approx 70mm high ... typical human hand 4 fingers side by side is approx 70 .. 85 mm, meaning that with a larger hand pinky might be left over and go under the camera. Throw in a battery grip (optional) for XXL hands. \n* Does not fit in such a small box ... but .. its not THAT much larger than APS-C, basically saw off the centrally placed EVF on top of the A7 series and you are left with a6500 size box. Maybe a heat might be an issue, but again, A7 series manages some-how. Make a better metal body, allow some spots on it to get 5C warmer maybe ... \n* I'm some kind of outlier who does not really know what I want to have? That seems plausible. Leaving aside technical reasons the main logical reason for a lack of such offering would be that business departments of camera firms think that such a niche is far too small to be worth the effort of putting anything in there. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/afvof0/is_there_a_technical_reason_why_somebody_has_not/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is there a technical reason why somebody has not installed a full frame senor in approx a6500 size body? /!/ something i have been wondering about for a little while. one of the main benefits of going mirrorless is the lighter/smaller body, right? yet the a7 series are all looking more like a traditional dslr (although as small as the smaller aps-c offerings) than more like a rangefinder (like a6000 series). i can see certain logic behind it initially, as the system was aimed at pro's at first and that was what they were used to. \n\n&amp;#x200b;\n\nso i have to wonder, is there a technical reason such a thing is not done? heat? the viewfinder in the corner is bad somehow (yet it works ofr 6000/6300/6500 apparently somehow) ?\n\n&amp;#x200b;\n\nthere is something from leica like that i think? ummm .. typ 220 or 240 or something like that? but leica stuff is not really for people with budget constraints ... \n\n&amp;#x200b;\n\nthing is  - i think i would like something like 6500 (and 'proper' smallish dslr size grip) with the difference being that instead of aps-c i would like to have a ff sensor in that box. you see .. i kinda like my legacy glass ... but i also quite like for the camera to be almost pocket-able with the right lens. but after googling on this for half a day it seems that is not a common wish at all. what am i missing? \n\n&amp;#x200b;\n\ni considered the following possibilities of why it might not be a good idea.\n\n* ergonomics. things like the grip, the placement of buttons. the fact that full-frame lenses are kinda heavy often enough and putting 1 kg of lens into a 0.5 kg body might feel a bit too front heavy. but .. that cant be really *it*? put a proper grip in there, and ... with larger lens i hold the lens anyway with my other arm, or have to use tripod if it gets that heavy (i do not own any large enough lens to really have to use trippod though).  the a6500 series is approx 70mm high ... typical human hand 4 fingers side by side is approx 70 .. 85 mm, meaning that with a larger hand pinky might be left over and go under the camera. throw in a battery grip (optional) for xxl hands. \n* does not fit in such a small box ... but .. its not that much larger than aps-c, basically saw off the centrally placed evf on top of the a7 series and you are left with a6500 size box. maybe a heat might be an issue, but again, a7 series manages some-how. make a better metal body, allow some -----> spots !!!  on it to get 5c warmer maybe ... \n* i'm some kind of outlier who does not really know what i want to have? that seems plausible. leaving aside technical reasons the main logical reason for a lack of such offering would be that business departments of camera firms think that such a niche is far too small to be worth the effort of putting anything in there. ", "sortedWord": "None", "identifyer": 11012, "year": "2019"}, {"Unnamed: 0": 11140, "autor": "AlphaBloke", "date": 1571865290000, "content": "Butterfly Model | Sony A6300 | 50mm 1.8 /!/ A butterfly in a Japanese garden.\n\nThe butterfly was super nice, flying around me and holding still on multiple spots nearby.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dm5w8y/butterfly_model_sony_a6300_50mm_18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "butterfly model | sony a6300 | 50mm 1.8 /!/ a butterfly in a japanese garden.\n\nthe butterfly was super nice, flying around me and holding still on multiple -----> spots !!!  nearby.", "sortedWord": "None", "identifyer": 11290, "year": "2019"}, {"Unnamed: 0": 11313, "autor": "ionalexis24", "date": 1550750449000, "content": "Reating on a7ii? /!/ Dose anyone know how to rate or give stars or something, to your photos in camera on a7ii?\n\nI kinda miss this from my old Nikon DSLR. In the previews you could give stars to individual photos.\n\nThis helps if you re shooting portrait and show the photos to the model on the spot so she/he could select the ones that she/he likes.\n\nVery useful feature and I'm looking forward to use it on my sony camera, obviously, if that exists :)).", "link": "https://www.reddit.com/r/SonyAlpha/comments/at2cfh/reating_on_a7ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "reating on a7ii? /!/ dose anyone know how to rate or give stars or something, to your photos in camera on a7ii?\n\ni kinda miss this from my old nikon dslr. in the previews you could give stars to individual photos.\n\nthis helps if you re shooting portrait and show the photos to the model on the -----> spot !!!  so she/he could select the ones that she/he likes.\n\nvery useful feature and i'm looking forward to use it on my sony camera, obviously, if that exists :)).", "sortedWord": "None", "identifyer": 11467, "year": "2019"}, {"Unnamed: 0": 11320, "autor": "dumb_founded456", "date": 1550730457000, "content": "Idk if this belongs based on what I’ve seen but I have a bunch of spots on my sensor and I’ve tried blowing air into it with a blower but it just added more any recommendations for getting it clean would be appreciated", "link": "https://www.reddit.com/r/SonyAlpha/comments/aszu2y/idk_if_this_belongs_based_on_what_ive_seen_but_i/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "idk if this belongs based on what i’ve seen but i have a bunch of -----> spots !!!  on my sensor and i’ve tried blowing air into it with a blower but it just added more any recommendations for getting it clean would be appreciated", "sortedWord": "None", "identifyer": 11474, "year": "2019"}, {"Unnamed: 0": 11339, "autor": "zinger565", "date": 1550706167000, "content": "What are these spots in my photo? NEX-5N, 26mm, f/25, iso160", "link": "https://www.reddit.com/r/SonyAlpha/comments/asvnfr/what_are_these_spots_in_my_photo_nex5n_26mm_f25/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!!  in my photo? nex-5n, 26mm, f/25, iso160", "sortedWord": "None", "identifyer": 11493, "year": "2019"}, {"Unnamed: 0": 11529, "autor": "executivesphere", "date": 1573315563000, "content": "Sony a6000 autofocus question /!/ I think I accidentally changed some setting on my camera but I can’t figure out what it is.\n\nFormerly, when I had my camera set to Continuous Autofocus, the green autofocus boxes would sort of dance around and several of them would be displaying at the same time, scanning for different things to focus on.\n\nThis isn’t my video, but if you look closely, you can see what I’m talking about here:\nhttps://m.youtube.com/watch?v=ycWueTqCD8w\n\nNow, when I use Continuous Autofocus, it shows just one larger autofocus box at a time. The box will move to 2-3 different spots, but mostly on the same horizontal line. Also, it does this annoying thing where it seems to zoom in and out several times while it’s focusing. It’s very distracting.\n\nDoes anyone know what setting I could have changed to cause this? Focus Mode is set to “Continuous Autofocus” and Focus Area is set to “Wide”. Thanks.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dtxu0l/sony_a6000_autofocus_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sony a6000 autofocus question /!/ i think i accidentally changed some setting on my camera but i can’t figure out what it is.\n\nformerly, when i had my camera set to continuous autofocus, the green autofocus boxes would sort of dance around and several of them would be displaying at the same time, scanning for different things to focus on.\n\nthis isn’t my video, but if you look closely, you can see what i’m talking about here:\nhttps://m.youtube.com/watch?v=ycwuetqcd8w\n\nnow, when i use continuous autofocus, it shows just one larger autofocus box at a time. the box will move to 2-3 different -----> spots !!! , but mostly on the same horizontal line. also, it does this annoying thing where it seems to zoom in and out several times while it’s focusing. it’s very distracting.\n\ndoes anyone know what setting i could have changed to cause this? focus mode is set to “continuous autofocus” and focus area is set to “wide”. thanks.", "sortedWord": "None", "identifyer": 11686, "year": "2019"}, {"Unnamed: 0": 11840, "autor": "flobin", "date": 1550063002000, "content": "How do you correctly expose video (on the a6300, but I imagine it will be the same for other models) /!/ How do you correctly expose video on the a6300? I have seen a few tutorials and guides and I feel a little bit like I can no longer see the forest for the trees. I have a few questions that I hope somebody can answer. The questions are, I hope, general enough so that they are useful for others as well.\n\nMy personal case is that I am planning to shoot a few short videos next weekend. I will be running around a bit and doing a lot of short shots here and there. I don’t mind spending time in post-production, but I am afraid I'll shoot the actual material wrong and won't be able to fix it. I only have next Sunday, so it is important for me to get it right.\n\nI am wary of shooting in S-log 2 or S-log 3 because I don’t want to get it wrong. I was thinking I would shoot in a Cine4 profile that I saw in this video. Is this a good idea? Does shooting in S-log 2 or 3 really make a difference? How big is the chance that I'll mess it up, having never shot that way before?\n\nFrom what I can tell, I should set my shutter time to double what the frames per second are. So for 24-25fps it should be 1/50s, for 50fps it should be 1/200s and for 100fps it should be 1/200s. Is that correct?\n\nIs it also correct that I should set my ISO to 100 (the 'base' or 'native' ISO of the a6300)? Or does this not matter so much if you're not shooting in S-log 2 or 3?\n\nIs an ND filter absolutely necessary? Or is it only necessary if you're setting the ISO and shutter time manually?\n\nSimply put, when using a Cine4 picture profile, can I just use auto settings and/or just set the shutter time for the exposure?\n\nAlso, I've seen people recommend two different ways to check the exposure. One is to use the histogram. Another is to disregard the histogram and use the center-spot and point it at somebody's face (overexposed by 1 stop for white people, 0 for brown people, underexposed by 0,5 to 1 stop for black people). Or use the multi spot meter for more complex shots. Which of these is the best way?\n\nAny help is appreciated. Thank you for reading this far! Here is a picture of [Miley](https://i.imgur.com/sy5RY4z.jpg) as a reward.", "link": "https://www.reddit.com/r/SonyAlpha/comments/aq6dcn/how_do_you_correctly_expose_video_on_the_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how do you correctly expose video (on the a6300, but i imagine it will be the same for other models) /!/ how do you correctly expose video on the a6300? i have seen a few tutorials and guides and i feel a little bit like i can no longer see the forest for the trees. i have a few questions that i hope somebody can answer. the questions are, i hope, general enough so that they are useful for others as well.\n\nmy personal case is that i am planning to shoot a few short videos next weekend. i will be running around a bit and doing a lot of short shots here and there. i don’t mind spending time in post-production, but i am afraid i'll shoot the actual material wrong and won't be able to fix it. i only have next sunday, so it is important for me to get it right.\n\ni am wary of shooting in s-log 2 or s-log 3 because i don’t want to get it wrong. i was thinking i would shoot in a cine4 profile that i saw in this video. is this a good idea? does shooting in s-log 2 or 3 really make a difference? how big is the chance that i'll mess it up, having never shot that way before?\n\nfrom what i can tell, i should set my shutter time to double what the frames per second are. so for 24-25fps it should be 1/50s, for 50fps it should be 1/200s and for 100fps it should be 1/200s. is that correct?\n\nis it also correct that i should set my iso to 100 (the 'base' or 'native' iso of the a6300)? or does this not matter so much if you're not shooting in s-log 2 or 3?\n\nis an nd filter absolutely necessary? or is it only necessary if you're setting the iso and shutter time manually?\n\nsimply put, when using a cine4 picture profile, can i just use auto settings and/or just set the shutter time for the exposure?\n\nalso, i've seen people recommend two different ways to check the exposure. one is to use the histogram. another is to disregard the histogram and use the center------> spot !!!  and point it at somebody's face (overexposed by 1 stop for white people, 0 for brown people, underexposed by 0,5 to 1 stop for black people). or use the multi spot meter for more complex shots. which of these is the best way?\n\nany help is appreciated. thank you for reading this far! here is a picture of [miley](https://i.imgur.com/sy5ry4z.jpg) as a reward.", "sortedWord": "None", "identifyer": 12002, "year": "2019"}, {"Unnamed: 0": 11939, "autor": "Starsfeet", "date": 1560524497000, "content": "Summer spot | A7ii + FE 50mm f/1.8", "link": "https://www.reddit.com/r/SonyAlpha/comments/c0l477/summer_spot_a7ii_fe_50mm_f18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "summer -----> spot !!!  | a7ii + fe 50mm f/1.8", "sortedWord": "None", "identifyer": 12101, "year": "2019"}, {"Unnamed: 0": 12145, "autor": "RMCPhoto", "date": 1559686400000, "content": "Zoom lens (Tamron 28-75) -VS.- Cropping a prime (Rokinon 14mm) /!/ # To put it another way: how acceptable is \"digital zoom\" on a 42 megapixel sensor?\n\nTo test this out I am comparing the much loved $800 Tamron 28-75mm F2.8 with the much loved $300 14mm F2.8 Rokinon.  The  camera used is the Sony a7rii. The beautiful background is my dining room...which is where I was sitting when this hit me  on a whim.\n\n1. The Tamron was set to F5.6 for 28mm F5.6 for 35mm and F8 for 50mm  \n\n2. The Rokinon was set to F2.8 (wide open) and was adapted with a Sigma MC-11. The resulting image was cropped in lightroom to equivalent 28/35/50mm frames.\n\n  \nSo as to not give it away immediately V1 is one of the lenses and V2 is the other.  All images received the same treatment (basic white balance correction, Auto Tone, 60 sharpening, 25 noise reduction). \n\n&amp;#x200B;\n\n# Can you spot the Rokinon?\n\n&amp;#x200B;\n\n28mm V1- [https://i.imgur.com/CKnA1t7.jpg](https://i.imgur.com/CKnA1t7.jpg)  \n28mm V2 - [https://i.imgur.com/nvXcGKf.jpg](https://i.imgur.com/nvXcGKf.jpg)\n\n35mm V1 - [https://i.imgur.com/7ApCtfj.jpg](https://i.imgur.com/7ApCtfj.jpg)\n\n35mm V2 - [https://i.imgur.com/wxk6WBD.jpg](https://i.imgur.com/wxk6WBD.jpg)\n\n50mm V1 - [https://i.imgur.com/N3ZTnSx.jpg](https://i.imgur.com/N3ZTnSx.jpg)\n\n50mm V2 - [https://i.imgur.com/KSSsh2H.jpg](https://i.imgur.com/KSSsh2H.jpg)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nOf course you could. This is a ridiculous comparison. But it did surprise me a bit.   I have the 28-75mm  Tamron, but it's just not wide enough.  I don't have a wide zoom, or a spare $1200,   but I do have the Rokinon 14mm.    \n\n\nThough I fancy myself Ansel Adams and deeply believe that my photos will end up printed 4'x6' for new york galleries...they're mostly just going on the web.  Most are viewed at just 1080 pixels wide.  I think I can swallow my  pride on this one and pack the 14mm prime.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bwuvnr/zoom_lens_tamron_2875_vs_cropping_a_prime_rokinon/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "zoom lens (tamron 28-75) -vs.- cropping a prime (rokinon 14mm) /!/ # to put it another way: how acceptable is \"digital zoom\" on a 42 megapixel sensor?\n\nto test this out i am comparing the much loved $800 tamron 28-75mm f2.8 with the much loved $300 14mm f2.8 rokinon.  the  camera used is the sony a7rii. the beautiful background is my dining room...which is where i was sitting when this hit me  on a whim.\n\n1. the tamron was set to f5.6 for 28mm f5.6 for 35mm and f8 for 50mm  \n\n2. the rokinon was set to f2.8 (wide open) and was adapted with a sigma mc-11. the resulting image was cropped in lightroom to equivalent 28/35/50mm frames.\n\n  \nso as to not give it away immediately v1 is one of the lenses and v2 is the other.  all images received the same treatment (basic white balance correction, auto tone, 60 sharpening, 25 noise reduction). \n\n&amp;#x200b;\n\n# can you -----> spot !!!  the rokinon?\n\n&amp;#x200b;\n\n28mm v1- [https://i.imgur.com/ckna1t7.jpg](https://i.imgur.com/ckna1t7.jpg)  \n28mm v2 - [https://i.imgur.com/nvxcgkf.jpg](https://i.imgur.com/nvxcgkf.jpg)\n\n35mm v1 - [https://i.imgur.com/7apctfj.jpg](https://i.imgur.com/7apctfj.jpg)\n\n35mm v2 - [https://i.imgur.com/wxk6wbd.jpg](https://i.imgur.com/wxk6wbd.jpg)\n\n50mm v1 - [https://i.imgur.com/n3ztnsx.jpg](https://i.imgur.com/n3ztnsx.jpg)\n\n50mm v2 - [https://i.imgur.com/ksssh2h.jpg](https://i.imgur.com/ksssh2h.jpg)\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nof course you could. this is a ridiculous comparison. but it did surprise me a bit.   i have the 28-75mm  tamron, but it's just not wide enough.  i don't have a wide zoom, or a spare $1200,   but i do have the rokinon 14mm.    \n\n\nthough i fancy myself ansel adams and deeply believe that my photos will end up printed 4'x6' for new york galleries...they're mostly just going on the web.  most are viewed at just 1080 pixels wide.  i think i can swallow my  pride on this one and pack the 14mm prime.", "sortedWord": "None", "identifyer": 12309, "year": "2019"}, {"Unnamed: 0": 12316, "autor": "TedRitties", "date": 1564450013000, "content": "Little improv shoot on the spot with a friend of mine // A7iii with Sigma Art 35 1.4 // ISO 160 - F1.4 - 1/100 sec.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cjko0j/little_improv_shoot_on_the_spot_with_a_friend_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "little improv shoot on the -----> spot !!!  with a friend of mine // a7iii with sigma art 35 1.4 // iso 160 - f1.4 - 1/100 sec.", "sortedWord": "None", "identifyer": 12482, "year": "2019"}, {"Unnamed: 0": 12317, "autor": "TedRitties", "date": 1564449816000, "content": "Little improv shoot on the spot with a friend of mine who I ran into // A7iii w/ Sigma Art 35 1.4 // ISO 160 - F1.4 - 1/100 sec.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cjkmoj/little_improv_shoot_on_the_spot_with_a_friend_of/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "little improv shoot on the -----> spot !!!  with a friend of mine who i ran into // a7iii w/ sigma art 35 1.4 // iso 160 - f1.4 - 1/100 sec.", "sortedWord": "None", "identifyer": 12483, "year": "2019"}, {"Unnamed: 0": 12844, "autor": "GatorCyclist", "date": 1559313738000, "content": "LA-EA3 adapter and a7ii /!/ Sharing a data point. \n\nI tried pairing the Tamron A mount 70-300 with an LA-EA3 adapter and my a7ii.  The flex spots and center/Eye AF wouldn’t work and the lens had real problems in AF generally.  AF was slow or useless both in phase and contrast modes.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bv8cuf/laea3_adapter_and_a7ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "la-ea3 adapter and a7ii /!/ sharing a data point. \n\ni tried pairing the tamron a mount 70-300 with an la-ea3 adapter and my a7ii.  the flex -----> spots !!!  and center/eye af wouldn’t work and the lens had real problems in af generally.  af was slow or useless both in phase and contrast modes.", "sortedWord": "None", "identifyer": 13018, "year": "2019"}, {"Unnamed: 0": 12901, "autor": "civex", "date": 1552254708000, "content": "Surfers off Waikiki video with Sony a6400 through a Celestron C-90 spotting scope", "link": "https://www.reddit.com/r/SonyAlpha/comments/azkyc4/surfers_off_waikiki_video_with_sony_a6400_through/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "surfers off waikiki video with sony a6400 through a celestron c-90 -----> spotting !!!  scope", "sortedWord": "None", "identifyer": 13076, "year": "2019"}, {"Unnamed: 0": 13192, "autor": "Kirkenspiel", "date": 1567527741000, "content": "Shot from pull off spot leaving Sequoia National Park [Sony a7ii, Sigma 24mm 1.4]", "link": "https://www.reddit.com/r/SonyAlpha/comments/cz733p/shot_from_pull_off_spot_leaving_sequoia_national/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shot from pull off -----> spot !!!  leaving sequoia national park [sony a7ii, sigma 24mm 1.4]", "sortedWord": "None", "identifyer": 13370, "year": "2019"}, {"Unnamed: 0": 13351, "autor": "DatedMovieReference", "date": 1565991163000, "content": "Good spot for a drink. A6000 + rokinon 12mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/crctzl/good_spot_for_a_drink_a6000_rokinon_12mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good -----> spot !!!  for a drink. a6000 + rokinon 12mm", "sortedWord": "None", "identifyer": 13531, "year": "2019"}, {"Unnamed: 0": 13467, "autor": "JKV_403", "date": 1567784300000, "content": "A6000 difference of 95mb/s and 170mb/s /!/ I was browsing for an upgrade at my local store and I saw the Sandisk Extreme Pro in which they recommend me to and the price difference of a 64gb 95 and 170 is only a slight crunch and I wonder if the there is a difference to those two. I look at up some old reddit post that says the 95mb/s is the sweet spot but I couldn't find any thing about the 170. I know is kind of stupid to be asking this but I just want to make a really good buy on this instead of having buyers regret.\n\nThanks for the help :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/d0iavn/a6000_difference_of_95mbs_and_170mbs/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6000 difference of 95mb/s and 170mb/s /!/ i was browsing for an upgrade at my local store and i saw the sandisk extreme pro in which they recommend me to and the price difference of a 64gb 95 and 170 is only a slight crunch and i wonder if the there is a difference to those two. i look at up some old reddit post that says the 95mb/s is the sweet -----> spot !!!  but i couldn't find any thing about the 170. i know is kind of stupid to be asking this but i just want to make a really good buy on this instead of having buyers regret.\n\nthanks for the help :)", "sortedWord": "None", "identifyer": 13650, "year": "2019"}, {"Unnamed: 0": 13659, "autor": "Mugglebornwizar", "date": 1566310086000, "content": "*Sony A7 50mm* did a maternity shoot for a friend and found this amazingly lit spot.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cszfob/sony_a7_50mm_did_a_maternity_shoot_for_a_friend/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "*sony a7 50mm* did a maternity shoot for a friend and found this amazingly lit -----> spot !!! .", "sortedWord": "None", "identifyer": 13847, "year": "2019"}, {"Unnamed: 0": 13895, "autor": "julien_lzd", "date": 1576935249000, "content": "Awesome spot for backcountry skiing in France | Sony A6000, Sigma 30mm 1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/edpyyb/awesome_spot_for_backcountry_skiing_in_france/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "awesome -----> spot !!!  for backcountry skiing in france | sony a6000, sigma 30mm 1.4", "sortedWord": "None", "identifyer": 14093, "year": "2019"}, {"Unnamed: 0": 13975, "autor": "Fuzzers", "date": 1565585513000, "content": "a6000 kit lens upgrade to a wider zoom - suggestions? /!/ Hey SonyAlpha! \n\n&amp;#x200B;\n\nI've had my a6000 with kit lens for just over a year now, and I'm starting to look into possible upgrades. I use my camera solely for landscape photography as I do a lot of hiking and camping with friends. The only two reasons I want to upgrade is to get access to a wider focal length below what I currently have (16mm) for wide angle shots, and to see if I can get a little more sharpness out of my shots (Although I don't think I'm going to get this unless I switch to a prime lens unfortunately). I also don't think I want to get a prime lens since I do find myself occasionally zooming in and out for framing and I could see that being a buzz kill with a prime. \n\n&amp;#x200B;\n\nBest Contender I can find right now is the sony 10-18. From reviews it looks like it has the same sharpness as the kit lens, but the wide angle on it really would help me out in my shots. The only other lens I can find is the canon 10-18, but I would need an adapter, although in the end it would be a cheaper. \n\n&amp;#x200B;\n\nDoes anybody have any other potential recommendations for what I could get or I am pretty spot on? \n\n&amp;#x200B;\n\nThanks in advance for the feedback :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/cp7o1o/a6000_kit_lens_upgrade_to_a_wider_zoom_suggestions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6000 kit lens upgrade to a wider zoom - suggestions? /!/ hey sonyalpha! \n\n&amp;#x200b;\n\ni've had my a6000 with kit lens for just over a year now, and i'm starting to look into possible upgrades. i use my camera solely for landscape photography as i do a lot of hiking and camping with friends. the only two reasons i want to upgrade is to get access to a wider focal length below what i currently have (16mm) for wide angle shots, and to see if i can get a little more sharpness out of my shots (although i don't think i'm going to get this unless i switch to a prime lens unfortunately). i also don't think i want to get a prime lens since i do find myself occasionally zooming in and out for framing and i could see that being a buzz kill with a prime. \n\n&amp;#x200b;\n\nbest contender i can find right now is the sony 10-18. from reviews it looks like it has the same sharpness as the kit lens, but the wide angle on it really would help me out in my shots. the only other lens i can find is the canon 10-18, but i would need an adapter, although in the end it would be a cheaper. \n\n&amp;#x200b;\n\ndoes anybody have any other potential recommendations for what i could get or i am pretty -----> spot !!!  on? \n\n&amp;#x200b;\n\nthanks in advance for the feedback :)", "sortedWord": "None", "identifyer": 14173, "year": "2019"}, {"Unnamed: 0": 14192, "autor": "newbieCam", "date": 1556548046000, "content": "Share your custom button settings and tips/tricks! /!/ How do you customize your camera to make it an extension of yourself? Please include context:\n\nI do newborn photography and, while the studio shoots aren't very challenging, in-hospital shoots are basically indoor sports with lowlight at macro distances. I need to be able to get sharp shots on a moving subject close up and in minimal light, leaving me very little DoF. Mainly working with the 24-70mm f/2.8 on an a7iii, these seem to help.\n\nLens button: manual focus while holding, for when AF fails, pretty ergonomically imitates Canon's full-time auto focus, I prefer it to the switch\n\nC1: cycles through magnification, centers on the point AF was last at, only works while manual focusing with lens button but also the only time I need to check sharpness that closely\n\nC2: registered focus area flexible spot small while holding, for when I want to center-recompose or reset the magnification point to center\n\nC3: cycles through rating, to favorite likely picks in post\n\nC4: toggles APS-C / FF mode, to get a little extra reach, the trash can reminds me that I'm throwing away pixels :P\n\nAF-ON: autofocus while holding, to focus-recompose\n\nAEL: eye-AF while holding, to eye-AF\n\nDown: toggles silent shooting, sometimes newborns are drawn to the clicking sound, sometimes it makes them cry\n\nCamera is almost always set to AF-continuous, zone focus area, manual with auto ISO. Suggestions much appreciated.", "link": "https://www.reddit.com/r/SonyAlpha/comments/biq3hm/share_your_custom_button_settings_and_tipstricks/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "share your custom button settings and tips/tricks! /!/ how do you customize your camera to make it an extension of yourself? please include context:\n\ni do newborn photography and, while the studio shoots aren't very challenging, in-hospital shoots are basically indoor sports with lowlight at macro distances. i need to be able to get sharp shots on a moving subject close up and in minimal light, leaving me very little dof. mainly working with the 24-70mm f/2.8 on an a7iii, these seem to help.\n\nlens button: manual focus while holding, for when af fails, pretty ergonomically imitates canon's full-time auto focus, i prefer it to the switch\n\nc1: cycles through magnification, centers on the point af was last at, only works while manual focusing with lens button but also the only time i need to check sharpness that closely\n\nc2: registered focus area flexible -----> spot !!!  small while holding, for when i want to center-recompose or reset the magnification point to center\n\nc3: cycles through rating, to favorite likely picks in post\n\nc4: toggles aps-c / ff mode, to get a little extra reach, the trash can reminds me that i'm throwing away pixels :p\n\naf-on: autofocus while holding, to focus-recompose\n\nael: eye-af while holding, to eye-af\n\ndown: toggles silent shooting, sometimes newborns are drawn to the clicking sound, sometimes it makes them cry\n\ncamera is almost always set to af-continuous, zone focus area, manual with auto iso. suggestions much appreciated.", "sortedWord": "None", "identifyer": 14394, "year": "2019"}, {"Unnamed: 0": 14457, "autor": "WomanizeMe", "date": 1557985878000, "content": "Something unexpected in the EVF /!/  \n\nI just bought a Sony A7 camera and a black spot unfortunately appeared in the EVF.\n\n* it's only visible in the EVF, always same size, same place\n* not on the back screen\n* not on any picture I take.\n* the sensor is cleaned\n\nI think it a dust or sth because:\n\n* a black spot or dead pixel would be lots smaller\n* a kind of shadow of that thing can be seen if dioptric compensation is tweaked (I don't know if it's really a shadow or a visual artifact)\n\nAnyone knowledgeable or with same issue please report here or help me with this (Couldn't find anything anywhere on this matter). Thank you\n\n(Here's a photo of the viewfinder taken from my iPhone 6:)\n\n&amp;#x200B;\n\nhttps://i.redd.it/nsorx0zqhiy21.jpg", "link": "https://www.reddit.com/r/SonyAlpha/comments/bp8y9g/something_unexpected_in_the_evf/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "something unexpected in the evf /!/  \n\ni just bought a sony a7 camera and a black -----> spot !!!  unfortunately appeared in the evf.\n\n* it's only visible in the evf, always same size, same place\n* not on the back screen\n* not on any picture i take.\n* the sensor is cleaned\n\ni think it a dust or sth because:\n\n* a black spot or dead pixel would be lots smaller\n* a kind of shadow of that thing can be seen if dioptric compensation is tweaked (i don't know if it's really a shadow or a visual artifact)\n\nanyone knowledgeable or with same issue please report here or help me with this (couldn't find anything anywhere on this matter). thank you\n\n(here's a photo of the viewfinder taken from my iphone 6:)\n\n&amp;#x200b;\n\nhttps://i.redd.it/nsorx0zqhiy21.jpg", "sortedWord": "None", "identifyer": 14670, "year": "2019"}, {"Unnamed: 0": 14736, "autor": "Ph0eNiX-", "date": 1568660904000, "content": "Tamron 17 28 sharpest aperture Sweet Spot for landscape photography? /!/ Hello community, I recently bought the Tamron 28 75mm f2.8 for my Sony A7iii. Does anyone happen to know the sharpest aperture for this kens that does as well provide the best dof. I raed about f.8. Does anyone know how much of a difference it makes in landscape shots compared to f.11. Primary use are landscape/outdoors. Thank you. Any input is appreciated.", "link": "https://www.reddit.com/r/SonyAlpha/comments/d54ypx/tamron_17_28_sharpest_aperture_sweet_spot_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tamron 17 28 sharpest aperture sweet -----> spot !!!  for landscape photography? /!/ hello community, i recently bought the tamron 28 75mm f2.8 for my sony a7iii. does anyone happen to know the sharpest aperture for this kens that does as well provide the best dof. i raed about f.8. does anyone know how much of a difference it makes in landscape shots compared to f.11. primary use are landscape/outdoors. thank you. any input is appreciated.", "sortedWord": "None", "identifyer": 14957, "year": "2019"}, {"Unnamed: 0": 14816, "autor": "rote_kirsche", "date": 1557406232000, "content": "He was loved. Zimbabwe 2018. /!/ &amp;#x200B;\n\n[He was loved.](https://i.redd.it/o3697uhsl6x21.jpg)\n\nOn one of my first days in Zimbabwe I  was invited to a carriage ride to find a beautiful spot to scatter the ashes of an old safari horse. After one of the safari guides said a short but heartfelt and deeply moving prayer in shona, we scattered his ashes on a beautiful meadow in the heart of Zimbabwe as the sun set behind Acacia trees. He was loved.  \n\n\nSony A7iii, 50mm", "link": "https://www.reddit.com/r/SonyAlpha/comments/bmjes9/he_was_loved_zimbabwe_2018/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "he was loved. zimbabwe 2018. /!/ &amp;#x200b;\n\n[he was loved.](https://i.redd.it/o3697uhsl6x21.jpg)\n\non one of my first days in zimbabwe i  was invited to a carriage ride to find a beautiful -----> spot !!!  to scatter the ashes of an old safari horse. after one of the safari guides said a short but heartfelt and deeply moving prayer in shona, we scattered his ashes on a beautiful meadow in the heart of zimbabwe as the sun set behind acacia trees. he was loved.  \n\n\nsony a7iii, 50mm", "sortedWord": "None", "identifyer": 15040, "year": "2019"}, {"Unnamed: 0": 15026, "autor": "Master_Vicen", "date": 1569051260000, "content": "Best macro lenses? /!/ I'm interested in hitting that sweet spot where you get the most bang for your buck. I'm not interested in spending an extra $100 for very minute differences. But I also want to kind of avoid crappy cheap lenses. Again, I want a mid-ground, good-value option. (A6400).", "link": "https://www.reddit.com/r/SonyAlpha/comments/d77jzo/best_macro_lenses/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best macro lenses? /!/ i'm interested in hitting that sweet -----> spot !!!  where you get the most bang for your buck. i'm not interested in spending an extra $100 for very minute differences. but i also want to kind of avoid crappy cheap lenses. again, i want a mid-ground, good-value option. (a6400).", "sortedWord": "None", "identifyer": 15254, "year": "2019"}, {"Unnamed: 0": 15309, "autor": "finance0729", "date": 1575425676000, "content": "A6300 sweet spot /!/ What’s everyone’s take on the sweet spot with this camera and the kit lens? ....while I am looking for a lens -  as I’m new to photography.\n\nAs far as portrait I was going to go with the Sigma 30 1.4 any thoughts? \n\nI got my A6300 for $100 brand new in box from a friends store that went out of business so that’s what I’m working with as I enter photography!  Thanks for any help.", "link": "https://www.reddit.com/r/SonyAlpha/comments/e5s3yj/a6300_sweet_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a6300 sweet -----> spot !!!  /!/ what’s everyone’s take on the sweet spot with this camera and the kit lens? ....while i am looking for a lens -  as i’m new to photography.\n\nas far as portrait i was going to go with the sigma 30 1.4 any thoughts? \n\ni got my a6300 for $100 brand new in box from a friends store that went out of business so that’s what i’m working with as i enter photography!  thanks for any help.", "sortedWord": "None", "identifyer": 15539, "year": "2019"}, {"Unnamed: 0": 15673, "autor": "helixeagle", "date": 1556176679000, "content": "Spotted! Using a Sony a6000, 55 - 210mm.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bh5q2h/spotted_using_a_sony_a6000_55_210mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! ! using a sony a6000, 55 - 210mm.", "sortedWord": "None", "identifyer": 15909, "year": "2019"}, {"Unnamed: 0": 15779, "autor": "Jeckell-exe", "date": 1562856954000, "content": "Finally saved up enough to go mirrorless, found this spot on my walk today😌 Sony A7ii", "link": "https://www.reddit.com/r/SonyAlpha/comments/cbwikg/finally_saved_up_enough_to_go_mirrorless_found/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "finally saved up enough to go mirrorless, found this -----> spot !!!  on my walk today😌 sony a7ii", "sortedWord": "None", "identifyer": 16017, "year": "2019"}, {"Unnamed: 0": 16079, "autor": "extrawires", "date": 1570881566000, "content": "Auto focus issues /!/ I’ve had the a7riii since it was first released, and use a Sony 24-70 2.8 GM lens. \n\nI have constant issues with focus when shooting portraits. And not when shooting at wide apertures. I’ll be at f8-f11 and use eye af and like 1 out of 3 shots, or more, will not be properly focused. I’m on af-c function and have tried using the expandable spot, and the wide setting. I feel like I’ve tried everything. How many of you out there have similar issues? I will add that these portraits are not in low light so it should not be an issue. Have any of you had the same issue and if so did you find a setting that changed it? \n\nAuto focus for shooting product seems to be perfect, and these portraits don’t have fast moving models or anything, yet I get consistent out of focus shots which seems unacceptable. Soon I’m going to try a rental body and lens to see if it’s an issue with my gear.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dgu7z8/auto_focus_issues/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "auto focus issues /!/ i’ve had the a7riii since it was first released, and use a sony 24-70 2.8 gm lens. \n\ni have constant issues with focus when shooting portraits. and not when shooting at wide apertures. i’ll be at f8-f11 and use eye af and like 1 out of 3 shots, or more, will not be properly focused. i’m on af-c function and have tried using the expandable -----> spot !!! , and the wide setting. i feel like i’ve tried everything. how many of you out there have similar issues? i will add that these portraits are not in low light so it should not be an issue. have any of you had the same issue and if so did you find a setting that changed it? \n\nauto focus for shooting product seems to be perfect, and these portraits don’t have fast moving models or anything, yet i get consistent out of focus shots which seems unacceptable. soon i’m going to try a rental body and lens to see if it’s an issue with my gear.", "sortedWord": "None", "identifyer": 16325, "year": "2019"}, {"Unnamed: 0": 16302, "autor": "Dee-rod", "date": 1563559592000, "content": "Does flexible spot AF only use Contrast Detect AF or does it also use Phase Detect? /!/ I have an A6000 and am trying to figure out if only CD AF is used when set to flexible spot or if PD AF is also used. I like the flexible spot for composition and for moving subjects I want to ensure I'm focusing as fast as possible, hence why I want to know the PD is working. \n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/cfay31/does_flexible_spot_af_only_use_contrast_detect_af/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does flexible -----> spot !!!  af only use contrast detect af or does it also use phase detect? /!/ i have an a6000 and am trying to figure out if only cd af is used when set to flexible spot or if pd af is also used. i like the flexible spot for composition and for moving subjects i want to ensure i'm focusing as fast as possible, hence why i want to know the pd is working. \n\nthanks!", "sortedWord": "None", "identifyer": 16552, "year": "2019"}, {"Unnamed: 0": 16328, "autor": "JohnRBuckley", "date": 1563125853000, "content": "a7R III Sensor Dust /!/ Traveling with the a7R III, I picked up a healthy amount of sensor dust that even a good clean cloth couldn’t get rid of.  Ironically, it happened towards the end of my trip, perhaps thankfully at that but it shouldn’t have happened at all for two reasons.\n\nI’m sharing this information to help others prevent sensor dust from bricking the Sony on your next adventure... until you can get it cleaned.\n\nFirst, you cannot bring canned air.  It’s hard to ask for or find in foreign countries... and not likely something you want taking up space in your bag.\n\nThe best option - if you are going into extreme or situations where there is a lot of water or dust is to cover it, coat, ziplock, or made for the model cover.\n\nTLDR; Body was connected to a 16-35mm lens that has weather sealing, majority of the time.  To be fair, the Lens was fine.  Dust from the ATV trail got into the sensor area anyway.\n\nHiking Trails - No Sensor Dust\nLakes and River - No Sensor Dust\nBoat - No Sensor Dust, but some sea water did splash on the camera body and lens.  Remnants of dried sea salt were evident but sensor and lens were fine.\nIn Town - No Sensor Dust\n(I’d done a few lens changes... but ultimately kept the 16-35mm on most of the time.  It is an impressive glass with excellent quality, lowlight and range)\nATV Trip - Sensor Spots, when checking the sensor, there they were.  Camera Cleaning Mode didn’t do squat.  Microfiber towel did ok, and pump air blower helped a little.  However, dust still present.  I purposely kept the 16-35mm on it with no changes because I feared dust getting into the sensor... but it got in anyway.\n\nWould the a9 have had the same issue?  I regretted not bringing my D850 or D5.  I had to use the P1000 or my RX0 II the last two days of the trip.\n\nGreat trip - just wish the a7R III would have withstood trail dust a lot better than it did.  The body is fine now, I got home and blew out the sensor with compressed air - good as new.  Didn’t have that option over 2-3 thousand miles away.\n\nAny tips or advice (constructive) is welcome, please.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cd5rjh/a7r_iii_sensor_dust/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a7r iii sensor dust /!/ traveling with the a7r iii, i picked up a healthy amount of sensor dust that even a good clean cloth couldn’t get rid of.  ironically, it happened towards the end of my trip, perhaps thankfully at that but it shouldn’t have happened at all for two reasons.\n\ni’m sharing this information to help others prevent sensor dust from bricking the sony on your next adventure... until you can get it cleaned.\n\nfirst, you cannot bring canned air.  it’s hard to ask for or find in foreign countries... and not likely something you want taking up space in your bag.\n\nthe best option - if you are going into extreme or situations where there is a lot of water or dust is to cover it, coat, ziplock, or made for the model cover.\n\ntldr; body was connected to a 16-35mm lens that has weather sealing, majority of the time.  to be fair, the lens was fine.  dust from the atv trail got into the sensor area anyway.\n\nhiking trails - no sensor dust\nlakes and river - no sensor dust\nboat - no sensor dust, but some sea water did splash on the camera body and lens.  remnants of dried sea salt were evident but sensor and lens were fine.\nin town - no sensor dust\n(i’d done a few lens changes... but ultimately kept the 16-35mm on most of the time.  it is an impressive glass with excellent quality, lowlight and range)\natv trip - sensor -----> spots !!! , when checking the sensor, there they were.  camera cleaning mode didn’t do squat.  microfiber towel did ok, and pump air blower helped a little.  however, dust still present.  i purposely kept the 16-35mm on it with no changes because i feared dust getting into the sensor... but it got in anyway.\n\nwould the a9 have had the same issue?  i regretted not bringing my d850 or d5.  i had to use the p1000 or my rx0 ii the last two days of the trip.\n\ngreat trip - just wish the a7r iii would have withstood trail dust a lot better than it did.  the body is fine now, i got home and blew out the sensor with compressed air - good as new.  didn’t have that option over 2-3 thousand miles away.\n\nany tips or advice (constructive) is welcome, please.", "sortedWord": "None", "identifyer": 16578, "year": "2019"}, {"Unnamed: 0": 16796, "autor": "OverlyHastey", "date": 1572879930000, "content": "A7SII problems connecting to Sony XLR-K2M /!/ Heyo friendos! \n\nI am having trouble connecting my mic to the camera body. The XLR is brand new and the settings are all spot on. \n\nMy previous XLR did have a problem, when I was tightening it the wheel got misaligned and stuck. Had to basically Jimmy it off the camera. While it was stuck it was working perfectly. And I hadn’t tested it for about a month before putting it back on. That’s when it stopped working. \n\nHas anyone had similar problems? I don’t see any damage to the connector on the camera’s end. \n\nThanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/dritu3/a7sii_problems_connecting_to_sony_xlrk2m/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a7sii problems connecting to sony xlr-k2m /!/ heyo friendos! \n\ni am having trouble connecting my mic to the camera body. the xlr is brand new and the settings are all -----> spot !!!  on. \n\nmy previous xlr did have a problem, when i was tightening it the wheel got misaligned and stuck. had to basically jimmy it off the camera. while it was stuck it was working perfectly. and i hadn’t tested it for about a month before putting it back on. that’s when it stopped working. \n\nhas anyone had similar problems? i don’t see any damage to the connector on the camera’s end. \n\nthanks!", "sortedWord": "None", "identifyer": 17053, "year": "2019"}, {"Unnamed: 0": 17469, "autor": "SonyAlphaLab", "date": 1576157601000, "content": "My Sony E 70-350mm G OSS Lens Review is Now up! /!/ Hi there everybody. I apologize if I am not posting correctly, but I am a bit confused on how to use reddit at the moment ;) Is this the correct spot to post this? In any event those interested I wanted to share my recent review of the Sony E 70-350mm G OSS Lens! It's a reasonable priced very high quality telephoto lens designed specifically for the crop factor e-mount cameras like the Sony A6600, A6500, A6400 and so fourth, You can also use it on the full frame e-mount cameras though in crop factor mode, which a lot of people are doing as well. Please let me if you have any questions and my review is on my youtube channel here: [https://youtu.be/Rs9Me5FCgTM](https://youtu.be/Rs9Me5FCgTM)\n\nhttps://preview.redd.it/nrd62pisf7441.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=ae63e427bd7385b7199791ba3f95db11fe90c0a2", "link": "https://www.reddit.com/r/SonyAlpha/comments/e9nlwy/my_sony_e_70350mm_g_oss_lens_review_is_now_up/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my sony e 70-350mm g oss lens review is now up! /!/ hi there everybody. i apologize if i am not posting correctly, but i am a bit confused on how to use reddit at the moment ;) is this the correct -----> spot !!!  to post this? in any event those interested i wanted to share my recent review of the sony e 70-350mm g oss lens! it's a reasonable priced very high quality telephoto lens designed specifically for the crop factor e-mount cameras like the sony a6600, a6500, a6400 and so fourth, you can also use it on the full frame e-mount cameras though in crop factor mode, which a lot of people are doing as well. please let me if you have any questions and my review is on my youtube channel here: [https://youtu.be/rs9me5fcgtm](https://youtu.be/rs9me5fcgtm)\n\nhttps://preview.redd.it/nrd62pisf7441.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=ae63e427bd7385b7199791ba3f95db11fe90c0a2", "sortedWord": "None", "identifyer": 17743, "year": "2019"}, {"Unnamed: 0": 17507, "autor": "kamurakazi", "date": 1576097491000, "content": "Found a nice spot at the hotel garden walk | A9 | Rokinon 85mm 1.4", "link": "https://www.reddit.com/r/SonyAlpha/comments/e9cyz7/found_a_nice_spot_at_the_hotel_garden_walk_a9/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "found a nice -----> spot !!!  at the hotel garden walk | a9 | rokinon 85mm 1.4", "sortedWord": "None", "identifyer": 17781, "year": "2019"}, {"Unnamed: 0": 18156, "autor": "matei1987", "date": 1566660178000, "content": "Helicopter shot of the Matterhorn in Switzerland through glass. Bless the spot removal tool. [reposting with camera info - A7Riii, Tamron 28-75]", "link": "https://www.reddit.com/r/SonyAlpha/comments/cuup06/helicopter_shot_of_the_matterhorn_in_switzerland/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "helicopter shot of the matterhorn in switzerland through glass. bless the -----> spot !!!  removal tool. [reposting with camera info - a7riii, tamron 28-75]", "sortedWord": "None", "identifyer": 18451, "year": "2019"}, {"Unnamed: 0": 18160, "autor": "matei1987", "date": 1566658292000, "content": "Shot of the Matterhorn from a helicopter through glass. Bless the spot removal tool.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cuub1f/shot_of_the_matterhorn_from_a_helicopter_through/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shot of the matterhorn from a helicopter through glass. bless the -----> spot !!!  removal tool.", "sortedWord": "None", "identifyer": 18455, "year": "2019"}, {"Unnamed: 0": 18500, "autor": "cloudexclusive", "date": 1567067950000, "content": "Is there a significant difference between APSC and full-frame? /!/ For me I came up with the question to upgrade my camera equipment to step more into a professional region. Actually my Sony Alpha 6300 does a very very great job and it is so compact. The only thing I struggle with is to create a nice bokeh in a full body portrait. Of courses I could buy a at least 135mm lens but the crop-factor would affect it to an 200mm and I'm not sure if I want to buy walkie talkies to communicate with my model cause mostly I shoot outdoor in the streets. \n\n**So one point for sure goes to the full-frame bodies but whats about the actual IMAGE QUALITY and the DYNAMIC RANGE? Is there really so MUCH DIFFERENCE?** \n\nI consume a lot of content of other photographers to get inspired and to think about how this photos were made and what was the photographers idea. It happens a lot of times to see photography have an awesome moody light situation, not just cause of the actual situation of the sunlight or flashlight, it is more a bigger and clearer difference between dark and bright spots in the picture. Has this something to do with the dynamic range of a full-frame body? I don't know but maybe you know. But it could be another reason to vote for full-frame.   \n\n\nThese are the only reasons I figured out to vote for full-frame but is that enough improvement in a picture to buy equipment costs 3-4x times the money I spent for my Sony A6300?\n\n&amp;#x200B;\n\n[great samples for awesome results of my APSC camera SonyAlpha A6300](https://i.redd.it/biamjzr0ocj31.jpg)", "link": "https://www.reddit.com/r/SonyAlpha/comments/cwy3rl/is_there_a_significant_difference_between_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is there a significant difference between apsc and full-frame? /!/ for me i came up with the question to upgrade my camera equipment to step more into a professional region. actually my sony alpha 6300 does a very very great job and it is so compact. the only thing i struggle with is to create a nice bokeh in a full body portrait. of courses i could buy a at least 135mm lens but the crop-factor would affect it to an 200mm and i'm not sure if i want to buy walkie talkies to communicate with my model cause mostly i shoot outdoor in the streets. \n\n**so one point for sure goes to the full-frame bodies but whats about the actual image quality and the dynamic range? is there really so much difference?** \n\ni consume a lot of content of other photographers to get inspired and to think about how this photos were made and what was the photographers idea. it happens a lot of times to see photography have an awesome moody light situation, not just cause of the actual situation of the sunlight or flashlight, it is more a bigger and clearer difference between dark and bright -----> spots !!!  in the picture. has this something to do with the dynamic range of a full-frame body? i don't know but maybe you know. but it could be another reason to vote for full-frame.   \n\n\nthese are the only reasons i figured out to vote for full-frame but is that enough improvement in a picture to buy equipment costs 3-4x times the money i spent for my sony a6300?\n\n&amp;#x200b;\n\n[great samples for awesome results of my apsc camera sonyalpha a6300](https://i.redd.it/biamjzr0ocj31.jpg)", "sortedWord": "None", "identifyer": 18802, "year": "2019"}, {"Unnamed: 0": 18553, "autor": "alexrogerswbu", "date": 1567011596000, "content": "Need help! Pink spots appearing in all clips from my Sony a6500. I've seen a couple of these before but didn't think much, now there seems to be more!", "link": "https://www.reddit.com/r/SonyAlpha/comments/cwnk2u/need_help_pink_spots_appearing_in_all_clips_from/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need help! pink -----> spots !!!  appearing in all clips from my sony a6500. i've seen a couple of these before but didn't think much, now there seems to be more!", "sortedWord": "None", "identifyer": 18855, "year": "2019"}, {"Unnamed: 0": 18995, "autor": "Bowlman2330", "date": 1551136078000, "content": "What do you use for cleaning the lens when the rocket blower won't? /!/ Trying to find what I can use to clean a lens that has a spot on it the rocket blower can't get.  Suggestions?", "link": "https://www.reddit.com/r/SonyAlpha/comments/aurr7q/what_do_you_use_for_cleaning_the_lens_when_the/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what do you use for cleaning the lens when the rocket blower won't? /!/ trying to find what i can use to clean a lens that has a -----> spot !!!  on it the rocket blower can't get.  suggestions?", "sortedWord": "None", "identifyer": 19303, "year": "2019"}, {"Unnamed: 0": 19123, "autor": "inthe740", "date": 1567391422000, "content": "Sensor cleaning /!/ What is the best way to clean the sensor on my A6000? I look it it and see nothing on it, take phots of pure white and don’t see anything, having said that my photos have dust spots in all the same places. Nothing I can’t clean up in photoshop but it gets old quickly.", "link": "https://www.reddit.com/r/SonyAlpha/comments/cyj464/sensor_cleaning/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "sensor cleaning /!/ what is the best way to clean the sensor on my a6000? i look it it and see nothing on it, take phots of pure white and don’t see anything, having said that my photos have dust -----> spots !!!  in all the same places. nothing i can’t clean up in photoshop but it gets old quickly.", "sortedWord": "None", "identifyer": 19434, "year": "2019"}, {"Unnamed: 0": 19770, "autor": "maxcaliburx", "date": 1551675398000, "content": "Dark Spot around the picture.. Dirty sensor or settings issue? /!/ Hi all, \n\nLet me just say I'm a new at photography, I got a sony a6000 last month. Two weeks ago I dropped my camera by accident and broke the lens. In attempt to fix the lens, I may have touched the sensor.\n\nThis week, I got new lenses, and I just realized my pictures have a dark frame around it. Here is an [album](https://imgur.com/gallery/7ZX5lEN) of what I'm talking about. Notice how in every picture, each corner has dark area. Here is a [picture](https://imgur.com/gallery/KuTFqeb) before I dropped my camera for comparison. I just ordered the cleaning kit from Amazon, and hopefully it will fixed the issue. \n\nIn the meantime, I was wondering if anyone experienced this issue before and what did you do to fix it? Thank you in advance! ", "link": "https://www.reddit.com/r/SonyAlpha/comments/ax3666/dark_spot_around_the_picture_dirty_sensor_or/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dark -----> spot !!!  around the picture.. dirty sensor or settings issue? /!/ hi all, \n\nlet me just say i'm a new at photography, i got a sony a6000 last month. two weeks ago i dropped my camera by accident and broke the lens. in attempt to fix the lens, i may have touched the sensor.\n\nthis week, i got new lenses, and i just realized my pictures have a dark frame around it. here is an [album](https://imgur.com/gallery/7zx5len) of what i'm talking about. notice how in every picture, each corner has dark area. here is a [picture](https://imgur.com/gallery/kutfqeb) before i dropped my camera for comparison. i just ordered the cleaning kit from amazon, and hopefully it will fixed the issue. \n\nin the meantime, i was wondering if anyone experienced this issue before and what did you do to fix it? thank you in advance! ", "sortedWord": "None", "identifyer": 20090, "year": "2019"}, {"Unnamed: 0": 20322, "autor": "shortforanderson", "date": 1557239959000, "content": "A Quiet Spot [a7ii||Sony 50mm f/1.8]", "link": "https://www.reddit.com/r/SonyAlpha/comments/blrhb1/a_quiet_spot_a7iisony_50mm_f18/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a quiet -----> spot !!!  [a7ii||sony 50mm f/1.8]", "sortedWord": "None", "identifyer": 20652, "year": "2019"}, {"Unnamed: 0": 20554, "autor": "jonathanhoweslego", "date": 1574609111000, "content": "Sunny spot (α7iii + Sony 28-70mm @ƒ/5 1/250 57mm ISO 200)", "link": "https://www.reddit.com/r/SonyAlpha/comments/e0zsv8/sunny_spot_α7iii_sony_2870mm_ƒ5_1250_57mm_iso_200/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sunny -----> spot !!!  (α7iii + sony 28-70mm @ƒ/5 1/250 57mm iso 200)", "sortedWord": "None", "identifyer": 20885, "year": "2019"}, {"Unnamed: 0": 20565, "autor": "herclouds", "date": 1574577012000, "content": "The Pinnacle@Duxton Skybridge shot with A7III +SEL2470GM /!/ Visited The Pinnacle@Duxton public housing in Singapore for the first time yesterday and was impressed with the breathtaking cityscape views from the 50th storey skybridge. Are you able to spot the Buddha Tooth Relic Temple in the photo?\n\n&amp;#x200B;\n\n[Aerial view of Singapore from the 50th storey skybridge of The Pinnacle@Duxton](https://preview.redd.it/9j80v00ouk041.jpg?width=3072&amp;format=pjpg&amp;auto=webp&amp;s=009649c559b30bc3de16db2621bbbf3c9913f97d)", "link": "https://www.reddit.com/r/SonyAlpha/comments/e0uydc/the_pinnacleduxton_skybridge_shot_with_a7iii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the pinnacle@duxton skybridge shot with a7iii +sel2470gm /!/ visited the pinnacle@duxton public housing in singapore for the first time yesterday and was impressed with the breathtaking cityscape views from the 50th storey skybridge. are you able to -----> spot !!!  the buddha tooth relic temple in the photo?\n\n&amp;#x200b;\n\n[aerial view of singapore from the 50th storey skybridge of the pinnacle@duxton](https://preview.redd.it/9j80v00ouk041.jpg?width=3072&amp;format=pjpg&amp;auto=webp&amp;s=009649c559b30bc3de16db2621bbbf3c9913f97d)", "sortedWord": "None", "identifyer": 20897, "year": "2019"}, {"Unnamed: 0": 21337, "autor": "RKRagan", "date": 1570763509000, "content": "X Marks the Spot // a6000, Samyang 12mm f/2", "link": "https://www.reddit.com/r/SonyAlpha/comments/dg95py/x_marks_the_spot_a6000_samyang_12mm_f2/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "x marks the -----> spot !!!  // a6000, samyang 12mm f/2", "sortedWord": "None", "identifyer": 21687, "year": "2019"}, {"Unnamed: 0": 22005, "autor": "Nightmoore", "date": 1551160595000, "content": "SD Card auto transfer device questions /!/ Ok, I swear I've googled and looked around on Amazon, but I can't find a device to do something I'm after. I want an SD card reader that can either plug into my network (or USB 3 or C if necessary), that I can just stick a SD card in and it automatically transfers all the contents onto a designated spot (preferably a specific drive on my network). If it could handle two cards at once, that would be even more amazing. Surely such a piece of hardware exists, right? Hopefully someone here knows what's up. I'm not looking for an external SSD drive with SD backup features. I just wanna walk into my little home studio after a shoot, plop the cards in and have all their content moved (or copied) with zero effort. Please tell me such sorcery exists. Thanks in advance!", "link": "https://www.reddit.com/r/SonyAlpha/comments/auvuo0/sd_card_auto_transfer_device_questions/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sd card auto transfer device questions /!/ ok, i swear i've googled and looked around on amazon, but i can't find a device to do something i'm after. i want an sd card reader that can either plug into my network (or usb 3 or c if necessary), that i can just stick a sd card in and it automatically transfers all the contents onto a designated -----> spot !!!  (preferably a specific drive on my network). if it could handle two cards at once, that would be even more amazing. surely such a piece of hardware exists, right? hopefully someone here knows what's up. i'm not looking for an external ssd drive with sd backup features. i just wanna walk into my little home studio after a shoot, plop the cards in and have all their content moved (or copied) with zero effort. please tell me such sorcery exists. thanks in advance!", "sortedWord": "None", "identifyer": 22376, "year": "2019"}, {"Unnamed: 0": 22048, "autor": "austinvegas", "date": 1549732932000, "content": "Scratched sensor (filter) on a7rii - any feedback on others repaired, NY metro local? /!/ I’ve been dealing w a small scratch on the sensor filter for some time now (editing out the shade spots) but I want to replace or upgrade.  Any feedback from anyone that’s replaced the sensor filter or replaced the sensor?  Cost? Local shops in NY metro recommendations you’ve used?  Thank you.\n\n[image of sensor scratch a7rii ](https://imgur.com/gallery/9Hkqtnq)", "link": "https://www.reddit.com/r/SonyAlpha/comments/aoubua/scratched_sensor_filter_on_a7rii_any_feedback_on/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "scratched sensor (filter) on a7rii - any feedback on others repaired, ny metro local? /!/ i’ve been dealing w a small scratch on the sensor filter for some time now (editing out the shade -----> spots !!! ) but i want to replace or upgrade.  any feedback from anyone that’s replaced the sensor filter or replaced the sensor?  cost? local shops in ny metro recommendations you’ve used?  thank you.\n\n[image of sensor scratch a7rii ](https://imgur.com/gallery/9hkqtnq)", "sortedWord": "None", "identifyer": 22419, "year": "2019"}], "name": "spotSonyAlpha2019"}