{"interestingcomments": [{"Unnamed: 0": 141394, "autor": "Ok-Active-4240", "date": 1630143656000, "content": "New features expected on A74 camera # /!/ 1) 8 or more stops of sensor stabilization. \n2) Better Autofocus features.\n3) Better recognition of subject.\n4) Two USB 3.2 ports which can be used for:\n      a) UVC video\n      b) USB LAN port\n      c) Recording to usb SSD\n      d) and other features as before\n5) Full Anamorphic support (+ 3:2 record)\n6) Full DNG support &amp; 16bit\n7) Sensor cover\n8) Built-in GPS sensor (GLONASS, GALILEO, NavIC, QZSS)\nFor Geo-Tagging and 'Find my Camera'.\n9) Atleast 4G sim support + Social Network upload &amp; A-GPS.\n10) Fingerprint sensor for unlocking or password lock on startup.\n11) Bluetooth Audio playback &amp;  mic support.\n\nMore welcome.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pd6vmc/new_features_expected_on_a74_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "new features expected on a74 camera # /!/ 1) 8 or more stops of sensor stabilization. \n2) better autofocus features.\n3) better recognition of subject.\n4) two usb 3.2 ports which can be used for:\n      a) uvc video\n      b) usb lan port\n      c) recording to usb ssd\n      d) and other features as before\n5) full anamorphic support (+ 3:2 record)\n6) full dng support &amp; 16bit\n7) sensor cover\n8) built-in gps sensor (glonass, galileo, navic, qzss)\nfor geo------> tagging !!!  and 'find my camera'.\n9) atleast 4g sim support + social network upload &amp; a-gps.\n10) fingerprint sensor for unlocking or password lock on startup.\n11) bluetooth audio playback &amp;  mic support.\n\nmore welcome.", "sortedWord": "None", "identifyer": 32355, "year": "2021"}, {"Unnamed: 0": 141907, "autor": "hoofit", "date": 1635477532000, "content": "Sony A7iii | Sigma 35mm F2 /!/ I recently joined the Sony full frame club with an A7iii. My original post to this subreddit was vaguely illegal (tagging art) so I deleted it. Here's my second try. I think this is a better capture anyhow. I'm blown away with this camera so far. Why did I wait so long to upgrade?\n\nhttps://preview.redd.it/89hggk1i3bw71.jpg?width=3968&amp;format=pjpg&amp;auto=webp&amp;s=5659be984506d04eadd3ba527a150feae2b1e9ea", "link": "https://www.reddit.com/r/SonyAlpha/comments/qi3hve/sony_a7iii_sigma_35mm_f2/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "sony a7iii | sigma 35mm f2 /!/ i recently joined the sony full frame club with an a7iii. my original post to this subreddit was vaguely illegal (-----> tagging !!!  art) so i deleted it. here's my second try. i think this is a better capture anyhow. i'm blown away with this camera so far. why did i wait so long to upgrade?\n\nhttps://preview.redd.it/89hggk1i3bw71.jpg?width=3968&amp;format=pjpg&amp;auto=webp&amp;s=5659be984506d04eadd3ba527a150feae2b1e9ea", "sortedWord": "None", "identifyer": 32882, "year": "2021"}, {"Unnamed: 0": 148771, "autor": "nataphoto", "date": 1630844759000, "content": "How to use FTP transfer reliably on iPhone /!/ I've been struggling with the Transfer &amp; Tagging app, because the FTP transfer via iPhone hotspot is worthless. The problem lies in the fact that the iPhone, by design, cuts off the hotspot when no devices connect to it for longer than 90 seconds. That means if the camera sleeps, your Wi-Fi connection dies, and when it tries to reconnect, the hotspot is dead.\n\nSo what is the solution here - you connect by wireless access point instead. There are a couple methods.\n\nMethod 1: Get a battery powered router and a power bank. Connect both phone and camera to the AP, use T&amp;T as intended. Fine, but that's a lot of stuff to carry.\n\nMethod 2: Get a wireless hard drive. I use the WD My Passport Wireless SSD. This drive has a built-in AP, and while you can use the drive's built in FTP server to offload files to the hard drive, I actually find it's easier to just use the AP functionality to just offload photos directly to the phone via Transfer &amp; Tagging. From there you can export to your drive if you want the backup..\n\nInstructions for using the WD FTP functionality with Sony are [here](https://www.dpreview.com/forums/thread/4540213), by the way.\n\nWhat you do once the files are on your phone is your choice, of course. You can send them to an editor, put them on your computer (I use google drive to sync a folder on my computer), or just add them to Photos. I hope this helps someone with this issue.", "link": "https://www.reddit.com/r/SonyAlpha/comments/pic6i1/how_to_use_ftp_transfer_reliably_on_iphone/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "how to use ftp transfer reliably on iphone /!/ i've been struggling with the transfer &amp; -----> tagging !!!  app, because the ftp transfer via iphone hotspot is worthless. the problem lies in the fact that the iphone, by design, cuts off the hotspot when no devices connect to it for longer than 90 seconds. that means if the camera sleeps, your wi-fi connection dies, and when it tries to reconnect, the hotspot is dead.\n\nso what is the solution here - you connect by wireless access point instead. there are a couple methods.\n\nmethod 1: get a battery powered router and a power bank. connect both phone and camera to the ap, use t&amp;t as intended. fine, but that's a lot of stuff to carry.\n\nmethod 2: get a wireless hard drive. i use the wd my passport wireless ssd. this drive has a built-in ap, and while you can use the drive's built in ftp server to offload files to the hard drive, i actually find it's easier to just use the ap functionality to just offload photos directly to the phone via transfer &amp; tagging. from there you can export to your drive if you want the backup..\n\ninstructions for using the wd ftp functionality with sony are [here](https://www.dpreview.com/forums/thread/4540213), by the way.\n\nwhat you do once the files are on your phone is your choice, of course. you can send them to an editor, put them on your computer (i use google drive to sync a folder on my computer), or just add them to photos. i hope this helps someone with this issue.", "sortedWord": "None", "identifyer": 40001, "year": "2021"}], "name": "taggingSonyAlpha2021"}