{"interestingcomments": [{"Unnamed: 0": 4189, "autor": "assire2", "date": 1566586454000, "content": "[Need advice] A7II with canon-based adapted lenses? /!/ Currently I have Nikon D610 and few lenses for that and I'm thinking about selling all my Nikon stuff and buying used A7II. I'm thinking about Canon lenses, only because they are pretty much dirt cheap here (used ofc), and with some luck I'm able to get my hands on better setup than I have right now and that would be Tokina 16-28 2.8, Canons 35/2, 50/1.4, 85/1.8.  \nBut I'm kinda unsure about having only non-native lenses. Adapter I would be going for is Commlite EF-E HS as I have seen some favourable tests on Youtube, and it seems to be working very good with reasonable price tag.  \n\n\nAnyone here that is using something similar? Is it even a good idea?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cui6ql/need_advice_a7ii_with_canonbased_adapted_lenses/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "[need advice] a7ii with canon-based adapted lenses? /!/ currently i have nikon d610 and few lenses for that and i'm thinking about selling all my nikon stuff and buying used a7ii. i'm thinking about canon lenses, only because they are pretty much dirt cheap here (used ofc), and with some luck i'm able to get my hands on better setup than i have right now and that would be tokina 16-28 2.8, canons 35/2, 50/1.4, 85/1.8.  \nbut i'm kinda unsure about having only non-native lenses. adapter i would be going for is commlite ef-e hs as i have seen some favourable tests on youtube, and it seems to be working very good with reasonable price -----> tag !!! .  \n\n\nanyone here that is using something similar? is it even a good idea?", "sortedWord": "None", "identifyer": 4232, "year": "2019"}, {"Unnamed: 0": 4440, "autor": "th3edst3r", "date": 1558577024000, "content": "100-400 GM + A7iii. Rented this sucker today and wow. The GM tag lives up to its name. Rapid fast autofocus in both video and photo. I really need a lens that is GM! Thankfully the 24mm isn’t in stock anywhere near me or else I’d be in debt!", "link": "https://www.reddit.com/r/SonyAlpha/comments/brxgmj/100400_gm_a7iii_rented_this_sucker_today_and_wow/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "100-400 gm + a7iii. rented this sucker today and wow. the gm -----> tag !!!  lives up to its name. rapid fast autofocus in both video and photo. i really need a lens that is gm! thankfully the 24mm isn’t in stock anywhere near me or else i’d be in debt!", "sortedWord": "None", "identifyer": 4487, "year": "2019"}, {"Unnamed: 0": 6194, "autor": "kaayrs", "date": 1550816100000, "content": "Rokinon 21mm f1.4 or Rokinon 12mm f2.0 /!/ After years of wanting a nice camera, I finally bought an a6000.  Once I got the camera home it dawned on me; I spent all that time daydreaming about owning a nice camera, without ever considering all the different lenses (and their price tag!).   \nNature landscapes and the night sky have been the driving force in my desire to bridge over from cellphone camera to couple hundred dollar camera. When I realized I would need a different lens for that I began my research. I have read great things about both  the f1.4 and f2.0, I've also read some not so great things. I was hoping someone here could point me in the right direction.   \nIt is my understanding the 21 mm is more difficult to bring into focus than the 12mm on the lower settings. Can anyone tell me how much more difficult it is? I was leaning towards the 21 mm until I read that, now I am unsure. I love the way the lens captures the night sky, but don't love the idea of a $400 dollar paperweight.  I would prefer the get a lens I will not want to upgrade after the first year, which I am afraid will happen if I got the 12mm. Does anyone have any experience with both of these lenses? Am I biting off more than I can chew wanting to learn on the 21?\n\nI also wanted opinions from someone that has shot their nature landscapes with the 21mm. Is that an okay lens to use or is there a different one I should check out?   \n\n\nThank you if you read the entire post, I am sorry it was so long. ", "link": "https://www.reddit.com/r/SonyAlpha/comments/ate0ft/rokinon_21mm_f14_or_rokinon_12mm_f20/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "rokinon 21mm f1.4 or rokinon 12mm f2.0 /!/ after years of wanting a nice camera, i finally bought an a6000.  once i got the camera home it dawned on me; i spent all that time daydreaming about owning a nice camera, without ever considering all the different lenses (and their price -----> tag !!! !).   \nnature landscapes and the night sky have been the driving force in my desire to bridge over from cellphone camera to couple hundred dollar camera. when i realized i would need a different lens for that i began my research. i have read great things about both  the f1.4 and f2.0, i've also read some not so great things. i was hoping someone here could point me in the right direction.   \nit is my understanding the 21 mm is more difficult to bring into focus than the 12mm on the lower settings. can anyone tell me how much more difficult it is? i was leaning towards the 21 mm until i read that, now i am unsure. i love the way the lens captures the night sky, but don't love the idea of a $400 dollar paperweight.  i would prefer the get a lens i will not want to upgrade after the first year, which i am afraid will happen if i got the 12mm. does anyone have any experience with both of these lenses? am i biting off more than i can chew wanting to learn on the 21?\n\ni also wanted opinions from someone that has shot their nature landscapes with the 21mm. is that an okay lens to use or is there a different one i should check out?   \n\n\nthank you if you read the entire post, i am sorry it was so long. ", "sortedWord": "None", "identifyer": 6260, "year": "2019"}, {"Unnamed: 0": 6534, "autor": "Hempyyy", "date": 1552663125000, "content": "A canon to Sony question /!/ Alright, im in a predicament. I cannot make up my mind, so here is a backstory.\n\nMy wife has done wedding photography for about a year, she has an incredible eye, but doesn't do a lot of research. That's me, im always the one looking at what to buy next and learning how everything works.\n\nLast Oct we upgraded her from a Canon Rebel t6i to a 5DMK4. The MK4 is impressive lol\n\nshe shoots on a Sigma 35 1.4 and we are about to invest in a 24-70 that will be a canon mount.\n\nSo here is the problem, iv always wanted to get into the video side of things, and she let me tag along for a 2 weddings last month. I used the Rebel t6i, and it was absolutely terrible. Granted, my lens choise wasn't great either as she shot with the 35mm and I shot with a cheap 40mm 2.8, but it really sucked after the ceremony. So we have decided to upgrade the back up camera to a better video camera.\n\nIv been looking hard at the Sony a7rii and the A7sii\n\nI think I like the a7rii better, because I would be using canon glass and it seems to autofocus better with the adapter. The a7sii would be ideal because a lot of the venues we shoot at are kind of dark.\n\nThat's my dilemma. Am I looking too narrowly at these 2 cameras? Are there Canon cameras that compete with these with video? Do the Panasonics work better than Sony with Cannon glass?\n\nI need advice lol\n\nBudge is about $1500, I have found a A7rii with metabones 4 for $1500 locally. IV found a A7sii locally for $1300\n\nThanks everyone!", "link": "https://www.reddit.com/r/SonyAlpha/comments/b1g5w0/a_canon_to_sony_question/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a canon to sony question /!/ alright, im in a predicament. i cannot make up my mind, so here is a backstory.\n\nmy wife has done wedding photography for about a year, she has an incredible eye, but doesn't do a lot of research. that's me, im always the one looking at what to buy next and learning how everything works.\n\nlast oct we upgraded her from a canon rebel t6i to a 5dmk4. the mk4 is impressive lol\n\nshe shoots on a sigma 35 1.4 and we are about to invest in a 24-70 that will be a canon mount.\n\nso here is the problem, iv always wanted to get into the video side of things, and she let me -----> tag !!!  along for a 2 weddings last month. i used the rebel t6i, and it was absolutely terrible. granted, my lens choise wasn't great either as she shot with the 35mm and i shot with a cheap 40mm 2.8, but it really sucked after the ceremony. so we have decided to upgrade the back up camera to a better video camera.\n\niv been looking hard at the sony a7rii and the a7sii\n\ni think i like the a7rii better, because i would be using canon glass and it seems to autofocus better with the adapter. the a7sii would be ideal because a lot of the venues we shoot at are kind of dark.\n\nthat's my dilemma. am i looking too narrowly at these 2 cameras? are there canon cameras that compete with these with video? do the panasonics work better than sony with cannon glass?\n\ni need advice lol\n\nbudge is about $1500, i have found a a7rii with metabones 4 for $1500 locally. iv found a a7sii locally for $1300\n\nthanks everyone!", "sortedWord": "None", "identifyer": 6603, "year": "2019"}, {"Unnamed: 0": 10148, "autor": "robvann", "date": 1573784313000, "content": "A6400 Bluetooth to iPhone7 - does it work? /!/ Are there any \"tricks\" to get the Sony A6400 to pair by bluetooth to an iPhone 7 (ios 13.x)?\n\nI put the camera into pairing mode, and then search on the iPhone, but it doesn't show it.  If I search for bluetooth with my windows PC, it \"sees\" the camera's bluetooth tag (ILCE-6400)", "link": "https://www.reddit.com/r/SonyAlpha/comments/dwk0hr/a6400_bluetooth_to_iphone7_does_it_work/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a6400 bluetooth to iphone7 - does it work? /!/ are there any \"tricks\" to get the sony a6400 to pair by bluetooth to an iphone 7 (ios 13.x)?\n\ni put the camera into pairing mode, and then search on the iphone, but it doesn't show it.  if i search for bluetooth with my windows pc, it \"sees\" the camera's bluetooth -----> tag !!!  (ilce-6400)", "sortedWord": "None", "identifyer": 10284, "year": "2019"}, {"Unnamed: 0": 12418, "autor": "Awildibex", "date": 1560837922000, "content": "A6300, SEL50 and SEL35? /!/ Hey folks! I know there's a lot of posts similar to this, but maybe you can help solve my dilemma!\n\nI currently own two lenses for my a6300. One is the 18-135 kit lens, and the other is the SEL50. I love the 50 for outdoor portraits and all the benefits of a prime lens. The kit lens is okay, but it's hard to go back after using a prime!\n\nI spend a lot of time in the outdoors climbing and mountaineering, and I've recently been thinking of getting the 35mm to go along with the 50 to take some slightly wider shots.\n\nMy question is, do you folks think there's a big enough gap between the 50 and 35 to justify the price tag? Or should I just step a few feet back like I've currently been doing? (This can be difficult when roped up on rock or glacier!)\n\nAs for other options, I do a lot of video so I've ruled out the 30mm sigma. The 24mm Zeiss seems like the perfect jump, but there's no way I can fork up that much money. Is the 20mm Sony a good lens? Is it sharp and can I get a bokeh effect out of it if needed? I don't know if I'd want to go any wider than that. I'd love to take some shots with my fellow climbers/rope team as the foreground and midground with the mountains behind. \n\nHopefully you folks with more experience can help me make up my indecisive mind!", "link": "https://www.reddit.com/r/SonyAlpha/comments/c1yke8/a6300_sel50_and_sel35/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a6300, sel50 and sel35? /!/ hey folks! i know there's a lot of posts similar to this, but maybe you can help solve my dilemma!\n\ni currently own two lenses for my a6300. one is the 18-135 kit lens, and the other is the sel50. i love the 50 for outdoor portraits and all the benefits of a prime lens. the kit lens is okay, but it's hard to go back after using a prime!\n\ni spend a lot of time in the outdoors climbing and mountaineering, and i've recently been thinking of getting the 35mm to go along with the 50 to take some slightly wider shots.\n\nmy question is, do you folks think there's a big enough gap between the 50 and 35 to justify the price -----> tag !!! ? or should i just step a few feet back like i've currently been doing? (this can be difficult when roped up on rock or glacier!)\n\nas for other options, i do a lot of video so i've ruled out the 30mm sigma. the 24mm zeiss seems like the perfect jump, but there's no way i can fork up that much money. is the 20mm sony a good lens? is it sharp and can i get a bokeh effect out of it if needed? i don't know if i'd want to go any wider than that. i'd love to take some shots with my fellow climbers/rope team as the foreground and midground with the mountains behind. \n\nhopefully you folks with more experience can help me make up my indecisive mind!", "sortedWord": "None", "identifyer": 12587, "year": "2019"}, {"Unnamed: 0": 12719, "autor": "anyannyan", "date": 1559092894000, "content": "Need Upgrade Advice For A5100. APS-C or Full-Frame? /!/ I have had an A5100 with the two kit lenses (Sony E PZ 16-50mm f/3.5-5.6 OSS Lens and Sony E 55-210mm f/4.5-6.3 OSS Lens) for the past couple years.  I mainly take vacation photos (landscape/buildings and historical sights/interior of cathedrals).  I really like the compactness and lightness of the kit, which is perfect for walking, but I am finding it has limitations that are annoying me.  I'm having a hard time getting good photos in evening/night as everything comes out blurry and poorly defined when shooting hand-held.  My wife's iPhone X pictures come out crystal clear.  I also don't like the lack of viewfinder in combination with a fairly low-res back screen so it is hard to see if I have things set right.  The controls are also hidden behind menus that I'd love custom buttons for, as I feel like I spend too much time clicking through menus and not enough looking at what I traveled to see.\n\nRealistically my budget is about $1500 total, but I can stretch it and I definitely feel the siren call of the A7 III which seems to do everything about as perfectly as you can get.  So I'd like help from the community evaluating my options\n\nOption 1:  Go Full Frame and upgrade to A7II\nRealistically, $1200-2000 depending on which lenses I get.  I'd probably get the a Sony FE 50mm f/1.8 Prime and use either the kit lens or a Tamron 28-75mm f/2.8 or wait for the Tamron 17-28mm f/2.8 for wide-angle.  A7 II has never been cheaper and would be a big upgrade in terms of low-light performance, and the 50mm would help with that too.  The problems I can see is that it's not very compact or light compared to the A5100, meaning it will be hard on my neck/shoulder walking with it all day for a week on vacation, and it wouldn't be easily concealed when walking from place to place.  I like being able to carry the A5100 in an interior coat pocket and being able to quickly pull it out for a shot before hiding it away again.  \n\nOption 1a: Just bite the bullet and get an A7 III (same lenses).\nIt looks like the A7 III does everything the A7 II does, and better.  It should be my camera for quite a few years, but looking at a $3000+ price tag with the new lenses really makes me squeamish.  \n\nOption 2: Upgrade APS-C lens only\nI'd just get a Sony SEL35F18 35mm f/1.8 Prime ($400), and maybe a Sony E 10-18mm F4 OSS ($750), and drop the 16-50mm lens.  That would help with low-light photography, but I don't know if the A5100 is maxing out using the kit lens.  Advantage, cheapest and smallest option, but wouldn't help with my annoyances with the camera UX.  \n\nOption 3: Upgrade to A6500 and add a SEL35F18 lens.\nCost is about $1500, A6500 has better auto-focus, slightly better dynamic range/iso, has a viewfinder, bluetooth, and extra custom buttons/UX improvements.  Not exactly future-proof since I keep seeing rumors about a new A6500 replacement and I don't want to get another camera in another couple of years at these prices.\n\n\nDoes anyone have advice in evaluating these options (especially FF vs APS-C) for someone who is hobbyist-level?\n\nBonus question:  Am I correct in saying that if you set up a full-frame Sony with a 30mm lens and an APS-C Sony with a 20mm lens, you would get the same view due to the crop factor?", "link": "https://www.reddit.com/r/SonyAlpha/comments/bu8ert/need_upgrade_advice_for_a5100_apsc_or_fullframe/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "need upgrade advice for a5100. aps-c or full-frame? /!/ i have had an a5100 with the two kit lenses (sony e pz 16-50mm f/3.5-5.6 oss lens and sony e 55-210mm f/4.5-6.3 oss lens) for the past couple years.  i mainly take vacation photos (landscape/buildings and historical sights/interior of cathedrals).  i really like the compactness and lightness of the kit, which is perfect for walking, but i am finding it has limitations that are annoying me.  i'm having a hard time getting good photos in evening/night as everything comes out blurry and poorly defined when shooting hand-held.  my wife's iphone x pictures come out crystal clear.  i also don't like the lack of viewfinder in combination with a fairly low-res back screen so it is hard to see if i have things set right.  the controls are also hidden behind menus that i'd love custom buttons for, as i feel like i spend too much time clicking through menus and not enough looking at what i traveled to see.\n\nrealistically my budget is about $1500 total, but i can stretch it and i definitely feel the siren call of the a7 iii which seems to do everything about as perfectly as you can get.  so i'd like help from the community evaluating my options\n\noption 1:  go full frame and upgrade to a7ii\nrealistically, $1200-2000 depending on which lenses i get.  i'd probably get the a sony fe 50mm f/1.8 prime and use either the kit lens or a tamron 28-75mm f/2.8 or wait for the tamron 17-28mm f/2.8 for wide-angle.  a7 ii has never been cheaper and would be a big upgrade in terms of low-light performance, and the 50mm would help with that too.  the problems i can see is that it's not very compact or light compared to the a5100, meaning it will be hard on my neck/shoulder walking with it all day for a week on vacation, and it wouldn't be easily concealed when walking from place to place.  i like being able to carry the a5100 in an interior coat pocket and being able to quickly pull it out for a shot before hiding it away again.  \n\noption 1a: just bite the bullet and get an a7 iii (same lenses).\nit looks like the a7 iii does everything the a7 ii does, and better.  it should be my camera for quite a few years, but looking at a $3000+ price -----> tag !!!  with the new lenses really makes me squeamish.  \n\noption 2: upgrade aps-c lens only\ni'd just get a sony sel35f18 35mm f/1.8 prime ($400), and maybe a sony e 10-18mm f4 oss ($750), and drop the 16-50mm lens.  that would help with low-light photography, but i don't know if the a5100 is maxing out using the kit lens.  advantage, cheapest and smallest option, but wouldn't help with my annoyances with the camera ux.  \n\noption 3: upgrade to a6500 and add a sel35f18 lens.\ncost is about $1500, a6500 has better auto-focus, slightly better dynamic range/iso, has a viewfinder, bluetooth, and extra custom buttons/ux improvements.  not exactly future-proof since i keep seeing rumors about a new a6500 replacement and i don't want to get another camera in another couple of years at these prices.\n\n\ndoes anyone have advice in evaluating these options (especially ff vs aps-c) for someone who is hobbyist-level?\n\nbonus question:  am i correct in saying that if you set up a full-frame sony with a 30mm lens and an aps-c sony with a 20mm lens, you would get the same view due to the crop factor?", "sortedWord": "None", "identifyer": 12892, "year": "2019"}, {"Unnamed: 0": 15319, "autor": "fmmalenda", "date": 1575409683000, "content": "Used a64000 for $400 /!/ I'm looking to purchase my first mirrorless camera and was looking into the a6400. I found someone selling a used one for $400. What should I look into before purchasing? It seems like a low price tag compared to what I've seen sold, so I'm a bit skeptical.", "link": "https://www.reddit.com/r/SonyAlpha/comments/e5oasw/used_a64000_for_400/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "used a64000 for $400 /!/ i'm looking to purchase my first mirrorless camera and was looking into the a6400. i found someone selling a used one for $400. what should i look into before purchasing? it seems like a low price -----> tag !!!  compared to what i've seen sold, so i'm a bit skeptical.", "sortedWord": "None", "identifyer": 15549, "year": "2019"}, {"Unnamed: 0": 19515, "autor": "Delcarab", "date": 1565207032000, "content": "Been asked way too many times, but A600 or A6300 /!/ Hi so I have started to take interest into photography again. I have a Nikon D90 with an AF-S Nikkor 18-105mm f/3.5-5.6G ED VR, AF-S Nikkor 24-70mm F2.8G ED, and a AF-S Nikkor 70-30mm f/4.5-5.6G ED VR. \n\nRight now I am looking for a camera that isn’t too heavy as I am going to Europe next week. I have heard many great things about the alpha series and I was wondering if I should get the a6000 or a6300 for my trip both with the stater kit. With the a6300 I do get a bonus battery and case.\n\nI don’t shoot video too often so I know the 4K won’t be a deal breaker, however I was wondering if the focal points and build quality is worth the higher price tag. \n\nAlso is there any way to use my current lenses on Sony alpha series if so how?", "link": "https://www.reddit.com/r/SonyAlpha/comments/cnakyi/been_asked_way_too_many_times_but_a600_or_a6300/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "been asked way too many times, but a600 or a6300 /!/ hi so i have started to take interest into photography again. i have a nikon d90 with an af-s nikkor 18-105mm f/3.5-5.6g ed vr, af-s nikkor 24-70mm f2.8g ed, and a af-s nikkor 70-30mm f/4.5-5.6g ed vr. \n\nright now i am looking for a camera that isn’t too heavy as i am going to europe next week. i have heard many great things about the alpha series and i was wondering if i should get the a6000 or a6300 for my trip both with the stater kit. with the a6300 i do get a bonus battery and case.\n\ni don’t shoot video too often so i know the 4k won’t be a deal breaker, however i was wondering if the focal points and build quality is worth the higher price -----> tag !!! . \n\nalso is there any way to use my current lenses on sony alpha series if so how?", "sortedWord": "None", "identifyer": 19832, "year": "2019"}, {"Unnamed: 0": 20527, "autor": "nrmitchell25", "date": 1574635831000, "content": "Sony a6500 vs Sony a7ii /!/ Don’t know what tag to use as this is my first time on this reddit wondering what people’s input is on what is a better buy because I’m looking to purchase one of these two and don’t know what I should get. Also is it worth spending the extra to try and get something like a Sony a7rii. Any help is greatly appreciated :)\n\nPs. Everyone’s images on this reddit are crazy good", "link": "https://www.reddit.com/r/SonyAlpha/comments/e16b1r/sony_a6500_vs_sony_a7ii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony a6500 vs sony a7ii /!/ don’t know what -----> tag !!!  to use as this is my first time on this reddit wondering what people’s input is on what is a better buy because i’m looking to purchase one of these two and don’t know what i should get. also is it worth spending the extra to try and get something like a sony a7rii. any help is greatly appreciated :)\n\nps. everyone’s images on this reddit are crazy good", "sortedWord": "None", "identifyer": 20858, "year": "2019"}, {"Unnamed: 0": 20902, "autor": "havvat", "date": 1575558880000, "content": "Should I go for the Sony 18-105mm or 16-50mm /!/ My camera (A6300) fell on the floor last Sunday. The camera itself didn't leave a scratch, while my 16-50mm kit lens was damaged. It won't be registered by my camera, in other words useless.\nSo I need a new lens, and I was wondering if I should go for the Sony 18-105mm F4 (which gives me the whole range) or fo for the Standard Kit lens 16-50mm once again\nThe reason why I would choose my kit lens over the 105mm is because it will save me almost 2 thirds of the price tag, and I don't know how much better the 18-105mm really is.\n\nIf there is no large difference, then I'll go for the kit lens, if there is a large one, then I'll go with the  18-105\n\nNow, I'm using my lenses for both video and photography\n(BTW I already own a 55-210mm, F4.5 - 6.5)\n\nWhich one would you recommend?\n I'm gonna buy a prime lens soon as well", "link": "https://www.reddit.com/r/SonyAlpha/comments/e6iinf/should_i_go_for_the_sony_18105mm_or_1650mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "should i go for the sony 18-105mm or 16-50mm /!/ my camera (a6300) fell on the floor last sunday. the camera itself didn't leave a scratch, while my 16-50mm kit lens was damaged. it won't be registered by my camera, in other words useless.\nso i need a new lens, and i was wondering if i should go for the sony 18-105mm f4 (which gives me the whole range) or fo for the standard kit lens 16-50mm once again\nthe reason why i would choose my kit lens over the 105mm is because it will save me almost 2 thirds of the price -----> tag !!! , and i don't know how much better the 18-105mm really is.\n\nif there is no large difference, then i'll go for the kit lens, if there is a large one, then i'll go with the  18-105\n\nnow, i'm using my lenses for both video and photography\n(btw i already own a 55-210mm, f4.5 - 6.5)\n\nwhich one would you recommend?\n i'm gonna buy a prime lens soon as well", "sortedWord": "None", "identifyer": 21241, "year": "2019"}], "name": "tagSonyAlpha2019"}