{"interestingcomments": [{"Unnamed: 0": 33504, "autor": "The_only_h", "date": 1596546482000, "content": "recommendation on Sony mirrorless /!/ Hi everyone. \n\nI am hoping that you guys will be able to provide some guidance.\n\nI have been using a Sony Nex-7 and looking to upgrade my camera this year or next year. I would prefer to stay with Sony as I already have a few lenses (all APS-C).\n\nLast year I tried out for a few weeks the A6400 and although it was good, I felt some the transfer (WIFI) to a Mac or to a phone was very clunky. I felt like what I was getting was not necessarily much better than what I had with my current camera and did not justify the price tag.\n\nI am now looking at the A7III or maybe the A6600 ? I assume the software will be similar to the A6400 so for those that own those cameras, how is the transfer using wifi ? \n\nIs there any rumours of a new version for the A7III ? What other camera in the Sony range would you recommend ? I mostly shoot stills.\n\nThanks for the help", "link": "https://www.reddit.com/r/SonyAlpha/comments/i3iznv/recommendation_on_sony_mirrorless/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "recommendation on sony mirrorless /!/ hi everyone. \n\ni am hoping that you guys will be able to provide some guidance.\n\ni have been using a sony nex-7 and looking to upgrade my camera this year or next year. i would prefer to stay with sony as i already have a few lenses (all aps-c).\n\nlast year i tried out for a few weeks the a6400 and although it was good, i felt some the transfer (wifi) to a mac or to a phone was very clunky. i felt like what i was getting was not necessarily much better than what i had with my current camera and did not justify the price -----> tag !!! .\n\ni am now looking at the a7iii or maybe the a6600 ? i assume the software will be similar to the a6400 so for those that own those cameras, how is the transfer using wifi ? \n\nis there any rumours of a new version for the a7iii ? what other camera in the sony range would you recommend ? i mostly shoot stills.\n\nthanks for the help", "sortedWord": "None", "identifyer": 34216, "year": "2020"}, {"Unnamed: 0": 37073, "autor": "cow_panda", "date": 1599474799000, "content": "Camera cleaning is it free? /!/ Hello guys, I have a Sony a7iii which I brought during my vacation in India and Nepal last March 2020. I was caught during the pandemic and was stuck in Nepal for 4 months because of lockdown. I was able to do one trek before the police bring us back to the city (Kathmandu). The highest point in the trek is 5400m+ and I use my camera taking pictures. My camera collect lots of dust already. So when I came back to my country via repatriation flight. I went to a Sony service center and ask them to clean my camera because I came overseas and want to make sure that the dust or dirt are remove. They ask me if only cleaning and I said yes. Now they will clean it but tagged it as \"OUT OF WARRANTY\". I was confuse why they would tagged it as out of warranty when it has a warranty. They told me that only repairs are with warranty. I look at the warranty information and it states there that service and labor is free if within warranty. Can you guys confirm it with your experience? I ask them to give me a notice or note stating that cleaning alone is not part of the warranty, they can't provide. I emailed Sony Japan but no reply yet. I want to know if this is a global procedure or just a gimmick to them to milk the cow.", "link": "https://www.reddit.com/r/SonyAlpha/comments/io54rp/camera_cleaning_is_it_free/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "camera cleaning is it free? /!/ hello guys, i have a sony a7iii which i brought during my vacation in india and nepal last march 2020. i was caught during the pandemic and was stuck in nepal for 4 months because of lockdown. i was able to do one trek before the police bring us back to the city (kathmandu). the highest point in the trek is 5400m+ and i use my camera taking pictures. my camera collect lots of dust already. so when i came back to my country via repatriation flight. i went to a sony service center and ask them to clean my camera because i came overseas and want to make sure that the dust or dirt are remove. they ask me if only cleaning and i said yes. now they will clean it but -----> tagged !!!  it as \"out of warranty\". i was confuse why they would tagged it as out of warranty when it has a warranty. they told me that only repairs are with warranty. i look at the warranty information and it states there that service and labor is free if within warranty. can you guys confirm it with your experience? i ask them to give me a notice or note stating that cleaning alone is not part of the warranty, they can't provide. i emailed sony japan but no reply yet. i want to know if this is a global procedure or just a gimmick to them to milk the cow.", "sortedWord": "None", "identifyer": 37871, "year": "2020"}, {"Unnamed: 0": 40036, "autor": "brian_m1982", "date": 1593113878000, "content": "Gear advice on a macro adapter /!/ Hello all:\nJust hoping someone can point me in a direction i haven't doing yet. I started out with a 3 alpha, but a few years back watched to the Nex-7. Off and on, I've been looking for a reverse autofocus adapter.  It seems that Nikon, Canon, and everyone else had one. A couple years back, Novoflex came out with one, but for the 400+ price tag, i might as well purchase a dedicated macro lens, which is by something I'm looking to do at this time. I'm just wondering if anyone out there has find a cheaper option for a reverse autofocus adapter for a Sony e- mount. Or has a way to diy one. Thank you all.", "link": "https://www.reddit.com/r/SonyAlpha/comments/hfslo1/gear_advice_on_a_macro_adapter/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "gear advice on a macro adapter /!/ hello all:\njust hoping someone can point me in a direction i haven't doing yet. i started out with a 3 alpha, but a few years back watched to the nex-7. off and on, i've been looking for a reverse autofocus adapter.  it seems that nikon, canon, and everyone else had one. a couple years back, novoflex came out with one, but for the 400+ price -----> tag !!! , i might as well purchase a dedicated macro lens, which is by something i'm looking to do at this time. i'm just wondering if anyone out there has find a cheaper option for a reverse autofocus adapter for a sony e- mount. or has a way to diy one. thank you all.", "sortedWord": "None", "identifyer": 40910, "year": "2020"}, {"Unnamed: 0": 41410, "autor": "NickSweetwater", "date": 1589264304000, "content": "Found a pretty good deal on an A7riv, wondering if it’s worth pulling the trigger on? /!/ I’m assuming this is the correct place to post this? If not I apologize. \n\nSo I’m actually outside the US and came across an A7riv body with the Sony FE 24-200mm F 3.5-6.3 OSS Lens today. All in it would be $4,210. \n\nI’ve been wanting this camera for a while but with the hefty price tag I’ve been hesitant. I’m also worried about the announcement of the A7iv possibly right around the corner which would save me a significant amount of money that could be put towards another lens. Just curious what everyone’s thoughts are!", "link": "https://www.reddit.com/r/SonyAlpha/comments/gi5j9t/found_a_pretty_good_deal_on_an_a7riv_wondering_if/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "found a pretty good deal on an a7riv, wondering if it’s worth pulling the trigger on? /!/ i’m assuming this is the correct place to post this? if not i apologize. \n\nso i’m actually outside the us and came across an a7riv body with the sony fe 24-200mm f 3.5-6.3 oss lens today. all in it would be $4,210. \n\ni’ve been wanting this camera for a while but with the hefty price -----> tag !!!  i’ve been hesitant. i’m also worried about the announcement of the a7iv possibly right around the corner which would save me a significant amount of money that could be put towards another lens. just curious what everyone’s thoughts are!", "sortedWord": "None", "identifyer": 42332, "year": "2020"}, {"Unnamed: 0": 41924, "autor": "InsightsIE", "date": 1595459631000, "content": "Should I buy an A7sII at steep discount (for video) /!/ Hey there,\n\nI was offered an A7SII and a bunch of batteries for about £900 Pounds and I was wondering if I should take it. We all know the A7SIII is coming but with a price tag of €4000 that is out of my budget and I want to spend some money on getting really nice glass for my setup, almost like allocating £1000 for a body and £1000 for killer glass.\n\nMy use is for Video, usually for big shoots I rent an ARRI ALEXA but I want to upgrade my kit for YouTube where I'm actually using my... iPhone of all things so no matter what it'll be a big upgrade.\n\nAlthough I'm reading the A7SII probably wont get anymore updates so should I get the A7III instead because Sony is still going to be selling that probably for a few more years. Auto focus would be a really nice feature and I hear the A7SII isn't great at that. I did see an A7III that comes with a 28-70 kit lens for £1350, I suppose in time I could dump that glass and get something nicer.\n\n&amp;#x200B;\n\nWhat direction would folks here go if it was primarily for video but not special enough video I'd rent a big camera (and therefore a crew)", "link": "https://www.reddit.com/r/SonyAlpha/comments/hw4g74/should_i_buy_an_a7sii_at_steep_discount_for_video/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "should i buy an a7sii at steep discount (for video) /!/ hey there,\n\ni was offered an a7sii and a bunch of batteries for about £900 pounds and i was wondering if i should take it. we all know the a7siii is coming but with a price -----> tag !!!  of €4000 that is out of my budget and i want to spend some money on getting really nice glass for my setup, almost like allocating £1000 for a body and £1000 for killer glass.\n\nmy use is for video, usually for big shoots i rent an arri alexa but i want to upgrade my kit for youtube where i'm actually using my... iphone of all things so no matter what it'll be a big upgrade.\n\nalthough i'm reading the a7sii probably wont get anymore updates so should i get the a7iii instead because sony is still going to be selling that probably for a few more years. auto focus would be a really nice feature and i hear the a7sii isn't great at that. i did see an a7iii that comes with a 28-70 kit lens for £1350, i suppose in time i could dump that glass and get something nicer.\n\n&amp;#x200b;\n\nwhat direction would folks here go if it was primarily for video but not special enough video i'd rent a big camera (and therefore a crew)", "sortedWord": "None", "identifyer": 42864, "year": "2020"}, {"Unnamed: 0": 44899, "autor": "microcells", "date": 1608933402000, "content": "Beginner lens choice for APS-C ? /!/ Hi guy’s as a Christmas gift I got a great amount of money, around 940€, and I wanted to get my hands on some sweet photography gear. I got my eyes on the a6100 but the big price tag makes me wonder if it isn’t a better idea to get the a6000 instead since it still does a great job. \n\nNow the big part is the lens, I chose the camera, which I can find for around 300€, the lens(es) is kind of a problem here. \n\nI got some ideas, whether the sigma 30 and 56 contemporary lenses for roughly 588€, there will be a small amount left for an sd card and some batteries from ravpower, the other way would be the 24-70 zeiss which I can find for roughly the same price, even though it’s a ff lens I could use it when I’ll upgrade.. \n\nThat’s all ideas I got for now. Please let me know if there are better solutions or any critics, feel free to give them.", "link": "https://www.reddit.com/r/SonyAlpha/comments/kk6rmn/beginner_lens_choice_for_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "beginner lens choice for aps-c ? /!/ hi guy’s as a christmas gift i got a great amount of money, around 940€, and i wanted to get my hands on some sweet photography gear. i got my eyes on the a6100 but the big price -----> tag !!!  makes me wonder if it isn’t a better idea to get the a6000 instead since it still does a great job. \n\nnow the big part is the lens, i chose the camera, which i can find for around 300€, the lens(es) is kind of a problem here. \n\ni got some ideas, whether the sigma 30 and 56 contemporary lenses for roughly 588€, there will be a small amount left for an sd card and some batteries from ravpower, the other way would be the 24-70 zeiss which i can find for roughly the same price, even though it’s a ff lens i could use it when i’ll upgrade.. \n\nthat’s all ideas i got for now. please let me know if there are better solutions or any critics, feel free to give them.", "sortedWord": "None", "identifyer": 45948, "year": "2020"}, {"Unnamed: 0": 45136, "autor": "pagetrip", "date": 1582761255000, "content": "Sigma 14-24 f2.8 Art or Sony G Master 16-35/2.8 for wide field Astrophotography (&amp; Landscapes)? /!/  \n\nI realize that Sony costs almost USD 1000 more but I am looking for long-term investment for a good wide-angle lens. I am trying to convince myself (mainly wifey) to splurge a little and justify myself a birthday gift.\n\nI shoot with A7iii. I use Tokina 20mm f2 for astro photos (milkyway/star trails) and for wide-angle landscapes. I like Tokina but sometimes I feel 20 mm is too narrow for astro. Also, most of the times 20mm ends up being too wide for landscapes. This is why I am looking for a ideal astro/landscape zoom lens. I often find myself switching out Tokina 20mm to Sony 24-105 f4 for landscape shots. Also, more than 70% of landscapes are between 24 &amp;50 mm, with approx 40% of shots falling between 24 &amp; 35mm. \n\nI have been lusting after Sony 16-35 f2.8 for a while, but the $2000+ price tag has kept me away. I thought Sigma 14-24 might be a good compromise since 14mm would be perfect for astro photos. However, I am afraid I might still switch lenses for landscape shots.  \n\nSince I will be able to afford only one lens for foreseeable future, I want to make sure I get the one that makes most sense. Also, couldn't find any direct astro photography comparisons between these two lenses.\n\n* How big of a difference is 14mm vs 16mm for wild field astro? My main goal is to get a good astro lens that can piggy back as a good landscape lens.  Not a lot of astro capability reviews for Sony lens.\n* How big of a difference is 24mm vs 35mm for landscapes? \n* Is IQ of Sony 16-35 G Master really one of the best? \n* Should I go back to the table and consider just a prime lens for astro? \n\nThanks for your time.", "link": "https://www.reddit.com/r/SonyAlpha/comments/fa2wdo/sigma_1424_f28_art_or_sony_g_master_163528_for/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sigma 14-24 f2.8 art or sony g master 16-35/2.8 for wide field astrophotography (&amp; landscapes)? /!/  \n\ni realize that sony costs almost usd 1000 more but i am looking for long-term investment for a good wide-angle lens. i am trying to convince myself (mainly wifey) to splurge a little and justify myself a birthday gift.\n\ni shoot with a7iii. i use tokina 20mm f2 for astro photos (milkyway/star trails) and for wide-angle landscapes. i like tokina but sometimes i feel 20 mm is too narrow for astro. also, most of the times 20mm ends up being too wide for landscapes. this is why i am looking for a ideal astro/landscape zoom lens. i often find myself switching out tokina 20mm to sony 24-105 f4 for landscape shots. also, more than 70% of landscapes are between 24 &amp;50 mm, with approx 40% of shots falling between 24 &amp; 35mm. \n\ni have been lusting after sony 16-35 f2.8 for a while, but the $2000+ price -----> tag !!!  has kept me away. i thought sigma 14-24 might be a good compromise since 14mm would be perfect for astro photos. however, i am afraid i might still switch lenses for landscape shots.  \n\nsince i will be able to afford only one lens for foreseeable future, i want to make sure i get the one that makes most sense. also, couldn't find any direct astro photography comparisons between these two lenses.\n\n* how big of a difference is 14mm vs 16mm for wild field astro? my main goal is to get a good astro lens that can piggy back as a good landscape lens.  not a lot of astro capability reviews for sony lens.\n* how big of a difference is 24mm vs 35mm for landscapes? \n* is iq of sony 16-35 g master really one of the best? \n* should i go back to the table and consider just a prime lens for astro? \n\nthanks for your time.", "sortedWord": "None", "identifyer": 46198, "year": "2020"}, {"Unnamed: 0": 45612, "autor": "TheSpider12", "date": 1600703698000, "content": "I regret going for a panasonic g85 instead of a sony a6400 /!/ The autofocus on the g85 is just so bad man. I'm a beginner and use the camera for some short films; there are some scenarios where I need to get the focus fast and accurately and using manual focus is just not feasible, hence the need for good autofocus/touch focus. I look at the a6400 reviews now and the autofocus is so much better. Plus the better image quality. Plus better low light performance. Plus smaller size (meaning I can use it on a cheaper and lighter gimbal). Those come with 50% higher price tag compared to the g85 I got though, but now after so much struggle with the focusing system of the g85, I wonder if it was worth it to jump on the sony ship instead.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ix33bo/i_regret_going_for_a_panasonic_g85_instead_of_a/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i regret going for a panasonic g85 instead of a sony a6400 /!/ the autofocus on the g85 is just so bad man. i'm a beginner and use the camera for some short films; there are some scenarios where i need to get the focus fast and accurately and using manual focus is just not feasible, hence the need for good autofocus/touch focus. i look at the a6400 reviews now and the autofocus is so much better. plus the better image quality. plus better low light performance. plus smaller size (meaning i can use it on a cheaper and lighter gimbal). those come with 50% higher price -----> tag !!!  compared to the g85 i got though, but now after so much struggle with the focusing system of the g85, i wonder if it was worth it to jump on the sony ship instead.", "sortedWord": "None", "identifyer": 46684, "year": "2020"}, {"Unnamed: 0": 47388, "autor": "Niccokai", "date": 1580369047000, "content": "Buy the A7iii now or wait for the A7IV? Jan/Feb 2020 /!/ Alright so I'm a newbie when it comes to photography and cinematography and i'm interested in buying the A7iii at the moment. So if i'm set on the A7iii why am I asking about the A7iv? Glad you asked I was wondering when I should pull the trigger for the A7iii, as of right now I only have little information on how prices fluctuate for the A7 line of cameras seeing how the A7ii and A7iii really took habitat in two different places in the market and the A7iv is sounding like an incremental update, I was wondering if I should pull the trigger on the A7iii during this February sale or wait for the coveted A7iv releases and hope to god that it takes the market place of the A7iii?\n\nI recognise most people here are definitely more experienced than I so here are things I'd like to ask about. From the rumors of the A7iv (not reliable ) I'm hearing that I should expect for it to be announced during CP+ Japan and WPPI this year as it would be consistent with the last couple A7 announcements (6 months after the updated R version and in the winter) assuming a sony camera gets announced where would you guys think sony would place the A7iv in the market, would you expect it to take up that 2000$ USD space the A7iii once took as it sounds as though only an incremental change is rumored, or a 3000$USD price range? Would you suspect the price tag of the A7Riii would limit the price at which the A7iv can be placed since it's most likely still easy for sony to sell megapixels over other specs, and would the A7iii get marked down fairly rapidly after the A7iv announcement? I'm curious as to the past events with these products and I believe this will heavily influence my decision to buy the camera. \n\n&amp;#x200B;\n\nThanks guys! excited to hear your opinions.", "link": "https://www.reddit.com/r/SonyAlpha/comments/ew1o67/buy_the_a7iii_now_or_wait_for_the_a7iv_janfeb_2020/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "buy the a7iii now or wait for the a7iv? jan/feb 2020 /!/ alright so i'm a newbie when it comes to photography and cinematography and i'm interested in buying the a7iii at the moment. so if i'm set on the a7iii why am i asking about the a7iv? glad you asked i was wondering when i should pull the trigger for the a7iii, as of right now i only have little information on how prices fluctuate for the a7 line of cameras seeing how the a7ii and a7iii really took habitat in two different places in the market and the a7iv is sounding like an incremental update, i was wondering if i should pull the trigger on the a7iii during this february sale or wait for the coveted a7iv releases and hope to god that it takes the market place of the a7iii?\n\ni recognise most people here are definitely more experienced than i so here are things i'd like to ask about. from the rumors of the a7iv (not reliable ) i'm hearing that i should expect for it to be announced during cp+ japan and wppi this year as it would be consistent with the last couple a7 announcements (6 months after the updated r version and in the winter) assuming a sony camera gets announced where would you guys think sony would place the a7iv in the market, would you expect it to take up that 2000$ usd space the a7iii once took as it sounds as though only an incremental change is rumored, or a 3000$usd price range? would you suspect the price -----> tag !!!  of the a7riii would limit the price at which the a7iv can be placed since it's most likely still easy for sony to sell megapixels over other specs, and would the a7iii get marked down fairly rapidly after the a7iv announcement? i'm curious as to the past events with these products and i believe this will heavily influence my decision to buy the camera. \n\n&amp;#x200b;\n\nthanks guys! excited to hear your opinions.", "sortedWord": "None", "identifyer": 48522, "year": "2020"}, {"Unnamed: 0": 48082, "autor": "sexy_wrxy", "date": 1591108507000, "content": "Recommendations on 200mm+ lens /!/ I'm looking to get a new zoom lens and I'm having a hard time finding the right one.\n\nI have an a6400 with the kit 18-135mm and rikonin 12mm\n\nRight now the front runner is the Sony E 70-350mm f/4.5-6.3 G OSS.\n\nI typically do my shooting out on hikes with a mix of wildlife and landscape.\n\nHoping to keep the price tag right at it under 1k since this is just a hobby. This is probably the most difficult aspect in the range in looking for.\n\nThanks for the help!", "link": "https://www.reddit.com/r/SonyAlpha/comments/gv8fbt/recommendations_on_200mm_lens/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "recommendations on 200mm+ lens /!/ i'm looking to get a new zoom lens and i'm having a hard time finding the right one.\n\ni have an a6400 with the kit 18-135mm and rikonin 12mm\n\nright now the front runner is the sony e 70-350mm f/4.5-6.3 g oss.\n\ni typically do my shooting out on hikes with a mix of wildlife and landscape.\n\nhoping to keep the price -----> tag !!!  right at it under 1k since this is just a hobby. this is probably the most difficult aspect in the range in looking for.\n\nthanks for the help!", "sortedWord": "None", "identifyer": 49240, "year": "2020"}, {"Unnamed: 0": 48463, "autor": "SyeTen", "date": 1587956693000, "content": "Sony E 16-55 f2.8 G vs Sony FE 16-35 f2.8 GM on APS-C /!/ I have an a6400 and the 18-135 kit lens.  I'm wondering about getting a faster around all-around lens mid-range zooms lens.  I MIGHT be getting a solo wedding photographer gig or two in the future. I'm considering adding a faster lens to my arsenal and have a clinically-diagnosed case of GAS.  Has anyone had experience with both of these two lens?  Having the FE GM lens will futureproof me should I in the future want to go FF.   I haven't seen any YouTube reviews comparing thee to lens on an APS-C body.  So I ant to know if the price tag of the FE GM lens is really justified to splurge on.", "link": "https://www.reddit.com/r/SonyAlpha/comments/g8setp/sony_e_1655_f28_g_vs_sony_fe_1635_f28_gm_on_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony e 16-55 f2.8 g vs sony fe 16-35 f2.8 gm on aps-c /!/ i have an a6400 and the 18-135 kit lens.  i'm wondering about getting a faster around all-around lens mid-range zooms lens.  i might be getting a solo wedding photographer gig or two in the future. i'm considering adding a faster lens to my arsenal and have a clinically-diagnosed case of gas.  has anyone had experience with both of these two lens?  having the fe gm lens will futureproof me should i in the future want to go ff.   i haven't seen any youtube reviews comparing thee to lens on an aps-c body.  so i ant to know if the price -----> tag !!!  of the fe gm lens is really justified to splurge on.", "sortedWord": "None", "identifyer": 49643, "year": "2020"}, {"Unnamed: 0": 48825, "autor": "Mirkovic232", "date": 1593946352000, "content": "Planning to buy Sony A6000 in 2020 /!/ Hi, I'm planning to buy new A6000 with kit lens, I was previously after good used one for around 350-400€ (390-450$), but after consulting with my brother (Nikon photographer) I've decided to buy a new one with a price tag of 465€ (522$). I said better to add 50-100$ more to buy new with warranty than some used one. I had the money and I was ready to make a purchase, but of course they didn't have it in stock so I had to wait, I'll wait no problem. Two weeks of waiting price changes from 465€ to 500€ (562$). My brother told me that, that price is too high for that camera, especially with kit lens. I was skeptical with 465€, I was like ok this is max max I'll pay and now f.\n\nSo what's your suggestion? There's also option where I buy body and lens separate, body is priced at 410€ (461$), what lens should I buy and how much money should I spend?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hlkq93/planning_to_buy_sony_a6000_in_2020/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "planning to buy sony a6000 in 2020 /!/ hi, i'm planning to buy new a6000 with kit lens, i was previously after good used one for around 350-400€ (390-450$), but after consulting with my brother (nikon photographer) i've decided to buy a new one with a price -----> tag !!!  of 465€ (522$). i said better to add 50-100$ more to buy new with warranty than some used one. i had the money and i was ready to make a purchase, but of course they didn't have it in stock so i had to wait, i'll wait no problem. two weeks of waiting price changes from 465€ to 500€ (562$). my brother told me that, that price is too high for that camera, especially with kit lens. i was skeptical with 465€, i was like ok this is max max i'll pay and now f.\n\nso what's your suggestion? there's also option where i buy body and lens separate, body is priced at 410€ (461$), what lens should i buy and how much money should i spend?", "sortedWord": "None", "identifyer": 50012, "year": "2020"}, {"Unnamed: 0": 50301, "autor": "jeayboog", "date": 1603060490000, "content": "Kit Lens limitation or User error? Comparison vs. iPhone /!/ I’ve had my Sony A6400 with the 16-50mm Kit Lens for a month now and I’m struggling to get crisp/sharp images.  I’m trying to figure out if it’s user error or limitations with the Kit Lens.  Most of my pictures are indoor pictures of my newborn baby and I’ve been comparing the photos to my iphone photos.  The Iphone photos are a lot more sharp.  I’ve shot in both Auto mode and Aperture priority.  I’m thinking about purchasing a 35mm/1.8 lens but before I invest money I would like to master the kit lens to at least be comparable to my iphone pictures.\n\nI’ve attached some sample images shot indoors.  As you can see the iphone image is more sharp, vs. the other two shot with the A6400 kit lens.  You can see the words written on the tag attached to the toy elephant very clearly on the iPhone pictures vs. A6400 sample photos.\n\nIs this a limitation with the kit lens?  Is there a way I can shoot better photos to match iPhone picture?", "link": "https://www.reddit.com/r/SonyAlpha/comments/jdpvwl/kit_lens_limitation_or_user_error_comparison_vs/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "kit lens limitation or user error? comparison vs. iphone /!/ i’ve had my sony a6400 with the 16-50mm kit lens for a month now and i’m struggling to get crisp/sharp images.  i’m trying to figure out if it’s user error or limitations with the kit lens.  most of my pictures are indoor pictures of my newborn baby and i’ve been comparing the photos to my iphone photos.  the iphone photos are a lot more sharp.  i’ve shot in both auto mode and aperture priority.  i’m thinking about purchasing a 35mm/1.8 lens but before i invest money i would like to master the kit lens to at least be comparable to my iphone pictures.\n\ni’ve attached some sample images shot indoors.  as you can see the iphone image is more sharp, vs. the other two shot with the a6400 kit lens.  you can see the words written on the -----> tag !!!  attached to the toy elephant very clearly on the iphone pictures vs. a6400 sample photos.\n\nis this a limitation with the kit lens?  is there a way i can shoot better photos to match iphone picture?", "sortedWord": "None", "identifyer": 51541, "year": "2020"}, {"Unnamed: 0": 50534, "autor": "Moeemalik", "date": 1585054987000, "content": "Sony A7iii owners I need your advice /!/ I've been saving up a lot of money for a about year now for the A7iii and now (unfortunately in 2020) I'm able to afford it. I'm planning to use it for content creation and video + photography gigs here\n\nWhat lens do you guys recommend to be my first lens to buy \nI can't exceed 700$ price tag\nSo what comes in mind are the Tamron 28-75 f2.8 \nOr sigma 35mm f1.4 \n\nDo you guys recommend a prime lens to be my first choice ? \nOr maybe you have another lens in mind. \n\nI'd appreciate your help \nThanks in advance", "link": "https://www.reddit.com/r/SonyAlpha/comments/fo4qxz/sony_a7iii_owners_i_need_your_advice/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony a7iii owners i need your advice /!/ i've been saving up a lot of money for a about year now for the a7iii and now (unfortunately in 2020) i'm able to afford it. i'm planning to use it for content creation and video + photography gigs here\n\nwhat lens do you guys recommend to be my first lens to buy \ni can't exceed 700$ price -----> tag !!! \nso what comes in mind are the tamron 28-75 f2.8 \nor sigma 35mm f1.4 \n\ndo you guys recommend a prime lens to be my first choice ? \nor maybe you have another lens in mind. \n\ni'd appreciate your help \nthanks in advance", "sortedWord": "None", "identifyer": 51784, "year": "2020"}, {"Unnamed: 0": 52026, "autor": "ericajowhadyaknow", "date": 1606295142000, "content": "Ultimate travel setup /!/ Looking for advice on what body and lens combo to get. Upgrading from the a6000, kit lenses, and Rokinon 12 f2. The first big trip for the set will be Patagonia for 12 days of backpacking, I'm also planning a round the world trip for late 2022. I dont want to be carrying around too much weight and I want to cover a range of focal lengths and  be able to get some star photos.\nI have narrowed down my search to 2 bodies: a6600 and a6400. I haven't dabbled too much in video yet but it is something I want to start. I like the battery size of the 6600 over the 6400. \nAs far as lenses: the 18-135, 16-55(though I dislike the big price tag), one of the tamrons?? Id like to swap my rokinon for a sigma 16, the manual focus has not been a friend to me. \nLooking for other lens suggestions/input and pros/cons of the bodies. TIA!!", "link": "https://www.reddit.com/r/SonyAlpha/comments/k0oscy/ultimate_travel_setup/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "ultimate travel setup /!/ looking for advice on what body and lens combo to get. upgrading from the a6000, kit lenses, and rokinon 12 f2. the first big trip for the set will be patagonia for 12 days of backpacking, i'm also planning a round the world trip for late 2022. i dont want to be carrying around too much weight and i want to cover a range of focal lengths and  be able to get some star photos.\ni have narrowed down my search to 2 bodies: a6600 and a6400. i haven't dabbled too much in video yet but it is something i want to start. i like the battery size of the 6600 over the 6400. \nas far as lenses: the 18-135, 16-55(though i dislike the big price -----> tag !!! ), one of the tamrons?? id like to swap my rokinon for a sigma 16, the manual focus has not been a friend to me. \nlooking for other lens suggestions/input and pros/cons of the bodies. tia!!", "sortedWord": "None", "identifyer": 53336, "year": "2020"}, {"Unnamed: 0": 52119, "autor": "ARS01", "date": 1607310934000, "content": "Looking To Buy The A7SIII To Replace My Sony AX53? Is there a better choice? /!/ Hey! \n\nSo I have a Sony Ax53 camcorder right now and I am using it for my youtube channel where I do mostly sports oriented videos (Goalkeeping) and product review for sports products so close up shots and stills are important but nowhere near as important as a good clean shot of a fast moving ball and the goalkeeper which moves in short quick bursts.\n\nI've been pretty ok with the Sony AX53, \nI leave it up on a tripod for an overall shot and use three different gopros for close up angles or more unsafe areas for the cameras like in the goal.\n\nAfter seeing all the hype about the A7SIII I personally thought it would be a good choice for me but as I am rather new to this high tier camera world and massive tags I really wanted to hear other people's thoughts on this. \n\nSo what do you say, is the A7SIII A good choice for me to upgrade from my sony ax53 and what glass would you recommend?\n\n\nHere's my youtube channel for reference\nhttps://www.youtube.com/channel/UCYtzQTfh5JFfYH9PUaUH46Q?view_as=subscriber\n\nthank you for your time and hopefully help!\n(side note) \nWhy is it sold out everywhere?", "link": "https://www.reddit.com/r/SonyAlpha/comments/k88gti/looking_to_buy_the_a7siii_to_replace_my_sony_ax53/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "looking to buy the a7siii to replace my sony ax53? is there a better choice? /!/ hey! \n\nso i have a sony ax53 camcorder right now and i am using it for my youtube channel where i do mostly sports oriented videos (goalkeeping) and product review for sports products so close up shots and stills are important but nowhere near as important as a good clean shot of a fast moving ball and the goalkeeper which moves in short quick bursts.\n\ni've been pretty ok with the sony ax53, \ni leave it up on a tripod for an overall shot and use three different gopros for close up angles or more unsafe areas for the cameras like in the goal.\n\nafter seeing all the hype about the a7siii i personally thought it would be a good choice for me but as i am rather new to this high tier camera world and massive -----> tags !!!  i really wanted to hear other people's thoughts on this. \n\nso what do you say, is the a7siii a good choice for me to upgrade from my sony ax53 and what glass would you recommend?\n\n\nhere's my youtube channel for reference\nhttps://www.youtube.com/channel/ucytzqtfh5jffyh9puauh46q?view_as=subscriber\n\nthank you for your time and hopefully help!\n(side note) \nwhy is it sold out everywhere?", "sortedWord": "None", "identifyer": 53431, "year": "2020"}, {"Unnamed: 0": 53304, "autor": "ChubbyChickensFTW", "date": 1603681416000, "content": "\"Downgrading\" to APSC /!/ Hi there, overall question is what are your guys' opinions on going from FF to APSC. I have been using the a7ii for the past year with the kit lens, vintage 50mm lens, and the sony 50mm f1.8. Recently, I have really considered investing into a nice lens so that I could produce better quality photos. However, seems to me that whatever I looked at, it would easily be 800 CAD or above (eg. used sigma 35mm or sony 85mm). I am just a hobbyist college student looking to snap some nice pics, so I am wondering if it would be a good idea to sell what I have right now and move onto the APSC world as \"good\" lenses are much cheaper; I would probably end up getting the a6000 or any other a6XXX if there is a good price tag. \n\nThanks for the read, and I appreciate your reponses!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ji71fl/downgrading_to_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "\"downgrading\" to apsc /!/ hi there, overall question is what are your guys' opinions on going from ff to apsc. i have been using the a7ii for the past year with the kit lens, vintage 50mm lens, and the sony 50mm f1.8. recently, i have really considered investing into a nice lens so that i could produce better quality photos. however, seems to me that whatever i looked at, it would easily be 800 cad or above (eg. used sigma 35mm or sony 85mm). i am just a hobbyist college student looking to snap some nice pics, so i am wondering if it would be a good idea to sell what i have right now and move onto the apsc world as \"good\" lenses are much cheaper; i would probably end up getting the a6000 or any other a6xxx if there is a good price -----> tag !!! . \n\nthanks for the read, and i appreciate your reponses!", "sortedWord": "None", "identifyer": 54676, "year": "2020"}], "name": "tagSonyAlpha2020"}