{"interestingcomments": [{"autor": "marklopezzz", "date": "2021-05-01 16:51:51", "content": "It’s always fun coming up with shots on the spot. Sony A7C", "link": "https://www.reddit.com/r/SonyAlpha/comments/n2m8sk/its_always_fun_coming_up_with_shots_on_the_spot/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "it’s always fun -----> coming !!!  -----> up !!!  -----> with !!!  shots on the spot. sony a7c", "sortedWord": "None", "Identifyer": null, "identifyer": 25040, "year": "2021"}, {"autor": "doitfortheview", "date": "2021-06-30 18:55:28", "content": "WHY do you all take photos? How do you come up with a why? :) /!/ Originally my question was going to be how do you decide what to take photos of - but I imagine many of us would have a long list of great things or simply say … go find stuff. Discover. Walk. Adventure. \n\nBut what I’m missing right now is. Why. \n\nWhat’s the end purpose? How might it impact someone or something?\n\nWhat kinds of stories do you tell with photos for people or yourselves and what changes as a result. \n\nSo I would love to be inspired by you all and have a great discussion on … why do you take photos :)\n\nPlease do share examples too if you like to show off the results of your efforts. Those are always inspiring too. \n\nFWIW I have a Sony a6600 :)", "link": "https://www.reddit.com/r/SonyAlpha/comments/ob3x3i/why_do_you_all_take_photos_how_do_you_come_up/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "why do you all take photos? how do you -----> come !!!  -----> up !!!  -----> with !!!  a why? :) /!/ originally my question was going to be how do you decide what to take photos of - but i imagine many of us would have a long list of great things or simply say … go find stuff. discover. walk. adventure. \n\nbut what i’m missing right now is. why. \n\nwhat’s the end purpose? how might it impact someone or something?\n\nwhat kinds of stories do you tell with photos for people or yourselves and what changes as a result. \n\nso i would love to be inspired by you all and have a great discussion on … why do you take photos :)\n\nplease do share examples too if you like to show off the results of your efforts. those are always inspiring too. \n\nfwiw i have a sony a6600 :)", "sortedWord": "None", "Identifyer": null, "identifyer": 27624, "year": "2021"}, {"autor": "FiletOFishhh", "date": "2021-06-07 21:02:16", "content": "How to remove a6600 battery door? /!/ Does anyone know how to remove the battery door to an a6600? I searched all over google and youtube and came up with nothing helpful. \n\nThanks in advanced!", "link": "https://www.reddit.com/r/SonyAlpha/comments/nuni3o/how_to_remove_a6600_battery_door/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "how to remove a6600 battery door? /!/ does anyone know how to remove the battery door to an a6600? i searched all over google and youtube and -----> came !!!  -----> up !!!  -----> with !!!  nothing helpful. \n\nthanks in advanced!", "sortedWord": "None", "Identifyer": null, "identifyer": 29462, "year": "2021"}, {"autor": "jamiemonster", "date": "2021-10-07 03:08:38", "content": "ISO change with focus ring /!/ I have scoured the internet with odd search queries and come up with nothing so I don't think it's possible but it feels like it should be. \n\nIs there a way to set the Focus Hold/Lens Button to be press and hold and then rotate the focus ring to do something? It seems like it would be so useful. On manual I currently have front ring and back ring to aperture/shutter but to change ISO I have to press the lens button and then up/down on the control wheel. Is there a better way to do this?", "link": "https://www.reddit.com/r/SonyAlpha/comments/q2zxs7/iso_change_with_focus_ring/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "iso change with focus ring /!/ i have scoured the internet -----> with !!!  odd search queries and -----> come !!!  -----> up !!!  -----> with !!!  nothing so i don't think it's possible but it feels like it should be. \n\nis there a way to set the focus hold/lens button to be press and hold and then rotate the focus ring to do something? it seems like it would be so useful. on manual i currently have front ring and back ring to aperture/shutter but to change iso i have to press the lens button and then up/down on the control wheel. is there a better way to do this?", "sortedWord": "None", "Identifyer": null, "identifyer": 30866, "year": "2021"}, {"autor": "axtran", "date": "2021-01-09 21:03:11", "content": "Pancake Lens for a7C? /!/ Anyone have any lenses they consider a recommended \"pancake\" for the a7C? The best I could come up with as a balance between size, weight, and performance is the Sony Zeiss 35/2.8, however I'm hesitant because of the slow speed. Wonder if the 35/2 Sigma is going to be any good!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ktzdjx/pancake_lens_for_a7c/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pancake lens for a7c? /!/ anyone have any lenses they consider a recommended \"pancake\" for the a7c? the best i could -----> come !!!  -----> up !!!  -----> with !!!  as a balance between size, weight, and performance is the sony zeiss 35/2.8, however i'm hesitant because of the slow speed. wonder if the 35/2 sigma is going to be any good!", "sortedWord": "None", "Identifyer": null, "identifyer": 31086, "year": "2021"}, {"autor": "ICanOnlyPickOne", "date": "2021-10-27 20:36:58", "content": "Move files from SD to SSD /!/ I have an A7s III on order and I was wondering is it possible to plug in an SSD over USB-C so I can move all the images/videos I have shot to it without using a laptop?\n\nI have one of those really small fast SanDisk SSDs and my use case would be out shooting and only bringing the camera and SSD with me. I only purchased a 64gb v90 card as they are super expensive so I'm trying to come up with the easiest way of offloading footage without needing to bring a laptop.\n\nNote I'm not asking about shooting footage directly to an SSD, only about offloading it from the SD card.", "link": "https://www.reddit.com/r/SonyAlpha/comments/qh5zfh/move_files_from_sd_to_ssd/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "move files from sd to ssd /!/ i have an a7s iii on order and i was wondering is it possible to plug in an ssd over usb-c so i can move all the images/videos i have shot to it without using a laptop?\n\ni have one of those really small fast sandisk ssds and my use case would be out shooting and only bringing the camera and ssd with me. i only purchased a 64gb v90 card as they are super expensive so i'm trying to -----> come !!!  -----> up !!!  -----> with !!!  the easiest way of offloading footage without needing to bring a laptop.\n\nnote i'm not asking about shooting footage directly to an ssd, only about offloading it from the sd card.", "sortedWord": "None", "Identifyer": null, "identifyer": 32977, "year": "2021"}, {"autor": "davidk29", "date": "2021-04-21 00:41:30", "content": "I figured out the issue with buying sony camera apps!!! /!/ This isn't a question, more of a PSA, but it can end up being extremely helpful for people. \n\nOver the years, tons of people have had issues buying the sony camera apps, notoriously the Time-lapse app, from PlayMemories. It's so frustrating that many people regret getting a Sony camera. They'll spend hours and hours trying to figure out how to buy the app, constantly running into issues. What was happening for me is that when I would get to the final purchase screen, I would press the button to buy it and nothing would happen. I probably spent 7 hours trying to figure this out and there were absolutely no answers online. Trying to contact Sony's customer service is a nightmare because their support service is pretty much non-existent. Finally, after a week of trying, I went deep in a google search and ran into a Czech forum where someone gave a tip and it immediately worked for me. \n\nIn order to help everyone else, I've compiled a list of troubleshooting tips. These are things that have helped me and others.\n\n1) FIRST, the thing that helped me, REGISTER YOUR CAMERA on Sony's website\n2) First try to download the app through the camera itself instead of with a computer, you can avoid a bunch of annoying things\n3) If you're using a Mac, people say that it won't work unless you're using Safari\n4) If you're on windows, people have said that you have to be on Internet Explorer\n5) You have to add funds to your \"account wallet,\" tons of people have had issues with PayPal and credit cards, so buy a PlayStation gift card and add that\n6) If you're downloading via a computer, make sure you're in the right USB mode, I've heard people say both \"MTP\" and \"Mass Storage,\" see what works for you\n7) I'll see if I come up with anything else\n\n\n\nIf anybody else has any tips, please reply with them.\nIf you have any other questions or issues, I'll try to help.\n\nThis is an extremely frustrating process, so I hope this post helps somebody!", "link": "https://www.reddit.com/r/SonyAlpha/comments/mv4lfo/i_figured_out_the_issue_with_buying_sony_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i figured out the issue with buying sony camera apps!!! /!/ this isn't a question, more of a psa, but it can end up being extremely helpful for people. \n\nover the years, tons of people have had issues buying the sony camera apps, notoriously the time-lapse app, from playmemories. it's so frustrating that many people regret getting a sony camera. they'll spend hours and hours trying to figure out how to buy the app, constantly running into issues. what was happening for me is that when i would get to the final purchase screen, i would press the button to buy it and nothing would happen. i probably spent 7 hours trying to figure this out and there were absolutely no answers online. trying to contact sony's customer service is a nightmare because their support service is pretty much non-existent. finally, after a week of trying, i went deep in a google search and ran into a czech forum where someone gave a tip and it immediately worked for me. \n\nin order to help everyone else, i've compiled a list of troubleshooting tips. these are things that have helped me and others.\n\n1) first, the thing that helped me, register your camera on sony's website\n2) first try to download the app through the camera itself instead of -----> with !!!  a computer, you can avoid a bunch of annoying things\n3) if you're using a mac, people say that it won't work unless you're using safari\n4) if you're on windows, people have said that you have to be on internet explorer\n5) you have to add funds to your \"account wallet,\" tons of people have had issues -----> with !!!  paypal and credit cards, so buy a playstation gift card and add that\n6) if you're downloading via a computer, make sure you're in the right usb mode, i've heard people say both \"mtp\" and \"mass storage,\" see what works for you\n7) i'll see if i -----> come !!!  -----> up !!!  -----> with !!!  anything else\n\n\n\nif anybody else has any tips, please reply -----> with !!!  them.\nif you have any other questions or issues, i'll try to help.\n\nthis is an extremely frustrating process, so i hope this post helps somebody!", "sortedWord": "None", "Identifyer": null, "identifyer": 36058, "year": "2021"}, {"autor": "v1rion", "date": "2021-09-24 13:32:34", "content": "Huge problem with RAW files in iOS and Google Photo /!/ My workflow:\n\nI take photos with my Sony A7 III. Then I transfer them via Apple’s SD card reader to my iPhone. From there I edit them in Lightroom (in iOS). \n\nMy problem:\n\nI use Google Photo in iOS to backup all my photos ans also to free up space on the phone by deleting already backed up photos. The problem is that Google Photo doesn’t support the ARW-files from A7III but instead saves a JPEG-version in the cloud, meaning my RAW-versions won’t be backed up.\n\nAnybody with the same setup and workflow who has come up with a good workaround?", "link": "https://www.reddit.com/r/SonyAlpha/comments/pujugk/huge_problem_with_raw_files_in_ios_and_google/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "huge problem with raw files in ios and google photo /!/ my workflow:\n\ni take photos with my sony a7 iii. then i transfer them via apple’s sd card reader to my iphone. from there i edit them in lightroom (in ios). \n\nmy problem:\n\ni use google photo in ios to backup all my photos ans also to free up space on the phone by deleting already backed up photos. the problem is that google photo doesn’t support the arw-files from a7iii but instead saves a jpeg-version in the cloud, meaning my raw-versions won’t be backed up.\n\nanybody -----> with !!!  the same setup and workflow who has -----> come !!!  -----> up !!!  -----> with !!!  a good workaround?", "sortedWord": "None", "Identifyer": null, "identifyer": 42963, "year": "2021"}, {"autor": "cobranathan", "date": "2021-10-16 14:20:18", "content": "How do you guys store your gear at home? /!/ I've got a couple bodies, 6 lenses, a few tripods, a couple small led panels, and various other accessories. I have a couple backpacks that I use when I go out shooting, but I can't fit everything in them to store.\n\nI'm hoping to come up with a fairly affordable solution (&lt;$100), but I'm curious what others do.", "link": "https://www.reddit.com/r/SonyAlpha/comments/q9cxur/how_do_you_guys_store_your_gear_at_home/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how do you guys store your gear at home? /!/ i've got a couple bodies, 6 lenses, a few tripods, a couple small led panels, and various other accessories. i have a couple backpacks that i use when i go out shooting, but i can't fit everything in them to store.\n\ni'm hoping to -----> come !!!  -----> up !!!  -----> with !!!  a fairly affordable solution (&lt;$100), but i'm curious what others do.", "sortedWord": "None", "Identifyer": null, "identifyer": 44704, "year": "2021"}, {"autor": "mikeystaker", "date": "2021-04-26 04:35:16", "content": "Problem updating firmware on a55 /!/ I have an old a55 which has always been a little touch and go, but I finally decided it was enough since like 1/5 of my images are turning up corrupted and the camera freezes every once in a while randomly. The first thing I was going to try to do was update the firmware, so I looked it up, dusted off my old windows 7 computer and tried my hand at following the basic instructions on sony's website. The camera knows it is connected to my computer and my computer can tell that it is connected to something (if an sd card were in the camera my computer even knows what type of camera it is) but the software sony has to use as an updater always comes up with an error message telling me to reconnect everything...\n\nI am at a loss for what to do. Anyone who can help?", "link": "https://www.reddit.com/r/SonyAlpha/comments/mypn7i/problem_updating_firmware_on_a55/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "problem updating firmware on a55 /!/ i have an old a55 which has always been a little touch and go, but i finally decided it was enough since like 1/5 of my images are turning up corrupted and the camera freezes every once in a while randomly. the first thing i was going to try to do was update the firmware, so i looked it up, dusted off my old windows 7 computer and tried my hand at following the basic instructions on sony's website. the camera knows it is connected to my computer and my computer can tell that it is connected to something (if an sd card were in the camera my computer even knows what type of camera it is) but the software sony has to use as an updater always -----> comes !!!  -----> up !!!  -----> with !!!  an error message telling me to reconnect everything...\n\ni am at a loss for what to do. anyone who can help?", "sortedWord": "None", "Identifyer": null, "identifyer": 45881, "year": "2021"}], "name": "withSonyAlpha2021"}