{"interestingcomments": [{"autor": "akisk", "date": "2018-10-14 17:40:11", "content": "FF vs APS-C /!/ Hey fellow Redditors. I am interested in switching to Sony and I'm trying to find what suits me the most. I'd love to read your input!!!\n\n&amp;#x200B;\n\nMy photographic profile can be split in 3 main categories.\n\n1. Generic/travel photography: Currently I'm mainly using a Canon 700d with a 17-55 2.8 IS. Excellent combo but I'd like to get something smaller. After analyzing the exif from my previous photos, I found out that almost 30% of them are shot at the widest end. When I want to be more discreet/save some space, I use the 24mm f/2.8 pancake. Absolutely love the size of this lens!\n2. Sports photography. Mainly car racing. I use a 70-200 2.8 unstabilized. Nothing to moan about here except the somehow slow burst rate of my camera. I've also used my dad's 100-400 for extra reach. Nice lens but the miss ratio increases with that one.\n3. Low-light shots (like concerts), portraits. I use my dad's 5D mkii  with some manual lenses like a Leica 50 f/2 and a Zeiss 85 1.4. Love the results!\n\nNow, suppose I want to find a combo that can cover these 3 categories in a more compact package with better image quality as well!!\n\n&amp;#x200B;\n\nI came up with three options as \"starter packs\", but I'm open to other ideas.\n\na. The \"decent aps-c\" solution: Sony A6500 + Sigma 16mm f/1.4 + Sigma 30mm f/1.4 = \\~1500 euro\n\nb. The \"cheap ff\" solution: Sony A7 iii + Sony 28mm f/2 = \\~2300 euro\n\nc. The \"all in ff\" solution: Sony A7 iii + Zeiss Batis 25mm f/2 +Sony 50mm f/1.8 = \\~3050 euro\n\n&amp;#x200B;\n\n**Question**: is option c worth the x2 price compared to option a? I know the answer depends on a lot of things, but I would like to hear your thoughts.\n\n&amp;#x200B;\n\n**Future upgrades**\n\nNext step for sports photography: Sony 100-400mm. I think aps-c will have an advantage here because of the extra-reach it will give me. Correct me if I'm wrong.\n\nNext steps if I go FF: Use my current manual lenses with adapters/ Get the following lenses (not necessarily in that order) -  Zeiss Batis 25mm f/2, Sony 35mm f/2.8 (love the pancakes!!!), Zeiss 55mm f/1.8, Sony 24-105 f/4 to replace my current 17-55.\n\n&amp;#x200B;\n\nBonus pic courtesy of [https://camerasize.com/](https://camerasize.com/) . Canon APS-C setup vs Sony FF equivalent. I am amazed that I can have a FF which will be smaller compared to my current camera!!\n\nhttps://i.redd.it/j1ztf3dor6s11.png\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/SonyAlpha/comments/9o4nu7/ff_vs_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "ff vs aps-c /!/ hey fellow redditors. i am interested in switching to sony and i'm trying to find what suits me the most. i'd love to read your input!!!\n\n&amp;#x200b;\n\nmy photographic profile can be split in 3 main categories.\n\n1. generic/travel photography: currently i'm mainly using a canon 700d with a 17-55 2.8 is. excellent combo but i'd like to get something smaller. after analyzing the exif from my previous photos, i found out that almost 30% of them are shot at the widest end. when i want to be more discreet/save some space, i use the 24mm f/2.8 pancake. absolutely love the size of this lens!\n2. sports photography. mainly car racing. i use a 70-200 2.8 unstabilized. nothing to moan about here except the somehow slow burst rate of my camera. i've also used my dad's 100-400 for extra reach. nice lens but the miss ratio increases with that one.\n3. low-light shots (like concerts), portraits. i use my dad's 5d mkii  with some manual lenses like a leica 50 f/2 and a zeiss 85 1.4. love the results!\n\nnow, suppose i want to find a combo that can cover these 3 categories in a more compact package with better image quality as well!!\n\n&amp;#x200b;\n\ni -----> came !!!  -----> up !!!  -----> with !!!  three options as \"starter packs\", but i'm open to other ideas.\n\na. the \"decent aps-c\" solution: sony a6500 + sigma 16mm f/1.4 + sigma 30mm f/1.4 = \\~1500 euro\n\nb. the \"cheap ff\" solution: sony a7 iii + sony 28mm f/2 = \\~2300 euro\n\nc. the \"all in ff\" solution: sony a7 iii + zeiss batis 25mm f/2 +sony 50mm f/1.8 = \\~3050 euro\n\n&amp;#x200b;\n\n**question**: is option c worth the x2 price compared to option a? i know the answer depends on a lot of things, but i would like to hear your thoughts.\n\n&amp;#x200b;\n\n**future upgrades**\n\nnext step for sports photography: sony 100-400mm. i think aps-c will have an advantage here because of the extra-reach it will give me. correct me if i'm wrong.\n\nnext steps if i go ff: use my current manual lenses with adapters/ get the following lenses (not necessarily in that order) -  zeiss batis 25mm f/2, sony 35mm f/2.8 (love the pancakes!!!), zeiss 55mm f/1.8, sony 24-105 f/4 to replace my current 17-55.\n\n&amp;#x200b;\n\nbonus pic courtesy of [https://camerasize.com/](https://camerasize.com/) . canon aps-c setup vs sony ff equivalent. i am amazed that i can have a ff which will be smaller compared to my current camera!!\n\nhttps://i.redd.it/j1ztf3dor6s11.png\n\n&amp;#x200b;", "sortedWord": "None", "Identifyer": null, "identifyer": 30897, "year": "2018"}, {"autor": "eulin87", "date": "2018-10-29 02:08:23", "content": "Received Brand New Sony A7iii and Sony Zeiss 55mm 1.8 / EYE AF issue /!/ Hey guys,\n\n&amp;#x200B;\n\nI just received my new equipment yesterday. After several shots i started to realize that the EYE AF wasn't working properly. The focus would show that its focused on the persons eye but after I took the shot I realized that it was on their nose, or cheek. I started to google and realized others have commented on this same issue. Has anyone here by any chance come up with an idea as to what is going on? I bought mine from Amazon and thinking about returning it :(", "link": "https://www.reddit.com/r/SonyAlpha/comments/9s92oj/received_brand_new_sony_a7iii_and_sony_zeiss_55mm/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "received brand new sony a7iii and sony zeiss 55mm 1.8 / eye af issue /!/ hey guys,\n\n&amp;#x200b;\n\ni just received my new equipment yesterday. after several shots i started to realize that the eye af wasn't working properly. the focus would show that its focused on the persons eye but after i took the shot i realized that it was on their nose, or cheek. i started to google and realized others have commented on this same issue. has anyone here by any chance -----> come !!!  -----> up !!!  -----> with !!!  an idea as to what is going on? i bought mine from amazon and thinking about returning it :(", "sortedWord": "None", "Identifyer": null, "identifyer": 36684, "year": "2018"}, {"autor": "joeshmoe9898", "date": "2018-07-02 10:48:53", "content": "[Help] Sony a7riii AF-C Pulsating in Video Mode /!/ I've done a bit of research and I've looked into the \"pulsating exposure warning\", but that is not the situation as it shows up in the video file. I know that this is common because of two things. \n\n1) No vertical lines to focus on (apparently the mirrorless lines can't use horizontal contrast lines to focus)\n\n2) Underexposed image making it difficult to find contrast\n\nI'm wondering if anyone has come up with a good solution for this. As it stands my solution is to flip the lens into MF when I notice the pulsing. I am also playing around with the AF Track speed for video, but I find that the \"slow\" setting is too slow in many situations where I'm following a subject. \n\nAny idea if this is something that Sony could be fixing in an updated firmware?\n\nIs anyone else experiencing this in video mode? \n\nps. Can anyone confirm that the setting for AF Tracking Speed with the image icon and the AF Tracking Speed with video icon are two completely independent settings? ", "link": "https://www.reddit.com/r/SonyAlpha/comments/8vhp02/help_sony_a7riii_afc_pulsating_in_video_mode/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "[help] sony a7riii af-c pulsating in video mode /!/ i've done a bit of research and i've looked into the \"pulsating exposure warning\", but that is not the situation as it shows up in the video file. i know that this is common because of two things. \n\n1) no vertical lines to focus on (apparently the mirrorless lines can't use horizontal contrast lines to focus)\n\n2) underexposed image making it difficult to find contrast\n\ni'm wondering if anyone has -----> come !!!  -----> up !!!  -----> with !!!  a good solution for this. as it stands my solution is to flip the lens into mf when i notice the pulsing. i am also playing around with the af track speed for video, but i find that the \"slow\" setting is too slow in many situations where i'm following a subject. \n\nany idea if this is something that sony could be fixing in an updated firmware?\n\nis anyone else experiencing this in video mode? \n\nps. can anyone confirm that the setting for af tracking speed with the image icon and the af tracking speed with video icon are two completely independent settings? ", "sortedWord": "None", "Identifyer": null, "identifyer": 38576, "year": "2018"}], "name": "withSonyAlpha2018"}