{"interestingcomments": [{"autor": "mewithoutMaverick", "date": "2019-05-05 19:24:06", "content": "Has anyone with the Sony 50 1.8 seen any weird distortion when taking photos while moving the camera? /!/ My best guess is that the distortion is happening when I'm moving the camera as I'm so often chasing down my 2 year old. In most cases it's not huge, it just looks like \"hmm, that seems off.\" Which may not be noticeable to most people, but when looking at one picture after the other (and also knowing very well the shape of my sons hard head) I can tell the picture is odd. They’re fairly sharp as the shutter speed is high, just slightly stretched.\n\nI tried to google but only came up with a bunch of articles mentioning the standard lens distortion. I’ll try to upload a couple shots if I can here.\n\nHas anyone else seen this issue?", "link": "https://www.reddit.com/r/SonyAlpha/comments/bl1uhk/has_anyone_with_the_sony_50_18_seen_any_weird/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "has anyone with the sony 50 1.8 seen any weird distortion when taking photos while moving the camera? /!/ my best guess is that the distortion is happening when i'm moving the camera as i'm so often chasing down my 2 year old. in most cases it's not huge, it just looks like \"hmm, that seems off.\" which may not be noticeable to most people, but when looking at one picture after the other (and also knowing very well the shape of my sons hard head) i can tell the picture is odd. they’re fairly sharp as the shutter speed is high, just slightly stretched.\n\ni tried to google but only -----> came !!!  -----> up !!!  -----> with !!!  a bunch of articles mentioning the standard lens distortion. i’ll try to upload a couple shots if i can here.\n\nhas anyone else seen this issue?", "sortedWord": "None", "Identifyer": null, "identifyer": 4585, "year": "2019"}, {"autor": "SonyKilledMyNikon", "date": "2019-11-18 15:23:26", "content": "Has anyone ever seen this error before ? Nothing remotely like this comes up with Google.", "link": "https://www.reddit.com/r/SonyAlpha/comments/dy4kbm/has_anyone_ever_seen_this_error_before_nothing/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "has anyone ever seen this error before ? nothing remotely like this -----> comes !!!  -----> up !!!  -----> with !!!  google.", "sortedWord": "None", "Identifyer": null, "identifyer": 5544, "year": "2019"}, {"autor": "IsmailGuendogan", "date": "2019-06-09 16:46:45", "content": "Multi metering overexposes when shooting shadow areas on sunny days /!/ I am a hobby shooter with a A7 III. I usually use \"multi\" metering mode, which works most of the time. Like described above, sometimes the camera overexposes by 1 to 2 stops when shooting shadow areas. In reality those areas are much darker but the camera tries to expose them as average.\n\nFor example I recently shot a soccer game. It was a very sunny noon. One site of the soccer field was under the shadows of the trees behind it. When shooting players in those darker areas, the camera (set on multi metering) overexposes like this:\n\n https://imgur.com/RN4mwgF   \n https://imgur.com/SbpgRz5 \n\nLook at how the grass is blown out. In reality it looks much darker. I have to underexpose two stops in Lightroom in order to fix it. Another example shot in winter, trust me in reality it was much darker:\n\n https://imgur.com/kXJ7of6 \n\n&amp;#x200B;\n\nI came up with two solutions to this: \n\n1. Metering mode \"highlight\". This works fine, sometimes the results are underexposed but that is easier to fix in post than overexposing. However it is inconvenient because I always have to switch back and forth when the lighting conditions switch.\n\n2. Manual aperture, shutter and ISO. That works also but it is difficult, because I have to carefully check the exposure (EVF or histogram).\n\nLike said I'm just a hobbyist and also like to enjoy the soccer game and rather rely on the camera automatic, instead of constantly checking my camera settings. Is there an option to use auto settings and multi metering, but the camera notices overexposed highlights and lowers the exposure in those situations? Is there another convenient way to get the exposure right in all situations including the ones mentioned above?", "link": "https://www.reddit.com/r/SonyAlpha/comments/bym6zi/multi_metering_overexposes_when_shooting_shadow/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "multi metering overexposes when shooting shadow areas on sunny days /!/ i am a hobby shooter with a a7 iii. i usually use \"multi\" metering mode, which works most of the time. like described above, sometimes the camera overexposes by 1 to 2 stops when shooting shadow areas. in reality those areas are much darker but the camera tries to expose them as average.\n\nfor example i recently shot a soccer game. it was a very sunny noon. one site of the soccer field was under the shadows of the trees behind it. when shooting players in those darker areas, the camera (set on multi metering) overexposes like this:\n\n https://imgur.com/rn4mwgf   \n https://imgur.com/sbpgrz5 \n\nlook at how the grass is blown out. in reality it looks much darker. i have to underexpose two stops in lightroom in order to fix it. another example shot in winter, trust me in reality it was much darker:\n\n https://imgur.com/kxj7of6 \n\n&amp;#x200b;\n\ni -----> came !!!  -----> up !!!  -----> with !!!  two solutions to this: \n\n1. metering mode \"highlight\". this works fine, sometimes the results are underexposed but that is easier to fix in post than overexposing. however it is inconvenient because i always have to switch back and forth when the lighting conditions switch.\n\n2. manual aperture, shutter and iso. that works also but it is difficult, because i have to carefully check the exposure (evf or histogram).\n\nlike said i'm just a hobbyist and also like to enjoy the soccer game and rather rely on the camera automatic, instead of constantly checking my camera settings. is there an option to use auto settings and multi metering, but the camera notices overexposed highlights and lowers the exposure in those situations? is there another convenient way to get the exposure right in all situations including the ones mentioned above?", "sortedWord": "None", "Identifyer": null, "identifyer": 6990, "year": "2019"}, {"autor": "pknipper", "date": "2019-01-02 22:07:03", "content": "a7Riii users; is XQD 400MB/s card overkill for 4K shooting? /!/ Sony has their 256GB XQD card that's rated at 400MB/read and write but was curious if anyone shoots 4K can chime in as far as if it's an overkill or would benefit?  I tried to Google everywhere but all I'm coming up with is your typical \"best memory card\" results and not a lot of information.\n\n&amp;#x200B;\n\nAny help is appreciated!", "link": "https://www.reddit.com/r/SonyAlpha/comments/abycl7/a7riii_users_is_xqd_400mbs_card_overkill_for_4k/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "a7riii users; is xqd 400mb/s card overkill for 4k shooting? /!/ sony has their 256gb xqd card that's rated at 400mb/read and write but was curious if anyone shoots 4k can chime in as far as if it's an overkill or would benefit?  i tried to google everywhere but all i'm -----> coming !!!  -----> up !!!  -----> with !!!  is your typical \"best memory card\" results and not a lot of information.\n\n&amp;#x200b;\n\nany help is appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 7995, "year": "2019"}, {"autor": "Maverick175", "date": "2019-08-13 20:00:11", "content": "Sony a7iii overheat /!/ Hi,\n\nI went out this afternoon with my Sony a7iii and saw this weird icon which after 5-10 mins of researching I found out it was the overheating symbol. I then turned off my camera immediately. Since then I have also taken out the battery, pulled the screen back and after a few hours it still won’t turn on and it keeps coming up with internal temp high, allow it to cool. \n\n\nAny help would be appreciated", "link": "https://www.reddit.com/r/SonyAlpha/comments/cpyiax/sony_a7iii_overheat/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "sony a7iii overheat /!/ hi,\n\ni went out this afternoon with my sony a7iii and saw this weird icon which after 5-10 mins of researching i found out it was the overheating symbol. i then turned off my camera immediately. since then i have also taken out the battery, pulled the screen back and after a few hours it still won’t turn on and it keeps -----> coming !!!  -----> up !!!  -----> with !!!  internal temp high, allow it to cool. \n\n\nany help would be appreciated", "sortedWord": "None", "Identifyer": null, "identifyer": 8047, "year": "2019"}, {"autor": "kranganath", "date": "2019-06-25 09:42:44", "content": "Sony a6500 - Short test handheld video in NYC /!/ I wanted to test my new purchase sony a6500 during my recent trip. In this is a short video, it was a rainy weekend in NYC, and I could not travel around a lot. I tried capturing what was in front of me over the weekend and came up with this montage. \n\n&amp;#x200B;\n\nMost parts of the video are shot in a6500.\n\nSegments which I am present in the video are shot with my phone.\n\nHyper lapses/time lapses are shot with gopro.\n\n&amp;#x200B;\n\nPros:\n\n\\+ Handheld stabilization is great with a OSS enabled lens (I have F4 18-105 Sony lens)\n\n\\+ The sigma F1.4 16mm and 30mm also works great for handheld videos with little to no jitters in most cases\n\n&amp;#x200B;\n\nCons:\n\n\\- When zoomed in the ibis + oss is of no use, the shakes are very evident in the video\n\n&amp;#x200B;\n\nIf you are interested to checkout the video, link is here: [https://www.youtube.com/watch?v=Lvy-\\_Rt4bWg](https://www.youtube.com/watch?v=Lvy-_Rt4bWg)", "link": "https://www.reddit.com/r/SonyAlpha/comments/c55x7j/sony_a6500_short_test_handheld_video_in_nyc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "sony a6500 - short test handheld video in nyc /!/ i wanted to test my new purchase sony a6500 during my recent trip. in this is a short video, it was a rainy weekend in nyc, and i could not travel around a lot. i tried capturing what was in front of me over the weekend and -----> came !!!  -----> up !!!  -----> with !!!  this montage. \n\n&amp;#x200b;\n\nmost parts of the video are shot in a6500.\n\nsegments which i am present in the video are shot with my phone.\n\nhyper lapses/time lapses are shot with gopro.\n\n&amp;#x200b;\n\npros:\n\n\\+ handheld stabilization is great with a oss enabled lens (i have f4 18-105 sony lens)\n\n\\+ the sigma f1.4 16mm and 30mm also works great for handheld videos with little to no jitters in most cases\n\n&amp;#x200b;\n\ncons:\n\n\\- when zoomed in the ibis + oss is of no use, the shakes are very evident in the video\n\n&amp;#x200b;\n\nif you are interested to checkout the video, link is here: [https://www.youtube.com/watch?v=lvy-\\_rt4bwg](https://www.youtube.com/watch?v=lvy-_rt4bwg)", "sortedWord": "None", "Identifyer": null, "identifyer": 12729, "year": "2019"}, {"autor": "dustinmain", "date": "2019-04-09 20:38:00", "content": "70-200mm f4 weird focusing issues with polarizer /!/ So a couple of years ago I had my my new FE 70-200 f4 on my A7ii body, and popped on a Conkin polarizer on it.  When I did that, the auto-focus went screwy, even the manual focus.  Unsure of what might be the problem, I tried to rule out the IS system, but it was the same either way.\n\n&amp;#x200B;\n\nIf I took the filter off, it still wouldn't focus properly, and wouldn't go back to normal until I turned off the camera and unmounted and remounted the lens w/o filter.  \n\n\nI was able to rule out a problem with the lens since it works normally otherwise (fortunately!) and I figure it was something with the polarizer that was messing with the internal mechanisms of the lens.  I tried to do some research at the time, and didn't come up with much, so I thought I'd throw it out here and see if anyone has had similar issues.  \n\n\nAttached is a 1-1 crop of a \"focused\" image with the polarizer on.", "link": "https://www.reddit.com/r/SonyAlpha/comments/bbd1mj/70200mm_f4_weird_focusing_issues_with_polarizer/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "70-200mm f4 weird focusing issues with polarizer /!/ so a couple of years ago i had my my new fe 70-200 f4 on my a7ii body, and popped on a conkin polarizer on it.  when i did that, the auto-focus went screwy, even the manual focus.  unsure of what might be the problem, i tried to rule out the is system, but it was the same either way.\n\n&amp;#x200b;\n\nif i took the filter off, it still wouldn't focus properly, and wouldn't go back to normal until i turned off the camera and unmounted and remounted the lens w/o filter.  \n\n\ni was able to rule out a problem with the lens since it works normally otherwise (fortunately!) and i figure it was something with the polarizer that was messing with the internal mechanisms of the lens.  i tried to do some research at the time, and didn't -----> come !!!  -----> up !!!  -----> with !!!  much, so i thought i'd throw it out here and see if anyone has had similar issues.  \n\n\nattached is a 1-1 crop of a \"focused\" image with the polarizer on.", "sortedWord": "None", "Identifyer": null, "identifyer": 13434, "year": "2019"}, {"autor": "Waribu", "date": "2019-02-16 15:55:31", "content": "You're going on an 8 day safari in Namibia, what gear do you bring with you? /!/ Have:\na7riii \nSony 70-200 f/4\nTamron 28-70 f/2.8\nRokinon 14mm f/2.8\nInduro carbon tripod + benro B2 ballhead \nF-stop backpack\n\nREALLY WANT \nSony 100-400 GM (and maybe a teleconverter please Santa?)\n\nTo me the 100-400 is pretty mucha a necessity, but I can see a way to come up with the money for it, so I'm looking into rentals - but even that's expensive.\n\nI have a chance to go on this safari with my best friend to a remote region in Namibia that is one of the most biologically robust and interesting places in the world. It seems like something not to pass up for the reason of living only once, and doing crazy and cool shit while I'm here. Photographically it would be bananas. Pretty much need longer than 200mm hence my wish for the GM lens. What would you want to bring?\n", "link": "https://www.reddit.com/r/SonyAlpha/comments/ar9zh5/youre_going_on_an_8_day_safari_in_namibia_what/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "you're going on an 8 day safari in namibia, what gear do you bring with you? /!/ have:\na7riii \nsony 70-200 f/4\ntamron 28-70 f/2.8\nrokinon 14mm f/2.8\ninduro carbon tripod + benro b2 ballhead \nf-stop backpack\n\nreally want \nsony 100-400 gm (and maybe a teleconverter please santa?)\n\nto me the 100-400 is pretty mucha a necessity, but i can see a way to -----> come !!!  -----> up !!!  -----> with !!!  the money for it, so i'm looking into rentals - but even that's expensive.\n\ni have a chance to go on this safari with my best friend to a remote region in namibia that is one of the most biologically robust and interesting places in the world. it seems like something not to pass up for the reason of living only once, and doing crazy and cool shit while i'm here. photographically it would be bananas. pretty much need longer than 200mm hence my wish for the gm lens. what would you want to bring?\n", "sortedWord": "None", "Identifyer": null, "identifyer": 17923, "year": "2019"}, {"autor": "cloudexclusive", "date": "2019-08-29 08:39:10", "content": "Is there a significant difference between APSC and full-frame? /!/ For me I came up with the question to upgrade my camera equipment to step more into a professional region. Actually my Sony Alpha 6300 does a very very great job and it is so compact. The only thing I struggle with is to create a nice bokeh in a full body portrait. Of courses I could buy a at least 135mm lens but the crop-factor would affect it to an 200mm and I'm not sure if I want to buy walkie talkies to communicate with my model cause mostly I shoot outdoor in the streets. \n\n**So one point for sure goes to the full-frame bodies but whats about the actual IMAGE QUALITY and the DYNAMIC RANGE? Is there really so MUCH DIFFERENCE?** \n\nI consume a lot of content of other photographers to get inspired and to think about how this photos were made and what was the photographers idea. It happens a lot of times to see photography have an awesome moody light situation, not just cause of the actual situation of the sunlight or flashlight, it is more a bigger and clearer difference between dark and bright spots in the picture. Has this something to do with the dynamic range of a full-frame body? I don't know but maybe you know. But it could be another reason to vote for full-frame.   \n\n\nThese are the only reasons I figured out to vote for full-frame but is that enough improvement in a picture to buy equipment costs 3-4x times the money I spent for my Sony A6300?\n\n&amp;#x200B;\n\n[great samples for awesome results of my APSC camera SonyAlpha A6300](https://i.redd.it/biamjzr0ocj31.jpg)", "link": "https://www.reddit.com/r/SonyAlpha/comments/cwy3rl/is_there_a_significant_difference_between_apsc/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "is there a significant difference between apsc and full-frame? /!/ for me i -----> came !!!  -----> up !!!  -----> with !!!  the question to upgrade my camera equipment to step more into a professional region. actually my sony alpha 6300 does a very very great job and it is so compact. the only thing i struggle with is to create a nice bokeh in a full body portrait. of courses i could buy a at least 135mm lens but the crop-factor would affect it to an 200mm and i'm not sure if i want to buy walkie talkies to communicate with my model cause mostly i shoot outdoor in the streets. \n\n**so one point for sure goes to the full-frame bodies but whats about the actual image quality and the dynamic range? is there really so much difference?** \n\ni consume a lot of content of other photographers to get inspired and to think about how this photos were made and what was the photographers idea. it happens a lot of times to see photography have an awesome moody light situation, not just cause of the actual situation of the sunlight or flashlight, it is more a bigger and clearer difference between dark and bright spots in the picture. has this something to do with the dynamic range of a full-frame body? i don't know but maybe you know. but it could be another reason to vote for full-frame.   \n\n\nthese are the only reasons i figured out to vote for full-frame but is that enough improvement in a picture to buy equipment costs 3-4x times the money i spent for my sony a6300?\n\n&amp;#x200b;\n\n[great samples for awesome results of my apsc camera sonyalpha a6300](https://i.redd.it/biamjzr0ocj31.jpg)", "sortedWord": "None", "Identifyer": null, "identifyer": 18802, "year": "2019"}], "name": "withSonyAlpha2019"}