{"interestingcomments": [{"autor": "ScottPens", "date": "2020-02-03 16:34:07", "content": "RX 100VA vs. RX100VII /!/ I have an RX100iii ( as a point and shoot, I have otherwise the a7M3) that I quite like, but I feel it’s starting to be outdated. \n\nMy wife and I are expecting, and I want a quick camera to have around that isn’t my cell phone for taking quality photos quickly on the go. The Eye AF is attractive, as well as how quick these cameras are.\n\nWhat bugs me about the VII is the f-stop at 2.8... whereas the VA has 1.8. I don’t think I care enough about the telephoto ( I figure - if I’m going anywhere where a telephoto matters, I’ll bring my a7iii with a telephoto lens.) \n\nI’m more or less envisioning this would be a street photography camera, as well as taking photos of my newborn and his mother out and about in a variety of locations - low light or not.\n\nI will occasionally take videos in 4K so I can pretend to use it with my 4K tv, but that can be rare too.\n\nThoughts? Anyone come up with this much?\n\nTLDR - new kid coming, Sony RX100VA or VII?", "link": "https://www.reddit.com/r/SonyAlpha/comments/ey9omw/rx_100va_vs_rx100vii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "rx 100va vs. rx100vii /!/ i have an rx100iii ( as a point and shoot, i have otherwise the a7m3) that i quite like, but i feel it’s starting to be outdated. \n\nmy wife and i are expecting, and i want a quick camera to have around that isn’t my cell phone for taking quality photos quickly on the go. the eye af is attractive, as well as how quick these cameras are.\n\nwhat bugs me about the vii is the f-stop at 2.8... whereas the va has 1.8. i don’t think i care enough about the telephoto ( i figure - if i’m going anywhere where a telephoto matters, i’ll bring my a7iii with a telephoto lens.) \n\ni’m more or less envisioning this would be a street photography camera, as well as taking photos of my newborn and his mother out and about in a variety of locations - low light or not.\n\ni will occasionally take videos in 4k so i can pretend to use it with my 4k tv, but that can be rare too.\n\nthoughts? anyone -----> come !!!  -----> up !!!  -----> with !!!  this much?\n\ntldr - new kid coming, sony rx100va or vii?", "sortedWord": "None", "Identifyer": null, "identifyer": 33387, "year": "2020"}, {"autor": "Kangaroobjj", "date": "2020-02-23 06:43:43", "content": "Is this the correct process for SONY SD Card to External HD? /!/ Hi I just started using my Sony aziii and I have video footage and photos on the Sony sd card. I want to move it over to a La Cie external hard drive and save the important photos and videos on a google drive. \n\nI have been looking everywhere to see if there is some sort of app or button I can push to import the right files but it seems like I need to drag and drop and this is what I came up with.\n\nCan you tell me if this is correct or if I'm doing something wrong or making it more complicated than it should be?\n\nI am using a MacBook.\n\n1. Plug in external HD\n2. Put SD card into Mac\n3. Drag photos from DCIM folder &gt;100MSDCF folder  into a photo folder in external HD\n4. Go to PRIVATE &gt; M4ROOT &gt; CLIP folder and drag mp4 and xml files into video folder in external HD\n\nI don't know what to do about the THBNL folder and I am not sure if I need to drag in the xml files with the mp4 videos. Can you tell me if either of these are needed to be dragged in also and what the xml files are for?\n\nThank you . Sorry. I'm a newb trying to learn.", "link": "https://www.reddit.com/r/SonyAlpha/comments/f85y3q/is_this_the_correct_process_for_sony_sd_card_to/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "is this the correct process for sony sd card to external hd? /!/ hi i just started using my sony aziii and i have video footage and photos on the sony sd card. i want to move it over to a la cie external hard drive and save the important photos and videos on a google drive. \n\ni have been looking everywhere to see if there is some sort of app or button i can push to import the right files but it seems like i need to drag and drop and this is what i -----> came !!!  -----> up !!!  -----> with !!! .\n\ncan you tell me if this is correct or if i'm doing something wrong or making it more complicated than it should be?\n\ni am using a macbook.\n\n1. plug in external hd\n2. put sd card into mac\n3. drag photos from dcim folder &gt;100msdcf folder  into a photo folder in external hd\n4. go to private &gt; m4root &gt; clip folder and drag mp4 and xml files into video folder in external hd\n\ni don't know what to do about the thbnl folder and i am not sure if i need to drag in the xml files with the mp4 videos. can you tell me if either of these are needed to be dragged in also and what the xml files are for?\n\nthank you . sorry. i'm a newb trying to learn.", "sortedWord": "None", "Identifyer": null, "identifyer": 33902, "year": "2020"}, {"autor": "Tabletote", "date": "2020-03-01 02:26:37", "content": "Looking to move on from A600... What to do? /!/ I currently own an A6000 that I bought a couple years back. I'd like to move on to something that's either a. smaller, lighter, and more portable or b. has a bit more IQ, longer battery, and improved specs in general. I'd like to spend no more than $800 after selling the whole kit or $500 after dumping the body. I generally use my gear for some light portrait work and a bunch of street photography.\n\nWith that in mind, I've come up with a few options:  \nFor the compact option, the RX100V  \n\n\nFor the \"better overall\" option, the A6300 or maybe the 6400/6500 if I can find one for under $500 (hard to do, I'm guessing)  \n\n\n  \nYour help is greatly appreciated!", "link": "https://www.reddit.com/r/SonyAlpha/comments/fbnfdc/looking_to_move_on_from_a600_what_to_do/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking to move on from a600... what to do? /!/ i currently own an a6000 that i bought a couple years back. i'd like to move on to something that's either a. smaller, lighter, and more portable or b. has a bit more iq, longer battery, and improved specs in general. i'd like to spend no more than $800 after selling the whole kit or $500 after dumping the body. i generally use my gear for some light portrait work and a bunch of street photography.\n\n-----> with !!!  that in mind, i've -----> come !!!  -----> up !!!  -----> with !!!  a few options:  \nfor the compact option, the rx100v  \n\n\nfor the \"better overall\" option, the a6300 or maybe the 6400/6500 if i can find one for under $500 (hard to do, i'm guessing)  \n\n\n  \nyour help is greatly appreciated!", "sortedWord": "None", "Identifyer": null, "identifyer": 35168, "year": "2020"}, {"autor": "boofreddy882", "date": "2020-07-07 23:08:14", "content": "Traditional zoom focal ranges /!/ I was discussing with a Sony mate 'wouldn't it be great if there was a fast zoom that straddled the usual ranges of like,14-24mm and 24-70mm types. \n\nIt got me thinking, on my old Nikon D200 I had a brilliant 17-55 2.8 which I loved. Of course this was about the same as a 24-70 in 35mm terms, but how come there are no actual 17-55mms for full frames out there? This covers 95% of my usage on my A7Riii and I change regularly between my 16-35 and 28-75. A 17-55mm on full frame would be the sweet spot for me, and I expect a lot of other people too. Also because it does the work of two lenses I'd be prepared to pay a premium for that lens too.\n\nArguments we've come with are zooms are compromised on range and speed and size, but there are zooms with bigger ranges (e.g. 100-400, 150-500), plenty of 2.8 zooms and Sony's clearly not afraid to make big expensive lenses. \n\nThe only thing we could come up with is that the optics of a 'wide lens' work differently to a normal / tele lens which is why standard zooms don't tend to be wider than 24mm, but isn't normal supposed to 35mm or 50mm, why is 24mm apparently the cut-off? \n\nAny ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/hn5cjr/traditional_zoom_focal_ranges/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "traditional zoom focal ranges /!/ i was discussing with a sony mate 'wouldn't it be great if there was a fast zoom that straddled the usual ranges of like,14-24mm and 24-70mm types. \n\nit got me thinking, on my old nikon d200 i had a brilliant 17-55 2.8 which i loved. of course this was about the same as a 24-70 in 35mm terms, but how come there are no actual 17-55mms for full frames out there? this covers 95% of my usage on my a7riii and i change regularly between my 16-35 and 28-75. a 17-55mm on full frame would be the sweet spot for me, and i expect a lot of other people too. also because it does the work of two lenses i'd be prepared to pay a premium for that lens too.\n\narguments we've come with are zooms are compromised on range and speed and size, but there are zooms with bigger ranges (e.g. 100-400, 150-500), plenty of 2.8 zooms and sony's clearly not afraid to make big expensive lenses. \n\nthe only thing we could -----> come !!!  -----> up !!!  -----> with !!!  is that the optics of a 'wide lens' work differently to a normal / tele lens which is why standard zooms don't tend to be wider than 24mm, but isn't normal supposed to 35mm or 50mm, why is 24mm apparently the cut-off? \n\nany ideas?", "sortedWord": "None", "Identifyer": null, "identifyer": 37039, "year": "2020"}, {"autor": "apothekary", "date": "2020-04-01 21:31:32", "content": "24mm (35mm equivalent) prime recommendations for an A5000? Sony f/1.4 GM, Zeiss f/1.8 or something else? /!/ I own an old Sony A5000 that I've previously sold all my old lenses for. It is my only (non-phone) camera. Not a professional but a bit of an enthusiast. I used to shoot quite a bit several years ago and learned by experience my favorite focal length is the 35mm for street photography, environmental portraits, travel shots and architecture. \n\nWith all the extra time we have now, I'm looking to buy a single 24mm (35mm equivalent) focal length lens to pick this hobby back up and came up with the Zeiss f/1.8 and GM f/1.4 as options. Fine with buying used and it looks like I can get the Zeiss at about $400 and the GM at a little over $1000. \n\nWondering what people's thoughts were on either of these. I'm hoping to just run this setup for quite a long number of years so I want something I'm happy with and not have to incrementally switch out of every couple of years. I'm mostly wondering if the f/1.4 GM would be worth it and keep me satisfied for a longer period of time as I hopefully improve and shoot more often. I'm aware it's for Sony FF cameras but it seems to work fine for an APS-C body, though all reviews on the crop sensor are for the A6000-level series. \n\nWould its glass and quality be wasted on an A5000? Would the 24mm f/1.8 perform more or less as well on this body? Would the GM lens simply be too heavy against the A5000 even if the visual quality is stellar? Is there something else someone would recommend - note I'm not necessarily looking for cost savings, as I do not want to sacrifice any possible quality. I just don't want to buy a lens that my current camera can't really even take advantage of. \n\nThat said, I'm hoping to not spend much over $1000 to be up and running. I prefer not selling the A5000 as something worth upgrading to like the A6500 without a lens would cost over $1k alone. I am not interested in going full frame for portability reasons at this time.\n\nAppreciate any advice!", "link": "https://www.reddit.com/r/SonyAlpha/comments/ft94lp/24mm_35mm_equivalent_prime_recommendations_for_an/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "24mm (35mm equivalent) prime recommendations for an a5000? sony f/1.4 gm, zeiss f/1.8 or something else? /!/ i own an old sony a5000 that i've previously sold all my old lenses for. it is my only (non-phone) camera. not a professional but a bit of an enthusiast. i used to shoot quite a bit several years ago and learned by experience my favorite focal length is the 35mm for street photography, environmental portraits, travel shots and architecture. \n\n-----> with !!!  all the extra time we have now, i'm looking to buy a single 24mm (35mm equivalent) focal length lens to pick this hobby back -----> up !!!  and -----> came !!!  -----> up !!!  -----> with !!!  the zeiss f/1.8 and gm f/1.4 as options. fine with buying used and it looks like i can get the zeiss at about $400 and the gm at a little over $1000. \n\nwondering what people's thoughts were on either of these. i'm hoping to just run this setup for quite a long number of years so i want something i'm happy with and not have to incrementally switch out of every couple of years. i'm mostly wondering if the f/1.4 gm would be worth it and keep me satisfied for a longer period of time as i hopefully improve and shoot more often. i'm aware it's for sony ff cameras but it seems to work fine for an aps-c body, though all reviews on the crop sensor are for the a6000-level series. \n\nwould its glass and quality be wasted on an a5000? would the 24mm f/1.8 perform more or less as well on this body? would the gm lens simply be too heavy against the a5000 even if the visual quality is stellar? is there something else someone would recommend - note i'm not necessarily looking for cost savings, as i do not want to sacrifice any possible quality. i just don't want to buy a lens that my current camera can't really even take advantage of. \n\nthat said, i'm hoping to not spend much over $1000 to be up and running. i prefer not selling the a5000 as something worth upgrading to like the a6500 without a lens would cost over $1k alone. i am not interested in going full frame for portability reasons at this time.\n\nappreciate any advice!", "sortedWord": "None", "Identifyer": null, "identifyer": 42127, "year": "2020"}, {"autor": "driftingphotog", "date": "2020-02-16 19:16:49", "content": "What weird things would you do with an A7Riii? /!/ I'm a diehard Nikon shooter, but my friend has just given me his A7Riii as he wasn't getting much use out of it (and didn't have any lenses for it - long story).\n\nI already have a full Nikon FF kit (D850, 35/1.4, 85/1.4, 14-24/2.8, 70-200/2.8) as well as some extra Nikon film bodies and glass (35/2, 24/2.8, 55macro).\n\nA7Riii and D850 have pretty much the same sensor, so I'm looking for ideas on what to do with this thing to try to explore different types of photography.\n\nHere's what I've come up with so far. I've excluded the idea of just getting a Sony kit, as there aren't really any major wins over my current Nikon one and selling either just feels wrong.\n\n\n**1 - Astro Mod (or IR) w/ Adapted Glass** - I haven't looked too much into the details here, but I know you can mod the sensors for better performance in astrophotography. I've already got the nice Nikon wide, so an F mount adapter could do well here. Same goes for an Infrared mod, which could be very fun to play with.\n\n**2 - Adapted M-mount Street Camera** - I've had the Leica lust for some time, and an M-mount 35mm on an A7 makes for quite the compact package compared to my Nikon equivalent. It could also slowly let me ramp up an M-mount glass collection as I wait for the M11 to come out (and still probably not buy it). I've shot a friend's A7 with a Leica 35 and the EVF makes it a joy to shoot. Anything I should know about this approach? Obviously I'd love a Summilux, but, you know, budget.\n\n**3 - Just buy an FE mount 35/1.8 or 35/2.8 and pretend it's a Leica Q2** - Looking at [size comparisons](https://camerasize.com/compact/#820,724.410,718.763,ha,t), that's quite the compact kit. One of my biggest issues with my D850 + 35/1.4 is that it's just too big and heavy to take everywhere. This could solve it. Any other good compact suggestions?\n\n**4 - Tilt/Shift Fun Times** - I've seen that there are mounts like [this one](https://www.adorama.com/katsnkgnex.html?utm_source=rflaid66541) that will turn any of my Nikon glass into tilt/shift glass on the Sony. I love working with tilt/shifts but have never been able to justify the price. Any insight into quality and whether or not it's worth it? I'd imagine the image circles of the lenses may not be big enough to truly equal dedicated glass, but I'm not sure.\n\nAny other ideas?", "link": "https://www.reddit.com/r/SonyAlpha/comments/f4vhao/what_weird_things_would_you_do_with_an_a7riii/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "what weird things would you do with an a7riii? /!/ i'm a diehard nikon shooter, but my friend has just given me his a7riii as he wasn't getting much use out of it (and didn't have any lenses for it - long story).\n\ni already have a full nikon ff kit (d850, 35/1.4, 85/1.4, 14-24/2.8, 70-200/2.8) as well as some extra nikon film bodies and glass (35/2, 24/2.8, 55macro).\n\na7riii and d850 have pretty much the same sensor, so i'm looking for ideas on what to do with this thing to try to explore different types of photography.\n\nhere's what i've -----> come !!!  -----> up !!!  -----> with !!!  so far. i've excluded the idea of just getting a sony kit, as there aren't really any major wins over my current nikon one and selling either just feels wrong.\n\n\n**1 - astro mod (or ir) w/ adapted glass** - i haven't looked too much into the details here, but i know you can mod the sensors for better performance in astrophotography. i've already got the nice nikon wide, so an f mount adapter could do well here. same goes for an infrared mod, which could be very fun to play with.\n\n**2 - adapted m-mount street camera** - i've had the leica lust for some time, and an m-mount 35mm on an a7 makes for quite the compact package compared to my nikon equivalent. it could also slowly let me ramp up an m-mount glass collection as i wait for the m11 to come out (and still probably not buy it). i've shot a friend's a7 with a leica 35 and the evf makes it a joy to shoot. anything i should know about this approach? obviously i'd love a summilux, but, you know, budget.\n\n**3 - just buy an fe mount 35/1.8 or 35/2.8 and pretend it's a leica q2** - looking at [size comparisons](https://camerasize.com/compact/#820,724.410,718.763,ha,t), that's quite the compact kit. one of my biggest issues with my d850 + 35/1.4 is that it's just too big and heavy to take everywhere. this could solve it. any other good compact suggestions?\n\n**4 - tilt/shift fun times** - i've seen that there are mounts like [this one](https://www.adorama.com/katsnkgnex.html?utm_source=rflaid66541) that will turn any of my nikon glass into tilt/shift glass on the sony. i love working with tilt/shifts but have never been able to justify the price. any insight into quality and whether or not it's worth it? i'd imagine the image circles of the lenses may not be big enough to truly equal dedicated glass, but i'm not sure.\n\nany other ideas?", "sortedWord": "None", "Identifyer": null, "identifyer": 42508, "year": "2020"}, {"autor": "ohsoflawless", "date": "2020-03-16 11:59:18", "content": "Need some Opinions on Lenses /!/ I plan on investing in Sony.  I'm interested in videography and stills.  So I've decided to first invest in the a6600 and at a later date invest in a FF likely the A7 series, the 6600 would  than be primarily for just video.  So to try and waste the least amount of money and making sure that everything I purchase will be used in the future I have come up with a several lens possibilities  and would like some opinions. \n\nOption 1- Buying APS-C lenses\n\nSony 16-55 F2.8 (1300$)\n\nSony 70-350 F4.5-6.3 (900$)\n\nThis Option IMO would be a great set up for just using in conjunction with the 6600 but may not translate as well with a FF which I intend on getting down the road.\n\n&amp;#x200B;\n\nOption 2- Buying One APS-C lens, my work load lens for video and buying one FF lens for the future but use it on the 6600 in the meantime.\n\nSigma 16mm F1.4 video lens (400$)\n\nSigma 24-70 F2.8, this is a FF lens  (1100$) \n\nThis Option I wouldn't have a telephoto lens but may be more cost effective down the road.  I am just unsure how the sigma 24-70 would perform on a cropped sensor.\n\nI would love feedback thanks!", "link": "https://www.reddit.com/r/SonyAlpha/comments/fjjtbh/need_some_opinions_on_lenses/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "need some opinions on lenses /!/ i plan on investing in sony.  i'm interested in videography and stills.  so i've decided to first invest in the a6600 and at a later date invest in a ff likely the a7 series, the 6600 would  than be primarily for just video.  so to try and waste the least amount of money and making sure that everything i purchase will be used in the future i have -----> come !!!  -----> up !!!  -----> with !!!  a several lens possibilities  and would like some opinions. \n\noption 1- buying aps-c lenses\n\nsony 16-55 f2.8 (1300$)\n\nsony 70-350 f4.5-6.3 (900$)\n\nthis option imo would be a great set up for just using in conjunction with the 6600 but may not translate as well with a ff which i intend on getting down the road.\n\n&amp;#x200b;\n\noption 2- buying one aps-c lens, my work load lens for video and buying one ff lens for the future but use it on the 6600 in the meantime.\n\nsigma 16mm f1.4 video lens (400$)\n\nsigma 24-70 f2.8, this is a ff lens  (1100$) \n\nthis option i wouldn't have a telephoto lens but may be more cost effective down the road.  i am just unsure how the sigma 24-70 would perform on a cropped sensor.\n\ni would love feedback thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 43403, "year": "2020"}, {"autor": "a_h4t", "date": "2020-10-20 21:11:52", "content": "Lens overheats shooting long video (Sony a6100 + E PZ 16-50mm lens) /!/ I recently purchased a Sony a6100 with the standard 16-50mm lens that commonly comes with it.  My wife wants to get into photography, and I wanted a decent camera for VC and streaming, so this seemed like a solid camera to meet both of our needs.\n\nFor the most part, it's been great.  However, I found that if I recorded for an hour or more, the camera would start to overheat and shut itself down.  I've done a few things to mitigate, based on what I've read here and elsewhere:\n\n* Reduce resolution\n* Leave battery cover open\n* The screen is pulled out and above the camera so I can see it while the camera is facing me\n* The memory card is a SanDisk 64GB Extreme UHS-I SDXC, which should be fast enough to mitigate heat.  Plus, I'm usually not recording to the card so I doubt this is a meaningful heat source in the first place.\n* I even mounted two small 20mm fans on the tripod behind the camera to help cool it: [https://imgur.com/a/q1ioSVu](https://imgur.com/a/q1ioSVu).\n* I don't want to turn off the temp warning feature because I'd rather not risk harming the camera.\n\nThe camera can now record for over 2 hours before it overheats, which is definitely good enough for most of my use cases.  However, I've noticed that most of the heat seems to be coming from the lens (it's *probably* actually coming from the sensor, but I don't want to touch that to confirm.  All I can tell is that the hottest parts of the camera to the touch are the metal mounting rings on the lens and body).\n\nHas anybody else noticed this specific source of heat on their cameras?  Any solutions that people have come up with to reduce it?  I did some searching, but I didn't find anything specific to this particular heat source.  I could try to add more of those mini fans to the tripod (they've done surprisingly well keeping the back of the camera cool), but trying to get them near the lens will be an absolute pain, and I'd really rather avoid trying to do that.  Not sure if this could be a simple matter of getting a better lens or something.", "link": "https://www.reddit.com/r/SonyAlpha/comments/jeyqpp/lens_overheats_shooting_long_video_sony_a6100_e/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "lens overheats shooting long video (sony a6100 + e pz 16-50mm lens) /!/ i recently purchased a sony a6100 with the standard 16-50mm lens that commonly comes with it.  my wife wants to get into photography, and i wanted a decent camera for vc and streaming, so this seemed like a solid camera to meet both of our needs.\n\nfor the most part, it's been great.  however, i found that if i recorded for an hour or more, the camera would start to overheat and shut itself down.  i've done a few things to mitigate, based on what i've read here and elsewhere:\n\n* reduce resolution\n* leave battery cover open\n* the screen is pulled out and above the camera so i can see it while the camera is facing me\n* the memory card is a sandisk 64gb extreme uhs-i sdxc, which should be fast enough to mitigate heat.  plus, i'm usually not recording to the card so i doubt this is a meaningful heat source in the first place.\n* i even mounted two small 20mm fans on the tripod behind the camera to help cool it: [https://imgur.com/a/q1iosvu](https://imgur.com/a/q1iosvu).\n* i don't want to turn off the temp warning feature because i'd rather not risk harming the camera.\n\nthe camera can now record for over 2 hours before it overheats, which is definitely good enough for most of my use cases.  however, i've noticed that most of the heat seems to be coming from the lens (it's *probably* actually coming from the sensor, but i don't want to touch that to confirm.  all i can tell is that the hottest parts of the camera to the touch are the metal mounting rings on the lens and body).\n\nhas anybody else noticed this specific source of heat on their cameras?  any solutions that people have -----> come !!!  -----> up !!!  -----> with !!!  to reduce it?  i did some searching, but i didn't find anything specific to this particular heat source.  i could try to add more of those mini fans to the tripod (they've done surprisingly well keeping the back of the camera cool), but trying to get them near the lens will be an absolute pain, and i'd really rather avoid trying to do that.  not sure if this could be a simple matter of getting a better lens or something.", "sortedWord": "None", "Identifyer": null, "identifyer": 44226, "year": "2020"}, {"autor": "jm1161", "date": "2020-01-18 20:09:05", "content": "a6400 and Mac Catalina /!/ I know that PlayMemories has been discontinued and does not work in Catalina. Wi-Fi transfer to a Mac is no more. Wired transfer is problematic.\n\nHow is everyone getting their photos and videos into a Mac?\n\nImaging Edge runs on Catalina. Drilling down to a connected camera's folder I can see the photos, but there doesn't seem to be a way to transfer them to a local drive's folder. (i.e. no \"import\" function).\n\nWorse, Imaging Edge does not see any videos on the camera.\n\nSony's website explains how to find photos and videos on a connected camera via the finder. This works, but the manual process is tedious. (For anyone interested, the path to video is \"Untitled-&gt;Private-&gt;M4Root-&gt;Clip\"    Photos are in \"Untitled-&gt;DCIM-&gt;100MSDCF\") I realize iMovie/FCPx can import movies, but I that forces clips into a project. I prefer to manage my files in my own folders.\n\nThe only info I can find from Sony is a notification in the Imaging Edge Viewer app. As of November 19, they \"have confirmed that some functions cannot be used\" and are \"reviewing the situation to come up with a solution.\"\n\nThat's two months ago. Are there any solutions (Sony or third-party)?", "link": "https://www.reddit.com/r/SonyAlpha/comments/eqll26/a6400_and_mac_catalina/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "a6400 and mac catalina /!/ i know that playmemories has been discontinued and does not work in catalina. wi-fi transfer to a mac is no more. wired transfer is problematic.\n\nhow is everyone getting their photos and videos into a mac?\n\nimaging edge runs on catalina. drilling down to a connected camera's folder i can see the photos, but there doesn't seem to be a way to transfer them to a local drive's folder. (i.e. no \"import\" function).\n\nworse, imaging edge does not see any videos on the camera.\n\nsony's website explains how to find photos and videos on a connected camera via the finder. this works, but the manual process is tedious. (for anyone interested, the path to video is \"untitled-&gt;private-&gt;m4root-&gt;clip\"    photos are in \"untitled-&gt;dcim-&gt;100msdcf\") i realize imovie/fcpx can import movies, but i that forces clips into a project. i prefer to manage my files in my own folders.\n\nthe only info i can find from sony is a notification in the imaging edge viewer app. as of november 19, they \"have confirmed that some functions cannot be used\" and are \"reviewing the situation to -----> come !!!  -----> up !!!  -----> with !!!  a solution.\"\n\nthat's two months ago. are there any solutions (sony or third-party)?", "sortedWord": "None", "Identifyer": null, "identifyer": 47284, "year": "2020"}, {"autor": "cruzer6112", "date": "2020-05-29 04:58:00", "content": "Creative quarantine selfie ideas /!/ I have a Sony A7III and was hoping to use it creatively during this pandemic.  It is really hard coming up with some self portrait ideas in my house.  Can any body offer some creative ideas, maybe some ISO, shutter speed, aperture suggestions. Thank you ☺️", "link": "https://www.reddit.com/r/SonyAlpha/comments/gsmcqd/creative_quarantine_selfie_ideas/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "creative quarantine selfie ideas /!/ i have a sony a7iii and was hoping to use it creatively during this pandemic.  it is really hard -----> coming !!!  -----> up !!!  -----> with !!!  some self portrait ideas in my house.  can any body offer some creative ideas, maybe some iso, shutter speed, aperture suggestions. thank you ☺️", "sortedWord": "None", "Identifyer": null, "identifyer": 48760, "year": "2020"}, {"autor": "Dindrtahl", "date": "2020-02-17 22:20:53", "content": "Critique wanted on a newbie astro/milky way photo /!/ I'm doing some training shots before preparing a \"perfect conditions\" Milky Way shot. I'm a bit limited on gear atm as I have only an A6000 and Sigma 19mm 2.8 lens.\n\nThe conditions were not ideal, I've shot this image in an low-average light polluted area (Bortle Scale 4) according to this [site](https://www.lightpollutionmap.info/) and guided by the SkySafari app. There were some small clouds passing by. The galactic center wasn't visible. The moon was at the Third Quarter though it was set to rise in about 3 hours from the opposite direction (so I guess it wouldn't really count as light pollution right ?).\n\nI took 17 different shots at 13s and 1600iso. This was the [base image](https://ibb.co/YDNpMFT). Then I did some basic edit in Lightroom that I synchronised over all the 17 shots and came up with this [shot](https://ibb.co/XDZCKqy). And then I exported all to TIF and stacked them with Sequator coming up with the [final image](https://ibb.co/vPMvy5b).\n\nWhat could I have done better ? Both in preparation and post-processing ? I would guess the base image was very underexposed, but then again I thought I shouldn't go over 1600iso on an APS-C sensor because there is way too much noise. Also I couldn't really go over 13s exposure as trails would begin to appear.\n\nThanks for your help !", "link": "https://www.reddit.com/r/SonyAlpha/comments/f5gv6n/critique_wanted_on_a_newbie_astromilky_way_photo/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "critique wanted on a newbie astro/milky way photo /!/ i'm doing some training shots before preparing a \"perfect conditions\" milky way shot. i'm a bit limited on gear atm as i have only an a6000 and sigma 19mm 2.8 lens.\n\nthe conditions were not ideal, i've shot this image in an low-average light polluted area (bortle scale 4) according to this [site](https://www.lightpollutionmap.info/) and guided by the skysafari app. there were some small clouds passing by. the galactic center wasn't visible. the moon was at the third quarter though it was set to rise in about 3 hours from the opposite direction (so i guess it wouldn't really count as light pollution right ?).\n\ni took 17 different shots at 13s and 1600iso. this was the [base image](https://ibb.co/ydnpmft). then i did some basic edit in lightroom that i synchronised over all the 17 shots and -----> came !!!  -----> up !!!  -----> with !!!  this [shot](https://ibb.co/xdzckqy). and then i exported all to tif and stacked them with sequator coming up with the [final image](https://ibb.co/vpmvy5b).\n\nwhat could i have done better ? both in preparation and post-processing ? i would guess the base image was very underexposed, but then again i thought i shouldn't go over 1600iso on an aps-c sensor because there is way too much noise. also i couldn't really go over 13s exposure as trails would begin to appear.\n\nthanks for your help !", "sortedWord": "None", "Identifyer": null, "identifyer": 50258, "year": "2020"}, {"autor": "ParadiseBizz", "date": "2020-12-16 16:25:33", "content": "Waiting for a new APS-C camera /!/ I know, it is all speculations so far. But are there any rumors for a new Sony APS-C camera to be announced at the CES 2021? \n\nI think it's about time. They released all those expensive APS-C lenses and then did not come up with an upgrade to the a6600", "link": "https://www.reddit.com/r/SonyAlpha/comments/kecair/waiting_for_a_new_apsc_camera/", "origin": "Reddit", "suborigin": "SonyAlpha", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "waiting for a new aps-c camera /!/ i know, it is all speculations so far. but are there any rumors for a new sony aps-c camera to be announced at the ces 2021? \n\ni think it's about time. they released all those expensive aps-c lenses and then did not -----> come !!!  -----> up !!!  -----> with !!!  an upgrade to the a6600", "sortedWord": "None", "Identifyer": null, "identifyer": 54717, "year": "2020"}], "name": "withSonyAlpha2020"}