{"interestingcomments": [{"Unnamed: 0": 243461, "autor": "closedcurve", "date": 1621020414000, "content": "Lathe for turning logs to a consistent diameter? /!/ We're designing and making a wavy cordwood wall at work, it's a old method of building using logs and mortar, sorta opposite the way you'd like of a log cabin being built, from the side you only see log ends.\n\nAnyway, boss man wants a more modern aesthetic so we want to strip the park and mill these with a smooth consistent diameter. Google tells me the average log width is 10\" so something a bit bigger than that I'd guess? Gotta be a specialized tool for this that takes the burden off an operator without going full automation, but I'm not sure. Thought I'd like your brains.\n\nLength isn't so important, the final logs/bricks will prob only be 8\" long though it might be more efficient to lathe longer sections and then cut.", "link": "https://www.reddit.com/r/Tools/comments/ncgsm5/lathe_for_turning_logs_to_a_consistent_diameter/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we're designing", "selectorShort": "design", "MarkedSent": "lathe for turning logs to a consistent diameter? /!/ -----> we !!! -----> 're !!!  -----> designing !!!  and making a wavy cordwood wall at work, it's a old method of building using logs and mortar, sorta opposite the way you'd like of a log cabin being built, from the side you only see log ends.\n\nanyway, boss man wants a more modern aesthetic so we want to strip the park and mill these with a smooth consistent diameter. google tells me the average log width is 10\" so something a bit bigger than that i'd guess? gotta be a specialized tool for this that takes the burden off an operator without going full automation, but i'm not sure. thought i'd like your brains.\n\nlength isn't so important, the final logs/bricks will prob only be 8\" long though it might be more efficient to lathe longer sections and then cut.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/ncgsm5/lathe_for_turning_logs_to_a_consistent_diameter/", "identifyer": 243461, "year": "2021"}, {"Unnamed: 0": 249683, "autor": "ZeCAPTCHA", "date": 1633890414000, "content": "Designing a more ergonomic wrench for design school project! /!/ Hello all! Been following this sub for a while and figured it would be a great place to gather some data for a studio project we are working on. We are looking at ergonomics and particularly the grip of tools, weather it be a carrot peeler or breaker bar. We chose a standard opened ended/box wrench to look at.\n\nOur design would likely involve some changing of the grip, it may be its own tool or a sort of add on that could clip onto the handle and allow for a more ideal grip (esp on very small or very large wrenches that don't exactly fit in the hand well)\n\nInterested in any and all feedback around your frustrations wishes or suggestions, especially from mechanics or other people who use tools for hours a day. Please feel free to leave things in the comments!\n\nThank you all!\n\n[View Poll](https://www.reddit.com/poll/q5dnu5)", "link": "https://www.reddit.com/r/Tools/comments/q5dnu5/designing_a_more_ergonomic_wrench_for_design/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  a more ergonomic wrench for design school project! /!/ hello all! been following this sub for a while and figured it would be a great place to gather some data for a studio project we are working on. we are looking at ergonomics and particularly the grip of tools, weather it be a carrot peeler or breaker bar. we chose a standard opened ended/box wrench to look at.\n\nour design would likely involve some changing of the grip, it may be its own tool or a sort of add on that could clip onto the handle and allow for a more ideal grip (esp on very small or very large wrenches that don't exactly fit in the hand well)\n\ninterested in any and all feedback around your frustrations wishes or suggestions, especially from mechanics or other people who use tools for hours a day. please feel free to leave things in the comments!\n\nthank you all!\n\n[view poll](https://www.reddit.com/poll/q5dnu5)", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/q5dnu5/designing_a_more_ergonomic_wrench_for_design/", "identifyer": 249683, "year": "2021"}], "name": "designTools2021"}