{"interestingcomments": [{"Unnamed: 0": 240517, "autor": "lgst1r", "date": 1635474991000, "content": "Some older US made wrenches I got from the swap meet last weekend. Got some German and Japanese ones too.", "link": "https://www.reddit.com/r/Tools/comments/qi2r9g/some_older_us_made_wrenches_i_got_from_the_swap/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "some older -----> us !!!  -----> made !!!  wrenches i got from the swap meet last weekend. got some german and japanese ones too.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/gallery/qi2r9g", "identifyer": 240517, "year": "2021"}, {"Unnamed: 0": 240988, "autor": "Irish_andGermanguy", "date": 1634282839000, "content": "Found two vintage US made wrenches in my grandpas garage today [it seems everything I post about is about finding stuff in my grandpas garage] the wrench on the left is a ufica tools wrench, and to the right is a diamond tool company wrench. I estimate both wrenches are from the 1930s-1940s era", "link": "https://www.reddit.com/r/Tools/comments/q8j7ty/found_two_vintage_us_made_wrenches_in_my_grandpas/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "found two vintage -----> us !!!  -----> made !!!  wrenches in my grandpas garage today [it seems everything i post about is about finding stuff in my grandpas garage] the wrench on the left is a ufica tools wrench, and to the right is a diamond tool company wrench. i estimate both wrenches are from the 1930s-1940s era", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "image", "medialink": "https://i.redd.it/qr6oi5afgkt71.jpg", "identifyer": 240988, "year": "2021"}, {"Unnamed: 0": 241935, "autor": "PLSing", "date": 1616975728000, "content": "Discord for tools?? /!/ We’ve made it!\n\nhttps://discord.gg/3kzsxSXxyv", "link": "https://www.reddit.com/r/Tools/comments/mfd6tl/discord_for_tools/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we’ve made", "selectorShort": "make", "MarkedSent": "discord for tools?? /!/ -----> we !!! ’ve -----> made !!!  it!\n\nhttps://discord.gg/3kzsxsxxyv", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/mfd6tl/discord_for_tools/", "identifyer": 241935, "year": "2021"}, {"Unnamed: 0": 242124, "autor": "kn8ife", "date": 1615693643000, "content": "Scored a ton of taps dies and handles at the used tool store...all US made including starret for $35", "link": "https://www.reddit.com/r/Tools/comments/m4n6bn/scored_a_ton_of_taps_dies_and_handles_at_the_used/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "scored a ton of taps dies and handles at the used tool store...all -----> us !!!  -----> made !!!  including starret for $35", "sortedWord": "None", "removed": null, "score": 1, "comments": 45, "media": "image", "medialink": "https://i.redd.it/8g3t0yf71xm61.jpg", "identifyer": 242124, "year": "2021"}, {"Unnamed: 0": 244198, "autor": "SandGoesEverywhere", "date": 1619062506000, "content": "First purchase from Snap-On, all my screwdrivers are off-centered / bent /!/ Hi I’m a student. I decided to order my 3 most used screwdrivers from snap-on just to see the quality for myself before going all rampage on all their products. They arrived in plastic pouch and they were all bent or off-centered. The Phillips #2 cost 32$ CAD!!!! This is just outrageous. I will never buy from them again. I’ll instead buy from different German brands, I’m tired of the sub-quality of US made tools ( ok experience with Klein as well ).\n[new snap-on screwdriver off-centered ](https://youtu.be/LH_TDjkOZIY)", "link": "https://www.reddit.com/r/Tools/comments/mvwgdh/first_purchase_from_snapon_all_my_screwdrivers/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "first purchase from snap-on, all my screwdrivers are off-centered / bent /!/ hi i’m a student. i decided to order my 3 most used screwdrivers from snap-on just to see the quality for myself before going all rampage on all their products. they arrived in plastic pouch and they were all bent or off-centered. the phillips #2 cost 32$ cad!!!! this is just outrageous. i will never buy from them again. i’ll instead buy from different german brands, i’m tired of the sub-quality of -----> us !!!  -----> made !!!  tools ( ok experience with klein as well ).\n[new snap-on screwdriver off-centered ](https://youtu.be/lh_tdjkoziy)", "sortedWord": "None", "removed": null, "score": 1, "comments": 34, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/mvwgdh/first_purchase_from_snapon_all_my_screwdrivers/", "identifyer": 244198, "year": "2021"}, {"Unnamed: 0": 245668, "autor": "SoberBarney", "date": 1613839583000, "content": "Anyone else underwhelmed with SK Customer Service? /!/ Over the last year or so I’ve picked up a few SK tools to build out my Made in USA collection. \n\nThe tools generally (outside of the LP90) have been great. But also over that time, I’ve gotten orders that were forgotten to be shipped, inventory “glitches” that I only heard about when I follow up on an order, and no responses on maintenance questions or about poor chrome/build quality. \n\nI was really excited about stocking up on SK, but is their customer service really this bad? I worry if I ever have to warranty something I’m just going to be ignored. \n\nAs an aside: my issue with my ½” LP90 standard ratchet is the anvil is super loose to the point of wobbling. I know the LP90 has a floating selector so you need to use a light oil, but it easily has the most play out of all my others (SK, SO, HF, Tekton, Craftsman, Husky). Just walking with the ratchet in your hand you can hear clicking from the anvil bouncing around in the ratchet head. And it’s chrome is pitted almost entirely on the back of the ratchet head - SK has ignored me this far (over a week now, no response).", "link": "https://www.reddit.com/r/Tools/comments/lob0u4/anyone_else_underwhelmed_with_sk_customer_service/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "my made", "selectorShort": "make", "MarkedSent": "anyone else underwhelmed with sk customer service? /!/ over the last year or so i’ve picked up a few sk tools to build out -----> my !!!  -----> made !!!  in usa collection. \n\nthe tools generally (outside of the lp90) have been great. but also over that time, i’ve gotten orders that were forgotten to be shipped, inventory “glitches” that i only heard about when i follow up on an order, and no responses on maintenance questions or about poor chrome/build quality. \n\ni was really excited about stocking up on sk, but is their customer service really this bad? i worry if i ever have to warranty something i’m just going to be ignored. \n\nas an aside: my issue with my ½” lp90 standard ratchet is the anvil is super loose to the point of wobbling. i know the lp90 has a floating selector so you need to use a light oil, but it easily has the most play out of all my others (sk, so, hf, tekton, craftsman, husky). just walking with the ratchet in your hand you can hear clicking from the anvil bouncing around in the ratchet head. and it’s chrome is pitted almost entirely on the back of the ratchet head - sk has ignored me this far (over a week now, no response).", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/lob0u4/anyone_else_underwhelmed_with_sk_customer_service/", "identifyer": 245668, "year": "2021"}, {"Unnamed: 0": 246296, "autor": "TheMCM80", "date": 1631377190000, "content": "Can we make a collection of cheap(ish) tool ideas for people just starting out?", "link": "https://www.reddit.com/r/Tools/comments/pmac58/can_we_make_a_collection_of_cheapish_tool_ideas/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "can -----> we !!!  -----> make !!!  a collection of cheap(ish) tool ideas for people just starting out?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/pmac58/can_we_make_a_collection_of_cheapish_tool_ideas/", "identifyer": 246296, "year": "2021"}, {"Unnamed: 0": 253608, "autor": "Decisionsota", "date": 1629304945000, "content": "Rules on Promotions (and poll results) /!/ **TL;DR: The no promotions rule on** r/tools **stands.**\n\nWe've had a \"no promotions\" rule here on r/tools for a long time. We've had some folks reach out and ask about doing some things, and we've floated a couple trial balloons with major manufacturers to gauge community interest.\n\nBecause this community isn't just the mods' community, I didn't feel that we should make the call about whether or not to allow promotions here on our own so we ran a poll. 240 out of 479 votes (50.1%) were for NO PROMOTIONS, EVER. Another 174 votes (36%) were for limited promotions from reputable sources after verification.\n\nBased on the poll, the no promotions rules stand. Two major things from the poll added to this decision. First, a majority (however slight) of the votes were for no promotions, ever. Second, most of the remaining folks wanted some vetting or verification which is a) hard to do (ie, easy enough to fake), b) a lot of work for the mods, and c) would favor big tool companies over individuals or small shops.\n\nWe reserve the right to occasionally host AMAs or things that we think the community would like, but most companies haven't been that interested in doing AMAs (particularly after we make it clear that they can't only answer the easy questions).\n\n**FAQ:**\n\n**What's spammy/promotional?**\n\nC'mon, don't pretend you don't know that what you're doing is promotional. If you're trying to \"build awareness\", \"gauge enthusiasm/interest\", \"generate sales/clicks\", etc etc that's promotional. Surveys, product rollouts, YouTube channel promotions, etc\n\n**I see a spammy/promotional post. Should I downvote and report it?**\n\nYep. We need community members to help shape the community. You can do that by upvoting and responding to posts you think are interesting and downvoting/reporting spam posts. \n\n**You guys suck and hunt down posts.**\n\nWe might suck, but I don't hunt down posts...no way I have time for that.  My reddit time primarily gets spent moderating and not browsing these days. If your post doesn't hit the mod queue, I'm gonna let it be.\n\n**Okay, but** **I have a YouTube and I want to show off my tools.**\n\nCool, make a post that looks like all the posts the rest of us make. If someone asks \"Do you have any more pics? How do you like it?\" you can post a link in your response. If you make a post that is cool and that the community likes, they won't report it and I won't delete it.\n\n**What happens if I make a low-effort post to my YouTube?**\n\nIf it gets reported (by members of the community), it'll probably get removed. If all of your activity on reddit consists of blasting 50 barely relevant subreddits with your weekly videos, I might just permaban you. If you've otherwise been a contributing member of the community, you might get a warning or temp-ban.\n\n**Does this mean no YouTube links?**\n\nNot at all! YouTube is an incredible resource.  If someone asks, \"Hey can I use generic batteries in my tool?\" and you post a YouTube video by a creator who has run real-world tests to evaluate that exact question, you've probably done the OP a service. You can even post links to your own channel when they are relevant to the discussion.\n\n**If I show off a custom tool and someone asks \"are you selling them?\" can I respond with a link.**\n\nGenerally yes, but that can't be your primary activity on the sub and if it becomes clear that you just make posts, ask the question with an alt-account, and then post your link we're gonna ban ya.\n\n**Can I have custom flair as a manufacturer? Are we allowed to post here?**\n\nYes. We are happy to give custom flair to manufacturers or YouTube creators who want to productively engage with our community. Productive engagement means engagement and discussion that most people find useful and helpful. If your posts/comments get consistently downvoted to oblivion, take the hint.\n\n**I represent a manufacturer and we have an idea that we think your members will like.**\n\nSure, message the mods. If it's cool, we might entertain it, but we might delete your message without a response. The mod team isn't being paid and doesn't owe anyone a response, particularly to respond to people asking for exceptions to our community rules that have been voted upon.\n\n**Is the mod team paid/accepting items from manufacturers or creators? Would you be willing to?**\n\nNo. We are not interested in that kind of relationship.\n\n**What about an alternate sub for buy/sell/trade/promotions?**\n\nAnyone is welcome to create such a sub. If it grows large enough and is reasonable civilized, we might link to it.\n\n**How about like a deal sticky?**\n\nWe've done that for Black Friday, and probably would do so again. Manufacturers would be allowed to post on that sticky. More to follow at the appropriate time.", "link": "https://www.reddit.com/r/Tools/comments/p6uyl2/rules_on_promotions_and_poll_results/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we should make", "selectorShort": "make", "MarkedSent": "rules on promotions (and poll results) /!/ **tl;dr: the no promotions rule on** r/tools **stands.**\n\nwe've had a \"no promotions\" rule here on r/tools for a long time. we've had some folks reach out and ask about doing some things, and we've floated a couple trial balloons with major manufacturers to gauge community interest.\n\nbecause this community isn't just the mods' community, i didn't feel that -----> we !!!  -----> should !!!  -----> make !!!  the call about whether or not to allow promotions here on our own so -----> we !!!  ran a poll. 240 out of 479 votes (50.1%) were for no promotions, ever. another 174 votes (36%) were for limited promotions from reputable sources after verification.\n\nbased on the poll, the no promotions rules stand. two major things from the poll added to this decision. first, a majority (however slight) of the votes were for no promotions, ever. second, most of the remaining folks wanted some vetting or verification which is a) hard to do (ie, easy enough to fake), b) a lot of work for the mods, and c) would favor big tool companies over individuals or small shops.\n\nwe reserve the right to occasionally host amas or things that we think the community would like, but most companies haven't been that interested in doing amas (particularly after we make it clear that they can't only answer the easy questions).\n\n**faq:**\n\n**what's spammy/promotional?**\n\nc'mon, don't pretend you don't know that what you're doing is promotional. if you're trying to \"build awareness\", \"gauge enthusiasm/interest\", \"generate sales/clicks\", etc etc that's promotional. surveys, product rollouts, youtube channel promotions, etc\n\n**i see a spammy/promotional post. should i downvote and report it?**\n\nyep. we need community members to help shape the community. you can do that by upvoting and responding to posts you think are interesting and downvoting/reporting spam posts. \n\n**you guys suck and hunt down posts.**\n\nwe might suck, but i don't hunt down posts...no way i have time for that.  my reddit time primarily gets spent moderating and not browsing these days. if your post doesn't hit the mod queue, i'm gonna let it be.\n\n**okay, but** **i have a youtube and i want to show off my tools.**\n\ncool, make a post that looks like all the posts the rest of us make. if someone asks \"do you have any more pics? how do you like it?\" you can post a link in your response. if you make a post that is cool and that the community likes, they won't report it and i won't delete it.\n\n**what happens if i make a low-effort post to my youtube?**\n\nif it gets reported (by members of the community), it'll probably get removed. if all of your activity on reddit consists of blasting 50 barely relevant subreddits with your weekly videos, i might just permaban you. if you've otherwise been a contributing member of the community, you might get a warning or temp-ban.\n\n**does this mean no youtube links?**\n\nnot at all! youtube is an incredible resource.  if someone asks, \"hey can i use generic batteries in my tool?\" and you post a youtube video by a creator who has run real-world tests to evaluate that exact question, you've probably done the op a service. you can even post links to your own channel when they are relevant to the discussion.\n\n**if i show off a custom tool and someone asks \"are you selling them?\" can i respond with a link.**\n\ngenerally yes, but that can't be your primary activity on the sub and if it becomes clear that you just make posts, ask the question with an alt-account, and then post your link we're gonna ban ya.\n\n**can i have custom flair as a manufacturer? are we allowed to post here?**\n\nyes. we are happy to give custom flair to manufacturers or youtube creators who want to productively engage with our community. productive engagement means engagement and discussion that most people find useful and helpful. if your posts/comments get consistently downvoted to oblivion, take the hint.\n\n**i represent a manufacturer and we have an idea that we think your members will like.**\n\nsure, message the mods. if it's cool, we might entertain it, but we might delete your message without a response. the mod team isn't being paid and doesn't owe anyone a response, particularly to respond to people asking for exceptions to our community rules that have been voted upon.\n\n**is the mod team paid/accepting items from manufacturers or creators? would you be willing to?**\n\nno. we are not interested in that kind of relationship.\n\n**what about an alternate sub for buy/sell/trade/promotions?**\n\nanyone is welcome to create such a sub. if it grows large enough and is reasonable civilized, we might link to it.\n\n**how about like a deal sticky?**\n\nwe've done that for black friday, and probably would do so again. manufacturers would be allowed to post on that sticky. more to follow at the appropriate time.", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/p6uyl2/rules_on_promotions_and_poll_results/", "identifyer": 253608, "year": "2021"}, {"Unnamed: 0": 254973, "autor": "tdkspiralii", "date": 1635086778000, "content": "When one don’t have a tool needed for the job, we make one!", "link": "https://www.reddit.com/r/Tools/comments/qetku3/when_one_dont_have_a_tool_needed_for_the_job_we/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "when one don’t have a tool needed for the job, -----> we !!!  -----> make !!!  one!", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": "image", "medialink": "https://i.redd.it/dg3z7hbyuev71.jpg", "identifyer": 254973, "year": "2021"}], "name": "makeTools2021"}