{"interestingcomments": [{"Unnamed: 0": 240629, "autor": "BalloonKnotBandit", "date": 1618484093000, "content": "Wedding registry /!/ Gotta come up with some stuff for the registry. I’ve got all the basics covered. Y’all got any ideas of cool tools or shop things you’d ask for from $20 - $300?  -Dewalt guy.", "link": "https://www.reddit.com/r/Tools/comments/mrc7b7/wedding_registry/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "wedding registry /!/ gotta -----> come !!!  -----> up !!!  -----> with !!!  some stuff for the registry. i’ve got all the basics covered. y’all got any ideas of cool tools or shop things you’d ask for from $20 - $300?  -dewalt guy.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/mrc7b7/wedding_registry/", "identifyer": 240629, "year": "2021"}, {"Unnamed: 0": 241934, "autor": "cognizantant", "date": 1616976119000, "content": "Teach me about tool storage please /!/ Hi tool aficionados,\n\nI’m not particularly handy but I’m working on it. I grew up in a less than handy home so I’ve been learning it as I go. I’ve collected tools as I’ve done projects and find myself trying to come up with a way to organize them. \n\nI’m finishing a remodel now that finally gives me a workshop. \n\nI’m wondering how I should store my tools in my workshop. How do you do it?\n\nMy current thinking is to by a 44” us general tool chest for hand tools and the power tools I use more often. Then add some wall cabinets for the less frequently used power tools. \n\nAnyone have a great solution? Am I on the right track? Money isn’t a problem if the storage solution makes sense. \n\nThanks!", "link": "https://www.reddit.com/r/Tools/comments/mfdb0l/teach_me_about_tool_storage_please/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "teach me about tool storage please /!/ hi tool aficionados,\n\ni’m not particularly handy but i’m working on it. i grew up in a less than handy home so i’ve been learning it as i go. i’ve collected tools as i’ve done projects and find myself trying to -----> come !!!  -----> up !!!  -----> with !!!  a way to organize them. \n\ni’m finishing a remodel now that finally gives me a workshop. \n\ni’m wondering how i should store my tools in my workshop. how do you do it?\n\nmy current thinking is to by a 44” us general tool chest for hand tools and the power tools i use more often. then add some wall cabinets for the less frequently used power tools. \n\nanyone have a great solution? am i on the right track? money isn’t a problem if the storage solution makes sense. \n\nthanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/mfdb0l/teach_me_about_tool_storage_please/", "identifyer": 241934, "year": "2021"}, {"Unnamed: 0": 246515, "autor": "SoaDMTGguy", "date": 1610911662000, "content": "Are new tools on Craigslist generally stolen? /!/ I see a lot of “new in box” power tools, usually the battery stuff, on my Craigslist (sfbay). I wonder how so many new tools came to be offered for sale in this way. The only answers I can come up with are that they could not be returned for some reason, or are stolen. Can anyone share more thoughts on this?", "link": "https://www.reddit.com/r/Tools/comments/kzd123/are_new_tools_on_craigslist_generally_stolen/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "are new tools on craigslist generally stolen? /!/ i see a lot of “new in box” power tools, usually the battery stuff, on my craigslist (sfbay). i wonder how so many new tools came to be offered for sale in this way. the only answers i can -----> come !!!  -----> up !!!  -----> with !!!  are that they could not be returned for some reason, or are stolen. can anyone share more thoughts on this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 39, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/kzd123/are_new_tools_on_craigslist_generally_stolen/", "identifyer": 246515, "year": "2021"}, {"Unnamed: 0": 249037, "autor": "sgtSandbag", "date": 1620310958000, "content": "Looking for a drill bit that can turn an auger anchor /!/ Hello fine r/Tools folks. I recently put together a swing set that has auger-style anchors (like these: https://media.tractorsupply.com/is/image/TractorSupplyCompany/1181626?$456$ ) and they were a HUGE pain to twist into the ground.\n\n\nIs there some kind of drill bit I could use to take them in and out more easily? I tried to find some kind of U shaped clamp or something like a large socket with a slot cut out of it, but apparently \"clamp\" \"twist\" \"turn\" \"slot\" and anything else I could come up with to describe it are terms for other actual drill bit and bit holder styles, so none of my googling turned up anything usable.\n\n\nAny help or ideas is greatly appreciated!", "link": "https://www.reddit.com/r/Tools/comments/n68et3/looking_for_a_drill_bit_that_can_turn_an_auger/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "looking for a drill bit that can turn an auger anchor /!/ hello fine r/tools folks. i recently put together a swing set that has auger-style anchors (like these: https://media.tractorsupply.com/is/image/tractorsupplycompany/1181626?$456$ ) and they were a huge pain to twist into the ground.\n\n\nis there some kind of drill bit i could use to take them in and out more easily? i tried to find some kind of u shaped clamp or something like a large socket -----> with !!!  a slot cut out of it, but apparently \"clamp\" \"twist\" \"turn\" \"slot\" and anything else i could -----> come !!!  -----> up !!!  -----> with !!!  to describe it are terms for other actual drill bit and bit holder styles, so none of my googling turned -----> up !!!  anything usable.\n\n\nany help or ideas is greatly appreciated!", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/Tools/comments/n68et3/looking_for_a_drill_bit_that_can_turn_an_auger/", "identifyer": 249037, "year": "2021"}, {"Unnamed: 0": 251685, "autor": "krista", "date": 1633497519000, "content": "questions regarding full face respirators and my 3m 7800s /!/ hello!\n\ni'm doing my yearly ppe review, and i have a pair of folks whom i generally trust on stuff like this that don't sound like they are making sense.\n\n\nthey're trying to convince me that a 3m ff-400 is a significant upgrade from my trusty 3m 7800s. i don't think it is. for one, the 7800s is more expensive. b), it's still being used in the field by emergency crews.\n\nplus, it fits,mi can still get every part there is for it... every bit is replaceable... and i have nearly every accessory i'll need for it for my predictable future. i have 2 pairs of prescription inserts, lens protectors, the welding shield, various adapters i really don't use, a reasonable set of spare parts, and a handful of the the filters i need. plus i have a bunch of the clip-on n95 prefilters.\n\nit's about a bit over a decade old and despite a lot of use, it's still in mint shape. i take care of my tools.\n\ni was planning on getting a papr for it one of these years if i could find a good ~~excuse~~ project i could use one in.\n\n... and my tool guys are trying to sell me on a ff-400. normally, i'd try one out for a while and see if i like it, but as it's the plague, i can't really do so. \n\ni think i feel pretty sound in my position, and can't come up with a good reason to even bother trying a ff-400, and the best these two yahoos can come up with is ”the ff-400 is better in every way”.\n\n\ni haven't paying attention to advances in full face respirators for a while. i haven't really needed to. hopefully someone here knows a lot about these :)\n\nany thoughts on this?", "link": "https://www.reddit.com/r/Tools/comments/q2drf7/questions_regarding_full_face_respirators_and_my/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "questions regarding full face respirators and my 3m 7800s /!/ hello!\n\ni'm doing my yearly ppe review, and i have a pair of folks whom i generally trust on stuff like this that don't sound like they are making sense.\n\n\nthey're trying to convince me that a 3m ff-400 is a significant upgrade from my trusty 3m 7800s. i don't think it is. for one, the 7800s is more expensive. b), it's still being used in the field by emergency crews.\n\nplus, it fits,mi can still get every part there is for it... every bit is replaceable... and i have nearly every accessory i'll need for it for my predictable future. i have 2 pairs of prescription inserts, lens protectors, the welding shield, various adapters i really don't use, a reasonable set of spare parts, and a handful of the the filters i need. plus i have a bunch of the clip-on n95 prefilters.\n\nit's about a bit over a decade old and despite a lot of use, it's still in mint shape. i take care of my tools.\n\ni was planning on getting a papr for it one of these years if i could find a good ~~excuse~~ project i could use one in.\n\n... and my tool guys are trying to sell me on a ff-400. normally, i'd try one out for a while and see if i like it, but as it's the plague, i can't really do so. \n\ni think i feel pretty sound in my position, and can't -----> come !!!  -----> up !!!  -----> with !!!  a good reason to even bother trying a ff-400, and the best these two yahoos can -----> come !!!  -----> up !!!  -----> with !!!  is ”the ff-400 is better in every way”.\n\n\ni haven't paying attention to advances in full face respirators for a while. i haven't really needed to. hopefully someone here knows a lot about these :)\n\nany thoughts on this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/q2drf7/questions_regarding_full_face_respirators_and_my/", "identifyer": 251685, "year": "2021"}, {"Unnamed: 0": 251737, "autor": "tatertothetot", "date": 1633404022000, "content": "Ring Roller Rebuild - cylinders for rolling 1/8\" &amp; 1/4\" steel wire into rings (pics linked) - looking for suggestions /!/ A couple years ago I acquired a, well, apparatus, with which to roll rings out of 1/8\" and 1/4\" steel wire. The roller is made up of a frame of 1/8\" steel plate with a hole in each end, and three spindles, each with a set of different sized cylinders for their respective ring sizes. One spindle end is inserted into the frame and the other lays in a cutout on the other end, and has a latch that locks it in place. Each cylinder on the spindle has a hole of each size drilled into the surface into which then end of the appropriate sized wire is inserted. The crank handle is then turned manually, rolling the wire (which is mounted on a spool) into rings of the intended size while the other hand guides the wire onto the cylinder. Once the number of rings desired is rolled the tension is backed off, the wire is cut and removed from the roller, and cut once more to separate the individual rings.\n\n[Pics of the ring roller and parts](https://imgur.com/a/3f6SMMQ)\n\nThis setup came from a man who is a master woodworker. He has made everything from drums, houses, kayaks, and even replicated an antique saw-the-lady-in-half box from the 20s (I WISH I had pics of this!!) that is now in service in the magic theater in our tourist town. He came up with this design, and it has worked for him for many years prior to my acquisition. 2 years in and the inevitable happened - it failed. Layers of the wood he compressed and treated (with what I don't remember, but can find out) finally separated and now the handle just turns the whole shaft but not the cylinders. I knew this was coming eventually. I do have time to work on this, as I don't need these rings sizes immediately. Backup is a manual, one-at-a-time roller that isn't near as convenient.\n\nI checked with a machine shop, and still have another one or two to check with, but the figure I have so far to remake this has been way out of the budget, and I will most likely be rebuilding this myself if it is going to happen and not break the bank.\n\nNotes:   \nThe \"gear\" on the spindle by the crank does not currently serve a purpose. There is significant springback with the coiled steel, and it needs to be controlled while releasing the tension, and the gear added too much incremental stop on the release where a third hand was needed to hold on to the wire, control the crank, and release the gear stop. This was removed before I acquired the roller, and that is what I was told. Rolling the 1/8\" is easy, the 1/4\" is a little tougher, but doable, even by a little guy like me.\n\nI should be able to reuse the crank handle and shaft, unless it ends up destroyed in disassembly, but I don't think that will happen. \n\nI do have a lathe.\n\nAdvice on the rebuild, materials, or other ideas on how to go about getting the same end product - multiple steel rings in a matter of minutes - is welcome and appreciated.", "link": "https://www.reddit.com/r/Tools/comments/q1matu/ring_roller_rebuild_cylinders_for_rolling_18_14/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "ring roller rebuild - cylinders for rolling 1/8\" &amp; 1/4\" steel wire into rings (pics linked) - looking for suggestions /!/ a couple years ago i acquired a, well, apparatus, with which to roll rings out of 1/8\" and 1/4\" steel wire. the roller is made up of a frame of 1/8\" steel plate with a hole in each end, and three spindles, each with a set of different sized cylinders for their respective ring sizes. one spindle end is inserted into the frame and the other lays in a cutout on the other end, and has a latch that locks it in place. each cylinder on the spindle has a hole of each size drilled into the surface into which then end of the appropriate sized wire is inserted. the crank handle is then turned manually, rolling the wire (which is mounted on a spool) into rings of the intended size while the other hand guides the wire onto the cylinder. once the number of rings desired is rolled the tension is backed off, the wire is cut and removed from the roller, and cut once more to separate the individual rings.\n\n[pics of the ring roller and parts](https://imgur.com/a/3f6smmq)\n\nthis setup came from a man who is a master woodworker. he has made everything from drums, houses, kayaks, and even replicated an antique saw-the-lady-in-half box from the 20s (i wish i had pics of this!!) that is now in service in the magic theater in our tourist town. he -----> came !!!  -----> up !!!  -----> with !!!  this design, and it has worked for him for many years prior to my acquisition. 2 years in and the inevitable happened - it failed. layers of the wood he compressed and treated (with what i don't remember, but can find out) finally separated and now the handle just turns the whole shaft but not the cylinders. i knew this was coming eventually. i do have time to work on this, as i don't need these rings sizes immediately. backup is a manual, one-at-a-time roller that isn't near as convenient.\n\ni checked with a machine shop, and still have another one or two to check with, but the figure i have so far to remake this has been way out of the budget, and i will most likely be rebuilding this myself if it is going to happen and not break the bank.\n\nnotes:   \nthe \"gear\" on the spindle by the crank does not currently serve a purpose. there is significant springback with the coiled steel, and it needs to be controlled while releasing the tension, and the gear added too much incremental stop on the release where a third hand was needed to hold on to the wire, control the crank, and release the gear stop. this was removed before i acquired the roller, and that is what i was told. rolling the 1/8\" is easy, the 1/4\" is a little tougher, but doable, even by a little guy like me.\n\ni should be able to reuse the crank handle and shaft, unless it ends up destroyed in disassembly, but i don't think that will happen. \n\ni do have a lathe.\n\nadvice on the rebuild, materials, or other ideas on how to go about getting the same end product - multiple steel rings in a matter of minutes - is welcome and appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/q1matu/ring_roller_rebuild_cylinders_for_rolling_18_14/", "identifyer": 251737, "year": "2021"}, {"Unnamed: 0": 255664, "autor": "jrjocham", "date": 1622645052000, "content": "How can I keep my tools clean? /!/ So now that COVID is dialing back, I'm going back to work at an old job. It involved working on industrial kitchen equipment, so my tools got regularly completely coated in used cooking oil, grease, dirt, and whatever else lurks on the floor behind a fryer. The last time I did this job, my tools got so coated in crap that they were forever sticky. This time around, I'm getting new tools for the job and I'm thinking ahead to try to come up with ideas to use the tools and also keep them cleaner. I considered wrapping them in plastic bags, but that would probably get in the way. Maybe shrink wrap them, or if I can find some heat shrink big enough, wrap them in that. When the tool gets too dirty to use, I can then just peel the wrap off and rewrap it. Does anyone have any better ideas?", "link": "https://www.reddit.com/r/Tools/comments/nqneqz/how_can_i_keep_my_tools_clean/", "origin": "Reddit", "suborigin": "Tools", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how can i keep my tools clean? /!/ so now that covid is dialing back, i'm going back to work at an old job. it involved working on industrial kitchen equipment, so my tools got regularly completely coated in used cooking oil, grease, dirt, and whatever else lurks on the floor behind a fryer. the last time i did this job, my tools got so coated in crap that they were forever sticky. this time around, i'm getting new tools for the job and i'm thinking ahead to try to -----> come !!!  -----> up !!!  -----> with !!!  ideas to use the tools and also keep them cleaner. i considered wrapping them in plastic bags, but that would probably get in the way. maybe shrink wrap them, or if i can find some heat shrink big enough, wrap them in that. when the tool gets too dirty to use, i can then just peel the wrap off and rewrap it. does anyone have any better ideas?", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": null, "medialink": "https://www.reddit.com/r/Tools/comments/nqneqz/how_can_i_keep_my_tools_clean/", "identifyer": 255664, "year": "2021"}], "name": "withTools2021"}