{"interestingcomments": [{"Unnamed: 0": 264695, "autor": "raayze", "date": 1582451127000, "content": "I built a hookah with an empty Belvedere bottle /!/ One day my gf told me she would like to have a unique hookah for birthday. Because we are huge hookah freaks and I have the time/tools to do this, we did some designs and planning and created our first hookah.\nI‘m a type of person who thinks bigger as soon as something works well - like it did with the hookahs.\nLong story short, we are know creating different hookahs for friends/customers besides our full time job and it‘s fun as hell (we also created a one man company for it). Before anyone asks, we don‘t really make profit of it because we want to keep it as a hobby.\n[Here is an example](https://imgur.com/a/NUuK50g) - hope you like it!", "link": "https://www.reddit.com/r/DIY/comments/f87gxx/i_built_a_hookah_with_an_empty_belvedere_bottle/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we are know creating", "selectorShort": "create", "MarkedSent": "i built a hookah with an empty belvedere bottle /!/ one day my gf told me she would like to have a unique hookah for birthday. because we are huge hookah freaks and i have the time/tools to do this, we did some designs and planning and created our first hookah.\ni‘m a type of person who thinks bigger as soon as something works well - like it did with the hookahs.\nlong story short, -----> we !!!  -----> are !!!  -----> know !!!  -----> creating !!!  different hookahs for friends/customers besides our full time job and it‘s fun as hell (-----> we !!!  also created a one man company for it). before anyone asks, we don‘t really make profit of it because we want to keep it as a hobby.\n[here is an example](https://imgur.com/a/nuuk50g) - hope you like it!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/f87gxx/i_built_a_hookah_with_an_empty_belvedere_bottle/", "identifyer": 264695, "year": "2020"}, {"Unnamed: 0": 264831, "autor": "MistaDubya", "date": 1579348500000, "content": "Creating (or finding) foldable tray table (like the airline tray tables that fold into armrest.) /!/ Recently purchased mom a wheelchair and noticed it is hard for her to maneuver around kitchen because she can’t hold onto items and propel herself at the same time.  \nI wanted to create or find a table that will pivot out of the way and still be large enough to carry breakfast.   My mind went to something like the tray tables I’ve seen in some of front rows of planes.  With no seat in front of them, these chairs have the tray that folds in half and slides down into the armrest.  Any ideas?", "link": "https://www.reddit.com/r/DIY/comments/eqfjqd/creating_or_finding_foldable_tray_table_like_the/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  (or finding) foldable tray table (like the airline tray tables that fold into armrest.) /!/ recently purchased mom a wheelchair and noticed it is hard for her to maneuver around kitchen because she can’t hold onto items and propel herself at the same time.  \ni wanted to create or find a table that will pivot out of the way and still be large enough to carry breakfast.   my mind went to something like the tray tables i’ve seen in some of front rows of planes.  with no seat in front of them, these chairs have the tray that folds in half and slides down into the armrest.  any ideas?", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/eqfjqd/creating_or_finding_foldable_tray_table_like_the/", "identifyer": 264831, "year": "2020"}, {"Unnamed: 0": 280789, "autor": "felloutislife", "date": 1579521931000, "content": "The \"Spray Gun Buddy\" /!/ [https://youtu.be/\\_ICIzM7RbL8](https://youtu.be/_ICIzM7RbL8)\n\n Join us as we create a bespoke spray holder nicknamed the \"Spray Buddy\" designed to hold the sprayer during the filling and priming process. This amazing holder makes things more efficient and less daunting when it comes to filling the sprayer in between coats or items of furniture.", "link": "https://www.reddit.com/r/DIY/comments/erce0f/the_spray_gun_buddy/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "the \"spray gun buddy\" /!/ [https://youtu.be/\\_icizm7rbl8](https://youtu.be/_icizm7rbl8)\n\n join us as -----> we !!!  -----> create !!!  a bespoke spray holder nicknamed the \"spray buddy\" designed to hold the sprayer during the filling and priming process. this amazing holder makes things more efficient and less daunting when it comes to filling the sprayer in between coats or items of furniture.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/erce0f/the_spray_gun_buddy/", "identifyer": 280789, "year": "2020"}, {"Unnamed: 0": 285709, "autor": "Firegrl124", "date": 1590886999000, "content": "Creating a planter out of a drawer /!/ Hello All! I am working on a garden, and I have a several projects I am attempting. I am going to post each separate project, with hopes that you all give me your collective wisdom. \n\nI have a set of drawers, about 3' x 3' . I would like to convert them to a 2' x 4' or 2x 6' planter. I mean for these planters to go on foundation next to a fence. There is already a bit of soil on this foundation, and I'd add mulch and more soil, so no bottom necessary. \n\nMy questions are: 1. how do I break open this drawer to make it into parts. It looks like its a standard wood glue + nails, and bottom stapled in construction. \n\n2. Should I use wood glue when I put the planter together? I am assuming a bit of wood glue to keep it steady as I nail the sides together. \n\nI am limited on tools and resources, and rich on labor and googling. I welcome all suggestions.", "link": "https://www.reddit.com/r/DIY/comments/gtprrv/creating_a_planter_out_of_a_drawer/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "-----> creating !!!  a planter out of a drawer /!/ hello all! i am working on a garden, and i have a several projects i am attempting. i am going to post each separate project, with hopes that you all give me your collective wisdom. \n\ni have a set of drawers, about 3' x 3' . i would like to convert them to a 2' x 4' or 2x 6' planter. i mean for these planters to go on foundation next to a fence. there is already a bit of soil on this foundation, and i'd add mulch and more soil, so no bottom necessary. \n\nmy questions are: 1. how do i break open this drawer to make it into parts. it looks like its a standard wood glue + nails, and bottom stapled in construction. \n\n2. should i use wood glue when i put the planter together? i am assuming a bit of wood glue to keep it steady as i nail the sides together. \n\ni am limited on tools and resources, and rich on labor and googling. i welcome all suggestions.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/gtprrv/creating_a_planter_out_of_a_drawer/", "identifyer": 285709, "year": "2020"}, {"Unnamed: 0": 290772, "autor": "dzenifr", "date": 1598769965000, "content": "Created New Scales for a Knife /!/  tl;dr Found a dull knife at work and decided to create new wood scales in my free time. Follow the [Imgur link](https://imgur.com/gallery/rXZ2r2p) for more details. :)\n\n[After and Before](https://preview.redd.it/kr65g59c63k51.jpg?width=2506&amp;format=pjpg&amp;auto=webp&amp;s=e0cdf6794208b5c63bc7fae3692ae37d2fc530da)\n\nKnife: Uline swag\n\nWood: 1/8\" birch ply\n\nThis was a fun project. I haven't finished a knife project before, and this one was relatively simple considering the tools at my disposal. I would consider using thicker ply next time to give it more width in my hands, but otherwise I'm satisfied with these new, wood scales as replacements for the original aluminum ones. The knife weight looks like it'd be heavier, but when you pick it up it feels So Light. If I wasn't giving this to a friend now, I'd be stoked to have this as my EDC. Going to have to make another one for myself and *not* show pictures of it to my friends.", "link": "https://www.reddit.com/r/DIY/comments/ij8epz/created_new_scales_for_a_knife/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "created", "selectorShort": "create", "MarkedSent": "-----> created !!!  new scales for a knife /!/  tl;dr found a dull knife at work and decided to create new wood scales in my free time. follow the [imgur link](https://imgur.com/gallery/rxz2r2p) for more details. :)\n\n[after and before](https://preview.redd.it/kr65g59c63k51.jpg?width=2506&amp;format=pjpg&amp;auto=webp&amp;s=e0cdf6794208b5c63bc7fae3692ae37d2fc530da)\n\nknife: uline swag\n\nwood: 1/8\" birch ply\n\nthis was a fun project. i haven't finished a knife project before, and this one was relatively simple considering the tools at my disposal. i would consider using thicker ply next time to give it more width in my hands, but otherwise i'm satisfied with these new, wood scales as replacements for the original aluminum ones. the knife weight looks like it'd be heavier, but when you pick it up it feels so light. if i wasn't giving this to a friend now, i'd be stoked to have this as my edc. going to have to make another one for myself and *not* show pictures of it to my friends.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ij8epz/created_new_scales_for_a_knife/", "identifyer": 290772, "year": "2020"}], "name": "createDIY2020"}