{"interestingcomments": [{"Unnamed: 0": 274945, "autor": "mass922", "date": 1589896612000, "content": "We brought chickens into our family and wanted to give them the best coop we could.. Link in comments is a chronicle of drafting our design, materials, tools, and construction of a safe, secure coop for our egg-laying hens. It's not perfect, but the chooks dig it.", "link": "https://www.reddit.com/r/DIY/comments/gmp1c9/we_brought_chickens_into_our_family_and_wanted_to/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "our design", "selectorShort": "design", "MarkedSent": "we brought chickens into our family and wanted to give them the best coop we could.. link in comments is a chronicle of drafting -----> our !!!  -----> design !!! , materials, tools, and construction of a safe, secure coop for -----> our !!!  egg-laying hens. it's not perfect, but the chooks dig it.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": "image", "medialink": "https://i.redd.it/reg65jxa9qz41.jpg", "identifyer": 274945, "year": "2020"}, {"Unnamed: 0": 274946, "autor": "mass922", "date": 1589896330000, "content": "We brought chickens into our family and wanted to give them the best coop we could.. This is a chronicle of drafting our design, materials, tools, and construction of a safe, secure coop for our egg-laying hens. It's not perfect, but the chooks dig it. [OC]", "link": "https://www.reddit.com/r/DIY/comments/gmoyf2/we_brought_chickens_into_our_family_and_wanted_to/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "our design", "selectorShort": "design", "MarkedSent": "we brought chickens into our family and wanted to give them the best coop we could.. this is a chronicle of drafting -----> our !!!  -----> design !!! , materials, tools, and construction of a safe, secure coop for -----> our !!!  egg-laying hens. it's not perfect, but the chooks dig it. [oc]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": "rich:video", "medialink": "https://www.youtube.com/watch?v=Z3MFYMjY0qk", "identifyer": 274946, "year": "2020"}, {"Unnamed: 0": 279966, "autor": "dubc4", "date": 1606419812000, "content": "Designed and built this modular LED work light system + bonus flashlight. Works off of a Milwaukee M12 tool battery. Made the design files available for anyone who wants to make one too :)", "link": "https://www.reddit.com/r/DIY/comments/k1lxnx/designed_and_built_this_modular_led_work_light/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  and built this modular led work light system + bonus flashlight. works off of a milwaukee m12 tool battery. made the design files available for anyone who wants to make one too :)", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 10, "media": "rich:video", "medialink": "https://youtu.be/jgoX4JeeSr8", "identifyer": 279966, "year": "2020"}, {"Unnamed: 0": 281947, "autor": "HaroldTheScarecrow", "date": 1593786262000, "content": "The awesome lady who steers my ship and fills my sails wanted some work done in our back yard. Designed it, priced it, and came in under budget. And that means today is new tool day!", "link": "https://www.reddit.com/r/DIY/comments/hkjxph/the_awesome_lady_who_steers_my_ship_and_fills_my/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "the awesome lady who steers my ship and fills my sails wanted some work done in our back yard. -----> designed !!!  it, priced it, and came in under budget. and that means today is new tool day!", "sortedWord": "None", "removed": null, "score": 3, "comments": 14, "media": "link", "medialink": "https://imgur.com/RitVmS9", "identifyer": 281947, "year": "2020"}, {"Unnamed: 0": 282127, "autor": "dctimmer", "date": 1588473127000, "content": "I built a raised bed with netting using old deck boards and bamboo! /!/ [https://imgur.com/a/CNj5Kno](https://imgur.com/a/CNj5Kno)\n\nFinally finished my raised beds today. Project has taken several months. Materials have been ad-hoc -- sourced from local craigslist ads. Designed as I went to fit the materials available.\n\nProject Time 10 hrs over several months.\n\n**Materials for the box.**\n\n(4) 2x4 miscellaneous (for the four corner posts)\n\n(2) 2x2 miscellaneous (ended up needing some supporting posts) due to bowing out in the middle)\n\n(4) x 10’x1”x6” Used Desk Boards\n\n(2) x 4’x1”x6” Used Deck Boards\n\n(lots) Bamboo!\n\nTwine\n\nWire\n\nDeer netting\n\n(4) Bricks\n\nFire pit\n\nMiscellaneous fire wood\n\nDeck screws\n\nTop soil\n\n**Tools**\n\nFence post digger\n\nSledge hammer\n\nReciprocating saw\n\nAngle grinder\n\nDrill/driver\n\nPower washer\n\n**Day 1. Building the Box!**\n\nPicked up some used deck boards from a neighbor.\n\nPrepared the site by leveling ground where the box would go. For this I just leveled the outline and pushed the extra into the box, since we’d need to fill it with soil anyway.\n\nUsed a fence post digger to dig down a foot or so on each corner.\n\nCut some 2x4 stakes well over the needed height and then hammered them into the holes.\n\nScrewed in the deck boards, 2 per side.\n\nCut the excess 2x4 once the box was finished\n\n**Day 2. Digging up the yard**\n\nLeveled out a hump in the yard from where some stump grindings had been spread the previous year and grass had grown over. Just tossed the sod in to the box and chopped it up.\n\n**Day 3. Top fill and gardening soil from Home depot.**\n\nNot my favorite. 20 bags of it filled in the rest. I had read okay reviews on the top soil. It is very cheap. Reality was worse than reviews. Too many stones.\n\n**Day 4. Bamboo adventure.**\n\nResponded to craigslist ad for free bamboo. Cut it down with a reciprocating saw. Hauled it back on the top rack. Started a fire in the fire pit. Slowing spon each piece around the flames to draw the resin to the outside and give it a nice sheen and added strength.\n\n**Day 5. Setting the bamboo posts.** \n\nDug out the caddy corners to the 2x4. The gap in the corner from where the deck boards meet. Placed the bamboo in the hole and identified cut points. Used an angle grinder to cut the bamboo posts to length. Then, put screws in top of the 2x4 at each post and secured the bamboo by wrapping the wire to the post. (Alternatively I could have some area on the 2x4 when i was cutting the posts to tie it, but I was just winging the design.\n\n**Day 6. Building the netting frame**.\n\nUsed twine to secure the top cross pieces to the posts.\n\n**Day 7. Netting the sides.** \n\nCut the netting to length, then used twine ties to tie it down. The sides and top I tied down completely. The long sides I tied to the top cross pieces, then attached the bottom to a piece of bamboo that I could lift up and down. \n\nI was worried squirrel might be able to lift up the bamboo that holds the netting, so I placed the ends through bricks placed on each end.\n\nTo get in I just remove the bricks from each side, then lift it up.\n\nAlso pressure washed my fence.", "link": "https://www.reddit.com/r/DIY/comments/gciz9g/i_built_a_raised_bed_with_netting_using_old_deck/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "i built a raised bed with netting using old deck boards and bamboo! /!/ [https://imgur.com/a/cnj5kno](https://imgur.com/a/cnj5kno)\n\nfinally finished my raised beds today. project has taken several months. materials have been ad-hoc -- sourced from local craigslist ads. -----> designed !!!  as i went to fit the materials available.\n\nproject time 10 hrs over several months.\n\n**materials for the box.**\n\n(4) 2x4 miscellaneous (for the four corner posts)\n\n(2) 2x2 miscellaneous (ended up needing some supporting posts) due to bowing out in the middle)\n\n(4) x 10’x1”x6” used desk boards\n\n(2) x 4’x1”x6” used deck boards\n\n(lots) bamboo!\n\ntwine\n\nwire\n\ndeer netting\n\n(4) bricks\n\nfire pit\n\nmiscellaneous fire wood\n\ndeck screws\n\ntop soil\n\n**tools**\n\nfence post digger\n\nsledge hammer\n\nreciprocating saw\n\nangle grinder\n\ndrill/driver\n\npower washer\n\n**day 1. building the box!**\n\npicked up some used deck boards from a neighbor.\n\nprepared the site by leveling ground where the box would go. for this i just leveled the outline and pushed the extra into the box, since we’d need to fill it with soil anyway.\n\nused a fence post digger to dig down a foot or so on each corner.\n\ncut some 2x4 stakes well over the needed height and then hammered them into the holes.\n\nscrewed in the deck boards, 2 per side.\n\ncut the excess 2x4 once the box was finished\n\n**day 2. digging up the yard**\n\nleveled out a hump in the yard from where some stump grindings had been spread the previous year and grass had grown over. just tossed the sod in to the box and chopped it up.\n\n**day 3. top fill and gardening soil from home depot.**\n\nnot my favorite. 20 bags of it filled in the rest. i had read okay reviews on the top soil. it is very cheap. reality was worse than reviews. too many stones.\n\n**day 4. bamboo adventure.**\n\nresponded to craigslist ad for free bamboo. cut it down with a reciprocating saw. hauled it back on the top rack. started a fire in the fire pit. slowing spon each piece around the flames to draw the resin to the outside and give it a nice sheen and added strength.\n\n**day 5. setting the bamboo posts.** \n\ndug out the caddy corners to the 2x4. the gap in the corner from where the deck boards meet. placed the bamboo in the hole and identified cut points. used an angle grinder to cut the bamboo posts to length. then, put screws in top of the 2x4 at each post and secured the bamboo by wrapping the wire to the post. (alternatively i could have some area on the 2x4 when i was cutting the posts to tie it, but i was just winging the design.\n\n**day 6. building the netting frame**.\n\nused twine to secure the top cross pieces to the posts.\n\n**day 7. netting the sides.** \n\ncut the netting to length, then used twine ties to tie it down. the sides and top i tied down completely. the long sides i tied to the top cross pieces, then attached the bottom to a piece of bamboo that i could lift up and down. \n\ni was worried squirrel might be able to lift up the bamboo that holds the netting, so i placed the ends through bricks placed on each end.\n\nto get in i just remove the bricks from each side, then lift it up.\n\nalso pressure washed my fence.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/gciz9g/i_built_a_raised_bed_with_netting_using_old_deck/", "identifyer": 282127, "year": "2020"}, {"Unnamed: 0": 289867, "autor": "serialkillertswift", "date": 1603806095000, "content": "Designed &amp; Installed Our Own Glam Master Closet/Dressing Room in a Weird Space /!/ Photos: [https://imgur.com/gallery/kTYOjG4](https://imgur.com/gallery/kTYOjG4)\n\nHi everyone! My husband and I are currently in the process of converting our basement into a master suite, and my favorite but also trickiest project is finally finished as of yesterday — the master closet/dressing room! This was a very weird space with a sump pump in one corner, various different height bulkheads, a pipe on one wall from floor to ceiling, and a big ugly metal door leading to the backyard. There was a good amount of prep work before designing/installing the closet, including new floors/lights/paint (professionally done), rerouting a duct on one wall, and replacing the sump pump. Even after all that, I thought for a while that we would have to hire professional closet designers because of the strange features of the space, but after five different quotes, I realized it wasn’t going to be possible to get everything I wanted and stay in budget (\\~$10K; my husband and I both make good money, and we have no kids). We got designs that were super nice within budget, just not with everything I wanted (a good amount of hanging space behind doors, an island, a vanity, built-in hampers, etc). So I went looking for DIY options.\n\nI ended up using [closets.com](http://closets.com/)’s DIY online custom closet design tool and designing the whole thing myself. The tool allows you to customize the height and width of every unit individually down to an eighth of an inch and plan everything out with a great deal of specificity, so it worked even for the weird space/level of customization we needed. All told, the closet units came out to $9,800. Most of that cost came from the doors/drawers and upgrading to shaker cabinets over a flat front. The weird corner cabinet to hide the sump pump wasn’t cheap either. It took about 6 weeks for everything to arrive from the day I ordered/paid, and it came on huge pallets altogether weighing a total of more than 2,000 pounds.\n\nMy husband and stepfather did the full installation. They are both super handy, and my stepfather has experience in carpentry (as a hobby), but it was still a relatively tricky/difficult process. There were just SO many different components, and the instructions were (naturally) very generalized and not specific to our custom closet. Closets.com does a dual support system where there’s both a rail support at the top and it’s also floor supported. It took a good five full working days in total to complete the installation. No specialized tools were required (except we used a jigsaw to cut a hole in the bottom of the corner cabinet for the sump pump), just drills and screwdrivers for the most part. Apart from the rail supports, it was pretty similar to putting together furniture (if the instructions were really vague and there were a million parts).\n\nI am so, so grateful to my husband and my stepfather for working on this for me. They are incredible. I did the styling. For those who may wonder, my husband’s clothes are in the hanging space behind the doors and in some drawers. The total dimensions of the room are 14 feet by 12 feet. I am so happy with how it turned out and wanted to share!", "link": "https://www.reddit.com/r/DIY/comments/jj1bft/designed_installed_our_own_glam_master/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  &amp; installed our own glam master closet/dressing room in a weird space /!/ photos: [https://imgur.com/gallery/ktyojg4](https://imgur.com/gallery/ktyojg4)\n\nhi everyone! my husband and i are currently in the process of converting our basement into a master suite, and my favorite but also trickiest project is finally finished as of yesterday — the master closet/dressing room! this was a very weird space with a sump pump in one corner, various different height bulkheads, a pipe on one wall from floor to ceiling, and a big ugly metal door leading to the backyard. there was a good amount of prep work before designing/installing the closet, including new floors/lights/paint (professionally done), rerouting a duct on one wall, and replacing the sump pump. even after all that, i thought for a while that we would have to hire professional closet designers because of the strange features of the space, but after five different quotes, i realized it wasn’t going to be possible to get everything i wanted and stay in budget (\\~$10k; my husband and i both make good money, and we have no kids). we got designs that were super nice within budget, just not with everything i wanted (a good amount of hanging space behind doors, an island, a vanity, built-in hampers, etc). so i went looking for diy options.\n\ni ended up using [closets.com](http://closets.com/)’s diy online custom closet design tool and designing the whole thing myself. the tool allows you to customize the height and width of every unit individually down to an eighth of an inch and plan everything out with a great deal of specificity, so it worked even for the weird space/level of customization we needed. all told, the closet units came out to $9,800. most of that cost came from the doors/drawers and upgrading to shaker cabinets over a flat front. the weird corner cabinet to hide the sump pump wasn’t cheap either. it took about 6 weeks for everything to arrive from the day i ordered/paid, and it came on huge pallets altogether weighing a total of more than 2,000 pounds.\n\nmy husband and stepfather did the full installation. they are both super handy, and my stepfather has experience in carpentry (as a hobby), but it was still a relatively tricky/difficult process. there were just so many different components, and the instructions were (naturally) very generalized and not specific to our custom closet. closets.com does a dual support system where there’s both a rail support at the top and it’s also floor supported. it took a good five full working days in total to complete the installation. no specialized tools were required (except we used a jigsaw to cut a hole in the bottom of the corner cabinet for the sump pump), just drills and screwdrivers for the most part. apart from the rail supports, it was pretty similar to putting together furniture (if the instructions were really vague and there were a million parts).\n\ni am so, so grateful to my husband and my stepfather for working on this for me. they are incredible. i did the styling. for those who may wonder, my husband’s clothes are in the hanging space behind the doors and in some drawers. the total dimensions of the room are 14 feet by 12 feet. i am so happy with how it turned out and wanted to share!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/jj1bft/designed_installed_our_own_glam_master/", "identifyer": 289867, "year": "2020"}, {"Unnamed: 0": 295987, "autor": "inZania", "date": 1594057493000, "content": "First furniture we designed and made: mid-century modern CNC cabinet/bar-cart with hidden mini-fridge, blender, wine rack, and more /!/ Full project, including Fusion 360 plans, [here](https://www.technicallywizardry.com/diy-cnc-cabinets/). \n\nThis was the first piece of furniture for our home that my girlfriend and I made with our Maslow CNC router. I taught myself Fusion 360. She (graphic designer) provided the aspen tree design (native to the area around our cabin) and did the sanding/staining. We also took some inspiration from mid-century modern design.\n\n**Final Product**\n\nDimensions: 60\" (W), 22\" (D), 36\" (H)\n\n* Image: [completed bar cart](https://content.technicallywizardry.com/2020/07/06144236/bar-cart-full-1536x1152.jpg).\n* The [shelves in the back with the blender](https://content.technicallywizardry.com/2020/07/06144429/bar-cart-side.jpg).\n* The [hidden mini-fridge](https://content.technicallywizardry.com/2020/07/06153513/bar-cart-fridge.jpg.webp).\n\n[Fusion 360 source file](https://a360.co/2Nqnxt1).\n\n**WIP Images**\n\n* [The back pieces, cut from MDF, with holes for power cables](https://content.technicallywizardry.com/2020/07/06174258/bar-cart-pieces-1024x660.jpg).\n* [Printing the aspen door facade](https://content.technicallywizardry.com/2020/07/06172425/bar-cart-aspen-doors.jpg).\n* [Staining and gluing the door.](https://content.technicallywizardry.com/2020/07/06173217/bar-cart-door.jpg)\n* [Assembling the frame](https://content.technicallywizardry.com/2020/07/06173125/bar-cart-in-progress-1464x1536.jpg).\n* [Woodshop with our tools](https://content.technicallywizardry.com/2020/07/06172848/workshop-wood-1536x1152.jpg).\n\n**Build Process**\n\nEach of the CNC pieces should be ready to cut from the Fusion 360 file. There was almost zero post-work. After printing the CNC parts, the process was as follows:\n\n* A **palm sander** and **belt sander** to clean up the edges.\n* Most of it was finished with a **Red Oak** stain, except for the door (**Natural** colored stain). \n* **Wood glue** (and clamps) to put the two pieces of the door together.\n* A **finishing nail gun** to hold it together (refer to [assembly image](https://content.technicallywizardry.com/2020/07/06173125/bar-cart-in-progress-1464x1536.jpg)).\n* A **drill** to put the hinges / hardware in-place.\n\n**BOM**\n\n* 2 sheets of sanded 4x8 3/4\" plywood.\n* 1 sheet of 4x8 3/4\" MDF (particle board).\n* 1 gallon can of Red Oak stain.\n* 2 sets of hinges &amp; metal clasps.\n* Wood glue.\n\nTotal price: &lt; $200. Plus, a mini-fridge to put inside.\n\n**Tools**\n\n* Maslow CNC Router (image).\n* Palm sander; belt sander.\n* Wood clamps.\n* Drill.", "link": "https://www.reddit.com/r/DIY/comments/hmcbhz/first_furniture_we_designed_and_made_midcentury/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we designed", "selectorShort": "design", "MarkedSent": "first furniture -----> we !!!  -----> designed !!!  and made: mid-century modern cnc cabinet/bar-cart with hidden mini-fridge, blender, wine rack, and more /!/ full project, including fusion 360 plans, [here](https://www.technicallywizardry.com/diy-cnc-cabinets/). \n\nthis was the first piece of furniture for our home that my girlfriend and i made with our maslow cnc router. i taught myself fusion 360. she (graphic designer) provided the aspen tree design (native to the area around our cabin) and did the sanding/staining. we also took some inspiration from mid-century modern design.\n\n**final product**\n\ndimensions: 60\" (w), 22\" (d), 36\" (h)\n\n* image: [completed bar cart](https://content.technicallywizardry.com/2020/07/06144236/bar-cart-full-1536x1152.jpg).\n* the [shelves in the back with the blender](https://content.technicallywizardry.com/2020/07/06144429/bar-cart-side.jpg).\n* the [hidden mini-fridge](https://content.technicallywizardry.com/2020/07/06153513/bar-cart-fridge.jpg.webp).\n\n[fusion 360 source file](https://a360.co/2nqnxt1).\n\n**wip images**\n\n* [the back pieces, cut from mdf, with holes for power cables](https://content.technicallywizardry.com/2020/07/06174258/bar-cart-pieces-1024x660.jpg).\n* [printing the aspen door facade](https://content.technicallywizardry.com/2020/07/06172425/bar-cart-aspen-doors.jpg).\n* [staining and gluing the door.](https://content.technicallywizardry.com/2020/07/06173217/bar-cart-door.jpg)\n* [assembling the frame](https://content.technicallywizardry.com/2020/07/06173125/bar-cart-in-progress-1464x1536.jpg).\n* [woodshop with our tools](https://content.technicallywizardry.com/2020/07/06172848/workshop-wood-1536x1152.jpg).\n\n**build process**\n\neach of the cnc pieces should be ready to cut from the fusion 360 file. there was almost zero post-work. after printing the cnc parts, the process was as follows:\n\n* a **palm sander** and **belt sander** to clean up the edges.\n* most of it was finished with a **red oak** stain, except for the door (**natural** colored stain). \n* **wood glue** (and clamps) to put the two pieces of the door together.\n* a **finishing nail gun** to hold it together (refer to [assembly image](https://content.technicallywizardry.com/2020/07/06173125/bar-cart-in-progress-1464x1536.jpg)).\n* a **drill** to put the hinges / hardware in-place.\n\n**bom**\n\n* 2 sheets of sanded 4x8 3/4\" plywood.\n* 1 sheet of 4x8 3/4\" mdf (particle board).\n* 1 gallon can of red oak stain.\n* 2 sets of hinges &amp; metal clasps.\n* wood glue.\n\ntotal price: &lt; $200. plus, a mini-fridge to put inside.\n\n**tools**\n\n* maslow cnc router (image).\n* palm sander; belt sander.\n* wood clamps.\n* drill.", "sortedWord": "None", "removed": null, "score": 0, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/hmcbhz/first_furniture_we_designed_and_made_midcentury/", "identifyer": 295987, "year": "2020"}, {"Unnamed: 0": 306975, "autor": "captain_carrot", "date": 1589917243000, "content": "[Feedback/comments request] I'm about to tackle building a raised wooden patio/deck that I've modeled. I've done a decent amount of research for my design, but I'd like to get some external comments for any issues it might have before I start ordering lumber and building. /!/ The images from the 3D rendering I've made using Onshape can be found in [this album](https://imgur.com/a/eJDGcKe) with some comments on the images regarding the overall design.  \n  \n\n[This is a view of the current area](https://i.imgur.com/mN9979O.jpg). The existing double doors into the basement and the door into the garage sit about 20\" above ground level and never had any steps leading up when we purchased the house. There is a dryer vent and outer faucet that currently sit about 3-4 inches above where the proposed surface of the deck would be, so those will likely have to be relocated.  \n  \nThe overall dimensions are roughly 20'x12', 18\" from ground level to the surface of the deck. The prepared ground right now is a stripped away patch where a cheap stamped concrete patio used to sit; after hauling away the concrete pavers theres a couple inches of crushed stone/dirt at the suface. I plan to add another 2 inches of crushed stone beneath to mitigate insects, digging animals, and vegetation growth. \n  \nThe idea is to use pressure treated lumber throughout, with composite decking for the decking, stair surfaces, and step facia.   \n  \nThe frame ends on either side of the sill plate will be mounted with inverted double 2x10 joist hangars due to the proximity to the stairs/adjoining wall of the foundation. All joists will be anchored with galvanized joist hangers and joist screws. I plan to use joist tape on top of the whole frame to help mitigate moisture buildup, especially between the sandwiched 2x10s on the frame. 3\" deck screws used throughout, with composite decking screws for the decking.   \n  \nFootings will be 6x6 pressure treated posts supported by 18\" columns sunk 40\" deep per local code to sit below the frost line (NE USA).  \n  \nRough estimates put materials at $850 for lumber, $1500 for the composite decking, and other $1000 for misc items like joist hangers, hardware, some tools, concrete, etc.  \n  \nThis is my first time tackling a big project like this and I would greatly appreciate anyone's input as a dummy-check to make sure I'm not overlooking any glaring issues with the design before I pull the trigger and get started. Thanks in advance!", "link": "https://www.reddit.com/r/DIY/comments/gmvnl2/feedbackcomments_request_im_about_to_tackle/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "[feedback/comments request] i'm about to tackle building a raised wooden patio/deck that i've modeled. i've done a decent amount of research for -----> my !!!  -----> design !!! , but i'd like to get some external comments for any issues it might have before i start ordering lumber and building. /!/ the images from the 3d rendering i've made using onshape can be found in [this album](https://imgur.com/a/ejdgcke) with some comments on the images regarding the overall design.  \n  \n\n[this is a view of the current area](https://i.imgur.com/mn9979o.jpg). the existing double doors into the basement and the door into the garage sit about 20\" above ground level and never had any steps leading up when we purchased the house. there is a dryer vent and outer faucet that currently sit about 3-4 inches above where the proposed surface of the deck would be, so those will likely have to be relocated.  \n  \nthe overall dimensions are roughly 20'x12', 18\" from ground level to the surface of the deck. the prepared ground right now is a stripped away patch where a cheap stamped concrete patio used to sit; after hauling away the concrete pavers theres a couple inches of crushed stone/dirt at the suface. i plan to add another 2 inches of crushed stone beneath to mitigate insects, digging animals, and vegetation growth. \n  \nthe idea is to use pressure treated lumber throughout, with composite decking for the decking, stair surfaces, and step facia.   \n  \nthe frame ends on either side of the sill plate will be mounted with inverted double 2x10 joist hangars due to the proximity to the stairs/adjoining wall of the foundation. all joists will be anchored with galvanized joist hangers and joist screws. i plan to use joist tape on top of the whole frame to help mitigate moisture buildup, especially between the sandwiched 2x10s on the frame. 3\" deck screws used throughout, with composite decking screws for the decking.   \n  \nfootings will be 6x6 pressure treated posts supported by 18\" columns sunk 40\" deep per local code to sit below the frost line (ne usa).  \n  \nrough estimates put materials at $850 for lumber, $1500 for the composite decking, and other $1000 for misc items like joist hangers, hardware, some tools, concrete, etc.  \n  \nthis is my first time tackling a big project like this and i would greatly appreciate anyone's input as a dummy-check to make sure i'm not overlooking any glaring issues with the design before i pull the trigger and get started. thanks in advance!", "sortedWord": "None", "removed": null, "score": 2, "comments": 8, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/gmvnl2/feedbackcomments_request_im_about_to_tackle/", "identifyer": 306975, "year": "2020"}], "name": "designDIY2020"}