{"interestingcomments": [{"Unnamed: 0": 362591, "autor": "Feebeh", "date": 1610405719000, "content": "Prevent scaffold board from warping? /!/ Hi,\n\nDue to WFH during the pandemic, my partner and I liked the idea of creating our own desk. We saw a lot of creations on Pintrest using scaffold boards.\n\nWe bought some boards from a local timber yard and endeavoured to make our own (my partner is an Engineer and has the tools to hand).\n\nAlbeit, the first time we made the table top **the wood warped after a couple days**, we looked online and found this could be just due to excess moisture as we'd added a varnish and oil, however it has happened for the second time without adding any liquid.\n\nCan anyone please offer some advice as to why the wood has warped/any preventative measures.\n\nThanks very much.", "link": "https://www.reddit.com/r/DIY/comments/kved3n/prevent_scaffold_board_from_warping/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "prevent scaffold board from warping? /!/ hi,\n\ndue to wfh during the pandemic, my partner and i liked the idea of creating our own desk. we saw a lot of creations on pintrest using scaffold boards.\n\nwe bought some boards from a local timber yard and endeavoured to make our own (my partner is an engineer and has the tools to hand).\n\nalbeit, the first time -----> we !!!  -----> made !!!  the table top **the wood warped after a couple days**, -----> we !!!  looked online and found this could be just due to excess moisture as -----> we !!! 'd added a varnish and oil, however it has happened for the second time without adding any liquid.\n\ncan anyone please offer some advice as to why the wood has warped/any preventative measures.\n\nthanks very much.", "sortedWord": "None", "removed": null, "score": 2, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/kved3n/prevent_scaffold_board_from_warping/", "identifyer": 362591, "year": "2021"}], "name": "makeDIY2021"}