{"interestingcomments": [{"Unnamed: 0": 286730, "autor": "Seth_Altobelli", "date": 1605132184000, "content": "I made these awesome custom 3D printed pegboard tool holders! /!/ I made these to fit all of my tools onto my pegboard and hold them securely. Below is a link to the thingiverse page with the files and an instructables tutorial about the tool holders.\n\nInstructables: [https://www.instructables.com/Custom-3D-Printed-Pegboard-Toolholders-Fits-Any-To/](https://www.instructables.com/Custom-3D-Printed-Pegboard-Toolholders-Fits-Any-To/)\n\nThingiverse: [https://www.thingiverse.com/seth\\_a/designs](https://www.thingiverse.com/seth_a/designs)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8q96wy1jooy51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=b9d045c25d255dd96f8d4037c2a6460dc0a0c2dd", "link": "https://www.reddit.com/r/DIY/comments/jshjjp/i_made_these_awesome_custom_3d_printed_pegboard/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i made these awesome custom -----> 3d !!!  -----> printed !!!  pegboard tool holders! /!/ i made these to fit all of my tools onto my pegboard and hold them securely. below is a link to the thingiverse page with the files and an instructables tutorial about the tool holders.\n\ninstructables: [https://www.instructables.com/custom-3d-printed-pegboard-toolholders-fits-any-to/](https://www.instructables.com/custom-3d-printed-pegboard-toolholders-fits-any-to/)\n\nthingiverse: [https://www.thingiverse.com/seth\\_a/designs](https://www.thingiverse.com/seth_a/designs)\n\n&amp;#x200b;\n\nhttps://preview.redd.it/8q96wy1jooy51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=b9d045c25d255dd96f8d4037c2a6460dc0a0c2dd", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/jshjjp/i_made_these_awesome_custom_3d_printed_pegboard/", "identifyer": 286730, "year": "2020"}, {"Unnamed: 0": 286731, "autor": "Seth_Altobelli", "date": 1605131819000, "content": "I made these awesome custom 3D printed pegboard tool holders! /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/jshf36/i_made_these_awesome_custom_3d_printed_pegboard/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i made these awesome custom -----> 3d !!!  -----> printed !!!  pegboard tool holders! /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/jshf36/i_made_these_awesome_custom_3d_printed_pegboard/", "identifyer": 286731, "year": "2020"}, {"Unnamed: 0": 288251, "autor": "swighton", "date": 1586264512000, "content": "If you want to make steel parts it's possible to form them with 3D printed tools", "link": "https://www.reddit.com/r/DIY/comments/fwk450/if_you_want_to_make_steel_parts_its_possible_to/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "if you want to make steel parts it's possible to form them with -----> 3d !!!  -----> printed !!!  tools", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "rich:video", "medialink": "https://youtu.be/WuY2-OrT9ig", "identifyer": 288251, "year": "2020"}, {"Unnamed: 0": 300179, "autor": "pcmofo", "date": 1589199130000, "content": "Going to build a Bender clock. Need help deciding on materials/technique /!/ I’m planning on building a life size replica of Benders head that is also a clock. See my inspiration and demo of what the eyes look like here. \n\nhttps://imgur.com/a/FKhEUsz\n\nAn arduino will power 4x 16x8 LED arrays allowing me to illuminate and animate two eyes or 4 digits for a clock. I plan on using a distance or motion sensor to trigger eye animations and sound clips to play. I’ve already started prototyping the electronics and writing code. \n\nThe part where I need some advice is what material or technique to construct the head out of. Benders head is basically a cylinder with a dome on top and a visor that protrudes. However, because I’m going to be stuffing it with electronics and putting it on/near a wall, making a cylinder doesn’t make sense. A “D” or “C” shape with a removable flat back makes more sense. \n\nThe final design will be super smooth and painted with a metallic paint and weathered a bit. No need to be actually metal. The visor will be constructed like a flashlight where it is a hollow tube that I drop a lens into with a filter then the PCB with LEDs on. I’ll most likely prototype this part first before building the head to fit it’s proportions\n\nI’ve considered a ton of options. Because of the prototyping and electronics I am considering 3D printing but I have no experience or access to a printer. I also don’t know how well I could coat the outside of the 3D print to give it a smooth finish that can hold paint. \n\nI could cut vertical sections from plywood etc and then stack/glue them to create a hollow wooden shape. I have some woodworking tools so this would be relatively easy but time consuming. I’ve also done some fiberglass work. Maybe a combination of techniques?", "link": "https://www.reddit.com/r/DIY/comments/ghmdv8/going_to_build_a_bender_clock_need_help_deciding/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "going to build a bender clock. need help deciding on materials/technique /!/ i’m planning on building a life size replica of benders head that is also a clock. see my inspiration and demo of what the eyes look like here. \n\nhttps://imgur.com/a/fkheusz\n\nan arduino will power 4x 16x8 led arrays allowing me to illuminate and animate two eyes or 4 digits for a clock. i plan on using a distance or motion sensor to trigger eye animations and sound clips to play. i’ve already started prototyping the electronics and writing code. \n\nthe part where i need some advice is what material or technique to construct the head out of. benders head is basically a cylinder with a dome on top and a visor that protrudes. however, because i’m going to be stuffing it with electronics and putting it on/near a wall, making a cylinder doesn’t make sense. a “d” or “c” shape with a removable flat back makes more sense. \n\nthe final design will be super smooth and painted with a metallic paint and weathered a bit. no need to be actually metal. the visor will be constructed like a flashlight where it is a hollow tube that i drop a lens into with a filter then the pcb with leds on. i’ll most likely prototype this part first before building the head to fit it’s proportions\n\ni’ve considered a ton of options. because of the prototyping and electronics i am considering 3d printing but i have no experience or access to a printer. i also don’t know how well i could coat the outside of the -----> 3d !!!  -----> print !!!  to give it a smooth finish that can hold paint. \n\ni could cut vertical sections from plywood etc and then stack/glue them to create a hollow wooden shape. i have some woodworking tools so this would be relatively easy but time consuming. i’ve also done some fiberglass work. maybe a combination of techniques?", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ghmdv8/going_to_build_a_bender_clock_need_help_deciding/", "identifyer": 300179, "year": "2020"}, {"Unnamed: 0": 304951, "autor": "Daron_Acemoglu", "date": 1605644497000, "content": "Hex Wrench type tool for narrow space /!/ I'm replacing one of the feet on a bike trainer. \n\nI've put together an m8 bolt with a few nuts and washers to support the weight of the trainer and will pad the bolt head somehow so that it doesn't ruin the floor. \n\nwhat I haven't figured out is how to tighten the top most nut on the bolt that will hold the foot in place on the frame. \n\nYou can see the album of images linked below to understand exactly the problem. Basically a normal hex wrnech won't fit into the frame.  \n\nOriginally, a plastic piece was used to hold the nut in place seen in the third pic. I don't really have the resources to 3D print a new one. It seems like there must be a wrench of some sort that can be applied from the top or with very narrow arms. \n\nSince the bolt can be tightened from the bottom all I need is a tool to hold the nut in place until it is against the frame and will tighten/loosen in place (I may need to add a lock washer but hopefully not)\n\nAny suggestions appreciated. \n\n[https://imgur.com/a/Qwzdhdc](https://imgur.com/a/Qwzdhdc)", "link": "https://www.reddit.com/r/DIY/comments/jw0ljn/hex_wrench_type_tool_for_narrow_space/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "hex wrench type tool for narrow space /!/ i'm replacing one of the feet on a bike trainer. \n\ni've put together an m8 bolt with a few nuts and washers to support the weight of the trainer and will pad the bolt head somehow so that it doesn't ruin the floor. \n\nwhat i haven't figured out is how to tighten the top most nut on the bolt that will hold the foot in place on the frame. \n\nyou can see the album of images linked below to understand exactly the problem. basically a normal hex wrnech won't fit into the frame.  \n\noriginally, a plastic piece was used to hold the nut in place seen in the third pic. i don't really have the resources to -----> 3d !!!  -----> print !!!  a new one. it seems like there must be a wrench of some sort that can be applied from the top or with very narrow arms. \n\nsince the bolt can be tightened from the bottom all i need is a tool to hold the nut in place until it is against the frame and will tighten/loosen in place (i may need to add a lock washer but hopefully not)\n\nany suggestions appreciated. \n\n[https://imgur.com/a/qwzdhdc](https://imgur.com/a/qwzdhdc)", "sortedWord": "None", "removed": null, "score": 0, "comments": 25, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/jw0ljn/hex_wrench_type_tool_for_narrow_space/", "identifyer": 304951, "year": "2020"}], "name": "printDIY2020"}