{"interestingcomments": [{"Unnamed: 0": 333086, "autor": "dup_int", "date": 1610706393000, "content": "Mount PSU to custom wooden open case /!/ Picture for the context: https://imgur.com/a/qRs5vRF\n\nHi. I regret not planning this in detail, now struggling with how to mount PSU to my non standard case. It has no other screw holes on other sides. I thought I will use angle bracket like one used in furniture but I can’t find such a small one (like 10x10mm). Tried 2.5” HDD mounting pocket for laptops, obviously holes do not fit to those on PSU. \nI also met only one place selling 3D printed mounting sets like I need, but delivery cost from USA to Europe is killing me, so it’s also not an option.\nI don’t have skills and tools to cut the details I need from a metal.\nAny suggestions appreciated.", "link": "https://www.reddit.com/r/DIY/comments/kxrx38/mount_psu_to_custom_wooden_open_case/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "mount psu to custom wooden open case /!/ picture for the context: https://imgur.com/a/qrs5vrf\n\nhi. i regret not planning this in detail, now struggling with how to mount psu to my non standard case. it has no other screw holes on other sides. i thought i will use angle bracket like one used in furniture but i can’t find such a small one (like 10x10mm). tried 2.5” hdd mounting pocket for laptops, obviously holes do not fit to those on psu. \ni also met only one place selling -----> 3d !!!  -----> printed !!!  mounting sets like i need, but delivery cost from usa to europe is killing me, so it’s also not an option.\ni don’t have skills and tools to cut the details i need from a metal.\nany suggestions appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/kxrx38/mount_psu_to_custom_wooden_open_case/", "identifyer": 333086, "year": "2021"}, {"Unnamed: 0": 338430, "autor": "EJX-a", "date": 1634280949000, "content": "What lights to get for a smooth effect. /!/ I am 3d printing a small tool shelf that will have transparent (or about 70-60% opaque) supports. I want to run some kind of lighting through the internal to male them glow. I don't need anything super bright, but i want it to be 1 continuous glow.\n\nI first thought of just an led strip. But the leds are too far aparts, leaving bright spots and dark spots. Then i looked at high density leds. They look like they would work, but I'll need to put quite a bit more work in just to power the full meter and a half necessary to light all the supports.\n\nIm fine using high density leds, but I'd rather find an easier method if there is one. I've already done a week of design, and have about 4 weeks of printing to do.\n\nAnyone got any suggestions?", "link": "https://www.reddit.com/r/DIY/comments/q8is31/what_lights_to_get_for_a_smooth_effect/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": "what lights to get for a smooth effect. /!/ i am -----> 3d !!!  -----> printing !!!  a small tool shelf that will have transparent (or about 70-60% opaque) supports. i want to run some kind of lighting through the internal to male them glow. i don't need anything super bright, but i want it to be 1 continuous glow.\n\ni first thought of just an led strip. but the leds are too far aparts, leaving bright spots and dark spots. then i looked at high density leds. they look like they would work, but i'll need to put quite a bit more work in just to power the full meter and a half necessary to light all the supports.\n\nim fine using high density leds, but i'd rather find an easier method if there is one. i've already done a week of design, and have about 4 weeks of printing to do.\n\nanyone got any suggestions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/q8is31/what_lights_to_get_for_a_smooth_effect/", "identifyer": 338430, "year": "2021"}, {"Unnamed: 0": 359325, "autor": "tcm0116", "date": 1624554146000, "content": "Closet Removal /!/ My son's room had a closet that ran the full length of the room. That much closet space was not really necessary and the room was already pretty small to begin with, so I decided to remove half the closet to make a nook for his bed.\n\n&amp;#x200B;\n\nI used a straight edge to mark the center between the doors on the drywall and then used a drywall saw, utility knife, and pry bar to remove the framing and the drywall.\n\n&amp;#x200B;\n\nI pulled the wiring out of the wll and then used a reciprocating saw to cut the chipboard on the top of the closet and the studs and then removed the framing.\n\n&amp;#x200B;\n\nI added a new plug box to the old back wall of the closet and to the wall next to the door. I also added framing for the new side wall and to close off the of the plant ledge.\n\n&amp;#x200B;\n\nI did the initial drywall work, but ended up paying someone to finish it because the wall on the right was very uneven and I don't have a texture sprayer.\n\n&amp;#x200B;\n\nOnce the drywall was complete, it was time to re-paint the stripes. First, I painted the red stripe color on the wall and then taped over that color. I used painter's tape to space out the stripes. After I finished taping, I painted back over the tape with the red stripe color to seal the edges of the tape. I then painted the grey wall color over everything. After the paint had dried, I pulled off the tape to reveal the finished stripes.\n\n&amp;#x200B;\n\nI wanted to install some lighting over where the head of the bed was going to be, so I used floating shelves from Home Depot and installed strip lighting using aluminum strip light track and 3D printed end caps. The wiring is run though the shelf and the controller is glued to the void in the back of the shelf with the IR receiver hanging out the bottom of the shelf. The strip lights in the two shelves are connected in series to the controller in the bottom shelf with the wiring run through the wall. I 3D printed a bracket for the power block and ran the power cable through the wall.\n\n&amp;#x200B;\n\nIt was a fun project and I'm really happy with how it turned out.", "link": "https://www.reddit.com/r/DIY/comments/o754f8/closet_removal/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "closet removal /!/ my son's room had a closet that ran the full length of the room. that much closet space was not really necessary and the room was already pretty small to begin with, so i decided to remove half the closet to make a nook for his bed.\n\n&amp;#x200b;\n\ni used a straight edge to mark the center between the doors on the drywall and then used a drywall saw, utility knife, and pry bar to remove the framing and the drywall.\n\n&amp;#x200b;\n\ni pulled the wiring out of the wll and then used a reciprocating saw to cut the chipboard on the top of the closet and the studs and then removed the framing.\n\n&amp;#x200b;\n\ni added a new plug box to the old back wall of the closet and to the wall next to the door. i also added framing for the new side wall and to close off the of the plant ledge.\n\n&amp;#x200b;\n\ni did the initial drywall work, but ended up paying someone to finish it because the wall on the right was very uneven and i don't have a texture sprayer.\n\n&amp;#x200b;\n\nonce the drywall was complete, it was time to re-paint the stripes. first, i painted the red stripe color on the wall and then taped over that color. i used painter's tape to space out the stripes. after i finished taping, i painted back over the tape with the red stripe color to seal the edges of the tape. i then painted the grey wall color over everything. after the paint had dried, i pulled off the tape to reveal the finished stripes.\n\n&amp;#x200b;\n\ni wanted to install some lighting over where the head of the bed was going to be, so i used floating shelves from home depot and installed strip lighting using aluminum strip light track and -----> 3d !!!  -----> printed !!!  end caps. the wiring is run though the shelf and the controller is glued to the void in the back of the shelf with the ir receiver hanging out the bottom of the shelf. the strip lights in the two shelves are connected in series to the controller in the bottom shelf with the wiring run through the wall. i 3d printed a bracket for the power block and ran the power cable through the wall.\n\n&amp;#x200b;\n\nit was a fun project and i'm really happy with how it turned out.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o754f8/closet_removal/", "identifyer": 359325, "year": "2021"}], "name": "printDIY2021"}