{"interestingcomments": [{"Unnamed: 0": 334743, "autor": "cha0s421", "date": 1623844927000, "content": "Custom Shop Storage /!/ I was inspired by Adam Savage's custom tool storage stands( u/adamsavage, mods won't let me post youtube video, search \"Adam Savage's Custom Tool Storage Stands\" ). I thought about this project for quite a while, and came up with this ultimate design. It works really well in my shop. I can move them around to wherever I'm working and have easy access to everything. I love how nothing is hidden, and everything is easily accessible.\n\n[https://imgur.com/gallery/VJsBnjt](https://imgur.com/gallery/VJsBnjt)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/weepe5jabm571.jpg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=615ec65c58887a75d34d6edf60b0f5d38b6fe404", "link": "https://www.reddit.com/r/DIY/comments/o138j7/custom_shop_storage/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "custom shop storage /!/ i was inspired by adam savage's custom tool storage stands( u/adamsavage, mods won't let me post youtube video, search \"adam savage's custom tool storage stands\" ). i thought about this project for quite a while, and -----> came !!!  -----> up !!!  -----> with !!!  this ultimate design. it works really well in my shop. i can move them around to wherever i'm working and have easy access to everything. i love how nothing is hidden, and everything is easily accessible.\n\n[https://imgur.com/gallery/vjsbnjt](https://imgur.com/gallery/vjsbnjt)\n\n&amp;#x200b;\n\nhttps://preview.redd.it/weepe5jabm571.jpg?width=768&amp;format=pjpg&amp;auto=webp&amp;s=615ec65c58887a75d34d6edf60b0f5d38b6fe404", "sortedWord": "None", "removed": null, "score": 352, "comments": 103, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o138j7/custom_shop_storage/", "identifyer": 334743, "year": "2021"}, {"Unnamed: 0": 336632, "autor": "rAlfredJones", "date": 1626397922000, "content": "Best way to prop up a couch? /!/ For years I've kept my TV (an absurdly heavy 70\" 2010-era conference room thing i got free off Craigslist) on a built-in desk in my house. It's a very convenient place and anyway it's way too heavy to reposition by myself. The only problem, though, is that it puts the TV at a slightly uncomfortable height, with the bottom at about 36\" off the ground. A few years ago I had the clever idea of installing an also-free IKEA futon bunk bed opposite it (the closest thing I could find to a bona fide double-decker couch), which allowed people to watch from both heights. This worked BRILLIANTLY while my kids were little. They and their friends could pile up on both, with 10 or so sitting directly in front of the screen. However, now that they're a bit larger and COVID put a damper on parties, no one uses the top. \n\nSo what I'd like to do is put a normal three-seater couch in front of it, but I want to raise it up 18 inches or so to match the slightly high TV. I've thought about a plywood box, new legs, risers, etc., but my level of skill/experience/tools, which is \"beginner,\" has kept me from coming up with a practical plan. So: Any clever ideas? Assume that I would be willing to acquire any sort of couch for purpose.\n\ntl;dr how do I raise the level of a couch 18\"", "link": "https://www.reddit.com/r/DIY/comments/ol6cwk/best_way_to_prop_up_a_couch/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "best way to prop up a couch? /!/ for years i've kept my tv (an absurdly heavy 70\" 2010-era conference room thing i got free off craigslist) on a built-in desk in my house. it's a very convenient place and anyway it's way too heavy to reposition by myself. the only problem, though, is that it puts the tv at a slightly uncomfortable height, with the bottom at about 36\" off the ground. a few years ago i had the clever idea of installing an also-free ikea futon bunk bed opposite it (the closest thing i could find to a bona fide double-decker couch), which allowed people to watch from both heights. this worked brilliantly while my kids were little. they and their friends could pile up on both, with 10 or so sitting directly in front of the screen. however, now that they're a bit larger and covid put a damper on parties, no one uses the top. \n\nso what i'd like to do is put a normal three-seater couch in front of it, but i want to raise it up 18 inches or so to match the slightly high tv. i've thought about a plywood box, new legs, risers, etc., but my level of skill/experience/tools, which is \"beginner,\" has kept me from -----> coming !!!  -----> up !!!  -----> with !!!  a practical plan. so: any clever ideas? assume that i would be willing to acquire any sort of couch for purpose.\n\ntl;dr how do i raise the level of a couch 18\"", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ol6cwk/best_way_to_prop_up_a_couch/", "identifyer": 336632, "year": "2021"}, {"Unnamed: 0": 340974, "autor": "coffeetoffeefrosty", "date": 1611023028000, "content": "Moving my bed to the walk in closet so I can utilize the bedroom space I have for other things. I’m having a problem coming up with an easy way to raise my mattress off the floor without a lot of building as I don’t have many tools. Mainly looking for creative ideas please! /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/l09yhg/moving_my_bed_to_the_walk_in_closet_so_i_can/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "moving my bed to the walk in closet so i can utilize the bedroom space i have for other things. i’m having a problem -----> coming !!!  -----> up !!!  -----> with !!!  an easy way to raise my mattress off the floor without a lot of building as i don’t have many tools. mainly looking for creative ideas please! /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l09yhg/moving_my_bed_to_the_walk_in_closet_so_i_can/", "identifyer": 340974, "year": "2021"}, {"Unnamed: 0": 346686, "autor": "JMU94", "date": 1612829709000, "content": "Alaska Milling Hardwood Floors /!/ Long Story Short: \n\n\\-Bought a property 3 months ago with a old barn in the back\n\n\\-Turning Barn into my own home, Doing all the work myself\n\n\\-New septic system required felling 13 Trees. 9 of which are white oak\n\n\\-Did 90% of the felling myself, in my research - got fired up on milling\n\n\\-I have a Cheap 20in Craftsman Chainsaw and bought an $80 alaskan Mill from Walmart online.\n\n\\-I wanted to Mill wood for a project in the house, I mean....how cool is it to build a part of your house with wood from the property. Totally dope! \n\n\\-Learned about the drying times which threw a wrench in the idea. \n\n\\-While brainstorming, I came up with Hardwood flooring as one of the last steps of the building process. So Maybe I could wait 6-7 months before installing. If I milled the white oaks tomorrow...Could I use that wood to lay flooring in 6-7 months? \n\n\\-I'm going full bore rogue on this - likely doing it in the next day or so - any tips? \n\n\\-Any other ideas for things to make with the wood? Im not really into the country aesthetics..... looking to design a super young/modern home. \n\n\\-Maybe sell the wood if that doesn't work out? \n\n\\-Spam me with help or Fry me with discouragement. Im thankful either way!", "link": "https://www.reddit.com/r/DIY/comments/lfpwje/alaska_milling_hardwood_floors/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "alaska milling hardwood floors /!/ long story short: \n\n\\-bought a property 3 months ago with a old barn in the back\n\n\\-turning barn into my own home, doing all the work myself\n\n\\-new septic system required felling 13 trees. 9 of which are white oak\n\n\\-did 90% of the felling myself, in my research - got fired up on milling\n\n\\-i have a cheap 20in craftsman chainsaw and bought an $80 alaskan mill from walmart online.\n\n\\-i wanted to mill wood for a project in the house, i mean....how cool is it to build a part of your house with wood from the property. totally dope! \n\n\\-learned about the drying times which threw a wrench in the idea. \n\n\\-while brainstorming, i -----> came !!!  -----> up !!!  -----> with !!!  hardwood flooring as one of the last steps of the building process. so maybe i could wait 6-7 months before installing. if i milled the white oaks tomorrow...could i use that wood to lay flooring in 6-7 months? \n\n\\-i'm going full bore rogue on this - likely doing it in the next day or so - any tips? \n\n\\-any other ideas for things to make with the wood? im not really into the country aesthetics..... looking to design a super young/modern home. \n\n\\-maybe sell the wood if that doesn't work out? \n\n\\-spam me with help or fry me with discouragement. im thankful either way!", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/lfpwje/alaska_milling_hardwood_floors/", "identifyer": 346686, "year": "2021"}, {"Unnamed: 0": 347774, "autor": "onlydarkmatters", "date": 1613619313000, "content": "Trying to come up with a safe way to anchor an anemometer (wind speed and direction tool) atop a post on the roof. /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/lmcpss/trying_to_come_up_with_a_safe_way_to_anchor_an/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "trying to -----> come !!!  -----> up !!!  -----> with !!!  a safe way to anchor an anemometer (wind speed and direction tool) atop a post on the roof. /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/lmcpss/trying_to_come_up_with_a_safe_way_to_anchor_an/", "identifyer": 347774, "year": "2021"}, {"Unnamed: 0": 354391, "autor": "Normal_Bed4498", "date": 1620280682000, "content": "Tool Shed Insulation Advice /!/ I am looking at purchasing a tool shed that I would like to insulate. The inside of the shed will be climate controlled and dehumidified. The styling of the shed is a Dutch Barn and the dimensions will be 12'x16 with 6' walls. The roof has no venting i.e. is what I'm guessing would be called an unvented cathedral style ceiling. The manufacturer has stated that the trusses are 2x4 at the base and 2x6 at the peak.  The roofing material will be metal to match our house and garage. The walls will be 2x6 construction with plywood sheathing, house wrap and vinyl siding. I plan to have the shed placed on a monolithic 6 inch slab which will have a vapor barrier under it and an MVR applied to the surface after 28 days of curing. I reside in Delaware and depending on which chart I look at we are zone 4 or 5. Also since we are close to the ocean the summers are pretty much 100 % RH every day and the winters can get quite cold.\n\n&amp;#x200B;\n\nFrom my research most places recommend closed cell insulation but the cost is too high to fit my current budget. I'm trying to come up with the safest plan of attack for the best R value rating in the ceiling. So far the best that I can come up with is to adhere rigid foam insulation to the roof sheathing with a 1/3\" gap to the trusses which I would then fill with expanding foam insulation from a can. \n\nI would also know if it would be advisable to seal the ends of the 4x4 pressure treated foundation beam skid. Any advice would be greatly appreciated as I tend to overthink/overengineer most projects. \n\n&amp;#x200B;\n\nI have included a link to the shed here.\n\n&amp;#x200B;\n\n[https://www.lcsheds.com/custom-built-sheds/](https://www.lcsheds.com/custom-built-sheds/)", "link": "https://www.reddit.com/r/DIY/comments/n60glm/tool_shed_insulation_advice/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "tool shed insulation advice /!/ i am looking at purchasing a tool shed that i would like to insulate. the inside of the shed will be climate controlled and dehumidified. the styling of the shed is a dutch barn and the dimensions will be 12'x16 with 6' walls. the roof has no venting i.e. is what i'm guessing would be called an unvented cathedral style ceiling. the manufacturer has stated that the trusses are 2x4 at the base and 2x6 at the peak.  the roofing material will be metal to match our house and garage. the walls will be 2x6 construction with plywood sheathing, house wrap and vinyl siding. i plan to have the shed placed on a monolithic 6 inch slab which will have a vapor barrier under it and an mvr applied to the surface after 28 days of curing. i reside in delaware and depending on which chart i look at we are zone 4 or 5. also since we are close to the ocean the summers are pretty much 100 % rh every day and the winters can get quite cold.\n\n&amp;#x200b;\n\nfrom my research most places recommend closed cell insulation but the cost is too high to fit my current budget. i'm trying to -----> come !!!  -----> up !!!  -----> with !!!  the safest plan of attack for the best r value rating in the ceiling. so far the best that i can come up with is to adhere rigid foam insulation to the roof sheathing with a 1/3\" gap to the trusses which i would then fill with expanding foam insulation from a can. \n\ni would also know if it would be advisable to seal the ends of the 4x4 pressure treated foundation beam skid. any advice would be greatly appreciated as i tend to overthink/overengineer most projects. \n\n&amp;#x200b;\n\ni have included a link to the shed here.\n\n&amp;#x200b;\n\n[https://www.lcsheds.com/custom-built-sheds/](https://www.lcsheds.com/custom-built-sheds/)", "sortedWord": "None", "removed": null, "score": 1, "comments": 13, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/n60glm/tool_shed_insulation_advice/", "identifyer": 354391, "year": "2021"}], "name": "withDIY2021"}