{"interestingcomments": [{"Unnamed: 0": 272683, "autor": "solliptical", "date": 1594160500000, "content": "Solutions to plywood bending, looking for input /!/ I asked for advice about last week about calculating sag of plywood and got a lot of really good responses. Thanks to everyone who commented with helpful suggestions. Really liked the triscut idea (from u/gsutke476) but am trying to shoot for something with less build work as I have to replicate this many times. Took the ideas here and worked with a friend to come up with to potential options... and would really like yall's wise feedback.\n\n-------------------------------------------------------------------------------------\nORIGINAL POST\n\n([How to calculate bend strength of plywood (20in x 36in x 3/4in)](https://www.reddit.com/r/DIY/comments/hjpcj3/how_to_calculate_bend_strength_of_plywood_20in_x/)):\n\nWorking on a project that requires a 20in x 36in x 3/4in board to span a 34in gap and support the weight of a normal adult male standing on it (assuming 300lbs for a margin). I have been trying to find a way to calculate what material I would need (plywood, MDF, whatever). See image for a very crude illustration.\n\nImage: [https://i.imgur.com/efjvJ8C.jpg](https://i.imgur.com/efjvJ8C.jpg)\n\n Any advice on the type of material this would require would be appreciated... and sorry to come to you DIY folk with my noobish question.\n\nNote: I have tried researching online with the Sagulator (https://www.woodbin.com/calcs/sagulator/) being the best tool I have found, although I am not sure if I am using it correctly.\n\n-------------------------------------------------------------------------------------\nUPDATE AND QUESTIONS:\n\nSome extra context info. The side pieces this board will sit on are steel side rails for an warehouse shelving unit. Check out this illustration of the rails and their cross section. \n\nImage: [https://i.imgur.com/nxWCVLF.jpg](https://i.imgur.com/nxWCVLF.jpg)\n\n.\n\nSo with that extra detail, here are the two options we came up with:\n\nOption 1 (simple, but increases the total height of each board more than wanted): 3/4in steel square tube struts\n\n- three 3/4in steel square tube sections attached to the underside of the plywood, running longways on the board, one on each side and one in the middle\n\n- each tube secured to the plywood with a bolt at each\n\n- overall piece would actually rest on the steel square tubes rather than the plywood\n\nImage: [https://i.imgur.com/xv4IBWB.jpg](https://i.imgur.com/xv4IBWB.jpg)\n\n.\n\nOption 2 (complicated but I think thorough): 3/4in steel L-channel and 3/4in steel flat bar + restraint pegs(?)\n\n- steel L-channel down the long sides of each board (3/4in legs, 1/8in thick steel), secured with screws upward into the plywood at four spots\n\n- steel flat bar along the short sides (3/4in wide, 1/8in thick steel), also secured with screws upward into the plywood at four spots\n\n- four steel pegs, one at each corner, going down through the plywood and L-channel and slotting into holes drilled in the rails. Basically, a bolt going downwards through with the threading removed after it emerges from the bottom... point being to shift the downward sag force to inward pulling force on the stronger rails. Threading on the bottom is removed so the boards can just be lifted up and moved when needed.\n\nImage: [https://i.imgur.com/HLVC5SC.jpg](https://i.imgur.com/HLVC5SC.jpg)\n\nHope I am not overstaying my welcome by adding to the original question. Tried to show my appreciation by putting in the time to decently illustrate. Either way, I really appreciate the help.", "link": "https://www.reddit.com/r/DIY/comments/hn4ifa/solutions_to_plywood_bending_looking_for_input/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "solutions to plywood bending, looking for input /!/ i asked for advice about last week about calculating sag of plywood and got a lot of really good responses. thanks to everyone who commented with helpful suggestions. really liked the triscut idea (from u/gsutke476) but am trying to shoot for something with less build work as i have to replicate this many times. took the ideas here and worked -----> with !!!  a friend to -----> come !!!  -----> up !!!  -----> with !!!  to potential options... and would really like yall's wise feedback.\n\n-------------------------------------------------------------------------------------\noriginal post\n\n([how to calculate bend strength of plywood (20in x 36in x 3/4in)](https://www.reddit.com/r/diy/comments/hjpcj3/how_to_calculate_bend_strength_of_plywood_20in_x/)):\n\nworking on a project that requires a 20in x 36in x 3/4in board to span a 34in gap and support the weight of a normal adult male standing on it (assuming 300lbs for a margin). i have been trying to find a way to calculate what material i would need (plywood, mdf, whatever). see image for a very crude illustration.\n\nimage: [https://i.imgur.com/efjvj8c.jpg](https://i.imgur.com/efjvj8c.jpg)\n\n any advice on the type of material this would require would be appreciated... and sorry to come to you diy folk with my noobish question.\n\nnote: i have tried researching online with the sagulator (https://www.woodbin.com/calcs/sagulator/) being the best tool i have found, although i am not sure if i am using it correctly.\n\n-------------------------------------------------------------------------------------\nupdate and questions:\n\nsome extra context info. the side pieces this board will sit on are steel side rails for an warehouse shelving unit. check out this illustration of the rails and their cross section. \n\nimage: [https://i.imgur.com/nxwcvlf.jpg](https://i.imgur.com/nxwcvlf.jpg)\n\n.\n\nso with that extra detail, here are the two options we came up with:\n\noption 1 (simple, but increases the total height of each board more than wanted): 3/4in steel square tube struts\n\n- three 3/4in steel square tube sections attached to the underside of the plywood, running longways on the board, one on each side and one in the middle\n\n- each tube secured to the plywood with a bolt at each\n\n- overall piece would actually rest on the steel square tubes rather than the plywood\n\nimage: [https://i.imgur.com/xv4ibwb.jpg](https://i.imgur.com/xv4ibwb.jpg)\n\n.\n\noption 2 (complicated but i think thorough): 3/4in steel l-channel and 3/4in steel flat bar + restraint pegs(?)\n\n- steel l-channel down the long sides of each board (3/4in legs, 1/8in thick steel), secured with screws upward into the plywood at four spots\n\n- steel flat bar along the short sides (3/4in wide, 1/8in thick steel), also secured with screws upward into the plywood at four spots\n\n- four steel pegs, one at each corner, going down through the plywood and l-channel and slotting into holes drilled in the rails. basically, a bolt going downwards through with the threading removed after it emerges from the bottom... point being to shift the downward sag force to inward pulling force on the stronger rails. threading on the bottom is removed so the boards can just be lifted up and moved when needed.\n\nimage: [https://i.imgur.com/hlvc5sc.jpg](https://i.imgur.com/hlvc5sc.jpg)\n\nhope i am not overstaying my welcome by adding to the original question. tried to show my appreciation by putting in the time to decently illustrate. either way, i really appreciate the help.", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/hn4ifa/solutions_to_plywood_bending_looking_for_input/", "identifyer": 272683, "year": "2020"}, {"Unnamed: 0": 275520, "autor": "RoofPlayz", "date": 1599278998000, "content": "I've finally come up with a way to deter foxes and cats from my garden without using a connected garden hose. /!/ So all the solutions on the internet seem to be pir sensor sprayers permanently connected to a garden hose. In my experience these have always started leaking and never been reliable. Ive come up with a way to make it self contained to control the amount of water used and make it just strong enough to startle the fox.", "link": "https://www.reddit.com/r/DIY/comments/imupvq/ive_finally_come_up_with_a_way_to_deter_foxes_and/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've finally -----> come !!!  -----> up !!!  -----> with !!!  a way to deter foxes and cats from my garden without using a connected garden hose. /!/ so all the solutions on the internet seem to be pir sensor sprayers permanently connected to a garden hose. in my experience these have always started leaking and never been reliable. ive come up with a way to make it self contained to control the amount of water used and make it just strong enough to startle the fox.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/imupvq/ive_finally_come_up_with_a_way_to_deter_foxes_and/", "identifyer": 275520, "year": "2020"}, {"Unnamed: 0": 275750, "autor": "Azure_Torke", "date": 1578609464000, "content": "Help trying to figure out how to remove Refrigerator panels to put them on a different Fridge /!/ Okay, so I am trying to remove the side panels from this refrigerator, its from Big Chill. I want to remove them without damaging them in order to put them onto a totally different fridge, same dimensions of course. So this sounds simple and would be really, if it weren't for one thing.... the side panels are glued onto the refrigerator with rubber adhesive, I'm guessing possibly to prevent projects like this, but... still want to try.\n\nSo the adhesive runs down the entire front part of the refrigerator where there is also the panel's lip that wraps around slightly to the front, where you would screw and unscrew it. This lip is preventing me from being able to use any tool that would otherwise be perfect for this as they all risk bending the panel's lip to much, rendering the panels useless. I have tried using dental floss, string, and even metal wiring, but the later was ripping the paint off, I could always repaint, but it also was surprisingly less effective than the string and with far more effort than you would think needed.\n\nI'm just wondering if there is anything I could use to separate the panel from the fridge safely and intact. I do not care about the refrigerator itself, it can be damaged and such as it is no longer running. I have tried to look for solutions on Google and other search engines but only came up with removing the doors, top paneling, rear, nothing about side panels like this that are attached to an already existing refrigerator. \n\nHere is the refrigerator in question:\n\n&amp;#x200B;\n\n[Front view here and side view there](https://preview.redd.it/8f64ik26yt941.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=8e04a16165085d3094b28036b0ed8fd974df52ec)\n\n&amp;#x200B;\n\n[Sorry for the images being sideways](https://preview.redd.it/m02qo94ayt941.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=efe55d534533712ce6f76707a4f0af257d77ed31)\n\nAny help would be much appreciated and if I can get these panels removed and remain usable, I will gladly share images of the final product when I apply them and fix them up onto a different refrigerator.", "link": "https://www.reddit.com/r/DIY/comments/emhb3h/help_trying_to_figure_out_how_to_remove/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "help trying to figure out how to remove refrigerator panels to put them on a different fridge /!/ okay, so i am trying to remove the side panels from this refrigerator, its from big chill. i want to remove them without damaging them in order to put them onto a totally different fridge, same dimensions of course. so this sounds simple and would be really, if it weren't for one thing.... the side panels are glued onto the refrigerator with rubber adhesive, i'm guessing possibly to prevent projects like this, but... still want to try.\n\nso the adhesive runs down the entire front part of the refrigerator where there is also the panel's lip that wraps around slightly to the front, where you would screw and unscrew it. this lip is preventing me from being able to use any tool that would otherwise be perfect for this as they all risk bending the panel's lip to much, rendering the panels useless. i have tried using dental floss, string, and even metal wiring, but the later was ripping the paint off, i could always repaint, but it also was surprisingly less effective than the string and with far more effort than you would think needed.\n\ni'm just wondering if there is anything i could use to separate the panel from the fridge safely and intact. i do not care about the refrigerator itself, it can be damaged and such as it is no longer running. i have tried to look for solutions on google and other search engines but only -----> came !!!  -----> up !!!  -----> with !!!  removing the doors, top paneling, rear, nothing about side panels like this that are attached to an already existing refrigerator. \n\nhere is the refrigerator in question:\n\n&amp;#x200b;\n\n[front view here and side view there](https://preview.redd.it/8f64ik26yt941.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=8e04a16165085d3094b28036b0ed8fd974df52ec)\n\n&amp;#x200b;\n\n[sorry for the images being sideways](https://preview.redd.it/m02qo94ayt941.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=efe55d534533712ce6f76707a4f0af257d77ed31)\n\nany help would be much appreciated and if i can get these panels removed and remain usable, i will gladly share images of the final product when i apply them and fix them up onto a different refrigerator.", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/emhb3h/help_trying_to_figure_out_how_to_remove/", "identifyer": 275750, "year": "2020"}, {"Unnamed: 0": 279150, "autor": "Samrees9", "date": 1583579551000, "content": "Outdoor wooden flower bed- What woods best and a few other Q’s /!/ Hi so I have a concrete wall out the front of my house. I have pondered with the idea of creating a wooden structure to either hold a flower bed or plant pots. \n\nI’m no carpenter but I’m ok with tools. \n\nWhat wood would be best for the outside conditions? And would I need to treat it?\n\nAlso if anyone has any images for inspiration that would be great! As I can’t seem to find any on google. It just comes up with a wall with the soil incorporated in the wall if you get me. \n\nThanks in advance", "link": "https://www.reddit.com/r/DIY/comments/fettd1/outdoor_wooden_flower_bed_what_woods_best_and_a/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "outdoor wooden flower bed- what woods best and a few other q’s /!/ hi so i have a concrete wall out the front of my house. i have pondered with the idea of creating a wooden structure to either hold a flower bed or plant pots. \n\ni’m no carpenter but i’m ok with tools. \n\nwhat wood would be best for the outside conditions? and would i need to treat it?\n\nalso if anyone has any images for inspiration that would be great! as i can’t seem to find any on google. it just -----> comes !!!  -----> up !!!  -----> with !!!  a wall -----> with !!!  the soil incorporated in the wall if you get me. \n\nthanks in advance", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/fettd1/outdoor_wooden_flower_bed_what_woods_best_and_a/", "identifyer": 279150, "year": "2020"}, {"Unnamed: 0": 281656, "autor": "Unessential", "date": 1601758640000, "content": "Can't get stripped screw out! Help! /!/ I've spent the past few days trying to get a stripped bolt out of an electronics case.  It's a m4x12mm bolt, which likely got stripped last time I was working on it and was hand tightening.   \n\n\nI spent days googling methods, I've tried using rubber bands, \"hammering\" it in, using pliers / wrench to turn it out (it's a button head but doesn't come up enough at all to get a grip with anything)  superglue (did not bond two metal pieces together -- the screw and driver-- even after a long time Although it bonded to my skin instantly. ), forcing a larger Allen wrench in.   \n\n\nI did not want to resort to using this because it looked destructive, non-reversible, and I would be worse off if it didn't work.  but I bit the bullet because I thought I had no other choice, and it was recommended everywhere and supposedly easy:\n\n[https://www.amazon.ca/gp/product/B081RDQZL2/ref=ppx\\_yo\\_dt\\_b\\_asin\\_title\\_o01\\_s00?ie=UTF8&amp;psc=1](https://www.amazon.ca/gp/product/B081RDQZL2/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&amp;psc=1)  \n\n\nYoutube videos looked simple enough, I order it, It came... and... it didn't bite.  Now Like i was a fraid of it's stripped way beyond anything that looks repairable. Since the method requires literally drilling out the driver hole.  \n\n\nOnly afterward I googled this [https://sts-slash-tectorius.square.site/product/bit-biter-/5?cs=true](https://sts-slash-tectorius.square.site/product/bit-biter-/5?cs=true) I don't know if it will work, and they don't even ship to Canada! googling \"bit biter\" doesn't come up with that product anywhere else.", "link": "https://www.reddit.com/r/DIY/comments/j4mmev/cant_get_stripped_screw_out_help/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "can't get stripped screw out! help! /!/ i've spent the past few days trying to get a stripped bolt out of an electronics case.  it's a m4x12mm bolt, which likely got stripped last time i was working on it and was hand tightening.   \n\n\ni spent days googling methods, i've tried using rubber bands, \"hammering\" it in, using pliers / wrench to turn it out (it's a button head but doesn't come up enough at all to get a grip with anything)  superglue (did not bond two metal pieces together -- the screw and driver-- even after a long time although it bonded to my skin instantly. ), forcing a larger allen wrench in.   \n\n\ni did not want to resort to using this because it looked destructive, non-reversible, and i would be worse off if it didn't work.  but i bit the bullet because i thought i had no other choice, and it was recommended everywhere and supposedly easy:\n\n[https://www.amazon.ca/gp/product/b081rdqzl2/ref=ppx\\_yo\\_dt\\_b\\_asin\\_title\\_o01\\_s00?ie=utf8&amp;psc=1](https://www.amazon.ca/gp/product/b081rdqzl2/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=utf8&amp;psc=1)  \n\n\nyoutube videos looked simple enough, i order it, it came... and... it didn't bite.  now like i was a fraid of it's stripped way beyond anything that looks repairable. since the method requires literally drilling out the driver hole.  \n\n\nonly afterward i googled this [https://sts-slash-tectorius.square.site/product/bit-biter-/5?cs=true](https://sts-slash-tectorius.square.site/product/bit-biter-/5?cs=true) i don't know if it will work, and they don't even ship to canada! googling \"bit biter\" doesn't -----> come !!!  -----> up !!!  -----> with !!!  that product anywhere else.", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/j4mmev/cant_get_stripped_screw_out_help/", "identifyer": 281656, "year": "2020"}, {"Unnamed: 0": 303805, "autor": "eoncire", "date": 1598619721000, "content": "I renovated my kitchen myself, here's how I did it.... /!/ Over a course of basically 4 weeks last year I completely gutted and renovated my kitchen (and main level flooring / trim), and took a lot of progress pictures to share.  Here they are!\n\nhttps://imgur.com/a/YaTgzrB\n\nI had a pretty tight timeline from the start and wanted to get this project completed as quickly as possible so I didn't have to live without a working kitchen with two kids and a wife for too long.  It worked out well in the end.  It was tiring, but I hopefully saved myself a bunch of money by doing it myself.  Between working 55+ hours M-F every week, then taking on a couple of the items that I really had to concrete plan in place for I was in a little over my head at times, but got it done.\n\nFirst weekend (Nov 1st) was all about demo.  We already ordered the cabinets and had a delivery date (Nov 7th).  We also already had a date scheduled to measure for counter-tops which if we ended up need to push back would add several weeks to our timeline, and add several weeks of living without a kitchen.  Everything was right on schedule and I was going to keep it that way.\n\nDemo went smooth, the first weekend I ripped out all of the cabinets, old appliances, and the tile flooring.  The cabinet removal process was pretty straight-forward, I got my trusty 3lb sledge hammer, wonderbar (https://imgur.com/a/dzy4TK7), and went to town on the cabinets.  They came apart easily.  I had rented a dumpster (52' roll off) which was right outside the main doorway in the kitchen so that was a breeze hauling stuff out.  I wasn't worried about saving anything so it made the demo a piece of cake.  The fake brick for the most part came off the wall only using my wonderbar (https://imgur.com/a/dzy4TK7) and a 3lb sledge hammer to knock them off the wall, occasionally removing some drywall with it.  I realized pretty early in removing the fake brick that the drywall would have to come out as well, the bricks were adhered pretty well to the drywall board and trying to take them off without damaging the underlying drywall just wasn't going to happen.  I bit the bullet and decided to cut out a 24\" wide section (https://i.imgur.com/QpEV6mn.png).  This was just wider that the area that would be exposed after the new cabinets were in.  This is also exactly half a sheet of drywall in width which was nice.  That meant i didn't have to worry about finishing the drywall seams perfectly where the new butted up to the old, just had to be smooth enough so the cabinets would sit flush against the wall.  Removing the tile as shown here by my helpers (https://i.imgur.com/T8UWsyz.png) was pretty easy as well, just a hammer and the wonderbar.  The tile came up with the cement board underneath in fairly large sections if you went slow making cleanup much easier.  There were several screws left in the floor that the cement board pulled through.  I removed those with my impact driver and a #2 phillips bit.  To finish the weekend I hung the drywall (https://i.imgur.com/VmXXCtF.png) using a utility knife to cut it, straight edge to make straight score lines, and a tape measure.  Again, I wasn't too worried about a perfect drywall finish as there would be a tile backsplash.  Only around the window frame would I need to have it look nice.\n\nDuring the next week I finished the drywall and took delivery of the cabinets.  Finishing drywall is an art form.  I followed advice from The Vancouver Carpenter on YouTube and watched all of his drywall videos to further hone my mudding / sanding skill-set.  Since i was in a rush do finish the drywall, and heeding advice from The Vancouver Carpenter, my initial mud job of filling in the big cracks and base coat i used 20 minute \"hot mud\" which i mixed myself in a bucket with a mixer attachment for my drill.  20 minute is not a joke, after about 15 minutes the mud turns a corner and starts to set.  Its wicked fast, but won't shrink, which is great for filling larger voids at the expense of not sanding as nice as finish / general purpose mud.  Sunday night I put the base coat of 20 minute hot mud.  It's always better to lay multiple thinner than needed coats as opposed to one giant glob of a coat then be stuck sanding more than you need.  That night I also installed the couple pieces of corner bead around the window.  I used paper faced corner bead which was great (https://imgur.com/a/dULBhOT).  I mixed the 20 minute mud wetter than normal to really saturate the paper which is a necessity when using paper.  The paper must be wet!  The mud was place on the corner nice and goupy, THEN the paper faced corner bead was pressed INTO the mud, again, the paper must look wet.  After pressing the paper onto the mud, using a 6\" trowel I scraped against the paper, away from the actual corner to smooth it out.  This is how it looked after that point (https://imgur.com/a/LMcciW6).  Rinse and repeat for the two remaining corner beads. The following evening after work I did a quick sand and used some general purpose mud to start the finish coat(s) (https://imgur.com/a/GnXqTw3).  Sand the following day, one more light finish coat, then finish sand the following day. \n\nThe weekend brought a day of hanging cabinets, and another day of leveling base cabinets, as well as some plumbing for the new sink and pot filler.  To hang the wall cabinets i started in the corner against a wall, the right side of this pic (https://i.imgur.com/pBfqLS7.png).  That way there is a wall to push up against on the right.  I chose to just put a level inside the cabinet to make sure it's level, then another small level on the face / side to check.  This is where i had a buddy help, and extra set of hands was needed.  I used GRK #8 2 1/2\" cabinet screws.  I measured where the studs were at on the wall by locating the nails in the drywall, measured the distance from the wall, then measured the cabinets and make my mark inside.  4 screws in each cabinet did the trick.  This took most of the morning to hang the 6 wall cabinets.  The base cabinets were a one man job, again starting with the corner cabinet I put my 4' level across it on a diagonal.  Using basic wood shims I tapped them into the bottom of the cabinet between them and the plywood subfloor until level all around.  Rinse and repeat for the rest.  Before the sink cabinet was set I had to figure out the plumbing.  The current setup had the copper pipe for the sink coming through the subfloor right in the middle of the cabinet which basically made under sink storage useless.  There is about 3\" of space under the cabinets between the bottom of the cabinet and the subfloor.  I used a copper pipe cutter (https://imgur.com/a/vLUlv68) to stub it off just above the subfloor.  I borrowed a PEX crimp tool from a friend (https://imgur.com/a/Cf5A6Jb), PEX is super easy, beats the heck out of sweating copper in tight places.  It's like plumbing legos really.  I used PEX fittings (a LOT of 90s) and had to sweat one copper to PEX fitting on the stub that comes out of the floor.  The stub makes a 90 degree turn back towards the wall then a 90 turn up to come through the cabinet (https://i.imgur.com/arMxg3k.png).  From there the normal under sink shut off valves (PEX) and more 90s.  The PEX cuts easily, slide the crimp ring on (copper) and used the tool to crimp it.  There is a gauge that comes with the tool to make sure the crimper is set up properly, a loose crimp will leak and a crimp too tight could damage the fitting / PEX causing a leak.  I checked each crimp with the go / no-go gauge to ensure it was correct.\n\nDuring the next week it was getting everything set up for counter measuring.  Installing the new sink (cutting into a brand new sink cabinet), double checking measurements for appliances and whatnot, and building the island.  The sink cabinet I purchased had to be cut to fit the farmhouse sink.  The sink rests on the front face of the cabinet.  To make the cutout i measured the side of the front and marked the cabinet.  The sink is an undermount so the top lip of the sink had to sit flush with the top plane of the cabinet.  I measured where it needed to be cut and clamped a straight edge to the sink for a guide when cutting with my jigsaw (https://i.imgur.com/hhq0jMh.png). For side support I cut a couple pieces of 2x4 down to 18\" long and screwed them into the side of the cabinet so the sink had support on the sides, sorry, didn't get any pictures of that process.   \n\nThe following weekend was flooring, a lot of flooring.  I didn't get many pics of installing the floor, but it was just click lock vinyl flooring.  It installs pretty easily once you get going.  The first couple of rows need to be square to the room and shims are used when starting against the first wall to ensure so.  I used my 10\" chop saw to cut the boards to length as needed, I'm not writing a how-to for flooring, there's enough of those on the internet.\n\nThe following week was lighting, appliances installed, odds and ends worked on (pot filler).  I replaced the overhead lighting with some sputnik looking brass colored fixtures.  This was a basic light fixture swap, screw driver, voltage tester, etc.  I used the PEX tools a little more to run the line to the pot filler behind the cabinets and tie that in.  Sunday I built the back side of the island, countertops were scheduled to be installed the following day.  I used a 3x3 post for the legs, and a piece of cabinet filler as the apron (https://i.imgur.com/TF6BvOa.png).  I used some left over cabinet screws to affix the apron to the legs.  I had to build up the two wall cabinets that i used for the island so that they had a toe-kick like the rest of the base cabinets.  To do so i built a simple box frame using 2x4 lumber bought a stick of 1x4 that I cut two pieces off and screwed that to the 2x4 box so that the thickness of the overall base was the same height as the toe kick trim (https://i.imgur.com/UMY84aD.png).  The island was ready for countertop measuring.\n\nNext week right on schedule the counters were installed Monday afternoon.  I didn't do this myself, the guys had 3 large pieces for the whole kitchen.  They just set them down to make sure the fit was good, then put a bead of adhesive on top of the cabinets and pressed them down.  They ran a bead of caulk along the spots that butted up to a wall or cabinet.  I spent my nights that week hooking up the sink, new disposal, dishwasher, basically bringing the kitchen back to working order, in 4 weeks time.  The sink hookup was pretty straight forward.  The faucet slid through the hole in the quartz and a large nut was spun on the base to tighten it, the hot / cold water was just a single compression fitting that was threaded on.  Same for the dishwasher with the addition of connecting the electrical in accordance with the manufacturer specs.  The new disposal was hung according to the manufacturer directions and hooked up to the existing drain pipe per the manufacturer directions.  I finally had a functioning sink / dishwasher!  The range is gas, the old one was gas, so that was just connecting the gas fittings using some green pipe dope on the threads.\n\nAfter that I took it easy and just worked on the weekends really, the rush was over and i could take my time.  Installed a new entry door one weekend, the pot filler another, under cabinet lighting, re-wired a couple dimmer switches, finished the trim work another weekend, trimmed out the island, had my buddy do the tile backsplash.  The trim work took time, finish carpentry is easy to mess up, and if you do it's super noticeable.  I used my miter saw, borrowed a finish nailer from a friend, and lots of beer and frustration.  The trim was purchased with the cabinets so it matched perfect, and was expensive...  I installed quarter round wherever the cabinets met the floor, and scribe trim wherever there was a seam to cover in the cabinet trim.  This is a before where scribe trim would go (https://imgur.com/a/WdGOxDs).  To trim the island I used some of the left-over sheet of cabinet trim, cut it down on my table saw to \"clad\" the legs, then a piece of scribe to hide the exposed edges (https://imgur.com/a/Sfrjod6).\n\nFor the under-cabinet LED lighting I used a very DIY solution.  I am big into home automation and the magic of the ESP8266 / ESP32 development boards.  I came up with a solution for a PWM MOSFET based 12v LED dimmer controller that's wifi enabled and syncs to my HomeAssistant server which controls all of the smart stuff in my home.  For that I made a completely separate write up which is available here https://github.com/eoncire/cabinet_lights.  The other dimmer lights in my kitchen are Acenx brand from Amazon.  If anything \"smart\" you find on Amazon or Ebay says controllable via Wifi and GoogleAssistant / Amazon Echo then chances are it runs on an ESP8266 under the hood, and can be flashed with custom firmware, most of the time without needing to open it up and solder anything.  This completely removes the cloud function and will work 100% locally on your home network without the need for internet.  That's a whole other topic for another day, but if you google TuyaConvert you can peek over the edge of the rabbit hole and check it out.\n\nIt was an overall fun project, but if I could do it again I probably would have taken some time off from work instead of cramming a full kitchen renovation into nights and weekends on top of 55+ hours a week at work.\n\nLet me know if you have any questions!  Thanks for watching!", "link": "https://www.reddit.com/r/DIY/comments/ii6ly9/i_renovated_my_kitchen_myself_heres_how_i_did_it/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i renovated my kitchen myself, here's how i did it.... /!/ over a course of basically 4 weeks last year i completely gutted and renovated my kitchen (and main level flooring / trim), and took a lot of progress pictures to share.  here they are!\n\nhttps://imgur.com/a/yatgzrb\n\ni had a pretty tight timeline from the start and wanted to get this project completed as quickly as possible so i didn't have to live without a working kitchen with two kids and a wife for too long.  it worked out well in the end.  it was tiring, but i hopefully saved myself a bunch of money by doing it myself.  between working 55+ hours m-f every week, then taking on a couple of the items that i really had to concrete plan in place for i was in a little over my head at times, but got it done.\n\nfirst weekend (nov 1st) was all about demo.  we already ordered the cabinets and had a delivery date (nov 7th).  we also already had a date scheduled to measure for counter-tops which if we ended up need to push back would add several weeks to our timeline, and add several weeks of living without a kitchen.  everything was right on schedule and i was going to keep it that way.\n\ndemo went smooth, the first weekend i ripped out all of the cabinets, old appliances, and the tile flooring.  the cabinet removal process was pretty straight-forward, i got my trusty 3lb sledge hammer, wonderbar (https://imgur.com/a/dzy4tk7), and went to town on the cabinets.  they came apart easily.  i had rented a dumpster (52' roll off) which was right outside the main doorway in the kitchen so that was a breeze hauling stuff out.  i wasn't worried about saving anything so it made the demo a piece of cake.  the fake brick for the most part came off the wall only using my wonderbar (https://imgur.com/a/dzy4tk7) and a 3lb sledge hammer to knock them off the wall, occasionally removing some drywall with it.  i realized pretty early in removing the fake brick that the drywall would have to come out as well, the bricks were adhered pretty well to the drywall board and trying to take them off without damaging the underlying drywall just wasn't going to happen.  i bit the bullet and decided to cut out a 24\" wide section (https://i.imgur.com/qpev6mn.png).  this was just wider that the area that would be exposed after the new cabinets were in.  this is also exactly half a sheet of drywall in width which was nice.  that meant i didn't have to worry about finishing the drywall seams perfectly where the new butted up to the old, just had to be smooth enough so the cabinets would sit flush against the wall.  removing the tile as shown here by my helpers (https://i.imgur.com/t8uwsyz.png) was pretty easy as well, just a hammer and the wonderbar.  the tile -----> came !!!  -----> up !!!  -----> with !!!  the cement board underneath in fairly large sections if you went slow making cleanup much easier.  there were several screws left in the floor that the cement board pulled through.  i removed those with my impact driver and a #2 phillips bit.  to finish the weekend i hung the drywall (https://i.imgur.com/vmxxctf.png) using a utility knife to cut it, straight edge to make straight score lines, and a tape measure.  again, i wasn't too worried about a perfect drywall finish as there would be a tile backsplash.  only around the window frame would i need to have it look nice.\n\nduring the next week i finished the drywall and took delivery of the cabinets.  finishing drywall is an art form.  i followed advice from the vancouver carpenter on youtube and watched all of his drywall videos to further hone my mudding / sanding skill-set.  since i was in a rush do finish the drywall, and heeding advice from the vancouver carpenter, my initial mud job of filling in the big cracks and base coat i used 20 minute \"hot mud\" which i mixed myself in a bucket with a mixer attachment for my drill.  20 minute is not a joke, after about 15 minutes the mud turns a corner and starts to set.  its wicked fast, but won't shrink, which is great for filling larger voids at the expense of not sanding as nice as finish / general purpose mud.  sunday night i put the base coat of 20 minute hot mud.  it's always better to lay multiple thinner than needed coats as opposed to one giant glob of a coat then be stuck sanding more than you need.  that night i also installed the couple pieces of corner bead around the window.  i used paper faced corner bead which was great (https://imgur.com/a/dulbhot).  i mixed the 20 minute mud wetter than normal to really saturate the paper which is a necessity when using paper.  the paper must be wet!  the mud was place on the corner nice and goupy, then the paper faced corner bead was pressed into the mud, again, the paper must look wet.  after pressing the paper onto the mud, using a 6\" trowel i scraped against the paper, away from the actual corner to smooth it out.  this is how it looked after that point (https://imgur.com/a/lmcciw6).  rinse and repeat for the two remaining corner beads. the following evening after work i did a quick sand and used some general purpose mud to start the finish coat(s) (https://imgur.com/a/gnxqtw3).  sand the following day, one more light finish coat, then finish sand the following day. \n\nthe weekend brought a day of hanging cabinets, and another day of leveling base cabinets, as well as some plumbing for the new sink and pot filler.  to hang the wall cabinets i started in the corner against a wall, the right side of this pic (https://i.imgur.com/pbfqls7.png).  that way there is a wall to push up against on the right.  i chose to just put a level inside the cabinet to make sure it's level, then another small level on the face / side to check.  this is where i had a buddy help, and extra set of hands was needed.  i used grk #8 2 1/2\" cabinet screws.  i measured where the studs were at on the wall by locating the nails in the drywall, measured the distance from the wall, then measured the cabinets and make my mark inside.  4 screws in each cabinet did the trick.  this took most of the morning to hang the 6 wall cabinets.  the base cabinets were a one man job, again starting with the corner cabinet i put my 4' level across it on a diagonal.  using basic wood shims i tapped them into the bottom of the cabinet between them and the plywood subfloor until level all around.  rinse and repeat for the rest.  before the sink cabinet was set i had to figure out the plumbing.  the current setup had the copper pipe for the sink coming through the subfloor right in the middle of the cabinet which basically made under sink storage useless.  there is about 3\" of space under the cabinets between the bottom of the cabinet and the subfloor.  i used a copper pipe cutter (https://imgur.com/a/vlulv68) to stub it off just above the subfloor.  i borrowed a pex crimp tool from a friend (https://imgur.com/a/cf5a6jb), pex is super easy, beats the heck out of sweating copper in tight places.  it's like plumbing legos really.  i used pex fittings (a lot of 90s) and had to sweat one copper to pex fitting on the stub that comes out of the floor.  the stub makes a 90 degree turn back towards the wall then a 90 turn up to come through the cabinet (https://i.imgur.com/armxg3k.png).  from there the normal under sink shut off valves (pex) and more 90s.  the pex cuts easily, slide the crimp ring on (copper) and used the tool to crimp it.  there is a gauge that comes with the tool to make sure the crimper is set up properly, a loose crimp will leak and a crimp too tight could damage the fitting / pex causing a leak.  i checked each crimp with the go / no-go gauge to ensure it was correct.\n\nduring the next week it was getting everything set up for counter measuring.  installing the new sink (cutting into a brand new sink cabinet), double checking measurements for appliances and whatnot, and building the island.  the sink cabinet i purchased had to be cut to fit the farmhouse sink.  the sink rests on the front face of the cabinet.  to make the cutout i measured the side of the front and marked the cabinet.  the sink is an undermount so the top lip of the sink had to sit flush with the top plane of the cabinet.  i measured where it needed to be cut and clamped a straight edge to the sink for a guide when cutting with my jigsaw (https://i.imgur.com/hhq0jmh.png). for side support i cut a couple pieces of 2x4 down to 18\" long and screwed them into the side of the cabinet so the sink had support on the sides, sorry, didn't get any pictures of that process.   \n\nthe following weekend was flooring, a lot of flooring.  i didn't get many pics of installing the floor, but it was just click lock vinyl flooring.  it installs pretty easily once you get going.  the first couple of rows need to be square to the room and shims are used when starting against the first wall to ensure so.  i used my 10\" chop saw to cut the boards to length as needed, i'm not writing a how-to for flooring, there's enough of those on the internet.\n\nthe following week was lighting, appliances installed, odds and ends worked on (pot filler).  i replaced the overhead lighting with some sputnik looking brass colored fixtures.  this was a basic light fixture swap, screw driver, voltage tester, etc.  i used the pex tools a little more to run the line to the pot filler behind the cabinets and tie that in.  sunday i built the back side of the island, countertops were scheduled to be installed the following day.  i used a 3x3 post for the legs, and a piece of cabinet filler as the apron (https://i.imgur.com/tf6bvoa.png).  i used some left over cabinet screws to affix the apron to the legs.  i had to build up the two wall cabinets that i used for the island so that they had a toe-kick like the rest of the base cabinets.  to do so i built a simple box frame using 2x4 lumber bought a stick of 1x4 that i cut two pieces off and screwed that to the 2x4 box so that the thickness of the overall base was the same height as the toe kick trim (https://i.imgur.com/umy84ad.png).  the island was ready for countertop measuring.\n\nnext week right on schedule the counters were installed monday afternoon.  i didn't do this myself, the guys had 3 large pieces for the whole kitchen.  they just set them down to make sure the fit was good, then put a bead of adhesive on top of the cabinets and pressed them down.  they ran a bead of caulk along the spots that butted up to a wall or cabinet.  i spent my nights that week hooking up the sink, new disposal, dishwasher, basically bringing the kitchen back to working order, in 4 weeks time.  the sink hookup was pretty straight forward.  the faucet slid through the hole in the quartz and a large nut was spun on the base to tighten it, the hot / cold water was just a single compression fitting that was threaded on.  same for the dishwasher with the addition of connecting the electrical in accordance with the manufacturer specs.  the new disposal was hung according to the manufacturer directions and hooked up to the existing drain pipe per the manufacturer directions.  i finally had a functioning sink / dishwasher!  the range is gas, the old one was gas, so that was just connecting the gas fittings using some green pipe dope on the threads.\n\nafter that i took it easy and just worked on the weekends really, the rush was over and i could take my time.  installed a new entry door one weekend, the pot filler another, under cabinet lighting, re-wired a couple dimmer switches, finished the trim work another weekend, trimmed out the island, had my buddy do the tile backsplash.  the trim work took time, finish carpentry is easy to mess up, and if you do it's super noticeable.  i used my miter saw, borrowed a finish nailer from a friend, and lots of beer and frustration.  the trim was purchased with the cabinets so it matched perfect, and was expensive...  i installed quarter round wherever the cabinets met the floor, and scribe trim wherever there was a seam to cover in the cabinet trim.  this is a before where scribe trim would go (https://imgur.com/a/wdgoxds).  to trim the island i used some of the left-over sheet of cabinet trim, cut it down on my table saw to \"clad\" the legs, then a piece of scribe to hide the exposed edges (https://imgur.com/a/sfrjod6).\n\nfor the under-cabinet led lighting i used a very diy solution.  i am big into home automation and the magic of the esp8266 / esp32 development boards.  i came up with a solution for a pwm mosfet based 12v led dimmer controller that's wifi enabled and syncs to my homeassistant server which controls all of the smart stuff in my home.  for that i made a completely separate write up which is available here https://github.com/eoncire/cabinet_lights.  the other dimmer lights in my kitchen are acenx brand from amazon.  if anything \"smart\" you find on amazon or ebay says controllable via wifi and googleassistant / amazon echo then chances are it runs on an esp8266 under the hood, and can be flashed with custom firmware, most of the time without needing to open it up and solder anything.  this completely removes the cloud function and will work 100% locally on your home network without the need for internet.  that's a whole other topic for another day, but if you google tuyaconvert you can peek over the edge of the rabbit hole and check it out.\n\nit was an overall fun project, but if i could do it again i probably would have taken some time off from work instead of cramming a full kitchen renovation into nights and weekends on top of 55+ hours a week at work.\n\nlet me know if you have any questions!  thanks for watching!", "sortedWord": "None", "removed": null, "score": 1, "comments": 128, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/ii6ly9/i_renovated_my_kitchen_myself_heres_how_i_did_it/", "identifyer": 303805, "year": "2020"}, {"Unnamed: 0": 305802, "autor": "VonKluck1914", "date": 1606177736000, "content": "No one is preserving antique coins and displaying them the way I thought appropriate. I got a precision cutting board, sheets of plastic, and did a little research, and came up with this!", "link": "https://www.reddit.com/r/DIY/comments/jzuac2/no_one_is_preserving_antique_coins_and_displaying/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "no one is preserving antique coins and displaying them the way i thought appropriate. i got a precision cutting board, sheets of plastic, and did a little research, and -----> came !!!  -----> up !!!  -----> with !!!  this!", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "image", "medialink": "https://i.redd.it/tg4ffxei13161.jpg", "identifyer": 305802, "year": "2020"}, {"Unnamed: 0": 305803, "autor": "VonKluck1914", "date": 1606177697000, "content": "No one is preserving antique coins and displaying them the way I thought appropriate. I got a precision cutting board, sheets of plastic, and did a little research, and came up with this! /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/jzu9xy/no_one_is_preserving_antique_coins_and_displaying/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "no one is preserving antique coins and displaying them the way i thought appropriate. i got a precision cutting board, sheets of plastic, and did a little research, and -----> came !!!  -----> up !!!  -----> with !!!  this! /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/jzu9xy/no_one_is_preserving_antique_coins_and_displaying/", "identifyer": 305803, "year": "2020"}], "name": "withDIY2020"}