{"interestingcomments": [{"autor": "tuseroni", "date": "2019-05-26 03:32:07", "content": "-----> AI !!!  and the future of entertainment. /!/ there is a lot of fear and paranoia going around about -----> AI !!!  these days, whenever some new technique is created people immediately think of \"how can this be used to create propaganda and fake news\" which is a fine discussion but it seems to be the only one anyone wants to talk about, and it's getting kinda old. i'd like to see some discussion on the positive things that can come from such techniques, the lowering of the barriers to entry for creating realistic fictional content may open up the possibilities of using it to create propaganda, but states can already afford much more expensive techniques that are better, it can open up using celebrity photos to make porn that is a relatively new thing, and it might even be used by children in school against other children in school to ruin their reputation (talking...teens mostly), but what about the positives.\n\none of the biggest advantages -----> AI !!!  bring is to reduce what would normally involve a team of dozen or more people working for large sums of money to a program working for free, now obviously this is bad for people who did those jobs in the past but pretty good for people who want to make high quality art but can't afford a team the size of game of thrones to do it. for this i will break it out into different entertainment domains and explain how -----> AI !!!  can be used to make development cheaper and more accessible to the average person. for the most part i will be referring to GANs, Generative Adversarial Networks, a kind of neural network which consists of a generator and a discriminator paired against each other, one tries to create something, the other tries to see if it's fake, training is done when the discriminator can't tell if the image is real or fake, each network reinforces the other. i also mention a conditional GAN, which is a type of GAN which takes some set of conditions in order to generate (as well as taking some random data)  \n\n##Gaming##  \n\nImagine you want to create a video game, let's say it's an open world set in a fictional city. doing it today you would need to generate a map, and you would have to think up a map, and you would probably just copy and existing map, instead you can have an -----> AI !!!  which is trained on a large number of maps of cities large and small, and you give it a condition (so this would be a conditional GAN) that it should be a large city, bordering a lake, near a mountain range. and it would generate a map, and a semantic map which will be useful for rendering. an example of something like this would be [AttnGan, images generated from a description](https://arxiv.org/pdf/1711.10485.pdf) but that is just one example of a conditional GAN. now we have a map with semantic information (roads, buildings, trees, ground, mountains, lake, etc) now, we can generate some people. the way we would usually use is to make models that can be customized by a series of parameters, generate random parameters to make random people. it's ok but it gives you a lot of very samey looking people, instead let's just generate the people using a GAN, many here are familiar with [thispersondoesnotexist](https://www.thispersondoesnotexist.com/) which can generate faces, but you can also use an -----> AI !!!  to [Generate full bodies](https://www.youtube.com/watch?v=8siezzLXbNo) and pose them. so we can generate an entire crowd without them all looking samey, each is generated with some random vector based on real people, they will not only look realistic they will be unique. \n\nok, but how do we make use of this, GANs make video and pictures, but how will we play this game? [with an -----> AI !!!  renderer of course](https://www.youtube.com/watch?v=ayPqjPekn7g) that is something created by nvidia which allows for interactive movement through an -----> AI !!!  rendered world, what you need is semantic information about the world (which we generated above) and a training set for cityscapes (though we will want to cover more than just cityscapes in our training set) the -----> AI !!!  will generate the appropriate view of the world based on the semantic information, change the information, change the view. now our game doesn't need high resolution models, doesn't need models exactly just semantic information placed in a given space within the map.\n\nso what about our other elements, like physics calculations [don't calculate, estimate](https://www.youtube.com/watch?v=iOWamCtnwTc) this gives physics effects as good as some of the best calculations in a fraction of the time, and this is nice no mater what rendering technique you are using. so now you have generated your map, you have generated your people, what about our buildings? they were generated via the map, but wouldn't it be nice if you could go in every building? in a normal game that would be prohibitively expensive, but for this it's just a matter of generating the internal layout of the building, again we feed an -----> AI !!!  layouts for various kinds of buildings, and have it generate an appropriate layout for every building in the map. now let's say i want to add something to one of these buildings, i use a conditional GAN as before i say i want a table, a fancy table, with a table cloth, cadelebras and an assortment of food. be kinda like [that holodeck scene in st:tng schisms](https://www.youtube.com/watch?v=JoMeeIpIbOs) ignore the music added by the uploader, this was the best clip i could find. this is a particularly good scene though as it shows the process of creating a simulation in the holodeck, or A process, we often see them typing into a console as well.\n\nbut this, i think, is where game development could lead, in the near future, instead of creating the model by hand you ask the computer for a model, and you refine it as you go, the -----> AI !!!  creates what it imagines given what you have asked of it, you say \"i want a table\" it creates what it imagines a table (just as if i asked you to imagine a table, an image would come to your mind, it might be wood with 4 legs, or it might be metal and folding, it might be ornate or plain, it depends on your particular idea of what a table is. but if i say a long table, you will imagine something for a feast probably made of wood, if i say it is ornate you might imagine it with carvings and bits of precious metals, but all i need to do is give you a description, but unlike a conversation between you and me, the computer can create what it imagines, like an artist can. then it becomes something like creating a sketch of a suspect with a sketch artist. or indeed working to create concept art with an artist)\n\nso, you have added your table, or any other elements you want to add, what if you want something fantastical, something which doesn't exist, something with NO training information available. for this thing you can create it, by whatever means you are best at. maybe you would rather create it with paper mache, or forge it out by hand, or use whatever practical effects to create it in the real world and use images of it to train the -----> AI !!! , or you might create it digitally and use expensive rendering techniques not available for real time gaming to make incredibly realistic renders to train the -----> AI !!! , or maybe you like to make a model of it, print it out on a 3d printer, paint it, and take pictures for the training, however you like is up to you. or maybe you make a drawing of it, [and the -----> AI !!!  does the work for you](https://affinelayer.com/pixsrv/index.html) provided it's somewhat like something else.\n\nso, you've made your world, you've populated it, you've put in hand placed objects of your liking, most the hard work is done, all that's left is to make your story, and for that i'm afraid, -----> AI !!!  will probably be of little help...for now.\n\nsome other videos highlighting this:\n\n[Creating photorealistic GTA 5 graphics with Deep Learning](https://www.youtube.com/watch?v=AyF6vpo7004)\n\n[Lifelike Gaming is Now Possible (Thanks to A.I.)](https://www.youtube.com/watch?v=fQlQQSsC47g) (note the section on -----> AI !!!  generated motion, the avatar can move about the space like a person would, and the section on -----> AI !!!  augmented ray tracing, a bit more is there on -----> AI !!!  augmented fluid simulations)\n\n##movies##\n\nmany of the things above apply as much to movies as to games, and much of movies will depend on good directors, good actors, and good cinematography. however let's imagine another scenario, one where you, some time in the not too distant future, when GRRM has finished a song of ice and fire want to remake the last season to better match the movies. but the actors are all old now, being like 30 years in the future, and you can't really get the folks together to redo it, so you train an -----> AI !!!  to recognize all of westeros seen in the show thus far, you train for the actors, you train for their voices, and you get to work with a dedicated community to recreate the ending entirely in CG. the -----> AI !!!  knows how dragons look and how they move,how the actors look, how they do certain things, how they sound and how they talk and how they emote, so you may even be able to, by this time, give a script to the -----> AI !!!  detailing what actors do what and it generates the set, actors, action, and special effects. then you need to move the -----> camera !!!  around the space it generates to get the best shot of it.\n\nnow of course all these technologies are still in their infancy, it will take quite some time before they are ready for the everyday user, or even for commercial use, but the technology is getting better and faster, we have gone from deep fakes needing hundred of shots to [just one](https://www.vice.com/en_us/article/qv7zkw/create-fake-videos-of-faces-samsung-ai-labs-algorithm), and while most of these focus on realism, the same techniques are applicable to anime, such as [thiswaifudoesnotexist](https://www.thiswaifudoesnotexist.net/) and while i focused on -----> AI !!!  based rendering, which i consider pretty cool, -----> AI !!!  can be used in ray tracing to improve the speed of the tracing, animation, and fluid simulations. also [An -----> AI !!!  can create a 3D model of a person—from just a few seconds of video](https://www.youtube.com/watch?v=nPOawky2eNk) the model you can see isn't the best of quality, but it is a start. and all these things will get better and better, and yes this DOES mean it will get harder and harder to tell reality from fiction, but that's what we've been trying to do for the past nearly 100 years, and when we are finally nearing the point it's possible people are pissing their pants about it.\n\nand let's be clear on that issue, they said the same thing about movies, and about television, and about video games, and about virtual reality, and about photoshop and airbrushing and CGI, all of these things have made fiction a little more like real life, it's not that easy to tell the dragon isn't real in Game of Throne, except that dragons aren't real.\n\ninstead of living in fear of what might be, let's imagine what COULD be, let's consider how -----> AI !!!  will be able to serve as an extension of our creative ability, while i mentioned entertainment there are many other applications for GANs go beyond that, a GAN could generate new designs for a car, new parts, new clothes or new designs for...really anything. and the things it generates could be printed out with a 3d printer. so even your average joe might tell their computer they want, say, a cup shaped like mickey mouse. it generates a series of models and he picks the one he likes the best, it generates a number of other kinda like that one, this continues til he accepts one to print, then it prints out his cup. \n\nreally what -----> AI !!!  means is every person on earth can have the resources of a multi-million dollar company. -----> AI !!!  can do research and development, product testing, design, things that normally require teams and a TON of money, could be at the hands of anyone with a computer. and what these people will create is far more interesting than how it could be misused.", "link": "https://www.reddit.com/r/technology/comments/bt3dzy/ai_and_the_future_of_entertainment/"}, {"autor": "sparksfly81", "date": "2019-11-04 23:10:53", "content": "Image Recognition Development Toolkit /!/  I am currently trying to prototype an app where a -----> camera !!!  can be pointed at a car and it will identify what kind of car it is and how much it is worth. I am currently researching free tool kits that have -----> image recognition !!!  development. Do you know of any?", "link": "https://www.reddit.com/r/technology/comments/drq0i9/image_recognition_development_toolkit/"}, {"autor": "MrIonSol", "date": "2019-06-29 10:26:49", "content": "Machine Learning: Living in the Age of -----> AI !!!  | A WIRED -----> Film !!! ", "link": "https://www.reddit.com/r/technology/comments/c6xdrw/machine_learning_living_in_the_age_of_ai_a_wired/"}, {"autor": "alanwong", "date": "2019-09-20 11:04:27", "content": "100,000 free -----> AI !!! -generated headshots put stock -----> photo !!!  companies on notice", "link": "https://www.reddit.com/r/technology/comments/d6t9ye/100000_free_aigenerated_headshots_put_stock_photo/"}, {"autor": "key_info", "date": "2019-01-31 18:02:29", "content": "How -----> AI !!!  is changing -----> photography !!! ", "link": "https://www.reddit.com/r/technology/comments/als8nu/how_ai_is_changing_photography/"}, {"autor": "EnazS", "date": "2019-07-05 13:14:33", "content": "Facebook uses -----> AI !!!  to analyze and catalog every single -----> photo !!!  you upload", "link": "https://www.reddit.com/r/technology/comments/c9ftps/facebook_uses_ai_to_analyze_and_catalog_every/"}, {"autor": "SteveEricJordan", "date": "2019-05-19 11:32:02", "content": "Is -----> AI !!!  the most important thing we can achieve in technology at this point? /!/ Sorry for this sloppy text, that's literally a thought that kept me from sleeping and i had to write it down real fast.\n\nJust a shower thought and probably common knowledge to people who know a bit about technology, but wouldn't -----> AI !!!  be the magical thing to achieve that would extremely speed up technology and cause a snowball effect if we use the -----> AI !!!  for science? Creating something that is much smarter than us and pushes us forward seems like the most important thing to do if our goal is developing our society. From then on we would get things like healing cancer, slowing the aging process, prolonging life up to immortality, uploading our brains to clouds, etc. So we would just need to survive until -----> AI !!!  is the a thing and then wait 10 years or so to get the scientific development of like 100 years and have all that.\n\nI know it's not everyones cup of tea and many people WANT to life a normal life and die, but i personally would love to experience this reversing aging, uploading our brains and living in a perfect computer simulation future.\n\nHow far is science in achieving things like that? Is it a realistic possibility in millenials lifetimes or is it just our deepest, unrealistic wish, to a point where we want to believe that we can achieve eternal youth and a perfect life but in reality it's completely unachievable? To me personally thinking that we can't achieve the first, most important steps to this in the next 50 years sounds kind of unrealistic. Science gets so much faster every year and people 50 years ago would have never guessed what would be possible in 2019. If we think about the history of science in the last 100 years it just seems like the next logical steps. I can't really imagine us \"only\" having contact -----> lense !!!  smartphones and flying cars in 50 years when we think about sciences achievements in the last 50 years and consider the fact that science evolves faster and faster. Ok, we don't have flying cars yet like Back to the future predicted it, but i think the most important part, computers, evolved extremely well and that's the important factor for -----> AI !!!  in the end. Probably the bigger problem will be that the elites would prevent important things like immortality to the general public.\n\nIs there anything serious to read about this topic?\n\nI found this article but it doesn't seem believable and reputable at all. Some guy nobody knows having an exact plan on when we will achieve immortality, etc. just seems like clickbait and entertainment more than real news, but it definitely sparked my interest about this topic: [https://www.news.com.au/technology/innovation/inventions/want-to-live-forever-you-just-have-to-make-it-to-2050/news-story/4c70508f0f48b6fdfb3ebed09ab85754](https://www.news.com.au/technology/innovation/inventions/want-to-live-forever-you-just-have-to-make-it-to-2050/news-story/4c70508f0f48b6fdfb3ebed09ab85754)", "link": "https://www.reddit.com/r/technology/comments/bqfwld/is_ai_the_most_important_thing_we_can_achieve_in/"}, {"autor": "azumukupoe", "date": "2019-05-23 14:01:15", "content": "Samsung deepfake -----> AI !!!  could fabricate a video clip of you from a single -----> photo !!! ", "link": "https://www.reddit.com/r/technology/comments/bs3b36/samsung_deepfake_ai_could_fabricate_a_video_clip/"}, {"autor": "BeingUnoffended", "date": "2019-03-07 14:57:17", "content": "Study Finds a Potential Risk with Self-Driving Cars: Failure to Detect Dark-Skinned Pedestrians [Response to Article] /!/ https://www.vox.com/future-perfect/2019/3/5/18251924/self-driving-car-racial-bias-study-autonomous-vehicle-dark-skin \n\nI really didn’t want to do this, but I’m seeing these kinds of claims (which seem to require quite a leap to reach the conclusions they do) more, and more often. As a computer scientist, I find the statement “algorithms can reflect the [racial] biases of their creators” patently absurd. Further, it’s not only ignorant of what data scientists actually do, but irresponsible and dangerously accusative. \n\nUnequivocally, no, algorithms aren’t racist. An algorithm is a mathematical structure designed to carry out a specific task. Facial recognition is complicated, it has to account for hundreds of variables; skin-tone being only one. These issues with recognizing dark skinned faces are fairly common across all facial recognition suites. And for the most part, they can be explained by two things: \n\nA) Default -----> camera !!!  settings aren’t equipped to expose images enough to recognize individuals with dark skin under all conditions; such as where there is a light-source directly behind their head, or there is insufficient light across the subject’s face \n\nB) Software is not yet sufficient enough to split-the-difference (so to speak) when subjects of dramatically different skin-tones are being accounted for simultaneously. Such as a face identifying photo-suite attempting to adjust/balance for a (beautiful – like gosh are these people even real?) interracial couple: https://imgur.com/gallery/aWUHqz6 \n\nThere are other things that such as the case noted by VOX where the -----> AI !!!  for Google’s Photo App identified some photos of Black people as gorillas. Despite the dramatic, and unfortunate circumstances of this case, it is actually still the same issue; lighting and exposure. In fact, it is even more difficult to account for poor lighting conditions in still images (as opposed to real-time detection), as you can only adjust so far without totally washing out. And, too be clear; the algorithm that was to blame here was a simpler pattern-matching (colors, shapes etc.) algorithm. This is different than the kind being used in something like pedestrian-detection and decision-making algorithms used in self-driving cars. \n\nObviously, this doesn’t mean we don’t want the technology to be more accurate. But to dismiss these technological hurdles as evidence of *subversive racism* among developers isn’t helpful. It disparaging to those trying to solve these problems, and it demonstrates a low-resolution understanding of the technological obstacles underlying these issues developers face.  \n", "link": "https://www.reddit.com/r/technology/comments/aydgwn/study_finds_a_potential_risk_with_selfdriving/"}, {"autor": "thefuture_isnow", "date": "2019-04-15 15:30:39", "content": "Emotional surveillance: If you're happy and you know it, so do -----> AI !!!  /!/ \"What if I told you we're already living in an emotional surveillance state – that your facial recognition data can be harnessed by any networked device with a -----> camera !!! , that your face most likely exists in a database already that allows your emotions to be analyzed instantly, and even if you covered up your webcam and never looked directly at your phone, you still may come face-to-face (so to speak) with a billboard that changes based on whether you smile or sneer at it in the near future?\"\n\n[https://www.montag.wtf/emotional-surveillance/](https://www.montag.wtf/emotional-surveillance/)", "link": "https://www.reddit.com/r/technology/comments/bdhbi1/emotional_surveillance_if_youre_happy_and_you/"}, {"autor": "CanadaGrants", "date": "2019-10-03 07:12:45", "content": "Molecule.one uses -----> machine learning !!!  to make synthesizing new drugs a -----> snap !!!  – TechCrunch", "link": "https://www.reddit.com/r/technology/comments/dcnep5/moleculeone_uses_machine_learning_to_make/"}, {"autor": "sheetrockers", "date": "2019-09-25 22:54:19", "content": "Snapchat, other platforms may be monetizing users' emotions /!/ A short documentary named ‘Stealing Ur Feelings‘ is using dark humor to expose how Snapchat, Instagram, and Facebook can use facial emotion recognition -----> AI !!!  to profit off users’ faces and emotions.\n\n&amp;#x200B;\n\nHere's the -----> film !!! : [***https://stealingurfeelin.gs/***](https://stealingurfeelin.gs/)\n\n&amp;#x200B;\n\nAnd more about it (looks like Mozilla paid for it?): [https://blog.mozilla.org/blog/2019/09/23/introducing-stealing-ur-feelings-an-interactive-documentary-about-big-tech-ai-and-you/](https://blog.mozilla.org/blog/2019/09/23/introducing-stealing-ur-feelings-an-interactive-documentary-about-big-tech-ai-and-you/)", "link": "https://www.reddit.com/r/technology/comments/d9au9n/snapchat_other_platforms_may_be_monetizing_users/"}, {"autor": "123designSRQ", "date": "2019-06-21 22:14:34", "content": "-----> AI !!!  -----> CAMERA !!!  FOR KIDS THAT IS SIMILAR TO GOOGLE LENS", "link": "https://www.reddit.com/r/technology/comments/c3hask/ai_camera_for_kids_that_is_similar_to_google_lens/"}, {"autor": "ourlifeintoronto", "date": "2019-05-23 13:35:17", "content": "Samsung deepfake -----> AI !!!  could fabricate a video clip of you from a single -----> photo !!! ", "link": "https://www.reddit.com/r/technology/comments/bs30td/samsung_deepfake_ai_could_fabricate_a_video_clip/"}, {"autor": "lastfanonearth", "date": "2019-05-14 18:23:23", "content": "New -----> AI !!!  shatters all records for dating -----> photo !!!  analysis", "link": "https://www.reddit.com/r/technology/comments/bomjya/new_ai_shatters_all_records_for_dating_photo/"}, {"autor": "danishpandey09", "date": "2019-07-10 14:00:40", "content": "Smartphone of a New Generation: LG W30 /!/ Priced at Rs. 9,999 LG W30 marks the rebirth of the brand. This stylish smartphone is for the new generation which available in three beautiful colour variants: Aurora Green, Platinum Gray and Thunder Blue. It launched in India on 26 June as a part of the W Series and the first sales began just today. Looking at the features, I can definitely assure you that this phone is worth every penny.\nThe most attractive feature about this phone is the customizable notch display. Yes! As unbelievable it might sound, it is true. LG W30 gives you the power to customize your display into V notch, U notch or no notch as per your requirement. It has an OLED FullVision HD+ display with a screen size of 6.26-inch. The aspect ratio is 19:9 and the screen-to-body ratio is 86%. The -----> camera !!!  specs of the phone are remarkable too. It has triple -----> AI !!!  -----> camera !!! s with 2MP depth sensor + 13MP wide-angle + 12MP low-light -----> camera !!!  with Bokeh mode, 100° without distortion &amp; 2X Optical zoom respectively. With a 16MP front -----> camera !!! , it becomes a favourite among selfie lovers. \nThis amazing configuration is possible with the support of one of the best smartphone processors which is currently available in the low-budget smartphone market. MediaTek Helio P22 is an exceptional octa-core chipset based on TSMC’s 12nm fabrication process and is clocked at 2 GHz. Hence, the power-efficiency and performance are well optimised. The 3GB RAM is an additional factor which successfully supports the phone in delivering a swift multitasking experience on the latest Android v9.0 (Pie) operating system.\nThe important thing here is that this budget smartphone by LG is not only capable of high-resolution photography and some best-in-class performance, but is also loaded with a massive 4000 mAh battery, fingerprint sensor and a 32GB + 256GB expandable internal memory.", "link": "https://www.reddit.com/r/technology/comments/cbh2bp/smartphone_of_a_new_generation_lg_w30/"}, {"autor": "danishpandey09", "date": "2019-07-03 13:38:44", "content": "Why Should You Buy LG W30? /!/ Priced at Rs. 9,999 LG W30 marks a new revolution for the brand. This stylish smartphone in the W series is crafted for the new generation and is available in three beautiful colour variants: Aurora Green, Platinum Gray and Thunder Blue.\nThe most attractive feature about this phone is the customizable notch display. Yes! As unbelievable it might sound, it is true. LG W30 gives you the power to customize your display into V notch, U notch or no notch as per your requirement. \nIt has a wide FullVision HD+ 6.26-inch display with an aspect ratio of 19:9, which provides a great viewing experience. The huge 4000 mAh battery is highly capable of optimizing power management efficiently. It has triple -----> AI !!!  -----> camera !!! s with 2MP depth sensor + 13MP wide-angle + 12MP low-light -----> camera !!!  with Bokeh mode, 100° without distortion &amp; 2X Optical zoom respectively. With a 16MP front -----> camera !!! , it is an impressive buy for selfie-enthusiasts.\nOne of the most important things about a great smartphone is how efficiently it performs and with the presence of an octa-core MediaTek Helio P22 processor, clocked at 2 GHz, LG W30 delivers a satisfactory performance and a lag-free experience. MediaTek’s Helio P22 is one of the best mobile processors which powers pocket-friendly smartphones very efficiently.\nIt functions on the latest Android v9.0 (Pie) provides a great user interface and the 3GB RAM helps in enhancing the phone’s performance and providing an ultimate lag-free experience. Additionally, the 32GB + 256GB expandable memory storage is great for storing multimedia files.", "link": "https://www.reddit.com/r/technology/comments/c8o7by/why_should_you_buy_lg_w30/"}, {"autor": "pallavmohan1", "date": "2019-08-09 07:11:04", "content": "LG W10: Configuration in Detail /!/ I am super-impressed by the configuration of this pocket-friendly “W series” phone by LG which is the W10. The phone is available in 2 appealing colour variants: Tulip Purple and Smokey Gray. It has a wide FullVision HD+ 6.19-inch display which provides a great viewing experience. The huge 4000 mAh battery is highly capable of optimizing power management efficiently. It has smart dual -----> camera !!! s of 13MP + 5MP with -----> AI !!!  enhancements. With an 8MP front -----> camera !!! , it is an impressive buy for selfie-lovers. With the presence of an octa-core MediaTek Helio P22 processor, clocked at 2 GHz, the phone delivers a fluid performance and a lag-free experience. MediaTek’s Helio P22 is one of the best mobile processors which powers pocket-friendly smartphones very efficiently. The latest Android v9.0 (Pie) provides a great user interface. The high RAM of 3GB helps in enhancing the phone’s performance and providing an ultimate lag-free experience. The 32GB + 256GB expandable memory storage is great for storing multimedia files in this price range.", "link": "https://www.reddit.com/r/technology/comments/cnyu2w/lg_w10_configuration_in_detail/"}, {"autor": "MusicInstrument", "date": "2019-03-11 14:29:34", "content": "Vintra raises $4.8 million to analyze -----> camera !!!  footage with -----> AI !!! ", "link": "https://www.reddit.com/r/technology/comments/azu384/vintra_raises_48_million_to_analyze_camera/"}, {"autor": "varindia", "date": "2019-01-15 10:12:16", "content": "itel unveils A44 Air – An -----> AI !!! -enabled dual------> camera !!!  smartphone", "link": "https://www.reddit.com/r/technology/comments/ag71qg/itel_unveils_a44_air_an_aienabled_dualcamera/"}, {"autor": "CT-RFAntennas", "date": "2019-12-07 08:09:52", "content": "What is Li-Fi? /!/ In the technical solution for future communications, some people think that the whole house's smart terminal is enough to connect to 5G, and some people think that WiFi will still stand on the throne of cost performance. Since each communication method has its own advantages and disadvantages, the brain hole may be larger, such as using the light bulb to go online.\n\nAt present, the more likely fate of Li-Fi is still in places where high-security requirements such as radio signals are not allowed (such as radio astronomy telescopes, nuclear power plants, etc.) are easily interrupted or missing. The emergence of a complementary identity helps to achieve more stable and high-speed communication. And because there are no spectrum restrictions, Li-Fi will also provide the next technology exit for crowded 5G.\n\nIt ’s not that I'm whimsical. In 2011, a professor at the University of Edinburgh, Harald Hass, made a speech using LED light sources to transmit data wirelessly. The novel term Li-Fi (light fidelity) was seen as a substitute for The technological light of WiFi.\n\nHowever, this technology is too advanced and unstable, which has caused it to stay in the marketing tactics of laboratories and some LED manufacturers. Compared with the momentum of 5G, Li-Fi, which has also been regarded as a \"WiFi disruptor\", is still an interesting gadget for niche geeks, and its development trend is not embarrassing. Does it really have that capability and necessity and can replace WiFi into our living space? The different trends of Li-Fi and 5G technologies also reflect the \"hidden rules\" of technology changes?\n\nWhat is special about Li-Fi, which has been placed on the Internet by light bulbs?\n\nWith the announcement of the establishment of a new company to research (visible light wireless communication) technology in the United States, LightPointe makes Li-Fi appear in people's vision again. As the name suggests, Li-Fi uses visible light for wireless data transmission, and some people call it \"light fidelity technology.\" The working principle is simply that visible light such as LED lights is used as the transmission source of the information transmission system. The chip is implanted to form a network access point similar to a WiFi hotspot, and the light source is controlled to send high-speed signals to control the network transmission of the terminal receiver. \n\nAs long as there is light, I can access the Internet. Does it sound better than WiFi and 4 / 5G? The latter not only requires infrastructure with a huge capital scale but also has problems such as disconnection and radiation. Li-Fi is not the same. You can connect to the Internet by turning on the light tube indoors. You can still download movies at high speed while standing under the street light at night, and it is absolutely green and low-carbon and harmless.\n\nUnfortunately, when something doesn't look perfect, it must not be true. Li-Fi does just that.\n\nUnlike 5G's step by step, Li-Fi's development in the past decade cannot be described as difficult. The creator of the technology, Herald Haas, spent several years developing LiFi technology to the third generation, only to get rid of the conceptual level and become a real product.\n\nThe performance of the third-generation \"LiFi-X\" has been greatly improved. For example, it is smaller in size and has a transmission rate of 40Mbps. It can receive side and backlight sources, which greatly improves the network effect. Sounds good? But this is obviously not the same as the commercial wave of 5G for all.\n\nInterestingly, when Haas proposed the Li-Fi signal chip solution, many smartphone mobile manufacturers were still studying the 5G standard. In other words, at the time, the industry's attitudes toward Li-Fi and 5G were similar, that is, they were cautious, and they hope to deploy it after the technology is verified.\n\nEmerging communication technology PK? Talking from the inherent insufficiency of WiFi\n\nAlthough the technical principles of Li-Fi now seem a bit incredible, the existence is reasonable, and the rationality of Li-Fi at that time was given by the natural defects of WiFi.\n\nAs we all know, WiFi plays a very important role in mobile communications. Today we can access the network from anywhere in the space, including coffee shops and KFC.\n\nBut the biggest problem with WiFi is also this. On the one hand, the signal coverage is small, and the strength and weakness change obviously, which makes the communication transmission unstable. When the speed of the network changes, lost connections, disconnected games, video freezes, etc. are all the crazy scenes often encountered.\n\nIn addition, the security risks of WiFi have also raised unprecedented questions. The transmission signals of radio waves can be easily hijacked by hackers, thus completely exposing user information. Presumably, many people have had unpleasant Wi-Fi connections leading to information leakage, or their own Wi-Fi account has been unpleasantly shared and misused.\n\nThis is more likely to cause anxiety in the early days of the outbreak of smart pan-terminals. Because multiple terminals and multiple users access WiFi at the same time, in addition to the decline in experience speed, when your home's smart door lock, health bracelet, -----> camera !!!  treadmill, etc. are all connected in series under the same WiFi system, once a single hardware vulnerability is broken The serial risks brought by it are probably unimaginable.\n\nFinding and developing new communication technologies has become an area where engineers have long been involved.\n\nAt the time, Li-Fi and 5G appeared on the researchers' desks at the same time.\n\nFirst of all, both of them have high advantages over WiFi in terms of the transmission rate. The planned speed of 5G is 10Gbps, which will be further improved after commercial use. The throughput of Li-Fi also far surpassed that of WiFi. At that time, the small miniature LEDs released by pure Li-Fi could transmit at 8 Gbps and theoretically could reach 200 + Gbps. Supporting hundreds of millions of IoT devices did not seem to be a problem.\n\nAt the same time, the security of both is obvious to all. 5G communication authenticates users, which can effectively ensure user information security. Li-Fi uses the characteristics of visible light for transmission, making it impossible to bedside walls, and the wave-particle duality of light makes it difficult to be used, so it is almost impossible for information in the building to be leaked.\n\nMore critically, unlike the large-scale investment required for 5G to establish a large number of communication base stations, Li-Fi almost does not require high operating costs, and it is sufficient to replace the city's visible light source with an LED with a transmission chip.\n\nObviously, in the technological change replacing WiFi, some special chemical reactions occurred, which led to today's Li-Fi out.\n\nThree major nodes that explain the exit of Li-Fi and the superiority of 5G\n\nThe business world is sometimes very metaphysical. New technology is superior and has no law. There are no absolute rules in itself. Often, it depends on certain causes or special conditions.\n\nJudging by the history of Li-Fi and 5G, this is exactly what it shows.\n\nIn theory, Li-Fi has certain technical and application advantages whether it is WiFi or 5G. Why didn't it end up hitting both?\n\n1. The technical tipping point has not yet appeared.\n\nIf you want to replace a mature technology, the replacement technology must be of higher industrial value. WiFi is almost ubiquitous, and as bandwidth increases, Li-Fi still has a long way to go to become a substitute for it.\n\nAs Jack Gold, president of mobile consulting firm J. Gold Associates has questioned: visible light communication has been tried for several years, this is not new, and getting a huge amount of bandwidth is not as simple as it sounds.\n\nOne of the technical problems is the reverse transmission. How Li-Fi terminal equipment reflects signals to LED lights requires professional integrated chips to support it. It is still in the early stages of research. The second is the transmission distance. It must be laid out in the use scene without dead ends. LED light source to ensure the Li-Fi network, while minimizing the learning and adaptation costs, obviously also requires the continuous polishing of engineering solutions. The third is signal interference. Although the Li-Fi signal is not as easy to be hijacked as WiFi, it is easy to be interfered with. It is not only unable to penetrate the wall, there is a block between the terminal and the light source, and the signal will be cut off unless you have an LED searchlight on your head Mobile phones, otherwise disconnected from time to time may be made at a large group of \"stars will be dead without internet.\n\n2. Industry synergy efforts.\n\nCompared with the baptism of 5G to the communications, semiconductor, terminal software and hardware industries, Li-Fi's industrial chain is longer, and it also involves many fields such as lighting and power. However, these areas lack the right to speak and guide the cutting-edge communication technology, which has led to the integration of chips, industry standards, terminal development, etc. required by Li-Fi, even though LED manufacturers are actively promoting and calling for Li-Fi. , Lack of sufficient industrial support.\n\nAlthough Cisco and EMC (energy control and IoT solution providers) have all expressed interest in Li-Fi technology, some companies have also started testing Li-Fi, but they are only staying in the exploration stage, and it is not important. Commercial decision. The lack of upstream and downstream collaboration in the industrial chain is in stark contrast to the rapid industrialization of 5G driven by communications and -----> AI !!!  giants.\n\n3. Challenges in end-market niche markets.\n\nEven if Li-Fi has reached the promise of realistic throughput and scale, it has also constructed a series of industrial ecosystems of communication + lighting + power. If its endpoint equipment cannot enter the market, it will be difficult for consumers to choose. fate.\n\nWe know that mobile smart terminals have entered the stage of integrated and miniaturized design. For example, the Kirin 990 launched by Huawei not long ago is a SOC chip with integrated 5G functions. At this stage, the Li-Fi system can only appear in the form of a prototype. Its volume is large, and it cannot be deployed in various small and micro terminals. Increased distance of Li-Fi from the mass market.\n\nAt present, the more likely fate of Li-Fi is still in places where high-security requirements such as radio signals are not allowed (such as radio astronomy telescopes, nuclear power plants, etc.) are easily interrupted or missing. The emergence of a complementary identity helps to achieve more stable and high-speed communication. And because there are no spectrum restrictions, Li-Fi will also provide the next technology exit for crowded 5G.\n\nAlthough its tuyere is still unknown, in these niche proving grounds, Li-Fi technology itself can also gradually iterate, looking for its own killer application. After all, the development of science and technology is better than finding the most valuable option among the impossible of countless trial and error.\n\nIf you need the RF antenna solution and products, please contact [C&amp;T RF Antennas Inc](mailto:http://www.ctrfantennas.com/), thank you.", "link": "https://www.reddit.com/r/technology/comments/e7brvl/what_is_lifi/"}, {"autor": "aoruri123", "date": "2019-07-02 07:53:24", "content": "Anyone interested in an autonomous -----> camera !!!  that may be used for gaming, home security, or crawl space? /!/ Hey guys! This is not a commercial but just asking about customer needs. ⭐ By filling out a survey you have a chance to win a free product or a 50% off discount! https://docs.google.com/forms/d/e/1F-----> AI !!! pQLSffWk46JBEwKtKRy8klL3D92C_8J3kFU_FNpI93cqwMw4JiRQ/viewform?usp=sf_link ⭐ \n\nWe’re a tech and -----> AI !!!  company that is dedicated to customer robots and robotic devices. We’d like to introduce you to our NEW conceptual product - a “-----> camera !!!  on wheels” that is able to drift freely (360° rotation / lateral drift / 45° oblique drift, etc.) \n\nNow it comes with 1080P image, night vision, Wi-Fi connection, app control, and auto recharge. We’re thinking about making it a helpful addition for family and have five different options for ya! \n\n- Programmable gaming bot for fun\n- Autonomous surveillance -----> camera !!! \n- Inspection robot for crawl space/anywhere that’s hard to reach\n- UV cleansing bot for home and travel\n- Pet training tool\n\nHow do you like that? Check out our draft and share your thoughts at the link above. Any suggestions on features, industrial design, size, speed, materials, etc. are also welcomed!", "link": "https://www.reddit.com/r/technology/comments/c86gmo/anyone_interested_in_an_autonomous_camera_that/"}], "name": "Subreddit_technology_01_01_2019-30_12_2019"}