{"interestingcomments": [{"autor": "in-noxxx", "date": "2021-10-29 13:20:19", "content": "What if everything we know about data science is wrong. /!/ To start off I am not a data scientist, or a big data analysts etc. I do have a masters in Computer Science, undergrad stats courses, graduate data science classes, experienced in building -----> machine learning !!!  systems and some work on \"AI\". In grad school I became completely disillusioned with data science because it was crystal clear to me that we were using jedi math tricks(What my undergrad calc professor called statistics) to prove our own assumptions.\n\nIn grad school we made a -----> machine learning !!!  system to analyze a -----> photo !!!  of a face and guess age. Everyone was convinced it worked, but basically under the hood it just looked for lines, and wrinkles and since we were all white and asian that is what it used as reference, and it guessed our age pretty accurate. When I got a darker skin student who's lines were less noticeable under the light, it wouldn't reliably work. I just remembered being worried if that was put into some other system to authenticate age etc and how it would fail for certain people, even if technically the math worked out and it mostly worked for a large amount of people.\n\n&amp;#x200B;\n\nHow come there isn't more research into some sort heuristic(instead of speed it solves for bias) algorithms or theoretical equation(Think time complexity but bias complexity) that can identify a model and it's inefficiencies or potential biases and generate a better model without human interaction to atleast give a counterpoint to fallible humans. I spent a few hours(ive been up ince 3 writing code for work) looking at scholar articles about this and their seems to be no real research going into this. All I see is a few data scientists sounding the alarm to an ignorant public that can't do HS algebra, let alone understand advance statistical methods. Is anyone else worried about this?", "link": "https://www.reddit.com/r/datascience/comments/qico3x/what_if_everything_we_know_about_data_science_is/"}, {"autor": "madzthakz", "date": "2021-01-19 14:34:08", "content": "I'm a Senior Data Scientist at Disney and I'm hosting another Data Science Q&amp;A session this Thursday @ 5:30 PM PST. I'll be joined by a Principal Data Scientist at Clearbanc! /!/ \\*\\*DISCLAIMER\\*\\*: This is completely free and not sponsored in any way. I really just enjoy helping students get started and potentially transition into Data Science\n\nAs the title mentions, I'm a Senior Data Scientist at Disney and I'm going to host **another** Data Science Q&amp;A this Thursday at 5:30 PM PST. This time I'll have **Susan Chang** join me. Susan is a Principal Data Scientist at Clearbanc and hosts -----> ML !!!  streams on Youtube (focus on Reinforcement Learning) and has built her own gaming platform which has been featured in PC Gamer. Her experience is uniquely diverse and I feel like you guys will be able to learn a lot from her. \n\nLast month’s sessions were an absolute blast with over 250 people who attended from all over the world. I hope you see you all there!\n\nRegister Here:\n\nhttps://disney.zoom.us/webinar/register/WN\\_SbiRedGfRdi2v94gnI-rTw\n\nVerification:\n\nMy -----> photo !!! : [https://imgur.com/a/Wg3D-----> ML !!! V](https://imgur.com/a/Wg3D-----> ML !!! V)\n\nMy LinkedIn: [https://www.linkedin.com/in/madhavthaker/](https://www.linkedin.com/in/madhavthaker/) (feel free to connect)\n\nSusan's LinkedIn: [https://www.linkedin.com/in/susan-shu-chang/](https://www.linkedin.com/in/susan-shu-chang/)", "link": "https://www.reddit.com/r/datascience/comments/l0kz3n/im_a_senior_data_scientist_at_disney_and_im/"}, {"autor": "lalopark", "date": "2021-06-25 08:48:50", "content": "Computer Vision project: measuring the length of a human ear /!/ Hi, I’m trying to come up with a model that takes in a -----> photo !!!  of a human ear and measures its vertical length. I’ve found a few usable data sets of ear images, but it seems like the key is to label them somehow… Any pointers on where to begin and how to structure the solution? I’m very new to -----> computer vision !!!  so would appreciate any and all pointers xx Thank you", "link": "https://www.reddit.com/r/datascience/comments/o7js86/computer_vision_project_measuring_the_length_of_a/"}, {"autor": "TainboWainbo", "date": "2021-05-13 15:46:47", "content": "HELP!- I work at a Government. How do I transition into a Tech Company? /!/ In the past few years, I finished school with a statistics degree (bachelor), taught myself programming (Python, R, shell scripting), built portfolio on data analysis, data visualization and statistical analysis, worked as a programmer/math assistant at a lab for about a year during school, worked as a data analyst intern for about 4-5 months towards end of school and now working as a quantitative analyst for a government organization a little over a year (my \"first real job\" after graduation). Recently, I've been focusing on applying jobs at tech companies and reaching out to people (including recruiters) on LinkedIn for networking. For most of the application, I wrote a tailored cover letter and cv (one page summarizing my work exp - about 3 years in total - as well as 3-4 personal projects) and reached out to people who work at those companies for insights. I've been doing everything I could to improve my chances of getting interviews, but was not successful (I've gotten only one phone interview recently but was rejected for a data analyst role because I was less experienced compared to other candidates).\n\nI've been feeling depressed at my current work. I find myself restricted from doing more data science-related projects due to bureaucracy and office politics. I like taking initiatives and going out my way to improve things (like inefficiencies in data transfer, analysis, etc.) but noticed that colleagues are tech-averse and hate changes (even if it provides more efficiency), which doesn't offer a lot of learning/growing opportunities - everything that I stand against - and I don't see myself being at this company long-term. I have a strong interest in ecommerce and have been applying to companies (big and small/startup) related to it but I feel that recruiters may be biased against my non-engineering degree, the fact that I don't have 4 co-op internships and that I work at a government (I've been told by someone who works as a recruiter at a very well known ecommerce company that when they see someone working at gov't, they just throw out their cv). \n\nI spend most of my evenings after work applying to jobs, networking online, learning new data science skills, and working on personal projects (currently working on a raspberry pi project with motion sensor and -----> camera !!!  so that I can detect this outdoors kitty in my neighbourhood using -----> machine learning !!!  - image recognition with CNN - and send mobile notification so I can pet kitty everyday). I think I'm doing everything I can but not seeing much progress. I'm starting to wonder if there's something that I'm not doing enough or if I should go back to school with co-op option or do some bootcamp with a job guarantee just so I get my foot in the door and have a better chance transitioning into a tech company. Any advice?\n\nAlso, I'm not necessarily looking for \"you should try Udemy/Coursera/\\[insert some bootcamp for beginners\\]\" unless you have a fantastic recommendation - I am already using DataCamp for learning. If you have similar experiences as me or is someone working as a senior/recruiter hiring for data-related roles and can give an honest opinion of how I can make my application stronger, I'd appreciate it :) Cheers", "link": "https://www.reddit.com/r/datascience/comments/nbjp1g/help_i_work_at_a_government_how_do_i_transition/"}, {"autor": "OnlyProggingForFun", "date": "2021-01-23 15:32:51", "content": "THE -----> AI !!! -POWERED ONLINE FITTING ROOM: VOGUE. A game-changer for online shopping and -----> photography !!! ? Let me know what you think /!/ Google used a modified GAN architecture to create an online fitting room where you can automatically try-on any pants or shirts you want using only an image of yourself. It is a very popular artificial algorithm mainly used for faces that they adapted for this application which could be a game-changer for online shopping and -----> photography !!! ? Let me know what you think.\n\nWatch the video explanation: [https://youtu.be/i4MnLJGZbaM](https://youtu.be/i4MnLJGZbaM)  \nThe paper and project: [https://vogue-try-on.github.io/](https://vogue-try-on.github.io/)  \nAn interactive demo: [https://vogue-try-on.github.io/demo\\_rewrite.html](https://vogue-try-on.github.io/demo_rewrite.html)", "link": "https://www.reddit.com/r/datascience/comments/l3e4uq/the_aipowered_online_fitting_room_vogue_a/"}, {"autor": "blueest", "date": "2021-01-22 19:01:40", "content": "Use of -----> ml !!! /ai for -----> photo !!!  editing /!/ I have a friend who loves to take and edit -----> photo !!! s (lightbox, -----> photo !!! shop). Does anyone have any knowledge about how -----> ml !!! /ai algorithms are used to retouch -----> photo !!! s in these types of software? I told my friend that its possible \"background removal\" is done with clustering algorithms... but i don't think my answer was satisfactory.\n\nDoes anyone have any knowledge on this topic?\n\nThanks!", "link": "https://www.reddit.com/r/datascience/comments/l2ugou/use_of_mlai_for_photo_editing/"}, {"autor": "IntInstance", "date": "2021-05-20 13:40:58", "content": "Object tracking algorithm to track targets with a moving -----> camera !!!  (drone, car, etc.). /!/ My task is to develop an algorithm for the drone to follow the human.  I tried multiple object tracking algorithms including matching-based algorithms, -----> deep learning !!!  (ATOM, DiMP, SiamRCNN, Stark, Ocean, SuperDiMP, SiamDW), but they did not achieve an acceptable result.\n\nCan you suggest some other methods?", "link": "https://www.reddit.com/r/datascience/comments/nh0iqy/object_tracking_algorithm_to_track_targets_with_a/"}, {"autor": "bngproduct", "date": "2021-09-10 07:20:20", "content": "I made a curriculum that helps data science job seekers who is actively interviewing be better prepared for interview. I'd love your feedback /!/ # Approach: \n\nBusiness Problem solving Skill using data  + Hands-on Coding Skill Interview focussed + People Skill/ Leadership Skill + Mentorship = Interview Success Formula  \n\n\n**Part 1.) Practical Problem Solving Interview prep: (10- 12 Minute Videos)**\n\n**Practice Framework for answering:** Problem Statement, Metrics, Architectural Components, Feature Engineering, Training Data Generation, Modeling\n\n* Design a -----> machine learning !!!  platform\n* Design Facebook -----> photo !!!  tagging\n* Design Amazon Alexa\n* Design a fake news detector\n* Design youtube’s recommendation system\n* Fraud detection engine for a bank\n* Customer churn prevention for Food Aggregator\n* Flight Price optimization model for Makemytrip\n* Search Ranking\n* Feed Based System\n* Recommendation System\n* Self-Driving Car: Image Segmentation\n* Entity Linking System\n* Ad Prediction System\n* School Budgeting with Machine Learning in Python  \nTask for students: Prepare Google Sheet in Framework format for 10 different Solution  \n**Part 2.) Hands-on Coding Simulation Practice:** \n\nMath Concept: \n\n* Sparse Matrix Multiplier\n* Get statistic\n\nModel Concepts\n\n* K-nearest neighbour\n* K-means\n* Multinomial Naive Bayes\n* Regression Tree\n* Neuron\n\nModel Application\n\n* Classify Text from Image\n* Predict Cancellation\n\nPython \n\n* Exploratory data analysis using python\n* Apply Naive Bayes on data\n* Applying Bag of words on data\n* Apply ARIMA Algorithm on data  \n\n\n**Part 3.) Behavioural Interview Prep (6-10 Minute Videos)**\n\nThrough our behavioural matrix, we'll teach you how to nail your elevator pitch and draft answers to questions we predict with data.\n\nPrepare for Amazon Principles: Customer Obsession, Ownership, Invent and Simplify, Learn and Be Curious, Hire and Develop the Best, Insist on the Highest Standards, Think Big, Bias for Action, Frugality, Earn Trust, Dive Deep, Disagree and Commit, Deliver Results\n\n* General Tips\n* Frameworks to answer question\n* Imagine you had a low performer on your team. How would you handle the situation? What would you do to help them?\n* Describe a time when there was a conflict within your team. How did you help resolve the conflict? Did you do anything to prevent it in the future?\n* Why do you want to work at ?\n* Describe a time when you strongly disagreed with a coworker about an engineering decision. How did you go about making the final decision? What did you do after the decision was made?\n* Imagine you and your team are in the middle of a major project at work, with many moving parts, complicated context, a lot of work, etc.. A new software engineer joins your team, and you're tasked with onboarding them; what do you do?\n* How would you go about distributing work for a project across a team of software engineers? If you've led a project in the past, describe what you did.\n* Describe a time when you made a mistake. How did you deal with the repercussions of the mistake? What lessons did you learn from the mistake?\n* Describe a challenging project that you worked on. Why was it challenging? What was your role in the project? How did you deal with the various difficulties of the project?\n* Describe a time when you had to deal with an outage at work. How did you handle the situation? What steps did you take after the issue was resolved?\n* What do you think about receiving and giving feedback? Describe a time when you received tough feedback and/or a time when you give tough feedback. How did you react to it? How did you give it?\n* What aspects of data science do you think you're very good at? What about areas where you'd like to improve? How do you plan on improving?\n* Describe a time when you went out of your comfort zone. Why did you do it? What lessons did you learn from the experience?  \n**Task: Prepare Google Sheet in Framework format for 10 different Solution**\n\n**Part 4.) Community Answers: (At least 5-different perceptive answer for each question)**\n\n* Answer to 100 top Interview Questions in Text format from Experts, Mentor, Alumni, Professor, and Fellow Student.", "link": "https://www.reddit.com/r/datascience/comments/plg6w9/i_made_a_curriculum_that_helps_data_science_job/"}, {"autor": "oblakinolog", "date": "2021-09-24 13:50:12", "content": "Best approach to get net trained on faces/makeup. /!/ Looking for advice of what -----> ML !!!  or NN technics to use for showing faces before-mid-after having a lot of -----> photo !!! s from makeup master. So that there are initial images, couple of in progress and final. Imagine scroll bar that will predict no makeup to final beauty of taken face -----> photo !!! .\nThanks!", "link": "https://www.reddit.com/r/datascience/comments/puk6r3/best_approach_to_get_net_trained_on_facesmakeup/"}, {"autor": "rtl55-2", "date": "2021-08-03 17:22:11", "content": "Does it really matter where you go to graduate school for MS DS if you just want to be a data engineer and/or a tech lead one day? /!/ For personal reasons, I've always wanted to attend WPI (Worcester polytechnic institute) and it's considered a good engineering school and known in the Boston area. Of course, it's not up to par with MIT but most people compare it to Northeastern University. I'm from the Boston area so it's easy to get to their campus if needed.\n\nI have a BA in CS minoring in math in undergrad and I attended a small private university. I'm currently working full-time as a Data Engineer at a consulting company in NYC that piggybacks off of bigger firms such as Microsoft and Accenture. My current and past projects have used Python, SQL, Azure, GCP, big data pipelines with Pyspark, Spark, Databricks, Data lakes, Snowflake, Big Query and Power BI.\n\nMy plan is to stay at this company for about 3 more years and finish a masters online while working. Probably a pace of one course a semester is manageable for me. That way I can gain experience in many different industries solving real world data problems and move my way up in the company as I get a master's. Then the plan is to apply to bigger companies and maybe some FAANG or MSFT in the Boston and NYC area.\n\nFor flexibility I would like to do a master's degree online and fortunately, cost is not a concern. I was accepted to the online MS DS program at WPI. They're one of the few schools to have a PhD in data science as well (but not interested in that currently)!\n\nWhen doing some research it seems like there are other good programs out there as well like Georgia tech's OMSCS and OMSA, UC Berkeley's MIDS, Northwestern's MS DS, John Hopkins' MS DS, and University of Illinois' MCS DS. Are there any others that I'm forgetting? Will it really benefit me to go to one of these \"bigger name\" programs instead of WPI?\n\nAlso content wise, what should I be looking for in a DS program? What I'm currently looking for out of a program is building critical thinking skills, the competitive -----> lense !!!  for solving data problems as they apply to the business, to fill in the gaps learning some basic -----> machine learning !!!  algorithms (I learned many SWE algorithms in undergrad and even took NLP, but don't have much practice/experience with building data models and ML algorithms), networking opportunities and the master's degree title for a manager position/salary boost.\n\nOut of SWE, DS, ML, BI, data visualization and DE, I enjoy DE the most and especially constructing and optimizing big data pipelines/cleaning and preparing data! But I don't want to make the mistake of locking myself into one area career-wise either especially because job market changes and inevitable (over the next 3 years).\n\nAs a job applicant with about 3-4 projected years of experience with DE, some BI development, visualization and reporting as a business tech consultant, does it really matter where you go to graduate school for a MS DS if you just want to be a data engineer, manager and/or a tech lead one day?", "link": "https://www.reddit.com/r/datascience/comments/ox87tz/does_it_really_matter_where_you_go_to_graduate/"}, {"autor": "ptoews", "date": "2021-09-21 16:19:15", "content": "Choosing a setup: GPU count vs. per-GPU memory /!/ We are finalizing our plans for a -----> deep learning !!!  machine but are unsure about the best GPU choice. It will be used on -----> camera !!!  image and point cloud data in parallel with a few classification heads, so the network will be rather large (but still as small/fast as possible).\n\nWe can either get 3x (Quadro) RTX A6000 or 6x RTX 3090 for the same price. According to benchmarks, the 3090 based setup should be about 1.8x faster. On the other hand, the A6000 has double the memory per GPU which allows larger batch sizes per GPU. However I'm not sure how big of an advantage this is compared to the distributed batching with multiple GPUs (data parallelism).\n\nAnother possibility is of course to parallelize experiments, however I don't think there will be running more that two experiments at the same time that often. So data parallelism would come into play either way.\n\nAnother topic is of course power and thermal management. We would use a crypto-style open rig for the 6x setup, for the 3x one the mainboard is able to take them all. However we would probably need two PSUs with the 6x setup. PCIe lanes should be no problem as we have 128 of them.\n\nWhich of the two options would be more effective for this task? Would the 3090 setup be too limiting for large models or increase workflow complexity? Or would its price effectiveness alone be enough to beat the A6000s?\n\nThanks for your input.", "link": "https://www.reddit.com/r/datascience/comments/psm40a/choosing_a_setup_gpu_count_vs_pergpu_memory/"}, {"autor": "Vinothd19", "date": "2021-10-21 15:21:09", "content": "A/B Testing for improving a UX feature with the help of using -----> ML !!!  /!/ Hi ,\nI got a university project , where we have to improve a feature to help users take better photos with the -----> camera !!! .\nThe data we received has user id and timestamp of first opening of app and the time users uses the -----> camera !!!  to take photos. The Camera usage is recorded  in various steps with timestamp .\n1.Opens -----> camera !!! \n2.Takes photo\n3.photo detected\n4.Photo blur\n5.photo retake.\n6.photo accepted.\nAnd some other columns like device name and location.\n\nSo we have to do power analysis for this and also need to do A/B Testing. \nDon't know where to start.\nA little help would be great.", "link": "https://www.reddit.com/r/datascience/comments/qcu75o/ab_testing_for_improving_a_ux_feature_with_the/"}], "name": "Subreddit_datascience_01_01_2021-01_11_2021"}