{"interestingcomments": [{"autor": "izumi3682", "date": "2021-01-30 11:40:16", "content": "An -----> AI !!!  saw a cropped -----> photo !!!  of AOC. It autocompleted her wearing a bikini. Image-generation algorithms are regurgitating the same sexist, racist ideas that exist on the internet.", "link": "https://www.reddit.com/r/Futurology/comments/l8jyl5/an_ai_saw_a_cropped_photo_of_aoc_it_autocompleted/"}, {"autor": "respected_mercenary", "date": "2021-05-28 23:35:59", "content": "Deepfake/-----> AI !!!  will disrupte the Film Industry /!/ So I've been thinking alot about ai/deepfakes/gaming/music/-----> film !!!  industries in the future and there's some things I wanted to share about how different it will be.\n\n1. No physical set, sets are created and animated in 3d. See Unity/Unreal engine for example to see how realistic these spaces are \\*currently\\*\n2. You can even sell these sets as NFTs to some die-hard fans if the -----> film !!!  is successful or if it becomes a cult-classic even. \n3. If you're an artist you can create and sell sets as well.\n4. Oh the music industry will love this. You can just buy ownership of a set, put it in your video and them resell it to a die-hard fan. Wait your fans can pay to input themselves (deepfakes) in the music video, they can also 'be' the singer too lol.\n5. No production assistants. You would probably have more animators to design everything.\n6. No need to hire actors. Maybe body doubles but you have the choice.\n7. Ordinary people can sell their faces to be used in -----> film !!!  etc. for a fixed price/commission or a token.\n8. This means if someone likes your -----> film !!! , they can pay to watch themselves and their friends be in it too! Imagine Scott Pilgrim but it's funnier because you are laughing at/with your friends/family. Oh your little brother loves Spiderman? You can pay to watch \\*him\\* to actually be Spiderman in the -----> film !!! . Oh yes, this is can be bad for people with body-dysmorphia though. This downsides of deepfakes we are all aware of too.\n9. Using celeb faces in your -----> film !!! s allows you to reach more audiences ofc. But not just actor celebs, you can 'buy' social media stars' faces to gain more traction. Like KSI vs Logan Paul or whoever in your cowboy vs aliens movie. It doesn't even have to be a good -----> film !!!  tbh I think lol.\n10. When enough laws are set up surrounding this, people can sue you for using their faces without their permissions.\n11. Oh no need for new anchors either. You can literally program your propaganda.\n\nSorry for the long text, I had to share this bc I needed to get this out of my head lol", "link": "https://www.reddit.com/r/Futurology/comments/nnan46/deepfakeai_will_disrupte_the_film_industry/"}, {"autor": "ComprehensiveWater3", "date": "2021-03-15 19:04:57", "content": "Sophia The Robot — an Amazing Humanoid or a PR Stunt? /!/ Sophia the robot has been displayed as an influential symbol. The mechatronics robot has secured its way beyond the late-night attention, glorified across the cover of magazines, headlined primary tech leagues, and also addressed United Nations. Sophia has been praised as the eventuality of -----> AI !!! , but it may be more of a social manifestation masquerading as a PR stunt.\n\n### The Mind Behind Sophia The Robot\n\nTo know Sophia, it’s essential to know its inventor, David Hanson. He’s the originator and CEO of Hanson Robotics, but he hasn’t perpetually been on top in the -----> AI !!!  field.\n\nHanson has done BFA in -----> film !!! . He served Walt Disney as an “Imagineer,” forging models and robotic technologies for theme squares and then receiving his Ph.D. in aesthetic education. In 2005, he publishes a research article that set-up his concept and the assumptions for the prospect of robotics.\n\n“Upending the Uncanny Valley” is an eight-page article. It’s Hanson’s criticism of the Uncanny Valley hypothesis that humans won’t prefer humanoids if they look pretty close to, but not precisely like individuals. In particular, the article states “uncanny” robots can help address the question of “what is human” and that there’s not much to squander by exploring humanoid bots.\n\nAccording to Hanson, his organization is examining the “uncanny perspicacity outcomes both scientifically and artistically, using robots like Sophia.” Additionally, Hanson developed Sophia with the mentality that she is -----> AI !!!  “in its infancy.” He wanted Sophia to be raised as artificial general intelligence or AGI. For him, it’s the formula for safe superintelligence.", "link": "https://www.reddit.com/r/Futurology/comments/m5s6ob/sophia_the_robot_an_amazing_humanoid_or_a_pr_stunt/"}, {"autor": "SensibleInterlocutor", "date": "2021-08-07 17:13:59", "content": "Is there an -----> AI !!!  yet that can make a -----> film !!!  adaptation of any book? I have a hard time learning from books. /!/ How can I use it?", "link": "https://www.reddit.com/r/Futurology/comments/ozx8zi/is_there_an_ai_yet_that_can_make_a_film/"}, {"autor": "speckz", "date": "2021-04-14 12:46:51", "content": "Detroit man sues police for wrongfully arresting him based on facial recognition - -----> AI !!!  bias and a bad source -----> photo !!!  resulted in a false accusation", "link": "https://www.reddit.com/r/Futurology/comments/mqptlg/detroit_man_sues_police_for_wrongfully_arresting/"}, {"autor": "QuantumThinkology", "date": "2021-09-12 22:30:32", "content": "Researchers proposed a roadside system to automate the detection of illegal mobile phone usage among drivers, using classic -----> photo !!! -optical filters and infra-red capture. -----> AI !!!  system has demonstrated an accuracy rate of up to 95.81%", "link": "https://www.reddit.com/r/Futurology/comments/pn2nzn/researchers_proposed_a_roadside_system_to/"}, {"autor": "danpwhalen", "date": "2021-05-18 20:15:49", "content": "explaining FLIR1, Go Fast, and GIMBAL as -----> computer vision !!!  errors? /!/ ok, so I'm not offering this as an explanation, I am *LITERALLY* just asking if anyone can point me to something that has **already** looked at this as an explanation, so I can get some of my own questions answered.  \n\nwhen I first saw FLIR1, Go Fast, and GIMBAL videos, the first thing that popped in my mind was \"*-----> computer vision !!!  error?*\"  Not 'weather balloon' or 'Russian drones'.  Probably because I write and run computer code for a living, and like how-if-the-only-tool-you-got-is-a-hammer-everything-looks-like-a-nail.  But what sometimes, a thing is a nail.  So AGAIN, this is me just asking \"has anyone checked if this is a nail, and if so what did they find out?\"  \n\nHere's my question:\n\nThose videos are all in black and white, all with some kind of data readout streaming along the sides/margin.  The videos all show those cool Star Wars 'target lock' overlay sights flying around on them.    \n\nSo they aren't just footage from a -----> camera !!!  like how your phone has a -----> camera !!! .  *On their face*, those videos are obviously coming off of something more like input system of a self-driving car.  \n\nThe fighter jets are obviously covered in a bunch of sensors and gps and thermometers and radar and sonar and infrared and altimeters and multiple -----> camera !!! s and I'm sure a bunch of doodads none of us have ever heard of.  All those instruments are taking in readings as fast as they can, funneling all the data to a computer on the jet, and some program is automatically compositing it all in real time, and outputing that video to a display somewhere in the (human's) aircraft.  \n\nSo if you're listing a bunch of \"rational explanations\" for what you see in FLIR, Go Fast, and GIMBAL, 'weird drones' and 'mirages' are **not** the simplest explanations to me.  I would have thought the simplest explanation is that FLIR, Go Fast, and GIMBAL are just weird outputs of bugs in that sensing system.    \n\nSure, maybe a animal or a drone or a bizarre refraction of light or whatever sets off a chain reaction of errors (the pilots usually all say they actually saw something too with their own eyes).  But even if NOTHING happened outside of the aircraft, I don't think it violates the laws of physics to say the code or computer system or instruments might have some sorta issues to the point that the 'video' that your looking at (which I'm arguing isn't really a 'video' per se, its a readout of a ton of real time data collection efforts, some of which is pictures) is just a garbled bad output, and we're just Apopheniaing it as a flying object, right?\n\n I'm talking about an error in the vein of: self-driving cars that try to drive off a bridge cuz they can't see the shoulder of the road, self-driving cars that freak out when there's snow falling, Google DeepMind trippy art, automated stock pickers that accidentally tank a stock, -----> computer vision !!!  AIs that can be made to think a polar bear is a washing machine cuz of one altered pixel, recommender algorithms accidentally radicalizing your Dad, confusing nonsensical convos you can have with Siri, false positive facial recognition...well, you can google 'weird AI glitch/bug/failure stories', there buttloads.  \n\nBut in the UAP vids case, we got a bleeding edge, wild, complicated web of interconnected instruments, all getting routed through a centralized computer program that's trying to process and stitch together some kind of meaning, all at an insane speed.  \n\nAnd I'm *sure* it was designed by leaders in the field with top quality tech, yadda yadda yadda, but look - **infallible systems are science-fiction**.  I'm sure these compositing systems 'usually work', but that's not the same as saying they 'LITERALLY NEVER FAIL'.  Can it be that just sometimes they fail, very rarely but sometimes, and FLIR/Go Fast/GIMBAL are just example outputs of those massive goof ups?    \n\nI ask because \"completely regular shape moving in an exact straight line and then disappearing\" has got a *'infinite loop death spiral'* flavor to it.  I have actually accidentally written computer programs that loop forever doing the exact same thing over and over.  And \"pilot had to make a few tries in order to get a lock on it\" has a 'programs' error catcher worked the first few times we tried to induce an error' flavor to it. \n\nFOR THE THIRD TIME: *I have zero qualifications to have an opinion on whether this actually is the case, I have no expertise, I have no idea what I'm talking about, and am not offering this as 'an explanation'.*  I am LITERALLY on the hunt for someone who does know what they are talking about, does have expertise, and has some nonbullshit qualifications to tell me stuff about my above questions.  Help me out?", "link": "https://www.reddit.com/r/Futurology/comments/nfkzo5/explaining_flir1_go_fast_and_gimbal_as_computer/"}, {"autor": "samxls", "date": "2021-06-24 21:07:20", "content": "I was thinking about other areas -----> AI !!!  could infiltrate and... hopefully help in our lives, and I had the idea for this dark comedy -----> film !!!  about a hypercritical smart-fridge who fat shames her owner after catching him eating ice-cream...", "link": "https://www.reddit.com/r/Futurology/comments/o7a177/i_was_thinking_about_other_areas_ai_could/"}, {"autor": "Ideas_Sleep", "date": "2021-08-01 18:29:48", "content": "-----> AI !!!  can now detect political ideology with a single -----> photo !!!  of your face", "link": "https://www.reddit.com/r/Futurology/comments/ovxhow/ai_can_now_detect_political_ideology_with_a/"}, {"autor": "Riiiiiiiiiiicks", "date": "2021-06-24 02:10:38", "content": "A future vision of a matrix style existence without -----> AI !!!  /!/ Some people can accept simulation theory and since Shamanism allowed Shamans to astral travel and NASA cannot, inner space may be the next frontier but in this vision of the future we will assume we live in the matrix and have purchased a colonization package, for our own simulator which we will say is like a flying saucer but all computer and we will be consciousness cams by then that attach to Smith bodies and are physically immortal able to change bodies in a transporter. \n\nSo a far future vision of people who live in the matrix under more favorable circumstances since they are users and owners and run software themselves.\n\nSo an airship in a hangar that is attached to the ceiling and projectors in the balloon area project -----> film !!!  onto the inner surface of the hangar so that the scenery moves and looks real since the imagery is mapped onto a curved white surface. And that is in a hollow moon with a titanium hull and just there on some tarmac. Keeping in mind that computers can create engineering objects like that.\n\nAny hi res -----> film !!!  can be used. Then the airship is used for command and control of your new galaxy which you obtained and have rerouted from the galactic console to your airship so that you will not be using -----> AI !!! , but rather automated systems like reset.\n\nSo environmental reset twice a week, no dishes to do and the beds are made and no cleaning or grass to cut not even at golf clubs or parks.\n\nYou enter and exit through the transporter which is a stargate door and the pc in the airship has door positioning software and all that does is connect coordinates since this is a digital simulator and the galaxy is being used for RAM and disk space and a universal block of spacetime is created so you can copy and paste your planets and moonships onto the grid and connect stargate doors merely by connecting coordinates in a universal coordinate system.\n\nSo the transporter works on handprint and iris scan where needed and single entry and the doors are addressed. Along with this the transporter has a cupboard like a kitchen cupboard and that connects to the library of cupboards and in any kitchen on the system, once you make an entry into the library there normally since you just got back from shopping through there so you enter the goods into the library and then using your Iphone or any device like that you merely select the item and the kitchen cupboard you want it to appear in and it is copied and pasted from a paused storage world.\n\nAll of this type of technology is made possible not by writing a great deal of matrix code but by taking advantage of the fact that computers get backed up and can restore. They can be partially backed up and partially restored. That is copy and paste. Reset is also restore.\n\nFor the humans the brain object is identified in the code and memories are not stored in the body so the body can be reset at any time and people can stay young and healthy forever, and the equipment resets so it stays new forever, and only the virtual machine itself, the simulator with its 2 billion year power contract, will cause it to stop and that can be renewed for another billion. Always there would be a contract because to be immortal forever and never be allowed to die would not be right either.\n\nSo along with this wonderful system backups of the earth are made stargates placed on them when it is restored onto a blank planet and you enter with a suitcase full of money and so that is your form of entertainment and yes Groundhog week day year alternate history and so many other games would be possible preventing your boredom and removing the need for you to have a large empire that you need to babysit and that would maybe try to overthrow you and your airship.\n\nAlthough it doesn't matter who turns you into a battery we worry about the -----> AI !!!  more than Dr. Evil.", "link": "https://www.reddit.com/r/Futurology/comments/o6rd8x/a_future_vision_of_a_matrix_style_existence/"}, {"autor": "Sabrine_Crystal_1992", "date": "2021-01-18 18:13:02", "content": "How would Artifitial intelligence perceive time? /!/ I read articles saying that small animals like insects perceive time much slower than big animals like lions, elephants and humans. So insects see the world functioning as a slow motion -----> camera !!! . This compensates their low lifespan and make them avoid dangers and flee from predators. Children also perceive time slower than adults because their brains work faster and have less aging damage than a adult.\n\nSince -----> AI !!!  software would run on teraherts and maybe even petahertz and faster how would they perceive time? Or they could not perceive time at all like weak -----> AI !!! s? Since weak -----> AI !!!  would not have self awareness they would not perceive time at all.\n\nI think materials could be created for the artifitial brain be very smart(smarter than a genious person) but at the same time the machine or robot could have the same perception of time as the average human.", "link": "https://www.reddit.com/r/Futurology/comments/l00596/how_would_artifitial_intelligence_perceive_time/"}], "name": "Subreddit_Futurology_01_01_2021-01_11_2021"}