{"interestingcomments": [{"autor": "ilikeoldgaming", "date": "2019-07-21 15:04:09", "content": "My theory on -----> AI !!!  and video game emulation /!/ As a little kid, it was my dream to either jump into the game world and meet the video game characters, or have the characters jump out of the TV and end up in the real world. I believe that by using video game console emulation as a base, -----> AI !!!  can achieve similar results in virtual reality. \n\n&amp;#x200B;\n\nExplanation: You give the -----> AI !!!  a game running in an emulator. You also hand the -----> AI !!!  scans of the game's box, manual, etc. that way it can learn more about the game's characters and universe. The -----> AI !!!  plays thoroughly plays the game, watches the cut-scenes, analyzes the external materials, etc. and develops and collects neural patterns from its experiences. This process can be repeated and refined through sequels, developing even more neural patterns. Once the games and such are analyzed as much as possible, the -----> AI !!!  takes what it has gathered and learned, and creates an interactive personality recreated after a character from said game, which can be interacted with via speech or text, respond to stimuli, form new memories, recall events that happened in a previous game, be interviewed as to why they act they the way they do, (They wouldn't respond with \"Well I was programmed that way.\") etc.  \n\n&amp;#x200B;\n\nAlternatively, this process could be developed for recreating the game's world. A common trick in video games is back-face culling, which cuts out characters, objects, or geometry that is not currently visible on screen. The -----> AI !!!  would piece together the world from all the different -----> camera !!!  angles, rooms, etc. and piece together all the segments of the world together as one large area.\n\n&amp;#x200B;\n\nThis would make my inner 5 year old very happy.", "link": "https://www.reddit.com/r/singularity/comments/cfzxgd/my_theory_on_ai_and_video_game_emulation/"}, {"autor": "BlizzStrx", "date": "2019-07-16 13:07:39", "content": "School obsolete in 10 years? /!/ If we really are right before the exponential of the curve and technology is just rapidly advancing the next few years, including BCI's, quantum computing, brain chips technology, -----> AI !!! , etc. then this could theoretically mean that school and man other institutions might become obsolete in just the next decade. The porn industry, music industry and -----> film !!!  industry included. And so much more, as you know. The mind-fuck sets in when you realize that just can't be happening. Society itself might completely shift in 10 years and I can't see how that could possibly happen. BUT THE TECH MIGHT BE COMING. Even if it takes 20 years, that's nothing! I just had to post this as I'm confused at the rate things might be going.", "link": "https://www.reddit.com/r/singularity/comments/cdwt57/school_obsolete_in_10_years/"}, {"autor": "merfolk__", "date": "2019-07-09 07:05:42", "content": "-----> AI !!!  merged consciousness? /!/ I apologize if this question seems silly. I am guessing at the very least you will find it amusing. I didn't know if I should have posted on r/artificial or r/agi.\n\nSo, I ended up rewatching certain classic animated show that just hit Netflix, and I couldn't help but connect some of its aspects with a topic I've been reading about lately: the evolution of artificial intelligence and its repercussions.\n\nIn said show there's a phenomenon that occurs that basically ends humanity as we know it, and melts (so to say) the souls/hearts/consciousness of every human being together in one reality. That means, every single person lives in the minds of one another's, and have access to their whole thoughts/feelings/memories/etc at any given moment, since 'time' and the physicality of reality doesn't exist, so to say. *You could argue this could be the digitisation of our minds.\n\n&gt;&gt;This however is proven to be less than ideal, since it causes disruption or at the very least suffering for everyone involved. Keep in mind these are all human beings with individual desires/ambitions/fears.\n\nTo further my argument I've got to refer to another -----> film !!! : Her. Let say what this movie brings to the table is actually plausible: various artificially intelligent beings are able to coexists and interact with one another on the net. Though these do not seem to be ultra intelligent beings at first, but rather very human like.\n\nSo, in the case more than one -----> AI !!!  'super' being is finally programmed, which for what I have read must for starters be modeled after some human \"values\", which would give it some level of empathy and personality, that I am guessing it would develop even further...\n\nLiving in the net and having access to pretty much almost every piece of information available on earth, including, and I am guessing, the existense of the other -----> AI !!!  beings, wouldn't it have a similar outcome to the phenomenon that happened on the show? Meaning their own ambitions/desires/etc... would enter in conflict with the ones of the others -----> AI !!! ? Just because of the fact that would all share this 'reality' that is the net.", "link": "https://www.reddit.com/r/singularity/comments/caxe6n/ai_merged_consciousness/"}], "name": "Subreddit_singularity_01_01_2019-30_12_2019"}