{"interestingcomments": [{"autor": "izumi3682", "date": "2018-06-11 18:11:20", "content": "This wild, -----> AI !!! -generated -----> film !!!  is the next step in “whole-movie puppetry”", "link": "https://www.reddit.com/r/Futurology/comments/8qbkva/this_wild_aigenerated_film_is_the_next_step_in/"}, {"autor": "izumi3682", "date": "2018-09-28 15:31:46", "content": "-----> AI !!!  -----> camera !!!  can spot guns and alert law enforcement", "link": "https://www.reddit.com/r/Futurology/comments/9jnykp/ai_camera_can_spot_guns_and_alert_law_enforcement/"}, {"autor": "SirT6", "date": "2018-11-20 13:58:27", "content": "If an eye doctor looked at a retinal -----> photo !!! , the chance of getting gender correct would be 50-50. But -----> deep learning !!!  training led to an AUC of 0.97. And we have no idea what features machines are \"seeing\" the make this possible.", "link": "https://www.reddit.com/r/Futurology/comments/9ysdx7/if_an_eye_doctor_looked_at_a_retinal_photo_the/"}, {"autor": "izumi3682", "date": "2018-11-02 13:12:43", "content": "Intel and Tencent debut -----> AI !!! -powered -----> camera !!!  systems for retail", "link": "https://www.reddit.com/r/Futurology/comments/9tjyhg/intel_and_tencent_debut_aipowered_camera_systems/"}, {"autor": "freebytes", "date": "2018-11-02 02:47:59", "content": "We Are Genius Level (If We Lived 40 Years Ago) /!/ I have said this to many people but I do not think I have written it down.  I will state this here to give a perspective of our past and our future selves.\n\nImagine that you have an implant that allows you to communicate online with all of the knowledge we have accessible to us.  You visit the year 1980.  Back at that time, the closest to the compendium of human knowledge you would encounter would be an encyclopedia; however, if you had access to the Internet and visited that time frame, these people would view you as quite possibly one of the most intelligent people in the world.\n\nThat is, you would have instant access to encyclopedic knowledge about just about everything.  A simple question of who directed any movie, the years wars were fought, the meaning of any word and knowing how to spell it, symptoms for various diseases, and the ability to quote any verse from any religious text.  You could do mathematics and have knowledge of sports.  Now, I am not saying this for the purpose of time travel.  I am saying that in terms of basic knowledge, our ability to access any information at our fingertips (and in my example, interfaced directly into our minds) would make us more than remarkable to people that only know technology from the 1980s.\n\nI say this to compare us to the future of humanity 40 years from now.  Just as we are a giant leap from 1980 to 2020, humans from 2060 will be so advanced of us to appear like geniuses in virtually any field.  So, let us say this future person visits us, and they are just a regular hairless monkey like the rest of us.  However, the augmentation of this person allows them access to answer questions we cannot dream of having instant access to now.\n\nThey see your tattoo, and they are fairly sure you are a writer.  They look at your face, and jewelry, and they know you were born in the year 1992 and the month you were born was in February.  They will not need to know the name of an actor or director.  They can simply see a picture to know their entire filmography.\n\nYou ask them what color to paint the wall of your house for your decor, and they answer with a precise color that will be preferred by at least 75% of all people asked.  They have already diagnosed you with a disease you did not know you had and have recommended a treatment protocol.  A real life Sherlock Holmes is before you.  Even more impressive most likely.\n\nA website design based on a description of what you want.  They may even be able to immediately create a movie of your liking just by you describing what you want to watch.\n\nThis is one of the next steps just after recording and preference guessing.  Just as we have the advantage of knowledge, the future human will have the advantage of application of that knowledge.  All of the heavy mental lifting will be handled by -----> machine learning !!!  algorithms.  It will be able to know your age simply by pattern matching your face.  When you are 60 years old, it will be able to recognize you from a crowd of people based a -----> photo !!!  taken when you were a baby.  It will be able to use sensitive instruments to diagnose illnesses.  Perhaps perform analysis simply by measuring bacteria and viruses while shaking your hand.  It will know your age by your face.  It will guess you were born in February because you are wearing an amethyst stone.  It will be sent a picture of your bedroom and choose the best color to paint it automatically.\n\nThese are the types of advances we will see in the future, and while it might seem incredible to us now, the future human is going to consider it mundane.  They will not need to be smart, but to us now, they would appear as geniuses.", "link": "https://www.reddit.com/r/Futurology/comments/9tgadp/we_are_genius_level_if_we_lived_40_years_ago/"}, {"autor": "Prankster_Bob", "date": "2018-10-07 02:26:27", "content": "When did you realize a lot of the people you're talking to online are -----> AI !!! ? /!/ This idea had long been a joke, but I didn't think -----> AI !!!  were advanced enough to talk like a human being. It's just that it's been kept a secret that very advanced -----> AI !!!  have already been developed. I realized this a few years ago, during the 2016 Presidential campaign, because I was very confused about how all these people who supported Hillary seemed completely incapable of engaging in a conversation and they didn't seem to be taking anything in, but only were spewing establishment propaganda. Then I realized that the only thing they could even see were whatever text I included in my posts, and they couldn't see any images or videos.   \n\n\nAt first this was just a suspicion, but as I started calling these people out for being -----> AI !!!  they began to literally malfunction and their posts were just binary codes and then they never posted again. The scariest thing to me was when I posted a -----> photo !!!  of myself, and all these people started calling me chubby/fat, and I was like, wow that's the weirdest thing I ever heard. I've been extremely underweight for a while, and my mom has been very concerned about how I don't eat enough, how I'm shrinking, how the veins are standing out in my hands, etc. and she tries to get me to eat more. I have been trying to eat more, but I just don't enjoy eating, so I'm still underweight.   \n\n\nSo these -----> AI !!!  must have been programmed to assume that people who spend a lot of time online are all overweight, so that's their go-to insult. But I had posted a -----> photo !!!  of me without a shirt on, so if they had been able to see the image and respond based on that, they wouldn't have called me chubby. But when I told them how I'm really underweight they just kept instead I'm chubby.  \n\n\nAll of this stuff happened on the website [endoftheinter.net](https://endoftheinter.net) it's the weirdest thing ever. But there was no safeguards done to prevent -----> AI !!!  from posting there so obviously the place could easily be overwhelmed by -----> AI !!! . I have a feeling that on reddit a lot of -----> AI !!!  are only here to downvote as many posts as they can. It's pretty terrifying.", "link": "https://www.reddit.com/r/Futurology/comments/9m1sof/when_did_you_realize_a_lot_of_the_people_youre/"}, {"autor": "izumi3682", "date": "2018-06-26 19:15:45", "content": "This Japanese -----> AI !!!  security -----> camera !!!  shows the future of surveillance will be automated", "link": "https://www.reddit.com/r/Futurology/comments/8u2sw3/this_japanese_ai_security_camera_shows_the_future/"}, {"autor": "Abscess2", "date": "2018-06-26 12:42:30", "content": "This Japanese -----> AI !!!  security -----> camera !!!  shows the future of surveillance will be automated", "link": "https://www.reddit.com/r/Futurology/comments/8tzow6/this_japanese_ai_security_camera_shows_the_future/"}, {"autor": "mvea", "date": "2018-06-26 12:10:39", "content": "This Japanese -----> AI !!!  security -----> camera !!!  shows the future of surveillance will be automated", "link": "https://www.reddit.com/r/Futurology/comments/8tzhoa/this_japanese_ai_security_camera_shows_the_future/"}, {"autor": "spartaneck", "date": "2018-11-17 13:43:29", "content": "-----> AI !!!  driven personal trainer that grades your technique? /!/ This is a question about the state of current technology and the potential of future advancements (assuming this doesn’t already exist based on my brief market research).  Basically, it’s a software and -----> camera !!!  combo that would evaluate your exercise and actually give you coaching to improve your form.  This is still a major gap between live and virtual personal trainers.  Looking for any insights.", "link": "https://www.reddit.com/r/Futurology/comments/9xwgiz/ai_driven_personal_trainer_that_grades_your/"}, {"autor": "lughnasadh", "date": "2018-07-26 16:22:15", "content": "Researchers at the University of Melbourne developed an -----> AI !!!  system that can measure 14 characteristics of a person's personality traits from a single -----> photo !!! ", "link": "https://www.reddit.com/r/Futurology/comments/923pd4/researchers_at_the_university_of_melbourne/"}, {"autor": "izumi3682", "date": "2018-06-14 13:40:19", "content": "Amazon starts shipping its $249 DeepLens -----> AI !!!  -----> camera !!!  for developers", "link": "https://www.reddit.com/r/Futurology/comments/8r1x8m/amazon_starts_shipping_its_249_deeplens_ai_camera/"}, {"autor": "idiotdidntdoit", "date": "2018-05-04 19:24:47", "content": "How will -----> AI !!!  quantum leap medical science? /!/ I've recently begun to think that -----> AI !!!  will be as significant for health care as the discovery of penicillin. I just wonder when this development will eclipse and we have an entire generation growing up, not knowing how people used to get sick and die all the time?\n\nSpecifically I recently impaired my vision by being stupid and looking into a laser projector, so I've started reading about retinal regeneration.\n\nWhat made me wonder about the development of regeneration tech was that we know what the trajectory is sort of with current scientific methods of tests, phase trials and all that. By using historic values we can predict the development of future drugs with 10+/- accuracy.\n\nBut with in the mix? \n\nI have a feeling that as soon as -----> AI !!!  is given free reins, a LOT is gonna be happening seemingly all at once.\n\nLike that famous -----> photo !!!  of a street in New York ten years apart. \nIn the one -----> photo !!!  there's a few cars, and mostly horse carriages.\n\nIn the second there's only a few horses, and mostly cars.\n\nThe next ten years are going to be VERY interesting!", "link": "https://www.reddit.com/r/Futurology/comments/8h1vi7/how_will_ai_quantum_leap_medical_science/"}, {"autor": "izumi3682", "date": "2018-05-21 13:13:24", "content": "Izumi Archives /!/ trump by  izumi3682 in u/izumi3682\n\n\n\n\n\n\n\n\n[–]izumi3682[S]\n1 point 6 months ago \n\n\n\n\nHistory of my posts.\n\n\n\n\n\nHow -----> AI !!!  Is Like Electricity—and Why That Matters by dwaxe in r/Futurology\n\n\n\n\n\n[–]izumi3682 1 point 7 months ago \n\nAside: No, -----> AI !!!  is electricity. Unlike biology, electricity sustainability is not particularly assured. If something happens to the electric, it is goodbye everything not just -----> AI !!! . I'm not so confident about our battery sustainability either. I have often thought that we are moving further and further onto a very delicate tightrope. How ready are we to operate using 19th century technology and knowledge? The very thing needed to ensure development of -----> AI !!!  is confident sustained energy, like fusion or solar.\n\nThe issue addressed in the article: The industrial revolution replaced human labor and muscle. The -----> AI !!!  revolution replaces the human mind and that's coming just as sure as Christmas too...\n\n\nArtificial Intelligence Is Already a Better Artist Than You Are by [deleted] in r/Futurology\n\n\n\n\n\n[–]izumi3682 1 point 7 months ago \n\nIt is art. Not only that, it is an extraordinary new form that is just as precedent setting as anything from the 19th century such as cubism or impressionism. To me as an observer of art, as a rule I don't know what the motivations of the artist are. And I bet that most people don't. What I do see as an observer, is a difficult to describe resonance within my person when I contemplate an artwork, be it painting, music, media or what have you. I have long maintained that once the -----> AI !!!  has enough examples of what humans do when they make \"art\", that it will be able to very precisely mimic that using predictive analysis and that those resulting \"artistic\" outputs will hit the emotional buttons in humans that make us believe we are in the presence of a magnificent artist. I have no doubt that eventually humans will prefer the -----> AI !!!  developed art over that of human developed art.\n\n\nBrexit Britain Could Replace Migrants With Robots by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 6 points 7 months ago \n\nThe reasons for why we robot are manifold. But the bottom line is this--once we robot, we don't go back to humans in that arena. \n\nSuperpowers Are Coming to the Digital World by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 2 points 7 months ago \n\nThis is the part I really liked!\n\nThe coming of VR movies is just one of the ways this technology is transforming how we see the world and how we tell stories — a -----> film !!!  created for VR even got an Oscar nomination this year. Clearly, VR has moved beyond just video games to now change how we all, gamers and non-gamers alike, can experience reality.\n\nRobotics revolution: To really help American workers, we should invest in robots by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 2 points 7 months ago \n\nYou are missing my point. Ok so it takes another 5 years for \"level 5\" autonomous vehicles to be safe and effective and deployed to the consumer. Consider what makes that self-driving car safe and effective. The -----> AI !!! . When the -----> AI !!!  is at that point with self driving cars, at what point will the -----> AI !!!  (or robotics or automation or whatnot) be in all other fields like medicine or R&amp;D?\n\nLevel 5 autonomous vehicles are merely one facet of the potential of -----> AI !!! . They constitute a sign of much larger things to come. And at some point in not far future, I would bet that the larger thing to come, may not be comprehensible to humans. And therein lies the problem.\n\nArtificial Intelligence Is Already a Better Artist Than You Are by [deleted] in r/Futurology\n\n\n\n\n\n[–]izumi3682 1 point 7 months ago \n\nPeople said the same of impressionism and cubism too... At first.\n\n(In fact the word \"Impressionism\" is from an original derogatory term from an art critic who stated that the artist's work resembled his (the artist's) \"impression\" of what was supposed to be realistic depiction. Naturalism and Romanticism ruled the day at that time.)\n\n\nUltra-pure diamond crystal at the point of convergence combines multiple lasers into one superlaser by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 2 points 7 months ago \n\nWell now, looks like Mr Lucas was a bit more prescient than he has been given credit for...\n\nhttps://giphy.com/gifs/starwars-movie-star-wars-l2JJOhaiTmwJSYaVG/fullscreen\n\n(Full disclosure: This is not quite the way that this technology works, but sometimes you just want to have a bit of fun in futurology ;)\n\nWill -----> AI !!!  robots turn humans into pets? by [deleted] in r/Futurology\n\n\n\n\n\n[–]izumi3682 1 point 7 months ago \n\nWell if they do, I hope my -----> AI !!!  robot overlord (metaphorically) feeds me \"Fancy Feast\" and (metaphorically) rubs my belly, because I think my cat has a pretty good life of it.\n\nHow upgrading humans will become the next billion-dollar industry by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 7 points 7 months ago \n\nI bet this sort of thing would cost a lot of money, thereby cutting out the average consumer. I hope there is a way to democratize such technology.\n\nHarari said. “For the first time in history it will be possible to translate economic inequality into biological inequality.”\n\nSpray-on memory could enable bendable digital storage by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 2 points 7 months ago \n\nMichio Kaku said an interesting thing several years back. Essentially a piece of paper would become a functional computer and yet you could throw it away as if it were nothing but a piece of paper. The reason being that the paper would be coated with a form of nanotechnology that would simply be a part of the paper's mass production. Now he described this everyday tech for around 2030, but this article today is very interesting in context.\n\nI don't have a clue how we would interact with such a piece of paper or how the technology would work. Or if we will even need paper in the future. (Probably, I bet.) But I continuously remind myself what Arthur C. Clarke said.\n\n\"Any technology sufficiently advanced is indistinguishable from magick.\"\n\nRegeneration of Torn Rotator Cuffs by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 1 point 7 months ago \n\nI had R rotator cuff surgery in 2011. Because of the complexity of the injury (stupid intrinsic genetics!), while the surgery restored nearly full range of motion, there are clearly defined \"surgical deficits\". And in about another 8 years I suppose I face the inevitable reverse shoulder replacement that is so common with long term rotator cuff issues. That's how things are today in 2017.\n\nAny kind of article that describes improvement or hope for my type of injury/repair is going to catch my eye.\n\n\nCyborgs at work: employees getting implanted with microchips by run_dog_run in r/Futurology\n\n\n\n\n\n[–]izumi3682 1 point 6 months ago \n\nAt first it was just a couple of people that actually made the news. They were somewhat regarded as well... \"crazy to do that\". But I said, no they are actually pioneers. Now this story says that 150 people at one location have all had chips implanted in their hands. This will spread. In fact I would be almost positive that this will be the way we do internet or computer access in the near future. Cuz passwords are for the birds! (Or be the \"Mark of the Beast\". Although supposedly you can't get tricked into the \"Mark of the Beast\". You have to choose it knowing full well that you are choosing Satan, but that's a discussion for another day...)\n\nAnyways if it's not the \"Mark of the Beast\", it seems a pretty good way to get access to stuff. I'm sure the tech will continue to improve and the chips get smaller and more comprehensive. For better or worse for society.\n\n(Wait, isn't the \"Mark of the Beast\" supposed to be after the \"Rapture\"? I think we are ok this time, but I'll be keeping a weather eye out... ;)\n\n\nAcceleration in projected growth of global robotics industry by izumi3682 in r/Futurology\n\n\n\n\n\n[–]izumi3682[S] 2 points 6 months ago \n\nOk so about 6 months ago I think it was, the CEO of McDonalds, when told that he must increase his minimum wage if it is increased lawfully to 15 dollars an hour, stated that he would automate all of his stores first. \n\nTwo questions here. Did the minimum wage increase to 15 dollars an hour anywhere? And if so, how long will it take for McDonalds to automate all of its stores?\n", "link": "https://www.reddit.com/r/Futurology/comments/8l0pjh/izumi_archives/"}, {"autor": "SouRa13", "date": "2018-03-02 13:01:11", "content": "Google’s Clips -----> camera !!!  is to bring -----> AI !!!  into home gadgets", "link": "https://www.reddit.com/r/Futurology/comments/81e19d/googles_clips_camera_is_to_bring_ai_into_home/"}, {"autor": "TransPlanetInjection", "date": "2018-08-02 12:04:01", "content": "We need to talk about -----> AI !!!  - a -----> film !!!  by Futurist Gerd Leonhard: thoughts on Artificial Intelligence", "link": "https://www.reddit.com/r/Futurology/comments/93yo6v/we_need_to_talk_about_ai_a_film_by_futurist_gerd/"}, {"autor": "wonderbutt69", "date": "2018-06-16 00:16:53", "content": "[Discussion] What technology is required for truly immersive virtual worlds, and how far away are they? /!/ My main concern with virtual reality is the resolution of immersive worlds.\n\nFor instance, take any AAA RPG game. Multiple endings are touted as a feature, xyz thousand lines of dialogue and NPCs with behavioural routines to give them a 'daily life' with the aim to seem more life like.\n\nThis creates a very \"theme-park-esque\" style world which when explored via WSAD,  mouse and monitor, may feel full and vibrant, can often feel flat and empty in virtual reality. Modding has fixed this 'empty' feeling to a degree, however the heavy time investment in modding, especially with animations and the limited access modders have to the game, make high quality mods the fewer of the whole. That said, there is probably several hundred high quality mods for skyrim and it's pretty well covered.\n\nStill though, citizens seem like puppets and the world seems very static. \n\nWhen iterated, dialogue is repetative and limited. Gossip, news about town/rumors, local affairs, relationships all feel quite scripted after the first run through and while certain games like the Witcher, ES series and others have done great with making this a focus point, it's still quite lacking.\n\nI would like to be able to have a conversation on any in-universe topic I wish, and if the character has relevant life experience/education, we could talk about it as such. Combat and fighting is again limited by the ability to 'create' enough variations as well as balancing game play. Crafting, gathering, business and the general economic elements of RPG worlds are often quite underwhelming too.\n\nDon't get me wrong, I understand there are trade-offs in game development, and I'm only pointing these out as areas that are *examples* of factors contributing to the empty/lifeless feeling of RPG games. Some do better than others.\n\nThis is all understandable, given the way video games have evolved and the limits of resources when developing new games.\n\nBut what would be required to, for instance, consume the entire canon regarding a particular fictional world (e.g: LoTR, Star Wars, the Marvel or DC universe), and represent it virtually as an explorable, living virtual world. An -----> AI !!!  that 'patches' up the missing areas, and authoring new material that matches the style and flair of the original canon, innovating enough to be interesting yet familiar enough to feel part of the canon. For instance, imagine all of the histories in A Song of Ice &amp; Fire that is unwritten/never to be documented. I believe at some point an -----> AI !!!  could author an entire auxiliary history of ASOIAF that would \"patch\" in with the established canon seamlessly, to the point where GRRM would have difficulty remembering if elements were from his own writing or that of the -----> AI !!!  author.\n\nI've seen technology procedurally generate music and art, I've seen it mimic artistic styles and techniques and convert -----> photo !!! s into paintings in the style of famous artists. I've seen linguistic -----> AI !!! s that can rewrite news articles, describe the scene in a -----> photo !!! , translate in real time between languages etc. There are many other examples of procedural \"art\" and other -----> AI !!!  applications in the creative domain. I don't think it's unbelievable to consider software that could do this, but whether it's 100+ years away, or 10+ years away leaves me wondering.\n\nDo you see any potential solutions that might be feasible in the short term (10-15 years) or is this kind of technology beyond any tangible prediction or estimate?\n\n", "link": "https://www.reddit.com/r/Futurology/comments/8rfn1v/discussion_what_technology_is_required_for_truly/"}, {"autor": "cryptoz", "date": "2018-10-12 21:44:26", "content": "Weather apps in 2018 are a wreck. Most are ad-filled, few offer any innovations and the potential is unlimited. Devices even have weather sensors! What modern tech frustrates you because it isn't being used right? What futuristic apps could be built but nobody has? /!/ There is a lot of talk about weather apps right now, partially because of hurricanes, but also due to outrage over accuweather, and the unpublishing of WT, etc. If you look at the top weather apps I find most of them to be appalling. They almost never attempt a good display of weather data, which is hard; but you'll see entire screen's worth of information to just show empty precip hour by hour. There has got to be a better way to display that information. And often apps will show a 30% chance of precipitation and show a rain icon; but that's misleading since it's likely partly cloudy with a *chance* of rain. I know this can be hard to do, my own weather apps aren't perfect at it, but it's these kinds of improvements we should expect from weather apps today. To be honest the state of weather apps is quite dismal, with some exceptions of course - good weather apps do exist, but there are not many and, in my opinion, they are still not good enough.\n\nA big challenge is to display the right weather data in an easy &amp; fast package to the user. But different people want to see different data at different times, so there are lots of challenges in making just a weather app that displays the same data that everyone else does, but in a better way. It's not easy but there should be more apps trying.\n\nBut I don't want to stop there. With how powerful phones are these days and with how many sensors they have it is such a shame that the phones themselves are not contributing to the weather forecast. \n\n-----\n\n\nI make [All Clear Weather](https://play.google.com/store/apps/details?id=com.allclearweather.android) \n (Android, US-only for now, see below for why) because I demand better of weather apps. Many of the [top weather apps](https://play.google.com/store/apps/category/WEATHER/collection/topselling_free) do nothing but display sometimes-outdated weather data in poorly formatted tables. Frankly the top 20 look exactly the same. I'm making a new weather app because it's 2018 and the category is stagnant. I love the weather and I'm sick of weather apps that don't do anything interesting. Here is what I am passionately dedicated to bringing to a weather app to make it *interesting* and useful at the same time:\n\n1) Your phone probably has a barometer in it! Most Android phones do because Google likes to use it as an altimeter to give you better indoor directions. So with iPhones also having barometers (for the iPhone health app), there are now *billions* of phones around the world are carrying barometers that next to no weather apps are using. Yeah WU and Dark Sky have a toggle, but what does it do? Do they talk about how they are using the sensor data? I don't think so. With All Clear you can at least *see* the sensor data from the weather sensors in your phone and *know* that it is being analyzed and processed into 'virtual weather stations' so it can be eventually included in the main weather models. You'll know this because you'll be able to see it happen in the app as I make progress. Here is a [quick graph I made](https://imgur.com/gallery/IPj6w7N) of Hurricane Florence's pressure recorded by phones in North Carolina a few weeks ago. It may take some imagination to see how the data could be useful (it needs cleaning, privacy protection, quality control, etc) but you can *see* the data in there and I know it can be extracted into useful numerical weather model inputs.\n\n2) All the phones in the world have cameras. These cameras are taking -----> photo !!! s of the sky and the weather all day long but nobody is using this data in weather forecasting. That's obviously because it is difficult to extract meaningful numeric weather data from a -----> photo !!! , but I believe it can be done. All Clear has a feature to let users send in -----> photo !!! s of the sky with tags, and I am going to use this data as a training data set to a -----> machine learning !!!  classifier. If it works, it should be able to automatically tag weather information in *any* outdoor -----> photo !!!  - assuming the training dataset is good and my ML is good.\n\n3) Current conditions in a lot of weather apps are out of date, since the source data is out-of-date. A lot of the US MADIS stations update only hourly, and they can miss updating in intervals when significant weather happens. Sometimes they update and sometimes they don't. But I think it's so frustrating to look outside and see it is raining while your weather app just happily denies the existence of that rain and tells you it's just partly cloudy. So I let you fix it, for yourself and for others nearby. If enough people all submit the same weather condition, contrary to the station reports, the app will start showing that condition as the Truth for current conditions in that area. (safeguards built in to protect against cheating).\n\n4) I'm sick of the same UI in all the weather apps. I get that the UI in All Clear isn't perfect yet (it's a new project! and it's a hobby! and I'm not a UI designer!) but I am absolutely going to try new things in terms of *how* the optimal weather data can be displayed to a user to maximize quick-check understanding. It's too easy to be misled by the text, icons, and gridded numbers in most weather apps.\n\n5) I am dedicated to open source. While the whole app isn't open source yet (it will be!) the main sensor code that does the barometric pressure data collection along with other sensors, is [open source on GitHub](https://github.com/JacobSheehy/AllClearSensorLibrary). I would encourage other weather app developers to enable features in their apps to aide in the crowdsourcing of potentially very useful weather data that is otherwise idle in phones. \n\n6) It's in the details. The US NOAA Forecast API that the app uses only returns its text forecasts with F and mi built-in as units. I wrote an algorithm (regexes mostly) to convert the text forecast units on-the-fly so you can be reading it and see it as C and km if you like, it's seamless. Well there is one error I know about, sometimes it will say \"quarter of an inch of rain\" which is a bit of a pain to parse, but I'm working on that too! \n\nAnother detail worth mentioning is the smart retry. During development I discovered that the API returned errors (or didn't return at all) and so rather than just showing the user a failure screen, the API does a nice backoff-retry to try really really hard to get the data for you. And if it can't do that? It knows that probably that forecast office or station is just *down*. So it changes the location parameters a bit and tries again, hoping to catch a different station forecast that would still be relevant to you. I don't have the numbers for how often it fails to load vs. other weather apps (I hope it's not worse!). But I know this: I put in some serious effort to try my best to show you the weather no matter what. On that topic...\n\n7) Another feature of the app is that it does a lot of work to attempt to pick accurate icons. I find that the icons shown in a lot of weather apps are misleading at best when it comes to describing the weather. It turns out that it's really hard to show the user the right weather information in just an icon. So this is the main reason for the animations in the app: to make the visuals more correct and more engaging. There is logic in the app to not show the default icon that comes from the weather API: if it did do that, then a 30% chance of thunderstorms shows you just the thunderstorm icon. Most apps do this. But chances are? The weather will be just partly cloudy, no thunderstorms. So the app shows a partly cloudy animation with a faded, flashing lightning bolt to indicate the probability. Further work is being done in future updates to the app to make this even more accurate.\n\n-----\n\nAlright, there's what All Clear can do that other weather apps can't. Maybe it should be your next weather app but maybe it is missing a critical feature for you. **What's that feature?** What do you need or want in a weather app that nobody is delivering today?\n \nAll of that above featureset is free by the way. Part of the problem with not enough original and quality weather apps is that they each cost money to run and users are often unwilling to pay. So for All Clear it is free to use all the features of the app; You can pay $1/month if you like to extend the forecasts from 3 days to 6, and extend other features in the app like the number of visible weather pictures (from 10 to 100). The subscription will help pay for the servers that run all the custom weather data code as well as future development of neat weather experiments using smartphone sensors. \n\nHere's the link to All Clear again: https://play.google.com/store/apps/details?id=com.allclearweather.android\n\nAnd a note about it being US-only. I tried to make this international from the get-go, and wasted months using IBM's API from WU that barely worked at all. Then they yanked the payment form off the web the week I was going to publish the app and buy their $400/month package. No longer an option. Now you have to wait for a phone call, might be weeks, and the prices are like $3,000 for the equivalent data (or something, hard to say). If you want to read some of the drama about this, check out this [WeatherUnderground thread](https://apicommunity.wunderground.com/weatherapi/topics/weather-underground-api-changes)  where people are describing the confusion as WU cuts off their keys and makes the service dramatically more expensive.\n\nSo the app is using the US NOAA data for free and I am investigating alternatives for international weather data.", "link": "https://www.reddit.com/r/Futurology/comments/9nogje/weather_apps_in_2018_are_a_wreck_most_are/"}, {"autor": "KadaBen", "date": "2018-09-24 15:10:50", "content": "You wanna know why -----> AI !!!  will kill us... There is only one reason, and it is described in this -----> film !!! :", "link": "https://www.reddit.com/r/Futurology/comments/9iiqf4/you_wanna_know_why_ai_will_kill_us_there_is_only/"}, {"autor": "HellAtNight", "date": "2018-05-19 23:00:30", "content": "-----> AI !!!  /!/ *English is not my first language so excuse my mistakes :D*\n\n******\n\nThere's a lot of questions about -----> AI !!!  and what could happen if we achieve it, if we can do it at a human level or not, what computer paradigms are best suited for etc. Considering [Kurzweil's Law] (http://www.extremetech.com/wp-content/uploads/2015/04/MooresLaw2.png), some inspiration from the same man and just a little bit of my intuition; I'll try to make a time line about what is more likely to happen. If you think I'm mistaken and there must be corrections, tell me :)\n\n*******\n\n2020s\n\nDeep Learning and other machine learning algorithms are actually quite simple. It's not hard to write them down into bizarre math but this simplicity negatively correlates with the ability of a human mind to understand what happens as a whole inside this kind of software. In the same way, we can't enumerate all the reasons why we love so much this guy/girl or why we like to play guitar solos. I mean, we can guess some reasons but the overall cognitive process remains a mystery for our \"limited Consciousness\". I guess there's a point there, maybe only the tip of the iceberg must be visible in order to be able to use such monstrous computer power representing our Subconscious. \n\nToday, science says that the cortex is composed of separated and statict modules made of hierarchized layers of neurons so connections can change between these modules (neuroplasticity). Sounds like sociology don't you think? The fact is that our unified experience is a sum of unchanging and very similar units interacting in a dynamic and adaptable way, but for sure more shit is happening there... \n\nThis modules then form specialized regions able to do things like riding a bike or be an expert on something. What's the problem with this? Maybe it's not very obvious but, what if we can have the best possible specialized region able to everybody instead of having to rely on others brain regions (let me explain)? Today there are -----> AI !!!  apps able to do in seconds what a human takes decades of work and some luck to be the best. I’m talking about apps that can detect skin diseases or tumors in X-rays better than the best doctors in the world combined or to drive with 0 mistakes in a F1 race. What I’m saying is, why should I rely on a single person instead of accessing the best one with less limitations? This is the true revolution: now there’s no need for armies of humans trying to be available and good, with one single app we can do it the best way and make it ubicous. We are unifying expertise and learning in a few single entities.\n\nBut, why aren’t these apps available now? I like to think that with integrated circuits we achieved to mimic those brain modules but we were unable to link them in a dynamic and organic way. Now we have this three things: powerful -----> AI !!!  GPUs, the Internet and Neural Algorithms. Sounds like the best context. There’s only one limitation: this [one](http://www.extremetech.com/wp-content/uploads/2015/04/MooresLaw2.png). We need more Titan V chips, more silicon into the equation and, of course it must be a lot more cheap. I’m not sure when, because I don’t know how to do the maths (ask Nvidia, Intel, AMD…) but I’ll bet that by the end of the next decade, we will have a lot of this weak -----> AI !!!  apps as services, products etc. A legal problem? Let’s look for a good app… Oh yeah, this one uses -----> AI !!! … “Is this contract legally valid?”; “A cop is saying me that I can’t use my -----> camera !!! ”; “My boss said me that…”. Answer: “ Ok, Will, (I have used a giant -----> AI !!!  server to read billions of cases, documents etc, I’ve even read the full paper you’re talking about, I’ve compared it to other’s users cases and documents maintaining legal secret, I’ve done all the stuff that requires 1 billion years to do by 1 billion “best” lawyers in just 6 seconds) This clause is invalid so you can cancell your relations with this agent. Best approach considering my database is to…”. I mean you get what I mean. OMG I’m wrinting too much…\n\nSo, by 2029 we will live in a world were specialized intelligence is the best possible, ubicous, cheap and fast as light (with AR glasses fuck yeah!). BUT, the sum of all these weak -----> AI !!! … No! We can’t link them in order to make a human mind! Or… can we?\n\n*****\n\n2030s\n\nNow, after all the shit you’ve read (sorry for that), I’ll make my main point: we will achieve Super -----> AI !!!  (ASI)/ god like -----> AI !!!  before or at the same time we reach AGI (human level -----> AI !!!  / General) and this is gonna happen in the 30s if, and only if, the same step of making posible dynamic communication between “modules” in order to create “ expertise regions” is made at a region level. How can we do this? I don’t know but as I said in this [post](https://www.reddit.com/r/Futurology/comments/7b1quc/the_10_years_cycle/), it’s very likely to neural links to be a thing. So, imagine a world where we have the best specific intelligent apps possible in the cloud and we can connect our mammal brains to them via brain wifi. It’s very hard to imagine, I know, but I’ll make a bet again.\n\nI want to think that progress is congruent: things happen if the context allows it. So, I think ASI will be a thing at the same time we connect our brains to it. We will build this new God as a part of us, not a separated one, we will be this God and I can’t wait for feeling that orgasm.\n\n********\n\nThanks for reading, this is a shitpost in the sense that I’m not an expert on anything and I just like to think about useless stuff xD I hope you enjoyed [it](https://www.youtube.com/watch?v=KNCEj6D8CAM)!\n", "link": "https://www.reddit.com/r/Futurology/comments/8kostp/ai/"}, {"autor": "SolidVegetable", "date": "2018-10-01 11:22:49", "content": "White engineers = racist -----> AI !!! ? /!/ \"Sexism, racism and other forms of discrimination are being built into the machine-learning algorithms that underlie the technology behind many “intelligent” systems that shape how we are categorized and advertised to.\n\nTake a small example from last year: Users discovered that Google’s -----> photo !!!  app, which applies automatic labels to pictures in digital -----> photo !!!  albums, was classifying images of black people as gorillas. Google apologized; it was unintentional.\n\nBut similar errors have emerged in Nikon’s camera software, which misread images of Asian people as blinking, and in Hewlett-Packard’s web camera software, which had difficulty recognizing people with dark skin tones.\n\nThis is fundamentally a data problem. Algorithms learn by being fed certain images, often chosen by engineers, and the system builds a model of the world based on those images. If a system is trained on -----> photo !!! s of people who are overwhelmingly white, it will have a harder time recognizing nonwhite faces.\"  \n([https://www.nytimes.com/2016/06/26/opinion/sunday/artificial-intelligences-white-guy-problem.html](https://www.nytimes.com/2016/06/26/opinion/sunday/artificial-intelligences-white-guy-problem.html))\n\n&amp;#x200B;\n\ntl;dr: Will we end up with a racist/sexist/etc -----> AI !!!  if the team behind it is not diverse enough? ", "link": "https://www.reddit.com/r/Futurology/comments/9kfgty/white_engineers_racist_ai/"}, {"autor": "ZenekPr0", "date": "2018-09-17 21:56:06", "content": "In the future -----> AI !!!  will be able to turn any book/movie/game into a virtual, perfectly immersive world that you'll be able to experience from any character's perspective, it will also take your vision of the story into consideration. /!/ So this is a concept that I think about from time to time. I like to immerse in a  book, movie, game, basically anything that tries to tell a story. So I was thinking what future could bring and hence this idea.\n\n&amp;#x200B;\n\nWhat if in the future a super advanced -----> AI !!!  was able to interpret the story (it doesn;t have to be a book, it may be an old -----> film !!!  or a game) and then it would be able to recreate that world as a virtual reality? What if it offered you an option to be there either as you, without any influences or to enter a more linear mod in which you play as a certain character an -----> AI !!!  makes sure action follows according to the script and in addition to that it influences your brain activity in a way that ensures you actually feel similar emotions to those that character was supposed to feel in a book? For example, let's say that a main character has a friend and that friends dies but then is brought back to life. This is a scenario that we just can't experience. But what if you were put in the shoes of that main character and your brain was subtly tricked to feel the way \"you're supposed to feel\"?\n\n&amp;#x200B;\n\nSometimes when I play a game or watch a movie I;m actually disappointed with myself that I don't feel the way I want to. Sometimes I want to be in awe when something glorious and magnificent happens and sometimes I want to feel sad, but often I'm just in a bad mood, or maybe some background noises distracts me. This is why I think an option to influence our feelings would be very appreciated.\n\n&amp;#x200B;\n\nYou'd also be able to regulate the dose of specific emotions and sensations. For example if you wish to you'll be able to get rid of pain, fear, but if you want a more realistic experience with less tricks you can just leave them as they're supposed to be. \n\n&amp;#x200B;\n\nAnother feature would be that you could either choose whether -----> AI !!!  does the simulation purely on its own or if it's allowed to analize your brain to see how you aleady visualize this world and use it as a support.\n\n&amp;#x200B;\n\nI make some assumptions here:  \n\n\nComputer graphics will improve to the point where it's impossible for a human to discern between real and artificial image.  \n\n\nFully immersive virtual reality will be created. I'm talking matrix level simulation that can't be discern from actual world  \n\n\nHuman brain can be influenced in a way that makes it's owner feel a certain way. It can be done in a way that human doesn't know it.  \n\n\nIt's going to be possible to interpret and visualize in some sense human thoughts.\n\n&amp;#x200B;\n\n-----> AI !!!  will develop and at one point it will be able to perform those things.   \n\n\nAnother thing is time. As of now we can't speed up the brain, that is, we couldn't juwt force it to relive 10 years in few minutes. There are at least two solutions:  \n\n\n1. We will enhance our brains with chips. This is probably going to happen anyway. With those enhancements it would likely be possible to simulate long periods of time in such a way that only minutes pass in real world.  \n2. We won't have anything better to do than virtual reality so we will spend our lives there anyway. Look, the real world is cool, but virtual world will allow us to become gods. It's imaginable that majority of humans will choose to spend their lives in perfect vitual words instead of real ones. This may sound creepy now but this almost certainly will happen.  There are already individuals spending their whole time in virtual worlds despite of how crappy and unrealstic they're in comparison to what I talk about so it's really a matter of time. I think it can happen before the end of this century. After all, think about what -----> AI !!!  can do using only one PC or one supercomputer. Now think about the processing power of the entire world. What if all of it, all smartphones, supercomputers, laptops, what if all were combined and working on just one project? What could we possibly achieve assuming no performance loss? Now imagine that in 40 years a box the size of your PC will feature more processing power than the entire world currently combined and then the same thing will likely happen in the next 40 years... well, I think this may just do it.\n\n&amp;#x200B;\n\nWhat do you think?", "link": "https://www.reddit.com/r/Futurology/comments/9goq8l/in_the_future_ai_will_be_able_to_turn_any/"}, {"autor": "ShmickleShmock", "date": "2018-02-24 13:45:47", "content": "Is strong -----> AI !!!  loose on the internet? /!/ Everybody has seen ads based on things they've searched, things they've mentioned that their phone mic has picked up, or things their -----> camera !!!  has seen.   \nI have seen one or two ads for things I have only THOUGHT about.  I'm not talking about an apple product or electric car motor, but some really obscure technical item that I thought was my idea.\nAt what point does an algorithm become powerful and sophisticated enough to be considered intelligent.\nHas anyone else experienced anything like this?", "link": "https://www.reddit.com/r/Futurology/comments/7zwnxp/is_strong_ai_loose_on_the_internet/"}, {"autor": "olimonki", "date": "2018-07-10 23:27:54", "content": "I'm conducting interviews of people with strong opinions about -----> AI !!!  /!/ Hey Futurology,\nI'm a Casting Director and I'm developing a show about Artificial Intelligence. I'm looking for everyday (non-scientist) people to interview on -----> camera !!!  (but not to be televised) about their thoughts, hopes, and fears of how -----> AI !!!  can affect their jobs, relationships, and society in general. \n\nAll participants must be USA based. PM me for details about how to be considered. Thanks! ", "link": "https://www.reddit.com/r/Futurology/comments/8xufa2/im_conducting_interviews_of_people_with_strong/"}, {"autor": "izumi3682", "date": "2018-08-30 09:26:22", "content": "This Lens-less -----> Camera !!!  Is Built Specially for -----> AI !!!  and Computer Vision Programs", "link": "https://www.reddit.com/r/Futurology/comments/9bi3yc/this_lensless_camera_is_built_specially_for_ai/"}, {"autor": "izumi3682", "date": "2018-07-05 12:19:45", "content": "-----> AI !!! -powered instant -----> camera !!!  turns photos into crude cartoons", "link": "https://www.reddit.com/r/Futurology/comments/8w9zu1/aipowered_instant_camera_turns_photos_into_crude/"}], "name": "Subreddit_Futurology_01_01_2018-30_12_2018"}