{"interestingcomments": [{"autor": "cryptoz", "date": "2018-08-05 20:27:22", "content": "- Sky pictures! I want to write a -----> machine learning !!!  classification system that would take any outdoor -----> photo !!!  and automatically tag weather info in it. I'm starting with a feature in this app to let you upload -----> photo !!! s of the sky with tags, and see others' -----> photo !!! s.\n\n- Environmental sensor data: Another optional feature is that the app can periodically collect sensor data, like barometer, hygrometer, thermometer, and light sensor data from your device. When this is processed it could produce useful weather data as well. Sensor code is open source: https://github.com/JacobSheehy/AllClearSensorLibrary\n\nI made this because I was really frustrated at the top weather apps in the Play Store. If you check out most of the top 10 free weather apps in the US, they are basically all identical (and bad, in my opinion). \n\n(The app is US-only for now. I tried to buy international weather data from IBM/Weather Channel, but got shafted and told the prices would increase 10x, and I'll have to spend time looking elsewhere and pick another source before launching internationally.)", "link": "https://www.reddit.com/r/technology/comments/94uwqs/hi_rtechnology_ive_made_a_new_hightech_weather/"}, {"autor": "cryptoz", "date": "2018-10-12 21:20:28", "content": "There is a lot of talk about weather apps right now, partially because of hurricanes, but also due to outrage over accuweather, and the unpublishing of WT, etc. If you look at the top weather apps I find most of them to be appalling. They almost never attempt a good display of weather data, which is hard; but you'll see entire screen's worth of information to just show empty precip hour by hour. There has got to be a better way to display that information. And often apps will show a 30% chance of precipitation and show a rain icon; but that's misleading since it's likely partly cloudy with a *chance* of rain. I know this can be hard to do, my own weather apps aren't perfect at it, but it's these kinds of improvements we should expect from weather apps today. To be honest the state of weather apps is quite dismal, with some exceptions of course - good weather apps do exist, but there are not many and, in my opinion, they are still not good enough.\n\nA big challenge is to display the right weather data in an easy &amp; fast package to the user. But different people want to see different data at different times, so there are lots of challenges in making just a weather app that displays the same data that everyone else does, but in a better way. It's not easy but there should be more apps trying.\n\nBut I don't want to stop there. With how powerful phones are these days and with how many sensors they have it is such a shame that the phones themselves are not contributing to the weather forecast. \n\n-----\n\n\nI make [All Clear Weather](https://play.google.com/store/apps/details?id=com.allclearweather.android) \n (US-only for now, see below for why) because I demand better of weather apps. Many of the [top weather apps](https://play.google.com/store/apps/category/WEATHER/collection/topselling_free) do nothing but display sometimes-outdated weather data in poorly formatted tables. Frankly the top 20 look exactly the same. I'm making a new weather app because it's 2018 and the category is stagnant. I love the weather and I'm sick of weather apps that don't do anything interesting. Here is what I am passionately dedicated to bringing to a weather app to make it *interesting* and useful at the same time:\n\n1) Your phone probably has a barometer in it! Most Android phones do because Google likes to use it as an altimeter to give you better indoor directions. So with iPhones also having barometers (for the iPhone health app), there are now *billions* of phones around the world are carrying barometers that next to no weather apps are using. Yeah WU and Dark Sky have a toggle, but what does it do? Do they talk about how they are using the sensor data? I don't think so. With All Clear you can at least *see* the sensor data from the weather sensors in your phone and *know* that it is being analyzed and processed into 'virtual weather stations' so it can be eventually included in the main weather models. You'll know this because you'll be able to see it happen in the app as I make progress. Here is a [quick graph I made](https://imgur.com/gallery/IPj6w7N) of Hurricane Florence's pressure recorded by phones in North Carolina a few weeks ago. It may take some imagination to see how the data could be useful (it needs cleaning, privacy protection, quality control, etc) but you can *see* the data in there and I know it can be extracted into useful numerical weather model inputs.\n\n2) All the phones in the world have cameras. These cameras are taking -----> photo !!! s of the sky and the weather all day long but nobody is using this data in weather forecasting. That's obviously because it is difficult to extract meaningful numeric weather data from a -----> photo !!! , but I believe it can be done. All Clear has a feature to let users send in -----> photo !!! s of the sky with tags, and I am going to use this data as a training data set to a -----> machine learning !!!  classifier. If it works, it should be able to automatically tag weather information in *any* outdoor -----> photo !!!  - assuming the training dataset is good and my ML is good.\n\n3) Current conditions in a lot of weather apps are out of date, since the source data is out-of-date. A lot of the US MADIS stations update only hourly, and they can miss updating in intervals when significant weather happens. Sometimes they update and sometimes they don't. But I think it's so frustrating to look outside and see it is raining while your weather app just happily denies the existence of that rain and tells you it's just partly cloudy. So I let you fix it, for yourself and for others nearby. If enough people all submit the same weather condition, contrary to the station reports, the app will start showing that condition as the Truth for current conditions in that area. (safeguards built in to protect against cheating).\n\n4) I'm sick of the same UI in all the weather apps. I get that the UI in All Clear isn't perfect yet (it's a new project! and it's a hobby! and I'm not a UI designer!) but I am absolutely going to try new things in terms of *how* the optimal weather data can be displayed to a user to maximize quick-check understanding. It's too easy to be misled by the text, icons, and gridded numbers in most weather apps.\n\n5) I am dedicated to open source. While the whole app isn't open source yet (it will be!) the main sensor code that does the barometric pressure data collection along with other sensors, is [open source on GitHub](https://github.com/JacobSheehy/AllClearSensorLibrary). I would encourage other weather app developers to enable features in their apps to aide in the crowdsourcing of potentially very useful weather data that is otherwise idle in phones. \n\n6) It's in the details. The US NOAA Forecast API that the app uses only returns its text forecasts with F and mi built-in as units. I wrote an algorithm (regexes mostly) to convert the text forecast units on-the-fly so you can be reading it and see it as C and km if you like, it's seamless. Well there is one error I know about, sometimes it will say \"quarter of an inch of rain\" which is a bit of a pain to parse, but I'm working on that too! \n\nAnother detail worth mentioning is the smart retry. During development I discovered that the API returned errors (or didn't return at all) and so rather than just showing the user a failure screen, the API does a nice backoff-retry to try really really hard to get the data for you. And if it can't do that? It knows that probably that forecast office or station is just *down*. So it changes the location parameters a bit and tries again, hoping to catch a different station forecast that would still be relevant to you. I don't have the numbers for how often it fails to load vs. other weather apps (I hope it's not worse!). But I know this: I put in some serious effort to try my best to show you the weather no matter what. On that topic...\n\n7) Another feature of the app is that it does a lot of work to attempt to pick accurate icons. I find that the icons shown in a lot of weather apps are misleading at best when it comes to describing the weather. It turns out that it's really hard to show the user the right weather information in just an icon. So this is the main reason for the animations in the app: to make the visuals more correct and more engaging. There is logic in the app to not show the default icon that comes from the weather API: if it did do that, then a 30% chance of thunderstorms shows you just the thunderstorm icon. Most apps do this. But chances are? The weather will be just partly cloudy, no thunderstorms. So the app shows a partly cloudy animation with a faded, flashing lightning bolt to indicate the probability. Further work is being done in future updates to the app to make this even more accurate.\n\n-----\n\nAlright, there's what All Clear can do that other weather apps can't. Maybe it should be your next weather app but maybe it is missing a critical feature for you. **What's that feature?** What do you need or want in a weather app that nobody is delivering today?\n \nAll of that above featureset is free by the way. Part of the problem with not enough original and quality weather apps is that they each cost money to run and users are often unwilling to pay. So for All Clear it is free to use all the features of the app; You can pay $1/month if you like to extend the forecasts from 3 days to 6, and extend other features in the app like the number of visible weather pictures (from 10 to 100). The subscription will help pay for the servers that run all the custom weather data code as well as future development of neat weather experiments using smartphone sensors. \n\nHere's the link to All Clear again: https://play.google.com/store/apps/details?id=com.allclearweather.android\n\nAnd a note about it being US-only. I tried to make this international from the get-go, and wasted months using IBM's API from WU that barely worked at all. Then they yanked the payment form off the web the week I was going to publish the app and buy their $400/month package. No longer an option. Now you have to wait for a phone call, might be weeks, and the prices are like $3,000 for the equivalent data (or something, hard to say). If you want to read some of the drama about this, check out this [WeatherUnderground thread](https://apicommunity.wunderground.com/weatherapi/topics/weather-underground-api-changes)  where people are describing the confusion as WU cuts off their keys and makes the service dramatically more expensive.\n\nSo the app is using the US NOAA data for free and I am investigating alternatives for international weather data.", "link": "https://www.reddit.com/r/technology/comments/9no8wf/weather_apps_in_2018_are_a_wreck_most_are/"}], "name": "Subreddit_technology_01_01_2018-30_12_2018"}