{"interestingcomments": [{"autor": "Learntek12", "date": "2018-11-15 10:47:33", "content": "Big Data vs. Artificial Intelligence /!/  [Big Data vs. Artificial Intelligence – Introduction :](https://www.learntek.org/blog/big-data-vs-artificial-intelligence/)\n\n  Big Data:\n\nThe growth of the world is impulsive in all ways, likewise the data. Data size across the world is huge, so technically increase in the data constitute the name Big Data. The time of spread sheet is over, A google search, Passport scan,  a barcode reading in supermarket, your online shopping history, An EKG reading, CCTV footage, A -----> photo !!!  of a sandwich, a voice message, A tweet, all of this contains data that can be collected, Analysed and Monetised. \n\nArtificial Intelligence:\n\nArtificial Intelligence is the study and design of intelligent agent, these intelligent agents have the ability to analyse the environments and produce actions which maximize success.\n\n-----> AI !!!  research uses tools and insights from many fields, including computer science, psychology, philosophy, neuroscience, cognitive science, linguistics, operations research, economics, control theory, probability, optimization and logic.-----> AI !!!  research also overlaps with tasks such as robotics, control systems, scheduling, data mining, logistics, speech recognition, facial recognition and many others.\n\n### [Comparing Artificial Intelligence and Big Data:](https://www.learntek.org/blog/big-data-vs-artificial-intelligence/)\n\nThe concept of artificial intelligence and big data is distinct and unique but they work together.\n\n### Artificial Intelligence\n\nArtificial intelligence is the recreation of human intelligence with machines. Making Artificial Intelligence stronger is nothing more than making a kid to grow up intelligently. Most of the time we teach them and more than that they observe and learn by them self. In both the cases the kid is learning with respect to the data points and becoming smarter. Artificial intelligence can help to synthesize, process and analyse huge amount of data given from big data edge.  -----> AI !!!  is not a natural intelligence but created by human to accomplish certain task. This can perform cognitive works like humans.  Data analysis and interpretation is very much important for Artificial intelligence, Collecting data (data can be structured, unstructured or semi-structured) and solving complex real time problems automatically is the challenging task that the Artificial Intelligence Machines do. The -----> AI !!! -enabled machine when compared to a traditional system can solve problems through interpretations that they made from the input data. Artificial Intelligence learns from the data and react according to what it learns. Like this way -----> AI !!!  systems can expand and adjust the changes.\n\n### Characteristics of Artificial Intelligence:\n\n* **Natural language processing** (NLP): The system will be able to analyse and understand what humans are talking\n* **Vision System:** These will analyse, interpret understand visual input on the computer. Doctors use clinical expert system to diagnose the patient\n* **Speech Recognition:** understanding human language and responding to it is the achievement of intelligent system with the help of machine translator\n* **Gaming:** It have a huge hand in strategic gaming, where machine have to think and take decisions based on heuristic knowledge\n* **Text Recognition:** Understanding human language is very challenging task. The intelligent system can understand and adapt the human language.\n* **Intelligent Robots:** Robots are able to perform the tasks given by a human. They have sensors to detect physical data from the real world such as light, heat, temperature, movement, sound, bump, and pressure. They have efficient processors, multiple sensors and huge memory, to exhibit intelligence. In addition, they are capable of learning from their mistakes and they can adapt to the new environment.\n\n### Benefits of Artificial Intelligence\n\n* Rational Thinking\n* Fast Decision Making\n* Plan Creation and Execution\n* -----> AI !!!  chat bot helps in interacting\n* -----> AI !!!  have capacity to process millions of sensor input\n* The aim is to extend probability of success and not accuracy\n* The goal is to simulate natural intelligence to resolve an advanced problem\n* -----> AI !!!  is the higher cognitive process\n* It results in developing a system to mimic human to retort behave in an exceedingly circumstances\n* -----> AI !!!  results in intelligence or knowledge.\n\n### Big Data\n\nBig Data is a collection of huge amount of data which is still growing. Because the data type is different and size of the data is huge and complex no traditional systems can store and process data efficiently. Some of the example are  New York Stock exchange (NYSE) it generate approximately one Terabyte(TB) data per day, 500+ TB data are produced per  day from the social media giant Facebook. Normally data could be in three forms:\n\n* **Structured**: Any data that can be stored, processed and accessed in a particular format is called structured data.\n* **Unstructured**: Data with no particular structure or format is unstructured data like Google search or email with attachment or a text file.\n* **Semi-Structured**: This will hold structured and unstructured data, example is personal data stored as XML file, Data from twitter in Json Format.", "link": "https://www.reddit.com/r/bigdata/comments/9xa5hd/big_data_vs_artificial_intelligence/"}], "name": "Subreddit_bigdata_01_01_2018-30_12_2018"}