{"interestingcomments": [{"autor": "mazzitorch", "date": "2020-02-28 03:58:52", "content": "MediaTek introduces Helio P95 with better -----> AI !!!  and -----> camera !!!  support /!/ Helio P95: Midrange smartphones have been implementing the 64MP sensors more and more and Mediatek today delivered a newer chipset with support for it. The Helio P95 SoC was introduced by the Taiwanese manufacturer - it has improved -----> AI !!!  over the Helio P90 while keeping the same CPU, GPU and other general specs. For more: [https://www.mobilezguru.com/mediatek-helio-p95-ai/](https://www.mobilezguru.com/mediatek-helio-p95-ai/)", "link": "https://www.reddit.com/r/technology/comments/faoqrh/mediatek_introduces_helio_p95_with_better_ai_and/"}, {"autor": "Aman-999", "date": "2020-05-15 12:51:29", "content": "Sony’s new IMX500 is the world’s first -----> camera !!!  sensor with -----> AI !!!  smarts", "link": "https://www.reddit.com/r/technology/comments/gk8jfq/sonys_new_imx500_is_the_worlds_first_camera/"}, {"autor": "ChrisTweten", "date": "2020-09-24 06:29:00", "content": "A controversial -----> photo !!!  editing app slammed for -----> AI !!! -enabled 'blackface' feature", "link": "https://www.reddit.com/r/technology/comments/iyrzwv/a_controversial_photo_editing_app_slammed_for/"}, {"autor": "DioriteLover", "date": "2020-10-11 02:33:23", "content": "Facebook's nudity-spotting -----> AI !!!  mistook a -----> photo !!!  of some onions for 'sexually suggestive' content", "link": "https://www.reddit.com/r/technology/comments/j8xffj/facebooks_nudityspotting_ai_mistook_a_photo_of/"}, {"autor": "montymyth", "date": "2020-10-20 18:57:57", "content": "A short -----> film !!!  written by -----> ML !!!  and how it will really be applied to Holywood /!/ [removed]", "link": "https://www.reddit.com/r/technology/comments/jew40s/a_short_film_written_by_ml_and_how_it_will_really/"}, {"autor": "Aman-999", "date": "2020-05-15 01:12:12", "content": "This new -----> AI !!!  -----> camera !!!  sensor could make CCTVs frighteningly smart", "link": "https://www.reddit.com/r/technology/comments/gjzi72/this_new_ai_camera_sensor_could_make_cctvs/"}, {"autor": "malavikapix", "date": "2020-03-23 10:27:01", "content": "Empower the document processing with PiXL KYC Classifier and Extractor &amp; PiXL Document Reader /!/ &amp;#x200B;\n\nNecessity is the mother of invention. The root of all the technology and its applications emerges from human needs. The same is with the \"PiXL KYC Classifier and Extractor\", and PiXL Document Reader\". The idea of these two products arises from our financial sector client's needs. The \n\n# The story begins here...\n\nWe are in a time where the technologies enable machines to simulate and augment human intelligence. Banking sectors are also inside the circle of intelligence age or else within a short time we can see a drastic change in financial services especially in manual works. They are the world of computers and networks that store the world economy in databases. PixDynamics had a trusted relationship with a prominent bank where they find difficulties in KYC form extraction and classification. Banks are the place where they handle a bulk of paper documents. We have to submit our proofs say Adhar cards, voters ID or any other means of Id proofs. This had to be entered into the system by a bank employee. Imagine how difficult it is to do these works manually. This is a practice that had been followed for years. Even though we address banks are in the path of -----> AI !!! , a lot of manual works are still an ongoing process. This gives us the idea of \"PiXL KYC Classifier and Extractor\", and PiXL Document reader \". Our developing team developed the product under DL and ML proficiency. After implementing the product our client bank classify and extracts the documents with less time and thus gets the documents scanned with 99 percent accuracy. And now we had a trusted relationship with a couple of banks where they realize the product's efficiency and quality.\n\nIt was a hard work of one and a half years effect within the hands of Artificial Intelligence, Deep Learning, and Machine Learning. The flow of the project was \n\n**Data collection -&gt; Train the system -&gt; Optimization**\n\nThe first real step to train our system is **gathering data**. This step is very important because the quality and quantity of data that you gather will directly determine how good your predictive model can be. A few hours of measurements later, we have gathered our training data. Now it’s time for the next step of machine learning: **Data preparation**, where we load our data into a suitable place and prepare it for use in our machine learning training. Now we move onto what is often considered the bulk of machine learning — the T**raining**. In this step, we will use our data to incrementally improve our model’s ability to predict whether a given drink is wine or beer. Once training is complete, it’s time to see if the model is any good, using **Evaluation**. This is where that dataset that we set aside earlier comes into play. Evaluation allows us to test our model against data that has never been used for training.\n\n# Our Products................\n\n#### PiXL KYC Classifier and Extractor\n\n-----> AI !!! -based solution specially designed to address KYC form extraction and classification issue, faced by the financial organizations in recent times. Our solution to this issue is developed using cutting edge -----> AI !!!  capabilities which would help the business users to effectively extract the respective KYC details from scanned images and mapped to customer profiles with very minimal effort. It can be used to automate several banking operations like CKYC, OVD Extraction, ID Verification and classification, Quality checking of ID Proof Submitted.\n\n#### PiXL Document Reader\n\nIf you have to process documents like invoices from PDF and images or else there are some PDF’s and images that are the usual strategy is quite manual. Here, PiXL Document reader is capable of processing several documents from PDF and images. The product learn from previous computations to produce reliable, repeatable decisions and results so that they had a pre-mapped data within the table records.\n\n#### PiXL CAD Mapper\n\nEngineering industries can make use of this product to get a CAD drawing structure.\n\nThere are some situations in which you have to convert the pictorial/image representations to CAD format, It's hard to do it manually, those industries can effectively make use of Pixl CAD mapper. PiXL CAD mapper is an Engineering drawing mapping solution that extracts tough components from complex drawings and then convert it to CAD designs/Vector design that can be of any DWF,SVG or CAD file format.\n\n#### PiXL Face Recognition\n\nHuman surveillance is one of the security factors that give birth to several products or software. There are several occasions where you can effectively use those applications. Normally we know that **Pixl face recognition** system is a technology capable of identifying or verifying a person from a digital image. They work by comparing selected facial features from the given image with faces within a database. It is an -----> AI !!! -driven facial recognition platform that is accurate, scalable, private and secure. It can detect the appearance of a human face in a -----> camera !!! ’s field of view. In addition to strictly security-related tasks, face detection can provide valuable information to your business security. \n\n# Advantages of our product…\n\n\"PiXL KYC Classifier and Extractor\", and PiXL KYC Classifier and Extractor\" carries merits as compared to other products. \n\n**Time** is a vital factor for any organization. The product will have more demerits if it consumes a lot of time. If the product gives an effective result within time than it is less than the usual time then its categories as an advantaged product. We can proudly add our product to an advantageous product. The documents that have been submitted by the customers are manually entered into the system by an employee and it consumes a lot of human energy and time. But then we can't assume that all the data entered by the employee is free from errors. But \"PiXL KYC Classifier and Extractor\", categories the documents and extract them with efficiency and \"PiXL Document Reader \" is capable of processing several invoices from PDF and images. In a mathematical time calculation, we can state that if a manual work takes time to process a document in 2 minutes then it works a 6 second to process the same. While considering a bulk of document process it will be a real add on a solution in banking, insurance, and telecom sector.\n\n**Cost-effectiveness is** yet another advantageous feature. While processing the documents there will be a set of employees for document processing and we can avoid their manual works and they only need to assist the application. So that the industry doesn't need to employ many employees to this level and it will improve the economy of the organization. \n\n**Accuracy** of the processed document is ensured with 99% and the **Quality** will meet up to 100%. We can process the documents with high quality and the documents will have accuracy after their processing. \n\n# What we solve?\n\nOur applications are loaded with smart decision taking algos that help business owners to optimize their business growth and make things go easy. Our solutions are driven in such a way that they address every single query while delivering unparalleled visibility and comprehensive control over all the business operations. We are a solution to an immense manual work that happens to our financial sector. Business clients can effectively extract the respective KYC details from scanned images and map them into corresponding customer profiles. It can be used to automate several banking procedures like CKYC, OVD Extraction, ID Verification and classification, Quality checking of ID Proof Submitted.\n\nBy this utilization, a bulk of manual processing will be processed within a short while with much accuracy and quality. This application raises its hands not only to the banking services but to several sectors where they have a bundle of documents to be processed. Insurance and telecom divisions can make use of the product which will results in their growth.", "link": "https://www.reddit.com/r/technology/comments/fnhqbu/empower_the_document_processing_with_pixl_kyc/"}, {"autor": "[deleted]", "date": "2020-06-15 18:17:45", "content": "An -----> AI !!!  can generate -----> photo !!! graphs of people’s faces from line drawings: Lin Gao at the Chinese Academy of Sciences in Beijing and his colleagues have developed an algorithm that instantly turns a rudimentary line sketch of a person’s face into a -----> photo !!!  portrait. /!/ [deleted]", "link": "https://www.reddit.com/r/technology/comments/h9lokt/an_ai_can_generate_photographs_of_peoples_faces/"}, {"autor": "Apexlegendy", "date": "2020-11-03 15:58:27", "content": "-----> AI !!!  -----> camera !!!  operator repeatedly confuses bald head for soccer ball during live stream", "link": "https://www.reddit.com/r/technology/comments/jncsx4/ai_camera_operator_repeatedly_confuses_bald_head/"}, {"autor": "when-users-rule", "date": "2020-06-10 16:13:42", "content": "Microsoft’s decision to replace human journalists with robots has backfired, after the tech company’s -----> AI !!!  software illustrated a news story about racism with a -----> photo !!!  of the wrong mixed-race member of the band Little Mix.", "link": "https://www.reddit.com/r/technology/comments/h0e3g2/microsofts_decision_to_replace_human_journalists/"}, {"autor": "mvea", "date": "2020-01-09 13:56:11", "content": "Warner Bros. signs -----> AI !!!  startup that claims to predict -----> film !!!  success - Algorithmic insights for -----> film !!! making go mainstream", "link": "https://www.reddit.com/r/technology/comments/em9yia/warner_bros_signs_ai_startup_that_claims_to/"}, {"autor": "onlinepeepsofficial", "date": "2020-12-18 11:37:21", "content": "Skylum officially presents Luminar -----> AI !!! : artificial intelligence in -----> photo !!!  editing for everyone", "link": "https://www.reddit.com/r/technology/comments/kfjk06/skylum_officially_presents_luminar_ai_artificial/"}], "name": "Subreddit_technology_01_01_2020-30_12_2020"}