{"interestingcomments": [{"autor": "Addison_942", "date": "2020-01-17 17:34:17", "content": "Are there any proposed technologies to fight back against deep-fake videos? /!/ I was wondering specifically if there's a proposed method of video that would ensure the recording was live. Let's call it Keye. Keye video could not be generated by an algorithm as it's creation is tied directly to the physical -----> camera !!!  device. I apologize in advance for my basic understanding of how video recording and virtual files work.\n\n\\[In an attempt to get a step ahead of the replies\\] My thoughts on simply recording a deep-fake video playing on another screen with a Keye equipped -----> camera !!!  are that I'm hoping we'll be able to distinguish the pixelated nature and limited color spectrum pretty easily with -----> machine learning !!! .", "link": "https://www.reddit.com/r/Futurology/comments/eq3jc5/are_there_any_proposed_technologies_to_fight_back/"}, {"autor": "RichyScrapDad99", "date": "2020-11-03 16:23:14", "content": "-----> AI !!!  -----> camera !!!  operator repeatedly confuses bald head for soccer ball during live stream /!/ [removed]", "link": "https://www.reddit.com/r/Futurology/comments/jndaa0/ai_camera_operator_repeatedly_confuses_bald_head/"}, {"autor": "RichyScrapDad99", "date": "2020-11-03 16:23:05", "content": "-----> AI !!!  -----> camera !!!  operator repeatedly confuses bald head for soccer ball during live stream /!/ [removed]", "link": "https://www.reddit.com/r/Futurology/comments/jnda6d/ai_camera_operator_repeatedly_confuses_bald_head/"}, {"autor": "Juggernaut_Due", "date": "2020-12-09 21:43:21", "content": "Future predictions one:2035 /!/ Hello everyone! Today i will make a post about a controversial yet fun discussion about what the future awaits for us, do note that predicting the future is always hard and impossible so i will work with percentages. And the date of 1 january 2035. Do note much of this is subjective.\n\n-75% likeliness. (Likely)\n-Electric cars will have become cheaper than fossil feull cars, this causes mass adoptation and soon most cars will be electric in the entire fleet.\n\n-Renewables will dominate new energy consumption because of dwindling prices, and soon take the top spot, together whit cheaper batteries it may surpass coal.\n\n-autonomous Drone deliveries and robot deliveries are common.\n\n-Smart home technologies like video doorbells ans smart home lights will be widespread and you can control your house from a distance now. Checking for tumors whit a home -----> camera !!!  equipped whit -----> image recognition !!!  also does not seem unlikely.\n\n-50% likeliness (could happen)\n-Ar glasses will be a widespread platform mainly pushed by google and apple, unlike the google glasses they arent chunky and goofy and got billions of funding. Maybe ar lenses will also become a thing.\n\n-Autonomous cars and frieght will have disrupted transport.\n\n-iot technologies will be implemented in practical areas like garbage cans and streetlights.\n\n-a new battery technology will have double the energy density of lithium ion allowing for trucks and even semi trucks to be electrified.\n\n-Death poeple can be reconstructed using a combination of deepfake and chatbot technologies, virtual friends will also be created this way.\n\n-25% likeliness (unrealistic)\n-small fusion reactors become practical\n\n-Poeple will begin to have simple versions of bci's\n\n-Iot technologies are implemented everywhere from clothes to packaging\n\nI hope these predictions where okay, feel free to critisize them and add some. Do note these predictions are assuming a positive-change future.", "link": "https://www.reddit.com/r/Futurology/comments/ka1e7r/future_predictions_one2035/"}, {"autor": "_FuturistechInfo", "date": "2020-02-29 02:51:47", "content": "Top Futurology News - For the week of Feb 28, 2020 /!/ **We hope you enjoy this week's update!**\n\nHere are the top stories from this past week:\n\n1) [DIABETIC MICE “CURED RAPIDLY” USING HUMAN STEM CELLS](https://futurism.com/neoscope/diabetes-mice-cured-human-stem-cells)\n\n*THESE INSULIN-SECRETING CELLS CURED MICE FROM SEVERE DIABETES \"WITHIN TWO WEEKS.\" A team of researchers at the Washington University School of Medicine in St. Louis successfully converted human stem cells into cells capable of producing insulin. These insulin-producing cells were then able to control blood sugar levels in a demonstration involving diabetic mice.*\n\n2) [Radical hydrogen-boron reactor leapfrogs current nuclear fusion tech](https://newatlas.com/energy/hb11-hydrogen-boron-fusion-clean-energy/)\n\n*\"We are sidestepping all of the scientific challenges that have held fusion energy back for more than half a century,\" says the director of an Australian company that claims its hydrogen-boron fusion technology is already working a billion times better than expected.*\n\n3) [How to Battle an Epidemic? Digitize Its DNA and Share It With the World](https://singularityhub.com/2020/02/26/how-to-battle-an-epidemic-digitize-its-dna-and-share-it-with-the-world/)\n\n*A nightmarish scene was burnt into my memory nearly two decades ago: Changainjie, Beijing’s normally chaotic “fifth avenue,” desolate without a sign of life. Schools shut, subways empty, people terrified to leave their homes. Every night the state TV channels reported new cases and new deaths. All the while, we had to face a chilling truth: the coronavirus, SARS, was so novel that no one understood how it spread or how to effectively treat it. No vaccines were in sight. In the end, it killed nearly 1,000 people.*\n\n4) [Clearview -----> AI !!! , the controversial facial-recognition company partnering with police, says its entire customer list was stolen in a breach](https://www.businessinsider.com/clearview-ai-list-customers-stolen-breach-2020-2)\n\n*The company has drawn backlash from privacy advocates and major social-media platforms over its facial-recognition tool, which lets police use a -----> photo !!!  of a person to search a database of images from social media and identify people based on their faces. The breach is notable because Clearview markets its services to law-enforcement agencies and has previously avoided disclosing who its clients are.*\n\n\\---\n\nLinks to all original sources below the super long image (on Imgur) in the comments showcasing this weeks' stories.", "link": "https://www.reddit.com/r/Futurology/comments/fb64ge/top_futurology_news_for_the_week_of_feb_28_2020/"}, {"autor": "Juggernaut_Due", "date": "2020-12-27 23:07:11", "content": "*new* 2040-'50s predictions /!/ (I thought the original post did not cont-----> ai !!! n enough predictions compared to the 2035 one so i improved)\n\nHello, I decided to dedicate another post to some predictions, i will try to propose several possibilities of how our society could look like in 2040 and after some recearch i hope i can offer some good predictions.\n\n(I used a spell checker this time)\n\n(I prevented to predict about politics or economics, i just feel a bit scared about predicting about matters like capitalism and ubi because i feel like i will get attacked. If my logic does not make sense to you i am sorry, i am not an adult and my reasoning might not make alot of sense.) \n\n(I used some of my 2035 predictions but mostly if they will still be sicnificant)\n\n85% Probability (Extremly likely)\n\n1.1 Electric cars and semi trucks will have a majority or sicnificant minority share in many developed nations car fleet, because of the plummeting drop of battery prices and sicnificant increases in battery density and charging time/infrastructure electric cars will become practical and cheap.\n\n1.2 Renewable energy solutions whit the help of storage methods becomes the method of choise to extract energy, many developed and possibly developing countries will have a sicnificant share of green energy in their energy mixes.\n\n1.3 Autonomous cars will reshape the way we travel and in developed countries that are able to afford digital infrastructure to support this type of transport we will start seeing major reforms in how we see car based travel, level 5 autonomy might even be a lawfull requirement in some countries effectivly banning human-based driving. This might steer controversy and debates.\n\n75% likely (very likely)\n\n2.1 Automation will start reshaping and taking over more and more jobs, around 20-50% of jobs and tasks might be automatef by this point. This will become a problem because many poeple will be left without a job and create an incomless underclass of poeple. There is also the fact that for many poeple work is a reason to live, this might stir up debates about what it means to be human and a need for economic reforms to redistribute the work that rem-----> ai !!! ns av-----> ai !!! lable.\n\n2.2 iot technologies might be widespread and make our lives easier, things like robotic kitchens in combination whit self driving delivery robots and/or drones, garden services might be done by community owned landmower robots and a road may be able to be rep-----> ai !!! red by a robot-human workforce once a -----> camera !!!  notifies someone.\n\n60% likely (will probably happen)\n\n3.1 Vr will become a normal part of life, i am not saying we will see emmersive vr systems, but maybe something like compact vr glasses in combination whit something that solves movements will probably already be good enough. however this will come to be, poeple will starts spending sums of their time in these worlds where they can meet up from the comforts of their homes. Some poeple might spend entire days in these worlds.\n\n3.2 Ar will be m-----> ai !!! nstream and responsive, entire cities and towns will be ar mapped and it could be usefull for showing you the way, customising your visual enviroment like making it seem sunny durring a cloudy day and helping you remember names. Ar could be implemented into contact lenses or lenses that replace your natural eye lenses via implants by now and powered by wireless power transmission.\n\n3.3 Entire fake personalities could be created by -----> ai !!! , they will probably not be able to reason and/or think like a human but imitate them very well, via ar technologies they could be projected into the real world and some poeple might only have -----> ai !!!  friends.\n\n3.4 in an effort to solve traffic, we might start seeing more solutions for travel like flying electric cars and an ultra fast way of travel like supersonic planes or maglev tr-----> ai !!! ns.\n\n3.5 A moon base has been estabelished\n\n3.6 new implants could start giving us new evolutionary advantages, an outside body exoskeleton might make us stronger and artificial hands might achieve the complecity of biological hands. This could go into combination whit 3d organ printing. \n\n50% probability (will maybe happen)\n\n4.1 There might be a few fusion plants that deliver a net positive of electricity to the grid.\n\n4.2 huge survealliance systems will start giving poeple a social credit score to judge poeple wich rights they deserve or do not deserve, this does not have to be per se as infriltive as the chinese version.\n\n4.3 huge sums of the world are now part of a cashless society\n\n4.4 Poeple will use bci's frequently, communications via telephatic messages and solving spinal issues might become an option, tho it will probably w-----> ai !!! t for itself untill the latter half of the 2040s i do see this happening in some cases.\n\n4.5 paper is obselete and bureacracy mostly done by -----> ai !!! , this makes a huge hurdle of the modern world fade away.\n\n35% probability (unlikely to happen)\n\n5.1 AGI is achieved", "link": "https://www.reddit.com/r/Futurology/comments/kldozf/new_204050s_predictions/"}, {"autor": "Juggernaut_Due", "date": "2020-12-27 22:55:54", "content": "2040-'50 predictions/Medium term - futurology ideas /!/ Hello, I decided to dedicate another post to some predictions, i will try to propose several possibilities of how our society could look like in 2040 and after some recearch i hope i can offer some good predictions.\n\n(I prevented to predict about politics or economics, i just feel a bit scared about predicting about matters like capitalism and ubi because i feel like i will get attacked. If my logic does not make sense to you i am sorry, i am not an adult and my reasoning might not make alot of sense.) \n\n(I used some of my 2035 predictions but mostly if they will still be sicnificant)\n\n85% Probability (Extremly likely)\n\n1.1 Electric cars and semi trucks will have a majority or sicnificant minority share in many developed nations car fleet, because of the plummeting drop of battery prices and sicnificant increases in battery density and charging time/infrastructure electric cars will become practical and cheap.\n\n1.2 Renewable energy solutions whit the help of storage methods becomes the method of choise to extract energy, many developed and possibly developing countries will have a sicnificant share of green energy in their energy mixes.\n\n1.3 Autonomous cars will reshape the way we travel and in developed countries that are able to afford digital infrastructure to support this type of transport we will start seeing major reforms in how we see car based travel, level 5 autonomy might even be a lawfull requirement in some countries effectivly banning human-based driving. This might steer controversy and debates.\n\n75% likely (very likely)\n\n2.1 Automation will start reshaping and taking over more and more jobs, around 20-50% of jobs and tasks might be automatef by this point. This will become a problem because many poeple will be left without a job and create an incomless underclass of poeple. There is also the fact that for many poeple work is a reason to live, this might stir up debates about what it means to be human and a need for economic reforms to redistribute the work that rem-----> ai !!! ns av-----> ai !!! lable.\n\n2.2 iot technologies might be widespread and make our lives easier, things like robotic kitchens in combination whit self driving delivery robots and/or drones, garden services might be done by community owned landmower robots and a road may be able to be rep-----> ai !!! red by a robot-human workforce once a -----> camera !!!  notifies someone.\n\n60% likely (will probably happen)\n\n3.1 Vr will become a normal part of life, i am not saying we will see emmersive vr systems, but maybe something like compact vr glasses in combination whit something that solves movements will probably already be good enough. however this will come to be, poeple will starts spending sums of their time in these worlds where they can meet up from the comforts of their homes.\n\n3.2 Ar will be m-----> ai !!! nstream and responsive, entire cities and towns will be ar mapped and it could be usefull for showing you the way, customising your visual enviroment like making it seem sunny durring a cloudy day and helping you remember names. Ar could be implemented into contact lenses or lenses that replace your natural eye lenses via implants by now and powered by wireless power transmission.\n\n3.3 Entire fake personalities could be created by -----> ai !!! , they will probably not be able to reason and/or think like a human but imitate them very well, via ar technologies they could be projected into the real world and some poeple might only have -----> ai !!!  friends.\n\n3.4 in an effort to solve traffic, we might start seeing more solutions for travel like flying electric cars and an ultra fast way of travel like supersonic planes or maglev tr-----> ai !!! ns.\n\n3.5 A moon base has been estabelished\n\n50% probability (will maybe happen)\n\n4.1 There might be a few fusion plants that deliver a net positive of electricity to the grid.\n\n4.2 huge survealliance systems will start giving poeple a social credit score to judge poeple wich rights they deserve or do not deserve, this does not have to be per se as infriltive as the chinese version.\n\n4.3 huge sums of the world are now part of a cashless society\n\n4.4 Poeple will use bci's frequently, communications via telephatic messages and solving spinal issues might become an option, tho it will probably w-----> ai !!! t for itself untill the latter half of the 2040s i do see this happening in some form.\n\n30% probability (unlikely to happen)\n\n-AGI is achieved", "link": "https://www.reddit.com/r/Futurology/comments/kldhlh/204050_predictionsmedium_term_futurology_ideas/"}, {"autor": "Locogooner", "date": "2020-05-13 20:25:08", "content": "How can we make cinema more ephemeral in the future? Or it is now impossible? /!/ I have since become obsessed with the idea of ephemerality and the arts. The idea that music, literature, painting, sculpture, and -----> film !!!  can be immortalized by the archival process. Those art forms allow people to hold onto tangible and physical representations whereas performance art is noticeably fleeting and transient.\n\nIt got me thinking about cinema and its origins. In the early days of cinema, enthusiasts could only watch -----> film !!! s via cinemas. If you didn't go to the cinema, you couldn't watch the -----> film !!! . If you didn't manage to catch the -----> film !!!  during its theatrical run, that was it.\n\n**You missed your opportunity.**\n\nWhereas now; with video-on-demand, Blu-ray / DVD, and torrents, you can rewatch your favorite -----> film !!! s anytime. I must say, I am very much a romantic when it comes to this aspect of cinema. I like the idea of the fleeting cinematic experience.\n\nOne of my favorite cinematic experiences in the last few years was watching Dunkirk on 70MM IMAX. Because even though I knew it would be released on disc / online, there was a very good chance I would not be able to watch the -----> film !!!  in that capacity again. That made the experience ephemeral to me.\n\nIf I missed the theatrical release at IMAX and simply watched it on DVD or online, I would be watching 50% of the -----> film !!! .\n\nI'm not the one to enjoy binge-watching on Netflix or any kind of DVD. I love the idea going to the cinema as I hate watching -----> film !!! s on my laptop. \n\nI want the biggest screen possible.\n\nAs an aspiring -----> film !!! maker myself, I have thought extensively of ways I would make my future -----> film !!! s more ephemeral.\n\nI play with the idea of releasing -----> film !!! s only theatrically. Every so often hosting a Livestream of the -----> film !!!  online and that's it. I like the idea of reducing the accessibility to increase the ephemera. Obviously, this is the kind of stunt you can only really do when you're a household name.\n\nSo, is this now a futile exercise against the dominant on-demand culture or will the value of cinematic ephemerality be affirmed in the future?\n\nIs there technology / -----> AI !!!  that can help us achieve ephemerality", "link": "https://www.reddit.com/r/Futurology/comments/gj6z2y/how_can_we_make_cinema_more_ephemeral_in_the/"}, {"autor": "_FuturistechInfo", "date": "2020-01-25 00:48:59", "content": "Top Futurology News - For the week of Jan 24, 2019 /!/ **We hope you enjoy this weeks update!**\n\n* [Nano-thin flexible touchscreens could be printed like newspaper](https://techxplore.com/news/2020-01-nano-thin-flexible-touchscreens-newspaper.html)\n* [Listen: Scientists recreate voice of 3,000-year-old Egyptian mummy](https://bigthink.com/surprising-science/mummy-voice)\n* [Google is “experimenting” with changes after backlash over Search redesign](https://www.fastcompany.com/90456008/google-is-experimenting-with-changes-after-backlash-over-search-redesign)\n* [A new twist on quantum communication in fiber](https://phys.org/news/2020-01-quantum-fiber.html)\n* [Notes From WEF: Oil-Producing Nations Want Dollar Alternatives, Just Not Bitcoin](https://www.coindesk.com/notes-from-wef-oil-producing-nations-want-dollar-alternatives-just-not-bitcoin)\n* [Touchscreen projector device brings gesture control to any display](https://newatlas.com/around-the-home/glamos-virtual-touchscreen-gesture-control/)\n* [Peter Thiel on the funding of science](https://marginalrevolution.com/marginalrevolution/2020/01/peter-thiel-on-the-funding-of-science.html)\n* [Caltech Team Builds a -----> Camera !!!  That Captures The Invisible at a Trillion Frames Per Second](https://www.sciencealert.com/this-camera-captures-the-invisible-at-a-trillion-frames-per-second)\n* [Is the consumer genetics fad over?](https://www.technologyreview.com/f/615088/is-the-consumer-genetics-fad-over/)\n* [Don’t Mess With the U.S. (Financially)](https://dailyreckoning.com/dont-mess-with-the-u-s-financially/)\n* [This ultrasonic gripper could let robots hold things without touching them – TechCrunch](https://techcrunch.com/2020/01/22/this-ultrasonic-gripper-could-let-robots-hold-things-without-touching-them/)\n* [India Wants to Send This Legless Humanoid Robot Into Space](https://futurism.com/india-legless-humanoid-robot-space)\n* [Materials Scientists Learn We’ve Been Brewing Espresso All Wrong](https://www.vice.com/en_us/article/884q8v/materials-scientists-learn-weve-been-brewing-espresso-all-wrong)\n* [Flu vaccine in a pill as effective as injectable form in human trials](https://newatlas.com/health-wellbeing/flu-vaccine-tablet-oral-vaxart-lancet-results-human-trials/)\n* [The Long Goodbye of Wi-Fi Has Begun](https://spectrum.ieee.org/telecom/wireless/the-long-goodbye-of-wifi-has-begun)\n* [Exclusive look at Cruise’s first driverless car without a steering wheel or pedals](https://www.theverge.com/2020/1/21/21075977/cruise-driverless-car-gm-no-steering-wheel-pedals-ev-exclusive-first-look)\n* [Customs to Roll Out Facial Recognition at all Airports...](https://www.nextgov.com/emerging-tech/2020/01/cbp-expands-facial-recognition-global-entry-travelers/162498/)\n* [A burst of gravitational waves hit our planet. Astronomers have no clue where it's from.](https://www.livescience.com/mysterious-gravitational-burst.html)\n* [A new 'molecular nano-patterning' technique reveals that some molecular motors coordinate differently](https://phys.org/news/2020-01-molecular-nano-patterning-technique-reveals-motors.html)\n* [Rolls-Royce Is Building Tiny Nuclear Reactors](https://futurism.com/rolls-royce-tiny-nuclear-reactors)\n* [IBM’s debating -----> AI !!!  just got a lot closer to being a useful tool](https://www.technologyreview.com/s/615074/ibms-debating-ai-just-got-a-lot-closer-to-being-a-useful-tool/)\n* [Near-Infinite-Lasting Power Sources Could Derive from Nuclear Waste](https://interestingengineering.com/near-infinite-lasting-power-sources-could-derive-from-nuclear-waste)\n* [Robot tanks: On patrol but not allowed to shoot](https://www.bbc.com/news/business-50387954)\n* [Coming Soon to a Processor Near You: Atom-Thick Transistors](https://spectrum.ieee.org/semiconductors/materials/coming-soon-to-a-processor-near-you-atomthick-transistors)\n* [JDI's ultrathin biometric sensor is built for 'high security' authentication](https://www.engadget.com/2020/01/21/jdis-ultrathin-biometric-sensor-high-security-authentication/)\n* [Discovery of new T-cell raises prospect of ‘universal’ cancer therapy](https://www.cardiff.ac.uk/news/view/1749599-discovery-of-new-t-cell-raises-prospect-of-universal-cancer-therapy)\n* [Clearview app lets strangers find your name, info with snap of a photo, report says](https://www.cnet.com/news/clearview-app-lets-strangers-find-your-name-info-with-snap-of-a-photo-report-says/)\n* [Velodyne Will Sell a Lidar for $100](https://spectrum.ieee.org/cars-that-think/sensors/automotive-sensors/velodyne-will-sell-a-lidar-for-100)\n* [MIT's ingestible medical devices can be dissolved by light](https://newatlas.com/medical/mit-ingestible-medical-devices-dissolved-by-light/)\n* [SpaceX aims to launch astronauts this spring after Crew Dragon escape test success](https://www.space.com/spacex-crew-dragon-astronaut-launch-by-spring-2020.html)\n* [Amazon may offer hand recognition payments to other stores](https://www.engadget.com/2020/01/18/amazon-hand-recognition-payments-testing/)\n* [Elon Musk: Starship Will Fly for 20-30 Years, Aiming for Fleet of 1,000](https://www.extremetech.com/extreme/305021-elon-musk-starship-will-last-20-30-years-aiming-for-fleet-of-1000)\n* [ECM Day is Here](https://www.armstrongeconomics.com/armstrongeconomics101/ecm-armstrongeconomics101/ecm-day-is-here/)\n* [The Prospect of Building a New International Monetary System Is Getting Real](https://www.coindesk.com/the-prospect-of-building-a-new-international-monetary-system-is-getting-real)\n* [Scientists Are Generating Oxygen from Simulated Moon Dust](https://gizmodo.com/scientists-are-generating-oxygen-from-simulated-moon-du-1841060875)\n* [Elon Musk Says He’ll Put A Million People on Mars By 2050](https://futurism.com/elon-musk-million-people-mars-2050)", "link": "https://www.reddit.com/r/Futurology/comments/etjlzl/top_futurology_news_for_the_week_of_jan_24_2019/"}, {"autor": "VausProd", "date": "2020-10-13 20:52:31", "content": "I wrote the beginning of a script and then let an -----> AI !!!  software write the rest. A short -----> film !!!  about a Jehovah's Witness with a troubled past. [3:55]", "link": "https://www.reddit.com/r/Futurology/comments/jam731/i_wrote_the_beginning_of_a_script_and_then_let_an/"}, {"autor": "Daantjebanaantje12", "date": "2020-12-01 14:55:45", "content": "New predictions /!/ I have studied and read your opinions to improve my future predictions, note that i do not cl-----> ai !!! m these things will happen and i am not a trend watcher.\n\n2025-30:\n-according to bloomber, electric vechiles will reach price parity whit ICE, this will cause mass adoptation and lighter batteries will allow new form factor like trucks.\n-Augmented reality glasses will be released and have fast adoptation caused by apple and facebook investing billions in them\n-iot technologies will be empowered by 5g, smart home articles will start talking to eachother and beginning to know you, your house might know you like waking up to the sound of rabbits and recommend you rabbit meat as a meal.\n\n2030-35:\n-6g will start to roll out, this will allow drones to reshapw deliveries and autonomous cars and frieght to reshape city transportation and taxis.\n-Lab grown meat will be av-----> ai !!! lable and compete whit plant based meats.\n-Batteries are twice as dense and light.\n-Many eastern and some western countries will have massive -----> camera !!!  survealliance and a social credit score system\n\n2035-40\n-some dead poeple might be reconstructed using digital twinning and -----> ai !!! , this might cause some poeple to spend days whit -----> ai !!! 's, these -----> ai !!! 's will not be able to reason tho, they wilk be copying behaviour of their living counterparts and use deepfake technologies\n-automation will have massivly disrupted work and automate many tasks, this means companies have to distribute the unautomated tasks.\n\nFeel free to add predictions or critisize!", "link": "https://www.reddit.com/r/Futurology/comments/k4mcn0/new_predictions/"}, {"autor": "AseriOCE", "date": "2020-02-27 11:31:43", "content": "Is it possible to make Nvidia's sketch -----> AI !!!  run backwards? /!/ So one could start with any -----> photo !!!  and you could teach it a sketching/drawing style it could make drawings from.", "link": "https://www.reddit.com/r/Futurology/comments/faara4/is_it_possible_to_make_nvidias_sketch_ai_run/"}, {"autor": "frugalfred1", "date": "2020-05-20 02:16:38", "content": "I made a short -----> film !!!  about a rogue -----> AI !!!  using only generic stock footage", "link": "https://www.reddit.com/r/Futurology/comments/gn2q5l/i_made_a_short_film_about_a_rogue_ai_using_only/"}, {"autor": "ngt_", "date": "2020-01-22 19:22:35", "content": "A team at Facebook -----> AI !!!  has created a reinforcement learning algorithm that lets a robot find its way in an unfamiliar environment without using a map. Using just a depth-sensing -----> camera !!! , GPS, and compass data, the algorithm gets a robot to its goal 99.9% of the time along a near-optimal route.", "link": "https://www.reddit.com/r/Futurology/comments/esgqn0/a_team_at_facebook_ai_has_created_a_reinforcement/"}, {"autor": "regalalgorithm", "date": "2020-09-05 21:41:04", "content": "Last Week in -----> AI !!!  - Progress on -----> AI !!!  ethics, Hulu's deepfake ads, and more! /!/ Hi there, I and some others working in -----> AI !!!  produce a little weekly [newsletter](https://www.skynettoday.com/categories/digests) with summaries of last week's -----> AI !!!  news, and I wonder if some of you might dig these round ups. Here's what we got in the [latest](https://www.skynettoday.com/digests/the-eightieth) one:\n\n### Mini Briefs\n\n#### [The term “ethical -----> AI !!! ” is finally starting to mean something](https://venturebeat.com/2020/08/23/the-term-ethical-ai-is-finally-starting-to-mean-something/)\n\nAs warnings about the dangers of -----> AI !!!  have come to the fore, industry  and academia have answered with research, conferences, and institutes  all aimed at fair, ethical -----> AI !!! . The most recent wave, opposed to the  first that was dominated by philosophers, has been focused on technical  approaches to the problem. But technical fixes alone cannot wring all  the water from the sponge. In order to ensure that profit-seeking  institutions and other groups producing -----> AI !!!  technologies are careful in  their quest to advance applications of the technology, a strong hand  will be needed to both oversee the research itself and to decide whether  or not that research should be used. Finally, a new wave in ethical -----> AI !!!   has taken us to “practical mechanisms for rectifying power imbalances  and achieving individual and societal justice.” The shift towards  socio-technical issues has laid the ground for the UK’s Court of Appeal  to find police use of facial recognition unlawful and call for a new  legal framework, for high school students to protest after their marks  were downgraded by an algorithmic system, and for countries like New  Zealand to publish charters and form task forces to provide guidance for  the use of algorithmic systems. Practical tools for accountability, and  the full participation of research institutes, activists, and  campaigners to make sure governments help in addressing these risks,  will be vital. Fortunately, movement towards more ethical use of -----> AI !!!   seems to have been mobilized by social pressure. That pressure will need  to be sustained, and perspectives beyond European and North American  actors will need to be surfaces, in order to make -----> AI !!!  and data truly work  for everyone.\n\n#### [Hulu deepfaked its new ad. It won’t be the last.](https://www.protocol.com/hulu-deepfake-commercial-ai)\n\nRather than going through the complicated logistics of flying out  actors during a pandemic, Hulu decided to simply fake its latest ad.  Using deepfake algorithms trained on footage of athletes such as Damian  Lillard and Skylar Diggins-Smith, the Hulu clip superimposed the faces  of the stars onto body doubles. This is not a new trend: State Farm ran a  commercial in April that featured deepfakes, while -----> AI !!!  video startup  Synthesia, “which offers customers the ability to produce videos without  actors and -----> film !!!  crews, has seen a 10x growth in demand since the  beginning of the pandemic.” Synthesia COO Steffen Tjerrild predicts that  “-----> AI !!!  will eventually do to video production what apps like Instagram  filters did to photography.” Indeed, the technology appears to be  advancing quickly and the monetary incentives will be difficult for  companies to ignore. Just as much of our entertainment has been pervaded  by CGI, soon it may be populated by deepfakes.\n\n#### Advances &amp; Business\n\n* [Facebook is training robot assistants to hear as well as see](https://www.technologyreview.com/2020/08/21/1007523/facebook-ai-robot-assistants-hear-and-see/)  \\- In June 2019, Facebook’s -----> AI !!!  lab, F-----> AI !!! R, released -----> AI !!!  Habitat, a new  simulation platform for training -----> AI !!!  agents. It allowed agents to explore  various realistic virtual environments, like a furnished apartment or  cubicle-filled office.  \n \n* [The robot revolution has arrived](https://www.nationalgeographic.com/magazine/2020/09/the-robot-revolution-has-arrived-feature/)  \\- If you’re like most people, you’ve probably never met a robot. But  you will. I met one on a windy, bright day last January, on the  short-grass prairie near Colorado’s border with Kansas, in the company  of a rail-thin 31-year-old from San Francisco named Noah Ready-Campbell.  \n \n* [Please remain calm while the robot swabs your nose](https://www.theverge.com/2020/8/24/21377011/robot-nasal-swab-machine-autonomous-covid-19-test-brain-navi)  \\- If you’ve been tested for COVID-19 then you’ve probably experienced  the unpleasantness of a nasal swab. Someone takes a long-handled cotton  swab and sticks it up your nose–way up your nose–until it reaches the  back of the mucus-cave that is your nasal cavity.  \n \n* [How -----> AI !!!  and Art Hold Each Other Accountable](https://hai.stanford.edu/blog/how-ai-and-art-hold-each-other-accountable) \\- The arts have a major role to play in the fairness of our technological future.  \n \n* [The utopian promise and dystopian potential of real-time detection of police, fire, and medical emergencies](https://venturebeat.com/2020/08/27/the-utopian-promise-and-dystopian-potential-of-real-time-detection-of-police-fire-and-medical-emergencies/)  \\- In 2014, John Garofolo went to Baltimore to visit Lt. Samuel Hood of  the Baltimore Police Department. Garofolo was previously head of  Aladdin, a program in the Office of the Director of National  Intelligence to automate analysis of a massive number of video clips.  \n \n* [How Close Are Computers to Automating Mathematical Reasoning?](https://www.quantamagazine.org/how-close-are-computers-to-automating-mathematical-reasoning-20200827/) \\- -----> AI !!!  tools are shaping next-generation theorem provers, and with them the relationship between math and machine.  \n \n* [-----> AI !!!  Algorithm Reaches Equivalent Accuracy of Average Radiologist](https://www.diagnosticimaging.com/view/ai-algorithm-reaches-equivalent-accuracy-of-average-radiologist)  \\- At least one algorithm is ready to pinpoint which women have breast  cancer without additional oversight or interpretation needed from the  radiologist. That’s according to one research team that compared the  performance of several -----> AI !!!  tools.  \n \n* [Impact of Go -----> AI !!!  on the professional Go world](https://medium.com/@hajinlee/impact-of-go-ai-on-the-professional-go-world-f14cf201c7c2)  \\- Professional Go players are often referred to as one of two types,  tournament players or teaching players. Tournament players are the ones  who spend most of their time and energy training and competing in  tournaments, and most of their income is tournament prize money.  \n \n\n#### Concerns &amp; Hype\n\n* [GPT-3, Bloviator: Open-----> AI !!! ’s language generator has no idea what it’s talking about](https://www.technologyreview.com/2020/08/22/1007539/gpt3-openai-language-generator-artificial-intelligence-ai-opinion/)  \\- Our tests show that the popular -----> AI !!!  still has a poor grasp of reality.  Since Open-----> AI !!!  first described its new -----> AI !!!  language-generating system  called GPT-3 in May, hundreds of media outlets (including MIT Technology  Review) have written about the system and its capabilities.  \n \n* [GPT-3 Is an Amazing Research Tool. But Open-----> AI !!!  Isn’t Sharing the Code.](https://onezero.medium.com/gpt-3-is-an-amazing-research-tool-openai-isnt-sharing-the-code-d048ba39bbfd) \\- For years, A.I. research lab Open-----> AI !!!  has been chasing the dream of an algorithm that can write like a human.  \n \n* [The Impact of -----> AI !!!  on Journalism](https://www.forbes.com/sites/calumchace/2020/08/24/the-impact-of-ai-on-journalism/)  \\- Back in 2014, the Los Angeles Times published a report about an  earthquake three minutes after it happened. This feat was possible  because a staffer had developed a bot (a software robot) called Quakebot  to write automated articles based on data generated by the US  Geological Survey.  \n \n* [Participation-washing could be the next dangerous fad in machine learning](https://www.technologyreview.com/2020/08/25/1007589/participation-washing-ai-trends-opinion-machine-learning/)  \\- Many people already participate in the field’s work without  recognition or pay. The -----> AI !!!  community is finally waking up to the fact  that machine learning can cause disproportionate harm to already  oppressed and disadvantaged groups. We have activists and organizers to  thank for that.  \n \n* [Memers are making deepfakes, and things are getting weird](https://www.technologyreview.com/2020/08/28/1007746/ai-deepfakes-memes/)  \\- The rapidly increasing accessibility of the technology raises new  concerns about its abuse. Grace Windheim had heard of deepfakes before.  But she had never considered how to make one.  \n \n\n#### Analysis &amp; Policy\n\n* [Trump Slashes Research Funding but Raises the US Federal -----> AI !!!  Budget by 34 Percent](https://syncedreview.com/2020/08/22/trump-slashes-research-funding-but-raises-the-us-federal-ai-budget-by-34-percent/)  \\- Trump announced the 2021 fiscal year budget proposal on Monday,  further flashing the budget for federally funded research projects,  whereas research budgets of major scientific institutions have  experienced double-digit cuts.\n\n#### Expert Opinions &amp; Discussion within the field\n\n* [First Woman Director At MIT CS -----> AI !!!  Lab: “Want More Women In STEM? Inspire Them Early.”](https://www.forbes.com/sites/nancywang/2020/08/23/first-woman-director-at-mit-cs-ai-lab-want-more-women-in-stem-inspire-them-early/)  \\- We decide on our careers long before we ever step foot in our  workplace. We take cues from our family and dramatized media depictions  of professionals who often look and act nothing like their real-life  counterparts.", "link": "https://www.reddit.com/r/Futurology/comments/in9m8v/last_week_in_ai_progress_on_ai_ethics_hulus/"}, {"autor": "Snoo_85410", "date": "2020-12-04 14:46:16", "content": "Dynamic short------> film !!! , \"Agence\" merges cinematic storytelling, -----> AI !!! , and user interactivity. In this simulated universe, you have the power to observe or interfere with tiny -----> AI !!!  creatures, called the “Agents”, as they react to each other and their emerging world.", "link": "https://www.reddit.com/r/Futurology/comments/k6m6uf/dynamic_shortfilm_agence_merges_cinematic/"}, {"autor": "yosufshahibrahim", "date": "2020-06-02 17:07:11", "content": "6 ideas that would revolutionize the world... /!/ I have 6 ideas for a social media website I wanted under the domain name of www.oooo.com... in that there are two sets of eyes representing two people... I like it because it’s simple and it’s where people can TRULY and EXPLICITLY get in touch with one another.... (it’s not a stab at websites like Facebook or Google +.... it’s just that I’m not the best writer)... \n\nIdea 1\nGuardian Witness\n\nI came up with this idea about 8 years ago back when I was engulfed in the tech world and back when I was trying to get it made by organizations such as the CIA....\n\nBasically what the app does is it runs a microphone in the background of the desktop computer, laptop or smartphone ( in addition to taking snappers of gps location)  so that anyone with the app can feel safe in that there is a digital bubble of accountability surrounding them. Video can also be taken if the computer can take it( it may have to be low quality image quality to start in that phones are not strong enough to have high quality video taken and saved)...\n\nThe idea is basically that it’s a DVR running in the background of your laptop or smartphone and there’s an aura of accountability surrounding you because of that... think of it this way: people feel safer where there are security cameras installed... now imagine this: imagine everyone’s phone and laptop having a DVR on all the time... sure privacy concerns may come up - but this is the direction the world is headed towards....(it’s inevitable)\n\nThe Human Element: I feel that the future consists of smartphones being on all the time and recording all data to be stored in an external, retrievable database so that everyone’s lives can be saved and cherished...(kids can have a smartphone hang on there necklaces from childbirth even someday)... it’ll happen when phones are smarter and after a while ( when over a billion people have the app on)...\n\nIdea 2\nA.I. Generates Music and Video\n\nI feel that in the future( note: when it’s more transparent?), people will post up detailed Facebook posts and the such, and because of the posts Music and/or video will be made because of it using -----> machine learning !!!   algorithms....\n\nWhat Facebook ( or Google) can do is give the option to fill out a survey after taking in the post so that customizable Music is generated and distributed accordingly...\n\nBasically what people can do is write up a post, answer a few questions, and out comes a song with (maybe) some video... there will also be the option to customize the song either through refilling out the survey.... and by inputting data through something like Garage Band...\n\nI feel like in the future EVERYONE will become a musician.... I came up with this idea when I was learning how to write music...and I didn’t know how to do so... people will TRULY be able to express themselves...through music... \n\nand that’s not all.... the music Industry will be Completely revolutionized due to this.... imagine the smash hit records that will come out through the social media community (by chance, out of the BILLIONS of songs to be generated)... and I feel like -----> film !!!  will also be revolutionized because of this idea( but not in the near future... maybe after a few years after -----> machine learning !!!  for videos becomes more advanced)....\n\nIdea 3\nBosser\n\nI just like to call this one Bosser because the name stuck.... but basically what it is is an app to end homelessness ( it’s how I came up with the app).... but it transformed into a lifestyle app after more thought...\n\nThere’s about a quarter million homeless people in the USA and another quarter million homeless people in the EU at any given moment in time( at least in the current state of affairs)...Bosser can help end that...\n\nI wanted to create algorithms which centered around rewarding people who help the homeless to get off the streets( and stay off the streets) with cash rewards... meaning they get paid to help the homeless...\n\nHow do you get a homeless person off the streets?... first you got to get his or her social security card from the social security building ... then a license from the dmv.... and then find him or her a room for rent, a cell phone... some clothes.... and of course.... A JOB... ( it also varies state by state, I think, plus, it doesn’t matter because if the life manager is getting paid 25-30$ per hour,... they will figure out a way for the homeless person to get documented! (Not that the app wouldn’t help... there would be assigned guidelines...))\n\nThis is where the money comes from( and how the life management specialists get paid... this will probably take a chunk of market away from staffing and life management agencies... but basically whoever takes care of these things for the homeless person will get paid a portion of what the homeless person gets paid ....(around 25% of the homeless persons salaries).... according to my calculations.... the life management specialists will average around 25-30$ per hour helping the homeless get off the streets( and to keep them off the streets)... landlords can install the app and get paid to wake them up for work.... so this has to be done very meticulously to have the app turn success.... but there is a future to this app....\n\n\nIn the future I believe that life management will become a prominent thing... people will pay and get paid to manage someone else’s life....I was thinking about how the homeless people turned successful lower middle class citizens can continue college.... and the life management specialists still get paid to advise them along the way.... mentor ship and guidance will become a thing...( because everyone wants to live the the most away from worries and burdens as possible)....\n\nThere’s more to the app... like how the homeless person and the life management specialists will have a rating system... but I’ll leave it at that ( hopefully you understand the vision)...\n\nIdea 4\nA.I. Powered Factionalizer\n\nThis idea goes well with the A.I. Music generator...in that it filters out opinions and retains only the facts in any given page or post(etc)... but basically that’s what it does.... through -----> machine learning !!! ... I don’t see if anyone’s made this or not...\n\nIdea 5 \nInvest in Movies Online\n\nYou know how big budget movies cost around 100 million dollars to make sometimes?... You know how you can invest in companies worth more than that on the stock market?... why not give people the option to invest in big budget movies online??? It would make things easier for the producers ... and social media users can profit off movie ticket sales....\n\nAn example would be about how it’d typically work... a movie under preproduction would be posted online... and it would be exhibited... and social media users would be able to invest in up to HALF the movies budget... and the other half would come from Hollywood executives...\n\nSocial media should have the option to make money like that.... plus everyone wins... I was thinking of having little Easter eggs in there such as how people could get free movie tickets after investing....\n\nOverall more -----> film !!!  would be created this way in that it acts as a throttle for the -----> film !!!  industry... much lower budget -----> film !!! s can also be involved.... people want to make money ...\n\n\nIdea 6\nGenetic testing community\n\nThis one I’m super excited about... celebrities all have similar brains in that their scope and visions are grand.... I was thinking of gathering the DNA of multiple celebrities....and using -----> machine learning !!!  algorithms to find similarities between how their minds work...and applying those algorithms to the general public...\n\nI feel that anyone with a social media account should be given a free genetic test( I’ll explain how this is to be funded later).... and algorithms from the above method should be used to find people who they REALLY may know ( not a stab at Facebook)... but I feel that’s what the future is going to be about.... people similar to one another will want to hang out with one another.... and this would spawn new things like new baseball teams ( for example)... and new workspace environments ...\n\nYou might be wondering how I’m going to get the genetic data of multiple celebrities... I was thinking that this could happen through the investment phase...( of whenever google or Facebook... or even Apple...) decides to make the idea.... in celebratory fashion...\n\n\nConclusion\n\nI wanted to put all 6 ideas in one app idea...and allow it to make the world a better place:)", "link": "https://www.reddit.com/r/Futurology/comments/gvb87d/6_ideas_that_would_revolutionize_the_world/"}, {"autor": "ngt_", "date": "2020-01-09 16:57:12", "content": "-----> AI !!!  is supposed to predict success of movies at Warner Bros. “The system can calculate in seconds what used to take days to assess by a human when it comes to general -----> film !!!  package evaluation or a star’s worth”.", "link": "https://www.reddit.com/r/Futurology/comments/emcekb/ai_is_supposed_to_predict_success_of_movies_at/"}, {"autor": "mvea", "date": "2020-01-09 13:55:38", "content": "Warner Bros. signs -----> AI !!!  startup that claims to predict -----> film !!!  success - Algorithmic insights for -----> film !!! making go mainstream", "link": "https://www.reddit.com/r/Futurology/comments/em9y9t/warner_bros_signs_ai_startup_that_claims_to/"}, {"autor": "Nillabean1988", "date": "2020-05-14 11:07:18", "content": "Lights! -----> Camera !!! ! -----> AI !!! !", "link": "https://www.reddit.com/r/Futurology/comments/gjk9zq/lights_camera_ai/"}, {"autor": "drunkles", "date": "2020-02-07 06:00:57", "content": "How -----> AI !!!  helped upscale an antique 1896 -----> film !!!  to 4K", "link": "https://www.reddit.com/r/Futurology/comments/f06ahh/how_ai_helped_upscale_an_antique_1896_film_to_4k/"}, {"autor": "SupertrendsApp", "date": "2020-07-29 08:23:28", "content": "The first -----> AI !!!  actress to star in a -----> film !!!  /!/ [removed]", "link": "https://www.reddit.com/r/Futurology/comments/hzwyx6/the_first_ai_actress_to_star_in_a_film/"}, {"autor": "p3opl3", "date": "2020-09-01 11:45:39", "content": "Is remote work and online slowly killing ageism? /!/ I'm think the more we work online the less of a problem this is going to be.\n\nWe have -----> AI !!!  that can now wrap your face with anyone elses real time.. with a bit of work it could do this perfectly. I've seen Obama and Trump for example do and say some surprising things and would never have known it was fake untill I read the comments haha.\n\nYou could literally be whomever you want to be online and interview and attend meetings like this. \n\nSo like be a 30 year old young man.. when you're actually a 75 year old. \n\nOr even frlor transgendered people who are transitioning still.. they could literally just be whomever they wanted to be online for real.\n\nEvery time you switched on your \"-----> AI !!!  face and body swap\" -----> camera !!!  for a meeting no one would ever be the wiser.. \n\nWhat do you folks think?", "link": "https://www.reddit.com/r/Futurology/comments/ikir2a/is_remote_work_and_online_slowly_killing_ageism/"}, {"autor": "currentXchange", "date": "2020-11-27 07:18:31", "content": "Thanks for your feedback on my \"Web 4\" concept. Here's where it's at now. /!/ A few days ago, I posted my idea about \"Web 4\", four modular ideas that help us create democracy on top of blockchain tech. \n\nI got some stark and quality feedback that helped open my eyes to the shortcomings of my ideas and communication. I have re-written most of the paper, and would like to ask again for your feedback. \n\nWhat I Learned before \nTime Tokens, what I thought was the most important part, was looked over -&gt; I clarified (lengthened) this idea and the importance\n\nBiometrics -&gt; Although this was a \"thought experiment\" to me, people took it seriously and reminded me of the problems of biometrics, so I shortened the section, added the \"Biokey/Biosecret\" terminology along with many disclaimers.\n\nCommunication -&gt; I added a \"problem/solution\" section at the beginning, and cut out most of the fluff \n\n# Here's the paper as it is now\n\n# The Web 4 Manifesto: Awakening the Democratic Web \n\nby Douglas James Butner \ndouglas@cxc.world\n\n\n\n# What is Web 4?\n\nWeb 4 is a set of four **modular paradigms** (time tokens, biokeys, information entropy, and geo-social systems) that allow integration of **provable democracy in any social system** that seeks to be more collaborative (organization, government, community, etc.). Modularity allows any project to adopt one or more of these principles to **increase the accuracy, fairness, and transparency** of each individual's role in **collaboration**. \n\nWeb 4 is **built on top of web 3** (it's blockchain-based) while being **fundamentally different** and providing enough **benefit to society** warrant the new title of web 4. \n\nIn essence, web 4 is **collaboration consensus tool** that helps to manifest a shared desire, opinion, or solution by providing a fair system of accounting using time-limited votes, real people, and existing geopolitical stratification.\n\n&gt; Web 4 combines real-world components like time and geography with existing blockchain technology.\n\nIn this manifesto, I will define each of the **components** of web 4, provide **psudeocode** to illustrate the minimum integration into web 2/3, introduce the **benefits to society**, and offer a **roadmap** to adopting these concepts.\n\n# The Problem\nDemocracy, society's biggest and most successful consensus and collaboration mechanism, has become **too slow to keep up** with the modern world. Groups of people organizing, whether to turn a profit as a company, or to live together in a city, are often **under-, mis-, or not represented at all** in the decision making processes that affect their lives and work. In both governments and companies it is the few that make the decisions for the many, even with the **illusion** of \"having a say\" that exists in a **representative system**. \n\n# The Solution\nBy providing each individual with **equal power** in a **transparent decision making process**, the true intent of the majority can not only be known, it can be acted upon in predetermined ways through smart contracts. Though this solution seems simple, there are issues that will need to be addressed according to the needs of each group of collaborating people, such as ensuring **one person per account**, and **limiting the minting of voting tokens with time**, as well as protecting the **privacy of decision makers** where appropriate. This paper will detail these solutions, and recommend that each system decide what components of web 4 to use or not use. For example, systems can (and should) be built using time tokens that **do not use biometric data at all**, a common concern in our modern world. \n\n\n# Background\n\nBefore we detail web 4, we must look briefly at the concepts of web 1, web 2, and web 3. \n\n - **Web 1**\n**Static web**. Files are served from a remote server to a user's browser.\n\n - **Web 2**\n**Dynamic web**. Web pages take a user's information and desires into account to build a unique experience for them. Asynchronous requests allow single page applications to thrive. Applications are still served from a central server.\n\n - **Web 3**\n**Decentralized web**. Applications, often open-source, exist in distributed networks instead of a central server. This unfederated model trades control and censorship ability for freedom and autonomy. \n\n - **Web 4**\n**Democratic web**. Time-limited tokens are given to each individual, and used as a measure of opinion or desire in collaborative systems.\n\nToday, the top 100 websites/apps by traffic are [all](https://www.alexa.com/topsites) web 2-based. The web 2 paradigm fits closely with the wider environment of **corporate-owned information.** \n\nAs more and more individuals and societies are reconsidering the place of **government, censorship, centralization and federated power**, web 3 has emerged as a powerful, provable option to shape the evolution of information and society on planet Earth. \n\nA growing portion of web 2 websites and applications today have elements of web 3, like [cryptoblogs](https://peakd.com) and [games](https://www.stateofthedapps.com/rankings/category/games). While web 2 and web 3 can operate independently, web 3 enhances the abilities of web 2. Similarly, web 3 and web 4 can operate independently, but it makes the most sense for web 4 to be built on blockchains to gain the benefits of reliability and transparency. \n\n## Guiding Philosophy\nWeb 4 seeks to implement [biomimetic](https://biomimicry.org/what-is-biomimicry/) systems in **harmony with the universe itself** by replicating nature: the **abundance** of the Sun, rising **entropy**, and the **equality** of each human being. \n\nWeb 4 tests the hypothesis that when we create information systems in **harmonic resonance** with natural systems, our society will be able to advance more rapidly than ever before, as we will be able to **synchronize energetically** with the larger systems of bioelectromagnetic information processing around us (the Earth, Sun, and Galactic core). \n\n\n## Defining Web 4\nWeb 4 introduces **four modular components** for **provably democratic systems**, suggested to be built on top of web 3's open-source decentralized networks. \n\n### There are four conceptual underpinnings (modules) of web 4\n\n 1. **Time Tokens** \n\t Individuals may claim time-limited tokens at given intervals, which represent that interval. Only one time tokens can represent the one interval and individual, and one individuals can't hold another's time tokens.\n 2. **Proof of Individuality (One Person, One Account)**\n\t Biometric Secrets, Social Verification, Proof of Liveness, white lists, etc. are used to guarantee no individual can collect two time tokens for a given interval by holding two accounts. \n 3. **Information Entropy**\n\t Information degradation over time, pseudo accounts in sensitive systems\n 4. **Harmonic Geo-social Systems**\n\t Fair, transparent collaboration through accounting the opinions and desires of participants, including in existing geopolitical \n\nEach module can be used separately or in tandem. This paper invites you to involve any of these ideas into your current and future projects. We will discuss these concepts one at a time, but first let's examine why we need them in the first place. \n\n\n# Why we must grow from web 3 to evolve democracy\n&gt; Provable democracy cannot be fully achieved in web 3 as-is because there is no inherit limit over how many accounts a user may control.\n\n**Democracy** is essentially reaching a consensus with the idea that **each person is equal** in their influence on that consensus within defined bounds.\n\nMany different **consensus models** have been developed in web 3, most notably, [proof of work](https://www.ledger.com/academy/blockchain/what-is-proof-of-work) (**POW**), [proof of stake](https://www.ledger.com/academy/blockchain/what-is-proof-of-stake) (**POS**), and [delegated proof of stake ](https://academy.binance.com/en/articles/delegated-proof-of-stake-explained)(**DPOS**). These paradigms of consensus are used primarily to determine which chain of transaction records (blocks) is considered valid, \"securing\" a blockchain. \n\nPOS and DPOS are additionally used in projects like [**Hive**](https://peakd.com) to allow users to \"vote\" on valuable content, an early example of the democratic web. DPOS is also used for networks to determine who can access network resources, such as in [EOSIO blockchains](https://github.com/EOSIO/Documentation/blob/master/TechnicalWhitePaper.md).\n\nHowever, both of these POS/DPOS use cases (curation and resource allocation) are not democratic in the sense that **each account is not equal**. In both cases, the root of democracy is in the token, not the individual, and the ownership of tokens determines the voting power or computing power held by an individual. \n\nIn the end, the only way to implement true democracy in any system is through giving **each individual equal power**. The only way to do this while keeping web 3's decentralized nature is to implement the technological and idealogical advancements needed for a **one individual,  one account** system. These advancements  are, for simplicity and communication, called web 4. \n\nLet's review the concepts one by one.\n\n___\n# **1**\n\n___\n\n# Time-issued cryptocurrency (Time Tokens) \n\nTime tokens may be offered or directly distributed to users' wallets periodically. They work by hashing a unique personal identifier (address) with a time identifier, **linking each token to a person and a span of time**.\n\n\n## The Gears of Time Tokens\n\nTime tokens rely on the following concepts:\n 1. **Time Tokens** \n\t Individuals may claim time-limited tokens at given intervals, which represent that interval. Only **one time token can represent the one interval and individual**, and one individual can't hold another's time tokens.\n\t These tokens provide the user with a function or action. The action burns the token, which may cause some change in the state of a system, such as minting another token, registering a vote, or any other action. Thus, **each time token is unique yet semi-fungible**. Time tokens can also be checked for freshness when needed, for example a user may have to use a certain time period's token to cast a vote in an election, which SHOULD also exclude that particular time token from all other functions. \n\t \n 2. **Time Unit**\nA time unit is an time interval that is a sub- or superset of a timestamp. This means that a time unit is some amount (or fraction) of seconds. Each time token MUST be the only one in existence stamped with a particular time unit for each user (wallet). \n\n 2. **Time Faucet**\nA time faucet is a smart contract that offers any qualified account EXACTLY one time token per unit of time passed since their last faucet. This can be an active faucet; requiring some action by the recipient, or a passive faucet; automatically sending the cryptocurrency to the user. \n\n 3. **Qualified Accounts**\nQualified accounts adhere to the individuality requirements of a given system. Each web 4 system will do this differently according to their needs, perhaps with a whitelist, social verification, biometric verification, proof of liveness, or other means. \n\n\n## How do Time Tokens work?\nTime tokens operate like non-fungible tokens in their structure, storing a time unit (integer) with a unique user identifier (string) as the payload data. \n\nThe user's identifier may also be a biocryptographic key (biokey) discussed in the next section.\n\nTime tokens are platform independent, and need only the ability to store simple data: a time unit and user identifier. \n\nIn practice, a time unit is an integer that counts up the number of pre-defined time spans that have passed since an **epoch**. The epoch is typically when the system went live, and represents 0 in the first time interval. \n\n## Time Tokens in practice\n\nIf we were to create a time token for a US citizen to vote in the **US presidential election**, the time span would be 126144000 seconds (four years), and the epoch would be at a timestamp representing the start of the **election day previous to the first election** to use time tokens. On election day, an active faucet would send one time token to each registered voter (aka Qualified Account) with a payload of the user's **unique identifier and the integer 1 as the time unit** (the next election would be 2, and so on.) The user would then send the token to the election's smart contract address with a **memo of their vote**. The system would check the identity of the voter, validity of the memo, and the time unit against their list to ensure they are voting in the correct election, **burn the token** (or else reverse the transaction if malformed), and send the user back another token representing a **\"I Voted\" sticker**. \n\n&gt; This example intentionally doesn't account for anonymity\n\n**This example is trivial.** It becomes beneficial when we realize that we can just as easily send the person 12 voting tokens so they can vote on their first, second and third choice. It becomes even more interesting when we send tokens **every month** (or so) and allow the people to **vote directly on the bills that are being presented to their respective legislative bodies**. It becomes even more expansive when we have the faucet smart contract require **educational actions**, such as opening a link to information on these bills (summary and the full text) **to receive their time tokens**. \n\n## A Simple Example in web 2\n\nHere is the minimum information stored in a time token, using [JSON Web Token (JWT)](https://jwt.io/introduction/) as an example\n```\n{\n  \"header\": {\n    \"typ\": \"JWT\",\n    \"alg\": \"HS256\"\n  },\n  \"payoadData\": {\n    \"time-unit\": 294957,\n    \"userid\": \"7f3e873a2c3d\"\n  }\n}\n```\nBelow is a brief pseudocode example of how one could use a signed time token as a JWT.\n\nSee Appendix A for more detailed pseudocode of a time token. \n```\nconst passedBioData = {..} // biodata from user\n\nconst header = {\n        \"typ\": \"JWT\",\n        \"alg\": \"HS256\"\n      }\n\nconst payloadData = {\n\t\"time-unit\": \"294957\", \n\t\"userid\": \"7f3e873a2c3d\", \n\t\"appData\": {\n\t\t\"gold\": 479,\n\t\t\"honey\": 23,\n\t\t\"axe\": 0 \n\t}\n}\n\nconst bioKey = bioKeyGenerator(passedBioData); // Biometric provider's key or one generated direcly by user\n\n// --- Here we have the signature, to be used for any purpose --- \\\\\nsignature = HMACSHA256(\n\tbase64UrlEncode(header) + \".\"+\n\tbase64UrlEncode(payloadData), \n\tbioKey\n)\n\n\nfunction bioKeyGenerator(bioData){\n\t// Function takes data in the form of user input into their browser or smartphone.\n\t// Data is normalized (explained in Appendix A, not shown here)\n\tbioKeyChecked = bioData;\n\t// Return biokey \n\treturn sha256(bioKeyChecked)\n}\n\n\n```\nThe notable parts here are the `time-unit` and `userid` in the payload, and the `bioKey` which is generated by a user's biometric data.\n\nWe have said we web 4 is based on web 3 (blockchain), but this example intentionally used  **web 2 technology**. Much of the rest of this paper goes over ways to avoid trust by incorporating biometric data in a specific way, but that's not always needed, or helpful. We have to trust a government to run our elections. We have to trust social media platforms with our photos. We have to trust the Sun will rise, and a. giant meteor won't crash into Earth. \n\nThe truth is, **all systems have some level of trust**, even if that's just in the system itself. If we try to get rid of this trust by implementing a system so good we are our own private key, it can backfire, and when it does, if we built it because we were fearful instead of trusting, that's super lame. \n\nWhile I'm going to lay out a possible solution to use biometrics in a \"trustless\" way that fits with web 3 ideals, I don't personally think it's a good idea, and I won't be designing my Web 4 apps with it for quite some times, if ever. \n\n___\n# **2**\n\n___\n\n# **Proof of Individuality - Biokeys + Biosecrets**\n&gt; **Please Note:** There are solutions available today (like [FaceTec](https://www.facetec.com/) and [BrightID](https://www.brightid.org/)) that solve the same issues presented here. This paper seeks to outline a web 3-based system (decentralized + open source) that can run without a centralized actor, while not providing specifics to accomplish these goals. This is more of a thought experiment than a suggestion or requirement. \n\n**Biometric secrets (biosecrets)** are akin to any cryptographic private key, but they are your actual biological data, or, more specifically, a four dimensional expression of your humanness from which biometric data is collected. \n\nInstead of a private key generated alongside a public key, **a hash of quantized biometric data becomes your public key**, which is paired with your **actual flesh-and-blood-and-sound-and-movement-data, your private/secret key**, or as we call it \"**biosecret**\" which isn't stored on any server or blockchain. \n\n## Keys  \n1. **Biosecret**: A biosecret is a specific biometric expression that is quantized using cartesian grids into data points with a precision that makes it replicable for the individual in the future, but impossible for another person to duplicate, even an identical twin.\n\n2. **Biokey**: The biometric information that makes up a biosecret is hashed into a public biokey, making the original biometrics practically impossible to reconstruct for a biokey.\n\n\n\n## How this can go wrong\nIn today's biometric space, static images are most commonly used for things like fingerprint and facial recognition, and geometry is the means to compare this data. Biometric secrets generated from static images are not secure, as static images can be faked. [2] Video offers a better solution to this problem, as it is harder to fake, can include audio, and lets developers create a whole new set of algorithms based on a changing stream of data. [Facetec](https://www.facetec.com/) is one company using video for biometric verification. \n\n\n## What could be used to generate a biokey?\nThis stream of data (video + audio biometric expression) could be a user doing a series of hand gestures, singing a part of a song, speaking a phrase, speaking a phrase in different voices, clapping, making a series of facial expressions or movements, or anything else one can imagine.\n\nFor security, biometric expressions (used to make a biokey) must be unique (for example, which combination of words to speak) and many types must be available (gestures, movement, singing, clapping, etc) and used in combination. **If each person's biokey was generated from the same single biometric expression, it would be a matter of time before specific -----> AI !!!  could be developed to deepfake it for anyone**. If the user is the only one that knows their biometric expressions it becomes nearly impossible to guess the type and nature of the expression, and even if that is known, difficult to use the same technique on more than one account. The nature of the uniqueness could be chosen by the user, or generated at random from the biokey software which would prompt the user to complete an action in a specific way. \n\n## Why do we need this, again?\nDemocratic systems certainly are being built without biometric verification, and will continue to be even after suitable biometric technology develops along the open source, client-side requirements. For now, **decentralized solutions** like [Civic](https://www.civic.com/), and centralized tech like [Facetec](https://www.facetec.com/FaceTec_3D_Face_Matching_Whitepaper.pdf) provide the necessary individuality at the cost of trust and requirement of citizenship. Additionally, **biometric data can be avoided entirely** by using a social verification platform like [BrightID](https://www.brightid.org/) As different projects implement web 4 in their own ways, the ideas presented thus far will develop as flaws are found. And there's always the ability to use a whitelist, the most low-tech, high-trust, and simplest solution.\n\n## Trust Issues\nThe biggest issue with biometrics is the lack of trust the general population has (or should have) with giving up their biometric data, including the growing number of facial recognition softwares and databases. The lack of trust is almost always associated with an individual's **lack of clear consent**, and lack of understanding the technology itself. \n\n### To alleviate the trust issue, biokey generators must be: \n1) **open-source**\n2) entirely run on the individual's hardware (**client-side**), and \n3) **not expose any biometric data** to any other users or to a web 4 system itself (the biosecret is never stored or transmitted in any way). \n\nThere will always be **security concerns** with biometrics. For example, if a user uses their biometric secret to unlock their mobile device, another app could be secretly recording the -----> camera !!!  in the background. A person could record them doing their secret, and try to play that video back to the -----> camera !!!  to gain access. Also, *[deepfakes](https://github.com/aerophile/awesome-deepfakes) exist*. These concerns must be addressed before this module of web 4 reaches mass adoption. \n\nThe upside of biosecrets is they **cannot be lost**, and the account will always be **recoverable by the individual**. In a web 4 ecosystem, where the tokens are distributed daily and often spent daily, a hack would be much less catastrophic. The attacker will be able to access the user's balance, but not alter the past transactions, nor continue to collect the future deposits, because the real user will (in theory) quickly recover the account and change the biometric secret generation means so that the hacker's biofake is no longer working. \n\n___\n# **3**\n\n___\n\n##  Information Entropy\nWeb 3 focuses on storing information forever in a provable way. Web 4 introduces a **counter-model** which may be **optionally** adopted by any time-token-based system. In this model, who did what becomes **harder and harder to know** the more time that passes. \n\nThis idea hinges upon incremental time units, the number of which is used to decide how difficult information about a particular individual is to access. This can be implemented by increasing the difficulty required to verify a transaction chain, or economically by increasing the fees associated with accessing or interacting with old transactions or smart contracts. \n\nWith **information entropy**, it is difficult, but not impossible, to piece together a story about an individual user by knowing they are responsible for a set of transactions over time. The further back in time a transaction is, the **harder** it is to link it to another transaction with any **certainty**. \n\n## Information Entropy and Biosecrets\nInformation fidelity requirements can also be degraded over time. For example, when generating a user's biokey, it can be assumed that the more time that passes, the more the biometrics of the individual will change. \n\n### Degradation of Biokeys\n**Biokeys** are generated from a **range of biometric values**. This range of values can be expanded over time based on specific, well researched paths. The effect is, instead of having one hashed biokey for eternity, the generation process will create a set of biokeys from an increasingly **wide range of data**. This concept may be needed to keep people in control of their accounts as they age. There is considerable work to be done to develop this concept, as each data type has its own considerations and complications. \n\nIn this case, as time goes on, someone attempting to prove their individuality would have to spend a lot **more effort** to run the algorithms against their collected biodata, and the data **precision** needed to match the person's identity is actually **lower**. This is one example of **fidelity change**; others can make it more expensive to change a record from the past, make it harder to find out the ID of a voter, or even limit a past state's effect on the future of a blockchain. \n\n## Proceed with Caution \nWhile the inclusion of this concept into web 4 may seem **unnecessary** at the moment, it is another guarantee of the privacy that is needed for many **social applications**. Philosophically, degradation of information also fits in with the general web 4 desire to reflect [systems in nature](https://en.wikipedia.org/wiki/Second_law_of_thermodynamics). \n\nBefore moving on, I do wish to stress the modularity of web 4, and that this (perhaps the most radical idea presented) is not going to fit into every web 4 system, nor should it. This idea will find its usefulness when it is time, and should NOT be adopted without clear reasoning. \n\n\n___\n# **4**\n\n___\n# Geo-Social Systems: Geotribes + Geodomains\n\nThe geo-social systems apt to be improved by web 4 are those which involve **people collaborating**, like government/legislation, food and water management, community projects, education, events, charities, environmental protection and more. Web 4 can also be used by organizations so employees can have a direct say in the actions and direction of their companies and non-profits.\n\nCollaborative geo-social systems are always happening everywhere humans live. Currently, we are collectively deciding what direction we should be moving as a society, from representative governments, to social media. However, human growth in the past few centuries has been focused on technological improvements rather than social improvements. [3] To harness the power of the information age for the collaboration of humans, web 4 should be used to enhance, introduce, and replace current structures that organize our societies. \n\n&gt; Web 4 proposes that systems based in time token are the most apt to create and improve existing social layers. \n\n## What is a Geo-Social System?\n\nA geo-social system is something that affects people (**social**) at a given bounded area (**geo**). To refer to a group of people associated with a certain area, we'll call them a **geotribe**, and to refer to that area we'll call it a **geodomain**. \n\n## Concepts\n\n1. **Geodomain**: A bounded area that has an associated group of people who are running a democratic (web 4) system. \n\n2. **Geotribe**: The group of people associated with a geodomain that are participants in a web 4 system.\n\nGeodomains can be nested, with a finite set of smaller areas making up the larger area, common in geopolitics, but this is not required. Geodomains can also be overlapping or non-overlapping.\n\n\n## Creating Geo-social Systems\nTo create a geo-social system, we first must define the requirements of the geodomain, and then the requirements for an individual to be a part of the geotribe within that geodomain. \n\n### Geodomain Stratification  \nAcross the globe, **one geopolitical pattern** seems to emerge, though names vary. Cities are within Counties, are within States, are within Nations, are within the World. \n\n1. Cities (aka Towns, Commonwealths, etc.)\n2. Counties (aka Divisions\n3. States (aka Districts, Provinces)\n4. Nations (aka Countries, States, Republics, etc)\n5. Global\n \n&gt; Additionally, a **community level** may be added within cities to further add accuracy and usefulness. \n\nUsing this existing geopolitical stratification is recommended for those wishing to build a web 4 system because it makes varying global systems easily storable in a one relational database model or similar data structure, and is understood by local people, governments, etc. \n\nOnce we have our geodomains, we must define what makes a geotribe.  \n\n### Geotribal Bonds\nTraditionally, it's the existence within a certain area, such as a place of residence or business, that is of importance for things like taxes, voting, and citizenship. When building a geo-social system, it's only necessary that an association is declared that is relevant for that system, which may or may not involve proving residency. \n\nIt is important for every system that each individual only exist within one geotribe (excluding those extrapolated) so that their vote isn't counted twice. \n\nWhen using stratified geodomains, such as geopolitically-based ones, only the deepest level of association is needed (city/community), from which the rest can be extrapolated.\n\nIf a geopolitically-based geodomain system allows geotribe members to declare their own associated location without proof, the member is incentivized to be honest, as they will receive the most benefit from having their opinion heard where it matters to them. \n\nAll \"non-proof\" systems should place restrictions on switching voluntarily-given geodomain association too often (such as once per 6 months) to prevent influencing foreign affairs. \n \n\n# High-Fidelity Democracy \n\nBy offering time tokens to the individual that correspond to each stratum we can create **high-fidelity democratic systems** that better represent each and every person's desires. We can know exactly what the people want, with no guesswork and 0 middlemen, in a very short period of time. \n\nFor example, a person may be given 12 time tokens per month at each stratum to vote on the initiatives that they would like to see passed. They may vote all 12 tokens for an initiative they are most passionate about, or 1 token to 12 different initiatives (or 2 to 6 initiatives, etc). By collecting and counting these tokens, the governing body can **know exactly what their constituents want**, without the direct need to elect a representative who only estimates these desires. \n\nThe democratic system described in this paper does not solve all problems, as there are still issues of voter informedness, unseen actors, and more, but it is a skeleton to build a collaborative social system that are an **improvement to the representative governments** which were once as revolutionary as these ideas are. \n\n\n# Roadmap to Web 4 Reality\n\n## **Phase One**\n&gt; Implementing time tokens\n\n**Time Tokens** are implemented on any and all blockchains where developers see the value. These developers provide open-source instructions and tools to helps other developers incorporate time tokens into their applications. \n\n**Provable individuality** for Time Tokens is up to each application and blockchain, and these application can choose to ignore this requirement, risking their systems' integrity. **Federated** (Facetec) and **decentralized** (Civic) options may be used, and so can social verification (BrightID).\n\n**Information entropy** and **geo-social systems** are starting to be theorized, but not showing up. \n\n**Phase 1 Action Points**: \n- Time Token ERC proposal on Ethereum (and similar for other blockchains)\n- Developers exploring use cases for Time Tokens \n\n\n## **Phase Two**\n&gt; dApps and discovering issues\n\n**Applications using Time Tokens** are widespread, and issues in implementations are becoming known and solved. Developers who open time token faucets are seeing their token be used in third-party apps in ways they didn't foresee. \n\n**Provable identity issues** are becoming apparent, as certain applications with **lax rules** are being manipulated, showing the need for true provable identity. The best solutions are becoming known alongside the problems.\n\n**Information entropy** principles are starting to be implemented, when required.\n\n**Geo-social systems** are starting to be built, but not used for \"real applications\" like running a government because of lack of true provable individuality, and social inertia.\n\n**Phase 2 Action Points**: \n- Proposing the best uses for geo-social systems using time tokens\n- Incorporating different provable identity methods\n- Developers implementing Time Token in unexpected ways\n\n## **Phase Three**\n&gt; Implementing Provable Identity\n\n**Provable Identity** is now possible as suggested in this manifesto through the maturity of the biometric secrets. Standards are being created openly, or, it is decided that the way presented here is not needed as a better way is found.\n\n**Geo-social systems** are being used to run and govern communities which are not dependent on traditional representative government. Existing governments are adopting time tokens to get a better read on what legislation the people want. \n\nOrganizations of all sizes are using time tokens to shift power to employees. \n\n**Phase 3 Action Points**: \n- Picking provable identity solutions that satisfy all requirements\n- Possibly abandoning biometric system presented here\n- Communities running on web 4\n- Governments benefiting from web 4\n- Organizations using web 4\n\n## **Phase Four**\n&gt; Geo-social systems\n\n**Information entropy** is added to the systems where it can be of use. For example, this could make a person's (anonymous) voting record less knowable over time by increasing the amount of CPU time needed to associate one vote with another. \n\n**Geo-social systems** are being used as a replacement for representative government where it is the will of the people. Voter informednes", "link": "https://www.reddit.com/r/Futurology/comments/k1wk4y/thanks_for_your_feedback_on_my_web_4_concept/"}], "name": "Subreddit_Futurology_01_01_2020-30_12_2020"}