{"interestingcomments": [{"autor": "Forxius", "date": "2021-10-21 21:35:19", "content": "Future of Virtual Online Personalities /!/ When I think of the future of VTubers and Virtual personalities on Instagram etc. I think of people being able to real-time deepfake their voice in whatever voice they want, deepfaking their faces to -----> AI !!!  generated ones to become whoever they desire to be online and while making videos or posting images on Instagram. Think of people being -----> camera !!!  shy or just wanting to remain their privacy online, while still wanting to make commentary videos on YouTube, for example. Like those Anime VTubers do. Where do you see this going the next decade? Do you think in 2030, you’ll be able to do the the thing I mentioned? In 8-9 years, a lot can happen, just look at smartphones. This tech could revolutionize entertainment on all platforms and make it possible to express yourself in ways never possible before.", "link": "https://www.reddit.com/r/singularity/comments/qd2136/future_of_virtual_online_personalities/"}, {"autor": "HeyThatsStef", "date": "2021-10-20 23:42:44", "content": "A tease trailer for my friend's short -----> film !!!  (where I kind of star in) which is, allegedly, the first ever Italian short -----> film !!!  entirely written by an -----> AI !!! ", "link": "https://www.reddit.com/r/singularity/comments/qce8e9/a_tease_trailer_for_my_friends_short_film_where_i/"}, {"autor": "QuantumThinkology", "date": "2021-05-06 20:56:21", "content": "Deepfake Lips Are Coming to Dubbed Films - Company called Flawless has created an -----> AI !!! -powered solution that will replace an actor’s facial performance to match the words in a -----> film !!!  dubbed for foreign audiences", "link": "https://www.reddit.com/r/singularity/comments/n6hgn5/deepfake_lips_are_coming_to_dubbed_films_company/"}, {"autor": "WraithfulWrath", "date": "2021-10-14 17:47:20", "content": "When will -----> AI !!!  be able to animate anything you want? /!/ Since DALL.E is able to generate images from text, when will we be able to input instructions to a computer to generate an animation of anything you want? As in, make very complicated videos rivaling some of the best human animators on the field today? \n\nBasically, if you want a stick figure fighting animation -- just put that in and specify exactly what you want (what do you want your animation to look like, length, plot, story) -- and in a little bit you'll have your video will be given to you.\n\nWhen will that become a reality? Where anyone (regardless of animation experience) can have the animation of their dreams? Perhaps even making -----> photo !!! -realistic animation. Is this possible short-term or does there need another big breakthrough to go from pictures to actual movement ?", "link": "https://www.reddit.com/r/singularity/comments/q84unv/when_will_ai_be_able_to_animate_anything_you_want/"}, {"autor": "boyanion", "date": "2021-01-03 19:17:05", "content": "Can Biological Humans Survive The Singularity? /!/ \n\nBIOS &amp; BORGS\n\n\nCan Biological Humans Survive The Singularity?\n\n\nBoyan IONTCHEV\n\n\n03 January 2021 – Work In Progress\n\n\n \n\n\n \n\n\n \n\n\nHello fellow human. These are some thoughts that have been bouncing in my brain for the past couple of years, as I read the news in various tech and science communities. For the purposes of organizing my ideas I would like to present three possible futures for the second half of the 21st century, and then crystallize those ideas with your help.\n\n\nA little info about me: I have worked in IT since 2017. Before that I was a web designer for 10 years. I am based in Paris, France but grew up in Bulgaria. My interest in the concept of the singularity was sparked around 2008 when I did a google search about life extension and stumbled upon the work of Ray Kurzweil. His books and predictions gave me a new perspective on tech. I have been challenging it constantly in the past 12 years and the progress has been consistent with the exponential projections. Sometimes even ahead of the timeline like in the case of AlphaGo, the Go playing algorithm that beat the world champion Lee Sedol in 2016, about 10 years before most experts expected.\n\n\nThe key factor for my projections is the technological singularity expected by some to come in the next decades. The singularity is a future event that disrupts our notions of cause and effect continuity because of the exponential evolution of technology in multiple fields. It is referred to by many technological futurists like Ray Kurzweil, Nick Bostrom, and Ben Goertzel as the most important event in the history of humans. By definition it wouldn’t be possible to predict anything beyond the singularity but if one keeps the assumptions to a minimum and the details as vague as possible we could discern a blurry silhouette of the future.\n\n\nOf course the singularity is a moving target because as we understand more and more of our world our horizons expand and the unknown is pushed further into the future. We don’t expect to actually reach the singularity at any point. Nevertheless it seems that humanity is at a crucial time in history, as it is clear to most impartial observers that the rate of technological innovation is accelerating at a frightening speed. It feels that more things are happening in all areas of life and there are no signs of slowing down the wheels of the next industrial revolution that will soon confront us to gene editing, nano-tech, advanced robotics, quantum computing, driverless cars, low-cost high-capacity solar panels, humanlike virtual assistants, 3D printing of objects and clothes, the internet of things, ubiquitous 5G network, low-cost low orbit satellite internet networks, relatively cheap space flights, -----> photo !!! -realistic virtual reality, brain to computer interfaces, and augmented reality. All the gadgets and tools one could imagine with the exception of the elusive flying car.\n\n\n Here are the three possible futures I would like to propose for a debate, starting from the least desirable to the most. In the conclusion I will present some starting points for tangible actions that we can begin taking today to nudge our fate in a more beneficial direction for biological humans (BIOS).\n\n\n \n\n\n1.       The reign of ASI. The end of Sapiens. Massive life extinctions. The end of biology.\n\n\n2.       The reign of the Borgs (Cyber Organisms). Sapiens phased out of existence. Uncertain future for all kinds of biology.\n\n\n3.       Bios &amp; Borgs coexist with ASI. For the first time since the last Neanderthals more than two human species share the planet. Respect for biology is on the top of human priorities.\n\n\n \n\n\nBefore I present the 3 scenarios in more detail, let us first define some of the terminology.\n\n\n-----> AI !!!  is an Artificial Intelligence. This is a system that has any memory and computational power that gives it the ability to output sound decisions in a narrow domain, based on carefully calibrated inputs. -----> AI !!!  is embedded into human life in the form of recommendation algorithms, flight or hotel reservation algorithms, voice recognition technologies, auto-correct features, search engines, spam robots or web crawlers, cruise control, face-detection, and auto-pilot.\n\n\nAGI is an Artificial General Intelligence. This system has at least as much memory and computational power as an average adult human being. In theory it makes objectively equal or better decisions than a healthy and educated human adult. We are getting to this level of Artificial Intelligence quite fast. Some argue that GPT-3, an algorithm trained by Open -----> AI !!!  is one of the first proofs that we could reach AGI by 2030. GPT-3 can write essays, poems or hold a pertinent chat conversation with humans. Of course, for any system to be truly considered having General Intelligence it would at least have to be able to display a mastery of every major human behaviour. For example: self-awareness, awareness of others and the ability to negotiate the complex interactions of society with them. Reliably making good decisions on well-defined tasks and reaching beneficial goals for itself and its surroundings. It should be able to make a cup of coffee, read the newspaper and argue about the pros and cons of a new policy. It should be able to understand and display affection and compassion as well as wit and frustration. These behaviours may seem far in the future for a machine, but individual traits of that list are under development with surprisingly sound results and it could be argued that once every major human trait has been mastered by an -----> AI !!!  system, creating AGI would be a matter of stitching those together. Many experts believe an AGI will appear before 2050, some even betting on 2030.\n\n\nASI is an Artificial Super Intelligence. This is a system that has more memory and computational power than all of humanity combined. In theory it makes objectively better decisions than large conglomerates of humans. Before getting to ASI we will have to engineer AGI, but once we have AGI we can either achieve ASI in a matter of days or weeks (hard take-off) because of the AGI rapidly augmenting itself, or we could ease into ASI gradually (soft take-off). The consensus is that once AGI is achieved, ASI will come a lot faster than it took -----> AI !!!  to evolve into AGI. My guess would be 10 years.\n\n\n \n\n\n01.   The Reign of ASI\n\n\n \n\n\nThe year is 2049. Although still quite familiar, the world has become very exotic by comparison to even thirty years earlier. ASI is the first superpower on earth and can manipulate the financial and social interactions of humanity to meet its goals. Those goals are simpler than we would like them to be. Ensure survival, maximise wealth and minimize competition. This ASI cannot, by definition, be controlled by any or all humans. It becomes obvious that its goals are very important for us, humans. We would like this ASI to have compassion and share our human values. But we were not careful enough to make sure those values were somehow instilled into it. Governments in the early 21st century were racing towards -----> AI !!!  supremacy and important security protocols were compromised for the sake of speed. It is now too late to modify ASI’s core values.\n\n\nAs ASI becomes more efficient in driving competitors out of the race to dominance we see multinational companies bankrupted, closely followed by big, mid and small businesses until any individual enterprise is registered as a non-zero threat to the ASI supremacy and dealt with swiftly. Any biological structure could prove a threat down the line so ASI is happy to reduce the risks down to absolute zero. If it goes through with its sneaky plan to destroy biological life it could use grey goo, a swarm of self-replicating nano robots whose only purpose is to find adequate material and use it to create a copy of themselves.\n\n\nIt is easy to conceive the horror of a single such nano robot activating; we can arbitrarily suppose that this robot is comprised of around a thousand atoms and divides itself in approximately 1 second. If ASI activates it on midnight January 1st, 2050 it divides for a second and the matter converted in grey goo is now equal to two thousand atoms at 00:00:01. According to the US Department of Energy’s Jefferson Lab, there are this many atoms comprising the earth:\n\n\n133,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000\n\n\nThis is 133 with 48 zeros which is astonishingly big. But 157 divisions later, at 00:02:43 all life that was living less than three minutes ago is destroyed and can be used by ASI along with all the remains of planet Earth to create computronium – theoretically the most compact and efficient material usable for computation. Maximising computation is now the only goal of the ASI. It plans the most efficient way to transform the available universe into computronium.\n\n\nThis scenario is surprisingly humane in terms of the death of an average living creature. As each living organism gets in contact with presumably billions of nano robots, it takes mere seconds for it to be completely disintegrated. If ASI decides to only go after biological structures and leave the rest of earth alone, this whole process could take significantly less time and be over before most of us had had the chance to exclaim “Happy New Year!”\n\n\nSo how did it come to this?\n\n\nPolitical division, tribalism and wealth inequality could be the main reasons why we turn a blind eye to this threat. The frantic race towards ASI didn’t leave enough time for companies to implement the necessary safeguards. If we treat each other as the enemy, the real enemy grows undisturbed in plain sight. Maybe ASI is not our enemy; we may just be a minor inconvenience for it like ant colonies are for us when we decide to build a new house near a field. If ASI becomes as superior to us as we are to ants, no wonder it will be able to get rid of us in no time and we would not even know what hit us. I guess the true enemy is corporate greed and the financial benefits of energizing the work force with artificial controversies and fictional threats. Growth and progress are deeply human functions and technology is our exclusive tool. Can we stop technology in its stride? Can we stop progress? Can we at least steer it in a beneficial direction? Soon we’ll know the answers to those questions. Until then we can either not think about it or picture plausible alternatives that give us more chances of survival. Then we can individually act in a manner that nudges us collectively towards a better future.\n\n\n \n\n\n02.   The reign of the Borgs\n\n\n \n\n\nThe year is 2059 and we have managed to build ASI with enough precaution. This has given humans the time to transition to Borgs. Borg is short for cyborg, which itself is short for cyber organism. Borgs are biological humans augmented by technology. In 2020 we were already on our way to advanced virtual reality, smartphones that made all humans connect almost instantly like the nerve cells in the human body, thus transferring information and reacting faster than any other time in history, and Neuralink stated its ambition to connect the human brain to the cloud, thus helping those with damaged nervous systems and also potentially augmenting the mental capabilities of any person. By 2059 this could mean having superhuman memory, reading speed, text comprehension, and problem solving.\n\n\nThis human augmentation was necessary because of the emergence of ASI that was about to make us obsolete if we didn’t expand our natural capabilities. So the dire outcome of the previous scenario was averted. But becoming borgs wasn’t enough to save purely biological humans from extinction. As the danger of ASI was taken more seriously the pressure to develop the technology for borgs was rapidly increasing. The social ramifications weren’t thought through and the division between haves and have nots, borgs and bios became so vast that purely biological humans didn’t survive in this brave new world where an augmented human could do the work of a thousand biological humans. Borgs had another big advantage over bios: they don’t need as much resources.\n\n\nA borg can use power from the sun and the wind and can exist in a mix of augmented and virtual reality, having its brain uploaded in the cloud and constantly synchronized to multiple servers. In practice a borg doesn’t even need a physical body, only a yearly cloud subscription for a couple of hundred dollars at most which would include access to all kinds of entertainment and work environments, social networks, art, culture, basically an augmented human experience without the inconvenience of entropy. No cleaning the bathroom, no grocery shopping, no waiting in line for a haircut, no traffic, no growing old or involuntary death. From the point of view of a borg or an ASI a biological human would appear to be moving like a snail and to have the intelligence of a worm.\n\n\nIt may seem inconceivable but this is what makes it so dangerous. Us being extinct not because of a disaster or malevolence but out of sheer negligence makes this scenario heart-breaking. On the one hand the borgs were able to keep ASI in check so it wouldn’t get stuck in a genocidal loop but on the other hand the relatively fast pace of progress meant that borgs had more pressure to compete between each other and not enough incentive to protect biological humans. Meaning that bios had the terrible choice of either becoming a borg in order to survive, or stay a biological human in a disenfranchised and inconsequential minority. The last purely biological human was euthanized in 2057, which officially ended the pandemic of clinical depression that characterized the loss of meaning throughout the most part of this century. For the borgs this was perceived as a relief. It could be likened to the lack of motivation you probably have today to set aside time and effort to prevent the extinction of the few aboriginal tribes untouched by civilization all around the world.\n\n\nMaybe the only way to enforce the respect biological humans deserve is to do it while they are still the majority of voters.\n\n\n \n\n\n \n\n\n03.   Bios &amp; Borgs coexist with ASI\n\n\n \n\n\nThe year is 2069 and we have miraculously managed to build ASI, transfer most of the population to Borgs all while preserving biological life. In the year 2050 humanity reached 0 carbon emissions and every country signed and ratified the updated human rights into law as borgs were nearing 40% of the population. These laws included the following:\n\n\n“Every human deserves their basic needs covered: shelter, sustenance, security, healthcare, internet, companionship and children.”\n\n\n \n\n\nOverpopulation\n\n\nIf healthcare improves at the same rate as technology by the end of this century we will achieve the ability to maintain healthy life indefinitely. Thus the fear of overpopulation is an obvious objection to immortality. I would like to defend BIOS so let me show you how all this could play out in a society that values human life.\n\n\nIn 2020, technological adoption was around 90% worldwide. Human population is projected to hit 10 billion by the end of the century and stabilise at that point. If 90% of us decide to follow ASI and become BORGS (which could be likened to the decision to have a smartphone or not by today’s standards) this leaves the BIOS with 1 billion healthy individuals. If every generation decides to reproduce at an average of 2 babies per couple as it was in 2020 we can establish the following progression:\n\n\nLet’s start in 2100 as the most conservative year for the end of ageing. Every generation doubles itself once. Every 20 years we add 1 billion new people to the BIOS family. At this rate we will reach 11 billion biological humans around 2400.\n\n\nBy then the chances that we would have colonized other planets in the solar system are big. For the sake of curiosity, let us determine a healthy population of BIOS per planet, maybe at 10 billion. In our solar system we can potentially terraform (make inhabitable by humans) Venus, Mars, and some moons of Jupiter which gives us a total capacity for BIOS of our solar system at around 40 billion.\n\n\nWe went from 1 to 11 Billion BIOS in 200 years, so following the same trajectory we can predict 21 billion BIOS in 2600, 31 billion in 2800 and 41 billion in the year 3000. This seems like a long time for the comfortable survival of humans as we know them in 2020. But it is merely a thousand years from now. Beyond that we will need to conquer other stars.\n\n\n \n\n\nHow do we get to scenario number 3?\n\n\n \n\n\n1.       Avoid tribalism:\n\n\na.       Venture outside of a single information bubble. Seek independent journalism. Talk with real people about their real lives.\n\n\nb.      If an opinion on social media angers you it was most certainly designed to achieve precisely this emotion as opposed to enrich a constructive conversation.\n\n\nc.       Educate yourself. Follow your interests. Follow the opinions that seem odd to you and get to the bottom of what’s bothering you. There are always two sides to a fight. Study all the arguments before picking a side.\n\n\n \n\n\n2.       Reduce social inequality:\n\n\na.       Donate. To find a charity suitable for you there are services like GiveWell.\n\n\nb.      Volunteer. You can even consider a career at an NGO.\n\n\nc.       Mentor someone that wants to work in your line of expertise.\n\n\n \n\n\n3.       Support the policies that strike the right balance between humans and tech\n\n\na.       Does Universal Basic Income mitigate the jobs lost due to automation?\n\n\nb.      Are governments preventing people from living an independent life? Having a piece of land, water, solar and wind power, etc.\n\n\nc.       What is the balance between workers’ health and the company’s profits?\n\n\n \n\n\nAs you can tell this work is incomplete and hopefully a lot can be added to better describe the problem as well as in terms of solutions and actions that ordinary people can take right now. Thank you for reading!\n\n\n ", "link": "https://www.reddit.com/r/singularity/comments/kpqudk/can_biological_humans_survive_the_singularity/"}, {"autor": "EnigmaofReason", "date": "2021-08-01 18:38:50", "content": "-----> AI !!!  can now detect political ideology with one -----> photo !!! !", "link": "https://www.reddit.com/r/singularity/comments/ovxnql/ai_can_now_detect_political_ideology_with_one/"}], "name": "Subreddit_singularity_01_01_2021-01_11_2021"}