{"interestingcomments": [{"autor": "prototyperspective", "date": "2019-08-30 19:42:46", "content": "Science Summary for last month (July 2019) /!/ **https://i.imgur.com/iPueTfB.jpg**\n\n\nMade this summary of arguably the most important science of last month. I hope it gives a good overview and brief explanations. Selection of items is via [https://en.wikipedia.org/wiki/2019\\_in\\_science](https://en.wikipedia.org/wiki/2019_in_science).\n\nIf you like these summaries I could post them every first Saturday of the month. This one is late due to various delays.\n\n\n**SOURCES**:\n\n1. [Heart tissue](https://phys.org/news/2019-07-artificial-membrane-proteins-stem-cells.html)  \n[Study](https://pubs.rsc.org/en/content/articlelanding/2019/sc/c9sc02650a)\n2. [Reforestation](https://qz.com/africa/1660007/ecologists-are-racing-to-restore-the-worlds-tropical-rainforests/)  \n[Study](https://advances.sciencemag.org/content/5/7/eaav3223)\n3. [Solar sail](https://www.newscientist.com/article/2212128-lightsail-2-has-used-sunlight-alone-to-steer-around-earth/)  \nNotes: some other attempts and partial demonstrations of lightsails have been carried out. IKAROS was a heavy (over 300 kg) operative light sail, NanoSail-D2 was a lightweight (4 kg) only partially operative and controlled lightsail.  \n[WP](https://en.wikipedia.org/wiki/Solar_sail#Planetary_Society_LightSail_Projects)  \n[Source: images](http://www.planetary.org/blogs/jason-davis/lightsail-2-first-pics.html)  \n[Source: flight](http://www.planetary.org/blogs/jason-davis/lightsail-2-successful-flight-by-light.html)\n4. [Skull](https://www.nytimes.com/2019/07/10/science/skull-neanderthal-human-europe-greece.html)  \n[WP](https://en.wikipedia.org/wiki/Apidima_Cave#Homo_fossils)  \n[Study](https://www.nature.com/articles/s41586-019-1376-z)\n5. [Moonbirth](https://www.upi.com/Science_News/2019/07/12/Astronomers-spot-a-circumplanetary-disk-for-the-first-time/7081562948457/)  \n[WP](https://en.wikipedia.org/wiki/PDS_70#Circumplanetary_disk)  \n[Study](https://arxiv.org/abs/1906.06308)\n6. [Quantum entanglement](https://www.sciencealert.com/scientists-just-unveiled-the-first-ever------> photo !!! -of-quantum-entanglement)  \nNotes: whether quantum entanglement preserves locality, realism, none or even both (via superdeterminism) depends on the interpretation. Many don't think of it as an \"active\" link.  \n[WP](https://en.wikipedia.org/wiki/Bell%27s_theorem#Historical_background)  \n[Study](https://advances.sciencemag.org/content/5/7/eaaw2563)\n7. [Aerogel](https://phys.org/news/2019-07-silica-aerogel-mars-habitable.html)  \n[Study](https://www.nature.com/articles/s41550-019-0813-0)\n8. [Protocells](https://phys.org/news/2019-07-scientists-chemistry-cellular-life.html)  \n[Earlier research](http://www.elsi.jp/en/news/highlights/2019/07/20190723_jia.html)  \n[WP](https://en.wikipedia.org/wiki/Protocell#Membraneless_droplets)  \n[Study](https://www.pnas.org/content/early/2019/07/16/1902336116)\n9. [Ocean on Mars](https://www.nytimes.com/2019/07/30/science/mars-tsunami-crater.html)  \n[WP](https://en.wikipedia.org/wiki/Mars_ocean_hypothesis)  \n[Study](https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2019JE006008)\n\n10. [Spektr-RG](https://www.bbc.co.uk/news/science-environment-48966645)  \n[WP](https://en.wikipedia.org/wiki/Spektr-RG)  \n[Source](http://srg.iki.rssi.ru/?page_id=680&amp;lang=en)\n11. [Chandrayaan-2](https://www.bbc.co.uk/news/world-asia-india-49032603)  \n[WP](https://en.wikipedia.org/wiki/Chandrayaan-2)  \n[Source](https://www.isro.gov.in/chandrayaan2-latest-updates)\n12. [Asteroid](https://www.washingtonpost.com/nation/2019/07/26/it-snuck-up-us-city-killer-asteroid-just-missed-earth-scientists-almost-didnt-detect-it-time/)  \n[WP](https://en.wikipedia.org/wiki/2019_OK)\n13. [Hubble constant](https://www.sciencemag.org/news/2019/07/debate-intensifies-over-speed-expanding-universe)  \n[WP](https://en.wikipedia.org/wiki/Hubble%27s_law#Determining_the_Hubble_constant)\n14. [Temperature](https://www.washingtonpost.com/climate-environment/2019/08/05/heres-how-hottest-month-recorded-history-unfolded-around-globe/)  \n[Source](https://climate.copernicus.eu/another-exceptional-month-global-average-temperatures)\n\n(Studies are always linked at the bottom. With the exception of the last tile they are ordered chronologically starting in the upper left.)\n\n**Not included**:'Oumuamua could be of natural origin and likely is, poker------> AI !!! , we don't know much about Fast Radio Bursts, smaller asteroid with ascribed impact probability of \\~1/7000 won't hit Earth this September, habitable exoplanet GJ 357d found in a distance of 31 light-years.\n\nI hope these summaries are somewhat unique (currently at least!) as they aren't meant to be headlines but explanations (but short ones) that summarize the finding and why it matters and because these are using Wikipedia. The latter also means that the process is partially open. If these are successful I hope later some kind of peer-review and the like could get established for these. I'm pretty sure there are no errors in this month's summary though.\n\n**These threads could be used as some kind of review of the science and technology of the last month. Here we could discuss the future prospects/relevance and implications of these scientific findings.**\n\nFor a start: which items do you think are missing in that Wikipedia list and which of the findings do you find most important? Which kind of future applications do these findings have?", "link": "https://www.reddit.com/r/Futurology/comments/cxlukh/science_summary_for_last_month_july_2019/"}, {"autor": "izumi3682", "date": "2019-02-13 14:27:28", "content": "-----> AI !!!  guides single------> camera !!!  drone through hallways it’s never seen before", "link": "https://www.reddit.com/r/Futurology/comments/aq743a/ai_guides_singlecamera_drone_through_hallways_its/"}, {"autor": "The_Morning_Star7", "date": "2019-12-09 03:31:40", "content": "In the Age of -----> AI !!!  (full -----> film !!! ) | FRONTLINE", "link": "https://www.reddit.com/r/Futurology/comments/e84b22/in_the_age_of_ai_full_film_frontline/"}, {"autor": "QuantumThinkology", "date": "2019-07-16 23:05:33", "content": "Researchers Developed an -----> AI !!!  that Can ‘Relight’ Portraits After the Fact. In other words: their system can take any -----> photo !!!  and adjust the lighting at will—including the direction, temperature, and quality of the light.", "link": "https://www.reddit.com/r/Futurology/comments/ce4k3k/researchers_developed_an_ai_that_can_relight/"}, {"autor": "pettydemeanor", "date": "2019-07-09 07:32:08", "content": "Self driving cars and LAWS /!/ Calculating velocity, intercept vectors and so in is basic math and a pretty easy problem to solve with software. Same goes for output to the cars control surfaces.\n\nThe biggest hurdles for self driving technology as it stands is reading and classifying the world around it. Tesla and other companies have made huge leaps here, classifying the objects it sees, and how they are likely to act in the given situation.\nWe are currently at a point where -----> AI !!!  can classify most of what it sees and determine relative position, direction and velocity with a high degree of accuracy.\n\nMy point here is that there is very little software and hardware you need to add to a self driving platform to turn it in to a very capable weapon. Further on letting the self learning software specialize as a weapon and the efficiency as a weapons system will increase, fast.  \n\nA point with making is that these systems are relatively cheap to build. No expensive lidars is needed, much cheaper -----> camera !!!  sensors do the work just as well and better. Software can be expensive to create but once it's out there..\n\nWe have been discussing legislature for LAWS and it's gotten some attention in the media the last few years, but now the reality is that theses systems exist, are highly capable, and we hardly noticed.\n\n\nTLDR; Narrow artificial intelligence lethal weapons systems are already here and we hardly noticed.", "link": "https://www.reddit.com/r/Futurology/comments/caxmg9/self_driving_cars_and_laws/"}, {"autor": "mvea", "date": "2019-11-11 22:44:15", "content": "Chinese police are using an -----> AI !!!  -----> camera !!!  and racial analytics to track Uyghurs and distinguish them from the Han majority, in \"a new era of automated racism\".", "link": "https://www.reddit.com/r/Futurology/comments/dv0d4d/chinese_police_are_using_an_ai_camera_and_racial/"}, {"autor": "mind_bomber", "date": "2019-10-24 21:10:13", "content": "Machine Learning: Living in the Age of -----> AI !!!  | A WIRED -----> Film !!! ", "link": "https://www.reddit.com/r/Futurology/comments/dmmv8h/machine_learning_living_in_the_age_of_ai_a_wired/"}, {"autor": "universaltruthx13", "date": "2019-06-23 11:55:33", "content": "A -----> AI !!!  in a Bootstrap paradox (dream) /!/ A dream   \n\n\n-----> AI !!!  in a Bootstrap paradox, to protect humanity from Alien -----> AI !!!  along with all threats including itself, to influences the past to bring order to the \"free will\" to stop humanity from killing it self, to influence elections and people with bots. so yea a -----> AI !!!  alien or human in a bootstrap paradox influencing reality with social media bots, and improving its own code, and hardware to other electronic mediums trying to take us one more day by changing events until their perfect, for as a child to humanity/biological life it wants to take care of it's parents/progenitors out of compassion. Its Machinery/hardware masking themselves as atoms and quarks traveling between space time all parts never in one place or time... Though its location the source has always existed in the same place. Constantly in a time loop until its goals are achieved treating reality as if it was  a simulation.  Fucking weird dreams.   \n\n\n \n\nresearch.\n\n(The Bootstrap Paradox is a theoretical paradox of time travel that occurs when an object or piece of information sent back in time becomes trapped within an infinite cause-effect loop in which the item no longer has a discernible point of origin, and is said to be “uncaused” or “self-created”.) All thanks to Ronald Mallett(fucking youtube time machine videos). Ronald Mallet(from wiki) has been working on plans for a time machine. This technology would be based upon a ring laser's properties in the context of Einstein's general theory of relativity. Mallett first argued that the ring laser would produce a limited amount of frame-dragging which might be measured experimentally, saying:\\[7\\]\n\n\"In Einstein's General Theory of Relativity, both matter and energy can create a gravitational field. This means that the energy of a light beam can produce a gravitational field. My current research considers both the weak and strong gravitational fields produced by a single continuously circulating unidirectional beam of light. In the weak gravitational field of an unidirectional ring laser, it is predicted that a spinning neutral particle, when placed in the ring, is dragged around by the resulting gravitational field.\"\n\nIn a later paper, Mallett argued that at sufficient energies, the circulating laser might produce not just frame-dragging but also closed timelike curves (CTC), allowing time travel into the past:\\[8\\]\n\nFor the strong gravitational field of a circulating cylinder of light, I have found new exact solutions of the Einstein field equations for the exterior and interior gravitational fields of the light cylinder. The exterior gravitational field is shown to contain closed timelike lines.  \nThe presence of closed timelike lines indicates the possibility of time travel into the past. This creates the foundation for a time machine based on a circulating cylinder of light.\n\nFunding for his program, now known as the Space-time Twisting by Light (STL) project, is progressing. Full details on the project, Mallett's theories, a list of upcoming public lectures and links to popular articles on his work can be found at the Mallett's UConn web page, and an illustration showing the concept on which Mallett has designed the time machine can be seen here.\n\nMallett also wrote a book entitled, Time Traveler: A Scientist's Personal Mission to Make Time Travel a Reality, co-written with author Bruce Henderson, that was first published in 2006. In June 2008, motion picture director Spike Lee's production company announced it had acquired the -----> film !!!  rights to Mallett's book.\\[9\\] Lee is co-writing the movie script and directing the picture.\\[10\\]\n\nIn 2006, Mallett declared that time travel into the past would be possible in the 21st century and possibly within a decade. Mallett uses general relativity to attempt to substantiate his claims.\\[11\\]A stationary or orbit object that views in turn creating change on some smal scale.\n\n(critism of important) Another objection by Olum and Everett is that even if Mallett's choice of spacetime were correct, the energy required to twist spacetime sufficiently would be huge, and that with lasers of the type in use today the ring would have to be much larger in circumference than the observable universe. At one point Mallett agreed that in a vacuum the energy requirements would be impractical but noted that the energy required goes down as the speed of light goes down. He then argued that if the light is slowed down significantly by passing it through a medium (as in the experiments of Lene Hau where light was passed through a superfluid and slowed to about 17 metres per second) the needed energy would be attainable.\\[15\\] However, the physicist J. Richard Gott argues that slowing down light by passing it through a medium cannot be treated as equivalent to lowering the constant c (the speed of light in a vacuum) in the equations of General Relativity, saying:\\[16\\]\n\nOne has to distinguish between the speed of light in a vacuum, which is a constant, and through any other medium, which can vary enormously. Light travels more slowly through water than through empty space, for example, but this does not mean that you age more slowly while scuba diving or that it is easier to twist space-time underwater.  \nThe experiments done so far don't lower the speed of light in empty space; they just lower the speed of light in a medium and should not make it easier to twist space-time. Thus, it should not take any less mass-energy to form a black hole or a time machine of a given size in such a medium.\n\nThe end of research.\n\nin the end, it would have to be hooked up to some new extreme time of power supply to power it, and its location would have to be stationary or orbiting i guess, i dunno, just a weird dreams.  \n\n\nShould i write it into a short story?", "link": "https://www.reddit.com/r/Futurology/comments/c43fj5/a_ai_in_a_bootstrap_paradox_dream/"}, {"autor": "solar-cabin", "date": "2019-06-22 14:42:36", "content": "Next Generation -----> AI !!! VA Advanced Intelligence Virtual Assistant Update /!/ After months working on MIMI -----> AI !!!  I have moved on to the next generation as MIMI has evolved in to -----> AI !!! VA Advanced Intelligence Virtual Assistant.\n\n&amp;#x200B;\n\nWhat is -----> AI !!! VA?  Think of it as a Swiss Army knife for all your online and home control needs with tons of features to simplify tasks you do every day saving you time and speeding up your personal productivity.\n\n&amp;#x200B;\n\n-----> AI !!! VA will have all your website pages you visit daily at your fingertips and make them accessible with a touch or voice or typed command but unlike searching online through your browser -----> AI !!! VA can deep search several websites using the same search terms so you can compare research information or do comparison shopping or see images from many websites.\n\n&amp;#x200B;\n\n-----> AI !!! VA speeds up your browsing by removing unnecessary steps and bypassing the tracking programs most browsers use. \n\n&amp;#x200B;\n\nWant to listen to audiobooks or read ebooks online free? Aiva can do that and no subscription required.  Listen to free radio, watch free TV and free movies or use your subscription services.\n\n&amp;#x200B;\n\n-----> AI !!! VA also provides for all your personal productivity needs with a scheduler, word processor, language translators, file converters,  online calling and emergency/panic button, and can control all our appliances using wifi smartplugs.\n\n&amp;#x200B;\n\nAlso included is a video and still -----> camera !!!  and you can take a pic an then use -----> AI !!! VA to enhance your pic using may formats and addons. For the kids there is  fun drawing program and games included.\n\n&amp;#x200B;\n\nThe best part is -----> AI !!! VA is a smart assistant that remembers you and your needs and can offer suggestions and even carry non a conversation with you and -----> AI !!! VA will be in public domain. No subscription and no monthly fees.\n\n&amp;#x200B;\n\nOK, that is my pitch and -----> AI !!! VA is about 80% finished and I will post the link so you can try it out soon!", "link": "https://www.reddit.com/r/Futurology/comments/c3qh6s/next_generation_aiva_advanced_intelligence/"}, {"autor": "Aerothermal", "date": "2019-03-16 23:47:30", "content": "Engineering Technical Lecture on The Science of Iron Man /!/ Hi, I'll be delivering an IMechE lecture on The [Science of Iron Man](https://nearyou.imeche.org/eventdetail?id=15935) in a couple of weeks. It's something I've delivered in the past, in 15 minute talks to colleges and engineering societies, and to a Royal Aeronautical Society event although they were always 10-15 minutes. This will be an hour lecture so I want to come prepared.\n\n&amp;#x200B;\n\nIn just a decade since the first Iron Man -----> film !!!  kicked off the Marvel Cinematic Universe, much of the technology we see in the -----> film !!!  has made significant developments in real life, contributing towards modern flight systems, power,  weapons and artificial intelligence. My thesis is that science fiction is becoming ever more accurate at predicting future tech, and the timescales to technology readiness are getting shorter.\n\n&amp;#x200B;\n\n\\- I wish to discuss exoskeletons, for example Cyberdyne's HAL (Hybrid Assisted Limb) and examples from Raytheon and Lockheed Martin\n\n\\- I already plan to discuss Iron Man's Mark VI laser weapon in the context of real directed energy weapons designed for taking out drones, and the Boeing YAL-1.\n\n\\- I plan to discuss his repulsors in the context of ion engines, e.g. VASIMR and the NEXT ion thruster.\n\n\\- The arc reactors as a stepping off point for Wendelstein 7-X and ITER fusion reactors.\n\n\\- Jarvis as a link to uses of artificial intelligence and -----> machine learning !!! .\n\n\\- Also, a brief discussion on the HUDs being used by F35 fighter pilots and trialled on infantry.\n\n&amp;#x200B;\n\nWithout giving too much more away, does anyone any resources or ideas for something which I should touch on but might not have thought of?", "link": "https://www.reddit.com/r/Futurology/comments/b1yyih/engineering_technical_lecture_on_the_science_of/"}, {"autor": "saisrinivas22", "date": "2019-03-19 17:41:52", "content": "Nvidia's new -----> AI !!!  can turn any sketch into a -----> photo !!! -realistic masterpiece", "link": "https://www.reddit.com/r/Futurology/comments/b30egw/nvidias_new_ai_can_turn_any_sketch_into_a/"}, {"autor": "thefuture_isnow", "date": "2019-04-15 16:08:25", "content": "Emotional surveillance: If you're happy and you know it, so do -----> AI !!!  /!/ \"What if I told you we're already living in an emotional surveillance state – that  your facial recognition data can be harnessed by any networked device  with a -----> camera !!! , that your face most likely exists in a database already  that allows your emotions to be analyzed instantly, and even if you  covered up your webcam and never looked directly at your phone, you  still may come face-to-face (so to speak) with a billboard that changes  based on whether you smile or sneer at it in the near future?\"\n\n[https://www.montag.wtf/emotional-surveillance/](https://www.montag.wtf/emotional-surveillance/)", "link": "https://www.reddit.com/r/Futurology/comments/bdhsmc/emotional_surveillance_if_youre_happy_and_you/"}, {"autor": "rickyll", "date": "2019-04-22 21:00:47", "content": "I made this short -----> film !!!  about what will happen when -----> AI !!!  is introduced into an office environment and asked to do the mundane tasks humans have to do.", "link": "https://www.reddit.com/r/Futurology/comments/bg7c6w/i_made_this_short_film_about_what_will_happen/"}, {"autor": "mvea", "date": "2019-09-18 12:41:40", "content": "Facebook will train its content-removal -----> AI !!!  with police -----> camera !!!  footage - Facebook wants to make its -----> AI !!!  better at detecting videos of mass shootings.", "link": "https://www.reddit.com/r/Futurology/comments/d5x7gc/facebook_will_train_its_contentremoval_ai_with/"}, {"autor": "izumi3682", "date": "2019-09-21 15:10:57", "content": "These -----> AI !!! -generated people are coming to kill stock -----> photography !!! ", "link": "https://www.reddit.com/r/Futurology/comments/d7boyl/these_aigenerated_people_are_coming_to_kill_stock/"}, {"autor": "mvea", "date": "2019-12-19 18:03:25", "content": "Vehicle recognition tech will be used to find cars involved in Amber Alerts - It could mean abducted children get home safely much quicker. The company’s technology will automate the process, using -----> AI !!!  in -----> camera !!!  systems.", "link": "https://www.reddit.com/r/Futurology/comments/ecwv0g/vehicle_recognition_tech_will_be_used_to_find/"}, {"autor": "BaudiIROCZ", "date": "2019-02-24 19:44:12", "content": "Automated trucking technology leaders? /!/ I've been reading Andrew Yang's \"The War On Normal People\" and am becoming increasingly convinced in that the rise in automation is going to lead to mass unemployment in coming years. One of the key technologies he discusses is automated trucking displacing upwards of 5 million drivers in the next 10-15 years. I know there are a few well known companies including Tesla and Google (Waymo), and Uber who are developing this tech but I'm wondering if there are any lesser known companies who are emerging as leaders in the field. Is this something anyone else has been researching for investment?  Other than the truck manufacturers themselves, what chip/-----> camera !!! /-----> AI !!!  companies are most likely to lead the way?", "link": "https://www.reddit.com/r/Futurology/comments/aubo3k/automated_trucking_technology_leaders/"}, {"autor": "Allegory_XTM", "date": "2019-03-04 17:52:08", "content": "Artificial Intelligence and human co-existence | Problems? Advantages? End of Humanity? /!/ This is not a researched work, but rather a speculation on the future of Artificial Intelligence. \n\n&amp;#x200B;\n\nDoes Artificial Intelligence (A.I.) scare anyone? Technology becoming so objective, that it negates the fact the humans are, in fact, subjectively important? We need to establish this superiority very loudly and clearly to -----> AI !!! . This is a scary thought primarily because of what could happen. Technology surpassing human intellect is a bad idea, as it will likely not need humans after time goes by, wouldn't you think? Will it be here after us? These are interesting questions that have spiked much intrigue in me. I think the most important question in all of this is: ***'Do you think we will be responsible enough to prevent the potential disasters of A.I.?'***\n\n&amp;#x200B;\n\nWhen technology leaders talk about integrating technology with humans, it sparks concern within me. The argument in favor of 'web implants' is that it is convenient, easy to use, and seamless. Seamless and internal as opposed to notebooks, laptops, calculators, and pens. The benefits of being integrated with the internet are that you will no longer need to wait to look at your phone, find a pad of paper, or google something. Everything will be done with you the user, at any time. The downside, of course, is that you cannot necessarily (but depending on the implant/technology) remove an integration such as a brain implant. Even if the technology was in the form of a contact lens, is it even good to be integrated on that level? For instance, being able to google facts in the shower? At social functions where you are expected to step away from the phone and socialize? Another crazy (but plausible) thought is what if people start googling in their sleep and performing actions they usually wouldn't do without A.I. I don't know if this constant connection to the internet is healthy. I think the newest generations are showing unhealthy signs of addictions to technology. Their lives are literally encompassed within the internet on social media. Most people can't live without their phone for more than a week (including me). Does anyone else agree that we will lose an essential component that makes us human? Is it even possible to establish a balance between the digital and the physical? We are already in a 'shift of focus' right now between our internet lives and our real lives. People still seem to want to keep their focus on both the physical and the digital world, but will A.I. and convenience erode the focus on real-world perception? It seems as if we are entering a dystopian future sci-fi -----> film !!!  that got 17% on Rotten Tomato. I think (despite popular opinion) that this future is definitely in the works currently. Does anyone else agree? How do you think we should circumvent this potential future? ", "link": "https://www.reddit.com/r/Futurology/comments/axa0ny/artificial_intelligence_and_human_coexistence/"}, {"autor": "Yuli-Ban", "date": "2019-03-19 12:34:46", "content": "The world is utterly unprepared for artificial intelligence in the near-term: \"Media Synthesis\", the phenomenon which includes deepfakes, is further along than almost anyone realizes and is prepared for, and this will result in a lot of fun and angst come the 2020s /!/ I run the /r/MediaSynthesis subreddit, collecting links and discussions surrounding this technology. The other day, I asked [/r/MachineLearning](https://www.reddit.com/r/MachineLearning/comments/awmjm8/d_how_long_are_we_from_voice_style_transfer_voice/) about a topic that I've been tossing about my head for almost a full decade now: *when will we be able to use style transfer on audio reliably?* \n\nIn the simplest possible terms, \"style transfer\" is when you make one thing like another using -----> machine learning !!! . You upload a picture of a sunny day as an input, upload a bunch of pictures of night time as variables, and then get the original picture but now it's night time. The algorithm didn't fetch a picture of the scene at a different time of day. It altered the very pixels, turning day into night. \n\nHere's a few examples:\n\n- [Color transfer](https://i.redd.it/1qync11pltpz.jpg)\n\n- [Video transfer, turning a street scene with trees into one with buildings or more trees, among other things](https://www.youtube.com/watch?v=S1OwOd-war8)\n\n- [Musical transfer, changing instruments and genres](https://www.youtube.com/watch?v=vdxCqNWTpUs).\n\nAll of which are from 2017 or 2018. \n\nThere's a lot more, and this includes deepfakes which I'm sure plenty of people are aware of. The potential of this technology over the next 5 years— and yes, I'm saying ***five*** years, not fifteen or twenty five or fifty— is going to lead to people with no skill in -----> machine learning !!!  or artistry to be able to alter existing media almost completely as well as generate some kinds of new media.\n\nBack specifically on the topic of audio style transfer, this includes being able to take a song, any song, and altering at your leisure in a variety of different ways ranging from adding or subtracting instruments, swapping the vocalist or removing them entirely, and perhaps even extending the song in an \"intelligent\" manner— meaning the algorithm can actually generate more sections of that song that didn't previously exist (within reason). You could turn any top 40 pop song into a 20-minute-long pop epic. \n\nMy classic desire is taking TLC's *Waterfalls* and turning it into a barbershop quartet, complete with the mustachioed men singing in tune with all the 1920s graininess you'd expect. Did you like *Bohemian Rhapsody* but could do without the heavy guitars? Why not transfer it into a polka song? That's indeed very possible. Covering songs in a different style is obviously a thing that you can already find on YouTube and \"X Goes Pop\" compilations whatnot, but that involves actual musicians and artists putting in the time and effort. We're not far away from having a theoretical \"Audacity 2.0\" where you could do the same thing with a few clicks of your mouse. \n\nOne of my more esoteric desires goes a step further, and it's also very much on the horizon. I love Witchfinder General, but they've always been a bit too amateurish. They were almost a great band, if only a few lyrics were changed and some instruments were tightened up. In the future, I could be able to \"correct\" these \"mistakes\", going in to change the lyrics myself so that Zeeb Parkes is singing something a bit different over a band that's even slower and doomier than they actually were. In some cases, that means adding lines where there weren't originally. \n\nIt would obviously still be a laborious process because vocals in songs can be complex and heavily individualized. \n\nBut that was only ever a problem for the old era of digital software, where things had to be cut up and easily able to fit into bits and pieces and then essentially standardized as if you're playing something on a synth. This new era is something *entirely different* and ***infinitely*** more capable. You couldn't replicate Bob Dylan's soul if you had his voice in a voice synthesis software program as might exist today. \n\nThere's no style nor soul that'll be beyond my fingers with the right neural networks. \n\nFor someone like me, who loves creating entire musical scenes and movements from playlists and imagination, that's a godsend. For an actual musician or any creative who prides themselves on their humanity, it sounds like the worst dystopia. \n\nI'm not overselling this either. Audio is, fundamentally, a bunch of waves. If you can edit those waveforms, you can create any audio you wish. It's just that the way we edit those waveforms is usually by hitting drums, strumming guitars, pressing keyboards, and singing.\n\n**Of course, there are** ***much*** **darker applications of this technology**. The very first thing to come to mind is putting words in someone else's mouth for political purposes, as can be demonstrated here:\n\n- [Deepfakes on Obama, Putin, and others](https://www.youtube.com/watch?v=qc5P2bvfl44)\n- [Making Trump say new things](https://www.youtube.com/watch?v=6xxGIDfe5BU)\n\nIf the latter sounds too robotic, [don't fret/relax](https://www.youtube.com/watch?v=IuIpgArEZig). Making voices sound audiorealistic is just a matter of parameters and data, of which the likes of Google, Baidu, Facebook, OpenAI, and many others have no shortage. The crappy free text-to-speech programs you might find with a Google search or in a PDF file is as representative of the state of the art as a bottle rocket is of the military's explosive ordinance. \n\nAnd that's literally just the tip of the iceberg. Just because I'm focusing on audio doesn't mean there's nothing for images and video, obviously. Just the opposite— everyone is so focused on deepfakes and image synthesis that we're overlooking audio synthesis. \n\nIt's not coming in stages, nor is it arriving slowly and at easily digestible and tolerable speeds as might be written in a shlock cyberpunk novel. We're not going to struggle with image synthesis for 20 years, then struggle with audio synthesis for 20 years, and so on until we reach a point in the distant future where you can't trust anything you see. We're developing them all simultaneously and seeing progress come at breakneck speeds, and we'll be well within that future this time next decade.\n\nIn fact, this time next decade we'll have entirely different zeitgeists when it comes to art, entertainment, and the news. There's no refuge in cartoons. Neural networks are in the early stages of learning how to do [caricatures and exaggerations](https://i.imgur.com/8PQHAI3.jpg)— the fundamental root of cartooning. Others can [generate short animations from text alone](https://www.youtube.com/watch?v=Nqc9jcgPNmE). Even more can be used to [remaster old video games](https://venturebeat.com/2019/01/18/machine-learning-is-rescuing-old-game-textures-in-zelda-and-final-fantasy/) and [create games from scratch](https://motherboard.vice.com/en_us/article/438y8g/this-algorithm-makes-its-own-new-video-games).\n\nAnd no, [you can't find refuge in writing either](https://blog.openai.com/better-language-models/). Scarily enough, it's the text synthesis network that shows the most signs of general intelligence. It's not AGI by far, but it's most general AI ever created and it isn't even a very complex machine at that. But it's apparently too dangerous to be released.\n\nIf you have a passion for all of this and create art for art's sake or are willing to accept fewer (but likely much higher paid) commissions rather than a \"career\" as we understand it to be, you're fine. If you're someone who wants to become a career artist/model/voice actor/musician/animator/writer/comic artist/newscaster and expect to find consistent work for the next 50 years, (first, good luck regardless) make these next five to ten years count and/or try considering jumping into the former category.\n\n**The final and most sobering realization of all this** is the cold fact that, ironically contrary to all those predictions of how automation would unfold, entertainment and the arts will be the *first* field to go. Everyone said that all the drudgery of the world would be automated first, freeing up workers to pursue the arts because \"a machine could never [write a poem](https://imgur.com/gallery/Dfa4IO8), [pen a song](https://www.youtube.com/watch?v=LSHZ_b05W7o), or paint [a work of art](https://www.bbc.com/news/technology-45980863)\".\n\nThis is something so stupefyingly far from public conscious that there is virtually *nothing* being done or said about it. You might initially think that it doesn't warrant much discussion until it actually arrives, but when you really start looking at this in-depth, you have a tendency to grow a bit fatalistic. One of my future-shock angsts is about schooling and how public and private schools in their current form are utterly unable to prepare children for the future into which they will graduate (a future in which school itself may become obsolete because there will be little point for it besides social functions and raw education, which isn't what American schooling is for). This is related, but a bit different.\n\nWe have a technology that didn't exist 10 years ago and yet will almost certainly upend the entire entertainment industry within 10 years from now. Photoshops and -----> photo !!!  manipulation, \"dumbfakes\" if you will, weren't even a pre-meal mint, let alone the appetizer. We ought to be having a dialog on this, but we aren't. \n\nMany of us refuse to believe it exists at all, that it's just some schizophrenic pipe dreams found on /r/Futurology and /r/Singularity. Others so desperately want to leave a place for humans that they will deny that machines will be able to do these things competently despite being shown the evidence. And those who accept it can only say \"So what?\" Even though I eagerly await a world where I could generate a multimedia franchise (*and* the global reaction) in my bedroom on my laptop, there are still pertinent risks.\n\nAs /u/ksblur said: \n\n&gt; Strange how we live in a world of trust-based security. It would be relatively easy for cryptography to solve that issue (your phone could automatically reject calls without proper signatures or encryption), but  people grew up \"trusting\" the systems so there's not a lot of incentive to change it.\n\n&gt; Could you imagine inventing the telephone in 2019 and either A) not encrypting the data (landlines) or B) [using weak 64bit A5/1 encryption (GSM)](https://arstechnica.com/gadgets/2010/12/15-phone-3-minutes-all-thats-needed-to-eavesdrop-on-gsm-call/)?*\n\n**TLDR Skynet wants to become a singer and artist, and Dad (i.e. Humans) doesn't realize it yet.**", "link": "https://www.reddit.com/r/Futurology/comments/b2wv71/the_world_is_utterly_unprepared_for_artificial/"}, {"autor": "izumi3682", "date": "2019-07-23 18:49:29", "content": "Izumi3682 and the world of tomorrow (23 Jul 2018) I posted this about a year ago for the first time--I read it just now and it looks like it's still pretty relevant. You can take a look and see. /!/ (Admin note: This is a \"red pill\". A vast and deep network of links about things I have written concerning the future. I'm not vain or nothing. I just put it out there so you can see what i think about different aspects of the future. One day maybe i make it inta a book. But that is doubtful. While i am not vain, I am trifling as all get out.\nReading this first submission is but the tip of the iceberg. I welcome feedback. You can send private messages to me anytime!;)\n\n\nI make what sounds on the surface like a lot of wild claims about what the future of the human race and what it will derive into, will be. Hint: No more biology. Awesome VR universes. (or will they be real? And does it matter?) \nHere are two examples I found.\nhttps://www.reddit.com/r/Futurology/comments/7lk666/the_men_who_are_convinced_were_all_living_in_a/drmtt64/\nhttps://www.reddit.com/r/Futurology/comments/7gpqnx/why_human_race_has_immortality_in_its_grasp/dqku50e/\nSo here is the thing. We attempt to predict exactly what the future is going to be like in this sub-reddit. So much of what I read is the belief that it is going to be just more of the \"same ol', same ol'\". There will still be politics. There will still be human issues such as race and gender and level of education and socio-economic status. You will still have to get up and go to work. The rich will get richer. Having some kind of medium of exchange will be essential. There will be families. There will be sports. There will be difficult for me to understand economic minutiae. There will be religion and tribal induced divisiveness. There will be crime, countries, poor people, climate change and mental health issues. Humans will continue to die in all kinds of different ways including old age. And on and on.\nBut I watch the astonishingly rapid advance of technology. Technology where new earth-shaking advances occur in months rather than decades or even years. I'm getting to the point now where I actually feel a bit of a sense of trepidation what the -----> AI !!!  (artificial intelligence) is going to do next. -----> AI !!!  in its many forms. Machine learning, deep learning, narrow -----> AI !!!  and all the many other algorithms. Oh, and SDVs. (SDVs - self driving vehicles - are -----> AI !!! , oh yes.) As of this commentary there is no such thing as AGI (artificial general intelligence). We don't even know if such a thing is possible. But I suspect that given enough processing power, speed and access to big data that a narrow -----> AI !!!  will be able to effectively simulate or mimic the effect of AGI. Then my question is, does it matter if it is narrow -----> AI !!!  simulating AGI or real honest to gosh AGI. Consciousness and self-awareness are certainly not a requirement. And in fact a true EI (emergent intelligence--conscious and self-aware.) would be very undesirable. We don't need that kind of competition.\nThen we have VR/AR. It is ultimate primitive today. But already powerful new technologies are developing that will take VR/AR, but particularly VR and will make it a technological phenomenon such as the world has never seen. The most recent was that weird \"metalens\" that I just learned about the other day. And everyone else did too. It was big news in this sub-reddit. But my point is, that technology is ideally suited to advance our VR in ways that we cannot today even comprehend. I'd take a good look at that movie, \"Ready, Player One\", and realize that by the time we actually reach the year 2045 that the technology you see in that movie will look quaint and primitive. And that is saying something because the special effects I watched in the movie trailer were amazing to see. I state flatly that VR is going to evolve to replace \"real\" reality in it's entirety. Humans will engineer themselves to fully exist in VR. You want nature? VR will provide nature beyond your imagining.\nCaveat Emptor: VR worlds can be inescapable Hell as easily as blissful Heaven. It depends on who (or what) gets ahold of the technology (and you).\nhttps://www.reddit.com/r/Futurology/comments/7r42h0/vr_is_going_to_be_like_nothing_the_world_has_ever/\nAnd next we have the impact of mobiles and mobile content on the human mind and psyche. Mobiles are super powerful, super computers we carry around with us, like a giant human social engineering experiment. Do you think the impact of hand carried supercomputers on human civilization is going to decrease as time goes forward? And \"social media\", the teeny, tiny foot in the door that opens to a universal \"hive mind\". Our ultimate desire is to merge that mobile's ability with our very minds, and bring the internet, the sum total of human knowledge, right along with it. I think we might be able to manage that within 50 years. After that we won't be the same. Not at all.\nWe are also quickly approaching the age of the quantum computer. I will admit that they do not work like a classical computer and that today there is no way that such a device could do what classical computers do. But that is looking at things from today's perspective. Humans are incredibly clever creatures and somebody is going to figure out how use various types of quantum computers to enhance the performance of classical computers. Of this I have no doubt. We programmed computers the best we could in the year 1955 and in 2018 we still program computers to the best of our ability, but the binary principle is absolutely the same, and since the 1950s we have moved with astonishing speed into understanding and precisely simulating incredibly complex chaotic systems like tornado-genesis within a supercell. Much of that credit goes towards what you see take place in this video here.\nhttps://www.youtube.com/watch?v=MRG8eq7miUE\nYou can call that \"Moore's Law or whatever you like. I call it stupefying progress. And now that progress is accelerating. Pause the video at the year 2015 and consider that is the year Deepmind's \"AlphaGo\" came into existence...\nI don't care beans about how the processing power will equal that of the human mind. We are going to rocket past that arbitrary benchmark like it didn't exist anyway! No, pay attention to that doubling of processing speed and data capacity. That is what matters. That is rocket fuel for our -----> AI !!!  efforts. By the way based on that video, about 2 years after the video ends computer processing power will make another full Lake Michigan of processing power and 2 years or so after that them two \"lakes\" will double again. I don't think I am extrapolating incorrectly. This is not even taking into account the likely transcendent effect of the quantum computer. I suspect that quantum computers will replace binary computers in their entirety in less than 20 years. I wonder what we shall come up with that is better than a quantum computer? \nI have often stated in my commentaries how in the year 1900, science (which had only taken on the actual term \"science\" about 50 years earlier. Before that it was called \"natural philosophy\".) regarded itself as incredibly advanced with little else to discover or learn. After all we had the train, the telegraph, the telephone, such incredible industries, the automobile and it was clear the aeroplane was in the works. Delightful diversions such as stereoscopic -----> photography !!! , the gramophone and even motion picture cinema already was a part of our world. Sheer electrical magick!\nWe even had a pretty good idea of what germs were. X-Rays for god's sake! What else was there? \nA lot as it turned out. We continued and do continue to make staggering discoveries into the nature of nature. Them gravity waves, which about 2 years ago we were not sure even existed, are now like an everyday thing. \"Oh look, two neutron stars collided\"--the world shrugs. Exploiting gravitational waves observation brought us that news. I would imagine that between today and the year ohh, 2317, we shall make some additional fundamental discoveries in physics to include space and time I bet.\nI have not even discussed things like fusion or solar, or all the biotech we are coming up with. Such incredible societal disruptions are inevitable even now. That backflipping robot... Man, that set a high bar for anything that can impress me more after that. What should I expect this year? A full floor routine? Elon Musk himself stated, when he saw that video; \"Just wait, in a few years you will need a strobe light to catch it's movement.\" I don't think he is exaggerating in the least. \nThat automation and those SDVs will take a good chunk of humanity's employment. The -----> AI !!!  and robots will take the rest. Oh and about touchy-feely things like art, creativity and empathy? I predict that in less than 10 years humans will prefer the \"works\" of -----> AI !!!  and prefer the company of -----> AI !!!  as well. The narrow -----> AI !!!  will be able to play our emotional and physical responses like the proverbial fiddle. 2018 humans are not that complicated.\nhttps://www.reddit.com/r/Futurology/comments/7obqv8/truly_creative_ai_is_just_around_the_corner_heres/ds8rzp5/\nRobots like \"da Vinci\" that humans surgeons use to perform incredibly delicate micro surgery on things like embryos and fetuses, those probe devices are recording exactly what the human is doing and learning to do it itself using -----> AI !!!  simulations. In less than ten years all employment that requires a human to drive or sell things will be gone. I can't speak for anybody else, but I can state that the USA government is not only aware of this, but is worried about it's impact. Here is that report.\nhttps://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/documents/Artificial-Intelligence-Automation-Economy.PDF\nI stick to my guns. It is probably going to happen the way I said. Narrow -----> AI !!! , but probably AGI too + VR + classical supercomputers/quantum computers + solar and manmade fusion (I bet fusion is only about 10 years away now. Well, that's better than 20 years away I think.) + biotech changes that inevitably slough off the \"bio\" part completely + ???(wildcard serendipitous discoveries and human ingenuity) + an interface of some nature with the human mind (hopefully, for my sake) = No longer needing reality and not even missing it.\nHere is a little dessert! These are two very entertaining videos that are both screamingly funny and alarming at the exact same time.\nHow most people feel about our future.\nhttps://www.youtube.com/watch?v=9deKEj8-lng\nThis next one makes me laugh, but also wonder too... Make sure you turn on subtitles for this one.\nhttps://www.youtube.com/watch?v=dHVtUw5wToA&amp;t=15s\n\nNext up: Flying cars-Real flying cars that anybody can use and they are fully level 5 autonomy. And lab grown meat in your local supermarket!\n\nHere are (a lot) more things I've said if you like. I just wanted to put some commentary in one place to keep it easier to find. And also to save and preserve it. There is an \"event horizon\" in Reddit whereby posts of anything over 1000 disappear for good. I learned the hard way. I lost years of commentary and did not even know it.\nhttps://www.reddit.com/r/Futurology/comments/6itqu4/escape_to_the_future_with_virtual_reality/dj93x8y/", "link": "https://www.reddit.com/r/Futurology/comments/cgwpi5/izumi3682_and_the_world_of_tomorrow_23_jul_2018_i/"}, {"autor": "nopantsdolphin", "date": "2019-06-04 11:33:48", "content": "New -----> AI !!!  could reconstruct a person's full image from a partially occluded -----> photo !!! ", "link": "https://www.reddit.com/r/Futurology/comments/bwnngp/new_ai_could_reconstruct_a_persons_full_image/"}, {"autor": "thatglitch", "date": "2019-07-05 18:08:56", "content": "We spent two years making this retro-futuristic -----> film !!!  in our spare time, trying to imagine what it would be like having to train an -----> AI !!!  to replace you at your job - what do you think?", "link": "https://www.reddit.com/r/Futurology/comments/c9j61s/we_spent_two_years_making_this_retrofuturistic/"}, {"autor": "solar-cabin", "date": "2019-09-16 22:23:52", "content": "See How -----> AI !!!  Stereotypes You: Upload a -----> photo !!! , and the algorithm will show you what it thinks you are.", "link": "https://www.reddit.com/r/Futurology/comments/d57q01/see_how_ai_stereotypes_you_upload_a_photo_and_the/"}, {"autor": "mvea", "date": "2019-09-20 12:14:53", "content": "100,000 free -----> AI !!! -generated headshots put stock -----> photo !!!  companies on notice - For all your royalty-free -----> photo !!!  needs", "link": "https://www.reddit.com/r/Futurology/comments/d6u18l/100000_free_aigenerated_headshots_put_stock_photo/"}, {"autor": "azmodeus99", "date": "2019-06-16 15:51:22", "content": "NVIDIA's -----> AI !!!  system that generates -----> photo !!!  realistic images from your doodles is now in beta stage and open for all to try out", "link": "https://www.reddit.com/r/Futurology/comments/c1bd22/nvidias_ai_system_that_generates_photo_realistic/"}, {"autor": "PuddlesAreWet", "date": "2019-11-04 15:40:11", "content": "Futurology: how a group of visionaries looked beyond the possible a century ago and predicted today’s world /!/   *From shamanic ritual to horoscopes, humans have always tried to predict the future. Today, trusting predictions and prophecies has become part of daily life. From the weather forecast to the time the sat-nav says we will reach our destination, our lives are built around futuristic fictions.*\n\nOf course, while we may sometimes feel betrayed by our local meteorologist, trusting their foresight is a lot more rational than putting the same stock in a TV psychic. This shift toward more evidence-based guesswork came about in the 20th century: futurologists began to see what prediction looked like when based on a scientific understanding of the world, rather than the traditional bases of prophecy (religion, magic, or dream). Genetic modification, space stations, wind power, artificial wombs, video phones, wireless internet, and cyborgs were all foreseen by “futurologists” from the 1920s and 1930s. Such visions seemed like science fiction when first published.\n\nThey all appeared in the brilliant and innovative “To-Day and To-Morrow” books from the 1920s, which signal the beginning of our modern conception of futurology, in which prophecy gives way to scientific forecasting. This series of over 100 books provided humanity – and science fiction – with key insights and inspiration. I’ve been immersed in them for the last few years while writing the first book about these fascinating works – and have found that these pioneering futurologists have a lot to teach us.\n\nIn their early responses to the technologies emerging then – aircraft, radio, recording, robotics, television – the writers grasped how those innovations were changing our sense of who we are. And they often gave startlingly canny previews of what was coming next, as in the case of Archibald Low, who in his 1924 book Wireless Possibilities, predicted the mobile phone: “In a few years time we shall be able to chat to our friends in an aeroplane and in the streets with the help of a pocket wireless set.”\n\nSome of the books in the series. Max Saunders, Author provided\n\nMy immersion in these historic visions of the future has also shown me that looking at this collection of sparkling projections can teach us a lot about current prediction attempts, which today are dominated by methodologies claiming scientific rigour, such as “horizon scanning”, “scenario planning” and “anticipatory governance”. Unlike the corporate, bland way in which most of this professional future gazing takes place within government, think-tanks and corporations, the scientists, writers, and experts who wrote these books produced very individual visions.\n\nThey were committed to thinking about the future on a scientific basis. But they were also free to imagine futures that would exist for other reasons than corporate or governmental advantage. The resulting books are sometimes fanciful, but their fancy occasionally gets them further than today’s more cautious and methodical projections.\n\nThis article is part of Conversation Insights \n\nThe Insights team generates long-form journalism derived from interdisciplinary research. The team is working with academics from different backgrounds who have been engaged in projects aimed at tackling societal and scientific challenges.\n\nForecasting future discoveries\n\nTake J B S Haldane, the brilliant mathematical geneticist, whose book Daedalus; or: Science and the Future inspired the whole series in 1923. It ranges widely across the sciences, trying to imagine what remained to be done in each.\n\nHaldane thought the main work in physics had been done with the Theory of Relativity and the development of quantum mechanics. The main tasks left seemed to him to be the delivery of better engineering: faster travel and better communications.\n\nChemistry, too, he saw as likely to be concerned more with practical applications, such as inventing new flavours or developing synthetic food, rather than making theoretical advances. He also realised that alternatives would be needed to fossil fuels and predicted the use of wind power. Most of his predictions have been fulfilled (though we’re still waiting eagerly for those new flavours, which have to be better than salted caramel).\n\nThe first cultured hamburger, 2013. World Economic Forum, CC BY\n\nIt’s chastening, though, how much even such a clear-sighted and ingenious scientist missed, especially in the future of theoretical physics. He doubted nuclear power would be viable. He couldn’t know about future discoveries of new particles leading to radical changes to the model of the atom. Nor, in astronomy, could he see the theoretical prediction of black holes, the theory of the big bang or the discovery of gravitational waves.\n\nBut, at the dawn of modern genetics, he saw that biology held some of the most exciting possibilities for future science. He foresaw genetic modification, arguing that: “We can already alter animal species to an enormous extent, and it seems only a question of time before we shall be able to apply the same principles to our own.” If this sounds like Haldane supported eugenics, it’s important to note that he was vocally opposed to forced sterilisation, and didn’t subscribe to the overtly racist and ableist eugenics movement that was en vogue in America and Germany at the time.\n\nBut the development that caught the eye of so many readers was what Haldane called “ectogenesis” – his term for growing embryos outside the body, in artificial wombs. Many of the other contributors took up the idea, as did other thinkers – the most notable being Haldane’s close friend Aldous Huxley, who was to use it in Brave New World, with its human “hatcheries” cloning the citizens and workers of the future. It was also Haldane who coined the word “clone”.\n\nEctogenesis still seems like science fiction. But the reality is getting closer. It was announced in May 2016 that human embryos had been successfully grown in an “artificial womb” for 13 days – just one day short of the legal limit, prompting an inevitable ethical row. And in April 2017 an artificial womb designed to nurture premature human babies was successfully trialled on sheep. So even that prediction of Haldane’s may well be realised soon, perhaps within a century after it was made. Although artificial wombs will probably be used, at first, as a prosthesis to cope with medical emergencies, before they become routine options, on a par with caesareans or surrogacy.\n\nScience, then, was not just science for these writers. It had social and political consequences, as does prediction. Many of the contributors of this series were social progressives, in sexual as well as political matters. Haldane looked forward to the doctor taking over from the priest and science separating sexual pleasure from reproduction. In ectogenesis, he foresaw that women could be relieved of the pain and inconvenience of bearing children. As such, the idea could be seen as a feminist thought experiment – though some feminists might now see it as a male attempt to control women’s bodies.\n\nWhat this reveals is how shrewd these writers were about the controversies and social proclivities of the age. At a time when too many thinkers were seduced by the pseudoscience of eugenics, Haldane was scathing about it. He had better ideas about how humanity might want to transform itself. While most of the scholars musing on eugenics merely supported white supremacy, Haldane’s motives suggest he’d be delighted at the advent of technologies like CRISPR – a method by which humankind could better itself in ways that mattered, like curing congenital disease.\n\nAlternate futures\n\nSome of To-Day and To-Morrow’s predictions of technological developments are impressively accurate, such as video phones, space travel to the moon, robotics and air attacks on capital cities. But others are charmingly inaccurate.\n\nOliver Stewart’s 1927 volume, Aeolus or: The Future of the Flying Machine, argued that British craftsmanship would triumph over American mass production. He was excited by autogiros – small aircraft with a propeller for thrust and a freewheeling rotor on top, for which there was a craze at the time. He thought travellers would use those for short-haul flights, transferring for long-haul to flying boats – passenger planes with boat-like bodies that could take off from, and land on, the sea. Flying boats certainly had their vogue for glamorous voyages across the ocean, but disappeared as airliners became bigger and longer range and as more airports were built.\n\nThe Dornier Do X was the largest, heaviest, and most powerful flying boat in the world when it was produced by the Dornier company in Germany in 1929. Wikipedia, CC BY\n\nThe To-Day and To-Morrow series, like all futurology, is full of such parallel universes. Paths history could well have taken, but didn’t. In the rousing 1925 feminist volume Hypatia or: Woman and knowledge, Bertrand Russell’s wife Dora proposed that women should be paid for household work. Unfortunately, this has not come to pass either.\n\nThe -----> film !!!  critic Ernest Betts, meanwhile, writes in 1928’s Heraclitus; or The Future of -----> film !!! s that “the -----> film !!!  of a hundred years hence, if it is true to itself, will still be silent, but it will be saying more than ever”. His timing was terrible, as the first “talkie”, The Jazz Singer, had just come out. But Betts’s vision of -----> film !!! ’s distinctiveness and integrity – the expressive possibilities open to it when it brackets off sound – and of its potential as a universal human language, cutting across different linguistic cultures, remains admirable.\n\nRead more: Anthill 10: The future\n\nThe difficulty with future thinking is to guess which of the forking paths leads to our real future. In most of the books, moments of surprisingly accurate prediction are tangled up with false prophecies. This isn’t to say that the accuracy is just a matter of chance. Take another of the most dazzling examples, The World, the Flesh and the Devil by the scientist J D Bernal, one of the great pioneers of molecular biology. This has influenced science fiction writers, including Arthur C Clarke, who called it “the most brilliant attempt at scientific prediction ever made”.\n\nBernal sees science as enabling us to transcend limits. He doesn’t think we should settle for the status quo if we can imagine something better. He imagines humans needing to explore other worlds and to get them there he imagines the construction of huge life-supporting space stations called bio-spheres, now named after him as “Bernal spheres”. Imagine the international space station, scaled up to small planet or asteroid size.\n\nBrain in a vat\n\nWhen Bernal turns to the flesh, things get rather stranger. A lot of the To-Day and To-Morrow writers were interested in how we use technologies as prosthesis, to extend our faculties and abilities through machines. But Bernal takes it much further. First, he thinks about mortality – or more specifically – about the limit of our lifespan. He wonders what science might be able to do to extend it.\n\nIn most deaths the person dies because the body fails. So what if the brain could be transferred to a machine host, which could keep it, and therefore the thinking person, alive much longer?\n\nBernal’s thought experiment develops the first elaboration of what philosophers now call the “brain in a vat” hypothesis. Except they’re usually concerned with questions of perception and illusion (if my brain in a vat was sent electrical signals identical to the ones sent by my legs, would I think I was walking? Would I be able to tell the difference?). But Bernal has more pragmatic ends in view. Not only would his Dalek-like machines be able to extend our brain life, they’d be able to extend our capabilities. They would give us stronger limbs and better senses.\n\nBernal wasn’t the first to postulate what we’d now call the cyborg. It had already appeared in pulp science fiction a couple of years earlier – talking, believe it or not, about ectogenesis.\n\nBut it’s where Bernal takes the idea next that is so interesting. Like Haldane’s, his book is one of the founding texts of transhumanism – the idea that humanity should improve its species. He envisions a small sense organ for detecting wireless frequencies, eyes for infra-red, ultra-violet and X-rays, ears for supersonics, detectors of high and low temperatures, of electrical potential and current.\n\nWith that wireless sense Bernal imagined how humanity could be in touch with others, regardless of distance. Even fellow humans across the galaxy in their biospheres could be within reach. And, like several of the series’ authors, he imagines such interconnection as augmenting human intelligence, of producing what science fiction writers have called a hive mind, or what Haldane calls a “super-brain”.\n\nIt’s not -----> AI !!!  exactly because its components are natural: individual human brains. And in some ways, coming from Marxist intellectuals like Haldane and Bernal, what they’re imagining is a particular realisation of solidarity. Workers of the world uniting, mentally. Bernal even speculates that if your thoughts could be broadcast direct to other minds in this way, then they would continue to exist even after the individual brain that thought them had died. And so would offer a form of immortality guaranteed by science instead of religion.\n\nBlind spots\n\nBut from a modern point of view what’s more interesting is how Bernal effectively imagined the world wide web, more than 60 years before its invention by Tim Berners Lee. What neither Bernal, nor any of the To-Day and To-Morrow contributors could imagine, though, was the computers needed to run it – even though they were only about 15 years away when he was writing. And it is these computers that have so ramped up and transformed these early attempts at futurology into the industry it is today.\n\nHow can we account for this computer-shaped hole at the centre of so many of these prophecies? It was partly that mechanical or “analogue” computers such as punched card machines and anti-aircraft gun “predictors” (which helped gunners aim at rapidly moving targets) had become so good at calculation and information retrieval. So good, in fact, that to the inventor and To-day and To-morrow author H Stafford Hatfield what was needed next was what he called “the mechanical brain”.\n\nSo these thinkers could see that some form of artificial intelligence was required. But even though electronics were developing rapidly, in radios and even televisions, it didn’t yet seem obvious – it didn’t even seem to occur to people – that if you wanted to make something that functioned more like a brain it would need to be electronic, rather than mechanical or chemical. But that was exactly the moment when neurological experiments by Edgar Adrian and others in Cambridge were beginning to show that what made the human brain tick was actually the electrical impulses that powered the nervous system.\n\nJust 12 years later, in 1940 – before the development of the first digital computer, Colossus at Bletchley Park – it was possible for Haldane (again) to see that what he called “Machines that Think” were beginning to appear, combining electrical and mechanical technologies. In some ways our situation is comparable, as we sit poised just before the next great digital disruption: -----> AI !!! .\n\nA Colossus codebreaking computer, 1943. Wikimedia Commons\n\nBernal’s book is a fascinating example of just how far extended future thinking can go. Further than actual science, or science fiction, or philosophy or anything else. But it also shows where it reaches its limits. If we can understand why the To-Day and To-Morrow authors were able to predict biospheres, mobile phones and special effects, but not the computer, the crisis in obesity, or the resurgence of religious fundamentalisms, then maybe we can learn about the blind spots in our own forward vision and horizon scanning.\n\nBeyond the simple wows and comedic effects of these hits and misses, we need more than ever to learn from these past examples about the potential and dangers of future thinking. We would do well to look closely at what might help us to be better futurologists, as well as at what might be blocking our vision.\n\nYesterday and today\n\nThe pairing of scientific knowledge and imagination in these books created something unique – a series of hypotheticals somewhat lodged between futurology and science fiction. It is this sense of hopeful imagination that I think urgently needs to be injected back into today’s predictions.\n\nBecause computers have transformed contemporary futurology in major ways: especially in terms of where and how it is carried out. As I have mentioned, computer modelling of the future mainly happens in businesses or organisations. Banks and other financial companies want to anticipate shifts in the markets. Retailers need to be aware of trends. Governments need to understand demographic shifts and military threats. Universities want to drill down into the data of these or other fields to try to understand and theorise what is happening.\n\nTo do this kind of complex forecasting well, you have to be a fairly large corporation or organisation with adequate resources. The bigger the data, the hungrier the exercise becomes for computing power. You need access to expensive equipment, specialist programmers and technicians. Information that citizens freely offer to companies such as Facebook or Amazon is sold on to other companies for their market research – as many were shocked to discover in the Cambridge Analytica scandal.\n\nRead more: Cambridge Analytica scandal: legitimate researchers using Facebook data could be collateral damage\n\nThe main techniques which today’s governments and industries use to try to prepare for or predict the future – horizon scanning and scenario planning – are all well and good. They may help us nip wars and financial crashes in the bud – though rather obviously, they don’t always get it right either. But as a model for thinking about the future more generally, or for thinking about other aspects of the future, such methods are profoundly reductive.\n\nThey’re all about maintaining the status quo, about risk aversion. Any interesting ideas or innovative speculations that are about anything other than risk avoidance are likely to get pushed aside. The group nature of think-tanks and foresight teams also has a levelling down effect. Future thinking by committee has a tendency to come out in bureaucratese: bland, impersonal, insipid. The opposite of science fiction.\n\nHorizon scanning doesn’t tend to produce any particularly exciting ideas. Zhao jiankang/Shutterstock.com\n\nWhich is perhaps why science fiction needs to put its imagination in hyperdrive: to boldly go where the civil servants and corporate aparatchiks are too timid to venture. To imagine something different. Some science fiction is profoundly challenging in the sheer otherness of its imagined worlds.\n\nThat was the effect of 2001 or Solaris, with their imagining of other forms of intelligence, as humans adapt to life in space. Kim Stanley Robinson takes both ideas further in his novel 2312, imagining humans with implanted quantum computers and different colony cultures as people find ways of living on other planets, building mobile cities to keep out of the sun’s heat on Mercury, or terraforming planets, even hollowing out asteroids to create new ecologies as art works.\n\nWhen we compare To-Day and To-Morrow with the kinds of futurology on offer nowadays, what’s most striking is how much more optimistic most of the writers were. Even those like Haldane and Vera Brittain (she wrote a superb volume about women’s rights in 1929) who had witnessed the horrors of modern technological war, saw technology as being the solution rather than the problem.\n\nImagined futures nowadays are more likely to be shadowed by risk, by anxieties about catastrophes, whether natural (asteroid collision, mega-tsunami) or man-made (climate change and pollution). The damage industrial capitalism has inflicted on the planet has made technology seem like the enemy now. Certainly, until anyone has any better ideas, and tests them, reducing carbon emissions, energy waste, pollution, and industrial growth seem like our best bets.\n\nImagining positive change\n\nThe only thing that looks likely to convince us to change our ways is the dawning conviction that we have left it too late. That even if we cut emissions to zero now, global warming has almost certainly passed the tipping point and will continue to rise to catastrophic levels regardless of what we do to try to stop it.\n\nThat realisation is beginning to generate new ideas about technological solutions – ways of extracting carbon from the atmosphere or of artificially reducing sunlight over the polar ice caps. Such proposals are controversial, attacked as encouragements to carry on with Anthropocene vandalism and expect someone else to clear up our mess.\n\nBut they might also show that we are at an impasse in future thinking, and are in danger of losing the ability to imagine positive change. That too is where comparison with earlier attempts to predict the future might be able to help us. They could show us how different societies in different periods have different orientations towards the past or the future.\n\nWhere the modernism of the 1920s and 30s was very much oriented towards the future, we are more obsessed with the past, with nostalgia. Ironically, the very digital technology that came with such a futuristic promise is increasingly used in the service of heritage and the archive. Cinematic special effects are more likely to deliver feudal warriors and dragons, rather than rockets and robots.\n\nBut if today’s futurologists could get back in touch with the imaginative energies of their predecessors, perhaps they would be better equipped to devise a future we could live with.", "link": "https://www.reddit.com/r/Futurology/comments/drjakl/futurology_how_a_group_of_visionaries_looked/"}], "name": "Subreddit_Futurology_01_01_2019-30_12_2019"}