{"interestingcomments": [{"Unnamed: 0": 332942, "autor": "betcher73", "date": 1625173585000, "content": "Circular saw vs Orbital Jig Saw /!/ Looking for opinions.\n\nI am about to buy a two pack of 18v Ryobi batteries from Home Depot so I can use them on my string trimmer. Their current promotion gives you a free tool if you buy two batteries so I’m wondering what everyone thinks I should get. I’m trying to decide between 5.5 inch circular saw and a Orbital Jig Saw. \n\nI currently have a drill/driver, impact gun, hacksaw, and Dremel. For DIY projects I feel capable doing simple stuff, not finishing work which is why I didn’t pick orbital sander and I already have a blower. What say ye reddit?", "link": "https://www.reddit.com/r/DIY/comments/obv8y2/circular_saw_vs_orbital_jig_saw/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "circular saw vs orbital jig saw /!/ looking for opinions.\n\ni am about to buy a two pack of 18v ryobi batteries from home depot so i can use them on my string trimmer. their current promotion gives you a free tool if you buy two batteries so i’m wondering what everyone thinks i should get. i’m trying to decide between 5.5 inch circular saw and a orbital jig saw. \n\ni currently have a drill/driver, impact gun, hacksaw, and dremel. for -----> diy !!!  projects i feel capable doing simple stuff, not finishing work which is why i didn’t pick orbital sander and i already have a blower. what say ye reddit?", "sortedWord": "None", "removed": null, "score": 1, "comments": 16, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/obv8y2/circular_saw_vs_orbital_jig_saw/", "identifyer": 332942, "year": "2021"}, {"Unnamed: 0": 333280, "autor": "bluetack_man", "date": 1614440386000, "content": "Renovating an old coal storage room, any tips on storage? /!/ Hey, I live in a pretty old house in the UK which has an original coal storage room. This is the room as it is now:\n\n[https://i.imgur.com/rDyjOKZ.jpg](https://i.imgur.com/rDyjOKZ.jpg)\n\nThe dimensions are: 110cm wide, 460cm long, 240cm tall.\n\nOr: 3.6 foot wide, 15 foot long, 8 foot tall.\n\nIts a nice long passage way between the front of the house leading to the back garden, and until now it has been totally full of useless junk that we haven't gotten around to clearing out. I've just spent a few hours clearing it out (why did we have 2 broken lawn mowers?!) and taking stuff to the skip.\n\nI am going to put up some shelving in here, but want to keep the passage way clear for walking down as it is a useful pathway to the back of the house, without going through the main house. So its good for taking a muddy dog through, or a wheelbarrow.\n\nI know a lot of you have amazing workshops with really cool storage, so I am after some tips. I've looked into shelving and probably just going to throw up some bracket shelving on one side, but want to make the most of the space. I need to store lots of long 2x4 timber, big sheets of plywood, ladders, general DIY things like screws, nails, tools, etc.", "link": "https://www.reddit.com/r/DIY/comments/ltqmxo/renovating_an_old_coal_storage_room_any_tips_on/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "renovating an old coal storage room, any tips on storage? /!/ hey, i live in a pretty old house in the uk which has an original coal storage room. this is the room as it is now:\n\n[https://i.imgur.com/rdyjokz.jpg](https://i.imgur.com/rdyjokz.jpg)\n\nthe dimensions are: 110cm wide, 460cm long, 240cm tall.\n\nor: 3.6 foot wide, 15 foot long, 8 foot tall.\n\nits a nice long passage way between the front of the house leading to the back garden, and until now it has been totally full of useless junk that we haven't gotten around to clearing out. i've just spent a few hours clearing it out (why did we have 2 broken lawn mowers?!) and taking stuff to the skip.\n\ni am going to put up some shelving in here, but want to keep the passage way clear for walking down as it is a useful pathway to the back of the house, without going through the main house. so its good for taking a muddy dog through, or a wheelbarrow.\n\ni know a lot of you have amazing workshops with really cool storage, so i am after some tips. i've looked into shelving and probably just going to throw up some bracket shelving on one side, but want to make the most of the space. i need to store lots of long 2x4 timber, big sheets of plywood, ladders, general -----> diy !!!  things like screws, nails, tools, etc.", "sortedWord": "None", "removed": null, "score": 3, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/ltqmxo/renovating_an_old_coal_storage_room_any_tips_on/", "identifyer": 333280, "year": "2021"}, {"Unnamed: 0": 333342, "autor": "amateurcraftsman", "date": 1615981030000, "content": "Kitchen cabinet recommendation for DIY install /!/ I'm interested in new kitchen cabinets. I've installed new kitchens in the past using KraftMaid cabinets from Home Depot. They ordered the cabinets and I installed them. I'm interested in doing something similar but wanted to shop around for price/quality/options. Are there any cabinets sold for DIY install? Perhaps sold online? I'm also interested in any companies that have DIY design tools. I have a pretty simple setup and would like mirror the type of cabinets that are already installed. Any suggestions?", "link": "https://www.reddit.com/r/DIY/comments/m6yg9k/kitchen_cabinet_recommendation_for_diy_install/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "kitchen cabinet recommendation for -----> diy !!!  install /!/ i'm interested in new kitchen cabinets. i've installed new kitchens in the past using kraftmaid cabinets from home depot. they ordered the cabinets and i installed them. i'm interested in doing something similar but wanted to shop around for price/quality/options. are there any cabinets sold for diy install? perhaps sold online? i'm also interested in any companies that have diy design tools. i have a pretty simple setup and would like mirror the type of cabinets that are already installed. any suggestions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/m6yg9k/kitchen_cabinet_recommendation_for_diy_install/", "identifyer": 333342, "year": "2021"}, {"Unnamed: 0": 333756, "autor": "ReverseMermaidMorty", "date": 1633041062000, "content": "How to tell which light switches/outlooks work in a detached garage? /!/ I’ll start this by saying I’m new to being a homeowner and don’t have a ton of DIY/electrical experience.\n\nSo I moved into an old house with a detached garage a couple months ago and half the switches and outlets in the garage don’t seem to work.\nThe only part that works is a single light switch that turns on a single lightbulb hanging in the middle. The light switch is surrounded by 4-5 other switches that don’t seem to do anything. \nThe garage does have an automatic door system that is no longer connect to the door, and also a lighting fixture/motion sensor pointed at the driveway that also doesn’t work. There are also other lighting fixtures inside the garage that don’t work, I’m guessing that’s what most of the other switches are connected to.\nMy main goal is to get that lighting fixture in the driveway working, with secondary goals of getting the other internal lights to work. \nHow would I go about working on this? What process should I follow? What tools would I need? Is this outside my scope and I should just call a professional?", "link": "https://www.reddit.com/r/DIY/comments/pyuj1f/how_to_tell_which_light_switchesoutlooks_work_in/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to tell which light switches/outlooks work in a detached garage? /!/ i’ll start this by saying i’m new to being a homeowner and don’t have a ton of -----> diy !!! /electrical experience.\n\nso i moved into an old house with a detached garage a couple months ago and half the switches and outlets in the garage don’t seem to work.\nthe only part that works is a single light switch that turns on a single lightbulb hanging in the middle. the light switch is surrounded by 4-5 other switches that don’t seem to do anything. \nthe garage does have an automatic door system that is no longer connect to the door, and also a lighting fixture/motion sensor pointed at the driveway that also doesn’t work. there are also other lighting fixtures inside the garage that don’t work, i’m guessing that’s what most of the other switches are connected to.\nmy main goal is to get that lighting fixture in the driveway working, with secondary goals of getting the other internal lights to work. \nhow would i go about working on this? what process should i follow? what tools would i need? is this outside my scope and i should just call a professional?", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/pyuj1f/how_to_tell_which_light_switchesoutlooks_work_in/", "identifyer": 333756, "year": "2021"}, {"Unnamed: 0": 334187, "autor": "EnvironmentalRise318", "date": 1626437461000, "content": "ADVICE FOR DIY ADJUSTABLE DUMBBELL COLLARS /!/ Hey guys, I need ideas to buy or mKe adjustable dumbbell collars go basically stop the weights from falling out while working out. I currently have these circular clamp things that u can easily tighten and loosen with a wrench but one of them has become damaged.", "link": "https://www.reddit.com/r/DIY/comments/olfmg5/advice_for_diy_adjustable_dumbbell_collars/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "advice for -----> diy !!!  adjustable dumbbell collars /!/ hey guys, i need ideas to buy or mke adjustable dumbbell collars go basically stop the weights from falling out while working out. i currently have these circular clamp things that u can easily tighten and loosen with a wrench but one of them has become damaged.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/olfmg5/advice_for_diy_adjustable_dumbbell_collars/", "identifyer": 334187, "year": "2021"}, {"Unnamed: 0": 334525, "autor": "nihilist_banana", "date": 1630403176000, "content": "My First DIY. It's very Basic, but I hope You all like it! /!/ Due to the pandemic, I moved back to my parent's home and was working on a 15 year old table since then.\n\nI was getting really irritated by the scratches, and the paint that would literally color my arms red if I sat on it too long.\n\n&amp;#x200B;\n\n[The table initially](https://preview.redd.it/s7vopd93ynk71.jpg?width=975&amp;format=pjpg&amp;auto=webp&amp;s=c475dcbdd076c6529439a17b78e1c13913e70b91)\n\n&amp;#x200B;\n\n[The end result](https://preview.redd.it/41vqu3tbznk71.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=c10585bcaac32a4bcc5cda9138c6789adb87e89c)\n\nSo I first tried to spray paint, but ran out of paint in the middle of the second coat.\n\n&amp;#x200B;\n\n[first coat of paint](https://preview.redd.it/02vc3h28ynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=17445acec1c668397ca4973c68012beb64909b63)\n\nThis is when I realized I did not like the finish, and instead of getting new paint, I decided to try vinyl.\n\n&amp;#x200B;\n\nI could not find vinyl broad enough to cover the whole table in a single piece, so decided to cover the edges first\n\n \n\n[One edge done](https://preview.redd.it/ywhad8fjynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=bc5dc090578a771c4af79d4a87ab7b45b7fbd6cd)\n\n[Second edge almost done](https://preview.redd.it/g0ig38fjynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=476a119e2b4af011c568daddb62dc6e08a576831)\n\nI could not figure out how to fold the corners too well though (I do not have any power tools or heat gun or hair drier).\n\n&amp;#x200B;\n\n[the corner](https://preview.redd.it/zw4x8c74znk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=ad78ea2c5adfb5e5fff955a25dac47113eefa2a8)\n\nAnd finally one long piece down the middle\n\n&amp;#x200B;\n\n[Finished](https://preview.redd.it/tr5ldah8znk71.jpg?width=4608&amp;format=pjpg&amp;auto=webp&amp;s=d4cddc23680bcb6afbeed8799f23374875f1ac67)\n\n&amp;#x200B;\n\nI don't know why, but I haven't felt this much accomplishment since the start of the pandemic. I'm really looking forward to doing more DIY now!", "link": "https://www.reddit.com/r/DIY/comments/pf2l82/my_first_diy_its_very_basic_but_i_hope_you_all/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my first -----> diy !!! . it's very basic, but i hope you all like it! /!/ due to the pandemic, i moved back to my parent's home and was working on a 15 year old table since then.\n\ni was getting really irritated by the scratches, and the paint that would literally color my arms red if i sat on it too long.\n\n&amp;#x200b;\n\n[the table initially](https://preview.redd.it/s7vopd93ynk71.jpg?width=975&amp;format=pjpg&amp;auto=webp&amp;s=c475dcbdd076c6529439a17b78e1c13913e70b91)\n\n&amp;#x200b;\n\n[the end result](https://preview.redd.it/41vqu3tbznk71.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=c10585bcaac32a4bcc5cda9138c6789adb87e89c)\n\nso i first tried to spray paint, but ran out of paint in the middle of the second coat.\n\n&amp;#x200b;\n\n[first coat of paint](https://preview.redd.it/02vc3h28ynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=17445acec1c668397ca4973c68012beb64909b63)\n\nthis is when i realized i did not like the finish, and instead of getting new paint, i decided to try vinyl.\n\n&amp;#x200b;\n\ni could not find vinyl broad enough to cover the whole table in a single piece, so decided to cover the edges first\n\n \n\n[one edge done](https://preview.redd.it/ywhad8fjynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=bc5dc090578a771c4af79d4a87ab7b45b7fbd6cd)\n\n[second edge almost done](https://preview.redd.it/g0ig38fjynk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=476a119e2b4af011c568daddb62dc6e08a576831)\n\ni could not figure out how to fold the corners too well though (i do not have any power tools or heat gun or hair drier).\n\n&amp;#x200b;\n\n[the corner](https://preview.redd.it/zw4x8c74znk71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=ad78ea2c5adfb5e5fff955a25dac47113eefa2a8)\n\nand finally one long piece down the middle\n\n&amp;#x200b;\n\n[finished](https://preview.redd.it/tr5ldah8znk71.jpg?width=4608&amp;format=pjpg&amp;auto=webp&amp;s=d4cddc23680bcb6afbeed8799f23374875f1ac67)\n\n&amp;#x200b;\n\ni don't know why, but i haven't felt this much accomplishment since the start of the pandemic. i'm really looking forward to doing more diy now!", "sortedWord": "None", "removed": null, "score": 1, "comments": 15, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/pf2l82/my_first_diy_its_very_basic_but_i_hope_you_all/", "identifyer": 334525, "year": "2021"}, {"Unnamed: 0": 334832, "autor": "Risket2017", "date": 1625108902000, "content": "Question about garage door springs /!/ Hi,\n\nI hope this is an appropriate spot for this sort of question.  I figured I'm trying to fix this myself, so /r/DIY it is!\n\nI recently purchased a home in this insane market, paying way too much but we got a nice place.\n\nAt any rate, some of the things that were wrong with the house we accepted as is, cause there was a line of people behind us waiting to snap up this house.  The other problems are pretty easy fixes, except for this:\n\n https://imgur.com/YaPkqQR \n\n https://imgur.com/pZ8I0K5 \n\nI had some difficulty getting a good shot of it, but the door is buckled at the top where the opener connects.\n\nIn addition, the right spring broke a couple of days ago.  After looking at the broken spring, and the other spring, I got to wondering about whether the correct springs were installed on this door.\n\nI relieved the tension on the remaining left spring (using the correct tools,being very patient, and taking great pains to make sure all safety precautions were followed), then weighed the door.\n\nThe dimensions and weight of the door are (door is insulated:\n\nHeight:  7'\n\nLength:  190\" or 15.8'\n\nWeight (taken after all spring tension was released):  157lbs\n\n&amp;#x200B;\n\nThe left spring measurements are:\n\nText on spring:  207-20\n\nWire diameter is 0.207\" (20 spring links = 4 1/8\")\n\nInside diameter: 1.75\" (Code on code is P175S, and I measured the ID using my calipers)\n\nLength:  20\"\n\n&amp;#x200B;\n\nRight spring measurements:\n\nText on spring:  192-17\n\nWire diameter is 0.192\" (20 spring links = 3.75\")\n\nInside diameter:  1.75\"\n\nLength 17.5\"\n\nPer this calculator here:  [https://ddmgaragedoors.com/springs/standard-torsion-springs.php?act=weight&amp;id=&amp;wire=&amp;length=&amp;height=&amp;id2=&amp;wire2=&amp;length2=&amp;weight=158&amp;wHeight=7&amp;radius=15&amp;wID=A&amp;springNum=2&amp;mfg=&amp;model=&amp;dimensions=&amp;num=&amp;struts=&amp;windows=](https://ddmgaragedoors.com/springs/standard-torsion-springs.php?act=weight&amp;id=&amp;wire=&amp;length=&amp;height=&amp;id2=&amp;wire2=&amp;length2=&amp;weight=158&amp;wHeight=7&amp;radius=15&amp;wID=A&amp;springNum=2&amp;mfg=&amp;model=&amp;dimensions=&amp;num=&amp;struts=&amp;windows=)  It seems that the springs that are on this door are too small.  In addition, there are screw indentions on the door spring shaft that seem to indicate that longer springs were installed on this door at one time.\n\nAm I correct in thinking that the springs on this door are too small, and that is what caused the door buckling and premature failure of the right spring?\n\n&amp;#x200B;\n\nThank you!", "link": "https://www.reddit.com/r/DIY/comments/obcwim/question_about_garage_door_springs/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "question about garage door springs /!/ hi,\n\ni hope this is an appropriate spot for this sort of question.  i figured i'm trying to fix this myself, so /r/-----> diy !!!  it is!\n\ni recently purchased a home in this insane market, paying way too much but we got a nice place.\n\nat any rate, some of the things that were wrong with the house we accepted as is, cause there was a line of people behind us waiting to snap up this house.  the other problems are pretty easy fixes, except for this:\n\n https://imgur.com/yapkqqr \n\n https://imgur.com/pz8i0k5 \n\ni had some difficulty getting a good shot of it, but the door is buckled at the top where the opener connects.\n\nin addition, the right spring broke a couple of days ago.  after looking at the broken spring, and the other spring, i got to wondering about whether the correct springs were installed on this door.\n\ni relieved the tension on the remaining left spring (using the correct tools,being very patient, and taking great pains to make sure all safety precautions were followed), then weighed the door.\n\nthe dimensions and weight of the door are (door is insulated:\n\nheight:  7'\n\nlength:  190\" or 15.8'\n\nweight (taken after all spring tension was released):  157lbs\n\n&amp;#x200b;\n\nthe left spring measurements are:\n\ntext on spring:  207-20\n\nwire diameter is 0.207\" (20 spring links = 4 1/8\")\n\ninside diameter: 1.75\" (code on code is p175s, and i measured the id using my calipers)\n\nlength:  20\"\n\n&amp;#x200b;\n\nright spring measurements:\n\ntext on spring:  192-17\n\nwire diameter is 0.192\" (20 spring links = 3.75\")\n\ninside diameter:  1.75\"\n\nlength 17.5\"\n\nper this calculator here:  [https://ddmgaragedoors.com/springs/standard-torsion-springs.php?act=weight&amp;id=&amp;wire=&amp;length=&amp;height=&amp;id2=&amp;wire2=&amp;length2=&amp;weight=158&amp;wheight=7&amp;radius=15&amp;wid=a&amp;springnum=2&amp;mfg=&amp;model=&amp;dimensions=&amp;num=&amp;struts=&amp;windows=](https://ddmgaragedoors.com/springs/standard-torsion-springs.php?act=weight&amp;id=&amp;wire=&amp;length=&amp;height=&amp;id2=&amp;wire2=&amp;length2=&amp;weight=158&amp;wheight=7&amp;radius=15&amp;wid=a&amp;springnum=2&amp;mfg=&amp;model=&amp;dimensions=&amp;num=&amp;struts=&amp;windows=)  it seems that the springs that are on this door are too small.  in addition, there are screw indentions on the door spring shaft that seem to indicate that longer springs were installed on this door at one time.\n\nam i correct in thinking that the springs on this door are too small, and that is what caused the door buckling and premature failure of the right spring?\n\n&amp;#x200b;\n\nthank you!", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/obcwim/question_about_garage_door_springs/", "identifyer": 334832, "year": "2021"}, {"Unnamed: 0": 336469, "autor": "Behind8Proxies", "date": 1621172905000, "content": "Need to widen exterior door opening in block/stucco home, need advice. /!/ My house has an exterior door in our master bath that leads to our patio/pool area.  I need to replace this door because it is starting to rot.  I would love to just replace the door itself, but the problem I'm having is that (I believe) it is a 80\"x28\" door (actual size 78 ^(7/8)\"x 27 ^(1/2)\")  I cannot find any doors this size.  The closest I can find is 80x30, but that means that I have to widen the opening 2 inches.\n\nI've done much DIY work, but cutting into masonry isn't one of them.  What would I need tool-wise?  And is this something that I can (or should) do myself?\n\nAny advice would be appreciated.", "link": "https://www.reddit.com/r/DIY/comments/ndopvn/need_to_widen_exterior_door_opening_in/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need to widen exterior door opening in block/stucco home, need advice. /!/ my house has an exterior door in our master bath that leads to our patio/pool area.  i need to replace this door because it is starting to rot.  i would love to just replace the door itself, but the problem i'm having is that (i believe) it is a 80\"x28\" door (actual size 78 ^(7/8)\"x 27 ^(1/2)\")  i cannot find any doors this size.  the closest i can find is 80x30, but that means that i have to widen the opening 2 inches.\n\ni've done much -----> diy !!!  work, but cutting into masonry isn't one of them.  what would i need tool-wise?  and is this something that i can (or should) do myself?\n\nany advice would be appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ndopvn/need_to_widen_exterior_door_opening_in/", "identifyer": 336469, "year": "2021"}, {"Unnamed: 0": 336740, "autor": "fetherbed", "date": 1625792414000, "content": "Leak in threaded brass fitting - first DIY plumbing project. /!/ I just finished installing our new shower valve, and I'm getting a slow leak from the connection between the shower valve and the brass PEX adapter. Its a threaded connection and the male threads were wound with about 3 turns of teflon tape. I'm getting about 1 drop every 1 to 2 seconds on both the hot and cold side. When making the connection I first went hand tight, then used two wrenches to get it tighter.\n\nWhat might I be doing wrong? Any help is greatly appreciated.", "link": "https://www.reddit.com/r/DIY/comments/ogkqfi/leak_in_threaded_brass_fitting_first_diy_plumbing/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "leak in threaded brass fitting - first -----> diy !!!  plumbing project. /!/ i just finished installing our new shower valve, and i'm getting a slow leak from the connection between the shower valve and the brass pex adapter. its a threaded connection and the male threads were wound with about 3 turns of teflon tape. i'm getting about 1 drop every 1 to 2 seconds on both the hot and cold side. when making the connection i first went hand tight, then used two wrenches to get it tighter.\n\nwhat might i be doing wrong? any help is greatly appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 18, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ogkqfi/leak_in_threaded_brass_fitting_first_diy_plumbing/", "identifyer": 336740, "year": "2021"}, {"Unnamed: 0": 336975, "autor": "csupermercado", "date": 1620512494000, "content": "Desk Build Help /!/ Hi everyone,\n\nThis is my first DIY project and I am planning on building a desk for my room. I am curious about what type of wood I should use and what tools I should need. Additional note, I will be painting the wood and I was wondering if that should be done pre or post-putting together.", "link": "https://www.reddit.com/r/DIY/comments/n7zz9j/desk_build_help/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "desk build help /!/ hi everyone,\n\nthis is my first -----> diy !!!  project and i am planning on building a desk for my room. i am curious about what type of wood i should use and what tools i should need. additional note, i will be painting the wood and i was wondering if that should be done pre or post-putting together.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/n7zz9j/desk_build_help/", "identifyer": 336975, "year": "2021"}, {"Unnamed: 0": 337631, "autor": "androlyn", "date": 1624459847000, "content": "First Time Ladder Buyer - Need Recommendations. /!/ I just moved into a new 4 story house and looking to pick up some tools. Using Google I've narrowed down a lot of what I need but I am having trouble with ladders.  \n\n\nI wouldn't exactly be Mr DIY but I would like to do odd jobs here and there instead of calling out a handyman. House is a bit tall so i wouldn't be clearing gutters or doing any work over the second floor.  \n\n\nWas thinking about a telescopic ladder but reviews say they're really unsafe. In short I'm looking for a reliable ladder that can help me out with odd jobs in and outside the house for less than $150 - no Chinese/Amazon knockoffs.  \n\n\nAlthough I would love a small closed height ladder, quality and usability is my preference - have an alleyway for storage if needs be.  \n\n\nAny help would be greatly appreciated.", "link": "https://www.reddit.com/r/DIY/comments/o6ecry/first_time_ladder_buyer_need_recommendations/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "first time ladder buyer - need recommendations. /!/ i just moved into a new 4 story house and looking to pick up some tools. using google i've narrowed down a lot of what i need but i am having trouble with ladders.  \n\n\ni wouldn't exactly be mr -----> diy !!!  but i would like to do odd jobs here and there instead of calling out a handyman. house is a bit tall so i wouldn't be clearing gutters or doing any work over the second floor.  \n\n\nwas thinking about a telescopic ladder but reviews say they're really unsafe. in short i'm looking for a reliable ladder that can help me out with odd jobs in and outside the house for less than $150 - no chinese/amazon knockoffs.  \n\n\nalthough i would love a small closed height ladder, quality and usability is my preference - have an alleyway for storage if needs be.  \n\n\nany help would be greatly appreciated.", "sortedWord": "None", "removed": null, "score": 1, "comments": 12, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o6ecry/first_time_ladder_buyer_need_recommendations/", "identifyer": 337631, "year": "2021"}, {"Unnamed: 0": 338230, "autor": "Alternative-Salt-672", "date": 1634956474000, "content": "DIY Wrench to open an umbrella base /!/ Not really handy but willing to learn.\n\nI need to open an umbrella base that comes with a steel wrench like the ones in the image. \n\nIt's essentially a lever/pipe with prongs that fit the base.\n\nA new one costs too much so hoping to find a cheaper solution. Thank you!\n\nhttps://preview.redd.it/2tiblzcc34v71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=324df4e98c42fc8f60f3dc0bf445e089d9b12932\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qi7dm4db34v71.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=afcbb2a2f5d976c3251767f63f07cb53e71327e8", "link": "https://www.reddit.com/r/DIY/comments/qdw1nr/diy_wrench_to_open_an_umbrella_base/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  wrench to open an umbrella base /!/ not really handy but willing to learn.\n\ni need to open an umbrella base that comes with a steel wrench like the ones in the image. \n\nit's essentially a lever/pipe with prongs that fit the base.\n\na new one costs too much so hoping to find a cheaper solution. thank you!\n\nhttps://preview.redd.it/2tiblzcc34v71.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=324df4e98c42fc8f60f3dc0bf445e089d9b12932\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qi7dm4db34v71.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=afcbb2a2f5d976c3251767f63f07cb53e71327e8", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/qdw1nr/diy_wrench_to_open_an_umbrella_base/", "identifyer": 338230, "year": "2021"}, {"Unnamed: 0": 338260, "autor": "CG_Ops", "date": 1634931830000, "content": "DIY Tool Chest Rust Removal Project - A fun electrolysis project with my daughter", "link": "https://www.reddit.com/r/DIY/comments/qdongt/diy_tool_chest_rust_removal_project_a_fun/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  tool chest rust removal project - a fun electrolysis project with my daughter", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": "link", "medialink": "https://imgur.com/a/BHxbl", "identifyer": 338260, "year": "2021"}, {"Unnamed: 0": 338432, "autor": "JJX77", "date": 1634280105000, "content": "Laundry room reno DIY. /!/ https://imgur.com/a/2orZ0kp\n\nI renovated the laundry room in house we just moved into. The link hold progress pics the best I could take.\n\nDemo:\nPicture 1) I removed existing washer/dryer units by disconnecting them and pulling them out. I used a pry bar to remove existing baseboards. There is a gap in photos as I wasn’t taking many pics during demo so I will explain and hopefully that will suffice…\nI opened the cabinet doors and unscrewed whatever screws I could find. That didn’t loosen the cabinets. So I put on a hard hat and glasses, and ripped them out of the wall with my hands.\nThere was existing linoleum flooring. I jammed a floor scraper under and it and ripped it up, exposing the sub floor.\n\nNow at photo 2&amp;3 - We then needed to move the plumbing from left wall to back wall. I used a drywall saw to cut into and remove the sheetrock to expose plumbing. I hired someone to do the plumbing work for insurance reasons. They extended the plumbing lines from the left wall to the back wall.\n\nPhoto 4-5:I needed to address cracked or broken subfloor in the middle of the room. The subfloor was split between two joists. So I marked out where the joists were, and used a circular saw to cut out a rectangle. Leaving the hole you see in photos.\nThen I measured the inside dimensions between the joists I needed to patch, and built a simple square frame from construction grade 2x4s. I wedged this box frame in, and used construction screws to connect it to the existing floor joists.\nI then measured the thickness of existing subfloor plywood (picture 6) bought a matching piece, and used table saw to cut it to fit.\nI layer this subfloor patch over my box frame, and screwed it down.\n\nThen. I used 5/8” drywall and measured the patches I needed. I cut them to size and installed them how you install drywall. \nI used compound to fill the gaps, then taped with joint tape and 3 coated with compound. \nI primed and painted the walls with Ben Moore Aqualock and regal select.\n\nPicture 7) Then moved onto the floor. Not shown, I used self leveling concrete mixture. Just mixed according to instructions, poured on floor and lightly spread with a 24” trowel. Let dry. Then photo 7, I started to put down the coupling mat. This is a Redgard coupling mat, with tape. I measured out the room against the mat dimensions, and then precut the mat using a drywall knife and straight edge. \nThen used the recommended mortar system and a notched trowel to install. I mixed the mortar with water per instx, then used notched trowel to lay it over floor. Then rolled down the mat on top. \nThen used Redgard tape and mortar to seal seams between the mat, and the walls.\n\nThen I took the tile that my wife wanted (hex tile bought from an online tile store) and laid it out.  I measured the room dimensions vs the tile to determine best layout, and how to cut tiles. I marked the tiles I needed to cut \nI bought a cheap tile cutter from HD and cut them.\nThen I used quickset and spacers to lay the tile. I can’t teach you this, I’ve done it once and just followed youtube instx. I broke a bunch of tiles and installed a bunch wrong. It was a learning experience.\nThen I grouted the tile, and wiped it down excessively.\n\nThen I bought “pre primed nickel gap shiplap” from Home Depot, in 8 foot lengths.\nI measured the wall and used a miter saw to cut the pieces to proper length. \nI used construction adhesive PL200 from a caulk gun to apply glue to the back of the cut shiplap. Starting from bottom I glued on, then nailed into studs with a 16ga nail gun.\nI used standard white latex caulk to fill in the sides where cuts weren’t perfect.\n\nSigh.\n\nThen. I bought pine baseboards from Home Depot. I measured the walls and used a compound miter saw to cut them appropriately. I installed them the same with PL200 and 16ga nails.\n\nThen. I asked my wife where Pinterest said to put the cabinets and shelves. I bought those all prefinished from HD. Cut them to size and screwed then in.\nThen pushed in the washer and dryer and has the delivery guys hook them up.\nThen I got a marble saddle, undercut the door jamb 1/2 inch with a multi tool, put glue on the bottom of the saddle and wedged it in.\nThen I took the door, and used a table saw with rip cut guide to shave off 1/2” from the bottom.\n\nAnd then I put it back on the hinges with a screw gun.\n\nAnd now we have clean clothes.", "link": "https://www.reddit.com/r/DIY/comments/q8ilhc/laundry_room_reno_diy/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "laundry room reno -----> diy !!! . /!/ https://imgur.com/a/2orz0kp\n\ni renovated the laundry room in house we just moved into. the link hold progress pics the best i could take.\n\ndemo:\npicture 1) i removed existing washer/dryer units by disconnecting them and pulling them out. i used a pry bar to remove existing baseboards. there is a gap in photos as i wasn’t taking many pics during demo so i will explain and hopefully that will suffice…\ni opened the cabinet doors and unscrewed whatever screws i could find. that didn’t loosen the cabinets. so i put on a hard hat and glasses, and ripped them out of the wall with my hands.\nthere was existing linoleum flooring. i jammed a floor scraper under and it and ripped it up, exposing the sub floor.\n\nnow at photo 2&amp;3 - we then needed to move the plumbing from left wall to back wall. i used a drywall saw to cut into and remove the sheetrock to expose plumbing. i hired someone to do the plumbing work for insurance reasons. they extended the plumbing lines from the left wall to the back wall.\n\nphoto 4-5:i needed to address cracked or broken subfloor in the middle of the room. the subfloor was split between two joists. so i marked out where the joists were, and used a circular saw to cut out a rectangle. leaving the hole you see in photos.\nthen i measured the inside dimensions between the joists i needed to patch, and built a simple square frame from construction grade 2x4s. i wedged this box frame in, and used construction screws to connect it to the existing floor joists.\ni then measured the thickness of existing subfloor plywood (picture 6) bought a matching piece, and used table saw to cut it to fit.\ni layer this subfloor patch over my box frame, and screwed it down.\n\nthen. i used 5/8” drywall and measured the patches i needed. i cut them to size and installed them how you install drywall. \ni used compound to fill the gaps, then taped with joint tape and 3 coated with compound. \ni primed and painted the walls with ben moore aqualock and regal select.\n\npicture 7) then moved onto the floor. not shown, i used self leveling concrete mixture. just mixed according to instructions, poured on floor and lightly spread with a 24” trowel. let dry. then photo 7, i started to put down the coupling mat. this is a redgard coupling mat, with tape. i measured out the room against the mat dimensions, and then precut the mat using a drywall knife and straight edge. \nthen used the recommended mortar system and a notched trowel to install. i mixed the mortar with water per instx, then used notched trowel to lay it over floor. then rolled down the mat on top. \nthen used redgard tape and mortar to seal seams between the mat, and the walls.\n\nthen i took the tile that my wife wanted (hex tile bought from an online tile store) and laid it out.  i measured the room dimensions vs the tile to determine best layout, and how to cut tiles. i marked the tiles i needed to cut \ni bought a cheap tile cutter from hd and cut them.\nthen i used quickset and spacers to lay the tile. i can’t teach you this, i’ve done it once and just followed youtube instx. i broke a bunch of tiles and installed a bunch wrong. it was a learning experience.\nthen i grouted the tile, and wiped it down excessively.\n\nthen i bought “pre primed nickel gap shiplap” from home depot, in 8 foot lengths.\ni measured the wall and used a miter saw to cut the pieces to proper length. \ni used construction adhesive pl200 from a caulk gun to apply glue to the back of the cut shiplap. starting from bottom i glued on, then nailed into studs with a 16ga nail gun.\ni used standard white latex caulk to fill in the sides where cuts weren’t perfect.\n\nsigh.\n\nthen. i bought pine baseboards from home depot. i measured the walls and used a compound miter saw to cut them appropriately. i installed them the same with pl200 and 16ga nails.\n\nthen. i asked my wife where pinterest said to put the cabinets and shelves. i bought those all prefinished from hd. cut them to size and screwed then in.\nthen pushed in the washer and dryer and has the delivery guys hook them up.\nthen i got a marble saddle, undercut the door jamb 1/2 inch with a multi tool, put glue on the bottom of the saddle and wedged it in.\nthen i took the door, and used a table saw with rip cut guide to shave off 1/2” from the bottom.\n\nand then i put it back on the hinges with a screw gun.\n\nand now we have clean clothes.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/q8ilhc/laundry_room_reno_diy/", "identifyer": 338432, "year": "2021"}, {"Unnamed: 0": 338665, "autor": "Xeron-", "date": 1625024768000, "content": "Need Help Fixing scratches on metal shower head during installation /!/ Soooo, I got a nice Moen showerhead to replace the utterly trash one that my apartment building has on (even the small shower handle on the new head has better diameter to it's spray). I looked at the new head, looked at the old head, grabbed a wrench and made the switch...only to THEN watch a DIY video and realize I needed a protector between the wrench and head...and yes, is pretty scratched up. It looks like chrome finish on metal for the attachment...any way to fix it or is it a forever mistake\n\nhttps://preview.redd.it/uuvgcx7frb871.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=56a24c86b5ac612a2fa273a65751267416ba2db1", "link": "https://www.reddit.com/r/DIY/comments/oaouif/need_help_fixing_scratches_on_metal_shower_head/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need help fixing scratches on metal shower head during installation /!/ soooo, i got a nice moen showerhead to replace the utterly trash one that my apartment building has on (even the small shower handle on the new head has better diameter to it's spray). i looked at the new head, looked at the old head, grabbed a wrench and made the switch...only to then watch a -----> diy !!!  video and realize i needed a protector between the wrench and head...and yes, is pretty scratched up. it looks like chrome finish on metal for the attachment...any way to fix it or is it a forever mistake\n\nhttps://preview.redd.it/uuvgcx7frb871.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=56a24c86b5ac612a2fa273a65751267416ba2db1", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oaouif/need_help_fixing_scratches_on_metal_shower_head/", "identifyer": 338665, "year": "2021"}, {"Unnamed: 0": 339066, "autor": "Brews-n-Roasts", "date": 1613450632000, "content": "Taking advantage of low interest rates to remodel kitchen for basically free (interest savings). /!/ The wife and I have wanted to redo our kitchen for years. We purchased our house with a 30 year mortgage and payed on it for 14 years, refinanced once for lower percentage rate and same amount of years left to payoff. Now with interest rates dropping as low as they are, we refinanced again for a 15 year mortgage (16 left on old mortgage) and took out13K to redo the kitchen with lower monthly payments (setup with bi-weekly payments to pay off even faster). We did 100% of the demo, wiring, plumbing, and cabinet installation ourselves, so that the money could go to materials. This process was a nightmare for many reasons, but in the end we absolutely love the result. We started this project in mid-April and finished in mid-October, so six months from ordering materials to completion. There were Covid delays every step of the way, but we were only out of a fully functioning kitchen for 2.5 months (2 months longer than planned). The 13K budget was for cabinets and countertops, the new appliances were on top of that. I learned a LOT in the process and have a few new tools for the next project (this is my first kitchen remodel). Hopefully other DIY Home improver’s (AKA too frugal to pay someone else top dollar to do it for you ... at least that is my case) find this inspiring and a way to accomplish their house dream renovations for \"free-ish\" (mortgage interest savings).\n\nHere is the kitchen that we started with.\n\n&amp;#x200B;\n\n[This is the kitchen that we started with. Old cabinets stopping 12\\\\\" shy of the ceiling. Notice the inset drawer faces at the angled sections!](https://preview.redd.it/vb52hf19hrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=0f17f60e08da9e54481fc016536e8afb4464c2ee)\n\nOnce the mortgage was going through, the first step was to measure the existing cabinet layout, making layout changes, and start looking at on-line cabinet options. There are many options out there, but finding one suite of cabinets that fit your needs is a difficult proposition where you can find 90% of what you need, but that one or two cabinets of odd dimensions is not available. At that point, you have to start again with a different cabinet builder. Ultimately, we went with semi-custom Manganite (color) cabinets from Home Depot’s on-line store. The price was right and we were able to get what we wanted in the 13 matching cabinets that we needed to order. The cabinets came with soft close doors and drawers. To aid in this part of the process, I suggest taking measurements and drawing out a schematic of your “vision” for final cabinet design. Our changed layout included extension of top cabinets all the way to the ceiling, extending the cabinet above the refrigerator to be 24” deep instead of previous 12”depth, redesigning the stove hood type from a 90 degree into the wall to straight up through the roof, and extending the peninsula depth to include 12” deep base cabinets on the back side of the peninsula.\n\nHere is that rough sketch: \n\n&amp;#x200B;\n\n[Here is the rough sketch of the new kitchen layout.](https://preview.redd.it/yink8v1qhrh61.jpg?width=1700&amp;format=pjpg&amp;auto=webp&amp;s=94482d1a0be0c5c29061a0f18838d195193f45a3)\n\nFrom this layout sketch and size of cabinets available, we were able to identify where spacers were needed. For instance, the 13.5” space currently to the right of the stove was to be filled with a 12” cabinet, so a 1.5” finished same color spacer would be needed to attach to the edge of that cabinet to fill the extra space (top and bottom cabinets). We ordered 3” spacers that could be cut to fit throughout this project, as needed. I originally purchased a jig saw to accomplish cutting these with a jig, but quickly decided (first cut) that I needed a real table saw to make these cuts precise and uniformly straight.\n\n&amp;#x200B;\n\n[This is the table saw and jig saw used for this project. The table saw was used for the straight spacer cuts and the jig saw for electric box, vent, and plumbing cuts.](https://preview.redd.it/095d1dd2irh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=acd3c3fab593ef705696a66e2cd16ce1f037d705)\n\nOnce the layout was finalized and cabinets ordered, it was a hurry up and wait scenario. Covid-19 associated delays in manufacturing of the cabinets and associated hardware delayed the original delivery date for the cabinets by 1.5 months. Original delivery commitment was mid-June, but we ended up getting the cabinets at the end of July. Covid or not, delays may happen at any time, so I strongly suggest refraining from demo until the cabinets are in and inspected for a complete order and satisfaction. Otherwise, you may be waiting another 2 months for a replacement that is required to move forward with the project and a prematurely dismantled kitchen. At the same time, give yourself time for unexpected surprises behind your existing cabinets and feel free to demo what you can live without.\n\n&amp;#x200B;\n\n[This is the wall with the previous vent and holes where tile was expected in the new kitchen. Electric was also in the wrong place for the new kitchen plan.](https://preview.redd.it/u7nrm8boirh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=87c443a4f87c798852a71e6963fba533e7f7167d)\n\nThis was the wall behind the stove cabinets with holes in the drywall where I expected to have tile in the new kitchen, so I ended up with more work than expected and happy that I did this while waiting for cabinets. Also note the location of the vent out tube and the electric box. Both of those had to be moved. The vent was redirected straight up through the roof and the electric box was moved to be hidden behind the stainless steel vent column. This included placing some 2x4 studs within the wall to accommodate the mounting of the new electric box location and hood mount (no photo, but just cutting a 2/4 to size and screwing to existing studs where you want them, simple and minor). With those changes made, it was simple cutting a new drywall piece and screwing back into place (to cut drywall in a straight line, scour the drywall cut line with a razor blade, then bend at scour and you have a straight cut piece).  \n\n&amp;#x200B;\n\n[Here you can see the new drywall with the moved electric box.  Also moved the drywall seam to below the counter tops for ease of hiding that joint. The rest will be tiled or covered by cabinets.](https://preview.redd.it/b2zufxkojrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=ed3b96e685c824a97f3b1ca81b4370d26c866316)\n\nNow that cabinets are delivered/approved and I have the area behind the stove reconfigured ahead of time, I have the real work ahead … Demo and installation. Knowing that once demolition hit we would not have a kitchen, I scheduled counter top measurements for the following Monday to give me 9 days to finish cabinet installation. Cabinet removal was pretty easy with just a few screws holding them to the wall and a couple screws holding them to the adjacent cabinet. Remove screws and remove cabinets. Some screws were stripped where I needed to use vise-grips to grab the heads and slowly remove them. The countertops came up easily with a few upward pulls. This part was pretty simple and straight forward. If you remove all the screws and the cabinet does not move, look again because you missed a screw somewhere. I worked my way from right to left around the kitchen to minimize time without a sink/dishwasher (above/below pictures).\n\n&amp;#x200B;\n\n[Installation of cabinets. Notice the temporary level guide board on the back wall for the upper cabinets.  ](https://preview.redd.it/4y3dnrtbkrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=3a0f2710702d104ef78a857a0eeabdc9472e24e8)\n\nInstallation of the upper cabinets was pretty quick and easy. The process entails measuring down from the ceiling to where the base of the cabinets are going to sit, attach a horizontal board at that level line, perch the cabinet on the board and screw them into the wall studs through the back of the cabinets. Also place screws into the adjacent cabinet sides, as applicable. In the above picture, you can see the use of a board to place the stove cabinets in place and level. You will also notice that the old sink cabinet is still in place. That is because the plumbing needed to be disconnected to remove that cabinet, but I could not turn off the main water to the house due to a previously unknown been hive at the shut-off (they would start attacking when within 10 ft … Africanized bees and mean). With a looming deadline and a budget, here is my multi-layer “bee suit” and flying insect killer used to attack that hive. I also went out at the coldest part of the night (summer in AZ so not that cool, but late). \n\n[Middle of AZ summer with layers and every bit of flesh covered \\(missed the nose\\) to battle the bee hive ... I am moderately allergic.](https://preview.redd.it/tf2ryqzrkrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=6405a5f8fd6b8b0e30e8b9f36ad6dd2be5f20f95)\n\n&amp;#x200B;\n\n[This is the 4.5 lb hive that had to be removed in order for me to continue with the project. Flying Insect spray applied for two nights before I was able to approach successfully. ](https://preview.redd.it/zadpmobrlrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=133f5f3ced972e0287bfe58f55168db9d739b58a)\n\nOnce the hive was taken care of, I could turn off the water and take a torch to the copper pipes, remove the copper plumbing apparatus, and sweat on copper caps to those copper inlet pipes. I am sure there are many sources and videos detailing sweating copper, so watch those and don’t listen to me. In general, it just takes a torch, silver solder, flux, and a slice of bread. Turn off the main water, heat the soldered joint until you can pull the connection apart. Water will run out of the pipe, so have a bucket ready. Stuff a little bread into the inlet pipe, add flux to the outside rim, connect copper end cap, heat until the silver solder melts into the joint, turn on water, and check for leaks. At this point the old sink cabinet can slide right out (after removing the screws from back wall and sides of adjacent cabinets). Important: keep the drain trap attached and full of water to keep sewage smell from emanating throughout the house. Disconnect shortly as needed, but replace and fill.\n\nI have covered the ease of installing the upper cabinets, now for the lower base cabinets. Installation of the base cabinets were a challenge. I had granite countertops ordered for installation, so being level was paramount (front/back/left/right and across the entire kitchen). I used a combination of a 4 ft level (across cabinets) and a couple 1 ft levels (front/back on each cabinet) and started working from right to left around the kitchen with wedges under the cabinets where needed to get them exactly level. Unfortunately, as I worked my way around, I would find a new high point and would have to work backwards to fix what I had already done. Then I would move forward again to find a new high point, causing me to work backwards again. After three redoes of the lower cabinets from stove to peninsula, I finally borrowed a laser level to find the high point in the room and work backwards from there which happened to be the area that I planned to set in place last.(back corner of the expanded peninsula). We are talking about minutia of fine tweaking, so no photos will help to explain. In the end, I ordered the “EZ Leveler” kits for each of my lower cabinets and the fine tuning was simple moving forward. These kits involve drilling holes in the face plates of the lower cabinets and screwing in the levelers to the front and back of each cabinet. Once installed, you can adjust the front and back heights with a simple turn to make fine adjustments (see picture). These are then covered up by the base plates. \n\n[These are the ex level adjustments. The top knobs raise and lower the back and the lower ones raise and lower the front.  Micro adjustments were super easy using these.](https://preview.redd.it/s0dqj99umrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=d31499a4acc2218bf955b98c5a87f99c493556f0)\n\n&amp;#x200B;\n\n[Once cabinets are in place, the kick board cover the holes and levelers.](https://preview.redd.it/9h9wek31orh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=027769b71ec9dd0d7af4d994d10a811ff0209d0e)\n\nOther than leveling, the other major issue I was running into is where my kitchen layout had non-90 degree angles (cabinet options are available to handle 90 degree turns as a single unit). The old cabinet doors and drawers had faces smaller than the actual cabinets and the new ones were as wide as the cabinets. This created clearance issues with opening and closing drawers at the angle points. Those same clearances were exacerbated by addition of handles. I used all of the spacer boards in my original design to shift everything way from those angle points to provide at least minimal clearances without cutting drawer fronts. In the end, I still had to cut one handle to make things work.\n\n&amp;#x200B;\n\n[Here you can see the tight clearances that I had with the drawer faces and the one handle that was cut short on the left side.](https://preview.redd.it/mc24d6ejorh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=2d71bf651dfb3a43d503e6d968f613154b2cd015)\n\n&amp;#x200B;\n\n[Even with the handle cut, I barely had the clearance I needed.](https://preview.redd.it/g606ma7torh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=4c5562e0f33564c128dd5814473a2a023ff01383)\n\nAt this point, I successfully reached my 9-day window to have cabinets in place and ready for the counter tops to be measured. \n\n&amp;#x200B;\n\n[Here are the cabinets installed, level, and ready for the Granite measurements and installation. \\(My final product\\)](https://preview.redd.it/5zjw1o94prh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=ee49e1731e47ddc9889ebffe1daf99eae0cd2300)\n\nFrom here, the counter tops were measured promptly, but cutting and installation was stalled for 2.5 months. We lived with it on disposable plates/cutlery/cups … and washing other dishes from the front yard hose (back yard was tied to the kitchen water input so was capped and non-functional). If delays are expected, I suggest installing a temporary sink, temporary plumbing and not taking the long wait. I just believed the short delay, by short delay, by short delay excuses long enough that it no longer mattered. \n\n&amp;#x200B;\n\n[Here would be your temporary sink option that could have been plumbed and used during the unexpected 2.5 month wait.](https://preview.redd.it/biopikncprh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=d24fd4e0cd53f7ac345d5c93f2284c2c33cfa8bf)\n\nThe final bit of this piece is the final product with counter tops and the stove back splash. Granite counter tops come with installation, so not DIY. The back tile at the stove gave me an opportunity to give my neighbor who owns a tile install company a small job, so also not DIY. I take credit and criticism for everything else. I know that I need to replace that pantry door … and change the door knob. My plan is to custom make the pantry door, which will be another project.  I have tried to explain this process thoroughly, but I am happy to answer any questions that people may have.\n\n&amp;#x200B;\n\n[Here is the final result of the kitchen remodel.  In total, about 7K for the cabinets and 4.5k for the granite.  Came in at budget plus the cost of a few new tools.](https://preview.redd.it/c7u27aduprh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=c1338f76aa2bcafd2368835bd89cbe0dbe83814c)", "link": "https://www.reddit.com/r/DIY/comments/lkw20l/taking_advantage_of_low_interest_rates_to_remodel/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "taking advantage of low interest rates to remodel kitchen for basically free (interest savings). /!/ the wife and i have wanted to redo our kitchen for years. we purchased our house with a 30 year mortgage and payed on it for 14 years, refinanced once for lower percentage rate and same amount of years left to payoff. now with interest rates dropping as low as they are, we refinanced again for a 15 year mortgage (16 left on old mortgage) and took out13k to redo the kitchen with lower monthly payments (setup with bi-weekly payments to pay off even faster). we did 100% of the demo, wiring, plumbing, and cabinet installation ourselves, so that the money could go to materials. this process was a nightmare for many reasons, but in the end we absolutely love the result. we started this project in mid-april and finished in mid-october, so six months from ordering materials to completion. there were covid delays every step of the way, but we were only out of a fully functioning kitchen for 2.5 months (2 months longer than planned). the 13k budget was for cabinets and countertops, the new appliances were on top of that. i learned a lot in the process and have a few new tools for the next project (this is my first kitchen remodel). hopefully other -----> diy !!!  home improver’s (aka too frugal to pay someone else top dollar to do it for you ... at least that is my case) find this inspiring and a way to accomplish their house dream renovations for \"free-ish\" (mortgage interest savings).\n\nhere is the kitchen that we started with.\n\n&amp;#x200b;\n\n[this is the kitchen that we started with. old cabinets stopping 12\\\\\" shy of the ceiling. notice the inset drawer faces at the angled sections!](https://preview.redd.it/vb52hf19hrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=0f17f60e08da9e54481fc016536e8afb4464c2ee)\n\nonce the mortgage was going through, the first step was to measure the existing cabinet layout, making layout changes, and start looking at on-line cabinet options. there are many options out there, but finding one suite of cabinets that fit your needs is a difficult proposition where you can find 90% of what you need, but that one or two cabinets of odd dimensions is not available. at that point, you have to start again with a different cabinet builder. ultimately, we went with semi-custom manganite (color) cabinets from home depot’s on-line store. the price was right and we were able to get what we wanted in the 13 matching cabinets that we needed to order. the cabinets came with soft close doors and drawers. to aid in this part of the process, i suggest taking measurements and drawing out a schematic of your “vision” for final cabinet design. our changed layout included extension of top cabinets all the way to the ceiling, extending the cabinet above the refrigerator to be 24” deep instead of previous 12”depth, redesigning the stove hood type from a 90 degree into the wall to straight up through the roof, and extending the peninsula depth to include 12” deep base cabinets on the back side of the peninsula.\n\nhere is that rough sketch: \n\n&amp;#x200b;\n\n[here is the rough sketch of the new kitchen layout.](https://preview.redd.it/yink8v1qhrh61.jpg?width=1700&amp;format=pjpg&amp;auto=webp&amp;s=94482d1a0be0c5c29061a0f18838d195193f45a3)\n\nfrom this layout sketch and size of cabinets available, we were able to identify where spacers were needed. for instance, the 13.5” space currently to the right of the stove was to be filled with a 12” cabinet, so a 1.5” finished same color spacer would be needed to attach to the edge of that cabinet to fill the extra space (top and bottom cabinets). we ordered 3” spacers that could be cut to fit throughout this project, as needed. i originally purchased a jig saw to accomplish cutting these with a jig, but quickly decided (first cut) that i needed a real table saw to make these cuts precise and uniformly straight.\n\n&amp;#x200b;\n\n[this is the table saw and jig saw used for this project. the table saw was used for the straight spacer cuts and the jig saw for electric box, vent, and plumbing cuts.](https://preview.redd.it/095d1dd2irh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=acd3c3fab593ef705696a66e2cd16ce1f037d705)\n\nonce the layout was finalized and cabinets ordered, it was a hurry up and wait scenario. covid-19 associated delays in manufacturing of the cabinets and associated hardware delayed the original delivery date for the cabinets by 1.5 months. original delivery commitment was mid-june, but we ended up getting the cabinets at the end of july. covid or not, delays may happen at any time, so i strongly suggest refraining from demo until the cabinets are in and inspected for a complete order and satisfaction. otherwise, you may be waiting another 2 months for a replacement that is required to move forward with the project and a prematurely dismantled kitchen. at the same time, give yourself time for unexpected surprises behind your existing cabinets and feel free to demo what you can live without.\n\n&amp;#x200b;\n\n[this is the wall with the previous vent and holes where tile was expected in the new kitchen. electric was also in the wrong place for the new kitchen plan.](https://preview.redd.it/u7nrm8boirh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=87c443a4f87c798852a71e6963fba533e7f7167d)\n\nthis was the wall behind the stove cabinets with holes in the drywall where i expected to have tile in the new kitchen, so i ended up with more work than expected and happy that i did this while waiting for cabinets. also note the location of the vent out tube and the electric box. both of those had to be moved. the vent was redirected straight up through the roof and the electric box was moved to be hidden behind the stainless steel vent column. this included placing some 2x4 studs within the wall to accommodate the mounting of the new electric box location and hood mount (no photo, but just cutting a 2/4 to size and screwing to existing studs where you want them, simple and minor). with those changes made, it was simple cutting a new drywall piece and screwing back into place (to cut drywall in a straight line, scour the drywall cut line with a razor blade, then bend at scour and you have a straight cut piece).  \n\n&amp;#x200b;\n\n[here you can see the new drywall with the moved electric box.  also moved the drywall seam to below the counter tops for ease of hiding that joint. the rest will be tiled or covered by cabinets.](https://preview.redd.it/b2zufxkojrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=ed3b96e685c824a97f3b1ca81b4370d26c866316)\n\nnow that cabinets are delivered/approved and i have the area behind the stove reconfigured ahead of time, i have the real work ahead … demo and installation. knowing that once demolition hit we would not have a kitchen, i scheduled counter top measurements for the following monday to give me 9 days to finish cabinet installation. cabinet removal was pretty easy with just a few screws holding them to the wall and a couple screws holding them to the adjacent cabinet. remove screws and remove cabinets. some screws were stripped where i needed to use vise-grips to grab the heads and slowly remove them. the countertops came up easily with a few upward pulls. this part was pretty simple and straight forward. if you remove all the screws and the cabinet does not move, look again because you missed a screw somewhere. i worked my way from right to left around the kitchen to minimize time without a sink/dishwasher (above/below pictures).\n\n&amp;#x200b;\n\n[installation of cabinets. notice the temporary level guide board on the back wall for the upper cabinets.  ](https://preview.redd.it/4y3dnrtbkrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=3a0f2710702d104ef78a857a0eeabdc9472e24e8)\n\ninstallation of the upper cabinets was pretty quick and easy. the process entails measuring down from the ceiling to where the base of the cabinets are going to sit, attach a horizontal board at that level line, perch the cabinet on the board and screw them into the wall studs through the back of the cabinets. also place screws into the adjacent cabinet sides, as applicable. in the above picture, you can see the use of a board to place the stove cabinets in place and level. you will also notice that the old sink cabinet is still in place. that is because the plumbing needed to be disconnected to remove that cabinet, but i could not turn off the main water to the house due to a previously unknown been hive at the shut-off (they would start attacking when within 10 ft … africanized bees and mean). with a looming deadline and a budget, here is my multi-layer “bee suit” and flying insect killer used to attack that hive. i also went out at the coldest part of the night (summer in az so not that cool, but late). \n\n[middle of az summer with layers and every bit of flesh covered \\(missed the nose\\) to battle the bee hive ... i am moderately allergic.](https://preview.redd.it/tf2ryqzrkrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=6405a5f8fd6b8b0e30e8b9f36ad6dd2be5f20f95)\n\n&amp;#x200b;\n\n[this is the 4.5 lb hive that had to be removed in order for me to continue with the project. flying insect spray applied for two nights before i was able to approach successfully. ](https://preview.redd.it/zadpmobrlrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=133f5f3ced972e0287bfe58f55168db9d739b58a)\n\nonce the hive was taken care of, i could turn off the water and take a torch to the copper pipes, remove the copper plumbing apparatus, and sweat on copper caps to those copper inlet pipes. i am sure there are many sources and videos detailing sweating copper, so watch those and don’t listen to me. in general, it just takes a torch, silver solder, flux, and a slice of bread. turn off the main water, heat the soldered joint until you can pull the connection apart. water will run out of the pipe, so have a bucket ready. stuff a little bread into the inlet pipe, add flux to the outside rim, connect copper end cap, heat until the silver solder melts into the joint, turn on water, and check for leaks. at this point the old sink cabinet can slide right out (after removing the screws from back wall and sides of adjacent cabinets). important: keep the drain trap attached and full of water to keep sewage smell from emanating throughout the house. disconnect shortly as needed, but replace and fill.\n\ni have covered the ease of installing the upper cabinets, now for the lower base cabinets. installation of the base cabinets were a challenge. i had granite countertops ordered for installation, so being level was paramount (front/back/left/right and across the entire kitchen). i used a combination of a 4 ft level (across cabinets) and a couple 1 ft levels (front/back on each cabinet) and started working from right to left around the kitchen with wedges under the cabinets where needed to get them exactly level. unfortunately, as i worked my way around, i would find a new high point and would have to work backwards to fix what i had already done. then i would move forward again to find a new high point, causing me to work backwards again. after three redoes of the lower cabinets from stove to peninsula, i finally borrowed a laser level to find the high point in the room and work backwards from there which happened to be the area that i planned to set in place last.(back corner of the expanded peninsula). we are talking about minutia of fine tweaking, so no photos will help to explain. in the end, i ordered the “ez leveler” kits for each of my lower cabinets and the fine tuning was simple moving forward. these kits involve drilling holes in the face plates of the lower cabinets and screwing in the levelers to the front and back of each cabinet. once installed, you can adjust the front and back heights with a simple turn to make fine adjustments (see picture). these are then covered up by the base plates. \n\n[these are the ex level adjustments. the top knobs raise and lower the back and the lower ones raise and lower the front.  micro adjustments were super easy using these.](https://preview.redd.it/s0dqj99umrh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=d31499a4acc2218bf955b98c5a87f99c493556f0)\n\n&amp;#x200b;\n\n[once cabinets are in place, the kick board cover the holes and levelers.](https://preview.redd.it/9h9wek31orh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=027769b71ec9dd0d7af4d994d10a811ff0209d0e)\n\nother than leveling, the other major issue i was running into is where my kitchen layout had non-90 degree angles (cabinet options are available to handle 90 degree turns as a single unit). the old cabinet doors and drawers had faces smaller than the actual cabinets and the new ones were as wide as the cabinets. this created clearance issues with opening and closing drawers at the angle points. those same clearances were exacerbated by addition of handles. i used all of the spacer boards in my original design to shift everything way from those angle points to provide at least minimal clearances without cutting drawer fronts. in the end, i still had to cut one handle to make things work.\n\n&amp;#x200b;\n\n[here you can see the tight clearances that i had with the drawer faces and the one handle that was cut short on the left side.](https://preview.redd.it/mc24d6ejorh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=2d71bf651dfb3a43d503e6d968f613154b2cd015)\n\n&amp;#x200b;\n\n[even with the handle cut, i barely had the clearance i needed.](https://preview.redd.it/g606ma7torh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=4c5562e0f33564c128dd5814473a2a023ff01383)\n\nat this point, i successfully reached my 9-day window to have cabinets in place and ready for the counter tops to be measured. \n\n&amp;#x200b;\n\n[here are the cabinets installed, level, and ready for the granite measurements and installation. \\(my final product\\)](https://preview.redd.it/5zjw1o94prh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=ee49e1731e47ddc9889ebffe1daf99eae0cd2300)\n\nfrom here, the counter tops were measured promptly, but cutting and installation was stalled for 2.5 months. we lived with it on disposable plates/cutlery/cups … and washing other dishes from the front yard hose (back yard was tied to the kitchen water input so was capped and non-functional). if delays are expected, i suggest installing a temporary sink, temporary plumbing and not taking the long wait. i just believed the short delay, by short delay, by short delay excuses long enough that it no longer mattered. \n\n&amp;#x200b;\n\n[here would be your temporary sink option that could have been plumbed and used during the unexpected 2.5 month wait.](https://preview.redd.it/biopikncprh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=d24fd4e0cd53f7ac345d5c93f2284c2c33cfa8bf)\n\nthe final bit of this piece is the final product with counter tops and the stove back splash. granite counter tops come with installation, so not diy. the back tile at the stove gave me an opportunity to give my neighbor who owns a tile install company a small job, so also not diy. i take credit and criticism for everything else. i know that i need to replace that pantry door … and change the door knob. my plan is to custom make the pantry door, which will be another project.  i have tried to explain this process thoroughly, but i am happy to answer any questions that people may have.\n\n&amp;#x200b;\n\n[here is the final result of the kitchen remodel.  in total, about 7k for the cabinets and 4.5k for the granite.  came in at budget plus the cost of a few new tools.](https://preview.redd.it/c7u27aduprh61.jpg?width=4928&amp;format=pjpg&amp;auto=webp&amp;s=c1338f76aa2bcafd2368835bd89cbe0dbe83814c)", "sortedWord": "None", "removed": null, "score": 2, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/lkw20l/taking_advantage_of_low_interest_rates_to_remodel/", "identifyer": 339066, "year": "2021"}, {"Unnamed: 0": 339310, "autor": "exp_max8ion", "date": 1614111222000, "content": "Diy roof rack using 2 cross-wire mesh decks /!/ I have on hand two cross-wire mesh decks about 46’’ in length: example shown here [cross-wire mesh decks](https://www.ebay.com/itm/36-x-46-Wire-Mesh-Deck-For-Pallet-Rack-15-20-various-uprights-cross-separate/272777210873?chn=ps&amp;norover=1&amp;mkevt=1&amp;mkrid=711-117182-37290-0&amp;mkcid=2&amp;itemid=272777210873&amp;targetid=1068611331546&amp;device=m&amp;mktype=pla&amp;googleloc=9031353&amp;campaignid=11615400122&amp;mkgroupid=112424567959&amp;rlsatarget=pla-1068611331546&amp;abcId=9300455&amp;merchantid=115288668&amp;gclid=Cj0KCQiA7NKBBhDBARIsAHbXCB4DNlQi1WpIB11xVUuB482acN9Blg1s0ZspWuFZ6Zr5b34fSTTWdwAaAsavEALw_wcB&amp;pageci=444398a0-48d0-444b-b069-3a61f9bc8d8f)\n\nI also have 2 cross-bars and I was imagining how to connect the 2 decks together. Suppose I balance the decks on the two cross-bars, then I can connect u-bolts ([u bolts](https://www.google.com.sg/search?q=universal+u+bolt+cross+bars&amp;ie=UTF-8&amp;oe=UTF-8&amp;hl=en-sg&amp;client=safari)) to the middle of the 2 decks and the “bridges” will be strong enough to maintain the structure right?\n\nAlso, I thought about it and if I could find steel plates with large surface area? I can use the plate to connect the two decks so they don’t collapse? In addition, I could rope them together to strengthen the structural integrity of the rack? Also another idea might be to buy 1 or 2 steel pipes and make a H base to lay the rack on.\n\nI would only like to use and learn rope tying, drilling through metal to accomplish this task without drilling into the roof. I don’t mind buying additional oem cross-bars to support the “roof rack”. \n\nTLDR: what tools/parts would I need to connect 2 cross-wire mesh decks to become a roof rack, considering I have 2 cross bars and would like to accomplish the task by either tying or drilling but not putting holes into the roof. I would get pipes or additional cross-bars if I must.", "link": "https://www.reddit.com/r/DIY/comments/lqru4c/diy_roof_rack_using_2_crosswire_mesh_decks/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  roof rack using 2 cross-wire mesh decks /!/ i have on hand two cross-wire mesh decks about 46’’ in length: example shown here [cross-wire mesh decks](https://www.ebay.com/itm/36-x-46-wire-mesh-deck-for-pallet-rack-15-20-various-uprights-cross-separate/272777210873?chn=ps&amp;norover=1&amp;mkevt=1&amp;mkrid=711-117182-37290-0&amp;mkcid=2&amp;itemid=272777210873&amp;targetid=1068611331546&amp;device=m&amp;mktype=pla&amp;googleloc=9031353&amp;campaignid=11615400122&amp;mkgroupid=112424567959&amp;rlsatarget=pla-1068611331546&amp;abcid=9300455&amp;merchantid=115288668&amp;gclid=cj0kcqia7nkbbhdbarisahbxcb4dnlqi1wpib11xvuub482acn9blg1s0zspwufz6zr5b34fsttwdwaaasavealw_wcb&amp;pageci=444398a0-48d0-444b-b069-3a61f9bc8d8f)\n\ni also have 2 cross-bars and i was imagining how to connect the 2 decks together. suppose i balance the decks on the two cross-bars, then i can connect u-bolts ([u bolts](https://www.google.com.sg/search?q=universal+u+bolt+cross+bars&amp;ie=utf-8&amp;oe=utf-8&amp;hl=en-sg&amp;client=safari)) to the middle of the 2 decks and the “bridges” will be strong enough to maintain the structure right?\n\nalso, i thought about it and if i could find steel plates with large surface area? i can use the plate to connect the two decks so they don’t collapse? in addition, i could rope them together to strengthen the structural integrity of the rack? also another idea might be to buy 1 or 2 steel pipes and make a h base to lay the rack on.\n\ni would only like to use and learn rope tying, drilling through metal to accomplish this task without drilling into the roof. i don’t mind buying additional oem cross-bars to support the “roof rack”. \n\ntldr: what tools/parts would i need to connect 2 cross-wire mesh decks to become a roof rack, considering i have 2 cross bars and would like to accomplish the task by either tying or drilling but not putting holes into the roof. i would get pipes or additional cross-bars if i must.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/lqru4c/diy_roof_rack_using_2_crosswire_mesh_decks/", "identifyer": 339310, "year": "2021"}, {"Unnamed: 0": 339369, "autor": "TeranAtelier", "date": 1614092274000, "content": "How to DIY a glue pot suitable for contact cement. Custom tools are always better as you are free to customize for your specific needs.", "link": "https://www.reddit.com/r/DIY/comments/lqka5k/how_to_diy_a_glue_pot_suitable_for_contact_cement/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to -----> diy !!!  a glue pot suitable for contact cement. custom tools are always better as you are free to customize for your specific needs.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://youtu.be/SezuyTVkso8", "identifyer": 339369, "year": "2021"}, {"Unnamed: 0": 339401, "autor": "gari109", "date": 1614074897000, "content": "What happens when you need a replacement part for your friend's 120+ year old tool? Obviously a DIY project that nearly kills you and spans a year!", "link": "https://www.reddit.com/r/DIY/comments/lqez2c/what_happens_when_you_need_a_replacement_part_for/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what happens when you need a replacement part for your friend's 120+ year old tool? obviously a -----> diy !!!  project that nearly kills you and spans a year!", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "http://imgur.com/gallery/2S7gh7W", "identifyer": 339401, "year": "2021"}, {"Unnamed: 0": 340507, "autor": "jfdlaks", "date": 1617842181000, "content": "Turning an old lawn mower engine into a... bench grinder? /!/ I’ve seen myriad tutorials on turning those things into gas-powered generators. Which is cool as hell. But, for someone with very minimal mechanic experience, is it even feasible to consider turning an old lawn mower engine into a bench grinder/ grinding machine?  I’ve never heard of anyone attempting this. I don’t think I’ve ever even heard of a gasoline-powered grinding machine. Are there too many more factors to consider for this sort of project? Would it be too complicated or difficult for an amateur to attempt?  Am I in over my head? Should I just stick to the plebeian DIY generator option?", "link": "https://www.reddit.com/r/DIY/comments/mmg1gp/turning_an_old_lawn_mower_engine_into_a_bench/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "turning an old lawn mower engine into a... bench grinder? /!/ i’ve seen myriad tutorials on turning those things into gas-powered generators. which is cool as hell. but, for someone with very minimal mechanic experience, is it even feasible to consider turning an old lawn mower engine into a bench grinder/ grinding machine?  i’ve never heard of anyone attempting this. i don’t think i’ve ever even heard of a gasoline-powered grinding machine. are there too many more factors to consider for this sort of project? would it be too complicated or difficult for an amateur to attempt?  am i in over my head? should i just stick to the plebeian -----> diy !!!  generator option?", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/mmg1gp/turning_an_old_lawn_mower_engine_into_a_bench/", "identifyer": 340507, "year": "2021"}, {"Unnamed: 0": 340528, "autor": "Breausef", "date": 1617833723000, "content": "Solenoid Valve Co2 Rocket Project (electric/gas) /!/ Hi r/DIY first post here!\n\nIve got a fun little gas powered prop rocket project im trying to make. \nMy propellant is a co2 cartridge, and my circuit is powered by two 9v batteries wired in series for 18v\n\nmy solenoid valve is supposed to open up and release all the gas from the punctured co2 cartridge at one time, this propelling the little rocket.\nThe issue is that the solenoid valve i bought on amazon, though it works, has a very small hole and the gas can only leak out very slowly and steadily, its supposed to be more of a big gas force all at once.\n\nI need to know where I can get a solenoid valve with a bigger internal pass-through opening (if that makes sense) so more gas can escape all at one time. \nAnd what that internal opening measurement called? so I can look for one. \nIt obviously would be preferable that the SV can still run off my 18v DC batteries but if my only option is to change power sources to something bigger, I will have to do that.\n\nThanks for any and all help! Cheers!", "link": "https://www.reddit.com/r/DIY/comments/mmdehj/solenoid_valve_co2_rocket_project_electricgas/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "solenoid valve co2 rocket project (electric/gas) /!/ hi r/-----> diy !!!  first post here!\n\nive got a fun little gas powered prop rocket project im trying to make. \nmy propellant is a co2 cartridge, and my circuit is powered by two 9v batteries wired in series for 18v\n\nmy solenoid valve is supposed to open up and release all the gas from the punctured co2 cartridge at one time, this propelling the little rocket.\nthe issue is that the solenoid valve i bought on amazon, though it works, has a very small hole and the gas can only leak out very slowly and steadily, its supposed to be more of a big gas force all at once.\n\ni need to know where i can get a solenoid valve with a bigger internal pass-through opening (if that makes sense) so more gas can escape all at one time. \nand what that internal opening measurement called? so i can look for one. \nit obviously would be preferable that the sv can still run off my 18v dc batteries but if my only option is to change power sources to something bigger, i will have to do that.\n\nthanks for any and all help! cheers!", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/mmdehj/solenoid_valve_co2_rocket_project_electricgas/", "identifyer": 340528, "year": "2021"}, {"Unnamed: 0": 340547, "autor": "pjhall001", "date": 1618002322000, "content": "Finished my first major house renovation project! Full bathroom remodel /!/  Just wrapped up a full remodel of our main bathroom. Its a small room but a glass shower helped open it up a lot.\n\nSee the transformation [here](https://imgur.com/gallery/OLusHbl)\n\nCompletely gutted the room, and had to chip out that god damn cast iron tub piece by piece.\n\nI learned a ton while doing this project. Started on youtube to learn each part of the remodel, then learned more as i did the project.\n\nBought a lot of new tools for this project since its our first big one.\n\nOscillating tool was really helpful (I got milwaukee m12), Tile score and snap was cheap and useful on the subway tile in the shower, Father in law brought wet saw for the floor tile.\n\nOne big takeaway was that installing the glass door you need to measure more than twice. The way the instructions tell you to hang it, you are making measurements off of existing measurements, which if you mess up in the slightest on step one, step 5 is going to be VERY off.\n\nYouTube home renovation helped a lot, the main channel was \"Home RenoVision DIY\"\n\nFeedback is always appreciated! I screwed up on some parts, but was able to cover up my mistakes pretty well and now know better for next time!", "link": "https://www.reddit.com/r/DIY/comments/mnqo9q/finished_my_first_major_house_renovation_project/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "finished my first major house renovation project! full bathroom remodel /!/  just wrapped up a full remodel of our main bathroom. its a small room but a glass shower helped open it up a lot.\n\nsee the transformation [here](https://imgur.com/gallery/olushbl)\n\ncompletely gutted the room, and had to chip out that god damn cast iron tub piece by piece.\n\ni learned a ton while doing this project. started on youtube to learn each part of the remodel, then learned more as i did the project.\n\nbought a lot of new tools for this project since its our first big one.\n\noscillating tool was really helpful (i got milwaukee m12), tile score and snap was cheap and useful on the subway tile in the shower, father in law brought wet saw for the floor tile.\n\none big takeaway was that installing the glass door you need to measure more than twice. the way the instructions tell you to hang it, you are making measurements off of existing measurements, which if you mess up in the slightest on step one, step 5 is going to be very off.\n\nyoutube home renovation helped a lot, the main channel was \"home renovision -----> diy !!! \"\n\nfeedback is always appreciated! i screwed up on some parts, but was able to cover up my mistakes pretty well and now know better for next time!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/mnqo9q/finished_my_first_major_house_renovation_project/", "identifyer": 340547, "year": "2021"}, {"Unnamed: 0": 340582, "autor": "gossf", "date": 1617986203000, "content": "Primer choice for painting wheels? /!/ I'm going to attempt to DIY paint my forged AL wheels black for my c7 vette. They currently have the factory silver paint on them in good shape aside from some sand/rock chips in spots, and a small amount of curb rash (which I may end up filling with some sort of filler before painting). I don't have a paint sprayer or good enough compressor for one and it isn't in the budget at the moment, so I'm just going to try rattle canning it doing the best job I can and hope I'm happy enough with it. I feel pretty good about the prep work and such from my research, but I'm still not totally confident about my choice of products. \n\nFor base coat, I think I'm gonna go with the duplicolor wheel coating spray can, which is an acrylic enamel. For clear, I've heard really good things about spraymax 2k clear glamour in terms of gloss and durability, so I think I'll go with that (I have a full face 3m respirator with organic vapor filters). I'm left struggling to decide on a primer. I see spraymax makes an epoxy 2k primer, would there be any benefit in going with that? Or maybe the Eastwood 2k urethane primer? Also thinking of just going with the duplicolor filler primer since it's cheaper/safer (and I'm not sure what the benefit of the spraymax primer would be), maybe with the duplicolor sealant on top before base coat. Note that I'm not going to take it down to bare metal before painting, just gonna prep the existing painted surface. \n\nAny thoughts/suggestions?", "link": "https://www.reddit.com/r/DIY/comments/mnl6hr/primer_choice_for_painting_wheels/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "primer choice for painting wheels? /!/ i'm going to attempt to -----> diy !!!  paint my forged al wheels black for my c7 vette. they currently have the factory silver paint on them in good shape aside from some sand/rock chips in spots, and a small amount of curb rash (which i may end up filling with some sort of filler before painting). i don't have a paint sprayer or good enough compressor for one and it isn't in the budget at the moment, so i'm just going to try rattle canning it doing the best job i can and hope i'm happy enough with it. i feel pretty good about the prep work and such from my research, but i'm still not totally confident about my choice of products. \n\nfor base coat, i think i'm gonna go with the duplicolor wheel coating spray can, which is an acrylic enamel. for clear, i've heard really good things about spraymax 2k clear glamour in terms of gloss and durability, so i think i'll go with that (i have a full face 3m respirator with organic vapor filters). i'm left struggling to decide on a primer. i see spraymax makes an epoxy 2k primer, would there be any benefit in going with that? or maybe the eastwood 2k urethane primer? also thinking of just going with the duplicolor filler primer since it's cheaper/safer (and i'm not sure what the benefit of the spraymax primer would be), maybe with the duplicolor sealant on top before base coat. note that i'm not going to take it down to bare metal before painting, just gonna prep the existing painted surface. \n\nany thoughts/suggestions?", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/mnl6hr/primer_choice_for_painting_wheels/", "identifyer": 340582, "year": "2021"}, {"Unnamed: 0": 340738, "autor": "OSHOs-workshop", "date": 1611919746000, "content": "[DIY wooden stool] How to make a fashionable antique stool. /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/l7qbkn/diy_wooden_stool_how_to_make_a_fashionable/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[-----> diy !!!  wooden stool] how to make a fashionable antique stool. /!/ [removed]", "sortedWord": "None", "removed": "reddit", "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l7qbkn/diy_wooden_stool_how_to_make_a_fashionable/", "identifyer": 340738, "year": "2021"}, {"Unnamed: 0": 340882, "autor": "dantept", "date": 1618479731000, "content": "BrokenOrFree - New site to get stuff for your projects, or sell unused materials/componente /!/  \n\nHi everyone\n\nI'm a DIY lover and experimenter on my spare time, and sometimes I find myself having ideas but lacking materials to upcycle/use as spares.\n\nAs I couldn't find a good place to get used/broken stuff that ends up in the garbage, I tried to create a website that can help us get the stuff we need for our projects.\n\nThe idea is to give the community another tool for material sourcing with the advantage of helping stuff get repaired/upcycled.\n\nThe site, [www.brokenorfree.com](http://www.brokenorfree.com/), It's not even finished yet, but it's useable, I think, so feel free to use it and spread the word.  \n\nIt is and it will always be a free (I hope the google ads are enough to pay de expenses for now, and maybe I'll add paid ads later on, but it is a “free to use” site). It’s also updated/maintained on my spare time, so it will grow slowly.\n\nAny ideas,corrections and suggestions are welcome!\n\nRegards,\n\nDaniel - BrokenOrFree", "link": "https://www.reddit.com/r/DIY/comments/mrbemq/brokenorfree_new_site_to_get_stuff_for_your/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "brokenorfree - new site to get stuff for your projects, or sell unused materials/componente /!/  \n\nhi everyone\n\ni'm a -----> diy !!!  lover and experimenter on my spare time, and sometimes i find myself having ideas but lacking materials to upcycle/use as spares.\n\nas i couldn't find a good place to get used/broken stuff that ends up in the garbage, i tried to create a website that can help us get the stuff we need for our projects.\n\nthe idea is to give the community another tool for material sourcing with the advantage of helping stuff get repaired/upcycled.\n\nthe site, [www.brokenorfree.com](http://www.brokenorfree.com/), it's not even finished yet, but it's useable, i think, so feel free to use it and spread the word.  \n\nit is and it will always be a free (i hope the google ads are enough to pay de expenses for now, and maybe i'll add paid ads later on, but it is a “free to use” site). it’s also updated/maintained on my spare time, so it will grow slowly.\n\nany ideas,corrections and suggestions are welcome!\n\nregards,\n\ndaniel - brokenorfree", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/mrbemq/brokenorfree_new_site_to_get_stuff_for_your/", "identifyer": 340882, "year": "2021"}, {"Unnamed: 0": 341133, "autor": "AccordingLink8651", "date": 1611280863000, "content": "DIY Furnace Gas Valve Replacement /!/ My furnace intermittently doesn't supply heat due to a bad gas valve inside the furnace. HVAC company wants $750, the part is $80 - it's exactly the same OEM part so just have to put it back together the same way - looks fairly easy to shutoff everything, unscrew the 2 pipes with my pipe wrench, unplug a few wires and reinstall back the same way, applying adequate pipe dope. and there's a few youtube videos showing how to adjust the pressure with a manometer. I've repaired my oven before, installed dryer, know how to test for gas leaks, and have soldered copper pipes before, so not completely unhandy. But, sometimes wonder if saving a few bucks is worth liability if anything goes wrong. HVAC pros forum seem to warn of fires/blowing up and insurance not covering. I don't see any reason why that would happen, but wondering if anyone's done similar and whether I'm underestimating the difficulty of this. Thanks!", "link": "https://www.reddit.com/r/DIY/comments/l2dgb9/diy_furnace_gas_valve_replacement/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  furnace gas valve replacement /!/ my furnace intermittently doesn't supply heat due to a bad gas valve inside the furnace. hvac company wants $750, the part is $80 - it's exactly the same oem part so just have to put it back together the same way - looks fairly easy to shutoff everything, unscrew the 2 pipes with my pipe wrench, unplug a few wires and reinstall back the same way, applying adequate pipe dope. and there's a few youtube videos showing how to adjust the pressure with a manometer. i've repaired my oven before, installed dryer, know how to test for gas leaks, and have soldered copper pipes before, so not completely unhandy. but, sometimes wonder if saving a few bucks is worth liability if anything goes wrong. hvac pros forum seem to warn of fires/blowing up and insurance not covering. i don't see any reason why that would happen, but wondering if anyone's done similar and whether i'm underestimating the difficulty of this. thanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l2dgb9/diy_furnace_gas_valve_replacement/", "identifyer": 341133, "year": "2021"}, {"Unnamed: 0": 341184, "autor": "__fuzz__", "date": 1632325482000, "content": "Smart Plugs in DIY Projects /!/ Had an ah-ha moment recently, thought it'd be worth sharing - use smart plugs on tools that are out of reach. Simple, but made my life a little bit easier. \n\nI've been restoring exterior window trim on my two story house. I got a long hose for my shopvac and have been using that to keep things neat. I didn't want to just leave the vac running the whole time I was up the ladder, so I was making a lot of trips up and down. Finally realized I had a few smart plugs in the house, plugged the vac into one of those, and was able to turn it on/off from my phone while up the ladder.", "link": "https://www.reddit.com/r/DIY/comments/pta9ps/smart_plugs_in_diy_projects/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "smart plugs in -----> diy !!!  projects /!/ had an ah-ha moment recently, thought it'd be worth sharing - use smart plugs on tools that are out of reach. simple, but made my life a little bit easier. \n\ni've been restoring exterior window trim on my two story house. i got a long hose for my shopvac and have been using that to keep things neat. i didn't want to just leave the vac running the whole time i was up the ladder, so i was making a lot of trips up and down. finally realized i had a few smart plugs in the house, plugged the vac into one of those, and was able to turn it on/off from my phone while up the ladder.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/pta9ps/smart_plugs_in_diy_projects/", "identifyer": 341184, "year": "2021"}, {"Unnamed: 0": 341383, "autor": "Farmerworld", "date": 1620822072000, "content": "click and see: DIY tractor front weight; Frontgewicht selber bauen mit...", "link": "https://www.reddit.com/r/DIY/comments/nanc73/click_and_see_diy_tractor_front_weight/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "click and see: -----> diy !!!  tractor front weight; frontgewicht selber bauen mit...", "sortedWord": "None", "removed": "automod_filtered", "score": 1, "comments": 1, "media": "rich:video", "medialink": "https://youtube.com/watch?v=hTGmKYr7pso&amp;feature=share", "identifyer": 341383, "year": "2021"}, {"Unnamed: 0": 341843, "autor": "ImonReza", "date": 1621800282000, "content": "Innovative 5 things to Do with Filing Cabinets /!/ Metal file cabinets are becoming a casualty of our new, almost-paperless [lifestyle](https://nondon.net/lifestyle). Don’t consign yours to the landfill before checking out these clever DIY conversions.\n\nWhereas our desks were once crammed with 8.5″ x 11″-inch documents, sheets of loose-leaf paper, and manila folders, nowadays we need a computer and little else. Indeed, the term “desktop” no longer means what it used to, and [technology](https://nondon.net/technology) has redefined home office furniture.\n\n If thrift stores and flea markets provide any indication, metal filing cabinets have fallen completely out of favor with homeowners. \n\n If yours are standing empty, consider these creative DIY file cabinet projects, each designed to give renewed life to those old hallmarks of the paper age. \n\nhttps://preview.redd.it/nt19jfl4fx071.jpg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=9b8382ead1b8bb8339cdb780eb3ab7576177ad17\n\n \n\n### 1. CREATE A KITCHEN CART\n\nYou wouldn’t expect to see office furniture in the kitchen, but in this DIY project from [Curbly](http://www.curbly.com/users/chrisjob/posts/11145-make-a-rolling-kitchen-cart-from-an-old-filing-cabinet), the filing cabinet looks right at home. Prep meals on the butcher-block top, hang utensils from the side racks, and store rarely used or awkwardly shaped appliances in the unit’s deep drawers.\n\n \n\n### 2. STORE YOUR GARDEN TOOLS\n\nAlthough intended here for garage storage, the design of this [Trash to Treasure](http://blog.tttreasure.com/2012/turning-your-old-file-cabinet-into-a-garage-storage-favorite/) DIY project is appropriate for many uses.\n\n[**Read more here**](https://nondon.net/how-to/diy-crafts/5-things-to-do-with-filing-cabinets)", "link": "https://www.reddit.com/r/DIY/comments/njfw1z/innovative_5_things_to_do_with_filing_cabinets/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "innovative 5 things to do with filing cabinets /!/ metal file cabinets are becoming a casualty of our new, almost-paperless [lifestyle](https://nondon.net/lifestyle). don’t consign yours to the landfill before checking out these clever -----> diy !!!  conversions.\n\nwhereas our desks were once crammed with 8.5″ x 11″-inch documents, sheets of loose-leaf paper, and manila folders, nowadays we need a computer and little else. indeed, the term “desktop” no longer means what it used to, and [technology](https://nondon.net/technology) has redefined home office furniture.\n\n if thrift stores and flea markets provide any indication, metal filing cabinets have fallen completely out of favor with homeowners. \n\n if yours are standing empty, consider these creative diy file cabinet projects, each designed to give renewed life to those old hallmarks of the paper age. \n\nhttps://preview.redd.it/nt19jfl4fx071.jpg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=9b8382ead1b8bb8339cdb780eb3ab7576177ad17\n\n \n\n### 1. create a kitchen cart\n\nyou wouldn’t expect to see office furniture in the kitchen, but in this diy project from [curbly](http://www.curbly.com/users/chrisjob/posts/11145-make-a-rolling-kitchen-cart-from-an-old-filing-cabinet), the filing cabinet looks right at home. prep meals on the butcher-block top, hang utensils from the side racks, and store rarely used or awkwardly shaped appliances in the unit’s deep drawers.\n\n \n\n### 2. store your garden tools\n\nalthough intended here for garage storage, the design of this [trash to treasure](http://blog.tttreasure.com/2012/turning-your-old-file-cabinet-into-a-garage-storage-favorite/) diy project is appropriate for many uses.\n\n[**read more here**](https://nondon.net/how-to/diy-crafts/5-things-to-do-with-filing-cabinets)", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/njfw1z/innovative_5_things_to_do_with_filing_cabinets/", "identifyer": 341843, "year": "2021"}, {"Unnamed: 0": 342075, "autor": "shreddedseamer", "date": 1626328618000, "content": "How to Move Heavy Furniture by Yourself (DIY Tips) /!/ When moving heavy furniture by yourself, you often face trouble  figuring out how to handle the tedious task alone. Moreover, lifting  large furniture items and heavy boxes is strenuous to your back and  joints. You may even risk damage to your furniture when attempting to  move it yourself.\n\nBut DIYing is the best way to save extra money on moving your stuff  during a house renovation or when moving into a new house/apartment. So,  when you are moving heavy items within or out of your  home/office/apartment/garage, you don’t want it to be labor-intensive  than it needs to be.\n\n**Always measure first**\n\nBefore beginning the lifting process, measure the hallways and doorways you have to pass through while moving the furniture. Trying to push an item through a hallway or doorway that’s too small may result in damage to the item. It may even lead you to drop that item, causing potential injury to yourself or a moving partner.\n\n**Clear the pathway**\n\nMake sure that the pathway is clear before moving the items. This will allow you to see the path clearly and also prevent any tripping hazards.\n\nAlso, lay down a liner on the floor to prevent it from scuffing or damaging. You may use a roll-out plastic liner or moving blankets. And, always wear closed-toed non-slip shoes to avoid accidents.\n\n**Remove loose items or items inside furniture**\n\nAlways remove all loose items that may fall during lifting, like pillows, wall frames, etc. Keep these things in a safe place to easily set them again when the furniture is moved.\n\n&amp;#x200B;\n\nDon’t forget to empty dresser drawers and remove books from the shelves to reduce the weight. Removing items from furniture makes it lighter to some extent.\n\n**Disassemble large items**\n\nIf you have a furniture piece that can be disassembled into smaller pieces, disassemble it first and then begin moving it. Put the screws, bolts, and nuts safely in a plastic bag so that you can easily re-assemble the furniture.\n\n**Turn and move chairs in an ‘L’ shape**\n\nAn average looking chair (despite its name) might not be so easy to move after all. You should do what pro movers do, hook larger chairs around corners to make moving them easier. Just turn the chair on its side to make an L-shape and move its back-first through the doorway. Curl (hook) the chair around the doorway to allow it to slip through.\n\n**Carry tall furniture using a high-low technique**\n\nA tall shelving unit or cabinet can be awkward to move. To prevent injuring your back, consider getting the help of your partner. Tip them backward at an angle and carry the top while the other person carries the bottom.\n\nDoing so will center the weight of the piece, and keep it from swinging out of control and injuring you. This will also make it easier to carry the item down the stairs because the angle of carrying it will match the slope of the stairs.\n\n**Use shoulder dollies**\n\nThe lifting and moving straps make it easier to lift and move heavy furniture units without hurting your back. They force your body to rely on its large muscle groups. Moreover, they leave your hands free, allowing you to maneuver bigger items. However, they can be tricky while using the stairs because they shift the weight downwards for the mover.\n\n**Slide instead of dragging**\n\nYou can buy furniture sliders in different shapes and sizes. You can also make your own sliders using old rugs, bedspreads, plastic container covers, towels, etc. You can use them to avoid scratching the floors when dragging heavy furniture.\n\n**Stand couches on the end**\n\nWhile moving a couch through a door or hallway, it is impossible to carry it horizontally. The easiest way to move it is to place the couch on its end while in the hallway then slide it through the doorway. If the furniture is taller than the opening, ensure that the top end is away to allow a few inches of clearance.\n\n**Wrap furniture in blanket and plastic**\n\nIf you want to protect your house as well as your furniture, use blankets. You can either buy cheap ones online or rent them for a few dollars from your local store. To avoid ruining the fragile edges and finish, try to wrap them completely in moving blankets and use stretch film to secure the blanket.\n\n**Create a mattress sling**\n\nCarrying a heavy and floppy mattress is tough. Although most of them come with a handle, they are not meant for carrying. They are used for positioning the mattress, which means they are not very strong. To make the mattress easier to carry, you can use a simple rope string that gives you more freedom and control. Thread it through the handles and attach the rope to a PVC pipe for a more comfortable grip. Flip the mattress to ensure the sling is at the bottom, and start moving it.\n\n**Ask a friend to help**\n\nIf you feel you cannot move furniture alone, don’t hesitate to ask for help from your friend. If no one you know is available, you can consider hiring professional movers.\n\n**Invest in Right Equipment**\n\nInvesting in the right equipment makes your task two times simpler. Here are some essential tools you need while moving large or heavy furniture.", "link": "https://www.reddit.com/r/DIY/comments/okmmfr/how_to_move_heavy_furniture_by_yourself_diy_tips/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to move heavy furniture by yourself (-----> diy !!!  tips) /!/ when moving heavy furniture by yourself, you often face trouble  figuring out how to handle the tedious task alone. moreover, lifting  large furniture items and heavy boxes is strenuous to your back and  joints. you may even risk damage to your furniture when attempting to  move it yourself.\n\nbut diying is the best way to save extra money on moving your stuff  during a house renovation or when moving into a new house/apartment. so,  when you are moving heavy items within or out of your  home/office/apartment/garage, you don’t want it to be labor-intensive  than it needs to be.\n\n**always measure first**\n\nbefore beginning the lifting process, measure the hallways and doorways you have to pass through while moving the furniture. trying to push an item through a hallway or doorway that’s too small may result in damage to the item. it may even lead you to drop that item, causing potential injury to yourself or a moving partner.\n\n**clear the pathway**\n\nmake sure that the pathway is clear before moving the items. this will allow you to see the path clearly and also prevent any tripping hazards.\n\nalso, lay down a liner on the floor to prevent it from scuffing or damaging. you may use a roll-out plastic liner or moving blankets. and, always wear closed-toed non-slip shoes to avoid accidents.\n\n**remove loose items or items inside furniture**\n\nalways remove all loose items that may fall during lifting, like pillows, wall frames, etc. keep these things in a safe place to easily set them again when the furniture is moved.\n\n&amp;#x200b;\n\ndon’t forget to empty dresser drawers and remove books from the shelves to reduce the weight. removing items from furniture makes it lighter to some extent.\n\n**disassemble large items**\n\nif you have a furniture piece that can be disassembled into smaller pieces, disassemble it first and then begin moving it. put the screws, bolts, and nuts safely in a plastic bag so that you can easily re-assemble the furniture.\n\n**turn and move chairs in an ‘l’ shape**\n\nan average looking chair (despite its name) might not be so easy to move after all. you should do what pro movers do, hook larger chairs around corners to make moving them easier. just turn the chair on its side to make an l-shape and move its back-first through the doorway. curl (hook) the chair around the doorway to allow it to slip through.\n\n**carry tall furniture using a high-low technique**\n\na tall shelving unit or cabinet can be awkward to move. to prevent injuring your back, consider getting the help of your partner. tip them backward at an angle and carry the top while the other person carries the bottom.\n\ndoing so will center the weight of the piece, and keep it from swinging out of control and injuring you. this will also make it easier to carry the item down the stairs because the angle of carrying it will match the slope of the stairs.\n\n**use shoulder dollies**\n\nthe lifting and moving straps make it easier to lift and move heavy furniture units without hurting your back. they force your body to rely on its large muscle groups. moreover, they leave your hands free, allowing you to maneuver bigger items. however, they can be tricky while using the stairs because they shift the weight downwards for the mover.\n\n**slide instead of dragging**\n\nyou can buy furniture sliders in different shapes and sizes. you can also make your own sliders using old rugs, bedspreads, plastic container covers, towels, etc. you can use them to avoid scratching the floors when dragging heavy furniture.\n\n**stand couches on the end**\n\nwhile moving a couch through a door or hallway, it is impossible to carry it horizontally. the easiest way to move it is to place the couch on its end while in the hallway then slide it through the doorway. if the furniture is taller than the opening, ensure that the top end is away to allow a few inches of clearance.\n\n**wrap furniture in blanket and plastic**\n\nif you want to protect your house as well as your furniture, use blankets. you can either buy cheap ones online or rent them for a few dollars from your local store. to avoid ruining the fragile edges and finish, try to wrap them completely in moving blankets and use stretch film to secure the blanket.\n\n**create a mattress sling**\n\ncarrying a heavy and floppy mattress is tough. although most of them come with a handle, they are not meant for carrying. they are used for positioning the mattress, which means they are not very strong. to make the mattress easier to carry, you can use a simple rope string that gives you more freedom and control. thread it through the handles and attach the rope to a pvc pipe for a more comfortable grip. flip the mattress to ensure the sling is at the bottom, and start moving it.\n\n**ask a friend to help**\n\nif you feel you cannot move furniture alone, don’t hesitate to ask for help from your friend. if no one you know is available, you can consider hiring professional movers.\n\n**invest in right equipment**\n\ninvesting in the right equipment makes your task two times simpler. here are some essential tools you need while moving large or heavy furniture.", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/okmmfr/how_to_move_heavy_furniture_by_yourself_diy_tips/", "identifyer": 342075, "year": "2021"}, {"Unnamed: 0": 342816, "autor": "RavenThePerson", "date": 1619462270000, "content": "Made a very strange fix, first post here, sorry if it doesn’t fit /!/ Part of the chairs back support gave out as it is a very old chair, with no proper tools to fix it with I managed to improvise with a single quarter so that it doesn’t destroy my back! Again sorry if this doesn’t fit but it was my first “diy” project as I am 15.\n\nhttps://www.dropbox.com/s/yw7g47tjwkotemx/Photo%202021-04-26%2C%202%2032%2035%20PM.jpg?dl=0", "link": "https://www.reddit.com/r/DIY/comments/mz4lw4/made_a_very_strange_fix_first_post_here_sorry_if/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "made a very strange fix, first post here, sorry if it doesn’t fit /!/ part of the chairs back support gave out as it is a very old chair, with no proper tools to fix it with i managed to improvise with a single quarter so that it doesn’t destroy my back! again sorry if this doesn’t fit but it was my first “-----> diy !!! ” project as i am 15.\n\nhttps://www.dropbox.com/s/yw7g47tjwkotemx/photo%202021-04-26%2c%202%2032%2035%20pm.jpg?dl=0", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/mz4lw4/made_a_very_strange_fix_first_post_here_sorry_if/", "identifyer": 342816, "year": "2021"}, {"Unnamed: 0": 342997, "autor": "usetheforceharry9", "date": 1627325494000, "content": "The Only Reason I Hate DIY - I Never Have the Right Tools. Please Help! /!/ Hello Friends,\n\nI love the independence and sense of accomplishment whenever I DIY anything. However, the reason I have always hated doing DIY is because either:\n\n1. I don't have the right tools for various jobs, so I end up spending an extra 2-3 hours on jobs that someone else might have done in 10 minutes with the right tool.\n\n2. I have a low-quality tool (like an old drill instead of an impact driver) that makes me put incredibly amounts of effort and muscle into getting a screw to go into a metal door or similar task, when the right quality tool would have just done the job.\n\nI've decided to get rid of my myriad of random tools and invest in a proper set of complete tools that will allow me to do most tasks at home.\n\nWhat are the best complete sets of tools and and key power tools I should get?\n\nApologies if this has already been answered, I'm happy to be directed to an existing list or post. Searching this online is overwhelming and it's hard to tell what is the right answer from the many many answers I have read through.\n\nThank you all!", "link": "https://www.reddit.com/r/DIY/comments/os5bst/the_only_reason_i_hate_diy_i_never_have_the_right/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the only reason i hate -----> diy !!!  - i never have the right tools. please help! /!/ hello friends,\n\ni love the independence and sense of accomplishment whenever i diy anything. however, the reason i have always hated doing diy is because either:\n\n1. i don't have the right tools for various jobs, so i end up spending an extra 2-3 hours on jobs that someone else might have done in 10 minutes with the right tool.\n\n2. i have a low-quality tool (like an old drill instead of an impact driver) that makes me put incredibly amounts of effort and muscle into getting a screw to go into a metal door or similar task, when the right quality tool would have just done the job.\n\ni've decided to get rid of my myriad of random tools and invest in a proper set of complete tools that will allow me to do most tasks at home.\n\nwhat are the best complete sets of tools and and key power tools i should get?\n\napologies if this has already been answered, i'm happy to be directed to an existing list or post. searching this online is overwhelming and it's hard to tell what is the right answer from the many many answers i have read through.\n\nthank you all!", "sortedWord": "None", "removed": null, "score": 1, "comments": 34, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/os5bst/the_only_reason_i_hate_diy_i_never_have_the_right/", "identifyer": 342997, "year": "2021"}, {"Unnamed: 0": 343907, "autor": "spookw4staken", "date": 1626980182000, "content": "Leaking Supply Line /!/ Hey everyone, I installed a new faucet in my kitchen and everything went smoothly until I turned the water on and the supply line to my sink began leaking from the back of the nut, not the front. (sorry if my terminology is wrong, I'm a beginner with DIY). I'm wondering if there is any way to fix this without replacing the supply line. Normally i would just go and grab a replacement, but the sink i bought has the supply line pre-installed into the faucet so I don't think i can reach it (link to the sink below). Any help is appreciated, the kitchen in this new home has been a long term project and I'm at my witts end.\n\nGlacier Bay\tBrenner Commercial Style Single-Handle Pull-Down Sprayer Kitchen Faucet in Oil Rubbed Bronze Finish\n/p/Glacier-Bay-Brenner-Commercial-Style-Single-Handle-Pull-Down-Sprayer-Kitchen-Faucet-in-Oil-Rubbed-Bronze-Finish-FP4F0005ORB/305537759\n\n\n\n[Leaking Supply Line](https://imgur.com/gallery/C7KEebv)", "link": "https://www.reddit.com/r/DIY/comments/opkhgf/leaking_supply_line/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "leaking supply line /!/ hey everyone, i installed a new faucet in my kitchen and everything went smoothly until i turned the water on and the supply line to my sink began leaking from the back of the nut, not the front. (sorry if my terminology is wrong, i'm a beginner with -----> diy !!! ). i'm wondering if there is any way to fix this without replacing the supply line. normally i would just go and grab a replacement, but the sink i bought has the supply line pre-installed into the faucet so i don't think i can reach it (link to the sink below). any help is appreciated, the kitchen in this new home has been a long term project and i'm at my witts end.\n\nglacier bay\tbrenner commercial style single-handle pull-down sprayer kitchen faucet in oil rubbed bronze finish\n/p/glacier-bay-brenner-commercial-style-single-handle-pull-down-sprayer-kitchen-faucet-in-oil-rubbed-bronze-finish-fp4f0005orb/305537759\n\n\n\n[leaking supply line](https://imgur.com/gallery/c7keebv)", "sortedWord": "None", "removed": null, "score": 1, "comments": 18, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/opkhgf/leaking_supply_line/", "identifyer": 343907, "year": "2021"}, {"Unnamed: 0": 344108, "autor": "kalyantalluri", "date": 1624364962000, "content": "Where to buy used hardware in Toronto/York Region? /!/ I used to buy used hardware/tools in [https://www.tripadvisor.ca/Attraction\\_Review-g796993-d4137791-Reviews-Stouffville\\_Country\\_Market-Whitchurch\\_Stouffville\\_Ontario.html](https://www.tripadvisor.ca/Attraction_Review-g796993-d4137791-Reviews-Stouffville_Country_Market-Whitchurch_Stouffville_Ontario.html), unfortunately it's closed. It's very cheap, $1 or $2, something like that for a piece.\n\nDo you know a similar place I can find all hardware I needed for  home DIY?\n\nThanks!", "link": "https://www.reddit.com/r/DIY/comments/o5lzgd/where_to_buy_used_hardware_in_torontoyork_region/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "where to buy used hardware in toronto/york region? /!/ i used to buy used hardware/tools in [https://www.tripadvisor.ca/attraction\\_review-g796993-d4137791-reviews-stouffville\\_country\\_market-whitchurch\\_stouffville\\_ontario.html](https://www.tripadvisor.ca/attraction_review-g796993-d4137791-reviews-stouffville_country_market-whitchurch_stouffville_ontario.html), unfortunately it's closed. it's very cheap, $1 or $2, something like that for a piece.\n\ndo you know a similar place i can find all hardware i needed for  home -----> diy !!! ?\n\nthanks!", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/o5lzgd/where_to_buy_used_hardware_in_torontoyork_region/", "identifyer": 344108, "year": "2021"}, {"Unnamed: 0": 344353, "autor": "pseudofidelis", "date": 1633355059000, "content": "very small front deck /!/ I’ve seen enough deck builds on this sub to know the “rules” but I am wondering what folks would say about my situation.\n\nI want to build what is probably the simplest deck possible. I have no experience and limited tools, but I have convenient access to both local hardware and lumber stores as well as big box locations.\n\nThe deck is only going to be 6X8 feet and one step up in my front yard. I just want to put my Adirondack chairs on it and maybe a couple of flower pots. I’m hoping it can be a good experience to give me the confidence to tackle a bigger project next time.\n\nSo… is the build described [here](https://www.homedepot.com/c/ap/how-to-build-a-simple-diy-deck-on-a-budget/9ba683603be9fa5395fab9016700dbf9) good enough and safe enough for me to try? Specifically, are those concrete supports sufficient? Most other plans I’ve seen call for more.\n\nAgain, I know this is not the kind of deck build to win any awards but as long as this is safe and *good enough* I would like to give it a try.\n\nThanks everyone!", "link": "https://www.reddit.com/r/DIY/comments/q15px5/very_small_front_deck/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "very small front deck /!/ i’ve seen enough deck builds on this sub to know the “rules” but i am wondering what folks would say about my situation.\n\ni want to build what is probably the simplest deck possible. i have no experience and limited tools, but i have convenient access to both local hardware and lumber stores as well as big box locations.\n\nthe deck is only going to be 6x8 feet and one step up in my front yard. i just want to put my adirondack chairs on it and maybe a couple of flower pots. i’m hoping it can be a good experience to give me the confidence to tackle a bigger project next time.\n\nso… is the build described [here](https://www.homedepot.com/c/ap/how-to-build-a-simple------> diy !!! -deck-on-a-budget/9ba683603be9fa5395fab9016700dbf9) good enough and safe enough for me to try? specifically, are those concrete supports sufficient? most other plans i’ve seen call for more.\n\nagain, i know this is not the kind of deck build to win any awards but as long as this is safe and *good enough* i would like to give it a try.\n\nthanks everyone!", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/q15px5/very_small_front_deck/", "identifyer": 344353, "year": "2021"}, {"Unnamed: 0": 344445, "autor": "aboveallpeaks", "date": 1633629239000, "content": "Drywall in shower is completely rotted out. Can I DIY this? /!/ Hi all!\nLast night, I decided to replace some cracked tiles in my shower. I'd been worried about water seeping in and damaging the drywall. WAY too late for that -- the tiles peeled right off, bringing the adjacent tiles with them, because apparently my entire shower is held together with grout and wishful thinking. The drywall underneath has rotted away entirely, leaving just the wooden studs behind. (The studs look okay, I think. I want to hit them with peroxide to kill any possible mold) But I assume that I have to rip out EVERYTHING and hang new drywall (or cement board?) and then retile.\n\nI have never done anything with drywall before. I don't even know where to begin. I have only basic homeowner's tools. Am I out of my depth here? What do I do?", "link": "https://www.reddit.com/r/DIY/comments/q3en9r/drywall_in_shower_is_completely_rotted_out_can_i/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "drywall in shower is completely rotted out. can i -----> diy !!!  this? /!/ hi all!\nlast night, i decided to replace some cracked tiles in my shower. i'd been worried about water seeping in and damaging the drywall. way too late for that -- the tiles peeled right off, bringing the adjacent tiles with them, because apparently my entire shower is held together with grout and wishful thinking. the drywall underneath has rotted away entirely, leaving just the wooden studs behind. (the studs look okay, i think. i want to hit them with peroxide to kill any possible mold) but i assume that i have to rip out everything and hang new drywall (or cement board?) and then retile.\n\ni have never done anything with drywall before. i don't even know where to begin. i have only basic homeowner's tools. am i out of my depth here? what do i do?", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/q3en9r/drywall_in_shower_is_completely_rotted_out_can_i/", "identifyer": 344445, "year": "2021"}, {"Unnamed: 0": 345284, "autor": "cfrow", "date": 1634865850000, "content": "DIY Mechanic Log for Tracking Equipment Maintenance /!/ I wanted to post here and share with all of you a new web application I built:\n\n[DIY Mechanic Log](https://diymechaniclog.com)\n\nThe purpose of DIY Mechanic Log is to help DIY mechanics and homeowners keep track of the maintenance that we perform on the variety of equipment we own. Between a snowblower, mower, cars, etc it is hard to keep track of everything we do.\n\nDIY Mechanic Log helps solve this problem by allowing us to record everything we do, from oil changes and tire rotations on the family car to spark plugs on the mower.\n\nIt is as simple as adding a piece of equipment then adding log entries for that equipment. You can even add a step by step  guide to help make it easier the next time you do change the oil.\n\nDIY Mechanic Log is completely free to use! Please make an account by signing up using email password or simply signing in using Facebook or Google.\n\nIf you have any questions feel free to reach out on Facebook or via the Contact Us section in the app.", "link": "https://www.reddit.com/r/DIY/comments/qd67a6/diy_mechanic_log_for_tracking_equipment/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  mechanic log for tracking equipment maintenance /!/ i wanted to post here and share with all of you a new web application i built:\n\n[diy mechanic log](https://diymechaniclog.com)\n\nthe purpose of diy mechanic log is to help diy mechanics and homeowners keep track of the maintenance that we perform on the variety of equipment we own. between a snowblower, mower, cars, etc it is hard to keep track of everything we do.\n\ndiy mechanic log helps solve this problem by allowing us to record everything we do, from oil changes and tire rotations on the family car to spark plugs on the mower.\n\nit is as simple as adding a piece of equipment then adding log entries for that equipment. you can even add a step by step  guide to help make it easier the next time you do change the oil.\n\ndiy mechanic log is completely free to use! please make an account by signing up using email password or simply signing in using facebook or google.\n\nif you have any questions feel free to reach out on facebook or via the contact us section in the app.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/qd67a6/diy_mechanic_log_for_tracking_equipment/", "identifyer": 345284, "year": "2021"}, {"Unnamed: 0": 345505, "autor": "JJX77", "date": 1634195928000, "content": "Year 1-1.5 DIY improvements /!/ Year 1-1.5 Improvements\n\nhttps://imgur.com/a/yjM71sq\n\nTrying to not get deleted again, so here is deep dive on the work completed. I’m attempting to do it in order of shown on the Imgur album.\n\nRenovated laundry room: demolished existing flooring, baseboards, cabinets, washer/dryer. Opened walls. Moved plumbing from left wall to back wall. Closed wall. Patched subfloor. Installed new tile, baseboards, shiplap, cabinets, shelving at back wall. Repainted all. Installed saddle/transition strip. Installed new washer dryer. \n\n\nExterior Gate: demolished and removed old rotted wood fencing. Installed new vinyl fencing in place.\n\nExterior front: power washed. Pulled out old dead plants. Installed new alive plants. Mulched.\n\nBack patio: power washed. Created landscaping bed behind brick. Planted boxwoods and mulched. Trimmed existing azalea on left side of photo.\n\nBackyard: killed a bunch of weeds\nSide yard next to garage: Cut back a ton of overgrown stuff.\n\nPantry Butler Cabinet: Painted existing wood butlers pantry to Whale Gray. Put all my wife’s stuff on it.\n\nFloors: Sanded all floors, refinished and poly’d. I had paid help on this.\n\nKitchen circle table: purchased a raw wood unfinished set of table and chairs. Painted stained and poly’d them.\n\nThen a picture of a cute fawn. And my pup helping us with lawn cleanup.\nI hope this is sufficient explanation and post can remain up. The total duration of this work was 18 months. I can’t detail how long each piece took, this is DIY so figure 2 hours each night after work, and 6 hours on Saturdays.\n\nTools Used:\nLaundry Room Demo: Hands. Hammer and crow bar, drywall saw. \n\nLaundry room reno tile: redgard coupling mat &amp; tape, Tile cutter, trowels, self leveling adhesive, mortar, grout, grout sealer. \n\nLaundry room reno: Table saw, compound miter saw, track saw, multi tool, nail gun, drill, taping knives. Pine baseboards, preprimed nickel gap shiplap. Premade cabinets from HD. Premade shelves and brackets from HD cut to size.\n\nAll exterior work: Hands, rakes, shears, hedge trimmer, chainsaw.\n\nFloors: flooring sander, stain and poly.\nButlers pantry cabinet: paint, paint brush, 4” zip roller\n\nKitchen circle table: power sander, sand paper, general finishes milk paint perfect gray, wipe on poly. ScuffX satin white for base paint, Antique oak stain for table top with 4 coats brush on satin poly.\n\nPatio washing: pressure washer. Diluted bleach mix.\n\nExterior gate: vinyl fencing and attaching posts and clips from HD. Shovel. String to make level.", "link": "https://www.reddit.com/r/DIY/comments/q7un15/year_115_diy_improvements/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "year 1-1.5 -----> diy !!!  improvements /!/ year 1-1.5 improvements\n\nhttps://imgur.com/a/yjm71sq\n\ntrying to not get deleted again, so here is deep dive on the work completed. i’m attempting to do it in order of shown on the imgur album.\n\nrenovated laundry room: demolished existing flooring, baseboards, cabinets, washer/dryer. opened walls. moved plumbing from left wall to back wall. closed wall. patched subfloor. installed new tile, baseboards, shiplap, cabinets, shelving at back wall. repainted all. installed saddle/transition strip. installed new washer dryer. \n\n\nexterior gate: demolished and removed old rotted wood fencing. installed new vinyl fencing in place.\n\nexterior front: power washed. pulled out old dead plants. installed new alive plants. mulched.\n\nback patio: power washed. created landscaping bed behind brick. planted boxwoods and mulched. trimmed existing azalea on left side of photo.\n\nbackyard: killed a bunch of weeds\nside yard next to garage: cut back a ton of overgrown stuff.\n\npantry butler cabinet: painted existing wood butlers pantry to whale gray. put all my wife’s stuff on it.\n\nfloors: sanded all floors, refinished and poly’d. i had paid help on this.\n\nkitchen circle table: purchased a raw wood unfinished set of table and chairs. painted stained and poly’d them.\n\nthen a picture of a cute fawn. and my pup helping us with lawn cleanup.\ni hope this is sufficient explanation and post can remain up. the total duration of this work was 18 months. i can’t detail how long each piece took, this is diy so figure 2 hours each night after work, and 6 hours on saturdays.\n\ntools used:\nlaundry room demo: hands. hammer and crow bar, drywall saw. \n\nlaundry room reno tile: redgard coupling mat &amp; tape, tile cutter, trowels, self leveling adhesive, mortar, grout, grout sealer. \n\nlaundry room reno: table saw, compound miter saw, track saw, multi tool, nail gun, drill, taping knives. pine baseboards, preprimed nickel gap shiplap. premade cabinets from hd. premade shelves and brackets from hd cut to size.\n\nall exterior work: hands, rakes, shears, hedge trimmer, chainsaw.\n\nfloors: flooring sander, stain and poly.\nbutlers pantry cabinet: paint, paint brush, 4” zip roller\n\nkitchen circle table: power sander, sand paper, general finishes milk paint perfect gray, wipe on poly. scuffx satin white for base paint, antique oak stain for table top with 4 coats brush on satin poly.\n\npatio washing: pressure washer. diluted bleach mix.\n\nexterior gate: vinyl fencing and attaching posts and clips from hd. shovel. string to make level.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/q7un15/year_115_diy_improvements/", "identifyer": 345505, "year": "2021"}, {"Unnamed: 0": 346053, "autor": "JRS_Life", "date": 1624991386000, "content": "DIY cabinetry - Sharing how I install custom cabinetry by myself, the order I do things, tools I use and tips along the way. Hopefully some helpful nuggets to use in your next building project!", "link": "https://www.reddit.com/r/DIY/comments/oae8by/diy_cabinetry_sharing_how_i_install_custom/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  cabinetry - sharing how i install custom cabinetry by myself, the order i do things, tools i use and tips along the way. hopefully some helpful nuggets to use in your next building project!", "sortedWord": "None", "removed": "automod_filtered", "score": 1, "comments": 0, "media": "rich:video", "medialink": "https://www.youtube.com/watch?v=njy1BELcyAg", "identifyer": 346053, "year": "2021"}, {"Unnamed: 0": 346253, "autor": "MIkletMiklet", "date": 1612140856000, "content": "DIY Restoration | Multi-Tool Capsule from 1940-s", "link": "https://www.reddit.com/r/DIY/comments/l9qptx/diy_restoration_multitool_capsule_from_1940s/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  restoration | multi-tool capsule from 1940-s", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://youtu.be/esEnl5IL1eE", "identifyer": 346253, "year": "2021"}, {"Unnamed: 0": 346421, "autor": "beanz415", "date": 1613406058000, "content": "How does the \"RYOBI 18V ONE+ Cordless 1/2-inch Hammer Drill/Driver\" (what I currently have) compare to a standalone drill and impact driver? /!/ Is it a case of mine being a 'jack of all trades but a master of none'? As in it will drill and drive but not do either quite as well as a dedicated drill and a separate dedicated impact driver.\n\nI bought this drill/driver a year or so ago just because me and my gf needed (wanted) an electric drill just to have and at that time I have no idea what the difference between a drill and an impact driver. We've moved into a house with a big juicy heated oversized double garage so now I finally have room to own some tools. Also, I am - like so many people seem to be today - interested in woodworking as a hobby since it pairs well (in my mind) with having a house and doing little DIY projects.\n\nSo really I'm wondering is at what point - if ever - is it worth 'upgrading' to individual tools instead of a 2-in-1 like what I have?", "link": "https://www.reddit.com/r/DIY/comments/lkgxzz/how_does_the_ryobi_18v_one_cordless_12inch_hammer/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how does the \"ryobi 18v one+ cordless 1/2-inch hammer drill/driver\" (what i currently have) compare to a standalone drill and impact driver? /!/ is it a case of mine being a 'jack of all trades but a master of none'? as in it will drill and drive but not do either quite as well as a dedicated drill and a separate dedicated impact driver.\n\ni bought this drill/driver a year or so ago just because me and my gf needed (wanted) an electric drill just to have and at that time i have no idea what the difference between a drill and an impact driver. we've moved into a house with a big juicy heated oversized double garage so now i finally have room to own some tools. also, i am - like so many people seem to be today - interested in woodworking as a hobby since it pairs well (in my mind) with having a house and doing little -----> diy !!!  projects.\n\nso really i'm wondering is at what point - if ever - is it worth 'upgrading' to individual tools instead of a 2-in-1 like what i have?", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/lkgxzz/how_does_the_ryobi_18v_one_cordless_12inch_hammer/", "identifyer": 346421, "year": "2021"}, {"Unnamed: 0": 347375, "autor": "[deleted]", "date": 1614781591000, "content": "DIY electric engraver for jewelry. Engraving tools are basic for any jeweler. This time I make an adapter to be able to use my engravers with the handheld micro motor and turn it into an electric engraver. I leave you the materials and the process explained step by step in the video. /!/ [deleted]", "link": "https://www.reddit.com/r/DIY/comments/lwv3rx/diy_electric_engraver_for_jewelry_engraving_tools/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  electric engraver for jewelry. engraving tools are basic for any jeweler. this time i make an adapter to be able to use my engravers with the handheld micro motor and turn it into an electric engraver. i leave you the materials and the process explained step by step in the video. /!/ [deleted]", "sortedWord": "None", "removed": "deleted", "score": 1, "comments": 2, "media": null, "medialink": "https://www.youtube.com/watch?v=9897xWHmrFY&amp;list=PLmHl4Obj4uSTGMTKe08WhE_SgTMowtYm0&amp;index=11", "identifyer": 347375, "year": "2021"}, {"Unnamed: 0": 347601, "autor": "MakeItBetter2019", "date": 1614186299000, "content": "DIY Batman Batarang without using Power Tools", "link": "https://www.reddit.com/r/DIY/comments/lrhpth/diy_batman_batarang_without_using_power_tools/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  batman batarang without using power tools", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.youtube.com/watch?v=fNOGZSK8ijI", "identifyer": 347601, "year": "2021"}, {"Unnamed: 0": 348094, "autor": "JPtheJOKERtg", "date": 1615222898000, "content": "I want to DIY build a laptop stand for my 14'' notebook. I dont have any woodworking tools, wood, PVC Pipes or any such material, but want something functional and aesthetically pleasing... Any ideas??? /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/m0k8er/i_want_to_diy_build_a_laptop_stand_for_my_14/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i want to -----> diy !!!  build a laptop stand for my 14'' notebook. i dont have any woodworking tools, wood, pvc pipes or any such material, but want something functional and aesthetically pleasing... any ideas??? /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/m0k8er/i_want_to_diy_build_a_laptop_stand_for_my_14/", "identifyer": 348094, "year": "2021"}, {"Unnamed: 0": 348129, "autor": "stayshocked", "date": 1615168396000, "content": "Get my son to work in the shop: DIY trailer for HD mower /!/ Entry woodwork project for young kids. We prepared the wood parts with nail holes, wheels, axils, toll hitch made of 3D printer. The nail holes were predrilled by CNC mill. It is a nice project to get the kid to understand how to put design into parts, as well as using basic workshop tools like hammer, wood glue, nails and screws. \n\n[All done!](https://preview.redd.it/vp053ljbnpl61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d40ef97b8535c9d717627dc7b553fccfa656a7a3)", "link": "https://www.reddit.com/r/DIY/comments/m052xr/get_my_son_to_work_in_the_shop_diy_trailer_for_hd/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "get my son to work in the shop: -----> diy !!!  trailer for hd mower /!/ entry woodwork project for young kids. we prepared the wood parts with nail holes, wheels, axils, toll hitch made of 3d printer. the nail holes were predrilled by cnc mill. it is a nice project to get the kid to understand how to put design into parts, as well as using basic workshop tools like hammer, wood glue, nails and screws. \n\n[all done!](https://preview.redd.it/vp053ljbnpl61.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d40ef97b8535c9d717627dc7b553fccfa656a7a3)", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/m052xr/get_my_son_to_work_in_the_shop_diy_trailer_for_hd/", "identifyer": 348129, "year": "2021"}, {"Unnamed: 0": 348214, "autor": "JOGSLANG", "date": 1615681349000, "content": "Unique Tools for DIY", "link": "https://www.reddit.com/r/DIY/comments/m4jerl/unique_tools_for_diy/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "unique tools for -----> diy !!! ", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": "rich:video", "medialink": "https://youtu.be/VUo_5e3v6CU", "identifyer": 348214, "year": "2021"}, {"Unnamed: 0": 348397, "autor": "asagodage", "date": 1610456867000, "content": "How to Choose Best Cordless Drills Under $150 /!/  \n\nhttps://preview.redd.it/97r9yatihwa61.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=7c1fb5dd751aaa01c1be6f3eec8035e85129860e\n\nHere are a lot of variables to buying [the best cordless drills under $150](https://bestcordlessdrillz.com/best-cordless-drills-under-150-for-diy-and-home/) and the primary use for the drill. Drill speed RPMs, Torque output, motor size amps of output, and battery type size are all very important things to be considered first.\n\nBuying the best budget cordless drill will cost a little more than your expectations. But you need the cheapest &amp; the best cordless drill among the power tools. If you are residential DIY how much handyman works needs to be done.  \n\nsome homeowners expect from you, great drill just like badass a professional. If you’re building a deck, Use a hard drill. For that, you want extra money to buy a better grade of the drill as a power tool. you can go into the hardware store and buy a couple of the best cordless drills for under $150.\n\n If you’re a DIY professional, you’ll want to buy a commercial-grade cordless drill. As well as buy two rechargeable batteries as a kit. The batteries should be lithium batteries for longer power and longer battery longevity.\n\nI would recommend an 18 volt larger but for most people, an 18–20-volt battery will be fine. The better brands are [DeWalt](https://bestcordlessdrillz.com/category/dewalt/), [Milwaukee](https://bestcordlessdrillz.com/milwaukee-2691-22-cordless-combo-kit-m18/), [Craftsman](https://bestcordlessdrillz.com/category/craftman-cordless-drill-driver-kit-tools-review/), Ryobi, [Makita](https://bestcordlessdrillz.com/category/makita/), [Black + Decker](https://bestcordlessdrillz.com/category/blackdecker/), [KIMO](https://bestcordlessdrillz.com/category/kimo-cordless-drills/), and [Bosh](https://bestcordlessdrillz.com/category/bosch/) you can get those in a better grade or a commercial grade. The commercial-grade cordless drills will be in the $250+ range.\n\nCheck sales. Your local hardware store, and the big box outlets, and the online vendors all have factory promotions regularly. Never buy a cordless tool of any description at regular retail unless you need it for work and you broke the predecessor. The better grade will be in the $150s and available at the big box stores.", "link": "https://www.reddit.com/r/DIY/comments/kvrbzc/how_to_choose_best_cordless_drills_under_150/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to choose best cordless drills under $150 /!/  \n\nhttps://preview.redd.it/97r9yatihwa61.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=7c1fb5dd751aaa01c1be6f3eec8035e85129860e\n\nhere are a lot of variables to buying [the best cordless drills under $150](https://bestcordlessdrillz.com/best-cordless-drills-under-150-for------> diy !!! -and-home/) and the primary use for the drill. drill speed rpms, torque output, motor size amps of output, and battery type size are all very important things to be considered first.\n\nbuying the best budget cordless drill will cost a little more than your expectations. but you need the cheapest &amp; the best cordless drill among the power tools. if you are residential diy how much handyman works needs to be done.  \n\nsome homeowners expect from you, great drill just like badass a professional. if you’re building a deck, use a hard drill. for that, you want extra money to buy a better grade of the drill as a power tool. you can go into the hardware store and buy a couple of the best cordless drills for under $150.\n\n if you’re a diy professional, you’ll want to buy a commercial-grade cordless drill. as well as buy two rechargeable batteries as a kit. the batteries should be lithium batteries for longer power and longer battery longevity.\n\ni would recommend an 18 volt larger but for most people, an 18–20-volt battery will be fine. the better brands are [dewalt](https://bestcordlessdrillz.com/category/dewalt/), [milwaukee](https://bestcordlessdrillz.com/milwaukee-2691-22-cordless-combo-kit-m18/), [craftsman](https://bestcordlessdrillz.com/category/craftman-cordless-drill-driver-kit-tools-review/), ryobi, [makita](https://bestcordlessdrillz.com/category/makita/), [black + decker](https://bestcordlessdrillz.com/category/blackdecker/), [kimo](https://bestcordlessdrillz.com/category/kimo-cordless-drills/), and [bosh](https://bestcordlessdrillz.com/category/bosch/) you can get those in a better grade or a commercial grade. the commercial-grade cordless drills will be in the $250+ range.\n\ncheck sales. your local hardware store, and the big box outlets, and the online vendors all have factory promotions regularly. never buy a cordless tool of any description at regular retail unless you need it for work and you broke the predecessor. the better grade will be in the $150s and available at the big box stores.", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/kvrbzc/how_to_choose_best_cordless_drills_under_150/", "identifyer": 348397, "year": "2021"}, {"Unnamed: 0": 348402, "autor": "tibble49", "date": 1610454843000, "content": "Adding Electrical to an Enclosed Trailer /!/ Hey DIY crew!\n\nI've poked around at existing posts and I've gotten some ideas/understanding but I am still not seeing a clear path.\n\nWe have an enclosed trailer used for rescue mostly. We would like to add more exterior lighting (scene and emergency) as well as internal outlets to support a coffee pot, tool charging, a TV potentially, etc. \n\nMy thought was to have an auto eject plug like our trucks have (something like this [https://kussmaul.com/wp-auto-ejects](https://kussmaul.com/wp-auto-ejects)). That would power the outlets when the trailer is parked in station. Then inside I expected to have a small panel for a couple circuits. \n\nI was thinking a battery or two would be nice to run the outlets and lights when on scene and when a generator isn't available to be hooked up to the auto eject.\n\nI just feel like I can't find a good \"follow these steps\" or diagram of how to best go about this. I have residential electrical experience but this seems to be a whole different field\n\nThanks in advance!", "link": "https://www.reddit.com/r/DIY/comments/kvqtql/adding_electrical_to_an_enclosed_trailer/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "adding electrical to an enclosed trailer /!/ hey -----> diy !!!  crew!\n\ni've poked around at existing posts and i've gotten some ideas/understanding but i am still not seeing a clear path.\n\nwe have an enclosed trailer used for rescue mostly. we would like to add more exterior lighting (scene and emergency) as well as internal outlets to support a coffee pot, tool charging, a tv potentially, etc. \n\nmy thought was to have an auto eject plug like our trucks have (something like this [https://kussmaul.com/wp-auto-ejects](https://kussmaul.com/wp-auto-ejects)). that would power the outlets when the trailer is parked in station. then inside i expected to have a small panel for a couple circuits. \n\ni was thinking a battery or two would be nice to run the outlets and lights when on scene and when a generator isn't available to be hooked up to the auto eject.\n\ni just feel like i can't find a good \"follow these steps\" or diagram of how to best go about this. i have residential electrical experience but this seems to be a whole different field\n\nthanks in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/kvqtql/adding_electrical_to_an_enclosed_trailer/", "identifyer": 348402, "year": "2021"}, {"Unnamed: 0": 348458, "autor": "iTakeCreditForAwards", "date": 1610586663000, "content": "What's an easy material to work with to create a dog ramp? (Not wood) /!/ Title. I don't have the tools to work with wood, nor do I feel like buying those tools. I was thinking maybe I can find some type of heavy duty corrugated plastic.\n\nJust looking for suggestions. My goal is something [in similar shape to this.](https://cdn1.playbarkrun.com/wp-content/uploads/2020/05/29104759/DIY-Dog-Ramp-Tutorial-at-IrresistiblePets.com_.jpg)\n\nThanks!", "link": "https://www.reddit.com/r/DIY/comments/kwuumf/whats_an_easy_material_to_work_with_to_create_a/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what's an easy material to work with to create a dog ramp? (not wood) /!/ title. i don't have the tools to work with wood, nor do i feel like buying those tools. i was thinking maybe i can find some type of heavy duty corrugated plastic.\n\njust looking for suggestions. my goal is something [in similar shape to this.](https://cdn1.playbarkrun.com/wp-content/uploads/2020/05/29104759/-----> diy !!! -dog-ramp-tutorial-at-irresistiblepets.com_.jpg)\n\nthanks!", "sortedWord": "None", "removed": null, "score": 0, "comments": 38, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/kwuumf/whats_an_easy_material_to_work_with_to_create_a/", "identifyer": 348458, "year": "2021"}, {"Unnamed: 0": 348808, "autor": "Yukonhijack", "date": 1609545718000, "content": "DIY Office Desk/Shelves upgrade /!/ The office in my house was the last room that needed attention.  It had kind of become the dumping ground for things from the other rooms as they were being upgraded.  I had an old antique school desk that was cool, but too small and I wanted something a little more interesting.  There's no before picture, because it was just a room with a bunch of crap jammed in it.  Really happy how it turned out.\n\nhttps://imgur.com/gallery/vhJz0lN", "link": "https://www.reddit.com/r/DIY/comments/kombu6/diy_office_deskshelves_upgrade/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  office desk/shelves upgrade /!/ the office in my house was the last room that needed attention.  it had kind of become the dumping ground for things from the other rooms as they were being upgraded.  i had an old antique school desk that was cool, but too small and i wanted something a little more interesting.  there's no before picture, because it was just a room with a bunch of crap jammed in it.  really happy how it turned out.\n\nhttps://imgur.com/gallery/vhjz0ln", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/kombu6/diy_office_deskshelves_upgrade/", "identifyer": 348808, "year": "2021"}, {"Unnamed: 0": 349234, "autor": "OSHOs-workshop", "date": 1611919255000, "content": "[DIY wooden stool] How to make a fashionable antique stool. /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/l7q6na/diy_wooden_stool_how_to_make_a_fashionable/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "[-----> diy !!!  wooden stool] how to make a fashionable antique stool. /!/ [removed]", "sortedWord": "None", "removed": "reddit", "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l7q6na/diy_wooden_stool_how_to_make_a_fashionable/", "identifyer": 349234, "year": "2021"}, {"Unnamed: 0": 349288, "autor": "rightwingchamp", "date": 1611887470000, "content": "Diy real combat armor and riding lawnmowers /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/l7gm5c/diy_real_combat_armor_and_riding_lawnmowers/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  real combat armor and riding lawnmowers /!/ [removed]", "sortedWord": "None", "removed": "automod_filtered", "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l7gm5c/diy_real_combat_armor_and_riding_lawnmowers/", "identifyer": 349288, "year": "2021"}, {"Unnamed: 0": 349366, "autor": "wolmarwolmar", "date": 1611777530000, "content": "Help needed on DIY floating photo blind /!/ Any advice on DIY floating blind would me much appreciated. I am thinking more about making a dry blind from PVC pipes but not sure how wide it should be or how I could propel it. Probably \"a wet\" blind would be easier where I would be submerged in waders but not so fun in colder conditions.  \nI've searched around a bit but any real advice or experience is very welcome. Thanks!", "link": "https://www.reddit.com/r/DIY/comments/l6cxbs/help_needed_on_diy_floating_photo_blind/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help needed on -----> diy !!!  floating photo blind /!/ any advice on diy floating blind would me much appreciated. i am thinking more about making a dry blind from pvc pipes but not sure how wide it should be or how i could propel it. probably \"a wet\" blind would be easier where i would be submerged in waders but not so fun in colder conditions.  \ni've searched around a bit but any real advice or experience is very welcome. thanks!", "sortedWord": "None", "removed": null, "score": 0, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/l6cxbs/help_needed_on_diy_floating_photo_blind/", "identifyer": 349366, "year": "2021"}, {"Unnamed: 0": 349565, "autor": "reCCCCtoor", "date": 1617705122000, "content": "DIY Jungle Terrarium in a old wooden Showcase /!/ Steps:\n\n1. remove the shelf \n\n2. coat the whole inside with (in this case) clear mangel\n\n3. cover the walls and the floor with styrofoam (i used 3cm) using silicon\n\n4. add the plant pots and fix them by using construction foam (you can cut the foam with a box knife when its hard, so dont worry if the shape isnt exactly like you want it)\n\nwait for everything to dry out\n\n6. apply tile adhesive on the styrofoam and the construction foam covered plant pots\n\n7. apply 2nd layer of tile glue on everything, but now add in 20% peat\n\n8. apply 3rd and final layer of tile glue, now with 40% peat added.\n\n&amp;#x200B;\n\non the final layer sprinkle some peat on the wet glue and let it rest for at least 24 hours\n\n&amp;#x200B;\n\nnow you can add whatevery you like to create your very own little jungle :-).\n\n&amp;#x200B;\n\ntools:\n\ni used only a hole milling maschine for the wholes in the top and a box cutter (for the styrofoam and constructionfoam)\n\n&amp;#x200B;\n\ntime:\n\nthis project took 4 days with like 2 hours a day (most of the time you had to wait for everything to get dry)\n\nhttps://preview.redd.it/01e4fopc6jr61.jpg?width=2908&amp;format=pjpg&amp;auto=webp&amp;s=bd6b90ab1fc13515bfa44768550ccc056d3a6dd0", "link": "https://www.reddit.com/r/DIY/comments/ml8mjx/diy_jungle_terrarium_in_a_old_wooden_showcase/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  jungle terrarium in a old wooden showcase /!/ steps:\n\n1. remove the shelf \n\n2. coat the whole inside with (in this case) clear mangel\n\n3. cover the walls and the floor with styrofoam (i used 3cm) using silicon\n\n4. add the plant pots and fix them by using construction foam (you can cut the foam with a box knife when its hard, so dont worry if the shape isnt exactly like you want it)\n\nwait for everything to dry out\n\n6. apply tile adhesive on the styrofoam and the construction foam covered plant pots\n\n7. apply 2nd layer of tile glue on everything, but now add in 20% peat\n\n8. apply 3rd and final layer of tile glue, now with 40% peat added.\n\n&amp;#x200b;\n\non the final layer sprinkle some peat on the wet glue and let it rest for at least 24 hours\n\n&amp;#x200b;\n\nnow you can add whatevery you like to create your very own little jungle :-).\n\n&amp;#x200b;\n\ntools:\n\ni used only a hole milling maschine for the wholes in the top and a box cutter (for the styrofoam and constructionfoam)\n\n&amp;#x200b;\n\ntime:\n\nthis project took 4 days with like 2 hours a day (most of the time you had to wait for everything to get dry)\n\nhttps://preview.redd.it/01e4fopc6jr61.jpg?width=2908&amp;format=pjpg&amp;auto=webp&amp;s=bd6b90ab1fc13515bfa44768550ccc056d3a6dd0", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ml8mjx/diy_jungle_terrarium_in_a_old_wooden_showcase/", "identifyer": 349565, "year": "2021"}, {"Unnamed: 0": 349693, "autor": "BreeGee999", "date": 1609691163000, "content": "DIY Compost Bin /!/ Anyone have experience creating your own compost bin?   I have plenty of space in the back yard, but limited tools.  Was hoping to get some creative ideas from you fine folks.", "link": "https://www.reddit.com/r/DIY/comments/kpng0d/diy_compost_bin/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  compost bin /!/ anyone have experience creating your own compost bin?   i have plenty of space in the back yard, but limited tools.  was hoping to get some creative ideas from you fine folks.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/kpng0d/diy_compost_bin/", "identifyer": 349693, "year": "2021"}, {"Unnamed: 0": 349825, "autor": "Patient-Ad-8589", "date": 1630966405000, "content": "Taking off a toilet seat with old bolts? /!/ I'm a DIY nimrod so sorry if this is obvious. I rent and want to attach a bidet attachment to my toilet. I'm not entirely sure how to take off the toilet seat without damaging it/the toilet.\n\nThere are two rusted bolts (or are they screws?) connecting the lid. (Pic 1)    \nUnderneath there are nuts (I think) holding those bolts/screws in place.  (Pic 2)\n\nThe toilet is in a tight spot. I bought a pair of pliers and a basin wrench in case I won't be able to easily maneuver around with the pliers. Do I need anything else? How do I actually take it off? \n\nThanks for your help!\n\n[Rusted bolts attaching the lid](https://preview.redd.it/m6isy05liyl71.png?width=1358&amp;format=png&amp;auto=webp&amp;s=149ed76731704900944e2d800b723c3cba35ebb8)\n\n&amp;#x200B;\n\n[One of the nuts - I accidentally broke the lower part of it already](https://preview.redd.it/d9sxxufoiyl71.png?width=1298&amp;format=png&amp;auto=webp&amp;s=87371ed277fa03abdd041a7d445e832b1d6abb89)\n\n[The other nut](https://preview.redd.it/hmo60n2siyl71.png?width=1380&amp;format=png&amp;auto=webp&amp;s=d4a7a72b7733327771a1eb442519b235a2f7f65f)", "link": "https://www.reddit.com/r/DIY/comments/pj9t15/taking_off_a_toilet_seat_with_old_bolts/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "taking off a toilet seat with old bolts? /!/ i'm a -----> diy !!!  nimrod so sorry if this is obvious. i rent and want to attach a bidet attachment to my toilet. i'm not entirely sure how to take off the toilet seat without damaging it/the toilet.\n\nthere are two rusted bolts (or are they screws?) connecting the lid. (pic 1)    \nunderneath there are nuts (i think) holding those bolts/screws in place.  (pic 2)\n\nthe toilet is in a tight spot. i bought a pair of pliers and a basin wrench in case i won't be able to easily maneuver around with the pliers. do i need anything else? how do i actually take it off? \n\nthanks for your help!\n\n[rusted bolts attaching the lid](https://preview.redd.it/m6isy05liyl71.png?width=1358&amp;format=png&amp;auto=webp&amp;s=149ed76731704900944e2d800b723c3cba35ebb8)\n\n&amp;#x200b;\n\n[one of the nuts - i accidentally broke the lower part of it already](https://preview.redd.it/d9sxxufoiyl71.png?width=1298&amp;format=png&amp;auto=webp&amp;s=87371ed277fa03abdd041a7d445e832b1d6abb89)\n\n[the other nut](https://preview.redd.it/hmo60n2siyl71.png?width=1380&amp;format=png&amp;auto=webp&amp;s=d4a7a72b7733327771a1eb442519b235a2f7f65f)", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/pj9t15/taking_off_a_toilet_seat_with_old_bolts/", "identifyer": 349825, "year": "2021"}, {"Unnamed: 0": 349837, "autor": "heeyyeah12", "date": 1618441446000, "content": "wood grain tool for tv stand /!/ Hi!! I've been trying to wrap my mind around doing this DIY project, but it is just NOT clicking! I'm trying to use wood graining tools and wood stains to change my tv stand from a dark to a light color. The darker furniture pic is my tv stand currently (from target website), the other picture is about the color I want it to be (sorry if the post is weird, I couldn't figure out how to do 2 pictures at once). According to the target website, my tv stand is made of \"MDF Composite (Medium-Density Fiberboard), Particle Board (Frame)\". Do I need to completely sand it first? I sanded a little corner just to see and underneath is just white of course.\n\nDoes anyone have any idea what stains I should use? I've looked at stain colors like \"honey maple\" and \"natural\". From different videos, I understand that I paint a base layer that's lighter, and then a top layer (stain?) that's darker. Are they both stains? Is the bottom layer just paint? Ahh! I just can't wrap my mind around it :) any advice would be super appreciated!\n\n[lighter wood color that i want](https://preview.redd.it/8kggd42pz7t61.png?width=1326&amp;format=png&amp;auto=webp&amp;s=23a6c88ead49f1edac73c508d2bd5db32e7882f0)", "link": "https://www.reddit.com/r/DIY/comments/mr2bh8/wood_grain_tool_for_tv_stand/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "wood grain tool for tv stand /!/ hi!! i've been trying to wrap my mind around doing this -----> diy !!!  project, but it is just not clicking! i'm trying to use wood graining tools and wood stains to change my tv stand from a dark to a light color. the darker furniture pic is my tv stand currently (from target website), the other picture is about the color i want it to be (sorry if the post is weird, i couldn't figure out how to do 2 pictures at once). according to the target website, my tv stand is made of \"mdf composite (medium-density fiberboard), particle board (frame)\". do i need to completely sand it first? i sanded a little corner just to see and underneath is just white of course.\n\ndoes anyone have any idea what stains i should use? i've looked at stain colors like \"honey maple\" and \"natural\". from different videos, i understand that i paint a base layer that's lighter, and then a top layer (stain?) that's darker. are they both stains? is the bottom layer just paint? ahh! i just can't wrap my mind around it :) any advice would be super appreciated!\n\n[lighter wood color that i want](https://preview.redd.it/8kggd42pz7t61.png?width=1326&amp;format=png&amp;auto=webp&amp;s=23a6c88ead49f1edac73c508d2bd5db32e7882f0)", "sortedWord": "None", "removed": null, "score": 1, "comments": 32, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/mr2bh8/wood_grain_tool_for_tv_stand/", "identifyer": 349837, "year": "2021"}, {"Unnamed: 0": 349929, "autor": "victorstanciu", "date": 1618382905000, "content": "Tips for drilling two directly opposite holes in a square steel pipe with a step bit and no drill press? /!/ Hello everyone! \n\nI want to drill a 10 mm hole straight through a square steel pipe (20 mm diameter, ~1.5-2 mm thickness). The limiting factor is that I'm using a step bit, so I can't just drill through both sides at once (because then I'll end up with a much larger hole on one side), and that I don't have access to a drill press, especially with the Corona situation.\n\nOther than trying to do a really good job when measuring where to put the holes (with a combination square or something), are there any tips for aligning the holes as close to perfect as possible? I'm trying to DIY a [derailleur hanger alignment tool ](https://www.google.com/search?q=derailleur+alignment+tool&amp;source=lnms&amp;tbm=isch) for my home bicycle workshop, and the error margin at the end with the holes gets multiplied many times over at the other end of the tool, where the measurement is made.", "link": "https://www.reddit.com/r/DIY/comments/mql1o0/tips_for_drilling_two_directly_opposite_holes_in/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "tips for drilling two directly opposite holes in a square steel pipe with a step bit and no drill press? /!/ hello everyone! \n\ni want to drill a 10 mm hole straight through a square steel pipe (20 mm diameter, ~1.5-2 mm thickness). the limiting factor is that i'm using a step bit, so i can't just drill through both sides at once (because then i'll end up with a much larger hole on one side), and that i don't have access to a drill press, especially with the corona situation.\n\nother than trying to do a really good job when measuring where to put the holes (with a combination square or something), are there any tips for aligning the holes as close to perfect as possible? i'm trying to -----> diy !!!  a [derailleur hanger alignment tool ](https://www.google.com/search?q=derailleur+alignment+tool&amp;source=lnms&amp;tbm=isch) for my home bicycle workshop, and the error margin at the end with the holes gets multiplied many times over at the other end of the tool, where the measurement is made.", "sortedWord": "None", "removed": null, "score": 1, "comments": 15, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/mql1o0/tips_for_drilling_two_directly_opposite_holes_in/", "identifyer": 349929, "year": "2021"}, {"Unnamed: 0": 350006, "autor": "phatonycmu", "date": 1610828592000, "content": "Ideas for under stairs storage with 2 curved walls? /!/ Hello,\nMany thanks for all the DIY info here.  It’s been helpful.  I had a brainstorm question I thought you might be able to offer up some ideas.\n\nWe have storage under a curved staircase that I’m looking to make more functional.  Both walls are curved and the area is about 40” wide - depth and height have plenty of space.  This storage is mostly for long-term storage keepsakes and seasonal items (e.g. Christmas decorations).  I don’t mind stacking boxes the way we have, but it does put stress on the bottom boxes (fragile items) and make it a bit hard to access.\n\nAny ideas?  I’ve looked at curved wall shelving.  I was also thinking about ‘bookshelf’ style shelves on castors.\n\nIn terms of what my own skills/time will allow for...  I’m an amateur woodworker and not against more bespoke options.  I just haven’t seen any decent way of cutting shelving for curved walls that doesn’t rely on a fair amount of free-hand cutting with a jigsaw or bandsaw.\n\nTools I have available:\n-Table saw\n-Router\n-Circular saw\n-Jig saw", "link": "https://www.reddit.com/r/DIY/comments/kyql8q/ideas_for_under_stairs_storage_with_2_curved_walls/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "ideas for under stairs storage with 2 curved walls? /!/ hello,\nmany thanks for all the -----> diy !!!  info here.  it’s been helpful.  i had a brainstorm question i thought you might be able to offer up some ideas.\n\nwe have storage under a curved staircase that i’m looking to make more functional.  both walls are curved and the area is about 40” wide - depth and height have plenty of space.  this storage is mostly for long-term storage keepsakes and seasonal items (e.g. christmas decorations).  i don’t mind stacking boxes the way we have, but it does put stress on the bottom boxes (fragile items) and make it a bit hard to access.\n\nany ideas?  i’ve looked at curved wall shelving.  i was also thinking about ‘bookshelf’ style shelves on castors.\n\nin terms of what my own skills/time will allow for...  i’m an amateur woodworker and not against more bespoke options.  i just haven’t seen any decent way of cutting shelving for curved walls that doesn’t rely on a fair amount of free-hand cutting with a jigsaw or bandsaw.\n\ntools i have available:\n-table saw\n-router\n-circular saw\n-jig saw", "sortedWord": "None", "removed": null, "score": 2, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/kyql8q/ideas_for_under_stairs_storage_with_2_curved_walls/", "identifyer": 350006, "year": "2021"}, {"Unnamed: 0": 350148, "autor": "PancreKing", "date": 1610995448000, "content": "Floating bed, my first DIY project ever! /!/ https://imgur.com/a/TlGp7kQ\n\nI made it work with 11 2x6x8 boards, and only hand tools! Cut them all to size with my circular saw, and then everything else was done with my impact driver and palm sander! Can't express how happy i am and proud of my first project! (It was my better half's idea for the rgb strips, and it was a good choice!)\n\n7 hours, and less than $200 and i am pleased!", "link": "https://www.reddit.com/r/DIY/comments/l00smq/floating_bed_my_first_diy_project_ever/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "floating bed, my first -----> diy !!!  project ever! /!/ https://imgur.com/a/tlgp7kq\n\ni made it work with 11 2x6x8 boards, and only hand tools! cut them all to size with my circular saw, and then everything else was done with my impact driver and palm sander! can't express how happy i am and proud of my first project! (it was my better half's idea for the rgb strips, and it was a good choice!)\n\n7 hours, and less than $200 and i am pleased!", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/l00smq/floating_bed_my_first_diy_project_ever/", "identifyer": 350148, "year": "2021"}, {"Unnamed: 0": 350694, "autor": "conigo24", "date": 1632601634000, "content": "Diy multi tool 4 in 1", "link": "https://www.reddit.com/r/DIY/comments/pvev54/diy_multi_tool_4_in_1/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  multi tool 4 in 1", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "image", "medialink": "https://i.redd.it/vzqnl70clpp71.jpg", "identifyer": 350694, "year": "2021"}, {"Unnamed: 0": 351157, "autor": "crispyswift", "date": 1621328084000, "content": "Crogsloft /!/ I was wondering what tools i would need to diy and fix up my crogsloft, it's mainly all wood", "link": "https://www.reddit.com/r/DIY/comments/nf5m9o/crogsloft/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "crogsloft /!/ i was wondering what tools i would need to -----> diy !!!  and fix up my crogsloft, it's mainly all wood", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/nf5m9o/crogsloft/", "identifyer": 351157, "year": "2021"}, {"Unnamed: 0": 351349, "autor": "wanderyang", "date": 1631328764000, "content": "What do you think of this laser cutter for home DIY? Is it the right tool to go?", "link": "https://www.reddit.com/r/DIY/comments/plz988/what_do_you_think_of_this_laser_cutter_for_home/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what do you think of this laser cutter for home -----> diy !!! ? is it the right tool to go?", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "link", "medialink": "https://twotrees3d.com/desktop-laser-cutter-ts3-your-ultimate-diy-cutting-solution/", "identifyer": 351349, "year": "2021"}, {"Unnamed: 0": 352051, "autor": "AcademicPhilosophy84", "date": 1626020255000, "content": "What website do you make use of for researching tools used in the trades, or for DIY projects? /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/oi7eik/what_website_do_you_make_use_of_for_researching/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what website do you make use of for researching tools used in the trades, or for -----> diy !!!  projects? /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oi7eik/what_website_do_you_make_use_of_for_researching/", "identifyer": 352051, "year": "2021"}, {"Unnamed: 0": 352172, "autor": "OsoiUsagi", "date": 1625885028000, "content": "Is it safe to use 220v-240v 400w electric motor for DIY rotary tool? It feels too powerful for my level. Not just the motor, also the current are possible hazard.", "link": "https://www.reddit.com/r/DIY/comments/ohadlm/is_it_safe_to_use_220v240v_400w_electric_motor/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "is it safe to use 220v-240v 400w electric motor for -----> diy !!!  rotary tool? it feels too powerful for my level. not just the motor, also the current are possible hazard.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "image", "medialink": "https://i.redd.it/44e42p4etaa71.jpg", "identifyer": 352172, "year": "2021"}, {"Unnamed: 0": 352251, "autor": "Zedoack", "date": 1621958324000, "content": "Our Victoria Day Weekend Backsplash Project /!/ Full Album: https://imgur.com/a/Slb3gKN\n\nFor the May 24th weekend holiday (Victoria Day) here in Canada, my partner and I decided that we should try to install a backsplash in our kitchen. We like the look of a tile backsplash, and the cost of lumber has put some other projects (like a fence) on hold for now.\n\nThis project turned out to be quite affordable, even with having to buy several tools.\n\nThe tools and materials we had to get were (prices in Canadian dollars, and after 15% sales tax):\n\n-17.5 sq ft of tile. We bought 3” x 12” white tiles with a slight ‘hammered’ look to them. We thought this was a good balance of classic but with some texture. We purchased 30 sq foot, which turned out to be way too much, and will be returning the extra. Not sure the brand, purchased from The Paint Shop. $100\n\n-1 Gal Type 1 Mapei Tile Adhesive from The Paint Shop. $32\n\n-Schluter Strip. We got the Jolly, in Bright White. Also purchased from The Paint Shop, $6\n\n-10lbs bag of Mapei Ultracolor Plus FA grout in Pearl Grey. Purchased from The Paint Shop, for $32\n\n-Tube of matching Mapei Pearl Grey Caulking. Purchased from The Paint Shop for $24\n\n-Tile Spacers. I got 2 bags of 100 with 1/8” spacing. Don’t recall the brand and lost the receipt, but purchased from The Paint Shop for roughly $5\n\n-Tile Cutter. Borrowed from my father, so fortunately no cost.\n\n-Tile Saw. Powerfist Brand that I found on Facebook marketplace. Previous owner used it for two projects and had no use for it anymore. Also came with two new blades. Snagged this deal for $30!\n\n-Grout Float. Bought a medium firmness grout float from Kent for $14\n\n-Grout Sponge bought from Kent for $2\n\n-Grout mixer, bought from Kent for $11\n\n-5 Gal bucket. Could’ve done with a smaller 2 gallon one. Also would recommend having three instead of 1. Bought from Kent for $5\n\n-Assorted other items like garbage bags, painters’ tape, and various other tools that I already had.\n\n-Tile Nippers from Home Depot for $21\n\n-1/4” square notch trowel from Home Depot. I’d recommend a smaller notch for this size tile on a backsplash, which I’ll explain later. $6\n\nTotal Materials Cost: $199\n\nTotal Tools Cost: $89\n\nTotal Cost: $288\n\n\nTiling:\n\nFirst steps were to clear our countertops of everything, wipe down our walls and counter, and then lay some garbage bags and tape them to the countertop as a drop sheet.\n\nMy Father came over to help me with tiling, since he at least had some limited experience working with tile before, even if it wasn’t for a backsplash.\n\nRight off the bat, I wasn’t sure where I should start. I knew I should start from the outside of the counter and work in, and we decided to start on the long wall first, but I wasn’t sure whether to start tile at the edge of the counter or upper cabinet. After a quick google search, I found that you should start your tile at the edge of the upper cabinets, which fortunately meant no miter was needed to add a horizontal portion to the Schluter Strip.\n\nWe used a level and drew a line straight down from the upper cabinet to the countertop. This line would be the outside edge of our Schluter Strip. I then applied some tile adhesive and stuck on a piece of Schluter strip that I’d trimmed down to size.\n\nFrom here, we could start applying more adhesive and begin with the tile! I started applying the adhesive and tile, while my father started trying to cut some in half using the tile cutter. It took a few tries, but we eventually got some to cut right down the middle. Once we had that, we used it as a guide for the next few.\n\nIt wasn’t long after beginning to apply tiles that we came across a spot where a complicated cut would be required. The tile needed to have a “U” shape cut for a 3-gang wall plate, plus another “U” shape cut for a single wall plate that held a phone jack. We knew this would be difficult since the bottom edge of the tile would end up being so thin, and we had literally no experience at all with the tile saw at this point. I quickly decided we would just cover up the box for the phone jack; It didn’t have an ethernet cable to use for internet, and who has a home phone anymore. Even with this decision made, we still broke 4 tiles trying to get the single 3-gang box cut out… until we decided to use the first broken tile anyways since the break was relatively easy to hide under the wall plate and not very noticeable. If we’d had more experience with the saw, we probably could’ve gotten this to work.\n\nWith that one stubborn tile up, and my father now having some feel for how the tile saw worked, we were good to continue tiling! I was attaching the tiles, and marking them for cuts, while my father did the cutting.\n\nSeveral more annoying cuts came up, including underneath the upper cabinets because the walls came down further than the back, and around the windowsill where we decided to try cutting out part of the sill to slide the tile behind on one side, and deciding to try cutting a rounded edge around the sill on the other side (cutting a notch from the sill provided a cleaner look). Unfortunately, all of the tiles underneath our cabinets and windowsill also had to be cut in half the long way.\n\nWe finished the wall, got some pizza for lunch, and then tackled the shorter wall behind the stove. We should have started with that wall in the first place. It allowed for significantly more full tiles without any cuts, and the cuts were simple. It would’ve been a much better wall to start off on when trying to learn the tools and materials.\n\nAnd with that, the tiles were up!\n\nGrouting:\n\nThat night, I washed down the tiles several times and scraped away any excess adhesive in the gaps or on the face of any tiles. I wasn’t sure if we would have a chance to do the grouting the next day or not, and didn’t want to let the excess adhesive set up too much before getting around to grouting.\n\nThe grouting didn’t happen the next day, so the day after that we got to it; this time without my father, it was just me and my partner.\n\nFrom watching videos and reading online, I was very worried about using the Mapei Ultracolor Plus grout, since I’d heard it sets up so quickly. I’d read that the Mapei Keracolor U was a better grout to work with as a first-time tiler – I looked around at a bunch of the hardware stores, and nobody carried the Keracolor line so I was just going to have to make do with the fast-setting Ultracolor.\n\nI mixed up a half bag at a time since I was told to only do one wall at a time due to the speed that it could set up. We started with the short wall this time since I realized it would be easier to learn on. I applied the grout, while my partner sponged off the excess.\n\nHonestly, I think the warnings I’d read about this grout were overblown. We didn’t end up waiting a full 15-30 minutes like the package said because of those warnings, but I was easily able to apply all the grout to the first wall, then help my partner to clean it all off with a second sponge. By the time we cleaned up the first wall, I probably could’ve still done the long wall based on the consistency of the grout. Since I’d only done half of the bag though, I wasn’t sure if there was enough left in the bucket and I wanted to make sure the colour perfectly matched if the pigment wasn’t distributed evenly in the bag. I scraped out the remainder of the first batch of grout and put it in a plastic bag as an emergency backup, and then mixed the other half of the bag. We applied this to the long wall, which proved to be more difficult as expected. With all the small spaces, the grout float and sponge were both too large to move around everything. It would’ve been nice to have a smaller float and sponge for these spots.\n\nWith that, the grouting was basically done! I’d come back a couple of times to wipe off any excess haze, but that was it! Much easier than the negative reviews made that grout sound like it would be.\n\nTo be fair though, I didn’t turn the heat on so it was probably only 17 degrees C (62 F) inside while we worked, which could have slowed down the curing process.\n\nAlso, a tip… Make sure you don’t lean onto the stove knobs, turning a burner on. It’s especially bad if you’ve got garbage bags laid over top, and a bucket of water also on it. Fortunately, we realized early enough that the only damage caused was the garbage bag being fused to our water bucket.\n\n\nCaulking:\n\nNext up was caulking. I hated this. Easily my least favorite part of the project.\n\nI thought it would be like doing the corners of a tub or shower, and I’d just lay down a bead, wet my finger, and run it along getting a perfect curve. But nooo, try doing that and it smears all over your countertop and tile and since it’s a contrasting colour, you see every imperfection!\n\nSo I tried doing the tape trick. Piece of tape along the wall, and piece along the countertop, then run your finger across, and pull up the tape. I’ve got to admit, this did work well! But was best where you have long straight lines. On the many awkward corners I had in small places, the tape trick didn’t really work. I’m not happy with how some of them turned out, but they’re doing to have to do for now.\n\n\nFinal thoughts:\n\nOverall, we’re very happy with this project! It makes a huge difference to the look and feel of our kitchen, and was quite affordable, especially for the difference that it makes!\n\nTiling isn’t that difficult if you get the tools for it, and I would recommend taking on a similar project yourself! Neither my partner nor I have much DIY experience, and we’re still happy with the result, even knowing about all the imperfections.\n\n\nFeel free to ask any questions about the project, or give some tips and tricks to make it look better next time (if there ever is a next time). I'll be on and off throughout the day, and will try to respond as I can.", "link": "https://www.reddit.com/r/DIY/comments/nkt4m4/our_victoria_day_weekend_backsplash_project/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "our victoria day weekend backsplash project /!/ full album: https://imgur.com/a/slb3gkn\n\nfor the may 24th weekend holiday (victoria day) here in canada, my partner and i decided that we should try to install a backsplash in our kitchen. we like the look of a tile backsplash, and the cost of lumber has put some other projects (like a fence) on hold for now.\n\nthis project turned out to be quite affordable, even with having to buy several tools.\n\nthe tools and materials we had to get were (prices in canadian dollars, and after 15% sales tax):\n\n-17.5 sq ft of tile. we bought 3” x 12” white tiles with a slight ‘hammered’ look to them. we thought this was a good balance of classic but with some texture. we purchased 30 sq foot, which turned out to be way too much, and will be returning the extra. not sure the brand, purchased from the paint shop. $100\n\n-1 gal type 1 mapei tile adhesive from the paint shop. $32\n\n-schluter strip. we got the jolly, in bright white. also purchased from the paint shop, $6\n\n-10lbs bag of mapei ultracolor plus fa grout in pearl grey. purchased from the paint shop, for $32\n\n-tube of matching mapei pearl grey caulking. purchased from the paint shop for $24\n\n-tile spacers. i got 2 bags of 100 with 1/8” spacing. don’t recall the brand and lost the receipt, but purchased from the paint shop for roughly $5\n\n-tile cutter. borrowed from my father, so fortunately no cost.\n\n-tile saw. powerfist brand that i found on facebook marketplace. previous owner used it for two projects and had no use for it anymore. also came with two new blades. snagged this deal for $30!\n\n-grout float. bought a medium firmness grout float from kent for $14\n\n-grout sponge bought from kent for $2\n\n-grout mixer, bought from kent for $11\n\n-5 gal bucket. could’ve done with a smaller 2 gallon one. also would recommend having three instead of 1. bought from kent for $5\n\n-assorted other items like garbage bags, painters’ tape, and various other tools that i already had.\n\n-tile nippers from home depot for $21\n\n-1/4” square notch trowel from home depot. i’d recommend a smaller notch for this size tile on a backsplash, which i’ll explain later. $6\n\ntotal materials cost: $199\n\ntotal tools cost: $89\n\ntotal cost: $288\n\n\ntiling:\n\nfirst steps were to clear our countertops of everything, wipe down our walls and counter, and then lay some garbage bags and tape them to the countertop as a drop sheet.\n\nmy father came over to help me with tiling, since he at least had some limited experience working with tile before, even if it wasn’t for a backsplash.\n\nright off the bat, i wasn’t sure where i should start. i knew i should start from the outside of the counter and work in, and we decided to start on the long wall first, but i wasn’t sure whether to start tile at the edge of the counter or upper cabinet. after a quick google search, i found that you should start your tile at the edge of the upper cabinets, which fortunately meant no miter was needed to add a horizontal portion to the schluter strip.\n\nwe used a level and drew a line straight down from the upper cabinet to the countertop. this line would be the outside edge of our schluter strip. i then applied some tile adhesive and stuck on a piece of schluter strip that i’d trimmed down to size.\n\nfrom here, we could start applying more adhesive and begin with the tile! i started applying the adhesive and tile, while my father started trying to cut some in half using the tile cutter. it took a few tries, but we eventually got some to cut right down the middle. once we had that, we used it as a guide for the next few.\n\nit wasn’t long after beginning to apply tiles that we came across a spot where a complicated cut would be required. the tile needed to have a “u” shape cut for a 3-gang wall plate, plus another “u” shape cut for a single wall plate that held a phone jack. we knew this would be difficult since the bottom edge of the tile would end up being so thin, and we had literally no experience at all with the tile saw at this point. i quickly decided we would just cover up the box for the phone jack; it didn’t have an ethernet cable to use for internet, and who has a home phone anymore. even with this decision made, we still broke 4 tiles trying to get the single 3-gang box cut out… until we decided to use the first broken tile anyways since the break was relatively easy to hide under the wall plate and not very noticeable. if we’d had more experience with the saw, we probably could’ve gotten this to work.\n\nwith that one stubborn tile up, and my father now having some feel for how the tile saw worked, we were good to continue tiling! i was attaching the tiles, and marking them for cuts, while my father did the cutting.\n\nseveral more annoying cuts came up, including underneath the upper cabinets because the walls came down further than the back, and around the windowsill where we decided to try cutting out part of the sill to slide the tile behind on one side, and deciding to try cutting a rounded edge around the sill on the other side (cutting a notch from the sill provided a cleaner look). unfortunately, all of the tiles underneath our cabinets and windowsill also had to be cut in half the long way.\n\nwe finished the wall, got some pizza for lunch, and then tackled the shorter wall behind the stove. we should have started with that wall in the first place. it allowed for significantly more full tiles without any cuts, and the cuts were simple. it would’ve been a much better wall to start off on when trying to learn the tools and materials.\n\nand with that, the tiles were up!\n\ngrouting:\n\nthat night, i washed down the tiles several times and scraped away any excess adhesive in the gaps or on the face of any tiles. i wasn’t sure if we would have a chance to do the grouting the next day or not, and didn’t want to let the excess adhesive set up too much before getting around to grouting.\n\nthe grouting didn’t happen the next day, so the day after that we got to it; this time without my father, it was just me and my partner.\n\nfrom watching videos and reading online, i was very worried about using the mapei ultracolor plus grout, since i’d heard it sets up so quickly. i’d read that the mapei keracolor u was a better grout to work with as a first-time tiler – i looked around at a bunch of the hardware stores, and nobody carried the keracolor line so i was just going to have to make do with the fast-setting ultracolor.\n\ni mixed up a half bag at a time since i was told to only do one wall at a time due to the speed that it could set up. we started with the short wall this time since i realized it would be easier to learn on. i applied the grout, while my partner sponged off the excess.\n\nhonestly, i think the warnings i’d read about this grout were overblown. we didn’t end up waiting a full 15-30 minutes like the package said because of those warnings, but i was easily able to apply all the grout to the first wall, then help my partner to clean it all off with a second sponge. by the time we cleaned up the first wall, i probably could’ve still done the long wall based on the consistency of the grout. since i’d only done half of the bag though, i wasn’t sure if there was enough left in the bucket and i wanted to make sure the colour perfectly matched if the pigment wasn’t distributed evenly in the bag. i scraped out the remainder of the first batch of grout and put it in a plastic bag as an emergency backup, and then mixed the other half of the bag. we applied this to the long wall, which proved to be more difficult as expected. with all the small spaces, the grout float and sponge were both too large to move around everything. it would’ve been nice to have a smaller float and sponge for these spots.\n\nwith that, the grouting was basically done! i’d come back a couple of times to wipe off any excess haze, but that was it! much easier than the negative reviews made that grout sound like it would be.\n\nto be fair though, i didn’t turn the heat on so it was probably only 17 degrees c (62 f) inside while we worked, which could have slowed down the curing process.\n\nalso, a tip… make sure you don’t lean onto the stove knobs, turning a burner on. it’s especially bad if you’ve got garbage bags laid over top, and a bucket of water also on it. fortunately, we realized early enough that the only damage caused was the garbage bag being fused to our water bucket.\n\n\ncaulking:\n\nnext up was caulking. i hated this. easily my least favorite part of the project.\n\ni thought it would be like doing the corners of a tub or shower, and i’d just lay down a bead, wet my finger, and run it along getting a perfect curve. but nooo, try doing that and it smears all over your countertop and tile and since it’s a contrasting colour, you see every imperfection!\n\nso i tried doing the tape trick. piece of tape along the wall, and piece along the countertop, then run your finger across, and pull up the tape. i’ve got to admit, this did work well! but was best where you have long straight lines. on the many awkward corners i had in small places, the tape trick didn’t really work. i’m not happy with how some of them turned out, but they’re doing to have to do for now.\n\n\nfinal thoughts:\n\noverall, we’re very happy with this project! it makes a huge difference to the look and feel of our kitchen, and was quite affordable, especially for the difference that it makes!\n\ntiling isn’t that difficult if you get the tools for it, and i would recommend taking on a similar project yourself! neither my partner nor i have much -----> diy !!!  experience, and we’re still happy with the result, even knowing about all the imperfections.\n\n\nfeel free to ask any questions about the project, or give some tips and tricks to make it look better next time (if there ever is a next time). i'll be on and off throughout the day, and will try to respond as i can.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/nkt4m4/our_victoria_day_weekend_backsplash_project/", "identifyer": 352251, "year": "2021"}, {"Unnamed: 0": 352535, "autor": "AndreynaGG", "date": 1626188867000, "content": "How to get rid of oil based paint? /!/ I'm on a DIY project with my kitchen and I could use some advice. How do you remove oil based paint  of walls? I apparently have 3 layers to remove until I hit AAC. I don't want to use anything chemical. I tried using sharp tools to chip into it but it's so difficult and so tiring and I don't have such a big progress. \n\nAny advice is appreciated. Thank you!", "link": "https://www.reddit.com/r/DIY/comments/ojhj7m/how_to_get_rid_of_oil_based_paint/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to get rid of oil based paint? /!/ i'm on a -----> diy !!!  project with my kitchen and i could use some advice. how do you remove oil based paint  of walls? i apparently have 3 layers to remove until i hit aac. i don't want to use anything chemical. i tried using sharp tools to chip into it but it's so difficult and so tiring and i don't have such a big progress. \n\nany advice is appreciated. thank you!", "sortedWord": "None", "removed": null, "score": 1, "comments": 22, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ojhj7m/how_to_get_rid_of_oil_based_paint/", "identifyer": 352535, "year": "2021"}, {"Unnamed: 0": 353504, "autor": "TheForget", "date": 1627154143000, "content": "Small plastic/wooden box material /!/ &amp;#x200B;\n\n[Hi, this is my first contact with DIY so sorry if this is an obvious\\/googleable question. I want to make a small, lightweight, cylindrical box like the one on the picture \\(the measurements are in mm\\) but I don't know what materials I should look for, I want it to be fairly cheap and easy to build without many specialized tools. Is there something like that I can use for this project? Thank you all in advance](https://preview.redd.it/k4v7txr0m7d71.png?width=702&amp;format=png&amp;auto=webp&amp;s=9c44726f5c6fa1ede575d174980ec31770b4fb19)", "link": "https://www.reddit.com/r/DIY/comments/oqwamx/small_plasticwooden_box_material/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "small plastic/wooden box material /!/ &amp;#x200b;\n\n[hi, this is my first contact with -----> diy !!!  so sorry if this is an obvious\\/googleable question. i want to make a small, lightweight, cylindrical box like the one on the picture \\(the measurements are in mm\\) but i don't know what materials i should look for, i want it to be fairly cheap and easy to build without many specialized tools. is there something like that i can use for this project? thank you all in advance](https://preview.redd.it/k4v7txr0m7d71.png?width=702&amp;format=png&amp;auto=webp&amp;s=9c44726f5c6fa1ede575d174980ec31770b4fb19)", "sortedWord": "None", "removed": null, "score": 1, "comments": 3, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oqwamx/small_plasticwooden_box_material/", "identifyer": 353504, "year": "2021"}, {"Unnamed: 0": 353512, "autor": "Fraussss", "date": 1627148792000, "content": "Need help choosing a tool for baduk board diy /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/oquoq4/need_help_choosing_a_tool_for_baduk_board_diy/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "need help choosing a tool for baduk board -----> diy !!!  /!/ [removed]", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/oquoq4/need_help_choosing_a_tool_for_baduk_board_diy/", "identifyer": 353512, "year": "2021"}, {"Unnamed: 0": 353725, "autor": "deepinterwebz", "date": 1627408699000, "content": "I'm brand new to ANYTHING requiring carpentry and power tools. Could I get some ideas for beginner projects to help one dip their toe into the DIY arena. /!/ As post says, I have no carpentry experience at all, but I'd love to learn. I've been collecting all cordless power tools I can via the used market of Craigslist, Ebay, etc. A lot of Ryobi and some Dewalt/ Milwaukee. \n\nI have no woodworking experience or know how. I am very willing to learn via web/ YouTube. Would love some ideas on easy woodworking home projects I could do to help me get accustomed to using these tools, measuring, bevels, miters, etc. I figure with this group there is bound to be some good ideas.\n\nDown the road I'd love to build a nice shed, patios, kitchen floor etc, but I know that's way out of my league currently. Ty in advance!", "link": "https://www.reddit.com/r/DIY/comments/osrtid/im_brand_new_to_anything_requiring_carpentry_and/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm brand new to anything requiring carpentry and power tools. could i get some ideas for beginner projects to help one dip their toe into the -----> diy !!!  arena. /!/ as post says, i have no carpentry experience at all, but i'd love to learn. i've been collecting all cordless power tools i can via the used market of craigslist, ebay, etc. a lot of ryobi and some dewalt/ milwaukee. \n\ni have no woodworking experience or know how. i am very willing to learn via web/ youtube. would love some ideas on easy woodworking home projects i could do to help me get accustomed to using these tools, measuring, bevels, miters, etc. i figure with this group there is bound to be some good ideas.\n\ndown the road i'd love to build a nice shed, patios, kitchen floor etc, but i know that's way out of my league currently. ty in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/osrtid/im_brand_new_to_anything_requiring_carpentry_and/", "identifyer": 353725, "year": "2021"}, {"Unnamed: 0": 354606, "autor": "_Tennessippi_", "date": 1628189084000, "content": "Wooden blind installation /!/ Novice new homeowner here. We measured and ordered 2 in. Veneta corded blinds from Home Depot online (via Blinds.com) for six windows around our house and they just arrived. I'm not handy at all but am wondering if I can DIY this installation or should hire a handyman. I have a good drill, ladder and every tool I'd probably need.\n\nAnd if I do hire someone (handy dot com, etc.) what would I be looking at $$ for service and labor? I'd just rather not fuck it up and make it worse.", "link": "https://www.reddit.com/r/DIY/comments/oyow65/wooden_blind_installation/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "wooden blind installation /!/ novice new homeowner here. we measured and ordered 2 in. veneta corded blinds from home depot online (via blinds.com) for six windows around our house and they just arrived. i'm not handy at all but am wondering if i can -----> diy !!!  this installation or should hire a handyman. i have a good drill, ladder and every tool i'd probably need.\n\nand if i do hire someone (handy dot com, etc.) what would i be looking at $$ for service and labor? i'd just rather not fuck it up and make it worse.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oyow65/wooden_blind_installation/", "identifyer": 354606, "year": "2021"}, {"Unnamed: 0": 354632, "autor": "wssviper", "date": 1628175176000, "content": "Do I need an orbital sander /!/ Hi guys,\n\nI am totally new to DIY. I would like to make this:  [DIY Simple Side Table - Evan &amp; Katelyn | Home DIY | Tutorials (evanandkatelyn.com)](http://evanandkatelyn.com/2014/10/diy-simple-side-table/?fbclid=IwAR0xE2F7UWUeMl-B86cw7Ja5m7L4Fug9JzkXYOIQ99bsg7AAuUOov4ZUFBs) .\n\nI want to start with minimal amount of tools to make sure I actually enjoy the hobby before spending too much money. I currently have:\n\n1. Cordless Drill\n2. Kreg Jig.\n3. One step wood stain and varnish.\n4. Wood Glue.\n5. Screws.\n6. rags\n\nI can get home depot to cut the wood to size for me. Other than that, I think I would need an orbital sander. Can I get the sanding done by hand with just sand paper, or is a random orbital a must for this project?\n\n&amp;#x200B;\n\nThank you guys and nice to be here.", "link": "https://www.reddit.com/r/DIY/comments/oyjzvj/do_i_need_an_orbital_sander/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "do i need an orbital sander /!/ hi guys,\n\ni am totally new to -----> diy !!! . i would like to make this:  [diy simple side table - evan &amp; katelyn | home diy | tutorials (evanandkatelyn.com)](http://evanandkatelyn.com/2014/10/diy-simple-side-table/?fbclid=iwar0xe2f7uwueml-b86cw7ja5m7l4fug9jzkxyoiq99bsg7aauuoov4zufbs) .\n\ni want to start with minimal amount of tools to make sure i actually enjoy the hobby before spending too much money. i currently have:\n\n1. cordless drill\n2. kreg jig.\n3. one step wood stain and varnish.\n4. wood glue.\n5. screws.\n6. rags\n\ni can get home depot to cut the wood to size for me. other than that, i think i would need an orbital sander. can i get the sanding done by hand with just sand paper, or is a random orbital a must for this project?\n\n&amp;#x200b;\n\nthank you guys and nice to be here.", "sortedWord": "None", "removed": null, "score": 1, "comments": 18, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/oyjzvj/do_i_need_an_orbital_sander/", "identifyer": 354632, "year": "2021"}, {"Unnamed: 0": 354924, "autor": "Sethisto", "date": 1628525270000, "content": "This trap (or pipe before it) is constantly clogged. I want to replace it with an EZ trap. /!/ I'm pretty new to DIY so I want to get this absolutely right. I have an AC unit that is constantly clogged, and after clearing everything past the trap multiple times with no luck in unclogging it, I'm pretty sure it's the trap or something before the trap causing the issue. \n\nI want to replace it with an EZ trap: \n\nhttps://rectorseal.com/ez-trap-group/\n\nSo at the very least I can see inside and hopefully have a better trap setup in general. This is what I have to work with: \n\nhttps://imgur.com/a/BgG3w17\n\nSorry about the blurry pictures. \n\nFrom the videos I've watched, I can either use a heat gun to soften the PVC and disconnect the current trap or cut it off,  then swap in the EZ trap, cut where needed, apply primer then glue it in place. It seems like a really simple process but I've never cut PVC before so I don't know what issues I might run into. \n\nWhat tools should I have on hand and spare parts in case something goes horribly wrong?", "link": "https://www.reddit.com/r/DIY/comments/p14hpo/this_trap_or_pipe_before_it_is_constantly_clogged/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "this trap (or pipe before it) is constantly clogged. i want to replace it with an ez trap. /!/ i'm pretty new to -----> diy !!!  so i want to get this absolutely right. i have an ac unit that is constantly clogged, and after clearing everything past the trap multiple times with no luck in unclogging it, i'm pretty sure it's the trap or something before the trap causing the issue. \n\ni want to replace it with an ez trap: \n\nhttps://rectorseal.com/ez-trap-group/\n\nso at the very least i can see inside and hopefully have a better trap setup in general. this is what i have to work with: \n\nhttps://imgur.com/a/bgg3w17\n\nsorry about the blurry pictures. \n\nfrom the videos i've watched, i can either use a heat gun to soften the pvc and disconnect the current trap or cut it off,  then swap in the ez trap, cut where needed, apply primer then glue it in place. it seems like a really simple process but i've never cut pvc before so i don't know what issues i might run into. \n\nwhat tools should i have on hand and spare parts in case something goes horribly wrong?", "sortedWord": "None", "removed": null, "score": 1, "comments": 10, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/p14hpo/this_trap_or_pipe_before_it_is_constantly_clogged/", "identifyer": 354924, "year": "2021"}, {"Unnamed: 0": 354955, "autor": "wssviper", "date": 1628347268000, "content": "Am I able to do woodworking DIY without a garage? /!/ Hi guys,\n\nhttps://www.costcobusinesscentre.ca/Elite-Fold-in-half-Table%2c-6-ft.product.100294797.html\n\nI'm trying to get into DIY woodworking, and have basic set of tools like a circular saw bad cordless drill. My biggest concern is can this be a hobby that can be enjoyed without a garage? More specifically if I use a Costco 6ft folding table linked above, would it be doable to make cuts for wood with it or do I need something more sturdy designed for wood working? The folding table I can put in the shed. But I won't have space for a table saw or anything like that. Basically my question is can I build cool stuff with just a circular saw, drill and a 6ft picnic table?\n\nThanks all.", "link": "https://www.reddit.com/r/DIY/comments/ozuh8t/am_i_able_to_do_woodworking_diy_without_a_garage/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "am i able to do woodworking -----> diy !!!  without a garage? /!/ hi guys,\n\nhttps://www.costcobusinesscentre.ca/elite-fold-in-half-table%2c-6-ft.product.100294797.html\n\ni'm trying to get into diy woodworking, and have basic set of tools like a circular saw bad cordless drill. my biggest concern is can this be a hobby that can be enjoyed without a garage? more specifically if i use a costco 6ft folding table linked above, would it be doable to make cuts for wood with it or do i need something more sturdy designed for wood working? the folding table i can put in the shed. but i won't have space for a table saw or anything like that. basically my question is can i build cool stuff with just a circular saw, drill and a 6ft picnic table?\n\nthanks all.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ozuh8t/am_i_able_to_do_woodworking_diy_without_a_garage/", "identifyer": 354955, "year": "2021"}, {"Unnamed: 0": 355027, "autor": "arnach", "date": 1628282622000, "content": "What 3d drawing/rendering tool do you use? /!/ I enjoy all of your amazing, ambitious, and inspiring projects here on r/DIY.\n\nOccasionally one of these projects will have a nicely drawn and/or rendered \"before\" concept drawing.\n\nWhat software program are you using?\n\nFree or paid?\n\nThanks in advance!", "link": "https://www.reddit.com/r/DIY/comments/ozf58x/what_3d_drawingrendering_tool_do_you_use/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "what 3d drawing/rendering tool do you use? /!/ i enjoy all of your amazing, ambitious, and inspiring projects here on r/-----> diy !!! .\n\noccasionally one of these projects will have a nicely drawn and/or rendered \"before\" concept drawing.\n\nwhat software program are you using?\n\nfree or paid?\n\nthanks in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/ozf58x/what_3d_drawingrendering_tool_do_you_use/", "identifyer": 355027, "year": "2021"}, {"Unnamed: 0": 355071, "autor": "mancavemaven", "date": 1628047650000, "content": "Bar Basement Improvement with Heineken Mini Keg /!/ &lt;iframe width=\"560\" height=\"315\" src=\"[https://www.youtube.com/embed/w2KAhlZL28Y](https://www.youtube.com/embed/w2KAhlZL28Y)\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen&gt;&lt;/iframe&gt;\n\n  \n\nThis is one of several attempts but hopefully, it's my first post to DIY.\n\n**Time Required:**\n\n1 hour\n\n   \n \n\n**Materials Required:**\n\n7/16 ID clear tubing (Length dependent on distance to and from Tap and source)\n\nTap (I got mine from Amazon)\n\nCopper pipe ½ dia straight, tees and 90 deg elbows\n\nHose clamp\n\nScrew\n\nHeineken Mini Keg\n\nCooler\n\nIce\n\nDuct Tape\n\n   \n \n\n**Tools Required:**\n\nDrill\n\nSolder\n\nSoldering torch\n\n7/16 or ½ drill bit\n\nCrescent Wrench\n\n   \n \n\n**Steps**\n\n&amp;#x200B;\n\n1. Find a suitable location where you want the Tap to be.\n2. Determine the route clear tubing will need to go from the source to the Tap.\n3. Drill, if necessary, the location that the clear tubing will need to exit from.  \nNOTE: ½ inch PVC can be used in Lieu of copper and will not require the need for solder.\n4. Using the copper pipe assemble a mount for the Tap.\n   1. Using the Tee Fitting slide the Tap into the straight       portion\n   2. The lower portion of the tee fitting will be used to connect to a wall or able top (However you have determined your Tap placement and clear tubing route to be).\n   3. A 90-degree elbow will be used to cover the clear tube connection to the Tap.\n   4. Once the copper pipe arrangement has been figured out,       solder the pipe together.\n5. Install the mount in place\n6. Feed the Tap handle into your mount and secure.\n7. Route the clear tubing and connect to the Tap and mount.\n8. Place mini Keg in cooler and fill with ice.\n9. Attach a clear tube to the Mini keg\n10. Test Tap handle to purge air from the line.\n11. Enjoy!", "link": "https://www.reddit.com/r/DIY/comments/oxjyib/bar_basement_improvement_with_heineken_mini_keg/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "bar basement improvement with heineken mini keg /!/ &lt;iframe width=\"560\" height=\"315\" src=\"[https://www.youtube.com/embed/w2kahlzl28y](https://www.youtube.com/embed/w2kahlzl28y)\" title=\"youtube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen&gt;&lt;/iframe&gt;\n\n  \n\nthis is one of several attempts but hopefully, it's my first post to -----> diy !!! .\n\n**time required:**\n\n1 hour\n\n   \n \n\n**materials required:**\n\n7/16 id clear tubing (length dependent on distance to and from tap and source)\n\ntap (i got mine from amazon)\n\ncopper pipe ½ dia straight, tees and 90 deg elbows\n\nhose clamp\n\nscrew\n\nheineken mini keg\n\ncooler\n\nice\n\nduct tape\n\n   \n \n\n**tools required:**\n\ndrill\n\nsolder\n\nsoldering torch\n\n7/16 or ½ drill bit\n\ncrescent wrench\n\n   \n \n\n**steps**\n\n&amp;#x200b;\n\n1. find a suitable location where you want the tap to be.\n2. determine the route clear tubing will need to go from the source to the tap.\n3. drill, if necessary, the location that the clear tubing will need to exit from.  \nnote: ½ inch pvc can be used in lieu of copper and will not require the need for solder.\n4. using the copper pipe assemble a mount for the tap.\n   1. using the tee fitting slide the tap into the straight       portion\n   2. the lower portion of the tee fitting will be used to connect to a wall or able top (however you have determined your tap placement and clear tubing route to be).\n   3. a 90-degree elbow will be used to cover the clear tube connection to the tap.\n   4. once the copper pipe arrangement has been figured out,       solder the pipe together.\n5. install the mount in place\n6. feed the tap handle into your mount and secure.\n7. route the clear tubing and connect to the tap and mount.\n8. place mini keg in cooler and fill with ice.\n9. attach a clear tube to the mini keg\n10. test tap handle to purge air from the line.\n11. enjoy!", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oxjyib/bar_basement_improvement_with_heineken_mini_keg/", "identifyer": 355071, "year": "2021"}, {"Unnamed: 0": 355073, "autor": "mancavemaven", "date": 1628046650000, "content": "Heineken Mini Keg Tap Install on Basement Bar /!/ This is my one of several attempts but hopefully its my first post to DIY.\n\n  \n\n**Time Required:**\n\n1 hour\n\n&amp;#x200B;\n\n**Materials Required:**\n\n7/16 ID clear tubing (Length dependent on distance to and from Tap and source)\n\nTap (I got mine from Amazon)\n\nCopper pipe ½ dia straight, tees and 90 deg elbows\n\nHeineken Mini Keg\n\nCooler\n\nIce\n\nDuct Tape\n\n&amp;#x200B;\n\n**Tools Required:**\n\nDrill\n\nSolder\n\nSoldering torch\n\n7/16 or ½ drill bit\n\nCrescent Wrench\n\n&amp;#x200B;\n\n**Steps**\n\n1. Find a suitable location where you want the Tap to be.\n2. Determine the route clear tubing will need to go from the source to the Tap.\n3. Drill, if necessary, the location that the clear tubing will need to exit from.  \nNOTE: ½ inch PVC can be used in Lieu of copper and will not require the need for solder.\n4. Using the copper pipe assemble a mount for the Tap.\n   1. Using the Tee Fitting slide the Tap into the straight portion\n   2. The lower portion of the tee fitting will be used to connect to a wall or able top (However you have determined your Tap placement and clear tubing route to be).\n   3. A 90 degree elbow will be used to cover the clear tube connection to the Tap.\n   4. Once the copper pipe arrangement has been figured out, solder the pipe together.\n5. Install the mount in place\n6. Feed the Tap handle into your mount and secure.\n7. Route the clear tubing and connect to the Tap and mount.\n8. Place mini Keg in cooler and fill with ice.\n9. Attach clear tube to Mini keg\n10. Test Tap handle to purge air from line.\n11. Enjoy!", "link": "https://www.reddit.com/r/DIY/comments/oxjoe8/heineken_mini_keg_tap_install_on_basement_bar/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "heineken mini keg tap install on basement bar /!/ this is my one of several attempts but hopefully its my first post to -----> diy !!! .\n\n  \n\n**time required:**\n\n1 hour\n\n&amp;#x200b;\n\n**materials required:**\n\n7/16 id clear tubing (length dependent on distance to and from tap and source)\n\ntap (i got mine from amazon)\n\ncopper pipe ½ dia straight, tees and 90 deg elbows\n\nheineken mini keg\n\ncooler\n\nice\n\nduct tape\n\n&amp;#x200b;\n\n**tools required:**\n\ndrill\n\nsolder\n\nsoldering torch\n\n7/16 or ½ drill bit\n\ncrescent wrench\n\n&amp;#x200b;\n\n**steps**\n\n1. find a suitable location where you want the tap to be.\n2. determine the route clear tubing will need to go from the source to the tap.\n3. drill, if necessary, the location that the clear tubing will need to exit from.  \nnote: ½ inch pvc can be used in lieu of copper and will not require the need for solder.\n4. using the copper pipe assemble a mount for the tap.\n   1. using the tee fitting slide the tap into the straight portion\n   2. the lower portion of the tee fitting will be used to connect to a wall or able top (however you have determined your tap placement and clear tubing route to be).\n   3. a 90 degree elbow will be used to cover the clear tube connection to the tap.\n   4. once the copper pipe arrangement has been figured out, solder the pipe together.\n5. install the mount in place\n6. feed the tap handle into your mount and secure.\n7. route the clear tubing and connect to the tap and mount.\n8. place mini keg in cooler and fill with ice.\n9. attach clear tube to mini keg\n10. test tap handle to purge air from line.\n11. enjoy!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oxjoe8/heineken_mini_keg_tap_install_on_basement_bar/", "identifyer": 355073, "year": "2021"}, {"Unnamed: 0": 355501, "autor": "luzhinlives", "date": 1626919287000, "content": "DIY Swing Set Renovation /!/ &lt;blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"a/xM1ZSqk\"  &gt;&lt;a href=\"[//imgur.com/a/xM1ZSqk](//imgur.com/a/xM1ZSqk)\"&gt;DIY Swingset Renovation&lt;/a&gt;&lt;/blockquote&gt;&lt;script async src=\"[//s.imgur.com/min/embed.js](//s.imgur.com/min/embed.js)\" charset=\"utf-8\"&gt;&lt;/script&gt;\n\nI have no experience doing anything like this but was very happy with how it turned out. \n\nSeller of new house specified that they didn't want to remove swing set before closing so we figured we would keep it and try to reno it as best as possible. \n\nHappy to answer any questions on the project. I didn't own a power tool before this project and bought the Ryobi 5 tool set to build it.", "link": "https://www.reddit.com/r/DIY/comments/op4bhq/diy_swing_set_renovation/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  swing set renovation /!/ &lt;blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"a/xm1zsqk\"  &gt;&lt;a href=\"[//imgur.com/a/xm1zsqk](//imgur.com/a/xm1zsqk)\"&gt;diy swingset renovation&lt;/a&gt;&lt;/blockquote&gt;&lt;script async src=\"[//s.imgur.com/min/embed.js](//s.imgur.com/min/embed.js)\" charset=\"utf-8\"&gt;&lt;/script&gt;\n\ni have no experience doing anything like this but was very happy with how it turned out. \n\nseller of new house specified that they didn't want to remove swing set before closing so we figured we would keep it and try to reno it as best as possible. \n\nhappy to answer any questions on the project. i didn't own a power tool before this project and bought the ryobi 5 tool set to build it.", "sortedWord": "None", "removed": null, "score": 1, "comments": 32, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/op4bhq/diy_swing_set_renovation/", "identifyer": 355501, "year": "2021"}, {"Unnamed: 0": 355588, "autor": "Cheex__", "date": 1626819625000, "content": "Just got my first power tools! /!/ So happy to say today I bought my first power tools, I'm a teenager who really wants to get into DIY and basically become very handy. I got my impact driver/combidrill twin pack and a circular saw. Does anyone have any little advice to get me started on my new journey?", "link": "https://www.reddit.com/r/DIY/comments/oock6q/just_got_my_first_power_tools/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "just got my first power tools! /!/ so happy to say today i bought my first power tools, i'm a teenager who really wants to get into -----> diy !!!  and basically become very handy. i got my impact driver/combidrill twin pack and a circular saw. does anyone have any little advice to get me started on my new journey?", "sortedWord": "None", "removed": null, "score": 1, "comments": 14, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oock6q/just_got_my_first_power_tools/", "identifyer": 355588, "year": "2021"}, {"Unnamed: 0": 355628, "autor": "Whole-Wedding", "date": 1626806576000, "content": "DIY addition, the basement /!/ I want to do a small addition on my house 10*16 feet\n\nI'm at a loss on how to get the basement done.  Once I can get above ground I know what needs to be done.\n\nCan anyone share their design for a basement foundation? Like how deep is the footers, what was used for gravel ect.\n\nWhere is the line between what the excavator crew does and the concrete crew?\n\nThanks for any help.", "link": "https://www.reddit.com/r/DIY/comments/oo89bc/diy_addition_the_basement/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  addition, the basement /!/ i want to do a small addition on my house 10*16 feet\n\ni'm at a loss on how to get the basement done.  once i can get above ground i know what needs to be done.\n\ncan anyone share their design for a basement foundation? like how deep is the footers, what was used for gravel ect.\n\nwhere is the line between what the excavator crew does and the concrete crew?\n\nthanks for any help.", "sortedWord": "None", "removed": null, "score": 1, "comments": 2, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/oo89bc/diy_addition_the_basement/", "identifyer": 355628, "year": "2021"}, {"Unnamed: 0": 355682, "autor": "kapitanfind-us", "date": 1626665457000, "content": "Door jamb, strike plate and newbie /!/ Hi DIY reddit, first post here, wondering how I would cut out neately the circled part of my door jamb.\n\nIt is in very bad shape and I would like to cover the holes and replace the two single plates with a double one.\n\nFWIW I own an oscillating tool, bought in a bundle. Not sure if helpful.\n\nThanks a lot in advance!\n\nhttps://imgur.com/hWegNKv", "link": "https://www.reddit.com/r/DIY/comments/on5xyo/door_jamb_strike_plate_and_newbie/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "door jamb, strike plate and newbie /!/ hi -----> diy !!!  reddit, first post here, wondering how i would cut out neately the circled part of my door jamb.\n\nit is in very bad shape and i would like to cover the holes and replace the two single plates with a double one.\n\nfwiw i own an oscillating tool, bought in a bundle. not sure if helpful.\n\nthanks a lot in advance!\n\nhttps://imgur.com/hwegnkv", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/on5xyo/door_jamb_strike_plate_and_newbie/", "identifyer": 355682, "year": "2021"}, {"Unnamed: 0": 355683, "autor": "kapitanfind-us", "date": 1626665372000, "content": "Door jamb, strike plates and newbie /!/ Hi DIY reddit, first post here, wondering how I would cut out neately the circled part of my door jamb.\n\nIt is in very bad shape and I would like to cover the holes and replace the two single plates with a double one.\n\nFWIW I own an oscillating tool, bought in a bundle. Not sure if helpful.\n\nThanks a lot in advance!", "link": "https://www.reddit.com/r/DIY/comments/on5x5j/door_jamb_strike_plates_and_newbie/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "door jamb, strike plates and newbie /!/ hi -----> diy !!!  reddit, first post here, wondering how i would cut out neately the circled part of my door jamb.\n\nit is in very bad shape and i would like to cover the holes and replace the two single plates with a double one.\n\nfwiw i own an oscillating tool, bought in a bundle. not sure if helpful.\n\nthanks a lot in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/on5x5j/door_jamb_strike_plates_and_newbie/", "identifyer": 355683, "year": "2021"}, {"Unnamed: 0": 356023, "autor": "iwannalynch", "date": 1618789195000, "content": "How to replace drawer slides when the sides of the drawer are pretty much flush to the sides of the chest? /!/ Hi all, I bought this old chest of drawers second hand, and the drawer slides have been constantly getting stuck and tilting, etc. As it turns out, the drawer slides had [plastic slide components with ball bearings](https://imgur.com/KeHVVNk), and 3/5 of my busted drawers were completely missing the slide components and were literally just sliding metal against metal on the rails.\n\nHaving not done enough research, I bought [simple drawer slides](https://images-na.ssl-images-amazon.com/images/I/51-6uKnscHL._AC_SY355_.jpg), only to realize that there was literally no space between the sides of the drawers and the sides of the cabinet, like 1/16 of an inch, and the rails of the old slides were [installed in recessed 1/4 inch deep grooves on the sides of the drawers](https://imgur.com/I9sn8Qe). \n\nI can't keep using the old rails because I can't even open the damned drawers anymore. Are there any slides that can actually fit into that groove, or is there an alternative placement, or is this project doomed from the beginning? \n\nAs you can see, I don't have a lot of DIY experience or tools besides a powertool, and the cabinet itself is just IKEA quality, so I don't want to spend a ton of money on it either.\n\nThanks so much for your help, and I can provide further photos if needed.", "link": "https://www.reddit.com/r/DIY/comments/mtod3k/how_to_replace_drawer_slides_when_the_sides_of/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "how to replace drawer slides when the sides of the drawer are pretty much flush to the sides of the chest? /!/ hi all, i bought this old chest of drawers second hand, and the drawer slides have been constantly getting stuck and tilting, etc. as it turns out, the drawer slides had [plastic slide components with ball bearings](https://imgur.com/kehvvnk), and 3/5 of my busted drawers were completely missing the slide components and were literally just sliding metal against metal on the rails.\n\nhaving not done enough research, i bought [simple drawer slides](https://images-na.ssl-images-amazon.com/images/i/51-6uknschl._ac_sy355_.jpg), only to realize that there was literally no space between the sides of the drawers and the sides of the cabinet, like 1/16 of an inch, and the rails of the old slides were [installed in recessed 1/4 inch deep grooves on the sides of the drawers](https://imgur.com/i9sn8qe). \n\ni can't keep using the old rails because i can't even open the damned drawers anymore. are there any slides that can actually fit into that groove, or is there an alternative placement, or is this project doomed from the beginning? \n\nas you can see, i don't have a lot of -----> diy !!!  experience or tools besides a powertool, and the cabinet itself is just ikea quality, so i don't want to spend a ton of money on it either.\n\nthanks so much for your help, and i can provide further photos if needed.", "sortedWord": "None", "removed": null, "score": 1, "comments": 9, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/mtod3k/how_to_replace_drawer_slides_when_the_sides_of/", "identifyer": 356023, "year": "2021"}, {"Unnamed: 0": 356102, "autor": "hylianrockstar", "date": 1624210158000, "content": "DIY Meat Roasting Spit /!/ It is a family tradition to cook a roast over the campfire but the spit we had was too short and someone would have to hold it to roast different sides of the roast. \n\nSo I built a longer spit and added wrench heads so you don’t have to hold the handle up. I added washers to make the set screw easier to twist and I added a middle, two-sided, skewer so you can do two roasts at once. \n\nIt was a fun project!\n\nNext I will be replacing the handle of a slicing knife so it is longer so you can slice off the meat without burning your hand. Just waiting on the knife and the walnut blanks to be delivered.[https://imgur.com/a/Ae6kAIF](https://imgur.com/a/Ae6kAIF)", "link": "https://www.reddit.com/r/DIY/comments/o4alql/diy_meat_roasting_spit/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  meat roasting spit /!/ it is a family tradition to cook a roast over the campfire but the spit we had was too short and someone would have to hold it to roast different sides of the roast. \n\nso i built a longer spit and added wrench heads so you don’t have to hold the handle up. i added washers to make the set screw easier to twist and i added a middle, two-sided, skewer so you can do two roasts at once. \n\nit was a fun project!\n\nnext i will be replacing the handle of a slicing knife so it is longer so you can slice off the meat without burning your hand. just waiting on the knife and the walnut blanks to be delivered.[https://imgur.com/a/ae6kaif](https://imgur.com/a/ae6kaif)", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/o4alql/diy_meat_roasting_spit/", "identifyer": 356102, "year": "2021"}, {"Unnamed: 0": 356154, "autor": "Marhaba-Status", "date": 1624329443000, "content": "DIY tractor machine motor || DIY tractor science project $5 dollar @Thet...", "link": "https://www.reddit.com/r/DIY/comments/o5c9bz/diy_tractor_machine_motor_diy_tractor_science/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  tractor machine motor || -----> diy !!!  tractor science project $5 dollar @thet...", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "rich:video", "medialink": "https://youtube.com/watch?v=WtgkUda6Prw&amp;feature=share", "identifyer": 356154, "year": "2021"}, {"Unnamed: 0": 356184, "autor": "chopsuwe", "date": 1624312445000, "content": "Spambot attacks and the reason you were banned. /!/ Over the last six months Reddit has seen a massive sustained attack from spambots. This is a site wide issue that is affecting us at r/DIY. Reddit's administrators have been aware of the problem for months and have failed to address it in any meaningful way, despite the pleas of moderators from all over Reddit. Moderators have not been provided with any tools to deal with this, in fact the Admins have made reporting harder and more time consuming. \n\nWe are unpaid volunteers and are now being expected to spend hours each day cleaning up the mess. As long as we keep taking up the slack, the administrators will continue to delay action. This is not something we can keep doing. \n\nWe have reached breaking point. \n\n**Any account suspected of spamming will now be instantly banned.**\n\nThere will be no warning. We will not check your post history first to see if you are human. We will not wait to see if there is a pattern of offending. And we will not be considering any ban appeals. \n\nSome of you will be caught up in this. This in not something we want, we simply do not have the time or resources to spend on this.\n\nIf you have been banned, feel free to make your feeling known to the Reddit admins, in particular u/redtaboo, u/sodypop and u/Chtorrr.\n\nFinally an apology to anyone caught up in this. This is not how we want to run the sub. And it is not how Reddit should be run.", "link": "https://www.reddit.com/r/DIY/comments/o56mm6/spambot_attacks_and_the_reason_you_were_banned/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "spambot attacks and the reason you were banned. /!/ over the last six months reddit has seen a massive sustained attack from spambots. this is a site wide issue that is affecting us at r/-----> diy !!! . reddit's administrators have been aware of the problem for months and have failed to address it in any meaningful way, despite the pleas of moderators from all over reddit. moderators have not been provided with any tools to deal with this, in fact the admins have made reporting harder and more time consuming. \n\nwe are unpaid volunteers and are now being expected to spend hours each day cleaning up the mess. as long as we keep taking up the slack, the administrators will continue to delay action. this is not something we can keep doing. \n\nwe have reached breaking point. \n\n**any account suspected of spamming will now be instantly banned.**\n\nthere will be no warning. we will not check your post history first to see if you are human. we will not wait to see if there is a pattern of offending. and we will not be considering any ban appeals. \n\nsome of you will be caught up in this. this in not something we want, we simply do not have the time or resources to spend on this.\n\nif you have been banned, feel free to make your feeling known to the reddit admins, in particular u/redtaboo, u/sodypop and u/chtorrr.\n\nfinally an apology to anyone caught up in this. this is not how we want to run the sub. and it is not how reddit should be run.", "sortedWord": "None", "removed": null, "score": 1, "comments": 213, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o56mm6/spambot_attacks_and_the_reason_you_were_banned/", "identifyer": 356184, "year": "2021"}, {"Unnamed: 0": 356236, "autor": "talldaveos", "date": 1624052417000, "content": "DIY 18v grinder-powered wheelbarrow? /!/ I'm wondering about (ab)using an old 18 volt tool (used, from eBay/gumtree) and some weldable steel bike parts to get my wheelbarrow a bit easier to roll when full of rubble etc.\n\nBesides just the whole vibe of the thing, which tool do youse reckon would be most suitable? \n\nI'm imagining whatever has the lowest speed at the highest torque - Grinder? SDS? mower??", "link": "https://www.reddit.com/r/DIY/comments/o30y6i/diy_18v_grinderpowered_wheelbarrow/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  18v grinder-powered wheelbarrow? /!/ i'm wondering about (ab)using an old 18 volt tool (used, from ebay/gumtree) and some weldable steel bike parts to get my wheelbarrow a bit easier to roll when full of rubble etc.\n\nbesides just the whole vibe of the thing, which tool do youse reckon would be most suitable? \n\ni'm imagining whatever has the lowest speed at the highest torque - grinder? sds? mower??", "sortedWord": "None", "removed": null, "score": 3, "comments": 15, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o30y6i/diy_18v_grinderpowered_wheelbarrow/", "identifyer": 356236, "year": "2021"}, {"Unnamed: 0": 356578, "autor": "KDkid", "date": 1633272506000, "content": "Tractor DIY Gravel Driveway", "link": "https://www.reddit.com/r/DIY/comments/q0j7sw/tractor_diy_gravel_driveway/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "tractor -----> diy !!!  gravel driveway", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 2, "media": "rich:video", "medialink": "https://youtu.be/iCVGNmiFL3Q", "identifyer": 356578, "year": "2021"}, {"Unnamed: 0": 357802, "autor": "Cookiecuttermaxy", "date": 1633415894000, "content": "Help thread: How do I overcome fear of failure/disaster in DIY projects? /!/ This whole year I had a whole shtick for DIY stuff, whether it be crafting things, tackling home improvement projects or doing some automotive DIY tasks. However, one persistent of state of mind I still always have behind my back is the imminient fear of fucking up, no matter how many tools for the job I buy or how much experience I keep gaining, there's always this annoying clingy state of mind about fucking things up and then almost giving up on certain projects. What's a good physiological exercise for this?", "link": "https://www.reddit.com/r/DIY/comments/q1p5l5/help_thread_how_do_i_overcome_fear_of/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "help thread: how do i overcome fear of failure/disaster in -----> diy !!!  projects? /!/ this whole year i had a whole shtick for diy stuff, whether it be crafting things, tackling home improvement projects or doing some automotive diy tasks. however, one persistent of state of mind i still always have behind my back is the imminient fear of fucking up, no matter how many tools for the job i buy or how much experience i keep gaining, there's always this annoying clingy state of mind about fucking things up and then almost giving up on certain projects. what's a good physiological exercise for this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 139, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/q1p5l5/help_thread_how_do_i_overcome_fear_of/", "identifyer": 357802, "year": "2021"}, {"Unnamed: 0": 357864, "autor": "Iammcgee", "date": 1623075376000, "content": "This subreddit has the dumbest fucking guidelines I've ever seen /!/ I posted a picture that specifically pointed out what I needed to upgrade a DIY project I had previously done. It was removed. Next I posted text that listed the material of the DIY project as well as my research to include what tools other, more skilled DIY'ers use to complete what I'm trying to do. I was just looking for advice but that post was removed too. I guess I really will do it all myself then", "link": "https://www.reddit.com/r/DIY/comments/nudlyg/this_subreddit_has_the_dumbest_fucking_guidelines/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "this subreddit has the dumbest fucking guidelines i've ever seen /!/ i posted a picture that specifically pointed out what i needed to upgrade a -----> diy !!!  project i had previously done. it was removed. next i posted text that listed the material of the diy project as well as my research to include what tools other, more skilled diy'ers use to complete what i'm trying to do. i was just looking for advice but that post was removed too. i guess i really will do it all myself then", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/nudlyg/this_subreddit_has_the_dumbest_fucking_guidelines/", "identifyer": 357864, "year": "2021"}, {"Unnamed: 0": 358210, "autor": "Kacey20126", "date": 1635386815000, "content": "Get into DIY firstly with a tool /!/ [removed]", "link": "https://www.reddit.com/r/DIY/comments/qhcf5v/get_into_diy_firstly_with_a_tool/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "get into -----> diy !!!  firstly with a tool /!/ [removed]", "sortedWord": "None", "removed": "automod_filtered", "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/qhcf5v/get_into_diy_firstly_with_a_tool/", "identifyer": 358210, "year": "2021"}, {"Unnamed: 0": 359384, "autor": "pweedith", "date": 1624502524000, "content": "Best DIY option for replacing water pipes (PEX or copper) /!/ I'm looking to start replacing some old copper piping, valves, joints, etc in my house that shows signs of corrosion/age. I can be very handy and pick up on tasks so I'm ready to teach myself the proper way to do whatever I choose to go with but considering each type of piping requires different tools and techniques I'd really like to choose one to focus on. \n\nFrom what I've seen the options are soldered copper pipes or PEX. Then with PEX there's expansion joints or crimping. I also know there are compression pieces that can be used for copper and a friend of mine borrowed a tool to do that for me from his job; it took almost no time at all but I know the tool is very expensive. \n\nI already know copper is going to be more expensive, is it worth that greater material cost? Overall, which method is the easiest for a DIYer to learn that will also be long lasting.", "link": "https://www.reddit.com/r/DIY/comments/o6rvmg/best_diy_option_for_replacing_water_pipes_pex_or/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "best -----> diy !!!  option for replacing water pipes (pex or copper) /!/ i'm looking to start replacing some old copper piping, valves, joints, etc in my house that shows signs of corrosion/age. i can be very handy and pick up on tasks so i'm ready to teach myself the proper way to do whatever i choose to go with but considering each type of piping requires different tools and techniques i'd really like to choose one to focus on. \n\nfrom what i've seen the options are soldered copper pipes or pex. then with pex there's expansion joints or crimping. i also know there are compression pieces that can be used for copper and a friend of mine borrowed a tool to do that for me from his job; it took almost no time at all but i know the tool is very expensive. \n\ni already know copper is going to be more expensive, is it worth that greater material cost? overall, which method is the easiest for a diyer to learn that will also be long lasting.", "sortedWord": "None", "removed": null, "score": 1, "comments": 31, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/o6rvmg/best_diy_option_for_replacing_water_pipes_pex_or/", "identifyer": 359384, "year": "2021"}, {"Unnamed: 0": 359634, "autor": "Independent-Ad419", "date": 1630111352000, "content": "I made a prototype Webapp. My aim for it is to help people learn more about DIY and give their inspirations life. I would highly appreciate it if you could spare a minute and please look at my site and give me your feedback and suggestions. /!/ [DIYOLO](https://app.pandasuite.com/rX9Mt2Bd)\n\nHi everyone,\n\nI made a prototype Webapp. Here is my thought process behind it.\n\nWhen someone wants to begin building anything as a DIY project they often either have their parents or grandparents to guide them... Or if you're like me then you would probably end up looking at millions of DIY projects on YouTube, googling multiple articles related to what each tool is and how they work. Not to mention buying a bunch of different tools that cost quite a lot and might not be even that useful at the moment or in the long run.\n\nSo I wanted to create a one for all platform that concentrates on 2 primary things.\n\n1. Educate everyone about what each tool is and how they work.\n\n2. Create focused DIY projects by professionals who would be able to guide the users in building their creations.\n\nBut there is literally so much that can be done through this. I am trying to build this into a business that should help people in saving money, time and effort in pursuit of building either their own furniture, Garden, Scented Candles, Smart Lightning or just about anything that is possible to do with the copious amounts of tools that's available in this world at our disposal.\n\nI would highly appreciate it if you could please let me know if this is something that seems remotely interesting, how you believe I can improve the product that would make it more appealing to use if it was commercially available and professionally done, would you pay for something like this and if not then what you're looking for in this to make it worth your time and money.\n\nThank you all so much. \nWarm regards \n-J", "link": "https://www.reddit.com/r/DIY/comments/pczvdg/i_made_a_prototype_webapp_my_aim_for_it_is_to/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i made a prototype webapp. my aim for it is to help people learn more about -----> diy !!!  and give their inspirations life. i would highly appreciate it if you could spare a minute and please look at my site and give me your feedback and suggestions. /!/ [diyolo](https://app.pandasuite.com/rx9mt2bd)\n\nhi everyone,\n\ni made a prototype webapp. here is my thought process behind it.\n\nwhen someone wants to begin building anything as a diy project they often either have their parents or grandparents to guide them... or if you're like me then you would probably end up looking at millions of diy projects on youtube, googling multiple articles related to what each tool is and how they work. not to mention buying a bunch of different tools that cost quite a lot and might not be even that useful at the moment or in the long run.\n\nso i wanted to create a one for all platform that concentrates on 2 primary things.\n\n1. educate everyone about what each tool is and how they work.\n\n2. create focused diy projects by professionals who would be able to guide the users in building their creations.\n\nbut there is literally so much that can be done through this. i am trying to build this into a business that should help people in saving money, time and effort in pursuit of building either their own furniture, garden, scented candles, smart lightning or just about anything that is possible to do with the copious amounts of tools that's available in this world at our disposal.\n\ni would highly appreciate it if you could please let me know if this is something that seems remotely interesting, how you believe i can improve the product that would make it more appealing to use if it was commercially available and professionally done, would you pay for something like this and if not then what you're looking for in this to make it worth your time and money.\n\nthank you all so much. \nwarm regards \n-j", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/pczvdg/i_made_a_prototype_webapp_my_aim_for_it_is_to/", "identifyer": 359634, "year": "2021"}], "name": "diyDIY2021"}