{"interestingcomments": [{"Unnamed: 0": 333201, "autor": "shonnarchy", "date": 1614462921000, "content": "Reclaimed basketball court floor /!/ \nGallery: [https://imgur.com/a/OLmTIfF](https://imgur.com/a/OLmTIfF)\n\n\n## Preface\n\nOur home was built in the early 90’s. While very mechanically sound, the home has never been updated cosmetically and lacks the charm of older homes. We wanted to introduce an eclectic element in our remodel to generate charisma.\n\nA used local high school basketball court seemed like an ideal catalyst.\n\n\n## The Floor\nI ran across this ad from a local salvage company: \n\n&gt; \t*Hard Maple Gym Flooring*  \n&gt; \t  \n&gt; \tThis beautiful hard maple wood gym flooring was recently pulled from a local high school's gymnasium, where it saw use for basketball, volleyball, wrestling, gym class, and much more. Now it's available to you for it's next adventure!  \n&gt; \t* Robbins hard maple planks, MFMA 2nd grade or better; tongue and groove design   \n&gt; \t* Nailed through tongue to 2\"x3\"s underneath; includes rubber pads; easily disassembled, if desired   \n&gt; \t* Comes in approximately 4'x6' panels (24 sqft each); several thousand square feet available   \n&gt; \t* Perfect for refinishing into tables, walls, shelving, chairs, and much more   \n&gt; \t* Most panels have a light finish; some feature court markings   \n\nAfter looking at the flooring in person, I decided to purchase a single panel to see how hard it would be to disassemble. I purchased another 55 panels after convincing myself that disassembly wouldn’t be too challenging, yielding enough flooring for the main floor of our home (~1,000 sq/ft) for less than $2,000.\n\n\n## Disassembly\nAfter getting the flooring from the salvage company into my garage (an adventure that I won’t cover here), I began to disassemble the panels. \n\nEach approximately 4’ x 6’ panel was tongue nailed into 2x3 backing boards (floating the floor on what I assume was concrete). I used a pry bar to gently begin lifting the backing board from the flooring, then slipped a metal cutting sawzall blade into the gap. The boards came off easily with a combination of gently pry bar pressure as the blade trimmed the nails. I followed with an angle grinder to remove all of the remaining nail protrusions. \n\nWith the backing boards removed, nothing but glossy finish and years of stasis held the floor boards together. The act of shifting the sheets would release most of the floor boards from one another, finally resulting in individual boards.\n\n\n## Board Management\nI hadn’t wrapped my head around what my garage would look like with 1,000+ square feet of loose floor boards might look like. Turns out it looks like this: \n\nI quickly realized that I was going to need to devise some kind of system to manage my flooring inventory for the sake of utility, but also to determine how much flooring I had available. \n\nI ended up making two 8’x4’ racks to hold my boards. The first rack was broken up into three sections: boards over 5’ in length, boards between 4’ and 5’ in length, and boards between 3’ and 4’ in length. The second rack was broken into eight sections, all of which were filled with boards between 2’ and 3’ in length. \n\nThese sections afforded me a few useful outcomes. First, I could count the boards in each section to calculate an approximation of the total square footage of flooring I’d racked. Second, it game me the opportunity to mix and match floorboard lengths without thinking too much when laying the floor.\n\nBoards shorter than 1’ in length were discarded as were boards that damaged. I retained boards between 1’-2’, but nope not to have to dip into these reserves. \n\nBoard management should not be overlooked as a tremendously time consuming and generally unpleasant task. If you’re considering this type of project, know that you’re going to question yourself quite a bit at this stage. \n\n\n## Cleaning the boards\nI’d never reclaimed a floor before and was quite surprised to see the amount of crust and dirt that stuck each of the boards. I came up with a four pass milling process using my table saw to both remove the crust and assist with the process of reassembling the floor. \n\n### Cut 1\nMy first cut involved running the floorboard face down on the table saw with the tongue agains the fence, removing ~1/16” from the groove side of each board. This cut removes all of the crust from the groove side, leaving nice, clean maple. \n\n### Cut 2\nMy second cut involved under-trimming the bottom shoulder of the groove side by ~1/8” by running each board bottom down with the tongue against the fence and the blade lowered to mid-groove height. This under-cut would allow the groove to still function as intended, but would give me wiggle room should the mating board have crust beneath the tongue. \n\n### Cut 3\nMy third cut is the most unpleasant cut, involving removing ~1/32” from the above the tongue. This was the last bastion of crust collection, but it’s also where nail heads remain. I made the cut by running the floorboards face down with the groove against the fence and the blade lowered to tongue height. Prepare for sparks.\n\nI purchased cheap table saw blades from Amazon for this project. The maple is hard... but those nail heads are the worst. I went through four total blades for this initial section of flooring. \n\n### Cut 4\nMy last cut wasn’t a cut that I’d planned, but I realized it’s utility as I began laying the floor. This cut involves running each floorboard through the saw with the face against the fence and the tongue side up. With the blade lowered to groove-height, I removed ~1/32” from the lower groove shoulder. This made an incredible difference when it came to installation. \n\n### Heads and Tails\nWith the lengthwise tongues and grooves cleaned up, it was now time to remove the tongues and grooves on the heads and tails of each board. Because many of the boards had been cut in the process of being removed from the gym, they lacked tongues or grooves on their ends. Knowing that I wouldn’t be able to mate a tongue’d board to a non-grooved board, I removed the tongues and grooves from all on a chop saw leaving clean, square ends. \n\nI milled flooring over the course of four days for the 300 sq/ft of flooring I’ve laid so far. I never spent more than four hours per day on this step. It’s a tedious process and I wanted to give the table saw all of my attention (and none of my fingers). \n\n\n## Laying the floor\nI won’t get into the details of laying hardwood flooring. There are plenty of good sources for that information on the internet. \n\nThe process wasn’t fast. Some boards just didn’t want to work with other boards. Lots of tongues splintered and needed to have bits chiseled out. I’m guessing that some of this is standard flooring process, while other parts are specific to reclaimed flooring. \n\nHere are a few specific lessons from my install: \n\n### Modifying the floor nailer\nMy gym flooring was 1” tall. Standard flooring is 3/4”. Aside from the fact that all of my doors required “adjustments”, the flooring nailer used to lay standard flooring doesn’t work with 1” flooring.\n\nThe flooring nailer shot its staples too high in 1” flooring, deforming the tongue sides of the boards. This, as it turns out, was easily remedied by removing the nylon plate on the bottom of the nailer. This, however, introduced another issue: The nailer was now deforming the tongue-sides of boards due to collision. I modified the face of the flooring nailer to include a small groove, preventing issues moving forward. \n\n### Underlayment\nI laid out a “FloorMuffler Ultra Seal Underlayment” before installing the floor. I’m not sure that I needed something this fancy, but I did want to have a squishy surface under the flooring to accommodate for irregularities in the boards. I really think it helped move things along. \n\n### Bad Cut 4\nCut 4 wasn’t part of my original plan and I was making these cuts in batches after all of the other cuts had been made. At some point I thought to myself “if taking a tiny amount off makes installation a bit easier, taking a bit more off is going to make installation haul ass!”. This was poor thinking. \n\nI ended up with a section of flooring in which each board’s groove side protruded. This was caused by having a groove that was too loose. When a staple was slammed into the tongue, loose groove pressure gave the board a chance to rise up. \n\nThis, of course, went unnoticed for some time. After realizing how dumb I was, I removed this few feet of flooring, then reinstalled it by face nailing. \n\nWhile this section now looks vastly inferior to the rest of the floor, it’s still in line with the vintage vibe we’re going for. \n\nSide note: an oscillating multi tool with a carbide blade makes the task of removing floor boards relatively easy. The blade slips between the squishy underlayment and boards to cut staples. \n\n\n## Screening and finishing\nAfter laying this section of floor, all that remained was cleaning, screening and finishing. \n\nI methodically cleaned the floor using a Bona floor cleaning product and a scrubby sponge. I’ve been warned that was would screw the finish up and I hoped this step would remove any (if there was any). \n\nFloor screening is the process of roughing up a floors surface to accept a new finish. I rented a buffer from Homey D with white pads and 80 grit sanding screens. I really don’t know how these machines are meant to operate with a single user. I had to get my wife to help stabilize the buffer using a strap. Even then it got away from us and put a hole in the wall. \n\nThe screening process did two things: not only did it rough up the surface of the boards, but it also lightly sanded un-level boards, leaving a distressed version of the court markings. This was an intentional outcome that left the floor feeling smooth, even though it’s not perfectly level from board to board. \n\nAfter vacuuming up the dust, I finished the floor with three coats of matte Bona Traffic water-based finish. \n\n\n## Results\nI’m very pleased with the results. Fortunately I’ve been able to spread all of this projects tasks out over enough time to space out the pain points. A lot of effort went in to each step of the process... but I didn’t have to complete the steps immediately following the previous step. That said, I’ve still got 700 sq/ft of floor to lay down and I’m eventually going to want to get done, so that might change soon. \n\nThis section of floor has been down for two months now with a decent amount of traffic on it. Nothing seems particularly f-d up at this point. In fact, it looks pretty much as good now as it did on day one.", "link": "https://www.reddit.com/r/DIY/comments/lty9mc/reclaimed_basketball_court_floor/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we wanted to introduce", "selectorShort": "introduce", "MarkedSent": "reclaimed basketball court floor /!/ \ngallery: [https://imgur.com/a/olmtiff](https://imgur.com/a/olmtiff)\n\n\n## preface\n\nour home was built in the early 90’s. while very mechanically sound, the home has never been updated cosmetically and lacks the charm of older homes. -----> we !!!  -----> wanted !!!  -----> to !!!  -----> introduce !!!  an eclectic element in our remodel -----> to !!!  generate charisma.\n\na used local high school basketball court seemed like an ideal catalyst.\n\n\n## the floor\ni ran across this ad from a local salvage company: \n\n&gt; \t*hard maple gym flooring*  \n&gt; \t  \n&gt; \tthis beautiful hard maple wood gym flooring was recently pulled from a local high school's gymnasium, where it saw use for basketball, volleyball, wrestling, gym class, and much more. now it's available to you for it's next adventure!  \n&gt; \t* robbins hard maple planks, mfma 2nd grade or better; tongue and groove design   \n&gt; \t* nailed through tongue to 2\"x3\"s underneath; includes rubber pads; easily disassembled, if desired   \n&gt; \t* comes in approximately 4'x6' panels (24 sqft each); several thousand square feet available   \n&gt; \t* perfect for refinishing into tables, walls, shelving, chairs, and much more   \n&gt; \t* most panels have a light finish; some feature court markings   \n\nafter looking at the flooring in person, i decided to purchase a single panel to see how hard it would be to disassemble. i purchased another 55 panels after convincing myself that disassembly wouldn’t be too challenging, yielding enough flooring for the main floor of our home (~1,000 sq/ft) for less than $2,000.\n\n\n## disassembly\nafter getting the flooring from the salvage company into my garage (an adventure that i won’t cover here), i began to disassemble the panels. \n\neach approximately 4’ x 6’ panel was tongue nailed into 2x3 backing boards (floating the floor on what i assume was concrete). i used a pry bar to gently begin lifting the backing board from the flooring, then slipped a metal cutting sawzall blade into the gap. the boards came off easily with a combination of gently pry bar pressure as the blade trimmed the nails. i followed with an angle grinder to remove all of the remaining nail protrusions. \n\nwith the backing boards removed, nothing but glossy finish and years of stasis held the floor boards together. the act of shifting the sheets would release most of the floor boards from one another, finally resulting in individual boards.\n\n\n## board management\ni hadn’t wrapped my head around what my garage would look like with 1,000+ square feet of loose floor boards might look like. turns out it looks like this: \n\ni quickly realized that i was going to need to devise some kind of system to manage my flooring inventory for the sake of utility, but also to determine how much flooring i had available. \n\ni ended up making two 8’x4’ racks to hold my boards. the first rack was broken up into three sections: boards over 5’ in length, boards between 4’ and 5’ in length, and boards between 3’ and 4’ in length. the second rack was broken into eight sections, all of which were filled with boards between 2’ and 3’ in length. \n\nthese sections afforded me a few useful outcomes. first, i could count the boards in each section to calculate an approximation of the total square footage of flooring i’d racked. second, it game me the opportunity to mix and match floorboard lengths without thinking too much when laying the floor.\n\nboards shorter than 1’ in length were discarded as were boards that damaged. i retained boards between 1’-2’, but nope not to have to dip into these reserves. \n\nboard management should not be overlooked as a tremendously time consuming and generally unpleasant task. if you’re considering this type of project, know that you’re going to question yourself quite a bit at this stage. \n\n\n## cleaning the boards\ni’d never reclaimed a floor before and was quite surprised to see the amount of crust and dirt that stuck each of the boards. i came up with a four pass milling process using my table saw to both remove the crust and assist with the process of reassembling the floor. \n\n### cut 1\nmy first cut involved running the floorboard face down on the table saw with the tongue agains the fence, removing ~1/16” from the groove side of each board. this cut removes all of the crust from the groove side, leaving nice, clean maple. \n\n### cut 2\nmy second cut involved under-trimming the bottom shoulder of the groove side by ~1/8” by running each board bottom down with the tongue against the fence and the blade lowered to mid-groove height. this under-cut would allow the groove to still function as intended, but would give me wiggle room should the mating board have crust beneath the tongue. \n\n### cut 3\nmy third cut is the most unpleasant cut, involving removing ~1/32” from the above the tongue. this was the last bastion of crust collection, but it’s also where nail heads remain. i made the cut by running the floorboards face down with the groove against the fence and the blade lowered to tongue height. prepare for sparks.\n\ni purchased cheap table saw blades from amazon for this project. the maple is hard... but those nail heads are the worst. i went through four total blades for this initial section of flooring. \n\n### cut 4\nmy last cut wasn’t a cut that i’d planned, but i realized it’s utility as i began laying the floor. this cut involves running each floorboard through the saw with the face against the fence and the tongue side up. with the blade lowered to groove-height, i removed ~1/32” from the lower groove shoulder. this made an incredible difference when it came to installation. \n\n### heads and tails\nwith the lengthwise tongues and grooves cleaned up, it was now time to remove the tongues and grooves on the heads and tails of each board. because many of the boards had been cut in the process of being removed from the gym, they lacked tongues or grooves on their ends. knowing that i wouldn’t be able to mate a tongue’d board to a non-grooved board, i removed the tongues and grooves from all on a chop saw leaving clean, square ends. \n\ni milled flooring over the course of four days for the 300 sq/ft of flooring i’ve laid so far. i never spent more than four hours per day on this step. it’s a tedious process and i wanted to give the table saw all of my attention (and none of my fingers). \n\n\n## laying the floor\ni won’t get into the details of laying hardwood flooring. there are plenty of good sources for that information on the internet. \n\nthe process wasn’t fast. some boards just didn’t want to work with other boards. lots of tongues splintered and needed to have bits chiseled out. i’m guessing that some of this is standard flooring process, while other parts are specific to reclaimed flooring. \n\nhere are a few specific lessons from my install: \n\n### modifying the floor nailer\nmy gym flooring was 1” tall. standard flooring is 3/4”. aside from the fact that all of my doors required “adjustments”, the flooring nailer used to lay standard flooring doesn’t work with 1” flooring.\n\nthe flooring nailer shot its staples too high in 1” flooring, deforming the tongue sides of the boards. this, as it turns out, was easily remedied by removing the nylon plate on the bottom of the nailer. this, however, introduced another issue: the nailer was now deforming the tongue-sides of boards due to collision. i modified the face of the flooring nailer to include a small groove, preventing issues moving forward. \n\n### underlayment\ni laid out a “floormuffler ultra seal underlayment” before installing the floor. i’m not sure that i needed something this fancy, but i did want to have a squishy surface under the flooring to accommodate for irregularities in the boards. i really think it helped move things along. \n\n### bad cut 4\ncut 4 wasn’t part of my original plan and i was making these cuts in batches after all of the other cuts had been made. at some point i thought to myself “if taking a tiny amount off makes installation a bit easier, taking a bit more off is going to make installation haul ass!”. this was poor thinking. \n\ni ended up with a section of flooring in which each board’s groove side protruded. this was caused by having a groove that was too loose. when a staple was slammed into the tongue, loose groove pressure gave the board a chance to rise up. \n\nthis, of course, went unnoticed for some time. after realizing how dumb i was, i removed this few feet of flooring, then reinstalled it by face nailing. \n\nwhile this section now looks vastly inferior to the rest of the floor, it’s still in line with the vintage vibe we’re going for. \n\nside note: an oscillating multi tool with a carbide blade makes the task of removing floor boards relatively easy. the blade slips between the squishy underlayment and boards to cut staples. \n\n\n## screening and finishing\nafter laying this section of floor, all that remained was cleaning, screening and finishing. \n\ni methodically cleaned the floor using a bona floor cleaning product and a scrubby sponge. i’ve been warned that was would screw the finish up and i hoped this step would remove any (if there was any). \n\nfloor screening is the process of roughing up a floors surface to accept a new finish. i rented a buffer from homey d with white pads and 80 grit sanding screens. i really don’t know how these machines are meant to operate with a single user. i had to get my wife to help stabilize the buffer using a strap. even then it got away from us and put a hole in the wall. \n\nthe screening process did two things: not only did it rough up the surface of the boards, but it also lightly sanded un-level boards, leaving a distressed version of the court markings. this was an intentional outcome that left the floor feeling smooth, even though it’s not perfectly level from board to board. \n\nafter vacuuming up the dust, i finished the floor with three coats of matte bona traffic water-based finish. \n\n\n## results\ni’m very pleased with the results. fortunately i’ve been able to spread all of this projects tasks out over enough time to space out the pain points. a lot of effort went in to each step of the process... but i didn’t have to complete the steps immediately following the previous step. that said, i’ve still got 700 sq/ft of floor to lay down and i’m eventually going to want to get done, so that might change soon. \n\nthis section of floor has been down for two months now with a decent amount of traffic on it. nothing seems particularly f-d up at this point. in fact, it looks pretty much as good now as it did on day one.", "sortedWord": "None", "removed": null, "score": 3, "comments": 5, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/lty9mc/reclaimed_basketball_court_floor/", "identifyer": 333201, "year": "2021"}], "name": "introduceDIY2021"}