{"interestingcomments": [{"Unnamed: 0": 272982, "autor": "soccerplayer0511", "date": 1588337172000, "content": "A Pointless Rant /!/  I have spent the last 3 years self teaching myself how to buy, renovate, and then rent out worn out properties. When I first started I was working a normal full time W2 job to cover the costs of operation. After the 3rd completed property I finally transitioned to full time effort in my own business. I was just competent enough to start doing handyman work to substitute my W2 work. Now I am finished with my 7th property, right when all this shit hit the fan, and just shy of refinancing through the bank to recoup all my investment. Without getting too into the weeds, my schedule C has been just barely into the negative all three years, mainly because I put in a majority sweat equity instead of paying myself. Because of this I don't qualify for any of the PPP support, even though my cash stream from handyman work has dried up. I live in KS and they don't offer unemployment for self employed either. So aside from the very first IDL option, that is only going to give $1000 per head (just me), there are no options. Plus I haven't seen or hear anything from that application through the SBA.\n\nNow back to the struggle on getting my property refinanced. Most banks are overwhelmed by their load of dealing with all the PPP, plus with interest so low, I don't think they really want to loan me money on my property. Luckily all my properties are rented out, and I only have 1 tenant who lost about 25% of their income, so I am getting most of my rent roll. Even without my normal handyman income, I am lucky enough to have a wife who is a nurse, and there has been no shortage of emergency contracts across the US, and even one that she worked on an island close to Aruba. She deserves her own full post to tell the story of the various contracts, especially the one operated primarily through FEMA. It was a complete shit show and it was devastating to have an inside look into how so much tax money is wasted due to incompetent management. Sorry, got off track, but the point is she has made more money this year then the entirety of last year normal nurse income. Even with that, the banks don't want to use that income for guarantor use, and they want us to wait until she gets back to normal employment.\n\nThe pointless part of all of this, and please take this as a reason not to feel sorry for me, we will make all of this work without support from big banks, and some small banks. This only escalates my plan to just remove the banks as middle men and just create my own private platform to get investors etc. I just want to add to the anger that CEOs making millions, got millions of dollars in support that should have gone to people like me, and others who are in even worse shape. I am just lucky to have a wife in a specific career that made it all work out.\n\nReal estate investing can print money if you run it effectively, and I am going to prove that it makes more money than a family needs. I am only ever going to pay myself a salary that provides enough to live the way I live now. I don't need a big fancy house or a brand new sports car. I don't need to buy an NBA team. Instead I am going to put every extra dollar I don't need back into the community around me, and slowly take more and more business from the banks that only care about their bottom dollar. It is complete and utter bullshit how much power money has over everyone. I know that won't change in my lifetime, but I am going to live to be 300 years old, either through science, or through legacy. The focus on that mindset, and the understanding that money is just another tool, and is no different from the hammer that helped me build my own personal foundation.\n\nIf you read all of this, I want to apologize for the rambling nature, and poor punctuation (I really like commas). I also want to thank you for your time reading through, and I hope even one person will have a new perspective on some of the faults with our current version of capitalism. We are all capable of seeing the obvious problems around us. There are two types of people in this world, those that will do something about those problems, and those that assume that someone else will. I will be part of the group that does everything I can to increase my circle of influence and do something about it.", "link": "https://www.reddit.com/r/DIY/comments/gbhg6c/a_pointless_rant/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we will make", "selectorShort": "make", "MarkedSent": "a pointless rant /!/  i have spent the last 3 years self teaching myself how to buy, renovate, and then rent out worn out properties. when i first started i was working a normal full time w2 job to cover the costs of operation. after the 3rd completed property i finally transitioned to full time effort in my own business. i was just competent enough to start doing handyman work to substitute my w2 work. now i am finished with my 7th property, right when all this shit hit the fan, and just shy of refinancing through the bank to recoup all my investment. without getting too into the weeds, my schedule c has been just barely into the negative all three years, mainly because i put in a majority sweat equity instead of paying myself. because of this i don't qualify for any of the ppp support, even though my cash stream from handyman work has dried up. i live in ks and they don't offer unemployment for self employed either. so aside from the very first idl option, that is only going to give $1000 per head (just me), there are no options. plus i haven't seen or hear anything from that application through the sba.\n\nnow back to the struggle on getting my property refinanced. most banks are overwhelmed by their load of dealing with all the ppp, plus with interest so low, i don't think they really want to loan me money on my property. luckily all my properties are rented out, and i only have 1 tenant who lost about 25% of their income, so i am getting most of my rent roll. even without my normal handyman income, i am lucky enough to have a wife who is a nurse, and there has been no shortage of emergency contracts across the us, and even one that she worked on an island close to aruba. she deserves her own full post to tell the story of the various contracts, especially the one operated primarily through fema. it was a complete shit show and it was devastating to have an inside look into how so much tax money is wasted due to incompetent management. sorry, got off track, but the point is she has made more money this year then the entirety of last year normal nurse income. even with that, the banks don't want to use that income for guarantor use, and they want us to wait until she gets back to normal employment.\n\nthe pointless part of all of this, and please take this as a reason not to feel sorry for me, -----> we !!!  -----> will !!!  -----> make !!!  all of this work without support from big banks, and some small banks. this only escalates my plan to just remove the banks as middle men and just create my own private platform to get investors etc. i just want to add to the anger that ceos making millions, got millions of dollars in support that should have gone to people like me, and others who are in even worse shape. i am just lucky to have a wife in a specific career that made it all work out.\n\nreal estate investing can print money if you run it effectively, and i am going to prove that it makes more money than a family needs. i am only ever going to pay myself a salary that provides enough to live the way i live now. i don't need a big fancy house or a brand new sports car. i don't need to buy an nba team. instead i am going to put every extra dollar i don't need back into the community around me, and slowly take more and more business from the banks that only care about their bottom dollar. it is complete and utter bullshit how much power money has over everyone. i know that won't change in my lifetime, but i am going to live to be 300 years old, either through science, or through legacy. the focus on that mindset, and the understanding that money is just another tool, and is no different from the hammer that helped me build my own personal foundation.\n\nif you read all of this, i want to apologize for the rambling nature, and poor punctuation (i really like commas). i also want to thank you for your time reading through, and i hope even one person will have a new perspective on some of the faults with our current version of capitalism. we are all capable of seeing the obvious problems around us. there are two types of people in this world, those that will do something about those problems, and those that assume that someone else will. i will be part of the group that does everything i can to increase my circle of influence and do something about it.", "sortedWord": "None", "removed": null, "score": 1, "comments": 41, "media": null, "medialink": "https://www.reddit.com/r/DIY/comments/gbhg6c/a_pointless_rant/", "identifyer": 272982, "year": "2020"}, {"Unnamed: 0": 289111, "autor": "ijm5012", "date": 1599525975000, "content": "Hardwood Floating Shelves /!/ Photos: \nhttps://imgur.com/gallery/l8Lyyu2\n\nTools Used:\n- Table Saw\n- Router and Roundover Bit\n- Doweling Jig\n- Sander\n- Drill &amp; Drill Bit (Brad point and forstner)\n- Dowel Rod\n- Polyurethane and Brush\n- Laser Level\n- Lag Screws\n- Deadblow Hammer\n\nMy wife mentioned that she wanted some floating shelves in our master bathroom, since we demo’d the linen closet in our master bathroom in order to double the size of our shower, a decision that neither of us regret (seriously, having a massive shower is so so nice).\n\nI figured that if I was going to do floating shelves, I wanted some nice chunky ones that were solid wood. So we made a trip to our local lumber yard, looked at a bunch of wood but ultimately decided to go with some Hickory. We loved the light blonde color of the wood and the straight grain structure. It was 8/4 rough sawn, and I had them open it down to a finished thickness of 1.5”.\n\nFirst step was to cut the wood to its desired width, and desired depth plus 1/8” (more on that in a bit). Once that was done, I routed all the edges with a 1/8” roundover bit to give the corners a small radius. Then I sanded everything down. I determined where I wanted to position the dowels ,and used the doweling jig and drill to drill the holes. At this point, I cut 1.5” off the backside of the shelves. This portion creates an “anchor” which is fastened to the wall, and the other part of the cut is attached once the anchor is on the wall by simply sliding it over the dowels. Last step before install is the finish the wood to protect it (O used a water-based Polyurethane to preserve the natural color of the wood, as any oil-based finish will add some yellow/amber color).\n\nInstallation was pretty straightforward. First thing was to turn the laser level on to determine the height we wanted the shelves at, and mark the stud locations. Then, install the dowels n to the “anchor” piece before attaching it to the wall. Next, drill the holes and then attach the “anchor” to the wall.Finally, just slide the front of the shelves over the dowels, and the dowels support the load of the shelf (5x 5” long dowels in the wall shelves, and 3x 2.5” long dowels in the sink shelf). This is a very snug fit, so a dead blow hammer is helpful to pound the shelves in place without damaging the finish. \n\nOverall the project was pretty simple, but the outcome is exactly what we wanted. We love the natural color of the wood, and the additional storage it provides is very functional. I’d say I put about 10-12 hours in to the project over the span of two days from start to finish.", "link": "https://www.reddit.com/r/DIY/comments/iojt7o/hardwood_floating_shelves/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "hardwood floating shelves /!/ photos: \nhttps://imgur.com/gallery/l8lyyu2\n\ntools used:\n- table saw\n- router and roundover bit\n- doweling jig\n- sander\n- drill &amp; drill bit (brad point and forstner)\n- dowel rod\n- polyurethane and brush\n- laser level\n- lag screws\n- deadblow hammer\n\nmy wife mentioned that she wanted some floating shelves in our master bathroom, since we demo’d the linen closet in our master bathroom in order to double the size of our shower, a decision that neither of us regret (seriously, having a massive shower is so so nice).\n\ni figured that if i was going to do floating shelves, i wanted some nice chunky ones that were solid wood. so -----> we !!!  -----> made !!!  a trip to our local lumber yard, looked at a bunch of wood but ultimately decided to go with some hickory. we loved the light blonde color of the wood and the straight grain structure. it was 8/4 rough sawn, and i had them open it down to a finished thickness of 1.5”.\n\nfirst step was to cut the wood to its desired width, and desired depth plus 1/8” (more on that in a bit). once that was done, i routed all the edges with a 1/8” roundover bit to give the corners a small radius. then i sanded everything down. i determined where i wanted to position the dowels ,and used the doweling jig and drill to drill the holes. at this point, i cut 1.5” off the backside of the shelves. this portion creates an “anchor” which is fastened to the wall, and the other part of the cut is attached once the anchor is on the wall by simply sliding it over the dowels. last step before install is the finish the wood to protect it (o used a water-based polyurethane to preserve the natural color of the wood, as any oil-based finish will add some yellow/amber color).\n\ninstallation was pretty straightforward. first thing was to turn the laser level on to determine the height we wanted the shelves at, and mark the stud locations. then, install the dowels n to the “anchor” piece before attaching it to the wall. next, drill the holes and then attach the “anchor” to the wall.finally, just slide the front of the shelves over the dowels, and the dowels support the load of the shelf (5x 5” long dowels in the wall shelves, and 3x 2.5” long dowels in the sink shelf). this is a very snug fit, so a dead blow hammer is helpful to pound the shelves in place without damaging the finish. \n\noverall the project was pretty simple, but the outcome is exactly what we wanted. we love the natural color of the wood, and the additional storage it provides is very functional. i’d say i put about 10-12 hours in to the project over the span of two days from start to finish.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/iojt7o/hardwood_floating_shelves/", "identifyer": 289111, "year": "2020"}, {"Unnamed: 0": 294894, "autor": "ChaoticDominance", "date": 1593895877000, "content": "The cart was too small for my neighbors lawnmower. So we made it work. First diy in age's. The boards tied down in many areas.", "link": "https://www.reddit.com/r/DIY/comments/hlagic/the_cart_was_too_small_for_my_neighbors_lawnmower/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "the cart was too small for my neighbors lawnmower. so -----> we !!!  -----> made !!!  it work. first diy in age's. the boards tied down in many areas.", "sortedWord": "None", "removed": "moderator", "score": 1, "comments": 1, "media": "image", "medialink": "https://i.redd.it/0vw51h99lw851.jpg", "identifyer": 294894, "year": "2020"}, {"Unnamed: 0": 295448, "autor": "smokin9mm", "date": 1588079422000, "content": "Bathroom paint and tub seal /!/ First off I apologize for what I am sure are total noob questions but we all gotta start somewhere.\n\nWe bought a freshly built cookie cutter in January 2019 and to put it nice, the contractors cut a few corners. This definitely is not our forever home but we would like to make it look nice while we are here.\n\nI have to say the master bath is the worst in terms of  cut corners.  We will be painting the bathroom this week and the area just above the tub is peeling . There is a gap between the wall and the tub and I am positive my 4 yo gets a ton of water in the crack when she takes a bath. Whoever's job is was to caulk did a shit job imo. See attached pic of the quality craftmanship. \n\nObviously I need to scrape the area where the paint is peeling just above the tub, but how far up do I need to go? Just where the paint is chipping/rotting? The walls are textured so I feel I am going to scrape all the texture off and it will look bad once I repaint. Is there a way to put the texture back on the wall? Like a spray that I can put on before I paint? I plan on scraping what's left of the  old caulk off there and reapplying after I paint. Is that the way to go? Best tool to scrape the old caulk?\n\nI have a lowes 1 mile from my house and will need to limit my shopping to there due to the Caroni. Any help is appreciated . Thank you. \n\n\nTub https://imgur.com/a/jFeEHZF", "link": "https://www.reddit.com/r/DIY/comments/g9mwhy/bathroom_paint_and_tub_seal/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we would like to make", "selectorShort": "make", "MarkedSent": "bathroom paint and tub seal /!/ first off i apologize for what i am sure are total noob questions but we all gotta start somewhere.\n\nwe bought a freshly built cookie cutter in january 2019 and to put it nice, the contractors cut a few corners. this definitely is not our forever home but -----> we !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  it look nice while -----> we !!!  are here.\n\ni have to say the master bath is the worst in terms of  cut corners.  we will be painting the bathroom this week and the area just above the tub is peeling . there is a gap between the wall and the tub and i am positive my 4 yo gets a ton of water in the crack when she takes a bath. whoever's job is was to caulk did a shit job imo. see attached pic of the quality craftmanship. \n\nobviously i need to scrape the area where the paint is peeling just above the tub, but how far up do i need to go? just where the paint is chipping/rotting? the walls are textured so i feel i am going to scrape all the texture off and it will look bad once i repaint. is there a way to put the texture back on the wall? like a spray that i can put on before i paint? i plan on scraping what's left of the  old caulk off there and reapplying after i paint. is that the way to go? best tool to scrape the old caulk?\n\ni have a lowes 1 mile from my house and will need to limit my shopping to there due to the caroni. any help is appreciated . thank you. \n\n\ntub https://imgur.com/a/jfeehzf", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/g9mwhy/bathroom_paint_and_tub_seal/", "identifyer": 295448, "year": "2020"}, {"Unnamed: 0": 295449, "autor": "smokin9mm", "date": 1588079393000, "content": "Bathroom paint and tub seal /!/ First off I apologize for what I am sure are total noob questions but we all gotta start somewhere.\n\nWe bought a freshly built cookie cutter in January 2019 and to put it nice, the contractors cut a few corners. This definitely is not our forever home but we would like to make it look nice while we are here.\n\nI have to say the master bath is the worst in terms of  cut corners.  We will be painting the bathroom this week and the area just above the tub is peeling . There is a gap between the wall and the tub and I am positive my 4 yo gets a ton of water in the crack when she takes a bath. Whoever's job is was to caulk did a shit job imo. See attached pic of the quality craftmanship. \n\nObviously I need to scrape the area where the paint is peeling just above the tub, but how far up do I need to go? Just where the paint is chipping/rotting? The walls are textured so I feel I am going to scrape all the texture off and it will look bad once I repaint. Is there a way to put the texture back on the wall? Like a spray that I can put on before I paint? I plan on scraping what's left of the  old caulk off there and reapplying after I paint. Is that the way to go? Best tool to scrape the old caulk?\n\nI have a lowes 1 mile from my house and will need to limit my shopping to there due to the Caroni. Any help is appreciated . Thank you. \n\n\nTub https://imgur.com/a/jFeEHZF", "link": "https://www.reddit.com/r/DIY/comments/g9mw7s/bathroom_paint_and_tub_seal/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "we would like to make", "selectorShort": "make", "MarkedSent": "bathroom paint and tub seal /!/ first off i apologize for what i am sure are total noob questions but we all gotta start somewhere.\n\nwe bought a freshly built cookie cutter in january 2019 and to put it nice, the contractors cut a few corners. this definitely is not our forever home but -----> we !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  it look nice while -----> we !!!  are here.\n\ni have to say the master bath is the worst in terms of  cut corners.  we will be painting the bathroom this week and the area just above the tub is peeling . there is a gap between the wall and the tub and i am positive my 4 yo gets a ton of water in the crack when she takes a bath. whoever's job is was to caulk did a shit job imo. see attached pic of the quality craftmanship. \n\nobviously i need to scrape the area where the paint is peeling just above the tub, but how far up do i need to go? just where the paint is chipping/rotting? the walls are textured so i feel i am going to scrape all the texture off and it will look bad once i repaint. is there a way to put the texture back on the wall? like a spray that i can put on before i paint? i plan on scraping what's left of the  old caulk off there and reapplying after i paint. is that the way to go? best tool to scrape the old caulk?\n\ni have a lowes 1 mile from my house and will need to limit my shopping to there due to the caroni. any help is appreciated . thank you. \n\n\ntub https://imgur.com/a/jfeehzf", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/g9mw7s/bathroom_paint_and_tub_seal/", "identifyer": 295449, "year": "2020"}], "name": "makeDIY2020"}