{"interestingcomments": [{"Unnamed: 0": 264442, "autor": "icanseeyou9", "date": 1606111918000, "content": "Garage door insulation /!/ I haven't seen a tutorial on how to insulate the garage doors that I have - the majority of the guides online use thick panels of foam on the doors as they have a different set up from mine and although they will always have a better R-Value, unfortunately, do not work with the garage door that I have.\nI've linked all of the items that I've used in this install bellow - the insulation kit itself that I've used is [this](https://www.amazon.com/gp/product/B07TXN6F54) - which at the time of install ran me $110.00\n[Link to imgur album](https://imgur.com/a/2Rv4dFQ)\nI highly recommend for two people to be partaking in the installation - It minimizes errors that I've made by installing alone. Installation time was about 4-5 hours, which I'm sure can be cut in half with some help. \nThe actual insulation comes in the with of 21\" and 1/4ths, and standard garage door length being 16'x21\", you have plenty of room for error which is nice.\n\nFor this install, I've personally used an assortment of different tools to help make it look as nice as possible, but not all of them are required for your install Apart from the insulation and double-sided tape that came in the package, I've used the following tools:\n 1) [X-Acto knife (or Utility knife)](https://www.amazon.com/X-Acto-XZ3601-X-ACTO-Knife-Safety/dp/B005KRSWM6)\n 2) [Seam Roller](https://www.amazon.com/4-Inch-Printmaking-Application-Original-Version/dp/B07YDNKSH6)\n 3) Tools to remove garage door hardware (sockets, impact driver) *\n 4) [Heat gun](https://www.eastwood.com/eastwood-1500w-heat-gun-with-lcd-display.html)* this is the one I used, amazon has them for as little as 20$\n 5) [Spray adhesive](https://www.amazon.com/Gorilla-6314410-11oz-Spray-Adhesive/dp/B07MY28DYX) (3-4 cans worth depending on brand and quality) *\n 6) [Chemical cartridge mask](https://www.amazon.com/Respirator-Mask-Facepiece-Protection-Professional/dp/B083GY24WS) * \n   * These items are only required if you decide to follow me step by step - I've decided to use spray adhesive to avoid sagging insulation and increase adhesion surface which in theory should help me with better thermal insulation and heat exchange. Since I'll assume that you'll be spraying adhesive, please get a high-quality chemical cartridge respirator (NOT PARTICULATE MASK) as your garage doors will be down and you'll have no ventilation what so ever. I've used a heat gun to activate the adhesive in the double-sided tape, which might not be required for most depending on the time of installation, but given sub-zero temperatures outside, my garage door was getting fairly cold and the adhesive was sometimes peeling off instead of sticking. A quick sweep with the heat gun would prevent this issue.\n\nStart off with cleaning off the garage door. I've tackled it with an All-purpose degreaser followed by rubbing alcohol to remove any kind of oils that may have accumulated on the doors. Mine has a stamped day of installation in 97, so they had tons of grime from 23 years of use. [Image 1](https://imgur.com/Depx5Ei)\n\nNext is laying out the double-sided tape within the frames of your door and the surfaces that it should stick to - I've divided every door panel into quarters and made 4 rectangles of tape. [Image 2](https://imgur.com/iehGAEt) [Image 3](https://imgur.com/q2GDyEX) [Image 4](https://imgur.com/DOntE5P)\n After installation, I was still left with a lot of tape so I'd advise using it all up by sticking some slantwise in the rectangles to get better adhesion to the door.\n\nNext is the choice of installation you're trying to do - You can cut around every hinge on the door or remove the bolts holding the hardware in. I've chosen the latter because I've felt comfortable with removing the screws on the hinges one at a time (see [Image 5](https://imgur.com/WULbkma) &amp; [Image 6](https://imgur.com/jDdA6Mg)) and then installing them back on the top. The added pressure from the hinges being secured definitely helped with achieving a uniform look and quality installation, which is obviously subject to your own personal preference and how you tackle the install.\n\nAfter finishing the framing of the panels with the tape, I began removing the screws of the hinges holding the door together one by one as I started adhering the insulation to the door.  Next, I removed the backing of the double-sided tape and started spraying the adhesive. I've begun with spraying the whole rectangle and then working the insulation into the garage door with the seam roller - AVOID SPRAYING LARGE SURFACES WITH ADHESIVE - the brand of spray adhesive I've used tended to dry very quickly, especially due to low temperatures outside and the actual door panels, so try to divide the rectangle into another 3 portions when spraying it - cover about 16 inches of the surface with the adhesive and then use the seam roller to adhere it to the surface. Proceed to do this until you're at the next hinge, then resecure the hardware that you've removed before, and remove the following hinges and continue with the process. [Image 7](https://imgur.com/rTLMz55)\n\nAfter about halfway through the first panel, I've noticed that the double-sided tape although sticks very well to the insulation, lacks hold to the door panel. This is when the heat gun comes in. I've applied high heat from a safe distance to avoid damage to any insulation that's already installed, and reactivate the adhesive in the tape. This helped a bunch as once the insulation adheres to the top of the rectangle of tape, using the seam roller in downwards motion produces just enough stretch in the insulation to prevent air pockets and achieve the uniform look. [Image 8](https://imgur.com/zsWjBb0) [Image 9](https://imgur.com/3ntRZeo)\n\nOnce you are done with one panel, you might have to do some trimming at the bottom and the ends - I've chosen to align the top of the roll of insulation to the top of my door panel, thus I've had about 1/4\" of insulation sticking out at the bottom overlapping the lower panel. Using an X-Acto knife (Or utility knife) I've used the natural groove in between the panels to guide the blade evenly down the edge of it, making trimming it super easy. The ends were about the same idea, except I've used the edge of the panel as a guide to making the cut. \n\nRinse and repeat 3 more times and you have a garage door that's been insulated fairly well, and the difference is noticeable. [Image 10](https://imgur.com/89yCsIZ)\nMy garage ambient temperature is about 40 degrees prior to installation and it takes about 15 minutes for my heater to heat it up to 75 degrees, and it kicks back on when it drops to high 60's, which takes 5 minutes to get back to the set temperature. which usually occurs every 25 minutes or so depending on the activity in the garage as well as outside temperature/winds. With the insulation installed, it takes about 11 minutes to heat up from ambient temperature, and I've gone almost 50 minutes without the heater kicking back on again to heat up space, and when it does it takes about 3 minutes to reheat it up, so the difference is there, although it is subject to your installation and environment you're working in.\n\nCouple of notes I want to add:\n * The insulation is very easy to rip and get dirty given I've decided to use the white variant to achieve better looks. You are able to stretch it during installation but avoid any sharp surfaces dragging along it, as I've made a few tears installing my supports. If you are planning on construction work in the garage, I'd leave this to the very end to avoid any kind of damage to the insulation.\n\n * It is very helpful to have someone use the seam roller while you spray the door with adhesive and hold the roll of the insulation in place - Working alone you tend to let go of the insulation and it drops and unrolls on the floor, prolonging the process.\n\n* Adding insulation adds weight to the door. While you may not think it's much, your garage door opener sure will feel it, thus once you're done with insulating it, you're gonna wanna spend some time and re-balance your door. There are guides online on how to do it, but you're working with a spring that's under tension (ranging from 100lbs to 200llbs and up)  and if you don't feel like you're knowledgeable enough to do it yourself, save some time and avoid injury by having someone equipped with the tools and experience to do it. A quick online quote from a local garage door specialist came back at $100 dollars, but I've decided to do it myself. Very few adjustments needed to be made, but the garage door is opening even smoother than ever and I'm not overworking the motor that has been replaced recently thus prolonging its life as well. \n\n* By no means, am I a professional, thus take my advice with a grain of salt - I've used my understanding of insulation and heat transfer to install this kit, from using extra adhesive to avoiding cuts in the insulation and instead I installed it under the hardware. It is my understanding that air pockets are a very effective way of insulating an object, but I felt that a better contact area will be a better choice for me and my own application. You might experience geometry changes in the garage door and have other issues by removing the rollers, but nothing like that occurred in my scenario, but be wary of the possible outcomes.", "link": "https://www.reddit.com/r/DIY/comments/jzc9gd/garage_door_insulation/", "origin": "Reddit", "suborigin": "DIY", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "garage door insulation /!/ i haven't seen a tutorial on how to insulate the garage doors that i have - the majority of the guides online use thick panels of foam on the doors as they have a different set up from mine and although they will always have a better r-value, unfortunately, do not work with the garage door that i have.\ni've linked all of the items that i've used in this install bellow - the insulation kit itself that i've used is [this](https://www.amazon.com/gp/product/b07txn6f54) - which at the time of install ran me $110.00\n[link to imgur album](https://imgur.com/a/2rv4dfq)\ni highly recommend for two people to be partaking in the installation - it minimizes errors that i've made by installing alone. installation time was about 4-5 hours, which i'm sure can be cut in half with some help. \nthe actual insulation comes in the with of 21\" and 1/4ths, and standard garage door length being 16'x21\", you have plenty of room for error which is nice.\n\nfor this install, i've personally used an assortment of different tools to help make it look as nice as possible, but not all of them are required for your install apart from the insulation and double-sided tape that came in the package, i've used the following tools:\n 1) [x-acto knife (or utility knife)](https://www.amazon.com/x-acto-xz3601-x-acto-knife-safety/dp/b005krswm6)\n 2) [seam roller](https://www.amazon.com/4-inch-printmaking-application-original-version/dp/b07ydnksh6)\n 3) tools to remove garage door hardware (sockets, impact driver) *\n 4) [heat gun](https://www.eastwood.com/eastwood-1500w-heat-gun-with-lcd-display.html)* this is the one i used, amazon has them for as little as 20$\n 5) [spray adhesive](https://www.amazon.com/gorilla-6314410-11oz-spray-adhesive/dp/b07my28dyx) (3-4 cans worth depending on brand and quality) *\n 6) [chemical cartridge mask](https://www.amazon.com/respirator-mask-facepiece-protection-professional/dp/b083gy24ws) * \n   * these items are only required if you decide to follow me step by step - i've decided to use spray adhesive to avoid sagging insulation and increase adhesion surface which in theory should help me with better thermal insulation and heat exchange. since i'll assume that you'll be spraying adhesive, please get a high-quality chemical cartridge respirator (not particulate mask) as your garage doors will be down and you'll have no ventilation what so ever. i've used a heat gun to activate the adhesive in the double-sided tape, which might not be required for most depending on the time of installation, but given sub-zero temperatures outside, my garage door was getting fairly cold and the adhesive was sometimes peeling off instead of sticking. a quick sweep with the heat gun would prevent this issue.\n\nstart off with cleaning off the garage door. i've tackled it with an all-purpose degreaser followed by rubbing alcohol to remove any kind of oils that may have accumulated on the doors. mine has a stamped day of installation in 97, so they had tons of grime from 23 years of use. [image 1](https://imgur.com/depx5ei)\n\nnext is laying out the double-sided tape within the frames of your door and the surfaces that it should stick to - i've divided every door panel into quarters and made 4 rectangles of tape. [image 2](https://imgur.com/iehgaet) [image 3](https://imgur.com/q2gdyex) [image 4](https://imgur.com/donte5p)\n after installation, i was still left with a lot of tape so i'd advise using it all up by sticking some slantwise in the rectangles to get better adhesion to the door.\n\nnext is the choice of installation you're trying to do - you can cut around every hinge on the door or remove the bolts holding the hardware in. i've chosen the latter because i've felt comfortable with removing the screws on the hinges one at a time (see [image 5](https://imgur.com/wulbkma) &amp; [image 6](https://imgur.com/jdda6mg)) and then installing them back on the top. the added pressure from the hinges being secured definitely helped with achieving a uniform look and quality installation, which is obviously subject to your own personal preference and how you tackle the install.\n\nafter finishing the framing of the panels with the tape, i began removing the screws of the hinges holding the door together one by one as i started adhering the insulation to the door.  next, i removed the backing of the double-sided tape and started spraying the adhesive. i've begun with spraying the whole rectangle and then working the insulation into the garage door with the seam roller - avoid spraying large surfaces with adhesive - the brand of spray adhesive i've used tended to dry very quickly, especially due to low temperatures outside and the actual door panels, so try to divide the rectangle into another 3 portions when spraying it - cover about 16 inches of the surface with the adhesive and then use the seam roller to adhere it to the surface. proceed to do this until you're at the next hinge, then resecure the hardware that you've removed before, and remove the following hinges and continue with the process. [image 7](https://imgur.com/rtlmz55)\n\nafter about halfway through the first panel, i've noticed that the double-sided tape although sticks very well to the insulation, lacks hold to the door panel. this is when the heat gun comes in. i've applied high heat from a safe distance to avoid damage to any insulation that's already installed, and reactivate the adhesive in the tape. this helped a bunch as once the insulation adheres to the top of the rectangle of tape, using the seam roller in downwards motion produces just enough stretch in the insulation to prevent air pockets and achieve the uniform look. [image 8](https://imgur.com/zswjbb0) [image 9](https://imgur.com/3ntrzeo)\n\nonce you are done with one panel, you might have to do some trimming at the bottom and the ends - i've chosen to align the top of the roll of insulation to the top of my door panel, thus i've had about 1/4\" of insulation sticking out at the bottom overlapping the lower panel. using an x-acto knife (or utility knife) i've used the natural groove in between the panels to guide the blade evenly down the edge of it, making trimming it super easy. the ends were about the same idea, except i've used the edge of the panel as a guide to making the cut. \n\nrinse and repeat 3 more times and you have a garage door that's been insulated fairly well, and the difference is noticeable. [image 10](https://imgur.com/89ycsiz)\nmy garage ambient temperature is about 40 degrees prior to installation and it takes about 15 minutes for my heater to heat it up to 75 degrees, and it kicks back on when it drops to high 60's, which takes 5 minutes to get back to the set temperature. which usually occurs every 25 minutes or so depending on the activity in the garage as well as outside temperature/winds. with the insulation installed, it takes about 11 minutes to heat up from ambient temperature, and i've gone almost 50 minutes without the heater kicking back on again to heat up space, and when it does it takes about 3 minutes to reheat it up, so the difference is there, although it is subject to your installation and environment you're working in.\n\ncouple of notes i want to add:\n * the insulation is very easy to rip and get dirty given i've decided to use the white variant to achieve better looks. you are able to stretch it during installation but avoid any sharp surfaces dragging along it, as i've made a few tears installing my supports. if you are planning on construction work in the garage, i'd leave this to the very end to avoid any kind of damage to the insulation.\n\n * it is very helpful to have someone use the seam roller while you spray the door with adhesive and hold the roll of the insulation in place - working alone you tend to let go of the insulation and it drops and unrolls on the floor, prolonging the process.\n\n* adding insulation adds weight to the door. while you may not think it's much, your garage door opener sure will feel it, thus once you're done with insulating it, you're gonna wanna spend some time and re-balance your door. there are guides online on how to do it, but you're working with a spring that's under tension (ranging from 100lbs to 200llbs and up)  and if you -----> do !!! n't feel like you're knowledgeable enough to -----> do !!!  -----> it !!!  -----> yourself !!! , save some time and avoid injury by having someone equipped with the tools and experience to -----> do !!!  -----> it !!! . a quick online quote from a local garage door specialist came back at $100 dollars, but i've decided to do it myself. very few adjustments needed to be made, but the garage door is opening even smoother than ever and i'm not overworking the motor that has been replaced recently thus prolonging its life as well. \n\n* by no means, am i a professional, thus take my advice with a grain of salt - i've used my understanding of insulation and heat transfer to install this kit, from using extra adhesive to avoiding cuts in the insulation and instead i installed it under the hardware. it is my understanding that air pockets are a very effective way of insulating an object, but i felt that a better contact area will be a better choice for me and my own application. you might experience geometry changes in the garage door and have other issues by removing the rollers, but nothing like that occurred in my scenario, but be wary of the possible outcomes.", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": "self", "medialink": "https://www.reddit.com/r/DIY/comments/jzc9gd/garage_door_insulation/", "identifyer": 264442, "year": "2020"}], "name": "yourselfDIY2020"}