{"interestingcomments": [{"autor": "becstainscoop", "selftext": "Hi, so I have just developed my second roll of film (Agfapan APX 100 -out of date by 10 years), the first roll came out seemingly white so i developed the second roll for 2 more minutes (8 mins) and the whole roll apart from the first 2 photos has come out completely white. Can anyone tell me where I am going wrong? \nI am using a Pentax ME super; i must add that the door popped open on shot 3 but this is clear on the film as 2 shots are completely black. \n\nThanks", "title": "Developed second roll of film and it came out white", "num-comments": 12, "score": 0, "date": "2018-04-17 21:38:38", "content": "Developed second roll of film and it came out white /!/ Hi, so I have just developed my second roll of film (Agfapan APX 100 -out of date by 10 years), the first roll came out seemingly white so -----> -----> i !!!  developed !!!  the second roll for 2 more m-----> i !!! nutes (8 m-----> i !!! ns) and the whole roll apart from the f-----> i !!! rst 2 photos has come out completely wh-----> i !!! te. Can anyone tell me where I am going wrong? \nI am using a Pentax ME super; i must add that the door popped open on shot 3 but this is clear on the film as 2 shots are completely black. \n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8d0azx/developed_second_roll_of_film_and_it_came_out/"}, {"autor": "mysterious_el_barto", "selftext": "I'm reading Susan Sontag's \"On photography\" and i was wondering if there are any other good reads i could find. I'm interested both in theoretical aspects as well in practical, like how i can improve my framing for example. ", "title": "Any good books on photography?", "num-comments": 13, "score": 5, "date": "2018-03-25 15:21:02", "content": "Any good books on photography? /!/ I'm reading Susan Sontag's \"On photography\" and i was wondering if there are any other good reads i could find. -----> I !!! 'm interested both in theoretical aspects as well in practical, like how -----> i can improve !!!  my framing for example. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/871bf8/any_good_books_on_photography/"}, {"autor": "giovanna_d", "selftext": "Hey guys, \n\nI think most of you will have websites because you’re photographers. I really want to develop a website that contains all these features : gallery options, blog option, shop option. \n\nI have bought a domain through google, and I have tried bluehost and squarespace. Bluehost was too confusing for me, and squarespace was perfect but WAY too expensive as I am a student. Is there any way I can create a website for free or a minimum monthly payment (under $10 CAD) that has all these features? Can I add my domain into a free account for let’s say Wordpress or Wix? I’m such a novice and I need HELP ! ", "title": "Need help with my photography website - which host to choose?", "num-comments": 13, "score": 4, "date": "2018-03-03 15:12:19", "content": "Need help with my photography website - which host to choose? /!/ Hey guys, \n\nI think most of you will have websites because you’re photographers. I really want to develop a website that contains all these features : gallery options, blog option, shop option. \n\nI have bought a domain through google, and I have tried bluehost and squarespace. Bluehost was too confusing for me, and squarespace was perfect but WAY too expensive as I am a student. -----> I !!! s there any way -----> -----> I !!!  can create !!!  a website for free or a minimum monthly payment (under $10 CAD) that has all these features? Can I add my domain into a free account for let’s say Wordpress or Wix? I’m such a novice and I need HELP ! ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/81qo89/need_help_with_my_photography_website_which_host/"}, {"autor": "blackbeanburgerz", "selftext": "So, I picked up a film camera last summer, and I haven't stopped shooting since. In Baltimore it wasn't expensive for me to have my film developed because I didn't have to pay for scans - my friend had that covered. Now that I'm on exchange here in NYC and I need to pay for both developing and scanning, I realized my hobby could quickly bankrupt me. \n\nSo I'm wondering what the cheapest way for me to develop would be . Does anyone know a secret, amazing developer? Is there someone who might generously let me use their scanner?\n", "title": "Calling all NYC photographers! Broke college student in need of help/advice.", "num-comments": 8, "score": 1, "date": "2018-02-26 00:30:26", "content": "Calling all NYC photographers! Broke college student in need of help/advice. /!/ So, I picked up a film camera last summer, and I haven't stopped shooting since. In Baltimore it wasn't expensive for me to have my film developed because I didn't have to pay for scans - my friend had that covered. Now that I'm on exchange here in NYC and I need to pay for both developing and scanning, I realized my hobby could quickly bankrupt me. \n\nSo -----> I !!! 'm wondering what the cheapest way for -----> me to develop !!!  would be . Does anyone know a secret, amazing developer? Is there someone who might generously let me use their scanner?\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/808uyg/calling_all_nyc_photographers_broke_college/"}, {"autor": "the_arctic_monkey", "selftext": "Recently while visiting my family my uncle gave me a roll of film my grandfather shot in 1984 and asked me to develop it for him. I was pumped because one of my favorite aspects of analog photography is the ability to capture a moment and save it in a way that just doesn't translate to digital. I was expecting to get shots of daily life, my family members when they were younger or maybe even be able to look into a special moment that hadn't been seen or thought about in over 30 years. Instead I just got 12 photographs of gravestones and tombs at a local cemetery. I was a little let down to say the least. But what about you guys? Anyone else ever have a moment like this?", "title": "Best and worst found film experiences?", "num-comments": 8, "score": 5, "date": "2018-06-27 23:06:45", "content": "Best and worst found film experiences? /!/ Recently while visiting my family my uncle gave -----> me !!!  a roll of film my grandfather shot in 1984 and asked -----> -----> me !!!  to develop !!!  it for him. I was pumped because one of my favorite aspects of analog photography is the ability to capture a moment and save it in a way that just doesn't translate to digital. I was expecting to get shots of daily life, my family members when they were younger or maybe even be able to look into a special moment that hadn't been seen or thought about in over 30 years. Instead I just got 12 photographs of gravestones and tombs at a local cemetery. I was a little let down to say the least. But what about you guys? Anyone else ever have a moment like this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8ue9pv/best_and_worst_found_film_experiences/"}, {"autor": "NervousMammoth", "selftext": "Hey, all.\n\nI am primarily a Tri-X shooter. I used to shoot HP5 all the time, but wasn't loving the results.\n\nI have since heard, many times, that shooting HP5 at 1600 produces much better results. Looking at examples on Flickr, Delta 400 seems to produce the sort of results I'm looking for (higher contrast with deep blacks).\n\nSince it's hard for me to know exactly how film since I'm looking at digitized examples, I want to do an experiment myself to compare the results. I need some help preparing for this experiment.\n\nI have two rolls of HP5, and two rolls of Delta 400.\n\nMy plan was to shoot a roll of each at box speed, and then a roll of HP5 at 1600. What should I shoot the Delta at? I was thinking 1600 for consistency, but if Delta has an \"ideal\" speed (like HP5's 1600), I would rather shoot at that speed.\n\nSo, I guess my question is, what is the ideal speed for Delta 400?\n\nI will be developing in Rodinal, but I have not decided if I will do stand development or not. \n\nThoughts?\n\nTIA!", "title": "HP5 versus Delta question(s)", "num-comments": 4, "score": 3, "date": "2018-06-25 17:32:49", "content": "HP5 versus Delta question(s) /!/ Hey, all.\n\nI am primarily a Tri-X shooter. I used to shoot HP5 all the time, but wasn't loving the results.\n\nI have since heard, many times, that shooting HP5 at 1600 produces much better results. Looking at examples on Flickr, Delta 400 seems to produce the sort of results I'm looking for (higher contrast with deep blacks).\n\nSince it's hard for me to know exactly how film since I'm looking at digitized examples, I want to do an experiment myself to compare the results. I need some help preparing for this experiment.\n\nI have two rolls of HP5, and two rolls of Delta 400.\n\nMy plan was to shoot a roll of each at box speed, and then a roll of HP5 at 1600. What should I shoot the Delta at? I was thinking 1600 for consistency, but if Delta has an \"ideal\" speed (like HP5's 1600), I would rather shoot at that speed.\n\nSo, -----> I !!!  guess my question is, what is the ideal speed for Delta 400?\n\n-----> -----> I !!!  will be developing !!!  in Rodinal, but -----> I !!!  have not decided if -----> I !!!  will do stand development or not. \n\nThoughts?\n\nTIA!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8tsfkw/hp5_versus_delta_questions/"}, {"autor": "ledge64", "selftext": "So I started 35mm film photography about a year ago. I have a Leica CL and so far I’m really enjoying rangefinders. I decided to look into medium format rangefinder cameras and discovered that they all use leaf shutter systems which are in the lens. The camera that really intrigued me was the Mamiya Press which is pretty much a black box with a bunch of attachments. I honestly think I can create a medium format camera to base off a certain lens system. I just don’t know which lenses I should base it off. Anyways if someone can point me into a set of lenses with a 1/500th shutter speed and possibly smaller lenses that would be great. I just don’t really know much about medium format. ", "title": "How hard would it be to make a medium format camera?", "num-comments": 17, "score": 1, "date": "2018-11-19 07:34:41", "content": "How hard would it be to make a medium format camera? /!/ So I started 35mm film photography about a year ago. I have a Leica CL and so far I’m really enjoying rangefinders. I decided to look into medium format rangefinder cameras and discovered that they all use leaf shutter systems which are in the lens. The camera that really intrigued me was the Mamiya Press which is pretty much a black box with a bunch of attachments. -----> I !!!  honestly think -----> -----> I !!!  can create !!!  a medium format camera to base off a certain lens system. I just don’t know which lenses I should base it off. Anyways if someone can point me into a set of lenses with a 1/500th shutter speed and possibly smaller lenses that would be great. I just don’t really know much about medium format. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9yen5m/how_hard_would_it_be_to_make_a_medium_format/"}, {"autor": "SuggestAPhotoProject", "selftext": "Hi gang!\n\nI accidentally recycled the instruction sheet that came with the kit I ordered from the FPP.  I have two rolls in the tank, and my chemistry all heated, and I’m ready to go.  I even have the development times, but I don’t specifically remember how much I need to increase the development time after each roll. \n\n\nI think I’m supposed to increase just the first developer by 4% after every roll I develop, but I’m not sure. \n\n\nDoes anyone happen to have a copy of the instructions laying around?  Or does anyone know what the unicolor rapid e6 kit calls for?\n\n\nThanks!", "title": "Question about the Unicolor Rapid E-6 development kit", "num-comments": 2, "score": 1, "date": "2018-11-18 05:14:29", "content": "Question about the Unicolor Rapid E-6 development kit /!/ Hi gang!\n\nI accidentally recycled the instruction sheet that came with the kit I ordered from the FPP.  I have two rolls in the tank, and my chemistry all heated, and I’m ready to go.  I even have the development times, but I don’t specifically remember how much I need to increase the development time after each roll. \n\n\n-----> I !!!  think -----> I !!! ’m supposed to increase just the first developer by 4% after every roll -----> -----> I !!!  develop !!! , but -----> I !!! ’m not sure. \n\n\nDoes anyone happen to have a copy of the instructions laying around?  Or does anyone know what the unicolor rapid e6 kit calls for?\n\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9y3gdx/question_about_the_unicolor_rapid_e6_development/"}, {"autor": "Natsukvshii", "selftext": "I developed my own color negative film last night for the first time but my scanner isn't functioning properly. Where can I send my developed rolls?", "title": "Do you guys know of a good lab to send uncut developed negatives to for scanning?", "num-comments": 14, "score": 1, "date": "2018-11-12 18:30:04", "content": "Do you guys know of a good lab to send uncut developed negatives to for scanning? /!/ -----> -----> I !!!  developed !!!  my own color negative film last night for the first time but my scanner isn't functioning properly. Where can I send my developed rolls?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9wgl5j/do_you_guys_know_of_a_good_lab_to_send_uncut/"}, {"autor": "osabe", "selftext": "I just found a couple rolls of Kodak Max 400 in a drawer in my grandparents house. A box nearby said expired in 2006 (the rolls weren't actually in the box).\n\nOne is probably exposed (there's no leader), and the other might not be (leader sticking out). \n\nIf I want to develop the exposed roll, should I develop at box speed or ask for it to be pushed?\n\nI was going to shoot the probably new roll with 1 stop of overexposure (at ISO 200). When I get it developed, should it be at box speed?", "title": "Shooting and developing expired film", "num-comments": 8, "score": 1, "date": "2018-07-31 17:50:26", "content": "Shooting and developing expired film /!/ I just found a couple rolls of Kodak Max 400 in a drawer in my grandparents house. A box nearby said expired in 2006 (the rolls weren't actually in the box).\n\nOne is probably exposed (there's no leader), and the other might not be (leader sticking out). \n\n-----> I !!! f -----> I !!!  want to develop the exposed roll, should -----> -----> I !!!  develop !!!  at box speed or ask for it to be pushed?\n\n-----> I !!!  was going to shoot the probably new roll with 1 stop of overexposure (at -----> I !!! SO 200). When I get it developed, should it be at box speed?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/93gph7/shooting_and_developing_expired_film/"}, {"autor": "Kollinphoto", "selftext": "I learned something about home developing today. I’m guessing a lot of people know about this but I wanted to share for anyone who\n\nAfter developing a role of black and white film I found my negatives had what looked like light leaks on the sprockets. I went to my local repair shop with the negatives and the tech took one look at then and asked if I developed at home. I said yes and the tech said that those are not light leaks, it’s fixer that was still on my reels. He told me that I need to wash my reels thoroughly to keep this from happening. Normally I wash my reels but I guess it wasn’t enough.  He was confident that this was the solution because the burning didn’t bleed into the image area. \n\n[example ](https://imgur.com/a/XK66D)", "title": "Home Developing", "num-comments": 14, "score": 8, "date": "2018-02-18 16:43:54", "content": "Home Developing /!/ I learned something about home developing today. I’m guessing a lot of people know about this but I wanted to share for anyone who\n\nAfter developing a role of black and white film I found my negatives had what looked like light leaks on the sprockets. -----> I !!!  went to my local repair shop with the negatives and the tech took one look at then and asked if -----> -----> I !!!  developed !!!  at home. I said yes and the tech said that those are not light leaks, it’s fixer that was still on my reels. He told me that I need to wash my reels thoroughly to keep this from happening. Normally I wash my reels but I guess it wasn’t enough.  He was confident that this was the solution because the burning didn’t bleed into the image area. \n\n[example ](https://imgur.com/a/XK66D)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7yfdrh/home_developing/"}, {"autor": "Alpha_Kangaroo", "selftext": "Hello! I just started taking a B&amp;W film photography class, my aunt had an old Canon T70 and I like how it feels a lot. Our first project is landscapes. We are using Kodak TMax 400 (so I've been using ISO 400), shutter speed is set at 60 and I've been using a grey card to meter. The T70 has the split image rangefinder and microprism. I make sure everything is lined up and it looks clear but all the pictures turned out soft/blurry. Is it me or the camera? Should I try a different camera. If anyone could help I'd really appreciate it, thanks!\n\nEdit: another question I had was what makes cameras like the Canon AE-1 and Pentax K1000 the favorites of Analog photographers? Is it better than something like the Canon T70 or is it just preference? What would the difference between the Canon AE-1 and T70?\n\nAlso here is my picture I developed. \nhttps://imgur.com/gallery/IZI8B", "title": "Picture I took with Canon T70 are too soft or blurry.", "num-comments": 15, "score": 2, "date": "2018-02-07 19:36:40", "content": "Picture I took with Canon T70 are too soft or blurry. /!/ Hello! I just started taking a B&amp;W film photography class, my aunt had an old Canon T70 and I like how it feels a lot. Our first project is landscapes. We are using Kodak TMax 400 (so I've been using ISO 400), shutter speed is set at 60 and I've been using a grey card to meter. The T70 has the split image rangefinder and microprism. I make sure everything is lined up and it looks clear but all the pictures turned out soft/blurry. Is it me or the camera? Should I try a different camera. If anyone could help I'd really appreciate it, thanks!\n\nEdit: another question I had was what makes cameras like the Canon AE-1 and Pentax K1000 the favorites of Analog photographers? Is it better than something like the Canon T70 or is it just preference? What would the difference between the Canon AE-1 and T70?\n\nAlso here is my picture -----> -----> I !!!  developed !!! . \nhttps://imgur.com/gallery/IZI8B", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7vyqiy/picture_i_took_with_canon_t70_are_too_soft_or/"}, {"autor": "CaptCardboard", "selftext": "I'm just starting to take over black&amp;white development at the camera shop I work at, and I'm left to figure out my own way to be productive and consistent. I feel like I'm adequately doing the job matching up films with similar dev times, and keeping vigilant on my developer exhaustion, but I'm only just trying to scale up the way I develop the ocassional roll of film at home. I'm curious if any seasoned pros have any advice for hand developing film in a retail lab. Types of developers? Keeping track of dev times? Any way I can increase efficiency would be greatly appreciated!", "title": "Any tips for developing large quantities of different types of films?", "num-comments": 6, "score": 1, "date": "2018-11-06 03:44:06", "content": "Any tips for developing large quantities of different types of films? /!/ I'm just starting to take over black&amp;white development at the camera shop I work at, and I'm left to figure out my own way to be productive and consistent. -----> I !!!  feel like -----> I !!! 'm adequately doing the job matching up films with similar dev times, and keeping vigilant on my developer exhaustion, but -----> I !!! 'm only just trying to scale up the way -----> -----> I !!!  develop !!!  the ocassional roll of film at home. I'm curious if any seasoned pros have any advice for hand developing film in a retail lab. Types of developers? Keeping track of dev times? Any way I can increase efficiency would be greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9ukxzj/any_tips_for_developing_large_quantities_of/"}, {"autor": "mt_winston", "selftext": "Hello,\n\nI self-developed my black and white 35mm negatives, (I’ve done it numerous times) and for the first time, there is what I assume to be dust ALL over the negatives. Whether I print using an enlarger or I scan them, the white spots and squiggly lines appear on nearly every shot.\n\nI have retraced my steps countless times, and can’t figure out where the heck this all happened. As I said, I’ve developed in the same room before and I didn’t see this occur. So what changed?\n\nHas this happened to anyone before? Any ideas on how I may be able to fix this if at all possible?\n\nExampled: [https://imgur.com/O47iZrw](https://imgur.com/O47iZrw)\n\nThanks a lot in advance.", "title": "How to Remove Dust on Negatives", "num-comments": 5, "score": 1, "date": "2018-10-29 03:32:24", "content": "How to Remove Dust on Negatives /!/ Hello,\n\nI self-developed my black and white 35mm negatives, (I’ve done it numerous times) and for the first time, there is what I assume to be dust ALL over the negatives. Whether I print using an enlarger or I scan them, the white spots and squiggly lines appear on nearly every shot.\n\nI have retraced my steps countless times, and can’t figure out where the heck this all happened. As -----> I !!!  said, -----> -----> I !!! ’ve developed !!!  in the same room before and -----> I !!!  didn’t see this occur. So what changed?\n\nHas this happened to anyone before? Any ideas on how I may be able to fix this if at all possible?\n\nExampled: [https://imgur.com/O47iZrw](https://imgur.com/O47iZrw)\n\nThanks a lot in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9s9nyv/how_to_remove_dust_on_negatives/"}, {"autor": "SmoothFellas", "selftext": "[Link to the photos](https://imgur.com/gallery/F5r6wxL). I am new to analog photography! \n\nHey  Analog Community  I need some help: I want to know what's wrong with this pictures I have linked. Who is the culprit ? I have been taking photos for almost 3 years now, so I know about proper exposure, manual shooting etc.\n\nBut recently ( about 6 months ago) I got interested in analog photography, I inherited a Pentax K1000, with a 45mm lens. I got some Tri-X and 400 Ultramax rolls and a Fuji 400, and started shooting away. I developed the fuji roll in the US, in the Darkroom. Decent develop, pictures turned out well exposed and quality of scan was what I paid for. I moved to Spain about 3 months ago, and needed a place to develop film. I gave this *reputable place* two rolls: a Tri-X and an Ultramax. 15 Euros for the BW develop + scanning and 9 Euros for the Color develop+ scanning. What they gave me back was not what I expected.\n\nFirst I noticed the scans where 1M or less scans ( not what they advertised). But I also noticed that the negatives as well where totally **f'ed up.** I know that I should not open the back of the camera- so I haven't. I have a UV filter for the lens, and the Pentax K1000's exposure meter is fool proof. Some of the photos you will see are \"perfectly\" \\[ in the sense of the camera is doing what it is supposed to\\] shot, perfect contrast, darks and whites - but other's seem like a huge fog has overtaken whatever place I was in.\n\n    So?  Who killed my rolls?   \n\nWas it **Mr. Developing** process with some obscure mess up?\n\nOr **Mrs. Scanner** process with very low quality scans?\n\nWas it the **Col. Lens** with some fungus?\n\nOr was it **Dr.. Camera** with some backlight?\n\nOr was it Me - **SmoothFellas**\\- all along- not knowing what the sh\\*t I'm doing?\n\nI ask because some of them look good, and other are simply indiscernible images, some of them have a small light square in the frame. Most of this days where very sunny to some clouds in the sky days. Shutter speeds from 1000 to 60.\n\nThank you all in advance :)", "title": "Camera Clue: Can anyone help me out and tell me what's wrong with this photos I got developed?", "num-comments": 30, "score": 1, "date": "2018-10-25 14:13:20", "content": "Ca-----> me !!! ra Clue: Can anyone help -----> me !!!  out and tell -----> me !!!  what's wrong with this photos -----> I got developed !!! ? /!/ [Link to the photos](https://imgur.com/gallery/F5r6wxL). I am new to analog photography! \n\nHey  Analog Community  I need some help: I want to know what's wrong with this pictures I have linked. Who is the culprit ? I have been taking photos for almost 3 years now, so I know about proper exposure, manual shooting etc.\n\nBut recently ( about 6 months ago) I got interested in analog photography, I inherited a Pentax K1000, with a 45mm lens. I got some Tri-X and 400 Ultramax rolls and a Fuji 400, and started shooting away. I developed the fuji roll in the US, in the Darkroom. Decent develop, pictures turned out well exposed and quality of scan was what I paid for. I moved to Spain about 3 months ago, and needed a place to develop film. I gave this *reputable place* two rolls: a Tri-X and an Ultramax. 15 Euros for the BW develop + scanning and 9 Euros for the Color develop+ scanning. What they gave me back was not what I expected.\n\nFirst I noticed the scans where 1M or less scans ( not what they advertised). But I also noticed that the negatives as well where totally **f'ed up.** I know that I should not open the back of the camera- so I haven't. I have a UV filter for the lens, and the Pentax K1000's exposure meter is fool proof. Some of the photos you will see are \"perfectly\" \\[ in the sense of the camera is doing what it is supposed to\\] shot, perfect contrast, darks and whites - but other's seem like a huge fog has overtaken whatever place I was in.\n\n    So?  Who killed my rolls?   \n\nWas it **Mr. Developing** process with some obscure mess up?\n\nOr **Mrs. Scanner** process with very low quality scans?\n\nWas it the **Col. Lens** with some fungus?\n\nOr was it **Dr.. Camera** with some backlight?\n\nOr was it Me - **SmoothFellas**\\- all along- not knowing what the sh\\*t I'm doing?\n\nI ask because some of them look good, and other are simply indiscernible images, some of them have a small light square in the frame. Most of this days where very sunny to some clouds in the sky days. Shutter speeds from 1000 to 60.\n\nThank you all in advance :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9rao43/camera_clue_can_anyone_help_me_out_and_tell_me/"}, {"autor": "Karmajuj", "selftext": "just as the title says.\n\nthis was for a commissioned shoot. i was told that shooting fuji c200 at 100 would be okay. it would make the photos a little flat overall which i don’t mind.\n\nis what i was told true? should i develop at 200? will my photos be ok? ", "title": "just shot fuji c200 at 100 iso. can i develop it at 200 and still be ok?", "num-comments": 13, "score": 1, "date": "2018-10-21 02:08:25", "content": "just shot fuji c200 at 100 iso. can -----> -----> i !!!  develop !!!  -----> i !!! t at 200 and st-----> i !!! ll be ok? /!/ just as the title says.\n\nthis was for a commissioned shoot. i was told that shooting fuji c200 at 100 would be okay. it would make the photos a little flat overall which i don’t mind.\n\nis what i was told true? should i develop at 200? will my photos be ok? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9pzxry/just_shot_fuji_c200_at_100_iso_can_i_develop_it/"}, {"autor": "klnadler", "selftext": "I've been developing my own film and have several rolls that need to be scanned and have tried several methods to scan them such as using a macro lens on my dslr and using extension tubes, but the quality and color has not been that great. What are some ways to improve the color and quality of my scans", "title": "Scanning 35mm", "num-comments": 10, "score": 3, "date": "2018-06-09 15:52:59", "content": "Scanning 35mm /!/ -----> -----> I !!! 've been developing !!!  my own film and have several rolls that need to be scanned and have tried several methods to scan them such as using a macro lens on my dslr and using extension tubes, but the quality and color has not been that great. What are some ways to improve the color and quality of my scans", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8ptoqn/scanning_35mm/"}, {"autor": "d3adbor3d2", "selftext": "which bw film would you recommend for portraiture? also, i will be developing with a tray using rodinal and rapid fix. is there a better dev/fix combo that you can think of? i've only done paper negatives so far with this size since i'm still trying to get decent with it. ", "title": "need help with 8x10 bw film", "num-comments": 7, "score": 2, "date": "2018-06-07 17:26:23", "content": "need help with 8x10 bw film /!/ which bw film would you recommend for portraiture? also, -----> -----> i !!!  w-----> i !!! ll be develop-----> i !!! ng !!!  w-----> i !!! th a tray us-----> i !!! ng rod-----> i !!! nal and rap-----> i !!! d f-----> i !!! x. is there a better dev/fix combo that you can think of? i've only done paper negatives so far with this size since i'm still trying to get decent with it. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8pc79d/need_help_with_8x10_bw_film/"}, {"autor": "m00dawg", "selftext": "Just got back from a backpacking trip where I shot some large format as well as some 35mm (mostly from the roadtrip up and back) in FP4. I developed in everything XTOL 1:1 for 20 minutes. The results seem to be negatives with a good density overall. Scanned though, they look...kinda weird? Like both flat yet with high contrast somehow:\n\nhttps://imgur.com/a/l2akK0Q\n\nI've had decent results with FP4 before and based on those results opted to go with it over Delta 100, though those comparisons were using ID-11 and DDX respectively. Thinking maybe XTOL isn't a great combo for this film when rated at box speed for landscapes? I really like the idea of XTOL though (for it's ability to develop at film speed, it's economy and it being less horrible for the environment) and am trying to find something to pair it to.\n\nThinking about trying Delta 100 or TMAX in the future with it but thought I'd see what thoughts folks might have? I normally soup HP5 in HC-110 so I can go that route too. Trying to avoid ID-11 or DDX since the former is a bit of a pain to mix up and the latter is expensive.", "title": "Figuring Out FP4 w/ XTOL", "num-comments": 2, "score": 5, "date": "2018-05-13 21:46:08", "content": "Figuring Out FP4 w/ XTOL /!/ Just got back from a backpacking trip where I shot some large format as well as some 35mm (mostly from the roadtrip up and back) in FP4. -----> -----> I !!!  developed !!!  in everything XTOL 1:1 for 20 minutes. The results seem to be negatives with a good density overall. Scanned though, they look...kinda weird? Like both flat yet with high contrast somehow:\n\nhttps://imgur.com/a/l2akK0Q\n\nI've had decent results with FP4 before and based on those results opted to go with it over Delta 100, though those comparisons were using ID-11 and DDX respectively. Thinking maybe XTOL isn't a great combo for this film when rated at box speed for landscapes? I really like the idea of XTOL though (for it's ability to develop at film speed, it's economy and it being less horrible for the environment) and am trying to find something to pair it to.\n\nThinking about trying Delta 100 or TMAX in the future with it but thought I'd see what thoughts folks might have? I normally soup HP5 in HC-110 so I can go that route too. Trying to avoid ID-11 or DDX since the former is a bit of a pain to mix up and the latter is expensive.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8j7963/figuring_out_fp4_w_xtol/"}, {"autor": "Natsukvshii", "selftext": "Hey guys! So I’ve developed maybe 5-6 rolls of 35mm and about 3-4 rolls of 120 film by now. The chemistry I’m using was mixed 11/20/2018 and I haven’t used it in about a week and a half so it’s been sitting undisturbed. I store them in glass amber bottles in the basement of my house in a dark spot and I grabbed the developer earlier and I noticed some weird stuff floating around in it. It was some thin strips of darkness, I didn’t get a good look at it but when I mixed the bottle they went away. Could it be that the chemistry is just separating? Or is my developer dead and I should get new chems? Does anyone know what it could be? ", "title": "Question about c-41 developer", "num-comments": 8, "score": 1, "date": "2018-12-27 18:35:56", "content": "Question about c-41 developer /!/ Hey guys! So -----> -----> I !!! ’ve developed !!!  maybe 5-6 rolls of 35mm and about 3-4 rolls of 120 film by now. The chemistry I’m using was mixed 11/20/2018 and I haven’t used it in about a week and a half so it’s been sitting undisturbed. I store them in glass amber bottles in the basement of my house in a dark spot and I grabbed the developer earlier and I noticed some weird stuff floating around in it. It was some thin strips of darkness, I didn’t get a good look at it but when I mixed the bottle they went away. Could it be that the chemistry is just separating? Or is my developer dead and I should get new chems? Does anyone know what it could be? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aa1sra/question_about_c41_developer/"}, {"autor": "MickDubble", "selftext": "Looking to tap into the collective wisdom of this sub. I have a Patterson tank, containers, a sous vide, and the finest I’ll c-41 quart kit. I have developed a ton of black and white film before so no worries on loading.\n\nBut any other tips or cautions before I start? Few questions I have: Do I reuse or discard chemicals? For the ones I reuse, how many times can I use them before discarding? I’ve read that home dev will end up costing $1-2 per roll, how do I maximize the use of my chemicals? \n\nAny other pitfalls I should look out for?\n\nThanks in advance.", "title": "First time home developing C-41", "num-comments": 15, "score": 1, "date": "2018-12-22 02:29:21", "content": "First time home developing C-41 /!/ Looking to tap into the collective wisdom of this sub. I have a Patterson tank, containers, a sous vide, and the finest I’ll c-41 quart kit. -----> -----> I !!!  have developed !!!  a ton of black and white film before so no worries on loading.\n\nBut any other tips or cautions before I start? Few questions I have: Do I reuse or discard chemicals? For the ones I reuse, how many times can I use them before discarding? I’ve read that home dev will end up costing $1-2 per roll, how do I maximize the use of my chemicals? \n\nAny other pitfalls I should look out for?\n\nThanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a8gzvf/first_time_home_developing_c41/"}, {"autor": "theeohsegall", "selftext": "I know when developing pushed C-41, the rule is to add an extra 30 seconds to the development for each step that the film has been pushed, but I'm wondering if there is any kind of rule like that for black and white film. I couldn't find any kind of info on it.\n\nFor my case specifically, I'll be developing HP5 Plus that was metered +2 stops at 1600.", "title": "A question about developing pushed black and white film", "num-comments": 3, "score": 1, "date": "2018-10-16 18:01:32", "content": "A question about developing pushed black and white film /!/ I know when developing pushed C-41, the rule is to add an extra 30 seconds to the development for each step that the film has been pushed, but I'm wondering if there is any kind of rule like that for black and white film. I couldn't find any kind of info on it.\n\nFor my case specifically, -----> -----> I !!! 'll be developing !!!  HP5 Plus that was metered +2 stops at 1600.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9oq3jy/a_question_about_developing_pushed_black_and/"}, {"autor": "willmeggy", "selftext": "I recently picked up a Coolscan V ED for a pretty good deal, but didn't thoroughly research it before buying it. When I got home, I created a Windows XP virtual machine and installed Nikon scan. My test scans look amazing, but it is such a hassle to use. It is definitely an upgrade from my v550, but the software is just a pain to use. What do you guys suggest? I've looked at Silverado and Vuescan, but it will be hard to justify buying those when I already have the v550. I'm also considering just selling it, as I have all of the original packaging and manuals. ", "title": "Nikon Coolscan V ED Question", "num-comments": 7, "score": 1, "date": "2018-10-14 13:25:46", "content": "Nikon Coolscan V ED Question /!/ I recently picked up a Coolscan V ED for a pretty good deal, but didn't thoroughly research it before buying it. When -----> I !!!  got home, -----> -----> I !!!  created !!!  a Windows XP virtual machine and installed Nikon scan. My test scans look amazing, but it is such a hassle to use. It is definitely an upgrade from my v550, but the software is just a pain to use. What do you guys suggest? I've looked at Silverado and Vuescan, but it will be hard to justify buying those when I already have the v550. I'm also considering just selling it, as I have all of the original packaging and manuals. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9o2osz/nikon_coolscan_v_ed_question/"}, {"autor": "vrotographer", "selftext": "I'm going to bring a roll or Superia 400 and maybe Portra 160 on my vacation later this summer but I'm not planning to develop them myself until I get the chemicals and a sous vide. How long can I let it sit before I should develop it?", "title": "How long can films go between being shot and being developed?", "num-comments": 10, "score": 2, "date": "2018-07-09 17:59:28", "content": "How long can films go between being shot and being developed? /!/ I'm going to bring a roll or Superia 400 and maybe Portra 160 on my vacation later this summer but I'm not planning to develop them myself until I get the chemicals and a sous vide. How long can -----> I !!!  let it sit before -----> -----> I !!!  should develop !!!  it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8xe8uu/how_long_can_films_go_between_being_shot_and/"}, {"autor": "Samspam126", "selftext": "I found a bunch of my Dad's old rolls of film and he asked me to develop them for him. I developed a roll using my normal technique (Ilfosol 3 @7.5 minutes) and they came out quite dark and, from what I can see, underdeveloped. Does anybody know a better developing time? I don't want to experiment too much because I don't want to risk loosing any film. The film is scannable, but just underdeveloped so a bit grainy and flat.", "title": "Developing old Tri-X 400?", "num-comments": 7, "score": 2, "date": "2018-07-04 11:42:04", "content": "Developing old Tri-X 400? /!/ -----> I !!!  found a bunch of my Dad's old rolls of film and he asked -----> me to develop !!!  them for him. I developed a roll using my normal technique (Ilfosol 3 @7.5 minutes) and they came out quite dark and, from what I can see, underdeveloped. Does anybody know a better developing time? I don't want to experiment too much because I don't want to risk loosing any film. The film is scannable, but just underdeveloped so a bit grainy and flat.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8w10cv/developing_old_trix_400/"}, {"autor": "Ibmackey", "selftext": "To my surprise, something provided resistance and I was able to remove a roll of film safely. I thought that after over a decade and a half the film must be ruined but I developed it anyways. Surprisingly, when it finished, o found pictures from when I was a baby!", "title": "I inherited my mother's Minolta X-700 which had not been used in years. Normally I would have owned it up right away and checked out the inside, but luckily this time decided to roll back the film just in case there was any.", "num-comments": 8, "score": 29, "date": "2018-07-02 09:09:47", "content": "I inherited my mother's Minolta X-700 which had not been used in years. Normally I would have owned it up right away and checked out the inside, but luckily this time decided to roll back the film just in case there was any. /!/ To my surprise, something provided resistance and I was able to remove a roll of film safely. -----> I !!!  thought that after over a decade and a half the film must be ruined but -----> -----> I !!!  developed !!!  it anyways. Surprisingly, when it finished, o found pictures from when I was a baby!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8vh8d6/i_inherited_my_mothers_minolta_x700_which_had_not/"}, {"autor": "razrphone", "selftext": "I recently got my first roll I shot with my k1000 developed and every single picture I took came out insanely shakey. I’ve developed rolls before and have taken many great photos. Even my shots in good lighting came out really bad. I used the camera’s lightmeter which seemed really accurate as the pictures came out how I thought they would, just insanely shakey. Although this is my first roll on the camera, I studied the camera the best I could. I kept super still when taking each photo. I assume this is a camera issue but I’m not sure. I’d like reddit’s advice on this.", "title": "Pentax K1000 blurry photos issue", "num-comments": 15, "score": 0, "date": "2018-07-14 06:00:17", "content": "Pentax K1000 blurry photos issue /!/ I recently got my first roll I shot with my k1000 developed and every single picture I took came out insanely shakey. -----> -----> I !!! ’ve developed !!!  rolls before and have taken many great photos. Even my shots in good lighting came out really bad. I used the camera’s lightmeter which seemed really accurate as the pictures came out how I thought they would, just insanely shakey. Although this is my first roll on the camera, I studied the camera the best I could. I kept super still when taking each photo. I assume this is a camera issue but I’m not sure. I’d like reddit’s advice on this.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8yr6ws/pentax_k1000_blurry_photos_issue/"}, {"autor": "Karmajuj", "selftext": "I shot a test roll of portra 400 on my Kodak vigilant junior six-20. This camera is really old and doesn’t have an iso setting so I’m not sure what it shot at, what should I tell my lab? ", "title": "What do I develop this at?", "num-comments": 4, "score": 3, "date": "2018-05-30 05:52:55", "content": "What do -----> -----> I !!!  develop !!!  this at? /!/ I shot a test roll of portra 400 on my Kodak vigilant junior six-20. This camera is really old and doesn’t have an iso setting so I’m not sure what it shot at, what should I tell my lab? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8n66v1/what_do_i_develop_this_at/"}, {"autor": "OpticalReality", "selftext": "I am new to photography with anything other than a smart phone and decided to dive into the world of analog!\n\nThere is a local camera store that has a surprisingly strong presence where I live that has a reasonable rate for developing and scanning film. They charge $10 for dev+scan and have a fast turnaround time of usually 24 hours or less. \n\nI have developed a few rolls of film with them and I am not too happy with the results. It seems as though many of the photos I have seen on /r/analog are much higher quality and I am curious if it is due to the lab or due to my technique. \n\nPlease see the comments for a link to some pictures (unedited) from a recent trip.", "title": "Thoughts on the scan quality of my local lab?", "num-comments": 25, "score": 1, "date": "2018-05-29 23:09:07", "content": "Thoughts on the scan quality of my local lab? /!/ I am new to photography with anything other than a smart phone and decided to dive into the world of analog!\n\nThere is a local camera store that has a surprisingly strong presence where I live that has a reasonable rate for developing and scanning film. They charge $10 for dev+scan and have a fast turnaround time of usually 24 hours or less. \n\n-----> -----> I !!!  have developed !!!  a few rolls of film with them and -----> I !!!  am not too happy with the results. It seems as though many of the photos I have seen on /r/analog are much higher quality and I am curious if it is due to the lab or due to my technique. \n\nPlease see the comments for a link to some pictures (unedited) from a recent trip.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8n3n53/thoughts_on_the_scan_quality_of_my_local_lab/"}, {"autor": "m00dawg", "selftext": "A few months ago I posted either here or maybe the IRC chat about an app I was working on to log films. I've added quite a few features since and thought it might be a good time to share what it does and maybe get some feedback:\n\nhttp://www.thefilmlog.org/\n\nIt's got some rough edges but it's decently usable. It's original purpose was for printing exposure sheets I could file away with my negatives themselves. But I've added more features to also help with tracking other things (like contact sheet exposure info, etc.).\n\nI've been using it for my own film logging needs for quite some time now. It's open source (written in Python-Flask and uses MariaDB/MySQL) so folks can clone the repo and set stuff up, but it may take some work to do (I don't have the Dockerfile quite ready to rock to make that easier, e.g.). I have a working version of it hosted up above. If folks want to try it out send me a PM and I can create an account therre (though expect bugs, no warranty, etc.).\n\nIt has met my needs pretty well (moreso once I add a working section for darkroom prints) but curious what folks might want to see in something like this which may be missing. Maybe other than a mobile app. Something I'd like to do but am taking an iterative approach for now and working on just a basic website (that plus I'm not a mobile developer, not yet anyway).", "title": "Added more stuff to The Film Log", "num-comments": 2, "score": 8, "date": "2018-05-28 16:58:42", "content": "Added more stuff to The Film Log /!/ A few months ago I posted either here or maybe the IRC chat about an app I was working on to log films. I've added quite a few features since and thought it might be a good time to share what it does and maybe get some feedback:\n\nhttp://www.thefilmlog.org/\n\nIt's got some rough edges but it's decently usable. It's original purpose was for printing exposure sheets I could file away with my negatives themselves. But I've added more features to also help with tracking other things (like contact sheet exposure info, etc.).\n\nI've been using it for my own film logging needs for quite some time now. It's open source (written in Python-Flask and uses MariaDB/MySQL) so folks can clone the repo and set stuff up, but it may take some work to do (I don't have the Dockerfile quite ready to rock to make that easier, e.g.). I have a working version of it hosted up above. If folks want to try it out send -----> me !!!  a PM and -----> I can create !!!  an account therre (though expect bugs, no warranty, etc.).\n\nIt has met my needs pretty well (moreso once I add a working section for darkroom prints) but curious what folks might want to see in something like this which may be missing. Maybe other than a mobile app. Something I'd like to do but am taking an iterative approach for now and working on just a basic website (that plus I'm not a mobile developer, not yet anyway).", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8mrk2k/added_more_stuff_to_the_film_log/"}, {"autor": "passaloutre", "selftext": "I'm playing around with some super old expired Kodak Pan film. I've developed it normally in D76 with no problems, but I wanted to try Rodinal stand dev on a roll that was slightly underexposed.\n\nI mixed 9 mL Rodinal with 900 mL water (about the max that my Paterson Tank can hold), agitated for the first 30 seconds, and let it sit for two hours with no additional agitation (I left the house and went out for a few pints). Then I got home and stopped, fixed, washed as normal.\n\nI scanned them last night and found that most of the frames have these alternating streaks that line up with the sprocket holes. A quick google told me that these are called surge marks and are associated with over-agitation. Additionally a lot of the frames have a gradient from light at the bottom to darker at the top, which seems to be a symptom of stratification of the developer due to under-agitation.\n\n[Here's an example frame](https://i.imgur.com/Lwyt04C.jpg)\n\n[And the negative](https://i.imgur.com/MCgCKsl.jpg)\n\nI'm very curious how I could have gotten symptoms of both under-agitation, and over-agitation. Does anybody have some recommendations for next time I try this?\n\n[This one's a good example of the gradient](https://i.imgur.com/CIIhAI8.jpg)\n\n[And its negative](https://i.imgur.com/qxLPKpr.jpg)", "title": "First time with stand developing: surge marks?", "num-comments": 0, "score": 1, "date": "2018-10-19 17:25:45", "content": "First time with stand developing: surge marks? /!/ I'm playing around with some super old expired Kodak Pan film. -----> -----> I !!! 've developed !!!  it normally in D76 with no problems, but -----> I !!!  wanted to try Rodinal stand dev on a roll that was slightly underexposed.\n\nI mixed 9 mL Rodinal with 900 mL water (about the max that my Paterson Tank can hold), agitated for the first 30 seconds, and let it sit for two hours with no additional agitation (I left the house and went out for a few pints). Then I got home and stopped, fixed, washed as normal.\n\nI scanned them last night and found that most of the frames have these alternating streaks that line up with the sprocket holes. A quick google told me that these are called surge marks and are associated with over-agitation. Additionally a lot of the frames have a gradient from light at the bottom to darker at the top, which seems to be a symptom of stratification of the developer due to under-agitation.\n\n[Here's an example frame](https://i.imgur.com/Lwyt04C.jpg)\n\n[And the negative](https://i.imgur.com/MCgCKsl.jpg)\n\nI'm very curious how I could have gotten symptoms of both under-agitation, and over-agitation. Does anybody have some recommendations for next time I try this?\n\n[This one's a good example of the gradient](https://i.imgur.com/CIIhAI8.jpg)\n\n[And its negative](https://i.imgur.com/qxLPKpr.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9plyaa/first_time_with_stand_developing_surge_marks/"}, {"autor": "leagasa", "selftext": "Hey guys,\n\nI developed my first roll and thought it went really well up until I scanned the photos. It looks like there are water streaks :(. Is this something photo-flow will help alleviate or should i just not use the film sponge?\n\n&amp;#x200B;\n\nThis is the sponge i'm using [https://www.bhphotovideo.com/c/product/63612-REG/Yankee\\_YASQ2\\_Film\\_Squeegee.html](https://www.bhphotovideo.com/c/product/63612-REG/Yankee_YASQ2_Film_Squeegee.html)", "title": "Water Streaks? Photo-Flo or just let it air dry without using film sponge thing", "num-comments": 11, "score": 1, "date": "2018-10-19 00:14:56", "content": "Water Streaks? Photo-Flo or just let it air dry without using film sponge thing /!/ Hey guys,\n\n-----> -----> I !!!  developed !!!  my first roll and thought it went really well up until -----> I !!!  scanned the photos. It looks like there are water streaks :(. Is this something photo-flow will help alleviate or should i just not use the film sponge?\n\n&amp;#x200B;\n\nThis is the sponge i'm using [https://www.bhphotovideo.com/c/product/63612-REG/Yankee\\_YASQ2\\_Film\\_Squeegee.html](https://www.bhphotovideo.com/c/product/63612-REG/Yankee_YASQ2_Film_Squeegee.html)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9pers5/water_streaks_photoflo_or_just_let_it_air_dry/"}, {"autor": "Verdoux", "selftext": "I developed my first roll from the [Canon AF35M II](https://www.lomography.com/magazine/227766-canon-af35m-ii-a-whole-lot-of-automation) and I was wondering when using the pre-focus switch does it also lock the exposure or is the exposure measured when you press the shutter button the second (and final time)? I noticed that the camera is next to useless in situations where there is a strong light source in the frame, so it would be really handy if the focus lock also locked the exposure.", "title": "Canon AF35M II exposure locking", "num-comments": 2, "score": 1, "date": "2018-10-18 12:56:51", "content": "Canon AF35M II exposure locking /!/ -----> -----> I !!!  developed !!!  my first roll from the [Canon AF35M -----> I !!! -----> I !!! ](https://www.lomography.com/magazine/227766-canon-af35m-ii-a-whole-lot-of-automation) and -----> I !!!  was wondering when using the pre-focus switch does it also lock the exposure or is the exposure measured when you press the shutter button the second (and final time)? I noticed that the camera is next to useless in situations where there is a strong light source in the frame, so it would be really handy if the focus lock also locked the exposure.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9p90cc/canon_af35m_ii_exposure_locking/"}, {"autor": "CynicalTwix", "selftext": "Quick question: I ran three rolls of provia through my c330 and self developed with the Arista kit. Each roll came out black, as if every shot was taken with the lens cap on. The shutter on the lens seems to be working fine, and every roll of 35mm I've developed in the chemicals has worked fine, so I'm kinda stuck troubleshooting why nothing works. Any ideas?", "title": "Mamiya c330 black slides?", "num-comments": 4, "score": 1, "date": "2018-05-09 17:04:49", "content": "Mamiya c330 black slides? /!/ Quick question: I ran three rolls of provia through my c330 and self developed with the Arista kit. Each roll came out black, as if every shot was taken with the lens cap on. The shutter on the lens seems to be working fine, and every roll of 35mm -----> -----> I !!! 've developed !!!  in the chemicals has worked fine, so -----> I !!! 'm kinda stuck troubleshooting why nothing works. Any ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8i7lq7/mamiya_c330_black_slides/"}, {"autor": "d3adbor3d2", "selftext": "just starting out on film and there's definitely a lot for me to learn. currently i'm developing my own film and scanning them. i'm familiar with post work in digital and right now, i do a lot of post work on my scans just to make them look decent. i want to know from you veterans how much post do you do on yours. and if you have tips on your developing process that books don't necessarily cover i'd be happy to hear them. i don't want this to become a debate on more vs. less photoshop/lightroom/darkroom, but rather people sharing their processes so i and others like me can learn a thing or two. \n\ni've only done ~10 rolls so far. none of the shots have taken my breath away. i have to admit most of my attempts have been filled with miscues, etc. just dumb mistakes that i take for granted from shooting digital (what do you mean i'm not the next robert frank?!? i'm walking the streets shooting film!!) i do plan on doing studio-lit portraits so i have a more accurate/controlled result. thanks for reading.   ", "title": "how much of it is post?", "num-comments": 7, "score": 2, "date": "2018-05-07 03:23:32", "content": "how much of it is post? /!/ just starting out on film and there's definitely a lot for me to learn. currently -----> -----> i !!! 'm develop-----> i !!! ng !!!  my own f-----> i !!! lm and scann-----> i !!! ng them. i'm familiar with post work in digital and right now, i do a lot of post work on my scans just to make them look decent. i want to know from you veterans how much post do you do on yours. and if you have tips on your developing process that books don't necessarily cover i'd be happy to hear them. i don't want this to become a debate on more vs. less photoshop/lightroom/darkroom, but rather people sharing their processes so i and others like me can learn a thing or two. \n\ni've only done ~10 rolls so far. none of the shots have taken my breath away. i have to admit most of my attempts have been filled with miscues, etc. just dumb mistakes that i take for granted from shooting digital (what do you mean i'm not the next robert frank?!? i'm walking the streets shooting film!!) i do plan on doing studio-lit portraits so i have a more accurate/controlled result. thanks for reading.   ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8hkkk6/how_much_of_it_is_post/"}, {"autor": "life_is_a_conspiracy", "selftext": "nan", "title": "I 3D printed a 50ft reel in the time it took me to develop 50ft of super 8 film.", "num-comments": 7, "score": 23, "date": "2018-08-20 03:56:52", "content": "-----> I !!!  3D printed a 50ft reel in the time it took -----> me to develop !!!  50ft of super 8 film.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/98qeuu/i_3d_printed_a_50ft_reel_in_the_time_it_took_me/"}, {"autor": "infected_funghi", "selftext": "I created a cheatsheet for simple luxmeters which dont have a 'display camera settings' function. Yes there are mobile apps for that purpose but cmon this is an analog community :D Also I personally prefer checking on a printed sheet I keep in my bag over twiddling around with my mobile phone. \n\n# What? \n\n*The sheet tells you your camera settings for optimal exposure. Rows represent aperture, colomns exposure time. Table entries are in lux.*\n\n# Usage:  \n\nUse luxmeter to determine brightness of the object. Find that number in the table which correspond to your ISO. For example: If you want to shoot with aperture 4.0 on ISO400 and measured 5000 lux, follow the 4.0 row until you hit the closest number to 5000. The colomn entry is your exposure time (in the example: 1/500)\n\n*Entries of the same color are in the same range. This has no specific meaning, it should just help you find your number easier.*  \n\n\n# There you go: \n\n[TABLE](https://docs.google.com/spreadsheets/d/e/2PACX-1vSv83S_o2rW44a81Bsh5XB-BMrFAZat6cGT4os-H3xGGBy6YW0t_oow7CziYS-LOiUbbXBYOyPrgzE7/pub?output=xlsx)", "title": "A cheat sheet for simple luxmeters", "num-comments": 1, "score": 6, "date": "2018-08-16 13:14:30", "content": "A cheat sheet for simple luxmeters /!/ -----> -----> I !!!  created !!!  a cheatsheet for simple luxmeters which dont have a 'display camera settings' function. Yes there are mobile apps for that purpose but cmon this is an analog community :D Also I personally prefer checking on a printed sheet I keep in my bag over twiddling around with my mobile phone. \n\n# What? \n\n*The sheet tells you your camera settings for optimal exposure. Rows represent aperture, colomns exposure time. Table entries are in lux.*\n\n# Usage:  \n\nUse luxmeter to determine brightness of the object. Find that number in the table which correspond to your ISO. For example: If you want to shoot with aperture 4.0 on ISO400 and measured 5000 lux, follow the 4.0 row until you hit the closest number to 5000. The colomn entry is your exposure time (in the example: 1/500)\n\n*Entries of the same color are in the same range. This has no specific meaning, it should just help you find your number easier.*  \n\n\n# There you go: \n\n[TABLE](https://docs.google.com/spreadsheets/d/e/2PACX-1vSv83S_o2rW44a81Bsh5XB-BMrFAZat6cGT4os-H3xGGBy6YW0t_oow7CziYS-LOiUbbXBYOyPrgzE7/pub?output=xlsx)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/97s6ci/a_cheat_sheet_for_simple_luxmeters/"}, {"autor": "HarryGBoi", "selftext": "Hey guys! Ive been developing for about half a year now and sometimes have come across this problem when scanning that my photos are super washed out tonally or have really uneven patches. I assumed it was uneven development so I got much more strict with my agitation methods, inverting 3-4 times every minute on the dime, but I've had the issue again in the past two rolls so I wanted to post here for help. \n\n[here is a link to some examples of photos with washed out tones as well as some with uneven development](http://imgur.com/gallery/XkP1WH8)\n\nI'm not exactly sure what the issue is, so I don't know how to search for help otherwise I would. It seems like there's evidence of uneven development on the picture taken in the water, you can see the right edge of the photo is significantly darker than the rest, and vertical streaking is a common symptom of uneven development. \n\nBut the other photo is washed out and the discoloration on the negative is so strange. I put up a zoomed in picture of the negative so that the discoloration is easily visible because in the other shot of the negatives it's kind of hard to make out. What confuses me about this is that the discolored bands/blobs run horizontally down the film instead of vertically, which can be kinda seen in the zoomed out photo of the negative strip\n\nIf anyone has experienced this before or has any advice, I would greatly appreciate it", "title": "Unsure what is causing my black and white negatives to look so washed out", "num-comments": 9, "score": 0, "date": "2018-08-15 19:44:39", "content": "Unsure what is causing my black and white negatives to look so washed out /!/ Hey guys! -----> -----> I !!! ve been developing !!!  for about half a year now and sometimes have come across this problem when scanning that my photos are super washed out tonally or have really uneven patches. I assumed it was uneven development so I got much more strict with my agitation methods, inverting 3-4 times every minute on the dime, but I've had the issue again in the past two rolls so I wanted to post here for help. \n\n[here is a link to some examples of photos with washed out tones as well as some with uneven development](http://imgur.com/gallery/XkP1WH8)\n\nI'm not exactly sure what the issue is, so I don't know how to search for help otherwise I would. It seems like there's evidence of uneven development on the picture taken in the water, you can see the right edge of the photo is significantly darker than the rest, and vertical streaking is a common symptom of uneven development. \n\nBut the other photo is washed out and the discoloration on the negative is so strange. I put up a zoomed in picture of the negative so that the discoloration is easily visible because in the other shot of the negatives it's kind of hard to make out. What confuses me about this is that the discolored bands/blobs run horizontally down the film instead of vertically, which can be kinda seen in the zoomed out photo of the negative strip\n\nIf anyone has experienced this before or has any advice, I would greatly appreciate it", "link": "https://www.reddit.com/r/AnalogCommunity/comments/97ldcz/unsure_what_is_causing_my_black_and_white/"}, {"autor": "sad-king-billy", "selftext": "Here is my current setup: [https://i.imgur.com/tfIl94q.jpg](https://i.imgur.com/tfIl94q.jpg)\n\nI have my Fuji X-T1 on the horizontal arm of a [tripod](https://www.amazon.com/gp/product/B07CH3Q6TX/), facing down onto the negatives (flattened by pieces of cardboard over the sprockets), on top of a [Kaiser light box](https://www.amazon.com/gp/product/B01LTGVRLE/). I have a 16mm macro adapter on the lens and this allows me to fill most of the frame with negative (with the help of some DnD books!). I'm using the 18-55 Fuji XF lens.\n\nFrom there I import the images into Lightroom, convert to black and white, invert the colors via the curves, and copy these settings to all images. Individually, I adjust for lens distortion, rotate, and crop as needed, in addition to any adjustments in contrast/exposure. This yields pretty good results. \n\nHere's a sample image, which was actually done handheld, before I got the tripod: [https://i.imgur.com/ISgUUMh.jpg](https://i.imgur.com/ISgUUMh.jpg)\n\nMy questions, as I'm looking for improvement:\n\n1. Should I shoot the emulsion (matte) side of the film, or the glossy side? I've been shooting the glossy side but I've read elsewhere here that it's better to scan the emulsion scan for more detail. (So, that's probably my answer.)\n2. I also usually shoot these as JPGs, but would RAW give me noticeably more detail to work with?\n3. I set the AF to wide, and let it find focus on the negative for each frame. Is this a good idea, or should I lock in the focus seeing as it should be the same across the board?\n4. What are the ideal exposure settings on the camera? ISO, f/stop, etc. Usually I make sure the shutter speed is at least 60 and the aperture is somewhere in the middle, like 5.6 or 8, and ISO is also mid-range, around 400. I figure this gives me the sharpest, most noise-free image. \n5. Any other ways I can improve?\n\nI'm also not happy with my method of holding the negatives. I backed [pixl-latr](https://pixl-latr.com/) on kickstarter so hopefully that problem will be solved once it's in production! ", "title": "My method of digitizing negatives with a camera, and some questions", "num-comments": 5, "score": 13, "date": "2018-09-01 17:19:21", "content": "My method of digitizing negatives with a camera, and some questions /!/ Here is my current setup: [https://i.imgur.com/tfIl94q.jpg](https://i.imgur.com/tfIl94q.jpg)\n\nI have my Fuji X-T1 on the horizontal arm of a [tripod](https://www.amazon.com/gp/product/B07CH3Q6TX/), facing down onto the negatives (flattened by pieces of cardboard over the sprockets), on top of a [Kaiser light box](https://www.amazon.com/gp/product/B01LTGVRLE/). I have a 16mm macro adapter on the lens and this allows me to fill most of the frame with negative (with the help of some DnD books!). I'm using the 18-55 Fuji XF lens.\n\nFrom there I import the images into Lightroom, convert to black and white, invert the colors via the curves, and copy these settings to all images. Individually, I adjust for lens distortion, rotate, and crop as needed, in addition to any adjustments in contrast/exposure. This yields pretty good results. \n\nHere's a sample image, which was actually done handheld, before I got the tripod: [https://i.imgur.com/ISgUUMh.jpg](https://i.imgur.com/ISgUUMh.jpg)\n\nMy questions, as I'm looking for improvement:\n\n1. Should I shoot the emulsion (matte) side of the film, or the glossy side? I've been shooting the glossy side but I've read elsewhere here that it's better to scan the emulsion scan for more detail. (So, that's probably my answer.)\n2. I also usually shoot these as JPGs, but would RAW give me noticeably more detail to work with?\n3. I set the AF to wide, and let it find focus on the negative for each frame. Is this a good idea, or should I lock in the focus seeing as it should be the same across the board?\n4. What are the ideal exposure settings on the camera? ISO, f/stop, etc. Usually I make sure the shutter speed is at least 60 and the aperture is somewhere in the middle, like 5.6 or 8, and ISO is also mid-range, around 400. I figure this gives me the sharpest, most noise-free image. \n5. Any other ways -----> -----> I !!!  can improve !!! ?\n\n-----> I !!! 'm also not happy with my method of holding the negatives. I backed [pixl-latr](https://pixl-latr.com/) on kickstarter so hopefully that problem will be solved once it's in production! ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9c4sun/my_method_of_digitizing_negatives_with_a_camera/"}, {"autor": "dixonbotts", "selftext": "I’m relatively new here and I’ve been developing my film at home. All of my scans come out with a lot of dust and specs even though I have a rocket blower. I think it’s from the cloth I dry my negatives with. Pretty much all I’m asking is what is the best way to dry or clean negatives after the development stages ", "title": "Don’t know how to clean/dry my film", "num-comments": 13, "score": 2, "date": "2018-08-29 19:01:22", "content": "Don’t know how to clean/dry my film /!/ -----> I !!! ’m relatively new here and -----> -----> I !!! ’ve been developing !!!  my film at home. All of my scans come out with a lot of dust and specs even though I have a rocket blower. I think it’s from the cloth I dry my negatives with. Pretty much all I’m asking is what is the best way to dry or clean negatives after the development stages ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9bc5tg/dont_know_how_to_cleandry_my_film/"}, {"autor": "BodegaBalada", "selftext": "I’m pretty new to film photography. \nYesterday I accidentally shot Portra 400 at 200, on a Nikon F100.\n\nWith the past few films I’ve developed it wouldn’t be such a big deal, but I felt like I finally got some decent shots after practicing quite a bit. \n\nI really want to avoid ruining these!\n\nShould I just get them developed as normal and hope for the best? Or do I ask the lab to pull them?\n\nIf it helps, the pictures were portraits taken outdoors in a park. Half were on a partially cloudy day, and half were at sunset.", "title": "Accidentally shot Portra 400 @ 200. What should I do?", "num-comments": 9, "score": 3, "date": "2018-08-27 17:46:35", "content": "Accidentally shot Portra 400 @ 200. What should I do? /!/ I’m pretty new to film photography. \nYesterday I accidentally shot Portra 400 at 200, on a Nikon F100.\n\nWith the past few films -----> -----> I !!! ’ve developed !!!  it wouldn’t be such a big deal, but -----> I !!!  felt like -----> I !!!  finally got some decent shots after practicing quite a bit. \n\nI really want to avoid ruining these!\n\nShould I just get them developed as normal and hope for the best? Or do I ask the lab to pull them?\n\nIf it helps, the pictures were portraits taken outdoors in a park. Half were on a partially cloudy day, and half were at sunset.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9ar3wt/accidentally_shot_portra_400_200_what_should_i_do/"}, {"autor": "FrenchFryCattaneo", "selftext": "Recently some of the rolls I've developed (c-41, developed in a paterson tank from a unicolor kit) have had water spots when I went to scan them. I gave them another rinse with distilled water, and that seemed to do the trick. My question is, if I develop the film, let it dry, and then rinse it, am I rinsing off or otherwise messing with the stabilizer?\n\nAlso are there any other tips on preventing water spots? I currently add photoflo to the stabilizer, and use a squeegee.", "title": "A question about washing film after development.", "num-comments": 21, "score": 1, "date": "2018-11-02 03:33:24", "content": "A question about washing film after development. /!/ Recently some of the rolls -----> -----> I !!! 've developed !!!  (c-41, developed in a paterson tank from a unicolor kit) have had water spots when -----> I !!!  went to scan them. I gave them another rinse with distilled water, and that seemed to do the trick. My question is, if I develop the film, let it dry, and then rinse it, am I rinsing off or otherwise messing with the stabilizer?\n\nAlso are there any other tips on preventing water spots? I currently add photoflo to the stabilizer, and use a squeegee.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9tglso/a_question_about_washing_film_after_development/"}, {"autor": "Horror_musician", "selftext": "I bought my cinestill c41 kit and after 8th roll it started going bad. I did 2 rolls at once some time, or just one roll by itself. \n\n\nThis time, I've stockpiled an even number of rolls, 10, I think,. \n\nCan I develop these in batches of two before the dev goes. bad ..uhh to clarify.. lets say 6 batches of 2 rolls make the 12 roll max.. Since I developed them very close to each other.. Would my developer go bad even in a short amount of days between use due to me using it for 12 rolls or would I still be able to use, but extend dev time, and still have a clear negative.\n\n\n\nThanks!!!", "title": "When using c41 dev kit, is it 8-12 rolls or 8-12 uses?", "num-comments": 3, "score": 1, "date": "2018-10-07 22:37:23", "content": "When using c41 dev kit, is it 8-12 rolls or 8-12 uses? /!/ I bought my cinestill c41 kit and after 8th roll it started going bad. I did 2 rolls at once some time, or just one roll by itself. \n\n\nThis time, I've stockpiled an even number of rolls, 10, I think,. \n\nCan -----> -----> I !!!  develop !!!  these in batches of two before the dev goes. bad ..uhh to clarify.. lets say 6 batches of 2 rolls make the 12 roll max.. Since I developed them very close to each other.. Would my developer go bad even in a short amount of days between use due to me using it for 12 rolls or would I still be able to use, but extend dev time, and still have a clear negative.\n\n\n\nThanks!!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9m9fqn/when_using_c41_dev_kit_is_it_812_rolls_or_812_uses/"}, {"autor": "sad-king-billy", "selftext": "I had been using my Fuji XF 18-55 lens with my X-T1 to scan photos, as I detailed in a [previous post](https://www.reddit.com/r/AnalogCommunity/comments/9c4sun/my_method_of_digitizing_negatives_with_a_camera/). However, as I am knee-deep in the Minolta analog system, I decided to get a macro lens that I could use both with a mount adapter and directly on my Minolta bodies. I got a Rokkor MC 50mm f/3.5 macro lens from KEH (condition ugly, but the glass looks fine!) for about $25. Here are the results of this lens versus the Fuji lens with a 16mm extension tube.\n\n*Processing img a48riwhh5ap11...*\n\nThe outlined X is the size of a 35mm frame (36x24mm). Notice the clear barrel distortion and the softening in the corners. I could correct the distortion easily enough in Lightroom, but I couldn't do anything about the softness. \n\nHere's the same shot with the Minolta macro lens.\n\n&amp;#x200B;\n\n*Processing img fc5lbzet5ap11...*\n\nThis is right out of the camera, with no editing. Immediately it is clear that there are sharp corners, and no distortion at all. Now, I lose the ability to use autofocus when I scan, but as I'm set up on a tripod it stays consistent throughout, and it's easy enough to adjust for each frame if I need to. However, now I'm extremely confident that I'm getting the entire frame sharp. I should also note that this lens did not come with the 1:1 extension, but the lens does 1:2 natively. As the Fuji is APS-C, this means the 35mm frame can still fill a fair amount of the sensor. If I had a full frame camera I would probably want the extension, but as of right now this is a huge improvement for a small expense. I was quite surprised by the quality of the macro lens so I wanted to share. ", "title": "Testing a macro lens vs extension tubes, or how I improved my scanning set-up with a $25 Minolta lens", "num-comments": 9, "score": 3, "date": "2018-09-30 01:45:11", "content": "Testing a macro lens vs extension tubes, or how -----> -----> I !!!  improved !!!  my scanning set-up with a $25 Minolta lens /!/ I had been using my Fuji XF 18-55 lens with my X-T1 to scan photos, as I detailed in a [previous post](https://www.reddit.com/r/AnalogCommunity/comments/9c4sun/my_method_of_digitizing_negatives_with_a_camera/). However, as I am knee-deep in the Minolta analog system, I decided to get a macro lens that I could use both with a mount adapter and directly on my Minolta bodies. I got a Rokkor MC 50mm f/3.5 macro lens from KEH (condition ugly, but the glass looks fine!) for about $25. Here are the results of this lens versus the Fuji lens with a 16mm extension tube.\n\n*Processing img a48riwhh5ap11...*\n\nThe outlined X is the size of a 35mm frame (36x24mm). Notice the clear barrel distortion and the softening in the corners. I could correct the distortion easily enough in Lightroom, but I couldn't do anything about the softness. \n\nHere's the same shot with the Minolta macro lens.\n\n&amp;#x200B;\n\n*Processing img fc5lbzet5ap11...*\n\nThis is right out of the camera, with no editing. Immediately it is clear that there are sharp corners, and no distortion at all. Now, I lose the ability to use autofocus when I scan, but as I'm set up on a tripod it stays consistent throughout, and it's easy enough to adjust for each frame if I need to. However, now I'm extremely confident that I'm getting the entire frame sharp. I should also note that this lens did not come with the 1:1 extension, but the lens does 1:2 natively. As the Fuji is APS-C, this means the 35mm frame can still fill a fair amount of the sensor. If I had a full frame camera I would probably want the extension, but as of right now this is a huge improvement for a small expense. I was quite surprised by the quality of the macro lens so I wanted to share. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9k2fpx/testing_a_macro_lens_vs_extension_tubes_or_how_i/"}, {"autor": "JustFilming", "selftext": "nan", "title": "I developed a roll of pan 400 but when I took it out of the tank it was underexposed. Or I thought, because now it seems that it has a black backing that didn't washed out that light doesn't passes. Is this normal? Or I putted it bad into the reel and one side didn't developed?", "num-comments": 58, "score": 7, "date": "2018-09-14 03:22:22", "content": "-----> -----> I !!!  developed !!!  a roll of pan 400 but when I took it out of the tank it was underexposed. Or I thought, because now it seems that it has a black backing that didn't washed out that light doesn't passes. Is this normal? Or I putted it bad into the reel and one side didn't developed?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9fon3j/i_developed_a_roll_of_pan_400_but_when_i_took_it/"}, {"autor": "adashofnarwhal", "selftext": "I've had a Bronica ETRS for a few months now - had a blast with it and with how gorgeous MF film gets. I also picked up a used 135N back from eBay for the camera but have been really lazy about developing the only roll I shot on it....until yesterday. I developed it and was surprised to find that [all my images](https://imgur.com/a/AH7iue7) were overlapping. In the link, the top half is the auto-color-corrected version by Silverfast from my Epson v500. \n\nMy impression, as well as the labeling on the back itself, say that it's supposed to be a 135N, which I thought would shoot standard 35mm images, not panoramic wide images. But, looking at the film strip, it looks like the camera is shooting wide images while only advancing the correct amount for standard frame shots, which would explain why everything looks like it's overlapping. Did I accidentally buy a 135W panoramic back, or is this normal? Or maybe it's broken? Not sure - any advice would be super appreciated.\n\nAlso, sorry that nothing is in focus. Im not sure why it seems thats the case.", "title": "Looking for advice on my Bronica 135N Back", "num-comments": 4, "score": 1, "date": "2018-11-30 09:17:39", "content": "Looking for advice on my Bronica 135N Back /!/ I've had a Bronica ETRS for a few months now - had a blast with it and with how gorgeous MF film gets. I also picked up a used 135N back from eBay for the camera but have been really lazy about developing the only roll I shot on it....until yesterday. -----> -----> I !!!  developed !!!  it and was surprised to find that [all my images](https://imgur.com/a/AH7iue7) were overlapping. In the link, the top half is the auto-color-corrected version by Silverfast from my Epson v500. \n\nMy impression, as well as the labeling on the back itself, say that it's supposed to be a 135N, which I thought would shoot standard 35mm images, not panoramic wide images. But, looking at the film strip, it looks like the camera is shooting wide images while only advancing the correct amount for standard frame shots, which would explain why everything looks like it's overlapping. Did I accidentally buy a 135W panoramic back, or is this normal? Or maybe it's broken? Not sure - any advice would be super appreciated.\n\nAlso, sorry that nothing is in focus. Im not sure why it seems thats the case.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a1qx35/looking_for_advice_on_my_bronica_135n_back/"}, {"autor": "sonygoup", "selftext": "Looking to improve my technique of shooting film, because currently I think my works sucks and I enjoy shooting film for fun but it's time for me to improve on my work. (IG: everydayfilm.tt) Example of all my works from the really terrible stuff to what I managed to get too, today. I own alot of great camera so I know crappy gears wouldn't be the issues. (EOS1N,R35, Trip 35 and so)\n\nIs there books, guides,videos or just over all tips I can do to improve my work? I know it isn't going to take 5 mins so I'm up for a challenge as always.\nI don't edit any of my scans as the studio scans them but I've recently gotten a v600 so I'll be doing some editing on my next few rolls", "title": "Shooting Advice/ Tips/ Anything to improve my photography", "num-comments": 9, "score": 1, "date": "2018-11-27 13:02:18", "content": "Shooting Advice/ Tips/ Anything to improve my photography /!/ Looking to improve my technique of shooting film, because currently I think my works sucks and I enjoy shooting film for fun but it's ti-----> me !!!  for -----> -----> me !!!  to improve !!!  on my work. (IG: everydayfilm.tt) Example of all my works from the really terrible stuff to what I managed to get too, today. I own alot of great camera so I know crappy gears wouldn't be the issues. (EOS1N,R35, Trip 35 and so)\n\nIs there books, guides,videos or just over all tips I can do to improve my work? I know it isn't going to take 5 mins so I'm up for a challenge as always.\nI don't edit any of my scans as the studio scans them but I've recently gotten a v600 so I'll be doing some editing on my next few rolls", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a0umy5/shooting_advice_tips_anything_to_improve_my/"}, {"autor": "ddk4x5", "selftext": "**Things I learned while going from medium format SLR to a large format view camera.**\n\nThese are the notes I kept after I just bought an intrepid 4x5 camera. Notes made after a month and reviewed after nine months.  It is very condensed compared to other writings. It contains a lot of notes for those who are eyeing to take the plunge into LF, as they say. And also some notes about what to look for in a LF camera. It is detailed, because I like details. And it is not only technical, but also about what it means to the subject. It's a long read, but since Reddit got me started in analog and \"caused me to buy a Mamiya m645 SLR, I thought it would be nice to share.\n\n\n**Documenting persons**\n\n* People like posing for the view camera way more than they do for my Mamiya m645.\n\n*Addendum after nine months:*\n* People are now asking me to make portraits based on my results, rather than on my invitation or the attractiveness of my hardware. That said, I have since bought a Wista 45dx, that is way more attractive than the Intrepid 4x5 mkII. I use the same lens, so the photo is the same, but a wood and brass camera helps. It's a starting point, and I can build on it.\n\n\n**The focusing proces**\n\n* The cover over my head needs to be light tight for better sight. I got a nice tightly woven cloth for this. \n\n*Addendum after nine months:* \n* led balls in the seem help holding it in place.\n* To check the focus on the ground glass, I need some magnification. Found out that a loupe is not for me. I found composing a pain when using a loupe. It puts me at a distance emotionally. Well, and my eyesight is not good enough without reading glasses, which hinders using the loupe.\n* A pair of cheap +4 reading glasses allow me to oversee the whole ground glass, and down the the details, with my head some 20cm from the ground glass. So this is my method now. (I normally use +1 fore reading.)\n\n\n**The viewfinder**\n\n* Focusing upside down is a nice abstraction that makes me compose better. It reminded me of having to put my drawings upside down in the painting class, to see what I needed to change.\n\n*Addendum after nine months:*\n* I do not even remember seeing the image online. It's something that is just a given and not important anymore. Since it rotates rather than mirrors, like the waste level view finders do, setting up the shot is less confusing than it was when I began shooting with my Mamiya m645.\n* I inverted my thinking about focusing. It is not something you dial into the lens. The lens is fixed. It projects a 3D image behind it, in which everything is sharp somewhere. I place my ground glass, and ultimately the film inside of this 3D projection. Only then it becomes 2D, and the location of the film plane is determines what is in focus. It would have made even more sense if the film plane was what was rolling in and out on these cameras.\n* Focusing very closely gives the sense of zooming in too. I heard people on youtube going mad about the \"focus drift\" that their \"full frame\" zoom lens has. Ha, they should see what happens if you focus in on someone half a meter from your LF.\nA fresnel\n* I bought an el cheapo (40 euro) fresnel for the ground glas. I wrote I'd report back. It's okay. The purpose is to bend the light that is off center, towards you, reducing vignetting. It will not change the image on the film. If you do not want vignetting on your film, close the aperture a bit (and lengthen the shutter time). The fresnel is a composing tool, as you can overlook the whole focus screen in a glance. It's not a focusing tool at all. Contrary to some guy on youtube who made a movie that google pushes at you when you search for fresnels, the fresnel goes on the OUTSIDE of the ground glass. It would trow your focus of if you'd mount it on the inside, as it would sit in between your lens and your focus screen that way. You do not want that.\n\n*Addendum after nine months:*\n* I can now compare the el cheapo to the fresnel that came on my Wista. The Wista's is much finer. But it does not really matter too much in practice. Would buy it again.\n\n\n**Movements**\n\nOn a large format camera you can move the lens up and down (rise and fall) and left to right (shift) for perspective control, and tilt/swing the lens for focus control. These are called movements. The intrepid only has lens movements, the Wista also has tilt, swing and shift on it’s back (the film plane).\n\n* I love shifting for perspective and tilting for precise focusing. I knew this from toying around with my digital mirrorless and some adapters. Lens tilt is much more intuitive then it is on my digital camera with a tilt-adapter. One reason is that because the image is not flipped right side up, I can see in my minds eye how the projection of the image works. Also, on a digital system, there is a swivel halfway between the lens and the sensor that allows for tilt. And the barrel of the lens is longer too. It works much much more intuitively when you really only tilt the film back or the lens plate, rather than bending the whole system halfway. \n\n*Addendum after nine months:*\n* I shoot so much more portraits than other things these days, that I hardly ever use shifts and rises anymore, only to fake back tilt on the Intrepid. As I expected, I use tilt and swing a lot, as to get two eyes and a mouth in focus. I really do this naturally. This why I wanted a large format field camera to begin with; I missed movements on the Mamiya SLR.\n* differences between the cameras: The Intrepid tilt axis runs right through the lens, while the Wista's pivots at the base. This makes tilting the lens more intuitive on the Intrepid. That said, it is too easy to knock out of place when cocking the shutter on the Intrepid. And the focusing process with tilt is iterative on both camera's anyway. It's just that I do not lose focus so much while setting the tilt on the Intrepid, as I do on the Wista. On the latter, there is this moment of disconnect after deciding I need the tilt.\n\n\n**The workflow**\n\n* The fact that you slide the film holder in after the composing and focusing is done, has an upshot. To determine when to trip to shutter is done by looking at reality, not through a device. To me, this feels more real, and thus better. \n\n*Addendum after nine months:*\n*I found that my subjects connect way more to me when I shoot this way. I might start doing like this digitally too: Just stand next to my camera rather than behind it.\n* I am a musician &amp; sound technician, so here's my perspective on the workflow in sound studio terms: Contrary to the SLR, a large format camera feels like recording. I set up the mics and the volumes, I give the band my directions and focus points, they get ready, and at the right moment I punch in the recording, and from that moment on, it is just them. Photography feels the same now. I feel like I make a registration, a document. An SLR feels like barging into the recording room, rather than quietly pressing record in the control room.\n\n*Addendum after nine months:*\nI also started directing shots like I direct singers in the my sound studio. I came to the realization when [Stephen DiRado](http://www.stephendirado.com) told me to listen to what was there to hear, while he made a portrait of me. He is such a great help in all this, and we became good friends.\n* I do no not make them wait, and I will no longer wait on somebody to change anything in their expression after I just told them to freeze, while they are essentially waiting for me to go click. I give them something to do, something to think about, something to listen too and to look at. A focuspoint, other than their own looks. This is similar to me in the studio, go over a text with the singer, and imagine a setting, a purpose, and an audience for them to see in their minds eye when performing their song. If I wouldn't, every recording would sound like \"He's recording this, let's not make any mistakes again, aaah\".\n* Though I ruined a few sheets, the workflow is not as bothersome as I expected it to be. But I must say I rehearsed the process in my mind a number of times before the camera arrived. \n\n*Addendum after nine months:*\n*I expanded a bit on the routine. Set focus, close lens, set shutter and aperture, fire a testshot, slide in film holder, check if lens is closed, cock shutter, open film holder, check subject, fire. All this time I keep communicating what I do, and I say \"hold still\" a lot. And I make jokes. People tell me I welcome and relax them. Good. Honestly, my mind is occupied with the tech side of the process too. You see, there are quite a few things I need to do between focussing and taking the picture. This is why my subject should hold still, not because the shutter times a that long. \n\n\n**Depth of field**\n\n* Shooting a larger format does not make the DoF shallower directly. But a 150mm lens has a similar field of view as a 50mm on a 135 (35mm)camera, and that long focal length comes with a less deep DoF. It looks like a f1.4. When you shoot close ups, backgrounds go way out of focus. When you shoot at a medium distance, say 4 meters, the background *still* goes out of focus. You need to be very precise with selecting what you want in focus, and therefor you will need tilt and swing.\n* I almost always shoot wide open, f5.6 on my lens, which means I have 1cm depth of field when I do a close up portrait. I use the full range of the shutter. From 1/400 to a full second. \n\n*Addendum after nine months:*\n* When focusing close ups, the bellow gets to be extended a lot more. This spreads the light form the lens over a larger area. You will need to double the shutter time that the meter suggests to compensate for this.\n* For regular scenes, mylightmeter app is okay. For more contrasty scenes, the contrasty camera of the phone has a hard time guessing. A dedicated meter will be better.\n\n\n**The negatives**\n\n* I like it that you can develop per sheet, thus per frame, and adjust dev times as you go along.\n\n*Addendum after nine months:*\nI standardized the development, making light on the film the only variable, and I develop per four. That's two film holders. I often shoot 4 or 8 frames now. I typically carry 5 film holders, so I can screw up 2 frames and still fill two tanks. I do not ruin films that often, though.\n* I'm not into this because I like developing, or scanning. I develop the same evening, I postpone scanning a lot.\n* I like that the negative is not microscopic. As soon as you pull it from the water, you can see how it is!\n\n*Addendum after nine months:*\nThe size feels very normal to me now. Not at all big anymore. That happened really fast.\nSome more notes on the quality camera\n\n*Addendum after nine months:*\n* It is really really important that you can lock any variable on the camera very securely. It is annoying that the Intrepid can be detuned so easily. This ruins shots. Focus may slide off when I tilt the camera back and do not thoroughly lock it. Rotation on the tripod cannot be locked well enough, causing the camera to be rotated sideways a bit when sliding in film into the rough plywood. Swing is annoyingly easy to ruin when setting the shutter dials. In these respects, the Wista is so much better.\nThe Wista is twice as heavy as the intrepid. But with all the other stuff you need (tripod, dark cloth, filmholders, glasses, lens, shutter release, light meter, filter) it does not matter that much.\nIt's just that I'd hate to be the one to make the first scratch on the 46 year old Wista, while I decided that the intrepid is for hiking. I was worry free when it got sanded on a black beach of Iceland and rained on on Martha's Vineyard. That's a feature the Wista does not have.\n\n**But most importantly**\n\nPhotographing this way brought me personal contacts in a way that music never did. To me, it was a journey full of surprises. Going large format improved the quality of my portraits a lot. And the size of the negative was the least relevant in that upgrade. With a 4x5, I was able to make very honest and direct documents of the people that are dear to me. The tool is no longer sitting between me, my eyes, and them. It is just an extension of me, standing next to me.\n\n**some results**\n\n[click!](https://www.facebook.com/krosov/media_set?set=a.1740699366055952&amp;type=1&amp;l=bf98b90b0c)", "title": "Things I learned while going from medium format SLR to a large format view camera", "num-comments": 43, "score": 1, "date": "2018-12-17 14:31:03", "content": "Things I learned while going from medium format SLR to a large format view camera /!/ **Things I learned while going from medium format SLR to a large format view camera.**\n\nThese are the notes I kept after I just bought an intrepid 4x5 camera. Notes made after a month and reviewed after nine months.  It is very condensed compared to other writings. It contains a lot of notes for those who are eyeing to take the plunge into LF, as they say. And also some notes about what to look for in a LF camera. It is detailed, because I like details. And it is not only technical, but also about what it means to the subject. It's a long read, but since Reddit got me started in analog and \"caused me to buy a Mamiya m645 SLR, I thought it would be nice to share.\n\n\n**Documenting persons**\n\n* People like posing for the view camera way more than they do for my Mamiya m645.\n\n*Addendum after nine months:*\n* People are now asking me to make portraits based on my results, rather than on my invitation or the attractiveness of my hardware. That said, I have since bought a Wista 45dx, that is way more attractive than the Intrepid 4x5 mkII. I use the same lens, so the photo is the same, but a wood and brass camera helps. It's a starting point, and I can build on it.\n\n\n**The focusing proces**\n\n* The cover over my head needs to be light tight for better sight. I got a nice tightly woven cloth for this. \n\n*Addendum after nine months:* \n* led balls in the seem help holding it in place.\n* To check the focus on the ground glass, I need some magnification. Found out that a loupe is not for me. I found composing a pain when using a loupe. It puts me at a distance emotionally. Well, and my eyesight is not good enough without reading glasses, which hinders using the loupe.\n* A pair of cheap +4 reading glasses allow me to oversee the whole ground glass, and down the the details, with my head some 20cm from the ground glass. So this is my method now. (I normally use +1 fore reading.)\n\n\n**The viewfinder**\n\n* Focusing upside down is a nice abstraction that makes me compose better. It reminded me of having to put my drawings upside down in the painting class, to see what I needed to change.\n\n*Addendum after nine months:*\n* I do not even remember seeing the image online. It's something that is just a given and not important anymore. Since it rotates rather than mirrors, like the waste level view finders do, setting up the shot is less confusing than it was when I began shooting with my Mamiya m645.\n* I inverted my thinking about focusing. It is not something you dial into the lens. The lens is fixed. It projects a 3D image behind it, in which everything is sharp somewhere. I place my ground glass, and ultimately the film inside of this 3D projection. Only then it becomes 2D, and the location of the film plane is determines what is in focus. It would have made even more sense if the film plane was what was rolling in and out on these cameras.\n* Focusing very closely gives the sense of zooming in too. I heard people on youtube going mad about the \"focus drift\" that their \"full frame\" zoom lens has. Ha, they should see what happens if you focus in on someone half a meter from your LF.\nA fresnel\n* I bought an el cheapo (40 euro) fresnel for the ground glas. I wrote I'd report back. It's okay. The purpose is to bend the light that is off center, towards you, reducing vignetting. It will not change the image on the film. If you do not want vignetting on your film, close the aperture a bit (and lengthen the shutter time). The fresnel is a composing tool, as you can overlook the whole focus screen in a glance. It's not a focusing tool at all. Contrary to some guy on youtube who made a movie that google pushes at you when you search for fresnels, the fresnel goes on the OUTSIDE of the ground glass. It would trow your focus of if you'd mount it on the inside, as it would sit in between your lens and your focus screen that way. You do not want that.\n\n*Addendum after nine months:*\n* I can now compare the el cheapo to the fresnel that came on my Wista. The Wista's is much finer. But it does not really matter too much in practice. Would buy it again.\n\n\n**Movements**\n\nOn a large format camera you can move the lens up and down (rise and fall) and left to right (shift) for perspective control, and tilt/swing the lens for focus control. These are called movements. The intrepid only has lens movements, the Wista also has tilt, swing and shift on it’s back (the film plane).\n\n* I love shifting for perspective and tilting for precise focusing. I knew this from toying around with my digital mirrorless and some adapters. Lens tilt is much more intuitive then it is on my digital camera with a tilt-adapter. One reason is that because the image is not flipped right side up, I can see in my minds eye how the projection of the image works. Also, on a digital system, there is a swivel halfway between the lens and the sensor that allows for tilt. And the barrel of the lens is longer too. It works much much more intuitively when you really only tilt the film back or the lens plate, rather than bending the whole system halfway. \n\n*Addendum after nine months:*\n* I shoot so much more portraits than other things these days, that I hardly ever use shifts and rises anymore, only to fake back tilt on the Intrepid. As I expected, I use tilt and swing a lot, as to get two eyes and a mouth in focus. I really do this naturally. This why I wanted a large format field camera to begin with; I missed movements on the Mamiya SLR.\n* differences between the cameras: The Intrepid tilt axis runs right through the lens, while the Wista's pivots at the base. This makes tilting the lens more intuitive on the Intrepid. That said, it is too easy to knock out of place when cocking the shutter on the Intrepid. And the focusing process with tilt is iterative on both camera's anyway. It's just that I do not lose focus so much while setting the tilt on the Intrepid, as I do on the Wista. On the latter, there is this moment of disconnect after deciding I need the tilt.\n\n\n**The workflow**\n\n* The fact that you slide the film holder in after the composing and focusing is done, has an upshot. To determine when to trip to shutter is done by looking at reality, not through a device. To me, this feels more real, and thus better. \n\n*Addendum after nine months:*\n*I found that my subjects connect way more to me when I shoot this way. I might start doing like this digitally too: Just stand next to my camera rather than behind it.\n* I am a musician &amp; sound technician, so here's my perspective on the workflow in sound studio terms: Contrary to the SLR, a large format camera feels like recording. I set up the mics and the volumes, I give the band my directions and focus points, they get ready, and at the right moment I punch in the recording, and from that moment on, it is just them. Photography feels the same now. I feel like I make a registration, a document. An SLR feels like barging into the recording room, rather than quietly pressing record in the control room.\n\n*Addendum after nine months:*\nI also started directing shots like I direct singers in the my sound studio. I came to the realization when [Stephen DiRado](http://www.stephendirado.com) told me to listen to what was there to hear, while he made a portrait of me. He is such a great help in all this, and we became good friends.\n* I do no not make them wait, and I will no longer wait on somebody to change anything in their expression after I just told them to freeze, while they are essentially waiting for me to go click. I give them something to do, something to think about, something to listen too and to look at. A focuspoint, other than their own looks. This is similar to me in the studio, go over a text with the singer, and imagine a setting, a purpose, and an audience for them to see in their minds eye when performing their song. If I wouldn't, every recording would sound like \"He's recording this, let's not make any mistakes again, aaah\".\n* Though I ruined a few sheets, the workflow is not as bothersome as I expected it to be. But I must say I rehearsed the process in my mind a number of times before the camera arrived. \n\n*Addendum after nine months:*\n*I expanded a bit on the routine. Set focus, close lens, set shutter and aperture, fire a testshot, slide in film holder, check if lens is closed, cock shutter, open film holder, check subject, fire. All this time I keep communicating what I do, and I say \"hold still\" a lot. And I make jokes. People tell me I welcome and relax them. Good. Honestly, my mind is occupied with the tech side of the process too. You see, there are quite a few things I need to do between focussing and taking the picture. This is why my subject should hold still, not because the shutter times a that long. \n\n\n**Depth of field**\n\n* Shooting a larger format does not make the DoF shallower directly. But a 150mm lens has a similar field of view as a 50mm on a 135 (35mm)camera, and that long focal length comes with a less deep DoF. It looks like a f1.4. When you shoot close ups, backgrounds go way out of focus. When you shoot at a medium distance, say 4 meters, the background *still* goes out of focus. You need to be very precise with selecting what you want in focus, and therefor you will need tilt and swing.\n* I almost always shoot wide open, f5.6 on my lens, which means I have 1cm depth of field when I do a close up portrait. I use the full range of the shutter. From 1/400 to a full second. \n\n*Addendum after nine months:*\n* When focusing close ups, the bellow gets to be extended a lot more. This spreads the light form the lens over a larger area. You will need to double the shutter time that the meter suggests to compensate for this.\n* For regular scenes, mylightmeter app is okay. For more contrasty scenes, the contrasty camera of the phone has a hard time guessing. A dedicated meter will be better.\n\n\n**The negatives**\n\n* I like it that you can develop per sheet, thus per frame, and adjust dev times as you go along.\n\n*Addendum after nine months:*\n-----> I !!!  standardized the development, making light on the film the only variable, and -----> -----> I !!!  develop !!!  per four. That's two film holders. I often shoot 4 or 8 frames now. I typically carry 5 film holders, so I can screw up 2 frames and still fill two tanks. I do not ruin films that often, though.\n* I'm not into this because I like developing, or scanning. I develop the same evening, I postpone scanning a lot.\n* I like that the negative is not microscopic. As soon as you pull it from the water, you can see how it is!\n\n*Addendum after nine months:*\nThe size feels very normal to me now. Not at all big anymore. That happened really fast.\nSome more notes on the quality camera\n\n*Addendum after nine months:*\n* It is really really important that you can lock any variable on the camera very securely. It is annoying that the Intrepid can be detuned so easily. This ruins shots. Focus may slide off when I tilt the camera back and do not thoroughly lock it. Rotation on the tripod cannot be locked well enough, causing the camera to be rotated sideways a bit when sliding in film into the rough plywood. Swing is annoyingly easy to ruin when setting the shutter dials. In these respects, the Wista is so much better.\nThe Wista is twice as heavy as the intrepid. But with all the other stuff you need (tripod, dark cloth, filmholders, glasses, lens, shutter release, light meter, filter) it does not matter that much.\nIt's just that I'd hate to be the one to make the first scratch on the 46 year old Wista, while I decided that the intrepid is for hiking. I was worry free when it got sanded on a black beach of Iceland and rained on on Martha's Vineyard. That's a feature the Wista does not have.\n\n**But most importantly**\n\nPhotographing this way brought me personal contacts in a way that music never did. To me, it was a journey full of surprises. Going large format improved the quality of my portraits a lot. And the size of the negative was the least relevant in that upgrade. With a 4x5, I was able to make very honest and direct documents of the people that are dear to me. The tool is no longer sitting between me, my eyes, and them. It is just an extension of me, standing next to me.\n\n**some results**\n\n[click!](https://www.facebook.com/krosov/media_set?set=a.1740699366055952&amp;type=1&amp;l=bf98b90b0c)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a70a2d/things_i_learned_while_going_from_medium_format/"}, {"autor": "SuggestAPhotoProject", "selftext": "I’m waiting for my chemistry to warm up, and I’m thinking about gloves. I never wear gloves when I’m developing film or printing in the darkroom. My wife has been yelling at me for years that I’m going to give myself Kodak Cancer.  A running joke in my house is that every time I cough or sneeze, she tells me that it’s probably just my Kodak cancer acting up again.\n\n\n\nI don’t wear them because they’re uncomfortable, and I’m pretty good at not getting my hands wet when I’m developing, despite those leaky Paterson lids. Printing is a little different, I usually just stick my hands right in the trays.  My wife is generally right about most things, and she may have a point here that decades of exposure to these chemicals may not be the greatest thing. \n\n\n\nSo, does anyone use gloves when they’re developing or printing?  Do you have any specific recommendations?  How about those white nylon gloves for handling negatives when scanning?  Does anyone have any good recommendations for those?  I bought a fifty pack of them about fifteen years ago, and I’m just about out and need to reorder some. ", "title": "Let’s talk about gloves!", "num-comments": 12, "score": 1, "date": "2018-12-17 01:36:43", "content": "Let’s talk about gloves! /!/ I’m waiting for my chemistry to warm up, and I’m thinking about gloves. -----> I !!!  never wear gloves when -----> -----> I !!! ’m developing !!!  film or printing in the darkroom. My wife has been yelling at me for years that I’m going to give myself Kodak Cancer.  A running joke in my house is that every time I cough or sneeze, she tells me that it’s probably just my Kodak cancer acting up again.\n\n\n\nI don’t wear them because they’re uncomfortable, and I’m pretty good at not getting my hands wet when I’m developing, despite those leaky Paterson lids. Printing is a little different, I usually just stick my hands right in the trays.  My wife is generally right about most things, and she may have a point here that decades of exposure to these chemicals may not be the greatest thing. \n\n\n\nSo, does anyone use gloves when they’re developing or printing?  Do you have any specific recommendations?  How about those white nylon gloves for handling negatives when scanning?  Does anyone have any good recommendations for those?  I bought a fifty pack of them about fifteen years ago, and I’m just about out and need to reorder some. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a6v67e/lets_talk_about_gloves/"}, {"autor": "m00dawg", "selftext": "Been posting a lot on the Discord channel but thought I'd bring the conversation here as well. I've spent the last few weeks building both a hand rotary and now have a working prototype for a motorized one. You can see the prototype moto-rotary [here](https://www.youtube.com/watch?v=5DELlfA0ovs). The hand roller is mostly the same - just two sides without the motor mount.\n\nIt works with my development controller I've been working on (while also working on my Film Log webapp) also but the moto-rotary could be used on its own with a direct 12V source, a simple timer/h-bridge circuit, etc. It's not much more than 3D printed parts I designed plus things common to 3D printing (608 bearings, all-thread rods, etc.). It's not the most optimized but for a version 1 I feel it's usable at least for my needs if nothing else.\n\nMy idea is to try and build DIY/kit components so folks can use part or the whole thing. Already have a Sous Vide? Then you don't need to worry about temperature controlling the water bath and can let the controller manage the rotary and optionally be your development timer. Don't want a rotary, you can use the water bath features. Want to control multiple water baths? You could do that too.\n\nMuch like Prusa did with 3D printers, the idea was to make part (or all) of it open source/open hardware.\n\nI favor an iterative design over a JOBO-clone because Imean honestly a JOBO is going to be awesome, especially with a lift. This is for folks that want something cheaper (but less good haha) and configurable. It seems like trying to make an easy to build kit for what a JOBO is, at least right now, I think is out of reach. So instead of trying to do that all at once, I think there might be value in doing it in pieces.\n\nThoughts?", "title": "I made a DIY Rotary - would folks be interested in this?", "num-comments": 17, "score": 1, "date": "2018-12-13 22:27:32", "content": "I made a DIY Rotary - would folks be interested in this? /!/ Been posting a lot on the Discord channel but thought I'd bring the conversation here as well. I've spent the last few weeks building both a hand rotary and now have a working prototype for a motorized one. You can see the prototype moto-rotary [here](https://www.youtube.com/watch?v=5DELlfA0ovs). The hand roller is mostly the same - just two sides without the motor mount.\n\nIt works with my development controller I've been working on (while also working on my Film Log webapp) also but the moto-rotary could be used on its own with a direct 12V source, a simple timer/h-bridge circuit, etc. -----> I !!! t's not much more than 3D printed parts -----> -----> I !!!  designed !!!  plus things common to 3D printing (608 bearings, all-thread rods, etc.). It's not the most optimized but for a version 1 I feel it's usable at least for my needs if nothing else.\n\nMy idea is to try and build DIY/kit components so folks can use part or the whole thing. Already have a Sous Vide? Then you don't need to worry about temperature controlling the water bath and can let the controller manage the rotary and optionally be your development timer. Don't want a rotary, you can use the water bath features. Want to control multiple water baths? You could do that too.\n\nMuch like Prusa did with 3D printers, the idea was to make part (or all) of it open source/open hardware.\n\nI favor an iterative design over a JOBO-clone because Imean honestly a JOBO is going to be awesome, especially with a lift. This is for folks that want something cheaper (but less good haha) and configurable. It seems like trying to make an easy to build kit for what a JOBO is, at least right now, I think is out of reach. So instead of trying to do that all at once, I think there might be value in doing it in pieces.\n\nThoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a5ygo3/i_made_a_diy_rotary_would_folks_be_interested_in/"}, {"autor": "hansblixxx", "selftext": "https://imgur.com/a/PWPrFJ1\n\n@analog_tom sent us a roll of Afga XT100 that was unknown in age and storage conditions. Using a standard ECN-2 process we developed it for a client and wanted to share the results as you don't see this stock too often as from what we can gather was discontinued around the early 1990s. \n\nConsidering the circumstances it came out better than we had originally thought. This stock, to begin with, is known for a low contrast green/blue/cyan hue. Add 25+ years to that and I have to say the skin tones aren't all that bad. \n\nThe one thing I will say is that remjet removal was difficult and we could tell from the start as it did not rinse out. We had to process as normal and remove by hand under running water after it was complete.\n\nEveryone here seems to like to geek out over different stocks and methods so I just wanted to share a cool piece of history we got to process today. ", "title": "Afga XT100 - ECN-2 Processing Examples", "num-comments": 5, "score": 1, "date": "2018-12-12 01:50:41", "content": "Afga XT100 - ECN-2 Processing Examples /!/ https://imgur.com/a/PWPrFJ1\n\n@analog_tom sent us a roll of Afga XT100 that was unknown in age and storage conditions. Using a standard ECN-2 process -----> -----> we !!!  developed !!!  it for a client and wanted to share the results as you don't see this stock too often as from what -----> we !!!  can gather was discontinued around the early 1990s. \n\nConsidering the circumstances it came out better than we had originally thought. This stock, to begin with, is known for a low contrast green/blue/cyan hue. Add 25+ years to that and I have to say the skin tones aren't all that bad. \n\nThe one thing I will say is that remjet removal was difficult and we could tell from the start as it did not rinse out. We had to process as normal and remove by hand under running water after it was complete.\n\nEveryone here seems to like to geek out over different stocks and methods so I just wanted to share a cool piece of history we got to process today. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a5diw2/afga_xt100_ecn2_processing_examples/"}, {"autor": "JerrySpider", "selftext": "I have 4 disposable cameras full of family pictures that were recently found in storage after a death in the family. So far I have developed one of them and the images are very faint because it is 800 speed film and background radiation/time has fogged them significantly. Is there anything I can do in the development process (extend development time, etc) to render the images slightly more usable? I've searched around online but while there are plenty of tips for shooting expired film, it's hard to find resources regarding developing very old film that has already been exposed. ", "title": "Developing exposed film from the late 90s/early 2000s", "num-comments": 0, "score": 1, "date": "2018-04-29 05:01:44", "content": "Developing exposed film from the late 90s/early 2000s /!/ I have 4 disposable cameras full of family pictures that were recently found in storage after a death in the family. So far -----> -----> I !!!  have developed !!!  one of them and the images are very faint because it is 800 speed film and background radiation/time has fogged them significantly. Is there anything I can do in the development process (extend development time, etc) to render the images slightly more usable? I've searched around online but while there are plenty of tips for shooting expired film, it's hard to find resources regarding developing very old film that has already been exposed. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8fpc59/developing_exposed_film_from_the_late_90searly/"}, {"autor": "gimlithepirate", "selftext": "Got my latest roll of film back from the photo lab. I do develop only at a local lab and then scan myself. Had 3 photos with a weird line on them (see example). The part that weirds me out is on a roll of 120, there were three photos that had this artifact, but they weren't sequential or anything like that.  \n\n\nAny ideas what would cause this sort of artifact? Camera was a Mamiya C22.\n\n*Processing img z6c032btovl11...*", "title": "Weird Scratch?", "num-comments": 6, "score": 3, "date": "2018-09-12 21:49:16", "content": "Weird Scratch? /!/ Got my latest roll of film back from the photo lab. -----> -----> I !!!  do develop !!!  only at a local lab and then scan myself. Had 3 photos with a weird line on them (see example). The part that weirds me out is on a roll of 120, there were three photos that had this artifact, but they weren't sequential or anything like that.  \n\n\nAny ideas what would cause this sort of artifact? Camera was a Mamiya C22.\n\n*Processing img z6c032btovl11...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9fc37k/weird_scratch/"}, {"autor": "tsuuni", "selftext": "I need to develop Kentmere 400 film with Fomadon LQN developer, but my brain hurts when I try to esimate the time for LQN based on other data. \n\nWhat time would you suggest?\n\nHere's some data from digitaltruth:\n\nIlford HP5+\tID-11\tstock\t400\t7.5\nKentmere 400\tID-11\tstock\t400\t9.5\n\nKentmere 400\tXtol\tstock\t400\t9\nIlford HP5+\tXtol\tstock\t400\t8.5\n\nKentmere 400\tD-76\tstock\t400\t9.5\nIlford HP5+\tD-76\tstock\t400\t7.5\n\nIlford HP5+\tFomadon LQN\t1+10\t400\t9.5\n\nalso some perspective from Tmax400:\n\nKodak TMax 400 \tFomadon LQN\t1+10\t400\t12\nKodak TMax 400\t        ID-11\tstock\t400\t7.5\n\nIf I use HP5+ as baseline (I've developed it with LQN) - it's 9.5 minutes. The combo HP5+ID-11 would be 7.5 minutes and Kentmere400+ID-11 9.5minutes. The difference is 21% so the combo Kentmere400+LQN would be then 11min 30 secs? Or?", "title": "Help me find dev time for Kentmere 400 with Fomadon LQN", "num-comments": 7, "score": 3, "date": "2018-09-26 17:41:30", "content": "Help me find dev time for Kentmere 400 with Fomadon LQN /!/ I need to develop Kentmere 400 film with Fomadon LQN developer, but my brain hurts when I try to esimate the time for LQN based on other data. \n\nWhat time would you suggest?\n\nHere's some data from digitaltruth:\n\nIlford HP5+\tID-11\tstock\t400\t7.5\nKentmere 400\tID-11\tstock\t400\t9.5\n\nKentmere 400\tXtol\tstock\t400\t9\nIlford HP5+\tXtol\tstock\t400\t8.5\n\nKentmere 400\tD-76\tstock\t400\t9.5\nIlford HP5+\tD-76\tstock\t400\t7.5\n\nIlford HP5+\tFomadon LQN\t1+10\t400\t9.5\n\nalso some perspective from Tmax400:\n\nKodak TMax 400 \tFomadon LQN\t1+10\t400\t12\nKodak TMax 400\t        ID-11\tstock\t400\t7.5\n\n-----> I !!! f -----> I !!!  use HP5+ as baseline (-----> -----> I !!! 've developed !!!  it with LQN) - it's 9.5 minutes. The combo HP5+ID-11 would be 7.5 minutes and Kentmere400+ID-11 9.5minutes. The difference is 21% so the combo Kentmere400+LQN would be then 11min 30 secs? Or?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9j4pzs/help_me_find_dev_time_for_kentmere_400_with/"}, {"autor": "32-hz", "selftext": "I've been developing for a while but I've always seemed to have this pinkish hue to HP5 and Trix specifically. I've read up on it and I've tried some baking soda and extending the wash process but I cant seem to get rid of it. I'm fairly certain they aren't underfixed.\n\nI'm using HC110 and Kodafix\n\nAny Ideas?", "title": "Pinkish hue to TriX and HP5", "num-comments": 12, "score": 5, "date": "2018-09-25 21:14:34", "content": "Pinkish hue to TriX and HP5 /!/ -----> -----> I !!! 've been developing !!!  for a while but I've always seemed to have this pinkish hue to HP5 and Trix specifically. I've read up on it and I've tried some baking soda and extending the wash process but I cant seem to get rid of it. I'm fairly certain they aren't underfixed.\n\nI'm using HC110 and Kodafix\n\nAny Ideas?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9iw68e/pinkish_hue_to_trix_and_hp5/"}], "name": "AnalogCommunity_2018", "Procedure": [{"content": "PRON", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "PART", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "AUX", "display": "selector"}, {"content": "directly followed by", "display": "description"}, {"content": "VERBV", "display": "selector"}], "SearchParam": [["I", "we", "us", "me", "our"], ["invent", "made-up", "create", "develop", "improve", "engineer", "develope", "design", "prototype"]]}