{"interestingcomments": [{"autor": "Modern_chemistry", "selftext": "I was wondering if there are any relatively cheap macro lenses that I could use to \"scan\" negatives using my Nikon D40x.  I'm just dabbling in photography at this point, so not tryin to drop a bunch of money, but if I could develop and \"dslr-scan\" my photos at home that would be pretty awesome.\n\nthanks!", "title": "Budget Nikon Macro Lens (D40x) - for DSLR scanning?", "num-comments": 5, "score": 1, "date": "2021-04-01 22:46:51", "content": "Budget Nikon Macro Lens (D40x) - for DSLR scanning? /!/ I was wondering if there are any relatively cheap macro lenses that I could use to \"scan\" negatives using my Nikon D40x.  -----> I !!! 'm just dabbling in photography at this point, so not tryin to drop a bunch of money, but if -----> -----> I !!!  could develop !!!  and \"dslr-scan\" my photos at home that would be pretty awesome.\n\nthanks!", "link": "https://www.reddit.com/r/Cameras/comments/mi71sd/budget_nikon_macro_lens_d40x_for_dslr_scanning/"}, {"autor": "Important-Leather624", "selftext": "I've created a store on eBay. I am looking to buy a camera to take product photos. Can you suggest any best camera available?", "title": "What are the best cameras for sellers?", "num-comments": 8, "score": 1, "date": "2021-03-28 06:32:05", "content": "What are the best cameras for sellers? /!/ -----> -----> I !!! 've created !!!  a store on eBay. I am looking to buy a camera to take product photos. Can you suggest any best camera available?", "link": "https://www.reddit.com/r/Cameras/comments/mew39e/what_are_the_best_cameras_for_sellers/"}, {"autor": "Silence_Corner", "selftext": "I designed an automatic magnetic Buckle for camera\"Squid system\", I want to know your opinion \n\nI know what you want to say. You want to say this is very similar to Peak Design’s Anchor Links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nThe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nAs long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200B;\n\n Tell me your opinion, good or bad \\^\\^", "title": "I designed an automatic magnetic Buckle for camera, I want to know your opinion It name \"Squid system\"", "num-comments": 19, "score": 1, "date": "2021-01-14 05:42:28", "content": "-----> -----> I !!!  designed !!!  an automatic magnetic Buckle for camera, -----> I !!!  want to know your opinion -----> I !!! t name \"Squid system\" /!/ I designed an automatic magnetic Buckle for camera\"Squid system\", I want to know your opinion \n\nI know what you want to say. You want to say this is very similar to Peak Design’s Anchor Links, right? \n\nbut, we use a magnet, you don't need to use any force when you buckle, as long as you get close, it will directly attract. \n\n  \nThe way to separate them is to push the silver push button, the internal lock will automatically release, it just puts in and takes out.   \n \n\nAs long as there are metal strap holes on both sides of your camera, you can use it and connect the strap with magnetic attraction. \n\n&amp;#x200B;\n\n Tell me your opinion, good or bad \\^\\^", "link": "https://www.reddit.com/r/Cameras/comments/kwzgx9/i_designed_an_automatic_magnetic_buckle_for/"}, {"autor": "jancinematography", "selftext": "In this [Video](https://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s) i am taking a few cool pictures out in Snowy Nature with my a7iii 28-70mm.\nGo have a quick look at what I created!\n\nhttps://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s", "title": "Sony a7iii POV Photography", "num-comments": 1, "score": 1, "date": "2021-01-13 19:45:25", "content": "Sony a7iii POV Photography /!/ In this [Video](https://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s) i am taking a few cool pictures out in Snowy Nature with my a7iii 28-70mm.\nGo have a quick look at what -----> -----> I !!!  created !!! !\n\nhttps://www.youtube.com/watch?v=1oL2H_5cY0w&amp;t=75s", "link": "https://www.reddit.com/r/Cameras/comments/kwo78c/sony_a7iii_pov_photography/"}, {"autor": "alexl1994", "selftext": "I'm a hobbyist/enthusiast photography shooting on a Canon EOS 90D. I primarily shoot landscapes, wildlife (when the occasion calls for it), and street/urban photography.\n\nAs I develop my skills and move away from kit lenses, I've bought a **Sigma 18-35mm f/1.8** and a **Canon 70-200mm f/4L**. I love the wide aperture of the Sigma, and the focal range isn't as limiting as I originally thought it'd be. Even though I don't often find myself needing something in the 40/50/60mm range, it *does* feel like there's a big gap between these two lenses, and I'd like to fill it.\n\nSo, what fills the space of that 35-70mm range? I've looked at the:\n\n* Canon 17-55mm f/2.8, which I'm worried has too much focal-length overlap with the Sigma and so one wouldn't get used much compared to the other\n* Several 24-70mm f/2.8 lenses—these seem to be for full frame but might also be compatible with APS-C (at least in the case of the Sigma 24-70mm); these also have the most attractive focal length, but again compatibility might be an issue\n* Sigma 50-100mm f/1.8, which would complement the other Sigma well\n\nAny thoughts?", "title": "Which lens completes this collection? Looking for a standard zoom for Canon APS-C cameras", "num-comments": 4, "score": 1, "date": "2021-01-11 22:19:06", "content": "Which lens completes this collection? Looking for a standard zoom for Canon APS-C cameras /!/ I'm a hobbyist/enthusiast photography shooting on a Canon EOS 90D. I primarily shoot landscapes, wildlife (when the occasion calls for it), and street/urban photography.\n\nAs -----> -----> I !!!  develop !!!  my skills and move away from kit lenses, -----> I !!! 've bought a **Sigma 18-35mm f/1.8** and a **Canon 70-200mm f/4L**. I love the wide aperture of the Sigma, and the focal range isn't as limiting as I originally thought it'd be. Even though I don't often find myself needing something in the 40/50/60mm range, it *does* feel like there's a big gap between these two lenses, and I'd like to fill it.\n\nSo, what fills the space of that 35-70mm range? I've looked at the:\n\n* Canon 17-55mm f/2.8, which I'm worried has too much focal-length overlap with the Sigma and so one wouldn't get used much compared to the other\n* Several 24-70mm f/2.8 lenses—these seem to be for full frame but might also be compatible with APS-C (at least in the case of the Sigma 24-70mm); these also have the most attractive focal length, but again compatibility might be an issue\n* Sigma 50-100mm f/1.8, which would complement the other Sigma well\n\nAny thoughts?", "link": "https://www.reddit.com/r/Cameras/comments/kvdn4o/which_lens_completes_this_collection_looking_for/"}, {"autor": "psy_high", "selftext": "I live in Ontario, Canada and am out in the market to purchase my first camera. I have been using cameras for many years now but never owned a camera. My father was a hobbyist and over the years I have developed an interest in this art and want to continue following his hobby now that he isn’t with us anymore. I am interested in learning landscape and astrophotography as my main focus with some macro and portraits every now and then. \n\nPlease note : I do not own any camera or lenses so I am open to choosing any other system if it’s better than Nikon\n\nWith a budget of around $2000 CAD, my first choice was a DSLR. But with the increasing popularity of mirrorless systems, I am leaning more towards investing in these latest technologies. The cameras I like so far are the Nikon Z5 (Z6 is beyond my budget), Fujifilm X-T3 or X-S10, Sony A7 II or 6600, Canon EOS RP. Among these, I like the Nikon the best.\n\nCurrently I am being offered the following options for the Nikon Z5\n\n1. Nikon Z5 + 24-50mm f4-6.3 S+ FTZ for $1699\n\n2. Nikon Z5 + 24-70mm f4 S+ FTZ for $2099\n\n3. Nikon Z5 + FTZ for $1369\n\nWith so many options, I am confused with which kit to go with. My initial choice was the 24-50mm but was told that the 24-70 f4 is a significant improvement but I am not sure if it is worth the added cost. I am also considering getting just the body + FTZ and spending the money I save on some used F mount glass to go with the adapter. \n\nI would really appreciate if someone could help me decide on what to invest in.", "title": "Looking for my first camera under $2000 CAD. Liking the Nikon Z5 so far. Suggestions?", "num-comments": 14, "score": 1, "date": "2021-05-14 14:50:04", "content": "Looking for my first camera under $2000 CAD. Liking the Nikon Z5 so far. Suggestions? /!/ I live in Ontario, Canada and am out in the market to purchase my first camera. I have been using cameras for many years now but never owned a camera. My father was a hobbyist and over the years -----> -----> I !!!  have developed !!!  an interest in this art and want to continue following his hobby now that he isn’t with us anymore. I am interested in learning landscape and astrophotography as my main focus with some macro and portraits every now and then. \n\nPlease note : I do not own any camera or lenses so I am open to choosing any other system if it’s better than Nikon\n\nWith a budget of around $2000 CAD, my first choice was a DSLR. But with the increasing popularity of mirrorless systems, I am leaning more towards investing in these latest technologies. The cameras I like so far are the Nikon Z5 (Z6 is beyond my budget), Fujifilm X-T3 or X-S10, Sony A7 II or 6600, Canon EOS RP. Among these, I like the Nikon the best.\n\nCurrently I am being offered the following options for the Nikon Z5\n\n1. Nikon Z5 + 24-50mm f4-6.3 S+ FTZ for $1699\n\n2. Nikon Z5 + 24-70mm f4 S+ FTZ for $2099\n\n3. Nikon Z5 + FTZ for $1369\n\nWith so many options, I am confused with which kit to go with. My initial choice was the 24-50mm but was told that the 24-70 f4 is a significant improvement but I am not sure if it is worth the added cost. I am also considering getting just the body + FTZ and spending the money I save on some used F mount glass to go with the adapter. \n\nI would really appreciate if someone could help me decide on what to invest in.", "link": "https://www.reddit.com/r/Cameras/comments/ncaeqm/looking_for_my_first_camera_under_2000_cad_liking/"}, {"autor": "wily9999", "selftext": "nan", "title": "I created this page to share my work, see other film photographers work &amp; make some some new friends.", "num-comments": 2, "score": 2, "date": "2021-06-14 11:22:26", "content": "-----> -----> I !!!  created !!!  this page to share my work, see other film photographers work &amp; make some some new friends.", "link": "https://www.reddit.com/r/Cameras/comments/nzkkfx/i_created_this_page_to_share_my_work_see_other/"}, {"autor": "ProjectAnalog", "selftext": "nan", "title": "I designed a Hasselblad V Film Back Cover. Protect your equipment and get yours today!", "num-comments": 0, "score": 1, "date": "2021-01-22 20:26:44", "content": "-----> -----> I !!!  designed !!!  a Hasselblad V Film Back Cover. Protect your equipment and get yours today!", "link": "https://www.reddit.com/r/Cameras/comments/l2w8qy/i_designed_a_hasselblad_v_film_back_cover_protect/"}, {"autor": "WholesomeMindbreak", "selftext": "So I impulsively bought this camera 2nd hand online and nowI cant return it. The picture and video quality are just horrible, super grainy and soft. I spent about an hour messin with the settings and nothing seems to help its just bad. I have older cheaper cameras that take better pic than it aswell as my phone, I have a samsung s20fe. I wanted a compact camera that was better than my phone so the shitty quality completely defeats the purpose.\n\nI posted it for resale online and I already have an offer but Im nervous about selling if there is a possibility I can improve the image since I did get it for a really nice price. So is there no way the quality can be improved? I was thinking of getting either the canon m200 or the m50.", "title": "Does the canon powershot xs 740 hs just suck?", "num-comments": 5, "score": 1, "date": "2021-08-11 01:36:47", "content": "Does the canon powershot xs 740 hs just suck? /!/ So I impulsively bought this camera 2nd hand online and nowI cant return it. The picture and video quality are just horrible, super grainy and soft. I spent about an hour messin with the settings and nothing seems to help its just bad. I have older cheaper cameras that take better pic than it aswell as my phone, I have a samsung s20fe. I wanted a compact camera that was better than my phone so the shitty quality completely defeats the purpose.\n\nI posted it for resale online and I already have an offer but -----> I !!! m nervous about selling if there is a possibility -----> -----> I !!!  can improve !!!  the image since -----> I !!!  did get it for a really nice price. So is there no way the quality can be improved? I was thinking of getting either the canon m200 or the m50.", "link": "https://www.reddit.com/r/Cameras/comments/p234w8/does_the_canon_powershot_xs_740_hs_just_suck/"}, {"autor": "Traditional-Scale-42", "selftext": "nan", "title": "We designed PlateZ to expand the capabilities of your camera without having to purchase multiple expensive products. Our goal is to create the platform to add all your accessories and expand their functionality with PlateZ.", "num-comments": 0, "score": 1, "date": "2021-08-18 02:04:59", "content": "-----> -----> We !!!  designed !!!  PlateZ to expand the capabilities of your camera without having to purchase multiple expensive products. Our goal is to create the platform to add all your accessories and expand their functionality with PlateZ.", "link": "https://www.reddit.com/r/Cameras/comments/p6htem/we_designed_platez_to_expand_the_capabilities_of/"}, {"autor": "minimal-camera", "selftext": "TL:DR: Looking for a new small body camera mostly for video work, budget around $1000 USD.\n\nHowdy! First post in this sub, but I've been doing photo/video for over 20 years now. I'm looking for a new 'B cam' and wanted to get some input. My 'A cam' is a Canon 80D with EF-S 17-55mm f/2.8, which is perfect for indoor photo/video (and I have a variety of other canon EF and EF-S lenses as well, all of which are lower quality). My other DSLRs are also Canons with Magic Lantern (SL1 and 50D), which I plan to sell or give away, probably with some of my older lenses. And my phone is a Pixel 4, which has a decent camera, but I only really use it for still photos of my kid, and work stuff.\n\nFor the new camera I want to buy, the primary use-case will be over-the-shoulder or overhead flatlay video, I would use it for this 90% of the time. I have a YouTube channel and post everything there. Everything I publish is 1080p, but I'm somewhat interested in 4K for the ability to zoom in post (I make a lot of tutorials, so this would be very useful for highlighting something I'm talking about). I'm OK with sticking with 1080p though. I have a beefy computer (with GTX-1080 GPU) which should be able to handle 4K video editing, but I've never tried it.\n\nCurrently I don't use autofocus for video work, but instead I tend to use zone focusing. I'm happy to stick with this, but if the camera has high quality autofocus, I would probably use it. I would also prefer to have a flipout screen, and/or the ability to use an external monitor as a screen, to help with focus on overhead shots. One of my primary motivations for a new camera is the difficulty of getting a good in-focus video shot with the SL1 (I have it connected to a computer monitor to help with this, but still the results are often garbage).\n\nThe secondary use case (\\~10%) would be travel and street photography. I want something compact enough that it can fit in my pocket. I really prefer an OVF for street photography, but I don't think I'm going to get one here (a rangefinder style OVF would be fine with me). I don't like EVFs at all, if it is all digital then I would prefer to just use the screen.\n\nDecent low light video performance is also important to me, because I really don't enjoy sitting in my home studio with bright video lights. So I tend to shoot in warmer and dimmer light conditions (typically bouncing light off the wall or ceiling for a softbox effect). My SL1 video comes out pretty grainy a lot of the time in low light, but the 80D handles it no problem.\n\nIt would also be super nice if the video didn't have the stupid 30 min video recording limit, but I know most do. I'm used to working around that with my Canons, so no big deal. Another thing that is very convenient is the ability to power it with AC or USB power, and I'm happy to buy an adapter for this. This helps prolong battery lifespan and is just generally more convenient when I'm in my home studio. The ability to charge the camera battery via USB would be nice for travel.\n\nHere's an example of the problem I'm trying to solve. At the beginning of the video you'll see my A Cam (80D) shot looks nice:\n\n[https://youtu.be/xBXPumtlB04?t=8](https://youtu.be/xBXPumtlB04?t=8)  \n\n\nBut skip ahead and you'll see my B cam (SL1) overhead shot looks pretty bad, and where I zoom in on the screen in post looks downright terrible:\n\n[https://youtu.be/xBXPumtlB04?t=445](https://youtu.be/xBXPumtlB04?t=445)\n\n&amp;#x200B;\n\nI'm open to buying two separate cameras for these use cases, because I understand that asking a single camera to do both things is a lot to ask. Frankly it would be more convenient to have separate cameras. But the concern then becomes the cost. I'm comfortable with a budget in the $1000 USD range, and could stretch to $1500 USD. But I'm just not ready to plop down $2k-$3k.  \n\n\nOne camera I've looked at thus far is the Sony ZV-1. The price is right and it seems like a good fit for my B Cam video work, but I doubt its abilities as a travel/street photography camera. I also kind of hate the branding as a 'vlogger camera' but I can get past that :)  In the past I've also drooled over Panasonic and Fujifilm offerings. I'm definitely most comfortable with Canon, though their menu systems aren't great, I love the image quality. I've never got along all that well with Nikon, mostly because the zoom/focus ring being reverse of Canon lenses, which throws me off. I'm open to anything though.\n\nAt some point I'll create a post of my vintage film camera collection, I have shelves full of them :)\n\nThank you!", "title": "Recommend a camera for 90% video use and 10% travel/street photography", "num-comments": 15, "score": 1, "date": "2021-09-17 15:53:00", "content": "Recommend a camera for 90% video use and 10% travel/street photography /!/ TL:DR: Looking for a new small body camera mostly for video work, budget around $1000 USD.\n\nHowdy! First post in this sub, but I've been doing photo/video for over 20 years now. I'm looking for a new 'B cam' and wanted to get some input. My 'A cam' is a Canon 80D with EF-S 17-55mm f/2.8, which is perfect for indoor photo/video (and I have a variety of other canon EF and EF-S lenses as well, all of which are lower quality). My other DSLRs are also Canons with Magic Lantern (SL1 and 50D), which I plan to sell or give away, probably with some of my older lenses. And my phone is a Pixel 4, which has a decent camera, but I only really use it for still photos of my kid, and work stuff.\n\nFor the new camera I want to buy, the primary use-case will be over-the-shoulder or overhead flatlay video, I would use it for this 90% of the time. I have a YouTube channel and post everything there. Everything I publish is 1080p, but I'm somewhat interested in 4K for the ability to zoom in post (I make a lot of tutorials, so this would be very useful for highlighting something I'm talking about). I'm OK with sticking with 1080p though. I have a beefy computer (with GTX-1080 GPU) which should be able to handle 4K video editing, but I've never tried it.\n\nCurrently I don't use autofocus for video work, but instead I tend to use zone focusing. I'm happy to stick with this, but if the camera has high quality autofocus, I would probably use it. I would also prefer to have a flipout screen, and/or the ability to use an external monitor as a screen, to help with focus on overhead shots. One of my primary motivations for a new camera is the difficulty of getting a good in-focus video shot with the SL1 (I have it connected to a computer monitor to help with this, but still the results are often garbage).\n\nThe secondary use case (\\~10%) would be travel and street photography. I want something compact enough that it can fit in my pocket. I really prefer an OVF for street photography, but I don't think I'm going to get one here (a rangefinder style OVF would be fine with me). I don't like EVFs at all, if it is all digital then I would prefer to just use the screen.\n\nDecent low light video performance is also important to me, because I really don't enjoy sitting in my home studio with bright video lights. So I tend to shoot in warmer and dimmer light conditions (typically bouncing light off the wall or ceiling for a softbox effect). My SL1 video comes out pretty grainy a lot of the time in low light, but the 80D handles it no problem.\n\nIt would also be super nice if the video didn't have the stupid 30 min video recording limit, but I know most do. I'm used to working around that with my Canons, so no big deal. Another thing that is very convenient is the ability to power it with AC or USB power, and I'm happy to buy an adapter for this. This helps prolong battery lifespan and is just generally more convenient when I'm in my home studio. The ability to charge the camera battery via USB would be nice for travel.\n\nHere's an example of the problem I'm trying to solve. At the beginning of the video you'll see my A Cam (80D) shot looks nice:\n\n[https://youtu.be/xBXPumtlB04?t=8](https://youtu.be/xBXPumtlB04?t=8)  \n\n\nBut skip ahead and you'll see my B cam (SL1) overhead shot looks pretty bad, and where I zoom in on the screen in post looks downright terrible:\n\n[https://youtu.be/xBXPumtlB04?t=445](https://youtu.be/xBXPumtlB04?t=445)\n\n&amp;#x200B;\n\nI'm open to buying two separate cameras for these use cases, because I understand that asking a single camera to do both things is a lot to ask. Frankly it would be more convenient to have separate cameras. But the concern then becomes the cost. I'm comfortable with a budget in the $1000 USD range, and could stretch to $1500 USD. But I'm just not ready to plop down $2k-$3k.  \n\n\nOne camera I've looked at thus far is the Sony ZV-1. The price is right and it seems like a good fit for my B Cam video work, but I doubt its abilities as a travel/street photography camera. I also kind of hate the branding as a 'vlogger camera' but I can get past that :)  In the past I've also drooled over Panasonic and Fujifilm offerings. I'm definitely most comfortable with Canon, though their menu systems aren't great, I love the image quality. I've never got along all that well with Nikon, mostly because the zoom/focus ring being reverse of Canon lenses, which throws me off. I'm open to anything though.\n\nAt some point -----> -----> I !!! 'll create !!!  a post of my vintage film camera collection, -----> I !!!  have shelves full of them :)\n\nThank you!", "link": "https://www.reddit.com/r/Cameras/comments/pq2sqj/recommend_a_camera_for_90_video_use_and_10/"}, {"autor": "subliminalmms", "selftext": "Hey all, I've happened into the business of social media this year which means I'm expected to produce high quality photo and video on a regular basis. \n\nI already had on hand the G7X Mark II and I'm currently running a Galaxy Note 8 (but will likely be upgrading the phone within the next year or so). \n\nI'm somewhere between novice and intermediate when it comes to camera work so I'm not sure how much of it is user error but I just find that most of the footage I take for work these days with the G7X II is total ass unless im doing macro-ish stuff (and its not even a good macro camera) or casual vlogging (which doesnt serve any purpose in the content im creating as I run pages for brands). \n\nSome of my content is street photography and I can manage some really nice still shots with the G7x despite the limitations of the point and shoot, the issue is mostly video which is what the camera is supposed to be for?\n\nI find that the focus is unreliable as well as the quality though ive gone through my settings many times searching for the best options.\n\nI'll insert two links to posts Ive created with footage from the G7x that I feel are simply horrendous but I had no choice.\n\nhttps://www.instagram.com/tv/COTqJythhNa/?igshid=3eu966jf06wh\n\nhttps://www.instagram.com/p/CJbRfsZFvqQ/?igshid=qv4bz6us4vnm\n\nThe first one has no correction as i didnt have the time but it wouldnt have helped anyway. As you can see, the second video likely would have been better just left raw. \n\nThe audio alone is enough to make me want to upgrade, though, I do have access to a zoom mic, id much rather spend 30 bucks on a nice little camera mic that i dont have to rig seperately. \n\nHeres my dillemma:\n\nI'm interested in the Canon SL2/200D but the pricetag is steep for me in my current situation... I'd like to hold on to the G7x for out and about or situations where convenience of its size might outweigh the need for quality. The issue is, I could knock a few hundy off the SL2 if i sold my G7x and I'm thinking that if i'll be upgrading my Smartphone at some point in the near future, is there really any advantage to keeping the G7x II? I don't really even vlog personally anymore but the camera has a little bit of a nostalgia for me so I'm having a pretty hard time deciding what to do, i just can't stand to keep putting out this low quality content. \n\nAny thoughts or advice would be much appreciated!", "title": "G7X ii vs. Smartphone vs. SL2/200D ??", "num-comments": 2, "score": 1, "date": "2021-05-04 14:15:17", "content": "G7X ii vs. Smartphone vs. SL2/200D ?? /!/ Hey all, I've happened into the business of social media this year which means I'm expected to produce high quality photo and video on a regular basis. \n\nI already had on hand the G7X Mark II and I'm currently running a Galaxy Note 8 (but will likely be upgrading the phone within the next year or so). \n\nI'm somewhere between novice and intermediate when it comes to camera work so I'm not sure how much of it is user error but -----> I !!!  just find that most of the footage -----> I !!!  take for work these days with the G7X -----> I !!! -----> I !!!  is total ass unless im doing macro-ish stuff (and its not even a good macro camera) or casual vlogging (which doesnt serve any purpose in the content -----> im creating !!!  as -----> I !!!  run pages for brands). \n\nSome of my content is street photography and I can manage some really nice still shots with the G7x despite the limitations of the point and shoot, the issue is mostly video which is what the camera is supposed to be for?\n\nI find that the focus is unreliable as well as the quality though ive gone through my settings many times searching for the best options.\n\nI'll insert two links to posts Ive created with footage from the G7x that I feel are simply horrendous but I had no choice.\n\nhttps://www.instagram.com/tv/COTqJythhNa/?igshid=3eu966jf06wh\n\nhttps://www.instagram.com/p/CJbRfsZFvqQ/?igshid=qv4bz6us4vnm\n\nThe first one has no correction as i didnt have the time but it wouldnt have helped anyway. As you can see, the second video likely would have been better just left raw. \n\nThe audio alone is enough to make me want to upgrade, though, I do have access to a zoom mic, id much rather spend 30 bucks on a nice little camera mic that i dont have to rig seperately. \n\nHeres my dillemma:\n\nI'm interested in the Canon SL2/200D but the pricetag is steep for me in my current situation... I'd like to hold on to the G7x for out and about or situations where convenience of its size might outweigh the need for quality. The issue is, I could knock a few hundy off the SL2 if i sold my G7x and I'm thinking that if i'll be upgrading my Smartphone at some point in the near future, is there really any advantage to keeping the G7x II? I don't really even vlog personally anymore but the camera has a little bit of a nostalgia for me so I'm having a pretty hard time deciding what to do, i just can't stand to keep putting out this low quality content. \n\nAny thoughts or advice would be much appreciated!", "link": "https://www.reddit.com/r/Cameras/comments/n4pcy7/g7x_ii_vs_smartphone_vs_sl2200d/"}, {"autor": "Abductor_", "selftext": "Hi guys, so quick intro, I’ve been into photography for 5 months and i really enjoyed it, I believe i improved alot with ny nikon d5600, with two standard lens - 18-55 mm and 70-300 mm. So my plan is to buy a prime lens (maybe 1 or 2months) and there’s alot variation of prime lens I did some research and tbh there’s alot type of prime lens, so I’m not sure which one should i choose for my next prime lens.\n\nSo far the specific lens i know about .. af-s dx nikkor 35mm f1.8g lens Af-s nikkor 50mm f1.8g\n\nAny recommendations for my first prime lens?", "title": "Nikon prime lens suggestions", "num-comments": 3, "score": 1, "date": "2021-05-03 06:33:53", "content": "Nikon prime lens suggestions /!/ Hi guys, so quick intro, -----> I !!! ’ve been into photography for 5 months and i really enjoyed it, -----> I !!!  believe -----> i improved !!!  alot with ny nikon d5600, with two standard lens - 18-55 mm and 70-300 mm. So my plan is to buy a prime lens (maybe 1 or 2months) and there’s alot variation of prime lens I did some research and tbh there’s alot type of prime lens, so I’m not sure which one should i choose for my next prime lens.\n\nSo far the specific lens i know about .. af-s dx nikkor 35mm f1.8g lens Af-s nikkor 50mm f1.8g\n\nAny recommendations for my first prime lens?", "link": "https://www.reddit.com/r/Cameras/comments/n3pn0j/nikon_prime_lens_suggestions/"}, {"autor": "XxXKillzaXxX", "selftext": "nan", "title": "Got my first camera at the start of the weekend. The Canon eos 7D. i love the build quality and all but i expected to have better photo quality. I got a kit Canon 18-55mm lens. Em i doing something wrong and how can i improve. The photo i post is edited, the original disappeard after using Lightroo", "num-comments": 99, "score": 38, "date": "2021-08-20 20:24:45", "content": "Got my first camera at the start of the weekend. The Canon eos 7D. i love the build quality and all but i expected to have better photo quality. I got a kit Canon 18-55mm lens. Em -----> i !!!  do-----> i !!! ng someth-----> i !!! ng wrong and how can -----> -----> i !!!  -----> i !!! mprove !!! . The photo i post is edited, the original disappeard after using Lightroo", "link": "https://www.reddit.com/r/Cameras/comments/p8d7g8/got_my_first_camera_at_the_start_of_the_weekend/"}, {"autor": "AAidan7", "selftext": "Hey all!\n\nI recently finished a photography class using a DSLR that my school provided. I don't remember the exact model but I believe it was some sort of Canon.  Through the course I developed a love for photography and I've always had a love for videography as well. I know it's basically impossible for a camera to be amazing at both photos and videos, especially at a reasonable price. However I'm more looking for a camera that's a jack of all trades, master of none. As long as it does good photos, and good videos I would be fine. With the DSLR we had I couldn't even control any of the properties when filming, it was all automated which was very annoying. So if the camera records well and can be put in manual that would be great! If anyone has any suggestions that isn't too absurdly priced that would be greatly appreciated! I do know that cameras, especially good ones tend to cost a lot, but I'm ready to put down some money towards one if it'll be what I need and last me years. Thank you!", "title": "Good beginner camera that's good for both photo and video?", "num-comments": 19, "score": 1, "date": "2021-07-15 15:27:41", "content": "Good beginner camera that's good for both photo and video? /!/ Hey all!\n\nI recently finished a photography class using a DSLR that my school provided. I don't remember the exact model but I believe it was some sort of Canon.  Through the course -----> -----> I !!!  developed !!!  a love for photography and -----> I !!! 've always had a love for videography as well. I know it's basically impossible for a camera to be amazing at both photos and videos, especially at a reasonable price. However I'm more looking for a camera that's a jack of all trades, master of none. As long as it does good photos, and good videos I would be fine. With the DSLR we had I couldn't even control any of the properties when filming, it was all automated which was very annoying. So if the camera records well and can be put in manual that would be great! If anyone has any suggestions that isn't too absurdly priced that would be greatly appreciated! I do know that cameras, especially good ones tend to cost a lot, but I'm ready to put down some money towards one if it'll be what I need and last me years. Thank you!", "link": "https://www.reddit.com/r/Cameras/comments/okv55v/good_beginner_camera_thats_good_for_both_photo/"}, {"autor": "Lucalattanzio97", "selftext": "Let's start by saying I'm an amateur. I have a canon 90d with 17-50 and 50-150 f/2.8 and a 30mm f/1.4. I'm really content with what I have so this is just a discussion for the sake of it. \n\nI bought my 90d thinking it will be my last dslr, so I plan on keeping it and maybe buying a mirrorless later on down the line. For now I'm just wondering what could complement my canon. I was thinking a fujifilm gfx100s. It has suuuuper nice low lights capabilities, and the mega frame sensor could be a nice detour from the crop on my canon. Also the videos are much better on it. I also looked at the sony a7s or fx3 which are made specifically for videos but are not grate to take photos. I mean, I know there are better options like the standard a7 or even the a1, but then they would replace completely my canon, and I wouldn't want that. Also, I prefer cameras without the lower grip (I wouldn't consider the gfx 100 for that exact reason). I'm looking for something nice in low lights, full sensor for sure, that has nice video capabilities and that cannot replace my canon (and this is maybe the most important thing). Just throw down here your opinion/suggestions/experiences.\n\nI'll also leave a photo of my cousin I took a few days ago, so if you want to say something that could help me improve my skills you're welcome and appreciated.\n\n[40mm   f\\/2.8   1\\/3200   ISO250](https://preview.redd.it/ijagmjmayin71.jpg?width=4640&amp;format=pjpg&amp;auto=webp&amp;s=9157a0aa9b52bcb7b2a3b6846d5383c006e0f379)", "title": "just a random discussion", "num-comments": 11, "score": 1, "date": "2021-09-14 20:21:22", "content": "just a random discussion /!/ Let's start by saying I'm an amateur. I have a canon 90d with 17-50 and 50-150 f/2.8 and a 30mm f/1.4. I'm really content with what I have so this is just a discussion for the sake of it. \n\nI bought my 90d thinking it will be my last dslr, so I plan on keeping it and maybe buying a mirrorless later on down the line. For now I'm just wondering what could complement my canon. I was thinking a fujifilm gfx100s. It has suuuuper nice low lights capabilities, and the mega frame sensor could be a nice detour from the crop on my canon. Also the videos are much better on it. I also looked at the sony a7s or fx3 which are made specifically for videos but are not grate to take photos. I mean, I know there are better options like the standard a7 or even the a1, but then they would replace completely my canon, and I wouldn't want that. Also, I prefer cameras without the lower grip (I wouldn't consider the gfx 100 for that exact reason). I'm looking for something nice in low lights, full sensor for sure, that has nice video capabilities and that cannot replace my canon (and this is maybe the most important thing). Just throw down here your opinion/suggestions/experiences.\n\n-----> I !!! 'll also leave a photo of my cousin -----> I !!!  took a few days ago, so if you want to say something that could help -----> me improve !!!  my skills you're welcome and appreciated.\n\n[40mm   f\\/2.8   1\\/3200   ISO250](https://preview.redd.it/ijagmjmayin71.jpg?width=4640&amp;format=pjpg&amp;auto=webp&amp;s=9157a0aa9b52bcb7b2a3b6846d5383c006e0f379)", "link": "https://www.reddit.com/r/Cameras/comments/poashw/just_a_random_discussion/"}], "name": "Cameras_2021", "Procedure": [{"content": "PRON", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "PART", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "AUX", "display": "selector"}, {"content": "directly followed by", "display": "description"}, {"content": "VERBV", "display": "selector"}], "SearchParam": [["I", "we", "us", "me", "our"], ["invent", "made-up", "create", "develop", "improve", "engineer", "develope", "design", "prototype"]]}