{"interestingcomments": [{"autor": "AppoTheApple", "selftext": "So to start, I was going back and forth between the Nikon D7200 and the Sony A77; however, that's only because all I've owned in the past are basic cameras from Sony or Nikon, so I thought it best to turn to the experts.\n\nThe camera will primarily be used for taking pictures of landscapes or people from a close distance. Oh, and occasionally cars.\n\n\nEdit: Minor text fixes.\nWhat camera/lens combo should I invest in right now? I'd like it to be pretty beginner friendly but something where I can continue to take better pictures as I improve (Obviously...).\nThanks!", "title": "Yet another \"Help Me Pick A Camera\" thread... Beginner with about a $1500 budget", "num-comments": 4, "score": 1, "date": "2018-02-18 22:13:05", "content": "Yet another \"Help Me Pick A Camera\" thread... Beginner with about a $1500 budget /!/ So to start, I was going back and forth between the Nikon D7200 and the Sony A77; however, that's only because all I've owned in the past are basic cameras from Sony or Nikon, so I thought it best to turn to the experts.\n\nThe camera will primarily be used for taking pictures of landscapes or people from a close distance. Oh, and occasionally cars.\n\n\nEdit: Minor text fixes.\nWhat camera/lens combo should I invest in right now? -----> I !!! 'd like it to be pretty beginner friendly but something where -----> I !!!  can continue to take better pictures as -----> -----> I !!!  improve !!!  (Obviously...).\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/7yhtlg/yet_another_help_me_pick_a_camera_thread_beginner/"}, {"autor": "RedFoxThirteen", "selftext": "Hello, What sort of camera do you use to make the stop motion. The shot at 3:00. I would really really love to create this effect. I want to re-create this with my house plants and film them growing. What is the best way to achieve this. I would also like to leave the camera filming the same plant for months, maybe even a year or something crazy. What is the best way to go about this as the camera would need to stay plugged in. \n\nhttps://youtu.be/0LETLLl6mxo\n\nCan someone who knows camera's / video editing well please give me some tips as this is not an area I am particularly educated on the latest. Thank you \n\nMy price range is anywhere from $100 - $890\n\n\nMore examples: \n\nhttps://youtu.be/jyRw597JBVg\n\nhttps://youtu.be/Z-iPp6yn0hw", "title": "How do I create stop motion effect over extended periods of time?", "num-comments": 3, "score": 2, "date": "2018-04-09 13:59:44", "content": "How do -----> -----> I !!!  create !!!  stop motion effect over extended periods of time? /!/ Hello, What sort of camera do you use to make the stop motion. The shot at 3:00. I would really really love to create this effect. I want to re-create this with my house plants and film them growing. What is the best way to achieve this. I would also like to leave the camera filming the same plant for months, maybe even a year or something crazy. What is the best way to go about this as the camera would need to stay plugged in. \n\nhttps://youtu.be/0LETLLl6mxo\n\nCan someone who knows camera's / video editing well please give me some tips as this is not an area I am particularly educated on the latest. Thank you \n\nMy price range is anywhere from $100 - $890\n\n\nMore examples: \n\nhttps://youtu.be/jyRw597JBVg\n\nhttps://youtu.be/Z-iPp6yn0hw", "link": "https://www.reddit.com/r/Cameras/comments/8aym67/how_do_i_create_stop_motion_effect_over_extended/"}, {"autor": "flounderjaw", "selftext": "Just curious to know if the   Olympus EM10 Mark II would be able to hold up as a camera for making youtube videos (make up/tutorial type stuff)?I know the internal mic might not be all that great but I do have a standalone recording mic I could use and sync up later. Im looking to purchase a camera to learn photography and make YouTube videos with my SO. Logic tells me I should get the Canon Rebel t6i but I just can't keep my eye off the olympus for some reason. Does anyone have experience with it? I'm new to photography and looking to make this purchase so I can develop some photography skill which will be useful later on down the road. (I'm currently a background investigator but I am looking to make the move into surveillance investigations within the next year or two). Any insight or recommendations would be greatly appreciated.\n\n# ", "title": "Olympus OM-D E-M10 Mark II - Decent camera for YouTube videos?", "num-comments": 2, "score": 2, "date": "2018-06-22 14:38:42", "content": "Olympus OM-D E-M10 Mark II - Decent camera for YouTube videos? /!/ Just curious to know if the   Olympus EM10 Mark II would be able to hold up as a camera for making youtube videos (make up/tutorial type stuff)?I know the internal mic might not be all that great but I do have a standalone recording mic I could use and sync up later. Im looking to purchase a camera to learn photography and make YouTube videos with my SO. Logic tells me I should get the Canon Rebel t6i but I just can't keep my eye off the olympus for some reason. Does anyone have experience with it? -----> I !!! 'm new to photography and looking to make this purchase so -----> -----> I !!!  can develop !!!  some photography skill which will be useful later on down the road. (I'm currently a background investigator but I am looking to make the move into surveillance investigations within the next year or two). Any insight or recommendations would be greatly appreciated.\n\n# ", "link": "https://www.reddit.com/r/Cameras/comments/8t1u0c/olympus_omd_em10_mark_ii_decent_camera_for/"}, {"autor": "TheSixthVisitor", "selftext": "I'm trying to find an appropriate camera for a project that allows me to create a 360 live feed. I can either put a camera on a gimbal or use a 360-degree camera. I'm struggling to find a 360-degree camera that can work as a webcam; the specs on this cameras tell me that the cameras can live stream but not if they can be used as a webcam.\n\nHelp please?", "title": "Looking for a camera for a project", "num-comments": 0, "score": 1, "date": "2018-06-18 18:16:26", "content": "Looking for a camera for a project /!/ -----> I !!! 'm trying to find an appropriate camera for a project that allows -----> me to create !!!  a 360 live feed. I can either put a camera on a gimbal or use a 360-degree camera. I'm struggling to find a 360-degree camera that can work as a webcam; the specs on this cameras tell me that the cameras can live stream but not if they can be used as a webcam.\n\nHelp please?", "link": "https://www.reddit.com/r/Cameras/comments/8s1q2y/looking_for_a_camera_for_a_project/"}, {"autor": "SquiddyFish", "selftext": "Hey all,\n\nI have a fairly unusual hobby (think plane/trainspotting [but different](https://old.reddit.com/r/SquiddysBusPhotos/)), and have been doing it for upwards of a year now, only using my iPhone 6. I reckon for the most part I've improved a lot over the past year, and am looking to upgrade my iPhone to something a bit better.\n\n[The same link as before, but just to give some examples of my work](https://old.reddit.com/r/SquiddysBusPhotos/). I've worked out the kinks of the iPhone, and how it's not great at zoom or in mediocre light (see the example pic I just posted, which is a much older picture taken before I had a clue what I was doing). I'm just looking for a reliable, versatile camera that I can travel around with (lightweight), that is decent in most conditions (though I don't expect to take many night shots, mostly overcast and shadowy are my main light concerns). A decent battery life would be nice too. Having a really long zoom isn't particularly important to me, just better than an iPhone :P\n\nI've got a budget up to about AUD$700 (~450USD), which puts me around an entry-level DSLR. I'm looking at the new Nikon 3500D as it seems to fit most of my criteria, but I'm not sure if a DSLR is a bit excessive seeing as I'm not really looking to play around with fancy lenses or anything. I'm just after something sturdy and versatile to keep my hobby going! Any thoughts? Cheers!", "title": "Looking to finally upgrade my smartphone!", "num-comments": 4, "score": 1, "date": "2018-11-14 12:43:18", "content": "Looking to finally upgrade my smartphone! /!/ Hey all,\n\nI have a fairly unusual hobby (think plane/trainspotting [but different](https://old.reddit.com/r/SquiddysBusPhotos/)), and have been doing it for upwards of a year now, only using my iPhone 6. -----> I !!!  reckon for the most part -----> -----> I !!! 've improved !!!  a lot over the past year, and am looking to upgrade my iPhone to something a bit better.\n\n[The same link as before, but just to give some examples of my work](https://old.reddit.com/r/SquiddysBusPhotos/). I've worked out the kinks of the iPhone, and how it's not great at zoom or in mediocre light (see the example pic I just posted, which is a much older picture taken before I had a clue what I was doing). I'm just looking for a reliable, versatile camera that I can travel around with (lightweight), that is decent in most conditions (though I don't expect to take many night shots, mostly overcast and shadowy are my main light concerns). A decent battery life would be nice too. Having a really long zoom isn't particularly important to me, just better than an iPhone :P\n\nI've got a budget up to about AUD$700 (~450USD), which puts me around an entry-level DSLR. I'm looking at the new Nikon 3500D as it seems to fit most of my criteria, but I'm not sure if a DSLR is a bit excessive seeing as I'm not really looking to play around with fancy lenses or anything. I'm just after something sturdy and versatile to keep my hobby going! Any thoughts? Cheers!", "link": "https://www.reddit.com/r/Cameras/comments/9wzrld/looking_to_finally_upgrade_my_smartphone/"}, {"autor": "kozm0z", "selftext": "So ive been shopping for a new personal camera. I haven't owned my own camera going on 4 or 5 years now. Last camera I owned was an fs700 (loved it, hated the ergonimics but it was a workhorse) tl;dr at bottom.\n\nI dont have much of a budget yet, so the cameras ive been looking at widely vary in price and tech so I guess I'm just trying to get my thoughts in order before I make a decision. Any input is most welcome! Good or bad.\n\nThis wont be a camera for professional level shoots, if I happen to get some jobs, awesome! If not, its whatever. I wanna shoot my own stuff for a little while, this could vary from action sports and events to weirdo montage type stuff maybe even some narrative and exploring my photography. 4k doesnt exactly entice me, my pc is a bit behind in technology these days so handling of 4k files would be rough at this point, in will be upgrading that down the road. I love high frame rates, the fs700 spoiled me, I know I won't get 240fps (short of Gh5s which i havent even considered, seems like a very niche camera) but 120fps would be awesome! If I'm being honest I never properly learned how to utilize 60fps for slow mo so I'm kinda seeing that as a challenge to take on with this new camera, limiting myself to a 1080@60fps cam could better for that.\n\nHere we go...\n\nGh3 - the lowest end of my totem, I used to own one, an amazing camera and can be picked up in the $350ish range (usually with a kit lens) in my area. 1080@60 can't really go wrong. Save a crap ton of money and invest in lenses. Get some of those sweet leica primes.\n\nGh4 - this is a shoe in...it doesn't excite me to spend a 1000 on a new one but I've seen used ones in the 650 to 750 range which is a lot of camera for the money. So i threw it in. The 96fps peaks my interest over 1080@60, even though its not great but for my purposes it wont matter. Takes decent photos for my skills.\n\nGh5 - obviously stays in my peripheral vision for many reasons. 10bit doesnt excite me atm as I'm not a big color grader. I love the vfr. Just like its predecessor, a lot of camera for the money here. I always felt this was the camera to upgrade to from my gh2/gh3.\n\nG9 - this has probably been the one ive been eyeing the hardest. I love the design over the gh5 its trying really hard to be a dslr and I think its cute. All jokes aside, it looks like an awesome camera, the photo options look great and certainly a solid learning curve for me in that aspect, I still get 4k@60p and vfr even if there is a recording cap which doesnt bother me that much and if I wanna get around it I can use an external recorder. The lack of 10bit is cool with me, keeps file sizes manageable. Again much more expensive not sure if its worth the money for me at this point. But it has been the one I keep going back to.\n\nCanon 80d - another I've been eyeing hard, I love Canons I always have. They feel great in the hands, the color is amazing, dual pixel af, lens selection is top notch and watching videos people create with it looks pretty damn good even if it is 1080...for internet stuff I dont think it really matters. Having a camera that spits out a fantastic image is great, I hate wasting time with color grading. Another camera if I could get in the $700 price range would be a strong contender for me BUT with gh4 in that range too, it almost seems silly, gh4 is much more video camera than an 80d but...Canon :/ I like canons. Theres one for sale local to me for $600 with kit lens which seems like a great deal, I could source a good L lens with that and be on my marry way.\n\nCanon 6d mk2 - I felt like I had to look at this one if I'm looking at comparably priced panasonics. Obviously it falls behind in features but can make up in other ways like being full frame and having that sweet canon color science.\n\nA6500 - ive looked at this one, the 1080 is shit and if that wasnt the case it'd probably be higher up on my list. Still dollar for dollar, 4k, is, hfr, good low light, great af, as for its limitations i could work around those, like any sony. This is probably a camera id prefer to score around the $900 mark.\n\nI've also looked at lot of entry level cams, like the g7 and g85 and lower end canons, Sony's etc. Even 7d mk2, 5dmk3 (utilizing ML) hell looked at grey market 5d4. I can always rent a hfr camera if I need more than 60fps but at what cost? Ya know if every project I create turns into wanting to use 120fps, that gets expensive ...I suppose I could go back to the twixtor days I'm sure the quality of images these days has improved that program but what a pain in the ass that program was. I got some good stuff with my t2i back in the day but having a camera that actually shoots hfr is so much better.\n\nI think i really want a reason to not go m43 but its not easy to find. Panasonic leads the industry with cameras packed full of features, a lot of which I may not need right out of the gate. On the other hand I feel like I'm concerning myself with features when ultimately it comes down to content. When I watch something awesome I'm not wondering what they used to shoot it, I'm just engaged.\n\nIts funny if i take away the 4k aspect (not huge a selling factor for me) the only cameras that stay on this list are gh3 and 80d. Everything else goes away and these two meet the bare minimums and I can choose lenses over hardware. I like nice glass.\n\nI dunno....I keep going back and fourth. This is frustrating, I've been putting this off for a while too but the cost to keep renting cameras for my personal shit isnt effective. And id rent all these cameras and figure it out myself but by the time I'd gone through them, id probably have spent the money id use to buy one in which case that cost plus the actual purchase cost would be way higher than the initial dive in purchase\n\nThanks for reading if you did....tl;dr, having trouble picking out cameras, gh3/gh4/gh5/g9/80d/a6500 plus others in that sub $2k range, first world problems...\n\n\n\n\n", "title": "I need some perspective...(camera decisions)", "num-comments": 6, "score": 2, "date": "2018-02-25 18:36:34", "content": "I need some perspective...(camera decisions) /!/ So ive been shopping for a new personal camera. I haven't owned my own camera going on 4 or 5 years now. Last camera I owned was an fs700 (loved it, hated the ergonimics but it was a workhorse) tl;dr at bottom.\n\nI dont have much of a budget yet, so the cameras ive been looking at widely vary in price and tech so I guess I'm just trying to get my thoughts in order before I make a decision. Any input is most welcome! Good or bad.\n\nThis wont be a camera for professional level shoots, if I happen to get some jobs, awesome! If not, its whatever. I wanna shoot my own stuff for a little while, this could vary from action sports and events to weirdo montage type stuff maybe even some narrative and exploring my photography. 4k doesnt exactly entice me, my pc is a bit behind in technology these days so handling of 4k files would be rough at this point, in will be upgrading that down the road. I love high frame rates, the fs700 spoiled me, I know I won't get 240fps (short of Gh5s which i havent even considered, seems like a very niche camera) but 120fps would be awesome! If I'm being honest I never properly learned how to utilize 60fps for slow mo so I'm kinda seeing that as a challenge to take on with this new camera, limiting myself to a 1080@60fps cam could better for that.\n\nHere we go...\n\nGh3 - the lowest end of my totem, I used to own one, an amazing camera and can be picked up in the $350ish range (usually with a kit lens) in my area. 1080@60 can't really go wrong. Save a crap ton of money and invest in lenses. Get some of those sweet leica primes.\n\nGh4 - this is a shoe in...it doesn't excite me to spend a 1000 on a new one but I've seen used ones in the 650 to 750 range which is a lot of camera for the money. So i threw it in. The 96fps peaks my interest over 1080@60, even though its not great but for my purposes it wont matter. Takes decent photos for my skills.\n\nGh5 - obviously stays in my peripheral vision for many reasons. 10bit doesnt excite me atm as I'm not a big color grader. I love the vfr. Just like its predecessor, a lot of camera for the money here. I always felt this was the camera to upgrade to from my gh2/gh3.\n\nG9 - this has probably been the one ive been eyeing the hardest. I love the design over the gh5 its trying really hard to be a dslr and I think its cute. All jokes aside, it looks like an awesome camera, the photo options look great and certainly a solid learning curve for me in that aspect, I still get 4k@60p and vfr even if there is a recording cap which doesnt bother me that much and if I wanna get around it I can use an external recorder. The lack of 10bit is cool with me, keeps file sizes manageable. Again much more expensive not sure if its worth the money for me at this point. But it has been the one I keep going back to.\n\nCanon 80d - another I've been eyeing hard, I love Canons I always have. They feel great in the hands, the color is amazing, dual pixel af, lens selection is top notch and watching videos people create with it looks pretty damn good even if it is 1080...for internet stuff I dont think it really matters. Having a camera that spits out a fantastic image is great, I hate wasting time with color grading. Another camera if I could get in the $700 price range would be a strong contender for me BUT with gh4 in that range too, it almost seems silly, gh4 is much more video camera than an 80d but...Canon :/ I like canons. Theres one for sale local to me for $600 with kit lens which seems like a great deal, I could source a good L lens with that and be on my marry way.\n\nCanon 6d mk2 - I felt like I had to look at this one if I'm looking at comparably priced panasonics. Obviously it falls behind in features but can make up in other ways like being full frame and having that sweet canon color science.\n\nA6500 - ive looked at this one, the 1080 is shit and if that wasnt the case it'd probably be higher up on my list. Still dollar for dollar, 4k, is, hfr, good low light, great af, as for its limitations i could work around those, like any sony. This is probably a camera id prefer to score around the $900 mark.\n\nI've also looked at lot of entry level cams, like the g7 and g85 and lower end canons, Sony's etc. Even 7d mk2, 5dmk3 (utilizing ML) hell looked at grey market 5d4. I can always rent a hfr camera if I need more than 60fps but at what cost? Ya know if every project -----> -----> I !!!  create !!!  turns into wanting to use 120fps, that gets expensive ...I suppose I could go back to the twixtor days I'm sure the quality of images these days has improved that program but what a pain in the ass that program was. I got some good stuff with my t2i back in the day but having a camera that actually shoots hfr is so much better.\n\nI think i really want a reason to not go m43 but its not easy to find. Panasonic leads the industry with cameras packed full of features, a lot of which I may not need right out of the gate. On the other hand I feel like I'm concerning myself with features when ultimately it comes down to content. When I watch something awesome I'm not wondering what they used to shoot it, I'm just engaged.\n\nIts funny if i take away the 4k aspect (not huge a selling factor for me) the only cameras that stay on this list are gh3 and 80d. Everything else goes away and these two meet the bare minimums and I can choose lenses over hardware. I like nice glass.\n\nI dunno....I keep going back and fourth. This is frustrating, I've been putting this off for a while too but the cost to keep renting cameras for my personal shit isnt effective. And id rent all these cameras and figure it out myself but by the time I'd gone through them, id probably have spent the money id use to buy one in which case that cost plus the actual purchase cost would be way higher than the initial dive in purchase\n\nThanks for reading if you did....tl;dr, having trouble picking out cameras, gh3/gh4/gh5/g9/80d/a6500 plus others in that sub $2k range, first world problems...\n\n\n\n\n", "link": "https://www.reddit.com/r/Cameras/comments/806dza/i_need_some_perspectivecamera_decisions/"}, {"autor": "guyrandomajust", "selftext": "nan", "title": "I've been developing a small and cheap (200$) gimbal, that could carry up to small mirrorless camera. I'm thinking starting a company but first I need to know the demand and interest in such gimbal so please visit gion.launchrock.com if you are interested.", "num-comments": 0, "score": 1, "date": "2018-03-19 23:29:35", "content": "-----> -----> I !!! 've been developing !!!  a small and cheap (200$) gimbal, that could carry up to small mirrorless camera. I'm thinking starting a company but first I need to know the demand and interest in such gimbal so please visit gion.launchrock.com if you are interested.", "link": "https://www.reddit.com/r/Cameras/comments/85o4z3/ive_been_developing_a_small_and_cheap_200_gimbal/"}, {"autor": "isabm99", "selftext": "Hello!\n\n&amp;#x200B;\n\nI had no idea where to post this and find anyone with any useful advice and I am in a country where my knowledge of the language is minimal at best. I rented a Canon Mark IV yesterday to take photos at an award show and used two different SD cards because I was scared of them maybe making me erase data (they didn't everyone just got yelled at). So I was on my way to transfer the files to my computer and then return the camera when I got a call from the company so I just decided to go there and transfer and then just turn it in quickly. The first SD card I made a copy of the file and moved it to my desktop and the second I only needed half of the photos so I created a new file, moved the photos there and then moved the file to my computer. I passed out and did not check the files till today in the afternoon. All the photos from the first file transferred over but the second filed I cannot find at all. I texted the camera shop and they said the SD was rented out again and they had already released the data and would not know when it would be back. I have been desperately trying to find a recovery system to help but I am not sure what to do because I have searched all places on my computer. The only trace of it I could find is when I was trying to save a photo in photoshop and one of the places that came up was the name of the file but with the white page icon and when you click on it, photoshop just chooses another file to save it to instead. Attached is what it is. I use a Macbook Pro with OS 10.13.6 running. If any has advice please let me know, I had some amazing photos on there and I really don't know what to do. I would go back to the shop in person but it seems hopeless especially with what they already told me and not having could communication. \n\nhttps://i.redd.it/g654dko99cu11.png", "title": "CR2 Recovery help rip", "num-comments": 0, "score": 1, "date": "2018-10-25 14:05:38", "content": "CR2 Recovery help rip /!/ Hello!\n\n&amp;#x200B;\n\nI had no idea where to post this and find anyone with any useful advice and I am in a country where my knowledge of the language is minimal at best. I rented a Canon Mark IV yesterday to take photos at an award show and used two different SD cards because I was scared of them maybe making me erase data (they didn't everyone just got yelled at). So I was on my way to transfer the files to my computer and then return the camera when I got a call from the company so I just decided to go there and transfer and then just turn it in quickly. The first SD card I made a copy of the file and moved it to my desktop and the second I only needed half of the photos so -----> -----> I !!!  created !!!  a new file, moved the photos there and then moved the file to my computer. I passed out and did not check the files till today in the afternoon. All the photos from the first file transferred over but the second filed I cannot find at all. I texted the camera shop and they said the SD was rented out again and they had already released the data and would not know when it would be back. I have been desperately trying to find a recovery system to help but I am not sure what to do because I have searched all places on my computer. The only trace of it I could find is when I was trying to save a photo in photoshop and one of the places that came up was the name of the file but with the white page icon and when you click on it, photoshop just chooses another file to save it to instead. Attached is what it is. I use a Macbook Pro with OS 10.13.6 running. If any has advice please let me know, I had some amazing photos on there and I really don't know what to do. I would go back to the shop in person but it seems hopeless especially with what they already told me and not having could communication. \n\nhttps://i.redd.it/g654dko99cu11.png", "link": "https://www.reddit.com/r/Cameras/comments/9ralnp/cr2_recovery_help_rip/"}, {"autor": "Eudoxus_", "selftext": "Hey everyone. I'm looking for the community's advice and recommendations on a big purchase I've been considering the past few days.\n\nTL;DR - Got $4,000 to spend on photography, suggestions?\n\nSome background. I've only just begun photography as a hobby earlier this year. I've been primarily shooting landscapes and nature since its so readily available in Canada but I'm very interested in trying whatever style I can. I've kinda fallen in love with this art form. I have started out with a Canon T6i with the 18-55mm Kit Lens. I soon bought the Canon travel lens kit with the EF 10-18mm f/4.5-5.6 IS STM and the 50mm f/1.8 STM Prime lens. I've had great success with both.\n\nI have roughly $4,000 CDN to spend and I'm unsure which way to go. I currently shoot a crop sensor and have never had the chance to try a full frame so I'm not sure if I should stick with it or switch to full frame. I guess that would be the first big decision. If I don't change bodies I will likely look at improving my current kit with lenses and filters and some accessories I've neglected. I've even considered trying a drone for aerial shots. I currently have a backpack and tripod with the body and lenses.\n\nWhat do you guys think? I go full frame with maybe a lens or I improve my current setup.  I've done quite a bit of reading and watching videos already but I figured I'd defer to the large knowledge and experience base gathered here in all you people.", "title": "Looking for advice on upcoming big purchase.", "num-comments": 4, "score": 1, "date": "2018-10-20 03:08:54", "content": "Looking for advice on upcoming big purchase. /!/ Hey everyone. I'm looking for the community's advice and recommendations on a big purchase I've been considering the past few days.\n\nTL;DR - Got $4,000 to spend on photography, suggestions?\n\nSome background. I've only just begun photography as a hobby earlier this year. I've been primarily shooting landscapes and nature since its so readily available in Canada but I'm very interested in trying whatever style I can. I've kinda fallen in love with this art form. I have started out with a Canon T6i with the 18-55mm Kit Lens. I soon bought the Canon travel lens kit with the EF 10-18mm f/4.5-5.6 IS STM and the 50mm f/1.8 STM Prime lens. I've had great success with both.\n\nI have roughly $4,000 CDN to spend and I'm unsure which way to go. I currently shoot a crop sensor and have never had the chance to try a full frame so I'm not sure if I should stick with it or switch to full frame. I guess that would be the first big decision. If I don't change bodies I will likely look at improving my current kit with lenses and filters and some accessories I've neglected. I've even considered trying a drone for aerial shots. I currently have a backpack and tripod with the body and lenses.\n\nWhat do you guys think? -----> I !!!  go full frame with maybe a lens or -----> -----> I !!!  improve !!!  my current setup.  I've done quite a bit of reading and watching videos already but I figured I'd defer to the large knowledge and experience base gathered here in all you people.", "link": "https://www.reddit.com/r/Cameras/comments/9pqobl/looking_for_advice_on_upcoming_big_purchase/"}, {"autor": "aRealUn1queUsername", "selftext": " I will set you up a WordPress website for free because having your very own place to show off your photography is important. It's one of the most vital steps you could make to show others that you mean business. If you don't know where to start, just PM me and I'll help you through the process. It'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. I'll get the whole website set up and presentable! ", "title": "I will create a WordPress portfolio for your photography FREE.", "num-comments": 3, "score": 1, "date": "2018-11-07 18:31:57", "content": "-----> -----> I !!!  will create !!!  a WordPress portfolio for your photography FREE. /!/  I will set you up a WordPress website for free because having your very own place to show off your photography is important. It's one of the most vital steps you could make to show others that you mean business. If you don't know where to start, just PM me and I'll help you through the process. It'll be my top priority (within the next 24 - 48 hours) to get your portfolio up and ready to accept whatever images you'll put into it. I'll get the whole website set up and presentable! ", "link": "https://www.reddit.com/r/Cameras/comments/9v1z03/i_will_create_a_wordpress_portfolio_for_your/"}, {"autor": "pjkst", "selftext": "Hello there,\n\n&amp;#x200B;\n\nI have always been on a low budget with my gear and only had two cameras since I started shooting. I began with Canon 500D and then upgraded to 650D when it came out. It was okay for hobby video and photo shooting, but now I am doing more professional work and need to upgrade my gear.\n\n&amp;#x200B;\n\nI do both video and photo work. I often shoot at restaurants, events and other places, where the light conditions are now always good. I am not doing any stuff that requires ultra high quality - no narrative films or the like. The content I create is mostly aimed at social media. \n\n&amp;#x200B;\n\nEver since I heard of BMPCC 4K coming out, I have been hyped and was waiting for it to be released. Now, when it is very soon to come to Europe, I started doubting. My plan was to stick with 650D for photo work and have the BMPCC for video tasks. But now more and more I think that my photos would benefit quite a lot from a new camera. Apart from many other things, the low light performance is quite bad.\n\n&amp;#x200B;\n\nSo now I am trying to decide whether to go with BMPCC + 650D or sell the 650D and buy an all-around camera. The ones I am thinking of are Sony A7 III or Lumix GH5, however I believe I would prefer A7 III due to its' low light abilities. \n\n&amp;#x200B;\n\nCan you guys help me decide which way to go? Please give me some input that could help me decide. Thanks!", "title": "Upgrading equipment - need help deciding", "num-comments": 2, "score": 1, "date": "2018-10-02 22:37:48", "content": "Upgrading equipment - need help deciding /!/ Hello there,\n\n&amp;#x200B;\n\nI have always been on a low budget with my gear and only had two cameras since I started shooting. I began with Canon 500D and then upgraded to 650D when it came out. It was okay for hobby video and photo shooting, but now I am doing more professional work and need to upgrade my gear.\n\n&amp;#x200B;\n\nI do both video and photo work. I often shoot at restaurants, events and other places, where the light conditions are now always good. I am not doing any stuff that requires ultra high quality - no narrative films or the like. The content -----> -----> I !!!  create !!!  is mostly aimed at social media. \n\n&amp;#x200B;\n\nEver since I heard of BMPCC 4K coming out, I have been hyped and was waiting for it to be released. Now, when it is very soon to come to Europe, I started doubting. My plan was to stick with 650D for photo work and have the BMPCC for video tasks. But now more and more I think that my photos would benefit quite a lot from a new camera. Apart from many other things, the low light performance is quite bad.\n\n&amp;#x200B;\n\nSo now I am trying to decide whether to go with BMPCC + 650D or sell the 650D and buy an all-around camera. The ones I am thinking of are Sony A7 III or Lumix GH5, however I believe I would prefer A7 III due to its' low light abilities. \n\n&amp;#x200B;\n\nCan you guys help me decide which way to go? Please give me some input that could help me decide. Thanks!", "link": "https://www.reddit.com/r/Cameras/comments/9kveet/upgrading_equipment_need_help_deciding/"}], "name": "Cameras_2018", "Procedure": [{"content": "PRON", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "PART", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "AUX", "display": "selector"}, {"content": "directly followed by", "display": "description"}, {"content": "VERBV", "display": "selector"}], "SearchParam": [["I", "we", "us", "me", "our"], ["invent", "made-up", "create", "develop", "improve", "engineer", "develope", "design", "prototype"]]}