{"interestingcomments": [{"autor": "twberculosis", "selftext": "Hi, \nI’ve been using my first analog camera, the AE1 Program for 3/4 years now and having lots of fun with it! I think I have the stock model of Lens. A 50mm 0.6mm (?) I think. \n\nI’m looking for an inexpensive lens that would be more suitable for low light, up close photographs. With a budget of up to $125 or so.\n\nHere’s a link to my EyeEm account, would be open to any suggestions as to how I could improve my photography and what lens might be suitable. \n\nThanks! \n\n[EyeEm Account](https://www.eyeem.com/u/27525877)", "title": "New Lens for AE1 Program", "num-comments": 2, "score": 1, "date": "2018-06-17 19:12:40", "content": "New Lens for AE1 Program /!/ Hi, \nI’ve been using my first analog camera, the AE1 Program for 3/4 years now and having lots of fun with it! I think I have the stock model of Lens. A 50mm 0.6mm (?) I think. \n\nI’m looking for an inexpensive lens that would be more suitable for low light, up close photographs. With a budget of up to $125 or so.\n\nHere’s a link to my EyeEm account, would be open to any suggestions as to how -----> -----> I !!!  could improve !!!  my photography and what lens might be suitable. \n\nThanks! \n\n[EyeEm Account](https://www.eyeem.com/u/27525877)", "link": "https://www.reddit.com/r/canon/comments/8rt9nr/new_lens_for_ae1_program/"}, {"autor": "iebyt", "selftext": "Hi everyone,\n\nI created an android app to control my EOS 200D using Bluetooth LE. This app allows the phone to be used as Canon's BR-E1 bluetooth remote. The app should work with any Canon Cameras which support BR-E1 remote. The official list is 77D, 800D, 200D and 6D Mark II. I am only able to test the app with my 200D as I have only one camera. I would like to know if this app works with any other canon cameras. Link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nThank you", "title": "Android app to control Canon DSLR cameras using Bluetooth LE.", "num-comments": 3, "score": 3, "date": "2018-09-08 20:18:25", "content": "Android app to control Canon DSLR cameras using Bluetooth LE. /!/ Hi everyone,\n\n-----> -----> I !!!  created !!!  an android app to control my EOS 200D using Bluetooth LE. This app allows the phone to be used as Canon's BR-E1 bluetooth remote. The app should work with any Canon Cameras which support BR-E1 remote. The official list is 77D, 800D, 200D and 6D Mark II. I am only able to test the app with my 200D as I have only one camera. I would like to know if this app works with any other canon cameras. Link - [https://github.com/iebyt/cbremote](https://github.com/iebyt/cbremote) or [https://play.google.com/store/apps/details?id=com.iebyt.cbremote](https://play.google.com/store/apps/details?id=com.iebyt.cbremote)\n\nThank you", "link": "https://www.reddit.com/r/canon/comments/9e76aq/android_app_to_control_canon_dslr_cameras_using/"}, {"autor": "KrAEGNET", "selftext": "It may seem like an obvious answer, just curious as I'm considering ugrading to an 80D or a 6D next year and want a battery grip. Before some of you ask why I would consider and 80D over 6D being full frame, the answer is the articulating LCD. I'm not great with over the head or below the hip shooting, and I welcome the chance to help me improve. Being 5'8 I often can't see over crowds at events like concerts, parades, races, etc, and I'm not the type of person to barge my way to the front. But If I end up going 6D over a 5D the answer for that just comes down to price. Hell I could potentially spring for both the 80D and 6D and still come in about $1500 cheaper than a 5D. I could go used, but not interested at the moment.\n\nAnyway, are the official Canon battery grips also weather sealed? It's not as if I'm going to the middle of a hurricane or going swimming with the cameras, but right now with my current camera (t1i) I get nervous when there are clouds looming in the sky and have missed some shooting opportunities because I refused to take it out in case it rained. I would obviously be less scared to take out a weather sealed camera. And yes, I know lenses need to have weather sealing too.\n\nI know mirrorless is coming out soon, but I'm not in the market for that yet and it could maybe mean price drops, however small, on mirrored bodies.", "title": "Do battery grips for \"weather sealed\" cameras compromise the seal?", "num-comments": 5, "score": 1, "date": "2018-08-31 15:24:10", "content": "Do battery grips for \"weather sealed\" cameras compromise the seal? /!/ It may seem like an obvious answer, just curious as I'm considering ugrading to an 80D or a 6D next year and want a battery grip. Before some of you ask why I would consider and 80D over 6D being full frame, the answer is the articulating LCD. -----> I !!! 'm not great with over the head or below the hip shooting, and -----> I !!!  welcome the chance to help -----> me improve !!! . Being 5'8 I often can't see over crowds at events like concerts, parades, races, etc, and I'm not the type of person to barge my way to the front. But If I end up going 6D over a 5D the answer for that just comes down to price. Hell I could potentially spring for both the 80D and 6D and still come in about $1500 cheaper than a 5D. I could go used, but not interested at the moment.\n\nAnyway, are the official Canon battery grips also weather sealed? It's not as if I'm going to the middle of a hurricane or going swimming with the cameras, but right now with my current camera (t1i) I get nervous when there are clouds looming in the sky and have missed some shooting opportunities because I refused to take it out in case it rained. I would obviously be less scared to take out a weather sealed camera. And yes, I know lenses need to have weather sealing too.\n\nI know mirrorless is coming out soon, but I'm not in the market for that yet and it could maybe mean price drops, however small, on mirrored bodies.", "link": "https://www.reddit.com/r/canon/comments/9buj8l/do_battery_grips_for_weather_sealed_cameras/"}, {"autor": "vallosdck", "selftext": "I got a Canon EOS M50 on black friday, I was going to go with the Rebel t7i, but the eos was discounted by so much, I had to pick it up. Anyways, I've never had a camera before, except my smartphones, but I bought the M50 to create a vlog/blog on software developers transitioning from college to real-world. I have the episodes laid out, but I still have to film them. So, with a new camera, I decided to learn how to use is for photos since I've never really taken any \"real\" photos. I walked around places looking for ways to test my camera and I found a new passion. I think I'm addicted to taking photos now...\n\n&amp;#x200B;\n\nI wanted to get some feedback from some of you on how I can improve with my camera. I've taken tons of shots already and the one below is my favorite. I love the idea of taking pictures of things that no one notices, hence the title of this post.\n\n&amp;#x200B;\n\nSo let me know, give me some critiques. I'd love to grow this new thing and see what I can do with it. Below is a picture I took yesterday. I really love it, but am I just saying that because I took it? I have no idea what I'm doing, but I'm learning. I'm a computer scientist by trade, but this type of a things feels so good. So...feedback, please!\n\n*Processing img jjf8s6y9ar121...*", "title": "A Study of the Mundane", "num-comments": 12, "score": 1, "date": "2018-12-02 00:15:14", "content": "A Study of the Mundane /!/ I got a Canon EOS M50 on black friday, I was going to go with the Rebel t7i, but the eos was discounted by so much, I had to pick it up. Anyways, I've never had a camera before, except my smartphones, but I bought the M50 to create a vlog/blog on software developers transitioning from college to real-world. I have the episodes laid out, but I still have to film them. So, with a new camera, I decided to learn how to use is for photos since I've never really taken any \"real\" photos. I walked around places looking for ways to test my camera and I found a new passion. -----> I !!!  think -----> I !!! 'm addicted to taking photos now...\n\n&amp;#x200B;\n\n-----> I !!!  wanted to get some feedback from some of you on how -----> -----> I !!!  can improve !!!  with my camera. I've taken tons of shots already and the one below is my favorite. I love the idea of taking pictures of things that no one notices, hence the title of this post.\n\n&amp;#x200B;\n\nSo let me know, give me some critiques. I'd love to grow this new thing and see what I can do with it. Below is a picture I took yesterday. I really love it, but am I just saying that because I took it? I have no idea what I'm doing, but I'm learning. I'm a computer scientist by trade, but this type of a things feels so good. So...feedback, please!\n\n*Processing img jjf8s6y9ar121...*", "link": "https://www.reddit.com/r/canon/comments/a28ftl/a_study_of_the_mundane/"}, {"autor": "isabm99", "selftext": "I posted this on r/camera was well because I have never used reddit, only see screenshots of the memes\n\n&amp;#x200B;\n\nHello!\n\nI had no idea where to post this and find anyone with any useful advice as I am in a country where my knowledge of the language is minimal at best. I rented a Canon Mark IV yesterday to take photos at an award show and used two different SD cards because I was scared of them maybe making me erase data (they didn't everyone just got yelled at). So I was on my way to transfer the files to my computer and then return the camera when I got a call from the company so I just decided to go there and transfer and then just turn it in quickly. The first SD card I made a copy of the file and moved it to my desktop and the second I only needed half of the photos so I created a new file, moved the photos there and then moved the file to my computer. I passed out and did not check the files till today in the afternoon. All the photos from the first file transferred over but the second filed I cannot find at all. I texted the camera shop and they said the SD was rented out again and they had already released the data and would not know when it would be back. I have been desperately trying to find a recovery system to help but I am not sure what to do because I have searched all places on my computer. The only trace of it I could find is when I was trying to save a photo in photoshop and one of the places that came up was the name of the file but with the white page icon and when you click on it, photoshop just chooses another file to save it to instead. Attached is what it is. I use a Macbook Pro with OS 10.13.6 running. If any has advice please let me know, I had some amazing photos on there and I really don't know what to do. I would go back to the shop in person but it seems hopeless especially with what they already told me and not having good communication skills at the ready.\n\n![img](wlrnzciwbcu11)", "title": "CR2 File Recovery help", "num-comments": 1, "score": 1, "date": "2018-10-25 14:18:53", "content": "CR2 File Recovery help /!/ I posted this on r/camera was well because I have never used reddit, only see screenshots of the memes\n\n&amp;#x200B;\n\nHello!\n\nI had no idea where to post this and find anyone with any useful advice as I am in a country where my knowledge of the language is minimal at best. I rented a Canon Mark IV yesterday to take photos at an award show and used two different SD cards because I was scared of them maybe making me erase data (they didn't everyone just got yelled at). So I was on my way to transfer the files to my computer and then return the camera when I got a call from the company so I just decided to go there and transfer and then just turn it in quickly. The first SD card I made a copy of the file and moved it to my desktop and the second I only needed half of the photos so -----> -----> I !!!  created !!!  a new file, moved the photos there and then moved the file to my computer. I passed out and did not check the files till today in the afternoon. All the photos from the first file transferred over but the second filed I cannot find at all. I texted the camera shop and they said the SD was rented out again and they had already released the data and would not know when it would be back. I have been desperately trying to find a recovery system to help but I am not sure what to do because I have searched all places on my computer. The only trace of it I could find is when I was trying to save a photo in photoshop and one of the places that came up was the name of the file but with the white page icon and when you click on it, photoshop just chooses another file to save it to instead. Attached is what it is. I use a Macbook Pro with OS 10.13.6 running. If any has advice please let me know, I had some amazing photos on there and I really don't know what to do. I would go back to the shop in person but it seems hopeless especially with what they already told me and not having good communication skills at the ready.\n\n![img](wlrnzciwbcu11)", "link": "https://www.reddit.com/r/canon/comments/9raptu/cr2_file_recovery_help/"}, {"autor": "bombsolomon", "selftext": "Hi all, I asked for help a few weeks ago regarding battery life for a t5i in terms of video shooting. I learned that the t5i will hit the 4GB file size limit in about 12m05s but compensates for this by starting a new video right away, which was great. I also learned that, for a show that went extremely long, four batteries and three 32GB SD cards was cutting it close. I’ll be better prepared on that end next time.\n\nNow having the resulting videos, I wanted to ask for tips on how I could improve (samples at the bottom).\n\nHere were the circumstances and my approach:\n\nI was sitting in an lecture auditorium that some student groups now use for stage plays and productions like the one I was asked to film. The students rented a t5i with a 18-135mm lens. Originally I tried standing at the back of the auditorium and filming from there, but everything looked sort of blobby, so I instead took a seat around 10-15 rows up from the front and used a tripod. Thankfully, nobody tall wanted to sit in front of me and the people sitting behind me also didn’t mind. My technique was to allow the autofocus to set the focus of the camera at first, and then flip the camera into manual so that nothing would change throughout the recording (which has happened to me in a different venue but I couldn’t quite figure out how to fix it on the fly, so I ended up getting a really blurry last minute or so of a performance.)\n\nThe play/musical had three different general lighting patterns. The first was all lights on stage up. The second was lights dim with spotlights. The third was stage lights out with spotlights. I wasn’t entirely sure how to try to adjust for this on the fly because I hadn’t seen the show before and didn’t know when the lights transitions would be, so instead I hedged my bets and went for the previously mentioned AF method at the beginning of each act and left it as is. The result is that the scenes with the most light look great, while especially in the scenes with just spotlights, the people on stage look really blown out.\n\nI used the onboard mic for all of the audio recording and this ended up being sort of okay. Some of the dialogue and rapping is a bit muddled, but there was little I could do about it. There are mics that the students could have rented, but I didn’t know how to make a recommendation for this not having ever used a mic with a DSLR before.\n\nMy questions are as follows:\n*For people who have shot video in these situations before, is there anything I should have been paying attention to or settings I should have been using / practicing more with to figure out how to improve the recordings, in terms of visual quality?\n*In the same situation, how much will a separate mic make a difference_x0010_? In an ideal world I think I’d set up a mic on stage and then sync it to the video, but that’s a bit more effort than I think I could expend on this project (also these students contacted me just ten days before the show to ask if I could do this.)\n*There are a handful of other lenses available through their student tech rental program. One of them is a macro so I know it wouldn’t matter here, but the other was a 70-200mm. It wasn’t available this time, but I’m thinking that one might have been useful if I had set up in the back of the auditorium. I think the tradeoff there would be that recording sound would have been even more difficult. Any takes on that approach?\n\nSample videos are below, reflecting each of the three main lighting situations. Any tips on how I can improve or things I should practice would be greatly appreciated. \n\n*Lights up: https://www.youtube.com/watch?v=lL3ke1QqJp0\n*Lights half down (with spotlight): https://www.youtube.com/watch?v=cyqwRfxuzg4\n*Lights down (with color spotlight): https://www.youtube.com/watch?v=cCoLjM9xP8o&amp;t=4m16s\n*Lights down (with neutral spotlight): https://www.youtube.com/watch?v=g-dflcQzx_M&amp;t=2m43s (this is also not helped by one of the actresses wearing an all white dress)", "title": "Improving video technique (auditorium/stage show, fixed location)", "num-comments": 0, "score": 1, "date": "2018-05-29 23:23:40", "content": "Improving video technique (auditorium/stage show, fixed location) /!/ Hi all, I asked for help a few weeks ago regarding battery life for a t5i in terms of video shooting. I learned that the t5i will hit the 4GB file size limit in about 12m05s but compensates for this by starting a new video right away, which was great. I also learned that, for a show that went extremely long, four batteries and three 32GB SD cards was cutting it close. I’ll be better prepared on that end next time.\n\nNow having the resulting videos, -----> I !!!  wanted to ask for tips on how -----> -----> I !!!  could improve !!!  (samples at the bottom).\n\nHere were the circumstances and my approach:\n\nI was sitting in an lecture auditorium that some student groups now use for stage plays and productions like the one I was asked to film. The students rented a t5i with a 18-135mm lens. Originally I tried standing at the back of the auditorium and filming from there, but everything looked sort of blobby, so I instead took a seat around 10-15 rows up from the front and used a tripod. Thankfully, nobody tall wanted to sit in front of me and the people sitting behind me also didn’t mind. My technique was to allow the autofocus to set the focus of the camera at first, and then flip the camera into manual so that nothing would change throughout the recording (which has happened to me in a different venue but I couldn’t quite figure out how to fix it on the fly, so I ended up getting a really blurry last minute or so of a performance.)\n\nThe play/musical had three different general lighting patterns. The first was all lights on stage up. The second was lights dim with spotlights. The third was stage lights out with spotlights. I wasn’t entirely sure how to try to adjust for this on the fly because I hadn’t seen the show before and didn’t know when the lights transitions would be, so instead I hedged my bets and went for the previously mentioned AF method at the beginning of each act and left it as is. The result is that the scenes with the most light look great, while especially in the scenes with just spotlights, the people on stage look really blown out.\n\nI used the onboard mic for all of the audio recording and this ended up being sort of okay. Some of the dialogue and rapping is a bit muddled, but there was little I could do about it. There are mics that the students could have rented, but I didn’t know how to make a recommendation for this not having ever used a mic with a DSLR before.\n\nMy questions are as follows:\n*For people who have shot video in these situations before, is there anything I should have been paying attention to or settings I should have been using / practicing more with to figure out how to improve the recordings, in terms of visual quality?\n*In the same situation, how much will a separate mic make a difference_x0010_? In an ideal world I think I’d set up a mic on stage and then sync it to the video, but that’s a bit more effort than I think I could expend on this project (also these students contacted me just ten days before the show to ask if I could do this.)\n*There are a handful of other lenses available through their student tech rental program. One of them is a macro so I know it wouldn’t matter here, but the other was a 70-200mm. It wasn’t available this time, but I’m thinking that one might have been useful if I had set up in the back of the auditorium. I think the tradeoff there would be that recording sound would have been even more difficult. Any takes on that approach?\n\nSample videos are below, reflecting each of the three main lighting situations. Any tips on how I can improve or things I should practice would be greatly appreciated. \n\n*Lights up: https://www.youtube.com/watch?v=lL3ke1QqJp0\n*Lights half down (with spotlight): https://www.youtube.com/watch?v=cyqwRfxuzg4\n*Lights down (with color spotlight): https://www.youtube.com/watch?v=cCoLjM9xP8o&amp;t=4m16s\n*Lights down (with neutral spotlight): https://www.youtube.com/watch?v=g-dflcQzx_M&amp;t=2m43s (this is also not helped by one of the actresses wearing an all white dress)", "link": "https://www.reddit.com/r/canon/comments/8n3qrq/improving_video_technique_auditoriumstage_show/"}, {"autor": "Ener_Ji", "selftext": "Recently picked up this multi-function device. It was advertised as having OCR capabilities but I can not find the option to OCR (i.e. create a searchable text PDF) anywhere in the software for macOS. I just installed the latest software from the site today.\n\nThe software installed \"MF Toolbox\" and \"Canon MF Scan Utility,\" but only the Scan Utility appears to be compatible with my device per Canon, and it doesn't appear to allow me to create a text-searchable PDF.\n\nAny ideas? My old Canon multi-function supported OCR, and the HP multi-function I was considering  instead of this Canon definitely supports it.", "title": "How to OCR scan using MF733Cdw?", "num-comments": 1, "score": 1, "date": "2018-12-07 17:33:39", "content": "How to OCR scan using MF733Cdw? /!/ Recently picked up this multi-function device. It was advertised as having OCR capabilities but I can not find the option to OCR (i.e. create a searchable text PDF) anywhere in the software for macOS. I just installed the latest software from the site today.\n\nThe software installed \"MF Toolbox\" and \"Canon MF Scan Utility,\" but only the Scan Utility appears to be compatible with my device per Canon, and it doesn't appear to allow -----> -----> me !!!  to create !!!  a text-searchable PDF.\n\nAny ideas? My old Canon multi-function supported OCR, and the HP multi-function I was considering  instead of this Canon definitely supports it.", "link": "https://www.reddit.com/r/canon/comments/a4231b/how_to_ocr_scan_using_mf733cdw/"}], "name": "canon_2018", "Procedure": [{"content": "PRON", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "PART", "display": "selector"}, {"content": "optional followed by", "display": "description"}, {"content": "AUX", "display": "selector"}, {"content": "directly followed by", "display": "description"}, {"content": "VERBV", "display": "selector"}], "SearchParam": [["I", "we", "us", "me", "our"], ["invent", "made-up", "create", "develop", "improve", "engineer", "develope", "design", "prototype"]]}