{"interestingcomments": [{"autor": "sboyle92", "date": "04/17/2021 11:10  AM", "content": "On 3/26/2021 at 9:26 AM, fotografr said: Superb B&W image. I wonder if you might share your conversion techniques. This is as good as I've seen anywhere. this image was taken with the basic m10 - not the m10m. for post production, it was done all in lightroom. first was to apply lens correction as if any leica lens needs it, even my venerable 50mm summicron collapsible. next was to set it to b&w mode. from there, it was a combination of using the basic sliders and tone graph to adjust my tones. a special trick of mine to tweak certain tones is to place a horizontal gradient just outside the frame and use the range mask feature. by using the luminance slider on this feature, i can better target just the tones i want to adjust. to me, if i wanted to target just the shadows in the image, this works better than using the basic shadow slider because that basic slider will move around the rest of the tones. in a few spots, like the darker areas of the stairs, i did apply a radial -----> tool !!!  and used a ranging mask so by using the luminosity slider, i could target just the deep shdows without affecting the surrounding highlights. i hope this all makes sense to you. thanks again for your compliment", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=4183154"}, {"autor": "fotografr", "date": "04/17/2021 12:53  PM", "content": " 1 hour ago, sboyle92 said: this image was taken with the basic m10 - not the m10m. for post production, it was done all in lightroom. first was to apply lens correction as if any leica lens needs it, even my venerable 50mm summicron collapsible. next was to set it to b&w mode. from there, it was a combination of using the basic sliders and tone graph to adjust my tones. a special trick of mine to tweak certain tones is to place a horizontal gradient just outside the frame and use the range mask feature. by using the luminance slider on this feature, i can better target just the tones i want to adjust. to me, if i wanted to target just the shadows in the image, this works better than using the basic shadow slider because that basic slider will move around the rest of the tones. in a few spots, like the darker areas of the stairs, i did apply a radial -----> tool !!!  and used a ranging mask so by using the luminosity slider, i could target just the deep shdows without affecting the surrounding highlights. i hope this all makes sense to you. thanks again for your compliment Thank you. I really appreciate your time on explaining this. I can see I'm going to have to up my game.", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=4183216"}, {"autor": "Oswalt", "date": "06/01/2021 04:53  PM", "content": "The feature isn’t very effective in my opinion. My sensor collects more dust and is often dirtier than the results I see on the back of the camera. I stop down to f16, defocus, and shoot a blank pages or word document. I then import into Lightroom and use the highlight spots -----> tool !!! , upon seeing the results, I promptly suffer a coronary, keel over and die.", "link": "https://www.l-camera-forum.com/topic/316569-m10-r-dust-detection-feature-working/?tab=findComment&comment=4211924"}, {"autor": "budjames", "date": "05/16/2019 12:12  PM", "content": "I occasionally use my Visoflex on my two M10s without any issues. It works very well once you get used to the necessary live view decreasing your battery life. I use the Visoflex with my Super Elmar 18 and Summicron 90 lenses. The -----> geotagging !!!  is cool too. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto.", "link": "https://www.l-camera-forum.com/topic/297307-visoflex-issues-with-leica-m10/?tab=findComment&comment=3741827"}, {"autor": "beewee", "date": "07/07/2021 11:17  PM", "content": "3 hours ago, lucerne said: However, if you find that Live View and the Visoflex introduce delays, you can obtain passive / flash mount viewfinders for 21 or 24 and have no delays when shooting. You'll still have to move your eye from the optical viewfinder to the external viewfinder (and back). Remember, there will be no exposure data displayed on the passive viewfinder. You need to use the Visoflex to get that feature back. I'm assuming you haven't yet acquired the visoflex so you can't check these features . I’ve never found the Visoflex delay to be excessive or problematic in daylight shooting. I have both the visoflex and a bunch of Zeiss optical viewfinders in 18mm and 25/28mm. I generally stick to visoflex because I can check focus without using the range finder with focus peaking and it also provides -----> geotagging !!!  with the onboard GPS receiver. Since getting the Visoflex, the only time I ever use an external optical viewfinder is for night shots and dark scenes.", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=findComment&comment=4234010"}, {"autor": "lucerne", "date": "07/08/2021 12:30  AM", "content": "bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver -----> geotagging !!!  everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be improved. Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Edited July 8 by lucerne", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=findComment&comment=4234030"}, {"autor": "beewee", "date": "07/08/2021 03:26  AM", "content": "3 hours ago, lucerne said: bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver -----> geotagging !!!  everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be improved. Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Yes, I agree that geotagging doesn’t work everywhere. Especially not indoors but that’s the nature of GPS in general. BUT, the Visoflex still works better than the Leica FOTOs app with the SL2-S and it actually is reliable outdoors once you give the GPS receiver time to lock on to the satellite signals and get a position. The same cannot be said about the FOTOs app. As far as providing a balanced opinion. I believe you’ve a ready mentioned one side so it’s worth mentioning the other to ‘balance’ things out. Edited July 8 by beewee", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=findComment&comment=4234051"}, {"autor": "jdlaing", "date": "01/22/2021 12:31  AM", "content": "2 hours ago, Steven said: Quick update: The M10D is gorgeous. It looks so sexy, I love touching it. I love going out with it. I NEVER miss the screen. I don't mind anymore that I cannot manually enter my non coded lens, I don't mind that the visoflex always stays on, I don't care about anything right now.... because there is one thing about it THAT I HATE ABOVE EVERYTHING ELSE. I hate that the spot metering. I hate that it is not multi centered. I know what you will say, I should not use an M, then. Well, I loved using my M10P, trhrough the OVF, but with the screen on on low luminosity. This way, my image was light metered like it is 2020, or 2021. Not like it's 1960. This is the one thing that I don't know if ill get used to, ever. I need to try hard, but its making me miss my P too much. P.S. I am totally aware that the problem is me. Not the camera. I am just not trained, or good enough, to have to worry about spot metering. If anyone has tips on how to expose better with spot metering, maybe that'll change my early opinion? It’s not spot metering. It’s mostly center weighted when using the rangefinder. With visoflex you can choose spot, center weighted or multi field using the -----> app !!! .", "link": "https://www.l-camera-forum.com/topic/317108-do-you-like-you-m10-d/?tab=findComment&comment=4122821"}, {"autor": "Steve Ricoh", "date": "10/06/2019 01:29  PM", "content": "I have the Green Cleen sensor cleaning kit, with vacuum, but the suction is minimal (works on Venturi principle I think I'm correct in saying) requiring the tip to be within mm's of the sensor. The principle is to hoover the loose stuff, followed by wet and dry cleaning using the items supplied. I've done the hoovering but so far I've bottled the wet and dry step, preferring to use the Giotos now and again, followed by the spot removal -----> tool !!! . The funny thing is this: most of us can accept dust on analogue - I expect it - but with digital we expect perfection.", "link": "https://www.l-camera-forum.com/topic/302152-looks-like-i-need-to-get-a-wet-cleaning-kit/?tab=findComment&comment=3831850"}, {"autor": "jhluxton", "date": "10/25/2019 06:09  PM", "content": "Today I decided to a dust check on my two M bodies. The new ME240 was okay - only had it since July. There was a tiny spec showing at the very edge of the frame I decided to leave that. Glad I did after what happened with the M262. My M262 is just over 3 years old, this was a different matter. I have not checked it for 18 month, however, I have had to use the spotting -----> tool !!!  a bit in Lightroom a bit on the sky particularly on stopped down shots and the dust check showed up three large spots. When I last gave it a dust out I used a Giotto rocket blower. I pulled the blower out of the bag pressed it a few times to ensure it hadn't ingested any dust and gave a few blows into the camera. There were now the three original specs plus a couple more small ones. After several blows and checks the dust on the sensor was increasing! I now have about five large specks and 10 fine specks! Using the Giotto seemed to be adding dust to the sensor so I have stopped. Not sure a Giotto is a good idea now. ☹️ I am scared of causing any damage by touching the sensor and have never used a wet kit. So it looks like I will be off for a trip along the M62 to Manchester for clean out in the next couple of weeks. It is a great shop with very helpful staff - but I just wish it wasn't in the city centre!! Parking and getting in and out is such a pain, but it is probably less stressful than touching the sensor! John", "link": "https://www.l-camera-forum.com/topic/302152-looks-like-i-need-to-get-a-wet-cleaning-kit/?tab=findComment&comment=3842178"}, {"autor": "pedaes", "date": "10/25/2019 06:50  PM", "content": "38 minutes ago, jhluxton said: Today I decided to a dust check on my two M bodies. The new ME240 was okay - only had it since July. There was a tiny spec showing at the very edge of the frame I decided to leave that. Glad I did after what happened with the M262. My M262 is just over 3 years old, this was a different matter. I have not checked it for 18 month, however, I have had to use the spotting -----> tool !!!  a bit in Lightroom a bit on the sky particularly on stopped down shots and the dust check showed up three large spots. When I last gave it a dust out I used a Giotto rocket blower. I pulled the blower out of the bag pressed it a few times to ensure it hadn't ingested any dust and gave a few blows into the camera. There were now the three original specs plus a couple more small ones. After several blows and checks the dust on the sensor was increasing! I now have about five large specks and 10 fine specks! Using the Giotto seemed to be adding dust to the sensor so I have stopped. Not sure a Giotto is a good idea now. ☹️ I am scared of causing any damage by touching the sensor and have never used a wet kit. So it looks like I will be off for a trip along the M62 to Manchester for clean out in the next couple of weeks. It is a great shop with very helpful staff - but I just wish it wasn't in the city centre!! Parking and getting in and out is such a pain, but it is probably less stressful than touching the sensor! John If you have blown dust on sensor should not need wet clean. Try Eyelead or similar gel pad - it's what Leica use.", "link": "https://www.l-camera-forum.com/topic/302152-looks-like-i-need-to-get-a-wet-cleaning-kit/?tab=findComment&comment=3842221"}, {"autor": "Herr Barnack", "date": "04/11/2019 10:09  PM", "content": "On 5/2/2018 at 1:20 AM, howiebrou said: Could you give us a quick summary of the cleaning method and dust avoidance advice you were given? I have yet to clean my sensor and am rather apprehensive about doing so! @howiebrou, This is not official sensor cleaning doctrine from anyone or from any manufacturer; it is just the method I use and is based on sensor cleaning instructions found in the M-P 240 manual and the instructions that come with the swabs and cleaning fluid I use. I have had 100% positive results with 0% problems as a result of using this cleaning technique. I seem to need to clean my sensor about once every 6-9 months. I clean my sensor when multiple dust specks show up in post processing that require an annoying amount of time and work to clone over, not every time a spot or two turns up in post. This description is from a blog post that I wrote for my website; I hope this will shed some light on the sensor cleaning process (we are actually cleaning the protective glass cover, not the sensor itself) for you and others. Quote Digital cameras have sensors; unless your camera has a built in dust reduction system, sooner or later your sensor will need to be cleaned - it's inevitable. Then what?? It's a lot quicker, easier and less costly to do it yourself - if you follow your camera manual instructions exactly and are careful, you can successfully clean your camera's sensor yourself. A lot of photographers fear damaging their sensor and will do about anything to avoid cleaning it themselves. However, there is no reason to be afraid to do this procedure yourself, provided you do it properly. You will need the right sensor cleaning supplies - I use Eclipse Optic Cleaning Fluid and Photosol Sensorswab Ultra sensor cleaning swabs. If your camera has a full frame (24x36mm ) sensor, you will need the Type 3 swabs; they are 24 mm wide, as is your sensor. APS-C and smaller sensors will need smaller swabs. Photosol's website has information that will help you determine which swab is right for your camera. One of the most important factors in successful sensor cleaning is to perform this procedure in a clean, dust free environment. Not many of us have access to a clean room such as computer manufacturers build computers in. If your home has airborne dust issues you will need to clean your sensor in an environment where dust is less of a problem (you can check for airborne dust by looking through the beam of a bright flashlight at night; if you see a lot of dust particles dancing in the air, you should probably go elsewhere to clean your sensor). Where would that be? Try a museum or a library; -----> find a spot !!!  away from frequent foot traffic, entries and exits and away from heating and cooling ducts that will cause airflow that will stir up any dust that may be present.. Another important point is this - do not use compressed air (\"canned air\") to blow dust from your sensor before cleaning. Canned air can spray liquid propellant onto your sensor cover glass, something you do not want to happen. That liquid can also get behind the sensor and into the electronic components of your camera. If that happens, you are in for a serious repair bill. Instead of canned air, use a blower bulb like the Giottos Rocket Blaster, which will safely remove loose dust particles from your sensor. Also, do not blow dust from your sensor using your breath, as you can spray tiny droplets of saliva into the camera. The sensor swabs I use are dry, which means I need to apply the proper cleaning fluid to them before use. Too much cleaning fluid can damage the electronics inside your camera, so proceed with caution. I have found that five drops on the 24mm wide swabs my camera requires is sufficient (three drops on one side, two on the opposite side, equally spaced across the width of the swab); I would be comfortable using two drops per side, but no more than five drops for a 24 mm wide swab. Again, follow the directions that come with your swabs and cleaning fluid to the letter. Each camera has a specific procedure for sensor cleaning; if you precisely adhere to the instructions in your camera manual, you should have a successful sensor cleaning result. If there are still spots on your sensor after cleaning, you can re-clean the sensor provided your camera manual does not advise against doing so (I once ended up with an eyelash on my sensor that required two cleanings to remove; the first try simply moved it closer to the center of the sensor; this happens sometimes). If you follow the directions in your camera manual and in your swab and cleaning fluid to the letter, you should have no problems cleaning your sensor at home (or at your local museum or library, if need be). DISCLAIMER 1: The above description of sensor cleaning is simply a description of how I clean my sensor; it is not intended as training or professional advice in sensor cleaning. 2: Always follow the directions in your camera manual and in your sensor cleaning materials to the letter. When in doubt, contact your camera manufacturer for advice on sensor cleaning, or return your camera to the manufacturer's repair department for sensor cleaning. 3: The author accepts no responsibility for damage of any kind resulting from do it yourself sensor cleaning. When in doubt, contact your camera manufacturer to return your camera to the manufacturer's repair department for professional sensor cleaning. Edited April 11, 2019 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=findComment&comment=3720592"}, {"autor": "roydonian", "date": "02/28/2019 06:35  PM", "content": "To expand on my earlier comment, the only disadvantage of the M-D is its inability to provide JPEGs for quick-look assessment of images. Last week, a second-hand lens arrived my mail, and having previously purchased two examples that did not work correctly (one would not focus, the other had inaccurate rangefinder coupling) I wanted to check it. Fitting the lens to the camera took a matter of moments, and the task of photographing objects at infinity and two medium distances took only a few minutes, so the last thing I wanted was to mess around with a Lightroom session. It was easier to move the lens to my M9, retake the test shots, slip the memory card into a reader, and use Irfanview to display the JPEGs of the three images. Leica really should have offered a simple conversion -----> tool !!!  able to read the DNGs on the card, then write JPEG and DNG versions to a selected location on the hard disk. I've looked on the internet for a utility that could do this simple task, but the only one I've found takes more than 18 sec to convert each image.", "link": "https://www.l-camera-forum.com/topic/294368-before-i-buy-m-d-262/?tab=findComment&comment=3692864"}, {"autor": "John Robinson", "date": "02/22/2021 03:26  PM", "content": "3 hours ago, Cobram said: You mentioned new sensor... Why? Do you think it affects rendering? I have another image I will post from the same camera just before the sensor was replaced. My observation was that the image quality of the new sensor was not much different from the old one but the corroded spots that showed up, mostly in sky or large areas of a single tone made the images difficult if not impossible to work with, although extensive retouching with the clone -----> tool !!!  in photoshop rescued some of them.", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/?tab=findComment&comment=4146736"}, {"autor": "Paul J", "date": "07/18/2013 12:42  PM", "content": "I'm very impressed by the Lightroom colour noise reduction tool. You can crank it up full and it has almost no adverse effects on the image (not so with the luminance noise reduction) and eliminates most of the M9's inherent colour noise issues. Also spot use of the moire -----> tool !!!  is very good too at times although this one does need some care in use. The Luminance noise reduction is also very good too.", "link": "https://www.l-camera-forum.com/topic/208876-m9-colors-at-night-%E2%80%94-best-way-to-shoot-high-iso/?tab=findComment&comment=2377263"}, {"autor": "MikeMyers", "date": "02/08/2020 01:09  PM", "content": "1 hour ago, farnz said: One of the M8/M8.2's party tricks that's not widely known is the ability to retrieve massive amounts of detail out of the shadows in raw (more than any other camera I've used). The trick is to keep ISO low or there will plenty of noise and to pull the shadows up in post-processing. This translates to being able to shoot at higher shutter speeds in low light conditions to counter camera shake and have usable pictures; they won't look much on the M8's LCD but will emerge during post. Pete. Thank you for explaining something I was puzzled about. In the sunset photo I just posted, I thought the building at the right was just \"black\". When playing around with the sliders during processing, I noticed I could bring up all the details. Even the buildings in downtown Miami could have the details shown in the photo. To me, having everything \"black\" is what I envisioned as I took the photo, and was working with it, but I couldn't resist showing some of the details in the side of the building. Next time I try this photo (it's right outside my window, so I can photograph it ever day if I wish) I want to try the exposure-lock \"trick\". I never knew the camera even had exposure lock until I started reading the manual again on a whim. Since there is (only) one spot in the image where the exposure is metered, that should make this -----> tool !!!  more useful than on my other cameras with metering spots all over the image. If you know lots of other \"party tricks\", can you please write something about them, or if you've done so long ago, suggest where I can find the information? This \"website\" is so huge, I've been looking all over for useful information.", "link": "https://www.l-camera-forum.com/topic/306197-m82-keep-an-open-mind/?tab=findComment&comment=3908640"}, {"autor": "menos I M6", "date": "04/27/2016 05:10  PM", "content": "That's sensor dust - when you are in Lightroom's development module, hit \"Q\" and you can use the spot removal -----> tool !!! . While being in the spot removal tool hit \"T\" which will display a tool bar at the bottom where you have another nifty tool to display an inverted contrasty mask which can be adjusted with a slider. This makes finding certain \"hidden\" dust spots very easy. You can do your dust spotting in one of your photographs that makes this very easy (a blank wall, shot at f16 or the bright sky) and then copy over the dust spotting information from one photograph to a bulk of photographs. Easy: select all photographs, you want to apply the dust spotting information in the library grid view (or in any module that shows you the film roll at the bottom of the screen). Make sure the one photo which does have your dust spotting already applied is the selected photo of the entire bulk. Now go to the development module (hit \"D\" on your keyboard) and click the \"sync\" button in your development tool ribbon on the very bottom right of the screen (it is the left button of the two buttons). A pop up menu will be displayed where you can select what settings from your selected master photo you wish to sync - you want to select only the dust spotting option, if that is what you want to apply to all selected photographs in the group from your master photograph in focus. After applying, let Lightroom calculate new 1:1 previews of the group of photos and quickly check them all if any of the dust spots have ill effects (easiest to do in the development module, while pressing activating \"Q\" and deactivating \"Q\" as necessary to see the dust spots) Easy photographs are those of dust in the sky - Lightroom will often simply correct them easily. More difficult ones are those with irregular structures (hair, grass, etc …) or regular structures with repeating patterns (like a panning shot at very slow shutter speeds or architecture shots) - Lightroom will often not properly realize the patterns and will place a wrong correction which is easily spotted and has to be adjusted manually. Best practice is to clean the sensor once Lightroom dust spotting becomes to tedious. BTW - if you run also Adobe Photoshop and work with tiff files, a faster way to dust spot is to use a selection tool (I prefer the free form selection tool), multi select all dust spots in an area and then \"shift +F5\" and use the \"fill content-aware\" option to remove dust spots. This is how I spot my film scans for dust, water spots and scratches and it is both much, much faster than Lightroom's spotting tool and does not slow the computer down as much as a photograph with lots of dust spots in Lightroom (as it is not non-destructive as Lightroom, but will correct the image per pixel immediately). Happy dust spotting! PS: if you are on a Mac, download the app \"Cheatsheet\" - it allows you to see all keyboard shortcuts of the active app by simply holding the command key for a few seconds - makes learning those shortcuts and working in Adobe products so much easier.", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=findComment&comment=3034598"}], "name": "leica_Spots&Apps"}