{"interestingcomments": [{"autor": "Bill Livingston", "date": "01/19/2017 08:49  PM", "content": "I looked at both DNG and thought there was much less purple fringing on the M10 (beard, his right ear, left on photo) and I thought the colour was a little better, not much... certainly not enough on those images to make any definitive comment, so I will wait for those who have more experience with detail evaluation. Not a massive difference though. I saw much bigger differences in the SL. (That just gets to be a better and better camera in my view). The more I look at the M10, the nicer it looks. Video isn't an issue for me... so the M10 would be a good fit, but I'm not remotely concerned about the thinner body (perhaps because I have never owned a Leica film M, so body size isn't an unconsciously learned 'thing' for me (I suspect most wonders complaining about M8/9240 body width are previous or existing film owners). I will still wait for the M10-P as I like my M240P too much to be able to justify the expense of changing right now... I may not even change then, I'll just keep my powder dry for a while. Had it been an EVF or hybrid viewfinder, I would have bought one immediately as I have said before... so if an M EVF or an -----> ML !!!  or QL or whatever, appears in the next few months, maybe Leica will get my money then. But it looks like a great camera and it will please a LOT of Leica owners who have had a M8/9 or returned to film as they thought the M digitals were too bloated (not that I agree). Congratulations to Leica though. It seems that the Q, the SL and now the newest M have all hit the spot for the majority of potential customers - which is no mean feat given the customer base they have!!! --img--  Edited January 19, 2017 by Bill Livingston", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=3191318"}, {"autor": "scott kirkpatrick", "date": "12/08/2017 04:54  AM", "content": "This subject has gotten kinda out of hand... --img-- L8002523 by scott kirkpatrick, on Flickr --img-- L8002540 by scott kirkpatrick, on Flickr A -----> machine learning !!!  conference started by a few of us in the '80s with a few hundred attendees has blown up to over 8000 in Long Beach this week. M10, 28/2.8 asph (v2) scott", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=3413406"}, {"autor": "scott kirkpatrick", "date": "09/15/2018 05:42  PM", "content": "Sculpture Garden at the Israel Museum, Jerusalem, two of -----> Ai !!!  Weiwei's cast trees and Lipschitz dancers: --img-- L1000090 by scott kirkpatrick, on Flickr --img-- L1000147 by scott kirkpatrick, on Flickr both M10, Elmarit M 24 asph Edited September 15, 2018 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=3593609"}, {"autor": "wolan", "date": "09/15/2020 06:06  PM", "content": "32 minutes ago, pattyfrank said: What lens? Lovely painterly feel. Outstanding cloudscape. Thanks. This was taken with an old Nikon 20mm f4 -----> Ai !!! . It is a lovely and very small lens. Not super sharp but sharp enough Cheers.", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=4046503"}, {"autor": "Yarosuav", "date": "11/07/2021 05:33  PM", "content": " -----> Ai !!! n’t gonna happen.", "link": "https://www.l-camera-forum.com/topic/326250-any-chance-of-adding-the-video-back/?tab=findComment&comment=4309002"}, {"autor": "jaapv", "date": "11/02/2021 01:30  AM", "content": " Not side by side, but comparing a considerable number of shots. As we all know an image is a composite of lens and sensor performance, which means that it is not possible to make sweeping statements about \"all Leica lenses. on. all other brands\" Some. do indeed perform badly, some adequately, some the same and a few better. Whether this has any impact on the quality of. the photograph is an open question. My answer would be: rarely, as subsequent. postprocessing. will. make far. more difference - see the amazing improvement. of. the Voigtländer Ultra-Wide Heliar; on a Leica sensor it performs well, on a Panasonic sensor abysmally bad, and.Topaz Sharpen -----> AI !!!  thinks that smearing is motion blur, and cleans it up to a high level. Try the same. trick on a Summicron C40 which has notoriously bad. corners on foreign sensors and it does not work, if anything, the corners get worse. As for the Panasonic S series sensors I have a strong suspicion that they are the same as the Leica SL2 ones, or at least close cousins. The Photographic Dynamic Range curves are virtually identical (with one anomaly in a non-measured bit) Only the Bayer filters appear to differ. As an aside: which SEM? I have no complaints about the 18.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=findComment&comment=4304931"}, {"autor": "SrMi", "date": "11/02/2021 01:43  AM", "content": "11 minutes ago, jaapv said: Not side by side, but comparing a considerable number of shots. As we all know an image is a composite of lens and sensor performance, which means that it is not possible to make sweeping statements about \"all Leica lenses. on. all other brands\" Some. do indeed perform badly, some adequately, some the same and a few better. Whether this has any impact on the quality of. the photograph is an open question. My answer would be: rarely, as subsequent. postprocessing. will. make far. more difference - see the amazing improvement. of. the Voigtländer Ultra-Wide Heliar; on a Leica sensor it performs well, on a Panasonic sensor abysmally bad, and.Topaz Sharpen -----> AI !!!  thinks that smearing is motion blur, and cleans it up to a high level. Try the same. trick on a Summicron C40 which has notoriously bad. corners on foreign sensors and it does not work, if anything, the corners get worse. As for the Panasonic S series sensors I have a strong suspicion that they are the same as the Leica SL2 ones, or at least close cousins. The Photographic Dynamic Range curves are virtually identical (with one anomaly in a non-measured bit) Only the Bayer filters appear to differ. As an aside: which SEM? I have no complaints about the 18. Sean Reids’s analysis concludes that SR1 is not a great platform for RF lenses.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=findComment&comment=4304938"}, {"autor": "Tailwagger", "date": "11/02/2021 02:10  AM", "content": " 22 minutes ago, jaapv said: Not side by side, but comparing a considerable number of shots. As we all know an image is a composite of lens and sensor performance, which means that it is not possible to make sweeping statements about \"all Leica lenses. on. all other brands\" Some. do indeed perform badly, some adequately, some the same and a few better. Whether this has any impact on the quality of. the photograph is an open question. My answer would be: rarely, as subsequent. postprocessing. will. make far. more difference - see the amazing improvement. of. the Voigtländer Ultra-Wide Heliar; on a Leica sensor it performs well, on a Panasonic sensor abysmally bad, and.Topaz Sharpen -----> AI !!!  thinks that smearing is motion blur, and cleans it up to a high level. Try the same. trick on a Summicron C40 which has notoriously bad. corners on foreign sensors and it does not work, if anything, the corners get worse. As for the Panasonic S series sensors I have a strong suspicion that they are the same as the Leica SL2 ones, or at least close cousins. The Photographic Dynamic Range curves are virtually identical (with one anomaly in a non-measured bit) Only the Bayer filters appear to differ. As an aside: which SEM? I have no complaints about the 18. 21mm. I'm sure some perform better than others and I'd be the first to agree that there are many circumstances where'd you'd never notice a problem. Corners are often OoF anyway or contain nothing of interest. Close focusing diminishes the angle of incidence lessening the effect and typically involves OoF backgrounds where any smearing could be put down to bokeh and might actually be welcome anyway. My annoyance with this subject is partially due to my own collection of wide glass which sees a lot of use and tends to fares poorly, but also with the hit or miss nature of what works, what doesn't and under what circumstances... particularly for the sums involved. It's why an adapted EVF solution for M glass is a non starter with me, unless the sensor has the same attributes of the M (microlensing, thin cover glass).", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=findComment&comment=4304941"}, {"autor": "MRJohn", "date": "04/17/2021 06:16  PM", "content": "If there is a new EVF I hope it is half the size (height) compared to current ones. As for the rest, it would need to be more revolutionary than the current rumor base for me to upgrade from my M10-D. Like pay-for-performance based software enhancements: e.g. an indistinguishable Kodachrome look/preset right out of the box, square or 8x10 modes, an IA based visualization of vantage point, an -----> AI !!! -base zone system visualization... can all be done in post with extra time but if the camera saves me time this is great (and money).", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4183407"}, {"autor": "FrozenInTime", "date": "08/11/2021 09:38  PM", "content": "5 hours ago, lct said: At 100% magnification? 38 minutes ago, Herr Barnack said: Yes, although I seldom have a need to go to that extreme. I'm getting good results from the M10M handheld that reveal even more detail in crops scaled up beyond 100% with Lightroom -----> AI !!! . I read the lens stabilization on the Q2 does not function with shutters shorter than 1/60s ; I don't hear complains of poor handheld sharpness. I would imagine that IBIS similarly has a mechanical inertia and response bandwidth that would not remove as much shake as shutter speeds greater than say 1/1000s . Maybe the transition point is different from my guess ; it would be a interesting experiment to conduct on a SL2 ?", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4255320"}, {"autor": "Herr Barnack", "date": "08/12/2021 01:59  PM", "content": "16 hours ago, FrozenInTime said: I'm getting good results from the M10M handheld that reveal even more detail in crops scaled up beyond 100% with Lightroom -----> AI !!! . I read the lens stabilization on the Q2 does not function with shutters shorter than 1/60s ; I don't hear complains of poor handheld sharpness. I would imagine that IBIS similarly has a mechanical inertia and response bandwidth that would not remove as much shake as shutter speeds greater than say 1/1000s . Maybe the transition point is different from my guess ; it would be a interesting experiment to conduct on a SL2 ? If that is the case, it's pretty much pointless. @jonoslack Do you know any information regarding the above?", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4255617"}, {"autor": "jonoslack", "date": "08/12/2021 03:53  PM", "content": "1 hour ago, Herr Barnack said: If that is the case, it's pretty much pointless. @jonoslack Do you know any information regarding the above? Hi There I'm afraid I don't know - I'll try and find out, but I'm not sure it's terribly relevant? 18 hours ago, FrozenInTime said: I'm getting good results from the M10M handheld that reveal even more detail in crops scaled up beyond 100% with Lightroom -----> AI !!! . I read the lens stabilization on the Q2 does not function with shutters shorter than 1/60s ; I don't hear complains of poor handheld sharpness. I would imagine that IBIS similarly has a mechanical inertia and response bandwidth that would not remove as much shake as shutter speeds greater than say 1/1000s . Maybe the transition point is different from my guess ; it would be a interesting experiment to conduct on a SL2 ?", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4255673"}, {"autor": "Tailwagger", "date": "08/19/2021 04:34  PM", "content": "2 hours ago, pgk said: I give up. People's understanding of what is and isn't possible is simply weird. I will say this one last time. A lens which has ony one mechanical coupling and can merely tell the camera which lens it is and nothing ore through 6-bit coding, is going to be compromised on anything other than its present platform. The 'magic' of Leica M lenses is that they are small and work well with the rangefinder bodies for which they were designed. Any other body will represent some sort of compromise somewhere. If that is what people want then fine, ask Leica to build it, at a price. But don't expect the images to be as good as those from other systems nor the user experience to be smooth and simple. Neither will be the case. I'm not trying to be argumentative, but I think you're being a little myopic. The geometry that underlies the core of the lens design for all M lenses was conceived long before any notions of digital sensors existed. These optics were designed for compact 35mm film, not digital. As a result, creating a digital M was not as simple as slapping a sensor in an M body and voila. There is however a big difference between impossible and difficult. Ultimately, in spite of the refraction problems introduced by interposing a piece of glass between the digital 'film' and the lens, via some very clever mechanical, optical and software engineering, Leica managed to overcome what previously might have been seen as 'impossible'. One might not be able to repeal the laws of physics, but this is what engineering is about about... dreaming up ways of overcoming these sorts of problems such that it appears that they have been. Referencing 6 bit encoding above is an excellent example. The M didn't start out with lenses being coded, it took over 50 years for that to show up. In the intervening decade and half, the notion of providing 6 bits of information has become rather laughable. But we're just stuck right with 64 values for all eternity now, right? Not necessarily. If, for example, future Ms incorporated an RFID reader, every M mount lens, 6 bit or otherwise, could be equipped or trivially retrofitted updated its correct ID and the optical reader code be dropped. It would be possible to include far more info than just a simple id, as even the simplest of RFID tags has exponentially more bits than are in use today. Plenty of excess memory that could be useful for providing lens specific correction info or perhaps even something more exotic, say table info for -----> ML !!!  based aperture guessing. There is no doubt that some asks, might not be possible or available a a reasonable cost... currently. IBIS or a digital RF in a M size body are two of the seeming impossibilities of this generation. But things change, new techniques and technologies like RFID and ML appear, and what once seem undoable all of sudden is entirely possible.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4259453"}, {"autor": "eyeheartny", "date": "08/19/2021 06:12  PM", "content": "1 hour ago, Tailwagger said: There is no doubt that some asks, might not be possible or available a a reasonable cost... currently. IBIS or a digital RF in a M size body are two of the seeming impossibilities of this generation. But things change, new techniques and technologies like RFID and -----> ML !!!  appear, and what once seem undoable all of sudden is entirely possible. If you removed the entire optical RF assembly that stretches across the top of the M body, including moving parts (!!), additional RF windows, etc, I would imagine there would be plenty of space to allow an EVF assembly. If Sony can do it in the A7C, which is smaller than an M, why can't Leica do it? Even if we remove IBIS for the time being, an A7C has an EVF, all the hardware required to drive autofocus, and the same size sensor. If we remove the AF motors and control chips and prioritize a high quality EVF like in the Sony Alpha 1 (the current state of the art in EVFs) and strip out the optical rangefinder, a skilled engineering team should be able to do what they need to make this a reality.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4259517"}, {"autor": "Dennis", "date": "08/24/2021 07:18  PM", "content": "13 hours ago, cirke said: I have looked in the best OVF (Hasselblad H1, Alpa ...) and its not for me , I like EVF , I can see at night , I can see in B&W, I can zoom x10 And who knows, maybe in the future the -----> AI !!!  will shoot picture for you when you just feel something. In a way or another, all this techie stuff will help to catch the decisive moment, right? But consider that all the things you mention are like help, an addition, an extra, to what a simple M camera with an OVF (only) can do. . Now, try to shoot in harsh daylight a silhouette in BW with the EVF. Yes, you are pre-visualize the scene. And in BW. But you are also losing \"everything\" because you see all pitch black (in the shadows). My point is that to be able to see with EVF the proper exposure, or at night, it's not necessary a good thing. An OVF is always bright, and you see through it the reality. An honest and objective POV of the scene in front of you. It depends (in no particular order) on your skills, approach, feelings, vision, etc., how the final image will look and make people feel about it. For some, it's a labor of PP, some prefer to have an image already great in the raw files with slightly PP. You don't need to see it all to know how a picture will look like. As many already said here, the process is essential. And an OVF, especially for M passionate shooters, most of the time makes the process a better experience. My two cents p.s1 Zoom 10x? I have a binocular 10x25 for that 🤔 p.s2 As a pro, I'm ready for a big change. I will probably switch from DSLR to mirrorless in months. It doesn't matter which brand; it will be an EVF anyway. So I will probably start to see some silhouettes as well. But I also know that my M gear is growing, step by step, so the change to acclimate me to an intelligent (and custom to my needs) M system only, for everything. I really believe the M is unbeatable, it's just how one is able to master it. Working in progress on that. Edited August 24 by Dennis", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4262851"}, {"autor": "Tailwagger", "date": "08/24/2021 09:25  PM", "content": "31 minutes ago, beewee said: I’m curious how many people who complain about EVFs have actually used the one on the SL2/SL2-S. And when I mean ‘used’, I mean actually done some real world shooting out and about for an extended period. With few exceptions, the SL2-S EVF is as good, if not better than an OVF on a high end DSLR. The only time I found it troublesome is in strong backlit scenarios (especially while using highlight weighted exposure metering) but I think this is something that can be fixed in software and is not a problem of the underlying technology or concept. [Background position statement: I love my M. Of the 15K+ frames I shoot annually, it does 75% or more of them. My best work has been done with an M. I'm on my local dealers list for the M + 2 the day I pick up the M + 1. For as long as I can afford to, I'll keep buying them. I am therefore, not anti-M, nor Auntie Em, nor anti Toto or the Wizard of Oz for that matter.] Personally, I've noticed scenarios where the SL2 EVF outdoes the OVF in low light and others less so. But I can accept that it may well be true that currently the OVF, for those with young enough eyeballs, is superior to most EVFs in ultra low light... today. But last I checked, night vision is done electronically, not optically. If extreme low light viewing was a serious priority for manufacturers, I've little doubt that EVF based systems can far outdo simply looking through glass. So I think the implications of your last point is something possibly missed by some. I have said for many years now that eventually, anything that can be done electronically, rather than mechanically, will be, if for no other reason than cost. But also for the fact that there is far more upside for improving the capability as well. Mechanical shutters are certainly next on the hit list. In the case of the VF, E-viewing, be it software, hardware, -----> AI !!! , ML whatever, will continue to advance at a far greater pace than pure optical systems. Today, there are at least as many reasons to prefer a VF made of glass as there are to shun it. And some of those reasons are likely to always be valid. But eventually, for economics, performance or both, OVF will go the way of the dodo. Might the M OVF escape such a fate? Dunno, perhaps for the novelty of it, but I fear it's unlikely. Back to low light and the SL2. The very first thing I did with the SL2 was shoot at night just to checkout the noise levels and how well IBIS worked. Not quite to the same level of darkness as the previous examples, though it was quite dark, but OTOH I find it more interesting to shoot with at least some minimal light source around anyway. In both cases, SL-75, F2.0 ISO 1600 1/30\". Works well enough AFAIC. --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4262937"}, {"autor": "Tailwagger", "date": "09/30/2021 07:35  PM", "content": "3 hours ago, derleicaman said: There are two ways to accomplish what you are asking for; mechanically or electronically. The electronic route would be the easiest, mechanical would be very difficult. Actually there is a third way at least when it come to aperture, which is the one currently in use... doing it via software. The trouble today is that the results aren't all that accurate. One can imagine, however, using utilizing the current inputs along side -----> ML !!!  to train the software to discern the difference between f-stops at various focal lengths and distances to provide more reliable guesstimates. Edited September 30 by Tailwagger", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4284330"}, {"autor": "Steven", "date": "10/16/2021 09:17  PM", "content": "3 minutes ago, Ktsa5239 said: But Q2 has an evf for that kinda cropping, sounds like on the M it would just be an enlarged photo at preview..... The M has frame lines. And it has a new evf that is going to be the star of the show. and it has a buffer that’s improved and could handle ….. I don’t know …. Maybe -----> AI !!!  ? ….. like an iPhone that fakes perspective and dof at the press of a button ….. no. What am I saying. They wouldn’t do this to us M shooters. How could they dare. That would be too polarizing.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4294149"}, {"autor": "Ktsa5239", "date": "10/16/2021 09:25  PM", "content": " 7 minutes ago, Steven said: The M has frame lines. And it has a new evf that is going to be the star of the show. and it has a buffer that’s improved and could handle ….. I don’t know …. Maybe -----> AI !!!  ? ….. like an iPhone that fakes perspective and dof at the press of a button ….. no. What am I saying. They wouldn’t do this to us M shooters. How could they dare. That would be too polarizing. this is getting stranger by the minute.....", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4294153"}, {"autor": "bags27", "date": "10/16/2021 10:05  PM", "content": "46 minutes ago, Steven said: The M has frame lines. And it has a new evf that is going to be the star of the show. and it has a buffer that’s improved and could handle ….. I don’t know …. Maybe -----> AI !!!  ? ….. like an iPhone that fakes perspective and dof at the press of a button ….. no. What am I saying. They wouldn’t do this to us M shooters. How could they dare. That would be too polarizing. Well, Leica has put a lot of work into phone photography, right?", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4294171"}, {"autor": "Yarosuav", "date": "10/17/2021 12:00  AM", "content": "2 hours ago, Steven said: The M has frame lines. And it has a new evf that is going to be the star of the show. and it has a buffer that’s improved and could handle ….. I don’t know …. Maybe -----> AI !!!  ? ….. like an iPhone that fakes perspective and dof at the press of a button ….. no. What am I saying. They wouldn’t do this to us M shooters. How could they dare. That would be too polarizing. I do believe computational photography is the future. Software is eating the world, and photography is in many ways the ideal field to unleash that… With Luminar Bokeh AI (or whatever it’s called) you don’t even need fast lenses anymore for shallow DOF. But I didn’t think Leica would be the one to push that forward, though I may be wrong…", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4294234"}, {"autor": "jaapv", "date": "10/20/2021 09:05  AM", "content": "1 hour ago, Steven said: I personally think that the M10R is garbage in low light. I can't stand using that camera at night. Of course, if you come from a useless Q2, or an M240, the M10 and M10R will feel like low light monsters, but the reality is that it's far from the minimum standard I expect in 2021. This is the reason why I just bought an M10M, although I don't especially like BW photography. Topaz DeNoise -----> AI !!!  is a lot cheaper than a new camera...", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4296270"}, {"autor": "Yarosuav", "date": "10/20/2021 11:30  AM", "content": "2 hours ago, jaapv said: Topaz DeNoise -----> AI !!!  is a lot cheaper than a new camera... It’s not just the noise: dynamic range, color integrity, etc. - all tend to fall apart at high ISO…", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4296336"}, {"autor": "jankap", "date": "10/20/2021 11:45  AM", "content": "2 hours ago, jaapv said: Topaz DeNoise -----> AI !!!  is a lot cheaper than a new camera... Imagine the Leica M10+TOPAZ would be offered as a M11 with new data. Things must be have better data , otherwise they will not be sold. See Bovenbazen, the earth is free of costs, so should be taken and sold. .", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4296344"}, {"autor": "bilbrown", "date": "10/28/2021 03:23  AM", "content": "I don’t participate in rumors, but if I had to take an educated guess from what is currently on the market “close” to Leica in partners like Sigma and Panasonic this is how I would guess it. The Sigma FP-L seems to be the closest sensor to what the M11 may be, that’s a larger BSI sensor at 61MP, not 36, maybe with pixel-mapping it can have smaller DNGs for those of us that can’t get the latest MBP-M1MAX to crunch such large files. Pixel mapping will use the full sensor at at least two, maybe three other resolutions. Oh and as others have said this could add 1-2 stops of DR to the M10R. I think a clean ISO 12,800 would reduce the need for IBIS. Bottom plate on or off, a battery like the Q2 or SL2/SL2S would be lovely, and likely to make a standard battery for the FF Leica line up (sans the CL/TL and S3, which require different EQ.) So this rumor I expect fully. I would say they will Keep the upper body of M10, and change the bottom plate, not horribly off putting. Also this will keep all of the M10 accessories, not like the M240 which made all the accessories immediately obsolete. I think Leica is trying to forget the M240. I think a modern M should have USB-C charging (which means adding a port), GPS via a multifunction handgrip would be nice or a new Visoflex (make the Visoflex backward comparable). Tethering would be nice, for those of us that use the M in studio (few of us, but it’s significant for those of us that do it). But not a real deal breaker if not. I don’t need two SD card slots, but maybe some internal memory or Bluetooth back up to Fotos. I personally want about 9-10 fps, a new processor, larger buffer. Maybe some more computational toys like perspective control. Outside of all this, I think some fine tuning on color profiles would be helpful. In camera DNG processing. A black chrome, black paint and chrome version at launch, and upgrade program from the M240-M10 with a half-off trade in will get a lot of people to make the switch. Maybe some of this is going to be real. Maybe there will be a unicorn in each box and the sensor will show all the souls it has captured through some -----> AI !!!  algorithm, ha. Maybe nothing at all. I don’t expect 11/11/21, by a long shot.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4301348"}, {"autor": "IkarusJohn", "date": "10/27/2021 10:40  PM", "content": "33 minutes ago, John Ricard said: These are excellent points -most of which I agree with. I think it would be fair to say I agree with all of them. I would only take issue with the idea that Leica users can focus faster than a modern AF camera. I've seen that claim made on this forums -often accompanied by a tack sharp shot or two, but I consider these posts to be anecdotal. I'd love it for a NYC based Leica shooter to reach out so we can do some side by side testing on video. Nothing intended to embarrass anyone. I'd even do it without video if anyone were interested. But I'd be shocked beyond words if a Leica user could manually focus on different subjects faster than I could nail focus on a Z6. Hell, I'll even use my 10+ year old Nikon D3s and I'm confident the camera autofocuses faster than anyone can manually focus a rangefinder or any other type of manual focus camera. To be honest, John, I have always struggled with auto-focus. My first auto-focus camera was an F5, then a D800e, then the T, TL2, SL and X1D II and none of them were as reliable or fast in practice as my manual focus FE/FM cameras, manual focus -----> AI !!!  Nikkor lenses or my M cameras. With each I had what were supposed to be the best AF lenses, and still I struggled. Worst was my niece’s wedding, where I elected (for reasons I still don’t understand) to take the X1D II, with the 21, 45, 80 and 135 (& 1.7 converter). Switching lenses was a nightmare, lugging those lenses drove me crazy, and the AF just wouldn’t focus quickly enough to grab those moments which make wedding photographs so special. And, of course, manual focus by wire is very poor compared to Leica’s manual focus M primes. To be fair, the few images that worked were favoured by the happy couple over the professional photographer’s images, taken with what looked like a DX with an auto-focus zoom. Now, I’d be the first to admit that my dislike of AF has stood in the way of my mastering it for the last 30 years or so. But AF in my experience too often fails to focus at all, or fails to focus on the right thing. In your test, it may be quicker than an M lens, but will it focus on the right thing? I have never been able to achieve that with AF. When I see a potential image unfold, I think about where I want the subject, what is going to happen next and the depth of field I want (most of this instinctive), then I frame, focus and take the image. I know what I’m going to get in focus. With my SL, I back-button focus, then adjust manually. Auto-focus with some of Nikon’s best lenses has never achieved that for me. I suspect the fastest part of the process is a couple of inches behind the viewfinder. I appreciate your experience differs, but there is, perhaps, a reason why Leica continues to produce so many, such fine, manual focus M lenses, and they sell. Edited October 27 by IkarusJohn", "link": "https://www.l-camera-forum.com/topic/325684-my-take-on-the-one-thing-leica-users-get-wrong/?tab=findComment&comment=4301288"}, {"autor": "Erato", "date": "10/28/2021 01:09  AM", "content": "1. Some outstanding engravers based in the US could even engrave the most expensive watches. 2. The speed rewinder design is based on M3. 3. Leica RF focusing mechanism is relatively reliable while compared with 5D/Df or so. On the other note: I like -----> AI !!! /Non------> AI !!!  lenses on FM2 or else but AF. 4. Use the hairdryer to make everything much easier while you try to remove it. Those marks on the sticker are certifications for many standards and criteria. And as a matter of fact, we don't care whether it's there or not.", "link": "https://www.l-camera-forum.com/topic/325684-my-take-on-the-one-thing-leica-users-get-wrong/?tab=findComment&comment=4301322"}, {"autor": "rosuna", "date": "12/19/2018 09:02  AM", "content": "The key difference of the M11 should be the global electronic shutter (by Panasonic). Global electronic shutters and advanced software based on -----> AI !!!  is the reason mobile phones make those gorgeous pictures. They combine several photos for wider range, and clearer pictures, even when you don't touch \"HDR\" option. It is not a question of noise, but a question of getting a set of pictures the camera combines for the final photo. Very short exposure times are possible.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/?tab=findComment&comment=3649721"}, {"autor": "willeica", "date": "12/19/2018 02:04  PM", "content": "4 hours ago, rosuna said: The key difference of the M11 should be the global electronic shutter (by Panasonic). Global electronic shutters and advanced software based on -----> AI !!!  is the reason mobile phones make those gorgeous pictures. They combine several photos for wider range, and clearer pictures, even when you don't touch \"HDR\" option. It is not a question of noise, but a question of getting a set of pictures the camera combines for the final photo. Very short exposure times are possible. ﻿ The beginnings of computational photography for Leicas may come before the M11. In Wetzlar in October, Stefan Daniel told us that Leica was watching such developments. Huawei phones with Leica lenses already have elements of this. As a traditional photographer myself, I hope that when such features come to mainstream cameras they will be available at the option of the photographer. William", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/?tab=findComment&comment=3649814"}, {"autor": "ynp", "date": "11/12/2020 12:53  AM", "content": "27 minutes ago, steve 1959 said: I think the M11 will have an \"aesthetic filter\" built into the sensor. Yes. And -----> AI !!!  computational filters...😆", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/?tab=findComment&comment=4078657"}, {"autor": "MikeMyers", "date": "08/10/2021 01:24  PM", "content": "I remember looking at the gallery of this and the other related photos.... Beautiful photos. When @jaapv wrote me about \"Topaz Sharpen -----> AI !!! \" I was immediately thinking what it might do for this Lion photo. Worth a try - it's an amazing program. It corrects for out of focus, or \"soft\", or \"motion blur\" images. I'll never get to take photos like this in \"the wild\", but I sure plan to try my best after I sign up for ZooMiami.", "link": "https://www.l-camera-forum.com/topic/323114-buying-a-long-lens-for-occasional-use-on-my-leica-m10/?tab=findComment&comment=4254539"}, {"autor": "Chaemono", "date": "08/16/2020 04:53  PM", "content": "vor 30 Minuten schrieb scott kirkpatrick: Somebody remind me what the M11 will offer to pry the M10-R and M10-D out of my cold dead hands? Just swapping in a Maestro 3 processor with its 4GB buffer? BTLE for faster Fotos connection? I 'm not holding my breath. You’ll be the first one to exclaim that you can’t wait to get your hands on one, I bet. vor 19 Minuten schrieb M10 for me: M11 will include photography by software . . . -----> AI !!!  and computational photography. Interesting. How about speech recognition? vor 16 Minuten schrieb jonoslack: I think IBIS Is very unlikely, it would almost certainly make the camera fatter - and I think they've been there and realised it's the wrong place! It didn’t make the SL2 fatter, did it? Hi res sensors need IBIS, in my shaky hands, at least. Edited August 16, 2020 by Chaemono", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/?tab=findComment&comment=4028120"}, {"autor": "M10 for me", "date": "08/16/2020 06:13  PM", "content": "vor einer Stunde schrieb Chaemono: -----> AI !!!  and computational photography. Interesting. How about speech recognition? Cars have it; phones have it. M12 might have it.", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/?tab=findComment&comment=4028182"}, {"autor": "BlackBarn", "date": "08/08/2021 10:02  PM", "content": "I used the M10M for years but it became so limiting so in hindsight probably the worse camera I’ve used. I skipped a few models and recently purchased the M14 with the upgraded -----> AI !!!  features which emulates every Leica lens ever made and simulates the subjects position through 360 degrees with its 42 lighting conditions. However looking forward to the M15 with its rumored ‘hover’ function. So the M14 along with the old iPhone 186 would be my favorites.", "link": "https://www.l-camera-forum.com/topic/323249-15-years-of-digital-leica-m-which-model-is-your-favorite-and-most-hated/?tab=findComment&comment=4253638"}, {"autor": "Photoworks", "date": "08/09/2021 01:11  AM", "content": "3 hours ago, BlackBarn said: I used the M10M for years but it became so limiting so in hindsight probably the worse camera I’ve used. I skipped a few models and recently purchased the M14 with the upgraded -----> AI !!!  features which emulates every Leica lens ever made and simulates the subjects position through 360 degrees with its 42 lighting conditions. However looking forward to the M15 with its rumored ‘hover’ function. So the M14 along with the old iPhone 186 would be my favorites. wow I feel it was announced only last year. good that you will enjoy 15, seams to be a good number", "link": "https://www.l-camera-forum.com/topic/323249-15-years-of-digital-leica-m-which-model-is-your-favorite-and-most-hated/?tab=findComment&comment=4253693"}, {"autor": "jaapv", "date": "08/25/2020 11:26  AM", "content": "Always, layers, blending and brush tools - mainly in PS CC. Has anybody used the new Topaz Mask -----> AI !!!  plugin yet?", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4032986"}, {"autor": "jaapv", "date": "08/28/2020 08:43  PM", "content": "I have been reworking old files with modern software,notably CC 2020, Topaz Sharpen -----> AI !!!  and Topaz Denoise. It is amazing what present-day programs can pull from these old files", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4035288"}, {"autor": "jdlaing", "date": "08/28/2020 08:48  PM", "content": "3 minutes ago, jaapv said: I have been reworking old files with modern software,notably CC 2020, Topaz Sharpen -----> AI !!!  and Topaz Denoise. It is amazing what present-day programs can pull from these old files The software tech marches faster than the equipment in some cases.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4035293"}, {"autor": "Tailwagger", "date": "08/29/2020 03:03  AM", "content": "5 hours ago, Pixeleater said: I knew as soon as I hit send that it really was a dumb question. I’m not rich either but am sometimes an idiot, as my question demonstrated. LOL. It wasn't a dumb question; it was just addressed to someone who is honor bound to play dumb, at least on this particular topic. 😀 Way of the world. But as we are under no such obligation. Let's briefly review a few well known facts to offer a take on what I assume is an underlying fear that a far more compelling M is just barely over the horizon. What do we actually know? The M10-M/R and S3 were just introduced. Most of us believe that all three share the same sensor architecture. We presume this was done to spread the cost of development. Going your own way on a new sensor architecture is serious business, especially for a comparatively small concern. Not something undertaken on a whim. Consider the previous generation M10 sensor remained state of the M art for 3.5 years. It continues to soldier on. The M240's sensor ruled the M roost for over 4 years and remained in production cameras as recently as the M-E intro'd last year. Seven years+. Given that the heart of the two latest Ms is a brand new part, what on earth would lead anyone to believe that a significantly better photographic engine is a year away? History and common sense suggest that this is the M sensor for the next few years at least. So what else might be around the corner that actually would warrant holding off and waiting for an actual M11***? IBIS? We already have heard that this isn't likely anytime soon. Why? Well, if nothing else, they just introduced a brand new non-IBIS sensor. More pixels... oh yea... brand new sensor. Better DR... sorry repeating myself... brand new sensor. Better battery life? E-shutter? Upgrade to Maestro 3 or beyond? Internal -----> AI !!!  engine doing...? Likely I'm missing something here. Just what is it that those bloviating over the supposed limited shelf life of the 10-R are expecting to utterly bury it anytime soon? I'm genuinely perplexed as to exactly what that might be. To echo Jono, none of this reasoning guarantees that an M11 wont be announced tomorrow. But likewise, there's no certainty that the sun will rise in the morning. Both assertions involve probabilities based on historical observation; one admittedly a bit more certain than the other. Regardless, none of this nonsense addresses the real reasons, if any, to prefer a 10-R over whatever you currently are shooting. That can go either way for any number of reasons. What it does suggest, IMO, is that any decision shouldn't be influenced by thinking that there is a high probability of the 10-R being significantly outdone by another M version anytime soon. *** If the M11 even debuts in this decade. As I've mentioned elsewhere, AFAICT, the model designation Leica employs refers to the physical body, not the content stuffed there-in. This, IMO, is the reason the M10-M/R are not branded as the M11 and M11M despite the generational change from an imaging standpoint. If it's the same body, it gets the same number. It's not entirely impossible that a significant packaging change is under a year away and the next camera will be called M11 as a result. If so it will, of necessity, largely be an M10-R in a M11 body. In which case, I'm perfectly happy with my M11 in an M10 body.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4035423"}, {"autor": "Kwesi", "date": "08/29/2020 12:47  PM", "content": "9 hours ago, Tailwagger said: It wasn't a dumb question; it was just addressed to someone who is honor bound to play dumb, at least on this particular topic. 😀 Way of the world. But as we are under no such obligation. Let's briefly review a few well known facts to offer a take on what I assume is an underlying fear that a far more compelling M is just barely over the horizon. What do we actually know? The M10-M/R and S3 were just introduced. Most of us believe that all three share the same sensor architecture. We presume this was done to spread the cost of development. Going your own way on a new sensor architecture is serious business, especially for a comparatively small concern. Not something undertaken on a whim. Consider the previous generation M10 sensor remained state of the M art for 3.5 years. It continues to soldier on. The M240's sensor ruled the M roost for over 4 years and remained in production cameras as recently as the M-E intro'd last year. Seven years+. Given that the heart of the two latest Ms is a brand new part, what on earth would lead anyone to believe that a significantly better photographic engine is a year away? History and common sense suggest that this is the M sensor for the next few years at least. So what else might be around the corner that actually would warrant holding off and waiting for an actual M11***? IBIS? We already have heard that this isn't likely anytime soon. Why? Well, if nothing else, they just introduced a brand new non-IBIS sensor. More pixels... oh yea... brand new sensor. Better DR... sorry repeating myself... brand new sensor. Better battery life? E-shutter? Upgrade to Maestro 3 or beyond? Internal -----> AI !!!  engine doing...? Likely I'm missing something here. Just what is it that those bloviating over the supposed limited shelf life of the 10-R are expecting to utterly bury it anytime soon? I'm genuinely perplexed as to exactly what that might be. To echo Jono, none of this reasoning guarantees that an M11 wont be announced tomorrow. But likewise, there's no certainty that the sun will rise in the morning. Both assertions involve probabilities based on historical observation; one admittedly a bit more certain than the other. Regardless, none of this nonsense addresses the real reasons, if any, to prefer a 10-R over whatever you currently are shooting. That can go either way for any number of reasons. What it does suggest, IMO, is that any decision shouldn't be influenced by thinking that there is a high probability of the 10-R being significantly outdone by another M version anytime soon. *** If the M11 even debuts in this decade. As I've mentioned elsewhere, AFAICT, the model designation Leica employs refers to the physical body, not the content stuffed there-in. This, IMO, is the reason the M10-M/R are not branded as the M11 and M11M despite the generational change from an imaging standpoint. If it's the same body, it gets the same number. It's not entirely impossible that a significant packaging change is under a year away and the next camera will be called M11 as a result. If so it will, of necessity, largely be an M10-R in a M11 body. In which case, I'm perfectly happy with my M11 in an M10 body. Ok so here are the facts!😉 The sensor in the M10R will be used in the M11. The M11 will use the Maestro 3 Processor - Leica Marketing will try its best to convince us that this combo yields even better sensor performance. Image quality wise, the difference between M10R and M11 will be negligible. The M11 body will be ever so slightly different from the M10 body. Perhaps an integrated faux advance lever acting as a thumb rest. Andreas Kaufman mentioned in the Hugh Brownstone interview that Leica sales have been hit very badly due to Covid related store closures - leading to excess inventory than projected for this time in the M10 life cycle. The M10R sensor was introduced early to help reduce excess inventory. The R designation is not the beginning of a new trend. The M 11 will be introduced in the next 12 months. M11P in the next 24 months. What does this all mean for me? I have to wait 2 whole years for my next camera!😒", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4035637"}, {"autor": "bags27", "date": "08/29/2020 03:58  PM", "content": "1 hour ago, jonoslack said: Hi John Erm, well, yes, as someone is putting together a gallery of photos. But maybe Jaap’s suggestion of trying Topaz is the answer! I am quite impressed by the combination. The -----> AI !!!  really does work, pushing noise reduction (Topaz argues for noise reduction first, so that one does not then sharpen the noise) and sharpening to their aesthetic maximums without losing detail or creating overly sharp edges and artifacts. I posted some before and afters here:", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4035768"}, {"autor": "Chaemono", "date": "08/30/2020 10:21  AM", "content": "Actually, allow me to post one here because I just discovered Topaz DeNoise -----> AI !!!  which is amazing. It affords a lot more malleability to the files, it seems. The less compressed JPEGs here can be downloaded: https://www.smugmug.com/gallery/n-F6NRmF/ EDIT - In case anyone wants the DNG, I can provide it. M10-P + APO 50 Summicron as shot--img-- ISO 200 f/2.8 1/2000 sec. Same as above but processed to taste and treated with Topaz DeNoise AI.--img--  Edited August 30, 2020 by Chaemono Offer to provide link to download the DNG", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036194"}, {"autor": "jaapv", "date": "08/30/2020 10:38  AM", "content": "Sharpen -----> AI !!!  is just as good, and has good noise handling properties as well.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036203"}, {"autor": "jonoslack", "date": "08/30/2020 10:42  AM", "content": " 3 minutes ago, jaapv said: Sharpen -----> AI !!!  is just as good, and has good noise handling properties as well. Hi Jaap - are you using both or have you settled for Sharpen AI ? What’s the difference? best", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036204"}, {"autor": "Kwesi", "date": "08/30/2020 10:52  AM", "content": "29 minutes ago, Chaemono said: Actually, allow me to post one here because I just discovered Topaz DeNoise -----> AI !!!  which is amazing. It affords a lot more malleability to the files, it seems. The less compressed JPEGs here can be downloaded: https://www.smugmug.com/gallery/n-F6NRmF/ EDIT - In case anyone wants the DNG, I can provide it. M10-P + APO 50 Summicron as shot--img-- ISO 200 f/2.8 1/2000 sec. Same as above but processed to taste and treated with Topaz DeNoise AI.--img--  Chaemono, the difference is quite striking and the result feels natural and not overdone.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036209"}, {"autor": "Chaemono", "date": "08/30/2020 10:54  AM", "content": "It's an impressive tool. These are the settings in Topaz DeNoise -----> AI !!!  for the picture posted in #145. I just pressed the Auto button. --img-- ", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036210"}, {"autor": "jaapv", "date": "08/30/2020 10:57  AM", "content": "4 minutes ago, Chaemono said: It's an impressive tool. These are the settings in Topaz DeNoise -----> AI !!!  for the picture posted in #145. I just pressed the Auto button. --img--  The presets (left-hand panel, not shown here) give rather good starting points.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036213"}, {"autor": "jonoslack", "date": "08/30/2020 11:25  AM", "content": "30 minutes ago, Chaemono said: It's an impressive tool. These are the settings in Topaz DeNoise -----> AI !!!  for the picture posted in #145. I just pressed the Auto button. Excellent - and thanks to Jaap as well. I’ve just paid the piper (just for Sharpen AI to start with). If it doesn’t work I’ll send you a bill 🤪", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036225"}, {"autor": "Chaemono", "date": "08/30/2020 02:05  PM", "content": "vor 2 Stunden schrieb jonoslack: Excellent - and thanks to Jaap as well. I’ve just paid the piper (just for Sharpen -----> AI !!!  to start with). If it doesn’t work I’ll send you a bill 🤪 When it works, DeNoise AI is amazing. I started another thread on it:", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/?tab=findComment&comment=4036303"}, {"autor": "setuporg", "date": "07/12/2021 06:51  AM", "content": "As a computer scientist, I believe the “superresolution” is a particular form of sharpening through -----> deep learning !!!  algorithms. It uses patterns to enrich the texture. However, the enrichment is only as good as the training data. Eg if you photograph a rare chameleon whose photos were never used in training the algorithms, it would never be able to imagine its tiniest details. In digital domain data is king. If the higher resolution sensor is not adding noise, it’s always better to start with more original data. I had the original M10, skipped the P, but upgraded to R as soon as it came out. I’m seeing a great improvement for my use cases, and having just finished a road trip with both M10R and SL2, I prefer the M shots in every case, even with M APO 50 vs SL2 APO 50. The highlights are much better OOC.", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4236551"}, {"autor": "pedaes", "date": "07/12/2021 01:46  PM", "content": "11 hours ago, derleicaman said: With the new Super Resolution feature Another interesting question is how does it compare to Topaz -----> AI !!!  Sharpen https://www.topazlabs.com/sharpen-ai?utm_source=google&utm_medium=cpc&utm_campaign=brand_search&attribution=true&gclid=Cj0KCQjw0K-HBhDDARIsAFJ6UGhTMNgyBmiWEmluSqt25bmlyEyeL4mg0yUimt0M_joNZIAUlwRZc5saAjDvEALw_wcB", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4236716"}, {"autor": "pedaes", "date": "07/12/2021 02:02  PM", "content": " 11 hours ago, derleicaman said: What do you all think? I think a good decision. 24mp seems to be plenty for general photography upto A3+/A2 prints. The only advantage of more mps for me would be if I wanted to crop heavily, which I very rarely do. I use Topaz -----> AI !!!  sharpen if I want/need to really max the detail, but few images need this. It would be interesting to test a enhanced 24mp M10 image against a R image, but this is impossible to be meaningful at resolution limits here. There will no doubt then be the question of an enhanced R image, but where do you stop with 35mm format. There is a bit of debate on another thread about tripods, although most of us see 35mm as a hand-held format with odd exceptions, which I guess could be about a photographers technique, as even at 24mp with the latest lenses your technique needs to be good to achieve best possible outcomes. Edited July 12 by pedaes", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4236729"}, {"autor": "Nowhereman", "date": "07/12/2021 05:39  PM", "content": "2 hours ago, SrMi said: ...How do you define correctly exposed? I am not arguing what it should mean, but wondering what it means in the context of your post... Essentially that the mid-tones fall on Zone V, if that there is where I want them; and for shots into the light, or with strong sidelight, when I'm exposing for the high-lights, that the main subject is exposed where I want it, after I lift shadows and mid-tones to where I want them. My issue with the M10 is that it's necessary to underexpose too much when exposing for the highlights, compared to many other cameras (the Ricoh GRIII in my case), and that this results from the contrast curve that Leica applied to the M10 DNGs, which allocates too little of the available dynamic range to the highlights. Sorry that I wrote such a long off-topic post above, but it's an issue that I'm interested in and @otto.f's post touched on that. On the topic of this thread itself, I agree with @pedaes's thought that it would be interesting to have a comparison of Lightroom Super Resolution to the Topaz -----> AI !!!  tools; and also agree with @Jeff S's statement that the necessary sensor resolution really depends on what the photographer wants. This has a long history. On the old Leica forums, people would say that, if you wanted print's larger than 11x14 — or even 8x10, though some said 16x20 — you needed to go to medium format film. All this was blown out of the water for me when, around 2006, I saw the Daido Moriyama retrospective at the Gallery of New South West in Sydney, with sixty prints of 100x150 cm printed on an Epson wide-format inkjet printer from 35 mm Twi-X negatives. The prints were dazzling, but clearly this type of high-contrast work requires less resolution than certain types of landscape. On a future M11, I would like to see a sensor something like the one that Leica uses in the SL2S. ________________________Frog Leaping photobook", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4236897"}, {"autor": "pgk", "date": "07/12/2021 05:59  PM", "content": "11 hours ago, setuporg said: As a computer scientist, I believe the “superresolution” is a particular form of sharpening through -----> deep learning !!!  algorithms. It uses patterns to enrich the texture. However, the enrichment is only as good as the training data. Imagine photographing a scene with a newspaper in it, as they did in old movies. Would using superresolution reveal the date on the page if the data isn't in the original image? No, of course not. Its a statistical way of interpreting what missing data and as such cannot produce 'original' data which is missing. Although it may give the impression of more data, its extrapolated data, not 'original' data, which is why a higher resolution sensor, combined with a good lens and good technique, will always provide more 'original' data and a correctly detailed image.", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4236905"}, {"autor": "jaapv", "date": "07/13/2021 12:37  AM", "content": "11 hours ago, pedaes said: Another interesting question is how does it compare to Topaz -----> AI !!!  Sharpen https://www.topazlabs.com/sharpen-ai?utm_source=google&utm_medium=cpc&utm_campaign=brand_search&attribution=true&gclid=Cj0KCQjw0K-HBhDDARIsAFJ6UGhTMNgyBmiWEmluSqt25bmlyEyeL4mg0yUimt0M_joNZIAUlwRZc5saAjDvEALw_wcB I can only say that in general I prefer the results of Sharpen -----> AI !!!  and Denoise -----> AI !!! . to the extent that they have become an essential part of my workflow. They are impressive. I have always maintained that the amount of detail (resolution) is far less important than the acuity of the detail. In other words, the viewer will never know that they are not seeing a detail, but they can darn well see whether the detail that they are seeing is crisp or not. BTW, my results are similar to the examples on Topaz' website. The only drawback is that they are rather slow on any computer but the latest Mac Silicons, which keeps many photographers from using them routinely.", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4237166"}, {"autor": "jaapv", "date": "07/13/2021 01:17  AM", "content": "To add: We have both Denoise -----> AI !!!  and Sharpen -----> AI !!! . Both do a fantastic job of denoising and sharpening, but are meant for different types of images. I just started a thread on the subject in the Digital Postprocessing forum, hoping that other users will chime in.", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4237174"}, {"autor": "Pixeleater", "date": "07/13/2021 09:56  PM", "content": " Jaapv, where in your workflow, do you use Denoise -----> AI !!! ?", "link": "https://www.l-camera-forum.com/topic/322645-does-lr-super-resolution-obviate-the-need-to-upgrade-to-m10-r/?tab=findComment&comment=4237782"}, {"autor": "jaapv", "date": "06/30/2021 10:07  AM", "content": " Topaz Sharpen -----> AI !!!  is even (far) more impressive. Well worth the upgrade. But you need a Silicon Mac tomake it fast.", "link": "https://www.l-camera-forum.com/topic/321947-capture-one-for-m10-r-or-m10-monochrom/?tab=findComment&comment=4228842"}, {"autor": "Steven", "date": "10/31/2020 06:33  PM", "content": "45 minutes ago, Tom1234 said: Brilliant idea. Have your cake and eat it too. I lean in this same direction since the M10's look is so atmospheric and artistic which I want most times. The M10-R a bit too technically correct with too many intimate details it seems. But, I like the M10-R for the Still Life concept but maybe The Gigapixel will give the same? What do you think? I think the program is exceptional but has limitation. It makes photos look High res, and its not gimmicky, but as good as the -----> AI !!!  is, it cannot draw details that the sensor didn't capture. This example with the boat is quite good. The wheels and the person lack details, but the rest is incredibly sharp compared to the old photo. But also, look at the little white square. We are looking at a tiny portion of the frame. You can download that image from the google drive I posted early and you will see that you can easily crop 100% or more like if the photo so 50MP, when it was actually just 12MP. I have been trying on other images, in which I discover new things I could not see on the 12MP before. I found a photo with a guy sleeping on a rooftop, that I could not see just on the 12MP image. So much fun. It's a brilliant piece of software, but it's obviously not as good as owning the higher res camera. Not even mentioning that the M10R offers more than just resolution it seems. I am still looking at the files I downloaded and I am pleasantly surprised so far... --img--  Edited October 31, 2020 by Steven", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/?tab=findComment&comment=4071555"}, {"autor": "Dennis", "date": "11/01/2020 07:01  PM", "content": "In the end, what people like most? 24 or 40meg aesthetics? How is the poll? I didn't read all posts, but it's incredible to see how technology has changed and changed our perception of photography itself. -----> AI !!!  for editing? OMG, please not. I didn't know that something as Gigapixel AI was existing; I thought it was only for movies and not for all mortals. 🤣 I feel nowadays a lot the concept of the paradox of choice. Interesting resume below, go to the link for more. Barry Schwartz believes that having a lot of options isn’t always a good thing. A professor of social theory and social action at Swarthmore College, he argues that instead of producing feelings of abundance, too much choice overwhelms our already-exhausted brains. An abundance of choice, writes Schwartz in his book The Paradox of Choice: Why More Is Less — How the Culture of Abundance Robs Us of Satisfaction (Harper Perennial, 2005), forces us to “invest time, energy, and no small amount of self-doubt, and dread” into each decision, leaving us feeling more constrained than liberated. “Clinging tenaciously to all the choices available to us,” writes Schwartz, “contributes to bad decisions, to anxiety, stress and dissatisfaction — even to clinical depression.” Maximizers Vs. Satisficers There are two types of decision makers, says Schwartz: maximizers and satisficers. The difference between the two is their goal when making a choice. “If you seek and accept only the best, you are a maximizer,” writes Schwartz. “Maximizers need to be assured that every purchase or decision was the best that could be made.” Satisficers, on the other hand, will choose “something that is good enough and not worry about the possibility that there might be something better.” The key to experiencing more satisfaction and abundance, according to Schwartz, is to be a satisficer. “How can anyone truly know that any given option is absolutely the best possible?” ponders Schwartz. “As a decision strategy, maximizing creates a daunting task, which becomes all the more daunting as the number of options increases.” The goal of maximizing, he asserts, “can make people miserable — especially in a world that insists on providing an overwhelming number of choices, both trivial and not so trivial. ”Being a satisficer doesn’t mean you have to sacrifice your standards, however. A satisficer maintains rigorous decision-making criteria, but she is aware that nothing can ever be perfect. “She searches until she finds an item that meets those standards, and at that point, she stops,” writes Schwartz. She is not resigned or settling, he emphasizes; she is “content with the merely excellent as opposed to the absolute best.” Are you a Maximizer or a Satisficer? The paradox of choice, the camera specs comparison, digital world VS , etc. It takes us, step by step, away from the truth. Of course, since dark rooms first step, PP has always existed: to give life to the next stage of the process after the exposure, right? The personal interpretation was and still is essential. And it helps to reach the photographer's goal, his/her vision, and unique signature style. But this doesn't have to distract us from our original purpose: create stunning work in camera, just with an idea: film, or BSI CMOS whatever... I think there is not more exciting emotion that reaches a great photo in camera, despite the MP# ... w/o AI ... And of course with 24 or 40meg. Who cares? But again, \"In the end, what people like most? 24 or 40meg? How is the poll?? 😂 Good vibes 🙏 Edited November 1, 2020 by Dennis", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/?tab=findComment&comment=4072290"}, {"autor": "farnz", "date": "03/20/2021 12:31  PM", "content": "10 hours ago, jkcampbell2 said: Here's an interesting video comparing Adobe's Super Res to other res enlargement services. Cheers, jc Very interesting so thanks for posting. When I first came across Adobe's Super Res function I suspected that there might be some smoke and mirrors involved and perhaps -----> AI !!!  interpolation underneath and it looks likely but others have used better algorithms and produced superior results. Worth watching if Super Res is of interest. Pete.", "link": "https://www.l-camera-forum.com/topic/318866-living-with-obsolete-hardware/?tab=findComment&comment=4164507"}, {"autor": "jaapv", "date": "03/21/2021 01:25  AM", "content": "12 hours ago, farnz said: Very interesting so thanks for posting. When I first came across Adobe's Super Res function I suspected that there might be some smoke and mirrors involved and perhaps -----> AI !!!  interpolation underneath and it looks likely but others have used better algorithms and produced superior results. Worth watching if Super Res is of interest. Pete. At any rate the name Super Res is quite misleading. From Adobe's own information: Quote The resolution of the enhanced image stays the same as the original image. It is just a sharpening algorithm on steroids.", "link": "https://www.l-camera-forum.com/topic/318866-living-with-obsolete-hardware/?tab=findComment&comment=4164934"}, {"autor": "jaapv", "date": "03/21/2021 10:08  PM", "content": "I know that you know the difference between an uprezzed and sharpened file and a natively high resolution one as well as I do. I am sure that Adobe applied advanced -----> AI !!!  technology and produced superior algorithms, but even they cannot add detail that is not there. Suggesting that one turns a 20 MP camera into a 50 MP one is marketing speak.", "link": "https://www.l-camera-forum.com/topic/318866-living-with-obsolete-hardware/?tab=findComment&comment=4165536"}, {"autor": "UliWer", "date": "03/21/2021 10:57  PM", "content": "vor 14 Minuten schrieb jaapv: but even they cannot add detail that is not there Though they pretend to do this: to twist curls on a bald head. Going back to the initial question about \"obsolete\" hardware, there is no \"new territory\" of \"multi MP\" hardware. If something is not well resolved with 24MP it won't be better resolved with 40+MP. I use the M10 as well as the M10 Monochrom - the latter with \"real\" 40+ MP, while the efficiency of 24 MP for the M10 is diminished by the necessities of the Bayern pattern. When the M10 Monochrom was new I tried very hard to \"test\" how to see the \"better resolution\" of the 40+ sensor: nope, it does not exist, 40+ MP without Bayern pattern cannot twist curls on a bald head. What is blurred with the M10 stays blurred with the Monochrom. If the lens is bad and does not resolve properly in the corners the M10 Monochrom will not cheat you and give you better results. I have never found any detail on the results from the Monochrom which was not there on the results from the M10 (with the files in greyscale). Yes, you may have more headroom for enlargement, especially if you crop. The limits for enlargement of a file with less MP compared to one with more are not set by \"resolution\" but by artifacts. What does \"Super Res\" do: adding more artifacts. Supplanting the obvious ones by covered up artifacts. To go beyond the technical limits of your present hardware, you perhaps need better glass, but much more important: less shaking, better focussing and in many cases more depth of focus - the basic techniques of photography. Magical thinking of \"-----> AI !!! \" will not stretch the limits of mere physics. When \"Super Res\" becomes available for LR, i'll try again where to find the new territories.", "link": "https://www.l-camera-forum.com/topic/318866-living-with-obsolete-hardware/?tab=findComment&comment=4165571"}, {"autor": "hdmesa", "date": "03/22/2021 09:41  PM", "content": " 22 hours ago, UliWer said: Though they pretend to do this: to twist curls on a bald head. Going back to the initial question about \"obsolete\" hardware, there is no \"new territory\" of \"multi MP\" hardware. If something is not well resolved with 24MP it won't be better resolved with 40+MP. I use the M10 as well as the M10 Monochrom - the latter with \"real\" 40+ MP, while the efficiency of 24 MP for the M10 is diminished by the necessities of the Bayern pattern. When the M10 Monochrom was new I tried very hard to \"test\" how to see the \"better resolution\" of the 40+ sensor: nope, it does not exist, 40+ MP without Bayern pattern cannot twist curls on a bald head. What is blurred with the M10 stays blurred with the Monochrom. If the lens is bad and does not resolve properly in the corners the M10 Monochrom will not cheat you and give you better results. I have never found any detail on the results from the Monochrom which was not there on the results from the M10 (with the files in greyscale). Yes, you may have more headroom for enlargement, especially if you crop. The limits for enlargement of a file with less MP compared to one with more are not set by \"resolution\" but by artifacts. What does \"Super Res\" do: adding more artifacts. Supplanting the obvious ones by covered up artifacts. To go beyond the technical limits of your present hardware, you perhaps need better glass, but much more important: less shaking, better focussing and in many cases more depth of focus - the basic techniques of photography. Magical thinking of \"-----> AI !!! \" will not stretch the limits of mere physics. When \"Super Res\" becomes available for LR, i'll try again where to find the new territories. A bad photo is a bad photo on all sensors, true. I can't speak to the M10M as I've never used one, but the Q2M is mind-blowing. It absolutely resolves more detail than a color sensor – ~30% acuity increase from removing the Bayer color filter array. Anecdotal cases of users \"not seeing it\" does not change that fact. The results from the Q2M are equal to or better than b&w conversions from my GFX 50R with the GF 30 lens. But to your point, a better sensor cannot compensate for some things: the Q2M files are still a little soft in the far corners since the Q Summilux requires a tremendous amount of software distortion correction. No increase in sensor technology is going to fix that.", "link": "https://www.l-camera-forum.com/topic/318866-living-with-obsolete-hardware/?tab=findComment&comment=4166153"}, {"autor": "bilbrown", "date": "02/01/2021 02:18  AM", "content": " I think the computational imaging aspect is the most interesting, with this starting to enter the M models I think this could really give us a lot in the next 13 months or so. Algorithms to add to existing photos, advanced HDR, -----> machine learning !!!  to understand your preferred style and suggest aspects (as long as it can be turned off) is all kind of exciting. No, this isn't likely the M category of imaging... but I think with some slight additions it could really augment. On 1/29/2021 at 1:42 AM, LUF Admin said: Using computational imaging to correct perspective distortion", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/?tab=findComment&comment=4130481"}, {"autor": "Gelatino", "date": "02/08/2021 08:30  AM", "content": "I too own some Nikkor -----> Ai !!!  that still are in excellent condition (and some more recent ) and tested them on the M10 with an adaptator (K&F concept 22Euro ) that does the job even if not as qualitative as the Novoflex. As there is no link between the lens and the body live view is recommended to control focussing ; Nikkors being larger than the Ms they reduce RF vision... more than a bit. IMHO up to 135 mm the results are not bad, and the combo M/ Nikkor is rather balanced hand held. Beyond 135mm I think the tripod is mandatory to prevent shake. I tried the PC f/4 28mm and find it quite good, but post process can achieve faster the same results except the tremendous pleasure to use such a nicely manufactured object.", "link": "https://www.l-camera-forum.com/topic/317776-leica-m10-lens-adapter-for-nikon-glass/?tab=findComment&comment=4136130"}, {"autor": "Luke_Miller", "date": "02/09/2021 02:54  PM", "content": "The Nikon 50mm f1.2 was regarded well enough that it remained in production until last year IIRC. It was my favorite MF 50 until I got the Noct-Nikkor 58mm. The sites I trust for lens reviews tend to give both the -----> Ai !!!  and -----> Ai !!! -S versions high marks. Here is one review: Nikon 50mm f/1.2 Ai-S Review (photographylife.com) You might like it. Now the 55mm f1.2 is another story. It is not highly regarded and is a non-Ai lens, so it might not fit the mount adapter.", "link": "https://www.l-camera-forum.com/topic/317776-leica-m10-lens-adapter-for-nikon-glass/?tab=findComment&comment=4137029"}, {"autor": "IMAGEPOWER", "date": "02/11/2021 06:22  PM", "content": "Am 8.2.2021 um 05:02 schrieb MikeMyers: Considering that I have drawers full of Nikon \"F-mount\" lenses, and that I might want to use some of them on my M10. Supposedly the best adapter available is the Novaflex. I've also got a Nikon 50mm f/1.2 lens, but I think I read it doesn't work with this adapter for some reason. Probably not a big loss, as Ken Rockwell though it was a terrible lens. Any thoughts or advice? I know it's expensive, but last time I was searching, people told me it's \"the best\". I do work with both a Novoflex and a FotodioX adapter on a M10-R, M10-M and M10-P \"Reporter\" As for the Novoflex adapter, it is very precise, but also pretty \"stiff\". There seems to be absolutely no play between the Nikkor lens and the adapter. This is supposed to make sure that focusing remains very precise, especially with wide open glass such as the Nikkor -----> Ai !!! -S 50/1.2. Focusing on a RF can be utmost critical as we all know. The drawback: sometimes it es very difficult to dismount the lens from the adapter. On the other side, I can also use Nikon G lenses such as the 58/1.4G with that adapter on my M10 body, a lens that is unrivalled for its transition into soft background (\"bokeh\") I also use a FotodioX adapter, mainly for my Carl Zeiss lenses ZF.2 15/2.8 and ZF.2 135/2 (normally used on my Nikon D850). Here it is easy to mount and dismount the lens, but the link/connection is not as stiff as with the Novoflex and I am not sure, whether in critical focus situations (mainly the 135/2 wide open) I get maximum focus accuracy. For G lenses you will have to use an different FotodioX adapter. As for Ken Rockwell's opinion about lenses, I am very careful to say at least. He keeps writing his \"reviews\" long before the lenses are available. As a pro Nikon shooter I usually get the newest lens first before anyone else has a chance to get hold of it. And Ken writes \"tests\" even when lenses are officially delayed... I do love the Nikon Ai-S 50/1.2 for its nice bokeh wide open. Actually it has an equally convincing \"analog\" look as the recently re-introduced Leica Noctilux 1.2/50mm. From f/2 onwards, the Nikkor is one of the sharpest Nikon lenses ( I own 20+ AF-S lenses and 5 Ai-S lenses, and comparing the Ai-S 50/1.2 to lenses like the PC 85/2.8, AF-S 105/1.4, AF-S 28/1.4 and the latest AF-S 120-300/2.8 amongst others drew me to that conclusion.) That's why I enjoy using this lens on the Nikon D850 or Df and on the M10-X, especially wide open, for the film look. I also love the Canon FD 1.2/55 S.S.C. Aspherical on the M10, but this is really a chunky piece of glass... FYI I own original M lenses such as the SEM 21, the FLE 35/1.4, the APO 75/2 and just recently added the 28/1.4, so I can compare my Nikon gear to Leica gear. Apart from the 50/1.2 I use Carl Zeiss lenses on the adaptors, mainly 15/2.8, 25/2 and 135/2. Hope, this was of any help to make your decision. Michael http://www.imagepower.de The photos display the M10-R with the Nikkor 1.2/50mm and the Nikon Df --img--  --img--  Edited February 11 by IMAGEPOWER typo", "link": "https://www.l-camera-forum.com/topic/317776-leica-m10-lens-adapter-for-nikon-glass/?tab=findComment&comment=4138703"}, {"autor": "jaapv", "date": "02/13/2021 11:25  PM", "content": "What about using the camera that you have and not giving in to the monkey trait of reaching for the next shiny fruit before the present one is half-nibbled? I know that we all carry that gene, but still, all cameras you mention are pretty darn good at ISO speeds that film users could only dream of. A copy of Topaz deNoise -----> AI !!!  is several magnitudes cheaper and quite a bit more effective than the half-stops you are gaining with all these switches.", "link": "https://www.l-camera-forum.com/topic/317675-caught-between-a-rock-m-and-a-hard-place-sl2/?tab=findComment&comment=4140359"}, {"autor": "augustwest100", "date": "02/14/2021 03:23  AM", "content": "3 hours ago, jaapv said: What about using the camera that you have and not giving in to the monkey trait of reaching for the next shiny fruit before the present one is half-nibbled? I know that we all carry that gene, but still, all cameras you mention are pretty darn good at ISO speeds that film users could only dream of. A copy of Topaz deNoise -----> AI !!!  is several magnitudes cheaper and quite a bit more effective than the half-stops you are gaining with all these switches. This question is, of course, lurking around every corner for me! In the struggle to answer it, I did find some clues as to what I should do now. Let me share some of it with you because I do appreciate the comment more than you realize. My journey in photography started when I was around 7 years old. I picked up this huge accordion style Polaroid camera and was hooked ever since. My dad used to let me carry it around for him until one day it was just understood that it was no longer his I then discovered 35mm through Minolta and Nikon and spent many hours in the high school darkroom. I never once gave any thought to the model of the camera or its features. For probably 10 years I owned a Nikon N90s and the only thing I ever changed were the batteries! When the Nikon D100 came out, I grabbed it and although it was APS-C and I preferred full frame, I enjoyed it for many many years. I was looking into buying a Nikon D700, when I went down the rabbit hole completely. I was intrigued by the Leica M8, but finally came across a used M9. I was instantly having visions of a smaller camera system. I can still remember the feeling of a backpack full of gear while traveling through Europe. Since we are on a Leica forum, I can sum up this phase of life like this, and you can fill in the blanks: MP film, M9, M240, with and without Visoflex, Q, M10. The pros of this saga: the exquisite design of Leica cameras, the care put into the details and simplicity of use. The connection back to the “manual” days. The cons: due to the high cost of this equipment, there was more pressure to make those purchases “matter.” What worked for me was the connection to the Leica camera. It was never perfect. I missed as many shots as I hit. I liked looking through the glass and seeing the real world. I liked “previsualizing” what a shot would look like, and then comparing it when I took the shot. I liked the manual aperture and shutter controls and the film speed dial. For the first time in literally decades, I was thinking in photographic terms again. Looking at a street and saying “that’s about ISO 800, at 1/60 of a second, at f8.” My experience with the Leica M was incredible. It improved my photography skills immeasurably. That is really what still draws me to the M system - it is a continual masterclass in slowing down. Sometimes it causes me stress, and sometimes it is liberating. One thing I can tell you: my Sony A9 does nothing for me like this. I don’t love the EVF experience and I don’t like the dials and buttons and menus. I am drawn to the simplicity and elegance of Leica, and the way the cameras inspire me to go out and shoot. You are 100% right about one thing though. The cameras today are all so good. As long as it can shoot at ISO 1600 that is already more than enough for me. As I posted before, I’m stuck between the M and the SL2. My worry with the SL2 is that it is just a really really good version of the Sony A9. Maybe your post leads me closer to the realization that I am M bound. I think back to my M9. I didn’t sell it because I hated it, I sold it because I loved it! I figured the next version would be even better. Since I still drive my car from 1997, I do want to tell everyone that it is better to keep something long enough to render it technologically obsolete. Then the pressure is off!", "link": "https://www.l-camera-forum.com/topic/317675-caught-between-a-rock-m-and-a-hard-place-sl2/?tab=findComment&comment=4140430"}, {"autor": "petermullett", "date": "04/23/2019 05:49  PM", "content": "On 4/12/2019 at 6:52 PM, petermullett said: .......... but in the many decades that I've owned all sorts of gear, many cameras, I've yet to find one that's \"perfect\".﻿.....and probably never will so I just get on with what works for me and with the M10-D that's more than enough to float my boat.﻿ Since posting this the other week I've been thinking whether there were any cameras that have come close to perfect for me, and yes perhaps there was......sorry not a Leica M, close, but no cigar, at least not yet. However the late 60's into the 70's gave us the Nikon Ftn's, these cameras were to my mind, and for my usage at the time, close to perfect with only the rather flakey metering in the finder prism being the weakest thing, but then you always metered off-camera with the in-camera metering being a back-up for meters lost, forgotten / left back at home base. The cameras were pretty much indestructible, the finder was/is still great and the -----> Ai !!!  lenses the time were really quite exceptional. I still own two of the Ftn's that I used back then, never been serviced, used extensively, professionally, world wide for magazine and advertising work, location and studio, the two still with me are slightly battered but still perfectly functional, ( except of course for the meter )! My M's from back then, primarily M3's, were great, no question....but not as reliable and unbreakable as the Ftn's. So.........", "link": "https://www.l-camera-forum.com/topic/295873-m10-d-owners-are-you-happy/?tab=findComment&comment=3728008"}, {"autor": "jaapv", "date": "12/29/2020 08:20  PM", "content": "43 minutes ago, LBJ2 said: Just curious, do you get EXIF data and in-camera lens correction when adapting M lenses to Leica SL cameras? Also are you able to use SLx camera IBIS with M Lenses. If so, is there some way to select lens FL in the SL IBIS menu to accommodate for adapting M lenses? Yes to EXIF (except aperture) and lens correction - the adapter has a 6-bit reader. In IBIS I don't know, but the lenses can be entered manually. However, there is another argument against an EVF M camera - the market is too small. As the camera would have to be an entirely new development (as opposed to Monochroms, MD cameras etc.) the R&D would impact the price immensely, limiting the customer base even more. It may be attractive to (ageing) M users who already own a cupboard full of M lenses, but nobody outside the Leica family is going to buy a functionally impaired EVF camera when a body+lens will be in the 15.000 Euro range. An -----> ML !!! -EVF would be be more attractive - at least it could offer full functionality, and would not entail more than shrinking the SL series and rebodying it.", "link": "https://www.l-camera-forum.com/topic/316517-year-2021-and-later-predictions/?tab=findComment&comment=4108244"}, {"autor": "FlashGordonPhotography", "date": "12/29/2020 08:35  PM", "content": "9 minutes ago, jaapv said: Yes to EXIF (except aperture) and lens correction - the adapter has a 6-bit reader. In IBIS I don't know, but the lenses can be entered manually. However, there is another argument against an EVF M camera - the market is too small. As the camera would have to be an entirely new development (as opposed to Monochroms, MD cameras etc.) the R&D would impact the price immensely, limiting the customer base even more. It may be attractive to (ageing) M users who already own a cupboard full of M lenses, but nobody outside the Leica family is going to buy a functionally impaired EVF camera when a body+lens will be in the 15.000 Euro range. An -----> ML !!! -EVF would be be more attractive - at least it could offer full functionality, and would not entail more than shrinking the SL series and rebodying it. I would suggest that the market is much larger than a monochrom camera. Plus the tech is mostly already there. It's an SL and CL baby. The real issue will be battery consumption/heat. To get a battery big enough they'll need at least a type 240 body size. Bigger with IBIS. Heat will be an issue because it'll shoot video (may as well with an EVF). I just think the body size will approach the Sony A7C and Leica M shooters won't buy a camera that big. May as well get an SL. Gordon", "link": "https://www.l-camera-forum.com/topic/316517-year-2021-and-later-predictions/?tab=findComment&comment=4108264"}, {"autor": "LBJ2", "date": "12/29/2020 08:48  PM", "content": "24 minutes ago, jaapv said: Yes to EXIF (except aperture) and lens correction - the adapter has a 6-bit reader. In IBIS I don't know, but the lenses can be entered manually. However, there is another argument against an EVF M camera - the market is too small. As the camera would have to be an entirely new development (as opposed to Monochroms, MD cameras etc.) the R&D would impact the price immensely, limiting the customer base even more. It may be attractive to (ageing) M users who already own a cupboard full of M lenses, but nobody outside the Leica family is going to buy a functionally impaired EVF camera when a body+lens will be in the 15.000 Euro range. An -----> ML !!! -EVF would be be more attractive - at least it could offer full functionality, and would not entail more than shrinking the SL series and rebodying it. Some good points worth considering. We know from recent interviews with Leica, the M EVF request has been heard all the way to the top. But like you wrote the challenges may out-way the ROI.", "link": "https://www.l-camera-forum.com/topic/316517-year-2021-and-later-predictions/?tab=findComment&comment=4108285"}, {"autor": "otto.f", "date": "12/30/2020 08:50  PM", "content": "The M6 was produced between 1984 and 2002. No need to upgrade until the TTL, which was not before 1998 I think. In the meantime there was a crowd moving around SLR’s with autofocus, eye-directed focus, multi-point metering, etc. A sort of early -----> AI !!!  movement motivated to enable photography that goes beyond the human abilities to make images. Nobody at that time was thinking about turning the M6 into an AI camera, whci should deliver at least TTL view. For me, the M10 is a fully developed digital M6. And it should remain that way. The only thing for me is the Bayer filter procedure to produce color photography through the ‘golden’ standard of CMOS. That can be done better, not higher ISO’s or more resolution. Leave the M10 and its variations as an ergonomic unity alone, the man-machine relation is perfect there. A different sensor technology would be a nice perspective though. Before such a new technology would arise, an M11 is of no need.", "link": "https://www.l-camera-forum.com/topic/316517-year-2021-and-later-predictions/?tab=findComment&comment=4109057"}, {"autor": "Dennis", "date": "12/18/2020 01:57  AM", "content": " M10 + Ricoh Gr III = Killer combination! I had the Gr first version, and I loved it. Both Jpegs and DNG are gorgeous. 7 hours ago, Nowhereman said: So, my three desiderata for the M10 successor are that it have (1) a 24 MP sensor, (2) good JPG modes, and (3) IBIS — although the latter may be unlikely. IBIS would be a grateful feature for sure, but I doubt it's possible. An M camera would be bigger with this technology implement, I guess. There is no more space. And second, besides it's a great and helpful feature on many cameras, I feel that it goes against Rangefinder essence. I don't need help 😂 All mechanic, all natural, all raw. It feels better. It's another game if Leica makes a fusion between the M and the SL system.. So I camera like the Fujix100v ... Rangefinder look, small size, IBIS, flip screen and ....... EVF ..... Ladies and Gentlemen, I may present you, the brand new Leica Portugal -----> ML !!!  11... What about that? 🤔 ... 🤦‍♂️ By the way, if I were you, I would print your photos on 60\"x40\" ... Specially the second one (tree) 👏👏👏", "link": "https://www.l-camera-forum.com/topic/316172-future-implications-for-m10m10-r-of-the-sl2sl2-s-paradigm/?tab=findComment&comment=4100869"}, {"autor": "blueskyoveraquatic", "date": "05/15/2018 03:56  AM", "content": "Taken by Nikon 105mm f/2.5 -----> AI !!!  --img-- L1006911 by Bluesky Overaquatic, on Flickr", "link": "https://www.l-camera-forum.com/topic/259713-m-d-m-p-m240-and-m262-photos-post-them-here/?tab=findComment&comment=3518865"}, {"autor": "dante", "date": "04/29/2021 03:14  PM", "content": "On 4/24/2021 at 8:41 PM, jaapv said: Super resolution enhances detail that is present in the raw data (which, given some fancy Photoshop techniques as described by Dan Margulis could be done without this automation) making the image appear more detailed. However, what it cannot do is render the extra fine detail that is produced by high-resolution sensors, as it is simply not there in the file. So no, it cannot replace a high-resolution sensor. And it can use a 40 MP file and give it the same boost again. No doubt that you capture tinier things with a higher-res sensor, given the same lens (assuming the lens resolves them... which is not a given with a lot of older glass, especially focused by old eyes). I think high MP sensors help sell expensive lenses (which have no point unless you can blackboard a big system resolution) and facilitate steep crops. Those sensor also help preserve a sufficient data volume with more severe forms of post-processing perspective correction. But the world has largely settled around 24mp mirrorless cameras, which suggests that statistically, that's acceptable for most uses. We're coming onto the eighth or ninth year for the Sony A7 line where the main camera still 24.2mp and includes models as late as July 2020 with 12.1mp(!) sensors. And certainly, a massive uptick in responsiveness or reliability in a camera can make an incidental upgrade compelling. For example, the M8/M9 architecture got to an 18mp resolution, but from the M240 on, the user experience improved considerably. More data was just a plus. My questions about obviation have more to do with having sufficient resolution for any size output than they are about catching the tiniest cheek fuzz of a 21-year-old woman in a head shot. I'm not sure that the smallest meaningful aesthetic level of detail has really moved off the \"texture of concrete\" or a \"non-aliased eyelash.\" Even in landscapes, I'm not sure that any picture has been made or broken by being able to resolve a telephone wire at 1000m vs 2000m. If there is an identifiable subject in a picture, it's hard to point to one that is defined primarily (or even appreciably) by the smallest thing a sensor or film grain can see. There is an \"ooh and ah\" factor to the microscopic, but that's for discussion sites. In prints, the only place you are not discarding most of the data for an output, the real mark a camera needs to hit is to create enough data about sufficient levels of detail aesthetically and enlarge for a normal viewing distance without adding blur or artifacts. Ansel Adams believed that this might take as few as 1 megapixels, which is obviously low, but the point remains that the bigger the print, the greater the normal viewing distance. This is the theory upon which depth of field relies - circles of confusion. By the numbers, you need 120dpi at a 1.5m viewing distance. From an M9, that's a 43.3\" (110cm) print, which is frankly enormous. Obviously with the M240/M10 you get a 50\"/127cm output at that resolution. My testing of Super Resolution was prompted by a project where I was making large prints (18\"/46cm short side) for a client from 24mp M files and wondered what the resulting image files (300dpi) would look like in an unrealistic 100% view on screen. If they don't show artifacts at that size, unrealistic as it is, there is zero real-world chance that anyone would detect issues in the finished prints, no matter how close they got to them. And when the prints from this experiment came back yesterday, they stood up to the 40cm scrutiny test (that's about the expectation for an adult's eye to even focus). So no pixels, no artifacts on a close-up look in person, on a print. The ultimate installation location for these would not allow a human to approach closer than 1.5m, so rescaling was always overkill anyway. I did read Margulis' article on unsharp masking and Super Resolution. I know what he wrote, but if his illustrations are indicative, his conclusions seem to assume a much higher tolerance for halos on high contrast edges. I didn't see the results as exactly equal, and the point of the -----> machine learning !!!  is to cut down on that. Super Resolution does have some limitations with the Monochrom (you can occasionally see something weird, though you would need 200% magnification on screen to see it). Dante", "link": "https://www.l-camera-forum.com/topic/320265-does-adobes-super-resolution-in-acr-obviate-the-m10-r-and-m10-mono-line/?tab=findComment&comment=4190845"}, {"autor": "jto555", "date": "09/14/2020 03:09  PM", "content": "To the OP. Who are you printing the prints for? Most non-photographic people looking at prints made with an M240 and a M10-R would not see the difference unless it was pointed out to them. Content and processing are more important in my opinion. If you need more sharpness, an idea to try is a Photoshop plugin like Topaz Sharpen -----> AI !!! . It makes the print feel like it has more detail. In saying that the M10-R is a better camera with more Dynamic Range, better ISO, as well as more pixels. Plus it has a quieter shutter. If I was in the marker for a new M camera that is what I would get but for the present the M240 is still a great camera for me.", "link": "https://www.l-camera-forum.com/topic/313204-m240-to-the-new-m10-r-is-it-really-worth-the-upgrade/?tab=findComment&comment=4045767"}, {"autor": "martinot", "date": "09/15/2020 09:33  AM", "content": "18 hours ago, jto555 said: To the OP. Who are you printing the prints for? Most non-photographic people looking at prints made with an M240 and a M10-R would not see the difference unless it was pointed out to them. Content and processing are more important in my opinion. If you need more sharpness, an idea to try is a Photoshop plugin like Topaz Sharpen -----> AI !!! . It makes the print feel like it has more detail. In saying that the M10-R is a better camera with more Dynamic Range, better ISO, as well as more pixels. Plus it has a quieter shutter. If I was in the marker for a new M camera that is what I would get but for the present the M240 is still a great camera for me. Yes, I think the choice on buying new M systems today is (at least as I personally see it) basically just down to two cameras for most users to really consider; either the M240 for a limited/reasonable budget, or the M10-R for a much less limited budget. The improved shutter on the M-P 240 and my M-E 240 is quite quiet I think, but l do appreciate the higher ISO and DR capability I see in the photos from the M10-R. Leica made very good improvements already with the M10 sensor, but the new one in the M10-R seems to be a really great sensor. Just wish Leica also had upgraded the CPU and memory at the same time to better match and cope with the increased resolution (the camera electronics seems to slow down considerably with the increased amount of data that has to be processed from the M10-R sensor). Edited September 15, 2020 by martinot", "link": "https://www.l-camera-forum.com/topic/313204-m240-to-the-new-m10-r-is-it-really-worth-the-upgrade/?tab=findComment&comment=4046217"}, {"autor": "tobey bilek", "date": "11/01/2015 08:27  AM", "content": "Buy Nikon body. If the lenses you have are -----> Ai !!!  or later, any nikon body will work. If not, you need to have them converted or buy the Df camera which will accept all the old lenses without damage.", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2918322"}, {"autor": "keithlaban.co.uk", "date": "11/01/2015 02:09  PM", "content": "I sold my Nikon film cameras many years ago but a little voice told me to hang on to my Nikon Micro-NIKKOR 55mm f/2.8 -----> AI !!! -s. I now use it via an inexpensive adapter on my M240 for close and copy work. Great lens, so glad I listened.", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2918478"}, {"autor": "Deliberate1", "date": "11/01/2015 03:56  PM", "content": "I sold my Nikon film cameras many years ago but a little voice told me to hang on to my Nikon Micro-NIKKOR 55mm f/2.8 -----> AI !!! -s. I now use it via an inexpensive adapter on my M240 for close and copy work. Great lens, so glad I listened. Keith, thanks for yours. Do you use the optical view or LV/EVF for focus with the adapted Nikon lens?", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2918583"}, {"autor": "bocaburger", "date": "11/02/2015 01:09  AM", "content": "I sold my Nikon film cameras many years ago but a little voice told me to hang on to my Nikon Micro-NIKKOR 55mm f/2.8 -----> AI !!! -s. I almost forgot, I also have a 55/3.5 Micro-Nikkor I use a lot with Canon and M240. Mine is a Nippon Kogaku factory-converted to AI back when I was shooting Photomic FTn's.", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2918895"}, {"autor": "ramarren", "date": "11/02/2015 03:16  AM", "content": "I have a nice brace of older Nikon SLR lenses, including both Micro-Nikkor 55/3.5, 105/2.8, and use a Rayqual F->M adapter with the M-P. It works very well when I want something beyond the M-mount lenses I own, like the Nikkor 28/2 -----> AI !!!  and 180/2.8 AF-D. The only one of my lenses that has a minor problem is the Nikkor 18mm f/3.5 AI-S, which exhibits a small amount of hard corner vignetting—shrouding from the adapter through the smaller diameter M lens mount. For or your G lenses you'll need a Novoflex adapter for the auxiliary aperture ring. I don't use them very often on the M, but they work very well when desired.", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2918926"}, {"autor": "ramarren", "date": "11/03/2015 06:43  AM", "content": "Nice photos ....point well taken ....I hate the Nikon body but I figured the Nikon glass will cause more trouble than its worth in terms of sharpness/calibration and color. I guess I should be in the market for an adapter and give my Nikon lenses a try? Anybody else have photos to shair of DSLR lenses on the M240? I've got a few posted. This is one of my favorites, taken with the Micro-Nikkor 105/2.8 -----> AI !!! -S. The size of that clover flower is about 4mm across or so. --img--  Edited November 3, 2015 by ramarren", "link": "https://www.l-camera-forum.com/topic/252390-nikon-glass-on-m240/?tab=findComment&comment=2919737"}, {"autor": "jaapv", "date": "12/29/2010 03:37  PM", "content": "Question:I have heard conflicting stories on high-ISO performance of the M. But I have seen beautiful results as well, even at ISO 2500. How do I get the best quality images at high-ISO? Answer: There is a vital difference between the M9 and all other high-end digital cameras. The M9 has virtually no in-camera noise reduction at high ISO, resulting in more detail, but also more visible noise. To avoid this noise, there are two steps to be taken, but first consider the type of photograph: Low contrast diffuse light or high contrast with specular highlights. The first trick is to gather as many photons on the sensor as possible to improve Signal to Noise Ratio (SNR) without overexposing. That means: use the histogram. And go manual. It is easiest with the flat image - just bunch the peak up to the right and flatten the lefthand side of the histogram. The high contrast image will need clipping of the specular highlights. So move them off the righthand side of the histogram, and you will see the signal coming up on all other light levels. There is your optimum SNR which you must try to preserve whilst taking photographs by manually adjusting the exposure to the amount of real light, i.e. disregarding the bright spotlights that are trying to fool you into underexposing. This presupposes that you are on manual and are spending some time “ shooting the histogram in” before starting to shoot in earnest. Note that at ISOs below about 1250 you have enough SNR leeway to start trying to preserve highlights - a whole different game than avoiding noise! Now we come to the second step: the capture sharpening and noise reduction in Adobe Camera raw 6 and Lightroom 3. I will describe the procedure for ACR 6.0, Lightroom users will be able to translate this easily, as it is basically the same. First make sure the program is set to Process Version 2010. You will find the setting under the Camera Calibration menu. If an exclamation mark appears on the lower righthand side of your preview it means you have an image that has been processed in Version 2003. Click the exclamation mark to reset the Process Version. With the image open (make sure your output parameters are set to 16 bits!) adjust the color balance and exposure to taste, and switch to the detail panel and hit alt-option(command)-0 to go to 100% view. We will use the sliders from top to bottom( more or less), bearing in mind that ACR is non-destructive and, with a subsequent adjustment made it is wise to got back to the previous steps for finetuning. It takes some experience to “ play” all settings to their optimum. Sharpening slider. Set for the optimum detail separation (normally between about 10 and 40), never mind that you seem to increase the noise, in conjunction with the next Radius slider Use the range of 0.5 to 1.5, never more. 0.5 is for high-frequency detail images like wooded landscapes, 1.5 for low-frequency detail images like glamour portraits. Once set, bearing in mind that visible halos and artefacts introduced here will get you in trouble later, skip the next Detail slider for the time being. And go to the Masking Slider. Then drag it with the alt key held down and you will see an edge mask being created on the fly. This will only be visible with the image at 100% or larger. It shows ( in white) what areas are being sharpened and (in black) which ones are being protected. So drag it until only the edges you want sharpened are showing. Never mind the small detail. For that you have the Detail slider. Alt-drag that one until you have your fine detail back without enhancing too much noise. Now go to the noise-reduction group. First go to Color. Normally the default setting of 25 will be fine to suppress the color noise completely, but by all means play with the slider to find the optimum setting. If you get some color bleeding on color edges you can move the Color Detail slider from its default of 50, but be careful not to go too far left as it will make the image digitally smooth. ( the same for the Luminance Detail slider) Normally you won’t be using those two. The most important slider of the group is the Luminance slider Pull it right to see the noise disappear. When you are happy, go back to the sharpening group and tweak if needed, back to luminance, etc. (*) And you are done, go back to the adjustments panel. Now if you have a mixed frequency image, you can correct by using the adjustment brush and tweak the sharpening, both to more sharp ( for instance the eyes in a portrait) or softer ( for instance the skin of somebody in a landscape) (**). Then go on and open the image. Now this is a long instruction manual, but with a bit of practice it gets really quick and easy, and you can of course make a few presets for image types you commonly shoot. (*)This is a most interesting slider. At a setting between 0 and 10 it will act as an extra sharpening slider for low-noise images, as it seems to add a bit of fine random structure, which enhances the impression of sharpness (**) Of course, for the more Photoshop-minded the elegant way to do this is to optimize for one frequency, open as a Smart Object, copy and redo for the other frequency, create a layer mask in PS and paint in the effect, but on the whole I find that a bit of overkill for routine use. Edit 2019: Nowadays there excellent noisereduction programs, also as PS Plugins. Industry-leading are Topaz DeNoise and Topaz Sharpen -----> AI !!! . The last program requires a rather powerfiul computer.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/?tab=findComment&comment=2464083"}, {"autor": "jaapv", "date": "12/13/2019 12:32  PM", "content": "Expose a bit more liberally and the problem will go away to a considerable extent. Use Topaz DeNoise and/or Topaz Sharpen -----> AI !!!  to clean up completely. I think the main problem is underexposure, quite easy to do on this kind of shot, as the bright highlights will fool the meter. I don't think there is anything wrong with the camera.", "link": "https://www.l-camera-forum.com/topic/304363-leica-me-type-240-horizontal-sensor-lines-at-high-iso/?tab=findComment&comment=3872488"}, {"autor": "kaspart", "date": "05/05/2019 03:21  PM", "content": "Micro-Nikkor 2.8/55 -----> AI !!! -s #1 --img--  Edited May 5, 2019 by kaspart", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/?tab=findComment&comment=3735160"}, {"autor": "kaspart", "date": "05/05/2019 03:23  PM", "content": " Micro-Nikkor 2.8/55 -----> AI !!! -s #2 --img-- ", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/?tab=findComment&comment=3735166"}, {"autor": "kaspart", "date": "05/05/2019 03:24  PM", "content": "Micro-Nikkor 2.8/55 -----> AI !!! -s #3 --img-- ", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/?tab=findComment&comment=3735168"}, {"autor": "mmradman", "date": "07/14/2021 09:18  AM", "content": "M246 with Nikkor 24mm f2.8 -----> Ai !!!  and XO filter [Yellow-Green]. The lens is 1980s vintage with 0.3m minimum focus distance, something RF lenses are generally not designed to do. --img-- ", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/?tab=findComment&comment=4237978"}, {"autor": "glenerrolrd", "date": "01/16/2021 05:19  PM", "content": "On 1/5/2021 at 8:55 AM, convexferret said: I can reproduce this easily on my M10M, but only doing one particular thing, which I almost never do, and Diglloyd is doing it too. A huge boost in the Lightroom Dehaze control. Thank you for nailing this one . You always have to consider the context (what he is photographing ) and the Post Processing . He shoots his tests directly into the sun in extreme contrast situations . (I can t remember having a file I ETTR and then still had to lift the shadows 100% ). I would never intentionally set up a capture for such and extreme DR without using a graduated ND filter . THe 2nd issue is noted above use of post processing software to dramatically change the tone curve (Dehaze) without considering the artifacts . If you are familiar with any of the Topaz -----> AI !!!  plug ins ..you know to look for these aberrations and pull back . I don t doubt for a minute that DL can create these issues on demand from his files . But I also know that I would be able to avoid them 100% of the time in my work .", "link": "https://www.l-camera-forum.com/topic/316688-m10m-gate-coming/?tab=findComment&comment=4119377"}, {"autor": "jaapv", "date": "11/03/2020 06:44  PM", "content": "Quote I ordered a variety of SD cards to try out, and I have an extra battery I'm charging to see if that makes any difference. That won't make any difference at all. Mostly banding complaints are caused by people underexposing - and the M exposure measurement is a learning curve for people coming from other brands. The worst culprit is the dialling in of a standard -EV value without considering the subject lighting and contrast out of misplaced fear of highlights. The solution to blown highlight detail is exposing properly and individually per image, best accomplished by going full manual and observing the histogram, which on M cameras unfortunately cannot be done in real time outside the EVF, but in that case we have our little red arrows. . After the deed Topaz deNoise -----> AI !!!  can save the day - it is pretty good at removing banding.", "link": "https://www.l-camera-forum.com/topic/314762-246-banding-how-much-is-normal/?tab=findComment&comment=4073418"}, {"autor": "blackdot", "date": "11/03/2020 08:08  PM", "content": "1 hour ago, jaapv said: That won't make any difference at all. Mostly banding complaints are caused by people underexposing - and the M exposure measurement is a learning curve for people coming from other brands. The worst culprit is the dialling in of a standard -EV value without considering the subject lighting and contrast out of misplaced fear of highlights. The solution to blown highlight detail is exposing properly and individually per image, best accomplished by going full manual and observing the histogram, which on M cameras unfortunately cannot be done in real time outside the EVF, but in that case we have our little red arrows. . After the deed Topaz deNoise -----> AI !!!  can save the day - it is pretty good at removing banding. Thanks. Does Topaz let you selectively remove banding but leave the grainy noise? That could be useful. I agree I need to find the right sweet spot for exposure, but I don't see myself looking at histograms out on the street. Do you think that the A mode, after getting used to it, is not reliable? I set mine to center and use the shutter half-press lock, since that's what I'm used to. Is the multi mode more reliable?", "link": "https://www.l-camera-forum.com/topic/314762-246-banding-how-much-is-normal/?tab=findComment&comment=4073452"}, {"autor": "RexGig0", "date": "01/19/2020 03:30  PM", "content": "Depth-of-Field, or, if one prefers, Depth-of-Focus, is unaffected by the resolution of the camera’s sensor. Any DOF scale, for any lens, is going to the be the same, for any camera. Focusing accuracy is linear, with the axis of the lens. The blur problems we see with higher-resolution cameras are more likely the result of shooter movement, across pixels. If one stands, within a tiny box, one is more likely to touch the sides, than if one is standing within a large box. Well, individual pixels can be seen as tiny boxes. More pixels, per unit of area, means each pixel is smaller. Crashing into multiple boxes makes a mess. Shooting with technique that is is inadequate for the task makes a mess, across those tiny pixels. My first two DSLRs had/have 10MP sensors. The third, a Canon 7D, at 18MP, was quite a leap, and required an improvement in technique. The next big leap was the 50MP Canon 5Ds R. Macro and close-range shooting was important, during this MP progression, as I was doing evidentiary/forensic/crime scene photography. DOF is very thin, as the range gets closer. I never noticed focus accuracy becoming more difficult, whether the camera was a 10MP 40D, or a 50MP 5Ds R. As a mater of actual practice, the huge files of the 5Ds R were a bit much for the proprietary software in the police department’s computer, so I only used the 5Ds R for one crime scene, a limo bus that had been shot full of holes. Trivia: One compensates for fore-and-aft movement, at close range, by using Continuous AF, or, in Canon-speak, -----> AI !!!  Servo, just as if shooting a ball game, at longer range. Yes, hand-held macro is possible. It is amazing how few shooters know this.", "link": "https://www.l-camera-forum.com/topic/305489-41-vs-24-mp/?tab=findComment&comment=3894786"}, {"autor": "Ouroboros", "date": "09/13/2021 08:37  AM", "content": " To hell with ‘sharpness’. 😂🤣😂 I held onto one of my old Nikon D200’s all these years because of it’s CCD sensor and the images I get from it with even older -----> AI !!! -S lenses.", "link": "https://www.l-camera-forum.com/topic/324377-2021-camera-to-be-close-to-m9-sensor-by-sharpness-and-saturation/?tab=findComment&comment=4274491"}, {"autor": "mmradman", "date": "09/13/2021 05:28  PM", "content": "8 hours ago, Ouroboros said: To hell with ‘sharpness’. 😂🤣😂 I held onto one of my old Nikon D200’s all these years because of it’s CCD sensor and the images I get from it with even older -----> AI !!! -S lenses. Good old D200, I sold mine as soon I got D300 and later D700 (both CMOS), must admit those CCD 10Mp files produced by D200 have exceptional colour. Cross my mind on more than one occasion buying it again but digital technology and nostalgia don’t really mix, maybe if it was full frame.", "link": "https://www.l-camera-forum.com/topic/324377-2021-camera-to-be-close-to-m9-sensor-by-sharpness-and-saturation/?tab=findComment&comment=4274752"}, {"autor": "nightstreet", "date": "04/28/2020 07:44  PM", "content": " Yes, Yashica -----> ML !!!  21mm f/3.5, C/Y Mount [Contax/Yashica]. There are adapters for both m-mount and z-mount, and I suspect others too. --img-- ", "link": "https://www.l-camera-forum.com/topic/308951-a-21mm-for-m9m-e/?tab=findComment&comment=3962756"}, {"autor": "Flat Earth", "date": "03/17/2020 10:34  PM", "content": " In 1990 I traded my Nikon F3 and a boatload of -----> AI !!!  lenses for an M6 and 35mm Summicron. From that M6, I went to M7 to M8 and then to M9. This month I traded my M9 for a CL. The CL joins an SL and a Q2. So for the first time in 30 years I have no option but to look through a lens. OK I still have an SWC/CFV but that doesn’t get much use anymore. I need to save for an M whatever....", "link": "https://www.l-camera-forum.com/topic/307545-rangefinderless-and-sad/?tab=findComment&comment=3933547"}, {"autor": "adam b", "date": "08/12/2009 06:04  PM", "content": "I bought an epson 3800 and really love printing with it, love to have the print as an object in my hands. It's been especially satisfying printing black and white. color has been trickier to get a handle on, but since I started using Moab Colorado Satin, I'm much happier with the results. When printing black and white I do it right from Lightroom, for color I use photoshop to proof. The other papers I've settled on are Hahnemuhle Photo Rag Bright White and Harmon Gloss FB -----> AI !!! . I print first on 8.5 x 11 and if I like the photo, I'll print larger, but usually not bigger than 13x19.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/?tab=findComment&comment=992023"}, {"autor": "jaapv", "date": "12/29/2019 12:17  AM", "content": "You can easily go up to 1250 on the camera if you expose liberally and take some care in raw conversion- See the FAQ. Topaz Sharpen -----> AI !!!  will do an excellent cleanup job as well I think you could manage 2500 with up to date software.", "link": "https://www.l-camera-forum.com/topic/304488-please-help-with-image-sharpness-new-to-this-forum/?tab=findComment&comment=3881164"}, {"autor": "Daedalus2000", "date": "01/03/2020 10:26  AM", "content": "On 12/29/2019 at 12:17 AM, jaapv said: You can easily go up to 1250 on the camera if you expose liberally and take some care in raw conversion- See the FAQ. Topaz Sharpen -----> AI !!!  will do an excellent cleanup job as well I think you could manage 2500 with up to date software. Do you mean Topaz Denoise AI? I thought Topaz Sharpen AI was for sharpness only, but I may be mistaken.", "link": "https://www.l-camera-forum.com/topic/304488-please-help-with-image-sharpness-new-to-this-forum/?tab=findComment&comment=3884155"}, {"autor": "jaapv", "date": "01/03/2020 11:14  AM", "content": "Sharpen -----> AI !!!  does both, DeNoise is only for noise.", "link": "https://www.l-camera-forum.com/topic/304488-please-help-with-image-sharpness-new-to-this-forum/?tab=findComment&comment=3884177"}, {"autor": "jaapv", "date": "09/17/2018 10:07  PM", "content": "Well, I am glad that most of you here support having the M8 serviced. I enjoy using it, and I was annoyed by the dead pixel lines. It reminded me each day that my M8 was \"dying\" slowly. \"t -----> Ai !!! n't dead yet...--img-- ", "link": "https://www.l-camera-forum.com/topic/288281-my-m8-seems-to-require-repair-take-a-look/?tab=findComment&comment=3594971"}], "name": "leica"}