{
  "interestingcomments": [
    {
      "autor": "LeicaR10",
      "posts": "597 posts",
      "date": "08/11/2020 02:24  AM",
      "content": "Dsalamena, To answer your question in your post #87, the M10 and M10-R color are very similar but not identical. At lower ISO the M10 files are cleaner for noise. But for resolution and at higher ISO the M10-R is better. If you consistently make large prints, consider the M10-R, if not, the M10 works just fine. If you want a excellent review comparison for the M10 and M10-R cameras, I recommend you subscribe to Reid Reviews and you can make an informed decision vs taking my word for it. Both cameras are superb, -----> -----> I !!!  create !!!  very large prints for my clients and therefore need the M10-R. Before that, the M10-P worked almost as well for me. Hope this helps. r/ Mark Edited August 11, 2020 by LeicaR10",
      "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=findComment&comment=4025063"
    },
    {
      "autor": "otto.f",
      "posts": "8,355 posts",
      "date": "10/26/2021 08:12  AM",
      "content": "1 hour ago, otto.f said: This a very good example of how -----> I !!!  like my M10R colors to be, full color and yet not oversaturated Here is another example, -----> -----> I !!!  developed !!!  in C1 without any dedicated M10R profile, just the general 'Camera RGB profile', as it is named in C1 --img-- ",
      "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=findComment&comment=4300060"
    },
    {
      "autor": "MarkP",
      "posts": "9,144 posts",
      "date": "03/11/2017 07:56  AM",
      "content": "-----> I !!!  want to add also that -----> -----> I !!!  develop !!!  in C1. Thus far, I have not been able to find my way with LR (most recent version) for M10 files and like the C1 conversions much better. BTW, there was no postprocessing of significance, ready in a minute. Thanks for that. May well upgrade my version of C1.",
      "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=3231224"
    },
    {
      "autor": "DwF",
      "posts": "1,114 posts",
      "date": "12/15/2019 08:02  PM",
      "content": "--img--  Finally abandoned, Georgia Pacific's Acid Ball has become a feature attraction at -----> -----> our !!!  developing !!!  waterfront in Bellingham, Washington. 35mm Summicron v4",
      "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=3873903"
    },
    {
      "autor": "dkmoore",
      "posts": "2,194 posts",
      "date": "08/19/2020 10:22  AM",
      "content": "17 hours ago, jonoslack said: And sometimes you get it just right this one at f1.4 (actually they were all at f1.4) This one at ISO 500 --img-- ISO 500 Love the images! Just an FYI, -----> -----> we !!!  created !!!  a M10-R image specific thread. it’s not pinned yet, which is why it wasn’t obvious.",
      "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=findComment&comment=4029574"
    },
    {
      "autor": "Tailwagger",
      "posts": "2,150 posts",
      "date": "08/19/2021 07:00  PM",
      "content": "Just now, lct said: Why using the L mount for manual lenses anyway? There are SL and CL cameras for that. Never understood good people stating they preferred the L mount because... i don't remember why exactly sorry. More modern perhaps? Unless it was because they heard it at Leica, so if they changed their mind it could mean that Leica changed their mind as well... Who knows? . Totally agree and fingers crossed that the softened stance of the inside man on this thread is indeed a positive indicator of things to come. Once you land on L-mount as the native interface to the glass, IMO, everything spirals out of control. It would be impossible from a marketing standpoint not to include AF and all that entails. No aperture ring means another dial. What no AE-F lock control? Forced to add an adapter straight out of the box that costs how much?!? As you so correctly point out, we have the CL, SL, SL2, SL-S not to mention all the Panos and Sigma for L. I get that there are some folks out there that want a FF mini-SL, but that has nothing to do with what both you, I and others have been on about for several years now. This isn't to say that if -----> -----> we !!!  -----> we !!! re designing !!!  a 21st C. MF only camera from scratch, -----> we !!!  couldn't do better than the exist 70 year old mount as Jaapv points out. But we are, happily, captive to all those decades of lens production and frankly, having a stripped down, lower cost, EVF based body totally focused on that library of lenses is, IMO, an important notion if not simply for those of desirous of it, but for ensuring the survival of the M itself.",
      "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=findComment&comment=4259551"
    },
    {
      "autor": "antonioxrosa",
      "posts": "26 posts",
      "date": "05/11/2020 01:37  PM",
      "content": "14 hours ago, LBJ2 said: Hello. What brand is the mini tripod? Is the brown case attached to the camera bag for the tripod? FotoPro and yes the case is the one attached to the bag. The way it is attached is a -----> -----> DIY !!!  !!! .",
      "link": "https://www.l-camera-forum.com/topic/309018-whats-in-your-leica-m10-camera-bag/?tab=findComment&comment=3971272"
    },
    {
      "autor": "RS-Colo",
      "posts": "18 posts",
      "date": "10/12/2021 05:02  PM",
      "content": "As soon as I scheduled my two covid shots last February, I booked a celebratory trip in May to San Francisco. Here are two panoramas I took, one with my M10-R and one with my M10-M. The actual full sized files are 25,200 x 4,800 and 54,000 x 3,600 pixels. I've also included a full resolution sliver from the Monochrom pan to show the actual resolution. -----> I !!!  have been doing stitched panoramas for over a decade and continue to love the process and what -----> -----> I !!!  can create !!! . Some subjects just seem to beg to be wider, or taller. --img-- --img-- --img-- ",
      "link": "https://www.l-camera-forum.com/topic/325319-lets-see-some-panoramas-with-the-m10/?tab=findComment&comment=4291199"
    },
    {
      "autor": "nodrog",
      "posts": "434 posts",
      "date": "10/15/2021 09:27  AM",
      "content": "On 10/13/2021 at 2:02 AM, RS-Colo said: As soon as I scheduled my two covid shots last February, I booked a celebratory trip in May to San Francisco. Here are two panoramas I took, one with my M10-R and one with my M10-M. The actual full sized files are 25,200 x 4,800 and 54,000 x 3,600 pixels. I've also included a full resolution sliver from the Monochrom pan to show the actual resolution. -----> I !!!  have been doing stitched panoramas for over a decade and continue to love the process and what -----> -----> I !!!  can create !!! . Some subjects just seem to beg to be wider, or taller. --img--  That monochrom pano is a monster! I don't think my little MacMini would survive a job like that. Would probably keel over and die halfway through. Have you ever tried to print it?",
      "link": "https://www.l-camera-forum.com/topic/325319-lets-see-some-panoramas-with-the-m10/?tab=findComment&comment=4293009"
    },
    {
      "autor": "Tailwagger",
      "posts": "2,150 posts",
      "date": "01/09/2019 06:15  PM",
      "content": "9 hours ago, setuporg said: This is very reasonable, except it probably won't be an M, but rather a variation of SL/CL/TL or whatever else a new system will be called. But I get your point. Given there have been hundreds of pages devoted to the topic in this forum, its well understood that some, maybe most, see the letter M as exclusively belonging to an RF design. While I get this point of view, its not one I hold, no matter how heretical it might be. While I appreciate the attributes of the RF, I'd would never have come to Leica... from Fuji among others... had it not been for the glass and rendering. -----> I !!!  shot exclusively with the OVF for about a year after which -----> -----> I !!!  developed !!!  a hybrid technique which utilizes both. To my mind, M stands for the mount, not the method of focus, given Leica produced RFs for decades prior to the M designation. But either belief is really beside the point. For those who find EVF to be a useful tool and have a significant investment in M glass, having a small form factor minimalist EVF designed specifically to utilize our current set of optics is something quite logical, regardless of the model designation.",
      "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/?tab=findComment&comment=3661637"
    },
    {
      "autor": "a.noctilux",
      "posts": "6,090 posts",
      "date": "10/13/2021 09:32  AM",
      "content": "@sinjun, take it to a repair shop (Leica if possible) -----> I !!!  think it can be a -----> D-----> I !!! Y !!! * ... but it can be something -----> I !!!  experienced on my M4 long ago (one of it's kind in my decades M use), without notice the spring failed to do it's job. * I took the lens out, then do some roller gentle in/out a couple of times",
      "link": "https://www.l-camera-forum.com/topic/325329-rangefinder-cam-sticking-on-m10-d/?tab=findComment&comment=4291616"
    },
    {
      "autor": "LeicaR10",
      "posts": "597 posts",
      "date": "10/06/2021 10:45  AM",
      "content": "Steven, Although I went from M10-R back to the M10-P for my aforementioned reasons in my post #555...from what I learned recently from a source the next camera will benefit from a BSI type sensor like the SL2-S. IMO, meaning the M11 could well have the look and feel like the SL2-S for low light rendering capability, color and hopefully a more cinematic look. It might well have a solution for selective option for DNG output for different levels of DNG MPs...similar to the option in given with JPEGs. This would be a great move for Leica with an excellent sensor and selectable MP for DNGs. For those of us who do not need 40 MPs, we can perhaps select 24 MPs. In my business, I can easily print 6 ft x 4 ft prints from a 24 MP sensor that renders the level of detail that at times can be more than amazing and my clients vote with their wallets. It would be great to know a M11 delivers selective levels of MPs. So we will just have to wait and see. For me, 24 MPs is the sweet spot for creating photographs that ultimately meet my goal that causes the viewer to: Stop, Look, Think and Feel something about that moment in time. -----> I !!! f -----> -----> I !!!  can create !!!  a photograph that accomplishes this goal...then -----> I !!!  am more than pleased. r/ Mark Edited October 6 by LeicaR10",
      "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/?tab=findComment&comment=4287421"
    },
    {
      "autor": "yukosteel",
      "posts": "23 posts",
      "date": "05/25/2021 06:02  AM",
      "content": " I used to make custom long straps and also carry camera diagonally with lens small enough to keep it hang balanced. Few years ago -----> I !!!  started to use self-securing -----> D-----> I !!! Y !!!  wrist straps only, shaped from soft but durable leather, and forming the loop repeating contour of wrist. I'm using same strap shape with M10 these days.",
      "link": "https://www.l-camera-forum.com/topic/321206-going-strapless/?tab=findComment&comment=4207322"
    },
    {
      "autor": "a.noctilux",
      "posts": "6,090 posts",
      "date": "07/31/2021 08:58  AM",
      "content": "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwixp_7p94zyAhUwxYUKHcxJBfcQ3ywwAHoECAIQAg&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DFniUPxpYYAU&usg=AOvVaw06FTVAnB8e1bBwyDPAbvVP Sparrow Who will love a little SparrowWho's travelled far and cries for rest?\"Not -----> I !!! \", said the Oak Tree\"-----> I !!!  won't share my branches with no Sparrow's nestAnd my blanket of leaves won't warm her cold breast\" Who will love a little Sparrow?And who will speak a kindly word?\"Not -----> I !!! , \" said the Swan\"The entire idea is utterly absurd-----> I !!! 'd be laughed at and scorned if the other Swans heard\" And who will take pity in his heart?And who will feed a starving Sparrow?\"Not -----> I !!! \", said the golden Wheat\"-----> I !!!  would if -----> I !!!  could, but -----> I !!!  cannot, -----> I !!!  know-----> I !!!  need all my grain to prosper and grow\" Who will love a little Sparrow?Will no one write her eulogy?\"-----> I !!!  will\", said the Earth\"For all -----> -----> I !!! 've created !!!  returns unto meFrom dust were ye made and dust ye shall be\" Simon&Garfunkel Edited July 31 by a.noctilux",
      "link": "https://www.l-camera-forum.com/topic/323074-should-i-sell-my-rolex-to-buy-a-leica-m10r/?tab=findComment&comment=4248509"
    },
    {
      "autor": "Rodrigo castillo",
      "posts": "103 posts",
      "date": "07/31/2021 02:57  PM",
      "content": "5 hours ago, a.noctilux said: https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwixp_7p94zyAhUwxYUKHcxJBfcQ3ywwAHoECAIQAg&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DFniUPxpYYAU&usg=AOvVaw06FTVAnB8e1bBwyDPAbvVP Sparrow Who will love a little SparrowWho's travelled far and cries for rest?\"Not -----> I !!! \", said the Oak Tree\"-----> I !!!  won't share my branches with no Sparrow's nestAnd my blanket of leaves won't warm her cold breast\" Who will love a little Sparrow?And who will speak a kindly word?\"Not -----> I !!! , \" said the Swan\"The entire idea is utterly absurd-----> I !!! 'd be laughed at and scorned if the other Swans heard\" And who will take pity in his heart?And who will feed a starving Sparrow?\"Not -----> I !!! \", said the golden Wheat\"-----> I !!!  would if -----> I !!!  could, but -----> I !!!  cannot, -----> I !!!  know-----> I !!!  need all my grain to prosper and grow\" Who will love a little Sparrow?Will no one write her eulogy?\"-----> I !!!  will\", said the Earth\"For all -----> -----> I !!! 've created !!!  returns unto meFrom dust were ye made and dust ye shall be\" Simon&Garfunkel From dust were ye made and dust ye shall be…. Yes ….. thank you….",
      "link": "https://www.l-camera-forum.com/topic/323074-should-i-sell-my-rolex-to-buy-a-leica-m10r/?tab=findComment&comment=4248739"
    },
    {
      "autor": "yukosteel",
      "posts": "23 posts",
      "date": "05/05/2021 01:57  AM",
      "content": "Speaking of a wrist straps with minimal metal parts to avoid unwanted body/glass scratches, -----> I !!! 'm using simple to make -----> D-----> I !!! Y !!!  leather strap with vintage metal rivet adopted from old Nikon binoculars strap, and custom made copper ring. It has that minimalistic look and practical function to fit Leica controls minimalism. --img-- ",
      "link": "https://www.l-camera-forum.com/topic/317808-new-to-leicam10-question/?tab=findComment&comment=4194575"
    },
    {
      "autor": "M10 for me",
      "posts": "2,378 posts",
      "date": "05/17/2021 08:44  AM",
      "content": "-----> I !!!  work with Lightroom and import directly into lightroom into a folder that -----> -----> I !!!  create !!!  even out of Lightroom. On my Mac I do strictly nothing in the finder what has to do with photographs (in the finder I do even not show the photo-folder in the favorites). The photography folder I manage exclusively within Lightroom. Then I do a second thing: During the import process I alter the filenames to date/time e.g. \"2021-05-17 at 10-43-15\" So that is my way. But I must say that I am extremely pedantic on such things. Here I am the pure ingeneer type. When I sit together with other photographers and I see the complete mess they have in their organisation this makes me always mad. But it never helped anything: My friends always continued with their mess 😀. They must like it.",
      "link": "https://www.l-camera-forum.com/topic/320915-conflict-with-file-names-from-different-cameras/?tab=findComment&comment=4202366"
    },
    {
      "autor": "stevegaskin",
      "posts": "174 posts",
      "date": "01/22/2020 11:33  AM",
      "content": "Quote -----> I !!!  was a little concerned that when -----> I !!! 'm out on the street that my cola bottle might be identified and become a talking point or even a target, so -----> -----> I !!! 've created !!!  this lovely black discreet logo. I kept the release button red for aesthetic purposes and ease of use --img-- 😂😂",
      "link": "https://www.l-camera-forum.com/topic/269215-black-logo-for-m10/?tab=findComment&comment=3896843"
    },
    {
      "autor": "dancook",
      "posts": "1,545 posts",
      "date": "05/04/2021 12:10  PM",
      "content": " Got a small piece of orange fluff in the rangefinder, Leica won't give a price until it's been sent away to another country to be looked at.. it can't be seen in focusing, but I am selling the camera and it might put buyers off. -----> I !!!  was curious if it can easily be -----> D-----> I !!! Y !!! ? --img-- ",
      "link": "https://www.l-camera-forum.com/topic/320582-can-the-rangefinder-window-be-cleaned/?tab=findComment&comment=4194068"
    },
    {
      "autor": "nuc001",
      "posts": "83 posts",
      "date": "02/12/2021 02:53  AM",
      "content": " Hi everyone. Following up on my M10-P Rangefinder drifting thread, where I asked whether the body was front focusing or not, I went to Leica in Thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to Singapore. As my camera was bought from HK, I will have to pay P&P of 250USD as well, and it will take around 2-3 months. I also would have to go find the receipt, as they cannot just look at the serial number for some reason. If I am unable to supply the receipt, then a maintenance fee will be charged as well. Yesterday -----> I !!!  had some free time and was itching to get the problem sorted, so -----> I !!!  researched this forum about -----> D-----> I !!! Y !!!  rangefinder adjustments and a few YouTube videos, went out and bought a 2mm Hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. However, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what I do, making adjustment very difficult. At the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for Summilux-M 50mm at F1.4. I have a few questions regarding the adjustments. Horizontal adjustment (please kindly see attached photo from the internet, of an M7?) When the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. However, when I try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so I had to do a lifting motion whilst also turning the hex key. This lifted the rangefinder arm further out of the body once, but it then moved back so I am not sure whether this will cause any problems in the long term. I made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as I can tell. Hopefully I didn't bend it? Vertical adjustment Apparently this can also be done with the 2mm hex key. However, I have no idea how to unscrew the cover screw on the camera without scratching it. Some have suggested wrapping a screwdriver in electrical tape first, but I am hesitating to attempt it. Has anyone else managed to removed the screw, and how did you do it? Any help would be much appreciated. --img-- ",
      "link": "https://www.l-camera-forum.com/topic/317918-need-some-help-with-m10-p-rangefinder-adjustment/?tab=findComment&comment=4138966"
    },
    {
      "autor": "budjames",
      "posts": "616 posts",
      "date": "02/14/2021 01:54  PM",
      "content": "On 2/11/2021 at 9:53 PM, nuc001 said: Hi everyone. Following up on my M10-P Rangefinder drifting thread, where I asked whether the body was front focusing or not, I went to Leica in Thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to Singapore. As my camera was bought from HK, I will have to pay P&P of 250USD as well, and it will take around 2-3 months. I also would have to go find the receipt, as they cannot just look at the serial number for some reason. If I am unable to supply the receipt, then a maintenance fee will be charged as well. Yesterday -----> I !!!  had some free time and was itching to get the problem sorted, so -----> I !!!  researched this forum about -----> D-----> I !!! Y !!!  rangefinder adjustments and a few YouTube videos, went out and bought a 2mm Hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. However, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what I do, making adjustment very difficult. At the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for Summilux-M 50mm at F1.4. I have a few questions regarding the adjustments. Horizontal adjustment (please kindly see attached photo from the internet, of an M7?) When the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. However, when I try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so I had to do a lifting motion whilst also turning the hex key. This lifted the rangefinder arm further out of the body once, but it then moved back so I am not sure whether this will cause any problems in the long term. I made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as I can tell. Hopefully I didn't bend it? Vertical adjustment Apparently this can also be done with the 2mm hex key. However, I have no idea how to unscrew the cover screw on the camera without scratching it. Some have suggested wrapping a screwdriver in electrical tape first, but I am hesitating to attempt it. Has anyone else managed to removed the screw, and how did you do it? Any help would be much appreciated. --img--  I think that is is a job for an experience Leica technician. I would never attempt this on my own. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto",
      "link": "https://www.l-camera-forum.com/topic/317918-need-some-help-with-m10-p-rangefinder-adjustment/?tab=findComment&comment=4140705"
    },
    {
      "autor": "dancook",
      "posts": "1,545 posts",
      "date": "02/21/2021 04:08  PM",
      "content": "39 minutes ago, T25UFO said: Did you keep the Hasselblad? If so, do you really need the M10R? I thought I had persuaded you to go with the Q2M over the M10M 🙂. I have both and still prefer the M but it’s a close run thing and there are times when auto focus means I get the shot. Doubt you’ll find a Q2M used so that’s £5,000 of your budget on a new one. At least you’ll get another three months of free Adobe use! What about the new f1.2 Noctilux? A really interesting lens, which should hold its value if you don’t like it and decide to sell. There goes another £6,500 leaving £8,500 to spend on a used M10P and some more glass. I still have my 907X 80mm 1.9 and 45p - but I did put them on ebay this morning, but not in a rush to sell. there was a Q2M used for £4250 and -----> I !!!  just watched it pass by... should have jumped on it -----> -----> I !!!  developed !!!  a used camera/lens database of UK retailers which updates daily - so -----> I !!!  have a good chance to spot something in the used market. I will take a look at the new 50mm 1.2, not sure about holding it's value new though! (EDIT oh i see it's limited edition run..but it's also silver, wanted to go all black :)) Edited February 21 by dancook",
      "link": "https://www.l-camera-forum.com/topic/318234-switching-to-leica-m/?tab=findComment&comment=4146007"
    },
    {
      "autor": "w44neg",
      "posts": "309 posts",
      "date": "02/15/2021 11:57  PM",
      "content": " Firstly, don't worry, I know cameras pick up scratches and it's hardly going to fall apart because of them 😄 However I was watching a YouTube video recently and the guy said he occasionally polished the scratches out of his black M10P. I picked up this silver M10P and it has a few rub marks from straps etc. --img--  -----> I !!!  have some experience with polishing metal etc and -----> I !!!  never thought a finish as delicate as the M10P (looks bead-blasted) could be rescued in a -----> D-----> I !!! Y !!!  fashion, but perhaps -----> I !!! 'm wrong. Has anyone managed it? The scratches shown are in the highest point of the surface; they look deeper in the image but they're just where the strap has rubbed. Not an issue as I say, but if there's a way to keep the camera in nicer shape, I'm interested that;ss all.",
      "link": "https://www.l-camera-forum.com/topic/318061-removing-surface-scratches/?tab=findComment&comment=4142089"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "02/08/2021 09:51  AM",
      "content": "I think it is possible that you lens needs to be adjusted. The Summilux 50 asph is known for calibration issues, due to the exceedingly tight tolerances in the floating element mechanism. If the problem is with the lens you can find out by mounting a lens with known correct calibration. OTOH, the adjustment of the rangefinder is basically done at two places, the roller wheel and the internal screw of the arm. The roller wheel is for infinity and can be done in -----> -----> DIY !!!  !!! . The screw is for close-up and is slightly more difficult. It may be that Leica only adjusted infinity. There is also the possibility that you bent the arm slightly by hitting the roller when mounting a lens. In that case the mid-range will be off. It is always wise to send both lens(es) and camera in in, to enable the technician to determine the cause of the adjustment problem.",
      "link": "https://www.l-camera-forum.com/topic/317781-m10-p-rangefinder-drifting/?tab=findComment&comment=4136182"
    },
    {
      "autor": "fenykepesz",
      "posts": "80 posts",
      "date": "04/28/2020 11:35  AM",
      "content": "-----> i !!!  also thought f-----> i !!! rst that -----> i !!! t's plast-----> i !!! c - but the l-----> i !!! ttle grooves -----> -----> i !!!  created !!!  are -----> i !!! ndeed qu-----> i !!! te sh-----> i !!! ny and yellow-----> i !!! sh, and, us-----> i !!! ng a magn-----> i !!! fy-----> i !!! ng glass, looks l-----> i !!! ke brass, Mess-----> i !!! ng -----> i !!! n german. at least that's the case for the middle ring, while the three indents in the outer ring i have filled with paint & glue and hence can't be examined anymore. but i remember them glistening too - and, importantly, the stuff was really hard while sinking the drill... don't faint now Edited April 28, 2020 by fenykepesz",
      "link": "https://www.l-camera-forum.com/topic/295873-m10-d-owners-are-you-happy/?tab=findComment&comment=3962500"
    },
    {
      "autor": "budjames",
      "posts": "616 posts",
      "date": "01/09/2021 09:42  AM",
      "content": "The original poster obviously did some significant work to share. Thank you for that. I am relatively new Leica shooter since acquiring my first Leica, the M10, in November 2017. I have an new portfolio of great images, IMHO, created with my M10. Since then, I have acquired the SL2 and M10-R. Both great platforms. I enjoy the \"cropability\" of the increased resolution images produced by the M10-R over the M10. -----> I !!! nstead of chasing infinity, -----> I !!!  will just go out and enjoy my gear as -----> -----> I !!!  create !!!  art. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto Edited January 9 by budjames",
      "link": "https://www.l-camera-forum.com/topic/311518-m10-r-vs-m10-p-high-iso-acuity-and-noise-side-by-side-comparison-results/?tab=findComment&comment=4114863"
    },
    {
      "autor": "a.noctilux",
      "posts": "6,090 posts",
      "date": "08/20/2021 08:40  AM",
      "content": "Hello welcome here, If it's a bit off, how is it 'a bit' ? I think for this it would be overkill to send to Wetzlar. Many technicians not far from where you are can adjust it with right tools. Call around or ask your Leica Dealer. Even some had done -----> -----> DIY !!!  !!!  ( when I travelled, I had done on M8/M9, never on newer M though).",
      "link": "https://www.l-camera-forum.com/topic/323717-problem-with-my-m240-vertical-alignment-a-bit-off/?tab=findComment&comment=4259799"
    },
    {
      "autor": "ianman",
      "posts": "8,067 posts",
      "date": "08/20/2021 02:46  PM",
      "content": "6 hours ago, a.noctilux said: Even some had done -----> -----> DIY !!!  !!!  ( when I travelled, I had done on M8/M9, never on newer M though). I did it on my M4-P with a screwdriver IIRC, but I understand that later models need a special tool*. What did you use for the M9? * see here http://leica.nemeng.com/034b.shtml",
      "link": "https://www.l-camera-forum.com/topic/323717-problem-with-my-m240-vertical-alignment-a-bit-off/?tab=findComment&comment=4260026"
    },
    {
      "autor": "mmx_2",
      "posts": "638 posts",
      "date": "02/02/2016 01:25  PM",
      "content": "IMHO - you ruined the mystique - I hope the Mojo was retained.. 2each his own.. -----> I !!! MHO, -----> -----> I !!! 've created !!!  a unique, one-of-a-kind, future collectors edition. Patent pending --img-- ",
      "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/?tab=findComment&comment=2981322"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "04/18/2021 09:00  AM",
      "content": "Partly, -----> -----> I !!!  created !!!  a dual-illuminant one for general use (-----> I !!!  think that colour profiles by lens are overkill) and a dedicated one for use on shots with a (medium-)high -----> I !!! R content. The camera can produce a horrible yellow-orange cast in that case and a good profile can help - but is not ideal. An IR-cut filter was mandatory for my Safari photography. 19 minutes ago, Paco said: Do you know if there is a systematic way to match the colours of one camera with other? I want to “match” the colours of my SL with the M240. Yes, use the Xrite Passport at the first shot of both cameras when using side by side. It is fully explained in the instructions by Xrite.",
      "link": "https://www.l-camera-forum.com/topic/317448-color-rendition-of-m-240-vs-m-262/?tab=findComment&comment=4183652"
    },
    {
      "autor": "Paco",
      "posts": "6 posts",
      "date": "04/18/2021 09:12  AM",
      "content": " 11 minutes ago, jaapv said: Partly, -----> -----> I !!!  created !!!  a dual-illuminant one for general use (-----> I !!!  think that colour profiles by lens are overkill) and a dedicated one for use on shots with a (medium-)high -----> I !!! R content. The camera can produce a horrible yellow-orange cast in that case and a good profile can help - but is not ideal. An IR-cut filter was mandatory for my Safari photography. Yes, use the Xrite Passport at the first shot of both cameras when using side by side. It is fully explained in the instructions by Xrite. Thanks for the detailed explanation! I will do some experiments, once we have sunshine in Munich...",
      "link": "https://www.l-camera-forum.com/topic/317448-color-rendition-of-m-240-vs-m-262/?tab=findComment&comment=4183657"
    },
    {
      "autor": "thgbrian",
      "posts": "3 posts",
      "date": "01/09/2020 05:26  AM",
      "content": "Thank you all for the replies. Guess this isn't any sort of -----> -----> DIY !!!  !!!  fix. Has anyone else experienced this issue? I read one or two threads and they said they just knocked the dial and it worked lol.",
      "link": "https://www.l-camera-forum.com/topic/305090-m240-shutter-speed-dial-misaligned/?tab=findComment&comment=3887909"
    },
    {
      "autor": "Shu_downunder",
      "posts": "154 posts",
      "date": "04/17/2021 12:03  PM",
      "content": " On 1/9/2020 at 4:26 PM, thgbrian said: Thank you all for the replies. Guess this isn't any sort of -----> -----> DIY !!!  !!!  fix. Has anyone else experienced this issue? I read one or two threads and they said they just knocked the dial and it worked lol. Have you fixed it? I got the same problem on mine as well now.",
      "link": "https://www.l-camera-forum.com/topic/305090-m240-shutter-speed-dial-misaligned/?tab=findComment&comment=4183173"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "07/27/2020 12:35  AM",
      "content": "23 hours ago, WurzelbertAngenervt said: Hi guys! I am wondering about the shock resistance of this camera. Why?... I like to do a lot of sports, especially mountainbiking. I´d like to have a camera with me, that would not have me thinking about whether I should ride the stumpy trail or not, because of the fear that it could damage the camera or may have the rangefinder to be re-adjusted. Does someone have experience with that, or would you recommend another camera for that use? Maybe a little compact one with a big sensor? The M240 (and M10) are more shock-resistant than previous models, due to an improved rangefinder mechanism. I would be surprised to see an M240 knocked out of kilter by anything less than an impact that would leave some other brands a collection of nuts,bolts and shards of plastic. Even older M cameras were pretty bomb-proof, although a really hard slam on the bottom plate could shift the vertical RF adjustment, as could really strong vibration - this was the improvement on the 240, making the shift near-impossible. Even though re-adjustment is no more than a ten-minute -----> -----> DIY !!!  !!!  job.",
      "link": "https://www.l-camera-forum.com/topic/311708-m240-shock-resistance/?tab=findComment&comment=4016332"
    },
    {
      "autor": "Einst_Stein",
      "posts": "1,626 posts",
      "date": "05/22/2020 07:12  PM",
      "content": " 10 hours ago, chasdfg said: For every camera I purchase I have one spare battery, maybe two spares if the battery life is notoriously poor (think early sony MILCs). What I've learnt is that two healthy batteries stored properly and used evenly in rotation is better than a stockpile of 4 or 5 (or more) batteries which are unused. I've purchased cameras used with up to 6 batteries \"free\", but the extra batteries count for nothing if they are all dead. I shot my M240 rather heavily for almost 5 years and two batteries served me fine (over 30-40k frames?) with no discernible drop in battery life. Anyway, the camera will likely die before the original two batteries (one with the camera and spare) truly go kaput, if the batteries maintained through the lifetime (rotated for use, stored properly, not dropped). Now Leica product cycles are 4 to 5 years, so at the tail end of those cycles you may wish to pick up another couple of batteries lest the new model uses a newer battery type. I do recall camera companies generally extending serviceability of a camera 5 to 10 years after the camera is discontinued (depending on manufacturer), in which case even if a new model is released with new batteries, the older model's batteries should continue to be sold until the camera is no longer serviceable. If the new model uses the same batteries, then you're in luck. Now I myself have overthought this. Basically 2 batteries for me. Another 1 or 2 every 5 years if I stick with that camera. The moderator JAAP posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them -----> -----> DIY !!!  !!! . Better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). I have not found the source of replace/refill cell yet, but that would be a good choice. Perhaps solve the problem once and forever.",
      "link": "https://www.l-camera-forum.com/topic/307515-how-many-spared-batteries/?tab=findComment&comment=3978506"
    },
    {
      "autor": "chasdfg",
      "posts": "186 posts",
      "date": "05/23/2020 02:56  AM",
      "content": "7 hours ago, Einst_Stein said: The moderator JAAP posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them -----> -----> DIY !!!  !!! . Better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). I have not found the source of replace/refill cell yet, but that would be a good choice. Perhaps solve the problem once and forever. Sounds like a lot of trouble for a $100 battery. I explored swapping batteries out of my electric toothbrush, but swapping cells out of a camera battery...I'd say its safer to buy a used one (of which you do not know the provenance i.e. may have been dropped or charged improperly) than to muck about like that and brick a camera. It isn't impossible and it may be a simple job if you know what you're doing but most of us don't in this respect. In any case if you do find out where Varta Indonesia gets the cells and circuits of this battery and decide to embark on this project I'd follow with interest..",
      "link": "https://www.l-camera-forum.com/topic/307515-how-many-spared-batteries/?tab=findComment&comment=3978649"
    },
    {
      "autor": "Good To Be Retired",
      "posts": "220 posts",
      "date": "05/14/2020 08:10  PM",
      "content": " Having determined that, for what -----> I !!!  happen to like doing, an -----> I !!! R/UV Cut filter might be beneficial, -----> I !!!  was wondering if -----> -----> I !!!  should create !!!  a new Lumariver custom profile for use with the -----> I !!! R/UV Cut filter attached. The appropriate approach would be to just make the profiles and see what happens, but the weather isn't currently cooperation and I'm working sort of on a thought experiment here until the sun peeks out. Any thoughts would be appreciated.",
      "link": "https://www.l-camera-forum.com/topic/309535-m240-customers-profiles-and-iruv-cut-filters/?tab=findComment&comment=3973476"
    },
    {
      "autor": "Mr.Prime",
      "posts": "383 posts",
      "date": "02/29/2020 02:18  PM",
      "content": " I realized, after using an M3 since Christmas (my foray into the Leica world) that I would also like a digital version. Yesterday I lost an M-D on ebay, it went for US$4,100 and I had bid $4,000. Looking around there just aren’t any available for good prices. I was thinking about the possibility of getting an M 240 / 262 and converting it to an M-D myself by removing the screen and buttons and replacing the leather covering. Given falling prices on the M10 and stupid prices on the M10D that might be a better starting point but there likely isn’t much of a difference in the work required. No doubt there’s a bit more work involved than I’ve alluded to but -----> I !!! ’m a fairly handy kind of guy (-----> -----> I !!!  design !!!  and build my own hi-fi electronics and speakers for example) and thought perhaps somebody else in a similar predicament to myself may have done something similar ??? Edited February 29, 2020 by Mr.Prime typo",
      "link": "https://www.l-camera-forum.com/topic/306944-diy-convert-m-or-m10-to-m-d-or-m10d/?tab=findComment&comment=3921955"
    },
    {
      "autor": "a.noctilux",
      "posts": "6,090 posts",
      "date": "11/04/2019 11:06  AM",
      "content": "Sorry, I've never seen this. The fixing screws is not -----> -----> DIY !!!  !!!  in this case. To be certain, I took the spring unit out, just simple \"lift a bit\" then push toward the rear with a small flat screw driver. No screws hiden under it.",
      "link": "https://www.l-camera-forum.com/topic/303088-leica-m240-loose-hot-shoe/?tab=findComment&comment=3847485"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "11/04/2019 02:24  PM",
      "content": "3 hours ago, a.noctilux said: Sorry, I've never seen this. The fixing screws is not -----> -----> DIY !!!  !!!  in this case. To be certain, I took the spring unit out, just simple \"lift a bit\" then push toward the rear with a small flat screw driver. No screws hiden under it. The hot shoe is fixed by 4 little screws from the inside.To access these screws you must not lift the flex connecting the hot shoe to a small circuit board , which covers them. The top can be removed by two long screws, accessed through the bottom. Again, there is a flex cable between the camera and the top, which must be disconnected at the camera side plus a white cable connecting the hot shoe.There is also a small red connecting cable to the speaker.",
      "link": "https://www.l-camera-forum.com/topic/303088-leica-m240-loose-hot-shoe/?tab=findComment&comment=3847604"
    },
    {
      "autor": "Syrjames",
      "posts": "18 posts",
      "date": "11/05/2019 01:36  PM",
      "content": " My beloved M-D typ262 is showing nice brassing, but not so nice ‘leather’ covering. is there any second market ‘-----> -----> DIY !!!  !!! ’ replacement? I dont wanna send the camera to Germany as ot will take too long and its my everyday camera. thanks for your help! if you are curious, most of my pics here are with the MD iG: syrjames James",
      "link": "https://www.l-camera-forum.com/topic/303129-leica-m-d-typ-262-leather-cover-replacement/?tab=findComment&comment=3848190"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "02/17/2019 09:18  AM",
      "content": " -----> -----> I !!!  have developed !!!  many thousands of 240 images using ACR/PS and occasionally Lightroom. I have never seen this problem. Does the problem occur when you use another computer and copy of Lightroom? If not, simply reinstall.",
      "link": "https://www.l-camera-forum.com/topic/294372-m-240-vs-adobe-lightroom/?tab=findComment&comment=3685737"
    },
    {
      "autor": "Eastgreenlander",
      "posts": "295 posts",
      "date": "06/11/2016 08:26  PM",
      "content": "I still want an M-D, despite even that I found myself in a situation the other day when the M-P's live view on the LCD was the perfect tool for a particular photo. I don't find myself in such situations very often, but even beyond that it's simply unimportant to me that every possible photo I point my camera to capture has to be good. There are an infinity of photo opportunities in the world. I'm content to enjoy the ones I attempt that work out as I envisioned. Handling the SL and then picking up the M-P, I would very much appreciate the additional room for my fingers on the camera that the M-D affords. G A digital camera is certainly a benefit to quickly check if you get what you wanted. I need this for landscape images. But for street photography I have found out in my own experience what this can become a nuisance because I then begin to rely on the LCD and then change my style of shooting images, on the fly. I instantly get fustrated when I see that i did not get the image I wanted to, on the LCD and this disrupts my further image shooting instead on concentrating on take the next photo. I've stopped taking images wide open and I now stop down as much as I can in street photography(and family photos). I now concentrate on content instead of bokeh and this has really openned up a new world for me. Shooting analogue Leica MP is, in many ways, a relief. I disconnect my self from the instantaneous age. We want everything instantaneous. With analogue -----> I !!!  accept -----> I !!!  cannot see what -----> I !!! 've shot and -----> -----> I !!!  develope !!!  and scan months after -----> I !!!  taken the image. This really helps me to visualise and concentrate how to take a photograph and the next photo. Its always a pleasant surprise when I see I've nailed a photo I did not remembered taking. Edited June 11, 2016 by Eastgreenlander",
      "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/?tab=findComment&comment=3060137"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "07/02/2019 08:13  PM",
      "content": "Never heard of -----> -----> DIY !!!  !!!  mapping for :Leica...",
      "link": "https://www.l-camera-forum.com/topic/298885-mapping-firmware-for-m240/?tab=findComment&comment=3770577"
    },
    {
      "autor": "feven0816",
      "posts": "7 posts",
      "date": "07/02/2019 08:55  PM",
      "content": "36 minutes ago, jaapv said: Never heard of -----> -----> DIY !!!  !!!  mapping for :Leica... i saw people got it from M10 forum. do you know how much Leica US will charge for it?",
      "link": "https://www.l-camera-forum.com/topic/298885-mapping-firmware-for-m240/?tab=findComment&comment=3770602"
    },
    {
      "autor": "lenspeeper",
      "posts": "48 posts",
      "date": "07/04/2019 10:57  PM",
      "content": "IMO, send it to Leica. Some things are ok to -----> -----> DIY !!!  !!! , but not an M240. Mess it up and you'll have a very expensive paperweight.",
      "link": "https://www.l-camera-forum.com/topic/298885-mapping-firmware-for-m240/?tab=findComment&comment=3771889"
    },
    {
      "autor": "feven0816",
      "posts": "7 posts",
      "date": "07/05/2019 03:42  PM",
      "content": " 16 hours ago, lenspeeper said: IMO, send it to Leica. Some things are ok to -----> -----> DIY !!!  !!! , but not an M240. Mess it up and you'll have a very expensive paperweight. yea, i found out they only send the firmware to M10, NOT for M240. I just sent the camera to NJ this morning.",
      "link": "https://www.l-camera-forum.com/topic/298885-mapping-firmware-for-m240/?tab=findComment&comment=3772256"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "01/14/2019 01:26  PM",
      "content": "The sneeze would have to be pretty impressive to knock a rangefinder out of alignement (not a big deal, easily corrected locally if not in -----> -----> DIY !!!  !!! ), but the M240 has been improved in this respect. The only (minimal) hazard of transport by air might be a hot pixel line.",
      "link": "https://www.l-camera-forum.com/topic/293271-how-sturdy-robust-is-the-m240-compared-to-the-m9/?tab=findComment&comment=3664308"
    },
    {
      "autor": "Me Leica!",
      "posts": "65 posts",
      "date": "01/14/2019 01:49  PM",
      "content": " 20 minutes ago, jaapv said: The sneeze would have to be pretty impressive to knock a rangefinder out of alignement (not a big deal, easily corrected locally if not in -----> -----> DIY !!!  !!! ), but the M240 has been improved in this respect. The only (minimal) hazard of transport by air might be a hot pixel line. Ah, yes. I've heard about these hot pixel lines caused by cosmic radiation or whatever. I had the impression that CCDs were more susceptible to this than CMOS sensors. If such a thing happens, does that involve the legendary x-month round trip to Leica HQ, or is there a DIY / easy fix for it?",
      "link": "https://www.l-camera-forum.com/topic/293271-how-sturdy-robust-is-the-m240-compared-to-the-m9/?tab=findComment&comment=3664321"
    },
    {
      "autor": "105012",
      "posts": "486 posts",
      "date": "02/02/2019 01:21  PM",
      "content": "I’ve been gluing rear caps together for my Fuji and Leica kits for some years, really speeds up lens changes. I’ve progressed to my own design of dual sided lens cap which I 3D print (Leica ones are in red for obvious reasons, including standing out in the bag!). The 3D model -----> -----> I !!! ’ve designed !!!  is programmable so I can print any depth, super shallow or whatever... Edited February 2, 2019 by 105012",
      "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/?tab=findComment&comment=3676416"
    },
    {
      "autor": "MarkP",
      "posts": "9,144 posts",
      "date": "03/23/2013 10:35  PM",
      "content": "Really like it Mark. Did you use a color filter? thanks....Peter Thanks Peter & Tri, forgot to write that I did NOT use a colour filter. I think it's really important to realise that contrary to what many write here that colour filtration is not necessarily required to get outstanding photographs from this camera. I find that I can get overall excellent control of local luminance and tones in Monochrom files in Photoshop, including the use of selective highlight,mid-tone,shadow burning and dodging. For this photograph -----> -----> I !!!  did create !!!  a separate layer to work on the sky, but regardless -----> I !!!  would have done this with an M9 file. I'm working on a few more photographs from this trip and will post them later today. Regards, Mark Edited March 23, 2013 by MarkP",
      "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/?tab=findComment&comment=2280287"
    },
    {
      "autor": "thebarnman",
      "posts": "552 posts",
      "date": "07/21/2013 07:45  AM",
      "content": " 50mm--img--  It appears to me (though very VERY slightly,) the trunk of the tree on the very bottom left can be seen easier on the Flickr site when compared to the Leica site. It might have everything to do with Flickr's black boarder making it easier to see in the dark areas. But still, -----> -----> I !!!  created !!!  a copy from the both sites and viewed them in Window's Picture and Fax Viewer. In Window's Picture and Fax Viewer, it was just as hard to see the base of the trunk as of viewing it from Leica's site. So it seems something is going on with the Flickr site. (More detail) when viewing the image from Flickr, the dirt surrounding the most right bottom part of the (curved) tree trunk appears to be somewhat lighter making it a bit easier to see the trunk. I even took a close look at the right of the trunk where it meets up to the right edge of the image, the image seems to be lighter around that very edge. Not so with the version on the Leica site. And even not so when I view both versions from Window's Picture and Fax Viewer. The effects are the same when using different web browsers. I have to conclude Flickr's site must have some kind of effect (very very slightly) with the lower level black level, being ever so slightly elevated. Either that or every other viewer is burying it's blacks (just very slightly.)",
      "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/?tab=findComment&comment=2379102"
    },
    {
      "autor": "rim_light",
      "posts": "258 posts",
      "date": "02/09/2020 10:18  PM",
      "content": "41 minutes ago, Likaleica said: May I ask what else did you use here? The plane of focus doesn't make sense, or did you use software to create the out-of-focus areas? The only thing I did was a small amount of rotating. Why do you mean -----> -----> I !!!  create !!!  oof areas? (And why should I?)",
      "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/?tab=findComment&comment=3909749"
    },
    {
      "autor": "Likaleica",
      "posts": "1,645 posts",
      "date": "02/09/2020 11:42  PM",
      "content": "1 hour ago, rim_light said: The only thing I did was a small amount of rotating. Why do you mean -----> -----> I !!!  create !!!  oof areas? (And why should I?) I'm just curious how, in this picture for example, the focus seems to fall off as expected, then at the far end the Hella signs are pretty well focused. It's a nice look, kind of like a view camera with a front standard swing or a lens baby. I'm just wondering how you were able to achieve this with the Noctilux, or if it was some post-processing. Doesn't matter, just curious. Nice picture.",
      "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/?tab=findComment&comment=3909808"
    },
    {
      "autor": "EoinC",
      "posts": "6,496 posts",
      "date": "09/08/2016 10:09  AM",
      "content": "Can anyone please oblige with more photo's shot with the Super Angulon 21mm f/4? -----> -----> I !!! 'm developing !!!  severe gas for adding it to my Typ246. Thanks, Eoin",
      "link": "https://www.l-camera-forum.com/topic/193239-old-lenses-on-the-monochrom-post-examples-here/?tab=findComment&comment=3108692"
    },
    {
      "autor": "james.liam",
      "posts": "2,413 posts",
      "date": "09/10/2016 03:08  PM",
      "content": "-----> -----> I !!! 'm developing !!!  severe gas for adding it to my Typ246. Thanks, Eoin Simethicone might help.",
      "link": "https://www.l-camera-forum.com/topic/193239-old-lenses-on-the-monochrom-post-examples-here/?tab=findComment&comment=3109922"
    },
    {
      "autor": "Steven",
      "posts": "3,799 posts",
      "date": "11/07/2021 06:49  PM",
      "content": "If anyone's interested to see, I just posted seventy photos I took with my M10M this week on my instagram story (link in signature). Once they disappear after 24 hours, -----> -----> I !!! 'll create !!!  a story highlight album called Dubai. I think the quality of the photos is much better on instagram than here on the forum.",
      "link": "https://www.l-camera-forum.com/topic/325798-colour-photographer-buys-an-m10-monochrom-image-thread-not-open/?tab=findComment&comment=4309051"
    },
    {
      "autor": "mon10a",
      "posts": "35 posts",
      "date": "11/07/2021 10:07  PM",
      "content": "3 hours ago, Steven said: If anyone's interested to see, I just posted seventy photos I took with my M10M this week on my instagram story (link in signature). Once they disappear after 24 hours, -----> -----> I !!! 'll create !!!  a story highlight album called Dubai. I think the quality of the photos is much better on instagram than here on the forum. Steven, these are terrific shots. Many of them are great on their own and together the collection tells a very interesting story of your trip. Thank you for sharing. I, for one, would not be sad to have taken them. Looking forward to seeing more from your M10M! Edited November 7 by mon10a Typo",
      "link": "https://www.l-camera-forum.com/topic/325798-colour-photographer-buys-an-m10-monochrom-image-thread-not-open/?tab=findComment&comment=4309177"
    },
    {
      "autor": "chasdfg",
      "posts": "186 posts",
      "date": "11/08/2021 03:01  AM",
      "content": " 7 hours ago, Steven said: If anyone's interested to see, I just posted seventy photos I took with my M10M this week on my instagram story (link in signature). Once they disappear after 24 hours, -----> -----> I !!! 'll create !!!  a story highlight album called Dubai. I think the quality of the photos is much better on instagram than here on the forum. I particularly liked the one on the beach with the man doing pushups and the three women walking by and the one of your son on the beach lying with the waves. Don't \"FOMO\" or wish a picture was shot with colour! the b&w shots are compelling in themselves and even more so when you have a consistent body of work all in b&w (body of work like your IG story, with a series of shots in b&w which conveys intent in the choice of lack of colour/the medium and also sets a mood over those series of shots). I used to feel like some of my pics could have done better in colour or wished I had a colour camera with me to take pictures which would only do well with a colour camera (e.g. yellow lines on the road, with yellow flowers or leaves from fall, plus a person wearing yellow walking by). Eventually I just decided to focus on the camera being a memory recording device, which for many of us is likely the case, albeit one which may help me develop a different eye of things, take a fresh approach to my photography, and learn how to process pure b&w files. As a memory recording device, it serves that purpose perfectly fine. And for professional photographers who have developed a unique style of their photos (both in composition and processing), or any photographer for that matter, a monochrom allows them to set themselves further apart (like Alan Schaller). A monochrom is a bold camera to choose to own. When you buy one, and every time you pick it up, you're making that choice to limit (and \"liberate\") yourself. Go boldly!",
      "link": "https://www.l-camera-forum.com/topic/325798-colour-photographer-buys-an-m10-monochrom-image-thread-not-open/?tab=findComment&comment=4309276"
    },
    {
      "autor": "Steven",
      "posts": "3,799 posts",
      "date": "11/08/2021 09:31  AM",
      "content": "6 hours ago, chasdfg said: I particularly liked the one on the beach with the man doing pushups and the three women walking Funny story. I was shooting by the hip, wide open, guessing the distance. I actually missed it, and if you look well the entire scene is slightly out of focus. But I liked the photo enough to edit it and post it, because the story works. Once again, it's all that matters! Story, story, story. All the rest looses its importance. 6 hours ago, chasdfg said: Don't \"FOMO\" or wish a picture was shot with colour! the b&w shots are compelling in themselves and even more so when you have a consistent body of work all in b&w (body of work like your IG story, with a series of shots in b&w which conveys intent in the choice of lack of colour/the medium and also sets a mood over those series of shots). I used to feel like some of my pics could have done better in colour or wished I had a colour camera with me to take pictures which would only do well with a colour camera (e.g. yellow lines on the road, with yellow flowers or leaves from fall, plus a person wearing yellow walking by). Eventually -----> I !!!  just decided to focus on the camera being a memory recording device, which for many of us is likely the case, albeit one which may help -----> me develop !!!  a different eye of things, take a fresh approach to my photography, and learn how to process pure b&w files. As a memory recording device, it serves that purpose perfectly fine. And for professional photographers who have developed a unique style of their photos (both in composition and processing), or any photographer for that matter, a monochrom allows them to set themselves further apart (like Alan Schaller). Thank you, this is great. 6 hours ago, chasdfg said: A monochrom is a bold camera to choose to own. When you buy one, and every time you pick it up, you're making that choice to limit (and \"liberate\") yourself. Go boldly! I came home from my trip on Saturday, put in on down on the shelf and embraced my colour cameras that I had left behind and was so happy to be reunited with. But somehow, the M10M keeps staring at me from the shelf, and I'm looking back at it like a mistress. I lust to pick it up again....",
      "link": "https://www.l-camera-forum.com/topic/325798-colour-photographer-buys-an-m10-monochrom-image-thread-not-open/?tab=findComment&comment=4309370"
    },
    {
      "autor": "LeicaR10",
      "posts": "597 posts",
      "date": "08/14/2020 10:22  PM",
      "content": " Jplomley, I use the M10-M for my commercial landscape photography business. The camera and M lenses are superb. My clients are very demanding for detail and very large prints. -----> -----> I !!!  create !!!  4' X 6' B&W prints and larger and have nothing but very high praise for the camera and M lenses. Tonal range and detail is often breath taking according to my clients. The M10-R is the same way. I found my clients did not like the \"too perfect\" rendering of the excellent SL2 and SL lenses and wanted more natural rendering and color. When I did use M lenses on the SL2, I did not stop down below f/8 for highest resolution, only when I needed more DOF. BTW, I sold the SL2 system and now only use the M10-M + R and S3 systems. My business requires that I photograph landscapes in very remote and often environmentally harsh conditions. The S3 does the bulk of my work for very large and detailed print requirements from my clients. Only when I am challenged by the remoteness of the hike do I take the M cameras. In all cases, it gets down to your personal tastes and expectations what your genre of photography and how you want to create your photographs. I hope this helps. r/ Mark",
      "link": "https://www.l-camera-forum.com/topic/312315-m10m-for-landscapes/?tab=findComment&comment=4027250"
    },
    {
      "autor": "Ken Abrahams",
      "posts": "701 posts",
      "date": "02/12/2020 10:34  PM",
      "content": "My initial highlight adjustment in LR is -100 for most of my images, that is the only exposure adjustment I make in LR apart from sharpness and lens profile etc. When image opened in PS -----> -----> I !!!  create !!!  a curve layer and click auto. This re calibrating of the image curve is the basis for all the adjustments to the file which follow. ND filters and raised iso may be one work around and a way to fully control exposure highlights although I am not sure I would use that method. Sounds good for some situations.",
      "link": "https://www.l-camera-forum.com/topic/306355-m10m-true-base-iso/?tab=findComment&comment=3911856"
    },
    {
      "autor": "nico4444",
      "posts": "80 posts",
      "date": "02/15/2021 05:03  PM",
      "content": "-----> I !!! 'm strictly talking portraiture and in my experience dealing with normal lighting, a longer focal length onto someone's face does not immediately allow me to achieve the zone system unless -----> I !!!  have the necessary gray tones in the blurred background and/or -----> I !!!  position myself or the person in a way such that -----> -----> I !!!  create !!!  visible shadows. This is certainly possible in a studio environment, but I'm asking street/casual photographers who shoot B&W with longer focal lengths and if they find the zone system easy to work with. Apologies for the confusion.",
      "link": "https://www.l-camera-forum.com/topic/318032-longer-focal-lengths-in-bw/?tab=findComment&comment=4141733"
    },
    {
      "autor": "jwillyf",
      "posts": "77 posts",
      "date": "12/24/2020 04:18  PM",
      "content": " I have a Type 246 and have noticed that the aperture metadata is not matching that on the lens. Generally the metadata is recording aperture as 1 stop higher than the lens setting. For example f4 on the lens is recorded as f4.8 on the metadata, and f11 as f13. In the menu, lens recognition is set to automatic. This is on a coded Summicron 50 mm f2 serial no 2331077. -----> I !!!  was thinking of -----> D-----> I !!! Y !!!  coding a Voigtlander Ultron 35 mm f1.7 and an Elmarit 90 mm f2.8. Any ideas on the discrepancies on the Summicron. Thanks",
      "link": "https://www.l-camera-forum.com/topic/316385-aperture-metadata-not-matching-lens-setting/?tab=findComment&comment=4105195"
    },
    {
      "autor": "Jeff S",
      "posts": "18,688 posts",
      "date": "12/11/2020 12:14  AM",
      "content": "Even though some forum folks are proficient at -----> -----> DIY !!!  !!! , Sherry Krauter, who is a well respected US Leica repair specialist, does not work on digital Ms due to the prohibitively expensive equipment needed to ensure close tolerances. Just saying. Jeff",
      "link": "https://www.l-camera-forum.com/topic/315978-leica-rf-alignment-in-norway-or-diy/?tab=findComment&comment=4096228"
    },
    {
      "autor": "Sjz",
      "posts": "367 posts",
      "date": "09/22/2020 06:43  PM",
      "content": "I could be overthinking things (although not sure how to interpret the above tables) could it be as simple as the M10M offers an unusual amount of recovery from the deep shadows, so people bring that detail out, ‘flattening’ the image? On reflection ‘flattening’ is not the right word, ‘creating a different style of image” would be more accurate. People can of course use curves or sliders to show far more of their image as black. i have found the Raw files look less ‘flat’ when I have been using colour filters. (-----> i !!!  do know that post-----> i !!! ng my photos here and rece-----> i !!! v-----> i !!! ng comments helps -----> me develop !!!  my th-----> i !!! nk-----> i !!! ng, and hopefully the end result.)",
      "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/?tab=findComment&comment=4050513"
    },
    {
      "autor": "Ken Abrahams",
      "posts": "701 posts",
      "date": "01/30/2020 04:41  AM",
      "content": "I have the M10M but I wouldn't be letting the M9M go. The M9M is unique in that its CCD sensor and lower megapixel sensor renders much nicer textures for the images I take on the street. Its harder to achieve the same exaggerated grain quality on the M10M in my assessment so far. The M10M is a very different camera with extremely high quality images at high ISO values, along with better functions such as quiet shutter. The M9M shutter sound is almost rude in comparison. There is no point trying to emulate the same quality of images possible with the M9M and instead the M10M offers a whole new way to capture and process images to one's individual styles of photography. -----> I !!!  am loving the M10M and with further explorations -----> -----> I !!!  will develop !!!  a workflow that this camera along with my creativity is suited to. Its kind of a co creation process between camera and self, a personal development project in my view.",
      "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/?tab=findComment&comment=3902397"
    },
    {
      "autor": "Jeff S",
      "posts": "18,688 posts",
      "date": "06/06/2020 03:01  AM",
      "content": "I’m not advocating or prescribing any specific tone curve. -----> I !!!  couldn’t care less what comes out of camera or LR, as -----> -----> I !!!  create !!!  my own curve(s) as desired (never flat) for any given pic or group of pics. I don’t own an M10 Monochrom, content to use the original Monochrom, but I see no reason why one can’t save a preset in LR Classic and apply it. Jeff Edited June 6, 2020 by Jeff S",
      "link": "https://www.l-camera-forum.com/topic/310250-m10m-lightroom-auto-adjustment/?tab=findComment&comment=3988030"
    },
    {
      "autor": "kengai",
      "posts": "128 posts",
      "date": "04/04/2020 09:13  AM",
      "content": " -----> I !!! 'm rediscovering the pleasure of black and white, going back to the years when -----> -----> I !!!  was developing !!!  the TR-----> I !!! -X exposed at 1600/3200 ASA and in print -----> I !!!  was still pulling for very contrasted blacks and whites. Now I'm thinking about whether to convert in b&w the M10 files or make some sacrifice to buy a used M246?",
      "link": "https://www.l-camera-forum.com/topic/308172-bw-passion-is-back/?tab=findComment&comment=3946431"
    },
    {
      "autor": "giordano",
      "posts": "4,400 posts",
      "date": "04/25/2010 03:08  PM",
      "content": "WRONG - It's the adjustment tool to allow you to hold the arm easier.<snip>WRONG - No bending here mate. <snip> That in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. According to the only factory manual I have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. All that Jaap got wrong is precisely what this adjustment is for. In order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. If it isn't, there are two possible sources of inaccuracy, though I don't know which is more important. One is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. If the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. The official use of the bending tool is in conjunction with a special 3-position gauge that mimics a lens focused at 10m distance whose cam contacts the roller at top, centre and bottom of the roller's width. If the rangefinder image remains stationary as the gauge is moved between its three positions, this adjustment is correct. If it moves, the bending tool must be used. Clearly this is (a) unlikely to go out of adjustment in normal use and (--img--  not something one can adjust without a special gauge, so it's outside the scope of -----> -----> DIY !!!  !!!  rangefinder adjustment. I have no idea whether or not the bending tool is also useful when adjusting the arm length and roller cam. My source is the official Repair Training Program manual for \"Camera Set, Still Picture KS-15(4)\", a US military version of the M2 with M4 rapid loading takeup spool. The arm on my M8 looks exactly the same as the one in the diagrams in this manual. FWIW there are a total of five adjustment points in this part of the rangefinder, although only the two Julian has explored are likely to be needed in ordinary DIY work.",
      "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/?tab=findComment&comment=1305260"
    },
    {
      "autor": "Julian Thompson",
      "posts": "600 posts",
      "date": "04/26/2010 07:46  AM",
      "content": "Jaap. Please accept my apology. You are right and I was wrong. There is a bending tool - you are quite right. This does not alter the procedure for -----> -----> DIY !!!  !!!  adjustment - you don't bend anything to adjust the mid focus - actually bending that arm would only be necessary if for some reason the roller was not perpendicular to the lens - ie a manufacturing defect - it's a perpendicular adjustment of the roller, not a focussing one in the sense that we've been discussing here. So the instructions must be revised - you need to check to make sure the roller is exactly perpendicular to the lens mount before you begin. I have checked both my M's and the roller is exactly perpendicular.",
      "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/?tab=findComment&comment=1305903"
    },
    {
      "autor": "EdricBF",
      "posts": "25 posts",
      "date": "06/12/2020 07:16  PM",
      "content": "My pretty new M9 fell about 2ft to the floor and its RF settings suffered (not as much as myself, for that matter...), both vertical and horizontal. -----> I !!!  pondered the few (and expensive) pro options -----> I !!!  have here in South America and decided to follow this wonderful thread (and links) suggestions for -----> D-----> I !!! Y !!!  alignment. I was afraid about pivots, arms etc. but I came across this: \"fixing lateral rangefinder misalignment is, most of the time, simply adjusting the roller for infinite and everything falls in place...\", or something like that. Using the 2mm wrench, it only took a few very small torsions applied to the roller's hex screw in both directions to have my 50 and 90 Summicrons aligning the images at infinite again. Taking pictures of objects at different distances at f/2 showed that the infinite adjustment was all my camera needed for other distances. No back or front focus so far, at least with those lenses. I was afraid I could screw up something, but it was very direct and simple, actually. I decided no to go to the vertical alignment at this time, since it is very small. Cheers",
      "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/?tab=findComment&comment=3992238"
    },
    {
      "autor": "dllewellyn",
      "posts": "68 posts",
      "date": "09/15/2020 03:54  PM",
      "content": "R: Brian \"CCD's are much more sensitive to IR than a CMOS sensor, roughly 10x. \" Nope. 100% wrong there. Both made of silicon. CCD's a cheaper to make than CMOS but use more power than CCD and have slower readouts. Early CMOS sensors used a lot of the sensor space for the circuits so pixel size was smaller which means noise was greater (smaller photon wells = less dynamic range). CMOS sensors cost more to design but are less expensive in the long run. For a long time now, when you look at the chip under a microscope, you can see the pixels are edge-to-edge. And with Back Side Illuminated (BSI) sensors, now even more so. When you buy glass from Schott (and I do), you can specify, within reason, whatever thickness you want. If Leica/Kodak/Truesense/On Semi wanted to by 0.5mm glass, it isn't a problem. And they could have easily added coatings to change the UV and IR response. It's not that big of a deal. Plenty of companies that offer coating services and you can model some pretty complex response curves. And if they had added the coatings, they wouldn't have had the 'corrosion'. Maybe the datasheet specified coatings, but, at least for a lot of cameras, the coatings aren't there. We were the first company that figured out how to re-purpose a consumer camera for vegetation remote sensing by making a filter that passed plant absorption (blue or red light) to one color channel and a plant reflection channel (NIR) to another color channel. Plants reflect the NIR because the longer, lower energy wavelengths don't have enough energy to support photosynthesis. So if you look at how a plant is absorbing and reflecting light, you can determine things like biomass, plant health, etc. We also knew how to measure the camera spectral response so we knew how the RGB channels opened and close in the visible and NIR. It turns out that the red channel is open in the red and stay open throughout the NIR while the blue and green channels don't open up until around 800nm. So -----> -----> we !!!  designed !!!  a filter that passed visible blue and green light, blocked red light, passed NIR from 680nm to 800nm and then blocked light above 800nm - and that was one filter on one piece of glass. That way, only the red channel saw NIR. Once you had a picture with that information, you could run the picture through a computer program to calculate things like NDVI (Normalized Difference Vegetation Index).",
      "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/?tab=findComment&comment=4046433"
    },
    {
      "autor": "BrianS",
      "posts": "352 posts",
      "date": "09/16/2020 12:00  AM",
      "content": " 49 minutes ago, jaapv said: Which would not be a problem - The user would need to use IR cut filters in front of the lens, which is no hardship. The only drawback would be the need to use flat field correction for certain WA lenses. We've used Hot Mirror filters for years, with our M8 and with some lenses on the M9. I have about 12 of them. The M8 drew much criticism over the need for external filters and the IR problem. Leica/ONSEMI avoided this completely by using BG55 glass, which is much more stable environmentally than S8612. The protective coating of the S8612 as used in the M9 did not stand up to the job of preventing corrosion. Dan claims that the Data Sheets published for years, revised a few times- are all wrong- that the M9 sensor's cover glass has no protective coating at all. If that had been the case, as per the S8612 Data Sheet- the corrosion problem would have been much worse than it was. Schott states that unprotected S8612 glass will corrode after a few months. My M9 went 7 years. Dan's article on MaxMax labeling Kodak and Leica as \"Stupid, Stupid, Stupid\" does not identify the glass, which is specified in the Datasheet. The Data Sheet also states that the cover glass is provided by Schott, and the performance of the cover glass in the Data Sheet is from Schott. I believe the Data Sheets from Schott and Kodak/TrueSense/ONSEMI. I work with groups that make custom glass, and make custom sensors. To state that silicon sensors are all the same was just way too much. A couple of years ago one of my coworkers needed to make a low-cost VNIR sensor, I went through the data sheets for a number of CMOS and CCD COTS sensors. The IR had been bred out of the CMOS sensors of the time, Hamamatsu CCD's had 10dB higher sensitivity in the IR. All were Silicon sensors. Same with ONSEMI CCD's without IR absorbing glass, better IR- but the emphasis had been placed on Visible. The spectral response of my DCS200ir is about the same in IR as Visible. Kodak started using Indium Tin Oxide to extend blue response. Once again- follow a technology for 40 years, you pick up some things. I hack lenses, known for converting Sonnars to Leica mount and adjusting Jupiters. That's lens hacking for relaxation.From working in an Optical Research Lab for over 40 years. -----> I !!! 'm a Lens Hacker, but had two optical engineers work for -----> me to design !!!  the real stuff. Kodak came to us for IR technology back in the 80s. Seemed fair that I give them a call in 2009 and ask for a Monochrome M9. I actually asked for a full-spectrum M9, told them I'd buy 6 of them. It would have been under $50K for all of them. Way cheaper than Sensors Unlimited stuff. The Kodak Engineer told me that had a meeting with Leica coming up, and they would discuss it. Kodak had wanted to do a Monochrome M8 to pick up where the DCS760m had failed- due to a banding problem. Preaching to the choir. Once I got the M Monochrom, I had to get the shim for an F1.5 J-3 and Sonnar within 0.01mm. I have about 20 5cm F1.5 Sonnars and J-3's in my collection. Past 100 lenses in Leica mount now. For the M Monochrom: the shims are optimized for different color filters. Deep color filters shift the focus towards infinity, enough to have to adjust the shim. 0.1mm is far off for a lens. I no longer do lens work- Skyllaney in the UK offers the service professionally. Gone are the days that I'd convert a Sonnar to Leica mount for $25 and left-over parts. Some of those Sonnars that I converted sell for a lot these days. All a clever plan to shoot with and take apart hundreds of lenses. Edited September 16, 2020 by BrianS",
      "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/?tab=findComment&comment=4046688"
    },
    {
      "autor": "TomB_tx",
      "posts": "3,204 posts",
      "date": "02/19/2021 01:29  AM",
      "content": "Leica also didn't replace just the sensor, as they bought the sensors as part of the main circuit board assembly - they just replaced the board/sensor assembly. Such manufacturers are really \"assemblers\" that outsource circuit modules to companies that specialize in that technology. This isn't to criticize Leica, as they come from an optical/mechanical technical background, not based in modern electronics. Trusting suppliers to use their existing expertise is often a better choice than trying to develop the capability themselves. -----> -----> I !!!  developed !!!  automated test equipment for a company without expertise to manufacture it, and sourced the actual product manufacture to companies that provide such service. When the original Canon was developed the company had precision mechanical expertise, bot not optics expertise - so they sourced rangefinders and lenses to Nippon Kogaku - before that company developed their own camera line (Nikon). Later Canon bought an optics company. Leica is still a fragile company who needs to specialize in what they do well.",
      "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/?tab=findComment&comment=4144310"
    },
    {
      "autor": "boojum",
      "posts": "302 posts",
      "date": "02/19/2021 04:31  AM",
      "content": "2 hours ago, TomB_tx said: Leica also didn't replace just the sensor, as they bought the sensors as part of the main circuit board assembly - they just replaced the board/sensor assembly. Such manufacturers are really \"assemblers\" that outsource circuit modules to companies that specialize in that technology. This isn't to criticize Leica, as they come from an optical/mechanical technical background, not based in modern electronics. Trusting suppliers to use their existing expertise is often a better choice than trying to develop the capability themselves. -----> -----> I !!!  developed !!!  automated test equipment for a company without expertise to manufacture it, and sourced the actual product manufacture to companies that provide such service. When the original Canon was developed the company had precision mechanical expertise, bot not optics expertise - so they sourced rangefinders and lenses to Nippon Kogaku - before that company developed their own camera line (Nikon). Later Canon bought an optics company. Leica is still a fragile company who needs to specialize in what they do well. If Leica can sub out construction, which they do, why can't they sub out repair? It just has the appearance of lackluster customer support no matter how you characterize it. Perhaps I expect too much from Wetzlar. As manufacturers of what is purported to not only be the first small camera but also the best this seems to me to be inappropriate. But, as I say, I must be mistaken and unable to appreciate the complexities of the manufacture, sale and support of 35mm format cameras. I am hopeful that sometime soon the company can overcome its fragility and become able to make and repair cameras to a higher degree than now. I'd hope that Wetzlar's fifteen years in the digital business will be a substantial foundation for future successes and stability. Yes, one can only hope. Perhaps they can borrow from the electro-optical knowledge of the microscope division which is quite sophisticated and under the same roof. In the meantime fortunately there is competent after-market repair available to solve the disappointments of limited factory support.",
      "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/?tab=findComment&comment=4144345"
    },
    {
      "autor": "Ko.Fe.",
      "posts": "2,868 posts",
      "date": "02/19/2021 04:58  AM",
      "content": "3 hours ago, TomB_tx said: Leica also didn't replace just the sensor, as they bought the sensors as part of the main circuit board assembly - they just replaced the board/sensor assembly. Such manufacturers are really \"assemblers\" that outsource circuit modules to companies that specialize in that technology. This isn't to criticize Leica, as they come from an optical/mechanical technical background, not based in modern electronics. Trusting suppliers to use their existing expertise is often a better choice than trying to develop the capability themselves. -----> -----> I !!!  developed !!!  automated test equipment for a company without expertise to manufacture it, and sourced the actual product manufacture to companies that provide such service. When the original Canon was developed the company had precision mechanical expertise, bot not optics expertise - so they sourced rangefinders and lenses to Nippon Kogaku - before that company developed their own camera line (Nikon). Later Canon bought an optics company. Leica is still a fragile company who needs to specialize in what they do well. Zeiss recently came out with giant FF P&S. I doubt it has something to do with original Zeiss. Leica has re-branded Panasonic cameras and Meitz flashes. It could be extended. If not already. Somehow Q is using Panasonic batteries.",
      "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/?tab=findComment&comment=4144349"
    },
    {
      "autor": "adan",
      "posts": "10,793 posts",
      "date": "10/03/2021 05:57  PM",
      "content": "On 9/25/2021 at 10:39 AM, haikos said: In the m9 series cameras, I normally try to use lens profile that closely matches design-wise (on paper) the lens I happen to be using and this, when I actually remember to change the profile after a lens change. That works. I use 35mm Summilux pre-ASPH coding/profile for the very-similar 35 f/1.4 Nokton I/II, and it looks great. One can also \"zero in\" on the best profile by trying ALL the menu options for a given focal length, and seeing if any one is noticably better. It should be noted that the only profiled correction done in-camera is for corner color stains and/or some vignetting, mostly with <50mm lenses. Distortion and such are not corrected by the camera - but having the lens type listed in the EXIF data allows post-processing software (PS/LR, C1, DxO) to make additional corrections (e.g. distortion, color aberrations). Note also that C/V lenses (and some Zeiss ZMs) can be coded semi-permanently with black pen/paint - unlike Leica's lenses, they have a recessed channel machined into the rear face of the lens mount that will prevent -----> -----> DIY !!!  !!!  coding from being rubbed off with use.",
      "link": "https://www.l-camera-forum.com/topic/324865-in-camera-lens-profiles/?tab=findComment&comment=4285987"
    },
    {
      "autor": "dhc905",
      "posts": "10 posts",
      "date": "01/25/2021 07:01  PM",
      "content": " I got the SD card locked error randomly after putting in the same SD card I've always used with my M9. -----> I !!!  looked here for -----> D-----> I !!! Y !!!  fixes, tried everything from new battery, on/offs, air spraying the SD card socket, ordering new SD cards. Nothing worked. I then took it to the Leica store, and the great service associate there plugged in her personal card and voila, it seemed to magically fix everything. I immediately bought the same SD card, plugged it in, and it again didn't work. A few battery/SD card swaps later it had reverted back to SD Card Locked no matter what we did. Camera was off to New York. Received notice today that \"The Main Circuit Board\" needs to be replaced and is NLA. Would love to retain my camera (last time it was in service I got the latest and greatest M as a loaner and appreciated the functionality, but I still loved my camera) if there's anyway...",
      "link": "https://www.l-camera-forum.com/topic/317343-dreaded-sd-card-locked-error-now-my-camera-is-junk/?tab=findComment&comment=4125506"
    },
    {
      "autor": "Ko.Fe.",
      "posts": "2,868 posts",
      "date": "01/19/2021 04:51  PM",
      "content": "12 hours ago, boojum said: No. Should I? If they have more problems that is awful. Stable, reliable camera electronics are a fact. I have old Japanese cameras which work fine, like a Pentax K1000 and Pentax ME Super plus some old Sony digitals. I hope the M10's are not faulty but I now must check. Spaceba. I checked, few weeks ago. First four pages, back then, were with faults reports. Not any different from M9 sub-forum, if not worse. I never seen anything like this on Canon DSLRs forum. But those are not Leica. And Leica is not even Olympus, where you could map out dead pixels by -----> -----> DIY !!!  !!! . I'm holding to my 220 M-E and if it will need update, I'll get something from M240 series. M10 price, quality issues are not for my pocket.",
      "link": "https://www.l-camera-forum.com/topic/317048-vertical-lines/?tab=findComment&comment=4121447"
    },
    {
      "autor": "Ko.Fe.",
      "posts": "2,868 posts",
      "date": "01/21/2021 11:54  PM",
      "content": "46 minutes ago, pippy said: I didn't have any error message, Ko.Fe.; the lenses, in each case, simply couldn't manage to focus nor allow the camera to shoot at all. Not even when set to Full Manual Mode. Having googled the issue I was surprised to see that my experience was hardly unique - and that's putting it mildly. Dozens of videos showing strip-down and rebuild 'fun' and having also searched for any possible replacement 'ribbons' I was (initially) surprised to discover that there were a great many sites supplying these very same ribbons - such is their propensity to failure. My camera bodies have been fine but as they are (in effect) my primary source of income they tend to be updated on a far more regular basis than my Leica M bodies (no kidding!) and so there are no meaningful nor comparable 'Long Term' studies from which I can make an assessment. Sorry. Philip. Where are even videos for how to replace shutter assembly by -----> -----> DIY !!!  !!!  on 5D! And shutters are available for very reasonable price. Even on eBay. Look what I have found on eBay for Leica EO2 error. https://www.ebay.com/itm/2PCS-New-Lens-Inner-Aperture-Flex-Cable-Ribbon-For-Leica-E02-Minilux-Camera-Part-/253939043314 Some good people, not Leica, stepped up. And as we know, another good people, not Leica, have stepped up for corroded cover glass on Leica M9 sensors. Who knows, if they could make exact replica of Leica Cron 35 v1 one day they will make M9 replica .",
      "link": "https://www.l-camera-forum.com/topic/317048-vertical-lines/?tab=findComment&comment=4122805"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "10/21/2020 07:27  PM",
      "content": " Not quite - that is when infinity is the only thing off. Which, admittedly is the most common problem, and a 5 minute -----> -----> DIY !!!  !!! . However, there are cases that a whole system needs calibration, including the lenses.",
      "link": "https://www.l-camera-forum.com/topic/314394-rangefinder-calibration-cost-in-uk/?tab=findComment&comment=4066383"
    },
    {
      "autor": "pgk",
      "posts": "11,657 posts",
      "date": "04/15/2020 03:48  PM",
      "content": "17 minutes ago, Shameetman said: Or is it possible to order those separate and diy? -----> I !!!  doubt it if for no other reason than because it involves some desoldering and resoldering of the hotshot connections which -----> I !!!  suspect Leica would consider beyond -----> D-----> I !!! Y !!! .",
      "link": "https://www.l-camera-forum.com/topic/308568-m9-still-going-strong/?tab=findComment&comment=3954374"
    },
    {
      "autor": "rivi1969",
      "posts": "813 posts",
      "date": "08/03/2019 01:27  PM",
      "content": "7 minutes ago, ianman said: Well, the first sentence was pretty clear but wrong as Jono was given wrong information, and I think the new one is not clear. It just adds confusion and doesn't add any real information. I would either leave out the text between parenthesis or write \"(2000 is very low)\". Jono was not giving wrong information. Leica Customer service told me the same thing about the M9 50,000 life expectancy. Funny that people in this forums know better than Leica itself about their products. “Expectancy” doesn’t mean they will suddenly die at click 50001. Quote from the email I got: ”The shutter have all less than 2000 shots. -----> -----> We !!!  design !!!  it to last for 50,000.” 🤔 Edited August 3, 2019 by rivi1969",
      "link": "https://www.l-camera-forum.com/topic/299868-m9-shutter-life-expectancy/?tab=findComment&comment=3790532"
    },
    {
      "autor": "Charadis",
      "posts": "86 posts",
      "date": "08/04/2019 05:57  AM",
      "content": "16 hours ago, rivi1969 said: Jono was not giving wrong information. Leica Customer service told me the same thing about the M9 50,000 life expectancy. Funny that people in this forums know better than Leica itself about their products. “Expectancy” doesn’t mean they will suddenly die at click 50001. Quote from the email I got: ”The shutter have all less than 2000 shots. -----> -----> We !!!  design !!!  it to last for 50,000.” 🤔 I got the same email mentioning this, which made me concerned at first. Having never owned a rangefinder before, it definitely leaves me wondering if a refurbed M9 should be my first",
      "link": "https://www.l-camera-forum.com/topic/299868-m9-shutter-life-expectancy/?tab=findComment&comment=3790961"
    },
    {
      "autor": "lct",
      "posts": "22,257 posts",
      "date": "01/13/2019 07:07  PM",
      "content": "9 hours ago, Naampje said: [...] positioning the dots was more what I meant to ask. My 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. -----> I !!!  don't know if the 28/1.4's flange has a recessed part for -----> D-----> I !!! Y !!!  coding either. It is not necessary per se but the dots may last longer this way. For positioning the dots, i use a Match Technical coding kit personally but it is now discontinued. Doesn't work with all lenses but worth a try if you can find one. Otherwise a DIY template can be found on the web together with instructions (links below). I have no experience with it though. http://www.bophoto.com/M8/2009-01-23-M-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html",
      "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/?tab=findComment&comment=3663965"
    },
    {
      "autor": "DandA",
      "posts": "189 posts",
      "date": "01/13/2019 10:40  PM",
      "content": "3 hours ago, lct said: My 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. -----> I !!!  don't know if the 28/1.4's flange has a recessed part for -----> D-----> I !!! Y !!!  coding either. It is not necessary per se but the dots may last longer this way. For positioning the dots, i use a Match Technical coding kit personally but it is now discontinued. Doesn't work with all lenses but worth a try if you can find one. Otherwise a DIY template can be found on the web together with instructions (links below). I have no experience with it though. http://www.bophoto.com/M8/2009-01-23-M-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html The 7artisans 28mm f1.4 at this juncture, does not have any coding pits nor a recessed part for the DIY coding not to rub off. Why no pits is a mystery but even more so, why no receesed part/ring surrounding the lens mount. Either one would have been helpful and with their having such with their 35mm f2, I don't see why this changed. The self calibration of front/back focusing with this lens is both easy and a wonderful idea nd wish all rangefinder lenses would incorporate this feature. The lens deserves the accolades it has received, especially at its price point. Dave (D&A)",
      "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/?tab=findComment&comment=3664104"
    },
    {
      "autor": "jdlaing",
      "posts": "9,345 posts",
      "date": "01/14/2019 01:13  AM",
      "content": "2 hours ago, DandA said: The 7artisans 28mm f1.4 at this juncture, does not have any coding pits nor a recessed part for the -----> -----> DIY !!!  !!!  coding not to rub off. Why no pits is a mystery but even more so, why no receesed part/ring surrounding the lens mount. Either one would have been helpful and with their having such with their 35mm f2, I don't see why this changed. The self calibration of front/back focusing with this lens is both easy and a wonderful idea nd wish all rangefinder lenses would incorporate this feature. The lens deserves the accolades it has received, especially at its price point. Dave (D&A) No coding pits as there is no Leica lens to match it to. It is different than the Leica 28mm corrections. Or so I’ve been told.",
      "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/?tab=findComment&comment=3664147"
    },
    {
      "autor": "antigallican",
      "posts": "503 posts",
      "date": "11/01/2017 12:47  PM",
      "content": " Hi, my M9 has drifted a bit out of adjustment. It is definitely the camera - I have several lenses and it focuses short of where the rangefinder is indicating on all of them. I was a bit disappointed when I took it to a well known London dealer and they just took a photo of a distant hoarding and said 'no that's fine.' Is there a good camera mechanic is the south of England who can get it dead right? I don't want to send it on holiday to Wetzlar for a month and in any case I'm not convinced a careless delivery man somewhere between here and Germany couldn't knock it out again as soon as they'd fixed it. -----> I !!!  know some people -----> D-----> I !!! Y !!!  but I would rather use a mechanic. Thanks for any info. John",
      "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=findComment&comment=3386390"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "11/05/2017 05:43  PM",
      "content": "Hi, my M9 has drifted a bit out of adjustment. It is definitely the camera - I have several lenses and it focuses short of where the rangefinder is indicating on all of them. I was a bit disappointed when I took it to a well known London dealer and they just took a photo of a distant hoarding and said 'no that's fine.' Is there a good camera mechanic is the south of England who can get it dead right? I don't want to send it on holiday to Wetzlar for a month and in any case I'm not convinced a careless delivery man somewhere between here and Germany couldn't knock it out again as soon as they'd fixed it. -----> I !!!  know some people -----> D-----> I !!! Y !!!  but I would rather use a mechanic. Thanks for any info. John This is just a matter of giving the roller a minimal twist with a 2 mm Allen Key. A few minutes DIY.",
      "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=findComment&comment=3389492"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "06/04/2018 11:22  AM",
      "content": "-----> I !!! 'm not 100% sure, but AFA-----> I !!! K the M9 still has the old method of adjusting vertically, i.e. by removing the red dot, softening the locking compound and adjusting by a special tool; can be bought on eBay for less than 50$ or made in -----> D-----> I !!! Y !!! . From the M240 onwards it is a 2 mm hex nut.",
      "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=findComment&comment=3531355"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "03/13/2018 10:04  PM",
      "content": "Slim. Chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. If the vertical is off it is a bit more elaborate but still quite doable in -----> -----> DIY !!!  !!! . The third point is a don't touch.",
      "link": "https://www.l-camera-forum.com/topic/282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands/?tab=findComment&comment=3480274"
    },
    {
      "autor": "Frase",
      "posts": "370 posts",
      "date": "03/13/2018 10:23  PM",
      "content": " Slim. Chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. If the vertical is off it is a bit more elaborate but still quite doable in -----> -----> DIY !!!  !!! . The third point is a don't touch. It takes more than 5-10 minutes even to adjust just close-up, especially on the M9 without live view. 50cm is quite a lot to be out by I've adjusted mine a few times but it was only out by 1cm ish at about 3m-4m. Its not a difficult job just a bit fiddly with a lot of trial and error. good luck",
      "link": "https://www.l-camera-forum.com/topic/282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands/?tab=findComment&comment=3480284"
    },
    {
      "autor": "Dougg",
      "posts": "484 posts",
      "date": "11/15/2012 02:55  AM",
      "content": "I am another left-eye-dominant right-hander; my optometrist tells me this is relatively uncommon. So I've always used my left eye on the viewfinder, and for vertical shots I rotate the camera right-side down. Then -----> -----> I !!!  developed !!!  a cataract in the left eye, and as it got progressively worse -----> I !!!  had to switch to using my right eye for photography. Eventually I had cataract surgery on both eyes, two years apart, and it turned out the viewfinder is clearer and sharper using my right eye (not wearing glasses while shooting), so I stayed using that one for framing/focusing. Some people are more strongly left- or right-dominant and have a harder time than I in making the switch... Edited November 15, 2012 by Dougg",
      "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=findComment&comment=2167159"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "10/05/2017 07:02  AM",
      "content": "You really should learn to clean your sensor yourself. It is a five-minute -----> -----> DIY !!!  !!!  job. Look in the FAQ at the top of this forum. It is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? You can take it into one of the many camerashops that offer this service whilst you wait as well.",
      "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=findComment&comment=3370644"
    },
    {
      "autor": "hellerkar",
      "posts": "14 posts",
      "date": "01/30/2015 07:34  PM",
      "content": " I have and continue to own Leica 8, 9, and M 240 cameras all of which I acquired when they were first launched. Each has its place and each has its strengths and weaknesses. Beauty is in the eye of the beholder, for sure, but I cannot recreate the \"look\" I have come to prefer from the source files of the M240. I find this most pronounced in pictures of people which is my most frequent and preferred subject matter. Others might not agree and might prefer the files they are getting or might think a compromise was needed to gain other advantages they needed or wanted.. Perhaps someone has a “secret sauce” in post processing that has not yet been shared and demonstrated….which may in fact be proprietary. Okay….but it has eluded me and has eluded others and not for want of trying. While I do not “like” change as much as I wish I did, this has never stopped me from pursuing and embracing it. -----> I !!!  think the M240 has great versatility and wonderful features as a camera but something changed not for the better for me in terms of the images -----> -----> I !!!  can create !!!  with it. I hoped that the letter would continue a positive, informed discussion not only among photographers/customers but also with representatives from Leica, too. I would never discourage someone's success or satisfaction with the tools, features, and, ultimately, images they prefer. In fact, I like to celebrate that. Peter, personally, deserves more credibility and respect for his findings than some of the responses that have been posted here exhibit. His work is astonishingly good and he has devoted a great deal of time and open-minded experimentation to this effort. I agree with the letter (that's why I signed it) and share an interest in further developing the CCD sensor technology…or frankly, any technology, that creates files I can turn into the kinds of images I have come to treasure from the M9 (and the M8) with their CCD sensors. For those of you for whom the CMOS sensor is giving you preferred imagery? Wonderful. Does this mean that it is giving everyone preferred imagery? No. Does it mean that one can seamlessly \"convert\" a CMOS file into one that emerged from a CCD sensor? No, it doesn't. At least in many images where the differences matter most. Hence the letter. Thank you to those who have responded with courtesy, knowledge, helpfulness, and experience regardless of your “point of view”. We all learn and grow from this. For those who have chosen to post rude and misguidedly speculative posts? Well, I guess we learn something from that, too (albeit not about cameras, photography, or image creation).",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2756084"
    },
    {
      "autor": "Paulus",
      "posts": "3,474 posts",
      "date": "01/31/2015 10:52  AM",
      "content": "The recent issues with the current CCD sensor notwithstanding, there is a strong demand for CCD sensors in M cameras. My Open Letter to Leica has garnered over 400 signatures by discerning photographers, artists, and general photo enthusiasts. Please Leica, keep CCD alive. —Peter. First of all, thank you for this initiative. Leica will certainly read this and act accordingly. They have listened to this forum many times. Not alway with the expected results but they have a business to attend. Second; I have enjoyed the M9 with ccd very much. Still the decision to go to the M was one of better iso. Not better colours. With the M9 I just hadn't enough light to make the picture I wanted. I also noticed that I did not took so many colour photographs with the M9 because of the limitations I felt, or wasn't able to correct properly ( my fault ) or I did not wanted to spent time on it. With the M 240 I don't feel this problem any more. I took the liberty of comparing some of my shots. -----> I !!!  also see a difference in the way -----> -----> I !!!  develope !!!  my M 240 files. Maybe because it's more flexible. I also notice that I use different colour choises. I do not really know if it's impossible to get the same results/colour, at the same time with the two different camera's because I was never in that position. I do know that my colour choice has changed in time. Maybe because of this camera and its possibilities. See: M 9: Affligem kleur - pauljoostenfotograaf Duik 15 mei 2013 Oostplas. Tilburg. Platform - pauljoostenfotograaf M 240: Saint Michaels Castle \" Sint Michielsgestel\" Brabant - pauljoostenfotograaf Ballonvaart en landing in Moerenburg: \"Trying to catch a Virgin.\" - pauljoostenfotograaf Landscapes around the Baltic Sea. - pauljoostenfotograaf",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2756413"
    },
    {
      "autor": "mmradman",
      "posts": "3,620 posts",
      "date": "05/30/2015 02:33  PM",
      "content": "-----> I !!!  don't know if CCD will be out for good...some said LPs were on their way out...they have made a come back --img--  LPs and CCDs is like oranges and apples, providing who ever runs ex-Kodak operation and Leica can agree to develop replacement imaging chip with corrosion resistant surface no one else is going to step in until year 2265 when n-th generation of home chip makers enables -----> D-----> I !!! Y !!!  M9 chip replacement. All joking aside I wish good run with your M9.",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2824661"
    },
    {
      "autor": "Samir Jahjah",
      "posts": "532 posts",
      "date": "05/30/2015 09:55  PM",
      "content": "LPs and CCDs is like oranges and apples, providing who ever runs ex-Kodak operation and Leica can agree to develop replacement imaging chip with corrosion resistant surface no one else is going to step in until year 2265 when n-th generation of home chip makers enables -----> -----> DIY !!!  !!!  M9 chip replacement. All joking aside I wish good run with your M9. Thanks - I had fun with both, but the battery of my M9 ran out before the one in the M : bummer --img-- ",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2824820"
    },
    {
      "autor": "BerndReini",
      "posts": "1,766 posts",
      "date": "12/06/2015 03:05  PM",
      "content": "Actually, let's not bring back CCD. Let-----> -----> 's !!!  develop !!!  something better than CMOS however. If you have ever shot a Sigma DP Merrill in good light and at low ISO, you can see that there are sensors waiting to be perfected that have the potential of even more magic than CCD out there. Unfortunately, right now they have even more limitations.",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2943791"
    },
    {
      "autor": "Prosophos",
      "posts": "1,241 posts",
      "date": "12/06/2015 03:32  PM",
      "content": "Actually, let's not bring back CCD. Let-----> -----> 's !!!  develop !!!  something better than CMOS however. If you have ever shot a Sigma DP Merrill in good light and at low ISO, you can see that there are sensors waiting to be perfected that have the potential of even more magic than CCD out there. Unfortunately, right now they have even more limitations. As a matter of fact, I have shot with a DP Merrill: http://prosophos.com/2015/01/13/paranoid-android/ The colours out of that camera are a little wonky, and the ISO limitations more prounounced, relative to the M9 CCD. So I agree, right now, the Merrills have even more limitations. But the detail!... leaves you breathless. Still, that darn CCD sensor still offers the best combination of colours, micro-contrast, and tonality I've ever encountered (and these days, I photograph with a Nikon D810).",
      "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/?tab=findComment&comment=2943799"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "12/10/2020 08:57  AM",
      "content": "The best thing you can do is to send your camera and lenses to a trusted repair shop and have the whole system calibrated - it is clear that there are too many parameters involved to do this in -----> -----> DIY !!!  !!! . BTW, the adjustment you made is for infinity, not close distance. the close distance is the screw on the pivot of the arm.",
      "link": "https://www.l-camera-forum.com/topic/315943-rangefinder-focus-adjustment-m8/?tab=findComment&comment=4095642"
    },
    {
      "autor": "bla",
      "posts": "151 posts",
      "date": "11/15/2013 10:18  AM",
      "content": "Just downloaded the Windows version. After a reset to look in folder 102LEICA instead of 100LEICA, the program converted the images as advertised in Windows 7. And the DNG files opens nicely in Adobe CS6. All good! --img--  Hi Erik, nice to hear! Of course the 100LEICA was just an example. One has to take whatever folder the RAW files are stored. -----> -----> I !!!  created !!!  a batch file for windows easing the use of the tool and -----> I !!!  will upload it right now. You might want to try it. Greetings, Arvid",
      "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=findComment&comment=2466072"
    },
    {
      "autor": "bla",
      "posts": "151 posts",
      "date": "11/18/2013 06:35  AM",
      "content": "Hello and thanks for your comments, I will not quote all of your posts but try to address the issues generally. -----> -----> I !!! 'll create !!!  a parameter for the model in exif so everyone can decide for themselves. I just noticed when using LR5 it gives you one additional color profile to choose from, namely embedded. I can see no other drawbacks, but I can change this. Dead pixels, hot pixels can and will be fixed so I advise you to not delete the RAW+JPG pairs yet. --img--  As of now there have not been any surprising issues for me that I wasn't aware of. I was mainly focusing on the color cast but seems like some sort of pixel fixing is on your wishlist. I have two main issues here: 1.) anyone got an idea on how to acquire a test image where the defects nicely and reliably show? 2.) I do not like the idea of having to create a GUI driven pixel fixer because that'd be a whole project of its own, especially as I'm supporting Windows, Mac & Linux. SO i guess it'll be something like \"open the DNG in a viewer, look for coordinates of defect pixels and put them in a file named like your m8 serial or something similar. Cool thing would be you wouldn't have to send the camera to Solms if a new defect appears... But as I said I couldn't take a photo yet where it really shows so advice is needed. I am surprised that you are happy with ISO results as I exclusively shoot at 160. I have to write the article to explain things... Last I want to mention that Brian at leicaplace.com has done some similar tests and was also quite content. I invite you to post images where an improvement is seen as there are many sceptics that have to see proofs rather than testing it for themselves... Especially since the acquisition of an image is a little more complicated. Btw does the longer write time bother you? last: keep the bia file please for now. it's the black image acquisition and is taken for shutter speeds longer than 1/15s or so. I don't use it yet. If you want to explore the content, rename the bia to raw and run it through the converter (using the same jpg) Have fun and share the information! Arvid",
      "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=findComment&comment=2468077"
    },
    {
      "autor": "bla",
      "posts": "151 posts",
      "date": "01/31/2014 12:58  PM",
      "content": " Isn't it possible to use the linux version that I offer with cygwin? Another feature that is finished: -----> -----> DIY !!!  !!!  sensor remapping... --img--  (see attached images) If you look at the spoon on the very left, you might notice a faint orange vertical line. (see the image with the crops) While the blue line is not appearing in the camera's JPG, the orange line is and it is possible to fix that now... Greetings, Arvid --img-- --img-- --img-- --img-- ",
      "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=findComment&comment=2522596"
    },
    {
      "autor": "Nr90",
      "posts": "36 posts",
      "date": "03/17/2015 01:54  PM",
      "content": "Let's use m8raw2dngv12beta_mac and m8raw2dng-droplet. m8raw2dngv12beta_mac should give you a folder with three files: lensdb.ini sensdb.ini m8raw2dng What -----> -----> I !!!  did was create !!!  a folder in my users directory named: m8raw2dng. Copy the files from the m8raw2dngv12beta_mac folder into the newly created m8raw2dng folder. Now we must tell the droplet where to find the m8raw2dng executable. 1. Open the main.scpt in the droplet as described above 2. Go to line 6. This says: set TheApp to \"/Applications/m8raw2dng\" This tells the droplet that the m8raw2dng executable is in /Applications We put in the current user's directory so we change the line to: set TheApp to \"~/m8raw2dng/m8raw2dng\" (keep the tab in front of the line) (on unix systems the ~ is the path to the current user's home directory) 3. Save the file Next we must set the parameters. The most important being the output location (where to put the newly created DNG files). 1. Go to your Pictures folder 2. Create a folder called: m8raw (A different name is possible, if so change the following to reflect your folder's name) 3. Open the main.scpt in the droplet as before 4. Go to line 11. It says: set Params to \" -v -r -b -p -l -o /Users/YourName/Pictures\" This tells the droplet with which parameters it should run the m8raw2dng. For a full description go to: M8raw2dng – Tool to convert Leica M8 RAW files to DNG The most important one is the -o It sets the output directory. Change the line to: set Params to \" -v -r -b -p -l -o ~/Pictures/m8raw\" (change the path if you chose a different location / name) 5. Save the file Now your droplet is ready to be used. Drag a folder of RAW and JPG files on top of the droplet and it should output the resulting DNG files in your ~/Pictures/m8raw folder. You will probably find the resulting DNG files are magenta coloured and uneven. We can fix this later",
      "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=findComment&comment=2782212"
    },
    {
      "autor": "Gavbo",
      "posts": "62 posts",
      "date": "04/15/2020 07:20  AM",
      "content": " Recently acquired an m8.2, the last owner did a -----> -----> DIY !!!  !!!  job of 'brassing' on the top casing with sandpaper (he told me). Any polishing experts out there with advice on where I can improve its appearance. I am thinking of a rotary multi-tool but I have no idea which will be the best attachment to use. Ideally I would like to bring back the shine rather adding more brassing. Any help would be appreciated. --img-- --img-- ",
      "link": "https://www.l-camera-forum.com/topic/308565-polishing-scratches-out-on-body/?tab=findComment&comment=3954099"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "09/06/2011 11:03  AM",
      "content": "No you cannot buy it as a spare part. The repair is not a -----> -----> DIY !!!  !!!  job. The camera has to be disassembled completely to get at the unit. If it was sticking out in the first place it was loose before you bumped it, which may explain the crack. Just send it to Leica and decide, after you get the estimate, whether you want a repair or an upgrade. The upside is that you get a one-year guaranty on the whole camera afterwards. Edited September 6, 2011 by jaapv",
      "link": "https://www.l-camera-forum.com/topic/161173-m8-repair-cracked-lcd-screen-cover/?tab=findComment&comment=1786153"
    },
    {
      "autor": "Enoksen",
      "posts": "10 posts",
      "date": "09/16/2011 08:49  PM",
      "content": "Just got my ACMAXX today and -----> i !!! m very happy w-----> i !!! th the -----> DIY !!!  repa-----> i !!! r. I had to shave off 1 mm at the bottom with a knife. Much, much better than a cracked screen. It will be like this until I find the time to send it to Leica... Thanks for all your replies --img--  Edited September 16, 2011 by Enoksen Image size",
      "link": "https://www.l-camera-forum.com/topic/161173-m8-repair-cracked-lcd-screen-cover/?tab=findComment&comment=1794720"
    },
    {
      "autor": "MikeMyers",
      "posts": "1,213 posts",
      "date": "01/26/2020 02:02  AM",
      "content": "Lovely photos. -----> I !!! 'm not convinced that a new M10 would do anything more for me - unless -----> -----> I !!!  was creating !!!  huge posters for advertising. For my usual photos, I might end up with less than I have now, as I'm note convinced images from an M10 would \"look\" as pleasing as those from the M8 and M8.2. The M8.2 was never sold as a \"sports\" camera, but I was still able to capture this photo early this morning. I was watching the Egret for going on an hour or so, had the camera aimed, and was just waiting for it to \"do something\". My finger accidentally took a few photos before I got the real one, as I was so tense. Again, this is maybe half the frame. I need to crop to get what I was after. --img-- ",
      "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/?tab=findComment&comment=3899593"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "08/01/2019 02:07  PM",
      "content": "Not that simple- but not complicated either. The tool is not a bent srewdriver, but a little screwdriver (3 mm or so) with 9/10ths of its blade edge ground off for 0.7 mm. Remove the red dot, apply a MINISCULE drop of Acetone to the locking glue to soften -not remove- it should not moisten any other part inside! Use the tool to twist the little fork just behind the red dot. However, if the camera has been bashed that hard, it might have shifted other parts inside, e.g. the sensor. And that is definitely not -----> -----> DIY !!!  !!! .",
      "link": "https://www.l-camera-forum.com/topic/299836-vertical-alignment/?tab=findComment&comment=3789160"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "04/26/2019 05:36  PM",
      "content": "That is dust and M8 sensors do not corrode. One wet clean, 5 minutes -----> -----> DIY !!!  !!! , will clear it. See the sensor cleaning post in the FAQ.",
      "link": "https://www.l-camera-forum.com/topic/296628-dirty-sensor-or-more-serious/?tab=findComment&comment=3729825"
    },
    {
      "autor": "mcgrattan",
      "posts": "2 posts",
      "date": "04/26/2019 05:41  PM",
      "content": "4 minutes ago, jaapv said: That is dust and M8 sensors do not corrode. One wet clean, 5 minutes -----> -----> DIY !!!  !!! , will clear it. See the sensor cleaning post in the FAQ. Thank you so much for the quick reply!",
      "link": "https://www.l-camera-forum.com/topic/296628-dirty-sensor-or-more-serious/?tab=findComment&comment=3729830"
    },
    {
      "autor": "biglouis",
      "posts": "7,972 posts",
      "date": "12/27/2009 01:54  AM",
      "content": "You are expecting too much from this lens. I owned one and it was a competent lens but too close to my Nokton 1.5 which I preferred. The depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. -----> I !!!  found it very difficult to obtain sharp photographs, although -----> -----> I !!!  could create !!!  pleasingly soft one. Jaap's comment is correct - you get what you pay for - although I remain suspicious that you would fare much better if you coupled the new 0.95 to any M camera - the tolerances are too tiny at close range. This fascination with very wide apertures for portrait photography is all well and good but I discovered some time ago I created very pleasing shots just using my Elmar 50 at f2.8 - with no sharpness or backfocus problems.",
      "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=findComment&comment=1164639"
    },
    {
      "autor": "dNorm",
      "posts": "81 posts",
      "date": "12/27/2009 03:24  PM",
      "content": "Hi BigLouis. Thank you for the feedback and I've tried to take in your comments with an open mind. But is my thinking flawed that I should expect the focus be within the DoF even at f/1.1 after testing it on a tripod to mitigate any sort of unsteadiness on my part? And even when stopped down to f/4, the focus is off. I've also noticed that the further away the subject is, the more it back focuses. I had sent DAG an email and I am told that he can not adjust it because of it's design. I've not yet heard back from Stephan Gandy. But at any rate, thanks for taking the time to respond. -Norm You are expecting too much from this lens. I owned one and it was a competent lens but too close to my Nokton 1.5 which I preferred. The depth of focus at 1.1 for portrait shots, of say between 0.3-.06 metres is very small, only approximately 6mm according to my dof calculator. -----> I !!!  found it very difficult to obtain sharp photographs, although -----> -----> I !!!  could create !!!  pleasingly soft one. Jaap's comment is correct - you get what you pay for - although I remain suspicious that you would fare much better if you coupled the new 0.95 to any M camera - the tolerances are too tiny at close range. This fascination with very wide apertures for portrait photography is all well and good but I discovered some time ago I created very pleasing shots just using my Elmar 50 at f2.8 - with no sharpness or backfocus problems.",
      "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=findComment&comment=1165100"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "05/10/2010 03:23  PM",
      "content": "Just slightly moisten the blob of glue, it varies where Leica puts it. If you take it to a qualified repairman, he will do this whilst you wait. It is basically not worth it doing this as -----> -----> DIY !!!  !!! . The tool will be far more expensive that the adjustment.",
      "link": "https://www.l-camera-forum.com/topic/120623-vertical-alignment-how-easy-to-do-it-yourself-with-tool/?tab=findComment&comment=1319779"
    },
    {
      "autor": "Ko.Fe.",
      "posts": "2,868 posts",
      "date": "11/28/2017 02:32  AM",
      "content": "Put IR/Cut filter in the budget... You could find new Nokton 35, 40 1.4, Color Skopar 35 2.5 and used Ultron 35 1.7 ASPH LTM for less. Even cheap Jupiter-12 will do with interesting colors and some crazy flare --img--  But 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. Cheap Orion 15 will do, then Canon 28 3.5/2.8 and then Color Skopar 28 3.5. Elmarit-M 28 2.8 V3 should be closed to your price range. I went extreme and have $7 Industar-61 lens. Due to M8 crop factor it worked fine, but it requires just little bit of -----> -----> DIY !!!  !!!  to get it focusing right on Leica (scale focus only). --img--  50mm is too tele on M9 already, IMO --img-- With M8 you could have 24mm frames and here is Color Skopar 25 f4, used or new it is not expensive. Very good lens. But check first if you could see these 24mm framelines. Edited November 28, 2017 by Ko.Fe.",
      "link": "https://www.l-camera-forum.com/topic/279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy/?tab=findComment&comment=3405302"
    },
    {
      "autor": "shutterpete",
      "posts": "29 posts",
      "date": "11/28/2017 10:26  AM",
      "content": "Put IR/Cut filter in the budget... You could find new Nokton 35, 40 1.4, Color Skopar 35 2.5 and used Ultron 35 1.7 ASPH LTM for less. Even cheap Jupiter-12 will do with interesting colors and some crazy flare --img--  But 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. Cheap Orion 15 will do, then Canon 28 3.5/2.8 and then Color Skopar 28 3.5. Elmarit-M 28 2.8 V3 should be closed to your price range. I went extreme and have $7 Industar-61 lens. Due to M8 crop factor it worked fine, but it requires just little bit of -----> -----> DIY !!!  !!!  to get it focusing right on Leica (scale focus only). --img--  50mm is too tele on M9 already, IMO --img-- With M8 you could have 24mm frames and here is Color Skopar 25 f4, used or new it is not expensive. Very good lens. But check first if you could see these 24mm framelines. Thank you so much for this valuable info.",
      "link": "https://www.l-camera-forum.com/topic/279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy/?tab=findComment&comment=3405480"
    },
    {
      "autor": "mjh",
      "posts": "10,540 posts",
      "date": "09/28/2009 10:56  AM",
      "content": "A 720 or 715 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. A 830 or 850 nm filter will let even more of the red light pass through. Oops, of course it’s the other way round: A 830 or 850 nm filter will block virtually all the visible light while a 780 nm filter will look just as black, but held against the sun reveals that it is actually a very dark red. A 715 or 720 nm filter will let even more of the red light pass through. Sorry about the confusion -----> -----> I !!!  might have created !!! .",
      "link": "https://www.l-camera-forum.com/topic/84753-getting-ektachrome-infrared-colors-out-of-the-m8/?tab=findComment&comment=1052880"
    },
    {
      "autor": "egibaud",
      "posts": "693 posts",
      "date": "04/11/2007 11:59  AM",
      "content": "Great!!! thank you Just one question.... is the M8 cheaper when buying in -----> -----> DIY !!!  !!!  Kit? --img-- ",
      "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=findComment&comment=225585"
    },
    {
      "autor": "hugov",
      "posts": "3 posts",
      "date": "06/17/2007 10:07  AM",
      "content": "Sandy, you're probably right, but the 997x series specifically don't seem to have anything that is 16-bits and fast enough. Do you know of other manufacturers that make CCD-specific ADC/AFE devices? On a side note, I still have some doubts that it is in fact true 16-bit - seems suspicious that Leica designed in a 16-bit ADC but it only outputs 8-bit RAW files. I suspect that Mark is right, and the ADC is actually only 14-bits. Regarding timing generation, it is possible that the ADC/AFE device could generate the timing - many of the Analog Devices AD99xx AFE parts have integrated timing generators. Mark, I certainly wouldn't have wanted to desolder the CCD either... they are notoriously static-sensitive, and I doubt you can get a replacement sensor at a reasonable price! p.s. anyone know what happened to Huw Finney and his -----> -----> DIY !!!  !!!  digital Leica M2? (Leica and Rangefinders Forum: M2aD Project, A bit of premature fantasy. - photo.net and google for the other threads describing it)",
      "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=findComment&comment=283157"
    },
    {
      "autor": "lanetomlane",
      "posts": "3,178 posts",
      "date": "09/26/2008 09:30  AM",
      "content": "And standard parts are easier to repair, even after years.... Mark, firstly a wonderful piece of work and I thank you most sincerely for sharing it with us. Was interested in the comments about 'standard components' being used. In my non-photographic life, I'm involve with the repair of composite structures on new generation aircraft. We build a piece of electronic equipment specifically for the process. Two of the circuit boards are designed and built just for our application, but for the remainder we use 'standard components'. What we find is that 'standard components' in the electronics industry usually only have a five year life expectancy. (I mean availabilty, not working life.) As when -----> -----> we !!!  designed !!!  the equipment -----> we !!!  didn't know where each individual component was in it's 'life cycle', one of the problems -----> we !!! 've encountered has been finding up to date replacement items for components which have become obsolete. Could you see the same situation arising in the case of the M8? I understand that Leica service have always said they are capable of repairing any of their products, no matter how old. I can see this being the case with mechanical components but wonder how they will go on replacing electronic components in 10 years time. This is in no way critical of Leica as it will apply equally to Nikon, Cannon and the rest; it's just something I'd never considered, in relation to a camera, until reading your excellent post. ________________ Thanks & regards, Tom Photography by Tom Lane",
      "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=findComment&comment=666807"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "01/02/2017 09:28  AM",
      "content": "According to Leica the maximum voltage on the hot shoe is 600 Volts with the digital M cameras. I do not think that there is any flash that gets that high. There has not been a single report of Leica M electronics being damaged by trigger voltage over the last ten years. Let-----> -----> 's !!!  not create !!!  any myths It all depends on what flash the guy in the video is using, and more specifically the trigger voltage of the flash he is using.Like Luke said, M8 can take up to 250 volts, so if the flash you intend to use on your M8 has a trigger voltage of no more than 250 volt you do not need to invest in a Wein Safe-Sync.There are a couple of places on the internet that provide trigger voltage information such as http://www.botzilla.com/photo/strobeVolts.html and http://dpanswers.com/roztr/volt_finder.php. Like anything internet use that information with caution. I always do my own measurement with a multi-meter. If a flash gets too close to the limit I'd place safe and not use it (or with a Wein Safe-sync).",
      "link": "https://www.l-camera-forum.com/topic/267838-flash-to-m8/?tab=findComment&comment=3177373"
    },
    {
      "autor": "mnutzer",
      "posts": "17,209 posts",
      "date": "06/09/2016 10:04  AM",
      "content": "Fitted. Attached with industrial strength double sided tape. It feels secure but -----> I !!!  think -----> I !!! 'll make a version 2 that fits in the hot shoe, like the Thumbs Up does...--img-- thumb 4.jpg Ernst, Will your 2nd version of a -----> D-----> I !!! Y !!!  Thumps-up have a screw for fastening inside the accessory shoe? When using heavier lenses, the strength and stability of the shoe could suffer perhaps. Since I am too clumsy for such a nice DIY project, I bought the expensive Thumbs Up CSEP-4S, but with which I am very satisfied. Perhaps you've noticed it on my Leica at our meeting at the Leitz Park. Especially for heavier lenses, I would not like to rely on an only glued Thumps-up. http://www.matchtechnical.com/Pages/ThumbsUpCSMod4.aspx --img-- ",
      "link": "https://www.l-camera-forum.com/topic/260489-diy-thumbs-upthumbie-for-m8/?tab=findComment&comment=3059005"
    },
    {
      "autor": "earleygallery",
      "posts": "19,061 posts",
      "date": "01/13/2016 04:21  PM",
      "content": "I'm surprised Leica said they can't replace the screen - maybe they didn't realise what you meant as the actual LCD can no longer be replaced. -----> I !!!  think the screen (that is the cover) is held to the body with adhesive which you can heat with a hairdryer to remove, so if you could find a replacement cover it should be pretty simple to -----> D-----> I !!! Y !!! . Or do as suggested above.",
      "link": "https://www.l-camera-forum.com/topic/255562-cracked-the-screen/?tab=findComment&comment=2967976"
    },
    {
      "autor": "gbealnz",
      "posts": "5,162 posts",
      "date": "01/21/2016 09:26  AM",
      "content": "Great descriptive assistance Mark. Why can't one simply replace the glass that is fitted to that rear half? Even a bit of -----> -----> DIY !!!  !!! ? Gary",
      "link": "https://www.l-camera-forum.com/topic/255562-cracked-the-screen/?tab=findComment&comment=2973285"
    },
    {
      "autor": "plasticman",
      "posts": "4,041 posts",
      "date": "09/03/2012 03:05  PM",
      "content": "Shouldn't this thread be moved to the M8/8.2 forum? : --img--  No - -----> -----> we !!!  should create !!!  a new subsection: the EX-Customer Forum. It's gonna be pretty busy in there. --img-- ",
      "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/?tab=findComment&comment=2103793"
    },
    {
      "autor": "Loren",
      "posts": "250 posts",
      "date": "02/26/2014 06:32  PM",
      "content": "I don't know the total numbers of M8 cameras sold, but Leica has sold 30,000 M9s. Probably less M8 and M8.2 cameras in the field than that. How many would be interested in that upgrade? Well, those of us with working cameras probably not. Those that have defective cameras maybe, but some of those are already disposed of at Leica for trade ins. So, let's just say that 20,000 M8s exist. Let's say that 15% have failed. Let's 2/3 of those are still in the field and let's say 100% of those would be willing to upgrade those for a fix. The total number of upgrade kits would be 2,000 cameras. Since -----> -----> I !!!  design !!!  and build electronics for my own business, -----> I !!!  have an informed opinion on what the costs would be… -----> I !!!  would think 200 man-hours of design time is required (that is probably too little, but let's use that number), so we have $20,000 or so in engineering labor costs. Hardware for the first prototype is probably going to be $5,000. Now we have $25,000 in NRE. Now we have to install these into the camera. We first need to train all the techs that will perform this modification. Let's put a low number of $5,000 for training expenses and documentation. The hardware for the actual conversion will probably run about $250 for parts. Remember, we are doing a low production run here, so we get no cost savings for quantity at these figures. Double that for assembly and testing, so now we are at $500 If we add up the total NRE and training we get $30,000. Again, this number is probably far less than reality, but that is $15 per camera cost right there. Add $2000 cost for the kit using the same cost-model Leica uses on their cameras (they need to make it worth their while), and one hour of service time to install, which is $100. My very low estimate for the upgrade is $2,115 per camera and you get a Frankin-M8. That's much more than what I paid for my M8. I can just buy another used one. If you were smart you would take the Leica trade in allowance and run with that.",
      "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/?tab=findComment&comment=2539932"
    },
    {
      "autor": "jaapv",
      "posts": "66,553 posts",
      "date": "02/10/2015 04:05  PM",
      "content": " I don't know the total numbers of M8 cameras sold, but Leica has sold 30,000 M9s. Probably less M8 and M8.2 cameras in the field than that. How many would be interested in that upgrade? Well, those of us with working cameras probably not. Those that have defective cameras maybe, but some of those are already disposed of at Leica for trade ins. So, let's just say that 20,000 M8s exist. Let's say that 15% have failed. Let's 2/3 of those are still in the field and let's say 100% of those would be willing to upgrade those for a fix. The total number of upgrade kits would be 2,000 cameras. Since -----> -----> I !!!  design !!!  and build electronics for my own business, -----> I !!!  have an informed opinion on what the costs would be… -----> I !!!  would think 200 man-hours of design time is required (that is probably too little, but let's use that number), so we have $20,000 or so in engineering labor costs. Hardware for the first prototype is probably going to be $5,000. Now we have $25,000 in NRE. Now we have to install these into the camera. We first need to train all the techs that will perform this modification. Let's put a low number of $5,000 for training expenses and documentation. The hardware for the actual conversion will probably run about $250 for parts. Remember, we are doing a low production run here, so we get no cost savings for quantity at these figures. Double that for assembly and testing, so now we are at $500 If we add up the total NRE and training we get $30,000. Again, this number is probably far less than reality, but that is $15 per camera cost right there. Add $2000 cost for the kit using the same cost-model Leica uses on their cameras (they need to make it worth their while), and one hour of service time to install, which is $100. My very low estimate for the upgrade is $2,115 per camera and you get a Frankin-M8. That's much more than what I paid for my M8. I can just buy another used one. If you were smart you would take the Leica trade in allowance and run with that. Your estimate is certainly low for the fitting. To replace the LCD the complete camera needs to be disassembled.....--img-- ",
      "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/?tab=findComment&comment=2762568"
    },
    {
      "autor": "Ernstk",
      "posts": "1,756 posts",
      "date": "04/21/2016 06:26  AM",
      "content": "Thanks both. Yes, you're probably right. The thing that made -----> me !!!  think about -----> DIY !!!  was the thread on here 'Anatomy of the Leica M8' http://www.l-ca-----> me !!! ra-forum.com/topic/21079-anatomy-of-the-leica-m8/page-1 which shows that the entire rear half of the ca-----> me !!! ra is fairly easily removed. I was thinking about simply swapping over the two rear parts. Ernst",
      "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=findComment&comment=3030570"
    },
    {
      "autor": "lambda",
      "posts": "8,034 posts",
      "date": "04/22/2016 09:45  AM",
      "content": "h-----> i !!!  ernst, -----> i !!!  always shoot w-----> i !!! th base -----> i !!! so and pull the -----> i !!! so when -----> -----> i !!!  develop !!!  the raws. you will find some threads about this procedure in the forum. this is( imo) the best way to shoot high iso! so i really do not need to change my setting. lambda.",
      "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=findComment&comment=3031235"
    },
    {
      "autor": "earleygallery",
      "posts": "19,061 posts",
      "date": "05/06/2016 12:22  AM",
      "content": "-----> I !!!  don't even think Leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and AFA-----> I !!! K the independent repairers won't touch digital M's, so -----> D-----> I !!! Y !!!  is probably your only option anyway. Presumably swapping the LCD is a 'plug n play' type of switch assuming you can take the necessary parts off.",
      "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=findComment&comment=3040024"
    },
    {
      "autor": "Ernstk",
      "posts": "1,756 posts",
      "date": "05/06/2016 01:15  PM",
      "content": "-----> I !!!  don't even think Leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and AFA-----> I !!! K the independent repairers won't touch digital M's, so -----> D-----> I !!! Y !!!  is probably your only option anyway. Presumably swapping the LCD is a 'plug n play' type of switch assuming you can take the necessary parts off. The M8 body splits into two halves. My plan is to swap over the rear half containing the LCD. But, as my fellow countryman once wrote \"The best laid plans of mice and men...\" Ernst",
      "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=findComment&comment=3040291"
    },
    {
      "autor": "lambda",
      "posts": "8,034 posts",
      "date": "04/26/2016 10:28  AM",
      "content": "#3! the raw files are very clear and sharp (much better than the jpgs). the camera iso setting is at base iso (ever!) even if i need a higher sensitivity in fact! so my shots are often underexposed! when -----> -----> i !!!  develope !!!  the f-----> i !!! les -----> i !!!  push them to the -----> i !!! so need. the reason for this procedure is that a modern raw editor makes a much better job than the 10 years old camera software. i use photoshop /capure one. lambda. Edited April 26, 2016 by lambda",
      "link": "https://www.l-camera-forum.com/topic/259742-the-ultimate-question-on-bw/?tab=findComment&comment=3033689"
    }
  ]
}
