{"interestingcomments": [{"autor": "M10 for me", "posts": "2,377 posts", "date": "05/17/2021 08:44  AM", "content": "I work with Lightroom and import directly into lightroom into a folder that -----> I create !!!  even out of Lightroom. On my Mac I do strictly nothing in the finder what has to do with photographs (in the finder I do even not show the photo-folder in the favorites). The photography folder I manage exclusively within Lightroom. Then I do a second thing: During the import process I alter the filenames to date/time e.g. \"2021-05-17 at 10-43-15\" So that is my way. But I must say that I am extremely pedantic on such things. Here I am the pure ingeneer type. When I sit together with other photographers and I see the complete mess they have in their organisation this makes me always mad. But it never helped anything: My friends always continued with their mess 😀. They must like it."}, {"autor": "dancook", "posts": "1,545 posts", "date": "02/21/2021 04:08  PM", "content": "39 minutes ago, T25UFO said: Did you keep the Hasselblad? If so, do you really need the M10R? I thought I had persuaded you to go with the Q2M over the M10M 🙂. I have both and still prefer the M but it’s a close run thing and there are times when auto focus means I get the shot. Doubt you’ll find a Q2M used so that’s £5,000 of your budget on a new one. At least you’ll get another three months of free Adobe use! What about the new f1.2 Noctilux? A really interesting lens, which should hold its value if you don’t like it and decide to sell. There goes another £6,500 leaving £8,500 to spend on a used M10P and some more glass. I still have my 907X 80mm 1.9 and 45p - but I did put them on ebay this morning, but not in a rush to sell. there was a Q2M used for £4250 and I just watched it pass by... should have jumped on it -----> I developed !!!  a used camera/lens database of UK retailers which updates daily - so I have a good chance to spot something in the used market. I will take a look at the new 50mm 1.2, not sure about holding it's value new though! (EDIT oh i see it's limited edition run..but it's also silver, wanted to go all black :)) Edited February 21 by dancook"}, {"autor": "chasdfg", "posts": "185 posts", "date": "01/08/2021 11:37  AM", "content": "I purchased 2 Ms in the past year and completely understand what's going on (or so i think i do) . Basically i used an M240 for the most part of 5 years, itched for something new and went through Sony, Canon, Fuji GFX, Sigma FP, Leica SL/2 cameras before realising I just want to shoot with Leica bodies, and within that brand, preferably M cameras (I only like shooting with M glass so an M camera is best for this, along with the form factor of the body, physical dials, simple button layout, etc.). My process wasn't as \"clean\" as yours in that I still had my M lenses and 1 of my 2 current M bodies whilst going through all those other bodies and systems. In any case, it was plenty of soul searching of sorts and a very restless time gear wise. I'm now perfectly contented with my M10M and M10D, two cameras which I feel compliment each other well. I had always wanted a monochrom and was always drawn to the idea of learning how to shoot in b&w as I never had the discipline to convert my pictures to b&w in post. Likewise, i was always drawn to the idea of a screen-less M. Not that I had any major issues with chimping (or so i didn't think i did, until i got the M10D last month). I chose those 2 cameras because I felt they could teach me more than a colour M could alone. People might dismiss the idea that seeing in black and white changes how you shoot, but I've experienced it first hand, as have you. One is forced to think of better ways to draw the viewer's eye. I move more, I look for stronger lines, contrast and shadow more. It's a subtle shift but it's there. The M10D has made me make sure I get the shot when I'm \"getting the shot\". I don't take for granted that I'm shooting digital so much any more. Being forced to shoot differently with these two cameras has made -----> me improve !!!  more than any other camera has, aside from my initial few years with the M240 and with my Nikons when I first started photography. I may be a marketing victim, or convincing myself I made the right choices with the M10M and M10D, but hey if I feel a difference in my shooting and I'm enjoying this hobby more, isn't only relevant barometer the level of satisfaction I derive from using this gear? It's a breath of fresh air and I'm loving it. It's never going to be sensible in the grand scheme of things, to spend money on Leica gear. If I was rational and wanted just one M, I'd have gone with an M10R. If I was rational and just wanted a camera a Nikon Z (or even a DSLR from yesteryears) would suffice. Have the two cameras delivered what I thought they would? Absolutely. And I feel I have plenty to grow into and any limitations are on me. The beauty of the monochroms and the D versions is that you're paying a high price of entry for the concept and way of shooting they promote. It's kinda like paying the high price of entry for an M, but this time a niche within the niche. Once you own a mono/D, even if a new model comes out, the incentives would merely be technological. With cameras this good these days, and with the M10 form factor, it'd be hard to make me give these up for a newer version. I suppose one could argue that if you want to buy the concept, then an M246 and M-D262 would be most economical - however having used the M10 series cameras, I don't think I could go back to the M240 body size and buttons (for M246). Speaking of GFX and Ms, one big reason why I got it was the 40mp bayerless sensor. After my experience with the GFX 50S, I was bitten by the high MP bug. Not because I print big or leave sloppy composition to be fixed in post, but because every time I zoomed in past 100% in my GFX files, I saw so much it was downright fascinating that I could see all these \"new\" details I was capturing. You might appreciate the M10M or M10R on this basis alone, having come from the GFX100. On lenses on the cameras: I've kinda \"been there, done that\" with most lenses I've wanted. I owned/used fast glass, modern glass, vintage glass, limited edition lenses and sorted through what I wanted in my kit and got rid of the rest. Sometimes I feel I should have kept some of the glass I sold cause I took a while to acquire them, not to forget the adage about never selling Leica lenses. But the clutter bothered me more than the idea of selling them. I more than halved my kit and I now \"only\" have 5. 3 core lenses (28cron, 35FLE, 50APO) and 2 \"extra\"/superfluous ones (50 f1, 75lux) for portraits/Mandler days. My main pairing on the M10M tends to be a 28cron and 50APO. Both of these lenses have great clarity and don't embellish photos excessively, much in line with how I view my black and white shooting (no colours, fancy bokeh to spice up the pictures, but lines, shadows and contrast). One side thing I realised with the M10M is I prefer 28mm or 50mm on b&w whilst I prefer 35mm in colour (or prefer 28mm and 50mm less in colour?). Haven't really figured this one out yet, but it might have to do with 28mm giving more room to compose different angles, and 50mm giving an extra tightness to draw the viewer in. I do admit the 40mp sensor does make me want to put the 50APO on more than any other lens, because it can eek out the extra details. I often get pleasant surprises in my photos when I zoom in. This said, I have used Mandler glass on the M10M due to the charm of shooting oldish glass with b&w. With my glass and the M10M, it's very much \"same same but different\", in a pleasant way. I suppose I'm not really answering your higher MP camera + certain lenses question though, since my response has a b&w slant to it. My 35FLE lives on the M10D. Not much to say about this, as that lens could live on any M and I'd be happy camper (being a 35mm guy). Apologies for the long post. I tend to get carried away when talking about cameras...a little too carried away...(I could do a summary if that helps?) Cheers and happy new year to you too!"}], "name": "PersonalPronounSmall"}