{"interestingcomments": [{"autor": "roses143", "selftext": "nan", "title": "Help! I developed these pictures from an old film roll I found and they came out blue. Is there any way to “fix” them or is it just as how it will be ? I’m not sure what or how to. Any tips advice?", "num-comments": 2, "score": 1, "date": "2021-01-17 23:30:49", "content": "Help! -----> I developed !!!  these pictures from an old film roll I found and they came out blue. Is there any way to “fix” them or is it just as how it will be ? I’m not sure what or how to. Any tips advice?"}, {"autor": "Adventurousblackswan", "selftext": "Hi all, \n\nI am a newbie in Photography and I just bought a Canon T7 with a 18-55mm lens kit to start learning.\n\nI have studied many of the concepts and followed many tips as well. When it comes to taking a photo of a subject, the photo quality is good I would say, but when taking pictures to a landscape, they are always out of focus and they simply don't look sharp, even after editing the RAW file.\n\nI have tried playing with the settings, aperture, shutter, manual focus and autofocus. It just doesn't look sharp. \n\nI would really appreciate your suggestions!\n\nThanks in advance.", "title": "Basic Photography Question: How can I improve sharpness of lanscape photos?", "num-comments": 3, "score": 1, "date": "2021-07-28 21:43:23", "content": "Basic Photography Question: How can -----> I improve !!!  sharpness of lanscape photos? /!/ Hi all, \n\nI am a newbie in Photography and I just bought a Canon T7 with a 18-55mm lens kit to start learning.\n\nI have studied many of the concepts and followed many tips as well. When it comes to taking a photo of a subject, the photo quality is good I would say, but when taking pictures to a landscape, they are always out of focus and they simply don't look sharp, even after editing the RAW file.\n\nI have tried playing with the settings, aperture, shutter, manual focus and autofocus. It just doesn't look sharp. \n\nI would really appreciate your suggestions!\n\nThanks in advance."}, {"autor": "Piano_Trombone_Guy", "selftext": "Last year I came up with this quote as a result of a (rude) someone saying that they were a photographer (people were admiring my photographs - this helps to set the scene), when all they do is take crappy (not trying to be mean, just honest) phone selfie pictures. Here it is below... let me know what you think (and any feedback is welcome too)! \n\n\"Photography is more than just being able to take a photo that looks good; It's about producing a meaningful work of art that has the capability of inspiring others and their imaginations.\" (Jack Stabek, 31/03/2019)", "title": "Quote I created last year - what do you think?", "num-comments": 36, "score": 1, "date": "2020-07-09 05:30:06", "content": "Quote -----> I created !!!  last year - what do you think? /!/ Last year I came up with this quote as a result of a (rude) someone saying that they were a photographer (people were admiring my photographs - this helps to set the scene), when all they do is take crappy (not trying to be mean, just honest) phone selfie pictures. Here it is below... let me know what you think (and any feedback is welcome too)! \n\n\"Photography is more than just being able to take a photo that looks good; It's about producing a meaningful work of art that has the capability of inspiring others and their imaginations.\" (Jack Stabek, 31/03/2019)"}, {"autor": "NahlaMonroe", "selftext": "[removed]", "title": "NAHLA MONROE - I am the real Nahla Monroe - I created this account so I could show more of me AND you can help my Reddit exposure! You can find me on IG https://www.instagram.com/nahla.monroe or my Exclusive Sites https://nahlamonroe.vip to get to know me more personally - enjoy the hotness!", "num-comments": 2, "score": 1, "date": "2021-02-14 19:41:34", "content": "NAHLA MONROE - I am the real Nahla Monroe - -----> I created !!!  this account so I could show more of me AND you can help my Reddit exposure! You can find me on IG https://www.instagram.com/nahla.monroe or my Exclusive Sites https://nahlamonroe.vip to get to know me more personally - enjoy the hotness! /!/ [removed]"}, {"autor": "VisualPersona95", "selftext": "Hey\n\nSo I've been into photography for a few years now, I got a Canon 600D back in 2018 and I've used it for street photography, some self-portraiture and events but mostly around the countryside. I got into photography as it was the closest thing to filmmaking (I had up until recently wanted a career in the film industry but decided against it as filmmaking is such a collaborative art and I am not a good fit with people and can't get along with them) I also once wanted to become a portrait photographer as a back up career but that is also out of the question.\n\nNow that my interest in filmmaking has gone my only other interest is photography but m worried that at 26 I'm not going to get any good at it. I'm obviously not going to get at the level of a Andrei Tarkovsky, Roger Deakins, Richard Avedon or Mary Ellen Mark but I would like to get good. So is it to late? if not how could I improve?\n\nAlso while I do want to keep up photography I don't know what genre to try, portraiture, street, events and anything that involves taking photos of people or working with people, so any suggestions?", "title": "Is 26 Too Old to Get Great at Photography? And What Genre Would I Be Interested In?", "num-comments": 20, "score": 1, "date": "2021-04-22 21:13:52", "content": "Is 26 Too Old to Get Great at Photography? And What Genre Would I Be Interested In? /!/ Hey\n\nSo I've been into photography for a few years now, I got a Canon 600D back in 2018 and I've used it for street photography, some self-portraiture and events but mostly around the countryside. I got into photography as it was the closest thing to filmmaking (I had up until recently wanted a career in the film industry but decided against it as filmmaking is such a collaborative art and I am not a good fit with people and can't get along with them) I also once wanted to become a portrait photographer as a back up career but that is also out of the question.\n\nNow that my interest in filmmaking has gone my only other interest is photography but m worried that at 26 I'm not going to get any good at it. I'm obviously not going to get at the level of a Andrei Tarkovsky, Roger Deakins, Richard Avedon or Mary Ellen Mark but I would like to get good. So is it to late? if not how could -----> I improve !!! ?\n\nAlso while I do want to keep up photography I don't know what genre to try, portraiture, street, events and anything that involves taking photos of people or working with people, so any suggestions?"}, {"autor": "Unihorse1022", "selftext": "nan", "title": "What should I improve?", "num-comments": 2, "score": 1, "date": "2021-07-27 10:09:08", "content": "What should -----> I improve !!! ?"}, {"autor": "Saodazi", "selftext": "[removed]", "title": "How do I improve my photography? I find that a lot of my pictures are plain and lack that extra something to make it interesting", "num-comments": 2, "score": 1, "date": "2021-01-31 23:42:07", "content": "How do -----> I improve !!!  my photography? I find that a lot of my pictures are plain and lack that extra something to make it interesting /!/ [removed]"}, {"autor": "whatsamiddler", "selftext": "nan", "title": "Is New York Dead? I'm a NY-based amateur photographer and on a mission to prove that New York is far from dead. I created a website to crowd-source a photo collection showing life on every block of NYC. If you're based in NY, please consider contributing photos!", "num-comments": 1, "score": 1, "date": "2021-02-14 18:41:56", "content": "Is New York Dead? I'm a NY-based amateur photographer and on a mission to prove that New York is far from dead. -----> I created !!!  a website to crowd-source a photo collection showing life on every block of NYC. If you're based in NY, please consider contributing photos!"}, {"autor": "yusufkerem1", "selftext": "[removed]", "title": "hello how can i improve myself. i am newbie", "num-comments": 2, "score": 1, "date": "2021-02-14 14:27:29", "content": "hello how can -----> i improve !!!  myself. i am newbie /!/ [removed]"}, {"autor": "pcislifetbh", "selftext": "So I came across a photography instagram page and I'm astonished by how good her photos are. So my question is, how do I improve to begin taking pics like her? Is equipment she uses or is this just skill?\n\nhttp://imgur.com/gallery/DnNT9ho\n\nBtw her insta is lauren_quilter_photography if you're curious.", "title": "How do I get my photos to come out like this..?", "num-comments": 3, "score": 1, "date": "2021-04-06 04:24:15", "content": "How do I get my photos to come out like this..? /!/ So I came across a photography instagram page and I'm astonished by how good her photos are. So my question is, how do -----> I improve !!!  to begin taking pics like her? Is equipment she uses or is this just skill?\n\nhttp://imgur.com/gallery/DnNT9ho\n\nBtw her insta is lauren_quilter_photography if you're curious."}, {"autor": "rookieMale", "selftext": "Hey, you all beautiful people,\n\nRecently I have been seeing this trend on Instagram and Facebook on people (read teenagers) using my pics to write some sad quotes like 'Life is not that hard once you see beauty' (oh yeah the creativity) and slapping their name in the pic and sharing on Instagram. Now I would have been okay but then a tiny little artist part of me broke when I saw some of them have even more followers than me.\n\nI haven't had a chance to discuss this with anyone because like some of the creators I live an isolated life far away from any modicum of social interaction, with my friends are photoshop and premiere and the thing I touch the most is the mouse and my pen (no pun intended). \n\nI did tell one of these superbly awesome kids that you can use the pic and even write the quote but maybe you shouldn't watermark it as yourself at the bottom. which might give the wrong impression. To which I was given a lesson on how they have to since they want people to know where the quote came from. And the quote mind you said Shakespeare, was created by this page ( Instagram page ). That little kid who was happy whenever he created a little piece of art died and the other little part who thought it might be okay to steal my nephew's chocolate bars got a huge ego boost. \n\nOh they did give the credit in the form of \n\nMy awesome quote ....\n\n.\n\n(10 similar . lines here)\n\n.\n\n@ some guy who took this pic\n\n\\#all\\_the\\_hashtags\\_that\\_are\\_gonna\\_make\\_me\\_famous #awesomeWriter #ShakespeareSucks\n\nSo before I go ahead and start living in an even smaller hole. I just wanted to check with all my creator friends on what you think of this? Am i getting too old for all this hip stuff", "title": "On people using the photos to write quotes", "num-comments": 21, "score": 1, "date": "2020-08-25 06:04:32", "content": "On people using the photos to write quotes /!/ Hey, you all beautiful people,\n\nRecently I have been seeing this trend on Instagram and Facebook on people (read teenagers) using my pics to write some sad quotes like 'Life is not that hard once you see beauty' (oh yeah the creativity) and slapping their name in the pic and sharing on Instagram. Now I would have been okay but then a tiny little artist part of me broke when I saw some of them have even more followers than me.\n\nI haven't had a chance to discuss this with anyone because like some of the creators I live an isolated life far away from any modicum of social interaction, with my friends are photoshop and premiere and the thing I touch the most is the mouse and my pen (no pun intended). \n\nI did tell one of these superbly awesome kids that you can use the pic and even write the quote but maybe you shouldn't watermark it as yourself at the bottom. which might give the wrong impression. To which I was given a lesson on how they have to since they want people to know where the quote came from. And the quote mind you said Shakespeare, was created by this page ( Instagram page ). That little kid who was happy whenever -----> he created !!!  a little piece of art died and the other little part who thought it might be okay to steal my nephew's chocolate bars got a huge ego boost. \n\nOh they did give the credit in the form of \n\nMy awesome quote ....\n\n.\n\n(10 similar . lines here)\n\n.\n\n@ some guy who took this pic\n\n\\#all\\_the\\_hashtags\\_that\\_are\\_gonna\\_make\\_me\\_famous #awesomeWriter #ShakespeareSucks\n\nSo before I go ahead and start living in an even smaller hole. I just wanted to check with all my creator friends on what you think of this? Am i getting too old for all this hip stuff"}, {"autor": "Owenn_18", "selftext": "nan", "title": "so i recently got interested in photo editing and i'd like that you guys tell me if my edit seems real and how could i improve it (the edited thing is the boy on the right, nothing else)", "num-comments": 2, "score": 1, "date": "2021-06-24 18:48:14", "content": "so i recently got interested in photo editing and i'd like that you guys tell me if my edit seems real and how could -----> i improve !!!  it (the edited thing is the boy on the right, nothing else)"}, {"autor": "abolishthedea", "selftext": "[removed]", "title": "If UnSplash is 'free', why is CafePress blocking the products I create with it?", "num-comments": 2, "score": 1, "date": "2021-06-24 02:47:30", "content": "If UnSplash is 'free', why is CafePress blocking the products -----> I create !!!  with it? /!/ [removed]"}, {"autor": "DuhBulls", "selftext": "Some backstory: I have been paid to do photography twice in my (25m) life, both times for friends' professional headshots. I think I'm pretty decent at photography but certainly a novice with portraits and Im getting a bad case of imposter syndrome. I'd call this my first real gig ever - I'd love for this to become a \"side hustle\" or at least be able to do a couple gigs a year to fund the hobby. So, I'd be very appreciative if you folks could answer some of my questions or provide some advice you wish you'd gotten at the genesis of your career: \n\nHow do you determine a fair price? What factors add up to get you to that number? Should my price reflect my experience or lack thereof?\n\nShould that price include editing or do you just send over all the images from the shoot unedited and offer editing as a separate service? Should I design a watermark to add to raw images?\n\nWhat apps/tech do you use to store, edit, and send over the end product to your clients? I know adobe well but had to cancel bc expensive, so I'd also accept any recs on free editing tools. \n\nI know I should be using a contract, do you have any resources/tips I could use to help with writing that up? \n\nAnything else I haven't thought of that you would recommend doing? \n\nThank you so much for your time and effort if you choose to reply, much appreciated! I am not oblivious that I might be in over my head here, that's why I came to some pros, so go nuts!", "title": "A coworker wants to hire me (a hobbyist open to being paid) for portraits of his gf, I want to accept the gig but have no clue how to proceed.", "num-comments": 6, "score": 1, "date": "2021-08-27 18:16:33", "content": "A coworker wants to hire me (a hobbyist open to being paid) for portraits of his gf, I want to accept the gig but have no clue how to proceed. /!/ Some backstory: I have been paid to do photography twice in my (25m) life, both times for friends' professional headshots. I think I'm pretty decent at photography but certainly a novice with portraits and Im getting a bad case of imposter syndrome. I'd call this my first real gig ever - I'd love for this to become a \"side hustle\" or at least be able to do a couple gigs a year to fund the hobby. So, I'd be very appreciative if you folks could answer some of my questions or provide some advice you wish you'd gotten at the genesis of your career: \n\nHow do you determine a fair price? What factors add up to get you to that number? Should my price reflect my experience or lack thereof?\n\nShould that price include editing or do you just send over all the images from the shoot unedited and offer editing as a separate service? Should -----> I design !!!  a watermark to add to raw images?\n\nWhat apps/tech do you use to store, edit, and send over the end product to your clients? I know adobe well but had to cancel bc expensive, so I'd also accept any recs on free editing tools. \n\nI know I should be using a contract, do you have any resources/tips I could use to help with writing that up? \n\nAnything else I haven't thought of that you would recommend doing? \n\nThank you so much for your time and effort if you choose to reply, much appreciated! I am not oblivious that I might be in over my head here, that's why I came to some pros, so go nuts!"}, {"autor": "onepokemanz", "selftext": "https://imgur.com/a/M9OMoJg\n\nU see how drake has a pink and blue lightning, how do I achieve this effect.  What is it calle.\n\nI’m a complete noob and just want to recreate this dope photoz\n\nThank you 🙏", "title": "How do I create this lighting effect to get a photo to look like this ?", "num-comments": 7, "score": 1, "date": "2021-08-26 22:39:32", "content": "How do -----> I create !!!  this lighting effect to get a photo to look like this ? /!/ https://imgur.com/a/M9OMoJg\n\nU see how drake has a pink and blue lightning, how do I achieve this effect.  What is it calle.\n\nI’m a complete noob and just want to recreate this dope photoz\n\nThank you 🙏"}, {"autor": "CMKGFK", "selftext": "So i am looking for a website or some service that could create mock up prints for me kinda like this. [https://imgur.com/gallery/3t2Xz2D](https://imgur.com/gallery/3t2Xz2D) I am really looking for something so I do not have to go and make product photos for all my prints (im just lazy). is there a website that could put my images on a print like thing so i can demo it for a product page?", "title": "How do i create a virtual print shop? read post", "num-comments": 1, "score": 1, "date": "2020-03-26 01:51:25", "content": "How do -----> i create !!!  a virtual print shop? read post /!/ So i am looking for a website or some service that could create mock up prints for me kinda like this. [https://imgur.com/gallery/3t2Xz2D](https://imgur.com/gallery/3t2Xz2D) I am really looking for something so I do not have to go and make product photos for all my prints (im just lazy). is there a website that could put my images on a print like thing so i can demo it for a product page?"}, {"autor": "foamoirefresher", "selftext": "Im a part-time photographer and I used to have this real passion for landscape images.  I live on a relatively small island so seascapes, landscapes etc are abundant.  Anyway I have been feeling that I have exhausted all the spots on my island, visiting them throughout the years in different seasons, different light, times of day to get the best shots of the area.\n\nBut as of late, really since the beginning of the year it just doesn't seem to be cutting it anymore, I feel like its rinse and repeat, over and over again and since my other work has been slow since wedding have been cancelled and my other part time job I only work 10 hours a week it has got me into somewhat of a rut.\n\nI was looking back at my first few years of photographs from around 15-18 years ago, shooting on film, self developing and they all have such a quality to them, I look at them and I see this story, of my friends and I, hanging out, life growing up and it suddenly felt that I don't have this emotional connection with any of my current landscape images, my newer work or any photographs I have taken in the last 3-5 years.  \n\nI stopping picking up my camera, no clients and no desire to get out shooting so I just stopped.  This went on for a few weeks and I began to pick up my older DSLR and film camera and just casually shooting a couple of weeks ago, not really paying much attention but just trying to have fun, I watched a few youtube videos earlier this week and I began to think about what photography really meant to me.  I wanted to meditate on this idea and get some thoughts down on paper, this is what I wrote:\n\n&amp;#x200B;\n\n*‘What does photography mean to me?  Looking back at the beginning of my photography journey I’m not sure if it is nostalgia or just the great (but not always) memories but everything (the photographs) seem to have a more of a magical sparkle to them.  Things are just too easy now, I have every variable available to me at all times in post production that it seems to be a wish-list of skills and looks that is just rinse and repeat, image after image.*\n\n*Not photograph after photograph, these digital recreations of time is but a digital fingerprint of where I have been and what I have seen.  Emptiness, lifeless landscape image with nobody to share them with.  They only become photographs either when I print them to bring them into the physical world, or when that moment of capture is shared with somebody else.*\n\n*I have been a slave to the digital realm, focusing on sharpness, colour, micro-contrast, focus stacking, exposure bracketing, like seeking nothingness and it has not made me any happier, I think far from it.  And has it moulded me into an inferior photography?*\n\n*Maybe…*\n\n*Digital darkroom, photographic enhancement, luminosity masks and AI algorithms to stitch 120 megapixel monsters, pointless.  Look at me, I have the latest PANIKONY MK7ii with XY2 lens and every other accessory available to man.  But it is ok to use these, the question is should I?*\n\n*The landscapes I create used to mean so much to me finding perfection everywhere I go, the best light, composition, what filters, how to process and it all very well said and done, I have learnt many skills along the way, but at what sacrifice?  To no longer look at the world with fresh eyes, but just to see a look, a feed, no story soul or meaning.*\n\n*I want to narrow my focus, and that focus has to be relevant and have meaning, at least to me.  It is all about the story after all isn’t it?  To narrow my focus on the things that really mean something to me, my friends, family and life.  Adventure is everywhere, I feel like I was in such a rush to quit Funky (old job) and have time, that I quit more than that job when I left.  My work ethic has changed inside me, my fuel and fire has dwindled as I have had more opportunities.*\n\n*Is it because I feel I must suffer to succeed, No.  But I need to be challenged, to be inquisitive, to be interested.  Maybe if I was more interested in my own landscape images then somebody else would be too.  I think thats why I made them, for others to look at, but I’m still not sure what they see when they look at them.  There is no story or meaning to them and I’m not sure if just beauty is enough.*\n\n*Im not sure that this is a moment of self doubt, nut more the lines of realisation that a photographer can be whoever they want to be.  They don’t need to fit into genres or follow trends.  They don’t need to create new trends or even bring back old ones.  They don’t need to be bold and think big, they don’t need to be perfect and have all the answers.  I think the only thing a photographer needs is the passion to tell a story.  And I think it's time I carried on telling the only story I know.  Mine.’*\n\n&amp;#x200B;\n\nI felt like this really challenged my beliefs on what I was trying to do and get out of my images, where I wanted to see them and question who I was really pleasing.  Myself, a random person, or another photographer.  I think that its important to take steps back and re-evaluate whats happening in your photographic journey at whatever skill level you might be at.\n\nIt has led me to believe that I am just not that bothered about landscapes anymore and I don't really want to carry on pursuing them.  I am going back to older projects and coming up with new ideas of projects I want to do in the future to create the work that really means something to me.  \n\nIf you are relatively new to photography I think you should ask yourself what kind of images would you like to look back on in 20 years, what will tell that story for you.  If you are picking up a camera just to get likes and follow trends then you might just be wasting your time, and money.\n\nIf you are an experienced photographer I ask you this; \n\nWhat does photography mean to you and what are your goals or projects you are working on that captivates you over long periods of time?\n\n&amp;#x200B;\n\nI made a follow up video about my journal entry the next day which is [here](https://www.youtube.com/watch?v=XktF0GMqFgQ) if you want to check it out.\n\nAnd I also made a blog post discussing the same thoughts and ideas behind my struggles with storytelling in photography [here](https://www.luismoraisphoto.com/blog/my-struggles-with-storytelling-in-photography) if you want to check it out.\n\n&amp;#x200B;\n\nThanks for reading and have a great day!\n\n&amp;#x200B;\n\nLuis", "title": "Struggling with Storytelling in photography - Discussion, Video, Images and Journal entry - Long Post!", "num-comments": 5, "score": 2, "date": "2020-05-21 17:35:33", "content": "Struggling with Storytelling in photography - Discussion, Video, Images and Journal entry - Long Post! /!/ Im a part-time photographer and I used to have this real passion for landscape images.  I live on a relatively small island so seascapes, landscapes etc are abundant.  Anyway I have been feeling that I have exhausted all the spots on my island, visiting them throughout the years in different seasons, different light, times of day to get the best shots of the area.\n\nBut as of late, really since the beginning of the year it just doesn't seem to be cutting it anymore, I feel like its rinse and repeat, over and over again and since my other work has been slow since wedding have been cancelled and my other part time job I only work 10 hours a week it has got me into somewhat of a rut.\n\nI was looking back at my first few years of photographs from around 15-18 years ago, shooting on film, self developing and they all have such a quality to them, I look at them and I see this story, of my friends and I, hanging out, life growing up and it suddenly felt that I don't have this emotional connection with any of my current landscape images, my newer work or any photographs I have taken in the last 3-5 years.  \n\nI stopping picking up my camera, no clients and no desire to get out shooting so I just stopped.  This went on for a few weeks and I began to pick up my older DSLR and film camera and just casually shooting a couple of weeks ago, not really paying much attention but just trying to have fun, I watched a few youtube videos earlier this week and I began to think about what photography really meant to me.  I wanted to meditate on this idea and get some thoughts down on paper, this is what I wrote:\n\n&amp;#x200B;\n\n*‘What does photography mean to me?  Looking back at the beginning of my photography journey I’m not sure if it is nostalgia or just the great (but not always) memories but everything (the photographs) seem to have a more of a magical sparkle to them.  Things are just too easy now, I have every variable available to me at all times in post production that it seems to be a wish-list of skills and looks that is just rinse and repeat, image after image.*\n\n*Not photograph after photograph, these digital recreations of time is but a digital fingerprint of where I have been and what I have seen.  Emptiness, lifeless landscape image with nobody to share them with.  They only become photographs either when I print them to bring them into the physical world, or when that moment of capture is shared with somebody else.*\n\n*I have been a slave to the digital realm, focusing on sharpness, colour, micro-contrast, focus stacking, exposure bracketing, like seeking nothingness and it has not made me any happier, I think far from it.  And has it moulded me into an inferior photography?*\n\n*Maybe…*\n\n*Digital darkroom, photographic enhancement, luminosity masks and AI algorithms to stitch 120 megapixel monsters, pointless.  Look at me, I have the latest PANIKONY MK7ii with XY2 lens and every other accessory available to man.  But it is ok to use these, the question is should I?*\n\n*The landscapes -----> I create !!!  used to mean so much to me finding perfection everywhere I go, the best light, composition, what filters, how to process and it all very well said and done, I have learnt many skills along the way, but at what sacrifice?  To no longer look at the world with fresh eyes, but just to see a look, a feed, no story soul or meaning.*\n\n*I want to narrow my focus, and that focus has to be relevant and have meaning, at least to me.  It is all about the story after all isn’t it?  To narrow my focus on the things that really mean something to me, my friends, family and life.  Adventure is everywhere, I feel like I was in such a rush to quit Funky (old job) and have time, that I quit more than that job when I left.  My work ethic has changed inside me, my fuel and fire has dwindled as I have had more opportunities.*\n\n*Is it because I feel I must suffer to succeed, No.  But I need to be challenged, to be inquisitive, to be interested.  Maybe if I was more interested in my own landscape images then somebody else would be too.  I think thats why I made them, for others to look at, but I’m still not sure what they see when they look at them.  There is no story or meaning to them and I’m not sure if just beauty is enough.*\n\n*Im not sure that this is a moment of self doubt, nut more the lines of realisation that a photographer can be whoever they want to be.  They don’t need to fit into genres or follow trends.  They don’t need to create new trends or even bring back old ones.  They don’t need to be bold and think big, they don’t need to be perfect and have all the answers.  I think the only thing a photographer needs is the passion to tell a story.  And I think it's time I carried on telling the only story I know.  Mine.’*\n\n&amp;#x200B;\n\nI felt like this really challenged my beliefs on what I was trying to do and get out of my images, where I wanted to see them and question who I was really pleasing.  Myself, a random person, or another photographer.  I think that its important to take steps back and re-evaluate whats happening in your photographic journey at whatever skill level you might be at.\n\nIt has led me to believe that I am just not that bothered about landscapes anymore and I don't really want to carry on pursuing them.  I am going back to older projects and coming up with new ideas of projects I want to do in the future to create the work that really means something to me.  \n\nIf you are relatively new to photography I think you should ask yourself what kind of images would you like to look back on in 20 years, what will tell that story for you.  If you are picking up a camera just to get likes and follow trends then you might just be wasting your time, and money.\n\nIf you are an experienced photographer I ask you this; \n\nWhat does photography mean to you and what are your goals or projects you are working on that captivates you over long periods of time?\n\n&amp;#x200B;\n\nI made a follow up video about my journal entry the next day which is [here](https://www.youtube.com/watch?v=XktF0GMqFgQ) if you want to check it out.\n\nAnd I also made a blog post discussing the same thoughts and ideas behind my struggles with storytelling in photography [here](https://www.luismoraisphoto.com/blog/my-struggles-with-storytelling-in-photography) if you want to check it out.\n\n&amp;#x200B;\n\nThanks for reading and have a great day!\n\n&amp;#x200B;\n\nLuis"}, {"autor": "MakeMuricaOkayAgain", "selftext": "Was wondering if any one was interested in joining a discord where we share RAWs and upload each other’s photos for fun. It’s a great exercise for all esp during the quarantine. \n\nHere’s a quick link of a server I created. \n[discord link](https://discord.gg/ZymYEM)\n\nOpen to suggestions and advice as well as mods. \n\n\nThanks guys :)", "title": "Photo editing discord", "num-comments": 2, "score": 1, "date": "2020-04-27 06:18:18", "content": "Photo editing discord /!/ Was wondering if any one was interested in joining a discord where we share RAWs and upload each other’s photos for fun. It’s a great exercise for all esp during the quarantine. \n\nHere’s a quick link of a server -----> I created !!! . \n[discord link](https://discord.gg/ZymYEM)\n\nOpen to suggestions and advice as well as mods. \n\n\nThanks guys :)"}, {"autor": "FilmLifeVlog", "selftext": "[removed]", "title": "I created a film photography hub featuring some of my work and film photography content. Check it out :-)", "num-comments": 2, "score": 1, "date": "2020-10-27 04:51:47", "content": "-----> I created !!!  a film photography hub featuring some of my work and film photography content. Check it out :-) /!/ [removed]"}, {"autor": "BoiPony", "selftext": "nan", "title": "How can i improve this photo? Any sugestions?", "num-comments": 2, "score": 1, "date": "2020-11-04 20:33:13", "content": "How can -----> i improve !!!  this photo? Any sugestions?"}, {"autor": "Acrivisum", "selftext": "I have seasonal depression, and winter is hard to photograph in Iowa. Lately I’ve seen other people’s great work and it’s been demotivating to me. I used to really like the content I created, I have clients that buy from me, I have people that book me. But I’m no longer happy with what I produce. \n\nDoes anybody have any tips on how to overcome this, is this normal, or is this just a part of my seasonal depression and it will pass with time?", "title": "Haven’t been happy with my pictures lately.", "num-comments": 3, "score": 1, "date": "2020-11-04 18:13:20", "content": "Haven’t been happy with my pictures lately. /!/ I have seasonal depression, and winter is hard to photograph in Iowa. Lately I’ve seen other people’s great work and it’s been demotivating to me. I used to really like the content -----> I created !!! , I have clients that buy from me, I have people that book me. But I’m no longer happy with what I produce. \n\nDoes anybody have any tips on how to overcome this, is this normal, or is this just a part of my seasonal depression and it will pass with time?"}, {"autor": "fyre_ops", "selftext": "nan", "title": "Took this photo the other day, how can I improve my camera work?", "num-comments": 2, "score": 1, "date": "2021-01-13 21:08:58", "content": "Took this photo the other day, how can -----> I improve !!!  my camera work?"}, {"autor": "clockkeep", "selftext": "Currently using a Foldio portable studio for photos of various modded Gameboys I create. Depending on the design/colors for each system, I go with different backdrops but the most common is Black. The Foldio system provides a black backdrop, and while its great it’s also made of a felt-ish material and collects lint/dust like that’s it’s full time job. Example seen [here](https://m.media-amazon.com/images/I/81pq9gRxAlL.jpg). Any recommended materials that would provide a similar look/light reflectance without needing to lint roll it every 2 minutes?", "title": "Black backdrop that won’t pick up lint?", "num-comments": 112, "score": 1, "date": "2020-11-28 09:32:21", "content": "Black backdrop that won’t pick up lint? /!/ Currently using a Foldio portable studio for photos of various modded Gameboys -----> I create !!! . Depending on the design/colors for each system, I go with different backdrops but the most common is Black. The Foldio system provides a black backdrop, and while its great it’s also made of a felt-ish material and collects lint/dust like that’s it’s full time job. Example seen [here](https://m.media-amazon.com/images/I/81pq9gRxAlL.jpg). Any recommended materials that would provide a similar look/light reflectance without needing to lint roll it every 2 minutes?"}, {"autor": "jbilous", "selftext": "nan", "title": "Over the last few days I created a web app to solve a problem that I often have while out shooting - keeping tracking of all the spots I want to shoot and where they are. I decided to make the app public - so anyone can use it for free. I'd love to hear if it's useful for you, and any feedback.", "num-comments": 0, "score": 1, "date": "2021-02-04 22:32:35", "content": "Over the last few days -----> I created !!!  a web app to solve a problem that I often have while out shooting - keeping tracking of all the spots I want to shoot and where they are. I decided to make the app public - so anyone can use it for free. I'd love to hear if it's useful for you, and any feedback."}, {"autor": "jonystarck", "selftext": "nan", "title": "Swoop is a picture frame I designed that makes it simple to mount and hang photos yourself. I would love to hear your feedback on the overall design and see if there is a general interest in the photography community to improve how we mount and display printed photography and artwork.", "num-comments": 1, "score": 1, "date": "2021-02-04 07:58:21", "content": "Swoop is a picture frame -----> I designed !!!  that makes it simple to mount and hang photos yourself. I would love to hear your feedback on the overall design and see if there is a general interest in the photography community to improve how we mount and display printed photography and artwork."}, {"autor": "[deleted]", "selftext": "[deleted]", "title": "How do I improve this photograph more??", "num-comments": 1, "score": 1, "date": "2021-02-03 19:20:12", "content": "How do -----> I improve !!!  this photograph more?? /!/ [deleted]"}, {"autor": "zorotheunicorn", "selftext": "what can I do better? What was ur favorite and least favorite picture? Just overall thoughts about my work I just want to hear ppl opinions. Ig:ssonder_nectarr the other subreddits don't allow pictures.", "title": "How can I improve my photography?", "num-comments": 4, "score": 1, "date": "2021-02-12 20:28:47", "content": "How can -----> I improve !!!  my photography? /!/ what can I do better? What was ur favorite and least favorite picture? Just overall thoughts about my work I just want to hear ppl opinions. Ig:ssonder_nectarr the other subreddits don't allow pictures."}, {"autor": "pokeranger24", "selftext": "Hi, I am kinda a beginner at photography and need some advice for plant pics. The thing is I have created a website to sell plants and have got trouble clicking good pics of the plants. The biggest problem is the background, what kind of background should I create for my plants to make them stand out? For now, Just use my mobile camera and then use MS paint to remove the background and made it white but well the photos are losing their quality and color. And the whole process of removing the background manually is really time-consuming.\n\nOh and I use a Panasonic DMC-GF2\n\n[A couple of Photos for reference](https://imgur.com/gallery/h7eXbnL)", "title": "How to create a good background for plant photos?", "num-comments": 5, "score": 1, "date": "2021-04-19 17:56:41", "content": "How to create a good background for plant photos? /!/ Hi, I am kinda a beginner at photography and need some advice for plant pics. The thing is I have created a website to sell plants and have got trouble clicking good pics of the plants. The biggest problem is the background, what kind of background should -----> I create !!!  for my plants to make them stand out? For now, Just use my mobile camera and then use MS paint to remove the background and made it white but well the photos are losing their quality and color. And the whole process of removing the background manually is really time-consuming.\n\nOh and I use a Panasonic DMC-GF2\n\n[A couple of Photos for reference](https://imgur.com/gallery/h7eXbnL)"}, {"autor": "cubedude719", "selftext": "Hey guys, I created a website through Pixieset, and now that I have a job that makes ok money I think I want to make the jump from the free version to the paid, which will allow me to show more photos on there and sell stuff easier, without a % of the commission taken out. \n\nBut does anyone have any experience with them doing holiday sales or anything? I figured I shouldve checked during black Friday but I forgot. Thanks!", "title": "Does anyone know if Pixieset ever does deals?", "num-comments": 7, "score": 1, "date": "2021-04-09 19:37:28", "content": "Does anyone know if Pixieset ever does deals? /!/ Hey guys, -----> I created !!!  a website through Pixieset, and now that I have a job that makes ok money I think I want to make the jump from the free version to the paid, which will allow me to show more photos on there and sell stuff easier, without a % of the commission taken out. \n\nBut does anyone have any experience with them doing holiday sales or anything? I figured I shouldve checked during black Friday but I forgot. Thanks!"}, {"autor": "YourFavPanda", "selftext": "nan", "title": "Was practicing my frequency seperation, what do you guys think? How can I improve?", "num-comments": 2, "score": 1, "date": "2021-04-09 02:06:09", "content": "Was practicing my frequency seperation, what do you guys think? How can -----> I improve !!! ?"}, {"autor": "uRh3f5BfFgjw74FGv3gf", "selftext": "I bought a 7D back in 2011. Soon after, I bought several lenses, combined worth much-much more than the camera, as it should be, lol. Then multiple flash units for a master-slave setup. Then gobos, snoots, gels and other types of light modifiers. Backpacks. Tripods. Remote triggers. Lots of diy-type attachments. I used a 3D printer to make holders for multiple flash heads, among other contraptions I developed to help me take pictures.\n\nI read a lot. Articles, tutorials, whatever I could find. Lot's of theory and anything from basics like the exposure triangle to how sensors work to the physical aspects of optics to framing and composition. Anything I could learn I learned. It was awesome.\n\nNow, it's 2021. And I noticed that I can't think of any recent photography-related headline anymore that would pique my interest.\n\n\"Later Camera Reviews\"... meh.\n\n\"How to Start a Photography Business\".... boring.\n\n\"Shooting Great Portraits For Any Type Of Face\".... even more meh than the camera review thing.\n\nI'm looking at Fstoppes, DPreview, Petapixel, and so on. Nothing seems relevant or interesting anymore.\n\nIs it just me? Am I generally losing interest in photography?\n\nThe other day I was thinking, what headline could I come across that would make me stop doing whatever it is I'm doing and actually read the article? I couldn't think of anything.\n\nIn the past, things like \"how to use ETTR to minimize noise\" or \"exposure bracketing to maintain highlights\" or \"matching color temperature of flash gel to provide natural-looking fill light\" or something like that would make me stop and read and learn about it.\n\nBut these days, I'm browsing photo-related websites and it's just boring.\n\nIs it just me? Or has the field of photography moved on and all the current online publications no longer target me but target the new generation photographers about things that seem irrelevant to me?", "title": "What do photographers want? What do photographers need?", "num-comments": 126, "score": 1, "date": "2021-04-04 14:25:32", "content": "What do photographers want? What do photographers need? /!/ I bought a 7D back in 2011. Soon after, I bought several lenses, combined worth much-much more than the camera, as it should be, lol. Then multiple flash units for a master-slave setup. Then gobos, snoots, gels and other types of light modifiers. Backpacks. Tripods. Remote triggers. Lots of diy-type attachments. I used a 3D printer to make holders for multiple flash heads, among other contraptions -----> I developed !!!  to help me take pictures.\n\nI read a lot. Articles, tutorials, whatever I could find. Lot's of theory and anything from basics like the exposure triangle to how sensors work to the physical aspects of optics to framing and composition. Anything I could learn I learned. It was awesome.\n\nNow, it's 2021. And I noticed that I can't think of any recent photography-related headline anymore that would pique my interest.\n\n\"Later Camera Reviews\"... meh.\n\n\"How to Start a Photography Business\".... boring.\n\n\"Shooting Great Portraits For Any Type Of Face\".... even more meh than the camera review thing.\n\nI'm looking at Fstoppes, DPreview, Petapixel, and so on. Nothing seems relevant or interesting anymore.\n\nIs it just me? Am I generally losing interest in photography?\n\nThe other day I was thinking, what headline could I come across that would make me stop doing whatever it is I'm doing and actually read the article? I couldn't think of anything.\n\nIn the past, things like \"how to use ETTR to minimize noise\" or \"exposure bracketing to maintain highlights\" or \"matching color temperature of flash gel to provide natural-looking fill light\" or something like that would make me stop and read and learn about it.\n\nBut these days, I'm browsing photo-related websites and it's just boring.\n\nIs it just me? Or has the field of photography moved on and all the current online publications no longer target me but target the new generation photographers about things that seem irrelevant to me?"}, {"autor": "SpartanFlight", "selftext": "I'm going to keep it short cause I suck at expressing my thoughts. I saw an add pop up on my IG feed \"saying free 8 x 8 hard cover book\".\n\nI said why not.  After giving some personal information (my website, website email, pretty much checking to see if I was a photographer) I was given a coupon code to get a free 24 page 8 x 8 book.  I still had to pay shipping (around 12 dollars)\n\nPros:\n\n* Book arrived quickly after ordered (1 week)\n\n* Inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* The website was really really easy to use\n\n\n\nCons:\n\n*  Book ships from China (I would never trust my full res photos to a chinese company EVER, for my own clothing brands and local printing I can vet for my local shops not to steal my designs, and control the quality of my work.  Also the company plays off like they are Canadian.\n\n* The print quality was very mediocre.  For comparison, my previous book was printed from blurb.  Any brightness adjustments were made in when i designed my book, and what i saw on my monitor was shown on the book.  Not so much with zno.  The Hardcover feels like a pillow?  .  My photos were missing fine detail.  I suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* Price is expensive.  This book was 66 dollars Canadian if I paid, for 24 pages.  For Comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\nTL;DR.  \n\nJust use blurb.  ZNO is essentially a fancy dropshipping website.", "title": "ZNO Book Review", "num-comments": 6, "score": 1, "date": "2020-07-16 20:00:10", "content": "ZNO Book Review /!/ I'm going to keep it short cause I suck at expressing my thoughts. I saw an add pop up on my IG feed \"saying free 8 x 8 hard cover book\".\n\nI said why not.  After giving some personal information (my website, website email, pretty much checking to see if I was a photographer) I was given a coupon code to get a free 24 page 8 x 8 book.  I still had to pay shipping (around 12 dollars)\n\nPros:\n\n* Book arrived quickly after ordered (1 week)\n\n* Inside pages are very thick cardstock, kinda like a preschoolers childrens book.\n\n* The website was really really easy to use\n\n\n\nCons:\n\n*  Book ships from China (I would never trust my full res photos to a chinese company EVER, for my own clothing brands and local printing I can vet for my local shops not to steal my designs, and control the quality of my work.  Also the company plays off like they are Canadian.\n\n* The print quality was very mediocre.  For comparison, my previous book was printed from blurb.  Any brightness adjustments were made in when -----> i designed !!!  my book, and what i saw on my monitor was shown on the book.  Not so much with zno.  The Hardcover feels like a pillow?  .  My photos were missing fine detail.  I suspect that the printers that they use suffer from contrast range/dynamic range.\n\n* Price is expensive.  This book was 66 dollars Canadian if I paid, for 24 pages.  For Comparison my book from blurb was a hardcover 13 x 11 inches, came on archival paper and was ~100 pages and cost me 130 dollars.\n\nTL;DR.  \n\nJust use blurb.  ZNO is essentially a fancy dropshipping website."}, {"autor": "16_Walls", "selftext": "nan", "title": "A Beginner Practicing Photography. Here's My Attempt of a Rainy Street Lamp. How Shall I Improve?", "num-comments": 2, "score": 1, "date": "2020-07-16 16:33:48", "content": "A Beginner Practicing Photography. Here's My Attempt of a Rainy Street Lamp. How Shall -----> I Improve !!! ?"}, {"autor": "ThorDansLaCroix", "selftext": "I once had a Brazilian flatmate in Dublin who had just arrived in Ireland. In one of our first conversations he told me about the “prostitutes” in the bohemian neighbourhood called Temple Bar. I was surprised because after couple of years living near Temple Bar I have never seen a sex worker. During the conversation I realized the women he was referring to, as sex workers, were just women wearing mini-skirt – which is a very common women outfit in Ireland and UK even during winter. For the new comer from Brazil women showing more legs than he was used to see in public had an automatic association to prostitution.  \n\n\nIn my first couple of weeks in Freiburg – Germany -, when I was looking for a place to live, I was eating in a bar with my mother when a group of 5 men joined our big table. During the conversation they learned we are Brazilians and told us with a big enthusiasm they were going to spend their holidays, in the following month, in Brazil. After a while I asked one of them, who didn’t share the same enthusiasm than the others, if he was going to spend his holidays in Brazil as well. He answered with a gesture of showing his wedding ring on his finger. I suddenly thought he was suggesting that his friends were going to Brazil with sexual intentions, specially because sex tourism in Brazil is very common and many people in Sough Germany have the image of Brazilian women as being easy to take to bed – Since Brazilians are often very attracted to foreigners. Maybe I misinterpreted his gesture, maybe he was just saying that he is not as free to travel as his friends who are single, because of family responsibilities, but I could not help thinking about sex tourism through his silent message.  \n\n\nI think it is interesting the fact that among Brazil, Ireland and Germany the first is the more conservative and moralist when the subject is nudity, which is a false morality to protect them from their own dirty minds. Different from Germany with many parks and saunas where people can spend their time - on their own, with friends or with their families - completely naked . During German’s summer toddlers are running and playing completely nude in their gardens while in Brazil parents are concerned about their toddlers private parts, or even underwear, being exposed in public. In Brazil there are some isolated beaches with nude areas but in general nudity is not tolerated or allowed - not even topless regarding women. In Brazil nudity is automatically associated with sexual provocation. Ireland and the UK don’t have the open air or sauna nude culture as in the Nordic countries but nobody minds women showing their skin. Once a naked woman, walking in the streets in the UK, was stopped by a policeman, not to reprimand her but, to inform her about the law saying that her being nude in public is not an offense, but if somebody complains for feeling offended then it becomes an offense.  \n\n\nAny bath place is supposed to be a place where people don’t need to wear clothes. In South France, where it used to be common for people to be nude in the beaches, people, and specially women, feel less comfortable with nudity because of the new generation of young men who automatic associate nude women as a sign of “available to sex”. Women, then, became more frequent victims of harassment.  \n\n\nWhen I started with photography, in Ireland, it was always easy to find people to photograph, especially women. Soon I had my first boudoir photo shoot which for my surprise ended as nude photo shoot. It was a woman who contacted me looking for sensual photos but during the photo shoot she felt comfortable enough to just take out her clothes and continuous the shooting naked. Thanks to her I had photos for my portfolio which brought me more women wanting nude photos, especially after I developed a classic visual language with film negative photos that people became attracted to. Most people associate nude photography with pornography - anything can be turned into pornography in fact, it only requires the viewer imagination and intention\\[1\\] – but it is not how I see my work. As a man I am naturally interested in women's beauty and women's bodies but it doesn’t mean I have the sexual view about people I photograph for being naked but the opposite; I have a big respect for people who trust me and my work since most of my photo shoots are just me and the model.  \n\n\nSome people, especially in Brazil, quickly ask me if I sleep with the models I photograph because they can’t help associating nudity to sexual activity. Nudity, instead, gives people a sense of freedom. I only photographed a couple of nude men and it was more evident from them their enthusiasm for being naked - and for having a creative image of their body's expression. I first released it when I was photographing a woman who the body seemed stuck during my posing direction. I told her that she doesn’t look comfortable and that I could not get good body composition from her. She then asked me if I could see her private parts, to which I replied saying that I am too focused on the body composition, lighting, camera setting, framing , focus and the image narrative that looking at her private parts never crossed my mind. It seemed to me her worries came from the fact I was photographing her with an old manual film camera, with a slow focus ring in the lens; Because of the system it takes me a little extra time to find the focus before I press the camera shutter release. I tried to explain about the camera to her but she was satisfied with my first explanation; She didn’t want to hear about my camera but go on with the photo shoot, this time feeling completely free with no worries about what in her body may be exposed, even if it appears in the photo. It is through people's eyes where we confirm who we are \\[2\\].  \n\n\nWe fear people's judgement which makes us feel self-conscious. When we are self-conscious, we feel uncomfortable, dissociated from the place and people around us, alien to our surroundings, causing us to cover who we are looking for privacy. Being naked and being accepted as we are without clothes means self-confirmation and so self-acceptance. It gives people more confidence about their body and so about themselves, because they can do whatever they are doing and forget about themselves, feeling more connected to whatever they are doing, enjoying the moment completely and so feeling free. Many people ask me how I convince people to take their clothes off or how I convince women to have certain poses when naked. I never needed to convince anybody to do anything, it was all their decision in the first place, their self-disclosure, to the joy of appearing in the world and deed without equivocation and without self-reflection that are inherent in action\\[3\\].  \n\n\nIn Germany it is much more difficult to have people who want nude photo shoots. Instead of paying me they want to be paid. Often it has to do with the fact that Germans are more cynic for feeling suspicious about people's intentions, especially those who they don’t know. German introversion makes them feel more alienated from people and so more self-conscious, which explains the awkwardness that often Germans have. But this cynicism and uneasy feeling among strangers is not the main reason, it seems. I believe the main reason is because they are more used and so comfortable enough with their naked body in public. Instead of photo shoots, for the creative expression of their body freedom, they rather go to saunas and nude public parks where they can enjoy the freedom of their body without the need of interaction with another person, but on their own or with their family in their introverted manner.  \n​  \nThe ancient Greek had the Polis, the public space where people could interact and become equal to others, which separate them from their private life where people had their own individuality. This public space was for Theseus what enabled ordinary man to bear life’s burden, for providing the safe space for public interaction, but it was also where people hide their individuality in order to become equals and so respect each other \\[4\\]. The medieval Christianity thinking and social tradition had no Polis separating the public and the private. People became equal to each other not through a political space designated for political interaction but through every individual, where God becomes ubiquitous in every person's eyes, turning their presence public and their action as action towards God itself \\[5\\]. Consequently, people had to hide more of themselves in order to preserve their individuality. I feel Germans keep something of this separation of public and private tradition, with their closed friend circle as their Polis where they can interact and express themselves to each other as equal, while outside it they can be “naked”, with no need to hide their individuality in order to preserve it; Or as Germans like to say, “*being direct”*. The Irish, maintaining a more medieval Christian tradition, have the public space on every individual eyes who they can interact and express themselves with, in order to bear life burden, but hiding their individuality in order to preserve it. The photo shooting seems to be for the Irish the private sphere where people can be free from the public “burden” but, at the same time, they can appear to the public by showing their individual expression through the photo results, since it is only through others’ eyes we can confirm ourselves. It also seems to be the reason the so-called “German directness” is interpreted as rudeness for most westerns. Politeness is in fact against directness; Hiding our true thinking and wish to act, our individuality, to respect those through whom we see ourselves as in the eyes of the public arena – God ubiquitous. Germans feel free to not hide their true feelings because what the Irish see as public for the Germans is seen as private, the space where people can have their individuality, action without the public “burden”. The German introversion seems to be a preservation of their individuality on what for the Irish is supposed to be public.  \n\n\nIn today’s society there is no such thing as private space other than our own home \\[6\\]. The patriarchal family was supposed to be the private kingship where one can have our individuality freedom apart from the public, the reason the Greeks, originally a matriarchal society, created the Polis as contrast to the private patriarchal kingdom \\[7\\]. God ubiquitous came to replace the Polis during Medieval times. The Equality among people is what is replacing God ubiquitous in today’s society. Universal equality invades even the patriarchal family – the private kingdom – in order to assure people’s basic equality rights.  \n\n\n​Different cultures find their way to appear and to hide. In order to keep prolific with nude photography, after moving to Germany, I started photographing myself; this time with pinhole cameras which work with long exposure photography. I never felt completely comfortable being nude in public - especially coming from a judging and mocking culture that is strong in Brazil, where the public and the private are merged and confused as attempt to find their individual expression and, at the same time, afraid of losing both all together – but doing my creative work, that now included my own body expression, made me feel very good and more comfortable in my own body. Like a work of art which we create from our own expression, the body then becomes a work of art – or it has always been - through which we find our individuality in our nudity and, at the same time, our public expression through the image result. The public where we confirm our own self narrative, which without we have no identity.\n\n  \n\\----\n\n​\\[1\\] HUSTVEDT, S. A Plea for Eros. Separata de; HUSTVEDT, S. A Plea for Eros: Essays. NY: Picador, 2006  \n\\[2\\] ARENDT, H. The Life of the Mind: The groundbreaking investigation on how we think.  New York: Houghton Mifflin Harcourt, 1977.  \n\\[3,4,5\\] ARENDT, H. On Revolution.  London: Faber &amp; Faber, 2016.  \n\\[6\\] ARENDT, H. The Human Condition: Chicago: University of Chicago Press, 2018. Second Edition.  \n\\[7\\] RANK, O. Psychology and The Soul. Mansfield Center, CT : Martino Publishing, 2011. \n\n&amp;#x200B;\n\n [http://www.marciofaustino.com/blog/about-nudity](http://www.marciofaustino.com/blog/about-nudity)", "title": "About Nudity", "num-comments": 101, "score": 1, "date": "2020-07-31 12:53:39", "content": "About Nudity /!/ I once had a Brazilian flatmate in Dublin who had just arrived in Ireland. In one of our first conversations he told me about the “prostitutes” in the bohemian neighbourhood called Temple Bar. I was surprised because after couple of years living near Temple Bar I have never seen a sex worker. During the conversation I realized the women he was referring to, as sex workers, were just women wearing mini-skirt – which is a very common women outfit in Ireland and UK even during winter. For the new comer from Brazil women showing more legs than he was used to see in public had an automatic association to prostitution.  \n\n\nIn my first couple of weeks in Freiburg – Germany -, when I was looking for a place to live, I was eating in a bar with my mother when a group of 5 men joined our big table. During the conversation they learned we are Brazilians and told us with a big enthusiasm they were going to spend their holidays, in the following month, in Brazil. After a while I asked one of them, who didn’t share the same enthusiasm than the others, if he was going to spend his holidays in Brazil as well. He answered with a gesture of showing his wedding ring on his finger. I suddenly thought he was suggesting that his friends were going to Brazil with sexual intentions, specially because sex tourism in Brazil is very common and many people in Sough Germany have the image of Brazilian women as being easy to take to bed – Since Brazilians are often very attracted to foreigners. Maybe I misinterpreted his gesture, maybe he was just saying that he is not as free to travel as his friends who are single, because of family responsibilities, but I could not help thinking about sex tourism through his silent message.  \n\n\nI think it is interesting the fact that among Brazil, Ireland and Germany the first is the more conservative and moralist when the subject is nudity, which is a false morality to protect them from their own dirty minds. Different from Germany with many parks and saunas where people can spend their time - on their own, with friends or with their families - completely naked . During German’s summer toddlers are running and playing completely nude in their gardens while in Brazil parents are concerned about their toddlers private parts, or even underwear, being exposed in public. In Brazil there are some isolated beaches with nude areas but in general nudity is not tolerated or allowed - not even topless regarding women. In Brazil nudity is automatically associated with sexual provocation. Ireland and the UK don’t have the open air or sauna nude culture as in the Nordic countries but nobody minds women showing their skin. Once a naked woman, walking in the streets in the UK, was stopped by a policeman, not to reprimand her but, to inform her about the law saying that her being nude in public is not an offense, but if somebody complains for feeling offended then it becomes an offense.  \n\n\nAny bath place is supposed to be a place where people don’t need to wear clothes. In South France, where it used to be common for people to be nude in the beaches, people, and specially women, feel less comfortable with nudity because of the new generation of young men who automatic associate nude women as a sign of “available to sex”. Women, then, became more frequent victims of harassment.  \n\n\nWhen I started with photography, in Ireland, it was always easy to find people to photograph, especially women. Soon I had my first boudoir photo shoot which for my surprise ended as nude photo shoot. It was a woman who contacted me looking for sensual photos but during the photo shoot she felt comfortable enough to just take out her clothes and continuous the shooting naked. Thanks to her I had photos for my portfolio which brought me more women wanting nude photos, especially after -----> I developed !!!  a classic visual language with film negative photos that people became attracted to. Most people associate nude photography with pornography - anything can be turned into pornography in fact, it only requires the viewer imagination and intention\\[1\\] – but it is not how I see my work. As a man I am naturally interested in women's beauty and women's bodies but it doesn’t mean I have the sexual view about people I photograph for being naked but the opposite; I have a big respect for people who trust me and my work since most of my photo shoots are just me and the model.  \n\n\nSome people, especially in Brazil, quickly ask me if I sleep with the models I photograph because they can’t help associating nudity to sexual activity. Nudity, instead, gives people a sense of freedom. I only photographed a couple of nude men and it was more evident from them their enthusiasm for being naked - and for having a creative image of their body's expression. I first released it when I was photographing a woman who the body seemed stuck during my posing direction. I told her that she doesn’t look comfortable and that I could not get good body composition from her. She then asked me if I could see her private parts, to which I replied saying that I am too focused on the body composition, lighting, camera setting, framing , focus and the image narrative that looking at her private parts never crossed my mind. It seemed to me her worries came from the fact I was photographing her with an old manual film camera, with a slow focus ring in the lens; Because of the system it takes me a little extra time to find the focus before I press the camera shutter release. I tried to explain about the camera to her but she was satisfied with my first explanation; She didn’t want to hear about my camera but go on with the photo shoot, this time feeling completely free with no worries about what in her body may be exposed, even if it appears in the photo. It is through people's eyes where we confirm who we are \\[2\\].  \n\n\nWe fear people's judgement which makes us feel self-conscious. When we are self-conscious, we feel uncomfortable, dissociated from the place and people around us, alien to our surroundings, causing us to cover who we are looking for privacy. Being naked and being accepted as we are without clothes means self-confirmation and so self-acceptance. It gives people more confidence about their body and so about themselves, because they can do whatever they are doing and forget about themselves, feeling more connected to whatever they are doing, enjoying the moment completely and so feeling free. Many people ask me how I convince people to take their clothes off or how I convince women to have certain poses when naked. I never needed to convince anybody to do anything, it was all their decision in the first place, their self-disclosure, to the joy of appearing in the world and deed without equivocation and without self-reflection that are inherent in action\\[3\\].  \n\n\nIn Germany it is much more difficult to have people who want nude photo shoots. Instead of paying me they want to be paid. Often it has to do with the fact that Germans are more cynic for feeling suspicious about people's intentions, especially those who they don’t know. German introversion makes them feel more alienated from people and so more self-conscious, which explains the awkwardness that often Germans have. But this cynicism and uneasy feeling among strangers is not the main reason, it seems. I believe the main reason is because they are more used and so comfortable enough with their naked body in public. Instead of photo shoots, for the creative expression of their body freedom, they rather go to saunas and nude public parks where they can enjoy the freedom of their body without the need of interaction with another person, but on their own or with their family in their introverted manner.  \n​  \nThe ancient Greek had the Polis, the public space where people could interact and become equal to others, which separate them from their private life where people had their own individuality. This public space was for Theseus what enabled ordinary man to bear life’s burden, for providing the safe space for public interaction, but it was also where people hide their individuality in order to become equals and so respect each other \\[4\\]. The medieval Christianity thinking and social tradition had no Polis separating the public and the private. People became equal to each other not through a political space designated for political interaction but through every individual, where God becomes ubiquitous in every person's eyes, turning their presence public and their action as action towards God itself \\[5\\]. Consequently, people had to hide more of themselves in order to preserve their individuality. I feel Germans keep something of this separation of public and private tradition, with their closed friend circle as their Polis where they can interact and express themselves to each other as equal, while outside it they can be “naked”, with no need to hide their individuality in order to preserve it; Or as Germans like to say, “*being direct”*. The Irish, maintaining a more medieval Christian tradition, have the public space on every individual eyes who they can interact and express themselves with, in order to bear life burden, but hiding their individuality in order to preserve it. The photo shooting seems to be for the Irish the private sphere where people can be free from the public “burden” but, at the same time, they can appear to the public by showing their individual expression through the photo results, since it is only through others’ eyes we can confirm ourselves. It also seems to be the reason the so-called “German directness” is interpreted as rudeness for most westerns. Politeness is in fact against directness; Hiding our true thinking and wish to act, our individuality, to respect those through whom we see ourselves as in the eyes of the public arena – God ubiquitous. Germans feel free to not hide their true feelings because what the Irish see as public for the Germans is seen as private, the space where people can have their individuality, action without the public “burden”. The German introversion seems to be a preservation of their individuality on what for the Irish is supposed to be public.  \n\n\nIn today’s society there is no such thing as private space other than our own home \\[6\\]. The patriarchal family was supposed to be the private kingship where one can have our individuality freedom apart from the public, the reason the Greeks, originally a matriarchal society, created the Polis as contrast to the private patriarchal kingdom \\[7\\]. God ubiquitous came to replace the Polis during Medieval times. The Equality among people is what is replacing God ubiquitous in today’s society. Universal equality invades even the patriarchal family – the private kingdom – in order to assure people’s basic equality rights.  \n\n\n​Different cultures find their way to appear and to hide. In order to keep prolific with nude photography, after moving to Germany, I started photographing myself; this time with pinhole cameras which work with long exposure photography. I never felt completely comfortable being nude in public - especially coming from a judging and mocking culture that is strong in Brazil, where the public and the private are merged and confused as attempt to find their individual expression and, at the same time, afraid of losing both all together – but doing my creative work, that now included my own body expression, made me feel very good and more comfortable in my own body. Like a work of art which we create from our own expression, the body then becomes a work of art – or it has always been - through which we find our individuality in our nudity and, at the same time, our public expression through the image result. The public where we confirm our own self narrative, which without we have no identity.\n\n  \n\\----\n\n​\\[1\\] HUSTVEDT, S. A Plea for Eros. Separata de; HUSTVEDT, S. A Plea for Eros: Essays. NY: Picador, 2006  \n\\[2\\] ARENDT, H. The Life of the Mind: The groundbreaking investigation on how we think.  New York: Houghton Mifflin Harcourt, 1977.  \n\\[3,4,5\\] ARENDT, H. On Revolution.  London: Faber &amp; Faber, 2016.  \n\\[6\\] ARENDT, H. The Human Condition: Chicago: University of Chicago Press, 2018. Second Edition.  \n\\[7\\] RANK, O. Psychology and The Soul. Mansfield Center, CT : Martino Publishing, 2011. \n\n&amp;#x200B;\n\n [http://www.marciofaustino.com/blog/about-nudity](http://www.marciofaustino.com/blog/about-nudity)"}, {"autor": "MushroomKid", "selftext": "I've seen tutorials on how to create a softbox for traditional circle desk lamps, but because the abnormal shape of the Mi Desk lamp i'm not quite sure how i would go about doing so.   \n\nIm not sure if i can post links in this subreddit, therefore just search up the relevant name.  \n\n&amp;#x200B;\n\nThanks", "title": "How would i create a softbox for Mi Desk Lamp 1s", "num-comments": 1, "score": 1, "date": "2020-08-17 12:40:07", "content": "How would -----> i create !!!  a softbox for Mi Desk Lamp 1s /!/ I've seen tutorials on how to create a softbox for traditional circle desk lamps, but because the abnormal shape of the Mi Desk lamp i'm not quite sure how i would go about doing so.   \n\nIm not sure if i can post links in this subreddit, therefore just search up the relevant name.  \n\n&amp;#x200B;\n\nThanks"}, {"autor": "SgtPepe", "selftext": "[removed]", "title": "Hi everyone, he's an illustration I created for creating NFTs of your artwork (photos, illustrations, etc).", "num-comments": 1, "score": 1, "date": "2021-06-07 15:51:14", "content": "Hi everyone, he's an illustration -----> I created !!!  for creating NFTs of your artwork (photos, illustrations, etc). /!/ [removed]"}, {"autor": "1slander", "selftext": "I've recently been employed as a full-time photographer for a motorcycle parts distributer. We've got a great studio with 5 Godox VL-300 lights, 2 with octo diffusers and 2 with rectangular diffusers and, and I'm struggling with lighting helmets, visors and screens. We've got some budget to play with to get new equipment, but I've been trying as hard as I can to use what we have to light the products properly to completely eliminate reflections. As it stands, I am really struggling.\n\n[Examples.](https://imgur.com/a/80BG6KH)\n\nWe've recently got a 1.5m x 6m sheet of diffusing material that we're going to use to create a large diffuser, but I was wandering if anyone had any advice/experience to share. I've searched extensively online and the best info I've found so far is from someone who said that they had a custom 12ft softbox/diffuser built for this purpose.\n\nShould we instead be using flashes with umbrellas etc?\n\nTIA!\n\nEdit: [Here's a shot of the studio for reference.](https://imgur.com/a/tYTKXX2)", "title": "How can I improve my lighting set up to remove reflections from my product photos?", "num-comments": 57, "score": 5, "date": "2021-06-16 14:36:55", "content": "How can -----> I improve !!!  my lighting set up to remove reflections from my product photos? /!/ I've recently been employed as a full-time photographer for a motorcycle parts distributer. We've got a great studio with 5 Godox VL-300 lights, 2 with octo diffusers and 2 with rectangular diffusers and, and I'm struggling with lighting helmets, visors and screens. We've got some budget to play with to get new equipment, but I've been trying as hard as I can to use what we have to light the products properly to completely eliminate reflections. As it stands, I am really struggling.\n\n[Examples.](https://imgur.com/a/80BG6KH)\n\nWe've recently got a 1.5m x 6m sheet of diffusing material that we're going to use to create a large diffuser, but I was wandering if anyone had any advice/experience to share. I've searched extensively online and the best info I've found so far is from someone who said that they had a custom 12ft softbox/diffuser built for this purpose.\n\nShould we instead be using flashes with umbrellas etc?\n\nTIA!\n\nEdit: [Here's a shot of the studio for reference.](https://imgur.com/a/tYTKXX2)"}, {"autor": "1slander", "selftext": "nan", "title": "How can I improve my lighting set up to eliminate these reflections from my photos?", "num-comments": 2, "score": 1, "date": "2021-06-16 14:29:49", "content": "How can -----> I improve !!!  my lighting set up to eliminate these reflections from my photos?"}, {"autor": "Vegaref", "selftext": "nan", "title": "what can i improve on?:)", "num-comments": 2, "score": 1, "date": "2021-09-03 15:49:56", "content": "what can -----> i improve !!!  on?:)"}, {"autor": "benevans_92", "selftext": "nan", "title": "Can someone help me create a filter similar to this on VSCO mobile app(picture for reference)", "num-comments": 2, "score": 1, "date": "2021-09-10 20:42:47", "content": "Can someone help -----> me create !!!  a filter similar to this on VSCO mobile app(picture for reference)"}, {"autor": "levsw", "selftext": "I developed an app that displays your personal photos on a world map. It reads the exif information from your photos and show them on a google map (or openstreetmaps).\n\nHere is the link to the Play Store: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map\n\nAny feedback is welcome :)", "title": "I developed an Android App for photographers and travelers", "num-comments": 2, "score": 1, "date": "2021-08-04 10:36:24", "content": "-----> I developed !!!  an Android App for photographers and travelers /!/ -----> I developed !!!  an app that displays your personal photos on a world map. It reads the exif information from your photos and show them on a google map (or openstreetmaps).\n\nHere is the link to the Play Store: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map\n\nAny feedback is welcome :)"}, {"autor": "Browserhistory666", "selftext": "Hey all,\n\nI've been taking photos for about five years now and I'm trying to teach myself a new color grade technique rather than just rely on a LUT. I'm definitely still a rookie in all areas, and particularly photoshop, but I've done some research and found some references so hopefully this is a good starting point. Thanks in advance!\n\nI'm working on a personal project with a 70s theme and I'd like it to have the deep saturated colours of the below image. This is a screenshot taken from the film If Beale Street could talk, which was inspired by the photography of [Jack Garofalo](https://designyoutrust.com/2018/11/vibrant-life-of-1970s-harlem-as-photographed-by-jack-garofalo/). Those photographers also shot on Provia which was a film stock by Fujifilm. Here's a link to the [colorists reel](https://www.colorcollective.com/beale-street) who did the movie. \n\n\"We didn’t want to rely on period tropes — soft contrast, milky shadows, and a faded color palette,” says the film’s colorist, Alex Bickel.\"  I'm trying to stay away from the cliche orange and teal look too.\n\nHow would you recommend I create this look? Hopefully my research helps as a starting point. I usually use curves and levels to edit. Currently, I see yellow in the highlights, maybe Green in the shadows and warm overall colours (up the saturation, bring the blues down?) Not sure if this is correct, but would love some general pointers to get started. \n\nhttps://preview.redd.it/pmg4g1etl8f71.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;s=87f193ff9205bfb50bee126a4fff493f17cd89cc", "title": "Trying to learn a new photo editing style!", "num-comments": 1, "score": 1, "date": "2021-08-04 00:40:53", "content": "Trying to learn a new photo editing style! /!/ Hey all,\n\nI've been taking photos for about five years now and I'm trying to teach myself a new color grade technique rather than just rely on a LUT. I'm definitely still a rookie in all areas, and particularly photoshop, but I've done some research and found some references so hopefully this is a good starting point. Thanks in advance!\n\nI'm working on a personal project with a 70s theme and I'd like it to have the deep saturated colours of the below image. This is a screenshot taken from the film If Beale Street could talk, which was inspired by the photography of [Jack Garofalo](https://designyoutrust.com/2018/11/vibrant-life-of-1970s-harlem-as-photographed-by-jack-garofalo/). Those photographers also shot on Provia which was a film stock by Fujifilm. Here's a link to the [colorists reel](https://www.colorcollective.com/beale-street) who did the movie. \n\n\"We didn’t want to rely on period tropes — soft contrast, milky shadows, and a faded color palette,” says the film’s colorist, Alex Bickel.\"  I'm trying to stay away from the cliche orange and teal look too.\n\nHow would you recommend -----> I create !!!  this look? Hopefully my research helps as a starting point. I usually use curves and levels to edit. Currently, I see yellow in the highlights, maybe Green in the shadows and warm overall colours (up the saturation, bring the blues down?) Not sure if this is correct, but would love some general pointers to get started. \n\nhttps://preview.redd.it/pmg4g1etl8f71.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;s=87f193ff9205bfb50bee126a4fff493f17cd89cc"}, {"autor": "polydactylmonoclonal", "selftext": "I’ve been an amateur photographer since HS when I developed my own B&amp;W film in my closet ca 2004. I feel like I have a very strong grasp of the fundamentals of using the camera (altho I wish I knew more about using flash) and things like that. A beginners class would bore me. Can anyone recommend like an online course or a book for juicing ones creativity and learning new things? I feel like I’d do best with some level of structure and expectation beyond just reading a Michael Freeman book. Hope this is the right place to ask thanks!", "title": "Intermediate photography", "num-comments": 1, "score": 1, "date": "2021-07-17 19:03:11", "content": "Intermediate photography /!/ I’ve been an amateur photographer since HS when -----> I developed !!!  my own B&amp;W film in my closet ca 2004. I feel like I have a very strong grasp of the fundamentals of using the camera (altho I wish I knew more about using flash) and things like that. A beginners class would bore me. Can anyone recommend like an online course or a book for juicing ones creativity and learning new things? I feel like I’d do best with some level of structure and expectation beyond just reading a Michael Freeman book. Hope this is the right place to ask thanks!"}, {"autor": "FlarpleWolf", "selftext": "[removed]", "title": "[HELP] Anyone know how to turn off Infinite Colour asking if I want a new layer every time I create?", "num-comments": 1, "score": 0, "date": "2020-04-17 09:56:07", "content": "[HELP] Anyone know how to turn off Infinite Colour asking if I want a new layer every time -----> I create !!! ? /!/ [removed]"}, {"autor": "WiccedSwede", "selftext": "nan", "title": "I designed and 3D printed a beefy camera grip so I won't get hand pains anymore while shooting for extended periods of time. Hope I can help someone with this idea.", "num-comments": 1, "score": 1, "date": "2020-06-01 18:22:27", "content": "-----> I designed !!!  and 3D printed a beefy camera grip so I won't get hand pains anymore while shooting for extended periods of time. Hope I can help someone with this idea."}, {"autor": "NutellaOreoReeses", "selftext": "[removed]", "title": "I have a lot of diversification in my photography. Should I create separate websites for each genre?", "num-comments": 3, "score": 1, "date": "2020-06-28 04:08:30", "content": "I have a lot of diversification in my photography. Should -----> I create !!!  separate websites for each genre? /!/ [removed]"}, {"autor": "zander05295", "selftext": "nan", "title": "So I have been recently getting into wildlife photography and was wanting to get some feed back on this picture I took and any tips you all may have that could help me improve for the future! Thank you for your time!", "num-comments": 1, "score": 1, "date": "2020-06-20 23:28:05", "content": "So I have been recently getting into wildlife photography and was wanting to get some feed back on this picture I took and any tips you all may have that could help -----> me improve !!!  for the future! Thank you for your time!"}, {"autor": "ryanjowitt", "selftext": "nan", "title": "Check out this photo,how could I improve it.", "num-comments": 2, "score": 1, "date": "2020-05-03 08:41:31", "content": "Check out this photo,how could -----> I improve !!!  it."}, {"autor": "Kalpa_chathu", "selftext": "nan", "title": "Guys check out how I created this awesome Twirl effect image in photoshop", "num-comments": 2, "score": 1, "date": "2020-11-10 16:18:06", "content": "Guys check out how -----> I created !!!  this awesome Twirl effect image in photoshop"}, {"autor": "Matingas", "selftext": "Hi all,\n\nI recently took some astro shots I was proud of and decided to splurge and buy a print of my own picture through Amazon. The result was disappointing... I'm not sure if I should complain to Amazon or accept the fact that my photo wasn't that good to begin with and that's how it looks in print.\n\n[Here is an album](https://imgur.com/a/idJZ1k5) I created for the situation: [[LINK](https://imgur.com/a/idJZ1k5)]\n\nHas anyone experienced printing with Amazon? \n\nIssues or good comments? \n\nShould I have printed on metal? \n\nShould I complain and expect my money back? \n\nThanks", "title": "Printing astrophotography in acrylic through Amazon- Experience / Question", "num-comments": 1, "score": 1, "date": "2020-10-21 21:42:43", "content": "Printing astrophotography in acrylic through Amazon- Experience / Question /!/ Hi all,\n\nI recently took some astro shots I was proud of and decided to splurge and buy a print of my own picture through Amazon. The result was disappointing... I'm not sure if I should complain to Amazon or accept the fact that my photo wasn't that good to begin with and that's how it looks in print.\n\n[Here is an album](https://imgur.com/a/idJZ1k5) -----> I created !!!  for the situation: [[LINK](https://imgur.com/a/idJZ1k5)]\n\nHas anyone experienced printing with Amazon? \n\nIssues or good comments? \n\nShould I have printed on metal? \n\nShould I complain and expect my money back? \n\nThanks"}, {"autor": "AmyIsDeMan", "selftext": "Hi! It’s my first time posting here, and I’m not sure if this is allowed.\nI’m 18 and I study photography, I’m hoping to go to university next year.\nI’m looking for someone who can give me solid advice and help me improve my work; especially as now I’m building my portfolio for university. Thank you!", "title": "Looking for a mentor", "num-comments": 2, "score": 1, "date": "2020-01-18 19:36:51", "content": "Looking for a mentor /!/ Hi! It’s my first time posting here, and I’m not sure if this is allowed.\nI’m 18 and I study photography, I’m hoping to go to university next year.\nI’m looking for someone who can give me solid advice and help -----> me improve !!!  my work; especially as now I’m building my portfolio for university. Thank you!"}, {"autor": "bignick1190", "selftext": "Ok so let's say i wanted to use [this \"super-res\" technique](https://petapixel.com/2015/02/21/a-practical-guide-to-creating-superresolution-photos-with-photoshop/) in conjunction with HDR photos, how much of the tonal range is retained when layering said HDR photos.\n\n&amp;#x200B;\n\nSo to give  a bit more detail-\n\nTake 5 bracketed shots at different exposures 10 times (so 50 photos). This gives me a total of 10 final photos to now use the technique above to create a \"super-res\" photo. If i create the \"super-res\" before editing the photo is the tonal range retained from the HDR brakets?\n\n&amp;#x200B;\n\nor, should i edit the photos prior to creating a \"super-res\" photo?", "title": "\"Super-Res\", HDR Question/ Discussion.", "num-comments": 18, "score": 1, "date": "2020-11-02 17:54:11", "content": "\"Super-Res\", HDR Question/ Discussion. /!/ Ok so let's say i wanted to use [this \"super-res\" technique](https://petapixel.com/2015/02/21/a-practical-guide-to-creating-superresolution-photos-with-photoshop/) in conjunction with HDR photos, how much of the tonal range is retained when layering said HDR photos.\n\n&amp;#x200B;\n\nSo to give  a bit more detail-\n\nTake 5 bracketed shots at different exposures 10 times (so 50 photos). This gives me a total of 10 final photos to now use the technique above to create a \"super-res\" photo. If -----> i create !!!  the \"super-res\" before editing the photo is the tonal range retained from the HDR brakets?\n\n&amp;#x200B;\n\nor, should i edit the photos prior to creating a \"super-res\" photo?"}, {"autor": "lensfog", "selftext": "nan", "title": "How can I improve? 10-24 f11 (sorry for compression). Tripod.", "num-comments": 2, "score": 1, "date": "2020-09-14 01:32:50", "content": "How can -----> I improve !!! ? 10-24 f11 (sorry for compression). Tripod."}, {"autor": "rufus_bowder", "selftext": "nan", "title": "My sister is doing photography AS level how can she improve", "num-comments": 2, "score": 1, "date": "2020-01-06 14:20:52", "content": "My sister is doing photography AS level how can -----> she improve !!! "}, {"autor": "HippoPOOPOO", "selftext": "nan", "title": "Here's a meme i created (GUYS IT'S ONLY A JOKE I'M USING A MIRORRLESS MYSELF", "num-comments": 2, "score": 1, "date": "2020-12-29 12:56:38", "content": "Here's a meme -----> i created !!!  (GUYS IT'S ONLY A JOKE I'M USING A MIRORRLESS MYSELF"}, {"autor": "ndamb2", "selftext": "nan", "title": "I created a BTS + How to video for photographing yourself! Have a look of you wish!", "num-comments": 0, "score": 1, "date": "2021-01-03 15:59:24", "content": "-----> I created !!!  a BTS + How to video for photographing yourself! Have a look of you wish!"}, {"autor": "alva_szarok", "selftext": "nan", "title": "Help me create the OF acc YOU want. I got the Pictures, I got the consistency, I wanna answer all your questions. AMA", "num-comments": 2, "score": 1, "date": "2021-01-06 03:00:49", "content": "Help -----> me create !!!  the OF acc YOU want. I got the Pictures, I got the consistency, I wanna answer all your questions. AMA"}, {"autor": "kendalinwonderland", "selftext": "So a few years ago, I started a self-portrait project to promote myself as an actress on Instagram. It's been fun, 99% of the photos I take myself and edit myself. On occasion I collaborate with someone like a boyfriend, friend, or photographer on something. \n\nLast year, I designed and hand-made a dress to be nearly identical to one that Audrey Hepburn wore in an early photo in Kew Gardens. I put together the whole outfit, and when I went to London, my plan was to go there either with a tripod or a friend and make my recreations. A newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nWe met at the park, and we started looking for the locations where the photos in Audrey's photo session were taken. I handed him my camera, and I and his mom would check the pictures on my phone to double check the angles and the poses. I ended up with three photos on my 'to do' list, which I then took home and edited, and shared on Instagram, of course thanking them for their help.\n\nCut to this year, another friend was working with a publisher on a book on Audrey Hepburn and really wanted to include some photos of me in the introduction. I sent over 9 of my favourites, including one from Kew. He decided on two that I had edited myself into, which were taken in the 1950's and 1960's. I assume he did whatever needed done to clear those. And the third was one from Kew. \n\nNow, the whole time before this, I've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. It's been a stressful year - I moved from California to France, and then went on a 3 month road trip (with my cat) between five countries. Then I spent a month apartment-hunting, and then trying to furnish the place. I've been extremely forgetful. I'll find emails I failed to reply to from 3 months ago. Anyway when I posted a photo of the page in the book, it was *then* that it was brought to my attention. I freaked the hell out and had a panic attack. I didn't mean to do that to my friends who had helped me create this picture I love. I was a wreck. I wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on IG that I had to take a mental health break for a while. I couldn't deal. For 3 days. Just couldn't eat, couldn't do much of anything, but I decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* I could do for myself because I don't even feel in control of my own brain at this point. Anyway I got it together and wrote her son a long apology on Friday, and told him what I would try to do to fix it, and to make it up to him. Still no response. But now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and I don't know, he's dealt with photos for decades, he's a collector and author and worked at the National Portrait Gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nSide note. My own personal issue here is WTF would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nBut my legal question (and sorry it took me this long to write this, but UGGGGG) is who owns this photo? I mean I was thinking about it today and honestly, I would be kind of pissed if HE used it without telling me, or asking me. Because it's my project, my series, I put way more effort into creating the photo than he did (I spent DAYS making the dress), he has no use for it, and I basically just handed him my camera. If you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? Personally, yes, I would appreciate a credit if someone used the photo I took of them, but I certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. This is MY photo. Now he's trying to limit what I can do with it, just because he stood there and pushed the button. I have another friend who told me to do whatever I wanted with the photos she took of me. We're friends and it's for fun. Now of course when I work with a photographer and sign a release, I get that I have to ask them first. But I'm 99% sure we did not sign a release (I'll leave 1% of doubt because I'm forgetful and haven't dug through my papers. But in my moving process I don't recall coming across one for that day). If he's going to start a fight over who can use MY photo, oh yeah I'm going to fight him. But hell, if he's going to be such an asshole about it, I'll just go back and take new photos there next time I'm in London. \n\nI'm definitely feeling bad about not acknowledging him, but I'm also getting pretty annoyed right now at the way they're dealing with this. I need some input, please!", "title": "Question about IP/copyrights when you ask for help taking a picture", "num-comments": 80, "score": 1, "date": "2020-01-27 22:41:12", "content": "Question about IP/copyrights when you ask for help taking a picture /!/ So a few years ago, I started a self-portrait project to promote myself as an actress on Instagram. It's been fun, 99% of the photos I take myself and edit myself. On occasion I collaborate with someone like a boyfriend, friend, or photographer on something. \n\nLast year, -----> I designed !!!  and hand-made a dress to be nearly identical to one that Audrey Hepburn wore in an early photo in Kew Gardens. I put together the whole outfit, and when I went to London, my plan was to go there either with a tripod or a friend and make my recreations. A newer friend of mine (we met because of a mutual ex-boyfriend) volunteered her teenage son to help take the photo, since he likes photography. \n\nWe met at the park, and we started looking for the locations where the photos in Audrey's photo session were taken. I handed him my camera, and I and his mom would check the pictures on my phone to double check the angles and the poses. I ended up with three photos on my 'to do' list, which I then took home and edited, and shared on Instagram, of course thanking them for their help.\n\nCut to this year, another friend was working with a publisher on a book on Audrey Hepburn and really wanted to include some photos of me in the introduction. I sent over 9 of my favourites, including one from Kew. He decided on two that I had edited myself into, which were taken in the 1950's and 1960's. I assume he did whatever needed done to clear those. And the third was one from Kew. \n\nNow, the whole time before this, I've been very good at giving photographers credit, but for some reason it just never crossed my mind, this whole time. It's been a stressful year - I moved from California to France, and then went on a 3 month road trip (with my cat) between five countries. Then I spent a month apartment-hunting, and then trying to furnish the place. I've been extremely forgetful. I'll find emails I failed to reply to from 3 months ago. Anyway when I posted a photo of the page in the book, it was *then* that it was brought to my attention. I freaked the hell out and had a panic attack. I didn't mean to do that to my friends who had helped me create this picture I love. I was a wreck. I wrote her an apology message (which she still hasn't replied to, 5 days later) and then basically posted on IG that I had to take a mental health break for a while. I couldn't deal. For 3 days. Just couldn't eat, couldn't do much of anything, but I decided to limit my social media, and anything unnecessary, start looking for a therapist, do *anything* I could do for myself because I don't even feel in control of my own brain at this point. Anyway I got it together and wrote her son a long apology on Friday, and told him what I would try to do to fix it, and to make it up to him. Still no response. But now my friend who used the photo for the book (who hadn't seemed concerned up until this point, calling it an 'assisted self-portrait', and I don't know, he's dealt with photos for decades, he's a collector and author and worked at the National Portrait Gallery) said that the kid has sent an angry email to his publisher, which wasn't very cool.\n\nSide note. My own personal issue here is WTF would they not even talk to me privately but rather make public posts, share it with their friends who call me horrible names, and then email the publisher but never even try to clear it up with me first. \n\nBut my legal question (and sorry it took me this long to write this, but UGGGGG) is who owns this photo? I mean I was thinking about it today and honestly, I would be kind of pissed if HE used it without telling me, or asking me. Because it's my project, my series, I put way more effort into creating the photo than he did (I spent DAYS making the dress), he has no use for it, and I basically just handed him my camera. If you handed a friend your camera and directed them on how to take the picture, how can they possibly claim that it's 'theirs'? Personally, yes, I would appreciate a credit if someone used the photo I took of them, but I certainly wouldn't stop them from using it if they were the ones to conceive it and do all the work to create it. This is MY photo. Now he's trying to limit what I can do with it, just because he stood there and pushed the button. I have another friend who told me to do whatever I wanted with the photos she took of me. We're friends and it's for fun. Now of course when I work with a photographer and sign a release, I get that I have to ask them first. But I'm 99% sure we did not sign a release (I'll leave 1% of doubt because I'm forgetful and haven't dug through my papers. But in my moving process I don't recall coming across one for that day). If he's going to start a fight over who can use MY photo, oh yeah I'm going to fight him. But hell, if he's going to be such an asshole about it, I'll just go back and take new photos there next time I'm in London. \n\nI'm definitely feeling bad about not acknowledging him, but I'm also getting pretty annoyed right now at the way they're dealing with this. I need some input, please!"}, {"autor": "throwmedownthewell07", "selftext": "I'm looking to hire a photographer to photograph the products I design primarily for use on social media. I haven't ever hired anyone before, so I don't really know what I should include in my ad! \n\nHow I would like it to work, to keep in line with covid (my country is in lockdown), is I would package and send my products to the photographer, they would style and photograph them, and then send me the images.\n\nI have a really clear image of what kind of content I'm looking for. My question is how best to communicate this to a potential photographer. I currently have dozens of photos from other brands/ Instagram accounts I have saved I use as inspiration when I do my own amateur photography. I'm wondering if it's appropriate to send these images to the person I hire and ask them to be inspired by them too? Is that okay? \n\nWhat kind of things do I need to include in my 'brief' to them?", "title": "What can I ask in an ad for a photographer?", "num-comments": 9, "score": 1, "date": "2021-01-13 14:14:18", "content": "What can I ask in an ad for a photographer? /!/ I'm looking to hire a photographer to photograph the products -----> I design !!!  primarily for use on social media. I haven't ever hired anyone before, so I don't really know what I should include in my ad! \n\nHow I would like it to work, to keep in line with covid (my country is in lockdown), is I would package and send my products to the photographer, they would style and photograph them, and then send me the images.\n\nI have a really clear image of what kind of content I'm looking for. My question is how best to communicate this to a potential photographer. I currently have dozens of photos from other brands/ Instagram accounts I have saved I use as inspiration when I do my own amateur photography. I'm wondering if it's appropriate to send these images to the person I hire and ask them to be inspired by them too? Is that okay? \n\nWhat kind of things do I need to include in my 'brief' to them?"}, {"autor": "pcSQL", "selftext": "I’m looking for an HTML template / tool that can generate a photo gallery and I can store it on USB drives. I’ve tried a few but won’t run locally stored files due to browser security. The idea is to store all my photos on USB flash drives so when the time comes and I pass away, I need to the photos to be accessible by family and friends where it’s not going to take anything to download or install. You just plug in the USB drive and open a browser.\n\nWe should all be thinking about this and how we remember getting access to grandma’s shoe box of photos, we may no longer be printing photos at the rate we develop them back in the day but we can’t risk the next generation family member throwing our computer away, or tossing out old hard drives because they don’t know how to access them. The other issue is the password on the computer.  I could just see my computer hanging out for years in the house after I’m gone until someone says “let’s see if we can get into it” yet to be presented with a password screen, then the computer gets thrown in a bin to go to the junkyard or the donation center. \n\nYou wouldn’t believe how many computers, camcorders etc that are thrown out that have family’s memories still on them. \n\nI’ve been printing a handful of photos every 6 months just to have an old shoe box with some photos. \n\nAny suggestions would be appreciated", "title": "USB HTML photo gallery tool?", "num-comments": 5, "score": 1, "date": "2020-09-29 18:49:51", "content": "USB HTML photo gallery tool? /!/ I’m looking for an HTML template / tool that can generate a photo gallery and I can store it on USB drives. I’ve tried a few but won’t run locally stored files due to browser security. The idea is to store all my photos on USB flash drives so when the time comes and I pass away, I need to the photos to be accessible by family and friends where it’s not going to take anything to download or install. You just plug in the USB drive and open a browser.\n\nWe should all be thinking about this and how we remember getting access to grandma’s shoe box of photos, we may no longer be printing photos at the rate -----> we develop !!!  them back in the day but we can’t risk the next generation family member throwing our computer away, or tossing out old hard drives because they don’t know how to access them. The other issue is the password on the computer.  I could just see my computer hanging out for years in the house after I’m gone until someone says “let’s see if we can get into it” yet to be presented with a password screen, then the computer gets thrown in a bin to go to the junkyard or the donation center. \n\nYou wouldn’t believe how many computers, camcorders etc that are thrown out that have family’s memories still on them. \n\nI’ve been printing a handful of photos every 6 months just to have an old shoe box with some photos. \n\nAny suggestions would be appreciated"}, {"autor": "AHand", "selftext": " Hello! I'm a college student studying computer science. I've been really interested in filmmaking / photography since I was young. Recently I've been getting into app development in my free time.\n\nAlias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nAny feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)", "title": "I created an app to make sharing your portfolio simple", "num-comments": 1, "score": 1, "date": "2020-10-02 03:06:47", "content": "-----> I created !!!  an app to make sharing your portfolio simple /!/  Hello! I'm a college student studying computer science. I've been really interested in filmmaking / photography since I was young. Recently I've been getting into app development in my free time.\n\nAlias lets you embed videos, link your social media profiles + contact info, and share everything from a single page - all for free!\n\nAny feedback would be super appreciated :)\n\n[https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548](https://apps.apple.com/us/app/alias-a-better-way-to-connect/id1458470548)"}, {"autor": "beffini", "selftext": "nan", "title": "Does anyone know an app that I can download that will help me create psychedelic effects like this?! account credit to @shawna_shoots on Instagram btw!", "num-comments": 2, "score": 1, "date": "2020-09-30 19:21:36", "content": "Does anyone know an app that I can download that will help -----> me create !!!  psychedelic effects like this?! account credit to @shawna_shoots on Instagram btw!"}, {"autor": "pigfeetceral", "selftext": "I'm getting very discouraged wit developing film. I think I'll just stick to scanning and let the professionals develop from here on out. I recently bought a Cinestill powder kit for color film developing, a Patterson Tank, and a dark bag. The Cinestill kit came with instructions on developing times, the whole jazz, measurements, what to mix together all of that. I developed two rolls of Porta 400 (36exp. some I extra pissed) with the kit and I am starting to think Cinestill's chemicals are just shit. Because I did everything correctly so I thought. It's not easy to pin point where I might've screwed up at, but once I finished the required time for the blix to be put into the tank, I added the final rinse image stabilizer. I left my film in the tank after I agitated it with the final rinse just to be sure the images would come out crisp. An hour pasts and I take the film out and let it blow dry with a fan. Once it's dry I load the film onto my Epson Scanner. Once I got into LR and Negative Lab Pro and make tiff scans of everything my images still had emissions on them. That problem I tried to fix by adding 99% alcohol to clean them which helped get rid of streaks and dust and whatnot. But the main problem I had was once converted the negatives, no matter how much color correction editing I within the NLP program the images were still so deeply blue and out of contrast from how they were supposed to look that it doesn't look like I would be able to fix them. I know I'm all over the place with this. I tried to explain the best I could. I'm running out of options and patience with developing. Any suggestions on what probably went wrong? Any solutions? Anything helpful, informational??", "title": "YO I Am Having Development Problems With My Scanned Film", "num-comments": 1, "score": 1, "date": "2020-11-28 04:30:18", "content": "YO I Am Having Development Problems With My Scanned Film /!/ I'm getting very discouraged wit developing film. I think I'll just stick to scanning and let the professionals develop from here on out. I recently bought a Cinestill powder kit for color film developing, a Patterson Tank, and a dark bag. The Cinestill kit came with instructions on developing times, the whole jazz, measurements, what to mix together all of that. -----> I developed !!!  two rolls of Porta 400 (36exp. some I extra pissed) with the kit and I am starting to think Cinestill's chemicals are just shit. Because I did everything correctly so I thought. It's not easy to pin point where I might've screwed up at, but once I finished the required time for the blix to be put into the tank, I added the final rinse image stabilizer. I left my film in the tank after I agitated it with the final rinse just to be sure the images would come out crisp. An hour pasts and I take the film out and let it blow dry with a fan. Once it's dry I load the film onto my Epson Scanner. Once I got into LR and Negative Lab Pro and make tiff scans of everything my images still had emissions on them. That problem I tried to fix by adding 99% alcohol to clean them which helped get rid of streaks and dust and whatnot. But the main problem I had was once converted the negatives, no matter how much color correction editing I within the NLP program the images were still so deeply blue and out of contrast from how they were supposed to look that it doesn't look like I would be able to fix them. I know I'm all over the place with this. I tried to explain the best I could. I'm running out of options and patience with developing. Any suggestions on what probably went wrong? Any solutions? Anything helpful, informational??"}, {"autor": "GimmeDatSideHug", "selftext": "\n\nI used a new card and all the files were corrupted. \n\nI bought a couple of Sandisk Extreme Pro 64GB 170 mb/s cards. They appear to be legit. I used one in my new Sony A7iii. The cards came with an EBS card reader, so I popped it in the card reader and inserted it into my laptop (Win 10). I imported into Lightroom no problem. I then transferred a couple of finished photos onto the card. I put the card reader in my other lap top (win 7). \n\nThen, I created a folder on the card and put the photos in the folder. I transferred the folder to the laptop. But when I clicked on the folder, it didn’t have any photos in it. I checked the folder on the card, and the photos had disappeared. Then, the computer told me I had to format the card before I could use it. I tried it via the card reader on both laptops. Kept telling me I needed to reformat. I put the card straight into the internal reader on one laptop- same message. \n\nDid I do something wrong? Did the card reader corrupt the files or was it the card? I’ve used that brand of card for years and never had any issue. Now, I’m scared and I don’t know what caused the error.", "title": "Had an SD card malfunction.", "num-comments": 1, "score": 1, "date": "2020-12-13 08:35:11", "content": "Had an SD card malfunction. /!/ \n\nI used a new card and all the files were corrupted. \n\nI bought a couple of Sandisk Extreme Pro 64GB 170 mb/s cards. They appear to be legit. I used one in my new Sony A7iii. The cards came with an EBS card reader, so I popped it in the card reader and inserted it into my laptop (Win 10). I imported into Lightroom no problem. I then transferred a couple of finished photos onto the card. I put the card reader in my other lap top (win 7). \n\nThen, -----> I created !!!  a folder on the card and put the photos in the folder. I transferred the folder to the laptop. But when I clicked on the folder, it didn’t have any photos in it. I checked the folder on the card, and the photos had disappeared. Then, the computer told me I had to format the card before I could use it. I tried it via the card reader on both laptops. Kept telling me I needed to reformat. I put the card straight into the internal reader on one laptop- same message. \n\nDid I do something wrong? Did the card reader corrupt the files or was it the card? I’ve used that brand of card for years and never had any issue. Now, I’m scared and I don’t know what caused the error."}, {"autor": "DontWuzzlerTheTIger", "selftext": "nan", "title": "Join the wuzzl.pic - Photography Discord Server! ~ Hey Guys, I wanna let you now that I created an discord server for photographers! You can share your knowledge and favourite location with all other photographers out there! Hope to see you soon :)", "num-comments": 1, "score": 1, "date": "2021-02-09 14:03:06", "content": "Join the wuzzl.pic - Photography Discord Server! ~ Hey Guys, I wanna let you now that -----> I created !!!  an discord server for photographers! You can share your knowledge and favourite location with all other photographers out there! Hope to see you soon :)"}, {"autor": "Serylt", "selftext": "First of all, the personal anecdote.  \nAbout two years ago I created an account at some various Stock Photography sites. I've uploaded about \\~100 to \\~200 images to them. I rechecked and now have an *astonishing* \"unpaid earnings balance\" of about $10 on them combined. Basically, I'm rich now, *right?!*\n\nI have also rechecked on what I even uploaded and what has sold and what hasn't. I am both surprised as well as a bit disappointed in it. At first, I planned - or hoped - to earn a little pocket money by selling off some images I haven't found another use for. It is, indeed, an aimless approach. Maybe I didn't get much off of it because I have no aim in what to \"deliver\" as sellable good. You don't know your client when selling images as stock photography.\n\nNow, *secondly, off to my concerns* I had as I was skimming through my (stock) \"\"portfolio\"\".\n\nPersonally, I feel like it's *devaluing*. Both in an artistic as well as financial sense. You might get a few bucks per image sale, maybe even just a few cents. It's a numbers game, basically. The more you upload, the more you could earn. But can I offer a thousand quality images that find potential buyers to earn me a measly $100 a year, or even a month? Isn't it just quantity over quality and hoping to \"hit the spot\"? What about potential \"reputation damage\" when your stock photography portfolio does not \"feel right\" to you, but you just try to make an extra income with that? Tailored to perceived needs of a buyer?\n\nI really don't know, I am unsure if it's worth it and something to be pursued or just a total waste of time. And yet, I keep on contemplating on pursuing the idea of uploading 1000-2000 images, solely to have the \"chance\" of getting that pocket money over the years.\n\nDo you have an opinion on that?\n\nIf so, please share it. Right now, I am just torn between potential money out of unused images (or even directly trying to pursue images directly for Stock photos) *or* just leaving it entirely because it's a waste of time. Not sure if anyone can relate to that.", "title": "Your opinion on Stock Photography?", "num-comments": 2, "score": 1, "date": "2021-01-25 15:41:16", "content": "Your opinion on Stock Photography? /!/ First of all, the personal anecdote.  \nAbout two years ago -----> I created !!!  an account at some various Stock Photography sites. I've uploaded about \\~100 to \\~200 images to them. I rechecked and now have an *astonishing* \"unpaid earnings balance\" of about $10 on them combined. Basically, I'm rich now, *right?!*\n\nI have also rechecked on what I even uploaded and what has sold and what hasn't. I am both surprised as well as a bit disappointed in it. At first, I planned - or hoped - to earn a little pocket money by selling off some images I haven't found another use for. It is, indeed, an aimless approach. Maybe I didn't get much off of it because I have no aim in what to \"deliver\" as sellable good. You don't know your client when selling images as stock photography.\n\nNow, *secondly, off to my concerns* I had as I was skimming through my (stock) \"\"portfolio\"\".\n\nPersonally, I feel like it's *devaluing*. Both in an artistic as well as financial sense. You might get a few bucks per image sale, maybe even just a few cents. It's a numbers game, basically. The more you upload, the more you could earn. But can I offer a thousand quality images that find potential buyers to earn me a measly $100 a year, or even a month? Isn't it just quantity over quality and hoping to \"hit the spot\"? What about potential \"reputation damage\" when your stock photography portfolio does not \"feel right\" to you, but you just try to make an extra income with that? Tailored to perceived needs of a buyer?\n\nI really don't know, I am unsure if it's worth it and something to be pursued or just a total waste of time. And yet, I keep on contemplating on pursuing the idea of uploading 1000-2000 images, solely to have the \"chance\" of getting that pocket money over the years.\n\nDo you have an opinion on that?\n\nIf so, please share it. Right now, I am just torn between potential money out of unused images (or even directly trying to pursue images directly for Stock photos) *or* just leaving it entirely because it's a waste of time. Not sure if anyone can relate to that."}, {"autor": "EmAndAhr", "selftext": "nan", "title": "How can I create this affect with artwork I painted? 3d, laid out, floating? What software can do this if I didn't have photoshop", "num-comments": 2, "score": 1, "date": "2021-02-11 04:02:56", "content": "How can -----> I create !!!  this affect with artwork I painted? 3d, laid out, floating? What software can do this if I didn't have photoshop"}, {"autor": "Massdogg3", "selftext": "nan", "title": "In response to \"Anything goes Monday\" I created a Camera Basics tutorial!", "num-comments": 2, "score": 1, "date": "2021-02-22 12:33:01", "content": "In response to \"Anything goes Monday\" -----> I created !!!  a Camera Basics tutorial!"}, {"autor": "Tech415", "selftext": "[removed]", "title": "How Can I Create Backgrounds Like These?", "num-comments": 2, "score": 1, "date": "2021-05-05 08:25:25", "content": "How Can -----> I Create !!!  Backgrounds Like These? /!/ [removed]"}, {"autor": "Tech415", "selftext": "[removed]", "title": "How Can I Create Backgrounds Like These?", "num-comments": 2, "score": 1, "date": "2021-05-05 08:23:19", "content": "How Can -----> I Create !!!  Backgrounds Like These? /!/ [removed]"}, {"autor": "abdellah95", "selftext": "nan", "title": "i create this design what do you think about it ? thanks !", "num-comments": 2, "score": 1, "date": "2021-05-02 06:17:14", "content": "-----> i create !!!  this design what do you think about it ? thanks !"}, {"autor": "IOughtToBeThrownAway", "selftext": "I've got a cheap 25x lens, and I've been just messing around with it and it's loads of fun. \n\nThen I got to checking out subs like r/macrophotography and r/macroporn and I just gotta say, I'm amazed by what people accomplish with various techniques and their own artistic eye. For example abstract macros- those are really stunning. Also, stacked macros, which I only recently learned about, are exceptionally cool to look at. \n\n&amp;#x200B;\n\nI feel like macro shots give us a glimpse into another world, and it's pretty darn cool. \n\n&amp;#x200B;\n\nAlso, macro photographers may find this of interest: I created a sub called r/guessthemacro, where photographers can post their own original macros, heavily cropped so as not to immediately reveal what the photographed item actually is! it's kind of fun looking at super narrow, almost microscopic focus on an every day item, and having no real reference for what it is. Self promotion is welcome there, if you post your art, just make sure the title and image don't spoil the image puzzle, but feel free to link to your original snaps, or your profile in the comments. &gt;!&gt;!Spoil mark though, so it doesn't reveal the answers! !&lt;!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nBut what do you think of macro photography? are there any macro shots that stand out as really amazing, in your eyes? \n\nFor those who try to snap macro shots as a hobby, are there any must have apps, programs, or accessories that put your shots on the next level?", "title": "what are your thoughts on macro photography?", "num-comments": 0, "score": 1, "date": "2021-05-17 17:58:15", "content": "what are your thoughts on macro photography? /!/ I've got a cheap 25x lens, and I've been just messing around with it and it's loads of fun. \n\nThen I got to checking out subs like r/macrophotography and r/macroporn and I just gotta say, I'm amazed by what people accomplish with various techniques and their own artistic eye. For example abstract macros- those are really stunning. Also, stacked macros, which I only recently learned about, are exceptionally cool to look at. \n\n&amp;#x200B;\n\nI feel like macro shots give us a glimpse into another world, and it's pretty darn cool. \n\n&amp;#x200B;\n\nAlso, macro photographers may find this of interest: -----> I created !!!  a sub called r/guessthemacro, where photographers can post their own original macros, heavily cropped so as not to immediately reveal what the photographed item actually is! it's kind of fun looking at super narrow, almost microscopic focus on an every day item, and having no real reference for what it is. Self promotion is welcome there, if you post your art, just make sure the title and image don't spoil the image puzzle, but feel free to link to your original snaps, or your profile in the comments. &gt;!&gt;!Spoil mark though, so it doesn't reveal the answers! !&lt;!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nBut what do you think of macro photography? are there any macro shots that stand out as really amazing, in your eyes? \n\nFor those who try to snap macro shots as a hobby, are there any must have apps, programs, or accessories that put your shots on the next level?"}, {"autor": "000MIIX", "selftext": "nan", "title": "My bedroom functions like an old pinhole camera. What is this phenomenon called? How can I improve the scale &amp; size of the image?", "num-comments": 2, "score": 1, "date": "2021-05-13 08:20:57", "content": "My bedroom functions like an old pinhole camera. What is this phenomenon called? How can -----> I improve !!!  the scale &amp; size of the image?"}, {"autor": "gloria_snockers", "selftext": "My apologies if this is completely the wrong place for this. I just didn't really know where to ask this convoluted question.\n\nMy wife recently passed. Among her possessions was a rare shot of JFK on the campaign trail in Minnisota. I remember her speaking of it. It was a shot her uncle or great uncle took when JFK was exiting a building. It's taken from pretty close up and is a 8x10. Her Uncle gave it to her as a gift. If another does exist it would have been his. He died years ago and my wife said he was into photography strictly for the love of the art. She doubted that he would have ever sold it. He developed his own work as well. I believe it's one of a kind.\n\nYou can imagine the gist of what I want to know. The Photo really holds no special meaning to me. And I'm frankly struggling financially. How would a person go about selling or trying to sell such an item. I would imagine if an entity was interested they would certainly want to see it. I'm not sure how to share it without it being copied and distributed before I got a chance to collect anything for it.\n\nI know, that's alot of questions that seem quite mercenary in nature. I'm not normally like that. But I feel it may be a rare photo that should be circulated in someway.\n\nThanks for any pointers. Even if it's just a proper group to ask in or any way to ask this without sounding so cut throut about it.\n\nThank You", "title": "Looking for a proper group to ask about a rare photo", "num-comments": 1, "score": 1, "date": "2020-08-23 01:39:38", "content": "Looking for a proper group to ask about a rare photo /!/ My apologies if this is completely the wrong place for this. I just didn't really know where to ask this convoluted question.\n\nMy wife recently passed. Among her possessions was a rare shot of JFK on the campaign trail in Minnisota. I remember her speaking of it. It was a shot her uncle or great uncle took when JFK was exiting a building. It's taken from pretty close up and is a 8x10. Her Uncle gave it to her as a gift. If another does exist it would have been his. He died years ago and my wife said he was into photography strictly for the love of the art. She doubted that he would have ever sold it. -----> He developed !!!  his own work as well. I believe it's one of a kind.\n\nYou can imagine the gist of what I want to know. The Photo really holds no special meaning to me. And I'm frankly struggling financially. How would a person go about selling or trying to sell such an item. I would imagine if an entity was interested they would certainly want to see it. I'm not sure how to share it without it being copied and distributed before I got a chance to collect anything for it.\n\nI know, that's alot of questions that seem quite mercenary in nature. I'm not normally like that. But I feel it may be a rare photo that should be circulated in someway.\n\nThanks for any pointers. Even if it's just a proper group to ask in or any way to ask this without sounding so cut throut about it.\n\nThank You"}, {"autor": "megigrace", "selftext": "nan", "title": "How could I improve this picture?", "num-comments": 2, "score": 1, "date": "2020-08-22 22:42:46", "content": "How could -----> I improve !!!  this picture?"}, {"autor": "carlosss273", "selftext": "I develop a film today and it turn out like [this](https://imgur.com/ZEtg6mU), and [this](https://imgur.com/5KBHoyI), and [this](https://imgur.com/kA1Qb7i)\n\nyeah, the borders look terrible, which is weird because the last roll i shoot 2 months ago turned out pretty [good](https://imgur.com/bFGFirD)\n\n&amp;#x200B;\n\n\\-i didnt open the camera with the film inside\n\n&amp;#x200B;\n\nyou can even see how the borders are overexposed [https://imgur.com/Avb08M7](https://imgur.com/Avb08M7)\n\n&amp;#x200B;\n\nmaybe i mess it up during the developing process?", "title": "Does my 35mm camera have a light leak?", "num-comments": 6, "score": 1, "date": "2021-04-03 22:58:20", "content": "Does my 35mm camera have a light leak? /!/ -----> I develop !!!  a film today and it turn out like [this](https://imgur.com/ZEtg6mU), and [this](https://imgur.com/5KBHoyI), and [this](https://imgur.com/kA1Qb7i)\n\nyeah, the borders look terrible, which is weird because the last roll i shoot 2 months ago turned out pretty [good](https://imgur.com/bFGFirD)\n\n&amp;#x200B;\n\n\\-i didnt open the camera with the film inside\n\n&amp;#x200B;\n\nyou can even see how the borders are overexposed [https://imgur.com/Avb08M7](https://imgur.com/Avb08M7)\n\n&amp;#x200B;\n\nmaybe i mess it up during the developing process?"}, {"autor": "hellbike", "selftext": "nan", "title": "I created a photography project about the conflict between the LGBT community and the polish government (and it goes Viral in my country)", "num-comments": 4, "score": 0, "date": "2020-07-22 14:07:41", "content": "-----> I created !!!  a photography project about the conflict between the LGBT community and the polish government (and it goes Viral in my country)"}, {"autor": "benitocamelas", "selftext": "Hey fellow freelancers! I created an app with the vision of helping you keep more of the money you earn while freelancing.\n\nThe current version of our app\n\n* helps you find deductions to save on taxes\n* calculates exactly how much you should be setting aside for taxes to avoid fines from the IRS\n* let's you easily pay quarterly estimated taxes through the app\n* lets you chat with a real person who can answer your finance questions\n* helps you set and track income goals\n* lets you know how much spending money you have\n* automatically notifies you whenever you get new income\n\nWe thought we’d reach out to the community to see if our app was helpful. We’d love to make this app really useful for people in this community, so any feedback/suggestions you have is welcome! Please check it out and let us know what you think :)\n\n[https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755](https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755)", "title": "Built app to help fellow freelancer photographers keep more of the money they earn!", "num-comments": 0, "score": 1, "date": "2020-07-30 22:56:05", "content": "Built app to help fellow freelancer photographers keep more of the money they earn! /!/ Hey fellow freelancers! -----> I created !!!  an app with the vision of helping you keep more of the money you earn while freelancing.\n\nThe current version of our app\n\n* helps you find deductions to save on taxes\n* calculates exactly how much you should be setting aside for taxes to avoid fines from the IRS\n* let's you easily pay quarterly estimated taxes through the app\n* lets you chat with a real person who can answer your finance questions\n* helps you set and track income goals\n* lets you know how much spending money you have\n* automatically notifies you whenever you get new income\n\nWe thought we’d reach out to the community to see if our app was helpful. We’d love to make this app really useful for people in this community, so any feedback/suggestions you have is welcome! Please check it out and let us know what you think :)\n\n[https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755](https://apps.apple.com/us/app/maverick-freelancer-finances/id1514507755)"}, {"autor": "Box_Pirate", "selftext": "nan", "title": "Took this on the way to school. How can I improve it?", "num-comments": 2, "score": 1, "date": "2020-08-16 11:18:43", "content": "Took this on the way to school. How can -----> I improve !!!  it?"}, {"autor": "Amitopia", "selftext": "nan", "title": "Do you have tips about how can I improve my phone photography to get better photos of the product", "num-comments": 2, "score": 1, "date": "2021-08-02 12:52:36", "content": "Do you have tips about how can -----> I improve !!!  my phone photography to get better photos of the product"}, {"autor": "boddy_nock", "selftext": "Yesterday was my first professional gig. It was a one year Olds birthday party. I was assigned it through a third party on Indeed. Below was my job description:\n\nShot list\n\nBirthday person (blowing out candles, opening gifts, mingling with guests)\n\nCake, cupcakes, cookies display\n\nGroup and Family Photos\n\nThe lady who was the sons mother didn't like my photos. She said that my photos were more portraiture work and she wanted more candid shots. Well, If you wanted those just have your uncle Bob take them. I feel like I created art, but it's not what she wanted. Now I feel like I ruined their memories and won't have that day captured. \n\nThey didn't have the child blow out the candles or open presents. No one was mingling with each other, other than the children. Anyone else have a bad first experience? How do you get over feeling like you did wrong?", "title": "Yesterday was my first professional gig", "num-comments": 43, "score": 1, "date": "2021-08-22 14:29:28", "content": "Yesterday was my first professional gig /!/ Yesterday was my first professional gig. It was a one year Olds birthday party. I was assigned it through a third party on Indeed. Below was my job description:\n\nShot list\n\nBirthday person (blowing out candles, opening gifts, mingling with guests)\n\nCake, cupcakes, cookies display\n\nGroup and Family Photos\n\nThe lady who was the sons mother didn't like my photos. She said that my photos were more portraiture work and she wanted more candid shots. Well, If you wanted those just have your uncle Bob take them. I feel like -----> I created !!!  art, but it's not what she wanted. Now I feel like I ruined their memories and won't have that day captured. \n\nThey didn't have the child blow out the candles or open presents. No one was mingling with each other, other than the children. Anyone else have a bad first experience? How do you get over feeling like you did wrong?"}, {"autor": "WorkingBenefit", "selftext": "I've been pursuing photography as a side passion for about four years now (street photography being my favourite type of photography to shoot), and it has been a great hobby for me. It has made more observant of my surroundings, it has given me an excuse to go out and explore my city, I have made a good number of friends whilst doing it, it has given me better knowledge of how tech works in general (not only cameras), it has helped me develop a photographic eye, as well as being something mediative for me, as smth to do after a long day of work. But the thing is now, I don't exactly know where to go next with it. \n\nLike most, I have been posting my photos on instagram with the intention of trying to get people to see them. Whilst I will continue to post on ig, I have grown kind of bored of just displaying them on ig. Posting them on ig just makes me feel like I've ended up caring more on how many likes I'm getting per photo and what type of photos are trending on there, instead on focusing on myself. Exposure is great but I don't think this is a healthy approach. Also, the ig algorithm is making it increasingly diffcult for me to get my photos out there and I've noticed less and less people, who aren't already following me, are seeing my photos. Which has been bothering me quite a bit as I'm showcasing my photos to less and less people. \n\nFor those reasons, especially, are why I want to move past just using my instagram as an outlet. So what other ways should I (an ameutar photographer) ultilise to have my photos seen by more people? Any advice on what I should do? Any other social media outlets i can ultilise other than instagram and vsco? Thanks.", "title": "Want to move past instagram", "num-comments": 106, "score": 1, "date": "2021-07-13 09:31:21", "content": "Want to move past instagram /!/ I've been pursuing photography as a side passion for about four years now (street photography being my favourite type of photography to shoot), and it has been a great hobby for me. It has made more observant of my surroundings, it has given me an excuse to go out and explore my city, I have made a good number of friends whilst doing it, it has given me better knowledge of how tech works in general (not only cameras), it has helped -----> me develop !!!  a photographic eye, as well as being something mediative for me, as smth to do after a long day of work. But the thing is now, I don't exactly know where to go next with it. \n\nLike most, I have been posting my photos on instagram with the intention of trying to get people to see them. Whilst I will continue to post on ig, I have grown kind of bored of just displaying them on ig. Posting them on ig just makes me feel like I've ended up caring more on how many likes I'm getting per photo and what type of photos are trending on there, instead on focusing on myself. Exposure is great but I don't think this is a healthy approach. Also, the ig algorithm is making it increasingly diffcult for me to get my photos out there and I've noticed less and less people, who aren't already following me, are seeing my photos. Which has been bothering me quite a bit as I'm showcasing my photos to less and less people. \n\nFor those reasons, especially, are why I want to move past just using my instagram as an outlet. So what other ways should I (an ameutar photographer) ultilise to have my photos seen by more people? Any advice on what I should do? Any other social media outlets i can ultilise other than instagram and vsco? Thanks."}, {"autor": "tropical0", "selftext": "Hello, so I recently took some shots that I double exposed with images I found on the internet. My question is: Would these count as \"plagiarism\"? or did I create something \"new\" by combining both images? I feel like it is 'new' in the sense that that particular combination of images only exists in my photographs but I'm not 100% sure! Hope you can help me. Thank you!", "title": "Double Exposure. Question.", "num-comments": 1, "score": 1, "date": "2021-09-22 00:11:21", "content": "Double Exposure. Question. /!/ Hello, so I recently took some shots that I double exposed with images I found on the internet. My question is: Would these count as \"plagiarism\"? or did -----> I create !!!  something \"new\" by combining both images? I feel like it is 'new' in the sense that that particular combination of images only exists in my photographs but I'm not 100% sure! Hope you can help me. Thank you!"}, {"autor": "bennmgr", "selftext": "nan", "title": "What could I improve about the Colors/lights ?", "num-comments": 2, "score": 1, "date": "2021-08-25 14:10:58", "content": "What could -----> I improve !!!  about the Colors/lights ?"}, {"autor": "finpos", "selftext": "nan", "title": "How do I improve the definition of the eye on photos like this one? My main problem seems to be with black-on-black even if the bird is stationary (handheld, 1/2000, 400mm, F5.6, auto exposure, auto iso)", "num-comments": 2, "score": 1, "date": "2020-09-04 14:55:57", "content": "How do -----> I improve !!!  the definition of the eye on photos like this one? My main problem seems to be with black-on-black even if the bird is stationary (handheld, 1/2000, 400mm, F5.6, auto exposure, auto iso)"}, {"autor": "d-law", "selftext": "Hey all. I developed an obsession with typologies a few years ago and decided to create this sub to post some of the stuff I've collected. My hope is that other typology lovers will come on over and maybe post some of their own images or those of others. Hope this isn't too spammy.", "title": "New subreddit r/typologies", "num-comments": 2, "score": 1, "date": "2020-05-26 21:23:57", "content": "New subreddit r/typologies /!/ Hey all. -----> I developed !!!  an obsession with typologies a few years ago and decided to create this sub to post some of the stuff I've collected. My hope is that other typology lovers will come on over and maybe post some of their own images or those of others. Hope this isn't too spammy."}, {"autor": "[deleted]", "selftext": "[deleted]", "title": "snapped these clouds; immediately thought of the creation of adam, and bOoM i created my vision :))", "num-comments": 1, "score": 0, "date": "2020-04-16 12:57:06", "content": "snapped these clouds; immediately thought of the creation of adam, and bOoM -----> i created !!!  my vision :)) /!/ [deleted]"}, {"autor": "DarrenMillerDM", "selftext": "[removed]", "title": "I Created a Photography Podcast 1st Ep. Street Photography", "num-comments": 1, "score": 1, "date": "2020-03-21 05:00:25", "content": "-----> I Created !!!  a Photography Podcast 1st Ep. Street Photography /!/ [removed]"}, {"autor": "This-Cartographer", "selftext": "A little background. My great uncle was a photographer. He'd started working in photography after being hit by a car and partially paralyzed, and he became obsessed with photography both as a way to make a living and a way of life. He developed his own prints. Some of the ones I inherited are strange. They are black and white with a distinct gold tinge. The photo has a hard clear finish. It's almost like a daguerreotype. But golden, where that would be brown. Does anyone have any idea how he achieved this effect? They are like no photos anyone I have shown them to has ever seen.", "title": "Question about photo from the 1940s", "num-comments": 7, "score": 1, "date": "2020-02-02 04:18:29", "content": "Question about photo from the 1940s /!/ A little background. My great uncle was a photographer. He'd started working in photography after being hit by a car and partially paralyzed, and he became obsessed with photography both as a way to make a living and a way of life. -----> He developed !!!  his own prints. Some of the ones I inherited are strange. They are black and white with a distinct gold tinge. The photo has a hard clear finish. It's almost like a daguerreotype. But golden, where that would be brown. Does anyone have any idea how he achieved this effect? They are like no photos anyone I have shown them to has ever seen."}, {"autor": "Luna-AP-Photography", "selftext": "[removed]", "title": "I Created A Striking \"Blind to Plastic\" Portrait Series", "num-comments": 2, "score": 1, "date": "2020-02-11 19:58:11", "content": "-----> I Created !!!  A Striking \"Blind to Plastic\" Portrait Series /!/ [removed]"}, {"autor": "Kaidargame", "selftext": "nan", "title": "I started doing timelapses not a long ago and I KNOW that some of you can do much better than me, but I just wanted to share my work and get some response on what could I improve, AND I don't want this to be called advertisement, I just want some feedback on what could I improve. Thank you.", "num-comments": 1, "score": 0, "date": "2020-07-03 15:41:44", "content": "I started doing timelapses not a long ago and I KNOW that some of you can do much better than me, but I just wanted to share my work and get some response on what could -----> I improve !!! , AND I don't want this to be called advertisement, I just want some feedback on what could -----> I improve !!! . Thank you."}, {"autor": "RelaxnShadow", "selftext": "I have a cannon PowerShot 420is. It's a good little camera for basic pictures but it's lacking simple features like aperture settings.\nWhat can I do to get the most umf out of this camera? Or should I just invest in a better one?", "title": "How can I improve?", "num-comments": 8, "score": 1, "date": "2020-06-16 04:18:26", "content": "How can -----> I improve !!! ? /!/ I have a cannon PowerShot 420is. It's a good little camera for basic pictures but it's lacking simple features like aperture settings.\nWhat can I do to get the most umf out of this camera? Or should I just invest in a better one?"}, {"autor": "dancook82", "selftext": "I developed a website that's already well received by many photographers, and I will keep working on it to make it better.\n\n[https://usedlens.co.uk/](https://usedlens.co.uk/) \n\nIt allows searching of over 50 retailers in the UK, from large online retailers to hidden gems. More retailers than I ever knew about, and more retailers than you can realistically search manually.\n\nI'm open to suggestions on how to improve, or let me know if there are any retailers I have not added. I really want this to be a comprehensive tool.\n\nI understand that this may go against the rules here, and it will probably be removed. I messaged several moderators and didn't hear back, I hope they can appreciate how useful people will find this.", "title": "UK - If you buy used camera gear", "num-comments": 1, "score": 1, "date": "2020-06-27 11:34:43", "content": "UK - If you buy used camera gear /!/ -----> I developed !!!  a website that's already well received by many photographers, and I will keep working on it to make it better.\n\n[https://usedlens.co.uk/](https://usedlens.co.uk/) \n\nIt allows searching of over 50 retailers in the UK, from large online retailers to hidden gems. More retailers than I ever knew about, and more retailers than you can realistically search manually.\n\nI'm open to suggestions on how to improve, or let me know if there are any retailers I have not added. I really want this to be a comprehensive tool.\n\nI understand that this may go against the rules here, and it will probably be removed. I messaged several moderators and didn't hear back, I hope they can appreciate how useful people will find this."}, {"autor": "merwanedr", "selftext": "You can use Popbot to automatically apply color splash effects to photos by selecting a subject. I created it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jFOCU](https://gumroad.com/l/jFOCU)", "title": "Popbot - Apply color splash effects using AI.", "num-comments": 0, "score": 1, "date": "2020-06-17 09:29:39", "content": "Popbot - Apply color splash effects using AI. /!/ You can use Popbot to automatically apply color splash effects to photos by selecting a subject. -----> I created !!!  it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jFOCU](https://gumroad.com/l/jFOCU)"}, {"autor": "barmybram", "selftext": "And is it at all possible to do this on my iPhone XR? I’m looking to expand the image, and in doing this it will become pixelated due to the zoom, so is there a simple tool/app that I can use that won’t cost me much, except my time? Thanks", "title": "How can I improve the definition on a picture that’s in my iPhone album?", "num-comments": 3, "score": 1, "date": "2020-05-01 13:23:40", "content": "How can -----> I improve !!!  the definition on a picture that’s in my iPhone album? /!/ And is it at all possible to do this on my iPhone XR? I’m looking to expand the image, and in doing this it will become pixelated due to the zoom, so is there a simple tool/app that I can use that won’t cost me much, except my time? Thanks"}, {"autor": "yelyahhh", "selftext": "nan", "title": "I developed a roll of film and a few images came out like this! Anyone know how it happened?!", "num-comments": 2, "score": 1, "date": "2020-11-02 01:41:40", "content": "-----> I developed !!!  a roll of film and a few images came out like this! Anyone know how it happened?!"}, {"autor": "HyperFoxx", "selftext": "nan", "title": "How could I improve the colours in this photo?", "num-comments": 1, "score": 1, "date": "2020-01-09 15:41:18", "content": "How could -----> I improve !!!  the colours in this photo?"}, {"autor": "Skyllux", "selftext": "A magazine editor contacted me to recreate one of my recent shoots so she can publish it in her magazine.\n\nShe wants me to use the same settings, probs, outfits etc that I used in my original shoot and she also wants to use the same model (who showed her the photos from our original shoot) \n\nShe will be paying the model and the makeup artist, but I will not be paid. She offered to pay me but I refused as I only do photography for fun but also because I don’t want anyone to have full rights to my images. I am happy to shoot and have her select the photos she wants me to edit and have her publish them but nothing more than that. \n\nShe is treating this as commissioned work, which I don’t think qualifies as commissioned work but more like a collaboration. Specially that she wants me  to copy a concept that I created, styled and shot without her.\n\nSo I am wondering, if I agree to do this, would this be considered as commissioned work where she will get full copyrights to the photos or I would still own the rights to the photos?\n\nI was planning and styling that concept for months, so I don’t want her taking copyright for something I worked so hard for.\n\nI only accepted because me and the model get along well and we always have good photos when we work together. But the editor seems very sneaky and I don’t want to be caught off guard.", "title": "Copyright clarification (Australia laws)", "num-comments": 4, "score": 1, "date": "2020-10-29 15:53:48", "content": "Copyright clarification (Australia laws) /!/ A magazine editor contacted me to recreate one of my recent shoots so she can publish it in her magazine.\n\nShe wants me to use the same settings, probs, outfits etc that I used in my original shoot and she also wants to use the same model (who showed her the photos from our original shoot) \n\nShe will be paying the model and the makeup artist, but I will not be paid. She offered to pay me but I refused as I only do photography for fun but also because I don’t want anyone to have full rights to my images. I am happy to shoot and have her select the photos she wants me to edit and have her publish them but nothing more than that. \n\nShe is treating this as commissioned work, which I don’t think qualifies as commissioned work but more like a collaboration. Specially that she wants me  to copy a concept that -----> I created !!! , styled and shot without her.\n\nSo I am wondering, if I agree to do this, would this be considered as commissioned work where she will get full copyrights to the photos or I would still own the rights to the photos?\n\nI was planning and styling that concept for months, so I don’t want her taking copyright for something I worked so hard for.\n\nI only accepted because me and the model get along well and we always have good photos when we work together. But the editor seems very sneaky and I don’t want to be caught off guard."}, {"autor": "ReolinkFrazer", "selftext": "Hi everyone,\n\nI'm Frazer from Reolink (/r/reolinkcam). We develop and sell security cameras. This is not a self-promotion post. I want to find someone who love to use 12MP security camera to shoot videos, especially time-lapse clips.\n\nI know 12MP security camera cannot compete with cameras. But this security camera is PoE enabled. Plug-in and will have unstoppable power. So it is suitable to shoot days of or even weeks of activities. \n\n**I want to find someone who uses this camera to shoot some amazing videos and time-lapse videos in day or at night**, like beautiful sunset, idyllic scenery, and spectacular city skyline. We will ship the camera to you free.\n\nThere are so many photography masters here. So I ask for help here. \n\nIf you are interested in this campaign, please comment with the picture of the location that you are going to install the camera in this post: [https://www.reddit.com/r/reolinkcam/comments/jk5z2t/security\\_camera\\_photographer\\_wanted\\_we\\_have\\_12mp/](https://www.reddit.com/r/reolinkcam/comments/jk5z2t/security_camera_photographer_wanted_we_have_12mp/)\n\nExcited to see the beautiful view you see. 🏝️", "title": "🏝️ Security camera photographer wanted. We have 12MP security cameras.", "num-comments": 6, "score": 1, "date": "2020-10-29 09:16:54", "content": "🏝️ Security camera photographer wanted. We have 12MP security cameras. /!/ Hi everyone,\n\nI'm Frazer from Reolink (/r/reolinkcam). -----> We develop !!!  and sell security cameras. This is not a self-promotion post. I want to find someone who love to use 12MP security camera to shoot videos, especially time-lapse clips.\n\nI know 12MP security camera cannot compete with cameras. But this security camera is PoE enabled. Plug-in and will have unstoppable power. So it is suitable to shoot days of or even weeks of activities. \n\n**I want to find someone who uses this camera to shoot some amazing videos and time-lapse videos in day or at night**, like beautiful sunset, idyllic scenery, and spectacular city skyline. We will ship the camera to you free.\n\nThere are so many photography masters here. So I ask for help here. \n\nIf you are interested in this campaign, please comment with the picture of the location that you are going to install the camera in this post: [https://www.reddit.com/r/reolinkcam/comments/jk5z2t/security\\_camera\\_photographer\\_wanted\\_we\\_have\\_12mp/](https://www.reddit.com/r/reolinkcam/comments/jk5z2t/security_camera_photographer_wanted_we_have_12mp/)\n\nExcited to see the beautiful view you see. 🏝️"}, {"autor": "timc00k2018", "selftext": "I had two questions I was hoping someone could help me with please:\n\n1.  Does someone have a website that shows unprocessed HDR photos so that I can see what they look like?  I did a Google search and found some, but I'm not sure if the photos have been processed or not.  I'd just like to see what they look like unprocessed\n2. I downloaded Photoshop and used it for the first time today.  A tutorial I came across walked me through creating faux HDR photos from a single jpg.  Here is an example I created [https://ibb.co/Pgjntrc](https://ibb.co/Pgjntrc) .  The original picture had some flaws in it and the final pic has to be cleaned up a bit, but is the picture on the right kind of like what an HDR picture would look like?\n\nThank you", "title": "What do unprocessed HDR photos look like?", "num-comments": 5, "score": 1, "date": "2020-01-20 02:07:21", "content": "What do unprocessed HDR photos look like? /!/ I had two questions I was hoping someone could help me with please:\n\n1.  Does someone have a website that shows unprocessed HDR photos so that I can see what they look like?  I did a Google search and found some, but I'm not sure if the photos have been processed or not.  I'd just like to see what they look like unprocessed\n2. I downloaded Photoshop and used it for the first time today.  A tutorial I came across walked me through creating faux HDR photos from a single jpg.  Here is an example -----> I created !!!  [https://ibb.co/Pgjntrc](https://ibb.co/Pgjntrc) .  The original picture had some flaws in it and the final pic has to be cleaned up a bit, but is the picture on the right kind of like what an HDR picture would look like?\n\nThank you"}, {"autor": "grayshoesarecool", "selftext": "What’s your guys routine like? Do you plan a set time to go take photos everyday? Do you have weekly goals? Do you post your photos to different places? I’m trying to get more into photography but I like some form of structure.", "title": "How do I develop the habit of taking photos?", "num-comments": 25, "score": 1, "date": "2020-09-20 02:35:18", "content": "How do -----> I develop !!!  the habit of taking photos? /!/ What’s your guys routine like? Do you plan a set time to go take photos everyday? Do you have weekly goals? Do you post your photos to different places? I’m trying to get more into photography but I like some form of structure."}, {"autor": "vicstoc", "selftext": "nan", "title": "How do I create this dark background effect look; can’t see his body either just the face and beanie of the dog blended into the black background? Credits: IG murphy.the.dobrermann", "num-comments": 1, "score": 1, "date": "2020-01-24 03:24:49", "content": "How do -----> I create !!!  this dark background effect look; can’t see his body either just the face and beanie of the dog blended into the black background? Credits: IG murphy.the.dobrermann"}, {"autor": "FilmLifeVlog", "selftext": "nan", "title": "Developing a personal photography style can be challenging. We are often under pressure to copy other photographer's style. I decided to approach my photography differently, focusing on my core values and personal aesthetics. Here is the story of how I developed my style of photography.", "num-comments": 0, "score": 1, "date": "2020-11-19 18:33:28", "content": "Developing a personal photography style can be challenging. We are often under pressure to copy other photographer's style. I decided to approach my photography differently, focusing on my core values and personal aesthetics. Here is the story of how -----> I developed !!!  my style of photography."}, {"autor": "sambarRabit", "selftext": "Hey I am about to sound a little newbie so prepare yourselves lol \n\nThere are lots of great photo takers on ig. Such great composition, great color, shapes etc \n\nThey convey an urban vibe. Best way to describe it is like urban artistic photography, a lot of the times in New York. \n\nMy only camera is an iPhone so I don’t take very many great photos. My question is how could I take photos with the aforementioned qualities ? Any camera recommendations ? \n\nI am not talking about professional photography, even though that stuff is pretty great \n\nSo my question is , how does one train themselves to get that strong New York vibe in their photos . With artistic touches and angles , getting the photos to look like a brief screenshot from a beautifully composed film. \n\nAm I explaining it accurately lol? Do u get what I’m trying to say? \n\nPlease help with any tips! Ik this is all over the place ,\nI guess in summary\n\nTdlr; how do I develop the eye and what camera do I use to get that artsy New York urban city vibe in my photos ? Not necessarily pictures of buildings but all kinds of things", "title": "Tips for artistic/urban photography", "num-comments": 13, "score": 1, "date": "2021-01-04 03:16:01", "content": "Tips for artistic/urban photography /!/ Hey I am about to sound a little newbie so prepare yourselves lol \n\nThere are lots of great photo takers on ig. Such great composition, great color, shapes etc \n\nThey convey an urban vibe. Best way to describe it is like urban artistic photography, a lot of the times in New York. \n\nMy only camera is an iPhone so I don’t take very many great photos. My question is how could I take photos with the aforementioned qualities ? Any camera recommendations ? \n\nI am not talking about professional photography, even though that stuff is pretty great \n\nSo my question is , how does one train themselves to get that strong New York vibe in their photos . With artistic touches and angles , getting the photos to look like a brief screenshot from a beautifully composed film. \n\nAm I explaining it accurately lol? Do u get what I’m trying to say? \n\nPlease help with any tips! Ik this is all over the place ,\nI guess in summary\n\nTdlr; how do -----> I develop !!!  the eye and what camera do I use to get that artsy New York urban city vibe in my photos ? Not necessarily pictures of buildings but all kinds of things"}, {"autor": "pranjal077", "selftext": "nan", "title": "is it a good picture, i edited this in lightroom how can i improve it", "num-comments": 2, "score": 1, "date": "2020-12-08 06:20:32", "content": "is it a good picture, i edited this in lightroom how can -----> i improve !!!  it"}, {"autor": "frostsparv", "selftext": "After a few HDD failures and to be honest, unorganized behaviour without future proofing, I've managed to end up with an external drive with a lot of folders, file types and names (jpg, dng, raw, raf etc.). Sure, I created this and have to unclutter this mess but I wanted to ask if anyone here have any advice or tricks to make this smooth? Is there any software that can scan the drive for all photos, fetch them and copy them to folders based on for example year? \n\nRight now I'm almost at the point of just deleting 15 years of photography.", "title": "[Help] Thousands of unorganized photos", "num-comments": 7, "score": 1, "date": "2020-12-12 18:06:55", "content": "[Help] Thousands of unorganized photos /!/ After a few HDD failures and to be honest, unorganized behaviour without future proofing, I've managed to end up with an external drive with a lot of folders, file types and names (jpg, dng, raw, raf etc.). Sure, -----> I created !!!  this and have to unclutter this mess but I wanted to ask if anyone here have any advice or tricks to make this smooth? Is there any software that can scan the drive for all photos, fetch them and copy them to folders based on for example year? \n\nRight now I'm almost at the point of just deleting 15 years of photography."}, {"autor": "sheepersheep", "selftext": "Hello everyone!\n\nI'm a budding food photographer but I've been doing wildlife for a while now. I have only recently started doing product and food photography as a side hustle to make more money. \n\nI have been getting gigs but I really don't know how to charge them for it. I don't want to over charge then and sound too cocky but don't want to undercharge for the work I create either. \n\nIf you guys could share your tips on how to charge, I'll be thankful. You can view some of my work at https://ujjwalvadhani.pb.online/photography\n\nIf that helps y'all to see what my skills are worth. Any help appreciated as I'm new to this kind of work. Thanks again. :)", "title": "Hey guys! Need help understanding how to charge clients for product photography.", "num-comments": 1, "score": 1, "date": "2021-01-19 13:29:16", "content": "Hey guys! Need help understanding how to charge clients for product photography. /!/ Hello everyone!\n\nI'm a budding food photographer but I've been doing wildlife for a while now. I have only recently started doing product and food photography as a side hustle to make more money. \n\nI have been getting gigs but I really don't know how to charge them for it. I don't want to over charge then and sound too cocky but don't want to undercharge for the work -----> I create !!!  either. \n\nIf you guys could share your tips on how to charge, I'll be thankful. You can view some of my work at https://ujjwalvadhani.pb.online/photography\n\nIf that helps y'all to see what my skills are worth. Any help appreciated as I'm new to this kind of work. Thanks again. :)"}, {"autor": "Zakk4r4n", "selftext": "nan", "title": "Plant from a park, even tho poisonous :) [how could I improve the photographs?]", "num-comments": 2, "score": 1, "date": "2021-02-02 14:35:45", "content": "Plant from a park, even tho poisonous :) [how could -----> I improve !!!  the photographs?]"}, {"autor": "apoch8000", "selftext": "Hi everyone! Might sound like a weird question but here it goes:\n\nI’m using the iOS app ‘Shortcuts’ which is a powerful app that can be used for all sort of things: send automatic mails, day routines ect. Every routine you make is called a ‘shortcut’ and can be shared to other people\nRecently I created a shortcut that creates and applies a wallpaper, based on the current weather and time on the moment you use the shortcut. It is a quite popular shortcut on [/r/Shortcuts](https://www.reddit.com/r/shortcuts/comments/l42cpe/weatherwalls_20_is_out_new_features_sunrisesunset/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) and several people asked me to do a version of a city skyline.\n\nThe ‘problem’ is that is not so easy to create a ‘night’ version of a photo taken in daytime (apt. lights ect.) so I’m looking for a photographer that maybe have at least two city skyline photo’s taken from the same spot, one at daytime, one in the evening/night. It doesn’t really matter which city it is, but I guess there must be at least several skyscrapers to make it a bit impressive.\n\nI have no idea how licensing or something works. It’s not that I’m making money by creating and sharing a shortcut, it’s just entertaining and fun for me to do. So I was hoping someone is fancy to share some photo’s to use in the shortcut or even better, help me create bettere quality images.\n\nGive me a shout if anyone is interested!", "title": "[QUESTION] Looking for a photo series taken from the exact same location on different times for an iOS Shortcut", "num-comments": 1, "score": 1, "date": "2021-01-28 20:10:18", "content": "[QUESTION] Looking for a photo series taken from the exact same location on different times for an iOS Shortcut /!/ Hi everyone! Might sound like a weird question but here it goes:\n\nI’m using the iOS app ‘Shortcuts’ which is a powerful app that can be used for all sort of things: send automatic mails, day routines ect. Every routine you make is called a ‘shortcut’ and can be shared to other people\nRecently -----> I created !!!  a shortcut that creates and applies a wallpaper, based on the current weather and time on the moment you use the shortcut. It is a quite popular shortcut on [/r/Shortcuts](https://www.reddit.com/r/shortcuts/comments/l42cpe/weatherwalls_20_is_out_new_features_sunrisesunset/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) and several people asked me to do a version of a city skyline.\n\nThe ‘problem’ is that is not so easy to create a ‘night’ version of a photo taken in daytime (apt. lights ect.) so I’m looking for a photographer that maybe have at least two city skyline photo’s taken from the same spot, one at daytime, one in the evening/night. It doesn’t really matter which city it is, but I guess there must be at least several skyscrapers to make it a bit impressive.\n\nI have no idea how licensing or something works. It’s not that I’m making money by creating and sharing a shortcut, it’s just entertaining and fun for me to do. So I was hoping someone is fancy to share some photo’s to use in the shortcut or even better, help me create bettere quality images.\n\nGive me a shout if anyone is interested!"}, {"autor": "T0kiTaki", "selftext": "nan", "title": "What would you rate this photo out of ten? And how can I improve the shot? Thanks in advance &lt;3", "num-comments": 2, "score": 0, "date": "2021-02-23 19:28:55", "content": "What would you rate this photo out of ten? And how can -----> I improve !!!  the shot? Thanks in advance &lt;3"}, {"autor": "zwgarrett1988", "selftext": "I download so many photographs from the internet by just right clicking. I’m a graphic designer and all though most of the photographs go into a folder titled “web scrap book/photojournal” that I look over from time to time, I do browse through the folder if I know I might have something perfect for a design project. Metadata is often overlooked. If I look at the photograph and it has no metadata to tell me who took it, it was uploaded to a platform that allows me to download it freely, and I can’t find what I need through a reverse image search. I act as if the photographer intended for their art to be shared for free. I would like to save information about the poster but it isn’t something I can do in two clicks. I would like to give the original artist recognition in the metadata of any file I create regardless of licensing too. It’s really simple to add metadata in photoshop and other editing software. This is something that we should all be focusing on. A good picture will spread across the internet rather quickly. Although the quality might be less than due to compression, so long as I don’t have to enlarge the photograph or use it for print (in some cases) the photo is usually good. We all have differing opinions when it comes to license. Ethical designers look for this information because we don’t appreciate theft of intellectual property either. Watermarks are a good, Reddit automatically puts a bar at the bottom of the photo with the name of the user who posted it. I don’t like to be dependent on watermarks because they rub clients the wrong way and can be disruptive to composition. I know pro photographers are aware of how much their content can be worth so they work with stock companies. I have a few pictures posted on line that were taken on my cell phone that aren’t up to pro quality but are still good enough to use depending on how. Sometimes the random cell phone shot is the missing piece to a composition. My whole point, ya never know, I’m not educated about copyright laws but I feel like a court would respect metadata as proof that an artist owns content. I would be enraged to find out that a large corporation was using my content without cutting me out a piece of the pie. Seeing my content used by Non profits, small business, and In portfolio work wouldn’t bug me at all. If I donate work to non-profit organizations I can claim it on my taxes, that’s a win win. If I include a line in metadata indicating who I’m willing to donate too then they don’t even have to ask for it to be considered donated. The most important inclusion is contact information though. If I see nothing but “this photo is the intellectual property of John Doe, he can’t be reached at jodo88@domain.net” I could just email and ask. I know that cameras can add metadata when the photo is shot. I’m sure some if not all pro cameras allow photographers to set defaults for metadata. It’s such a simple thing that addresses a huge ethical problem. From not on I’m going to ensure my photography has metadata. We should really work to make this standard practice among professionals, enthusiasts, amateurs, and cell phone owners. I’m sure a lot of people have been robbed by media outlets.", "title": "Metadata", "num-comments": 15, "score": 1, "date": "2021-03-02 19:18:20", "content": "Metadata /!/ I download so many photographs from the internet by just right clicking. I’m a graphic designer and all though most of the photographs go into a folder titled “web scrap book/photojournal” that I look over from time to time, I do browse through the folder if I know I might have something perfect for a design project. Metadata is often overlooked. If I look at the photograph and it has no metadata to tell me who took it, it was uploaded to a platform that allows me to download it freely, and I can’t find what I need through a reverse image search. I act as if the photographer intended for their art to be shared for free. I would like to save information about the poster but it isn’t something I can do in two clicks. I would like to give the original artist recognition in the metadata of any file -----> I create !!!  regardless of licensing too. It’s really simple to add metadata in photoshop and other editing software. This is something that we should all be focusing on. A good picture will spread across the internet rather quickly. Although the quality might be less than due to compression, so long as I don’t have to enlarge the photograph or use it for print (in some cases) the photo is usually good. We all have differing opinions when it comes to license. Ethical designers look for this information because we don’t appreciate theft of intellectual property either. Watermarks are a good, Reddit automatically puts a bar at the bottom of the photo with the name of the user who posted it. I don’t like to be dependent on watermarks because they rub clients the wrong way and can be disruptive to composition. I know pro photographers are aware of how much their content can be worth so they work with stock companies. I have a few pictures posted on line that were taken on my cell phone that aren’t up to pro quality but are still good enough to use depending on how. Sometimes the random cell phone shot is the missing piece to a composition. My whole point, ya never know, I’m not educated about copyright laws but I feel like a court would respect metadata as proof that an artist owns content. I would be enraged to find out that a large corporation was using my content without cutting me out a piece of the pie. Seeing my content used by Non profits, small business, and In portfolio work wouldn’t bug me at all. If I donate work to non-profit organizations I can claim it on my taxes, that’s a win win. If I include a line in metadata indicating who I’m willing to donate too then they don’t even have to ask for it to be considered donated. The most important inclusion is contact information though. If I see nothing but “this photo is the intellectual property of John Doe, he can’t be reached at jodo88@domain.net” I could just email and ask. I know that cameras can add metadata when the photo is shot. I’m sure some if not all pro cameras allow photographers to set defaults for metadata. It’s such a simple thing that addresses a huge ethical problem. From not on I’m going to ensure my photography has metadata. We should really work to make this standard practice among professionals, enthusiasts, amateurs, and cell phone owners. I’m sure a lot of people have been robbed by media outlets."}, {"autor": "sc-musfir-mujahid", "selftext": "[removed]", "title": "Hey guys, add me on sc I create lenses and I do streaks and stuff", "num-comments": 2, "score": 1, "date": "2021-05-16 07:12:11", "content": "Hey guys, add me on sc -----> I create !!!  lenses and I do streaks and stuff /!/ [removed]"}, {"autor": "Twink-le", "selftext": "I'm a 19 yo self-taught mua trying to get into beauty photography with just my mirrorless camera. I created tons of work this pandemic but I felt like a newbie using the automatic + exposure adjustment setting. If there's any pro in here I can send private message pics for some critic :3 my question/problems for now r:\n\n1. **What brightness should I set my screen to while editing?** still my biggest struggle, I edit at night then regret them at the day\n2. **I'm overwhelmed by major changes in editing** I'm more of a enhancer and major changes like a +50 brightness/exposure are too much for me, maybe I just don't have vision how do I be original? or where can I find inspo?", "title": "Quick Beauty retouching/photography tips for a beginner?", "num-comments": 1, "score": 1, "date": "2021-05-12 12:53:45", "content": "Quick Beauty retouching/photography tips for a beginner? /!/ I'm a 19 yo self-taught mua trying to get into beauty photography with just my mirrorless camera. -----> I created !!!  tons of work this pandemic but I felt like a newbie using the automatic + exposure adjustment setting. If there's any pro in here I can send private message pics for some critic :3 my question/problems for now r:\n\n1. **What brightness should I set my screen to while editing?** still my biggest struggle, I edit at night then regret them at the day\n2. **I'm overwhelmed by major changes in editing** I'm more of a enhancer and major changes like a +50 brightness/exposure are too much for me, maybe I just don't have vision how do I be original? or where can I find inspo?"}, {"autor": "adrig04", "selftext": "nan", "title": "What can I improve on this picture?", "num-comments": 2, "score": 1, "date": "2021-05-11 13:41:02", "content": "What can -----> I improve !!!  on this picture?"}, {"autor": "rloz22", "selftext": "[removed]", "title": "How can I develop film to look like this?", "num-comments": 2, "score": 0, "date": "2020-07-15 08:13:31", "content": "How can -----> I develop !!!  film to look like this? /!/ [removed]"}, {"autor": "[deleted]", "selftext": "[deleted]", "title": "I created this photo using a Nutella jar, water, a phone flashlight and a balloon weight.", "num-comments": 2, "score": 1, "date": "2020-07-21 19:48:42", "content": "-----> I created !!!  this photo using a Nutella jar, water, a phone flashlight and a balloon weight. /!/ [deleted]"}, {"autor": "Comi94", "selftext": "I am experimenting with photography for the last few years and I really enjoy the hobby, developing some skills for details and composition in everyday life that I haven’t utilized before, but now I’ve come to the point where I can recognize a scene that I want to capture but can’t keep the editing consistent.\n\nI’m a fan of earthy/warm matte darkish tones, with a grainy twist, and I want to keep consistent with my edits but just can’t find a way to do so. \n\nI was thinking of creating my own presets but as I’ve noticed, they don’t always turn out to fit different photo types (the more of a difference the histogram shows the worse it gets).\n\nHow do I improve and keep consistent style ?", "title": "How do I keep consistency throughout my photo feed?", "num-comments": 1, "score": 1, "date": "2021-05-27 13:49:46", "content": "How do I keep consistency throughout my photo feed? /!/ I am experimenting with photography for the last few years and I really enjoy the hobby, developing some skills for details and composition in everyday life that I haven’t utilized before, but now I’ve come to the point where I can recognize a scene that I want to capture but can’t keep the editing consistent.\n\nI’m a fan of earthy/warm matte darkish tones, with a grainy twist, and I want to keep consistent with my edits but just can’t find a way to do so. \n\nI was thinking of creating my own presets but as I’ve noticed, they don’t always turn out to fit different photo types (the more of a difference the histogram shows the worse it gets).\n\nHow do -----> I improve !!!  and keep consistent style ?"}, {"autor": "Future_Pilot4", "selftext": "nan", "title": "Hi! I created a Reddit page for anyone interested in aviation photography or just planes in general. Please feel free to join", "num-comments": 2, "score": 1, "date": "2021-05-27 02:39:40", "content": "Hi! -----> I created !!!  a Reddit page for anyone interested in aviation photography or just planes in general. Please feel free to join"}, {"autor": "InevitableVolume5744", "selftext": " \n\n# NOMATIC TEAM\n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. We design products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more \n\nhttps://nomatic.kckb.st/saba124\n\n*Processing video 0wr7vih5f8t61...*", "title": "camera beckpack", "num-comments": 1, "score": 1, "date": "2021-04-15 00:43:57", "content": "camera beckpack /!/  \n\n# NOMATIC TEAM\n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. -----> We design !!!  products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more \n\nhttps://nomatic.kckb.st/saba124\n\n*Processing video 0wr7vih5f8t61...*"}, {"autor": "InevitableVolume5744", "selftext": " \n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. We design products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more\n\n[https://nomatic.kckb.st/saba124](https://nomatic.kckb.st/saba124)\n\n![video](5cvlxqoaa8t61 \"s\")", "title": "camera beck pack", "num-comments": 1, "score": 1, "date": "2021-04-15 00:09:27", "content": "camera beck pack /!/  \n\nNomatic is a Kickstarter born company. This is our 11th Kickstarter campaign, we love it here, and we plan to keep coming back. Kickstarter allows us to receive real feedback from real customers before we even manufacture our products. This way, we are able to deliver a product we are sure you will love. -----> We design !!!  products that help you have confidence as you live life on the move. Thank you for believing in us!\n\nThere are always challenges and unforeseen obstacles that arise when trying to bring a product to life. However, this is our 11th product launch, so we can confidently say we are experienced in this process and have developed systems and processes to mitigate the risks and obstacles that will arise. We will work hard to ensure we deliver what we promise and to go the extra mile whenever possible. Thanks for believing in us!\n\nFeel free to learn more\n\n[https://nomatic.kckb.st/saba124](https://nomatic.kckb.st/saba124)\n\n![video](5cvlxqoaa8t61 \"s\")"}, {"autor": "Siigari", "selftext": "This might sound like a stupid question, but please bear with me.\n\nI recently purchased a Nikon Z6 II and have been shooting photos of my newborn with it. I am pleased with the photo quality digitally. However, my wife and I wanted to gift some photos to her Mom for her birthday. I worked the NEFs and saved them as TIFF, then happily went to FedEx Kinko's to print.\n\nThe 5x7s we made were of acceptable quality. The 4x6s had terrible horizontal banding, were extremely contrasty and I tried two separate printers. Both came out the same. They also came out curled (some is understandable, a U shape was not expected) which was frustrating while trying to get them into the collage frame.\n\nDespite this, the banding is only truly visible to me; I had to point it out to my wife to have her see it. At any rate, I come here asking the question: with digital, what are our options for printing? Must we print them using ink or toner? Can we create some sort of image and have them developed in a darkroom? Are there options for smoother photos? Am I crazy?\n\nNote: *not* trying to start an argument over digital vs film. I have a digital camera, and I want the best prints possible.\n\nThanks.", "title": "What options do we have for digital prints?", "num-comments": 15, "score": 1, "date": "2021-09-05 18:34:23", "content": "What options do we have for digital prints? /!/ This might sound like a stupid question, but please bear with me.\n\nI recently purchased a Nikon Z6 II and have been shooting photos of my newborn with it. I am pleased with the photo quality digitally. However, my wife and I wanted to gift some photos to her Mom for her birthday. I worked the NEFs and saved them as TIFF, then happily went to FedEx Kinko's to print.\n\nThe 5x7s we made were of acceptable quality. The 4x6s had terrible horizontal banding, were extremely contrasty and I tried two separate printers. Both came out the same. They also came out curled (some is understandable, a U shape was not expected) which was frustrating while trying to get them into the collage frame.\n\nDespite this, the banding is only truly visible to me; I had to point it out to my wife to have her see it. At any rate, I come here asking the question: with digital, what are our options for printing? Must we print them using ink or toner? Can -----> we create !!!  some sort of image and have them developed in a darkroom? Are there options for smoother photos? Am I crazy?\n\nNote: *not* trying to start an argument over digital vs film. I have a digital camera, and I want the best prints possible.\n\nThanks."}, {"autor": "CheapMess", "selftext": "Hi /Photography I'm going to share something that I have been working on and have a lot of hours in.  Please don't be an Jerk, but if you have something helpful to say, please do share.\n\nI wrote this guide as if I already do this - in reality, I have done all the individual parts, but haven't had the chance to put it all together (thanks covid)  There may be kinks to workout, and if you spot one, I will try to edit this guide over time.  Also, I shoot Nikon - but if you have a different brand based equivalent, I can try to include those options as well.\n\n&amp;#x200B;\n\nThe most difficult part of the travel photography workflow for me has always been culling/selecting my images.\n\nI have found that going through one to two hundred in an evening, is much more manageable than several thousand at once.\n\nI developed this workflow in order to travel as light as possible, maintain creative options, and not turn my vacation photos into a chore.\n\nI do have different gear and processes for my professional work, but this is the balance I want for personal travel.\n\nI am open to refining, but before you say it, I haven’t had any issues with battery-life with regards to the low-energy-bluetooth connection.\n\n&amp;#x200B;\n\n**GEAR:**\n\nNikon Z6 \n\n24-70 f/4 - may switch to 24-200 f/4-6.3\n\n2x TT350N Flash (one used as transmitter, also serves as a backup if a bulb blows)\n\n4 AA’s\n\n128GB QXD memory card\n\nColorChecker Passport\n\n2x ENEL15B Camera Batteries\n\niPhone with Snapbridge and LR Mobile\n\nExternal Battery Pack\n\n\\- has USB-C i/o, Lightning i/o, USB-A output, Micro-USB input\n\n\\- lightning to USB-C cable (can be used to charge phone, and by reversing, the camera)\n\n**IN THE HOTEL:**\n\nWD MyPassport (Wifi-Enabled HDD)\n\nAA Charger\n\nXQD to USB-A Adapter (you don’t need this if your camera uses SD)\n\nUSB-Micro-3 to USB-A Adapter\n\nAC Adapter\n\n\\- has 1 USB-C, 3 USB-A outputs\n\n**AT HOME:**\n\nComputer with LR Classic\n\n\\-Adobe cloud account \n\n\\-Syncomatic LR Plugin (I think it cost $5 for a license key, well worth it)\n\n\\-Photoshop or Equivalent\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**In the field:**\n\nPhotograph Images with Phone nearby, Bluetooth on, screen off.\n\n\\- Camera auto transfers 2MP JPG to SnapBridge app via Bluetooth\n\n\\- Snapbridge auto copies images to Photos app\n\n\\- Google Photos auto uploads images in Photos app to Google Account\n\n**When you have downtime (train, bus, plane, coffee shop, hotel)**\n\nCreate Folder in LR Mobile\n\nImport images into LR Mobile from Photos App\n\nUse Google Photos menu to “Free up space on device”\n\n\\- This will eliminate duplicates from Photos App, and Snapbridge\n\n\\- 2MP JPG Backups will remain in Adobe Cloud Account, and Google Photos Cloud\n\nMake Selections, and perform minor edits in LR Mobile\n\n\\- If desired, export and share select images to Social Media\n\nBackup RAW Files to WD MyPassport as 2nd Backup\n\n\\- Keep this locked in safe if possible\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**When you get home:**\n\nConnect WD MyPassport to Computer\n\nLaunch LR Classic\n\n\\- Import RAW images to Local HDD and 2nd External HDD\n\n\\- Keyword images if that is part of your workflow\n\n\\- Verify that all images are successfully copied to both locations\n\n\\- If there were any issues, copy images directly from Memory Card\n\nRun Time Machine (or equivalent backup software) on 3rd External HDD\n\n\\- You should be certain that your backups are including your External Drives\n\nMove your 2nd External HDD to separate physical location if you are extra-paranoid\n\nClear Memory Cards &amp; Clear WD MyPassport (the scariest step)\n\nYou will have a folder in the “From Lightroom CC” section with all 2mp JPGs flagged/rated\n\n\\- Click on the folder\n\nYou will have a new folder that you just imported with all your RAW images\n\n\\- Hold CMD key and Click on that folder\n\nAll your JPGs and RAW images will appear in the Grid view together\n\n(If you are not already in the Grid view, tap “G”)\n\n\\- Hold CMD and tap the “A” key to select all images in the Grid\n\nClick on “File”, go down to “Plug-in Extras” and over to “Sync files with the same name or time”\n\nFollow the Prompts\n\n(Cheat Sheet - 1st box “JPG”, 2nd box “RAW”, checkbox “File name”, Checkbox “Flag” “Rating” “Develop Settings”)\n\n\\- Click “OK”\n\n\\- All of your flags, ratings, and develop settings will be copied from your 2MP JPGs to your Raw Files\n\nDeselect the JPG Folder by CMD + Clicking on it\n\n\\- Now all of your Culling, Selections, and Rating are done\n\nEdit Exposure, Tones, Color, Cropping, etc. as normal in LR and PS as necessary \n\nRender all of your desired media as you normally do (slideshows, albums, prints, social media posts, website content, etc.)\n\nOnce finished with the project, “Export as Catalog” to Archive Drive and Delete the Files from local HDD\n\nIf you need to work on anything again, you can import the catalog into LR Classic and pick up where you left off\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWORST CASE SCENARIOS:\n\n1) You are murdered on your trip and nobody gets to see your pictures\n\n2) Your camera is stolen, Your hard drive in the Hotel is stolen, Your phone is stolen, and your Google, and Adobe accounts are hacked and deleted\n\n3) The above, except the last one, and you are left with 2MP JPGs\n\n4) The above, except the last two, you have the same 2MP JPGs, but you don’t have to do your selections again\n\n5) Only your camera is stolen, so you get to keep your RAW files on the HDD, and still sync with LR Mobile, you only lose 1 day’s photos\n\n6) Your HDD is stolen, so you only have one copy of the RAW files on your memory card: try to get to an internet cafe/library and backup your card ASAP\n\n7) You are held prisoner, falsely accused, you blink your Google credentials in Morse code on a propaganda video for NSA analysts to decipher, they process and release your photos on your behalf, you death is tragic, but you are remembered for your art.", "title": "Travel Photography Equipment &amp; Workflow for mobility, security, and function", "num-comments": 7, "score": 1, "date": "2020-08-27 04:16:24", "content": "Travel Photography Equipment &amp; Workflow for mobility, security, and function /!/ Hi /Photography I'm going to share something that I have been working on and have a lot of hours in.  Please don't be an Jerk, but if you have something helpful to say, please do share.\n\nI wrote this guide as if I already do this - in reality, I have done all the individual parts, but haven't had the chance to put it all together (thanks covid)  There may be kinks to workout, and if you spot one, I will try to edit this guide over time.  Also, I shoot Nikon - but if you have a different brand based equivalent, I can try to include those options as well.\n\n&amp;#x200B;\n\nThe most difficult part of the travel photography workflow for me has always been culling/selecting my images.\n\nI have found that going through one to two hundred in an evening, is much more manageable than several thousand at once.\n\n-----> I developed !!!  this workflow in order to travel as light as possible, maintain creative options, and not turn my vacation photos into a chore.\n\nI do have different gear and processes for my professional work, but this is the balance I want for personal travel.\n\nI am open to refining, but before you say it, I haven’t had any issues with battery-life with regards to the low-energy-bluetooth connection.\n\n&amp;#x200B;\n\n**GEAR:**\n\nNikon Z6 \n\n24-70 f/4 - may switch to 24-200 f/4-6.3\n\n2x TT350N Flash (one used as transmitter, also serves as a backup if a bulb blows)\n\n4 AA’s\n\n128GB QXD memory card\n\nColorChecker Passport\n\n2x ENEL15B Camera Batteries\n\niPhone with Snapbridge and LR Mobile\n\nExternal Battery Pack\n\n\\- has USB-C i/o, Lightning i/o, USB-A output, Micro-USB input\n\n\\- lightning to USB-C cable (can be used to charge phone, and by reversing, the camera)\n\n**IN THE HOTEL:**\n\nWD MyPassport (Wifi-Enabled HDD)\n\nAA Charger\n\nXQD to USB-A Adapter (you don’t need this if your camera uses SD)\n\nUSB-Micro-3 to USB-A Adapter\n\nAC Adapter\n\n\\- has 1 USB-C, 3 USB-A outputs\n\n**AT HOME:**\n\nComputer with LR Classic\n\n\\-Adobe cloud account \n\n\\-Syncomatic LR Plugin (I think it cost $5 for a license key, well worth it)\n\n\\-Photoshop or Equivalent\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**In the field:**\n\nPhotograph Images with Phone nearby, Bluetooth on, screen off.\n\n\\- Camera auto transfers 2MP JPG to SnapBridge app via Bluetooth\n\n\\- Snapbridge auto copies images to Photos app\n\n\\- Google Photos auto uploads images in Photos app to Google Account\n\n**When you have downtime (train, bus, plane, coffee shop, hotel)**\n\nCreate Folder in LR Mobile\n\nImport images into LR Mobile from Photos App\n\nUse Google Photos menu to “Free up space on device”\n\n\\- This will eliminate duplicates from Photos App, and Snapbridge\n\n\\- 2MP JPG Backups will remain in Adobe Cloud Account, and Google Photos Cloud\n\nMake Selections, and perform minor edits in LR Mobile\n\n\\- If desired, export and share select images to Social Media\n\nBackup RAW Files to WD MyPassport as 2nd Backup\n\n\\- Keep this locked in safe if possible\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**When you get home:**\n\nConnect WD MyPassport to Computer\n\nLaunch LR Classic\n\n\\- Import RAW images to Local HDD and 2nd External HDD\n\n\\- Keyword images if that is part of your workflow\n\n\\- Verify that all images are successfully copied to both locations\n\n\\- If there were any issues, copy images directly from Memory Card\n\nRun Time Machine (or equivalent backup software) on 3rd External HDD\n\n\\- You should be certain that your backups are including your External Drives\n\nMove your 2nd External HDD to separate physical location if you are extra-paranoid\n\nClear Memory Cards &amp; Clear WD MyPassport (the scariest step)\n\nYou will have a folder in the “From Lightroom CC” section with all 2mp JPGs flagged/rated\n\n\\- Click on the folder\n\nYou will have a new folder that you just imported with all your RAW images\n\n\\- Hold CMD key and Click on that folder\n\nAll your JPGs and RAW images will appear in the Grid view together\n\n(If you are not already in the Grid view, tap “G”)\n\n\\- Hold CMD and tap the “A” key to select all images in the Grid\n\nClick on “File”, go down to “Plug-in Extras” and over to “Sync files with the same name or time”\n\nFollow the Prompts\n\n(Cheat Sheet - 1st box “JPG”, 2nd box “RAW”, checkbox “File name”, Checkbox “Flag” “Rating” “Develop Settings”)\n\n\\- Click “OK”\n\n\\- All of your flags, ratings, and develop settings will be copied from your 2MP JPGs to your Raw Files\n\nDeselect the JPG Folder by CMD + Clicking on it\n\n\\- Now all of your Culling, Selections, and Rating are done\n\nEdit Exposure, Tones, Color, Cropping, etc. as normal in LR and PS as necessary \n\nRender all of your desired media as you normally do (slideshows, albums, prints, social media posts, website content, etc.)\n\nOnce finished with the project, “Export as Catalog” to Archive Drive and Delete the Files from local HDD\n\nIf you need to work on anything again, you can import the catalog into LR Classic and pick up where you left off\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWORST CASE SCENARIOS:\n\n1) You are murdered on your trip and nobody gets to see your pictures\n\n2) Your camera is stolen, Your hard drive in the Hotel is stolen, Your phone is stolen, and your Google, and Adobe accounts are hacked and deleted\n\n3) The above, except the last one, and you are left with 2MP JPGs\n\n4) The above, except the last two, you have the same 2MP JPGs, but you don’t have to do your selections again\n\n5) Only your camera is stolen, so you get to keep your RAW files on the HDD, and still sync with LR Mobile, you only lose 1 day’s photos\n\n6) Your HDD is stolen, so you only have one copy of the RAW files on your memory card: try to get to an internet cafe/library and backup your card ASAP\n\n7) You are held prisoner, falsely accused, you blink your Google credentials in Morse code on a propaganda video for NSA analysts to decipher, they process and release your photos on your behalf, you death is tragic, but you are remembered for your art."}, {"autor": "imperial_account_III", "selftext": "I'm relatively new to photography and quite recently bought my first real camera (a Fuji X-T30). My main purpose is documenting my hikes, which I used to do with my phone, but wanted an upgrade in image quality.\n\nWith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. I also feel like my methods aren't exactly efficient, but I'm not sure what exactly I could improve. So I'd like to collect your preferred processes and learn from them.\n\nFor the record, these are my old and current processes, respectively:\n\n**Old Process (Phone)**\n\n1. Let MS Onedrive back up the pictures from my phone.\n\n2. Create an album for that day/hike/event from the camera reel.\n\n3. Delete the bad or unsuitable pictures from the album.\n\n4. Download the album to my computer and back it up locally.\n\n**New Process**\n\n1. Insert SD Card into card reader on PC.\n\n2. Look through pictures, deleting bad ones and rating really good ones as 4/5 stars within Windows Explorer. See step 4 for relevance of the latter.\n\n3. Be annoyed with Windows 10 because Windows 7 was better and more convenient at literally everything. Be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. Sort by name, manually select the RAW files corresponding to the 4-5 star rated JPEGs, and send them over to a \"Source/RAW\" folder on the hard drive (No use in keeping the mediocre RAWs).\n\n5. Send the remaining JPEGs to the Source folder.\n\n6. At this point, I would use rawtherapee to create optimal PNGs from the RAW files, but I'm still learning how to make those not look shit, so instead at this point, I edit the JPEGs that could be good but need some adjustments.\n\n7. Create an Album folder for that Day/Hike/Event and copy (not move) all the pictures over.\n\n8. Delete the ones I don't want in the Album.\n\n9. Upload the album folder to Onedrive (web, not the windows folder. I hate how that one works) for backup / sharing among family and friends.\n\n10. Optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**Considerations**\n\nI'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. This is not an issue yet, but might become costly in the future.\n\nThe reason I do this is that I find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and I don't trust tags.\n\nWhen I say I don't trust tags, I mean I don't want to go through hours of effort tagging images by content only to find in ten years that my new operating system doesn't know what to do with the tags I created in Windows 10, for example. Themed folders full of copied files seem much more reliable.\n\nThe downside of copy pasting is that if I alter an image later on, be it in name or the image itself, I have to apply those changes everywhere else the image is saved as well.\n\nI think the biggest issue currently is how long steps 1-6 are taking me, and I'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\nI'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\nI've considered having Onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (I'd hate to have to reorganize tens of thousands of pictures the day I stop using Onedrive.)\n\n**What do you do yourself? And what would you change about my approach or recommend to aid me, considering my considerations?** \n\nThanks for your time and have a great day :)", "title": "What's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process?", "num-comments": 73, "score": 1, "date": "2021-09-08 12:14:49", "content": "What's your preferred import &gt; rating / sorting &gt; editing &gt; filing / album creation &gt; backup process? /!/ I'm relatively new to photography and quite recently bought my first real camera (a Fuji X-T30). My main purpose is documenting my hikes, which I used to do with my phone, but wanted an upgrade in image quality.\n\nWith the camera, my process for dealing with the pictures has changed quite a bit, and the effort has increased significantly. I also feel like my methods aren't exactly efficient, but I'm not sure what exactly I could improve. So I'd like to collect your preferred processes and learn from them.\n\nFor the record, these are my old and current processes, respectively:\n\n**Old Process (Phone)**\n\n1. Let MS Onedrive back up the pictures from my phone.\n\n2. Create an album for that day/hike/event from the camera reel.\n\n3. Delete the bad or unsuitable pictures from the album.\n\n4. Download the album to my computer and back it up locally.\n\n**New Process**\n\n1. Insert SD Card into card reader on PC.\n\n2. Look through pictures, deleting bad ones and rating really good ones as 4/5 stars within Windows Explorer. See step 4 for relevance of the latter.\n\n3. Be annoyed with Windows 10 because Windows 7 was better and more convenient at literally everything. Be salty about lost functionality like jumping to the file from the open photo, or being able to have the preview and details pane open simultaneously, as well as being able to rate the picture from the open photo without having to switch back to the folder and looking for the current image by name to be able to rate it.\n\n4. Sort by name, manually select the RAW files corresponding to the 4-5 star rated JPEGs, and send them over to a \"Source/RAW\" folder on the hard drive (No use in keeping the mediocre RAWs).\n\n5. Send the remaining JPEGs to the Source folder.\n\n6. At this point, I would use rawtherapee to create optimal PNGs from the RAW files, but I'm still learning how to make those not look shit, so instead at this point, I edit the JPEGs that could be good but need some adjustments.\n\n7. Create an Album folder for that Day/Hike/Event and copy (not move) all the pictures over.\n\n8. Delete the ones I don't want in the Album.\n\n9. Upload the album folder to Onedrive (web, not the windows folder. I hate how that one works) for backup / sharing among family and friends.\n\n10. Optionally copy individual pictures to different folders comprising various topical favorite images like \"of my wife\", \"of my pets\", etc.\n\n**Considerations**\n\nI'm currently wasting up to around 110% extra hard drive space by copying images into various themed folders. This is not an issue yet, but might become costly in the future.\n\nThe reason I do this is that I find it the easiest method to find the pictures later, it's the most convenient form of organization to my brain, shortcuts and tags wouldn't work for uploading, and I don't trust tags.\n\nWhen I say I don't trust tags, I mean I don't want to go through hours of effort tagging images by content only to find in ten years that my new operating system doesn't know what to do with the tags -----> I created !!!  in Windows 10, for example. Themed folders full of copied files seem much more reliable.\n\nThe downside of copy pasting is that if I alter an image later on, be it in name or the image itself, I have to apply those changes everywhere else the image is saved as well.\n\nI think the biggest issue currently is how long steps 1-6 are taking me, and I'm almost sure there has to be a better way, perhaps 3rd party software assisted. \n\nI'd also like to waste less hard drive space, and have the images thematically filed but connected.\n\nI've considered having Onedrive (web) as my canonical filing space and using their tags and albums instead of copying files, as that resolves all my issues except the futureproofing aspect (I'd hate to have to reorganize tens of thousands of pictures the day I stop using Onedrive.)\n\n**What do you do yourself? And what would you change about my approach or recommend to aid me, considering my considerations?** \n\nThanks for your time and have a great day :)"}, {"autor": "nowseekingdiscomfort", "selftext": "Hey there everyone! I'm working on a clothing brand that exists to empower artists of all mediums (INCLUDING PHOTOGRAPHY) so I created a [Survey](https://forms.gle/KFrbxtd5yCWA9LPy6) to understand how the rest of the world sees storytelling. Please take a few minutes to help me make this dream a reality!\n\nI really appreciate your help and support :)", "title": "Artist Survey - Please Help Me Accomplish My Dream", "num-comments": 2, "score": 0, "date": "2021-09-23 04:17:22", "content": "Artist Survey - Please Help Me Accomplish My Dream /!/ Hey there everyone! I'm working on a clothing brand that exists to empower artists of all mediums (INCLUDING PHOTOGRAPHY) so -----> I created !!!  a [Survey](https://forms.gle/KFrbxtd5yCWA9LPy6) to understand how the rest of the world sees storytelling. Please take a few minutes to help me make this dream a reality!\n\nI really appreciate your help and support :)"}, {"autor": "tenchi39", "selftext": "I'm a noob in photography but created a few webapps before. Tried Single File PHP Gallery, but didn't like it and none of the alternatives were promising either.\n\nI created a really simple PHP based gallery that doesn't need a database to operate. No website for it yet, but it is available on Bitbucket and I put together a demo site here: https://photobook.randomblog.hu/\n\nAny input would be much appreciated...", "title": "Dissatisfied with online galleries to display my photos, I created my own...", "num-comments": 2, "score": 1, "date": "2021-08-08 10:12:28", "content": "Dissatisfied with online galleries to display my photos, -----> I created !!!  my own... /!/ I'm a noob in photography but created a few webapps before. Tried Single File PHP Gallery, but didn't like it and none of the alternatives were promising either.\n\n-----> I created !!!  a really simple PHP based gallery that doesn't need a database to operate. No website for it yet, but it is available on Bitbucket and I put together a demo site here: https://photobook.randomblog.hu/\n\nAny input would be much appreciated..."}, {"autor": "Weigang_Music", "selftext": "Hey guys,\n\n(hope this fits the rules, if not please let me know as I am new to the sub)\n\nTL;DR: Created a tool for timlapses. Sample and github below. Looking for workflow feedback.\n\n&amp;#x200B;\n\nI recently went out to film some timelapses. And my cam has a nifty feature, automatically creating those, but I wanted more control. So I switched to interval shooting and then batch-edited the raw-images to my liking. But then I didn't want to use a full-on Video Editor to create the timelapse, yet I wanted to have full control. FFMPEG does that wonderfully, but getting the details right was a bit of a pain..\n\n&amp;#x200B;\n\nSo after a few days of trial and error and testing the featureset of FFMPEG I resorted to saving my presets to a batch-file. A few days later and that batch-file has grown into a script that offers high quality preset as well as full granular control. All you have to do is put it inside a folder with a sequence of images and run it.\n\n&amp;#x200B;\n\nAs of right now it can encode prores (intermediate codec for editing in 10bit), h264, h265 and gifs (because why not!?). It presets (and lets you adjust) the Dimension/Aspect ratio, framerate, file-container, quality (profile/crf), bitrate, keyframe-interval, and maximum file-size (for gifs). If rendering in Prores it also automatically creates an identically-named proxy file in 720p for editing.\n\n&amp;#x200B;\n\nI thought I would share this so I started using [github](https://github.com/Jan-Weigang/Timelapse-Creator) for this.\n\n**Questions for you:** \n\nWould this fit your workflow? Do you think I am missing an important feature or got something wrong? Would you change anything?\n\n&amp;#x200B;\n\n[Timelapse encoded to 360p gif, 20fps, 100 images](https://i.redd.it/xg0807nqk3h71.gif)", "title": "I created a tool to automate creating timelapses from a sequence of images with ffmpeg.", "num-comments": 4, "score": 1, "date": "2021-08-13 09:55:24", "content": "-----> I created !!!  a tool to automate creating timelapses from a sequence of images with ffmpeg. /!/ Hey guys,\n\n(hope this fits the rules, if not please let me know as I am new to the sub)\n\nTL;DR: Created a tool for timlapses. Sample and github below. Looking for workflow feedback.\n\n&amp;#x200B;\n\nI recently went out to film some timelapses. And my cam has a nifty feature, automatically creating those, but I wanted more control. So I switched to interval shooting and then batch-edited the raw-images to my liking. But then I didn't want to use a full-on Video Editor to create the timelapse, yet I wanted to have full control. FFMPEG does that wonderfully, but getting the details right was a bit of a pain..\n\n&amp;#x200B;\n\nSo after a few days of trial and error and testing the featureset of FFMPEG I resorted to saving my presets to a batch-file. A few days later and that batch-file has grown into a script that offers high quality preset as well as full granular control. All you have to do is put it inside a folder with a sequence of images and run it.\n\n&amp;#x200B;\n\nAs of right now it can encode prores (intermediate codec for editing in 10bit), h264, h265 and gifs (because why not!?). It presets (and lets you adjust) the Dimension/Aspect ratio, framerate, file-container, quality (profile/crf), bitrate, keyframe-interval, and maximum file-size (for gifs). If rendering in Prores it also automatically creates an identically-named proxy file in 720p for editing.\n\n&amp;#x200B;\n\nI thought I would share this so I started using [github](https://github.com/Jan-Weigang/Timelapse-Creator) for this.\n\n**Questions for you:** \n\nWould this fit your workflow? Do you think I am missing an important feature or got something wrong? Would you change anything?\n\n&amp;#x200B;\n\n[Timelapse encoded to 360p gif, 20fps, 100 images](https://i.redd.it/xg0807nqk3h71.gif)"}, {"autor": "Mr_Wood1440_", "selftext": "nan", "title": "No idea if this is allowed, but is this a good photo? What can I improve?", "num-comments": 2, "score": 1, "date": "2021-07-14 11:56:52", "content": "No idea if this is allowed, but is this a good photo? What can -----> I improve !!! ?"}, {"autor": "roberole", "selftext": "I have a friend that works as a freelance photographer. His work really is something **special**. His creativity, project management and pure desire to get the best out of everything he does is honestly truly **inspiring**.\n\nYet, no one cares. **No one**. I’ve watched him over the last 10 years push and claw his way up, fighting for every job he can get and **struggling** mentally with the constant rejection he receives. He loves photography, it really is a passion for him. Yet most days I see photographers that really shouldn't be in the positions they are in occupying the roles he should have.\n\nI work as a creative designer and am also the studio lead for my workplace. I give him as much work as possible and every time he does an excellent job. For his level of experience and output he should be one of the most sought after photographers in the country, his portfolio of work speaks for itself.\n\n**So from the many talented professionals in this sub, what can be done?** How can I help him better get noticed and secure work. What can he do differently? He applies for studio jobs, he creates so much work for free to help get noticed and he's constantly contacting people.\n\nI fear a good friend of mine is sinking so much that he may just give up one day and I don't want to lose him.", "title": "Photography and mental health", "num-comments": 126, "score": 1, "date": "2021-08-16 12:09:18", "content": "Photography and mental health /!/ I have a friend that works as a freelance photographer. His work really is something **special**. His creativity, project management and pure desire to get the best out of everything he does is honestly truly **inspiring**.\n\nYet, no one cares. **No one**. I’ve watched him over the last 10 years push and claw his way up, fighting for every job he can get and **struggling** mentally with the constant rejection he receives. He loves photography, it really is a passion for him. Yet most days I see photographers that really shouldn't be in the positions they are in occupying the roles he should have.\n\nI work as a creative designer and am also the studio lead for my workplace. I give him as much work as possible and every time he does an excellent job. For his level of experience and output he should be one of the most sought after photographers in the country, his portfolio of work speaks for itself.\n\n**So from the many talented professionals in this sub, what can be done?** How can I help him better get noticed and secure work. What can he do differently? He applies for studio jobs, -----> he creates !!!  so much work for free to help get noticed and he's constantly contacting people.\n\nI fear a good friend of mine is sinking so much that he may just give up one day and I don't want to lose him."}, {"autor": "Busy_shug", "selftext": "nan", "title": "I created a Diesel Brave fragrance commercial by accident.", "num-comments": 2, "score": 1, "date": "2021-07-18 19:01:43", "content": "-----> I created !!!  a Diesel Brave fragrance commercial by accident."}, {"autor": "Rukpegel", "selftext": "nan", "title": "Trying to get better at photography &amp; editing, especially car photos. What can I improve apart from the location?", "num-comments": 2, "score": 1, "date": "2020-05-07 22:16:12", "content": "Trying to get better at photography &amp; editing, especially car photos. What can -----> I improve !!!  apart from the location?"}, {"autor": "Deeps13", "selftext": "So I've been shooting for about a year or so now, (just as a hobby) using a mirrorless A6400 and I never seem to be able to get the quality of image on par with ones on stock websites etc. \n\nAfter much critique I've realised my shots are generally lacking sharpness and clarity. \n\nI've done a lot of research and looked into lighting, understanding autofocus, metering, exposure and much more but still haven't had a significant increase in quality. Is the gap between my quality and the ones like photography websites due to practice or camera gear ( using full frame over mirrorless?) Or something else?\n\nAny reccomendations and help would be great.\nCheers.", "title": "How do I improve the clarity and sharpness of my shots?", "num-comments": 4, "score": 1, "date": "2020-03-08 21:56:24", "content": "How do -----> I improve !!!  the clarity and sharpness of my shots? /!/ So I've been shooting for about a year or so now, (just as a hobby) using a mirrorless A6400 and I never seem to be able to get the quality of image on par with ones on stock websites etc. \n\nAfter much critique I've realised my shots are generally lacking sharpness and clarity. \n\nI've done a lot of research and looked into lighting, understanding autofocus, metering, exposure and much more but still haven't had a significant increase in quality. Is the gap between my quality and the ones like photography websites due to practice or camera gear ( using full frame over mirrorless?) Or something else?\n\nAny reccomendations and help would be great.\nCheers."}, {"autor": "breeellaneeley", "selftext": "nan", "title": "The other night I had a nightmare about a lack of social distancing. So I created this image to capture those feelings. I don't want to emphasize the negativity, I just wanted to create a piece that documented the time in an unconventional way. This is a historical moment. Stay safe! Stay sane!", "num-comments": 2, "score": 1, "date": "2020-05-01 04:07:20", "content": "The other night I had a nightmare about a lack of social distancing. So -----> I created !!!  this image to capture those feelings. I don't want to emphasize the negativity, I just wanted to create a piece that documented the time in an unconventional way. This is a historical moment. Stay safe! Stay sane!"}, {"autor": "YogurtxPretzels", "selftext": "I know you can ask your friends, but obviously I want something outside of that.\n\nI’m not really looking to capitalize off model photography, I just want to do it.\n\nI want to improve my skill in that specific field, hell I’m not going to charge them. Honestly, taking dope pics and knowing I improved a little is all I need.\n\nIf anything, the model will help me in this stuff because I don’t know squat about how to pose them.. yet of course.\n\nI just want the experience. And nice pictures to add to my portfolio.\n\nSo how would one go about finding models? A suggestion from way back was to find them on FB, but I really don’t know how to go about that.", "title": "How does one get access to models?", "num-comments": 19, "score": 1, "date": "2020-01-16 08:25:56", "content": "How does one get access to models? /!/ I know you can ask your friends, but obviously I want something outside of that.\n\nI’m not really looking to capitalize off model photography, I just want to do it.\n\nI want to improve my skill in that specific field, hell I’m not going to charge them. Honestly, taking dope pics and knowing -----> I improved !!!  a little is all I need.\n\nIf anything, the model will help me in this stuff because I don’t know squat about how to pose them.. yet of course.\n\nI just want the experience. And nice pictures to add to my portfolio.\n\nSo how would one go about finding models? A suggestion from way back was to find them on FB, but I really don’t know how to go about that."}, {"autor": "FuerteBillete", "selftext": "Hello everyone. I have a question that I could not find a proper answer when googling so here it goes. \n\nImagine I upload my images as a video on youtube, on social networks such as instagram, on my own website. I know copyright is mine the moment I created it. But this right needs some proof.\n\nThe question is, what if someone for example take one of my images and register it as theirs on sites such as pixsy or similar sites, and then that site or other sites like that one searches with their bots and tell me Im infringint the copyright?\n\nI hope Im being clear enough. \n\nIs my youtube publication or self site or instagram posts proof enough of my copyright? \n\nI have thousand of pictures due to the nature of my work and I cant register them all as it would not be cost effective. \n\nI just want to know if someone can shed some light on this, how to be protected against someone registering my work as their and then wanting to sue me. Im not asking how to sue anyone myself, only to be protected from this particular situation.\n\nThanks in advance for your time and hope it made sense. Cheers to you all.", "title": "How to prevent someone from suing me over my own images. Please read.", "num-comments": 0, "score": 1, "date": "2020-12-08 22:20:34", "content": "How to prevent someone from suing me over my own images. Please read. /!/ Hello everyone. I have a question that I could not find a proper answer when googling so here it goes. \n\nImagine I upload my images as a video on youtube, on social networks such as instagram, on my own website. I know copyright is mine the moment -----> I created !!!  it. But this right needs some proof.\n\nThe question is, what if someone for example take one of my images and register it as theirs on sites such as pixsy or similar sites, and then that site or other sites like that one searches with their bots and tell me Im infringint the copyright?\n\nI hope Im being clear enough. \n\nIs my youtube publication or self site or instagram posts proof enough of my copyright? \n\nI have thousand of pictures due to the nature of my work and I cant register them all as it would not be cost effective. \n\nI just want to know if someone can shed some light on this, how to be protected against someone registering my work as their and then wanting to sue me. Im not asking how to sue anyone myself, only to be protected from this particular situation.\n\nThanks in advance for your time and hope it made sense. Cheers to you all."}, {"autor": "argusromblei", "selftext": "\nI’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. Need a mix of experience to help start my own website.\n\nDoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nIs your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? Do you choose a certain resolution and do your photos get stolen lifted from your site? \n\nI’m highly experienced in wordpress themes and have picked a bunch I like from themeforest but need some personal experiences before I design my photo website.\n\nThanks!", "title": "Pro photographers with successful portfolio print websites, I need some insight.", "num-comments": 4, "score": 1, "date": "2020-11-18 21:03:52", "content": "Pro photographers with successful portfolio print websites, I need some insight. /!/ \nI’d like to see your websites and hear your process, everyone who has proven successful photographer print/art websites. Need a mix of experience to help start my own website.\n\nDoes treating yourself as a gallery artist, printing a stock of your own large framed prints with personalized signatures and limited runs work better than say a seamless website with woo commerce and printful? \n\nIs your website theme a contact sheet with full screen photos or is it smaller preview galleries like a design portfolio? Do you choose a certain resolution and do your photos get stolen lifted from your site? \n\nI’m highly experienced in wordpress themes and have picked a bunch I like from themeforest but need some personal experiences before -----> I design !!!  my photo website.\n\nThanks!"}, {"autor": "prousstibat", "selftext": "Hello everyone,\n\nMy mom is absolutely passionate about photography and recently quit her job to focus on photography and make this passion for her full-time job.  \n\n\nI want to support her in this decision and help her, so I figured I should get her some nice books to help her develop new skills.  \n\n\nShe is more into nature photography and also surfing photography, She did some gigs for French surf brands who needed photographs for their new products already.  \n\n\nWhat books do you consider \"must have\" for any photographer who wants to take it to the next level?\n\n&amp;#x200B;\n\nThanks a lot and stay safe :)", "title": "Best books to learn new photography skills?", "num-comments": 17, "score": 1, "date": "2020-12-04 13:50:46", "content": "Best books to learn new photography skills? /!/ Hello everyone,\n\nMy mom is absolutely passionate about photography and recently quit her job to focus on photography and make this passion for her full-time job.  \n\n\nI want to support her in this decision and help her, so I figured I should get her some nice books to help -----> her develop !!!  new skills.  \n\n\nShe is more into nature photography and also surfing photography, She did some gigs for French surf brands who needed photographs for their new products already.  \n\n\nWhat books do you consider \"must have\" for any photographer who wants to take it to the next level?\n\n&amp;#x200B;\n\nThanks a lot and stay safe :)"}, {"autor": "scrambledjazz", "selftext": "nan", "title": "What is this picture missing? Help me improve it. I took this picture today and feel like it's just missing something. I can't put my finger on it. Maybe some of your trained eyes can help me? Also, I'd love some critiques.", "num-comments": 2, "score": 1, "date": "2021-05-08 14:53:03", "content": "What is this picture missing? Help -----> me improve !!!  it. I took this picture today and feel like it's just missing something. I can't put my finger on it. Maybe some of your trained eyes can help me? Also, I'd love some critiques."}, {"autor": "latteandpizza", "selftext": "Hello!\n\nHere I am writing the first post on this wonderful community subreddit!\n\nI recently started a collective for creatives, and I thought this would be a great thing to share with any of you that would be interested in having their work featured somewhere and showcased online. I know it’s the submission process is quite frustrating for a lot of mediums, so I thought that creating a place where we can share and talk about our work without feeling the competition was a nice idea.\n\nThis is where Le Freak Media comes in, I created a website where I’d love to showcase and let the artist talk about their work and their process behind it. I also made an IG account that goes with it, so if any of you would be interested in checking those out, here is the website [https://www.lefreakmedia.com](https://www.lefreakmedia.com/)\n\nand here is the instagram profile [https://www.instagram.com/lefreakmedia/](https://www.instagram.com/lefreakmedia/)\n\nSubmissions can be done in english and italian, but if you send me the write out in italian, mind that i will have to translate it so i will send it back to you in english so that you can double check it and make sure everything is on there.", "title": "I made a collective for creatives! :)", "num-comments": 1, "score": 1, "date": "2020-07-14 01:10:26", "content": "I made a collective for creatives! :) /!/ Hello!\n\nHere I am writing the first post on this wonderful community subreddit!\n\nI recently started a collective for creatives, and I thought this would be a great thing to share with any of you that would be interested in having their work featured somewhere and showcased online. I know it’s the submission process is quite frustrating for a lot of mediums, so I thought that creating a place where we can share and talk about our work without feeling the competition was a nice idea.\n\nThis is where Le Freak Media comes in, -----> I created !!!  a website where I’d love to showcase and let the artist talk about their work and their process behind it. I also made an IG account that goes with it, so if any of you would be interested in checking those out, here is the website [https://www.lefreakmedia.com](https://www.lefreakmedia.com/)\n\nand here is the instagram profile [https://www.instagram.com/lefreakmedia/](https://www.instagram.com/lefreakmedia/)\n\nSubmissions can be done in english and italian, but if you send me the write out in italian, mind that i will have to translate it so i will send it back to you in english so that you can double check it and make sure everything is on there."}, {"autor": "[deleted]", "selftext": "nan", "title": "Can I develop these?", "num-comments": 2, "score": 1, "date": "2021-06-19 21:09:24", "content": "Can -----> I develop !!!  these?"}, {"autor": "TSPF11", "selftext": "Hi,  \nGenuine question that is from someone purely curious (please go easy). How would one go about re-creating a photo with a similar quality as this? It's a strange question I know however my father is insistent that it is CGI however I believe it's just a heavily photoshopped photo. If it's the latter is anyone aware of any tutorials as we want a similar effect on something.\n\n[https://imgur.com/a/7RfcSy6](https://imgur.com/a/7RfcSy6)", "title": "How do I create photos similar to this? Or are they CGI?", "num-comments": 4, "score": 1, "date": "2021-06-26 13:06:44", "content": "How do -----> I create !!!  photos similar to this? Or are they CGI? /!/ Hi,  \nGenuine question that is from someone purely curious (please go easy). How would one go about re-creating a photo with a similar quality as this? It's a strange question I know however my father is insistent that it is CGI however I believe it's just a heavily photoshopped photo. If it's the latter is anyone aware of any tutorials as we want a similar effect on something.\n\n[https://imgur.com/a/7RfcSy6](https://imgur.com/a/7RfcSy6)"}, {"autor": "reebaarts", "selftext": "I've been searching for my aesthetic &amp; I've found I am really into capturing photos in black &amp; white that involves a lot of contrast. \n\nIt would help me a lot if this community can share thoughts on how do I improve day by day in this art. \n\nWork I should follow to improve mine &amp; techniques you've discovered that would level up my photography a little faster.\n\nThank you if you read this far, I hope for a response from this wonderful community!", "title": "Dark, classic &amp; high contrast black &amp; whites", "num-comments": 14, "score": 1, "date": "2021-09-20 07:17:34", "content": "Dark, classic &amp; high contrast black &amp; whites /!/ I've been searching for my aesthetic &amp; I've found I am really into capturing photos in black &amp; white that involves a lot of contrast. \n\nIt would help me a lot if this community can share thoughts on how do -----> I improve !!!  day by day in this art. \n\nWork I should follow to improve mine &amp; techniques you've discovered that would level up my photography a little faster.\n\nThank you if you read this far, I hope for a response from this wonderful community!"}, {"autor": "smallsushiroll", "selftext": "nan", "title": "First attempt at photography and photo editing, how'd it go? What can I improve on?", "num-comments": 2, "score": 1, "date": "2021-07-31 22:42:28", "content": "First attempt at photography and photo editing, how'd it go? What can -----> I improve !!!  on?"}, {"autor": "Discombobulated_Bus9", "selftext": "Hi,  \n I'm 16, about year and a half ago I got into the film photography and since then I almost completely ditched the digital. I develop b&amp;w films myself and eventually I want to to learn how to process colour films too.   \n \n\nI doubt that I'd be able to do any photography course any time soon so at the moment I am trying to learn everything myself. I don't have the favourite subject yet, but if I had to pick one, ballet and dance would be the one. I really enjoy doing  portraits, landscapes, architecture and street photography or the protests.    \n I am still very new to the photography and I still have plenty of stuff to learn. I actually wonder whether it is still possible to make a good living off film (analogue) photography?", "title": "[Serious] Is it possible to make living solely off film photography?", "num-comments": 82, "score": 1, "date": "2021-08-22 20:16:28", "content": "[Serious] Is it possible to make living solely off film photography? /!/ Hi,  \n I'm 16, about year and a half ago I got into the film photography and since then I almost completely ditched the digital. -----> I develop !!!  b&amp;w films myself and eventually I want to to learn how to process colour films too.   \n \n\nI doubt that I'd be able to do any photography course any time soon so at the moment I am trying to learn everything myself. I don't have the favourite subject yet, but if I had to pick one, ballet and dance would be the one. I really enjoy doing  portraits, landscapes, architecture and street photography or the protests.    \n I am still very new to the photography and I still have plenty of stuff to learn. I actually wonder whether it is still possible to make a good living off film (analogue) photography?"}], "name": "RedditPRON2"}