{"interestingcomments": [{"autor": "Stef63", "posts": "246 posts", "date": "11/07/2021 03:32  PM", "content": "1 hour ago, Yarosuav said: Ain't gonna happen. Don't know why you are so sure or on what this is based. It would however indeed be a surprise that Leica would add video back in the M. But look at the new Apple MacBook Pro's that were recently -----> introduced !!!  : they returned to the magsafe power adapter, hard function keys en God thanks a HDMI connecter and SD card slot. But Leica is Leica and they have already a very capable video body that accepts M lenses : the SL2 and SL2s. Let me therefor restate it this way .... it is unlikely but not impossible a future M will have video capabilities."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "09/22/2021 02:43  PM", "content": "The M is different; no other company still regularly produces rangefinder cameras. Part of the allure is the legacy and backward compatibility of virtually all M lenses ever produced. A unique customer base and marketing opportunity. The other Leica products -----> present !!!  different marketing challenges and opportunities. So, too, might a future M, if and when an EVF or hybrid VF comes to pass. Jeff"}, {"autor": "1234", "posts": "63 posts", "date": "10/17/2020 10:20  PM", "content": "Advertisement (gone after registration) I didn't have much luck with the search engine so pardon if already discussed. And not meaning to offend anyone on the forum... I received but sent back the next day a new M10-R in black chrome finish. This example was a disappointment after decades of use of all the M series film cameras from M3DS to MP followed by M8 and M240 of the digital series. Those performed well and looked nice too, evidencing a nice design, good machining, good finishing, and quality materials. I found the same thing with the Leitz microscopes, especially the black Ortholux. Though perhaps already discussed or deemed unimportant, what bothered me were for example the sharp corner and edges of the top plate, cheap looking hardware (buttons, wheels, locking mechanism, etc.), poor engraving, and finish that needed a good scrubbing in places to clean it up. Which begs the question, what economies were -----> introduced !!!  into the internals out of our sight? This camera was to last the rest of my life. Holding, fondling if you will, alternately the M240 with black paint finish and then the M10-R, even with closed eyes, produced an unexpected sadness. On the one hand, the touch screen, and an additional stop or two of dynamic range, and the extra pixels would all be handy though not imperative, and on the other, as an engineer the quality of materials and construction were at least as important. I have never seen an M9 or prior variants of the M10 so do not know if this is a sudden or gradual change over the last decade. Perhaps with the greatly expanded range of offerings, Leica cannot give the same attention to detail as was once customary. Asked the seller to send along a silver chrome version if they were notably better. I realize that my own value judgment is open to criticism but am curious about the generally perceived workmanship on the newer cameras these days."}, {"autor": "ironringer", "posts": "404 posts", "date": "10/30/2021 07:23  AM", "content": "Would the performance and quality of the M10 cameras, that currently satisfy and please their owners, change the slightest, when a new-improved model is -----> introduced !!! ? The answer is obvious = no. To quote someone strange and famous \"it is what it is.\" So, no need to sell what works well. ADDING another Leica, old or new, is of course a different decision 🙂. Currently I am happy with my Leica film cameras and an aging-gracefully M240. But there is always room for another Leica 😉."}, {"autor": "adan", "posts": "10,775 posts", "date": "11/03/2021 03:38  AM", "content": "21 hours ago, hirohhhh said: There's like 5% of the frame lost. Is this normal with all optical viewfinders, how important this is for you and how quickly did you get used to this? And is this same with all other focal lengths? I can't test is because I have only 28mm M lens. As to the 28 framelines - I don't use them. I use a dedicated accessory viewfinder like one of these. Which are not only more accurate, but produce a reduced-scale 28mm view that is easier to see all at once, and compose with at a glance (there are also equivalents that have been made from time to time by Cosina, Zeiss, Nikon, Canon, etc.: --img--  --img--  The field of view of the standard Leica .72x built-in optical finder has not changed significantly since it was -----> introduced !!!  in the M2 in 1958. Sized for 35mm lenses, with a little space outside. Leica just crammed in the 28 framelines with the 1981 M4-P and most of the cameras that followed - but did not change the actual size of the viewfinder tunnel. So it was pretty much a kludge. If one has eyes like a chameleon's, that can look up/down/left/right all at the same time ( ) and has the time, the built-in 28 lines kinda work. But they are stlil less accurate. I don't waste my time on that."}, {"autor": "jaapv", "posts": "66,415 posts", "date": "07/29/2021 12:38  AM", "content": "Whatever else, it is a very good lens (although very short for anything but tame wildlife) and used for Infrared it is spectacularly good. For an experiencenced M user a 135 4.0 should -----> present !!!  no difficulty at all focussing."}, {"autor": "MikeMyers", "posts": "1,192 posts", "date": "07/29/2021 03:05  AM", "content": "2 hours ago, jaapv said: Whatever else, it is a very good lens (although very short for anything but tame wildlife) and used for Infrared it is spectacularly good. For an experiencenced M user a 135 4.0 should -----> present !!!  no difficulty at all focussing. In the 1960's and 1970's, for a while, my film Leicas were my main cameras, and while you'd never call me \"experienced\", I got so used to using the M2 and M3 that I didn't need to think about the camera, only about what I was photographing. Now it's all topsy-turvy, as I've been using Nikon for so long the M camera felt so strange in my hands. After ten days of using nothing but the M10, I learned zone focusing, and how to get the camera to do just what I thought I wanted. But, and this is a big \"but\", even something as simple as getting a GOOD photo of a rabbit became impossible because I couldn't get close enough. So, I did the best I could, but it meant cropping a tiny part of the image to show what I wanted. It was a very good ten days for me, as every day I went walking around hunting for something to photograph, and every night was spent with PhotoMechanic to get the image onto my laptop, and PhotoLab3 to try to get the photo to look like what my brain \"saw\". Ain't no way I'm going to get a decent photo of an alligator if another one shows up in the drainage ditch in front of my brother's property, as I know how fast they can move, and I don't want to become alligator food. I didn't/don't want to spend multiple thousands of dollars on the latest Leica telephoto lens - spending a small fraction of that on a long Leica lens (which isn't technically a telephoto) sounded better. I also want to take photos of pelicans hunting for fish, and my 50mm photos had the same problem as with my rabbit. I want to fill the frame with what I'm photographing. Thank you for your reply - becoming an experienced M user is my goal, and that will never happen if I spend most of my time behind a Df or D750. --img-- "}, {"autor": "Artin", "posts": "1,649 posts", "date": "10/13/2021 02:57  AM", "content": "I had both M and the SL2 ... sorry to say but .. until you compare the SL2 images against the M10R. That is more apples to apples is the SL2 great system 100%. Yes ... is it more Versatile then the M 100% yes .... but will it ever sink the M system .. Never in my opinion Would I buy back into the SL yes I will once they bring an SL3 with state of the Art Autofocus ...-----> introduce !!!  some long telephoto Primes ... Nice Apo Macro’s then yes I am all in .. but luging around an SL2 with a 50 Lux ... compared to an M10R with a 50lux. The SL2 stays home."}, {"autor": "rsoby", "posts": "3 posts", "date": "08/13/2020 01:04  PM", "content": "Advertisement (gone after registration) Hello and thanks for having me in this forum!! I was planning to get my first Leica ever (Sony so far) by buying an M just when the new M10-R was -----> presented !!! . At this point I hesitate between the 10-P and the 10-R since the price difference is \"only\" 700€. 24MP is enough for what I shoot but can you please help me decide which one I should buy? Has the R any disadvantages except the bigger raw files? What are the pros and cons for or against the 2 models? What would you do if it'd be your first M? Thank you! Roby"}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "08/13/2020 09:31  PM", "content": "Sean Reid is doing a thorough review of the M10-R (and his vegetables, I assume). You might find some useful information there - https://www.reidreviews.com You do have to subscribe, and I do find much of his conclusions only vaguely useful; but worth a look for your question. Were it me, I’d buy the M10-R. I don’t need or even want more MP, but I think you’ll find that more MP just goes hand in hand with sensor development. Actually, I’d buy an M10-M, as for me photography is about -----> presenting !!!  a different perception of reality, rather than a faithful reproduction of what you see; and I find black & white more interesting and easier to control than colour. We await your next question about lenses with interest 😀 Edited August 13, 2020 by IkarusJohn"}, {"autor": "lucerne", "posts": "1,416 posts", "date": "01/20/2019 03:22  PM", "content": "Over the years, and many different camera bodies, I’ve rarely had problems. Indeed, i still have cf and sd cards from my early days. They still work, but their specifications are inadequate for current bodies. I only use sandisk xtreme now. I’m interested in the simplicity of the M10-D and the prospect of not carrying any laptop. Weight of kit is everything to me. I’m 71 . The M10 and the Fotos app has shown me the way. I love it. Now that I understand the range of possible operations i can consider switching to the M10-D . thanks for all the input. CORRECTION. I could only have used cards for 25 years. C-F cards -----> introduced !!!  around 1993. Edited January 20, 2019 by lucerne"}, {"autor": "Al Brown", "posts": "597 posts", "date": "08/02/2021 04:28  PM", "content": "Advertisement (gone after registration) On September 14th in 2006, Leica -----> introduced !!!  the first digital M camera, the Leica M8 featuring a 10.3 megapixel CCD image sensor. After 15 years, a new is M11 coming for all eager M photographers in love with latest technology available from Wetzlar. I would like to know which digital model from these fruitful 15 years has been your favorite and/or which digital M model (each had its quirks) you hated the most. Edited August 2 by Al Brown"}, {"autor": "adan", "posts": "10,775 posts", "date": "08/02/2021 07:43  PM", "content": "I didn't \"hate\" any of them. Whichever one I have at the time is my favorite. I was mildly frustrated by the M8s' crop and IR problems. I like the wide-angles I paid for to be wide-angles, and I definitely noticed subjects who were - STARTLED - by the hot-pink reflections from the IR-blocking filters. Especially large ones (90mm f/2 E55) - I nearly brought a band concert to a screeching halt when the singer did a double-take. The hot-pink filters did look a little like a tactical IR rifle scope, head-on. Nevertheless the M8 produced a couple of my most memorable (and top-selling) photographs, and a C/V 15mm (effective \"20mm\") saved my bacon at the wide end. And the cropping was useful in the studio. But I did switch to the 24x36 M9 the very first week it came out - pays to be good friends with your regional Leica rep. Finally - my 21mm f/2.8 was again a 21mm f/2.8. And the M9 did -----> introduce !!!  me to the 75 focal lengths, whose close-focusing restored some of the M8's tight framing. I skipped over the M(240) variants: not enough improvement over the M9 technically; too much red; too fat; and I still hoped the \"3rd-window natural frameline illumination\" might make a comeback. I calculated the M9 should hold up for at least a decade. Added a used M9M for the ISO 10000. Then, of course, the sensor-corrosion problem came up. Fortunately, in my case, not until late 2015, and only a mild case (one hair-like track on the M9; the M9M already had a replacement sensor). A sad reflection on Leica and/or Kodak, but not a serious problem in my photography. By late 2016, I was getting ready to send in the M9 for free sensor replacement - and then the M10 was pre-announced in Jan. 2017. I downloaded some of the sample pix from dpreview.com. Shazzam! Thinner - a serious usable-ISO increase (1600 > 10000) - new Leica profile with close-to-M9 color/punch - larger and more precise RF for my 135mm f/4 and 75 f/1.4. And - at the time - actually at a lower price than my M9 had been at introduction ($6500 vs. $6950). A no-brainer change. Kept the M9 as backup until the \"last call\" for free sensor replacements, got it fixed, traded it for a second M10. I still miss the classic third-window on the front, a little. But I've persuaded myself that my silver 2-window M10 is simply a look-alike resurrection of my first serious rangefinder camera in the 1970s - a Canon P. --img--  Edited August 2 by adan"}, {"autor": "pippy", "posts": "3,169 posts", "date": "08/15/2021 09:03  AM", "content": "12 hours ago, Datsch said: Re: Black Paint/ Silver Chrome / Black Chrome I think I should have worded that as which one would you have -- rather than all three, as it's unlikely to be offered in 3 variants ...? Whilst it's unreasonable to expect all three finishes you mention I can't see why Leica wouldn't offer the camera in at least two of the above as they have done so for most Digi-M cameras through the years. Both Black Lacquer (Paint) and Silver-Chrome came as standard-finish versions on the likes of the M8.2 / M9-P and there were some S-Chrome M Monochromes made etc. In addition they have also used finishes such as Steel-Grey, Anthracite and Black-Chrome on regular production models. My guess is that initially there will be Black-Chrome and Silver-Chrome with Black-Paint being -----> introduced !!!  for a considerably more expensive version such as we've seen recently with the M10-R B-P. Philip."}, {"autor": "Tailwagger", "posts": "2,110 posts", "date": "08/23/2021 04:01  PM", "content": "1 hour ago, charles tay said: M10-R latest model at 13k SGD …. I would expect the latest M11 maybe retail at 13K or maybe more due to pandemic supply chain issues. 13-14K SGD my estimates. By my reckoning a bit north of current US prices. The 10-R today is officially $8995 USD. You just never can tell with Leica. It's quite possible that the choice of new sensor and processor, presumably Sony, was as much to reduce cost as anything else. Don't exactly recall precisely, but when the M10 was -----> introduced !!! , prices were cut by something like 15-20% over the 240. My guess, the M11 could be anything from $7595 to $9995. Don't know, but my hope is they are striving to tamp things down to a more reasonable level, at least to start. An M used to be expensive, but now it's stupid, stupid, stupid expensive."}, {"autor": "derleicaman", "posts": "666 posts", "date": "06/11/2021 01:01  AM", "content": "6 hours ago, IkarusJohn said: Welcome to the forum. Leica has always provided add-ons to the M system - the original Visoflex even had its own lenses. The electronic EVF is very useful when you need accurate framing (40 Summicron), for longer lenses (90mm and beyond), for lenses with no focusing flange (Zeiss 15/2.8 Distagon), adapted R lenses and for those with focus shift (35 Summilux ASPH). Also, for those whose eyesight is failing, having focus magnification is a Godsend. Interestingly, focus peaking, while a great idea, is rubbish for accuracy. I’ve also found for wide angle lenses, and many others, the optical viewfinder is very accurate. But the EVF does have its uses (particularly for the M10-D). Not sure I will need to buy the new one, and I doubt it will work with existing cameras without overwhelming the processor and draining the battery - but what do I know … I agree with you 100% on the current Visoflex. When the M240 was -----> introduced !!!  with its EVF, I joked with Stefan Daniel that this was finally the \"R Solution\", after the demise of the R series. This was long before the SL was on the stage, so in a way it was the \"R Solution\". When I got my M10, I soon got the Visoflex 020. I used it primarily for table top photography or when I needed to focus and compose an R lens or Nikon lens such as my 28PC Nikkor. On my Med Cruise in 2018, I started using it with my WATE to accurately frame building interiors and exteriors. Cathedrals, etc. By the second day, I had come up with a new SOP (Standard Operating Procedure). I would focus with the OVF, and then activate Live View on the rear screen and frame the shot with it. Cut down on worrying about damaging the Visoflex (I had lost the little case for it on our second day, somewhere in Monaco). When you are with people who are not serious photographers, even though they were all friends plus my wife, you need to have an efficient run and gun technique. This worked out quite well! I agree that focus peaking is a great idea, but in reality it gets in the way of focusing accurately. Edited June 11 by derleicaman"}, {"autor": "farnz", "posts": "25,167 posts", "date": "03/13/2021 10:51  AM", "content": "Welcome to the forum, eddy! Does burning through one or two batteries a day -----> present !!!  a problem or is it, to you, more about comparison with the behaviour of other brands? Pete."}, {"autor": "LUF Admin", "posts": "5,033 posts", "date": "06/25/2021 08:54  AM", "content": "Advertisement (gone after registration) --img--  It is available immediately at a price of $9,295. --img--  --img--  --img--  Exclusive design variant: the Leica M10-R is now also available with a black paint finish. Leica Camera AG -----> introduces !!!  a new design variant of the Leica M10-R.With its black paint finish, the new Leica M10-R perfectly embodies the classic Leica look: over the years, glimpses of brass will gradually start to show on the corners and edges – resulting in a unique patina that emphasises the camera’s individual character. This is a camera that not only captures moments in time, but also tells a story of its own. The new addition to the M family is a prime example of Leica’s unerring commitment to quality and craftsmanship made in Germany. In addition to the high-gloss finish, there are some external details that distinguish the new design variant from its serially produced counterpart (though the technical specifications are identical in both models). These differences include the classic Leica lettering on the top plate, along with an ‘Ernst Leitz Wetzlar Germany’ engraving. Also, the red Leica dot has been omitted, creating an understated appearance that facilitates an especially unobtrusive approach. As with all Leica M cameras, the new variant is equipped with an ultra-quiet shutter, allowing the photographer to capture scenes at close proximity without drawing undue attention. Perfectionism down to the last detail is one of the hallmarks of this unusual system camera: the ISO and shutter speed dial both feature classic diamond-pattern knurling, while the shutter button is distinguished by a silver-chrome finish. The Leica M10-R delivers an exceedingly high image quality: with a resolution of over 40 megapixels, the sensor recognises even the smallest details. This allows the camera to utilise the full potential of Leica's legendary M lenses. Reliability over many years of use, combined with high value retention, count among the distinguishing traits of this exceptional camera. They are also a testament to the consistent implementation of Leica’s company philosophy. Throughout the decades of its extraordinary history, Leica has placed a focus on sustainability. For example, by developing the Leica M bayonet back in the 1950s, the company created a timeless lens mount standard; as a result, even vintage lenses from the era of analogue photography can still be used on the new black-paint Leica M10-R today. As ever, Leica’s optical instruments prove to be steadfast companions that are characterised by exceptional quality and longevity."}, {"autor": "Steven", "posts": "3,750 posts", "date": "06/28/2021 02:07  PM", "content": "On 6/25/2021 at 10:54 AM, LUF Admin said: --img-- The Leica M10-R now also available in black painted version! It is available immediately at a price of $9,295. --img--  --img--  --img--  Exclusive design variant: the Leica M10-R is now also available with a black paint finish. Leica Camera AG -----> introduces !!!  a new design variant of the Leica M10-R.With its black paint finish, the new Leica M10-R perfectly embodies the classic Leica look: over the years, glimpses of brass will gradually start to show on the corners and edges – resulting in a unique patina that emphasises the camera’s individual character. This is a camera that not only captures moments in time, but also tells a story of its own. The new addition to the M family is a prime example of Leica’s unerring commitment to quality and craftsmanship made in Germany. In addition to the high-gloss finish, there are some external details that distinguish the new design variant from its serially produced counterpart (though the technical specifications are identical in both models). These differences include the classic Leica lettering on the top plate, along with an ‘Ernst Leitz Wetzlar Germany’ engraving. Also, the red Leica dot has been omitted, creating an understated appearance that facilitates an especially unobtrusive approach. As with all Leica M cameras, the new variant is equipped with an ultra-quiet shutter, allowing the photographer to capture scenes at close proximity without drawing undue attention. Perfectionism down to the last detail is one of the hallmarks of this unusual system camera: the ISO and shutter speed dial both feature classic diamond-pattern knurling, while the shutter button is distinguished by a silver-chrome finish. The Leica M10-R delivers an exceedingly high image quality: with a resolution of over 40 megapixels, the sensor recognises even the smallest details. This allows the camera to utilise the full potential of Leica's legendary M lenses. Reliability over many years of use, combined with high value retention, count among the distinguishing traits of this exceptional camera. They are also a testament to the consistent implementation of Leica’s company philosophy. Throughout the decades of its extraordinary history, Leica has placed a focus on sustainability. For example, by developing the Leica M bayonet back in the 1950s, the company created a timeless lens mount standard; as a result, even vintage lenses from the era of analogue photography can still be used on the new black-paint Leica M10-R today. As ever, Leica’s optical instruments prove to be steadfast companions that are characterised by exceptional quality and longevity. Interesting that it is mentionned nowhere that this camera is an edition limited to 2000 copies only."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "05/26/2021 01:00  PM", "content": "Usual sloppy reporting from Leica Rumors. While they call the BP SCL7 a new camera, a quick cut and paste of the full text of the Nokishita sourced Japanese shows that this is a battery. (The BP SCL5 is the M10 battery.) A camera might well follow, but that’s not how Rumors -----> presented !!!  it... more interested in clicks than facts. Jeff"}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "05/25/2019 10:44  PM", "content": "2 hours ago, james.liam said: The camera can’t be more than 2 years old. What sort of CLA would you imagine it could possibly need? I imagine they’ll make sure the shutter speeds are correct and the RF calibrated. Few would be - the M10 was only -----> introduced !!!  in January 2017 ..."}, {"autor": "Leon_B.", "posts": "959 posts", "date": "01/21/2021 03:22  PM", "content": "Advertisement (gone after registration) --img-- /applications/core/interface/js/spacer.png\"> With the Leica M10-P \"Reporter\" the german camera manufacturer wants to honor the hard work of reportage photographers. The camera housing has a particularly scratch-resistant dark green finish and is covered with Kevlar fabric - the synthetic fiber that is also used to produce ballistic protective clothing. The M10-P “Reporter” is available at specialist retailers and only 450 units will be available worldwide. Leica M10-P “Reporter”: A homage to the great reportage photographers of our time Wetzlar, January 21, 2021. As part of the celebrations marking the 40th anniversary of the Leica Oskar Barnack Award, Leica Camera AG -----> presents !!!  a special design variant of the Leica M10-P: the M10-P “Reporter” is an uncompromising reportage camera, suitable for even the most challenging conditions. Many Leica cameras throughout the company’s history have been developed with the needs of press and reportage photographers in mind. This is illustrated by exceptional models such as the Leica 250 of 1933, whose film cassette accommodated 250 exposures, or the Leica MP of 1956 – a Leica M3 variant which was equipped with the Leicavit rapid winder, following the suggestions of renowned photographers Alfred Eisenstaedt (1898– 1995) and David Douglas Duncan (1916–2018). With its dark green, particularly scratch-resistant finish and Kevlar camera trim, the Leica M10- P “Reporter” brings to mind the extremely challenging conditions under which many of the most remarkable reportages of our time were created. Kevlar is a synthetic fibre frequently used in the production of ballistic protective clothing. Through exposure to natural UV rays, the camera’s body armour will gradually turn the same colour as its top and base plate. The armour’s diamond-weave texture makes the Leica M10-P “Reporter” especially grippy and comfortable to hold. All of the camera’s engravings are inlaid in light green, resulting in a more discreet effect than the white inlays customarily used on black-finish cameras. In terms of its technical specifications, the M10-P “Reporter” is identical to the serially produced Leica M10- P. The Leica M10-P “Reporter” is available at specialist retailers. A total of 450 units of the Leica M10-P “Reporter” will be available worldwide. --img-- "}, {"autor": "adan", "posts": "10,775 posts", "date": "01/04/2020 06:02  PM", "content": "10 hours ago, Travis Hill said: is it supposed to stay in or out? It should stay OUT (the roller almost sticking out of the camera front), under pressure from an internal camera spring. The spring is what forces the roller to maintain contact with the lens' moving focus cam. In theory, that spring itself can fail - but gummed-up lubricants in the mechanism are far, far more likely to cause a jam or sticking than a broken spring. ****Uh-oh!**** In examining my own M10 to confirm exactly how the lever works - I just noticed that the tip of the RF arm is catching or rubbing intermittently on the lens mount ring as the spring forces it forward. The screw and brass washer on the top of the roller-cam axle (above the arm itself) just barely clear the mount even when normal, but mine has/had even less clearance. --img--  Mostly it is just a brief contact that the spring overrides, but a couple of times it stuck hard for a moment (this would also cause the RF image to stop moving part-way through the normal range). I cleared this problem by applying a little downward pressure on the arm with a tiny screw-driver tip - but I don't recommend that as a procedure. There comes a point where uninformed or sloppy DIY work on the Leica RF just becomes a can of tangled worms that only Leica can untangle. I just happen to be a lucky risk-taker. Like the gospel song says, \"The fingerbone's connected to the - handbone; the handbone's connected to the - wristbone; the wristbone's connected to the - arm bone.....\" This is a word of warning for those of us who have tried to adjust our own RF for infinity focus - be really careful not to apply ANY upward pressure on the roller and arm when inserting or turning the 2mm hex (Allen) wrench!! You can bend or -----> introduce !!!  enough play in the arm's vertical location to cause such sticking. No doubt I made this mistake at some point. Edited January 4, 2020 by adan"}, {"autor": "wlaidlaw", "posts": "17,794 posts", "date": "12/15/2020 10:30  AM", "content": "Advertisement (gone after registration) Am I correct in thinking that Leica have not carried forward the excellent feature -----> introduced !!!  with the M240, to be able to choose framelines colour, to the various versions of the M10. I have had a search through the menus both on my M10-R and in the manual but can find no reference to frameline colours. If I am correct that Leica have not carried this forward, I think that is a pity. My eyesight finds the framelines in red, are much easier to see. Wilson"}, {"autor": "jscottyk", "posts": "50 posts", "date": "03/11/2021 03:16  PM", "content": "Thanks for posting this. I ran into this problem over the last 48 hours with a new to me (ie pre-owned) M10-P and a couple Sony Tough 64GB (SF-G64T) that were just purchased in January. Also worth noting, the problem -----> presents !!!  like the main board issues reported in a couple threads here."}, {"autor": "jscottyk", "posts": "50 posts", "date": "03/25/2021 06:39  PM", "content": "On 3/11/2021 at 9:16 AM, jscottyk said: Thanks for posting this. I ran into this problem over the last 48 hours with a new to me (ie pre-owned) M10-P and a couple Sony Tough 64GB (SF-G64T) that were just purchased in January. Also worth noting, the problem -----> presents !!!  like the main board issues reported in a couple threads here. Follow up on this. I had my two cards replaced under the above mentioned Sony recall. They arrived yesterday and I just tested. Still not good. With both cards, the initial format took a L-O-N-G time. With one card, the camera would not shoot at all. A second format allowed it to at least shoot, but then the blinking red light. With the second card, it shot on the first try, but then hung. So for me, I'll consider the Sony Tough 64GB (SF-G64T) not compatible with the M10-P. YMMV"}, {"autor": "farnz", "posts": "25,167 posts", "date": "04/05/2021 11:58  PM", "content": "10 hours ago, CptSlevin said: Any chance that there are people who used it? I used a 0.85 E-clypse de-magnifier with the E-clypse eye-cup for a while and it did it's job in making wider frame lines a bit more visible. It didn't -----> introduce !!!  distortion that I noticed and didn't appreciably reduce the viewfinder's contrast so it worked. I used the Eye-cup to remove lateral light rays, which moved my eye further from the viewfinder and the 0.85 de-magnifier to see 'wider'. I'm primarily a 50 mm shooter so in the end I stopped bothering with the de-mag and the Eye-cup. Pete."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "09/05/2020 01:05  PM", "content": "5 minutes ago, gettons said: Thing is, the vast majority of my shooting happens within the streets, which is why I am leaning towards the P as it is much quiter at close distance. You think the minor difference in sound, above the street noise and commotion, is what’s going to defeat your shooting discreetly when you’re already standing close to your subject? I barely hear anything myself with an M10. If you can, I think you should demo or rent these options to determine what’s real and what’s imagined. I’ve shot film M’s since the 80’s, and digital M’s (M8.2, M Monochrom, M 240 and M10) since ‘09, and none have -----> presented !!!  problems on the street. And the M10 is the quietest of the digital bunch. Jeff"}, {"autor": "Tailwagger", "posts": "2,110 posts", "date": "03/15/2021 11:31  AM", "content": "Like everything else Leica, the cost borders on outrageous, but the deeper issue, IMO, is the value. AFAIC, the 10-R has dropped $$$ per shot ratio to unacceptable levels when used with the EVF. In typical shooting with two batteries, $390, I see around 300-350 shots, even when exercising maximum care with LV... no LCD use, 1 minute auto shutdown and turning the camera off when it hits the bag. In the grand scheme of things, paying two and half times the cost of a A7r3 battery over the anticipated 3-4 years of use, is no big deal, but getting a third of the shot count on top of it, is somewhat infuriating. It would be nice, given the design is now 4+ years old, if similar to HB, they -----> introduced !!!  a higher capacity version. Edited March 15 by Tailwagger"}, {"autor": "Tailwagger", "posts": "2,110 posts", "date": "03/04/2021 03:44  PM", "content": "On 3/2/2021 at 3:32 PM, Fedro said: ...was wondering if - in case it is confirmed - the new 35 APO M heralds a new era of... EVF M cameras? I certainly wouldn't take it on its own as such. More encouraging to me on that front is the stream of M lens introductions while 2/3rds of the promised SL Summicrons continue in the shadows with nary a peep of a new roadmap for that system. Perhaps all the energy put into this lens, the new Noctis, retro editions, etc -----> introduced !!!  over the last couple of years is indeed evidence of an EVF M on the horizon. Regardless, I'm not holding my breadth. What I do know for certain is that while I remain committed... up to a point... to buying a new M every three or four years, at the current price levels I'm no longer able to justify the cost of a second body. A Q-style M mount camera at a Q-sized price is about the only thing that might alter that."}, {"autor": "astrostl", "posts": "510 posts", "date": "03/02/2021 02:46  AM", "content": "28 vs 35 (vs 50) is a personal decision. No right or wrong answer, and your own answer can change or multiply over the years. Assuming that you want to stay around the budget of those lenses and also stay smaller and lighter, I'd suggest starting with a Leica Elmarit 28/2.8. From there you can wait until later this month to select from a bunch of Voigtlander 35s: the 35/1.2 III (fast), the imminent 35/2 Ultron Type II (compact), or the imminent 35/2 APO-LANTHAR (ultimate). That would get you going immediately, give you a compact all-Leica 28 experience, and -----> introduce !!!  you to Voigtlander and 35s. BOTH options for LESS than a Summicron!"}, {"autor": "colonel", "posts": "4,402 posts", "date": "02/23/2021 11:10  PM", "content": "Advertisement (gone after registration) Ok, its taken 4 years to upgrade, but I fly at Leica speed without gas (ahem) --img--  This isn't a review, there are zillions of them, its just a ramble through this lovely camera as I have too much time inside at the moment I thought that I didn't need to upgrade from my MP-240, a long line of 240s, M9s, and M8s. Although Leica purists complain about the size, its still a very small FF camera, and better to hold my silly 0.95 and 1.2 lenses on. Well taking the M10 out of the box is an experience, I thought they had sent me an M6 by mistake. It seems tiny compared to the 240, although in truth it isn't, only a few mm thinner, however it seems to exude a compact presence somehow. Some folk dislike using the word jewellery about a piece of photographic equipment, but come on guys Chocolates - Natural colours with a hint of Kodachrome under light stress --img--  It feels wonderful of course and everything has been refined. The 240 series -----> introduced !!!  the bullet proof digital rangefinder. I had many M9s and often them arrived out of alignment, some had corroded sensor glass and all were picky with SD cards, but never never had any issue on any 240. I don't know what they did to the RF, but it was more then a drop of acetate, an evolution in the right direction. Love for sale - 3200 has little noise but nicely filmic --img--  The M10 adds to the 240 a further sense of refinement across pretty much everything. The buttons seems slightly more sturdy, the screen's higher resolution and image window closer to the edge and the 0.73 OVF magnification is great. I can take or leave the ISO dial and the shutter is shorter, but not quieter (I think). I like a shutter noise but a quiet mode is great for the P folk, whether leaf or electronic. The sensor definitely top and tails with more dynamic range and I like the 2 stop of noise improvement. ISO 3200 is wonderfully organic and has very little noise considering. OK, pointless picture, but I love sunstars --img--  It it worth 65% more then a M240 ? As a good value base (especially taking into account resale values), a used 240 takes some beating. Its a wonderful camera and the M10 on its own is not going to take better pictures, and yes, it could be the price of a few lenses. Getting to the meat of things --img--  IMHO if you have the money do it. What price edging closer to perfection ?"}, {"autor": "petermullett", "posts": "837 posts", "date": "03/08/2021 03:46  PM", "content": "On 2/24/2021 at 12:10 AM, colonel said: Ok, its taken 4 years to upgrade, but I fly at Leica speed without gas (ahem) --img--  This isn't a review, there are zillions of them, its just a ramble through this lovely camera as I have too much time inside at the moment I thought that I didn't need to upgrade from my MP-240, a long line of 240s, M9s, and M8s. Although Leica purists complain about the size, its still a very small FF camera, and better to hold my silly 0.95 and 1.2 lenses on. Well taking the M10 out of the box is an experience, I thought they had sent me an M6 by mistake. It seems tiny compared to the 240, although in truth it isn't, only a few mm thinner, however it seems to exude a compact presence somehow. Some folk dislike using the word jewellery about a piece of photographic equipment, but come on guys Chocolates - Natural colours with a hint of Kodachrome under light stress --img--  It feels wonderful of course and everything has been refined. The 240 series -----> introduced !!!  the bullet proof digital rangefinder. I had many M9s and often them arrived out of alignment, some had corroded sensor glass and all were picky with SD cards, but never never had any issue on any 240. I don't know what they did to the RF, but it was more then a drop of acetate, an evolution in the right direction. Love for sale - 3200 has little noise but nicely filmic --img--  The M10 adds to the 240 a further sense of refinement across pretty much everything. The buttons seems slightly more sturdy, the screen's higher resolution and image window closer to the edge and the 0.73 OVF magnification is great. I can take or leave the ISO dial and the shutter is shorter, but not quieter (I think). I like a shutter noise but a quiet mode is great for the P folk, whether leaf or electronic. The sensor definitely top and tails with more dynamic range and I like the 2 stop of noise improvement. ISO 3200 is wonderfully organic and has very little noise considering. OK, pointless picture, but I love sunstars --img--  It it worth 65% more then a M240 ? As a good value base (especially taking into account resale values), a used 240 takes some beating. Its a wonderful camera and the M10 on its own is not going to take better pictures, and yes, it could be the price of a few lenses. Getting to the meat of things --img--  IMHO if you have the money do it. What price edging closer to perfection ? Colonel. is this still Mill Hill Broadway?"}, {"autor": "LUF Admin", "posts": "5,033 posts", "date": "01/29/2021 09:42  AM", "content": "Advertisement (gone after registration) Leica Camera has -----> introduced !!!  new firmware versions for several cameras from the M10 family. Leica M10-P (M10-P-3.21.3.50-CUSTOMER Download Firmware) Leica M10-R (M10-R-20.20.47.37 Download Firmware) Leica M10 Monochrome (M10-M-3.21.2.50-CUSTOMER Download Firmware) The most important innovation is the option to correct perspective distortions in the camera. New firmware for the Leica M10-P, M10-R, and M10 Monochrom Using computational imaging to correct perspective distortion Wetzlar, January 29, 2021. The new firmware update for the camera models Leica M10-P, M10-R and M10 Monochrom introduces an exciting feature: the Leica Perspective Control function, abbreviated as LPC. Having installed the update, owners of the above-listed cameras are able to activate the Perspective Control function – which uses the camera’s integrated orientation sensors to recognise whether it is being held in a straight position, or tilted upwards or downwards. On the basis of this information, the function uses computational imaging to automatically correct receding lines – a common phenomenon that is especially bothersome in architectural photography. The term ‘computational imaging’ refers to the process of forming images with the aid of in-camera algorithms. An auxiliary frame in the camera’s display shows how the image will be cropped in order to correct the perspective distortion. In the case of images recorded in DNG format, the raw data is stored unchanged while the corrections calculated by Perspective Control are written to the metadata. They are then applied automatically in Adobe Lightroom or Adobe Photoshop, or can optionally be discarded. For JPEG format images the correction occurs directly in the camera, and only the corrected image is stored. In comparison to the manual distortion correction that is available as an alternative, Leica Perspective Control offers several advantages. Due to its automated nature, it is faster than the manual process. The ability to bring up an auxiliary frame of the corrected image prior to recording, as well as view corrected JPEG images immediately after they were captured, makes it significantly easier to determine the correct framing and most suitable lens. In addition, given that the corrections are based on the data collected by the camera’s orientation sensors (as opposed to the visible details of the captured image) it is also possible to rectify images that do not contain any straight lines. To begin with, the new Leica Perspective Control function will be available for the camera models Leica M10-P, M10-R and M10 Monochrom. The firmware update containing this new feature can be downloaded free of charge at www.leica-camera.com, and installed by following the instructions provided."}, {"autor": "LUF Admin", "posts": "5,033 posts", "date": "01/29/2021 09:42  AM", "content": "Advertisement (gone after registration) Leica Camera has introduced new firmware versions for several cameras from the M10 family. Leica M10-P (M10-P-3.21.3.50-CUSTOMER Download Firmware) Leica M10-R (M10-R-20.20.47.37 Download Firmware) Leica M10 Monochrome (M10-M-3.21.2.50-CUSTOMER Download Firmware) The most important innovation is the option to correct perspective distortions in the camera. New firmware for the Leica M10-P, M10-R, and M10 Monochrom Using computational imaging to correct perspective distortion Wetzlar, January 29, 2021. The new firmware update for the camera models Leica M10-P, M10-R and M10 Monochrom -----> introduces !!!  an exciting feature: the Leica Perspective Control function, abbreviated as LPC. Having installed the update, owners of the above-listed cameras are able to activate the Perspective Control function – which uses the camera’s integrated orientation sensors to recognise whether it is being held in a straight position, or tilted upwards or downwards. On the basis of this information, the function uses computational imaging to automatically correct receding lines – a common phenomenon that is especially bothersome in architectural photography. The term ‘computational imaging’ refers to the process of forming images with the aid of in-camera algorithms. An auxiliary frame in the camera’s display shows how the image will be cropped in order to correct the perspective distortion. In the case of images recorded in DNG format, the raw data is stored unchanged while the corrections calculated by Perspective Control are written to the metadata. They are then applied automatically in Adobe Lightroom or Adobe Photoshop, or can optionally be discarded. For JPEG format images the correction occurs directly in the camera, and only the corrected image is stored. In comparison to the manual distortion correction that is available as an alternative, Leica Perspective Control offers several advantages. Due to its automated nature, it is faster than the manual process. The ability to bring up an auxiliary frame of the corrected image prior to recording, as well as view corrected JPEG images immediately after they were captured, makes it significantly easier to determine the correct framing and most suitable lens. In addition, given that the corrections are based on the data collected by the camera’s orientation sensors (as opposed to the visible details of the captured image) it is also possible to rectify images that do not contain any straight lines. To begin with, the new Leica Perspective Control function will be available for the camera models Leica M10-P, M10-R and M10 Monochrom. The firmware update containing this new feature can be downloaded free of charge at www.leica-camera.com, and installed by following the instructions provided."}, {"autor": "IMAGEPOWER", "posts": "25 posts", "date": "02/11/2021 06:22  PM", "content": "Am 8.2.2021 um 05:02 schrieb MikeMyers: Considering that I have drawers full of Nikon \"F-mount\" lenses, and that I might want to use some of them on my M10. Supposedly the best adapter available is the Novaflex. I've also got a Nikon 50mm f/1.2 lens, but I think I read it doesn't work with this adapter for some reason. Probably not a big loss, as Ken Rockwell though it was a terrible lens. Any thoughts or advice? I know it's expensive, but last time I was searching, people told me it's \"the best\". I do work with both a Novoflex and a FotodioX adapter on a M10-R, M10-M and M10-P \"Reporter\" As for the Novoflex adapter, it is very precise, but also pretty \"stiff\". There seems to be absolutely no play between the Nikkor lens and the adapter. This is supposed to make sure that focusing remains very precise, especially with wide open glass such as the Nikkor Ai-S 50/1.2. Focusing on a RF can be utmost critical as we all know. The drawback: sometimes it es very difficult to dismount the lens from the adapter. On the other side, I can also use Nikon G lenses such as the 58/1.4G with that adapter on my M10 body, a lens that is unrivalled for its transition into soft background (\"bokeh\") I also use a FotodioX adapter, mainly for my Carl Zeiss lenses ZF.2 15/2.8 and ZF.2 135/2 (normally used on my Nikon D850). Here it is easy to mount and dismount the lens, but the link/connection is not as stiff as with the Novoflex and I am not sure, whether in critical focus situations (mainly the 135/2 wide open) I get maximum focus accuracy. For G lenses you will have to use an different FotodioX adapter. As for Ken Rockwell's opinion about lenses, I am very careful to say at least. He keeps writing his \"reviews\" long before the lenses are available. As a pro Nikon shooter I usually get the newest lens first before anyone else has a chance to get hold of it. And Ken writes \"tests\" even when lenses are officially delayed... I do love the Nikon Ai-S 50/1.2 for its nice bokeh wide open. Actually it has an equally convincing \"analog\" look as the recently re------> introduced !!!  Leica Noctilux 1.2/50mm. From f/2 onwards, the Nikkor is one of the sharpest Nikon lenses ( I own 20+ AF-S lenses and 5 Ai-S lenses, and comparing the Ai-S 50/1.2 to lenses like the PC 85/2.8, AF-S 105/1.4, AF-S 28/1.4 and the latest AF-S 120-300/2.8 amongst others drew me to that conclusion.) That's why I enjoy using this lens on the Nikon D850 or Df and on the M10-X, especially wide open, for the film look. I also love the Canon FD 1.2/55 S.S.C. Aspherical on the M10, but this is really a chunky piece of glass... FYI I own original M lenses such as the SEM 21, the FLE 35/1.4, the APO 75/2 and just recently added the 28/1.4, so I can compare my Nikon gear to Leica gear. Apart from the 50/1.2 I use Carl Zeiss lenses on the adaptors, mainly 15/2.8, 25/2 and 135/2. Hope, this was of any help to make your decision. Michael http://www.imagepower.de The photos display the M10-R with the Nikkor 1.2/50mm and the Nikon Df --img--  --img--  Edited February 11 by IMAGEPOWER typo"}, {"autor": "augustwest100", "posts": "128 posts", "date": "02/04/2021 07:48  PM", "content": "You guys are the best! I really do appreciate the responses, even though I know there really is \"no answer.\" LBJ2 is appealing to the part of my brain saying \"Use the Sony when you want speed and accuracy and versatility\" and pick up an M for those times you want to slow things down and enjoy the use of the Rangefinder. It sounds like a great idea if I can get my arms around the added cost. On the other hand Alistairm is getting to that part in my brain that says \"sell the A9 and use the SL2 with the added bonus of having the M lens choices for when I want to keep it lighter.\" In that case, I would be ok until I decided to get an SL lens. This -----> introduces !!!  a new variable: Money! Sounds like switching to the SL2 would be the easier to do now, because I have some good Sony glass to trade in, but then later, if I start drooling over an SL lens, it will start to cost me. On the other hand, I can stick with the Sony and equipment I have, and put new money towards an M body, but that would set me up for a while with two systems. I suppose all being equal I would rather one single camera body just for the sake of keeping things simple. Any strong feelings between the SL2 versus the SL2S in this scenario?"}, {"autor": "LBJ2", "posts": "640 posts", "date": "02/04/2021 09:02  PM", "content": "55 minutes ago, augustwest100 said: You guys are the best! I really do appreciate the responses, even though I know there really is \"no answer.\" LBJ2 is appealing to the part of my brain saying \"Use the Sony when you want speed and accuracy and versatility\" and pick up an M for those times you want to slow things down and enjoy the use of the Rangefinder. It sounds like a great idea if I can get my arms around the added cost. On the other hand Alistairm is getting to that part in my brain that says \"sell the A9 and use the SL2 with the added bonus of having the M lens choices for when I want to keep it lighter.\" In that case, I would be ok until I decided to get an SL lens. This -----> introduces !!!  a new variable: Money! Sounds like switching to the SL2 would be the easier to do now, because I have some good Sony glass to trade in, but then later, if I start drooling over an SL lens, it will start to cost me. On the other hand, I can stick with the Sony and equipment I have, and put new money towards an M body, but that would set me up for a while with two systems. I suppose all being equal I would rather one single camera body just for the sake of keeping things simple. Any strong feelings between the SL2 versus the SL2S in this scenario? One of the reasons I mentioned SL2-S for your scenario is because as you are already used to very fast processing and AF with the A9 @ 24MPs, you might feel more comfortable the SL2-S than the slightly slower processing and AF of the SL2. OTOH, the SL2 is due the new AF update soon. For me personally the ideal situation is shooting both Leica M and Sony ( two very different system approaches at the top of their game IMO) and every once in a while adapting my M lenses to the 61MP Sony, just because I can! Ha Ha. P.S. Don't forget about Zone Focusing with the Leica M--it can be just as fast if not faster than any AF technology."}, {"autor": "KFo", "posts": "204 posts", "date": "01/30/2020 09:59  PM", "content": "9 hours ago, M10 for me said: Let me just reopen this thread. Today I had my Canon A-1 (with a 50mm lens) from the late 70ies in my hands and I realize how well all buttons and wheels are built. The focusing ring goes smooth whereas the aperture ring is quite stiff and there is no way that you can change the settings accidentally. Even the exposure compensation wheel is secured by a little button on top. Only the focus ring can be turned unintentionally which is no problem as I have to use it anyway for each shot (when not using zone focussing). With my M10 its different: The exposure rings of the lenses change their position very often unintentionally. So does the exposure compensation when the back wheel is activated for that function. As a consequence I set the back wheel to off (normally I take photographs with the OVF only). But when I want to make an exposure change (I rarely do that though) then this still works (without using the menu) by pressing this famous front-button (called focus-button) and at the same time turning the back wheel. Try it out. It is possible but very uncomfortable as its hardly not possible with one hand (you have to press that button AND turn the wheel simultaneously !!). So I understand some dissatisfaction. For users working frequently with LV or use an OVF that button is probably helpful. Wait a minute! One of the very few gripes I have about my M is that at times the Exp Comp dial gets twiddled. It does this because of a defect in my operational manner; I never turn the camera off, I always let it go to sleep and rewake it by tapping the shuttle release. As such this -----> presents !!!  the opportunity to accidentally change exp comp when I drop the camera back to my side. This takes care of that! Thanks for posting as I didn’t realize (should RTFM sometime) that you could do that. Back to trying to have my cake and eating it too."}, {"autor": "lucerne", "posts": "1,416 posts", "date": "11/11/2020 11:26  PM", "content": "I find it more confusing than beneficial and tend not to use the feature. The frames are -----> presented !!!  in pairs. Leica removed the lever on one M model a few years ago, but users complained of being short-changed so it was re-introduced."}, {"autor": "lucerne", "posts": "1,416 posts", "date": "11/11/2020 11:26  PM", "content": "I find it more confusing than beneficial and tend not to use the feature. The frames are presented in pairs. Leica removed the lever on one M model a few years ago, but users complained of being short-changed so it was re------> introduced !!! ."}, {"autor": "paulsydaus", "posts": "729 posts", "date": "07/21/2020 07:01  AM", "content": "Advertisement (gone after registration) 9 hours ago, onasj said: Finding #2: Scaled to the same image size, the M10-R offers less-pronounced background noise than the M10-P at the same high ISO level (~12500+). I’m confused, because the results you -----> presented !!!  seem to show the exact opposite... To my eye the M10P has less noise below about ISO 6400...?"}, {"autor": "DirkR440", "posts": "1,786 posts", "date": "07/21/2020 08:31  AM", "content": "vor 1 Stunde schrieb paulsydaus: I’m confused, because the results you -----> presented !!!  seem to show the exact opposite... To my eye the M10P has less noise below about ISO 6400...? That was also my opinion"}, {"autor": "Nowhereman", "posts": "2,201 posts", "date": "12/17/2020 06:25  PM", "content": "Advertisement (gone after registration) No one knows what the future configuration of the M10/M10-R successor cameras will be, but many feel that, with the SL2-S having come out with 24 MP, a future M10 camera successor with about 24 MP is assured — and thankfully so. (Note: I’m considering only still images since I don’t shoot video.) In one of the SL2-S threads some people are concluding that the SL2-S is the best non-M camera for M-lenses; and better in this respect than the SL2, considering better high ISO performance and, possibly, better color. In my view, this is similar to the difference between the M10/M10-P and the M10-R. I’ve had no interest in the M10-R simply because my photography, which is usually high-contrast, does not need more resolution, even for large prints. In the days of film, the forum-wallahs of the old Leica groups, said that Leica film cameras could be used for prints up to 11x14 inches and that, after that, you “needed” medium format. Not me: I always liked the “35mm aesthetic” of Tri-X film: and was convinced of that when, around 2006, I saw a retrospective Daido Moriyama exhibition at the Gallery of New South Wales which had some 60 photos at 150x100 cm (60x40 inches) — all shot on Tri-X and printed of an Epson wide-format inkjet printer. More recently, Moriyama has been using a digital camera with a sensor the size of one's finger-nail which shoots only JPGs, the Nikon Coolpix 6500, I believe — and he still exhibits prints at the 150x100 cm, as I saw at a dazzling exhibition of his Tokyo images at the Fondation Cartier in Paris in 2015. So you see where I’m coming from. I’ve had no interest in the M10-R, as not only don’t I need its higher resolution but also prefer the smaller files of the M10, which has better high ISO than the M10-R and doesn't need high shutter speeds for eliminating camera shake for handheld photography: @Steven has found that most of his M10-R shots at less than 1/500 sec shutter speeds exhibit camera shake. While some M10-R users state that their camera has better dynamic range than the M10, the graphs on the photonstophotos.net site don’t support that, and indicate the that the M10 may even have a slight advantage in this respect: if you look at the Photo Dynamic Range Chart and, particularly, the Photo Dynamic Range Improvement chart for the M10 vs the M10-R. I shoot with an M10 and a Ricoh GR III, both 24 MP cameras. With the M10, I prefer the OVF and haven’t used the Visoflex EVF that I bought with the camera. With the GRII, I shoot one-handed, and use the LCD on the back only to establish, roughly, the edges of the frame — and look directly at the subject when pressing the shutter. With both cameras, I’m usually interested in the immediacy of the photography. One of the things I like about the GR III are two of its, adjustable, JPG modes: High-Contrast B&W and Positive Film. I shoot DNG + JPG, and have found, most of the time, that these JPG modes get me closer to where I want to be with the final image than working with the DNG — and much faster. With the M10, I shoot only DNGs, but feel that Leica should -----> introduce !!!  JPG modes that are as good as these two GR III ones. The other thing the GR III has is excellent IBIS. So, my three desiderata for the M10 successor are that it have (1) a 24 MP sensor, (2) good JPG modes, and (3) IBIS — although the latter may be unlikely. As the image that one can produce is the most important consideration for me, I’ll conclude with three images (that I’ve posted elsewhere). Two are landscapes, because this is the genre for which people generally feel they need maximum MP and the third could be called a “street portrait”. (I'm not being critical of people who want high-resolution landscapes, but am only stating what I like for my work). M6 | DR Summicron 50 | Tri-X | Stand development | Wiang Pa Pao--img--  M10 | DR Summicron 50 | ISO 200 | f/5.6 | 1/350 sec | Wiang Pa Pao--img--  M10 | DR Summicron 50 | ISO 400 | f/5.6 | 1/60 sec | Bangkok--img--  Incidentally, Erwin Puts, in his current blog post, with the title \"24 or 47 MP?\", feels that Leica has made ill-considered decisions in going to 47 MP, although his argument is not that coherent. ________________________Frog Leaping photobook Edited December 17, 2020 by Nowhereman"}, {"autor": "Dennis", "posts": "1,521 posts", "date": "12/18/2020 01:57  AM", "content": "Advertisement (gone after registration) M10 + Ricoh Gr III = Killer combination! I had the Gr first version, and I loved it. Both Jpegs and DNG are gorgeous. 7 hours ago, Nowhereman said: So, my three desiderata for the M10 successor are that it have (1) a 24 MP sensor, (2) good JPG modes, and (3) IBIS — although the latter may be unlikely. IBIS would be a grateful feature for sure, but I doubt it's possible. An M camera would be bigger with this technology implement, I guess. There is no more space. And second, besides it's a great and helpful feature on many cameras, I feel that it goes against Rangefinder essence. I don't need help 😂 All mechanic, all natural, all raw. It feels better. It's another game if Leica makes a fusion between the M and the SL system.. So I camera like the Fujix100v ... Rangefinder look, small size, IBIS, flip screen and ....... EVF ..... Ladies and Gentlemen, I may -----> present !!!  you, the brand new Leica Portugal ML 11... What about that? 🤔 ... 🤦‍♂️ By the way, if I were you, I would print your photos on 60\"x40\" ... Specially the second one (tree) 👏👏👏"}, {"autor": "Kwesi", "posts": "818 posts", "date": "12/19/2020 09:29  AM", "content": "On 12/17/2020 at 1:25 PM, Nowhereman said: No one knows what the future configuration of the M10/M10-R successor cameras will be, but many feel that, with the SL2-S having come out with 24 MP, a future M10 camera successor with about 24 MP is assured — and thankfully so. (Note: I’m considering only still images since I don’t shoot video.) With the M10, I shoot only DNGs, but feel that Leica should -----> introduce !!!  JPG modes that are as good as these two GR III ones. The other thing the GR III has is excellent IBIS. So, my three desiderata for the M10 successor are that it have (1) a 24 MP sensor, (2) good JPG modes, and (3) IBIS — although the latter may be unlikely. Lets look at this from Leica's point of view: 1- The SL2-S is a reflection of the intense downward price pressure and competition Leica faces in the Full frame mirrorless market - both from within the L consortium and from Sony, Nikon and Canon. The M has no competition so no need for a \"budget\" version of its flagship model. 2- Good jpg modes ala Ricoh GRIII is quite possible and Leica knows IBIS would be welcomed as long as it doesn't increase the body thickness."}], "name": "Vorzeigen"}