{"interestingcomments": [{"autor": "DreamCalifornia", "date": 1610869703000, "content": "[D] Data indexing visual medium /!/ I have encountered a pretty curious ‘pd.read_html()’ method, while learning about python’s pandas library.\n\nWhen a URL to a Wikipedia article ‘List of U.S. states’ was passed into a dataframe and output called, it magically showed a table with multilevel column and row indexes. What I was really impressed with was that this pandas method was able to look at the merged cell containing value ‘Phoenix’, which was the same for the two fields, ‘Capital’ and ‘largest (city)’ for the state of Arizona, duplicate it and list it as two values in the output tables versus just one across the two fields merged as one in the Wikipedia page.\n\nHow did pandas method do that?\n\nIt got me thinking - is that clever programming that knew to detect merged cells and ‘unmerge’ them if certain criteria are met, like if separate cells in the same list are present, etc.? Was that Machine Learning techniques (patterns) at play? What sorcery is this?\n\nIf the same task of converting a webpage table into a normalized data structure were to be done by a human, i.e. ‘manually’, what would the algorithm of actions be? Probably, all would start and conclude with a visual analysis, right? First, scan through a webpage, identify a rectangular looking area, realize it’s some kind of a list, then break it down further, notice merged cells, take a mental note and then copy paste into say, an excel sheet and (manually) correct the merged cell by splitting into two and duplicating the value into both cells as applicable.\n\nBut why? And how do you, as a fellow human, arrive at conclusions what’s next at end of each step? There’s no inherent data element connections a human brain refers to, as opposed to what a computer might have - say, there were database relations, which are not displayed in the output screen. Does this mean a human’s brain did all the work relying on just a visual schematic of the output?\n\nBut then again, what if the data didn’t look like a list, but rather, just a bunch of text with no spaces and lines, separating columns and rows, then what? The machine probably wouldn’t care, it’s all same data for it, because there’s no ‘visual’ map to go by or rely on. It would expend the same amount of processing power in either case.\n\nA human brain though is likely to use the most optimal way to solve the task - with least resource used, but also with only a possibility of successful completion of a given task. Well, let’s not forget that the ‘lists’, ‘tables’, and other similar ‘visual’ notions we use were invented, or rather, selected as handy by the humans in the first place, it’s not like they already excited independently.\n\nThus, we can conclude that humans wrote a primitive interpreter between the intricacies of how the neuron connections in the brain tackle data processing tasks and what’s in front of their faces - something that could be scribbled on a piece of paper by hands (remember, the ‘manual’ work part?) at a very low speed and envisioned projectile accuracy.\n\nOk, so that explains why it’s fairly easy for a human just by looking at that Wikipedia table, to guess how the subject data should be transposed into an excel sheet - because it was the humans, who wrote the very rules, by which the tables are put together, optimized for the humans’ input/output devices.\n\nIn developing Machine Learning techniques are we then looping back to how the human thinking works? Ignoring the fact that human brain optimized for resource use minimization and employing primitive (meaning ‘good enough’) techniques? Is that really wise?\n\nHow the heck does that approach scale? Good luck with seeing that AI rebellion anytime soon, bro!\n\nLaughing at this? Ok, let’s look at this scenario: I left a water bottle at my work desk when going to the living room to have dinner. There, I had San Pelegrín with my food and chased it up with some more water, from a new bottle. Then I came back to my desk and put that new bottled water right next to the first one, which I have left there previously. Now, imagine we have an AI collecting the ‘visual’ data around my work area and it ‘sees’ these 2 bottles.\n\nWe then ask this AI - why are the water bottles there for? (AI: easy - to drink), Why two though, and why both already started? Does their relative location on the desk matter? (AI: I got hundreds of answers, but no clue which is more probable).\n\nTo expand on this example - the entire world is basically randomly positioned objects of various elementary complexity and who knows why there were, are, or will be in those positions in relation to each other. From a perspective of a given human though, an observed reality might make sense easily - thanks to that Visual Interpreter, which continuously indexes things and assigns it meanings (i.e. the most probable vector of their potential transformations and consequences directly impacting the observer’s well being), which may not match those observed from another perspective, say of an alien form of life.\n\nThat alien might have a completely different perception and participation in time-matter continuum to humans, look at the two water bottles and decide: those xxxxxxxx molecules are moving and ending up in that human’s body, just to leave it through various holes and pores, and then they just get dispersed into the ground and part ways to never meet again. The bottles what seemed to hold them together - till that human opened the caps. Ok, guess, the molecules need better vessels and caps to stay put.\n\nIn other words, it may be time for humans to come up with a better medium to convey information, especially when relying on structured data than text, coded as individual ridiculously looking squiggles, separated by lazy ass lines, ‘helping’ us use the notions of columns and rows and then get quickly confused the second one tiny detail gets thrown into the fragile system.\n\nWe gotta have a system adequate to our times, such that won’t make us go ‘oh wow’, when a machine recognizes a merged cell that needs to be split. Oh yeah, also a system that would still be able to look at the antique hand writings that uses text as data medium, laugh at it loudly and interpret it for us as needed.", "link": "https://www.reddit.com/r/MachineLearning/comments/kz28xw/d_data_indexing_visual_medium/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "antique", "selectorShort": "antique", "MarkedSent": "[d] data indexing visual medium /!/ i have encountered a pretty curious ‘pd.read_html()’ method, while learning about python’s pandas library.\n\nwhen a url to a wikipedia article ‘list of u.s. states’ was passed into a dataframe and output called, it magically showed a table with multilevel column and row indexes. what i was really impressed with was that this pandas method was able to look at the merged cell containing value ‘phoenix’, which was the same for the two fields, ‘capital’ and ‘largest (city)’ for the state of arizona, duplicate it and list it as two values in the output tables versus just one across the two fields merged as one in the wikipedia page.\n\nhow did pandas method do that?\n\nit got me thinking - is that clever programming that knew to detect merged cells and ‘unmerge’ them if certain criteria are met, like if separate cells in the same list are present, etc.? was that machine learning techniques (patterns) at play? what sorcery is this?\n\nif the same task of converting a webpage table into a normalized data structure were to be done by a human, i.e. ‘manually’, what would the algorithm of actions be? probably, all would start and conclude with a visual analysis, right? first, scan through a webpage, identify a rectangular looking area, realize it’s some kind of a list, then break it down further, notice merged cells, take a mental note and then copy paste into say, an excel sheet and (manually) correct the merged cell by splitting into two and duplicating the value into both cells as applicable.\n\nbut why? and how do you, as a fellow human, arrive at conclusions what’s next at end of each step? there’s no inherent data element connections a human brain refers to, as opposed to what a computer might have - say, there were database relations, which are not displayed in the output screen. does this mean a human’s brain did all the work relying on just a visual schematic of the output?\n\nbut then again, what if the data didn’t look like a list, but rather, just a bunch of text with no spaces and lines, separating columns and rows, then what? the machine probably wouldn’t care, it’s all same data for it, because there’s no ‘visual’ map to go by or rely on. it would expend the same amount of processing power in either case.\n\na human brain though is likely to use the most optimal way to solve the task - with least resource used, but also with only a possibility of successful completion of a given task. well, let’s not forget that the ‘lists’, ‘tables’, and other similar ‘visual’ notions we use were invented, or rather, selected as handy by the humans in the first place, it’s not like they already excited independently.\n\nthus, we can conclude that humans wrote a primitive interpreter between the intricacies of how the neuron connections in the brain tackle data processing tasks and what’s in front of their faces - something that could be scribbled on a piece of paper by hands (remember, the ‘manual’ work part?) at a very low speed and envisioned projectile accuracy.\n\nok, so that explains why it’s fairly easy for a human just by looking at that wikipedia table, to guess how the subject data should be transposed into an excel sheet - because it was the humans, who wrote the very rules, by which the tables are put together, optimized for the humans’ input/output devices.\n\nin developing machine learning techniques are we then looping back to how the human thinking works? ignoring the fact that human brain optimized for resource use minimization and employing primitive (meaning ‘good enough’) techniques? is that really wise?\n\nhow the heck does that approach scale? good luck with seeing that ai rebellion anytime soon, bro!\n\nlaughing at this? ok, let’s look at this scenario: i left a water bottle at my work desk when going to the living room to have dinner. there, i had san pelegrín with my food and chased it up with some more water, from a new bottle. then i came back to my desk and put that new bottled water right next to the first one, which i have left there previously. now, imagine we have an ai collecting the ‘visual’ data around my work area and it ‘sees’ these 2 bottles.\n\nwe then ask this ai - why are the water bottles there for? (ai: easy - to drink), why two though, and why both already started? does their relative location on the desk matter? (ai: i got hundreds of answers, but no clue which is more probable).\n\nto expand on this example - the entire world is basically randomly positioned objects of various elementary complexity and who knows why there were, are, or will be in those positions in relation to each other. from a perspective of a given human though, an observed reality might make sense easily - thanks to that visual interpreter, which continuously indexes things and assigns it meanings (i.e. the most probable vector of their potential transformations and consequences directly impacting the observer’s well being), which may not match those observed from another perspective, say of an alien form of life.\n\nthat alien might have a completely different perception and participation in time-matter continuum to humans, look at the two water bottles and decide: those xxxxxxxx molecules are moving and ending up in that human’s body, just to leave it through various holes and pores, and then they just get dispersed into the ground and part ways to never meet again. the bottles what seemed to hold them together - till that human opened the caps. ok, guess, the molecules need better vessels and caps to stay put.\n\nin other words, it may be time for humans to come up with a better medium to convey information, especially when relying on structured data than text, coded as individual ridiculously looking squiggles, separated by lazy ass lines, ‘helping’ us use the notions of columns and rows and then get quickly confused the second one tiny detail gets thrown into the fragile system.\n\nwe gotta have a system adequate to our times, such that won’t make us go ‘oh wow’, when a machine recognizes a merged cell that needs to be split. oh yeah, also a system that would still be able to look at the -----> antique !!!  hand writings that uses text as data medium, laugh at it loudly and interpret it for us as needed.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/kz28xw/d_data_indexing_visual_medium/',)", "identifyer": 5732913, "year": "2021"}], "name": "antiqueMachineLearning2021"}