{"interestingcomments": [{"autor": "Sail_surf", "date": 1612047366000, "content": "[Project] Room Presence Prediction /!/ Hi,\n\nI have a fully automated house with motion sensors in every room. I want to use machine learning to predict my next room visit. As an example, I want to predict when I go to bed and light up the room already before I enter. I believe, that there is a correlation in my walking pattern before I enter my sleeping room (e.g. toilet, bathroom etc).\n\nMy dataset will be a collection of all rooms with a ON and OFF with specific date and time (at second level). The OFF data points can be removed because they have a time period.\n\nMy training set depends on the room to predict and daytime of the prediction. I will only use a subset of rooms and a specific time frame that is only relevant for that prediction. So, for example when I want to predict my sleeping time, I only include rooms like the living room, hall, toilet, bathroom (and not the garden) and only 1 hour before actual the sleeping time. I will use statistic to determine the data involved.\n\nI included an example of a dataset that I planned to use (forget the OFFs data points) with the rooms as columns. \n\nSeeing this data example, what is the best learning method? \n\nShall I include date and time in my learning set and if so, how to normalize date and time?\n\nthanks in advance", "link": "https://www.reddit.com/r/MachineLearning/comments/l8y1zn/project_room_presence_prediction/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[project] room presence prediction /!/ hi,\n\ni have a fully automated house with motion sensors in every room. i want to use machine learning to predict my next room visit. as an example, i want to predict when i go to -----> bed !!!  and light up the room already before i enter. i believe, that there is a correlation in my walking pattern before i enter my sleeping room (e.g. toilet, bathroom etc).\n\nmy dataset will be a collection of all rooms with a on and off with specific date and time (at second level). the off data points can be removed because they have a time period.\n\nmy training set depends on the room to predict and daytime of the prediction. i will only use a subset of rooms and a specific time frame that is only relevant for that prediction. so, for example when i want to predict my sleeping time, i only include rooms like the living room, hall, toilet, bathroom (and not the garden) and only 1 hour before actual the sleeping time. i will use statistic to determine the data involved.\n\ni included an example of a dataset that i planned to use (forget the offs data points) with the rooms as columns. \n\nseeing this data example, what is the best learning method? \n\nshall i include date and time in my learning set and if so, how to normalize date and time?\n\nthanks in advance", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 6, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/l8y1zn/project_room_presence_prediction/',)", "identifyer": 5721649, "year": "2021"}, {"autor": "theRealDavidDavis", "date": 1632159362000, "content": "[D] How to handle backend for spatial storage and placements of objects for a 2D virtual space /!/ Hey all,\n\nI have a background in Industrial and Systems Engineering with a focus in Data Analytics and Machine Learning and I am currently exploring how to apply reinforcment learning to facilities design problems.\n\n**Basic Concept:**\n\nGiven the follwoing:\n\n* Deminsions of a space and it's associated edges\n* Objects, their deminsions, edges, rotations, etc\n\nI would like to be able to define that space and those objects with data structures and then simulate the placement of those objects in the space following a Markov Decision Process (MDP for RL) to identify 'optimal' placements of the objects within the space.\n\nThe MDP sets the foundation for the reinforcement learning.\n\nFor our purposes here, let's take a bedroom (10ft by 10ft), a bed (6ft by 4ft) and a night stand (1ft by 2ft). What is the best way to go about defining these objects?\n\n**Idea for space:**\n\nI have thought about initializing the space as an n x m matrix full of zeros where n and m are the respective lengths and widths multiplied by a ratio for the level of detail I want (ie: 6 inches = 2x, 4 inches = 3x, etc.).\n\n**Idea for objects:**\n\nI have thought about initializing the object as an n x m matrix where edges hold the value of 2 and space inside the edges hold a value of one. This would also have the detail factored into it's size.\n\n**Idea for placement:**\n\nFor placement, my agent would indicate the upper most left hand corner for the object within the space where it would then recieve feedback / a reward as per the MDP.\n\n**Itterations:**\n\nThe agent would itterate through the process n times until it has reached a steady state and mapped out all of the possiblities which optimize the reward.\n\n**Future Development:**\n\nOnce I have something that works succesfully with a basic space such as a bedroom, the idea is to apply this approach to a small problem space (maybe a taco truck) and then go from there.\n\nMy main issues here relate to how I should best define the space computationally and the graphical display there of. IE: D3.js vs pygame vs displaying the space in Blender 3D, etc.", "link": "https://www.reddit.com/r/MachineLearning/comments/przow1/d_how_to_handle_backend_for_spatial_storage_and/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[d] how to handle backend for spatial storage and placements of objects for a 2d virtual space /!/ hey all,\n\ni have a background in industrial and systems engineering with a focus in data analytics and machine learning and i am currently exploring how to apply reinforcment learning to facilities design problems.\n\n**basic concept:**\n\ngiven the follwoing:\n\n* deminsions of a space and it's associated edges\n* objects, their deminsions, edges, rotations, etc\n\ni would like to be able to define that space and those objects with data structures and then simulate the placement of those objects in the space following a markov decision process (mdp for rl) to identify 'optimal' placements of the objects within the space.\n\nthe mdp sets the foundation for the reinforcement learning.\n\nfor our purposes here, let's take a bedroom (10ft by 10ft), a -----> bed !!!  (6ft by 4ft) and a night stand (1ft by 2ft). what is the best way to go about defining these objects?\n\n**idea for space:**\n\ni have thought about initializing the space as an n x m matrix full of zeros where n and m are the respective lengths and widths multiplied by a ratio for the level of detail i want (ie: 6 inches = 2x, 4 inches = 3x, etc.).\n\n**idea for objects:**\n\ni have thought about initializing the object as an n x m matrix where edges hold the value of 2 and space inside the edges hold a value of one. this would also have the detail factored into it's size.\n\n**idea for placement:**\n\nfor placement, my agent would indicate the upper most left hand corner for the object within the space where it would then recieve feedback / a reward as per the mdp.\n\n**itterations:**\n\nthe agent would itterate through the process n times until it has reached a steady state and mapped out all of the possiblities which optimize the reward.\n\n**future development:**\n\nonce i have something that works succesfully with a basic space such as a bedroom, the idea is to apply this approach to a small problem space (maybe a taco truck) and then go from there.\n\nmy main issues here relate to how i should best define the space computationally and the graphical display there of. ie: d3.js vs pygame vs displaying the space in blender 3d, etc.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 3, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/przow1/d_how_to_handle_backend_for_spatial_storage_and/',)", "identifyer": 5728766, "year": "2021"}, {"autor": "prestodigitarium", "date": 1619288479000, "content": "[P] Gourdian Free Dataset Download: OpenStreetMap Points of Interest (Restaurants, Bars, Grocery Stores, Transit, Shops, Swingers Clubs, Hospitals, etc) /!/ Hi there!\n\nA friend and I are working on something to help people search for, filter, and download subsets of datasets.\n\nWe're excited to share that we've just incorporated all(?) of the points of interest from OpenStreetMap, broken down by group (from their ontologies here https://wiki.openstreetmap.org/wiki/Key:amenity and here https://wiki.openstreetmap.org/wiki/Key:shop )\n\nThe groups are below, with the tags that went into each. \n\nWhat do people think these might be useful for? Maybe making your own version of WalkScore? Perhaps cross referencing with real estate listings to find a house that's within walking distance of a bakery, library, cafe, and pyrotechnics shop? LoveHotelMapper.com? The possibilities are endless!\n\n**Restaurants and Bars**: https://gourdian.net/g/eric/osm_points_of_interest.restaurants_and_bars\nAmenities points of interest labeled with bar, biergarten, cafe, fast_food, food_court, ice_cream, pub, or restaurant.\n\n**Education Services**: https://gourdian.net/g/eric/osm_points_of_interest.education_services\nAmenities points of interest labeled with college, driving_school, kindergarten, language_school, library, toy_library, music_school, school, or university.\n\n**Transportation Related**: https://gourdian.net/g/eric/osm_points_of_interest.transportation_related\nAmenities points of interest labeled with bicycle_parking, bicycle_repair_station, bicycle_rental, boat_rental, boat_sharing, bus_station, car_rental, car_sharing, car_wash, vehicle_inspection, charging_station, ferry_terminal, fuel, grit_bin, motorcycle_parking, parking, parking_entrance, parking_space, or taxi.\n\n**Financial**: https://gourdian.net/g/eric/osm_points_of_interest.financial\nAmenities points of interest labeled with atm, bank, or bureau_de_change.\n\n**Healthcare Facilities**: https://gourdian.net/g/eric/osm_points_of_interest.healthcare_facilities\nAmenities points of interest labeled with baby_hatch, clinic, dentist, doctors, hospital, nursing_home, pharmacy, social_facility, or veterinary.\n\n**Entertainment**: https://gourdian.net/g/eric/osm_points_of_interest.entertainment\nAmenities points of interest labeled with arts_centre, brothel, casino, cinema, community_centre, conference_centre, events_venue, fountain, gambling, love_hotel, nightclub, planetarium, public_bookcase, social_centre, stripclub, studio, swingerclub, or theatre.\n\n**Public Services**: https://gourdian.net/g/eric/osm_points_of_interest.public_services\nAmenities points of interest labeled with courthouse, embassy, fire_station, police, post_box, post_depot, post_office, prison, ranger_station, or townhall.\n\n**Facilities**: https://gourdian.net/g/eric/osm_points_of_interest.facilities\nAmenities points of interest labeled with bbq, bench, dog_toilet, drinking_water, give_box, shelter, shower, telephone, toilets, water_point, or watering_place.\n\n**Waste Management**: https://gourdian.net/g/eric/osm_points_of_interest.waste_management\nAmenities points of interest labeled with sanitary_dump_station, recycling, waste_basket, waste_disposal, or waste_transfer_station.\n\n**Other Amenities**: https://gourdian.net/g/eric/osm_points_of_interest.other_amenities\nAmenities points of interest labeled with animal_boarding, animal_breeding, animal_shelter, baking_oven, childcare, clock, crematorium, dive_centre, funeral_hall, grave_yard, gym, hunting_stand, internet_cafe, kitchen, kneipp_water_cure, lounger, marketplace, monastery, photo_booth, place_of_mourning, place_of_worship, public_bath, public_building, refugee_site, or vending_machine.\n\n**Food Shops**: https://gourdian.net/g/eric/osm_points_of_interest.food_shops\nShops points of interest labeled with alcohol, bakery, beverages, brewing_supplies, butcher, cheese, chocolate, coffee, confectionery, convenience, deli, dairy, farm, frozen_food, greengrocer, health_food, ice_cream, organic, pasta, pastry, seafood, spices, tea, wine, or water.\n\n**General Shops**: https://gourdian.net/g/eric/osm_points_of_interest.general_shops\nShops points of interest labeled with department_store, general, kiosk, mall, supermarket, or wholesale.\n\n**Clothing Shops**: https://gourdian.net/g/eric/osm_points_of_interest.clothing_shops\nShops points of interest labeled with baby_goods, bag, boutique, clothes, fabric, fashion, fashion_accessories, jewelry, leather, sewing, shoes, tailor, watches, or wool.\n\n**Second Hand Shops**: https://gourdian.net/g/eric/osm_points_of_interest.second_hand_shops\nShops points of interest labeled with charity, second_hand, or variety_store.\n\n**Health and Beauty Shops**: https://gourdian.net/g/eric/osm_points_of_interest.health_and_beauty_shops\nShops points of interest labeled with beauty, chemist, cosmetics, drugstore, erotic, hairdresser, hairdresser_supply, hearing_aids, herbalist, massage, medical_supply, nutrition_supplements, optician, perfumery, or tattoo.\n\n**Hardware Shops**: https://gourdian.net/g/eric/osm_points_of_interest.hardware_shops\nShops points of interest labeled with agrarian, appliance, bathroom_furnishing, doityourself, electrical, energy, fireplace, florist, garden_centre, garden_furniture, gas, glaziery, groundskeeping, hardware, houseware, locksmith, paint, security, trade, or windows.\n\n**Furnishing Shops**: https://gourdian.net/g/eric/osm_points_of_interest.furnishing_shops\nShops points of interest labeled with antiques, bed, candles, carpet, curtain, doors, flooring, furniture, household_linen, interior_decoration, kitchen, lamps, lighting, tiles, or window_blind.\n\n**Electronics Shops**: https://gourdian.net/g/eric/osm_points_of_interest.electronics_shops\nShops points of interest labeled with computer, electronics, hifi, mobile_phone, radiotechnics, or vacuum_cleaner.\n\n**Vehicle and Outdoor Shops**: https://gourdian.net/g/eric/osm_points_of_interest.vehicle_and_outdoor_shops\nShops points of interest labeled with atv, bicycle, boat, car, car_repair, car_parts, caravan, fuel, fishing, golf, hunting, jetski, military_surplus, motorcycle, outdoor, scuba_diving, ski, snowmobile, sports, swimming_pool, trailer, or tyres.\n\n**Hobby Shops**: https://gourdian.net/g/eric/osm_points_of_interest.hobby_shops\nShops points of interest labeled with art, collector, craft, frame, games, model, music, musical_instrument, photo, camera, trophy, video, or video_games.\n\n**Stationary and Gift Shops**: https://gourdian.net/g/eric/osm_points_of_interest.stationary_and_gift_shops\nShops points of interest labeled with anime, books, gift, lottery, newsagent, stationery, or ticket.\n\n**Other Shops**: https://gourdian.net/g/eric/osm_points_of_interest.other_shops\nShops points of interest labeled with bookmaker, cannabis, copyshop, dry_cleaning, e-cigarette, funeral_directors, laundry, money_lender, party, pawnbroker, pet, pet_grooming, pest_control, pyrotechnics, religion, storage_rental, tobacco, toys, travel_agency, vacant, weapons, outpost, or user defined.\n\n\nA bit about what we're trying to build:\n\n* Filter (optional), click the button, CSV arrives on your hard drive\n* Downloads are always a single CSV, no bundles with weird directory structures, no other formats\n* CSVs are indexed and filterable by a few column types (lat/long and date/time at the moment), so you can download just the parts you want\n* Open licensed datasets are free to download\n* No signup required for downloading open datasets\n* Search within and across datasets\n\nFeedback welcome! If there are any datasets that you'd like to see added, let us know!", "link": "https://www.reddit.com/r/MachineLearning/comments/mxpnwe/p_gourdian_free_dataset_download_openstreetmap/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[p] gourdian free dataset download: openstreetmap points of interest (restaurants, bars, grocery stores, transit, shops, swingers clubs, hospitals, etc) /!/ hi there!\n\na friend and i are working on something to help people search for, filter, and download subsets of datasets.\n\nwe're excited to share that we've just incorporated all(?) of the points of interest from openstreetmap, broken down by group (from their ontologies here https://wiki.openstreetmap.org/wiki/key:amenity and here https://wiki.openstreetmap.org/wiki/key:shop )\n\nthe groups are below, with the tags that went into each. \n\nwhat do people think these might be useful for? maybe making your own version of walkscore? perhaps cross referencing with real estate listings to find a house that's within walking distance of a bakery, library, cafe, and pyrotechnics shop? lovehotelmapper.com? the possibilities are endless!\n\n**restaurants and bars**: https://gourdian.net/g/eric/osm_points_of_interest.restaurants_and_bars\namenities points of interest labeled with bar, biergarten, cafe, fast_food, food_court, ice_cream, pub, or restaurant.\n\n**education services**: https://gourdian.net/g/eric/osm_points_of_interest.education_services\namenities points of interest labeled with college, driving_school, kindergarten, language_school, library, toy_library, music_school, school, or university.\n\n**transportation related**: https://gourdian.net/g/eric/osm_points_of_interest.transportation_related\namenities points of interest labeled with bicycle_parking, bicycle_repair_station, bicycle_rental, boat_rental, boat_sharing, bus_station, car_rental, car_sharing, car_wash, vehicle_inspection, charging_station, ferry_terminal, fuel, grit_bin, motorcycle_parking, parking, parking_entrance, parking_space, or taxi.\n\n**financial**: https://gourdian.net/g/eric/osm_points_of_interest.financial\namenities points of interest labeled with atm, bank, or bureau_de_change.\n\n**healthcare facilities**: https://gourdian.net/g/eric/osm_points_of_interest.healthcare_facilities\namenities points of interest labeled with baby_hatch, clinic, dentist, doctors, hospital, nursing_home, pharmacy, social_facility, or veterinary.\n\n**entertainment**: https://gourdian.net/g/eric/osm_points_of_interest.entertainment\namenities points of interest labeled with arts_centre, brothel, casino, cinema, community_centre, conference_centre, events_venue, fountain, gambling, love_hotel, nightclub, planetarium, public_bookcase, social_centre, stripclub, studio, swingerclub, or theatre.\n\n**public services**: https://gourdian.net/g/eric/osm_points_of_interest.public_services\namenities points of interest labeled with courthouse, embassy, fire_station, police, post_box, post_depot, post_office, prison, ranger_station, or townhall.\n\n**facilities**: https://gourdian.net/g/eric/osm_points_of_interest.facilities\namenities points of interest labeled with bbq, bench, dog_toilet, drinking_water, give_box, shelter, shower, telephone, toilets, water_point, or watering_place.\n\n**waste management**: https://gourdian.net/g/eric/osm_points_of_interest.waste_management\namenities points of interest labeled with sanitary_dump_station, recycling, waste_basket, waste_disposal, or waste_transfer_station.\n\n**other amenities**: https://gourdian.net/g/eric/osm_points_of_interest.other_amenities\namenities points of interest labeled with animal_boarding, animal_breeding, animal_shelter, baking_oven, childcare, clock, crematorium, dive_centre, funeral_hall, grave_yard, gym, hunting_stand, internet_cafe, kitchen, kneipp_water_cure, lounger, marketplace, monastery, photo_booth, place_of_mourning, place_of_worship, public_bath, public_building, refugee_site, or vending_machine.\n\n**food shops**: https://gourdian.net/g/eric/osm_points_of_interest.food_shops\nshops points of interest labeled with alcohol, bakery, beverages, brewing_supplies, butcher, cheese, chocolate, coffee, confectionery, convenience, deli, dairy, farm, frozen_food, greengrocer, health_food, ice_cream, organic, pasta, pastry, seafood, spices, tea, wine, or water.\n\n**general shops**: https://gourdian.net/g/eric/osm_points_of_interest.general_shops\nshops points of interest labeled with department_store, general, kiosk, mall, supermarket, or wholesale.\n\n**clothing shops**: https://gourdian.net/g/eric/osm_points_of_interest.clothing_shops\nshops points of interest labeled with baby_goods, bag, boutique, clothes, fabric, fashion, fashion_accessories, jewelry, leather, sewing, shoes, tailor, watches, or wool.\n\n**second hand shops**: https://gourdian.net/g/eric/osm_points_of_interest.second_hand_shops\nshops points of interest labeled with charity, second_hand, or variety_store.\n\n**health and beauty shops**: https://gourdian.net/g/eric/osm_points_of_interest.health_and_beauty_shops\nshops points of interest labeled with beauty, chemist, cosmetics, drugstore, erotic, hairdresser, hairdresser_supply, hearing_aids, herbalist, massage, medical_supply, nutrition_supplements, optician, perfumery, or tattoo.\n\n**hardware shops**: https://gourdian.net/g/eric/osm_points_of_interest.hardware_shops\nshops points of interest labeled with agrarian, appliance, bathroom_furnishing, doityourself, electrical, energy, fireplace, florist, garden_centre, garden_furniture, gas, glaziery, groundskeeping, hardware, houseware, locksmith, paint, security, trade, or windows.\n\n**furnishing shops**: https://gourdian.net/g/eric/osm_points_of_interest.furnishing_shops\nshops points of interest labeled with antiques, -----> bed !!! , candles, carpet, curtain, doors, flooring, furniture, household_linen, interior_decoration, kitchen, lamps, lighting, tiles, or window_blind.\n\n**electronics shops**: https://gourdian.net/g/eric/osm_points_of_interest.electronics_shops\nshops points of interest labeled with computer, electronics, hifi, mobile_phone, radiotechnics, or vacuum_cleaner.\n\n**vehicle and outdoor shops**: https://gourdian.net/g/eric/osm_points_of_interest.vehicle_and_outdoor_shops\nshops points of interest labeled with atv, bicycle, boat, car, car_repair, car_parts, caravan, fuel, fishing, golf, hunting, jetski, military_surplus, motorcycle, outdoor, scuba_diving, ski, snowmobile, sports, swimming_pool, trailer, or tyres.\n\n**hobby shops**: https://gourdian.net/g/eric/osm_points_of_interest.hobby_shops\nshops points of interest labeled with art, collector, craft, frame, games, model, music, musical_instrument, photo, camera, trophy, video, or video_games.\n\n**stationary and gift shops**: https://gourdian.net/g/eric/osm_points_of_interest.stationary_and_gift_shops\nshops points of interest labeled with anime, books, gift, lottery, newsagent, stationery, or ticket.\n\n**other shops**: https://gourdian.net/g/eric/osm_points_of_interest.other_shops\nshops points of interest labeled with bookmaker, cannabis, copyshop, dry_cleaning, e-cigarette, funeral_directors, laundry, money_lender, party, pawnbroker, pet, pet_grooming, pest_control, pyrotechnics, religion, storage_rental, tobacco, toys, travel_agency, vacant, weapons, outpost, or user defined.\n\n\na bit about what we're trying to build:\n\n* filter (optional), click the button, csv arrives on your hard drive\n* downloads are always a single csv, no bundles with weird directory structures, no other formats\n* csvs are indexed and filterable by a few column types (lat/long and date/time at the moment), so you can download just the parts you want\n* open licensed datasets are free to download\n* no signup required for downloading open datasets\n* search within and across datasets\n\nfeedback welcome! if there are any datasets that you'd like to see added, let us know!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/mxpnwe/p_gourdian_free_dataset_download_openstreetmap/',)", "identifyer": 5731998, "year": "2021"}, {"autor": "bendee983", "date": 1610376466000, "content": "[R] Concept Whitening—Creating neural networks that are inherently interpretable /!/ Researchers at Duke University introduced [concept whitening](https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/), a technique that aligns neurons in different layers of NNs with specific concepts.\n\n\\- CW is a module that replaces batch norm. It performs the functions of batch norm, and in addition adjusts the latent space so that specific neurons are directly aligned with specific concepts.\n\n\\- Training with CW is a dual process. One process trains the NN on the main task. The second training process is performed on a separate concept data set, with the goal of adjusting the latent space.\n\n\\- The result is an NN that is much more interpretable. For instance, if your CNN is classifying an object as a bedroom, you can check how much concepts such as bed, lamp, fridge, door, etc. are contributing to the result\n\n\\- Interpretability comes at no cost to performance, and it is less vague that post hoc explainability techniques.\n\nRead my interview with the researchers here:\n\n[https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/](https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/)\n\nRead the full paper here:\n\n[https://arxiv.org/abs/2002.01650](https://arxiv.org/abs/2002.01650)", "link": "https://www.reddit.com/r/MachineLearning/comments/kv418e/r_concept_whiteningcreating_neural_networks_that/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[r] concept whitening—creating neural networks that are inherently interpretable /!/ researchers at duke university introduced [concept whitening](https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/), a technique that aligns neurons in different layers of nns with specific concepts.\n\n\\- cw is a module that replaces batch norm. it performs the functions of batch norm, and in addition adjusts the latent space so that specific neurons are directly aligned with specific concepts.\n\n\\- training with cw is a dual process. one process trains the nn on the main task. the second training process is performed on a separate concept data set, with the goal of adjusting the latent space.\n\n\\- the result is an nn that is much more interpretable. for instance, if your cnn is classifying an object as a bedroom, you can check how much concepts such as -----> bed !!! , lamp, fridge, door, etc. are contributing to the result\n\n\\- interpretability comes at no cost to performance, and it is less vague that post hoc explainability techniques.\n\nread my interview with the researchers here:\n\n[https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/](https://bdtechtalks.com/2021/01/11/concept-whitening-interpretable-neural-networks/)\n\nread the full paper here:\n\n[https://arxiv.org/abs/2002.01650](https://arxiv.org/abs/2002.01650)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 22, "media": "('self',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/kv418e/r_concept_whiteningcreating_neural_networks_that/',)", "identifyer": 5738010, "year": "2021"}, {"autor": "Noah0", "date": 1620569892000, "content": "[D] High Level books to read about ML (for nighttime reading) /!/ I want to learn about Machine Learning. I am an actuary by trade and have basic python stills. I have the intent to follow the steps in this post:\n\n[https://www.reddit.com/r/MachineLearning/comments/8at30n/d\\_what\\_is\\_the\\_best\\_way\\_of\\_learning\\_machine/](https://www.reddit.com/r/MachineLearning/comments/8at30n/d_what_is_the_best_way_of_learning_machine/)\n\nI also see this post as well , but I plan to follow the steps above:\n\n[https://www.reddit.com/r/MachineLearning/comments/5z8110/d\\_a\\_super\\_harsh\\_guide\\_to\\_machine\\_learning/](https://www.reddit.com/r/MachineLearning/comments/5z8110/d_a_super_harsh_guide_to_machine_learning/)\n\nI have a stats background already but I have low computer confidence. I really enjoy reading and want to pick out a good book to read before bed. A high level book that talks about what ML is, not about actual coding or anything like that.\n\nCan you folks please offer me some recommendations?\n\nThank you!", "link": "https://www.reddit.com/r/MachineLearning/comments/n8f49o/d_high_level_books_to_read_about_ml_for_nighttime/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "bed", "selectorShort": "bed", "MarkedSent": "[d] high level books to read about ml (for nighttime reading) /!/ i want to learn about machine learning. i am an actuary by trade and have basic python stills. i have the intent to follow the steps in this post:\n\n[https://www.reddit.com/r/machinelearning/comments/8at30n/d\\_what\\_is\\_the\\_best\\_way\\_of\\_learning\\_machine/](https://www.reddit.com/r/machinelearning/comments/8at30n/d_what_is_the_best_way_of_learning_machine/)\n\ni also see this post as well , but i plan to follow the steps above:\n\n[https://www.reddit.com/r/machinelearning/comments/5z8110/d\\_a\\_super\\_harsh\\_guide\\_to\\_machine\\_learning/](https://www.reddit.com/r/machinelearning/comments/5z8110/d_a_super_harsh_guide_to_machine_learning/)\n\ni have a stats background already but i have low computer confidence. i really enjoy reading and want to pick out a good book to read before -----> bed !!! . a high level book that talks about what ml is, not about actual coding or anything like that.\n\ncan you folks please offer me some recommendations?\n\nthank you!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/n8f49o/d_high_level_books_to_read_about_ml_for_nighttime/',)", "identifyer": 5739908, "year": "2021"}], "name": "bedMachineLearning2021"}