{"interestingcomments": [{"autor": "l1x-", "date": 1625493593000, "content": "[P] Is it possible to create an aiming software with machine learning? /!/ I would like to create a system that sprays water on animals to get them out from our garden (as opposed to get a licenses hunter and kill them). The foxes use our garden as a cemetery for the prey they eat and I have to burn and burry animal corpses every week (we have small children and I am afraid of rabies). I was thinking about installing cameras and create a model that can classify animals. That part is sort of easy. The second part would be a system that sprays water on them. That one I am not sure of. I was trying to find aiming software but not even sure what to google for.\n\nDoes anybody have any experience with this?", "link": "https://www.reddit.com/r/MachineLearning/comments/oe7yjt/p_is_it_possible_to_create_an_aiming_software/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "[p] is it possible to create an aiming software with machine learning? /!/ i would like to create a system that sprays water on animals to get them out from our -----> garden !!!  (as opposed to get a licenses hunter and kill them). the foxes use our garden as a cemetery for the prey they eat and i have to burn and burry animal corpses every week (we have small children and i am afraid of rabies). i was thinking about installing cameras and create a model that can classify animals. that part is sort of easy. the second part would be a system that sprays water on them. that one i am not sure of. i was trying to find aiming software but not even sure what to google for.\n\ndoes anybody have any experience with this?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 26, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/oe7yjt/p_is_it_possible_to_create_an_aiming_software/',)", "identifyer": 5730798, "year": "2021"}, {"autor": "PedroGGBM", "date": 1625753476000, "content": "Categorizing building types using transfer learning (image clustering) help /!/ Hello! I'm a high school student with limited knowledge of ML. I currently have this image dataset (5,000+) of buildings (bars, hotels, summer resorts, etc) from an architecture firm. \n\nI was hoping I could categorize these according to the building types and/or according to common architectonical features (pools, garden, etc). My idea was to use a model for image clustering using transfer learning. However, I am dubious about its validity, seeing as I am not an expert. \n\nThese images contain building types ranging from restaurants, bars, and hotels to vineyards, lodge cabins, etc. I doubt whether an ML is appropriate at all. Any recommendations are appreciated. Thank you :)", "link": "https://www.reddit.com/r/MachineLearning/comments/og7ztm/categorizing_building_types_using_transfer/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "categorizing building types using transfer learning (image clustering) help /!/ hello! i'm a high school student with limited knowledge of ml. i currently have this image dataset (5,000+) of buildings (bars, hotels, summer resorts, etc) from an architecture firm. \n\ni was hoping i could categorize these according to the building types and/or according to common architectonical features (pools, -----> garden !!! , etc). my idea was to use a model for image clustering using transfer learning. however, i am dubious about its validity, seeing as i am not an expert. \n\nthese images contain building types ranging from restaurants, bars, and hotels to vineyards, lodge cabins, etc. i doubt whether an ml is appropriate at all. any recommendations are appreciated. thank you :)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/og7ztm/categorizing_building_types_using_transfer/',)", "identifyer": 5737700, "year": "2021"}, {"autor": "rexlow0823", "date": 1626966530000, "content": "[D] Is it wise to build a multi-language text classifier? /!/ I am trying to build a food text classifier that involves around 5 classes. The data we have looks like this\n\n    Bak Kut Teh Combo\n    B6 Green Apple Black Soya Milk 500ml Bottle\n    Gui Lin Jelly Black Soya Milk 500ml Bottle\n    100plus\n    Fresh Orange Juice\n    Salted Black Pepper Mushroom (Small) 香椿猴头菇 (小)\n    Sweet &amp; Sour Dream Garden Rice 甜酸梦圆饭\n    娘惹黄豆腐焖鸡\n\nIt consists of 2 languages here, English and Chinese. We build a relatively good English food text classifier with `fastText` but sometimes the request text consists of other languages. \n\nHow would you guys approach this challenge? Just train one classifier or is it wiser to first detect the text language then only proceed with text classification?", "link": "https://www.reddit.com/r/MachineLearning/comments/opfq64/d_is_it_wise_to_build_a_multilanguage_text/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "garden", "selectorShort": "garden", "MarkedSent": "[d] is it wise to build a multi-language text classifier? /!/ i am trying to build a food text classifier that involves around 5 classes. the data we have looks like this\n\n    bak kut teh combo\n    b6 green apple black soya milk 500ml bottle\n    gui lin jelly black soya milk 500ml bottle\n    100plus\n    fresh orange juice\n    salted black pepper mushroom (small) 香椿猴头菇 (小)\n    sweet &amp; sour dream -----> garden !!!  rice 甜酸梦圆饭\n    娘惹黄豆腐焖鸡\n\nit consists of 2 languages here, english and chinese. we build a relatively good english food text classifier with `fasttext` but sometimes the request text consists of other languages. \n\nhow would you guys approach this challenge? just train one classifier or is it wiser to first detect the text language then only proceed with text classification?", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/opfq64/d_is_it_wise_to_build_a_multilanguage_text/',)", "identifyer": 5737752, "year": "2021"}], "name": "gardenMachineLearning2021"}