{"interestingcomments": [{"autor": "sustainabledude", "date": 1631788835000, "content": "Goldspot Discoveries: Integrating Big Data &amp; Artificial Intelligence in the Mining Industry [Project] /!/ &amp;#x200B;\n\nIntroduction\n\nMining exploration is undergoing a revolution; only the mining industry hasn’t realized it yet. The insurgents leading the revolution come from Goldspot Discoveries, a small Canadian technology company that is bringing AI/Machine Learning into the traditional geosciences field that has long dominated the exploration game. Still an early-stage company, Goldspot remains undervalued even as it has consistently outperformed expectations while delivering outstanding revenue growth and profitability. The company is well capitalized and has built a huge head start on any future competition that will take several years (at best) to close. While all of these factors would be a great story for any company, they aren’t even the best part of the Goldspot story. Just like the group of MIT students used data analysis methodologies to stick it to the blackjack casinos (described in the book *Bringing Down the House* and the film *21*), Goldspot is cracking the code for junior mining investment in order to rewrite the odds of the game in their favor. To put it simply, this is the moment where big data meets small miners – and one of the first hands Goldspot has played (New Found Gold - $NFG) has already given the house a good shake.\n\nCompany Overview\n\nGoldspot Discoveries started as a group of data scientists out of Quebec that competed in a mining technology challenge. Their approach to improving mining exploration was to utilize advanced data analysis techniques to improve the probability of drilling success. This group of scientist were connected with Denis Laviolette and Cejay Kim and together they turned this new technical approach into a functioning geoscience consulting business. Goldspot was officially formed in 2016, and then went public via a reverse merger in early 2019. For the last several fiscal quarters, Goldspot has seen revenues skyrocket (see charts in later sections), while building an investment portfolio that would make many far larger companies green with envy. Goldspot has been rewarded for its strong operational and financial performance with 8-fold gains in its stock price in the last 12 months (achieved on consistent and sustainable price gains). Looking forward, Goldspot has put teasers into the market of several new technologies, products in the r&amp;d pipeline, and strategic partnerships that should deliver strong shareholder value into the future.\n\nGoldspot is a technology and consultancy company that specializes in applying machine learning &amp; artificial intelligence to collect, interpret and convert data into so-called 'Smart Targets' that can pinpoint the exact location of potential new resource reserves.\n\nContrary to what the company’s name would suggest, Goldspot specializes in finding almost any commodity reserve. Many of Goldspot's current clients are gold miners and silver miners, but there is also significant demand from the lithium, copper and base metal industry for Goldspot's services.\n\nThe search for new mineral reserves is not a new phenomenon. But with a dwindling number of new discoveries, the global supply chain is facing a decreasing supply and a rising demand. With fewer, smaller and more expensive discoveries, the mining sector is facing a problematic issue. Goldspot is tactically responding to this with the introduction of deep learning algorithms that can highlight and identify new innovative mathematical solutions and interpretations on geological patterns. Deep learning makes it possible to analyze an enormous amount of data that is virtually impossible for the human brain to analyze and interpret properly.\n\nThe new technologies have enabled Goldspot to produce results that were not possible before. This significantly increases the reliability &amp; accuracy of the targets. In addition to the extreme accuracy of Goldspot's results, Goldspot saves its clients a lot of time and money by letting software do the bulk of the work. By reducing costly human labor and time while improving results Goldspot has set up a compelling alternative to traditional methods and has proven to be a very attractive solution for mining companies.\n\nGoldspot's Business Model\n\n**Summary**\n\nOne of best way to analyze Goldspot’s business is to look at it as a car. The AI/Machine Learning (discussed in detail below) is the engine and the rest of the business model is the vehicle that is built around that engine. At its core, Goldspot is a technology company. Upwards of 2/3rds of the its employees work on the technical side of the business – mostly out of its location in Montreal. Quebec is a highly underrated hotspot of engineering and technical talent, with several top universities nearby turning out top-notch talent.\n\nGoldspot has brought onboard well over 20 PhD’s in diverse but related fields such as structural geology, geochemistry, geophysics, and complex data science and so forth. The beauty of Goldspot is its ability to integrate the results of these various fields into a simplified target analysis. Once its geoscience tools are built, Goldspot can then apply it on a wide-scale to create a competitive advantage for its clients.\n\nGoldspot's business model currently consists of 4 segments:\n\n1. Consultancy Services (Smart target generation)\n2. Investments\n3. Software as a Service (SaaS)\n4. Exploration (Golden Planet Mining)\n\nConsultancy Services\n\nGoldspot is advising mining entities for target generation to find new potential reserves with the aforementioned 'Smart Targets' that have been derived from the in-house AI &amp; machine learning algorithms. Goldspot concludes contracts with its clients that cover the costs incurred and generate an decent operating profit for Goldspot that are in line with the average margins in the consultancy sector.\n\nThe Consultancy turnover is growing by approximately 100% on an annual basis since Goldspot’s inception and consists of time waged contracts with mining corporations. The mining corporations can be subdivided into two categories: Junior miners (small mining companies that do not yet have an operational mine, but do have a piece of land, a so called claim) and Majors (mining companies that already have at least one operational mine).\n\nGoldspot’s Consultancy services are based on the in-house processing of historical and/or public big data sets of the client’s claim. In combination with the use of Goldspot’s AI and machine learning algorithms the company is able to extract correlations &amp; recognize patterns in the big data sets that provide sustained conclusions about a client’s claim.\n\nGoldspot recently acquired the full-service field exploration firm ‘Ridgeline Exploration’ to provide a full-service solution to solve common inconsistent and piecemeal data collection practices that increase risk and lower efficiency across the industry. With the acquisition of Ridgeline, GoldSpot aims to strengthen its existing consultancy business as well as vertically integrate the ability to capture key data, including airborne geophysical survey mapping, geochemistry, structural mapping and geophysics. By improving the reliability of the big data sets Goldspot works with, the accuracy of the generated Smart Targets will considerably improve.\n\nGoldspot has provided consultancy services for big names in the sector like Yamana Gold, Fortuna Silver Mines, Sprott Mining and Vale to name a few, as well as countless Junior Miners among which are the names of New Found Gold, Critical Elements Lithium Corporation and Nevada King Gold Corp.\n\n&amp;#x200B;\n\nInvestments\n\nBut that is only the first part of the equation. By being able to evaluate large swaths of data over a vast geographical region Goldspot has an edge in being able to pick the potential winners and losers among junior mining exploration companies before everyone else. This is like having the cheat codes to the mining investment game.\n\nNow it is often so that Junior miners do not have enough working capital to engage Goldspot on their project. They are short on cash and cannot meet the requested rates from Goldspot. Goldspot has devised a smart solution for this particular problem. Before entering into a negotiation with the Junior miner, Goldspot analyzes the claim (territory) of the Junior miner using its in-house software &amp; deep learning algorithms and determines whether there is a significant probability that there is a promising reserve to be found on the claim based on their initial analysis. If that probability looks promising, Goldspot offers to take equity (shares and/or warrants) in the Junior Miner. They participate in a 'Private Placement' which allows the Junior Miner to raise money by issuing shares and/or warrants. As a result the Junior Miner can pay for Goldspot's consultancy services with the capital they raised. Every now and then Goldspot also negotiates for an NSR as part of a deal. An NSR, an abbreviation for ‘Net Smelter Return’, is a royalty on the net gold quantity a mine produces. These NSR’s are often set around 0.5%-2%.\n\nBy applying this method, Goldspot has in addition to a consultancy contract, acquired an interest in the Junior miner. This creates a significant synergy when Goldspot delivers successful 'Smart Targets' and when these targets are also successfully tapped into. As a result the shares of the Junior Miner will increase significantly in value with Goldspot having a stake in the company.\n\nE.g. One of Goldspot's first clients was the junior miner New Found Gold. Goldspot had at the time entered into a contract with New Found Gold and acquired 1.7M shares and an NSR of 0.5% on the claim using the aforementioned method. At that time, the price of one NFG share was $0.40. After delivering the \"Smart Targets\" and successful drilling, which continues to this day, the stock has now increased in value by 30 times at a price of $12 per share. As a result, Goldspot's initial investment of $680,000 has appreciated to $20.4M, delivering an unrealized profit of $19.72M. The exact worth of the 0.5% NSR Goldspot acquired on NFG’s claim is difficult to estimate until an exact resource estimation and a PFS (Pre-Feasibility Study) and PEA (Pre-Economic Study). Very likely though NFG's 0.5% NSR is worth something in the \"tens\" of millions but that is still very speculative. Now, certainly not every Junior Miner will be a success story like New Found Gold. However Goldspot’s approach on investing in Junior Miners significantly de-risks their Junior Miner portfolio in comparison to other Junior Miner ETF’s. Further elaboration on this in the next paragraph.\n\nGoldspot is very selective on what Junior Miners the company decides to engage with. To create the highest chance of success they’ve established a data based approach on finding the best deals on the market. They have previously referred to this as ‘Resource Quantamental’ and they described it as an AI-driven opportunity generator pointing Goldspot to the ideal companies to work with. Resource Quantamental is the largest aggregate of mining data in the world and makes use of all the big data sets available on the capital markets, management compatibility and historical drilling results as well as geologic data. The output serves Goldspot with the ideal companies that have the highest chance of success when Goldspot engages with them.\n\nSoftware as a Service\n\nTo grow Goldspot’s consultancy revenue the current team is becoming increasingly more efficient as they develop better skills &amp; internal work processes mature. Furthermore, the company is actively hiring more staff. However, this will pose a problem in the long run. Consultancy business is very employee intensive, and unlike other sectors, there is a great scarcity of people with degrees with the combination of Geology &amp; Data Science. For Goldspot however, people with these profiles are a necessity.\n\nTo overcome this problem and make the in-house technology scalable and lucrative, Goldspot has decided to develop &amp; acquire mining related SaaS products. Work is currently underway for the launch of two highly technical SaaS products that are expected to launch in Q4 2021.\n\nOne of those two new SaaS products is *LithoLens*, Goldspot’s core imaging technology which adds value by extracting geological information from otherwise unused core photography, providing brand new data for 3D modelling and exploration purposes. Core logging is an essential step in the exploration process. It is the manual systematic recording and measuring of information from drill core to determine the lithology, mineralogy, geological history, structure and alteration zones. Due to being a highly manual repetitive task, core logging is subject to human error and rising costs. Litholens can work with imagery from historic and recent drill core photographs, to downhole optical and acoustic televiewer files, to videos of seafloor nodule deposits used in deep-sea mining. The data inserted in Litholens is processed in the cloud and the machine learning creates large and valuable new datasets from underutilized imagery and video data. The total addresable market for Litholens – the so called ‘core logging market’ currently has a turnover of around $50M per year, but Litholens ability to relog historical imagery could open up a opportunity closer to $500M.\n\nLithoLens is a software solution that once available to the mining sector, has the potential to provide Goldspot with an additional revenue stream that, unlike the majority of consulting services, is reoccurring in nature. As a result of this potential for significant recurring revenue, the LithoLens technology is a focal point of Goldspot’s future growth.\n\nGoldspot recently enhanced its Litholens development by acquiring the tech company Geotic. Geotic’s portfolio of 5 software tools (*GeoticMine, GeoticLog, GeoticGraph, GeoticCAD and GeoticField*) offer diversified 3D modelling and core-logging, improving the way that Geologists and Engineers collect and analyze data. The powerful combination of *GeoticLog* and *LithoLens* will create an industry-first core logging and AI imaging cloud solution.\n\nThe second SaaS product scheduled for launch in Q4 2021 is called ‘MinusOne’ and is a software solution for creating 3-D models from geophysical data processed using deterministic and stochastic inversion methods. With this technology, Goldspot's team also applies a ML (machine learning) method to provide probabilistic framework that helps to analyze uncertainty. The processed results guide exploration drilling locations and geology interpretation.\n\nGoldspot has now over 40 research and development products currently in development and is now at the point where many of these tools can be monetized on a much larger scale as external software solutions.\n\nCEO.CA acquisition – the next birthplace for Junior Miners &amp; mining companies\n\nOn the 16th August 2021 Goldspot announced their intent to acquire the social investor network CEO.CA. CEO.CA is an international investor website with the focus on Canadian listed companies. Canada is the global hub for mining entities to seek financing and there are thousands of global mining companies listed on the TSX-V exchange (Toronto Stock Exchange).\n\n\"GoldSpot's focus is to unlock value in mineral exploration with data science and machine learning and we are proud to serve more than fifty global exploration companies in this endeavour. The acquisition of CEO.CA, and the establishment of a technology and media division, is strategic to that vision and provides significant economic potential to our clients and shareholders,\" commented GoldSpot Executive Chairman &amp; President Denis Laviolette.\n\nGolden Planet Mining\n\nAside from taking equity in third parties, Goldspot has decided to leverage their own tech &amp; brand awareness to set up their own exploration company: Golden Planet Mining (GPM). Formerly known as XCorp AI they merged with Saskatchewan Gold Corp. to acquire the ‘Mammoth Gold Project’ situated in Saskatchewan, Canada, and form the combined entity Golden Planet Mining. Originally Goldspot invested $475K cad in XCorp AI. Their equity in the combined entity GPM appreciated to $7.78M cad following the next raise, and has since ballooned to $15,53M in the most recent raise to date. At the moment Goldspot holds 28% of Golden Planet Mining with the company looking to go public in late 2021 or early 2022. Following the merger with Saskatchewan Gold Corp, Golden planet Mining has acquired ownership of the Olympus Gold Project in the Northwest Territories and the Rider Gold Project in British Columbia and commenced drilling activities &amp; regional exploration on the properties. Using Goldspot’s in-house exploration and data processing tech the claims are being further explored and drilled for more data. If good results appear GPM has a good probability of becoming a major success story for Goldspot.\n\nHow AI and Machine Learning Creates a Competitive Advantage\n\nGood companies sell a quality product, great companies solve a problem, but the very best companies solve a problem before you even know you have one. The metal/non-metal mining industry has a problem it is either unaware of, or refuses to admit. The problem: the exploration industry is unable to find new big deposits that can be economically extracted without undue environmental damage in order to replace depleted reserves of current major mining companies.\n\nExploration by junior mining is one of the great perpetual boom and bust industries. Every year, fortunes are made and lost betting on junior mining companies on the TSX Venture Exchange. Junior miners are typically smaller companies (most with a market cap well under $50 million) that secure land and mining claims in hopes of finding the next big mineral find. When a company makes a big find, the rewards are incredibly lucrative, that can in the tens of thousands of percent gains big. For years, the market unduly rewarded junior miners who found massive mineral deposits. Seemingly, the only metric that mattered was coming up with a big P&amp;P reserve in the tens of millions of ounces.\n\nBut the sad reality is that an overwhelming majority of junior mining companies fail well before mining operations can even begin on these massive mineral finds. At any given time, there are 3,000+ active junior miners trading on the TSX-V exchange. Although most junior miners experience major shifts up and down in share price, it is very rare to get a big win long-term gainer among the junior mining companies. When long-term wins do happen, it is like lightning in a bottle – with sufficient gains to make up for a large number of losses. The key to being a long-term winner is cost of extraction, not volume. For example, an operation with 2 million ounces of gold that be extracted at an AISC cost of $350 is far more attractive of an acquisition target for a major mining company than an operation with 30 million ounces of gold that can be extracted for $1,100 an ounce.\n\nSo why are so many junior mining companies fail? It isn’t necessarily that the companies have bad properties or don’t find valuable minerals (although that is possible). The reality is that junior mining companies typically fail because they simply run out of money. In order to develop a mining project all the way to production (or acquisition by a major), the junior mining company needs to find the right deposit, with the right economics, with the right timing and all within its limited financial resources. If the company has money to institute a drilling program, the junior mining company usually only has one chance to get it right and obtain a good drill result. If it does, stock price goes up and the junior miner is able to an equity raise sufficient to move on to the next stage of the process. Any faltering along the way, and the entire project (and usually the company itself) goes up in flames. Truly, it creates a “discover or die” environment. Additionally, that discover needs to be in a location and grade that suggests that it can be removed economically.\n\nWhile this environment of “discover or die” has always existed for junior miners, there are two more recent industry trends/conditions that are making it even tougher for juniors to succeed. First, mineral finds are become harder and harder to locate. The minerals being found are greater depths or in environments with less surface indicators. This means that there are less easy finds available waiting to be discovered. The second trend is for junior miners to pursue “district-scale” projects. Investors in junior miners are generally looking for companies with huge land holdings so that if there is a find, the potential payouts can be exponentially greater. At the same time, most mining laws around the world require a claim holder to invest a certain amount of money on an annual basis in developing a claim as well as pay a claim fee. These costs are not trivial and can total several million dollars on an annual basis for junior miners with large land packages. So with these additional factors, junior miners are having to look for a smaller needle in a bigger haystack that costs more money to maintain.\n\nIn this environment smaller needles in bigger haystacks, Goldspot is solving the budding problem by building a better mouse trap. With diminishing surface indicators, mining exploration companies need to effectively integrate data obtained from multiple sources. Each time you stack a different level of data on top of another set of data, the complexity does not increase linearly, rather it increases exponentially. The beauty of AI and machine learning tools is that they are able look at data from a potentially limitless pool of data and find subtle geological, geophysical or other structural indicators that collectively increase the likelihood for success. The Goldspot AI tool finds regions or structures where probability of mineralization are higher, but once a general region has been identified, the same tools are also able to narrow in on specific targets to confirm mineralization on a claim that provide a substantially higher likelihood of finding mineralization.\n\nRisks to the business\n\nEach business carries risks along with their operations. The main risks to Goldspot’s business model are listed below:\n\n**Cash Flows From Consulting Income**\n\nGoldspot currently generates revenue and cash flows from its consulting services. The availability of these sources of funds and Goldspot's ability to maintain a network and attract additional customers will depend on a number of factors, many of which are outside of Goldspot's control. A significant portion of Goldspot's revenues have come from four customers in short-term contracts. Goldspot's contracts are generally short-term and it is actively seeking to diversify its customer base with longer-term contracts. The loss of any one of its customers or the inability to attract additional customers will result in a material adverse effect on the business and may adversely affect revenues going forward.\n\n**Intellectual Property Risk**\n\nThe ownership and protection of Goldspot's intellectual property rights is a significant aspect of Goldspot's future success. Currently, Goldspot relies on trade secrets, technical know-how and proprietary information to protect its intellectual property. Goldspot also attempts to protects its intellectual property by entering into confidentiality agreements with parties that have access to it, such as business partners, collaborators, employees and consultants. Any of these parties may breach these agreements and Goldspot may not have adequate remedies for any specific breach. In addition, Goldspot's trade secrets and technical know-how, which are not protected by patents, may otherwise become known to or be independently developed by competitors, in which event Goldspot's business, financial condition and results of operation could be materially affected. An assertion by a third-party that Goldspot is infringing its intellectual property could subject Goldspot to costly and time-consuming litigation, which could harm its business. Goldspot's success depends in part upon it not infringing the intellectual property rights of others. However, Goldspot's competitors, as well as a number of other entities and individuals, may own or claim to own intellectual property relating to Goldspot's industry or, in some cases, its technology. Goldspot has not been subjected to any claims of intellectual property rights infringements in the past but as it develops more of its own applications and meets additional client specific requests, it may be exposed to greater risk in the future. Any claims or litigation could cause Goldspot to incur significant expenses, and if successfully asserted against Goldspot, could require that Goldspot pay substantial damages or ongoing revenue share payments, indemnify its customers or distributors, obtain licenses, modify products, or refund fees, any of which would deplete Goldspot's resources and adversely impact its business.\n\n**Investment Risks**\n\nThrough its investing division, Goldspot may acquire securities of public and private companies from time to time, which are primarily junior or small-cap companies. Poor investment performance could impair revenues and growth. The market values of the securities can experience significant fluctuations in the short and long term due to factors beyond Goldspot's control. Market value can be reflective of the actual or anticipated operating results of the companies and/or the general market conditions in a specific sector as a whole, such as fluctuations in commodity prices and global political and economic conditions. Goldspot's investments will be carried at fair value, and unrealized gains/losses on the securities and realized losses on the securities sold could have a material adverse impact on Goldspot's operating results. There is no assurance that Goldspot will be able to achieve or maintain any particular level of investment return, which may have a material adverse impact on its ability to attract investors. Furthermore, the junior mining space tends to be more volatile than the general market indices. This volatility combined with negative or poor performance could combine to lead to a reduction in investor interest.\n\n**Cyclical Downturn**\n\nA significant operating risk affecting Goldspot is a downturn in demand for its services due a decrease in activity in the mining industry. A severe and persistent downturn in the mining industry would have severe consequences on the business of Goldspot. In many cases, capital markets are the only source of funds available to junior mining companies and any change in the outlook for the sector or the lack of success of a specific exploration program can quickly impair the ability of these juniors to raise capital to pay for their consulting services.\n\n**Limited Operating History**\n\nGoldspot began carrying on business in 2017 and started to generate significant revenue from its operations beginning in December 31, 2018. Goldspot is therefore subject to many of the risks common to early stage enterprises, including under-capitalization, cash shortages, limitations with respect to personnel, financial, and other resources and limited revenues. There is no assurance that Goldspot will be successful in achieving a return on shareholders' investment and the likelihood of success must be considered in light of the early stage of operations.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\"The chairman of Barrick Gold Corp. made a bold prediction late last year: With the help of artificial intelligence and other digital tools, the world’s largest gold miner would become a technology company that just happened to be in mining.\"", "link": "https://www.reddit.com/r/MachineLearning/comments/ppat52/goldspot_discoveries_integrating_big_data/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "rider", "selectorShort": "rider", "MarkedSent": "goldspot discoveries: integrating big data &amp; artificial intelligence in the mining industry [project] /!/ &amp;#x200b;\n\nintroduction\n\nmining exploration is undergoing a revolution; only the mining industry hasn’t realized it yet. the insurgents leading the revolution come from goldspot discoveries, a small canadian technology company that is bringing ai/machine learning into the traditional geosciences field that has long dominated the exploration game. still an early-stage company, goldspot remains undervalued even as it has consistently outperformed expectations while delivering outstanding revenue growth and profitability. the company is well capitalized and has built a huge head start on any future competition that will take several years (at best) to close. while all of these factors would be a great story for any company, they aren’t even the best part of the goldspot story. just like the group of mit students used data analysis methodologies to stick it to the blackjack casinos (described in the book *bringing down the house* and the film *21*), goldspot is cracking the code for junior mining investment in order to rewrite the odds of the game in their favor. to put it simply, this is the moment where big data meets small miners – and one of the first hands goldspot has played (new found gold - $nfg) has already given the house a good shake.\n\ncompany overview\n\ngoldspot discoveries started as a group of data scientists out of quebec that competed in a mining technology challenge. their approach to improving mining exploration was to utilize advanced data analysis techniques to improve the probability of drilling success. this group of scientist were connected with denis laviolette and cejay kim and together they turned this new technical approach into a functioning geoscience consulting business. goldspot was officially formed in 2016, and then went public via a reverse merger in early 2019. for the last several fiscal quarters, goldspot has seen revenues skyrocket (see charts in later sections), while building an investment portfolio that would make many far larger companies green with envy. goldspot has been rewarded for its strong operational and financial performance with 8-fold gains in its stock price in the last 12 months (achieved on consistent and sustainable price gains). looking forward, goldspot has put teasers into the market of several new technologies, products in the r&amp;d pipeline, and strategic partnerships that should deliver strong shareholder value into the future.\n\ngoldspot is a technology and consultancy company that specializes in applying machine learning &amp; artificial intelligence to collect, interpret and convert data into so-called 'smart targets' that can pinpoint the exact location of potential new resource reserves.\n\ncontrary to what the company’s name would suggest, goldspot specializes in finding almost any commodity reserve. many of goldspot's current clients are gold miners and silver miners, but there is also significant demand from the lithium, copper and base metal industry for goldspot's services.\n\nthe search for new mineral reserves is not a new phenomenon. but with a dwindling number of new discoveries, the global supply chain is facing a decreasing supply and a rising demand. with fewer, smaller and more expensive discoveries, the mining sector is facing a problematic issue. goldspot is tactically responding to this with the introduction of deep learning algorithms that can highlight and identify new innovative mathematical solutions and interpretations on geological patterns. deep learning makes it possible to analyze an enormous amount of data that is virtually impossible for the human brain to analyze and interpret properly.\n\nthe new technologies have enabled goldspot to produce results that were not possible before. this significantly increases the reliability &amp; accuracy of the targets. in addition to the extreme accuracy of goldspot's results, goldspot saves its clients a lot of time and money by letting software do the bulk of the work. by reducing costly human labor and time while improving results goldspot has set up a compelling alternative to traditional methods and has proven to be a very attractive solution for mining companies.\n\ngoldspot's business model\n\n**summary**\n\none of best way to analyze goldspot’s business is to look at it as a car. the ai/machine learning (discussed in detail below) is the engine and the rest of the business model is the vehicle that is built around that engine. at its core, goldspot is a technology company. upwards of 2/3rds of the its employees work on the technical side of the business – mostly out of its location in montreal. quebec is a highly underrated hotspot of engineering and technical talent, with several top universities nearby turning out top-notch talent.\n\ngoldspot has brought onboard well over 20 phd’s in diverse but related fields such as structural geology, geochemistry, geophysics, and complex data science and so forth. the beauty of goldspot is its ability to integrate the results of these various fields into a simplified target analysis. once its geoscience tools are built, goldspot can then apply it on a wide-scale to create a competitive advantage for its clients.\n\ngoldspot's business model currently consists of 4 segments:\n\n1. consultancy services (smart target generation)\n2. investments\n3. software as a service (saas)\n4. exploration (golden planet mining)\n\nconsultancy services\n\ngoldspot is advising mining entities for target generation to find new potential reserves with the aforementioned 'smart targets' that have been derived from the in-house ai &amp; machine learning algorithms. goldspot concludes contracts with its clients that cover the costs incurred and generate an decent operating profit for goldspot that are in line with the average margins in the consultancy sector.\n\nthe consultancy turnover is growing by approximately 100% on an annual basis since goldspot’s inception and consists of time waged contracts with mining corporations. the mining corporations can be subdivided into two categories: junior miners (small mining companies that do not yet have an operational mine, but do have a piece of land, a so called claim) and majors (mining companies that already have at least one operational mine).\n\ngoldspot’s consultancy services are based on the in-house processing of historical and/or public big data sets of the client’s claim. in combination with the use of goldspot’s ai and machine learning algorithms the company is able to extract correlations &amp; recognize patterns in the big data sets that provide sustained conclusions about a client’s claim.\n\ngoldspot recently acquired the full-service field exploration firm ‘ridgeline exploration’ to provide a full-service solution to solve common inconsistent and piecemeal data collection practices that increase risk and lower efficiency across the industry. with the acquisition of ridgeline, goldspot aims to strengthen its existing consultancy business as well as vertically integrate the ability to capture key data, including airborne geophysical survey mapping, geochemistry, structural mapping and geophysics. by improving the reliability of the big data sets goldspot works with, the accuracy of the generated smart targets will considerably improve.\n\ngoldspot has provided consultancy services for big names in the sector like yamana gold, fortuna silver mines, sprott mining and vale to name a few, as well as countless junior miners among which are the names of new found gold, critical elements lithium corporation and nevada king gold corp.\n\n&amp;#x200b;\n\ninvestments\n\nbut that is only the first part of the equation. by being able to evaluate large swaths of data over a vast geographical region goldspot has an edge in being able to pick the potential winners and losers among junior mining exploration companies before everyone else. this is like having the cheat codes to the mining investment game.\n\nnow it is often so that junior miners do not have enough working capital to engage goldspot on their project. they are short on cash and cannot meet the requested rates from goldspot. goldspot has devised a smart solution for this particular problem. before entering into a negotiation with the junior miner, goldspot analyzes the claim (territory) of the junior miner using its in-house software &amp; deep learning algorithms and determines whether there is a significant probability that there is a promising reserve to be found on the claim based on their initial analysis. if that probability looks promising, goldspot offers to take equity (shares and/or warrants) in the junior miner. they participate in a 'private placement' which allows the junior miner to raise money by issuing shares and/or warrants. as a result the junior miner can pay for goldspot's consultancy services with the capital they raised. every now and then goldspot also negotiates for an nsr as part of a deal. an nsr, an abbreviation for ‘net smelter return’, is a royalty on the net gold quantity a mine produces. these nsr’s are often set around 0.5%-2%.\n\nby applying this method, goldspot has in addition to a consultancy contract, acquired an interest in the junior miner. this creates a significant synergy when goldspot delivers successful 'smart targets' and when these targets are also successfully tapped into. as a result the shares of the junior miner will increase significantly in value with goldspot having a stake in the company.\n\ne.g. one of goldspot's first clients was the junior miner new found gold. goldspot had at the time entered into a contract with new found gold and acquired 1.7m shares and an nsr of 0.5% on the claim using the aforementioned method. at that time, the price of one nfg share was $0.40. after delivering the \"smart targets\" and successful drilling, which continues to this day, the stock has now increased in value by 30 times at a price of $12 per share. as a result, goldspot's initial investment of $680,000 has appreciated to $20.4m, delivering an unrealized profit of $19.72m. the exact worth of the 0.5% nsr goldspot acquired on nfg’s claim is difficult to estimate until an exact resource estimation and a pfs (pre-feasibility study) and pea (pre-economic study). very likely though nfg's 0.5% nsr is worth something in the \"tens\" of millions but that is still very speculative. now, certainly not every junior miner will be a success story like new found gold. however goldspot’s approach on investing in junior miners significantly de-risks their junior miner portfolio in comparison to other junior miner etf’s. further elaboration on this in the next paragraph.\n\ngoldspot is very selective on what junior miners the company decides to engage with. to create the highest chance of success they’ve established a data based approach on finding the best deals on the market. they have previously referred to this as ‘resource quantamental’ and they described it as an ai-driven opportunity generator pointing goldspot to the ideal companies to work with. resource quantamental is the largest aggregate of mining data in the world and makes use of all the big data sets available on the capital markets, management compatibility and historical drilling results as well as geologic data. the output serves goldspot with the ideal companies that have the highest chance of success when goldspot engages with them.\n\nsoftware as a service\n\nto grow goldspot’s consultancy revenue the current team is becoming increasingly more efficient as they develop better skills &amp; internal work processes mature. furthermore, the company is actively hiring more staff. however, this will pose a problem in the long run. consultancy business is very employee intensive, and unlike other sectors, there is a great scarcity of people with degrees with the combination of geology &amp; data science. for goldspot however, people with these profiles are a necessity.\n\nto overcome this problem and make the in-house technology scalable and lucrative, goldspot has decided to develop &amp; acquire mining related saas products. work is currently underway for the launch of two highly technical saas products that are expected to launch in q4 2021.\n\none of those two new saas products is *litholens*, goldspot’s core imaging technology which adds value by extracting geological information from otherwise unused core photography, providing brand new data for 3d modelling and exploration purposes. core logging is an essential step in the exploration process. it is the manual systematic recording and measuring of information from drill core to determine the lithology, mineralogy, geological history, structure and alteration zones. due to being a highly manual repetitive task, core logging is subject to human error and rising costs. litholens can work with imagery from historic and recent drill core photographs, to downhole optical and acoustic televiewer files, to videos of seafloor nodule deposits used in deep-sea mining. the data inserted in litholens is processed in the cloud and the machine learning creates large and valuable new datasets from underutilized imagery and video data. the total addresable market for litholens – the so called ‘core logging market’ currently has a turnover of around $50m per year, but litholens ability to relog historical imagery could open up a opportunity closer to $500m.\n\nlitholens is a software solution that once available to the mining sector, has the potential to provide goldspot with an additional revenue stream that, unlike the majority of consulting services, is reoccurring in nature. as a result of this potential for significant recurring revenue, the litholens technology is a focal point of goldspot’s future growth.\n\ngoldspot recently enhanced its litholens development by acquiring the tech company geotic. geotic’s portfolio of 5 software tools (*geoticmine, geoticlog, geoticgraph, geoticcad and geoticfield*) offer diversified 3d modelling and core-logging, improving the way that geologists and engineers collect and analyze data. the powerful combination of *geoticlog* and *litholens* will create an industry-first core logging and ai imaging cloud solution.\n\nthe second saas product scheduled for launch in q4 2021 is called ‘minusone’ and is a software solution for creating 3-d models from geophysical data processed using deterministic and stochastic inversion methods. with this technology, goldspot's team also applies a ml (machine learning) method to provide probabilistic framework that helps to analyze uncertainty. the processed results guide exploration drilling locations and geology interpretation.\n\ngoldspot has now over 40 research and development products currently in development and is now at the point where many of these tools can be monetized on a much larger scale as external software solutions.\n\nceo.ca acquisition – the next birthplace for junior miners &amp; mining companies\n\non the 16th august 2021 goldspot announced their intent to acquire the social investor network ceo.ca. ceo.ca is an international investor website with the focus on canadian listed companies. canada is the global hub for mining entities to seek financing and there are thousands of global mining companies listed on the tsx-v exchange (toronto stock exchange).\n\n\"goldspot's focus is to unlock value in mineral exploration with data science and machine learning and we are proud to serve more than fifty global exploration companies in this endeavour. the acquisition of ceo.ca, and the establishment of a technology and media division, is strategic to that vision and provides significant economic potential to our clients and shareholders,\" commented goldspot executive chairman &amp; president denis laviolette.\n\ngolden planet mining\n\naside from taking equity in third parties, goldspot has decided to leverage their own tech &amp; brand awareness to set up their own exploration company: golden planet mining (gpm). formerly known as xcorp ai they merged with saskatchewan gold corp. to acquire the ‘mammoth gold project’ situated in saskatchewan, canada, and form the combined entity golden planet mining. originally goldspot invested $475k cad in xcorp ai. their equity in the combined entity gpm appreciated to $7.78m cad following the next raise, and has since ballooned to $15,53m in the most recent raise to date. at the moment goldspot holds 28% of golden planet mining with the company looking to go public in late 2021 or early 2022. following the merger with saskatchewan gold corp, golden planet mining has acquired ownership of the olympus gold project in the northwest territories and the -----> rider !!!  gold project in british columbia and commenced drilling activities &amp; regional exploration on the properties. using goldspot’s in-house exploration and data processing tech the claims are being further explored and drilled for more data. if good results appear gpm has a good probability of becoming a major success story for goldspot.\n\nhow ai and machine learning creates a competitive advantage\n\ngood companies sell a quality product, great companies solve a problem, but the very best companies solve a problem before you even know you have one. the metal/non-metal mining industry has a problem it is either unaware of, or refuses to admit. the problem: the exploration industry is unable to find new big deposits that can be economically extracted without undue environmental damage in order to replace depleted reserves of current major mining companies.\n\nexploration by junior mining is one of the great perpetual boom and bust industries. every year, fortunes are made and lost betting on junior mining companies on the tsx venture exchange. junior miners are typically smaller companies (most with a market cap well under $50 million) that secure land and mining claims in hopes of finding the next big mineral find. when a company makes a big find, the rewards are incredibly lucrative, that can in the tens of thousands of percent gains big. for years, the market unduly rewarded junior miners who found massive mineral deposits. seemingly, the only metric that mattered was coming up with a big p&amp;p reserve in the tens of millions of ounces.\n\nbut the sad reality is that an overwhelming majority of junior mining companies fail well before mining operations can even begin on these massive mineral finds. at any given time, there are 3,000+ active junior miners trading on the tsx-v exchange. although most junior miners experience major shifts up and down in share price, it is very rare to get a big win long-term gainer among the junior mining companies. when long-term wins do happen, it is like lightning in a bottle – with sufficient gains to make up for a large number of losses. the key to being a long-term winner is cost of extraction, not volume. for example, an operation with 2 million ounces of gold that be extracted at an aisc cost of $350 is far more attractive of an acquisition target for a major mining company than an operation with 30 million ounces of gold that can be extracted for $1,100 an ounce.\n\nso why are so many junior mining companies fail? it isn’t necessarily that the companies have bad properties or don’t find valuable minerals (although that is possible). the reality is that junior mining companies typically fail because they simply run out of money. in order to develop a mining project all the way to production (or acquisition by a major), the junior mining company needs to find the right deposit, with the right economics, with the right timing and all within its limited financial resources. if the company has money to institute a drilling program, the junior mining company usually only has one chance to get it right and obtain a good drill result. if it does, stock price goes up and the junior miner is able to an equity raise sufficient to move on to the next stage of the process. any faltering along the way, and the entire project (and usually the company itself) goes up in flames. truly, it creates a “discover or die” environment. additionally, that discover needs to be in a location and grade that suggests that it can be removed economically.\n\nwhile this environment of “discover or die” has always existed for junior miners, there are two more recent industry trends/conditions that are making it even tougher for juniors to succeed. first, mineral finds are become harder and harder to locate. the minerals being found are greater depths or in environments with less surface indicators. this means that there are less easy finds available waiting to be discovered. the second trend is for junior miners to pursue “district-scale” projects. investors in junior miners are generally looking for companies with huge land holdings so that if there is a find, the potential payouts can be exponentially greater. at the same time, most mining laws around the world require a claim holder to invest a certain amount of money on an annual basis in developing a claim as well as pay a claim fee. these costs are not trivial and can total several million dollars on an annual basis for junior miners with large land packages. so with these additional factors, junior miners are having to look for a smaller needle in a bigger haystack that costs more money to maintain.\n\nin this environment smaller needles in bigger haystacks, goldspot is solving the budding problem by building a better mouse trap. with diminishing surface indicators, mining exploration companies need to effectively integrate data obtained from multiple sources. each time you stack a different level of data on top of another set of data, the complexity does not increase linearly, rather it increases exponentially. the beauty of ai and machine learning tools is that they are able look at data from a potentially limitless pool of data and find subtle geological, geophysical or other structural indicators that collectively increase the likelihood for success. the goldspot ai tool finds regions or structures where probability of mineralization are higher, but once a general region has been identified, the same tools are also able to narrow in on specific targets to confirm mineralization on a claim that provide a substantially higher likelihood of finding mineralization.\n\nrisks to the business\n\neach business carries risks along with their operations. the main risks to goldspot’s business model are listed below:\n\n**cash flows from consulting income**\n\ngoldspot currently generates revenue and cash flows from its consulting services. the availability of these sources of funds and goldspot's ability to maintain a network and attract additional customers will depend on a number of factors, many of which are outside of goldspot's control. a significant portion of goldspot's revenues have come from four customers in short-term contracts. goldspot's contracts are generally short-term and it is actively seeking to diversify its customer base with longer-term contracts. the loss of any one of its customers or the inability to attract additional customers will result in a material adverse effect on the business and may adversely affect revenues going forward.\n\n**intellectual property risk**\n\nthe ownership and protection of goldspot's intellectual property rights is a significant aspect of goldspot's future success. currently, goldspot relies on trade secrets, technical know-how and proprietary information to protect its intellectual property. goldspot also attempts to protects its intellectual property by entering into confidentiality agreements with parties that have access to it, such as business partners, collaborators, employees and consultants. any of these parties may breach these agreements and goldspot may not have adequate remedies for any specific breach. in addition, goldspot's trade secrets and technical know-how, which are not protected by patents, may otherwise become known to or be independently developed by competitors, in which event goldspot's business, financial condition and results of operation could be materially affected. an assertion by a third-party that goldspot is infringing its intellectual property could subject goldspot to costly and time-consuming litigation, which could harm its business. goldspot's success depends in part upon it not infringing the intellectual property rights of others. however, goldspot's competitors, as well as a number of other entities and individuals, may own or claim to own intellectual property relating to goldspot's industry or, in some cases, its technology. goldspot has not been subjected to any claims of intellectual property rights infringements in the past but as it develops more of its own applications and meets additional client specific requests, it may be exposed to greater risk in the future. any claims or litigation could cause goldspot to incur significant expenses, and if successfully asserted against goldspot, could require that goldspot pay substantial damages or ongoing revenue share payments, indemnify its customers or distributors, obtain licenses, modify products, or refund fees, any of which would deplete goldspot's resources and adversely impact its business.\n\n**investment risks**\n\nthrough its investing division, goldspot may acquire securities of public and private companies from time to time, which are primarily junior or small-cap companies. poor investment performance could impair revenues and growth. the market values of the securities can experience significant fluctuations in the short and long term due to factors beyond goldspot's control. market value can be reflective of the actual or anticipated operating results of the companies and/or the general market conditions in a specific sector as a whole, such as fluctuations in commodity prices and global political and economic conditions. goldspot's investments will be carried at fair value, and unrealized gains/losses on the securities and realized losses on the securities sold could have a material adverse impact on goldspot's operating results. there is no assurance that goldspot will be able to achieve or maintain any particular level of investment return, which may have a material adverse impact on its ability to attract investors. furthermore, the junior mining space tends to be more volatile than the general market indices. this volatility combined with negative or poor performance could combine to lead to a reduction in investor interest.\n\n**cyclical downturn**\n\na significant operating risk affecting goldspot is a downturn in demand for its services due a decrease in activity in the mining industry. a severe and persistent downturn in the mining industry would have severe consequences on the business of goldspot. in many cases, capital markets are the only source of funds available to junior mining companies and any change in the outlook for the sector or the lack of success of a specific exploration program can quickly impair the ability of these juniors to raise capital to pay for their consulting services.\n\n**limited operating history**\n\ngoldspot began carrying on business in 2017 and started to generate significant revenue from its operations beginning in december 31, 2018. goldspot is therefore subject to many of the risks common to early stage enterprises, including under-capitalization, cash shortages, limitations with respect to personnel, financial, and other resources and limited revenues. there is no assurance that goldspot will be successful in achieving a return on shareholders' investment and the likelihood of success must be considered in light of the early stage of operations.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\"the chairman of barrick gold corp. made a bold prediction late last year: with the help of artificial intelligence and other digital tools, the world’s largest gold miner would become a technology company that just happened to be in mining.\"", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/ppat52/goldspot_discoveries_integrating_big_data/',)", "identifyer": 5736063, "year": "2021"}, {"autor": "sustainabledude", "date": 1631784458000, "content": "Goldspot Discoveries: Integrating Big Data &amp; Artificial Intelligence in the Mineral Exploration Game [Project] &amp; [Research] /!/  \n\n# \n\n&amp;#x200B;\n\nhttps://preview.redd.it/njc0ha603un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=ecad5d0525678c33c9f11d319a772edbf1f26b1d\n\nGeneral Information\n\n(as of 14 September 2021)\n\nMarket Cap (intraday) 111.75M\n\nEnterprise Value 60.42M\n\nTrailing P/E 3.50\n\nPrice/Book (mrq) 1.92\n\nEnterprise Value/Revenue 7.97\n\nShares Outstanding 121.47M\n\n% Held by Insiders 54.21%\n\nIntroduction\n\nMining exploration is undergoing a revolution; only the mining industry hasn’t realized it yet. The insurgents leading the revolution come from Goldspot Discoveries, a small Canadian technology company that is bringing AI/Machine Learning into the traditional geosciences field that has long dominated the exploration game. Still an early-stage company, Goldspot remains undervalued even as it has consistently outperformed expectations while delivering outstanding revenue growth and profitability. The company is well capitalized and has built a huge head start on any future competition that will take several years (at best) to close. While all of these factors would be a great story for any company, they aren’t even the best part of the Goldspot story. Just like the group of MIT students used data analysis methodologies to stick it to the blackjack casinos (described in the book *Bringing Down the House* and the film *21*), Goldspot is cracking the code for junior mining investment in order to rewrite the odds of the game in their favor. To put it simply, this is the moment where big data meets small miners – and one of the first hands Goldspot has played (New Found Gold - $NFG) has already given the house a good shake.\n\nCompany Overview\n\nGoldspot Discoveries started as a group of data scientists out of Quebec that competed in a mining technology challenge. Their approach to improving mining exploration was to utilize advanced data analysis techniques to improve the probability of drilling success. This group of scientist were connected with Denis Laviolette and Cejay Kim and together they turned this new technical approach into a functioning geoscience consulting business. Goldspot was officially formed in 2016, and then went public via a reverse merger in early 2019. For the last several fiscal quarters, Goldspot has seen revenues skyrocket (see charts in later sections), while building an investment portfolio that would make many far larger companies green with envy. Goldspot has been rewarded for its strong operational and financial performance with 8-fold gains in its stock price in the last 12 months (achieved on consistent and sustainable price gains). Looking forward, Goldspot has put teasers into the market of several new technologies, products in the r&amp;d pipeline, and strategic partnerships that should deliver strong shareholder value into the future.\n\nGoldspot is a technology and consultancy company that specializes in applying machine learning &amp; artificial intelligence to collect, interpret and convert data into so-called 'Smart Targets' that can pinpoint the exact location of potential new resource reserves.\n\nContrary to what the company’s name would suggest, Goldspot specializes in finding almost any commodity reserve. Many of Goldspot's current clients are gold miners and silver miners, but there is also significant demand from the lithium, copper and base metal industry for Goldspot's services.\n\nThe search for new mineral reserves is not a new phenomenon. But with a dwindling number of new discoveries, the global supply chain is facing a decreasing supply and a rising demand. With fewer, smaller and more expensive discoveries, the mining sector is facing a problematic issue. Goldspot is tactically responding to this with the introduction of deep learning algorithms that can highlight and identify new innovative mathematical solutions and interpretations on geological patterns. Deep learning makes it possible to analyze an enormous amount of data that is virtually impossible for the human brain to analyze and interpret properly.\n\nThe new technologies have enabled Goldspot to produce results that were not possible before. This significantly increases the reliability &amp; accuracy of the targets. In addition to the extreme accuracy of Goldspot's results, Goldspot saves its clients a lot of time and money by letting software do the bulk of the work. By reducing costly human labor and time while improving results Goldspot has set up a compelling alternative to traditional methods and has proven to be a very attractive solution for mining companies.\n\nGoldspot's Business Model\n\n**Summary**\n\nOne of best way to analyze Goldspot’s business is to look at it as a car. The AI/Machine Learning (discussed in detail below) is the engine and the rest of the business model is the vehicle that is built around that engine. At its core, Goldspot is a technology company. Upwards of 2/3rds of the its employees work on the technical side of the business – mostly out of its location in Montreal. Quebec is a highly underrated hotspot of engineering and technical talent, with several top universities nearby turning out top-notch talent.\n\nGoldspot has brought onboard well over 20 PhD’s in diverse but related fields such as structural geology, geochemistry, geophysics, and complex data science and so forth. The beauty of Goldspot is its ability to integrate the results of these various fields into a simplified target analysis. Once its geoscience tools are built, Goldspot can then apply it on a wide-scale to create a competitive advantage for its clients.\n\nGoldspot's business model currently consists of 4 segments:\n\n1. Consultancy Services (Smart target generation)\n2. Investments\n3. Software as a Service (SaaS)\n4. Exploration (Golden Planet Mining)\n\nConsultancy Services\n\nGoldspot is advising mining entities for target generation to find new potential reserves with the aforementioned 'Smart Targets' that have been derived from the in-house AI &amp; machine learning algorithms. Goldspot concludes contracts with its clients that cover the costs incurred and generate an decent operating profit for Goldspot that are in line with the average margins in the consultancy sector.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/txhz44023un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=683157c7b380c5a0d544942f7e91c6e8259c7b31\n\n*Figure 1: Growth of Goldspot's Consultancy revenue*\n\nThe Consultancy turnover is growing by approximately 100% on an annual basis since Goldspot’s inception and consists of time waged contracts with mining corporations. The mining corporations can be subdivided into two categories: Junior miners (small mining companies that do not yet have an operational mine, but do have a piece of land, a so called claim) and Majors (mining companies that already have at least one operational mine).\n\nGoldspot’s Consultancy services are based on the in-house processing of historical and/or public big data sets of the client’s claim. In combination with the use of Goldspot’s AI and machine learning algorithms the company is able to extract correlations &amp; recognize patterns in the big data sets that provide sustained conclusions about a client’s claim.\n\nGoldspot recently acquired the full-service field exploration firm ‘Ridgeline Exploration’ to provide a full-service solution to solve common inconsistent and piecemeal data collection practices that increase risk and lower efficiency across the industry. With the acquisition of Ridgeline, GoldSpot aims to strengthen its existing consultancy business as well as vertically integrate the ability to capture key data, including airborne geophysical survey mapping, geochemistry, structural mapping and geophysics. By improving the reliability of the big data sets Goldspot works with, the accuracy of the generated Smart Targets will considerably improve.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cz8ouao23un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=b70601b159e2c11de720e23d24dfecfc51336a9c\n\n*Figure 2 Vertical Integration using Ridgeline Exploration Services*\n\nGoldspot has provided consultancy services for big names in the sector like Yamana Gold, Fortuna Silver Mines, Sprott Mining and Vale to name a few, as well as countless Junior Miners among which are the names of New Found Gold, Critical Elements Lithium Corporation and Nevada King Gold Corp.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/307b9b933un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=48487637b172fc8de15a98ea1d8152758a5550a7\n\nInvestments\n\nBut that is only the first part of the equation. By being able to evaluate large swaths of data over a vast geographical region Goldspot has an edge in being able to pick the potential winners and losers among junior mining exploration companies before everyone else. This is like having the cheat codes to the mining investment game.\n\nNow it is often so that Junior miners do not have enough working capital to engage Goldspot on their project. They are short on cash and cannot meet the requested rates from Goldspot. Goldspot has devised a smart solution for this particular problem. Before entering into a negotiation with the Junior miner, Goldspot analyzes the claim (territory) of the Junior miner using its in-house software &amp; deep learning algorithms and determines whether there is a significant probability that there is a promising reserve to be found on the claim based on their initial analysis. If that probability looks promising, Goldspot offers to take equity (shares and/or warrants) in the Junior Miner. They participate in a 'Private Placement' which allows the Junior Miner to raise money by issuing shares and/or warrants. As a result the Junior Miner can pay for Goldspot's consultancy services with the capital they raised. Every now and then Goldspot also negotiates for an NSR as part of a deal. An NSR, an abbreviation for ‘Net Smelter Return’, is a royalty on the net gold quantity a mine produces. These NSR’s are often set around 0.5%-2%.\n\nBy applying this method, Goldspot has in addition to a consultancy contract, acquired an interest in the Junior miner. This creates a significant synergy when Goldspot delivers successful 'Smart Targets' and when these targets are also successfully tapped into. As a result the shares of the Junior Miner will increase significantly in value with Goldspot having a stake in the company.\n\nE.g. One of Goldspot's first clients was the junior miner New Found Gold. Goldspot had at the time entered into a contract with New Found Gold and acquired 1.7M shares and an NSR of 0.5% on the claim using the aforementioned method. At that time, the price of one NFG share was $0.40. After delivering the \"Smart Targets\" and successful drilling, which continues to this day, the stock has now increased in value by 30 times at a price of $12 per share. As a result, Goldspot's initial investment of $680,000 has appreciated to $20.4M, delivering an unrealized profit of $19.72M. The exact worth of the 0.5% NSR Goldspot acquired on NFG’s claim is difficult to estimate until an exact resource estimation and a PFS (Pre-Feasibility Study) and PEA (Pre-Economic Study). Very likely though NFG's 0.5% NSR is worth something in the \"tens\" of millions but that is still very speculative. Now, certainly not every Junior Miner will be a success story like New Found Gold. However Goldspot’s approach on investing in Junior Miners significantly de-risks their Junior Miner portfolio in comparison to other Junior Miner ETF’s. Further elaboration on this in the next paragraph.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qin6e0z33un71.png?width=598&amp;format=png&amp;auto=webp&amp;s=94d6e21bf66afae334471c23301a1e9447d18295\n\n*Figure 3: New Found Gold equity position when Goldspot entered the agreement in 2019 and in 2021 after Goldspot successfully delivered numerous drill targets that where successfully tapped into.*\n\nGoldspot is very selective on what Junior Miners the company decides to engage with. To create the highest chance of success they’ve established a data based approach on finding the best deals on the market. They have previously referred to this as ‘Resource Quantamental’ and they described it as an AI-driven opportunity generator pointing Goldspot to the ideal companies to work with. Resource Quantamental is the largest aggregate of mining data in the world and makes use of all the big data sets available on the capital markets, management compatibility and historical drilling results as well as geologic data. The output serves Goldspot with the ideal companies that have the highest chance of success when Goldspot engages with them.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v1olwgl43un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=e79fa25fffa64bf8eebd91da0cad06f364087eee\n\n*Figure 4: Investment Performance of Goldspot’s portfolio compared to the GDXJ (VanEck Vectors Junior Gold Miners ETF) and the TSX.*\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3ujslx653un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=9326242c8825c0964140f06f3a32b0166203810b\n\n*Figure 6: Selection of Goldspot’s equity positions in Junior Miners &amp; Royalty Positions. Note: This is not the whole portfolio only a few selected positions. The whole portfolio has not been made public (yet) due to competitive reasons as mentioned by the company.*\n\nSoftware as a Service\n\nTo grow Goldspot’s consultancy revenue the current team is becoming increasingly more efficient as they develop better skills &amp; internal work processes mature. Furthermore, the company is actively hiring more staff. However, this will pose a problem in the long run. Consultancy business is very employee intensive, and unlike other sectors, there is a great scarcity of people with degrees with the combination of Geology &amp; Data Science. For Goldspot however, people with these profiles are a necessity.\n\nTo overcome this problem and make the in-house technology scalable and lucrative, Goldspot has decided to develop &amp; acquire mining related SaaS products. Work is currently underway for the launch of two highly technical SaaS products that are expected to launch in Q4 2021.\n\nOne of those two new SaaS products is *LithoLens*, Goldspot’s core imaging technology which adds value by extracting geological information from otherwise unused core photography, providing brand new data for 3D modelling and exploration purposes. Core logging is an essential step in the exploration process. It is the manual systematic recording and measuring of information from drill core to determine the lithology, mineralogy, geological history, structure and alteration zones. Due to being a highly manual repetitive task, core logging is subject to human error and rising costs. Litholens can work with imagery from historic and recent drill core photographs, to downhole optical and acoustic televiewer files, to videos of seafloor nodule deposits used in deep-sea mining. The data inserted in Litholens is processed in the cloud and the machine learning creates large and valuable new datasets from underutilized imagery and video data. The total addresable market for Litholens – the so called ‘core logging market’ currently has a turnover of around $50M per year, but Litholens ability to relog historical imagery could open up a opportunity closer to $500M.\n\nLithoLens is a software solution that once available to the mining sector, has the potential to provide Goldspot with an additional revenue stream that, unlike the majority of consulting services, is reoccurring in nature. As a result of this potential for significant recurring revenue, the LithoLens technology is a focal point of Goldspot’s future growth.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xbc3cqv53un71.png?width=194&amp;format=png&amp;auto=webp&amp;s=4ab6ee294fd0110024dfc23bbc7ca3c73965a488\n\ncore logging\n\n&amp;#x200B;\n\nhttps://preview.redd.it/il6i5rd63un71.png?width=326&amp;format=png&amp;auto=webp&amp;s=db083a73df0d0a88c424ed1c4678467ad4cb9347\n\ncore logging analytics\n\nGoldspot recently enhanced its Litholens development by acquiring the tech company Geotic. Geotic’s portfolio of 5 software tools (*GeoticMine, GeoticLog, GeoticGraph, GeoticCAD and GeoticField*) offer diversified 3D modelling and core-logging, improving the way that Geologists and Engineers collect and analyze data. The powerful combination of *GeoticLog* and *LithoLens* will create an industry-first core logging and AI imaging cloud solution.\n\nThe second SaaS product scheduled for launch in Q4 2021 is called ‘MinusOne’ and is a software solution for creating 3-D models from geophysical data processed using deterministic and stochastic inversion methods. With this technology, Goldspot's team also applies a ML (machine learning) method to provide probabilistic framework that helps to analyze uncertainty. The processed results guide exploration drilling locations and geology interpretation.\n\nGoldspot has now over 40 research and development products currently in development and is now at the point where many of these tools can be monetized on a much larger scale as external software solutions.\n\nCEO.CA acquisition – the next birthplace for Junior Miners &amp; mining companies\n\nOn the 16th August 2021 Goldspot announced their intent to acquire the social investor network CEO.CA. CEO.CA is an international investor website with the focus on Canadian listed companies. Canada is the global hub for mining entities to seek financing and there are thousands of global mining companies listed on the TSX-V exchange (Toronto Stock Exchange).\n\n\"GoldSpot's focus is to unlock value in mineral exploration with data science and machine learning and we are proud to serve more than fifty global exploration companies in this endeavour. The acquisition of CEO.CA, and the establishment of a technology and media division, is strategic to that vision and provides significant economic potential to our clients and shareholders,\" commented GoldSpot Executive Chairman &amp; President Denis Laviolette.\n\nGolden Planet Mining\n\nAside from taking equity in third parties, Goldspot has decided to leverage their own tech &amp; brand awareness to set up their own exploration company: Golden Planet Mining (GPM). Formerly known as XCorp AI they merged with Saskatchewan Gold Corp. to acquire the ‘Mammoth Gold Project’ situated in Saskatchewan, Canada, and form the combined entity Golden Planet Mining. Originally Goldspot invested $475K cad in XCorp AI. Their equity in the combined entity GPM appreciated to $7.78M cad following the next raise, and has since ballooned to $15,53M in the most recent raise to date. At the moment Goldspot holds 28% of Golden Planet Mining with the company looking to go public in late 2021 or early 2022. Following the merger with Saskatchewan Gold Corp, Golden planet Mining has acquired ownership of the Olympus Gold Project in the Northwest Territories and the Rider Gold Project in British Columbia and commenced drilling activities &amp; regional exploration on the properties. Using Goldspot’s in-house exploration and data processing tech the claims are being further explored and drilled for more data. If good results appear GPM has a good probability of becoming a major success story for Goldspot.\n\nHow AI and Machine Learning Creates a Competitive Advantage\n\nGood companies sell a quality product, great companies solve a problem, but the very best companies solve a problem before you even know you have one. The metal/non-metal mining industry has a problem it is either unaware of, or refuses to admit. The problem: the exploration industry is unable to find new big deposits that can be economically extracted without undue environmental damage in order to replace depleted reserves of current major mining companies.\n\nExploration by junior mining is one of the great perpetual boom and bust industries. Every year, fortunes are made and lost betting on junior mining companies on the TSX Venture Exchange. Junior miners are typically smaller companies (most with a market cap well under $50 million) that secure land and mining claims in hopes of finding the next big mineral find. When a company makes a big find, the rewards are incredibly lucrative, that can in the tens of thousands of percent gains big. For years, the market unduly rewarded junior miners who found massive mineral deposits. Seemingly, the only metric that mattered was coming up with a big P&amp;P reserve in the tens of millions of ounces.\n\nBut the sad reality is that an overwhelming majority of junior mining companies fail well before mining operations can even begin on these massive mineral finds. At any given time, there are 3,000+ active junior miners trading on the TSX-V exchange. Although most junior miners experience major shifts up and down in share price, it is very rare to get a big win long-term gainer among the junior mining companies. When long-term wins do happen, it is like lightning in a bottle – with sufficient gains to make up for a large number of losses. The key to being a long-term winner is cost of extraction, not volume. For example, an operation with 2 million ounces of gold that be extracted at an AISC cost of $350 is far more attractive of an acquisition target for a major mining company than an operation with 30 million ounces of gold that can be extracted for $1,100 an ounce.\n\nSo why are so many junior mining companies fail? It isn’t necessarily that the companies have bad properties or don’t find valuable minerals (although that is possible). The reality is that junior mining companies typically fail because they simply run out of money. In order to develop a mining project all the way to production (or acquisition by a major), the junior mining company needs to find the right deposit, with the right economics, with the right timing and all within its limited financial resources. If the company has money to institute a drilling program, the junior mining company usually only has one chance to get it right and obtain a good drill result. If it does, stock price goes up and the junior miner is able to an equity raise sufficient to move on to the next stage of the process. Any faltering along the way, and the entire project (and usually the company itself) goes up in flames. Truly, it creates a “discover or die” environment. Additionally, that discover needs to be in a location and grade that suggests that it can be removed economically.\n\nWhile this environment of “discover or die” has always existed for junior miners, there are two more recent industry trends/conditions that are making it even tougher for juniors to succeed. First, mineral finds are become harder and harder to locate. The minerals being found are greater depths or in environments with less surface indicators. This means that there are less easy finds available waiting to be discovered. The second trend is for junior miners to pursue “district-scale” projects. Investors in junior miners are generally looking for companies with huge land holdings so that if there is a find, the potential payouts can be exponentially greater. At the same time, most mining laws around the world require a claim holder to invest a certain amount of money on an annual basis in developing a claim as well as pay a claim fee. These costs are not trivial and can total several million dollars on an annual basis for junior miners with large land packages. So with these additional factors, junior miners are having to look for a smaller needle in a bigger haystack that costs more money to maintain.\n\nIn this environment smaller needles in bigger haystacks, Goldspot is solving the budding problem by building a better mouse trap. With diminishing surface indicators, mining exploration companies need to effectively integrate data obtained from multiple sources. Each time you stack a different level of data on top of another set of data, the complexity does not increase linearly, rather it increases exponentially. The beauty of AI and machine learning tools is that they are able look at data from a potentially limitless pool of data and find subtle geological, geophysical or other structural indicators that collectively increase the likelihood for success. The Goldspot AI tool finds regions or structures where probability of mineralization are higher, but once a general region has been identified, the same tools are also able to narrow in on specific targets to confirm mineralization on a claim that provide a substantially higher likelihood of finding mineralization.\n\nFinancials\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9a629dc73un71.png?width=633&amp;format=png&amp;auto=webp&amp;s=e2b6993834100006633d0e729d6e432934b79709\n\nRisks to the business\n\nEach business carries risks along with their operations. The main risks to Goldspot’s business model are listed below:\n\n**Cash Flows From Consulting Income**\n\nGoldspot currently generates revenue and cash flows from its consulting services. The availability of these sources of funds and Goldspot's ability to maintain a network and attract additional customers will depend on a number of factors, many of which are outside of Goldspot's control. A significant portion of Goldspot's revenues have come from four customers in short-term contracts. Goldspot's contracts are generally short-term and it is actively seeking to diversify its customer base with longer-term contracts. The loss of any one of its customers or the inability to attract additional customers will result in a material adverse effect on the business and may adversely affect revenues going forward.\n\n**Intellectual Property Risk**\n\nThe ownership and protection of Goldspot's intellectual property rights is a significant aspect of Goldspot's future success. Currently, Goldspot relies on trade secrets, technical know-how and proprietary information to protect its intellectual property. Goldspot also attempts to protects its intellectual property by entering into confidentiality agreements with parties that have access to it, such as business partners, collaborators, employees and consultants. Any of these parties may breach these agreements and Goldspot may not have adequate remedies for any specific breach. In addition, Goldspot's trade secrets and technical know-how, which are not protected by patents, may otherwise become known to or be independently developed by competitors, in which event Goldspot's business, financial condition and results of operation could be materially affected. An assertion by a third-party that Goldspot is infringing its intellectual property could subject Goldspot to costly and time-consuming litigation, which could harm its business. Goldspot's success depends in part upon it not infringing the intellectual property rights of others. However, Goldspot's competitors, as well as a number of other entities and individuals, may own or claim to own intellectual property relating to Goldspot's industry or, in some cases, its technology. Goldspot has not been subjected to any claims of intellectual property rights infringements in the past but as it develops more of its own applications and meets additional client specific requests, it may be exposed to greater risk in the future. Any claims or litigation could cause Goldspot to incur significant expenses, and if successfully asserted against Goldspot, could require that Goldspot pay substantial damages or ongoing revenue share payments, indemnify its customers or distributors, obtain licenses, modify products, or refund fees, any of which would deplete Goldspot's resources and adversely impact its business.\n\n**Investment Risks**\n\nThrough its investing division, Goldspot may acquire securities of public and private companies from time to time, which are primarily junior or small-cap companies. Poor investment performance could impair revenues and growth. The market values of the securities can experience significant fluctuations in the short and long term due to factors beyond Goldspot's control. Market value can be reflective of the actual or anticipated operating results of the companies and/or the general market conditions in a specific sector as a whole, such as fluctuations in commodity prices and global political and economic conditions. Goldspot's investments will be carried at fair value, and unrealized gains/losses on the securities and realized losses on the securities sold could have a material adverse impact on Goldspot's operating results. There is no assurance that Goldspot will be able to achieve or maintain any particular level of investment return, which may have a material adverse impact on its ability to attract investors. Furthermore, the junior mining space tends to be more volatile than the general market indices. This volatility combined with negative or poor performance could combine to lead to a reduction in investor interest.\n\n**Cyclical Downturn**\n\nA significant operating risk affecting Goldspot is a downturn in demand for its services due a decrease in activity in the mining industry. A severe and persistent downturn in the mining industry would have severe consequences on the business of Goldspot. In many cases, capital markets are the only source of funds available to junior mining companies and any change in the outlook for the sector or the lack of success of a specific exploration program can quickly impair the ability of these juniors to raise capital to pay for their consulting services.\n\n**Limited Operating History**\n\nGoldspot began carrying on business in 2017 and started to generate significant revenue from its operations beginning in December 31, 2018. Goldspot is therefore subject to many of the risks common to early stage enterprises, including under-capitalization, cash shortages, limitations with respect to personnel, financial, and other resources and limited revenues. There is no assurance that Goldspot will be successful in achieving a return on shareholders' investment and the likelihood of success must be considered in light of the early stage of operations.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\"The chairman of Barrick Gold Corp. made a bold prediction late last year: With the help of artificial intelligence and other digital tools, the world’s largest gold miner would become a technology company that just happened to be in mining.\"\n\n**If you have a background in software analytics / AI / deep and/or machine learning feel free to contact Goldspot for career opportunities:** [**https://goldspot.ca/contact-us/**](https://goldspot.ca/contact-us/)", "link": "https://www.reddit.com/r/MachineLearning/comments/pp9x9h/goldspot_discoveries_integrating_big_data/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "rider", "selectorShort": "rider", "MarkedSent": "goldspot discoveries: integrating big data &amp; artificial intelligence in the mineral exploration game [project] &amp; [research] /!/  \n\n# \n\n&amp;#x200b;\n\nhttps://preview.redd.it/njc0ha603un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=ecad5d0525678c33c9f11d319a772edbf1f26b1d\n\ngeneral information\n\n(as of 14 september 2021)\n\nmarket cap (intraday) 111.75m\n\nenterprise value 60.42m\n\ntrailing p/e 3.50\n\nprice/book (mrq) 1.92\n\nenterprise value/revenue 7.97\n\nshares outstanding 121.47m\n\n% held by insiders 54.21%\n\nintroduction\n\nmining exploration is undergoing a revolution; only the mining industry hasn’t realized it yet. the insurgents leading the revolution come from goldspot discoveries, a small canadian technology company that is bringing ai/machine learning into the traditional geosciences field that has long dominated the exploration game. still an early-stage company, goldspot remains undervalued even as it has consistently outperformed expectations while delivering outstanding revenue growth and profitability. the company is well capitalized and has built a huge head start on any future competition that will take several years (at best) to close. while all of these factors would be a great story for any company, they aren’t even the best part of the goldspot story. just like the group of mit students used data analysis methodologies to stick it to the blackjack casinos (described in the book *bringing down the house* and the film *21*), goldspot is cracking the code for junior mining investment in order to rewrite the odds of the game in their favor. to put it simply, this is the moment where big data meets small miners – and one of the first hands goldspot has played (new found gold - $nfg) has already given the house a good shake.\n\ncompany overview\n\ngoldspot discoveries started as a group of data scientists out of quebec that competed in a mining technology challenge. their approach to improving mining exploration was to utilize advanced data analysis techniques to improve the probability of drilling success. this group of scientist were connected with denis laviolette and cejay kim and together they turned this new technical approach into a functioning geoscience consulting business. goldspot was officially formed in 2016, and then went public via a reverse merger in early 2019. for the last several fiscal quarters, goldspot has seen revenues skyrocket (see charts in later sections), while building an investment portfolio that would make many far larger companies green with envy. goldspot has been rewarded for its strong operational and financial performance with 8-fold gains in its stock price in the last 12 months (achieved on consistent and sustainable price gains). looking forward, goldspot has put teasers into the market of several new technologies, products in the r&amp;d pipeline, and strategic partnerships that should deliver strong shareholder value into the future.\n\ngoldspot is a technology and consultancy company that specializes in applying machine learning &amp; artificial intelligence to collect, interpret and convert data into so-called 'smart targets' that can pinpoint the exact location of potential new resource reserves.\n\ncontrary to what the company’s name would suggest, goldspot specializes in finding almost any commodity reserve. many of goldspot's current clients are gold miners and silver miners, but there is also significant demand from the lithium, copper and base metal industry for goldspot's services.\n\nthe search for new mineral reserves is not a new phenomenon. but with a dwindling number of new discoveries, the global supply chain is facing a decreasing supply and a rising demand. with fewer, smaller and more expensive discoveries, the mining sector is facing a problematic issue. goldspot is tactically responding to this with the introduction of deep learning algorithms that can highlight and identify new innovative mathematical solutions and interpretations on geological patterns. deep learning makes it possible to analyze an enormous amount of data that is virtually impossible for the human brain to analyze and interpret properly.\n\nthe new technologies have enabled goldspot to produce results that were not possible before. this significantly increases the reliability &amp; accuracy of the targets. in addition to the extreme accuracy of goldspot's results, goldspot saves its clients a lot of time and money by letting software do the bulk of the work. by reducing costly human labor and time while improving results goldspot has set up a compelling alternative to traditional methods and has proven to be a very attractive solution for mining companies.\n\ngoldspot's business model\n\n**summary**\n\none of best way to analyze goldspot’s business is to look at it as a car. the ai/machine learning (discussed in detail below) is the engine and the rest of the business model is the vehicle that is built around that engine. at its core, goldspot is a technology company. upwards of 2/3rds of the its employees work on the technical side of the business – mostly out of its location in montreal. quebec is a highly underrated hotspot of engineering and technical talent, with several top universities nearby turning out top-notch talent.\n\ngoldspot has brought onboard well over 20 phd’s in diverse but related fields such as structural geology, geochemistry, geophysics, and complex data science and so forth. the beauty of goldspot is its ability to integrate the results of these various fields into a simplified target analysis. once its geoscience tools are built, goldspot can then apply it on a wide-scale to create a competitive advantage for its clients.\n\ngoldspot's business model currently consists of 4 segments:\n\n1. consultancy services (smart target generation)\n2. investments\n3. software as a service (saas)\n4. exploration (golden planet mining)\n\nconsultancy services\n\ngoldspot is advising mining entities for target generation to find new potential reserves with the aforementioned 'smart targets' that have been derived from the in-house ai &amp; machine learning algorithms. goldspot concludes contracts with its clients that cover the costs incurred and generate an decent operating profit for goldspot that are in line with the average margins in the consultancy sector.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/txhz44023un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=683157c7b380c5a0d544942f7e91c6e8259c7b31\n\n*figure 1: growth of goldspot's consultancy revenue*\n\nthe consultancy turnover is growing by approximately 100% on an annual basis since goldspot’s inception and consists of time waged contracts with mining corporations. the mining corporations can be subdivided into two categories: junior miners (small mining companies that do not yet have an operational mine, but do have a piece of land, a so called claim) and majors (mining companies that already have at least one operational mine).\n\ngoldspot’s consultancy services are based on the in-house processing of historical and/or public big data sets of the client’s claim. in combination with the use of goldspot’s ai and machine learning algorithms the company is able to extract correlations &amp; recognize patterns in the big data sets that provide sustained conclusions about a client’s claim.\n\ngoldspot recently acquired the full-service field exploration firm ‘ridgeline exploration’ to provide a full-service solution to solve common inconsistent and piecemeal data collection practices that increase risk and lower efficiency across the industry. with the acquisition of ridgeline, goldspot aims to strengthen its existing consultancy business as well as vertically integrate the ability to capture key data, including airborne geophysical survey mapping, geochemistry, structural mapping and geophysics. by improving the reliability of the big data sets goldspot works with, the accuracy of the generated smart targets will considerably improve.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/cz8ouao23un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=b70601b159e2c11de720e23d24dfecfc51336a9c\n\n*figure 2 vertical integration using ridgeline exploration services*\n\ngoldspot has provided consultancy services for big names in the sector like yamana gold, fortuna silver mines, sprott mining and vale to name a few, as well as countless junior miners among which are the names of new found gold, critical elements lithium corporation and nevada king gold corp.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/307b9b933un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=48487637b172fc8de15a98ea1d8152758a5550a7\n\ninvestments\n\nbut that is only the first part of the equation. by being able to evaluate large swaths of data over a vast geographical region goldspot has an edge in being able to pick the potential winners and losers among junior mining exploration companies before everyone else. this is like having the cheat codes to the mining investment game.\n\nnow it is often so that junior miners do not have enough working capital to engage goldspot on their project. they are short on cash and cannot meet the requested rates from goldspot. goldspot has devised a smart solution for this particular problem. before entering into a negotiation with the junior miner, goldspot analyzes the claim (territory) of the junior miner using its in-house software &amp; deep learning algorithms and determines whether there is a significant probability that there is a promising reserve to be found on the claim based on their initial analysis. if that probability looks promising, goldspot offers to take equity (shares and/or warrants) in the junior miner. they participate in a 'private placement' which allows the junior miner to raise money by issuing shares and/or warrants. as a result the junior miner can pay for goldspot's consultancy services with the capital they raised. every now and then goldspot also negotiates for an nsr as part of a deal. an nsr, an abbreviation for ‘net smelter return’, is a royalty on the net gold quantity a mine produces. these nsr’s are often set around 0.5%-2%.\n\nby applying this method, goldspot has in addition to a consultancy contract, acquired an interest in the junior miner. this creates a significant synergy when goldspot delivers successful 'smart targets' and when these targets are also successfully tapped into. as a result the shares of the junior miner will increase significantly in value with goldspot having a stake in the company.\n\ne.g. one of goldspot's first clients was the junior miner new found gold. goldspot had at the time entered into a contract with new found gold and acquired 1.7m shares and an nsr of 0.5% on the claim using the aforementioned method. at that time, the price of one nfg share was $0.40. after delivering the \"smart targets\" and successful drilling, which continues to this day, the stock has now increased in value by 30 times at a price of $12 per share. as a result, goldspot's initial investment of $680,000 has appreciated to $20.4m, delivering an unrealized profit of $19.72m. the exact worth of the 0.5% nsr goldspot acquired on nfg’s claim is difficult to estimate until an exact resource estimation and a pfs (pre-feasibility study) and pea (pre-economic study). very likely though nfg's 0.5% nsr is worth something in the \"tens\" of millions but that is still very speculative. now, certainly not every junior miner will be a success story like new found gold. however goldspot’s approach on investing in junior miners significantly de-risks their junior miner portfolio in comparison to other junior miner etf’s. further elaboration on this in the next paragraph.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qin6e0z33un71.png?width=598&amp;format=png&amp;auto=webp&amp;s=94d6e21bf66afae334471c23301a1e9447d18295\n\n*figure 3: new found gold equity position when goldspot entered the agreement in 2019 and in 2021 after goldspot successfully delivered numerous drill targets that where successfully tapped into.*\n\ngoldspot is very selective on what junior miners the company decides to engage with. to create the highest chance of success they’ve established a data based approach on finding the best deals on the market. they have previously referred to this as ‘resource quantamental’ and they described it as an ai-driven opportunity generator pointing goldspot to the ideal companies to work with. resource quantamental is the largest aggregate of mining data in the world and makes use of all the big data sets available on the capital markets, management compatibility and historical drilling results as well as geologic data. the output serves goldspot with the ideal companies that have the highest chance of success when goldspot engages with them.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/v1olwgl43un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=e79fa25fffa64bf8eebd91da0cad06f364087eee\n\n*figure 4: investment performance of goldspot’s portfolio compared to the gdxj (vaneck vectors junior gold miners etf) and the tsx.*\n\n&amp;#x200b;\n\nhttps://preview.redd.it/3ujslx653un71.png?width=605&amp;format=png&amp;auto=webp&amp;s=9326242c8825c0964140f06f3a32b0166203810b\n\n*figure 6: selection of goldspot’s equity positions in junior miners &amp; royalty positions. note: this is not the whole portfolio only a few selected positions. the whole portfolio has not been made public (yet) due to competitive reasons as mentioned by the company.*\n\nsoftware as a service\n\nto grow goldspot’s consultancy revenue the current team is becoming increasingly more efficient as they develop better skills &amp; internal work processes mature. furthermore, the company is actively hiring more staff. however, this will pose a problem in the long run. consultancy business is very employee intensive, and unlike other sectors, there is a great scarcity of people with degrees with the combination of geology &amp; data science. for goldspot however, people with these profiles are a necessity.\n\nto overcome this problem and make the in-house technology scalable and lucrative, goldspot has decided to develop &amp; acquire mining related saas products. work is currently underway for the launch of two highly technical saas products that are expected to launch in q4 2021.\n\none of those two new saas products is *litholens*, goldspot’s core imaging technology which adds value by extracting geological information from otherwise unused core photography, providing brand new data for 3d modelling and exploration purposes. core logging is an essential step in the exploration process. it is the manual systematic recording and measuring of information from drill core to determine the lithology, mineralogy, geological history, structure and alteration zones. due to being a highly manual repetitive task, core logging is subject to human error and rising costs. litholens can work with imagery from historic and recent drill core photographs, to downhole optical and acoustic televiewer files, to videos of seafloor nodule deposits used in deep-sea mining. the data inserted in litholens is processed in the cloud and the machine learning creates large and valuable new datasets from underutilized imagery and video data. the total addresable market for litholens – the so called ‘core logging market’ currently has a turnover of around $50m per year, but litholens ability to relog historical imagery could open up a opportunity closer to $500m.\n\nlitholens is a software solution that once available to the mining sector, has the potential to provide goldspot with an additional revenue stream that, unlike the majority of consulting services, is reoccurring in nature. as a result of this potential for significant recurring revenue, the litholens technology is a focal point of goldspot’s future growth.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/xbc3cqv53un71.png?width=194&amp;format=png&amp;auto=webp&amp;s=4ab6ee294fd0110024dfc23bbc7ca3c73965a488\n\ncore logging\n\n&amp;#x200b;\n\nhttps://preview.redd.it/il6i5rd63un71.png?width=326&amp;format=png&amp;auto=webp&amp;s=db083a73df0d0a88c424ed1c4678467ad4cb9347\n\ncore logging analytics\n\ngoldspot recently enhanced its litholens development by acquiring the tech company geotic. geotic’s portfolio of 5 software tools (*geoticmine, geoticlog, geoticgraph, geoticcad and geoticfield*) offer diversified 3d modelling and core-logging, improving the way that geologists and engineers collect and analyze data. the powerful combination of *geoticlog* and *litholens* will create an industry-first core logging and ai imaging cloud solution.\n\nthe second saas product scheduled for launch in q4 2021 is called ‘minusone’ and is a software solution for creating 3-d models from geophysical data processed using deterministic and stochastic inversion methods. with this technology, goldspot's team also applies a ml (machine learning) method to provide probabilistic framework that helps to analyze uncertainty. the processed results guide exploration drilling locations and geology interpretation.\n\ngoldspot has now over 40 research and development products currently in development and is now at the point where many of these tools can be monetized on a much larger scale as external software solutions.\n\nceo.ca acquisition – the next birthplace for junior miners &amp; mining companies\n\non the 16th august 2021 goldspot announced their intent to acquire the social investor network ceo.ca. ceo.ca is an international investor website with the focus on canadian listed companies. canada is the global hub for mining entities to seek financing and there are thousands of global mining companies listed on the tsx-v exchange (toronto stock exchange).\n\n\"goldspot's focus is to unlock value in mineral exploration with data science and machine learning and we are proud to serve more than fifty global exploration companies in this endeavour. the acquisition of ceo.ca, and the establishment of a technology and media division, is strategic to that vision and provides significant economic potential to our clients and shareholders,\" commented goldspot executive chairman &amp; president denis laviolette.\n\ngolden planet mining\n\naside from taking equity in third parties, goldspot has decided to leverage their own tech &amp; brand awareness to set up their own exploration company: golden planet mining (gpm). formerly known as xcorp ai they merged with saskatchewan gold corp. to acquire the ‘mammoth gold project’ situated in saskatchewan, canada, and form the combined entity golden planet mining. originally goldspot invested $475k cad in xcorp ai. their equity in the combined entity gpm appreciated to $7.78m cad following the next raise, and has since ballooned to $15,53m in the most recent raise to date. at the moment goldspot holds 28% of golden planet mining with the company looking to go public in late 2021 or early 2022. following the merger with saskatchewan gold corp, golden planet mining has acquired ownership of the olympus gold project in the northwest territories and the -----> rider !!!  gold project in british columbia and commenced drilling activities &amp; regional exploration on the properties. using goldspot’s in-house exploration and data processing tech the claims are being further explored and drilled for more data. if good results appear gpm has a good probability of becoming a major success story for goldspot.\n\nhow ai and machine learning creates a competitive advantage\n\ngood companies sell a quality product, great companies solve a problem, but the very best companies solve a problem before you even know you have one. the metal/non-metal mining industry has a problem it is either unaware of, or refuses to admit. the problem: the exploration industry is unable to find new big deposits that can be economically extracted without undue environmental damage in order to replace depleted reserves of current major mining companies.\n\nexploration by junior mining is one of the great perpetual boom and bust industries. every year, fortunes are made and lost betting on junior mining companies on the tsx venture exchange. junior miners are typically smaller companies (most with a market cap well under $50 million) that secure land and mining claims in hopes of finding the next big mineral find. when a company makes a big find, the rewards are incredibly lucrative, that can in the tens of thousands of percent gains big. for years, the market unduly rewarded junior miners who found massive mineral deposits. seemingly, the only metric that mattered was coming up with a big p&amp;p reserve in the tens of millions of ounces.\n\nbut the sad reality is that an overwhelming majority of junior mining companies fail well before mining operations can even begin on these massive mineral finds. at any given time, there are 3,000+ active junior miners trading on the tsx-v exchange. although most junior miners experience major shifts up and down in share price, it is very rare to get a big win long-term gainer among the junior mining companies. when long-term wins do happen, it is like lightning in a bottle – with sufficient gains to make up for a large number of losses. the key to being a long-term winner is cost of extraction, not volume. for example, an operation with 2 million ounces of gold that be extracted at an aisc cost of $350 is far more attractive of an acquisition target for a major mining company than an operation with 30 million ounces of gold that can be extracted for $1,100 an ounce.\n\nso why are so many junior mining companies fail? it isn’t necessarily that the companies have bad properties or don’t find valuable minerals (although that is possible). the reality is that junior mining companies typically fail because they simply run out of money. in order to develop a mining project all the way to production (or acquisition by a major), the junior mining company needs to find the right deposit, with the right economics, with the right timing and all within its limited financial resources. if the company has money to institute a drilling program, the junior mining company usually only has one chance to get it right and obtain a good drill result. if it does, stock price goes up and the junior miner is able to an equity raise sufficient to move on to the next stage of the process. any faltering along the way, and the entire project (and usually the company itself) goes up in flames. truly, it creates a “discover or die” environment. additionally, that discover needs to be in a location and grade that suggests that it can be removed economically.\n\nwhile this environment of “discover or die” has always existed for junior miners, there are two more recent industry trends/conditions that are making it even tougher for juniors to succeed. first, mineral finds are become harder and harder to locate. the minerals being found are greater depths or in environments with less surface indicators. this means that there are less easy finds available waiting to be discovered. the second trend is for junior miners to pursue “district-scale” projects. investors in junior miners are generally looking for companies with huge land holdings so that if there is a find, the potential payouts can be exponentially greater. at the same time, most mining laws around the world require a claim holder to invest a certain amount of money on an annual basis in developing a claim as well as pay a claim fee. these costs are not trivial and can total several million dollars on an annual basis for junior miners with large land packages. so with these additional factors, junior miners are having to look for a smaller needle in a bigger haystack that costs more money to maintain.\n\nin this environment smaller needles in bigger haystacks, goldspot is solving the budding problem by building a better mouse trap. with diminishing surface indicators, mining exploration companies need to effectively integrate data obtained from multiple sources. each time you stack a different level of data on top of another set of data, the complexity does not increase linearly, rather it increases exponentially. the beauty of ai and machine learning tools is that they are able look at data from a potentially limitless pool of data and find subtle geological, geophysical or other structural indicators that collectively increase the likelihood for success. the goldspot ai tool finds regions or structures where probability of mineralization are higher, but once a general region has been identified, the same tools are also able to narrow in on specific targets to confirm mineralization on a claim that provide a substantially higher likelihood of finding mineralization.\n\nfinancials\n\n&amp;#x200b;\n\nhttps://preview.redd.it/9a629dc73un71.png?width=633&amp;format=png&amp;auto=webp&amp;s=e2b6993834100006633d0e729d6e432934b79709\n\nrisks to the business\n\neach business carries risks along with their operations. the main risks to goldspot’s business model are listed below:\n\n**cash flows from consulting income**\n\ngoldspot currently generates revenue and cash flows from its consulting services. the availability of these sources of funds and goldspot's ability to maintain a network and attract additional customers will depend on a number of factors, many of which are outside of goldspot's control. a significant portion of goldspot's revenues have come from four customers in short-term contracts. goldspot's contracts are generally short-term and it is actively seeking to diversify its customer base with longer-term contracts. the loss of any one of its customers or the inability to attract additional customers will result in a material adverse effect on the business and may adversely affect revenues going forward.\n\n**intellectual property risk**\n\nthe ownership and protection of goldspot's intellectual property rights is a significant aspect of goldspot's future success. currently, goldspot relies on trade secrets, technical know-how and proprietary information to protect its intellectual property. goldspot also attempts to protects its intellectual property by entering into confidentiality agreements with parties that have access to it, such as business partners, collaborators, employees and consultants. any of these parties may breach these agreements and goldspot may not have adequate remedies for any specific breach. in addition, goldspot's trade secrets and technical know-how, which are not protected by patents, may otherwise become known to or be independently developed by competitors, in which event goldspot's business, financial condition and results of operation could be materially affected. an assertion by a third-party that goldspot is infringing its intellectual property could subject goldspot to costly and time-consuming litigation, which could harm its business. goldspot's success depends in part upon it not infringing the intellectual property rights of others. however, goldspot's competitors, as well as a number of other entities and individuals, may own or claim to own intellectual property relating to goldspot's industry or, in some cases, its technology. goldspot has not been subjected to any claims of intellectual property rights infringements in the past but as it develops more of its own applications and meets additional client specific requests, it may be exposed to greater risk in the future. any claims or litigation could cause goldspot to incur significant expenses, and if successfully asserted against goldspot, could require that goldspot pay substantial damages or ongoing revenue share payments, indemnify its customers or distributors, obtain licenses, modify products, or refund fees, any of which would deplete goldspot's resources and adversely impact its business.\n\n**investment risks**\n\nthrough its investing division, goldspot may acquire securities of public and private companies from time to time, which are primarily junior or small-cap companies. poor investment performance could impair revenues and growth. the market values of the securities can experience significant fluctuations in the short and long term due to factors beyond goldspot's control. market value can be reflective of the actual or anticipated operating results of the companies and/or the general market conditions in a specific sector as a whole, such as fluctuations in commodity prices and global political and economic conditions. goldspot's investments will be carried at fair value, and unrealized gains/losses on the securities and realized losses on the securities sold could have a material adverse impact on goldspot's operating results. there is no assurance that goldspot will be able to achieve or maintain any particular level of investment return, which may have a material adverse impact on its ability to attract investors. furthermore, the junior mining space tends to be more volatile than the general market indices. this volatility combined with negative or poor performance could combine to lead to a reduction in investor interest.\n\n**cyclical downturn**\n\na significant operating risk affecting goldspot is a downturn in demand for its services due a decrease in activity in the mining industry. a severe and persistent downturn in the mining industry would have severe consequences on the business of goldspot. in many cases, capital markets are the only source of funds available to junior mining companies and any change in the outlook for the sector or the lack of success of a specific exploration program can quickly impair the ability of these juniors to raise capital to pay for their consulting services.\n\n**limited operating history**\n\ngoldspot began carrying on business in 2017 and started to generate significant revenue from its operations beginning in december 31, 2018. goldspot is therefore subject to many of the risks common to early stage enterprises, including under-capitalization, cash shortages, limitations with respect to personnel, financial, and other resources and limited revenues. there is no assurance that goldspot will be successful in achieving a return on shareholders' investment and the likelihood of success must be considered in light of the early stage of operations.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\"the chairman of barrick gold corp. made a bold prediction late last year: with the help of artificial intelligence and other digital tools, the world’s largest gold miner would become a technology company that just happened to be in mining.\"\n\n**if you have a background in software analytics / ai / deep and/or machine learning feel free to contact goldspot for career opportunities:** [**https://goldspot.ca/contact-us/**](https://goldspot.ca/contact-us/)", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/pp9x9h/goldspot_discoveries_integrating_big_data/',)", "identifyer": 5736069, "year": "2021"}], "name": "riderMachineLearning2021"}