{"interestingcomments": [{"autor": "techsucker", "date": 1630391848000, "content": "[R] Researchers From SenseTime, Monash and NTU Propose ‘CSG-Stump Net’, An Unsupervised AI for Learning How a Component is Built (Code, Paper, Project Included) /!/ Recently, deep learning has achieved great success in areas such as computer vision and natural language processing. It also shows potential for solving complex problems that are difficult to solve with traditional techniques. A few works have explored using neural network techniques for parsing point cloud models into their Constructive Solid Geometry (CSG) tree representation; this is a widely used 3D representation and modeling technique in the CAD industry.\n\nCSG is an excellent approach for modeling shapes as it involves simple primitive parametric inputs, which are easy to construct and understand. However, the binary CSG-Tree structure introduces challenges like it’s difficult to define a CSG-Tree with a fixed dimension formulation as well as iterative nature of tree construction cannot be formulated mathematically in terms of matrix operations leading to poor varnishing gradient optimization.\n\nOne of the many important and challenging problems related to 3D shapes is how to generate an interpretable representation of point clouds that describe these objects. This can be useful in various applications, such as object recognition or better understanding a scene (e.g., by incorporating information about shape). Researchers from SenseTime, Nanyang Technological University (NTU), Monash University, and S-Lab [introduce CSG-Stump](https://arxiv.org/pdf/2108.11305.pdf), a new reformulation of the traditional 3D modeling technique, CSG-Tree.\n\n# [5 Min Read](https://www.marktechpost.com/2021/08/30/researchers-from-sensetime-monash-and-ntu-propose-csg-stump-net-an-unsupervised-ai-for-learning-how-a-component-is-built/) | [Paper](https://arxiv.org/pdf/2108.11305.pdf)| [Project](https://kimren227.github.io/projects/CSGStump/)| [Code](https://github.com/kimren227/CSGStumpNet)\n\n&amp;#x200B;\n\n*Processing video kkm0q3uh2nk71...*", "link": "https://www.reddit.com/r/MachineLearning/comments/pf0eow/r_researchers_from_sensetime_monash_and_ntu/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "stump", "selectorShort": "stump", "MarkedSent": "[r] researchers from sensetime, monash and ntu propose ‘csg------> stump !!!  net’, an unsupervised ai for learning how a component is built (code, paper, project included) /!/ recently, deep learning has achieved great success in areas such as computer vision and natural language processing. it also shows potential for solving complex problems that are difficult to solve with traditional techniques. a few works have explored using neural network techniques for parsing point cloud models into their constructive solid geometry (csg) tree representation; this is a widely used 3d representation and modeling technique in the cad industry.\n\ncsg is an excellent approach for modeling shapes as it involves simple primitive parametric inputs, which are easy to construct and understand. however, the binary csg-tree structure introduces challenges like it’s difficult to define a csg-tree with a fixed dimension formulation as well as iterative nature of tree construction cannot be formulated mathematically in terms of matrix operations leading to poor varnishing gradient optimization.\n\none of the many important and challenging problems related to 3d shapes is how to generate an interpretable representation of point clouds that describe these objects. this can be useful in various applications, such as object recognition or better understanding a scene (e.g., by incorporating information about shape). researchers from sensetime, nanyang technological university (ntu), monash university, and s-lab [introduce csg-stump](https://arxiv.org/pdf/2108.11305.pdf), a new reformulation of the traditional 3d modeling technique, csg-tree.\n\n# [5 min read](https://www.marktechpost.com/2021/08/30/researchers-from-sensetime-monash-and-ntu-propose-csg-stump-net-an-unsupervised-ai-for-learning-how-a-component-is-built/) | [paper](https://arxiv.org/pdf/2108.11305.pdf)| [project](https://kimren227.github.io/projects/csgstump/)| [code](https://github.com/kimren227/csgstumpnet)\n\n&amp;#x200b;\n\n*processing video kkm0q3uh2nk71...*", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 1, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/pf0eow/r_researchers_from_sensetime_monash_and_ntu/',)", "identifyer": 5722191, "year": "2021"}], "name": "stumpMachineLearning2021"}