{"interestingcomments": [{"autor": "andraz2012", "date": 1613901415000, "content": "[P] Urban Noise Time Series Data /!/ I developed a system for urban noise analysis. I made a few sensors and a backend server to store the data. The sensors listen synchronously every second for 100ms, then they do fft on the data (i get out 16 values evenly spaced in 0-1300Hz range) and they calculate decibels. The data is then timestamped and sent to a server.\n\nI placed 8 sensors along a busy street and have been getting data for some three weeks now. I have no clue what to do with this data.\n\nMy background is in computer science, but I know a bit of machine learning (i am familiar with regressions, tress, knn, kmeoids, kmeans, hiarchical clustering, naive bayes,...). I am quite familiar with Orange and have implemented a few ML algorithms in python. But yeah, I have no clue what to do with the data. \n\n\nI can provide the data. It's a few hundred MB of data in JSON format and I can send a dropbox link.", "link": "https://www.reddit.com/r/MachineLearning/comments/lotxnw/p_urban_noise_time_series_data/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "tress", "selectorShort": "tress", "MarkedSent": "[p] urban noise time series data /!/ i developed a system for urban noise analysis. i made a few sensors and a backend server to store the data. the sensors listen synchronously every second for 100ms, then they do fft on the data (i get out 16 values evenly spaced in 0-1300hz range) and they calculate decibels. the data is then timestamped and sent to a server.\n\ni placed 8 sensors along a busy street and have been getting data for some three weeks now. i have no clue what to do with this data.\n\nmy background is in computer science, but i know a bit of machine learning (i am familiar with regressions, -----> tress !!! , knn, kmeoids, kmeans, hiarchical clustering, naive bayes,...). i am quite familiar with orange and have implemented a few ml algorithms in python. but yeah, i have no clue what to do with the data. \n\n\ni can provide the data. it's a few hundred mb of data in json format and i can send a dropbox link.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 5, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/lotxnw/p_urban_noise_time_series_data/',)", "identifyer": 5728946, "year": "2021"}], "name": "tressMachineLearning2021"}