{"interestingcomments": [{"autor": "TheLurtz", "date": 1630321012000, "content": "[D] How to auto-generate product description and comparison? /!/  A bit of a background: Part time I'm running a webshop, lets say I sell cars just to have an example. Instead of writen a description for each car (there can be thousands) as well as comparison between cars (there can be thousands times thousands) I want to autogenerate this. I've got a background in Machine Learning and want to utilize this knowlege but I'm not realy sure where to look, what to search for, or if there are any standards ways of doing this.\n\nFor each product (car in this case) I've got tons of specifications and data-points (engine-size, mileage, trunk-size, dimensions, price e.t.c.) and I figured I could use this to autogenerate decripotions as well as comparisons.\n\nTake for example this page describing the 2020 Honda Odysses: [https://www.car-buying-strategies.com/Honda/Odyssey-2020.html](https://www.car-buying-strategies.com/Honda/Odyssey-2020.html). To me the text feels very much autogenerated, how do you think that is done?\n\nAnd this page, comparing an Outback to a RAV4: [https://www.car-buying-strategies.com/Subaru/2020-Outback-vs-Toyota-RAV4.html](https://www.car-buying-strategies.com/Subaru/2020-Outback-vs-Toyota-RAV4.html). Again, it feels autogenerated. Any ideas if its just some simple dummy lookup-table like \"if car1.engine &gt; car2.engine then return \"car1.name outperforms the  \n car2.name\\`\\`...  \n\" or something more clever?\n\nI'm thinking in terms of NLP, GPT 3 e.t.c.", "link": "https://www.reddit.com/r/MachineLearning/comments/pefr90/d_how_to_autogenerate_product_description_and/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "trunk", "selectorShort": "trunk", "MarkedSent": "[d] how to auto-generate product description and comparison? /!/  a bit of a background: part time i'm running a webshop, lets say i sell cars just to have an example. instead of writen a description for each car (there can be thousands) as well as comparison between cars (there can be thousands times thousands) i want to autogenerate this. i've got a background in machine learning and want to utilize this knowlege but i'm not realy sure where to look, what to search for, or if there are any standards ways of doing this.\n\nfor each product (car in this case) i've got tons of specifications and data-points (engine-size, mileage, -----> trunk !!! -size, dimensions, price e.t.c.) and i figured i could use this to autogenerate decripotions as well as comparisons.\n\ntake for example this page describing the 2020 honda odysses: [https://www.car-buying-strategies.com/honda/odyssey-2020.html](https://www.car-buying-strategies.com/honda/odyssey-2020.html). to me the text feels very much autogenerated, how do you think that is done?\n\nand this page, comparing an outback to a rav4: [https://www.car-buying-strategies.com/subaru/2020-outback-vs-toyota-rav4.html](https://www.car-buying-strategies.com/subaru/2020-outback-vs-toyota-rav4.html). again, it feels autogenerated. any ideas if its just some simple dummy lookup-table like \"if car1.engine &gt; car2.engine then return \"car1.name outperforms the  \n car2.name\\`\\`...  \n\" or something more clever?\n\ni'm thinking in terms of nlp, gpt 3 e.t.c.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/pefr90/d_how_to_autogenerate_product_description_and/',)", "identifyer": 5723455, "year": "2021"}], "name": "trunkMachineLearning2021"}