{"interestingcomments": [{"autor": "contractbulletthrow", "date": 1611941674000, "content": "[Project] Help understanding how to apply DQN /!/ I recently took a bootcamp where we learned to apply DQN to the lunar lander.\n\nI'd  like to keep learning and work on a project where I mimic the game of  American football. I'm having trouble having DQN learning at much. What I  have so far:\n\n* Outcome models for various types of plays; run, pass, punt etc...\n* A way for the defense to score after the offense has had a drive (Regression based on clock, score etc.)\n* state params = \\[clock, down, distance, yardline, score difference, timeouts remaining\\]\n* I  have DQN working on decisions in the last \\~10 sec of the game from a  FIXED starting point. For instance 4th and 10 on the 90 yard line with 5  seconds left, down by 2. The obvious choice is to kick a fieldgoal  which DQN correctly learns.\n\nUnfortunately,  things go south with more time starting on the clock, especially for  random starting points. Current hyperparams are\n\n* episodes=100k\n* initial epsilon=0.999\n* epsilon decay = 0.9999\n* buffer size = 100000 (memory replay)\n* batch size = 64\n\nIt's a 3 layer network with 100 nodes each.\n\nI've  tried to keep it simple where it's just from the offense's point of  view. If I can get this working then I'd like to extend it to a two  player game where the defense is able to call a timeout, and then  eventually the offense and defense behaving like teams in a normal game  (no need for the defense's regression for estimating scoring probability  after the offense has scored), and the agents go back and forth until  the game is over.\n\nAny tips on where I am going wrong? I can try to provide more detail if desired.", "link": "https://www.reddit.com/r/MachineLearning/comments/l7yllp/project_help_understanding_how_to_apply_dqn/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "[project] help understanding how to apply dqn /!/ i recently took a bootcamp where we learned to apply dqn to the lunar lander.\n\ni'd  like to keep learning and work on a project where i mimic the game of  american football. i'm having trouble having dqn learning at much. what i  have so far:\n\n* outcome models for various types of plays; run, pass, punt etc...\n* a way for the defense to score after the offense has had a drive (regression based on clock, score etc.)\n* state params = \\[clock, down, distance, yardline, score difference, timeouts remaining\\]\n* i  have dqn working on decisions in the last \\~10 sec of the game from a  fixed starting point. for instance 4th and 10 on the 90 -----> yard !!!  line with 5  seconds left, down by 2. the obvious choice is to kick a fieldgoal  which dqn correctly learns.\n\nunfortunately,  things go south with more time starting on the clock, especially for  random starting points. current hyperparams are\n\n* episodes=100k\n* initial epsilon=0.999\n* epsilon decay = 0.9999\n* buffer size = 100000 (memory replay)\n* batch size = 64\n\nit's a 3 layer network with 100 nodes each.\n\ni've  tried to keep it simple where it's just from the offense's point of  view. if i can get this working then i'd like to extend it to a two  player game where the defense is able to call a timeout, and then  eventually the offense and defense behaving like teams in a normal game  (no need for the defense's regression for estimating scoring probability  after the offense has scored), and the agents go back and forth until  the game is over.\n\nany tips on where i am going wrong? i can try to provide more detail if desired.", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 0, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/l7yllp/project_help_understanding_how_to_apply_dqn/',)", "identifyer": 5723270, "year": "2021"}, {"autor": "someonerezcody", "date": 1630962647000, "content": "[D] A question about machine algo's in bird feather identification /!/ I recently found a feather in my yard and was curious to know the species of bird that the feather came from. While researching, I found a feather atlas that is hosted online. It's a fantastic resource for assisting in identifying bird feathers, however the process was very manual and cumbersome.\n\nI left the experience feeling as though there is potential for optimization in this process using machine learning algo's... The resources I've found that are currently available rely on user input and often ambiguity is present with multiple possible birds.\n\nI was curious to know if any research has been done for a way to identify a bird species from a photo of the feather. I'd appreciate any links you have for me on the subject. An app that can identify a photo of a bird feather would be kinda cool and I'd love to see it if it exists out there.\n\nThanks for reading!", "link": "https://www.reddit.com/r/MachineLearning/comments/pj8m1a/d_a_question_about_machine_algos_in_bird_feather/", "origin": "Reddit", "suborigin": "MachineLearning", "result": true, "Selector": "yard", "selectorShort": "yard", "MarkedSent": "[d] a question about machine algo's in bird feather identification /!/ i recently found a feather in my -----> yard !!!  and was curious to know the species of bird that the feather came from. while researching, i found a feather atlas that is hosted online. it's a fantastic resource for assisting in identifying bird feathers, however the process was very manual and cumbersome.\n\ni left the experience feeling as though there is potential for optimization in this process using machine learning algo's... the resources i've found that are currently available rely on user input and often ambiguity is present with multiple possible birds.\n\ni was curious to know if any research has been done for a way to identify a bird species from a photo of the feather. i'd appreciate any links you have for me on the subject. an app that can identify a photo of a bird feather would be kinda cool and i'd love to see it if it exists out there.\n\nthanks for reading!", "sortedWord": "None", "removed": "('nan',)", "score": 1, "comments": 2, "media": "('nan',)", "medialink": "('https://www.reddit.com/r/MachineLearning/comments/pj8m1a/d_a_question_about_machine_algos_in_bird_feather/',)", "identifyer": 5727002, "year": "2021"}], "name": "yardMachineLearning2021"}