{"interestingcomments": [{"autor": "rubylogan15", "date": "2018-01-10 07:08:52", "content": "-----> Image !!! -To------> Image !!!  Translation the AI Drawing Technology /!/ [removed]", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/7pdye9/imagetoimage_translation_the_ai_drawing_technology/"}, {"autor": "navin49", "date": "2018-09-01 16:06:44", "content": "This New AI Tells Whether You’re Gay or Straight Just By Your Photograph /!/ The thing that gives AI an upper edge over any other technology is it’s capability of recognizing the patterns and learning from past mistakes. It’s being now used to write poetry, spot micro symptoms of diseases and teach children’s about renewable energy, etc. Going a mile further, the researchers at Stanford University has created an artificial intelligence system that predict whether a person is gay or straight just by looking at his -----> photo !!! .\n\nThe creator of this AI is Michal Kosinski and Yilun Wang. The research’s research paper titled Deep neural networks are more accurate than humans at detecting sexual orientation from facial images, has published in Journal of Personality and Social Psychology. Researcher said ” faces contain much more information about sexual orientation than can be perceived and interpreted by the human brain”.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9c47cq/this_new_ai_tells_whether_youre_gay_or_straight/"}, {"autor": "virene", "date": "2018-08-26 13:13:27", "content": "Does the current ML practices have limitations in learning from healthcare data? /!/ Would it be right to say that the current NN available might not be completely suited for machine learning in Healthcare?\n\nToday, most AI startups have to depend on neural networks that is either  of these CNN or GAN or even Autoencoders. All of these models are tested on -----> image !!!   recognition, which is a single -----> image !!! .(Note- The dynamics changes when it  is video rather than -----> image !!! ). This would mean that all these  networks that are primarily worked for either image recognition or natural language, consider spatial relationships only. Since the time factor is static, in an image, the  need to do time based analysis does not arise    \n\nBut, Cellular behavior or behavior related to molecular interactions  cannot be analyzed just by spatial parameters. This may help in giving  the structural inputs but does not lend towards functional analysis of the cell or molecule. We will need to  factor in how each parameter changes by time and hence requires temporal  data parameters. Moreover, in chemical interactions, since there is a decay, it needs both space and time calculations in order to understand the  behavior and influence of a unit molecular input   \n\nWe also find that the networks require a manually prepared data-set or if unsupervised, it creates a fully  connected network. The former creates gaps and the latter creates  redundancies. However, this problem can be solved by hierarchies. and to reduce  human errors, we need to employ semi-supervised techniques   \n\nAnd there are also problems of data silos. At a high level, data is scattered  as various -omics data (genomics, proteomics etc) nutritional data, and  other knowledge specific data and in another tangent, we have multiple  devices collecting patient data, creating another set of silos   \n\nAs we don't have the data foundation, creating training sets for  learning, is entirely manual and those created, just match a small sect  of the entire knowledge.  \n\nWould love to hear views/comments and possible solutions that might help in learning functional changes over time. Thanks\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9affid/does_the_current_ml_practices_have_limitations_in/"}, {"autor": "gmiresearchglobal", "date": "2018-05-16 08:19:34", "content": "Global artificial intelligence market was estimated to be USD 4,157.6 million in 2016 /!/ **According to GMI Research** report, “[**Global Artificial Intelligence Market**](https://www.gmiresearch.com/report/global-artificial-intelligence-market-by-solution-technology-end-use-share-opportunities-forecast-players-profile.html) By Solution, By Technology, By End\\-Use and By Geography – Opportunities &amp; Forecast 2016–2025”, the global artificial intelligence market was estimated to be USD 4,157.6 million in 2016 and is projected to reach USD 153,389.0 million by the end of 2025, exhibiting a CAGR of 49.3&amp;#37; during the forecast period. The key factors boosting growth of the market are increasing adoption of artificial intelligence solutions across a broad range of industries, rise in demand for analyzing and interpreting large amount of data as well as development and acceptance of technologically advanced artificial intelligence solutions for upgrading consumer services.\n\n**Download Sample Brochure :** [**https://www.gmiresearch.com/sample\\-research\\-report.php?rid=97**](https://www.gmiresearch.com/sample-research-report.php?rid=97)\n\n**On the basis of solution, hardware is expected to exhibit the highest CAGR through 2025** Surging demand from several industries, such as retail, BFSI, healthcare, automotive &amp; transportation, media &amp; advertizing and manufacturing worldwide has led to burgeoning market growth of hardware solution. This segment typically includes chipsets, such as central processing unit, graphics processing unit, application specific integrated circuit as well as the field\\-programmable gate array. Apart from this, the technological advancements, such as superior computing power, parallel computation capabilities and more storage capacity in AI\\-enabled hardware products are further likely to drive the growth of this segment.\n\n**On the basis of technology, deep learning segment cornered the market in 2016** Deep learning segment captured the largest share in artificial intelligence market globally due to it’s increased usage across various industries, such as BFSI, automotive as well as media &amp; advertising. Besides that, surging demand for technologically advanced deep learning hardware as well as cloud based technology has further spurred growth of the segment. Moreover, complex data driven applications including -----> image !!!  recognition, signal recognition and data mining of deep learning technology is anticipated to positively affect the market growth.\n\n**On the basis of end\\-use application, media &amp; advertising segment dominated the market in 2016** Media &amp; advertising segment held the largest share in the indicated year and is predicted to grow at a substantial rate during the forecast period owing to rising usage of artificial intelligence solutions in various applications, such as ad targeting, content creation, fraud prevention, predictive customer service, consumer product recommendation, sales forecasting and web/app personalization. Also, significant investments by industries, such as banking, retail, healthcare and manufacturing in artificial intelligence systems are expected to lay down the best path for the market to grow.\n\n**North America controlled the largest share in the market in 2016** Increase applications in end\\-use verticals, majorly in media &amp; advertising, automotive &amp; transportation, healthcare, BFSI, retail coupled with high government funding were the key factors that fueled the market growth in North America in 2016. Increased adoption rate of artificial intelligence systems by large conglomerates, especially in the United States has contributed to the market growth in the region. Europe and Asia\\-Pacific are other key significant regions in artificial intelligence market across the globe. Countries like the U.K. and Germany are projected to grow at the highest rates from 2016 to 2021 in the European region.\n\n**For Sample Pages &amp; Detailed Report Description Visit :** [**https://www.gmiresearch.com/report/global\\-artificial\\-intelligence\\-market\\-by\\-solution\\-technology\\-end\\-use\\-share\\-opportunities\\-forecast\\-players\\-profile.html**](https://www.gmiresearch.com/report/global-artificial-intelligence-market-by-solution-technology-end-use-share-opportunities-forecast-players-profile.html)\n\n**ContactSarah Nash** Level 1, The Chase Carmanhall Road,Sandyford Industrial Estate,Dublin D18 Y3X2, IrelandU.S Office \\+1 860 881 2270Europe Office \\+353 1 442 8820Email: sales@gmiresearch.com ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8jt9ww/global_artificial_intelligence_market_was/"}, {"autor": "hungryfor_knowledge", "date": "2018-07-25 09:04:59", "content": "Mario or Wario? -----> Image !!!  classification in Python", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/91q7qu/mario_or_wario_image_classification_in_python/"}, {"autor": "Ubcoin", "date": "2018-07-19 17:18:39", "content": "The Ubcoin Market indentifies suspicious and fraudulent adds utilizing Artificial Intelligence. /!/ ***Ubcoin*** *is a unique crypto-to-goods exchange — a blockchain-based platform where everyone can buy or sell real goods for cryptocurrency. In marketplaces like* ***Ubcoin Market*** *listings (ads) are created and posted by users of the service. Among the legitimate ones some are posted by scammers. To search and identify listings posted by scammers, the* ***Ubcoin Market*** *team developed a solution based on artificial intelligence technologies. It identifies suspicious ads, reveals duplicate ads, low-cost ads, abnormal ads and finds weird user behavior patterns in the data. The use of machine learning algorithms makes the purchasing and selling of goods for cryptocurrency on the* ***Ubcoin Market*** *safe and secure.*\n\nAdvertisements posted by scammers may barely differ from usual legitimate ads, which makes preliminary moderation using the involvement of human experts ineffective. The algorithms utilized by Ubcoin artificial intelligence solution finds obscure patterns of behavior of scammers and instantly identifies suspicious ads.\n\n**The Ubcoin team identifies four types of fraudulent ads:**\n\n1) Duplicate ads, with changed details or contacts\n\n2) Ads, with a low price, for the mass attraction of buyers\n\n3) Multiple ads placed by one user from different accounts\n\n4) Ads containing abnormal content or abnormal user behavior when posted\n\n**To identify duplicate ads** **Ubcoin Market** uses its own solution for the analysis of texts and images. Natural language processing algorithms such as Word2Vec translate text into a vector and define the same meaning even when using substitute words. A solution for -----> image !!!  analysis reveals duplicate -----> image !!! s and select objects on them.\n\n**To identify ads with a low price,** a solution is used to automatically determine the optimal price for the product. The solution utilizes real historical data regarding the cost of placement and the sale of goods. The solution is based on the algorithm for highlighting the topic of the ad and the characteristics of the product specified in the ad. If the cost of the goods is understated and falls into the left 5% interval of the price distribution histogram, this is a sign for additional verification.\n\n**To detect multiple ads placed by one user from different accounts,** both the data received when a user visits the site and the data from the ad are used. The algorithms for clustering are used to reveal the hidden structure in the data. The approach reveals obscure behavioral factors. An example of the operation of the clustering algorithm: clusters are marked with colors. When finding a cluster in which fraudulent ads predominate, a classification algorithm is trained based on the information received, which automatically detects suspicious ads in the future.\n\nAdditionally, a solution is used to search for anomalies in the data. The solution is based on the one-class algorithm of the method of support vectors. Search for anomalies is designed to search for ads that are very different in their own structure or the nature of the user’s behavior from the bulk of the ads. The solution finds ads posted by bots, and automatically sends them for additional verification.\n\nThe peculiarity of revealing fraudulent actions is that people who aspire to commit unlawful actions quickly **adapt to new ways of counteraction, changing behavior.** To solve this problem, artificial intelligence **Ubcoin Market** will undergo regular retraining on new data, and the analysts and developers will continuously improve solutions to identify suspicious transactions.\n\nThe decision of the **Ubcoin Market** to identify suspicious ads is based on modern machine learning algorithms and identifies duplicate ads, low-price ads, abnormal ads and user behavior patterns. The use of machine learning algorithms makes the purchase and sale of goods for cryptocurrency on the **Ubcoin Market** secure and safe.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/907t7n/the_ubcoin_market_indentifies_suspicious_and/"}, {"autor": "webhistories", "date": "2018-07-19 00:54:43", "content": "Help in Computer Vision AI /!/ Hello,\n\nI am a Computer Science student and I'm planning to create a mobile application that detects specific details on human figure sketches made by children. The app will score the drawings according to detected details. This will be used to help in a psychometrics tool. \n\nI've been looking around everywhere for demos to see if what I have in mind is feasible. What I specifically look for is an object detector API or algorithm that detects **multiple** objects in an -----> image !!! . For example in human sketch, it can detect if the eyes, nose or ears are present. Is this an existing concept or can someone direct me to a project close to this?\n\nI appreciate any help I can get from this sub, thanks!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9016ou/help_in_computer_vision_ai/"}, {"autor": "sumangala_qpt", "date": "2018-06-25 09:04:40", "content": "Adobe is using AI to spotting -----> image !!!  manipulation /!/ Adobe is working on to use artificial intelligence and machine learning,  to more easily, reliably and quickly detect whether or not any part of a digital image had been manipulated, and if so, what aspects were modified.\n\nhttps://www.youtube.com/watch?v=rETMDUgAUIg", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8tp1b3/adobe_is_using_ai_to_spotting_image_manipulation/"}, {"autor": "Ubcoin", "date": "2018-06-18 19:35:47", "content": "Personal Recomendations Based on the Artificial Intelligence utilized by Ubcoin. /!/ Ubcoin is actively developing a system of personal recommendations based on artificial intelligence for the purpose of integrating the system into its platform.Ubcoin is a unique crypto\\-to\\-goods exchange — a blockchain\\-based platform where everyone can buy or sell real goods for cryptocurrency.\n\nAn automatic system, which generates personal recommendations is critical for the success of the marketplace. Personal recommendations increase the conversion of sales by showing users products or services that users are most likely interested in purchasing. The introduction of system\\-generated personal recommendations raises the revenue of the partners of the service, and makes finding goods more convenient for the clients. The system effectively creates an environment where users spend more time on the service, make more purchases, and all the while inspect only products relevant to the users themselves. The implementation of a system that creates personal recommendations leads to an increase in marketplace revenues, as well as an increase in the loyalty of buyers and sellers.\n\nThe value and effectiveness of this approach was demonstrated by Netflix, when in 2006 it held a competition that changed the idea of the value of the available information about the client. The company was faced with the task of increasing the conversion of content purchases and improving the customer’s customer experience. Netflix organized a contest with a prize fund of $ 1 million. At the end, by investing $ 1 million, Netflix got the effect and benefits of hundreds of millions of dollars.\n\nThe Ubcoin team, understanding the importance of personal recommendations, began developing its own solution.\n\nThe Ubcoin solution is based on machine learning technologies, on the algorithms of collaborative filtering. Regarding the traditional machine learning approach, features and an objective function are fed into the input, then the collaborative filtering features are contained both in the object that is the advertisement and in the user data. On a similar principle, search algorithms work on the Internet, where information is used both about the site, and about the user and the search query.\n\nFor Ubcoin tasks, characteristics of the object are analyzed, such as the text of the description of the goods and the -----> image !!!  of the goods. To describe the product image, Ubcoin uses pre\\-trained AI in conjunction with the neural network regarding the ImageNet images and pre\\-trained in product images. The task of the neural network is to recognize the specific objects in the image.\n\nFor the extraction of features from the text, a selection of topics based on classification and clustering of text ads are systematically used. For this, the text is translated into a vector by using the TF\\-IDF algorithm.\n\nThen, the text goes through the procedure of normalization and lemmatization, after which algorithms of logistic regression and random forests are used. To determine the significance of words, the algorithm Word2Vec is used. Word2Vec translates words into a vector form which allows it to perform mathematical operations on them.\n\nThe solution works as follows: the user places ads on the Ubcoin platform. Artificial intelligence analyzes user information, ad parameters, ad text, image, and how other users viewed and interacted with this ad and other ads. Based on the generated information, a prediction model is constructed, effectively predicting which ad will appeal to a specific user.\n\nThe **Ubcoin** team makes a crypto\\-to\\-goods exchange platform for exchanging goods for cryptocurrency, using modern algorithms of artificial intelligence, helping users find the product of interest. Now, only users decide what is needed.\n", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/8s2cam/personal_recomendations_based_on_the_artificial/"}, {"autor": "emarketeducation", "date": "2018-11-06 05:32:25", "content": "HOW ARTIFICIAL INTELLIGENCE AFFECTS THE DIGITAL MARKETING /!/  \n\n# Impact of Artificial Intelligence in Digital Marketing &amp; Career in Digital Marketing in 2018\n\nImpact of Artificial intelligence (AI) is conquering each sector one by one. AI has become an inevitable part of our daily lives as it is changing the phase of technology into the new revolutionized way. Digital marketing has also been added to this list**.** Leveraging **Artificial Intelligence in digital marketing** caused is shifting into the more advanced level of technology in 2018.\n\n# What is Artificial Intelligence aka AI?\n\nArtificial intelligence (also called machine intelligence) is intelligence demonstrated by machines in contrast to the Natural Intelligence (NI) displayed by humans and other animals. A Computer can do tasks that normally require human intelligence such as visual perception, speech recognition, decision making, and translation between languages.\n\n**Knowledge has a Beginning**\n\n**But No End**\n\n[***Check Out What eMarketeducation DeliversThe Best Digital Marketing Courses in Bangalore***](http://www.emarketeducation.in/course/digital-marketing-training-course-bangalore/)\n\n## ARTIFICIAL INTELLIGENCE IN DIGITAL MARKETING CAREER\n\nManual handling of the digital world becomes difficult in understanding, analyzing and analyzing data and sometimes even gives wrong results. The introduction of **Artificial Intelligence in the digital advertising industry shifted made more reliable sector** as it is capable to understand human behaviour and vital part for marketers to engage with customers. Marketers are aware of the **AI impact in the online marketing** field. The entrance of machine intelligence helps online marketers to make the decision on posting advertisement as they can understand the market and audience reaction deeply.\n\nA digital marketer can use computer intelligence to enhance sale growth, develop the engagement with customers and target the audience.\n\n## \n\n## 10 ADVANTAGES OF ARTIFICIAL INTELLIGENCE AND HOW IT AFFECTS DIGITAL MARKETING.\n\n1. **Application of Artificial Intelligence in Digital Marketing**\n\n**AI helps to Understand Audience Requirement Easily**. The major role of the marketing sector is realizing customer’s need and his attitude. If the organization can understand customer’s requirement, it is easy to advertise and segment the market accordingly, increase the sale volume and minimize the advertising expense if they could understand what customers require.\n\nArtificial intelligence brings you customers’ behaviour and how they react to the products and services.\n\n1. **AI helps to Improve the Customer Satisfaction**\n\nAI implement connection with the audience. Knowing customer queries and solving the **issues is the key factor of online marketing strategy** that helps to engage with customers, understanding their requirement and develop products and services accordingly. On time conversation with consumers enhances reliability and builds customers loyalty. [A chatbot](https://en.wikipedia.org/wiki/Chatbot) is used to have a two-way real-time conversation that brings more engagement with customers.\n\nThis application support customers through chatting in real-time and collect relevant data from users which helps the brand targeting potential customers and marketing products.\n\n1. **Helps in Content Marketing**\n\nAI creates content. In Online Marketing, [**content strategy is very important**](http://www.emarketeducation.in/content-marketing-believe-basics/). Using certain tools programs Artificial Intelligence can convert data into written content in the different format such as article, -----> image !!! , video and production descriptions.  AI can produce 2000 articles per second based on requirement.\n\nMany of esteemed companies like Samsung, Yahoo are already started using automated content writing technology.\n\n1. **AI helps in High Return on Investment (ROI) in Digital Marketing**\n\nA company can make huge ROI rate as they can target specific customers with AI-based tools. Artificial intelligence enabled software can recognize the human face and his characters. Image recognition by AI tool can be leveraged to know customers’ behaviour, interest, and need.\n\nThis will help the digital marketer to focus on potential customers and minimize the advertising cost.\n\n1. **Artificial Intelligence Makes Digital Advertising More Effective**\n\nAdvertising is an inevitable part of promoting the brand.  But organization incur lose as audience receive the advertisement which is not related to his requirements.  The brand can avoid unnecessary advertisement targeting potential customers with the help of AI as it collects, analyze and predict the behaviour of the user.  \n\n&amp;#x200B;\n\n1. **AI helps to create a personalized user experience**\n\nA business can achieve success when they can engage with customers personally. This will help them to understand what the user prefers and how a consumer satisfies with the products. Artificial intelligence would collect the users’ data such as customers’ searches, buying behaviour, interest and other relevant information about the customers. This would help the organization to understand the customers properly. A chatbot is a tool which is used to make real-time conversation with consumers and it collects data from opposite such as his/ her requirement and it helps to improve the products and services.\n\n[Read More](http://www.emarketeducation.in/future-artificial-intelligence-digital-marketing/)", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9ulpkc/how_artificial_intelligence_affects_the_digital/"}, {"autor": "demianvlk", "date": "2018-10-10 02:16:38", "content": "[question] eye/chat bot /!/ Warning: wall of text\n\n\nI’ve had an idea kicking around in my head for a few years and wanted some feedback before I actually start playing with it.\n\nI’m an esl(English as a second language) and python (2d games) teacher at a middle school. I’m also a toddler dad. This has kinda smashed together some unique observations on how language develops and how learning happens.\n\nThe project I want to start to explore these ideas(I’ll list them below) is a simple eyebot(most likely a raspberry pi with a pi cam attached to a motor or two so it can look around). I’ll also have an application window open with the -----> camera !!!  feed and a basic chat like interface. In addition to the chat interface there may also be a “thought” window (several thoughts that are not “vocalized” may pop up and narrate observations - a running monologue of the world around it.\n\nThe ideas I want to play with are:\n-language generation will always be hollow unless it is driven by meaning \n- embodied cognition(more so if I make this a rolling eyebot) but essentially the idea that thought and meaning generation are tied to being bound to a perspective...a body(bot should be able to derive meaning for the pronouns I,you,other from this perspective)\n- object recognition the way a toddler does it(indicate curiosity, listen to feedback, create a schema, over generalize that schema, refine the schema over time)\n- sets (everything is a thing, some things are dadda, not all things that look like dadda are called dadda- some are called momma etc) \n-“is a” vs “has a” fundamental logical distinction between nouns and adjectives \n- generative grammar (from Noam Chomsky) with an initially restricted vocab could allow the chat part of the bot create logical and grammatically correct sentences - meaning and variation could be layered on with increased objects learned through object recognition (driven by primitive shapes) and layered sets of labels/concepts I.e. sentences become more complex and accurate.\n- babies are naturally fixated by eyes and primitive shapes and pure colors in part because their eyes are not fully developed and in part because they are less overwhelming than the shifting undifferentiated mass of the rest of the vision plane, this leads to recognition of simple and easy shapes,colors, and then the brain tries to master/identify all other objects in the vision field. \n- there is an idea in Zen Buddhism that there is an initial sensory experience and then successive layers of conceptualization of that experience...leading ultimately to the narrative expression of an idea. This is what I mean about sense being tied to meaning for successful creation of language. \n\n\nA use case: the bots camera, after a significant amount of training, detects an unfamiliar object. In the application window it highlights the object with an outline, and in the chat window asks “what is this?” {knowing that “this” implies proximal or indicated status} and then gets a user response - shaping its schema. In another situation it may ask “who are you?” When a new user sits down- knowing the features of a human face and that this one is new...finally, when left alone the bot simply narrates the world around it as its perspective shifts “the cat is on the table again. It is next to the plant. “ \n\nI’m not insane- I know how complex ai is and how ambitious this project is. But I’m doing this for fun and to see if I can make anything kinda cool. Any comments or insights are appreciated. Also thanks for the long read.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9mvhf4/question_eyechat_bot/"}, {"autor": "doubledeadghost", "date": "2018-08-22 22:06:34", "content": "Is there an online -----> image !!!  generation tool to which I can upload an -----> image !!!  data set? /!/ I’m a designer, not an AI pro so if the answer to this is a firm “no” then that’s totally fine! I was wondering if there is a tool to which I can upload an image set and an ai will spit out its own generated images based on the set? I’m not a huge coder (just a small coder) but I was hoping for a relatively pre made too. Any ideas?", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/99hn43/is_there_an_online_image_generation_tool_to_which/"}, {"autor": "Danj_memes_", "date": "2018-12-17 19:15:51", "content": "ANY EXPERT'S OPINIONS ON AI AS AN ARTISTIC TOOL. /!/ Ever since we developed new ways to communicate &amp; express each other we have been transforming our culture and its art.\n\nWether its video or -----> photography !!!  or smartphone selfies. From digital art to cubism or from stopmotion to realism. Tech changes art and thus the society itself \n\nAI as an artist is no doubt going to hit hard our society (as we saw this year only a painting made by ai artificial artist sold in an auction for ample amounts of money) and its art\n\nThe question now remains is how hard this tech is going to hit now? ", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/a72veo/any_experts_opinions_on_ai_as_an_artistic_tool/"}, {"autor": "PriPauPri", "date": "2018-12-17 05:38:32", "content": "Great video on ai -----> image !!!  synthesis", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/a6wzdm/great_video_on_ai_image_synthesis/"}, {"autor": "flowish8", "date": "2018-10-19 14:05:55", "content": "AI picked this cover -----> photo !!!  for my video and it's got it SO wrong 😂", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9pk4hh/ai_picked_this_cover_photo_for_my_video_and_its/"}, {"autor": "Vision_Guru", "date": "2018-09-19 15:18:01", "content": "How do I train model which has -----> Image !!!  as an Input and Output are some numbers assocaited with it? /!/ Basically I have a video, from which I have generated frames, and each frames has some value ( Real number) associated with it. So I have created a \"CSV\" file, which Column 1 contains image paths and Column 2 contains its corresponding values. Now I am having trouble reading the images and train the model ( prefreably CNN). Any help would be great.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9h61ol/how_do_i_train_model_which_has_image_as_an_input/"}, {"autor": "cbnits", "date": "2018-09-13 08:03:42", "content": "HomeCourt is an AI basketball coach that uses your iPhone -----> camera !!!  to analyze your shot and suggest improvements.", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9fg3vg/homecourt_is_an_ai_basketball_coach_that_uses/"}, {"autor": "Gloria_Joyce", "date": "2018-09-12 14:03:42", "content": "-----> Image !!!  editing is hard and time consuming — AI is about to fix all that", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/9f81cy/image_editing_is_hard_and_time_consuming_ai_is/"}, {"autor": "Melody-Wooask", "date": "2018-11-29 06:49:40", "content": "how do you communicate when in a different country /!/ Wooask **AI Voice Translation Solutions + Global Social Meetups Platform Without** **Language Barriers** \n\n&amp;#x200B;\n\nHow do you communicate in a different country and different language environment? We are going to see one company wooask technology born to solve this problem.\n\nOn 20th China High-Tech Fair ( CHTF ), Shenzhen Wooask Technology has released the latest technology &amp; products: AI voice / speech translation solutions + global social meetups platform on the NEW TECH NEW Product Activity on Nov 15th, 2018.\n\n📷 \n\nWith the opening of “ One Belt, One Road”policy, diplomacy, trade, and tourism are becoming more frequent. There are more and more To B &amp; To C business going abroad, and the market prospects of AI Voice Translation are broad.\n\nAmong many of the innovative products of CHTF, Shenzhen Wooask Technology AI Voice Translators full of High-Tech Feeling.\n\nStylish design, Powerful Function📷\n\nWooask AI Voice Translator was designated translation machine brand in the 3th PEGC. Stylish, small, portable, easy to use, powerful function; support up to 43 languages real-time two way translation; support link to bluetooth, wifi / 4G; equipped with NMT neural network, instant translate and accuracy higher up to 97%. It perfectly solves the communication problems of offline travel and business negotiation.\n\n📷\n\n**Under the “One Belt, One Road” policy advocated by the Government, Wooask** **Technology are working hard online &amp; offline to contribute their own strength to the smooth flow of language and trade circulation!**\n\n**Magic Tool on Foreign Trade**\n\n**Fame follow merit** \n\nWooask APP打通线上沟通障碍，为“一带一路”积极赋能，它获得了联合国前秘书潘基文的认可！\n\nWooask APP breaks the online language barriers, actively empower the “One Belt, One Road “. Former UN general Mr. Ban Ki-moon gave his best compliment on Wooask.\n\n📷\n\nMr. Ban Ki-moon, Mrs Liu Chun-se taking -----> photo !!!  with Wooask CEO Mr. Andy Lee\n\n📷📷\n\nWooask APP, with portable translation, personal information &amp; Moments auto translation, remote dialogue translation, group chat translation, etc. there are millions of customers in the platform...With Wooask APP, you can do foreign business, find and meetup global clients without language barriers.\n\nDuring Global Sources Mobile Electronics 2018, many clients have reached cooperation through wooask app.\n\n📷📷\n\nOn Wooask App, we not only support meetups in domestic &amp; international exhibition such as CHTF, CES, but also support city meetups such as shenzhen, Bangkok and New York.\n\n📷 \n\nShenzhen Wooask Technology committed to creating the leading artificial intelligence products and applications with voice/speech translation and other advanced function and feature since established.  \nWe focus on the development and integration of voice translation engines, based on translation engines and voice interaction technology, the development of the global barrier-free social networking platform \"Wooask\" mobile APP and AI translators and other intelligent hardware products.\n\n At present,  We formed three products series: Wooask APP platform, AI Translator series, Software Customization Development, we provide customerswith hardware solutions, software customization, cloud services, product integration and other all-round Speech Translation as the core of the Artificial Intelligence product overall solution. \n\nWe believe that with the efforts of the wooask technology, with the help of the Wooask APP and Wooask AI voice translator, global non-language barriers and trade circulation will be realized soon!", "link": "https://www.reddit.com/r/ArtificialInteligence/comments/a1f0cp/how_do_you_communicate_when_in_a_different_country/"}], "name": "Subreddit_ArtificialInteligence_01_01_2018-30_12_2018"}