{"interestingcomments": [{"autor": "Se7en-E11even", "date": "2020-05-02 02:45:07", "content": "Which camera should I get?? /!/ I’m an amateur film maker looking to break into the game .. with all my research (and budget) I’ve narrowed it down to these three cameras:\nSony A6400\nCanon M6 - mark ii\nCanon RP\n\nwhich should camera do you guys recommend I invent in? :)", "link": "https://www.reddit.com/r/Cameras/comments/gbyr80/which_camera_should_i_get/", "origin": "Reddit", "suborigin": "Cameras", "result": true, "Selector": "i invent", "selectorShort": "invent", "MarkedSent": "which camera should i get?? /!/ i’m an amateur film maker looking to break into the game .. with all my research (and budget) -----> i !!! ’ve narrowed it down to these three cameras:\nsony a6400\ncanon m6 - mark ii\ncanon rp\n\nwhich should camera do you guys recommend -----> i !!!  -----> invent !!!  in? :)", "sortedWord": "None", "Identifyer": null, "identifyer": 3194, "year": "2020"}, {"autor": "cpu5555", "date": "2018-09-25 03:59:58", "content": "Using computational imaging similar to Light L16, is it possible to make a non helicoid optical zoom for it? What about analog gamma compression for the sensors and other ideas? /!/ For background, I want to invent a new digital camera system. This will combine different ideas and concepts. I know some of them have issues that must be addressed. It will not be suitable for all situations and that is okay.\n\n&amp;#x200B;\n\nI found out about the Light L16. It uses several small lenses and sensors to get the equivalent of one large sensor. The problem is that it uses fixed focal length lenses. There are groups of lenses with the same focal length and different options. The camera crops instead of having continuous focal length adjustment. I am curious if making adjustable focal length lenses without the helicoid principle will help. For background, there is a rare Minolta 40-80 f/2.8 lens that is without the helicoid principle. It uses a rotating wheel on the side. It is optically superior to comparable modern zooms and lower weight. If adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? Will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. Is close focusing possible? What is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200B;\n\nI want to implement analog gamma compression. I read studies about prototype chip based sensors with this technology. I want to improve ISO invariance, lower the effects of downstream noise, and improve underexposure tolerance. One prototype demonstrated a range of about 18.5 stops with a 12 bit ADC and a gamma compression factor of about 2.9. My system will have a 12 bit ADC with a gamma compression factor of 3. This fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200B;\n\nI want to use an electronic shutter as expected. I want to enable a flash sync speed of 1/8000 of a second. How fast would the readout need to be for that to be possible without artifacts? What components could be added to LED light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200B;\n\nIs a continuous variable ND filter possible?\n\n&amp;#x200B;\n\nWhat is a good open source real time OS that can be used? The Light L16 uses a general purpose OS. I want one that will allow any modifications to fix bugs. What are ways to prevent bugs? Will inspecting the code repeatedly before testing help? Users are more forgiving of missing features than programing errors.\n\n&amp;#x200B;\n\nI want the end image to be a native square. I want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. Would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200B;\n\nI want to design the RAW format to have the image combination and demosaicing done before saving to card. With lossy RAW video, it can use interframe interpolation or be intra only. I will make an optional dedicated external unit for RAW processing. In the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. Because ICC profiles and LUTs are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200B;\n\nWhat thoughts and ideas do you have? What are good subreddits for this? What is your advice? Thanks in advance.", "link": "https://www.reddit.com/r/photography/comments/9ioxf6/using_computational_imaging_similar_to_light_l16/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "i want to invent", "selectorShort": "invent", "MarkedSent": "using computational imaging similar to light l16, is it possible to make a non helicoid optical zoom for it? what about analog gamma compression for the sensors and other ideas? /!/ for background, -----> i !!!  -----> want !!!  -----> to !!!  -----> invent !!!  a new digital camera system. this will combine different ideas and concepts. i know some of them have issues that must be addressed. it will not be suitable for all situations and that is okay.\n\n&amp;#x200b;\n\ni found out about the light l16. it uses several small lenses and sensors to get the equivalent of one large sensor. the problem is that it uses fixed focal length lenses. there are groups of lenses with the same focal length and different options. the camera crops instead of having continuous focal length adjustment. i am curious if making adjustable focal length lenses without the helicoid principle will help. for background, there is a rare minolta 40-80 f/2.8 lens that is without the helicoid principle. it uses a rotating wheel on the side. it is optically superior to comparable modern zooms and lower weight. if adjustable focal length lenses could be made for this without the helicoid principle, can a motor adjust the focal length without making the camera too bulky? will a continuous adjustable aperture and auto focusing be feasible with a group of non helicoid zoom lenses covering a group of small sensors. is close focusing possible? what is a good solution to allow filters like polarizers to be installed?\n\n&amp;#x200b;\n\ni want to implement analog gamma compression. i read studies about prototype chip based sensors with this technology. i want to improve iso invariance, lower the effects of downstream noise, and improve underexposure tolerance. one prototype demonstrated a range of about 18.5 stops with a 12 bit adc and a gamma compression factor of about 2.9. my system will have a 12 bit adc with a gamma compression factor of 3. this fits 3 stops of dynamic range into the top 50% (unlike a linear curve in which the top 50% has 1 stop).\n\n&amp;#x200b;\n\ni want to use an electronic shutter as expected. i want to enable a flash sync speed of 1/8000 of a second. how fast would the readout need to be for that to be possible without artifacts? what components could be added to led light and xenon flash to prevent harsh effects like red eye?\n\n&amp;#x200b;\n\nis a continuous variable nd filter possible?\n\n&amp;#x200b;\n\nwhat is a good open source real time os that can be used? the light l16 uses a general purpose os. i want one that will allow any modifications to fix bugs. what are ways to prevent bugs? will inspecting the code repeatedly before testing help? users are more forgiving of missing features than programing errors.\n\n&amp;#x200b;\n\ni want the end image to be a native square. i want to make models that have area equivalents of 24x24mm, 36x36mm, and 54x54mm. would it be more effective to use groups with larger sensors, more sensors of the same size, or a compromise?\n\n&amp;#x200b;\n\ni want to design the raw format to have the image combination and demosaicing done before saving to card. with lossy raw video, it can use interframe interpolation or be intra only. i will make an optional dedicated external unit for raw processing. in the rendering phase of color editing, the files will be 12 bits per channel with calculations using 16 or 32 bits per channel. because icc profiles and luts are destructive, they will be applied at the end of the rendering phase and only be used for preview during editing.\n\n&amp;#x200b;\n\nwhat thoughts and ideas do you have? what are good subreddits for this? what is your advice? thanks in advance.", "sortedWord": "None", "Identifyer": null, "identifyer": 31927, "year": "2018"}, {"autor": "ufgrat", "date": "2020-05-20 03:39:38", "content": "Paterson developing tank pro-tip /!/ This may be old news to some.  But before you put that reel into your changing bag, check both ball bearings on the film guides and make sure they move easily.\n\nTrust me-- if you're a novice at this, you will absolutely lose your mind trying to figure out why the film won't load-- and it won't.  No matter how much you swear, juggle, rotate or otherwise try to coax it.\n\nAnd then (assuming you haven't had a psychotic break yet) you have to figure out how to get the other reel into the bag without light leakage (Answer:  Dim room, open first zipper, place reel between panels, close zipper, open second zipper inside bag, retrieve reel, close second zipper).\n\nI think I invented 13 new expletives.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gn3ysb/paterson_developing_tank_protip/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "i invented", "selectorShort": "invent", "MarkedSent": "paterson developing tank pro-tip /!/ this may be old news to some.  but before you put that reel into your changing bag, check both ball bearings on the film guides and make sure they move easily.\n\ntrust me-- if you're a novice at this, you will absolutely lose your mind trying to figure out why the film won't load-- and it won't.  no matter how much you swear, juggle, rotate or otherwise try to coax it.\n\nand then (assuming you haven't had a psychotic break yet) you have to figure out how to get the other reel into the bag without light leakage (answer:  dim room, open first zipper, place reel between panels, close zipper, open second zipper inside bag, retrieve reel, close second zipper).\n\n-----> i !!!  think -----> i !!!  -----> invented !!!  13 new expletives.", "sortedWord": "None", "Identifyer": null, "identifyer": 57217, "year": "2020"}], "name": "inventSonyAlpha2019"}