{"interestingcomments": [{"Unnamed: 0": 113558, "autor": "homesteadhow", "date": 1604355403000, "content": "30 Ways WE Use (Recycle) Firewood Ash on our Homestead... /!/ https://preview.redd.it/ht4mhr2oiww51.png?width=1280&amp;format=png&amp;auto=webp&amp;s=059c6409d950ffd82f71010b36595e1c14fdd1a6\n\nWe process tons of firewood each year on our homestead. Nothing is better than a warm fire on a cold snowy day, especially when that fire was made possible from firewood you cut, split and stoked yourself! But what about all the leftover ash? There are so many uses for firewood ash and in todays post we are going to share 30 uses for firewood ash. [**We have a really fun video version we did here.**](https://youtu.be/wRO4kBD9CUI) \n\n**Fireplace Glass Cleaner**\n\nGlass doors on your fireplace or woodstove notoriously become stained with creosote and soot. \n\nA bit of the fine ash on a damp sponge can be used  to scrub it away!\n\nWait for your wood stove to cool down completely before trying this. \n\n**Glass Top Stove Cleaner**\n\nThe same method per above can be used to clean your glass top stove. Make an ash paste using the ash and a little water.\n\nBe sure you are using only the fine powdery ash to make your paste.\n\n**Boost Your Hen’s Laying Power**\n\nUse wood ash to supplement your chicken feed. You may be pleased with better lay rates and longer laying periods.\n\nMix in the wood ash with your chicken feed at a 1% ratio. This may even help to reduce the smell of your chickens, um-well stinky eggs! \n\n**Freshen Up Your Fridge/Freezer**\n\nSimilar to how baking soda absorbs odors, wood ash will do the same. Only ash is free and you probably have a lot of it!\n\nUse about a cup of fine wood ash. Put it in a mason jar or a small bag towards the back of your refrigerator or freezer. \n\n**Wood Ash Toothpaste**\n\nYour grandparents probably did this! YES, you can even brush your teeth with wood ash.  \n\n**Adjust Acidic Soil**\n\nWood ash is an excellent soil amendment for heavily acidic soil.\n\nYou can use ashes to help balance the pH of acidic soil. It’s best to test the pH of your soil first before applying. \n\nThe best time to do this is before planting when you can amend it directly into the soil. \n\n**Improve Your Compost**\n\nTo improve your compost throw in some ash, this boosts the nutrient-dense environment that’s cooking in your compost.\n\n**Prevent Snails and Slugs by your plants**\n\nSnails &amp; slugs can ruin a garden. \n\nStop these guys in their tracks by making a circle of ash around plants susceptible to snails and slugs.\n\n**Save Crops from Frost Damage**\n\nWhen the temperatures start to fall, nothing is more worrisome than the thought of frost!\n\nAsh can also help with crops such as, Insulating your plants when you are worried about frost, with some ash.\n\n**Dust-Bathing Chicks**\n\nChickens love to take dust baths! In the winter, our sand and dust is covered with snow so we provide an artificial dust bath with ash!\n\n**Dust Powder Protection for Your Animals**\n\nIn the same vein, rubbing ashes into your dog or cat’s fur can help kill fleas as well as deodorize their fur. Try it on your farm animals such as your goats, cows and more to decrease the pests.\n\n**Deodorize Your Chicken Coop**\n\nPut a thick layer of your wood ash, also use some charcoal chunks, in the chicken coop before adding whatever litter you use on top to keep your chicken coop fresh and clean. This helps with the smell and bugs that you may have in your chicken coop.\n\n**Control Litter Box Odor**\n\nYou may have guessed it, the odor-absorbing power of charcoal saves the day again.\n\nWood ash was the original cat litter, after all, used by cat owners before the invention of commercial clay litters. Sprinkle about a cup of ashes with a few smaller bits of charcoal into clean cat litter and mix it in.\n\n**Undo a Skunk Encounter**\n\nIt’s every dog owner’s worst nightmare, and it always seems to happen at night as you’re getting ready for bed. Use it while you're showering your dog. No need to waste all those tomatoes.\n\n**Keep Your Silver Shining**\n\nI don’t know anyone that enjoys polishing silver, but you can use wood ash to make the job a little easier.\n\nYou’ll want to make a thick paste using the more fluffy white ash and some water.\n\nSmear the paste on your silver item and let it sit for a few minutes before wiping it off and rinsing off with water and if needed soap.\n\nAlso you can use a little bit of ash on a felt cloth to buff your silver to a high sheen then rinse and dry well. You may also polish brass the same way.\n\n**Make DIY Soap**\n\nThis tip is one of the more commons because we have been using this for a very long time...\n\nBut here is a great DIY for making soap using the ashes from your wood stove.\n\n**CAUTION**: lye is caustic and can cause burns, be careful, and wear the proper protective equipment.\n\n**Prevent Pond Algae**\n\nGive your aquatic plants the upper hand by feeding them potassium-rich ash. In turn, they will thrive leaving the algae without the nutrients it needs to survive.\n\nWhen it comes to using ashes in the pond, you do not need to use much, like they say a little goes a long way! Off the Grid News states that you should use roughly one tablespoon per 1,000 gallons of water.\n\nIf you aren’t sure of your water volume, proceed with caution; start small and add a little more if you think so but make sure not to use too much.\n\n**Stop Mice and Other Household Pests**\n\nThere is something about ashes that drives rats, mice and other household pests away.\n\nUse this natural pest control to keep them out of your house without having to use dangerous and toxic chemicals. Sprinkle little portions of where it's needed.\n\nYou might want to use this technique in your attic or garage. Just sprinkle a little in the corners!\n\n**Protect  Fine Fabrics**\n\nProtect blankets and clothes from moth damage by giving them a little sprinkle of fine wood ash before putting them into storage.\n\nSimply brush off the ash and wash as usual when you bring them out of storage.\n\n**Dry Shampoo**\n\nWood ash has been used as a dry shampoo long before all the fancy dry shampoos today. Start with a small amount, a pinch or two of powdery ash should do. Just add it to where you wish. Massage the ash into your scalp and roots as you would a normal shampoo.  Wait a few minutes for the ash to absorb the excess oil then flip your head down and fluff your hair again to shake out any excess. Then brush your hair out.\n\n**Wound Care**\n\nWood ash has been used to treat wounds for very many years.\n\nIt’s thought to have antibacterial properties and to speed clotting. There was even a study by ISRA University, which showed that wounds (to a rabbit) that were treated with wood ash healed quicker than those that were not using wood ash.\n\n**Deodorant**\n\nWe have learned that wood ash helps absorb odors and oils, so why not use it for a deodorant. Don't get me wrong it obviously won't smell too good, so if you are going to use this you might want to use essential oils.\n\n**Free Fire Extinguisher**\n\nAsh makes an inexpensive fire extinguisher, smothering flames and depriving them of oxygen. You might want to keep buckets in places where a fire could easily break out. You also might want to use this method if you have a fireplace in your home.\n\n**Grill Cleaner**\n\nMix up a paste using ash and water and apply evenly to the grates and the inside of the grill. You could also use the ash and water and mix it with the animal fats leftover from the grilling and make a natural soap.\n\nLet them sit for a few minutes and then give them a scrub!. Rinse well with water. You might want to wear some gloves for this chore: the soap may be pretty drying.\n\n**Save Seeds for Next Year (Keep them Dry)**\n\nSeeds that aren’t properly stored lose their viability and won’t grow well. Saving the seeds in a good insulated container or whatever you use to store your seeds is the way to go! This will help absorb any moisture to help keep them ready for next year's garden!\n\n**Soak Up Oil Spills in the Garage**\n\nHave you ever once wanted to be able to change the oil on your vehicle without making a mess and splashing oil on the ground?\n\nWell if you have, you can use that wood ash to soak up your oil spills. Then sweep it all up and then all you need is to dispose of it properly.\n\n**Hide Stains in Concrete**\n\nOnce you’ve cleaned up your oil spill put down a second layer of ash on the ground and rub it in. Ash is great for hiding stains and discoloration especially on concrete, as it is almost the same color!\n\n**Make Ants to Relocate**\n\nDumping ashes on an ant hill will help get rid of ants. Best of all it’s not toxic or poisonous. It's simple just use the ash and dump in on the ant hill and soon enough they will be gone!\n\n**Pet Paw Safe Ice Melt**\n\nKeep your sidewalks ice free and your pets paws safe this winter. When the ice begins to show up, sprinkle some wood ash on your sidewalk or any other walking paths to melt it off without the concern of using an ice-melting product that could be harmful to your pets.\n\n**Vehicle Unstucker!** \n\nStore a little plastic container of ash in the trunk of your vehicle. If you get stuck, the ash works well to gain some traction and also melts the ice!", "link": "https://www.reddit.com/r/homestead/comments/jmxloc/30_ways_we_use_recycle_firewood_ash_on_our/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "30 ways we use (recycle) firewood ash on our homestead... /!/ https://preview.redd.it/ht4mhr2oiww51.png?width=1280&amp;format=png&amp;auto=webp&amp;s=059c6409d950ffd82f71010b36595e1c14fdd1a6\n\nwe process tons of firewood each year on our homestead. nothing is better than a warm fire on a cold snowy day, especially when that fire was made possible from firewood you cut, split and stoked yourself! but what about all the leftover ash? there are so many uses for firewood ash and in todays post we are going to share 30 uses for firewood ash. [**we have a really fun video version we did here.**](https://youtu.be/wro4kbd9cui) \n\n**fireplace glass cleaner**\n\nglass doors on your fireplace or woodstove notoriously become stained with creosote and soot. \n\na bit of the fine ash on a damp sponge can be used  to scrub it away!\n\nwait for your wood stove to cool down completely before trying this. \n\n**glass top stove cleaner**\n\nthe same method per above can be used to clean your glass top stove. make an ash paste using the ash and a little water.\n\nbe sure you are using only the fine powdery ash to make your paste.\n\n**boost your hen’s laying power**\n\nuse wood ash to supplement your chicken feed. you may be pleased with better lay rates and longer laying periods.\n\nmix in the wood ash with your chicken feed at a 1% ratio. this may even help to reduce the smell of your chickens, um-well stinky eggs! \n\n**freshen up your fridge/freezer**\n\nsimilar to how baking soda absorbs odors, wood ash will do the same. only ash is free and you probably have a lot of it!\n\nuse about a cup of fine wood ash. put it in a mason jar or a small bag towards the back of your refrigerator or freezer. \n\n**wood ash toothpaste**\n\nyour grandparents probably did this! yes, you can even brush your teeth with wood ash.  \n\n**adjust acidic soil**\n\nwood ash is an excellent soil amendment for heavily acidic soil.\n\nyou can use ashes to help balance the ph of acidic soil. it’s best to test the ph of your soil first before applying. \n\nthe best time to do this is before planting when you can amend it directly into the soil. \n\n**improve your compost**\n\nto improve your compost throw in some ash, this boosts the nutrient-dense environment that’s cooking in your compost.\n\n**prevent snails and slugs by your plants**\n\nsnails &amp; slugs can ruin a garden. \n\nstop these guys in their tracks by making a circle of ash around plants susceptible to snails and slugs.\n\n**save crops from frost damage**\n\nwhen the temperatures start to fall, nothing is more worrisome than the thought of frost!\n\nash can also help with crops such as, insulating your plants when you are worried about frost, with some ash.\n\n**dust-bathing chicks**\n\nchickens love to take dust baths! in the winter, our sand and dust is covered with snow so we provide an artificial dust bath with ash!\n\n**dust powder protection for your animals**\n\nin the same vein, rubbing ashes into your dog or cat’s fur can help kill fleas as well as deodorize their fur. try it on your farm animals such as your goats, cows and more to decrease the pests.\n\n**deodorize your chicken coop**\n\nput a thick layer of your wood ash, also use some charcoal chunks, in the chicken coop before adding whatever litter you use on top to keep your chicken coop fresh and clean. this helps with the smell and bugs that you may have in your chicken coop.\n\n**control litter box odor**\n\nyou may have guessed it, the odor-absorbing power of charcoal saves the day again.\n\nwood ash was the original cat litter, after all, used by cat owners before the invention of commercial clay litters. sprinkle about a cup of ashes with a few smaller bits of charcoal into clean cat litter and mix it in.\n\n**undo a skunk encounter**\n\nit’s every dog owner’s worst nightmare, and it always seems to happen at night as you’re getting ready for bed. use it while you're showering your dog. no need to waste all those tomatoes.\n\n**keep your silver shining**\n\ni don’t know anyone that enjoys polishing silver, but you can use wood ash to make the job a little easier.\n\nyou’ll want to make a thick paste using the more fluffy white ash and some water.\n\nsmear the paste on your silver item and let it sit for a few minutes before wiping it off and rinsing off with water and if needed soap.\n\nalso you can use a little bit of ash on a felt cloth to buff your silver to a high sheen then rinse and dry well. you may also polish brass the same way.\n\n**make -----> diy !!!  soap**\n\nthis tip is one of the more commons because we have been using this for a very long time...\n\nbut here is a great diy for making soap using the ashes from your wood stove.\n\n**caution**: lye is caustic and can cause burns, be careful, and wear the proper protective equipment.\n\n**prevent pond algae**\n\ngive your aquatic plants the upper hand by feeding them potassium-rich ash. in turn, they will thrive leaving the algae without the nutrients it needs to survive.\n\nwhen it comes to using ashes in the pond, you do not need to use much, like they say a little goes a long way! off the grid news states that you should use roughly one tablespoon per 1,000 gallons of water.\n\nif you aren’t sure of your water volume, proceed with caution; start small and add a little more if you think so but make sure not to use too much.\n\n**stop mice and other household pests**\n\nthere is something about ashes that drives rats, mice and other household pests away.\n\nuse this natural pest control to keep them out of your house without having to use dangerous and toxic chemicals. sprinkle little portions of where it's needed.\n\nyou might want to use this technique in your attic or garage. just sprinkle a little in the corners!\n\n**protect  fine fabrics**\n\nprotect blankets and clothes from moth damage by giving them a little sprinkle of fine wood ash before putting them into storage.\n\nsimply brush off the ash and wash as usual when you bring them out of storage.\n\n**dry shampoo**\n\nwood ash has been used as a dry shampoo long before all the fancy dry shampoos today. start with a small amount, a pinch or two of powdery ash should do. just add it to where you wish. massage the ash into your scalp and roots as you would a normal shampoo.  wait a few minutes for the ash to absorb the excess oil then flip your head down and fluff your hair again to shake out any excess. then brush your hair out.\n\n**wound care**\n\nwood ash has been used to treat wounds for very many years.\n\nit’s thought to have antibacterial properties and to speed clotting. there was even a study by isra university, which showed that wounds (to a rabbit) that were treated with wood ash healed quicker than those that were not using wood ash.\n\n**deodorant**\n\nwe have learned that wood ash helps absorb odors and oils, so why not use it for a deodorant. don't get me wrong it obviously won't smell too good, so if you are going to use this you might want to use essential oils.\n\n**free fire extinguisher**\n\nash makes an inexpensive fire extinguisher, smothering flames and depriving them of oxygen. you might want to keep buckets in places where a fire could easily break out. you also might want to use this method if you have a fireplace in your home.\n\n**grill cleaner**\n\nmix up a paste using ash and water and apply evenly to the grates and the inside of the grill. you could also use the ash and water and mix it with the animal fats leftover from the grilling and make a natural soap.\n\nlet them sit for a few minutes and then give them a scrub!. rinse well with water. you might want to wear some gloves for this chore: the soap may be pretty drying.\n\n**save seeds for next year (keep them dry)**\n\nseeds that aren’t properly stored lose their viability and won’t grow well. saving the seeds in a good insulated container or whatever you use to store your seeds is the way to go! this will help absorb any moisture to help keep them ready for next year's garden!\n\n**soak up oil spills in the garage**\n\nhave you ever once wanted to be able to change the oil on your vehicle without making a mess and splashing oil on the ground?\n\nwell if you have, you can use that wood ash to soak up your oil spills. then sweep it all up and then all you need is to dispose of it properly.\n\n**hide stains in concrete**\n\nonce you’ve cleaned up your oil spill put down a second layer of ash on the ground and rub it in. ash is great for hiding stains and discoloration especially on concrete, as it is almost the same color!\n\n**make ants to relocate**\n\ndumping ashes on an ant hill will help get rid of ants. best of all it’s not toxic or poisonous. it's simple just use the ash and dump in on the ant hill and soon enough they will be gone!\n\n**pet paw safe ice melt**\n\nkeep your sidewalks ice free and your pets paws safe this winter. when the ice begins to show up, sprinkle some wood ash on your sidewalk or any other walking paths to melt it off without the concern of using an ice-melting product that could be harmful to your pets.\n\n**vehicle unstucker!** \n\nstore a little plastic container of ash in the trunk of your vehicle. if you get stuck, the ash works well to gain some traction and also melts the ice!", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/jmxloc/30_ways_we_use_recycle_firewood_ash_on_our/", "identifyer": 113558, "year": "2020"}, {"Unnamed: 0": 113588, "autor": "Ecomanvids", "date": 1604223997000, "content": "Smallest DIY Micro tool - the ZiPPA", "link": "https://www.reddit.com/r/homestead/comments/jlzrkg/smallest_diy_micro_tool_the_zippa/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "smallest -----> diy !!!  micro tool - the zippa", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": "rich:video", "medialink": "https://www.youtube.com/watch?v=IfIjVNka3qc&amp;feature=share", "identifyer": 113588, "year": "2020"}, {"Unnamed: 0": 114648, "autor": "RideAlongside", "date": 1586133754000, "content": "DIY Chicken Tractor from Pallets", "link": "https://www.reddit.com/r/homestead/comments/fvoxme/diy_chicken_tractor_from_pallets/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  chicken tractor from pallets", "sortedWord": "None", "removed": null, "score": 3, "comments": 1, "media": "image", "medialink": "https://i.redd.it/g691jeahg3r41.jpg", "identifyer": 114648, "year": "2020"}, {"Unnamed: 0": 116930, "autor": "SilentEnigma1210", "date": 1579612231000, "content": "Small Barn Help? /!/ So we bought this property in October and we need a small barn up asap once spring hits. Room for 2 cows, 3-4 goats, and a pig. This would only be evening and inclement weather lodging. We have plenty of room for them to roam in fenced pasture otherwise. Spending a large amount of money is not an option at this point so if I want a barn soon, I have to do it mostly DIY. Im not an engineer but a fairly accomplished carpenter and can use a tool or 4. However, I have never built a building. I have plenty of access to wood. Anyone have any good references or places to start for this?", "link": "https://www.reddit.com/r/homestead/comments/eruhe6/small_barn_help/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "small barn help? /!/ so we bought this property in october and we need a small barn up asap once spring hits. room for 2 cows, 3-4 goats, and a pig. this would only be evening and inclement weather lodging. we have plenty of room for them to roam in fenced pasture otherwise. spending a large amount of money is not an option at this point so if i want a barn soon, i have to do it mostly -----> diy !!! . im not an engineer but a fairly accomplished carpenter and can use a tool or 4. however, i have never built a building. i have plenty of access to wood. anyone have any good references or places to start for this?", "sortedWord": "None", "removed": null, "score": 1, "comments": 11, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/eruhe6/small_barn_help/", "identifyer": 116930, "year": "2020"}, {"Unnamed: 0": 117127, "autor": "HotN00b", "date": 1604784515000, "content": "oct 17 - homestead update - masonry heater, firewood - tractor is back! - DIY Homestead", "link": "https://www.reddit.com/r/homestead/comments/jpyqqt/oct_17_homestead_update_masonry_heater_firewood/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "oct 17 - homestead update - masonry heater, firewood - tractor is back! - -----> diy !!!  homestead", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": "rich:video", "medialink": "https://youtu.be/wVwh6HeHDJc", "identifyer": 117127, "year": "2020"}, {"Unnamed: 0": 118804, "autor": "Teddyworks", "date": 1595580788000, "content": "Anyone ever DIY a weed sprayer boom? /!/ Have any links to the spray jets you used? A website with a good write up? I wasn’t impressed with the ones I found on YouTube. \n\nI looked into buying one, but they seem wildly expensive. The one made for my 25 gal sprayer is over $200 just for the boom add-on. \n\nThanks in advance!", "link": "https://www.reddit.com/r/homestead/comments/hwydtg/anyone_ever_diy_a_weed_sprayer_boom/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "anyone ever -----> diy !!!  a weed sprayer boom? /!/ have any links to the spray jets you used? a website with a good write up? i wasn’t impressed with the ones i found on youtube. \n\ni looked into buying one, but they seem wildly expensive. the one made for my 25 gal sprayer is over $200 just for the boom add-on. \n\nthanks in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/hwydtg/anyone_ever_diy_a_weed_sprayer_boom/", "identifyer": 118804, "year": "2020"}, {"Unnamed: 0": 120611, "autor": "HotN00b", "date": 1588209894000, "content": "Hardy Bio-diesel / Oil perennial Crop? Possible? /!/ Hi,  \n\n\ni'm wondering if there is a perennial crop for Zone 3A or colder that can be used to produce oil / ultimately bio-diesel.   \n\n\nany ideas?   \n\n\nbasically looking for a low-maintenance / low-cost crop. i have lots of space, and a tractor, but want to avoid having to seed every year type thing to save a bit on fuel / ( or incase of zombie apocalypse ).    \n\n\n\\---  \n\n\nor should i accept that i'll need a seeder if i want cheap bio-diesel and empty my wallet ? :(  \nor... maybe there is a DIY seeder machine that i can make for my tractor? :P", "link": "https://www.reddit.com/r/homestead/comments/gam987/hardy_biodiesel_oil_perennial_crop_possible/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hardy bio-diesel / oil perennial crop? possible? /!/ hi,  \n\n\ni'm wondering if there is a perennial crop for zone 3a or colder that can be used to produce oil / ultimately bio-diesel.   \n\n\nany ideas?   \n\n\nbasically looking for a low-maintenance / low-cost crop. i have lots of space, and a tractor, but want to avoid having to seed every year type thing to save a bit on fuel / ( or incase of zombie apocalypse ).    \n\n\n\\---  \n\n\nor should i accept that i'll need a seeder if i want cheap bio-diesel and empty my wallet ? :(  \nor... maybe there is a -----> diy !!!  seeder machine that i can make for my tractor? :p", "sortedWord": "None", "removed": null, "score": 1, "comments": 0, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/gam987/hardy_biodiesel_oil_perennial_crop_possible/", "identifyer": 120611, "year": "2020"}], "name": "diyhomestead2020"}