{"interestingcomments": [{"Unnamed: 0": 135396, "autor": "frankie2fngrs", "date": 1613662136000, "content": "We setup to make 1200 pounds of Venison Dry Sausage. Antique meat grinders and cast iron pots!", "link": "https://www.reddit.com/r/homestead/comments/lmp9m8/we_setup_to_make_1200_pounds_of_venison_dry/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "we setup to make", "selectorShort": "make", "MarkedSent": "-----> we !!!  -----> setup !!!  -----> to !!!  -----> make !!!  1200 pounds of venison dry sausage. antique meat grinders and cast iron pots!", "sortedWord": "None", "removed": "reddit", "score": 1, "comments": 0, "media": "rich:video", "medialink": "https://youtu.be/0MigSAjx9TI", "identifyer": 135396, "year": "2021"}, {"Unnamed: 0": 138687, "autor": "jdavid108", "date": 1621295363000, "content": "Rain collection for potable use advice/guidance needed. /!/ Hi all,\n\nMy wife and i are building a home on some family land and we are leaning heavily towards rain catchment for our primary water source. We are located outside of chattanooga tn where its rains enough to support ourselves.  I have done extensive research on cistern systems that could supply our needs.  I am in need of (1.) Clarification on whether or not using rainwater for potable purposes is legal in walker co ga (we are getting conflicting information form local and state govt) (2) I need someone (ideally near Chattanooga) to consult me on products, design, etc.  I have never done this before so i need a bit of help.  My wife and i are both mechanically inclined and construction savvy and have tools and machinery.  Help us make this happen!  Thank you in advance!", "link": "https://www.reddit.com/r/homestead/comments/nevl4v/rain_collection_for_potable_use_adviceguidance/", "origin": "Reddit", "suborigin": "homestead", "result": true, "Selector": "us make", "selectorShort": "make", "MarkedSent": "rain collection for potable use advice/guidance needed. /!/ hi all,\n\nmy wife and i are building a home on some family land and we are leaning heavily towards rain catchment for our primary water source. we are located outside of chattanooga tn where its rains enough to support ourselves.  i have done extensive research on cistern systems that could supply our needs.  i am in need of (1.) clarification on whether or not using rainwater for potable purposes is legal in walker co ga (we are getting conflicting information form local and state govt) (2) i need someone (ideally near chattanooga) to consult me on products, design, etc.  i have never done this before so i need a bit of help.  my wife and i are both mechanically inclined and construction savvy and have tools and machinery.  help -----> us !!!  -----> make !!!  this happen!  thank you in advance!", "sortedWord": "None", "removed": null, "score": 1, "comments": 5, "media": null, "medialink": "https://www.reddit.com/r/homestead/comments/nevl4v/rain_collection_for_potable_use_adviceguidance/", "identifyer": 138687, "year": "2021"}], "name": "makehomestead2021"}