{"interestingcomments": [{"Unnamed: 0": 1175, "autor": 155, "date": null, "content": "MathWorks Excellence in Innovation Projects\nContribute to the progress of engineering and science by solving key industry challenges!\nAre you looking for a design or research project idea with real industry relevance? This is a list of inspiring projects based on industry trends for your capstone, senior design project, or final year assignment. These projects help you learn about technology trends while becoming an important and valued contributor to the advancement of technical computing and Model-Based Design with MATLAB and Simulink. Even more, you gain official recognition for your problem-solving skills from technology leaders at MathWorks.\nHow to participate\nMake the results of your work open and accessible to receive a certificate and endorsements from MathWorks research leads. Let us know your intent to complete one of these projects and learn about these rewards here.\nHow to contact us\nIf you are faculty and interested in further information, to provide feedback, or to nominate a new project, contact us here.\nIf you are in industry and interested in nominating a new project contact us here.\nProjects by technology trends\n5G\nArtificial Intelligence\nAutonomous Vehicles\nBig Data\nComputer Vision\nDrones\nIndustry 4.0\nNeuroscience\nRobotics\nSustainability and Renewable Energy\nAll projects\nUpdated: September 20, 2021\nSatellite Collision Avoidance\nModel satellites in Low Earth Orbit (LEO) to identify conjunctions and prevent collisions with space debris, while maintaining orbital requirements.\nImpact: Contribute to the success of satellite mega-constellations and improve the safety of the Low Earth Orbit (LEO) environment.\nExpertise gained: Autonomous Vehicles, Control, Satellite, Modeling and Simulation\nSnake-like Robot Modeling and Navigation\nModel and control an autonomous snake-like robot to navigate an unknown environment.\nImpact: Advance robotics design for hazardous environments inspection and operation in constricted spaces.\nExpertise gained: Robotics, Manipulators, Modeling and Simulation\nTraffic Light Negotiation and Perception-Based Detection\nDetect traffic lights and perform traffic light negotiation at an intersection in Unreal environment.\nImpact: Contribute to the advancement of autonomous vehicles traffic coordination in intersections through simulation.\nExpertise gained: Autonomous Vehicles, Computer Vision, Automotive, Control, Deep Learning, Image Processing, Modeling and Simulation, Sensor Fusion and Tracking\nTraffic Data Analysis for Modeling and Prediction of Traffic Scenarios\nAnalyze real-world traffic data to understand, model, and predict human driving trajectories.\nImpact: Contribute to autonomous driving technologies and intelligent transportation research.\nExpertise gained: Big Data, Autonomous Vehicles, Support Vector Machines, Machine Learning, Deep Learning, Automotive\nClassify Object Behavior to Enhance the Safety of Autonomous Vehicles\nAutomatically classify behavior of tracked objects to enhance the safety of autonomous systems.\nImpact: Make autonomous vehicles safer by classifying behaviors of objects around them.\nExpertise gained: Artificial Intelligence, Autonomous Vehicles, Robotics, Drones, Deep Learning, Explainable AI, Machine Learning, Mobile Robots, Neural Networks, Reinforcement Learning, Sensor Fusion and Tracking, UAV, UGV, Automotive\nTesting Realtime Robustness of ROS in Autonomous Driving\nDevelop a realtime collision avoidance system using ROS2 that will execute a safe vehicle response.\nImpact: Contribute to improving access and safety of transportation through robust automated driving systems.\nExpertise gained: Autonomous Vehicles, Robotics, Automotive, Image Processing, Modeling and Simulation, Sensor Fusion and Tracking, Low-Cost Hardware\nSmart Watering System with Internet of Things\nDevelop a smart plant water system using Internet of Things (IoT) and low-cost hardware.\nImpact: Minimize the negative effects of the overuse of water in farming and preserve water resources.\nExpertise gained: Sustainability and Renewable Energy, Artificial Intelligence, IoT, Low-Cost Hardware, Deep Learning, Cloud Computing\nMachine Learning for Motor Control\nEnhance the performance and product quality required to develop a motor control application.\nImpact: Contribute to the global transition to smart manufacturing and electrification.\nExpertise gained: Artificial Intelligence, Control, Machine Learning, Reinforcement Learning, Automotive\nFlight Controller Design and Hardware Deployment\nBuild a mini drone and use the PX4 Hardware Support package to design the flight controller using Simulink.\nImpact: Expedite UAV design and assembly with model-based design.\nExpertise gained: Drones, Autonomous Vehicles, Control, Low-cost Hardware, UAV\nPortable Charging System for Electric Vehicles\nDesign a portable charger for Electric Vehicles.\nImpact: Help make Electric Vehicles more reliable for general use.\nExpertise gained: Sustainability and Renewable Energy, Control, Electrification, Modeling and Simulation\nDigital Twin and Predictive Maintenance of Pneumatic Systems\nPredict faults in pneumatic systems using simulation and AI/machine learning.\nImpact: Improve efficiency and reliability of industrial processes.\nExpertise gained: Artificial Intelligence, Industry 4.0, Cyber-Physical Systems, Digital Twins, Embedded AI, Health Monitoring, IoT, Machine Learning, Modeling and Simulation\nFace Recognition and Human Tracking Robot\nDesign and implement a real time autonomous human tracking robot using low-cost hardware.\nImpact: Leverage mobile technology and deep learning to advance face recognition algorithms for impacting human safety and security.\nExpertise gained: Artificial Intelligence, Computer Vision, Robotics, Deep Learning, Embedded AI, Human-Robot Interaction, Mobile Robots, Modeling and Simulation, Machine Learning, Low-cost Hardware, Image Processing, Control\nRobust Visual SLAM Using MATLAB Mobile Sensor Streaming\nPerform robust visual SLAM using MATLAB Mobile sensor streaming.\nImpact: Enable visual SLAM from streaming sensors and extend the state-of-art in real-time visual SLAM algorithms.\nExpertise gained: Autonomous Vehicles, Computer Vision, Drones, Robotics, Automotive, AUV, Mobile Robots, Manipulators, Humanoid, UAV, UGV\nWarehouse Robotics Simulation\nSimulate multirobot interactions for efficient algorithm design and warehouse operations.\nImpact: Advance the automation of warehouse applications and reduce associated time and energy consumption.\nExpertise gained: Autonomous Vehicles, Robotics, Human-Robot Interaction, Humanoid, Mobile Robots\nSynthetic Aperture Radar (SAR) Simulator\nDevelop a lightweight Synthetic Aperture Radar (SAR) raw data simulator.\nImpact: Accelerate design of SAR imaging systems and reduce time and cost for their development for aerial and terrestrial applications\nExpertise gained: Autonomous Vehicles, Automotive, AUV, Image Processing, Signal Processing, Radar Processing\nChange Detection in Hyperspectral Imagery\nDevelop an efficient method for detecting small changes on Earth surface using hyperspectral images.\nImpact: Revolutionize the management of natural resources, monitoring, and preventing of disasters, going beyond what is visible to the naked eye.\nExpertise gained: Computer Vision, Image Processing, Deep Learning\nAutonomous Navigation for Vehicles in Rough Terrain\nDesign and implement a motion planning algorithm for off-road vehicles on rough terrain.\nImpact: Expand the frontiers of off-road exploration and navigation using mobile robots for precision agriculture, firefighting, search and rescue, and planetary exploration.\nExpertise gained: Autonomous Vehicles, Computer Vision, Robotics, Image Processing, Mobile Robots, SLAM, UGV, Optimization\nPath Planning for Autonomous Race Cars\nDevelop an algorithm to compute an optimal path for racing tracks.\nImpact: Push racing car competitions into fully autonomous mode\nExpertise gained: Autonomous Vehicles, Automotive, Optimization, Modeling and Simulation\nCurrent submissions\nDisturbance Rejection Control for PMSM Motors\nImplement Active Disturbance Rejection Control (ADRC) algorithm for closed-loop speed control system for a Permanent Magnet Synchronous Motors (PMSM).\nImpact: Improve the customer experience with advanced control strategies to handle the sudden changes in the load with better dynamic control performance.\nExpertise gained: Artificial Intelligence, Electrification, Control, Modeling and Simulation, Reinforcement Learning\nOptimizing Antenna Performance in an Indoor Propagation Environment\nDesign an antenna to optimize transmission and reception in indoor environment.\nImpact: Maximize indoor radio signal coverage and reduce energy consumption of signal booster devices.\nExpertise gained: 5G, Optimization, Smart Antennas, Wireless Communication\nOptimization of Large Antenna Arrays for Astronomical Applications\nDesign a large antenna array and optimize its multiple design variables to achieve desired transmission/reception characteristics.\nImpact: Advance long distance communication capabilities for astronomical applications\nExpertise gained: 5G, Smart Antennas, Wireless Communication, Optimization\nGreen Hydrogen Production\nDevelop a model of a reversible fuel-cell integrated into a renewable-energy microgrid structure.\nImpact: Contribute to the global transition to zero-emission energy sources through the production of hydrogen from clean sources.\nExpertise gained: Sustainability and Renewable Energy, Electrification, Digital Twins, Modeling and Simulation\nAutomatically Segment and Label Objects in Video\nImplement algorithms to automatically label data for deep learning model training.\nImpact: Accelerate the development of robust AI algorithms for self-driving vehicles.\nExpertise gained: Artificial Intelligence, Computer Vision, Deep Learning, Machine Learning\nBehavioral Modelling of Phase-Locked Loop using Deep Learning Techniques\nLeverage a deep learning approach to extract behavioral models of mixed-signal systems from measurement data and circuit simulation.\nImpact: Accelerate mixed-signal design and analysis thereby reducing Time-To-Market for semiconductor companies.\nExpertise gained: Artificial Intelligence, Deep Learning, Machine Learning, Modeling and Simulation, Neural Networks, RF and Mixed Signal, Optimization, Signal Processing\nElectrification of Household Heating\nBuild and evaluate an electrical household heating system to help minimize human environmental impact and halt climate change.\nImpact: Contribute to the global transition to zero-emission energy sources by electrification of household heating.\nExpertise gained: Sustainability and Renewable Energy, Digital Twins, Electrification, Modeling and Simulation\nElectrification of Aircraft\nEvaluate electric aircraft energy requirements, power distribution options, and other electrical technologies.\nImpact: Contribute to the global transition to zero-emission energy sources by electrification of flight.\nExpertise gained: Sustainability and Renewable Energy, Digital Twins, Electrification, Modeling and Simulation, Zero-fuel Aircraft\nSignal Integrity Channel Feature Extraction for Deep Learning\nDevelop a deep learning approach for signal integrity applications.\nImpact: Accelerate signal integrity design and analysis to enable society with more robust and connected internet communications.\nExpertise gained: Artificial Intelligence, Deep Learning, Machine Learning, Modeling and Simulation, Neural Networks, RF and Mixed Signal\nBe the first to sign up for this project\nand receive a MathWorks T-shirt!\nWind Turbine Predictive Maintenance Using Machine Learning\nImprove the reliability of wind turbines by using machine learning to inform a predictive maintenance model.\nImpact: Contribute to providing the world with reliable green energy.\nExpertise gained: Industry 4.0, Sustainability and Renewable Energy, Machine Learning, Electrification, Modeling and Simulation, Predictive Maintenance, Wind Turbines\nOptimal Data Center Cooling\nImprove performance, stability, and cost effectiveness of data centers by designing a cooling algorithm that keeps the system running as efficiently as possible.\nImpact: Contribute to the performance, reliability, and efficiency of data centers worldwide.\nExpertise gained: Big Data, Sustainability and Renewable Energy, Cloud Computing, Control, Deep Learning, Modeling and Simulation, Parallel Computing, Predictive Maintenance\nBe the first to sign up for this project\nand receive a MathWorks T-shirt!\nControl, Modeling, Design, and Simulation of Modern HVAC Systems\nModel a modern HVAC system and design a controller to improve heating, cooling, ventilation, air quality, pressure, humidity, and energy efficiency.\nImpact: Contribute to the design and control of modern homes and buildings to preserve energy and healthy living environments.\nExpertise gained: Sustainability and Renewable Energy, Modeling and Simulation, Electrification, Control\nPredictive Electric Vehicle Cooling\nImprove range, performance, and battery life by designing a cooling algorithm that keep EV battery packs cool when they need it most.\nImpact: Contribute to the electrification of transport worldwide. Increase the range, performance, and battery life of EVs.\nExpertise gained: Autonomous Vehicles, Sustainability and Renewable Energy, Automotive, Control, Electrification, Modeling and Simulation, Optimization\nSpeech Background Noise Suppression with Deep Learning\nDevelop a deep learning neural network for audio background noise suppression.\nImpact: Advance hearing aid technology through research in speech enhancement and noise suppression and improve the quality of life of persons with a hearing impairment.\nExpertise gained: Artificial Intelligence, Deep Learning, Neural Networks, Signal Processing\nImprove the Accuracy of Satellite Navigation Systems\nImprove the accuracy of satellite navigation systems by using non-binary LDPC codes.\nImpact: Accelerate the development of modern satellite navigation receivers.\nExpertise gained: 5G, GNSS, Wireless Communication\nMonitoring and Control of Bioreactor for Pharmaceutical Production\nMonitor and control an industrial scale bioreactor process for pharmaceutical production.\nImpact: Improve quality and consistency of pharmaceutical products and contribute to transitioning the pharmaceutical sector to Industry 4.0.\nExpertise gained: Big Data, Industry 4.0, Control, IoT, Modeling and Simulation, Optimization, Machine Learning\nDeep Learning for UAV Infrastructure Inspection\nAutomate the process of infrastructure inspection using unmanned aerial vehicles and deep learning.\nImpact: Enhance safety and speed of infrastructure inspection across a wide range of industries.\nExpertise gained: Computer Vision, Drones, Artificial Intelligence, Robotics, UAV, SLAM, Deep Learning\n3D Virtual Test Track for Autonomous Driving\nDesign a 3D virtual environment to test the diverse conditions needed to develop an autonomous vehicle.\nImpact: Contribute to autonomous vehicle development by creating virtual test scenes that can be used with many simulators across multiple vehicle development programs.\nExpertise gained: Autonomous Vehicles, Automotive, Modeling and Simulation\nSimulation-Based Design of Humanoid Robots\nDevelop and use models of humanoid robots to increase understanding of how best to control them and direct them to do useful tasks.\nImpact: Accelerate the deployment of humanoid robots to real-world tasks including in healthcare, construction, and manufacturing.\nExpertise gained: Artificial Intelligence, Robotics, Control, Cyber-Physical Systems, Deep Learning, Humanoid, Human-Robot Interaction, Machine Learning, Mobile Robots, Modeling and Simulation, Optimization, Reinforcement Learning\nBuild a Wireless Communications Link with Software-Defined Radio\nGain practical experience in wireless communication by designing inexpensive software-designed radios.\nImpact: Develop your own expertise in wireless technology and drive this megatrend forward, in industry and society.\nExpertise gained: 5G, Low-Cost Hardware, Modeling and Simulation, Signal Processing, Software-Defined Radio, Wireless Communication\nIntelligent Fan Air Cooling System\nDesign an intelligent fan cooling system to moderate temperatures in a building to eliminate or reduce the need for air conditioning systems.\nImpact: Contribute to energy and carbon footprint reduction.\nExpertise gained: Sustainability and Renewable Energy, Control, Modeling and Simulation, Optimization\nSignal Coverage Maps Using Measurements and Machine Learning\nReduce the cost of 5G and IoT network deployment by generating coverage maps from limited measurements.\nImpact: Contribute to the evolution and deployment of new wireless communications systems.\nExpertise gained: Artificial Intelligence, 5G, Machine Learning, Wireless Communication\nApplying Machine Learning for the Development of Physical Sensor Models in Game Engine Environment\nRealistic synthetic sensor data will soon eliminate the need of collecting tons of real data for machine learning based perception algorithms. Accelerate this transition by creating a real-time camera distortion model.\nImpact: Reduce development efforts of autonomous vehicles and robots.\nExpertise gained: Artificial Intelligence, Autonomous Vehicles, Computer Vision, Deep Learning, Machine Learning, Modeling and Simulation, Neural Networks\nSelection of Mechanical Actuators Using Simulation-Based Analysis\nHelp accelerate the design and development of autonomous systems by providing a framework for mechanical actuators analysis and selection.\nImpact: Help evaluate and select actuation systems across multiple industries (robotic, automotive, manufacturing, aerospace) and help designers come up with novel actuation solutions.\nExpertise gained: Drones, Robotics, Control, Cyber-physical Systems, Electrification, Humanoid, Manipulators, Modeling and Simulation\nBe the first to sign up for this project\nand receive a MathWorks T-shirt!\nBattery Pack Design Automation\nReduce the effort required to properly develop a battery pack optimized for an automotive drive cycle.\nImpact: Contribute to the global transition to zero-emission energy source.\nExpertise gained: Sustainability and Renewable Energy, Control, Electrification, Optimization, Parallel Computing\nRotor-Flying Manipulator Simulation\nRotor-flying manipulation will change the future of aerial transportation and manipulation in construction and hazardous environments. Take robotics manipulation to the next level with an autonomous UAV.\nImpact: Transform the field of robot manipulation.\nExpertise gained: Drones, Robotics, Manipulators, Modeling and Simulation, UAV\nMIMO Engine Airpath Control\nInternal combustion engines will continue to be used in the automotive marketplace well into the future. Build a MIMO airflow control to improve engine performances, fuel economy, and emissions, and start your career in the automotive industry!\nImpact: Improve environmental friendliness of engine control by tier 1 automotive supplier.\nExpertise gained: Autonomous Vehicles, Automotive, Control, Modeling and Simulation\nCurrent submissions\nVoice Controlled Robot\nSmart devices and robots have become part of our everyday life and human-robot interaction plays a crucial role in this rapidly expanding market. Talking to a machine is going to complete change the way we work with robots.\nImpact: Open up the opportunities to create robots that can be an intuitive part of our world.\nExpertise gained: Artificial Intelligence, Computer Vision, Robotics, Signal Processing, Natural Language Processing, Mobile Robots, Human-Robot Interaction, Low-Cost Hardware\nQuadruped Robot with a Manipulator\nLegged robots with manipulators will be the ideal platforms to traverse rough terrains and interact with the environment. Are you ready to tackle the challenge of operating robots outdoor?\nImpact: Contribute to state-of-the-art technologies for exploration and search and rescue transformation.\nExpertise gained: Robotics, Control, Image Processing, Manipulators, Mobile Robots, Modeling and Simulation\nUnderwater Drone Hide and Seek\nAfter robots conquered ground, sky and space, they are going deep sea next. Explore the frontier of autonomous underwater vehicles by doing a project on robot collaboration and competition underwater.\nImpact: Advance underwater exploration and AUVs collaboration for the future of ocean engineering.\nExpertise gained: Artificial Intelligence, Robotics, AUV, Embedded AI, Machine Learning, Reinforcement Learning, Sensor Fusion and Tracking, SLAM\nAutonomous Vehicle Localization Using Onboard Sensors and HD Geolocated Maps\nRevolutionize the current transportation system by improving autonomous vehicles localization for level 5 automation.\nImpact: Contribute to the change of automobile industry, and transportation system.\nExpertise gained: Computer Vision, Robotics, Autonomous Vehicles, SLAM, State Estimation, Sensor Fusion and Tracking", "link": "https://github.com/mathworks/MathWorks-Excellence-in-Innovation", "origin": "Github", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "mathworks excellence in innovation projects\ncontribute to the progress of engineering and science by solving key industry challenges!\nare you looking for a design or research project idea with real industry relevance? this is a list of inspiring projects based on industry trends for your capstone, senior design project, or final year assignment. these projects help you learn about technology trends while becoming an important and valued contributor to the advancement of technical computing and model-based design with matlab and simulink. even more, you gain official recognition for your problem-solving skills from technology leaders at mathworks.\nhow to participate\nmake the results of your work open and accessible to receive a certificate and endorsements from mathworks research leads. let us know your intent to complete one of these projects and learn about these rewards here.\nhow to contact us\nif you are faculty and interested in further information, to provide feedback, or to nominate a new project, contact us here.\nif you are in industry and interested in nominating a new project contact us here.\nprojects by technology trends\n5g\nartificial intelligence\nautonomous vehicles\nbig data\ncomputer vision\ndrones\nindustry 4.0\nneuroscience\nrobotics\nsustainability and renewable energy\nall projects\nupdated: september 20, 2021\nsatellite collision avoidance\nmodel satellites in low earth orbit (leo) to identify conjunctions and prevent collisions with space debris, while maintaining orbital requirements.\nimpact: contribute to the success of satellite mega-constellations and improve the safety of the low earth orbit (leo) environment.\nexpertise gained: autonomous vehicles, control, satellite, modeling and simulation\nsnake-like robot modeling and navigation\nmodel and control an autonomous snake-like robot to navigate an unknown environment.\nimpact: advance robotics design for hazardous environments inspection and operation in constricted spaces.\nexpertise gained: robotics, manipulators, modeling and simulation\ntraffic light negotiation and perception-based detection\ndetect traffic lights and perform traffic light negotiation at an intersection in unreal environment.\nimpact: contribute to the advancement of autonomous vehicles traffic coordination in intersections through simulation.\nexpertise gained: autonomous vehicles, computer vision, automotive, control, deep learning, image processing, modeling and simulation, sensor fusion and tracking\ntraffic data analysis for modeling and prediction of traffic scenarios\nanalyze real-world traffic data to understand, model, and predict human driving trajectories.\nimpact: contribute to autonomous driving technologies and intelligent transportation research.\nexpertise gained: big data, autonomous vehicles, support vector machines, machine learning, deep learning, automotive\nclassify object behavior to enhance the safety of autonomous vehicles\nautomatically classify behavior of tracked objects to enhance the safety of autonomous systems.\nimpact: make autonomous vehicles safer by classifying behaviors of objects around them.\nexpertise gained: artificial intelligence, autonomous vehicles, robotics, drones, deep learning, explainable ai, machine learning, mobile robots, neural networks, reinforcement learning, sensor fusion and tracking, uav, ugv, automotive\ntesting realtime robustness of ros in autonomous driving\ndevelop a realtime collision avoidance system using ros2 that will execute a safe vehicle response.\nimpact: contribute to improving access and safety of transportation through robust automated driving systems.\nexpertise gained: autonomous vehicles, robotics, automotive, image processing, modeling and simulation, sensor fusion and tracking, low-cost hardware\nsmart watering system with internet of things\ndevelop a smart plant water system using internet of things (iot) and low-cost hardware.\nimpact: minimize the negative effects of the overuse of water in -----> farming !!!  and preserve water resources.\nexpertise gained: sustainability and renewable energy, artificial intelligence, iot, low-cost hardware, deep learning, cloud computing\nmachine learning for motor control\nenhance the performance and product quality required to develop a motor control application.\nimpact: contribute to the global transition to smart manufacturing and electrification.\nexpertise gained: artificial intelligence, control, machine learning, reinforcement learning, automotive\nflight controller design and hardware deployment\nbuild a mini drone and use the px4 hardware support package to design the flight controller using simulink.\nimpact: expedite uav design and assembly with model-based design.\nexpertise gained: drones, autonomous vehicles, control, low-cost hardware, uav\nportable charging system for electric vehicles\ndesign a portable charger for electric vehicles.\nimpact: help make electric vehicles more reliable for general use.\nexpertise gained: sustainability and renewable energy, control, electrification, modeling and simulation\ndigital twin and predictive maintenance of pneumatic systems\npredict faults in pneumatic systems using simulation and ai/machine learning.\nimpact: improve efficiency and reliability of industrial processes.\nexpertise gained: artificial intelligence, industry 4.0, cyber-physical systems, digital twins, embedded ai, health monitoring, iot, machine learning, modeling and simulation\nface recognition and human tracking robot\ndesign and implement a real time autonomous human tracking robot using low-cost hardware.\nimpact: leverage mobile technology and deep learning to advance face recognition algorithms for impacting human safety and security.\nexpertise gained: artificial intelligence, computer vision, robotics, deep learning, embedded ai, human-robot interaction, mobile robots, modeling and simulation, machine learning, low-cost hardware, image processing, control\nrobust visual slam using matlab mobile sensor streaming\nperform robust visual slam using matlab mobile sensor streaming.\nimpact: enable visual slam from streaming sensors and extend the state-of-art in real-time visual slam algorithms.\nexpertise gained: autonomous vehicles, computer vision, drones, robotics, automotive, auv, mobile robots, manipulators, humanoid, uav, ugv\nwarehouse robotics simulation\nsimulate multirobot interactions for efficient algorithm design and warehouse operations.\nimpact: advance the automation of warehouse applications and reduce associated time and energy consumption.\nexpertise gained: autonomous vehicles, robotics, human-robot interaction, humanoid, mobile robots\nsynthetic aperture radar (sar) simulator\ndevelop a lightweight synthetic aperture radar (sar) raw data simulator.\nimpact: accelerate design of sar imaging systems and reduce time and cost for their development for aerial and terrestrial applications\nexpertise gained: autonomous vehicles, automotive, auv, image processing, signal processing, radar processing\nchange detection in hyperspectral imagery\ndevelop an efficient method for detecting small changes on earth surface using hyperspectral images.\nimpact: revolutionize the management of natural resources, monitoring, and preventing of disasters, going beyond what is visible to the naked eye.\nexpertise gained: computer vision, image processing, deep learning\nautonomous navigation for vehicles in rough terrain\ndesign and implement a motion planning algorithm for off-road vehicles on rough terrain.\nimpact: expand the frontiers of off-road exploration and navigation using mobile robots for precision agriculture, firefighting, search and rescue, and planetary exploration.\nexpertise gained: autonomous vehicles, computer vision, robotics, image processing, mobile robots, slam, ugv, optimization\npath planning for autonomous race cars\ndevelop an algorithm to compute an optimal path for racing tracks.\nimpact: push racing car competitions into fully autonomous mode\nexpertise gained: autonomous vehicles, automotive, optimization, modeling and simulation\ncurrent submissions\ndisturbance rejection control for pmsm motors\nimplement active disturbance rejection control (adrc) algorithm for closed-loop speed control system for a permanent magnet synchronous motors (pmsm).\nimpact: improve the customer experience with advanced control strategies to handle the sudden changes in the load with better dynamic control performance.\nexpertise gained: artificial intelligence, electrification, control, modeling and simulation, reinforcement learning\noptimizing antenna performance in an indoor propagation environment\ndesign an antenna to optimize transmission and reception in indoor environment.\nimpact: maximize indoor radio signal coverage and reduce energy consumption of signal booster devices.\nexpertise gained: 5g, optimization, smart antennas, wireless communication\noptimization of large antenna arrays for astronomical applications\ndesign a large antenna array and optimize its multiple design variables to achieve desired transmission/reception characteristics.\nimpact: advance long distance communication capabilities for astronomical applications\nexpertise gained: 5g, smart antennas, wireless communication, optimization\ngreen hydrogen production\ndevelop a model of a reversible fuel-cell integrated into a renewable-energy microgrid structure.\nimpact: contribute to the global transition to zero-emission energy sources through the production of hydrogen from clean sources.\nexpertise gained: sustainability and renewable energy, electrification, digital twins, modeling and simulation\nautomatically segment and label objects in video\nimplement algorithms to automatically label data for deep learning model training.\nimpact: accelerate the development of robust ai algorithms for self-driving vehicles.\nexpertise gained: artificial intelligence, computer vision, deep learning, machine learning\nbehavioral modelling of phase-locked loop using deep learning techniques\nleverage a deep learning approach to extract behavioral models of mixed-signal systems from measurement data and circuit simulation.\nimpact: accelerate mixed-signal design and analysis thereby reducing time-to-market for semiconductor companies.\nexpertise gained: artificial intelligence, deep learning, machine learning, modeling and simulation, neural networks, rf and mixed signal, optimization, signal processing\nelectrification of household heating\nbuild and evaluate an electrical household heating system to help minimize human environmental impact and halt climate change.\nimpact: contribute to the global transition to zero-emission energy sources by electrification of household heating.\nexpertise gained: sustainability and renewable energy, digital twins, electrification, modeling and simulation\nelectrification of aircraft\nevaluate electric aircraft energy requirements, power distribution options, and other electrical technologies.\nimpact: contribute to the global transition to zero-emission energy sources by electrification of flight.\nexpertise gained: sustainability and renewable energy, digital twins, electrification, modeling and simulation, zero-fuel aircraft\nsignal integrity channel feature extraction for deep learning\ndevelop a deep learning approach for signal integrity applications.\nimpact: accelerate signal integrity design and analysis to enable society with more robust and connected internet communications.\nexpertise gained: artificial intelligence, deep learning, machine learning, modeling and simulation, neural networks, rf and mixed signal\nbe the first to sign up for this project\nand receive a mathworks t-shirt!\nwind turbine predictive maintenance using machine learning\nimprove the reliability of wind turbines by using machine learning to inform a predictive maintenance model.\nimpact: contribute to providing the world with reliable green energy.\nexpertise gained: industry 4.0, sustainability and renewable energy, machine learning, electrification, modeling and simulation, predictive maintenance, wind turbines\noptimal data center cooling\nimprove performance, stability, and cost effectiveness of data centers by designing a cooling algorithm that keeps the system running as efficiently as possible.\nimpact: contribute to the performance, reliability, and efficiency of data centers worldwide.\nexpertise gained: big data, sustainability and renewable energy, cloud computing, control, deep learning, modeling and simulation, parallel computing, predictive maintenance\nbe the first to sign up for this project\nand receive a mathworks t-shirt!\ncontrol, modeling, design, and simulation of modern hvac systems\nmodel a modern hvac system and design a controller to improve heating, cooling, ventilation, air quality, pressure, humidity, and energy efficiency.\nimpact: contribute to the design and control of modern homes and buildings to preserve energy and healthy living environments.\nexpertise gained: sustainability and renewable energy, modeling and simulation, electrification, control\npredictive electric vehicle cooling\nimprove range, performance, and battery life by designing a cooling algorithm that keep ev battery packs cool when they need it most.\nimpact: contribute to the electrification of transport worldwide. increase the range, performance, and battery life of evs.\nexpertise gained: autonomous vehicles, sustainability and renewable energy, automotive, control, electrification, modeling and simulation, optimization\nspeech background noise suppression with deep learning\ndevelop a deep learning neural network for audio background noise suppression.\nimpact: advance hearing aid technology through research in speech enhancement and noise suppression and improve the quality of life of persons with a hearing impairment.\nexpertise gained: artificial intelligence, deep learning, neural networks, signal processing\nimprove the accuracy of satellite navigation systems\nimprove the accuracy of satellite navigation systems by using non-binary ldpc codes.\nimpact: accelerate the development of modern satellite navigation receivers.\nexpertise gained: 5g, gnss, wireless communication\nmonitoring and control of bioreactor for pharmaceutical production\nmonitor and control an industrial scale bioreactor process for pharmaceutical production.\nimpact: improve quality and consistency of pharmaceutical products and contribute to transitioning the pharmaceutical sector to industry 4.0.\nexpertise gained: big data, industry 4.0, control, iot, modeling and simulation, optimization, machine learning\ndeep learning for uav infrastructure inspection\nautomate the process of infrastructure inspection using unmanned aerial vehicles and deep learning.\nimpact: enhance safety and speed of infrastructure inspection across a wide range of industries.\nexpertise gained: computer vision, drones, artificial intelligence, robotics, uav, slam, deep learning\n3d virtual test track for autonomous driving\ndesign a 3d virtual environment to test the diverse conditions needed to develop an autonomous vehicle.\nimpact: contribute to autonomous vehicle development by creating virtual test scenes that can be used with many simulators across multiple vehicle development programs.\nexpertise gained: autonomous vehicles, automotive, modeling and simulation\nsimulation-based design of humanoid robots\ndevelop and use models of humanoid robots to increase understanding of how best to control them and direct them to do useful tasks.\nimpact: accelerate the deployment of humanoid robots to real-world tasks including in healthcare, construction, and manufacturing.\nexpertise gained: artificial intelligence, robotics, control, cyber-physical systems, deep learning, humanoid, human-robot interaction, machine learning, mobile robots, modeling and simulation, optimization, reinforcement learning\nbuild a wireless communications link with software-defined radio\ngain practical experience in wireless communication by designing inexpensive software-designed radios.\nimpact: develop your own expertise in wireless technology and drive this megatrend forward, in industry and society.\nexpertise gained: 5g, low-cost hardware, modeling and simulation, signal processing, software-defined radio, wireless communication\nintelligent fan air cooling system\ndesign an intelligent fan cooling system to moderate temperatures in a building to eliminate or reduce the need for air conditioning systems.\nimpact: contribute to energy and carbon footprint reduction.\nexpertise gained: sustainability and renewable energy, control, modeling and simulation, optimization\nsignal coverage maps using measurements and machine learning\nreduce the cost of 5g and iot network deployment by generating coverage maps from limited measurements.\nimpact: contribute to the evolution and deployment of new wireless communications systems.\nexpertise gained: artificial intelligence, 5g, machine learning, wireless communication\napplying machine learning for the development of physical sensor models in game engine environment\nrealistic synthetic sensor data will soon eliminate the need of collecting tons of real data for machine learning based perception algorithms. accelerate this transition by creating a real-time camera distortion model.\nimpact: reduce development efforts of autonomous vehicles and robots.\nexpertise gained: artificial intelligence, autonomous vehicles, computer vision, deep learning, machine learning, modeling and simulation, neural networks\nselection of mechanical actuators using simulation-based analysis\nhelp accelerate the design and development of autonomous systems by providing a framework for mechanical actuators analysis and selection.\nimpact: help evaluate and select actuation systems across multiple industries (robotic, automotive, manufacturing, aerospace) and help designers come up with novel actuation solutions.\nexpertise gained: drones, robotics, control, cyber-physical systems, electrification, humanoid, manipulators, modeling and simulation\nbe the first to sign up for this project\nand receive a mathworks t-shirt!\nbattery pack design automation\nreduce the effort required to properly develop a battery pack optimized for an automotive drive cycle.\nimpact: contribute to the global transition to zero-emission energy source.\nexpertise gained: sustainability and renewable energy, control, electrification, optimization, parallel computing\nrotor-flying manipulator simulation\nrotor-flying manipulation will change the future of aerial transportation and manipulation in construction and hazardous environments. take robotics manipulation to the next level with an autonomous uav.\nimpact: transform the field of robot manipulation.\nexpertise gained: drones, robotics, manipulators, modeling and simulation, uav\nmimo engine airpath control\ninternal combustion engines will continue to be used in the automotive marketplace well into the future. build a mimo airflow control to improve engine performances, fuel economy, and emissions, and start your career in the automotive industry!\nimpact: improve environmental friendliness of engine control by tier 1 automotive supplier.\nexpertise gained: autonomous vehicles, automotive, control, modeling and simulation\ncurrent submissions\nvoice controlled robot\nsmart devices and robots have become part of our everyday life and human-robot interaction plays a crucial role in this rapidly expanding market. talking to a machine is going to complete change the way we work with robots.\nimpact: open up the opportunities to create robots that can be an intuitive part of our world.\nexpertise gained: artificial intelligence, computer vision, robotics, signal processing, natural language processing, mobile robots, human-robot interaction, low-cost hardware\nquadruped robot with a manipulator\nlegged robots with manipulators will be the ideal platforms to traverse rough terrains and interact with the environment. are you ready to tackle the challenge of operating robots outdoor?\nimpact: contribute to state-of-the-art technologies for exploration and search and rescue transformation.\nexpertise gained: robotics, control, image processing, manipulators, mobile robots, modeling and simulation\nunderwater drone hide and seek\nafter robots conquered ground, sky and space, they are going deep sea next. explore the frontier of autonomous underwater vehicles by doing a project on robot collaboration and competition underwater.\nimpact: advance underwater exploration and auvs collaboration for the future of ocean engineering.\nexpertise gained: artificial intelligence, robotics, auv, embedded ai, machine learning, reinforcement learning, sensor fusion and tracking, slam\nautonomous vehicle localization using onboard sensors and hd geolocated maps\nrevolutionize the current transportation system by improving autonomous vehicles localization for level 5 automation.\nimpact: contribute to the change of automobile industry, and transportation system.\nexpertise gained: computer vision, robotics, autonomous vehicles, slam, state estimation, sensor fusion and tracking", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000155, "year": null}, {"Unnamed: 0": 1794, "autor": 774, "date": null, "content": "Autonomous-Farm-Robot(AGRIBOT)\nAbout the Project\nThe primary objective of this project is to design an autonomous agricultural robot specifically used for the removal of weed on the real-time basis without any human involvement. This will help to offer better and nutrients rich yield involving less man-power than the conventional agriculture. This project can also be extended to design robot various other applications involved in farming like ploughing, harvesting, etc. in turn making agriculture more autonomous and providing better yields which in turn will impact on the country’s GDP and lesser farmer suicide rates.It is a UG project under guidance of TEQIP-3 and ECE Department at SVNIT.\nFolder Organization\nMainly project is divided into two part, i.e. Autonomous Navigation & Crop Weed Classification. The main Autonomous-Farm-Robot contains all of the documentation and scripts required for the project, broken down into the four sections: Classification Model, Dataset Analysis, Documentation, and agribot_ws. We have created Wiki for better understanding for our project.\nCrop_Weed_Classification: Contains scripts for classification task.\nagribot_ws: Catkin workspace for navigation and modelling.\nDocuments: Documentation of the project. Includes Project Report & Presentation, Proposal, Research Papers etc.\nDatasets(Git): For Analysis of Datasets. Bonn Dataset contains samples with missing images. So, there is a need to remove such samples. We have listed these samples which contains missing images in it.\nWiki\nFor more details about project and implementation of modules, visit below links:\nAutonomous Navigation\nConfigure Jetson Nano for Remote access\nCrop Weed Classification\nElectronics Components and Sensor Modelling\nFeatures\n1. Autonomous Navigation\nFirst we designed our generalized robotic structure using Solidworks-2016 and generated URDF for same and then spawn our model into GAZEBO. Crops were designed as cylindrical shape and given texture of plants, further we can design using 3D modelling software like Blender. Other models were taken from Gazebo model library. At this stage, We've used GPS & Magnetometer for autonomous traversing in field. For reduction of sensor noise, we implemented Moving Median and Single dimention Kalman Filter. You can find scripts in agribot_ws/src/autonomous_drive. For installation of pkgs and dependencies visit Autonomous Navigation wiki page.\nNote: Here,\nLeft side window: Mapviz, Right side window: Gazebo\nGreen points are end points of row in field, Blue line is traced trajectory of AGRIBOT.\nImage window from Camera is being directly fed into classification model.\nSensor Noise Reduction (Left: Moving Median, Right: Kalman Filter)\n2. Crop Weed Classification\nWe trained and tested 2 models: UNet & Bonnet on Datasets namely: CWFID & Bonn. Bonnet Architecture by PRBonn (Photogrammetry & Robotics Lab at the University of Bonn) can be viewed here. Implementation of both architecture is done in Crop_Weed_ Classification/model.py. Bonnet performed better than its UNet counterpart and was suitable for real-time deployment due to its approx. 100x lesser parameters compared to UNet. Hence, Bonnet was selected as the final classification model.\nNOTE: Here, Red => Weed, Green => Crop and Blue => Soil.\nPrediction on CWFID Dataset:\nPrediction on Bonn Dataset:\nMetrics on Bonn Dataset:\nLabel 0,1,2 are in order of Weed,Crop and Soil(i.e. R,G,B).\nReal-time latency:\nAvg. 2.5 fps on i7 8th Gen + 4GB NVIDIA 940 MX.\nPrediction on images from Surrounding Farm:\nNOTE: For setting up environment,understanding of scripts and model weights, visit Crop-Weed-Classification Wiki page.\nProject Build-Map\nVarious Sensor such as NEO-M8N GPS, MPU-9265 and Raspberry PI Cam-v2 were integrated on Nvidia Jetson Nano. However, due to COVID-19 pandemic, further development on hardware was not possible. Hence, we shifted our approach on simulation-basis. We tested our software and algorithms through modelling and simulation and have tried to make it close to real-case scenarios. For Eg: Modelling Sensors with noise to create a real-case scenario.\nProject Report\nAccess the Project Report at Documents/G-13 UG Project Report.pdf.\nHappy building!!🚀🚀\nFeel free to raise an issue if you face any problems while implementing the modules. If you have any questions or run into problems during understanding of our project, please reach out to us through mail. We would be happy to share as much as possible.\nEmail ID: farmbot.svnit@gmail.com\nProject Team\nProject Guide:\nDr. Anand Darji,\nHead & Associate Professor,\nECED, SVNIT.\nDevelopment Team:\nDhruv Patel(U16EC053, SVNIT)\nMeet Gandhi(U16EC056, SVNIT)\nShankaranarayanan H. (U16EC074,SVNIT)\nSpecial Thanks To: Mr. Mahesh Birajdar(U16ME084),SVNIT and Team DRISHTI for helping us in solidwork designing and manufacturing of AGRIBOT.", "link": "https://github.com/Dhruv2012/Autonomous-Farm-Robot", "origin": "Github", "suborigin": "robotics", "result": true, "Selector": "farming", "selectorShort": "farming", "MarkedSent": "autonomous-farm-robot(agribot)\nabout the project\nthe primary objective of this project is to design an autonomous agricultural robot specifically used for the removal of weed on the real-time basis without any human involvement. this will help to offer better and nutrients rich yield involving less man-power than the conventional agriculture. this project can also be extended to design robot various other applications involved in -----> farming !!!  like ploughing, harvesting, etc. in turn making agriculture more autonomous and providing better yields which in turn will impact on the country’s gdp and lesser farmer suicide rates.it is a ug project under guidance of teqip-3 and ece department at svnit.\nfolder organization\nmainly project is divided into two part, i.e. autonomous navigation & crop weed classification. the main autonomous-farm-robot contains all of the documentation and scripts required for the project, broken down into the four sections: classification model, dataset analysis, documentation, and agribot_ws. we have created wiki for better understanding for our project.\ncrop_weed_classification: contains scripts for classification task.\nagribot_ws: catkin workspace for navigation and modelling.\ndocuments: documentation of the project. includes project report & presentation, proposal, research papers etc.\ndatasets(git): for analysis of datasets. bonn dataset contains samples with missing images. so, there is a need to remove such samples. we have listed these samples which contains missing images in it.\nwiki\nfor more details about project and implementation of modules, visit below links:\nautonomous navigation\nconfigure jetson nano for remote access\ncrop weed classification\nelectronics components and sensor modelling\nfeatures\n1. autonomous navigation\nfirst we designed our generalized robotic structure using solidworks-2016 and generated urdf for same and then spawn our model into gazebo. crops were designed as cylindrical shape and given texture of plants, further we can design using 3d modelling software like blender. other models were taken from gazebo model library. at this stage, we've used gps & magnetometer for autonomous traversing in field. for reduction of sensor noise, we implemented moving median and single dimention kalman filter. you can find scripts in agribot_ws/src/autonomous_drive. for installation of pkgs and dependencies visit autonomous navigation wiki page.\nnote: here,\nleft side window: mapviz, right side window: gazebo\ngreen points are end points of row in field, blue line is traced trajectory of agribot.\nimage window from camera is being directly fed into classification model.\nsensor noise reduction (left: moving median, right: kalman filter)\n2. crop weed classification\nwe trained and tested 2 models: unet & bonnet on datasets namely: cwfid & bonn. bonnet architecture by prbonn (photogrammetry & robotics lab at the university of bonn) can be viewed here. implementation of both architecture is done in crop_weed_ classification/model.py. bonnet performed better than its unet counterpart and was suitable for real-time deployment due to its approx. 100x lesser parameters compared to unet. hence, bonnet was selected as the final classification model.\nnote: here, red => weed, green => crop and blue => soil.\nprediction on cwfid dataset:\nprediction on bonn dataset:\nmetrics on bonn dataset:\nlabel 0,1,2 are in order of weed,crop and soil(i.e. r,g,b).\nreal-time latency:\navg. 2.5 fps on i7 8th gen + 4gb nvidia 940 mx.\nprediction on images from surrounding farm:\nnote: for setting up environment,understanding of scripts and model weights, visit crop-weed-classification wiki page.\nproject build-map\nvarious sensor such as neo-m8n gps, mpu-9265 and raspberry pi cam-v2 were integrated on nvidia jetson nano. however, due to covid-19 pandemic, further development on hardware was not possible. hence, we shifted our approach on simulation-basis. we tested our software and algorithms through modelling and simulation and have tried to make it close to real-case scenarios. for eg: modelling sensors with noise to create a real-case scenario.\nproject report\naccess the project report at documents/g-13 ug project report.pdf.\nhappy building!!🚀🚀\nfeel free to raise an issue if you face any problems while implementing the modules. if you have any questions or run into problems during understanding of our project, please reach out to us through mail. we would be happy to share as much as possible.\nemail id: farmbot.svnit@gmail.com\nproject team\nproject guide:\ndr. anand darji,\nhead & associate professor,\neced, svnit.\ndevelopment team:\ndhruv patel(u16ec053, svnit)\nmeet gandhi(u16ec056, svnit)\nshankaranarayanan h. (u16ec074,svnit)\nspecial thanks to: mr. mahesh birajdar(u16me084),svnit and team drishti for helping us in solidwork designing and manufacturing of agribot.", "sortedWord": "None", "removed": "Nan", "score": null, "comments": null, "media": "Nan", "medialink": "Nan", "identifyer": 7000774, "year": null}], "name": "farmingrobotics"}