{"interestingcomments": [{"Unnamed: 0": 128615, "autor": "sonygoup", "date": 1530291395000, "content": ".19c Development- MPIX Film Studio Review /!/ Got a tip from another Redditor that he got really cheap processing from MPIX at .19c per exposure. With the average 24 exposure roll of film I'm paying $4.56 which is very cheap. So I thought what a good deal, its worth it. Oh forget to mention that you have to pay for your prints to be placed onto a DVD archive (it's the only way to get any of your photos from them). This was the biggest problem I saw at first when using the service so I said hmm there may be a way to pull the full-size image off the website if anything. Wrong, they upload low-quality thumbnails that you can download but image resolution is very poor so the DVD is your only option at 15$ for 100 images. After reading there DVD  archive price chart I was kinda pissed that there charging so much for a DVD like a thing cost 5$ max on a bad day.\n\nFees for images to DVD below:\n\n1-50 images\t$10.00\n\n51-100\t$15.00\n\n101-250\t$20.00\n\n251-500\t$30.00\n\n501-1000\t$40.00\n\nEach additional 1K is $15.00\n\nHowever, the good side of this is that they scan the negative at 3130x2075, 72 dpi which attracted me even more as my current studio images were darker and I was really interested in finding a new studio to test out.\n\nSo on the 7th of June, I shipped out 3, 24 exposure rolls (2 Expired Kodak Max 400 and Fuji 200) via USPS that arrived on 11th on June where it was processed and upload to the MY PHOTOS section of the website. Looking at the thumbnails given my shot looked good so I was pleased. I paid $14.06 for the processing which was a bit more expensive than my studio for everything so I knew I was gonna spend more but I was okay with it at the beginning.  \n\nNext came the DVD archive fees that cost me $22.95, this is where the problem I had with them began. I got 74 images from the 3 rolls (Rollei 35 got me an extra 2) which cost $15 as it was above 50 images. Then I had to pay $7.95 for an envelope with a DVD (what I thought was an envelope but turned out to be a small box)  to be shipped out via UPS Surepost as I sent them to my PO BOX.  From there it was shipped out on the 12th of June via UPS then was handed off to USPS on the 15th of June to where I had no idea where it was or what happened to it. It was marked as delivered on the 25th of June to my skybox. \n\nYes, it was delivered to my Skybox (Courier to bring packages to my country Trinidad and Tobago) I only got the package on the 28th of June. When I opened it, I only got a large roll of film negaitve and nothing else. So I got a little paranoid thinking maybe someone at my skybox took the DVD out so I headed to there website to look up the contents of the package and all that was listed was the film and nothing else. So the next morning 29th I sent over an email to there CSR Patricia, I would have dealt with her when I initially had interest in there service to find out some details. My email was strongly worked and a bit aggressive as I've been waiting over two weeks from film scans, at this time I regretted doing business with MPIX and I still do tbh.\n\nA few minutes later Barry sent me a reply apologizing about the issue and asking for my address to send over another DVD, I replied stating what had happened over the past two weeks and I wasn't up to waiting another week for a DVD to arrive. Another quick 2 replies from stating that 1. he was looking into the issues 2. He uploaded the images We Transfer for download. A few minutes later I email with a link to the images for **DOWNLOAD** on We Transfer.\n\nAfter getting it upload I thought why not just offer this as a option instead of having customers wait for there scans to be shipped out, they're just using the whole DVD archive as a aggressive method to get more money from customers IMO.\n\nAnyway I downloaded it all they were average/good scans (NORITSU KOKI scanner) but I was very satisfied at this point that I finally got my images but in the back of my mind knowing that this would be the last time using there service or even recommending it to anyone.\n\nNow to conclude, Processing and development of your film is very fast. Scans are average/ good quality (only could go on what I got scanned). Shipping was very slow for me, they claimed its because of it being delivered to a PO BOX.\n\nCustomer Service was good mostly, there was one CSR that didn't know much about there operations which leave the impression that all staff isn't trained equally.\n\n**As the elders in my country say 'Cheap thing nah good and good thing nah cheap'.**\n\nSamples of the images I shot can be seen on my IG page :everydayfilm.tt   [IG DiRECT LINK](https://www.instagram.com/everydayfilm.tt/)\n\nOn to the next film studio...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8uup7m/19c_development_mpix_film_studio_review/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": ".19c development- mpix film studio review /!/ got a tip from another redditor that he got really cheap processing from mpix at .19c per exposure. with the average 24 exposure roll of film i'm paying $4.56 which is very cheap. so i thought what a good deal, its worth it. oh forget to mention that you have to pay for your prints to be placed onto a dvd -----> archive !!!  (it's the only way to get any of your photos from them). this was the biggest problem i saw at first when using the service so i said hmm there may be a way to pull the full-size image off the website if anything. wrong, they upload low-quality thumbnails that you can download but image resolution is very poor so the dvd is your only option at 15$ for 100 images. after reading there dvd  archive price chart i was kinda pissed that there charging so much for a dvd like a thing cost 5$ max on a bad day.\n\nfees for images to dvd below:\n\n1-50 images\t$10.00\n\n51-100\t$15.00\n\n101-250\t$20.00\n\n251-500\t$30.00\n\n501-1000\t$40.00\n\neach additional 1k is $15.00\n\nhowever, the good side of this is that they scan the negative at 3130x2075, 72 dpi which attracted me even more as my current studio images were darker and i was really interested in finding a new studio to test out.\n\nso on the 7th of june, i shipped out 3, 24 exposure rolls (2 expired kodak max 400 and fuji 200) via usps that arrived on 11th on june where it was processed and upload to the my photos section of the website. looking at the thumbnails given my shot looked good so i was pleased. i paid $14.06 for the processing which was a bit more expensive than my studio for everything so i knew i was gonna spend more but i was okay with it at the beginning.  \n\nnext came the dvd archive fees that cost me $22.95, this is where the problem i had with them began. i got 74 images from the 3 rolls (rollei 35 got me an extra 2) which cost $15 as it was above 50 images. then i had to pay $7.95 for an envelope with a dvd (what i thought was an envelope but turned out to be a small box)  to be shipped out via ups surepost as i sent them to my po box.  from there it was shipped out on the 12th of june via ups then was handed off to usps on the 15th of june to where i had no idea where it was or what happened to it. it was marked as delivered on the 25th of june to my skybox. \n\nyes, it was delivered to my skybox (courier to bring packages to my country trinidad and tobago) i only got the package on the 28th of june. when i opened it, i only got a large roll of film negaitve and nothing else. so i got a little paranoid thinking maybe someone at my skybox took the dvd out so i headed to there website to look up the contents of the package and all that was listed was the film and nothing else. so the next morning 29th i sent over an email to there csr patricia, i would have dealt with her when i initially had interest in there service to find out some details. my email was strongly worked and a bit aggressive as i've been waiting over two weeks from film scans, at this time i regretted doing business with mpix and i still do tbh.\n\na few minutes later barry sent me a reply apologizing about the issue and asking for my address to send over another dvd, i replied stating what had happened over the past two weeks and i wasn't up to waiting another week for a dvd to arrive. another quick 2 replies from stating that 1. he was looking into the issues 2. he uploaded the images we transfer for download. a few minutes later i email with a link to the images for **download** on we transfer.\n\nafter getting it upload i thought why not just offer this as a option instead of having customers wait for there scans to be shipped out, they're just using the whole dvd archive as a aggressive method to get more money from customers imo.\n\nanyway i downloaded it all they were average/good scans (noritsu koki scanner) but i was very satisfied at this point that i finally got my images but in the back of my mind knowing that this would be the last time using there service or even recommending it to anyone.\n\nnow to conclude, processing and development of your film is very fast. scans are average/ good quality (only could go on what i got scanned). shipping was very slow for me, they claimed its because of it being delivered to a po box.\n\ncustomer service was good mostly, there was one csr that didn't know much about there operations which leave the impression that all staff isn't trained equally.\n\n**as the elders in my country say 'cheap thing nah good and good thing nah cheap'.**\n\nsamples of the images i shot can be seen on my ig page :everydayfilm.tt   [ig direct link](https://www.instagram.com/everydayfilm.tt/)\n\non to the next film studio...", "sortedWord": "None", "identifyer": 19309, "year": "2018"}], "name": "archiveAnalogCommunity2018"}