{"interestingcomments": [{"Unnamed: 0": 256348, "autor": "EstuaryDweller", "date": 1619515076000, "content": "Colour or B&amp;W For Photojournal? /!/ I don't really know why I'm asking as it's purely a personal decision at the end of the day but I'm hoping getting the views of others might help sway me one way or the other.\n\nSo anyway, I would like to start a blog/Photojournal, call it what you will, and I intend to tell stories, recount historical events (give a history lesson for a castle or abandoned building alongside the images for instance) and journal what life is like today for future generations. In a way its more of a project for my kids than it is for anyone around today so the social media clout isn't overly important to me. I will post some of the stuff online but the main thing to me is storing it all away in an archive or book. \n\nI figured analog photography was the way to go because not only do you have the prints but also the negatives as a backup for the best chance for posterity.\n\nThe thing is, I keep flip-floping on the issue of colour or B&amp;W. Colour is obviously better for representing our world as we see it, but black and white has more chance for longer permanence both on the negative and on the print. Granted, in most circumstances you're probably talking about 200 years Vs 700 years if they're kept in half decent conditions and in darkness, both will far outlast even my children presuming they don't throw them out, but I'm thinking if I'm going to do this, why not do it properly and think of the distant future. (Who knows, if the Internet went down and society collapsed little projects like this would become invaluable.)\n\nSo what do you all think? B&amp;W or colour, or maybe a combination of both?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/mzkfcs/colour_or_bw_for_photojournal/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "colour or b&amp;w for photojournal? /!/ i don't really know why i'm asking as it's purely a personal decision at the end of the day but i'm hoping getting the views of others might help sway me one way or the other.\n\nso anyway, i would like to start a blog/photojournal, call it what you will, and i intend to tell stories, recount historical events (give a history lesson for a castle or abandoned building alongside the images for instance) and journal what life is like today for future generations. in a way its more of a project for my kids than it is for anyone around today so the social media clout isn't overly important to me. i will post some of the stuff online but the main thing to me is storing it all away in an -----> archive !!!  or book. \n\ni figured analog photography was the way to go because not only do you have the prints but also the negatives as a backup for the best chance for posterity.\n\nthe thing is, i keep flip-floping on the issue of colour or b&amp;w. colour is obviously better for representing our world as we see it, but black and white has more chance for longer permanence both on the negative and on the print. granted, in most circumstances you're probably talking about 200 years vs 700 years if they're kept in half decent conditions and in darkness, both will far outlast even my children presuming they don't throw them out, but i'm thinking if i'm going to do this, why not do it properly and think of the distant future. (who knows, if the internet went down and society collapsed little projects like this would become invaluable.)\n\nso what do you all think? b&amp;w or colour, or maybe a combination of both?", "sortedWord": "None", "identifyer": 1765, "year": "2021"}, {"Unnamed: 0": 256446, "autor": "MichaelPraetorius", "date": 1624156954000, "content": "The Darkroom Estate Sale of Gene Crediford. Ringwood, NJ. Smithsonian featured photographer. They must have had conservators scour the place for his master negatives, right? We couldn't have been privy to all of this... The worth of Artwork after Death. /!/ A couple weeks ago (a week ago? two weeks?), my partner and I were sent a photo of a little estate sale in Ringwood, NJ. I'm not a photographer, buy my partner is. We saw a couple old land cameras, and boxes of Kodachrome slides.\n\nBoth of us run a photograph preservation and heirloom archival service for the NYC metro area. We digitize everything, repair and retouch, and preserve all paper ephemera (with a little genealogy on the side). We are a couple months in and really getting started. Not much time to scan stranger's shit, but this seemed worth it.\n\nI messaged the lady on FB marketplace running the estate sale. She wound up being the deceased's daughter. I of course asked if she had other photos, or knew what vacations were on the slides, small talk. She said the deceased, her father, was Gene Crediford. His work was in the Smithsonian, he has a book, and she would be glad to talk to me the next day. My partner, 2 of my investor 'friends', and my mom all said it sounds like shes just going to charge up the ass for the 'smithsonian' name attached to these cameras, and told me not to waste my time.\n\nI woke my ass up and dragged the boy along.\n\nWe were there 15 minutes early, and the first ones there. The place was 100% haunted. No A/C. The house was falling apart. And every tiny little area of space was filled to the gills with kodachromes and negatives. So much that it was absolutely fucking intimidating. We didn't google him the night before, and there was no time to waste, so I just start throwing archive boxes filled with dumped out carousels onto the front porch, as my boyfriend continued to wake up with each destroyed camera he found. He was going for the stuff that would get us gear, while I took the precious time I had alone in that house to run like mad in case anyone else found out about this crazy shit. I filled up 4 archive boxes of slides, a box for a viewfinder, a dope chair, a dufflebag of negatives, and as much archival storage materials I could find onto the front porch. My partner came out with a few boxes looking as if he saw the ghost of Gene Crediford himself moments before. \n\n\"Something feels weird. This doesn't seem right. I'll handle the money, though. Don't talk about money.\"\n\nBy the time we were making an offer, a few more cars had pulled up, and people were rushing inside. I hid everything I got, but I must have gotten hundreds, maybe thousands of slides. Not knowing what we were doing. \n\nThe Boy said to the lady that we were so sorry for her loss, we were budding photographers and archivists and wanted to get as much 'practice material' that was here to get ourselves on the right foot, and we wanted to give her $200 for what we found. She said she was so glad other photographers could see his work, went in, grabbed another carousel to give me, and had us on our way.\n\n\"I got originals from his book.\" \n\n\"No.\"\n\n\"They're in a box under an old Nikon 24mm wide angle lens I found. We made our money today. Something is weird, though.\"\n\nSomething was weird. First, the lens looked like it had been chucked off a mountain. The lenses themselves weren't cracked, but the screws looked like a caveman with a blowtorch got to them, and the entire thing was bent and completely shot. \n\nAlso, i'm about 3 hours into scanning, and we've found 3/3 (labeled, of course) duplicates, of one of the Anthropological pieces that he donated to the Smithsonian. And he didn't give them the slides. He gave them prints. \n\nHe was a professor as well, with his own photographic archive at the college. So they, or the smithsonian, must have been in there to take out all the originals, right? Then why do I have my hands on every single reel of photographs he donated that were taken around these smithsonian pieces? Some reels are labeled as smithsonian donated prints, and have priceless images in them. \n\nHis daughter said she had sold a couple cameras on ebay, and through tears, said that she at least knew to take out the two cans of film in his fridge after he died. But with no mention of anyone being there before, seemingly nobody caring about the room of archived slides we took. \n\nCan anyone shed any light as to what might have happened? And why I seem to be hoarding a mighty haul from such a seemingly esteemed photographer?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o3vspp/the_darkroom_estate_sale_of_gene_crediford/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "the darkroom estate sale of gene crediford. ringwood, nj. smithsonian featured photographer. they must have had conservators scour the place for his master negatives, right? we couldn't have been privy to all of this... the worth of artwork after death. /!/ a couple weeks ago (a week ago? two weeks?), my partner and i were sent a photo of a little estate sale in ringwood, nj. i'm not a photographer, buy my partner is. we saw a couple old land cameras, and boxes of kodachrome slides.\n\nboth of us run a photograph preservation and heirloom archival service for the nyc metro area. we digitize everything, repair and retouch, and preserve all paper ephemera (with a little genealogy on the side). we are a couple months in and really getting started. not much time to scan stranger's shit, but this seemed worth it.\n\ni messaged the lady on fb marketplace running the estate sale. she wound up being the deceased's daughter. i of course asked if she had other photos, or knew what vacations were on the slides, small talk. she said the deceased, her father, was gene crediford. his work was in the smithsonian, he has a book, and she would be glad to talk to me the next day. my partner, 2 of my investor 'friends', and my mom all said it sounds like shes just going to charge up the ass for the 'smithsonian' name attached to these cameras, and told me not to waste my time.\n\ni woke my ass up and dragged the boy along.\n\nwe were there 15 minutes early, and the first ones there. the place was 100% haunted. no a/c. the house was falling apart. and every tiny little area of space was filled to the gills with kodachromes and negatives. so much that it was absolutely fucking intimidating. we didn't google him the night before, and there was no time to waste, so i just start throwing -----> archive !!!  boxes filled with dumped out carousels onto the front porch, as my boyfriend continued to wake up with each destroyed camera he found. he was going for the stuff that would get us gear, while i took the precious time i had alone in that house to run like mad in case anyone else found out about this crazy shit. i filled up 4 archive boxes of slides, a box for a viewfinder, a dope chair, a dufflebag of negatives, and as much archival storage materials i could find onto the front porch. my partner came out with a few boxes looking as if he saw the ghost of gene crediford himself moments before. \n\n\"something feels weird. this doesn't seem right. i'll handle the money, though. don't talk about money.\"\n\nby the time we were making an offer, a few more cars had pulled up, and people were rushing inside. i hid everything i got, but i must have gotten hundreds, maybe thousands of slides. not knowing what we were doing. \n\nthe boy said to the lady that we were so sorry for her loss, we were budding photographers and archivists and wanted to get as much 'practice material' that was here to get ourselves on the right foot, and we wanted to give her $200 for what we found. she said she was so glad other photographers could see his work, went in, grabbed another carousel to give me, and had us on our way.\n\n\"i got originals from his book.\" \n\n\"no.\"\n\n\"they're in a box under an old nikon 24mm wide angle lens i found. we made our money today. something is weird, though.\"\n\nsomething was weird. first, the lens looked like it had been chucked off a mountain. the lenses themselves weren't cracked, but the screws looked like a caveman with a blowtorch got to them, and the entire thing was bent and completely shot. \n\nalso, i'm about 3 hours into scanning, and we've found 3/3 (labeled, of course) duplicates, of one of the anthropological pieces that he donated to the smithsonian. and he didn't give them the slides. he gave them prints. \n\nhe was a professor as well, with his own photographic archive at the college. so they, or the smithsonian, must have been in there to take out all the originals, right? then why do i have my hands on every single reel of photographs he donated that were taken around these smithsonian pieces? some reels are labeled as smithsonian donated prints, and have priceless images in them. \n\nhis daughter said she had sold a couple cameras on ebay, and through tears, said that she at least knew to take out the two cans of film in his fridge after he died. but with no mention of anyone being there before, seemingly nobody caring about the room of archived slides we took. \n\ncan anyone shed any light as to what might have happened? and why i seem to be hoarding a mighty haul from such a seemingly esteemed photographer?", "sortedWord": "None", "identifyer": 1864, "year": "2021"}, {"Unnamed: 0": 257325, "autor": "TheBlueGoblin", "date": 1631943937000, "content": "This strip got stuck to one of my archive sleeves when I pulled it off it looks like some of the emulsion came off. Is this due to improper development or fixing, the emulsion not being fully washed off from the sprocket area?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pqgqcl/this_strip_got_stuck_to_one_of_my_archive_sleeves/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "this strip got stuck to one of my -----> archive !!!  sleeves when i pulled it off it looks like some of the emulsion came off. is this due to improper development or fixing, the emulsion not being fully washed off from the sprocket area?", "sortedWord": "None", "identifyer": 2760, "year": "2021"}, {"Unnamed: 0": 257333, "autor": "SpencerKayR", "date": 1631925281000, "content": "\"Beginner Advice\" 1 year later /!/ When I was starting in film photography just over a year ago, I sought lots of advice. Some turned out to be useful, some not so much, and some I was just not ready for. Here's my thoughts on the beginner advice I received after a year of practice. \n\n# \"Overexpose your negatives\"\n\nThis advice comes in many flavors, such as, \"You should always rate Portra 400 at 200\", or, \"Delta 3200 is actually 1000 ISO film,\" \"always meter for the shadows with film\", and finally the least broad (but most correct), \"If the light is confusing, it's better to overexpose than underexpose.\" \n\nA year later, and I think I have some idea of why this advice persists. The darling cameras of the Analog Renaissance are mechanical dinosaurs with through-the-lens meters, like my beloved K1000. And if those meters are the only ones you ever use, overexposing all your negatives by one stop may actually seem like sensible advice. That old fashioned meter is trying to make your scene (or more likely the very center of it) a neutral luminance value. Doing this is not a half-bad way to ensure that the scene falls within the dynamic range of your film. \n\nThe problem is, your camera doesn't know what you're pointing it at. It doesn't know the difference between an asphalt driveway and a cumulus cloud, it just wants them both to be exposed right down the middle of your film's dynamic range. But asphalt and clouds aren't supposed to be the same brightness. \n\nThe problem becomes more obvious once you have an incident meter in your hand. An incident meter measures the light *falling onto* a subject, and will recommend an exposure which accurately records the luminance of the subjects, as opposed to reflected light meters that want everything to be neutral gray, a.k.a. Zone V. It doesn't take long to realize that incident readings and reflected readings seldom agree, and often times the incident reading will be brighter. The meter in the trendy old mechanical SLR is trying to tamp down the brightness of the subject to make sure it falls in the film's dynamic range, whereas the incident meter only cares about how well lit things are. When I first started taking incident readings, I was horrified to find that my K1000's meter disagreed with most readings, often indicating overexposure. But experience has taught me to trust incident readings for most situations. \n\nAnd then there are a half-dozen other reasons why you may need a brighter exposure than your camera meter is telling you, like a bright sky, street lamps, reciprocity failure, etc. But when a beginner is asking you how to get some decent shots on her first roll, you don't have time to explain all the kinds of metering, all the situations that require compensation, and what reciprocity failure is. But you know that if she aims to overexpose, most of her shots will probably turn out fine. So that becomes the advice. \"Just overexpose.\" \n\nThe only drawback I see is that some people seem to hold onto this well past their own beginner stage, and keep repeating these things even when they ought to know better. So my revised beginner advice is, \"You're safe overexposing, but set a long-term goal of improving your metering.\" \n\n# \"Don't worry about genre, just take pictures.\"\n\nThis is some of my favorite advice I ever got. I don't remember who told me this, but they said, in a nutshell, \"don't worry about taking street, landscape, architecture, etc. Just take pictures and see what you gravitate towards.\" \n\nWhat can I say? It's exactly what I needed to hear. I started out taking pictures of whatever I happened to find interesting, just like most of us, and over time I have gravitated towards landscapes and still-lifes. So I say, keep this advice going. \n\n# \"(X antique mechanical SLR) is the perfect beginner camera!\" \n\nThere was a time when my beloved Pentax K1000 was a great beginner camera. But camera prices in 2021 are completely upside down. The mechanical dinosaurs (lovely though they are) cost 5, six times as much as the pro quality 90s SLRs, which have way better specs and kickass auto-exposure, but which are unloved because they are plastic and dorky looking. \n\nBut I understand why people continue to recommend Canon F1s and Pentax MEs. Yes, the price is over-inflated due to hype, but part of what you're paying for is simplicity. Not so much simplicity in camera operation, but simplicity in keeping an outdated technology working in 2021. \n\nSuppose I successfully convince someone they should buy a 90s dork SLR instead of a trendy antique. Their very next question would probably be, \"which one?\" But unfortunately the answer to that question requires a bunch of knowledge they probably don't have yet. The closer to the present you get, lens compatibility goes from dead simple to a nightmarish sudoku puzzle. Batteries are a headache, and whereas my K1000 could very well out-live me due to its mechanical innards, my Z1 (equally beloved) will most likely die in my hands and then be destined for the landfill.  \n\nThis is why I think so many guides to beginner cameras just repeat, \"Pentax K1000, Canon AE, Nikon F2\" etc. It's just a lot easier than going, \"maybe a Canon EOS Rebel G? And if you don't see one on eBay, trying searching 'EOS Rebel Kiss', that's the Japanese version. And make sure you get an EF lens if you want auto-focus. Oh wait, you already have a DA lens? That changes everything!\" \n\nIt's ironic, because the cameras withthe best specs are cheaper and easier to find, but harder to confidently buy if you're a beginner. And not nearly as cool looking. \n\n# \"Slide film isn't for beginners, shoot negatives for now.\"\n\nOn the one hand, this is extremely sensible. Slide film is expensive at every single stage, from purchase to processing. And taking pictures with it is one of the most nerve-shreddingly tricky pursuits I've ever taken on. It absolutely makes sense to shoot negative films for a long time-- months, years even-- before attempting slide film. \n\nBut that's not what I did. The first roll I bought was Velvia 50. And I had enough discipline to burn through a couple negative rolls first, but I just couldn't help myself. And most of my exposures were garbage, but a few pictures were salvageable. From that point I've shot roughly one roll of slide film per month. \n\nReflecting on my journey with slide film, I think that diving in was the only way for me. Although I just got through saying how it makes complete sense to practice with the far more forgiving negative film, I don't think there's any adequate preparation for shooting slide. Shooting negatives trains you to expect miles of dynamic range, oodles of exposure latitude, and boundless power to fix things in post. Slide film does not have those things. Shooting negative film trains you to disregard Graduated filters, because they make pale blue skies look garish. But with slide film, they're often necessary to have any sky at all. Basically, if I had followed the advice, if I were only starting to shoot slide film *now,* I'd probably decide it was too difficult and too expensive and I may as well keep going with the negative film I've gathered so much experience with. So I'm glad I didn't listen to good sense, because making slides is one of my favorite parts of photography. \n\n# \"Take pictures for yourself, not for internet points.\"\n\nThis is probably the best advice on this list. It's probably also the hardest to follow. The internet is a strange place. It is an engine, whose boilers are fueled by engagement, which is mined by dopamine inducing UI. Getting some kind of response to what we put out there is the reason we're all here, otherwise the internet would consist of private cloud storage where we all archive our thoughts and creative endeavors which we never bother sharing. \n\nAnd yet, each day we hear the refrain, \"stop caring about internet points!\" Sometimes I think people are a little embarrassed at the affect social media has on them. I know I am. I know that likes and upvotes shouldn't matter, that all my validation should come from within. I know that. And have long contended with the lingering suspicion that my hunger for internet validation amounts to a personal failing. \n\nBut I don't think I'm the only person who feels that way. I don't think I'm alone in craving validation and carrying shame over that craving. And I think this is why people get edgy when you talk openly about disappointment over lack of response to a photo. Sympathizing with the loser who got no upvotes and is salty about it means acknowledging the power upvotes have to light up our monkey brains, and acknowledging that power means facing the possibility that I too might just be another monkey. The truism goes that we are most annoyed in others by what we don't like about ourselves. None of us wants to admit that we care about getting attention, but most of us like positive attention when we get it. This is considered ostentatious and immodest, so we scold ourselves for it. And when other people let the mask slip and reveal how much attention matters to them, we jump on them for it. \n\nOn reddit, especially, people like to think of themselves as free-thinkers, individuals, not easily manipulated. So I think that repeatedly saying, \"take pictures for yourself,\" is not really advice for beginners, but something people say to soothe *themselves* after enduring long periods with acknowledgement. Because it's not very realistic advice. I mean sure, on some level, sometimes I really do believe that I'm taking pictures for myself, Sometimes I really believe that I don't care what other people think of my photography. But when I take a photo that I think is fire, and then there's no response when I post it, I do feel disappointment. And pretending I don't would be dishonest. \n\nHere's how I would amend this advice: Learn your own mind. Learn to notice when you're setting unrealistic expectations for internet points, learn to identify (and forgive yourself for) disappointment, and know that social media tends to like a specific type of attention-grabbing instantly-digestible content, and that might not be where your passions lie. It's okay to want a slice of spotlight sometimes; most people do (reserve suspicion for people who loudly proclaim their indifference towards it). \n\n# \"Don't do (x popular thing that people like)\"\n\nI've interacted with a lot of artistic communities over the years, having gone to music school, then game design school, then brushing the world of sound engineering, visual arts, and now analog photography. And I have to say, the Analog community might be the most envy-poisoned community I've ever interacted with. I mean, I love y'all, but the amount of complaining and sour grapes is like nothing I've ever encountered. \n\n\"Ugh, the entire front page is half-naked women,\" or, \"another basketball hoop? really?\" or, \"Hi, I know you didn't ask for advice, but you should know that using narrow DOF is a crutch, and amateurs will think it looks 'pro' because iPhones can't do it, but the true connoisseurs see it as distasteful. \n\nThat last one is a (slightly exaggerated rendition of) real comment I received. This person's concern was not primarily that opening up the lens would make my photos worse, but rather that ignoramuses who don't know any better would like it for the wrong reasons. I see this kind of comment every time a guitar player ends up on front page of nextfuckinglevel, top few comments are, \"wow\", and then from there it's all bitter musicians complaining that it's all showy extended technique, etc. \n\nThere's a certain type of criticism which boils down to, \"it's bad because the wrong people like it.\" This is why Titanic is the last popular film to win a Best Picture Oscar, and why teenage music lovers (including, regrettably, myself at one time) have lamented being born into the \"wrong generation\". \n\nI can't claim to have gotten over this impulse completely. I still struggle with envy and lack of fulfillment. But I'm happy I'm at least aware of it, and I don't let it control me anymore. \n\nHow do I amend this advice? Some (not all, but some) people in the analog community are more envious than they themselves realize. (See also the above paragraph about people with sour grapes over not getting the spotlight). If they perceive any element of your photo as being a shortcut somehow, some cheap tactic for making the plebs 'ooh' and 'ahh', they'll kindly offer to explain how this thing that people like is actually distasteful, and if you want to be a *real* photographer, you must stop it immediately. Ignore doctrinaires, and murder your own inner doctrinaire with your bare hands before he takes over completely. \n\nAfter a year of taking pictures with film, some advice has been perfect, some an understandable compromise, some downright incorrect, and some is more revealing of the advice giver.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pqcc29/beginner_advice_1_year_later/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "\"beginner advice\" 1 year later /!/ when i was starting in film photography just over a year ago, i sought lots of advice. some turned out to be useful, some not so much, and some i was just not ready for. here's my thoughts on the beginner advice i received after a year of practice. \n\n# \"overexpose your negatives\"\n\nthis advice comes in many flavors, such as, \"you should always rate portra 400 at 200\", or, \"delta 3200 is actually 1000 iso film,\" \"always meter for the shadows with film\", and finally the least broad (but most correct), \"if the light is confusing, it's better to overexpose than underexpose.\" \n\na year later, and i think i have some idea of why this advice persists. the darling cameras of the analog renaissance are mechanical dinosaurs with through-the-lens meters, like my beloved k1000. and if those meters are the only ones you ever use, overexposing all your negatives by one stop may actually seem like sensible advice. that old fashioned meter is trying to make your scene (or more likely the very center of it) a neutral luminance value. doing this is not a half-bad way to ensure that the scene falls within the dynamic range of your film. \n\nthe problem is, your camera doesn't know what you're pointing it at. it doesn't know the difference between an asphalt driveway and a cumulus cloud, it just wants them both to be exposed right down the middle of your film's dynamic range. but asphalt and clouds aren't supposed to be the same brightness. \n\nthe problem becomes more obvious once you have an incident meter in your hand. an incident meter measures the light *falling onto* a subject, and will recommend an exposure which accurately records the luminance of the subjects, as opposed to reflected light meters that want everything to be neutral gray, a.k.a. zone v. it doesn't take long to realize that incident readings and reflected readings seldom agree, and often times the incident reading will be brighter. the meter in the trendy old mechanical slr is trying to tamp down the brightness of the subject to make sure it falls in the film's dynamic range, whereas the incident meter only cares about how well lit things are. when i first started taking incident readings, i was horrified to find that my k1000's meter disagreed with most readings, often indicating overexposure. but experience has taught me to trust incident readings for most situations. \n\nand then there are a half-dozen other reasons why you may need a brighter exposure than your camera meter is telling you, like a bright sky, street lamps, reciprocity failure, etc. but when a beginner is asking you how to get some decent shots on her first roll, you don't have time to explain all the kinds of metering, all the situations that require compensation, and what reciprocity failure is. but you know that if she aims to overexpose, most of her shots will probably turn out fine. so that becomes the advice. \"just overexpose.\" \n\nthe only drawback i see is that some people seem to hold onto this well past their own beginner stage, and keep repeating these things even when they ought to know better. so my revised beginner advice is, \"you're safe overexposing, but set a long-term goal of improving your metering.\" \n\n# \"don't worry about genre, just take pictures.\"\n\nthis is some of my favorite advice i ever got. i don't remember who told me this, but they said, in a nutshell, \"don't worry about taking street, landscape, architecture, etc. just take pictures and see what you gravitate towards.\" \n\nwhat can i say? it's exactly what i needed to hear. i started out taking pictures of whatever i happened to find interesting, just like most of us, and over time i have gravitated towards landscapes and still-lifes. so i say, keep this advice going. \n\n# \"(x antique mechanical slr) is the perfect beginner camera!\" \n\nthere was a time when my beloved pentax k1000 was a great beginner camera. but camera prices in 2021 are completely upside down. the mechanical dinosaurs (lovely though they are) cost 5, six times as much as the pro quality 90s slrs, which have way better specs and kickass auto-exposure, but which are unloved because they are plastic and dorky looking. \n\nbut i understand why people continue to recommend canon f1s and pentax mes. yes, the price is over-inflated due to hype, but part of what you're paying for is simplicity. not so much simplicity in camera operation, but simplicity in keeping an outdated technology working in 2021. \n\nsuppose i successfully convince someone they should buy a 90s dork slr instead of a trendy antique. their very next question would probably be, \"which one?\" but unfortunately the answer to that question requires a bunch of knowledge they probably don't have yet. the closer to the present you get, lens compatibility goes from dead simple to a nightmarish sudoku puzzle. batteries are a headache, and whereas my k1000 could very well out-live me due to its mechanical innards, my z1 (equally beloved) will most likely die in my hands and then be destined for the landfill.  \n\nthis is why i think so many guides to beginner cameras just repeat, \"pentax k1000, canon ae, nikon f2\" etc. it's just a lot easier than going, \"maybe a canon eos rebel g? and if you don't see one on ebay, trying searching 'eos rebel kiss', that's the japanese version. and make sure you get an ef lens if you want auto-focus. oh wait, you already have a da lens? that changes everything!\" \n\nit's ironic, because the cameras withthe best specs are cheaper and easier to find, but harder to confidently buy if you're a beginner. and not nearly as cool looking. \n\n# \"slide film isn't for beginners, shoot negatives for now.\"\n\non the one hand, this is extremely sensible. slide film is expensive at every single stage, from purchase to processing. and taking pictures with it is one of the most nerve-shreddingly tricky pursuits i've ever taken on. it absolutely makes sense to shoot negative films for a long time-- months, years even-- before attempting slide film. \n\nbut that's not what i did. the first roll i bought was velvia 50. and i had enough discipline to burn through a couple negative rolls first, but i just couldn't help myself. and most of my exposures were garbage, but a few pictures were salvageable. from that point i've shot roughly one roll of slide film per month. \n\nreflecting on my journey with slide film, i think that diving in was the only way for me. although i just got through saying how it makes complete sense to practice with the far more forgiving negative film, i don't think there's any adequate preparation for shooting slide. shooting negatives trains you to expect miles of dynamic range, oodles of exposure latitude, and boundless power to fix things in post. slide film does not have those things. shooting negative film trains you to disregard graduated filters, because they make pale blue skies look garish. but with slide film, they're often necessary to have any sky at all. basically, if i had followed the advice, if i were only starting to shoot slide film *now,* i'd probably decide it was too difficult and too expensive and i may as well keep going with the negative film i've gathered so much experience with. so i'm glad i didn't listen to good sense, because making slides is one of my favorite parts of photography. \n\n# \"take pictures for yourself, not for internet points.\"\n\nthis is probably the best advice on this list. it's probably also the hardest to follow. the internet is a strange place. it is an engine, whose boilers are fueled by engagement, which is mined by dopamine inducing ui. getting some kind of response to what we put out there is the reason we're all here, otherwise the internet would consist of private cloud storage where we all -----> archive !!!  our thoughts and creative endeavors which we never bother sharing. \n\nand yet, each day we hear the refrain, \"stop caring about internet points!\" sometimes i think people are a little embarrassed at the affect social media has on them. i know i am. i know that likes and upvotes shouldn't matter, that all my validation should come from within. i know that. and have long contended with the lingering suspicion that my hunger for internet validation amounts to a personal failing. \n\nbut i don't think i'm the only person who feels that way. i don't think i'm alone in craving validation and carrying shame over that craving. and i think this is why people get edgy when you talk openly about disappointment over lack of response to a photo. sympathizing with the loser who got no upvotes and is salty about it means acknowledging the power upvotes have to light up our monkey brains, and acknowledging that power means facing the possibility that i too might just be another monkey. the truism goes that we are most annoyed in others by what we don't like about ourselves. none of us wants to admit that we care about getting attention, but most of us like positive attention when we get it. this is considered ostentatious and immodest, so we scold ourselves for it. and when other people let the mask slip and reveal how much attention matters to them, we jump on them for it. \n\non reddit, especially, people like to think of themselves as free-thinkers, individuals, not easily manipulated. so i think that repeatedly saying, \"take pictures for yourself,\" is not really advice for beginners, but something people say to soothe *themselves* after enduring long periods with acknowledgement. because it's not very realistic advice. i mean sure, on some level, sometimes i really do believe that i'm taking pictures for myself, sometimes i really believe that i don't care what other people think of my photography. but when i take a photo that i think is fire, and then there's no response when i post it, i do feel disappointment. and pretending i don't would be dishonest. \n\nhere's how i would amend this advice: learn your own mind. learn to notice when you're setting unrealistic expectations for internet points, learn to identify (and forgive yourself for) disappointment, and know that social media tends to like a specific type of attention-grabbing instantly-digestible content, and that might not be where your passions lie. it's okay to want a slice of spotlight sometimes; most people do (reserve suspicion for people who loudly proclaim their indifference towards it). \n\n# \"don't do (x popular thing that people like)\"\n\ni've interacted with a lot of artistic communities over the years, having gone to music school, then game design school, then brushing the world of sound engineering, visual arts, and now analog photography. and i have to say, the analog community might be the most envy-poisoned community i've ever interacted with. i mean, i love y'all, but the amount of complaining and sour grapes is like nothing i've ever encountered. \n\n\"ugh, the entire front page is half-naked women,\" or, \"another basketball hoop? really?\" or, \"hi, i know you didn't ask for advice, but you should know that using narrow dof is a crutch, and amateurs will think it looks 'pro' because iphones can't do it, but the true connoisseurs see it as distasteful. \n\nthat last one is a (slightly exaggerated rendition of) real comment i received. this person's concern was not primarily that opening up the lens would make my photos worse, but rather that ignoramuses who don't know any better would like it for the wrong reasons. i see this kind of comment every time a guitar player ends up on front page of nextfuckinglevel, top few comments are, \"wow\", and then from there it's all bitter musicians complaining that it's all showy extended technique, etc. \n\nthere's a certain type of criticism which boils down to, \"it's bad because the wrong people like it.\" this is why titanic is the last popular film to win a best picture oscar, and why teenage music lovers (including, regrettably, myself at one time) have lamented being born into the \"wrong generation\". \n\ni can't claim to have gotten over this impulse completely. i still struggle with envy and lack of fulfillment. but i'm happy i'm at least aware of it, and i don't let it control me anymore. \n\nhow do i amend this advice? some (not all, but some) people in the analog community are more envious than they themselves realize. (see also the above paragraph about people with sour grapes over not getting the spotlight). if they perceive any element of your photo as being a shortcut somehow, some cheap tactic for making the plebs 'ooh' and 'ahh', they'll kindly offer to explain how this thing that people like is actually distasteful, and if you want to be a *real* photographer, you must stop it immediately. ignore doctrinaires, and murder your own inner doctrinaire with your bare hands before he takes over completely. \n\nafter a year of taking pictures with film, some advice has been perfect, some an understandable compromise, some downright incorrect, and some is more revealing of the advice giver.", "sortedWord": "None", "identifyer": 2768, "year": "2021"}, {"Unnamed: 0": 258809, "autor": "TRAINPOSTING", "date": 1611095243000, "content": "Photographers similar to Ralph Gibson? /!/ I really enjoy his composition style—getting up close and using the shapes, lines, curves, textures, and contrasts in everyday environments to create these abstract, minimalist photos. [Here’s some examples from his website.](http://www.ralphgibson.com/2004-2005-di-chirico.html) You can also see more in the archive section. \n\nCan anyone recommend any photographers with a similar style? Bonus points if their work stretches back decades.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l0uz0n/photographers_similar_to_ralph_gibson/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "photographers similar to ralph gibson? /!/ i really enjoy his composition style—getting up close and using the shapes, lines, curves, textures, and contrasts in everyday environments to create these abstract, minimalist photos. [here’s some examples from his website.](http://www.ralphgibson.com/2004-2005-di-chirico.html) you can also see more in the -----> archive !!!  section. \n\ncan anyone recommend any photographers with a similar style? bonus points if their work stretches back decades.", "sortedWord": "None", "identifyer": 4264, "year": "2021"}, {"Unnamed: 0": 259214, "autor": "ThisIsClay", "date": 1626814772000, "content": "Nikon SA-21 To Sa-30 Conversion - Success stories /!/ Hi All, \n\nI've read about this in the archive and on various sites. I have a brand new SA-21 that I would love to convert as I have about 30 rolls of film to scan. \n\nMy only hang up is that I have never soldered anything, ever.\n\nThis site recommends connecting two points next to the 'N\" in Nikon\n\n[http://www.shtengel.com/gleb/converting\\_nikon\\_sa21\\_to\\_sa30.htm](http://www.shtengel.com/gleb/converting_nikon_sa21_to_sa30.htm)\n\nThis one recommends connecting two points between the 16 &amp; 17th contact unless you are experienced then to connect the points next to the 'N'\n\n[https://www.stockholmviews.com/coolscan-rollfeeder-mod.html](https://www.stockholmviews.com/coolscan-rollfeeder-mod.html)\n\n\\-Has anyone tried either of these methods?  \n\n\\-What has worked well?\n\n\\-Is there an advantage or disadvantage to either?\n\n\\-What gauge wire does one use?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ooazjc/nikon_sa21_to_sa30_conversion_success_stories/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "nikon sa-21 to sa-30 conversion - success stories /!/ hi all, \n\ni've read about this in the -----> archive !!!  and on various sites. i have a brand new sa-21 that i would love to convert as i have about 30 rolls of film to scan. \n\nmy only hang up is that i have never soldered anything, ever.\n\nthis site recommends connecting two points next to the 'n\" in nikon\n\n[http://www.shtengel.com/gleb/converting\\_nikon\\_sa21\\_to\\_sa30.htm](http://www.shtengel.com/gleb/converting_nikon_sa21_to_sa30.htm)\n\nthis one recommends connecting two points between the 16 &amp; 17th contact unless you are experienced then to connect the points next to the 'n'\n\n[https://www.stockholmviews.com/coolscan-rollfeeder-mod.html](https://www.stockholmviews.com/coolscan-rollfeeder-mod.html)\n\n\\-has anyone tried either of these methods?  \n\n\\-what has worked well?\n\n\\-is there an advantage or disadvantage to either?\n\n\\-what gauge wire does one use?", "sortedWord": "None", "identifyer": 4676, "year": "2021"}, {"Unnamed: 0": 259586, "autor": "sorryforthecusses", "date": 1621987693000, "content": "looking a good $200 scanner /!/ i bought an epson V600 a while cause it seemed to be the best option at my budget of $200. but it's been on back order for a bit (strikes at the nearest port), and in the time i've spent waiting for it to come in, i've seen some posts on here and other film subreddits that it's not all that it's cracked up to be. should i cancel my order and get the refund while i can and put my $200 into a better scanner? i'm not married to any particular type, i'll roll with either flatbed or dedicated.\n\ni'm just aiming for decent resolution. i tried one of those smart phone scanner but it looks like ass. i'm not a professional but i'm not an amateur either. i've been shooting for years and years so i have quite the backlog i want to archive. i never got around to it cause up until recently, i could print ones i liked at a darkroom. plus i accidently ended up in charge of the family archives lol. i need it to be able to do 35mm (mounted slides and strips) and 120. color negatives, slide film, black and white, the whole shebang. some of it is pretty old too. does anyone have advice on the best $200 film scanner?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nl3p69/looking_a_good_200_scanner/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "looking a good $200 scanner /!/ i bought an epson v600 a while cause it seemed to be the best option at my budget of $200. but it's been on back order for a bit (strikes at the nearest port), and in the time i've spent waiting for it to come in, i've seen some posts on here and other film subreddits that it's not all that it's cracked up to be. should i cancel my order and get the refund while i can and put my $200 into a better scanner? i'm not married to any particular type, i'll roll with either flatbed or dedicated.\n\ni'm just aiming for decent resolution. i tried one of those smart phone scanner but it looks like ass. i'm not a professional but i'm not an amateur either. i've been shooting for years and years so i have quite the backlog i want to -----> archive !!! . i never got around to it cause up until recently, i could print ones i liked at a darkroom. plus i accidently ended up in charge of the family archives lol. i need it to be able to do 35mm (mounted slides and strips) and 120. color negatives, slide film, black and white, the whole shebang. some of it is pretty old too. does anyone have advice on the best $200 film scanner?", "sortedWord": "None", "identifyer": 5056, "year": "2021"}, {"Unnamed: 0": 260432, "autor": "monawa", "date": 1623951053000, "content": "Just a little storytime /!/ I work in a photo studio / store that has been existing for over fifty years now. With Covid &amp; Semi Lockdown we started decluttering &amp; looking through the basement where my boss also found this old archive box with some studio shoot photos / negatives from the 70s &amp; 80s.\n \nIn the end it's work for customers we can't show  anyone and don't need anymore but oh did it hurt to shred these old gems after I appreciated them one last time.\n \nI'm sure you guys feel me 😁", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o22qjz/just_a_little_storytime/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "just a little storytime /!/ i work in a photo studio / store that has been existing for over fifty years now. with covid &amp; semi lockdown we started decluttering &amp; looking through the basement where my boss also found this old -----> archive !!!  box with some studio shoot photos / negatives from the 70s &amp; 80s.\n \nin the end it's work for customers we can't show  anyone and don't need anymore but oh did it hurt to shred these old gems after i appreciated them one last time.\n \ni'm sure you guys feel me 😁", "sortedWord": "None", "identifyer": 5916, "year": "2021"}, {"Unnamed: 0": 260906, "autor": "zweebna", "date": 1630590654000, "content": "Archiving and storage /!/ How do you all archive your stuff? How do you store and organize your old negatives and prints? Do you keep the RAW/TIFFs of all your scans? Just of the keepers? Just keep JPEGs? Upload and delete? What is your folder structure like?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pgiaj2/archiving_and_storage/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "archiving and storage /!/ how do you all -----> archive !!!  your stuff? how do you store and organize your old negatives and prints? do you keep the raw/tiffs of all your scans? just of the keepers? just keep jpegs? upload and delete? what is your folder structure like?", "sortedWord": "None", "identifyer": 6408, "year": "2021"}, {"Unnamed: 0": 261253, "autor": "rtcdn", "date": 1629253867000, "content": "Does anyone know of a list of 35mm moving film print archives or collectors? /!/ I'm looking for a directory of North American libraries or organizations that have an expansive 35mm moving film print archive and or a list of major collectors. Does anyone have the info?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p6i8mo/does_anyone_know_of_a_list_of_35mm_moving_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "does anyone know of a list of 35mm moving film print archives or collectors? /!/ i'm looking for a directory of north american libraries or organizations that have an expansive 35mm moving film print -----> archive !!!  and or a list of major collectors. does anyone have the info?", "sortedWord": "None", "identifyer": 6761, "year": "2021"}, {"Unnamed: 0": 262223, "autor": "superexcitedpenguin", "date": 1610780620000, "content": "In Theory 8mm film storage (cult classic movie) /!/ Possibility of obtaining a 8mm film of a cult classic movie. Any tips on how to store it? \nWas going to convert a mini fridge into a cool space to store it until I could find a proper place to keep it. (Have a humidity controller/gage on it) \nAlso is there a film archive in the Pacific North West that would be a cost efficient place to keep it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kye6u4/in_theory_8mm_film_storage_cult_classic_movie/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "in theory 8mm film storage (cult classic movie) /!/ possibility of obtaining a 8mm film of a cult classic movie. any tips on how to store it? \nwas going to convert a mini fridge into a cool space to store it until i could find a proper place to keep it. (have a humidity controller/gage on it) \nalso is there a film -----> archive !!!  in the pacific north west that would be a cost efficient place to keep it?", "sortedWord": "None", "identifyer": 7758, "year": "2021"}, {"Unnamed: 0": 262456, "autor": "tehabe", "date": 1625393084000, "content": "Order slips and left overs /!/ Since I'm scanning my family's archive of 35 mm film I have some with those order slips attached to them. Also some with adhesive residue from those slips. Any recommendation to remove those w/o destroying the film?\n\n&amp;#x200B;\n\n[Order slip on part of roll of 35 mm film on a dirty desk mat](https://preview.redd.it/i5t9f66e66971.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=36a1ee1249c70fa54ed73e3c1efdfbd73ec084ec)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/odhh4k/order_slips_and_left_overs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "order slips and left overs /!/ since i'm scanning my family's -----> archive !!!  of 35 mm film i have some with those order slips attached to them. also some with adhesive residue from those slips. any recommendation to remove those w/o destroying the film?\n\n&amp;#x200b;\n\n[order slip on part of roll of 35 mm film on a dirty desk mat](https://preview.redd.it/i5t9f66e66971.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=36a1ee1249c70fa54ed73e3c1efdfbd73ec084ec)", "sortedWord": "None", "identifyer": 7994, "year": "2021"}, {"Unnamed: 0": 263510, "autor": "lobstler", "date": 1623150935000, "content": "\"Even late in the afternoon...\" [Found this ad from the 1930s while doing some archive research] 😁", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nv1mnx/even_late_in_the_afternoon_found_this_ad_from_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "\"even late in the afternoon...\" [found this ad from the 1930s while doing some -----> archive !!!  research] 😁", "sortedWord": "None", "identifyer": 9071, "year": "2021"}, {"Unnamed: 0": 263644, "autor": "Grahmmatical", "date": 1611456549000, "content": "Restoring/Archiving 2000+ Estate Photos. Advice? /!/ Hello everyone. My grandfather passed away a few months ago, and left over 2,000 slides to his estate. I was asked to scan, restore, and archive them; the estate was willing to cover any equipment or software cost. I bought the tools I needed, and began working. Some of the photos my grandfather took are truly astounding and I'm glad I was given this job.\n\nHowever, progress is slow; it takes nearly 45 minutes to scan and correct a batch of 12. My spring semester is starting to ramp up and I've less time to archive. Considering the amount of time &amp; effort this project takes, it doesn't do much for me. It's emotionally fulfilling, sure, but I don't have a wage and \"archived family photos\" isn't something I can put on a resume.\n\nShould I ask the estate for a wage, or should I push for prints/books? How can I scan/archive more efficiently? Any and all advice is welcome.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/l3qtuj/restoringarchiving_2000_estate_photos_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "restoring/archiving 2000+ estate photos. advice? /!/ hello everyone. my grandfather passed away a few months ago, and left over 2,000 slides to his estate. i was asked to scan, restore, and -----> archive !!!  them; the estate was willing to cover any equipment or software cost. i bought the tools i needed, and began working. some of the photos my grandfather took are truly astounding and i'm glad i was given this job.\n\nhowever, progress is slow; it takes nearly 45 minutes to scan and correct a batch of 12. my spring semester is starting to ramp up and i've less time to archive. considering the amount of time &amp; effort this project takes, it doesn't do much for me. it's emotionally fulfilling, sure, but i don't have a wage and \"archived family photos\" isn't something i can put on a resume.\n\nshould i ask the estate for a wage, or should i push for prints/books? how can i scan/archive more efficiently? any and all advice is welcome.", "sortedWord": "None", "identifyer": 9206, "year": "2021"}, {"Unnamed: 0": 263949, "autor": "sandershoots", "date": 1624468299000, "content": "My Canon A-1 photo archive /!/ [removed]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o6hb3h/my_canon_a1_photo_archive/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "my canon a-1 photo -----> archive !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 9515, "year": "2021"}, {"Unnamed: 0": 264002, "autor": "Princebrooks1", "date": 1624372536000, "content": "Negative Processing : A Film Journal - Just started to archive photo's from Camp Perry, OH in the 1930's!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/o5okx2/negative_processing_a_film_journal_just_started/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "negative processing : a film journal - just started to -----> archive !!!  photo's from camp perry, oh in the 1930's!", "sortedWord": "None", "identifyer": 9569, "year": "2021"}], "name": "archiveAnalogCommunity2021"}