{"interestingcomments": [{"Unnamed: 0": 88508, "autor": "madsindya", "date": 1567925662000, "content": "Film for travelling in overcast locations /!/ Hullo\n\nI use a Pentax k1000 and am a very amateur photographer- generally just for photos of friends and for travelling. I will be travelling through the UK and to Iceland in Jan/Feb and wondering what sort of **colour** film would be good for taking general photos of landscapes and sightseeing. I assume it will be quite overcast for the majority of the time. \n\n&amp;#x200B;\n\nThanks! :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d17p9x/film_for_travelling_in_overcast_locations/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "film for travelling in overcast -----> locations !!!  /!/ hullo\n\ni use a pentax k1000 and am a very amateur photographer- generally just for photos of friends and for travelling. i will be travelling through the uk and to iceland in jan/feb and wondering what sort of **colour** film would be good for taking general photos of landscapes and sightseeing. i assume it will be quite overcast for the majority of the time. \n\n&amp;#x200b;\n\nthanks! :)", "sortedWord": "None", "identifyer": 90987, "year": "2019"}, {"Unnamed: 0": 89135, "autor": "DerFarva", "date": 1577647578000, "content": "Photo book location studies? /!/ I'm looking at making a location study of my hometown over the course of a year through various formats including digital, 35mm, 120mm, and polaroids! I was wondering if anybody is familiar with any similar books I can take inspiration from? Even any books that just stick to one medium but study a town or city?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eha6jm/photo_book_location_studies/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "photo book -----> location !!!  studies? /!/ i'm looking at making a location study of my hometown over the course of a year through various formats including digital, 35mm, 120mm, and polaroids! i was wondering if anybody is familiar with any similar books i can take inspiration from? even any books that just stick to one medium but study a town or city?", "sortedWord": "None", "identifyer": 91617, "year": "2019"}, {"Unnamed: 0": 89172, "autor": "matklein", "date": 1577551329000, "content": "Please Help - Engagement Photos /!/ Hi Everyone!\n\nSo I have a friend who is getting married and she asked me to shoot their engagement photos on film.\n\nTo be completely honest, I’m comfortable with shooting film and composing images... but I’ve never really shot people before. The thought of doing portraits scares me to death.\n\nI told her I’m not really comfortable doing it and she’s been encouraging me to go out of my comfort zone to give it a whirl. (I’ve already disclosed that they may be garbage and that I’m going to shoot digital as well... just to be safe!) 😂\n\nI’m trying to arm myself with as much practical knowledge as possible, but I know that if we were on location now... I’ll be in over my head. 😂\n\nDoes anyone have any suggestions on shooting people, posing, or random things to think about before I embark on this endeavor?\n\nAny and all advice would be helpful. If I can give her just a handful of photos that she likes, I’ll consider this a win.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/egsuqa/please_help_engagement_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "please help - engagement photos /!/ hi everyone!\n\nso i have a friend who is getting married and she asked me to shoot their engagement photos on film.\n\nto be completely honest, i’m comfortable with shooting film and composing images... but i’ve never really shot people before. the thought of doing portraits scares me to death.\n\ni told her i’m not really comfortable doing it and she’s been encouraging me to go out of my comfort zone to give it a whirl. (i’ve already disclosed that they may be garbage and that i’m going to shoot digital as well... just to be safe!) 😂\n\ni’m trying to arm myself with as much practical knowledge as possible, but i know that if we were on -----> location !!!  now... i’ll be in over my head. 😂\n\ndoes anyone have any suggestions on shooting people, posing, or random things to think about before i embark on this endeavor?\n\nany and all advice would be helpful. if i can give her just a handful of photos that she likes, i’ll consider this a win.", "sortedWord": "None", "identifyer": 91654, "year": "2019"}, {"Unnamed: 0": 89707, "autor": "analogehime", "date": 1551515934000, "content": "Fujifilm/Portra 400 white balance /!/ I was recently doing some outdoor golden hour portrait shooting. Halfway through the shoot I finished my roll of Fujifilm Superia 800 and switched to Portra 400. Because of reasons the rolls ended up going to different labs. \n\nBasically the photos on the Superia all came out look amazing, bright, realistic colors, while the Portra came out looking way too golden, muddy, no true whites. Probably can be fixed in Lightroom but I'm not very good at postprocessing yet. \n\nIs this more likely to be the film or the lab? The photos were shot within minutes of each other in the exact same location.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/awfr6p/fujifilmportra_400_white_balance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fujifilm/portra 400 white balance /!/ i was recently doing some outdoor golden hour portrait shooting. halfway through the shoot i finished my roll of fujifilm superia 800 and switched to portra 400. because of reasons the rolls ended up going to different labs. \n\nbasically the photos on the superia all came out look amazing, bright, realistic colors, while the portra came out looking way too golden, muddy, no true whites. probably can be fixed in lightroom but i'm not very good at postprocessing yet. \n\nis this more likely to be the film or the lab? the photos were shot within minutes of each other in the exact same -----> location !!! .", "sortedWord": "None", "identifyer": 92194, "year": "2019"}, {"Unnamed: 0": 89946, "autor": "clrjhnn", "date": 1563131188000, "content": "Need help buying 35mm film in Italy /!/ As the title suggests! I'm hoping to find some 35mm film around Rome, are there any convenient locations near Vatican or the centre?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cd6tfw/need_help_buying_35mm_film_in_italy/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "need help buying 35mm film in italy /!/ as the title suggests! i'm hoping to find some 35mm film around rome, are there any convenient -----> locations !!!  near vatican or the centre?", "sortedWord": "None", "identifyer": 92433, "year": "2019"}, {"Unnamed: 0": 90012, "autor": "saltybaconman", "date": 1562708626000, "content": "Looking for advice on artificial light sources /!/ Hi there! I've been shooting mostly outdoors now and I wanted to get into indoor shooting using some colorful light sources. Neon signs are pretty expensive so I was looking for indoor locations but I was not very successful, except finding bars.\nThough I have found some fluorescent tubes which are inexpensive.\n\n\nSo I wouls like some advice from you guys! \nWhat kind of lights are you using? What would you recommend? I've been googling for a bit now and I couldn't find any helpful sources. \n\n\nAny recommendation, suggestion whatever is welcome! \n\n(Sorry about the formatting. Mobile user here)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cb7d1i/looking_for_advice_on_artificial_light_sources/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "looking for advice on artificial light sources /!/ hi there! i've been shooting mostly outdoors now and i wanted to get into indoor shooting using some colorful light sources. neon signs are pretty expensive so i was looking for indoor -----> locations !!!  but i was not very successful, except finding bars.\nthough i have found some fluorescent tubes which are inexpensive.\n\n\nso i wouls like some advice from you guys! \nwhat kind of lights are you using? what would you recommend? i've been googling for a bit now and i couldn't find any helpful sources. \n\n\nany recommendation, suggestion whatever is welcome! \n\n(sorry about the formatting. mobile user here)", "sortedWord": "None", "identifyer": 92499, "year": "2019"}, {"Unnamed: 0": 90346, "autor": "AgentSummer", "date": 1553680193000, "content": "Too much or too less light? /!/ So these photo is shot with a Praktica MTL 5B. I have the problem that some photos turn out greyish or almost blacked out. I already tried using 400 ISO, 200 ISO films and photos you can see here are with a 100 ISO film. All give a grey/black photo from time to time.\n\nMost the photos, also some with ok lighting have sometimes have a kind of glow/haze over them. When I bought the camera I bought I to my local camera shop and an employee said the light meter was \"one step off\". I have no idea in what direction, but I do remember that the blackout photo with the tree was taken at f/16, the slowest stop on my lens and the light meter said it was still to bright.\n\nAnyone an idea how I can fix/prevent these grey/blackouts of my photos and glowing of well light photos? I can't figure out if the film receives too much or too less light.\n\n(Excuses if I used weird words, English is not my first language)\n\n[you can clearly see the glow\\/haze on this well lighted photo](https://i.redd.it/2ov54w76vmo21.jpg)\n\n*Processing img t5e9uyliqmo21...*\n\n[taken when it just started snowing. I used the max stop I have on my, f\\/16, although the light meter still said it was too light ](https://i.redd.it/b0muj31zpmo21.jpg)\n\n[as far as I can remember it was cloudy on this day because there was drizzle](https://i.redd.it/s5gl0d2zpmo21.jpg)\n\n[semi-light location at the entrance of a railway station with big glass widows at the left of the shot](https://i.redd.it/ovxtk01zpmo21.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b62hml/too_much_or_too_less_light/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "too much or too less light? /!/ so these photo is shot with a praktica mtl 5b. i have the problem that some photos turn out greyish or almost blacked out. i already tried using 400 iso, 200 iso films and photos you can see here are with a 100 iso film. all give a grey/black photo from time to time.\n\nmost the photos, also some with ok lighting have sometimes have a kind of glow/haze over them. when i bought the camera i bought i to my local camera shop and an employee said the light meter was \"one step off\". i have no idea in what direction, but i do remember that the blackout photo with the tree was taken at f/16, the slowest stop on my lens and the light meter said it was still to bright.\n\nanyone an idea how i can fix/prevent these grey/blackouts of my photos and glowing of well light photos? i can't figure out if the film receives too much or too less light.\n\n(excuses if i used weird words, english is not my first language)\n\n[you can clearly see the glow\\/haze on this well lighted photo](https://i.redd.it/2ov54w76vmo21.jpg)\n\n*processing img t5e9uyliqmo21...*\n\n[taken when it just started snowing. i used the max stop i have on my, f\\/16, although the light meter still said it was too light ](https://i.redd.it/b0muj31zpmo21.jpg)\n\n[as far as i can remember it was cloudy on this day because there was drizzle](https://i.redd.it/s5gl0d2zpmo21.jpg)\n\n[semi-light -----> location !!!  at the entrance of a railway station with big glass widows at the left of the shot](https://i.redd.it/ovxtk01zpmo21.jpg)", "sortedWord": "None", "identifyer": 92833, "year": "2019"}, {"Unnamed: 0": 91706, "autor": "ShotOnFilm", "date": 1550915958000, "content": "Help with finals project. /!/ Greetings film family,\n\nFor my final project in my database theory class I decided to build a database on film. I need some ideals and feedback on my planning so far. Below is my outline for the database in SQL.\n\nI'm trying to think what else about film I can add to the database. I have Manufacturer, location, year founded, products, film, type, film speed, process, format, production start and start. \n\n&amp;#x200B;\n\nWhat else about the film or the company can I add to improve the database? \n\nDatabase: Photographic Film\n\nTables:\n\nManufacturer (ex. Kodak, Ilford, Adox)\n\nColumns:\n\nLocation (ex. USA, England, Russia, Japan)\n\nYear Founded (ex. 1888)\n\nProducts (ex. Digital imaging, photographic materials, equipment and services)\n\nFilm (ex. HP5+, Tri-x)\n\nType (ex. b/w print, color negative)\n\nFilm Speed (ex. Iso 100, 200, 400)\n\nProcess (ex. Gelatin silver, C-41, E-6)\n\nFormat  (ex. 35mm, 120, 220, 4x5)\n\nProduction start (1976)\n\nProduction stop (1989)\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/AnalogCommunity/comments/attwxb/help_with_finals_project/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help with finals project. /!/ greetings film family,\n\nfor my final project in my database theory class i decided to build a database on film. i need some ideals and feedback on my planning so far. below is my outline for the database in sql.\n\ni'm trying to think what else about film i can add to the database. i have manufacturer, -----> location !!! , year founded, products, film, type, film speed, process, format, production start and start. \n\n&amp;#x200b;\n\nwhat else about the film or the company can i add to improve the database? \n\ndatabase: photographic film\n\ntables:\n\nmanufacturer (ex. kodak, ilford, adox)\n\ncolumns:\n\nlocation (ex. usa, england, russia, japan)\n\nyear founded (ex. 1888)\n\nproducts (ex. digital imaging, photographic materials, equipment and services)\n\nfilm (ex. hp5+, tri-x)\n\ntype (ex. b/w print, color negative)\n\nfilm speed (ex. iso 100, 200, 400)\n\nprocess (ex. gelatin silver, c-41, e-6)\n\nformat  (ex. 35mm, 120, 220, 4x5)\n\nproduction start (1976)\n\nproduction stop (1989)\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 94203, "year": "2019"}, {"Unnamed: 0": 91950, "autor": "PandaPopulation", "date": 1563828953000, "content": "Can someone help ID what's going on with my Leica M3 / Summicron 50mm? /!/ [https://imgur.com/a/Li6vmQ7](https://imgur.com/a/Li6vmQ7)\n\nThere are what would appear to be light leaks happening throughout the frame as well as dark lines throughout the top.\n\nI initially thought this to be a bad scan but the result is the same after the lab did a rescan.\n\nAlso, these issues are only noticeable on images I shot at the beach. I have yet to see any of these issues when shooting in other locations.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cgivl3/can_someone_help_id_whats_going_on_with_my_leica/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "can someone help id what's going on with my leica m3 / summicron 50mm? /!/ [https://imgur.com/a/li6vmq7](https://imgur.com/a/li6vmq7)\n\nthere are what would appear to be light leaks happening throughout the frame as well as dark lines throughout the top.\n\ni initially thought this to be a bad scan but the result is the same after the lab did a rescan.\n\nalso, these issues are only noticeable on images i shot at the beach. i have yet to see any of these issues when shooting in other -----> locations !!! .", "sortedWord": "None", "identifyer": 94447, "year": "2019"}, {"Unnamed: 0": 92769, "autor": "cmazmanian", "date": 1556112172000, "content": "Camera shops in Tokyo /!/ Hey all, heading to Tokyo in a few weeks... Where/what are some cool camera shops. I'm thinking about picking up a 35mm Canon ltm lens for my Canon P.... Also, just want to see what else is out there! \nAny tips and locations or names appreciated\n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bguk0u/camera_shops_in_tokyo/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "camera shops in tokyo /!/ hey all, heading to tokyo in a few weeks... where/what are some cool camera shops. i'm thinking about picking up a 35mm canon ltm lens for my canon p.... also, just want to see what else is out there! \nany tips and -----> locations !!!  or names appreciated\n\nthanks", "sortedWord": "None", "identifyer": 95271, "year": "2019"}, {"Unnamed: 0": 92846, "autor": "DasLin9", "date": 1560164734000, "content": "Are cameras in Hong Kong cheaper than ones in Japan? /!/ I'm from Hong Kong and well aware of the great availability of both digital and analog cameras here, along with the good bargains (well, sometimes.) stores offer. As I know that the other great \"tech hub\" is Japan, I'm wondering if it is more worth it to buy (regardless I'll still check it out) a camera in Osaka during my trip there. I'm not familiar with prices in other locations. \n\nI'm looking for the Contax G2 btw.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bywi7u/are_cameras_in_hong_kong_cheaper_than_ones_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "are cameras in hong kong cheaper than ones in japan? /!/ i'm from hong kong and well aware of the great availability of both digital and analog cameras here, along with the good bargains (well, sometimes.) stores offer. as i know that the other great \"tech hub\" is japan, i'm wondering if it is more worth it to buy (regardless i'll still check it out) a camera in osaka during my trip there. i'm not familiar with prices in other -----> locations !!! . \n\ni'm looking for the contax g2 btw.", "sortedWord": "None", "identifyer": 95348, "year": "2019"}, {"Unnamed: 0": 92889, "autor": "robaq", "date": 1571967903000, "content": "Need help deciding on new small and light 35mm /!/ Hello.\nSince my Olympus Mju died I've been looking for a good camera that could replace it as a pocketable alternative to my Nikon SLRs. I don't want another Mju as I've been dissatisfied with the AF and overall operation. I would like as much manual control as possible, and point and shoots suck at it.\n\nI feel there are two cameras that would suit my needs: Rollei 35 and Leica iii. The Rollei seems to be a better choice overall (smaller form factor, metering, flash) but I can't help but gravitate towards the Leica. I plan to use it in dimly lit locations so I feel like the rangefinder focusing is a must. I also have a collapsible Industar 22 for the M39 mount so I don't have to worry about a lens for now.\n\nWhich one would you get, a Rollei 35 with Triotar 3.5 for $80 or a Leica IIIc for $200?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dmqg7l/need_help_deciding_on_new_small_and_light_35mm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "need help deciding on new small and light 35mm /!/ hello.\nsince my olympus mju died i've been looking for a good camera that could replace it as a pocketable alternative to my nikon slrs. i don't want another mju as i've been dissatisfied with the af and overall operation. i would like as much manual control as possible, and point and shoots suck at it.\n\ni feel there are two cameras that would suit my needs: rollei 35 and leica iii. the rollei seems to be a better choice overall (smaller form factor, metering, flash) but i can't help but gravitate towards the leica. i plan to use it in dimly lit -----> locations !!!  so i feel like the rangefinder focusing is a must. i also have a collapsible industar 22 for the m39 mount so i don't have to worry about a lens for now.\n\nwhich one would you get, a rollei 35 with triotar 3.5 for $80 or a leica iiic for $200?", "sortedWord": "None", "identifyer": 95392, "year": "2019"}, {"Unnamed: 0": 93598, "autor": "thehystericalqueen", "date": 1546535505000, "content": "how does dx coding work? /!/ hey all! so i'm a bit of a newbie to analog photography, and i've just found out about dx codes and that my camera reads them. does that mean that its kind of an automatic mode of the camera? so lets say you wouldn't change the exposure/aperture etc. for any of your photos on the roll of film they'd still turn out okay or do you still need to change it manually, depending on the location and light where you're taking your photo?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ac7qgb/how_does_dx_coding_work/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "how does dx coding work? /!/ hey all! so i'm a bit of a newbie to analog photography, and i've just found out about dx codes and that my camera reads them. does that mean that its kind of an automatic mode of the camera? so lets say you wouldn't change the exposure/aperture etc. for any of your photos on the roll of film they'd still turn out okay or do you still need to change it manually, depending on the -----> location !!!  and light where you're taking your photo?", "sortedWord": "None", "identifyer": 96107, "year": "2019"}, {"Unnamed: 0": 93707, "autor": "GhostFacedMillah", "date": 1566463932000, "content": "Help with light leak and it’s location.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ctunbl/help_with_light_leak_and_its_location/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "help with light leak and it’s -----> location !!! .", "sortedWord": "None", "identifyer": 96218, "year": "2019"}, {"Unnamed: 0": 93878, "autor": "arachanids", "date": 1575071650000, "content": "Stores/locations to check out in Austin? /!/ Hi! I’m super brand new at film photography in general, I only just now borrowed a 35mm slr  cam about two weeks ago. This weekend, I’m going to Austin for a few days. Are there any cool places I should check out  in Austin TX? I’m interested in places that sell things relating to photography, or just neat places I should practice shooting at.  Whether it’s a antique/vintage store or just a place that sells a lot of film, lmk if there’s somewhere I should check out!! Thanks :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e3ne0c/storeslocations_to_check_out_in_austin/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "stores/-----> locations !!!  to check out in austin? /!/ hi! i’m super brand new at film photography in general, i only just now borrowed a 35mm slr  cam about two weeks ago. this weekend, i’m going to austin for a few days. are there any cool places i should check out  in austin tx? i’m interested in places that sell things relating to photography, or just neat places i should practice shooting at.  whether it’s a antique/vintage store or just a place that sells a lot of film, lmk if there’s somewhere i should check out!! thanks :)", "sortedWord": "None", "identifyer": 96389, "year": "2019"}], "name": "locationAnalogCommunity2019"}