{"interestingcomments": [{"Unnamed: 0": 305114, "autor": "dayz_hello", "date": 1602735347000, "content": "I'm thinking about buying a Pentax 6x7. What are some considerations, as well as its limitations, that I should keep in mind before purchasing? /!/ I've been looking recently into buying a Pentax 6x7 (or 67, 67ii) and I am curious what current and past owners of this system think about the camera. I'm thinking of getting the 105mm, or if it's too expensive maybe a 90mm. I'll be using it mainly for on-location portraits.\n\nI know a few things about this camera, but I'm actually interested on what its frequent users think about it (How much of a burden is it's weight for example) in order to make an informed decision and go all-in to buy it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jbgohu/im_thinking_about_buying_a_pentax_6x7_what_are/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i'm thinking about buying a pentax 6x7. what are some considerations, as well as its limitations, that i should keep in mind before purchasing? /!/ i've been looking recently into buying a pentax 6x7 (or 67, 67ii) and i am curious what current and past owners of this system think about the camera. i'm thinking of getting the 105mm, or if it's too expensive maybe a 90mm. i'll be using it mainly for on------> location !!!  portraits.\n\ni know a few things about this camera, but i'm actually interested on what its frequent users think about it (how much of a burden is it's weight for example) in order to make an informed decision and go all-in to buy it.", "sortedWord": "None", "identifyer": 52038, "year": "2020"}, {"Unnamed: 0": 306423, "autor": "CannedWater_", "date": 1601213719000, "content": "Olympus OM10 - Shutter speed not working /!/ I recently picked up a few old cameras for a reasonable price, and one of which is an Oly OM10 with suspected problems. I have had a look at it and I have found that the shutter speed doesn't seem to be working.\n\n*I would also like to note that the battery is new, and it is not a sticky magnet problem, rather the electromagnet won't release at all. The manual adapter also seems to be ineffective and this issue is present on auto, manual and bulb. I would also like to note that I believe this model OM10 is a later one that was built to overcome the sticky electromagnet issue, which is why the location of the electromagnet is different to other common examples online.*\n\nI will attach a clip of the issue below. The viewfinder constantly displays a shutter speed of 1 second, but in reality, seems to be operating at an infinite amount of time as the mirror locks up and won't release. I located the electromagnet on the camera and found that releasing it will free up the mirror. This is not a sticky issue as I cleaned the contacts, and I can seem the magnet engage when I wind the Film advance lever. \n\n*Processing video qqe7z74m0pp51...*\n\n I also checked the ASA dial by taking the top cover off, and messed around with the lever on the bottom plate, but no luck and all seems working fine. It seems like a metering issue perhaps? Its as if the camera thinks it needs a shutter speed of one year. I'm not sure why this might be the case, and maybe it's just kaput? If anyone has any advice that would be great as it would be nice to revive this old camera. \n\n*Processing img fxeasvrp0pp51...*\n\n*Processing img ijuqaxrp0pp51...*\n\nI did some reading up on the Metering system for the OM10, and I'm not 100% sure how it works. In the event that there are two systems and one happens to be in the viewfinder, there is a noticeable burn mark inside the viewfinder. I'll attach an image here. This is not visible on the mirror or the plastic panel(?) above it. \n\n*Processing img oz65jh4r0pp51...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j0r7ij/olympus_om10_shutter_speed_not_working/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "olympus om10 - shutter speed not working /!/ i recently picked up a few old cameras for a reasonable price, and one of which is an oly om10 with suspected problems. i have had a look at it and i have found that the shutter speed doesn't seem to be working.\n\n*i would also like to note that the battery is new, and it is not a sticky magnet problem, rather the electromagnet won't release at all. the manual adapter also seems to be ineffective and this issue is present on auto, manual and bulb. i would also like to note that i believe this model om10 is a later one that was built to overcome the sticky electromagnet issue, which is why the -----> location !!!  of the electromagnet is different to other common examples online.*\n\ni will attach a clip of the issue below. the viewfinder constantly displays a shutter speed of 1 second, but in reality, seems to be operating at an infinite amount of time as the mirror locks up and won't release. i located the electromagnet on the camera and found that releasing it will free up the mirror. this is not a sticky issue as i cleaned the contacts, and i can seem the magnet engage when i wind the film advance lever. \n\n*processing video qqe7z74m0pp51...*\n\n i also checked the asa dial by taking the top cover off, and messed around with the lever on the bottom plate, but no luck and all seems working fine. it seems like a metering issue perhaps? its as if the camera thinks it needs a shutter speed of one year. i'm not sure why this might be the case, and maybe it's just kaput? if anyone has any advice that would be great as it would be nice to revive this old camera. \n\n*processing img fxeasvrp0pp51...*\n\n*processing img ijuqaxrp0pp51...*\n\ni did some reading up on the metering system for the om10, and i'm not 100% sure how it works. in the event that there are two systems and one happens to be in the viewfinder, there is a noticeable burn mark inside the viewfinder. i'll attach an image here. this is not visible on the mirror or the plastic panel(?) above it. \n\n*processing img oz65jh4r0pp51...*", "sortedWord": "None", "identifyer": 53370, "year": "2020"}, {"Unnamed: 0": 307064, "autor": "brokesnob", "date": 1593137058000, "content": "what are my 6x7 options? in the market for one. recently sold my p67ii... might go for a late p67 ttl... or what else is there? owned rz67 pro ii as well, too heavy. /!/ maybe no point to this post, but what the heck...\n\ni am a fashion/portrait photographer who sometimes shoots film. i've owned several killer film cameras... hasselblad 503cw, mamiya rz 67 pro ii, leica m-a, pentax 67ii, sinar f1, etc.,etc.\n\nbut i always ended up selling my analog cameras because i simply didn't use them near as much as i'd hoped i would. that is obviously on me. in fact, i just sold the p67ii &amp; 503cw very recently. i still have the leica m-a (which i'll probably sell as i just don't use 35mm so much, and that's a lot to have invested in a 35mm body) and a nikon fm2, which i'll keep as it was a gift.\n\nas of late i've really been wanting to get a 6x7 (or possibly 645) system again, but am wondering what options there are other than what i've owned? i have considered the mamiya 7ii- always wanted one, for the 43mm in particular-, but not sure how it'd do in the context of fashion photography and portraiture. my current top contender is actually a pentax 67 again, but not the ii... rather a late model 67. i understand there's less to go wrong inside of these, which is assuring, as i've read the 67ii's are essentially write-offs once something goes sideways- that true? and as much as i loved my rz67 pro ii- it's the film camera i used most by far, having shot several hundred rolls through it-, the bulk just killed my desire to use it. far too big, awkward, and, worst, heavy. and i am a big guy. in studio on a tripod it was ok, which is where these things shine, but for location stuff (which i do a lot of) it's just no bueno. while the pentax wasn't a whole lot lighter, the classic slr form factor made it a lot easier to handle.\n\nso are there any other 6x7's that i might look into? ideally something that handles like an slr.\n\nor maybe i should go the 645 route? contax seems nice, but just stupid money now. seems there's a ton of mamiya 645's around for cheap.\n\nbudget isn't really of concern, so feel free to recommend anything. but at the same time, i'm objectively wondering if the contax 645 will give me so much more than the mamiya 645's (which are a fraction of the cost) to warrant the price differential. i don't care about fancy features- prefer full manual experience, don't even need metering built in.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hfyzer/what_are_my_6x7_options_in_the_market_for_one/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "what are my 6x7 options? in the market for one. recently sold my p67ii... might go for a late p67 ttl... or what else is there? owned rz67 pro ii as well, too heavy. /!/ maybe no point to this post, but what the heck...\n\ni am a fashion/portrait photographer who sometimes shoots film. i've owned several killer film cameras... hasselblad 503cw, mamiya rz 67 pro ii, leica m-a, pentax 67ii, sinar f1, etc.,etc.\n\nbut i always ended up selling my analog cameras because i simply didn't use them near as much as i'd hoped i would. that is obviously on me. in fact, i just sold the p67ii &amp; 503cw very recently. i still have the leica m-a (which i'll probably sell as i just don't use 35mm so much, and that's a lot to have invested in a 35mm body) and a nikon fm2, which i'll keep as it was a gift.\n\nas of late i've really been wanting to get a 6x7 (or possibly 645) system again, but am wondering what options there are other than what i've owned? i have considered the mamiya 7ii- always wanted one, for the 43mm in particular-, but not sure how it'd do in the context of fashion photography and portraiture. my current top contender is actually a pentax 67 again, but not the ii... rather a late model 67. i understand there's less to go wrong inside of these, which is assuring, as i've read the 67ii's are essentially write-offs once something goes sideways- that true? and as much as i loved my rz67 pro ii- it's the film camera i used most by far, having shot several hundred rolls through it-, the bulk just killed my desire to use it. far too big, awkward, and, worst, heavy. and i am a big guy. in studio on a tripod it was ok, which is where these things shine, but for -----> location !!!  stuff (which i do a lot of) it's just no bueno. while the pentax wasn't a whole lot lighter, the classic slr form factor made it a lot easier to handle.\n\nso are there any other 6x7's that i might look into? ideally something that handles like an slr.\n\nor maybe i should go the 645 route? contax seems nice, but just stupid money now. seems there's a ton of mamiya 645's around for cheap.\n\nbudget isn't really of concern, so feel free to recommend anything. but at the same time, i'm objectively wondering if the contax 645 will give me so much more than the mamiya 645's (which are a fraction of the cost) to warrant the price differential. i don't care about fancy features- prefer full manual experience, don't even need metering built in.", "sortedWord": "None", "identifyer": 54023, "year": "2020"}, {"Unnamed: 0": 307233, "autor": "75footubi", "date": 1603479616000, "content": "Photo Logs? /!/ As a part of my day job, I do inspections where we take a shit ton of photos and part of the process is recording what each shot is of (location, direction, subject, etc). \n\nAs I'm getting back into film, I'm thinking logging what lens, subject, and other settings I use might make a lot of sense. Does anyone do this and would you mind sharing your system?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jgtf35/photo_logs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "photo logs? /!/ as a part of my day job, i do inspections where we take a shit ton of photos and part of the process is recording what each shot is of (-----> location !!! , direction, subject, etc). \n\nas i'm getting back into film, i'm thinking logging what lens, subject, and other settings i use might make a lot of sense. does anyone do this and would you mind sharing your system?", "sortedWord": "None", "identifyer": 54194, "year": "2020"}, {"Unnamed: 0": 307246, "autor": "isophiles", "date": 1603445441000, "content": "Kitsch torture. /!/ So recently I've been trying to pick a theme and stick with it till I can get at the least 9 acceptable shots.  This is a game I'm playing with myself out of quarantine boredom, 9 frames is a block on zi gram.  \n\nWell I'm on my second block that for no real reason other than imitation started with a car photo.  You know the type.  The grill shot.  The headlight shot.  The profile trunk shot.  I even have some fuzzy dice.  All classic, old, battered cars.\n\nWell I've been trying to get those last three shots to finish my little block of 3x3 before I move on and the struggle is real.  \n\nThe locations and the cars are already selected but these last three are a mix of just 'going through the motions' and self flagellation as I go to the same three spots daily, waiting for the sun to be right just so I can finish what has become in my head one worn out theme.\n\nNow I don't mean to rag on other peoples photos if worn out interesting cars are your thing,  I've just realized I like looking at people's photos of old cars more than I like taking them.  Everyone else's grass is great.  My grass is kitsch af.\n\nSo I'm wondering who out there also finds themselves struggling to get over the last hurdle of a project they've committed to?  Do you barrel through it?  Do you just call it when you're over it?\n\n I'm trying to get better at finishing projects I've started and I'm curious how others motivate themselves to do so without getting distracted by the next thing.  In this case my next 3x3 block, because I'm over cars.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jgjw4l/kitsch_torture/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "kitsch torture. /!/ so recently i've been trying to pick a theme and stick with it till i can get at the least 9 acceptable shots.  this is a game i'm playing with myself out of quarantine boredom, 9 frames is a block on zi gram.  \n\nwell i'm on my second block that for no real reason other than imitation started with a car photo.  you know the type.  the grill shot.  the headlight shot.  the profile trunk shot.  i even have some fuzzy dice.  all classic, old, battered cars.\n\nwell i've been trying to get those last three shots to finish my little block of 3x3 before i move on and the struggle is real.  \n\nthe -----> locations !!!  and the cars are already selected but these last three are a mix of just 'going through the motions' and self flagellation as i go to the same three spots daily, waiting for the sun to be right just so i can finish what has become in my head one worn out theme.\n\nnow i don't mean to rag on other peoples photos if worn out interesting cars are your thing,  i've just realized i like looking at people's photos of old cars more than i like taking them.  everyone else's grass is great.  my grass is kitsch af.\n\nso i'm wondering who out there also finds themselves struggling to get over the last hurdle of a project they've committed to?  do you barrel through it?  do you just call it when you're over it?\n\n i'm trying to get better at finishing projects i've started and i'm curious how others motivate themselves to do so without getting distracted by the next thing.  in this case my next 3x3 block, because i'm over cars.", "sortedWord": "None", "identifyer": 54207, "year": "2020"}, {"Unnamed: 0": 307946, "autor": "weirdasianfaces", "date": 1607474969000, "content": "Under-exposure using Canon A1? /!/ I picked up a Canon A1 a while back and only developed a few rolls which had lots of light. There were a few that had some under-exposure but I figured it was operator error.\n\nI just got back a bunch of rolls from the lab today and *man* there is some serious under-exposure. Given my experience before I had been pushing nearly every roll at least 1 stop and shooting on program mode.\n\nI'll be real: I know fuckall about proper photography and mostly just mess around (although I'm trying to learn). I have no idea how to use a light meter, but here are some readings I just took with aperture priority for the app:\n\n\nLocation | Which | Mode | Aperture | Shutter | ISO |\n---|---|---|---|----|----\nRoom | App |AP | f/2.8 | 1.5s  | 400\nRoom | Camera | Program | f/1.8 | 1s | 400\nOutside Window | App | AP | f/2.8 | 1/12 | 400\nOutside Window | Camera | Program | f/1.8 | 1/10 | 400\nRoom | Camera | AP (2.8) | f/2.8 | 2s | 400\nOutside Window | Camera | AP (2.8) | f/2.8 | 1/6 | 400\n\nI *think* if I'm interpreting the data shows that the meter isn't that far off. However, in situations with LOTS of light I end up with photos like this: https://imgur.com/a/ofapnhk\n\nAny advice for further diagnosing this issue? Operator error? Mechanical issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k9h8dg/underexposure_using_canon_a1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "under-exposure using canon a1? /!/ i picked up a canon a1 a while back and only developed a few rolls which had lots of light. there were a few that had some under-exposure but i figured it was operator error.\n\ni just got back a bunch of rolls from the lab today and *man* there is some serious under-exposure. given my experience before i had been pushing nearly every roll at least 1 stop and shooting on program mode.\n\ni'll be real: i know fuckall about proper photography and mostly just mess around (although i'm trying to learn). i have no idea how to use a light meter, but here are some readings i just took with aperture priority for the app:\n\n\n-----> location !!!  | which | mode | aperture | shutter | iso |\n---|---|---|---|----|----\nroom | app |ap | f/2.8 | 1.5s  | 400\nroom | camera | program | f/1.8 | 1s | 400\noutside window | app | ap | f/2.8 | 1/12 | 400\noutside window | camera | program | f/1.8 | 1/10 | 400\nroom | camera | ap (2.8) | f/2.8 | 2s | 400\noutside window | camera | ap (2.8) | f/2.8 | 1/6 | 400\n\ni *think* if i'm interpreting the data shows that the meter isn't that far off. however, in situations with lots of light i end up with photos like this: https://imgur.com/a/ofapnhk\n\nany advice for further diagnosing this issue? operator error? mechanical issue?", "sortedWord": "None", "identifyer": 54919, "year": "2020"}, {"Unnamed: 0": 308265, "autor": "idiaaa", "date": 1585511317000, "content": "All Olympus µ[mju:] models in one table /!/ \nI've managed to compile a table with all µ[mju:] models that were ever produced with some main specs:\n\n* [Olympus µ[mju:] cameras ](https://1drv.ms/x/s!Ap2k1NWd9oddpCXHtptiQ2I4HATf?e=V9ZTsl)\n\nFeel free to give feedback on how to improve and update it.\n\nThree notes from Camerapedia that are not in the table:\n\n* PANORAMA utilized tiny magnets to move a mask in front of the film in the middle of the roll while keeping the body and basic spec unchanged. \n* DELUXE or DLX usually, but not always, indicates a Quartzdate version was available.\n* VF indicates a model with an extra bright \"visual finder\" that blacks out (like an SLR) to indicate the shot has been taken. This was supposed to be useful for noisy locations.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/frbz5h/all_olympus_µmju_models_in_one_table/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "all olympus µ[mju:] models in one table /!/ \ni've managed to compile a table with all µ[mju:] models that were ever produced with some main specs:\n\n* [olympus µ[mju:] cameras ](https://1drv.ms/x/s!ap2k1nwd9oddpcxhtptiq2i4hatf?e=v9ztsl)\n\nfeel free to give feedback on how to improve and update it.\n\nthree notes from camerapedia that are not in the table:\n\n* panorama utilized tiny magnets to move a mask in front of the film in the middle of the roll while keeping the body and basic spec unchanged. \n* deluxe or dlx usually, but not always, indicates a quartzdate version was available.\n* vf indicates a model with an extra bright \"visual finder\" that blacks out (like an slr) to indicate the shot has been taken. this was supposed to be useful for noisy -----> locations !!! .", "sortedWord": "None", "identifyer": 55247, "year": "2020"}, {"Unnamed: 0": 308622, "autor": "camebackhunted", "date": 1586737961000, "content": "Weird dark liquid in my camera /!/ I got a Canon T70 online and when I opened the camera, I saw a dark liquid on the edges of my film door. Seems like the liquid is coming from the light seals. Should I replace them or somehow soak that up?\n\nP.S. If anyone has a photo of all the Canon T70 light seal locations, I'd be very grateful. I can't seem to find them anywhere on the internet.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g087z5/weird_dark_liquid_in_my_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "weird dark liquid in my camera /!/ i got a canon t70 online and when i opened the camera, i saw a dark liquid on the edges of my film door. seems like the liquid is coming from the light seals. should i replace them or somehow soak that up?\n\np.s. if anyone has a photo of all the canon t70 light seal -----> locations !!! , i'd be very grateful. i can't seem to find them anywhere on the internet.", "sortedWord": "None", "identifyer": 55610, "year": "2020"}, {"Unnamed: 0": 308654, "autor": "lifebecool", "date": 1605119035000, "content": "Shooting with Canon Ae-1 Program and Canon Speedlite 177a /!/ Hey!\n\nI hope some people can help me out here...\n\nI've got an on-location shoot coming up, where I'll be shooting on my Canon Ae-1 Program along with Porta 400 film and a Canon Speedlite 177a. The client wants that harsh 'flash effect' for a mixture of saturated and clean portraits; wide, urban shots and close-up product shots (both indoors and outdoors). I'm worried, however, about the shots being grossly over-exposed from the flash. I guess I'm just hoping for some advice on how to use the Canon Ae-1 P and Canon Speedlite 177a to their full potential?\n\nFor example, do you advise that I use some sort of diffusion on the Speedlite 177a? And what are the benefits of shooting manual as opposed to automatic on the Speedlite flash? \n\nThanks for any assistance!\n\n:)\n\nJohnny", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jsdjap/shooting_with_canon_ae1_program_and_canon/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "shooting with canon ae-1 program and canon speedlite 177a /!/ hey!\n\ni hope some people can help me out here...\n\ni've got an on------> location !!!  shoot coming up, where i'll be shooting on my canon ae-1 program along with porta 400 film and a canon speedlite 177a. the client wants that harsh 'flash effect' for a mixture of saturated and clean portraits; wide, urban shots and close-up product shots (both indoors and outdoors). i'm worried, however, about the shots being grossly over-exposed from the flash. i guess i'm just hoping for some advice on how to use the canon ae-1 p and canon speedlite 177a to their full potential?\n\nfor example, do you advise that i use some sort of diffusion on the speedlite 177a? and what are the benefits of shooting manual as opposed to automatic on the speedlite flash? \n\nthanks for any assistance!\n\n:)\n\njohnny", "sortedWord": "None", "identifyer": 55643, "year": "2020"}, {"Unnamed: 0": 308712, "autor": "cahokia_98", "date": 1605025428000, "content": "The suspense /!/ My friend asked me to take some promotional photos on film. I got excited cuz she asked about shooting on film specifically and that’s my shit \n\nMy friend definitely said it was going to be a day shoot so I stocked up on portra 400. Unfortunately she had a long cosmetics session beforehand and the sun set at like 4:50pm so I ended up missing golden hour, shooting one location at dusk and then improvising one of those storefront-neon-light shots everyone does. \n\nI feel proud I can think on my feet but I’m like bro these photos might be garbage and I should have brought a dslr for this one lol", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jrnyo2/the_suspense/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the suspense /!/ my friend asked me to take some promotional photos on film. i got excited cuz she asked about shooting on film specifically and that’s my shit \n\nmy friend definitely said it was going to be a day shoot so i stocked up on portra 400. unfortunately she had a long cosmetics session beforehand and the sun set at like 4:50pm so i ended up missing golden hour, shooting one -----> location !!!  at dusk and then improvising one of those storefront-neon-light shots everyone does. \n\ni feel proud i can think on my feet but i’m like bro these photos might be garbage and i should have brought a dslr for this one lol", "sortedWord": "None", "identifyer": 55704, "year": "2020"}, {"Unnamed: 0": 309121, "autor": "indigowarpz", "date": 1600145883000, "content": "Daylight film under warm indoor light /!/ I’m going to be taking photos (I’m not the hired photographer) at my sister’s wedding upcoming. The venue was moved last minute to an indoor location and it looks like the overhead light is warm, but there is also a fair amount of window light. \n\nTrying to decide if I need to get a color correction filter for the warm indoor light. If so, which filter would you recommend? I realize I’m not providing a ton of info, but I’m also missing a bit of the necessary info myself. \n\nI have a few rolls of daylight balanced color film (hence my question), and a bunch of Tri-X and TMAX. I’d like not to make people look orange.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/it24oz/daylight_film_under_warm_indoor_light/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "daylight film under warm indoor light /!/ i’m going to be taking photos (i’m not the hired photographer) at my sister’s wedding upcoming. the venue was moved last minute to an indoor -----> location !!!  and it looks like the overhead light is warm, but there is also a fair amount of window light. \n\ntrying to decide if i need to get a color correction filter for the warm indoor light. if so, which filter would you recommend? i realize i’m not providing a ton of info, but i’m also missing a bit of the necessary info myself. \n\ni have a few rolls of daylight balanced color film (hence my question), and a bunch of tri-x and tmax. i’d like not to make people look orange.", "sortedWord": "None", "identifyer": 56118, "year": "2020"}, {"Unnamed: 0": 309176, "autor": "kingtigerii", "date": 1596116928000, "content": "A Camera Store employee’s view on price increases (slight rant) /!/ TL:DR - Film prices are high because it’s not 1999 and you’re using a niche product.\n\nThere was a post the other day regarding price increases and a thought that the film companies may be taking advantage of the “generous” members of the community.\n\nI work at a camera store, in the Midwest, that sells film and film cameras. I pride myself in being one of two “film guys” at our location (there are few other people there who shoot film but often the two of us are fixing the misinformation our coworkers spew). I deal with film shooters all day, complaining about price increases. That’s where I’m coming from, so hear me out:\n\nKodak increased prices to help cover an expansion in production - as last year was riddled with supply shortages (hence why Lomo film has been very difficult to obtain, Kodak makes that film). \n\nFuji is done with expanding film. Slide film, in its traditional use, is dead. Fuji will slowly kill the remaining lines off, issuing a finishing blow only when it becomes too expensive to manufacture. They don’t even make Acros anymore, as they chose to outsource it to Ilford. Fuji will continue to raise prices until it’s no longer marketable and they will kill the film division off. Honestly - they probably should. They are way more focused on the production and development of the digital division, as it actually makes them money.\n\nKodak brought back Ektachrome, but it is a slide film that is optimized for scanning and not projecting. The development of this stock was not cheap and its manufacture is not cheap - and even if it was, there isn’t the market there once was to buy it so it has to be priced much higher to make a decent profit.\n\nAll major brands had increases in prices. Lomo (look at Lomo 800 in 120, it’s now only two dollars less than Portra 800, and at least with Portra there’s no backing paper burn or loose rolls), Ilford, Kodak and Fuji.\n\nPrice increases are part of using an unpopular medium. \n\nThe vast majority of the consumer market still believes that Kodak isn’t in business and that film is dead. They have no interest in shooting film anymore, they usually chuckle at the thought of going back to film (Typically deleting photos is their point).\n\nIt sucks, I get it. I’m in the same boat everyone else is. I sold my digital stuff off and went back to casually shooting film. It’s a great medium.\n\nFinally - I’m getting really sick of hearing “Yeah I really want to support the brick and mortar stores like you guys!” And then asking me to price match BH on film prices. \n\nBH is cheaper because they buy and sell in volumes we can only dream of. They have a lower cost, and when you have us match prices it’s causing us to loose money or make no profit. When we make no profit, our purchaser doesn’t see the point in buying film for us to sell. We may make it back in processing but, yeah it’s not that much when you consider the machines are being lumped along from the late 90’s with scarce replacement parts and increasing chemical costs.\n\nAlright, I’m done. Just have fun, be safe, and may you have no blank frames.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i0mcns/a_camera_store_employees_view_on_price_increases/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a camera store employee’s view on price increases (slight rant) /!/ tl:dr - film prices are high because it’s not 1999 and you’re using a niche product.\n\nthere was a post the other day regarding price increases and a thought that the film companies may be taking advantage of the “generous” members of the community.\n\ni work at a camera store, in the midwest, that sells film and film cameras. i pride myself in being one of two “film guys” at our -----> location !!!  (there are few other people there who shoot film but often the two of us are fixing the misinformation our coworkers spew). i deal with film shooters all day, complaining about price increases. that’s where i’m coming from, so hear me out:\n\nkodak increased prices to help cover an expansion in production - as last year was riddled with supply shortages (hence why lomo film has been very difficult to obtain, kodak makes that film). \n\nfuji is done with expanding film. slide film, in its traditional use, is dead. fuji will slowly kill the remaining lines off, issuing a finishing blow only when it becomes too expensive to manufacture. they don’t even make acros anymore, as they chose to outsource it to ilford. fuji will continue to raise prices until it’s no longer marketable and they will kill the film division off. honestly - they probably should. they are way more focused on the production and development of the digital division, as it actually makes them money.\n\nkodak brought back ektachrome, but it is a slide film that is optimized for scanning and not projecting. the development of this stock was not cheap and its manufacture is not cheap - and even if it was, there isn’t the market there once was to buy it so it has to be priced much higher to make a decent profit.\n\nall major brands had increases in prices. lomo (look at lomo 800 in 120, it’s now only two dollars less than portra 800, and at least with portra there’s no backing paper burn or loose rolls), ilford, kodak and fuji.\n\nprice increases are part of using an unpopular medium. \n\nthe vast majority of the consumer market still believes that kodak isn’t in business and that film is dead. they have no interest in shooting film anymore, they usually chuckle at the thought of going back to film (typically deleting photos is their point).\n\nit sucks, i get it. i’m in the same boat everyone else is. i sold my digital stuff off and went back to casually shooting film. it’s a great medium.\n\nfinally - i’m getting really sick of hearing “yeah i really want to support the brick and mortar stores like you guys!” and then asking me to price match bh on film prices. \n\nbh is cheaper because they buy and sell in volumes we can only dream of. they have a lower cost, and when you have us match prices it’s causing us to loose money or make no profit. when we make no profit, our purchaser doesn’t see the point in buying film for us to sell. we may make it back in processing but, yeah it’s not that much when you consider the machines are being lumped along from the late 90’s with scarce replacement parts and increasing chemical costs.\n\nalright, i’m done. just have fun, be safe, and may you have no blank frames.", "sortedWord": "None", "identifyer": 56173, "year": "2020"}, {"Unnamed: 0": 309187, "autor": "Papkee", "date": 1596078868000, "content": "The downside to remote locations is there’s nowhere to get your shots developed", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i0eng9/the_downside_to_remote_locations_is_theres/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "the downside to remote -----> locations !!!  is there’s nowhere to get your shots developed", "sortedWord": "None", "identifyer": 56184, "year": "2020"}, {"Unnamed: 0": 309745, "autor": "Boristheshrimp", "date": 1601560017000, "content": "Where to buy film rolls in Warsaw /!/ Pretty self explanatory, but I’m going to Warsaw this weekend and didn’t bring enough rolls. Also, open to any suggestions to visit or must-see locations", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j38v6s/where_to_buy_film_rolls_in_warsaw/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "where to buy film rolls in warsaw /!/ pretty self explanatory, but i’m going to warsaw this weekend and didn’t bring enough rolls. also, open to any suggestions to visit or must-see -----> locations !!! ", "sortedWord": "None", "identifyer": 56749, "year": "2020"}, {"Unnamed: 0": 309898, "autor": "Im_Sofa__King", "date": 1588495090000, "content": "Negative Lab Pro error /!/ Hi, i have just installed Negative Lab Pro, and it never worked, I'm getting always that error:\n\n[Negative.lua:223: attempt to index local ‘i’ (a nil value)](https://forums.negativelabpro.com/t/negative-lua-attempt-to-index-local-i-a-nil-value/540)\n\ni have tried to change folder location many times, but without result, \n\ni am on Mac OS, can anyone please help me?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gcn8uf/negative_lab_pro_error/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "negative lab pro error /!/ hi, i have just installed negative lab pro, and it never worked, i'm getting always that error:\n\n[negative.lua:223: attempt to index local ‘i’ (a nil value)](https://forums.negativelabpro.com/t/negative-lua-attempt-to-index-local-i-a-nil-value/540)\n\ni have tried to change folder -----> location !!!  many times, but without result, \n\ni am on mac os, can anyone please help me?", "sortedWord": "None", "identifyer": 56904, "year": "2020"}, {"Unnamed: 0": 310332, "autor": "Funcron", "date": 1597882944000, "content": "These are some recent shots of the trellises on the Independence West trail near the city of Grass Valley, Northern California. Today a massive fire took them today due to dry lightning strikes two days ago. It was a beautiful location for photography, and will be missed.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iczx2p/these_are_some_recent_shots_of_the_trellises_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "these are some recent shots of the trellises on the independence west trail near the city of grass valley, northern california. today a massive fire took them today due to dry lightning strikes two days ago. it was a beautiful -----> location !!!  for photography, and will be missed.", "sortedWord": "None", "identifyer": 57344, "year": "2020"}, {"Unnamed: 0": 310435, "autor": "MobileAlfalfa", "date": 1597222550000, "content": "You choose my film /!/ I am traveling soon to an extremely sunny seaside location.\n\nIt would be ideal to have some creative constrains to train my eye.  Because of this I’m just packing analog and limited gear.  In particular a Pentax Spotmatic with two super-takumar lenses, 35mm 3’5 and 135 3’5.\n\nI have time for a last trip to the store to get some film, any suggestions for such a location?  For sure I want to take at least a roll of Ilford Panf plus 50 I had at home.\n\nPS:  never shot color film as I couldn’t develop it at home so far, is it maybe the right opportunity?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i8abxh/you_choose_my_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "you choose my film /!/ i am traveling soon to an extremely sunny seaside -----> location !!! .\n\nit would be ideal to have some creative constrains to train my eye.  because of this i’m just packing analog and limited gear.  in particular a pentax spotmatic with two super-takumar lenses, 35mm 3’5 and 135 3’5.\n\ni have time for a last trip to the store to get some film, any suggestions for such a location?  for sure i want to take at least a roll of ilford panf plus 50 i had at home.\n\nps:  never shot color film as i couldn’t develop it at home so far, is it maybe the right opportunity?", "sortedWord": "None", "identifyer": 57448, "year": "2020"}, {"Unnamed: 0": 313029, "autor": "menofgrosserblood", "date": 1592618633000, "content": "What gear would you bring to your first child’s birth? /!/ Location: Hospital\n\nGear available:  \n- Hasselblad 500CM\n- 80/2.8\n- 50/4\n- 150/4\n\n- Leica M6\n- Skopar 35/2.5\n- Fuji XT3 digital\n- 35/1.4\n- 18-55 kit\n- Godox trigger\n- Godox speedlight\n- Lightsphere\n\nConsidering the digital, with both lenses to shoot color, speed light and Leica with Ilford Delta 400. \n\nWould love your thoughts. Should I get a Polaroid and some color film?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hcdr6r/what_gear_would_you_bring_to_your_first_childs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "what gear would you bring to your first child’s birth? /!/ -----> location !!! : hospital\n\ngear available:  \n- hasselblad 500cm\n- 80/2.8\n- 50/4\n- 150/4\n\n- leica m6\n- skopar 35/2.5\n- fuji xt3 digital\n- 35/1.4\n- 18-55 kit\n- godox trigger\n- godox speedlight\n- lightsphere\n\nconsidering the digital, with both lenses to shoot color, speed light and leica with ilford delta 400. \n\nwould love your thoughts. should i get a polaroid and some color film?", "sortedWord": "None", "identifyer": 60093, "year": "2020"}, {"Unnamed: 0": 314354, "autor": "oddmind397", "date": 1607706274000, "content": "My first analog camera. Canon A-1 (1978-1985) I completely effed up the first roll and i hope the second that i shot in the location you can see on the picture turns out better.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kb6oft/my_first_analog_camera_canon_a1_19781985_i/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "my first analog camera. canon a-1 (1978-1985) i completely effed up the first roll and i hope the second that i shot in the -----> location !!!  you can see on the picture turns out better.", "sortedWord": "None", "identifyer": 61437, "year": "2020"}, {"Unnamed: 0": 314480, "autor": "Saalingua", "date": 1579407645000, "content": "In BC for the week /!/ Need help identifying the best places to buy 35mm/super 8 film, also developing labs\nSpecifically in Nanaimo and Vancouver. \nMaybe even locations to shoot?\nMany thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eqrp6q/in_bc_for_the_week/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "in bc for the week /!/ need help identifying the best places to buy 35mm/super 8 film, also developing labs\nspecifically in nanaimo and vancouver. \nmaybe even -----> locations !!!  to shoot?\nmany thanks!", "sortedWord": "None", "identifyer": 61565, "year": "2020"}, {"Unnamed: 0": 314959, "autor": "guitarf1", "date": 1579771064000, "content": "Dust under scanner glass. Okay to just ignore? - Espon V600 /!/ I noticed a few tiny dust specks that are scanned into each photo print at the same locations. Should I just work around it by using a different corner of the scanner and fix all of the scans in post? Maybe with some kind of PS script or manually? Or would it be worth the effort to try remove the dust?  \n\n\nI feel like this is common and unavoidable. Dust will eventually creep in/under the scanner. And if it isn't too big of a deal to not bother? I'm thinking that doing so might even make things worse if I introduce more dust during the attempt to remove the current dust.  \n\n\nFor getting dust off of the top glass, does using a soft brush just push more dust into the scanner?  Is it better to use a anti-static towel instead of a brush?  \n\n\nWhat are your thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/esqna3/dust_under_scanner_glass_okay_to_just_ignore/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "dust under scanner glass. okay to just ignore? - espon v600 /!/ i noticed a few tiny dust specks that are scanned into each photo print at the same -----> locations !!! . should i just work around it by using a different corner of the scanner and fix all of the scans in post? maybe with some kind of ps script or manually? or would it be worth the effort to try remove the dust?  \n\n\ni feel like this is common and unavoidable. dust will eventually creep in/under the scanner. and if it isn't too big of a deal to not bother? i'm thinking that doing so might even make things worse if i introduce more dust during the attempt to remove the current dust.  \n\n\nfor getting dust off of the top glass, does using a soft brush just push more dust into the scanner?  is it better to use a anti-static towel instead of a brush?  \n\n\nwhat are your thoughts?", "sortedWord": "None", "identifyer": 62051, "year": "2020"}, {"Unnamed: 0": 316693, "autor": "Ciisucece", "date": 1597326740000, "content": "How to get pastel colours with Kodak Portra 160/400? /!/ Some images for reference: [https://imgur.com/a/dH0drf3](https://imgur.com/a/dH0drf3)\n\nObviously, a lot of it's to do with the location, textures, outfits, natural colours etc but surely there's a lot of post-processing to get it to look this way.\n\nI'm interested in knowing what the main characteristics are to focus on when editing scans to make it look soft, pastel, warm and natural? \n\nMost images were shot with portra 160 and some 400.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i90a8t/how_to_get_pastel_colours_with_kodak_portra_160400/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "how to get pastel colours with kodak portra 160/400? /!/ some images for reference: [https://imgur.com/a/dh0drf3](https://imgur.com/a/dh0drf3)\n\nobviously, a lot of it's to do with the -----> location !!! , textures, outfits, natural colours etc but surely there's a lot of post-processing to get it to look this way.\n\ni'm interested in knowing what the main characteristics are to focus on when editing scans to make it look soft, pastel, warm and natural? \n\nmost images were shot with portra 160 and some 400.", "sortedWord": "None", "identifyer": 63813, "year": "2020"}], "name": "locationAnalogCommunity2020"}