{"interestingcomments": [{"Unnamed: 0": 252312, "autor": "FuriousPeanutButter", "date": 1632928958000, "content": "Night street shooting with Canon AE-1 program &amp; Canon Canolite D flash. /!/ So I'm planning on shooting some street photography tonight. I'm using Kodak color plus 200. My problem is that it's the first time I'm using this particular flash and can't seem to find a guide/map on the correct settings I should use. I mean I know I have to set the shutter speed to 1/60 but what about the aperture?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/pxxn84/night_street_shooting_with_canon_ae1_program/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "night street shooting with canon ae-1 program &amp; canon canolite d flash. /!/ so i'm planning on shooting some street photography tonight. i'm using kodak color plus 200. my problem is that it's the first time i'm using this particular flash and can't seem to find a guide/-----> map !!!  on the correct settings i should use. i mean i know i have to set the shutter speed to 1/60 but what about the aperture?", "sortedWord": "None", "identifyer": 47676, "year": "2021"}, {"Unnamed: 0": 254772, "autor": "Dangerous_Rope_6524", "date": 1635200728000, "content": "An Olympus OM-1 that my grandfather gave me years ago. The larger lense and large tripod I got with another OM-1 at a swap meet. Also has the notebook, pictures and maps of when he traveled around the US way back when.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/qfs28p/an_olympus_om1_that_my_grandfather_gave_me_years/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "an olympus om-1 that my grandfather gave me years ago. the larger lense and large tripod i got with another om-1 at a swap meet. also has the notebook, pictures and -----> maps !!!  of when he traveled around the us way back when.", "sortedWord": "None", "identifyer": 160, "year": "2021"}, {"Unnamed: 0": 261786, "autor": "jbladel", "date": 1628602864000, "content": "Looking for film on Curaçao? /!/ Hi all,  \n\n\nActually not looking for myself, but for an older gentlemen who I've gotten to know through our shared analog hobby. He is on the island for holidays, and he has been for a while, but he is running out of film.  \n\n\nHe doesn't have the online know-how to find shops selling film on the island, but after a few hours of searching google and google maps, I've come up empty as well. But I know having a strong online presence isn't a big deal for the businesses on the Island, so I'm looking for some locals (or frequent visitors).  \nWas curious if anyone in this community is familiar with the island, and knows where/if at all film is available.  \n\n\nNot really looking for advice on sourcing it from off the island, as I could easily pack a box up and overnight it to him, if I indeed do come up empty.  \n\n\nAnyway very curious to see if anyone has some ideas! Thanks a lot!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/p1pecw/looking_for_film_on_curaçao/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "looking for film on curaçao? /!/ hi all,  \n\n\nactually not looking for myself, but for an older gentlemen who i've gotten to know through our shared analog hobby. he is on the island for holidays, and he has been for a while, but he is running out of film.  \n\n\nhe doesn't have the online know-how to find shops selling film on the island, but after a few hours of searching -----> google !!!  and -----> google !!!  -----> maps !!! , i've come up empty as well. but i know having a strong online presence isn't a big deal for the businesses on the island, so i'm looking for some locals (or frequent visitors).  \nwas curious if anyone in this community is familiar with the island, and knows where/if at all film is available.  \n\n\nnot really looking for advice on sourcing it from off the island, as i could easily pack a box up and overnight it to him, if i indeed do come up empty.  \n\n\nanyway very curious to see if anyone has some ideas! thanks a lot!", "sortedWord": "None", "identifyer": 7303, "year": "2021"}, {"Unnamed: 0": 262879, "autor": "QuantumTarsus", "date": 1622593341000, "content": "Anyone have any knowledge about adjusting lens focus? /!/ So, I just picked up an Olympus OM-2 with 50mm prime lens, and also snagged a Zuiko 75-150mm lens of the same era. The 50mm prime works great, but I'm finding that the focus is off on the zoom lens. Specifically, I can't focus on anything further than about 65 ft (estimate, based on Google Maps). When I focus on things closer, the focus distance on the lens doesn't really correlate with the distance of the object I'm focusing on. I suspect it has been tinkered with and the focus has been buggered as a result.  \n\n\nWhat I can't find is any resources that explain how one might go about adjusting the focus, at least not for these lenses. The lens only cost me $32, so its not really worth sending off to be professionally serviced. \n\nAny suggestions?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/nq8r4o/anyone_have_any_knowledge_about_adjusting_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "anyone have any knowledge about adjusting lens focus? /!/ so, i just picked up an olympus om-2 with 50mm prime lens, and also snagged a zuiko 75-150mm lens of the same era. the 50mm prime works great, but i'm finding that the focus is off on the zoom lens. specifically, i can't focus on anything further than about 65 ft (estimate, based on -----> google !!!  -----> maps !!! ). when i focus on things closer, the focus distance on the lens doesn't really correlate with the distance of the object i'm focusing on. i suspect it has been tinkered with and the focus has been buggered as a result.  \n\n\nwhat i can't find is any resources that explain how one might go about adjusting the focus, at least not for these lenses. the lens only cost me $32, so its not really worth sending off to be professionally serviced. \n\nany suggestions?", "sortedWord": "None", "identifyer": 8429, "year": "2021"}, {"Unnamed: 0": 264215, "autor": "orrorin6", "date": 1625926479000, "content": "Digitally archiving Fuji Pro 400H /!/ Hi everyone,\n\nI recently read that Fujifilm is discontinuing Pro 400H. I know this will rub some people the wrong way, but I plan on creating detailed color maps and grain scans of Pro 400H so that at the very least we can create detailed film emulations in the future. I also know that Pro 400H isn't everyone's favorite film, but because it's being discontinued I figured I'd start with it. Maybe there's another discontinued film the community would prefer?\n\nTo do this I am planning on taking identical shots with Pro 400H and a matching digital shot of various color calibration charts, HALD charts, etc, digitally aligning them and measuring the color differential. I assume that this is how a lot of film emulation LUTs are made, but because nobody ever publishes their methodology or source material, I don't know if they're really doing that or just eyeballing the vibe.\n\nThe thing is, I need a film camera and lens that can also be attached to a mirrorless camera (I have a Fuji body but I might pick up a Sony for this project down the line).\n\n**Here's the question: does anyone have any recommendations for bodies and lens systems that work well across both platforms?**\n\nI was originally considering a Nikon body, but it seems really hard to find a body on eBay that's in known-working condition, and apparently many of them are sticky? Canon EF film cameras might be better.\n\nHere are some things to consider: I think for a project like this, exposure control is going to be very important. I need to be able to push and pull the film accurately, so something with good metering and exposure compensation would be really good. I have a light meter, and I'm prepared to do the calculations myself, but in the interest of time it'd be nice to have EV compensation.\n\nI am also looking for lens recommendations, since the color of the lens will also be tied up in the end result. I think perhaps a more modern lens would be good, since they're quite sharp and have a more \"clinical\" color reproduction. Another consideration is that my office isn't the biggest, so a 200mm lens will probably not work.\n\nBefore I go, some acknowledgements: First, I don't think it's possible to *FULLY* emulate a film stock's character digitally *at all*, but if we can get 80% of the way there with even remotely reproducible results, that's a win in my book. Second, I do intend on doing real-world identical shots as well, but for now I'm just focusing on the color and exposure maps.\n\nI would love anyone's thoughts.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ohjgma/digitally_archiving_fuji_pro_400h/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "digitally archiving fuji pro 400h /!/ hi everyone,\n\ni recently read that fujifilm is discontinuing pro 400h. i know this will rub some people the wrong way, but i plan on creating detailed color -----> maps !!!  and grain scans of pro 400h so that at the very least we can create detailed film emulations in the future. i also know that pro 400h isn't everyone's favorite film, but because it's being discontinued i figured i'd start with it. maybe there's another discontinued film the community would prefer?\n\nto do this i am planning on taking identical shots with pro 400h and a matching digital shot of various color calibration charts, hald charts, etc, digitally aligning them and measuring the color differential. i assume that this is how a lot of film emulation luts are made, but because nobody ever publishes their methodology or source material, i don't know if they're really doing that or just eyeballing the vibe.\n\nthe thing is, i need a film camera and lens that can also be attached to a mirrorless camera (i have a fuji body but i might pick up a sony for this project down the line).\n\n**here's the question: does anyone have any recommendations for bodies and lens systems that work well across both platforms?**\n\ni was originally considering a nikon body, but it seems really hard to find a body on ebay that's in known-working condition, and apparently many of them are sticky? canon ef film cameras might be better.\n\nhere are some things to consider: i think for a project like this, exposure control is going to be very important. i need to be able to push and pull the film accurately, so something with good metering and exposure compensation would be really good. i have a light meter, and i'm prepared to do the calculations myself, but in the interest of time it'd be nice to have ev compensation.\n\ni am also looking for lens recommendations, since the color of the lens will also be tied up in the end result. i think perhaps a more modern lens would be good, since they're quite sharp and have a more \"clinical\" color reproduction. another consideration is that my office isn't the biggest, so a 200mm lens will probably not work.\n\nbefore i go, some acknowledgements: first, i don't think it's possible to *fully* emulate a film stock's character digitally *at all*, but if we can get 80% of the way there with even remotely reproducible results, that's a win in my book. second, i do intend on doing real-world identical shots as well, but for now i'm just focusing on the color and exposure maps.\n\ni would love anyone's thoughts.", "sortedWord": "None", "identifyer": 9787, "year": "2021"}, {"Unnamed: 0": 265092, "autor": "Imnotreallythere", "date": 1625306035000, "content": "A project I picked up. Hopefully I can get it working. The drawing started off as a quick sketch to use as a screw map during disassembly hence the squatty proportions of the first one on the paper.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ocv38w/a_project_i_picked_up_hopefully_i_can_get_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "a project i picked up. hopefully i can get it working. the drawing started off as a quick sketch to use as a screw -----> map !!!  during disassembly hence the squatty proportions of the first one on the paper.", "sortedWord": "None", "identifyer": 10677, "year": "2021"}], "name": "mapAnalogCommunity2021"}