{"interestingcomments": [{"Unnamed: 0": 128900, "autor": "abetterwaifu", "date": 1519117647000, "content": "Landscape on 645? /!/ Hi all. I’ve been toying with getting a medium format camera for a couple years now. I owned a C330 for a few weeks a couple of years ago and didn’t like the 6x6 format so I lost interest. However I have a new job and am again looking at medium formats. \n\nMy main question is is there a camera that will shoot a 645 back in landscape? I don’t want to have my arm cocked weird for every shot and I don’t really want to change my shooting style to fit a portrait orientation.\n\nIdeally I’d like something like a Bronica or Mamiya 645 style system but I’m keen on hearing if anyone here knows of anything that sounds like a good fit?\n\nThanks guys!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7yuk3l/landscape_on_645/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "landscape on 645? /!/ hi all. i’ve been toying with getting a medium format camera for a couple years now. i owned a c330 for a few weeks a couple of years ago and didn’t like the 6x6 format so i lost interest. however i have a new job and am again looking at medium formats. \n\nmy main question is is there a camera that will shoot a 645 back in landscape? i don’t want to have my arm cocked weird for every shot and i don’t really want to change my shooting style to fit a portrait -----> orientation !!! .\n\nideally i’d like something like a bronica or mamiya 645 style system but i’m keen on hearing if anyone here knows of anything that sounds like a good fit?\n\nthanks guys!", "sortedWord": "None", "identifyer": 19597, "year": "2018"}, {"Unnamed: 0": 130772, "autor": "BeerHorse", "date": 1524984898000, "content": "Olympus mju II/Stylus Epic - why all the love? /!/ I recently acquired one of these as a hand-me-down - a mju II Zoom 80, to be precise. Now I'm aware this isn't quite the hipster model of choice, but I'm still kind of mystified that this range gets so much love online.  \n  \nI hadn't done much with it until recently I wanted to shoot at an evening event, and found that I didn't have any fast film in the fridge, so I thought hey, that thing has a flash, let's give it a try. Turned out to be a frustrating experience, for a few reasons.  \n  \n* The viewfinder. Jesus is that thing small. I spent half the time moving the camera around over my face trying to find it. And when I did, it was so dark as to be basically useless in framing a shot.  \n* The handling. I've missed shots whilst fumbling around trying to locate the shutter release, which is super hard to locate by touch, especially in portrait orientation. I've set the damn thing off by mistake trying to use the zoom control. Plus it just feels cheap and shitty to use.  \n* The slowness. Open that clunky plastic lens cover. Wait what seems like an age for the lens to extend. Want to zoom from one end of the lens's range to the other? That'll be about 3 seconds.  \n  \nSo what is it with these things? Even if the shots look amazing, I can't see myself recommending the experience. What do people like about them so much?\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8fpt22/olympus_mju_iistylus_epic_why_all_the_love/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "olympus mju ii/stylus epic - why all the love? /!/ i recently acquired one of these as a hand-me-down - a mju ii zoom 80, to be precise. now i'm aware this isn't quite the hipster model of choice, but i'm still kind of mystified that this range gets so much love online.  \n  \ni hadn't done much with it until recently i wanted to shoot at an evening event, and found that i didn't have any fast film in the fridge, so i thought hey, that thing has a flash, let's give it a try. turned out to be a frustrating experience, for a few reasons.  \n  \n* the viewfinder. jesus is that thing small. i spent half the time moving the camera around over my face trying to find it. and when i did, it was so dark as to be basically useless in framing a shot.  \n* the handling. i've missed shots whilst fumbling around trying to locate the shutter release, which is super hard to locate by touch, especially in portrait -----> orientation !!! . i've set the damn thing off by mistake trying to use the zoom control. plus it just feels cheap and shitty to use.  \n* the slowness. open that clunky plastic lens cover. wait what seems like an age for the lens to extend. want to zoom from one end of the lens's range to the other? that'll be about 3 seconds.  \n  \nso what is it with these things? even if the shots look amazing, i can't see myself recommending the experience. what do people like about them so much?\n\n", "sortedWord": "None", "identifyer": 21486, "year": "2018"}], "name": "orientationAnalogCommunity2018"}