{"interestingcomments": [{"Unnamed: 0": 90795, "autor": "seanypark69", "date": 1557980342000, "content": "Lightroom Export Setting -&gt; Whitagram - &gt; Instagram /!/ I just started shooting film and want to start uploading my images to instagram.  I just to make sure I was doing the correct research.  Here are my export settings, let me know if I should change any thing:\n\nImage Format: JPEG\n\n\\&amp;nbsp;\n\nColor Space: sRGB\n\n\\&amp;nbsp;\n\nSharpening: Screen - Standard (should this be High?)\n\n\\&amp;nbsp;\n\nResolution: 72dpi\n\n\\&amp;nbsp;\n\nQuality: 100 (also have been reading about 76%)\n\n\\&amp;nbsp;\n\nFit to Size: Long Edge 1080px (can I use this setting for both portrait and landscape photos or do I need to change the setting depending on the orientation of the photo?)\n\n\\&amp;nbsp;\n\nI will then be using Whitagram to add white borders to the image.  I assume this shouldn't change what export settings I should use?\n\n&amp;#x200B;\n\nThank you in advance for all the advice!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bp8659/lightroom_export_setting_whitagram_instagram/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "lightroom export setting -&gt; whitagram - &gt; instagram /!/ i just started shooting film and want to start uploading my images to instagram.  i just to make sure i was doing the correct research.  here are my export settings, let me know if i should change any thing:\n\nimage format: jpeg\n\n\\&amp;nbsp;\n\ncolor space: srgb\n\n\\&amp;nbsp;\n\nsharpening: screen - standard (should this be high?)\n\n\\&amp;nbsp;\n\nresolution: 72dpi\n\n\\&amp;nbsp;\n\nquality: 100 (also have been reading about 76%)\n\n\\&amp;nbsp;\n\nfit to size: long edge 1080px (can i use this setting for both portrait and landscape photos or do i need to change the setting depending on the -----> orientation !!!  of the photo?)\n\n\\&amp;nbsp;\n\ni will then be using whitagram to add white borders to the image.  i assume this shouldn't change what export settings i should use?\n\n&amp;#x200b;\n\nthank you in advance for all the advice!", "sortedWord": "None", "identifyer": 93283, "year": "2019"}, {"Unnamed: 0": 92619, "autor": "samirfreiha", "date": 1574966877000, "content": "rotating 645 film backs /!/ i vaguely remember hearing of a 645 body that allowed you to turn the film back 90* to change to landscape orientation, does anyone know which body it is off the top of their head?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e32bfj/rotating_645_film_backs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "rotating 645 film backs /!/ i vaguely remember hearing of a 645 body that allowed you to turn the film back 90* to change to landscape -----> orientation !!! , does anyone know which body it is off the top of their head?", "sortedWord": "None", "identifyer": 95121, "year": "2019"}, {"Unnamed: 0": 93093, "autor": "cy384", "date": 1563324793000, "content": "Field Report: Fujifilm GA645i, the medium format P&amp;S /!/ [Pics first](https://www.flickr.com/photos/cy384/albums/72157709430709572)\n\nI recently took my GA645i out for the NHRA drag racing at Norwalk, Ohio, and wanted to share some thoughts.  I shot two rolls: Fuji Pro 160NS and Fuji Provia 100F, with dev and scan by Memphis Film Lab.\n\nThis camera is insanely easy to use, probably the easiest medium format camera ever made: autofocus, program/aperture-priority/manual exposure, motorized film advance/loading, shot info in the viewfinder with parallax correction, and two convenient shutter buttons.  It's large but very easy to grip in both orientations.\n\nQuirks\n------\n* Data printing on the film border, configurable with date or shot info.\n* Max shutter speed is 1/700, *but also* only 1/400 from f4-f9\n* Portrait orientation\n* Very electronic and inspires worry about some part wearing out (scroll wheel is notorious)\n\nBut why?\n--------\nLeave the mode wheel on program and this camera fades from your attention, leaving only the act of photography.  Isn't this the ideal any camera should strive for?  Indeed, every shot was in focus, every exposure was exactly as I wanted, and the lens is sharp (and everyone who said MF slides are beautiful was right).\n\nAfter a day with it, I'm left with an uneasy uncertainty.  Why do I have all these cameras?  Why do I shoot film?\n\nIf I want to mess around with a camera, something less automated would be better.  If I want high resolution/low grain, digital would be better.  If I want something portable, 35mm would be better.\n\nThis is a great camera for a niche that I'm not sure is relevant in 2019.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ce5rzp/field_report_fujifilm_ga645i_the_medium_format_ps/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientations", "selectorShort": "orientation", "MarkedSent": "field report: fujifilm ga645i, the medium format p&amp;s /!/ [pics first](https://www.flickr.com/photos/cy384/albums/72157709430709572)\n\ni recently took my ga645i out for the nhra drag racing at norwalk, ohio, and wanted to share some thoughts.  i shot two rolls: fuji pro 160ns and fuji provia 100f, with dev and scan by memphis film lab.\n\nthis camera is insanely easy to use, probably the easiest medium format camera ever made: autofocus, program/aperture-priority/manual exposure, motorized film advance/loading, shot info in the viewfinder with parallax correction, and two convenient shutter buttons.  it's large but very easy to grip in both -----> orientations !!! .\n\nquirks\n------\n* data printing on the film border, configurable with date or shot info.\n* max shutter speed is 1/700, *but also* only 1/400 from f4-f9\n* portrait orientation\n* very electronic and inspires worry about some part wearing out (scroll wheel is notorious)\n\nbut why?\n--------\nleave the mode wheel on program and this camera fades from your attention, leaving only the act of photography.  isn't this the ideal any camera should strive for?  indeed, every shot was in focus, every exposure was exactly as i wanted, and the lens is sharp (and everyone who said mf slides are beautiful was right).\n\nafter a day with it, i'm left with an uneasy uncertainty.  why do i have all these cameras?  why do i shoot film?\n\nif i want to mess around with a camera, something less automated would be better.  if i want high resolution/low grain, digital would be better.  if i want something portable, 35mm would be better.\n\nthis is a great camera for a niche that i'm not sure is relevant in 2019.", "sortedWord": "None", "identifyer": 95598, "year": "2019"}, {"Unnamed: 0": 93280, "autor": "n0bs", "date": 1576909040000, "content": "Odd Canon A-1 Metering Issue /!/ I recently received a Canon A-1 I ordered from KEH. Everything seems to be working, but I ran into an odd issue. Metering seems fine, but if I turn the camera to portrait orientation the metering way overexposes. Like from 1/60 2.8 to 2\" 1.8.\n\nAny ideas on what the issue could be?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/edmddc/odd_canon_a1_metering_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "odd canon a-1 metering issue /!/ i recently received a canon a-1 i ordered from keh. everything seems to be working, but i ran into an odd issue. metering seems fine, but if i turn the camera to portrait -----> orientation !!!  the metering way overexposes. like from 1/60 2.8 to 2\" 1.8.\n\nany ideas on what the issue could be?", "sortedWord": "None", "identifyer": 95786, "year": "2019"}, {"Unnamed: 0": 93652, "autor": "bashterm", "date": 1566728112000, "content": "Met another film photographer at Freshman Orientation /!/ I met another film Photographer on Campus today. They were throwing a carnival-like event for the incoming freshman, and I decided to bring my trusty Pentax ZX-M in order to test out a roll of Ilford Delta 400. I've found through time I've acquired an ability to spot a classic film camera from quite a distance. As my friends were playing a carnival game I spotted one such camera on a guy watching a distance away.  \nI raised my Pentax, my face questioning. He raised his own camera in acknowledgement. I walked over.   \nHe had a Nikon F series SLR, loaded with ultramax. We briefly discussed film photography. I asked about darkroom facilities on campus, and we briefly discussed the challenges of DIY development while living in a dorm room.  \nAt the end of the conversation he asked to take my portrait, to which I said of course, and we parted ways.  \nI'm posting this here as an example of why I love this community of photographers. Everyone is kind and experienced, and there is plenty of info and help available via the significant braintrust of the community.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cv6ttz/met_another_film_photographer_at_freshman/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "met another film photographer at freshman -----> orientation !!!  /!/ i met another film photographer on campus today. they were throwing a carnival-like event for the incoming freshman, and i decided to bring my trusty pentax zx-m in order to test out a roll of ilford delta 400. i've found through time i've acquired an ability to spot a classic film camera from quite a distance. as my friends were playing a carnival game i spotted one such camera on a guy watching a distance away.  \ni raised my pentax, my face questioning. he raised his own camera in acknowledgement. i walked over.   \nhe had a nikon f series slr, loaded with ultramax. we briefly discussed film photography. i asked about darkroom facilities on campus, and we briefly discussed the challenges of diy development while living in a dorm room.  \nat the end of the conversation he asked to take my portrait, to which i said of course, and we parted ways.  \ni'm posting this here as an example of why i love this community of photographers. everyone is kind and experienced, and there is plenty of info and help available via the significant braintrust of the community.", "sortedWord": "None", "identifyer": 96163, "year": "2019"}, {"Unnamed: 0": 93928, "autor": "floup_96", "date": 1553069354000, "content": "Mamiya RB67 health check /!/ As I said in a previous post, I recently bought a Mamiya RB67 from Yahoo auction and got it delivered to a friend in Japan. It's a professional S body with a 127mm F3.8 lens, a waist-level viewfinder and a standard 6x7 back.\n\nOnce it arrives, I'll have 3 days to determine if the camera has any malfunction and return it if needed.\n\nI will thus have to guide my friend in Japan through some basic health checks. Could you give me your opinion on the following list, and ideas of other easy-to-check aspects of the camera?\n\nBody :\n- General esthetic state (scratches, broken parts, bumps, aspect of the bellow)\n- light leaks : extend the bellow in the dark, and pass a flashlight everywhere to see if it leaks)\n- focus mechanism\n- shutter cocking\n- light seals\n\nLens :\n- shutter cocking\n- rotating rings smoothness\n- diaphragm aperture responsiveness\n- mold , dust, coating\n\nBack :\n- winding mechanism\n- light seals\n\nViewfinder :\n- unfolding mechanism\n- magnifying glass unfolding mechanism\n- ground glass scratches\n\nAssembled camera :\n- rotating back mechanism\n- security mechanisms (dark slide vs shutter, winding vs shutter) \n- ground glass - back orientation coupling\n\nWhat do you think?\n\nFor my testroll I thought of shooting an easy film such as portra 400 with first a black frame (to detect light leaks), then focus tests (close focus, mid focus, infinity focus) and finally bracketing on some scenes to check if the shutter speed seems correct. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b39c6o/mamiya_rb67_health_check/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mamiya rb67 health check /!/ as i said in a previous post, i recently bought a mamiya rb67 from yahoo auction and got it delivered to a friend in japan. it's a professional s body with a 127mm f3.8 lens, a waist-level viewfinder and a standard 6x7 back.\n\nonce it arrives, i'll have 3 days to determine if the camera has any malfunction and return it if needed.\n\ni will thus have to guide my friend in japan through some basic health checks. could you give me your opinion on the following list, and ideas of other easy-to-check aspects of the camera?\n\nbody :\n- general esthetic state (scratches, broken parts, bumps, aspect of the bellow)\n- light leaks : extend the bellow in the dark, and pass a flashlight everywhere to see if it leaks)\n- focus mechanism\n- shutter cocking\n- light seals\n\nlens :\n- shutter cocking\n- rotating rings smoothness\n- diaphragm aperture responsiveness\n- mold , dust, coating\n\nback :\n- winding mechanism\n- light seals\n\nviewfinder :\n- unfolding mechanism\n- magnifying glass unfolding mechanism\n- ground glass scratches\n\nassembled camera :\n- rotating back mechanism\n- security mechanisms (dark slide vs shutter, winding vs shutter) \n- ground glass - back -----> orientation !!!  coupling\n\nwhat do you think?\n\nfor my testroll i thought of shooting an easy film such as portra 400 with first a black frame (to detect light leaks), then focus tests (close focus, mid focus, infinity focus) and finally bracketing on some scenes to check if the shutter speed seems correct. ", "sortedWord": "None", "identifyer": 96439, "year": "2019"}, {"Unnamed: 0": 94233, "autor": "TRIIIAD", "date": 1573067864000, "content": "Scanned photos blurry in landscape orientation (horizontally)? /!/ I scan my own negatives and with both my cameras (Zenit E and a random Minolta) all my photos that I took in landscape orientation look blurry. However, all vertical photos (even of the same subject with exactly the same focus and settings) look perfectly sharp, and just better overall. I was wondering if this could be somehow caused by my scanner and if so, is there any way to fix it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dsl3nu/scanned_photos_blurry_in_landscape_orientation/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "scanned photos blurry in landscape -----> orientation !!!  (horizontally)? /!/ i scan my own negatives and with both my cameras (zenit e and a random minolta) all my photos that i took in landscape orientation look blurry. however, all vertical photos (even of the same subject with exactly the same focus and settings) look perfectly sharp, and just better overall. i was wondering if this could be somehow caused by my scanner and if so, is there any way to fix it?", "sortedWord": "None", "identifyer": 96752, "year": "2019"}], "name": "orientationAnalogCommunity2019"}