{"interestingcomments": [{"Unnamed: 0": 128540, "autor": "StupidSexyPineapple", "date": 1520204207000, "content": "I just bought a agfa isola. It had a shutter issue I have fixed, but in the process I took off the focusring (and forgot to mark the right position), so how do I install it correctly?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/821c21/i_just_bought_a_agfa_isola_it_had_a_shutter_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i just bought a agfa isola. it had a shutter issue i have fixed, but in the process i took off the focusring (and forgot to mark the right -----> position !!! ), so how do i install it correctly?", "sortedWord": "None", "identifyer": 19234, "year": "2018"}, {"Unnamed: 0": 128643, "autor": "HonestlyGenuine", "date": 1529975437000, "content": "Question about Pentax ME mirror /!/ I recently bought a Pentax ME, my first film camera. There is no film in it and I can’t tell if the battery is dead. I read through the manual and then went on to mess around with it like a child. \nWhile I was trying out all of the components I flicked the self timer and let it go, looked through the viewfinder and it was black. Didn’t know what it was until I took the lens off and saw that the mirror was in the up position. I tried bringing it down with a cotton swab carefully but it gently came back up.\nAny ideas on how to correct this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8tvvzz/question_about_pentax_me_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question about pentax me mirror /!/ i recently bought a pentax me, my first film camera. there is no film in it and i can’t tell if the battery is dead. i read through the manual and then went on to mess around with it like a child. \nwhile i was trying out all of the components i flicked the self timer and let it go, looked through the viewfinder and it was black. didn’t know what it was until i took the lens off and saw that the mirror was in the up -----> position !!! . i tried bringing it down with a cotton swab carefully but it gently came back up.\nany ideas on how to correct this?", "sortedWord": "None", "identifyer": 19337, "year": "2018"}, {"Unnamed: 0": 128692, "autor": "z3matt", "date": 1529440508000, "content": "Pentax Spotmatic F with sticky shutter button /!/ Hello,\n\nI have a Pentax Spotmatic F with a shutter button that is just a little sticky.  It was like this when I purchased it from eBay.  Sometimes when shooting an image the shutter button will stay in the down position and then will not return to the up position which means you cannot advance the film.  You are able to hit the camera and the shutter button will return in the up position typically.  Obviously, hitting a piece of machinery (especially one this old) is a poor idea.\n\nHas anyone had this issue or have any tips on how to get it to not get caught?  I have another Pentax Spotmatic F which does not have this issue and I am not able to replicate the problem either.\n\nThank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8sc8q3/pentax_spotmatic_f_with_sticky_shutter_button/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pentax spotmatic f with sticky shutter button /!/ hello,\n\ni have a pentax spotmatic f with a shutter button that is just a little sticky.  it was like this when i purchased it from ebay.  sometimes when shooting an image the shutter button will stay in the down -----> position !!!  and then will not return to the up -----> position !!!  which means you cannot advance the film.  you are able to hit the camera and the shutter button will return in the up position typically.  obviously, hitting a piece of machinery (especially one this old) is a poor idea.\n\nhas anyone had this issue or have any tips on how to get it to not get caught?  i have another pentax spotmatic f which does not have this issue and i am not able to replicate the problem either.\n\nthank you!", "sortedWord": "None", "identifyer": 19389, "year": "2018"}, {"Unnamed: 0": 128956, "autor": "CaptCardboard", "date": 1518051094000, "content": "I weaseled my way into getting an interview as a lab tech in a camera shop. How do I ace it? /!/ In a desperate attempt to find work in Austin, I hit up a film camera shop asking if they needed a lab tech or any other help at the store. They didn't have a help wanted ad up or anything, but I actually got a response back and an interview scheduled for friday!\n\nMy darkroom skills are amateur and I've only developed C41 and B&amp;W films at home. I've only printed my own photos a couple times. I love working with antique cameras and definitely lust after several of them, but my knowledge might be inadequate for what they're looking for. Does anyone have any tips for getting in the door in this industry? I've been a semi professional photographer for years, but never worked for anyone else in the photo industry. I'd appreciate any insight!\n\nEDIT: Thanks for the responses folks! I'm mostly interested in things that I should say or aleady be aware of at the interview to ensure I get the job. I've never applied for a position like this before and it would be a dream to make it. I don't wanna screw it up!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7w0zsv/i_weaseled_my_way_into_getting_an_interview_as_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i weaseled my way into getting an interview as a lab tech in a camera shop. how do i ace it? /!/ in a desperate attempt to find work in austin, i hit up a film camera shop asking if they needed a lab tech or any other help at the store. they didn't have a help wanted ad up or anything, but i actually got a response back and an interview scheduled for friday!\n\nmy darkroom skills are amateur and i've only developed c41 and b&amp;w films at home. i've only printed my own photos a couple times. i love working with antique cameras and definitely lust after several of them, but my knowledge might be inadequate for what they're looking for. does anyone have any tips for getting in the door in this industry? i've been a semi professional photographer for years, but never worked for anyone else in the photo industry. i'd appreciate any insight!\n\nedit: thanks for the responses folks! i'm mostly interested in things that i should say or aleady be aware of at the interview to ensure i get the job. i've never applied for a -----> position !!!  like this before and it would be a dream to make it. i don't wanna screw it up!", "sortedWord": "None", "identifyer": 19653, "year": "2018"}, {"Unnamed: 0": 129366, "autor": "Tokyotrav", "date": 1536644533000, "content": "Help with Mamiya RZ 67 Shutter Release /!/ After replacing the battery and loading fresh film my mamiya still won't fire. I don't have the dark slide in and advance lever is cocked and the MLU is not on. I have no warning light blinking or glowing. And my shutter release is in the normal position. However it still wont fire. I have to switch to emergency mode to get it to fire.  I'm not sure what I'm doing wrong. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9euuvi/help_with_mamiya_rz_67_shutter_release/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help with mamiya rz 67 shutter release /!/ after replacing the battery and loading fresh film my mamiya still won't fire. i don't have the dark slide in and advance lever is cocked and the mlu is not on. i have no warning light blinking or glowing. and my shutter release is in the normal -----> position !!! . however it still wont fire. i have to switch to emergency mode to get it to fire.  i'm not sure what i'm doing wrong. ", "sortedWord": "None", "identifyer": 20069, "year": "2018"}, {"Unnamed: 0": 129406, "autor": "SlateWilson", "date": 1536351805000, "content": "Questions about repair, Minolta XE-7 /!/ I recently acquired a Minolta XE-7 for pretty cheap, knowing that it wasn't totally functional, but cosmetically it's in very nice condition. I also found a copy of the service manual, though it's a little daunting.\n\nThe problem seems to be with the shutter and mirror. When the film advance lever isn't charged the mirror is stuck in the up position, blocking the viewfinder. Advancing the lever lowers the mirror and raises the back layer of the shutter. Pressing the button releases that piece of the shutter, but the other layer doesn't move. The mirror releases also, but gets stuck back in the up position like before.\n\nI did replace the batteries, the indicator light is working for that, and the shutter speed is on the mechanical settings.\n\nAnybody have any experience with this kind of thing? I tried searching online but didn't have much luck. Is it something I can fix myself, and if not is it worth it to send it in for repairs?\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9dy5vw/questions_about_repair_minolta_xe7/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "questions about repair, minolta xe-7 /!/ i recently acquired a minolta xe-7 for pretty cheap, knowing that it wasn't totally functional, but cosmetically it's in very nice condition. i also found a copy of the service manual, though it's a little daunting.\n\nthe problem seems to be with the shutter and mirror. when the film advance lever isn't charged the mirror is stuck in the up -----> position !!! , blocking the viewfinder. advancing the lever lowers the mirror and raises the back layer of the shutter. pressing the button releases that piece of the shutter, but the other layer doesn't move. the mirror releases also, but gets stuck back in the up position like before.\n\ni did replace the batteries, the indicator light is working for that, and the shutter speed is on the mechanical settings.\n\nanybody have any experience with this kind of thing? i tried searching online but didn't have much luck. is it something i can fix myself, and if not is it worth it to send it in for repairs?\n", "sortedWord": "None", "identifyer": 20109, "year": "2018"}, {"Unnamed: 0": 129581, "autor": "CherchezLaVache", "date": 1539616706000, "content": "Is this a Epson v600 hardware issue? /!/ With my v600, I've scanned, without issues, several dozen rolls of black &amp; white medium format film negatives using the standard film holder and Epson software without modifications.\n\nThis past week as I've been scanning additional rolls of film, I've encountered an issue on all of my new scans. A thin dark line is appearing on all of my scans.  Always at the same position (not relative to the negative). At first I thought this was caused by my film negative being damaged but, I realized that by repositioning the film holder I can get the line to appear at different positions on the same exact negative. Though, still the same position relative to the scan area.\n\nThese two images are from the exact same negative, the only difference is the film holder was positioned differently for each scan. As you can see the line will show up in different areas of the photo.\n\nSample 1: [https://imgur.com/OjsmTrJ](https://imgur.com/OjsmTrJ)\nSample 2:[https://imgur.com/Uhuk3Ww](https://imgur.com/Uhuk3Ww)\n\nThinking it might be a software issue, I tried VueScan scanning software, the line still appears. \n\nAt this point I assume it’s something physically wrong with the scanner? Has anyone seen this? This is a 4month old certified refurb from Epson, so this rather annoying. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9odl5n/is_this_a_epson_v600_hardware_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is this a epson v600 hardware issue? /!/ with my v600, i've scanned, without issues, several dozen rolls of black &amp; white medium format film negatives using the standard film holder and epson software without modifications.\n\nthis past week as i've been scanning additional rolls of film, i've encountered an issue on all of my new scans. a thin dark line is appearing on all of my scans.  always at the same -----> position !!!  (not relative to the negative). at first i thought this was caused by my film negative being damaged but, i realized that by repositioning the film holder i can get the line to appear at different positions on the same exact negative. though, still the same position relative to the scan area.\n\nthese two images are from the exact same negative, the only difference is the film holder was positioned differently for each scan. as you can see the line will show up in different areas of the photo.\n\nsample 1: [https://imgur.com/ojsmtrj](https://imgur.com/ojsmtrj)\nsample 2:[https://imgur.com/uhuk3ww](https://imgur.com/uhuk3ww)\n\nthinking it might be a software issue, i tried vuescan scanning software, the line still appears. \n\nat this point i assume it’s something physically wrong with the scanner? has anyone seen this? this is a 4month old certified refurb from epson, so this rather annoying. ", "sortedWord": "None", "identifyer": 20287, "year": "2018"}, {"Unnamed: 0": 129582, "autor": "CherchezLaVache", "date": 1539615414000, "content": "Epsom v600 hardware issue? /!/ With my v600, I've scanned, without issues, several dozen rolls of black &amp; white medium format film negatives using the standard film holder and Epson software without modifications.\n\nThis past week as I've been scanning additional rolls of film, I've encountered an issue on all of my new scans. A thin dark line is appearing on all of my scans.  Always at the same position (not relative to the negative). At first I thought this was caused by my film negative being damaged but, I realized that by repositioning the film holder I can get the line to appear at different positions on the same exact negative. Though, still the same position relative to the scan area.\n\nThese two images are from the exact same negative, the only difference is the film holder was positioned differently for each scan. As you can see the line will show up in different areas of the photo.\n\nSample 1: [https://imgur.com/DUB7kb8 ](https://imgur.com/DUB7kb8)\nSample 2:[https://imgur.com/Jlp5Xri](https://imgur.com/Jlp5Xri)\n\nThinking it might be a software issue, I tried VueScan scanning software, the line still appears. \n\nAt this point I assume it’s something physically wrong with the scanner? Has anyone seen this? This is a 4month old certified refurb from Epson, so this rather annoying. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9odebp/epsom_v600_hardware_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "epsom v600 hardware issue? /!/ with my v600, i've scanned, without issues, several dozen rolls of black &amp; white medium format film negatives using the standard film holder and epson software without modifications.\n\nthis past week as i've been scanning additional rolls of film, i've encountered an issue on all of my new scans. a thin dark line is appearing on all of my scans.  always at the same -----> position !!!  (not relative to the negative). at first i thought this was caused by my film negative being damaged but, i realized that by repositioning the film holder i can get the line to appear at different positions on the same exact negative. though, still the same position relative to the scan area.\n\nthese two images are from the exact same negative, the only difference is the film holder was positioned differently for each scan. as you can see the line will show up in different areas of the photo.\n\nsample 1: [https://imgur.com/dub7kb8 ](https://imgur.com/dub7kb8)\nsample 2:[https://imgur.com/jlp5xri](https://imgur.com/jlp5xri)\n\nthinking it might be a software issue, i tried vuescan scanning software, the line still appears. \n\nat this point i assume it’s something physically wrong with the scanner? has anyone seen this? this is a 4month old certified refurb from epson, so this rather annoying. ", "sortedWord": "None", "identifyer": 20288, "year": "2018"}, {"Unnamed: 0": 129677, "autor": "Eclaireauchocolat", "date": 1531262266000, "content": "Sharpening Epson V700 scans in LR /!/ For a while now I have used Sebastian Schlüters settings to sharpen my mediumformat scans. He adjusted his film holders and then used a target to find out the best settings. I believe Schlüters settings are 65/0.7/85 (Amount/Radius/Details).\nI am using an Epson V700 at 2400dpi. I did adjust my film holders, so that the film is in the optimal position for focusing. I scan my film with Epsonscan, no filters, unsharpen etc.\nLater I sharpen in LR. \n\nNow I have read something on Adobe.com and I understand that \"Details\" creates artifacts to increase sharpening. However maybe I do not need this, because film has grain that when sharpened by the \"Amount\" slider gives me a very sharp and in most cases noise-free image.\n\nMy settings (Amount/Radius/Details) for mediumformat scans at the moment are:\nPortrait 80/2,3/0\nLandscape/detailled shot 150/3,0/0\n\nWhat are your settings?\nAnd why?\nWhat do you use for printing?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8xu1m3/sharpening_epson_v700_scans_in_lr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sharpening epson v700 scans in lr /!/ for a while now i have used sebastian schlüters settings to sharpen my mediumformat scans. he adjusted his film holders and then used a target to find out the best settings. i believe schlüters settings are 65/0.7/85 (amount/radius/details).\ni am using an epson v700 at 2400dpi. i did adjust my film holders, so that the film is in the optimal -----> position !!!  for focusing. i scan my film with epsonscan, no filters, unsharpen etc.\nlater i sharpen in lr. \n\nnow i have read something on adobe.com and i understand that \"details\" creates artifacts to increase sharpening. however maybe i do not need this, because film has grain that when sharpened by the \"amount\" slider gives me a very sharp and in most cases noise-free image.\n\nmy settings (amount/radius/details) for mediumformat scans at the moment are:\nportrait 80/2,3/0\nlandscape/detailled shot 150/3,0/0\n\nwhat are your settings?\nand why?\nwhat do you use for printing?", "sortedWord": "None", "identifyer": 20385, "year": "2018"}, {"Unnamed: 0": 129726, "autor": "caelanbenn", "date": 1530736874000, "content": "Faint Blueish bar along scans (epson V600/Ektar 100/Mamiya 645) /!/ Photo: \nhttps://imgur.com/a/cEG7GJJ\n\nHas anyone else encountered this? the whole roll has it in the same position running down the entire length of the scanned image. Nothing on the actual film itself though. \n\nThis is at 100% crop, so I only noticed it when cleaning dust etc. \n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8w4u72/faint_blueish_bar_along_scans_epson_v600ektar/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "faint blueish bar along scans (epson v600/ektar 100/mamiya 645) /!/ photo: \nhttps://imgur.com/a/ceg7gjj\n\nhas anyone else encountered this? the whole roll has it in the same -----> position !!!  running down the entire length of the scanned image. nothing on the actual film itself though. \n\nthis is at 100% crop, so i only noticed it when cleaning dust etc. \n\nthanks!", "sortedWord": "None", "identifyer": 20434, "year": "2018"}, {"Unnamed: 0": 129997, "autor": "jachz", "date": 1527623760000, "content": "SX70 Repair /!/ Does anybody here know where i can get my Polaroid SX70 sent for repair? Preferably Europe....because i live here and it's close. The problem with the camera is that the mirror is locked up in the position so that i can't see anything through the viewfinder. I don't know if there are more issues.\n\nBest regards", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8n24wc/sx70_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sx70 repair /!/ does anybody here know where i can get my polaroid sx70 sent for repair? preferably europe....because i live here and it's close. the problem with the camera is that the mirror is locked up in the -----> position !!!  so that i can't see anything through the viewfinder. i don't know if there are more issues.\n\nbest regards", "sortedWord": "None", "identifyer": 20705, "year": "2018"}, {"Unnamed: 0": 130015, "autor": "masterchubba", "date": 1527385154000, "content": "White scratches on Nikon Coolscan V scans? /!/ Hi guys i just purchased and started up a nikon coolscan i got on ebay that was sold as near mint condition. I just scanned my first 2 negatives and the results worry me a bit. Both negative scans seem to have a perfectly aligned white scratch going across horizontally in the exact same position. What should i do?  \n\nhttps://imgur.com/a/ZUOKzlR\nhttps://imgur.com/a/D7k4JtK\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8mepk0/white_scratches_on_nikon_coolscan_v_scans/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "white scratches on nikon coolscan v scans? /!/ hi guys i just purchased and started up a nikon coolscan i got on ebay that was sold as near mint condition. i just scanned my first 2 negatives and the results worry me a bit. both negative scans seem to have a perfectly aligned white scratch going across horizontally in the exact same -----> position !!! . what should i do?  \n\nhttps://imgur.com/a/zuokzlr\nhttps://imgur.com/a/d7k4jtk\n", "sortedWord": "None", "identifyer": 20723, "year": "2018"}, {"Unnamed: 0": 130089, "autor": "av1cenna", "date": 1525560805000, "content": "Nikon ES-2 review (Nikon's new DSLR scanning accessory) /!/ I picked up one of these at my local camera shop since I already had a Nikon 60mm macro lens.  \n\nhttps://i.redd.it/74amoisd54w01.jpg\n\nHere are the pros and cons in my view.\n\n**P R O S**\n\n**Image quality is good \\(but highly camera\\- and lens\\-dependent\\)**\n\n* For the D800 \\(not D800e\\) the images are pretty good.  I found an old negative and compared a ES\\-2 image to a 4000ppi drum scan I had done, and the ES\\-2/D800/60mm combo is definitely not as good \\(there is less detail\\), but it's not as big of a gap as I would have thought.  I want to compare more images before I make any big claims or post anything, but I'd guess a comparable drum scanner number is like 3000\\-3500ppi.  It's kind of apples and oranges though.  \n* With a D800e or D850, you're pushing better/more pixels through the lens and hopefully able to get more detail out.  I'm using the AF\\-S 60mm, but at least according to DXOMark, the older AF\\-D 60mm is slightly sharper stopped down \\(while the AF\\-S is sharper wide open\\) so that might improve things a bit too.  Still, this setup was enough to resolve the grain on Fuji Superia 800, although not enough to quite get the grain on Portra 400 \\(new\\).\n* Also, since this holds the negatives in the air, you don't have to worry about newton rings.\n\n**Holds negatives \\(mostly\\) flat**\n\n* For the least\\-fiddly process, I recommend NOT cutting your film, and running the whole strip through to negative adapter, six at a time.  This is shown in the picture above.  Just slide the negative holder out of the ES2, open it, and move it down the strip by six negatives.\n* Negatives at the end of a strip can be a little warpy in the negative holder, depending on how much of an edge there is for the holder to grab on to, and how curly your film is.  The film I scanned in the picture above has the normal roll curl but very little longitudinal curl.  Since the holder \\(ideally\\) holds negatives on four sides \\(especially if the film isn't cut\\), you get pretty flat film, which is important.  If your negative is a little short and is only being held on three sides, however, you'll have a tough time getting a good image, as the negative will \"cup\" inside the negative holder.\n\n**Easy to blow off dust before scanning**\n\n* Because the film strip is open, it's easy to give each negative a puff with the rocket blower before you take a picture.\n\n**Very fast relative to other scanning options**\n\n* I can get through a 36\\-exposure roll in about five minutes, versus several hours on other scanners.  Having a bright light \\(for fast autofocus\\) helps a lot.\n\n**Macro lens has many uses**\n\n* If you don't already have a macro lens it's a good excuse to get one\n\n**Doesn't take up a lot of space**\n\n* Unlike most other scanners \\-\\- assuming you don't count the DSLR and the lens, but even then.\n\n.\n\n.\n\n**C O N S**\n\n**Expensive: $130\\-150 for a few pieces of plastic?**\n\n* Build quality is fine but nothing to rave about.\n* There are other ways to DSLR scan without attaching the negative directly to the camera, most of which are probably cheaper, and even [cheaper ways](http://blog.photocase.com/2015/02/20/how-to-scan-film-negatives-and-slides-faster-without-a-scanner/) to build a similar device. \n* That said, I made several attempts at making my own tube setup like this with limited success \\- mainly, alignment is difficult and requires fairly precise tolerances.  I spent several hours and maybe $50 on sewer pipe, plexiglass, glue, etc. trying to make my own.  The images were decent and comparable to the ES\\-2, but scanning was slower and it was more difficult to blow dust off.  \n\n**Limited to only three Nikon lenses**\n\n* Requires a full frame body \\+ 60mm AF\\-S Micro or 60mm AF\\-D Micro, or a crop\\-frame body \\+ 40mm AF\\-S Micro\n* If you have a different brand of lens with the same 1:1 macro working distance \\(or \\~0.67:1 for crop frame cameras\\) as one of the three supported lenses, you could probably use this fine, assuming you have the right size filter thread or some step\\-up/down rings. You could also use spacer rings \\(not extension tubes\\) to achieve the right working distance.  Don't forget to account for your step\\-up/down rings in your working distance measurements.\n* The end of the ES\\-2 has a set screw for rotation, but it also lets you adjust the working distance by about a 15mm range.  This is helpful for getting good autofocus results and positioning the negative right at the 1:1 focus point.\n* The working distances that the ES\\-2 Kit supports are roughly \\~37\\-52mm \\(the 52mm filter threads built into the ES\\-2, designed to be used with the 40mm macro on crop frame\\) \\~47\\-62mm \\(62mm filter threads on the supplied step\\-up ring, designed for 60mm AF\\-S\\) or \\~71\\-86mm \\(also 62mm, a bigger step up ring, for the 60mm AF\\-D\\).  I measured from the film plane to the beginning of the filter threads, so keep in mind these working distance ranges are NOT exact but should be pretty close.\n\n**Requires a bright light for ease of use and good results**\n\n* I am using a [5000\\-lumen LED shop light](https://www.homedepot.com/p/PowerSmith-50-Watt-5000-Lumens-Portable-LED-Work-Light-PWL1150BS/300640804), which allows me to get about ISO 100, f/8, 1/250 when the front of the lens is about 100mm from the front of the light.  A less bright light, or using a flash instead, would make focusing on the negative more difficult, and may result in either introducing camera shake issues with slower shutter speeds, too\\-thin depth of field with larger apertures, or noise issues with high ISOs\\).\n\n**Like all DSLR scanning, color correction and dust spotting requires some manual work**\n\n* No film profiles, wet mount, or digital ICE to be had here, unfortunately.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8hb2p0/nikon_es2_review_nikons_new_dslr_scanning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "nikon es-2 review (nikon's new dslr scanning accessory) /!/ i picked up one of these at my local camera shop since i already had a nikon 60mm macro lens.  \n\nhttps://i.redd.it/74amoisd54w01.jpg\n\nhere are the pros and cons in my view.\n\n**p r o s**\n\n**image quality is good \\(but highly camera\\- and lens\\-dependent\\)**\n\n* for the d800 \\(not d800e\\) the images are pretty good.  i found an old negative and compared a es\\-2 image to a 4000ppi drum scan i had done, and the es\\-2/d800/60mm combo is definitely not as good \\(there is less detail\\), but it's not as big of a gap as i would have thought.  i want to compare more images before i make any big claims or post anything, but i'd guess a comparable drum scanner number is like 3000\\-3500ppi.  it's kind of apples and oranges though.  \n* with a d800e or d850, you're pushing better/more pixels through the lens and hopefully able to get more detail out.  i'm using the af\\-s 60mm, but at least according to dxomark, the older af\\-d 60mm is slightly sharper stopped down \\(while the af\\-s is sharper wide open\\) so that might improve things a bit too.  still, this setup was enough to resolve the grain on fuji superia 800, although not enough to quite get the grain on portra 400 \\(new\\).\n* also, since this holds the negatives in the air, you don't have to worry about newton rings.\n\n**holds negatives \\(mostly\\) flat**\n\n* for the least\\-fiddly process, i recommend not cutting your film, and running the whole strip through to negative adapter, six at a time.  this is shown in the picture above.  just slide the negative holder out of the es2, open it, and move it down the strip by six negatives.\n* negatives at the end of a strip can be a little warpy in the negative holder, depending on how much of an edge there is for the holder to grab on to, and how curly your film is.  the film i scanned in the picture above has the normal roll curl but very little longitudinal curl.  since the holder \\(ideally\\) holds negatives on four sides \\(especially if the film isn't cut\\), you get pretty flat film, which is important.  if your negative is a little short and is only being held on three sides, however, you'll have a tough time getting a good image, as the negative will \"cup\" inside the negative holder.\n\n**easy to blow off dust before scanning**\n\n* because the film strip is open, it's easy to give each negative a puff with the rocket blower before you take a picture.\n\n**very fast relative to other scanning options**\n\n* i can get through a 36\\-exposure roll in about five minutes, versus several hours on other scanners.  having a bright light \\(for fast autofocus\\) helps a lot.\n\n**macro lens has many uses**\n\n* if you don't already have a macro lens it's a good excuse to get one\n\n**doesn't take up a lot of space**\n\n* unlike most other scanners \\-\\- assuming you don't count the dslr and the lens, but even then.\n\n.\n\n.\n\n**c o n s**\n\n**expensive: $130\\-150 for a few pieces of plastic?**\n\n* build quality is fine but nothing to rave about.\n* there are other ways to dslr scan without attaching the negative directly to the camera, most of which are probably cheaper, and even [cheaper ways](http://blog.photocase.com/2015/02/20/how-to-scan-film-negatives-and-slides-faster-without-a-scanner/) to build a similar device. \n* that said, i made several attempts at making my own tube setup like this with limited success \\- mainly, alignment is difficult and requires fairly precise tolerances.  i spent several hours and maybe $50 on sewer pipe, plexiglass, glue, etc. trying to make my own.  the images were decent and comparable to the es\\-2, but scanning was slower and it was more difficult to blow dust off.  \n\n**limited to only three nikon lenses**\n\n* requires a full frame body \\+ 60mm af\\-s micro or 60mm af\\-d micro, or a crop\\-frame body \\+ 40mm af\\-s micro\n* if you have a different brand of lens with the same 1:1 macro working distance \\(or \\~0.67:1 for crop frame cameras\\) as one of the three supported lenses, you could probably use this fine, assuming you have the right size filter thread or some step\\-up/down rings. you could also use spacer rings \\(not extension tubes\\) to achieve the right working distance.  don't forget to account for your step\\-up/down rings in your working distance measurements.\n* the end of the es\\-2 has a set screw for rotation, but it also lets you adjust the working distance by about a 15mm range.  this is helpful for getting good autofocus results and -----> positioning !!!  the negative right at the 1:1 focus point.\n* the working distances that the es\\-2 kit supports are roughly \\~37\\-52mm \\(the 52mm filter threads built into the es\\-2, designed to be used with the 40mm macro on crop frame\\) \\~47\\-62mm \\(62mm filter threads on the supplied step\\-up ring, designed for 60mm af\\-s\\) or \\~71\\-86mm \\(also 62mm, a bigger step up ring, for the 60mm af\\-d\\).  i measured from the film plane to the beginning of the filter threads, so keep in mind these working distance ranges are not exact but should be pretty close.\n\n**requires a bright light for ease of use and good results**\n\n* i am using a [5000\\-lumen led shop light](https://www.homedepot.com/p/powersmith-50-watt-5000-lumens-portable-led-work-light-pwl1150bs/300640804), which allows me to get about iso 100, f/8, 1/250 when the front of the lens is about 100mm from the front of the light.  a less bright light, or using a flash instead, would make focusing on the negative more difficult, and may result in either introducing camera shake issues with slower shutter speeds, too\\-thin depth of field with larger apertures, or noise issues with high isos\\).\n\n**like all dslr scanning, color correction and dust spotting requires some manual work**\n\n* no film profiles, wet mount, or digital ice to be had here, unfortunately.", "sortedWord": "None", "identifyer": 20798, "year": "2018"}, {"Unnamed: 0": 130237, "autor": "veryangrypenguin", "date": 1535860909000, "content": "Nikon F mirror issue /!/ Hey All, \nI recently ordered a \"too good to be true\" Nikon F off eBay ( yes... flame me now ). Upon receiving it, I gave it a once over and regardless of the position of the mirror lock up switch, the mirror locks up after cocking the shutter and then doesn't return until the shutter is released. I'm pretty sure I'm not an idiot and this is not how things should be but I wanted to get a 2(2)nd opinion from someone knowledgeable in the ways ... ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9c9cj6/nikon_f_mirror_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f mirror issue /!/ hey all, \ni recently ordered a \"too good to be true\" nikon f off ebay ( yes... flame me now ). upon receiving it, i gave it a once over and regardless of the -----> position !!!  of the mirror lock up switch, the mirror locks up after cocking the shutter and then doesn't return until the shutter is released. i'm pretty sure i'm not an idiot and this is not how things should be but i wanted to get a 2(2)nd opinion from someone knowledgeable in the ways ... ", "sortedWord": "None", "identifyer": 20948, "year": "2018"}, {"Unnamed: 0": 130395, "autor": "DrCocaine", "date": 1538561956000, "content": "Investing in a Pakon or jump to medium format?? /!/ Im trying to make the decision where to pour my money into right now! I currently shoot entirely 35mm but the scans I get from my lab are awful and I dont have much choice where to go unfortunately. Now medium format has always had me interested but as a long term system will cost me more.\n\nThis is all coming down to pricing at the end of the day\n\nI can get a Pakon 135 Plus(basically new condition very lucky find) for 1350 EURO.\nMy film costs on average 5-10 euro a roll for 36 photos.\nDevelopment from my lab for just the negs is 3.50 euro\n\nNow if I was to invest into medium format id be looking at around:\n\n350-450 for RZ/RB system,\n\n300 for a flat bed scanner,\n\n10 euro a roll and same 3.50 for development.\n\nWhat would you do in the same position?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9kzvb7/investing_in_a_pakon_or_jump_to_medium_format/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "investing in a pakon or jump to medium format?? /!/ im trying to make the decision where to pour my money into right now! i currently shoot entirely 35mm but the scans i get from my lab are awful and i dont have much choice where to go unfortunately. now medium format has always had me interested but as a long term system will cost me more.\n\nthis is all coming down to pricing at the end of the day\n\ni can get a pakon 135 plus(basically new condition very lucky find) for 1350 euro.\nmy film costs on average 5-10 euro a roll for 36 photos.\ndevelopment from my lab for just the negs is 3.50 euro\n\nnow if i was to invest into medium format id be looking at around:\n\n350-450 for rz/rb system,\n\n300 for a flat bed scanner,\n\n10 euro a roll and same 3.50 for development.\n\nwhat would you do in the same -----> position !!! ?", "sortedWord": "None", "identifyer": 21107, "year": "2018"}, {"Unnamed: 0": 130396, "autor": "ARGLA55ON", "date": 1538554092000, "content": "Loose On/Off Switch on OM10 /!/ Hey there, \n\n  \nOver time the On/Off switch on my OM10 has gradually become looser and looser, now to the point of which if I put the camera in a bag the switch is easily able to slide onto the on or battery check position, leading to the batteries quickly running out.\n\n  \nHas anyone ever come across an issue similar to this and come across any fix? \n\n  \nThank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9kz7d2/loose_onoff_switch_on_om10/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "loose on/off switch on om10 /!/ hey there, \n\n  \nover time the on/off switch on my om10 has gradually become looser and looser, now to the point of which if i put the camera in a bag the switch is easily able to slide onto the on or battery check -----> position !!! , leading to the batteries quickly running out.\n\n  \nhas anyone ever come across an issue similar to this and come across any fix? \n\n  \nthank you", "sortedWord": "None", "identifyer": 21108, "year": "2018"}, {"Unnamed: 0": 130701, "autor": "augustinelille", "date": 1544724946000, "content": "Light meter may not be working on Canon AT-1 /!/ Hey!\n\nMy Canon AT-1’s light meter may not be working. When I press the button to measure light, the needle doesn’t move. I also have a problem with the aperture ring: at f/22, the needle is barely a quarter up from the lowest position (if that makes sense).\n\nPlease tell me it’s me not being able to configure the camera correctly. I just bought it and its body is in excellent condition 😭", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a5w1a6/light_meter_may_not_be_working_on_canon_at1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "light meter may not be working on canon at-1 /!/ hey!\n\nmy canon at-1’s light meter may not be working. when i press the button to measure light, the needle doesn’t move. i also have a problem with the aperture ring: at f/22, the needle is barely a quarter up from the lowest -----> position !!!  (if that makes sense).\n\nplease tell me it’s me not being able to configure the camera correctly. i just bought it and its body is in excellent condition 😭", "sortedWord": "None", "identifyer": 21414, "year": "2018"}, {"Unnamed: 0": 130756, "autor": "vrotographer", "date": 1531522737000, "content": "Two questions about restoring my Nikon FE2 /!/ I took all the light seals out of my FE2 but I didn't take a picture to remember what position they were all in. Can someone take a couple pictures of theirs?\n\nAnd does the leatherette for a Nikon FE fit on an FE2 exactly the same? I'm looking at Aki-Asahi but they don't have a listing for an FE2.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8yomql/two_questions_about_restoring_my_nikon_fe2/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "two questions about restoring my nikon fe2 /!/ i took all the light seals out of my fe2 but i didn't take a picture to remember what -----> position !!!  they were all in. can someone take a couple pictures of theirs?\n\nand does the leatherette for a nikon fe fit on an fe2 exactly the same? i'm looking at aki-asahi but they don't have a listing for an fe2.\n\nthanks!", "sortedWord": "None", "identifyer": 21470, "year": "2018"}, {"Unnamed: 0": 130858, "autor": "berlinichliebedich", "date": 1524213986000, "content": "Canon FD (not nFD!) Lens Stuck Breech Lock Ring and Weird Aperture /!/ So I was recently given an FD mount Hanimex 28mm lens. Upon inspection I saw that the breech ring won't move from its mounting position (in other words I can't turn the ring to lock the lens onto the camera). When I push down the part I marked in the pic it moves ever so slightly to the direction it's supposed to (like an 8th of the way) and won't move any further, and this also moves the aperture ring in that direction (the lock ring won't rotate if I hold the aperture ring in place). When I then rotate the ring back to its original position that part I marked clicks back up and the ring locks again. Also tje aperture acts as if it were an M42 lens on M mode (if you get what I mean). I unscrewed the back to see if someone tried to open it up and screwed something up but I saw nothing wrong so I reassembled it not to screw up something myself. What can possibly be wrong with this lens? I'm going on a trip this weekend and wanted to try it out :(", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8dm4iv/canon_fd_not_nfd_lens_stuck_breech_lock_ring_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon fd (not nfd!) lens stuck breech lock ring and weird aperture /!/ so i was recently given an fd mount hanimex 28mm lens. upon inspection i saw that the breech ring won't move from its mounting -----> position !!!  (in other words i can't turn the ring to lock the lens onto the camera). when i push down the part i marked in the pic it moves ever so slightly to the direction it's supposed to (like an 8th of the way) and won't move any further, and this also moves the aperture ring in that direction (the lock ring won't rotate if i hold the aperture ring in place). when i then rotate the ring back to its original position that part i marked clicks back up and the ring locks again. also tje aperture acts as if it were an m42 lens on m mode (if you get what i mean). i unscrewed the back to see if someone tried to open it up and screwed something up but i saw nothing wrong so i reassembled it not to screw up something myself. what can possibly be wrong with this lens? i'm going on a trip this weekend and wanted to try it out :(", "sortedWord": "None", "identifyer": 21572, "year": "2018"}], "name": "positionAnalogCommunity2018"}