{"interestingcomments": [{"Unnamed: 0": 304999, "autor": "petruTzz_", "date": 1583883517000, "content": "Issue with my Canon New F-1 /!/ Hello! I saw that my Canon New F-1 does something weird: sometimes the mirror stays up and the shutter curtains don't close properly, leaving a 1mm wide gap. To make the mirror and the shutter curtains get back in their right position, I need to slightly wind the lever. I saw that this only happens with the lens on, at any aperture (the smaller the aperture, the more infrequently it happens), only at 1/125th of a sec. The lens is a Canon FD 50mm f1.8. What should I do? Is it an easy and inexpensive repair? Should I do it myself? Is the lens the problem, or the camera body itself? Can you explain what's causing this? Thanks a lot in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fgniio/issue_with_my_canon_new_f1/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "issue with my canon new f-1 /!/ hello! i saw that my canon new f-1 does something weird: sometimes the mirror stays up and the shutter curtains don't close properly, leaving a 1mm wide gap. to make the mirror and the shutter curtains get back in their right -----> position !!! , i need to slightly wind the lever. i saw that this only happens with the lens on, at any aperture (the smaller the aperture, the more infrequently it happens), only at 1/125th of a sec. the lens is a canon fd 50mm f1.8. what should i do? is it an easy and inexpensive repair? should i do it myself? is the lens the problem, or the camera body itself? can you explain what's causing this? thanks a lot in advance!", "sortedWord": "None", "identifyer": 51922, "year": "2020"}, {"Unnamed: 0": 305044, "autor": "Ordinary-Avocado", "date": 1602899541000, "content": "Busted canonet from eBay. Is it worth saving? /!/ I picked up a canonet 19 (1961 model) from eBay that appeared fine in photos. The description said as is and untested but I thought what the heck? And bought it anyway. The camera arrived today and it's looking like it will be a project. \n\nThe film advance lever pulls back but has to be pushed foward to the original position. I'm guessing there is a spring missing or worn out.\n\nThe shutter button doesn't appear to do anything at all. I cock the shutter but it doesn't release. I can press the shutter button all the way down but nothing happens.\n\nI'm assuming the meter is dead but I didn't really have high hopes for that. I was planning to shoot sunny 16 primarily anyway.\n\nNo idea what's going on with shutter speed or aperture since I can't get it to fire. There are no discernible clicks when turning the aperture ring or the shutter ring.\n\nIs this thing worth tearing apart or should I just sell it for parts on ebay to recoup my losses?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jcmrr7/busted_canonet_from_ebay_is_it_worth_saving/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "busted canonet from ebay. is it worth saving? /!/ i picked up a canonet 19 (1961 model) from ebay that appeared fine in photos. the description said as is and untested but i thought what the heck? and bought it anyway. the camera arrived today and it's looking like it will be a project. \n\nthe film advance lever pulls back but has to be pushed foward to the original -----> position !!! . i'm guessing there is a spring missing or worn out.\n\nthe shutter button doesn't appear to do anything at all. i cock the shutter but it doesn't release. i can press the shutter button all the way down but nothing happens.\n\ni'm assuming the meter is dead but i didn't really have high hopes for that. i was planning to shoot sunny 16 primarily anyway.\n\nno idea what's going on with shutter speed or aperture since i can't get it to fire. there are no discernible clicks when turning the aperture ring or the shutter ring.\n\nis this thing worth tearing apart or should i just sell it for parts on ebay to recoup my losses?", "sortedWord": "None", "identifyer": 51967, "year": "2020"}, {"Unnamed: 0": 305064, "autor": "RubiconGuava", "date": 1602848652000, "content": "Mamiya 645 Plain prism finder disassembly advice /!/ Hey folks, ended up having a chat about film photography with an old fella in the pub the other day, and he decided to just up and give me his spare Mamiya 645J. Pretty great, but the prism finder has a bit of a wonky latch, where the left side hook doesn't spring back into position about 75% of the time. \n\nIt's probably just an old spring that's perished, and I've currently bodged over the wobble issue with a strip of black electrical tape, but ideally I'd like to get it back to actually locking in place. I popped the base plate off earlier to have a look but I have no idea where to go from there and can't find any guides online for disassembling the housing to confirm what's wrong and fix it. \n\n[Shitty phone picture showing the two latches, the top one is the one that's clearly stuck back.](https://i.imgur.com/bYQthM1.jpg)\n\nAny advice would really be appreciated, looking forward to getting this out and putting some film through it. Thanks.\n\n(Resubmitted as I'd put down the wrong finder type in the title like a chump)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jc8bcz/mamiya_645_plain_prism_finder_disassembly_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 645 plain prism finder disassembly advice /!/ hey folks, ended up having a chat about film photography with an old fella in the pub the other day, and he decided to just up and give me his spare mamiya 645j. pretty great, but the prism finder has a bit of a wonky latch, where the left side hook doesn't spring back into -----> position !!!  about 75% of the time. \n\nit's probably just an old spring that's perished, and i've currently bodged over the wobble issue with a strip of black electrical tape, but ideally i'd like to get it back to actually locking in place. i popped the base plate off earlier to have a look but i have no idea where to go from there and can't find any guides online for disassembling the housing to confirm what's wrong and fix it. \n\n[shitty phone picture showing the two latches, the top one is the one that's clearly stuck back.](https://i.imgur.com/byqthm1.jpg)\n\nany advice would really be appreciated, looking forward to getting this out and putting some film through it. thanks.\n\n(resubmitted as i'd put down the wrong finder type in the title like a chump)", "sortedWord": "None", "identifyer": 51987, "year": "2020"}, {"Unnamed: 0": 305065, "autor": "RubiconGuava", "date": 1602848538000, "content": "Mamiya 645 PD Prism finder teardown advice /!/ Hey folks, ended up having a chat about film photography with an old fella in the pub the other day, and he decided to just up and give me his spare Mamiya 645J. Pretty great, but the prism finder has a bit of a wonky latch, where the left side hook doesn't spring back into position about 75% of the time. \n\nIt's probably just an old spring that's perished, and I've currently bodged over the wobble issue with a strip of black electrical tape, but ideally I'd like to get it back to actually locking in place. I popped the base plate off earlier to have a look but I have no idea where to go from there and can't find any guides online for disassembling the housing to confirm what's wrong and fix it. \n\n[Shitty phone picture showing the two latches, the top one is the one that's clearly stuck back.](https://i.imgur.com/bYQthM1.jpg)\n\nAny advice would really be appreciated, looking forward to getting this out and putting some film through it. Thanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jc8aiu/mamiya_645_pd_prism_finder_teardown_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 645 pd prism finder teardown advice /!/ hey folks, ended up having a chat about film photography with an old fella in the pub the other day, and he decided to just up and give me his spare mamiya 645j. pretty great, but the prism finder has a bit of a wonky latch, where the left side hook doesn't spring back into -----> position !!!  about 75% of the time. \n\nit's probably just an old spring that's perished, and i've currently bodged over the wobble issue with a strip of black electrical tape, but ideally i'd like to get it back to actually locking in place. i popped the base plate off earlier to have a look but i have no idea where to go from there and can't find any guides online for disassembling the housing to confirm what's wrong and fix it. \n\n[shitty phone picture showing the two latches, the top one is the one that's clearly stuck back.](https://i.imgur.com/byqthm1.jpg)\n\nany advice would really be appreciated, looking forward to getting this out and putting some film through it. thanks.", "sortedWord": "None", "identifyer": 51988, "year": "2020"}, {"Unnamed: 0": 305162, "autor": "ibanez26", "date": 1606060872000, "content": "An early review of 2020 and what a shit year it has been for my photography (sort of a rant, just want to get this out there and clear my head, probably not worth your time). /!/ So pre-Covid/lockdown, I used to work up in London, which provided nearly endless opportunities to go out in my lunch hour  or after work to do street and/or architectural stuff, and I was fairly happy with the stuff I was putting out. \n\nAnd so COVID happens, and slowly I find myself in a position where I am more interested in buying gear rather than using it, and burning through film just because it was there, rather than putting the thought into the photos I was taking, like i did before lockdown. So since March I have bought and sold so many lenses and cameras. Over the summer, when the U.K. was not in lockdown, I sort of returned to the way I used to be pre-lockdown, but now that winter is here and the U.K. is back in lockdown, my creative drive has once again completely dried up. I don’t like looking at my photos anymore and I have  been tempted to sell everything and give up the hobby for good, more than once. \n\nI have decided in order to become a better photographer, I need to settle on what gear I need and to stop buying stuff, learn the cameras and lenses and then try and find my “style” again. I have spent far too much on this hobby since March. \n\nTo put an end to my GAS, I have settled on the following set up - A Nikon D3 (so I can experiment with my NIKKOR lensses), my F2AS (for my “proper photography”, using the more expensive film stocks) and finally my F, so when I am back in the office, I can just shove that in my bag, and use cheaper film stocks. Lenses are 20mm f3.5, SC 50mm f1.4, 135mm f2.8 and Q 200m f4. All lenses are either AI or have been AI’d \n\nSo the plan is to stop looking at ebay for good. Digital is not the enemy, I will use it to keep my costs down and edit the photos taken to look like film. My film cameras have/will be CLAD and will be good to go for the next decade. I have all the gear I could ever need and will stop buying stuff gear for good. \n\nI will now start to look at stuff that interests me to help define my style - classic street, industrial, night time and landscape. \n\nNext year will be a better one.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jyxy6w/an_early_review_of_2020_and_what_a_shit_year_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "an early review of 2020 and what a shit year it has been for my photography (sort of a rant, just want to get this out there and clear my head, probably not worth your time). /!/ so pre-covid/lockdown, i used to work up in london, which provided nearly endless opportunities to go out in my lunch hour  or after work to do street and/or architectural stuff, and i was fairly happy with the stuff i was putting out. \n\nand so covid happens, and slowly i find myself in a -----> position !!!  where i am more interested in buying gear rather than using it, and burning through film just because it was there, rather than putting the thought into the photos i was taking, like i did before lockdown. so since march i have bought and sold so many lenses and cameras. over the summer, when the u.k. was not in lockdown, i sort of returned to the way i used to be pre-lockdown, but now that winter is here and the u.k. is back in lockdown, my creative drive has once again completely dried up. i don’t like looking at my photos anymore and i have  been tempted to sell everything and give up the hobby for good, more than once. \n\ni have decided in order to become a better photographer, i need to settle on what gear i need and to stop buying stuff, learn the cameras and lenses and then try and find my “style” again. i have spent far too much on this hobby since march. \n\nto put an end to my gas, i have settled on the following set up - a nikon d3 (so i can experiment with my nikkor lensses), my f2as (for my “proper photography”, using the more expensive film stocks) and finally my f, so when i am back in the office, i can just shove that in my bag, and use cheaper film stocks. lenses are 20mm f3.5, sc 50mm f1.4, 135mm f2.8 and q 200m f4. all lenses are either ai or have been ai’d \n\nso the plan is to stop looking at ebay for good. digital is not the enemy, i will use it to keep my costs down and edit the photos taken to look like film. my film cameras have/will be clad and will be good to go for the next decade. i have all the gear i could ever need and will stop buying stuff gear for good. \n\ni will now start to look at stuff that interests me to help define my style - classic street, industrial, night time and landscape. \n\nnext year will be a better one.", "sortedWord": "None", "identifyer": 52086, "year": "2020"}, {"Unnamed: 0": 305294, "autor": "theplayeristic", "date": 1596501607000, "content": "Minolta Trouble /!/ Hey all, my Maxxum 7000’s batteries just died and the mirror just decided to lock up and is in the open position. Recharged the AAs and still isn’t working, not even turning on, and tried some fresh batteries as well. Now, before I take it apart and fuck something up, does anyone know what else I can do to fix it? Like give it a good smack like a TV remote? Thanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i39c47/minolta_trouble/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta trouble /!/ hey all, my maxxum 7000’s batteries just died and the mirror just decided to lock up and is in the open -----> position !!! . recharged the aas and still isn’t working, not even turning on, and tried some fresh batteries as well. now, before i take it apart and fuck something up, does anyone know what else i can do to fix it? like give it a good smack like a tv remote? thanks in advance!", "sortedWord": "None", "identifyer": 52219, "year": "2020"}, {"Unnamed: 0": 305348, "autor": "utdorm", "date": 1593493568000, "content": "MAMIYA RB67 | Investigating lightleak /!/ Previously, I posted about mysterious lightleaks. Everyone suggested that I should apply a new light seal. It arrived today and I installed it without any problem. \nNow that the lightseal installation is done, I want to dig a little deep. When I disassembled the darkslide cover, I found this weird positioned \"sping??\" that lock the darkslide. So, I thought that it might be the main problem that cause the light leak. Has anyone disassembled the darkslide before? If so, does the darkslide lock always in that position?\n[Darkslide lock](https://imgur.com/a/GuCXxmj)\n\nNote : I haven't test it with the new lightseal yet.\nNote 2: English isn't my first language, sorry about that. I tried to explain as clear as possible.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/higrtx/mamiya_rb67_investigating_lightleak/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "mamiya rb67 | investigating lightleak /!/ previously, i posted about mysterious lightleaks. everyone suggested that i should apply a new light seal. it arrived today and i installed it without any problem. \nnow that the lightseal installation is done, i want to dig a little deep. when i disassembled the darkslide cover, i found this weird -----> positioned !!!  \"sping??\" that lock the darkslide. so, i thought that it might be the main problem that cause the light leak. has anyone disassembled the darkslide before? if so, does the darkslide lock always in that position?\n[darkslide lock](https://imgur.com/a/gucxxmj)\n\nnote : i haven't test it with the new lightseal yet.\nnote 2: english isn't my first language, sorry about that. i tried to explain as clear as possible.", "sortedWord": "None", "identifyer": 52276, "year": "2020"}, {"Unnamed: 0": 305361, "autor": "Syltography", "date": 1593465208000, "content": "Is it possible to confirm if a roll of film is used? /!/ I shot a roll  (I thought) but it didn't feel right when I rolled it up. I screwed up getting the film in (first time loading). I thought I was ok but in hindsight I wonder if it ever actually caught properly. The film looked in the identical position after I shot the roll.\nI don't mind sacrificing the first few shots to test. I'd rather avoid shipping and all the likes if I can though. \nAny thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hi8yc8/is_it_possible_to_confirm_if_a_roll_of_film_is/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is it possible to confirm if a roll of film is used? /!/ i shot a roll  (i thought) but it didn't feel right when i rolled it up. i screwed up getting the film in (first time loading). i thought i was ok but in hindsight i wonder if it ever actually caught properly. the film looked in the identical -----> position !!!  after i shot the roll.\ni don't mind sacrificing the first few shots to test. i'd rather avoid shipping and all the likes if i can though. \nany thoughts?", "sortedWord": "None", "identifyer": 52289, "year": "2020"}, {"Unnamed: 0": 305444, "autor": "isnes2000", "date": 1582254369000, "content": "Somehow figured out a way to brick my new to me f2 /!/ Ok, so here it goes. I pressed a little bit on the self timer, barely enough for the timer button to be revealed, shot the camera with the normal shutter button, then pulled the self timer to a position it should actually be in before firing. The self timer did go off, but it didn't trigger the shutter and now the shutter button is still pressed down as if the shutter still needs to be cocked(it already is)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f74spj/somehow_figured_out_a_way_to_brick_my_new_to_me_f2/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "somehow figured out a way to brick my new to me f2 /!/ ok, so here it goes. i pressed a little bit on the self timer, barely enough for the timer button to be revealed, shot the camera with the normal shutter button, then pulled the self timer to a -----> position !!!  it should actually be in before firing. the self timer did go off, but it didn't trigger the shutter and now the shutter button is still pressed down as if the shutter still needs to be cocked(it already is)", "sortedWord": "None", "identifyer": 52372, "year": "2020"}, {"Unnamed: 0": 306304, "autor": "RandyFunRuiner", "date": 1590364407000, "content": "RMC Tokina 28mm f2.8 Stuck Aperture Blades /!/ I bought an wide angle RMC Tokina (28mm f2.8 FD) lens for my Canon AE1-P a few months ago. When I first got it, I had to clean it a bit. The mount was a bit sticky. I got the mount clean and put it onto the camera and I've since pushed a couple rolls of film through it (waiting on them to be developed right now). But I switched back to my normal 50mm lens because I noticed that the aperture blades seemed to be stuck wide open in the RMC lens. At first, I thought that for some reason you just couldn't see the aperture blades on wide angle lenses. But that just seems flat wrong. I've been trying to read about what could possibly be wrong and what options there are to fix it. So far it could be that the inside of the lens is gunked up with old oil or grease and the blades are stuck. Or it could be that the locking mechanism is stuck in the wrong position since it is a breech-lock mounting mechanism? There also seems to be something rattling inside the lens when shaken, and I have no clue what it could be. Does anyone have any experience with the RMC lenses? Is it worth paying to be serviced or trying to repair on my own?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gq091n/rmc_tokina_28mm_f28_stuck_aperture_blades/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "rmc tokina 28mm f2.8 stuck aperture blades /!/ i bought an wide angle rmc tokina (28mm f2.8 fd) lens for my canon ae1-p a few months ago. when i first got it, i had to clean it a bit. the mount was a bit sticky. i got the mount clean and put it onto the camera and i've since pushed a couple rolls of film through it (waiting on them to be developed right now). but i switched back to my normal 50mm lens because i noticed that the aperture blades seemed to be stuck wide open in the rmc lens. at first, i thought that for some reason you just couldn't see the aperture blades on wide angle lenses. but that just seems flat wrong. i've been trying to read about what could possibly be wrong and what options there are to fix it. so far it could be that the inside of the lens is gunked up with old oil or grease and the blades are stuck. or it could be that the locking mechanism is stuck in the wrong -----> position !!!  since it is a breech-lock mounting mechanism? there also seems to be something rattling inside the lens when shaken, and i have no clue what it could be. does anyone have any experience with the rmc lenses? is it worth paying to be serviced or trying to repair on my own?", "sortedWord": "None", "identifyer": 53250, "year": "2020"}, {"Unnamed: 0": 307021, "autor": "cofonseca", "date": 1593276252000, "content": "X-700 - Curtain Won't Move w/ Advance Lever /!/ Hi all. I picked up a dirt cheap Minolta X-700 \"for parts\" because I want to learn more about camera repair and how to fix some common issues. **I want to learn how to fix this myself**, so please don't recommend bringing it to a shop for repairs - I would have done that already if I wanted to.\n\n**Some background:** The camera has fresh batteries in it and it beeps when setting it to the audible \"on\" mode in a dark environment, so I know it's getting power. I was able to fire off one shot, but after doing so, the mirror was stuck in the up position. Upon looking at the shutter curtain, it looked like it hadn't fully advanced, and I could see a bit of metal at the left side. I gently pushed it over just a touch, and the mirror came back down on its own. I cranked the film advance lever and all seemed well.\n\n**Here's my issue:** I can no longer fire another shot. I noticed that when I crank the film advance lever, the spool/sproket spins so it does actually advance the film, but the curtain only advances a centimeter or two. Once the lever gets to the end of its action and I return the lever to its original position, the curtain also returns to its previous position, and doesn't complete a cycle. It then gets stuck in its slightly-off position, and I have to gently push it back into place. Upon doing so, I hear a click.\n\nIt seems like whatever connection there is between the advance lever and the curtain is broken, and the curtain will not complete a full cycle, so I can't \"cock\" the camera for its next shot. Can anyone tell me about how this should work, and if there are any simple fixes for it? Any resources out there that you'd recommend to get me started? I'm pretty DIY savvy and have plenty of tools so I'm happy to attempt fixing it, I just need to know where to start.\n\nHere's a video that better demonstrates what I'm talking about: [Video Link](https://photos.app.goo.gl/cjJywtmNhNWJ9fer5)\n\nThanks in advance for any input you may have!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hgwts3/x700_curtain_wont_move_w_advance_lever/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "x-700 - curtain won't move w/ advance lever /!/ hi all. i picked up a dirt cheap minolta x-700 \"for parts\" because i want to learn more about camera repair and how to fix some common issues. **i want to learn how to fix this myself**, so please don't recommend bringing it to a shop for repairs - i would have done that already if i wanted to.\n\n**some background:** the camera has fresh batteries in it and it beeps when setting it to the audible \"on\" mode in a dark environment, so i know it's getting power. i was able to fire off one shot, but after doing so, the mirror was stuck in the up -----> position !!! . upon looking at the shutter curtain, it looked like it hadn't fully advanced, and i could see a bit of metal at the left side. i gently pushed it over just a touch, and the mirror came back down on its own. i cranked the film advance lever and all seemed well.\n\n**here's my issue:** i can no longer fire another shot. i noticed that when i crank the film advance lever, the spool/sproket spins so it does actually advance the film, but the curtain only advances a centimeter or two. once the lever gets to the end of its action and i return the lever to its original position, the curtain also returns to its previous position, and doesn't complete a cycle. it then gets stuck in its slightly-off position, and i have to gently push it back into place. upon doing so, i hear a click.\n\nit seems like whatever connection there is between the advance lever and the curtain is broken, and the curtain will not complete a full cycle, so i can't \"cock\" the camera for its next shot. can anyone tell me about how this should work, and if there are any simple fixes for it? any resources out there that you'd recommend to get me started? i'm pretty diy savvy and have plenty of tools so i'm happy to attempt fixing it, i just need to know where to start.\n\nhere's a video that better demonstrates what i'm talking about: [video link](https://photos.app.goo.gl/cjjywtmnhnwj9fer5)\n\nthanks in advance for any input you may have!", "sortedWord": "None", "identifyer": 53979, "year": "2020"}, {"Unnamed: 0": 307059, "autor": "NobleProgeny", "date": 1593149992000, "content": "Shutter button sticking /!/ Hey guys. Recently my Minolta x 570 button was hard to press like it was stuck or something. I finally got it depresses and the shutter fired as normal but the button got stuck in the down position. I think there may be gunk or possibly sand stuck somewhere causing this issue but can’t find any videos or articles about fixing it. Does anyone know how I would go about getting it off and cleaning it out?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hg1w5x/shutter_button_sticking/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shutter button sticking /!/ hey guys. recently my minolta x 570 button was hard to press like it was stuck or something. i finally got it depresses and the shutter fired as normal but the button got stuck in the down -----> position !!! . i think there may be gunk or possibly sand stuck somewhere causing this issue but can’t find any videos or articles about fixing it. does anyone know how i would go about getting it off and cleaning it out?", "sortedWord": "None", "identifyer": 54018, "year": "2020"}, {"Unnamed: 0": 307148, "autor": "Sea_System", "date": 1604066730000, "content": "Offering free medium format film photography portrait photos in London, anyone interested? /!/ I've been shooting for a while on my Mamiya RB67 - And I'm trying to transition towards taking portrait shots. Which has been hard to get into.\n\nTo build some confidence doing this and to start building a portfolio, to approach people with to demonstrate my work. I thought I'd offer taking some photos for free of people who want/need one in and around London. \n\nThe exchange will be I'll get to use your photo in my portfolio, and you'll get a photo/modelling experience. \n\nIf someone is in a similar position, I'd be happy for you to take a few shots of me as an exchange as well.\n\nI'll attach a photo of me [here](https://i.imgur.com/2qgeoZ0.jpg) in case that's of interest to anyone. (I am not a model by any means, but happy to have a picture taken haha.)\n\nIt would also be great to meet people in the community as well - hopefully this is an appropriate way to approach this, and please let me know if you have any thoughts or questions.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jkxcxa/offering_free_medium_format_film_photography/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "offering free medium format film photography portrait photos in london, anyone interested? /!/ i've been shooting for a while on my mamiya rb67 - and i'm trying to transition towards taking portrait shots. which has been hard to get into.\n\nto build some confidence doing this and to start building a portfolio, to approach people with to demonstrate my work. i thought i'd offer taking some photos for free of people who want/need one in and around london. \n\nthe exchange will be i'll get to use your photo in my portfolio, and you'll get a photo/modelling experience. \n\nif someone is in a similar -----> position !!! , i'd be happy for you to take a few shots of me as an exchange as well.\n\ni'll attach a photo of me [here](https://i.imgur.com/2qgeoz0.jpg) in case that's of interest to anyone. (i am not a model by any means, but happy to have a picture taken haha.)\n\nit would also be great to meet people in the community as well - hopefully this is an appropriate way to approach this, and please let me know if you have any thoughts or questions.", "sortedWord": "None", "identifyer": 54107, "year": "2020"}, {"Unnamed: 0": 307200, "autor": "oliVer9957", "date": 1603561862000, "content": "Nikon F90X vs Nikon N80 /!/ Hi, so I'm trying to start shooting film, right now I have found 2 options but I'm not sure what camera to grab, I have several G lenses that the N80 could benefit from but I also like the features and look of the f90x, both are on the same price range where I live so price is not a factor here. The 3rd option would be the FM10 but that's a little more pricey than the previous ones (around $40 more).\n\nWhat would you grab if you were in my position?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jhda5u/nikon_f90x_vs_nikon_n80/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f90x vs nikon n80 /!/ hi, so i'm trying to start shooting film, right now i have found 2 options but i'm not sure what camera to grab, i have several g lenses that the n80 could benefit from but i also like the features and look of the f90x, both are on the same price range where i live so price is not a factor here. the 3rd option would be the fm10 but that's a little more pricey than the previous ones (around $40 more).\n\nwhat would you grab if you were in my -----> position !!! ?", "sortedWord": "None", "identifyer": 54160, "year": "2020"}, {"Unnamed: 0": 307761, "autor": "hyunez", "date": 1578967427000, "content": "Strange dark speckles in my photos? /!/ Just got back my first 2 rolls from this camera, and most of the pictures have these strange dark speckles. They're clustered along the top and bottom of the frame, but the position of the individual speckles is different in each frame. The speckles are more prominent in some frames and almost invisible in others. Both rolls show speckling.\n\nAny idea what could be causing this?\n\nSpecs:\n\n* Nikon F3\n* Voigtlander Ultron 40mm f2\n* Portra 400\n* Developed and scanned by [Sharpprints.com](https://Sharpprints.com)\n\nhttps://preview.redd.it/wml7gdr9ina41.jpg?width=3130&amp;format=pjpg&amp;auto=webp&amp;s=c0144c79fb2d93e5639030761e8ef619890486f2\n\nhttps://preview.redd.it/75d4ul5nhna41.jpg?width=3130&amp;format=pjpg&amp;auto=webp&amp;s=00d6cefca41a61f3f49f412838a584db20930ed4", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eoeg4v/strange_dark_speckles_in_my_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "strange dark speckles in my photos? /!/ just got back my first 2 rolls from this camera, and most of the pictures have these strange dark speckles. they're clustered along the top and bottom of the frame, but the -----> position !!!  of the individual speckles is different in each frame. the speckles are more prominent in some frames and almost invisible in others. both rolls show speckling.\n\nany idea what could be causing this?\n\nspecs:\n\n* nikon f3\n* voigtlander ultron 40mm f2\n* portra 400\n* developed and scanned by [sharpprints.com](https://sharpprints.com)\n\nhttps://preview.redd.it/wml7gdr9ina41.jpg?width=3130&amp;format=pjpg&amp;auto=webp&amp;s=c0144c79fb2d93e5639030761e8ef619890486f2\n\nhttps://preview.redd.it/75d4ul5nhna41.jpg?width=3130&amp;format=pjpg&amp;auto=webp&amp;s=00d6cefca41a61f3f49f412838a584db20930ed4", "sortedWord": "None", "identifyer": 54732, "year": "2020"}, {"Unnamed: 0": 307934, "autor": "dudeimanoreo", "date": 1607495546000, "content": "Mamiya rb67 pro sd won't fire &amp; mirror won't go up /!/ I'm wondering if anyone has encountered this issue I'm having. I ordered a Mamiya RB67 Pro SD from ebay with 3 lenses. Everything arrived in beautiful condition and as far as appearance true to the description. However, pressing the button to fire doesn't work at all.\n\nI've read just about every thread about being unable to fire the shutter and none of the problems really fit. My mirror is stuck in the down position, not up. I can easily remove and change the lenses, no problem there. There's no stickiness of jamming of the actual lever. But cocking it doesn't engage the mirror at all and trying to fire the shutter is impossible.\n\nMy dark slide is out, the shutter button isn't in lock and none of my lenses are on the mirror lock up setting. I had the film back set to double exposure and couldn't get that to work, so I sacrificed two rolls of film to no avail. Removing the lens and rotating back didn't help either. I'm at a loss.\n\nHas anyone encountered this or have any idea what the issue could be? My only guess is something disengaged during shipping. I have reached out to the seller, waiting to hear back. I'm hoping I can find a solution and not have to send it back to Japan, I've been waiting to get my hands on one of these kits forever. Also, does anyone know of any good repairmen in the US? I'm located in the SF bay area.\n\nThanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k9mrlq/mamiya_rb67_pro_sd_wont_fire_mirror_wont_go_up/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya rb67 pro sd won't fire &amp; mirror won't go up /!/ i'm wondering if anyone has encountered this issue i'm having. i ordered a mamiya rb67 pro sd from ebay with 3 lenses. everything arrived in beautiful condition and as far as appearance true to the description. however, pressing the button to fire doesn't work at all.\n\ni've read just about every thread about being unable to fire the shutter and none of the problems really fit. my mirror is stuck in the down -----> position !!! , not up. i can easily remove and change the lenses, no problem there. there's no stickiness of jamming of the actual lever. but cocking it doesn't engage the mirror at all and trying to fire the shutter is impossible.\n\nmy dark slide is out, the shutter button isn't in lock and none of my lenses are on the mirror lock up setting. i had the film back set to double exposure and couldn't get that to work, so i sacrificed two rolls of film to no avail. removing the lens and rotating back didn't help either. i'm at a loss.\n\nhas anyone encountered this or have any idea what the issue could be? my only guess is something disengaged during shipping. i have reached out to the seller, waiting to hear back. i'm hoping i can find a solution and not have to send it back to japan, i've been waiting to get my hands on one of these kits forever. also, does anyone know of any good repairmen in the us? i'm located in the sf bay area.\n\nthanks in advance.", "sortedWord": "None", "identifyer": 54907, "year": "2020"}, {"Unnamed: 0": 307982, "autor": "the_imgur", "date": 1609080665000, "content": "Nikon fm10 iso plate assembly /!/ Hello, first time posting here\n\nWould like to know if anyone ever worked on nikon fm10\nI was able to disassemble and assemble, but i am stuck at assembling the shutter speed and ISO\n\nI was able to twist the shutter speed and locate the Bulb.\n\n. but how to i set the iso place so it would coincid with the reading in the small window from the shutter speed?\n\nHow do i position the iso place so that if in the window it sais iso 100, the camera knows its iso 100 and not something else?\n-thank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kl4txq/nikon_fm10_iso_plate_assembly/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fm10 iso plate assembly /!/ hello, first time posting here\n\nwould like to know if anyone ever worked on nikon fm10\ni was able to disassemble and assemble, but i am stuck at assembling the shutter speed and iso\n\ni was able to twist the shutter speed and locate the bulb.\n\n. but how to i set the iso place so it would coincid with the reading in the small window from the shutter speed?\n\nhow do i -----> position !!!  the iso place so that if in the window it sais iso 100, the camera knows its iso 100 and not something else?\n-thank you", "sortedWord": "None", "identifyer": 54957, "year": "2020"}, {"Unnamed: 0": 307999, "autor": "the_imgur", "date": 1609041344000, "content": "Fm10 assembly ISO plate /!/ Hello, first time posting here\n\nWould like to know if anyone ever worked on nikon fm10\nI was able to disassemble and assemble, but i am stuck at assembling the shutter speed and ISO\n\nI was able to twist the shutter speed and locate the Bulb.\n\n. but how to i set the iso place so it would coincid with the reading in the small window from the shutter speed?\n\nHow do i position the iso place so that if in the window it sais iso 100, the camera knows its iso 100 and not something else?\n-thank you", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kkwnke/fm10_assembly_iso_plate/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fm10 assembly iso plate /!/ hello, first time posting here\n\nwould like to know if anyone ever worked on nikon fm10\ni was able to disassemble and assemble, but i am stuck at assembling the shutter speed and iso\n\ni was able to twist the shutter speed and locate the bulb.\n\n. but how to i set the iso place so it would coincid with the reading in the small window from the shutter speed?\n\nhow do i -----> position !!!  the iso place so that if in the window it sais iso 100, the camera knows its iso 100 and not something else?\n-thank you", "sortedWord": "None", "identifyer": 54974, "year": "2020"}, {"Unnamed: 0": 308037, "autor": "ElliotSB1", "date": 1608946462000, "content": "Nikon F3 Advancing Film Question /!/ Hello all, I own a Nikon F3 and the advance lever is sooo smooth, I was just wondering when advancing I have heard with other cameras never to let it swing back and to slowly let it go back into position, does anyone know if it’s okay with the F3 to just let it swing back? This may sound like a stupid question I just don’t want to mess it up.\n\nThanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kka1hr/nikon_f3_advancing_film_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f3 advancing film question /!/ hello all, i own a nikon f3 and the advance lever is sooo smooth, i was just wondering when advancing i have heard with other cameras never to let it swing back and to slowly let it go back into -----> position !!! , does anyone know if it’s okay with the f3 to just let it swing back? this may sound like a stupid question i just don’t want to mess it up.\n\nthanks.", "sortedWord": "None", "identifyer": 55012, "year": "2020"}, {"Unnamed: 0": 308238, "autor": "jellyfish_asiago", "date": 1594601607000, "content": "Nikon F2 DP-1 Finder Not Metering, Looking for Suggestions! /!/ One year ago today, I blessed myself by purchasing the mighty self-defense weapon that can also take pics, the Nikon F2 with a DP-1 finder. The camera and finder worked beautifully at all speeds and apertures, giving me some great shots over time. \n\nA few months ago, the meter needle stopped moving when the wind lever was moved to the \"on\" position. Sometimes, it would take a bit of a jiggle or some play with the aperture ring on my 28mm f.35 (with the rabbit ears), but now no amount of coercion will make the needle move from the very right \"off\" position. \n\nSo far, I have swapped the batteries and the lens, and still nothing. In fact, the needle moves when the battery check button is pressed, so electricity is clearly flowing. I am under the impression that the problem lies with the aperture mechanism itself, but I'm only going off of the meter once working after jiggling the aperture ring. Any suggestions on potential trouble points? Is this worth getting fixed or am I better off getting another photomic finder at current prices?\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hq5q23/nikon_f2_dp1_finder_not_metering_looking_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f2 dp-1 finder not metering, looking for suggestions! /!/ one year ago today, i blessed myself by purchasing the mighty self-defense weapon that can also take pics, the nikon f2 with a dp-1 finder. the camera and finder worked beautifully at all speeds and apertures, giving me some great shots over time. \n\na few months ago, the meter needle stopped moving when the wind lever was moved to the \"on\" -----> position !!! . sometimes, it would take a bit of a jiggle or some play with the aperture ring on my 28mm f.35 (with the rabbit ears), but now no amount of coercion will make the needle move from the very right \"off\" position. \n\nso far, i have swapped the batteries and the lens, and still nothing. in fact, the needle moves when the battery check button is pressed, so electricity is clearly flowing. i am under the impression that the problem lies with the aperture mechanism itself, but i'm only going off of the meter once working after jiggling the aperture ring. any suggestions on potential trouble points? is this worth getting fixed or am i better off getting another photomic finder at current prices?\n\nthanks!", "sortedWord": "None", "identifyer": 55219, "year": "2020"}, {"Unnamed: 0": 308252, "autor": "SprodoBaggins", "date": 1594571752000, "content": "Fuji GW690 film advance lever stuck /!/ Like the title states, my film advance lever is stuck in the open position. I got the camera yesterday and  was dry firing it to make sure everything worked when the film advance lever stuck. This is a new camera to me, and I've Googled solutions, but nothing seems to be working. I've tried to open the back and see if I can get the lever to reset and I've taken the top plate off to see if it was jammed up top. I wanted to see if anyone else has any suggestions before I start tearing it apart further.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hpxbj8/fuji_gw690_film_advance_lever_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fuji gw690 film advance lever stuck /!/ like the title states, my film advance lever is stuck in the open -----> position !!! . i got the camera yesterday and  was dry firing it to make sure everything worked when the film advance lever stuck. this is a new camera to me, and i've googled solutions, but nothing seems to be working. i've tried to open the back and see if i can get the lever to reset and i've taken the top plate off to see if it was jammed up top. i wanted to see if anyone else has any suggestions before i start tearing it apart further.", "sortedWord": "None", "identifyer": 55233, "year": "2020"}, {"Unnamed: 0": 308731, "autor": "cmblanco", "date": 1604980116000, "content": "Petri Computor ii - I’m in dire need of assistance! My shutter button if you can tell is stuck in the pressed position. Any suggestions would be welcome as I don’t know much about this world. Which is why I come to you all. Thanks!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jrdn70/petri_computor_ii_im_in_dire_need_of_assistance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "petri computor ii - i’m in dire need of assistance! my shutter button if you can tell is stuck in the pressed -----> position !!! . any suggestions would be welcome as i don’t know much about this world. which is why i come to you all. thanks!!", "sortedWord": "None", "identifyer": 55723, "year": "2020"}, {"Unnamed: 0": 309065, "autor": "Mopey_Zoo_Lion", "date": 1600305705000, "content": "Burned by an ebay listing, debating about sending in for repair, or taking up a new branch of the hobby? /!/ I picked up a Pentax MX whose Ebay listing proudly declared: TESTED! Mint condition! Only to discover upon receipt that the mirror is stuck in the up position and the shutter doesn't reset upon firing until I advance the film lever.  I know Ebay would recoup my costs if I just returned it, but it came with some good glass (hilariously only two of the four lenses match the camera, and the other two do come with an adapter... for yet another mount system 9_9 ) and I'd like to hold onto those. None of the shops in my geographic area service the MX, something about two many changes made to the system while it was in production, and I'm strongly considering sending it off to Eric for repairs, but I have nothing else to shoot with and don't like the idea of waiting around...\nIs this something a total newb could service, and if it's something I enjoy, is there a way for me to actually get trained up as a vintage camera repair tech? It seems like there's a market, and as the old guard that actually worked on these cameras back in the day start to retire, we'll need new hands to keep things running... but I wouldn't know the first thing about seeking training. I know this was kind of rambly, but I'd appreciate any insight folks have on the situation", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iu9dfq/burned_by_an_ebay_listing_debating_about_sending/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "burned by an ebay listing, debating about sending in for repair, or taking up a new branch of the hobby? /!/ i picked up a pentax mx whose ebay listing proudly declared: tested! mint condition! only to discover upon receipt that the mirror is stuck in the up -----> position !!!  and the shutter doesn't reset upon firing until i advance the film lever.  i know ebay would recoup my costs if i just returned it, but it came with some good glass (hilariously only two of the four lenses match the camera, and the other two do come with an adapter... for yet another mount system 9_9 ) and i'd like to hold onto those. none of the shops in my geographic area service the mx, something about two many changes made to the system while it was in production, and i'm strongly considering sending it off to eric for repairs, but i have nothing else to shoot with and don't like the idea of waiting around...\nis this something a total newb could service, and if it's something i enjoy, is there a way for me to actually get trained up as a vintage camera repair tech? it seems like there's a market, and as the old guard that actually worked on these cameras back in the day start to retire, we'll need new hands to keep things running... but i wouldn't know the first thing about seeking training. i know this was kind of rambly, but i'd appreciate any insight folks have on the situation", "sortedWord": "None", "identifyer": 56061, "year": "2020"}, {"Unnamed: 0": 309608, "autor": "IzaakVonReichenbach", "date": 1592946550000, "content": "Praktica BC 1 electronic bayonet issue /!/ A few days ago my friend gave me his old Praktica BC 1 electronic camera, the lens are bayonet mounted and there's an issue - the lens can't be taken off. When I push the bayonet button I can  rotate the lens from the mounted position to release position I feel that it should be released, it goes up around 1 millimeter but it but it does not go any further. When I rotate it back to the mounted position I can hear the \"click\" indicating that it's secured. It seems like something still holds it in its place.  I've been trying to solve it myself but I can't figure out what's  causing it. Have you ever come across issue like this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hen3ad/praktica_bc_1_electronic_bayonet_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "praktica bc 1 electronic bayonet issue /!/ a few days ago my friend gave me his old praktica bc 1 electronic camera, the lens are bayonet mounted and there's an issue - the lens can't be taken off. when i push the bayonet button i can  rotate the lens from the mounted -----> position !!!  to release -----> position !!!  i feel that it should be released, it goes up around 1 millimeter but it but it does not go any further. when i rotate it back to the mounted position i can hear the \"click\" indicating that it's secured. it seems like something still holds it in its place.  i've been trying to solve it myself but i can't figure out what's  causing it. have you ever come across issue like this?", "sortedWord": "None", "identifyer": 56609, "year": "2020"}, {"Unnamed: 0": 309651, "autor": "B_Huij", "date": 1603296669000, "content": "Anyone know how to convert the smaller Mamiya/Graphic 120 backs to fit 4x5 cameras? /!/ I have an Intrepid 4x5 and have been interested in shooting 120 film through it.\n\nI know there are Graphic, Horseman, and other roll film backs available for 4x5 cameras with Graflok clips, but they're kinda overpriced on eBay from what I can see. Having a hard time finding one in 6x6 or 6x9 for less than $100.\n\nI also have an RB67 with some 6x7 backs and one 6x6 back. It uses essentially the same clip system to attach to the RB camera body, it's just smaller. As far as I can tell, the Graphic roll film backs intended for 2 1/4 x 3 1/4 cameras and the Mamiya RB backs are interchangeable, as my 6x6 is actually a Graphic 22.\n\nIs there any way to modify these or mount them into an adapter that would allow me to use them in my 4x5? It appears whoever made [this thing](https://www.ebay.com/itm/Graphic-22-120-Roll-Film-Magazine-for-4-x-5-Graflex-Makes-2-1-4-Square-Negs/254694372003?_trkparms=aid%3D111001%26algo%3DREC.SEED%26ao%3D1%26asc%3D20160908105057%26meid%3D0be2efaee4ce4ba885a6dfcc8f5bc0c3%26pid%3D100675%26rk%3D1%26rkt%3D15%26mehot%3Dnone%26sd%3D254694372003%26itm%3D254694372003%26pmt%3D0%26noa%3D1%26pg%3D2380057%26brand%3DGraflex&amp;_trksid=p2380057.c100675.m4236&amp;_trkparms=pageci%3Aee31356b-13b6-11eb-a3a0-12cdf5dc3c56%7Cparentrq%3A4be677ca1750aaee9e208134fff597b6%7Ciid%3A1) did exactly that, using some kind of homemade wooden adapter.\n\nThe theory if pretty simple, just need to attach it to a plate that fits the Graflok clips. I could make that fairly easily, I think. But I'd be concerned about getting the focal plane positioned correctly so my spring back ground glass can effectively be used for focusing.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jffumz/anyone_know_how_to_convert_the_smaller/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "anyone know how to convert the smaller mamiya/graphic 120 backs to fit 4x5 cameras? /!/ i have an intrepid 4x5 and have been interested in shooting 120 film through it.\n\ni know there are graphic, horseman, and other roll film backs available for 4x5 cameras with graflok clips, but they're kinda overpriced on ebay from what i can see. having a hard time finding one in 6x6 or 6x9 for less than $100.\n\ni also have an rb67 with some 6x7 backs and one 6x6 back. it uses essentially the same clip system to attach to the rb camera body, it's just smaller. as far as i can tell, the graphic roll film backs intended for 2 1/4 x 3 1/4 cameras and the mamiya rb backs are interchangeable, as my 6x6 is actually a graphic 22.\n\nis there any way to modify these or mount them into an adapter that would allow me to use them in my 4x5? it appears whoever made [this thing](https://www.ebay.com/itm/graphic-22-120-roll-film-magazine-for-4-x-5-graflex-makes-2-1-4-square-negs/254694372003?_trkparms=aid%3d111001%26algo%3drec.seed%26ao%3d1%26asc%3d20160908105057%26meid%3d0be2efaee4ce4ba885a6dfcc8f5bc0c3%26pid%3d100675%26rk%3d1%26rkt%3d15%26mehot%3dnone%26sd%3d254694372003%26itm%3d254694372003%26pmt%3d0%26noa%3d1%26pg%3d2380057%26brand%3dgraflex&amp;_trksid=p2380057.c100675.m4236&amp;_trkparms=pageci%3aee31356b-13b6-11eb-a3a0-12cdf5dc3c56%7cparentrq%3a4be677ca1750aaee9e208134fff597b6%7ciid%3a1) did exactly that, using some kind of homemade wooden adapter.\n\nthe theory if pretty simple, just need to attach it to a plate that fits the graflok clips. i could make that fairly easily, i think. but i'd be concerned about getting the focal plane -----> positioned !!!  correctly so my spring back ground glass can effectively be used for focusing.", "sortedWord": "None", "identifyer": 56653, "year": "2020"}, {"Unnamed: 0": 309846, "autor": "omarmontelara", "date": 1588637327000, "content": "Shutter issues with recently purchased M645 /!/ Returned to analog photography about 2 weeks ago after about 7 years in solely digital, so my diction might be a bit rusty! Apologies in advance if this query is unclear. \n\nReceived a Mamiya 645 about a week ago and have not had any issues, save for today: went for a photo walk, and about 5 pictures through the roll, the shutter fired into an upright position, but will not release. I am familiar with using the battery check button (red button (top-right side of the camera  body) to release the stuck shutter, and l  when I press the button, the shutter releases downward. This happens each time I press the shutter button now. It is as if I am shooting with the shutter speed set to bulb.\n\nAnyone have experience with this issue? I think it must be an issue with the battery, but could be wrong.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gdnb16/shutter_issues_with_recently_purchased_m645/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shutter issues with recently purchased m645 /!/ returned to analog photography about 2 weeks ago after about 7 years in solely digital, so my diction might be a bit rusty! apologies in advance if this query is unclear. \n\nreceived a mamiya 645 about a week ago and have not had any issues, save for today: went for a photo walk, and about 5 pictures through the roll, the shutter fired into an upright -----> position !!! , but will not release. i am familiar with using the battery check button (red button (top-right side of the camera  body) to release the stuck shutter, and l  when i press the button, the shutter releases downward. this happens each time i press the shutter button now. it is as if i am shooting with the shutter speed set to bulb.\n\nanyone have experience with this issue? i think it must be an issue with the battery, but could be wrong.", "sortedWord": "None", "identifyer": 56851, "year": "2020"}, {"Unnamed: 0": 310831, "autor": "thealekphoto", "date": 1578246794000, "content": "Canon Lens FD unknown slide /!/ I have a Canon Lens FD 28mm 1:2.8 S.C. to go with my AE-1 Program and I noticed today that there is a small metal part in the back of the lens that can be slid ; *the \"biggest\" little metal part next to my thumb in the picture.* \n\n[The biggest grey slide of the two, the one next to my thumb. ](https://preview.redd.it/xg6g5wfyyz841.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=93b47d3671fe95e29fb7992df0a872f533dc0782)\n\nWhen I slide it and take a few shots it keeps its position, so I was wondering what is it for. If any of you know what its function is and how to use it I would be very pleased to know it. \n\nAlso the diaphragm doesn't seem to move when I change the aperture setting and take a picture, which is pretty strange because the pictures come out clean. \n\nThanks a lot ! *Disclaimer : I am pretty new to analog photography*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ekgcs6/canon_lens_fd_unknown_slide/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon lens fd unknown slide /!/ i have a canon lens fd 28mm 1:2.8 s.c. to go with my ae-1 program and i noticed today that there is a small metal part in the back of the lens that can be slid ; *the \"biggest\" little metal part next to my thumb in the picture.* \n\n[the biggest grey slide of the two, the one next to my thumb. ](https://preview.redd.it/xg6g5wfyyz841.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=93b47d3671fe95e29fb7992df0a872f533dc0782)\n\nwhen i slide it and take a few shots it keeps its -----> position !!! , so i was wondering what is it for. if any of you know what its function is and how to use it i would be very pleased to know it. \n\nalso the diaphragm doesn't seem to move when i change the aperture setting and take a picture, which is pretty strange because the pictures come out clean. \n\nthanks a lot ! *disclaimer : i am pretty new to analog photography*", "sortedWord": "None", "identifyer": 57851, "year": "2020"}, {"Unnamed: 0": 311214, "autor": "blackbear04", "date": 1581059956000, "content": "mirror doesn’t move (minolta srt 101) /!/ i’m complete newbie to analog camera stuff, so i’m i don’t know any correct terminology and i’m not sure if this even the right place to post this but i don’t know where else to ask. \ni bought a minolta srt 101 about a month ago because i’ve been getting into film, one of my friends has been shooting film for a long time and i wanted a camera of my own. she recommended the minolta cause her brother has it and likes it. \n\nof course i wasn’t sure if it worked (like anything you buy online) but the roll i just got back was completely blank and i assumed it was user error, but i started messing around with the camera (as i probably should have when i got it but oh well) and i noticed that the mirror in the body (? not sure what to call it) doesn’t move at all. \ni’ve been furiously googling and it seems like it’s common for the mirror to get stuck in the upwards position, but mine doesn’t appear to move up at all? nothing moves, in fact, except the small lever thing along the bottom. \n\ni apologize again for the wording, i know nothing about the mechanics but i’m just wondering if this can be fixed, or if anyone knows what the problem is, or anything that could be helpful. thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f072ph/mirror_doesnt_move_minolta_srt_101/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mirror doesn’t move (minolta srt 101) /!/ i’m complete newbie to analog camera stuff, so i’m i don’t know any correct terminology and i’m not sure if this even the right place to post this but i don’t know where else to ask. \ni bought a minolta srt 101 about a month ago because i’ve been getting into film, one of my friends has been shooting film for a long time and i wanted a camera of my own. she recommended the minolta cause her brother has it and likes it. \n\nof course i wasn’t sure if it worked (like anything you buy online) but the roll i just got back was completely blank and i assumed it was user error, but i started messing around with the camera (as i probably should have when i got it but oh well) and i noticed that the mirror in the body (? not sure what to call it) doesn’t move at all. \ni’ve been furiously googling and it seems like it’s common for the mirror to get stuck in the upwards -----> position !!! , but mine doesn’t appear to move up at all? nothing moves, in fact, except the small lever thing along the bottom. \n\ni apologize again for the wording, i know nothing about the mechanics but i’m just wondering if this can be fixed, or if anyone knows what the problem is, or anything that could be helpful. thanks!", "sortedWord": "None", "identifyer": 58239, "year": "2020"}, {"Unnamed: 0": 311227, "autor": "5teverin0", "date": 1581015013000, "content": "Mamiya 645AFD II mirror locked up /!/ I have the chance to aquire a Mamiya 645AFD II that is in great shape, except the mirror is stuck in the up position. Anyone know a possible DIY fix, or what it might cost to have a pro do it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ezwvwj/mamiya_645afd_ii_mirror_locked_up/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 645afd ii mirror locked up /!/ i have the chance to aquire a mamiya 645afd ii that is in great shape, except the mirror is stuck in the up -----> position !!! . anyone know a possible diy fix, or what it might cost to have a pro do it?", "sortedWord": "None", "identifyer": 58260, "year": "2020"}, {"Unnamed: 0": 311603, "autor": "the_arctic_monkey", "date": 1606685712000, "content": "Film in Bolex H16 won't advance /!/ Hello! I recently picked up a non-reflex Bolex H16 and was trying to test it out yesterday with an 80ft short end. Around 20ft the film would not advance and I have been unable to get it to shoot. When I tried to shoot the camera was on a full crank and the motor was engaged. I also made sure the loop formers were in the correct position before shooting. Any tips on getting it working again or at least salvaging the film I did shoot? Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k3hupg/film_in_bolex_h16_wont_advance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "film in bolex h16 won't advance /!/ hello! i recently picked up a non-reflex bolex h16 and was trying to test it out yesterday with an 80ft short end. around 20ft the film would not advance and i have been unable to get it to shoot. when i tried to shoot the camera was on a full crank and the motor was engaged. i also made sure the loop formers were in the correct -----> position !!!  before shooting. any tips on getting it working again or at least salvaging the film i did shoot? thanks!", "sortedWord": "None", "identifyer": 58640, "year": "2020"}, {"Unnamed: 0": 311640, "autor": "PNW_Roy", "date": 1584652673000, "content": "Kiev 88 focusing ring locked /!/ Just purchased and received a really beautiful looking Kiev 88 MF camera.  As many know, the Kiev 88 was designed as a clone of the  [Hasselblad](https://en.wikipedia.org/wiki/Hasselblad) 1600 F.  In unpacking it and checking it out, it appears the focusing ring is either seized or somehow locked.  It won't budge one iota in either direction.  Aperture ring works just fine.  It was advertised as working perfectly, so returning it isn't a problem.  I just wanted to make sure I wasn't overlooking something simple that perhaps purposely locks the focusing ring in a certain position for some reason.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fli1d3/kiev_88_focusing_ring_locked/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "kiev 88 focusing ring locked /!/ just purchased and received a really beautiful looking kiev 88 mf camera.  as many know, the kiev 88 was designed as a clone of the  [hasselblad](https://en.wikipedia.org/wiki/hasselblad) 1600 f.  in unpacking it and checking it out, it appears the focusing ring is either seized or somehow locked.  it won't budge one iota in either direction.  aperture ring works just fine.  it was advertised as working perfectly, so returning it isn't a problem.  i just wanted to make sure i wasn't overlooking something simple that perhaps purposely locks the focusing ring in a certain -----> position !!!  for some reason.", "sortedWord": "None", "identifyer": 58677, "year": "2020"}, {"Unnamed: 0": 311820, "autor": "Antwann68814", "date": 1607289640000, "content": "New Canon F-1 problem /!/ So I just barely got a Canon F-1 New (The latest model) from KEH. For some reason the film advance lever is not working. It will click out into the 30 degree position but it will not go any further than that. Did I get a faulty camera or is there something really obvious I'm missing?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k82cki/new_canon_f1_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "new canon f-1 problem /!/ so i just barely got a canon f-1 new (the latest model) from keh. for some reason the film advance lever is not working. it will click out into the 30 degree -----> position !!!  but it will not go any further than that. did i get a faulty camera or is there something really obvious i'm missing?", "sortedWord": "None", "identifyer": 58865, "year": "2020"}, {"Unnamed: 0": 311952, "autor": "ZFCD", "date": 1594501790000, "content": "Yashica A shutter stays down. Broken? /!/ I recently got a Yashica A. Everything works fine, except when I cock the shutter, the lever stays down. Then when I take the shot, it flips back up.\n\nBut on every video I've seen of this camera, the shutter is cocked, then returns to its original position before you take the shot. So when a shot is taken, there's no external movement.\n\nThis has ruined a couple images for me so far, as my finger was blocking the shutter lever and kept it from closing.\n\nIs my camera broken? Was there later version of the camera released that fixed this issue? Or is there a way to fix it myself?\n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hpht9w/yashica_a_shutter_stays_down_broken/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "yashica a shutter stays down. broken? /!/ i recently got a yashica a. everything works fine, except when i cock the shutter, the lever stays down. then when i take the shot, it flips back up.\n\nbut on every video i've seen of this camera, the shutter is cocked, then returns to its original -----> position !!!  before you take the shot. so when a shot is taken, there's no external movement.\n\nthis has ruined a couple images for me so far, as my finger was blocking the shutter lever and kept it from closing.\n\nis my camera broken? was there later version of the camera released that fixed this issue? or is there a way to fix it myself?\n\nthanks", "sortedWord": "None", "identifyer": 59000, "year": "2020"}, {"Unnamed: 0": 312086, "autor": "francofx", "date": 1593725698000, "content": "Ricoh KR5 - stuck st S position", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hk5zd9/ricoh_kr5_stuck_st_s_position/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ricoh kr5 - stuck st s -----> position !!! ", "sortedWord": "None", "identifyer": 59137, "year": "2020"}, {"Unnamed: 0": 312131, "autor": "NocturnalInteraction", "date": 1595976768000, "content": "Olympus OM-1n Mirror Box Repair /!/ I’ve been able to take apart the body of an olympus om-1n because when you’d fire the shutter, the mirror would not flip up into the taking position. I’ve read the service manual and all other texts related to the mirror box, so I know exactly how each part is meant to function. The issue is that the piece next to the arrow I’ve drawn does not travel in that direction as it should. Everything else functions as it should, but I do not see what the clear way to fix my issue is. The part I’ve circled is one that I’m going to put special camera grease onto soon in hopes that that will help, but I don’t know what else to try! Any help is appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hzoz3f/olympus_om1n_mirror_box_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "olympus om-1n mirror box repair /!/ i’ve been able to take apart the body of an olympus om-1n because when you’d fire the shutter, the mirror would not flip up into the taking -----> position !!! . i’ve read the service manual and all other texts related to the mirror box, so i know exactly how each part is meant to function. the issue is that the piece next to the arrow i’ve drawn does not travel in that direction as it should. everything else functions as it should, but i do not see what the clear way to fix my issue is. the part i’ve circled is one that i’m going to put special camera grease onto soon in hopes that that will help, but i don’t know what else to try! any help is appreciated!", "sortedWord": "None", "identifyer": 59182, "year": "2020"}, {"Unnamed: 0": 312170, "autor": "operativedan", "date": 1595907115000, "content": "Mamiya Super 23 - 100mm f/3.5 lens won't retract /!/ http://imgur.com/gallery/lCDx4ie\n\nThat's an image of my Mamiya-Sekor 100mm f/3.5 Seikosha-S retractable-type lens. To use the bellows system with the Mamiya Press Super 23 camera, you need to retract the lens. To use the lens 'normally' without using the bellows, you need to extend the lens.\n\nTo quote the Mamiya Super 23 manual, \"When using a 100mm f/ 3.5 standard lens, the lens-shutter assembly must be pulled out from its retracted position before taking normal photographs. Grip the lens-shutter assembly firmly turn it slightly counterclockwise, and pull it out i then, turn it clockwise, as the direction of arrow on the lens barrel indicates.\n\nIf the lens-shutter assembly is left in its retracted position, the coupled rangefinder wi II not function even if the two images are coincided and form a single image.\"\n\n*Would anyone here have experience with the lens, and be able to tell me why I can't extend or retract this lens?* The NORMAL sticker on my lens leads me to believe it is the retractable-type.\n\nThanks for reading", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hz78my/mamiya_super_23_100mm_f35_lens_wont_retract/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya super 23 - 100mm f/3.5 lens won't retract /!/ http://imgur.com/gallery/lcdx4ie\n\nthat's an image of my mamiya-sekor 100mm f/3.5 seikosha-s retractable-type lens. to use the bellows system with the mamiya press super 23 camera, you need to retract the lens. to use the lens 'normally' without using the bellows, you need to extend the lens.\n\nto quote the mamiya super 23 manual, \"when using a 100mm f/ 3.5 standard lens, the lens-shutter assembly must be pulled out from its retracted -----> position !!!  before taking normal photographs. grip the lens-shutter assembly firmly turn it slightly counterclockwise, and pull it out i then, turn it clockwise, as the direction of arrow on the lens barrel indicates.\n\nif the lens-shutter assembly is left in its retracted position, the coupled rangefinder wi ii not function even if the two images are coincided and form a single image.\"\n\n*would anyone here have experience with the lens, and be able to tell me why i can't extend or retract this lens?* the normal sticker on my lens leads me to believe it is the retractable-type.\n\nthanks for reading", "sortedWord": "None", "identifyer": 59221, "year": "2020"}, {"Unnamed: 0": 312222, "autor": "DNehru", "date": 1603734151000, "content": "Should you take out batteries from flash unit after use? /!/ I've bought new batteries for 166a Canon flash, took like 30 pictures and stored it in my closed, today wanted to shoot local protest, but my batteries were dead, I'm sure that flash was in OFF position. Do these batteries last so short or it's just my fault for leaving them in?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jij6ge/should_you_take_out_batteries_from_flash_unit/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should you take out batteries from flash unit after use? /!/ i've bought new batteries for 166a canon flash, took like 30 pictures and stored it in my closed, today wanted to shoot local protest, but my batteries were dead, i'm sure that flash was in off -----> position !!! . do these batteries last so short or it's just my fault for leaving them in?", "sortedWord": "None", "identifyer": 59273, "year": "2020"}, {"Unnamed: 0": 312437, "autor": "badboykitch", "date": 1600458651000, "content": "Olympus XA - Long exposure hack /!/ guys guys guys\n\nfor anyone who owns an Olympus XA - I came across this site that talks about the illegal long exposure  hack that you can do on your XA to shoot at night. I've linked the site below but here is the paragraph and you can see the shot in the website\n\n&amp;#x200B;\n\n\"Night shot using the illegal long exposure mode. To do this, set the lever to battery check, put the camera on a tripod, get your composition, and press the shutter button.  An annoying buzzer will go off the whole time the shutter is open.  When you’re done with your exposure, put a black cloth over the lens, and flip the lever back to its original position, and the shutter will close.  I don’t know why Olympus doesn’t mention this trick in the manual, but the manual does mention you should not push the shutter button during a battery check as “it will run the batteries down, leaving the shutter opened,” well that’s kind of the idea for long exposures right?  If the batteries just happen to die during an exposure, simply close the cover, and maybe cover the camera with a black cloth to be safe, and insert new batteries!\"\n\n[https://photojottings.com/olympus-xa-film-camera-review/](https://photojottings.com/olympus-xa-film-camera-review/)\n\n&amp;#x200B;\n\nYour welcome XA owners!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ivd7e9/olympus_xa_long_exposure_hack/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "olympus xa - long exposure hack /!/ guys guys guys\n\nfor anyone who owns an olympus xa - i came across this site that talks about the illegal long exposure  hack that you can do on your xa to shoot at night. i've linked the site below but here is the paragraph and you can see the shot in the website\n\n&amp;#x200b;\n\n\"night shot using the illegal long exposure mode. to do this, set the lever to battery check, put the camera on a tripod, get your composition, and press the shutter button.  an annoying buzzer will go off the whole time the shutter is open.  when you’re done with your exposure, put a black cloth over the lens, and flip the lever back to its original -----> position !!! , and the shutter will close.  i don’t know why olympus doesn’t mention this trick in the manual, but the manual does mention you should not push the shutter button during a battery check as “it will run the batteries down, leaving the shutter opened,” well that’s kind of the idea for long exposures right?  if the batteries just happen to die during an exposure, simply close the cover, and maybe cover the camera with a black cloth to be safe, and insert new batteries!\"\n\n[https://photojottings.com/olympus-xa-film-camera-review/](https://photojottings.com/olympus-xa-film-camera-review/)\n\n&amp;#x200b;\n\nyour welcome xa owners!", "sortedWord": "None", "identifyer": 59490, "year": "2020"}, {"Unnamed: 0": 312677, "autor": "Feleeppo", "date": 1591285635000, "content": "Looking for a new camera. Suggestions are welcome /!/ I’ve been looking for a new camera solution from a couple years now but still I can’t figure out what piece of gear to pick. I’m not new to this world but my geographical position reduces a lot opportunities to develop and then to shoot film. I’ve been shooting film for about 5 years but the more time passes the more i acknowledge my camera lacks some features I find out I need every time I shoot. \n\nBasically I shoot with a Revueflex Sd-1 paired with a revuenon 50mm 1.9. These gears never failed me but I still find some thing restrictive. \nAs I shoot mostly snapshots (everyday life, friends, or just some things to instantly report to remember them) I figure out I would enjoy \n- in camera automatic shutter release \n- more detailed light meter (mine is just expressed by three dots for correct/over/under exposure)\n- m-42 screw mount \n\nI’d appreciate any suggestion or time spent to help me. Forgive my bad English as I’m not a native speaker. \n\nTy", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gwjz49/looking_for_a_new_camera_suggestions_are_welcome/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for a new camera. suggestions are welcome /!/ i’ve been looking for a new camera solution from a couple years now but still i can’t figure out what piece of gear to pick. i’m not new to this world but my geographical -----> position !!!  reduces a lot opportunities to develop and then to shoot film. i’ve been shooting film for about 5 years but the more time passes the more i acknowledge my camera lacks some features i find out i need every time i shoot. \n\nbasically i shoot with a revueflex sd-1 paired with a revuenon 50mm 1.9. these gears never failed me but i still find some thing restrictive. \nas i shoot mostly snapshots (everyday life, friends, or just some things to instantly report to remember them) i figure out i would enjoy \n- in camera automatic shutter release \n- more detailed light meter (mine is just expressed by three dots for correct/over/under exposure)\n- m-42 screw mount \n\ni’d appreciate any suggestion or time spent to help me. forgive my bad english as i’m not a native speaker. \n\nty", "sortedWord": "None", "identifyer": 59735, "year": "2020"}, {"Unnamed: 0": 312968, "autor": "kimjongunhtsunhts", "date": 1592817455000, "content": "Dealing with weird strap position on Leica CL /!/ It's a bit of a first world problem, please bear with me. And sorry.\n\nI love my Leica CL. It's a cool camera, it works great and I love the results. The thing I can't stand though is the positioning of the strap with both the lugs on the left side of the camera. Carrying it is fine, but using the camera becomes awkward with a lot of strap material on one side of the camera.\n\nAnyone have a similar issue and maybe a solution for it? I was thinking about mounting the strap on the tripod screw with something by either Peak Design or Custom SLR but that would probably block the latch for opening the camera back, so that wouldn't be ideal either.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hdoyri/dealing_with_weird_strap_position_on_leica_cl/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "dealing with weird strap -----> position !!!  on leica cl /!/ it's a bit of a first world problem, please bear with me. and sorry.\n\ni love my leica cl. it's a cool camera, it works great and i love the results. the thing i can't stand though is the positioning of the strap with both the lugs on the left side of the camera. carrying it is fine, but using the camera becomes awkward with a lot of strap material on one side of the camera.\n\nanyone have a similar issue and maybe a solution for it? i was thinking about mounting the strap on the tripod screw with something by either peak design or custom slr but that would probably block the latch for opening the camera back, so that wouldn't be ideal either.", "sortedWord": "None", "identifyer": 60032, "year": "2020"}, {"Unnamed: 0": 313025, "autor": "DVSghost", "date": 1592632807000, "content": "Olympus XA question. /!/ Got an XA today, unwrapped it, swapped the batteries ran it through the usual tests...shutter fires at all speeds. Aperture is smooth and opens/closes properly...but, it beeps when I hit the shutter. Just a quick little *beep* *fire* \nSpent the day searching couldn’t find an answer anywhere...thoughts?\n\nAnd no, it’s not set to battery check or self timer, the lever is in rest position. \n\nThanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hcguam/olympus_xa_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "olympus xa question. /!/ got an xa today, unwrapped it, swapped the batteries ran it through the usual tests...shutter fires at all speeds. aperture is smooth and opens/closes properly...but, it beeps when i hit the shutter. just a quick little *beep* *fire* \nspent the day searching couldn’t find an answer anywhere...thoughts?\n\nand no, it’s not set to battery check or self timer, the lever is in rest -----> position !!! . \n\nthanks in advance.", "sortedWord": "None", "identifyer": 60089, "year": "2020"}, {"Unnamed: 0": 313135, "autor": "marcuscaravan", "date": 1588444598000, "content": "Minolta X700 issue /!/ I own a Minolta X-700 SLR which has a problem with the shutter lever. I use the camera predominantly with the Minolta Motor Drive 1 attached and today the film advanced via the motor drive yet would not release the shutter.\n\nI have troubleshooter the issue and found out that the Motor drive spool on the base of the camera isnt resetting into position when the lever is advanced. I can reset the Motor drive spool back into position with my fingernail and only then will the shutter release.\n\nHowever I'm having to do this with every single shot. I'm wondering whether something has come loose?\n\nIf anyone could get back to me that would be great.\n\nCheers :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gcbf3g/minolta_x700_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "minolta x700 issue /!/ i own a minolta x-700 slr which has a problem with the shutter lever. i use the camera predominantly with the minolta motor drive 1 attached and today the film advanced via the motor drive yet would not release the shutter.\n\ni have troubleshooter the issue and found out that the motor drive spool on the base of the camera isnt resetting into -----> position !!!  when the lever is advanced. i can reset the motor drive spool back into position with my fingernail and only then will the shutter release.\n\nhowever i'm having to do this with every single shot. i'm wondering whether something has come loose?\n\nif anyone could get back to me that would be great.\n\ncheers :)", "sortedWord": "None", "identifyer": 60204, "year": "2020"}, {"Unnamed: 0": 313147, "autor": "vardeberg", "date": 1588421227000, "content": "Buying Mamiya RZ67 \"vs.\" Zenza Bronica ETRSi /!/ So I'm looking into investing in a MF camera, and I'm kind of in a unique position where I have access to a bunch of MF cameras through a camera museum that's planning to get rid of most duplicates (meaning that they have 2 or more of some cameras). The guy who runs the museum was kind enough to let me test out his Bronica ETRSi with the AE-II finder and some Portra 400, and I absolutely LOVE the results, even though it's 6x4.5 which I notice a lot of people in this reddit community are not too big fans of for some reason. The only challenge for me here is that I know this guy has a couple of Mamiya RZ67 as well, and I'm going to ask him if I can also put a roll through one of them just to see what I like the best. One of the main reasons I'm interested in the Mamiya is the rotating back, and this seems like such a gem of a feature. Given that he's willing to sell me one of these (unfortunately my student tier economy can only take so much), what will you guys recommend I go for? Also, what pros and cons should I be aware of with these two cameras?  \n\n\nList of pros and cons that I already know of for both cameras:  \n\n\nMamiya RZ67:  \n**Pro's**:\n\n* Rotating back, which kind of eliminates the problem of only having a WL-finder\n* Interchangeable backs so I can shoot 6x4.5, 6x6 and 6x7 with the same camera\n* Quite easy to find accessories in good condition (at least from what I've seen and heard)\n* 6x7 format yields even greater resolution (not critical, but still semi important for me)\n* Stretching bellow which is just fantastic for macro \n* Built like a f\\*\\*\\*ing tank, serves multipurpose in a war zone as both camera and potential weapon\n* In general a legendary and renowned camera, instant respect from other photo geeks\n\n**Con's**:\n\n* Demand is high and pricing is somewhat the same for accessories \n* Built like a f\\*\\*\\*ing tank, weight and size in accordance \n* 6x7 format yields fewer shots per roll -&gt; about 1,5 times the price per shot compared to 6x4.5\n* Possibly no built in light metering without spending a student's fortune on a prism finder\n\nZenza Bronica ETRSi:  \n**Pro's**:\n\n* Quite small size and weight, easier to lug around, perhaps easier to hold and operate\n* Has the AE-II finder which has the built in light meter (omg this is so useful)\n* 6x4.5 yields more shots per roll\n* It has most features you really \"need\" in a good MF camera\n\n**Con's**:\n\n* Seemingly quite hard to find accessories, especially WL finder\n* Accessories from other Bronica models not compatible \n* Locked to only 6x4.5 and 35mm (but then I'll just use one of my 35mm cameras lol)\n* Locked to horizontal mode unless you rotate the camera. Not too much of a problem with a prism finder and enough light to hand hold but still..\n\n  \nWould love to hear your experience with either of these two cameras, and especially if you've used both.   \nAlso, sorry if any of my English is off. It's not my first language, but please feel free to correct me", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gc5ds5/buying_mamiya_rz67_vs_zenza_bronica_etrsi/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "buying mamiya rz67 \"vs.\" zenza bronica etrsi /!/ so i'm looking into investing in a mf camera, and i'm kind of in a unique -----> position !!!  where i have access to a bunch of mf cameras through a camera museum that's planning to get rid of most duplicates (meaning that they have 2 or more of some cameras). the guy who runs the museum was kind enough to let me test out his bronica etrsi with the ae-ii finder and some portra 400, and i absolutely love the results, even though it's 6x4.5 which i notice a lot of people in this reddit community are not too big fans of for some reason. the only challenge for me here is that i know this guy has a couple of mamiya rz67 as well, and i'm going to ask him if i can also put a roll through one of them just to see what i like the best. one of the main reasons i'm interested in the mamiya is the rotating back, and this seems like such a gem of a feature. given that he's willing to sell me one of these (unfortunately my student tier economy can only take so much), what will you guys recommend i go for? also, what pros and cons should i be aware of with these two cameras?  \n\n\nlist of pros and cons that i already know of for both cameras:  \n\n\nmamiya rz67:  \n**pro's**:\n\n* rotating back, which kind of eliminates the problem of only having a wl-finder\n* interchangeable backs so i can shoot 6x4.5, 6x6 and 6x7 with the same camera\n* quite easy to find accessories in good condition (at least from what i've seen and heard)\n* 6x7 format yields even greater resolution (not critical, but still semi important for me)\n* stretching bellow which is just fantastic for macro \n* built like a f\\*\\*\\*ing tank, serves multipurpose in a war zone as both camera and potential weapon\n* in general a legendary and renowned camera, instant respect from other photo geeks\n\n**con's**:\n\n* demand is high and pricing is somewhat the same for accessories \n* built like a f\\*\\*\\*ing tank, weight and size in accordance \n* 6x7 format yields fewer shots per roll -&gt; about 1,5 times the price per shot compared to 6x4.5\n* possibly no built in light metering without spending a student's fortune on a prism finder\n\nzenza bronica etrsi:  \n**pro's**:\n\n* quite small size and weight, easier to lug around, perhaps easier to hold and operate\n* has the ae-ii finder which has the built in light meter (omg this is so useful)\n* 6x4.5 yields more shots per roll\n* it has most features you really \"need\" in a good mf camera\n\n**con's**:\n\n* seemingly quite hard to find accessories, especially wl finder\n* accessories from other bronica models not compatible \n* locked to only 6x4.5 and 35mm (but then i'll just use one of my 35mm cameras lol)\n* locked to horizontal mode unless you rotate the camera. not too much of a problem with a prism finder and enough light to hand hold but still..\n\n  \nwould love to hear your experience with either of these two cameras, and especially if you've used both.   \nalso, sorry if any of my english is off. it's not my first language, but please feel free to correct me", "sortedWord": "None", "identifyer": 60216, "year": "2020"}, {"Unnamed: 0": 313218, "autor": "Broken_Perfectionist", "date": 1588225833000, "content": "Rangefinder focusing tips for SLR Shooter /!/ A little background, I inherited my grandfather’s Yashica Lynx 5000e which is a fixed lens 50mm f1.8 rangefinder and have put many rolls through it. I recently bought a Fed 2 that’s on it way and I’ve shot a Leica M6 and Bessa R2 (courtesy of some great friends). \n\nPhotos all came out fine and mostly in focus but admittedly it takes me a while to feel confident enough to fire the shutter. \n\nIndoors seems to have a much lower keeper rate. With an SLR I’m usually focusing on one vertical line in the split prism and it becomes pretty obvious when it’s in focus. With a rangefinder, I have a hard time focusing on anything in particular to line up. It doesn’t seem as obvious since an overlapping image can have multiple curves or lines that compete with each  other for my attention for them to overlap. \n\nDo you just trust the dof to cover you in those cases? I recall  Eric Kim mentioning that you really need to learn zone focus and know the focus tab positions (6’o clock) and how they correlate with your subject distance. \n\nI’d like a sip of the rangefinder Kool-Aid (was actually Flavor aid) please. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gapzxv/rangefinder_focusing_tips_for_slr_shooter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "rangefinder focusing tips for slr shooter /!/ a little background, i inherited my grandfather’s yashica lynx 5000e which is a fixed lens 50mm f1.8 rangefinder and have put many rolls through it. i recently bought a fed 2 that’s on it way and i’ve shot a leica m6 and bessa r2 (courtesy of some great friends). \n\nphotos all came out fine and mostly in focus but admittedly it takes me a while to feel confident enough to fire the shutter. \n\nindoors seems to have a much lower keeper rate. with an slr i’m usually focusing on one vertical line in the split prism and it becomes pretty obvious when it’s in focus. with a rangefinder, i have a hard time focusing on anything in particular to line up. it doesn’t seem as obvious since an overlapping image can have multiple curves or lines that compete with each  other for my attention for them to overlap. \n\ndo you just trust the dof to cover you in those cases? i recall  eric kim mentioning that you really need to learn zone focus and know the focus tab -----> positions !!!  (6’o clock) and how they correlate with your subject distance. \n\ni’d like a sip of the rangefinder kool-aid (was actually flavor aid) please. thanks!", "sortedWord": "None", "identifyer": 60290, "year": "2020"}, {"Unnamed: 0": 313311, "autor": "analogfilmclub", "date": 1605215511000, "content": "I had the chance to interview George Campbell of Orwo North America. /!/ I've been bored out of my head and I decided to start doing something somewhat productive, so I've started interviewing people with various positions in the film industry, whether they are entrepreneurs, ex-employees, or engineers. This is the first, uncut and raw interview I had with George Campbell of Orwo North America. We discussed how he got into the industry, where he thinks it's going, and some new projects that Orwo is working on (hint: new color film).   \n\n\nAnd yeah I know that Analog Film sounds weird, but film means cinema these days, so I didn't want any confusion.   \n\n\nI'm sorry if the community doesn't want any personal promotion, I hope you guys enjoy it.   \n[https://open.spotify.com/show/6oa89CCmcdsfvPZ1XDhKng](https://open.spotify.com/show/6oa89CCmcdsfvPZ1XDhKng)  \nor   \n[https://anchor.fm/analogfilmclub/episodes/Episode-1---George-Campbell-em9hj5](https://anchor.fm/analogfilmclub/episodes/Episode-1---George-Campbell-em9hj5)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jt3c90/i_had_the_chance_to_interview_george_campbell_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i had the chance to interview george campbell of orwo north america. /!/ i've been bored out of my head and i decided to start doing something somewhat productive, so i've started interviewing people with various -----> positions !!!  in the film industry, whether they are entrepreneurs, ex-employees, or engineers. this is the first, uncut and raw interview i had with george campbell of orwo north america. we discussed how he got into the industry, where he thinks it's going, and some new projects that orwo is working on (hint: new color film).   \n\n\nand yeah i know that analog film sounds weird, but film means cinema these days, so i didn't want any confusion.   \n\n\ni'm sorry if the community doesn't want any personal promotion, i hope you guys enjoy it.   \n[https://open.spotify.com/show/6oa89ccmcdsfvpz1xdhkng](https://open.spotify.com/show/6oa89ccmcdsfvpz1xdhkng)  \nor   \n[https://anchor.fm/analogfilmclub/episodes/episode-1---george-campbell-em9hj5](https://anchor.fm/analogfilmclub/episodes/episode-1---george-campbell-em9hj5)", "sortedWord": "None", "identifyer": 60383, "year": "2020"}, {"Unnamed: 0": 313979, "autor": "cfarley137", "date": 1597689384000, "content": "Contax repair recommendation? /!/ I've got a beautiful Contax RTS II with an intermittent mechanical problem. If I haven't wound the film to the next frame for a while, and then I do it quickly, the first shutter curtain doesn't move from it's resting position. This leaves the shutter completely open and causes a bad light leak.\n\nCan anybody recommend a company or technician who could look at this camera and repair it if possible?\n\nI got a recommendation for contaxrepairs.com, however he won't work on RTS II cameras because of the lack of parts.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ibjz0b/contax_repair_recommendation/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "contax repair recommendation? /!/ i've got a beautiful contax rts ii with an intermittent mechanical problem. if i haven't wound the film to the next frame for a while, and then i do it quickly, the first shutter curtain doesn't move from it's resting -----> position !!! . this leaves the shutter completely open and causes a bad light leak.\n\ncan anybody recommend a company or technician who could look at this camera and repair it if possible?\n\ni got a recommendation for contaxrepairs.com, however he won't work on rts ii cameras because of the lack of parts.", "sortedWord": "None", "identifyer": 61059, "year": "2020"}, {"Unnamed: 0": 314133, "autor": "Nitirkallak", "date": 1608378476000, "content": "Nikon FM2n and 36 exposure film /!/ Hello all,\n\nI am not sure if it is the right place for the question and I apologize if it’s not.\nI am usually using 24 exposure films with my FM2n but this time I had a roll of 36 so I tried.\n\nEverything was fine until I reached the position 24. After that for each pose when I wanted to advance the film I had to press the film rewind button the use the film advance lever (and repeat 3 times).\nAt first I thought there was some issue but I tried again with a 24 film and no issue.\n\nIs this something normal for 36 exposures films and FM2n or was it a mechanical bug ? \n\nThank you for your guidance", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kg6f4y/nikon_fm2n_and_36_exposure_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon fm2n and 36 exposure film /!/ hello all,\n\ni am not sure if it is the right place for the question and i apologize if it’s not.\ni am usually using 24 exposure films with my fm2n but this time i had a roll of 36 so i tried.\n\neverything was fine until i reached the -----> position !!!  24. after that for each pose when i wanted to advance the film i had to press the film rewind button the use the film advance lever (and repeat 3 times).\nat first i thought there was some issue but i tried again with a 24 film and no issue.\n\nis this something normal for 36 exposures films and fm2n or was it a mechanical bug ? \n\nthank you for your guidance", "sortedWord": "None", "identifyer": 61213, "year": "2020"}, {"Unnamed: 0": 314150, "autor": "cthooligan", "date": 1608331644000, "content": "DOA Olympus mju-II zoom 170 /!/ Bought a second hand Olympus mju-II zoom 170 off marketplace and this camera looks completely unused, in immaculate condition. \n\nBought a new battery, installed said battery and discovered this camera is completely dead when trying to open the clamshell to turn it on. Zero indication of anything working. \n\nOpened up the body and cleaned the already spotless contacts to no avail. Tested the voltage at the VCC pins of some of the visible chips and it was all reading either 3V or just under. Voltage across the terminals that are connected when the clamshell is in the \"on\" position was roughly 1.5V though.\n\nAny thoughts on what could be wrong with this camera?\nhttps://i.imgur.com/2GH7g3w.jpg https://i.imgur.com/pNiE0H9.jpg https://i.imgur.com/mOIRQgh.jpg https://i.imgur.com/wNsUVfs.jpg", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kfvm64/doa_olympus_mjuii_zoom_170/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "doa olympus mju-ii zoom 170 /!/ bought a second hand olympus mju-ii zoom 170 off marketplace and this camera looks completely unused, in immaculate condition. \n\nbought a new battery, installed said battery and discovered this camera is completely dead when trying to open the clamshell to turn it on. zero indication of anything working. \n\nopened up the body and cleaned the already spotless contacts to no avail. tested the voltage at the vcc pins of some of the visible chips and it was all reading either 3v or just under. voltage across the terminals that are connected when the clamshell is in the \"on\" -----> position !!!  was roughly 1.5v though.\n\nany thoughts on what could be wrong with this camera?\nhttps://i.imgur.com/2gh7g3w.jpg https://i.imgur.com/pnie0h9.jpg https://i.imgur.com/moirqgh.jpg https://i.imgur.com/wnsuvfs.jpg", "sortedWord": "None", "identifyer": 61230, "year": "2020"}, {"Unnamed: 0": 314242, "autor": "nvspace126", "date": 1608606856000, "content": "FED5 Shutter Repair /!/ I started playing around with a FED5 that I received as a gag gift from my great-uncle. After I shot a roll of film with it and got it developed, I noticed some shots being complete or partial exposure white-outs, but others being completely fine. Upon playing around with the shutter a bit more, I noticed that when I set the shutter speed below 1/250, the shutter curtain stays partially open following a shot and the shutter dial doesn't go to the default position. If I pull just slightly on the shutter speed dial, everything resets as it should.\n\nI was wondering if this was something that could be fixed easily on my own (no prior experience in this area) or would it be worth it for a shop to do it price wise?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/khwuud/fed5_shutter_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fed5 shutter repair /!/ i started playing around with a fed5 that i received as a gag gift from my great-uncle. after i shot a roll of film with it and got it developed, i noticed some shots being complete or partial exposure white-outs, but others being completely fine. upon playing around with the shutter a bit more, i noticed that when i set the shutter speed below 1/250, the shutter curtain stays partially open following a shot and the shutter dial doesn't go to the default -----> position !!! . if i pull just slightly on the shutter speed dial, everything resets as it should.\n\ni was wondering if this was something that could be fixed easily on my own (no prior experience in this area) or would it be worth it for a shop to do it price wise?", "sortedWord": "None", "identifyer": 61325, "year": "2020"}, {"Unnamed: 0": 314488, "autor": "yourrooommate", "date": 1579379507000, "content": "Need help! Mamiya RB67 Shutter Cocking Lever stuck /!/ Just bought a Mamiya RB67, and I’m shooting my first roll with it. Everything was fine until my third shot, now the shutter cocking lever is stuck in the upright position and won’t budge. I turned the shutter speed ring to the one second marking to try to release the shutter, still nothing. I’m not sure what to do, I don’t want to force it down and break the body.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eqlvux/need_help_mamiya_rb67_shutter_cocking_lever_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "need help! mamiya rb67 shutter cocking lever stuck /!/ just bought a mamiya rb67, and i’m shooting my first roll with it. everything was fine until my third shot, now the shutter cocking lever is stuck in the upright -----> position !!!  and won’t budge. i turned the shutter speed ring to the one second marking to try to release the shutter, still nothing. i’m not sure what to do, i don’t want to force it down and break the body.", "sortedWord": "None", "identifyer": 61573, "year": "2020"}, {"Unnamed: 0": 314696, "autor": "PeculiarPeter", "date": 1584673689000, "content": "Purchased an OM10 described as \"new\" but came in the mail with a faulty shutter mechanism. Is this worth fixing? /!/ Purchased this OM10 from a listing on Mercari, item was described as \"new.\" Got it in the mail today to find out the film advance lever was not budging, so I took the lens cap off to see that the mirror was not fully down, and the shutter curtain was all crumpled out of place. I tried to get the mirror to close completely but only managed to lock it in the up position, as pictured. I can lock the mirror down with a small lever near the front of the lens mount, but after pressing the shutter release the mirror only stays up, curtains don't move. From looking at the pics below, is this fixable? Or am I better off returning the camera back to the owner?\n\nBTW I also put some batteries in it to test the camera, used some from my X700 body that I knew had some juice in em but the battery check on the OM10 was silent. So I'm not sure if this whole body is just busted or not.\n\nRest of the camera seems to be in good condition, looks really clean.\n\nPICS: https://imgur.com/a/p29z8go", "link": "https://www.reddit.com/r/AnalogCommunity/comments/flnlrw/purchased_an_om10_described_as_new_but_came_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "purchased an om10 described as \"new\" but came in the mail with a faulty shutter mechanism. is this worth fixing? /!/ purchased this om10 from a listing on mercari, item was described as \"new.\" got it in the mail today to find out the film advance lever was not budging, so i took the lens cap off to see that the mirror was not fully down, and the shutter curtain was all crumpled out of place. i tried to get the mirror to close completely but only managed to lock it in the up -----> position !!! , as pictured. i can lock the mirror down with a small lever near the front of the lens mount, but after pressing the shutter release the mirror only stays up, curtains don't move. from looking at the pics below, is this fixable? or am i better off returning the camera back to the owner?\n\nbtw i also put some batteries in it to test the camera, used some from my x700 body that i knew had some juice in em but the battery check on the om10 was silent. so i'm not sure if this whole body is just busted or not.\n\nrest of the camera seems to be in good condition, looks really clean.\n\npics: https://imgur.com/a/p29z8go", "sortedWord": "None", "identifyer": 61785, "year": "2020"}, {"Unnamed: 0": 314835, "autor": "Themasterofcomedy209", "date": 1589223669000, "content": "Nikon F3 manual shutter release jammed? /!/ I recently picked up a Nikon F3, practically unused.  However, the manual shutter release lever is jammed in the upright locked position. I've tried basically everything to get it to move but I'm afraid of breaking it. \n\n\nIt's not a big deal if the lever is just jammed and won't work, since the electronic shutter is perfect. But I wanted to make sure I'm not just being stupid. Thanks!\n\n\n(I bought this from someone who just sells random stuff like this, they got it from someone else so I can't ask the previous owner)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ghu01o/nikon_f3_manual_shutter_release_jammed/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon f3 manual shutter release jammed? /!/ i recently picked up a nikon f3, practically unused.  however, the manual shutter release lever is jammed in the upright locked -----> position !!! . i've tried basically everything to get it to move but i'm afraid of breaking it. \n\n\nit's not a big deal if the lever is just jammed and won't work, since the electronic shutter is perfect. but i wanted to make sure i'm not just being stupid. thanks!\n\n\n(i bought this from someone who just sells random stuff like this, they got it from someone else so i can't ask the previous owner)", "sortedWord": "None", "identifyer": 61925, "year": "2020"}, {"Unnamed: 0": 314870, "autor": "alkalotolerant", "date": 1589148261000, "content": "Making Lumen Prints From Negatives? /!/ &amp;#x200B;\n\nhttps://preview.redd.it/3sr3osgwc0y41.jpg?width=2993&amp;format=pjpg&amp;auto=webp&amp;s=f137cf1b00b4d9f868dbd1822f2f76c874b54cb7\n\nI've seen some cool work done with lumen prints recently, and the process interested me, so I thought I'd give it a try today. In lieu of glass, I held a 4x5 negative against a sheet of photo paper with clothespins and Scotch tape (Ilford Multigrade IV RC Deluxe - Glossy). I exposed it to midday sunlight for an hour. It had a bluish tint which turned pink/purple after fixing for 2 minutes (Ilford Rapid Fixer 1+4).\n\nI was excited to see that the process (more or less) worked! I see a lot of lumen prints made with plants and other materials, but I wasn't sure what to expect with a negative. I'm not in a position to be able to do contact prints at home, but this could be a wacky alternative method of making positives from film.\n\nThe above image has digitally-enhanced contrast, as the print itself is pretty faint. I guess I'm curious to know if any of y'all have tried this process. Any tips re: exposure time, increasing contrast, how different papers/chemicals might shift colors differently, etc.?\n\nHoping to pick up some glass tomorrow and play around with this some more, but I thought I'd see if anyone else has ideas/experience. My setup and the negative are below, for reference.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pee7xlt2g0y41.jpg?width=2304&amp;format=pjpg&amp;auto=webp&amp;s=7108e25a6faed2439ab749d9ff110476a4d340cd\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hybkujv3g0y41.jpg?width=5469&amp;format=pjpg&amp;auto=webp&amp;s=7c3f1eaeab3c96cfaab935e371f461340a68ac34", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ghan4q/making_lumen_prints_from_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "making lumen prints from negatives? /!/ &amp;#x200b;\n\nhttps://preview.redd.it/3sr3osgwc0y41.jpg?width=2993&amp;format=pjpg&amp;auto=webp&amp;s=f137cf1b00b4d9f868dbd1822f2f76c874b54cb7\n\ni've seen some cool work done with lumen prints recently, and the process interested me, so i thought i'd give it a try today. in lieu of glass, i held a 4x5 negative against a sheet of photo paper with clothespins and scotch tape (ilford multigrade iv rc deluxe - glossy). i exposed it to midday sunlight for an hour. it had a bluish tint which turned pink/purple after fixing for 2 minutes (ilford rapid fixer 1+4).\n\ni was excited to see that the process (more or less) worked! i see a lot of lumen prints made with plants and other materials, but i wasn't sure what to expect with a negative. i'm not in a -----> position !!!  to be able to do contact prints at home, but this could be a wacky alternative method of making positives from film.\n\nthe above image has digitally-enhanced contrast, as the print itself is pretty faint. i guess i'm curious to know if any of y'all have tried this process. any tips re: exposure time, increasing contrast, how different papers/chemicals might shift colors differently, etc.?\n\nhoping to pick up some glass tomorrow and play around with this some more, but i thought i'd see if anyone else has ideas/experience. my setup and the negative are below, for reference.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/pee7xlt2g0y41.jpg?width=2304&amp;format=pjpg&amp;auto=webp&amp;s=7108e25a6faed2439ab749d9ff110476a4d340cd\n\n&amp;#x200b;\n\nhttps://preview.redd.it/hybkujv3g0y41.jpg?width=5469&amp;format=pjpg&amp;auto=webp&amp;s=7c3f1eaeab3c96cfaab935e371f461340a68ac34", "sortedWord": "None", "identifyer": 61960, "year": "2020"}, {"Unnamed: 0": 315215, "autor": "socksandteaz", "date": 1606529689000, "content": "MAMIYA 645 SHUTTER STUCK /!/ the shutter is in the up position after winding to the frost frame. It won’t go down and I am afraid of the cost to get it repaired. Any thoughts?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k2eyit/mamiya_645_shutter_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mamiya 645 shutter stuck /!/ the shutter is in the up -----> position !!!  after winding to the frost frame. it won’t go down and i am afraid of the cost to get it repaired. any thoughts?", "sortedWord": "None", "identifyer": 62310, "year": "2020"}, {"Unnamed: 0": 315581, "autor": "Nawrat87", "date": 1593606640000, "content": "How can I turn self-timer knob back to actual position in Olympus 35RC?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hj99ry/how_can_i_turn_selftimer_knob_back_to_actual/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how can i turn self-timer knob back to actual -----> position !!!  in olympus 35rc?", "sortedWord": "None", "identifyer": 62682, "year": "2020"}, {"Unnamed: 0": 315817, "autor": "cchinita", "date": 1585843766000, "content": "Stuck mirror repair /!/ I am trying to fix my mirror which is stuck in the up position. For context, my camera is a Pentax Asahi SV and pls know I am a newbie and literally got this camera yday. Anyways, I was able to take off the base and see which gear is a little laggy and needs lube. My question is, what should I be using on the camera for lube? Many peoples have said to avoid WD-40 and some have suggested sewing machine oil. \n\nAny and all feedback/suggestions are welcomed! 🤠", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ftp1e8/stuck_mirror_repair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "stuck mirror repair /!/ i am trying to fix my mirror which is stuck in the up -----> position !!! . for context, my camera is a pentax asahi sv and pls know i am a newbie and literally got this camera yday. anyways, i was able to take off the base and see which gear is a little laggy and needs lube. my question is, what should i be using on the camera for lube? many peoples have said to avoid wd-40 and some have suggested sewing machine oil. \n\nany and all feedback/suggestions are welcomed! 🤠", "sortedWord": "None", "identifyer": 62921, "year": "2020"}, {"Unnamed: 0": 315934, "autor": "yggdra_omega", "date": 1586313939000, "content": "Should I keep my Mamiya 7 II kit, or my Hasselblad 500C/M kit? /!/ Mamiya 7 II with 43mm, 80mm, and 150mm lenses, or Hasselblad 500C/M with 80mm f2.8 lens.\n\nI am trying to downsize my collection, but I'm having a hard time deciding which of my medium format cameras to keep. I can get so much more money for the Mamiya kit than the Hassy, but the Mamiya is much easier to walk around and use. Are the Hasselblad optics subjectively any better than the Mamiya 7's? Has anyone else been in the same position? \n\nIf you guys could post some opinions, I would truly appreciate it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fwya70/should_i_keep_my_mamiya_7_ii_kit_or_my_hasselblad/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i keep my mamiya 7 ii kit, or my hasselblad 500c/m kit? /!/ mamiya 7 ii with 43mm, 80mm, and 150mm lenses, or hasselblad 500c/m with 80mm f2.8 lens.\n\ni am trying to downsize my collection, but i'm having a hard time deciding which of my medium format cameras to keep. i can get so much more money for the mamiya kit than the hassy, but the mamiya is much easier to walk around and use. are the hasselblad optics subjectively any better than the mamiya 7's? has anyone else been in the same -----> position !!! ? \n\nif you guys could post some opinions, i would truly appreciate it.", "sortedWord": "None", "identifyer": 63043, "year": "2020"}, {"Unnamed: 0": 315954, "autor": "DStPhoto", "date": 1586238923000, "content": "Salvaging a Crown Graphic Special /!/ TLDR at bottom\n\nAbout 12-13 years ago my aunts basement got flooded. While she was cleaning it out she came upon a Crown Graphic Special and gave it to me since at the time I was taking photography courses at university. I cleaned it up as much as I could at the time and tried to get it working. The best I could do was taking long exposure photos on photo paper. The reason being that the shutter (synchro-compur) F4.7) no longer works. I can manually open and close the shutter and the aperture still worked. \n\nNow a decade plus later I would like to get back into large format. Looking at the camera now, there is some very slight surface rust on the lens board as well as on the shutter and apature leafs. The shutter button/cable gets stuck in the down position after pressing the button. Ideally my goal would be to get this back to working without having to spend more then $50-75.\n\nI was hoping to get some insight on what I should expect, any helpful tips or things to be aware of.\n\nI also had a few questions I was hoping to find the answer about. \n1: How do I remove the shutter from the lens board? It is threaded and looks like it should just twist out but nothing I can do budges it. \n\n2: If I cannot fix the shutter what should I look for in a new one? Is there an easy way to know if a used shutter will fit my specific lens board? \nIs it better to get a lens and shutter together or just screw on the lens that is on my current shutter?  Any recommendations?\n\n3: For the shutter button and cable can I just use some wd-40 and lubricate it that way or is there a specific lubricant for camera I should use?\n\nI have done some internet sleuthing but did not find the information I was hoping for. \n\nThank you for any help.\n\nTLDR: Press Camera when through a flood a decade ago, now trying to salvage it. Bad shutter.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fwf3qd/salvaging_a_crown_graphic_special/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "salvaging a crown graphic special /!/ tldr at bottom\n\nabout 12-13 years ago my aunts basement got flooded. while she was cleaning it out she came upon a crown graphic special and gave it to me since at the time i was taking photography courses at university. i cleaned it up as much as i could at the time and tried to get it working. the best i could do was taking long exposure photos on photo paper. the reason being that the shutter (synchro-compur) f4.7) no longer works. i can manually open and close the shutter and the aperture still worked. \n\nnow a decade plus later i would like to get back into large format. looking at the camera now, there is some very slight surface rust on the lens board as well as on the shutter and apature leafs. the shutter button/cable gets stuck in the down -----> position !!!  after pressing the button. ideally my goal would be to get this back to working without having to spend more then $50-75.\n\ni was hoping to get some insight on what i should expect, any helpful tips or things to be aware of.\n\ni also had a few questions i was hoping to find the answer about. \n1: how do i remove the shutter from the lens board? it is threaded and looks like it should just twist out but nothing i can do budges it. \n\n2: if i cannot fix the shutter what should i look for in a new one? is there an easy way to know if a used shutter will fit my specific lens board? \nis it better to get a lens and shutter together or just screw on the lens that is on my current shutter?  any recommendations?\n\n3: for the shutter button and cable can i just use some wd-40 and lubricate it that way or is there a specific lubricant for camera i should use?\n\ni have done some internet sleuthing but did not find the information i was hoping for. \n\nthank you for any help.\n\ntldr: press camera when through a flood a decade ago, now trying to salvage it. bad shutter.", "sortedWord": "None", "identifyer": 63063, "year": "2020"}, {"Unnamed: 0": 316212, "autor": "johnHmalone", "date": 1587393347000, "content": "Nikonos V Shutter Advance /!/ Hello fellow Nikonos owners! I got a real nice cosmetic copy of a nikonos 5 off eBay a few weeks back. I changed out all the o rings and it seemed to be working like a champ. Ran 2 rolls thru it so far and they came out great and the camera operates flawlessly. Yesterday though, I loaded up a new roll and went to cock the shutter and the lever didn’t spring back like it did previously. I’d cock it, then have to manually bring it back to the rest position. Any idea as to why this happened out of nowhere? Previously the recoil was nice and strong. Is this an issue or can I just continue shooting with it?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g4twoo/nikonos_v_shutter_advance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikonos v shutter advance /!/ hello fellow nikonos owners! i got a real nice cosmetic copy of a nikonos 5 off ebay a few weeks back. i changed out all the o rings and it seemed to be working like a champ. ran 2 rolls thru it so far and they came out great and the camera operates flawlessly. yesterday though, i loaded up a new roll and went to cock the shutter and the lever didn’t spring back like it did previously. i’d cock it, then have to manually bring it back to the rest -----> position !!! . any idea as to why this happened out of nowhere? previously the recoil was nice and strong. is this an issue or can i just continue shooting with it?", "sortedWord": "None", "identifyer": 63323, "year": "2020"}, {"Unnamed: 0": 316272, "autor": "nickbeume", "date": 1588082937000, "content": "Leica mini does not advance film /!/ Hi! As mentioned my Leica mini does not advance the film. Works perfectly without film inside of it. But when I load a film the number one flashes for 5 sec and in turns off. I then open and the film is in the same position. Again, the camera, shutter, flash, and everything works without the film inside of it. I took it apart but it looked like Chinese for me and I got an electric shock, so I put it back together.   \n\n\nHow do I fix this?   \n\n\nPs. no need to answer if you will write bring it in for reparation.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g9nuuv/leica_mini_does_not_advance_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica mini does not advance film /!/ hi! as mentioned my leica mini does not advance the film. works perfectly without film inside of it. but when i load a film the number one flashes for 5 sec and in turns off. i then open and the film is in the same -----> position !!! . again, the camera, shutter, flash, and everything works without the film inside of it. i took it apart but it looked like chinese for me and i got an electric shock, so i put it back together.   \n\n\nhow do i fix this?   \n\n\nps. no need to answer if you will write bring it in for reparation.", "sortedWord": "None", "identifyer": 63385, "year": "2020"}, {"Unnamed: 0": 316628, "autor": "Ladybat_jiam", "date": 1598768478000, "content": "How to reach the ''perfect'' analog photo? /!/ Hey, I never had a non-automatic camera and I started taking pictures with an analog camera, to be more precise a Canonet QL25 w/ lens 45mm.\n\nI kinda have a problem with liking my photos. There are always something that brothers me. On some photos its the position I took them, other the light, and sometimes it's literally the thing/object/human I capture on the photo... I feel like the aren't ''perfect'' or even close to that...  \nI tried to watch some videos for beginners but I still feel like I missed something...\n\nDo you edit your analog photos, to correct the ligth and edit the colors,you know.. to be more close to your ''perfect'' photo?\n\nSince this an Analog community I hope you can help me, even if it's with criticism or just with your honest advice!\n\nhttps://preview.redd.it/d2yexdv613k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=a453879f05b842c6ef685bff2341f518c45ecce2\n\nhttps://preview.redd.it/brbiosz513k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=3bdb17c2a27c32576cf2c32435ee8fe26ecab132\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7edgcsie13k51.jpg?width=1357&amp;format=pjpg&amp;auto=webp&amp;s=ee1cbeefc34a3ee7d8c31d8fc1fa33267ea76f2f\n\nhttps://preview.redd.it/wpktxxcd13k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=22810c224298edc188e007f0e9657266b1f5b1b7\n\nhttps://preview.redd.it/x7of437813k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=acfbd93d337af70e95782b0346cb488ddca73552\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nsorry for the photo spam, Ty for reading  \n\\*repost bc I had an error on the title\\*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ij84m6/how_to_reach_the_perfect_analog_photo/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to reach the ''perfect'' analog photo? /!/ hey, i never had a non-automatic camera and i started taking pictures with an analog camera, to be more precise a canonet ql25 w/ lens 45mm.\n\ni kinda have a problem with liking my photos. there are always something that brothers me. on some photos its the -----> position !!!  i took them, other the light, and sometimes it's literally the thing/object/human i capture on the photo... i feel like the aren't ''perfect'' or even close to that...  \ni tried to watch some videos for beginners but i still feel like i missed something...\n\ndo you edit your analog photos, to correct the ligth and edit the colors,you know.. to be more close to your ''perfect'' photo?\n\nsince this an analog community i hope you can help me, even if it's with criticism or just with your honest advice!\n\nhttps://preview.redd.it/d2yexdv613k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=a453879f05b842c6ef685bff2341f518c45ecce2\n\nhttps://preview.redd.it/brbiosz513k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=3bdb17c2a27c32576cf2c32435ee8fe26ecab132\n\n&amp;#x200b;\n\nhttps://preview.redd.it/7edgcsie13k51.jpg?width=1357&amp;format=pjpg&amp;auto=webp&amp;s=ee1cbeefc34a3ee7d8c31d8fc1fa33267ea76f2f\n\nhttps://preview.redd.it/wpktxxcd13k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=22810c224298edc188e007f0e9657266b1f5b1b7\n\nhttps://preview.redd.it/x7of437813k51.jpg?width=1708&amp;format=pjpg&amp;auto=webp&amp;s=acfbd93d337af70e95782b0346cb488ddca73552\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nsorry for the photo spam, ty for reading  \n\\*repost bc i had an error on the title\\*", "sortedWord": "None", "identifyer": 63747, "year": "2020"}, {"Unnamed: 0": 316635, "autor": "guitarf1", "date": 1598760640000, "content": "Epson V600 - Strange ~20px banding around edge facing open glass with darker photo prints. Is this normal? Happens with both Epson Scan and VueScan so I'm not sure if it's software related. Also happened with an older V600. And if I offset the horizontal scan position, the band is gone...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ij6luz/epson_v600_strange_20px_banding_around_edge/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "epson v600 - strange ~20px banding around edge facing open glass with darker photo prints. is this normal? happens with both epson scan and vuescan so i'm not sure if it's software related. also happened with an older v600. and if i offset the horizontal scan -----> position !!! , the band is gone...", "sortedWord": "None", "identifyer": 63754, "year": "2020"}, {"Unnamed: 0": 316676, "autor": "verbintofuzz", "date": 1597403653000, "content": "[NEED HELP] picked this up the other day but mirror is stuck in ‘up’ position - don’t know how to get it down!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i9k2ac/need_help_picked_this_up_the_other_day_but_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[need help] picked this up the other day but mirror is stuck in ‘up’ -----> position !!!  - don’t know how to get it down!", "sortedWord": "None", "identifyer": 63796, "year": "2020"}, {"Unnamed: 0": 316909, "autor": "discodogs", "date": 1587879079000, "content": "Canon AE-1 Program - Film advance level stuck /!/ Relatively new to shooting film but I’ve shot about five rolls on this camera with no issues at all until today. I’m halfway through a roll of film and the film advance lever won’t extend the whole way. \n\nI’ve tried changing the battery and I’ve checked the mirror position and there’s no issues there. Does anyone have any suggestions? Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g88vrm/canon_ae1_program_film_advance_level_stuck/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "canon ae-1 program - film advance level stuck /!/ relatively new to shooting film but i’ve shot about five rolls on this camera with no issues at all until today. i’m halfway through a roll of film and the film advance lever won’t extend the whole way. \n\ni’ve tried changing the battery and i’ve checked the mirror -----> position !!!  and there’s no issues there. does anyone have any suggestions? thanks!", "sortedWord": "None", "identifyer": 64035, "year": "2020"}], "name": "positionAnalogCommunity2020"}