{"interestingcomments": [{"Unnamed: 0": 128563, "autor": "JamesVanDaFreek", "date": 1519797732000, "content": "Help, my negatives are a mess. /!/ I just got back into film at the beginning of the year.  I'm home developing b&amp;w, but I just can't get clean negatives.\n\nThey have water marks, streaks, spots and scratches.\n\nFor example, I shot this Tri-X over the weekend.\n\nhttps://i.imgur.com/j1ptGtN.jpg\n\nMy process is this:\n\nI'm using D-76 developer at a 1:1 dilution, water as a stop bath, and regular Kodak fixer.\n\nI'm not using any Hypo, just a 10 minute wash under running water, then a small bit of Photo-flo at the end, 5 second agitation, and then hang to dry.\n\nI don't have a squeegie, just wet my fingers and lightly run them down the film once immediately after hanging the negatives up.\n\nWhat am I doing wrong, what can I add to help?\n\nBONUS QUESTION:  What is your go-to method for cleaning streaks and water marks from film?\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/80trq0/help_my_negatives_are_a_mess/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help, my negatives are a mess. /!/ i just got back into film at the beginning of the year.  i'm home developing b&amp;w, but i just can't get clean negatives.\n\nthey have water marks, streaks, -----> spots !!!  and scratches.\n\nfor example, i shot this tri-x over the weekend.\n\nhttps://i.imgur.com/j1ptgtn.jpg\n\nmy process is this:\n\ni'm using d-76 developer at a 1:1 dilution, water as a stop bath, and regular kodak fixer.\n\ni'm not using any hypo, just a 10 minute wash under running water, then a small bit of photo-flo at the end, 5 second agitation, and then hang to dry.\n\ni don't have a squeegie, just wet my fingers and lightly run them down the film once immediately after hanging the negatives up.\n\nwhat am i doing wrong, what can i add to help?\n\nbonus question:  what is your go-to method for cleaning streaks and water marks from film?\n\n", "sortedWord": "None", "identifyer": 19257, "year": "2018"}, {"Unnamed: 0": 128777, "autor": "jmandell42", "date": 1542230414000, "content": "Is this a light leak? Just got the first shots back from the lab and can't figure out what that bright spot is", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9x4a3u/is_this_a_light_leak_just_got_the_first_shots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this a light leak? just got the first shots back from the lab and can't figure out what that bright -----> spot !!!  is", "sortedWord": "None", "identifyer": 19474, "year": "2018"}, {"Unnamed: 0": 128897, "autor": "thingpaint", "date": 1519139469000, "content": "C-41 &amp; Photo Flo /!/ I've got a problem, my tap water is SUPER hard. Even through a water softener. If tap water gets anywhere near my film I get water spots. \n\n\nThis isn't a problem for B&amp;W because photo flo is magic and makes all water spots go away.\n\n\nIt is a problem for C-41 though. The 3 min wash just isn't feasible in distilled water so I need to use tap water. I know I can't use photo flo after I stabilize because that will wash the stabilizer off. \n\n\nCan I add it to the stabilizer? I'm worried mixed photo flo goes moldy, but I also know stabilizer has an anti mold agent. \n\n\nCan I do it before the stabilizer? \n\n\nIs there a product specifically for C-41 that I'm missing?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/7ywkah/c41_photo_flo/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "c-41 &amp; photo flo /!/ i've got a problem, my tap water is super hard. even through a water softener. if tap water gets anywhere near my film i get water -----> spots !!! . \n\n\nthis isn't a problem for b&amp;w because photo flo is magic and makes all water spots go away.\n\n\nit is a problem for c-41 though. the 3 min wash just isn't feasible in distilled water so i need to use tap water. i know i can't use photo flo after i stabilize because that will wash the stabilizer off. \n\n\ncan i add it to the stabilizer? i'm worried mixed photo flo goes moldy, but i also know stabilizer has an anti mold agent. \n\n\ncan i do it before the stabilizer? \n\n\nis there a product specifically for c-41 that i'm missing?", "sortedWord": "None", "identifyer": 19594, "year": "2018"}, {"Unnamed: 0": 129083, "autor": "mt_winston", "date": 1540783944000, "content": "How to Remove Dust on Negatives /!/ Hello,\n\nI self-developed my black and white 35mm negatives, (I’ve done it numerous times) and for the first time, there is what I assume to be dust ALL over the negatives. Whether I print using an enlarger or I scan them, the white spots and squiggly lines appear on nearly every shot.\n\nI have retraced my steps countless times, and can’t figure out where the heck this all happened. As I said, I’ve developed in the same room before and I didn’t see this occur. So what changed?\n\nHas this happened to anyone before? Any ideas on how I may be able to fix this if at all possible?\n\nExampled: [https://imgur.com/O47iZrw](https://imgur.com/O47iZrw)\n\nThanks a lot in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9s9nyv/how_to_remove_dust_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how to remove dust on negatives /!/ hello,\n\ni self-developed my black and white 35mm negatives, (i’ve done it numerous times) and for the first time, there is what i assume to be dust all over the negatives. whether i print using an enlarger or i scan them, the white -----> spots !!!  and squiggly lines appear on nearly every shot.\n\ni have retraced my steps countless times, and can’t figure out where the heck this all happened. as i said, i’ve developed in the same room before and i didn’t see this occur. so what changed?\n\nhas this happened to anyone before? any ideas on how i may be able to fix this if at all possible?\n\nexampled: [https://imgur.com/o47izrw](https://imgur.com/o47izrw)\n\nthanks a lot in advance.", "sortedWord": "None", "identifyer": 19782, "year": "2018"}, {"Unnamed: 0": 129093, "autor": "pomcuter", "date": 1540710691000, "content": "Spotted a Nishika N8000 with a Nimslo flash on the 1988 film \"Earth Girls are Easy\" starring Geena Davis, Jeff Goldblum, Damon Wayans, and Jim Carrey.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9s1fbq/spotted_a_nishika_n8000_with_a_nimslo_flash_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  a nishika n8000 with a nimslo flash on the 1988 film \"earth girls are easy\" starring geena davis, jeff goldblum, damon wayans, and jim carrey.", "sortedWord": "None", "identifyer": 19792, "year": "2018"}, {"Unnamed: 0": 129122, "autor": "feist1", "date": 1540404758000, "content": "Anyone had purple lens flare in the shape of an octagon before? /!/ Using an hoya hmc uv(c) filter on a 28mm elmarit.\n\n[Here's an example](https://i.imgur.com/Qu7GwkG.png)\n\nIt's happened twice, in the same spot, middle of frame then just a bit lower.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9r25xd/anyone_had_purple_lens_flare_in_the_shape_of_an/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone had purple lens flare in the shape of an octagon before? /!/ using an hoya hmc uv(c) filter on a 28mm elmarit.\n\n[here's an example](https://i.imgur.com/qu7gwkg.png)\n\nit's happened twice, in the same -----> spot !!! , middle of frame then just a bit lower.", "sortedWord": "None", "identifyer": 19821, "year": "2018"}, {"Unnamed: 0": 129297, "autor": "analogweekend", "date": 1526779517000, "content": "is this new packaging? spotted at walmart", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8kpll8/is_this_new_packaging_spotted_at_walmart/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "is this new packaging? -----> spotted !!!  at walmart", "sortedWord": "None", "identifyer": 19999, "year": "2018"}, {"Unnamed: 0": 129369, "autor": "Eddie_skis", "date": 1536629927000, "content": "Rainy morning project (canon 50mm 1.8ltm) /!/ Recently picked up this canon 50mm 1.8ltm for $65 along with a canon 7. Took it apart to clean a tiny spot of fungus and a good bit of dust. Thankfully there is no balsam separation in the rear doublet (a common issue with these). ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9et68c/rainy_morning_project_canon_50mm_18ltm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "rainy morning project (canon 50mm 1.8ltm) /!/ recently picked up this canon 50mm 1.8ltm for $65 along with a canon 7. took it apart to clean a tiny -----> spot !!!  of fungus and a good bit of dust. thankfully there is no balsam separation in the rear doublet (a common issue with these). ", "sortedWord": "None", "identifyer": 20072, "year": "2018"}, {"Unnamed: 0": 129422, "autor": "SSJ4LYF", "date": 1536190170000, "content": "Shanghai /!/ Trying to organise a semi regular meet up. Starting this Saturday. DM if you are interested, and we can connect on Wechat. Just a place to talk shit about cameras, spots, pictures and have a pint. Few people are keen. Venue tbc.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9dcaye/shanghai/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "shanghai /!/ trying to organise a semi regular meet up. starting this saturday. dm if you are interested, and we can connect on wechat. just a place to talk shit about cameras, -----> spots !!! , pictures and have a pint. few people are keen. venue tbc.", "sortedWord": "None", "identifyer": 20125, "year": "2018"}, {"Unnamed: 0": 129483, "autor": "Natsukvshii", "date": 1545935756000, "content": "Question about c-41 developer /!/ Hey guys! So I’ve developed maybe 5-6 rolls of 35mm and about 3-4 rolls of 120 film by now. The chemistry I’m using was mixed 11/20/2018 and I haven’t used it in about a week and a half so it’s been sitting undisturbed. I store them in glass amber bottles in the basement of my house in a dark spot and I grabbed the developer earlier and I noticed some weird stuff floating around in it. It was some thin strips of darkness, I didn’t get a good look at it but when I mixed the bottle they went away. Could it be that the chemistry is just separating? Or is my developer dead and I should get new chems? Does anyone know what it could be? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aa1sra/question_about_c41_developer/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question about c-41 developer /!/ hey guys! so i’ve developed maybe 5-6 rolls of 35mm and about 3-4 rolls of 120 film by now. the chemistry i’m using was mixed 11/20/2018 and i haven’t used it in about a week and a half so it’s been sitting undisturbed. i store them in glass amber bottles in the basement of my house in a dark -----> spot !!!  and i grabbed the developer earlier and i noticed some weird stuff floating around in it. it was some thin strips of darkness, i didn’t get a good look at it but when i mixed the bottle they went away. could it be that the chemistry is just separating? or is my developer dead and i should get new chems? does anyone know what it could be? ", "sortedWord": "None", "identifyer": 20188, "year": "2018"}, {"Unnamed: 0": 129528, "autor": "never_mind_the_egg", "date": 1545569111000, "content": "First time developing b/w film at home, streak across film and light spots around sprockets. Help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a8ue4b/first_time_developing_bw_film_at_home_streak/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "first time developing b/w film at home, streak across film and light -----> spots !!!  around sprockets. help!", "sortedWord": "None", "identifyer": 20234, "year": "2018"}, {"Unnamed: 0": 129693, "autor": "reynold_is", "date": 1531135985000, "content": "Pentax Spot Meter V Battery /!/ Hi all, I was wondering if anyone could help. I've got an old analog spot meter and can't figure out the batteries to use. I've googled a bit and can't seem to find a consensus on what battery to use, an old pdf of the manual says it used g13 type mercury batteries. There's a lot of mention of lr44s, which I bought but are way too small. It seems the meter takes two kinds of batteries as well, a 9v bigger block along with the smaller button types.\n\nAnybody who has this type of meter or anyone with any advice will be most appreciated, thanks!\n\nHeres the [battery compartment](https://i.imgur.com/a6ouCpF.jpg)\n\nHere's the [top of the meter](https://i.imgur.com/ben5TQr.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8xaql9/pentax_spot_meter_v_battery/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pentax -----> spot !!!  meter v battery /!/ hi all, i was wondering if anyone could help. i've got an old analog spot meter and can't figure out the batteries to use. i've googled a bit and can't seem to find a consensus on what battery to use, an old pdf of the manual says it used g13 type mercury batteries. there's a lot of mention of lr44s, which i bought but are way too small. it seems the meter takes two kinds of batteries as well, a 9v bigger block along with the smaller button types.\n\nanybody who has this type of meter or anyone with any advice will be most appreciated, thanks!\n\nheres the [battery compartment](https://i.imgur.com/a6oucpf.jpg)\n\nhere's the [top of the meter](https://i.imgur.com/ben5tqr.jpg)", "sortedWord": "None", "identifyer": 20401, "year": "2018"}, {"Unnamed: 0": 129734, "autor": "Whatsinyourhands", "date": 1530633915000, "content": "I’m visiting San Francisco next month for the first time. Does anyone know some good spots to check out? /!/ Are there any film stocks you’d suggest or a local camera shop to check out? The city I’m from doesn’t offer much in the way of film or photography so I want to take advantage of this opportunity. \n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8vte4t/im_visiting_san_francisco_next_month_for_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i’m visiting san francisco next month for the first time. does anyone know some good -----> spots !!!  to check out? /!/ are there any film stocks you’d suggest or a local camera shop to check out? the city i’m from doesn’t offer much in the way of film or photography so i want to take advantage of this opportunity. \n\n", "sortedWord": "None", "identifyer": 20442, "year": "2018"}, {"Unnamed: 0": 129951, "autor": "fdrsblanket", "date": 1528318405000, "content": "Any experience with Arax Spot TTL Prism Finder? /!/ I'm looking to get a prism finder for my 500 C/M. Has anyone had any experience with this [offering](http://araxfoto.com/accessories/spot-prism/)? I posted this over in the Hasselblad sub, but the place is a bit dead. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8p4a90/any_experience_with_arax_spot_ttl_prism_finder/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any experience with arax -----> spot !!!  ttl prism finder? /!/ i'm looking to get a prism finder for my 500 c/m. has anyone had any experience with this [offering](http://araxfoto.com/accessories/spot-prism/)? i posted this over in the hasselblad sub, but the place is a bit dead. ", "sortedWord": "None", "identifyer": 20659, "year": "2018"}, {"Unnamed: 0": 129961, "autor": "iLeicadodachacha", "date": 1528212869000, "content": "Light on the borders /!/ So I've noticed that some of my photos tend to be a little lighter towards the borders of the frame and I'm wondering if this is something that anyone else has come across before. \n\nIt doesn't appear on ever frame, and it's not always very noticeable when it does, which makes it hard to spot on the actual negatives as opposed to a true light leak. I'm fairly confident that it's not occurring during development or scanning, though I can't be 100% certain of that, I suspect it may be coming from the rear door of the camera (a Leica M4-P.)\n\n[Example 1](https://imgur.com/a/I8zjvjH)\n[Example 2](https://imgur.com/a/aSAovL0)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8orrus/light_on_the_borders/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light on the borders /!/ so i've noticed that some of my photos tend to be a little lighter towards the borders of the frame and i'm wondering if this is something that anyone else has come across before. \n\nit doesn't appear on ever frame, and it's not always very noticeable when it does, which makes it hard to -----> spot !!!  on the actual negatives as opposed to a true light leak. i'm fairly confident that it's not occurring during development or scanning, though i can't be 100% certain of that, i suspect it may be coming from the rear door of the camera (a leica m4-p.)\n\n[example 1](https://imgur.com/a/i8zjvjh)\n[example 2](https://imgur.com/a/asaovl0)", "sortedWord": "None", "identifyer": 20669, "year": "2018"}, {"Unnamed: 0": 129980, "autor": "vrotographer", "date": 1527889315000, "content": "Cleaning and fixing SLRs /!/ I'm going out later today to purchase a Minolta X-700 and it's in pretty sad condition, from what I can tell from the pictures. Most of it just seems to be on the surface but in an hour or so I'm going to find out how bad it is. I also want to clean up and test my Pentax K1000 and my Nikon FE2.\n\nWith the Nikon and the Pentax, I've wiped down the outsides with a slightly damp cloth and the metal parts with a q-tip and rubbing alcohol. I haven't messed with the insides too much apart from wiping them down with a microfiber cloth. Neither of them are tested either.\n\nHow would I go about making sure everything works and works well? I'm really hoping the Nikon's electronics have held up. Should I replace the light seals right away? Should I try to get rid of the worn spots on the Nikon where the black paint has rubbed off? Should I disassemble the tops of the cameras and look inside at the wiring, or is that too risky?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/8nvqhj/cleaning_and_fixing_slrs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning and fixing slrs /!/ i'm going out later today to purchase a minolta x-700 and it's in pretty sad condition, from what i can tell from the pictures. most of it just seems to be on the surface but in an hour or so i'm going to find out how bad it is. i also want to clean up and test my pentax k1000 and my nikon fe2.\n\nwith the nikon and the pentax, i've wiped down the outsides with a slightly damp cloth and the metal parts with a q-tip and rubbing alcohol. i haven't messed with the insides too much apart from wiping them down with a microfiber cloth. neither of them are tested either.\n\nhow would i go about making sure everything works and works well? i'm really hoping the nikon's electronics have held up. should i replace the light seals right away? should i try to get rid of the worn -----> spots !!!  on the nikon where the black paint has rubbed off? should i disassemble the tops of the cameras and look inside at the wiring, or is that too risky?", "sortedWord": "None", "identifyer": 20688, "year": "2018"}, {"Unnamed: 0": 130266, "autor": "tsuuni", "date": 1535657586000, "content": "Developed my first 120 roll (Ilford HP5+ ISO 400) which was overexposed two stops, didn't die! /!/ I measured all shots with ISO 100 setting on my (DIY) light meter. I was thinking of pull development but after browsing the internetz for a while decided to go with the original ISO development time.\n\nI wish I had a change to scan it this evening but seems that either the wetting agent makes drying slower or 120 films just dry slower. Tried wetting agent also first time because I was getting too much water spots on the film. \n\nI think I will overexpose B&amp;W in future also with one stop or even two stops. I need to scan the film but it surely looks promising when I made fast previews with Loupé. Nothing seems overly exposed! I can post the scans here if interested.\n\nAnyone else overexposing B&amp;W film? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9bmrgi/developed_my_first_120_roll_ilford_hp5_iso_400/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "developed my first 120 roll (ilford hp5+ iso 400) which was overexposed two stops, didn't die! /!/ i measured all shots with iso 100 setting on my (diy) light meter. i was thinking of pull development but after browsing the internetz for a while decided to go with the original iso development time.\n\ni wish i had a change to scan it this evening but seems that either the wetting agent makes drying slower or 120 films just dry slower. tried wetting agent also first time because i was getting too much water -----> spots !!!  on the film. \n\ni think i will overexpose b&amp;w in future also with one stop or even two stops. i need to scan the film but it surely looks promising when i made fast previews with loupé. nothing seems overly exposed! i can post the scans here if interested.\n\nanyone else overexposing b&amp;w film? ", "sortedWord": "None", "identifyer": 20978, "year": "2018"}, {"Unnamed: 0": 130280, "autor": "ken27238", "date": 1535560157000, "content": "Minolta srt 100 acting weird. /!/ I think that it may need servicing. At one point it was dropped and the dented the spot near the exposure counter. It’s stuck at 36 and don’t resent when the film door is opened.\n\nAlso when I advance the film it raises the mirror blocking view finder and only goes back down when I press the shutter release. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9batet/minolta_srt_100_acting_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "minolta srt 100 acting weird. /!/ i think that it may need servicing. at one point it was dropped and the dented the -----> spot !!!  near the exposure counter. it’s stuck at 36 and don’t resent when the film door is opened.\n\nalso when i advance the film it raises the mirror blocking view finder and only goes back down when i press the shutter release. ", "sortedWord": "None", "identifyer": 20992, "year": "2018"}, {"Unnamed: 0": 130331, "autor": "FrenchFryCattaneo", "date": 1541129604000, "content": "A question about washing film after development. /!/ Recently some of the rolls I've developed (c-41, developed in a paterson tank from a unicolor kit) have had water spots when I went to scan them. I gave them another rinse with distilled water, and that seemed to do the trick. My question is, if I develop the film, let it dry, and then rinse it, am I rinsing off or otherwise messing with the stabilizer?\n\nAlso are there any other tips on preventing water spots? I currently add photoflo to the stabilizer, and use a squeegee.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9tglso/a_question_about_washing_film_after_development/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a question about washing film after development. /!/ recently some of the rolls i've developed (c-41, developed in a paterson tank from a unicolor kit) have had water -----> spots !!!  when i went to scan them. i gave them another rinse with distilled water, and that seemed to do the trick. my question is, if i develop the film, let it dry, and then rinse it, am i rinsing off or otherwise messing with the stabilizer?\n\nalso are there any other tips on preventing water spots? i currently add photoflo to the stabilizer, and use a squeegee.", "sortedWord": "None", "identifyer": 21043, "year": "2018"}, {"Unnamed: 0": 130355, "autor": "TiwingHoofd", "date": 1538918316000, "content": "Old darkroom equipment, is it any good /!/ Hi all,\n\nI've started shooting film about a year ago and since then wanted to develop my own films. Just now I've just received a full set of chemicals, photo papers, trays, development tanks and a photo enlarger from a family friend. Haven't got a clue how old this stuff is, the man where it came from stored it all in a dark space etc but once I started looking into some stuff and I could already spot some fungus sitting on a Kodak enlarger exposure scale and a lot of fungus/leakage signs on the boxes of the chemicals. \nThe boxes of the papers are looking fine, but I haven't got a clue how long those can last. Papers where made by Agfa.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9m4z0y/old_darkroom_equipment_is_it_any_good/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "old darkroom equipment, is it any good /!/ hi all,\n\ni've started shooting film about a year ago and since then wanted to develop my own films. just now i've just received a full set of chemicals, photo papers, trays, development tanks and a photo enlarger from a family friend. haven't got a clue how old this stuff is, the man where it came from stored it all in a dark space etc but once i started looking into some stuff and i could already -----> spot !!!  some fungus sitting on a kodak enlarger exposure scale and a lot of fungus/leakage signs on the boxes of the chemicals. \nthe boxes of the papers are looking fine, but i haven't got a clue how long those can last. papers where made by agfa.", "sortedWord": "None", "identifyer": 21067, "year": "2018"}, {"Unnamed: 0": 130391, "autor": "dananalog", "date": 1538590163000, "content": "Dev or scan issue - potentially water spots?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9l3o9a/dev_or_scan_issue_potentially_water_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dev or scan issue - potentially water -----> spots !!! ?", "sortedWord": "None", "identifyer": 21103, "year": "2018"}, {"Unnamed: 0": 130420, "autor": "Oscillope", "date": 1538422576000, "content": "Can lens fungus spread across cameras? /!/ Title, basically. I have a Canonet QL-17 that has some very minor fungus towards the back element of the lens. It doesn't affect the photos, so I haven't really been rushing to try and remove it. It was like that when I bought it, I'm guessing from basement storage. I store all of my cameras on a set of shelves in the living room, which is generally cool and dry. Has anyone ever heard of fungus spreading to other cameras stored near each other?\n\nI've already swabbed the back element with alcohol, which seems to have cleared out most of it (except for a couple of faint spots) and I hope has killed the rest. I was just wondering what other peoples' experiences have been.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9kjk8y/can_lens_fungus_spread_across_cameras/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "can lens fungus spread across cameras? /!/ title, basically. i have a canonet ql-17 that has some very minor fungus towards the back element of the lens. it doesn't affect the photos, so i haven't really been rushing to try and remove it. it was like that when i bought it, i'm guessing from basement storage. i store all of my cameras on a set of shelves in the living room, which is generally cool and dry. has anyone ever heard of fungus spreading to other cameras stored near each other?\n\ni've already swabbed the back element with alcohol, which seems to have cleared out most of it (except for a couple of faint -----> spots !!! ) and i hope has killed the rest. i was just wondering what other peoples' experiences have been.", "sortedWord": "None", "identifyer": 21133, "year": "2018"}, {"Unnamed: 0": 130447, "autor": "Ficalos", "date": 1537827573000, "content": "Advice on de-cementing and re-cementing a doublet /!/ \nHey everyone! I know this sub isn't typically very repair-focused, but I'm curious to find out if there are people here into camera repair. I've done a bit myself just for fun and have gotten myself into probably the most extreme repair you can do to a lens: re-cementing a doublet.\n\nI have a Mamiya RB67 127mm C lens that I bought cheap with a body (which was also broken, but I have mostly fixed). Unfortunately the lens is cloudy between a cemented doublet. It's a nice lens, but a pro repair would cost more than it's worth so I've decided to embark on fixing it myself.\n\nI took a dremel to the aluminum lip keeping the doublet in place and managed to get the pair out. Looking at it I can absolutely confirm that the haze is between the elements and is not just clear yellowing like from Thorium - it has a weird spotted pattern.\n\nThe two elements are very much still glued together, presumably with UV curing epoxy (as opposed to Canada Balsam). Basically there are four things I need to figure out:\n\n* **How to de-cement the doublet**. I've read various sources suggesting paint stripper, methylene chloride, and acetone, among others. Anyone have ideas?\n\n* **What cement to use**. Would I be crazy to use Canada Balsam? It seems like the easiest thing... If not, what epoxy?\n\n* **How to align the elements**. I don't have a collimator. Will some sort of machined angle-holders actually be good enough? What are the consequences of being off-kilter a bit?\n\n* **How to fix the doublet back in it's housing**. I cut it out so I'll need another solution to get it back in. Is glass-metal glue a bad idea? It'll be in there forever, I guess...\n\nThanks!\n\n[Here are some pictures of everything](https://imgur.com/a/uKfOh95)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9imgku/advice_on_decementing_and_recementing_a_doublet/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "advice on de-cementing and re-cementing a doublet /!/ \nhey everyone! i know this sub isn't typically very repair-focused, but i'm curious to find out if there are people here into camera repair. i've done a bit myself just for fun and have gotten myself into probably the most extreme repair you can do to a lens: re-cementing a doublet.\n\ni have a mamiya rb67 127mm c lens that i bought cheap with a body (which was also broken, but i have mostly fixed). unfortunately the lens is cloudy between a cemented doublet. it's a nice lens, but a pro repair would cost more than it's worth so i've decided to embark on fixing it myself.\n\ni took a dremel to the aluminum lip keeping the doublet in place and managed to get the pair out. looking at it i can absolutely confirm that the haze is between the elements and is not just clear yellowing like from thorium - it has a weird -----> spotted !!!  pattern.\n\nthe two elements are very much still glued together, presumably with uv curing epoxy (as opposed to canada balsam). basically there are four things i need to figure out:\n\n* **how to de-cement the doublet**. i've read various sources suggesting paint stripper, methylene chloride, and acetone, among others. anyone have ideas?\n\n* **what cement to use**. would i be crazy to use canada balsam? it seems like the easiest thing... if not, what epoxy?\n\n* **how to align the elements**. i don't have a collimator. will some sort of machined angle-holders actually be good enough? what are the consequences of being off-kilter a bit?\n\n* **how to fix the doublet back in it's housing**. i cut it out so i'll need another solution to get it back in. is glass-metal glue a bad idea? it'll be in there forever, i guess...\n\nthanks!\n\n[here are some pictures of everything](https://imgur.com/a/ukfoh95)", "sortedWord": "None", "identifyer": 21160, "year": "2018"}, {"Unnamed: 0": 130502, "autor": "sad-king-billy", "date": 1537294458000, "content": "Just did my first C41 process at home, what are these spots?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9gxafz/just_did_my_first_c41_process_at_home_what_are/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just did my first c41 process at home, what are these -----> spots !!! ?", "sortedWord": "None", "identifyer": 21215, "year": "2018"}, {"Unnamed: 0": 130565, "autor": "back_tohell", "date": 1543965274000, "content": "Am i being too risky? /!/ So I'm currently in Vietnam after 9 months of planning a trip and I'm hitting all the cool spots plus dabbling in some street photography.\n\nI'm ONLY shooting film.\n\nI have my F100 and a Panasonic point shoot (the Leica mini copy) and about 12 rolls of film. A mixture of superia 400 and portra 400.\n\nI'm barely taking any photos on my phone and so far these rolls of film have been through the hand luggage x-rays 3 times and will have to go through them one more time \n\nI'm a little anxious these photos won't come out and then I'll be left with nothing.\n\nAny thoughts?\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a364bk/am_i_being_too_risky/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "am i being too risky? /!/ so i'm currently in vietnam after 9 months of planning a trip and i'm hitting all the cool -----> spots !!!  plus dabbling in some street photography.\n\ni'm only shooting film.\n\ni have my f100 and a panasonic point shoot (the leica mini copy) and about 12 rolls of film. a mixture of superia 400 and portra 400.\n\ni'm barely taking any photos on my phone and so far these rolls of film have been through the hand luggage x-rays 3 times and will have to go through them one more time \n\ni'm a little anxious these photos won't come out and then i'll be left with nothing.\n\nany thoughts?\n\n", "sortedWord": "None", "identifyer": 21278, "year": "2018"}, {"Unnamed: 0": 130566, "autor": "pianoz4life", "date": 1543953401000, "content": "Anyone else encountering wayyyy linger turnaround times these days? /!/ A couple of years ago turnaround time was 1-1.5 days at my local spot. Nowadays its minimum 3 days. It’s kind of crazy to me, just recently got a receipt for 5 days and it makes me want to get a darkroom. They also have started selling out of film. Are supplies/chemicals/film becoming harder to come by or are way more people shooting film?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a347f3/anyone_else_encountering_wayyyy_linger_turnaround/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone else encountering wayyyy linger turnaround times these days? /!/ a couple of years ago turnaround time was 1-1.5 days at my local -----> spot !!! . nowadays its minimum 3 days. it’s kind of crazy to me, just recently got a receipt for 5 days and it makes me want to get a darkroom. they also have started selling out of film. are supplies/chemicals/film becoming harder to come by or are way more people shooting film?", "sortedWord": "None", "identifyer": 21279, "year": "2018"}, {"Unnamed: 0": 130574, "autor": "DumbPanzyDisks", "date": 1543877936000, "content": "Printing Advise /!/ I've been printing for a little while now and been looking up how to spot prints but am yet to find a decent resource.\n\nso my question is to my fellow darkroom printers what brushes are useful to have and the inks to use/how to mix them to match the tones of the print ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a2u8dw/printing_advise/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "printing advise /!/ i've been printing for a little while now and been looking up how to -----> spot !!!  prints but am yet to find a decent resource.\n\nso my question is to my fellow darkroom printers what brushes are useful to have and the inks to use/how to mix them to match the tones of the print ", "sortedWord": "None", "identifyer": 21287, "year": "2018"}, {"Unnamed: 0": 130707, "autor": "Eddie_skis", "date": 1544661384000, "content": "Getting away from Adobe subscription. /!/ Like a lot of you, I’m a slave to the adobe subscription model. I’m not a power user at all and the only thing I use photoshop for is cleaning dust spots and c41 inversion. As such I’ve been on the hunt for an alternative. I tried capture one but it’s double the price and over $250 for a perpetual license. \n\nSo this led me to Luminar 2018 by Skylum. Luminar lacks the cataloging of Lightroom but that’s coming next week. I snagged it on sale for about $50 which of course works out to about 5 months of adobe crack... \n\nInitial impressions are that it’s good enough for negative conversion. Things I like are.\n\n1) same exp controls as other apps with a good color histogram.\n2) color cast auto adjust slider\n3) layers \n4) “advanced contrast” with separate hi,mid,low balance and adjustment. \n5) handles my Fuji files better than adobe. \n6) healing “erase” tool which is faster than Lightroom but less advanced than photoshop. \n\n ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/a5o8c7/getting_away_from_adobe_subscription/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "getting away from adobe subscription. /!/ like a lot of you, i’m a slave to the adobe subscription model. i’m not a power user at all and the only thing i use photoshop for is cleaning dust -----> spots !!!  and c41 inversion. as such i’ve been on the hunt for an alternative. i tried capture one but it’s double the price and over $250 for a perpetual license. \n\nso this led me to luminar 2018 by skylum. luminar lacks the cataloging of lightroom but that’s coming next week. i snagged it on sale for about $50 which of course works out to about 5 months of adobe crack... \n\ninitial impressions are that it’s good enough for negative conversion. things i like are.\n\n1) same exp controls as other apps with a good color histogram.\n2) color cast auto adjust slider\n3) layers \n4) “advanced contrast” with separate hi,mid,low balance and adjustment. \n5) handles my fuji files better than adobe. \n6) healing “erase” tool which is faster than lightroom but less advanced than photoshop. \n\n ", "sortedWord": "None", "identifyer": 21420, "year": "2018"}, {"Unnamed: 0": 130902, "autor": "BrianAndree", "date": 1533876186000, "content": "Need Suggestions for Prism Resilvering Service /!/ Hi,\n\nIm sure someone who has bought older analog gear before has need a prism resilvering before. I have a Mamiya m645 metered prism that has a few weird spots on it that make me believe it needs re-silvering, but as this is something I've never really needed done before I was wondering if anyone knew a place, preferably quick and inside the US if possible, but id be willing to ship overseas if I had to. Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/963wdr/need_suggestions_for_prism_resilvering_service/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need suggestions for prism resilvering service /!/ hi,\n\nim sure someone who has bought older analog gear before has need a prism resilvering before. i have a mamiya m645 metered prism that has a few weird -----> spots !!!  on it that make me believe it needs re-silvering, but as this is something i've never really needed done before i was wondering if anyone knew a place, preferably quick and inside the us if possible, but id be willing to ship overseas if i had to. thank you!", "sortedWord": "None", "identifyer": 21616, "year": "2018"}, {"Unnamed: 0": 130919, "autor": "henrytmoore", "date": 1533738937000, "content": "Hasselblad PME- focus screen compatibility /!/ Hi all, I have a quick question about meter and focus screen compatibility. I have an original PME prism from Hasselblad. Seems to work fine, but consistently reads about 2 stops higher than my handheld meter (flash meter in with reflected light attachment) as well as my iPhone light meter. I understand that the Hasselblad meter has a center weight while idk about the other ones and that might be part of it...\n\nAdditionally I have the 42250 focusing screen with micro prism spot and grid lines. It is not an acute matte screen I’m pretty sure. Could this screen be the issue? The micro prism is much brighter than the rest of the screen. \n\nAny insight would be very helpful. Worst case scenario I can just adjust the iso dial down 2 stops or buy a crosshairs screen but I just want to get to the bottom of this. \n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/95mjai/hasselblad_pme_focus_screen_compatibility/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hasselblad pme- focus screen compatibility /!/ hi all, i have a quick question about meter and focus screen compatibility. i have an original pme prism from hasselblad. seems to work fine, but consistently reads about 2 stops higher than my handheld meter (flash meter in with reflected light attachment) as well as my iphone light meter. i understand that the hasselblad meter has a center weight while idk about the other ones and that might be part of it...\n\nadditionally i have the 42250 focusing screen with micro prism -----> spot !!!  and grid lines. it is not an acute matte screen i’m pretty sure. could this screen be the issue? the micro prism is much brighter than the rest of the screen. \n\nany insight would be very helpful. worst case scenario i can just adjust the iso dial down 2 stops or buy a crosshairs screen but i just want to get to the bottom of this. \n\nthanks!", "sortedWord": "None", "identifyer": 21633, "year": "2018"}, {"Unnamed: 0": 130978, "autor": "Jezsalter", "date": 1538224971000, "content": "[ASK] How do I deal with water spots on negatives? /!/ Hello Reddit!  \n\n\nI have just developed my first 35mm roll ever (thank you, thank you) and I have come across the dreaded water spots during drying.  \n\n\nIs there anyway to re-wash and remove the water spots or is it permanently stained? The film is Ilford HP5 400iso BnW.  \n\n\nAny help or suggestions you may have would be greatly appreciated, thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/9jwbnk/ask_how_do_i_deal_with_water_spots_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[ask] how do i deal with water -----> spots !!!  on negatives? /!/ hello reddit!  \n\n\ni have just developed my first 35mm roll ever (thank you, thank you) and i have come across the dreaded water spots during drying.  \n\n\nis there anyway to re-wash and remove the water spots or is it permanently stained? the film is ilford hp5 400iso bnw.  \n\n\nany help or suggestions you may have would be greatly appreciated, thank you!", "sortedWord": "None", "identifyer": 21692, "year": "2018"}], "name": "spotAnalogCommunity2018"}