{"interestingcomments": [{"Unnamed: 0": 88484, "autor": "kanescans", "date": 1568023365000, "content": "Traveling Europe /!/ Hi everyone, i’m currently in Berlin for what initially was a week visit, but i’ve decided to stay longer and travel through Europe a bit. Any “photo spots” recommendations? I’m into nature, cityscapes, street photos... I know this is a bit vague but I’m in the middle of planning/planning as i go, so any and every suggestion would help right now. Also any cool photo museums or camera shops would be appreciated.\nThanks!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d1oub4/traveling_europe/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "traveling europe /!/ hi everyone, i’m currently in berlin for what initially was a week visit, but i’ve decided to stay longer and travel through europe a bit. any “photo -----> spots !!! ” recommendations? i’m into nature, cityscapes, street photos... i know this is a bit vague but i’m in the middle of planning/planning as i go, so any and every suggestion would help right now. also any cool photo museums or camera shops would be appreciated.\nthanks!!", "sortedWord": "None", "identifyer": 90963, "year": "2019"}, {"Unnamed: 0": 88511, "autor": "mexicant123", "date": 1567895214000, "content": "weird spot on film, using Pentax 67 what could it be?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d12nfy/weird_spot_on_film_using_pentax_67_what_could_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "weird -----> spot !!!  on film, using pentax 67 what could it be?", "sortedWord": "None", "identifyer": 90990, "year": "2019"}, {"Unnamed: 0": 88537, "autor": "freemanmads", "date": 1565108520000, "content": "Help Wanted - Olympus OM10 - Image Error /!/ Hi, I am having an error with an Olympus OM10. I gave an example of an image, there are large blank black spaces where the image should be. Some images on the roll were completely blank while just a few had were clear of any spots. I'm confused on why most images were ruined like this, but some were not?\n\nDoes anyone know what would cause this? I'm assuming it is the camera but could it be the film? \n\nThank you!!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cmspns/help_wanted_olympus_om10_image_error/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help wanted - olympus om10 - image error /!/ hi, i am having an error with an olympus om10. i gave an example of an image, there are large blank black spaces where the image should be. some images on the roll were completely blank while just a few had were clear of any -----> spots !!! . i'm confused on why most images were ruined like this, but some were not?\n\ndoes anyone know what would cause this? i'm assuming it is the camera but could it be the film? \n\nthank you!!", "sortedWord": "None", "identifyer": 91016, "year": "2019"}, {"Unnamed: 0": 88637, "autor": "MIBvincent", "date": 1561953505000, "content": "Black spots on mirror /!/ Will the black spots on the mirror itself affect my shots? When I look through the viewfinder I do not see any black spots but I still want to make sure. But if they do affect my photos how do I clean the mirror", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c7nt8k/black_spots_on_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  on mirror /!/ will the black spots on the mirror itself affect my shots? when i look through the viewfinder i do not see any black spots but i still want to make sure. but if they do affect my photos how do i clean the mirror", "sortedWord": "None", "identifyer": 91116, "year": "2019"}, {"Unnamed: 0": 88703, "autor": "Backcountryfox", "date": 1561588395000, "content": "Question on pulling/pushing film. /!/ Hi everyone, new analog user and new to the sub so bear with me.\n\nFor reference, I'm shooting on an Olympus OM-1.\n\nI'm going through a handful of rolls currently to just get a feel for the camera and to experiment with settings to truly understand the application of all the components. I work at a winery, and as great as a spot that is for playing around with film I am constantly met with extremely bright conditions. So I decided to (slightly) pull a roll of Fujicolor 200 to an ASA of 160.\n\nNow the two questions I immediately have are: 1) should I be aiming for a slightly overexposed light meter reading when shooting at a pulled 160/200 ASA. 2) should I be developing the negatives at \"160\" or go through with the regular process for 200?\n\nI realize these may be simple questions, I've been trying to read as much on it as possible - but I figured just doing it any seeing the result would be the best way to learn (and to see if anyone had any thoughts on it here!)\n\nAny additional thoughts on the matter are very welcome and would be appreciated. Thanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c5x5s5/question_on_pullingpushing_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question on pulling/pushing film. /!/ hi everyone, new analog user and new to the sub so bear with me.\n\nfor reference, i'm shooting on an olympus om-1.\n\ni'm going through a handful of rolls currently to just get a feel for the camera and to experiment with settings to truly understand the application of all the components. i work at a winery, and as great as a -----> spot !!!  that is for playing around with film i am constantly met with extremely bright conditions. so i decided to (slightly) pull a roll of fujicolor 200 to an asa of 160.\n\nnow the two questions i immediately have are: 1) should i be aiming for a slightly overexposed light meter reading when shooting at a pulled 160/200 asa. 2) should i be developing the negatives at \"160\" or go through with the regular process for 200?\n\ni realize these may be simple questions, i've been trying to read as much on it as possible - but i figured just doing it any seeing the result would be the best way to learn (and to see if anyone had any thoughts on it here!)\n\nany additional thoughts on the matter are very welcome and would be appreciated. thanks.", "sortedWord": "None", "identifyer": 91183, "year": "2019"}, {"Unnamed: 0": 88809, "autor": "catalystcake", "date": 1552159913000, "content": "Digital Camera Suggestions for vintage lenses /!/ Hey everybody,\n\nThis may be blasphemous for this community, but I find myself in a tough spot and I'd sooner trust you all than going straight to the r/cameras subreddit. I'll be starting medical school soon and don't believe I'll have the time or money to develop film for a while. I've been home developing up until recently and I believe I may have to bite the bullet and go digital. However, I'd still want to use my lenses I've been collecting on these digital bodies.\n\nI know there are adapters, so I wanted to see what suggestions you all had regarding a good camera to use.\n\nI have a lot of F-mount AI Nikon Lenses and a voigtlander m-mount I'd like to get some use out of. I've shot on mainly a Nikon F3 and a Canonet QL17G3, so I am comfortable with both SLR and rangefinder type shooting.\n\nMy major concerns are smaller, discreet form factor, so I've been considering mirrorless and I could care less about video. I don't care much about fiddling in post, so I'd like to shoot, export, and be done with it.\n\n&amp;#x200B;\n\nMy budget is \\~$1000, but I'm somewhat flexible.\n\n&amp;#x200B;\n\nI've been looking into Fuji Xpro-2 because I like the optical viewfinder and rangefinder build. I also appreciate the manual knobs, but my concern is the smaller sensor size.\n\nI look forward to your suggestions!\n\n(I am not leaving analog forever, I am just taking a hiatus due to unfortunate circumstances)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/az745x/digital_camera_suggestions_for_vintage_lenses/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "digital camera suggestions for vintage lenses /!/ hey everybody,\n\nthis may be blasphemous for this community, but i find myself in a tough -----> spot !!!  and i'd sooner trust you all than going straight to the r/cameras subreddit. i'll be starting medical school soon and don't believe i'll have the time or money to develop film for a while. i've been home developing up until recently and i believe i may have to bite the bullet and go digital. however, i'd still want to use my lenses i've been collecting on these digital bodies.\n\ni know there are adapters, so i wanted to see what suggestions you all had regarding a good camera to use.\n\ni have a lot of f-mount ai nikon lenses and a voigtlander m-mount i'd like to get some use out of. i've shot on mainly a nikon f3 and a canonet ql17g3, so i am comfortable with both slr and rangefinder type shooting.\n\nmy major concerns are smaller, discreet form factor, so i've been considering mirrorless and i could care less about video. i don't care much about fiddling in post, so i'd like to shoot, export, and be done with it.\n\n&amp;#x200b;\n\nmy budget is \\~$1000, but i'm somewhat flexible.\n\n&amp;#x200b;\n\ni've been looking into fuji xpro-2 because i like the optical viewfinder and rangefinder build. i also appreciate the manual knobs, but my concern is the smaller sensor size.\n\ni look forward to your suggestions!\n\n(i am not leaving analog forever, i am just taking a hiatus due to unfortunate circumstances)", "sortedWord": "None", "identifyer": 91289, "year": "2019"}, {"Unnamed: 0": 88827, "autor": "Natsukvshii", "date": 1552061476000, "content": "Anyone have any tips on cleaning water spots off of negatives? /!/ I developed a few rolls for a friend and scanned them and thought I could just fix the water spots in photoshop. Turns out they're worse than I thought. I have photoflo in my basement but I've never used it. Any tips on using it after the negatives have dried and been cut? Also, has anyone ever used the isopropyl alcohol + cotton swab method? I dont want to destroy negatives that arent mine lol  \n\nAny advice is appreciated! :) ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ayrz0q/anyone_have_any_tips_on_cleaning_water_spots_off/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone have any tips on cleaning water -----> spots !!!  off of negatives? /!/ i developed a few rolls for a friend and scanned them and thought i could just fix the water spots in photoshop. turns out they're worse than i thought. i have photoflo in my basement but i've never used it. any tips on using it after the negatives have dried and been cut? also, has anyone ever used the isopropyl alcohol + cotton swab method? i dont want to destroy negatives that arent mine lol  \n\nany advice is appreciated! :) ", "sortedWord": "None", "identifyer": 91307, "year": "2019"}, {"Unnamed: 0": 88837, "autor": "squadm-nkey", "date": 1549423008000, "content": "very out of focus pictures on Canon AE-1P, FD 50mm f/1.4, Portra 400 /!/ Here's an example of a few pictures from the roll:\n\n[https://imgur.com/a/1AWg9FY](https://imgur.com/a/1AWg9FY)\n\n&amp;#x200B;\n\nHi everyone, just looking for a little bit of help. I recently developed my first ever roll of film and was unhappily surprised when almost all of my prints/scans were out of focus/blurry. I'm trying to understand what I did wrong so I don't waste more film. Please note that I have strong myopia and wear -9.00 and -8.00 contact lenses while shooting; I hope that doesn't have something to do with it. \n\n&amp;#x200B;\n\nHow I've been trying to focus:\n\nWhen I try to take the picture through the view finder, there are usually like two extreme ends that seem very out of focus and somewhere in the middle is the sweet spot. The center of my viewfinder has a watchamacallit made of two concentric circles. The outer portion is stippled with tiny little dots and the inner has a line through the middle. When I think the image is as in focus as it's going to get I can't see the inner circle at all and can only see a very faint outline of the outer edge of the outer ring. \n\n&amp;#x200B;\n\nFor each one of the pictures in my roll, I made sure to try and get the focus to be as clear as possible to my eye through the viewfinder and am confused why they came back the way they did. Any input would be appreciated.\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/AnalogCommunity/comments/anmc7s/very_out_of_focus_pictures_on_canon_ae1p_fd_50mm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "very out of focus pictures on canon ae-1p, fd 50mm f/1.4, portra 400 /!/ here's an example of a few pictures from the roll:\n\n[https://imgur.com/a/1awg9fy](https://imgur.com/a/1awg9fy)\n\n&amp;#x200b;\n\nhi everyone, just looking for a little bit of help. i recently developed my first ever roll of film and was unhappily surprised when almost all of my prints/scans were out of focus/blurry. i'm trying to understand what i did wrong so i don't waste more film. please note that i have strong myopia and wear -9.00 and -8.00 contact lenses while shooting; i hope that doesn't have something to do with it. \n\n&amp;#x200b;\n\nhow i've been trying to focus:\n\nwhen i try to take the picture through the view finder, there are usually like two extreme ends that seem very out of focus and somewhere in the middle is the sweet -----> spot !!! . the center of my viewfinder has a watchamacallit made of two concentric circles. the outer portion is stippled with tiny little dots and the inner has a line through the middle. when i think the image is as in focus as it's going to get i can't see the inner circle at all and can only see a very faint outline of the outer edge of the outer ring. \n\n&amp;#x200b;\n\nfor each one of the pictures in my roll, i made sure to try and get the focus to be as clear as possible to my eye through the viewfinder and am confused why they came back the way they did. any input would be appreciated.\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 91317, "year": "2019"}, {"Unnamed: 0": 88918, "autor": "Eddie_skis", "date": 1548903179000, "content": "Rangefinder calibration /!/ Does anyone know how to calibrate a rangefinder without trial and error of shooting a bunch of film.\n\nI took my Fuji gs645s apart and knocked the rangefinder calibration out of whack. I know how to adjust horizontal and vertical but is there a way to check while looking through the lens. I’m sure I saw something online about using a loupe on the film plane. \n\nIt’s pretty close but it’s just slightly back focused so I’d like to get it spot on if I can. ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/alkxpb/rangefinder_calibration/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "rangefinder calibration /!/ does anyone know how to calibrate a rangefinder without trial and error of shooting a bunch of film.\n\ni took my fuji gs645s apart and knocked the rangefinder calibration out of whack. i know how to adjust horizontal and vertical but is there a way to check while looking through the lens. i’m sure i saw something online about using a loupe on the film plane. \n\nit’s pretty close but it’s just slightly back focused so i’d like to get it -----> spot !!!  on if i can. ", "sortedWord": "None", "identifyer": 91398, "year": "2019"}, {"Unnamed: 0": 88938, "autor": "shemp33", "date": 1555692096000, "content": "Unexpectedly getting a trip to San Francisco - any particular good photo spots? /!/ I've only been to SF for a few trips and none of them were for leisure. This is no exception (e.g. going for work), but I have a lot more appreciation of what the area around me nowadays.  \n\nI won't have a car, and my shooting will be limited to evening / night / early morning.\n\nI will be near Chinatown. Am I crazy in thinking I can go there, plop out a tripod after dark, and take some long exposures on Cinestill 800?  Are these streets pretty safe, or is this like a prime target to get robbed of my gear? \n\nMy options for taking with me: \n\n35mm film body / Rolleiflex MF / Holga 120 MF.  Lenses for 35mm: 16-35, 24-70 (both 2.8), 50/1.8. \n\nFilms:  \n\n35mm:  Cinestill 800t, Portra 800, Portra 160, Fuji Pro 400H, Tmax 3200, Tmax 400 \n\n120:  Fuji 400H, Lomo 400 Color, Cinestill 800, Tri-x 400 BW.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bf19rv/unexpectedly_getting_a_trip_to_san_francisco_any/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "unexpectedly getting a trip to san francisco - any particular good photo -----> spots !!! ? /!/ i've only been to sf for a few trips and none of them were for leisure. this is no exception (e.g. going for work), but i have a lot more appreciation of what the area around me nowadays.  \n\ni won't have a car, and my shooting will be limited to evening / night / early morning.\n\ni will be near chinatown. am i crazy in thinking i can go there, plop out a tripod after dark, and take some long exposures on cinestill 800?  are these streets pretty safe, or is this like a prime target to get robbed of my gear? \n\nmy options for taking with me: \n\n35mm film body / rolleiflex mf / holga 120 mf.  lenses for 35mm: 16-35, 24-70 (both 2.8), 50/1.8. \n\nfilms:  \n\n35mm:  cinestill 800t, portra 800, portra 160, fuji pro 400h, tmax 3200, tmax 400 \n\n120:  fuji 400h, lomo 400 color, cinestill 800, tri-x 400 bw.", "sortedWord": "None", "identifyer": 91418, "year": "2019"}, {"Unnamed: 0": 88968, "autor": "never_mind_the_egg", "date": 1555496559000, "content": "Water spots - the bane of my existence - help please /!/ I started developing my own black and white film at the beginning of this year and pretty much from the get go struggled with water spots (because of very hard water in my area) however after a lot of exterminating I finally found a way to get spotless negatives every time. After washing with tap water, I do the final rinse in distilled water with a few drops of photo flo and after hanging them to dry I pour some distilled water down on either side and I get very clean, consistent negatives. It is this final step of pouring distilled water down the negatives that prevents any spotting.\n\nRecently I’ve been getting into color development as well. I got started with the Cinestill CS-41 quart kit. CineStill day on their website and the instruction video the stabilizer is optional, so I skipped it all together and just did the same post-wash procedure I used with black and white film and also got nice results.\n\nI finally exhausted the kit (got a grand total of 26 rolls out of it, last 2 had a light color cast though, which is why I stopped using it) and now got a 5L kit from Fuji Hunt since it’s a lot more economical. \n\nBefore developing I did some reading about the kit and saw that stabilizer is actually essential in preventing fungal and bacterial growth long term and should be the last thing to touch the film before hanging to dry. Washing the film with distilled water after hanging would be essentially washing the stabilizer away.\n\nSo when developing with the Fuji kit, after fixing and washing the film I gave it a final wash in distilled water and then added the stabilizer (which has been mixed with distilled water as well) and hung them to dry without washing with distilled water anymore and sure enough the water spots (or could they be residue from the stabilizer?) are back.\n\nSo I have a few questions:\n\nIs stabilizer essential? Or is my film going to be ok if I don’t use it and store it properly (paper sleeves in a dry environment)?\n\nIf it absolutely must be the last bath, how can I prevent water spots. I feel like I’ve tried everything other than squeegeeing (which I’ve heard many horror stories about scratching the film).\n\nShould I stabilize the films developed with the Cinestill kit where I skipped that step?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/be64jg/water_spots_the_bane_of_my_existence_help_please/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "water -----> spots !!!  - the bane of my existence - help please /!/ i started developing my own black and white film at the beginning of this year and pretty much from the get go struggled with water spots (because of very hard water in my area) however after a lot of exterminating i finally found a way to get spotless negatives every time. after washing with tap water, i do the final rinse in distilled water with a few drops of photo flo and after hanging them to dry i pour some distilled water down on either side and i get very clean, consistent negatives. it is this final step of pouring distilled water down the negatives that prevents any spotting.\n\nrecently i’ve been getting into color development as well. i got started with the cinestill cs-41 quart kit. cinestill day on their website and the instruction video the stabilizer is optional, so i skipped it all together and just did the same post-wash procedure i used with black and white film and also got nice results.\n\ni finally exhausted the kit (got a grand total of 26 rolls out of it, last 2 had a light color cast though, which is why i stopped using it) and now got a 5l kit from fuji hunt since it’s a lot more economical. \n\nbefore developing i did some reading about the kit and saw that stabilizer is actually essential in preventing fungal and bacterial growth long term and should be the last thing to touch the film before hanging to dry. washing the film with distilled water after hanging would be essentially washing the stabilizer away.\n\nso when developing with the fuji kit, after fixing and washing the film i gave it a final wash in distilled water and then added the stabilizer (which has been mixed with distilled water as well) and hung them to dry without washing with distilled water anymore and sure enough the water spots (or could they be residue from the stabilizer?) are back.\n\nso i have a few questions:\n\nis stabilizer essential? or is my film going to be ok if i don’t use it and store it properly (paper sleeves in a dry environment)?\n\nif it absolutely must be the last bath, how can i prevent water spots. i feel like i’ve tried everything other than squeegeeing (which i’ve heard many horror stories about scratching the film).\n\nshould i stabilize the films developed with the cinestill kit where i skipped that step?", "sortedWord": "None", "identifyer": 91448, "year": "2019"}, {"Unnamed: 0": 89114, "autor": "HammondKardon", "date": 1558405729000, "content": "Overexposed photos with Ektar 100 - Light Meter or Scanner or Film Problem? /!/ Hello all,\n\nI've been using a Canonet QL-17 GIII for a few months now and overall it's been great. But recently a few rolls of Ektar came back totally blown out and overexposed... at least that's what I think? I'm a beginner so I'm not sure what's wrong here.\n\nI set the camera to 100 ASA for Ektar and notice that Ektar in particular comes out looking blown out in the highlights. It could be user error, but I suspect it's a scanner problem. \n\nStrangely, other films tend to come out significantly better but the exposure is not always spot on. Here are a few photo examples of the Ektar:\n\nhttps://c2.staticflickr.com/4/3671/33652219205_3fb3857a2f_z.jpg\nhttps://c1.staticflickr.com/3/2919/33522985491_8ea01c3f5a_z.jpg\nhttps://c1.staticflickr.com/3/2913/33495743072_92b5552c34_z.jpg\n\nNotice the blown out highlights on [this photo](https://c1.staticflickr.com/3/2919/33522985491_8ea01c3f5a_z.jpg\n). I can't even make out half his face - it's completely lost in the light. I thought film is supposed to have extreme amounts of dynamic range?\n\nInterestingly, other films tend to come out better but not perfect. [See here for a few other rolls shot with the same camera](https://flic.kr/s/aHskNQ75oZ).\n\nLet me know what you think could be happening... and thanks for your help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/br4tz1/overexposed_photos_with_ektar_100_light_meter_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "overexposed photos with ektar 100 - light meter or scanner or film problem? /!/ hello all,\n\ni've been using a canonet ql-17 giii for a few months now and overall it's been great. but recently a few rolls of ektar came back totally blown out and overexposed... at least that's what i think? i'm a beginner so i'm not sure what's wrong here.\n\ni set the camera to 100 asa for ektar and notice that ektar in particular comes out looking blown out in the highlights. it could be user error, but i suspect it's a scanner problem. \n\nstrangely, other films tend to come out significantly better but the exposure is not always -----> spot !!!  on. here are a few photo examples of the ektar:\n\nhttps://c2.staticflickr.com/4/3671/33652219205_3fb3857a2f_z.jpg\nhttps://c1.staticflickr.com/3/2919/33522985491_8ea01c3f5a_z.jpg\nhttps://c1.staticflickr.com/3/2913/33495743072_92b5552c34_z.jpg\n\nnotice the blown out highlights on [this photo](https://c1.staticflickr.com/3/2919/33522985491_8ea01c3f5a_z.jpg\n). i can't even make out half his face - it's completely lost in the light. i thought film is supposed to have extreme amounts of dynamic range?\n\ninterestingly, other films tend to come out better but not perfect. [see here for a few other rolls shot with the same camera](https://flic.kr/s/ahsknq75oz).\n\nlet me know what you think could be happening... and thanks for your help!", "sortedWord": "None", "identifyer": 91596, "year": "2019"}, {"Unnamed: 0": 89151, "autor": "sKru4a", "date": 1577621518000, "content": "Olympus OM2S slow shutter speed in Auto mode /!/ I recently bought an Olympus OM2 Spot Program. Everything seems to be working fine except for the Auto mode. It measures the light correctly, but the actual shutter speed is noticeably slower than indicated - e.g. it shows 1/4 in the viewfinder, but when I shoot it's actually around a second. If I switch to manual, the shutter speeds seem fine.\n\nI'm hoping there's something specific with Olympus cameras I'm missing (it's my first Olympus one) and it's not faulty. Before I send it for repair, any advice?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eh5ais/olympus_om2s_slow_shutter_speed_in_auto_mode/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "olympus om2s slow shutter speed in auto mode /!/ i recently bought an olympus om2 -----> spot !!!  program. everything seems to be working fine except for the auto mode. it measures the light correctly, but the actual shutter speed is noticeably slower than indicated - e.g. it shows 1/4 in the viewfinder, but when i shoot it's actually around a second. if i switch to manual, the shutter speeds seem fine.\n\ni'm hoping there's something specific with olympus cameras i'm missing (it's my first olympus one) and it's not faulty. before i send it for repair, any advice?", "sortedWord": "None", "identifyer": 91633, "year": "2019"}, {"Unnamed: 0": 89240, "autor": "thanumbereleven", "date": 1566410681000, "content": "I have the same light leak on all my frames. Is it a light seal Issue? Im using the RB67 &amp; I don't see any wear and tear but I'm new to medium format so I could be overlooking. Its in the exact same spot (of course when shot in landscape its going down the frame &amp; not across) Thank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ctkjtf/i_have_the_same_light_leak_on_all_my_frames_is_it/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have the same light leak on all my frames. is it a light seal issue? im using the rb67 &amp; i don't see any wear and tear but i'm new to medium format so i could be overlooking. its in the exact same -----> spot !!!  (of course when shot in landscape its going down the frame &amp; not across) thank you!", "sortedWord": "None", "identifyer": 91723, "year": "2019"}, {"Unnamed: 0": 89249, "autor": "noblemortarman", "date": 1566351050000, "content": "Camera ID? Spotted this image in the LBJ library. It can't be newer than 1968 unless it fell through the lamest wormhole in the universe.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ct9rfe/camera_id_spotted_this_image_in_the_lbj_library/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "camera id? -----> spotted !!!  this image in the lbj library. it can't be newer than 1968 unless it fell through the lamest wormhole in the universe.", "sortedWord": "None", "identifyer": 91732, "year": "2019"}, {"Unnamed: 0": 89272, "autor": "lbrandon225", "date": 1566227376000, "content": "Help! I keep getting these spots when developing.. /!/ So I'm doing home development with a CineStill Cs41 kit (used distilled water to mix) and their temperature control system, but I keep getting these spots and streaks in my film! \n\nI tried rinsing my film longer, steaming up the bathroom before taking out and hanging, and wiping/blowing before scanning. Film was brand new and stored in the fridge before use.\n\nIs there anything I'm specifically doing wrong? \n\n*Processing img uybohze48fh31...*\n\n*Processing img d2kh1be48fh31...*\n\n*Processing img 4t7neng48fh31...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/csicuz/help_i_keep_getting_these_spots_when_developing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help! i keep getting these -----> spots !!!  when developing.. /!/ so i'm doing home development with a cinestill cs41 kit (used distilled water to mix) and their temperature control system, but i keep getting these spots and streaks in my film! \n\ni tried rinsing my film longer, steaming up the bathroom before taking out and hanging, and wiping/blowing before scanning. film was brand new and stored in the fridge before use.\n\nis there anything i'm specifically doing wrong? \n\n*processing img uybohze48fh31...*\n\n*processing img d2kh1be48fh31...*\n\n*processing img 4t7neng48fh31...*", "sortedWord": "None", "identifyer": 91755, "year": "2019"}, {"Unnamed: 0": 89322, "autor": "daimonwright", "date": 1566032833000, "content": "Was watching planes and shooting with my ME Super when a gentleman spotted me using film and said he had an old kit he’d love to see go to a good home. AUD$100 for the lot. Big win!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/crjv5t/was_watching_planes_and_shooting_with_my_me_super/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "was watching planes and shooting with my me super when a gentleman -----> spotted !!!  me using film and said he had an old kit he’d love to see go to a good home. aud$100 for the lot. big win!", "sortedWord": "None", "identifyer": 91808, "year": "2019"}, {"Unnamed: 0": 89373, "autor": "7150788", "date": 1561216839000, "content": "Durst M700 Enlarger, missing some components. /!/ I'm not very familiar with enlargers details but since I've been thinking for a long time to get one and this deal came up, I decided to go for it. From what I gathered, it's missing the lens and the lens carrier. There's a negative carrier but what I make from the user manual, I'm missing the masking strips (the carrier has 4 sliders to mask the negative, I assume this is to go along with the negative mask?). Also, there is no green filter/grid that I see in some photos on the net. What's this for? The mirror housing can be put in two ways (mirror facing opening on the front or facing the lamp). How can this be, do you rotate it (180º horizontally) when in the dark room? Manual also refers a heat filter, that must be also missing.\n\nAm I missing anything else, in respect to the enlarger itself only? It's in working condition, lamp's on/off, knobs seem precise. Just some dust and occasional rust spots that I intend to treat properly.\n\nThis is the one I got, picture at the store (mirror facing front; neg carrier is on the baseboard): https://i.imgur.com/cai6zKG.jpg\n((8 page user manual)[https://www.scribd.com/doc/62515960/Durst-M700])", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c3qwmv/durst_m700_enlarger_missing_some_components/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "durst m700 enlarger, missing some components. /!/ i'm not very familiar with enlargers details but since i've been thinking for a long time to get one and this deal came up, i decided to go for it. from what i gathered, it's missing the lens and the lens carrier. there's a negative carrier but what i make from the user manual, i'm missing the masking strips (the carrier has 4 sliders to mask the negative, i assume this is to go along with the negative mask?). also, there is no green filter/grid that i see in some photos on the net. what's this for? the mirror housing can be put in two ways (mirror facing opening on the front or facing the lamp). how can this be, do you rotate it (180º horizontally) when in the dark room? manual also refers a heat filter, that must be also missing.\n\nam i missing anything else, in respect to the enlarger itself only? it's in working condition, lamp's on/off, knobs seem precise. just some dust and occasional rust -----> spots !!!  that i intend to treat properly.\n\nthis is the one i got, picture at the store (mirror facing front; neg carrier is on the baseboard): https://i.imgur.com/cai6zkg.jpg\n((8 page user manual)[https://www.scribd.com/doc/62515960/durst-m700])", "sortedWord": "None", "identifyer": 91859, "year": "2019"}, {"Unnamed: 0": 89531, "autor": "fotoloc0", "date": 1571352443000, "content": "Tips before shooting slide film (Kodak Ektrachrome 100) for the first time /!/ I took the plunge and bought my first roll of Kodak Ektachrome 100 slide film.\n\nI am a little worried about metering because I know how less the latitude is in slide film. Plus I don't own a spot meter.\n\nI have an Olympus OM2N which I plan to use.\nI also have a Nikon F3HP but since I am yet to shoot my first roll with it, I am planning not to use the F3 with slide film on the first attempt.\n\nWhen I shoot with the OM2N, I try to overexpose by a stop or two, but that is with color negative. With slide film, I realize even a single stop overexposure might lead to blown highlights ?\n\nSome tips would be wonderful.\nThanks for reading.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dje40l/tips_before_shooting_slide_film_kodak_ektrachrome/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tips before shooting slide film (kodak ektrachrome 100) for the first time /!/ i took the plunge and bought my first roll of kodak ektachrome 100 slide film.\n\ni am a little worried about metering because i know how less the latitude is in slide film. plus i don't own a -----> spot !!!  meter.\n\ni have an olympus om2n which i plan to use.\ni also have a nikon f3hp but since i am yet to shoot my first roll with it, i am planning not to use the f3 with slide film on the first attempt.\n\nwhen i shoot with the om2n, i try to overexpose by a stop or two, but that is with color negative. with slide film, i realize even a single stop overexposure might lead to blown highlights ?\n\nsome tips would be wonderful.\nthanks for reading.", "sortedWord": "None", "identifyer": 92018, "year": "2019"}, {"Unnamed: 0": 89704, "autor": "EAndPhoto", "date": 1551536210000, "content": "Request for Cool things to Photograph near Charleston, SC /!/ I recently put together a 4x5 camera set up and collected the gear to develop the film (Kodak tmax 100 and ilford developer). I’m from the Northeast so usually I’d just head out to the mountains for a day but down here in low country I work most weekends and have to search a little harder for inspiration in the first place. Would love to hear about anyone’s favorite spots. \n\nSide note: if anyone knows of any good photography groups here I’d appreciate it if you could point me in the right direction.\n\nThanks folks\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/awi5x9/request_for_cool_things_to_photograph_near/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "request for cool things to photograph near charleston, sc /!/ i recently put together a 4x5 camera set up and collected the gear to develop the film (kodak tmax 100 and ilford developer). i’m from the northeast so usually i’d just head out to the mountains for a day but down here in low country i work most weekends and have to search a little harder for inspiration in the first place. would love to hear about anyone’s favorite -----> spots !!! . \n\nside note: if anyone knows of any good photography groups here i’d appreciate it if you could point me in the right direction.\n\nthanks folks\n\n", "sortedWord": "None", "identifyer": 92191, "year": "2019"}, {"Unnamed: 0": 89849, "autor": "poopiehead46", "date": 1574375192000, "content": "Sekonic 758 vs a small mirrorless for metering? /!/ I've been debating whether or not I should invest in a spot &amp; incident meter for landscape photography. Then I had the idea of just carrying a small mirrorless (something like sony rx100/fuji x100 series)  to use for metering instead. With the mirrorless camera, I can even use it to take photos as backups, or when I don't want to bust out the bigger mamiya 6. \n\n&amp;#x200B;\n\nI mostly shoot on the move(hiking/mountaineering), and rarely spend more than a few minutes setting up/waiting for a scene because of the situation I'm in. \n\n&amp;#x200B;\n\nIs there a reason to get a dedicated metering device for this case?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dzr69c/sekonic_758_vs_a_small_mirrorless_for_metering/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sekonic 758 vs a small mirrorless for metering? /!/ i've been debating whether or not i should invest in a -----> spot !!!  &amp; incident meter for landscape photography. then i had the idea of just carrying a small mirrorless (something like sony rx100/fuji x100 series)  to use for metering instead. with the mirrorless camera, i can even use it to take photos as backups, or when i don't want to bust out the bigger mamiya 6. \n\n&amp;#x200b;\n\ni mostly shoot on the move(hiking/mountaineering), and rarely spend more than a few minutes setting up/waiting for a scene because of the situation i'm in. \n\n&amp;#x200b;\n\nis there a reason to get a dedicated metering device for this case?", "sortedWord": "None", "identifyer": 92336, "year": "2019"}, {"Unnamed: 0": 89929, "autor": "jethroo23", "date": 1563229297000, "content": "Anyone know what this is on my lens? Fungus/Haze? /!/ I recently got a used Voigtlander Nokton 50mm f1.5 that has what looks like a bit of haze or fungus on the middle element. The seller described the lens as new, and he didn't spot it when he was inspecting the lens so I'm not sure if it formed during shipping.\n\nIt can be seen towards the bottom part of the element in the pics below.\n\nhttp://imgur.com/a/y4EyMJJ\n\nIs it cleanable?\n\nThank you so much for the help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cdoef0/anyone_know_what_this_is_on_my_lens_fungushaze/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone know what this is on my lens? fungus/haze? /!/ i recently got a used voigtlander nokton 50mm f1.5 that has what looks like a bit of haze or fungus on the middle element. the seller described the lens as new, and he didn't -----> spot !!!  it when he was inspecting the lens so i'm not sure if it formed during shipping.\n\nit can be seen towards the bottom part of the element in the pics below.\n\nhttp://imgur.com/a/y4eymjj\n\nis it cleanable?\n\nthank you so much for the help!", "sortedWord": "None", "identifyer": 92416, "year": "2019"}, {"Unnamed: 0": 90002, "autor": "csyoon", "date": 1562773914000, "content": "My dslr scanning problem /!/ Hey guys. I'm wondering if anyone has run into a similar problem as me with \"dslr\" scanning. \n\nMy setup: \n\n* fuji x-e2\n* nikkor 55mm f/3.5 lens. (shot at f/8 or f/5.6)\n* artist tracing lightbox (https://smile.amazon.com/gp/product/B01M26S3VY/ref=ppx_yo_dt_b_search_asin_title)\n* digitaliza scanning mask\n\n[Panoramic example](https://i.imgur.com/CKcH3N8.jpg)\n\n[single shot](https://i.imgur.com/AjUxo4M.jpg)\n\nAnyways if you look at these photos it seems like there is a darker spot in the middle of the frame (with the panoramic shot it's in two spots. quarter of the way from each side). almost looks like a reverse vignetting. with the black and white photos i mostly ignored it but when i started scanning color photos it seemed like there was some color shift.\n\nAnyways i'm wondering if there is something wrong with my setup. I recently added the digitaliza scanning mask instead of plopping the film right on the table. which seems to have introduced the problem. But i'm also wondering if it's because i bought a relatively cheap light table and that maybe the better light tables are brighter and can make up for the little space between the light and the film which causes the dropoff of light. or is this a result of the lens?\n\nThanks for the help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cbif78/my_dslr_scanning_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my dslr scanning problem /!/ hey guys. i'm wondering if anyone has run into a similar problem as me with \"dslr\" scanning. \n\nmy setup: \n\n* fuji x-e2\n* nikkor 55mm f/3.5 lens. (shot at f/8 or f/5.6)\n* artist tracing lightbox (https://smile.amazon.com/gp/product/b01m26s3vy/ref=ppx_yo_dt_b_search_asin_title)\n* digitaliza scanning mask\n\n[panoramic example](https://i.imgur.com/ckch3n8.jpg)\n\n[single shot](https://i.imgur.com/ajuxo4m.jpg)\n\nanyways if you look at these photos it seems like there is a darker -----> spot !!!  in the middle of the frame (with the panoramic shot it's in two spots. quarter of the way from each side). almost looks like a reverse vignetting. with the black and white photos i mostly ignored it but when i started scanning color photos it seemed like there was some color shift.\n\nanyways i'm wondering if there is something wrong with my setup. i recently added the digitaliza scanning mask instead of plopping the film right on the table. which seems to have introduced the problem. but i'm also wondering if it's because i bought a relatively cheap light table and that maybe the better light tables are brighter and can make up for the little space between the light and the film which causes the dropoff of light. or is this a result of the lens?\n\nthanks for the help.", "sortedWord": "None", "identifyer": 92489, "year": "2019"}, {"Unnamed: 0": 90122, "autor": "HrCookie", "date": 1563999028000, "content": "Minolta IV F for spot metering? /!/ I have ventured into some night time long exposures as of recent, and have gone by with some basic EV calculations for metering. Most of the time it gives a good exposure, but not always.\n\nSo I have been looking at the Minolta IV F with the 5° spot metering attachment, to improve my exposures at night, and without breaking the bank. \n\nDo anyone have experience with the light meter in question? Maybe even for the same purpose as I intend to use it for? Any thoughts and insights will be highly appreciated.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/chda83/minolta_iv_f_for_spot_metering/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "minolta iv f for -----> spot !!!  metering? /!/ i have ventured into some night time long exposures as of recent, and have gone by with some basic ev calculations for metering. most of the time it gives a good exposure, but not always.\n\nso i have been looking at the minolta iv f with the 5° spot metering attachment, to improve my exposures at night, and without breaking the bank. \n\ndo anyone have experience with the light meter in question? maybe even for the same purpose as i intend to use it for? any thoughts and insights will be highly appreciated.", "sortedWord": "None", "identifyer": 92609, "year": "2019"}, {"Unnamed: 0": 90277, "autor": "centralplains", "date": 1547222409000, "content": "The future of built in light meters? /!/ So most of us on here are restoring old cameras and getting CLAs or DIY fixes for our cameras to make them usable for many decades down the road, but eventually cameras with built in light meters should fail, correct? Perhaps some already have and others have the pesky mercury battery issues of voltage that keeps us on our feet. I've had my Canon AE-1 since 1982 and the light meter is still spot on. Are some light cells better than others? Thanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aewr54/the_future_of_built_in_light_meters/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the future of built in light meters? /!/ so most of us on here are restoring old cameras and getting clas or diy fixes for our cameras to make them usable for many decades down the road, but eventually cameras with built in light meters should fail, correct? perhaps some already have and others have the pesky mercury battery issues of voltage that keeps us on our feet. i've had my canon ae-1 since 1982 and the light meter is still -----> spot !!!  on. are some light cells better than others? thanks.", "sortedWord": "None", "identifyer": 92764, "year": "2019"}, {"Unnamed: 0": 90360, "autor": "oizaro", "date": 1553620363000, "content": "getting into analog with a Canon AE-1 Program /!/ Hi guys,\n\n&amp;#x200B;\n\nI just got this camera from my father and I just started shooting but I have a stupid question about it. I put the roll into it and everything was working fine, the camera showed the remaining shoots. Then, – with no rational reason – I opened again the roll spot to see if everything looks okay and closed it again and now the shoots counter went back to default. Is this normal? \n\n&amp;#x200B;\n\nAnd do you have any tips for someone noob like me?\n\n&amp;#x200B;\n\nThank you!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b5sdk6/getting_into_analog_with_a_canon_ae1_program/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "getting into analog with a canon ae-1 program /!/ hi guys,\n\n&amp;#x200b;\n\ni just got this camera from my father and i just started shooting but i have a stupid question about it. i put the roll into it and everything was working fine, the camera showed the remaining shoots. then, – with no rational reason – i opened again the roll -----> spot !!!  to see if everything looks okay and closed it again and now the shoots counter went back to default. is this normal? \n\n&amp;#x200b;\n\nand do you have any tips for someone noob like me?\n\n&amp;#x200b;\n\nthank you!", "sortedWord": "None", "identifyer": 92847, "year": "2019"}, {"Unnamed: 0": 90517, "autor": "kid-blue", "date": 1554725021000, "content": "Am I wrong I thinking I can de-funge my Mamiya 110mm myself? /!/ Hi all,\n\nI'm looking to get some perspective on this:\n\nI recently got a mamiya 110mm 2.8 for a really low price (€35) because it has fungus in it. I'm currently looking for a good spot for repairs here in the Netherlands (any tips are welcome!), but I'm also looking at diy fungus removal. \n\nIt seems like most of the fungus is at either the inside (duh) of the front element or on the second one. Given that, and the info from some YT videos, I reckon I might be able to open and clean the lens myself, thus learning a new thing and saving some money. \n\nDo any of you have experience with cleaning out a lens like this? Would I need anything besides a lens wrench, paper towels, surgical gloves and soap/vinegar? \n\nI don't want to embark on something made to look easy by a dude online, only to find out its super hard to do myself. \n\nAny and all tips and experience are more than welcome!\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/basy87/am_i_wrong_i_thinking_i_can_defunge_my_mamiya/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "am i wrong i thinking i can de-funge my mamiya 110mm myself? /!/ hi all,\n\ni'm looking to get some perspective on this:\n\ni recently got a mamiya 110mm 2.8 for a really low price (€35) because it has fungus in it. i'm currently looking for a good -----> spot !!!  for repairs here in the netherlands (any tips are welcome!), but i'm also looking at diy fungus removal. \n\nit seems like most of the fungus is at either the inside (duh) of the front element or on the second one. given that, and the info from some yt videos, i reckon i might be able to open and clean the lens myself, thus learning a new thing and saving some money. \n\ndo any of you have experience with cleaning out a lens like this? would i need anything besides a lens wrench, paper towels, surgical gloves and soap/vinegar? \n\ni don't want to embark on something made to look easy by a dude online, only to find out its super hard to do myself. \n\nany and all tips and experience are more than welcome!\n\n", "sortedWord": "None", "identifyer": 93004, "year": "2019"}, {"Unnamed: 0": 90524, "autor": "chew_stale_gum", "date": 1548808427000, "content": "Reflected light metering question /!/ Hi, wonder if anyone has any trick to guess spot-metering with an incident light meter? I have a pretty good incident meter which I treasure for using during day light, however at night when I only want to expose for the lights, it's pretty off. Is there any workaround without spending money on buying a reflected light meter? Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/al6vt0/reflected_light_metering_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "reflected light metering question /!/ hi, wonder if anyone has any trick to guess -----> spot !!! -metering with an incident light meter? i have a pretty good incident meter which i treasure for using during day light, however at night when i only want to expose for the lights, it's pretty off. is there any workaround without spending money on buying a reflected light meter? thanks!", "sortedWord": "None", "identifyer": 93012, "year": "2019"}, {"Unnamed: 0": 90573, "autor": "LuckyCapt-RabbitKing", "date": 1548539041000, "content": "problem with neg/scan: water spot or emulsion issue /!/ Scan appears to have water droplets, but on the negative they seem way too tiny to be water droplets. The lab thinks its an emulsion issue or oil splattered from within the camera. This was Kodak Portra 160 in a Pentax 67. I've had this camera for a couple of years &amp; this is the first time I've seen this.\n\nhttps://flic.kr/p/Si58h3", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ak5f5b/problem_with_negscan_water_spot_or_emulsion_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "problem with neg/scan: water -----> spot !!!  or emulsion issue /!/ scan appears to have water droplets, but on the negative they seem way too tiny to be water droplets. the lab thinks its an emulsion issue or oil splattered from within the camera. this was kodak portra 160 in a pentax 67. i've had this camera for a couple of years &amp; this is the first time i've seen this.\n\nhttps://flic.kr/p/si58h3", "sortedWord": "None", "identifyer": 93061, "year": "2019"}, {"Unnamed: 0": 90680, "autor": "dxnah", "date": 1556708000000, "content": "What could this be? Problem with fast shutter? /!/ I decided to get into film photography as a hobby. So recently I got my hands on a Zorki 4 film camera and just got the photos from my second ever film roll. Sadly a lot of the photos have a black stripe or spot (? Really unsure how to describe it) on the side of the photo. The size of the 'stripe' varies though.  \nUnfortunately I don't know the settings I used (maybe I should write that down the next time), but it seems like the affected photos were shot at a faster shutter speed (either 1/1000 or 1/500), because photos I shot with a slower shutter speed in lower light seem to be completely fine.  \n  \n[Here](https://imgur.com/a/rBnn4EW) are some examples. \n\nSo could this problem be the faster shutter speed or maybe something else that I'm not familiar with?  \nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bjfpwf/what_could_this_be_problem_with_fast_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what could this be? problem with fast shutter? /!/ i decided to get into film photography as a hobby. so recently i got my hands on a zorki 4 film camera and just got the photos from my second ever film roll. sadly a lot of the photos have a black stripe or -----> spot !!!  (? really unsure how to describe it) on the side of the photo. the size of the 'stripe' varies though.  \nunfortunately i don't know the settings i used (maybe i should write that down the next time), but it seems like the affected photos were shot at a faster shutter speed (either 1/1000 or 1/500), because photos i shot with a slower shutter speed in lower light seem to be completely fine.  \n  \n[here](https://imgur.com/a/rbnn4ew) are some examples. \n\nso could this problem be the faster shutter speed or maybe something else that i'm not familiar with?  \nthanks!", "sortedWord": "None", "identifyer": 93168, "year": "2019"}, {"Unnamed: 0": 90757, "autor": "keepswap", "date": 1558141179000, "content": "What is the orange spot between f4 and f8 for? [Biometar Carl Zeiss Jena 120mm] /!/ &amp;#x200B;\n\nhttps://i.redd.it/txwkf60pavy21.jpg", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bpz73e/what_is_the_orange_spot_between_f4_and_f8_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is the orange -----> spot !!!  between f4 and f8 for? [biometar carl zeiss jena 120mm] /!/ &amp;#x200b;\n\nhttps://i.redd.it/txwkf60pavy21.jpg", "sortedWord": "None", "identifyer": 93245, "year": "2019"}, {"Unnamed: 0": 90758, "autor": "keepswap", "date": 1558140583000, "content": "What is the orange spot between f4 and f8 for? [Biometar Carl Zeiss Jena 120mm]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bpz3sy/what_is_the_orange_spot_between_f4_and_f8_for/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is the orange -----> spot !!!  between f4 and f8 for? [biometar carl zeiss jena 120mm]", "sortedWord": "None", "identifyer": 93246, "year": "2019"}, {"Unnamed: 0": 90769, "autor": "soundslikeaJaplan", "date": 1558072284000, "content": "New Hasselblad 50mm lens - there appear to be spots over one element. Dust or fungus?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bpnfu6/new_hasselblad_50mm_lens_there_appear_to_be_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "new hasselblad 50mm lens - there appear to be -----> spots !!!  over one element. dust or fungus?", "sortedWord": "None", "identifyer": 93257, "year": "2019"}, {"Unnamed: 0": 90881, "autor": "Ikuze321", "date": 1575672745000, "content": "Need help, want to learn flash, I have a mamiya 645 pro TL /!/ What flash should i buy for this camera? I know it has a weird flash port spot on it, should i make sure to buy a left hand grip that i can put the flash on to put it in a better spot? Thanks a lot. If you have this camera and use flash and could help me out that'd be nice. thanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e75y47/need_help_want_to_learn_flash_i_have_a_mamiya_645/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need help, want to learn flash, i have a mamiya 645 pro tl /!/ what flash should i buy for this camera? i know it has a weird flash port -----> spot !!!  on it, should i make sure to buy a left hand grip that i can put the flash on to put it in a better -----> spot !!! ? thanks a lot. if you have this camera and use flash and could help me out that'd be nice. thanks", "sortedWord": "None", "identifyer": 93369, "year": "2019"}, {"Unnamed: 0": 90984, "autor": "po1aroidz", "date": 1577165334000, "content": "Recommendations for small 120 cameras /!/ I’m in the market for a smaller 120 camera. I currently have a RB67 and I love it but the thing is too damn heavy for my bag. I can’t take my usual bag because of it’s size. My dad has a Hasselblad 503cx and I love that size of camera. The spot I have in my bag isn’t big, but the 503cx with a back and a medium sized lens fits perfectly so I’m looking for something along those lines in terms of size. I am looking at a Bronica SQ-A and I think that’s the camera for me but I just want to see if there are any other options I can look at. (I also like the square format). I’m looking for a modular system so SLRs are ideal.  Any recommendations are welcome. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eewvfq/recommendations_for_small_120_cameras/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "recommendations for small 120 cameras /!/ i’m in the market for a smaller 120 camera. i currently have a rb67 and i love it but the thing is too damn heavy for my bag. i can’t take my usual bag because of it’s size. my dad has a hasselblad 503cx and i love that size of camera. the -----> spot !!!  i have in my bag isn’t big, but the 503cx with a back and a medium sized lens fits perfectly so i’m looking for something along those lines in terms of size. i am looking at a bronica sq-a and i think that’s the camera for me but i just want to see if there are any other options i can look at. (i also like the square format). i’m looking for a modular system so slrs are ideal.  any recommendations are welcome. thanks!", "sortedWord": "None", "identifyer": 93475, "year": "2019"}, {"Unnamed: 0": 90987, "autor": "rowapair", "date": 1577159214000, "content": "Best place to buy cheap cameras in NYC /!/ I'm going to be in the city in a couple days and I was wondering where the best spots are to buy cheap cameras. Emphasize on cheap lol. \n\nAny thrift store particularly known for hidden gems?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eevo7u/best_place_to_buy_cheap_cameras_in_nyc/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "best place to buy cheap cameras in nyc /!/ i'm going to be in the city in a couple days and i was wondering where the best -----> spots !!!  are to buy cheap cameras. emphasize on cheap lol. \n\nany thrift store particularly known for hidden gems?", "sortedWord": "None", "identifyer": 93478, "year": "2019"}, {"Unnamed: 0": 91045, "autor": "Bjansenful3", "date": 1565506056000, "content": "Suggestions for cheap lightmeters please /!/ I was looking for a cheap lightmeter and am not really sure which one to get or if I should get a spot meter. \nSuggestions?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cotmdo/suggestions_for_cheap_lightmeters_please/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "suggestions for cheap lightmeters please /!/ i was looking for a cheap lightmeter and am not really sure which one to get or if i should get a -----> spot !!!  meter. \nsuggestions?", "sortedWord": "None", "identifyer": 93536, "year": "2019"}, {"Unnamed: 0": 91061, "autor": "renearends0", "date": 1565426939000, "content": "Strange spots on my negative", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cofoia/strange_spots_on_my_negative/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "strange -----> spots !!!  on my negative", "sortedWord": "None", "identifyer": 93552, "year": "2019"}, {"Unnamed: 0": 91066, "autor": "o-universaldonor", "date": 1565397602000, "content": "Back from the lab - what causes the black spots on the right side?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cob4ai/back_from_the_lab_what_causes_the_black_spots_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "back from the lab - what causes the black -----> spots !!!  on the right side?", "sortedWord": "None", "identifyer": 93557, "year": "2019"}, {"Unnamed: 0": 91210, "autor": "s_romo", "date": 1565633046000, "content": "Om2 spot/program /!/ Does anybody have any experience with this camera? I've heard a lot of good things about the om2 and especially om2n, but not much discussion on the sp version. It has the same capabilities as the other om2:s and in addition a program mode and spot metering in manual mode. Still it tends to go for less than the om2n. Seems like a good candidate for me, are there common reliability or electrical issues I should know about?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cpg2kn/om2_spotprogram/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "om2 -----> spot !!! /program /!/ does anybody have any experience with this camera? i've heard a lot of good things about the om2 and especially om2n, but not much discussion on the sp version. it has the same capabilities as the other om2:s and in addition a program mode and spot metering in manual mode. still it tends to go for less than the om2n. seems like a good candidate for me, are there common reliability or electrical issues i should know about?", "sortedWord": "None", "identifyer": 93701, "year": "2019"}, {"Unnamed: 0": 91270, "autor": "StyleDemon", "date": 1560619646000, "content": "Can anyone tell me what his weird \"glasses\" looking mark on the top right is? It's found in the same spot on all of my frames? Shot on a Canon AE-1.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c0zs57/can_anyone_tell_me_what_his_weird_glasses_looking/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can anyone tell me what his weird \"glasses\" looking mark on the top right is? it's found in the same -----> spot !!!  on all of my frames? shot on a canon ae-1.", "sortedWord": "None", "identifyer": 93762, "year": "2019"}, {"Unnamed: 0": 91391, "autor": "FloopersRetreat", "date": 1549725618000, "content": "Spotted in Kendal, Cumbria: Yashica T4 special edition for 200 quid.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/aot6q5/spotted_in_kendal_cumbria_yashica_t4_special/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  in kendal, cumbria: yashica t4 special edition for 200 quid.", "sortedWord": "None", "identifyer": 93884, "year": "2019"}, {"Unnamed: 0": 91412, "autor": "loscabospink", "date": 1549577433000, "content": "My review of the Lomography Konstructor camera, part one /!/ Hey fellow film photographers.\n\n&amp;#x200B;\n\nI recently ordered the Lomography Konstructor camera. Given the 5.0 rating on Amazon.ca, I thought it would be a great introduction into Lomography's line of toy cameras.\n\n&amp;#x200B;\n\nThis is Part One of my review. It will include almost assembling the camera. Hopefully Part Two will include a full assembly, and if all goes as planned, shooting film.\n\n&amp;#x200B;\n\n**Unboxing**\n\n[Looks like somebody did a portion of the assembly for me. Hooray!](https://i.redd.it/n3sh597ww7f21.jpg)\n\nUpon opening the box, I was immediately struck by the haphazard way in which the camera's components were situated. I quickly took a peek at the Amazon box from which it came; it seemed perfectly intact. Upon closer inspection, I realized that somebody had taken the liberty of assembling the camera partially (\\~25%) for me. \n\nThe viewfinder was placed (missing the focusing screen - never did locate that) on top of the back of the camera. The spot from which the lens would normally be found was empty, thus causing immediate concern. \n\nThe decals were bend and shoved into a rectangular box. Who needs decals anyway? My Leica has black electrical tape on it for God's sake!\n\nThe plastic frames that I can only assume held parts were empty, and the screws and other assorted odds and ends, as well as the lens (!!!) and a partially-assembled winding mechanism were placed in red Ikea bags. Unfortunately, said Ikea bags were partially open, leading to various tiny screws and springs scattering around the box; Lomography's collaboration with Ikea came as a surprise to me, much like the rest of the box's contents.\n\n**Assembly**\n\n[I feel like I cheated by paying full price for an already assembled camera. They should charge more for that, no?](https://i.redd.it/0euk4z0ex7f21.jpg)\n\nI decided to try and complete the assembly of the camera. It was admittedly difficult to trace where the previous owner of my brand new Lomography Konstructor camera decided to halt assembly, so starting from the beginning, I traced their suspected workflow up until I was to assemble the shutter speed switch.\n\n&amp;#x200B;\n\nSadly, this is where my review must end: the tiny spring that is supposed to handle changing the shutter speed was mangled into a hook-like object, and could not be installed onto its' respective post on the backside of the camera's body.\n\n&amp;#x200B;\n\n**Conclusion**\n\nI decided to contact Lomography HQ in Brooklyn, NY, but received no response over the phone, or by email. I suspect that Amazon will have to rectify this issue for me, so I will report back with Part Two in due time.\n\n&amp;#x200B;\n\nCheers, and thanks for reading.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ao9bfn/my_review_of_the_lomography_konstructor_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my review of the lomography konstructor camera, part one /!/ hey fellow film photographers.\n\n&amp;#x200b;\n\ni recently ordered the lomography konstructor camera. given the 5.0 rating on amazon.ca, i thought it would be a great introduction into lomography's line of toy cameras.\n\n&amp;#x200b;\n\nthis is part one of my review. it will include almost assembling the camera. hopefully part two will include a full assembly, and if all goes as planned, shooting film.\n\n&amp;#x200b;\n\n**unboxing**\n\n[looks like somebody did a portion of the assembly for me. hooray!](https://i.redd.it/n3sh597ww7f21.jpg)\n\nupon opening the box, i was immediately struck by the haphazard way in which the camera's components were situated. i quickly took a peek at the amazon box from which it came; it seemed perfectly intact. upon closer inspection, i realized that somebody had taken the liberty of assembling the camera partially (\\~25%) for me. \n\nthe viewfinder was placed (missing the focusing screen - never did locate that) on top of the back of the camera. the -----> spot !!!  from which the lens would normally be found was empty, thus causing immediate concern. \n\nthe decals were bend and shoved into a rectangular box. who needs decals anyway? my leica has black electrical tape on it for god's sake!\n\nthe plastic frames that i can only assume held parts were empty, and the screws and other assorted odds and ends, as well as the lens (!!!) and a partially-assembled winding mechanism were placed in red ikea bags. unfortunately, said ikea bags were partially open, leading to various tiny screws and springs scattering around the box; lomography's collaboration with ikea came as a surprise to me, much like the rest of the box's contents.\n\n**assembly**\n\n[i feel like i cheated by paying full price for an already assembled camera. they should charge more for that, no?](https://i.redd.it/0euk4z0ex7f21.jpg)\n\ni decided to try and complete the assembly of the camera. it was admittedly difficult to trace where the previous owner of my brand new lomography konstructor camera decided to halt assembly, so starting from the beginning, i traced their suspected workflow up until i was to assemble the shutter speed switch.\n\n&amp;#x200b;\n\nsadly, this is where my review must end: the tiny spring that is supposed to handle changing the shutter speed was mangled into a hook-like object, and could not be installed onto its' respective post on the backside of the camera's body.\n\n&amp;#x200b;\n\n**conclusion**\n\ni decided to contact lomography hq in brooklyn, ny, but received no response over the phone, or by email. i suspect that amazon will have to rectify this issue for me, so i will report back with part two in due time.\n\n&amp;#x200b;\n\ncheers, and thanks for reading.", "sortedWord": "None", "identifyer": 93906, "year": "2019"}, {"Unnamed: 0": 91428, "autor": "undressedlunch", "date": 1569554557000, "content": "Dark spot on light sensor; details in comments", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d9umsv/dark_spot_on_light_sensor_details_in_comments/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dark -----> spot !!!  on light sensor; details in comments", "sortedWord": "None", "identifyer": 93923, "year": "2019"}, {"Unnamed: 0": 91618, "autor": "lordywithus", "date": 1551402343000, "content": "Little white spots on film strip /!/ Hello everyone, I developed film for the first time and there’s white spots on them. What is it and how can i get rid of it? ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/avylme/little_white_spots_on_film_strip/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "little white -----> spots !!!  on film strip /!/ hello everyone, i developed film for the first time and there’s white spots on them. what is it and how can i get rid of it? ", "sortedWord": "None", "identifyer": 94115, "year": "2019"}, {"Unnamed: 0": 91760, "autor": "ullalala", "date": 1572473955000, "content": "Red splotches from the lab or a faulty film roll? /!/ Recently got back a film from the lab (Fuji Superia 400) and noticed different red spots on many of the frames. To clarify: the spots are red on the scans, so cyan on the actual negative. The spots are roughly in the same area, but in different patterns, and not on all the photos from the specific roll, but about 6-7 of them (in the middle of the roll). When I asked the clerk at the developer's about the spots, he suggested it was either the camera's fault or the film roll that's faulty. I have a hard time believing it could be related to the camera itself (different spots on only some of the photos, plus they are round so rather look like bubbles or droplets of some description not like scratches or light leaks). He was very sure that it was not anything related to the development process – as he would, I guess, as a clerk in a photography store. Has anyone seen stuff like that before? What could it be caused by? A faulty film roll or rather some specific mistake in the development process?\n\nAll suggestions are welcome!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dpdwrv/red_splotches_from_the_lab_or_a_faulty_film_roll/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "red splotches from the lab or a faulty film roll? /!/ recently got back a film from the lab (fuji superia 400) and noticed different red -----> spots !!!  on many of the frames. to clarify: the spots are red on the scans, so cyan on the actual negative. the spots are roughly in the same area, but in different patterns, and not on all the photos from the specific roll, but about 6-7 of them (in the middle of the roll). when i asked the clerk at the developer's about the spots, he suggested it was either the camera's fault or the film roll that's faulty. i have a hard time believing it could be related to the camera itself (different spots on only some of the photos, plus they are round so rather look like bubbles or droplets of some description not like scratches or light leaks). he was very sure that it was not anything related to the development process – as he would, i guess, as a clerk in a photography store. has anyone seen stuff like that before? what could it be caused by? a faulty film roll or rather some specific mistake in the development process?\n\nall suggestions are welcome!", "sortedWord": "None", "identifyer": 94257, "year": "2019"}, {"Unnamed: 0": 91913, "autor": "sm_see", "date": 1562047834000, "content": "Preferred 35mm for architecture/street? /!/ Headed to Chicago Friday (it’s 20 miles away) to wander and shoot.. looking for suggestions for film to bring with. \n\nPlanning to take the train, have a few indoor spots picked.. mostly bright, maybe shadowy, but also just wandering around in the loop (read city canyon) kinda film.  \n\nThinking I want to shoot Ektar, but I’m concerned about being (box) stuck at 100.  Familiar with Portra 400 already, not really interested in shooting that.  \n\nAny tips or suggestions?  \n\nGear for the day: Canon A-1, 28 f/2 &amp; 55 f/1.2.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/c85n7n/preferred_35mm_for_architecturestreet/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "preferred 35mm for architecture/street? /!/ headed to chicago friday (it’s 20 miles away) to wander and shoot.. looking for suggestions for film to bring with. \n\nplanning to take the train, have a few indoor -----> spots !!!  picked.. mostly bright, maybe shadowy, but also just wandering around in the loop (read city canyon) kinda film.  \n\nthinking i want to shoot ektar, but i’m concerned about being (box) stuck at 100.  familiar with portra 400 already, not really interested in shooting that.  \n\nany tips or suggestions?  \n\ngear for the day: canon a-1, 28 f/2 &amp; 55 f/1.2.", "sortedWord": "None", "identifyer": 94410, "year": "2019"}, {"Unnamed: 0": 92010, "autor": "stephster18", "date": 1563472936000, "content": "Film recommendations please! Canyon shooting on Minoltas /!/ Hi there! I shoot film on my Minolta x700 and the Minolta 101- simple stuff- but I'm about to take a trip to Idaho and Utah where I'll be taking a lot of canyon pictures- red and brown earthy tones. \\*Could someone recommend some interesting film to shoot with?\\* I usually use Fuji Supra 400 for outdoor and I love it but hoping to brach out if possible. Also if anyone knows of cool spots to shoot in that area I'm looking for recommendations. Thanks! :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cevxhf/film_recommendations_please_canyon_shooting_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film recommendations please! canyon shooting on minoltas /!/ hi there! i shoot film on my minolta x700 and the minolta 101- simple stuff- but i'm about to take a trip to idaho and utah where i'll be taking a lot of canyon pictures- red and brown earthy tones. \\*could someone recommend some interesting film to shoot with?\\* i usually use fuji supra 400 for outdoor and i love it but hoping to brach out if possible. also if anyone knows of cool -----> spots !!!  to shoot in that area i'm looking for recommendations. thanks! :)", "sortedWord": "None", "identifyer": 94507, "year": "2019"}, {"Unnamed: 0": 92076, "autor": "well_composed", "date": 1559164975000, "content": "Techniques for shooting without a meter? /!/ I’ve been experimenting with different metering styles but mostly ones that don’t require a meter. Do you guys have any special techniques or tricks?\n\nMy first type is the wide open technique. I’m a fan of the style and just stop down if I expect gross overexposure. I get great/decent results but I know that’s not everyone’s jam. \n\nSecondly I’ve been really experimenting with Sunny 16. When I want a different aperture or shutter speed, I start at the base Sunny 16 reading for a scene and then move my dials to scale. So if in bright daylight my shutter speed is at 1/250 (rating 400iso at half box speed) and my aperture is f/16, then I can have an aperture of f/8 by moving the aperture down two stops and my shutter speed down two stops also. (F/8 at 1/60th).  Also I use a little chart that shows how many stops to account for if in shade, open shade, sunset etc but it’s pretty straightforward. \n\nDoes anyone else do this? Does it even work? I haven’t been able to find much info on altering the formula like that. My last roll came out great except I had to get a shutter lag repaired so I don’t want to count that as my final test result yet. \n\nWhen I’m really unsure I whip out my Lumu. I haven’t really tried spot metering from a phone app yet because I don’t really know how reliable it is in tricky situations. \n\nWhat’s your style?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/buket2/techniques_for_shooting_without_a_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "techniques for shooting without a meter? /!/ i’ve been experimenting with different metering styles but mostly ones that don’t require a meter. do you guys have any special techniques or tricks?\n\nmy first type is the wide open technique. i’m a fan of the style and just stop down if i expect gross overexposure. i get great/decent results but i know that’s not everyone’s jam. \n\nsecondly i’ve been really experimenting with sunny 16. when i want a different aperture or shutter speed, i start at the base sunny 16 reading for a scene and then move my dials to scale. so if in bright daylight my shutter speed is at 1/250 (rating 400iso at half box speed) and my aperture is f/16, then i can have an aperture of f/8 by moving the aperture down two stops and my shutter speed down two stops also. (f/8 at 1/60th).  also i use a little chart that shows how many stops to account for if in shade, open shade, sunset etc but it’s pretty straightforward. \n\ndoes anyone else do this? does it even work? i haven’t been able to find much info on altering the formula like that. my last roll came out great except i had to get a shutter lag repaired so i don’t want to count that as my final test result yet. \n\nwhen i’m really unsure i whip out my lumu. i haven’t really tried -----> spot !!!  metering from a phone app yet because i don’t really know how reliable it is in tricky situations. \n\nwhat’s your style?", "sortedWord": "None", "identifyer": 94576, "year": "2019"}, {"Unnamed: 0": 92217, "autor": "stengunner93", "date": 1567203737000, "content": "Spotted: Kubrick’s fabled Zeiss 50mm 0.7", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cxnum5/spotted_kubricks_fabled_zeiss_50mm_07/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!! : kubrick’s fabled zeiss 50mm 0.7", "sortedWord": "None", "identifyer": 94717, "year": "2019"}, {"Unnamed: 0": 92261, "autor": "McDonaldsFrenchFry", "date": 1566971705000, "content": "Can someone please tell me what the deal is with scanners? /!/ Hello /r/AnalogCommunity,\n\nI've read the /r/Analog faq but I'm still pretty confused on the topic.  I have shot probably around 20 rolls of film in the past 7 months or so and the cost of development and scanning is getting higher.  I'm currently shooting 35mm and polaroids, but would like to soon get into medium format and hopefully some day large format.  \n\nAt the local lab I go to they normally take about a week to process/scan and the cost is around $20 per roll.  I have only been doing normal scans but you can do .tifs for + $3, \"Max scans\" for +$5, and to get max tif scans it's +$10.  I've found that I don't always love their scans when I don't get the exposure quite right.  What I get are .jpgs that are 3089x2048.  The employees say that the scanner they have is not a drum scanner, but is a $500k Noritsu scanner.\n\nI'm getting to the point where I'd like to tweak scan settings and get more artistic control out of my photos as well as begin editing more than just adjusting the black and white point in Preview.  I'd also like to scan my polaroids but that's not a top priority.  \n\nMy main concern is getting a scanner that will give me better results than the scans I'm currently getting back from the lab without way overspending.  I literally have no idea what to spend.  People say that the Epson v800 flatbed scanners leave a lot to be desired, but those cost about $1k!  And the scanners people do recommend are only available used and from the 90s for even greater sums of money.  I want not only greater fidelity/resolution but also the artistic control that comes with scanning yourself.  \n\nI figured that scanning technology would be much further along than this, or at least cheaper.  I guess its just cuz low quality scans are ok for most other applications?  And film is just so dense with information that its an edge use case?  Did they stop making good scanners after the year 2000?  A little history would be greatly appreciated.\n\nThank you so much for reading all the way through this.  I just wanted to fully explain my situation and give an accurate view of where I'm at.  I just want to know where the sweet spot is so that I get quality but don't have to spend a ton of money.  I don't own a DSLR but I do have a friend that does so that way of scanning isn't totally off the table if the equipment to do DSLR scans isn't prohibitively expensive for use with a borrowed camera.  Ideally I would be doing optical prints but that is a can of worms I'm not ready to open yet haha.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cwgndt/can_someone_please_tell_me_what_the_deal_is_with/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone please tell me what the deal is with scanners? /!/ hello /r/analogcommunity,\n\ni've read the /r/analog faq but i'm still pretty confused on the topic.  i have shot probably around 20 rolls of film in the past 7 months or so and the cost of development and scanning is getting higher.  i'm currently shooting 35mm and polaroids, but would like to soon get into medium format and hopefully some day large format.  \n\nat the local lab i go to they normally take about a week to process/scan and the cost is around $20 per roll.  i have only been doing normal scans but you can do .tifs for + $3, \"max scans\" for +$5, and to get max tif scans it's +$10.  i've found that i don't always love their scans when i don't get the exposure quite right.  what i get are .jpgs that are 3089x2048.  the employees say that the scanner they have is not a drum scanner, but is a $500k noritsu scanner.\n\ni'm getting to the point where i'd like to tweak scan settings and get more artistic control out of my photos as well as begin editing more than just adjusting the black and white point in preview.  i'd also like to scan my polaroids but that's not a top priority.  \n\nmy main concern is getting a scanner that will give me better results than the scans i'm currently getting back from the lab without way overspending.  i literally have no idea what to spend.  people say that the epson v800 flatbed scanners leave a lot to be desired, but those cost about $1k!  and the scanners people do recommend are only available used and from the 90s for even greater sums of money.  i want not only greater fidelity/resolution but also the artistic control that comes with scanning yourself.  \n\ni figured that scanning technology would be much further along than this, or at least cheaper.  i guess its just cuz low quality scans are ok for most other applications?  and film is just so dense with information that its an edge use case?  did they stop making good scanners after the year 2000?  a little history would be greatly appreciated.\n\nthank you so much for reading all the way through this.  i just wanted to fully explain my situation and give an accurate view of where i'm at.  i just want to know where the sweet -----> spot !!!  is so that i get quality but don't have to spend a ton of money.  i don't own a dslr but i do have a friend that does so that way of scanning isn't totally off the table if the equipment to do dslr scans isn't prohibitively expensive for use with a borrowed camera.  ideally i would be doing optical prints but that is a can of worms i'm not ready to open yet haha.", "sortedWord": "None", "identifyer": 94761, "year": "2019"}, {"Unnamed: 0": 92297, "autor": "TenSchruteBucks", "date": 1566773246000, "content": "Do you like to be approached by other film photographers? /!/ Sometimes I'll spot other film photographers and think about starting a conversation. Just to see what they shoot, how long they've been using film but I rarely ever do as to not be intrusive, especially when they're with someone else.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cvfi0j/do_you_like_to_be_approached_by_other_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "do you like to be approached by other film photographers? /!/ sometimes i'll -----> spot !!!  other film photographers and think about starting a conversation. just to see what they shoot, how long they've been using film but i rarely ever do as to not be intrusive, especially when they're with someone else.", "sortedWord": "None", "identifyer": 94797, "year": "2019"}, {"Unnamed: 0": 92303, "autor": "jackthatsme123", "date": 1566764225000, "content": "How can I spot meter with a Weston master light meter? /!/ So let’s say there’s a backlight on a persons face and I don’t want the camera to meter for that, would I just turn the Weston meter towards me in front of their face?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/cvdm2h/how_can_i_spot_meter_with_a_weston_master_light/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how can i -----> spot !!!  meter with a weston master light meter? /!/ so let’s say there’s a backlight on a persons face and i don’t want the camera to meter for that, would i just turn the weston meter towards me in front of their face?", "sortedWord": "None", "identifyer": 94803, "year": "2019"}, {"Unnamed: 0": 92315, "autor": "tdstooksbury", "date": 1554650972000, "content": "Newbie medium format questions. /!/ Hey all, I’m new to medium format. I just bough a Mamiya RB67 Pro S. I have a couple of questions.\n\n1) Do I meter the same way I would for 35mm? Are there any conversions that I need to consider? For example is f/4 on 120 the same as 35mm? I only ask because I’ve heard people say it’s different but then I don’t see why it would be different and it’s confused me.\n\nI’d like to bring my AE-1 or K1000 or something with me to spot meter.  I get pretty good exposures with those. I shot a roll of ektachrome last week and nailed every exposure.\n\n2) Does anyone have a good suggestion for a decent Tripod. I was thinking I might get a small manfroto video tripod since I have a rotating back. Any honorable mentions?\n\nI’ve never been so excited to get a new camera.\n\n", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bahe5k/newbie_medium_format_questions/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "newbie medium format questions. /!/ hey all, i’m new to medium format. i just bough a mamiya rb67 pro s. i have a couple of questions.\n\n1) do i meter the same way i would for 35mm? are there any conversions that i need to consider? for example is f/4 on 120 the same as 35mm? i only ask because i’ve heard people say it’s different but then i don’t see why it would be different and it’s confused me.\n\ni’d like to bring my ae-1 or k1000 or something with me to -----> spot !!!  meter.  i get pretty good exposures with those. i shot a roll of ektachrome last week and nailed every exposure.\n\n2) does anyone have a good suggestion for a decent tripod. i was thinking i might get a small manfroto video tripod since i have a rotating back. any honorable mentions?\n\ni’ve never been so excited to get a new camera.\n\n", "sortedWord": "None", "identifyer": 94815, "year": "2019"}, {"Unnamed: 0": 92358, "autor": "HunsenAbadeer", "date": 1554359045000, "content": "Spots on photo caused by camera, film or processing?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b9969r/spots_on_photo_caused_by_camera_film_or_processing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!!  on photo caused by camera, film or processing?", "sortedWord": "None", "identifyer": 94859, "year": "2019"}, {"Unnamed: 0": 92453, "autor": "KingOfTheP4s", "date": 1547925716000, "content": "Anyone know what is causing these odd spots on my pictures in my Kodak Brownie Hawkeye?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ahp7yp/anyone_know_what_is_causing_these_odd_spots_on_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone know what is causing these odd -----> spots !!!  on my pictures in my kodak brownie hawkeye?", "sortedWord": "None", "identifyer": 94954, "year": "2019"}, {"Unnamed: 0": 92507, "autor": "BrianAndree", "date": 1547591431000, "content": "Need an opinion on some scans /!/ I had some film developed at my local store, I picked them up (sleeved) and took them home to scan. I then took the scan out of the sleeve, blew the negatives with some canned air and wiped them with a anti static cloth. However, my scans looked like this (every one for 2 rolls of 36 exposure portra was dusty similar to these, the dust was in different spots but every frame had tons of dust)\n\nhttps://imgur.com/a/Q28Ev5g\n\nI then wiped down my scanner and cleaned the negatives again, it did make a bit of a different but they were still pretty similar. So, I took the negatives and a SD card with the scans to the store. They told me a moderate amount of dust like this was normal and maybe it was my scanner, and then recommended I got their 10$ pro scans.\n\nHowever, I don’t think this is a issue on my part. I know if the film would have gotten dust inside the camera, it would have shown up black. Now, I used this scanner before with film from the same store and have NEVER had this issue.\n\nI’m not really sure what’s going on and they really didn’t have an explanation, but if the dust isn’t coming off then is it in the negative? I’m just very lost and upset and could use some direction.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/age7bs/need_an_opinion_on_some_scans/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "need an opinion on some scans /!/ i had some film developed at my local store, i picked them up (sleeved) and took them home to scan. i then took the scan out of the sleeve, blew the negatives with some canned air and wiped them with a anti static cloth. however, my scans looked like this (every one for 2 rolls of 36 exposure portra was dusty similar to these, the dust was in different -----> spots !!!  but every frame had tons of dust)\n\nhttps://imgur.com/a/q28ev5g\n\ni then wiped down my scanner and cleaned the negatives again, it did make a bit of a different but they were still pretty similar. so, i took the negatives and a sd card with the scans to the store. they told me a moderate amount of dust like this was normal and maybe it was my scanner, and then recommended i got their 10$ pro scans.\n\nhowever, i don’t think this is a issue on my part. i know if the film would have gotten dust inside the camera, it would have shown up black. now, i used this scanner before with film from the same store and have never had this issue.\n\ni’m not really sure what’s going on and they really didn’t have an explanation, but if the dust isn’t coming off then is it in the negative? i’m just very lost and upset and could use some direction.", "sortedWord": "None", "identifyer": 95009, "year": "2019"}, {"Unnamed: 0": 92558, "autor": "analog-arvizubad", "date": 1557512372000, "content": "Hey guys I just developed at home and scanned this Ilford HP5 at home, when scanning on epson preview I didn’t see these black spots but once the scan was complete I noticed these. Any idea what this is ?? Or why this happened ??", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bn1rrh/hey_guys_i_just_developed_at_home_and_scanned/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hey guys i just developed at home and scanned this ilford hp5 at home, when scanning on epson preview i didn’t see these black -----> spots !!!  but once the scan was complete i noticed these. any idea what this is ?? or why this happened ??", "sortedWord": "None", "identifyer": 95060, "year": "2019"}, {"Unnamed: 0": 92629, "autor": "gayeae1712", "date": 1574939285000, "content": "Looking to purchase a light meter. Sekonic l208 or Sekonic l398? /!/ I’m open to any options but those are ones I keep seeing as highly recommended. I need one for a Mamiya RB67 which will be coming in the mail this week. I like that the 208 is mountable, so it is my first choice. I was also looking into the Pentax spot meter. Honestly I’m open to any suggestions, these are just the 3 I’ve seen recommended that are within my budget. Thanks in advance.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e2wmf0/looking_to_purchase_a_light_meter_sekonic_l208_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking to purchase a light meter. sekonic l208 or sekonic l398? /!/ i’m open to any options but those are ones i keep seeing as highly recommended. i need one for a mamiya rb67 which will be coming in the mail this week. i like that the 208 is mountable, so it is my first choice. i was also looking into the pentax -----> spot !!!  meter. honestly i’m open to any suggestions, these are just the 3 i’ve seen recommended that are within my budget. thanks in advance.", "sortedWord": "None", "identifyer": 95131, "year": "2019"}, {"Unnamed: 0": 92814, "autor": "andifall", "date": 1560286143000, "content": "Does my Leica need it's light seal replacing? /!/ Just bought a Leica M5, and I'm occasionally getting images like [this](https://imgur.com/eK2iDHf) and [this](https://imgur.com/t7JD77O).\n\nAs you can see I have some light leaks in the circled areas, in the same spots. \n\nThe only felt I can see in the M5 is [here](https://imgur.com/CN1UuSd). \n\nIn my opinion the lower part of the felt looks like it has rubbed off, which I am assuming is the problem.\n\nFirst off, am I correct in this assumption? And secondly, is this something I should do myself with some rubbing alcohol and adhesive felt, or should I pay a higher cost and get it done professionally at a camera shop?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bzhyz9/does_my_leica_need_its_light_seal_replacing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does my leica need it's light seal replacing? /!/ just bought a leica m5, and i'm occasionally getting images like [this](https://imgur.com/ek2idhf) and [this](https://imgur.com/t7jd77o).\n\nas you can see i have some light leaks in the circled areas, in the same -----> spots !!! . \n\nthe only felt i can see in the m5 is [here](https://imgur.com/cn1uusd). \n\nin my opinion the lower part of the felt looks like it has rubbed off, which i am assuming is the problem.\n\nfirst off, am i correct in this assumption? and secondly, is this something i should do myself with some rubbing alcohol and adhesive felt, or should i pay a higher cost and get it done professionally at a camera shop?", "sortedWord": "None", "identifyer": 95316, "year": "2019"}, {"Unnamed: 0": 92870, "autor": "filmbydrj", "date": 1572039999000, "content": "Black spots on positive BW /!/ [https://imgur.com/a/sQcuEmV](https://imgur.com/a/sQcuEmV)\n\nBeen struggling with these black dots on the positives on BW film. \n\nOn the negative, they appear white, so it does appear to be on the emulsion. \n\nI tried rewetting the negs, they don't go away.  \n\nI don't think it's water marks or dust, because they usually appear white, no?\n\nI'm deving in a filmomat, and I'm wondering if small particulate matter is getting in during dev, and if I need to clean the filmomat out. \n\nAnyone know what this could be?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dn4cxt/black_spots_on_positive_bw/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  on positive bw /!/ [https://imgur.com/a/sqcuemv](https://imgur.com/a/sqcuemv)\n\nbeen struggling with these black dots on the positives on bw film. \n\non the negative, they appear white, so it does appear to be on the emulsion. \n\ni tried rewetting the negs, they don't go away.  \n\ni don't think it's water marks or dust, because they usually appear white, no?\n\ni'm deving in a filmomat, and i'm wondering if small particulate matter is getting in during dev, and if i need to clean the filmomat out. \n\nanyone know what this could be?", "sortedWord": "None", "identifyer": 95373, "year": "2019"}, {"Unnamed: 0": 92921, "autor": "oddrey13", "date": 1571834775000, "content": "Not a huge deal, but.. my camera has these green rust/mold spots on them and no matter how much I scrub they’re not coming off easy. Any advice?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dlysmm/not_a_huge_deal_but_my_camera_has_these_green/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "not a huge deal, but.. my camera has these green rust/mold -----> spots !!!  on them and no matter how much i scrub they’re not coming off easy. any advice?", "sortedWord": "None", "identifyer": 95425, "year": "2019"}, {"Unnamed: 0": 92983, "autor": "_zeejet_", "date": 1570469838000, "content": "Troubleshooting some color film dev and scanning issues... /!/ \\[This was also posted in r/analog's weekly Ask Anything Thread FYI\\] \n\nI've got a few issues with film images that need troubleshooting this week: [https://imgur.com/a/DVB6P4u](https://imgur.com/a/DVB6P4u)\n\nFor context, I'm scanning using DLSR, Kaiser Slimlite Plano Lightbox, Lomo Digitaliza Masks, and NLP in LR.\n\n* Light spots in the same places across every image and across different cameras. I checked my light box and it was not the issue. I've narrowed it down to lens \\[Brand New 7artisans 60mm f2.8 1:1 Macro\\].  \n\n   * The spots come into focus around f5.6-f8 and are clearly defined at f16.\n   * I tried cleaning the front and rear elements with microfiber and duster but no good.\n   * I tried other lenses and no spots show up so it isn't the sensor.\n   * Is it possible that the dust is internal? I thought most internal dust did not affect images unless shot at f22 and yet here we are at f5.6 with spots. This lens is also brand new!\n   * Is it sub-optimal to scan at f4 to avoid the spots? Peak sharpness is usually f5.6-f11 for most lenses.\n* Corners and edges of shots taken using Portra 800 show a graduated brightening and color shift; almost like reverse vignetting.  \n\n   * Not likely light leaks as other films I've used on the same camera turn out fine.\n   * Color shift is usually blue or green although straight white is common as well.\n   * Could this be a development problem?\n* A regular pattern of light spots is faintly visible on some scans. This \"stipling\" effect is unwanted.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/demssk/troubleshooting_some_color_film_dev_and_scanning/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "troubleshooting some color film dev and scanning issues... /!/ \\[this was also posted in r/analog's weekly ask anything thread fyi\\] \n\ni've got a few issues with film images that need troubleshooting this week: [https://imgur.com/a/dvb6p4u](https://imgur.com/a/dvb6p4u)\n\nfor context, i'm scanning using dlsr, kaiser slimlite plano lightbox, lomo digitaliza masks, and nlp in lr.\n\n* light -----> spots !!!  in the same places across every image and across different cameras. i checked my light box and it was not the issue. i've narrowed it down to lens \\[brand new 7artisans 60mm f2.8 1:1 macro\\].  \n\n   * the spots come into focus around f5.6-f8 and are clearly defined at f16.\n   * i tried cleaning the front and rear elements with microfiber and duster but no good.\n   * i tried other lenses and no spots show up so it isn't the sensor.\n   * is it possible that the dust is internal? i thought most internal dust did not affect images unless shot at f22 and yet here we are at f5.6 with spots. this lens is also brand new!\n   * is it sub-optimal to scan at f4 to avoid the spots? peak sharpness is usually f5.6-f11 for most lenses.\n* corners and edges of shots taken using portra 800 show a graduated brightening and color shift; almost like reverse vignetting.  \n\n   * not likely light leaks as other films i've used on the same camera turn out fine.\n   * color shift is usually blue or green although straight white is common as well.\n   * could this be a development problem?\n* a regular pattern of light spots is faintly visible on some scans. this \"stipling\" effect is unwanted.", "sortedWord": "None", "identifyer": 95488, "year": "2019"}, {"Unnamed: 0": 93038, "autor": "wikipal", "date": 1570112075000, "content": "Quick question - lomo purple /!/ Going to shoot some lomo purple at night to give some of the popular photo spots in my city a more psychedelic look. Just a bit of fun. \n\nBut I am just worried now about reciprocity failure of the film. Anyone able to direct to me to a development sheet. (By the way I am probably going to shoot it at 100. So I probably if it has a low exposure time I will need to compensate, hence my concern.)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dcrhaz/quick_question_lomo_purple/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "quick question - lomo purple /!/ going to shoot some lomo purple at night to give some of the popular photo -----> spots !!!  in my city a more psychedelic look. just a bit of fun. \n\nbut i am just worried now about reciprocity failure of the film. anyone able to direct to me to a development sheet. (by the way i am probably going to shoot it at 100. so i probably if it has a low exposure time i will need to compensate, hence my concern.)", "sortedWord": "None", "identifyer": 95543, "year": "2019"}, {"Unnamed: 0": 93059, "autor": "JohnFAgda", "date": 1570019780000, "content": "There are black spots on all my scans, is this a developing or camera issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dc9lbc/there_are_black_spots_on_all_my_scans_is_this_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "there are black -----> spots !!!  on all my scans, is this a developing or camera issue?", "sortedWord": "None", "identifyer": 95564, "year": "2019"}, {"Unnamed: 0": 93107, "autor": "myntt", "date": 1569092890000, "content": "What are these spots/dots on my negatives? /!/ I'm scanning my negatives now and since I do it via DSLR scanning I can't use ICE. Giving the negatives a good blow with the rocket blower usually is enough to have a minimal amount of dust that I can easily heal within a few seconds. Thats with negatives that were developed in a proper lab.\n\nMy first four rolls of film were developed at DM or Rossmann which is a drug market that sends them over to a mass lab. These negatives are not put in a protective foil but simply tossed back in a paper bag. I've had pieces of the emulsion damaged (maybe from the machines) and fingerprints on them which led me to switch to a local lab. \n\nSo these mass lab developed negatives have to anomalies:\n\n1.) Blue/Greenish dots/spots:  https://i.imgur.com/bOavvYx.png\n\n2.) Brown dots: https://i.imgur.com/vtE6zKJ.png\n\nI assume the blue/greenish stuff is something wrong with the development and the brown stuff is peeled of emulsion? \n\nThe negatives from the local lab that I scanned yet do not seem to have these issues.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d7eqti/what_are_these_spotsdots_on_my_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!! /dots on my negatives? /!/ i'm scanning my negatives now and since i do it via dslr scanning i can't use ice. giving the negatives a good blow with the rocket blower usually is enough to have a minimal amount of dust that i can easily heal within a few seconds. thats with negatives that were developed in a proper lab.\n\nmy first four rolls of film were developed at dm or rossmann which is a drug market that sends them over to a mass lab. these negatives are not put in a protective foil but simply tossed back in a paper bag. i've had pieces of the emulsion damaged (maybe from the machines) and fingerprints on them which led me to switch to a local lab. \n\nso these mass lab developed negatives have to anomalies:\n\n1.) blue/greenish dots/spots:  https://i.imgur.com/boavvyx.png\n\n2.) brown dots: https://i.imgur.com/vte6zkj.png\n\ni assume the blue/greenish stuff is something wrong with the development and the brown stuff is peeled of emulsion? \n\nthe negatives from the local lab that i scanned yet do not seem to have these issues.", "sortedWord": "None", "identifyer": 95612, "year": "2019"}, {"Unnamed: 0": 93181, "autor": "KingSloppyBollocks", "date": 1568652280000, "content": "Mamiya Universal focus spot /!/ Just acquired a mamiya universal, 127mm f/4.7, 6x9 back, polaroid back and ground glass back for £75, one problem seems to be the focus spot doesn't move when i turn the focus ring, the frame lines move around but the spot does not. Is it suppose to? If so what can i do to fix the issue?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d53b16/mamiya_universal_focus_spot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mamiya universal focus -----> spot !!!  /!/ just acquired a mamiya universal, 127mm f/4.7, 6x9 back, polaroid back and ground glass back for £75, one problem seems to be the focus spot doesn't move when i turn the focus ring, the frame lines move around but the spot does not. is it suppose to? if so what can i do to fix the issue?", "sortedWord": "None", "identifyer": 95686, "year": "2019"}, {"Unnamed: 0": 93346, "autor": "ranalog", "date": 1576665875000, "content": "[META] The /r/AnalogCommunity 2019 \"Best of the Year\" Awards! - Nominations /!/ Welcome to the *third* annual \"Best of the Year\" awards! The reddit inc admins have kindly agreed \nto give away reddit gold to all subreddits with more than 1000 subscribers.\n\n**Categories and prizes**\n\nThe prize for each category is reddit community awards.\n\n* Best question\n* Best answer\n* Best news post\n* Best technique post\n* Best general or misc post\n\n\n**How to nominate**\n\nComment on this post linking to the post you wish to nominate. This thread will be in 'contest mode' so you can't see \nwho's winning until we make the announcement. Make sure to link to the post you are nominating and not just the photo. \nPlease check to make sure the post hasn't already been nominated, any duplicates will be removed as they mess up \nvoting.\n\n**Rules**\n\n* You can only nominate a post made in 2019.\n* You can **NOT** nominate your own posts.\n* Nominations can only happen in this post.\n* The nominations will **close on the end of December** and the winners will be announced in January once reddit inc \nhas given us the awards to distribute.\n* Each nominated post can only win one category. If a post wins in multiple categories, the mod team will decide the most \nappropriate category for the post to win.\n* Comments on this thread that aren't nominations, or are not replies to the category comments, will be removed.\n* The winners will **be decided by the number of votes in this *nomination* post**, not on the \noriginal post, with the prize going to the original poster. Should there be any dispute or tie, the moderation team's \ndecision is final.\n\nThe following list of top posts in this sub may help you if you are looking for a specific high scoring post, but you do not need to limit yourself to only a post listed here. Any post made during the year that fits into the categories is eligible.\n\n\n\nJanuary\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 237 | 2019-01-18 22:13:02 | [spash11](http://reddit.com/user/spash11) | [Anyone else using their bathroom as a darkroom?](https://redd.it/ahatin)\n2 | 224 | 2019-01-26 03:43:40 | [HogarthFerguson](http://reddit.com/user/HogarthFerguson) | [Ektachrome is very likely coming in 120, the best of all formats](https://redd.it/ajsrv8)\n3 | 223 | 2019-01-22 01:50:04 | [samyB_](http://reddit.com/user/samyB_) | [got myself a beautiful mamiya rb67 pro sd](https://redd.it/aiclo7)\n4 | 205 | 2019-01-28 04:59:05 | [guitard00d123](http://reddit.com/user/guitard00d123) | [first time shooting slide film - i'm in love!](https://redd.it/akfqiy)\n5 | 193 | 2019-01-25 06:19:22 | [jlin1847](http://reddit.com/user/jlin1847) | [My first medium format film camera :)](https://redd.it/aji0ay)\n6 | 183 | 2019-01-20 00:28:33 | [spaghetti_industries](http://reddit.com/user/spaghetti_industries) | [First two prints in my shed converted darkroom](https://redd.it/ahni33)\n7 | 160 | 2019-01-29 00:06:00 | [CrazyAnchovy](http://reddit.com/user/CrazyAnchovy) | [Pentax 645nii // 45mm 2.8 A // Provia expired 13yrs](https://redd.it/akoug5)\n8 | 154 | 2019-01-17 03:02:26 | [misstakukenihelvette](http://reddit.com/user/misstakukenihelvette) | [Just bought this for 40$. Only been used twice. The man even gave me a roll of film.](https://redd.it/agog9d)\n9 | 151 | 2019-01-27 02:09:02 | [jlin1847](http://reddit.com/user/jlin1847) | [My second mediun format camera](https://redd.it/ak3ar7)\n10 | 148 | 2019-01-07 07:04:18 | [infocalypse](http://reddit.com/user/infocalypse) | [Rollei 35, hand-written receipt from August 1971](https://redd.it/adb2bn)\n\n\nFebruary\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 290 | 2019-02-18 11:19:29 | [Pushkatron](http://reddit.com/user/Pushkatron) | [a friend just called me, showed this and asked how to rewind a fully shot roll](https://redd.it/arw98p)\n2 | 248 | 2019-02-25 14:04:55 | [vizualb](http://reddit.com/user/vizualb) | [A weapon to surpass Metal Gear...](https://redd.it/aull2z)\n3 | 218 | 2019-02-01 01:16:06 | [RuskiVato](http://reddit.com/user/RuskiVato) | [Browsing Craigslist when I found it. The holy grail, forged by a wizard, can capture ghosts.](https://redd.it/alrpxh)\n4 | 216 | 2019-02-02 11:41:55 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [a two hour drive and $50 later](https://redd.it/amad9l)\n5 | 198 | 2019-02-02 23:10:16 | [kid-blue](http://reddit.com/user/kid-blue) | [Thanks for all the good advice you guys gave me yesterday, I now have my RZ67!](https://redd.it/amev6z)\n6 | 195 | 2019-02-08 05:44:31 | [iAmTheAlchemist](http://reddit.com/user/iAmTheAlchemist) | [My homemade 4x5 is getting close to being finished!](https://redd.it/ao9175)\n7 | 184 | 2019-02-17 19:15:24 | [Whowhatwhen2](http://reddit.com/user/Whowhatwhen2) | [Getting back into film photography after a 10 year hiatus with my first ever rangefinder.](https://redd.it/arnv4s)\n8 | 181 | 2019-02-04 02:46:14 | [Uber_Name](http://reddit.com/user/Uber_Name) | [Bought my first 35mm 3 months ago. This is escalating quickly. (Fujica GW690)](https://redd.it/amsi8o)\n9 | 178 | 2019-02-11 22:32:52 | [Gibslayer](http://reddit.com/user/Gibslayer) | [Found my Grandfathers slides, all taken by him when working on the Severn Valley Railway.](https://redd.it/apgtf8)\n10 | 174 | 2019-02-20 00:04:51 | [Baby-Got-Books-1989](http://reddit.com/user/Baby-Got-Books-1989) | [Grabbed an Electro 35 with case and lens cap for $9 from Goodwill. Everything seems to work and even has a fresh battery.](https://redd.it/ashbch)\n\n\nMarch\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 263 | 2019-03-02 19:28:58 | [Odlavso](http://reddit.com/user/Odlavso) | [Found in a antique shop for 140$](https://redd.it/awlbd0)\n2 | 249 | 2019-03-23 01:45:46 | [Baby-Got-Books-1989](http://reddit.com/user/Baby-Got-Books-1989) | [I really really really dont need another camera. But a working AE-1 Program for $8 at Goodwill, how could I say no?](https://redd.it/b4dfx3)\n3 | 245 | 2019-03-30 23:12:29 | [jasentb](http://reddit.com/user/jasentb) | [Popular Photography Magazine: 1985](https://redd.it/b7h8pf)\n4 | 242 | 2019-03-02 02:17:33 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [Picked this up for $25 today!](https://redd.it/awcpns)\n5 | 235 | 2019-03-21 14:57:16 | [BDAfilm](http://reddit.com/user/BDAfilm) | [My uncle gave me his Nikon FM2](https://redd.it/b3rhz3)\n6 | 231 | 2019-03-24 15:45:10 | [enzio00](http://reddit.com/user/enzio00) | [Long before color-sensitive films were invented, Russian photographer Prokudin-Gorsky used to take 3 individual black-and-white photos, each with a filter (Red, Green, Blue) to create high-quality pictures in full color. This self portrait of him is 107 years old! (xpost /r/oldschoolcool)](https://redd.it/b4xqhi)\n7 | 227 | 2019-03-26 14:45:54 | [BDAfilm](http://reddit.com/user/BDAfilm) | [New Camera Day :: Olympus XA](https://redd.it/b5qkhd)\n8 | 211 | 2019-03-13 04:42:30 | [CondorMcDaniel](http://reddit.com/user/CondorMcDaniel) | [Picked this big boi up for cheap. Recently CLAd and looking brand new!](https://redd.it/b0huug)\n9 | 198 | 2019-03-19 23:10:18 | [StarboardBulwark](http://reddit.com/user/StarboardBulwark) | [TLR youtube review starter pack](https://redd.it/b34dgj)\n10 | 194 | 2019-03-09 15:04:17 | [shotbyjaked](http://reddit.com/user/shotbyjaked) | [Picked this lot up for 199 and even got a Nat Geo carry bag](https://redd.it/az4ccd)\n\n\nApril\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 349 | 2019-04-01 02:05:41 | [HogarthFerguson](http://reddit.com/user/HogarthFerguson) | [I'm leaving for Tibet tomorrow. This is the gear I'm taking with me.](https://redd.it/b7vbz7)\n2 | 347 | 2019-04-16 03:01:57 | [hardarseman](http://reddit.com/user/hardarseman) | [An early 80s newspaper clipping.](https://redd.it/bdoe21)\n3 | 285 | 2019-04-24 18:00:02 | [FromagedeBite](http://reddit.com/user/FromagedeBite) | [511 vs 6](https://redd.it/bgx31y)\n4 | 242 | 2019-04-23 00:36:39 | [asyoubreak](http://reddit.com/user/asyoubreak) | [todays thrift store come up](https://redd.it/bg93vi)\n5 | 233 | 2019-04-27 23:50:17 | [aeaguiar](http://reddit.com/user/aeaguiar) | [My Current Collection](https://redd.it/bi4n6o)\n6 | 231 | 2019-04-11 03:24:25 | [jeffk42](http://reddit.com/user/jeffk42) | [As Is, Untested eBay purchase. Had this note in the box](https://redd.it/bburk3)\n7 | 217 | 2019-04-07 01:23:18 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [First day with my new Hassy](https://redd.it/baas32)\n8 | 210 | 2019-04-27 18:07:46 | [l33tshietlord](http://reddit.com/user/l33tshietlord) | [Fits perfectly into chest pocket](https://redd.it/bi16iu)\n9 | 204 | 2019-04-05 20:45:43 | [geekwadpimp](http://reddit.com/user/geekwadpimp) | [I'm on a roll this week... just found this for $3. To prove I'm not just a karma whore with cool cameras, I took the picture while still in the thrift store.](https://redd.it/b9vqbj)\n10 | 199 | 2019-04-14 17:22:02 | [studiesinsilver](http://reddit.com/user/studiesinsilver) | [How do we feel about large format beauties here? Introducing my new 8x10 beast - the Toyo 810MII with Rodenstock 300/5.6.](https://redd.it/bd4fit)\n\n\nMay\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 550 | 2019-05-08 01:42:27 | [WhiteheadJ](http://reddit.com/user/WhiteheadJ) | [My granddad was an amateur photographer before he died in 1990. This was on slide film.](https://redd.it/blsy1x)\n2 | 336 | 2019-05-10 01:42:33 | [cunninglinguist666](http://reddit.com/user/cunninglinguist666) | [I developed my first roll of Black and White film, and im addicted now ! I had a panic attack when i saw the blank film at the beginning, and when i saw my first image i was ecstatic.](https://redd.it/bmm1vo)\n3 | 325 | 2019-05-15 23:05:18 | [veepeedeepee](http://reddit.com/user/veepeedeepee) | [Installed a Maxwell Hi-Lux screen in my Rolleiflex and the camera feels brand new.](https://redd.it/boycii)\n4 | 270 | 2019-05-31 05:36:28 | [mizonkey](http://reddit.com/user/mizonkey) | [5.99 gem find](https://redd.it/buy7jx)\n5 | 264 | 2019-05-19 09:29:09 | [thrftstorebndt](http://reddit.com/user/thrftstorebndt) | [Fueling my cheap 35mm addiction, got the whole lot for $5](https://redd.it/bqavah)\n6 | 249 | 2019-05-24 07:14:26 | [mabunday](http://reddit.com/user/mabunday) | [Edit your film!](https://redd.it/bs91uj)\n7 | 244 | 2019-05-07 12:06:31 | [isaacc7](http://reddit.com/user/isaacc7) | [Exposing the negative in the camera is just the first step. Post processing is necessary to get the picture the way you want it. This was all done long before photoshop. Full article linked in the comments.](https://redd.it/bllkms)\n8 | 213 | 2019-05-02 19:41:36 | [chrizzowski](http://reddit.com/user/chrizzowski) | [Someone forgot their Pentacon! Found on Sunshine Coast Trail, BC](https://redd.it/bjyhwu)\n9 | 207 | 2019-05-13 04:29:26 | [FonziusMaximus](http://reddit.com/user/FonziusMaximus) | [Snagged all this for $40 on a garage sale page - still testing but appears mint!](https://redd.it/bnt0um)\n10 | 201 | 2019-05-28 11:31:15 | [HogarthFerguson](http://reddit.com/user/HogarthFerguson) | [I picked up a Nikon S3 Millenium Edition this week in a trade. I think it will complement my Hasselblad on my travels.](https://redd.it/btul1c)\n\n\nJune\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 484 | 2019-06-25 00:30:30 | [W33dWiz420](http://reddit.com/user/W33dWiz420) | [I just thrifted original NASA slide copies made by Zeiss for educational purposes, to my surprise it has the moon landing.](https://redd.it/c4pv0i)\n2 | 478 | 2019-06-11 05:27:06 | [Parts_I-IX](http://reddit.com/user/Parts_I-IX) | [Got gifted a box from my friend's dad...](https://redd.it/bz2uoe)\n3 | 373 | 2019-06-03 09:19:20 | [GothPineapple](http://reddit.com/user/GothPineapple) | [Passed down to me from my father](https://redd.it/bw4a5i)\n4 | 279 | 2019-06-18 18:34:34 | [SamsonSmartypants](http://reddit.com/user/SamsonSmartypants) | [Found in a Tesco bag in a charity shop in London](https://redd.it/c205cr)\n5 | 268 | 2019-06-04 03:27:03 | [Gibslayer](http://reddit.com/user/Gibslayer) | [My mums been hiding this since the 80s... Can't wait to shoot it!](https://redd.it/bwe2sg)\n6 | 260 | 2019-06-02 17:13:41 | [magiera](http://reddit.com/user/magiera) | [Scored this baby for $13 today. Any advice?](https://redd.it/bvv8cn)\n7 | 244 | 2019-06-30 07:44:14 | [danielkauppi](http://reddit.com/user/danielkauppi) | [Well, this should last me awhile.](https://redd.it/c75ojz)\n8 | 238 | 2019-06-20 23:53:21 | [jasentb](http://reddit.com/user/jasentb) | [Picked this up at an estate sale for $50, Im in love!](https://redd.it/c2wzjd)\n9 | 237 | 2019-06-21 10:11:30 | [unsetname](http://reddit.com/user/unsetname) | [About a week and a half ago I asked about reciprocity failure and pushing Lomo 800 to 3200ISO, just got the scans back and this is the result](https://redd.it/c344mj)\n10 | 237 | 2019-06-10 13:34:37 | [jtam93](http://reddit.com/user/jtam93) | [Fujifilm: NEOPAN 100 ACROS II announced, begins shipping Autumn 2019 / EMULSIVE](https://redd.it/bytiif)\n\n\nJuly\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 464 | 2019-07-12 05:57:11 | [Private_weld](http://reddit.com/user/Private_weld) | [My local camera store is starting to carry some great stuff!](https://redd.it/cc17wu)\n2 | 400 | 2019-07-27 06:18:28 | [Tenburner](http://reddit.com/user/Tenburner) | [The mysterious red room](https://redd.it/ci8ns7)\n3 | 398 | 2019-07-17 10:53:44 | [fromthedice](http://reddit.com/user/fromthedice) | [Famous, Infamous, and not so Famous Photographs and their Cameras](https://redd.it/ce6fl1)\n4 | 332 | 2019-07-06 08:27:04 | [lardicus99](http://reddit.com/user/lardicus99) | [Aerochrome vs. Ektachrome shot of same scene](https://redd.it/c9mqeb)\n5 | 332 | 2019-07-28 00:20:29 | [knarfolled](http://reddit.com/user/knarfolled) | [This image is incredible](https://redd.it/ciipxv)\n6 | 312 | 2019-07-04 23:40:35 | [TheSonOfMuluh](http://reddit.com/user/TheSonOfMuluh) | [I think I have a problem.](https://redd.it/c93cfi)\n7 | 310 | 2019-07-01 08:41:43 | [GardenStateKing](http://reddit.com/user/GardenStateKing) | [Got my camera signed by Spike Lee today. He loved it.](https://redd.it/c7laxz)\n8 | 281 | 2019-07-29 03:08:36 | [rftwknd](http://reddit.com/user/rftwknd) | [Sunday Service - Weekly Cleaning and Dusting of My Film Shooters](https://redd.it/ciz5fb)\n9 | 271 | 2019-07-26 07:05:25 | [206v](http://reddit.com/user/206v) | [Had to wake up at 4AM to get to the estate sale super early but I think it was worth it!](https://redd.it/chu9m0)\n10 | 249 | 2019-07-22 22:22:34 | [Daniel_Melzer](http://reddit.com/user/Daniel_Melzer) | [Custom Leica M2](https://redd.it/cgd587)\n\n\nAugust\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 461 | 2019-08-03 03:22:53 | [cmazmanian](http://reddit.com/user/cmazmanian) | [Got my photos printed and put up at the local coffee shop! Feels good and they look great. Each one was shot on film and self developed](https://redd.it/cl7vc1)\n2 | 438 | 2019-08-07 23:02:25 | [darkassassinofdoom](http://reddit.com/user/darkassassinofdoom) | [What camera did Fan Ho use for Approaching Light ?](https://redd.it/cn66ic)\n3 | 388 | 2019-08-09 07:47:26 | [majoras-other-mask](http://reddit.com/user/majoras-other-mask) | [Loading the first roll of a home made camera.](https://redd.it/cntdua)\n4 | 377 | 2019-08-22 03:08:02 | [blurmageddon](http://reddit.com/user/blurmageddon) | [My buddy works for a movie studio. He sent me a photo of someone holding a 70mm film reel.](https://redd.it/ctklk5)\n5 | 333 | 2019-08-23 12:34:54 | [waterloowanderer](http://reddit.com/user/waterloowanderer) | [Hi new friend](https://redd.it/cu8c0c)\n6 | 298 | 2019-08-31 07:22:17 | [stengunner93](http://reddit.com/user/stengunner93) | [Spotted: Kubricks fabled Zeiss 50mm 0.7](https://redd.it/cxnum5)\n7 | 276 | 2019-08-12 01:01:01 | [TheSWZ](http://reddit.com/user/TheSWZ) | [Just an appreciation post for this community. I took the template from u/mydogisverybig and decided to decorate my new bedroom with all of my film rolls Ive shot so far!](https://redd.it/coyh1u)\n8 | 268 | 2019-08-05 20:12:43 | [daimonwright](http://reddit.com/user/daimonwright) | [I love cleaning them up and bringing them back to life](https://redd.it/cm9n2n)\n9 | 268 | 2019-08-14 02:00:21 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [went on my first hike with my brand new mamiya!!](https://redd.it/cpvyyh)\n10 | 264 | 2019-08-14 21:52:07 | [deehzee](http://reddit.com/user/deehzee) | [My everyday companion: Olympus XA](https://redd.it/cq98ry)\n\n\nSeptember\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 490 | 2019-09-16 11:20:34 | [skeeter_mcgriddle](http://reddit.com/user/skeeter_mcgriddle) | [5th grade teacher here. I've been shooting film for a few years and wanted to share my hobby with my students. I've been collecting these cameras over the past few months and finally got the green light from admin to start a class at my school. So excited to see what the kids can do!](https://redd.it/d4ue7j)\n2 | 361 | 2019-09-08 06:14:57 | [thebobsta](http://reddit.com/user/thebobsta) | [Latest pickup. Definitely getting campus security called on me.](https://redd.it/d11rtu)\n3 | 347 | 2019-09-17 11:35:06 | [Kerrentonsnow](http://reddit.com/user/Kerrentonsnow) | [Exploded RB67](https://redd.it/d5asp7)\n4 | 341 | 2019-09-06 07:23:11 | [pixelkarma](http://reddit.com/user/pixelkarma) | [I think we can all relate.](https://redd.it/d07tz8)\n5 | 339 | 2019-09-08 21:14:14 | [deehzee](http://reddit.com/user/deehzee) | [Cant believe I paid 7 for this beauty.](https://redd.it/d1a65l)\n6 | 320 | 2019-09-22 01:21:00 | [marekvesely](http://reddit.com/user/marekvesely) | [This is a 35mm Kodak print-film from 1994! Finally got to scan some frames. Oh the colors...](https://redd.it/d7ckx0)\n7 | 307 | 2019-09-09 13:24:55 | [Steakasaurus-Rex](http://reddit.com/user/Steakasaurus-Rex) | [My girlfriend and I are ready for our road trip!](https://redd.it/d1m0e9)\n8 | 293 | 2019-09-10 22:29:01 | [tie_ya_shoes](http://reddit.com/user/tie_ya_shoes) | [new addition to the collection](https://redd.it/d27jor)\n9 | 287 | 2019-09-24 21:13:28 | [Gorill_a](http://reddit.com/user/Gorill_a) | [The \"Texas Leica\" or the \"Why Do You Have to Take That Massive Camera on Every Walk\" Camera / Fuji GW690II](https://redd.it/d8maoj)\n10 | 281 | 2019-09-12 20:34:38 | [firmlyundecided](http://reddit.com/user/firmlyundecided) | [Reunited with my grandfathers OM-4](https://redd.it/d36kcd)\n\n\nOctober\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 468 | 2019-10-06 06:55:57 | [Odlavso](http://reddit.com/user/Odlavso) | [Holy sh*****************************t 9.99 at the Goodwill](https://redd.it/ddtx9g)\n2 | 382 | 2019-10-14 03:47:16 | [spaghetti_industries](http://reddit.com/user/spaghetti_industries) | [Ready for a week in Iceland](https://redd.it/dhennt)\n3 | 363 | 2019-10-23 03:20:49 | [HrgleBleh](http://reddit.com/user/HrgleBleh) | [7-11's in Thailand sells KitKat Disposable Cameras](https://redd.it/dllzq4)\n4 | 295 | 2019-10-04 12:14:18 | [danielkauppi](http://reddit.com/user/danielkauppi) | [Only in Japan films](https://redd.it/dd1pbu)\n5 | 291 | 2019-10-08 15:45:42 | [verdigrijs](http://reddit.com/user/verdigrijs) | [Gear for 5 days...](https://redd.it/dewbig)\n6 | 281 | 2019-10-18 10:30:32 | [turboboob](http://reddit.com/user/turboboob) | [I can't even describe how much I'm loving half frame.](https://redd.it/djg65a)\n7 | 278 | 2019-10-12 01:38:26 | [jasonseannn](http://reddit.com/user/jasonseannn) | [Relatively new to 120mm, is Ilford HP5 supposed to be this grainy? Shot with RB67 on 400 film](https://redd.it/dghq9j)\n8 | 277 | 2019-10-29 23:33:13 | [JaackF](http://reddit.com/user/JaackF) | [Lomography is not discontinuing Lomo 800](https://redd.it/dorhc5)\n9 | 275 | 2019-10-14 21:58:26 | [daimonwright](http://reddit.com/user/daimonwright) | [How good is it when a camera has a story (background in comments)](https://redd.it/dhq7hk)\n10 | 268 | 2019-10-24 00:18:04 | [BigHeadedChimp](http://reddit.com/user/BigHeadedChimp) | [Got this baby. Came with a 20 year old roll of TMax. Already in love.](https://redd.it/dm0rbq)\n\n\nNovember\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 847 | 2019-11-08 06:58:31 | [life_is_a_conspiracy](http://reddit.com/user/life_is_a_conspiracy) | [Galaxias Kyklos. At this time of year, at this time of day, localized entirely within 35mm](https://redd.it/dt5yj6)\n2 | 563 | 2019-11-06 07:01:07 | [tada66](http://reddit.com/user/tada66) | [My deal of the century - 193 rolls of Kodak Gold 200 for 8$](https://redd.it/ds75cp)\n3 | 527 | 2019-11-14 18:17:37 | [Jon_J_](http://reddit.com/user/Jon_J_) | [My Epson scanning procedure](https://redd.it/dw7ld7)\n4 | 461 | 2019-11-11 00:04:34 | [DMKracken](http://reddit.com/user/DMKracken) | [Today I was gifted 46 rolls of Portra 160 from my mother in law. Best Sunday ever !](https://redd.it/dud958)\n5 | 384 | 2019-11-07 04:53:55 | [CanadianConspiracy](http://reddit.com/user/CanadianConspiracy) | [Visited my grandma recently and she gave me this drawer full of my late grandpas slide film shots. Lots of shots from 60s-80s](https://redd.it/dsmdz6)\n6 | 383 | 2019-11-29 23:15:35 | [kpraslowicz](http://reddit.com/user/kpraslowicz) | [Out shooting on Thanksgiving. Passerby asks if us surveyors ever get a day off](https://redd.it/e3fyk4)\n7 | 364 | 2019-11-13 02:18:11 | [Churrasquito](http://reddit.com/user/Churrasquito) | [I got this beauty for $40 at a flea market. 1.4 lens and even the meter works flawlessly.](https://redd.it/dvdw7i)\n8 | 337 | 2019-11-14 01:04:58 | [poopsonlawn](http://reddit.com/user/poopsonlawn) | [Don't see many of these here - Fuji GS645S](https://redd.it/dvup2n)\n9 | 333 | 2019-11-29 14:49:24 | [willsuiter](http://reddit.com/user/willsuiter) | [Shooting 4x5 and 6x7 today in the fog](https://redd.it/e3b4tm)\n10 | 325 | 2019-11-15 22:33:57 | [rip_right_ball](http://reddit.com/user/rip_right_ball) | [Check out what I found at my parent's place! It's not even opened!](https://redd.it/dwrkyi)\n\n\nDecember\n\nNo | Score | Date | Author | Title\n---|---|---|---|---\n1 | 364 | 2019-12-02 06:50:06 | [Peter_Mansbrick](http://reddit.com/user/Peter_Mansbrick) | [My uncle is downsizing and gave me is Hasselblad kit](https://redd.it/e4pacd)\n2 | 363 | 2019-12-08 12:11:52 | [willsuiter](http://reddit.com/user/willsuiter) | [Another setup &amp; result - Shooting 6x7 in the fog on Portra 400](https://redd.it/e7p1bt)\n3 | 360 | 2019-12-02 15:23:08 | [andres_os](http://reddit.com/user/andres_os) | [My neighborhood's camera shop has this installed. For 500 (~$4.5 USD) you can get a random 300-1600 (~$2.7-$14.5 USD) 135 color negative or B&amp;W film roll!](https://redd.it/e4vjjf)\n4 | 339 | 2019-12-04 16:36:44 | [leckin](http://reddit.com/user/leckin) | [I thought you guys would appreciate this.](https://redd.it/e5wbll)\n5 | 280 | 2019-12-09 00:25:31 | [JaackF](http://reddit.com/user/JaackF) | [First outing with the Bronica ETRS](https://redd.it/e7vofs)\n6 | 279 | 2019-12-04 08:54:39 | [alekss_pro](http://reddit.com/user/alekss_pro) | [I've just respooled an entire 122 meters of Kodak Vision3 500T into cartridges ... Now it's time for shooting!](https://redd.it/e5r1nz)\n7 | 254 | 2019-12-05 23:21:01 | [WasteWonder](http://reddit.com/user/WasteWonder) | [I wanted one of these ever since I got my F3.](https://redd.it/e6illf)\n8 | 251 | 2019-12-03 01:23:26 | [steadystate2](http://reddit.com/user/steadystate2) | [8 x 10 camera I built ... .5 mm pinhole, looking forward to posting images soon!](https://redd.it/e527s4)\n9 | 234 | 2019-12-01 03:35:58 | [majoras-other-mask](http://reddit.com/user/majoras-other-mask) | [Good companion for a snowy walk.](https://redd.it/e421t5)\n10 | 225 | 2019-12-07 13:42:47 | [rowdyanalogue](http://reddit.com/user/rowdyanalogue) | [Finally got a Hasselblad.](https://redd.it/e7aj5w)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ecb0en/meta_the_ranalogcommunity_2019_best_of_the_year/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "[meta] the /r/analogcommunity 2019 \"best of the year\" awards! - nominations /!/ welcome to the *third* annual \"best of the year\" awards! the reddit inc admins have kindly agreed \nto give away reddit gold to all subreddits with more than 1000 subscribers.\n\n**categories and prizes**\n\nthe prize for each category is reddit community awards.\n\n* best question\n* best answer\n* best news post\n* best technique post\n* best general or misc post\n\n\n**how to nominate**\n\ncomment on this post linking to the post you wish to nominate. this thread will be in 'contest mode' so you can't see \nwho's winning until we make the announcement. make sure to link to the post you are nominating and not just the photo. \nplease check to make sure the post hasn't already been nominated, any duplicates will be removed as they mess up \nvoting.\n\n**rules**\n\n* you can only nominate a post made in 2019.\n* you can **not** nominate your own posts.\n* nominations can only happen in this post.\n* the nominations will **close on the end of december** and the winners will be announced in january once reddit inc \nhas given us the awards to distribute.\n* each nominated post can only win one category. if a post wins in multiple categories, the mod team will decide the most \nappropriate category for the post to win.\n* comments on this thread that aren't nominations, or are not replies to the category comments, will be removed.\n* the winners will **be decided by the number of votes in this *nomination* post**, not on the \noriginal post, with the prize going to the original poster. should there be any dispute or tie, the moderation team's \ndecision is final.\n\nthe following list of top posts in this sub may help you if you are looking for a specific high scoring post, but you do not need to limit yourself to only a post listed here. any post made during the year that fits into the categories is eligible.\n\n\n\njanuary\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 237 | 2019-01-18 22:13:02 | [spash11](http://reddit.com/user/spash11) | [anyone else using their bathroom as a darkroom?](https://redd.it/ahatin)\n2 | 224 | 2019-01-26 03:43:40 | [hogarthferguson](http://reddit.com/user/hogarthferguson) | [ektachrome is very likely coming in 120, the best of all formats](https://redd.it/ajsrv8)\n3 | 223 | 2019-01-22 01:50:04 | [samyb_](http://reddit.com/user/samyb_) | [got myself a beautiful mamiya rb67 pro sd](https://redd.it/aiclo7)\n4 | 205 | 2019-01-28 04:59:05 | [guitard00d123](http://reddit.com/user/guitard00d123) | [first time shooting slide film - i'm in love!](https://redd.it/akfqiy)\n5 | 193 | 2019-01-25 06:19:22 | [jlin1847](http://reddit.com/user/jlin1847) | [my first medium format film camera :)](https://redd.it/aji0ay)\n6 | 183 | 2019-01-20 00:28:33 | [spaghetti_industries](http://reddit.com/user/spaghetti_industries) | [first two prints in my shed converted darkroom](https://redd.it/ahni33)\n7 | 160 | 2019-01-29 00:06:00 | [crazyanchovy](http://reddit.com/user/crazyanchovy) | [pentax 645nii // 45mm 2.8 a // provia expired 13yrs](https://redd.it/akoug5)\n8 | 154 | 2019-01-17 03:02:26 | [misstakukenihelvette](http://reddit.com/user/misstakukenihelvette) | [just bought this for 40$. only been used twice. the man even gave me a roll of film.](https://redd.it/agog9d)\n9 | 151 | 2019-01-27 02:09:02 | [jlin1847](http://reddit.com/user/jlin1847) | [my second mediun format camera](https://redd.it/ak3ar7)\n10 | 148 | 2019-01-07 07:04:18 | [infocalypse](http://reddit.com/user/infocalypse) | [rollei 35, hand-written receipt from august 1971](https://redd.it/adb2bn)\n\n\nfebruary\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 290 | 2019-02-18 11:19:29 | [pushkatron](http://reddit.com/user/pushkatron) | [a friend just called me, showed this and asked how to rewind a fully shot roll](https://redd.it/arw98p)\n2 | 248 | 2019-02-25 14:04:55 | [vizualb](http://reddit.com/user/vizualb) | [a weapon to surpass metal gear...](https://redd.it/aull2z)\n3 | 218 | 2019-02-01 01:16:06 | [ruskivato](http://reddit.com/user/ruskivato) | [browsing craigslist when i found it. the holy grail, forged by a wizard, can capture ghosts.](https://redd.it/alrpxh)\n4 | 216 | 2019-02-02 11:41:55 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [a two hour drive and $50 later](https://redd.it/amad9l)\n5 | 198 | 2019-02-02 23:10:16 | [kid-blue](http://reddit.com/user/kid-blue) | [thanks for all the good advice you guys gave me yesterday, i now have my rz67!](https://redd.it/amev6z)\n6 | 195 | 2019-02-08 05:44:31 | [iamthealchemist](http://reddit.com/user/iamthealchemist) | [my homemade 4x5 is getting close to being finished!](https://redd.it/ao9175)\n7 | 184 | 2019-02-17 19:15:24 | [whowhatwhen2](http://reddit.com/user/whowhatwhen2) | [getting back into film photography after a 10 year hiatus with my first ever rangefinder.](https://redd.it/arnv4s)\n8 | 181 | 2019-02-04 02:46:14 | [uber_name](http://reddit.com/user/uber_name) | [bought my first 35mm 3 months ago. this is escalating quickly. (fujica gw690)](https://redd.it/amsi8o)\n9 | 178 | 2019-02-11 22:32:52 | [gibslayer](http://reddit.com/user/gibslayer) | [found my grandfathers slides, all taken by him when working on the severn valley railway.](https://redd.it/apgtf8)\n10 | 174 | 2019-02-20 00:04:51 | [baby-got-books-1989](http://reddit.com/user/baby-got-books-1989) | [grabbed an electro 35 with case and lens cap for $9 from goodwill. everything seems to work and even has a fresh battery.](https://redd.it/ashbch)\n\n\nmarch\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 263 | 2019-03-02 19:28:58 | [odlavso](http://reddit.com/user/odlavso) | [found in a antique shop for 140$](https://redd.it/awlbd0)\n2 | 249 | 2019-03-23 01:45:46 | [baby-got-books-1989](http://reddit.com/user/baby-got-books-1989) | [i really really really dont need another camera. but a working ae-1 program for $8 at goodwill, how could i say no?](https://redd.it/b4dfx3)\n3 | 245 | 2019-03-30 23:12:29 | [jasentb](http://reddit.com/user/jasentb) | [popular photography magazine: 1985](https://redd.it/b7h8pf)\n4 | 242 | 2019-03-02 02:17:33 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [picked this up for $25 today!](https://redd.it/awcpns)\n5 | 235 | 2019-03-21 14:57:16 | [bdafilm](http://reddit.com/user/bdafilm) | [my uncle gave me his nikon fm2](https://redd.it/b3rhz3)\n6 | 231 | 2019-03-24 15:45:10 | [enzio00](http://reddit.com/user/enzio00) | [long before color-sensitive films were invented, russian photographer prokudin-gorsky used to take 3 individual black-and-white photos, each with a filter (red, green, blue) to create high-quality pictures in full color. this self portrait of him is 107 years old! (xpost /r/oldschoolcool)](https://redd.it/b4xqhi)\n7 | 227 | 2019-03-26 14:45:54 | [bdafilm](http://reddit.com/user/bdafilm) | [new camera day :: olympus xa](https://redd.it/b5qkhd)\n8 | 211 | 2019-03-13 04:42:30 | [condormcdaniel](http://reddit.com/user/condormcdaniel) | [picked this big boi up for cheap. recently clad and looking brand new!](https://redd.it/b0huug)\n9 | 198 | 2019-03-19 23:10:18 | [starboardbulwark](http://reddit.com/user/starboardbulwark) | [tlr youtube review starter pack](https://redd.it/b34dgj)\n10 | 194 | 2019-03-09 15:04:17 | [shotbyjaked](http://reddit.com/user/shotbyjaked) | [picked this lot up for 199 and even got a nat geo carry bag](https://redd.it/az4ccd)\n\n\napril\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 349 | 2019-04-01 02:05:41 | [hogarthferguson](http://reddit.com/user/hogarthferguson) | [i'm leaving for tibet tomorrow. this is the gear i'm taking with me.](https://redd.it/b7vbz7)\n2 | 347 | 2019-04-16 03:01:57 | [hardarseman](http://reddit.com/user/hardarseman) | [an early 80s newspaper clipping.](https://redd.it/bdoe21)\n3 | 285 | 2019-04-24 18:00:02 | [fromagedebite](http://reddit.com/user/fromagedebite) | [511 vs 6](https://redd.it/bgx31y)\n4 | 242 | 2019-04-23 00:36:39 | [asyoubreak](http://reddit.com/user/asyoubreak) | [todays thrift store come up](https://redd.it/bg93vi)\n5 | 233 | 2019-04-27 23:50:17 | [aeaguiar](http://reddit.com/user/aeaguiar) | [my current collection](https://redd.it/bi4n6o)\n6 | 231 | 2019-04-11 03:24:25 | [jeffk42](http://reddit.com/user/jeffk42) | [as is, untested ebay purchase. had this note in the box](https://redd.it/bburk3)\n7 | 217 | 2019-04-07 01:23:18 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [first day with my new hassy](https://redd.it/baas32)\n8 | 210 | 2019-04-27 18:07:46 | [l33tshietlord](http://reddit.com/user/l33tshietlord) | [fits perfectly into chest pocket](https://redd.it/bi16iu)\n9 | 204 | 2019-04-05 20:45:43 | [geekwadpimp](http://reddit.com/user/geekwadpimp) | [i'm on a roll this week... just found this for $3. to prove i'm not just a karma whore with cool cameras, i took the picture while still in the thrift store.](https://redd.it/b9vqbj)\n10 | 199 | 2019-04-14 17:22:02 | [studiesinsilver](http://reddit.com/user/studiesinsilver) | [how do we feel about large format beauties here? introducing my new 8x10 beast - the toyo 810mii with rodenstock 300/5.6.](https://redd.it/bd4fit)\n\n\nmay\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 550 | 2019-05-08 01:42:27 | [whiteheadj](http://reddit.com/user/whiteheadj) | [my granddad was an amateur photographer before he died in 1990. this was on slide film.](https://redd.it/blsy1x)\n2 | 336 | 2019-05-10 01:42:33 | [cunninglinguist666](http://reddit.com/user/cunninglinguist666) | [i developed my first roll of black and white film, and im addicted now ! i had a panic attack when i saw the blank film at the beginning, and when i saw my first image i was ecstatic.](https://redd.it/bmm1vo)\n3 | 325 | 2019-05-15 23:05:18 | [veepeedeepee](http://reddit.com/user/veepeedeepee) | [installed a maxwell hi-lux screen in my rolleiflex and the camera feels brand new.](https://redd.it/boycii)\n4 | 270 | 2019-05-31 05:36:28 | [mizonkey](http://reddit.com/user/mizonkey) | [5.99 gem find](https://redd.it/buy7jx)\n5 | 264 | 2019-05-19 09:29:09 | [thrftstorebndt](http://reddit.com/user/thrftstorebndt) | [fueling my cheap 35mm addiction, got the whole lot for $5](https://redd.it/bqavah)\n6 | 249 | 2019-05-24 07:14:26 | [mabunday](http://reddit.com/user/mabunday) | [edit your film!](https://redd.it/bs91uj)\n7 | 244 | 2019-05-07 12:06:31 | [isaacc7](http://reddit.com/user/isaacc7) | [exposing the negative in the camera is just the first step. post processing is necessary to get the picture the way you want it. this was all done long before photoshop. full article linked in the comments.](https://redd.it/bllkms)\n8 | 213 | 2019-05-02 19:41:36 | [chrizzowski](http://reddit.com/user/chrizzowski) | [someone forgot their pentacon! found on sunshine coast trail, bc](https://redd.it/bjyhwu)\n9 | 207 | 2019-05-13 04:29:26 | [fonziusmaximus](http://reddit.com/user/fonziusmaximus) | [snagged all this for $40 on a garage sale page - still testing but appears mint!](https://redd.it/bnt0um)\n10 | 201 | 2019-05-28 11:31:15 | [hogarthferguson](http://reddit.com/user/hogarthferguson) | [i picked up a nikon s3 millenium edition this week in a trade. i think it will complement my hasselblad on my travels.](https://redd.it/btul1c)\n\n\njune\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 484 | 2019-06-25 00:30:30 | [w33dwiz420](http://reddit.com/user/w33dwiz420) | [i just thrifted original nasa slide copies made by zeiss for educational purposes, to my surprise it has the moon landing.](https://redd.it/c4pv0i)\n2 | 478 | 2019-06-11 05:27:06 | [parts_i-ix](http://reddit.com/user/parts_i-ix) | [got gifted a box from my friend's dad...](https://redd.it/bz2uoe)\n3 | 373 | 2019-06-03 09:19:20 | [gothpineapple](http://reddit.com/user/gothpineapple) | [passed down to me from my father](https://redd.it/bw4a5i)\n4 | 279 | 2019-06-18 18:34:34 | [samsonsmartypants](http://reddit.com/user/samsonsmartypants) | [found in a tesco bag in a charity shop in london](https://redd.it/c205cr)\n5 | 268 | 2019-06-04 03:27:03 | [gibslayer](http://reddit.com/user/gibslayer) | [my mums been hiding this since the 80s... can't wait to shoot it!](https://redd.it/bwe2sg)\n6 | 260 | 2019-06-02 17:13:41 | [magiera](http://reddit.com/user/magiera) | [scored this baby for $13 today. any advice?](https://redd.it/bvv8cn)\n7 | 244 | 2019-06-30 07:44:14 | [danielkauppi](http://reddit.com/user/danielkauppi) | [well, this should last me awhile.](https://redd.it/c75ojz)\n8 | 238 | 2019-06-20 23:53:21 | [jasentb](http://reddit.com/user/jasentb) | [picked this up at an estate sale for $50, im in love!](https://redd.it/c2wzjd)\n9 | 237 | 2019-06-21 10:11:30 | [unsetname](http://reddit.com/user/unsetname) | [about a week and a half ago i asked about reciprocity failure and pushing lomo 800 to 3200iso, just got the scans back and this is the result](https://redd.it/c344mj)\n10 | 237 | 2019-06-10 13:34:37 | [jtam93](http://reddit.com/user/jtam93) | [fujifilm: neopan 100 acros ii announced, begins shipping autumn 2019 / emulsive](https://redd.it/bytiif)\n\n\njuly\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 464 | 2019-07-12 05:57:11 | [private_weld](http://reddit.com/user/private_weld) | [my local camera store is starting to carry some great stuff!](https://redd.it/cc17wu)\n2 | 400 | 2019-07-27 06:18:28 | [tenburner](http://reddit.com/user/tenburner) | [the mysterious red room](https://redd.it/ci8ns7)\n3 | 398 | 2019-07-17 10:53:44 | [fromthedice](http://reddit.com/user/fromthedice) | [famous, infamous, and not so famous photographs and their cameras](https://redd.it/ce6fl1)\n4 | 332 | 2019-07-06 08:27:04 | [lardicus99](http://reddit.com/user/lardicus99) | [aerochrome vs. ektachrome shot of same scene](https://redd.it/c9mqeb)\n5 | 332 | 2019-07-28 00:20:29 | [knarfolled](http://reddit.com/user/knarfolled) | [this image is incredible](https://redd.it/ciipxv)\n6 | 312 | 2019-07-04 23:40:35 | [thesonofmuluh](http://reddit.com/user/thesonofmuluh) | [i think i have a problem.](https://redd.it/c93cfi)\n7 | 310 | 2019-07-01 08:41:43 | [gardenstateking](http://reddit.com/user/gardenstateking) | [got my camera signed by spike lee today. he loved it.](https://redd.it/c7laxz)\n8 | 281 | 2019-07-29 03:08:36 | [rftwknd](http://reddit.com/user/rftwknd) | [sunday service - weekly cleaning and dusting of my film shooters](https://redd.it/ciz5fb)\n9 | 271 | 2019-07-26 07:05:25 | [206v](http://reddit.com/user/206v) | [had to wake up at 4am to get to the estate sale super early but i think it was worth it!](https://redd.it/chu9m0)\n10 | 249 | 2019-07-22 22:22:34 | [daniel_melzer](http://reddit.com/user/daniel_melzer) | [custom leica m2](https://redd.it/cgd587)\n\n\naugust\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 461 | 2019-08-03 03:22:53 | [cmazmanian](http://reddit.com/user/cmazmanian) | [got my photos printed and put up at the local coffee shop! feels good and they look great. each one was shot on film and self developed](https://redd.it/cl7vc1)\n2 | 438 | 2019-08-07 23:02:25 | [darkassassinofdoom](http://reddit.com/user/darkassassinofdoom) | [what camera did fan ho use for approaching light ?](https://redd.it/cn66ic)\n3 | 388 | 2019-08-09 07:47:26 | [majoras-other-mask](http://reddit.com/user/majoras-other-mask) | [loading the first roll of a home made camera.](https://redd.it/cntdua)\n4 | 377 | 2019-08-22 03:08:02 | [blurmageddon](http://reddit.com/user/blurmageddon) | [my buddy works for a movie studio. he sent me a photo of someone holding a 70mm film reel.](https://redd.it/ctklk5)\n5 | 333 | 2019-08-23 12:34:54 | [waterloowanderer](http://reddit.com/user/waterloowanderer) | [hi new friend](https://redd.it/cu8c0c)\n6 | 298 | 2019-08-31 07:22:17 | [stengunner93](http://reddit.com/user/stengunner93) | [-----> spotted !!! : kubricks fabled zeiss 50mm 0.7](https://redd.it/cxnum5)\n7 | 276 | 2019-08-12 01:01:01 | [theswz](http://reddit.com/user/theswz) | [just an appreciation post for this community. i took the template from u/mydogisverybig and decided to decorate my new bedroom with all of my film rolls ive shot so far!](https://redd.it/coyh1u)\n8 | 268 | 2019-08-05 20:12:43 | [daimonwright](http://reddit.com/user/daimonwright) | [i love cleaning them up and bringing them back to life](https://redd.it/cm9n2n)\n9 | 268 | 2019-08-14 02:00:21 | [kodeinekenny](http://reddit.com/user/kodeinekenny) | [went on my first hike with my brand new mamiya!!](https://redd.it/cpvyyh)\n10 | 264 | 2019-08-14 21:52:07 | [deehzee](http://reddit.com/user/deehzee) | [my everyday companion: olympus xa](https://redd.it/cq98ry)\n\n\nseptember\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 490 | 2019-09-16 11:20:34 | [skeeter_mcgriddle](http://reddit.com/user/skeeter_mcgriddle) | [5th grade teacher here. i've been shooting film for a few years and wanted to share my hobby with my students. i've been collecting these cameras over the past few months and finally got the green light from admin to start a class at my school. so excited to see what the kids can do!](https://redd.it/d4ue7j)\n2 | 361 | 2019-09-08 06:14:57 | [thebobsta](http://reddit.com/user/thebobsta) | [latest pickup. definitely getting campus security called on me.](https://redd.it/d11rtu)\n3 | 347 | 2019-09-17 11:35:06 | [kerrentonsnow](http://reddit.com/user/kerrentonsnow) | [exploded rb67](https://redd.it/d5asp7)\n4 | 341 | 2019-09-06 07:23:11 | [pixelkarma](http://reddit.com/user/pixelkarma) | [i think we can all relate.](https://redd.it/d07tz8)\n5 | 339 | 2019-09-08 21:14:14 | [deehzee](http://reddit.com/user/deehzee) | [cant believe i paid 7 for this beauty.](https://redd.it/d1a65l)\n6 | 320 | 2019-09-22 01:21:00 | [marekvesely](http://reddit.com/user/marekvesely) | [this is a 35mm kodak print-film from 1994! finally got to scan some frames. oh the colors...](https://redd.it/d7ckx0)\n7 | 307 | 2019-09-09 13:24:55 | [steakasaurus-rex](http://reddit.com/user/steakasaurus-rex) | [my girlfriend and i are ready for our road trip!](https://redd.it/d1m0e9)\n8 | 293 | 2019-09-10 22:29:01 | [tie_ya_shoes](http://reddit.com/user/tie_ya_shoes) | [new addition to the collection](https://redd.it/d27jor)\n9 | 287 | 2019-09-24 21:13:28 | [gorill_a](http://reddit.com/user/gorill_a) | [the \"texas leica\" or the \"why do you have to take that massive camera on every walk\" camera / fuji gw690ii](https://redd.it/d8maoj)\n10 | 281 | 2019-09-12 20:34:38 | [firmlyundecided](http://reddit.com/user/firmlyundecided) | [reunited with my grandfathers om-4](https://redd.it/d36kcd)\n\n\noctober\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 468 | 2019-10-06 06:55:57 | [odlavso](http://reddit.com/user/odlavso) | [holy sh*****************************t 9.99 at the goodwill](https://redd.it/ddtx9g)\n2 | 382 | 2019-10-14 03:47:16 | [spaghetti_industries](http://reddit.com/user/spaghetti_industries) | [ready for a week in iceland](https://redd.it/dhennt)\n3 | 363 | 2019-10-23 03:20:49 | [hrglebleh](http://reddit.com/user/hrglebleh) | [7-11's in thailand sells kitkat disposable cameras](https://redd.it/dllzq4)\n4 | 295 | 2019-10-04 12:14:18 | [danielkauppi](http://reddit.com/user/danielkauppi) | [only in japan films](https://redd.it/dd1pbu)\n5 | 291 | 2019-10-08 15:45:42 | [verdigrijs](http://reddit.com/user/verdigrijs) | [gear for 5 days...](https://redd.it/dewbig)\n6 | 281 | 2019-10-18 10:30:32 | [turboboob](http://reddit.com/user/turboboob) | [i can't even describe how much i'm loving half frame.](https://redd.it/djg65a)\n7 | 278 | 2019-10-12 01:38:26 | [jasonseannn](http://reddit.com/user/jasonseannn) | [relatively new to 120mm, is ilford hp5 supposed to be this grainy? shot with rb67 on 400 film](https://redd.it/dghq9j)\n8 | 277 | 2019-10-29 23:33:13 | [jaackf](http://reddit.com/user/jaackf) | [lomography is not discontinuing lomo 800](https://redd.it/dorhc5)\n9 | 275 | 2019-10-14 21:58:26 | [daimonwright](http://reddit.com/user/daimonwright) | [how good is it when a camera has a story (background in comments)](https://redd.it/dhq7hk)\n10 | 268 | 2019-10-24 00:18:04 | [bigheadedchimp](http://reddit.com/user/bigheadedchimp) | [got this baby. came with a 20 year old roll of tmax. already in love.](https://redd.it/dm0rbq)\n\n\nnovember\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 847 | 2019-11-08 06:58:31 | [life_is_a_conspiracy](http://reddit.com/user/life_is_a_conspiracy) | [galaxias kyklos. at this time of year, at this time of day, localized entirely within 35mm](https://redd.it/dt5yj6)\n2 | 563 | 2019-11-06 07:01:07 | [tada66](http://reddit.com/user/tada66) | [my deal of the century - 193 rolls of kodak gold 200 for 8$](https://redd.it/ds75cp)\n3 | 527 | 2019-11-14 18:17:37 | [jon_j_](http://reddit.com/user/jon_j_) | [my epson scanning procedure](https://redd.it/dw7ld7)\n4 | 461 | 2019-11-11 00:04:34 | [dmkracken](http://reddit.com/user/dmkracken) | [today i was gifted 46 rolls of portra 160 from my mother in law. best sunday ever !](https://redd.it/dud958)\n5 | 384 | 2019-11-07 04:53:55 | [canadianconspiracy](http://reddit.com/user/canadianconspiracy) | [visited my grandma recently and she gave me this drawer full of my late grandpas slide film shots. lots of shots from 60s-80s](https://redd.it/dsmdz6)\n6 | 383 | 2019-11-29 23:15:35 | [kpraslowicz](http://reddit.com/user/kpraslowicz) | [out shooting on thanksgiving. passerby asks if us surveyors ever get a day off](https://redd.it/e3fyk4)\n7 | 364 | 2019-11-13 02:18:11 | [churrasquito](http://reddit.com/user/churrasquito) | [i got this beauty for $40 at a flea market. 1.4 lens and even the meter works flawlessly.](https://redd.it/dvdw7i)\n8 | 337 | 2019-11-14 01:04:58 | [poopsonlawn](http://reddit.com/user/poopsonlawn) | [don't see many of these here - fuji gs645s](https://redd.it/dvup2n)\n9 | 333 | 2019-11-29 14:49:24 | [willsuiter](http://reddit.com/user/willsuiter) | [shooting 4x5 and 6x7 today in the fog](https://redd.it/e3b4tm)\n10 | 325 | 2019-11-15 22:33:57 | [rip_right_ball](http://reddit.com/user/rip_right_ball) | [check out what i found at my parent's place! it's not even opened!](https://redd.it/dwrkyi)\n\n\ndecember\n\nno | score | date | author | title\n---|---|---|---|---\n1 | 364 | 2019-12-02 06:50:06 | [peter_mansbrick](http://reddit.com/user/peter_mansbrick) | [my uncle is downsizing and gave me is hasselblad kit](https://redd.it/e4pacd)\n2 | 363 | 2019-12-08 12:11:52 | [willsuiter](http://reddit.com/user/willsuiter) | [another setup &amp; result - shooting 6x7 in the fog on portra 400](https://redd.it/e7p1bt)\n3 | 360 | 2019-12-02 15:23:08 | [andres_os](http://reddit.com/user/andres_os) | [my neighborhood's camera shop has this installed. for 500 (~$4.5 usd) you can get a random 300-1600 (~$2.7-$14.5 usd) 135 color negative or b&amp;w film roll!](https://redd.it/e4vjjf)\n4 | 339 | 2019-12-04 16:36:44 | [leckin](http://reddit.com/user/leckin) | [i thought you guys would appreciate this.](https://redd.it/e5wbll)\n5 | 280 | 2019-12-09 00:25:31 | [jaackf](http://reddit.com/user/jaackf) | [first outing with the bronica etrs](https://redd.it/e7vofs)\n6 | 279 | 2019-12-04 08:54:39 | [alekss_pro](http://reddit.com/user/alekss_pro) | [i've just respooled an entire 122 meters of kodak vision3 500t into cartridges ... now it's time for shooting!](https://redd.it/e5r1nz)\n7 | 254 | 2019-12-05 23:21:01 | [wastewonder](http://reddit.com/user/wastewonder) | [i wanted one of these ever since i got my f3.](https://redd.it/e6illf)\n8 | 251 | 2019-12-03 01:23:26 | [steadystate2](http://reddit.com/user/steadystate2) | [8 x 10 camera i built ... .5 mm pinhole, looking forward to posting images soon!](https://redd.it/e527s4)\n9 | 234 | 2019-12-01 03:35:58 | [majoras-other-mask](http://reddit.com/user/majoras-other-mask) | [good companion for a snowy walk.](https://redd.it/e421t5)\n10 | 225 | 2019-12-07 13:42:47 | [rowdyanalogue](http://reddit.com/user/rowdyanalogue) | [finally got a hasselblad.](https://redd.it/e7aj5w)", "sortedWord": "None", "identifyer": 95852, "year": "2019"}, {"Unnamed: 0": 93367, "autor": "oregonduck16", "date": 1576424574000, "content": "Tested a new lens and can’t tell what this black spot is from? More detail in comments", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eb0crf/tested_a_new_lens_and_cant_tell_what_this_black/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tested a new lens and can’t tell what this black -----> spot !!!  is from? more detail in comments", "sortedWord": "None", "identifyer": 95873, "year": "2019"}, {"Unnamed: 0": 93389, "autor": "symmetrygear", "date": 1576320049000, "content": "What are these dark spots on my photograph? FM2, Delta 400 /!/ This was the only frame from this roll affected, and none on any of my other rolls that were developed from this batch. Developed at AG, in Fujifilm Negastar chemicals. \n\nScan: [https://i.imgur.com/Qn27OIV.jpg](https://i.imgur.com/Qn27OIV.jpg)\n\nNeg: [https://i.imgur.com/AXBPY6d.jpg](https://i.imgur.com/AXBPY6d.jpg)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eaiaz7/what_are_these_dark_spots_on_my_photograph_fm2/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these dark -----> spots !!!  on my photograph? fm2, delta 400 /!/ this was the only frame from this roll affected, and none on any of my other rolls that were developed from this batch. developed at ag, in fujifilm negastar chemicals. \n\nscan: [https://i.imgur.com/qn27oiv.jpg](https://i.imgur.com/qn27oiv.jpg)\n\nneg: [https://i.imgur.com/axbpy6d.jpg](https://i.imgur.com/axbpy6d.jpg)", "sortedWord": "None", "identifyer": 95895, "year": "2019"}, {"Unnamed: 0": 93424, "autor": "sapphire_haze", "date": 1576104395000, "content": "What are these spots? (more info in comments)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e9emay/what_are_these_spots_more_info_in_comments/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!! ? (more info in comments)", "sortedWord": "None", "identifyer": 95930, "year": "2019"}, {"Unnamed: 0": 93425, "autor": "sapphire_haze", "date": 1576103619000, "content": "What are these spots? (photo and more info in comments) /!/ [This](https://imgur.com/vlse0o9) was shot on Ilford XP2 400 with Yashica Minister D but not all of photos have these spots. Also Colorplus and Gold came out just fine whitout any weird spots. Does anyone know what could be the problem?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e9efy0/what_are_these_spots_photo_and_more_info_in/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!! ? (photo and more info in comments) /!/ [this](https://imgur.com/vlse0o9) was shot on ilford xp2 400 with yashica minister d but not all of photos have these spots. also colorplus and gold came out just fine whitout any weird spots. does anyone know what could be the problem?", "sortedWord": "None", "identifyer": 95931, "year": "2019"}, {"Unnamed: 0": 93429, "autor": "pigpak", "date": 1576094986000, "content": "Broken Nikon FE /!/ I have this Nikon FE in rough shape. The mirror is missing a chunk, there's a dark spot in the viewfinder because of it and it happens to be on the side that displays the meter readings, not the end of the world but I would like to replace the mirror if possible.\nThe shutter seems to have some problems too. It works fine on the mechanical M90 speed and at every other speed the shutter stays open until it's either switched back to M90 or the winding lever is returned back to the body. \nThe battery check looks good so I don't really know where else to start. I have other cameras so I don't want to spend a ton of money on this one but any help would be greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e9cdef/broken_nikon_fe/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "broken nikon fe /!/ i have this nikon fe in rough shape. the mirror is missing a chunk, there's a dark -----> spot !!!  in the viewfinder because of it and it happens to be on the side that displays the meter readings, not the end of the world but i would like to replace the mirror if possible.\nthe shutter seems to have some problems too. it works fine on the mechanical m90 speed and at every other speed the shutter stays open until it's either switched back to m90 or the winding lever is returned back to the body. \nthe battery check looks good so i don't really know where else to start. i have other cameras so i don't want to spend a ton of money on this one but any help would be greatly appreciated!", "sortedWord": "None", "identifyer": 95935, "year": "2019"}, {"Unnamed: 0": 93468, "autor": "McDonaldsFrenchFry", "date": 1575402977000, "content": "Odd spots on negative after development?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e5mlkc/odd_spots_on_negative_after_development/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "odd -----> spots !!!  on negative after development?", "sortedWord": "None", "identifyer": 95974, "year": "2019"}, {"Unnamed: 0": 93469, "autor": "ApocSurvivor713", "date": 1575401038000, "content": "I love the analog community /!/ Today as I was leaving class I spotted a dude with an OM-2 on a strap- I hit him up about analog photography and we chatted about cameras and scanning techniques.  I bragged about having just ordered a nice Mamiya C3 (with the 105mm f/3.5!) and the dude gave me an old roll of Kodacolor II film!  That's one thing I've noticed about film shooters- nothing against digital shooters but film people are always so willing to talk and share knowledge.  Every time I try talking to someone with a digital camera they seem a lot more closed off.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e5m4gu/i_love_the_analog_community/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i love the analog community /!/ today as i was leaving class i -----> spotted !!!  a dude with an om-2 on a strap- i hit him up about analog photography and we chatted about cameras and scanning techniques.  i bragged about having just ordered a nice mamiya c3 (with the 105mm f/3.5!) and the dude gave me an old roll of kodacolor ii film!  that's one thing i've noticed about film shooters- nothing against digital shooters but film people are always so willing to talk and share knowledge.  every time i try talking to someone with a digital camera they seem a lot more closed off.", "sortedWord": "None", "identifyer": 95975, "year": "2019"}, {"Unnamed: 0": 93640, "autor": "cambajamba", "date": 1558907794000, "content": "Waterproof \"28mm f/90\" 35mm camera - spotted at a stationary store!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/btdttm/waterproof_28mm_f90_35mm_camera_spotted_at_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "waterproof \"28mm f/90\" 35mm camera - -----> spotted !!!  at a stationary store!", "sortedWord": "None", "identifyer": 96150, "year": "2019"}, {"Unnamed: 0": 93705, "autor": "Seanzzxx", "date": 1566471147000, "content": "My Rolleiflex scratches my negatives .... /!/ Hey folks,\n\n&amp;#x200B;\n\nI have a Rolleiflex 3.5T. It works perfectly, except for the fact that it scratches the bejeezus out of my negatives. Does anyone recognize this problem? Is it something I can easily fix, or am I perhaps loading it wrong or something to that extent? Any advice would be much appreciated. The scratches are always in the same spot. \n\n&amp;#x200B;\n\nHere's an example:\n\n https://imgur.com/3qjVMAY", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ctvq02/my_rolleiflex_scratches_my_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my rolleiflex scratches my negatives .... /!/ hey folks,\n\n&amp;#x200b;\n\ni have a rolleiflex 3.5t. it works perfectly, except for the fact that it scratches the bejeezus out of my negatives. does anyone recognize this problem? is it something i can easily fix, or am i perhaps loading it wrong or something to that extent? any advice would be much appreciated. the scratches are always in the same -----> spot !!! . \n\n&amp;#x200b;\n\nhere's an example:\n\n https://imgur.com/3qjvmay", "sortedWord": "None", "identifyer": 96216, "year": "2019"}, {"Unnamed: 0": 93772, "autor": "kanescans", "date": 1569657797000, "content": "Traveling in Italy /!/ Camera shops? Must see photo spots? Meet up &amp; shoot? Drop some comments! 🤗", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dad7g4/traveling_in_italy/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "traveling in italy /!/ camera shops? must see photo -----> spots !!! ? meet up &amp; shoot? drop some comments! 🤗", "sortedWord": "None", "identifyer": 96283, "year": "2019"}, {"Unnamed: 0": 93848, "autor": "usernombre_", "date": 1568398145000, "content": "Shopping in LA /!/ What are some go to spots in LA that has cheap cameras. I know goodwill and the salvation army are hit or miss. Are there certain locations that carry cameras on a consistent bases? What are some tips on scavenging for cameras at second hand stores?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d3t6b4/shopping_in_la/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "shopping in la /!/ what are some go to -----> spots !!!  in la that has cheap cameras. i know goodwill and the salvation army are hit or miss. are there certain locations that carry cameras on a consistent bases? what are some tips on scavenging for cameras at second hand stores?", "sortedWord": "None", "identifyer": 96359, "year": "2019"}, {"Unnamed: 0": 93864, "autor": "trafike00", "date": 1568314905000, "content": "Development problems (\"white spots\") /!/ Hey guys, \n\nFirst time posting and I wanted your opinion on something.  I've been stagnant in film development for about a year and I shot a test roll (FOMA 100) a few days ago to test my chemicals. It went smooth and I think my chemicals are OK. However, the entire strip of film came out with these [\"white\" spots](https://www.flickr.com/photos/161303155@N05/albums/72157710694279622) of something running down the strip.\n\nIn my opinion the culprit is the wetting agent. Can you help me diagnose this situation? And also help with a possible solution to clean the film?\n\nThe development was as followed:\n\n\\- Development: R09 One shot 1 + 50 (500mL of distiled water plus 10mL of R09, 20ºC) for 8 minutes. It has been stored (without use) for a year. \n\n\\- Stop bath: running tap water for 2min.\n\n\\- Fixer: llford Rapid Fixer (new batch), 1 + 4 (800mL of distiled water plus 200mL of fixer), 6 minutes in constant agitation.\n\n\\- Wetting agent: Ilford Ilfotol (new batch), 1 + 200 (995mL of distiled water plus 5mL of wetting agent) 1 minute soaking, plus one passage through the wetting agent.\n\nI dried it with proper clips (the film was flat). \n\nScanned using a Epson V600.\n\n&amp;#x200B;\n\nThanks guys!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/d3cma9/development_problems_white_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "development problems (\"white -----> spots !!! \") /!/ hey guys, \n\nfirst time posting and i wanted your opinion on something.  i've been stagnant in film development for about a year and i shot a test roll (foma 100) a few days ago to test my chemicals. it went smooth and i think my chemicals are ok. however, the entire strip of film came out with these [\"white\" spots](https://www.flickr.com/photos/161303155@n05/albums/72157710694279622) of something running down the strip.\n\nin my opinion the culprit is the wetting agent. can you help me diagnose this situation? and also help with a possible solution to clean the film?\n\nthe development was as followed:\n\n\\- development: r09 one shot 1 + 50 (500ml of distiled water plus 10ml of r09, 20ºc) for 8 minutes. it has been stored (without use) for a year. \n\n\\- stop bath: running tap water for 2min.\n\n\\- fixer: llford rapid fixer (new batch), 1 + 4 (800ml of distiled water plus 200ml of fixer), 6 minutes in constant agitation.\n\n\\- wetting agent: ilford ilfotol (new batch), 1 + 200 (995ml of distiled water plus 5ml of wetting agent) 1 minute soaking, plus one passage through the wetting agent.\n\ni dried it with proper clips (the film was flat). \n\nscanned using a epson v600.\n\n&amp;#x200b;\n\nthanks guys!", "sortedWord": "None", "identifyer": 96375, "year": "2019"}, {"Unnamed: 0": 94025, "autor": "carameIised", "date": 1573487469000, "content": "New camera/lens, tried cleaning but some spots remain. Is this garbage?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/duu7ky/new_cameralens_tried_cleaning_but_some_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "new camera/lens, tried cleaning but some -----> spots !!!  remain. is this garbage?", "sortedWord": "None", "identifyer": 96539, "year": "2019"}, {"Unnamed: 0": 94034, "autor": "DangerDan831", "date": 1573455584000, "content": "Pentax digital spot meter woes /!/ So I finally got the opportunity to score my favourite spot meter, the Pentax digital. However I’ve been experiencing some major problems. \n\n[here’s the link to the readings](https://imgur.com/gallery/3kRayfA)\n\nThe meter will display a number outside of 11 and then quickly snap to 11 regardless of the situation I’m in. As you can see it reads an EV of 11 even with the lens cap on. I’ve tried it with a few different batteries (A544, 4sr44) to no avail. Am I missing something?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/duoq8g/pentax_digital_spot_meter_woes/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pentax digital -----> spot !!!  meter woes /!/ so i finally got the opportunity to score my favourite spot meter, the pentax digital. however i’ve been experiencing some major problems. \n\n[here’s the link to the readings](https://imgur.com/gallery/3krayfa)\n\nthe meter will display a number outside of 11 and then quickly snap to 11 regardless of the situation i’m in. as you can see it reads an ev of 11 even with the lens cap on. i’ve tried it with a few different batteries (a544, 4sr44) to no avail. am i missing something?", "sortedWord": "None", "identifyer": 96548, "year": "2019"}, {"Unnamed: 0": 94044, "autor": "Magnets", "date": 1573413257000, "content": "Scanner photos wrong aspect ratio/skew/warped V500 /!/ I have an epson v500 scanner and if I scan a photo landscape on the bed it comes out at a different aspect ratio than portrait, making faces look fatter or thinner. I've had the scanner for ages and scanned thousands of photos but only just noticed because I scanned the same image twice to try and remove some reflections.\n\nI've tried 800 or 1200 dpi, tried using different spots on the bed, fast/slow preview etc.\n\nThese 2 images are the same thing but just scanned either portrait or landscape on the bed:\n\nhttps://i.imgur.com/Z06B1Ru.jpg\n\nhttps://i.imgur.com/NnGJ5DP.jpg\n\nThe different crop is because the bed doesn't scan to the edges of the glass. I aligned on the top left corner of the red Royal Mail box. The warp/skew is not consistent across the image, you can try manually aligning on different parts.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/duftwr/scanner_photos_wrong_aspect_ratioskewwarped_v500/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "scanner photos wrong aspect ratio/skew/warped v500 /!/ i have an epson v500 scanner and if i scan a photo landscape on the bed it comes out at a different aspect ratio than portrait, making faces look fatter or thinner. i've had the scanner for ages and scanned thousands of photos but only just noticed because i scanned the same image twice to try and remove some reflections.\n\ni've tried 800 or 1200 dpi, tried using different -----> spots !!!  on the bed, fast/slow preview etc.\n\nthese 2 images are the same thing but just scanned either portrait or landscape on the bed:\n\nhttps://i.imgur.com/z06b1ru.jpg\n\nhttps://i.imgur.com/nngj5dp.jpg\n\nthe different crop is because the bed doesn't scan to the edges of the glass. i aligned on the top left corner of the red royal mail box. the warp/skew is not consistent across the image, you can try manually aligning on different parts.", "sortedWord": "None", "identifyer": 96558, "year": "2019"}, {"Unnamed: 0": 94062, "autor": "snuflswasmyslavename", "date": 1573311682000, "content": "Setup for moon shots /!/ I've spotted an old 200mm Hoya f3.5 lens (OM mount) and it got me thinking about matching it up with a 2x converter to attempt shots of the moon. I'm aware that the lens will lose stops due to the converter but even so it seems doable, the moon is usually pretty bright. Am I missing anything?\n\nCould I also try this on a digital crop camera for an extra 1.5x boost?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dtwzml/setup_for_moon_shots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "setup for moon shots /!/ i've -----> spotted !!!  an old 200mm hoya f3.5 lens (om mount) and it got me thinking about matching it up with a 2x converter to attempt shots of the moon. i'm aware that the lens will lose stops due to the converter but even so it seems doable, the moon is usually pretty bright. am i missing anything?\n\ncould i also try this on a digital crop camera for an extra 1.5x boost?", "sortedWord": "None", "identifyer": 96576, "year": "2019"}, {"Unnamed: 0": 94148, "autor": "Ayatollah-X", "date": 1571399731000, "content": "Spotted a likely group member in the wild", "link": "https://www.reddit.com/r/AnalogCommunity/comments/djmf23/spotted_a_likely_group_member_in_the_wild/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  a likely group member in the wild", "sortedWord": "None", "identifyer": 96663, "year": "2019"}, {"Unnamed: 0": 94183, "autor": "DFJorquera", "date": 1575983917000, "content": "How tolerant are you with your lab developing quality? /!/ I've been shooting film for a while now (I usually shoot color negative film) but lately I've been shooting more and more back and white, and I'm not sure I'm happy with my results. I have no idea about different chemistry options, so I guess I'm pretty happy with how the images look like after editing them, but in every single frame there are at least 3 \"big\" dry water spots (that you can clearly see without magnifying in) and even more of a smaller size. I don't know if this is fairly common when developing b&amp;w because I've never done it myself, so should complain to the lab?\n\nAlso, now that I've posed this question, I'm curious: what kind of things make you complain to your lab and to what extent do you tolerate \"errors\" like scratches, etc.?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e8qi0t/how_tolerant_are_you_with_your_lab_developing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how tolerant are you with your lab developing quality? /!/ i've been shooting film for a while now (i usually shoot color negative film) but lately i've been shooting more and more back and white, and i'm not sure i'm happy with my results. i have no idea about different chemistry options, so i guess i'm pretty happy with how the images look like after editing them, but in every single frame there are at least 3 \"big\" dry water -----> spots !!!  (that you can clearly see without magnifying in) and even more of a smaller size. i don't know if this is fairly common when developing b&amp;w because i've never done it myself, so should complain to the lab?\n\nalso, now that i've posed this question, i'm curious: what kind of things make you complain to your lab and to what extent do you tolerate \"errors\" like scratches, etc.?", "sortedWord": "None", "identifyer": 96699, "year": "2019"}, {"Unnamed: 0": 94193, "autor": "Gunsight1", "date": 1575948731000, "content": "Nikon F4s film not loading/advancing /!/ Hello, looking for help if anyone might have some insight into the issue I am having. Done some searching on the internet and have found other people having this issue, but no solutions. I have an F4s that had been sitting in storage for some time now that I was hoping to shoot on, but I am having trouble getting it to load film and I am worried the motor or something with the takeup spool might be shot.\n\nI put the new film canister in and line the film up with the red marker, making sure the film is sitting correct and close the back, press the trigger and the camera makes a buzzing sound then the sound one might expect to hear this era of film advance making three times, then I get a solid red light on the error indicator by the film rewind knob. the camera will not shoot and sits like this for a couple minutes then reset its self. Pressting the trigger again at this point just repeated this. Opening the back just shows that the film is in the same spot it was before. I don't think the takup spool is turning I used to shoot on N90's which load pretty much the same way, but did double check myself with some instructions and by everything that I see this should be working. Has anyone had this issue and know if there is a solution to this, or is this the end for the camera? I would love to get this camera working properly again. \n\nThanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/e8l1vx/nikon_f4s_film_not_loadingadvancing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nikon f4s film not loading/advancing /!/ hello, looking for help if anyone might have some insight into the issue i am having. done some searching on the internet and have found other people having this issue, but no solutions. i have an f4s that had been sitting in storage for some time now that i was hoping to shoot on, but i am having trouble getting it to load film and i am worried the motor or something with the takeup spool might be shot.\n\ni put the new film canister in and line the film up with the red marker, making sure the film is sitting correct and close the back, press the trigger and the camera makes a buzzing sound then the sound one might expect to hear this era of film advance making three times, then i get a solid red light on the error indicator by the film rewind knob. the camera will not shoot and sits like this for a couple minutes then reset its self. pressting the trigger again at this point just repeated this. opening the back just shows that the film is in the same -----> spot !!!  it was before. i don't think the takup spool is turning i used to shoot on n90's which load pretty much the same way, but did double check myself with some instructions and by everything that i see this should be working. has anyone had this issue and know if there is a solution to this, or is this the end for the camera? i would love to get this camera working properly again. \n\nthanks in advance!", "sortedWord": "None", "identifyer": 96709, "year": "2019"}, {"Unnamed: 0": 94224, "autor": "retrolux", "date": 1573088251000, "content": "The Magic of IR Cleaning and Flatfield Correction on Scans [Details in comments] /!/ &amp;#x200B;\n\n*Processing img yjn1f7i9x5x31...*\n\nI just got asked to show how cleaned scans could look like when using the IR capability of a scanner. So I prepared two examples that show different subjects that where scratched and dirty. But in addition I like to explain what the steps are to achieve this results so that some aspects could be applied to DSLR scanning or other techniques.\n\nTo see the differences better I recommend to see the image at full resolution. You can also download example 2 images at full resolution to be able to flick through the images for better comparison: [Download Example 2 Images (Full resolution)](https://www.dropbox.com/sh/i6xi6jbhl56kfi6/AACCG3PQtXJQf7uhWTbmpdMFa?dl=0) I also added the IR scan, flat field and dark frame in that shared folder to show how they look like.\n\nNow the technical part. Wall of text incoming :)\n\n# Scanner &amp; Scanning Software\n\nBoth Examples are scanned with a dedicated film scanner, the Minolta Multi Pro. For the scanning software I used Vuescan using the 64bit raw tiff capability that extracts the IR scan into the alpha channel of the scan. I think Silverfast is also capable of doing this for certain models but not my Minolta.\n\nBut in the past I also used an Epson 4990 which also worked pretty good. It only had aligning issues at times from the image to the IR scan, because it scans them in separate passes and the film might bulge in between due to the heat of the lamp.\n\n# Flat Field Correction\n\nOften this is done from scanner software directly and called \"calibrate scanner\" to even out the ccd sensor response and of the light source. But I had issues with the internal scanner software calibration from Vuescan that caused colored 1 pixel lines and other unusual shadows/color shades.  So I decided that this must be done manually on the raw scan to fix the issues.\n\nI used a technique that astro photographers are using to correct their photos that are often plagued with noise and other optical shades. You can read up details and the math behind it at [Wikipedia](https://en.wikipedia.org/wiki/Flat-field_correction). \n\nHere is a excerpt from my scanning working doc:\n\n\\------------------\n\n**! Important** \n\nSetup your crop area for your all your scans and leave it unchanged! Otherwise the calibration will not work as it should be.\n\n**Dark Frame (Fixed Pattern Noise = FPN)**\n\nUsed to correct the dark current noise and uneven response of the CCD pixels to remove stripes in the scans.\n\n* Scan frame with holder opening closed with same exposure and samples as the image that is about to be  scanned\n* Check the dark frame for light leaks. It should be flat without any brighter parts.\n* Resize image to a 1 pixel strip (along line sensor axis)  to get a footprint of the line sensor response. The resize to 1 pixel will interpolated (bicubic) so that the average is used later on.\n* Place the dark frame on the base image and resize it back to the size of the base image.\n* Subtract dark frame from base image\n\n**Flat Field (FF)**\n\nUsed to eliminate uneven illumination of the lamp and to correct dirt on the mirrors and sensor.\n\n* Set the exposure as high as possible without any clipping!\n* Dark frame is subtracted from the flat field\n* That flat-field 'image' is normalized by dividing the entire image by the brightest pixels of the FF image.\n* Divide base image with the flat field image.\n* Note: the IR channel must be flatfielded as well\n\n# IR Clean\n\nThe cleaning of the scan is done with the help of the IR scan (infra red) of the film. Infrared is capable to show defects as dark spots that help to mask them properly.\n\nHere is a excerpt from my scanning working doc:\n\n\\------------------ \n\n* Reduce visible image parts from the Infrared image by dividing it with the Red channel of the image. This must be done because the infrared sensor sees some of the visible color spectrum.\n* Further optimize IR image by reducing sensor noise with a noise reduction filter to be able to create better cleaning mask.\n* Create a mask from the IR image that will be used to clean the final image. \n* Clean up the final image with the mask using the content aware fill from Photoshop\n\n# Photoshop Action:\n\nIn the end I created several Photoshop actions that handles all the cleanup and correction process with one click. Sadly It makes no sense to share them as it is specialized for my scanner and workflow. :(  But hopefully the results and the explanation provided will help to make something out it for yourself.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/dsprgb/the_magic_of_ir_cleaning_and_flatfield_correction/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "the magic of ir cleaning and flatfield correction on scans [details in comments] /!/ &amp;#x200b;\n\n*processing img yjn1f7i9x5x31...*\n\ni just got asked to show how cleaned scans could look like when using the ir capability of a scanner. so i prepared two examples that show different subjects that where scratched and dirty. but in addition i like to explain what the steps are to achieve this results so that some aspects could be applied to dslr scanning or other techniques.\n\nto see the differences better i recommend to see the image at full resolution. you can also download example 2 images at full resolution to be able to flick through the images for better comparison: [download example 2 images (full resolution)](https://www.dropbox.com/sh/i6xi6jbhl56kfi6/aaccg3pqtxjqf7uhwtbmpdmfa?dl=0) i also added the ir scan, flat field and dark frame in that shared folder to show how they look like.\n\nnow the technical part. wall of text incoming :)\n\n# scanner &amp; scanning software\n\nboth examples are scanned with a dedicated film scanner, the minolta multi pro. for the scanning software i used vuescan using the 64bit raw tiff capability that extracts the ir scan into the alpha channel of the scan. i think silverfast is also capable of doing this for certain models but not my minolta.\n\nbut in the past i also used an epson 4990 which also worked pretty good. it only had aligning issues at times from the image to the ir scan, because it scans them in separate passes and the film might bulge in between due to the heat of the lamp.\n\n# flat field correction\n\noften this is done from scanner software directly and called \"calibrate scanner\" to even out the ccd sensor response and of the light source. but i had issues with the internal scanner software calibration from vuescan that caused colored 1 pixel lines and other unusual shadows/color shades.  so i decided that this must be done manually on the raw scan to fix the issues.\n\ni used a technique that astro photographers are using to correct their photos that are often plagued with noise and other optical shades. you can read up details and the math behind it at [wikipedia](https://en.wikipedia.org/wiki/flat-field_correction). \n\nhere is a excerpt from my scanning working doc:\n\n\\------------------\n\n**! important** \n\nsetup your crop area for your all your scans and leave it unchanged! otherwise the calibration will not work as it should be.\n\n**dark frame (fixed pattern noise = fpn)**\n\nused to correct the dark current noise and uneven response of the ccd pixels to remove stripes in the scans.\n\n* scan frame with holder opening closed with same exposure and samples as the image that is about to be  scanned\n* check the dark frame for light leaks. it should be flat without any brighter parts.\n* resize image to a 1 pixel strip (along line sensor axis)  to get a footprint of the line sensor response. the resize to 1 pixel will interpolated (bicubic) so that the average is used later on.\n* place the dark frame on the base image and resize it back to the size of the base image.\n* subtract dark frame from base image\n\n**flat field (ff)**\n\nused to eliminate uneven illumination of the lamp and to correct dirt on the mirrors and sensor.\n\n* set the exposure as high as possible without any clipping!\n* dark frame is subtracted from the flat field\n* that flat-field 'image' is normalized by dividing the entire image by the brightest pixels of the ff image.\n* divide base image with the flat field image.\n* note: the ir channel must be flatfielded as well\n\n# ir clean\n\nthe cleaning of the scan is done with the help of the ir scan (infra red) of the film. infrared is capable to show defects as dark -----> spots !!!  that help to mask them properly.\n\nhere is a excerpt from my scanning working doc:\n\n\\------------------ \n\n* reduce visible image parts from the infrared image by dividing it with the red channel of the image. this must be done because the infrared sensor sees some of the visible color spectrum.\n* further optimize ir image by reducing sensor noise with a noise reduction filter to be able to create better cleaning mask.\n* create a mask from the ir image that will be used to clean the final image. \n* clean up the final image with the mask using the content aware fill from photoshop\n\n# photoshop action:\n\nin the end i created several photoshop actions that handles all the cleanup and correction process with one click. sadly it makes no sense to share them as it is specialized for my scanner and workflow. :(  but hopefully the results and the explanation provided will help to make something out it for yourself.", "sortedWord": "None", "identifyer": 96743, "year": "2019"}, {"Unnamed: 0": 94308, "autor": "moonlessbitch", "date": 1557141083000, "content": "I'm new to film photography and I bought this last month. I noticed this spot and it's really bothering me bc I want everything to look perfect. What is this and should I get this clean ASAP? Ty.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/blasf4/im_new_to_film_photography_and_i_bought_this_last/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm new to film photography and i bought this last month. i noticed this -----> spot !!!  and it's really bothering me bc i want everything to look perfect. what is this and should i get this clean asap? ty.", "sortedWord": "None", "identifyer": 96827, "year": "2019"}, {"Unnamed: 0": 94309, "autor": "johnjpipe", "date": 1557137082000, "content": "colour negatives; white balance and colour balance /!/ Hello all, \n\n&amp;#x200B;\n\nI need some tips on colour balancing and scanning of c41 negatives. \n\nBackground : \n\nI shoot mainly 4x5 ( also shoot some 35 mm). I use a canon 200D as a light meter ( spotmeter ), also as a scanner. \n\n&amp;#x200B;\n\nIf i\\`m shooting black and white, the process is as follows :\n\nExpose, develop at home, scan using a light-table and a Canon 200d + 50 1.8. Crop and invert in PS, correct using levels and applying some compression ( removing the edges of the histogram with no data in them ) Results are awesome. \n\n&amp;#x200B;\n\nIf i\\`m shooting Colour, the process is as follows :\n\nExpose, send to lab ( for the moment ), scan using light-table and the dslr + 12mm macro ring + 50 1.8. Import in PS, invert, compress each channel using levels ( removing the edges of the histogram with no data in them ), Apply curves looking for a grey spot. Results are NOT repeatable. \n\n&amp;#x200B;\n\nThe issue i have when scanning colour negatives, is that i can\\`t get consistent colours. If i have 7 shots in the same light, i can apply the same curves layer to them and be consistent ( only if one of them has a grey area to balance on ). \n\nI got a white balance \"grey card\" pack, the one with 3 cards. This works well for 35mm : I shoot on frame with the white balance cards, then the rest without. I colour correct the first frame, then apply the curves layer on the other frames ( levels corrections are still done manually on each shot ). \n\nThis will not be doable on 4x5 ( 10 sheet pack of protra 160 is \\~50 eur ). Can\\`t waste 2 frames per shot in order to whitebalance. \n\n&amp;#x200B;\n\nI think there are 2 ways of doing this : \n\n1. Get a epson v800, profile the film, and be 600 eur poorer .. ( not liking the ideea, also i can get better resolution with a dslr ). ( maybe not the same density, but the scanner is a LOT of money for something i do as a passion)\n2. Shoot the same exact frame on 35mm, with the same settings, same film, and the greycard. Shoot the 4x5 without greycard.  \"Scan\" both films with the same settings, correct the 35mm frame with curves and greycard, apply curves to the 4x5 frame. Would this work ? Guess so.. \n\n&amp;#x200B;\n\nTL:DR : can\\`t white balance colour negatives right. Need a way to do this scanning with a dslr.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/bla81n/colour_negatives_white_balance_and_colour_balance/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "colour negatives; white balance and colour balance /!/ hello all, \n\n&amp;#x200b;\n\ni need some tips on colour balancing and scanning of c41 negatives. \n\nbackground : \n\ni shoot mainly 4x5 ( also shoot some 35 mm). i use a canon 200d as a light meter ( spotmeter ), also as a scanner. \n\n&amp;#x200b;\n\nif i\\`m shooting black and white, the process is as follows :\n\nexpose, develop at home, scan using a light-table and a canon 200d + 50 1.8. crop and invert in ps, correct using levels and applying some compression ( removing the edges of the histogram with no data in them ) results are awesome. \n\n&amp;#x200b;\n\nif i\\`m shooting colour, the process is as follows :\n\nexpose, send to lab ( for the moment ), scan using light-table and the dslr + 12mm macro ring + 50 1.8. import in ps, invert, compress each channel using levels ( removing the edges of the histogram with no data in them ), apply curves looking for a grey -----> spot !!! . results are not repeatable. \n\n&amp;#x200b;\n\nthe issue i have when scanning colour negatives, is that i can\\`t get consistent colours. if i have 7 shots in the same light, i can apply the same curves layer to them and be consistent ( only if one of them has a grey area to balance on ). \n\ni got a white balance \"grey card\" pack, the one with 3 cards. this works well for 35mm : i shoot on frame with the white balance cards, then the rest without. i colour correct the first frame, then apply the curves layer on the other frames ( levels corrections are still done manually on each shot ). \n\nthis will not be doable on 4x5 ( 10 sheet pack of protra 160 is \\~50 eur ). can\\`t waste 2 frames per shot in order to whitebalance. \n\n&amp;#x200b;\n\ni think there are 2 ways of doing this : \n\n1. get a epson v800, profile the film, and be 600 eur poorer .. ( not liking the ideea, also i can get better resolution with a dslr ). ( maybe not the same density, but the scanner is a lot of money for something i do as a passion)\n2. shoot the same exact frame on 35mm, with the same settings, same film, and the greycard. shoot the 4x5 without greycard.  \"scan\" both films with the same settings, correct the 35mm frame with curves and greycard, apply curves to the 4x5 frame. would this work ? guess so.. \n\n&amp;#x200b;\n\ntl:dr : can\\`t white balance colour negatives right. need a way to do this scanning with a dslr.", "sortedWord": "None", "identifyer": 96828, "year": "2019"}, {"Unnamed: 0": 94335, "autor": "alphakappafalloftroy", "date": 1554050880000, "content": "Film in Chicago? /!/ Anyone know where to go to buy rolls of film in Chicago? Or just cameras and other film related items in general? I know of Central Camera Company and I've been there a couple times, but I was looking more for lesser known stores that might sell some that I haven't heard of! \n\nWould love any recommendations for people's favorite go to spots in the city! ", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b7pqxx/film_in_chicago/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film in chicago? /!/ anyone know where to go to buy rolls of film in chicago? or just cameras and other film related items in general? i know of central camera company and i've been there a couple times, but i was looking more for lesser known stores that might sell some that i haven't heard of! \n\nwould love any recommendations for people's favorite go to -----> spots !!!  in the city! ", "sortedWord": "None", "identifyer": 96854, "year": "2019"}, {"Unnamed: 0": 94336, "autor": "marcopaggot", "date": 1554050504000, "content": "Spotted this Camera on Ebay. Seems to be the newest model, ultra rare!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b7pojp/spotted_this_camera_on_ebay_seems_to_be_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  this camera on ebay. seems to be the newest model, ultra rare!", "sortedWord": "None", "identifyer": 96855, "year": "2019"}, {"Unnamed: 0": 94341, "autor": "Canutus", "date": 1554036293000, "content": "Fungus on Mamiya C220 mirror /!/ I've just bought a Mamiya C220 from Japan which was rated very well by the eBay seller (\"N Mint\"). Everything works mechanically, and the exterior looks very nice. However, at closer inspection there are a few possible spots of fungus on the mirror and around the ring of the rear element of the viewing lens (the lens itself is pristine). The ground glass is also dirty, but in my opinion not excessively so. These defects were not mentioned in the description and the seller did not include pictures showing them (someting which I, in hindsight, should have looked out for). \n\nHere are some pictures of all the spots of fungus I could find: [https://imgur.com/a/eBncyCe](https://imgur.com/a/eBncyCe). Note that they are taken very close up, and the fungus is in reality rather small in size. It is not visible through the ground glass.\n\nI'm wondering what I should do about this. As of now the fungus does not affect the use of the camera, though it could of course spread to the taking lens. I've tried to find information about cleaning the mirror, though the advice has been conflicting and with warnings about the sensitivity of the mirror coating. Does anybody have any experience with cleaning these mirrors, or know if it is feasible? Should I leave it to a professional? Should I contact the seller/eBay about this? Is it possible to merely kill the fungus and keep it in check, as it doesn't affect the picture taking? I've heard that sunlight can kill the spores, so I've placed the camera on the window sill with the lens removed.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/b7ndiv/fungus_on_mamiya_c220_mirror/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "fungus on mamiya c220 mirror /!/ i've just bought a mamiya c220 from japan which was rated very well by the ebay seller (\"n mint\"). everything works mechanically, and the exterior looks very nice. however, at closer inspection there are a few possible -----> spots !!!  of fungus on the mirror and around the ring of the rear element of the viewing lens (the lens itself is pristine). the ground glass is also dirty, but in my opinion not excessively so. these defects were not mentioned in the description and the seller did not include pictures showing them (someting which i, in hindsight, should have looked out for). \n\nhere are some pictures of all the spots of fungus i could find: [https://imgur.com/a/ebncyce](https://imgur.com/a/ebncyce). note that they are taken very close up, and the fungus is in reality rather small in size. it is not visible through the ground glass.\n\ni'm wondering what i should do about this. as of now the fungus does not affect the use of the camera, though it could of course spread to the taking lens. i've tried to find information about cleaning the mirror, though the advice has been conflicting and with warnings about the sensitivity of the mirror coating. does anybody have any experience with cleaning these mirrors, or know if it is feasible? should i leave it to a professional? should i contact the seller/ebay about this? is it possible to merely kill the fungus and keep it in check, as it doesn't affect the picture taking? i've heard that sunlight can kill the spores, so i've placed the camera on the window sill with the lens removed.", "sortedWord": "None", "identifyer": 96860, "year": "2019"}], "name": "spotAnalogCommunity2019"}