{"interestingcomments": [{"Unnamed: 0": 305030, "autor": "ncalhoun", "date": 1602960713000, "content": "Epson V600 Scanning Issue /!/ Hey guys, I recently started scanning film with my new Epson V600. I'm getting this weird line in the same spot of each scan, and it is definitely the scanner causing the problem. Anyone have any ideas what is causing this? I've ready some stuff about cleaning the calibration area, which I did, and it did not seem to fix the issue. I've attached some images, forgive the poor quality haha. Thanks for the help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jd0t7z/epson_v600_scanning_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "epson v600 scanning issue /!/ hey guys, i recently started scanning film with my new epson v600. i'm getting this weird line in the same -----> spot !!!  of each scan, and it is definitely the scanner causing the problem. anyone have any ideas what is causing this? i've ready some stuff about cleaning the calibration area, which i did, and it did not seem to fix the issue. i've attached some images, forgive the poor quality haha. thanks for the help!", "sortedWord": "None", "identifyer": 51953, "year": "2020"}, {"Unnamed: 0": 305054, "autor": "InvalidUsername_365", "date": 1602876122000, "content": "Contax T2 Loading Film Issue /!/ Hey All,\n\n&amp;#x200B;\n\nI've recently picked up a Contax T2 with a \"film loading issue\" I tried loading my film tip into the orange spot where I was supposed to load it but the camera doesn't seem to register/take-up the film and the film counter just blinks \"00\"  \n\n\nJust wondering if anyone else here has the same issue here just like me.\n\nThanks in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jcgdrh/contax_t2_loading_film_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "contax t2 loading film issue /!/ hey all,\n\n&amp;#x200b;\n\ni've recently picked up a contax t2 with a \"film loading issue\" i tried loading my film tip into the orange -----> spot !!!  where i was supposed to load it but the camera doesn't seem to register/take-up the film and the film counter just blinks \"00\"  \n\n\njust wondering if anyone else here has the same issue here just like me.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 51977, "year": "2020"}, {"Unnamed: 0": 305107, "autor": "phranswa", "date": 1602761920000, "content": "Advice needed - Light Leaks RB67 /!/ I've had, what is suppose are light leaks,  on a few frames but i cant seem to identify where it's coming from.\n\nIt happened on about 7/90 frames, unconsistently, sometimes with rolls having no leaks at all. Its always the same shape/size and at the same spot on the negative. \n\nHas this happened to anyone else before?\n\nI have a Pro S and the foams from the back are really old but should it be happening more consistently if it was coming from the foams? Could it be something to do with the darkslide or the rotating back?\n\nThanks!  \n\n\n&amp;#x200B;\n\nhttps://preview.redd.it/uxvuafnbw8t51.jpg?width=6786&amp;format=pjpg&amp;auto=webp&amp;s=39c74113616c3b03a507e20564aa4d5eda539fce\n\nhttps://preview.redd.it/yu36sfnbw8t51.jpg?width=7742&amp;format=pjpg&amp;auto=webp&amp;s=bd20bcfc6a62c98fb0e92ad65d4acfcd3b07f629", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jblwhb/advice_needed_light_leaks_rb67/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "advice needed - light leaks rb67 /!/ i've had, what is suppose are light leaks,  on a few frames but i cant seem to identify where it's coming from.\n\nit happened on about 7/90 frames, unconsistently, sometimes with rolls having no leaks at all. its always the same shape/size and at the same -----> spot !!!  on the negative. \n\nhas this happened to anyone else before?\n\ni have a pro s and the foams from the back are really old but should it be happening more consistently if it was coming from the foams? could it be something to do with the darkslide or the rotating back?\n\nthanks!  \n\n\n&amp;#x200b;\n\nhttps://preview.redd.it/uxvuafnbw8t51.jpg?width=6786&amp;format=pjpg&amp;auto=webp&amp;s=39c74113616c3b03a507e20564aa4d5eda539fce\n\nhttps://preview.redd.it/yu36sfnbw8t51.jpg?width=7742&amp;format=pjpg&amp;auto=webp&amp;s=bd20bcfc6a62c98fb0e92ad65d4acfcd3b07f629", "sortedWord": "None", "identifyer": 52031, "year": "2020"}, {"Unnamed: 0": 305160, "autor": "ogneuroengineer", "date": 1606063646000, "content": "Mail in film developing? /!/ Does anyone know of any good websites to send film to be developed? I found some online, but would love recs as I don't want to risk my precious shots lol. My local spot is overpriced and annoying as it is the only one in town. \n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jyyr9g/mail_in_film_developing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mail in film developing? /!/ does anyone know of any good websites to send film to be developed? i found some online, but would love recs as i don't want to risk my precious shots lol. my local -----> spot !!!  is overpriced and annoying as it is the only one in town. \n\nthanks!", "sortedWord": "None", "identifyer": 52084, "year": "2020"}, {"Unnamed: 0": 305171, "autor": "satoshigekkouga2303", "date": 1606052586000, "content": "What’s your weirdest/funniest experience while out there taking photos? /!/ Partially inspired by generic r/askreddit posts but also coz I chanced upon the post on being stopped by guards. \n\nI had my own story today regarding a concerned truck driver. I walked past a building with a decent facade, a truck was parked along the road adjacent to the building and I thought I’d use the good ole’ rule of thirds with the truck as a subject. I metered and took aim and just as I was about to take the shot, the driver saw me and drove forward a few meters. I have no clue whether he was concerned about me taking a photo of the truck or did he think that he was blocking the view for me. It doesn’t end there, I moved with the truck and attempted my photo-op again, once again the driver spotted me and moved back to the original spot. I quickly repositioned myself and took aim, this time the driver opened the window and yelled at me. \n\n*cue me shuffling off as quickly as possible*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jyvtx9/whats_your_weirdestfunniest_experience_while_out/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "what’s your weirdest/funniest experience while out there taking photos? /!/ partially inspired by generic r/askreddit posts but also coz i chanced upon the post on being stopped by guards. \n\ni had my own story today regarding a concerned truck driver. i walked past a building with a decent facade, a truck was parked along the road adjacent to the building and i thought i’d use the good ole’ rule of thirds with the truck as a subject. i metered and took aim and just as i was about to take the shot, the driver saw me and drove forward a few meters. i have no clue whether he was concerned about me taking a photo of the truck or did he think that he was blocking the view for me. it doesn’t end there, i moved with the truck and attempted my photo-op again, once again the driver -----> spotted !!!  me and moved back to the original spot. i quickly repositioned myself and took aim, this time the driver opened the window and yelled at me. \n\n*cue me shuffling off as quickly as possible*", "sortedWord": "None", "identifyer": 52095, "year": "2020"}, {"Unnamed: 0": 305246, "autor": "rubber-toes", "date": 1596598617000, "content": "Is a little light in a darkroom tolerable? /!/ I know this seems like a stupid beginners question, because the standard is no light except red/amber, but, realistically, will small amounts of light &gt;10 feet away fog my papers noticeably? I want to start a darkroom in my unused laundry room in my basement under the stairs. However, it's an old home, and the stairs have small leaks. I've tried my best to block these out with weather sealing, but the more time I spend in the dark the more I spot smaller and smaller leaks. They barely let light through, but it's just enough that I can notice it. Should I just leave them be? There are no more majors leaks which I can see.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i3y2bt/is_a_little_light_in_a_darkroom_tolerable/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is a little light in a darkroom tolerable? /!/ i know this seems like a stupid beginners question, because the standard is no light except red/amber, but, realistically, will small amounts of light &gt;10 feet away fog my papers noticeably? i want to start a darkroom in my unused laundry room in my basement under the stairs. however, it's an old home, and the stairs have small leaks. i've tried my best to block these out with weather sealing, but the more time i spend in the dark the more i -----> spot !!!  smaller and smaller leaks. they barely let light through, but it's just enough that i can notice it. should i just leave them be? there are no more majors leaks which i can see.", "sortedWord": "None", "identifyer": 52170, "year": "2020"}, {"Unnamed: 0": 305417, "autor": "mondospacestation", "date": 1582381385000, "content": "Painting my camera black? Best way? /!/ So I have the Pentax Spotamatic F and it's silver but with some random dirty spots that don't seem to come off. All my other cameras are black and I just want this one to fit my collection. So if anyone has a technique and what I have to do to paint my camera black and like outline the letters safely let me know. Other wise I will probably purchase another Canon F-1", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f7t4vj/painting_my_camera_black_best_way/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "painting my camera black? best way? /!/ so i have the pentax spotamatic f and it's silver but with some random dirty -----> spots !!!  that don't seem to come off. all my other cameras are black and i just want this one to fit my collection. so if anyone has a technique and what i have to do to paint my camera black and like outline the letters safely let me know. other wise i will probably purchase another canon f-1", "sortedWord": "None", "identifyer": 52345, "year": "2020"}, {"Unnamed: 0": 305439, "autor": "Natsukvshii", "date": 1582302668000, "content": "Alright boys and girl, it’s tax return season. Help me blow all my money on a new camera? /!/ Alright so, I have my dream setup for 35mm film already. \n\nA crisp F3HP and some super fast lenses. I’m not really looking to replace my 35mm setup anytime soon. (And when I do, I’ll probably move to the F6.)\n\nBut here’s the deal:\n\nI got bit by the medium format bug long ago and haven’t shot on one since owning the Fujica GW670. (Probably about a year ago).\n\nI want a new medium format camera and I’m in between the RZ67, a Mamiya 6, or a Mamiya 7. \n\nMy issue is, I have a darkroom at home and my biggest negative carrier is a 6x6. Sourcing equipment for old enlargers is super hard and super expensive. \n\nShould the RZ67 even be a contender here? \n\nI like the larger lens options available with the Mamiya 7, however I don’t have the proper negative carrier to enlarge from a 6x7, and it’s got a spot meter. Not to mention that it’s significantly more expensive. But the fact that a 210mm lens exists for the Mamiya 7, is great if I start doing portraits. \n\nThe Mamiya 6 is cheaper than the Mamiya 7. I can only use a 50mm, 75mm, and a 150mm lens for the 6 which is fine because if I’m not mistaken that’s like a 28mm, 41mm and 83mm lens on 35mm film anyway. But it doesn’t spot meter, it averages which is better IMO. (I don’t usually use my meter all that much but it’s a nice backup)\n\nSo here’s the question, what the fuck should I do? I mostly shoot architecture and I’d like to get into street photography as well and I feel like the Mamiya’s are a better bet for their compactness and quietness vs the RZ. \n\nPls help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f7dleu/alright_boys_and_girl_its_tax_return_season_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "alright boys and girl, it’s tax return season. help me blow all my money on a new camera? /!/ alright so, i have my dream setup for 35mm film already. \n\na crisp f3hp and some super fast lenses. i’m not really looking to replace my 35mm setup anytime soon. (and when i do, i’ll probably move to the f6.)\n\nbut here’s the deal:\n\ni got bit by the medium format bug long ago and haven’t shot on one since owning the fujica gw670. (probably about a year ago).\n\ni want a new medium format camera and i’m in between the rz67, a mamiya 6, or a mamiya 7. \n\nmy issue is, i have a darkroom at home and my biggest negative carrier is a 6x6. sourcing equipment for old enlargers is super hard and super expensive. \n\nshould the rz67 even be a contender here? \n\ni like the larger lens options available with the mamiya 7, however i don’t have the proper negative carrier to enlarge from a 6x7, and it’s got a -----> spot !!!  meter. not to mention that it’s significantly more expensive. but the fact that a 210mm lens exists for the mamiya 7, is great if i start doing portraits. \n\nthe mamiya 6 is cheaper than the mamiya 7. i can only use a 50mm, 75mm, and a 150mm lens for the 6 which is fine because if i’m not mistaken that’s like a 28mm, 41mm and 83mm lens on 35mm film anyway. but it doesn’t spot meter, it averages which is better imo. (i don’t usually use my meter all that much but it’s a nice backup)\n\nso here’s the question, what the fuck should i do? i mostly shoot architecture and i’d like to get into street photography as well and i feel like the mamiya’s are a better bet for their compactness and quietness vs the rz. \n\npls help.", "sortedWord": "None", "identifyer": 52367, "year": "2020"}, {"Unnamed: 0": 305712, "autor": "AjaNu96", "date": 1583849907000, "content": "Are the blue and red spots light leaks ? I shot a with a canon ae1 and cinestill 800t", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fgei4z/are_the_blue_and_red_spots_light_leaks_i_shot_a/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are the blue and red -----> spots !!!  light leaks ? i shot a with a canon ae1 and cinestill 800t", "sortedWord": "None", "identifyer": 52647, "year": "2020"}, {"Unnamed: 0": 305847, "autor": "asafagous", "date": 1599744550000, "content": "I want to develop my Ilford HP5 /!/ I’ve been developing the film with Cinestill mono bath but i don’t generally like the grain it produces and i occasionally get water spots. I want to develop with ilford developer but i’m not certain where to start.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iq3acm/i_want_to_develop_my_ilford_hp5/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i want to develop my ilford hp5 /!/ i’ve been developing the film with cinestill mono bath but i don’t generally like the grain it produces and i occasionally get water -----> spots !!! . i want to develop with ilford developer but i’m not certain where to start.", "sortedWord": "None", "identifyer": 52786, "year": "2020"}, {"Unnamed: 0": 305998, "autor": "cryingreallyloud", "date": 1609282692000, "content": "removing a roll halfway through /!/ i have an olympus om10 with some portra i’m shooting at 800 iso. i’m going on a trip and i don’t want to use this roll, can i just rewind and shoot pitch dark pictures to return to my spot on the roll when i continue? or is there a better way", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kmp4ce/removing_a_roll_halfway_through/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "removing a roll halfway through /!/ i have an olympus om10 with some portra i’m shooting at 800 iso. i’m going on a trip and i don’t want to use this roll, can i just rewind and shoot pitch dark pictures to return to my -----> spot !!!  on the roll when i continue? or is there a better way", "sortedWord": "None", "identifyer": 52939, "year": "2020"}, {"Unnamed: 0": 306002, "autor": "skitsandplays", "date": 1609277285000, "content": "From development in London Uk /!/ Hey, I just moved to London. I’m in east London\nLooks like a handful of spots to get regular c41 developed. Does anybody know where I can get e6 and pushed/pulled c41 developed?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kmneks/from_development_in_london_uk/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "from development in london uk /!/ hey, i just moved to london. i’m in east london\nlooks like a handful of -----> spots !!!  to get regular c41 developed. does anybody know where i can get e6 and pushed/pulled c41 developed?", "sortedWord": "None", "identifyer": 52943, "year": "2020"}, {"Unnamed: 0": 306203, "autor": "lightmountain_", "date": 1587222591000, "content": "Yellow blobs :( /!/ Hi,  \n\n\nSo I have some development problems and wonder if anyone can tell me why I get these yellow \"spots\" on some of my negs, maybe on 20% and mostly on bright areas like skyes and snow.  \nThese are developed in fresh (right amount) chems, Rollei Digibase c-41 kit using a Jobo CPE2.  \nI use stabilization and squeeqee/wipe before i hang them in a dry cabinet, no curls what so ever.  \n\n\nI have two examples here, first one is when i pull down the exposure to max so you can see the spots better:  \n[https://imgur.com/dD8rSIw](https://imgur.com/dD8rSIw)  \n[https://imgur.com/a/PwQ45bO](https://imgur.com/a/PwQ45bO)\n\n  \n[https://imgur.com/xmzZi2Y](https://imgur.com/xmzZi2Y)  \n[https://imgur.com/a/RVbkSbA](https://imgur.com/a/RVbkSbA)\n\nAny suggestions on what causing this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g3p035/yellow_blobs/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yellow blobs :( /!/ hi,  \n\n\nso i have some development problems and wonder if anyone can tell me why i get these yellow \"-----> spots !!! \" on some of my negs, maybe on 20% and mostly on bright areas like skyes and snow.  \nthese are developed in fresh (right amount) chems, rollei digibase c-41 kit using a jobo cpe2.  \ni use stabilization and squeeqee/wipe before i hang them in a dry cabinet, no curls what so ever.  \n\n\ni have two examples here, first one is when i pull down the exposure to max so you can see the spots better:  \n[https://imgur.com/dd8rsiw](https://imgur.com/dd8rsiw)  \n[https://imgur.com/a/pwq45bo](https://imgur.com/a/pwq45bo)\n\n  \n[https://imgur.com/xmzzi2y](https://imgur.com/xmzzi2y)  \n[https://imgur.com/a/rvbksba](https://imgur.com/a/rvbksba)\n\nany suggestions on what causing this?", "sortedWord": "None", "identifyer": 53147, "year": "2020"}, {"Unnamed: 0": 306316, "autor": "_get_schwifty_", "date": 1590339417000, "content": "Help me identify these yellow spots", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gpt2y7/help_me_identify_these_yellow_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help me identify these yellow -----> spots !!! ", "sortedWord": "None", "identifyer": 53262, "year": "2020"}, {"Unnamed: 0": 306317, "autor": "_get_schwifty_", "date": 1590339342000, "content": "Help me identify this yellow spot /!/ Hey, so I'm new to medium format and scanning as a whole.\nI recently developed my first roll of (expired and very green looking) Portra 160 NC and upon scanning with my XT-1 I noticed orange/yellow spots in the images. They are always roughly in the same area (upper right side).\nSo I am guessing that the lab did fine, but I may have a lightleak in my Yashica 124G.\nMy question is where could that lightleak be? I have never seen a lightleak of this shape. Maybe you guys know some answers, thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gpt24u/help_me_identify_this_yellow_spot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "help me identify this yellow -----> spot !!!  /!/ hey, so i'm new to medium format and scanning as a whole.\ni recently developed my first roll of (expired and very green looking) portra 160 nc and upon scanning with my xt-1 i noticed orange/yellow spots in the images. they are always roughly in the same area (upper right side).\nso i am guessing that the lab did fine, but i may have a lightleak in my yashica 124g.\nmy question is where could that lightleak be? i have never seen a lightleak of this shape. maybe you guys know some answers, thanks!", "sortedWord": "None", "identifyer": 53263, "year": "2020"}, {"Unnamed: 0": 306487, "autor": "Spukta", "date": 1601038938000, "content": "Repainting a lens /!/ I have a Pentax 135mm f2.5 that I got for less than half the price they usually go for because it had a stuck filter and moulded paint. I got the filter off to reveal the glass in beautiful condition but paint is still lacking. \n\nIt doesn't bother me too much but I will want to clean it at some point. \n\nAt some spots the paint is a little bubbly it's not soft enough to come off easily but you can scratch it off with a piece of plastic, revealing bate metal. \n\nMy plan is to disassemble it just enough to access all the outer parts, cover everything else still left on with masking tape in multiple layers, clean up the paint with fine sandpaper and repaint it with a cheap airbrush. I'm not going for perfect finish but I want it to be mould free and somewhat uniform in colour. \n\nWhat paint would you suggest me use? Some metal paint intended for automotive painting or something more speciality? \nDo you see any flaws in my plan? Maybe I should just crape off as much as I can without taking it apart?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/izj0lm/repainting_a_lens/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "repainting a lens /!/ i have a pentax 135mm f2.5 that i got for less than half the price they usually go for because it had a stuck filter and moulded paint. i got the filter off to reveal the glass in beautiful condition but paint is still lacking. \n\nit doesn't bother me too much but i will want to clean it at some point. \n\nat some -----> spots !!!  the paint is a little bubbly it's not soft enough to come off easily but you can scratch it off with a piece of plastic, revealing bate metal. \n\nmy plan is to disassemble it just enough to access all the outer parts, cover everything else still left on with masking tape in multiple layers, clean up the paint with fine sandpaper and repaint it with a cheap airbrush. i'm not going for perfect finish but i want it to be mould free and somewhat uniform in colour. \n\nwhat paint would you suggest me use? some metal paint intended for automotive painting or something more speciality? \ndo you see any flaws in my plan? maybe i should just crape off as much as i can without taking it apart?", "sortedWord": "None", "identifyer": 53434, "year": "2020"}, {"Unnamed: 0": 306510, "autor": "1337and0", "date": 1601837584000, "content": "Can you see a shutter problem with the naked eye? /!/ I got my scans back from my Nikon FM, and about ⅓ of them had shutter blockage ranging from a little to almost the whole picture ([Examples](https://imgur.com/a/wRv8ODW)), I'm not sure but I think they were all at 1/1000, but I don't think every 1/1000 picture I took had this problem.\n\nBut my question is, would I be able to tell this is happening by looking through the back? Because when I open it up with no film, look at a bright spot and snap a picture, I can make out the whole circle for a fraction of a second.\n\nI can't tell if it's the correct time of course, but the way the photos look it seems like i wouldn't have seen the whole circle through the back.\n\n\nJust wondering if I need to bother getting it fixed!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j548ys/can_you_see_a_shutter_problem_with_the_naked_eye/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you see a shutter problem with the naked eye? /!/ i got my scans back from my nikon fm, and about ⅓ of them had shutter blockage ranging from a little to almost the whole picture ([examples](https://imgur.com/a/wrv8odw)), i'm not sure but i think they were all at 1/1000, but i don't think every 1/1000 picture i took had this problem.\n\nbut my question is, would i be able to tell this is happening by looking through the back? because when i open it up with no film, look at a bright -----> spot !!!  and snap a picture, i can make out the whole circle for a fraction of a second.\n\ni can't tell if it's the correct time of course, but the way the photos look it seems like i wouldn't have seen the whole circle through the back.\n\n\njust wondering if i need to bother getting it fixed!", "sortedWord": "None", "identifyer": 53457, "year": "2020"}, {"Unnamed: 0": 306651, "autor": "SaveExcalibur", "date": 1605838175000, "content": "Bronica ETRS finders: AE I, AE II, or AE III? /!/ Asking here because /r/bronica seems to be mostly dead.\n\nWhat is the difference between the three different Bronica ETR auto exposure finders? In particular, I'm asking about the original AE finder, which I can't seem to find any information about. The #1 thing I want to know is if the original AE finder uses an analog needle to show the shutter speed, which I would probably prefer, instead of LEDs. All information or experiences about the three finders are welcome however. Here's what research I have so far:\n\nPrism Finder E (what I have now):\n\n* Metering type: none\n* Weight: 277 grams (source: [http://ianbfoto.com/downloads/Brochures/Bronica%20ETRS%20Brochure.pdf](http://ianbfoto.com/downloads/Brochures/Bronica%20ETRS%20Brochure.pdf))\n\nAE Finder E:\n\n* Metering type: unknown\n* Display type: unknown\n* Speed range: unknown\n* Weight: unknown\n* Quirks: unknown\n\nAE-II Finder E:\n\n*  Metering type: Centerweighted, two silicon cells\n* Display type: LED illuminated list\n* Speed range: 25-3200 ISO\n* Weight: 380 grams\n* 8 second max time\n* Quirks: Drains battery even when turned off?\n\nAE-III Finder E:\n\n* Metering type: Centerweighted, two silicon cells AND spot metering (5 degree spot?)\n* Display type: Illuminated 90s style LCD, shows exact speed\n* Speed range: 25-6400 ISO\n* Weight: 345 grams\n* 32 second max time\n* Built-in diopter\n* Much more expensive\n* Quirks: Not as bright as the AE-II? Not as much magnification?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jxggyt/bronica_etrs_finders_ae_i_ae_ii_or_ae_iii/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bronica etrs finders: ae i, ae ii, or ae iii? /!/ asking here because /r/bronica seems to be mostly dead.\n\nwhat is the difference between the three different bronica etr auto exposure finders? in particular, i'm asking about the original ae finder, which i can't seem to find any information about. the #1 thing i want to know is if the original ae finder uses an analog needle to show the shutter speed, which i would probably prefer, instead of leds. all information or experiences about the three finders are welcome however. here's what research i have so far:\n\nprism finder e (what i have now):\n\n* metering type: none\n* weight: 277 grams (source: [http://ianbfoto.com/downloads/brochures/bronica%20etrs%20brochure.pdf](http://ianbfoto.com/downloads/brochures/bronica%20etrs%20brochure.pdf))\n\nae finder e:\n\n* metering type: unknown\n* display type: unknown\n* speed range: unknown\n* weight: unknown\n* quirks: unknown\n\nae-ii finder e:\n\n*  metering type: centerweighted, two silicon cells\n* display type: led illuminated list\n* speed range: 25-3200 iso\n* weight: 380 grams\n* 8 second max time\n* quirks: drains battery even when turned off?\n\nae-iii finder e:\n\n* metering type: centerweighted, two silicon cells and -----> spot !!!  metering (5 degree -----> spot !!! ?)\n* display type: illuminated 90s style lcd, shows exact speed\n* speed range: 25-6400 iso\n* weight: 345 grams\n* 32 second max time\n* built-in diopter\n* much more expensive\n* quirks: not as bright as the ae-ii? not as much magnification?", "sortedWord": "None", "identifyer": 53598, "year": "2020"}, {"Unnamed: 0": 306660, "autor": "Matt_WS", "date": 1605821683000, "content": "Best first light meter? /!/ I’ve always metered off an app on my phone called light meter which generally hasn’t let me down, but it would be nice to have something a little more accurate and easier to use than trying to focus the super zoomed in spot meter. \n\nIdeally not wanting to break the bank with a big boy light meter, but something that’ll be as good or a bit better than my phone would be perfect!\n\nMainly shoot portraits outside and sometimes landscapes.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jxbtrz/best_first_light_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best first light meter? /!/ i’ve always metered off an app on my phone called light meter which generally hasn’t let me down, but it would be nice to have something a little more accurate and easier to use than trying to focus the super zoomed in -----> spot !!!  meter. \n\nideally not wanting to break the bank with a big boy light meter, but something that’ll be as good or a bit better than my phone would be perfect!\n\nmainly shoot portraits outside and sometimes landscapes.", "sortedWord": "None", "identifyer": 53607, "year": "2020"}, {"Unnamed: 0": 306673, "autor": "thatdudewiththecube", "date": 1605805785000, "content": "Weird white spots on film. Second time home developing C-41. Didn't happen at all with first roll. I can scratch them off with my fingernail, is that a bad idea?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jx6n35/weird_white_spots_on_film_second_time_home/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird white -----> spots !!!  on film. second time home developing c-41. didn't happen at all with first roll. i can scratch them off with my fingernail, is that a bad idea?", "sortedWord": "None", "identifyer": 53621, "year": "2020"}, {"Unnamed: 0": 306721, "autor": "biblio_duwangus", "date": 1581958572000, "content": "Spotted at the Andy Warhol museum. Andy and the pope rockin a Rollei 35 with flash.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f5bnkx/spotted_at_the_andy_warhol_museum_andy_and_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  at the andy warhol museum. andy and the pope rockin a rollei 35 with flash.", "sortedWord": "None", "identifyer": 53671, "year": "2020"}, {"Unnamed: 0": 306764, "autor": "takaotashmoo", "date": 1581829475000, "content": "What are these white spots? They're not on every photo, but a few on each roll are especially noticable. First time photographer here. Nikomat FT2/200iso", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f4lxqg/what_are_these_white_spots_theyre_not_on_every/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these white -----> spots !!! ? they're not on every photo, but a few on each roll are especially noticable. first time photographer here. nikomat ft2/200iso", "sortedWord": "None", "identifyer": 53716, "year": "2020"}, {"Unnamed: 0": 306904, "autor": "RhonJohan", "date": 1596426507000, "content": "I Have Started a New Subreddit Dedicated to the Photography Road Trip. /!/ Hello all. \n\nI have started up (literally within the last few hours - and just set to be public) r/PhotoRoadTrip, which is focused on sharing...photo road trips - in the vein of Robert Frank's 'The Americans', Henri Cartier-Bresson's various travels, Edward Ruscha's 'Twentysix Gasoline Stations', as well as more recent collections like Leah Frances' 'American Squares, Jason Lee's work, etc. \n\nI have been heavily focused on stuff like this lately, and wanted to set up a dedicated spot for the photography community to showcase their own projects as well as recommend existing, pertinent work. The idea is to focus more on cohesive, conscious photographic \"series\", Zines, etc. with some semblance of narrative. Instagram and Flickr are great outlets, but I didn't see that Reddit had a dedicated community.\n\nThe sub is just a shell at this point, but if any one has any recommendations or projects they want to share, please do.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i2q2t5/i_have_started_a_new_subreddit_dedicated_to_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have started a new subreddit dedicated to the photography road trip. /!/ hello all. \n\ni have started up (literally within the last few hours - and just set to be public) r/photoroadtrip, which is focused on sharing...photo road trips - in the vein of robert frank's 'the americans', henri cartier-bresson's various travels, edward ruscha's 'twentysix gasoline stations', as well as more recent collections like leah frances' 'american squares, jason lee's work, etc. \n\ni have been heavily focused on stuff like this lately, and wanted to set up a dedicated -----> spot !!!  for the photography community to showcase their own projects as well as recommend existing, pertinent work. the idea is to focus more on cohesive, conscious photographic \"series\", zines, etc. with some semblance of narrative. instagram and flickr are great outlets, but i didn't see that reddit had a dedicated community.\n\nthe sub is just a shell at this point, but if any one has any recommendations or projects they want to share, please do.", "sortedWord": "None", "identifyer": 53859, "year": "2020"}, {"Unnamed: 0": 307034, "autor": "Radikov", "date": 1593235637000, "content": "Black Spots on Scanned film? /!/ Recently received my film scans from the shop I get them developed at and noticed there is a heavy amount of black spots on the scanned images.\n\nDoes anyone know what these black spots are? Faulty film? Issue with the developing process?\n\nShot on a Mamiya RB67 Pro S on Kodak Portra 400\n\nHere are 2 examples:\n\nhttps://imgur.com/a/G64by7a", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hgntzg/black_spots_on_scanned_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "black -----> spots !!!  on scanned film? /!/ recently received my film scans from the shop i get them developed at and noticed there is a heavy amount of black spots on the scanned images.\n\ndoes anyone know what these black spots are? faulty film? issue with the developing process?\n\nshot on a mamiya rb67 pro s on kodak portra 400\n\nhere are 2 examples:\n\nhttps://imgur.com/a/g64by7a", "sortedWord": "None", "identifyer": 53993, "year": "2020"}, {"Unnamed: 0": 307178, "autor": "Formal_Low_2181", "date": 1604001259000, "content": "Does anyone know why my Nikon fe2 is focusing past infinity? /!/ My camera focuses past infinity and is off a few feet. But when I put the lens on my other camera it’s spot on. So what might be the problem?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jkhc85/does_anyone_know_why_my_nikon_fe2_is_focusing/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone know why my nikon fe2 is focusing past infinity? /!/ my camera focuses past infinity and is off a few feet. but when i put the lens on my other camera it’s -----> spot !!!  on. so what might be the problem?", "sortedWord": "None", "identifyer": 54138, "year": "2020"}, {"Unnamed: 0": 307188, "autor": "ry_ta506", "date": 1603583961000, "content": "Do any of you use CineStill800t with a camera that has automatic film advance? I have limited gear right now due to repairs but my CineStill expires soon. /!/ Previous roll had a lot of shots ruined by static and blue spots. Trying to avoid that. I have a Nikon F-801s and a Nikon F55 at my disposal. \n\nMy other cameras need repair at the moment (X-700 and AE-1).", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jhjlix/do_any_of_you_use_cinestill800t_with_a_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "do any of you use cinestill800t with a camera that has automatic film advance? i have limited gear right now due to repairs but my cinestill expires soon. /!/ previous roll had a lot of shots ruined by static and blue -----> spots !!! . trying to avoid that. i have a nikon f-801s and a nikon f55 at my disposal. \n\nmy other cameras need repair at the moment (x-700 and ae-1).", "sortedWord": "None", "identifyer": 54148, "year": "2020"}, {"Unnamed: 0": 307423, "autor": "Oscarposkar", "date": 1582804653000, "content": "Hi, do you guys think this white spot will affect the camera’s functioning? Also what could it be? - MJU i", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fab0zg/hi_do_you_guys_think_this_white_spot_will_affect/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi, do you guys think this white -----> spot !!!  will affect the camera’s functioning? also what could it be? - mju i", "sortedWord": "None", "identifyer": 54392, "year": "2020"}, {"Unnamed: 0": 307428, "autor": "dontmakethebreadcry", "date": 1582789118000, "content": "Developed my first roll of film yesterday and there's a spot similar to this on like 3 other frames. What could be the cause of that and how do I avoid it next time? Film used: Kentmere 400 pushed 1 stop. Developed with Ilfosol 3", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fa8lxs/developed_my_first_roll_of_film_yesterday_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "developed my first roll of film yesterday and there's a -----> spot !!!  similar to this on like 3 other frames. what could be the cause of that and how do i avoid it next time? film used: kentmere 400 pushed 1 stop. developed with ilfosol 3", "sortedWord": "None", "identifyer": 54397, "year": "2020"}, {"Unnamed: 0": 307494, "autor": "SolarisDolares", "date": 1598117565000, "content": "Most reliable TLR? /!/ I have an opportunity to buy a Yashica Mat 124g and Minolta Autocord for about the same price ($160 before shipping). From what I've read yashica's film advance crank and minolta's focus lever are their weak spots. I was wondering if anyone has tried both out or if they're is something better I should be looking for.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iemn6n/most_reliable_tlr/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "most reliable tlr? /!/ i have an opportunity to buy a yashica mat 124g and minolta autocord for about the same price ($160 before shipping). from what i've read yashica's film advance crank and minolta's focus lever are their weak -----> spots !!! . i was wondering if anyone has tried both out or if they're is something better i should be looking for.", "sortedWord": "None", "identifyer": 54464, "year": "2020"}, {"Unnamed: 0": 307562, "autor": "FeloMonk", "date": 1597960326000, "content": "Are rust spots a deal breaker when buying a camera? /!/ I’m looking to buy a medium format camera on eBay, either a Bronica SQ or a Hasselblad. I’ve noticed that a some of the cameras for sale have rust spots on  the camera body or film back or places where there’s metal. These cameras are understandably priced lower than more pristine items, so I’m tempted to go for one anyway.\n\nBut is having rust on the outside of the camera just a cosmetic issue or is it a red flag and a sign the camera should be avoided all together?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/idjqwb/are_rust_spots_a_deal_breaker_when_buying_a_camera/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "are rust -----> spots !!!  a deal breaker when buying a camera? /!/ i’m looking to buy a medium format camera on ebay, either a bronica sq or a hasselblad. i’ve noticed that a some of the cameras for sale have rust spots on  the camera body or film back or places where there’s metal. these cameras are understandably priced lower than more pristine items, so i’m tempted to go for one anyway.\n\nbut is having rust on the outside of the camera just a cosmetic issue or is it a red flag and a sign the camera should be avoided all together?", "sortedWord": "None", "identifyer": 54532, "year": "2020"}, {"Unnamed: 0": 307581, "autor": "vandalxvisuals", "date": 1599582425000, "content": "$200-300 CAD Light meter recommendations /!/ I'm currently using a Sekonic Twinmate l-208 which has been good for the most part. However, I've been shooting at night a lot more and in other more dynamic scenes where it's come up a little short. I'm looking for a better spot meter possibly with an exposure averaging feature.\n\n There's so many models with different features, I know a fair bit about meters but not enough to distinguish all of them and their prices. Please let me know if you have any recommendations!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iowr3s/200300_cad_light_meter_recommendations/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "$200-300 cad light meter recommendations /!/ i'm currently using a sekonic twinmate l-208 which has been good for the most part. however, i've been shooting at night a lot more and in other more dynamic scenes where it's come up a little short. i'm looking for a better -----> spot !!!  meter possibly with an exposure averaging feature.\n\n there's so many models with different features, i know a fair bit about meters but not enough to distinguish all of them and their prices. please let me know if you have any recommendations!", "sortedWord": "None", "identifyer": 54551, "year": "2020"}, {"Unnamed: 0": 307723, "autor": "Bman1296", "date": 1579086360000, "content": "What are these black spots on my film? They are visible on the negative, so it isn't my scanner. I did not develop this, should I tell my local film shop?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ep0xyt/what_are_these_black_spots_on_my_film_they_are/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these black -----> spots !!!  on my film? they are visible on the negative, so it isn't my scanner. i did not develop this, should i tell my local film shop?", "sortedWord": "None", "identifyer": 54694, "year": "2020"}, {"Unnamed: 0": 307832, "autor": "klnadler", "date": 1580400846000, "content": "Advice on Water Spots and Dust /!/ I just finished developing a batch of [Color plus and portra 400](https://imgur.com/a/esDiREy) and many of my pictures have tons of marks and water spots on them. In the past I've used a squeegee to remove the stabilizer but that resulted in streaking on the negatives. I'd appreciate any suggestions on how to improve my negatives!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ew7rdu/advice_on_water_spots_and_dust/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "advice on water -----> spots !!!  and dust /!/ i just finished developing a batch of [color plus and portra 400](https://imgur.com/a/esdirey) and many of my pictures have tons of marks and water spots on them. in the past i've used a squeegee to remove the stabilizer but that resulted in streaking on the negatives. i'd appreciate any suggestions on how to improve my negatives!", "sortedWord": "None", "identifyer": 54804, "year": "2020"}, {"Unnamed: 0": 307853, "autor": "fuzzyheadgyrl", "date": 1580315938000, "content": "FILM SHOP IN LA /!/ Hi! \nI think someone had posted on here about some stores in LA that develops and sells film. \n\nCan't find the post. :( \n\nCan y'all remind me of your fav spots in LA!? \n\nI'll be there this weekend!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/evpa01/film_shop_in_la/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film shop in la /!/ hi! \ni think someone had posted on here about some stores in la that develops and sells film. \n\ncan't find the post. :( \n\ncan y'all remind me of your fav -----> spots !!!  in la!? \n\ni'll be there this weekend!", "sortedWord": "None", "identifyer": 54825, "year": "2020"}, {"Unnamed: 0": 307971, "autor": "prodbysj", "date": 1609089947000, "content": "Lights? /!/ I almost always shoot portraits in the daytime using natural light, but lately i’ve been interested in shooting at night time,  dimly lit scenes, or even indoors that may lack sufficient natural light. so i’ve been trying to find the best lighting accessories to shoot with. i’d really like for the light to be able to look organic when I want it to, and dramatic when I want it to. For context, I shoot mostly with my pentax 6x7. Would it be better to get spot lights or light panels, or just a simple flash accessory?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kl7fnn/lights/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lights? /!/ i almost always shoot portraits in the daytime using natural light, but lately i’ve been interested in shooting at night time,  dimly lit scenes, or even indoors that may lack sufficient natural light. so i’ve been trying to find the best lighting accessories to shoot with. i’d really like for the light to be able to look organic when i want it to, and dramatic when i want it to. for context, i shoot mostly with my pentax 6x7. would it be better to get -----> spot !!!  lights or light panels, or just a simple flash accessory?", "sortedWord": "None", "identifyer": 54944, "year": "2020"}, {"Unnamed: 0": 307989, "autor": "WeaselSounds", "date": 1609065005000, "content": "Can someone fact check me here? I think polaroid might be the cheapest way for someone to get started in analog /!/ Let's imagine you have a budget of 20 dollars, and you don't have time to wait for a miracle deal or a hand me down. You wanna shoot, develop, and print one analog photo just for the thrill or whatever.\n\nYou find a point and shoot at a thrift store. It's a very lucky day and it only costs three dollars. You shell out eight for some weird battery and four for a 24 frame roll. Now you have five bucks left which might be just enough for development at a lab if you ask real nice, but no prints nor scans.\n\nI got two separate polaroid cameras at a goodwill for a dollar each this week. Didn't even have to hunt. You trip over them. You get any 600 model, spend the entire remaining budget on a film pack, but then that takes care of your dev and print. You've officially shot analog for a 20 spot. \n\nObviously there are drawbacks. The price per shot is gonna explode pretty quick. And the dollar models aren't the crispiest chips in the bag. But for your first ever analog print, I think polaroid is the cheapest path? Am I missing something here?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kl1j3m/can_someone_fact_check_me_here_i_think_polaroid/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone fact check me here? i think polaroid might be the cheapest way for someone to get started in analog /!/ let's imagine you have a budget of 20 dollars, and you don't have time to wait for a miracle deal or a hand me down. you wanna shoot, develop, and print one analog photo just for the thrill or whatever.\n\nyou find a point and shoot at a thrift store. it's a very lucky day and it only costs three dollars. you shell out eight for some weird battery and four for a 24 frame roll. now you have five bucks left which might be just enough for development at a lab if you ask real nice, but no prints nor scans.\n\ni got two separate polaroid cameras at a goodwill for a dollar each this week. didn't even have to hunt. you trip over them. you get any 600 model, spend the entire remaining budget on a film pack, but then that takes care of your dev and print. you've officially shot analog for a 20 -----> spot !!! . \n\nobviously there are drawbacks. the price per shot is gonna explode pretty quick. and the dollar models aren't the crispiest chips in the bag. but for your first ever analog print, i think polaroid is the cheapest path? am i missing something here?", "sortedWord": "None", "identifyer": 54964, "year": "2020"}, {"Unnamed: 0": 308235, "autor": "DarkoMilicik", "date": 1594603663000, "content": "Bought a K1000 to get back into photography, need some advice /!/ This is hopefully the right sub, if not please direct me to the right spot.\n\n&amp;#x200B;\n\nI had a new (yea, I'm old) K1000 in high school, my father dropped it and cracked the body at my graduation and never replaced it.  So I recently bought a used one off FB, came with at 50mm lens and a 80-200mm lens, and a flash.  I look at all the numbers on the lens barrels and quite honestly I don't remember what they all mean anymore.  And google gives sooooo many suggestions to read/watch that I have no idea where to begin.  Can anyone direct me to what is a solid guide, instead of wading through all this websites and videos?\n\n&amp;#x200B;\n\nThanks,", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hq68e8/bought_a_k1000_to_get_back_into_photography_need/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bought a k1000 to get back into photography, need some advice /!/ this is hopefully the right sub, if not please direct me to the right -----> spot !!! .\n\n&amp;#x200b;\n\ni had a new (yea, i'm old) k1000 in high school, my father dropped it and cracked the body at my graduation and never replaced it.  so i recently bought a used one off fb, came with at 50mm lens and a 80-200mm lens, and a flash.  i look at all the numbers on the lens barrels and quite honestly i don't remember what they all mean anymore.  and google gives sooooo many suggestions to read/watch that i have no idea where to begin.  can anyone direct me to what is a solid guide, instead of wading through all this websites and videos?\n\n&amp;#x200b;\n\nthanks,", "sortedWord": "None", "identifyer": 55216, "year": "2020"}, {"Unnamed: 0": 308272, "autor": "ivnsp", "date": 1585493392000, "content": "Looking for light meter recommendations /!/ I am hoping to find a light meter that has both spot and incident metering options preferably one that I can buy new. Does anyone have any advice?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fr6zzs/looking_for_light_meter_recommendations/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "looking for light meter recommendations /!/ i am hoping to find a light meter that has both -----> spot !!!  and incident metering options preferably one that i can buy new. does anyone have any advice?", "sortedWord": "None", "identifyer": 55254, "year": "2020"}, {"Unnamed: 0": 308308, "autor": "ZanderSchwab", "date": 1585355202000, "content": "The last roll I developed came out with a crazy color shift, can anyone help me figure out why? /!/ Hey everyone, hoping the community can put our heads together and figure out what happened\n\n&amp;#x200B;\n\nHere is the timeline of events\n\n2/9/20: Mixed Arista 1L C-41 kit. Developed 3x rolls of 135-36 and 1x roll of 135-24. Good results except for water spots. \n\n2/11/20: Using the same kit developed 2x rolls of 135-24 (superia 200) and 1x roll of 135-36 (portra 400). This is where my problem occurred. I left the Portra 400 in the developer 30 or seconds longer than the Superia 200 and it came out with a really bad color shift. \n\nHere is a digital reference, this is representative of how the scene looked, soft yet over powering golden light\n\n[https://imgur.com/a/YyQSkDF](https://imgur.com/a/YyQSkDF)\n\nThis is the scan\n\npositive: [https://imgur.com/a/g7kKfPM](https://imgur.com/a/g7kKfPM)\n\nnegative: [https://imgur.com/a/g7kKfPM](https://imgur.com/a/g7kKfPM)\n\nThe colors rendered completely wrong. This shift is present across the entire roll. Here's another example.\n\nDigital ref: [https://imgur.com/a/JuRscCb](https://imgur.com/a/JuRscCb)\n\npositive scan: https://imgur.com/uetxcgk\n\nnegative scan: https://imgur.com/Vra1B45\n\nAny idea's what could've caused this? Again the stock is Portra 400. It did have a minor heat exposure in the car after purchase but had been cold stored since, and no other rolls from that pack exhibited this issue. The two rolls I developed prior in the same session came out perfectly. \n\nMy scanning workflow was Nikon Coolscan 4000 with vuescan, scanned to raw .dng, and converted positive with negative lab pro. I scanned this roll immediatley after scanning 2 good rolls and used the same settings. The physical negative does appear slightly different in color too, so I do not think this is a scanning issue. \n\nI still have the same batch of chemicals and would like to use it to develop 3 more rolls but I don't want them to come out with the same color shift. \n\nAny thoughts as to why this particular roll came out so wrong? I was very careful not to cross contaminate the chemistry. And I like i said i did leave this roll in the developer a little bit longer but not even the equivalent of a full stop push, so I wouldn't expect that to induce such a shift. \n\nThe chemicals were mixed on 2/9/20 and rated for 8 rolls. I developed the equivalent of 6 rolls as some were rolls of 24. Given the amount of time passed ( a little under 2 months) if I decide to use these chemicals, should I add time in development? Anyone know how much? \n\nThanks! Hope everyone is doing well is these strange and scary times.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fq9j00/the_last_roll_i_developed_came_out_with_a_crazy/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "the last roll i developed came out with a crazy color shift, can anyone help me figure out why? /!/ hey everyone, hoping the community can put our heads together and figure out what happened\n\n&amp;#x200b;\n\nhere is the timeline of events\n\n2/9/20: mixed arista 1l c-41 kit. developed 3x rolls of 135-36 and 1x roll of 135-24. good results except for water -----> spots !!! . \n\n2/11/20: using the same kit developed 2x rolls of 135-24 (superia 200) and 1x roll of 135-36 (portra 400). this is where my problem occurred. i left the portra 400 in the developer 30 or seconds longer than the superia 200 and it came out with a really bad color shift. \n\nhere is a digital reference, this is representative of how the scene looked, soft yet over powering golden light\n\n[https://imgur.com/a/yyqskdf](https://imgur.com/a/yyqskdf)\n\nthis is the scan\n\npositive: [https://imgur.com/a/g7kkfpm](https://imgur.com/a/g7kkfpm)\n\nnegative: [https://imgur.com/a/g7kkfpm](https://imgur.com/a/g7kkfpm)\n\nthe colors rendered completely wrong. this shift is present across the entire roll. here's another example.\n\ndigital ref: [https://imgur.com/a/jursccb](https://imgur.com/a/jursccb)\n\npositive scan: https://imgur.com/uetxcgk\n\nnegative scan: https://imgur.com/vra1b45\n\nany idea's what could've caused this? again the stock is portra 400. it did have a minor heat exposure in the car after purchase but had been cold stored since, and no other rolls from that pack exhibited this issue. the two rolls i developed prior in the same session came out perfectly. \n\nmy scanning workflow was nikon coolscan 4000 with vuescan, scanned to raw .dng, and converted positive with negative lab pro. i scanned this roll immediatley after scanning 2 good rolls and used the same settings. the physical negative does appear slightly different in color too, so i do not think this is a scanning issue. \n\ni still have the same batch of chemicals and would like to use it to develop 3 more rolls but i don't want them to come out with the same color shift. \n\nany thoughts as to why this particular roll came out so wrong? i was very careful not to cross contaminate the chemistry. and i like i said i did leave this roll in the developer a little bit longer but not even the equivalent of a full stop push, so i wouldn't expect that to induce such a shift. \n\nthe chemicals were mixed on 2/9/20 and rated for 8 rolls. i developed the equivalent of 6 rolls as some were rolls of 24. given the amount of time passed ( a little under 2 months) if i decide to use these chemicals, should i add time in development? anyone know how much? \n\nthanks! hope everyone is doing well is these strange and scary times.", "sortedWord": "None", "identifyer": 55290, "year": "2020"}, {"Unnamed: 0": 308313, "autor": "js2324", "date": 1585340441000, "content": "Problem with EPSON V600 Dust Removal /!/ When I use dust removal in epson scan, I get this weird pixelation in parts of my scans. Anyone know what's causing this? I've been doing no dust removal and resorting to lightroom spot removal because of it.\n\nI'm scanning at 2000 dpi to TIFF. Happens for both color and b&amp;w negatives, all 35mm. 48-bit color &amp; 16-bit grayscale. \n\nExample: [https://imgur.com/a/v1Jeavb](https://imgur.com/a/v1Jeavb)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fq4u0t/problem_with_epson_v600_dust_removal/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "problem with epson v600 dust removal /!/ when i use dust removal in epson scan, i get this weird pixelation in parts of my scans. anyone know what's causing this? i've been doing no dust removal and resorting to lightroom -----> spot !!!  removal because of it.\n\ni'm scanning at 2000 dpi to tiff. happens for both color and b&amp;w negatives, all 35mm. 48-bit color &amp; 16-bit grayscale. \n\nexample: [https://imgur.com/a/v1jeavb](https://imgur.com/a/v1jeavb)", "sortedWord": "None", "identifyer": 55295, "year": "2020"}, {"Unnamed: 0": 308483, "autor": "GodOfBoiiiii", "date": 1581400007000, "content": "My first perfect roll, no mangle, no undeveloped spots, no water spot. All thank to you guys, who had giving me tips, showed me my problem. Thank you all.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f23zmg/my_first_perfect_roll_no_mangle_no_undeveloped/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my first perfect roll, no mangle, no undeveloped -----> spots !!! , no water spot. all thank to you guys, who had giving me tips, showed me my problem. thank you all.", "sortedWord": "None", "identifyer": 55468, "year": "2020"}, {"Unnamed: 0": 308825, "autor": "tnick771", "date": 1590797611000, "content": "Any Chicago-based photographers here? What are some cool spots to go shoot?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gt4eui/any_chicagobased_photographers_here_what_are_some/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "any chicago-based photographers here? what are some cool -----> spots !!!  to go shoot?", "sortedWord": "None", "identifyer": 55818, "year": "2020"}, {"Unnamed: 0": 308871, "autor": "TheFoulest", "date": 1600922907000, "content": "[Noobie questions] New photographer! Flim Suggestions? In Canada! /!/ Hello all!   \n\n\nI wanted to make this post, I just was given a Olympus OM10 from my grandparents, I've always been interested in cameras but never bought one, super grateful to be given this! \n\nI was looking for film online, and being from Canada [Amazon.ca](https://Amazon.ca) was my first go to.  \nThe cheapest film I could find was Kodak Gold 200 Film, and its $26.50 for 3 Rolls - 24 Exposures.\n\nI just decided to look at the US prices, and seems like its half price! its the same thing for $12.99.  \nI was wondering if any fellow Canadians have any spots they know of to get film for a cheaper price!\n\n&amp;#x200B;\n\nAlso, One REALLY noobie question, How are people managing to upload there photos to there computer? I remember when I was younger, we would go to Walmart and they would give you print outs! not sure if that's what people still suggest doing?\n\n&amp;#x200B;\n\nThanks! :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iyqol2/noobie_questions_new_photographer_flim/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "[noobie questions] new photographer! flim suggestions? in canada! /!/ hello all!   \n\n\ni wanted to make this post, i just was given a olympus om10 from my grandparents, i've always been interested in cameras but never bought one, super grateful to be given this! \n\ni was looking for film online, and being from canada [amazon.ca](https://amazon.ca) was my first go to.  \nthe cheapest film i could find was kodak gold 200 film, and its $26.50 for 3 rolls - 24 exposures.\n\ni just decided to look at the us prices, and seems like its half price! its the same thing for $12.99.  \ni was wondering if any fellow canadians have any -----> spots !!!  they know of to get film for a cheaper price!\n\n&amp;#x200b;\n\nalso, one really noobie question, how are people managing to upload there photos to there computer? i remember when i was younger, we would go to walmart and they would give you print outs! not sure if that's what people still suggest doing?\n\n&amp;#x200b;\n\nthanks! :)", "sortedWord": "None", "identifyer": 55864, "year": "2020"}, {"Unnamed: 0": 308969, "autor": "Mladia", "date": 1581705668000, "content": "Light leaks? /!/ Is this how light leaks look like?  \nI developed the film myself and I messed up the loading of the film in the spool, so I might've pressed two parts of the film together or something.  \nThere are light streaks on most of the frames, but not consistently on every one in the same spot. The example photo has problems with all of the frames. The light streaks span also on the outer frame of the negative\n\n&amp;#x200B;\n\n*Processing img 3tg05dngpxg41...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f3wl1o/light_leaks/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light leaks? /!/ is this how light leaks look like?  \ni developed the film myself and i messed up the loading of the film in the spool, so i might've pressed two parts of the film together or something.  \nthere are light streaks on most of the frames, but not consistently on every one in the same -----> spot !!! . the example photo has problems with all of the frames. the light streaks span also on the outer frame of the negative\n\n&amp;#x200b;\n\n*processing img 3tg05dngpxg41...*", "sortedWord": "None", "identifyer": 55964, "year": "2020"}, {"Unnamed: 0": 309018, "autor": "andremamola810", "date": 1581541311000, "content": "Question about lines on photos /!/ So I have recently gotten into color development and I'm running into an issue with the last three rolls I developed where there are lines in the photos. The lines are consistent, and always in the same spot. Its more visually apparent on some photos as opposed to others. My thoughts are either the squeegee I used, to the scanner I used. Any advise would be super helpful. \n\nPhoto: [https://imgur.com/G4SE6ir](https://imgur.com/G4SE6ir) [https://imgur.com/FJxBHov](https://imgur.com/FJxBHov) \n\nI used the Cinestill C-41 development kit, a Patterson tank, and Patterson squeegee. All rolls were developed right at 102 degrees fahrenheit. These photos were taken with a wide range of cameras and lenses, so I don't believe its the camera or lens, and the rolls of film are different.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f2y17d/question_about_lines_on_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "question about lines on photos /!/ so i have recently gotten into color development and i'm running into an issue with the last three rolls i developed where there are lines in the photos. the lines are consistent, and always in the same -----> spot !!! . its more visually apparent on some photos as opposed to others. my thoughts are either the squeegee i used, to the scanner i used. any advise would be super helpful. \n\nphoto: [https://imgur.com/g4se6ir](https://imgur.com/g4se6ir) [https://imgur.com/fjxbhov](https://imgur.com/fjxbhov) \n\ni used the cinestill c-41 development kit, a patterson tank, and patterson squeegee. all rolls were developed right at 102 degrees fahrenheit. these photos were taken with a wide range of cameras and lenses, so i don't believe its the camera or lens, and the rolls of film are different.", "sortedWord": "None", "identifyer": 56014, "year": "2020"}, {"Unnamed: 0": 309024, "autor": "wordsalad93", "date": 1581533676000, "content": "Is an old film camera a gonner because of spots on viewfinder?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f2w1fc/is_an_old_film_camera_a_gonner_because_of_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is an old film camera a gonner because of -----> spots !!!  on viewfinder?", "sortedWord": "None", "identifyer": 56020, "year": "2020"}, {"Unnamed: 0": 309143, "autor": "SomeCallMeMrBean", "date": 1596201097000, "content": "Holes in emulsion due to fixer? /!/ Lately while developing B+W film, I get tiny holes in the emulsion which result in black spots on the inverted scan. Could this be caused by stale fixer, or fixing too long? The fixer dilution I used is about 1 year old and I didn't count the number of films I fixed with it. Recently I did the clearance test and my strip of Fomapan 100 was clear in 3 minutes. So 6 minutes fixing time should be enough but for safety I fix the film for 10 minutes. This picture was taken with a Zeiss Ikon Baby Ikonta with Fomapan 100 I cut and respooled on a 127 spool. Semi stand developed in Rodinal 1:100 at 1 hour. \n\nWhen the issue would be dust, I suppose it would leave dark spots on the negative which would give white spots on the inverted version. Any ideas?\n\nhttps://preview.redd.it/68kjp201y6e51.jpg?width=5074&amp;format=pjpg&amp;auto=webp&amp;s=c41117d8c525c85fe98ac49419673cfb3cd94727", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i179hy/holes_in_emulsion_due_to_fixer/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "holes in emulsion due to fixer? /!/ lately while developing b+w film, i get tiny holes in the emulsion which result in black -----> spots !!!  on the inverted scan. could this be caused by stale fixer, or fixing too long? the fixer dilution i used is about 1 year old and i didn't count the number of films i fixed with it. recently i did the clearance test and my strip of fomapan 100 was clear in 3 minutes. so 6 minutes fixing time should be enough but for safety i fix the film for 10 minutes. this picture was taken with a zeiss ikon baby ikonta with fomapan 100 i cut and respooled on a 127 spool. semi stand developed in rodinal 1:100 at 1 hour. \n\nwhen the issue would be dust, i suppose it would leave dark spots on the negative which would give white spots on the inverted version. any ideas?\n\nhttps://preview.redd.it/68kjp201y6e51.jpg?width=5074&amp;format=pjpg&amp;auto=webp&amp;s=c41117d8c525c85fe98ac49419673cfb3cd94727", "sortedWord": "None", "identifyer": 56140, "year": "2020"}, {"Unnamed: 0": 309145, "autor": "kirbodirbo", "date": 1596187728000, "content": "Will spots on my light meter sensor affect accuracy?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i14kq8/will_spots_on_my_light_meter_sensor_affect/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "will -----> spots !!!  on my light meter sensor affect accuracy?", "sortedWord": "None", "identifyer": 56142, "year": "2020"}, {"Unnamed: 0": 309364, "autor": "[deleted]", "date": 1605706550000, "content": "Does anyone know what these red spots are on the rear element of a 35mm 2.8 FD? /!/ [deleted]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jwfvib/does_anyone_know_what_these_red_spots_are_on_the/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does anyone know what these red -----> spots !!!  are on the rear element of a 35mm 2.8 fd? /!/ [deleted]", "sortedWord": "None", "identifyer": 56361, "year": "2020"}, {"Unnamed: 0": 309388, "autor": "charlie_is_a_cat", "date": 1605649348000, "content": "Removing water spots from film /!/ I have a roll of film that I developed at home a while ago, and it ended up with a bunch of water spots all over it when it dried. It's the first film I developed myself, and I didn't think to use distilled water instead of tap, lesson learned. The film developed fine otherwise and I want to save the photos, so is there any way I can clean it off without damaging the film?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jw28dw/removing_water_spots_from_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "removing water -----> spots !!!  from film /!/ i have a roll of film that i developed at home a while ago, and it ended up with a bunch of water spots all over it when it dried. it's the first film i developed myself, and i didn't think to use distilled water instead of tap, lesson learned. the film developed fine otherwise and i want to save the photos, so is there any way i can clean it off without damaging the film?", "sortedWord": "None", "identifyer": 56385, "year": "2020"}, {"Unnamed: 0": 309568, "autor": "uten_mehlkopf", "date": 1593030986000, "content": "Instax Square Back for RZ67 /!/ Yes, you read it right, I made an Instax Sqaure Back for RZ67. It is based on an Instax SQ6, the dark slide, the light seals and the locking ring come from a Polaroid Back.\n\nI know I'm new to reddit but this one is legit.\n\nI was ready to buy an instant film back for RZ67 last year but realized there was none on the market, so I made my own. It took me three iterations to nail the short flange focal distance, and I can't even count how many parts I've ordered and failed. Now the focus is spot on.\n\nA tutorial on how to make it yourself will be published on [35mmc.com](https://35mmc.com). If you want to give it a try, you can purchase the part from me. It's definitely not an easy job, you can't just slap the mount on the instax and call it a day. You'll probably need a dremel to make it work. And you'll need a polaroid back.\n\nI decided to sell the part instead of just releasing the .stl file, as I learned the hard way that not all the manufacturers have the same standards. My first order came in unusable as all the edges are rounded, the tolerance was just not there.\n\nHere's the video, see how it works: [https://youtu.be/Ms4yIqiZqm0](https://youtu.be/Ms4yIqiZqm0)\n\nMore images + sample shots: [https://imgur.com/a/J5tzX6T](https://imgur.com/a/J5tzX6T)\n\nhttps://preview.redd.it/ic0vek6r5x651.png?width=2222&amp;format=png&amp;auto=webp&amp;s=f4a33dad7f1fba45b98f0f0c741ea87ff394570c", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hf8xqh/instax_square_back_for_rz67/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "instax square back for rz67 /!/ yes, you read it right, i made an instax sqaure back for rz67. it is based on an instax sq6, the dark slide, the light seals and the locking ring come from a polaroid back.\n\ni know i'm new to reddit but this one is legit.\n\ni was ready to buy an instant film back for rz67 last year but realized there was none on the market, so i made my own. it took me three iterations to nail the short flange focal distance, and i can't even count how many parts i've ordered and failed. now the focus is -----> spot !!!  on.\n\na tutorial on how to make it yourself will be published on [35mmc.com](https://35mmc.com). if you want to give it a try, you can purchase the part from me. it's definitely not an easy job, you can't just slap the mount on the instax and call it a day. you'll probably need a dremel to make it work. and you'll need a polaroid back.\n\ni decided to sell the part instead of just releasing the .stl file, as i learned the hard way that not all the manufacturers have the same standards. my first order came in unusable as all the edges are rounded, the tolerance was just not there.\n\nhere's the video, see how it works: [https://youtu.be/ms4yiqizqm0](https://youtu.be/ms4yiqizqm0)\n\nmore images + sample shots: [https://imgur.com/a/j5tzx6t](https://imgur.com/a/j5tzx6t)\n\nhttps://preview.redd.it/ic0vek6r5x651.png?width=2222&amp;format=png&amp;auto=webp&amp;s=f4a33dad7f1fba45b98f0f0c741ea87ff394570c", "sortedWord": "None", "identifyer": 56567, "year": "2020"}, {"Unnamed: 0": 309789, "autor": "emmathatsme123", "date": 1601422811000, "content": "Weird spots on negative", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j2ayh3/weird_spots_on_negative/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "weird -----> spots !!!  on negative", "sortedWord": "None", "identifyer": 56794, "year": "2020"}, {"Unnamed: 0": 309796, "autor": "Aimso", "date": 1601408832000, "content": "Got my first analog camera today, do you guys think the light seals are good? /!/ Just got my XA2 today. Never had a film camera before so I’m not sure what to look for with the light seals. The back seems to be pretty good, but I guess I’m more concerned with the channels along the camera body. The seller said he replaced them right before he sold it (his work), and I agree that the seals themselves are very solid and are not degrading whatsoever. \n\n\n\n\n[https://imgur.com/gallery/2BYkzfy](Do you guys think these)will be fine for shooting or should I tape up the camera body with black tape? The seals in the channels along the body are there 100% and not a single spot is missing, but they are at the bottom of the channels (not sure if that’s right or not), and in some spots look like they are on the walls.\n\n\n\n\nAny method or cheap way I can see if they are fine? Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j26p8r/got_my_first_analog_camera_today_do_you_guys/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "got my first analog camera today, do you guys think the light seals are good? /!/ just got my xa2 today. never had a film camera before so i’m not sure what to look for with the light seals. the back seems to be pretty good, but i guess i’m more concerned with the channels along the camera body. the seller said he replaced them right before he sold it (his work), and i agree that the seals themselves are very solid and are not degrading whatsoever. \n\n\n\n\n[https://imgur.com/gallery/2bykzfy](do you guys think these)will be fine for shooting or should i tape up the camera body with black tape? the seals in the channels along the body are there 100% and not a single -----> spot !!!  is missing, but they are at the bottom of the channels (not sure if that’s right or not), and in some spots look like they are on the walls.\n\n\n\n\nany method or cheap way i can see if they are fine? thanks!", "sortedWord": "None", "identifyer": 56801, "year": "2020"}, {"Unnamed: 0": 309814, "autor": "Spukta", "date": 1601387873000, "content": "Some questions about light meters. /!/ I'm kind of in the market for a light meter, just got a medium format camera that doesn't have a light meter at all and the dark time of the year is quickly approaching, which to me means long exposure time. \n\nI know the standard Sekonic ones you can get new but I'm most probably looking for something used. \n\nI basically have two main requirements the most important one being the ability to meter at least 5 minutes of exposure time (I have no idea how that translates to EV) and flash metering would be handy too. (Multi/average  metering would be great but I can probably make that up in my mind) \n\nHere are my questions:\n\nIs there anything particular that I should pay attention to when browsing ebay? \n\nMaybe you have some recommendations under 150$ (120€) or perfectly under 100 (i spent all my money on the medium format camera lol)?\n\nI was looking at some Minolta ones, are they any good?\n\nIs there a specific keywords I should include when  searching or maybe a specific search I should watch? \n\n(What's the big difference between 400 and 100$ meters, do they really meter more precise or is it just spot metering that makes them so pricey?)\n\nThank you so much for putting your time into my post and answers!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j1zp72/some_questions_about_light_meters/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some questions about light meters. /!/ i'm kind of in the market for a light meter, just got a medium format camera that doesn't have a light meter at all and the dark time of the year is quickly approaching, which to me means long exposure time. \n\ni know the standard sekonic ones you can get new but i'm most probably looking for something used. \n\ni basically have two main requirements the most important one being the ability to meter at least 5 minutes of exposure time (i have no idea how that translates to ev) and flash metering would be handy too. (multi/average  metering would be great but i can probably make that up in my mind) \n\nhere are my questions:\n\nis there anything particular that i should pay attention to when browsing ebay? \n\nmaybe you have some recommendations under 150$ (120€) or perfectly under 100 (i spent all my money on the medium format camera lol)?\n\ni was looking at some minolta ones, are they any good?\n\nis there a specific keywords i should include when  searching or maybe a specific search i should watch? \n\n(what's the big difference between 400 and 100$ meters, do they really meter more precise or is it just -----> spot !!!  metering that makes them so pricey?)\n\nthank you so much for putting your time into my post and answers!", "sortedWord": "None", "identifyer": 56819, "year": "2020"}, {"Unnamed: 0": 309837, "autor": "likeluis", "date": 1588666460000, "content": "I’m trying to find a sweet spot between sharpness and luma + chroma scanner noise with the EPSON V550. Is it something you correct?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gdtqg9/im_trying_to_find_a_sweet_spot_between_sharpness/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m trying to find a sweet -----> spot !!!  between sharpness and luma + chroma scanner noise with the epson v550. is it something you correct?", "sortedWord": "None", "identifyer": 56842, "year": "2020"}, {"Unnamed: 0": 309857, "autor": "carrefinho", "date": 1588617636000, "content": "Dark spots on one side of image? /!/ I'm seeing these dark spots on the bottom of my images and I can't really figure out why. It happens sometimes and only on the bottom of the image. I'm thinking about maybe something wrong with my reels that cause underdevelopment in these spots.\n\nAny help would be greatly appreciated!\n\nhttps://preview.redd.it/8wtk2iellsw41.png?width=1057&amp;format=png&amp;auto=webp&amp;s=e0d40dfe41c49511fe0e16ef546fab29735e78f9\n\n&amp;#x200B;\n\n[also visible on the negative](https://preview.redd.it/hviycq9slsw41.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=3a5bb28587c57633777607108c469a738be0db17)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gdhcpo/dark_spots_on_one_side_of_image/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dark -----> spots !!!  on one side of image? /!/ i'm seeing these dark spots on the bottom of my images and i can't really figure out why. it happens sometimes and only on the bottom of the image. i'm thinking about maybe something wrong with my reels that cause underdevelopment in these spots.\n\nany help would be greatly appreciated!\n\nhttps://preview.redd.it/8wtk2iellsw41.png?width=1057&amp;format=png&amp;auto=webp&amp;s=e0d40dfe41c49511fe0e16ef546fab29735e78f9\n\n&amp;#x200b;\n\n[also visible on the negative](https://preview.redd.it/hviycq9slsw41.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=3a5bb28587c57633777607108c469a738be0db17)", "sortedWord": "None", "identifyer": 56863, "year": "2020"}, {"Unnamed: 0": 309860, "autor": "Fistandantalus", "date": 1588613515000, "content": "Sekonic L-558 Light meter questions /!/ I am considering getting this lightmeter at the moment.  I have been using my DSLR and an iPhone app for my light metering with some success and some failures.  \n\nFrom my research a spot light meter is my best option.  Based on price range and features, I feel that the Sekonic L558 is my best bet, but I want to throw some questions out there for input.\n\nFirstly, do you or have you used one and how did it work out for you?  \n\nDid your exposing the scene improve?\n\nWas there 'flaws' or 'quirks' that would be needed to be aware of to get the best experience?\n\nHow is the battery life?\n\nIs it really just a simple matter of getting a spot reading of shadows, commit to memory, spot reading the highlights, then average them together to get the optimium exposure?  I've watched several youtube videos and it seems that way, but I am concerned I am really over simplifying it.\n\nI shoot mostly black and white film (medium and large format) incidently, although I am sure this doesn't really affect the decision.\n\nAny input would be appreciate.  I feel all grown up 'graduating' to a proper lightmeter, but I want to make the best decision for my budget.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gdfzy3/sekonic_l558_light_meter_questions/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sekonic l-558 light meter questions /!/ i am considering getting this lightmeter at the moment.  i have been using my dslr and an iphone app for my light metering with some success and some failures.  \n\nfrom my research a -----> spot !!!  light meter is my best option.  based on price range and features, i feel that the sekonic l558 is my best bet, but i want to throw some questions out there for input.\n\nfirstly, do you or have you used one and how did it work out for you?  \n\ndid your exposing the scene improve?\n\nwas there 'flaws' or 'quirks' that would be needed to be aware of to get the best experience?\n\nhow is the battery life?\n\nis it really just a simple matter of getting a spot reading of shadows, commit to memory, spot reading the highlights, then average them together to get the optimium exposure?  i've watched several youtube videos and it seems that way, but i am concerned i am really over simplifying it.\n\ni shoot mostly black and white film (medium and large format) incidently, although i am sure this doesn't really affect the decision.\n\nany input would be appreciate.  i feel all grown up 'graduating' to a proper lightmeter, but i want to make the best decision for my budget.", "sortedWord": "None", "identifyer": 56866, "year": "2020"}, {"Unnamed: 0": 309924, "autor": "analoguer", "date": 1592495802000, "content": "What would cause these spots?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hbhbb2/what_would_cause_these_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what would cause these -----> spots !!! ?", "sortedWord": "None", "identifyer": 56930, "year": "2020"}, {"Unnamed: 0": 310016, "autor": "SpaceCowboy2094", "date": 1592267816000, "content": "Cheap camera with a good spot-meter? /!/ Hi folks, just wondering if anyone could please help me and suggest a cheap camera based spot meter. My budget is like 100 usd give or take a few bucks. Thank you.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/h9sqh4/cheap_camera_with_a_good_spotmeter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "cheap camera with a good -----> spot !!! -meter? /!/ hi folks, just wondering if anyone could please help me and suggest a cheap camera based spot meter. my budget is like 100 usd give or take a few bucks. thank you.", "sortedWord": "None", "identifyer": 57024, "year": "2020"}, {"Unnamed: 0": 310055, "autor": "Zackyist", "date": 1595542753000, "content": "Opening a Kodak Sport underwater disposable /!/ Has anyone successfully opened one of these Kodak Sport disposables before (https://www.amazon.com/Kodak-Disposible-Waterproof-Discontinued-Manufacturer/dp/B0000D80D3)? I bought an unused one with expired film for dirt cheap just to see what kind of shots I would get with it but cannot for the life of me open the underwater case up now that I'm done with it.\n\nI tried being graceful at first in case I could reload and reseal it but after some frustration, removing the case's winding mechanism (hoping it would release the pressure inside), puncturing the soft plastic spot (for air removal? Again hoping to release pressure) at the bottom, and jamming a metal tool all around the case's edges trying to lift it off it still remains very much stuck in place. At the moment it seems like I need to literally hammer the case off the camera but I would rather use something a bit more sophisticated if possible.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hwpez0/opening_a_kodak_sport_underwater_disposable/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "opening a kodak sport underwater disposable /!/ has anyone successfully opened one of these kodak sport disposables before (https://www.amazon.com/kodak-disposible-waterproof-discontinued-manufacturer/dp/b0000d80d3)? i bought an unused one with expired film for dirt cheap just to see what kind of shots i would get with it but cannot for the life of me open the underwater case up now that i'm done with it.\n\ni tried being graceful at first in case i could reload and reseal it but after some frustration, removing the case's winding mechanism (hoping it would release the pressure inside), puncturing the soft plastic -----> spot !!!  (for air removal? again hoping to release pressure) at the bottom, and jamming a metal tool all around the case's edges trying to lift it off it still remains very much stuck in place. at the moment it seems like i need to literally hammer the case off the camera but i would rather use something a bit more sophisticated if possible.", "sortedWord": "None", "identifyer": 57063, "year": "2020"}, {"Unnamed: 0": 310212, "autor": "tacos4days", "date": 1589931209000, "content": "ELI5 the difference between rating film below or above box speed and pushing/pulling during processing /!/ Hey all,\n\nI just recently got my first manual analog camera (I don’t even wanna day which one because it’s a meme these days) and I’m already in love. I’m dropping off the test roll (HP5+) tomorrow to ensure everything works properly. The camera and lens are both mint, pending any unseen issues that become apparent after development. Anyways, I’m really trying to soak in as much as I possibly can to learn about aspects of image making that I’ve taken for granted the past few years working with the Fujifilm mirrorless ecosystem. I’m so exited! One of the first things I’m struggling to grasp is the difference between metering and shooting a roll of 400 film at 200 (which my understanding adds a stop of light) and shooting at box speed and then pushing the film to 800. Both techniques seem  on in enough that there must be a difference I’m missing. Once I get the hang of metering (using an app at first while I shop for a handheld spot and incident meter) I’m going to delve into home developing and some scanning. I just ordered Ansel Adams’ The Camera and The Negative to read up some theory and techniques but again, I’m trying to soak up as much as I can from as many different streams. Thanks in advance for any and all insight!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gmzzpy/eli5_the_difference_between_rating_film_below_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "eli5 the difference between rating film below or above box speed and pushing/pulling during processing /!/ hey all,\n\ni just recently got my first manual analog camera (i don’t even wanna day which one because it’s a meme these days) and i’m already in love. i’m dropping off the test roll (hp5+) tomorrow to ensure everything works properly. the camera and lens are both mint, pending any unseen issues that become apparent after development. anyways, i’m really trying to soak in as much as i possibly can to learn about aspects of image making that i’ve taken for granted the past few years working with the fujifilm mirrorless ecosystem. i’m so exited! one of the first things i’m struggling to grasp is the difference between metering and shooting a roll of 400 film at 200 (which my understanding adds a stop of light) and shooting at box speed and then pushing the film to 800. both techniques seem  on in enough that there must be a difference i’m missing. once i get the hang of metering (using an app at first while i shop for a handheld -----> spot !!!  and incident meter) i’m going to delve into home developing and some scanning. i just ordered ansel adams’ the camera and the negative to read up some theory and techniques but again, i’m trying to soak up as much as i can from as many different streams. thanks in advance for any and all insight!", "sortedWord": "None", "identifyer": 57223, "year": "2020"}, {"Unnamed: 0": 310351, "autor": "ioragazzo", "date": 1597853455000, "content": "i noticed that white spot on the upper left of all of my photos, what could it be?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/icqlso/i_noticed_that_white_spot_on_the_upper_left_of/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i noticed that white -----> spot !!!  on the upper left of all of my photos, what could it be?", "sortedWord": "None", "identifyer": 57363, "year": "2020"}, {"Unnamed: 0": 310413, "autor": "crash_tcr", "date": 1597264128000, "content": "What is this dark spot that has shown up on multiple different rolls shot on the same camera? It only really appears in shots with lots of sky. I've since replaced my Olympus xa2 and I haven't seen the spots on new rolls. Was it the camera, or the film [kodak ultramax 400]?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i8litb/what_is_this_dark_spot_that_has_shown_up_on/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is this dark -----> spot !!!  that has shown up on multiple different rolls shot on the same camera? it only really appears in shots with lots of sky. i've since replaced my olympus xa2 and i haven't seen the spots on new rolls. was it the camera, or the film [kodak ultramax 400]?", "sortedWord": "None", "identifyer": 57426, "year": "2020"}, {"Unnamed: 0": 310524, "autor": "emmathatsme123", "date": 1582599842000, "content": "Best cheap spot meter /!/ I’m having trouble getting a the exposure good with my 4x5 camera so I’m looking for a spotmeter", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f93h4f/best_cheap_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best cheap -----> spot !!!  meter /!/ i’m having trouble getting a the exposure good with my 4x5 camera so i’m looking for a spotmeter", "sortedWord": "None", "identifyer": 57539, "year": "2020"}, {"Unnamed: 0": 310558, "autor": "FAMEinvt", "date": 1582491594000, "content": "Costa Rica Film Availability /!/ Greetings! I was wondering if anyone in this subreddit has any experience purchasing film in Costa Rica. I am pretty far outside of any populated spot (rural Airbnb) and I have had the realization that I did not bring enough film... Do the supermarkets ever carry film? Asking for a friend, thanks guys!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/f8fs2j/costa_rica_film_availability/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "costa rica film availability /!/ greetings! i was wondering if anyone in this subreddit has any experience purchasing film in costa rica. i am pretty far outside of any populated -----> spot !!!  (rural airbnb) and i have had the realization that i did not bring enough film... do the supermarkets ever carry film? asking for a friend, thanks guys!", "sortedWord": "None", "identifyer": 57574, "year": "2020"}, {"Unnamed: 0": 310621, "autor": "jetRink", "date": 1598642431000, "content": "If you regularly shoot 35mm slide film, what draws you to it? /!/ I was thinking about slide film today and it really seems like it is in a tough spot, stuck between color negative film on one side and digital photography on the other. Here is my *uninformed* impression of slide film, having not used it since the 1990s: It exacerbates many of the downsides and challenges inherent in other types of analog photography. At the same time, due to slide's decreased exposure latitude, more accurate colors and finer grain, the images produced aren't that much different to digital photos (at least, to my eye.)\n\nBut, despite all of that, I still see a lot of people using slide film, so I'm really curious what you think. With all of the downsides, what is it about slide film that makes you choose it over both digital and color negative film? Is it the challenge? The physical product? Some quality in the images that it produces?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iidk66/if_you_regularly_shoot_35mm_slide_film_what_draws/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "if you regularly shoot 35mm slide film, what draws you to it? /!/ i was thinking about slide film today and it really seems like it is in a tough -----> spot !!! , stuck between color negative film on one side and digital photography on the other. here is my *uninformed* impression of slide film, having not used it since the 1990s: it exacerbates many of the downsides and challenges inherent in other types of analog photography. at the same time, due to slide's decreased exposure latitude, more accurate colors and finer grain, the images produced aren't that much different to digital photos (at least, to my eye.)\n\nbut, despite all of that, i still see a lot of people using slide film, so i'm really curious what you think. with all of the downsides, what is it about slide film that makes you choose it over both digital and color negative film? is it the challenge? the physical product? some quality in the images that it produces?", "sortedWord": "None", "identifyer": 57639, "year": "2020"}, {"Unnamed: 0": 310834, "autor": "scottanooga", "date": 1578237021000, "content": "Developing Problems /!/ Any ideas what the issue is with these negatives?\n\n [https://imgur.com/a/PwcFVPn](https://imgur.com/a/PwcFVPn) \n\nThis is the first time I have encountered this and I'm kind of stumped. My last two rolls had these strange crescents and dark areas that I have not experienced before. Other rolls shot after these two rolls are fine, so I'm pretty sure its not a camera issue. These two rolls were shot weeks apart.\n\nYashica A\n\nFoma 200 and Ilford FP4+ 120 format\n\n1 Roll was stand developed for 2 hours using 5ml of Rodinal (agitated for 30 seconds at the beginning and again at 1 hour.) The other was Rodinal at 1+25 for 9 minutes, agitated every minute. Water stop bath and Kodafix fixer. \n\nI'm certain the last roll was on the reel properly, so I don't think that is the issue. I'm about to replace the fixer, but I would think bad fixer would affect the whole negative and not just spots. Any help?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eke4ue/developing_problems/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "developing problems /!/ any ideas what the issue is with these negatives?\n\n [https://imgur.com/a/pwcfvpn](https://imgur.com/a/pwcfvpn) \n\nthis is the first time i have encountered this and i'm kind of stumped. my last two rolls had these strange crescents and dark areas that i have not experienced before. other rolls shot after these two rolls are fine, so i'm pretty sure its not a camera issue. these two rolls were shot weeks apart.\n\nyashica a\n\nfoma 200 and ilford fp4+ 120 format\n\n1 roll was stand developed for 2 hours using 5ml of rodinal (agitated for 30 seconds at the beginning and again at 1 hour.) the other was rodinal at 1+25 for 9 minutes, agitated every minute. water stop bath and kodafix fixer. \n\ni'm certain the last roll was on the reel properly, so i don't think that is the issue. i'm about to replace the fixer, but i would think bad fixer would affect the whole negative and not just -----> spots !!! . any help?", "sortedWord": "None", "identifyer": 57855, "year": "2020"}, {"Unnamed: 0": 310881, "autor": "DNehru", "date": 1579724367000, "content": "as I was loading my mju ii I spotted some weird reflections on rear glass element. I’m trying to find out what’s that as I doubt it’s possible that this glass broke, maybe fungus? I don’t think that it shows on pictures.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eshisy/as_i_was_loading_my_mju_ii_i_spotted_some_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "as i was loading my mju ii i -----> spotted !!!  some weird reflections on rear glass element. i’m trying to find out what’s that as i doubt it’s possible that this glass broke, maybe fungus? i don’t think that it shows on pictures.", "sortedWord": "None", "identifyer": 57902, "year": "2020"}, {"Unnamed: 0": 310883, "autor": "DNehru", "date": 1579723307000, "content": "As i was loading my mju ii I spotted some weird reflections that looked like broken glass, could it be broken lens element? Can’t imagine how you could break this lens part as it sits deep inside. Images taken by this camera don’t show anything abnormal.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/esh9jd/as_i_was_loading_my_mju_ii_i_spotted_some_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "as i was loading my mju ii i -----> spotted !!!  some weird reflections that looked like broken glass, could it be broken lens element? can’t imagine how you could break this lens part as it sits deep inside. images taken by this camera don’t show anything abnormal.", "sortedWord": "None", "identifyer": 57904, "year": "2020"}, {"Unnamed: 0": 310910, "autor": "grades84", "date": 1579667050000, "content": "Please help me fix the light meter on my Pentax Spotmatic F! /!/ I recently purchased my very first film camera, a Pentax Spotmatic F. After opening the package up like a giddy schoolboy and attaching a lens, I noticed that the needle for exposure just sits in the same spot (just below the + symbol), regardless of where I aim the camera. I can't contact the seller so unfortunately I have to work it out myself now.\n\nI am using a brand new LR9 1.5V battery, which should work as far as I can tell... I have checked the meter using the bulb/iso100 setting, but the needle doesn't change from the description above. Attached is a Helios 58mm f2 lens.\n\nI'm a complete noob at this so any advice for what else to check (if anything) before trudging off to a repair place would be much appreciated. Information on the light meter/viewfinder seems a bit scant online so I could easily have missed something simple.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/es6rvz/please_help_me_fix_the_light_meter_on_my_pentax/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "please help me fix the light meter on my pentax spotmatic f! /!/ i recently purchased my very first film camera, a pentax spotmatic f. after opening the package up like a giddy schoolboy and attaching a lens, i noticed that the needle for exposure just sits in the same -----> spot !!!  (just below the + symbol), regardless of where i aim the camera. i can't contact the seller so unfortunately i have to work it out myself now.\n\ni am using a brand new lr9 1.5v battery, which should work as far as i can tell... i have checked the meter using the bulb/iso100 setting, but the needle doesn't change from the description above. attached is a helios 58mm f2 lens.\n\ni'm a complete noob at this so any advice for what else to check (if anything) before trudging off to a repair place would be much appreciated. information on the light meter/viewfinder seems a bit scant online so i could easily have missed something simple.", "sortedWord": "None", "identifyer": 57931, "year": "2020"}, {"Unnamed: 0": 310912, "autor": "httpslimon", "date": 1579663283000, "content": "White dots on film /!/ This was my first time shooting color film after shooting B&amp;W film, I never had this problem but after I got my film back from being developed the emulsion side of the film has a bunch of white spots in a pattern and this shows up on two whole rolls of portra 400. on every image it shows as black dots. any idea why and how this happened. this is really annoying especially since alot of the shots I got were in my opinion good. here is an example.\n\nhttps://preview.redd.it/y8w84kad09c41.jpg?width=2794&amp;format=pjpg&amp;auto=webp&amp;s=144265ab3d5840a570b323bdef657bd1ae7309c8", "link": "https://www.reddit.com/r/AnalogCommunity/comments/es61zg/white_dots_on_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "white dots on film /!/ this was my first time shooting color film after shooting b&amp;w film, i never had this problem but after i got my film back from being developed the emulsion side of the film has a bunch of white -----> spots !!!  in a pattern and this shows up on two whole rolls of portra 400. on every image it shows as black dots. any idea why and how this happened. this is really annoying especially since alot of the shots i got were in my opinion good. here is an example.\n\nhttps://preview.redd.it/y8w84kad09c41.jpg?width=2794&amp;format=pjpg&amp;auto=webp&amp;s=144265ab3d5840a570b323bdef657bd1ae7309c8", "sortedWord": "None", "identifyer": 57933, "year": "2020"}, {"Unnamed: 0": 310916, "autor": "Thefucklest", "date": 1579653514000, "content": "Why does this happen with the color, and why does the white spot keep appearing in the corner? any info is greatly appreciated!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/es410k/why_does_this_happen_with_the_color_and_why_does/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why does this happen with the color, and why does the white -----> spot !!!  keep appearing in the corner? any info is greatly appreciated!", "sortedWord": "None", "identifyer": 57937, "year": "2020"}, {"Unnamed: 0": 311242, "autor": "swb311", "date": 1580256322000, "content": "I spotted a Beseler Negatrans at Don's in Dallas and immediately decided I needed to do this.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/evecks/i_spotted_a_beseler_negatrans_at_dons_in_dallas/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i -----> spotted !!!  a beseler negatrans at don's in dallas and immediately decided i needed to do this.", "sortedWord": "None", "identifyer": 58275, "year": "2020"}, {"Unnamed: 0": 311297, "autor": "eyeofthecodger", "date": 1580064380000, "content": "How to clean internal lens elements? /!/ I have a Nikkor 50mm pancake lens that I bought cheap because the aperture blades were oily.  I have successfully cleaned the blades (thanks to all those kind folks posting directions) but noticed that some of the lens elements also had oil spots on them.  I have tried various combinations of alcohol, lens cleaner, pec pads, clean cotton cloths, microfiber cloths and no matter what I do, they still end up with a streaky, cloudy surface.  It's hard to see, it has to be in the right light, but it's there.  Any suggestions?  Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/euas1x/how_to_clean_internal_lens_elements/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how to clean internal lens elements? /!/ i have a nikkor 50mm pancake lens that i bought cheap because the aperture blades were oily.  i have successfully cleaned the blades (thanks to all those kind folks posting directions) but noticed that some of the lens elements also had oil -----> spots !!!  on them.  i have tried various combinations of alcohol, lens cleaner, pec pads, clean cotton cloths, microfiber cloths and no matter what i do, they still end up with a streaky, cloudy surface.  it's hard to see, it has to be in the right light, but it's there.  any suggestions?  thanks!", "sortedWord": "None", "identifyer": 58332, "year": "2020"}, {"Unnamed: 0": 311319, "autor": "vurt", "date": 1580009368000, "content": "Question about spots on negatives /!/ Hi everyone,\n\nI've started developing at home, and I am getting spots on my negatives. They appear dark on the negative, bright on the positive scan.\n\nExamples: https://imgur.com/a/oOMVEAa\n\nThey are consistently on every roll I have developed, no matter the film stock. I have only used Ilfosol 3 in a Patterson 500ml tank.\n\nI tap the tank firmly after agitation, so I do not believe these are air bubbles. They are consistently on the right or left edge of the frame, but not consistent as far as which frames they appear on.\n\nI'm at a loss - hoping someone can provide some help. I am also cross-posting to /r/Darkroom.\n\nThank you all!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eu1g6f/question_about_spots_on_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "question about -----> spots !!!  on negatives /!/ hi everyone,\n\ni've started developing at home, and i am getting spots on my negatives. they appear dark on the negative, bright on the positive scan.\n\nexamples: https://imgur.com/a/oomveaa\n\nthey are consistently on every roll i have developed, no matter the film stock. i have only used ilfosol 3 in a patterson 500ml tank.\n\ni tap the tank firmly after agitation, so i do not believe these are air bubbles. they are consistently on the right or left edge of the frame, but not consistent as far as which frames they appear on.\n\ni'm at a loss - hoping someone can provide some help. i am also cross-posting to /r/darkroom.\n\nthank you all!", "sortedWord": "None", "identifyer": 58355, "year": "2020"}, {"Unnamed: 0": 311370, "autor": "SolngAndThnx4thefish", "date": 1608213136000, "content": "Are these filters any good? /!/ Hey all, i wanted to know if the following filters are any good and worth buying?\n\nHoya Linear Motion\nHoya Soft Spot\nHoya Nebula\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kext92/are_these_filters_any_good/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "are these filters any good? /!/ hey all, i wanted to know if the following filters are any good and worth buying?\n\nhoya linear motion\nhoya soft -----> spot !!! \nhoya nebula\n\nthanks!", "sortedWord": "None", "identifyer": 58406, "year": "2020"}, {"Unnamed: 0": 311411, "autor": "Completlol", "date": 1608147052000, "content": "Hello, I took these on my Yashica Mat. This is my second roll of film and there are these vertical lines in the same spot in every image. The previous roll didn’t have these lines and I’m really confused, is this a camera issue? Please help, I am new to using this camera.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/keg0q9/hello_i_took_these_on_my_yashica_mat_this_is_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hello, i took these on my yashica mat. this is my second roll of film and there are these vertical lines in the same -----> spot !!!  in every image. the previous roll didn’t have these lines and i’m really confused, is this a camera issue? please help, i am new to using this camera.", "sortedWord": "None", "identifyer": 58447, "year": "2020"}, {"Unnamed: 0": 311465, "autor": "Seanzzxx", "date": 1585134444000, "content": "What are these spots? Bad developing? User error? This was sent to a lab, so I am kinda pissed to get it back like this. /!/ &amp;#x200B;\n\nhttps://preview.redd.it/3kesh42wwso41.jpg?width=3302&amp;format=pjpg&amp;auto=webp&amp;s=1cce1a4fbddbbd4b44492afcae4b2ad58d1a509f\n\nhttps://preview.redd.it/aizkb4buwso41.jpg?width=3262&amp;format=pjpg&amp;auto=webp&amp;s=1455bbd448ecb6e38259f055d1852521228600c7", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fooh4g/what_are_these_spots_bad_developing_user_error/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!! ? bad developing? user error? this was sent to a lab, so i am kinda pissed to get it back like this. /!/ &amp;#x200b;\n\nhttps://preview.redd.it/3kesh42wwso41.jpg?width=3302&amp;format=pjpg&amp;auto=webp&amp;s=1cce1a4fbddbbd4b44492afcae4b2ad58d1a509f\n\nhttps://preview.redd.it/aizkb4buwso41.jpg?width=3262&amp;format=pjpg&amp;auto=webp&amp;s=1455bbd448ecb6e38259f055d1852521228600c7", "sortedWord": "None", "identifyer": 58502, "year": "2020"}, {"Unnamed: 0": 311535, "autor": "SubPop120", "date": 1606795667000, "content": "Question: Any idea why this is happening? Light and dark spots has plagued my home dev for my past two Portra rolls in my Olympus XA2. Admittedly, I did accidentally get the smallest amount of blix in my stabilizer. I haven't developed rolls from another camera and am using the Cinestill C-41 kit.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k4da0m/question_any_idea_why_this_is_happening_light_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "question: any idea why this is happening? light and dark -----> spots !!!  has plagued my home dev for my past two portra rolls in my olympus xa2. admittedly, i did accidentally get the smallest amount of blix in my stabilizer. i haven't developed rolls from another camera and am using the cinestill c-41 kit.", "sortedWord": "None", "identifyer": 58572, "year": "2020"}, {"Unnamed: 0": 311599, "autor": "DanielAdamSoliz", "date": 1606689947000, "content": "Any recommendations for a spot meter? /!/ So I got a medium format camera and it does not have a built in light meter, I’m looking to do more landscapes and the occasional portrait session, thank you to all who reply!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k3j5j4/any_recommendations_for_a_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any recommendations for a -----> spot !!!  meter? /!/ so i got a medium format camera and it does not have a built in light meter, i’m looking to do more landscapes and the occasional portrait session, thank you to all who reply!", "sortedWord": "None", "identifyer": 58636, "year": "2020"}, {"Unnamed: 0": 311675, "autor": "imp0ssibles0ul", "date": 1584543631000, "content": "I started developing at home and the last roll I developed has some weird black spots on it... Cleaned my film so I know that it is not dust on the scan... These spots are on half of the scans. Any insight would be great!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fkquvz/i_started_developing_at_home_and_the_last_roll_i/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i started developing at home and the last roll i developed has some weird black -----> spots !!!  on it... cleaned my film so i know that it is not dust on the scan... these spots are on half of the scans. any insight would be great!", "sortedWord": "None", "identifyer": 58714, "year": "2020"}, {"Unnamed: 0": 311684, "autor": "AwkwardBug", "date": 1584501166000, "content": "Could anyone explain to me why I have these weird dark spots on the top of my scan? It's on 2 other images but the rest seem fine.. (Pentax 6x7 105mm f2.4)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fkipkd/could_anyone_explain_to_me_why_i_have_these_weird/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "could anyone explain to me why i have these weird dark -----> spots !!!  on the top of my scan? it's on 2 other images but the rest seem fine.. (pentax 6x7 105mm f2.4)", "sortedWord": "None", "identifyer": 58723, "year": "2020"}, {"Unnamed: 0": 311812, "autor": "MadDogBTTF", "date": 1607301048000, "content": "Best spot in Toronto to get your film negatives scanned? /!/ I know framediscreet is the best for 100' or more rolls of film.  \n\nBut what's the best spot for scanning old 8mm, 16mm, and 35mm negative strips and rolls?  I want the best quality possible.\n\nIs it Downtown camera?\n\nAlso if they're over 30 years old will the color have degraded by now?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k85qrv/best_spot_in_toronto_to_get_your_film_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "best -----> spot !!!  in toronto to get your film negatives scanned? /!/ i know framediscreet is the best for 100' or more rolls of film.  \n\nbut what's the best spot for scanning old 8mm, 16mm, and 35mm negative strips and rolls?  i want the best quality possible.\n\nis it downtown camera?\n\nalso if they're over 30 years old will the color have degraded by now?", "sortedWord": "None", "identifyer": 58857, "year": "2020"}, {"Unnamed: 0": 311844, "autor": "sarkastikcontender", "date": 1602118433000, "content": "Metering at night with an incident meter? /!/ I want to dabble more with shooting at night and don't want to dive head first into buying a spot meter (because they are typically very pricey) so I was hoping to get by with my incident meter. It's a Minolta Auto Meter IIIF. If I were to try to use this, should I try to go to my subject and meter there, or meter from the camera itself? Should I use it with the lumisphere on or off? Or should I scrap using the meter entirely and just bring along a SLR that has an in camera meter to use that? The camera I will be using does not have a meter, but I could bring along an AE-1 or something to use as a sort of a spot meter. Any insight would be appreciated : )", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j73b7o/metering_at_night_with_an_incident_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "metering at night with an incident meter? /!/ i want to dabble more with shooting at night and don't want to dive head first into buying a -----> spot !!!  meter (because they are typically very pricey) so i was hoping to get by with my incident meter. it's a minolta auto meter iiif. if i were to try to use this, should i try to go to my subject and meter there, or meter from the camera itself? should i use it with the lumisphere on or off? or should i scrap using the meter entirely and just bring along a slr that has an in camera meter to use that? the camera i will be using does not have a meter, but i could bring along an ae-1 or something to use as a sort of a spot meter. any insight would be appreciated : )", "sortedWord": "None", "identifyer": 58890, "year": "2020"}, {"Unnamed: 0": 311902, "autor": "highpilerug", "date": 1602003376000, "content": "Anyone know what's causing these dark stripes to appear in my images? /!/ [examples](https://imgur.com/a/DIdYdkr)\n\nI flipped the images to show how it appears in the same spot consistently (upper, horizontal 3rd of the frame). Is it a film transport issue? I was thinking the film might be getting creased or scored on something when the film is wound, but otherwise I'm not sure. \n\nThe camera is a Fujica AX-5 that I bought used. Sometimes the stripe appears and sometimes it doesn't; I noticed that it's more accentuated in underexposed pictures. I've gotten it on multiple rolls of film, but only with that camera.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/j68qqa/anyone_know_whats_causing_these_dark_stripes_to/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anyone know what's causing these dark stripes to appear in my images? /!/ [examples](https://imgur.com/a/didydkr)\n\ni flipped the images to show how it appears in the same -----> spot !!!  consistently (upper, horizontal 3rd of the frame). is it a film transport issue? i was thinking the film might be getting creased or scored on something when the film is wound, but otherwise i'm not sure. \n\nthe camera is a fujica ax-5 that i bought used. sometimes the stripe appears and sometimes it doesn't; i noticed that it's more accentuated in underexposed pictures. i've gotten it on multiple rolls of film, but only with that camera.", "sortedWord": "None", "identifyer": 58949, "year": "2020"}, {"Unnamed: 0": 311960, "autor": "StunningYogurtcloset", "date": 1594495592000, "content": "Canon F-1 Light Meter Issue /!/ Hi all, so I've had an old style Canon F-1 for about a year now and haven't had any problems with the light meter...until now. I've been without batteries for a few months and I got new ones today. I use a [Wein Cell 1.3v battery](https://www.adorama.com/bypx625w.html?gclid=CjwKCAjwxqX4BRBhEiwAYtJX7dyIm-yz3Bo0vLdQgMF7UUV5K5L-E_2HV9Flg7UA67jviDpESemobxoCr8EQAvD_BwE&amp;utm_source=adl-gbase-hometech) and the meter has always read spot on. Now, even with a fresh battery, the meter isn't reading properly. It's wildly overexposing the film when compared to a light meter app (I use Spotmatic). Is this a sign that it needs servicing or could it be that the light meter is kicking the bucket and I should start looking for a handheld light meter?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hpg0ht/canon_f1_light_meter_issue/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "canon f-1 light meter issue /!/ hi all, so i've had an old style canon f-1 for about a year now and haven't had any problems with the light meter...until now. i've been without batteries for a few months and i got new ones today. i use a [wein cell 1.3v battery](https://www.adorama.com/bypx625w.html?gclid=cjwkcajwxqx4brbheiwaytjx7dyim-yz3bo0vldqgmf7uuv5k5l-e_2hv9flg7ua67jvidpesemobxocr8eqavd_bwe&amp;utm_source=adl-gbase-hometech) and the meter has always read -----> spot !!!  on. now, even with a fresh battery, the meter isn't reading properly. it's wildly overexposing the film when compared to a light meter app (i use spotmatic). is this a sign that it needs servicing or could it be that the light meter is kicking the bucket and i should start looking for a handheld light meter?", "sortedWord": "None", "identifyer": 59008, "year": "2020"}, {"Unnamed: 0": 312041, "autor": "carl0071", "date": 1593863789000, "content": "What is the optimum resolution for scanning 35mm colour negatives? /!/ I have an Epson Perfection V370 scanner, and I can scan up to 6400dpi but not only does it take a long time but the file sizes are huge (&gt;300mb per image).\n\nIs there a sweet spot between the best resolution and sensible file sizes?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hl266g/what_is_the_optimum_resolution_for_scanning_35mm/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what is the optimum resolution for scanning 35mm colour negatives? /!/ i have an epson perfection v370 scanner, and i can scan up to 6400dpi but not only does it take a long time but the file sizes are huge (&gt;300mb per image).\n\nis there a sweet -----> spot !!!  between the best resolution and sensible file sizes?", "sortedWord": "None", "identifyer": 59091, "year": "2020"}, {"Unnamed: 0": 312099, "autor": "CuplaRud", "date": 1593692992000, "content": "Can someone advise me on what is going on with my camera please? (New Member) /!/ Hi All.\n\nAs a new member, it's great to find this community. Hopefully this issue is an easy fix. \n\nCan someone identify the problem with my photos(linked below)? It's a light spot on the corner of multiple frames from different rolls.\n\nZenit 11, Helios 44-2 58mm. Kodak Gold \n\n [https://imgur.com/gallery/4EolfxF](https://imgur.com/gallery/4EolfxF)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hjw4fu/can_someone_advise_me_on_what_is_going_on_with_my/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone advise me on what is going on with my camera please? (new member) /!/ hi all.\n\nas a new member, it's great to find this community. hopefully this issue is an easy fix. \n\ncan someone identify the problem with my photos(linked below)? it's a light -----> spot !!!  on the corner of multiple frames from different rolls.\n\nzenit 11, helios 44-2 58mm. kodak gold \n\n [https://imgur.com/gallery/4eolfxf](https://imgur.com/gallery/4eolfxf)", "sortedWord": "None", "identifyer": 59150, "year": "2020"}, {"Unnamed: 0": 312102, "autor": "uaiududis", "date": 1593684802000, "content": "Lightme: a simple yet powerful Lightmeter app which is getting a slight UI refresh, some performance improvements and more films for reciprocity failure compensation. It includes a dedicated pinhole mode and advanced spot metering features. You can download it for FREE (link in the comments)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hjuewf/lightme_a_simple_yet_powerful_lightmeter_app/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lightme: a simple yet powerful lightmeter app which is getting a slight ui refresh, some performance improvements and more films for reciprocity failure compensation. it includes a dedicated pinhole mode and advanced -----> spot !!!  metering features. you can download it for free (link in the comments)", "sortedWord": "None", "identifyer": 59153, "year": "2020"}, {"Unnamed: 0": 312273, "autor": "lngoo", "date": 1600122479000, "content": "Is this uncovered spot normal? I have focus issues and this is the place the mirror rests.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/isvqap/is_this_uncovered_spot_normal_i_have_focus_issues/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is this uncovered -----> spot !!!  normal? i have focus issues and this is the place the mirror rests.", "sortedWord": "None", "identifyer": 59324, "year": "2020"}, {"Unnamed: 0": 312277, "autor": "DFJorquera", "date": 1600109649000, "content": "Shenanigans with dirty negatives from the lab and possible cleaning solutions /!/ Last week I picked up two rolls of film from two different labs, one was black and white and the other one was color negative. When I got home I realized that both were extremely dirty, full of water spots. \n\nI complained about the color negative right away (the black and white I realized at home) and they told me that it couldn't be that bad and that it wouldn't be visible on scans and/or prints. Sure enough, after wasting 2 hours scanning the whole roll, surprise - it was noticeable. I brought back the negatives and they told me they would try to clean them but they could not guarantee that it could get even worse. Those were 100% sure water marks, and after talking to the lab technician today again she told me that normally she would just rewash the film, but as they're a small lab inside a camera store they don't have a dust-free space to hang them to dry, and that she would rather leave them as they are. She did offer free Noritsu scans and said maybe the Digital ICE would take care of the most visible spots, which I doubt but we'll see when I get the scans.\n\nThe black and white roll, pictured here, is full of those little spots, literally across the whole roll through the middle of the stripes, as if there had been something dripping on it while it was moving through the machine at the lab or something, and on the first frames they're just everywhere. I thought those would be water spots too, but after having tried to clean them with pure isopropyl alcohol and *really* having gone hard on them, they just don't seem to disappear, not even a little bit. Does anybody know what those are, if maybe they're chemistry rests instead of water?\n\nI have tested this on the very first frame as well as on the unexposed part of the stripe before it and not only have the spots stayed in place, everywhere where I've wiped with a q-tip or a microfiber cloth (tried both) there are now smudges from the alcohol. From what I've read, isopropyl shouldn't leave any residues, specially at high percentages (I already had 70% at home and specifically bought the 99% at a pharmacy just for the negatives), so is there something that I'm doing wrong?\n\nAs I seem to not be having any luck with the cleaning, do you guys have any other tips on how to clean those negatives? I really don't want to spend hours in PS going through every single frame...\n\nhttps://preview.redd.it/1gphd4fyp5n51.jpg?width=1132&amp;format=pjpg&amp;auto=webp&amp;s=2aab6137a055f6007dad05d4f74280d9e6a7581b", "link": "https://www.reddit.com/r/AnalogCommunity/comments/isrcow/shenanigans_with_dirty_negatives_from_the_lab_and/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "shenanigans with dirty negatives from the lab and possible cleaning solutions /!/ last week i picked up two rolls of film from two different labs, one was black and white and the other one was color negative. when i got home i realized that both were extremely dirty, full of water -----> spots !!! . \n\ni complained about the color negative right away (the black and white i realized at home) and they told me that it couldn't be that bad and that it wouldn't be visible on scans and/or prints. sure enough, after wasting 2 hours scanning the whole roll, surprise - it was noticeable. i brought back the negatives and they told me they would try to clean them but they could not guarantee that it could get even worse. those were 100% sure water marks, and after talking to the lab technician today again she told me that normally she would just rewash the film, but as they're a small lab inside a camera store they don't have a dust-free space to hang them to dry, and that she would rather leave them as they are. she did offer free noritsu scans and said maybe the digital ice would take care of the most visible spots, which i doubt but we'll see when i get the scans.\n\nthe black and white roll, pictured here, is full of those little spots, literally across the whole roll through the middle of the stripes, as if there had been something dripping on it while it was moving through the machine at the lab or something, and on the first frames they're just everywhere. i thought those would be water spots too, but after having tried to clean them with pure isopropyl alcohol and *really* having gone hard on them, they just don't seem to disappear, not even a little bit. does anybody know what those are, if maybe they're chemistry rests instead of water?\n\ni have tested this on the very first frame as well as on the unexposed part of the stripe before it and not only have the spots stayed in place, everywhere where i've wiped with a q-tip or a microfiber cloth (tried both) there are now smudges from the alcohol. from what i've read, isopropyl shouldn't leave any residues, specially at high percentages (i already had 70% at home and specifically bought the 99% at a pharmacy just for the negatives), so is there something that i'm doing wrong?\n\nas i seem to not be having any luck with the cleaning, do you guys have any other tips on how to clean those negatives? i really don't want to spend hours in ps going through every single frame...\n\nhttps://preview.redd.it/1gphd4fyp5n51.jpg?width=1132&amp;format=pjpg&amp;auto=webp&amp;s=2aab6137a055f6007dad05d4f74280d9e6a7581b", "sortedWord": "None", "identifyer": 59328, "year": "2020"}, {"Unnamed: 0": 312422, "autor": "Mr_Drizz", "date": 1600514161000, "content": "Mini Review of the V-201X Hotshoe Light Meter /!/ This is just a short review of the V-201X Hotshoe light meter. I bought mine of off eBay for £50 and it took a couple of weeks to arrive.\n\n&amp;#x200B;\n\n[V-201X](https://preview.redd.it/y8balww683o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=ce910e6d48443748ad6de844b356e320598469af)\n\nSo the meter is pretty small, about 1\" L/W and about 1/2\" deep. Has a tiny display on the top, an on/off switch and charge port to the left and command/control lever to the right. Operation is very simple, although my unit came with no instruction, I soon figured it out. There are only 3 settings you can change.\n\n* ASA\n* F-Stop\n* Shutter Speed\n\nThis is done by clicking the control lever to select the mode then using the lever up/down to alter the value. The display is bright and auto powers off after a minute or so, great for saving the internal battery. A simple touch of the control lever awakens it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zx3g6rjf83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=0608ea8f619d6d25ca206db34dcc703aaa6d7c3d\n\nMetering seems pretty accurate, for what it is, I tested it against a Canon EOS 30 set on evaluative and a Fuji X-T3. All 3 reading where about the same with variations of about 1/3 to 1.2 a stop. Complex lighting confused the hell out of the V-201X which I would have expected. In complex lighting, you'll have to use your best judgment or a spot meter.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/77comp9i83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=8e83a31e591d753eaf31b8cb9cbb3a6ae328582f\n\nhttps://preview.redd.it/2jd7lv9i83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=06f37b553c29734263cd26fd3adfaf5c880888a9\n\nOverall I'm pretty happy with it, I bought the aluminium one but they do sell a 3D printer version for about £20 cheaper.\n\nIt would be nice the have the display on the back so it's easier to read while the camera is at eye level.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ivqpgl/mini_review_of_the_v201x_hotshoe_light_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mini review of the v-201x hotshoe light meter /!/ this is just a short review of the v-201x hotshoe light meter. i bought mine of off ebay for £50 and it took a couple of weeks to arrive.\n\n&amp;#x200b;\n\n[v-201x](https://preview.redd.it/y8balww683o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=ce910e6d48443748ad6de844b356e320598469af)\n\nso the meter is pretty small, about 1\" l/w and about 1/2\" deep. has a tiny display on the top, an on/off switch and charge port to the left and command/control lever to the right. operation is very simple, although my unit came with no instruction, i soon figured it out. there are only 3 settings you can change.\n\n* asa\n* f-stop\n* shutter speed\n\nthis is done by clicking the control lever to select the mode then using the lever up/down to alter the value. the display is bright and auto powers off after a minute or so, great for saving the internal battery. a simple touch of the control lever awakens it.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/zx3g6rjf83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=0608ea8f619d6d25ca206db34dcc703aaa6d7c3d\n\nmetering seems pretty accurate, for what it is, i tested it against a canon eos 30 set on evaluative and a fuji x-t3. all 3 reading where about the same with variations of about 1/3 to 1.2 a stop. complex lighting confused the hell out of the v-201x which i would have expected. in complex lighting, you'll have to use your best judgment or a -----> spot !!!  meter.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/77comp9i83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=8e83a31e591d753eaf31b8cb9cbb3a6ae328582f\n\nhttps://preview.redd.it/2jd7lv9i83o51.jpg?width=3456&amp;format=pjpg&amp;auto=webp&amp;s=06f37b553c29734263cd26fd3adfaf5c880888a9\n\noverall i'm pretty happy with it, i bought the aluminium one but they do sell a 3d printer version for about £20 cheaper.\n\nit would be nice the have the display on the back so it's easier to read while the camera is at eye level.", "sortedWord": "None", "identifyer": 59475, "year": "2020"}, {"Unnamed: 0": 312451, "autor": "Tylerolson0813", "date": 1590741953000, "content": "A little photoshop trick for 4x5 /!/ So a lot of people probably know/have this already but for those who don’t it’s game changing! I’m so proud of myself for thinking about it. I scan with a v600 so 4x5 need to be stitched. I just created an action for b&amp;w so I just highlight both halves of the negative and run it. It will auto align, auto blend, create my spotting layer named, invert, desaturate(I want b&amp;w not the warm tones that are natural) add curves and then set a rough black and white point. Now all I need to do is spot my negative and fix my curves. I’m waiting on some color negative 4x5 and I’ll make one for that too. It only saves 2 minutes, but if you’re scanning in 10 sheets that’s 20 minutes saved.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gsp6ys/a_little_photoshop_trick_for_4x5/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "a little photoshop trick for 4x5 /!/ so a lot of people probably know/have this already but for those who don’t it’s game changing! i’m so proud of myself for thinking about it. i scan with a v600 so 4x5 need to be stitched. i just created an action for b&amp;w so i just highlight both halves of the negative and run it. it will auto align, auto blend, create my -----> spotting !!!  layer named, invert, desaturate(i want b&amp;w not the warm tones that are natural) add curves and then set a rough black and white point. now all i need to do is spot my negative and fix my curves. i’m waiting on some color negative 4x5 and i’ll make one for that too. it only saves 2 minutes, but if you’re scanning in 10 sheets that’s 20 minutes saved.", "sortedWord": "None", "identifyer": 59504, "year": "2020"}, {"Unnamed: 0": 312511, "autor": "tnick771", "date": 1590620034000, "content": "Odd spot in Mamiya 6 light meter, what is this?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gru9xh/odd_spot_in_mamiya_6_light_meter_what_is_this/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "odd -----> spot !!!  in mamiya 6 light meter, what is this?", "sortedWord": "None", "identifyer": 59566, "year": "2020"}, {"Unnamed: 0": 312539, "autor": "Tylerolson0813", "date": 1590552773000, "content": "Lpt: check out your local film shops no matter what. /!/ So I’ve been shooting film regularly for a year and a half and I’ve always ordered film online, I figured like everything else it’s cheaper and it just shows up. Just this week my mom asked me to take my brothers graduation pictures on Thursday but my film won’t get here until Friday. I figured I’d go to my spot for local film in a hurry only to realize the 4x5 and some other stocks are $5-6 cheaper a pack, and no shipping cost. They don’t have everything, but they have almost all the film I use. Always be on the look out for a price drop and try to support local companies!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/grckd0/lpt_check_out_your_local_film_shops_no_matter_what/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lpt: check out your local film shops no matter what. /!/ so i’ve been shooting film regularly for a year and a half and i’ve always ordered film online, i figured like everything else it’s cheaper and it just shows up. just this week my mom asked me to take my brothers graduation pictures on thursday but my film won’t get here until friday. i figured i’d go to my -----> spot !!!  for local film in a hurry only to realize the 4x5 and some other stocks are $5-6 cheaper a pack, and no shipping cost. they don’t have everything, but they have almost all the film i use. always be on the look out for a price drop and try to support local companies!", "sortedWord": "None", "identifyer": 59594, "year": "2020"}, {"Unnamed: 0": 312550, "autor": "-epey", "date": 1604958961000, "content": "What are these spots on film? Second time this happened on 35mm but my 120 negatives are fine.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jr7dft/what_are_these_spots_on_film_second_time_this/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!!  on film? second time this happened on 35mm but my 120 negatives are fine.", "sortedWord": "None", "identifyer": 59605, "year": "2020"}, {"Unnamed: 0": 312563, "autor": "rjkst33", "date": 1604945692000, "content": "Any ideas if these are light leaks or something like shutter curtain advancement issues? Only occur on 1-2 frames per roll and in the exact same spot always. [Kiev 60]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jr2w4s/any_ideas_if_these_are_light_leaks_or_something/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any ideas if these are light leaks or something like shutter curtain advancement issues? only occur on 1-2 frames per roll and in the exact same -----> spot !!!  always. [kiev 60]", "sortedWord": "None", "identifyer": 59618, "year": "2020"}, {"Unnamed: 0": 312651, "autor": "Spukta", "date": 1591346413000, "content": "Focusing problems with Pentax M lenses on Vivitar body. /!/ Backstory (you can skip this): quite a while ago I got a Pentax ME Super, loved the camera and system, and invested into more lenses. The ME did my wrong tho and died, as I later found out, to be expected, nevertheless I thought I'd get another so I did. The one I got died too, the same day I got it, so money was refounded and as a final resort I got a Vivtar body, as it is the lenses that make pictures not the camera. I was using fast film, and stopping down the lenses quite a bit and had a good time. I recently switched to slower film and it got overcast more often so I started shooting wide open. \n\nThe main part of the story: even at f4 I sometimes noticed wonky stuff, like being just slightly out of focus on subjects - 2-3m away but the large DOF kinda covered that. When I started shooting f1.4 again this got a whole lot worse. This was about week and a half ago. Yesterday I shot a test roll just got the scans and it's confirmed. \n\nThe problem: I have shot many different cameras and been shooting film exclusively (almost) for close to two years, so I know how to focus. But the focus with my Vivatar V2000 always seems to be a bit back  of where camera said it would be. Lets say I focus on the eye and depending on how far I was from model it's either hair in focus and neck or a shrub behind them. When I focus right before infinity and camera shows it's spot on the actual focus is to infinity and at f1.4 the thing J tried to focus on is quite soft(but just a few metres back it's sharp) also interesting is the fact that a Helios 44-2 with a cheap adapter doesn't do this. (https://imgur.com/a/bDfJfyg here is a sample of what I said. I focused on her eye, I always do) \n\nQuestion: how can this be, I haven't noticed anything like that on the Pentax bodies I had so i'm guessing it should be the lenses? (50mm f1.4, 100 2.8, 40 2.8) Would there be a proper way to check if something isn't right? Can this be fixed? Do I need a new camera(in which case does anyone sell an MX)?\n\nSorry for the long text I felt like I have to explain. \nEagerly waiting for your answers, thank you in advance!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gx0sto/focusing_problems_with_pentax_m_lenses_on_vivitar/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "focusing problems with pentax m lenses on vivitar body. /!/ backstory (you can skip this): quite a while ago i got a pentax me super, loved the camera and system, and invested into more lenses. the me did my wrong tho and died, as i later found out, to be expected, nevertheless i thought i'd get another so i did. the one i got died too, the same day i got it, so money was refounded and as a final resort i got a vivtar body, as it is the lenses that make pictures not the camera. i was using fast film, and stopping down the lenses quite a bit and had a good time. i recently switched to slower film and it got overcast more often so i started shooting wide open. \n\nthe main part of the story: even at f4 i sometimes noticed wonky stuff, like being just slightly out of focus on subjects - 2-3m away but the large dof kinda covered that. when i started shooting f1.4 again this got a whole lot worse. this was about week and a half ago. yesterday i shot a test roll just got the scans and it's confirmed. \n\nthe problem: i have shot many different cameras and been shooting film exclusively (almost) for close to two years, so i know how to focus. but the focus with my vivatar v2000 always seems to be a bit back  of where camera said it would be. lets say i focus on the eye and depending on how far i was from model it's either hair in focus and neck or a shrub behind them. when i focus right before infinity and camera shows it's -----> spot !!!  on the actual focus is to infinity and at f1.4 the thing j tried to focus on is quite soft(but just a few metres back it's sharp) also interesting is the fact that a helios 44-2 with a cheap adapter doesn't do this. (https://imgur.com/a/bdfjfyg here is a sample of what i said. i focused on her eye, i always do) \n\nquestion: how can this be, i haven't noticed anything like that on the pentax bodies i had so i'm guessing it should be the lenses? (50mm f1.4, 100 2.8, 40 2.8) would there be a proper way to check if something isn't right? can this be fixed? do i need a new camera(in which case does anyone sell an mx)?\n\nsorry for the long text i felt like i have to explain. \neagerly waiting for your answers, thank you in advance!", "sortedWord": "None", "identifyer": 59709, "year": "2020"}, {"Unnamed: 0": 312794, "autor": "HylianSavior", "date": 1586558065000, "content": "How to open up Olympus 35 RC lens rear assembly /!/ I recently bought my first film camera: an Olympus 35 RC, and I noticed a pink, shiny spot inside the lens. \n\nI managed to open it up to clean, and the entire lens assembly is held in a single machined piece, with rings to retain the lens elements screwed on both top on bottom. I was able to use pliers to unscrew the top, but the bottom ring is recessed, and there isn't much surface area to grip. Unfortunately, the spot is between the back two lenses, so I wasn't able to clean it.\n\nAnyone have any tips for a tool to get enough grip to open it up?\n\nThanks!\n\nHere are some pictures:\n\nhttps://preview.redd.it/uqulhfxnh2s41.jpg?width=825&amp;format=pjpg&amp;auto=webp&amp;s=d46b7b22d13f437534a7986f69b9122eaf91f27d\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0dsc28t1i2s41.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=960a58acca24f917457eb12ecd91e6bc6823801b", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fyqjhp/how_to_open_up_olympus_35_rc_lens_rear_assembly/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how to open up olympus 35 rc lens rear assembly /!/ i recently bought my first film camera: an olympus 35 rc, and i noticed a pink, shiny -----> spot !!!  inside the lens. \n\ni managed to open it up to clean, and the entire lens assembly is held in a single machined piece, with rings to retain the lens elements screwed on both top on bottom. i was able to use pliers to unscrew the top, but the bottom ring is recessed, and there isn't much surface area to grip. unfortunately, the spot is between the back two lenses, so i wasn't able to clean it.\n\nanyone have any tips for a tool to get enough grip to open it up?\n\nthanks!\n\nhere are some pictures:\n\nhttps://preview.redd.it/uqulhfxnh2s41.jpg?width=825&amp;format=pjpg&amp;auto=webp&amp;s=d46b7b22d13f437534a7986f69b9122eaf91f27d\n\n&amp;#x200b;\n\nhttps://preview.redd.it/0dsc28t1i2s41.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=960a58acca24f917457eb12ecd91e6bc6823801b", "sortedWord": "None", "identifyer": 59856, "year": "2020"}, {"Unnamed: 0": 312856, "autor": "Harujii", "date": 1586089904000, "content": "Brown spots all over my photo. Not sure what they are /!/ I just got my film back from a new lab and [this](https://ibb.co/t2Px5RL) is the result. The film was Maco TCS Eagle 400, expired bulk load surveillance film from Taiwan (or at least that's what was advertised. If anyone has more info about this film I'd appreciate it). I suspect the spots to be some sort of fungus but would love to know what exactly they are. Thanks a ton!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fvd302/brown_spots_all_over_my_photo_not_sure_what_they/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "brown -----> spots !!!  all over my photo. not sure what they are /!/ i just got my film back from a new lab and [this](https://ibb.co/t2px5rl) is the result. the film was maco tcs eagle 400, expired bulk load surveillance film from taiwan (or at least that's what was advertised. if anyone has more info about this film i'd appreciate it). i suspect the spots to be some sort of fungus but would love to know what exactly they are. thanks a ton!", "sortedWord": "None", "identifyer": 59919, "year": "2020"}, {"Unnamed: 0": 312857, "autor": "Harujii", "date": 1586089470000, "content": "What could these brown spots be?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fvd03j/what_could_these_brown_spots_be/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what could these brown -----> spots !!!  be?", "sortedWord": "None", "identifyer": 59920, "year": "2020"}, {"Unnamed: 0": 312876, "autor": "jaydee066", "date": 1586010276000, "content": "Mamiya RB67 Pro S | 127mm 3.8 | Polaroid i-type | I don't know what the blue/purple glint is, it's been showing up in most of my pictures. I'm still trying to figure out if it is the lens. If you have any suggestions I'm open to them! It's in the exact same spot with varying intensity.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fuuj5c/mamiya_rb67_pro_s_127mm_38_polaroid_itype_i_dont/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mamiya rb67 pro s | 127mm 3.8 | polaroid i-type | i don't know what the blue/purple glint is, it's been showing up in most of my pictures. i'm still trying to figure out if it is the lens. if you have any suggestions i'm open to them! it's in the exact same -----> spot !!!  with varying intensity.", "sortedWord": "None", "identifyer": 59939, "year": "2020"}, {"Unnamed: 0": 312919, "autor": "filmnoob221", "date": 1585895895000, "content": "Film has blank spots?? Help! Shooting on Nishika N9000", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fu3cvu/film_has_blank_spots_help_shooting_on_nishika/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "film has blank -----> spots !!! ?? help! shooting on nishika n9000", "sortedWord": "None", "identifyer": 59983, "year": "2020"}, {"Unnamed: 0": 313070, "autor": "mjibs", "date": 1587783650000, "content": "Found a brand new, in box Olympus Infinity Stylus Epic in my basement, originally belonged to my grandma and has apparently been in my basement for over 20 years without me ever spotting it.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g7m9lr/found_a_brand_new_in_box_olympus_infinity_stylus/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "found a brand new, in box olympus infinity stylus epic in my basement, originally belonged to my grandma and has apparently been in my basement for over 20 years without me ever -----> spotting !!!  it.", "sortedWord": "None", "identifyer": 60136, "year": "2020"}, {"Unnamed: 0": 313090, "autor": "uetayutaka", "date": 1587731522000, "content": "What are these white spots?? On the negative there were a lot of these white sports on the end of the role. I am currently using a Leica m6 and this was shot on portra 400 with a very low shutter speed (1-4 sec). I hope someone can help me out😔", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g77jx0/what_are_these_white_spots_on_the_negative_there/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these white -----> spots !!! ?? on the negative there were a lot of these white sports on the end of the role. i am currently using a leica m6 and this was shot on portra 400 with a very low shutter speed (1-4 sec). i hope someone can help me out😔", "sortedWord": "None", "identifyer": 60156, "year": "2020"}, {"Unnamed: 0": 313094, "autor": "tuffghostal", "date": 1587698812000, "content": "Help with black spots/artifacts in shadows?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g7124t/help_with_black_spotsartifacts_in_shadows/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help with black -----> spots !!! /artifacts in shadows?", "sortedWord": "None", "identifyer": 60162, "year": "2020"}, {"Unnamed: 0": 313290, "autor": "EliPant", "date": 1605251951000, "content": "Sekonic spot meters. /!/ Hello everyone. Just wondering if anyone here has used/is using Sekonic spot meters? I’m currently searching for one. So far I have my eye on either the L-558, L-608, and the L-508. Any feedback about these specific meters or any other good alternative would be appreciated. Thanks.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/jtcsc9/sekonic_spot_meters/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sekonic -----> spot !!!  meters. /!/ hello everyone. just wondering if anyone here has used/is using sekonic spot meters? i’m currently searching for one. so far i have my eye on either the l-558, l-608, and the l-508. any feedback about these specific meters or any other good alternative would be appreciated. thanks.", "sortedWord": "None", "identifyer": 60362, "year": "2020"}, {"Unnamed: 0": 313656, "autor": "Slotographer", "date": 1598510575000, "content": "Inheritance project - Tomb of Rossmanite /!/ Hi everyone!  \n\n\nA little update before I jump into the photograph that I made for the inheritance project.  \n\n\nAlmost two months have passed since my previous post and there's been a couple of great advancements in my project and the gear that I acquired for my needs.   \n\n\nI've been doing some shoots unrelated to my project and found out that my camera has a light leak where the bellows meet the body so I did what every reasonable photographer would do...... I epoxied that seem together. Not the most classy thing but hey it worked out.  \n\n\n[Light leak before fixing the camera](https://preview.redd.it/qew7jva4nhj51.jpg?width=1218&amp;format=pjpg&amp;auto=webp&amp;s=622c73612a499a53ebdacee5fbe3aa5abed5155c)\n\nThe two pieces of gear are a pretty big deal for me since I rarely spend so much on gear.  \nI bought a Gossen profisix light meter with a spot meter attachment so that I can finally get rid of my DSLR that I used for metering my scenes. The second piece of gear is my new scanner that is in a year or two gonna be my escape from my daytime job.  \n\n\nPresenting Fujifilm Finescan 2750:\n\nhttps://preview.redd.it/t7g4m1c7ohj51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=44e8f37d4b70cf594c1e5bb6c3934468d96ee1cd\n\nThis is a A3 negative scanner that supposedly outperforms certain drumscanners, we'll see about that. Currently waiting for a SCSI PCI card to connect this beast to a vintage G5 powermac.  \n\n\nNow onto the photograph that I made for my project - Tomb of Rossmanite.  \n\n\n[Tomb of Rossmanite](https://preview.redd.it/9jgewn07qhj51.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=38c53c2b94f1c7a2b1b4262ce3e2e2a6e0ee217b)\n\nThis is a abandoned supposedly never used tomb in my hometown. It's located in woods near the castle where the intended deceased lived. The tomb is missing its roof and the side walls have been sadly vandalised but luckily the front of the building which is most interesting is left untouched by man.  \n\n\nOn its left side of the front we have a stone emblem of mother Mary who looks up to our right side where Jesus is on the cross. His torso is dressed by Ivy and his belly is torn apart looking like his intestines are being exposed. This remind me of the Mythos about Prometheus who had his livered eaten by an eagle each day and had them regrown till the next morning.  \n\n\nFor a contrast to the old, destroyed, rough building I added a female body into the entrance which adds some softness and hopefully ties everything up into something that looks a bit post-apocalyptic return into the nature that reclaimed the area.  \n\n\nSettings for this photograph were:   \n4x5 Kodak T-max ISO 100 pushed to ISO 800, Zeiss Tessar 135mm f/4.7 f/18 1/10s\n\nDeveloped with Microphen 1+1 at 21°C for 14 minutes and 45s.  \n\n\nThanks for reading and hopefully my next post is gonna be a little bit faster than this time", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ihg5uv/inheritance_project_tomb_of_rossmanite/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "inheritance project - tomb of rossmanite /!/ hi everyone!  \n\n\na little update before i jump into the photograph that i made for the inheritance project.  \n\n\nalmost two months have passed since my previous post and there's been a couple of great advancements in my project and the gear that i acquired for my needs.   \n\n\ni've been doing some shoots unrelated to my project and found out that my camera has a light leak where the bellows meet the body so i did what every reasonable photographer would do...... i epoxied that seem together. not the most classy thing but hey it worked out.  \n\n\n[light leak before fixing the camera](https://preview.redd.it/qew7jva4nhj51.jpg?width=1218&amp;format=pjpg&amp;auto=webp&amp;s=622c73612a499a53ebdacee5fbe3aa5abed5155c)\n\nthe two pieces of gear are a pretty big deal for me since i rarely spend so much on gear.  \ni bought a gossen profisix light meter with a -----> spot !!!  meter attachment so that i can finally get rid of my dslr that i used for metering my scenes. the second piece of gear is my new scanner that is in a year or two gonna be my escape from my daytime job.  \n\n\npresenting fujifilm finescan 2750:\n\nhttps://preview.redd.it/t7g4m1c7ohj51.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=44e8f37d4b70cf594c1e5bb6c3934468d96ee1cd\n\nthis is a a3 negative scanner that supposedly outperforms certain drumscanners, we'll see about that. currently waiting for a scsi pci card to connect this beast to a vintage g5 powermac.  \n\n\nnow onto the photograph that i made for my project - tomb of rossmanite.  \n\n\n[tomb of rossmanite](https://preview.redd.it/9jgewn07qhj51.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=38c53c2b94f1c7a2b1b4262ce3e2e2a6e0ee217b)\n\nthis is a abandoned supposedly never used tomb in my hometown. it's located in woods near the castle where the intended deceased lived. the tomb is missing its roof and the side walls have been sadly vandalised but luckily the front of the building which is most interesting is left untouched by man.  \n\n\non its left side of the front we have a stone emblem of mother mary who looks up to our right side where jesus is on the cross. his torso is dressed by ivy and his belly is torn apart looking like his intestines are being exposed. this remind me of the mythos about prometheus who had his livered eaten by an eagle each day and had them regrown till the next morning.  \n\n\nfor a contrast to the old, destroyed, rough building i added a female body into the entrance which adds some softness and hopefully ties everything up into something that looks a bit post-apocalyptic return into the nature that reclaimed the area.  \n\n\nsettings for this photograph were:   \n4x5 kodak t-max iso 100 pushed to iso 800, zeiss tessar 135mm f/4.7 f/18 1/10s\n\ndeveloped with microphen 1+1 at 21°c for 14 minutes and 45s.  \n\n\nthanks for reading and hopefully my next post is gonna be a little bit faster than this time", "sortedWord": "None", "identifyer": 60732, "year": "2020"}, {"Unnamed: 0": 313679, "autor": "s2koalabear", "date": 1598448331000, "content": "Slide projector lamp globe replacement, help! /!/ Hi please help. I bought a vintage Petri Spot Slide projector which is firstly, missing a piece (that the slides go into) and the globe needs to be replaced. The globe is very specialised and I can't seem to find any to buy online. I'm based in Australia. The markings on the globe read SYLVANIA SYL-21 250V 100W. Does anyone know an equivalent to this, or knows where to source one?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/igyrh4/slide_projector_lamp_globe_replacement_help/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "slide projector lamp globe replacement, help! /!/ hi please help. i bought a vintage petri -----> spot !!!  slide projector which is firstly, missing a piece (that the slides go into) and the globe needs to be replaced. the globe is very specialised and i can't seem to find any to buy online. i'm based in australia. the markings on the globe read sylvania syl-21 250v 100w. does anyone know an equivalent to this, or knows where to source one?", "sortedWord": "None", "identifyer": 60756, "year": "2020"}, {"Unnamed: 0": 313775, "autor": "dariuszstankiewicz", "date": 1592210201000, "content": "Cleaning little spots of rust on photographic equipement. /!/ Today I got in mail a new lense and film back for my camera. Although they are mostly in good shape, I can find a few little spots of rust. Do you have any advice on how to clean it? They aren't very visable so I'm considering leaving it as it is. Still it would be great to hear some advice from fellow photographers. Thanks in advance", "link": "https://www.reddit.com/r/AnalogCommunity/comments/h9c7ll/cleaning_little_spots_of_rust_on_photographic/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cleaning little -----> spots !!!  of rust on photographic equipement. /!/ today i got in mail a new lense and film back for my camera. although they are mostly in good shape, i can find a few little spots of rust. do you have any advice on how to clean it? they aren't very visable so i'm considering leaving it as it is. still it would be great to hear some advice from fellow photographers. thanks in advance", "sortedWord": "None", "identifyer": 60852, "year": "2020"}, {"Unnamed: 0": 313776, "autor": "dooku365", "date": 1592208822000, "content": "Does anyone spot a problem with this shutter speed?! 1/250 (zorki)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/h9bxa9/does_anyone_spot_a_problem_with_this_shutter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone -----> spot !!!  a problem with this shutter speed?! 1/250 (zorki)", "sortedWord": "None", "identifyer": 60853, "year": "2020"}, {"Unnamed: 0": 313908, "autor": "n_oeil", "date": 1599003311000, "content": "Dslr scanning question. What are these spots/lines? (Setup details in comments)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ikvmdd/dslr_scanning_question_what_are_these_spotslines/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dslr scanning question. what are these -----> spots !!! /lines? (setup details in comments)", "sortedWord": "None", "identifyer": 60988, "year": "2020"}, {"Unnamed: 0": 314008, "autor": "registeredtrademrk", "date": 1597626135000, "content": "[Mamiya RZ67] I’ve noticed a light leak on 11/40 pictures i’ve taken. It is always in the same spot, bottom right corner, and ranges from barely noticeable to this being the worst. It never happens in portrait orientation. Could i be doing something wrong with the dark slide or rotating the back?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ib4eau/mamiya_rz67_ive_noticed_a_light_leak_on_1140/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[mamiya rz67] i’ve noticed a light leak on 11/40 pictures i’ve taken. it is always in the same -----> spot !!! , bottom right corner, and ranges from barely noticeable to this being the worst. it never happens in portrait orientation. could i be doing something wrong with the dark slide or rotating the back?", "sortedWord": "None", "identifyer": 61088, "year": "2020"}, {"Unnamed: 0": 314090, "autor": "bonneetoilee", "date": 1608468366000, "content": "Will these dark specks show up on photos? /!/ Sorry if this is a noobie question. I got my first analog camera (Minolta X700) and I loaded in the film for the first time.  \n\nHowever, after I put in the film I noticed these dark specks when I look through the lens (they weren't there before). I took out the lens and also wiped off the area behind it, which contained small bits of dark foam. When I put the lens back on I can still see the specks, in the same spot. However, I can't open the back of the camera to clean it or it will ruin the film. What should I do? Will this show up on my photos? I included photos below. Let me know if you need more/different pictures. Thanks.\n\n[https://imgur.com/a/ZXlqqyk](https://imgur.com/a/ZXlqqyk)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kgtfin/will_these_dark_specks_show_up_on_photos/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "will these dark specks show up on photos? /!/ sorry if this is a noobie question. i got my first analog camera (minolta x700) and i loaded in the film for the first time.  \n\nhowever, after i put in the film i noticed these dark specks when i look through the lens (they weren't there before). i took out the lens and also wiped off the area behind it, which contained small bits of dark foam. when i put the lens back on i can still see the specks, in the same -----> spot !!! . however, i can't open the back of the camera to clean it or it will ruin the film. what should i do? will this show up on my photos? i included photos below. let me know if you need more/different pictures. thanks.\n\n[https://imgur.com/a/zxlqqyk](https://imgur.com/a/zxlqqyk)", "sortedWord": "None", "identifyer": 61170, "year": "2020"}, {"Unnamed: 0": 314169, "autor": "MrGoose_", "date": 1608301711000, "content": "Need help with my Kiev-88! /!/ Hello guys,\n\nToday my new Kiev-88 arrived, and I was just testing it out, making sure it fires and works (which it does). However, I  found one issue. The darkslide doesn't seem to want to go back into its spot in the film back, the bottom part goes in fine but the top has some sort of mechanism or rust stopping it from sliding in. I tried searching around through manuals and other sites to try to find an answer but haven't found any.\n\nIs anyone aware of such a mechanism or not? Thanks in advance!\n\nhttps://preview.redd.it/tduhvjw5hy561.jpg?width=3016&amp;format=pjpg&amp;auto=webp&amp;s=3f96a341b20cf25fe699cb8bac12bd0bae74444f", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kfm37l/need_help_with_my_kiev88/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "need help with my kiev-88! /!/ hello guys,\n\ntoday my new kiev-88 arrived, and i was just testing it out, making sure it fires and works (which it does). however, i  found one issue. the darkslide doesn't seem to want to go back into its -----> spot !!!  in the film back, the bottom part goes in fine but the top has some sort of mechanism or rust stopping it from sliding in. i tried searching around through manuals and other sites to try to find an answer but haven't found any.\n\nis anyone aware of such a mechanism or not? thanks in advance!\n\nhttps://preview.redd.it/tduhvjw5hy561.jpg?width=3016&amp;format=pjpg&amp;auto=webp&amp;s=3f96a341b20cf25fe699cb8bac12bd0bae74444f", "sortedWord": "None", "identifyer": 61249, "year": "2020"}, {"Unnamed: 0": 314449, "autor": "sokol07", "date": 1579509581000, "content": "Used Plustek 8100 - what to check? /!/ I'm thinking about buying a used Plustek Opticfilm 8100. Is there anything I should be careful about and check it before buying? Any weak spots, places likely to be dirty or something?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eramch/used_plustek_8100_what_to_check/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "used plustek 8100 - what to check? /!/ i'm thinking about buying a used plustek opticfilm 8100. is there anything i should be careful about and check it before buying? any weak -----> spots !!! , places likely to be dirty or something?", "sortedWord": "None", "identifyer": 61533, "year": "2020"}, {"Unnamed: 0": 314461, "autor": "sdseattle", "date": 1579481096000, "content": "Does anyone know what causes these white spots ? [Leica IIIc , ILFORD Delta 100]", "link": "https://www.reddit.com/r/AnalogCommunity/comments/er5a4c/does_anyone_know_what_causes_these_white_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does anyone know what causes these white -----> spots !!!  ? [leica iiic , ilford delta 100]", "sortedWord": "None", "identifyer": 61545, "year": "2020"}, {"Unnamed: 0": 314563, "autor": "flyinhawaiian1", "date": 1595353299000, "content": "What are these spots? Is it fungus, oil spots, or just dust? Also lens has some marks on lens coatings, can be seen here, will this effect images?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hvby67/what_are_these_spots_is_it_fungus_oil_spots_or/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what are these -----> spots !!! ? is it fungus, oil spots, or just dust? also lens has some marks on lens coatings, can be seen here, will this effect images?", "sortedWord": "None", "identifyer": 61649, "year": "2020"}, {"Unnamed: 0": 314565, "autor": "doriiian", "date": 1595345372000, "content": "So I‘ve got a problem when shooting in the night and that is dark spots with no amount of detail whatsoever especially when metering for a bright object. How do you manage to get an (almost) even lit picture without dark spots which also can‘t be edited?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hv9d5m/so_ive_got_a_problem_when_shooting_in_the_night/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "so i‘ve got a problem when shooting in the night and that is dark -----> spots !!!  with no amount of detail whatsoever especially when metering for a bright object. how do you manage to get an (almost) even lit picture without dark spots which also can‘t be edited?", "sortedWord": "None", "identifyer": 61651, "year": "2020"}, {"Unnamed: 0": 314572, "autor": "channel_two", "date": 1595318505000, "content": "starting developing my own film, would like some tips! /!/ Hello everyone! I recently started developing my own film. I'm currently using the Cinestill DF96 monobath. These two photos are from the same roll of Tri-X 400--I would like to know what I've done wrong. This is the 4th roll that I've developed from the same chemical.\n\nAlso, would like some tips on how to make sure that the film dries clear with no water spots. I have tried washing it with distilled water and it hasn't worked very well.\n\n[https://imgur.com/a/vr8ZNsL](https://imgur.com/a/vr8ZNsL)\n\n&amp;#x200B;\n\nEDIT: Added link for photos.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hv3frl/starting_developing_my_own_film_would_like_some/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "starting developing my own film, would like some tips! /!/ hello everyone! i recently started developing my own film. i'm currently using the cinestill df96 monobath. these two photos are from the same roll of tri-x 400--i would like to know what i've done wrong. this is the 4th roll that i've developed from the same chemical.\n\nalso, would like some tips on how to make sure that the film dries clear with no water -----> spots !!! . i have tried washing it with distilled water and it hasn't worked very well.\n\n[https://imgur.com/a/vr8znsl](https://imgur.com/a/vr8znsl)\n\n&amp;#x200b;\n\nedit: added link for photos.", "sortedWord": "None", "identifyer": 61658, "year": "2020"}, {"Unnamed: 0": 314642, "autor": "legos_man", "date": 1584834680000, "content": "film caught in OM-2N /!/ So I picked up an OM-2N from a local camera shop back in January and everything has been working well except there is a problem sometimes with rewinding film or when I go to advance after taking a photo. \n\nThe rewind knob doesnt always turn when I advanced the film and have to mess with it and get it to a spot where it starts to rotate again.\n\nI just had a roll in there that was torn apart when I tried to rewind. I was able to salvage most of it.\n\nAny advice on what to do to avoid this happening again? \n\nThanks", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fmptl8/film_caught_in_om2n/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "film caught in om-2n /!/ so i picked up an om-2n from a local camera shop back in january and everything has been working well except there is a problem sometimes with rewinding film or when i go to advance after taking a photo. \n\nthe rewind knob doesnt always turn when i advanced the film and have to mess with it and get it to a -----> spot !!!  where it starts to rotate again.\n\ni just had a roll in there that was torn apart when i tried to rewind. i was able to salvage most of it.\n\nany advice on what to do to avoid this happening again? \n\nthanks", "sortedWord": "None", "identifyer": 61730, "year": "2020"}, {"Unnamed: 0": 314741, "autor": "mamiya7120", "date": 1578028846000, "content": "Better Scanner/Workflow Advice /!/ I have an Epson V600 and I use the Epson Scan software it came with. I bought this scanner because it was “good enough” and I though if I really start shooting a lot of film I’ll upgrade. Well I’ve continued to shoot lots of film and am looking to upgrade the scanner, software or both. The V600 gives decent results but I find the color to be somewhat inconsistent from shot to shot taken in studio with the exact same light and it also will often have weird streaks down the scan that can sometimes, but not always, be fixed by cleaning the scanner though it seems to sort of happen at random but generally in the same spot. I scan almost exclusively color 120 film. \n\nDoes anyone have any recommendations for a better quality scanner and workflow that will give more consistent results? There is probably a better software solution also as Epon Scan is pretty clunky. I do tweak the colors, contrast ect in the software and then take the scan into photoshop but it would be nice to be able to more relatively quickly scan a roll of film with decent results then pick the select for retouching. \n\nThank you for your help.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ejaslb/better_scannerworkflow_advice/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "better scanner/workflow advice /!/ i have an epson v600 and i use the epson scan software it came with. i bought this scanner because it was “good enough” and i though if i really start shooting a lot of film i’ll upgrade. well i’ve continued to shoot lots of film and am looking to upgrade the scanner, software or both. the v600 gives decent results but i find the color to be somewhat inconsistent from shot to shot taken in studio with the exact same light and it also will often have weird streaks down the scan that can sometimes, but not always, be fixed by cleaning the scanner though it seems to sort of happen at random but generally in the same -----> spot !!! . i scan almost exclusively color 120 film. \n\ndoes anyone have any recommendations for a better quality scanner and workflow that will give more consistent results? there is probably a better software solution also as epon scan is pretty clunky. i do tweak the colors, contrast ect in the software and then take the scan into photoshop but it would be nice to be able to more relatively quickly scan a roll of film with decent results then pick the select for retouching. \n\nthank you for your help.", "sortedWord": "None", "identifyer": 61831, "year": "2020"}, {"Unnamed: 0": 314764, "autor": "czeckmate2", "date": 1577979525000, "content": "Does my lens have fungus? Or are these spots from development? /!/ The most recent roll that I shot was on a new lens that was given to me. I noticed that about half the pictures have a noticeable group of spots and I didn’t have issues with this camera body before. \n\nBody: Pentax ME Super\n\nLens: 28-80mm w/macro\n\nFilm: Ilford HP5 \n\nDev and Scan by a local lab\n\n[sample pictures](https://imgur.com/a/pHzPfgS)\n\n\nAny ideas what causes this? There wasn’t any noticeable fungus or scratches on the lens.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/eizq0c/does_my_lens_have_fungus_or_are_these_spots_from/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does my lens have fungus? or are these -----> spots !!!  from development? /!/ the most recent roll that i shot was on a new lens that was given to me. i noticed that about half the pictures have a noticeable group of spots and i didn’t have issues with this camera body before. \n\nbody: pentax me super\n\nlens: 28-80mm w/macro\n\nfilm: ilford hp5 \n\ndev and scan by a local lab\n\n[sample pictures](https://imgur.com/a/phzpfgs)\n\n\nany ideas what causes this? there wasn’t any noticeable fungus or scratches on the lens.", "sortedWord": "None", "identifyer": 61854, "year": "2020"}, {"Unnamed: 0": 314911, "autor": "montlob", "date": 1579912388000, "content": "Help! Small black spots all over negatives. /!/ Got a problem folks: Small black spots all over these rolls. Delta 100, 400, and HP5, all in 120 format. I have been processing film on a near daily basis without any such issues in the past.\n\nProcedure: Patterson tanks, usual agitation every 30 sec's. Developed in Xtol, Stopped in Kodak Stop, Fixed in Ilford Rapid Fix, Washed thoroughly using Hypo Clear and running water, final rinse in photo-flo and distilled water, hung to dry overnight. All chemistry was mixed freshly within the week using tap water (as I've been doing for almost 2 years now without issue).\n\nI developed a handful of rolls the day before, same chemistry and procedure, without any such issues.\n\nWill be moving ahead with a test development today to see if I can duplicate the black specs.\n\nSpecs do not wipe away with Pec-12. Specs do not appear outside of the frames, no specs to be seen in between frames or along the borders. Specs are consistent throughout the length of the entire roll.\n\nAny and all input would be greatly appreciated! Happy to answer any questions that I didn't cover above. Thanks!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ja2r7wo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=537290028c7822d436187f0ece27c5238c1f5966\n\nhttps://preview.redd.it/40fm0yo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=171b75b76b92ad51334652935c482d3a2d2d3863\n\nhttps://preview.redd.it/veg9u2p3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=a75ea447f097b0a73fbd9249dfb41424fd892825\n\nhttps://preview.redd.it/2lznyyo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=9dd76d7490e8e951a09bee3c36b3b4ba507e30ca", "link": "https://www.reddit.com/r/AnalogCommunity/comments/etjeay/help_small_black_spots_all_over_negatives/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "help! small black -----> spots !!!  all over negatives. /!/ got a problem folks: small black spots all over these rolls. delta 100, 400, and hp5, all in 120 format. i have been processing film on a near daily basis without any such issues in the past.\n\nprocedure: patterson tanks, usual agitation every 30 sec's. developed in xtol, stopped in kodak stop, fixed in ilford rapid fix, washed thoroughly using hypo clear and running water, final rinse in photo-flo and distilled water, hung to dry overnight. all chemistry was mixed freshly within the week using tap water (as i've been doing for almost 2 years now without issue).\n\ni developed a handful of rolls the day before, same chemistry and procedure, without any such issues.\n\nwill be moving ahead with a test development today to see if i can duplicate the black specs.\n\nspecs do not wipe away with pec-12. specs do not appear outside of the frames, no specs to be seen in between frames or along the borders. specs are consistent throughout the length of the entire roll.\n\nany and all input would be greatly appreciated! happy to answer any questions that i didn't cover above. thanks!\n\n&amp;#x200b;\n\nhttps://preview.redd.it/ja2r7wo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=537290028c7822d436187f0ece27c5238c1f5966\n\nhttps://preview.redd.it/40fm0yo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=171b75b76b92ad51334652935c482d3a2d2d3863\n\nhttps://preview.redd.it/veg9u2p3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=a75ea447f097b0a73fbd9249dfb41424fd892825\n\nhttps://preview.redd.it/2lznyyo3ltc41.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=9dd76d7490e8e951a09bee3c36b3b4ba507e30ca", "sortedWord": "None", "identifyer": 62002, "year": "2020"}, {"Unnamed: 0": 314946, "autor": "sKru4a", "date": 1579807794000, "content": "I bought a second Olympus OM2 Spot Program", "link": "https://www.reddit.com/r/AnalogCommunity/comments/esy1g3/i_bought_a_second_olympus_om2_spot_program/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i bought a second olympus om2 -----> spot !!!  program", "sortedWord": "None", "identifyer": 62038, "year": "2020"}, {"Unnamed: 0": 315131, "autor": "SuicidalDingo", "date": 1606259968000, "content": "Spot Metering Question /!/ Hello!\n\nI have a question about spot metering that has been bothering me for several weeks, and I cannot seem to find an answer that I'm happy with. Hopefully folks here can shed some light.\n\nI have been shooting a lot of medium format over the past year, and it has been going quite well. I thought I had a good grasp on the Zone System and spot metering. I have put several rolls of slide film (Provia 100F and Velvia 50) through my camera, and all of them came out quite well in terms of exposure. I was pretty confident in my metering technique.\n\nI was excited to get out and shoot some beautiful New England fall colors this season. I shot one roll of Velvia 50 in a wet forest during peak foliage, where the scene was exploding with some greens, reds, and most of all, yellows. \n\nI felt great about the roll and didn't worry so much about the exposure. I took my readings and placed the brightest areas no higher than Zone VII (as I understand, Velvia 50 has about 5 stops of DR from Zone III to VII). For what it's worth, I am using a \"Zone VI Modified\" Pentax Digital Spotmeter. Now, Imagine my disappointment when I get my slides back from the lab and nearly all of them are overexposed. And when I say overexposed, I mean about 3 stops or more. As heartbreaking as it is, I am still trying to figure out exactly what happened and learn from it. I am not going to blame the camera or the light meter, since the images with grass and other colors turned out well, and I don't think I made *that* big of a miscalculation in my metering. I think I'm not understanding something about spotmeters, the Zone System, and colors.\n\nI was reading the manual for the spotmeter, and I came across a paragraph that I thought answered my question (attached). The paragraph says: \"The reflectivity of yellow is lower than that of white, but yellow has the highest reflectivity of all the colors... Consequently, if a light level value taken from a reading of a yellow area is set on the exposure calculator according to the standard index, the photography will be somewhat underexposed.\"\n\nNow, that confused me even more. If yellow has the *highest* reflectivity (and the accompanying chart suggests using an index of 8 for yellow scenes), wouldn't that mean the image would be *overexposed* if I didn't compensate? \n\nIn summary, have two questions:\n\n1. What is the manual saying with regard to metering with color (what is the Index No. it's referring to)?\n2. How can I go about avoiding this in the future? Is using a gray card is the answer?\n\nThanks a lot everyone. Hopefully other people can learn from this as well.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k0g7nx/spot_metering_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering question /!/ hello!\n\ni have a question about spot metering that has been bothering me for several weeks, and i cannot seem to find an answer that i'm happy with. hopefully folks here can shed some light.\n\ni have been shooting a lot of medium format over the past year, and it has been going quite well. i thought i had a good grasp on the zone system and spot metering. i have put several rolls of slide film (provia 100f and velvia 50) through my camera, and all of them came out quite well in terms of exposure. i was pretty confident in my metering technique.\n\ni was excited to get out and shoot some beautiful new england fall colors this season. i shot one roll of velvia 50 in a wet forest during peak foliage, where the scene was exploding with some greens, reds, and most of all, yellows. \n\ni felt great about the roll and didn't worry so much about the exposure. i took my readings and placed the brightest areas no higher than zone vii (as i understand, velvia 50 has about 5 stops of dr from zone iii to vii). for what it's worth, i am using a \"zone vi modified\" pentax digital spotmeter. now, imagine my disappointment when i get my slides back from the lab and nearly all of them are overexposed. and when i say overexposed, i mean about 3 stops or more. as heartbreaking as it is, i am still trying to figure out exactly what happened and learn from it. i am not going to blame the camera or the light meter, since the images with grass and other colors turned out well, and i don't think i made *that* big of a miscalculation in my metering. i think i'm not understanding something about spotmeters, the zone system, and colors.\n\ni was reading the manual for the spotmeter, and i came across a paragraph that i thought answered my question (attached). the paragraph says: \"the reflectivity of yellow is lower than that of white, but yellow has the highest reflectivity of all the colors... consequently, if a light level value taken from a reading of a yellow area is set on the exposure calculator according to the standard index, the photography will be somewhat underexposed.\"\n\nnow, that confused me even more. if yellow has the *highest* reflectivity (and the accompanying chart suggests using an index of 8 for yellow scenes), wouldn't that mean the image would be *overexposed* if i didn't compensate? \n\nin summary, have two questions:\n\n1. what is the manual saying with regard to metering with color (what is the index no. it's referring to)?\n2. how can i go about avoiding this in the future? is using a gray card is the answer?\n\nthanks a lot everyone. hopefully other people can learn from this as well.", "sortedWord": "None", "identifyer": 62224, "year": "2020"}, {"Unnamed: 0": 315137, "autor": "CoffeeDude24", "date": 1606252226000, "content": "Any Recommendations for a spot meter? /!/ So I recently made the jump to medium format and since it is more expensive to develop I want to make sure that I’m using a good spot meter. Any recommendations for a good beginner one?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k0dv2f/any_recommendations_for_a_spot_meter/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "any recommendations for a -----> spot !!!  meter? /!/ so i recently made the jump to medium format and since it is more expensive to develop i want to make sure that i’m using a good spot meter. any recommendations for a good beginner one?", "sortedWord": "None", "identifyer": 62230, "year": "2020"}, {"Unnamed: 0": 315338, "autor": "MavSF", "date": 1584157790000, "content": "Advice for light leak source/repair? /!/ I have a canon A1 that has recently developed a bad light leak that is ruining a lot of shots. I had the foam in back replaced, I'm not sure if they replaced any of the foam/seals by the lens or anywhere else. I'm planning to take it back to the shop, but I was hoping someone here might be able to help track down the source of this leak or have advice on how to do so. \n\nSeverity varies pretty randomly, but its always from the same spot. Adding recent photos for reference. Thanks in advance!\n\n*Processing img b9chm53i7km41...*\n\n*Processing img ai48h3wo6km41...*\n\n*Processing img 0oamerg96km41...*", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ficjj6/advice_for_light_leak_sourcerepair/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "advice for light leak source/repair? /!/ i have a canon a1 that has recently developed a bad light leak that is ruining a lot of shots. i had the foam in back replaced, i'm not sure if they replaced any of the foam/seals by the lens or anywhere else. i'm planning to take it back to the shop, but i was hoping someone here might be able to help track down the source of this leak or have advice on how to do so. \n\nseverity varies pretty randomly, but its always from the same -----> spot !!! . adding recent photos for reference. thanks in advance!\n\n*processing img b9chm53i7km41...*\n\n*processing img ai48h3wo6km41...*\n\n*processing img 0oamerg96km41...*", "sortedWord": "None", "identifyer": 62435, "year": "2020"}, {"Unnamed: 0": 315351, "autor": "haygohay", "date": 1584135193000, "content": "Questions about general CLA /!/ Hi everyone! \n\n\nI'm in the process of buying a TLR, and am stuck between a Yashica and a Flexaret.\n\nAlthough I'm inclined to purchase the flexaret(guaranteed CLA), I'm concerned that because it's more obscure(brand-wise) than a Yashica, in the future it'd be harder to find someone to maintain.\n\nSo I was wondering, in terms of CLA-ing at stores, are there any benefits to owning a well-known branded camera, or are CLA process for TLR's general across all brands?\n\nThanks, and let me know if this is the wrong spot to ask!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fi79g1/questions_about_general_cla/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "questions about general cla /!/ hi everyone! \n\n\ni'm in the process of buying a tlr, and am stuck between a yashica and a flexaret.\n\nalthough i'm inclined to purchase the flexaret(guaranteed cla), i'm concerned that because it's more obscure(brand-wise) than a yashica, in the future it'd be harder to find someone to maintain.\n\nso i was wondering, in terms of cla-ing at stores, are there any benefits to owning a well-known branded camera, or are cla process for tlr's general across all brands?\n\nthanks, and let me know if this is the wrong -----> spot !!!  to ask!", "sortedWord": "None", "identifyer": 62448, "year": "2020"}, {"Unnamed: 0": 315446, "autor": "OdysseyOverland4x4", "date": 1606849910000, "content": "Old School Pentax Spot Meter (Zone System) or Newer Sekonic Spot Meter?? /!/ Friends, I have a dilemma. I need to get my hands on a new spot meter for some of my work, but the problem is that I do not know which approach to take. I shoot B/W, Color Negatice, and Slides.\n\n&amp;#x200B;\n\nInitially any sekonic spot meter new or used seemed to make sense as a good option, especially with some having averaging options. However I also feel like a Pentax Spot Meter has its own versatility allowing the use of the zone system, but I am not sure how this functionally translates in the world of slide and color negative film.\n\n&amp;#x200B;\n\nCan anyone weigh in on what the best approach for my use case is? Any experiences or insight would be greatly appreciated. Thanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k4rpng/old_school_pentax_spot_meter_zone_system_or_newer/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "old school pentax -----> spot !!!  meter (zone system) or newer sekonic -----> spot !!!  meter?? /!/ friends, i have a dilemma. i need to get my hands on a new spot meter for some of my work, but the problem is that i do not know which approach to take. i shoot b/w, color negatice, and slides.\n\n&amp;#x200b;\n\ninitially any sekonic spot meter new or used seemed to make sense as a good option, especially with some having averaging options. however i also feel like a pentax spot meter has its own versatility allowing the use of the zone system, but i am not sure how this functionally translates in the world of slide and color negative film.\n\n&amp;#x200b;\n\ncan anyone weigh in on what the best approach for my use case is? any experiences or insight would be greatly appreciated. thanks!", "sortedWord": "None", "identifyer": 62546, "year": "2020"}, {"Unnamed: 0": 315486, "autor": "thropeanrea", "date": 1607197331000, "content": "Exposing slide film /!/ I’ve never shot slide film before but am thinking of purchasing a roll soon to try it out. I’ve read that unlike colour negative the exposure has to be spot on or I can ruin my images. \n\nRight now I only use a phone app for a light meter (Lux, MyLightMeterPro) which has served me well so far but I am wondering if using a phone app light meter for slide film is good enough or if my exposures will be off.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k7e7h2/exposing_slide_film/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "exposing slide film /!/ i’ve never shot slide film before but am thinking of purchasing a roll soon to try it out. i’ve read that unlike colour negative the exposure has to be -----> spot !!!  on or i can ruin my images. \n\nright now i only use a phone app for a light meter (lux, mylightmeterpro) which has served me well so far but i am wondering if using a phone app light meter for slide film is good enough or if my exposures will be off.", "sortedWord": "None", "identifyer": 62586, "year": "2020"}, {"Unnamed: 0": 315496, "autor": "Beat472", "date": 1607165265000, "content": "DTLA /!/ What are some good spots to take portraits in Dtla if you don’t mind sharing.I’ve been looking around in YouTube looking for a open rooftop or different locations to added for shooting with friends.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/k75gbv/dtla/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dtla /!/ what are some good -----> spots !!!  to take portraits in dtla if you don’t mind sharing.i’ve been looking around in youtube looking for a open rooftop or different locations to added for shooting with friends.", "sortedWord": "None", "identifyer": 62596, "year": "2020"}, {"Unnamed: 0": 315552, "autor": "curly686", "date": 1599868115000, "content": "developing/scanning issue. cant identify the problem. /!/ so ive been DSLR scanning with a high CRI led backlight and have been getting some funky orange-red-magenta color \"splotches\". i feel like something is wrong with my chemicals or the way im developing the film. there are no odd spots if i take a shot with no film in the scanning  setup. the splotches follow the film if i flip the negatives upsidedown when i scan them. im fairly certain that the scanning setup is pretty air-tight. \n\ni organised some samples. they are int the order: original RAW, inverted TIFF and the-best-i-could-do-at-correcting JPG\n\nexamples:\n\nphoto1\n\n[https://drive.google.com/file/d/1iHPYd65tIHhdlLyLNudpXKLZBs9Ka\\_oX/view?usp=sharing](https://drive.google.com/file/d/1iHPYd65tIHhdlLyLNudpXKLZBs9Ka_oX/view?usp=sharing)\n\n[https://drive.google.com/file/d/1aPFqKQrxHDcRqmTAyfG5oPRBfYVyTQyp/view?usp=sharing](https://drive.google.com/file/d/1aPFqKQrxHDcRqmTAyfG5oPRBfYVyTQyp/view?usp=sharing)\n\n[https://drive.google.com/file/d/1egEl9-yar1VA57hiUYmmC17j0sz2yrEZ/view?usp=sharing](https://drive.google.com/file/d/1egEl9-yar1VA57hiUYmmC17j0sz2yrEZ/view?usp=sharing)\n\nphoto2\n\n[https://drive.google.com/file/d/1yY5hfy3M\\_64n9VN6Uo\\_ofhR\\_T-9QAY7T/view?usp=sharing](https://drive.google.com/file/d/1yY5hfy3M_64n9VN6Uo_ofhR_T-9QAY7T/view?usp=sharing)\n\n[https://drive.google.com/file/d/1ipn-2l8Diqg-\\_rg9EVh2Du9gRN2plD9x/view?usp=sharing](https://drive.google.com/file/d/1ipn-2l8Diqg-_rg9EVh2Du9gRN2plD9x/view?usp=sharing)\n\n[https://drive.google.com/file/d/1EdwbxwwRgGejao\\_TM8RMTBjsEwg8IMR1/view?usp=sharing](https://drive.google.com/file/d/1EdwbxwwRgGejao_TM8RMTBjsEwg8IMR1/view?usp=sharing)\n\nphoto3\n\n[https://drive.google.com/file/d/1if9kyr66pX2Ss\\_Prl3duH6jue7TDf9tE/view?usp=sharing](https://drive.google.com/file/d/1if9kyr66pX2Ss_Prl3duH6jue7TDf9tE/view?usp=sharing)\n\n[https://drive.google.com/file/d/10he8sgl43W1TmIJsIAh5jp-iKrwa4EzS/view?usp=sharing](https://drive.google.com/file/d/10he8sgl43W1TmIJsIAh5jp-iKrwa4EzS/view?usp=sharing)\n\n[https://drive.google.com/file/d/1YmqXfizqkninkwgbeKDrbizkcswKg77P/view?usp=sharing](https://drive.google.com/file/d/1YmqXfizqkninkwgbeKDrbizkcswKg77P/view?usp=sharing)\n\nphoto4\n\n[https://drive.google.com/file/d/1niRdSaBG\\_gnOgimkG6aCjWEtnLhDaGJ1/view?usp=sharing](https://drive.google.com/file/d/1niRdSaBG_gnOgimkG6aCjWEtnLhDaGJ1/view?usp=sharing)\n\n[https://drive.google.com/file/d/1P1qzBML\\_1hoBCnIVtcRfjojDj4iircpT/view?usp=sharing](https://drive.google.com/file/d/1P1qzBML_1hoBCnIVtcRfjojDj4iircpT/view?usp=sharing)\n\n[https://drive.google.com/file/d/19pqn--Sb00fUe1XYXsVVkunnVLFn7Det/view?usp=sharing](https://drive.google.com/file/d/19pqn--Sb00fUe1XYXsVVkunnVLFn7Det/view?usp=sharing)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nthank you, any help is much appreciated.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ir22eq/developingscanning_issue_cant_identify_the_problem/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "developing/scanning issue. cant identify the problem. /!/ so ive been dslr scanning with a high cri led backlight and have been getting some funky orange-red-magenta color \"splotches\". i feel like something is wrong with my chemicals or the way im developing the film. there are no odd -----> spots !!!  if i take a shot with no film in the scanning  setup. the splotches follow the film if i flip the negatives upsidedown when i scan them. im fairly certain that the scanning setup is pretty air-tight. \n\ni organised some samples. they are int the order: original raw, inverted tiff and the-best-i-could-do-at-correcting jpg\n\nexamples:\n\nphoto1\n\n[https://drive.google.com/file/d/1ihpyd65tihhdllylnudpxklzbs9ka\\_ox/view?usp=sharing](https://drive.google.com/file/d/1ihpyd65tihhdllylnudpxklzbs9ka_ox/view?usp=sharing)\n\n[https://drive.google.com/file/d/1apfqkqrxhdcrqmtayfg5oprbfyvytqyp/view?usp=sharing](https://drive.google.com/file/d/1apfqkqrxhdcrqmtayfg5oprbfyvytqyp/view?usp=sharing)\n\n[https://drive.google.com/file/d/1egel9-yar1va57hiuymmc17j0sz2yrez/view?usp=sharing](https://drive.google.com/file/d/1egel9-yar1va57hiuymmc17j0sz2yrez/view?usp=sharing)\n\nphoto2\n\n[https://drive.google.com/file/d/1yy5hfy3m\\_64n9vn6uo\\_ofhr\\_t-9qay7t/view?usp=sharing](https://drive.google.com/file/d/1yy5hfy3m_64n9vn6uo_ofhr_t-9qay7t/view?usp=sharing)\n\n[https://drive.google.com/file/d/1ipn-2l8diqg-\\_rg9evh2du9grn2pld9x/view?usp=sharing](https://drive.google.com/file/d/1ipn-2l8diqg-_rg9evh2du9grn2pld9x/view?usp=sharing)\n\n[https://drive.google.com/file/d/1edwbxwwrggejao\\_tm8rmtbjsewg8imr1/view?usp=sharing](https://drive.google.com/file/d/1edwbxwwrggejao_tm8rmtbjsewg8imr1/view?usp=sharing)\n\nphoto3\n\n[https://drive.google.com/file/d/1if9kyr66px2ss\\_prl3duh6jue7tdf9te/view?usp=sharing](https://drive.google.com/file/d/1if9kyr66px2ss_prl3duh6jue7tdf9te/view?usp=sharing)\n\n[https://drive.google.com/file/d/10he8sgl43w1tmijsiah5jp-ikrwa4ezs/view?usp=sharing](https://drive.google.com/file/d/10he8sgl43w1tmijsiah5jp-ikrwa4ezs/view?usp=sharing)\n\n[https://drive.google.com/file/d/1ymqxfizqkninkwgbekdrbizkcswkg77p/view?usp=sharing](https://drive.google.com/file/d/1ymqxfizqkninkwgbekdrbizkcswkg77p/view?usp=sharing)\n\nphoto4\n\n[https://drive.google.com/file/d/1nirdsabg\\_gnogimkg6acjwetnlhdagj1/view?usp=sharing](https://drive.google.com/file/d/1nirdsabg_gnogimkg6acjwetnlhdagj1/view?usp=sharing)\n\n[https://drive.google.com/file/d/1p1qzbml\\_1hobcnivtcrfjojdj4iircpt/view?usp=sharing](https://drive.google.com/file/d/1p1qzbml_1hobcnivtcrfjojdj4iircpt/view?usp=sharing)\n\n[https://drive.google.com/file/d/19pqn--sb00fue1xyxsvvkunnvlfn7det/view?usp=sharing](https://drive.google.com/file/d/19pqn--sb00fue1xyxsvvkunnvlfn7det/view?usp=sharing)\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nthank you, any help is much appreciated.", "sortedWord": "None", "identifyer": 62652, "year": "2020"}, {"Unnamed: 0": 315559, "autor": "dmcsmalls", "date": 1599857465000, "content": "Found this little Konica yesterday for 2 bucks at the local thrift shop! Threw a battery in and it works perfectly! Also spotted this old Graflex, they wanted 250 for it, but I don't know enough about it to drop that money right now.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/iqz0wj/found_this_little_konica_yesterday_for_2_bucks_at/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "found this little konica yesterday for 2 bucks at the local thrift shop! threw a battery in and it works perfectly! also -----> spotted !!!  this old graflex, they wanted 250 for it, but i don't know enough about it to drop that money right now.", "sortedWord": "None", "identifyer": 62660, "year": "2020"}, {"Unnamed: 0": 315682, "autor": "deaflon", "date": 1594221513000, "content": "Is there Something missing in the battery compartment of my Minox 35 ML or is it just broken? /!/ Hey there,\n\nI'm  a big fan of tiny cameras and I just came across a Minox 35ML. Unfortunately it seems to be dead even with a new battery.  The battery check does not show anything at all. Weirdly enough one LED on the front flashes quickly while winding up. I have not found anything about that online.\n\nI realized that the battery compartment looks a bit weird since the contact in the front right spot of the compartment does not seem to be connected to anything.\n\n[The battery compartment](https://preview.redd.it/lq1ai6kogn951.jpg?width=2998&amp;format=pjpg&amp;auto=webp&amp;s=0db4564c61f4e9aa6266ab466a393f9f030e65d3)\n\n&amp;#x200B;\n\n[the \\\\\"sled\\\\\" for the battery](https://preview.redd.it/f1bffk2pin951.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=b41de4a3040d5f8e754bf37dfc14a92b8151acc3)\n\n&amp;#x200B;\n\nDoes anyone have a clue or a Minox 35 ML to compare?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hniwig/is_there_something_missing_in_the_battery/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "is there something missing in the battery compartment of my minox 35 ml or is it just broken? /!/ hey there,\n\ni'm  a big fan of tiny cameras and i just came across a minox 35ml. unfortunately it seems to be dead even with a new battery.  the battery check does not show anything at all. weirdly enough one led on the front flashes quickly while winding up. i have not found anything about that online.\n\ni realized that the battery compartment looks a bit weird since the contact in the front right -----> spot !!!  of the compartment does not seem to be connected to anything.\n\n[the battery compartment](https://preview.redd.it/lq1ai6kogn951.jpg?width=2998&amp;format=pjpg&amp;auto=webp&amp;s=0db4564c61f4e9aa6266ab466a393f9f030e65d3)\n\n&amp;#x200b;\n\n[the \\\\\"sled\\\\\" for the battery](https://preview.redd.it/f1bffk2pin951.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=b41de4a3040d5f8e754bf37dfc14a92b8151acc3)\n\n&amp;#x200b;\n\ndoes anyone have a clue or a minox 35 ml to compare?", "sortedWord": "None", "identifyer": 62784, "year": "2020"}, {"Unnamed: 0": 315735, "autor": "Unparalleled_", "date": 1595717986000, "content": "Does anyone switch 35mm rolls of film before finishing them? /!/ I normally have one camera with slide and one with colour negative when I travel. I'm considering just bringing one camera next time I go somewhere. The plan is to use an Eos 3 and set the custom function so it rewinds to leave leader out whilst taking note of what frame I'm on. Then I can shoot with a lens cap to advance back to this spot when I reload the roll. Has anyone used this method to repeatedly switch between rolls and is it a much bigger hassle than I expect?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/hxw23u/does_anyone_switch_35mm_rolls_of_film_before/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does anyone switch 35mm rolls of film before finishing them? /!/ i normally have one camera with slide and one with colour negative when i travel. i'm considering just bringing one camera next time i go somewhere. the plan is to use an eos 3 and set the custom function so it rewinds to leave leader out whilst taking note of what frame i'm on. then i can shoot with a lens cap to advance back to this -----> spot !!!  when i reload the roll. has anyone used this method to repeatedly switch between rolls and is it a much bigger hassle than i expect?", "sortedWord": "None", "identifyer": 62838, "year": "2020"}, {"Unnamed: 0": 315798, "autor": "klnadler", "date": 1591059625000, "content": "Spot meter question /!/ Picked up an old Pentax spotmeter and I'm a little confused on the battery it requires. The manual says it takes a 9v and a 1.3v mercury battery. While I know the mercury battery is no longer available it doesn't really say if both are required. I put in a 9v and get a reading but to my knowledge it doesn't seem accurate. Does anyone have any insight on where to find a 1.3v mercury equivalent or if it's even required. Here's a link to the manual: https://www.cameramanuals.org/pentax_pdf/pentax_1-21.pdf", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gux9r4/spot_meter_question/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  meter question /!/ picked up an old pentax spotmeter and i'm a little confused on the battery it requires. the manual says it takes a 9v and a 1.3v mercury battery. while i know the mercury battery is no longer available it doesn't really say if both are required. i put in a 9v and get a reading but to my knowledge it doesn't seem accurate. does anyone have any insight on where to find a 1.3v mercury equivalent or if it's even required. here's a link to the manual: https://www.cameramanuals.org/pentax_pdf/pentax_1-21.pdf", "sortedWord": "None", "identifyer": 62902, "year": "2020"}, {"Unnamed: 0": 315822, "autor": "elon_mug", "date": 1585832184000, "content": "How can I remove the cloudy spots?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/ftluus/how_can_i_remove_the_cloudy_spots/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "how can i remove the cloudy -----> spots !!! ?", "sortedWord": "None", "identifyer": 62926, "year": "2020"}, {"Unnamed: 0": 315919, "autor": "rowapair", "date": 1586373406000, "content": "Cute date ideas involving film/analog in NYC /!/ So this girl and I have been talking for a while and we're thinking of going on a date after quarantine. We both love film and that's how we met. We were planning on going to just walk around in the city and take pictures but I was wondering if there are any must-see analog spots in NYC, especially Manhattan.\n\nThanks!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fxcsk3/cute_date_ideas_involving_filmanalog_in_nyc/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "cute date ideas involving film/analog in nyc /!/ so this girl and i have been talking for a while and we're thinking of going on a date after quarantine. we both love film and that's how we met. we were planning on going to just walk around in the city and take pictures but i was wondering if there are any must-see analog -----> spots !!!  in nyc, especially manhattan.\n\nthanks!", "sortedWord": "None", "identifyer": 63028, "year": "2020"}, {"Unnamed: 0": 315926, "autor": "THopper28", "date": 1586358057000, "content": "I decided to test my friends and see if they could spot the differences // Film vs Film Apps // All feedback appreciated // The real purpose of this video is just to spread positive thinking and connect everyone through photography, its not intended as a competition - watch until the end. /!/ [https://youtu.be/C-z4eIHUMlo](https://youtu.be/C-z4eIHUMlo)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/fx7yzs/i_decided_to_test_my_friends_and_see_if_they/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i decided to test my friends and see if they could -----> spot !!!  the differences // film vs film apps // all feedback appreciated // the real purpose of this video is just to spread positive thinking and connect everyone through photography, its not intended as a competition - watch until the end. /!/ [https://youtu.be/c-z4eihumlo](https://youtu.be/c-z4eihumlo)", "sortedWord": "None", "identifyer": 63035, "year": "2020"}, {"Unnamed: 0": 316124, "autor": "BySumbergsStache", "date": 1587596246000, "content": "Shooting with only premium film less is better than shooting a lot of cheap film /!/ People suggest that one should shoot with cheap film as much as possible, and stick with expensive professional film only for special events. I disagree. I shoot only with Provia 100F and Portra 160, and I think you should too.\n\nThe benefit of shooting one film is that you really get to know the qualities of the film.\n\nOn shooting with cheap film so you can take more photos - I think for practicing photography, a digital camera set up like a film camera is a much better teaching tool. I have a Sony A7RII and shoot it like a film camera - set it to center weighed or spot metering, daylight white balance, and 400ISO. If only I could reduce dynamic range...", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g6bdyc/shooting_with_only_premium_film_less_is_better/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shooting with only premium film less is better than shooting a lot of cheap film /!/ people suggest that one should shoot with cheap film as much as possible, and stick with expensive professional film only for special events. i disagree. i shoot only with provia 100f and portra 160, and i think you should too.\n\nthe benefit of shooting one film is that you really get to know the qualities of the film.\n\non shooting with cheap film so you can take more photos - i think for practicing photography, a digital camera set up like a film camera is a much better teaching tool. i have a sony a7rii and shoot it like a film camera - set it to center weighed or -----> spot !!!  metering, daylight white balance, and 400iso. if only i could reduce dynamic range...", "sortedWord": "None", "identifyer": 63235, "year": "2020"}, {"Unnamed: 0": 316320, "autor": "RRH", "date": 1589669101000, "content": "Ho to meter for a light source? /!/ I have an RB67 so i have a sekonic light meter (no spot metering) and im wondering how do i meter or a light source or a neon light?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gl3zyp/ho_to_meter_for_a_light_source/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ho to meter for a light source? /!/ i have an rb67 so i have a sekonic light meter (no -----> spot !!!  metering) and im wondering how do i meter or a light source or a neon light?", "sortedWord": "None", "identifyer": 63433, "year": "2020"}, {"Unnamed: 0": 316381, "autor": "Edvijuda", "date": 1589522057000, "content": "Spots on negative and scan. Any idea what they may be? Info in comment.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gk3h24/spots_on_negative_and_scan_any_idea_what_they_may/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "-----> spots !!!  on negative and scan. any idea what they may be? info in comment.", "sortedWord": "None", "identifyer": 63496, "year": "2020"}, {"Unnamed: 0": 316402, "autor": "THopper28", "date": 1589478303000, "content": "And: \"Can you spot the film photo? #2\" // I made a little game with my friends about guessing which photo is the real film photo. Watch it if you'd like and have some fun :)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gjr5pt/and_can_you_spot_the_film_photo_2_i_made_a_little/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and: \"can you -----> spot !!!  the film photo? #2\" // i made a little game with my friends about guessing which photo is the real film photo. watch it if you'd like and have some fun :)", "sortedWord": "None", "identifyer": 63517, "year": "2020"}, {"Unnamed: 0": 316440, "autor": "supi_", "date": 1598185880000, "content": "Strange light spots with my zenza bronica sq b /!/  Hello!  \nMy last rolls on my zenza bronica sq-b all have these sorts of light leaks on some shots but I can’t really understand where does the light enters.  \nThe sealings seem okay, any clues?  \nThanks for the help!", "link": "https://www.reddit.com/r/AnalogCommunity/comments/if2dd4/strange_light_spots_with_my_zenza_bronica_sq_b/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "strange light -----> spots !!!  with my zenza bronica sq b /!/  hello!  \nmy last rolls on my zenza bronica sq-b all have these sorts of light leaks on some shots but i can’t really understand where does the light enters.  \nthe sealings seem okay, any clues?  \nthanks for the help!", "sortedWord": "None", "identifyer": 63556, "year": "2020"}, {"Unnamed: 0": 316682, "autor": "crash_tcr", "date": 1597362441000, "content": "Just got Adobe Lightroom and went a little overboard on a few old vacation pics [olympus xa2, kodak ultramax400] these all had a terrible dust spot from a dirty lens. Now to sharpen my healing brush skills.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/i9b4xg/just_got_adobe_lightroom_and_went_a_little/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just got adobe lightroom and went a little overboard on a few old vacation pics [olympus xa2, kodak ultramax400] these all had a terrible dust -----> spot !!!  from a dirty lens. now to sharpen my healing brush skills.", "sortedWord": "None", "identifyer": 63802, "year": "2020"}, {"Unnamed: 0": 316719, "autor": "ConstrictorLiquor", "date": 1607625099000, "content": "Leica and Copies /!/ I know there are often many questions about the authenticity of screw mount Leicas.  Counterfeits made from Soviet cameras can sometimes be hard to spot if you don't know what to look for, but this article breaks it down pretty clearly.  If you're thinking about buying a screw mount Leica, you might want to check this article out.  \n\n\n[https://www.mikeeckman.com/2020/12/how-to-spot-a-fake-leica/](https://www.mikeeckman.com/2020/12/how-to-spot-a-fake-leica/)", "link": "https://www.reddit.com/r/AnalogCommunity/comments/kakypw/leica_and_copies/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica and copies /!/ i know there are often many questions about the authenticity of screw mount leicas.  counterfeits made from soviet cameras can sometimes be hard to -----> spot !!!  if you don't know what to look for, but this article breaks it down pretty clearly.  if you're thinking about buying a screw mount leica, you might want to check this article out.  \n\n\n[https://www.mikeeckman.com/2020/12/how-to-spot-a-fake-leica/](https://www.mikeeckman.com/2020/12/how-to-spot-a-fake-leica/)", "sortedWord": "None", "identifyer": 63842, "year": "2020"}, {"Unnamed: 0": 316890, "autor": "TheHikingRiverRat", "date": 1589332403000, "content": "Hasselblad/Kiev users, are metered viewfinders worth it? /!/ After dropping my poor Soligor spot meter I've been looking at alternatives. Seems like there are a number of metered viewfinders from Hasselblad and Kiev that will work on my 500c, and some of them can be found pretty cheap in comparison to another Soligor. To any of you who have experience with the things, how are they? Worth using or should I just save up and get another good dedicated unit?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/giounu/hasselbladkiev_users_are_metered_viewfinders/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hasselblad/kiev users, are metered viewfinders worth it? /!/ after dropping my poor soligor -----> spot !!!  meter i've been looking at alternatives. seems like there are a number of metered viewfinders from hasselblad and kiev that will work on my 500c, and some of them can be found pretty cheap in comparison to another soligor. to any of you who have experience with the things, how are they? worth using or should i just save up and get another good dedicated unit?", "sortedWord": "None", "identifyer": 64016, "year": "2020"}, {"Unnamed: 0": 317074, "autor": "Mthreefivee", "date": 1587283105000, "content": "Light meter viewfinder cracked /!/ I managed to drop the 10 degree spot meter attachment for my Minolta Autometer III and the glass cracked on the part that screws in over the sensor.   \n\n\nIs it FUBAR? I picked it up with the intention of metering for some long exposures at night, will the cracks in the glass cause some kind of refractive/reflective fuckery? I checked it against a friends DSLR and it seems to be okayish in low light but wondering if anyone has ever had a similar situation?", "link": "https://www.reddit.com/r/AnalogCommunity/comments/g43wcx/light_meter_viewfinder_cracked/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "light meter viewfinder cracked /!/ i managed to drop the 10 degree -----> spot !!!  meter attachment for my minolta autometer iii and the glass cracked on the part that screws in over the sensor.   \n\n\nis it fubar? i picked it up with the intention of metering for some long exposures at night, will the cracks in the glass cause some kind of refractive/reflective fuckery? i checked it against a friends dslr and it seems to be okayish in low light but wondering if anyone has ever had a similar situation?", "sortedWord": "None", "identifyer": 64201, "year": "2020"}, {"Unnamed: 0": 317130, "autor": "Anarkya", "date": 1588864349000, "content": "Contacted a repair store in my town. This was his answer. Do you agree? /!/ \"To answer your question : we must first inform you that nobody repairs nor has the qualifications to do so on the spot. That’s mostly because manufacturers now refuse to sell their parts… That being said, unless there’s an exceptionnal warranty like Nikon (5 years cameras and 10 years for lenses) or Canon (5 and 3), nothing past 3 years is “worth” reparing, because you can find the same items on ebay for less than any repair cost – for the most part of anyhting in this industry. Any besic repair starts at 300$, and an “average” repair cost is 500$.\"\n\nI'm trying to get my light meter fixed, but I asked if they could service it too and that was their answer.\n\nThis photo store has been around in my town for a hundred years, they're still popular with film shooters too.", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gf8cip/contacted_a_repair_store_in_my_town_this_was_his/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "contacted a repair store in my town. this was his answer. do you agree? /!/ \"to answer your question : we must first inform you that nobody repairs nor has the qualifications to do so on the -----> spot !!! . that’s mostly because manufacturers now refuse to sell their parts… that being said, unless there’s an exceptionnal warranty like nikon (5 years cameras and 10 years for lenses) or canon (5 and 3), nothing past 3 years is “worth” reparing, because you can find the same items on ebay for less than any repair cost – for the most part of anyhting in this industry. any besic repair starts at 300$, and an “average” repair cost is 500$.\"\n\ni'm trying to get my light meter fixed, but i asked if they could service it too and that was their answer.\n\nthis photo store has been around in my town for a hundred years, they're still popular with film shooters too.", "sortedWord": "None", "identifyer": 64257, "year": "2020"}, {"Unnamed: 0": 317161, "autor": "uaiududis", "date": 1588751488000, "content": "[APP] Lightme : Beta 1.0.15 is out with AVERAGE SPOT METERING, variable spot metering zoom, double tap to toggle continuous metering plus some haptic feedback! (let me know what you think :) )", "link": "https://www.reddit.com/r/AnalogCommunity/comments/gefnx4/app_lightme_beta_1015_is_out_with_average_spot/", "origin": "Reddit", "suborigin": "AnalogCommunity", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[app] lightme : beta 1.0.15 is out with average -----> spot !!!  metering, variable -----> spot !!!  metering zoom, double tap to toggle continuous metering plus some haptic feedback! (let me know what you think :) )", "sortedWord": "None", "identifyer": 64288, "year": "2020"}], "name": "spotAnalogCommunity2020"}