{"interestingcomments": [{"Unnamed: 0": 5366, "autor": "quadrider550", "date": 1637366400000, "content": "(\"Quote from: Al_Smith on December 09, 2021, 07:13:51 AM\\nI tried that on a 95 cc old Sears gear drive chainsaw that came over on the Mayflower .Spun the nut off ,the flywheel orbited my garage twice .I hit the deck in fear for my life .The flywheel just barely missed my wife's Cadillac .Sounded like good plan but wasn't .I never did find the nut .\\nThat was a close call there. My design does not have this problem.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117305.msg1867653#msg1867653',)", "origin": "Forestry", "suborigin": "Chainsaws", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "(\"quote from: al_smith on december 09, 2021, 07:13:51 am\\ni tried that on a 95 cc old sears gear drive chainsaw that came over on the mayflower .spun the nut off ,the flywheel orbited my garage twice .i hit the deck in fear for my life .the flywheel just barely missed my wife's cadillac .sounded like good plan but wasn't .i never did find the nut .\\nthat was a close call there. -----> my !!!  -----> design !!!  does not have this problem.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000007, "year": "2021"}, {"Unnamed: 0": 6797, "autor": "Don P", "date": 1637366400000, "content": "('Hmm, I see the shear strength of the steel in a 3/8\" fastener is 3,695 lbs here;\\nRSS - Sell Sheet_18-Front Alt (grkfasteners.com)\\nWhat you\\'re looking for is the allowable load in wood of your specific gravity in single shear. I suspect that will be in the low hundreds per fastener.\\n...\\n...\\nHere\\'s the meat and taters,\\nFor proprietary structural stuff find the ESR;\\nESR-2442 - GRK Fasteners, A Division of Illinois Tool Works, Inc. (icc-es.org)\\nScroll to pg6 table 3. look down to the 3/8 x 7.25\" and longer. You\\'re shearing parallel to grain there at the heeljoint, Dougfir, SG runs ~.45-.50, ahh sunny, southern dougfir use .45, WRC probably around .35. Assuming green and exposed, I\\'d multiply by the wet service factor and only use 70% of that dry service allowable. In southern dougfir with a 3/8 x 8\" GRK RSS loaded in shear parallel to grain I\\'m seeing 423lbs x .70 or 296.1 lbs/fastener. Read the rest of the ESR for connection details etc. This is what I design by and am ready to turn over if he asks for papers please, these are the real numbers. You\\'ll notice in reading that, the sales stuff I pulled form the company website says 3695 steel shear strength, the ESR says 1231, No idea what the issue is but the ESR is what matters.\\nAnyway, there\\'s how to find the allowable shear. Divide the load by the allowable load per fastener to see how many fasteners are needed, then check the spacing specs and see if you can get them in there. There is nothing at all wrong with that approach. Quantify load, provide quantifiable resistance.',)", "link": "('https://icc-es.org/wp-content/uploads/report-directory/ESR-2442.pdf',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": "('hmm, i see the shear strength of the steel in a 3/8\" fastener is 3,695 lbs here;\\nrss - sell sheet_18-front alt (grkfasteners.com)\\nwhat you\\'re looking for is the allowable load in wood of your specific gravity in single shear. i suspect that will be in the low hundreds per fastener.\\n...\\n...\\nhere\\'s the meat and taters,\\nfor proprietary structural stuff find the esr;\\nesr-2442 - grk fasteners, a division of illinois tool works, inc. (icc-es.org)\\nscroll to pg6 table 3. look down to the 3/8 x 7.25\" and longer. you\\'re shearing parallel to grain there at the heeljoint, dougfir, sg runs ~.45-.50, ahh sunny, southern dougfir use .45, wrc probably around .35. assuming green and exposed, i\\'d multiply by the wet service factor and only use 70% of that dry service allowable. in southern dougfir with a 3/8 x 8\" grk rss loaded in shear parallel to grain i\\'m seeing 423lbs x .70 or 296.1 lbs/fastener. read the rest of the esr for connection details etc. this is what -----> i !!!  -----> design !!!  by and am ready to turn over if he asks for papers please, these are the real numbers. you\\'ll notice in reading that, the sales stuff i pulled form the company website says 3695 steel shear strength, the esr says 1231, no idea what the issue is but the esr is what matters.\\nanyway, there\\'s how to find the allowable shear. divide the load by the allowable load per fastener to see how many fasteners are needed, then check the spacing specs and see if you can get them in there. there is nothing at all wrong with that approach. quantify load, provide quantifiable resistance.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 8202, "autor": "EOTE", "date": 1637366400000, "content": "('We decided to design and build a rainwater collection system about 3 and a half years ago. The idea was spawned by looking at the costs and economics compared to well water and other options we have.\\nWe have a water district here that we could buy water from. Back in the 70\\'s and 80\\'s whomever owned this land had water supplied from the water district. However, for us to take advantage of it, they would have to bring in a new line (and charge us for it) and then whether we used it or not, it would be a base price of $24 per month. The cost per gallon was pretty high to boot so we would spend hundreds a month on water.\\nWe also have two wells that we discovered on the place and both were damaged by the bulldozer that cleared an area for them to sell the property. They cleared about a quarter of an acre initially but drove over the large diameter well and ran into the well casing on the small well. It was bent over and crumpled. 3 months ago when I rented an excavator I decided to dig around both wells. The cased well had a 6\" casing and the other one was two feet in diameter and was lined with cement pipe in 2\\' long sections. The bulldozer crushed the concrete cap and pushed it down about 4\\' into the well where it is currently lodged. I dug around the well enough where I can now remove the broken first 2\\' section and maybe get an anchor bolt put into the concrete cap so I can pull it out. The well is probably a shallow well of 40 to 50 feet. According to the neighbor, shallow wells could dry up during some of the dry spells. The 6\" cased well was probably in the neighborhood of 200\\' deep and probably put out between 5 and 10 gallons a minute when it was active. Unfortunately, I did not see the benefit of remediating the cased well so I pulled the well casing (only 10\\') and first section of pipes and left the rest in the ground. I covered it over so it is no longer an issue. So potentially, I still have one well I can remediate.\\nWe also inquired with a well driller to drill a new well but were not encouraged by both the cost and the potential yield from the well. Neighboring wells are around 200\\' to 240\\' deep and don\\'t produce more than 5 gpm. The starting cost was around $7,500 and could go as high as $20,000. I remember stories of well drilling in Montana during the early 1900\\'s where the wells were drilled by hand. One story goes that the guy (hand) dug a well 300\\' deep and never hit water. He ended up moving about 50\\' and dug another well almost as deep before he hit some water. Well drilling is kind of a crap shoot. There are no guarantees you will find water. As a side note, when I drilled a 4\" well for my greenhouses in Montana we hit an underground river at 50\\' and could pump 100 gpm from it.\\nSo this information affected our thought process in deciding on rainwater collection. We checked with the state of Texas and we are free to collect rainwater. In fact we are encouraged to and if we had been in a municipal district like Austin we would have gotten rebates from the city for doing so.\\nWhen I looked at what it would take to put in a rainwater system it was pretty simple. Think of the early 1900\\'s where lots of houses had a cistern in the basement. That was their water supply complete with leaves, bird poop, frogs, bugs, etc. We wanted to improve on that concept and researched systems and designs.\\nThe basic components are pretty simple: A collection area (i.e. roof), a storage area (tanks), plumbing to get the water from the collection area to the storage area, and then additional plumbing to get the water from the storage area to where you want to use it. Add any bells and whistles you want to make it more to your liking (like water filtration).\\nThis shows the 3 water tanks with the connection plumbing on the bottom that ties all three tanks to the water system in the barn.\\nThis shows the leaf separator below the gutter downspout and the first flush plumbing.\\nThis shows the plumbing into the barn as well as the sight gauge (clear PVC) so you can see the water level in the tanks.\\nWe installed an Aquasana water purification system which consists of a 30 micron pre-filter, a 1 million gallon rated carbon filter, a 10 micron post filter and a UV light sterilizer which the water passes through. I have a 3/4 hp water pump that is pressure activated at 30 psi (low) and 50 psi (high) and two pressure tanks, a 26 gallon and a 110 gallon (not shown in the photo).\\nSo our system consists of a 40\\' x 72\\' barn roof for capturing the rain. It\\'s on a 2/12 pitch so the effective surface area is about 2,950 square feet.\\nOur historical usage in our home in central Texas including outside irrigation was an average of 3,300 gallons per month. I wanted to have at least 5 months of historical water usage as my storage capacity so 3,300 x 5 = 16,500 gallons. We opted for 3 - 5,000 gallon plastic tanks because of the cost and warranty. The 3 tanks cost me about $5,000.\\nThe plumbing was pretty straight forward using 4\" PVC sewer pipe and fittings. We mounted the pipes directly under the eves and used a separator designed to remove debris from the rain water. So the water ran out of the down spouts through the separators into the 4\" pipes which then flowed to the tanks. Before entering the tanks we put in something called a \"first flush\" which collects the first 10 to 20 gallons of water washed down the pipes into a \"holding\" pipe so it separates what is typically the dirtiest water from the rest of the water. The reservoir the first flush water runs into has a floating ball that stops the flow into the reservoir when it is full. The rest of the water the flows into the tank which also has a basket screen at the entrance of the water pipe. Finally there is an overflow pipe from the tanks that allows water to exit the tanks if the tanks are full. Our tanks are also tied together so the water level is self leveling between the three tanks. (We plumbed the water to only run into the outside two of the three tanks so the 3rd tank fills by the water self leveling).\\nBecause the area where we live generally has several inches per month in rain, we felt we would have a ready supply to refill the tanks as the water was used. This area gets an average of 48 inches of water per year which for our roof could produce up to 84,000 gallons a year of captured rain water. The roof generally produces about 1600 gallons of water for storage from an inch of rain. In the last 3 years we have never been down more than 1500 gallons which is encouraging.\\nSo that\\'s the basics of our system.',)", "link": "('https://forestryforum.com/board/index.php?topic=111247.msg1741403#msg1741403',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "we decided to design", "selectorShort": "design", "MarkedSent": "('-----> we !!!  -----> decided !!!  -----> to !!!  -----> design !!!  and build a rainwater collection system about 3 and a half years ago. the idea was spawned by looking at the costs and economics compared to well water and other options we have.\\nwe have a water district here that we could buy water from. back in the 70\\'s and 80\\'s whomever owned this land had water supplied from the water district. however, for us to take advantage of it, they would have to bring in a new line (and charge us for it) and then whether we used it or not, it would be a base price of $24 per month. the cost per gallon was pretty high to boot so we would spend hundreds a month on water.\\nwe also have two wells that we discovered on the place and both were damaged by the bulldozer that cleared an area for them to sell the property. they cleared about a quarter of an acre initially but drove over the large diameter well and ran into the well casing on the small well. it was bent over and crumpled. 3 months ago when i rented an excavator i decided to dig around both wells. the cased well had a 6\" casing and the other one was two feet in diameter and was lined with cement pipe in 2\\' long sections. the bulldozer crushed the concrete cap and pushed it down about 4\\' into the well where it is currently lodged. i dug around the well enough where i can now remove the broken first 2\\' section and maybe get an anchor bolt put into the concrete cap so i can pull it out. the well is probably a shallow well of 40 to 50 feet. according to the neighbor, shallow wells could dry up during some of the dry spells. the 6\" cased well was probably in the neighborhood of 200\\' deep and probably put out between 5 and 10 gallons a minute when it was active. unfortunately, i did not see the benefit of remediating the cased well so i pulled the well casing (only 10\\') and first section of pipes and left the rest in the ground. i covered it over so it is no longer an issue. so potentially, i still have one well i can remediate.\\nwe also inquired with a well driller to drill a new well but were not encouraged by both the cost and the potential yield from the well. neighboring wells are around 200\\' to 240\\' deep and don\\'t produce more than 5 gpm. the starting cost was around $7,500 and could go as high as $20,000. i remember stories of well drilling in montana during the early 1900\\'s where the wells were drilled by hand. one story goes that the guy (hand) dug a well 300\\' deep and never hit water. he ended up moving about 50\\' and dug another well almost as deep before he hit some water. well drilling is kind of a crap shoot. there are no guarantees you will find water. as a side note, when i drilled a 4\" well for my greenhouses in montana we hit an underground river at 50\\' and could pump 100 gpm from it.\\nso this information affected our thought process in deciding on rainwater collection. we checked with the state of texas and we are free to collect rainwater. in fact we are encouraged to and if we had been in a municipal district like austin we would have gotten rebates from the city for doing so.\\nwhen i looked at what it would take to put in a rainwater system it was pretty simple. think of the early 1900\\'s where lots of houses had a cistern in the basement. that was their water supply complete with leaves, bird poop, frogs, bugs, etc. we wanted to improve on that concept and researched systems and designs.\\nthe basic components are pretty simple: a collection area (i.e. roof), a storage area (tanks), plumbing to get the water from the collection area to the storage area, and then additional plumbing to get the water from the storage area to where you want to use it. add any bells and whistles you want to make it more to your liking (like water filtration).\\nthis shows the 3 water tanks with the connection plumbing on the bottom that ties all three tanks to the water system in the barn.\\nthis shows the leaf separator below the gutter downspout and the first flush plumbing.\\nthis shows the plumbing into the barn as well as the sight gauge (clear pvc) so you can see the water level in the tanks.\\nwe installed an aquasana water purification system which consists of a 30 micron pre-filter, a 1 million gallon rated carbon filter, a 10 micron post filter and a uv light sterilizer which the water passes through. i have a 3/4 hp water pump that is pressure activated at 30 psi (low) and 50 psi (high) and two pressure tanks, a 26 gallon and a 110 gallon (not shown in the photo).\\nso our system consists of a 40\\' x 72\\' barn roof for capturing the rain. it\\'s on a 2/12 pitch so the effective surface area is about 2,950 square feet.\\nour historical usage in our home in central texas including outside irrigation was an average of 3,300 gallons per month. i wanted to have at least 5 months of historical water usage as my storage capacity so 3,300 x 5 = 16,500 gallons. we opted for 3 - 5,000 gallon plastic tanks because of the cost and warranty. the 3 tanks cost me about $5,000.\\nthe plumbing was pretty straight forward using 4\" pvc sewer pipe and fittings. we mounted the pipes directly under the eves and used a separator designed to remove debris from the rain water. so the water ran out of the down spouts through the separators into the 4\" pipes which then flowed to the tanks. before entering the tanks we put in something called a \"first flush\" which collects the first 10 to 20 gallons of water washed down the pipes into a \"holding\" pipe so it separates what is typically the dirtiest water from the rest of the water. the reservoir the first flush water runs into has a floating ball that stops the flow into the reservoir when it is full. the rest of the water the flows into the tank which also has a basket screen at the entrance of the water pipe. finally there is an overflow pipe from the tanks that allows water to exit the tanks if the tanks are full. our tanks are also tied together so the water level is self leveling between the three tanks. (we plumbed the water to only run into the outside two of the three tanks so the 3rd tank fills by the water self leveling).\\nbecause the area where we live generally has several inches per month in rain, we felt we would have a ready supply to refill the tanks as the water was used. this area gets an average of 48 inches of water per year which for our roof could produce up to 84,000 gallons a year of captured rain water. the roof generally produces about 1600 gallons of water for storage from an inch of rain. in the last 3 years we have never been down more than 1500 gallons which is encouraging.\\nso that\\'s the basics of our system.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 8860, "autor": "21incher", "date": 1637366400000, "content": "(\"When I designed and built my splitter I tried to keep it cheap and just used a 4 inch cylinder and old 12 hp kholer tractor motor with a 2 stage pump. When I first tested it it was very slow because of a poor wedge design. I just used a tapered wedge and the pump would kick down almost immediately slowing the splitting to a crawl. I then redesigned the wedge to a 2 angle wedge that cut close to 25% off the splitting cycle time by keeping the pump from kicking down so quickly. Well wasn't satisfied with that so I designed a new edge with a shallow knife edge and separate shorter off center 2 stage blocks. That really sped it up and kept the pump from kicking down early. Last thing I tried was elevating the chunk 2 inches off the base plate with blocks about 8 inches apart to get less pinching on the wedge. Well that really sped the cycle time up and basically all my splitting is now done without having the pump kick down and normally everything is split using under 800 psi on my pressure gauge. I found the wedge is a great place to start if you are working on speeding up a low flow system. I used bearing brass for my slide block liners because plastics would not last when I took into account for off center stresses from knots and cross grain. This is what my final wedge looks like and there is a provision for the 4 way knife.\\nThis is the splitter. I used a winch for the loading platform to save money\\nHere you can see the log is slightly elevated. Over 10 years I haven't encountered anything under 24 inches long I couldn't split. I have several videos about it splitting on my YouTube channel.\",)", "link": "('https://forestryforum.com/board/index.php?topic=116352.msg1845462#msg1845462',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "(\"when -----> i !!!  -----> designed !!!  and built my splitter -----> i !!!  tried to keep it cheap and just used a 4 inch cylinder and old 12 hp kholer tractor motor with a 2 stage pump. when i first tested it it was very slow because of a poor wedge design. i just used a tapered wedge and the pump would kick down almost immediately slowing the splitting to a crawl. i then redesigned the wedge to a 2 angle wedge that cut close to 25% off the splitting cycle time by keeping the pump from kicking down so quickly. well wasn't satisfied with that so i designed a new edge with a shallow knife edge and separate shorter off center 2 stage blocks. that really sped it up and kept the pump from kicking down early. last thing i tried was elevating the chunk 2 inches off the base plate with blocks about 8 inches apart to get less pinching on the wedge. well that really sped the cycle time up and basically all my splitting is now done without having the pump kick down and normally everything is split using under 800 psi on my pressure gauge. i found the wedge is a great place to start if you are working on speeding up a low flow system. i used bearing brass for my slide block liners because plastics would not last when i took into account for off center stresses from knots and cross grain. this is what my final wedge looks like and there is a provision for the 4 way knife.\\nthis is the splitter. i used a winch for the loading platform to save money\\nhere you can see the log is slightly elevated. over 10 years i haven't encountered anything under 24 inches long i couldn't split. i have several videos about it splitting on my youtube channel.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 18225, "autor": "NeilB", "date": 1637366400000, "content": "('I took delivery of my Woodland Mills saw in January of 2013 and have spent many hours cutting and learning the sawmill. We have cut all types of trees from soft pine to very hard hickory and the saw has performed exactly as advertised. It is amazing the amount of lumber we have cut and now used as a result of this saw. There is a learning curve needed to install the unit and to properly operate the saw. All my friends tell me, if I can do it, then anyone can, they cannot believe how this saw has enabled me to use all types of trees from my farm that otherwise I would never be able to do. We just completed building a barn that we only used wood from my farm. Here are a few pictures of our operation.\\nFrom the start I knew getting the logs up on the cutting rails would be a chore, so I designed a simple lift system to be used on my tractor. Easy to build and I have been able to lift huge logs on the rails and never actually touch the logs. Basically we added extension arms to the lift arms of my tractor along with chains and hooks. It took about an hour to weld together and cost zero, as we just used some scrape angle iron with already had.\\nI would recommend the Woodland Mills sawmill to anyone wanting this type of operation for a personal sawmill. And can not say enough about the staff on giving me advice and more when I needed it from the company at any time.\\nThe barn I just completed used 4 types of wood. Cedar for the post, sycamore and hickory for the beams, sycamore and oak for the side boards and pine for the ceiling joist. Fun building it and all the wood was cut with the Woodland Sawmill. This one barn almost paid for my sawmill. Now we are working on a suspension bridge using white oak for the entire bridge. I will send pictures of this bridge as we go along.\\nRandy\\nTennessee',)", "link": "('https://forestryforum.com/board/index.php?topic=68496.msg1028065#msg1028065',)", "origin": "Forestry", "suborigin": "Woodland Mills", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "('i took delivery of my woodland mills saw in january of 2013 and have spent many hours cutting and learning the sawmill. we have cut all types of trees from soft pine to very hard hickory and the saw has performed exactly as advertised. it is amazing the amount of lumber we have cut and now used as a result of this saw. there is a learning curve needed to install the unit and to properly operate the saw. all my friends tell me, if i can do it, then anyone can, they cannot believe how this saw has enabled me to use all types of trees from my farm that otherwise i would never be able to do. we just completed building a barn that we only used wood from my farm. here are a few pictures of our operation.\\nfrom the start -----> i !!!  knew getting the logs up on the cutting rails would be a chore, so -----> i !!!  -----> designed !!!  a simple lift system to be used on my tractor. easy to build and i have been able to lift huge logs on the rails and never actually touch the logs. basically we added extension arms to the lift arms of my tractor along with chains and hooks. it took about an hour to weld together and cost zero, as we just used some scrape angle iron with already had.\\ni would recommend the woodland mills sawmill to anyone wanting this type of operation for a personal sawmill. and can not say enough about the staff on giving me advice and more when i needed it from the company at any time.\\nthe barn i just completed used 4 types of wood. cedar for the post, sycamore and hickory for the beams, sycamore and oak for the side boards and pine for the ceiling joist. fun building it and all the wood was cut with the woodland sawmill. this one barn almost paid for my sawmill. now we are working on a suspension bridge using white oak for the entire bridge. i will send pictures of this bridge as we go along.\\nrandy\\ntennessee',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000034, "year": "2021"}], "name": "design2021"}