{"interestingcomments": [{"Unnamed: 0": 15473, "autor": "Arborwear", "date": 1637366400000, "content": "('Quote from: Southside logger on March 08, 2018, 12:28:25 AM\\nArborwear, you can find their link at the top left of the page - they are one of the Forestry Forum Sponsors and make excellent apparel.\\n@Southside logger , thanks for the kind words and for letting others know about Arborwear. We appreciate it! @wcarter , your wife may like our Safety Green Arborwear RAC Chaps (the only chainsaw chaps with replaceable straps) which are adjustable to various leg sizes and shapes and comfortable enough for all day wear. Those are currently available our website. This summer, we will be introducing our first Chainsaw Pants, a result of years of research, customer feedback, and field testing to include features to maximize comfort, mobility, and safety. These Pants will be available in Coal (a dark gray color) and come in standard waist and length sizes to take the guesswork out of finding the right fit.',)", "link": "('https://www.arborwear.com/products/racchaps',)", "origin": "Forestry", "suborigin": "Axe Woman Fan Forum", "result": true, "Selector": "we will be introducing", "selectorShort": "introduce", "MarkedSent": "('quote from: southside logger on march 08, 2018, 12:28:25 am\\narborwear, you can find their link at the top left of the page - they are one of the forestry forum sponsors and make excellent apparel.\\n@southside logger , thanks for the kind words and for letting others know about arborwear. we appreciate it! @wcarter , your wife may like our safety green arborwear rac chaps (the only chainsaw chaps with replaceable straps) which are adjustable to various leg sizes and shapes and comfortable enough for all day wear. those are currently available our website. this summer, -----> we !!!  -----> will !!!  -----> be !!!  -----> introducing !!!  our first chainsaw pants, a result of years of research, customer feedback, and field testing to include features to maximize comfort, mobility, and safety. these pants will be available in coal (a dark gray color) and come in standard waist and length sizes to take the guesswork out of finding the right fit.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000019, "year": "2021"}, {"Unnamed: 0": 15573, "autor": "Alissa", "date": 1637366400000, "content": "(\"The first lady I want to introduce to you is Laurette. Many of you that attended the Pig Roast already met her.\\nLaurette lives in Maine and has been competing professionally in timber sports for over 10 years. She joined the Axe Women last year and began traveling with us. She's an all around excellent competitor, and past champion in axe throwing and fire building.\",)", "link": "('https://forestryforum.com/board/index.php?topic=78858.msg1199692#msg1199692',)", "origin": "Forestry", "suborigin": "Axe Woman Fan Forum", "result": true, "Selector": "i want to introduce", "selectorShort": "introduce", "MarkedSent": "(\"the first lady -----> i !!!  -----> want !!!  -----> to !!!  -----> introduce !!!  -----> to !!!  you is laurette. many of you that attended the pig roast already met her.\\nlaurette lives in maine and has been competing professionally in timber sports for over 10 years. she joined the axe women last year and began traveling with us. she's an all around excellent competitor, and past champion in axe throwing and fire building.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000019, "year": "2021"}], "name": "introduce2021"}