{"interestingcomments": [{"Unnamed: 0": 5368, "autor": "Real1shepherd", "date": 1637366400000, "content": "(\"Quote from: quadrider550 on December 09, 2021, 09:07:04 AM\\nQuote from: 421Altered on December 08, 2021, 09:34:38 PM\\nQuad, might want to go see an patent attorney asap! First, I would check with the u s. patent office and see if there is already a patent issued for something like this. I invented, or so I thought, a great thing, until I checked online with the patent office. I was about 6 months too late!!\\nI've done some searching on the U.S. Patent Office website and found nothing. I'm trying to see how much interest there is for such a device otherwise it's a moot point. Thanks.\\nI have three things I invented. I've been told it will cost thousands to search and apply for patents. That's put me off all these yrs. One is really tricky and aimed @kids and the other two are tool inventions.\\nWe live in a battlefield of cheaters, liars, thieves and copycats.\\nKevin\",)", "link": "('https://forestryforum.com/board/index.php?topic=117305.msg1867609#msg1867609',)", "origin": "Forestry", "suborigin": "Chainsaws", "result": true, "Selector": "i invented", "selectorShort": "invent", "MarkedSent": "(\"quote from: quadrider550 on december 09, 2021, 09:07:04 am\\nquote from: 421altered on december 08, 2021, 09:34:38 pm\\nquad, might want to go see an patent attorney asap! first, i would check with the u s. patent office and see if there is already a patent issued for something like this. -----> i !!!  -----> invented !!! , or so -----> i !!!  thought, a great thing, until -----> i !!!  checked online with the patent office. i was about 6 months too late!!\\ni've done some searching on the u.s. patent office website and found nothing. i'm trying to see how much interest there is for such a device otherwise it's a moot point. thanks.\\ni have three things i invented. i've been told it will cost thousands to search and apply for patents. that's put me off all these yrs. one is really tricky and aimed @kids and the other two are tool inventions.\\nwe live in a battlefield of cheaters, liars, thieves and copycats.\\nkevin\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000007, "year": "2021"}, {"Unnamed: 0": 7400, "autor": "stavebuyer", "date": 1637366400000, "content": "('Quote from: mudfarmer on January 31, 2021, 09:53:35 AM\\n@stavebuyer would would you buy and use an H or 8N if it was converted to run on electricity? It would be the same machine mechanically that you loved, just quieter, no exhaust, more torque.\\n@mike_belben how about you? Your gas skid steer that you hate the engine in, without the gas engine you hate?\\nThese discussions always get off into the weeds about computers, technology, difficulty to fix, I tried to bring it up in the other thread but it really doesn’t have to be that way. We invented the electric motor in 1834! Diesel in 1890s? Electric motors are solid, proven robust technology. They have been running our industries for years and years.\\nIt seems like the actual problem that most people have is batteries and how we will charge them? (Ignoring of course all the emotional responses about freedom, job displacement, etc) Battery tech is very good now, but needs to get better and to me that better is less rare earth minerals. Otherwise we have pretty much nailed it and lithium batteries are crazy good and only getting better.\\nI have an allis chalmers that is better suited than the 8N for conversion because it has a full frame instead of the engine being structural. If this guy comes through with a good deal on batteries it will go under the knife for a conversion and folks can call me a blasphemer a hippy a nut job or tell me it is going to break and won’t work but those are emotional responses. We have electric vehicles, they are here. Check out some of the DIY conversions out there. Rock crawlers, boats, cars, tractors, ATVs, you name it there is already somebody building it in their garage or back yard. Folks can say all they want that they don’t want to pay a million dollars for computer controlled junk they can’t work on and have to pay a tech, but they have been doing it for years and I just scratch my head because that is already where we are if you are buying a new machine you can’t escape it. Even chainsaws get taken to the dealer and plugged in now for diagnostics!! No I do not like that or agree with it and that is why I run 041, 359, 346xp.\\nThe mindset of conversion keeps your favorite old dino burner going, it is the same machine you just did an engine swap. An EASY engine swap!\\nExpand Quote\\nI have lots of battery tools and an off grid cabin with a solar electric set-up that I also wired for a gas generator. I have owned plenty of obsolete battery tools that I discarded because they are useless after a few years. Electric forklifts in a warehouse are the cats meow; but at my farm with no prospect of running electric lines that I don\\'t want on my land; the water is crystal clear but practical electric not so much. Two 5 gal jugs of dino juice will run my tractor or generator all weekend. How much is a solar/battery setup to recharge my tractor overnight when I am not using it going to cost? Where are all the panels and batteries to go after they are junk in 5 years? I already know the answer. You eliminate me and my independence from the face of the earth under the mantle of progress. The sad part is it will end just like the paper vs plastic bags fiasco. I lose and and so do you. All the switching to bury oil and then to discover you created worse problems you never knew existed from unintended and unknown consequences. I may be an uneducated idiot but I understand the concept that there is no such thing as a free lunch. People aren\\'t nearly as clever as they think themselves to be.\\nThe non-fossil fuel electric production does not exist to run the current \"fluff load\" of house lighting and tv sets. How are you going power all the heavy lifting done with diesel equipment in fifteen years on top of that. This is going to be an unmitigated disaster of biblical proportion when everything you own and depend upon to exist is tied to a grid that is shutdown like California. Count me out.',)", "link": "('javascript:void(0);',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "we invented", "selectorShort": "invent", "MarkedSent": "('quote from: mudfarmer on january 31, 2021, 09:53:35 am\\n@stavebuyer would would you buy and use an h or 8n if it was converted to run on electricity? it would be the same machine mechanically that you loved, just quieter, no exhaust, more torque.\\n@mike_belben how about you? your gas skid steer that you hate the engine in, without the gas engine you hate?\\nthese discussions always get off into the weeds about computers, technology, difficulty to fix, i tried to bring it up in the other thread but it really doesn’t have to be that way. -----> we !!!  -----> invented !!!  the electric motor in 1834! diesel in 1890s? electric motors are solid, proven robust technology. they have been running our industries for years and years.\\nit seems like the actual problem that most people have is batteries and how we will charge them? (ignoring of course all the emotional responses about freedom, job displacement, etc) battery tech is very good now, but needs to get better and to me that better is less rare earth minerals. otherwise we have pretty much nailed it and lithium batteries are crazy good and only getting better.\\ni have an allis chalmers that is better suited than the 8n for conversion because it has a full frame instead of the engine being structural. if this guy comes through with a good deal on batteries it will go under the knife for a conversion and folks can call me a blasphemer a hippy a nut job or tell me it is going to break and won’t work but those are emotional responses. we have electric vehicles, they are here. check out some of the diy conversions out there. rock crawlers, boats, cars, tractors, atvs, you name it there is already somebody building it in their garage or back yard. folks can say all they want that they don’t want to pay a million dollars for computer controlled junk they can’t work on and have to pay a tech, but they have been doing it for years and i just scratch my head because that is already where we are if you are buying a new machine you can’t escape it. even chainsaws get taken to the dealer and plugged in now for diagnostics!! no i do not like that or agree with it and that is why i run 041, 359, 346xp.\\nthe mindset of conversion keeps your favorite old dino burner going, it is the same machine you just did an engine swap. an easy engine swap!\\nexpand quote\\ni have lots of battery tools and an off grid cabin with a solar electric set-up that i also wired for a gas generator. i have owned plenty of obsolete battery tools that i discarded because they are useless after a few years. electric forklifts in a warehouse are the cats meow; but at my farm with no prospect of running electric lines that i don\\'t want on my land; the water is crystal clear but practical electric not so much. two 5 gal jugs of dino juice will run my tractor or generator all weekend. how much is a solar/battery setup to recharge my tractor overnight when i am not using it going to cost? where are all the panels and batteries to go after they are junk in 5 years? i already know the answer. you eliminate me and my independence from the face of the earth under the mantle of progress. the sad part is it will end just like the paper vs plastic bags fiasco. i lose and and so do you. all the switching to bury oil and then to discover you created worse problems you never knew existed from unintended and unknown consequences. i may be an uneducated idiot but i understand the concept that there is no such thing as a free lunch. people aren\\'t nearly as clever as they think themselves to be.\\nthe non-fossil fuel electric production does not exist to run the current \"fluff load\" of house lighting and tv sets. how are you going power all the heavy lifting done with diesel equipment in fifteen years on top of that. this is going to be an unmitigated disaster of biblical proportion when everything you own and depend upon to exist is tied to a grid that is shutdown like california. count me out.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}], "name": "invent2021"}