{"interestingcomments": [{"Unnamed: 0": 123, "autor": "Good Feller", "date": 1637366400000, "content": "('Well I grew up in town so I was a city kid for the first 13 years of my life,,unfortunately. My parents ended up building a home on 80 acres out in the country and that\\'s when I got into fishing, hunting, and especially trapping. By the age of 18 I realized I didn\\'t even know how to run a chainsaw... worthless! My first saw was a poulan wood shark. A walmart special. I had no idea how to maintain it. I just ran it,, all the time. I cut a lot of hedge posts with it. A few years later I went off to Iowa State to major in forestry. Best decision I ever made! After I started school I remember walking through our timber and seeing a 22\" dbh red oak(with about 20ft of straight log) that had just died. I thought boy that would be a shame to just let it rot. So I got out the 14\" poulan wood shark. I used an entire tank of gas cutting it down. Whittled at it from all sides. Now that I think back ,,,, how freaking dangerous!!! Guess that\\'s how you learn though. Once I got it cut down I had no way to get it out of the steep ravine. I used a come along to winch both logs inch by inch to the landing .... I got $103 dollars for those logs.\\nToday I own a MS 460 and a 455 husky,,,, and oh yeah, I liked that first wood shark so much I bought a second one. It\\'s good for small stuff and fits in the 4 wheeler. I love running saws. Everywhere I go I try to identify trees and also think to myself how I would go about cutting them down! I took the game of logging course in Missouri last year.',)", "link": "('https://forestryforum.com/board/index.php?topic=32057.msg466264#msg466264',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i ever made", "selectorShort": "make", "MarkedSent": "('well i grew up in town so i was a city kid for the first 13 years of my life,,unfortunately. my parents ended up building a home on 80 acres out in the country and that\\'s when i got into fishing, hunting, and especially trapping. by the age of 18 i realized i didn\\'t even know how to run a chainsaw... worthless! my first saw was a poulan wood shark. a walmart special. i had no idea how to maintain it. i just ran it,, all the time. i cut a lot of hedge posts with it. a few years later i went off to iowa state to major in forestry. best decision -----> i !!!  -----> ever !!!  -----> made !!! ! after i started school i remember walking through our timber and seeing a 22\" dbh red oak(with about 20ft of straight log) that had just died. i thought boy that would be a shame to just let it rot. so i got out the 14\" poulan wood shark. i used an entire tank of gas cutting it down. whittled at it from all sides. now that i think back ,,,, how freaking dangerous!!! guess that\\'s how you learn though. once i got it cut down i had no way to get it out of the steep ravine. i used a come along to winch both logs inch by inch to the landing .... i got $103 dollars for those logs.\\ntoday i own a ms 460 and a 455 husky,,,, and oh yeah, i liked that first wood shark so much i bought a second one. it\\'s good for small stuff and fits in the 4 wheeler. i love running saws. everywhere i go i try to identify trees and also think to myself how i would go about cutting them down! i took the game of logging course in missouri last year.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 268, "autor": "pine", "date": 1637366400000, "content": "(\"Congratulations! The NRCS grants for those purposes can be quite helpful.\\nI had/have one for some forestry property that was the subject of storm damage.\\nI looked into hiring a company that I had used a couple of years ago and they were so booked that I gave up. Looked around for others and rentals like you. There are different construction companies that have them but have no idea how to do a NRCS prescription.\\nI live in a completely different part of the US (so different that sometime it is hard to believe we are in the same country) so things might not be comparable. If the Landry rental center lead does not pan out try the local CAT rental center. Here they are named NC CAT Rental Store. On line search shows you have them near Wareham and Milford. http://www.catrentalstore.com/\\nVery reasonable (depending upon your definition of reasonable) rates. Rented a 299D-XHP and a Cat 315 mulcher. I have a really rough area with lots of debris and was quite surprised at how effective it did the job.\\nWe were so pleased that after a week of use we have made the decision to purchase a unit (they are not cheap). Between the mastication capability for forestry prescriptions and the addition lift capability for timbers and work around the mill that my tractor can't handle we justified it. The local NRCS forester and the county forester when they found out we were getting one immediately said they had folks that were looking for the service just like you because the big guys did not want to bid on projects of your size.\\nNot knowing your situation, but if you can't find the resource there are most likely others in the same bucket. Depending upon your work status and finances, if you purchased you might be able to do what you want for your property and then slowly amortize off the equipment doing work for others that need your services.\\nProbably not for you but is at least worth considering/thinking about before discarding as not viable.\\nThe rental is quite viable however and I would encourage you to do it.\",)", "link": "('http://www.catrentalstore.com/',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "we have made", "selectorShort": "make", "MarkedSent": "(\"congratulations! the nrcs grants for those purposes can be quite helpful.\\ni had/have one for some forestry property that was the subject of storm damage.\\ni looked into hiring a company that i had used a couple of years ago and they were so booked that i gave up. looked around for others and rentals like you. there are different construction companies that have them but have no idea how to do a nrcs prescription.\\ni live in a completely different part of the us (so different that sometime it is hard to believe we are in the same country) so things might not be comparable. if the landry rental center lead does not pan out try the local cat rental center. here they are named nc cat rental store. on line search shows you have them near wareham and milford. http://www.catrentalstore.com/\\nvery reasonable (depending upon your definition of reasonable) rates. rented a 299d-xhp and a cat 315 mulcher. i -----> have !!!  a really rough area with lots of debris and was quite surprised at how effective it did the job.\\nwe were so pleased that after a week of use -----> we !!!  -----> have !!!  -----> made !!!  the decision to purchase a unit (they are not cheap). between the mastication capability for forestry prescriptions and the addition lift capability for timbers and work around the mill that my tractor can't handle we justified it. the local nrcs forester and the county forester when they found out we were getting one immediately said they had folks that were looking for the service just like you because the big guys did not want to bid on projects of your size.\\nnot knowing your situation, but if you can't find the resource there are most likely others in the same bucket. depending upon your work status and finances, if you purchased you might be able to do what you want for your property and then slowly amortize off the equipment doing work for others that need your services.\\nprobably not for you but is at least worth considering/thinking about before discarding as not viable.\\nthe rental is quite viable however and i would encourage you to do it.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 450, "autor": "Wudman", "date": 1637366400000, "content": "('Some days you just need to call it quits. Today was one of those. I rented a plug core aerator to overseed my crabgrass (some folks call it a lawn - but mine is nothing but crabgrass at the moment.) First off, my 4-wheeler wouldn\\'t start. See \"Dang Chinese Carburetors\" in the General Board for that story. Well, I\\'ll pull it with my lawnmower. The Craftsman didn\\'t want much to do with it, but I drained some water out of the ballast tank and commenced to work. After about 20 minutes I came to a halt. Looked down......that high quality Chinese tube that I put in the rear tire last year had belched the valve stem. Went inside and called Dad. \"Is your 4 -wheeler running?\" \"Nope - got it back from the shop and it ran for about 2 weeks and it\\'s dead again.\" This is a Yamaha that has been a pain from the day he bought it. It has spent more time at the dealership than on the farm. Anyway......scratching my head......I\\'ll pull it with the Fordson Dexta......a little overkill for a 4 foot plug core but it got the job done. Now I need to put out seed and fertilizer. I\\'ll run to town and get a tube for the tire (while waiting on a new carb for my 4 wheeler). So I run to town. It\\'s a 30 minute trip for me. Drop in the local Tractor Supply and pick up a new tube for the lawnmower. Guess I should get a new tire, but it costs more than my lawnmower is worth. I come back out the door and the local Cub Scout pack hits me up for money. They are selling popcorn and peanuts. I didn\\'t have any cash. No problem.....he said we can take a credit card. Ok, \"How much is this bag of Caramel Popcorn?\" \"Twenty -five dollars comes the reply.\" DANG. It\\'s the Cub Scouts so I made a contribution. Came on home to put the tube in my tire. Opened the sealed box and pull out the tube. It is already cracked in the folds where it was in the box, so I\\'m back to square one. My sister told me the other day that she had a limb down in her yard that was blocking her circle drive. I asked her son if I could pull it out of the way with the tractor. He said yeah.....the tractor could pull it. I head up there with the tractor and chain. When I get there, the limb is about 12 inches in diameter and laid in the forks of a little maple tree in her yard. I didn\\'t want to destroy the maple so back to the house for the chainsaw. I cut the limb up and proceed to pull the brush out of the drive. I feel a burning sensation on my forearm. I thought it was a stinging caterpillar but I didn\\'t see him. Cleaned up the rest of the brush and went to stack the wood so Dad could come get it for firewood. I stepped in a yellow-jackets nest at the base of the maple and was promptly rewarded including one in the inside of my nose.......So, I\\'m quitting for the day. Just hope no planes fly over for a few hours. This bad Mojo needs to subside.\\nWudman',)", "link": "('https://forestryforum.com/board/index.php?topic=102352.msg1604095#msg1604095',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('some days you just need to call it quits. today was one of those. i rented a plug core aerator to overseed my crabgrass (some folks call it a lawn - but mine is nothing but crabgrass at the moment.) first off, my 4-wheeler wouldn\\'t start. see \"dang chinese carburetors\" in the general board for that story. well, i\\'ll pull it with my lawnmower. the craftsman didn\\'t want much to do with it, but i drained some water out of the ballast tank and commenced to work. after about 20 minutes i came to a halt. looked down......that high quality chinese tube that i put in the rear tire last year had belched the valve stem. went inside and called dad. \"is your 4 -wheeler running?\" \"nope - got it back from the shop and it ran for about 2 weeks and it\\'s dead again.\" this is a yamaha that has been a pain from the day he bought it. it has spent more time at the dealership than on the farm. anyway......scratching my head......i\\'ll pull it with the fordson dexta......a little overkill for a 4 foot plug core but it got the job done. now i need to put out seed and fertilizer. i\\'ll run to town and get a tube for the tire (while waiting on a new carb for my 4 wheeler). so i run to town. it\\'s a 30 minute trip for me. drop in the local tractor supply and pick up a new tube for the lawnmower. guess i should get a new tire, but it costs more than my lawnmower is worth. i come back out the door and the local cub scout pack hits me up for money. they are selling popcorn and peanuts. i didn\\'t have any cash. no problem.....he said we can take a credit card. ok, \"how much is this bag of caramel popcorn?\" \"twenty -five dollars comes the reply.\" dang. it\\'s the cub scouts so -----> i !!!  -----> made !!!  a contribution. came on home to put the tube in my tire. opened the sealed box and pull out the tube. it is already cracked in the folds where it was in the box, so i\\'m back to square one. my sister told me the other day that she had a limb down in her yard that was blocking her circle drive. i asked her son if i could pull it out of the way with the tractor. he said yeah.....the tractor could pull it. i head up there with the tractor and chain. when i get there, the limb is about 12 inches in diameter and laid in the forks of a little maple tree in her yard. i didn\\'t want to destroy the maple so back to the house for the chainsaw. i cut the limb up and proceed to pull the brush out of the drive. i feel a burning sensation on my forearm. i thought it was a stinging caterpillar but i didn\\'t see him. cleaned up the rest of the brush and went to stack the wood so dad could come get it for firewood. i stepped in a yellow-jackets nest at the base of the maple and was promptly rewarded including one in the inside of my nose.......so, i\\'m quitting for the day. just hope no planes fly over for a few hours. this bad mojo needs to subside.\\nwudman',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 460, "autor": "mike_belben", "date": 1637366400000, "content": "(\"Well then dont take this the wrong way, but Im actually a pretty good mechanic (i have to be to have gotten this far on this little) and you guys may not actually grasp what youre lookin at.\\nThe filter had an incorrect cold bypass valve in it that kept jamming in its seat crooked, and the filter must have been on for ages. Its a cobbled together splitter i got in a trade. I couldnt make any sense of the numbers to even know what micron and the plan was to go through it and make changes when i get my next container hauled down. Ive built plenty of filtration systems and have shelves of parts in massachusetts. Return pressure blew the unit apart, not tightening. Now is the critical time to split wood, not worry about wearing out equipment thats sposta keep me from wearing out. Filter deleted for now, wood getting split. Its how i survive.\\nThe hoof governors are ancient and huge money.. Whoever has the reman parts isnt making them easy to find. So the oil oozes out, the front bearing scatters and the flyweights can opener the housing in a minute or so. It was only on there to tension the waterpump, it wasnt controlling the throttle. I tossed it and put a mower belt idler on. One hour fix. I wasnt gonna throw $800 at a junk bobcat, i aim to use up every drop of that machine.\\nThe dozer had a brand new solenoid full of corrosion, so the brazilians who made it could save 2 pesos by not using any dielectric grease inside. It was welding itself from corrosion induced arcing. Stuck starters cause fires. I unsoldered the end cap and fixed it right. Crazy fast starts again. That komatsu 6's must have no pump advance at all.\\nI didnt put chain on the bobcat tire to hold it together, the chains were on for traction. But it was a burnt machine that i rebuilt cheap and the tops were weak from the fire. i drive on concrete demo and rebar all day with it. No tire likes that. Have another set of foam filled street tires that just wont go in my clay so i have to make OTT tracks and swap them on soon. But id rather abuse the foam off these rims then have to cut it. I got enough on my plate already!\\nSpeaking of tires, i blew 11 this summer on road. Since 2015 ive probably blown 30 to 40, maybe more. Im pretty good with levers and ether.\",)", "link": "('https://forestryforum.com/board/index.php?topic=102352.msg1606233#msg1606233',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i couldnt make", "selectorShort": "make", "MarkedSent": "(\"well then dont take this the wrong way, but im actually a pretty good mechanic (i have to be to have gotten this far on this little) and you guys may not actually grasp what youre lookin at.\\nthe filter had an incorrect cold bypass valve in it that kept jamming in its seat crooked, and the filter must have been on for ages. its a cobbled together splitter i got in a trade. -----> i !!!  -----> could !!! -----> nt !!!  -----> make !!!  any sense of the numbers to even know what micron and the plan was to go through it and -----> make !!!  changes when -----> i !!!  get my next container hauled down. ive built plenty of filtration systems and have shelves of parts in massachusetts. return pressure blew the unit apart, not tightening. now is the critical time to split wood, not worry about wearing out equipment thats sposta keep me from wearing out. filter deleted for now, wood getting split. its how i survive.\\nthe hoof governors are ancient and huge money.. whoever has the reman parts isnt making them easy to find. so the oil oozes out, the front bearing scatters and the flyweights can opener the housing in a minute or so. it was only on there to tension the waterpump, it wasnt controlling the throttle. i tossed it and put a mower belt idler on. one hour fix. i wasnt gonna throw $800 at a junk bobcat, i aim to use up every drop of that machine.\\nthe dozer had a brand new solenoid full of corrosion, so the brazilians who made it could save 2 pesos by not using any dielectric grease inside. it was welding itself from corrosion induced arcing. stuck starters cause fires. i unsoldered the end cap and fixed it right. crazy fast starts again. that komatsu 6's must have no pump advance at all.\\ni didnt put chain on the bobcat tire to hold it together, the chains were on for traction. but it was a burnt machine that i rebuilt cheap and the tops were weak from the fire. i drive on concrete demo and rebar all day with it. no tire likes that. have another set of foam filled street tires that just wont go in my clay so i have to make ott tracks and swap them on soon. but id rather abuse the foam off these rims then have to cut it. i got enough on my plate already!\\nspeaking of tires, i blew 11 this summer on road. since 2015 ive probably blown 30 to 40, maybe more. im pretty good with levers and ether.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 797, "autor": "TxTIG", "date": 1637366400000, "content": "(\"Wanted to say thank you for accepting me into the forum! Am a new member and just about ready to come full circle back into the world of sawmilling. Mid 1980's I was a pipe fitter for the gas utility and needed some logs milled. They were quite large and I didn't have the means to take them to the stationary mill. Saw an ad in the paper for a fellow that came on site with a portable mill. Had him come out to the house and got my logs cut into some lumber that I could use in woodworking.\\nLater that year I heard that he had quit custom sawing to work on his door making business. Talked with my wife and decided to buy a Woodmizer LT30 so I could cut our own lumber and do some custom work. It was only a 4 week wait (not like the 75 weeks I have to wait now) until the mill was ready. Thru word of mouth I was custom cutting every weekend and the mill was paid for in 9 months. Decided to upgrade to the LT40 with hydraulic log loader and rapidly paid for it. At this time I also bought a solar kiln to custom dry customer and my own lumber.\\nI was into year 6 working at the utility with no job upgrades for years as the company was struggling with poor upper management decisions and when people retired they did not replace them. Although I was making decent money and had the sawmill booked 4 months in advance I decided to pursue a life long dream, to become an airline pilot. The money I had made with the sawmill gave me the freedom to quit my job and financed my schooling.\\nI got all my ratings and flight time but never made it to the major airlines (I didn't have a college degree) so I found my way into corporate aviation. I've had a good run and been all over the world in my job, but the downside to corporate aviation is when money is tight at the corporation the first thing cut is the airplane and I've been thru 4 different operations since 1996. Although I've saved for retirement (401K) due to losing a year every time I have to start a new job and an expensive divorce where the ex received 50% of my 401K, my retirement plan is to keep working after I turn 65 and can no longer be pilot in command for International travel.\\nLuckily I'm in good health (so far) and enjoy being productive. During my corporate years I've been fortunate to have had plenty of time away from work and expanded my skillset. Up until the divorce I had several pieces of heavy equipment (Excavator, dozer, backhoe, lowboy) and would clear land, dig stock tanks, roads etc. but that had to be sold and I don't feel like taking on huge debt to buy more equipment. I took evening classes at the community college and learned HVAC work, eventually passing my master mechanical contractor license exams in 1996 and still hold my contractor license but getting up in hot attics in the Texas summers is less and less appealing to me as I get older. Additionally now there is an air conditioner supply shortage and the only contractors who are able to get equipment are the large outfits who buy hundreds of thousands of $ every year.\\nOrdered my Woodmizer mill in August with delivery time estimate of 75 weeks. If it takes longer I'm patient as I can't go full time anyway for 3 more years when the govt. declares I'm too old. Adding some vintage photos ofme 30+ years ago. Thirty years ago I'd look up at the contrails wishing I was up there and now I look down wanting to be out there sawing some wood.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117254.msg1865723#msg1865723',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i was making", "selectorShort": "make", "MarkedSent": "(\"wanted to say thank you for accepting me into the forum! am a new member and just about ready to come full circle back into the world of sawmilling. mid 1980's i was a pipe fitter for the gas utility and needed some logs milled. they were quite large and i didn't have the means to take them to the stationary mill. saw an ad in the paper for a fellow that came on site with a portable mill. had him come out to the house and got my logs cut into some lumber that i could use in woodworking.\\nlater that year i heard that he had quit custom sawing to work on his door making business. talked with my wife and decided to buy a woodmizer lt30 so i could cut our own lumber and do some custom work. it was only a 4 week wait (not like the 75 weeks i have to wait now) until the mill was ready. thru word of mouth i was custom cutting every weekend and the mill was paid for in 9 months. decided to upgrade to the lt40 with hydraulic log loader and rapidly paid for it. at this time i also bought a solar kiln to custom dry customer and my own lumber.\\ni was into year 6 working at the utility with no job upgrades for years as the company was struggling with poor upper management decisions and when people retired they did not replace them. although -----> i !!!  -----> was !!!  -----> making !!!  decent money and had the sawmill booked 4 months in advance -----> i !!!  decided to pursue a life long dream, to become an airline pilot. the money i had made with the sawmill gave me the freedom to quit my job and financed my schooling.\\ni got all my ratings and flight time but never made it to the major airlines (i didn't have a college degree) so i found my way into corporate aviation. i've had a good run and been all over the world in my job, but the downside to corporate aviation is when money is tight at the corporation the first thing cut is the airplane and i've been thru 4 different operations since 1996. although i've saved for retirement (401k) due to losing a year every time i have to start a new job and an expensive divorce where the ex received 50% of my 401k, my retirement plan is to keep working after i turn 65 and can no longer be pilot in command for international travel.\\nluckily i'm in good health (so far) and enjoy being productive. during my corporate years i've been fortunate to have had plenty of time away from work and expanded my skillset. up until the divorce i had several pieces of heavy equipment (excavator, dozer, backhoe, lowboy) and would clear land, dig stock tanks, roads etc. but that had to be sold and i don't feel like taking on huge debt to buy more equipment. i took evening classes at the community college and learned hvac work, eventually passing my master mechanical contractor license exams in 1996 and still hold my contractor license but getting up in hot attics in the texas summers is less and less appealing to me as i get older. additionally now there is an air conditioner supply shortage and the only contractors who are able to get equipment are the large outfits who buy hundreds of thousands of $ every year.\\nordered my woodmizer mill in august with delivery time estimate of 75 weeks. if it takes longer i'm patient as i can't go full time anyway for 3 more years when the govt. declares i'm too old. adding some vintage photos ofme 30+ years ago. thirty years ago i'd look up at the contrails wishing i was up there and now i look down wanting to be out there sawing some wood.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 1098, "autor": "bill m", "date": 1637366400000, "content": "('I think you would be better off with a hydraulic motor to power that winch. Worm gear winches get their braking from the gears so even though the input shaft turns easy with the pto out of gear the drum will not want to spin the input shaft backwards. You may end up stripping teeth if you try to unspool with the cable. I have made 2 tractor winches but I use hydraulic planetary winches. This picture is the first one I made about 8 years ago.\\nThe next picture is the one I made last spring.',)", "link": "('https://forestryforum.com/board/index.php?topic=47210.msg678256#msg678256',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "('i think you would be better off with a hydraulic motor to power that winch. worm gear winches get their braking from the gears so even though the input shaft turns easy with the pto out of gear the drum will not want to spin the input shaft backwards. you may end up stripping teeth if you try to unspool with the cable. -----> i !!!  -----> have !!!  -----> made !!!  2 tractor winches but -----> i !!!  use hydraulic planetary winches. this picture is the first one i made about 8 years ago.\\nthe next picture is the one i made last spring.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 1152, "autor": "thecfarm", "date": 1637366400000, "content": "(\"I use bar and chain oil jugs for my gas too. They will get a hole in them after a few months.\\nI run 6 slides on my winch. I haul out a lot of small stuff. If I need 6 that is good, I only use one, because it's a big one,that is fine too. I made up some 4 foot chains for the small stuff. Much easier to only have to pull 2 feet of chain through a chocker,instead of 6 feet of chains with my 8 foot chains.\\nI do hope the brakes work good. The 3pt winches on tractors have a blade that digs into to keep the tractor from being pulled towards the trees being winched in.\\nI think by an arch he means about 2 feet higher than your winch??\\nLike on my winch.\\nThis one might show it better.\\nThat top pulley is about 6 feet of the ground when I am winch something in.\\nFive feet wide is a good width. My 40hp power is 6 feet wide. hard to sneak through the woods. I have to cut roads for it. The wife's 30hp,is only 5 feet wide. That is not in the woods much, but it's easier to get though the woods with hers.\",)", "link": "('https://forestryforum.com/board/index.php?topic=86106.msg1320996#msg1320996',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "(\"i use bar and chain oil jugs for my gas too. they will get a hole in them after a few months.\\ni run 6 slides on my winch. i haul out a lot of small stuff. if i need 6 that is good, i only use one, because it's a big one,that is fine too. -----> i !!!  -----> made !!!  up some 4 foot chains for the small stuff. much easier to only have to pull 2 feet of chain through a chocker,instead of 6 feet of chains with my 8 foot chains.\\ni do hope the brakes work good. the 3pt winches on tractors have a blade that digs into to keep the tractor from being pulled towards the trees being winched in.\\ni think by an arch he means about 2 feet higher than your winch??\\nlike on my winch.\\nthis one might show it better.\\nthat top pulley is about 6 feet of the ground when i am winch something in.\\nfive feet wide is a good width. my 40hp power is 6 feet wide. hard to sneak through the woods. i have to cut roads for it. the wife's 30hp,is only 5 feet wide. that is not in the woods much, but it's easier to get though the woods with hers.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 3055, "autor": "DMcCoy", "date": 1637366400000, "content": "(\"I has assumed your area was more arid, with less brush. Looks similar to my place.\\nI started out with thick trees with lots of dead baby tree limbs. I want a mixed species forest. This is doug fir, (1) western hemlock, alder, a few big leaf maple and some 'brood mare' western red cedars I left after logging this area 20 or so years ago. The brush components I try and remove especially elderberry. There is a couple of cascara buckthorn- Rhamnus purshiana which can grow to 30' which I have left but it isn't considered a wood tree.\\nAn area of Alder I thinned and limbed. Adventitious bud growth happens with Alder, so the branch 'fuzz' is a maintenance issue.\\nMy wife has been trying to get me to buy a tractor grapple for years. I got one this year. I had to add 3rd function hydraulics to use it. I cannot stress how nice this is for clean up. Waited 5-6 mo. to get it but it is well built, US made and competitively priced.\\nI made the mistake once of leaving a skinny tree in an area I replanted, let it get bigger first was my thinking. My reprod grew up for about 15 yrs and I realized my skinny tree had grown wide with\\nlarge branches and getting it down would damage quit a few tops of the reprod. Fortunately I was able to winch it out backwards but I will never do that again.\\nI plan my areas to be logged complete a bit in a patchwork fashion so I have a mixed age forest. My acreage is small enough it will never be a source of primary income. To have repetitive small harvests is the timber portion of my decision making.\",)", "link": "('https://forestryforum.com/board/index.php?topic=116517.msg1848251#msg1848251',)", "origin": "Forestry", "suborigin": "Ask The Forester", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "(\"i has assumed your area was more arid, with less brush. looks similar to my place.\\ni started out with thick trees with lots of dead baby tree limbs. i want a mixed species forest. this is doug fir, (1) western hemlock, alder, a few big leaf maple and some 'brood mare' western red cedars i left after logging this area 20 or so years ago. the brush components i try and remove especially elderberry. there is a couple of cascara buckthorn- rhamnus purshiana which can grow to 30' which i have left but it isn't considered a wood tree.\\nan area of alder i thinned and limbed. adventitious bud growth happens with alder, so the branch 'fuzz' is a maintenance issue.\\nmy wife has been trying to get me to buy a tractor grapple for years. i got one this year. i had to add 3rd function hydraulics to use it. i cannot stress how nice this is for clean up. waited 5-6 mo. to get it but it is well built, -----> us !!!  -----> made !!!  and competitively priced.\\ni -----> made !!!  the mistake once of leaving a skinny tree in an area i replanted, let it get bigger first was my thinking. my reprod grew up for about 15 yrs and i realized my skinny tree had grown wide with\\nlarge branches and getting it down would damage quit a few tops of the reprod. fortunately i was able to winch it out backwards but i will never do that again.\\ni plan my areas to be logged complete a bit in a patchwork fashion so i have a mixed age forest. my acreage is small enough it will never be a source of primary income. to have repetitive small harvests is the timber portion of my decision making.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000004, "year": "2021"}, {"Unnamed: 0": 3875, "autor": "Iwawoodwork", "date": 1637366400000, "content": "('My mighty mite band mill came on an axle and the frame/track rail is all in one but the trailer you have is great, don\\'t change the height, put your mill right on top of the narrowed trailer frame rails, It looks to be about a good height now. The top of my saw rails are about 30\" and that is just fine for me. as stated earlier it is easier to sight along the cut and pull boards off at that height. Suggest making your trailer long enough that you can cut up to 20\\' (Think pole bldng posts) I can only cut 16\\' if the log is loaded perfect, so really 14\\' . I would make the trailer rails 24 to 26 feet and then make a pin on/slide in removeable tongue . At the back of my frame rails I did build a 30\" wide mesh platform between the rails where I have my tool box, grease guns, hammer, tape measure, squares and small saw. I built a winch post out of 4\"x4\" box tube and the top where the winch is mounted is about 8\\' about ground as I wanted lift to make moving/rolling the bigger logs easier. My winch post sits out from the frame about 6\" wider than the tire as I wanted the saw to pass by without having to take it down every time I needed to move a log or Cant, I do have power feed, so if you have power feed or plan on adding later keep the winch mount in mind.',)", "link": "('https://forestryforum.com/board/index.php?topic=116719.msg1852531#msg1852531',)", "origin": "Forestry", "suborigin": "Sawmills and Milling", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "('my mighty mite band mill came on an axle and the frame/track rail is all in one but the trailer you have is great, don\\'t change the height, put your mill right on top of the narrowed trailer frame rails, it looks to be about a good height now. the top of my saw rails are about 30\" and that is just fine for me. as stated earlier it is easier to sight along the cut and pull boards off at that height. suggest making your trailer long enough that you can cut up to 20\\' (think pole bldng posts) i can only cut 16\\' if the log is loaded perfect, so really 14\\' . -----> i !!!  -----> would !!!  -----> make !!!  the trailer rails 24 to 26 feet and then -----> make !!!  a pin on/slide in removeable tongue . at the back of my frame rails i did build a 30\" wide mesh platform between the rails where i have my tool box, grease guns, hammer, tape measure, squares and small saw. i built a winch post out of 4\"x4\" box tube and the top where the winch is mounted is about 8\\' about ground as i wanted lift to make moving/rolling the bigger logs easier. my winch post sits out from the frame about 6\" wider than the tire as i wanted the saw to pass by without having to take it down every time i needed to move a log or cant, i do have power feed, so if you have power feed or plan on adding later keep the winch mount in mind.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000005, "year": "2021"}, {"Unnamed: 0": 3953, "autor": "customsawyer", "date": 1637366400000, "content": "(\"That is actually the largest grapple rake I have found for a farm tractor/skidsteer. I have that one and two others for my skidsteers. The one in the picture is made by Work Saver and is the best one I have found but it is to tall to work on a skidsteer due to its height interfering with the doors. I had to weld in some bracing and added longer stroke cylinders so get it to close all the way. I got it in 2006 and have worked the devil out of it. I saw them this past year at the Ag show in Moultrie Ga. and they make a little shorter one for skidsteers but don't recommend this model for them. I think I could make it work as you would just have to tilt it forward to get in and out.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117275.msg1867682#msg1867682',)", "origin": "Forestry", "suborigin": "Sawmills and Milling", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "(\"that is actually the largest grapple rake i have found for a farm tractor/skidsteer. i have that one and two others for my skidsteers. the one in the picture is made by work saver and is the best one i have found but it is to tall to work on a skidsteer due to its height interfering with the doors. i had to weld in some bracing and added longer stroke cylinders so get it to close all the way. i got it in 2006 and have worked the devil out of it. i saw them this past year at the ag show in moultrie ga. and they make a little shorter one for skidsteers but don't recommend this model for them. -----> i !!!  think -----> i !!!  -----> could !!!  -----> make !!!  it work as you would just have to tilt it forward to get in and out.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000005, "year": "2021"}, {"Unnamed: 0": 4219, "autor": "KenMac", "date": 1637366400000, "content": "(\"Quote from: customsawyer on December 09, 2021, 06:12:12 AM\\nI'm going to bet you have more than $600.00 buck in the logs. I know when folks are doing these kind of tasks the don't factor in their time usually. However if you could have been running your sawmill instead of getting logs how much could you have made? I have yet to be able to go get logs, even free ones and come out as well as I can paying the tree surgeons to bring them to me. The OP's situation is unique because it is right across the property line.\\nI'm sure my situation is completely different than yours. I don't make my living at the sawmill. I saw part time mostly for my enjoyment. A big part of my enjoyment is meeting people and I also enjoy the process of fetching logs and clearing brush. At the time of this deal I had no pressing orders so I had the time to do the work. The $600 includes 2 trailer tires and 1 wheel, $150 for fuel and$160 for a helper 1 day. I did not include my time because I lost nothing in the process of fetching these logs and thoroughly enjoyed every minute if it.\\nIf this was my sole means of support and had employees to be concerned about, I would have to run my business very differently than I do. I hope I never get to that point. I'm certainly not saying that I'm financially well off, because that isn't so. I live within my means and that allows me to spend my time doing what I enjoy. The mill is profitable and supplies funds for truck and tractor upkeep and other needs, but doesn't pay me. All monies received goes through the books and pertinent taxes are paid to the proper agencies.\\nI'm really loving retirement.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117314.msg1867647#msg1867647',)", "origin": "Forestry", "suborigin": "Sawmills and Milling", "result": true, "Selector": "i don't make", "selectorShort": "make", "MarkedSent": "(\"quote from: customsawyer on december 09, 2021, 06:12:12 am\\ni'm going to bet you have more than $600.00 buck in the logs. i know when folks are doing these kind of tasks the don't factor in their time usually. however if you could have been running your sawmill instead of getting logs how much could you have made? i have yet to be able to go get logs, even free ones and come out as well as i can paying the tree surgeons to bring them to me. the op's situation is unique because it is right across the property line.\\ni'm sure my situation is completely different than yours. -----> i !!!  -----> do !!! -----> n't !!!  -----> make !!!  my living at the sawmill. i saw part time mostly for my enjoyment. a big part of my enjoyment is meeting people and i also enjoy the process of fetching logs and clearing brush. at the time of this deal i had no pressing orders so i had the time to do the work. the $600 includes 2 trailer tires and 1 wheel, $150 for fuel and$160 for a helper 1 day. i did not include my time because i lost nothing in the process of fetching these logs and thoroughly enjoyed every minute if it.\\nif this was my sole means of support and had employees to be concerned about, i would have to run my business very differently than i do. i hope i never get to that point. i'm certainly not saying that i'm financially well off, because that isn't so. i live within my means and that allows me to spend my time doing what i enjoy. the mill is profitable and supplies funds for truck and tractor upkeep and other needs, but doesn't pay me. all monies received goes through the books and pertinent taxes are paid to the proper agencies.\\ni'm really loving retirement.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000005, "year": "2021"}, {"Unnamed: 0": 5357, "autor": "quadrider550", "date": 1637366400000, "content": "('Hello everyone, I\\'m looking for some feedback here.\\nI have developed a chainsaw drill start system that I started as a fun project to see if I could make one for my Stihl MS660. Basically, it\\'s a direct flywheel cover replacement (made from another flywheel cover for my MS660) that houses the one way clutch with a hex shaft sticking out of the cover less than 1\" that can be turned with any 18-20v battery drill. I have a working prototype that makes starting my saw very easy and I have applied my design to the MS440, MS880 and 090 models but haven\\'t made them yet.\\nCold starting procedure is as follows:\\n1. Place saw on stable surface and apply chain break.\\n2. Place right hand on throttle and hold wide open (no choke or decompression used)\\n3. Use left hand to hold drill and engage hex shaft with socket and hold firmly.\\n4. Run drill full blast until saw starts.\\n5. Work throttle until RPM stabilizes.\\n6. Get \\'er done!!!\\nHot starting procedure:\\n1. Place saw on stable surface and apply chain break.\\n2. Place right hand on throttle handle and just hold saw steady.\\n3. Use left hand to hold drill and engage hex shaft with socket and hold firmly.\\n4. One quick full blast turn of the drill and fires back up.\\n5. Get back to it!!!\\nEveryone that I have shown this to says they want one.\\nWhat are all of your thoughts about such a device?',)", "link": "('https://forestryforum.com/board/index.php?topic=117305.msg1867183#msg1867183',)", "origin": "Forestry", "suborigin": "Chainsaws", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "('hello everyone, i\\'m looking for some feedback here.\\ni have developed a chainsaw drill start system that -----> i !!!  started as a fun project to see if -----> i !!!  -----> could !!!  -----> make !!!  one for my stihl ms660. basically, it\\'s a direct flywheel cover replacement (made from another flywheel cover for my ms660) that houses the one way clutch with a hex shaft sticking out of the cover less than 1\" that can be turned with any 18-20v battery drill. i have a working prototype that makes starting my saw very easy and i have applied my design to the ms440, ms880 and 090 models but haven\\'t made them yet.\\ncold starting procedure is as follows:\\n1. place saw on stable surface and apply chain break.\\n2. place right hand on throttle and hold wide open (no choke or decompression used)\\n3. use left hand to hold drill and engage hex shaft with socket and hold firmly.\\n4. run drill full blast until saw starts.\\n5. work throttle until rpm stabilizes.\\n6. get \\'er done!!!\\nhot starting procedure:\\n1. place saw on stable surface and apply chain break.\\n2. place right hand on throttle handle and just hold saw steady.\\n3. use left hand to hold drill and engage hex shaft with socket and hold firmly.\\n4. one quick full blast turn of the drill and fires back up.\\n5. get back to it!!!\\neveryone that i have shown this to says they want one.\\nwhat are all of your thoughts about such a device?',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000007, "year": "2021"}, {"Unnamed: 0": 5483, "autor": "Tom King", "date": 1637366400000, "content": "('I\\'m pretty good with a file, but I had some dirty stumps to cut off some trees that an Excavator took down. I didn\\'t want to use a good chain, so brought out some old ones. The first one would need more than 7 strokes per tooth with a file, so I decided to try the Dremel.\\nI was Surprised at how easy it was, and how good of a job it did. I don\\'t even know what type grinding \"wheel\" it was, or why I had ever bought it, but was the right size at 7/32, and in the Dremel toolbox.\\nJust judging tooth length by eye, it also surprised me how easy it was to judge. The old chain cut as good as a new one after the Dremel ,without a file touching it. Not quite as sharp as a well filed chain, but every bit as good as they come to start with.\\nAfter finishing that job, I decided to try it on my good chains, at the start of the day. I only have a corded Dremel, so had to do it at the shop before I left for the morning.\\nIf you are good with a file, you can probably use a Dremel too. I just made one light pass on the chains that only would need 3 strokes with a file. The bit/wheel is maybe 1-1/4\" long. I made one pass only. Sure enough, when I put those saws to work, this morning, the chains cut as good as new ones. I can see where someone could get in trouble by pushing too hard, and going back and forth, but that\\'s not necessary, at all. No tooth got too hot with one light pass, but it was still throwing metal shavings.\\nIt\\'s certainly a lot less work than a file. On the big saw, I hit each tooth one pass with the file at each fill-up, cutting Hickory, and Red Oak, and I couldn\\'t be happier.\\nI ordered some diamond bits off Amazon, for both size saws, and also some Stihl ones, that don\\'t say what the grinding media is. I\\'ll post again here when they come, to compare them. The bit I used this time was some light brown, friable one, like a grinding wheel.\\nNo more 4 to 7 stroke passes with a file for me.',)", "link": "('https://forestryforum.com/board/index.php?topic=117271.msg1866214#msg1866214',)", "origin": "Forestry", "suborigin": "Chainsaws", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "('i\\'m pretty good with a file, but i had some dirty stumps to cut off some trees that an excavator took down. i didn\\'t want to use a good chain, so brought out some old ones. the first one would need more than 7 strokes per tooth with a file, so i decided to try the dremel.\\ni was surprised at how easy it was, and how good of a job it did. i don\\'t even know what type grinding \"wheel\" it was, or why i had ever bought it, but was the right size at 7/32, and in the dremel toolbox.\\njust judging tooth length by eye, it also surprised me how easy it was to judge. the old chain cut as good as a new one after the dremel ,without a file touching it. not quite as sharp as a well filed chain, but every bit as good as they come to start with.\\nafter finishing that job, i decided to try it on my good chains, at the start of the day. i only have a corded dremel, so had to do it at the shop before i left for the morning.\\nif you are good with a file, you can probably use a dremel too. -----> i !!!  -----> just !!!  -----> made !!!  one light pass on the chains that only would need 3 strokes with a file. the bit/wheel is maybe 1-1/4\" long. i made one pass only. sure enough, when i put those saws to work, this morning, the chains cut as good as new ones. i can see where someone could get in trouble by pushing too hard, and going back and forth, but that\\'s not necessary, at all. no tooth got too hot with one light pass, but it was still throwing metal shavings.\\nit\\'s certainly a lot less work than a file. on the big saw, i hit each tooth one pass with the file at each fill-up, cutting hickory, and red oak, and i couldn\\'t be happier.\\ni ordered some diamond bits off amazon, for both size saws, and also some stihl ones, that don\\'t say what the grinding media is. i\\'ll post again here when they come, to compare them. the bit i used this time was some light brown, friable one, like a grinding wheel.\\nno more 4 to 7 stroke passes with a file for me.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000007, "year": "2021"}, {"Unnamed: 0": 5677, "autor": "mredden", "date": 1637366400000, "content": "('48 seems to be an off-size, but remember that a 48\" chainsaw mill can take a bar about 6 inches longer than the mill width.\\nLook for 50\" or 52\" Canon makes a 50\" 404 063. I think you can get them from Bailey\\'s - but pricey. Not sure about bar mount, but plate adapters can me made.',)", "link": "('https://forestryforum.com/board/index.php?topic=107825.msg1682097#msg1682097',)", "origin": "Forestry", "suborigin": "Chainsaws", "result": true, "Selector": "me made", "selectorShort": "make", "MarkedSent": "('48 seems to be an off-size, but remember that a 48\" chainsaw mill can take a bar about 6 inches longer than the mill width.\\nlook for 50\" or 52\" canon makes a 50\" 404 063. i think you can get them from bailey\\'s - but pricey. not sure about bar mount, but plate adapters can -----> me !!!  -----> made !!! .',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000007, "year": "2021"}, {"Unnamed: 0": 6585, "autor": "Jim_Rogers", "date": 1637366400000, "content": "(\"Using layout tools\\nPart four.\\nI use the Big Al more than I do a framing square as it has the hang-over-lip and sits on the timber without being held in place and is easier than using a framing square.\\nBefore we begin drawing an end of timber cut line we need to further inspect the timber for the locations where the joinery will be cut to make sure there aren’t any big knots or defects in the timber right were these joints will be. What we do is to lay a measuring tape on the beam and lock it so that we can slide it from end to end as we need to in order to locate the areas where the joints will be made.\\nNext we refer to our drawing to determine how long the tenon will be on the end of this beam. In the case of this beam the tenon is to be 4 1/2” long from the end of the beam which is 131” long.\\nNow we can see where the shoulders of the tenon would be if we make this location the end of the timber. We also look at other joint locations along the timber and see where or if there are any knots at these joint locations. If we see that there is going to be knots where the joints are intended to be we can slide the tape down towards one end of the beam or the other until these intended joint locations are in an area where there aren’t any defects or knots.\\nOnce we have determined that using this starting point on the timber will not place any future joint locations in an area where there are large defects or knots we can begin laying out the timber by drawing the end of timber cut line.\\nIf you are going to draw a line all the way around a timber, such as a cut off line to make the over all length of timber, you first start at your reference edge. And draw your line across this face at the proper spot.\\nBut before you move your Big Al from this spot you transfer the line around the corner onto the adjacent face using the hang over lip of the tool.\\nThen you hang the tool down the adjacent face without rolling the timber and mark the line down this side of the timber.\\nThis would be the side that has the open triangle on it. Then after that line is drawn you would draw a line down the opposite side away from the open triangle side, but hang the tool down from the reference face (the one with the colored in triangle) this way you have drawn three lines referencing from the same face/edge, and they should be in line or in plane with each other.\\nNow for the last face you can roll your timber over (placing the adjacent face up) and place your Big Al on it from the adjacent face (open triangle face) toward other side and then draw the last line from the second line to the third line. If these lines, the second line and the third line don't line up then your timber is out of square. If your timber is out of square then you make the lines meet by connecting the end of the third line to the end of the second line. This way the post will be cut 90° to the reference edge.\\nSo in that case don't make the fourth line with the Big Al until you see whether or not the lines truly line up, or you'll have to erase or plane off the incorrect line. If the lines don’t line up then use another straight edge and connect the second line to the third line, so that when this line is cut the end will be 90° to the reference face and edge.\\nMore next posting.....\\nJim Rogers\",)", "link": "('https://forestryforum.com/board/index.php?topic=6403.msg100430#msg100430',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "(\"using layout tools\\npart four.\\ni use the big al more than i do a framing square as it has the hang-over-lip and sits on the timber without being held in place and is easier than using a framing square.\\nbefore we begin drawing an end of timber cut line we need to further inspect the timber for the locations where the joinery will be cut to make sure there aren’t any big knots or defects in the timber right were these joints will be. what we do is to lay a measuring tape on the beam and lock it so that we can slide it from end to end as we need to in order to locate the areas where the joints will be made.\\nnext we refer to our drawing to determine how long the tenon will be on the end of this beam. in the case of this beam the tenon is to be 4 1/2” long from the end of the beam which is 131” long.\\nnow -----> we !!!  can see where the shoulders of the tenon would be if -----> we !!!  -----> make !!!  this location the end of the timber. we also look at other joint locations along the timber and see where or if there are any knots at these joint locations. if we see that there is going to be knots where the joints are intended to be we can slide the tape down towards one end of the beam or the other until these intended joint locations are in an area where there aren’t any defects or knots.\\nonce we have determined that using this starting point on the timber will not place any future joint locations in an area where there are large defects or knots we can begin laying out the timber by drawing the end of timber cut line.\\nif you are going to draw a line all the way around a timber, such as a cut off line to make the over all length of timber, you first start at your reference edge. and draw your line across this face at the proper spot.\\nbut before you move your big al from this spot you transfer the line around the corner onto the adjacent face using the hang over lip of the tool.\\nthen you hang the tool down the adjacent face without rolling the timber and mark the line down this side of the timber.\\nthis would be the side that has the open triangle on it. then after that line is drawn you would draw a line down the opposite side away from the open triangle side, but hang the tool down from the reference face (the one with the colored in triangle) this way you have drawn three lines referencing from the same face/edge, and they should be in line or in plane with each other.\\nnow for the last face you can roll your timber over (placing the adjacent face up) and place your big al on it from the adjacent face (open triangle face) toward other side and then draw the last line from the second line to the third line. if these lines, the second line and the third line don't line up then your timber is out of square. if your timber is out of square then you make the lines meet by connecting the end of the third line to the end of the second line. this way the post will be cut 90° to the reference edge.\\nso in that case don't make the fourth line with the big al until you see whether or not the lines truly line up, or you'll have to erase or plane off the incorrect line. if the lines don’t line up then use another straight edge and connect the second line to the third line, so that when this line is cut the end will be 90° to the reference face and edge.\\nmore next posting.....\\njim rogers\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6608, "autor": "moonhill", "date": 1637366400000, "content": "(\"A quote from Norm...... Some farmer hacked out most of the frames around here over 200 years ago with not much more than an axe! Jim you have no axe listed in your list? Is there a reason for that? It is the most used tool in my box, in that it removes more wood than any other tool. I don't know if Barr makes any axes, I asked if he did a few years back and he said he would if I sent him an example or drawings. I made due with what I had. May entertain the idea again some time.\\nTim\",)", "link": "('https://forestryforum.com/board/index.php?topic=6403.msg493151#msg493151',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "(\"a quote from norm...... some farmer hacked out most of the frames around here over 200 years ago with not much more than an axe! jim you have no axe listed in your list? is there a reason for that? it is the most used tool in my box, in that it removes more wood than any other tool. i don't know if barr makes any axes, i asked if he did a few years back and he said he would if i sent him an example or drawings. -----> i !!!  -----> made !!!  due with what -----> i !!!  had. may entertain the idea again some time.\\ntim\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6783, "autor": "Weekend_Sawyer", "date": 1637366400000, "content": "(\"It was a pretty nice weekend even though it snowed, I broke a sawmill and I had a serious bout of ADD.\\nFriday I played hookey from work and headed for the mountains. I spent the day trying to clean my lot. First there is a lot of slash leftover from knocking trees down so I worked with the skid steer and grapple but I keep running over these rocks that my part of WV is made of so I hopped on the backhoe and started moving rocks around, but wait, these logs are not good saw logs, lets start a firewood log pile, out with the chainsaw and then back on the skid steer moving some logs around, wait, I need to push this hill back a little so trucks can get onto the lot easier, up on the back hoe. Repeat, repeat, repeat... I made progress on all fronts but I started getting on my own nerves after a while.\\nSaturday morning I took a load of logs over to my neighbor's to saw and get trained on his LT35 hydraulic with simple setworks. We got through one log but things weren't working very well. It kept surging, speeding up and slowing down and making wavy cuts till the blade would rise and the mill would stall out. We tried 2 other blades with similar results. I finally kept my hand on the speed control and found that If I tapped on or wiggled the speed congrol it would affect the speed even though I wasn't turning it. So I think the speed controller needs to be replaced, should be a simple fix. The good thing is we did make a few boards and I did have my first experience at the controls of a LT35 hydraulic sawmill. I hope to get the replacement part and go back up this weekend for a little more hands on.\",)", "link": "('https://forestryforum.com/board/index.php?topic=89440.msg1381866#msg1381866',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "(\"it was a pretty nice weekend even though it snowed, i broke a sawmill and i had a serious bout of add.\\nfriday i played hookey from work and headed for the mountains. i spent the day trying to clean my lot. first there is a lot of slash leftover from knocking trees down so i worked with the skid steer and grapple but i keep running over these rocks that my part of wv is made of so i hopped on the backhoe and started moving rocks around, but wait, these logs are not good saw logs, lets start a firewood log pile, out with the chainsaw and then back on the skid steer moving some logs around, wait, i need to push this hill back a little so trucks can get onto the lot easier, up on the back hoe. repeat, repeat, repeat... -----> i !!!  -----> made !!!  progress on all fronts but -----> i !!!  started getting on my own nerves after a while.\\nsaturday morning -----> i !!!  took a load of logs over to my neighbor's to saw and get trained on his lt35 hydraulic with simple setworks. we got through one log but things weren't working very well. it kept surging, speeding up and slowing down and making wavy cuts till the blade would rise and the mill would stall out. we tried 2 other blades with similar results. i finally kept my hand on the speed control and found that if i tapped on or wiggled the speed congrol it would affect the speed even though i wasn't turning it. so i think the speed controller needs to be replaced, should be a simple fix. the good thing is we did make a few boards and i did have my first experience at the controls of a lt35 hydraulic sawmill. i hope to get the replacement part and go back up this weekend for a little more hands on.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6953, "autor": "TW", "date": 1637366400000, "content": "('Jake refered to the American habit of sawing logs in half and starting with them on two walls to get the height difference you want when starting from a lever foundation. Our way is to put the smallest logs in the heap as first course on the shorter end walls and the biggest logs in the heap as first course on the longer side walls.\\nThough on simple outbuildings that just sit on a few boulders you let the underside of the building be uneven.\\nThere is no need to make the top of the building even. As you add log course after log course working your way up you keep minding that oppisite walls are equally high and that the top of the logs always is a bit low providing room for the butt of the log above. If a log is too high somewhere to allow for proper scribing on waney edges you just cut away a little material from the round side with a chainsaw and shave it smooth and rounded by drawknife. When you approach the plate you think ahead so that once the plate is in place it\\'s top side will be rougly even. On the end walls you then fit the first log in the gable.\\nThe pegs fit snugly but not snugly enugh to split the log. Therefore I have found an octagonal shape to be best. They are stronger than square pegs yet less risk of splitting the log than when using round pegs. The corners of the octagons are compressed when driving in the peg so you get a tight fit without cracking the log. I use a large two handed plastic mallet for driving the pegs in and using it they should slide in fairly easily.\\nThe spruce poles are only large enough to yield the peg you want. Or a little thicker. The sapwood has the treatest elasticity and greatest bending strenght so when you are after strong pens you look for poles that are just oversize enough to be cut into the octagonal shape.\\nThe lenght \"per metre\" refered to that I make them whatever lenght the material yeilds between large knots and other flaws. Usually less than 3 metres though.\\nI will make a drawing to show how the corner notches are measured.',)", "link": "('https://forestryforum.com/board/index.php?topic=117089.msg1861706#msg1861706',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "('jake refered to the american habit of sawing logs in half and starting with them on two walls to get the height difference you want when starting from a lever foundation. our way is to put the smallest logs in the heap as first course on the shorter end walls and the biggest logs in the heap as first course on the longer side walls.\\nthough on simple outbuildings that just sit on a few boulders you let the underside of the building be uneven.\\nthere is no need to make the top of the building even. as you add log course after log course working your way up you keep minding that oppisite walls are equally high and that the top of the logs always is a bit low providing room for the butt of the log above. if a log is too high somewhere to allow for proper scribing on waney edges you just cut away a little material from the round side with a chainsaw and shave it smooth and rounded by drawknife. when you approach the plate you think ahead so that once the plate is in place it\\'s top side will be rougly even. on the end walls you then fit the first log in the gable.\\nthe pegs fit snugly but not snugly enugh to split the log. therefore i have found an octagonal shape to be best. they are stronger than square pegs yet less risk of splitting the log than when using round pegs. the corners of the octagons are compressed when driving in the peg so you get a tight fit without cracking the log. i use a large two handed plastic mallet for driving the pegs in and using it they should slide in fairly easily.\\nthe spruce poles are only large enough to yield the peg you want. or a little thicker. the sapwood has the treatest elasticity and greatest bending strenght so when you are after strong pens you look for poles that are just oversize enough to be cut into the octagonal shape.\\nthe lenght \"per metre\" refered to that -----> i !!!  -----> make !!!  them whatever lenght the material yeilds between large knots and other flaws. usually less than 3 metres though.\\ni will make a drawing to show how the corner notches are measured.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6971, "autor": "jake pogg", "date": 1637366400000, "content": "('\"Each to their own and I am not going to start a flame war over the best way of building a log building.\"\\nAbsolutely,that goes without saying.\\nThis is a conversation among Builders,and we all know that most decisions we make we do so based on Structural thinking,the many practical considerations that go into maximising the Quality of construction.\\nI guess i ought to reiterate that i speak for myself Solely when i will state my implicit belief that Correct Joinery is what will create any and all Aesthetics,in the end.\\nAnd that \"correctness\" is dependent on a multitude of factors,and the Art of building,one may say,is dependent on the builder\\'s ability to remain very alert for any and all possible information,so that the decisions made may be as fully informed as possible;that critical thinking that you yourself describe so much better when talking about studying the older ways,and those of other regions and climatic conditions et c.\\nSo there can\\'t very well ever be \"Best\",but only the most appropriate,for whatever specific set of factors that one faces as a builder).\\nLooking back at the methods of the past is very much like steering a course on the water-looking back at the line of your your wake Really helps!:)\\nHowever the Interpretation part of the old methods is where the difficulties sometimes arise,and that\\'s where the opinions may at times differ.\\nThat too however can usually be decided by looking closer at the substance of the question.\\nAs an example,i may (most respectfully) differ with you on the question of why the log ends were trimmed with an axe vs sawn.\\nI suggest that it\\'s because the saw frays the fibers of the end-grain,making it more succeptable to water absorbtion,and subsequent deterioration.\\nTechnically,the saw was known since most ancient times(lithic,much work in stone tool-making was done by sawing).As a blacksmith,i\\'d say that it\\'s easier to forge a saw then an axe.\\nSo rather than the technological difficulties in producing a functional saw-blade i\\'d say that it\\'s the frayed,fuzzy finish surface that the old builders were avoiding in end-grain work,and in longitudinal-ripping-the violation of fiber continuity.\\nI\\'d say that it\\'s especially so in the resinous softwoods,where in addition to the \"planishing\" effect,of smoothing down the fibers with the sharp heavy blade,there was added somewhat of an effect of expressing the resin and smearing it down the cut to further help to seal the open end-grain.\\nAgain speaking as a smith i believe that that is the reason for the thick,massive edge on the Piilu and it\\'s Swedish and Norwegian counterparts,that widened angle of the edge exerting more sideways pressure on wood fibers...',)", "link": "('https://forestryforum.com/board/index.php?topic=117089.msg1863373#msg1863373',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "('\"each to their own and i am not going to start a flame war over the best way of building a log building.\"\\nabsolutely,that goes without saying.\\nthis is a conversation among builders,and -----> we !!!  all know that most decisions -----> we !!!  -----> make !!!  -----> we !!!  do so based on structural thinking,the many practical considerations that go into maximising the quality of construction.\\ni guess i ought to reiterate that i speak for myself solely when i will state my implicit belief that correct joinery is what will create any and all aesthetics,in the end.\\nand that \"correctness\" is dependent on a multitude of factors,and the art of building,one may say,is dependent on the builder\\'s ability to remain very alert for any and all possible information,so that the decisions made may be as fully informed as possible;that critical thinking that you yourself describe so much better when talking about studying the older ways,and those of other regions and climatic conditions et c.\\nso there can\\'t very well ever be \"best\",but only the most appropriate,for whatever specific set of factors that one faces as a builder).\\nlooking back at the methods of the past is very much like steering a course on the water-looking back at the line of your your wake really helps!:)\\nhowever the interpretation part of the old methods is where the difficulties sometimes arise,and that\\'s where the opinions may at times differ.\\nthat too however can usually be decided by looking closer at the substance of the question.\\nas an example,i may (most respectfully) differ with you on the question of why the log ends were trimmed with an axe vs sawn.\\ni suggest that it\\'s because the saw frays the fibers of the end-grain,making it more succeptable to water absorbtion,and subsequent deterioration.\\ntechnically,the saw was known since most ancient times(lithic,much work in stone tool-making was done by sawing).as a blacksmith,i\\'d say that it\\'s easier to forge a saw then an axe.\\nso rather than the technological difficulties in producing a functional saw-blade i\\'d say that it\\'s the frayed,fuzzy finish surface that the old builders were avoiding in end-grain work,and in longitudinal-ripping-the violation of fiber continuity.\\ni\\'d say that it\\'s especially so in the resinous softwoods,where in addition to the \"planishing\" effect,of smoothing down the fibers with the sharp heavy blade,there was added somewhat of an effect of expressing the resin and smearing it down the cut to further help to seal the open end-grain.\\nagain speaking as a smith i believe that that is the reason for the thick,massive edge on the piilu and it\\'s swedish and norwegian counterparts,that widened angle of the edge exerting more sideways pressure on wood fibers...',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6978, "autor": "jake pogg", "date": 1637366400000, "content": "('Sorry,forgot to add that the red dotted line on the photo of that Baltic axe above indicates the weld,that is where the metal has been brought around the eye and welded.\\nThat artefact has fallen into the hands of a private collector,who mercilessly ground/polished/etched it,destroying about 90+% of it\\'s value for study of archaeometallurgy...\\nHowever,that is what allows us to see the physical make-up of it so readily.\\nthe color difference indicates C content(the darker-the more C).\\nAnd incidentally,those same layers of Si also of course resist transmigration of C,one of the reasons those parts remained so sharply distinct in C content.\\n********\\n\"According to an aquintance who was brought up in northern Germany the sort of axes with comparatively short eyes and ash handles which he got used to in Germany are impossible to put on a birch handle. Birch is so soft that the handle over time works loose inside the short German style eye. He rekons this is the reason for the collared axe eyes in Scandinavia. An adaptation to birch handles.\\nAsh hardly grows north of Åbo (Turku) so except in the southwesternmost corner of Finland there was no alternative to birch.\"\\nI\\'d definitely second that,coming from what study of history i\\'ve done,and also from personal experience:The modern American eye has developed around the use of Hickory and other equally hard wood solely;any attempts to handle one of these with birch(the only hardwood available to me in AK) failed,in an emergency a birch handle may last a few hours of not very hard use.\\nMuch in tool evolution has evolved and been developed around the Rhine valley,starting from the La Tene period and onwards,really blossoming during the time of Merovingian dynasties.\\nThat peculiar eye we see on Piilu and some timmerbil(-er,would that be plural?) we see on the still current to this day \"goosewing\" broadaxes in Germany.\\nA very challenging form of an eye,i tried it a few times but so far progressed a very short way towards making one.\\nWorking alone,and with limited technology,i made a few attempts loosely based on some of the work of Serge Turberg(France).\\nThis is the best i could do so far...And i don\\'t know if i\\'ll ever brave the complexities of the blade,and the neck,or transition,that it takes to forge a hewing axe of roughly this type',)", "link": "('https://forestryforum.com/board/index.php?topic=117089.msg1864404#msg1864404',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('sorry,forgot to add that the red dotted line on the photo of that baltic axe above indicates the weld,that is where the metal has been brought around the eye and welded.\\nthat artefact has fallen into the hands of a private collector,who mercilessly ground/polished/etched it,destroying about 90+% of it\\'s value for study of archaeometallurgy...\\nhowever,that is what allows us to see the physical make-up of it so readily.\\nthe color difference indicates c content(the darker-the more c).\\nand incidentally,those same layers of si also of course resist transmigration of c,one of the reasons those parts remained so sharply distinct in c content.\\n********\\n\"according to an aquintance who was brought up in northern germany the sort of axes with comparatively short eyes and ash handles which he got used to in germany are impossible to put on a birch handle. birch is so soft that the handle over time works loose inside the short german style eye. he rekons this is the reason for the collared axe eyes in scandinavia. an adaptation to birch handles.\\nash hardly grows north of åbo (turku) so except in the southwesternmost corner of finland there was no alternative to birch.\"\\ni\\'d definitely second that,coming from what study of history i\\'ve done,and also from personal experience:the modern american eye has developed around the use of hickory and other equally hard wood solely;any attempts to handle one of these with birch(the only hardwood available to me in ak) failed,in an emergency a birch handle may last a few hours of not very hard use.\\nmuch in tool evolution has evolved and been developed around the rhine valley,starting from the la tene period and onwards,really blossoming during the time of merovingian dynasties.\\nthat peculiar eye we see on piilu and some timmerbil(-er,would that be plural?) we see on the still current to this day \"goosewing\" broadaxes in germany.\\na very challenging form of an eye,-----> i !!!  tried it a few times but so far progressed a very short way towards making one.\\nworking alone,and with limited technology,-----> i !!!  -----> made !!!  a few attempts loosely based on some of the work of serge turberg(france).\\nthis is the best -----> i !!!  could do so far...and -----> i !!!  don\\'t know if i\\'ll ever brave the complexities of the blade,and the neck,or transition,that it takes to forge a hewing axe of roughly this type',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 6979, "autor": "Rgdsolution", "date": 1637366400000, "content": "('Hi I’ve got a few basic questions about a timber frame build (round poles) mainly to build confidence and hopefully gain some new insights. It is a 16x20 with a loft on half of the frame. I am using wood from my property most of which I’m milling with an Alaskan chainsaw mill. I’ve already finished the basement and first floor decking with round log joists and chainsaw milled flooring - I left a gap filled the gaps with 1/4” - 1/2” (3/8” looks best) sisal rope it worked great and looks cool but beware every roll of sisal is different size but it’s cheap enough to just buy lots of rolls and bigger is better to jam in gap with white rubber hammer if it’ll go.\\nSo my basic confidence issue is in the joinery on round poles. I want to use mortise and tenon but my poles aren’t very oversized (6.5-7.5” for 6 posts) but big ole 8x10 plates and tie beams. The posts are a little bigger on the opposite end (around 8”) and I’m thinking of flipping them upside down and lagging the joists to the floor with 9” 1/2” lag bolts at an angle. I’ll have sips all around the outside plate to sill. The posts are made of yellow birch and good grade.\\nTo put it all frankly I’m intimidated by the outward force on the tie beam pins and since 2” tenons seem to make the most sense I’m concerned about the amount of meat removed from my post. I made a drawing and the tenon only goes in halfway and leaves some room on the side but I just wonder about it. I’m using Will Beemers book as my original first plan and he doesn’t use a ridge beam and so I was planning to just butt the rafters at a 45 degree angle and bird mouth them at the plate although his book shows yet another cut in the plate as angling the rafter further into the plate I wonder also how necessary that will be. I’m going to add collars to every other rafter except for on the loft and I figured that would be the extra reenforcement but Will only does that on the end walls I’d love to get some other opinions on outward thrust. When I calculate it the thrust is in the thousands and I’m just saying to myself who wants to put that must faith in a few tie beam pins and sip screws on the corners. I might just add king posts on the two ends with a ridge beam I just wonder is all of that really necessary.\\nIf anyone has input on outward thrust without a ridge beam involved I’d love to hear it?\\nAlso what are your thoughts on two or three braces coming together almost at one spot removing all the meat from a post?? I’m actually planning to make my brace tenons only 1 1/2” deep and putting 1/2” threaded rod recessed a little in and trimmed over to alleviate that concern I just wonder how it’s normally considered, even with 7” or 8” Square posts it can be a lot of wood removed?\\nAny thoughts on round post building ideas would be greatly appreciated - I have great ideas to square everything but my worries are in what I don’t yet know?? I would like to also reenforce with steel plates or lags but round logs to steel plates seems like it’s gonna look crappy or maybe I’m just over worrying.\\nThanks!',)", "link": "('https://forestryforum.com/board/index.php?topic=116886.msg1855962#msg1855962',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('hi i’ve got a few basic questions about a timber frame build (round poles) mainly to build confidence and hopefully gain some new insights. it is a 16x20 with a loft on half of the frame. i am using wood from my property most of which i’m milling with an alaskan chainsaw mill. i’ve already finished the basement and first floor decking with round log joists and chainsaw milled flooring - i left a gap filled the gaps with 1/4” - 1/2” (3/8” looks best) sisal rope it worked great and looks cool but beware every roll of sisal is different size but it’s cheap enough to just buy lots of rolls and bigger is better to jam in gap with white rubber hammer if it’ll go.\\nso my basic confidence issue is in the joinery on round poles. i want to use mortise and tenon but my poles aren’t very oversized (6.5-7.5” for 6 posts) but big ole 8x10 plates and tie beams. the posts are a little bigger on the opposite end (around 8”) and i’m thinking of flipping them upside down and lagging the joists to the floor with 9” 1/2” lag bolts at an angle. i’ll have sips all around the outside plate to sill. the posts are made of yellow birch and good grade.\\nto put it all frankly i’m intimidated by the outward force on the tie beam pins and since 2” tenons seem to make the most sense i’m concerned about the amount of meat removed from my post. -----> i !!!  -----> made !!!  a drawing and the tenon only goes in halfway and leaves some room on the side but i just wonder about it. i’m using will beemers book as my original first plan and he doesn’t use a ridge beam and so i was planning to just butt the rafters at a 45 degree angle and bird mouth them at the plate although his book shows yet another cut in the plate as angling the rafter further into the plate i wonder also how necessary that will be. i’m going to add collars to every other rafter except for on the loft and i figured that would be the extra reenforcement but will only does that on the end walls i’d love to get some other opinions on outward thrust. when i calculate it the thrust is in the thousands and i’m just saying to myself who wants to put that must faith in a few tie beam pins and sip screws on the corners. i might just add king posts on the two ends with a ridge beam i just wonder is all of that really necessary.\\nif anyone has input on outward thrust without a ridge beam involved i’d love to hear it?\\nalso what are your thoughts on two or three braces coming together almost at one spot removing all the meat from a post?? i’m actually planning to make my brace tenons only 1 1/2” deep and putting 1/2” threaded rod recessed a little in and trimmed over to alleviate that concern i just wonder how it’s normally considered, even with 7” or 8” square posts it can be a lot of wood removed?\\nany thoughts on round post building ideas would be greatly appreciated - i have great ideas to square everything but my worries are in what i don’t yet know?? i would like to also reenforce with steel plates or lags but round logs to steel plates seems like it’s gonna look crappy or maybe i’m just over worrying.\\nthanks!',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 7235, "autor": "Brian_Weekley", "date": 1637366400000, "content": "('Quote from: TimFromNB on July 17, 2018, 06:28:35 AM\\nI wish I could find a 2\" auger bit. Would save me some pairing on the mortises. Already eyeing a chain mortiser at this point Having a hard time justifying it though\\nIt will get faster the more you do.\\nConsider an antique boring machine and bit--they do work well. However, as an experiment, I made a boring machine and it worked great. You can get a 2\" bit here: http://logbuildingtools.ca/Wood_Auger_pricelist2.pdf\\nMillers Falls Dimensions in Timber Framing/Log construction',)", "link": "('http://forestryforum.com/board/index.php?topic=81347.msg1245160#msg1245160',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('quote from: timfromnb on july 17, 2018, 06:28:35 am\\ni wish i could find a 2\" auger bit. would save me some pairing on the mortises. already eyeing a chain mortiser at this point having a hard time justifying it though\\nit will get faster the more you do.\\nconsider an antique boring machine and bit--they do work well. however, as an experiment, -----> i !!!  -----> made !!!  a boring machine and it worked great. you can get a 2\" bit here: http://logbuildingtools.ca/wood_auger_pricelist2.pdf\\nmillers falls dimensions in timber framing/log construction',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 7376, "autor": "mike_belben", "date": 1637366400000, "content": "(\"for future reference in the years to come this thread is a spinoff that started at #6669 from the daily pic thread in logging section.\\nQuote from: nativewolf on January 30, 2021, 09:13:15 AM\\nQuote from: Southside on January 29, 2021, 10:06:24 PM\\nThere is a significant difference between what a vehicle driving down a paved road encounters and a skidder working in the woods. The more complicated you make those systems, the more there is to break, and I just don't see any reasonable way to charge forestry equipment. Pulling out a 1,000 lb battery at the end of each shift so the employee can take it home and juice it up? Yea - that's not going to happen. What about guys who run double shifts? Need more energy partway through the day? Run a diesel generator to charge the battery? Guess there won't be any logging in California every time the wind blows and the grid shuts down. The grid in many places has a hard time staying up in the heat of the summer from folks running their A/C. How will the power be distributed for all of the transportation equipment? EV's have a limited place, and it sure isn't woods work.\\nWell, I'd agree on complicated. Electric vehicles are much much less complicated than ICE equivalents, in any product class. I had a JD 648 X stuck on a landing for 4 months because JD could not figure out what was wrong with it. I had to force logger to have it towed off. The faster I can get rid of the hydraulic and diesel powered equipment the more reliable, quieter, and more automated I can make a harvest.\\nThe worlds foremost lean design engineering firm in the automotive and aerospace sector is Sandy Munro's Munro and Associates. He's a car nut through and through, favorite hobby is off roading in his jeep. Old cuss. He's got a youtube channel and I suggest everyone that has question go and watch a few episodes where they break down a model Y or talk about the future of pickups, etc. They literally take out every single part, every part. from screws to washers to wires to chips to seat upholstery. Complete breakdown. Really really interesting to see him get into the details on cars, you get to see what is probably a $250,000 engineering report on youtube. So, don't take my word for it. Go hear what the world foremost outside consultant thinks.\\nWhich car is more complicated a tesla Y or a Civic? Then expand the nature of the beast to a skidder. Which do you think is more complicated. An electric skidder or a new skidder from JD. Charging a big battery will be a neat opportunity for someone but that's not much of a challenge. I can pretty much guarantee that big diesel engines are going to get much much more expensive as they become niche things for specialty applications. When trains and mining equipment guys have figured out that electric is better and they are getting ready to launch EV airplanes I don't see whats keeping someone from starting to build an EV skidder.\\nPluses:\\nMore efficient propulsion. Not converting fossilized sunlight into propulsion is over 2X as efficient.\\nCapital Expense- 4 electric motors are much less expensive than a giant diesel, hydraulic pumps, hoses, filters, radiators, coolants, more filters, oils, etc.\\nComplete computer control- Tesla sort of reimagined computer controls in a modern car; would benefit heavy equipment as well. It is as much software as hardware. Maybe in the future we could have a remote person running harvesters, get rid of cabs and ROP, CP etc. Reimagine the nature and layout by basically making it robotic. Visibility from cameras and drone. Get the person out of the machine - that's probably a 30 year thing but will likely happen.\\nCons: How to keep 500kwh battery charged.\\nOpportunities: Cut the cost of a current skidder. Create new process for charging a skidder overnight. Replace entire fleet of ICE forestry equipment.\\nExpand Quote\\nwyatt i don't disagree with what you are saying when looked at as individual line items. my stance is that you are looking at an individual machine vs an individual machine and not seeing how the entire support system for it plays out, how LONG it takes for the entire system to get there.\\nthe current system is established, is refined and will remain that way. it will not be one electric powered product that voids out an entire diesel powered world. it will require the entire EV system to be developed, refined and reliable.. at the same time as a failure in the diesel supporting world. it would take outrageous fuel prices, elimination of new parts, then a discontinuing of aftermarket parts by non oems and a whole generation of future mechanics to NOT take interest in diesel. look at all the smoke stacks and coal roller kids out there today.. you can't find an unmolested bro duty. the kids aren't quitting on diesel yet at all.\\nyou aren't a mechanic so you don't have a hard time letting go of a technology you never learned. there are many many people, myself included, who have spent their entire lives getting the education, tools and experience to work on the equipment we have. to just say its all gotta go.. it negates our investment against our will. it takes away the advantage i earned fair and square. of course there will be resistance to it. so you're new machine is trying to basically ruin some lives by making them start over like a kid again except one who probably doesn't know or want to learn how to insert a photo into an email or do a zoom meeting. at a certain point you just don't have the drive for new tricks anymore, so don't expect enthusiasm from them. people know that once they lose the drive, the new technology will make them obsolete in the industry they finally got settled into. I'm one of them.\\ni was an avionics tech in the marines, it was a very intensive schooling. sit in a chair but have a headache and exhaustion from trying to keep your brain awake and staying with it. in the field i worked on CH53D chopper electronic modules and they were obsolete by then so often could only be repaired by cannibalizing used units. the new stuff was retiring the old stuff so the support for it is abandoned. when you're electric skidder gets to that inevitable point, you won't be better off than the diesel. probably worse.\\nI'm telling you as someone with some experience that this new technology eventually becomes old technology that gets scrapped too. maybe sooner, maybe later. thats another gamble. it doesn't matter if shaft rotation comes from diesel combustion, stored solar, compressed air, air over hydraulic, steam, nuclear.. it doesn't matter. they all come and they all go.\\nsteam was simple and cheap, but dangerous. well i agree with you electric consolidates many systems (that to you are complex but to me are second nature) just like a few hundred volts DC is simple to some.. but dangerous to all. so give it enough tragic high voltage accidents by layman mechanics waiting 3 weeks for a service guy, and eventually the NHTSA or whoever seizes jurisdiction will decide that these things are too dangerous for the public to wrench and that licensing is required to service them. no? 3 phase is very simple but you need a license for that. plumbing is real simple, need a license for that. guess what. licensing reduces the number of technicians and raises their hourly rate.\\nso yes, you can bench race two machines and correctly say this one is x amount more efficient in the lab, on the dyno, even in our 2 year woods trials. but does that extrapolate into being X amount more money in your bank account over the ownership of the machine considering both uptime, downtime, purchase cost, maintenance and repairs? no one knows yet, its a gamble. deere 440As are still in service. nokia 5190s are not. but we can afford to toss a phone every 3 years, not a forwarder.\\nin 15, 20 years when the new technology is needing substantial repairs, has the market trained enough people to fill the need affordably? or have the manufacturers planned the machine for obsolescence with proprietary parts in order for their company to survive long term without regard for yours? cuz thats very common! it takes considerable business interruption to create the willingness for consumers to pay the aftermarket to dive in and solve hard problems.\\nif they don't.. then what? do you need to have a dead one out back to pop and swap control cards yourself just like i did in a avionics facility with rows of specialty test sets and top training? if the federal government can't buy a solution who can? the country has a STEM shortage. hydraulics is very old, and quite simple, but there is still a vast shortage in that branch of industry with respect to troubleshooters and mechanics. will electronics be any different? maybe, but the world at large still believes current flows from the red plus sign, when the electron flow that carries current is from negative to positive so I'm not optimistic there about people being able to maintain their EV.\\nthe diesel became reality around 1893. it was globally accepted and put into service worldwide, especially by WW2. but with all that demand, use and competition to improve.. truly they didn't even start to get really awesome until the 1980s with the cummins big cam, detroit 60 series and cat 3406B nearly 100 years after the first. the 3406E/C15 is probably the pinnacle of factory diesels and then emissions put them into decline. but see DEMAND AND ENTHUSIASM made them evolve to incredible levels of torque per cubic inch displacement. it has only been EMISSIONS that has limited them and forced them into decline. like girdling maples then saying maples just can't compete with oaks. it took 100 years for the support network around the diesel to mature. how many for the\\nEV?\\nthe brand new engines in the brand new aero trucks today are getting 8mpg in a field of old trucks getting 5mpg but the 5mpg operations aren't dying like the brand new truck guys all say they should have, because the reliability, parts support, and in house overhauling of the classic trucks is strong while it has never developed for the new. 2010 big rigs of all brands are pretty much universally hated for EGR problems and are dirt cheap because they wipe out everyone who tries to run one it seems. a 10yr old 700k mile plastic truck costs half of a 2 million mile 379 or w9, and thats just how it turned out. no one could know this in 1970. the guy i worked for will go out of business before he buys a volvo d12 much less some electric thing. the 5pmg truck does everything is supposed to with simplicity, including breaking down and getting put back together. so even the breakdowns are no problem. just pull it in the shop and wheel the tool cart over like always.\\nthe future of the EV thing is unknown. we are in the 1970s speculating about 2020. hell in 50 years will logging even be legal? cast your bets, we will all have to see how it plays out because the performance curves and efficiency levels are only one sliver of the overall adoption of the technology and total outcome.\",)", "link": "('javascript:void(0);',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "(\"for future reference in the years to come this thread is a spinoff that started at #6669 from the daily pic thread in logging section.\\nquote from: nativewolf on january 30, 2021, 09:13:15 am\\nquote from: southside on january 29, 2021, 10:06:24 pm\\nthere is a significant difference between what a vehicle driving down a paved road encounters and a skidder working in the woods. the more complicated you make those systems, the more there is to break, and i just don't see any reasonable way to charge forestry equipment. pulling out a 1,000 lb battery at the end of each shift so the employee can take it home and juice it up? yea - that's not going to happen. what about guys who run double shifts? need more energy partway through the day? run a diesel generator to charge the battery? guess there won't be any logging in california every time the wind blows and the grid shuts down. the grid in many places has a hard time staying up in the heat of the summer from folks running their a/c. how will the power be distributed for all of the transportation equipment? ev's have a limited place, and it sure isn't woods work.\\nwell, i'd agree on complicated. electric vehicles are much much less complicated than ice equivalents, in any product class. i had a jd 648 x stuck on a landing for 4 months because jd could not figure out what was wrong with it. i had to force logger to have it towed off. the faster -----> i !!!  -----> can !!!  get rid of the hydraulic and diesel powered equipment the more reliable, quieter, and more automated -----> i !!!  -----> can !!!  -----> make !!!  a harvest.\\nthe worlds foremost lean design engineering firm in the automotive and aerospace sector is sandy munro's munro and associates. he's a car nut through and through, favorite hobby is off roading in his jeep. old cuss. he's got a youtube channel and i suggest everyone that has question go and watch a few episodes where they break down a model y or talk about the future of pickups, etc. they literally take out every single part, every part. from screws to washers to wires to chips to seat upholstery. complete breakdown. really really interesting to see him get into the details on cars, you get to see what is probably a $250,000 engineering report on youtube. so, don't take my word for it. go hear what the world foremost outside consultant thinks.\\nwhich car is more complicated a tesla y or a civic? then expand the nature of the beast to a skidder. which do you think is more complicated. an electric skidder or a new skidder from jd. charging a big battery will be a neat opportunity for someone but that's not much of a challenge. i can pretty much guarantee that big diesel engines are going to get much much more expensive as they become niche things for specialty applications. when trains and mining equipment guys have figured out that electric is better and they are getting ready to launch ev airplanes i don't see whats keeping someone from starting to build an ev skidder.\\npluses:\\nmore efficient propulsion. not converting fossilized sunlight into propulsion is over 2x as efficient.\\ncapital expense- 4 electric motors are much less expensive than a giant diesel, hydraulic pumps, hoses, filters, radiators, coolants, more filters, oils, etc.\\ncomplete computer control- tesla sort of reimagined computer controls in a modern car; would benefit heavy equipment as well. it is as much software as hardware. maybe in the future we could have a remote person running harvesters, get rid of cabs and rop, cp etc. reimagine the nature and layout by basically making it robotic. visibility from cameras and drone. get the person out of the machine - that's probably a 30 year thing but will likely happen.\\ncons: how to keep 500kwh battery charged.\\nopportunities: cut the cost of a current skidder. create new process for charging a skidder overnight. replace entire fleet of ice forestry equipment.\\nexpand quote\\nwyatt i don't disagree with what you are saying when looked at as individual line items. my stance is that you are looking at an individual machine vs an individual machine and not seeing how the entire support system for it plays out, how long it takes for the entire system to get there.\\nthe current system is established, is refined and will remain that way. it will not be one electric powered product that voids out an entire diesel powered world. it will require the entire ev system to be developed, refined and reliable.. at the same time as a failure in the diesel supporting world. it would take outrageous fuel prices, elimination of new parts, then a discontinuing of aftermarket parts by non oems and a whole generation of future mechanics to not take interest in diesel. look at all the smoke stacks and coal roller kids out there today.. you can't find an unmolested bro duty. the kids aren't quitting on diesel yet at all.\\nyou aren't a mechanic so you don't have a hard time letting go of a technology you never learned. there are many many people, myself included, who have spent their entire lives getting the education, tools and experience to work on the equipment we have. to just say its all gotta go.. it negates our investment against our will. it takes away the advantage i earned fair and square. of course there will be resistance to it. so you're new machine is trying to basically ruin some lives by making them start over like a kid again except one who probably doesn't know or want to learn how to insert a photo into an email or do a zoom meeting. at a certain point you just don't have the drive for new tricks anymore, so don't expect enthusiasm from them. people know that once they lose the drive, the new technology will make them obsolete in the industry they finally got settled into. i'm one of them.\\ni was an avionics tech in the marines, it was a very intensive schooling. sit in a chair but have a headache and exhaustion from trying to keep your brain awake and staying with it. in the field i worked on ch53d chopper electronic modules and they were obsolete by then so often could only be repaired by cannibalizing used units. the new stuff was retiring the old stuff so the support for it is abandoned. when you're electric skidder gets to that inevitable point, you won't be better off than the diesel. probably worse.\\ni'm telling you as someone with some experience that this new technology eventually becomes old technology that gets scrapped too. maybe sooner, maybe later. thats another gamble. it doesn't matter if shaft rotation comes from diesel combustion, stored solar, compressed air, air over hydraulic, steam, nuclear.. it doesn't matter. they all come and they all go.\\nsteam was simple and cheap, but dangerous. well i agree with you electric consolidates many systems (that to you are complex but to me are second nature) just like a few hundred volts dc is simple to some.. but dangerous to all. so give it enough tragic high voltage accidents by layman mechanics waiting 3 weeks for a service guy, and eventually the nhtsa or whoever seizes jurisdiction will decide that these things are too dangerous for the public to wrench and that licensing is required to service them. no? 3 phase is very simple but you need a license for that. plumbing is real simple, need a license for that. guess what. licensing reduces the number of technicians and raises their hourly rate.\\nso yes, you can bench race two machines and correctly say this one is x amount more efficient in the lab, on the dyno, even in our 2 year woods trials. but does that extrapolate into being x amount more money in your bank account over the ownership of the machine considering both uptime, downtime, purchase cost, maintenance and repairs? no one knows yet, its a gamble. deere 440as are still in service. nokia 5190s are not. but we can afford to toss a phone every 3 years, not a forwarder.\\nin 15, 20 years when the new technology is needing substantial repairs, has the market trained enough people to fill the need affordably? or have the manufacturers planned the machine for obsolescence with proprietary parts in order for their company to survive long term without regard for yours? cuz thats very common! it takes considerable business interruption to create the willingness for consumers to pay the aftermarket to dive in and solve hard problems.\\nif they don't.. then what? do you need to have a dead one out back to pop and swap control cards yourself just like i did in a avionics facility with rows of specialty test sets and top training? if the federal government can't buy a solution who can? the country has a stem shortage. hydraulics is very old, and quite simple, but there is still a vast shortage in that branch of industry with respect to troubleshooters and mechanics. will electronics be any different? maybe, but the world at large still believes current flows from the red plus sign, when the electron flow that carries current is from negative to positive so i'm not optimistic there about people being able to maintain their ev.\\nthe diesel became reality around 1893. it was globally accepted and put into service worldwide, especially by ww2. but with all that demand, use and competition to improve.. truly they didn't even start to get really awesome until the 1980s with the cummins big cam, detroit 60 series and cat 3406b nearly 100 years after the first. the 3406e/c15 is probably the pinnacle of factory diesels and then emissions put them into decline. but see demand and enthusiasm made them evolve to incredible levels of torque per cubic inch displacement. it has only been emissions that has limited them and forced them into decline. like girdling maples then saying maples just can't compete with oaks. it took 100 years for the support network around the diesel to mature. how many for the\\nev?\\nthe brand new engines in the brand new aero trucks today are getting 8mpg in a field of old trucks getting 5mpg but the 5mpg operations aren't dying like the brand new truck guys all say they should have, because the reliability, parts support, and in house overhauling of the classic trucks is strong while it has never developed for the new. 2010 big rigs of all brands are pretty much universally hated for egr problems and are dirt cheap because they wipe out everyone who tries to run one it seems. a 10yr old 700k mile plastic truck costs half of a 2 million mile 379 or w9, and thats just how it turned out. no one could know this in 1970. the guy i worked for will go out of business before he buys a volvo d12 much less some electric thing. the 5pmg truck does everything is supposed to with simplicity, including breaking down and getting put back together. so even the breakdowns are no problem. just pull it in the shop and wheel the tool cart over like always.\\nthe future of the ev thing is unknown. we are in the 1970s speculating about 2020. hell in 50 years will logging even be legal? cast your bets, we will all have to see how it plays out because the performance curves and efficiency levels are only one sliver of the overall adoption of the technology and total outcome.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 7481, "autor": "Joe Hillmann", "date": 1637366400000, "content": "('I make small batches quite often. When I burn small scraps I wait until it is mostly coals then cover the fire and choke it out.\\nI have a 2 wheeled tractor that has a charcoal gasafier on it. The bigger stuff gets saved for that. The smaller stuff gets ground and goes into the compost pile. Charcoal is supposed to be great at holding nutrients and water in the soil.',)", "link": "('https://forestryforum.com/board/index.php?topic=115873.msg1833198#msg1833198',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "('-----> i !!!  -----> make !!!  small batches quite often. when i burn small scraps i wait until it is mostly coals then cover the fire and choke it out.\\ni have a 2 wheeled tractor that has a charcoal gasafier on it. the bigger stuff gets saved for that. the smaller stuff gets ground and goes into the compost pile. charcoal is supposed to be great at holding nutrients and water in the soil.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 7823, "autor": "Paul_H", "date": 1637366400000, "content": "(\"We installed a Bison deep well pump today and it went pretty good with Carla helping. Start to finish was 2 hours to install six 8' lengths of pipe and sucker rods. The well casing was oblong on top so I had to make some mods with a hammer and a bit of work with a pocket knife to make the top seal fit the still somewhat oblong opening.\\nOur well is 90' and static level is around 15'. It's really well built and is 7 pumps to the gallon. We have a wood cookstove for heat and cooking and adequate food but water has been a concern when there are power failures and although we have a good backup generator that takes a couple minutes to setup,we've gone days without power and people, animals and gardens need water. In 2003 we were cutoff a week from the rest of the world by a flood and remained comfortable with six of us as well as an extra neighbour and ice storms have left us without electricity innumerable times.\\nFitting the pump to the first section of pipe\\nA cool tool to hold the pipe while connecting the sucker rods then the pipe\\nThe pump head hooked up and the safety rope tied to the cap then the sealing rubber under the cap is lowered into the casing then tightened down.\\nEasy to pump and can be connected to the pressure tank and feed the house if needed\",)", "link": "('https://forestryforum.com/board/index.php?topic=79269.msg1791310#msg1791310',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "i had to make", "selectorShort": "make", "MarkedSent": "(\"we installed a bison deep well pump today and it went pretty good with carla helping. start to finish was 2 hours to install six 8' lengths of pipe and sucker rods. the well casing was oblong on top so -----> i !!!  -----> had !!!  -----> to !!!  -----> make !!!  some mods with a hammer and a bit of work with a pocket knife -----> to !!!  -----> make !!!  the top seal fit the still somewhat oblong opening.\\nour well is 90' and static level is around 15'. it's really well built and is 7 pumps to the gallon. we have a wood cookstove for heat and cooking and adequate food but water has been a concern when there are power failures and although we have a good backup generator that takes a couple minutes to setup,we've gone days without power and people, animals and gardens need water. in 2003 we were cutoff a week from the rest of the world by a flood and remained comfortable with six of us as well as an extra neighbour and ice storms have left us without electricity innumerable times.\\nfitting the pump to the first section of pipe\\na cool tool to hold the pipe while connecting the sucker rods then the pipe\\nthe pump head hooked up and the safety rope tied to the cap then the sealing rubber under the cap is lowered into the casing then tightened down.\\neasy to pump and can be connected to the pressure tank and feed the house if needed\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 7928, "autor": "toxedo_2000", "date": 1637366400000, "content": "('Quote from: srjones on December 15, 2005, 02:36:37 AM\\nToxedo, that is waaaay cool. (très fantastique!)\\nI think micro-hydro is definatly the way to go if you\\'ve got the water to do it. If you don\\'t mind my asking, how did you make the \\'paddles\\' like the one you\\'re holding in your fingers? Also, at how many RPMs does it run and how is it regulated?\\nAlong the same lines, but I\\'m not sure if would be considered alternative energy, is the ram pump. It\\'s low tech (only two moving parts) and pumps water from point A to point B using gravity and hydraulic pressure.\\nI hope to do both someday.\\nExpand Quote\\nThanks to you and all the members\\nAll explain How I made the paddles that I call spoons:\\nFirst a friend of mine who is a my blacksmith teacher, made a die to form a half sphere.\\nThen I put that on my press and made a lot of them\\nAfter that I used an other tool on the press to form ... I dont know how to call it... but it ressemble to a pair of bumps\\nThird thing to do, was to fill the back of the spoon with weld, and carve one end in a \"W\" form. I also had to sharpen the interior fishbone to make it very sharp so the water jet would be cut in two when hitting the middle of the spoon. That action is made for every single 24 spoon. Time consuming since it is a carving job. It is made with different sets of files and small grinding wheels.\\nI welded all the spoon on a 5 inches cicle (made of an old saw) divided in 24\\nAfter that I put the wheel on the iron mill, and grinded it while it was turning. (sorry, no picture of that part of the job) I did that to equilibrate everything and minimize vibrations. You see, that wheel can turn very fast with the water pressure, up to 3500 t/m average with a nozzle 3/8 inch wide.\\nI did not invent that kind of wheel as you know. It is a \"Pelton\" wheel. An old concept and design. It is supposed to be the more efficient profile for that kind of watermill. I just looked at photos on the net, and tried to make the same. I could have buy the wheel for 5 or 6 hundred dollars, but Naaaa ! I like to do the things myself.\\nNext question ?\\nHo yes, somebody was asking how it is regulated. Well, the pressure is constant, and the nozzle is always the same giving a constant dynamic pressure. (68 PSI for now) That can be altered by moisture and algues forming inside the pipe, but i manage to clean it a couple time during each summer.\\nToxedo\\nOne more pic\\nAt the top, an intake (a plastic barrel with hundreds of small holes) is intalled to prevent any strange big thing to enter and clog the pipe. That pipe took 3 days to get up to the small lake. But at the end, it was there',)", "link": "('javascript:void(0);',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('quote from: srjones on december 15, 2005, 02:36:37 am\\ntoxedo, that is waaaay cool. (très fantastique!)\\ni think micro-hydro is definatly the way to go if you\\'ve got the water to do it. if you don\\'t mind my asking, how did you make the \\'paddles\\' like the one you\\'re holding in your fingers? also, at how many rpms does it run and how is it regulated?\\nalong the same lines, but i\\'m not sure if would be considered alternative energy, is the ram pump. it\\'s low tech (only two moving parts) and pumps water from point a to point b using gravity and hydraulic pressure.\\ni hope to do both someday.\\nexpand quote\\nthanks to you and all the members\\nall explain how -----> i !!!  -----> made !!!  the paddles that -----> i !!!  call spoons:\\nfirst a friend of mine who is a my blacksmith teacher, -----> made !!!  a die to form a half sphere.\\nthen -----> i !!!  put that on my press and -----> made !!!  a lot of them\\nafter that -----> i !!!  used an other tool on the press to form ... i dont know how to call it... but it ressemble to a pair of bumps\\nthird thing to do, was to fill the back of the spoon with weld, and carve one end in a \"w\" form. i also had to sharpen the interior fishbone to make it very sharp so the water jet would be cut in two when hitting the middle of the spoon. that action is made for every single 24 spoon. time consuming since it is a carving job. it is made with different sets of files and small grinding wheels.\\ni welded all the spoon on a 5 inches cicle (made of an old saw) divided in 24\\nafter that i put the wheel on the iron mill, and grinded it while it was turning. (sorry, no picture of that part of the job) i did that to equilibrate everything and minimize vibrations. you see, that wheel can turn very fast with the water pressure, up to 3500 t/m average with a nozzle 3/8 inch wide.\\ni did not invent that kind of wheel as you know. it is a \"pelton\" wheel. an old concept and design. it is supposed to be the more efficient profile for that kind of watermill. i just looked at photos on the net, and tried to make the same. i could have buy the wheel for 5 or 6 hundred dollars, but naaaa ! i like to do the things myself.\\nnext question ?\\nho yes, somebody was asking how it is regulated. well, the pressure is constant, and the nozzle is always the same giving a constant dynamic pressure. (68 psi for now) that can be altered by moisture and algues forming inside the pipe, but i manage to clean it a couple time during each summer.\\ntoxedo\\none more pic\\nat the top, an intake (a plastic barrel with hundreds of small holes) is intalled to prevent any strange big thing to enter and clog the pipe. that pipe took 3 days to get up to the small lake. but at the end, it was there',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 8338, "autor": "doc henderson", "date": 1637366400000, "content": "('I think the safety for your son is you working with him, and setting some rules. my son was 12 when he started using out homemade splitter. the guy pulling the lever, is the guy who is stabilizing the log, and your hand goes on top, not on either end. I built with a 32-inch x 5-inch cylinder, so it is hard for a youngin to have a hand on the valve lever, and the far end of a log. I use stops to decrease the cycle time (so the cylinder does not fully retract) as most of my stuff is about 16 inches so I can feed front to back. with my son operating, I cut run at idle and slow it all down, and it powers through and is quiet enough to communicate without yelling. the worst is to have two young guys working together and one has a hand in the wrong spot, when the other pulls the lever. I have an 18 hp (needed 16) with a 28 gal/min. two stage pump with a 5-inch cylinder. I have considered a dump valve but my plumbing is simple and neat. I use a crane with a lifting tong to place 3-foot logs on the table. I have sides along the edges of the beam to help hold the logs on top. I have a single 18-inch-tall wedge. I made an 8-way split, but more trouble than it is worth. I think I would use a 4 way. If you have lots of materials and a tractor to load. could build a three-point splitter to break the log rounds in half or quarters with an inverted splitter, then move to the horizontal one.',)", "link": "('https://forestryforum.com/board/index.php?topic=117228.msg1865364#msg1865364',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('i think the safety for your son is you working with him, and setting some rules. my son was 12 when he started using out homemade splitter. the guy pulling the lever, is the guy who is stabilizing the log, and your hand goes on top, not on either end. i built with a 32-inch x 5-inch cylinder, so it is hard for a youngin to have a hand on the valve lever, and the far end of a log. i use stops to decrease the cycle time (so the cylinder does not fully retract) as most of my stuff is about 16 inches so i can feed front to back. with my son operating, i cut run at idle and slow it all down, and it powers through and is quiet enough to communicate without yelling. the worst is to have two young guys working together and one has a hand in the wrong spot, when the other pulls the lever. i have an 18 hp (needed 16) with a 28 gal/min. two stage pump with a 5-inch cylinder. i have considered a dump valve but my plumbing is simple and neat. i use a crane with a lifting tong to place 3-foot logs on the table. i have sides along the edges of the beam to help hold the logs on top. i have a single 18-inch-tall wedge. -----> i !!!  -----> made !!!  an 8-way split, but more trouble than it is worth. i think i would use a 4 way. if you have lots of materials and a tractor to load. could build a three-point splitter to break the log rounds in half or quarters with an inverted splitter, then move to the horizontal one.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 8599, "autor": "Southside", "date": 1637366400000, "content": "('Quote from: GRANITEstateMP on November 05, 2021, 03:13:29 PM\\nQuote from: Southside on November 01, 2021, 09:47:12 PM\\nThis fall when finishing up wrapping hay it hit me that I am tying up a 70 HP tractor to turn a simple hydraulc motor when I have a perfectly good hydraulic pump and gas motor sitting 100 yards away waiting for me to split some firewood with. She is getting a couple of quick connects and will be turning the bale wrapper next year using a 5 HP gas motor rather than a 70 HP diesel one.\\nSouthside,\\nWe did the exact thing this year! The ole splitter didn\\'t like the first few wraps when everything was cold. It also didn\\'t like it when it was super hot out (nor did I). It did the trick and runs pretty cheap too!\\nAwesome!! Maybe I should plumb in a cooler then because when we make hay it\\'s definitely what you would call \"super hot\". Makes sense given the small oil volume they hold.\\nHow did you get the bales to dump off? I was thinking of a 3 point hitch type mount and a piston pushing up to replicate what the tractor does.',)", "link": "('https://forestryforum.com/board/index.php?topic=116978.msg1858803#msg1858803',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "('quote from: granitestatemp on november 05, 2021, 03:13:29 pm\\nquote from: southside on november 01, 2021, 09:47:12 pm\\nthis fall when finishing up wrapping hay it hit me that i am tying up a 70 hp tractor to turn a simple hydraulc motor when i have a perfectly good hydraulic pump and gas motor sitting 100 yards away waiting for me to split some firewood with. she is getting a couple of quick connects and will be turning the bale wrapper next year using a 5 hp gas motor rather than a 70 hp diesel one.\\nsouthside,\\nwe did the exact thing this year! the ole splitter didn\\'t like the first few wraps when everything was cold. it also didn\\'t like it when it was super hot out (nor did i). it did the trick and runs pretty cheap too!\\nawesome!! maybe i should plumb in a cooler then because when -----> we !!!  -----> make !!!  hay it\\'s definitely what you would call \"super hot\". makes sense given the small oil volume they hold.\\nhow did you get the bales to dump off? i was thinking of a 3 point hitch type mount and a piston pushing up to replicate what the tractor does.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 8614, "autor": "GRANITEstateMP", "date": 1637366400000, "content": "(\"It's been a couple years since I started this thread. We're still plugging along making big logs into little pieces! We did just short of 100 cord last year, probably 80 - 85% of it on the little processor. I've been hoping to add a live deck onto my little processor, heck I've got the deck, but something always comes up or funds dry up. Here is a few of us processing a few weeks ago.\\nThe Honda motor on my PTO unit bent a valve. Upon further inspection, it's pretty well wore out. My buddy brought his new Kubota over and we ran the processor with that. We hooked my tractor to a borrowed 12ft dump trailer to deliver a cord to a neighbor. It was real nice to have 2 trailers to load into instead of doing a cord and waiting on delivery\\nI'm pretty sure we processed 3 cord of wood that day, delivered 1, and had the processor cleaned up (we make plenty of sawdust and splints) in 3 hrs. We call that a good day!\\nThe brow was getting a little low by the end of the day. I pre-sort logs when they are delivered. Anything too big we keep off to the side and work up with chainsaws and an hydraulic splitter.\\nI was hoping that I had a picture of the brow I made to work with the splitter. It is very basic, just a real heavy wood table that is the same height as the splitter, we can pile the real big pieces on it with the tractor and roll them on the splitter. No need for heavy lifting. An improved discharge table / grate is in the future for the 4ft splitter, but like most things it's not a priority and keeps getting put to the back burner!\\nThis was last fall, my wife's Uncle's truck. I need to either get a taller conveyor, or stick to shorter trucks!\\nThat's about it, got to try and get ready for the next day of processing, gonna try and get a new motor swapped onto my PTO unit tonight once I get home from my real job\",)", "link": "('https://forestryforum.com/board/index.php?topic=95630.msg1659543#msg1659543',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "(\"it's been a couple years since i started this thread. we're still plugging along making big logs into little pieces! we did just short of 100 cord last year, probably 80 - 85% of it on the little processor. i've been hoping to add a live deck onto my little processor, heck i've got the deck, but something always comes up or funds dry up. here is a few of us processing a few weeks ago.\\nthe honda motor on my pto unit bent a valve. upon further inspection, it's pretty well wore out. my buddy brought his new kubota over and we ran the processor with that. we hooked my tractor to a borrowed 12ft dump trailer to deliver a cord to a neighbor. it was real nice to have 2 trailers to load into instead of doing a cord and waiting on delivery\\ni'm pretty sure -----> we !!!  processed 3 cord of wood that day, delivered 1, and had the processor cleaned up (-----> we !!!  -----> make !!!  plenty of sawdust and splints) in 3 hrs. we call that a good day!\\nthe brow was getting a little low by the end of the day. i pre-sort logs when they are delivered. anything too big we keep off to the side and work up with chainsaws and an hydraulic splitter.\\ni was hoping that i had a picture of the brow i made to work with the splitter. it is very basic, just a real heavy wood table that is the same height as the splitter, we can pile the real big pieces on it with the tractor and roll them on the splitter. no need for heavy lifting. an improved discharge table / grate is in the future for the 4ft splitter, but like most things it's not a priority and keeps getting put to the back burner!\\nthis was last fall, my wife's uncle's truck. i need to either get a taller conveyor, or stick to shorter trucks!\\nthat's about it, got to try and get ready for the next day of processing, gonna try and get a new motor swapped onto my pto unit tonight once i get home from my real job\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 9113, "autor": "trapper", "date": 1637366400000, "content": "('Wish i had the new splitter with log lift tree trimmer left a load of honey locust with some butt peices over 30 inches across. Cut them down some with chainsaw but still heavy to resplit. Also some black walnut butt cuts that big. Any black walnut over 4 foot long I will make into lumber. New splitter should be here by end of june.',)", "link": "('https://forestryforum.com/board/index.php?topic=113949.msg1825670#msg1825670',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "('wish i had the new splitter with log lift tree trimmer left a load of honey locust with some butt peices over 30 inches across. cut them down some with chainsaw but still heavy to resplit. also some black walnut butt cuts that big. any black walnut over 4 foot long -----> i !!!  -----> will !!!  -----> make !!!  into lumber. new splitter should be here by end of june.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 9167, "autor": "twobears", "date": 1637366400000, "content": "('THANKS CHUCK> no I don,t drive bus anymore..i,ll just say that my health wasn,t the best and being there made it worse.two days after I quit I felt soooooooooooooooooooooo much better.i was great for awhile then I got sick again.back in march I wokeup unable to breath..i spent 5 days in the hospital with a bloodclot in my lungs.i had just finished tapping my maple trees when I got sick..i came home with orders for complete bedrest..ya,two days of rest then 13 days of nonstop work in the sugarbush then four days off because it got really cold.then we worked in the bush for 20 some days nonstop.one nite we made 56 gallons of finished syrup.i got done with sugaring and sawed all summer.in oct I got a nice order and worked on that till November.on nov 19th back to the ER I went..not taking care of myself caught up with me and I spent another five days in the hospital..but in a way it was a good thing because I feel much better then I have in a very long time.now I just need to figure out a way to keep my bills payed till end of march and things will be good..knock on wood!!! I planned on finishing that lumber order then skidding a bunch of firewood trees out to keep me busy until sugaring started but I couldn,t do what I needed because of being in the hospital.i did get some skidded out but only 16/18 cords.i only have a two wheel drive tractor and can,t get in the woods now..so I guess I need to find a job to keep my bills payed for now..',)", "link": "('https://forestryforum.com/board/index.php?topic=75329.msg1223978#msg1223978',)", "origin": "Forestry", "suborigin": "General Board", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "('thanks chuck> no i don,t drive bus anymore..i,ll just say that my health wasn,t the best and being there made it worse.two days after i quit i felt soooooooooooooooooooooo much better.i was great for awhile then i got sick again.back in march i wokeup unable to breath..i spent 5 days in the hospital with a bloodclot in my lungs.i had just finished tapping my maple trees when i got sick..i came home with orders for complete bedrest..ya,two days of rest then 13 days of nonstop work in the sugarbush then four days off because it got really cold.then -----> we !!!  worked in the bush for 20 some days nonstop.one nite -----> we !!!  -----> made !!!  56 gallons of finished syrup.i got done with sugaring and sawed all summer.in oct i got a nice order and worked on that till november.on nov 19th back to the er i went..not taking care of myself caught up with me and i spent another five days in the hospital..but in a way it was a good thing because i feel much better then i have in a very long time.now i just need to figure out a way to keep my bills payed till end of march and things will be good..knock on wood!!! i planned on finishing that lumber order then skidding a bunch of firewood trees out to keep me busy until sugaring started but i couldn,t do what i needed because of being in the hospital.i did get some skidded out but only 16/18 cords.i only have a two wheel drive tractor and can,t get in the woods now..so i guess i need to find a job to keep my bills payed for now..',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000012, "year": "2021"}, {"Unnamed: 0": 9256, "autor": "Dave Shepard", "date": 1637366400000, "content": "(\"And I thought DeWalt was the most likely to be US made? I'm all Milwaukee. Huge tool selection. Better than corded options. Only one battery platform in the 18-20 volt range, none of the silly 20-60 volt games, or introducing all the same tools 40 volts. I don't question the quality of the new yellow or blue tools, but my red tools all work with all batteries. That's important when you have thousands of dollars invested in one platform.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117373.msg1869369#msg1869369',)", "origin": "Forestry", "suborigin": "General Board", "result": true, "Selector": "us made", "selectorShort": "make", "MarkedSent": "(\"and i thought dewalt was the most likely to be -----> us !!!  -----> made !!! ? i'm all milwaukee. huge tool selection. better than corded options. only one battery platform in the 18-20 volt range, none of the silly 20-60 volt games, or introducing all the same tools 40 volts. i don't question the quality of the new yellow or blue tools, but my red tools all work with all batteries. that's important when you have thousands of dollars invested in one platform.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000012, "year": "2021"}, {"Unnamed: 0": 9724, "autor": "SawyerTed", "date": 1637366400000, "content": "('My other two children are women (girls doesn’t seem right anymore).\\nMy youngest is a senior manager for two stores that sell high end products geared toward Millennials who have disposable income. When she isn’t at that job she is a custom clothing and home apparel designer. Some of her custom products are in fine homes in our area.\\nShe was the one I expected to make the move to New York, Atlanta or the West Coast but she lives in her Grandma’s house about half a mile from here.\\nMost of all, I am proud of her servant’s heart. She makes things for the area hospice centers and nursing homes.\\nIt doesn’t hurt that she can step into my shop, use any tool and make just about anything I can.\\nPlus she will fish with me!',)", "link": "('https://forestryforum.com/board/index.php?topic=117035.msg1861746#msg1861746',)", "origin": "Forestry", "suborigin": "General Board", "result": true, "Selector": "i expected to make", "selectorShort": "make", "MarkedSent": "('my other two children are women (girls doesn’t seem right anymore).\\nmy youngest is a senior manager for two stores that sell high end products geared toward millennials who have disposable income. when she isn’t at that job she is a custom clothing and home apparel designer. some of her custom products are in fine homes in our area.\\nshe was the one -----> i !!!  -----> expected !!!  -----> to !!!  -----> make !!!  the move -----> to !!!  new york, atlanta or the west coast but she lives in her grandma’s house about half a mile from here.\\nmost of all, -----> i !!!  am proud of her servant’s heart. she makes things for the area hospice centers and nursing homes.\\nit doesn’t hurt that she can step into my shop, use any tool and make just about anything i can.\\nplus she will fish with me!',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000012, "year": "2021"}, {"Unnamed: 0": 11310, "autor": "metalspinner", "date": 1637366400000, "content": "('I didn\\'t think to take pics at the time.\\nI have a Grizzley 20\" spiral head and changed the cutter inserts for the first time this weekend.\\nThe job went pretty smooth. After removing the dust hood and head cover, the cutter head was easily accessable. The first thing to do was a good cleaning to remove pitch and build up. I felt like a dental hygenist picking around all those inserts. But I wised up pretty quick and sprayed the whole cutterhead with a pitch solvent and scrubbed with a brass brush. Then shot it with the air compressor to clean away the gunk.\\nAt first I wondered how I would keep track of which way to turn them and which ones had already been turned. But the insert has a little engraving on one corner so that helped. And I made the decision to turn it clockwise a quarter turn. However, the insert screws were torked on there pretty tight. There was one or two on each row that would not give in to my attempts at loosening them and the screw head stripped out. Once I popped each screw loose on an entire row with the hand tool, I went back with a cordless drill and backed out the screw just enough to raise the insert to turn it, then screwed it back down. This idea came only after I dropped the first couple of screws down into the planer bed. After they were all turned and tightened I followed with the hand tool to tighten as best as I could.\\nAll in all it was easy. Next time I will have a couple of back up torx wrenches. The one I had only lasted through the first 75 screws. It was an el cheapo Chinese make from the auto store. Not counting the time it took me to go to the store for another wrench, I spent 70 minutes doing the whole job. I guess a call to Grizzley for a few replacement screws would be a good idea too.',)", "link": "('https://forestryforum.com/board/index.php?topic=52807.msg761855#msg761855',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('i didn\\'t think to take pics at the time.\\ni have a grizzley 20\" spiral head and changed the cutter inserts for the first time this weekend.\\nthe job went pretty smooth. after removing the dust hood and head cover, the cutter head was easily accessable. the first thing to do was a good cleaning to remove pitch and build up. i felt like a dental hygenist picking around all those inserts. but i wised up pretty quick and sprayed the whole cutterhead with a pitch solvent and scrubbed with a brass brush. then shot it with the air compressor to clean away the gunk.\\nat first i wondered how i would keep track of which way to turn them and which ones had already been turned. but the insert has a little engraving on one corner so that helped. and -----> i !!!  -----> made !!!  the decision to turn it clockwise a quarter turn. however, the insert screws were torked on there pretty tight. there was one or two on each row that would not give in to my attempts at loosening them and the screw head stripped out. once i popped each screw loose on an entire row with the hand tool, i went back with a cordless drill and backed out the screw just enough to raise the insert to turn it, then screwed it back down. this idea came only after i dropped the first couple of screws down into the planer bed. after they were all turned and tightened i followed with the hand tool to tighten as best as i could.\\nall in all it was easy. next time i will have a couple of back up torx wrenches. the one i had only lasted through the first 75 screws. it was an el cheapo chinese make from the auto store. not counting the time it took me to go to the store for another wrench, i spent 70 minutes doing the whole job. i guess a call to grizzley for a few replacement screws would be a good idea too.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 11433, "autor": "kantuckid", "date": 1637366400000, "content": "('Quote from: doc henderson on December 07, 2021, 08:37:04 AM\\ndo you have any pics of the ERC stools and the repair/filling with Bondo?\\nI could easily take one but for the fact that I gave both stools to GK\\'s. I do have the paper pattern for that fiddle back stool and can mail it to anyone. I\\'m in that dumb headed group that doesn\\'t find it easy to load pics here! maybe call it lazy? Now that I think it through, I\\'ve got that stool in a bedroom made from osage orange long time ago. I make it with turned short legs-it\\'s more decorative than useful based on the low height.\\nI\\'ll give the pic thing a whirl on Thursday.\\nBondo is a great general use wood filler. In fact there are a few brands of epoxy filler pkg. for log home repairs, rotted wood in older homes, etc.. Same stuff. AB supply house will have variations of cheap vs. not cheap, glass fiber added , so on. The creme hardener I mentioned color varies based on sanding procedures common to AB work where you do a repair in steps and can thus see the additional new material, so on. The trick with a wood repair is that the concave area is best to have a retentional shape that helps keep the fill material in the cavity. I\\'ve also used it with Wormy Chestnut reclaimed wood where repairs are common. Magic marker works to color the filler.\\nERC varies in color. My big log I mentioned is nice but more pinkish than other ERC I\\'ve used-maybe the result of age?\\nA maroon magic marker simulates ERC knots pretty well.\\nI\\'ve used lots of sawdust/glue fillers but they have limitations in look and shrinkage happens too. They virtually never look the same as the wood the dust comes from as the glue darkens the wood flour. IMO there is no perfect wood filler. A plug cutter with well chosen wood comes as close as you\\'ll get other than something more involved in shape. I just got done with an antique stool that came from my Wifes family\\'s old US Post office/country store. It had been \"repaired by a caveman\" and I took it apart and redid it which was more involved than it deserved. One leg had a large split off end that I splice a repair piece to it. It\\'s a cute stool, ash top, maple legs, formerly had casters now flat ends but steam bent legs. The rungs are so eroded from people\\'s feet it\\'s got some serious patina going on. The provenance alone made it a worthwhile job though as that property is now being sold and was in her family a very long time.',)", "link": "('https://forestryforum.com/board/index.php?topic=117296.msg1867149#msg1867149',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "('quote from: doc henderson on december 07, 2021, 08:37:04 am\\ndo you have any pics of the erc stools and the repair/filling with bondo?\\ni could easily take one but for the fact that i gave both stools to gk\\'s. i do have the paper pattern for that fiddle back stool and can mail it to anyone. i\\'m in that dumb headed group that doesn\\'t find it easy to load pics here! maybe call it lazy? now that i think it through, i\\'ve got that stool in a bedroom made from osage orange long time ago. -----> i !!!  -----> make !!!  it with turned short legs-it\\'s more decorative than useful based on the low height.\\ni\\'ll give the pic thing a whirl on thursday.\\nbondo is a great general use wood filler. in fact there are a few brands of epoxy filler pkg. for log home repairs, rotted wood in older homes, etc.. same stuff. ab supply house will have variations of cheap vs. not cheap, glass fiber added , so on. the creme hardener i mentioned color varies based on sanding procedures common to ab work where you do a repair in steps and can thus see the additional new material, so on. the trick with a wood repair is that the concave area is best to have a retentional shape that helps keep the fill material in the cavity. i\\'ve also used it with wormy chestnut reclaimed wood where repairs are common. magic marker works to color the filler.\\nerc varies in color. my big log i mentioned is nice but more pinkish than other erc i\\'ve used-maybe the result of age?\\na maroon magic marker simulates erc knots pretty well.\\ni\\'ve used lots of sawdust/glue fillers but they have limitations in look and shrinkage happens too. they virtually never look the same as the wood the dust comes from as the glue darkens the wood flour. imo there is no perfect wood filler. a plug cutter with well chosen wood comes as close as you\\'ll get other than something more involved in shape. i just got done with an antique stool that came from my wifes family\\'s old us post office/country store. it had been \"repaired by a caveman\" and i took it apart and redid it which was more involved than it deserved. one leg had a large split off end that i splice a repair piece to it. it\\'s a cute stool, ash top, maple legs, formerly had casters now flat ends but steam bent legs. the rungs are so eroded from people\\'s feet it\\'s got some serious patina going on. the provenance alone made it a worthwhile job though as that property is now being sold and was in her family a very long time.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 11503, "autor": "SwampDonkey", "date": 1637366400000, "content": "('I made a wooden tool box once, just out of old scrap tung and grooved spruce. Hinged it, with latch and handle as well. Had nothing much but a couple fisherman type items in there: a bottle cap scale scraper, a club to kill the fish (salmon) and maybe a few wrenches not worth more than $20 for the lot. Some drunk hoodlums took it off the back of the truck one night. I heard the car go down the road they drove bye in. Sounded like the guys were riding the rims to town.\\nThe $20 was worth it.',)", "link": "('https://forestryforum.com/board/index.php?topic=51560.msg749448#msg749448',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('-----> i !!!  -----> made !!!  a wooden tool box once, just out of old scrap tung and grooved spruce. hinged it, with latch and handle as well. had nothing much but a couple fisherman type items in there: a bottle cap scale scraper, a club to kill the fish (salmon) and maybe a few wrenches not worth more than $20 for the lot. some drunk hoodlums took it off the back of the truck one night. i heard the car go down the road they drove bye in. sounded like the guys were riding the rims to town.\\nthe $20 was worth it.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 11790, "autor": "Stuart Caruk", "date": 1637366400000, "content": "(\"Awesome work! I have an Epilog Helix for way more years than I can remember. I bought it after no less than 3 engraving companies went bust and I had to keep finding a new source to engrave my anodized aluminum parts. I use it all the time. One of my favorite uses is with CAD... cardboard aided design...\\nWhen I can't bring my FARO arm to the work, I make a cardboard template and digitize that. Before I cut a saw guide or machine part, I whip a chunk of plywood in the Helix and laser cut it out to make sure everything fits before starting production. A lot of times for saw guides and things with a lot of features, I'll cut it from acrylic so I can see if the bolt holes and threaded parts all line up as well.\\nIt's a super handy tool. I'm listening to it hum as I type cutting out Go - No Go guages for a major sawmill chain.\",)", "link": "('https://forestryforum.com/board/index.php?topic=105401.msg1679298#msg1679298',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "(\"awesome work! i have an epilog helix for way more years than i can remember. i bought it after no less than 3 engraving companies went bust and i had to keep finding a new source to engrave my anodized aluminum parts. i use it all the time. one of my favorite uses is with cad... cardboard aided design...\\nwhen -----> i !!!  can't bring my faro arm to the work, -----> i !!!  -----> make !!!  a cardboard template and digitize that. before i cut a saw guide or machine part, i whip a chunk of plywood in the helix and laser cut it out to make sure everything fits before starting production. a lot of times for saw guides and things with a lot of features, i'll cut it from acrylic so i can see if the bolt holes and threaded parts all line up as well.\\nit's a super handy tool. i'm listening to it hum as i type cutting out go - no go guages for a major sawmill chain.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 12078, "autor": "Old Greenhorn", "date": 1637366400000, "content": "(\"Thanks Doc. I was on the Lee valley site a couple of days ago and could not find any tenon cutters. These are a little pricey for me given the amount of use they would get, but I like your idea of progressive sizing. 1-1/2 was my goal. Just a few benches for around here and my neighbor's place and his fire pit, so they might stay out in the weather. Right now he has some benches I whipped up from slabs and log ends, pretty rough and quick. I have to check my tool crib and see if I still have that 1/2 inch, 1/2 HP hand drill. That's a beast and should work, then I need to make some kind of holding jig.\\nYou make some pretty stuff.\",)", "link": "('https://forestryforum.com/board/index.php?topic=105007.msg1634225#msg1634225',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": "(\"thanks doc. i was on the lee valley site a couple of days ago and could not find any tenon cutters. these are a little pricey for me given the amount of use they would get, but i like your idea of progressive sizing. 1-1/2 was my goal. just a few benches for around here and my neighbor's place and his fire pit, so they might stay out in the weather. right now he has some benches i whipped up from slabs and log ends, pretty rough and quick. i have to check my tool crib and see if i still have that 1/2 inch, 1/2 hp hand drill. that's a beast and should work, then -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  some kind of holding jig.\\nyou -----> make !!!  some pretty stuff.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 12542, "autor": "metalspinner", "date": 1637366400000, "content": "('Let\\'s talk about first aid kits in the workshop!\\nI have the basic stuff like bandages, tape, gauze, ointments, etc.\\nBut earlier this week, my ring finger had a run in with a chainsaw tooth. The saw was not on or running. I bent down to pick up some pieces I had just cut and pulled my finger across a tooth at the nose of the bar... I pulled it a full inch until I thought to stop.\\nI went in and washed it and immediately recognized this was worse than the typical deep scratch. I wrapped it with a piece of paper towel and walked to my neighbors house. He was cutting his grass and just happens to be a flight nurse for UT Lifestar.\\nHe saw me standing there with a bloodied rag on my finger and just kind of giggled to himself. He took me over to his carport and grabbed is big bag of stuff from his car and patched me up. He mentioned if I went to the ER they would probably put a stitch or two in it. But he glued it with \"superglue\" swab then wrapped it stiff so I couldn\\'t bend or flex the finger, as this would just continually open the wound up.\\nSo for the past couple days, I\\'ve had this stiff finger hindering me in the shop.\\nBut this got me reevaluating my box of first aid stuff and what upgrades need to be made.\\nI\\'m hoping our resident healthcare experts can chime in so we can all make a good shopping list and maybe even get advice on bigger worse case scenario preparations that need ER visits.\\nBTW, my favorite bandage brand has become Nexcare. The adhesive is very sticky and they are waterproof. It will stay on for several days without peeling at the edges.',)", "link": "('https://forestryforum.com/board/index.php?topic=116607.msg1849795#msg1849795',)", "origin": "Forestry", "suborigin": "Health and Safety", "result": true, "Selector": "we can all make", "selectorShort": "make", "MarkedSent": "('let\\'s talk about first aid kits in the workshop!\\ni have the basic stuff like bandages, tape, gauze, ointments, etc.\\nbut earlier this week, my ring finger had a run in with a chainsaw tooth. the saw was not on or running. i bent down to pick up some pieces i had just cut and pulled my finger across a tooth at the nose of the bar... i pulled it a full inch until i thought to stop.\\ni went in and washed it and immediately recognized this was worse than the typical deep scratch. i wrapped it with a piece of paper towel and walked to my neighbors house. he was cutting his grass and just happens to be a flight nurse for ut lifestar.\\nhe saw me standing there with a bloodied rag on my finger and just kind of giggled to himself. he took me over to his carport and grabbed is big bag of stuff from his car and patched me up. he mentioned if i went to the er they would probably put a stitch or two in it. but he glued it with \"superglue\" swab then wrapped it stiff so i couldn\\'t bend or flex the finger, as this would just continually open the wound up.\\nso for the past couple days, i\\'ve had this stiff finger hindering me in the shop.\\nbut this got me reevaluating my box of first aid stuff and what upgrades need to be made.\\ni\\'m hoping our resident healthcare experts -----> can !!!  chime in so -----> we !!!  -----> can !!!  -----> all !!!  -----> make !!!  a good shopping list and maybe even get advice on bigger worse case scenario preparations that need er visits.\\nbtw, my favorite bandage brand has become nexcare. the adhesive is very sticky and they are waterproof. it will stay on for several days without peeling at the edges.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000015, "year": "2021"}, {"Unnamed: 0": 14322, "autor": "thecfarm", "date": 1637366400000, "content": "('I have a truck road that goes to the bog. I suppose you could drive a truck across the bog too. Holds up a forwarder with a load of logs. But anyways, back to the bear, only had to drag it about 150 feet. He shot it in the bog. I was sinking in walking in. Keep the tractor away from that area. Did not need it anyways. I drove the truck down and was going to get the tractor, if it was needed. Hunter grabbed one leg, I grabbed the other and off we went. The Old Man had to stop about 4-5 times, but we made it.',)", "link": "('https://forestryforum.com/board/index.php?topic=116474.msg1846590#msg1846590',)", "origin": "Forestry", "suborigin": "The Outdoor Board", "result": true, "Selector": "we made", "selectorShort": "make", "MarkedSent": "('i have a truck road that goes to the bog. i suppose you could drive a truck across the bog too. holds up a forwarder with a load of logs. but anyways, back to the bear, only had to drag it about 150 feet. he shot it in the bog. i was sinking in walking in. keep the tractor away from that area. did not need it anyways. i drove the truck down and was going to get the tractor, if it was needed. hunter grabbed one leg, i grabbed the other and off we went. the old man had to stop about 4-5 times, but -----> we !!!  -----> made !!!  it.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000016, "year": "2021"}, {"Unnamed: 0": 15117, "autor": "Old Greenhorn", "date": 1637366400000, "content": "(\"Looks like a good time Jim. The Big E is 2 hours east of me. I go there occasionally for machine tool shows in the spring. I had not heard of this one and assume it is a general fair type thing and the 'lumberjack' show was just a piece of it? Or was it a wood products/forestry show? That I would have made the drive for.\\nThe Catskill Forestry Assoc doe a summer even with all sorts of products that come out of the Catskills. There is lots of forestry stuff, consultants, loggers, wood products, milling demos and a small GOL competition. It's a lot of fun, but I missed it this year. I have thought of entering the GOL thing, but I am an old man and I don't want to make the kids look bad. I understand the fella that won here this summer went on the the regionals and did well. I'll meet him at a class I am taking next week.\",)", "link": "('https://forestryforum.com/board/index.php?topic=107845.msg1682116#msg1682116',)", "origin": "Forestry", "suborigin": "Shows, Events and Places to meet", "result": true, "Selector": "i would have made", "selectorShort": "make", "MarkedSent": "(\"looks like a good time jim. the big e is 2 hours east of me. i go there occasionally for machine tool shows in the spring. i had not heard of this one and assume it is a general fair type thing and the 'lumberjack' show was just a piece of it? or was it a wood products/forestry show? that -----> i !!!  -----> would !!!  -----> have !!!  -----> made !!!  the drive for.\\nthe catskill forestry assoc doe a summer even with all sorts of products that come out of the catskills. there is lots of forestry stuff, consultants, loggers, wood products, milling demos and a small gol competition. it's a lot of fun, but i missed it this year. i have thought of entering the gol thing, but i am an old man and i don't want to make the kids look bad. i understand the fella that won here this summer went on the the regionals and did well. i'll meet him at a class i am taking next week.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000018, "year": "2021"}, {"Unnamed: 0": 16834, "autor": "Jeff", "date": 1637366400000, "content": "('My brother-in-law bought one of those economy level side by side UTVs from Tractor supply this fa;; and had trouble with it from day one. When pushing the choke in after starting, the knob would never quite seat right, and the engine was always acting like it was choking out. We decided to try and adjust the choke cable as it looked like it had been put together incorrectly at the carb. We tried this and we tried that, repeatedly re-positioning and adjusting the cable. Nothing we did made things better on this basically new machine. I then remembered the little precision applicator of Bluecreeper I keep in my truck. I went and got it and put a couple drops on the cable at one end, and a couple drops on the other end, and a drop or two on the carb linkage. As close as to instant as you can get, the cable started working properly and the chole opening and closing as it should. The engine stopped smoking from the extra fuel dumping in it, and it now starts good cold or warm. All because of a couple three drops of Bluecreeper.',)", "link": "('https://forestryforum.com/board/index.php?topic=86749.msg1328545#msg1328545',)", "origin": "Forestry", "suborigin": "Bluecreeper", "result": true, "Selector": "we did made", "selectorShort": "make", "MarkedSent": "('my brother-in-law bought one of those economy level side by side utvs from tractor supply this fa;; and had trouble with it from day one. when pushing the choke in after starting, the knob would never quite seat right, and the engine was always acting like it was choking out. we decided to try and adjust the choke cable as it looked like it had been put together incorrectly at the carb. we tried this and we tried that, repeatedly re-positioning and adjusting the cable. nothing -----> we !!!  -----> did !!!  -----> made !!!  things better on this basically new machine. i then remembered the little precision applicator of bluecreeper i keep in my truck. i went and got it and put a couple drops on the cable at one end, and a couple drops on the other end, and a drop or two on the carb linkage. as close as to instant as you can get, the cable started working properly and the chole opening and closing as it should. the engine stopped smoking from the extra fuel dumping in it, and it now starts good cold or warm. all because of a couple three drops of bluecreeper.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000025, "year": "2021"}, {"Unnamed: 0": 16981, "autor": "Compensation", "date": 1637366400000, "content": "(\"I am a industrial maintenance tech and work at a factory. We use a tote of degreaser every two months or so. I built a soap mixer that fills up mop buckets with an exact percentage that's hooked directly to a tote. We now have a corrosive degreaser that I am not fond of around my machines. Before I made the mixer and cut off their direct supply, some guys were using 2 gallons per mop bucket of degreaser. So you could tell these guys to use 1 or 2 drops of blue creeper and they would still soak the daylights out of it. There is no changing that no matter how much we try. There has been meetings trying to change that but some people decide they know better I guess.\\nI would bet that if we got rid of our wd40, industrial lube, air tool oil, and air line lube we would use 55 gallons in about 4-6 months.\",)", "link": "('https://forestryforum.com/board/index.php?topic=77549.msg1177346#msg1177346',)", "origin": "Forestry", "suborigin": "Bluecreeper", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "(\"i am a industrial maintenance tech and work at a factory. we use a tote of degreaser every two months or so. i built a soap mixer that fills up mop buckets with an exact percentage that's hooked directly to a tote. we now have a corrosive degreaser that i am not fond of around my machines. before -----> i !!!  -----> made !!!  the mixer and cut off their direct supply, some guys were using 2 gallons per mop bucket of degreaser. so you could tell these guys to use 1 or 2 drops of blue creeper and they would still soak the daylights out of it. there is no changing that no matter how much we try. there has been meetings trying to change that but some people decide they know better i guess.\\ni would bet that if we got rid of our wd40, industrial lube, air tool oil, and air line lube we would use 55 gallons in about 4-6 months.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000025, "year": "2021"}, {"Unnamed: 0": 17019, "autor": "Tam-i-am", "date": 1637366400000, "content": "('Jason_AliceMae Farms\\nThanks for the praise\\nLogrite will be represented by Carl Nuetzel Services at the Richmond Expo. If you are looking for a particular tool let me know so I can make sure he has what you want.\\nAnd yes he will have some Bluecreeper too.',)", "link": "('https://forestryforum.com/board/index.php?topic=73536.msg1113301#msg1113301',)", "origin": "Forestry", "suborigin": "Bluecreeper", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "('jason_alicemae farms\\nthanks for the praise\\nlogrite will be represented by carl nuetzel services at the richmond expo. if you are looking for a particular tool let me know so -----> i !!!  -----> can !!!  -----> make !!!  sure he has what you want.\\nand yes he will have some bluecreeper too.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000025, "year": "2021"}, {"Unnamed: 0": 17249, "autor": "Tam-i-am", "date": 1637366400000, "content": "('Yes, the Fetching arch is the only one designed to do that. However, we have made custom pieces for the Tractor arches and even the Buck to do that. However, there are limitations for all of those. Have him call us and we will chat and see if a modified buck will work for his situation.\\nThanks John for the promotion of our products.\\nTammy',)", "link": "('https://forestryforum.com/board/index.php?topic=108865.msg1700876#msg1700876',)", "origin": "Forestry", "suborigin": "LogRite Tools and Rite Leg Co", "result": true, "Selector": "we have made", "selectorShort": "make", "MarkedSent": "('yes, the fetching arch is the only one designed to do that. however, -----> we !!!  -----> have !!!  -----> made !!!  custom pieces for the tractor arches and even the buck to do that. however, there are limitations for all of those. have him call us and we will chat and see if a modified buck will work for his situation.\\nthanks john for the promotion of our products.\\ntammy',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000028, "year": "2021"}, {"Unnamed: 0": 18111, "autor": "Agman55", "date": 1637366400000, "content": "(\"Thank you Rusticretreater, that is some good information, I really appreciate it! It sure is an exciting time, however, I will be even more excited when it shows up!\\nI too will have my mill under cover, in a building of its own, with a slab under it, of course making sure to have clearance for the log dogs or whatever else, as you mentioned. I have a good size loader tractor that should be able to handle the head weight so hopefully that won't be an issue. I can see from all the research I've done, along with the great info I've gotten from you folks here, that there will be a learning curve and lots of things to keep in mind in the beginning, I imagine the more one uses these mills it appears that curve seems to dissipate some so I will make sure I take things slower at first until I get more familiar with the mill.\\nI have a lot of woods and many many trees to cut and mill so I won't have any problem keeping the mill busy! Right now is just a waiting game and working on getting things set up for delivery.\\nThanks again to everyone who has given me some great information and helped me in this endeavor.\",)", "link": "('https://forestryforum.com/board/index.php?topic=116746.msg1862657#msg1862657',)", "origin": "Forestry", "suborigin": "Woodland Mills", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "(\"thank you rusticretreater, that is some good information, i really appreciate it! it sure is an exciting time, however, i will be even more excited when it shows up!\\ni too will have my mill under cover, in a building of its own, with a slab under it, of course making sure to have clearance for the log dogs or whatever else, as you mentioned. i have a good size loader tractor that should be able to handle the head weight so hopefully that won't be an issue. -----> i !!!  can see from all the research -----> i !!! 've done, along with the great info -----> i !!! 've gotten from you folks here, that there -----> will !!!  be a learning curve and lots of things to keep in mind in the beginning, -----> i !!!  imagine the more one uses these mills it appears that curve seems to dissipate some so -----> i !!!  -----> will !!!  -----> make !!!  sure -----> i !!!  take things slower at first until -----> i !!!  get more familiar with the mill.\\ni have a lot of woods and many many trees to cut and mill so -----> i !!!  won't have any problem keeping the mill busy! right now is just a waiting game and working on getting things set up for delivery.\\nthanks again to everyone who has given me some great information and helped me in this endeavor.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000034, "year": "2021"}, {"Unnamed: 0": 18158, "autor": "Dana Stanley", "date": 1637366400000, "content": "('<br\\nHi All I am new to saw milling, I just bought a Woodland Mills HM-126. I have been busy buying things to move logs, check for nails, cut big logs, extend the bed, etc. Real life keeps getting in the way so so far all I\\'ve been able to do is assemble the track, and planning. I have a layout for the area I am setting it up in, and am planning a shed, and canopy, plus a trailer for it, as well as a trailer for hauling upto 3500 lbs of logs.\\nI am looking into buying logs from local tree services, as well as charging to take down trees, and harvesting the logs (paid to take free wood). If I find a good local source I can avoid that, but I am willing and able if I need to for now. I could use some ideas for finding sources?\\nSome of the equipment I have so far are (bear in mind I know I am a hobby mill and have no delusions of being the local wood mill king) So I have:\\nThe Mill HM-126\\n10\\' extension for the mill, angle and tube steel (I can fabricate and enjoy doing it)\\nMy truck 2002 Ranger ( no logs in that)\\n4-chainsaws 2-16\", 20\",24\" The 24\" is a Mac 610 someone gave me, I had to fix the chain adjuster, and I just bought a 24\" bar and chain for it (saved $500.00) One of the 16\" was another freebie, I cleaned changed the fuel Primed the carb started right up, and runs great (saved $150.00 there) I like saving $$$.\\nKabota 7500 tractor w backhoe. Hoe comes off in 2 minutes, I can use it for skidding and some lifting of logs.\\nSkidding attachment/trailer hitch for 3 point hitch $100.00 on line (not sure if I am allowed to post name of brand, got it for mill)\\nSkidding tongs $35.00\\n30\" bucket pallet forks 1500# capacity $100.00(same brand as Skid attachment, bucket is rated for 850#s)\\nHome made pevey I made a while back and a $35.00 steel cant hook /jack stand.\\nmetal detector $35.00 Amazon ( tested it wit a drywall screw under 3 2x6s works good)\\n5-pack wood mizer blades (need advise on blades as I have read here that 4 degree is better than 10 degree for longevity, and straightness of cutin hardwoods?)\\nI have some ropes, if I end up getting my own logs, and bought a weighted bag for tossing over branches.\\nI have a trailer I may extend it and add another 2000# axle, or strip it and use material to build a longer one as it is 6\\'x8\\', and I want 12\\'or 14\\' long.\\nThe plan is to make a 10X12 shed for over the saw head. and a 10x20 canopy over the track, with a tarp and wood cover for the track in the winter. So the first logs I cut will be for the shed. I plan on making a loading deck and feeding logs from behind, so I need to add a stop or two on the opposite side of the 3x6 tubing that holds the track together. I should have a 20\\'-6\"capacity when I add the extension.\\nI am also planning a trailer that will have a 16\\' plus capacity. I can fabricate that for around $650.00. I will just use the tractor to lift the saw head off the stationary track and put it on the trailer track! That\\'s only if I see a need to make it portable. I would enjoy making it, but it would be an unnecessary expense if I don\\'t really need it.\\nIll post trailer, and shed plans, and pics of the mill as I progress if anyone is interested.\\n>',)", "link": "('https://forestryforum.com/board/index.php?topic=102758.msg1596516#msg1596516',)", "origin": "Forestry", "suborigin": "Woodland Mills", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "('<br\\nhi all i am new to saw milling, i just bought a woodland mills hm-126. i have been busy buying things to move logs, check for nails, cut big logs, extend the bed, etc. real life keeps getting in the way so so far all i\\'ve been able to do is assemble the track, and planning. i have a layout for the area i am setting it up in, and am planning a shed, and canopy, plus a trailer for it, as well as a trailer for hauling upto 3500 lbs of logs.\\ni am looking into buying logs from local tree services, as well as charging to take down trees, and harvesting the logs (paid to take free wood). if i find a good local source i can avoid that, but i am willing and able if i need to for now. i could use some ideas for finding sources?\\nsome of the equipment i have so far are (bear in mind i know i am a hobby mill and have no delusions of being the local wood mill king) so i have:\\nthe mill hm-126\\n10\\' extension for the mill, angle and tube steel (i can fabricate and enjoy doing it)\\nmy truck 2002 ranger ( no logs in that)\\n4-chainsaws 2-16\", 20\",24\" the 24\" is a mac 610 someone gave me, i had to fix the chain adjuster, and i just bought a 24\" bar and chain for it (saved $500.00) one of the 16\" was another freebie, i cleaned changed the fuel primed the carb started right up, and runs great (saved $150.00 there) i like saving $$$.\\nkabota 7500 tractor w backhoe. hoe comes off in 2 minutes, -----> i !!!  can use it for skidding and some lifting of logs.\\nskidding attachment/trailer hitch for 3 point hitch $100.00 on line (not sure if -----> i !!!  am allowed to post name of brand, got it for mill)\\nskidding tongs $35.00\\n30\" bucket pallet forks 1500# capacity $100.00(same brand as skid attachment, bucket is rated for 850#s)\\nhome -----> made !!!  pevey -----> i !!!  -----> made !!!  a while back and a $35.00 steel cant hook /jack stand.\\nmetal detector $35.00 amazon ( tested it wit a drywall screw under 3 2x6s works good)\\n5-pack wood mizer blades (need advise on blades as -----> i !!!  have read here that 4 degree is better than 10 degree for longevity, and straightness of cutin hardwoods?)\\ni have some ropes, if -----> i !!!  end up getting my own logs, and bought a weighted bag for tossing over branches.\\ni have a trailer -----> i !!!  may extend it and add another 2000# axle, or strip it and use material to build a longer one as it is 6\\'x8\\', and -----> i !!!  want 12\\'or 14\\' long.\\nthe plan is to make a 10x12 shed for over the saw head. and a 10x20 canopy over the track, with a tarp and wood cover for the track in the winter. so the first logs i cut will be for the shed. i plan on making a loading deck and feeding logs from behind, so i need to add a stop or two on the opposite side of the 3x6 tubing that holds the track together. i should have a 20\\'-6\"capacity when i add the extension.\\ni am also planning a trailer that will have a 16\\' plus capacity. i can fabricate that for around $650.00. i will just use the tractor to lift the saw head off the stationary track and put it on the trailer track! that\\'s only if i see a need to make it portable. i would enjoy making it, but it would be an unnecessary expense if i don\\'t really need it.\\nill post trailer, and shed plans, and pics of the mill as i progress if anyone is interested.\\n>',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000034, "year": "2021"}], "name": "make2021"}