{"interestingcomments": [{"Unnamed: 0": 1144, "autor": "bigblue12v", "date": 1637366400000, "content": "(\"Quote from: DeerMeadowFarm on October 12, 2015, 03:06:14 PM\\nDoes the rear winch plate go up and down or is it fixed position? Looks good!\\nFixed, and thanks!\\nQuote from: mad murdock on October 12, 2015, 03:27:35 PM\\nLooks real fine. One suggestion, if you can fab a small arch with a horizontal roller on it, it will make things much better on the drag, as it will put more weight on the machine when you winch in, and go to drive out with a hitch on.\\nBeen thinking about it, however this thing has less than 5' wheelbase and flat land timber is almost non existent here. Tractor logging winches are pretty similar to this and I compare this machine to a compact tractor, so I figure someone else has already done the homework. That being said I'd like to come up with a small adjustable or removable arch to try and see how it does with it. Come to think of it, I could make one out of square tube that would slide into the receiver hitch and pin to those tabs on the sides of the winch frame. That would be simple and removable quick and easy if needed.\\nPicked up gliders and chokers yesterday. Mounted the saw scabbards and put the steps back on. Primered all my bare steel and notched the lower fairlead bracket so the gliders might have better clearance if pulling straight up. I'm wanting to add a log grapple to the blade so I can pickup more nose weight and move things easier. In the last pic, where the orange level is propped up, I think I'll put safety screen from there to just behind the saws, and will put screen on the sides from hood to top of cage. Still need to find a place to mount a tool box and pickup some sheet metal for the roof, it will slope up over top of the original ROP bar in back.\\nThoughts and input welcome as always. Thanks!\",)", "link": "('https://forestryforum.com/board/index.php?topic=86106.msg1319040#msg1319040',)", "origin": "Forestry", "suborigin": "Forestry and Logging", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "(\"quote from: deermeadowfarm on october 12, 2015, 03:06:14 pm\\ndoes the rear winch plate go up and down or is it fixed position? looks good!\\nfixed, and thanks!\\nquote from: mad murdock on october 12, 2015, 03:27:35 pm\\nlooks real fine. one suggestion, if you can fab a small arch with a horizontal roller on it, it will make things much better on the drag, as it will put more weight on the machine when you winch in, and go to drive out with a hitch on.\\nbeen thinking about it, however this thing has less than 5' wheelbase and flat land timber is almost non existent here. tractor logging winches are pretty similar to this and i compare this machine to a compact tractor, so i figure someone else has already done the homework. that being said i'd like to -----> come !!!  -----> up !!!  -----> with !!!  a small adjustable or removable arch to try and see how it does -----> with !!!  it. come to think of it, i could make one out of square tube that would slide into the receiver hitch and pin to those tabs on the sides of the winch frame. that would be simple and removable quick and easy if needed.\\npicked up gliders and chokers yesterday. mounted the saw scabbards and put the steps back on. primered all my bare steel and notched the lower fairlead bracket so the gliders might have better clearance if pulling straight up. i'm wanting to add a log grapple to the blade so i can pickup more nose weight and move things easier. in the last pic, where the orange level is propped up, i think i'll put safety screen from there to just behind the saws, and will put screen on the sides from hood to top of cage. still need to find a place to mount a tool box and pickup some sheet metal for the roof, it will slope up over top of the original rop bar in back.\\nthoughts and input welcome as always. thanks!\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000001, "year": "2021"}, {"Unnamed: 0": 2368, "autor": "doc henderson", "date": 1637366400000, "content": "('interesting concept. It reminds me of the gun debate. in areas of the Midwest knowledge is passed down generation to generation, but they did come up with hunters safety in the mid seventies. so the chainsaw did not kill him, but the weight of the tree. I think as part of a business, you will have some liability if best practices and included training is not demonstrated. It is funny, but to use a chainsaw at a scout camp, requires a chainsaw safety course and certificate. otherwise a camp ranger can use one or authorize the use. there are requirements for road construction and mining such as rock quarries by federal agencies. The tree services have all kinds of safety rules. i.e. working in a tree above a certain height, and you must have a watcher and safety harness.',)", "link": "('https://forestryforum.com/board/index.php?topic=113849.msg1791928#msg1791928',)", "origin": "Forestry", "suborigin": "Forest Education", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "('interesting concept. it reminds me of the gun debate. in areas of the midwest knowledge is passed down generation to generation, but they did -----> come !!!  -----> up !!!  -----> with !!!  hunters safety in the mid seventies. so the chainsaw did not kill him, but the weight of the tree. i think as part of a business, you will have some liability if best practices and included training is not demonstrated. it is funny, but to use a chainsaw at a scout camp, requires a chainsaw safety course and certificate. otherwise a camp ranger can use one or authorize the use. there are requirements for road construction and mining such as rock quarries by federal agencies. the tree services have all kinds of safety rules. i.e. working in a tree above a certain height, and you must have a watcher and safety harness.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000003, "year": "2021"}, {"Unnamed: 0": 3134, "autor": "mike_belben", "date": 1637366400000, "content": "('If you bought the land cheap enough and did multiple uses, yes, it can be done absolutely for certain.\\nJust selling logs off it, youll be depleting the one crop of your lifetime very quickly and probably ruining it for the next lifetime.\\nA diameter limit cut removes the fastest, most robust growing stock for max cash now. With every successive DLC, the stand moves to a higher and higher stocking of trees that are slow growing and may never achieve harvest size because theyre literally just about dead. 13\" diameter at 150 years old, that sorta thing. If you buy a mature forest thats had 4 generations of DLC cutting then its one big pile of mostly stalled wood and is probably mostly low grade.. Youd be looking at a volume sawing operation with low margin. Can you swing buying the land, a serious sawmill, loader, skidder etc etc? Not without lotto. Anything young and fast growing within a high graded mature forest will be twisty or shade tolerant and low value.\\nNow weve got to recognize that theres a huge difference in acres, and in equipment required, to make a living in pallet wood compared to finished, delivered, curly figured epoxy tables for the rich. That could be as little as an alaskan mill and a serious woodshop plus talent and a market.. Willingness to travel, to do custom for fussy customers, to install etc.\\nTheres a huge difference in how many loads of veneer per acre vs how many loads of crosstie per acre come out of a forest. And in how much labor youll do to hit that same money figure in each one.\\nAnd theres a huge difference in what the land will cost you with an even aged high value forest that grew up uncut from pasture, vs a forest where every earl, terry and jerry ray have cut over. The locals all know where the prime tract is to try buying timber from. Only a person with money has resisted this long, and they arent selling cheap to non-kin. When it goes for sale, it goes on the internet looking for ted turner bidding.\\nThe cheapest land is a clearcut. An abused one thats got a junkyard on it or an old rock quarry or powerline and bunch of fallen down trailer shacks to clean up, garbage everywhere, briar fields. A clearcut also produces the best timber crop for the generation that gets it after you expire.\\nIf you insist on owning all the acres, come up with a plan where you can making a living from a lot of clearcut. I say this because 500 acres of good timber is corporate priced and theyve got debt leveraged portfolios at almost zero interest to bid with, itll break a common man. You will be up to your ears to pay for a large, good forest in the lumber boom, stock boom era. the temptation to harvest it short sightedly will be very very high.\\nYou can grow a lot of animals to sell on 100 acres of sunshine with mild winters and good rain.',)", "link": "('https://forestryforum.com/board/index.php?topic=116286.msg1841974#msg1841974',)", "origin": "Forestry", "suborigin": "Ask The Forester", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "('if you bought the land cheap enough and did multiple uses, yes, it can be done absolutely for certain.\\njust selling logs off it, youll be depleting the one crop of your lifetime very quickly and probably ruining it for the next lifetime.\\na diameter limit cut removes the fastest, most robust growing stock for max cash now. with every successive dlc, the stand moves to a higher and higher stocking of trees that are slow growing and may never achieve harvest size because theyre literally just about dead. 13\" diameter at 150 years old, that sorta thing. if you buy a mature forest thats had 4 generations of dlc cutting then its one big pile of mostly stalled wood and is probably mostly low grade.. youd be looking at a volume sawing operation with low margin. can you swing buying the land, a serious sawmill, loader, skidder etc etc? not without lotto. anything young and fast growing within a high graded mature forest will be twisty or shade tolerant and low value.\\nnow weve got to recognize that theres a huge difference in acres, and in equipment required, to make a living in pallet wood compared to finished, delivered, curly figured epoxy tables for the rich. that could be as little as an alaskan mill and a serious woodshop plus talent and a market.. willingness to travel, to do custom for fussy customers, to install etc.\\ntheres a huge difference in how many loads of veneer per acre vs how many loads of crosstie per acre come out of a forest. and in how much labor youll do to hit that same money figure in each one.\\nand theres a huge difference in what the land will cost you with an even aged high value forest that grew up uncut from pasture, vs a forest where every earl, terry and jerry ray have cut over. the locals all know where the prime tract is to try buying timber from. only a person with money has resisted this long, and they arent selling cheap to non-kin. when it goes for sale, it goes on the internet looking for ted turner bidding.\\nthe cheapest land is a clearcut. an abused one thats got a junkyard on it or an old rock quarry or powerline and bunch of fallen down trailer shacks to clean up, garbage everywhere, briar fields. a clearcut also produces the best timber crop for the generation that gets it after you expire.\\nif you insist on owning all the acres, -----> come !!!  -----> up !!!  -----> with !!!  a plan where you can making a living from a lot of clearcut. i say this because 500 acres of good timber is corporate priced and theyve got debt leveraged portfolios at almost zero interest to bid with, itll break a common man. you will be up to your ears to pay for a large, good forest in the lumber boom, stock boom era. the temptation to harvest it short sightedly will be very very high.\\nyou can grow a lot of animals to sell on 100 acres of sunshine with mild winters and good rain.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000004, "year": "2021"}, {"Unnamed: 0": 3896, "autor": "SETexan", "date": 1637366400000, "content": "('I finally got around to working on my winch mount for loading bigger logs. I’m limited to around 1,100lbs. with my tractor so I cut some 5X5 white oak ramps and had a free winch(2,000lb.) with some square tubing and come up with this.\\nThe log is 10’-8” 22” on the small end and 24” on the large. Has been down for a year but still plenty heavy. I was worried about the winch and the tubing as it’s 1/8” wall. The winch never cut out or sounded like it was maxed and the tubing held up great. I was checking the frame when I started winching but it didn’t move at all. It’s the factory location for their manual winch setup so I figured it would be ok. There is a little slack between the two pieces of tubing which does cause it to tilt some. I also have the winch plate welded on 20 degrees down which seems to be a little to much for this size log but I’ll probably go with it for now.',)", "link": "('https://forestryforum.com/board/index.php?topic=116719.msg1867536#msg1867536',)", "origin": "Forestry", "suborigin": "Sawmills and Milling", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "('i finally got around to working on my winch mount for loading bigger logs. i’m limited to around 1,100lbs. with my tractor so i cut some 5x5 white oak ramps and had a free winch(2,000lb.) -----> with !!!  some square tubing and -----> come !!!  -----> up !!!  -----> with !!!  this.\\nthe log is 10’-8” 22” on the small end and 24” on the large. has been down for a year but still plenty heavy. i was worried about the winch and the tubing as it’s 1/8” wall. the winch never cut out or sounded like it was maxed and the tubing held up great. i was checking the frame when i started winching but it didn’t move at all. it’s the factory location for their manual winch setup so i figured it would be ok. there is a little slack between the two pieces of tubing which does cause it to tilt some. i also have the winch plate welded on 20 degrees down which seems to be a little to much for this size log but i’ll probably go with it for now.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000005, "year": "2021"}, {"Unnamed: 0": 3948, "autor": "customsawyer", "date": 1637366400000, "content": "(\"Well like the old saying goes. Give a lazy man a job and he will figure out a easier way to do it. Since I'm short handed around here and having to do a lot of different task by myself. I had to come up with a easier way to get the Lucus through the log. I added a boat trailer winch to the top of the frame by the engine. Then ran the rope through a pulley tied to my tractor and back to the frame opposite the engine. It's not perfect as I probably won't be able to use it when the mill is all the way up, but it sure saves the back when you can use it.\",)", "link": "('https://forestryforum.com/board/index.php?topic=117275.msg1867645#msg1867645',)", "origin": "Forestry", "suborigin": "Sawmills and Milling", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "(\"well like the old saying goes. give a lazy man a job and he will figure out a easier way to do it. since i'm short handed around here and having to do a lot of different task by myself. i had to -----> come !!!  -----> up !!!  -----> with !!!  a easier way to get the lucus through the log. i added a boat trailer winch to the top of the frame by the engine. then ran the rope through a pulley tied to my tractor and back to the frame opposite the engine. it's not perfect as i probably won't be able to use it when the mill is all the way up, but it sure saves the back when you can use it.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000005, "year": "2021"}, {"Unnamed: 0": 6938, "autor": "kantuckid", "date": 1637366400000, "content": "(\"If this thread catches someone's eye, I have built some small furniture crafts and several large Appalachian, turned style rocking chairs with osage orange wood. It's not a species that lends itself to timber framing, as very difficult to come up with logs long enough to make parts for a building with much size to it.\\nAll of my wood came from a sawmill once located near Perry, KS, sawn by a man who specialized in that tree for livestock trailer flooring. He sawed some green logs for me and allowed me the run of his lumber piles to pick & choose at will. None was sawed for timber framing for sure, but I can assure you that there were VERY FEW beams or boards that had that potential. 6-7' is a longish piece off of that tree. A few longer but not much more than that.\\nWhile its very strong and hard, it's also often full of defects. It is a wood that darkens with exposure to light and air to a fairly dark brown color over time, any finish will only slow down the inevitable move from that yellow to golden honey color to dark brown. It chips easily in spite of strength. Very tough on planer blades. The notion of a chainsaw mill is not something I'd lean towards. If you had a beam sawed from osage orange you best have lots of help to lift it!\\nGiven my age it was the common fence post wood on KS farms in eastern ~ third of the state & across fly over land states where it grows for a good part of my younger years until steel then PT posts caught on. Be a lucky find to locate an old headgerow what with longer trunks and not been dozed down for no-till farming as they were mostly removed some years back. Most any farmer there had a pile of osage post wood in line posts and corner post sizes. One of my living room lamps is turned from a Shawnee Co, KS corner post. The species when polished has an opalescence that reflects light similar to a mans ring- Tiger-eye gemstone. I've also turned rolling pins and ladies bracelets from osage orange.\",)", "link": "('https://forestryforum.com/board/index.php?topic=6269.msg1867127#msg1867127',)", "origin": "Forestry", "suborigin": "Timber Framing/Log construction", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "(\"if this thread catches someone's eye, i have built some small furniture crafts and several large appalachian, turned style rocking chairs with osage orange wood. it's not a species that lends itself to timber framing, as very difficult to -----> come !!!  -----> up !!!  -----> with !!!  logs long enough to make parts for a building -----> with !!!  much size to it.\\nall of my wood came from a sawmill once located near perry, ks, sawn by a man who specialized in that tree for livestock trailer flooring. he sawed some green logs for me and allowed me the run of his lumber piles to pick & choose at will. none was sawed for timber framing for sure, but i can assure you that there were very few beams or boards that had that potential. 6-7' is a longish piece off of that tree. a few longer but not much more than that.\\nwhile its very strong and hard, it's also often full of defects. it is a wood that darkens with exposure to light and air to a fairly dark brown color over time, any finish will only slow down the inevitable move from that yellow to golden honey color to dark brown. it chips easily in spite of strength. very tough on planer blades. the notion of a chainsaw mill is not something i'd lean towards. if you had a beam sawed from osage orange you best have lots of help to lift it!\\ngiven my age it was the common fence post wood on ks farms in eastern ~ third of the state & across fly over land states where it grows for a good part of my younger years until steel then pt posts caught on. be a lucky find to locate an old headgerow what with longer trunks and not been dozed down for no-till farming as they were mostly removed some years back. most any farmer there had a pile of osage post wood in line posts and corner post sizes. one of my living room lamps is turned from a shawnee co, ks corner post. the species when polished has an opalescence that reflects light similar to a mans ring- tiger-eye gemstone. i've also turned rolling pins and ladies bracelets from osage orange.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000009, "year": "2021"}, {"Unnamed: 0": 7862, "autor": "Don P", "date": 1637366400000, "content": "('Pictures and warnings get written up in builder magazines every so often, usually walls blown away, etc. That is usually a double failure, the thermostat fails and then the TPP valve, the blowoff, is frozen from years of sitting there unchecked. So the advice is to check them every so often, blow a little water and make sure it is free and then make sure it reseats, if in doubt replace it.\\nYears ago I was working on a restaurant remodel and noticed steam coming out of the kitchen floor drain. They had hard piped the dishwasher boost heater blowoff valve down into that drain and the boost heater thermostat was shot. The valve was working overtime almost constantly blowing off. Aside from the water and power waste the kitchen staff was basically working under a bomb the whole time completely unaware. But they had really well disinfected dishes .\\nI was wandering around on the net last night and came across a Stanley\\'s boiler rebuild. It is a vertical firetube full on boiler and like Al said wrapped in about 3/4 of a mile of high tensile piano wire. If the boiler was made of boilerplate steel it would have needed to be 1\" thick plate, much too heavy so the brothers came up with that method borrowed from early artillery cannons that were also wrapped, they then used I think it was 1/4\" plate. The 700 or so 1/2\" firetubes acted basically as staybolts to reinforce the ends. There has never been a boiler explosion in one of those. They ran at up to 750 psi. Typically they lose a firetube and sure enough the water/steam dumps down onto the fire quenching it, but also cracking the grate. The hydrostatic test on a boiler is holding at 125% of max pressure using water, a non compressible liquid, rather than steam. If it fails it leaks rather than popping like a balloon under steam or air pressure.\\nI saw another efficiency number saying they ran at 40-60% where an IC engine runs at about 25%.\\nApparently Abner Doble, in his late teens at the time, visited the Stanley Brothers in a steam car he had built, it had a condenser so could go long distances between water stops and was heating hot water, was a coiled monotube flash boiler design, could be fired and driven in under a minute, all things the Stanley did not have. They turned him away. I think Al\\'s description of them is probably right on. Not that the Stanley was any slouch, at 5,000 lbs it could pop a wheelie. In that article they said the driver that Al talked about was trying to best his 127 mph clocked speed of the year before. They said he was running close to 180mph when he lost it, with a kingpin suspension, pretty much driving a tractor, I cannot imagine that ride.',)", "link": "('https://forestryforum.com/board/index.php?topic=108546.msg1695184#msg1695184',)", "origin": "Forestry", "suborigin": "Alternative methods and solutions", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "('pictures and warnings get written up in builder magazines every so often, usually walls blown away, etc. that is usually a double failure, the thermostat fails and then the tpp valve, the blowoff, is frozen from years of sitting there unchecked. so the advice is to check them every so often, blow a little water and make sure it is free and then make sure it reseats, if in doubt replace it.\\nyears ago i was working on a restaurant remodel and noticed steam coming out of the kitchen floor drain. they had hard piped the dishwasher boost heater blowoff valve down into that drain and the boost heater thermostat was shot. the valve was working overtime almost constantly blowing off. aside from the water and power waste the kitchen staff was basically working under a bomb the whole time completely unaware. but they had really well disinfected dishes .\\ni was wandering around on the net last night and came across a stanley\\'s boiler rebuild. it is a vertical firetube full on boiler and like al said wrapped in about 3/4 of a mile of high tensile piano wire. if the boiler was made of boilerplate steel it would have needed to be 1\" thick plate, much too heavy so the brothers -----> came !!!  -----> up !!!  -----> with !!!  that method borrowed from early artillery cannons that were also wrapped, they then used i think it was 1/4\" plate. the 700 or so 1/2\" firetubes acted basically as staybolts to reinforce the ends. there has never been a boiler explosion in one of those. they ran at up to 750 psi. typically they lose a firetube and sure enough the water/steam dumps down onto the fire quenching it, but also cracking the grate. the hydrostatic test on a boiler is holding at 125% of max pressure using water, a non compressible liquid, rather than steam. if it fails it leaks rather than popping like a balloon under steam or air pressure.\\ni saw another efficiency number saying they ran at 40-60% where an ic engine runs at about 25%.\\napparently abner doble, in his late teens at the time, visited the stanley brothers in a steam car he had built, it had a condenser so could go long distances between water stops and was heating hot water, was a coiled monotube flash boiler design, could be fired and driven in under a minute, all things the stanley did not have. they turned him away. i think al\\'s description of them is probably right on. not that the stanley was any slouch, at 5,000 lbs it could pop a wheelie. in that article they said the driver that al talked about was trying to best his 127 mph clocked speed of the year before. they said he was running close to 180mph when he lost it, with a kingpin suspension, pretty much driving a tractor, i cannot imagine that ride.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000010, "year": "2021"}, {"Unnamed: 0": 8253, "autor": "mudfarmer", "date": 1637366400000, "content": "('Quote from: mike_belben on May 11, 2021, 12:56:40 PM\\nMF- if you put the sawbuck on the trailer it could save you a step. make kids pick and stack the pile after you braahppp it up. if no kids, make kids first.\\nGot a PM about this as well and think it is a solid idea (not the kids part). Have brought sawbuck to where I was cutting on tractor forks, filled it up then brought to where piles are before cutting and that worked great. Also turns out that one overloaded pile on that weee lil trailer = just over a sawbuck load.\\nHave an idea in mind for a wacky limb trailer that is also sawbuck.. uprights made to accept standoffs bolted to chainsaw bar (unistrut or something bolted to uprights for a channel to slide in?). Put saw bar standoffs into uprights, brappp, tip bed to dump that section of rounds, move saw to next set of uprights, repeat?? Thinking on good clamping setup that moves from one set of uprights to the next, maybe just slides along trailer rub rail like a strap winch? Basically that sawbuck but with sliding channels on uprights for saw like a bad vertical chainsaw mill and a way to clamp the pile, on wheels w/ dump capability..\\nPerpendicular stacking issues and settling aside, one 8\\' long sawbuck 32\" wide and stacked around 2\\' tall to keep center of gravity low means a face cord/rick a trip and it is easy to come up with wood to fill that in a hurry just from tops and clearing saw thinnings.\\n<edit>\\ngrabbed crayons, drew picture\\nsomethin like that anyway',)", "link": "('https://forestryforum.com/board/index.php?topic=115249.msg1820626#msg1820626',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "('quote from: mike_belben on may 11, 2021, 12:56:40 pm\\nmf- if you put the sawbuck on the trailer it could save you a step. make kids pick and stack the pile after you braahppp it up. if no kids, make kids first.\\ngot a pm about this as well and think it is a solid idea (not the kids part). have brought sawbuck to where i was cutting on tractor forks, filled it up then brought to where piles are before cutting and that worked great. also turns out that one overloaded pile on that weee lil trailer = just over a sawbuck load.\\nhave an idea in mind for a wacky limb trailer that is also sawbuck.. uprights made to accept standoffs bolted to chainsaw bar (unistrut or something bolted to uprights for a channel to slide in?). put saw bar standoffs into uprights, brappp, tip bed to dump that section of rounds, move saw to next set of uprights, repeat?? thinking on good clamping setup that moves from one set of uprights to the next, maybe just slides along trailer rub rail like a strap winch? basically that sawbuck but with sliding channels on uprights for saw like a bad vertical chainsaw mill and a way to clamp the pile, on wheels w/ dump capability..\\nperpendicular stacking issues and settling aside, one 8\\' long sawbuck 32\" wide and stacked around 2\\' tall to keep center of gravity low means a face cord/rick a trip and it is easy to -----> come !!!  -----> up !!!  -----> with !!!  wood to fill that in a hurry just from tops and clearing saw thinnings.\\n<edit>\\ngrabbed crayons, drew picture\\nsomethin like that anyway',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 8862, "autor": "JoshNZ", "date": 1637366400000, "content": "('Thanks for the links and ideas guys, very helpful.\\nI drew the whole lot today and sent off to the plasma cutters. Really going the luxury route this time.\\nI forget what I\\'ve said here already but I\\'ve decided to run it off the tractor and connect to 3pt linkage. I wrestled for days about how to gear up from a PTO crusing at ~300rpm to an external pump, but gave up on it. I\\'m just going to suck on the tractor aux and will go from there. Also just using a 4\" OD ram now too.\\nThere are lots of PTO step up boxes but they are all around 4:1 and designed for 540rpm. Like heck I\\'m going to sit there splitting with a tractor at wide open throttle.\\n300 doesn\\'t sound like that much less but it is 55%. Nearly half flow. Best idea I could come up with was a right angle mower gearbox 2:1 driving a 4:1 step up gearbox, then a big pump. But it\\'s a lot of money to spend to do the job slightly quicker on a different tractor... Chains and pulleys doing 10:1 was expensive and taking the pith too.\\nSo it\\'s gone back to a pretty basic bones model now unfortunately, I\\'ll build on it and develop a I go.',)", "link": "('https://forestryforum.com/board/index.php?topic=116352.msg1845500#msg1845500',)", "origin": "Forestry", "suborigin": "Firewood and Wood Heating", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "('thanks for the links and ideas guys, very helpful.\\ni drew the whole lot today and sent off to the plasma cutters. really going the luxury route this time.\\ni forget what i\\'ve said here already but i\\'ve decided to run it off the tractor and connect to 3pt linkage. i wrestled for days about how to gear up from a pto crusing at ~300rpm to an external pump, but gave up on it. i\\'m just going to suck on the tractor aux and will go from there. also just using a 4\" od ram now too.\\nthere are lots of pto step up boxes but they are all around 4:1 and designed for 540rpm. like heck i\\'m going to sit there splitting with a tractor at wide open throttle.\\n300 doesn\\'t sound like that much less but it is 55%. nearly half flow. best idea i could -----> come !!!  -----> up !!!  -----> with !!!  was a right angle mower gearbox 2:1 driving a 4:1 step -----> up !!!  gearbox, then a big pump. but it\\'s a lot of money to spend to do the job slightly quicker on a different tractor... chains and pulleys doing 10:1 was expensive and taking the pith too.\\nso it\\'s gone back to a pretty basic bones model now unfortunately, i\\'ll build on it and develop a i go.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000011, "year": "2021"}, {"Unnamed: 0": 10335, "autor": "Southside", "date": 1637366400000, "content": "(\"A lot of generators are rated for backup use only, add in Chinese quality control, and you have something that may not last as long as you would like if you use it on a regular basis. Spent the past 8 days helping several neighbors with issues from running these units, some we were able to come up with creative ways to keep them going, one was KIA and there was nothing I could do. One even has the fuel tank from my LT35 ratchet strapped to a ladder feeding it fuel at the moment, Macgyver would be proud.\\nFor a bit more money I would look at something like a Miller generator / welder combo, this way you get a usable tool and something that is 100% duty rated, still not considered primary power, but they will run for extended periods of time without issue. 10KW will keep you comfortable and you won't be running the unit up against the wall all the time which will keep it cooler and living longer.\",)", "link": "('https://forestryforum.com/board/index.php?topic=114176.msg1798851#msg1798851',)", "origin": "Forestry", "suborigin": "General Board", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "(\"a lot of generators are rated for backup use only, add in chinese quality control, and you have something that may not last as long as you would like if you use it on a regular basis. spent the past 8 days helping several neighbors -----> with !!!  issues from running these units, some we were able to -----> come !!!  -----> up !!!  -----> with !!!  creative ways to keep them going, one was kia and there was nothing i could do. one even has the fuel tank from my lt35 ratchet strapped to a ladder feeding it fuel at the moment, macgyver would be proud.\\nfor a bit more money i would look at something like a miller generator / welder combo, this way you get a usable tool and something that is 100% duty rated, still not considered primary power, but they will run for extended periods of time without issue. 10kw will keep you comfortable and you won't be running the unit up against the wall all the time which will keep it cooler and living longer.\",)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000012, "year": "2021"}, {"Unnamed: 0": 12010, "autor": "WV Sawmiller", "date": 1637366400000, "content": "('There\\'s a big 3 day flea market coming up with potentially lots of upscale clients so my son suggested I take a load of benches over. I figured I needed more stock so spent the day working on making some more ash benches.\\nI cut up a bunch of 3X3\\'s into 21\" leg blanks. On the right is a stack of cherry quarter round leg blanks awaiting tenons. The drill has the Lumberjack tenon cutter attached and a blank is in the vice for trimming. Everything is sitting on a stand I built on to the front of my pole barn mostly for planing lumber. I added a power plug right behind the stand. Behind and to the left you can see, Blackjack, my quality control department manager inspecting the operation.\\nI clamp a leg into the vice then partially round off one end with a drawknife so the tenon cutter will slip over. I built a few then stopped and sharpened both the drawknife and tenon cutter blades using my little Dremel tool type chain saw sharpener. They both cut much better when sharp.\\nThe next step is to cut the tenon on the end while the leg is still in the vice. My cutter leaves a 3\" long X 1.5\" dia peg with a 60 degree shoulder as shown.\\nThis took several hours but I finally finished 7 sets of legs before I ran out of blanks and stopped.\\nI moved my 3 piece curved oak set out of the shed and added another coat of Tung oil finish. Note the 5th leg I added at the back side of the curve because of the off center balance. Without this extra leg these benches wanted to tip over backward.\\nNext i went to my stock and selected some 2\" thick X 14\\' long X 15\"-18\" wide live edge ash slabs and cut 4-3\\' long pieces. This left a 2\\' long piece I need for a future project.\\nI next painted the fresh cut ends with anshorseal.\\nOne by one I started cutting the 1.5\" mortises near each corner angled slightly outward with my drill and a spade bit. As each penetrated they tried to hang reminding me of the dangerous tool thread currently active.\\nBlackjack conducts a spot inspection. Actually he and Trigger his horsey companion are eating the white oak acorns as they fall off the overhead tree.\\nI glue and insert a set of legs using the baby sledge. If the angle is not quite right I use a large pipe wrench to rotate the leg to a better angle. The tenons and nearly always slightly angled one way or another plus the mortises are hand drilled at the best guestimated angle. The Japanese pull saw is used to trim the excess from the top - another tip from another FF member that works well.\\nShows the typical excess tenon length to be trimmed off.\\nI finished 4 benches before I ran out of daylight. Tomorrow morning I will cut the next 14\\' slab and make 3 more 4\\' long benches.\\nThe only step not shown yet is to take the benches to the mill, turn them upside down on the mill, clamp them securely, set the band wide and make one pass at 17\" high and this will cut all 4 legs on each bench at exactly the same height and angle.\\nThey are ready for sale as unfinished or for sanding and staining. One lady bought one like this for a coffee table last week and I\\'ll use the 2\\' leftover pieces to make her a couple of end tables if she calls back as promised.',)", "link": "('https://forestryforum.com/board/index.php?topic=97464.msg1511661#msg1511661',)", "origin": "Forestry", "suborigin": "General Woodworking", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "('there\\'s a big 3 day flea market -----> coming !!!  -----> up !!!  -----> with !!!  potentially lots of upscale clients so my son suggested i take a load of benches over. i figured i needed more stock so spent the day working on making some more ash benches.\\ni cut up a bunch of 3x3\\'s into 21\" leg blanks. on the right is a stack of cherry quarter round leg blanks awaiting tenons. the drill has the lumberjack tenon cutter attached and a blank is in the vice for trimming. everything is sitting on a stand i built on to the front of my pole barn mostly for planing lumber. i added a power plug right behind the stand. behind and to the left you can see, blackjack, my quality control department manager inspecting the operation.\\ni clamp a leg into the vice then partially round off one end with a drawknife so the tenon cutter will slip over. i built a few then stopped and sharpened both the drawknife and tenon cutter blades using my little dremel tool type chain saw sharpener. they both cut much better when sharp.\\nthe next step is to cut the tenon on the end while the leg is still in the vice. my cutter leaves a 3\" long x 1.5\" dia peg with a 60 degree shoulder as shown.\\nthis took several hours but i finally finished 7 sets of legs before i ran out of blanks and stopped.\\ni moved my 3 piece curved oak set out of the shed and added another coat of tung oil finish. note the 5th leg i added at the back side of the curve because of the off center balance. without this extra leg these benches wanted to tip over backward.\\nnext i went to my stock and selected some 2\" thick x 14\\' long x 15\"-18\" wide live edge ash slabs and cut 4-3\\' long pieces. this left a 2\\' long piece i need for a future project.\\ni next painted the fresh cut ends with anshorseal.\\none by one i started cutting the 1.5\" mortises near each corner angled slightly outward with my drill and a spade bit. as each penetrated they tried to hang reminding me of the dangerous tool thread currently active.\\nblackjack conducts a spot inspection. actually he and trigger his horsey companion are eating the white oak acorns as they fall off the overhead tree.\\ni glue and insert a set of legs using the baby sledge. if the angle is not quite right i use a large pipe wrench to rotate the leg to a better angle. the tenons and nearly always slightly angled one way or another plus the mortises are hand drilled at the best guestimated angle. the japanese pull saw is used to trim the excess from the top - another tip from another ff member that works well.\\nshows the typical excess tenon length to be trimmed off.\\ni finished 4 benches before i ran out of daylight. tomorrow morning i will cut the next 14\\' slab and make 3 more 4\\' long benches.\\nthe only step not shown yet is to take the benches to the mill, turn them upside down on the mill, clamp them securely, set the band wide and make one pass at 17\" high and this will cut all 4 legs on each bench at exactly the same height and angle.\\nthey are ready for sale as unfinished or for sanding and staining. one lady bought one like this for a coffee table last week and i\\'ll use the 2\\' leftover pieces to make her a couple of end tables if she calls back as promised.',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000014, "year": "2021"}, {"Unnamed: 0": 13395, "autor": "Larry", "date": 1637366400000, "content": "('Stump_jumpers post reminds me of a problem I had some years ago. I traded for a slick Remington 25-06 out of there custom shop. Figured I would work up a suitable load for western mule deer at longer ranges. Spent a pleasurable summer shooting and came up with a screaming load using the 117 grain Sierra SBT. I could group less than a MOA out to 400 yards. Missouri white tail season opened and I tested the round. First day a perfect lung shot but the deer ran over 100 yards. Second day the same results. Had an exit hole about the size of a quarter. I’m not used to deer taking more than 3 or 4 steps when hit with my 6mm using the Sierra bullet stump_jumper mentioned.\\nSo...8am Monday I’m on the Sierra tech line ranting about there crapola 117 grain bullet. The technician informs me the 117 grain was designed for bigger game such as western mule deer and even elk with proper shot placement. He tells me to try there 90 or 100 grain bullet for whitetail...whole new ball game. I’m back to instant kills and extended my killing range a good 100 yards over my 6mm. Never did take the gun out west to test the 117 grain bullet. I’m quite satisfied with the 7mm Rem Mag out there.\\nGuess the moral of the story is proper shot placement along with the right bullet is a whole lot more important than the caliber. Who wants to follow a blood trail...no matter how big, for a mile?',)", "link": "('https://forestryforum.com/board/index.php?topic=28355.msg406602#msg406602',)", "origin": "Forestry", "suborigin": "The Outdoor Board", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "('stump_jumpers post reminds me of a problem i had some years ago. i traded for a slick remington 25-06 out of there custom shop. figured i would work up a suitable load for western mule deer at longer ranges. spent a pleasurable summer shooting and -----> came !!!  -----> up !!!  -----> with !!!  a screaming load using the 117 grain sierra sbt. i could group less than a moa out to 400 yards. missouri white tail season opened and i tested the round. first day a perfect lung shot but the deer ran over 100 yards. second day the same results. had an exit hole about the size of a quarter. i’m not used to deer taking more than 3 or 4 steps when hit with my 6mm using the sierra bullet stump_jumper mentioned.\\nso...8am monday i’m on the sierra tech line ranting about there crapola 117 grain bullet. the technician informs me the 117 grain was designed for bigger game such as western mule deer and even elk with proper shot placement. he tells me to try there 90 or 100 grain bullet for whitetail...whole new ball game. i’m back to instant kills and extended my killing range a good 100 yards over my 6mm. never did take the gun out west to test the 117 grain bullet. i’m quite satisfied with the 7mm rem mag out there.\\nguess the moral of the story is proper shot placement along with the right bullet is a whole lot more important than the caliber. who wants to follow a blood trail...no matter how big, for a mile?',)", "sortedWord": "None", "removed": "Nan", "score": "Nan", "comments": "Nan", "media": null, "medialink": null, "identifyer": 4000016, "year": "2021"}], "name": "with2021"}