{"interestingcomments": [{"autor": "a.noctilux", "posts": "6,037 posts", "date": "07/08/2017 12:41  PM", "content": "I am used to taking landscape at 17 mm, currently only have Summarit 50 and Elamarit 28, looking for inexpensive wide that I can also use on the Sony A7R. Would you recommend Voigtlander wide for landscape Voigtlander wide lenses, I use U-W Heliar 12mm and 15mm (in LTM mount version I) that were not usable ( magenta edges ) in M9/M240. With M10 they are \"almost\" nice when I choose Elmarit 2.8/21 profile, only a faint of magenta edges in the sky on some photos. They are cheap, small, light with very good optical quality and usable with my LTM Leica --img--  for years. But they are not for Sony A7R if not \"Kolani -----> modified !!! \". For A7R...and M10 (why not with adapters !) In those nice-and-cheap, there are better choices in SLR lenses: I use Tokina and Tamron 17mm (distortions may be a pain), Zuiko OM 18mm and 21mm, Nikkor 15mm and 20mm, etc."}, {"autor": "JonPB", "posts": "193 posts", "date": "08/04/2021 06:43  AM", "content": "For a rangefinder camera to focus accurately, both lens and camera must agree on what indicates nearest, what indicates infinity, and the curve that plots all points in between. This is because the rangefinder, unlike a view camera, SLR, or EVF camera, does not inspect the lens’ image directly to evaluate focus. Instead, one mechanism gauges distance to subject (the wheel at the top of the shutter box and the mechanics it attaches to in the camera, and the ring that moves in and out of the inside of the mount of the lens), and an independent mechanism adjusts the lens to focus at that distance (the distance between sensor and lens mount in the camera, including film plane flatness where relevant, and the movement of the optical cell(s) relative to the mount in the lens). Both systems must agree in box camera and lens to achieve optimum focus. This is a surprisingly complex problem. Possibilities that come to mind for a system that focuses past infinity in the center of the frame include: It might be working as intended. The lens might have field curvature and the lens designer optimized it to attain maximum resolution, i.e. to be in focus, in a ring around the center of the image, not the axis or corners. With recent lenses, you might look at the MTF curves; in the curve for the appropriate aperture, if the lowest dashed/solid pair of curves slopes upward from the left edge before falling down toward the right edge, then this behavior can be expected (but is unlikely to be visible when viewing the full image). It might be working as intended, part two: the lens was calibrated to place focus in the middle of the thickness of a sheet of film, but it is being used on a digital sensor which does not behave as if it has thickness. In this case, the lens is effectively focusing behind the sensor, so focusing closer (moving the lens away from the sensor) improves resolution. It might be working as intended, part three: all lenses have aberrations, some of these aberrations occur mostly in front of or behind the focus plane, and some of those are reduced when changing aperture. Removing aberrations in front of the focus plane will shift optimum focus backwards without changing actual focus at all. Designers of lenses with this focus shift behavior must choose which aperture the focus setting is optimized for. It might be working as intended, part four: our metal lenses are more responsive to temperature changes than a well-designed plastic housing, so hot or cold temperatures have elongated/constricted enough material to change focus. I haven’t heard of this in practice, though; or, if it has changed enough to alter focus, the photographer has more pressing issues. It is working as intended, part five: your demand for focus has exceeded the design specifications. This may well be expected of extreme lenses: 135/3.4, 90/2, 50/1.2 lenses or with wider aperture might be within allowable tolerances yet still not perform well together. Changing both or either might improve performance in that equipment pairing yet impair performance of the calibrated device with most other M systems. Neither are working as intended, but they both agree with each other, mostly. To make the system work, all M lenses and cameras are designed to align within a given tolerance of a certain specification. But the spec doesn’t matter so long as the parts interacting do so agreeably. This is why testing multiple items helps identify the problem: if you have lens A, lens B, and camera 1, and two of them agree with each other but not the third, most likely the third would benefit from calibration. The camera is miscalibrated for focus throw: the shouldn’t be a problem at infinity, but might be at any other distance. The camera is miscalibrated for infinity: all properly calibrated lenses tend to show the same error. Adjusting camera will improve its performance with most lenses. The lens is miscalibrated for focus throw: some lenses have been -----> modified !!!  by people who didn’t understand the system; sometimes this can be fixed by rotating the -----> modified !!!  part out of the way. The lens is miscalibrated for infinity: as above or can be adjusted with shims. The camera and/or lens are misaligned. This can be expected with devices that show significant dents, and also when using imprecise adapters. So, there can be no generic answer to satisfy this kind of problem. It is not uncommon for rangefinder shooters to learn that lens a at aperture b needs to be adjusted like so when working at distance c, and so forth. I know that this is not a satisfying answer, but it is part of the package deal when extracting such high image quality from mechanical devices of this size."}, {"autor": "JonPB", "posts": "193 posts", "date": "08/04/2021 06:43  AM", "content": "For a rangefinder camera to focus accurately, both lens and camera must agree on what indicates nearest, what indicates infinity, and the curve that plots all points in between. This is because the rangefinder, unlike a view camera, SLR, or EVF camera, does not inspect the lens’ image directly to evaluate focus. Instead, one mechanism gauges distance to subject (the wheel at the top of the shutter box and the mechanics it attaches to in the camera, and the ring that moves in and out of the inside of the mount of the lens), and an independent mechanism adjusts the lens to focus at that distance (the distance between sensor and lens mount in the camera, including film plane flatness where relevant, and the movement of the optical cell(s) relative to the mount in the lens). Both systems must agree in box camera and lens to achieve optimum focus. This is a surprisingly complex problem. Possibilities that come to mind for a system that focuses past infinity in the center of the frame include: It might be working as intended. The lens might have field curvature and the lens designer optimized it to attain maximum resolution, i.e. to be in focus, in a ring around the center of the image, not the axis or corners. With recent lenses, you might look at the MTF curves; in the curve for the appropriate aperture, if the lowest dashed/solid pair of curves slopes upward from the left edge before falling down toward the right edge, then this behavior can be expected (but is unlikely to be visible when viewing the full image). It might be working as intended, part two: the lens was calibrated to place focus in the middle of the thickness of a sheet of film, but it is being used on a digital sensor which does not behave as if it has thickness. In this case, the lens is effectively focusing behind the sensor, so focusing closer (moving the lens away from the sensor) improves resolution. It might be working as intended, part three: all lenses have aberrations, some of these aberrations occur mostly in front of or behind the focus plane, and some of those are reduced when changing aperture. Removing aberrations in front of the focus plane will shift optimum focus backwards without changing actual focus at all. Designers of lenses with this focus shift behavior must choose which aperture the focus setting is optimized for. It might be working as intended, part four: our metal lenses are more responsive to temperature changes than a well-designed plastic housing, so hot or cold temperatures have elongated/constricted enough material to change focus. I haven’t heard of this in practice, though; or, if it has changed enough to alter focus, the photographer has more pressing issues. It is working as intended, part five: your demand for focus has exceeded the design specifications. This may well be expected of extreme lenses: 135/3.4, 90/2, 50/1.2 lenses or with wider aperture might be within allowable tolerances yet still not perform well together. Changing both or either might improve performance in that equipment pairing yet impair performance of the calibrated device with most other M systems. Neither are working as intended, but they both agree with each other, mostly. To make the system work, all M lenses and cameras are designed to align within a given tolerance of a certain specification. But the spec doesn’t matter so long as the parts interacting do so agreeably. This is why testing multiple items helps identify the problem: if you have lens A, lens B, and camera 1, and two of them agree with each other but not the third, most likely the third would benefit from calibration. The camera is miscalibrated for focus throw: the shouldn’t be a problem at infinity, but might be at any other distance. The camera is miscalibrated for infinity: all properly calibrated lenses tend to show the same error. Adjusting camera will improve its performance with most lenses. The lens is miscalibrated for focus throw: some lenses have been -----> modified !!!  by people who didn’t understand the system; sometimes this can be fixed by rotating the -----> modified !!!  part out of the way. The lens is miscalibrated for infinity: as above or can be adjusted with shims. The camera and/or lens are misaligned. This can be expected with devices that show significant dents, and also when using imprecise adapters. So, there can be no generic answer to satisfy this kind of problem. It is not uncommon for rangefinder shooters to learn that lens a at aperture b needs to be adjusted like so when working at distance c, and so forth. I know that this is not a satisfying answer, but it is part of the package deal when extracting such high image quality from mechanical devices of this size."}, {"autor": "Gelatino", "posts": "1,265 posts", "date": "08/16/2021 08:47  AM", "content": "I do apologize for what I thought would have been taken second degree, so not so seriously about the -----> modified !!!  colors of the american flag, even if I must admit that when I saw the flag I have been embarrassed, although not american. I regret the tone the thread is going in. Art and flag are serious things not to joke with. About the WB of my M10, it is OK. The sunny afternoon light gave that warm yellowish tone to the whole building and not the cold grey of the link Adan gives. For information, rather than promotion the artist is David Hammons."}, {"autor": "derleicaman", "posts": "666 posts", "date": "08/16/2021 04:49  PM", "content": "7 hours ago, Gelatino said: I do apologize for what I thought would have been taken second degree, so not so seriously about the -----> modified !!!  colors of the american flag, even if I must admit that when I saw the flag I have been embarrassed, although not american. I regret the tone the thread is going in. Art and flag are serious things not to joke with. About the WB of my M10, it is OK. The sunny afternoon light gave that warm yellowish tone to the whole building and not the cold grey of the link Adan gives. For information, rather than promotion the artist is David Hammons. Thanks for your reply. Again, I didn't want to stir things up, which apparently this did. That is the problem with the internet. We totally lose nuance through typing our responses, instead of having a discussion in person. It would be great to sit with each other talking Leica with a good beer in hand, like we did on the \"good old days\"! 🙂"}, {"autor": "DigitalCypher", "posts": "3 posts", "date": "08/14/2021 04:44  AM", "content": "Advertisement (gone after registration) Sorry if this is somewhere else. Was trying to see if the front button on the M10 was able to -----> customize !!!  to toggle on and off the b&w jpeg setting? I shoot dng and jpeg. But like to shoot between color and b&w depending on the scene. Would love if there's an easier way to switch between the two without going through the menus. Thanks for any help"}, {"autor": "tobey bilek", "posts": "5,007 posts", "date": "02/01/2018 04:43  PM", "content": "MAYBE the issue is the goggles are designed for cameras with lower windows so they will not be centered on new cameras leading to off center images. I also think I read some of the lens internals interfere with body whether extended to focus close or not. Can be -----> modified !!!  I think. Notice nobody is telling you why. I sold mine and kept the Rigid ."}, {"autor": "derleicaman", "posts": "666 posts", "date": "02/01/2018 04:46  PM", "content": "My 35mm f/2 RF Summicron (goggled) mounts and works great on my Leica M10. No focusing problems, great resolution and color. I really want to know if the 50mm f/2 DR Summicron mounts and works close up on the M10. Hi Mark, Unfortunately the link above is dead. This question just came up on FB with Horatio Tan and he claims that the DR will work without restriction on the M10. I tried with my DR. It works in close-up range with the goggles, and in the normal range up to a point. It will not go out to infinity on the lens without forcing it. I also tried this with two other DR lenses, same thing. I'm sure it is some kind of clearance issue with the focusing cam on the lens and the lens shroud of the camera. Can someone like DAG -----> modify !!!  the DR to work. Possibly."}, {"autor": "Robert Blanko", "posts": "189 posts", "date": "06/13/2021 12:14  PM", "content": "Well, as we all apparently only see a snippet of the full e-Mail conversation, it is hard to guess what both parties were exchanging before... Moreover, refund of full shipping costs (for the shipping from the vendor to the customer, which seem to be in dispute) does not seem to be a clear-cut case if non-standard shipping processes like oversea shipping / international are involved and if the terms and conditions on his website are quite clear regarding the shipping costs. I never had similar problems with Angelo. But this is maybe mainly due to the fact that he never replied to my e-mail asking for a -----> customized !!!  case and that I thus never bought anything from him. 😄"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "03/10/2021 09:17  AM", "content": "I don't think that you are doing anything wrong. The exposure in your camera provides the data, whatever profile or postprocessing you are using. The problem is in tweaking your postprocessing software to handle the profile. The colour response of Lightroomis -----> modified !!!  by the profile and may well push a colour channel into clipping, even if the data are present. Observe the clipping warnings in the histogram and pull back on the exposure, contrast and highlight sliders as needed. Don't forget that specular highlights like the sun, that should not have any detail unless you are photographing sunspots, can be clipped without problem. When you have the right basic setting for the profile you use, set that as a default and make it specific for the camera."}, {"autor": "pkwok", "posts": "55 posts", "date": "08/17/2018 12:53  AM", "content": "I -----> customize !!!  the backwheel for magnification in liveview and EVF. While I use the focus button in front for EV compensation. You may -----> customize !!!  it the other way round according to your preference."}, {"autor": "pkwok", "posts": "55 posts", "date": "08/17/2018 12:53  AM", "content": "I -----> customize !!!  the backwheel for magnification in liveview and EVF. While I use the focus button in front for EV compensation. You may -----> customize !!!  it the other way round according to your preference."}, {"autor": "ggill1313", "posts": "10 posts", "date": "01/04/2021 01:45  PM", "content": "30 minutes ago, jaapv said: Yes it is valid. Such a filter will not produce discernible colour shifts on other M cameras. I photograph a lot in the tropics and my M240 was unusable without one - a strong orange-yellow shift that was very hard to correct without filter. The technical parameters that dictate a thin IR filter (thus less effective) are still present on the M10. It will be better than the M8, but far from perfect, I guess about 80% effective. Disregard the warning, and get a B+W 486 filter. They are better than the Marumi filter that Leica rebrands. Interesting points, Jaapv. I looked at another forum post here where someone shot a color chart with and without the IR filter, and there was definitely a magenta cast in the black fibers in a coat the model was wearing, and I wonder if that cast is still present in the skin tones, just more difficult to detect against a more fair complexion, but shows up/muddies the colors when working in post. To be clear, this effect is undetectable SOOC. It's only in post-processing when I begin to manipulate skin tones is it apparent. For my instance, I was attempting to saturate the face a bit, where generally I'd increase the oranges and reds. This had a bizarrely minimal effect. I then out of curiosity began pushing the other sliders, where you can see in the attached images that magenta and purple were extraordinarily present in the skin tones. Short of doing any additive correction via tools such as color grading the shadows and mid-tones to a warmer tone, it was impossible to -----> modify !!!  the skin tones in any traditional manner (HSL, even WB modification lent no additional \"detail\" to move the colors harmoniously without performing a ballet of slider adjustments so as to not cause banding after touching the oranges, reds, yellows, magentas, and purples - something I've never had to do to this degree). In any event, I will investigate whether the IR filter remedies these issues. I had only seen this issue manifest in the backlit, flared scenarios. But I've been shooting under these conditions for over a decade, on both vintage and modern glass, and have never had an issue with skin tones even in \"harsh\" scenarios."}], "name": "Angepasst"}